{
  "course_name": "Gender, Sexuality, and Society",
  "course_description": "This course seeks to examine how people experience gender - what it means to be a man or a woman - and sexuality in a variety of historical and cultural contexts. We will explore how gender and sexuality relate to other categories of social identity and difference, such as race and ethnicity, economic and social standing, urban or rural life, etc. One goal of the class is to learn how to critically assess media and other popular representations of gender roles and stereotypes. Another is to gain a greater sense of the diversity of human social practices and beliefs in the United States and around the world.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology",
    "Society",
    "Gender Studies",
    "Women's Studies",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Social Anthropology",
    "Society",
    "Gender Studies",
    "Women's Studies"
  ],
  "syllabus_content": "Classes will integrate lecture and discussion. Occasionally we will break into small groups for more concentrated discussion. Some lectures will directly engage our readings while others will integrate background historical and theoretical information.\n\nCourse Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Requirements\n\nParticipation\n\nYou must attend class and participate in discussions; this part of the course, including Reader Responses (see below), will account for 25% of the final grade. Writing Reader Responses will help you feel prepared to speak up in class; if a student does not volunteer, she or he may be called upon to speak. You are expected to keep up with all assigned readings. Students who miss more than 3 classes will lose credit.\n\nReading Responses\n\nReading responses consist of a couple paragraphs describing your reaction to one or more of the readings for that session. Do not summarize, but rather give us your response to the reading. These should take no more than 30 minutes to write. While reader responses are not individually graded, they will be factored into the overall evaluation of your performance. You will write five over the course of the term. You will be encouraged to post these on the online class forum prior to the class for which they are due to share your thoughts with your classmates.\n\nArgumentative Essays\n\nYou will write 3 papers, each counting for 25% of your final grade. The first paper will address the relationship between gender/sexuality and political economy. The second paper will discuss a socially/politically controversial topic concerning gender/sexuality. The third paper may examine the role of gender and sexuality in the construction of personal identity, and can include personal reflection. There is no final examination.\n\nGrades\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation and Reader Responses\n\n25%\n\nFirst Paper\n\n25%\n\nSecond Paper\n\n25%\n\nThird Paper\n\n25%\n\nCommunication Intensive\n\nThis is a Communication Intensive (CI) subject. Your three papers will be 7-8 pages (roughly 2000 words) each. You will rewrite the first two papers in light of the comments received on them. The revised draft is the version that will be graded. Rewriting the third paper is optional. Because this is a CI subject, you will automatically pass Phase 1 of the Writing Requirement if you receive a grade of B or better.\n\nWriting Tutor\n\nWe are fortunate to have a writing tutor for this course. You are required to make an appointment with her to discuss the progress of your first paper. You will be expected to meet with the writing tutor before submitting each draft and revised paper to the instructor.\n\nPresentation\n\nStudents will give a 5-10 minute presentation of the third paper, time limit to be determined on the basis of enrollment. Presentations are factored into the participation grade. Rehearsing is advisable.\n\nDue Dates\n\nThe first two papers are due in Lec #9 and Lec #17. You will get the papers back no later than one week after they have been handed in, and must submit your rewrite one week later (Lec #12 and Lec #20, respectively). If you plan on revising the third paper, the first version must be handed in by Lec #23. The third paper is due in Lec #25.\n\nCalendar\n\nLec #\n\nTopics\n\nKey Dates\n\nIntroduction to the Study of Gender and Sexuality: The Sex/Gender System\n\nPart I: Concepts and Themes\n\nIs Sex to Gender as Nature is to Culture?\n\nReading response due in class\n\nCultural Acquisition of Gender as Learned Behavior\n\nPart II: Gender as a Social Institution\n\nArranged Marriage and Inheritance in Agricultural and Pastoral Societies\n\nScience, Republicanism and The Woman Question\n\nHandout paper topics\n\nMake appointment to meet with writing tutor in the next couple of weeks\n\nSocial Reproduction: Reproducing Formal and Informal Class Relations\n\nReading response due in class\n\nWomen in the Global Economy (No Lecture)\n\nGender, Work and Professionalization\n\nGender and Agency\n\nFirst paper due\n\nAppetite, Image, Control\n\nPart III: Gender and Sexuality as Identity\n\nThe Invention of Sexuality-based Identities\n\nComing Out and Leaving the Closet Behind\n\nFirst paper rewrite due\n\nOther Genders/Sexualities\n\nTransvestite Lives and Sex Work\n\nReading response due in class\n\nTransgender and Transexualism in the U.S.\n\nIntersexuality\n\nDo Western Sexual Identities Travel?\n\nSecond paper due\n\nSexism, Racism and Violence\n\nPart IV: Reproductive Politics and Gendered Citizenship\n\nDe-essentializing Sex/Gender/Kinship\n\nReading response due in class\n\nFetal Images and Abortion Debates\n\nSecond paper rewrite due\n\nNationalism, Reproductive Politics and Gender\n\nMaking Modern Mothers\n\nReading response due in class (can include questions for the author!)\n\nProposal for third paper due\n\nMaking Modern Mothers (cont.)\n\nStudent Presentations\n\nStudent Presentations (cont.)\n\nThird paper due",
  "files": [
    {
      "category": "Resource",
      "title": "Gendered performance and systems of knowledge/power:  A Foucauldian analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/889b06c96b63e1bc572de7aa2768cb6a_MIT21A_213JS06_sidd.pdf",
      "content": "Courtesy of Aayesha Siddiqui. Used with permission.\nSiddiqui 1\nGendered performance and systems of knowledge/power: A Foucauldian analysis\n\nAayesha Siddiqui\nMassachusetts Institute of Technology\nKampf Writing Prize in Women's and Gender Studies, 2006\nOriginally written for 21A.231J Gender, Sexuality, and Society\nand 21A.110 Seminar in Anthropological Theory\n\nThere I sat, knees together, feet turned into one another, hands resting on the edge of the\nbed so that my shoulders were raised and I could coyly tilt my head so that it rested on my left\nshoulder. And there he sat, sprawled out on the chair, his leg languidly resting on the desk. He\nlooks at me, \"Aw, you look very cutsie.\" I slowly, distastefully shift out of my position. Cutsie?\n\nHow did I learn how to sit that way and why was it in such marked contrast to how my\nheterosexual male friend sat? And how did I find myself dressed in a low-cut camisole and he in\na tight shirt that made his toned physique strikingly evident?\n\nThese are questions dealing with the subtlety of everyday behavior, the degree of agency\nwe exercise in such behavior, and how such behavior is interpreted both by others and by\nourselves. Issues of identity - particularly gendered categories of identity - are readily\nemphasized in this discourse of performance. The ideology of external expression of the internal\nis reflected in \"the experience of one's body failing to conform to one's identity, and the\nconflicted desire to change that body\" (Heyes 2003: 1098). Thus we have come to \"construe the\nbody as a resource,\" (Gremillion 2001: 383), a tool with which a person can express his/her\nauthentic self. Yet, this identity-based approach obscures the relational experience of the body\nand how institutions of knowledge and power (Foucault 1980) have influenced and disciplined\nbehavior as a whole. Foucault reminds us to \"ask, instead, how things work at the level of\nongoing subjugation, at the level of those continuous and uninterrupted processes which subject\nour bodies, govern our gestures, dictate our behaviours, etc.\" (1980: 97, emphasis added).\nContrary to the popular capitalist ethic of self-possession (our body as our property), the bodies\n\nSiddiqui 2\ncan equally be \"vehicles of power\" (Foucault 1980a: 98), such that power creates systems of\nknowledge and expertise so that it may reinforce its power over the subject [and his/her body].\n\nThe issue in this essay is not so much whether the body is being used adequately to\nexpress a given identity, but rather, how is the body shaped by the institutions of power/\nknowledge in the context of gender, sex, and sexuality? I endeavor to show how, although\nidentity categories may shift over time, the circulation of power (Foucault 1980) and the\ndisciplining of bodies persist. I argue that personal gender performances are more readily a\nsubordination to a pervasive Foucaultian power scheme (which generates knowledge to compel\nself-disciplining) rather than exercises in self-actualization, but also that this very subordination\nis complemented and compromised by a subject's acts of agency and resistance within the given\npower scheme.\nA critique on the uniqueness of the female experience\n\nFirstly, it is critical that we demystify the exclusivity associated with the female body and\nthe pains of performance. Feminist literature has developed an increasing fixation on the female\nbody as the epitome of gender subjugation.1 The approach is reductionist, in that \"a woman's\nsexual parts or sexual functions are separated out from her person, reduced to the status of mere\ninstruments or else regarded as if they were capable of representing her\" (Bartky 1982: 130,\nemphasis added). Thus, for women in particular, the body has been problematized - readily\nacknowledged as a way of expression, but stigmatized if she acquiesces to what Bartky calls\n\"feminine narcissism,\" the \"infatuation with an inferiorized body\" (1980: 136, emphasis in\noriginal) which is \"a major articulation of capitalist patriarchy\" (1980: 135). But how is this so\ndifferent from the experience of the male body? Or the transsexed body? Or the body of any\nsubject in a given society? It is certainly important to elucidate the specificity of experience in\ngendered contexts so as to avoid overgeneralization, but I contest that such need not be done to\n\nEven alternative female gender identities are painted as victims - such as the plight of lesbian would-be mothers whose\nbodies may be interpreted as unconventional outlets for medicalized processes, e.g. insemination in lieu of sex (Lewin 1998).\n\nSiddiqui 3\nthe the point where a sentiment of exclusive victimization2 arises, as has occurred with the focus\non the female body.\n\nThough Foucault does not address gender, he indeed confronts the issue of the body: \"the\nbody is directly involved in a political field; power relations have an immediate hold upon it,\"\n(1995: 25). In crafting a feminist discourse about how the body is used and manipulated not only\nby the individual subject but by the power scheme as a whole, it is critical to understand the\nimportance of power that is central to Foucault's argument: \"power is neither given, nor\nexchanged, nor recovered, but rather exercised, and...it only exists in action,\" (1980a: 89,\nemphasis added). This goes against the popular conception of power as something almost of a\nmaterial quality, as a definitive degree of influence and control that is 'held' by key institutions\nand/or persons - Foucault urges us to conceptualize power as \"something which circulates\"\n(1980a: 98) through a \"network\" of relations (1995: 27). Furthermore, \"[w]e are subjected to the\nproduction of truth through power and we cannot exercise power except through the production\nof truth,\" (Foucault 1980a: 93). This \"truth\" is manifested through discourses esteemed as\nlegitimate, reliable knowledge, and it is such that \"power produces knowledge,\" (Foucault 1995:\n27). How does this all coalesce at the nexus of the body? Foucault emphasizes that it is simply\nnot the body in and of itself, in its corporeal form, but that:\nOne would be concerned with the 'body politic', as a set of material elements and techniques that\nserve as weapons, relays, communication routes and supports for the power and knowledge\nrelations that invest human bodies and subjugate them by turning them into objects of knowledge.\n(1995: 28, emphasis added)\n\nSuch it is that our bodies come to serve as \"vehicles of power\" (Foucault 1980a: 98). Foucault\nfocuses on the body as an undifferentiated embodiment and dynamic reproduction of\npower/knowledge schemes, and he presents the subject - the common citizen - and, by\nextension, the subject's body, as the primary nodes of power: \"Power comes from below,\"\n(1980b: 94).\n\nHis focus on the body as simply a body is not meant to devalue gender, but to deductively\n\nMy term.\n\nSiddiqui 4\nsay that gender performance is an extension of use and manufacture of the subject and his/her\nbody by the power/knowledge scheme. \"Gender proficiency\"3 becomes not only a task for the\nwoman who is compelled to wear make-up when she goes out dancing but also for the straight\nman to refrain from wearing cologne that smells like fruit or for the gay man to exhibit a sense of\nelevated fashion sense - all resonate the dilemma of what it is to be a 'proper' body, yet\nwho/what dictates this propriety? The discipline of the body depends on categories of identity,\nindeed, but Foucault would argue for the importance of the processes and behaviors themselves\nin lieu of a focus on the malleable categories of identity. As gender expectations shift over time,\nespecially in the face of different political economies, the idiosyncrasies of each gender category\nchange as well. Either achieving or being ascribed a certain category does not preclude a change\nof behaviors in order to affiliate more closely with the newly defined categorical identity - and it\nis this gender performance that results in the disciplining of the body, a body which stands out as\nan undifferentiated subject. Disciplinization escapes no individual body because, regardless of\nthe assumption of any given identity, there exists the need to fulfill that identity via performance,\nmanifesting corporeally as self-policing, and self-subscription to and internalization of\ndiscourses of knowledge that reify power systems.\nLoci of power/knowledge over the body\n\nThe processes that we engage in everyday in our performance are testament to our own\nself-discipline of our bodies. But a simple glance will reveal how the material realities of our\nperformances are strangely uniform despite individual variation: as a woman, my collared shirt is\ncut to hug my waist and bosom, while a man's collared shirt falls more slack, emphasizing the\nshoulders. Regardless, we are both wearing a collared shirt and dare not to wear a flimsy\ncamisole or seductively tight t-shirt to the office. Our gendered performances are underscored by\nthe pervasive regulation we impose on ourselves in certain spaces, negotiating between personal\n'want' and acknowledged propriety, bowing to the power of what is thinkable for all of us, as\n\nHeather Paxson's concept of gender proficiency \"entails the ongoing, everyday public negotiation of moral proscriptions for\nbeing good at being a man or a woman.\" (2004: 12)\n\nSiddiqui 5\nsocial actors:\nPower is everywhere, not because it embraces everything, but because it comes from\neverywhere...power is not an institution, and not a structure; neither is it a certain strength we are\nendowed with; it is the name that one attributes to a complex strategical situation in a particular\nsociety. (Foucault 1980b: 93, emphasis added)\n\nThe word of the expert, the declaration of the courts, the tenets of formal education, peer\npressure - all are Foucault's examples of \"what might be called 'local centers' of\npower/knowledge\" (1980b: 98) that help to explain how we come to embody a social ethos, such\nas capitalistic, achievement-driven capitalism in much of Euro-America. But how does this have\nrelevance to the gender/sex system? How is it that we may interpret gendered performances as\nhaving particular significance in this system of subordination and self-discipline?\n\nThe answers partly lie in the professionalization of knowledge, as Foucault would argue.\n'Experts' have the final say in what is definitively 'good' and the 'truth,' as \" '[t]ruth' is to be\nunderstood as a system of ordered procedures for the production, regulation, distribution,\ncirculation, and operation of statements,\" (Foucault 1980a: 133). Gremillion (2002) documents\nhow doctors treating anorexic patients may disagree with one another but proffer a final\n'diagnosis' as a cohesive entity, a \"unified, 'expert' opinion\" (2002: 405) - and in this way,\nmedical expertise becomes internalized as truth. The patient is forced to reconcile her bodily\nperception with the prescription of her doctors, and the body becomes a battleground for\ndiscipline. Her bodily performance is disciplined not only by her 'pathology' but increasingly by\nthe dictates of truth, knowledge, and power. This power allows for the \"constant surveillance and\nmanipulation of the body on a very intimate scale\" (Gremillion 2002: 388) that characterizes the\ndaily lives of patients. No one doctor nor nurse hovers over with threat of violence if the patients\nfail to eat their set number of calories, yet the patients self-govern in this particular medicalized\nsphere of influence.\n\nIn this sense, bodies serve not only as the main prop for our ultimate lived performance,\nbut also as intermediaries between the disciplinary propriety of the changing spaces in which we\nengage and degrees to which we apply certain motivations and desires in those particular spaces\n\nSiddiqui 6\nas opposed to others. For example, the desires of the patients to remain thin compromise the\ndesires of the medical staff to foster an ethos of health, yet the patients acquiesce in their own\nself-governed bodily discipline despite the contradictions. This is not to say that any given\nsubject blindly becomes the pawn of a totalizing power/knowledge system, but that there is a\ndegree of agency that the subject employs to function in a given arena of a specific power/\nknowledge discourse, as is seen in this example. The contradictions between the desires of the\npatient and the desires being mandated upon her naturally engender resistance in the patient, but\nthe key to this resistance is that it manifests within the given power/knowledge scheme, as\nFoucault offers, \"Where there is power, there is resistance...this resistance is never in a position\nof exteriority in relation to power,\" (1995: 95). Lila Abu-Liughod furthers this theme by\ninverting it and asserting that \"where there is resistance, there is power\" (1990: 42), thus\ncharacterizing resistance as the subject's [either conscious or unconscious] indication of the\npower scheme in which he/she (and his/her resistance) is inevitably enmeshed. Resistance,\ntherefore, does not directly translate to a complete rejection of the system; instead, it shows how\nsubjects manage to reconcile their own protestations within a pervasive, inescapable\npower/knowledge scheme.\n\nFurthermore, consider the popular television show Queer Eye for the Straight Guy in\nwhich five gay men (the Fab Five) re-make a straight man, both body and lifestyle. As evidenced\nby the show, professionalization need not reside in a formally recognized realm such as medicine\nor jurisprudence. In this instance, the identity category itself - that of the stylish gay man -\nfunctions as a stronghold of power/knowledge. Again, the body serves as a resource, yet it needs\nto employ other resources in order to undergo the \"task\" that the capitalistic ethos of\nachievement so trumpets. Here capitalism becomes one of those \"'local centers' of\npowerknowledge\" (1980b: 98). The gendered category of gay man, previously stigmatized,\ntransforms into a novel and reliable resource for the 'finer' things in life. That 'finer' life is\npainted as achievable, which reinforces the capitalistic sentiment of status achieved through\n\nSiddiqui 7\nindividual hard work rather than inherent worth. And to demonstrate the feasibility of\naccomplishing that achieved status [of a 'proper' body of a heterosexual man], the show\ncapitalizes off the stigmatized category of gay man as an 'expert,' showing how transformation\ndespite apparent lack of power or social capital is indeed possible if not seemingly easy. The\ndesire to cultivate the 'proper' body and lifestyle becomes integrated into a bodily performance\nof achievement, but it is that same desire that is generated by capitalism and the entertainment\nindustry's inclusion of the achievement ethic. Regardless of authenticity of identity, the\nperformance itself relies on the self-disciplining of the subject. The body becomes a vector of\npolitical economy in this sense - such that capitalistic individualism is a governing factor of the\nbody and the subject's efforts to manipulate it. The knowledge of the Fab Five channels the\npower of that capitalism into a knowledge and expertise which supersedes identity (i.e. the\nmarginalized status of the gay man) and imposes on the body of the subject an ideal way of\nacting so that the subject may achieve a status, fulfill notions of propriety, and in doing so,\nreinforce the power/knowledge scheme that esteems such things.\n\nThis knowledge/power influence flows into sexuality as well. Rubin (1984) argues how\n\"the 'modernization of sex' has generated a system of continual sexual ethnogenesis\" (1984:\n287) such that sexual categories have become communities. The body is particularly evident here\nsince it is the corporeal experience itself that defines the identity categories. But the interesting\npower/knowledge aspect of this \"ethnogenesis\" is that fragmentization of these \"erotic\ndissidents\" (Rubin 1984: 93) relies on their ostracization from the social power scheme; yet, they\nappropriate this exclusion and their bodily performance becomes a source of pride - this\nGoffmanesque transformation of stigma to community testifies to how actual behavior itself\nprovides the impetus for reorganization. The physical performance that marginalizes these\nparticular queer bodies is yet another example of resistance from within, an insurrection that\nserves not to change or disrupt the power/knowledge system but to carve out an alternative\nlifestyle using the system's own dictates: the queer communities coalesce and thrive, but in\n\nSiddiqui 8\ndoing so, highlight their peripheral status in the power/knowledge hierarchies of sexuality (Rubin\n1984). Within the community there is a supremacy of their 'perverse' performance above the\nrejected normalcy, evidencing how power/knowledge manifests within a greater scheme of\npropriety but also within subcultures of that scheme. The malleability of power, in this sense, is\nsimilar to that of identity categories in that it allows power to flow from and between groups and\nindividuals, conferring legitimacy and influencing self-consciousness and self-discipline.\nConclusion\n\nI have attempted to address how gendered performances reflect power/knowledge\nsystems and how the bodily manifestation of these performances cannot be exclusively claimed\nby women. All subjects reside in their bodies, and as the modern sense of body relies so heavily\non its capacity to serve as a resource, it is through the body that not only performances are\nenacted, but the identities solidified. These identities depend on the relational nature of\nperformance - in that our bodies serve as social intermediaries, displaying certain characteristics\nthat clue others into how they should approach us such that each performance is influenced by\nthe other performances. I have not emphasized authenticity and consistency of identity in this\npaper partly because such categories of identity are subordinate to the manufacture of truth,\nknowledge, and power, and their circulation throughout the daily negotiations of bodily self-\ndiscipline. When looking at ourselves in the mirror in the morning and deciding what we should\ndo and how we should look, questions of loyalty to our 'chosen' identities of course arise, yet we\nshould not overlook how our gendered performances rely not so heavily on these identities\nthemselves but on our consciousness of them. Being aware of what we define ourselves as is one\nthing, but having the 'will' to enact said identity, however loosely defined it may be, is another.\nThe continual policing of the body depends on our own self-persuasion, as is incorporated into\nevery decision of our lives, how we reconcile our performances with what is thinkable. Where\nthose notions of propriety emerge are based in the loci of power/knowledge and our enactment of\nshifting requisites of identities reflects a manipulation of our ultimate resource: our own body.\n\nSiddiqui 9\nWorks Cited\nAbu-Lughod, Lila. \"The Romance of Resistance: Tracing Transformations of Power Through\n\nBedouin Women.\" American Ethnologist. 17 (1): 41-55, February 1990.\n\nBartky, Sandra Lee. \"Narcissism, Femininity and Alienation.\" Social Theory and Practice. 8\n\n(2): 127-43, 1982.\n\nFoucault, Michel. Discipline and Punish: The Birth of the Prison. First (c) 1977. New York:\n\nVintage Books, 1995 ed.\n\nFoucault, Michel. Power/Knowledge: Selected Interviews and Other Writings, 1972-1977. First\n\n(c) 1972. Ed. Colin Gordon. New York: Pantheon Books, 1980 ed. (a)\n\nFoucault, Michel. The History of Sexuality, Volume I: An Introduction. First (c) 1978. New\n\nYork: Vintage Books, 1980 ed. (b)\n\nGremillion, Helen. \"In Fitness and in Health: Crafting Bodies in the Treatment of Anorexia\n\nNervosa.\" Signs: Journal of Women in Culture and Society. 27 (2): 381-414, 2003.\n\nHeyes, Cressida J. \"Feminist Solidarity after Queer Theory: The Case of Transgender.\" Signs:\n\nJournal of Women in Culture and Society. 28 (4): 1093-1120, Summer 2003.\n\nLewin, Ellen. \"Wives, Mothers and Lesbians: Rethinking Resistance in the US\" in Pragmatic\n\nWomen and Body Politics. Margaret Lock and Patricia Kaufert, eds. Cambridge:\n\nCambridge University Press, pp. 164-177, 1998.\n\nPaxson, Heather. Making Modern Mothers : Ethics and Family Planning in Urban Greece.\n\nBerkeley: University of California Press, 2004.\n\nRubin, Gayle. \"Thinking Sex: Notes for a Radical Theory of the Politics of Sexuality\" in\n\nPleasure and Danger: Exploring Female Sexuality. Ed. Carole Vance. Routledge &\n\nKegan Paul Books Ltd, pp. 267-319, 1984.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Annick Prieur’s Mema’s House",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/cd76a44d7a62e071dae85c00f37610bd_MIT21A_213JS06_memas.pdf",
      "content": "Annick Prieur's Mema's House\n\nan ethnography of contemporary Mexico City\n\nfirst, aside from my book, this is only full-scale ethnography we're reading; it's\nan example of the kind of study that is behind many of the articles we're reading\n\nso it's worth talking a bit about what it is that anthropologists do -- research\nmethodologies\nwhat is the sense that you get from Prieur?\n\nparticipant-observation -- not quantitative studies, but qualitative sense of how\npeople think about what they do\n\n\"thick description\" (from Clifford Geertz) = observations plus multiple meanings\nheld by those observed plus meanings discerned by the anthropologist within\ntheoretical and comparative context -- doing a cultural \"reading\" of multiple\nmeanings, where those meanings come from, and what implications they have for\nbehavior.\n\nany impact on research the fact that Prieur is a woman?\n\nin Mexico City, what is sexual identity based on? what sexuality-based identities are\nmeaningful?\n\nactive/passive position + gender performativity, the projection of gendered codes\n\nhow does this case complicate American notion of \"sexual identity\"?\n\n\"preferring men\" has different meaning, different implications for\nidentity\nappearance\ngender system\n\nPrieur addresses the common question: What causes homosexuality?\n\nQ: what do you make of this question itself? useful? what does it assume?\n\nis the homosexuality/desire of jotas same as that of mayates?\nis the homosexuality/desire the same between lower and middle class men in Mexico?\n\nwhat's interesting anthropologically is how people themselves, in different cultural\nsettings, construe identities based on sexuality, gender, race (which we know\nscientifically is not a valid category of biological differentiation), etc.\n\nPrieur surmises complex combination of biological, cultural and social factors that\ncrystalize into self-perceptions and identities depending on cultural context\n\nPersonal Origin Stories -- the stories they tell about themselves to explain who they are\n\nwhat is a common narrative among the jotas?\n\ninnate tendencies -- dolls, dressing in mother's clothes, fascinated by\npenises\n\nearly sexual abuse (age 6-8), possibly triggered when adults recognized\ntheir \"homosexual or feminine tendencies\"; discovery: \"liked\" it\n\nhow might we understand, interpret this?\n\n\"patriarchal bargain\"?\nclassic patriarchy = law of fathers (manliness often = abuse)\n\nsee Marta's story\n\nwhat can we discern about the cultural context in which this story makes sense?\n\nideology that all men are potentially homosexual -- indeed, percentage of Mexican men\nwho have sexual experiences with other men is significant, probably well over 50%--\nnotion that if they try passive role they might like it, and then they'd have to come to\nterms (according to jotas) with this self-realization -- tortillas who deny taking passive\nrole are \"repressed homosexuals\" -- jotas are essentializing this identity based on\npleasure/practice -- not so much a matter of choice or preference, but \"born that way\"\n\ndo mayates confirm this?\nno -- more constructivist view -- fear that they may learn that they like it (not\ninevitable)\n\nwhat's particularly problematic for the mayates about this? why the apparent denial of\npassive pleasure among the tortillas?\n\nhomosexual desire (defined as passive) = feminine gender characteristics\n\nhomosexuality is strongly linked with emasculination, not being a man\n\nactive bisexuality (penetrating men) not marked as 'homosexual' but also is not\nan open identity -- neither accepted nor stigmatized, but hidden\n\nnot \"closeted\" because not attached to inner sense of authentic self\n\nin Mexico, don't have (or only among middle classes) machos who prefer sex\nwith men exclusively and claim homosexual identity (gay) -- no \"popular\nclass\" Macho Men, hypermasculine gay men with built physique and\ncropped hair\nin Mexico, gender is a stricter binary category than sexuality, whereas the\nopposite is the case in the US\n\nwhat did you make of the jotas relationships with their families?\n\neasier for families to accept homosexual tendencies than feminine presentation -- WHY?\n\nwe've been talking about gender -- what it means to be proper man/woman, what's read\nas masculinity/femininity -- but what about patriarchy? male domination (as Prieur\nsays)?\n\nby being improper men in displaying passive femininity, reinforces idea that proper\nmasculinity is active, aggressive, dominant -- exception proves the rule\n\nin reducing femininity to sexual passivity, ideology perpetuates male dominant\nview of proper womanhood; but this is reductive, fictional -- women's\nsubjectivities are not reduced to passive sexuality\n\nhowever much jotas make of their feminine gender identity, Annick Prieur demonstrates\nthrough ethnographic observation that their gendering is more complicated than their own\ndepictions suggest -- HOW?\n\nthey're not women (can lead to health problems, violence, disillusionment)\n\nthey're not entirely not masculine -- examples of how they operate in the world\nin ways that are coded masculine?\nphysical toughness, fist fights\ncompetitiveness (whose breasts bigger, better, etc.)\n\nwhat does femininity boil down to for them? passive role in sex, ability to attract\nmanly men -- exaggerated feminine appearance -- not just feminine signs, but\nfeminine signs of sexual availability -- far from a feminist understanding!\n\nembrace certain aspects of feminine suffering -- for beauty, if not for children\nphysical fighting, masculine competitiveness, messiness\n\n- gender is not straightforward matter of personal \"choice\" (class makes a difference)\n- vestitas, in fetishizing or parodying feminine sexuality, can be seen more to reinforce\ndominant gender stereotypes (dualistic model) than to challenge them\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "de-essentializing sex/gender/kinship; querying motherhood",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/eb10440bd0d1c54b28fced7fff51369f_MIT21A_213JS06_ques.pdf",
      "content": "de-essentializing sex/gender/kinship; querying motherhood\n\nmoving to final topic: from thinking about sexuality -- as desire, behavior, identity, and\nvarious constellations of the 3 -- to reproductive politics -- not unrelated stories\n\nhelpful transition is to recall the history we traced (Katz) of contrasting sexual ethics:\n\nprocreative ethic of sex -- sex is productive of babies, producing babies is good,\ntherefore -- in this way -- sex is good\n\npleasure ethic of sex -- sex is pleasurable, can be thought of and valued apart from\nprocreation\n\nthe pendulum swings of sexual ethics (agrarianism to capitalism; post WWII baby boom\nto PlayboyTM & 60s sexual liberation) has been matter of emphasis, not absolute\ndifference -- not mutually exclusive; both available for rhetorical appeal -- certainly\ntoday:\npleasure ethic today bolstered by increasing visibility of homosexual lifestyles -- straight\npeople don't want to miss out on pleasure part -- but increasing \"abstinence-only\" sex ed\nnew voice for procreative ethic (more in couple weeks)\n\nsex can be procreative; sex can be pleasurable -- it's often neither\nwhat we're talking about are reigning ideologies of what sex \"is\" and should be, how\npeople expect to experience it, and why we should value it -- its significance as a\ncomponent of \"human nature\"\n\nmissing from this distinction (Katz) is how these competing ethics have been\ndifferentiated by - and used to differentiate -- not only along an axis of sexuality (while\nmany heterosexuals were committed to procreative ethic, homosexuals carved out\nalternative identity based on a different attitude toward sex, pleasure ethic) but also of\ngender -- among heterosexuals (once we get that category), procreative ethic has been\napplied more consistently to women than to men -- women's \"natural\" sexual desire said\nto be aimed at procreation more consistently than men's\n\nthese sexual ideologies have flip-flopped frequently enough in recent history -- even\nyour lifetimes -- not difficult to realize that sexuality -- how people experience\nthemselves and others as sexual beings -- is historically and culturally produced, shaped\n\nhowever, it may be more difficult to view motherhood in the same way -- as\nideologically produced, \"socially constructed\" -- but it's true\n\nsexuality, motherhood, marriage, The Family (capital letters) -- these are all pieces of the\nsame puzzle -- elements that some have depicted as the \"foundation of society\" or,\nalternatively, as the \"foundation of civilization\" -- a particular, exhaulted, type of society\n\nBut as Collier, Rosaldo and Yanagisako point out, \"most of our talk about families is\nclouded by unexplored notions of what families 'really' are like.\"\n\n\"Confusing ideal with reality, we fail to appreciate the deep significance of what\nare, cross-culturally, various ideologies of intimate relationship, and at the same\ntime we fail to reckon with the complex human bonds and experiences all too\ncomfortably sheltered by a faith in the 'natural' source of a 'nurture' we think is\nfound in the home.\" (first page)\n\nin other words, when we hear about families, we often stop thinking!\n\nWhy?\n\nC, R,Y suggest that b/c family has been on private side of public/private division (itself\nillusion, but with real effects for how people act) -- as a society we've failed to grapple\nwith the complexity of what goes on in the name of the family, in the name of love\n\nnot merely a matter of law, but of culture -- we don't want to see legal officials\nmake random checks of domestic settings (which of course they do when families\nare receiving state support) -- aren't a lot of checks on what happens in families\n\nAdrienne Rich wrote in her article on \"compulsory heterosexuality\": to believe\nthat intimacy is part of what a family/marriage is has also meant we often limit\nour search for intimacy to the family - can be an inhospitable place in patriarchal\nsocieties (law of fathers) for women and children\n\nof course family can also be inhospitable place for gender/sexuality non-\nconformists -- boys who like to dress up, girls who refuse to sit still or who are\noverweight, etc., coming out to parents often most difficult hurdle -- stakes are\nhigh\n\n[then again, our belief in the sanctity of the home as space of privacy has also\nserved -- eventually -- as a basis for legitimating homosexuality -- anti-sodomy\nlaws struck down as unconstitutional, infringement on privacy]\n\nIn any event,\n\nwe need to closely examine what we mean by these terms -- not just sexuality, but\nfamily, marriage, motherhood, fatherhood -- not take their meanings for granted --\nrecognize they are not transhistorical 'things', but products of particular social, political,\neconomic histories -- and therefore subject to ongoing cultural & legal interpretation\n\nTo see them otherwise, to see them as universal and fixed (as early anthropologists did),\nis to miss the specificity and maleability of our own definitions and understandings\n\nfrom article: Bronislaw Malinowski, considered a \"father\" of British social anthropology,\ndid ethnographic research in the Trobriand Islands in the south Pacific during WWI\n\nMalinowski argued in 1920s that yes, family = human universal, he was arguing against\n19th C social evolutionists with their progress narrative of human cultural evolution\n(Europeans at apex; for them, the family not \"natural\" but as cornerstone of \"civilization\"\n-- evidence of western moral superiority)\n\nMalinowsi's cultural relativism was well-intentioned\n\nBUT undermined by fact that his argument rested on ethnocentric assumptions: that\nfamily = nurturnance\nbasically, he argued that since we \"need\" nurturance, and families = nurturance, thus we\nhave families -- it's a functional definition\n\nfunctionalism theoretical framework characteristic of early British social anthropology\n\nfor Malinowski:\nbasic human needs:\n\nare met through social institutions\n\nnurturance\n\nfamily\n\nprocreation\n\nkinship system\n\nsustenance\n\nsubsistence tech, division of labor\n\nshelter\n\nhousing design\n\norganization\n\nlaw, political systems\n\ndifference = cultural variation in ways humans meet basic needs (hunting/foraging v.\nagriculture? patrilineage v. matrilineage?)\nsimilar to how gender in 70s was seen as cultural variation of biological sex difference --\ncultural elaboration of gender difference was a social \"need\" more or less\nfunctioned same way everywhere\n\nfor Malinowski, \"family\" mapped onto:\n\n1) distinct and bounded group distinguishable from other such groups\n\n2) group located in physical space -- hearth and \"home\"\n\n3) shared affective bonds, particular set of emotions\n\nfamily = conflation of genealogy/household/emotional intimacy\nCollier et al. point out that this is informed by Victorian public/private division\n\nit's ethnocentric to claim \"they're just like us\" when argument based on reading our\ninstitutions and values onto their practices\n\nsimilarly, as we've seen, sex/gender system itself to some extent ethnocentric: implies 2-\nsex model of binary gender difference\n\n(other cultures recognize other possibilities -- perhaps 3rd sex/gender, perhaps\nblending of binaries)\n\nproblem of functionalist thinking: \"because a social institution is observed to\nperform a necessary function does not mean either that the function would not be\nperformed if the institution did not exist or that the function is responsible for the\nexistence of the institution\" (73)\n\njust because we can describe it, \"see\" it, doesn't mean that's what's going on\n\nSO, instead of asking, is The Family a human universal? Need to ask: What do we mean\nby family? (is there A Family?)\n\nInstead of assuming all mothers are by definition, or by nature, nurturing and loving, we\nhave to ask: What does nurturance look like? Does it look different under different\ncircumstances? What is mother love? What makes a mother?\n\nInstead of assuming all children better off with biological mothers, or that they \"need\"\nboth a father and a mother, we need to ask: What do we mean by \"real\" mothers? What\ndistinguishes fathering and mothering? Is what makes a \"good\" father similar to \"good\"\nmothering, or different? Are both equally nurturing? If a woman who isn't biologically\nrelated to a child can mother, can a man mother?\n\nremaining readings for today are about 3 quite different ethnographic cases that raise\nsimilar questions, engage similar issues -- questioning assumptions about \"real\"\nmotherhood and \"real\" families\n\n1) selective maternal neglect of poor women in Brazilian shanty towns (Nancy Scheper-\nHughes)\n2) mothers of children with disabilities in upstate NY, struggling with status as \"real\"\nmothers (Gail Landsman)\n3) transracial and international adoption (Christine Ward Gailey)\n\neach of these cases calls into question common assumptions among Americans about the\nmeaning and experience of motherhood -- as definition and lived reality\n\nhave to understand this in context of wider meanings of personhood, love, agency,\nmarriage, family\n\ndivide you into 3 GROUPS to collectively analyze these case studies\n\n- what assumptions that you held (or see as commonly held) were revealed to be\nassumptions? overgeneralizations?\n- how do gender, sex (action), sexuality (identity) come together in this case -- or not?\n- what do we learn about families, mothering, nurturing -- what these are/aren't?-- how\nmight case study push us to rethink general understandings about what makes a\n\"real\" family or counts as \"real\" mothering? -- implications for current debates?\n\n- other things you found interesting, challenging -- agreed/disagreed with analysis\n\nScheper-Hughes\n\nlearning to mother means learning when to let go, but also when it's safe to love\n\nmotherhood is ascribed, not achieved, status -- if God wills\n\nsocial production of indifference\n\nmothers' reactions to infant mortality not autonomously authored\n\ntempered by indifference of State (barely registers these deaths, or lives)\n\nand Church (which once celebrated child death and now wants to deny it\n-- while also withholding contraception and abortion)\n\nmotherhood is socially produced -- not just \"feelings\" of \"bonding\" but shaped\nby contingencies, necessities (poverty)\nlike feelings for another woman = only understood in terms of desire\n\ncontrast with the social production of interest in US\n\na woman who chooses not to subordinate own interests to fetus is \"unnatural\"\n\nLandsman\nsocial production of interest -- if a woman follows prenatal advice, should have\ncontrol of outcome -- motherhood is achieved status, in our control....but not\n\nrites of passage lacking with non-normal infant -- not \"real\" mother\nshows social construction of motherhood -- rituals do help constitute it\nfailing that, these mothers go on to be super-achieving mothers\n\n\"learning\" from child, not just teaching it\n\nGailey (white mother of a black child who had been abused by foster parents)\n\"adoption is the result of two violations of natural motherhood [in US]:\nprocreation without marriage and nonprocreation within marriage. So the U.S.\nadoption triad has two failed mothers and a rejected or substitute child as the\nmajor players\" (22) -- how does that characterization strike you?\n\n- often, \"natural motherhood\" script not extended to birth mothers in adoption,\ntransformed into \"bad mother\" -- sexually active, able to procreate, but unable or\nunwilling to nurture; irresponsible; portrayed as victim (raped?)\n\nmyths of mothers who give up child for adoption\n\nin reality, 2% unmarried births --> adoption; women who give up babies\nfor adoption higher education and class aspirations than women who keep\n\n- other side: similar to mothers of children with disabilities (especially \"difficult\nto place kids\") -- the harder the child rearing, the more they become \"real\"\nparents -- achieved motherhood -- thrilled when they \"earn\" affection of child\n\ncontrast to international adopters more likely to \"return\" child for \"failing to\n\nbond\" -- entitled to immediate love a child (paying for it!?)\n\nironies of how placements are made?\n\n\"difficult\" children -- older, survivors of abuse, w/disabilities -- placed\nwith single parents, black parents, interracial parents\n\nthe kids who need the most help placed with people with fewest resources\nWHY?\nstratification of social reproduction -- reproducing class status from one\ngeneration to the next\n\nWhat do we learn from the juxtaposition of 3 cases?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "do western sexual identities travel?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/0706b3fe767af300edd420275ad56105_MIT21A_213JS06_other_iden.pdf",
      "content": "do western sexual identities travel?\n\nare our categories and assumptions about the meaning of sexuality, developed in the\nUS/Western Europe, applicable to non-western settings?\nor do they obscure our understanding of sexuality elsewhere?\n\ncan insights from other cultural settings be brought back to shed light on the possible\nlimitations of our own assumptions about sexuality, gender, identity here in the US?\n\nAnick Prieur's book offered our first pointer -- men having sex with men doesn't have\nthe same meaning in terms of identity, gender, sexuality in Mexico and in the US\n\nSwarr and Nagar's article on experiences of women in same-sex relationships in India\nand South Africa -- clearly argue that the vocabulary, assumptions developed in western\nacademic contexts do not necessarily do justice to these women's experiences -- speak to\ntheir concerns\n\naccording to Swarr and Nagar, what are limiting assumptions of western feminism,\nregarding lesbianism?\n\nwestern feminism tends to view lesbianism first and foremost in terms of desire --\nin the \"west\" there's an increasing emphasis on external expression of inward feeling, as\ncaptured in \"coming out\" narratives -- but in Third World contexts (or rural, working\nclass contexts of US) this can be overshadowed by NEEDS -- economic survival, social\nsurvival (including threat of violence)\n\nwestern theorizing of sexuality has focused on the INDIVIDUAL -- as unit of analysis\nvaluing of autonomous individual authoring her own destiny (achievement)\nbut in many parts of the world, local ideology cannot separate individual from FAMILY,\nCLAN, COMMUNITY -- shared resources, shared status, shared survival strategies\n\nthis contributes to subjective experience of even something as \"private\" as sexuality\n\nthey write, \"we seek to reconceptualize desire itself not as innate or inherent but as\nemerging in conjunction with processes such as development, neocolonialism, apartheid,\nand liberalization\" (495)\n\nfrom reading, can you explain what they mean by offering example, illustration of \"how\nthe politics of intimacy, sexuality, and access to resources intertwine in everyday lives\"?\n\nstories of Geeta and Manju in Chitrakoot, India; Cora and Phakamile in Soweto, SA\n\nwhat \"take home messages\" did you get from this article?\n\n- even poorest women in most patriarchal settings are not bereft of sexual agency -- they\ntoo have emotional lives -- not just prerogative of the privileged\n\n- complexity of identity questions -- not just \"intersectionality\" (gender / sexuality / race\n/ class), not just carving identity into different slices of pie\n\n- problem w/ identity politics: experience isn't strictly based on who we are\n\nalso our personalities, our family relationships, our luck in love - things\nthat are never given demographic boxes\n\n\"extending intersectionality\" means reconceptualizing \"difference\" with reference to\nmaterial and emotional specificitites -- from struggles over rights (do women have full\ncitizenship? is homosexuality legally recognized?) and resources (can women have\nexclusive access to money they earn?) to intimate relationships (family support?\neconomic strings attached [jotas]? friendships, emotional support?) -- sorts of\nrelationships \"people enter into with or without labels\"\n\n\"sex for money\" in Papua New Guinean Huli, Holly Wardlow\n\nterminology: from prostitution to sex work to sexual networking & survival sex --\nwhat different meanings implied in these terms?\n\nsex work emphasizes labor component (safe, legal, fairly paid)\n\nincome-generating activity rather than totalizing identity\n\nreducing stigma\n\nbut still embedded moralization: if \"work\" then has to be acceptable, even\nperhaps virtuous (especially if supporting kids)\n\nof course, even these caveats can't be generalized\n\nagain: can't assume that similar-looking practices (women and men having illicit,\nhidden, one-off sex after which man gives woman some money) mean the same\nthings in different places\n\nin Wardlow's interpretation of Papua New Guinean Huli \"passenger women\", economic\nfactors -- scarcity, poverty -- alone cannot account for or fully explain commoditized\nsex\n\nthese women aren't exchanging sex for money strictly out of economic necessity\nwhy, then?\n\nresistance against restrictive feminine roles tied to reproduction\nanger and revenge against male kin who do not behave\n\nagain, use of personal narratives to illustrate how identities are produced through\ncombination of broader social forces and idiosyncratic personal factors\n\nOgai's story\n\n2 of 18 were women whose fathers killed their mother or older sister; wanted to make\nthemselves unmarriagable so fathers wouldn't profit from their bridewealth\n\nHOW does the PNG case help us realize the cultural logics behind common\ninterpretations of prostitution/sex work in the US -- make it thinkable, even 'natural'\nwhat are assumptions of our cultural logic?\n\n1) women = sexually desirable objects (men's desire is active force)\n2) sex as a commodity -- object of desire men willing to purchase, and from other side,\nact of sex = compensable labor (\"oldest profession\") in which men are purchasers\npublic/private -- sex for $ = intimate, emotional\n\nwhy don't these cultural logics help make sense of PNG situation? not applicable?\nideology of desire\nmen are the objects of desire -- cultivate beauty to attract women\nwomen, not seen as naturally beautiful, must often resort to magic to attract men\n\nwhat about the men? what are they paying for?\n\nsometimes nontraditional sexual practices would never ask of wives\n\nmore, paying for 'modern' masculinity -- men are resisting sexual taboos,\nbased on procreative/kinship ethic\n\npassenger women say that when a man offers $ for sex, evidence that he's so\nconsumed with desire that he's overcome his fear of women and their\nvaginas -- out of gratefulness rather than contempt -- which women read\nas their \"vanquishing\" of men\n\nwith these cross-cultural comparisons in mind, return to Q:\n\nwhat's problematized around gender/sexuality in contemporary US? what are the\nquestions asked of ourselves and of each other? assumptions within which current\ndebates about gender/sexuality -- from sexual identity, to transgender, to commoditized\nsex -- are articulated?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "follow-up thoughts from last time",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/49138d2e609c8eb5f998aa5affb2e970_MIT21A_213JS06_gndr_sexua.pdf",
      "content": "other ways of conceiving gender/sexualities\n\nfirst, I want to underscore the point that not only are identity categories oversimplified,\nindividual identities are not necessarily stable -- may not plot on graph as single dot\n\nthis is why anthropologists like Weston talk about the uses of gender, gender-typed\nqualities: men and women make use of both femininity and masculinity\n\ndoes it make sense to speak in similar way about sexuality? uses of sexuality, sexuality-\ntyped qualities?\n\nreadings for today:\ndifferent articulations between categories of gender and of sexuality\n\nGilbert Herdt\nwell-known anthropologist, studied Sambia in Highlands of Papua New Guinea in 1970s,\nwith return trips throughout the 1980s; now heads Human Sexuality Program, San\nFrancisco State U.\n\nhis work addresses\n1) the role of ritual in gender/sexuality\n2) the multiple ways gender/sexuality can be interrelated\n3) distinction b/w sexual acts and \"orientations\" (as identity)\n\naccording to Herdt, the Sambia can be said to have a sex/gender system -- strong binary\noppositions between male and female, accompanied by a strict gender division of labor\n-- but they do not not have an equivalent sexuality/gender system\n\ninstead, male sexuality and female sexuality not equivalent categories\nfemale = natural and heterosexual (orientation, acts)\nmale = cultural and sequentially bisexual (first homosexual, then heterosexual)\n\nfirst, notable that they regard females as more naturally \"complete\" -- less in need of\nritual elaboration (seemingly different from European traditions)\n\nwhy?\n\n\"ritualized male homosexuality\" -- secret rites, hidden from women (they don't know)\n\nif blood makes femaleness, semen makes maleness and must be ingested,\nculturally acquired through initiation rituals\n\nFILM CLIP\n\nfor all he narrates rituals as \"men making men\" or \"masculinizing men\" there's quite a bit\nof feminine imagery!\n\nindeed, sex-segregated initiation rites and male homosocial/homosexual events are\ninfused with feminine elements -- gender isn't absolute difference in ideology here\n\nsemen = mother's milk (\"when the semen falls into my mouth, I think it's the\nmilk of women\" -- easily identified as homosexual experience?)\n\npenis = flute; breast = flute\n\nflute is animated by female spirit [male body is vessel; again, seeming inversion]\n\nand the ritualized insemination necessary to make \"real\" men prepared to\nsurvive heterosexual encounters with women for procreation!\n\nritual embodies contradiction (ideology is never seamless)\n\nultimately, what's ritualized here is male prestige, rather than sexual orientation or\nessential gender differentiation\n\nAnnick Prieur's Mema's House\n\nlet's get a handle on the terminology:\njoto = (passive) homosexual, prefers men exclusively and usually passive role\njota = feminine passive homosexuals (\"queens\")\nvestida = jota who consistently dresses as woman\n\ncore of these definition is preferring passive role, in keeping with feminine\npresentation -- ideological link b/w position and appearance\n\nfemininity in man suggests wants to be penetrated\nmasculinity suggests wants to penetrate\n\nmayate = masculine men who penetrate jotas + also have sex with women\n(external label -- they would simply call themselves 'men'; acts = identity)\n\ntortilla = mayate sometimes takes passive position with men, sometimes active\n\nbisexual = tortilla = internacional = alternating active/passive roles\n\n[implicit -- if take active role with men, then will also have sex with women]\n\nbuga = term used by homosexuals who designate men they think only have sex with\n\nwomen; only penetrating role; also used to describe manly men, macho\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "gender acquisition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/324ee107ee594e71f6efd4966e29e3b5_MIT21A_213JS06_learning.pdf",
      "content": "gender acquisition\n\nturning to sociological and anthropological approaches to the study of gender: think about\nhow gender as a source of individual identity intersects with gender as a social category, set\nof relationships\n\nhow do individuals learn gender -- that they ARE gendered (have a gender) and how to live\nup to expectations for what this means? how do ideas about gender get reproduced -- and\ntransformed -- from one generation to the next?\n\nrecognition that gender is learned behavior beginning from 1950s insight of Simone de\nBeauvoir, \"One is not born, but rather becomes a woman\" (or man)\n\nBUT this can fall back into sex:gender dichotomy -- we are born \"in nature\" but develop\n\"through culture\"\n\nWE want to keep in mind caveat learned from biologists, that \"nature\" and \"culture\" are\nNOT entirely separate, independent domains -- i.e., to talk about \"culture\" begs for\nconsideration of the physiological or supernatural/divine (both of which can be aspect of\n\"nature\" -- \"human nature\") -- as Ruth Hubbard demonstrated, culture is not just thought\nand enacted, but embodied\n\nhow is gender learned? and how does it come to be embodied? to shape our bodies?\n\n1) socialization, by\nA) example (mimicking)\nB) elicitation (how children are treated, rewarded/punished)\n\n2) ritual -- formalized laying out of cultural principles, norms for behavior, aesthetics, etc.\nbaptism, debutante ball\n\nin any culture, these are related to local theories of human nature, including scientific and\nreligious ones\n\nreadings for today, from A World of Babies -- posing the question, \"what if Dr. Spock lived\nin Micronesia or Bali?\"\n\nexplaining socialization in terms that are consistent with local, cultural ideas of natural\nprocesses (material and divine) and of personhood\n\nQ: what did you find interesting in these pieces, reading them together?\n\nthemes:\n\nrelationship to spirit world\n- Do babies have the devil in them, or are they divine?\n\n- nature/nurture -- both cultures recognize interplay; indeed, doesn't make sense to try to\nseparate them\n\nBali: reincarnation of ancestor's soul, contributing factor\n\npersonality and character shaped by day of birth\n\nIfaluk: spirit world is ever-present -- in procreation, in whether infant will survive\n\n- how to teach infants, small children proper behavior?\n\nemphasize managing emotions (without apparent distinction b/w boys/girls), although for\ndifferent reasons -- similar practices can have different meanings\n\nBarrie Thorne's social psychology piece on gender socialization in US\n\nThorne takes up the questions (from Euro-American cultural perspective)\n- \"what's in children's nature\"?\n- how is gender learned, how does gender socialization happen?\n\nobservations in a co-ed pre-school class\n\nfound that kids internalize adult expectations and reproduce them amongst themselves\n\nBUT they internalize these only to an extent -- we can see dichotomies in kids' interactions,\nbut we can also see them bridging the divisions -- sex play, gendered play, is more fluid\nthan is often represented by toy stores, parents, teachers\n\nparents' insistence that they didn't make their kid stereotypically boy/girl -- if I didn't try to\nideology is never totalizing -- masks fissures, tensions, contradictions, exceptions\n\nmuch of it has to do with adults seeing what we expect to see, not noticing -- or\naccording social significance to -- behavior that challenges norms\n\ninsight: we should look for gendered practices, not gender roles -- see distinction?\n\nhow individuals use gender creatively, strategically v. how gendered individuals act or\nbehave (phrasing question that way inevitably leads to overgeneralization)\n\nlet's talk more about RITUAL\n\nRites of Passage\nritualized occasion of transition from one status, social position, age to another\ncan be seen to happen at a variety of scales\n\nparadigmatically in \"life crises\" - such as? pregnancy, childbirth, death, marriage\n\nadolescence (Mead)\n\n3 phases of a rite of passage (from Victor Turner, elaborating Van Gennep):\n\n1) separation\n\nphysical separation of individual from rest of society\n\nsymbolic separation from past\n\n2) transition (the liminal period; margin)\n\n\"betwixt & between\"\n\nneither old status nor new one; statusless, identityless\n\n\"no longer classified and not yet classified\" - nonperson\n\nthis is the stage he elaborates -- gaining of secret knowledge; training\n\noften symbolic cleansing / rebirth (bloodletting)\n\n3) (re)incorporation\n\nreturn to society, but in new position, with new status & new obligations & rights\n\n- new roles\n\ne.g., birth (transition for mother to certain kind of female adulthood; also for baby)\n\nDISCUSSION QUESTIONS:\n\n1) re-narrate Ifaluk birth as a Rite of Passage -- what elements fit the 3 stages?\n\n2) what \"rites of passage\" are used to frame transitions related to gender/sexuality in the US?\n\nwhat are defining rituals in \"making\" a boy/girl? or graduating to adult man/woman?\n\nwhat do these rituals say about \"what's in children's nature\"?\n\n3) what other rituals teach lessons about appropriately gendered behavior, values?\n\nsum up: learning gender -- as an aspect of child socialization -- happens not only with\nreference to ideas about biology (sex) -- but ideas about cosmology, procreation, what it\nmeans to be human; basic moral values; notions of personhood\n\nis individualism or communalism stressed?\nis being nurturing seen as gendered, or not?\n\ninfant care practices reflect this set of beliefs -- directed at protecting the life of children, but\nalso to guide children toward becoming accepted members of their societies\n\neg: co-sleeping or separate beds/rooms -- reflects moral values -- developing\n\nindividualism, independence, or reflecting sense that isolation = loneliness and that\ncan lead to illness\n\nALSO, we can't talk about becoming a boy/girl, man/woman without specifying becoming\nan Ifaluk man/woman, Balinese man/woman -- a 'high status' Balinese man/woman. Etc.\n\nTUESDAY -- start to put this in a historical frame, and link personal categories of identity\n-- girl/boy -- to political categories of social groups -- women/men\n\nread first 125 pages of Middlesex, plus articles\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "gender and status in agrarian societies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/f2ad19fa03179bddfb66fd58a113c3b3_MIT21A_213JS06_gndr_agra.pdf",
      "content": "gender and status in agrarian societies\n\nlast time we talked about modes of gender acquisition: socialization, ritual -- ways that\nkids learn there's a significant distinction between girls and boys -- put in different\nclothing (especially for important occasions), ritualized differentiation (counting off\nboy/girl for dodgeball). And they learn that to be a good girl/boy often means not acting\nlike the other -- \"big boys don't cry\" (meaning that girls do); girls should sit with their\nlegs closed (meaning boys don't have to).\n\nif gendered rituals make meanings explicit, the power of gender socialization (as\nopposed to formal ritual) lies in its implicitness, often glossed as \"common sense\" --\n\"just the way things are\" without explicit reason given: share a sense of what is meant\nby \"boys will be boys\", \"be a good girl\"\n\nwhile powerful, kids internalize gender lessons only to an extent\nthere's often a gap b/w social reality and ideology\n\ndefinition of ideology: official story told, retold, to articulate and, perhaps,\nexplain status quo, often inequality; dominant norms, values sedimented in our\ninstitutions, ritualized in public events, elicited by others\n\nin patriarchal societies, gender ideology buttresses male prestige\ni.e., masculinity often more valued than femininity; gender-neutral = masculine\nrather than feminine, like \"tomboy\"\n\nand, as we'll start to see in our readings, gender ideology can also reinforce other\nforms of social inequality: racism, class hierarchy\n\nBUT ideology is never totalizing, never complete story -- again, masks fissures,\ntensions, contradictions, exceptions\n\nmuch about gender ideology 'evidenced' in childhood has to do with adults seeing\nwhat we expect to see, not noticing -- or attaching social significance to --\nbehavior that challenges norms -- AS we'll see in Middlesex\n\nSO, to understand gender, cannot merely ask \"how men/women act or behave\" (assuming\nthat there is a meaningful difference) but rather at how individuals use gender ideologies\ncreatively, strategically -- or, perhaps, self-destructively\n\nthis is an argument Jane Collier makes\n\np. 101; \"To understand conceptions of gender, we cannot look [merely] at what\nmen and women are or do, but rather must ask what people want and fear, what\nprivileges they seek to claim, rationalize, and defend.\"\nand how they use gender to do so\n\nthis week and next we'll study historical shifts in gender ideology -- and ways that people\nhave maneuvered within those ideologies to make status claims, in European/American\nsocieties\n\nreference HANDOUT (factors affecting gender roles) -- use it to assess not so much\ndegree of gender inequality -- more/less patriarchal -- but primary ideological reasoning\nfor gender inequality in different cultures and societies\n\nbeginning with subsistence base -- economic system (h/f; agrarian; chattel slavery;\nmarket capitalism) points to labor and resource allocation as basis of social inequality\n\nnext couple classes we'll look at rise of capitalism and how that affected gender and\nsexual relations\ntoday we'll talk about early modern agrarian Europe (Greece, Asia Minor; Spain)\n\npairing Jane Collier and beginning of Middlesex, which is historically and culturally well-\nresearched\n\nlooking at handout, we should be able, on basis of readings, to say something of agrarian\nMediterranean about #s 1-5 -- and more, about how these are related to one another\n\n1) subsistence base -- contributions to material needs of group\n\nproductive labor; division of labor\n2) distribution & exchange of goods & services\n3) child-rearing\n4) sexuality\n5) symbolism & ritual\n6) extraordinary events (who deals, and how, with unexpected crises, illness, etc.)\n\n...\n\none key site where these factors intersect is\nFEMALE CHASTITY (premarital virginity + marital fidelity)\n\nWHY, according to Collier, do we often find a preoccupation with female chastity, sexual\nmodesty, in agrarian societies? (also pastoral ones -- where subsistence based on herding\ncattle, camels, etc. -- middle east, east Africa)\n\nCollier: \"To question the chastity of a man's mother is to question his right to the status\nhe claims as his. In such a world, women's bodies appear as gateways to all privileges...\nThe status and reputation of a family thus rest on the degree to which its women are\nprotected from penetration--by women's own sense of sexual shame, by being locked\naway, and/or by the courage of family men in repelling seducers\" (101)\n\nthis exemplifies one way in which gender is a vector of social status, and therefore, of\ninequality/hierarchy -- this is Collier's thesis\n\ndefinition of status of an individual = rights due to and duties expected of one; person's\nposition relative to others (usually hierarchical in some way) in same society\n\n2 basic types of statuses, having to do with recruitment\n\nascribed: assigned to individual, often (not nec.) from birth (e.g., lineage)\n\nachieved: gained through special effort or choice; requiring special knowledge, skill,\nqualities (e.g., occupation) and that are regarded as responsibility of individual\n\ndo you think gender is better viewed as an ascribed or achieved status?\n\nsome statuses can be either ascribed or achieved -- marriage (arranged or chosen)\n\nagrarian societies tend to emphasize ascribed statuses (clan, age, arranged marriage)\nhow does Collier explain this?\n\ncapitalist societies clearly based on ideal of achieved statuses (educational degree,\noccupation, chosen marriage)\n\nhow are differences and inequalities explained?\n\nstatuses, whether ascribed or achieved, imply roles -- refers to the dynamic aspect of\nstatus; what people do and how they do it, what relationships with others they engage in,\nas person of particular status position\n\nall statuses must be maintained through proper performance of roles\n\nCollier is describing a shift in ROLES attached to PROPER WOMANHOOD\n\nwe'll continue discussion of this historical shift tomorrow\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "GENDER, SEXUALITY & SOCIETY",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/1843c3059eed1fdc30425c86d776d2cd_MIT21A_213JS06_opening.pdf",
      "content": "GENDER, SEXUALITY & SOCIETY\nWhat is GENDER?\n- the characteristics, traits that differentiate men and women -- behavioral,\naesthetic\n- what it takes to be good at being a man/woman\n- it's a relational category -- gender is not a euphemism for \"women\"\n- includes value judgments, positive and negative, associated with masculinity\nand\nfemininity\n- things other than people can be 'gendered' -- an outfit, a color (blue/pink), a\nsport\nthe analytical concept of gender was introduced in the 1970s to indicate the social roles,\ncharacteristics, and values assigned to males and females in a given society; gender\nunderstood as historically and cross-culturally particular\ngender is social, not natural, not fixed in nature -- biological or cosmological\nimportant implication: gender hierarchy, patriarchy, is thus social, not natural --\nnot inevitable\nsex/gender system of difference (sex = biology + gender = social norms)\nnature/culture\nthis meaning of gender has entered public, commonplace understanding\nin this class, we will use 'gender' to mean social, cultural expectations and actions;\nand 'sex' to refer to physiological characteristics\nHOWEVER, it's important to note that the sex/gender system has been challenged\ntheoretically\nwe won't be talking about gender as simply the cultural elaboration of fundamental\ndifferences, given in nature, between women, as a whole, and men, as a whole\nand we'll begin on Monday with a discussion of why the sex/gender system, while useful,\nis inadequate for the task of understanding what it means to be a man/woman\nreadings for Monday, by biologists, will explain why -- come to class with a few\nsentences, drawing from the articles, with at least 2 arguments about the analytical limits\nof the sex/gender system\nNOW let me ask --\nWhat is, or what do we mean by, SEXUALITY? (as opposed to sex difference)\n\nsexual desire, as an aspect of human nature\n(hormones, bodies as well as feelings, thoughts)\nsexual acts, practices, behavior -- what people do sexually -- within social\nrelations, relations that may be characterized by hierarchy, inequality\nsexual orientation -- personal identity (gay, straight, bi) based on the gender of\none's generalized object of desire\n\"sexuality\" has to do with all of these, how desire, practice and identity are\nbundled together, in various ways\nSO, in this course we'll seek to make sense of:\n1) variety in what it means to be, to live as, man/woman, historically and cross\nculturally\nreadings will focus largely on the U.S., but will take us around the world\nmasculinity and femininity -- traits, characteristics, objects associated\nwith men/women -- do not mean the same thing everywhere, and are not\nvalued in the same way everywhere\nmoreover, what it means to be woman/man differs not just based on social,\ncultural context, but on one's relative position within society\nin U.S., how people experience gender, sexuality is very much informed by\nsocioeconomic class, race or ethnicity, religion, age\nSO, we'll talk about differences w/in as well as b/w cultures, societies\n2) variety in sexual desires, practices -- and how and why they are socially\naccepted\nor stigmatized\nagain, incredibly varied around the world -- from sexual modesty of\nMuslim women in Middle East to ritualized male homosexuality as part of\ninitiation ceremony in PNG\n3) reproduction of symbolic and structural inequalities between men and women\nwhat is patriarchy? how does it work? is the US still a patriarchal society?\ngender is an economic, as well as a social, emotional relationship\n4) homophobia and heterosexism -- social pressure to conform within binary\nsystems of identity\n5) sexual violence, misogyny (including internalization of psychological\nviolence)\n\n6) resistance: gender bending: sex change surgery, cross-dressing, hermaphrodism\nchallenge gender binary m/f? or reinforce it in new ways?\nmalleability and infinite variety of human behavior -- and different ways this behavior is\nbundled into a sense of identity, attached to morality, used to legitimate social inequality\nthis class is cross-listed with anthropology -- I'm an anthropologist -- and we'll focus\n(though not exclusively) on an anthropological approach to study of gender and\nsexuality.\nwhat is this?\nstarting point is CULTURE\nencompasses both the things people make, do, believe\nand is a frame of reference -- the conceptual vocabulary through which we perceive\nthings,\nthat gives meaning to what we make, do, believe\nwe don't just HAVE culture (traditions like Mexican quincinera or male circumcision),\nwe THINK and DO culture -- it's the WAY we give meaning to things\nEX: it's not only the BarbieTM Doll that's cultural, but what we do with the BarbieTM Doll\n--\ndutifully dress it up for a Malibu beach party?\nor hack off its hair and stick pins in its eyebrow?\nCulture dictates and reproduces social norms. But it also provides opportunities for\nsubverting, resisting, messing with social norms -- especially important to recognize\nhow this works in terms of gender: dominant cultural norms, expectations are important,\nbut even more important is how individuals interpret those norms, bend the rules of those\nnorms, in their everyday life\ngender and sexuality, like culture more generally, are both codified by tradition,\nand also improvised in daily life\nSYLLABUS\nThis is a CI course -- communications intensive\nexpected to come to class, having done the reading, ready to discuss\nclasses will integrate lecture and discussion, with occasional group activities\n3 papers, at least 2 will be re-written with my comments in mind; only second will be\ngraded\n\nchoice of possible paper topics, or some flexibility in answering prompts\nwriting tutor -- handout -- meeting required before 1st draft due\nthe more you work with her, the better your writing will get -- may or may not affect\ngrade (which will also be on your critical and creative thinking)\nbooks and other readings on MIT server\nincludes a novel (Middlesex -- start reading early) and two ethnographies (anthro\nresearch)\nREADINGS\nthe class isn't just about women, but, admittedly, most readings attend more to\nwomen's experiences\nstart with general conceptual tools\n1) talk about relationship b/w gender and labor -- economic relationship\n2) sexuality and different configurations of sex/gender\n3) reproductive politics -- religion, race and nationalism\nQUESTIONS?\nATTENDANCE and INTRODUCTIONS (what do you anticipate from class?)\nfor MONDAY -- first readings are on MIT server\nbring in 1-2 paragraphs (typed or legibly hand-written) with arguments about the\nanalytical limitations of theorizing gender as the social elaboration of biological sex\ndifference\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Glenn’s critique (end of article) of “comparable worth” – equal pay for equal work",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/7f90e4a337a2e09985e0c7594a4ab299_MIT21A_213JS06_gndrdlabr.pdf",
      "content": "gendered labor\n\nwe've been looking at intersections between the so-called public/private spheres --\nsocial reproduction happens in these intersections -- as does the formation of gender as a\nmode of social reproduction\n\nworking class masculinity/femininity = professional class masculinity/femininity\n\nracial-ethnic gender formations are overlaid, too, by class\n\nstructural reasons -- history of discriminatory hiring practices, unequal pay scales,\nuneven quality of public education in communities that differ widely in terms of income\n\nbut also, more subtle means of socialization, ongoing gender acquisition into adulthood\n\nwomen and men become gendered -- take on \"masculine\" and \"feminine\" characteristics\n-- in part through segregated labor practices (including mothering and unpaid domestic\nwork)\n\nthis, in part, is why what \"femininity\" and \"masculinity\" means will vary for women and\nmen who are structurally divided by class, race, ethnicity.\n\nTODAY we're looking at the OTHER side of the equation:\n\nHow might we think differently about paid labor market when we look at it as being\nsystemically connected to households?\n\nKath Weston (147): \"Occupational settings, no less than households and families, are loci\nfor the production and reproduction of gender in the United States.\" -- again, class-\nspecific notions of gender that are deeply connected to notions of race\n\nGOVERNMENT LABOR STATS (overheads)\n\nIn 2002, women's labor force participation rate was 59.6 percent. In other words, 59.6\npercent of women age 16 and over were working or actively looking for work.\nWomen comprised 47 percent of the total labor force (male and female) in 2002.\n= not too many self-identified \"housewives\" or \"homemakers\" out there\n\nwhat jobs were they doing?\n\nmost in \"pink-collar\" jobs -- #1 is retail service (full-time; not including temps)\n\nNOTE: government recently announced it was going to stop collecting gender-related\noccupational data\n\nMany of you have a grasp of the history behind this: women's employment has tended to\nbe looked upon as either \"desperate\" - immigrant labor -- or \"supplemental\" to a head of\n\nhousehold's breadwinner's wages -- justifying, not explaining, low wages\n\nthis is what calls for \"comparable worth\" - equal pay for equal work-- meant to redress\nbut did you catch Glenn's critique (end of article) of \"comparable worth\"?\nbuys into myth of meritocracy:\n\nassumes jobs have objective worth based on measurable skills, education,\nproductivity\n\nbut what about emotional skills of nurses, caregivers -- not formally \"skilled\"?\n\nracial divide often at skilled/unskilled divide -- comp worth doesn't\naddress this\n\ncomp worth also neglects to consider structural obstacles to entry into skilled\njobs/professions -- \"pink collar work\" where aren't comp men's wages\n\nGlenn says if we support comp worth, need to do it alongside support for \"living\nwage\" -- better pay for ALL less valued jobs -- social security taxes for\ndomestics\n\nreadings for today go even deeper -- address cultural assumptions that make \"merit\nbased\" pronouncements seem fair -- that make today's wage differentials/gendered\ncareer paths seem rational -- a matter of personal \"choice\" rather than bias\n\nBUT choice = desire, what people would want ideally; often settling for something,\n\"choice\" is often a pragmatic compromise\n\njust because career paths today tend to be \"chosen\" rather than \"forced,\" doesn't mean\nthings are equitable, fair; that we've solved the problems\n\nwhat Rosalind Williams calls \"gender bias\" in occupational tracking far more subtle than\n\"gender discrimination\" -- and is more enduring, since can't be legislated against\n\nsimilarly, Kath Weston recognizes that notion of \"discrimination\" glosses rather than\nexplains how committed men in the trades are to the idea that it's a man's job -- and\ntheir genuine surprise to see women be good welders or auto mechanics\n\nLet's turn to\n\nKath Weston -- anthropologist, director of women's studies at Harvard, author of first\nresearch-based book on gay families (Families We Choose, 1991)\n\nshe argues that ideologies of gender, and work ability, still do help keep women out of\nthe better paying, unionized skilled trades -- even after gender discrimination in hiring\nmade federal offence.\n\nHOW? What's her argument?\n\n\"Our society describes people in general and job applicants in particular as possessors of\ninherent 'traits' of character and competence--traits that incorporate cultural notions of\ngender, race, class, age, and what it means to be 'able-bodied'.\"\n\nwhat working-class gendered assumptions are made about job-related traits? (141)\n\nwomen have \"manual dexterity\", \"patience\"\n\nmen have \"physical strength,\" \"mechanical aptitude,\" \"aggressiveness\"\n\nJOBS, in turn, are described as having \"requirements\" intrinsic to the work itself\n\n\"heavy\" v. \"light-duty\" work in trades\nmicroelectronics as delicate, requiring small hands\n\nmatching of \"the right person for the job\" appears to be objective -- when subjective\npreconceptions are embedded in depictions of both applicant and job\n\nBUT in \"heavy\" work, do men actually lift engines?\nis welding sheet metal (\"delicate\") less hazardous than other trade work?\nand don't' men dominate surgery? (even with electron microscopes?)\n\nAt the same time, that women/men do particular kinds of work reinforces certain\nstereotypes. Makes the connection between women/being a woman and nursing (care\ngiving), doing piecework sewing or stationary microscope work (to manufacture\ncomputer chips and small electronics) seem self-evident.\n\nWeston: \"gender permeates not only the bodies and identities of workers, but production\nitself\" (139) but this is metaphoric, cultural -- not essential, inherent to the job itself\n\nWeston importantly argues:\n\n\"Persons do not possess gender-typed qualities so much as they use symbols to\nfashion presentations of self that incorporate gender.\"\n\ni.e., there's a lot of work that goes into the appearance of difference b/w heavy/light labor\nexaggerated acting the part -- carrying tires instead of rolling them; unnecessary safety\nrisk\n\nbeing extra 'macho' in ways that make doing the work of a tradesman seem antithetical\nto \"being\" a woman.\n\nConceptually, not unlike sense that men \"are taller\" than women b/c straight couples tend\nto pair up that way.\n\nAnd women who do make it into the trades? How do they get in? How are they coached?\n\n\"blue collar dress-for-success program\" (142-43)\n\nthese are signs of the ability to do the job, recognition of what job entails; not\nevidence of actual skill (degree, experience)\n\nmeaningful gender differences aren't essential; they're learned, adopted, adapted, elicited\n\n\"The conceptual links between gendered traits and job requirements are so powerful that\nthey can influence what men on the job see when they watch a woman work\" (142)\n\nWeston concludes: \"Fighting occupational sex segregation begins by disentangling\ngendered displays and notions of gendered capacity from labor performed\" (148)\n\nwhat if we apply this to white collar work like banking (London) (McDowell)?\n\nwomen blocked from upper end of banking positions not only through infrastructural\nobstacles (\"glass ceiling\") but because the jobs themselves are gendered masculine in\nsubtle ways that make women's presence incongruous, unthinkable, if not destabilizing\n\nexamples from McDowell?\n\nit's also masculinity, too, that's a performance\n\ncompulsory heterosexuality limits masculinity\n\nand while some women \"masquerade\" as men (but only incompletely), others flaunt\nstereotypical aspects of femininity\n\np. 198 - you can \"manipulate things\" by \"being more or less female\"\n\nwhat do you make of this?\n\nwhat if we apply Weston's insights to the sciences like physics, professions like\nengineering?\n\nhow is gender enacted in MIT culture, pedagogy?\nexcerpt from Rosalind Williams's Retooling -- prof in STS and former Dean of Students\n\nnot merely intellectual capacity, but STYLE of thinking, reasoning\n\n\"one sometimes hears the complaint that women students 'just' get good grades,\nwithout necessarily being creative and entrepreneurial\" (201)\n\nwomen faculty do a disproportionate amount of uncompensated \"service work\"\n-- asked to serve on committees -- either because 'better' committee members,\nor as token representatives -- as soon as their hired; doesn't count in tenure\ndecisions\n\nhard/soft sciences? (heavy/light labor)\n\nhow does occupational gender discrimination work today, when anti-discrimination\nlaws are in place?\n\nnot through direct exclusion, but\n\n1) by perpetuating conditions that retain assumption that ideal worker has a wife\n(reproductive labor) -- so women \"choose\" not to accept faculty positions at\nresearch universities if they're interested in having kids\n\nwork/family issues are huge\non MIT engineering faculty: 1/2 women faculty have kids; 4/5 men have kids\n\n2) being underappreciated -- not having your achievements recognized (as in trades)\n\n3) Susan Hockfield: \"the tyranny of low expectations\" -- letters of evaluation reflecting\nexpectations, stereotypes, rather than reality -- always described as a 'woman scientist'\n\nnext time: gender and agency -- important theoretical pieces that may offer tools in\nrevising your papers\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "history of modern sexual identities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/c4a7d7fd2972e8e30637f3c408f1334c_MIT21A_213JS06_sex_iden.pdf",
      "content": "Is sex to gender as nature to culture?\n\nATTENDENCE\n\nlast time, introduced gender as an analytical concept\n\nsocial roles, activities; aesthetic appearances; stereotypical characteristics,\ncultural\nmeanings associated with being men and women\n\neven if sex difference seen as given in nature, gender is culturally variable and\nhistorically changing\n\nconcept of \"gender\" was meant to stress social/cultural origins of gender inequality\n\nThis alignment of sex/gender with nature/culture gets us into loops about what counts as\nnature and what's culture, and about what \"nature\" and \"culture\" mean.\n\nThe so-called \"culture wars\" often have to do with arguments about \"nature\", what's\n\"natural\" behavior -- and therefore something that should be accepted, not judged (we'll\ndiscuss arguments about sexual identity, gay marriage). OR, \"natural\" behavior could be\nsubject to medical \"treatment.\"\n\nwant to avoid the \"naturalistic fallacy\" -- that what's natural is good, or inevitable (this\nis a cultural belief)\n\nreadings for today are both by biologists who challenge our assumptions about the\n\"nature\" of women and men\n\nLet's FIRST go through their arguments\nSECOND assess the analytic limitations of sex/gender as theoretical framework\nFINALLY ask where that leaves us, terms of how to think about what gender is, or might\nbe\n\nRuth HUBBARD (Harvard professor emerita) begins article, \"On Women's Biology\" by\narguing that women's physique, in contrast to men's, is a social construct and a political\nconcept, not a scientific one.\" What does she mean?\n\nbiology is \"socially constructed\" (doesn't exist 'in nature' as such, in and of itself)\n\nRather,\n1) biology is perceived, interpreted, described through cultural lenses\n2) culture also actually shapes biology\n\ndialectical relationship nature/culture, can't cleanly separate them\nbecoming more obvious: GM foods, IVF\n\nexamples: !Kung menstruation patterns\ndo not menstruate until 18 yo (high activity levels, diet); get pregnant, breastfeed\n\nintensively for 2-3 years; repeat cycle until menopause at late 30s/early 40s\nso: shorter reproductive span, 4-5 kids w/out contraception, few menstruations\n\nin US, girls who are athletes delay or stop having period\ngenerally speaking onset becoming younger, high fat diet but also, perhaps, due in part to\ngrowth hormones in meat, milk\n\nwhat does it mean to say that women's biology is \"socially constructed\"?\n\nnot that it isn't \"real\" -- have real effect, creates real muscles, etc.\n\nindeed, Hubbard wants us to attend to the material effects of cultural ideas of\ngender\n\nbut biology is not destiny (contra Freud, who said \"anatomy is destiny\")\n\nbiology and society, nature and culture continuously reshape one another\n\nthink about how women's bodies have changed through time, varied according to\nother social categories\n\na lot of work goes into producing gendered bodies -- effort to tame unruly secondary sex\ncharacteristics -- plucking, shaving, dying hair; voice training\n\n\"we need have no ideological investment in whether women and men exhibit biological\ndifferences, aside from the obvious ones involved with procreation. .. we cannot know\nwhether such biological differences exist because biology and society (or environment)\nare interdependent and cannot be sorted out\" (128).\n\nQ: what did you think of her arguments? about men's and women's relative strength,\nheight differences -- search for \"natural\" limits?\n\nsocially sanctioned childhood activities create gendered bodies -- AND the marked\ncategories of the \"tomboy\" (girls who like sports) and the \"bookworm\"(boys who don't)\n\n_______________\n\n_______________\n\nwe focus on the uneven ends, rather than the overlap\n\n\"We need to pay attention to the obvious contradictions between stereotypic descriptions\nof women's biology and the realities of women's lives\" (127)\n\nexamples?\n\n\"Sex differences are interesting in sexist societies that value one group more highly than\nthe other\" (129).\n\nand it's amazing how durable are commitments to biologically based difference\n\n-- beyond procreative roles\n\nbottom line: biology is not a stable thing in itself; it doesn't ground culture. Therefore sex\ndifference cannot really ground gender (if it provides justification, this connection itself\nis not inevitable).\n\nBUT, for now, we DO have ideological investment biological difference -- why?\n\"biological differences b/w women and men are used to rationalize the stratification of\nthe labor force by sex; they do not explain it\" (124)\n\nNATURALIZATION\n\nAnne Fausto-Sterling, biologist at Brown University\n\nin \"The Five Sexes\" she argues that humans do not all fall naturally into neat binary\ncategories of male/female\n\nF-S says that there are not simply two sexes. Why?\nsex is not just one thing; there are many different variables that go into making it:\nGENES: X and Y chromosomes\n\nHORMONES: estrogen, androgens\n\nGONADS: ovaries, testes\n\nGENITAL: clitoris, penis\n\nSECONDARY: hair, breasts;\n(BEHAVIOR, gendered)\n\n(note that sexual orientation --orientation of sexual desire-- is yet another\nmatter)\n\nThese don't always line up in individuals; there is a spectrum.\n\nestimated 1 in 2,000 babies born with ambiguous genetalia, making it difficult for doctors\nto pronounce automatically \"it's a girl\" or \"it's a boy\"\n\nSo here, Fausto-Sterling suggests \"at least\" a five-sex model, naming three intersexed\ncategories:\n\nherms: so-called true hermaphrodites, who possess one testis and one ovary in same\norgan\nmerms: male pseudohermaphrodites, XYs who have testes and vagina and clitoris (do not\nmenstruate)\nferms: female pseudohermaphrodites, XXs who have ovaries and aspects of male genitals\n--\nclitoris and penis similar organ\n\n(note, however, that even these more complex binary correspondences only work if one\n'sex' is taken as the model for the other; where, for example, is the vagina in this model?)\n\nin a later article, she says 5 sexes aren't enough -- new classifications based also on\nhormones rather than anatomy of gonads and genitalia (problems of classification)\n\nHANDOUT 1\n\nand note that one of these conditions, Progestin-induced androgenization, is\niatrogenic, meaning induced by medical treatment of the body\n\nIntersex could be culturally valued, it HAS been valued historically (and is, elsewhere,\nother cultures, as we'll see), but it isn't (here). Doctors think they're doing a favor to\nchildren and parents in modifying intersexed individuals.\n\nmedical and legal institutions have worked to preserve appearance of dual system\n\nwell intentioned, about \"fitting in\" -- but this is a concern b/c modern \"Western culture\nis deeply committed to the idea that there are only two sexes.\"\n\ncommitment to unambiguous binary gender difference AND\nHETEROSEXUALITY\n\nthese are institutionally fundamental to western societies\n\norganizes inheritance, who can marry whom, paternity, hereditary titles,\neligibility for\nprofessions, draft registration (earlier, voting rights), anti-sodomy laws\n\nsports: Olympics, between 1968-2000 female athletes had to prove they're female;\nchromosome tests, DNA - dozens have failed (excuses made for pulling out)\n\nmajority disorders XY but androgen deficiency - no advantage\n\n\"if the state and the legal system have an interest in maintaining a two-party sexual\nsystem, they are in defiance of nature\" (21)\n\nif we didn't suppress these differences, what might that mean for society?\n\nwe'll read later about the Intersex Society of America, against sex reassignment surgery,\nalso Middlesex (protagonist has androgen insensitivity w/ 5-alpha reductase deficiency)\n\nSO, what are the analytical limitations of sex/gender formulation?\n\n1) binary sex difference isn't natural either -- sex is not a natural, binary, clearly\ndimorphic category of difference -- rather, we force a range of natural differences into\nbinary categories and take pains to stage dimorphism (tall women not pairing up with\nshort men)\n\ni.e., binary \"sex\" difference is not given in \"nature\" -- so it cannot be a natural\nunderpinning for gender or anything else\n\nwe read gender onto sex, not from sex\n\n2) experientially, gender (being a man or woman) isn't reducible to sex difference -- not\nenough to talk categorically about \"women\" on one hand and \"men\" on the other\n\nwhat it means to be a woman or a man -- even to have a \"male\" or \"female\" body --\nhas to do with various historical, cultural and social factors\n\ncorset wearing upper-class woman prohibited from working and her domestic\nservant -- different bodies, different strength, different health\n\nclass, occupation, race, ethnicity, religion (attitudes toward sensuality)\n\nAGE -- physical/cultural/emotional manifestations of masculinity/femininity\ndifferent when 14 than when 24, 54, 74\n\nbe aware of the force of binarisms, but also the work that goes into appearance of\nbinarisms\n\nreadings for Wed -- if gender isn't just rooted in biology, how do we get it? gender\nacquisition through cultural means\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "intersex",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-231j-gender-sexuality-and-society-spring-2006/681ac7170a719efec8398de85dd54fa1_MIT21A_213JS06_intersex.pdf",
      "content": "intersex\n\nhandout: http://www.marchofdimes.com/professionals/681_1215.asp\n\nrecall Anne Fausto-Sterling: about 1 in 2000 infants born with 'ambiguous genetalia' and\n1 in 400, 5 sex-related characteristics do not correspond neatly according to binary model\nof difference\n\nmore variety than even \"5 sexes\" -- hormonal as well as anatomical patterns\n\nour Q: what are various ways in which culture-bearing humans have interpreted and lived\nwith this natural ambiguity? and why?\n\na) cultures have accommodated the ambiguity\n\nhermaphrodite (hermes + Aphrodite)\n\n1) hijra in India-- not so much a 'natural category' of person, but a role that can\nsubsume a range of sex/gender nonconformists\nincluding intersexuals but also what in west would call eunuchs (castrati),\nhomosexuals, transsexuals, transgendered persons\n\nanthropologist Serena Nanda interprets hijras in the conceptual, cultural context\nof Hinduism\n\nthe hijra is marginalized, but recognized -- there's a conceptual space for intersex\n\n2) guevedoche ('penis at 12') Dominican Republic\n= the hereditary genetic mutation that Cal has in Middlesex, which in US\nhas no popular name and is treated as a medical condition -- 5 alpha-\nreductase -- \"treatable\"\n\nin US, are there ways of accepting ambiguity?\n\"queer\" identity -- not based on shared essential identity but on shared nonconformism\n-- \"queer nation\" or \"transgender nation\"-- not in thrall to binary sex/gender distinction\nin which biology and cultural identity and behavior viewed as both categorically different\nand ideally congruent\n\nmore commonly (mainstream US),\n\nb) rejecting the ambiguity of intersex\n\nwe have no social category to accommodate ambiguously sexed individuals\n(except pornographic freak shows, like in Middlesex -- commoditization!)\n\n\"hermaphrodite\" is not one of the options available on a birth certificate\n\nnot only modern US: ancient Spartans practiced infant abandonment\n\nWHY today insistence on 2-sex model of gender difference? clearly defined binaries?\nas Fausto-Sterling noted, our institutions, laws presume 2 genders\n\ndid you read Bill Beeman's Baltimore Sun op-ed piece, \"Who are you?\"\nmarriage law is one thing at stake\n\nQ of marriage defined constitutionally as \"between a man and a woman\" -- is that such\nan obvious statement? what about intersexuals? transsexuals? how WOULD the law\ndefine man/woman today, with ISNA and other groups to raise the question of definition?\n\nbegs Q of how, as a society, we should approach intersexuality\n\nprotocols established in 1950s that doctors would do sex determinations without seeking\npermission or even really knowledge of parents -- idea being that gender acquisition\nwould go more smoothly if no ambiguity\n\nCheryl Chase speaks of sex \"determination\" in both senses of the word...\nbut this \"determination\" based not only on \"facts\" but on technological ability -- 90%\n\"determined\" female b/c easier to \"make a hole than a pole\"!\n\ngender identity is a complex INTERACTION of biology and culture (Hubbard) -- not\njust one informing the other\n\nJohn/Joan case, overseen by Dr. John Money (the inspiration for Eugenides' Dr.\nLuce)\n\n'Joan' grew up to identify as 'John', transitioned to masculine persona\n\nhad phalloplasty, married a woman [Rolling Stone story on MIT server]\n\nfor the general medical community, what would count as a \"successful\" sex assignment\nor reassignment?\n\noften adoption by the intersexed person of the gender role corresponding to the\nsex assigned by the health care workers + \"heterosexual\" sexual orientation\n\nnot only is equivalence b/w sex/gender at issue, but heterosexuality as normative\n\nnote that the identification of heterosexuality is contingent upon what gender\nthe person was assigned by the medical professionals during infancy\n\nwhat are the cultural/ideological underpinnings of this scientific protocol?\n\nQ: is this rational modern science? or patriarchal culture? or can we separate the two?\n\nCheryl Chase and the ISNA\n\nfrom the website (isna.org):\n\n\"The Intersex Society of North America (ISNA) is devoted to systemic change to\nend shame, secrecy, and unwanted genital surgeries for people born with an\nanatomy that someone decided is not standard for male or female.\n\nWe have learned from listening to individuals and families dealing with intersex that:\n\n* Intersexuality is primarily a problem of stigma and trauma, not gender.\n\n* Parents' distress must not be treated by surgery on the child.\n\n* Professional mental health care is essential.\n\n* Honest, complete disclosure is good medicine.\n\n* All children should be assigned as boy or girl, without early surgery.\"\n\n1) what do you think about routine sex assignment surgery on infants? pro/con\n2) what do you think about current transsexual \"treatment\" of \"gender dysphoria\"?\n\nNOW: are your arguments concerning intersex and transsexualism philosophically,\nlogically consistent?\n\ntransgender/transexual support based on essentializing gender identity -- body\nis malleable but sex/gender should match up\n\nsex-assignment surgery on infants ALSO based on sex/gender matching --\nin this sense conceptually consistent w/ transsexualism\n\nbut what about intersexual activism (Chase)?\nbased on essentializing biological sex\ngender should be malleable -- and sex/gender system itself challenged\nat least in long term; in short term, advocating 'choosing' a gender identity\n\nsupport of transsexualism is consistent with a major criticism of sex assignment\nsurgery of intersex infants -- informed consent -- ascription, not achievement, of\nembodiment\n\nbegging question of usefulness and limitations of appealing to \"nature,\" natural \"fact\" to\nlegitimate social formations -- it's a political and cultural, not strictly logical, argument\n\nMIDDLESEX: what did you make of Eugenides' fictional account? helpfully - through\nfiction - get at experience?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.231J / WGS.455J Identity and Difference\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}