{
  "course_name": "Genetics",
  "course_description": "This course discusses the principles of genetics with application to the study of biological function at the level of molecules, cells, and multicellular organisms, including humans. The topics include: structure and function of genes, chromosomes and genomes, biological variation resulting from recombination, mutation, and selection, population genetics, use of genetic methods to analyze protein function, gene regulation and inherited disease.",
  "topics": [
    "Science",
    "Biology",
    "Cell Biology",
    "Genetics",
    "Molecular Biology",
    "Science",
    "Biology",
    "Cell Biology",
    "Genetics",
    "Molecular Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nText\n\nThere are no assigned readings for this class although we recommend the following textbook as a valuable reference.\n\nGriffiths, Anthony J. F., Jeffrey H. Miller, David T. Suzuki, Richard C. Lewontin, and William M. Gelbart.\nAn Introduction to Genetic Analysis\n. 7th ed. New York: W. H. Freeman, 2000. ISBN: 9780716735205.\n\nCheck out the National Center for Biotechnology Information (\nNCBI\n),\nPubMed\n, Web site for an\nonline version\nof this textbook.\n\nAssignments and Exams\n\nThere are six graded problem sets for this course. Students may collaborate with classmates on the problem sets, but copying problem set solutions is not permitted. Any student that copies another problem set or allows their problem set to be copied will be assigned a 0 for that problem set.\n\nThere are three one-hour exams. The exams will be closed book, but students may bring one 8 1/2 x 11 sheet of notes to the exam. In addition to the exams, there will also be a final during exam week. The final will be comprehensive and will cover material from the entire course with an emphasis on material from lectures 31-36 not covered by an hour exam.\n\nGrading\n\nACTIVITIES\n\nPOINTS\n\nQuiz I\n\nQuiz II\n\nQuiz III\n\nFinal\n\nSix Problem Sets\n\nTotal",
  "files": [
    {
      "category": "Assignment",
      "title": "pset1_ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/d41562b5f653a7b025cab2b789a76598_pset1_ans.pdf",
      "content": "7.03 Problem Set 1 Solutions\n\n1.\na. Crossing each yeast haploid mutant to wild-type will tell you whether the\nmutation is recessive or dominant to wild-type. If the diploid is wild-type phenotype,\nthen the mutation is recessive to wild-type. If the diploid is mutant phenotype, then the\nmutation is dominant to wild-type. Therefore, mutants 1, 2, 3 and 5 are recessive to\nwild-type and mutant 4 is dominant to wild-type.\n\nb. These crosses are actually complementation tests, allowing us to determine\nwhether the two mutants crossed have mutations in the same gene or in different genes.\nMutants that do not complement each other (progeny have mutant phenotype) are said to\nbe in the same complementation group and therefore in the same gene. Based on non-\ncomplementation of the recessive mutations, we can conclude that mutants 1 and 3\nform one complementation group and are mutations in the same gene (gene A).\nLikewise, we can conclude that mutations 2 and 5 form a second complementation\ngroup and are mutations in a second gene (gene B). We are unable to determine\nwhether mutant 4 represents a mutation in a new gene or a mutation in one of the other\ntwo genes because it is a dominant mutation.\n\nThe first ambiguity is whether mutant 4 has a mutation in gene A or\nB, or whether it represents a unique gene. To determine this, you would cross mutant\n4 to one mutant from each of the two complementation groups, generating a diploid. You\nwould then sporulate and look at the segregation pattern of the white/red phenotypes in\nthe resulting haploids. If any of the haploids form white wild-type colonies, then gene 4\nis not likely to be in the same gene as the mutant it was crossed with because a crossover\nis likely to have occurred.\n\n2.\n\na.(wild-type genes are represented as \"+\" and mutant as \"-\". Also, when one\nmutation is dominant, it is mutation 1.)\n\npossibility 1: F1 will have red eyes because mutations are recessive and F1 is\nheterozygote: 1-/1+, 2-/2+.\n\nTo determine expected F2 phenotypic ratio, we must determine the probability that F2\nwill have one of the eye colors:\n\nP(F2 white eyes) = p(homologous for 1- and not for 2-)x p(homologous for 2- and\nnot for 1-)x p(homologous for both)\n\np(F2 white eyes) = (1/4)(3/4) + (1/4)(3/4) + (1/4)(1/4) = 7/16\n\ntherefore, F2 will be 7 white: 9 red\n\npossibility2: F1 will have white eyes because there is a dominant mutation in series.\nEven though only one of the mutant phenotypes will be expressed in the F1 heterozygote,\nthe F1s will have white eyes because both wild-type gene products are required to make\nred color.\n\np(F2 red eyes) = p(homologous for 1+ and (homologous or heterozygous for 2+))\n\np(F2 red eyes) = (1/4)(1/4 + 1/2) = 3/16\n\ntherefore, F2 will be 13 white: 3 red\n\npossibility 3: F1 will have white eyes because heterozygous for two dominant mutations\nin series.\n\np(F2 red eyes) = p(homologous for 1+ and homologous for 2+)\n\n=(1/4)(1/4) = 1/16\n\ntherefore, F2 will be 15 white: 1 red\n\npossibility 4: F1 will have red eyes because F1 is heterozygous for recessive mutations\n\np(F2 white eyes) = p(homozygous for 1- and homozygous for 2-)\n\n= (1/4)(1/4) = 1/16\n\ntherefore, F2 will be 1 white:15 red\n\npossibility 5: F1 will have red eyes because even though there is a dominant mutation, it\nis in parallel, so can be compensated for by the wild-type allele of the other gene.\n\np(F2 white eyes = p(homologous for 2- (and homologous or heterozygous for 1-))\n\n= (1/4)(1/2 + 1/4) = 3/16\n\ntherefore, F2 will be 3 white: 13 red\n\npossibility 6: F1 will have white eyes because both mutations are dominant in parallel.\n\np(F2 white eyes) = p((heterozygous or homozygous for 1-) and (heterozygous or\nhomozygous for 2-))\n\n=(1/2 + 1/4)(1/2 + 1/4) = 9/16\n\ntherefore, F2 will be 9 white: 7 red\n\nb. to determine which of the possibilities is consistent with the observed data, we\nmust do a chi-squared test using the expected ratios found in part (a). The df = 1. we can\nreject hypothesis if p<0.05\n\nχ2 =Σ [(O-E)2]/E\n\npossibility 1: expected ratio is 7 white: 9 red, so out of 24 total F2's we would expect\n10.5 white and 13.5 red.\nχ2= (5-10.5) 2/10.5 + (19-13.5) 2/13.5 = 5.12\nby using the provided table and df=1, you get 0.025>p>0.01 therefore we can\nreject possibility 1.\n\npossibility 2: expected ratio is 13 white: 3 red, so out of 24 total F2's we would expect\n19.5 white and 4.5 red.\nχ2= (5-19.5) 2/19.5 + (19-4.5) 2/4.5 = 57.5\nby using the provided table and df=1, you get 0.005>p therefore we can reject\npossibility 2.\n\npossibility 3: expected ratio is 15 white: 1 red, so out of 24 total F2's we would expect\n22.5 white and 1.5 red.\nχ2= (5-22.5) 2/22.5 + (19-1.5) 2/1.5 = 217.78\nby using the provided table and df=1, you get 0.005>p therefore we can reject\npossibility 3.\n\npossibility 4: expected ratio is 1 white: 15 red, so out of 24 total F2's we would expect\n1.5 white and 22.5 red.\nχ2= (5-1.5) 2/1.5 + (19-22.5) 2/22.5 = 8.71\nby using the provided table and df=1, you get 0.005>p therefore we can reject\npossibility 4.\n\npossibility 5: expected ratio is 3 white: 13 red, so out of 24 total F2's we would expect\n4.5 white and 19.5 red.\nχ2= (5-4.5) 2/4.5 + (19-19.5) 2/19.5 = 0.068\nby using the provided table and df=1, you get 0.9>p>0.5 therefore we cannot\nreject possibility 5.\n\npossibility 6: expected ratio is 9 white: 7 red, so out of 24 total F2's we would expect\n13.5 white and 10.5 red.\nχ2= (5-13.5) 2/13.5 + (19-10.5) 2/10.5 = 12.23\nby using the provided table and df=1, you get 0.005>p therefore we can reject\npossibility 6.\n\npossibility 7: if true-breeding white eyed phenotype was due to a recessive mutation in a\nsingle gene, we would expect 1/4 of the F2 progeny to have the white eyed phenotype.\nχ2= (5-6) 2/6 + (19-18) 2/18 = 0.222\nby using the provided table and df=1, you get 0.9>p>0.5 therefore we cannot\nreject possibility 8.\n\npossibility 8: if true-breeding white eyed phenotype was due to a dominant mutation in a\nsingle gene, we would expect 3⁄4 of the F2 progeny to have the white eyed phenotype.\nχ2= (5-18) 2/18 + (19-6) 2/6 = 37.5\n\nby using the provided table and df=1, you get 0.005>p therefore we can reject\npossibility 9.\n\n3.\na. First, we would determine whether ca and ck were dominant or recessive\nalleles by crossing the true-breeding sepia and albino hamsters to true-breeding black\nhamsters.\n(albino) caca X CC (black)\n\n(sepia) ckck X CC (black)\n\n|\n\n|\nCca\n\nCck\n(black)\n\n(black)\nFrom the resulting F1 progeny phenotype, we can conclude that the ca and ck alleles are\nboth RECESSIVE to the wildtype C allele.\n\nSince both ca and ck are recessive, we can perform a COMPLEMENTATION TEST to\ndetermine whether the different mutations lie on the same gene by mating the true-\nbreeding albino hamsters to the true-breeding sepia hamsters.\n\n(albino) caca X ckck (sepia)\n\n|\n\ncack\n\n(NOT black)\nFrom the resultant F1 phenotype of this cross, we note that ca and ck do NOT complement\neach other. This indicates that ca and ck are different alleles of the same gene.\n\nb. We would mate the true-breeding caca hamsters to the true-breeding ckck\nhamsters to produce heterozygous cack F1 progeny.\n\nWe would then cross heterozygous cack hamsters to other heterozygous cack hamsters.\nFrom the fraction of F2 progeny that have the wildtype black phenotype, we can\ndetermine whether or not ca and ck are alleles of the same gene.\n\nck\n\nck\nca\n-----------------------------\n------------~~~~~~~~\n~~~~~~X~~~~~~ Æ ~~~~~~~--------------- (wildtype)\nca\n\nWhen crossing over occurs, an allele with neither mutation is formed. The passage of\nthis wildtype chromosome onto an offspring will result in a hamster with black fur.\n\nIf ca and ck are mutations on separate genes, they will be further away from each other,\nhence making crossing over between them more likely. The presence of some black F2\nhamsters will indicate that crossing over had occurred and that the mutations are on\ndifferent genes.\n\nMore specifically, when the mutations are on different genes, the ratio of the F2 hamsters\nshould be as follows:\n9 black (heterozygous wt/mutant): 3 sepia: 3 albino: 1 black (double mutant)\n\nIf ca and ck are alleles of the same gene, they will be very close to each other and crossing\nover will rarely occur between them. The absence (or rare occurrence) of black F2\nhamsters in a large population will indicate that crossing over did not (or rarely)\noccurred. This indicates that the mutations are on the same gene.\n\nMore specifically, when the mutations are on the same gene, the ratio of the F2 hamsters\nshould be as follows:\n1 sepia: 2 not black (double mutant): 1 albino\n\n4. Remember that the traits are recessive!\na.\nA = wt\n\nB = wt\n\na = trait 1\n\nb = trait 2\n\nDad's genotype = aaBb\n*He's affected with trait 1, so he must be aa\n*He's not affected with trait 2, but he must have gotten one b from his father who was bb.\nSo he must be heterozygous for trait 2 with Bb\nDad's chromosomes look like this:\na B\n\n(from mother)\na b\n\n(from father)\n\nMom's genotype = AaBb\n*Her father is aabb, so she must have gotten ab alleles from him. However, she is not\naffected, and so she must be heterozygous for both traits.\nMom's chromosomes look like this:\nA B\n\n(from mother)\na b\n\n(from father)\n\nThe genes are 10 cM apart, so crossing over between them will occur 10% of the time.\nFor example, Mom's gametes will exist in the following ratios\nA B\n(Parental)\n45%\na b (Parental)\n45%\na B (crossover) 5%\nA b (crossover) 5%\n\nOtherwise, the two alleles on one chromosome will remain linked 90% of the time.\n(Note that for the dad's chromosome, when crossing over between the alleles occurs, the\nallele combinations remain the same)\n\np(aabb child) = p(a b chromosome from mom) and p(a b chromosome from dad)\n=\n\n(1/2) x (0.9)\n\nX\n\n(1/2)\n= (0.45) x (0.5) = 0.225\n\nb. cM = (100) x (fraction of gametes that crossover between gene 1 and gene 2)\nfraction of gametes that crossover = cM/100\nfraction of gametes that will NOT crossover = 1 - (cM/100)\n\np(aabb child) = p(a b chromosome from mom) and p(a b chromosome from dad)\n\n=\n\n(1/2) x (1-[cM/100]) x (1/2)\n= (1/4) x (1 - [cM/100])\n\nc.\nXa = trait 1\nXb = trait 2\nXab = traits 1 and 2\nX+ = wt\n\nDad's genotype = Xa+Y\nMom's genotype = XabX++\n*Mom's father was XabY, so she received the Xab chromosome from him, but must be\nheterozygous for both traits since she's unaffected\n\np(XabY child) = p(Xab from mom)\n\n= (1/2) x (0.9) = 0.45\n\nd. p(XabXab child) = p(Xab from mom) and p(Xab from dad)\n\n=\n(.45)\nx\n\n= 0"
    },
    {
      "category": "Assignment",
      "title": "pset1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/f2728606d0b5bd8e3d36e7fa9b5c8154_pset1.pdf",
      "content": "7.03 Problem Set 1\nDue before 5 PM on Thursday, September 18\nHand in answers in recitation section or in the box outside the class\n1.\nYou have isolated a set of five yeast mutants that form dark red colonies instead of\nthe usual white colonies of wild-type yeast. You cross each of the mutants to a wild-type\nhaploid strain and obtain the results shown below\nMutant 1\nwild-type\ndiploid\nX\nMutant 2\nwild-type\ndiploid\nX\nMutant 3\nwild-type\ndiploid\nX\nMutant 4\nwild-type\ndiploid\nX\nMutant 5\nwild-type\ndiploid\nX\n(a) What do these results tell you about each of the mutants?\n(b) Next you cross each haploid mutant strain to a different haploid mutant of the opposite\nmating type. From the results shown below deduce as much as you can about which\nmutations lie in the same gene. Clearly state any remaining ambiguities and suggest some\ngeneral ways that the ambiguities might be resolved.\n\nMutant 1\nMutant 2\ndiploid\nMutant 2\nMutant 4\ndiploid\nX\nX\nMutant 1\nMutant 3\ndiploid\nMutant 2\nMutant 5\ndiploid\nX\nX\nMutant 1\nMutant 4\ndiploid\nMutant 3\nMutant 4\ndiploid\nX\nX\nMutant 1\nMutant 5\ndiploid\nMutant 3\nMutant 5\ndiploid\nX\nX\nMutant 2\nMutant 3\ndiploid\nMutant 4\nMutant 5\ndiploid\nX\nX\n2. In this problem we will explore some of the many ways that mutations in two different\ngenes can interact to produce different Mendelian ratios. Consider a hypothetical insect\nspecies that has red eyes. Imagine mutations in two different unlinked genes that can, in\ncertain combinations, block the formation of red eye pigment yielding mutants with white\neyes. In principle, there are two different possible arrangements for two biochemical steps\nresponsible for the formation of red eye pigment. The two genes might act in series such\nthat a mutation in either gene would block the formation of red pigment. Alternatively, the\ntwo genes could act in parallel such that mutations in both genes would be required to block\nthe formation of red pigment.\nGene 1\nGene 2\nSeries\nred pigment\nGene 1\nParallel\nGene 2\nred pigment\n\nFurther complexity arises from the possibility that mutations in either gene that lead to a\nblock in enzymatic activity could be either dominant or recessive.\na) Such considerations yield the following six possibilities:\n1) Pathways in series with recessive mutations in both genes.\n2) Pathways in series with a recessive mutation in one gene and a dominant\nmutation in the other.\n3) Pathways in series with dominant mutations in both genes.\n4) Pathways in parallel with recessive mutations in both genes.\n5) Pathways in parallel with a recessive mutation in one gene and a dominant\nmutation in the other.\n6) Pathways in parallel with dominant mutations in both genes.\nFirst let's consider the possible outcomes from these possibilities in crosses between a\nwild type insect with red eyes and a true breeding white eyed strain with mutations in both\ngenes. For each of the six possible cases outlined above, determine the phenotype of the\nF1 progeny (either red or white eyes) and the expected phenotypic ratio of red to white\neyed insects in the F2.\nb) You obtain a true-breeding white-eyed mutant, which you cross to wild type. All of the\nprogeny have normal looking red eyes. Crosses among these F1 insects yield 24\nprogeny; 5 with white eyes and 19 with red eyes. Determine whether this data is\nconsistent with each of the six possibilities outlined in part (a). For your answer also\nconsider the additional possibilities that the true-breeding white eyed phenotype is due to:\n7) a recessive mutation in a single gene, or 8) a dominant mutation in a single gene. Use\nthe table below of chi-squared probabilities for any statistical tests.\np value:\n.995\n.975\n0.9\n0.5\n0.1\n0.05\n0.025\n0.01\n0.005\ndf = 1\n.000\n.000\n.016\n.46\n2.7\n3.8\n5.0\n6.6\n7.9\ndf = 2\n.01\n.05\n.21\n1.4\n4.6\n6.0\n7.4\n9.2\n10.6\ndf = 3\n.07\n.22\n.58\n2.4\n6.3\n7.8\n9.3\n11.3\n12.8\n\n3. Genes that control coat color in mammals represent some of the best early examples of\ngenes with multiple alleles exhibiting different phenotypes. A classic example is the C\ngene in hamsters. Three of the known alleles of this gene are C, ck and ca. Each supplies a\ndifferent amount of black pigment to the coat hair. The phenotypes of three different\nhomozygous strains are as follows.\nGenotype\nPhenotype\nC C\nBlack fur\nck ck\nSepia colored fur\nca ca\nAlbino fur\n(a) Based on the concepts of dominance, recessivity, and complementation, describe a\nset of crosses and the interpretation of their outcomes that would have allowed early\nmammalian geneticists to conclude that ca and ck are actually alleles of the same gene rather\nthan recessive mutations in two different coat color genes. (To answer this question you will\nneed to make some reasonable assumptions about the coat color of heterozygous strains)\n(b) Now describe a different set of crosses and their interpretation that would have allowed\ngeneticists to come to the conclusion that ca and ck were likely to be alleles of the same\nusing the concept that alleles of the same gene will be tightly linked.\n4. In the following pedigree shows the segregation of two different recessive traits.\n= female showing trait 1 only\n= male showing trait 2 only\n= male showing both traits\n?\n\n(a) Assuming that both traits are due to linked autosomal genes that are 10 cM apart,\ncalculate the probability that the indicated child will have both recessive traits.\n(b) Derive a general equation relating the probability that the child will have both traits\nexpressed as a function of the distance between the markers in cM.\n(c) Assuming that both traits are 10 cM apart on the X chromosome, what is the probability\nthat a male child will have both recessive traits?\n(d) Assuming that both traits are 10 cM apart on the X chromosome, what is the probability\nthat a female child will have both recessive traits?"
    },
    {
      "category": "Assignment",
      "title": "pset2_ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/c2dbecab69fa04b9e5f52722306accb6_pset2_ans.pdf",
      "content": "PROBLEM SET #2 SOLUTIONS 7.03\nQUESTION #1\na) You will want to cross your true breeding black body and vestigial wings strain with a strain that is true-\nbreeding for purple eyes. This will generate progeny that are heterozygous at all three loci, necessary\nfor finding map distances in a three-factor cross.\nb + vg\n+ pr +\nb + vg\nX\n+ pr +\nb + vg\n+ pr +\nb) You will then want to carry out a test cross, in order to best score the gamete genotypes. Since\nrecombination only happens in females, you will want to cross a female resulting from the cross in a) to a\nmale that is true-breeding for a black body, purple eyes, and vestigial wings.\nb + vg\nb pr vg\n+ pr +\nX\nb pr vg\n(female)\n(male)\nc) The rarest phenotypic classes would result from a double-crossover in the female from part b). Since\nwe know the map order, we can deduce the genotype of the double-crossover gametes. This double\nrecombination event:\nb\n+\nvg\n+\n+\npr\ngives:\nb pr vg\n+ + +\nThe final genotypes of the rarest classes, once the above gametes are united with the (b pr vg) gametes\nfrom the test cross male, will be:\nb pr vg\n+ + +\nb pr vg\nand\nb pr vg\nThese phenotypes are :\nblack body, purple eyes, and vestigial wings\nand\nwild-type, respectively.\nd) Parental classes:\nThe likelihood of this group is found by multiplying the probability of not having a\ncrossover in the region between b and pr (which is 1.00 - 0.06 = 0.94) by the probability of not having a\ncrossover in the region between pr and vg (which is 1.00 - 0.13 = 0.87). This value is 0.8178. Since this\ngroup is composed of two equally likely classes, we must divide the value by two, giving 0.4089 for the\nlikelihood of each of the two classes. Finally, to find the number of progeny in the class, we multiply the\ntotal number of progeny (1000) by the likelihood of each class of progeny, resulting in the value 408.9.\n\n0.94 * 0.87\n1)\nb + vg\n= black, vestigial.\n*1000 = 408.9\nb pr vg\n2)\n+ pr +\n= purple.\n0.94 * 0.87\n*1000 = 408.9\nb pr vg\nClasses from recombination between b and pr: The likelihood of this group is found by multiplying the\nprobability of having a crossover between b and pr (which is 0.06) by the probability of not having a\ncrossover in the region between pr and vg (which is 1.00 - 0.13 = 0.87). This value is 0.0522. Since this\ngroup is composed of two equally likely classes, we must divide the value by two, giving 0.0261 for the\nlikelihood of each of the two classes. Finally, to find the number of progeny in the class, we multiply the\ntotal number of progeny (1000) by the likelihood of each class of progeny, resulting in the value 26.1.\n0.06 * 0.87\n3)\nb pr +\n= black, purple\n*1000 = 26.1\nb pr vg\n0.06 * 0.87\n4)\n+ + vg\n= vestigial\n*1000 = 26.1\nb pr vg\nClasses from recombination between pr and vg: The likelihood of this group is found by multiplying the\nprobability of not having a crossover between b and pr (which is 1.00 - 0.06 = 0.94) by the probability of\nhaving a crossover in the region between pr and vg (which is 0.13). This value is 0.1222. Since this\ngroup is composed of two equally likely classes, we must divide the value by two, giving 0.0611 for the\nlikelihood of each of the two classes. Finally, to find the number of progeny in the class, we multiply the\ntotal number of progeny (1000) by the likelihood of each class of progeny, resulting in the value 61.1.\n0.94 * 0.13\n5)\nb + +\n= black.\n*1000 = 61.1\nb pr vg\n0.94 * 0.13\n6)\n+ pr vg\n= purple, vestigial\n*1000 = 61.1\nb pr vg\nClasses from double recombination events: The likelihood of this group is found by multiplying the\nprobability of having a crossover between b and pr (which is 0.06) by the probability of having a crossover\nbetween pr and vg (which is 0.13). This value is 0.0078. Since this group is composed of two equally\nlikely classes, we must divide the value by two, giving 0.0039 for the likelihood of each of the two classes.\nFinally, to find the number of progeny in the class, we multiply the total number of progeny (1000) by the\nlikelihood of each class of progeny, resulting in the value 3.9.\n0.06 * 0.13\n7)\nb pr vg\n= black, purple, vestigial\n* 1000 = 3.9\nb pr vg\n0.06 * 0.13\n8)\n+ + +\n= wild-type\n* 1000 = 3.9\nb pr vg\n\ne) The measured distance in a two factor cross would come from the formula:\n((recombinant gametes) / (total gametes)) x 100 = distance in cM\nLooking at the classes above, we will look only at the genotypes and phenotypes for b and vg, since\ninformation about the final marker, pr, would not be gathered in a two-factor cross experiment. Each\nclass will be labeled as recombinant or parental, and the values found in part d entered.\n1)\nb vg\nblack, vestigial\nparental\n408.9\nb vg\n2)\n+ +\nwild-type\nparental\n408.9\nb vg\n3)\nb +\nblack\nrecombinant\n26.1\nb vg\n4)\n+ vg\nvestigial\nrecombinant\n26.1\nb vg\n5)\nb +\nblack\nrecombinant\n61.1\nb vg\n6)\n+ vg\nvestigial\nrecombinant\n61.1\nb vg\n7)\nb vg\nblack, vestigial\nparental\n3.9\nb vg\n8)\n+ +\nwild-type\nparental\n3.9\nb vg\nUsing the formula given above, the distance in cM is\n26.1+ 26.1+ 61.1+ 61.1 *100 = 17.4 cM\nThis distance is less than the sum of the b-pr and pr-vg distances (i.e. 19 cM) because a two factor\ncross cannot take account of double crossover events. Particularly, classes 7) and 8) do in fact\nresult from double-crossover events, as we learned in part d), but in a two-factor cross, they appear to\nsimply be parentals, i.e. identical to classes 1) and 2). They are therefore not included in the numerator\nof our calculation, and the numerator is thus smaller, and the final distance is found to be smaller.\nIn fact, in doing the two-factor cross we would actually see just four classes. One would be the parental\nclass which gave black, vestigial flies (with 408.9 + 3.9 = 412.8 flies), the next would be the parental class\nwhich gave wild-type flies (with 408.9 + 3.9 = 412.8 flies), the third class would be the recombinant class\nwhich gave vestigial flies (with 61.1 + 26.1 = 87.2 flies), and the final class would be the recombinant\nclass which gave black flies (with 61.1 + 26.1 = 87.2 flies). The recombination frequency would then be\n87.2 + 87.2 *100 = 17.4 cM\n\nQuestion #2\na) Since mating arg1- and arg2- to wt results in a wt phenotype, we know that both arg1- and arg2- are\nrecessive to wt. Mating the two recessive mutants to each other (complementation test) results in a wt\nphenotype, meaning that the two mutations complement each other, and are therefore in 2 different\ngenes.\nb) Determination of tetrad type:\nGenotype\nPhenotype\nIf no crossovers = Parental\n__arg1-_____+_____\narg1- +\nArg-\n__arg1-_____+_____\narg1- +\nArg-\n__+_______arg2-___\n+ arg2\nArg-\n__+_______arg2-___\n+ arg2\nArg-\nGenotype\nPhenotype\nIf one crossover = Tetratype\n__arg1-_____+_____\narg1- +\nArg-\n__arg1-_____+_____\narg1-, arg2-\nArg-\n__+_______arg2-__\n++\nWT\n__+_______arg2-__\n+ arg2-\nArg-\nParental ditype yields 4 Arg- spores in each tetrad, and tetratype yields 3 Arg- spores and 1 Arg+ spore in\neach tetrad. Therefore type 1 tetrads are Tetratype, and type 2 tetrads are Parental Ditype.\nSince there are two tetratype tetrads (resulting from a crossover) and 18 parental tetrads (no crossover)\nwe can tell that the two mutations are linked (PD doesn't equal NPD), but not so closely linked that no\nrecombination occurs (some tetratypes are observed). Also, we can tell that there have been no double\ncrossover events because no NPDs are observed. Since tetratype tetrads are the result of a\nrecombination event , the distance between arg1 and arg2 can be calculated by:\n# tetratypes\n*100cM = 100 *\n= 5cM between arg1 & arg2\n2 * (# tetrads)\n2 *20\nThis tells you that the genes are tightly linked.\nc) Mating arg3- to wt yields an Arg- phenotype, therefore arg3- is dominant to wildtype. Thus, the mating\nof arg3- with arg1- does not yield any additional information about the relationship between arg1\nand arg3 because a complementation test is only useful when both mutations are recessive.\nd) Determination of tetrad type: (types 1 and 2 as above)\nIf two crossovers = NPD\n___arg1_______+___\n___arg1_______+___\n____+________arg3_\n____+________arg3_\nThe double crossover yields 6 equally likely genotypes: (parentheses surround spore genotypes)\n2(arg1-+); 2(+ arg3-)\nParental (one way of getting this)\n2(arg1- arg3-); 2(+ +)\nNPD (one way of getting this)\n1(arg1- +); 1(arg1-, arg3-); 1(+ +); 1(+ arg3-)\nTetratype (4 ways of getting this)\n\nType 3 is consistent with the NPD phenotype, type1 with the Tetratype, and type 2 with PD.\nOne might note that the ratio of PD:T:NPD is approximately 1:4:1, signifying that these two genes are\nunlinked.\nTo check mathematically whether these genes are linked or not, we employ the equation for linkage when\nNPDs are observed:\nT + 6 * NPD\n12 + 6* 3\n100 *\n= 100 *\n= 75cM\n2* tetrads\n2* 20\n75 cM is still a valid measure of genetic distance, and indicates that the genes are very far apart\non the same chromosome. A value this high, however, can basically be considered unlinked.\ne) From above we have learned that arg1 and arg2 are closely linked, and that arg1 and arg3 are\nunlinked. It follows that arg3 is not linked to arg2 either,(or we would have observed this linkage in part\nd due to the proximity of arg1 and arg2). In other words, if two genes are close together, and another\ngene is known to be far from one of them, it follows that it is far from the other as well.\nThe ratio of P:T:NPD for unlinked genes is approximately 1:4:1, so given that arg2 and arg3 are unlinked,\nfrom 60 tetrads we would expect 10 PD:40 T:10 NPD.\nQUESTION #3\na) The distance between ts-1 and ts-2 in map units is given by the formula:\ndistance (in m.u.) = (recombinant phage) / (total phage) x 100\nWe are told that there are 10^5 plaques per mL when E. coli is co-infected by ts-1 and ts-2 and then\nplated at 30 degrees. Since this is the \"permissive\" temperature, i.e. the temperature where all the\nphage, including mutant phage, will form plaques, we can take this value as the total concentration of\nphage.\n(A tangential word about the phage lifestyle. Each plaque is simply a site where no bacteria are growing.\nThis means that a large number of bacteria were essentially exploded open by occupying phage. While a\nlarge number of bacteria must be destroyed in order to form one plaque, each plaque is the result of only\none phage and all of it's progeny (that is, a clonal population). Each plaque on a plate will come from a\ndifferent phage, and therefore we can examine the number of plaques to learn about the types of phage\nthat we have.)\nWe are also told that 300 plaques per mL appear when E. coli is co-infected by ts-1 and ts-2 and then\nplated at 42 degrees. Since this is the \"repressive\" temperature, i.e. the temperature where neither of the\nmutants will form plaques, plaques that form at this temperature must be the result of a recombination\nevent. We can diagram this recombination event:\nts-1\n+\n+\n+\n+\nts-2\nts-1\nts-2\nNote that this recombination event led to two types of phage, wild-type phage and double-mutant phage.\nOnly the wild-type phage will give plaques at 42 degrees. The double-mutant phage, however, should\nalso be counted as recombinant phage. Therefore, we multiply by two the number of wild-type phage.\n\nThus, the distance is = (2 x 300 plaques/mL) / (10^5 plaques/mL) x 100 = 0.6 m.u.\nb) If you cross a ts-1 phage strain to a ts-2, cl- phage strain, they will initially coinfect E. coli cells but\neventually, as cell lysis goes on, there will only be one type of phage infecting each bacterial cell.\nWhen plated at 30 degrees, both types of phage will form plaques. We will assume that both, those with\nthe cI mutation and those with a wild-type copy of cI, are equally successful at invading bacterial cells.\nThen, 1/2 of the plaques will have clear centers, this group coming from the half of the phage that carry\nthe cl- mutation, and the other 1/2 will have turbid centers, those coming from the half of the phage that\nare wild-type in the cl gene. Note that recombination will not change the relative numbers of phage that\nhave the cl- mutation and the wild-type copy of the cl gene.\nc) In order to have plaques at 42 degrees, the repressive temperature, a recombination event must occur\nbetween ts-1 and ts-2. This will result in phage that are doubly mutant for ts-1 and ts-2 (these\nrecombinants will not grow) and phage that are wild-type for ts-1 and ts-2 (these recombinants will grow).\nAmong the phage that do grow, i.e. those that are wild-type for ts-1 and ts-2, we see 85 that form clear\nplaques and 15 that form turbid plaques. The clear plaques (those with the cI- mutation) are more\ncommon; the turbid plaques (those with a wild-type copy of cl) likely resulted from an additional\nrecombination event.\nThere are three potential orders for these genes: cI in the middle, ts-1 in the middle, and ts-2 in the\nmiddle. Let's look at each of these orders and what genotype results from a single and double\nrecombination event:\nThe first order that we will consider is having ts-2 in the middle.\nts-1\n+\n+\nts-1 ts-2\ncI\n+\nts-2\ncI-\n+\n+\n+\nA single recombination event between ts-1 and ts-2 results in two classes, the one of interest is wild-type\nin ts-1 and ts-2 and would form turbid plaques.\nts-1\n+\n+\nts-1 ts-2\n+\n+\nts-2\ncI-\n+\n+\ncI-\nA double recombination event gives two types of phage, the one of interest is wild-type in the ts-1 and ts\n2 genes and forms clear plaques.\nIf this were the gene order, we would expect that at 42 degrees, turbid plaques would be more common\nthan clear plaques. This is not what we observe, so it cannot be the order.\nThe next order to consider is putting ts-1 in the middle:\n+\nts-1\n+\n+\n+\ncI-\nts-2\n+\ncI-\nts-2 ts-1\n+\nA single recombination event between ts-1 and ts-2 results in two classes, the one of interest\nis a phage that is wild-type in ts-1 and in ts-2 and would form clear plaques.\n\n+\nts-1\n+\n+\n+\n+\nts-2\n+\ncI-\nts-2 ts-1\ncI-\nA double crossover event gives two types of phage, the one of interest is wild-type in ts-1 and ts-2 and\nwould form turbid plaques. If this were the gene order, we would expect that at 42 degrees, clear plaques\nwould be more common than clear plaques. This is what we observe, so this is a possible gene order.\nNow we need to figure out the distances between the genes.\nWe have 100 plaques at 42 degrees, each of these resulted from a recombination event between ts-1\nand ts-2. 15 of these plaques are turbid, resulting from a second recombination event between ts-1 and\ncI. In this case, we do not need to double-count the recombinants, since the other resulting recombinant\nclass is not part of the 100 plaques examined.\nUsing the formula:\ndistance from ts-1 to cI (m.u.) = (15/100) x 100 = 15 m.u.\nA final map is:\nts-2\nts-1\ncI\n0.6m.u.\n15 m.u.\nWe have neglected considering the final order, with cI in the middle. This order is also possible, but\ngiving the map above is a complete answer; we are only providing this alternative order for completeness.\nWhen cl is in the middle, we have the following arrangement:\nts-1\n+\n+\n+\ncI-\nts-2\nA single crossover could occur either between ts-1 and cI or between cI and ts-2.\nts-1\n+\n+\n+\ncI-\nts-2\nIf a single crossover occurred between cI and ts-2, the result would be:\nts-1\n+\nts-2\n+\ncI-\n+\nAmong these recombinants, the one that has the wild-type copies of the ts-1 and ts-2 gene would have\nclear plaques.\n+\n+\n+\nts-1\ncI-\nts-2\nIf a double crossover occurred, the result would be:\nts-1\ncI-\n+\n\n+\n+\nts-2\nAmong these recombinants, the one that has the wild-type copies of the ts-1 and ts-2 gene would have\nturbid plaques. If this were the gene order, with cI in the middle, and the likelihood of a single crossover\nmore likely between cI and ts-2 (and not ts-1 and cI), then we would see the results described, i.e. more\nclear plaques than turbid plaques among 100 plaques examined at 42 degrees.\nThe map distance between ts-1 and cI would then be 15% of the map distance between ts-1 and ts-2.\nSince we already know the map distance of ts-1 and ts-2 to be 0.6 m.u., the final map would be:\nts-1\ncI-\nts-2\n0.09 m.u.\n0.51 m.u.\nThe remaining possibility is that the distance between cI and ts-1 is much larger than the distance\nbetween cI and ts-2 for this map order. However, this arrangement will give more clear than turbid\nplaques, and is therefore disproved by our experimental results."
    },
    {
      "category": "Assignment",
      "title": "pset2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/d40ae3f9cf729acf764c2186dca6b9da_pset2.pdf",
      "content": "7.03 Problem Set 2\nDue before 5 PM on Thursday, September 25\nHand in answers in recitation section or in the box outside the class\n1. Consider a portion of an autosome in Drosophila, which carries the following three\nrecessive markers: black body (b-), purple eyes (pr-), and vestigial wings (vg-). The\ncorresponding wild type alleles of each gene are designated b+, pr+, and vg+. A genetic\nmap of this portion of the chromosome is shown below:\nb\npr\nvg\n6 cM\n13 cM\nThe measured two-factor distance between b and pr is 6 cM, and the distance between pr\nand vg is 13 cM.\n(a) Imagine that you want to set up a cross to verify these map distances and you have in\nthe lab a true-breeding strain with black body and vestigial wings. What type of true\nbreeding fly would you want to mate to in order to carry out a three-factor cross with b, pr,\nand vg?\n(b) For the cross described in (a) what type of strain would be the best to mate to in order\nto score the gamete genotypes passed to the next generation?\n(c) What would be the rarest phenotypic class(es) produced from the cross in part (b)?\n(d) Write out the eight possible genotypes produced in the cross described in part (b). If\n1,000 progeny are produced in this cross, how many of each type would you expect?\n(e) What would you expect the measured distance between b and vg to be in a two-\nfactor cross between these markers? Explain why this distance is less than the sum of the\nb-pr and pr-vg distances (i.e. 19 cM)?\n\n2. You have isolated two different yeast mutants that will not grow on medium that lacks\narginine. You call these mutants arg1- and arg2-.\na) Mating of either arg1- or arg2- to wild type produces diploids that can grow without\narginine. Mating of arg1- to arg2- produces a diploid that also can grow on medium\nwithout arginine. What do these results tell you about the arg1- and arg2- mutations?\nb) Sporulation of the diploids produced by the mating of arg1- to arg2- yields tetrads of\nthe following types:\ntype 1\ntype 2\n1 Arg+, 3 Arg-\n4 Arg-\nOut of 20 tetrads, 2 are type 1, and 18 are type 2. Categorize each of the tetrad types as\nparental ditype (P), tetratype (T), or nonparental ditype (N). If the markers are linked give\nthe distance between them in cM. Does this result tell you anything new about the gene(s)\nmutated in arg1- and arg2-?\nc) Now you isolate a third mutant called arg3-. When this mutant is mated to wild type the\nresulting diploids cannot grow without arginine. When arg3- is mated to arg1- the resulting\ndiploid cannot grow without arginine. What do these results tell you about arg3- and its\nrelationship to arg1-?\nd) When the diploid produced by mating arg3- to arg1- is sporulated tetrads of three\ntypes are produced.\ntype 1\ntype 2\ntype 3\n1 Arg+, 3 Arg-\n4Arg-\n2 Arg+, 2 Arg-\nOut of 20 tetrads, 12 are type 1, 5 are type 2, and 3 are type 3. Categorize each of the\ntetrad types as parental ditype (P), tetratype (T), or nonparental ditype (N). What does\nthis result tell you about the relationship between arg3- and arg1-? Give any relevant\ndistances in cM.\ne) Based on these results deduce the relationship between arg3- and arg2-. In a mating\nof arg3- to arg2- what would the phenotype of the resulting diploid be? If this diploid\nwere sporulated and 60 tetrads were examined how many tetrads of each type would you\nexpect?\n\n.\n3. You have isolated two temperature-sensitive mutations in phage l. These phage\nmutants are called ts-1 and ts-2. Each mutant will form plaques at 30 C but not at 42 C.\nYou cross ts-1 to ts-2 phage by coinfecting E. coli at the permissive temperature of 30 C.\nWhen the resulting phage lysate is plated at 30 C you count 105 plaques per ml of phage\nlysate, but when the same phage lysate is plated at 42 C, there are 300 plaques per ml.\n(a) What is the distance between the ts-1 and ts-2 mutations in m.u.?\nYou next cross a ts-1 phage strain to a ts-2 phage strain that also carries a cI- mutation,\nwhich gives plaques with clear centers. When the resulting lysate is plated out at 42 C and\n100 plaques are examined, 85 are clear and 15 have normal turbid centers.\n(b) If the page produced from this cross were plated at 30 C, what fraction of the plaques\nwould you expect to have clear centers?\n(c) Draw a map showing the relative order of cI- , ts-1 and ts-2 as well as all of the\ndistances you can calculate in m.u."
    },
    {
      "category": "Assignment",
      "title": "pset3_ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/9c4d5eebbba875cb7f37e95a569bafb8_pset3_ans.pdf",
      "content": "7.03 Fall 2003\nProblem Set #3 Solutions\nIssued Friday, October 17, 2003\n\n1.\n(a) We are analyzing mutagens that specifically induce G·CÆA·T mutations in\nDNA. Therefore, we must determine the potential double stranded DNA sequences that\nwill encode stop codons after going through this specific mutation.\n\nWe will start with 5'UAG3'. The double stranded DNA that corresponds to 5'UAG3' is:\n3'ATC5' template strand\n5'TAG3' coding strand\n\nWe need to figure out what specific double stranded DNA sequences could have\nundergone a G·CÆA·T mutation to become the sequence above. To do this, just work\nbackwards and change the AT base pairs in the above sequence into GC base pairs, one\npair at a time. If you do this, you will get the following double stranded DNA sequences\n(the mutated bases are boldfaced):\n3'GTC5' template strand\n5'CAG3' coding strand (codes for Gln)\n\n3'ACC5' template strand\n5'TGG3' coding strand (codes for Trp)\n\nThese two sequences each underwent one G·CÆA·T mutation to become DNA that\nencodes the 5'UAG3' stop codon. We have chosen to make only one mutation per three\nbase pairs because the likelihood of a mutagen acting on two consecutive base pairs (or\ntwo base pairs out of three) is extremely small. We can neglect those extremely rare\nevents since this problem is asking why something \"generally\" happens.\n\nNow, repeat the process for the other two stop codons. The double standed DNA that\nencodes 5'UGA3' is:\n3'ACT5' template strand\n5'TGA3' coding strand\n\nAnd the DNA possible sequences that could have been mutated to become the above\nsequence are:\n3'GCT5' template strand\n5'CGA3' coding strand (codes for Arg)\n\n3'ACC5' template strand\n5'TGG' coding strand (codes for Trp)\n\nLastly, repeat for 5'UAA3'. Its corresponding DNA is:\n3'ATT5' template strand\n5'TAA3' coding strand\n\nAnd the DNA possible sequences that could have been mutated to become the above\nsequence are:\n3'GTT5' template strand\n5'CAA3' coding strand (codes for Gln)\n\n3'ACT5' template strand\n5'TGA3' coding strand (codes for UGA stop codon)\n\n3'ATC5' template strand\n5'TAG3' coding strand (codes for UAG stop codon)\n\nNotice that for UGA and UAG, the two candidate sequences for mutation both encode\namino acids, whereas for UAA, only one of its candidate sequences encodes an amino\nacid. The other two correspond to stop codons. When G·CÆA·T mutagens are\nintroduced, they mutate random base pairs along the DNA sequence. Given that there\nare more targets for the creation of TGA and TAG nonsense mutations, these two\nmutations will occur more frequently than TAA mutations.\n\n(b) The amber TAG mutation has the following mRNA codon, tRNA anticodon, and\ncorresponding DNA coding for the anticodon portion of the tRNA:\nmRNA codon 5'UAG3'\ntRNA anticodon 3'AUC5'\nDNA encoding anticodon portion 5'TAG3' template strand for tRNA transcription\n3'ATC5'\nThis DNA sequence is also the sequence that codes for the anticodon portion of amber\nsuppressing tRNA alleles. In other words, we want the mutagen to change normal DNA\nsequences into this sequence, so that we can have amber suppressing alleles. To find\nwhich tRNA genes can be altered to become the DNA sequence above, we can work\nbackwards like in part (a). Now, since we have a G·C<->A·T mutagen, we can change\nAT pairs into GC pairs, and vice versa. Again, we will change one base pair at a time. If\nwe do this, we will get the following three DNA sequences (the mutated bases are in\nboldface):\n\nDNA encoding anticodon portion 5'CAG3' tRNA template (for tRNAGln)\n3'GTC5'\n\nDNA encoding anticodon portion 5'TGG3' tRNA template (for tRNATrp)\n3'ACC5'\n\nDNA encoding anticodon portion 5'TAA3' tRNA template (for UAA stop tRNA)\n3'ATT5'\n\nIf you follow the flow of genetic information, you will see that these three sequences\ncode for the anticodon portion of tRNAGln, tRNATrp, and the tRNA that recognizes the\nUAA stop codon. So the gln and trp tRNA genes can be mutated to become amber\n\nsuppressors. The codons normally recognized by tRNAGln and tRNATrp are 5'CAG3'\nand 5'UGG3', respectively.\n\nWe gave full credit to those who ended the solution here. But since the problem asked\nwhich genes could \"in principle\" be altered to become amber suppressors, we can\nconsider cases where two or three base pairs from each codon were altered by the\nmutagen. In that case, we would arrive at the following DNA sequences (with the\ncorresponding mRNA codons also listed):\n\nDNA encoding anticodon portion 5'CGA3' tRNA template (for tRNAArg)\n3'GCT5'\nmRNA codon 5'CGA3'\n\nDNA encoding anticodon portion 5'CGG3' tRNA template (for tRNAArg)\n3'GCC5'\nmRNA codon 5'CGG3'\n\nDNA encoding anticodon portion 5'CAA3' tRNA template (for tRNAGln)\n3'GTT5'\nmRNA codon 5'CAA3'\n\nDNA encoding anticodon portion 5'TGA3' tRNA template (for UGA stop tRNA)\n3'ACT5'\nmRNA codon 5'UGA3'\n\nSo assuming the mutagen can change two or three bases pairs in the same triplet, we\narrive at additional tRNA genes that can be mutated to become amber suppressors. These\nare two tRNAArg genes and another tRNAGln.\n\n2. (a) D = IS, X= OriT\nHfr #1: A DXDB = C D D\n\nA transferred early\nHfr #2: A DB = W = C D D\nC (and then D) transferred early\nHfr #3: A DB = C D XDD\n\nC (then B then A) transferred early\n\n(b) label the order of IS from A D . . . DD\n\nHfr #\nRecombination\nBetween IS #s\nRecombinatory Result\nProduct Early\n1 & 2\nDX\nF\n---\n1 & 3\nA DB = W = C D D\nHfr\nC, D\n1 & 4\nDXDB = C\nF'\nC, B\n\n2 & 3 (or 3&4*) A DXDB = C D D\nHfr\nA\n2 & 4\nA DXD D\nHfr\nA\n1 & 2 or 3 & 4\nA DB = W = C D D\nHfr\nC, D\n1 & 3\nA D XDB= C D D\nHfr\nA\n(1&4*)\nDB = W = C\nF'\nC, B\n2 & 3\nW =\nF\n---\n2 & 4\nA DB = C DXD D\nHfr\nC, B, A\n2 & 3 (or 1&2*) A DB = C D XDD\nHfr\nC, B, A\n1 & 3\nA D XDD\nHfr\nA\n1 & 4\nB = C D XD\nF'\nC, B\n2 & 4\nA DB = W = C DD\nHfr\nC, D\n3 & 4\nXD\nF\n---\n* denotes recombinatory events between two IS sequences NOT flanking the OriT\n(The p-set asked only for events between sequences that flank the OriT. Therefore these\nare extraneous answers)\n\n3.\n(a) The donor strain is Lac+ and the recipient strain is Lac-. Therefore, in the\nLac+ Kanr transductants, lac1+ was cotransduced with Tn5. So the distance between Tn5\nand the lac1- mutation is:\n(18/100) · 100% = 18%\n\n(b) Since none of the 100 Kanr tranductants were Lac+, we can conclude that Tn5 was\nnever co-transduced with lac2+. This indicates that the distance between lac2- and Tn5 is\nat least one phage head (105 bp). We know from part (a) that Tn5 and lac1- are within\none phage head since their cotransduction frequency was 18%. But since we do not know\nthe relative order of the three markers, we cannot say whether the two lac mutations are\nwithin one phage head. If Tn5 were between lac1- and lac2-, then the distance between\nthe two mutations would be more than one phage head. However, if Tn5 were not the\nmiddle marker, we cannot say whether lac1- and lac2- are one phage head apart. So the\nonly conclusion we can draw from this data is that lac1- and lac2- are very far from\neach other. Therefore, they are unlinked, and are mutations in two different genes.\n\n(c) The best way to solve this type of problem is to draw out the two crosses. We will\nconsider only two possible orders, instead of three, because the order where Tn5 is in the\nmiddle is impractical for three-factor cotransduction experiments. It is likely that Tn5\ninsertion between the two markers of interest (which are close together in this case) will\noccur in a coding region, causing an additional mutation that would skew the\nexperimental data.\n\nThere are two reciprocal crosses and two possible orders. So we will have to draw four\ndiagrams:\n\n(1- and 1+ will denote the mutant and WT loci of lac1, respectively. Similarly, C- and C+\nwill denote the mutant and WT loci of lacc)\n\nOrder #1 (Tn5, lac1, lacc)\nOrder #2 (Tn5, lacc, lac1)\n\nCross #1\n(Tn5, 1-\ncrossed\nto C-)\n\nTn5 1- C+\n~~~~~~~~~~~~~~~~~~~~~~\nX X X X\n------------------------------------\n1+ C-\n\nTn5 C+ 1-\n~~~~~~~~~~~~~~~~~~~~~~\nX X\n------------------------------------\nC- 1+\n\nCross #2\n(Tn5, C-\ncrossed\nto 1-)\n\nTn5 1+ C-\n~~~~~~~~~~~~~~~~~~~~~~\nX X\n------------------------------------\n1- C+\n\nTn5 C- 1+\n~~~~~~~~~~~~~~~~~~~~~~\nX X X X\n------------------------------------\nC+ 1-\n\nThe data given will allow us to determine which of the two possible orders is correct. As\nin any three factor cross, we determine order by looking for the rarest class. In this case,\nthe rarest class shows normal B-gal expression. The genotype of this class is Tn5, 1+, C+.\n\nFrom the data, we see that cross #1 produced four such transductants while cross #2\nproduced none. This is the key observation that allows us to determine order.\n\nWe look back to our diagrams. The X's indicate the crossovers that needed to occur to\ngive the Tn5, 1+, C+ genotype (which gives normal B-gal expression). Assuming order\n#1 is correct, we would get more normal B-gal transductants from cross #2, since only\ntwo crossovers are required as opposed to four. Assuming order #2 is correct, we would\nget more normal B-gal transductants from cross #1. This is what the data shows. There\nare four normal B-gal trandsductants from cross #1 and none from cross #2. Therefore,\norder #2 is the correct order: ____Tn5________________ lacc ___lac1-__\n[------------------18%-------------------]\n[-----------24%-------------]\n\nThe Tn5 to lac1- distance is 18% as calculated in part (a).\n\nThe Tn5 to lacc distance is found in the data for the first reciprocal cross. The 76/100\nKanr b-gal constitutive transductants from this cross received Tn5 but did not receive C+.\nTherefore, P(no cotransduction between Tn5 and lacc) = 76%\n\nWe can see that: P(cotransd. btw Tn5 and lacc) = 1 - P(no cotransd. btw Tn5 and\nlacc) = 100% - 76% = 24%\n\nThe distance between lacc and lac1 is very small. This is indicated by the fact that there\nare very few transductants that exhibit normal b-gal expression (crossing over between\nlacc and lac1 needs to occur to produce transductants with normal b-gal expression in\nboth crosses). The exact distance between lacc and lac1 cannot be calculated since we\nonly selected for Kanr transductants. Therefore, all data is relative to the Tn5 marker.\n(d) The F' plasmid carries Tn5 and lac3- while the chromosome has a lac1-. When\nselecting for Kanr, you are selecting for cell that have successfully taken in the F plasmid,\nwhich confers resistance to kanamycin.\nIf there merodiploids express b-gal normally, then you can conclude that the lac1- and\nlac3- mutations lie in different genes (they complement each other).\nIf the merodiploid were Lac-, then you can draw one of two conclusions, which are\nindistinguishable without further experimentation: (1) the two mutations lie in the same\ngene, or (2) one (or both) of the mutations is dominant to wild type.\n\n4. A KanR, TetR transductant results when recombination of the Tn5 occurs in the\ngenome in a place not overlapping with the insertion site of Tn10. This happens\n9920/10000 times, or 99.2% of the time. Similarly, A KanR, TetS transductant results\nwhen recombination of Tn5 occurs in the genome in a place overlapping with the\ninsertion site of Tn10, thus disrupting the TetR gene . This happens 80/10000 times, or\n0.8% of the time.\nWe are told that the average size of a recombined fragment is 55kbp, this means that a\nphage head can fit 55 kbp of DNA, which is larger than either Tn10 or Tn5. We can find\nthe size of the genome by seeing that 55kbp is proportional to the size of the genome just\nas 0.8% is proportional to 100% (0.8% recombination tells us the phage is holding 0.8%\nof the genome). However, before we can use 55kpb to find the genome size, we must\nsubtract the 5kbp of Tn5. We subtract off 5kbp because there is no Tn5 in the genome,\nso there is no possibility of recombination within this region. Therefore, it is not counted\nin our measurement of recomination.\nTherefore: 80/10,000 = 0.008 = the probability that the 50 kbp phage DNA with Tn5\nrecombined into a spot overlapping Tn10.\n0.008/50 = 1/(total genome length) --> from this we get a total genome lenth of\n6250kbp.\n\nnote: A common mistake would be to subtract the size of the Tn10 off of the final\nanswer. This is not correct, because it was never included in the 6250kbp in the first\nplace, as there is no Tn10 in the 55kbp of DNA and there was never a chance of\nrecombination."
    },
    {
      "category": "Assignment",
      "title": "pset3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/ccbf8ce6203a0f361aa50bd24e9a1e06_pset3.pdf",
      "content": "7.03 Problem Set 3\nDue before 5 PM on Thursday, October 16\nHand in answers in recitation section or in the box outside the class\n1. (a) The three stop codons are 5'UAG3', 5'UAA3', and 5'UGA3'. Explain why\nmutagens that specifically induce G-C to A-T mutations will generally produce TAG\n(amber) and TGA nonsense mutations more frequently than TAA (ochre) mutations.\n(b) You are trying to isolate tRNA mutations that will suppress and amber (TAG) mutation.\nTo increase the frequency of such mutations you use a mutagen that produces transition\nmutations (i.e. C-G to T-A and T-A to C-G base changes). Which tRNA genes could in\nprinciple be altered by the mutagen to give the desired suppressor mutation? For your\nanswer give the sequence of the codon normally recognized by the tRNA. In addition, write\nout the DNA base sequence of the segment of the tRNA gene that codes for the anticodon\nsequence for both the wild-type and suppressor alleles of the gene. Please show both\nstrands of the DNA and indicate the 5' and 3' ends of each strand indicating which strand is\nused as the template for transcription of the tRNA molecule.\n2. The diagram below shows the F factor and a portion of the E. coli chromosome that has\nthree different insertion sequences (IS) of the same type as is carried on F.\nori T\nIS\nIS\nIS\nIS\nA\nD\nC\nB\nFigure by MIT OCW.\n(a) Draw a diagram of the three different Hfrs that can be formed by recombination between the\nIS on F and each of the IS sequences on the chromosome. For your answer, include the positions\nof each of the markers (A, B, C, and D) and state which of these markers would be transferred\nearly. (You will need to take into account the orientation of the IS and origin of transfer (ori T) on F as\nwell as the orientations of the different IS sequences in the chromosome.)\n(b) For each to the three Hfrs in part (a) consider the outcome of further crossovers between IS\nsequences flanking the integrated F factor (there should be five different relevant IS by IS\nrecombinations for each of the three Hfrs). For each possible recombination events state whether\nthe product is F, an F' or an Hfr. Also provide information about which markers will be transferred\non the F's and which markers will be transferred early by the Hfrs.\n\n3. Wild type E. coli metabolizes the sugar lactose by expressing the enzyme ß-galactosidase.\n-\nYou have isolated a mutant that you call lac1 , which cannot synthesize ß-galactosidase and cannot\ngrow on lactose (Lac-).\n(a) You have a wild type (Lac+) strain carrying a Tn5 insertion known to be near several Lac\ngenes on the E. coli chromosome. You grow P1 phage on this strain and use the resulting phage\n-\nlysate to infect the lac1 strain, selecting for kanamycin resistance (Kanr). Among 100 Kanr\ntransductants, you find that 82 are Lac- and 18 are Lac+. Express the distance between Tn5 and\n-\nthe lac1 mutation as a cotransduction frequency.\n-\n(b) You isolate a second Lac- mutation, which you designate lac2 . Using the same P1 lysate as\n-\nin part (a) you infect the lac2 strain, selecting for Kanr transductants. In this case, all 100 Kanr\ntransductants that are examined are Lac-. What does this result tell you about the relationship\n-\n-\nbetween the lac1 and lac2 mutations?\n(c) Next, you isolate a mutation that constitutively expresses abnormally high levels of ß\nc\nc\ngalactosidase, which you designate lac . Preliminary P1 transduction experiments indicate that lac\n-\nis linked to the Tn5 insertion described in part (a). To map lacc relative to lac1\nyou set up two\nreciprocal crosses. In the first cross you grow P1 on a strain that carries the Tn5 insertion and the\n-\nlac1\nmutation. You then use this lysate to infect a lacc mutant and select for Kanr. From 100 Kanr\ntransductants examined, 20 are Lac-, 76 express ß-galactosidase constitutively and 4 show\nnormal ß-galactosidase expression. In the second cross you grow P1 on a strain that carries the\n-\nTn5 insertion and the lacc mutation. You then use this lysate to infect a lac1 mutant, and select for\nKanr. From 100 Kanr transductants examined, 81 are Lac- and 19 express ß-galactosidase\n-\nconstitutively. Draw a genetic map showing the relative positions of the Tn5 insertion and the lac1\nand lacc mutations. Express any measured distances as cotransduction frequencies.\n-\n(d) A third Lac- strain, called lac3 , is linked to the Tn5 insertion. From a strain carrying the Tn5\n-\ninsertion and lac3\nmutation you isolate an F' that caries a region of the chromosome that includes\nboth Tn5 and the linked Lac region (You know from mapping experiments that this region includes\n-\n-\nthe sites of both the lac1 and lac3 mutations). You introduce this F' into an F- strain carrying\n-\nlac1 by selecting for Kanr. These merodiploids express ß-galactosidase normally. What does\n-\n-\nthis result tell you about the relationship between the lac3 and lac1 mutations? If the\n-\nmerodiploid were Lac-, what could you conclude about the relationship between the lac3 and\n-\nlac1 mutations? (Be sure to consider all the possibilities.)\n\n4. In your study of a new bacterial species you have identified a transducing phage that you call\nPx. In addition you have worked out methods to make random transposon insertions into the\nbacterial genome. You have generated two different transposon insertion collections one with 105\nrandom Tn5 (Kanr) insertions and the other with 105 random Tn10 (Tetr) insertions. You grow Px\nphage on the mixed collection of Tn5 insertions and use the resulting phage lysate to infect the\nmixed collection of Tn10 insertions. You select 10,000 Kanr transductants and find that 80 of them\nare Tets. Use this information to estimate the total size of the bacterial genome assuming that\nboth Tn5 and Tn10 insert randomly and that the average size of a fragment recombined into the\nrecipient geneome during Px transduction is 55 kbp. (Tn5 is about 5 kbp and Tn10 is 10 kbp.)"
    },
    {
      "category": "Assignment",
      "title": "pset4_ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/ab4b45787fcc87c56d95c57a80f1c730_pset4_ans.pdf",
      "content": "7.03 Problem Set 4 Key\n1. a. We can think of lac permease activity (from LacY+) and beta-galactosidase activity\n(from LacZ+) as reporters for Lac operon expression from the bacterial chromosome and\nthe F', respectively. In other words, lac permease activity tells us whether the operon on\nthe bacterial chromosome is regulated, constitutive, or uninducible; and beta-\ngalactosidase activity tells us whether the operon on the F' is regulated, constitutive, or\nuninducible.\nLac1- is a dominant, cis-acting mutation. It is dominant because lac permease activity\nis still constitutive in the merodiploid with one wild-type allele and one Lac1- mutation.\nLac1- is cis-acting because it can only confer constitutive expression on the reporter in\ncis with itself (LacY+), while the reporter is trans (LacZ+) is regulated.\nLac2- is a dominant, trans-acting mutation. It is dominant because lac permease\nactivity is still constitutive in the merodiploid with one wild-type allele and one Lac2\nmutation. Lac2- is trans-acting because it can confer constitutive expression on both the\nreporter in cis (LacY+) and the reporter is trans (LacZ+).\nLac1- best fits the properties of LacOC mutations (cis-acting dominant) and Lac2\nbest fits the genetic characteristics of LacI-d mutations (trans-acting dominant).\nb. LacP- mutations result in decreased expression of Lac operon genes, nevertheless,\nexpression is still regulated by IPTG. A LacOC mutation, on the other hand, would result\nin unregulated expression of Lac operon genes. In other words, the activity of both beta-\ngalactosidase and lac permease would be independent of IPTG in LacOC. Because the\npromoter is required for expression and the operator is involved for regulation of the\noperon, this implies that LacP and LacO represent functionally distinct sites on the DNA.\nIt is possible to imagine mutations in the operator that would give results like the LacP\nmutation, thus confounding the conclusion we just drew. For example, there could be a\nmutation in LacO that results in a greater binding affinity with the Lac repressor. In such\na state, expression of the operon's genes can almost be completely off in the absence of\nIPTG and only slightly induced in the presence of IPTG (like the LacP- mutations). We\ncan, however, differentiate this from LacP- with further experimentation. With a LacO\nmutation we can increase expression of the operon by increasing the amount of IPTG\nbecause the operator is again the region regulated by the inducer. On the other hand,\nLacP- there will an insensitivity to IPTG inducer pass a particular point because its\nfunction is dependent on binding to RNA polymerase. In any case, this scenario is\nunlikely, as it is much more difficult to get a mutation in LacO that produces a higher\nbinding affinity with Lac repressor than it is to get a mutation that produces a lower\nbinding affinity.\n\nc. In Lac3-, a part of LacI is deleted in addition to the promoter. From the data, we\ncan deduce that the wild-type allele of Lac3- is a trans-acting factor, as beta-galactosidase\nactivity becomes regulated when the wild-type allele (brought in on F') is in trans with\nwild-type LacZ. The wild-type LacI gene product can act to regulate the expression of\nboth the chromosomal and the F' operon. The Lac3- mutation would result in a non\nfunctional gene product (LacI-, which is consistent with the data.\nIn Lac4-, a part of LacO is deleted in addition to the promoter. From the data, we\ncan deduce that the wild-type allele of Lac4- is a cis-acting factor, as beta-galactosidase\nactivity is still unregulated when the wild-type allele (from the F') is in trans with the\nwild-type LacZ. The Lac4- mutation would result in an operator that the Lac repressor\ncan no longer bind, so expression is constitutive (LacOC), although at the decreased over\nall level of expression compared to wild-type owing to the promoter deletion.\nLac4- could possibly represent a LacI-d like mutation as judged from the data, but we\nknow that such mutation affect the N-terminus of the protein product (the 5' part of the\ncoding strand), so this is unlikely because the majority of the LacI gene would have to be\ndeleted to reach the 5' region.\n2. a. We can classify MelA- as a recessive, loss of function mutation, whose wild-type\nallele codes for a trans-acting factor. Because an amber suppressor can restore the\nwild-type phenotype, the MelA- mutation is most likely an amber mutation. Amber\nsuppressors are only about 5% effective, thus the mutant allele is most likely recessive\nbecause 5% wild-type protein is unlikely to suppress the mutant phenotype for a\ndominant mutant allele. Because the wild-type allele codes for a functional protein\nproduct, we know that it is a trans-acting factor. We also know that MelA and Mel1 are\ndifferent genes because they are unlinked.\nMelA is likely a negative regulator of Mel1 expression. The MelA- mutation causes\nconstitutive activity, which is consistent with loss of function of a negative regulator.\nb. MelB- is a recessive mutation whose wild-type allele codes for a trans-acting\nfactor that is not Mel1. We know that MelB- is recessive because MelB-/F' Mel+\nresults in regulated melibiose activity, rather than uninducible. Mel1- is also a recessive\nmutation using the same reasoning as with MelB-. With two recessive mutation, a\ncomplementation test is then performed (MelB-/F' Mel1-). The result is that MelB- and\nMel1- complement each other, meaning that they are mutations in different genes. This\nstrain (MelB-/F' Mel1-) also allow us to deduce that MelB's wild-type gene product is\ntrans-acting because we observe regulated activity when wild-type MelB is placed in\ntrans with wild-type Mel1.\nMelB is likely a positive regulator of Mel1 expression. The MelB- mutation causes\nuninducible activity, which is the result of a recessive mutation in a positive activator.\n\n2c) We know that melibiose and MelB both have a net positive effect on Mel1 activity, and\nMelA has a net negative effect on Mel1 activity. Therefore there are two possible models:\nmelibiose++melB\nmelA\nmel1\nmelibiose\nmelA\nmelB++mel1\nThere could be other models consistent with this data, but these two models are the simplest.\n2d) The phenotype of the MelA- MelB- double mutant is identical to the MelB- mutant. Since\nMelB- is epistatic to MelA-, the correct pathway must be:\nmelibiose\nmelA\nmelB++mel1\n2e) Because MelC-/ F' Mel+ has melibiase activity in both the presence and absence of\nmelibiose, we know that MelC- is dominant and constitutive. Furthermore, because MelC\ncauses constitutive melibiase activity in either cis or trans to Mel1+, it is a trans-acting factor.\nTherefore the two possibilities consistent with this data are MelC- being either a dominant\nnegative mutation in a negative regulator (repressor-d) or a super activator mutation (activators).\n2f) If we assume that MelB- and MelC- are mutations in the same activator\ngene, then MelB- must cause a loss-of-function in the activator, while MelC\nmust cause a gain-of-function that renders the activator unresponsive to the\nMelA negative regulator protein. One possibility is that the MelA protein\nnormally binds to the MelB protein, and the MelC- mutation affects the\nprotein such that MelA can no longer bind. Alternatively, MelA may be a\nrepressor that binds to an operator in front of the MelB gene, and the MelC\nmutation is a mutation in the operator of MelB, causing constitutive MelB\nexpression. The easiest way to distinguish these two possibilities from\neach other would be by sequencing the MelB gene and the upstream sequences\nin both wt and MelC- bacteria. By comparing the sequences from wt and MelC\nit would be possible to determine where the MelC- mutation lies. If the\nmutation lies in the operator for the MelB gene then we would know that MelA\nis a repressor that binds to an operator in front of MelB. If the mutation\nlies in the MelB gene itself then we would know that MelA protein negatively\nregulates the MelB protein.\n\nMelC-is a mutation in\nMelB operator\nMelC-is a mutation in MelB\nprotein coding sequence"
    },
    {
      "category": "Assignment",
      "title": "pset4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/79d13f75cda2da9a89358297533eaf9c_pset4.pdf",
      "content": "7.03 Problem Set 4\nDue before 5 PM on Thursday, October 23\nHand in answers in recitation section or in the box outside the class\n1. (a) You have isolated two mutations in the Lac operon that cause constitutive\nexpression of Lac genes. You designate these mutants Lac1- and Lac2-. Making use of\nan F' that carries the Lac operon with the LacY gene mutated, you construct strains that you\ntest for both ß-galactosidase activity and Lac permease activity with results shown below.\nß-galactosidase activity\nLac permease activity\n- IPTG\nLac 1- Lac Z- / F' LacY -\n-\nLac 2- Lac Z- / F' LacY -\n+\n+ IPTG\n- IPTG\n+ IPTG\n+\n+\n+\n+\n+\n+\nClassify each mutation as dominant or recessive and as cis- or trans-acting, giving the\nexperimental result that allows you to arrive at each conclusion. Finally, deduce what type\nof Lac mutation best fits the properties of Lac 1- and of Lac 2-.\n(b) The first Lac promoter mutations that were isolated were \"leaky\" mutations that\ndecreased, but did not entirely eliminate, the promoter function. The table below shows the\nbehavior of such mutants giving the quantity of ß-galactosidase activity and Lac permease\nactivity produced.\nß-galactosidase activity\nLac permease activity\n- IPTG\nLac+ (wild type)\nLacP-\n+ IPTG\n- IPTG\n+ IPTG\nThe LacP- mutations map very close to LacOc nevertheless researchers concluded that\nLacP and LacO represent functionally distinct sites on the DNA. Explain how the results\nshown above would lead to such a conclusion.\n\n(c) You have isolated two mutations that show decreased expression of the Lac operon.\nHowever, unlike like the promoter mutations described in part (b) these mutations don't\nrespond to the inducer IPTG. These mutations, designated Lac3- and Lac4-, are evaluated\nfor the quantity of ß-galactosidase and permease activity expressed with or without IPTG:\nß-galactosidase activity\nLac permease activity\n- IPTG\n+ IPTG\n- IPTG\n+ IPTG\nLac 3-\nLac 3- / F' Lac I+LacZ -\nLac 4-\nLac 4- / F' Lac I+LacZ -\nna\nna\nna\nna\n(na = not assayed)\nMapping experiments reveal that Lac3- and Lac4- are different short deletions located in\nthe region before the start of the LacZ gene. Given the data shown above suggest which\ngenetic element(s) in addition to part of the promoter has been deleted in each mutant.\nExplain your reasoning.\n2. You are studying a new strain of E. coli that can utilize the disaccharide melibiose very\nefficiently. You find that utilization depends on the enzyme melibiase, which is encoded by\nthe gene Mel1. Mel1 is not expressed unless melibiose is present in the growth medium.\n(a) You have isolated a mutation that causes constitutive melibiase activity, which you\ndesignate MelA-. P1 phage mapping experiments using a Tn5 insertion linked to Mel1\nshow that MelA- is not linked to Mel1. Moreover you find that when an amber suppressor\nis introduced into a MelA- mutant, normal melibiase regulation is restored. Classify the\nMelA- mutation in terms of its basic genetic properties explaining the rationale behind your\nconclusions. Based on these properties make a proposal for the type of regulatory\nfunctions affected by the MelA- mutation.\n(b) Next you isolate a mutation, designated MelB-, which gives uninducible melibiase\nactivity. Mapping experiments show that MelB- is linked to Mel1. Using an F' factor that\ncarries the chromosomal region surrounding Mel1, you perform the following genetic tests:\nmelibiase activity\nwild type (Mel1+)\nMel1-\nMelB-\nMelB- / F' Mel+\nMel1- / F' Mel+\nMelB- / F' Mel1-\n- melibiose\n+ melibiose\n-\n+\n-\n-\n-\n-\n-\n+\n-\n+\n-\n+\n\nDescribe the basic genetic properties of the MelB- mutation, explaining the rationale for\nyour conclusions, and make a proposal for the type of regulatory functions affected by the\nMelB- mutation.\n(c) Diagram two possible models for regulatory pathways for Mel1 that can explain the\nbehavior of the MelA- and MelB- mutations. For each model include a role for the inducer\nmelibiose.\n(d) You next construct a MelA- MelB- double mutant, which gives the following behavior:\nmelibiase activity\n- melibiose\n+ melibiose\nMelA- MelB-\n-\n-\nWhich of your two models is consistent with this new data?\n(e) Next, you isolate a third mutant, MelC-, which gives constitutive melibiase expression.\nThe MelC- mutation is closely linked to Mel1 and MelB-. Genetic tests of the MelC-\nmutation yield the following:\nmelibiase activity\nMelC-\nMelC- / F' Mel+\nMelC- Mel1-/ F' Mel+\nMelC- / F' Mel1-\n- melibiose\n+ melibiose\n+\n+\n+\n+\n+\n+\n+\n+\nAs above, classify the MelC- mutation in terms of its basic genetic properties and explain\nhow you arrived at your conclusions.\n(f) A MelB- MelC- double mutant shows uninducible melibiase activity. Assuming that\nMelC- mutations affect the same gene as MelB- mutations, propose two different\npossible mechanisms to explain the behavior of MelC-. Your answer should include a\ndiagram showing the entire pathway for Mel1 regulation indicating the function of each of the\nelements affected by the MelA-, MelB-, and MelC- mutations and the inducer melibiose.\nFinally, propose some type of experiment(s) that would allow you to distinguish the two\npossible mechanisms."
    },
    {
      "category": "Assignment",
      "title": "pset5_ans.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/eadc26b07aa7d8989ca4a40b679d0bcd_pset5_ans.pdf",
      "content": "7.03 Fall 2003\n1 of 6\nAnswer Key Problem Set 5\n1. a) Genetic properties of gln2- and gln 3-:\nBoth are uninducible, as they give decreased glutamine synthetase (GS) activity.\nBoth are recessive, as mating them with wildtype produces normal GS activity.\nBoth are trans-acting, as when either mutation is crossed to gln1-, complementation takes place;\nif either gln2- or gln3- were a cis-acting element regulator of gln1, we would not see\ncomplementation, as the two mutations would be in the same gene. (i.e. the promoter is\nconsidered to be part of the gene it acts on.) Since we see complementation in both cases, we\nknow that both mutations must be trans-acting.\nTherefore both gln2- and gln3- are mutations in genes for positive regulators.\nb) Linear models:\ngln2++gln3++gln1\ngln3++gln2++gln1\nParallel model:\ngln2\ngln1\ngln3\nc) The parallel model from part b) best fits the experimental results, as we are told that the\naddition of glutamate (glu) and glutamine (gln) independently regulate the GS activity (i.e. the\nresults of the addition of each is different from the addition of both).\nglu---| gln2\ngln1\ngln---| gln3\nd)We would expect the gln2-gln3- double mutant to be uninducible.\ne) The cis-acting elements in the promoter are:\n- Deletion1 (-300 to -250): GLN2 function (activity pattern looks like gln2- when\ndeleted), UAS (Upstream Activation Sequence -involved in activation)\n- Deletions 3, 4 (-200 to -100) GLN3 function (activity pattern looks like gln3- when\ndeleted), UAS (Upstream Activation Sequence -involved in activation)\n- Deletion 6 (-50 to 0) TATA sequence\n\n7.03 Fall 2003\n2 of 6\nf)We would expect to see no change in beta-galactosidase expression in Deletion 1 in a gln2\nmutant, as, in e), we determined that the region deleted in 1 is necessary for GLN2 function.\n(i.e. deleting both the cis-acting element and gln2will look the same as deleting either one.)\nWe would expect 0 units of betagalactose from Deletion 4 (or low baseline level), as deletion 4\nis necessary for GLN3 function, and we know that when both the gln2 and gln3 pathways for\nactivating GLN1 are mutated neither pathway can activate GLN1.\n2.\na) We can use the information from the order of the BACs to figure out where each STS is.\nFor instance, BAC A is positive for STS 3, which is not present in any other BAC;\ntherefore it must be in the region of A that does not overlap with B or C. There are three\nambiguities in the data, resulting in three possible maps. Most of the ambiguity lies in\nwhether BAC D contains both STS 51 and STS 52, as PCR only provides the qualitative\nanswer that STS 5 is present; we don't get quantitative data as to how many versions of\nSTS5 are present on the BAC. Case1 displays the possibility that BAC D contains both\nSTS5s. Given this case, we cannot determine the order of STS51 and STS 2 (thus the\nparenthesis). Case 2 displays the possibility that STS51 is not on BAC D. If this\nassumption is true, then we can determine the order of STS51 and STS2. Case 3\ndisplays the possibility that BAC D contains only STS51. If this is the case, we cannot\ndetermine the relative order of STS52 and the second STS1.\nCASE1\nA\nD\nB\nE\n( 51 2)\n(5 2)\n(5 2)\nF\nC\nCASE 2\nA\nD\nB\nE\n5 2\n5 2\n5 2\nF\nC\n\n7.03 Fall 2003\n3 of 6\nCase Three:\nA\nD\nB\nE\n( 51 2)\n(5 2)\n2 1)\n(5 2)\nF\n(5\n(5 1)\nTherefore there are quite a few ambiguities in our map. The first is that we do not know the\norder of STS 51 relative to STS2. It is possible that STS 2 comes before STS 51 or STS 51\ncomes before STS 2. Also, we do not know if D is carrying STS 51 and 52 or if it is carrying\njust 52. Consider the possibility that D contains only STS 52; we would have to assume that\nSTS 2 came after STS51, and the STS 5 we are detecting cames from STS 52. In addition, there\nis a third possibility, which is that the STS 5 contained on BACD is only STS51. If that is the\ncase, then we don't know the order of STS5 with respect to the later STS1. We need an assay to\ndistinguish between the possibilities.\nb) . PCR just amplifies DNA to which primers bind. One could imagine that the PCR primers\ncould anneal to both sites and amplify both sites. This would result in a heterogeneous mixture\nof STS51 and STS52.\nD\nHowever, PCR alone does not help us distinguish between the three possibilities. This\nsequencing assay is our assay to distinguish between the three cases. Sequencing can tell us\nwhether BACD contains both STS 51 and STS52, just STS51 or just STS52. Given these data, it\nlooks as if BAC D is carrying both STS5s, which allows us to throw out cases two and three.\nThere is a remaining ambiguity--we still do not know the order of STS51 relative to STS2.\nc) depending on your answer it could confirm/refute. Most answers should be refined, as we can\nnow distinguish between the three cases. There are some remaining ambiguities, but the map is\nsignificantly more refined after the sequencing assay of STS5.\nd) You would expect both sequences to be present in the genome. BACs are derived from the\nmouse genome and are therefore a reflection of what is present in the genome. If we find to\nSTS 5 in twice our BACS, there are probably at least two STS 5 on the mouse chromosome.\nOnly BAC D contains both STS5s.\ne) STS1 is present more than once; BACs A, B, C would have the same sequence E, F would\nhave the same sequence. It is possible that the STS1 from BACs A, B,C have a different\n\n7.03 Fall 2003\n4 of 6\nsequence than those from STS1 from BACs E, F. Primers that distinguish between these two\nSTS1 would be convenient as we would not have to be concerned about an ambiguity in our\ndata in the future like there was with STS5 and BAC D.\nf) Design primers that include the non-homologous sequence in STS51 and STS52. These\nprimers should specifically amplify either STS51 or STS52.\ng) Yes STS51 and STS52 should both be present in BAC D and the mouse genome{refer to\n(d)}\n3. a. The integration of Pamylase-LacZ into the amylase gene is unlikely to occur when the\nconstruct is microinjected into the male pronucleus of a fertilized egg.\nIntegration of the construct into the endogenous amylase gene locus could occur via\nhomologous recombination or by chance non-homologous insertion into the endogenous\namylase gene. Homologous recombination requires homologous sequences to the\ntargeted locus on both sides of the LacZ gene. The microinjected construct has\nhomology on only one side of the LacZ transgene, thus, making homologous\nrecombination an unlikely event in this case.\nAlthough random insertion of a construct occurs with greater frequency than homologous\nrecombination, the chance of a transgene inserting into a particular locus is exceedingly\nrare. The amylase gene is on the order of a couple of kilobases (kb), while the mouse\ngenome roughly 3000 megabases (Mb). This makes the likelihood of randomly inserting\ninto the amylase locus approximately 1 in 106.\nb. We would expect mice homozygous for the transgene to display LacZ expression in\nthe pancreas as the heterozygous mouse does, assuming that the homozygote is a result of\na cross between two heterozygous mice of the same transgenic line. In the homozygote\nthe regulation of both copies of the transgene would most likely be equivalent to the\nregulation of the transgene in the heterozygote.\nExpression of the LacZ transgene in the homozygote may also be observed in other\norgans. This can occur if expression from one copy of the transgene (as in the\nheterozygote) is just below the level of detection. Two transgenes in a single cell (as in\nthe homozygote) could produce just enough LacZ to be detectable.\nc. A possible explanation for the heart defect in mice homozygous for the transgene\ninsertion is that the insertion disrupted a gene (let's call it gene D) that is haplosufficient.\nA single undisrupted copy of gene D could be sufficient to allow development of a\nnormal heart, but when both copies are disrupted the mouse develops the heart defect.\nAnother possibility is the LacZ overexpression (with two copies of the transgene) causes\nthe defect. When only a single LacZ transgene is present there is not enough expression\nto disrupt the normal development or the functioning of the heart.\n\n7.03 Fall 2003\n5 of 6\nd. We can test the possibility that disruption of both copies of a gene D causes the heart\ndefect. First, we would want to clone the locus (gene D) into which the transgene\nintegrated. This can be done by anchored PCR and sequencing using the sequence of the\nintegrated transgene to design primers. Next, we can construct a targeting construct to\nknock-out gene D, in which we basically swap the coding region of gene D for a drug\nresistance gene (e.g. neomycin). This targeted deletion of gene D can selected for by the\npresence of the drug resistance gene after ES cells in culture are transfected with the\ntargeting construct. The ES cells containing the correctly targeted locus can then be\ninjected into blastocysts to generate chimeric mice. The chimeras can than be mated to\nwild-type mice to produce progeny that are heterozygous for the targeted deletion of gene\nD. (We can use a combination of coat color determination and PCR analysis to figure out\nthe genotype of the mice.) We can generate mice homozygous for the deletion of gene D\nby breeding heterozygous mice. If our hypothesis is correct, then we would expect to see\na heart defect in the homozygous knock-out mice and normal hearts in the heterozygous\nmice.\ne. To use LacZ as a reporter for the expression of the endogenous amylase gene, we\nwould want to put LacZ under the control of the same regulatory elements. Because it is\ndifficult to determine the boundaries of promoter regions, we would want to insert LacZ\nin place of the amylase gene in the endogenous locus. To accomplish this, we would\nneed a targeting construct that contains the LacZ gene flanked by sequences homologous\n\n7.03 Fall 2003\n6 of 6\nto amylase upstream and downstream sequences. The resulting heterozygous knock-out\n(knock-in) mice (after ES cells targeting, blastocyst injection to generate chimera, and\nmating of chimeras to wild-type mice) can be assayed to determine if LacZ is expressed\nin the pancreas. The expression of LacZ is likely to reflect amylase expression, but will\nnot certainly do so."
    },
    {
      "category": "Assignment",
      "title": "pset5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/2926327e62374bf0fb19bf5f5a841507_pset5.pdf",
      "content": "7.03 Problem Set 5\nDue before 5 PM on Thursday, November 13\nHand in answers in recitation section or in the box outside the class\n1. You are studying regulation of the yeast enzyme glutamine synthetase (GS), which is\nencoded by the GLN1 gene. You have isolated two mutants, designated gln2- and\ngln3-, that give decreased GS activity. Mating of either gln2- or gln3- haploids to wild\ntype produces heterozygous diploids that show normal amounts of GS expression.\nWhen you cross either a gln2- or gln3- haploid to a gln1- strain the resulting diploids show\nnormal expression of GS.\n(a) From these experiments classify the gln2- and gln3- mutations in terms of their basic\ngenetic properties explaining the rationale behind your conclusions. Based on these\nproperties make a proposal for the types of regulatory functions affected by the gln2- and\ngln3- mutations.\n(b) Diagram two different linear models and one parallel model that could explain the effect\nof the gln2- and gln3- mutations on the regulation of GLN1.\nThe GLN1 gene shows a rather complex regulation in response to different amino acids.\nWhen either glutamate (glu) or glutamine (gln) is added to the medium, the amount of GS\nexpression diminished and when both glutamate and glutamine are added to the medium\nGS expression is shut off completely. The effects of different mutants on the response to\nglu and gln are shown below.\n-\nwild type\ngln1-\ngln2-\ngln3-\nUnits of GS activity\n+ glu\n+ gln\n+glu& gln\n(c) Which of the models from part (b) best fits these experimental results? Diagram a\ncomplete model for the regulation of GLN1 that includes the effects of glu and gln.\n(d) Based on your model for part (c) how would you expect a gln2- gln3- double mutant\nto behave?\n1 of 4\n\n___\n________\n_____________\n__________________\n_______________________\n____________________________\nNext, you decide to evaluate the promoter for the GLN1 gene. To do this you first fuse the\npromoter region to the LacZ coding sequence and then place this hybrid gene on an\nappropriate yeast plasmid. You find that cells carrying the hybrid gene express activity\nunder the same conditions that GS is expressed in wild type cells, meaning that the\npromoter region you have selected contains all of the necessary cis-acting sequences for\nnormal regulation. The figure below shows the effect of different 50 bp deletions in the\npromoter region on the amount of ß-galactosidase activity expressed by the reporter\ngene.\n-300\n|\n-250\n|\n-200\n|\n-150\n|\n-100\n|\n-50\n|\n+1\n|\nUnits of ß-galactosidase\n-\n+ glu\n+ gln\nwt _________________________________ LacZ\n_________________________ LacZ\n____________________ LacZ\n_______________ LacZ\n__________ LacZ\n____ LacZ\n_ LacZ\n(e) Describe the cis-acting elements in the GLN1 promoter that are evident from these\nexperiments, giving both their position and as much of their function as you can deduce.\n(f) How many units of ß-galactiosidase would you expect to be expressed from deletion 1\nin a gln2- mutant? How many units of ß-galactiosidase would you expect to be expressed\nfrom deletion 4 in a gln2- mutant?\n2 of 4\n\n2. You obtain 6 BACs (of known order, as shown below) and 7 STSs (of unknown order) that\nderive from a region of mouse chromosome 16 whose genomic sequence has not yet been\nfinished.\nA\nD\nB\nE\nC\nF\nBy PCR (using 20-bp primers at either end of each STS), you test each of the 6 BACs for the\npresence (+) or absence (-) of each of the 7 STSs. You obtain the following results:\nBACs\nSTSs\nA\n+\n-\n+\n-\n-\n-\n+\nB\n+\n+\n-\n-\n+\n-\n+\nC\n+\n+\n-\n+\n+\n-\n-\nD\n-\n+\n-\n+\n+\n-\n-\nE\n+\n-\n-\n+\n+\n-\n-\nF\n+\n-\n-\n-\n+\n+\n-\n(a) Construct a physical map of this region that shows the order of the STSs, and the placement\nof the STSs within the BACs. (Hint: Consider the possibility that one or two of the STSs are\npresent twice in the region spanned by the 6 BACs.) Are there any ambiguities within your map?\nIf so, describe them.\n(b) You determine the DNA sequences of PCR products obtained at STS5 using BACs B, C,\nD, E, and F as PCR templates. The DNA sequences of PCR products obtained using BACs B\nand C are identical, but they differ by several nucleotide substitutions from the DNA sequences of\nPCR products obtained using BACs E and F. Oddly, PCR product obtained using BAC D\nappears to be a mixture of two sequences - one corresponding to the BAC B/ BAC C\nsequence and the other corresponding to the BAC E/ BAC F sequence. Briefly account for these\nfindings, and explain how a single PCR assay could amplify two different sequences.\n(c) Do the findings presented in part (b) confirm, refine, or refute your answers to part (a)? Briefly\nexplain your answer.\n(d) Would you expect the DNA sequence of PCR product obtained at STS5 using mouse\ngenomic DNA as template to more closely resemble that obtained using BAC B, BAC D, or\nBAC F? Briefly explain your answer.\n3 of 4\n\n(e) Is there a second STS at which you would like to sequence PCR products obtained using\nBACs as templates? If so, which BACs would you test in this way, and what sequencing results\nmight you predict for each of the BACs tested?\n(f) How would you use the sequence information presented in part (b) to design two new STSs\n(with new PCR primer pairs) to replace STS5? (Call the new ones STS51 and STS52. STS51\nshould be present (+) in BAC B, and STS52 should be present (+) in BAC F.)\n(g) Would you expect STS51 and STS52 to be present in BAC D? In mouse genomic DNA?\n3. Many mouse genes are \"tissue-specific,\" that is, they are present throughout the body\nbut are expressed in only one of the animal's many tissue types. (Other mouse genes are\nexpressed throughout the body, or in multiple tissues.) Geneticists can study the regulation\nof a mouse gene by fusing the gene's promoter region to the LacZ coding sequence and\ninjecting the construct to create a transgenic mouse. Fusion of the mouse amylase promoter\nto LacZ yielded a Pamylase-LacZ construct.\n(a) Would microinjection of the Pamylase-LacZ construct into the male pronucleus of a fertilized egg\nlikely result in integration of the construct into the amylase gene? Briefly explain your answer.\n(b) Mice heterozygous for the resulting Pamylase-LacZ transgene displayed LacZ expression\nexclusively in the pancreas. Would you expect homozygotes for the transgene to also display\nLacZ expression in the pancreas? Elsewhere? Briefly explain your answer.\n(c) You are surprised to observe that mice homozygous for the transgene insertion display a\nserious heart defect. (Heterozygotes have normal hearts.) Suggest a possible explanation.\n(d) Propose an experimental test of your hypothesis from part (c) using gene targeting in mice.\nDraw a labeled diagram of the targeting construct that you would use, and outline any breeding\nexperiments required to test your hypothesis.\n(e) Propose how you might use LacZ in a gene targeting experiment in mice to test whether the\namylase gene is expressed exclusively in the pancreas. Draw a labeled diagram of the targeting\nconstruct that you would use, and outline any breeding experiments required to test your\nhypothesis.\n4 of 4"
    },
    {
      "category": "Exam",
      "title": "exam1_2004.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/261010b930ef036b904455a551be7515_exam1_2004.pdf",
      "content": "Name: ____________________________________\n\n7.03 - Genetics - Fall 2004\nMassachusetts Institute of Technology\nProfessor Chris Kaiser\nProfessor Gerry Fink\nProfessor Leona Samson\n\nName: ____________________________________\n\n1. You are studying three autosomal recessive mutations in the fruit fly Drosophila\nmelanogaster. Flies that are homozygous for the hb- mutation are \"humpbacked\" (wild-\ntype flies are straight-backed). Flies that are homozygous for the bl- mutation are\n\"blistery-winged\" (wild-type flies are smooth-winged). Flies that are homozygous for the\nst- mutation are \"stubby-legged\" (wild-type flies are long-legged).\n\nYou mate flies from two true-breeding strains, and the resulting F1 flies are all are\nstraight-backed, smooth-winged, and long-legged. F1 females are then mated to males\nthat are humpbacked, blistery-winged, and stubby-legged. In the F2 generation, among\n1000 progeny resulting from this cross, you observe the following phenotypes:\n\nPhenotype\n\nNumber\n\nhumpbacked, blistery-winged, and stubby-legged\n(26 flies)\n\nhumpbacked, blistery-winged, and long-legged\n(455 flies)\n\nhumpbacked, smooth-winged, and long-legged\n(24 flies)\nstraight-backed, blistery-winged, and stubby-legged\n(27 flies)\n\nstraight-backed, blistery-winged, and long-legged\n(4 flies)\n\nstraight-backed, smooth-winged, and stubby-legged (442 flies)\n\nstraight-backed, smooth-winged, and long-legged\n(22 flies)\n\n(a, 6 pts.) The male flies that were bred to the F1 generation in order to produce the F2\ngeneration were humpbacked, blistery-winged, and stubby-legged. On each of their\nchromosomes, they have the alleles hb- bl- st-. Using this notation, state the\ngenotype of each of the two true-breeding parental strains (i.e. the two strains in the P\ngeneration).\n\nGenotype of one parental strain:\n\nGenotype of the other parental strain:\n\nName: ____________________________________\n\n(b, 6 pts.) How many flies are found in the class that is the reciprocal class of the\nhumpbacked, blistery-winged, and stubby-legged flies?\n\n(c, 7 pts.) What is the genetic distance between the hb and bl loci? (Label your answer\nwith the proper units.)\n\n(d, 7 pts.) What is the genetic distance between the bl and st loci? (Label your answer\nwith the proper units.)\n\n(e, 6 pts.) Draw a genetic map showing the correct order of the hb, bl, and st loci.\n\nName: ____________________________________\n2. The following mouse pedigree shows the segregation of two different mutant traits.\nThe mutant trait indicated by the dots is dominant, whereas the mutant trait indicated by\nthe stripes is recessive. Assume 100% penetrance and no new mutations.\n(Squares = males, circles = females.)\n\n= expressing dominant mutant trait,\ncaused by the \"A*\" allele\n\nMouse\n#1\nMouse\n#2\n?\nMouse\n#4\nMouse\n#3\n\n= expressing recessive mutant trait,\ncaused by the \"b\" allele\n\n= expressing both mutant traits\n\n(a, 6 pts.) Assuming that both mutant traits are due to linked autosomal genes that are\n6 cM apart, fill in the following chart using the allele notation indicated by the key\nabove. Blocks in the chart that cannot be filled in conclusively should be indicated as\n\"inconclusive.\"\nNOTE: One line of the chart is already filled in correctly for you.\n\nNumber of\n\"A*\" alleles\nNumber of\n\"a\" alleles\nNumber of\n\"B\" alleles\nNumber of\n\"b\" alleles\nMouse #1\n\nMouse #2\n\nMouse #3\n\nMouse #4\n\nName: ____________________________________\n(b, 6 pts.) Assuming that both mutant traits are due to linked autosomal genes that are\n6 cM apart, fill in the boxes with the alleles possessed by mouse #4 on each of the two\nhomologs of this autosome that are depicted in the diagram below.\n\nHomolog inherited\nfrom mouse #1\n\n\"A*\" or \"a\" locus\n\"B\" or \"b\" locus\n\nHomolog inherited\nfrom mouse #2\n\n(c, 7 pts.) Assuming that both mutant traits are due to linked autosomal genes that are\n6 cM apart, what is the probability that the mouse indicated by a question mark will\nshow both mutant traits (the trait encoded by \"A*\" and the trait encoded by \"b\")?\n\nName: ____________________________________\n(d, 8 pts.) Assuming that the recessive mutant trait is caused by a gene on an\nautosome and the dominant mutant trait is caused by a gene on the X chromosome,\nfill in the following chart using the allele notation indicated by the key above. Blocks in\nthe chart that cannot be filled in conclusively should be indicated as \"inconclusive.\"\n\nNumber of\n\"A*\" alleles\nNumber of\n\"a\" alleles\nNumber of\n\"B\" alleles\nNumber of\n\"b\" alleles\nX-linked\nautosomal\nMouse #1\n\nMouse #2\n\nMouse #3\n\nMouse #4\n\n(e, 6 pts.) Assuming that the recessive mutant trait is caused by a gene on an\nautosome and the dominant mutant trait is caused by a gene on the X chromosome,\nwhat is the probability that the mouse indicated by a question mark will show only the\nrecessive mutant trait assuming that the mouse is born female?\n\nName: ____________________________________\n\n3. You are working with a mutant strain of yeast that is dark tan (wild-type yeast are\nwhite). The \"dark tan\" phenotype of the haploid cells you are working with is caused by\ntwo different mutations in the same strain. The two mutations are designated drk1- and\ndrk2-.\n\n(a, 6 pts.) Mating of the drk1- drk2- double mutant to wild-type yeast produces\ndiploids that are white. Sporulation of these diploids yields 50 tetrads. 4 of these\ntetrads (called \"Type One\") contain four light tan spores. 37 of these tetrads (called\n\"Type Two\") contain two dark tan spores and two white spores. 9 of these tetrads\n(called \"Type Three\") contain one dark tan spore, two light tan spores, and one white\nspore.\nCategorize each of the tetrad types as parental ditype (PD), tetratype (TT), or\nnonparental ditype (NPD).\n\n(b, 6 pts.) Are the drk1- and drk2- mutations linked? If so, give the distance between\nthem. (Label your answer with the proper units.)\n\n(c, 6 pts.) In yeast, 1 cM of genetic distance corresponds to 3,500 base pairs of\nphysical distance. An average yeast gene is about 1,400 base pairs long, and the\nlongest yeast gene is 14,700 base pairs. Keeping this information in mind, you select a\n\"Type Three\" tetrad from part (a) and mate the two light tan spores from that tetrad to\neach other. Can you deduce the color of the resulting diploids? If so, what color would\nthe diploids be?\n\nName: ____________________________________\n\nNext you isolate a mutant strain of yeast that cannot grow on medium lacking leucine.\nThis strain contains a single mutation you call leu1-. The leu1- mutation is near to\ndrk1- on the same chromosome. When the leu1- mutant is mated to wild-type yeast,\nthe resulting diploids cannot grow on medium lacking leucine.\n\n(d, 9 pts.) You mate leu1- yeast to drk1- yeast and sporulate the resulting diploid.\nYou grow the resulting spores on medium containing leucine. You then test for growth\non medium lacking leucine. It is apparent that you have isolated only two types of\ntetrads, 10 tetrads of Type A and 10 tetrads of Type B. On medium lacking leucine,\nonly two spores from each Type A tetrad can grow; both are light tan in color. Complete\nthe chart below so as to indicate: How many spores from each Type B tetrad can grow\non medium lacking leucine, and what color is each spore that can grow?\n\n# of spores that can\ngrow\non medium lacking\nleucine\ncolor of each spore that can\ngrow on medium lacking\nleucine\n\nType A tetrad\n\nboth are light tan\n\nType B tetrad\n\n(e, 8 pts.) What are the genotypes at the leu1 and drk1 loci of each of the two light tan\nspores from the Type A tetrads that grew on medium lacking leucine?\n\nName: ____________________________________\n\nGenotype of one light tan spore:\n\nGenotype of the other light tan spore:"
    },
    {
      "category": "Exam",
      "title": "exam2_2004.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/ea40ecd31386a01bf13c739b8d620689_exam2_2004.pdf",
      "content": "Name: ___________________________\n\n7.03 - Genetics - Fall 2004\nMassachusetts Institute of Technology\nProfessor Chris Kaiser\nProfessor Gerry Fink\nProfessor Leona Samson\n\nName: ___________________________\n\nName: ___________________________\n1. Drawn below is part of a wild-type gene. The DNA sequence shown encodes the\nlast amino acids of a protein that is normally 380 amino acids long. The bracketed\ncodon indicates the correct reading frame of this gene. The lower strand of the gene is\nused as the template during the transcription of mRNA from this gene.\n\n...GCTAAGTATTGCTCAAGATTAGGATGATAAATAACTGG-3'\n...CGATTCATAACGAGTTCTAATCCTACTATTTATTGACC-5'\n\n(a, 6 pts) In the copy of the sequence drawn below, circle one base pair that you could\nchange to make a mutant form of the gene that produces a protein that is now 381\namino acids long. Indicate the identity of one new base pair that could take its place.\n\n...GCTAAGTATTGCTCAAGATTAGGATGATAAATAACTGG-3'\n...CGATTCATAACGAGTTCTAATCCTACTATTTATTGACC-5'\n\n(b, 6 pts) In the copy of the sequence drawn below, draw a slash between two base\npairs where you could add one extra base pair in order to make a single mutant form of\nthe gene that produces a protein that is 373 amino acids long.\n\n...GCTAAGTATTGCTCAAGATTAGGATGATAAATAACTGG-3'\n...CGATTCATAACGAGTTCTAATCCTACTATTTATTGACC-5'\n\n(c, 9 pts) Multiple mutant suppressor tRNAs could suppress the early termination defect\nin part (b) by allowing a longer protein to be produced from that mutant form of the\ngene. Make a list of all of the tRNA genes that could produce such mutant suppressor\ntRNAs if each tRNA gene contained a single base substitution. (Use the notation: \"ala-\ntRNA.\")\n\nName: ___________________________\n2. You are studying the regulation of a bacterial gene called nytT, which is expressed\nonly when the bacterial strain is grown in the dark. You isolate two mutations, nytA1-\nand nytB1-, which affect the regulation of nytT.\n\nGenotype\nIs nytT expressed\nin the dark?\nIs nytT expressed\nin the light?\nStrain 1\nnytA+ nytB+ nytT+ (wild type)\nyes\nno\nStrain 2\nnytA1- nytB+ nytT+\nno\nno\nStrain 3\nnytA+ nytB1- nytT+\nno\nno\nStrain 4\nnytA+ nytB+ nytT+ / F' nytA1-\nyes\nno\nStrain 5\nnytA+ nytB+ nytT+/ F' nytB1-\nyes\nno\n\nYou grow P1 phage on an otherwise wild-type strain that contains a transposon\ninsertion carrying a gene that confers tetracycline resistance. The transposon insertion\nin this strain is linked to the nytT locus with a cotransduction frequency of 85%, and this\ninsertion does not alter normal nytT regulation. You use the resulting lysate to infect a\nnytA1- strain, and select for tetracycline resistance. None of the 30 Tetr\ncotransductants you examine express the nytT gene under any conditions. You obtain\nthe same results when you use the same P1 lysate to infect a nytB1- recipient strain.\n\n(a, 5 pts) Can you conclude if nytA1- is constitutive or uninducible? If so, state\nwhether nytA1- is constitutive or uninducible, and state what was the most important\npiece of information (for example, which strain in the table) you used to reach your\nconclusion.\n\n(b, 5 pts) Can you conclude if nytA1- is dominant or recessive? If so, state whether\nnytA1- is dominant or recessive, and state what was the most important piece of\ninformation (for example, which strain in the table) you used to reach your conclusion.\n\nName: ___________________________\n(c, 8 pts) Can you conclude if nytA1- acts in cis or in trans with respect to nytT? If so,\nstate whether nytA1- acts in cis or in trans, and state what was the most important\npiece of information (for example, which strain in the table) you used to reach your\nconclusion.\n\n(d, 10 pts) Diagram all possible models for regulatory pathways for nytT that can\nexplain the behavior of the nytA1- and nytB1- mutations. (Please diagram only linear\npathways in which each gene is controlled by no more than one regulator. Please do\nnot include any steps that invoke unknown players.) For each model, include only the\nfollowing: wild-type nytA, nytB, and nytT, and \"bright light.\"\n\nName: ___________________________\n3. After you perform the experiments from Question #2, you decide to continue\nstudying the regulation of the bacterial gene nytT, which is expressed only when the\nbacterial strain is grown in the dark. You decide to map the two mutations, nytA1- and\nnytB1-, which you isolated in Question #2. Please refer to the table in the introduction\nto Question #2 for information about how these mutations affect the regulation of nytT.\n\nYou find that the nytA and nytB loci are linked using P1 cotransduction experiments.\nYou isolate a transposon insertion that carries a gene encoding kanamycin resistance.\nThis transposon insertion is near to, but not between, the nytA and nytB loci.\n\n(a, 6 pts) You grow P1 phage on an otherwise wild-type strain that contains the\ntransposon insertion carrying kanamycin resistance. You use the resulting lysate to\ninfect a nytB1- strain, and select for kanamycin resistance. Drawn below are the E. coli\nchromosome and the DNA transduced by P1 during this cotransduction experiment.\n(Please note that these drawings are not to scale.) Redraw the DNA transduced by P1\nso that it lines up with the homologous region of the E. coli chromosome. Then draw in\nthe recombination events necessary to achieve the cotransduction of Tn-Kanr and the\nnytB locus.\n\nTn-Kanr\nalaA+\ntrpA+\n\nthrA+\nsucA+\naraA+\nmalA+\ngalA+\nalaA+\nileA+\nnytB1-\nleuA+\nvalA+\nlacA+\ntrpA+\n\nName: ___________________________\n(b, 5 pts) In the transduction experiment described in part (a), out of a total of 50 Kanr\ncotransductants, 15 can express the nytT gene in the dark and 35 cannot. Express the\ndistance between the transposon and the nytB locus as a cotransduction frequency.\n\nTo map the nytA and nytB loci, you set up two reciprocal crosses:\nIn the first cross, you grow P1 phage on a Kanr strain that contains the transposon\ninsertion and the nytA1- mutation, and use the resulting phage lysate to infect a\nnytB1- strain. You select for kanamycin resistance (Kanr), and among 100 Kanr\ntransductants, you find that only 13 are able to express nytT. (All 13 show normal nytT\nregulation.)\n\nIn the second cross, you grow P1 phage on a Kanr strain that contains the transposon\ninsertion and the nytB1- mutation, and use the resulting phage lysate to infect a\nnytA1- strain. You select for kanamycin resistance (Kanr), and among 100 Kanr\ntransductants, you find that only 3 are able to express nytT. (All 3 show normal nytT\nregulation.)\n\n(c, 6 pts) Draw a genetic map showing the correct relative positions of the transposon\ninsertion (Tn-Kanr) and the nytA and nytB loci in this box:\n\n(d, 6 pts) Based on the gene order that you drew in part (c), state the chromosomal\ngenotype of a transductant that must have resulted from a quadruple crossover event\nbetween the transduced DNA and the bacterial chromosome of the recipient in the first\ncross. (Be sure to indicate the chromosomal genotype at both the nytA and nytB loci.)\n\nName: ___________________________\n(e, 6 pts) Based on the gene order that you drew in part (c), which of the following is\nthe most reasonable distance between Tn-Kanr and the nytA locus, as expressed as a\ncotransduction frequency? (Your choices are: 20%, 30%, OR 40%.)\n\n4. You are studying a strain of E. coli whose total genome size is 4,639 kilobase pairs\n(kbp). The chromosome of this E. coli strain is diagrammed below, and its three\ninsertion sequences are indicated. Note that this drawing is not to scale.\nOrigin of transfer\nIS#4\ntrpD\nNOTE: Assume that the size of each insertion sequence is 1 kbp.\n\nIS#3\nhisF\nIS#2\nIS#1\n5 kbp\n12 kbp\n\nYou are utilizing a form of the F factor that is 95 kbp in length. This F factor has a\nsingle IS sequence and a single origin of transfer, as indicated:\n\nFill in the chart on the next page, which considers cells containing the above\nchromosome and F factor.\n\nName: ___________________________\n(22 pts) Fill in the chart below. Two boxes have been done for you.\nNOTE: Assume each cell described in Column 1 contains only what is listed -- NO\nOTHER recombination events have occurred in each cell besides those listed.\n\nType of cell\nWhat is the\nsize of the\ncircular E. coli\nchromosome\nin the cell?\nWhat is the size of\nthe\nextrachromosomal\ncircle of DNA\nin the cell?\nCan hisF\nbe transferred\nefficiently,\ninefficiently,\nOR never?\nCan trpD\nbe transferred\nefficiently,\ninefficiently,\nOR never?\n\nAn F- bacterial\ncell\n\n4,639 kbp\n\n0 kbp\n(there isn't\none)\n\nAn F+ bacterial\ncell\n\nAn Hfr cell\n(named \"Hfr A\")\nresulting from\nrecombination\nbetween\nIS#4 and IS#3\n\nA cell resulting\nfrom\nrecombination\nbetween\nIS#2 and IS#1\nin \"Hfr A\""
    },
    {
      "category": "Exam",
      "title": "exam3_2004.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/ac5400c30344d96ce7415590722c087e_exam3_2004.pdf",
      "content": "7.03 - Genetics - Fall 2004\nMassachusetts Institute of Technology\nProfessor Chris Kaiser\nProfessor Gerry Fink\nProfessor Leona Samson\n\n1. Consider an autosomal recessive trait that occurs at a frequency of 10-6 in a specific\npopulation that is at Hardy-Weinberg equilibrium (ie. random mating is occurring). When\nanswering the following parts, show all of your calculations.\n\n(a, 7 pts) Draw a pedigree below that shows a mating between two relatives that would\ncorrespond to an inbreeding coefficient that equals 0.007813. Denote the mating\nbetween relatives with a double-bar connecting the two related parents. Start your\npedigree with the common pair of ancestors and end your pedigree with the two related\nparents who are mating.\n\n(b, 8 pts) Now say that all matings in Generation X of the given population are either\nbetween unrelated individuals, or have the same inbreeding coefficient as the mating\ndescribed in part (a). If the incidence of the trait in Generation \"X+1\" increases to a\nfrequency of 2 X10-6, what percentage of matings in Generation X must have been\nbetween unrelated individuals?\n\n(c, 4 pts) Now assume that this autosomal recessive trait causes lethality in childhood.\nIf a constant percentage of matings are between related parents for many generations,\nwould you predict that q would increase OR decrease?\n\n(d, 9 pts) A constant percentage of matings has occurred between related parents for\nmany generations, and yet you find experimentally that q has not changed. Of the three\nchoices below, circle ALL that could potentially act against the effect you chose in\npart (c) in order to keep q constant. Explain in one sentence why you chose or did not\nchoose each option.\n\nChoice A: migration\n\nChoice B: heterozygote advantage (Aa over AA)\n\nChoice C: mutation\n\n2. You are studying regulation of the Wrm1 gene, a yeast gene that is expressed in\nresponse to heat. You isolate a wrm1::lacZ strain that expresses β-galactosidase when\nWrm1 is normally expressed (which is at 36°C but not at 24°C). You use this\nwrm1::lacZ strain to perform a genetic screen looking for mutants that do not properly\nregulate expression of Wrm1. In your screen, you isolate a series of mutant strains that\neither show constitutive or uninducible expression of wrm1::lacZ.\nYour results indicate that the following is the correct pathway for regulation of Wrm1\nexpression. Note that WrmY and WrmX are on the same chromosome, and that WrmX,\nWrmZ, and Wrm1 are all on different chromosomes.\n\nheat\nWrmY\nWrmX\nWrmZ\n\nWrm1\n\nOne of the mutant strains you isolate contains a mutation called WrmX-, which is in the\ncoding region of WrmX. You mate a WrmX- wrm1::lacZ haploid strain to a wrm1::lacZ\nhaploid strain. The resulting diploids are white on X-gal plates that are incubated at\n24°C, and are blue on X-gal plates that are incubated at 36°C.\n\n(a, 3 pts) Classify the WrmX- mutation as constitutive OR uninducible.\n\n(b, 3 pts) Classify the WrmX- mutation as dominant OR recessive.\n\n(c, 3 pts) Classify the WrmX locus as cis-acting OR trans-acting with respect to Wrm1.\n\nYou next isolate a mutant strain containing a mutation called WrmY-, which is in the\ncoding region of WrmY. You mate a WrmY- wrm1::lacZ haploid to a wrm1::lacZ\nhaploid. The resulting diploids are white on X-gal plates, regardless of the temperature\nat which the plates are incubated.\n\n(d, 6 pts) Classify WrmY- by the type(s) of mutation it could be with respect to Wrm1.\n(Your choices are: repressor -, activator -, UAS-, URS-, super activator, super\nrepressor, dominant negative repressor, dominant negative activator.)\n\nYou create diploid yeast by mating WrmX- WrmY- wrm1::lacZ haploid yeast to\nwrm1::lacZ haploid yeast. Sporulation of these diploids yields two types of tetrads, and\nyou correctly conclude (given the number of each type of tetrad) that the WrmX and\nWrmY loci are linked at a distance of 2.22 cM.\n\n(e, 14 pts) Depicted below are the two types of tetrads that resulted when you\nsporulated the above diploids. For each type of tetrad, state how many you found of\nthat tetrad (out of a total of 90 tetrads), classify the tetrad as PD, NPD, or TT, and\ncolor in all of the spores that would be blue on each of the following Petri plates.\n\nTetrad Type A\nNumber of these tetrads out of a total of 90: __________________\nClassification of these tetrads (PD, NPD, or TT): __________________\n\nColor in the spores that would be blue in color when growing on the following plates:\n\nX-gal, 24°C\nX-gal, 36°C\nNOTE that the two plates are\nreplicas, so the top spore on\nthe left plate has the same\ngenotype as the top spore on\nthe right plate.\n\nTetrad Type B\nNumber of these tetrads out of a total of 90: __________________\nClassification of these tetrads (PD, NPD, or TT): __________________\n\nColor in the spores that would be blue in color when growing on the following plates:\n\nX-gal, 24°C\nX-gal, 36°C\n\n3. You are mapping a certain disorder that is caused by an allele at the N locus. You\nsuspect that the N locus is linked to SSR112 on human chromosome #17. You analyze\nthe following family for these two loci. You will fill in the charts below in subsequent\nparts of the problem.\n\nIndividual 1\n\nIndividual 2\n\nA allele\nB allele\nC allele\nD allele\nSSR\nmaternally inherited\nallele at SSR112\n\npaternally inherited\nallele at SSR112\n\nIF the condition is\nautosomal\nrecessive\n[parts (a) and (b)]\n(Individual 2 is \"nn\")\n\nmaternally inherited\nallele at the N locus\n\npaternally inherited\nallele at the N locus\n\nIF the condition is\nautosomal\ndominant\n[parts (c) - (e)]\n(Individual 2 is \"Nn\")\n\nmaternally inherited\nallele at the N locus\n\npaternally inherited\nallele at the N locus\n\nAnswer parts (a) and (b) as if the disorder is autosomal recessive and caused by the \"n\"\nallele, so that Individual 2 is \"nn.\"\n\n(a, 9 pts) Fill in the upper four rows of the chart using autosomal recessive inheritance\nfor the disorder. Then answer below: which parent's alleles will you follow to correctly\ncalculate a LOD score between the N locus and SSR 112 -- Individual 1 or 2?\n\n(b, 3 pts) Draw all phases of the parent you chose in part (a) with respect to SSR 112\nand the N locus that are possible given everything you know about that parent. Make\nsure to draw the phases using the proper notation.\n\nAnswer parts (c) through (e) as if the disorder is autosomal dominant and caused by\nthe \"N\" allele, so that Individual 2 is \"Nn.\".\n\n(c, 6 pts) Fill in the lower two rows of the chart using autosomal dominant inhertance for\nthe disorder. Then answer below: which parent's alleles will you follow to correctly\ncalculate a LOD score between the N locus and SSR 112 -- Individual 1 or 2?\n\n(d, 3 pts) Draw all phases of the parent you chose in part (c) with respect to SSR 112\nand the N locus that are possible given everything you know about that parent. Make\nsure to draw the phases using the proper notation.\n\n(e, 7 pts) How many times more likely is it that the data from this family arose because\nof linkage between the SSR 112 and N loci at θ = 0.2 than because the two loci were\nunlinked? Show all calculations.\n\n4. The scenario on the next page asks a biological question that can be addressed by\ncreating genetically engineered mice. When creating engineered mice, the following 8\nsteps need to be considered. For each mouse you make in this problem, please state:\ni) whether you are using pronuclear injection or gene targeting techniques\nii) what DNA you would introduce into the mouse cells (also draw the DNA)\niii) whether you would put the DNA into a fertilized egg or ES cells\niv) from what genotype of mouse would you get the fertilized egg or ES cells\nv) where in the mouse genome the DNA you introduced would integrate\nvi) whether creating the mouse should involve the generation of a chimera or not\nvii) which additional breeding steps you would do to make the mouse you wanted\nviii) two possible phenotypic results you could get from the newly made mice, and\nthe corresponding conclusions you would make based on each result\n\n(15 pts) \"Non-homologous end joining\" is the process by which a DNA sequence gets\ninserted into a chromosomal region to which it is not homologous. Having a functional\ncopy of the gene \"NheJ\" is necessary for this process to occur in mice. A mouse with no\ncopies of the NheJ gene is sensitive to irradiation as an adult, but a heterozygote is not\nsensitive.\nYou decide to test whether one copy of the Drosophila \"d-Nhe\" gene could fully\ncompensate for the absence of the mouse NheJ gene. You have wild-type\nhomozygous mice (NheJ+/NheJ+), heterozygous mice (NheJ+/NheJ-), and\nhomozygous mutant mice (NheJ-/NheJ-) readily available to you."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/ed85e9623238e779d5b3826ea1a7cb90_lecture1.pdf",
      "content": "Genetics Lecture 1\n\nWe will begin this course with the question: What is a gene?\nThis question will take us four lectures to answer because there are actually several\ndifferent definitions that are appropriate in different contexts.\nWe will start with a physical definition of the gene. Conceptually this is the simplest and\nit will give me an excuse to briefly review some of the molecular biology that you probably\nalready know.\nGenes are made of DNA\nFor this course we will mostly think of DNA as an information molecule not as a chemical\nsubstance.\nIn 1953, Watson and Crick deduced that the structure of DNA was a double helix. It\nwas not the helical structure per se, but the discovery of complementary base pairing\nthat revealed how information could be encoded in a molecule and how this information\ncould be exactly duplicated each cell division. Replication.\n\nIn order to extract information from the DNA, the cell again uses the complementary\nbase-pairing to make a copy of the information copied onto an RNA molecule. This is\nknown as Transcription. RNA is chemically less stable than DNA and mRNA can be\nthought of as a temporary copy of DNA's information.\n\nTranscription\nTranslation\nFolded proteins:\nenzymes\nstructural proteins\nmembrane channels\nhormones\nGene: DNA segment needed to make a protein\nGenes are typically 103 - 104 base pairs in size although they can be much larger. For\nexample, the human dystrophin gene is 2 x 106 base pairs.\nE. coli has about 4,200 genes which isn't very many considering that at least 1,000\ndifferent enzymes are needed carry out just the basic biochemical reactions in a cell.\nThe smallest genome for a free-living organism (i.e. a cell, not a virus) is that of the\nbacterium Mycoplasma genetalium which encodes only 467 genes. Humans are at the\nother end of the spectrum of complexity and have about 35,000 genes.\n\nIn the demonstration in class you see how a mutation in the Shibire gene in the fly\nDrosophila gives a heat sensitive protein that is required for synaptic transmission.\nWhen the flies that carry this mutation are warmed by the projector lamp they become\nparalyzed.\nGene\n--\nProtein\n--\nCell Process\n--\nOrganism \"disease\"\n(Shibire)\n(Dynamin)\n(Synaptic Signaling)\n(Paralyzed Fly)\nThis example illustrates two powerful aspects of genetic analysis. First, we can follow\nmicroscopic changes in the DNA such as the Shibire mutation as they are revealed by the\nmacroscopic consequences of the mutation such as a paralyzed fly. Second, we have a\nvery precise way of studying the function of individual proteins by examining the\nconsequences of eliminating just that one protein function in an otherwise normal\norganism.\nAlleles: different versions of the same gene\nOften alleles are referred to as mutants but actually this usage is often incorrect\nparticularly when we discuss naturally occurring variants in a population.\nMutation: an altered version of a gene when we have \"witnessed\" the alteration but not\nwhen it is preexisting in the population.\nGenotype: all alleles of an individual\nWild type:\n\ndefined standard genotype\nThe concept of wild-type is used as a defined reference for organisms where we can do\nbreeding experiments. Of course there is no realistic way to define a standard genotype\nfor humans, therefore \"wild type\" has no meaning when we discuss human genetics.\nThe physical definition of the gene is a very good one but there are many instances where\nwe wish to study genes whose DNA sequences are not known. For example, say we have\nisolated a new mutant fly that is also paralyzed and we want to know whether this\nmutation is also in the Shibire gene. We will see in the next several lectures that we can\nanswer this question without knowledge of the DNA sequence either by a test for gene\nfunction known as a complementation test or by a test of the chromosomal position of the\nmutation by recombinational mapping. In practice, these other ways of defining genes by\nfunction or by position are often much more useful than a definition based on the DNA\nsequence."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/5c88f8d59e290130506a82ab5e03f008_lecture2.pdf",
      "content": "Lecture 2\nIn this lecture we are going to consider experiments on yeast, a very useful organism for\ngenetic study. Yeast is more properly known as Saccharomyces cerevisiae, which is the\nsingle-celled microbe used to make bread and beer. Yeast can exist as haploids of either\nmating type α (MATα) or mating type a (MATa). Haploid cells of different mating type\nwhen mixed together will mate to make a diploid cell.\nHaploids and diploids are isomorphic - meaning that a given mutation will cause essentially\nthe same change in haploid and diploid cells. This allows us to look at the effect of having\ntwo different alleles in the same (diploid) cell.\nAll yeast needs to grow are salts, minerals, and glucose (minimal medium). From these\ncompounds, yeast cells can synthesize all of the molecules such as amino acids and\nnucleotides that are needed to construct a cell. The synthesis of complicated molecules\nrequires many enzymatic steps. When combined, these enzymatic reactions constitute a\nbiochemical pathway\n\nConsider the pathway for the synthesis of the amino acid histidine.\nA → B → C → D → histidine → Protein\nEnzyme: 11111\nEach intermediate compound in the pathway is converted to the next by an enzyme. For\nexample, if there is a mutation in the gene for enzyme 3 then intermediate C can not be\nconverted to D and the cell can not make histidine. Such a mutant will only grow if\nhistidine is provided in the growth medium.\n\nThis type of mutation is known as an auxotrophic mutation\n\nand is very useful for genetic\nanalysis.\ngrowth on minimal\ngrowth on minimal + histidine\nHis+ (wild type)\n+\n+\nHis-\n-\n+\nPhenotype: All traits of an organism (with an emphasis on trait under investigation)\nHomozygote:\n\ndiploid with two like alleles of same gene\nHeterozygote: diploid with two different alleles of same gene\nRecessive Allele: trait not expressed in heterozygote\ngenotype\nphenotype\nMate to :\ndiploid genotype\ndiploid phenotype\nMATa His3-\nHis-\nMATα His3-\nHis3-/His3-\nHis-\nMATa His3-\nHis-\nMATα His3+\nHis3-/His3+\nHis+\nBased on the His- phenotype of the His3-/His3+ heterozygote, we would say that His3- is\nrecessive to wild type.\nLet's consider a different kind of mutation giving resistance to copper that occurs in a\ngene known as CUP1.\ngenotype\nphenotype\nMate to :\ndiploid genotype\ndiploid phenotype\nMATa Cup1r\ncopper resistant\nMATα Cup1+\nCup1r/Cup1+\ncopper resistant\nDominant Allele: trait is expressed in heterozygote\nCup1r is dominant to wild type (Cup1+).\nThe terms dominant and recessive are simply shorthand expressions for the results of\nparticular experiments. If someone says a particular allele is dominant that means that\nat some point they constructed a heterozygous diploid and found that the trait was\nexpressed in that diploid.\n\nNote: Sometimes an allele will have more than one phenotype and may be recessive for\none and dominant for another. In such cases, the phenotype must be specified when one\nis making statements about whether the allele is dominant or recessive. Consider for\nexample, the allele for sickle cell hemoglobin in humans designated Hbs. Heterozygous\nindividuals (Hbs/Hba) are more resistant to malaria, thus Hbs is dominant for the trait of\nmalaria resistance. On the other hand, Hbs/Hba heterozygotes do not the debilitating\nsickle cell disease, but Hbs/Hbs homozygous individuals do. Therefore, Hbs is recessive\nfor the trait of sickle cell disease.\nOnce we find out whether an allele is dominant or recessive, we can already infer\nimportant information about the nature of the allele. The following conclusions will\nusually be true.\nRecessive\n\nalleles usually cause the loss of something that is made in wild type\nDominant alleles usually cause increased activity or new activity\nIt turns out that the Cupr allele actually carries more copies of the gene for a copper\nbinding protein and therefore increases the activity of the gene.\nLast lecture we defined the gene structurally as the DNA needed to encode a protein.\nWe can now define a gene in a new way based on its function. Using the phenotypic\ndifference between wild type and a recessive allele we can use a Complementation test to\ndetermine whether two different recessive alleles are in the same gene.\nSay you isolate a new recessive histidine requiring mutation that we will call HisX-. In\nprinciple, this mutation could be in His3 or it could be in any of the other genes in the\nhistidine biosynthetic pathway. In order to distinguish these possibilities we need a test\nto determine whether HisX the same as His3.\nTo carry out a complementation test, one simply constructs a diploid carrying both the\nHis3- and HisX- alleles.\nAn easy way to do this would be to mate a MATα HisX- strain to a MATa His3- strain.\npossibility\ngenotype of diploid\nphenotype of diploid complementa\ntion\nHisX= His3\nHis3-/His3-\nHis-\nNo\n\nHisX=His3\nHis3-/His3+, HisX-/HisX+\nHis+\nYes\n\nHaving performed this test, if the two mutations don't complement we conclude that they\nare in the same gene. Conversely, if they do complement we conclude that they are in\ndifferent genes.\nThis test only works for recessive mutations. Think about what the outcome would be if\nHisX- were dominant.\nThe complementation test can be thought of in the following way. If I have an allele\nwith an observable phenotype whose function can be provided by a wild type genotype\n(i.e., the allele is recessive) -- I can ask whether the function that was lost because of\nthe recessive allele can be provided by another mutant genotype. If not, the two\nalleles must be defective in the same gene. The beauty of this test is that the trait\ncan serve as a read-out of gene function even without knowledge of what the gene is\ndoing at a molecular level.\n\nDefinitions from the Language of Genetics\nGene: The fundamental unit of heredity, which can be defined in three ways: i) A gene can be\ndefined in molecular terms as a segment of DNA carrying the information necessary to express a\ncomplete protein or RNA molecule, including the promoter and coding sequence. ii) A gene can be\ndefined by function with a group of recessive mutations that do not complement each other. iii) A\ngene can be defined by position with a single-locus segregation pattern in a cross between lines with\ndifferent alleles. Examples are a 1:3 phenotypic ratio in the F2 generation in a cross between diploid\norganisms or a 2:2 segregation pattern in yeast tetrad analysis.\nAlleles: Distinguishable versions of the same gene.\nLocus: The site on a chromosome where a gene is located. Usually defined by recombinational\nmapping relative to neighboring loci.\nGenotype: The allelic constitution of an individual, usually with emphasis on the gene or genes\nunder examination.\nPhenotype: All of the traits or characteristics of an organism, usually with emphasis on traits con-\ntrolled by the gene or genes under examination.\nWild type: A standard genotype that is used as a reference in breeding experiments. Note that for\nhuman crosses there is no standard genotype and the concept of wild-type is therefore not meaning-\nful.\nHaploid: A cell or organism with one set of chromosomes (1n).\nDiploid: A cell or organism with two sets of chromosomes (2n).\nHomozygous: The condition of having two like alleles in a diploid.\nHeterozygous: The condition of having two different alleles in a diploid.\nDominant allele: An allele that expresses its phenotypic effect or trait in the heterozygous state.\nRecessive allele: An allele whose phenotypic effect or trait is not expressed in a heterozygout state.\nIncomplete dominance: The case where a heterozygote expresses a phenotype intermediate be-\ntween the corresponding homozygote phenotypes.\nComplementation test: A test of gene function where two genotypes with recessive alleles are\ncombined by a cross to test whether the genotype of one parent can supply the function absent in the\ngenotype of the other parent.\nF1: First generation produced by interbreeding of two lines.\nF2: Generation produced by interbreeding of F1 individuals.\nIncomplete penetrance: Cases where certain alleles are not always expressed to give observable\ntraits because of other environmental or genetic influences.\nTrue-breeding: Refers to a line of individuals that on intercrossing always produce individuals of\nthe same phenotype. This can almost always be taken to mean that the individuals are homozygous"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/c95540b17c440b443a541b434411b7fb_lecture3.pdf",
      "content": "Lecture 3\nLecture 3\nLecture 3\nLecture 3\nLecture 3\nNow let's consider diploid organisms:\nThe genotype of the zygote will depend on which alleles are carried in the gametes.\nWhen heterozygotes mate their offspring will have different phenotypes: If AAAAA is domi-\nnant to aaaaa, the two possible phenotypes will be the phenotype of aaaaa/aaaaa or the phenotype of\nAAAAA/AAAAA and AAAAA/aaaaa.\nWhen we do breeding experiments it is important to know the genotypes of the parents.\nBut as you can see from the example above individuals with the dominant trait could be\neither A/A\nA/A\nA/A\nA/A\nA/A or A/a\nA/a\nA/a\nA/a\nA/a. A method to control this type of variation is to start with populations\nthat we know to be homozygous. One way to do this is to keep inbreeding individuals until\nall crosses among related individuals always produce identical offspring. This is known as\na true-breeding population and all individuals can be assumed to be homozygous.\nA/A\nA/a\na/A\na/a\nA\na\nA\na\nsperm\negg\nAllele\nin gamete\nZygote\n\nTrue Breeding:\nTrue Breeding:\nTrue Breeding:\nTrue Breeding:\nTrue Breeding: homozygous for all genes\nSay we have a true breeding line of shibire flies these flies are paralyzed and have geno-\ntype shi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi-----.\nFirst, we can test to see whether the shibire allele is dominant or recessive.\nshi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi-----\nx\n(wild type) shi\nshi\nshi\nshi\nshi+++++/shi\nshi\nshi\nshi\nshi+++++\n↓\nall are shi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi+++++\n(The offspring from a cross of two true breeding lines is known as the F1 or first filial\ngeneration). The F1 flies appear like wild type therefore shi\nshi\nshi\nshi\nshi----- is recessive (not expressed\nin heterozygote)\nSay we have isolated a new paralyzed mutant that we call par\npar\npar\npar\npar.\nWe start with a true breeding par\npar\npar\npar\npar----- strain that we mate to wild type. We find that the\nmutation is not expressed in the F1 heterozygotes and therefore is recessive.\nTo find out whether par\npar\npar\npar\npar----- is the same as shi\nshi\nshi\nshi\nshi----- we can do a complementation test since\nboth mutations are recessive. For this test, we cross a true breeding par\npar\npar\npar\npar----- strain to a\ntrue breeding shi\nshi\nshi\nshi\nshi----- strain.\npar\npar\npar\npar\npar-----/par\npar\npar\npar\npar-----\nxxxxx\nshi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi-----\n↓\nF1 (these flies must inherit both shi\nshi\nshi\nshi\nshi-\n-\n-\n-\n- and par\npar\npar\npar\npar-----)\nPossible outcome Complementation?\nExplanation Inferred genotype\nF1 not paralyzed\nF1 paralyzed\nLet's look more carefully at gene segregation in a cross between F1 flies.\nshi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi+++++\nxxxxx\nshi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi+++++\nWhat is the probability of a paralyzed fly in the next (F2) generation?\npar\npar\npar\npar\npar----- genotype can supply\nfunction missing in shi\nshi\nshi\nshi\nshi-----\nand vice versa\npar\npar\npar\npar\npar----- has lost function\nneeded to restore shi\nshi\nshi\nshi\nshi-----\nshi\nshi\nshi\nshi\nshi-\n-\n-\n-\n- and par\npar\npar\npar\npar-----\ncomplement\nshi\nshi\nshi\nshi\nshi-\n-\n-\n-\n- and par\npar\npar\npar\npar-----\ndo not complement\npar\npar\npar\npar\npar-----/par\npar\npar\npar\npar+++++\nshi\nshi\nshi\nshi\nshi+++++/shi\nshi\nshi\nshi\nshi-----\nshi\nshi\nshi\nshi\nshi-----/shi\nshi\nshi\nshi\nshi-----\n\nDefinition: p(aaaaa) =\nna = number of outcomes that satisfy condition aaaaa\nN = total number of outcomes (of equal probability)\nProbability problems can be solved by accounting for every outcome, but usually it is\neasier to combine probabilities.\np(paralyzed F2 fly) = p(inherit shi\nshi\nshi\nshi\nshi----- from mother and inherit shi\nshi\nshi\nshi\nshi----- from father)\nProduct rule:\nProduct rule:\nProduct rule:\nProduct rule:\nProduct rule: p(aaaaa and bbbbb) = p(aaaaa) x p(bbbbb)\n(note the product rule only applies if aaaaa and bbbbb are independent which is the case here since\nthe allele from mother does not affect the allele from the father)\np(shi\nshi\nshi\nshi\nshi----- from mother) = 1/2\np(paralyzed) = 1/2 x 1/2 = 1/4\np(not paralyzed) = 1 - 1/4 = 3/4\nThus in the F2 generation the phenotypic ratio will be, 1 paralyzed : 3 not paralyzed\nA 1 : 3 phenotypic ratio among the F2 in a breeding experiment shows that alleles of a\nsingle gene are segregating.\nThis actually constitutes a third definition of a gene. Historically, this was the first\ndefinition of the gene developed by Gregor Mendel in the 1860s. Mendel was able to\ndetect single genes segregating in pea plants because he looked at simple traits and\nstarted with true-breeding strains.\nLet's see how these ideas can be applied to a very interesting problem in the evolution of\ncorn. Domestic corn is derived from wild progenitor Teosinte. There is no historical\nrecord of how the breeding was done to produce Maize but there is a genetic record of\nthe differences between Teosinte and Maize recorded the genomic differences between\nthese two species. Maize and Teosinte can be crossed to give viable progeny.\nTeosinte x Maize\n↓\nF1 all same and unlike either parent\n↓\nF2 50,000 plants\n~1/500 look like Teosinte and ~1/500 look like Maize\nna\nN\n\nHow many genes contribute to the differences between the two kinds of plants?\nLet's designate the genes that differ as AAAAA, BBBBB, CCCCC, DDDDD ...\n...\n...\n...\n...\nFor each gene there are two alleles: the allele present in Teosinte and the allele present\nin Maize.\nFor the AAAAA gene we will designate these alleles AAAAATTTTT and AAAAAM\nM\nM\nM\nM respectively. For the BBBBB gene\nthere will be alleles BBBBBTTTTT and BBBBBM\nM\nM\nM\nM and so on for all the genes that differ.\nLet's follow the AAAAA gene through the cross between Maize and Teosinte\nAAAAATTTTT/AAAAATTTTT x AAAAAM\nM\nM\nM\nM/AAAAAM\nM\nM\nM\nM\nF1 : AAAAATTTTT/AAAAAM\nM\nM\nM\nM\nBecause the F1 don't look like either parent, let's assume that the alleles are codominant.\nCodominant\nCodominant\nCodominant\nCodominant\nCodominant: heterozygote different than either homozygote.\nIncomplete dominance:\nIncomplete dominance:\nIncomplete dominance:\nIncomplete dominance:\nIncomplete dominance: heterozygote expresses the traits of both homozygous parents.\n(Alternatively, the genes that differ could have a mixture of dominant and recessive\nalleles)\nF2:\nAAAAATTTTT/AAAAATTTTT\nAAAAATTTTT/AAAAAM\nM\nM\nM\nM\nAAAAAM\nM\nM\nM\nM/AAAAAM\nM\nM\nM\nM\n:\n:\n1/4 will look like Teosinte.\nFor two genes that differ:\nAAAAATTTTT/AAAAATTTTT\nBBBBBTTTTT/BBBBBTTTTT\n1/4\nx\n1/4 = 1/16 will look like Teosinte.\nSimilarly, for three genes the probability will be 1/64. For four genes it will be 1/256,\nand for five genes it will be 1/1024.\nSince ~1/500 look like Teosinte the conclusion is that 4-5 genes differ between wild corn\n(Teosinte) and domestic corn (Maize). Using modern methods, it has been confirmed that\nthere are about five significantly different alleles and several of these have been located\nusing mapping methods."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/ff8e66f0e447d836b399030c1cd5161e_lecture4.pdf",
      "content": "Lecture 4\nFrom the last lecture, we followed gene segregation in a cross of a true breeding shibire\nfly with a wild type fly.\nShibire x wild type\n↓\nF1: all not paralyzed\n↓\nF2: 3 not paralyzed : 1 paralyzed\nThis is the segregation pattern expected for a single gene. But in an actual experiment\nhow do we know that the phenotypic ratio is really 3 : 1 ?\nThere is no logical way to prove that we have a 3 :1 ratio. Nevertheless, we can think of\nan alternative hypothesis then show that the alternative hypothesis does not fit the\ndata. Usually, we then adopt the simplest hypothesis that still fits the data.\nA possible alternative hypothesis is that recessive mutations in two different genes are\nneeded to get a paralyzed fly.\nIn this case a true breeding paralyzed fly would have genotype: a/a , b/b\nWhereas wild type would have genotype: A/A , B/B\nF1:\nA/aB\n/b\nnot paralyzed\nF2:\np(a/a and b/b) = (1/4 )2 = 1/16\np(a/a and B/-) = 1/4 x 3/4 = 3/16\np(b/b and A/-) = 3/16\np(A/- and B/-) = the rest = 9/16\nThis is the classic ratio for two gene segregation\n9 : 3 : 3 : 1\nparalyzed\nFor our hypothesis we should see a phenotypic ratio of 15 not paralyzed : 1 paralyzed.\n\nTherefore, to distinguish one-gene segregation from two-gene segregation we need a\nstatistical test to distinguish 3 : 1 from 15 : 1. Intuitively, we know that in order to get\nstatistical significance, we need to look at a sufficient number of individuals.\nFor a chi-square test you start with a specific hypothesis that gives a precise\nexpectation. The test is then applied to the actual experimental results and will give the\nprobability of obtaining the results under the hypothesis. The test is useful for ruling\nout hypotheses that would be very unlikely to give the actual results.\nSay we look at 16 flies in the F2 and observe 14 not paralyzed and 2 paralyzed flies.\nUnder the hypothesis of two genes we expect 15 not paralyzed flies and 1 paralyzed fly.\nWe calculate the value χ2 using the formula below. Where O is the number of individuals\nobserved in each class and E is the number of individuals expected for each class.\nΣ\n(O-E)2\nχ2 =\n=\n+\n= 0.067 + 1 = 1.067\nE\n(all classes)\ndegrees of freedom (df) = number of classes - 1\nFrom the table using 1 df, 0.05 < p < 0.5\nThe convention we use is that p ≤ 0.05 constitutes a deviation from expectation that is\nsignificant enough to reject the hypothesis. Therefore, on the basis of this sample of 16\nflies we can't rule out the hypothesis that two genes are required.\nSay we look at 64 F2 flies and find that 12 are paralyzed. For the hypothesis of two\ngenes the expectation is that 4 would be paralyzed. The χ2 for this data:\nχ2 =\n+\n= 1.07 + 16 = 17.1\nFrom the table p < 0.005 so we reject the two-gene hypothesis.\nLet's use this data to test the hypothesis of one gene segregation which would be\nexpected to give 16 paralyzed flies from 64 F2 flies,\nχ2 =\n+\n= 0.33 + 1 = 1.33\nFrom the table using 1 df, 0.5 < p < 0.5. Thus the data still fits the hypothesis of one-\ngene segregation.\n\nSo far, the hypothesis that one gene is responsible for the paralyzed trait is the simplest\nexplanation that fits the data.\nThe way to distinguish most easily between a heterozygote and a homozygote expressing\na dominant trait is to cross to a homozygous recessive test strain.\nTest cross: cross to homozygote recessive:\nA/A x a/a\ngives all A/a .\ni.e. all offspring will express the dominant trait.\nA/a x a/a gives 1/2 A/a and 1/2 a/a. i.e. one half of the offspring will express\nthe dominant trait.\nMendelian inheritance in humans\n\nFor humans we can't do test crosses, of course, but by following inheritance of a trait for\nseveral generations the modes of inheritance can usually be identified by applying basic\nprinciples of Mendel. The following are guidelines for identifying different modes of\ninheritance in pedigrees.\nAutosomal dominant\n\ni) Affected individuals must have at least one affected parent\nExceptions to this rule will occur if a new mutation arises in one of the parents (in\nreal life a more likely explanation is extramarital paternity). Another possibility is\nincomplete penetrance, where other genetic or environmental factors prevent the\ntrait from being expressed in one of the parents.\nAutosomal recessive\n\ni) When both parents are carriers, on average 1/4 of the children will be affected.\nii) When both parents are affected, then all of the children will be affected.\niii) If the trait is very rare then consanguinity is likely. That is, it is likely that\nparents of affected children are themselves related (e.g. cousins).\nX-linked inheritance\nO XcX+\nx O X+Y\n(carrier)\n↓\nX+Y\n(carrier)\n(color blind)\nO XcX+, O X+X+, O XcY, O\n\ni) When parents are a carrier O and an unaffected O , then on average, 1/2 of the\ndaughters will be carriers and 1/2 of the sons will be affected.\nIf the trait is rare then the vast majority of affected individuals will be male\nwhich is the hallmark of X-linked traits.\nii) Affected sons inherit the allele from mother\n- Maternal uncles often affected\n- Since inherited only from mother, inbreeding doesn't increase the\nprobability of an affected O .\nConditional probabilities\n\nConsider the following pedigree of a recessive trait.\n= female\n= male\n?\np(affected child) = p(mother carrier and father carrier and affected child)\n= 2/3 x 2/3 x 1/4 = 1/9\nHowever, if they have a child that is affected we must reassess the probability that\ntheir next child will be affected.\np(both parents carriers) = 1. So, p(next child affected) = 1/4\nThis example shows how probability calculations are based on information. The\nprobability changes not because the parents have changed but because our information\nabout them has.\n\nHANDBOOK for PROBABILITY CALCULATIONS\nMany problems in diploid genetics rely on basic concepts of probability. This is because each individual\ninherits at random only one of two possible copies of a gene from each parent. Thus, breeding experi\nments or inheritance in human pedigrees have probabilistic rather than absolute outcomes. Everyone\nhas an intuitive sense of probability but what we need is a precise definition that will allow probabilities\nto be manipulated quantitatively.\nProbabilities are usually defined in terms of possible outcomes of a trial. A trial could be the toss of a\ncoin, the roll of a die, or two parents having a child. If we define a specific event a, p(a) or the probabil\nity of a, can be defined as follows: after a very large number of trials, p(a) is simply the fraction of trials\nthat give outcome a. In principle, we could determine p(a) by actually performing a large number of\ntrials and directly measuring the fraction of trials that produce event a. This is sometimes called the\n\"Monte Carlo method\" named after a famous European casino and works well for computer simulations\nof complicated phenomena. However, in many cases there is a much simpler way to calculate probabili\nties. To directly calculate classical probabilities one must know enough about a process to break down\nthe possible outcomes of a trial into some number of equally probable events. In these cases the prob\nability of event a is:\np(a)=\nna\nN\nwhere na is the number of outcomes that satisfy the criteria for a and N is the total number of equally\nprobable outcomes. Note that since N includes all possible outcomes, na ≤ N and 0 ≤ p(a) ≤ 1.\nExample: A couple has two children, what is the probability that they are both girls? Assuming that the\nchances of having a boy or a girl are equal, there are 4 equally probable ways of having two children\n(boy, boy; girl, boy; boy, girl; girl, girl) and the probability of two girls is 1/4 or 0.25.\nFor classical probability problems you will always be able to arrive at the correct answer by writing out\nall of the possible outcomes of a trial and counting the fraction of outcomes that satisfy the criteria for a\ngiven event. Often, enumerating all of the outcomes for a trial is time-consuming and error-prone. It is\nusually faster and easier to break a problem down into simple parts and then to combine the probabilities\nfor the individual parts. The following are useful ways that probabilities can be combined to speed\nprobability calculations.\nPRODUCT RULE\np(a and b) = p(a) x p(b) if a and b are independent.\nTwo events are considered independent if they do not influence one another. The criterion of indepen\ndence is very important -- application of the product rule for events that are not independent will give\nan incorrect answer.\n\nExamples: To find the probability that a couple with three children have three boys we first note that the\nsex of one child has no influence on the sex of another and therefore constitute independent events. For\neach child, p(boy ) = 1/2 and by the product rule p(3 boys) = 1/2 x 1/2 x 1/2 = 1/8.\nFirst, for a recessive trait to be expressed the progeny must inherit the recessive allele from both the\nmother and the father. Since the probability of inheriting a given allele from a heterozygote is 1/2,\np(mutant from mother and mutant from father) = 1/2 x 1/2 = 1/4. Second, since unlinked genes are\ninherited independently, we can use the product rule again to calculate p(recessives at gene A and reces\nsives at gene B) = 1/4 x 1/4 = 1/16.\nSUM RULE\nThe probability that either a or b will occur can be written as p(a or b). If two events a and b cannot\nboth occur they are mutually exclusive and the number of events that satisfy a or b is na + nb. It should\nbe apparent from our definition of probability that:\nn + n\na\nb\np(a or b) = n +n =\na\nb = p(a) + p(b)\nN\nN\nN\nA useful special case of the sum rule arises when we consider p(not a). By definition p(a) and p(not a)\nare mutually exclusive and they encompass all possible outcomes. Thus:\np(a or not a) = 1 = p(a) + p(not a)\nand\np(not a) = 1 - p(a)\nExamples: Find the probability that a family with three children has at least one girl. We begin by\nnoting that instead of trying to count all possible families with at least one girl it is easier to realize that\np(at least one girl) is the same as p( not all boys). Since p(all boys) = 1/8, p(not all boys) = 1- 1/8 = 7/8\n= p(at least one girl).\nIn a cross where both parents are heterozygous for recessive mutations in two unlinked genes, what is\nthe probability that one of their progeny will express at least one of the dominant traits? p(at least one\ndominant) = 1 - p(both recessive), and from above, p(both recessive) = 1/16. Therefore p(at least one\ndominant) = 1 - 1/16 = 15/16.\nIn cases where two events a and b are independent but not mutually exclusive, we can still calculate\np(a or b). In this case we note that the two events a and (b and not a) are mutually exclusive and\nencompass all outcomes that satisfy a or b or both. For these mutually exclusive events we can apply\nthe sum rule. Thus,\np(a or b) = p(a or [b and not a]) = p(a) + p(b and not a)\nSince b and not a are independent:\np(a) + p(b and not a) = p(a) + p(b) x p(not a) = p(a) + p(b) x [1 - p(a)] =\np(a) + p(b) - [p(a) x p(b)]\nNote that in the case where a and b are mutually exclusive, p(a) x p(b) = 0 giving the same formula as\nfor the sum rule.\nExample: We can use this formula as another way to solve the last example, which is a case in which the\ntwo events are independent but not mutually exclusive. p(at least one dominant) = p(dominant at gene A\nor dominant at gene B) = p(dominant at gene A)+p(dominant at gene B) - [p(dominant at gene A) x\np(dominant at gene B )] = 3/4 + 3/4 - [3/4 x 3/4] =6/4 - 9/16 = 15/16."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/f21809c7c6f4da3e553f74c8fdd930d6_lecture5.pdf",
      "content": "Lecture 5\nUntil now our analysis of genes has focused on gene function as determined by phenotype\ndifferences brought about by different alleles or by a direct test of function - the\ncomplementation test.\nFor the next six lectures our analysis will be concerned with the tests of gene position\nstarting with the position of genes on chromosomes and finally mapping point mutations at\nthe resolution of single nucleotide pairs.\nWe've taken it for granted that genes reside on chromosomes, but how do we know this?\nLet's review the properties of gene segregation.\nConsider two different traits.\nA/A, B/B x a/a, b/b\nThe gametes from one parent will be A, B and from the other parent a, b\nThese gametes will then give an F1 generation of all A/a, B/b\nCrosses between F1 individuals will give an F2 generation with a 9 : 3 : 3 : 1 phenotypic\nratio as shown before.\nA better way to look at segregation is by a test cross of the F1 heteroxygote to a\nhomozygous recessive individual.\nA/a, B/b x a/a, b/b\nThe possible gamete genotypes from the F1 will be:\nA, ba\n, bA\n, Ba\n, B\n(recomb.)\n(parental)\n(parental)\n(recomb.)\nThe corresponding genotypes of the offspring in the testcross will be:\nA/a, b/ba\n/a, b/bA\n/a, B/ba\n/a, B/b\nEach offspring receives either one or the other parental allele: gene segregation.\nFor most gene pairs, the frequency of each of the four classes of gametes is the same\nindicating that the two genes segregate independently: independent assortment.\nAt the turn of the century microscopes allowed people to watch chromosomes in the\nnuclei of dividing cells. (human cells, for example, contain 46 chromosomes).\n\nThe chromosomes in dividing somatic cells go through Mitosis:\nThe net result of mitosis is to distribute a replica of each chromosome into the two\ndaughter cells.\nThe stages of mitosis are as follows:\ni) Interphase. DNA replication\nii) Prophase.Chromosomes condense and centromeres attach to microtubule spindle\niii) Metaphase. Chromosomes align\niv) Anaphase. Sister chromatids move apart\nv) Telophase. Nuclei reform\nThe cell has evolved a simple mechanical mechanism to insure that after mitosis each\ndaughter cell has received exactly one copy of each chromosome. (Failure of proper\nchromosome segregation is known as nondisjunction). The steps in the mechanism are as\nfollows: 1) After DNA replication two daughter chromosomes known as sister chromatids\nare held together by special proteins known as cohesins. 2) As chromosomes align in\nmetaphase microtubule spindles attach to centromeres on each chromatid. 3) Once all of\nthe chromatids are attached to spindles a protease known as separase becomes active\n(Actually unattached chromatids produce a signal to keep separase inactive and only when\nevery chromaitid pair is under tension generated by spindles pulling in opposite directions\nis the inhibitory signal turned off.) 4) Finally, active separase cleaves the cohesin pro\nteins detaching sister chromatids and allowing them be pulled apart by the spindle to be\ndistributed to different daughter cells.\n\nCells in production of germ cells such as pollen undergo a very different kind of division,\nMeiosis.\nMeiosis differs from mitosis in twofundamental respects: 1) in meiosis there are two\nrounds of chromosome segregation for one round of synthesis so each germ cell receives\nonly one of the two homologous chromosomes and 2) in meiosis the homologs pair with one\nanother then move to opposite poles.\nChromosomes behave in meiosis the same way that Mendel showed genes to behave.\nEach germ cell receives only one of the two homologs, a behavior that is analogous to gene\nsegregation.\nThe relative alignment of chromosomes is arbitrary which is analogous to independent\nassortment of genes.\nWhat was needed to show that genes are on chromosomes was a chromosome that could\nbe identified in the microscope and that carried an allele for a trait that could also be\nfollowed. The proof for chromosome theory would then depend on correlating the\nsegregation of the trait with segregation of the chromosome.\nT.H. Morgan proved chromosome theory in 1910 using Drosophila.\nFlies normally have brick-red eyes. The first white-eyed mutant was found by Morgan's\nwife, Lillian, who worked in the lab.\nwhite O x red O (wild type)\n↓\nF1:\nall red\n↓\nF2:\n3 red : 1 white (but only males)\nThus, the white mutation behaves like a recessive allele, but there was something unusual\nabout the white mutation because only the male flies in the F2 have white eyes.\n\nwhite O x red O (heterozygote from F1)\n↓\n1 red : 1 white\nIn this case equal numbers of males and females have white eyes. Again this is consistent\nwith white being a recessive trait. The most informative cross is the reciprocal of the\nfirst cross.\nwhite O x red O (wild type)\n↓\nred O , white O\nIgnoring the sex of the flies, it looks as if a wild type\nis heterozygous: the wild type\nO\nallele is always passed on to the daughters and the white allele is passed on to sons.\nThe explanation is that eye color gene is on the sex determining chromosome X. Males\nonly have one copy of the X chromosome and daughters always get one copy of the X\nfrom the mother and one copy from the father.\n(XX) x\n(XY)\nXX\nXY\nO\nO\nXw = white allele on X,\nX+ = red allele on X\nXwXw x X+Y\n↓\nXwX+\nXwY\nred O\nwhite O\nThus, the trait for red eyes is always inherited along with the X chromosome from the\nfather. The absence of red (giving white eyes) always goes with the Y chromosome."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/8cd4e71657a03ebe732413628eb0e02a_lecture6.pdf",
      "content": "Lecture 6\nWhen we talk about gene position the term locus is used to designate the chromosomal\nlocation of a gene.\nWhat we are going to do is to map genes relative to one another. To begin, we need two\ngenes on the same chromosome. Last lecture we saw how you could tell whether a gene is\non the X chromosome by how alleles of the gene are inherited differently by males and\nfemales.\nConsider two mutations on the X chromosome of Drosophila; crossveinless and white eye.\nGenotype\nPhenotype\nXcv+w+ Y\nwild type\nXcv- w+ Y\ncrossveinless wings\nXcv+w- Y\nwhite eye\nXcv-w+ Y\nx\nXcv+w-Xcv+\nw-\n(true breeding)\nAll of the daughters from this cross will have two different X-chromosomes, which\nXcv+w-Xcv-\nw+\ndiffer at two loci:\nWe want to follow these X chromosomes into the next generation so after a cross we\nlook at male flies.\nXcv+w-Y Xc\nv-w+Y\n\nparental classes:\nand\nXcv-w-Y Xc\nv+w+Y\n\ncrossover classes:\nand\n(crossveinless, white)\n(wild type)\nIn the crossover classes the alleles appear to have separated and moved from one X to\nthe other. Genes on the same chromosome often do not assort independently. Such\nbehavior is known as Linkage.\nunlinked -- crossover classes appear at same frequency as parental classes.\n(Note that traits that show independent assortment are unliked)\nweakly linked - crossover classes appear often but less often than parental classes.\ntightly linked -- crossover classes appear rarely or never.\n\n-\n-\n-\n-\n- -----\nTo see what's really going on we need to look at the chromatids in prophase of meiosis in\nthe mother.\nCrossovers between homologous chromosomes occur more or less at random during\nmeiosis. To give you a rough idea of how frequent these crossovers are, in several\ndifferent well studied organisms (Yeast, Drosophila, and humans) there is about one\ncrossover per chromosome arm per meiosis. The geneticist uses these random crossovers\nas a tool to measure distance. Distance can be obtained because crossovers between two\npoints that are close together will rarely occur whereas crossovers between points that\nare far apart will occur frequently.\nDefinition of genetic distance:\nmap distance (m.u. or cM) = 100 x crossover gametes\ntotal gametes\ncv\n-\nW+\n\nO\nx\nO\n(Note new notation)\nCV\n+\nw-\n(In order to detect both dominant and recessive alleles, we look at males only)\ncv\n-\nW+\n\nCV\n+\nw-\ncv\nw\n\nCV\n+\nW+\nNumber of crossover gametes = 120\nDistance = 100 x\n1,000\nTotal gametes = 1,000\n= 12 cM\n\nIt is important to note that once a map distance between two genetic markers has been\nestablished this distance can be used to calculate the expected numbers of each type of\nprogeny. For example, if you know that two mutations are 12 cM apart then you should\nexpect that 6% of the progeny from a cross will be of each of recombinant class.\nThings get interesting when we make several pairwise crosses between genes on the same\nchromosome.\nWe can use this data to construct a Genetic Map\n\nGenetic maps have the following properties:\ni) Distance is proportional to frequency of crossover classes (this approximation\nactually only holds for short distances of <20 cM)\nii) Distances are approximately additive: mapped points fall on a line.\niii) Maps are internally consistent and concise.\n(The first genetic map was constructed in 1911 by Alfred Sturtevant when he was a\nsophomore student in Morgan's lab)\nIt is important to remember that genetic distances are measured using a property of\nmeiosis (genetic recombination) that varies from one organism to another. The\nrelationship between genetic distance and actual physical distance can be summarized in\nthis way:\nGenetic distance = physical distance x recombination rate\n\nThe actual relationship between genetic distance in cM and physical distance in base pairs\n(bp) depends on the recombination rate and is different for different organisms\nFor example:\nHuman: 1.3 cM/Mbp\nYeast: 360 cM/Mbp\nSometimes recombination rates in the male and female of a species are different. In\nDrosophila there is no recombination in the male so the genetic distance between markers\non the same chromosome are always zero when examined by meiosis in the male. In hu\nmans the recombination rate (and therefore map distances) in the female are twice that\nof the male.\n\nAnother issue that often causes confusion concerns the map distances of genes that are\nfar apart on the same chromosome.\nThe physical length of a genetic interval is proportional to the frequency of crossovers\nthat occur in that interval during meiosis but in a cross we are not actually counting\ncrossovers rather we are counting the number of recombinant progeny that are produced.\nThe number of recombinants provide a good approximation of distance for short intervals\nbut as the interval length increases, multiple crossovers are possible making the relation\nship between frequency of recombinants and crossovers not linear.\nCrossovers between\nRecombinant\nsame chromatids\nprogeny\nyes\nno\nyes\nno\nIf the measured distance in a cross is statistically indistinguishable from 50 cM then we\nsay that the genes are unlinked. But this doesn't mean that distances greater than 50 cM\ncan not be obtained. By adding intervals, longer distances that are meaningful can be\nobtained. For example, if all the intervals between linked genes in the human genome are\nadded together the total length of the genome (in males) is 2,500 cM."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/582691e6cdd52354d8e420c583802265_lecture7.pdf",
      "content": "Lecture 7\nLast time we discussed how to measure the distance between two genes on the X\nchromosome. To do this we used the trick of looking only at male progeny so the\ngenotype of the X chromosome could be scored directly since these flies only carry one\ncopy of the X. For autosomes, we can have the same ability to score all recombinant\nclasses by crossing to a homozygous recessive individual. This is known as a test-cross.\nConsider the recessive traits vestigial wings and short bristles that are specified by two\ndifferent genes on the same autosome (non-sex chromosome).\n+\n+\n\nvg\nsh h\nx\nO\nO\nvg\nsh\n+\n+\n↓\nvg\nsh h\nAll F1:\n+\n+\n\nThe F1 flies are heterozygous for both genes so we are in position to see how\noftencrossovers between these chromosomes occur in meiosis by doing a test-cross.\nO vg\nsh h\nvg\nsh h\nx\nO\n+\n+\nv\ng\ns\nh\nh\n↓\n(Note that the progeny\nvg\nsh h\nhave distinct phenotypes)\nvg\nsh h\nvg\n\nsh h\n+\n+\n\nvg\n+\n\nvg\nsh h\n(crossover classes)\n+++++\nsh\nsh\nsh\nsh\nsh\nvg\nsh h\nThe distance between vg and sh = 100 x\n= 10 cM\n\nNow we'll do a second cross. Note that the key is to set up a parent that is heterozygous\nat two loci.\nO sh\n+\n\n+++++\ncn\ncn\ncn\ncn\ncn\nx O\n(cinnabar eyes)\nsh\n+\n\n+\ncn\n\n↓\nsh\ncn\n\nsh\n+\n\nO\nx\nO\n+++++\ncn\ncn\ncn\ncn\ncn\nsh\nsh\nsh\nsh\nsh\ncn\ncn\ncn\ncn\ncn\n↓\nsh\ncn\n\nsh\ncn\n\ncrossover classes\n+\n+\n\nsh\ncn\n\n+++++\ncn\ncn\ncn\ncn\ncn\nsh\ncn\n\nsh\n+\n\nsh\ncn\n\nDistance between sh and cn = 2 cM\nThere are two possible orders. We could resolve them by measuring the cn to vg\n\ndistance, which should be either 8 cM or 12 cM depending on the order. However, it's\ndifficult in practice to get a statistically significant measurement that would cleanly\ndistinguish between these possibilities.\nA better way to find the order is to set up all three heterozygous markers at the same\ntime and to look at the frequencies of the eight different gamete genotypes.\n\nThis is known as a 3 factor cross\n\nO cn\nsh\nvg\n\nx\nO\ncn\nsh\nvg\n\n+\n+\n+\n\ncn\nsh\nvg\n\ncn\nsh\nvg\n\n+\n+\n+\n\ncn\n+\n+\n+++++\nsh\nsh\nsh\nsh\nsh\nvg\nvg\nvg\nvg\nvg\ncn\nsh\n+\n+\n+\nvg\ncn\n+\nvg\n+++++\nsh\nsh\nsh\nsh\nsh\n+++++\nThese are all of the possible combinations. One pair of these gamete classes must be the\nresult of double crossovers. This class will be very rare (0.1 x 0.02 = 2 x 10-3). By\nfinding the rare class we have a qualitative test to determine gene order.\nThe double crossover classes for the two possible orders are:\ncn\n+\nvg\nor\n+\nsh\n+\n\n(If this were the order,\nthese would be the rare classes)\nsh\n+\nvg\nor\n+\ncn\n+\n\n(Since these are the rare classes\nwe know this to be the order)\n\nThere is a simple system for evaluating 3-factor crosses:\n1) Group recombinant classes into reciprocal pairs.\n2) The most frequent pair is the parental classes.\n3) Derive the gene order from the least frequent pair, which are the double cross\nover classes.\n4) The single crossover frequency for the two intervals can be obtained by adding\nthe frequency of each of the single crossover class pairs to the frequency of the\ndouble crossover class pair. (In the present example the double crossovers are so\nrare that their inclusion doesn't matter).\nsh\ncn\nvg"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/c6bf1f6730977521860467d0823e5ebc_lecture8.pdf",
      "content": "TETRAD ANALYSIS IN FUNGI\nImage removed to due to copyright considerations.\nTHE PRODUCTS OF A SINGLE MEIOSIS\nARE PACKAGED IN A SAC (ASCUS)\n\nA\nA\na\na\nTHE PRODUCTS OF A SINGLE MEIOSIS\nA\na\nHaploid\nDiploid\n1st\ndivision\nMeiosis\nX\na\nA\nA\na\na\nA\nImage removed to due to\ncopyright considerations.\nA\na\na\nA\n\nMendel\n1. Segregation: Equal numbers of A and a\n-The phenotype resulting from a mutation in a single\ngene will segregate exactly 2A : 2a.\n-Question in Tetradspeak:\nDoes the phenotype segregate2:2?\nYes. A and a are alleles of a single gene.\n\nHOW DO WE KNOW WHETHER TWO GENES ARE LINKED?\nb\na\nX\nB\nA\nA\nA\na a\nB\nB\nb b\nA B\nA B\na b\na b\nB\nB\nb\nb\nA\nA\na a\nor\nA b\nA b\na B\na B\nParental\nDitype\n(PD)\nNon-Parental\nDitype\n(NPD)\n\nHow do you determine linkage?\nYou cross AB x ab and find in 100 tetrads:\n48 PD\n52 NPD\nAre A and B linked?\n\nMendel\n1. Segregation: Equal numbers of A and a\n-The phenotype resulting from a mutation in a single\ngene will segregate exactly 2A : 2a.\n-Question in Tetradspeak:\nDoes the phenotype segregate 2:2?\nYes. A and a are alleles of a single gene.\n2. Independent Assortment (linkage): AB x ab\n-Tetradspeak: Are PD = NPD\nYes\nNo\nTwo genes are unlinked\nTwo genes are linked\n\nIndependent Assortment (linkage): AB x ab\n-Tetradspeak: Are PD = NPD\nTwo genes are unlinked\nTwo genes are linked\n\nComplete Linkage of Two Genes\nAB\nX\nab\nAB\nAB\nab\nab\nAB\nAB\nab\nab\nParental ditype\nAB\nAB\nab\nab\n\nThe Products of a Single Crossover\nA\nB\na\nb\nX\nA\nB\nAB\nParental\nA\nB\nAb\nRecombinant\na\nb\naB\nRecombinant\na\nb\nab\nParental\nX\nTETRATYPE\n\n2.\nIndependent Assortment (linkage): AB x ab\n-Tetradspeak: Are PD = NPD\nYes\nNo\nTwo genes are unlinked\nTwo genes are linked\nTETRATYPE?\nYes\nNO\n100% linked\nMap Distance\n= 1/2 TT\ncentiMorgans\nTOTAL\n\nHow do you determine linkage?\nYou cross AB x ab and find in 100 tetrads:\n90 PD\n10 TT\nAre they linked?\n90 PD = 90 X4 = 360 Non-Recombinant Progeny\n10 TT = 10 x 2 = 20 Recombinant Progeny\nMD in centimorgans = Recombinants X 100\nTotal tetrads\nMD = 20/400= 5 centiMorgans\nMap Distance\ncentiMorgans = 1/2 TT\nTOTAL\n\nLinkage AB x ab\nAre PD = NPD?\nYes\nNo\nTwo genes are unlinked\nTwo genes are linked\nTETRATYPE?\nYes\nNO\n100% linked\nMap Distance\n= 1/2 TT\nTOTAL\nWHAT ABOUT DOUBLE CROSSOVERS?\n\nDOUBLE CROSSOVERS\nA\nB\nA\nB\nAB\nAB\nA\nB\nAB\na\nA\nB\nAb TT\nPD\na\nb\nab\na\nb\nab\nXX\nX\nab\na\nb\nb\naB\nA\nB\nA\na\nA\nB\nAb\nAb\nA\nB\nAB\nB\nAb\nNPD\nX\naB TT\naX\nb\naB\na\nb\nab\nb\naB\na\nb\n1PD : 1NPD :2TT\n\nCROSSING OVER OCCURS AT THE 4 STRAND STAGE\nA\nB\nA\nB\na\nb\na\nb\nXX\nA\nB\nA\nB\na\nb\na\nb\nX\nB\nAB\nAB\nB\nAB\nAb TT\nPD\nab\nb\nab\nA\nA\na\na X\nab\nb\naB\nA\nB\nAb\nAb\nA\na\nB\nAB\nAb\nNPD\naB TT\naX\nb\naB\nab\nb\naB\n\nLinkage AB x ab\nAre PD = NPD?\nYes\nNo\nTwo genes are linked\nTETRATYPE?\nTwo genes are unlinked\nYes\nNO\nMap Distance\n= 1/2 TT\n100% linked\nTOTAL\nNPD?\nNO\nYES\nSINGLE\nDOUBLE\nMD = 1/2 TT + 3NPD\nTOTAL\n\nESTIMATION OF DOUBLE CROSSOVERS\nSingles = TT\nDoubles = 1PD :2TT: 1NPD\nSingle\n1/2 (TT-2NPD)\nDoubles 4NPD\nMD = 1/2(TT-2NPD) + 4NPD\nTotal\nSINGLE\nDOUBLE\nMD = 1/2 TT + 3NPD\nTOTAL\n\nHow do you determine linkage?\nYou cross AB x ab and find in 100 tetrads:\n70 PD\n20TT\n10NPD\nCount crossover gametes = 40 + 4 (10) X 100 = 20 cM\nAnalyze tetrads = 10 + 30\nX 100 = 40 cM\nIf we just count crossover gametes we would underestimate the distance.\n\nTHE THREE TYPES OF TETRADS\nParental\nNon-Parental\nTetratype\nA B\nA b\nA B\nA B\nA b\nA b\na b\na B\na B\na b\na B\na b\nNO ONE TETRAD TYPE IS SUFFICIENT.\nIT IS THE RELATIONSHIP THAT TELLS ALL"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/29d89f8b48c3c519a0197156690d9b17_lecture9.pdf",
      "content": "Lecture 9\nBy way of review, let's consider the general question of how genetic mapping studies can\nbe used to locate a gene that has been identified by an allele with an interesting\nphenotype. For example, the CLOCK mutation in mouse was identified as a semi-dominant\nmutation that disrupts the normal circadian rhythm. This mutation was isolated after\nmutagenesis of animals with ethyl-nitorosourea and then screening their offspring for\nabnormal activity at a time when normal mice would be sleeping.\nLet's assume that we have at our disposal a large number of genetic markers spaced\nevenly along all of the mouse chromosomes (later in the course we will discuss DNA-based\nmarkers which can be found in an almost unlimited number in the mammalian genome) and\nthat we have the capability to screen about 1000 mice for recombinants in a mapping\nexperiment. The question of how precisely we can locate the CLOCK gene can be\nconsidered to be a question of the resolving power of a mapping experiment. Two points\non a genetic map can only be resolved if a recombination event that separates them can\nbe found. The smallest interval that can be resolved on average if 1000 progeny are\nscreened is 1 recombinant in 1000 which corresponds to a map distance of ~ 0.1 cM on\neither side of the CLOCK mutation. Thus we would be able to map the CLOCK mutation to\nan interval of 0.2 cM.\nIn mice, and in humans, a simple rule of thumb is that 1 cM corresponds to a physical\ndistance of about 1 Mbp. Therefore our mapping experiment would locate the CLOCK\ngene to a region of DNA about 200 kbp in size. Such an interval may contain two to ten\ngene sequences so additional work using recombinant DNA methods would be needed to\nprecisely identify the CLOCK gene. However, there is still no substitute for\nrecombinational mapping studies as a way to initially narrow down the approximate\nlocation of a gene.\n\nTo review how we can categorize tetrads consider the following cross:\nTrp1- Leu2+ x Trp1+ Leu2-\nTrp1-Leu2+, Trp1+Leu2-, Trp1+Leu2+, Trp1-Leu2-\nThis is a Tetratype\n\nTrp1-Leu2+, Trp1-Leu2+, Trp1+Leu2-, Trp1+Leu2-\nThis is a PD\n\nTrp1+Leu2+, Trp1+Leu2+, Trp1-Leu2-, Trp1-Leu2-\nThis is an NPD\n\nNow consider a cross that involves mutations that have the same phenotype.\nLeu1-Leu2+ x\nLeu1+Leu2-\nNotice that even though we can't always unambiguously assign genotypes to each spore\nclone we can distinguish the three tetrad types.\nTetratype\n\nPD\n\nNPD\n\ngenotype\nphenotype\ngenotype\nphenotype\ngenotype\nphenotype\n1+2+\nLeu+\n1-2+\nLeu-\n1+2+\nLeu+\n1-2-\nLeu-\n1-2+\nLeu-\n1+2+\nLeu+\n1+2-\nLeu-\n1+2-\nLeu-\n1-2-\nLeu-\n1-2+\nLeu-\n1+2-\nLeu-\n1-2-\nLeu-\nHere are the steps used in tetrad analysis:\ni) Count tetrads of each type to get four numbers: PD, T, NPD, total\nii)\n\nIf the classes are in the following ratio: PD : T : NPD\n1 : 4 :\nthe genes are unlinked and you are finished.\niii)\n\nIf PD > > NPD, then the genes are linked and the distance between them is given by:\nT + 6NPD\nDistance in cM =\nx 100\n2 Σ\n\nGene Fine Structure\n\nSo far we have been considering the phenotypic consequences of mutations in different\ngenes and the relative positions of genes along chromosomes. Now we are going to look at\nthe internal structure of genes themselves and to consider the different kinds of\nmutations that are found in genes. For the next eleven lectures we will examine the\ngenes of bacteria and their viruses, known as phage (some special features of eukaryotic\ngenes will come later). First, let's see how the life cycle of phage can be exploited to\ncarry out classical genetic manipulations.\nPhage cross\n\nIn order to do genetics with phage it is necessary to have recognizable variants of phage.\nThe easiest mutants to work with have obvious distinctive plaque morphologies\nλ phage\nmi\n- :\nmake small plaques\nbecause fewer particles are released\nλ phage normally infects cells to make more phage. But about 1% of the time phage\nbecomes quiescent in host cell and prevents other phage from infecting that cell. This\nproperty of phage λ is known as immunity. The quiescent phage is known as a lysogen.\ncI\n-\nmutants make clear plaques because they can't form lysogens.\n\nPhage Cross: Infect bacteria with ~10 of each phage per cell to insure that every cell\nhas both kinds of phage replicating inside. Allow one round of growth then plate out the\nphage that are produced to look at the morphology of the plaques.\nPlaque type\nFrequency\nlg\nclear\n(parent)\n0.4\nsm turbid\n(parent)\n0.4\nlg\nturbid (recomb.)\n0.1\nsm clear\n(recomb.)\n0.1\nFor this cross the measured distance between mi\n- and cI\n-\nis:\nnumber of recombinants\nx 100 =\nx 100 = 20 m.u. (map units)\ntotal\nmi\ncI\n\n20 mu\nWe can also use this system to find the distance between two mutations in the same\ngene. For example, let's say that we have isolated two different cI\n-\nmutants that give\nclear plaques. After infection of E. coli with ~10 phage per cell of each mutant, the\nresulting phage are plated and their plaque morphology is examined. Most of the phage\nwill still be cI\n-\n, but recombination between mutations will produce wild type phage with\nturbid plaques. If 2 out of 1,000 phage make turbid plaques then the measured map\ndistance between the two mutations is 0.4 m.u. Note that in this example we are only\ncounting wild type recombinants and there should be an equal number of double-mutant\nrecombinants -- both classes of recombinants must be accounted for in calculating the\nmap distance.\ncI-1\ncI-2\n\n0.4 mu"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-03-genetics-fall-2004/765234abe048db06e3f9caf1cf7825b1_lecture10.pdf",
      "content": "Lecture 10\n\nAnalysis of Gene Sequences\n\nAnatomy of a bacterial gene:\nPromoter\nCoding Sequence (no stop codons)\nmRNA:\nTranscription\nTranslation Start\nTranslation Stop\nTranscription\nStart\n(AUG)\n(UAG, UAA, or UGA)\nTerminator\nS-D Sequence\nSequence Element\nFunction\nPromoter\nTo target RNA polymerase to DNA and to start transcription\nof a mRNA copy of the gene sequence.\nTranscription terminator\nTo instruct RNA polymerase to stop transcription.\nShine-Dalgarno sequence\nand translation start\nS-D sequence in mRNA will load ribosomes to begin transla\ntion. Translation almost always begins at an AUG codon in\nthe mRNA (an ATG in the DNA becomes an AUG in the\nmRNA copy). Synthesis of the protein thus begins with a\nmethionine.\nCoding Sequence\nOnce translation starts, the coding sequence is translated by\nthe ribosome along with tRNAs which read three bases at a\ntime in linear sequence. Amino acids will be incorporated into\nthe growing polypeptide chain according to the genetic code.\nTranslation Stop\nWhen one of the three stop codons [UAG (amber), UAA\n(ochre), or UGA] is encountered during translation, the\npolypeptide will be released from the ribosome.\nExample: A gene coding sequence that is 1,200 nucleotide base pairs in length (including\nthe ATG but not including the stop codon) will specify the sequence of a protein 1200/3 =\n400 amino acids long. Since the average molecular weight of an amino acid is 110 da, this\ngene encodes a protein of about 44 kd -- the size of an average protein.\n\nThe Genetic Code\n\nClassically, genes are identified by their function. That is the existence of the gene is\nrecognized because of mutations in the gene that give an observable phenotypic change.\nHistorically, many genes have been discovered because of their effects on phenotype.\nNow, in the era of genomic sequencing, many genes of no known function can be detected\nby looking for patterns in DNA sequences. The simplest method which works for\nbacterial and phage genes (but not for most eukaryotic genes as we will see later) is to\nlook for stretches of sequence that lack stop codons. These are known as \"open reading\nframes\" or ORFs. This works because a random sequence should contain an average of\none stop codon in every 21 codons. Thus, the probability of a random occurrence of even\na short open reading frame of say 100 codons without a stop codon is very small (61/\n64)100 = 8.2 x 10-3\nIdentifying genes in DNA sequences from higher organisms is usally more difficult than in\nbacteria. This is because in humans, for example, gene coding sequences are separated\nby long sequences that do not code for proteins. Moreover, genes of higher eukaryotes\nare interrupted by introns, which are sequences that are spliced out of the RNA before\ntranslation. The presence of introns breaks up the open reading frames into short\nsegments making them much harder to distinguish from non-coding sequences. The maps\nbelow show 50 kbp segments of DNA from yeast, Drosophila, and humans. The dark grey\nboxes represent coding sequences and the light grey boxes represent introns. The boxes\nabove the line are transcribed to the right ant the boxes below are transcribed to the\nleft. Names have been assigned to each of the identified genes. Although the yeast\ngenes are much like those of bacteria (few introns and packed closely together), the\nDrosophila and human genes are spread apart and interrupted by many introns. Sophisti\ncated computer algorithms were used to identify these dispersed gene sequences.\nSaccharomyces cerevisiae\nYFL046W\nYFL040W\nYFL030W\nRGD2\nFET5\nTUB2\nRP041\nYFL034W\nHAC1\nSTE2\nSEC53\nACT1\nMOB2\nRIM15\nCAK1\nBST1\nEPL1\nYFL044C\nYPT1\nRPL22B\nCAF16\nYFL042C\nGYP8\nDrosophila melanogaster\nCG3131\nCG16987 CG2964\nCG15400\nCG3123\nsyt\nHuman\nGATA1\nHDAC6\nLOC139168\nPCSK1N\n\nTo see how gene sequences are actually obtained, we will first need to consider some\nfundamentals of the chemical structure of DNA. Each strand of DNA is directional. The\ndifferent ends are usually called the 5' and 3' ends; referring to different positions on\nthe ribose sugar ring where the linking phosphate residues attach.\nIn a double stranded DNA molecule the two strands run anti-parallel to one another and\nthe general structure can be diagramed like this:\n'\n'\n5'\n3'\n- Note about representation of DNA sequences.\n1) Single strands are always represented in direction of synthesis - 5' to 3'\n2) For double stranded DNA, usually one strand is represented in the 5' to 3' direction.\nFor a gene, the strand represented would correspond to the sequence of the mRNA.\nDNA polymersaes are the key players in the methods that we will be considering. The\ngeneral reaction carried out by DNA polymerase is to synthesize a copy of a DNA\ntemplate starting with the chemical precursors (nucleotides) dATP, dGTP, dCTP, and\ndTTP (dNTPs). All DNA polymerases have two fundamental properties in common.\n(1)\nNew DNA is synthesized only by elongation of an existing strand at its 3' end.\n(2)\nSynthesis requires nucleotide precursors, a free 3' OH end, and a template strand.\nA general substrate for DNA polymerase looks like this:\n'\n'\n'\n3'\nNote that the template strand can be as short as 1 base or as long as several thousand\nbases.\nAfter addition of DNA polymerase and nucleotide precursors this product will be readily\nsynthesized:\n'\n'\n5'\n3'\n\nDNA Sequencing\n\nConsider a segment of DNA that is about 1000 base pairs long that we wish to sequence.\n(1) The two DNA strands are separated. Heating to 100 C to melt the base pairing\nhydrogen bonds that hold the strands together does this.\n(2) A short oligonucleotide (ca. 18 bases) designed to be complimentary to the end of one\nof the strands is allowed to anneal to the single stranded DNA. The resulting DNA\nhybrid looks much like the general polymerase substrate shown previously.\n(3) DNA polymerase is added along with the four nucleotide precursors (dATP, dGTP,\ndCTP, and dTTP). The mixture is then divided into four separate reactions and to each\nreaction a small quantity different dideoxy nucleotide precursor is added. Dideoxy\nnucleotide precursors are abbreviated ddATP, ddGTP, ddCTP, and ddTTP.\n(4) The polymerase reactions are allowed to proceed and, using one of a variety of\nmethods, radiolabel is incorporated into the newly synthesized DNA.\n(5) After the DNA polymerase reactions are complete, the samples are melted and run on\na gel system that allows DNA strands of different lengths to be resolved. The DNA\nsequence can be read from the gel by noting the positions of the radiolabeled fragments.\nThe crucial element of the sequencing reactions is the added dideoxynuclotides. These\nmolecules are identical to the normal nucleotide precursors in all respects except that\nthey lack a hydroxyl group at their 3' position (3' OH).\nThus dideoxynuclotides can be incorporated into DNA, but once a dideoxynuclotide has\nbeen incorporated further elongation stops because the resulting DNA will no longer have\na free 3' OH end. Each of the four reactions contains one of the dideoxynuclotides\nadded at about 1% the concentration of the normal nucleotide precursors. Thus, for\nexample, in the reaction with added ddATP about 1% of the elongated chains will\nterminate at the position of each A in the sequence. Once all of the elongating chains\nhave been terminated there will be a population of labeled chains that have terminated at\nthe position of each A in the sequence.\n\nA part of the final gel will look like this:\n+ddGTP\n+ddATP\n+ddTTP\n+ddCTP\nTop (--)\nBottom (+)\n(Note that larger molecules migrate more slowly to the cathode on these gels)\nThe deduced DNA sequence obtained from this gel is: 5' GGATCCTATC 3'\n\nPolymerase Chain Reaction\n\nNow let's consider how to obtain DNA segments that are suitable for sequencing. At\nfirst, DNA sequences were obtained from cloned DNA segments (we will discuss some\nmethods to clone new genes in a subsequent lecture). Presently the entire DNA sequence\nfor E. coli, as well as a variety of other bacterial species, has been determined. If we\nwant to find the sequence of a new mutant allele of a known gene we need an easy way to\nobtain a quantity of this DNA from a culture of bacterial cells. The best way to do this\nis to use a method known as PCR or polymerase chain reaction that was developed by Kary\nMullis in the mid-1980's. The steps in a PCR reaction are as follows.\n(1) A crude preparation of chromosomal DNA is extracted from the bacterial strain of\ninterest.\n(2) Two short oligo nucleotide primers (each about 18 bases long) are added to the DNA.\nThe primers are designed from the known genomic sequence to be complimentary to\nopposite strands of DNA and to flank the chromosomal segment of interest.\n(3) The double stranded DNA is melted by heating to 100 C and then the mixture is\ncooled to allow the primers to anneal to the template DNA.\n(4) DNA polymerase and the four nucleotide precursors are added and the reaction is\nincubated at 37 C for a period of time to allow a copy of the segment to be synthesized.\n(5) Steps 3 and 4 are repeated multiple times. To avoid the inconvenience of having to\nadd new DNA polymerase in each cycle a special DNA polymerase that can withstand\nheating to 100 C is used.\nThe idea is that in each cycle of melting, annealing and DNA synthesis the amount of the\nDNA segment is doubled. This gives an exponential increase in the amount of the specific\nDNA as the cycles proceed. After 10 cycles the DNA is amplified 103 fold and after 20\ncycles the DNA will be amplified 106 fold. Usually amplification is continued until all of\nthe nucleotide precursors are incorporated into synthesized DNA."
    }
  ]
}