{
  "course_name": "Geobiology",
  "course_description": "This course introduces the parallel evolution of life and the environment. Life processes are influenced by chemical and physical processes in the atmosphere, hydrosphere, cryosphere and the solid earth. In turn, life can influence chemical and physical processes on our planet. This course explores the concept of life as a geological agent and examines the interaction between biology and the earth system during the roughly 4 billion years since life first appeared.",
  "topics": [
    "Science",
    "Earth Science",
    "Geobiology",
    "Science",
    "Earth Science",
    "Geobiology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis course introduces the parallel evolution of life and the environment. Life processes are influenced by chemical and physical processes in the atmosphere, hydrosphere, cryosphere and the solid earth. In turn, life can influence chemical and physical processes on our planet. This course explores the concept of life as a geological agent and examines the interaction between biology and the earth system during the roughly 4 billion years since life first appeared.\n\nTextbooks\n\nStanley, Steven M.\nEarth System History\n. W. H. Freeman, 2008. ISBN: 9781429233491.\n\nKump, Lee R., James F. Kasting, and Robert G. Crane.\nThe Earth System\n. Prentice Hall, 2003. ISBN: 9780131420595.\n\nMadigan, Martinko, and F. Parker.\nBrock Biology of Microorganisms\n. Benjamin Cummings, 2008. ISBN: 9780132324601.\n\nMorel, M. M., and J. Hering.\nPrinciples and Applications of Aquatic Chemistry.\nWiley-Interscience, 1993. ISBN: 9780471548966.\n\nRecommended Readings\n\nWills, Christopher, and Jeffrey Bada.\nThe Spark of Life: Darwin And The Primeval Soup.\nBasic Books, 2000. ISBN: 9780738201962. [Preview with\nGoogle Books\n]\n\nCesare, Emiliani.\nPlanet Earth: Cosmology, Geology and the Evolution of Life and Environment\n. Cambridge University Press, 1992. ISBN: 9780521409490. [Preview with\nGoogle Books\n]\n\nBroecker, Wallace S.\nHow to Build a Habitable Planet\n. Columbia Univ Trustees, 1998. ISBN: 9780961751111.\n\nAdditional readings provided for some lectures.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation in class discussions\n\n25%\n\nProblem sets/assignments\n\n15%\n\nWeekly quizzes\n\n10%\n\nFinal blog piece\n\n20%\n\nMidterm exam\n\n15%\n\nFinal exam\n\n15%\n\nLecture Schedule\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nOverview of course; What is life? Can it be defined? Brief history of paleontology and geobiology; Life as a geological agent. Sedimentary environments and processes; Stratigraphy (John Smith??); Isostasy; Plate tectonics; Water and life; Habitable zone; Radiative balance; Greenhouse gases. Faint Young Sun.\n\nTime scales of major events in formation of Universe and Solar System; Abundance of elements. Geochronology; Introduction to geological processes, rocks and minerals. Planetary accretion and differentiation. Introduction to the geological timescale and major transitions in Earth history.\n\nProblem set 1 due\n\nEvolution of other terrestrial planets (Mars).\n\nPrebiotic chemistry, Nucleic acids, Amino Acids and Chirality, Origins of life, Panspermia; Luca and the three domains; Universal tree of life.\n\nWoese paper instead of problem set\n\nIsotopes; isotopic nomenclature; definition of atm%, ratio, α, δ, ε; how to do simple isotopic calculations including mass balance; CHNOS standards, what they are and the forms that are prepared for analysis; what processes cause isotopic fractionation including C, H and N in OM and C and O in limestones; S in pyrite and sulfate; ballpark δ values of C, O, S in main reservoirs and biomass.\n\nIsotope paper: Des Marais C-cycle\n\nIsotope problem set 1 due.\n\nMore about fractionated isotopes; S in pyrite and sulfate; How H&O are fractionated in the hydrological cycle; How (roughly) C&H fractionation occurs in lipids. Biogeochemical carbon cycle.\n\nDiscussion of isotope papers. Fike seminar in EAPS.\n\nRedox processes.\n\nIsotope problem set 2 due\n\nRedox processes II, examples from various environments. Anaerobic metabolisms.\n\nAnoxygenic and oxygenic photosynthesis; BIF; Evidence for early life on Earth; Stromatolites; Microfossils. Microbial sediments.\n\nProblem set 2 due.\n\nGeological evidence of photosynthesis and oxygenation. Early atmosphere. Oxygenation of the ocean/atmosphere system. Anbar and Knoll. Redox transitions.\n\nGeological evidence of photosynthesis and oxygenation, Part II. Early atmosphere. Oxygenation of the ocean/atmosphere system. Anbar and Knoll. Redox transitions.\n\nProblem set 3 due.\n\nMidterm exam\n\nNeoproterozoic carbon cycle and environmental oscillations. Snowball Earth.\n\nPapers for a class discussion\n\nEvolution and Radiation of Photosynthetic Organisms; Successions of plankton in the ocean. Radiation of vascular plants.\n\nEdiacaran fauna. Evolution and radiation of animals. Evidence for early animals. Animal body plans. Sponges.\n\nC. Marshall paper Deadline to decide on the problem to write about for the final blog piece.\n\nReefs and carbonate precipitation through time: evidence for changes in ocean chemistry and biology. Impact of biomineralization on carbon cycle.\n\nBiomineralization and biominerals. Ray Pierrehumbert seminar in EAPS.\n\nMass Extinctions incl. Permian-Triassic event.\n\nMesozoic time. Geology and biology. K-T boundary, LPTM. Volcanism, carbon cycle perturbation or impact?\n\nLife in extreme environments.\n\nMolecular microbiology and paleontology. PCR, genomics, trees. Modern microbially-dominated ecosystems.\n\nClass discussion of a paper related to environmental microbiology.\n\nStudent presentations of blog pieces (extended to recitation time).\n\nOral exam\n\nExam week\n\nNo written final, blog pieces due",
  "files": [
    {
      "category": "Assignment",
      "title": "Geobiology, Assignments 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/9e6ae269a2f3a88bc1c796922a1b4d1c_MIT12_007S13_PSet_3.pdf",
      "content": "Geobiology Spring 2013\nIsotope Problem Set: Due Monday March 18th\n\nName: ______________________\n\n1. Identify and calculate the exact molecular weights of all the isotopologues of CO2\nand H20. Calculate their relative abundances in a sample of seawater assuming all\natoms are at their natural abundances and there are no isotope effects.\n2.\nA ratio of S/ S of 20.031 was measured for a sample of sulfate. The same ratio\nin the Canyon Diablo Triolite is 22.22. What is the 34S value for the sulfate\nsample?\n3.\nA sample of diamond has a C value relative to the lab standard. The lab\nstandard has a C value of -6.50 relative to VPDB. What is the diamond\nrelative to VPDB?\n\n4. A bacterium fixes carbon autotrophically and produces biomass with a C value\nof -31.6 per mil VPDB starting with atmospheric CO2 having a delta value of -7.8\nper mil VPDB. Speculate about the type of isotope effects that might operate and\npropose possible carbon assimilation pathways. What are the alpha and epsilon\nvalues for the sum of the processes.\n\n5. Inorganic carbon delivered to the ocean/atmosphere system by volcanism and\nweathering has the C value of -5 per mil.\n\na) Calculate the isotopic composition of carbonate minerals precipitated from the\nseawater, stating your assumptions about different burial fractions and the\nfractionation by primary producers.\nb)\nCarbonate rocks that have a C value of + 9 per mil are common in the\nNeoproterozoic. What would you expect forg to have been during the\ndeposition of these carbonates?\nc)\nCarbonate rocks that have a C value of -8 per mil can also be found in a\nnumber of Neoproterozoic successions. Which and forg can explain the\ndeposition of these carbonates? Propose a mechanism that delivered inorganic\ncarbon with very low C value to these rocks.\nd) If carbonate rocks are deposited in areas with a strong delivery of inorganic\ncarbon from carbonate weathering (C value of + 3 per mil), what would\nyou expect their C value to be? State your assumptions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Geobiology, Assignments 3 Solution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/f98ff5991180b66f5f2c02eae8b92563_MIT12_007S13_Solution_3.pdf",
      "content": "Geobiology Spring 2013\nIsotope Problem Set Solutions\n\n1. Identify and calculate the exact molecular weights of all the isotopologues of\nCO2 and H20. Calculate their relative abundances in a sample of seawater\nassuming all atoms are at their natural abundances and there are no isotope\neffects.\n\nI calculated the solutions in an excel file using the following information about\nexact mass and natural abundance:\n\nExact Mass\nNatural Abundance (%)\n1H\n1.007825\n99.985\n2H\n2.014102\n0.015\n12C\n98.89\n13C\n13.003355\n1.11\n16O\n15.994915\n99.759\n17O\n16.999131\n0.037\n18O\n17.999159\n0.204\n\nNotice that both CO2 and H2O are symmetrical molecules, so we need to multiply\nby 2 for isotopologues that can be created in 2 equally likely ways. For example:\n16O=12C=18O vs. 18O=12C=16O are 2 ways of constructing 12C16O18O whereas\nthere is only one way to make 12C16O16O. The isotopologues that had an\nadditional factor of two due to symmetry consideration are marked in green.\nCheck to make sure your percentages add up to 100.\n\nmultipled by a factor of 2 (symmetry considerations)\n\nWater\nExact Mass\nPercent\n1H 1H 16O\n18.010565\n99.729\n1H 2H 16O\n19.016842\n0.0299\n2H 2H 16O\n20.023119\n2.245E-06\n1H 1H 17O\n19.014781\n0.0370\n1H 2H 17O\n20.021058\n1.11E-05\n2H 2H 17O\n21.027335\n8.325E-10\n1H 1H 18O\n20.014809\n0.20394\n1H 2H 18O\n21.021086\n6.119E-05\n2H 2H 18O\n22.027363\n4.59E-09\n\nCarbon Dioxide\nExact Mass\nPercent\n12C 16O 16O\n43.98983\n98.414\n12C 16O 17O\n44.994046\n0.073\n12C 16O 18O\n45.994074\n0.402\n12C 17O 17O\n45.998262\n1.35E-05\n12C 17O 18O\n46.99829\n1.49E-04\n12C 18O 18O\n47.998318\n0.00041\n13C 16O 16O\n44.993185\n1.10466\n13C 16O 17O\n45.997401\n0.00082\n13C 16O 18O\n46.997429\n0.00452\n13C 17O 17O\n47.001617\n1.52E-07\n13C 17O 18O\n48.001645\n3.04E-07\n13C 18O 18O\n49.001673\n4.62E-06\n\n2. A ratio of 32S/34S of 20.031 was measured for a sample of sulfate. The same\nratio in the Canyon Diablo Triolite is 22.22. What is the 34S value for the\nsulfate sample?\n\nGiven:\nSulfate Sample: 32S/34S= 20.031\nCanyon Diablo Triolite (CDT): 32S/34S= 22.22\n\nDefinition:\nδ34SSample= [( 34Rsample/34RCDT) - 1]*1000 where 34RX=[34S/32S]x (note this is the inverse of\nhow the ratio is given in the problem, so we will need to take the inverse of what's given)\n\n34RSample= 1/20.031= 0.0499226\n34RCDT= 1/22.22= 0.0450045\n\nδ34SSample=[ (0.0499226/0.0450045) - 1]*1000 =109.28 permil\n\n3. A sample of diamond has a 13C value relative to the lab standard. The lab\nstandard has a 13C value of -6.50 relative to VPDB. What is the diamond\nrelative to VPDB?\n\nGiven:\nδ13CStd, VPDB=-6.50 permil\nδ13CDMD, Std=X\nδ13CDMD, VPDB=Y\n\nwhere Std. is the lab standard, VPDB is the official standard, and DMD is the diamond\nsample.\n\nWrite these in terms of the definition:\n\nδ13CStd, VPDB= [( 13RStd/13RVPDB) - 1]*1000 = -6.50 permil\n\n(1)\nδ13CDMD, Std= [( 13RDMD/13RStd) - 1]*1000 = X permil\n\n(2)\nδ13CDMD, VPDB=[( 13RDMD/13RVPDB) - 1]*1000 = Y permil\n\n(3)\n\nSolve for 13RStd using equation 1:\n13RStd= [(δ13CStd, VPDB/1000) + 1]* 13RVPDB\n= [(-6.50/1000) +1] * 13RVPDB where * 13RVPDB=1.12372*10-2 (can look this up in\nclass notes or on the internet)\n13RStd= 0.01116416\n\nNow substitute and rearrange equation 2 for 13RDMD:\n13RDMD=1.116416*10-5* δ13CDMD, Std + 0.01116416\n\nSubstitute into equation 3 and simplify:\nδ13CDMD, VPDB=0.9935* δ13CDMD, Std - 6.4998\n\nWould need either a value for δ13CDMD, Std or 13RDMD to be given in order to get a\nnumerical value for δ13CDMD, VPDB.\n\n4. A bacterium fixes carbon autotrophically and produces biomass with a 13C\nvalue of -31.6 per mil VPDB starting with atmospheric CO2 having a delta\nvalue of -7.8 per mil VPDB. Speculate about the type of isotope effects that\nmight operate and propose possible carbon assimilation pathways. What are\nthe alpha and epsilon values for the sum of the processes.\n\nGiven:\nAtmospheric CO2: δ13C = -7.8 permil\nAutotrophic Biomass: δ13C = -31.6 permil\n\nAssumptions:\nAutotrophic Biomass is fixing inorganic C from atmospheric CO2 or an inorganic C\nsource with the same isotopic value of atmospheric CO2. Note: dissolved inorganic C\n(DIC) species in the oceans have a different isotopic composition compared to the\natmospheric C, so calculating the isotopic fractionation using DIC while taking into\naccount carbonate equilibrium considerations instead of atmospheric C will yield a\ndifferent result.\n\nεProd/Reac ≈ -31.6 - (-7.8) = -23.8 permil\n(this is an approximation)\nNote that -23.8 permil is close to the isotope effect associated with cyanobacterial\nRubisco 2 according to the class notes.\n\n(α-1)*1000 = ε\n\n(this is the strict definition)\n\nSolve for α using the εProd/Reac approximated above:\n\nαProd/Reac = [ε/1000]+1 = 0.9762\n\nThe values you get here will depend on how you define epsilon and alpha (ie whether it's\nproduct/reactant or reactant/product). Either convention is valid as long as it's specified\nand consistent throughout the problem.\n\nThe above solution is most accurate for an autotrophic organism fixing atmospheric C.\nAlternatively, you could get a more accurate value for a marine autotrophic organism\nusing bicarbonate. If the atmospheric CO2 δ13C = -7.8 permil, then the marine\nbicarbonate pool will be roughly 0 permil because of equilibrium between atmospheric\nCO2 and dissolved CO2 as well as the additional carbonate species (H2CO3*, HCO3\n-,\nCO3\n2-). You can confirm that bicarbonate would be roughly 0 permil by looking at the\nclass slide displaying the natural variability in bulk C isotopes. If the autotroph was using\nonly bicarbonate the you can make the following calculation:\n\nεProd/Reac ≈ -31.6 - (-0) = -31.6 permil\n(this is an approximation)\n\nwhere you can solve for alpha in the same way above to yield the following result:\n\nαProd/Reac = [ε/1000]+1 = 0.968\n\nThis value is more like Rubisco 1 for plants and algae.\n\n5. Inorganic carbon delivered to the ocean/atmosphere system by volcanism\nand weathering has the 13C value of -5 per mil.\n\na) Calculate the isotopic composition of carbonate minerals precipitated\nfrom the seawater, stating your assumptions about different burial\nfractions and the fractionation by primary producers.\n\nδin=fCarb * δCarb + fOrg * δOrg (1)\nwhere fCarb + fOrg = 1\n\nAccording to figures in lecture slides based on Des Marais, 2002:\n\nfCarb = 0.8 and f Org = 0.2 in the modern\n\nGiven:\nδin= -5 permil\n\nAssume:\n\nδOrg= -25 permil\n\nThen substitute into equation 1:\n\n-5= (.8* δCarb) + (.2*-25)\nδCarb = 0 permil\n\nThis value fits within the range of isotopic values for modern carbonates.\n\nb) Carbonate rocks that have a 13C value of + 9 per mil are common in the\nNeoproterozoic. What would you expect forg to have been during the\ndeposition of these carbonates?\n\nGiven:\nδin= -5 permil\nδCarb= 9 permil\nAssume:\nδOrg= -25 permil\n\nSolve for fOrg by substituting equation 1 into equation 2:\n\nfCarb= 1- fOrg\n\n(1)\nδin=fCarb * δCarb + fOrg * δOrg\n(2)\n\nInserting known values gives forg=0.41 so fCarb= 0.59.\n\nHence there were intervals of greater COrg burial in the past relative to the modern.\n\nc) Carbonate rocks that have a 13C value of -8 per mil can also be found in\na number of Neoproterozoic successions. Which and forg can explain\nthe deposition of these carbonates? Propose a mechanism that delivered\ninorganic carbon with very low 13C value to these rocks.\n\nFirst notice that the carbonate rocks are lighter than the canonical isotopic values of C\nsource from volcanoes and weathering. Therefore, we will need to invoke a source of\nisotopically light C, such as organic C or methane.\n\nMore specifically, if you take a typical value for δOrg (-25 permil) and the volcanic and\nweathering input value of -5 permil, then you get a negative forg unless you choose an\nunrealistic value of εBiomass/DIC. This isn't physically possible.\n\nAlternatively, if you have a light C source, say something similar to marine algal biomass\n(-20 permil):\n\nδin=fCarb * δCarb + fOrg * δOrg\n\n-20= (1-fOrg)(-8) + fOrg (-25)\n\nfOrg= 0.71\n\nThis solution allows for a reasonable photosynthetic fractionation and a positive fraction\nof organic C burial.\n\nd) If carbonate rocks are deposited in areas with a strong delivery of\ninorganic carbon from carbonate weathering (C value of + 3 per mil),\nwhat would you expect their C value to be? State your assumptions.\nGiven:\nδin= 3 permil\n\nAssume:\nSame fOrg and fCarb as given in slide based on Des Marais 2002.\nδOrg= -25 permil\n\nAgain use the following equation:\nδin=fCarb * δCarb + fOrg * δOrg\n\nPlug in the values to get δCarb = 10 permil\n\nNote that you could make other assumptions to get different answers to most parts of this\nproblem, but be sure to check that your assumptions are reasonable and give reasonable\nvalues.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Geobiology, Assignments 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/92a66ae080af302a29ce0cf5c2485c5a_MIT12_007S13_PSet_4.pdf",
      "content": "12.007 Problem Set Due March 20\nThe carbon cycle and microbial energetics\n1. What is the major source of chlorine in seawater? How about sodium? How about sulfate?\n2. Discuss some processes through which global warming can influence the biological pump, including\nthe concentration of oxygen in the water column, the production of CaCO3 by phytoplankton\n(calcification), redox stratification and the production of SiO2 by phytoplankton.\n3. Selenate (SeO4\n2-) is a highly toxic inorganic pollutant that occurs at micromolar concentrations in\nsome agricultural wastewaters.\nCan a microbe remove selenate from the water by reducing it to elemental selenium (Se) by coupling\nthis reduction to the oxidation of acetate?\nAddress by:\nA) writing the balanced half-reaction for the selenate/Se couple\nB) writing the balanced half-reaction for the oxidation of acetate at pH = 8\nC) writing the balanced redox reaction coupling the reduction of selenate to the oxidation of\nacetate and calculating its energy yield\nD) discussing the effect of pH and the concentration of organics and selenate on the energetics of\nthe reactions in C) per mole of acetate and per mole of selenate\nE) discussing whether a microbe could also reduce selenate to selenite [i.e., not all the way to\nSe(s)] coupled with the oxidation of acetate\nF) Would the microbe gain more or less energy by oxidizing lactate instead of acetate (coupled to\nthe reduction of selenite/Se)?\nG) Would you expect the reduction of selenate to selenite to Se to be carried out by one microbe\nor multiple microbes? Why? How would you test your hypothesis?\n\n1⁄2 SeO4\n2- + 2H+ + e- = 1⁄2 H2SeO3 + 1⁄2 H2O\n\npe0 = + 19.4\n1⁄4 H2SeO3 + H+ + e- = 1⁄4 Se(s) + 3⁄4 H2O\n\npe0 = + 12.5\nacetate: 1⁄4 CO2(g) + 7/8 H+ + e- = 1/8 CH3COO- + 1⁄4 H2O\n\npe0 = + 1.27\nCO2 + H2O = H2CO3*\n\nlogK = -1.5\nH2CO3* = H+ + HCO3-\n\nlogK = -6.3\nHCO3\n- = H+ + CO3\n2-\n\nlogK= -10.3\nG = n 2.3RT(pe2-pe1)\nG = G0 + RTln{[Red1][ Ox2]}/{[Ox1] [Red2]}\n4. A sulfate-reducing organism oxidizes formate to CO2 while reducing sulfate to\n\nsulfide.\n\na. Write out the two half-reactions and the balanced complete reaction assuming the\nappropriate species at pH=9.4.\nb. Using reduction potentials (Table 7.1 from the Morel and Hering reading),\ncalculate DGo for this metabolism.\nc. Discuss how DG would change over the pH range 1-14. State your assumptions\nabout the concentrations of other relevant species.\nd. Would these organisms be heterotrophic or autotrophic?\n5. Read Lavik et al. and answer the following questions:\na. What is annamox? Write the reaction for this metabolism.\n\nb. Where in the water column would you expect annamox to occur?\nc. Calculate DG for the reaction describing the oxidation of sulfide with nitrate.\nd. Write the similar reaction describing the oxidation of sulfide with oxygen and\ncalculate DG.\ne. How do organisms performing metabolisms described in c. and d. acquire their\ncarbon?\nf. Which genes are used as tracers of sulfur oxidation? What do these genes do?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Geobiology, Solutions 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/8e0de5b441c639e595ef1f7d7d369f74_MIT12_007S13_Solution_4.pdf",
      "content": "12.471 Geobiology Redox Chemistry Problem Set solutions\n1. What is the major source of chlorine in seawater? How about sodium? How about sulfate?\nLooking for specific mention of minerals that supply these major elements to the ocean and how they\nare delivered. Also, what do they have in common? These are all conservative ions, so they have high\nconcentrations in the world's ocean today and their concentrations scale with salinity.\nWeathering and delivery via rivers are the primary source, although additional possible sources such as\nhydrothermal vents and submarine groundwater discharge should be considered. Apatite, Na-\nplagioclase-feldspar, and oxidative weathering of pyrite are the main minerals that should be discussed\nas sources of these conservative ions. NaCl (halite) may be mentioned, but it's not a true source since it\nis the recycling of chloride and sodium from evaporites back to seawater. These elements had to\noriginally get into seawater via another pathway. We discussed the origin of seawater sulfate in class by\nthe oxidative weathering of pyrite, but weathering of gypsum will receive partial credit.\n2. Discuss some processes through which global warming can influence the biological pump, including\nthe concentration of oxygen in the water column, the production of CaCO3 by phytoplankton\n(calcification), redox stratification and the production of SiO2 by phytoplankton.\nFirst, what is the biological pump? The biological pump refers to the creation of chemical gradients in\nthe oceans as a result of biological processes, including primary production, export production, and\nremineralization. In recitation, we discussed several examples. Any type of nutrient depletion in the\nsurface ocean and concentration increase at depth (~1000 m) would be a good example of the biological\npump. Another example discussed in recitation is the dissolved inorganic carbon (DIC) concentration and\nd13C depth profiles. Carbon is fixed in the surface ocean and remineralized at depth, so there is a lower\nconcentration of DIC in the surface ocean relative to the depths where remineralization is occurring\n(~1000 m). Similarly, photosynthesizers fix isotopically light carbon and the isotopically light carbon is\nshuttled to depth via export production. As a result, a carbon isotopic depth gradient is observed where\nDIC is isotopically heavier in the surface ocean compared to the deeper waters that have input from\nremineralized organic matter.\nNow, that we have established what the biological pump means, how might global warming affect\nseveral aspects related to the biological pump? Marine oxygen concentrations are affected by a\ncombination of physical and biological processes, specifically solubility, air-sea gas exchange,\nphotosynthesis, and remineralization. Warming will decrease oxygen solubility, so the equilibrated\nsurface ocean will hold less oxygen. This is particularly important at higher latitudes, which reportedly\nwill experience the greatest degree of warming, because bottom waters sourced from high latitudes will\nstart off with less oxygen (assuming similar ocean turnover rates). Ocean anoxia and expanded oxygen\nminimum zones (OMZs) are predicted for the future ocean owing to warming and are thought to have\ncharacterized past oceans in greenhouse conditions.\nExpanded zones of anoxia will inherently change the biogeochemical redox cycling in the ocean.\nNitrogen is a key nutrient that will likely be affected by expanded OMZs. Rates of anaerobic processes,\nsuch as anammox and denitrification, will likely increase in light of expanded OMZs.\nThe effects of global warming on production of CaCO3 will depend on the source of global warming.\nLet's say that the global warming is driven by a pCO2 increase on a geologically rapid timescale (100s to\n1000s yrs), as in the modern. See Honisch et al., 2012, particularly figure 3 for an illustration on the\n\nresults of this kind of perturbation. Ocean pH should decline as a result of adding more CO2 (an acid).\nHowever, CO2 must equilibrate amongst the different carbonate chemistry species (H2CO3*, HCO3-,\nCO3 2-). Recall the Bjerrum plot for the distribution of C at different pHs given a specified DIC\nconcentration. The species shift left for lower pH. In other words, as pH decreases, less of the DIC will be\nin the form of carbonate ion (CO3 2-). The solubility product of calcium carbonate depends on Ca2+\nconcentrations and carbonate ion concentration. A lower concentration on carbonate ion concentration\nwill drive equilibrium away from calcium carbonate precipitation. Therefore, calcification by organisms\nwill become less energetically favorable. Some calcifying organisms may be more severely affected than\nother calcifying organisms by this pH driven equilibrium problem. Ongoing research is taking place to\nidentify which calcifying organisms are more or less severely impacted by decreasing pH.\nUse similar concepts to discuss effects for silicifying organisms. Remember most opal production occurs\nin the southern ocean by diatoms.\nMicrobial energetics\n3. Selenate (SeO4\n2-) is a highly toxic inorganic pollutant that occurs at micromolar concentrations in\nsome agricultural wastewaters.\nCan a microbe remove selenate from the water by reducing it to elemental selenium (Se) by coupling\nthis reduction to the oxidation of acetate?\nAddress by:\nA) writing the balanced half-reaction for the selenate/Se couple\n\nUse Morel and Herring for these problems (pg 432). Here's what's given in M&H:\n\n1⁄2 SeO4\n2- + 2H+ + e- = 1⁄2 H2SeO3 + 1⁄2 H2O\npe°= 19.4\n(1)\n1⁄4 H2SeO3 + H+ + e- = 1⁄4 Se(s) +3/4 H2O\n\npe°= 12.51\n(2)\n\nWrite equations to get rid of H2SeO3 since we need the reduction of selenite to selenium. We\nmultiply the equation 2 describing the reduction of H2SeO3 to Se by 2 and add it to the first\nequation. Don't forget to multiply the corresponding pe° by 2 before adding it to pe° of\nequation 1. Add and simplify to get equation 3 and the corresponding pe°.\n\n1⁄2 SeO4\n2- + 4H+ + 3e- = 1⁄2 Se(s) + 2H2O\n\npe° = 44.4\n(3)\n\nMultiply equation 3 by 1/3 to rewrite it as a single electron transfer.\n\n1/6 SeO4\n2- + 4/3 H+ + e- = 1/6 Se(s) + 2/3 H2O\npe° = 14.8\n(4)\n\nSo pe° of the SeO4\n2-/Se(s) redox couple (always expressed as the reduction reaction) is 14.8.\n\nB) writing the balanced half-reaction for the oxidation of acetate at pH = 8\n\n1⁄4 CO2 + 7/8 H+ + e- = 1/8 acetate- + 1⁄4 H2O\npe° =1.27\n(1) (Again use M&H)\n\nNeed to adjust equation 1 for pH=8 where bicarbonate (HCO3-) is the dominant species, not\nCO2. Use the equations for carbonate equilibria and manipulate them to replace CO2 by HCO3\n-\nas a reactant.\n\nCO2 + H2O= H2CO3\n*\n\nlogK= -1.5\n(2)\nH2CO3\n*= H++HCO3\n-\n\nlogK= -6.3\n(3)\n\nAdd equations 2 and 3 and their corresponding logKs to yield equation 4:\n\nCO2 + H2O = H+ + HCO3\n-\n\nlogK = -7.8\n(4)\n\nDivide by 4 so you can substitute into equation 1.\n\n1⁄4 CO2 + 1⁄4 H2O = 1⁄4 H+ + 1⁄4 HCO3\n-\nlogK = -1.95\n(5)\n\nMultiply by -1 because you need reverse reaction:\n\n1⁄4 H+ + 1⁄4 HCO3\n- = 1⁄4 CO2 + 1⁄4 H2O\nlogK=1.95\n(6)\n\nAdd to equation 1 and simplify. Remember the definition for pe° (pe°= 1/nlogK where n is the\nnumber of electrons which should be 1 since we are writing everything as a single electron\ntransfer. Therefore, pe°= logK for a single electron transfer.)\n\n1⁄4 HCO3\n-+ 9/8 H+ + e- = 1/8 acetate- + 1/2 H2O\npe°= 1.27+1.95= 3.22\n(7)\n\nWrite as reverse and multiply pe° by -1 for an oxidation reaction.\n\nC) writing the balanced redox reaction coupling the reduction of selenate to the oxidation of\nacetate and calculating its energy yield.\n\nFor clarification, energy yield means standard gibbs free energy (ΔG°). Remember, pe° and ΔG°\nare related. See Morel and Herring for equations that relate these two terms. We've written 2\nhalf reactions in parts A and B. They are listed below with the calculated pe°.\n\n1/6 SeO4\n2- + 4/3 H+ + e- = 1/6 Se(s) + 2/3 H2O\npe° = 14.8\n1⁄4 HCO3\n-+ 9/8 H+ + e- = 1/8 acetate- + 1/2 H2O\npe°= 3.22\n\nThe problem asks for \"the reduction of selenate to the oxidation of acetate\", so we need to\nreverse the HCO3\n-/acetate- redox half reaction and multiply the pe° by -1 so it's written as an\noxidation reaction. Next, combine these two reactions for the following net reaction and\nidentify the reductants and oxidants:\n\n1/8 acetate- + 1/6 SeO4\n2- + 5/24 H+ = 1/6 Se(s) + 1/6 H2O + 1⁄4 HCO3\n-\npe°= 14.8-3.22 = 11.58\n\nRed2\nOx1\n\nRed1\n\nOx2\n\nCheck to make sure that your balanced net reaction is both charge and mass balanced. As long\nas it's charge and mass balanced, it is a valid reaction. Remember to be consistent with M&H:\n\nOx1+ Red2= Red1 + Ox2 where ΔG = ΔG° + RT*ln([Red1][Ox2]/[Ox1][Red2]). Here acetate related\nspecies are \"species 2\" and Se species are \"species 1\" according to which species are being\noxidized and which are being reduced. Here we can only calculate ΔG°, not ΔG because we don't\nknow any reaction condition specifics such as concentrations.\n\nΔG° = -2.3*n* RT pe°\n\nAssume we are at standard conditions so T=25°C:\n\nΔG° = -2.3*n* RT pe°= -2.3*1*8.314*298.15*11.58 = -66.02 KJ/mol electrons\n\nD) discussing the effect of pH and the concentration of organics and selenate on the energetics of\nthe reactions in C) per mole of acetate and per mole of selenite\n\nWrite out complete net reaction from part c:\n1/8 acetate- + 1/6 SeO4\n2- + 5/24 H+ = 1/6 Se(s) + 1/6 H2O + 1⁄4 HCO3\n-\npe°= 14.8-3.22 = 11.58\n\nRed2\nOx1\n\nRed1\n\nOx2\n\nYou can write an equilibrium expression for this reaction with the general form of\nK=[Red1][Ox2]/[Ox1][Red2] which clearly affects the energetics of the reaction according to the\nthermodynamic equation ΔG = ΔG° + RT*ln(K). You can substitute as follows where the value for\nG0 is simply the answer from part c:\n\nG = G0 + RTln{[Red1][ Ox2]}/{[Ox1] [Red2]} = -66.02 kJ/mol + RT ln ([HCO3\n-]1/4/([acetate-\n]1/8[selenate]1/6[H+]5/24))\nNote that water and selenium are not included in the K expression because they are liquids and\nsolids, respectively. The coupled equation above shows that the increase in H+ (lower pH) and\nthe concentrations of acetate or selenite will drive G more negative (more favorable for the\nreaction to proceed). More quantitatively, a quick comparison of exponents in the last term\nsuggests that the pH and the concentration of selenite will have the largest influence on G.\nE) discussing whether a microbe could also reduce selenate to selenite [i.e., not all the way to\nSe(s)] coupled with the oxidation of acetate\n\nSelenate/Selenite couple\npe°=19.4\nSelenate/Se couple\n\npe°=14.8\n\nThese values were calculated in part A or given in M&H. The selenate/selenite redox couple has\na pe° that is even higher than the selenate/Se couple, so the reduction of selenate to selenite\ncoupled with the oxidation of acetate would be energetically even more favorable than the\nreduction of selenate to Se. So the answer is yes.\n\nF) Would the microbe gain more or less energy by oxidizing lactate instead of acetate (coupled to\nthe reduction of selenite/Se)?\n\nAs with acetate, we will need to do some adjusting for pH. The table in Morel and Hering gives:\n\n1⁄4 CO2 + 11/12 H+ + e- = 1/12 lactate- + 1⁄4 H20\n\npe°= 0.68\n\nConsidering HCO3\n- as a reactant in the place of CO2 by adding Eqs. 4 and 5 to Eq. 8 gives:\n\n1⁄4 HCO3\n- + 7/6 H+ + e- = 1/12 lactate- + 1⁄2 H2O\n\npe=0.68 + 0.375 + 1.575 = 2.63\n\nThe HCO3-/lactate - couple has a lower potential (2.63) than selenate/Se couple (3.22), so the\nformer couple can donate electrons to the latter. The difference in the electron potentials is\nsomewhat larger than the corresponding difference with acetate as the reductant, but not by\nmuch. Therefore, slightly more E would be gained by using lactate than acetate.\n\nG) Would you expect the reduction of selenate to selenite to Se to be carried out by one microbe\nor multiple microbes? Why? How would you test your hypothesis?\n\nCopmare the energy for selenite to Se calculated in part c to the energy for selenite to selenite\nin part e. The first reduction is energetically more favorable than the reduction of selenite to Se,\nso yes, if there's sufficient selenate around, some microbes may specialize in reducing selenate\nto selenite only. Selenite can be subsequently reduced to Se. You could test this hypothesis by\nenriching and isolating microbes that perform either reaction and comparing these microbes or\nby screening for the expression of genes that are used in one process, but not the other.\n1⁄2 SeO4\n2- + 2H+ + e- = 1⁄2 H2SeO3 + 1⁄2 H2O\n\npe0 = + 19.4\n1⁄4 H2SeO3 + H+ + e- = 1⁄4 Se(s) + 3⁄4 H2O\n\npe0 = + 12.5\nacetate: 1⁄4 CO2(g) + 7/8 H+ + e- = 1/8 CH3COO- + 1⁄4 H2O\n\npe0 = + 1.27\nCO2 + H2O = H2CO3*\n\nlogK = -1.5\nH2CO3* = H+ + HCO3-\n\nlogK = -6.3\nHCO3\n- = H+ + CO3\n2-\n\nlogK= -10.3\nG = n 2.3RT(pe2-pe1)\nG = G0 + RTln{[Red1][ Ox2]}/{[Ox1] [Red2]}\n4. A sulfate-reducing organism oxidizes formate to CO2 while reducing sulfate to\nsulfide.\n\na. Write out the two half-reactions and the balanced complete reaction assuming the\nappropriate species at pH=9.4.\nHint: look up the dissociation constants for hydrogen sulfide, formate, carbonic acid\nand sulfuric acid from the table to determine the appropriate species at a pH of 9.4\n(pKa of formic acid <-> formate is 3.74)\n\nThe half-reaction describing the reduction of sulfate to sulfide (with HS- as the dominant species of S(-II)\nat pH 9.4 is derived by manipulating the half reaction equation from Table 7.1 and the equation\ndescribing the hydrolysis of H2S.\n\n(1) 1/8 SO4\n2- + 5/4 H+ + e- = 1/8 H2S + 1⁄2 H2O\n\npe0 = 5.13\n(2) 1/8 H2S = 1/8 HS- + 1/8 H+\n\nlogK = -7.0 *1/8 = -0.875\n\nThe addition of Eqs. 10 and 11 gives:\n\n(3) 1/8 SO4\n2- + 9/8 H+ + e- = 1/8 HS- + 1⁄2 H2O\n\npe0 = 4.26\n\nTable 7.1 gives:\n\n(4) 1⁄2 CO2 + 1⁄2 H+ + e- = 1⁄2 HCOO-\n\npe0 = -5.22\n\nAgain, we manipulate this to consider HCO3\n- as a reactant in the place of CO2 (although at pH 9.4, the\nratio of bicarbonate to carbonate is smaller than 10, so carbonate concentration becomes non-\nnegligible). We add Eqs. 14 and 15 to Eq. 13:\n\n(5) 1/2 H2CO3 = 1/2 CO2 + 1/2 H2O\n\nlogK = 1.5*1/2= 0.75\n\n(6) 1/2 HCO3\n- + 1/2 H+ = 1/2 H2CO3\n\nlogK = 6.3 * 1⁄2 = 3.15\n\n(7) 1⁄2 HCO3\n- + H+ + e- = 1⁄2 HCOO- + 1⁄2 H2O\n\npe0 = -5.22 + 0.75 + 3.15 = - 1.32\n\nb. Using reduction potentials (Table 7.1 from the Morel and Hering reading),\ncalculate G0 for this metabolism.\n\nThe pe0 of the bicarbonate/formate couple is lower than the pe0 of the sulfate/sulfide couple, so\nformate donates electrons to sulfate. We combine the redox half-reactions (12) and (16) to\ndescribe the coupled oxidation of formate to the reduction of sulfate:\n\n(8) 1/8 SO4\n2- + 1⁄2 HCOO- + 1/8 H+ = 1/8 HS- + 1⁄2 HCO3\n-\npe0= 4.26+1.32 = 5.58\nOx1\nRed2\n\nRed1\nOx2\n\nThis means that bicarbonate/formate is the second redox couple and sulfate/sulfide is the first\none. This gives:\n\nΔG° = -2.3*n* RT pe° = -2.3* 1 * 8.314 * 298.15 * 5.58 J/mol = -31.81 kJ/mol (electrons)\n\nc. Discuss how G would change over the pH range 1-14. State your assumptions\nabout the concentrations of other relevant species.\n\nThe relevant species at different pH will be those predicted by the pKa values. Sulfuric acid has\ntwo very low pKa values (for the hydrolysis to HSO4\n2- and SO4\n2-, respectively), so between pH 1 and 3.74,\nsulfate will be the only dissociated species. Eq. (17) will then become:\n\n(9) 1/8 SO4\n2- + 1⁄2 HCOOH + 1/4 H+ = 1/8 H2S + 1⁄2 H2CO3 so a drop in pH or the increase in the\nconcentration of sulfate and formate will make G more negative (given the exponents, the\nchange in formate concentrations and carbonic acid concentration will have the largest\ninfluence).\n\nAt 3.74 < pH < 6.3, formate will be hydrolyzed as well:\n\n(10) 1/8 SO4\n2- + 1⁄2 HCOO- + 3⁄4 H+ = 1/8 H2S + 1⁄2 H2CO3 so the drop in pH will have a larger\ninfluence on G than the change in the concentrations of formate or carbonic acid.\n\nAt 6.3 < pH < 7, bicarbonate will become the dominant species.\n\n(11) 1/8 SO4\n2- + 1⁄2 HCOO- + 1/4 H+ = 1/8 H2S + 1⁄2 HCO3\n- so changes in the concentrations of\nformate and bicarbonate will have the largest (and opposite) effects on G.\n\nAt 7 < pH < 10.3, HS- and bicarbonate are the dominant species - this situation is described by\nEq. (17). Changes in pH have a very small effect on G in this range because of the smaller\nexponent (1/8).\n\nAt pH > 10.3, carbonate becomes the dominant species:\n\n(12) 1/8 SO4\n2- + 1⁄2 HCOO- = 1/8 HS- + 1⁄2 CO3\n2- + 3/8 H+ so a drop in pH in this range actually makes\nG more positive.\n\nd. Would these organisms be heterotrophic or autotrophic?\n\nHeterotrophic (they take up a small organic acid) and can use this C1 compound in biosynthesis.\n\n5. Read Lavik et al. and answer the following questions:\na. What is annamox? Write the reaction for this metabolism.\nAnnamox is anaerobic oxidation of ammonium by nitrate or nitrite.\n\n(13) NO3\n- + NH4\n+ = N2 + 2H2O\n\nb. Where in the water column would you expect annamox to occur?\n\nIn low oxygen zones where nitrate is available. Particularly in oxygen minimum zones (OMZs)\n\nc. Calculate G (correction ΔG°) for the reaction describing the oxidation of sulfide with nitrate.\n\n(23) 1/5 NO3\n- + 6/5 H+ + e- = 1/10 N2 + 3/5 H2O\npe0 = 21.05 (Table 7.1)\n\nWe need to manipulate equations from Table 7.1 to derive the half-reaction describing the reduction of\nsulfur to sulfide.\n\n(24) 1/6 SO4\n2- + 4/3 H+ + e- = 1/48 S8 + 2/3 H2O\npe0 = 6.03 (Morel and Hering Table 7.1)\n\nSubtracting Eq. 12 multiplied by 4/3 from Eq. 24 to cancel out sulfate (and multiplying everything by -3\nto give a reduction reaction per 1e-) gives:\n\n(25) 1/2 S + 1/2 H+ + e- = 1/2 HS-\n\npe0= -1.05\n\nClearly, the sulfur/sulfide couple has a lower potential than the nitrate/ammonium couple, so sulfide\ncan donate electrons to nitrate. The coupled half-reactions give:\n\n(26) 1/5 NO -\n3 + 7/10 H+ + 1⁄2 HS- = 1/10 N2 + 3/5 H2O + 1⁄2 S\npe0 = 21.05 + 1.05= 22.1\n\nOx1\n\nRed2\nRed1\n\nOx2\n\nG0 = -2.3 n RT (pe0) = 1 * -2.3*8.314 * 298.15 * (22.1) J/mol = -126.0 kJ/mol (electrons) or five\ntimes as negative per mol of nitrate.\n\nd. Write the similar reaction describing the oxidation of sulfide with oxygen and\ncalculate G.\n\n(27) 1⁄4 O2 + 1⁄2 H+ + 1⁄2 HS- = 1⁄2 H2O + 1⁄2 S\npe0 = 21.87\n\nOx1\nRed2 Red1 Ox2\n\nG0 = -2.3*n RT (pe0) = -2.3*1 * 8.314 * 298.15 * (21.87) J/mol = -124.7 kJ/mol (electrons) or\nfour times as negative per mol of O2.\n\ne. How do organisms performing metabolisms described in c. and d. acquire their\ncarbon?\n\nThese organisms are autolithotrophic and fix carbon. Most have Rubisco.\n\nf. Which genes are used as tracers of sulfur oxidation? What do these genes do?\nThe authors first use the 16S rRNA gene sequence to identify potential sulfide oxidizing\norganisms. They posit that comparative 16S rRNA gene analyses reveal some gamma and\nepsilon proteobacteria to be involved in sulfide oxidation with nitrate; such organisms had >95%\ngene identities to the 16S rRNA gene of the sulfide-oxidizing Candidatus Ruthia magnifica. In\naddition, the authors identified the gene sequences encoding alpha subunit of enzymes involved\nin the sulfur reaction (the adenosine 5' phosphosulfate reductase (AprBA) and the sulphate\nreductase (rDsrAB). They conclude that the 16S rRNA, AprBA, and rDsrAB genes can be used\nas potential indicators of sulfur oxidation and posit that GSO bacteria may be capable of sulfide\noxidation. The 16S rRNA gene (in bacteria and archaea) codes for 16S rRNA which provides a\nstructural component, binds to proteins which start protein synthesis, and makes up a portion of\nthe ribosome (the small subunit). The AprBA and rDsrAB genes code for alpha subunits for\nenzymes involved in sulfur oxidation.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/5c38a944005bb69471183418d64d093a_MIT12_007S13_Lec1.pdf",
      "content": "Geobiology 2013\nIntroductions\nRationale\nThe interactive Earth system: biology in geologic,\nenvironmental and climate change throughout Earth history.\n\nSince life began it has continually shaped and re-shaped the\natmosphere, hydrosphere, cryosphere and the solid earth.\n\n'Geobiology' introduces the concept of 'life as a geological\nagent' and examines the interaction between biology and the\nearth system during the roughly 3.5 billion years since life\nfirst appeared.\n\n12.007 GEOBIOLOGY\nSPRING 2013\nInstructors:\nRoger Summons and Tanja Bosak\nGuest Lecturers:\nJulio Sepulveda\n\nLectures:\nMon and Wed 11-12:30\nCourse Description:\nParallel evolution of life and the environment. Life processes are influenced by\nchemical and physical processes in the atmosphere, hydrosphere, cryosphere and the\nsolid earth. In turn, life can influence chemical and physical processes on our planet.\nThis course introduces the concept of life as a geological agent and examines the\ninteraction between biology and the earth system during the roughly 4 billion years\nsince life first appeared.\nGrading:\n25%\nParticipation in class discussions\n15%\nProblem Sets/Assignments\n10%\nWeekly quizzes\n20%\nFinal Blog Piece\n15%\nMidterm Exam\n15%\nFinal Exam\n\nTextbook: The Earth System, Lee R. Kump, James F. Kasting & Robert G.\nCrane. Earth System History, Steven M. Stanley. The following books will also\nbe on reserve in Hayden Library:. Brock Biology of Microorganisms, Madigan,\nMartinko and Parker, F. M. M. Morel and J. Hering, Principles and Applications\nof Aquatic Chemistry\nOther Recommended Reading\nHow to Build a Habitable Planet: The Story of Earth from the Big Bang to\nHumankind (Revised and Expanded Edition)\nCH Langmuir, W Broecker - 2012 - books.google.com\nThe Spark of Life, Christopher Wills & Jeffrey Bada (Perseus, Cambridge, MA,\n2000).\nPlanet Earth: Cosmology, Geology and the Evolution of Life and Environment,\nCesare Emiliani, Cambridge University Press, 1992\nAdditional readings provided for some lectures.\n\nWeek 1\n- Lecture Schedule\n- 1. Wed 2/6 Overview of course; What is life? Can it be defined? Brief history\nof paleontology and geobiology; Life as a geological agent. Sedimentary\nenvironments and processes; Stratigraphy (William Smith); Isostasy; Plate\ntectonics; Water and life; Habitable zone; Radiative balance; Greenhouse\ngases. Faint Young Sun (Summons)\n- Stanley, Chap. 1 & 2 Kump 187-195\n- 2.\nMon 2/11: Time scales of major events in formation of Universe and\nSolar System; Abundance of elements. Geochronology; Introduction to\ngeological processes, rocks and minerals. Planetary accretion and\ndifferentiation. Introduction to the geological timescale and major transitions\nin Earth history (Summons)\n-\nStanley pp. 129-151, 177-197\n-\nproblem set\n\nWeeks 1&2 Assignment\nEssay: What criteria do you think are\nimportant for assessing the habitability of\na planetary body? Illustrate with\nreference to current or past missions in\nour solar system.\nOR:\nEssay: What is meant by the concept of\nGalactic Habitable Zone. Illustrate with\nreference to a current mission that looks\noutside our solar system.\n4 pages incl. figures; due Feb 20th\n\nt\nNASA\n\nCourtesy NASA\n\nMaking a Habitable Planet\n- The right kind of star and a rocky planet\n- A benign cosmological environment\n- Matter, temperature where liquid water\nstable, energy\n- And many more see:\nLangmuir, Charles Herbert, and Wallace\nSmith Broecker. How to build a habitable\nplanet. Princeton University Press, 2012.\n\nWhat is life?\nLife, from wikipedia\n\n\"Life is a characteristic that distinguishes objects that have signaling\nand self-sustaining processes from those that do not,[1][2] either\nbecause such functions have ceased (death), or else because they lack\nsuch functions and are classified as inanimate.\"[3][4]\n\nCommittee on the Limits of Organic Life in Planetary Systems. The\nLimits of Organic Life in Planetary Systems. National Academies Press,\n2007.\n\"Dedicated to Non-Human-Like Life Forms, Wherever They Are.\"\n\nRhythm of Life\nGuinness \"Rhythm of Life R Evolution\nhttp://www.youtube.com/watch?vS9OjkEOdZj3A\n\nCosmic Time Scales\nCourtesy of Eric Fisk. Used with permission.\n12-15\nb.y.\n4.6 b.y.\n2.1 b.y.\n3.5 b.y.\n65 m.y.\nAvg. human life span=0.15 s\n21 s\n\nEarth's Geologic Clock\nOriginal illustration removed due\nto copyright restriction.\nDes Marais, David J. TWhen did\nphotosynthesis emerge on\nEarth?.T Science (Washington)\nImage by Woudloper.\n289, no. 5485 (2000): 1703\n1705.\n\nThe standard\ncosmological\nmodel of the\nformation of\nthe universe:\n\"The Big Bang\"\nNew NASA Speak: The\ntheory of The Big Bang\n-From: The First Three\nMinutes, by Steven\nWeinberg\nTime T(K) E Density\nWhat's Happening?\n(c) Rod Nave. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nEvidence\nfor the Big\nBang #1: An\nExpanding\nUniverse\n-The galaxies we see in all directions are moving away from the\nEarth, as evidenced by their red shifts (Hubble).\n-The fact that we see all stars moving away from us does not imply\nthat we are the center of the universe!\n-All stars will see all other stars moving away from them in an\nexpanding universe.\n-A rising loaf of raisin bread is a good visual model: each raisin\nwill see all other raisins moving away from it as the loaf expands.\n(c) Rod Nave. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nEvidence for\nthe Big Bang\n#2: The 3K\nCosmic\nMicrowave\nBackground\n-Uniform background radiation in the microwave region of the spectrum is\nobserved in all directions in the sky.\n-Has the wavelength dependence of a Blackbody radiator at ~3K.\n-Considered to be the remnant of the radiation emitted at the time the\nexpanding universe became transparent (to radiation) at ~3000 K. (Above\nthat T matter exists as a plasma (ionized atoms) & is opaque to most\nradiation.)\n\nScience Magazine: Breakthrough of the\nYear 2003\n- Wilkinson Microwave Anisotropy Probe\n(WMAP) produced data to indicate the\nabundances and sizes of hot and cold\nspots in the CMB.\n- Universe is very strange\n- Universe not just expanding but\nCourtesy NASA\naccelerating\n- Universe is 4% ordinary matter, 23%\n'exotic matter S dark matter' and 73%\ndark energy\n- Age is 13.7㼼 .2 b.y. and expanding\n- It's flat\n\nEvidence for the Big Bang #3: H-He\nAbundance\n-Hydrogen (73%) and He (25%) account for nearly all the nuclear matter in the universe,\nwith all other elements constituting < 2%.\n-High % of He argues strongly for the big bang model, since other models gave very low %.\n-Since no known process significantly changes this H/He ratio, it is taken to be the ratio\nwhich existed at the time when the deuteron became stable in the expansion of the universe.\nA figure depicting the quan\ntity of protons and neutro\nns in the universe through\ntime, from the big bang to\npresent.\nImage by MIT OpenCourseWare.\n\nNucleosynthesis\nSource: wikimedia user Cepheus. Image in the public domain.\n\nNucleosynthesis I: Fusion Reactions in Stars\nFusion\nProcess\nReaction\nIgnition T\n(106 K)\nHydrogen\nBurning\nH-->He,Li,Be,B\n50-100\nHelium Burning\nHe-->C,O\n200-300\nCarbon Burning\nC->O,Ne,Na,Mg\n800-1000\nNeon, Oxygen\nBurning\nNe,O-->Mg-S\nSilicon Burning\nSi-->Fe\nProduced in\nearly universe\n3He=C, 4He=O\nFe is the end of the\nline for E-producing\nfusion reactions...\n\nHydrogen to Iron\n-Elements above iron in the periodic table cannot be formed in the\nnormal nuclear fusion processes in stars.\n-Up to iron, fusion yields energy and thus can proceed.\n-But since the \"iron group\" is at the peak of the binding energy\ncurve, fusion of elements above iron dramatically absorbs energy.\nBi\nn\nd\ni\nn\ng e nergy peaks\na t iron; fus ion\nof heavier eleme n t\ns\n\nr\ne\nqu\nir es\nene\nrg\ny, i\nns tead of prod ucing\nener gy.\nImage by MIT OpenCourseWare.\n\nNuclear Binding Energy\n-Nuclei are made up of protons and neutrons, but the mass of a\nnucleus is always less than the sum of the individual masses of\nthe protons and neutrons which constitute it.\n-The difference is a measure of the nuclear binding energy\nwhich holds the nucleus together.\n-This energy is released during fusion.\n-BE can be calculated from the relationship: BE = mc2\n-For a particle, m= 0.0304 u, yielding BE=28.3 MeV\n**The mass of nuclei heavier than Fe is greater than the mass\nof the nuclei merged to form it.**\n\nFigure of prot\nons, neutrons\n, and alpha p\narticles.\nImage by MIT OpenCourseWare.\n\nElements Heavier than Iron\n-To produce elements heavier than Fe, enormous amounts of\nenergy are needed which is thought to derive solely from the\ncataclysmic explosions of supernovae.\n-In the supernova explosion, a large flux of energetic neutrons is\nproduced and nuclei bombarded by these neutrons build up mass\none unit at a time (neutron capture) producing heavy nuclei.\n-The layers containing the heavy elements can then be blown off\nbe the explosion to provide the raw material of heavy elements in\ndistant hydrogen clouds where new stars form.\nCourtesy NASA\n\nNeutron\nCapture &\nRadioactive\nDecay\n-Neutron capture in\nsupernova\nexplosions produces\nsome unstable\nnuclei.\n-These nuclei\nradioactively decay\nuntil a stable isotope\nis reached.\nA diagram depicting nucleosynthesi\ns by neutron capture.\nImage by MIT OpenCourseWare.\n\nCosmic Abundance\nof the Elements\n-H (73%) & He (25%) account for\n98% of all nuclear matter in the\nuniverse.\n-Low abundances of Li, Be, B due\nto high combustibility in stars.\n-High abundance of nuclei w/ mass\ndivisible by 4He:\nC,O,Ne,Mg,Si,S,Ar,Ca\n-High Fe abundance due to max\nbinding energy.\n-Even heavy nuclides favored over\nodd due to lower \"neutron-capture\ncross-section\" (smaller target =\nhigher abundance).\n-All nuclei with >209 particles\n(209Bi) are radioactive.\nTwo gr aph s; the\nenergy\nper nu\ncleon for el e ments wi th incr\neas ing numb ers of pr ot ons\n, and th e relativ e ab\nundance of di fferent e lem ent\ns. The heav ie r an ele ment is, t\nhe rarer i t is.\n\nImage by MIT OpenCourseWare.\n\nBasics of Geology\n\nMantle and Crust\nLithosphere/Asthenosphere\nOuter 660 km divided into two layers based on mechanical properties\nLithosphere\nRigid outer layer including crust and upper mantle\nAverages 100 km thick; thicker under continents\nAsthenosphere\nWeak, ductile layer under lithosphere\nLower boundary about 660 km (entirely within mantle)\nThe Core\nOuter Core\n~2300 km thick\nLiquid Fe with Ni, S, O, and/or Si\nMagnetic field is evidence of flow\nDensity ~ 11 g/cm3\nInner Core\n~1200 km thick\nSolid Fe with Ni, S, O, and/or Si\nDensity ~13.5 g/cm3\nEarth's Interior: How do we know its\nstructure?\nAvg density of Earth (5.5 g/cm3)\nDenser than crust & mantle\nComposition of meteorites\nSeismic wave velocities\nLaboratory experiments\nChemical stability\nEarth's magnetic field\nLithosphere & Asthenosphere\n\nEarth's Surface\nPrinciple Features of Earth's Surface\nContinent\nShield--Nucleus of continent composed of Precambrian rocks\nContinent-Ocean Transition\nContinental shelf--extension of continent\nContinental slope--transition to ocean basin\nOcean basin--underlain by ocean crust\nWhy do oceans overlie basaltic crust?\nMid-ocean ridge\nMountain belt encircling globe\nEx: Mid-Atlantic Ridge, East Pacific Rise\nDeep-ocean trenches\nElongate trough\nEx: Peru-Chile trench\n\nEarth's Crustal Evolution: 2\n3㼻Crust = Formed from slow, continuous distillation by volcanism on a\ngeologically active planet (I.e., plate tectonics).\n-Results in highly differentiated magma distinct from basalt--the low-\ndensity, light-colored granite.\n-Earth may be the only planet where this type of crust exists.\n-Unlike 1㼻 & 2㼻 crusts, which form in < 200 M.y., 3㼻 crusts evolve\nover billions of years.\nA figure of crustal growth th\nrough geologic ti\nme.\nImage by MIT OpenCourseWare. After Taylor, S. Ross, and Scott M. McLennan.\n\"The Evolution of Continental Crust.\" Scientific American 274 (1996): 76-81.\n\nIgneous Rocks\nBasalt\n(2㼻 Crust;\nOceanic\ncrust)\nGranite\n(1㼻 Crust;\nContinental\nCrust)\nPhotograph of basalt courtesy United States Geological Survey\nPhotograph of rhyolite courtesy James St. John.\nPhotograph of gabbro courtesy Mark A. Wilson.\nPhotograph of granite courtesy James Bowe.\n\nThe Crust\nOcean Crust\n3-15 km thick\nBasaltic rock\nYoung (<180 Ma)\nDensity ~ 3.0 g/cm3\nContinental Crust\n35 km average thickness\nGranitic rock\nOld (up to 3.8 Ga)\nDensity ~ 2.7 g/cm3\nCrust \"floating\" on \"weak\" mantle\nThe Crust\n& Mantle\nThe Mantle\n~2900 km thick\nComprises >82% of Earth's volume\nMg-Fe silicates (rock)\nTwo main subdivisions:\nUpper mantle (upper 660 km)\nLower mantle (660 to ~2900 km; \"Mesosphere\")\n\nStructure of\nEarth\nFigure courtesy United States Geologic Society.\nImage\n\nof\na\nc\nro\nss\n\ns\nection of\nth\ne\nEa\nrt\nh'\ns\ncr\nus\nt.\nImage by MIT OpenCourseWare. After Stanley, Steven M. Earth system history. W.H. Freeman and Company, 2005.\n\nWhy is Continental Crust \"Elevated\nRelative to Oceanic Crust?\n-High-density Basalt sinks into mantle\nmore than low-density Granite.\n-Volcanism continually produces highly\ndifferentiated continental crust on Earth.\n-Venus surface appears to be all basalt.\n-Plate tectonics & volcanism do not\nappear to be happening on Venus (or\nMars, Moon).\n-So Earth may be unique in Solar\nSystem. And plate tectonics &\nvolcanism likely critical in determining\nhabitability.\nTaylor & McLennan Sci. Am. (1996)\nFigure of crust elevation co\nmparing Venus, Earth's ocean\nbasins, and\nEarth's co\nntine\nnts.\nImage by MIT OpenCourseWare. After Taylor, S. Ross,\nand Scott M. McLennan. \"The evolution of continental\ncrust.\" Scientific American 274 (1996): 76-81.\n\nCourtesy US Geological Survey\nLithospheric Plates\n-8 large plates (+ add'l. small ones)\n-Average speed: 5 cm/yr\n-3 types of motion result in 3 types of boundaries: sliding toward (subduction\nzones), sliding away (ridge axes), skiding along (transform faults)\n\nConvection Drives Plate Movements\nCourtesy NASA\n\nTectonic Activity in the South Atlantic\n37Image of tectonic activity in South Atlantic.\nImage by MIT OpenCourseWare.\nImage of tec\ntonic activity\nin South Atlantic.\n\nRock\nBasics\nIgneous + metamorphic\n= Crystalline Rocks\nSchematic image\nof the r\nock cyc\nle, with s\nediment\nary,\nigneous\n, and metamorphi\nc rocks.\nImage by MIT OpenCourseWare.\n\nThe Rock Cycle\nSchemat\nic figur\ne of a vo\nlcano a\nnd i\nts role i\nn the rock\ncycl\ne.\nImage by MIT OpenCourseWare.\n\nIgneous\nRocks\n-Felsic: Si-,Al-rich. Light-colored, low-density. Feldspar (pink) &\nquartz (SiO2)-rich. Most continental crust. Granite most abundant.\n-Mafic: Mg-, Fe-rich. Dark -colored, high-density. Most oceanic\ncrust. Ultramafic rock (more dense) forms mantle below crust.\n-Extrusive: cools rapidly; small crystals\n-Intrusive: cools slowly; large crystals\nGranite\n(1㼻 Crust;\nContinental Crust)\nBasalt\n(2㼻\n㼻 Crust;\nOceanic\ncrust)\nPhotograph of basalt courtesy United States Geological Survey. Photograph of gabbro courtesy Mark A. Wilson.\nPhotograph of rhyolite courtesy James St. John. Photograph of granite courtesy James Bowe.\n\n-\nSlab of lithosphere is subducted, melted &\nincorporated into asthenosphere\n-\nConvection carries molten material upward where\nit emerges along a spreading zone as new\nlithosphere.\nPlate Tectonics\n& the Rock\nCycle\n-Subducted sediment melts at a shallower depth where it contributes to magma\nemitted from an island arc volcano and a mountain chain volcano\n-Erosion of volcanic rock provides sediment to complete cycle\nFigure courtesy Jose F. Virgil, United States Geological Survey.\n\nSedimentary\nRocks\nRepresent\nHomogenous\nMixture of\nContinental\nCrust\n(c) Scientific American. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nGeologic Time\nA major difference between\ngeologists and most other scientists\nis their attitude about time.\nA \"long\" time may not be important\nunless it is > 1 million years.\n\nBowring, S. A., and D. Condon. TSequencing the Neoproterozoic:\nthe importance of high-precision geochronology.T In Snowball\nSource: www.SnowballEarth.org\nEarth 200 Conference, July, pp. 1 -21. 200 .\n\nAbsolute Calibration: Geochronology\n- Add numbers to the stratigraphic\ncolumn based on fossils.\n- Based on the regular radioactive\ndecay of some chemical\nelements.\n\nRadioactive\nDecay of\nRubidium to\nStrontium\nA figure de\npicting r\nadioactive\ndecay of r\nubidium to\nstrontium.\nImage by MIT OpenCourseWare.\n\nParent Atoms\nRemaining as a Function of Time\nProportion of\nGraph showing h ow rad\nioactive decay causes an\nex\npone\nntia\nl d\necre\nase i\nn\nth\ne\nnu\nmber of parent atoms over time.\nImage by MIT OpenCourseWare.\n\nIsotopic dating\n- Radioactive elements (parents) decay to\nnonradioactive (stable) elements\n(daughters).\n- The rate at which this decay occurs is\nconstant and knowable.\n- Therefore, if we know the rate of decay\nand the amount present of parent and\ndaughter, we can calculate how long this\nreaction has been proceeding.\n\nC\nhart of\nsome p\nropertie\ns of urani\num-238, po\ntassium\n-40, rubid\nium-87,\nand carbon-1\n4 as dating tools.\nMajor Radioactive Elements Used\nin Isotopic Dating\nImage by MIT OpenCourseWare.\n\nParent\nDaughter\nHalf-life (years)\nGeologically Useful Decay Schemes\n235U\n207Pb\n0.71 x 10\n238U\n206Pb\n4.5 x 109\n40K\n40Ar\n1.25 x 109\n87Rb\n87Sr\n47 x 109\n14N\n14C\n\nFrom dendrochronology to\ngeochronology\n- Tree rings can be dated\nwith 14C to calibrate them\n- For rocks and older\nmaterial, we need other\nmethods: e.g.\nuranium/lead\nPhotograph courtesy of Henri D. Grissino-Mayer.\nUsed with permission.\n- Radiocarbon can only be\nused to date organic\nmaterial (plant or animal)\nyounger than ~ 60,000 yrs\n\nTwo ways to date geologic\nevents\n1) relative dating (fossils,structure)\n2) absolute dating (isotopic, tree\nrings, etc.)\n\nAmount of Time\nRequired for\nSome Geologic\nProcesses and\nEvents\nGraph showin\ng how radio\nactiv\ne d\necay causes\nan ex\npon\nential decrea\nse in\nth\ne n\numbe\nr of\npare\nnt at\noms over\ntime.\nImage by MIT OpenCourseWare.\n\nSome geologic processes can be\ndocumented using historical records\nThe present pattern of erosion\nis shown on the map on the\nright. Red shows shoreline\nundergoing wave erosion;\ngreen shows shoreline\nundergoing deposition.\nAbout ,000 years ago, before extensive wave\nerosion of the glacial deposits had occurred, glacial\nCape Cod probably resembled the green area as\nshown on the left map.\nMaps courtesy U.S. Geological Survey.\n\nAmmonite Fossils\nPetrified Wood\nPhotographs courtesy Smabs Sputzer and Candie N\n\nSteno's Laws\nNicolaus Steno (1669)\n- Principle of Superposition\n- Principle of Original Horizontality\n- Principle of Lateral Continuity\nLaws apply to both sedimentary & volcanic rocks.\n\nPrinciple of Superposition\nIn a sequence of undisturbed layered\nrocks, the oldest rocks are on the\nbottom.\n\nPrinciple of Superposition\nOldest rocks\nYoungest rocks\nPhotograph courtesy Mark A. Wilson\n\nPrinciple of Original Horizontality\nLayered strata are deposited\nhorizontal or nearly horizontal or\nnearly parallel to the Earth's surface.\n\nPrinciples of original\nhorizontality and superposition\nA cross section o\nf a lake, d\nepictin\ng the law of superposition and original horizontality.\nImage by MIT OpenCourseWare.\n\nPrinciple of Lateral Continuity\nLayered rocks are deposited in\ncontinuous contact.\n\nUsing Fossils to Correlate Rocks\nImage of\nt\nwo\nla\nyers\nr\nock outcr\nops with fossils.\nImage by MIT OpenCourseWare.\n\nWilliam (Strata) Smith\n- The Principle of Faunal\nSuccession, first geological\nmap ever ( UK)\n\nPortrait of William Smith by Hugues Fourau\n\nDisconformity and\nUnconformity\nA buried surface of erosion\n\nFormation of a Disconformity Illustrations of four scenarios that lead to deformation.\nImage by MIT OpenCourseWare.\n\nRocks Exposed in the Grand Canyon\nPhotography courtesy Grand Canyon National Park.\n\nGeneralized\nStratigraphic\nSection of Rocks\nExposed in the\nGrand Canyon\nFigure courtesy National Park Service.\n\nSome of the Geologic Units\nExposed in the Grand Canyon\nPhotograph of the Grand Canyon removed due to copyright restriction.\nAnnotated photograph of the Grand Canyon\nwith labeled rock formations.\n\nSouth Rim of the Grand Canyon\n250 million years old\n50 million years old\n1.7 billion years old\nPrecambrian\nPhotography courtesy Grand Canyon National Park.\n\nSouth rim of the Grand Canyon\nThe nonconformity of the Grand Canyon is\noutlined.\nPhotograph of the Grand Canyon removed due to copyright restriction.\n\nThe Great Unconformity of the Grand Canyon\nPhotograph courtesy Chris M. Morris\n\nAngular Unconformity at Siccar Point\nPhotograph courtesy Lysippos.\n\nSedimentation of Beds A-D\nBeneath the Sea Illustration of sedimentation beds beneath the sea.\nImage by MIT OpenCourseWare\n\nImage of mountain building dep\nicting the deformation of layers of rock.\nImage by MIT OpenCourseWare.\n\nLa\n\n-- James Hutton\nhttp://en.wikipedia.org/wiki/James_Hutton\nHis theories of geology and geologic time, also called\ndeep time came to be included in theories which\nwere called plutonism and uniformitarianism.\nHe is also credited as the first scientist to publicly\nexpress the Earth was alive and should be\nconsidered a superorganism.\nHutton reasoned that there must have been innumerable cycles, each involving\ndeposition on the seabed, uplift with tilting and erosion then undersea again for further\nlayers to be deposited. On the belief that this was due to the same geological forces\noperating in the past as the very slow geological forces seen operating at the present\nday, the thicknesses of exposed rock layers implied to him enormous stretches of time\nUniformitarianism\n\nMany methods have been used to\ndetermine the age of the Earth\n1) Bible: In 1664, Archbishop Usher of\nDublin used chronology of the Book of\nGenesis to calculate that the world began\non Oct. 26, 4004 B.C.\n2) Salt in the Ocean: ( ca. 1899) Assuming\nthe oceans began as fresh water, the rate\nat which rivers are transporting salts to the\noceans would lead to present salinity in\n~100 m.y.\n\nMany methods have been used to\ndetermine the age of the Earth\n3) Sediment Thickness: Assuming the rate of\ndeposition is the same today as in the past,\nthe thickest sedimentary sequences (e.g.,\nGrand Canyon) would have been deposited in\n~ 100 m.y.\n4) Kelvin's Calculation: (1870): Lord Kelvin\ncalculated that the present geothermal\ngradient of ~30㼻C/km would result in an\ninitially molten earth cooled for 30 - 100 m.y.\n\nOldest rocks on Earth\nSlave Province, Northern Canada\n- Zircons in a metamorphosed granite dated\nat 4.03 Ga by the U-Pb method\nYilgarn block, Western Australia\n- Detrital zircons in a sandstone dated at 4.4\nGa by U-Pb method.\nSeveral other regions dated at 3.8 Ga by\nvarious methods including Minnesota,\nWyoming, Greenland, South Africa, and\nAntarctica.\n\nThe geologic timescale\nand absolute ages\nIsotopic dating of intebedded\nvolcanic rocks allows assignment\nof an absolute age for fossil\ntransitions\n\nThe big assumption\nThe half-lives of radioactive\nisotopes are the same as they\nwere billions of years ago.\n\nTest of the assumption\nMeteorites and Moon rocks (that are\nthought to have had a very simple\nhistory since they formed), have been\ndated by up to 10 independent isotopic\nsystems all of which have given the\nsame answer. However, scientists\ncontinue to critically evaluate this data.\n\nparent\ndaughter\nhalf life (years)\n\nFrequently used decay schemes\nhave half-lives which vary by\na factor of > 100\n238U\n20 Pb\n4.5 x 109\n0.71 x 109\n235U\n207Pb\n40K\n40Ar\n1.25 x 109\n87Rb\n87Sr\n47 x 109\n147Sm\n144Nd\n10 x 109\n\nMinerals with no initial daughter\n- 40K decays to 40Ar (a gas)\n- Zircon: ZrSiO4\nion\nradius (A)\nZr4+\n0.92\nU\n4+\n1.08\nPb2+\n1.37\n\nWorld's Oldest Rock: Acasta Gneiss\nPhotograph courtesy Ellenm1.\n\nAcasta Zircon (Ages in My)\nPhotograph of Acasta Zircon removed due to\ncopyright restriction.\n-300 Im zircon crystal, SAB94-134, Grain 1,\nwith ages of 403 , 4029, 384 , 2998, 4014,\n3971, 4028, 3984 (ages in millions of years).\n\nFigure of North American craton removed due\nto copyright restriction.\nSee Figure 1 in Hoffman, Paul. \"United plates\nof America, the birth of a craton: Early\nProterozoic Assembly and Growth of\nLaurentia.\" Annual Reviews of Earth and\nPlanetary Sciences 1 , 1998.\n\nImage courtesy R. Clucas.\n\nZircons: Nature's Time Capsules\nMicroscope photograph of\nzircons removed due to\ncopyright restrictions.\n\nThe Geologic time scale\n\nFigure courtesy Geological Society of America. Used with permission.\n\nThe Eras of the Phanerozoic\n(c) 2005. Reprinted by permission from\nMacmillan Publishers Ltd: Nature.\nAlso see: Phillips, John.\nSource: Rohde, Robert A., and Richard\nLife on the earth: its\nA. Muller. \"Cycles in Fossil Diversity.\"\nNature 434, no. 7030 (2005): 208-10.\norigin and succession.\n18 0.\n\nG\nra\nph\nmap\ns d\nept\nh i\nn s\nedi\nment\n\nlay\ners\nto\nth\ne g\neol\nogica\nl era during whic\nh each laye\nr f\norm\ned.\nD\neep\ner\nlay\ners\nco\nrre\nspo\nnd\nto\nol\nde\nr\ner\na\ns\n.\nImage by MIT OpenCourseWare.\nPhotograph in the public domain.\n\nFigure courtesy Sam Bowring.\n\nFossil\n\nPaleontology\nThe study of life in the past based on\nfossilized plants and animals.\n: Evidence of past life\nFossils preserved in sedimentary rocks are\nused to determine:\n1) Relative age\n2) Environment of deposition\n\nTrilobites (Cambrian)\n\nPhotograph courtesy Kevin Walsh.\n\nFossil Fern (Pennsylvanian)\n\nPhotograph courtesy Black Country Museums.\n\nFossil Sycamore-like Leaf (Eocene)\nPhotograph courtesy Daderot.\n\n- Tree rings can be counted and dated with\n14C to calibrate them\n-\nFor rocks and older material, we need other\nmethods: e.g. uranium/lead\nPhotograph courtesy of Henri D. Grissino-Mayer.\nUsed with permission.\nIsotopic Dating\n- Radioactive elements (parents) decay to\nnonradioactive (stable) elements\nThe rate at which this decay occurs is\nconstant and knowable.\nTherefore, if we know the rate of decay\nand the amount present of parent and\ndaughter, we can calculate how long this\nreaction has been proceeding.\n-\nRadiocarbon can only be used to date\norganic material (plant or animal) younger\nthan ~ 60,000 yrs\nGraph showing h ow rad\nioactive decay causes an\nex\npone\nntia\nl d\necre\nase i\nn\nth\ne\nnu\nmb\ner of parent a\ntoms over tim\ne.\n(daughters).\n-\n-\n\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/a4e219261d627e9316bc459ce1602641_MIT12_007S13_Lec2.pdf",
      "content": "Description\nParallel evolution of life and the environment. Life processes are\ninfluenced by chemical and physical processes in the atmosphere,\nhydrosphere, cryosphere and the solid earth. In turn, life can influence\nchemical and physical processes on our planet. This course introduces\nthe concept of life as a geological agent and examines the interaction\nbetween biology and the earth system during the roughly 4 billion years\nsince life first appeared.\n\nGrading:\n25%\nParticipation in class discussions\n15%\nProblem Sets/Assignments\n10%\nWeekly quizzes\n20%\nFinal Blog Piece\n15%\nMidterm Exam\n15%\nFinal Exam\n\n12.007 Geobiology 2013\n\n12.007 Geobiology 2013\nLecture Schedule\n\n1. Wed 2/6 Overview of course; What is life? Can it be defined? Habitability and the HZ; Alternate forms of\nlife? Abundance of elements. That arsenic paper!!. Geochronology; Time scales of major events in formation\nof Universe and Solar System; Life as a geological agent. (Summons)\nStanley, Chap. 1 & 2 Kump 187-195\n\n2. Mon 2/11: Planetary accretion and differentiation. Sedimentary environments and processes; Stratigraphy;\nPlate tectonics; Isostasy; Radiative balance; Greenhouse gases. Faint Young Sun. Brief history of\npaleontology and geobiology; (Summons)\n\nStanley pp. 129-151, 177-197\n\n3. Wed 2/13: Prebiotic chemistry, Nucleic acids, Amino Acids and Chirality, Origins of life, Panspermia; Luca\nand the three domains; Universal tree of life (Summons)\n\nKump 381-396, Stanley 103-127\n\nWhat is Life Quiz\n\nWoese paper for Wed 2/23\n\nThe Solar System\nand Earth Accretion\n& Differentiation\n\nFormation of the Solar System\n\n- Sites and images Maria Zuber Website\n12.004 Introduction to Planetary Science\nhttp://web.mit.edu/12.004/www/sites.html\n\nText: Earth System History Steven M. Stanley, 1998\nOther Readings:\n5 papers in Scientific American Oct 1994 Volume 271 from the big\nbang to pollution Weinberg, Peebles, Kirschner, Allegre and Orgel\nDelsemme, 1996, The origin of the atmosphere and of the oceans in Comets\nand the Origin and Evolution of Life (Eds Thomas, P.J., Chyba, C.F.,\nMcKay, C.P.)\nChyba and Sagan, 1996, Comets as a source of Prebiotic Organic\nMolecules for the Early Earth in Comets and the Origin and Evolution of\nLife (Eds Thomas, P.J., Chyba, C.F., McKay, C.P.)\n\nOrigin of\nSolar\nSystem:\nNebular\nHypothesis\n-\nRotating dust cloud (nebulae)\n\nRotation causes flattening\nGravity causes contraction\nRotation increases\nMaterial accumulates in center--protosun\nCompression increases T to 106 °C--fusion begins\nGreat explosion\n-\nOrigin of planets\nGases condense\nGravity causes them to coalesce into planetesimals\nPlanetesimals coalesce & contract into planets\n-\nThe planets\nTerrestrial or inner planets\nMercury, Venus, Earth, Mars\nloss of volatiles (H, He, H2O) by solar wind\nmade of rock (O,Mg,Si,Fe)\nJovian planets (4 of the 5 outer planets)\nJupiter, Saturn, Neptune, Uranus\nmostly volatiles (H, He)\nPluto\nanomalous--rock w/ frozen H2O &CH4\n\nOrigin of Planetary\nSystem from Solar\nNebula\n- Slowly rotating cloud of\ngas & dust\n- Gravitational contraction\n- High P=High T (PV=nRT)\n- Rotation rate increases\n(conserve angular\nmomentum)\n- Rings of material\ncondense to form\nplanetesimals, then\nplanets (Accretion) Illustration of the formation process of a planetary system.\nImage by MIT OpenCourseWare.\n\nThe Solar System\n\"Failed Planet\"\nAnomalous Planet\nCourtesy of Flickr user Image Editor\n\nAsteroid 243 IDA\n-Cratering indicates early origin\n-Chemical composition of meteorites collected on Earth\nindicate undifferentiated primordial material.\nCourtesy NASA\n\nAccretion of the Earth\nEarth mostly accreted from rocky\nmaterial in a large, viscous disc of dust\naround a young star (Laplace, 1796 &\nnow supported by Hubble\nobservations)\n\nEarth accreted from planetesimals in the\nzone 0.8 to 1.3 au around the young\nsun where the temperature gradient\n(1500K to 900K) determined the\nchemical composition of condensing\nmaterial and the ultimate composition\nof the bulk of the planet.\n\nThis NASA Hubble Space Telescope image shows a small portion of one of the largest\nobservable star-forming regions in the Galaxy, the Carina Nebula, located 7500 light-years away\nin the southern constellation Carina. It captures the chaotic activity atop a three-light-year-tall\npillar of gas and dust that is being eaten away by the UV light from nearby massive stars.. The\nimage celebrates the 20th anniversary of Hubble's launch and deployment into an orbit around\nEarth. Image courtesy NASA, ESA, and M. Livio and the Hubble 20th Anniversary Team(STScI)\n\nAccretion of the Earth 2\n\nCoagulation of grains to 1m -1km sized objects x103\nyrs; larger 'embryos' during 'runaway growth 104-106\nyrs formed objects lunar to martian mass\n\nSimulations predict an accretion time of roughly 50\nmillion years for an Earth analogue to reach >90% of\nits final mass (review by Halliday et al. 2000)\n\nAccretion of the Earth 3\n- Chrondrites provide much of the evidence for planetary\nformation - 'planets that never formed'. Chondrites =\nprimitive objects, stony meteorites from the asteroid belt\nwith elemental abundance ratios = those of the sun. Very\nheterogeneous rocks formed by accretion of grains\n(chondrules) with a variety of origins. Roughly ten times\ntoo much D/H to have delivered Earth's water otherwise\nhave solar elemental abundances\n\nElements Magazine July 2011\nFigure 4 from Dante S. Lauretta. \"Cosmochemistry: A\nCosmochemical View of the Solar System.\" Elements\n7, 2011, no. 1 (2011): 11-6. Used with permission.\nHeader image from Dante S. Lauretta. \"Cosmochemistry: A Cosmochemical\nView of the Solar System.\" Elements 7, no. 1 (2011): 11-6.\nUsed with permission.\n\n-\nStep 1: accretion of cm sized particles\n-\nStep 2: Physical Collision on km scale\n-\nStep 3: Gravitational accretion on 10-100 km scale\n-\nStep 4: Molten protoplanet from the heat of accretion\nFormation of the Earth by Accretion\nCourtesy of Greg Bothun. Used with permission.\n\nAccretion 4\nAsteroids orbit roughly 2-4 Au ( between Mars and Jupiter) around the Sun\nbut delivered slowly to the inner solar system. Different families\nidentified by their spectral characteristics and the variable nature of\nmeteorites. Some are undifferentiated - too small/cold to gravitationally\nseparate into a core and mantle\nElements Magazine July 2011\nFigure 2 from Edward R. D. Scott. \"Cosmochemistry: Meteorites: An\nOverview.\" Elements 7, no. 1 (2011): 47-8. Used with permission.\n\nAccretion of the Earth: 5\n\nChrondrites provide much of the evidence for origins of nebula components and\nfor planetary formation - 'planets that never formed'.\n\nMany chondrites have roughly ten times too much D/H (the deuterium excess)\nto have delivered Earth's water otherwise have solar elemental abundances\n\nPresence of 'extinct isotopes' eg Al26 now present as Mg26. Half-life of Al26 is\nlow and all would be dissipated in 2 million years. Therefore Al26 must have\nbeen trapped in the solar nebula very early after it was formed in a\nsupernova.\n\nElements Magazine July 2011\nTable 1 from Kleine, Thorsten, and John F. Rudge. \"Cosmochemistry: Chronometry\nof Meteorites and the Formation of the Earth and Moon.\" Elements 7, no. 1 (2011):\n41-6. Used with permission.\n\nAccretion of the Earth: 6\n\nCarbonaceous chondrites\ncontain the most volatile\nelements and typically\nabout 6% organic carbon.\nDelivered significant\namounts of organic matter\nto the early Earth\n\nComets are nomadic bodies of\nice, rock and organic and\ninorganic volatile\ncompounds left over from\nthe formation of our solar\nsystem. Comets come\nfrom the Kuiper belt located\nbeyond Neptune, and from\nthe Oort Cloud >200Au,\nwhich marks the outside\nedge of the solar system.\nMain belt comets are a\nrecent discovery.\n\nElements Magazine July 2011\n\nTable 1 from Zita Martins. \"Cosmochemistry: Organic Chemistry of\nCarbonaceous Meteorites.\" Elements 7, no. 1 (2011): 35-40. Used\nwith permission.\n\nFormation of the Earth by Accretion\n\n-Tremendous heat generated in the final accretion process\nresulted in initially molten objects.\n-Any molten object of size greater than about 500 km has\nsufficient gravity to cause gravitational separation of light\nand heavy elements thus producing a differentiated body.\n-The accretion process is inefficient, there is lots of left\nover debris.\n-In the inner part of the solar system, leftover rocky debris\ncratered the surfaces of the newly formed planets (Heavy\nBombardment, 4.6-3.8 Ga).\n-In the outer part of the solar system, the same 4 step\nprocess of accretion occurred but it was accretion of ices\n(cometisemals) instead of grains.\nhttp://zebu.uoregon.edu/disted/ph121/l7.html\n\nMoon-Forming Impact\nCanup R & AspaugE:Eos Trans. AGU, 82(47), Fall Meet. Suppl., Abstract U51A-02, 2001\nhttp://www.swri.edu/9what/releases/canupmoon.htm\nHypothesis for lunar origin - Moon forms from debris ejected as a result of\nthe collision of a roughly Mars-sized impactor with early Earth\n\nGeophysical simulations use a method known as smooth particle\nhydrodynamics, or SPH and can achieve resolutions sufficient to study\nthe production of orbit-bound debris necessary to yield the Moon\n\nOff-center, low-velocity collisions yield material in bound orbit from\nwhich a satellite may then accumulate.\n\nSimulations must account for mass, angular momentum and\ncompositions of the earth-Moon system.\n\nMust yield an Earth that retains an iron-rich core and a moon that is\nappropriately iron-depleted and the right density.\nSPH results suggest:\n\nThe object had 10-12% of Earth's mass\n\nProduces a satellite with <3% Fe by mass. Out of reach & unable to\n\nbe captured subsequently\n\nHappened when Earth near its current ie final mass & near the very\n\nend of the accretion history\n\nFormation of the Moon\nmodel of Robin Canup SWRI\nhttp://www.youtube.com/watch?v=2sr-MriOCzw\nhttp://www.boulder.swri.edu/~robin/moonimpact/canup20\n12/Canup_MoonImpact.mov\nImage removed due to copyright restriction.\nSource: Figure 2D in Canup, Robin M. \"Simulations of\na late lunar-forming impact.\" Icarus 168, no. 2 (2004):\n433-456.\n\nChicxulub Crater, Gulf of Mexico\n-200 km crater\n-10-km impactor\n-65 Myr BP\n-Extinction of 75% of all species!\nAccretion continues...\nMeteor (Barringer) Crater, Arizona\n-1 km diam. Crater\n-40-m diam Fe-meteorite\n-50 kyr BP\n-300,000 Mton\n-15 km/s\nCourtesy NASA\nCourtesy NASA/LPI\n\nDifferentiation of the Earth:1\nVM Goldschmidt 1922 published landmark paper 'Differentiation\nof the Earth'\n'Father of Geochemistry' because of the realization that Earth\nhas a chondritic (meteoritic) elemental composition. Surface\nrocks are not chemically representative of solar abundances\ntherefore must be differentiated\nProto-planet differentiated early into an iron-rich core\nsurrounded by a metal sulfide-rich shell and a silicate-rich\nmagma ocean\nCooling of the magma caused segregation of dense silicate\nminerals - pyroxenes and olivines. Less dense minerals\nfeldspars and quartz floated to surface to form crust.\nLess abundant elements segregate according to affinities for Fe\n= siderophile, sulfide = chalcophile and silicate = lithophile\n\nDifferentiation of Earth\nKleine, Thorsten, and John F. Rudge. \"Chronometry of Meteorites\nand the Formation of the Earth and Moon.\" Elements 7, no. 1\n(2011): 41-6.\nCourtesy of Mineralogical Society of America.\nUsed with permission.\n\nDifferentiation of the Earth:2\n\n22An image depicting the interior structure of the earth.\nImage by MIT OpenCourseWare.\n\nDifferentiation of the Earth:3\nProof of the differentiated planet comes from\nSlightly -flattened shape of the Earth\nSeismology - reflection and refraction of sound\nwaves by materials of different densities and\nelasticities.\n\nContinuous partial melting of mantle and the rising of\nless-dense components in 'plumes' , and the sinking\nor more dense ones drives tectonic cycles.\n\nTectonism essential for the continuity of life\n\nDifferentiation of Earth,\nContinents, Ocean &\nAtmosphere\n-Differentiation of Earth\nHomogenous planetesimal\nEarth heats up\nAccretion and compression (T~1000°C)\nRadioactive decay (T~2000°C)\nIron melts--migrates to center\nFrictional heating as iron migrates\nLight materials float--crust\nIntermediate materials remain--mantle\n\n-Differentiation of Continents, Oceans, and Atmosphere\nContinental crust forms from differentiation of primal crust\nOceans and atmosphere\nTwo hypotheses\ninternal: degassing of Earth's interior (volcanic gases)\nexternal: comet impacts add H2O CO2, and other gases\nEarly atmosphere rich in H2, H2O, N2, CO2; deficient in O2\nDifferentiation\nof Earth,\nContinents,\nOcean &\nAtmosphere\n\nTimescale in myr\nTimeline of early earth history, fro\nm formation of the sun's accretionary di\nsk to the formation of stable c\nontinents and end of intense bombardm\nent of earth.\nEarly Earth History\nImage by MIT OpenCourseWare.\n\nOrigin of Earth's Volatile Components Atmosphere,\nOceans & Carbon\n-Arrived with the planetesimals, partly survived the\naccretion process and outgassed during volcanic activity\n(Hogbom 1894, Rubey 1951-5). Volcanic gases vary in\ncomposition; not primordial and may have been recycled many times. No\nrecord of the time and conclusive answers about this scenario (Turekian, 1972;\nDelsemme, 1997).\n-Arrived with comets during the late bombardment - late\nveneer hypothesis (Delsemme, 1997)\n-Arrived with one or more hydrated planetesimals from\nthe outer asteroid belt (Morbidelli, 2001)\n-Arrived with comets and mixed with accreted water\n\nArrived with comets and mixed with accreted water\nU51A-05 Origin of Earth's Volatiles: The Case for a\nCometary Contribution : Owen, T C\nD/H show comets could not have delivered all the Earth's water.\n\n84Kr/132Xe and the isotopic composition of Xe show that\nchondrites did not deliver the atmospheric noble gases.\nThe Martian atmosphere reveals krypton and xenon relative\nabundances and isotope ratios remarkably similar to Earth's,\nAn external source seems necessary to satisfy both martian and\nterrestrial data with the D/H result pointing toward comets.\n\nThis requires that Earth formed with its own water, to mix with\nthe cometary component. The ratios of 15N/14N on Mars and\nEarth (in the atmosphere and rocks) are also consistent with\ncometary delivery of nitrogen in the form of N-compounds.\n\nComposition of Comet Halley Volatiles (modeled)\n78.5 % H2O\n2.6% N2\n1.5% C2H4\n0.1% H2S\n4.0% H2CO\n0.8% NH3\n0.5% CH4\n0.05% S2\n\n4.5% HCO-OH\n1.0% HCN\n0.2% C3H2\n0.05% CS2\n1.5% CO\n0.8% N2H4\n0.4% C4H4N2\n92% with O\n5.6% with N\n2.6% H/C\n0.2% S\nLaunched on 2 July 1985 by Ariane 1, Giotto was ESA's\nfirst deep-space mission, part of an ambitious international\neffort to solve the mysteries surrounding Comet Halley.\nPhoto: ESA\n\nEarly Composition of the Atmosphere\nFigure by MIT OpenCourseWare. After figure on page 74 of Allegre, Claude J.,and Stephen H.\nSchneider. \"The Evolution of the Earth.\" Scientific American 271 (1994): 66-75.\nBillions o\nf years\nago\n,\nth\ne\na\ntmo\ns\np\nh\ne\nre contained more water,\ncarbon dioxide, methane, a\nnd ammonia, and almost no o\nxygen.\n\nWhy the big deal with water?\nhttp://www.esa.int/Our_Activities/\nSpace_Science/Rosetta\nAt the end of February 2004, the European Space Agency (ESA) probe\nset off on its journey to meet Comet Churyumov-Gerasimenko.\n\nThe long-planned get-together will not however take place until the\nmiddle of 2014.\n\nA few months after arriving at the comet, Rosetta will release a small\nlander onto its surface. Then, for almost two years it will investigate\nChuryumov-Gerasimenko from close up.\n\nWhy the big deal with water?\nhttp//www.esa.int/rosetta\nThe comet explorer carries ten scientific instruments to draw out the secrets of the\ncomet's chemical and physical composition and reveal its magnetic and electrical\nproperties. The lander will take pictures in the macro and micro ranges and send\nall the data thus acquired back to Earth, via Rosetta.\n\"This will be our first ever chance to be there, at first hand, so to speak, as a comet\ncomes to life,\"\nWhen Churyumov-Gerasimenko gets to within about 500 million kilometres of the\nSun, the frozen gases that envelop it will evaporate and a trail of dust will be blown\nback over hundreds of thousands of kilometres. When illuminated by the Sun, this\ncharacteristic comet tail then becomes visible from Earth. In the course of the\nmission, the processes at work within the cometary nucleus will be studied and\nmeasured more precisely than has ever before been possible, for earlier probes\nsimply flew past their targets.\n\nCharacteristics of the Habitable Zone:\nknown requirements of life?\n- Liquid water\n\n-Sources of carbon and energy\n-CO2, organic matter\n-energy from chemistry of rocks + water\n-energy from the sun\n-Mechanisms of renewal and recycling\n-Nutrients limited\n-Space = habitat limited\n-Mechanism = Tectonism.\n\nWater Elsewhere in the Solar\nSystem Ice - Rafts on Europa\nCourtesy NASA/JPL/University of Arizona\n\nWater Elsewhere in Solar System\nCO2 + Water Ice on Mars\nhttp://photojournal.jpl.nasa.gov/\nCourtesy NASA\n\nWater Elsewhere in Solar System\nFlat topography of Mars Northern Hemisphere\nhttp://photojournal.jpl.nasa.gov/\nCourtesy NASA/JPL/ESA\n\nWater Elsewhere in Solar System\nEvidence of recent water flow on Mars\nhttp://www.msss.com/mars_images/moc/june2000/age/index.html\nCourtesy NASA/JPL/Malin Space Science Systems\n\nCuriosity's Science Objectives\nCourtesy NASA/JPL-Caltech\nCuriosity's primary scientific goal is to explore and\nquantitatively assess a local region on Mars' surface as a\npotential habitat for life, past or present\n- Biological potential\n- Geology and geochemistry\n- Role of water\n- Surface radiation\nCourtesy NASA/JPL-Caltech\n\nTarget: Gale Crater and Mount Sharp\nNASA/JPL-Caltech/ESA/DLR/FU\nBerlin/MSSS\nNASA/JPL-Caltech\nCourtesy NASA/JPL-Caltech\nCourtesy NASA/JPL-Caltech/ESA/DLR/FU Berlin/MSSS\nImage of \"Key science targets at Gale crater\"\nremoved due to copyright restrictions.\nSee Figure 6 in this paper:\nGrotzinger, John P., Joy Crisp, Ashwin R.\nVasavada, Robert C. Anderson, Charles J.\nBaker, Robert Barry, David F. Blake et al.\n\"Mars Science Laboratory mission and\nscience investigation.\" Space science\nreviews 170, no. 1-4 (2012): 5-56.\n\n150-km Gale Crater contains a 5-km high mound of stratified rock. Strata in the lower\nsection of the mound vary in mineralogy and texture, suggesting that they may have\nrecorded environmental changes over time. Curiosity will investigate this record for clues\nabout habitability, and the ability of Mars to preserve evidence about habitability or life.\nTarget: Gale Crater and Mount Sharp\n?\nCourtesy NASA/JPL-Caltech\nCourtesy NASA/JPL-Caltech/MSSS\n\nMastcam-34 mosaic of Mount Sharp, descent\nrocket scours, and rover shadow\nCourtesy NASA/JPL-Caltech/MSSS\nCourtesy NASA/JPL-Caltech\n\nBedrock exposed by the landing engines in\nthe scour mark named Goulburn\nCourtesy NASA/JPL-Caltech/MSSS\nCourtesy NASA/JPL-Caltech\n\nThe Goulburn scour revealed the first look at\nunderlying bedrock\nCourtesy NASA/JPL-Caltech/MSSS\nCourtesy NASA/JPL-Caltech\n\nThe conglomerate \"Link\" with associated\nloose, rounded pebbles\nCourtesy NASA/JPL-Caltech/MSSS\n\nCopernicus 1473-1543\nHypothesised Earth circularly orbited Sun\nc. 1543 slow to publish. German printer took\nliberty of adding unwlecome preface. Saw it on\nhis deathbed\n\nTycho Brahe 1546-1601\nObserved planet positions. Hired Kepler but\nwas mean with the data and died before the\nresults c. 1600\n\nJohannes Kepler 1571-1630 Analysed\nTycho's data and developed Kelper's laws and\neliptical orbits c. 1610\n\nGalileo Galilei 1546-1642\nBuilt good telescopes, confirmed Kepler c.\n1610 and wore the wrath of Rome c. 1623\n\nIsaac Newton 1642-1727\nPrincipia 1687\n\nPortrait of Galileo Galilei by Justus Sustermans\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/c267d13bd76328bf59cf586c109aaaad_MIT12_007S13_Lec3.pdf",
      "content": "Geobiology Lecture 3\n\nThe story so far:\n\nOur solar system formed from a disc of dust and gas about 4.6 billion years ago.\n\nSome of the components, especially elements larger than iron incl. radionuclides, were\nformed in earlier massive star systems (Supernovae) that exploded and spewed debris\ninto the interstellar medium.\n\nDense, less volatile materials (metals, silicate minerals) accumulated closer to the sun\nand accreted in violent collisions to form molten (rocky) planets. More volatile\nsubstances (eg ices) accumulated at the outer edges\n\nThe inner planets, and especially the Earth, cooled and differentiated early. We now\nrecognise this in the separation of core, mantle and crust. Earth's oversized moon\nformed as a result of a late impact with a Mars-sized planet\n\nVolatile materials not lost during the accretion process, combined with some material\nfrom comets and other impactors, to form an early hydrosphere and atmosphere\n\nEarth cooled more slowly than other inner planets (eg Mars) and is tectonically active\ndue to interior heat generation by radioactivity. This activity has contributed to retention\nof the atmosphere and hydrosphere.\n\nGeobiology 2011 Lecture 3\n\nTheories pertaining to the Origin of Life\n\nJohn Valley: Elements Magazine Vol 2 #4\nEarly Earth\n\nValley, John W. \"Early Earth.\"\nElements 2, no. 4 (2006): 201-204.\nLife Magazine cover from December 8, 1952\nremoved due to copyright restrictions.\n\nTimescales 1: The Hadean\nTimeline for the first billion years of Earth history. Key events are shown along with oxygen isotope ratios (d18O)\nof zircons from igneous rocks and their U-Pb age. Primitive rocks in equilibrium with the Earth's mantle have\naverage d18O of 5.3% (Valley et al. 2005). Higher \"supracrustal\" values (6.5 to 7.5) result from processes that\nrequire liquid water on the surface of the Earth. Thus, the end of the Hadean was at or before 4.2 Ga.\nValley, John W. \"Early Earth.\" Elements 2, no. 4 (2006): 201-204.\n\nMap showing known (dark orange) and suspected (light orange) areas of rocks older\nthan 2.5 billion years. Areas with >3.6 Ga rocks or zircons are labeled by name.\nCourtesy of Mineralogical Society of America. Used with permission.\nSource: Valley, John W. \"Early Earth.\" Elements 2, no. 4 (2006): 201-4.\n\nCourtesy of Mineralogical Society of America. Used with permission.\nSource: Valley, John W. \"Early Earth.\" Elements 2, no. 4 (2006): 201-4.\n\nCourtesy of Mineralogical Society of America. Used with permission.\nSource: Valley, John W. \"Early Earth.\" Elements 2, no. 4 (2006): 201-4.\n\nhttp://fallmeeting.agu.org\nAbstract #U51A-10 The Hadean Atmosphere Zahnle, K\nIt is more useful to define the Hadean Eon as the time when impacts\nruled the Earth than to define it as the time before the rock record. For\ndecades now it has been obvious that the coincidence between the\ntiming of the end of the lunar late bombardment and the appearance of\na rock record on Earth is probably not just a coincidence. I doubt I am\npointing out something that the reader hasn't long ago given thought\nto. While the Moon was struck by tens of basin-forming impactors\n(100 km objects making 1000 km craters), the Earth was struck by\nhundreds of similar objects, and by tens of objects much larger still.\nThe largest would have been big enough to evaporate the oceans, and\nthe ejecta massive enough to envelope the Earth in 100 m of rock rain.\nSmaller impacts were also more frequent. On average, a Chicxulub\nfell every 105 years. When one imagines the Hadean one imagines it\nwith craters and volcanos: crater oceans and crater lakes, a scene of\nmountain rings and island arcs and red lava falling into a steaming sea\nunder an ash-laden sky.\nZahnle, K. \"The Hadean Atmosphere.\" In AGU Fall Meeting Abstracts, vol. 1, p. 10. 2001.\n\nhttp://www.agu.org/cgi-bin/SFgate\nU51A-10 The Hadean Atmosphere Zahnle, K\nI don't know about the volcanos, but the picture of abundant impact\ncraters makes good sense --the big ones, at least, which feature several\nkilometers of relief, are not likely to have eroded away on timescales\nof less than ten million years, and so there were always several of\nthese to be seen at any time in various states of decay. The oceans\nwould have been filled with typically hundreds of meters of\nweathered ejecta, most of which was ultimately subducted but taking\nwith them whatever they reacted with at the time --CO2 was especially\nvulnerable to this sort of scouring. The climate, under a faint sun and\nwith little CO2to warm it, may have been in the median extremely\ncold, barring the intervention of biogenic greenhouse gases (such as\nmethane), with on occasion the cold broken by brief (10s to 1000s of\nyears) episodes of extreme heat and steam following the larger\nimpacts. In sum, the age of impacts seems sufficiently unlike the more\nfamiliar Archaean that came after that it seems useful to give this time\nits own name, a name we already have, and that, if applied to the\nHadean that I have described, actually has some geological value.\n\nhttp://www.agu.org/cgi-bin/SFgate\nU51A-01 Habitability of Terrestrial Planets in the\nEarly Solar System SLEEP, N H\nThe Protoearth, Mars, Venus, and the Moon-forming impactor were\npotentially habitable in the early solar system. The interiors of larger\nasteroids had habitable circulating water. To see when the inner\nsolar system became continuously habitable, one needs to consider the\nmost dangerous events and the safest refugia from them. Early\ngeochemical and accretionary processes set the subsequent silicate\nplanet reservoirs and hence hydrospheric and atmospheric masses.\nThe moon-forming impact made the Moon and the Earth sterile\nbodies. Following the impact, the Earth passed through a rock-vapor\natmosphere on the scale of 1000s of years and an internally heated\nsteam greenhouse on the scale of 2 m.y. Minerals bearing the principle\nvolatiles (water, Cl, and CO2) were stable at the Earth's surface by the\ntime it cooled to 800K. The mass of reactable shallow material was\ninsufficient to contain the available water and CO2.\nHabitable conditions were established after CO2 could be deeply\nsubducted into the mantle.Vast quantities of H2 were vented during\naccretion and after the moon-forming impact and eventually lost to\nspace.\nSLEEP, NH. \"Habitability of Terrestrial Planets in the Early Solar System.\" In AGU Fall Meeting Abstracts, vol. 1, p. 01. 2001.\n\nU51A-01 Habitability of Terrestrial Planets in the\nEarly Solar System SLEEP, N H\nIt is unknown whether significant amounts of this gas were present when the\nEarth's surface cooled into the habitable range. The moon remained\nsterile because its interior is essentially devoid of water. The mantle of\nthe Earth, in contrast, cannot hold the available water, leaving the excess to\nform oceans. Nitrogen may behave similarly with the excess going into the\nair. Impacts of large asteroids (and comets) were an ever-present danger on\notherwise habitable planets. The safest niche on planets was a kilometer\nor deeper crustal rocks habitable by thermophiles. It is inevitable that\nseveral objects, which would have left only thermophile survivors, struck\nthe Earth. Such events were so infrequent that the conditions of such a\nbottleneck should not be confused with conditions for the origin of life. An\nalternative refugium involves ejection of life within rock fragments and\nreturn of such fragments to the surface of the home planet or transfer to\nanother habitable planet. Mars and the larger asteroids were habitable\nfirst and provide likely sources of seed and also testable places to look for\npreserved evidence. Extant terrestrial life appears to have passed\nthrough thermophile bottlenecks. There are subtle hints of space\ntransfer. The need of extant life for Ni may be vestige of life on a young\nplanet covered with ultramafic rocks.\n\nOrigin and Early Evolution of Life\n- The lost record of the origin of Life? Few crustal\nrocks from >3 Ga and half life of sediments 100-\n200Ma so most destroyed\nA figure of crustal growth th\nrough geologic ti\nme.\nImage by MIT OpenCourseWare. After Taylor, S. Ross, and Scott M. McLennan.\n\"The Evolution of Continental Crust.\" Scientific American 274 (1996): 76-81.\n\nExtreme Panspermia?\nAn email once received\n-\nDr. Roger Summons\nCommittee on The Origins and Evolution of Life\nNational Academy of Sciences\n\nDear Dr. Summons:\n\nIndividual solar systems safeguarded from supernova by vigilant intelligent life,\nand those (in the absence of intelligent life) destined for supernova, are\ninterrelated in the infinite continuum of life: the former an achievement of\ncompassionate reciprocity, the latter vital to life processes through eventual\nproduction of chemical elements essential to life.\n\nParticularly persuasive in the search for extraterrestrial intelligence (SETI), planets\nsecured again! st supernova are a signature of intelligent life - as beneficiaries of\nsteady-state energy supplied by host stars.\n\nCompassionate reciprocity - setting the standard for life-centered cosmologies -\ncomplements the strong version of panspermia (Cosmic Ancestry).\nwww.geocities.com/CosmicGenealogy/\n\nTwo Points of View\n-\n\"Astrobiology has emerged as a new science for the new\nmillennium. It seeks to understand life in the context of the wider\ncosmos. The new Centre will continue in the pioneering traditions of\nastrobiology started in Cardiff over 25 years ago, taking note of the\nmany relevant discoveries that have been made in recent years. The\nCentre aims to combine the expertise of astronomers, biochemists\nand microbiologists to generate cutting edge science that would\neventually enable us to answer the age-old question: where did we\ncome from?\" (Professor Chandra Wickramasinghe, director,\nCardiff Centre for Astrobiology, and author of A Journey With\nFred Hoyle - The Search for Cosmic Life, World Scientific, 2005).\n\n-\n\"We can soon launch panspermia missions to seed other habitable\nsolar systems. We can target nearby stars and star-forming zones in\ninterstellar clouds. Each mission can seed dozens of new solar\nsystems where local life has not formed.\" (Dr. Michael N. Mautner,\nSociety for Life in Space (SOLIS).\n\nTheories of the origin of life\n\"We still have little idea how, when or where life\nbegan.... The evidence is circumstantial and can\nbe compared with delving into such records as\nthere are in Massachusetts of the Mayflower, to\ndiscern the origins of the English language.\"\n\nNisbet, E. G., and N. H. Sleep. \"The habitat and nature of early life.\"\nNature 409, no. 6823 (2001): 1083-1091.\n\nA hyperthermophilic\nOrigin?\nThe rRNA phylogenetic tree has\nhyperthermophilic organisms\nclustered near the base of the\nArchaeal and Bacterial domains\nDNA, proteins,\nrRNA, phylogeny &\nmetabolism all\nconsistent with a\nuniversal common\nancestor or LUCA\nAll known life on Earth descended from a\ncommon ancestor\nFigure courtesy NASA Astrobiology Institute.\n\nTHE SHRUB OF LIFE\nProposed by W. Ford Doolittle, this view of early evolution suggests multiple primitive\ncells as ancestors to the three domains, and illustrates lateral gene transfer among early\norganisms.\nDoolittle, W. Ford. \"Uprooting the tree\nof life.\" Scientific American 282, no. 2\n(2000): 90.\n(c) Annenberg Learner. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nAll known life on Earth descended from a common ancestor\nFigures courtesy Arapacana and NIH.\n\nOrigin-of-Life: Evolving concepts #1\n->2,000 yrs ago: The Bible states God created humans & higher\norganisms.\n-< mid 1800's: Creationism + insects, frogs & other small\ncreatures arise spontaneously from mud & rot.\n-mid 1800's: (1) Pasteur demonstrated bacteria & other\nmicroorganisms arise from parents resembling themselves.\nSpontaneous generation is dead. (2) Darwin proposes natural\nselection, the theory that environmental pressure results in the\nperpetuation of certain adaptations. Evolution of complex\norganisms therefore possible, & all current life forms could have\nevolved from a single (last) common ancestor.\n-Darwin (privately) suggested life could have arisen from\nchemistry: \"in some warm little pond, with all sorts of ammonia\nand phosphoric salts, light, heat, electricity, etc., present.\"\nAdapted from Orgel, Leslie E. \"The origin of life on the\nearth.\" Scientific American 271, no. 4 (1994): 77-83.\n\n-1953: Miller-Urey experiment (U. chicago) demonstrates that\namino acids could be formed with atmospheric gases +\nlightning.\n-Late 1960s: Woese (U. Illinois), Crick (England), Orgel (Salk\nInst, San Diego) concurrently proposed RNA may have\npreceded proteins & catalyzed all reactions for survival &\nreplication of 'last common ancestor'. The 'RNA World'\nhypothesis born.\n-1977: Hydrothermal vents on the seafloor discovered teaming\nwith diverse life. Evidence for the possibility life may not have\nevolved at the surface.\n-1983: Thomas Cech (U. Colorado) & Sidney Altman (Yale)\nindependently discovered ribozymes, enzymes made of RNA.\nHeritability & reproducibility possible with a single molecule.\nOrigin-of-Life: Evolving concepts #2\n\n-1988: Gunter Wachtershauser (German patent lawyer!)\ntheorizes that Fe & Ni sulfide minerals at hydrothermal vent\nsystems provided the template & catalyst for formation of\nbiological molecules.\n-1996: Everett Shock hypothesizes that chemical disequilibria\nexisting where seawater reacts with hot rocks are conducive to\norganic synthesis from CO2 or H2CO3.\n-1997: Jay Brandes (Carnegie Inst.) demonstrates that N2 is\nconverted to NH3 in the presence of H2 & magnetite (Fe3O4), at\nT & P typical of hydrothermal vents. Mineral surfaces & HT vent\nenvironments can produce biologically-useful form of N.\n-2000: George Cody et al. demonstrate synthesis of pyruvate\nusing mineral catalysis under hydrothermal conditions. Pyruvate\nis branch point for many extant biosynthetic pathways.\n-2003: McCollom demonstrates organosynthesis from FeCO3 at\n300°C\nOrigin-of-Life: Evolving concepts #3\n\nWhat is Life?\nPassage removed due to copyright restrictions.\nSee the insert titled \"What Is Life?\" in this article:\n\nSagan, Carl. \"The Search for Extraterrestrial Life.\"\nScientific American 271, no. 4 (1994): 92-99.\n\nWhat is Life?\n\"Life can be recognized by its deeds -- life is\ndisequilibrium, leaving behind the signatures of\ndisequilibrium such as fractionated isotopes or complex\nmolecules. It is more besides, but the larger question 'what\nis life?' is perhaps beyond natural science. Continuum\nexists between chemistry, autocatalysis and what every\none would agree is life. But defining the point at which\nautocatalysis becomes life is like searching for the world's\nsmallest giant.\"\n\nNisbet, E. G., and N. H. Sleep. \"The\nhabitat and nature of early life.\" Nature\n409, no. 6823 (2001): 1083-1091.\n\n- Life is based on carbon chemistry operating\nin an aqueous environment\n- carbon is the only element that is sufficiently abundant,\nubiquitous and chemically suited for life\n\n- It will process chemicals for carbon and energy,\nmake copies of itself, be autonomous and evolve\nin concert with its environment\n\n- Biochemical pathways will operate as above\n- comprise energy yielding and replication reactions\n- construct complex molecules from simple, universal\nprecursors\n- evolve\nWhat is Life?\n\nComposition of Earth's Early Atmosphere\nBillions o\nf years\nago\n,\nth\ne\na\ntmo\ns\np\nh\ne\nre contained more water,\ncarbon dioxide, methane, a\nnd ammonia, and almost no o\nxygen.\nFigure by MIT OpenCourseWare. After figure on page 74 of Allegre, Claude J., and Stephen H. Schneider. \"The evolution of the Earth.\"\nScientific American 271 (1994): 44-51.\n\nFormation of the Building Blocks for\nBiomolecules Miller-Urey Expt Illustration of the experimental set up and a chart of the results, compared against the amino acid composition of the Murchison meteorite, for the Miller-Urey experiment.\nImage by MIT OpenCourseWare. After table on page 79 in Orgel, Leslie E.\n\"The origin of life on the earth.\" Scientific American 271, no. 4 (1994): 77-83.\n26Illustration of the experimental set up and a chart of the results, compared against the amino acid composition of the Murchison meteorite, for the Miller-Urey experiment.\n\nThe Building Blocks for Biomolecules: The\nMiller-Urey Experiment (c.)\nOrgel (1994) Sci. Am., Oct. 1994, 77-83.\nFigure and text removed due to copyright\nrestrictions. See \"The Original Origin-of-\nLife Experiment\" insert on page 78 of\nOrgel, Leslie E. \"The origin of life on the\nearth.\" Scientific American 271, no. 4\n(1994): 77-83.\n\nProblems with a\nMiller-Urey-type\norigin for\nbiomolecules\n-Hadean atmosphere now\nthought to have been much\nless reducing than in\nMiller-Urey atmosphere\n(predominance of CO2\nrelative to CH4 and NH3)\n-50-50 mixture of right- &\nleft-handed molecules is\nsynthesized; natural\nmolecules are 100% left-\nor right-handed...\nFigures depicting atmos\npheric composition.\nImage by MIT OpenCourseWare.\n\nFrom Wikipedia:\nHomochirality is a term used to refer to a group of\nmolecules that possess the same sense of chirality.\nMolecules involved are not necessarily the same compound,\nbut similar groups are arranged in the same way around a\ncentral atom. In biology homochirality is found inside living\norganisms. Active forms of amino acids are all of the L-form\nand most biologically relevant sugars are of the D-form.\nTypically, the alternative form is inactive and sometimes even\ntoxic to living things. The origin of this phenomenon is not\nclearly understood. Homochirality is said to evolve in three\ndistinct steps: mirror-symmetry breaking creates a minute\nenantiomeric imbalance and is key to homochirality, chiral\namplification is a process of enantiomeric enrichment and\nchiral transmission allows the transfer of chirality of one set\nof molecules to another.\nHomochirality\n\nChirality of Biomolecules\n-All amino acids in proteins from living organisms are \"left-handed\" (L-\nenantiomers), while sugars are \"right-handed\". (Chirality was yet another\ndiscovery by Louis Pasteur ~150 yr BP!)\n-The Miller-Urey experiment, and all similar organic synthetic experiments,\nproduce a 50-50 (racemic) mixture of biomolecules.\nAmino acids\nhave an L-\nconfiguration\nRight (D)\nLeft (L)\nSugars (not\nshown) have a\nD-configuration\nFigure courtesy of NASA.\n\nHow did homochirality arise?\n-\nIt may have occurred in the solar nebula during the\nformation of the solar system.\n-\nAmino acids with a slight L-enantiomeric excess is\nobserved in the many meteorites incl Murchison\n-\n(Although beware of contamination, since all Earthly aa's\nbegin with L configuration. But note: during natural\ndecomposition processes, protein aa's revert to a 50-50\n(racemic) mixture over time.)\n-\nCrystal faces have surface structures that are mirror-\nimages. Experiments show that crystal faces can select\nL or D amino acids quite efficiently (40% excess) (Hazen,\n2001). While this mechanism can explain the\npropagation of the L or D configuration, it cannot explain\nthe origin of that preference.\n\nChiral Amino\nAcids in the\nMurchison\nMeteorite\n-Murchison fragment (Martin Horejsi)\n-Carbonaceous chondrite\n-Struck 9/28/69, near Murchison, Victoria,\nAustralia.\n-Non-protein aa's analyzed to\navoid contamination (previous L-\nexcesses were shown to be the\nresult of terrestrial contamination)\nPhotograph courtesy U.S. Department of Energy.\nTable 2 and Figure 4\nremoved due to copyright\nrestrictions.\n\nCronin, John R., and\nSandra Pizzarello.\n\"Enantiomeric excesses in\nmeteoritic amino acids.\"\nScience 275, no. 5302\n(1997): 951-955.\n\nCronin, John R., and Sandra Pizzarello.\n\"Enantiomeric excesses in meteoritic amino\nacids.\" Science 275, no. 5302 (1997): 951-955.\n(c) American Association for the Advancement of Science. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nStructure of 2-amino-2,3-dimethylpentanoic acid (2-a-2,3-dmpa). This amino\nacid has two chiral centers and, consequently, four stereoisomers: the D and\nL forms of a -methylisoleucine and a-methylalloisoleucine\nCSID:10652963, http://www.chemspider.com/Chemical-Structure.10652963.html (accessed 15:53, Aug 27, 2013) 34\n\nFig. 3. (A) Total-ion chromatogram of 2-a-2,3-dmpa stereoisomers from the Murchison\nmeteorite run as N-PFP isopropyl esters on Chirasil-L-Val.\nFigure 3 A removed due to copyright\nrestrictions.\n\nCronin, John R., and Sandra Pizzarello.\n\"Enantiomeric excesses in meteoritic amino\nacids.\" Science 275, no. 5302 (1997): 951-955.\n\nEngel, Michael H., and S. A. Macko. \"Isotopic Evidence for Extraterrestrial Non-Racemic\nAmino Acids in the Murchison Meteorite.\" Nature 389, no. 6648 (1997): 265-8.\nCourtesy of Nature Publishing Group. Used with permission.\n\nEngel, Michael H., and S. A. Macko. \"Isotopic Evidence for Extraterrestrial Non-Racemic Amino Acids in the Murchison Meteorite.\"\nNature 389, no. 6648 (1997): 265-8. Courtesy of Nature Publishing Group. Used with permission.\n\nEngel, Michael H., and S. A. Macko. \"Isotopic Evidence for Extraterrestrial Non-Racemic Amino Acids in the Murchison Meteorite.\"\nNature 389, no. 6648 (1997): 265-8. Courtesy of Nature Publishing Group. Used with permission.\n\nAn\nextraterrestrial\norigin for\nhomochirality?\nhttp://www.phys.unsw.edu.au/~jbailey/chirality.html\n-In the model 1st proposed by Rubenstein et al. (1983) (Nature, Vol.\n306:118) the action of circular polarized light on interstellar chiral\nmolecules introduced a left handed excess into molecules in the material\nfrom which the solar system formed. Some of this organic material then\nfinds its way onto Earth via impacts of comets, meteorites and dust\nparticles during the heavy bombardment phase in the first few hundred\nmillion years of the solar system. These molecules were then part of the\nprebiotic material available for the origin of life, and tipped the scales for\nlife to develop with L-amino acids and D-sugars.\n-Rubenstein et al. originally proposed that synchrotron radiation from\nneutron stars in supernova remnants would be a suitable source of the\nrequired UV circularly polarized light. However, this interpretation is not\nsupported by theory or observation which show that the circular\npolarization of these sources is very low.\n-New observations with the Anglo-Australian Telescope (above) have\nshown surprisingly high circular polarizations (the red and white regions\nin the image) in the infrared light from reflection nebulae in the star\nforming regions Orion OMC1 (a region in the Orion nebula M42) and\nNGC 6334. Although we can only observe these regions at infrared\nwavelengths which can penetrate the thick dust clouds in which they are\nembedded, it is predicted that circular polarization should also be present\nat the ultraviolet wavelengths needed for asymmetric photolysis of\nmolecules such as amino acids. If our own solar system formed in such a\nregion of high circular polarization, it could have led to the excess of L-\namino acids which we see in meteorites and to the homochirality of\nbiological molecules. It is possible that without such a process operating it\nwould not be possible for life to start. This may have implications for the\nfrequency of occurrence of life in the universe.\nFigure of polarization in\nOrion OMC1 has been\nremoved due to\ncopyright restrictions.\nSee \"Chirality and the\nOrigin of Life.\"\n\nExogenous delivery of chiral building blocks\nof biomolecules\nCarbonaceous Chondrites: A Window on Organic Chemistry in the Early Solar System\nJ. R. Cronin\nArizona State University\nhttp://astrobiology.arc.nasa.gov/workshops/1996/astrobiology/speakers/cronin\n\"Analyses of selected chiral amino acids from the Murchison meteorite suggest\nL-enantiomer excesses of the order of 5-10%. In general, the finding of\nenantiomeric excesses in extraterrestrial molecules supports the hypothesis that\nexogenous delivery made a significant contribution to organic chemical evolution\nleading to the origin of life. The finding of these enantiomeric excesses\nspecifically in substituted amino acids may have implications for the chemistry of\na pre-RNA world insofar as it suggests the possibility that these unusual, but\nmeteoritically abundant, amino acids were early biomonomers. \"\n[1] Cronin J. R. and Chang S. (1993) in The Chemistry of Life's Origins (J.M.\nGreenberg et al., eds.) Kluwer, pp. 209-258. [2] Epstein S. et al. (1987) Nature, 326,\n477-479. [3] Bonner W. A. and Rubenstein E. (1987) BioSystems, 20, 99-111\n\nASYMMETRIC AUTOCATALYSIS AND\nHOMOCHIRALITY OF BIOMOLECULES\nKenso Soai* and Itaru Sato\nAbstract\n\"Asymmetric automultiplication of chiral\ncompounds by asymmetric autocatalysis is realized\nfor the first time where a chiral product acts as a\nchiral catalyst for its own production.\"\n\nIn other words, a miniscule chiral excess in a\ncompound can propagate when those compounds are\ncatalyzing reactions involving themselves.\nSoai, Kenso, and Itaru Sato. \"Asymmetric autocatalysis and the homochirality\nof biomolecules.\" Viva Orig 30 (2002): 186-198.\n(c) Viva Origino. All rights reserved. This content is excluded from our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nRole of Mineral\nMineral Surfaces in\nBiochemical Evolution\n\nMineral surfaces can serve as templates for\nchiral molecules\nHazen, Robert M. \"Life's Rocky Start.\" Scientific American 284, No 4, (2001): 77-85.\nImage of calcite crystal attracting left- and right-\nhanded amino acids removed due to copyright\nrestrictions. See \"Templates\" figure of \"Crystal\nPower\" inset on page 80 of Hazen, Robert M.\n\"Life's Rocky Start.\" Scientific American 284,\nNo 4, (2001): 77-85.\n\nMineral-surfaces\ncan also catalyze\norganic syntheses\nunder hydrothermal\nconditions\n-Iron-sufide minerals catalyze production\nof pyruvate & other biomolecules under\nconditions existing in hydrothermal vent\nsystems.\nWachtershauser comment\non, Cody et al. (2000)\nScience 289:1337.\nMineral surface\ns and s\nynth\nes\ni\ns\n\no\nf\n\no\nr\ng\nan\nic\ns.\nImage by MIT OpenCourseWare. After figure in Wachtershauser, Gunter. \"Life As\nWe Don't Know It.\" Science 289, no. 5483 (2000): 1307-1308.\nConditio\nns for r\neactions.\nImage by MIT OpenCourseWare.\n\nMineral surfaces can protect fragile molecules\nImage of microscopic pits on the surface of\nfeldspar removed due to copyright restrictions.\nSee \"Containers\" figure of \"Crystal Power\" inset\non page 80 of Hazen, Robert M. \"Life's Rocky\nStart.\" Scientific American 284, No 4, (2001):\n77-85.\nHazen, Robert M. \"Life's Rocky Start.\" Scientific American 284, No 4, (2001): 77-85.\n\nFurther evidence for mineral catalysis of\nsimple organic molecules\nFeCO3 (Siderite) + H2O\nhydrocarbons (PAH + alkanes)\n-Sealed vessel at 300 C Tom\nMcCollom (GCA and in press).\nN2+H2+Fe3O4(magnetite)\nNH3\nHazen, Robert M. \"Life's Rocky Start.\" Scientific American 284, No 4, (2001): 77-85.\nImage of magnetite triggering the\nrecombination of nitrogen and hydrogen gasses\ninto ammonia removed due to copyright\nrestrictions. See \"Catalysts\" figure of \"Crystal\nPower\" inset on page 80 of Hazen, Robert M.\n\"Life's Rocky Start.\" Scientific American 284,\nNo 4, (2001): 77-85.\n\nMineral surfaces can act as scaffolds in the synthesis\nof complex molecules\nImage of clay layers trapping stray organic\nmolecules removed due to copyright\nrestrictions. See \"Scaffolds\" figure of \"Crystal\nPower\" inset on page 80 of Hazen, Robert M.\n\"Life's Rocky Start.\" Scientific American 284,\nNo 4, (2001): 77-85.\nHazen, Robert M. \"Life's Rocky Start.\" Scientific American 284, No 4, (2001): 77-85.\n\nA Hyperthermophilic Beginning for Life?\n-Given the inhospitable surface environment on Earth >3.8\nGa, when the intense bombardment likely melted the crust &\nvaporized the ocean, perhaps repeatedly, it is frequently\nproposed that life began in a sub-surface environment,\nperhaps a hydrothermal system where hot water, CO2 & a\nvariety of metals are readily available.\n\n-The recognition that many of the essential enzymes for life\nrequire metals common in hydrothermal settings (Fe, Ni,\nMo, Cu, Co, Zn) supports this supposition.\n\nc.f., Nisbet & Sleep (2001) Nature, Vol. 409:1083-1091.\n\nHydrothermal\nHabitats for\nEarly Life\nOn Land, around a volcano.\nOn the seafloor, at a mid-\nocean ridge.\nCourtesy of Nature Publishing Group. Used with permission.\nSource: Nisbet, E. G., and N. H. Sleep. \"The Habitat and\nNature of Early Life.\" Nature 409, no. 6823 (2001): 1083-91.\n\nSerpentinization: source of H2 and alkalinity\nKelley, Deborah S., Jeffrey A. Karson, Gretchen L. Fruh-Green, Dana R. Yoerger, Timothy M. Shank, David A. Butterfield, John M.\nHayes et al. \"A serpentinite-hosted ecosystem: the Lost City hydrothermal field.\" Science 307, no. 5714 (2005): 1428-1434.\nOlivine + water Serpentine + brucite + magnetite + H2\nSchematic figur\ne of Lost City hydrot\nhermal syste\nm.\nImage by MIT OpenCourseWare. After figure 3 in Kelley, Deborah S.,\nJeffrey A. Karson, et al. \"A serpentinite-hosted ecosystem: the Lost\nCity hydrothermal field.\" Science 307, no. 5714 (2005): 1428-34.\n\nLost City Hydrothermal Field\nVent Fluids\n\nHydrogen - up to 15 mmol/kg\n\nMethane - up to 2 mmol/kg\n\nCalcium - up to 30 mmol/kg\n\npH - 9 to 11\nLow temp volatile production:\nProskurowski et al., Chem. Geology 2006\nAbiogenic Hydrocarbon Production at\nLost City Hydrothermal Field:\nProskurowski et al., Science 2006\n\nShock, E.L. \"Geochemical habitats in hydrothermal systems.\" In: First Steps in the\nOrigin of Life in The Universe, Proceedings of the Sixth Trieste Conference on\nChemical Evolution, ed. J. Chela-Flores, Kluwer (2001).\n\nhttp://geopig.asu.edu\n- Organic synthesis from dissolved\ninorganic carbon (DIC) is favored by\nthe chemical disequilibria that exists\nbetween hot hydrothermal fluids and\nseawater\nShock, Everett L. \"Geochemical habitats in hydrothermal systems.\" In First Steps\nin the Origin of Life in the Universe, pp. 179-185. Springer Netherlands, 2001.\n\nrRNA tree\nsuggests\nhyper-\nthermophiles\nare ancient\nUniversal phylogenetic tree of life based on\n16s rRNA data removed due to copyright\nrestrictions. See figure 1 in Shock, Everett L.\n\"Geochemical habitats in hydrothermal\nsystems.\" In First Steps in the Origin of Life in\nthe Universe, pp. 179-185. Springer\nNetherlands, 2001.\n\nSummary\n- Synthesis of 'organic compounds is pervasive throughout\nthe cosmos.\n\n- Simple organic compounds with many of the attributes of\n'biological' building blocks have been delivered on dust\nand larger impactors since beginning of the solar system.\n\n- Similar organic compounds are made abiologically under\nconditions existing at different stages of earth history.\n\n- Homochirality is a 'biochemical' quality but likely had its\norigins in cosmochemistry and prebiotic chemistry\n\n- The 'when' and 'how' of the transition from prebiotic\nchemistry to biochemistry remain unsolved.\n\nThe 'RNA World'\nHypothesis\n\nCommonality & the Central Problem of\nOrigin-of-Life Research\n\"our last common ancestor stored genetic information in\nnucleic acids that specified the composition of all needed\nproteins. It also relied on proteins to direct many of the\nreactions required for self-perpetuation. Hence, the central\nproblem of origin-of-life research can be refined to ask, By\nwhat series of chemical reactions did this interdependent\nsystem of nucleic acids and proteins come into being?\"\nOrgel, Leslie E. \"The origin of life on the earth.\"\nScientific American 271, no. 4 (1994): 77-83.\n-Insight into the character of the 'last common ancestor' can\nbe gained by identifying commonalities in contemporary\norganisms. I.e., intricate features common to all modern\norganisms are unlikely to have evolved independently.\n-Examples: similar C compounds, same 20 amino acids make\nall proteins, genetic information in nucleic acids (RNA & DNA).\n\nThe 'RNA World' Hypothesis\n-Late 1960s: Woese (U.\nIllinois), Crick (England),\nOrgel (Salk Inst, San Diego)\nconcurrently proposed RNA\nmay have preceded proteins\n& catalyzed all reactions for\nsurvival & replication of 'last\ncommon ancestor'.\n-1983: Thomas Cech (U.\nColorado) & Sidney Altman\n(Yale) independently\ndiscovered ribozymes,\nenzymes made of RNA.\n- Previously all\nbiomolecules that catalyzed\nreactions (enzymes) were\nthought to be proteins\n(sequences of amino acids).\nImage of RNA molecules removed\ndue to copyright restrictions. See\npage 80 in Orgel, Leslie E. \"The\norigin of life on the earth.\" Scientific\nAmerican 271, no. 4 (1994): 77-83.\n\nOther 3 RNA Bases: guanine uracil cytosine\nHow to make subunits of RNA?\n-Phosphate: rock weathering\n-Ribose: CO2 + h --> 5 COH2 (formaldehyde) + H2O --> Ribose\n-Base: CH4 + N2 + h --> 5 HCN --> Adenine\nRibose\n\nRicardo, A., M. A. Carrigan, A. N. Olcott, and S. A. Benner. \"Borate\nminerals stabilize ribose.\" Science 303, no. 5655 (2004): 196-196.\nFigure of pentose formation in the presence of borate removed due\nto copyright restrictions.\n\nSee figure 1 of Ricardo, A., M. A. Carrigan, A. N. Olcott, and S. A.\nBenner. \"Borate minerals stabilize ribose.\" Science 303, no. 5655\n(2004): 196-196.\n\nRibose\n- Evidence for an \"RNA world,\" an episode of life on Earth during\nwhich RNA was the only genetically encoded component of\nbiological catalysts, is found in the ribosome , catalytic RNA\nmolecules, and contemporary metabolism. That RNA could form\nhas been doubted, however. Ribose and its sister pentoses\n(arabinose, xylose, and lyxose) are made under\nalkaline conditions from simple organic precursors\n(formaldehyde and glycolaldehyde) known in interstellar\nspace and presumably available on early Earth. Pentoses\ndo not accumulate under these conditions, however; they\nrapidly decompose in a \"browning\" reaction to generate largely\nundescribable polymeric mixtures.\nRicardo, A., M. A. Carrigan, A. N. Olcott, and S. A. Benner. \"Borate\nminerals stabilize ribose.\" Science 303, no. 5655 (2004): 196-196.\n\nRibose\n- These experiments suggest that the formation of\npentoses appears to be the natural outcome of\nthe chemical transformation of organic\nmolecules present in the nebula that form stars\nand planets in the presence of borate minerals.\nBecause neither borate minerals nor interstellar\norganics are excluded from the early Earth, we\nalso cannot exclude the availability of ribose\nformed prebiotically at the time when life\nemerged on Earth.\nRicardo, A., M. A. Carrigan, A. N. Olcott, and S. A. Benner. \"Borate\nminerals stabilize ribose.\" Science 303, no. 5655 (2004): 196-196.\n\nCourtesy of Nature Publishing Group. Used with permission. Source: Szostak, Jack W.,\nDavid P. Bartel, et al. \"Synthesizing Life.\" Nature 409, no. 6818 (2001): 387-90.\n\nSzostak et al, 2001\nThe vesicular compartment ensures that molecules related by descent are, on average,\nkept in physical proximity to each other, allowing a superior mutant replicase (red) to\npreferentially self-replicate, in comparison to the parental replicase (black). The\nevolutionary advantage of increased replication is amplified as vesicles with superior\nreplicase molecules are more likely to give rise to vesicles with at least two replicase\nmolecules (or a replicase and a template molecule). Vesicles with less than two\nreplicase molecules (indicated by an X) and the progeny of these vesicles cannot\ncontinue RNA self-replication. In this way, vesicles with superior replicase molecules\nbecome an increasing fraction of the vesicles that maintain replicase activity.\nCourtesy of Nature Publishing Group. Used with permission. Source: Szostak, Jack W.,\nDavid P. Bartel, et al. \"Synthesizing Life.\" Nature 409, no. 6818 (2001): 387-90.\n\nThe first major synthetic\nintermediates are an\nRNA replicase and a\nself-replicating vesicle.\nThese are combined into\na protocell, enabling\nrapid evolutionary\noptimization of the\nreplicase. Addition of an\nRNA-coded linking\nfunction, such as a lipid-\nsynthesizing ribozyme,\ncompletes the cellular\nstructure.\nCourtesy of Nature Publishing Group. Used with permission. Source: Szostak, Jack W.,\nDavid P. Bartel, et al. \"Synthesizing Life.\" Nature 409, no. 6818 (2001): 387-90.\n\nSelf-replicating\nmembrane vesicles\ncan grow either\ngradually or in\ndiscrete steps, and\nmay divide either\nspontaneously or\nunder the influence\nof external\nenvironmental\nforces.\n\nCourtesy of Nature Publishing Group. Used with permission. Source: Szostak, Jack W.,\nDavid P. Bartel, et al. \"Synthesizing Life.\" Nature 409, no. 6818 (2001): 387-90.\n\nThe Search\nfor Extraterrestrial Life\n\nThe earth remains the only\ninhabited world\nknown so far, but scientists are\nfinding that the universe\nabounds with the chemistry of life\n\nby Carl Sagan\nSagan, Carl. \"The Search for Extraterrestrial Life.\"\nScientific American 271, no. 4 (1994): 92-99.\n\nPanspermia 1\nPlanetary perspective on life on early Mars and the early Earth\nby Dr. Norman Sleep\n\nLarge (400 km) projectile\nOcean completely boiled\n230 m rock rain\nReturn to normal\n(100 years Mars)\n(3000 years Earth)\nRefugia from 400-km projectile\nModerate to deep subsurface (Mars)\nDeep subsurface (Earth)\nOnly thermophile survivors on Earth\nNonthermophiles probably survive on\nMars\nRefugia from 70-km projectile\nSubsurface (Earth and Mars)\nModerate to deep ocean (Earth)\nThermophile and nonthermophile\nsurvivors on both planets\nSmall (70 km) projectile\nDry land surface (Earth and MArs) heated to\nmelting point of rock\nAll lakes boiled on Mars\n25 m of ocean boiled on the Earth\n1 meter of rock rain\nPlanet returns to normal in 25 years\nSample projectile - Orientale basin on moon\nSleep, Norman H., and Kevin Zahnle. \"Planetary Perspective\non Life on Early Mars and the Early Earth.\" (1996).\n\nPanspermia 2\nPlanetary perspective on life on early Mars and the early Earth\nby Dr. Norman Sleep\nhttp://astrobiology.arc.nasa.gov/workshops/1996/astrobiology/speakers/sleep/sleep_index.html\n\nBiological evidence\nLife may root in thermophile on Earth - one or more almost sterilizing events\nPossible Martian fossils come from safe subsurface environment\nSpace transfer\nUnshocked Mars meteorites fall today on the Earth\nCurrent transfer rate is 107-108 rocks per million years\n10-4 of rocks arrive within 10,000 years of impact\nRate of transfer of fresh rocks is 104 per million years\nEarly solar system rate 103 higher\nBillions of fresh rocks transferred\nConclusions\nSubsurface of Mars was safer from the Earth\nSpace transfer of organisms seems feasible\nThere is biological evidence for partial sterilization of the Earth\nSpace transfer of life to Earth is a viable possibility\n\nSymbiosis leading to proto-eukaryote\nAfter Maynard-Smith and Szathmary, 1999\nAnaerobic (Eu)bacterial ancestor\nArchaeal ancestor\nOrganic\ncompounds\nfermentor=\nenergy source\nCO2\nH2\nCO2\nH2\nmethanogenesis\nCH4\nCO2\nH2\nOrganic\ncompounds\nSugar?\nsugar\nCH4\n\nSymbioses leading to Eukaryotes\nAfter Maynard-Smith and Szathmary, 1999\nOrganic\ncompounds\nfermentor\nCO2\nH2\nOrganic\ncompounds\nCO2\nH2\nOrganic\ncompounds\nArchaezoa\nProtist with hydrogenosome\nProtist with mitochondrion and\naerobic respiration\nOrganic\ncompounds\nOrganic\ncompounds\nO2\nATP\nDNA\nDNA\nDNA\nDNA\nH2\nDNA\nDNA\nDNA\nDNA\nCH4\nmethanogen\nfermentor\ngenes for\nmetabolism?\ngenes for relication ?\n\nTHE SHRUB OF LIFE\nProposed by W. Ford Doolittle, this view of early evolution suggests multiple primitive\ncells as ancestors to the three domains, and illustrates lateral gene transfer among early\norganisms.\n(c) Annenberg Learner. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nComplexity of Extant Life\nSpecies\nType\nApprox. Gene\nNumber\nProkaryotes\nE. Coli\n\ntypical bacterium\n\n4,000\nProtists\nO. Similis\nS. Cerevisiae\nDistyostelium discoideum\n\nprotozoan\nyeast\nslime mould\n\n12,000-15,000\n7,000\n12,500\nMetazoan\nC. Elegans\nD. melanogaster\nS. Purpuratas\nFugu rubripes\nMus musculus\nHomo sapiens\n\nNematode\nInsect\nEchinoderm\nFish\nMammal\nmammal\n\n17,800\n12,000-16,000\n<25,000\n50,000-10,0000\n80,000\n60,000-80,000\nAfter Maynard-Smith and Szathmary, 1999\n\nMajor Transitions in Origin/Evolution of Life\nAfter Maynard-Smith and Szathmary, 1999\nreplicating molecules\npopulations of molecules in protocells\nindependent replicators\nchromosomes\nRNA as a gene and enzyme\nDNA genes, protein enzymes\nprokaryotic cells\nCells with nuclei & organelles ie\neukaryotes\n\nasexual clones\nsexual populations\nsingle bodied organisms\nfungi, metazoans and metaphytes\nsolitary individuals\ncolonies with non-reproductive castes\nprimate societies\nhuman societies with language\n\nDavies, Paul CW, Steven A. Benner, et al. \"Signatures of a shadow biosphere.\" Astrobiology 9, no. 2\n(2009): 241-49. Courtesy Mary Ann Liebert, Inc. Used with permission.\n\nDavies, Paul CW, Steven A. Benner, Carol E. Cleland, Charles H. Lineweaver, Christopher P. McKay, and Felisa\nWolfe-Simon. \"Signatures of a shadow biosphere.\" Astrobiology 9, no. 2 (2009): 241-249.\ndoi:10.1089/ast.2008.0251.\n.\" Astrobiology 9, no. 2\n(2009): 241-49. Courtesy Mary Ann Liebert, Inc. Used with permission.\nDavies, Paul CW, Steven A. Benner, et al. \"Signatures of a shadow biosphere\n\n\"...Here we describe a bacterium, strain GFAJ-1 of the\nHalomonadaceae, isolated from Mono Lake, CA, which substitutes\narsenic for phosphorus to sustain its growth. Our data show\nevidence for arsenate in macromolecules that normally contain\nphosphate, most notably nucleic acids and proteins. Exchange of\none of the major bio-elements may have profound evolutionary and\ngeochemical significance.\"\nWolfe-Simon, Felisa, Jodi Switzer Blum, Thomas R. Kulp, Gwyneth W. Gordon, Shelley E. Hoeft, Jennifer Pett-\nRidge, John F. Stolz et al. \"A bacterium that can grow by using arsenic instead of phosphorus.\" Science 332, no.\n6034 (2011): 1163-1166. doi: 10.1126/science.1197258.\n(c) American Association for the Advancement of Science. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nKulp, T. R., S. E. Hoeft, M. Asao, M. T. Madigan, J. T. Hollibaugh, J. C. Fisher, J. F. Stolz, C. W. Culbertson, L. G. Miller, and R.\nS. Oremland. \"Arsenic (III) fuels anoxygenic photosynthesis in hot spring biofilms from Mono Lake, California.\" Science 321, no.\n5891 (2008): 967-970.\n(c) American Association for the Advancement of Science. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nWolfe-Simon, Felisa, Jodi Switzer\nBlum, Thomas R. Kulp, Gwyneth\nW. Gordon, Shelley E. Hoeft,\nJennifer Pett-Ridge, John F. Stolz\net al. \"A bacterium that can grow\nby using arsenic instead of\nphosphorus.\" Science 332, no.\n6034 (2011): 1163-1166. doi:\n10.1126/science.1197258.\n\nFigure S2. 75As-:12C- versus 31P-:12C- ratio plot from GJAJ-1 cells by NanoSIMS. Data\nshowing the relationships between As, P and C for GFAJ-1 cells grown +As/-P (open circles)\nand -As/+P (closed squares). Error bars represent 1 standard deviation of analytical variance\nduring a single measurement.\nFigure S2 from Wolfe-Simon et al. removed due to copyright\nrestriction.\n\nSee the supporting online material in Wolfe-Simon, Felisa, Jodi\nSwitzer Blum, Thomas R. Kulp, Gwyneth W. Gordon, Shelley E.\nHoeft, Jennifer Pett-Ridge, John F. Stolz et al. \"A bacterium that\ncan grow by using arsenic instead of phosphorus.\" Science 332,\nno. 6034 (2011): 1163-1166.\ndoi: 10.1126/science.1197258.\n\nFig 2. NanoSIMS analyses of GFAJ-1: extracted DNA and whole cells elemental ratio maps. (A) Agarose gel\nloaded with DNA/RNA extracted from GFAJ-1 grown +As/-P (lane 2) and -As/+P (lane 3) as compared to a\nDNA standard (Lane 1). Genomic bands were excised as indicated and analysed by NanoSIMS. Ion ratios of\n75As-:12C- of excised gel bands are indicated below with 2 sigma error shown (all values multiplied by 10-6).\nNanoSIMS images of whole GFAJ-1 cells grown either +As/-P (B, D, and F) or -As/+P (C, E, and G). The ion\nratios of 75As-:12C- [(B) and (C)], 31P-:12C- [(D) and (E)], and secondary electron, SE [(F) and (G)]. Ratios in\nB, C multiplied by 10-4 and D, E multiplied by 10-3. The color bars indicate measured elemental ratios on a log\nscale as indicated. Length scale is as indicated on images (11).\nFigure 2 from Wolfe-Simon et al. removed due to copyright\nrestriction.\n\nSee the supporting online material in Wolfe-Simon, Felisa, Jodi\nSwitzer Blum, Thomas R. Kulp, Gwyneth W. Gordon, Shelley E.\nHoeft, Jennifer Pett-Ridge, John F. Stolz et al. \"A bacterium that\ncan grow by using arsenic instead of phosphorus.\" Science 332,\nno. 6034 (2011): 1163-1166.\ndoi: 10.1126/science.1197258.\n\n(c) The Slate Group. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/af2d46514ea54e9d06a8279f545c364a_MIT12_007S13_Lec4.pdf",
      "content": "Geobiology 2013 Lecture 4\nBiogeochemical Tracers #1\n\nIsotopics #1: C and S\nCOMMON TRACERS of BIOLOGY:\n\n-\nFossils\n\n-\nElemental abundances\n-\nRedfield ratio\n\n-\nIsotopes\n-\nSee below\n\n-\nBiominerals\n-\nPyrite, carbonates, silica\n\n-\nBiological Marker Compounds, Biomarkers\n-\nSee later in the course\n\nAcknowledgements: John Hayes, Steve Macko, John Hedges\n\nBiogeochemical Tracers #1\nIsotopics #1: C and S\nNeed to Know:\nIsotopic nomenclature; definition of atm%, ratio, a, d, e\n\nHow to do simple isotopic calculations including mass balance\n\nNames of the CHNOS standards, what they are and the forms\nthat are prepared for analysis\n\nWhat processes cause isotopic fractionation including C, H & N\nin OM and C & O in limestones; S in pyrite and sulfate\n\nGeobiology 2012 Lecture 4\nBiogeochemical Tracers #1\nIsotopics #1: C and S\nAssigned Reading for this week and C-cycle\n-\nStanley 2nd Ed Chapter 10, pp 221-240\n-\nThe Earth System, Lee R. Kump, James F. Kasting & Robert G. Crane\nPrentice Hall, Upper Saddle River, NJ, 2004).Chap. 7\n-\nHayes, Introduction to Isotopic Calculations\n-\nHayes, J. M., Strauss, H. & Kaufman, A. J. (1999) The abundance of 13C in\nmarine organic matter and isotopic fractionation in the global biogeochemical\ncycle of carbon during the past 800 Ma Chem. Geol. 161, 103-125.\nOther readings\n-\nHayes JM 2001 Fractionation of the isotopes of carbon and hydrogen in\nbiosynthetic processes. Reviews in Mineralogy Stable Isotopic Geochemistry,\nJohn W. Valley and David R. Cole (eds.)\n-\nS Ono et al. New insights into Archean sulfur cycle from mass-independent\nsulfur isotope records from the Hamersley Basin, Australia. Earth and\nPlanetary Science Letters 213 (2003) 15-30.\n\nLight isotope abundances\nIsotope\nAtom%\n1H\n99.985\n2H (D)\n0.015\n12C\n98.89\n13C\n1.11\n14N\n99.63\n15N\n0.37\n16O\n99.759\n17O\n0.037\n18O\n0.204\n32S\n95.00\n33S\n0.76\n34S\n4.22\n36S\n0.014\n\nSome concepts about isotope chemistry\nAtom percent 13C =\n13C\n13C + 12C X 100\nFractional abundance 13C = 13F =\n13C\n13C + 12C\nCarbon isotope ratio =\n13C\n12C\n= 13R\nThe delta value d in % =\nRsample - Rstd\nRstd\nX 1000\n1.11%\n0.0111\n0.00 % VPDB\n0.0112372\n13R = 0.010957956 = -24.85 % VPDB\n\nR =\nX heavy\n\nX light\nTerminology\nPrimary Standards\nIsotope\nRatios\nRatios x\nStandard mean ocean\nwater\n2H/1H\n155.76\n\"\n18O/16O\n2005.20\n\"\n17O/16O\nPeeDee belemnite\n(PDB)\n13C/12C\n11237.2\nAir\n15N/14N\n3676.5\nCanyon Diablo\nmeteorite (CDT)\n32S/34S\n22.22\ndXheavy = R spl - R std x 1000\n\nRstd\nNB Standard for d18O/16O in carbonates is PDB\n\nR\nP + Q\nRelationship between an isotope effect and\nthe occurrence of isotopic fractionation\nAn Isotope Effect causes Fractionation\na physical phenomenon arising\nfrom the mass difference between\ntwo isotopes\nan observable quantity\n\nIsotope Effects\nEquilibrium\nKinetic\nMass Independent Fractionation\n\nEquilibrium in a reversible reaction, where the heavier\nisotope concentrated in the more strongly bonded\nform:\n\n13CO2(g) + H12CO3-(aq) = 12CO2(g) + H13CO3-(aq)\n\nDifferent rates of diffusive transport where:\n12CO2 diffuses ~1% faster than 13CO2\n\nDifferent rates of reaction in kinetically controlled\nconversions - the light isotope tends to react faster:\nmost biochemistry\nOrigins of Mass Dependent Isotopic Fractionation\n\nExample of equilibrium isotope effects\n13CO2(g) + H12CO3\n-(aq) 12CO2(g) + H13CO3\n-(aq)\nK = 1.0092 (0oC)\n1.0068 (30oC)\nAn equilibrium isotope effects will cause the heavy isotope to\naccumulate in a particular component to a system at equilibrium\naHCO3-/CO2 =\n(13C/12C)HCO3-\n(13C/12C)CO2\nFractionation factor\nIt is numerically equal to the equilibrium constant\n\nExample of equilibrium isotope effects\n13CO2(g) + H12CO3\n-(aq) 12CO2(g) + H13CO3\n-(aq)\nThe rule: the heavy isotope goes preferentially to the chemical\ncompound in which the element is bound most strongly\nThus, 13C accumulates in the bicarbonate anion\ne = dCO2 - dHCO3- 103(a-1) ~ 7.9\n\nSome equilibrium isotope effects\nReaction\nIsotope a equilib* e\nCO2 (g) ↔ CO2 (aq)\n13C\n0.9991 0.9\nCO2 (g) ↔ CO2 (aq)\n18O\n0.9989 1.1\nCO2 + H2O ↔ HCO3\n- + H+\n13C\n0.9921 7.9\nO2 (g) ↔ O2 (aq)\n18O\n1.000\nH2O (s) ↔ H2O (l)\n18O\n1.003\n-3\nH2O (s) ↔ H2O (l)\n2H\n1.019\n-19\nNH4\n+ ↔ NH3 + H+\n15N\n1.020\n-20\n* Measured for 20-25 °C except\nphase transition of water\n\nKinetic Isotope Effect (KIE)\nKIE occurs when the rate of a chemical reaction\nis sensitive to atomic mass at a particular position\nin one of the reacting species\nThe rule: A normal KIE is one which the species\ncontaining the lighter isotope tend to react\nmore rapidly\n\nTerminology\ndXh,p/Xh,s\ndXl,p/Xl,s\na = is the kinetic fractionation factor =\ne = dR - dP or dP = dR - e\ne = 103 (a-1)\na = [(dR + 1000) / (dP + 1000)]\nWhere p is product, s is substrate, h is heavy and l is light.\nWritten precisely this is\nA general approximation is\ne is also called the isotope effect or epsilon !!\n\nExample of Kinetic Isotope Effects (KIE)\nH3C-C-CO2H\nO\nNAD+\nNADH + H+\nCoASH\nPyruvate Dehydrogenase\n3 2 1\n(12K/13K)C-2 = 1.0232\nH3C-C-SCoA + CO2\nO\n3 2 1\nThe species containing carbon-12 at position 2 reacts\n1.0232 times more rapidly that the species containing\ncarbon-13 at that position\nIt is termed \"a 23% isotope effect\"\nThis could be the basis for a good exam question!\n\nCO2(external)\nCO2(internal)\nOrganic molecule\nBiological carbon fixation\n(Park & Epstein, 1960. GCA 21:110-126)\nStep 1: the uptake and intracellular diffusion of CO2\nStep 2: the biosynthesis of cellular components\n\nAutotrophy\nCO2\nFixation\nPhotosynthate\n(C3-C6 carbohydrates)\nBiosynthesis\nProteins\nCarbohydrates\nLipids\nNucleic Acids\nHayes, 2001. Fractionation of the Isotopes of Carbon and Hydrogen in Biosynthetic Processes\n\nHeterotrophy\nOrganic material, \"food\"\nAssimilation\nMetabolic intermediates\n(C3-C6 acids and carbohydrates)\nBiosynthesis\nProteins\nCarbohydrates\nLipids\nNucleic Acids\nHayes, 2001. Fractionation of the Isotopes of Carbon and Hydrogen in Biosynthetic Processes\n\nCarbon fixation (C3 pathway)\nCalvin-Benson-Bassham or CBB pathway\nRuBP\nRubisco: ribulose-1,5-bisphosphate\ncarboxylase oxygenase\nRubisco catalyzes the\ncarboxylation of \"RuBP\",\na 5-carbon molecule. A\n6-carbon product is\nformed as a transient\nintermediate, but the first\nstable products are two\nmolecules of \"PGA\", 3-\nphosphoglyceric acid,\nC3H7O7P. The carbon\nnumber gives its name:\nC3 photosynthesis\ne = 29.4% (O'leary, 1988; Guy, 1987)\n\nFormation of oxaloacetate from PEP (Phosphoenolpyruvate)\ncatalysed by PEP carboxylase\nATM\nCO2\nMesophyll cell\nBundle-Sheath cell\nHCO3\n-\noxaloacetate malate\nPEP pyruvate\nmalate\npyruvate\nCO2\nCalvin\ncycle\nCarbon fixation (C4 & CAM pathways)\nCAM (Crassulacean acid metabolism): Use both\nC3 and C4 metabolism separated in time\n\nCO2\nC5\nCO2\nC5\nCO2\nC5\nPGA PGA PGA PGA PGA PGA\nC3 C3 C3 C3 C3 C3\nThe flow of carbon in the Calvin cycle\nC6\nC4\nC7\nC5\nC5\nNet product\nRubisco\nFixation\nReduction\nRearrangement\n(no oxidation or\nreduction of\ncarbon involved)\nC5\n6NADPH+6H+\n6NADP+\n3C5 + 3CO2 6C3 3C5 + C3\nC5: RuBP\nC3: three-\ncarbon\ncarbohydrate\n\nFractionation of C-Isotopes during Autotrophy\nPathway, enzyme\nReact & substr Product\ne %\nOrganisms\nC3\nRubisco1\nRubisco2\nPEP carboxylase\nPEP carboxykinase\n\nCO2 +RUBP\nCO2 +RUBP\nHCO3\n- +PEP\nCO2 +PEP\n\n3-PGA x 2\n3-PGA x 2\noxaloacetate\noxaloacetate\n10-22\n\nplants & algae\ncyanobacteria\nplants & algae\nplants & algae\nC4 and CAM\nPEP carboxylase\nRubisco1\n\nHCO3\n- +PEP CO2\n+RUBP\n\noxaloacetate\n3-PGA x 2\n2-15\n\nplants &\nalgae (C4)\nAcetyl-CoA\nCO dehydrog\nPyruvate synthase\nPEP carboxylase\nPEP carboxykinase\n\nCO2 + 2H+ CoASH\nCO2 + Ac-CoA\nHCO3\n- +PEP\nCO2 +PEP\n\nAcSCoA\npyruvate\noxaloacetate\nOxaloacetate\n15-36\n\nbacteria\nReductive or reverse\nTCA\nCO2 + succinyl-\nCoA (+ others)\na-\nketoglutarate\n4-13\nBacteria esp\ngreen sulfur\n3-hydroxypropionate\nHCO3\n- +\nacetylCoA\nMalonyl-CoA\nGreen non-S\nThis could be the basis for a good exam question!\n\nSample\nPyrolysis\nexcess C\nCO\n(+?)\nConversion\nCO2 (MS for 18O)\nSchematic representation of sample-preparation\nprocedures\nH2O\nCombustion\n(excess O2)\nCO2\nN2\n(MS for 13C)\n(MS for 15N)\n(MS for 2H)\nH2\nReduction\nsample\nNO2\n(MS for 2H)\nH2\nNB these processes must be complete to avoid fractionation\n\nStandard requirements\nBe used worldwide as the zero point\nBe homogeneous in composition\nBe available in relatively large amounts\nBe easy to handle for chemical preparation\nand isotope measurements\nHave an isotope ratio near the middle of the\nnatural variation range\n\n22.22\n34S/32S\nCanyon Diablo\nmeteorite (CDT)\n3676.5\n15N/14N\nAir\n11237.2\n13C/12C\nPeeDee belemnite\n(PDB)\n17O/16O\n\"\n2005.20\n18O/16O\n\"\n155.76\n2H/1H\nStandard mean\nocean water\nRatios x\nIsotope\nRatios\nPrimary\nStandards\nIsotopic compositions of primary standards\nThis could be the basis for a good exam question!\n\nPrinciples of Isotopic Measurement\nIon Source\nFocusing Plates\nMass Analyser\nElectromagnet\nCollector Array of\nFaraday cups for\nsimultaneous\nmeasurement of all\nions of interest\nInlet\nEither a pure gas via a duel inlet system for sample and standard\nOr a stream of gas containing sample 'slugs' interspersed\nwith standard 'slugs'\nImage courtesy NASA.\n\nNatural variability in bulk C-isotopes\n-30\n-20\n-10\n-40\nMethanogenic bacteria\nPhotosynthetic bacteria\nEukarotic Algae\nC4 vascular plants\nC3 vascular plants\nAtmospheric CO2\nMarine bicarbonate\nMarine carbonate\nδ13C (%)\n\nOrganismal variability in bulk C-isotopes\nFig\nure\nof\norga\nnis\nmal variabilit\ny in bulk carbo\nn isot\nopes.\nImage by MIT OpenCourseWare. After Degens, E. T. \"Biogeochemistry of\nStable Carbon Isotopes.\" Organic Geochemistry (1969): 304-29.\n\n(c) JM Hayes\nCourtesy of John Hayes. Used with permission.\n\n(c) JM Hayes\nCourtesy of John Hayes. Used with permission.\n\n-10\n-20\n-30\nCarbon Input\nCO HCO\n=\nMicroorganisms\n0.8\n0.2\nKinetic\nIsotope\nEffect\nCrustal\nAverage\nIsotopic Mass Balance of Crustal Carbon Reservoirs\nC\nd\nReduced\nCarbon\nCarbonate\nCourtesy Dave Des Marais, NASA Ames. Used with permission.\n\nReprise to Evidence of Early Life\n\n13C Evidence for Antiquity of Earthly Life CorgCcarb\nGr\naph\nof\nde\nl\nt\na-1\n3C\nover time.\n\nImage by MIT OpenCourseWare.\n\nS.J.Mojzsis et al., \"Evidence for life\non Earth before 3,800 million years\nago\" ...based on isotopically light\ncarbon in graphite in apatite ..\nBut .....\nSano et al. '99 report the apatite\nhad U/Pb and Pb/Pb ages of\nonly ~ 1.5 Ga.\nAnd..........\n(c) Nature Publishing Group. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nTracing Life in the Earliest Terrestrial Rock Record, Eos Trans. AGU, 82(47),\nFall Meet. Suppl., Abstract P22B-0545 , 2001\nLepland, A., van Zuilen, M., Arrhenius, G\nThe principal method for studying the earliest traces of life in the metamorphosed, oldest ($>$ 3.5 Ga) terrestrial rocks\ninvolves determination of isotopic composition of carbon, mainly prevailing as graphite. It is generally believed that this\nmeasure can distinguish biogenic graphite from abiogenic varieties. However, the interpretation of life from carbon isotope\nratios has to be assessed within the context of specific geologic circumstances requiring (i) reliable protolith interpretation\n(ii) control of secondary, metasomatic processes, and (iii) understanding of different graphite producing mechanisms and\nrelated carbon isotopic systematics. We have carried out a systematic study of abundance, isotopic composition and\npetrographic associations of graphite in rocks from the ca. 3.8 Ga Isua Supracrustal Belt (ISB) in southern West Greenland.\nOur study indicates that most of the graphite in ISB occurs in carbonate-rich metasomatic rocks (metacarbonates) while\nsedimentary units, including banded iron formations (BIFs) and metacherts, have exceedingly low graphite concentrations.\nRegardless of isotopic composition of graphite in metacarbonate rocks, their secondary origin disqualifies them from\nproviding evidence for traces of life stemming from 3.8 Ga. Recognition of the secondary origin of Isua metacarbonates thus\ncalls for reevaluation of biologic interpretations by Schidlowski et al. (1979) and Mojzsis et al. (1996) that suggested the\noccurrence of 3.8 Ga biogenic graphite in these rocks. The origin of minute quantities of reduced carbon, released from\nsedimentary BIFs and metacherts at combustion steps $>$ 700 C remains to be clarified. Its isotopic composition (d13C\nfrom -18 to -25%) may hint at a biogenic origin. However, such isotopically light carbon was also found in Proterozoic mafic\ndykes cross-cutting the metasedimentary units in the ISB. The occurrence of isotopically light, reduced carbon in biologically\nirrelevant dykes may indicate secondary graphite crystallization from CO2 or CH4- containing fluids that in turn may derive\nfrom bioorganic sources. If this were the case, trace amounts of isotopically light secondary graphite can also be expected\nin metasediments, complicating the usage of light graphite as primary biomarker. The possibility of recent organic\ncontamination, particularly important in low graphite samples, needs also to be considered; it appears as a ubiquitous\ncomponent released at combustion in the 400 to 500 deg range. - A potential use of the apatite-graphite association as a\nbiomarker has been proposed in the study by Mojzsis et al. (1996). Close inspection of several hundred apatite crystals\nfrom Isua BIFs and metacherts did, however, not show an association between these two minerals, moreover graphite is\npractically absent in these metasediments. In contrast, apatite crystals in the non-sedimentary metacarbonate rocks were\nfound commonly to have invaginations, coatings and inclusions of abundant graphite. Considering that such graphite\ninclusions in apatite are restricted to the secondary metasomatic carbonate rocks in the ISB this association can not be\nconsidered as a primary biomarker in the Isua Supracrustal Belt References: Mojzsis,S.J, .Arrhenius,G.,\nMcKeegan, K.D.,.Harrison, T.M.,.Nutman, A.P \\& C.R.L.Friend.,1996. Nature 384: 55 Schidlowski, M.,\nAppel, P.W.U., Eichmann, R. \\& Junge, C.E., 1979. Geochim. Cosmochim. Acta 43: 189-190.\n(c) American Geophysical Union. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\nSource: From Lepland, A., M. van Zuilen, and G. Arrhenius. \"Tracing Life in the Earliest\nTerrestrial Rock Record.\" In AGU Fall Meeting Abstracts 1 (2001 ): 0545.\n\n13C Evidence for Antiquity of Earthly Life CorgCcarb\nGr\naph\nof\nde\nl\nt\na-1\n3C\nover time.\nImage by MIT OpenCourseWare.\n\nAbundances of stable sulfur isotopes\n(MacNamara & Thode, 1950. Phys. Rev.)\n32S: 95.02%\n33S: 0.75%\n34S: 4.21%\n36S: 0.02%\nHowever, the abundances of stable isotopes may vary from\ntheir average values as a result of biological and inorganic\nreactions, Involving the chemical transformation of\nsulfur compounds.\n\nSulfur forms and their oxidation state\nCompound Formula Oxidation state\nSulfide S2- -2\nPolysulfide Sn\n2- -2, 0\nSulfur S8 0\nHyposulfite (dithionite) S2O4\n2- +3\nSulfite SO3\n2- +4\nThiosulfate S2O3\n2- -2, +6\n\nSulfur forms and their oxidation state\nCompound Formula Oxidation state\nDithionate S2O6\n2- +5\nTrithionate S3O6\n2- -2, +6\nTetrathionate S4O6\n2- -2, +6\nPentathionate S5O6\n2- -2, +6\nSulfate SO4\n2- +6\n\nd notation\nd34S =\n(34S/32S)sample -(34S/32S)standard\n(34S/32S)standard\nX 1000%\nI: troilite (FeS) from the Canon Diablo meteorite, CDT\nStandard:\nII: IAEA-S-1 (Ag2S), V-CDT\n\nDissimilatory sulfate reduction\nSO4\n2- + CH2O H2S + HCO3\n-\n32S-O bond easier to break than 34S-O\nSulfides become enriched in 32S and depleted in 34S\nSO4\n2- + H2 H2S + H2O\n\nSulfur isotope fractionation\nThe partitioning of isotopes between two substances\n(H2S and SO4) with different isotope ratios\nFractionation (eSR) = d34SSO4 - d34SH2S\n\nBiochemical pathway of dissimilatory SR\nSO4\n2- (out)\nSO4\n2- (in)\nAPS\nFractionation\nSO3\n2-\nH2S\n-3%\n0%\n15%\n25%\ncell wall\n\nSO4\n2-\norganic sulfur\nH2S\nSO4\n2-\nSO3\n2-\nS4O6\n2-\nS2O3\n2-\nS0\nSO4\n2-\nS4O6\n2-\nS2O3\n2-\nS2O3\n2-\nS0\nH2S\nSO4\n2-\nH2S\nTree of Biological Sulfur Cycle\nreduction\noxidation disproportionation\n\n0 10 20 30 40 50\n30 Number of occurrences\nFractionation (%)\nEmpirical Measurements of S-isotopic\nfractionation during sulfate reduction\n(Shen and Buick, 2004. Earth-Sci. Rev.)\npure cultures\nnatural populations\nNon-limiting sulfate\nCourtesy of Elsevier, Inc. Used with permission. Source: Shen, Yanan, and Roger Buick. \"The Antiquity\nMicrobial Sulfate Reduction.\" Earth-Science Reviews 64, no. 3 (2004): 243-72.\n\nPyrite formation and S-isotope preservation\nSO4\n2- H2S FeS\nFe2+\nH2S\nS0\nFeS2\nlittle fractionation (<1%)\nTherefore, d34S of pyrites in sedimentary rocks provide indication:\nI: the activity of SRB (Life)\nII: conditions of sulfide formation (Environment)\n\n50 40 30 20 10 0 -10 -20 -30 -40\nsedimentary rocks\nmetamorphic rocks\ngranitic rocks\nbasaltic rocks\nocean water\nd34S (%)\nTypical d34S values of some geological material\n(relative to CDT)\n\n1. Isotope signature is primary from sedimentary\nrocks\n3. Fairly large spread of d34S values for sulfides,\nand thus large fractionations.\n2. d34S values are distinctly shifted to the\nnegative values.\nIsotopic evidence for microbial sulfate reduction\n\n-2 -1 0 +1 +2\nThe oldest terrestrial S-isotopic records (~3.8 Ga)\nfrom the Isua Superacrustal Belt, Greenland\n(Monster et al., 1979. GCA)\nSimilar to those of magmatic sulfides\nand close to meteoritic ie solar system\nvalues\nNarrow range d34S = ave. 0.5±0.9%)\n\nModels for low fractionation of 0±5%\n(Paytan, 2000. Science)\nNon-biological\nfractionation\nLow pO2\nLow SO4\n2-\nSRB not active\nLow sulphate\nconcentration\npO2=10-12atm\nSO4\n2- <1mM\nSRB active\nHigh SRR\npO2=10-2.5 atm\nSO4\n2- >10mM\nSRB active\nT ~ 400C\nClosed system\neffect\npO2=10-2.5 atm\nSO4\n2- >10mM\nSRB active\nSR Rates>\ndiffusion rates\n(~3.8 Ga - 2.7 Ga)\n\n3.48 Ga\nBarium\nSulfate\ncrystals\nfrom\nWestern\nAustralia\n(c) Elsevier B.V. All rights reserved. This content is\nexcluded from our Creative Commons license. For\nmore information, see http://ocw.mit.edu/fairuse.\nSource: Shen, Yanan, and Roger Buick. \"The\nAntiquity of Microbial Sulfate Reduction.\" Earth-\nScience Reviews 64, no. 3 (2004): 243-72.\n\n1mm\n1mm\n1mm\nmacroscopic py\nmicroscopic py\nsulfate\n(c) Elsevier B.V. All rights reserved. This content is\nexcluded from our Creative Commons license. For\nmore information, see http://ocw.mit.edu/fairuse.\nSource: Shen, Yanan, and Roger Buick. \"The\nAntiquity of Microbial Sulfate Reduction.\" Earth-\nScience Reviews 64, no. 3 (2004): 243-72.\n\n-18 -16 -14 -12 -10 -8 -6 -4 -2 0 +2 +4 +6 +8 +10\nNumber of occurrences\npyrite\nbarite\nd S (%)\n(Shen et al., 2001. Nature 410: 77-81 )\nThe 34\nd S of sulfur species from the 3.48Ga rocks in\nthe North Pole of northwestern Australia\nCourtesy of Nature Publishing Group. Used with permission. Source: Shen, Yanan, Roger Buick, et al. \"Isotopic\nEvidence for Microbial Sulphate Reduction in the Early Archaean Era.\" Nature 410, no. 6824 (2001): 77-81.\n\nFigure 3 The secular trends in the isotopic composition of seawater sulphate and sulphide over geological\ntime. Data within the oval are from this work, the other data are from refs 2, 29. The band (double line) in\nthe upper part of the (r)gure represents the isotopic composition of seawater sulphate through time. The\nsingle line in the lower part of the figure is displaced from the seawater sulphate trend by 55per mil,\nrepresenting themaximum fractionation between sulphate and sulphide through the past 600 million years.\nBefore 1.7 Gyr ago, constraints on the isotopic composition of seawater sulphateare sparse.\nIsotopic evidence for microbial sulphate reduction in the early Archaean era\nYanan Shen*, Roger Buick2 & Donald E. Canfield* NATURE |VOL 410 | 1 MARCH 2001p77-79\n\n33S 34S 36S\n32S\nd36S d34S d33S\nMass-dependent Fractionation:\nd33S=0.515d34S, d36S=1.91d34S\nMultiple sulfur isotopes\n\nMass Independent Fractionation\n-\nDetectable when there are >2 isotopes fractionated by different\nmechanisms\n-\nSeems to apply to gas phase chemistry (eg atmospheric\nprocesses in Nature)\n-\nExamples occur in O3, O2, CO2, CO, N2O, H2O2 and sulfate\naerosols. The isotopic anomalies are apparently linked to\nphotochemical reactions\n-\nA well-known example is the transfer, in the stratosphere, of\n17O and 18O from molecular oxygen to CO2 via ozone.\n-\nOxygenated sulfur species undergo gas phase reactions leading\nto MIF in the absence of O2\n-\nThis is the 'origin' of MIF in Archean sulfur species (eg Farquhar\net al) although the precise mechanisms are still to be elucidated\n\nMass Independent Fractionation\nFig. 3. A conceptual model of Archean sulfur cycle.\nPhotochemistry in the atmosphere causes MIF in\nsulfur isotopes, and aerosols of S8 and H2SO4 carry\nsulfur with positive (*S) and negative (#S) v33S\nsignatures, respectively. The preservation of MIF\nsignatures in the sediments implies incomplete\noxidation of S8 in the ocean (dashed arrow).\nCourtesy of Elsevier, Inc. Used with permission. Source: Ono, Shuhei, Jennifer L. Eigenbrode, et al. \"New Insights into Archean Sulfur Cycle from\nMass-Independent Sulfur Isotope Records from the Hamersley Basin, Australia.\" Earth and Planetary Science Letters 213, no. 1 (2003): 15-30.\n\nMass Independent Fractionation\nImage by MIT OpenCourseWare. After Figure 3D in Farquhar, James et al. \"Observation of Wavelength-Sensitive\nMass-Independent Sulfur Isotope eEfects During SO2 Photolysis: Implications for the Early Atmosphere.\n\" Journal of Geophysical Research 106, no. E12 (2001): 32829-32.\nGraph of d33S (%) over d34S (%).\n\nMass Independent (Anomalous) Fractionation\nof O-isotopes in Atmospheric Gases\n\nFigure 3. A three-isotope plot showing the mass dependent line and the most important deviations for CO2, CO,\nand tropospheric O3. Stratospheric ozone (not shown here) is further enriched.\nFigure 1. The distribution of ozone isotopomers\nmeasured by using enriched mixtures. The\nasymmetric molecules are formed preferentially.\nNumbers next to bars indicate molecular\ncomposition, e.g., \"667\" = 16O16O17O.\nFigures courtesy of IGAC Project. Used with permission.\nhttp://www.igacproject.org/sites/all/themes/bluemasters/images/\nNewsletterArchives/Issue_16_Mar_1999.pdf\n\nSulfur Summary\nThe wide spread of d34S values of microscopic pyrites\naligned along growth faces of former gypsum crystals\nin the North Pole barite deposit suggests that sulfate-\nreducing prokaryotes had evolved by 3.47 Ga.\nThe large S-isotopic fractionations in this localized\nand sulfate-rich environment, but not in other rocks\nimply that Archean ocean was low in sulfate, and, by\nimplication, low oxygen in the atmosphere.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/c5557f81b3efcd4874db40d78ad470e5_MIT12_007S13_Lec5.pdf",
      "content": "Geobiology 2013 Lecture 5\nBiogeochemical Tracers\nIsotopics #2: C, H, O and N\nAcknowledgements: John Hayes, Karen Casciotti, Steve\nMacko, John Hedges\nAssigned Reading\n- Stanley 2nd Ed Chapter 10, pp 221-240\n- Hayes JM 2001 Fractionation of the isotopes of carbon and hydrogen in\nbiosynthetic processes. Reviews in Mineralogy Stable Isotopic\nGeochemistry, John W. Valley and David R. Cole (eds.)\n- Hayes Concepts and Calculations\n\nGeobiology 2012 Lecture 5\nBiogeochemical Tracers\nIsotopics #2: C, H, O and N\nNeed to Know:\nBallpark delta values of C, O, N, H in marine and terrestrial\nbiomass\nHow H&O are fractionated in the hydrological cycle\nHow (roughly) C&H fractionation occurs in organic matter\nHow (roughly) N is fractionated on land and in the ocean\n\nSources of hydrogen and oxygen isotopic\nfractionation\n\n2D\nplot showing Delta180 changi\nng w\nith c\nloud\ntempe\nra\ntu\nre.Graph of cloud, rain and continent showing the hydrological cycle.\nFigure by MIT OpenCourseWare.\nThe major nonbiological fractionation process affecting\nstable hydrogen (and oxygen) isotopes is the hydrologic\ncycle in which water molecules containing lighter isotopes\nImage removed due to copyright restrictions.\n(1H & 16O) are preferentially evaporated and retained in a\nGraph of deuterium per mil over oxygen-18 per mil. cloud (vs. 2H & 18O).\nThe net result of this fractionation process is that\nprecipitation at increasingly inland, higher altitude (cooler)\nsites is depleted in both 18O and 2H (D).\nGraph\nof c\nloud,\nrain\nand\nconti\nnent\nsho\nwing\nthe\nhydrolog\nical\ncycle.\nFigure by MIT OpenCourseWare.\n\nCourtesy of John Hayes. Used with permission.\nIn general, tree sap isotopically resembles local meteoric water, whereas leaf water is isotopically\nenriched. Organic matter is depleted in D versus the leaf water from which it is\nbiosynthesized (values given above are typical for N. American plants).\nIn general, lipids are depleted in D versus lignin and cellulose from the same plant, whereas\ncellulose is slightly more depleted than coexisting lignin (Rundle et al., 1989).\nCellulose is usually analyzed in nitrated form (NO3 replacing OH on each C), so that only the\nnonexchangeable H directly bound to C is analyzed.\nBecause the D in cellulose nitrate reflects local water, woods can be used as a proxy for the\nhydrogen isotope composition of past environments in which the wood was made\n\nHydrogen isotopic signatures\nFd-NADP reductase (2.4)\nPhotosynthesis\nH2O + hv O2 + NADPH\n2 reduced ferredoxin + NADP+ + H+\n2 oxidized ferredoxin + NADPH\nInsertion of a non-exchangeable H- from NADPH into pyruvate.\nReactions like this responsible for setting δD of organics\nH going from NADPH to pyruvate becomes H in lipid\n\nFlow cha\nrt\nshowing th\ne process\nfrom water to\ncellulos\ne.\nHydrogen isotopic\nsignatures inherited\nfrom water through\nreactions of\nNADPH\nFigure by MIT OpenCourseWare.\n\nLine\nplot\nshow\nin\ng C28\n-sten\nol ch\nanges\nin d\niffer\nent w\nater.\nFigure by MIT OpenCourseWare.\n\nSources of nitrogen isotopic fractionation\n\nSimplified Terrestrial Nitrogen Cycle\nhttp://www.windows.ucar.edu/earth/climate/images/nitrogencycle.jpg\nBottom line: In natural systems, new fixed nitrogen entering the system comes from\nbacterial nitrogen fixation which results in only small N-isotopic fractionations\nSchematic figure of the nitrogen cycle removed due to copyright restrictions.\n\nSome Typical 15N values\nAtm. N2 'fixed'' by terrestrial flora (Nif in legumes) ~ 0\nper mil\nAtm. N2 'fixed' by marine bacteria and Cb ~ 0 per mil\nNitrate or ammonium utilized by terrestrial flora and\nconverted to organic nitrogen ~0 per mil\nDissolved nitrate in the ocean ~ +7 to +10 per mil\nMarine organisms high in the trophic structure (e.g.\nfish, whales)\n+10 to + 20 per mil\n\nSimplified Marine Nitrogen Cycle\n(c) Karen Casciotti OCW\nFlow chart\nshow\ning nitroge\nn cycle in\nocean. Please also\nremove \"(c) Karen\nCasciotti OCW\"\n.\nImage by MIT OpenCourseWare.\n\nMajor isotopic fractionation in the N-cycle occurs during denitrification (-20 to -40 per mil)\nLight N2 leaves the ocean causing the residual nitrate to become heavy\nNitrification and Denitrification: formula and\nexplanation.\nImage by MIT OpenCourseWare.\n\n15N vs 13C Foodweb\nTrophic\nfractionation of\ncarbon and\nnitrogen isotopes\n(Georges Bank)\nB. Fry (1988) Limnol.\nOceanogr. 33, 1182-1190.\n2D\np\nlo\nt\nsh\now\nin\ng\ntr\nop\nhi\nc\n\nf\nr\na\nc\nt\ni\no\nn\nof\nca\nrbo\nn a\nnd\nnit\nrog\nen\niso\ntop\nes.\nImage by MIT OpenCourseWare.\n\nTrophic fractionation of\ncarbon and nitrogen\nisotopes\nK. Yoshii, N. G. Melnick, O.\nA. Timoshkin,\nN. A.\nBondarenko,\nP. N.\nAnoshko, T. Yoshioka, & E.\nWada (1999) Limnol.\nOceanogr. 44, 502-511.\n2D graph sh\nowing tro\np\nh\ni\nc\nfrac\ntiona\ntion\nin di\nffere\nnt tr\nophic\nleve\nl.\nImage by MIT OpenCourseWare.\n\nBiogeochemistry of the Stable Nitrogen Isotopes\nAn important use of stable nitrogen isotopes is as an indicator of trophic level in natural\nsystems with known nitrogen sources and relatively simple food webs. The following\nfigure is from Schoeninger and DeNiro (1984) GCA 48, 625-639. Average 815N trophic\noffset is ~3 % per trophic level\nCourtesy Elsevier, Inc.,\nhttp://www.sciencedirect.com.\nUsed with permission.\n\nCharacterizing Organic Matter Using Bulk\nIsotopic Data\n\n2D g\nraph\nsho\nwing\nsta\nbl\ne\nis\noto\npe,\nsuch as Delta13C and Delta15N distributions.\nFigure by MIT OpenCourseWare.\n\nOrganismal Variability in Bulk C-Isotopes\nTabl\ne o\nf f\nrac\ntions\nof\na marine plan\nkton and bulk C\n-isoto\npes.\nImage by MIT OpenCourseWare.\n\n2D\ngra\nph\nsho\nwin\ng D\nelt\na1\n3C\ncha\nngin\ng wi\nth D\nelta\n18O.\nFigure by MIT OpenCourseWare.\n2D\ngraph showing Delta13C changing with Delta18O.\nMulti-element,\nmpound-specific\notopic Analyses\nVanillin\n\nCharacterising Cocaine Sources\nThese images have been removed\ndue to copyright restrictions.\n\n2D\ngra\nph\nsho\nwin\ng D\nelt\na1\n3C\ncha\nngin\ng wi\nth D\nelta\n18O.\nFigure by MIT OpenCourseWare.\n2D\ngraph showing Delta13C changing with Delta18O.\nMulti-element,\nmpound-specific\notopic Analyses\nVanillin\n\nCompound Specific Isotope Analysis\nm/z 44 mV\n45/44 ratio trace\nCourtesy of John Hayes. Used with permission.\n\nReprinted by permission from Macmillan Publishers Ltd. Katherine H. Freeman,\nJ. M. Hayes, et al. Evidence from Carbon Isotope Measurements for Diverse\nOrigins of Sedimentary Hydrocarbons. Nature 343 (1990): 254-6.\n\nC-isotopic Composition of Organic Compounds\nThree major controls\n- Source of carbon and its C-isotopic\ncomposition\n- Fractionation during assimilation (eg\nheterotrophy, photosynthesis, methanotrophy)\n- Fractionation during biosynthesis (lipids)\n\nC-isotopic Composition of Organic Compounds\nSource of carbon and its C-isotopic\ncomposition\n- Inorganic carbon\n- (-7% atm. CO2) assimilated by photosynthesis\nε 5-35 per mil depending on pathway extent of\nconsumption\n\nC-isotopic Composition of Organic Compounds\n-\nFractionation during photosynthesis\nCourtesy of John Hayes. Used with permission.\n\nC-isotopic Composition of Organic Compounds\nSource of carbon and its C-isotopic composition\n- Inorganic carbon\n- (-7% atm. CO2) assimilated by photosynthesis\nε 5-35 per mil depending on pathway extent of consumption\n- Organic carbon\n- (-25% on average) assimilated during heterotrophy\nε -1 (you are what you eat plus 1 per mil!!)\n- Methane carbon\n- (-30 to -100%) assimilated during methanotrophy\nε 0-30 per mil depending on pathway and extent of\nconsumption\n\nhttp://www.astrobio.net/news/modules.php?op=modload&name=News&file=article&sid=34\nAt the very edge of the brine pool, the mussels are\nespecially abundant and happy. This area is often filled\nwith newly settled baby mussels perched on the shells\nof larger mussels just above the brine.\nCredit: Penn State University, Dept. of Biology\nCafe Methane\nGas hydrates (yellow) are ice with gas trapped\ninside; exposed beds are accessible to\nsubmersibles on the deep sea floor of the Gulf of\nMexico. Ice worms, a new species only seen in\nhydrate, were discovered in 1997 by C. Fisher,\nPenn State University.\n\nhttp://www.bio.psu.edu/People/Faculty/Fisher/cold_seeps/\nMethane-rich water is pumped into the\nmussel and across its gills. The symbiotic\nbacteria in the gills use methane as both a\ncarbon and energy source. The mussels, in\nturn, live off the symbiotic bacteria.\nUsing the scanning electron microscope, we can see over a dozen\nmussel gill cells in the panel on the left. On the right is a closer look\nat the cell with its outer membrane partially removed. Look into the\ncell to see hundreds of symbiotic bacteria.\n\nUsing the scanning electron microscope,\nwe can see over a dozen mussel gill cells\nin the panel on the left. On the right is a\ncloser look at the cell with its outer\nmembrane partially removed. Look into the\ncell to see hundreds of symbiotic bacteria.\n\nTissue di\nstribut\nion table s\nhowi\nng delta1\n3C va\nlues for see\np mussel cycl\nic triterpeno\nids.\nImage by MIT OpenCourseWare.\n\nLanostane (XVIII; δδ13C: -70%)\nhop-17-(21)-ene XII; δ13C: -32%)\nNorlanostane (XVII; δδ13C: -80%),\nCourtesy Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\n\nC-isotopic Composition of Organic Compounds\n- Fractionation during biosynthesis (lipids)\n\nC-isotopic compositions of amino acids from Anabeanea\ngrown on different N-sources (Macko et al., 1987)\nThis image has been removed due to copyright restrictions.\n\nBa\nr\nch\nar\nt\nsh\no\nw\ni\nn\ng\nis\noto\npic\nen\nric\nhme\nnt\nof\ncar\nbox\nyl\ncarbon.\nImage by MIT OpenCourseWare.\n\nIntramolecular C-isotopic Differences\n(DeNiro and Epstein, 1977; Monson and Hayes, 1980,\n1982; reviewed Hayes, 2001)\nReactions occur between molecules but isotope selectivity is\nexpressed as chemical bonds that are made or broken at\nparticular carbon positions.\nIsotope effects pertain to those specific positions and control\nfractionations only at that reaction site, not throughout the whole\nmolecule.\nTo calculate changes in the isotopic compositions of whole\nmolecules we must first calculate the change at the site and then\nallow for the rest of the molecule because the isotopic shift is\ndiluted by mixing with carbon that is just along for the\nride....................Hayes, 2002\n\nNAD+\nNADH + H+\nIsotopic Fractionations in Biosynthetic Reactions\n3 2 1\n3 2\nH3C-C-CO2H\nH3C-C-SCoA + CO2\nCoASH\nO\nO\nPyruvate Dehydrogenase\n(12K/13K)C-2 = 1.0232\nThe species containing carbon-12 at position 2 reacts\n1.0232 times more rapidly that the species containing\ncarbon-13 at that position\nIt is termed \"a 23% isotope effect\"\n\nThese images have been removed due to copyright restrictions.\nFlows of C at the pyruvate branch point in the metabolism of E. coli grown aerobically on\nglucose (Roberts 1955). 74% of the pyruvate is decarboxylated to yield Ac-CoA. The\nobserved depletion at odd-numbered positions of FAcids is shown at the right indicating that\nthe isotope effect at C-2 in the pyruvate dehydrogenase reaction is 23%\n\nD/H by GC-pyrolysis-IRMS\nHilkert, 1998; Burgoyne, 1998; Sessions, 1999\nFlow chart showin\ng gas chromat\nogram, pyrolysis\ninterf\nace an\nd mass spectrometer\n.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geology\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/034da58e6fb56fe605b805a8b7be7ef1_MIT12_007S13_Lec6.pdf",
      "content": "Geobiology 2013 Lecture 6\nBiogeochemical Tracers\nIsotopics #3:\nBiosynthetic fractionations and Intramolecular\nisotopic data, more of multi-element isotopics and\nthe Precambrian C-Cycle\nAcknowledgements: John Hayes, David DesMarais\nAssigned Reading\n- Hayes JM 2001 Fractionation of the isotopes of carbon and hydrogen in\nbiosynthetic processes. Reviews in Mineralogy Stable Isotopic\nGeochemistry, John W. Valley and David R. Cole (eds.)\n- David J Des Marais 1997. Isotopic evolution of the biogeochemical carbon\ncycle during the Proterozoic Eon Original Research Article, Organic\nGeochemistry, Volume 27, Issues 5-6, Pages 185-193\n\nRevision of carbon isotopic principles\nAnd examining isotopic fractionation at\nmolecular, organismic and planetary\nscales\n\nMook et al., 1974\n\nAbundances of 13C\nare reported in\nterms of δ. The zero\npoint of the scale is\ndefined by the\nVPDB standard.\nValues of δare\ncommonly multiplied\nby 1000 and thus\nexpressed in parts\nper thousand, %.\nδ13C\n%VPDB\n\nCourtesy of John Hayes. Used with permission.\n\nPathway, enzyme\nReact & substr Product\nε %\nOrganisms\nC3\nRubisco1\nRubisco2\nPEP carboxylase\nPEP carboxykinase\nCO2 +RUBP\nCO2 +RUBP\nHCO3\n-+PEP\nCO2 +PEP\n3-PGA x 2\n3-PGA x 2\noxaloacetate\noxaloacetate\n10-22\nplants & algae\ncyanobacteria\nplants & algae\nplants & algae\nC4 and CAM\nPEP carboxylase\nRubisco1\nHCO3\n- +PEP CO2\n+RUBP\noxaloacetate\n3-PGA x 2\n2-15\nplants &\nalgae (C4)\nAcetyl-CoA\nCO dehydrog\nPyruvate synthase\nPEP carboxylase\nPEP carboxykinase\nCO2 + 2H+ CoASH\nCO2 + Ac-CoA\nHCO3\n-+PEP\nCO2 +PEP\nAcSCoA\npyruvate\noxaloacetate\nOxaloacetate\n15-36\nbacteria\nReductive or reverse\nTCA\nCO2 + succinyl-\nCoA (+ others)\nα-\nketoglutarate\n4-13\nBacteria esp\ngreen sulfur\n3-hydroxypropionate\nHCO3\n- +\nacetylCoA\nMalonyl-CoA\nGreen non-S\nFractionation of C-Isotopes during Autotrophy\n\nCarbon fixation (C4 & CAM pathways)\nFormation of oxaloacetate from PEP (Phosphoenolpyruvate)\ncatalysed by PEP carboxylase\nMesophyll cell\nBundle-Sheath cell\nATM\nCO2\nHCO3\n-\noxaloacetate malate\nPEP pyruvate\nmalate\npyruvate\nCO2\nCalvin\ncycle\nCAM (Crassulacean acid metabolism): Use both\nC3 and C4 metabolism separated in time\n\nIsotopic consequences of different food sources\nA. W. Stott, E. Davies, R. P. Evershed, & N. Tuross (1997) Naturwissenschaften 84, 82-86.\n\nTrophic Shifts\n\nIntramolecular C-isotopic Differences\n(DeNiro and Epstein, 1977; Monson and Hayes, 1980,\n1982; reviewed Hayes, 2001)\nReactions occur between molecules but isotope selectivity is\nexpressed as chemical bonds that are made or broken at\nparticular carbon positions.\nIsotope effects pertain to those specific positions and control\nfractionations only at that reaction site, not throughout the whole\nmolecule.\nTo calculate changes in the isotopic compositions of whole\nmolecules we must first calculate the change at the site and then\nallow for the rest of the molecule because the isotopic shift is\ndiluted by mixing with carbon that is just along for the\nride....................Hayes, 2002\n\nCompound Specific Isotope Analysis\nm/z 44 mV\n45/44 ratio trace\nCourtesy of John Hayes. Used with permission.\n\nReprinted by permission from Macmillan Publishers Ltd. Katherine H. Freeman,\nJ. M. Hayes, et al. Evidence from Carbon Isotope Measurements for Diverse\nOrigins of Sedimentary Hydrocarbons. Nature 343 (1990): 254-6.\n\nC-isotopic Composition of Individual Organic\nCompounds\nThree major controls\n- Source of carbon and its C-isotopic\ncomposition\n- Fractionation during assimilation (eg\nheterotrophy, photosynthesis, methanotrophy)\n- Fractionation during biosynthesis (lipids)\n\nC-isotopic Composition of Organic Compounds\nSource of carbon and its C-isotopic\ncomposition\n- Inorganic carbon\n- (-7% atm. CO2) assimilated by photosynthesis\nε 5-35 per mil depending on pathway extent of\nconsumption\n\nC-isotopic Composition of Individual Organic\nCompounds\nSource of carbon and its C-isotopic composition\n- Inorganic carbon\n- (-7% atm. CO2) assimilated by photosynthesis\nε 5-35 per mil depending on pathway extent of consumption\n- Organic carbon\n- (-25% on average) assimilated during heterotrophy\nε -1 (you are what you eat plus 1 per mil!!)\n- Methane carbon\n- (-30 to -100%) assimilated during methanotrophy\nε 0-30 per mil depending on pathway and extent of\nconsumption\n\nhttp://www.astrobio.net/news/modules.php?op=modload&name=News&file=article&sid=34\nImage removed due to copyright restrictions.\nCafe Methane\nImage removed due to copyright restrictions.\nImage removed due to copyright restrictions.\nGas hydrates (yellow) are ice with gas trapped\nAt the very edge of the brine pool, the mussels are\ninside; exposed beds are accessible to\nespecially abundant and happy. This area is often filled\nsubmersibles on the deep sea floor of the Gulf of\nwith newly settled baby mussels perched on the shells\nMexico. Ice worms, a new species only seen in\nof larger mussels just above the brine.\nhydrate, were discovered in 1997 by C. Fisher,\nCredit: Penn State University, Dept. of Biology\nPenn State University.\nCredit: I. MacDonald\n\nMethane-rich water is pumped into the\nmussel and across its gills. The symbiotic\nbacteria in the gills use methane as both a\ncarbon and energy source. The mussels, in\nturn, live off the symbiotic bacteria.\nCourtesy of Charles Fisher, Penn State University, Dept. of\nBiology. Used with permission.\nUsing the scanning electron microscope, we can see over a dozen\nmussel gill cells in the panel on the left. On the right is a closer look\nat the cell with its outer membrane partially removed. Look into the\ncell to see hundreds of symbiotic bacteria.\n\nTable 3 removed due to copyright restrictions.\nUsing the scanning electron microscope,\nwe can see over a dozen mussel gill cells\nin the panel on the left. On the right is a\ncloser look at the cell with its outer\nmembrane partially removed. Look into the\ncell to see hundreds of symbiotic bacteria.\nCourtesy of Charles Fisher, Penn State University, Dept. of Biology. Used with permission.\n\nCourtesy Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\n\nLanostane (XVIII; δδ13C: -70%)\nhop-17-(21)-ene XII; δ13C: -32%)\nNorlanostane (XVII; δ13C: -80%),\nCourtesy Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\n\nC-isotopic Composition of Organic Compounds\n- Fractionation during biosynthesis (lipids)\n\nFlow chart s\nhowing kin\netic isotope eff\nect.\nImage by MIT OpenCourseWare.\n\nCourtesy of John Hayes. Used with permission.\n\nThese images have been removed due to copyright restrictions.\nFlows of C at the pyruvate branch point in the metabolism of E. coli grown aerobically on\nglucose (Roberts 1955). 74% of the pyruvate is decarboxylated to yield Ac-CoA. The\nobserved depletion at odd-numbered positions of FAcids is shown at the right indicating that\nthe isotope effect at C-2 in the pyruvate dehydrogenase reaction is 23%\n\nAn important consequence of\nthe pyruvate to acetate isotopic\nfractionation\nAlternate carbons derived from acetate carboxyl\ndown acetogenic lipidbackbones are light. In\ngeneral lipids are also light, but not as light.\nIn contrast, the carboxyl carbon of amino acids is generally\n\"heavy\"\nO\nOH\nC\nO\nOH\nC\n*\n*\n*\n*\n*\n*\n*\n*\n*\nlight\n\nCh\nem\nic\na\nl\nst\nructu\nre pl\not showin\ng two differe\nnt pathways.\nTwo Origins for Isoprenoids\nFigure by MIT OpenCourseWare.\n\nLabelling of isopentenylpyrophosphate\nfrom MVA pathway\n\nLabelling of isopentenylpyrophosphate\nfrom MEP pathway\n\nLabeling of phytol and cholesterol from MVA (a & c)\nand MEP (b & d)\n\nTable showing bios\nynthesis of isoprenoid lipi\nds pathways.\nImage by MIT OpenCourseWare.\n\n2D g\nraph\nsho\nwing\nsta\nbl\ne\nis\noto\npe,\nsuch as Delta13C and Delta15N distributions.\nFigure by MIT OpenCourseWare.\n\n2D\ngra\nph\nsho\nwin\ng D\nelt\na1\n3C\ncha\nngin\ng wi\nth D\nelta\n18O.\nMulti-element,\nCo mpound-specific\nIs otopic Analyses\nVanillin\nFigure by MIT OpenCourseWare.\n\nCharacterising Cocaine Sources\nThese images have been removed\ndue to copyright restrictions.\n\n2D\ngra\nph\nsho\nwin\ng D\nelt\na1\n3C\ncha\nngin\ng wi\nth D\nelta\n18O.\nMulti-element,\nCo mpound-specific\nIs otopic Analyses\nVanillin\nFigure by MIT OpenCourseWare.\n\nTable of\nreservoir\ns of carbon in atm\nosphere, h\nydrosph\ne\nr\ne\n,\n\nand g\neosph\nere.\nImage by MIT OpenCourseWare.\n\nImage courtesy of Mineralogical Society of America. Used with permission.\nFigure 1. Biogeochemical C cycle, showing principal C reservoirs (boxes) in the mantle, crust, oceans and\natmosphere, and showing the processes (arrows) that unite these reservoirs. The range of each of these\nreservoir boxes along the horizontal axis gives a visual estimate of δ13C values most typical of each reservoir.\nThe vertical bars at right indicate the timeframes within which C typically completely traverses each of the four\nC sub-cycles (the HAB, SED, MET and MAN sub-cycles, see text). For example, C can traverse the\nhydrosphere-atmosphere-biosphere (HAB) sub-cycle typically in the time scale between 0 to 1000 years.\n\nImage courtesy of Mineralogical Society of America. Used with permission.\nFigure 2. Biogeochemical C cycle (as in Fig. 1), showing principal C reservoirs (boxes)\nand their isotopic compositions in the mantle, crust, oceans and atmosphere, and the\nprocesses (arrows) that unite these reservoirs. Numbers adjacent to the arrows give\nestimates of present-day fluxes, expressed in the units 1012 mol yr-1.\n\nImage courtesy of Mineralogical Society of America. Used with permission.\nFigure 3. Relationship between isotopic composition (δcarb and δorg) and the fraction of carbon\nburied as organic matter. The vertical separation between the lines depicts εΔ, and thus reflects\nthe combined effects of equilibria between inorganic C species and biological isotope\ndiscrimination (see text). A value εTOC = 30 is depicted here, and represents the long-term\naverage value during the past 800 Ma (Hayes et al. 1999). The vertical line represents the value\nof forg = 0.2, which represents the current value for the global C cycle.\n\nImage courtesy of Mineralogical Society of America. Used with permission.\nFigure 5. Plot of age versus δcarb (crosses) and δorg for Archean and Proterozoic kerogens.\nKerogen data (filled circles) are corrected for the effects of thermal alteration (Des Marais\n1997a). Uncorrected data are shown as open circles. Between 2.2 to 2.0 billion years ago, note\nthe high δcarb values and the virtual disappearance thereafter of δorg values more negative\nthan -36. Other evidence indicates that atmospheric O2 increased substantially at this time (see\ntext).\n\nSecular variation in δ13C of purified\nkerogens (sedimentary organic matter)\nFraction of carbon buried as organic matter\nReprinted by permission from Macmillan Publishers Ltd: Nature.\nSource: David J. Des Marais, Harald Strauss, Roger E. Summons, J.M. Hayes. \"Carbon Isotope Evidence for\nthe Stepwise Oxidation of the Proterozoic environment.\" Nature 359 (1992): 605-9. doi:10.1038/359605a0.\n\nReprinted by permission from Macmillan Publishers Ltd: Nature.\nSource: David J. Des Marais, Harald Strauss, Roger E. Summons, J.M. Hayes. \"Carbon Isotope Evidence for\nthe Stepwise Oxidation of the Proterozoic environment.\" Nature 359 (1992): 605-9. doi:10.1038/359605a0.\n\nImage courtesy of Mineralogical Society of America. Used with permission.\nFigure 8. Range of δcarb and δCO2 values (open boxes) and δorg values (shaded boxes),\ntogether with the processes proposed to explain their distribution prior to 2.2 Ga and\nsubsequent to 2.1 Ga. A temperature of 15°C was assumed for the isotopic equilibrium between\nδcarb and δCO2. The lines associated with the various groups of autotrophic bacteria and\nalgae illustrate the maximum discrimination expected for each group. The sloped line at right\ndepicts declining discrimination over time, perhaps in response to declining CO2 levels.\n\nFigure 11. Neoproterozoic records of\nδcarb (curve a) and δorg (curve b)\nvalues (Hayes et al. 1999).\nCorresponding values for isotopic\nfractionation, εTOC and forg during\nNeoproterozoic time are given by\ncurves c and d, respectively. The\nperiodic negative excursions are\ntypically associated with glacial\nintervals (see text). Figure modified\nfrom Hayes et al. (1999).\nImage courtesy of Mineralogical Society of America. Used with permission.\n\nImage courtesy of Mineralogical Society of America. Used with permission.\nFigure 7. The biogeochemical C cycle prior to the advent of oxygenic photosynthesis, showing\nthe much lower global primary productivity and the higher rates of thermal emanation of C (see\ntext). Comparison with Figure 5 illustrates the enhancement of global primary productivity due to\nthe development of oxygenic photosynthesis. Flux estimates are highly approximate, and are\nshown principally to illustrate the direction and magnitude of change over geologic time.\n\nBiosynthesis of Organic Compounds\nAutotrophs\n13C\n----\n12C\nCarbon Source\nIntermediate\nLipids\n------------------------\nStraight- Polyisoprenoidal\nChain\nCO2\nPhotosynthate\nεP\nεb\nεb\n3%\n\nBiosynthesis, heterotrophs\nBiosynthesis of Organic Compounds\n13C\n----\n12C\nCarbon Source\nIntermediate\nLipids\n------------------------\nStraight- Polyisoprenoidal\nChain\nHeterotrophs\nMetabolites\nεb\nOrganic\nMatter\nno\nacyclic\nisoprenoids\n≈ 3%\n\nCell-Sediment\nCell\nδ, %\nNucleic Acids\nProteins\nCarbohydrates\nPlastidic Isoprenoids\nResistant Biopolymer\nAcetogenic Lipids\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geology\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/b15e7651818cd91f2b659695e5e238da_MIT12_007S13_Lec7.pdf",
      "content": "Acid-base reactions\nConcepts: chemical equilibrium, energetics of acid-base reactions, carbonate equilibria, alkalinity,\nmineral precipitation, the influence of pH and environmental redox state on the formation of\nminerals, precipitation and dissolution of carbonates in surface and deep ocean and sediments,\nweathering of carbonates and silicates, T/CO2/weathering feedback\n\nReadings: Morel and Hering, Aquatic chemistry, Ridgwell and Zeebe, 2005\nHomework: problem set will be posted on-line\n\nSoils are products of weathering\nhttp://en.wikipedia.org/wiki/File:Stagnogley.JPG.\nThis imag\ne shows 4\nsoil hor\nizons.\nImage by MIT OpenCourseWare.\n\nCaliche- calcium carbonate deposits in\nsoils\n\nhttp://en.wikipedia.org/wiki/File:San-miguel-\nisland-caliche.jpg\n\nGibbs free energy: work obtainable from an isothermal\nsystem at p=constant\n\nG is minimized in equilibrium\n\nG=0 in equilibrium for either direction so\n\nG0 (the energy to assemble the system from a reference\npoint - enthalpy or standard free energy of change)\n\nis equal to -RTlnK (change in entropy)\n\nG0/RT= - lnK where K is the equilibrium constant\n\nIn general: G = G0 + RTlnQ (removed from equilibrium)\n\nDISSOLVED INORGANIC CARBON SPECIES\n2D\npl\not s\nh\nowi\nng\nth\ne\n\nr\ne\nl\na\nt\niv\ne\ndis\ntri\nbut\nion\nof\ndi\nsso\nlve\nd i\nnor\nganic carbon species.\nImage by MIT OpenCourseWare.\n\nCO2 is dissolved in water in the presence of a strong base\n\nAlkalinity: net concentration of strong base in excess of strong acid\n\nAlk= excess negative charge from weak acids\n\nAlk = -[H+]+ [OH-]+ [HCO -]+2[C\n2-\nO3 ]=[STRONG BASE]T\n\npH OF SEAWATER\n\nTotal Molar Composition of Seawater (Salinity = 35) Component Concentration\n(mol/kg)\n\nH2O\n53.6\nCl\n0.546\nNa+\n0.469\nMg2+\n0.0528\nSO\n0.0282\nCa2+\n0.0103\nK+\n0.0102\nCT\n0.00206\nBr\n0.000844\nBT 0.000416\nSr2+\n0.000091\nF\n0.000068\n\nCa+2 and Mg+2\nTable showing Ca, Mg and SO4 cha\nnging in the ocean.\nImage by MIT OpenCourseWare.\n\nCommon Ca-carbonate minerals\nARAGONITE\nCALCITE\nDOLOMITE\nThese two photos have been removed due to copyright restrictions.\nPlease see the photo on\nImage courtesy of USGS.\nFrom public domain.\nhttp://www.galleries.com/minerals/\ncarbonat/dolomite/dolomite.jpg.\n\nCarbonate grains\nOOIDS\nPELOIDS\nONCOIDS\nSKELETAL FRAGMENTS\nMUD\nThis image has been removed due to copyright\nrestrictions. Please see the photo on http://en.\nwikipedia.org/wiki/File:Oncolites.jpg.\nhttp://en.wikipedia.org/wiki/File:\nPeloidsCarboniferousNV.jpg\nThis image has been removed due to copyright restrictions.\nPlease see the photo on http://www.earth.ox.ac.uk/%7Eoesis\n/micro/medium/limestone-xpl_pm14-09.jpg.\nThis image has been removed due to\ncopyright restrictions.\n\nCarbonate bank\nCarbonate\nbank showi\nng shelf e\ndge\n, b\narri\ner,\nlagoon\n, etc.\nImage by MIT OpenCourseWare.\n\nReefs\nFigure of reefs sho\nwing different zone\nof reefs.\nImage by MIT OpenCourseWare.\n\nEvaporate sequence and mineral solubility in\nsalterns\nHalite (NaCl) : Ks=101.5\nCalcite: Ks=10-8.35\nGypsum: Ks=10-4.6\nWater flows in a cascade from the shallow ponds where calcite/dolomite precipitate,\nto ponds where gypsum precipitates, to ponds where NaCl precipitates (now devoid of other\nminerals).\n\nEvaporitic shallow lagoon\nTan layer: calcium carbonate precipitated out of the solution\n\nKerogen preserved in CaCO3\n\n(Cohen et al., submitted)\n\nExtracted kerogen\n\n(Cohen et al., submitted)\n\nBacterial fossils preserved in chert\n(SiO2)\nImage courtesy of ucmp.berkeley.edu. Used with permission.\n\nWEATHERING OF SILICATE ROCKS\nK2O.Al2O .\n3 6SiO2 (s) + 2CO2 (aq) + 2.4 H2O=\n2K+ + 2HCO -\n3 + Al2O .\n3 2SiO2 (s) + 2.6SiO2(s) +\n1.4H2SiO3 (aq)\n\nIgneous rock + CO2 + water = cations + clays + silicic\nacid + silica dioxide\n\nWeathering of silicates removes CO2 from the\nsurface\n\nCarbon Cycle Fluxes and 13C Values\nAtmosphere\n778 (-7%)\nSurface Ocean\nFossil Fuels\nLand biota\n600 (1%)\n5,000 (-25%)\n1,600 (-25%)\nDissolved bicarbonate\nTerrestrial soils\ndeep ocean\n1,600 (-25%)\n36,000 (0%)\n0.05\n0.3\n0.5\nOrganic C in seds/rocks\nMarine carbonate seds\n15,000,000 (-25%)\n2,500 (0%)\n0.7\n0.05\n0.2\nAtmosphere\n0.06-0.7\nCarbonate rocks\n0.03\n778 (-7%)\nMantle\n60,000,000 (0-1%)\n324,000,000 (-5%)\n0.7\nContinental Crust\n7,000,000 (-5%)\nFLUXES IN GIGATONS OF CARBON/YEAR\n\nThese tables have been removed due to copyright restrictions. Please see Table 3.1 and 3.2\nin the book: Fundamentals of Geobiology. ISBN: 9781405187527.\n\nMycorrhizal fungi - promoters of\nweathering\nThese images have been removed due to copyright restrictions.\n\n.\n.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/5a8a6e62c1776581910c02c9eb4817d0_MIT12_007S13_Lec8.pdf",
      "content": "1The relative distribution of dissolved inorganic carbon species.\nDISSOLVED INORGANIC CARBON SPECIES\n2D\npl\not s\nh\nowi\nng\nth\ne\n\nr\ne\nl\na\nt\niv\ne\ndis\ntri\nbut\nion\nof\ndi\nsso\nlve\nd i\nnor\nganic carbon species.\nThe relative distribution of the three major species of dissolved inorganic carbon in water as a function of pH. Note\nthat at pH of seawater (~8.1), approximately 95% of the inorganic carbon is in the form of bicarbonate anion.\nImage by MIT OpenCourseWare.\n\nAtmosphere\n778 (-7%)\nMarine carbonate seds\n2,500 (0%)\nMantle\n324,000,000 (-5%)\nContinental Crust\n7,000,000 (-5%)\nOrganic C in seds/rocks\n15,000,000 (-25%)\nCarbonate rocks\n60,000,000 (0-1%)\nTerrestrial soils\n1,600 (-25%)\nDissolved bicarbonate\ndeep ocean\n36,000 (0%)\nSurface Ocean\n600 (1%)\nFossil Fuels\n5,000 (-25%)\nLand biota\n1,600 (-25%)\nAtmosphere\n778 (-7%)\n0.05\n0.7\n0.06-0.7\n0.3\n0.5\n0.03\n0.7\n0.05\n0.2\nCarbon Cycle Fluxes and δ13C Values\nFLUXES IN GIGATONS OF CARBON/YEAR\n\nThese tables have been removed due to copyright restrictions. Please see Table 3.1 and 3.2\nin the book: Fundamentals of Geobiology. ISBN: 9781405187527.\n\nConcepts: thermodynamic basis of microbial growth, sources of energy for microbial\ngrowth, utilization of natural chemical and light gradients, chemical profiles in aquatic\nenvironments and sediments, microbial processes and redox evolution of the\nenvironment, prediction of metabolisms supported by different environments, the\ninfluence of pH and environmental redox state on the formation of minerals\n\nReading: Brock Biology of Microorganisms, Morel and Hering, Aquatic chemistry,\nOremland et al. The microbial arsenic cycle in Mono Lake, California (2004), Lavik et al.\n(2009), Dolfing et al. (2008)\n\nRedox reactions\n\nThis image has been removed due to copyright restrictions. Please see the image on\nhttp://www.awi.de/fileadmin/user_upload/News/Press_Releases/2008/3._Quartal/Sedimentkerne_p.jg.\n\nhttp://soundwaves.usgs.gov/2012/10/images/Methane3SulfidicMudDES-lg.jpg 6\n\nImage courtesy of DOE.\n(Kessler et al., 2011)\n\nAcid-mine drainage\nThiobacillus ferooxidans\n\nImage courtesy of NASA.\n\nThis image has been removed due to copyright restrictions. Please see the image on:\nhttp://www.torinoscienza.it/img/200x200/it/s00/00/0004/0000048c.png.\n\nEnergy Electrons Carbon\nPhoto-\nOrgano-\nHetero-\nLitho-\nAuto-\nChemo-\nOrgano-\nHetero-\nLitho-\nAuto-\nMixotrophs: mixed sources of energy/carbon\n\nATP - energy currency of the cell\n\nATP SYNTHASE\nThis image has been removed due to copyright restrictions. Please see the image on:\nhttp://www.bio.davidson.edu/courses/molbio/molstudents/spring2005/carlson/atp%20synthase1.html.\n\nRedox reactions- terminology\n-\nRedox couple: any pair of species that have the same element in different\noxidation states is a redox couple\n\n-\nFaraday constant: charge of 1 mole of electrons (96500 C)\n\n-\nStandard free energy of a reaction: 1 mole of reactants, std. conditions\n\n-\nReductant: e- donor\n\n-\nOxidant: e- acceptor\n\n-\nOxidation: loss of e-\n\n-\nReduction: gain of e-\n\n5 rules for determining the formal charge of an atom\n1. The elementary state has a redox state of 0\n\nH2, O2, S0\n2. The oxidation state is equal to an ion's charge\n\nFe3+ = 3, H+ = 1\n\n3. In most compounds... O = -2 and H = +1\n\n4. A neutral molecule has zero net redox state\n\nH2O\n5. A charged species has net redox state equal to its charge\n\nOH- = -1\n\nSteps for balancing redox reactions\n1. Write the unbalanced half-reactions for the oxidation and reduction\n2. Balance all elements other than H and O\n3. Balance O with H2O molecules\n4. Balance H with H+ ions\n5. Balance charge with e-\n6. Balance number of e- in two half-reactions\n7. Add the two half-reactions\n8. Adjust for pH if necessary\n9. Check that charge and atoms balance\n\n+\npe0\npe\nAdapted from The\nP680* P680+\nCarl Sagan Lecture\nBy Joe Kirschvink\nCH2 O CO2\n-10\n\nCO2\nCH2 O\n+\nH2\nH\n+\nH\nH2\n+\nNH4\nN2\n+\nN\nNH\n\nCH4\nCO2\nCO2\nCH4\nH2 S S\nS H2 S\nH2 S SO2 -\n2 -\nSO4\nH2 S\nFe\n2+\n\nFe(OH)\n2+\n\nFe\n\nFe(OH)3\n\nOXIDATION\n+\n-\n+\nNH4\nNO3\nNO3\nNH4\nNO\nNO\nNO -\n\nNO2\nMn2+\nMnO\nMnO2\nMn2\n+\nCO CO2\nCO2\nCO\n+10\nN\n\nNO\n-\n\nNO -\nN2\nH2 O O2\nO2\nH2 O\n+\nP680\nP680\n-\nCourtesy of Joe Kirschvink. Used with permission.\n\nEnergy Electrons Carbon\nPhoto-\nOrgano-\nHetero-\nLitho-\nAuto-\nChemo-\nOrgano-\nHetero-\nLitho-\nAuto-\nMixotrophs: mixed sources of energy/carbon\n\nThe electron tower generally explains porewater chemistry\nLake Michigan Sediment\nBlack Sea\n\nExample of an anaerobic metabolism: Microbial growth in Mono Lake, CA\n(c) Google. All rights reserved. This content is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nImage courtesy of USGS.\n\nImage courtesy of State of California.\n\nThis table has been removed due to copyright restrictions. Please see Table 3B-2 on page\nhttp://www.monobasinresearch.org/images/mbeir/dchapter3/table3b-2.pdf.\n\nThis image has been removed due to copyright restrictions. Please see Figure 3 (a) on page\nhttp://onlinelibrary.wiley.com/doi/10.1016/j.femsec.2003.12.016/full.\n\nThese images have been removed due to copyright restrictions. Please see Figure 3 (b) and\n(c) on page http://onlinelibrary.wiley.com/doi/10.1016/j.femsec.2003.12.016/full.\n\nThis table has been removed due to copyright restrictions. Please see Table 2 on page\nhttp://onlinelibrary.wiley.com/doi/10.1016/j.femsec.2003.12.016/full.\n(Oremland et al., 2004)\n\n(Oremland et al., 2004)\nReaction formula for l\na\ncta\nt\ne and acetate.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/05ce17a5d97177fc3c8ce653a045e92b_MIT12_007S13_Lec9.pdf",
      "content": "ENVIRONMENTAL REDOX AND\nPHOTOSYNTHESIS\nConcepts: Biogeochemical gradients according to the electron\ntower, redox calculations, anaerobic metabolisms,\nphotosynthetic electron donors, anoxygenic and oxygenic\nphotosynthesis, electron transport in photosynthetic\norganisms, photosynthetic pigments and reaction centers,\ngeological record of oxygenic and anoxygenic photosynthesis.\n\npe0\nCO 2\nCO 2\nCO\nCO 2\nCH 2 O\npe\nTION\n- 10\n+10\nCO 2\nCO 2\nCO 2\nCH 4\nH\nH\nH 2\nH) 3\nFe(OH) 3\nFe\n680 +\nP680\n+\nP680\nS\nS H 2 S\nN 2\n+\n+\nN 2\nNH 4\n+\n2 -\nO 4\n2 -\nSO 4\nH 2 S\nNO 3\nNO 2\n-\n-\n2+\nnO 2\nMnO 2\nMn 2 +\nO 3\nO 2\nO 2\nH 2 O\nO 3\n+\n-\nNO 3\nN 2\nO 3\n-\nNO 3\nNH 4\n-\n+\nCO\nOXIDA\nCH 2 O\nCH 4\nH 2\nFe\nFe(O\nP680* P\nH 2 S\nNH 4\n+\nH 2 S S\n2+\nMn 2+\nM\nN\nN\nH 2 O\nNH 4\nN\n+\nNO 2 N\nAdapted from The\nCarl Sagan Lecture\nBy Joe Kirschvink\nCourtesy of Joe Kirschvink. Used with permission.\n\nThe electron tower generally explains porewater chemistry\nLake Michigan Sediment\nBlack Sea\n\nExample of an anaerobic metabolism: Microbial growth in Mono Lake, CA\n(c) Google. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nImage courtesy of USGS.\n\nImage courtesy of State of California.\n\nThis table has been removed due to copyright restrictions. Please see Table 3B-2 on page\nhttp://www.monobasinresearch.org/images/mbeir/dchapter3/table3b-2.pdf.\n\n(Oremland et al., 2000)\nThis image has been removed due to copyright restrictions. Please see Figure 3 (a)\non page http://onlinelibrary.wiley.com/doi/10.1016/j.femsec.2003.12.016/full.\n\n(Oremland et al., 2000)\nThese images have been removed due to copyright restrictions. Please see Figure 3 (b) and (c)\non page http://onlinelibrary.wiley.com/doi/10.1016/j.femsec.2003.12.016/full.\n\n(Oremland et al., 2004)\nReaction formula for l\na\ncta\nt\ne and acetate.\nImage by MIT OpenCourseWare.\n\n(Oremland et al., 2004)\nThis table has been removed due to copyright restrictions. Please see Table 2 on\npage http://onlinelibrary.wiley.com/doi/10.1016/j.femsec.2003.12.016/full.\n\nTHERE IS ~10,000 TIMES MORE SOLAR POWER THAN ALL OTHER SOURCES\n\npe0\nO CO 2\nCO 2\nCO\nCO 2\nCH 2 O\nOXIDATION\n- 10\n+10\nH 2 O CO 2\nCH 4\nCO 2\nCO 2\nCH 4\nH 2\nH\nH\nH 2\nFe(OH) 3\nFe(OH) 3\nFe\n0* P680 +\nP680\n+\nP680\nH 2 S S\nS H 2 S\nNH 4\nN 2\n+\n+\n+\nN 2\nNH 4\n+\n2 -\n2 S SO 4\n2 -\nSO 4\nH 2 S\nNO 3\nNO 2\n-\n-\n+\n2+\n2+\nMnO 2\nMnO 2\nMn 2 +\nN\nNO 3\nH 2 O O 2\nO 2\nH 2 O\nH 4\nNO 3\n+\n+\n-\nNO 3\nN 2\nO 2 NO 3\n-\nNO 3\nNH 4\n-\n+\nC\npe\nC\nFe\nP68\nH\nMn\nN\nN\nAdapted from The\nCarl Sagan Lecture\nBy Joe Kirschvink\nCourtesy of Joe Kirschvink. Used with permission.\n\nH2O + CO2 CH2O + O2\nThis image has been removed due to copyright restrictions. Please see\nthe image on page http://en.academic.ru/dic.nsf/enwiki/365148.A graph of the Sun.A graph of woody plants.\nImage by MIT OpenCourseWare.\nImage by MIT OpenCourseWare.\n\nH2A + CO2 CH2O + A\n\nA = Fe2+, H2, S, H2S, ...\n\nThis image has been removed due to copyright restrictions. Please see\nthe image on page http://www.rsc.org/chemistryworld/Issues/2007/\nMay/PhotosynthesisWorksQuantumComputing.asp.A graph of the Sun.\nImage by MIT OpenCourseWare.\n\npe0\nCO 2\nCO 2\nCO\nCO 2\nCH 2 O\nDATION\n- 10\n+10\nCO 2\n\nCO 2\nCO 2\nCH 4\nH\nH\nH 2\ne(OH) 3\nFe(OH) 3\nFe\nP680 +\nP680\n+\nP680\n2 S S\nS H 2 S\nN 2\n+\n+\n+\nN 2\nNH 4\n+\n2 -\nSO 4\n2 -\nSO 4\nH 2 S\nNO 3\nNO 2\n-\n-\n2+\nMnO 2\nMnO 2\nMn 2 +\nNO 3\n\nO O 2\nO 2\nH 2 O\nNO 3\n+\n-\nNO 3\nN 2\nNO 3\n-\nNO 3\nNH 4\n-\n+\nCO\npe\nOXI\nCH 2 O\nCH 4\nH\nFe\nF\n680*\nH\nNH\nH 2 S\n2+\nMn 2+\nN 2\nH 2\nNH 4\n+\nNO 2\nAdapted from The\nP\nCarl Sagan Lecture\nBy Joe Kirschvink\nCourtesy of Joe Kirschvink. Used with permission.\n\nElectron transport in purple bacteria\nThis image has been removed due to copyright restrictions. Please see the image\non page http://www.ugr.es/~eianez/Microbiologia/images/10fotanoxi.JPG.\n\nPHOTOSYNTHETIC REACTION CENTER\n(c) sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. Fo\n\nr more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nZ- Scheme of electron transport in cyanobacteria\nand green plants\nThis image has been removed due to copyright restrictions. Please see the image on page\nhttp://biochimej.univangers.fr/Page2/COURS/Zsuite/2Photosynthese/6SchemaZ/3Figures/2SchemaZHorton.gif.\n\nThis image has been removed due to copyright restrictions. Please see the image on page\nhttp://biology200.gsu.edu/houghton/2107%20'13/Figures/Chapter8/figure8.14.jpg.\n\nMAJOR PHOTOSYNTHETIC PIGMENTS\nBACTERIOCHLOROPHYLL A\nAnoxygenic\nCHLOROPHYLL A\nOxygenic\n\nProgressive evolution of tetrapyrole ring system for\nhigher energy, lower λ excitation\nChemical structures of (a) bacteriochlorophyll a and (b) chlorophyll a. Differences in the structures are shown in red.\nChemical structures of (c) 3-acetyl-chlorophyll a and (d) chlorophyll d. R is the phytyl tail.\n\nPhylogeny of bch and chl genes\n(c) sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. Fo\n\nr more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nEvolutionary stages of oxygen evolution capacity (OEC). Four stages are depicted, although additional\nintermediate stages undoubtedly also existed. For each stage, the upper diagram shows an energetic\npicture, and the lower diagram a schematic of the reaction center protein in the photosynthetic\nmembrane.\nEvolving pigment and redox components\nFe 2+\nor S2-\nFe 3+\nor S0\nIncreasing\nexcitation energy\nand yield\nAncestral\nPurple\nBacterium\nIncorporated\nfrom a Green S-\nBacterium ??\n(c) 1998 Elsevier Science Ltd. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\n500 million years\nO2\n\nKARIJINI NATIONAL PARK -WESTERN AUSTRALIA\n\nBANDED IRON\n\nThis image has been removed due to copyright restrictions. Please see the photo of rock in paper below.\nMojzsis, Stephen James, Gustaf Arrhenius, et al. \"Evidence for Life on Earth Before 3,800\nMillion Years Ago.\" Nature 384, no. 6604 (1996): 55-9.\n\nPrecambrian Banded Iron Formations (BIFs)\n(Adapted from Klein & Beukes, 1992)\nTime Before Present (Billion Years)\n3.5\n2.5\n1.5\n0.5\n1.0\n2.0\n3.0\n4.0\nAbundance of BIF Relative\nto Hamersly Group as Max.\nRapitan, Canada\nUrucum, Brazil\nDamara, Namibia\nLabrador, Canada\nKrivoy Rog, Russia\nLake Superior, USA\nTransvaal, S. Africa\nHamersley, W. Australia\nCanadian Greenstone Belts &\nYilgaran Block, W. Australia\nZimbabwe, Ukraine,\nVenezuela, W. Australia\nIsua, West\nGreenland\nPaleoproterozoic (Huronian) Snowball Earth\nPongola Glaciation, Swaziland\n(snowball??)\nNeoproterozoic\nSnowball Earths\n\nCourtesy of Joe Kirschvink. Used with permission.\n\nRed beds\nPhotos: Kansas Geological Survey\n\nPaleosols\nThis image has been removed due to copyright restrictions. Please see the image\non http://www.gly.uga.edu/railsback/FieldImages/BadlandsPaleosol.jpeg.\nThis image has been removed due to copyright restrictions. Please see the image on\nhttp://www.gly.uga.edu/railsback/FieldImages/OrgeonBasaltPaleosol1.jpeg.\n\nFe2+ + CO2 CH2O + 4FeOOH\nFe2+\nFe2+\n(Canfield et al. 2006, Kharecha et al. 2005, Kappler et al. 2005)\nPhotic zone A graph of the Sun.\nImage by MIT OpenCourseWare.\n\nH2O + CO2 CH2O + O2\nPhotic zone A graph of the Sun.\nImage by MIT OpenCourseWare.\n\n500 million years\nO2\nThis image has been removed due to copyright restrictions. Please see\nthe image on page http://en.academic.ru/dic.nsf/enwiki/365148.A graph of woody plants.\nImage by MIT OpenCourseWare.\n\nCHLOROPHYLL-C PLANKTON\nDIATOMS\nCOCCOLITHOPHORIDS\nThis image has been removed due to copyright restrictions. Please see the\nThis image has been removed due to copyright restrictions. Please see\nimage on http://m.harunyahya.com/Image/guncelyorumlar/diatomm1.jpg.\nthe image on http://www.boostdam.net/SIO/coccolithophorids.jpg.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Geobiology, Lecture Notes 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-007-geobiology-spring-2013/c2843117623610bf103261d3f7395189_MIT12_007S13_Lec10.pdf",
      "content": "ENVIRONMENTAL REDOX AND\nPHOTOSYNTHESIS\nConcepts: Biogeochemical gradients according to the electron\ntower, redox calculations, anaerobic metabolisms,\nphotosynthetic electron donors, anoxygenic and oxygenic\nphotosynthesis, electron transport in photosynthetic\norganisms, photosynthetic pigments and reaction centers,\ngeological record of oxygenic and anoxygenic photosynthesis.\n\nElectron transport in purple bacteria\n\nThis image has been removed due to copyright restrictions. Please see the image\non page http://www.ugr.es/~eianez/Microbiologia/images/10fotanoxi.JPG.\n\nZ- Scheme of electron transport in cyanobacteria\nand green plants\nThis image has been removed due to copyright restrictions. Please see the image on page\nhttp://biochimej.univangers.fr/Page2/COURS/Zsuite/2Photosynthese/6SchemaZ/3Figures/2SchemaZH orton.gif.\n\nThis image has been removed due to copyright restrictions. Please see the image on page\nhttp://biology200.gsu.edu/houghton/2107%20'13/Figures/Chapter8/figure8.14.jpg.\n\nMAJOR PHOTOSYNTHETIC PIGMENTS\nBACTERIOCHLOROPHYLL A\nAnoxygenic\nCHLOROPHYLL A\nOxygenic\n\nProgressive evolution of tetrapyrole ring system for\nhigher energy, lower λ excitation\nChemical structures of (a) bacteriochlorophyll a and (b) chlorophyll a. Differences in the structures are shown in red.\nChemical structures of (c) 3-acetyl-chlorophyll a and (d) chlorophyll d. R is the phytyl tail.\n\nPhylogeny of bch and chl genes\n(c) sources unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nIncreasing\nexcitation energy\nAncestral\nand yield\nPurple\nBacterium\nFe 2+\nIncorporated\nor S2-\n3+\nfrom a Green S-\nFe\nB cterium ??\nor S0\na\nEvolving pigment and redox components\n(c) 1998 Elsevier Science Ltd. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\nEvolutionary stages of\noxygen evolution capacity (OEC). Four stages are depicted, although additional\nintermediate stages undoubtedly also existed. For each stage, the upper diagram shows an energetic\npicture, and the lower diagram a schematic of the reaction center protein in the photosynthetic\nmembrane.\n\n500 million years\nO2\n\nMODERN ANOXYGENIC PHOTOSYNTHETIC BACTERIA\nIN DEEPER LAYERS OF MICROBIAL MATS\nThis image has been removed due to copyright restrictions. Please see the image\non http://www.montana.edu/cpa/news/hires.php?img=1805&ArtID=4997.\n\nMODERN ANOXYGENIC PHOTOSYNTHETIC BACTERIA\nIN THE WATER COLUMNS OF MEROMICTIC LAKES\nThis image has been removed due to copyright restrictions.\n\nAn obligately photosynthetic bacterial anaerobe from a deep-sea hydrothermal vent\n\nCopyright (c) 2005 National Academy of Sciences, U.S.A. Source: Beatty, J. T., et al. \"An Obligately\nPhotosynthetic Pacterial Anaerobe from a Deep-Sea Hydrothermal Vent.\" PNAS 102 (2005): 9306-10.\nBeatty J T et al. PNAS 2005;102:9306-9310\n(c)2005 by National Academy of Sciences\nBeatty J T et al. PNAS 2005;102:9306-9310\nCopyright (c) 2005 National Academy of Sciences, U.S.A. Source: Beatty, J. T., et al. \"An Obligately\nPhotosynthetic Pacterial Anaerobe from a Deep-Sea Hydrothermal Vent.\" PNAS 102 (2005): 9306-10.\n\nKARIJINI NATIONAL PARK -WESTERN AUSTRALIA\n\nBANDED IRON\n\nThis image has been removed due to copyright restrictions. Please see the photo of rock in paper\nbelow. Mojzsis, Stephen James, Gustaf Arrhenius, et al. \"Evidence for Life on Earth Before 3,800\nMillion Years Ago.\" Nature 384, no. 6604 (1996): 55-9.\n\nPrecambrian Banded Iron Formations (BIFs)\n(Adapted from Klein & Beukes, 1992)\n\n.\ne\nv\nax\ni\nM\nat\n\nCanadian Greenstone Belts & Hamersley, W. Australia\nel\nas\nR\nYilgaran Block, W. Australia\n\nTransvaal, S. Africa\nF\nI\noup\nPongola Glaciation, Swaziland\nPaleoproterozoic (Huronian) Snowball Earth\nB\nr\n\nG\n(snowball??)\nLake Superior, USA\nof\nyl\nZimbabwe, Ukraine,\nKrivoy Rog, Russia\nNeoproterozoic\ne\nbundanc\ns\nVenezuela, W. Australia\nSnowball Earths\ner\nLabrador, Canada\nam\nIsua, West\nRapitan, Canada\nGreenland\nH\nUrucum, Brazil\no\nDamara, Namibia\nA\nt\n4.0\n3.5\n3.0\n2.5\n2.0\n1.5\n1.0\n0.5\nTime Before Present (Billion Years)\nCourtesy of Joe Kirschvink. Used with permission.\nCourtesy Joe Kirschvink, CalTech\n\nRed beds\nPhotos: Kansas Geological Survey\n\nPaleosols\nThis image has been removed due to copyright restrictions. Please see the image\non http://www.gly.uga.edu/railsback/FieldImages/BadlandsPaleosol.jpeg.\n\nThis image has been removed due to copyright restrictions. Please see the image\non http://www.gly.uga.edu/railsback/FieldImages/OrgeonBasaltPaleosol1.jpeg.\n\nFe2+ + CO2 CH2O + 4FeOOH\nFe2+\nFe2+\n(Canfield et al. 2006, Kharecha et al. 2005, Kappler et al. 2005)\nPhotic zone\n19A graph of the Sun.\nImage by MIT OpenCourseWare.\n\nH2O + CO2 CH2O + O2\nPhotic zone\n20A graph of the Sun.\nImage by MIT OpenCourseWare.\n\nSTROMATOLITE RECORD OF MICROBIAL INTERACTIONS WIT\nSEDIMENTS\nThis image has been removed due to copyright restrictions.Please see Figure 1 on page\nhttp://www.annualreviews.org/doi/full/10.1146/annurev-earth-042711-105327.\nH\nBosak et al., 2013\n\nAllwood et al. 2007\n3.4 Ga\n1.2 Ga\nPhoto: P. Hoffman\nJones et al. 1998\n1 mm\nmodern\n=\n?\n=\n?\nSTROMATOLITES AS INDICATORS OF MICROBIAL PROCESSES\n(c) Abigail Allwood, Paul Hoffman, et al. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nancient\nmodern\n(2.7Ga)\nJones et al. 1998\n1cm\nregularly occurring inter-column laminae\n(c) copyright owners. All rights reserved. This content is excluded from our Creative Flannery et al., 2012\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nSTROMATOLITE MORPHOLOGY AND OXYGENIC PHOTOSYNTHES\nAT 2.7 GA?\nThis image has been removed due to copyright restrictions. Please see Figure 9 in\npaper online at http://www.mdpi.com/2076-3263/2/4/235.\nIS\nSim et al. 2012\n\nSTROMATOLITE MORPHOLOGY AND OXYGENIC PHOTOSYNTHESI\nAT 2.7 GA?\n(c) mdpi.com. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\nSim et al. 2012\nS\n\nSTROMATOLITE MORPHOLOGY AND OXYGENIC PHOTOSYNTHESI\nAT 2.7 GA?\nThis image has been removed due to copyright restrictions. Please see Figure 6 on page\nhttp://www.annualreviews.org/doi/full/10.1146/annurev-earth-042711-105327.\nS\nBosak et al. 2013\n\n500 million years\nO2\nThis image has been removed due to copyright\nrestrictions. Please see the image on page\nhttp://en.academic.ru/dic.nsf/enwiki/365148.\n27A graph of woody plants.\nImage by MIT OpenCourseWare.\n\nCHLOROPHYLL-C PLANKTON\nDIATOMS\nCOCCOLITHOPHORIDS\n\nThis image has been removed due to copyright restrictions. Please see the\nThis image has been removed due to copyright restrictions. Please see\nimage on http://m.harunyahya.com/Image/guncelyorumlar/diatomm1.jpg.\nthe image on http://www.boostdam.net/SIO/coccolithophorids.jpg.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n12.007 Geobiology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}