{
  "course_name": "Geometry of Manifolds",
  "course_description": "No description found.",
  "topics": [
    "Mathematics",
    "Differential Equations",
    "Linear Algebra",
    "Topology and Geometry",
    "Mathematics",
    "Differential Equations",
    "Linear Algebra",
    "Topology and Geometry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis is a second-semester graduate course on the geometry of manifolds. The main emphasis is on the geometry of symplectic manifolds, but the material also includes long digressions into complex geometry and the geometry of 4-manifolds, with special emphasis on topological considerations.\n\nMain Topics\n\nReview of differential forms and de Rham cohomology\n\nSymplectic manifolds; symplectomorphisms; Lagrangian submanifolds\n\nDarboux and Moser theorems, Lagrangian neighborhood theorem\n\nComplex vector bundles\n\nAlmost-complex structures, compatibility, integrability\n\nKahler manifolds, Dolbeault cohomology, Hodge theory, projective embeddings\n\nSmooth 4-manifolds, intersection pairing, topological invariants\n\nSmooth 4-manifolds vs. symplectic 4-manifolds vs. complex surfaces\n\nThe symplectic geometry part of the course follows the book by Ana Cannas da Silva, Lectures on Symplectic Geometry (Lecture Notes in Mathematics 1764, Springer-Verlag); the discussion of Kahler geometry mostly follows the book by R. O. Wells, Differential Analysis on Complex Manifolds (Springer GTM 65).\n\nPrerequisites\n\nGeometry of Manifolds (18.965) or equivalent: manifolds, vector fields, differential forms, vector bundles, homology, cohomology.\n\nHomework\n\nGrading for this course is based on homework. Homework assignments are due every 3 weeks or so.\n\nTexts\n\nThere is no required text. The following references are useful:\n\nCannas da Silva, A.\nLectures on Symplectic Geometry (Lecture Notes in Mathematics)\n. New York City, NY: Springer, 2001. ISBN: 9783540421955.\n\nWells, R. O.\nDifferential Analysis on Complex Manifolds\n. New York City, NY: Springer, 1980. ISBN: 9780387904191.\n\nMcDuff, D., and D. Salamon.\nIntroduction to Symplectic Topology\n. New York City, NY: Oxford University Press, 1999. ISBN: 9780198504511.\n\nMorgan, J. W.\nThe Seiberg-Witten Equations and Applications to the Topology of Smooth Four-Manifolds (Mathematical Notes 44)\n. Princeton, NJ: Princeton University Press, 1995, ISBN: 9780691025971.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nReview of differential forms, Lie derivative, and de Rham cohomology.\n\nCup-product and Poincare duality in de Rham cohomology; symplectic vector spaces and linear algebra; symplectic manifolds, first examples; symplectomorphisms\n\nSymplectic form on the cotangent bundle; symplectic and Lagrangian submanifolds; conormal bundles; graphs of symplectomorphisms as Lagrangian submanifolds in products; isotopies and vector fields; Hamiltonian vector fields; classical mechanics\n\nSymplectic vector fields, flux; isotopy and deformation equivalence; Moser's theorem; Darboux's theorem\n\nTubular neighborhoods; local version of Moser's theorem; Weinstein's neighborhood theorem\n\nTangent space to the group of symplectomorphisms; fixed points of symplectomorphisms; Arnold's conjecture; Morse theory: Gradient trajectories, Morse complex, homology; action functional on the loop space, and the basic idea of Floer homology\n\nMore Floer homology; almost-complex structures; compatibility with a symplectic structure; polar decomposition; compatible triples\n\nHomework 1 due\n\nAlmost-complex structures: Existence and contractibility; almost-complex submanifolds vs. symplectic submanifolds; Sp(2n), O(2n), GL(n,C), and U(n); connections: definition, connection 1-form\n\nHorizontal distributions; metric connections; curvature of a connection: Intrinsic definition; expression in terms of connection 1-form\n\nTwisted de Rham operator; Levi-Civita connection on (TM,g); Chern classes of complex vector bundles (via curvature and Chern-Weil); Euler class and top Chern class\n\nNaturality properties of Chern classes and topological definition; equivalence between the two definitions; classification of complex line bundles\n\nChern classes of the tangent bundle; cohomological criterion for existence of almost-complex structures on a 4-manifold, examples; splitting of tangent and cotangent bundles of (M,J), types; complex manifolds, Dolbeault cohomology\n\nHomework 2 due\n\nNijenhuis tensor; integrability; square of the dbar operator; Newlander-Nirenberg theorem; Kahler manifolds; complex projective space\n\nKahler forms; strictly plurisubharmonic functions; Kahler potentials; examples; Fubini-Study Kahler form; complex projective manifolds; Hodge decomposition theorem\n\nHodge * operator on a Riemannian manifold; d* operator; Laplacian, harmonic forms; Hodge decomposition theorem; differential operators; symbol, ellipticity; existence of parametrix\n\nElliptic regularity, Green's operator; Hodge * operator and complex Hodge theory on a Kahler manifold; relation between real and complex Laplacians\n\nHodge diamond; hard Lefschetz theorem; holomorphic vector bundles; canonical connection and curvature\n\nHolomorphic sections and projective embeddings; ampleness; Donaldson's proof of the Kodaira embedding theorem: local model; concentrated approximately holomorphic sections\n\nHomework 3 due\n\nDonaldson's proof of the Kodaira embedding theorem: Estimates; concentrated sections; approximation lemma\n\nProof of the approximation lemma; examples of compact 4-manifolds without almost-complex structures, without symplectic structures, without complex structures; Kodaira-Thurston manifold\n\nSymplectic fibrations; Thurston's construction of symplectic forms; symplectic Lefschetz fibrations, Gompf and Donaldson theorems\n\nSymplectic sum along codimension 2 symplectic submanifolds; Gompf's construction of symplectic 4-manifolds with arbitrary pi_1\n\nSymplectic branched covers of symplectic 4-manifolds.\n\nHomeomorphism classification of simply connected 4-manifolds; intersection pairings; spin^c structures; spin^c connections; Dirac operator\n\nSeiberg-Witten equations; gauge group; moduli space; linearized equations; compactness of moduli space\n\nSeiberg-Witten invariant; properties; vanishing for manifolds of positive scalar curvature; vanishing for connected sums; Taubes non-vanishing for symplectic manifolds; examples of non-symplectic 4-manifolds, of non-diffeomorphic homeomorphic manifolds",
  "files": [
    {
      "category": "Resource",
      "title": "homework1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/810a5643ae15584308249cb27c9aa98a_homework1.pdf",
      "content": "ZZ\n18.966 - Homework 1 - due Thursday March 1, 2007.\n1. Show that, if E is a Lagrangian subspace of a symplectic vector space (V, Ω), then\nany basis e1, . . . , en of E can be extended to a standard symplectic basis e1, . . . , en, f1, . . . , fn\nof (V, Ω).\n2. For which values of n does the sphere S2n ⊂ R2n+1 carry a symplectic structure?\nWhat about the torus T 2n = R2n/Z2n = (S1)2n?\n3. Let {ρt}t∈[0,1] be the isotopy generated by a time-dependent symplectic vector field Xt\ndρt\non a symplectic manifold (M, ω), i.e. ρ0 = Id,\n= Xt * ρt, and iXt ω is closed. Then the\ndt\nflux of {ρt} is defined to be\nZ 1\nFlux(ρt) =\n[iXt ω] dt ∈ H1(M, R).\na) Let γ : S1 → M be an arbitrary closed loop, and define Γ : [0, 1] × S1 → M by the\nformula Γ(t, s) = ρt(γ(s)), so γt(·) = Γ(t, ·) is the image of the loop γ by ρt. Prove that\n⟨Flux(ρt), [γ]⟩ =\nΓ ∗ ω.\n(1)\n[0,1]×S1\n(Remark: the right-hand side is simply the symplectic area swept by the family of loops\n{γt}t∈[0,1]. In particular, equation (1) implies that this area depends only on the homology\nclass represented by γ!)\nb) Does the symplectomorphism φ : (x, ξ) 7→ (x, ξ + 1) of T ∗S1 ≃ S1 × R belong to the\ngroup of Hamiltonian diffeomorphisms?\nHint: assume φ is generated by a Hamiltonian isotopy, and use the exactness property\n(ω = dα) to rewrite the right-hand side of equation (1) in terms of the 1-form α.\n4. The goal of this problem is to prove the following result, which asserts that all defor\nmations of compact symplectic submanifolds are induced by ambient symplectic isotopies:\nTheorem 1 Let (M, ω) be a compact symplectic manifold, and let {Σt}t∈[0,1] be a smooth\nfamily of compact symplectic submanifolds in (M, ω). Then there exists an isotopy ψt con\nsisting of symplectomorphisms of M such that ψt(Σ0) = Σt.\nWe will admit the following classical (easy) result: there exists an isotopy consisting of\ndiffeomorphisms φt : M → M such that φt(Σ0) = Σt.\na) Consider ωt = φt\n∗ω, and prove the existence of a time-dependent vector field Xt such\nd\nthat d(iXt ωt) = -dt ωt. Show that, if the vector field Xt can be chosen to be tangent to Σ0\nat every point of Σ0, then the theorem follows (by modifying φt by the flow of Xt).\n\nb) Consider the symplectic normal bundle N ωΣ0 ⊂ TM|Σ0 whose fiber Np\nωΣ0 at a point\np ∈ Σ0 is the symplectic orthogonal to TpΣ0. Prove that the vector field X is tangent to Σ0\nif and only if, for every p ∈ Σ0, the restriction to Np\nωΣ0 of the 1-form α = iX ω is zero.\nc) Show that, given any 1-form α ∈ Ω1(M) there exists a smooth function f : M → R\nsuch that, for every p ∈ Σ0, the restriction of df to Np\nωΣ0 is equal to that of α.\nd) We will admit the fact that, given one-parameter families of 1-forms αt and of sym\nplectic forms ωt depending smoothly on t, the functions ft constructed in (c) can be chosen\nto depend smoothly on t. Complete the proof of the Theorem."
    },
    {
      "category": "Resource",
      "title": "hw1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/2027a78b82a01acff248c8fb2e2f3720_hw1_sol.pdf",
      "content": "R\nZ\nZ\n\nZ Z\nZ\nZ\n18.966 - Homework 1 - Solutions.\n1. Let E be a Lagrangian subspace of a symplectic vector space (V, Ω), and let e1, . . . , en\nbe a basis of E. We proceed by induction, assuming we have constructed f1, . . . , fk-1 ∈ V\nsuch that the family (e1, . . . , en, f1, . . . , fk-1) is free and Ω(ei, fi) = 1, Ω(ei, fj) = 0 for i = j,\nand Ω(fi, fj) = 0.\nBecause (e1, . . . , en, f1, . . . , fk-1) is free, there exists a (non-unique) linear form τ ∈ V ∗\nsuch that τ(ei) = 0 for i\nk, τ(fi) = 0 for i < k, and τ(ek) = 1. Using the fact that Ω is\n=\nnon-degenerate (induces an isomorphism between V and V ∗), there exists fk ∈ V such that\nΩ(·, fk) = τ.\nLet us check that the family (e1, . . . , en, f1, . . . , fk) is free. Indeed, if v = Pn\ni=1 λiei +\nPk\nP\ni=1 μifi = 0, then Ω(ei, v) = μi = 0 for all 1 ≤ i ≤ k, and v =\nλiei = 0; since the (ei)\nform a basis of E, we also have λi = 0 for all i. Moreover, Ω(ei, fk) and Ω(fi, fk) are as\nprescribed.\nTherefore, by induction we can construct f1, . . . , fn such that (e1, . . . , en, f1, . . . , fn) is a\nbasis of V (it's a free family and dim V = 2n) and the expression of Ω in this basis is the\nstandard one.\n2. S2 is an orientable surface and hence carries a symplectic structure (its standard area\nform, for example); however, for n ≥ 2, the compact manifold S2n has H2(S2n , R) = 0, so it\ncannot be symplectic (for any closed 2-form,\nS2n ωn = [ω]∪n · [S2n] = 0).\nThe torus T 2n always carries a symplectic structure, induced from the standard sym\nplectic structure of R2n (which is preserved by translations). (On T 2n there are coordinates\nx1, . . . , xn, y1, . . . , yn ∈ R/Z = S1, the symplectic form can be written as ω = P dxi ∧dyi.)\nAlternatively, T 2n is the product of n copies of T 2 which is an orientable surface. (Recall a\nproduct of symplectic manifolds is symplectic.)\n3. a)\nZ\n1 Z\n∂\n∂\nΓ∗ω =\nωγt(s)(\nγt(s)) ds dt\n[0,1]×S1\nS1\n∂t\n∂s\nγt(s),\nZ 1 Z\n=\nωγt(s)(Xt(γt(s)), γ t(s)) ds dt\nS1\nZ 1 Z\nZ 1\n=\niXt ω dt =\n⟨[iXt ω], [γt]⟩dt.\nγt\nObserving that γt and γ are mutually homologous (the restriction of Γ to [0, t] × S1\nR 1\nprovides a bounding 2-chain), the r.h.s. is equal to\n0 ⟨[iXt ω], [γ]⟩dt = ⟨Flux(ρt), [γ]⟩.\nb) Assume φ : (x, ξ) 7→ (x, ξ + 1) is generated by a time-dependent Hamiltonian vector\nfield Xt (i.e., φ = ρ1, and iXt ω = dHt for some Hamiltonian Ht : M → R). Then Flux(ρt) = 0\nby definition ([iXt ω] = 0 for all t).\nRecall that ω = dα, where α = ξdx, and consider the loop γ : S1 → T ∗S1 defined by\nγ(x) = (x, 0), and its image γ1 = φ(γ) given by γ1(x) = (x, 1). recall that by (1) and Stokes'\ntheorem we have\n⟨Flux(ρt), [γ]⟩ =\nΓ∗(dα) =\nγ1\n∗α -\nγ0\n∗α,\n[0,1]×S1\nS1\nS1\n\nR\nR\nR\nR\nwhich implies that\nγ1 α =\nγ0 α, in contradiction with the direct calculation ( γ0 ξ dx = 0\nand\nγ1 ξ dx = 2π). Therefore φ is not Hamiltonian.\n4. a) ωt = φ∗ω is a symplectic form, and d ωt is an exact 1-form since it equals φ∗\nω) =\nt\ndt\nt (LYt\nd(φ∗\nt (iYt ω)) where Yt is the vector field generating φt. Hence following Moser's argument we\ncan find a 1-form αt such that dαt = -d ωt (in this case we can e.g. take αt = -φ∗\nt (iYt ω))\ndt\n-(φ-1\nLet ψt = φt * ρt, where ρt is the isotopy generated by the vector fields Xt. Then ψt\n∗ω =\nρ∗(φ∗ω) = ρ∗ωt, and\nand a vector field Xt such that αt = iXt ωt (for example Xt =\nt )∗(Yt)).\nt\nt\nt\nd(ψt\n∗ω)\nd\n\ndωt\n=\n(ρ∗ωt) = ρ∗ LXt ωt +\n= 0,\ndt\ndt\nt\nt\ndt\nso ψt is a family of symplectomorphisms.\nMoreover, if we assume that the vector field\nXt is tangent to Σ0 for all t, then by integration of the differential equation ρ0(p) = p,\nd ρt(p) = Xt(ρt(p)) we obtain that ρt maps Σ0 onto itself. Therefore, ψt(Σ0) = φt(Σ0) = Σt.\ndt\n(Note that the flow is well-defined because M and Σ0 are compact.)\nb) Consider a point p ∈ Σ0: because the symplectic orthogonal to Np\nωΣ0 is exactly TpΣ0,\nthe vector field X is tangent to Σ0 at p (i.e. Xp ∈ TpΣ0) if and only if ωp(Xp, v) = 0\n∀v ∈ Np\nωΣ0, i.e. if and only if iXω vanishes on Np\nωΣ0.\nc) Let X be a neighborhood of the zero section in N ωΣ0 = {(p, v), p ∈ Σ0, v ∈ Np\nωΣ0}.\nUsing e.g. the exponential map for an arbitrary metric we can construct a smooth map\nθ : X → M such that ∀p ∈ Σ0, θ(p, 0) = p, and ∀v ∈ Np\nωΣ0, dθ(p,0)(0, v) = v. Consider a\npoint (p, 0) of the zero section in X: we have T(p,0)X = TpΣ0 ⊕Np\nωΣ0, and by construction\nd(p,0)θ(u, v) = u + v for all u ∈ TpΣ0 and v ∈ Np\nωΣ0. However, TpΣ0 is a symplectic subspace\nof the vector space (TpM, ω), so TpM = TpΣ0 ⊕Np\nωΣ0, and the differential of θ at p is an\nisomorphism. Therefore θ is a local diffeomorphism, i.e. it induces a diffeomorphism over a\nneighborhood U of the zero section.\nAt any point p ∈ Σ0, the restriction to Np\nωΣ0 of the 1-form α ∈ Ω1(M) defines a linear\nform αp : Np\nωΣ0 → R. Let h : N ωΣ0 → R be the function defined by h(p, v) = αp(v). Finally,\nlet χ : N ωΣ0 → [0, 1] be a smooth cut-offfunction equal to 1 over a neighborhood of the zero\nsection and with support contained in U, and let h (p, v) = χ(p, v)h(p, v). By construction,\nd(p,0) h (0, v) = d(p,0)h(0, v) = αp(v).\nLet f : M → R be the unique smooth function with support contained in θ(U) and such\nthat f(θ(x)) = h (x) for all x ∈ U. Then by construction, for every p ∈ Σ0 and v ∈ Np\nωΣ0,\ndpf(v) = d(p,0) h * (d(p,0)θ)-1(v) = d(p,0) h (0, v) = αp(v), i.e. the restriction of df to Np\nωΣ0 is\nequal to that of α.\nd) Let αt be a smooth family of 1-forms such that dαt = -d ωt (for example those\ndt\nconstructed in (a)), and let ft be the functions constructed in (c). Then αt = αt -dft also\nsatisfies the property that dα t = -d ωt, and additionally the restriction of αt to N ωt Σ0 (the\ndt\np\northogonal to TpΣ0 with respect to ωt) vanishes at every point of Σ0. Therefore the vector\nfield Xt such that iXt ωt = α t is tangent to Σ0 at every point of Σ0 (by the result of (b)), and\nLXt ωt = -d ωt. By part (a) this completes the proof.\ndt"
    },
    {
      "category": "Resource",
      "title": "homework2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/5adeba0d16668d18ca12c8adf02135e5_homework2.pdf",
      "content": "18.966 - Homework 2 - due Tuesday March 20, 2007.\n1. Show that the sphere S6 carries a natural almost-complex structure, induced by a\nvector cross-product on R7 .\nHint: view R7 as the space of imaginary octonions. Octonions are the non-commutative,\nnon-associative normed division algebra structure on R8 = H ∀ eH with product given by\nthe formula\n(a + be)(a 0 + b0 e) = (aa 0 - b0b) + (b0 a + ba0)e,\n8a, b, a0, b0 → H\n(a0 is the conjugate of a0, i.e. x + yi + zj + tk = x - yi - zj - tk). (You may use the fact\nthat ⊗(a + be)(a0 + b0e)⊗ = ⊗a + be⊗⊗a0 + b0e⊗, where ⊗·⊗ is the usual Euclidean norm on R8.)\n2. Let (V,\n) be a symplectic vector space of dimension 2n, and let J : V ! V , J 2 = -Id\nbe a complex structure on V .\na) Prove that, if J is\n-compatible and L is a Lagrangian subspace of (V,\n), then JL is\nalso Lagrangian and JL = L?, where L? is the orthogonal to L with respect to the positive\ninner product g(u, v) =\n(u, Jv).\nb) Deduce that J is\n-compatible if and only if there exists a symplectic basis for V of\nthe form\ne1, e2, . . . , en, f1 = Je1, f2 = Je2, . . . , fn = Jen,\nwith\n(ei, ej ) =\n(fi, fj ) = 0 and\n(ei, fj ) = ij .\n3. Let (M, !, J, g) be a symplectic manifold equipped with a compatible almost-complex\nstructure and the corresponding Riemannian metric, and let L be a complex line bundle\nover M equipped with a Hermitian metric | · | and a Hermitian connection ⊕. Given a\nsection s of L, define @s,\n= 2\n@s →\n1(M, L) by the formulas @s(v)\n1 (⊕s(v) - i⊕s(Jv)) and\n@s(v) = 1\n2 (⊕s(v) + i⊕s(Jv)).\nIt is easy to check that, 8x → M, (@s)x : Tx\nis C-linear, (\nis C-antilinear,\nM ! Lx\n@s)x\n\nand ⊕s = @s + @s\n. (@s and @s are respectively the type (1,0) and (0,1) parts of ⊕s).\na) Prove that if (⊕s)x : TxM ! Lx is surjective at every point x of Z = s-1(0), then Z\nis a smooth submanifold of M, and its tangent space is given by TxZ = Ker(⊕s)x.\nb) Prove that, if |@s| > @s| at every point of Z, then Z = s-1(0) is a symplectic\n|\nsubmanifold of M. (Here | · | is the natural Hermitian norm on T x\nM\nLx = Hom(TxM, Lx)\ninduced by g on TM and the Hermitian metric on L).\nHint: given a point x → Z, and choosing an identification between the fiber of L at x and\nC equipped with the standard norm, things essentially reduce to a linear algebra problem\nfor the linear map (⊕s)x = (@s)x\n@s)x\nM ! C.\n+ (\n: Tx"
    },
    {
      "category": "Resource",
      "title": "hw2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/988bc4dd565a679c060df3cf4ee56525_hw2_sol.pdf",
      "content": "18.966 - Homework 2 - Solutions.\n1. Equip R7 = Im O = {a + be, Re a = 0} with the cross-product x × y = Im(xy). By\ndefinition of the octonion product, if x, y ∩ Im O then Re(xy) = -hx, y⇔ (the usual Euclidean\nscalar product on R7). Indeed,\nRe((a + be)(a 0 + b0 e)) = Re(aa 0 - b0b) = Re(-aa0 - b0b) = -ha, a 0⇔-hb, b0 ⇔.\nTherefore ∈x × y∈ = ∈Im(xy)∈ ∈xy∈ = ∈x∈∈y∈, with equality iff x ∀ y. Let x ∩ S6 ⊥ R7 ,\nand let y ∩ TxS6 ' x ? ⊥ R7 . Then we define\nJx(y) = x × y.\nNote that, since y ∀ x, we have Jx(y) = x × y = xy + hx, y⇔ = xy.\nWe have to prove that Jx maps TxS6 to itself, and that Jx\n2 = -Id. For this purpose, let\nx = a + be be a unit imaginary octonion ( a = -a) and let y = c + de be any octonion: then\nx(xy) = a(ac - db ) - ( ad + c b)b + (da + bc )ae + b( ca - bd)e\n= -|a|2 c - (a + db - c|b|2 - d|a|2\nc(a + a)e -|b|2de\na)\ne + b\n= -(|a|2 + |b|2)(c + de) = -∈x∈2 y = -y.\nIf y ∩ TxS6, i.e. y is imaginary and y ∀ x, then hx, xy⇔ = -Re(x(xy)) = Re(y) = 0, so Jx\nmaps TxS6 to itself, and Jx\n2 = -Id.\n2. a) Any vector in JL is of the form Ju, with u ∩ L. Given u, v ∩ L, we have\n\n(Ju, Jv) =\n(u, v) = 0 (since J is\n-compatible and L is Lagrangian), and dim JL =\ndim L = 1 dim V , so JL is Lagrangian. Also, 8u, v ∩ L, g(u, Jv) =\n(u, J(Jv)) =\n-\n(u, v) = 0, so any vector in L is orthogonal to any vector in JL, i.e. JL ⊥ L? . Since\ndim JL = 1\n2 dim V = dim L?, we conclude that JL = L? .\nb) Assume J is\n-compatible, and let L be a Lagrangian subspace of (V,\n). Choose a\ng-orthonormal basis (e1, . . . , en) of L, and let fi = Jei ∩ JL. Then\n(ei, ej ) = 0 since L is\nLagrangian, and\n(fi, fj ) = 0 since JL is Lagrangian. Moreover,\n(ei, fj ) =\n(ei, Jej ) =\ng(ei, ej ) = λij . Hence we have a standard basis with fi = Jei.\nConversely, if there exists a standard basis with fi = Jei, then\n(ei, Jej ) =\n(fi, Jfj ) =\nλij , and\n(ei, Jfj ) =\n(fi, Jej ) = 0, so the bilinear form g =\n(·, J·) is symmetric and defi\nnite positive (and (e1, . . . , en, f1, . . . , fn) is an orthonormal basis). Hence J is\n-compatible.\n3. a) Recall that, for any vector u ∩ TxM, *s(u) is the vertical component of dsx(u) ∩\nTs(x)L (while the horizontal component of dsx(u) is the horizontal lift of u). Therefore the\nassumption that *s is surjective at every point of Z = s -1(0) means that the graph s of s\nis transverse to the zero section 0 ⊥ L, and hence that Z = s ≤ 0 is smooth. Moreover,\nat every point x of Z we have TxZ = Txs ≤ Tx0, i.e. the tangent space to Z is the set\nof all vectors v ∩ TxM such that dsx(v) is tangent to the zero section, i.e. horizontal, i.e.\n*s(v) = 0. Hence TZ = Ker *s.\n\nb) Let x ∩ Z, and assume that |αsx| > |\n|.\nαsx\nWe want to show that the restriction of\nTxZ = Ker *sx is a symplectic subspace of (TxM, !x). This is a linear algebra question\ninvolving the linear map *sx : TxM ! Lx.\nUse a unit length element in Lx to identify the fiber Lx (a rank 1 complex vector space\nwith a Hermitian norm) with C equipped with the standard norm | · |. Then *sx becomes\na linear map TxM ! C.\nMethod 1: Let g : TxM × TxM ! R be the metric induced by ! and J, and consider\nthe linear form αsx : TxM ! C. There exists a unique vector u ∩ TxM such that Re αsx =\ng(u, ·); because αsx ⊂ J = iαsx, we have Im αsx = g(-Ju, ·). Similarly, there exists a unique\nv ∩ TxM such that Re\n= g(v,\nαsx\n·). The assumption |αsx\nαsx| is\nαsx\n·), and Im\n= g(Jv,\n| > |\nequivalent to the property g(u, u) > g(v, v).\nSince *sx = αsx\nαsx, we have Re *sx = g(u + v, ·) = !(-Ju - Jv, ·), and Im *sx =\n+\ng(-Ju + Jv, ·) = !(-u + v, ·). Hence, E = TxZ = Ker *sx is the set of all tangent vectors\nthat are symplectically orthogonal to -Ju-Jv and -u+v, i.e. E! = span(-Ju-Jv, -u+v).\nRecall that E ⊥ (TxM, !) is a symplectic subspace ⊕ TxM = E → E! ⊕ E! is a symplectic\nsubspace. So we just need to check that the restriction of ! to E! is non-degenerate. Since\n!(-u + v, -Ju - Jv) = !(u, Ju) - !(v, Ju) + !(u, Jv) - !(v, Jv)\n= g(u, u) - g(v, u) + g(u, v) - g(v, v) = g(u, u) - g(v, v) > 0,\nwe conclude that Z is a symplectic submanifold of (M, !).\nMethod 2: use the result of Problem 2 to identify (TxM, !, J, g) with (Cn, !0, i, | · |).\nThen αsx : Cn ! C can be written as αsx(u1, . . . , un) = P j uj for some constants i ∩ C,\nand similarly αs\nx(u1, . . . , un) = P ωj u j . In order to prove that TxZ is a symplectic subspace,\nwe consider a non-zero vector u = (u1, . . . , un) ∩ TxZ, and need to show that there exists\nv ∩ TxZ such that !(u, v) = 0. We look for v = (v1, . . . , vn) of the form vj = iuj +\nωj ,\nj -\nwhere ∩ C. The condition\n*s(v) =\nX\n(iuj j +\nωjj )+(-i\nj ωj -ω j ωj ) = *s(Ju)+(||2 -|ω|2) = 0\nj j -\nuj ωj +\n*s(Ju)\n| > |\ngives = -\n(note that ||2 -|ω|2 = 0 since\n|| = |αsx\nαsx| = |ω|).\n||2 -|ω|2)\nP\nOn the other hand, since *s(u) =\nuj j + uj ωj = 0, we have\n!(u, -\nX\nu j (\nωj )\nω) = Im(\nj -\n= Im(\nX\nu j j ) - Im( X\nu j ωj )\n= Im(\nX\nu j j ) + Im( X\nuj j ) = 0.\nHence !(u, v) = !(u, Ju) = |u|2 6= 0."
    },
    {
      "category": "Resource",
      "title": "homework3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/2356bcfe1b353877898f8824de94084b_homework3.pdf",
      "content": "+\nR\n18.966 - Homework 3 - due Thursday April 19, 2007.\n1. Let (M, ω) be a symplectic manifold, J a compatible almost-complex structure, and\ng the corresponding Riemannian metric. Show that two-dimensional almost-complex sub\n′\nmanifolds of M are absolutely volume minimizing in their homology class, i.e.: let C, C\nbe two-dimensional compact closed oriented submanifolds of M, representing the same ho\nmology class [C] = [C ′ ] ∈ H2(M, Z). Assume that J(TC) = TC (and the orientation of C\nagrees with that induced by J). Then volg(C) ≤ volg(C ′ ).\nHint: compare ω|C′ and the area form induced by g.\n2. We will admit the fact that the cohomology ring of CPn (the set of complex lines\nthrough 0 in Cn+1) is H∗(CPn , Z) = Z[h]/hn+1, where h ∈ H2(CPn , Z) is Poincar e dual to\nthe homology class represented by a linear CPn-1 ⊂ CPn .\nThe tautological line bundle L → CPn is the subbundle of the trivial bundle Cn+1 × CPn\nwhose fiber at a point of CPn is the corresponding line in Cn+1 . The homogeneous coordinates\non CPn are actually sections of the dual bundle L∗ . (Convince yourself of this).\na) Show that c1(L) = -h, and show that the direct sum of TCPn with the trivial line\nbundle C is isomorphic to the direct sum of n + 1 copies of L∗ . From this, deduce the Chern\nclasses of the tangent bundle TCPn .\nHint: show that there is a surjective bundle homomorphism Hom(L, Cn+1) → TCPn .\nWhat is the kernel?\nb) Let X ⊂ CPn be a smooth complex hypersurface of degree d, i.e. the submanifold\ndefined by the equation P(z0, . . . , zn) = 0 where P is a homogeneous polynomial of degree d\n(transverse to the zero section, i.e. with nonvanishing differential along its zero set). Show\n⊕(L∗)⊗d\nthat TCPn\n|X = TX\n|X , and deduce the Chern classes of TX.\n3. Let M be a compact oriented 4-manifold, equipped with a Riemannian metric g. A\n2-form is said to be selfdual if ∗α = α, antiselfdual if ∗α = -α. The bundles of selfdual\n(resp. antiselfdual) 2-forms are denoted by Λ2 T ∗M and Λ2\n-T ∗M respectively.\n+\na) Show that the Hodge ∗ operator induces a decomposition of the space of harmonic\nforms H2 = H2\n- into selfdual and antiselfdual harmonic forms. Show that, with respect\n⊕H2\nto the intersection pairing (α, β) 7→\nM α ∧ β, these summands are definite positive (resp.\ndefinite negative) and orthogonal to each other.\nb) Assume that (M, ω) is a compact K ahler manifold of real dimension 4. Show that\nΛ2 T ∗M ⊗ C = Λ2,0 ⊕ Λ0,2 ⊕ Cω, where the summands are orthogonal to each other, and\n+\nΛ2\n∗M ⊗ C\nω⊥ ⊂ Λ1,1\n1,1\n-T\n=\n. Deduce that the space of real harmonic (1,1)-forms is HR =\nH2\n- ⊕Rω.\n(Since algebraic curves in a complex projective surface are Poincar e dual to classes in\nNS := H1,1(M) ∩ H2(M, Z), this implies the Hodge index theorem, which asserts that\nthe intersection pairing on algebraic cycles in a complex projective surface has signature\n(1, dim NS -1))."
    },
    {
      "category": "Resource",
      "title": "hw3_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/bbc160045496d82864b2e2c81ad7e0a8_hw3_sol.pdf",
      "content": "R\nR\n\n18.966 - Homework 3 - Solutions.\n′\n1. Given a point p ∈ C (a two-dimensional oriented submanifold), let (e, f) be an\noriented basis of TpC ′ , orthonormal with respect to the metric g induced by ω and J. Then\nω(e, f) = g(Je, f) ≤|Je| |f| = |e| |f| = 1. Meanwhile, the area form dvolg|C′ induced by g\n′\non C is given by dvolg|C′ (e, f) = 1. Hence ω|C′ ≤ dvolg|C′ at every point of C ′ ; integrating,\nwe deduce that [ω] · [C ′ ] =\nC′ ω ≤ volg(C ′ ).\nIn the case of C (an almost-complex submanifold, equipped with the orientation induced\nby J), an oriented orthonormal basis of TpC is given by (e, Je) where e is any unit length\nvector in TpC. (Note that |Je| = |e| = 1 and g(Je, e) = ω(e, e) = 0). Then ω(e, Je) =\ng(Je, Je) = 1 = dvolg|C (e, Je), so ω|C = dvolg|C , and [ω] · [C] =\nC ω = volg(C).\nIn conclusion, volg(C) = [ω] · [C] = [ω] · [C ′ ] ≤ volg(C ′ ).\n2. a) The homogeneous coordinate xn is a linear form on Cn+1 (namely, (x0, . . . , xn) 7→\nxn) and hence, by restriction to the tautological line, a linear form on L. This section of\nL∗ vanishes precisely at those points [x0 : · · · : xn] for which the last coordinate is zero,\nso its zero set is CPn-1 ⊂ CPn .\nMoreover, it vanishes transversely, and the orientation\ninduced on its zero set is the natural one (because all orientations agree with those induced\nby the complex structure). So c1(L∗) = e(L∗) is Poincar e dual to [CPn-1] ∈ H2n-2(CPn), i.e.\nc1(L∗) = h. Therefore c1(L) = -c1(L∗) = -h.\nGiven a line l ⊂ Cn+1 (defining a point p = [l] ∈ CPn), any nearby line can be\nparametrized by a map l → Cn+1 , x 7→ x + u(x), where u ∈ Hom(l, Cn+1). This gives\na map (in fact a local submersion) ψ : Hom(l, Cn+1) → CPn defined by ψ(u) = [Im(Id + u)].\nIts differential at the origin is Ψ = d0ψ : Hom(l, Cn+1) → TpCPn . We claim that Ψ is\nsurjective, with kernel Hom(l, l) ≃ C (those linear maps whose image is contained in l).\nIndeed, this can be checked easily in the case where l is the first coordinate axis, and\nψ((u0, . . . , un)) = [1 + u0 : u1 : · · · : un]. Therefore, we have a short exact sequence of vector\nbundles 0 → C = Hom(L, L) → Hom(L, Cn+1) = (L∗)n+1 → T CPn → 0 (where C denotes\nthe trivial line bundle over CPn).\nTaking a complement F to the subbundle Hom(L, L) ⊂ Hom(L, Cn+1) (e.g. its orthogonal\ncomplement for some Hermitian metric), the restriction of Ψ to F is an isomorphism, so we\nconclude that Hom(L, Cn+1) = (L∗)n+1 is isomorphic to T CPn ⊕C.\nSince Chern classes behave multiplicatively under direct sums, and c(L∗) = 1 + c1(L∗) =\n1 + h, we have c(T CPn) = c(T CPn ⊕C) = c((L∗)n+1) = (1 + h)n+1 . Expanding into powers\nn+1 hk\nof h, we deduce that ck(T CPn) =\nk\nfor all 1 ≤ k ≤ n.\nb) Consider X = P -1(0), where P is a homogeneous polynomial of degree d in the\nhomogeneous coordinates, i.e. a section of (L∗)⊗d . Fix any connection on (L∗)⊗d . If we\nassume that P is transverse to the zero section, then at any point x ∈ X the linear map\n(∇P )x : TxCPn → (L∗)⊗\nx\nd (which does not depend on the chosen connection since P (x) = 0)\nis surjective and its kernel is TxX (see Homework 2). Therefore we get a short exact sequence\nof vector bundles 0 → TX → T CPn\n|X → (L ∗)⊗\n|X\nd → 0, and considering again a complement\nto TX in T CPn\n|X we conclude that T CP|\nn\nX ≃ TX ⊕(L∗)⊗\n|X\nd .\n\nR\nR\nR\nR\nR\nR\n→\n\nX\n:\ni\nthe inclusion\nby\nh\nof\nUsing additivity of the first Chern class of a line bundle under tensor product, we have\nc1((L∗)⊗d) = 1 + dh. Let α = h|X ∈ H2(X, Z) (the pullback\nCPn). Using the multiplicativity of Chern classes under direct sums and their functoriality\nunder pullback, we deduce that (1 + α)n+1 = c(TX) · (1 + dα).\nSince αn = 0 in the cohomology of X (for dimension reasons), 1 + dα is invertible, with\nPn-1\ninverse (1 + dα)-1 =\nk=0 (-1)kdk αk . The total Chern class of TX is then 1 + c1(TX) +\n· · · + cn-1(TX) = (1 + dα)-1(1 + α)n+1 .\n3. a) The Hodge ∗ operator on Ω2(M 4) satisfies ∗2 = 1, and every 2-form α decomposes\ninto the sum of a selfdual part α+ = 1\n2 (α +∗α) and an antiselfdual part α- = 1\n2 (α -∗α). On\nan even-dimensional manifold, d ∗ = -∗d∗ in all degrees, so Δ = dd ∗ +d ∗ d = -d ∗d∗-∗d∗d\ncommutes with ∗. Therefore, if α is harmonic then so is ∗α, and hence so are α+ and α- .\nSo every harmonic form α decomposes into the sum of a harmonic selfdual form (α+) and\na harmonic antiselfdual form (α-). Moreover, selfdual and antiselfdual forms are obviously\nin direct sum; so H2 =\n+\n- (this decomposition corresponds to the ±1 eigenspaces of\nH2 ⊕H2\n∗ : H2 →H2).\nIf α is a nontrivial selfdual form then\nM α∧α =\nM α∧∗α =\nM ⟨α, α⟩dvolg = ∥α∥2\nL2 > 0;\nand if β =\n0 is antiselfdual then\nβ ∧ β = -\nβ ∧∗β = -∥β∥2\n< 0.\nMoreover\nM\nM\nL2\n⟨α, β⟩ = α ∧∗β = -α ∧ β = -β ∧ α = -β ∧∗α = -⟨β, α⟩, so α ∧ β is pointwise 0, and\nα ∧β =\n±\n0. Thus H2 are orthogonal and definite positive (resp. definite negative) for the\nM\nintersection pairing.\nb) At any point of M, the tangent space and the compatible triple (ω, J, g) can be\nidentified with (R4, ω0, J0, g0), with standard basis (e1, e2, e3, e4), and J0(e1) = e2, J0(e3) =\ne4. In terms of the dual basis,\nΛ2 = span(e 1 ∧e 2 + e 3 ∧e 4 , e 1 ∧e 3 -e 2 ∧e 4 , e 1 ∧e 4 + e 2 ∧e 3),\n+\nΛ2 = span(e 1 ∧e 2 -e 3 ∧e 4 , e 1 ∧e 3 + e 2 ∧e 4 , e 1 ∧e 4 -e 2 ∧e 3).\n-\nMeanwhile, ω = e1 ∧e2 + e3 ∧e4, and Λ2,0 is spanned by\n(e 1 + ie2) ∧(e 3 + ie4) = (e 1 ∧e 3 -e 2 ∧e 4) + i(e 1 ∧e 4 + e 2 ∧e 3),\nwhile Λ0,2 is the complex conjugate; it follows that Λ2 ⊗C = Λ2,0 ⊕Λ0,2 ⊕Cω.\n+\nMoreover, the\nsummands in this decomposition are clearly orthogonal (both for the standard Hermitian\nproduct ⟨α, β⟩ = α ∧∗β and for the complexified intersection pairing (α, β) 7→ α ∧β; in fact\nthe two coincide in the selfdual case), as follows from considering the types.\nNext, we observe that Λ2 is the orthogonal to Λ2 (for either one of the two above\n-\n+\nmentioned inner products on Λ2); so Λ2 ⊗C = (Λ2,0 ⊕Λ0,2)⊥ ∩ω⊥ = Λ1,1 ∩ω⊥ .\n-\nLet α ∈HR\n1,1 be a real harmonic (1, 1)-form. Then ∗α is also a harmonic (1, 1)-form, and\nhence so are α+ and α- . At every point of M we have Λ2 ∩Λ1,1 = span(ω), so α+ = fω for\n+\nsome function f : M → R. Moreover, dα+ = df ∧ω = 0. However, exterior product with ω\ninduces an isomorphism from Λ1 to Λ3, so df ∧ω = 0 if and only if df = 0. Therefore f is\nconstant, and α+ is a constant multiple of ω. We conclude that HR\n1,1 ⊂H2\nConversely,\n-⊕Rω.\nω is a real (1,1)-form, and so is any antiselfdual form since Λ2\n, so HR\n1,1 =\n- ⊕Rω.\n- ⊂ Λ1,1\nH2"
    },
    {
      "category": "Lecture Notes",
      "title": "lect01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/18712cf471e0a850ae3458dc68fb2407_lect01.pdf",
      "content": "P\nV\n^\nV\nN\nV\nL\nSYMPLECTIC GEOMETRY, LECTURE 1\nProf. Denis Auroux\n1. Differential forms\n∂\nGiven M a smooth manifold, one has two natural bundles: the tangent bundle TM =\n=\nvi ∂xi } and\nP\n{v\nthe cotangent bundle T ∗M = {α =\nαidxi}. Under Cinf maps, tangent vectors pushforward:\n(1)\nf : M → N = ⇒ f∗(v) = df(v) ∈ Tf(v)N\nSimilarly, differential forms pull back: f ∗(α) = α * df ∈ Tp\n∗M.\nDefinition 1. A differential p-form is a section of\np T ∗M. We denote the set of such sections as\np\n(2)\nΩp(M) = Ωp(M, R) = Cinf(\nT ∗M)\nRecall that, for E a vector space,\n∗ E =\n∗ E/{ei ∧ ej + ej ∧ ei = 0}. Furthermore,\n∗ E has a basis\nei1 ∧· · · ∧ eip , i1 < · · · < ip. In coordinates, a\nX\np-form is locally\n(3)\nα =\nαi1,··· ,ip dxi1 ∧· · · ∧ dxip\ni1<\n<ip\n···\nwhere the αi1,\nare Cinf functions. (Under coordinate changes,\n= fi(y1, . . . , yn), one replaces dxi by\nP\n··· ,ip\nxi\n∂fi\ndfi =\nj ∂yj dyj .)\nDefinition 2. The exterior differential is the map d : Ωp\nΩp+1 which maps:\nP ∂f\n→\n- For f a function, df =\n∂xi dxi.\n- d(fdxi1 ∧· · · ∧ dxip ) = df ∧ dxi1 ∧· · · ∧ dxip .\nd is obtained by extending R-linearly to all of Ωp.\nNote that d satisfies d(fα) = fdα + df ∧ α. The exterior derivative has the following properties:\n- d(α ∧ β) = (dα) ∧ β + (-1)deg αα ∧ dβ. In coordinates,\n(4)\nd((fdxi1 ∧· · · ∧ dxip ) ∧ (gdxj1 ∧· · · ∧ dxjq )) = (fdg + gdf) ∧ dxi1 ∧· · · ∧ dxip ∧ dxj1 ∧· · · ∧ dxjq\n- d2 = 0. For any function f,\nX ∂2f\n(5)\nd2f =\n∂xj ∂xi\ndxi ∧ dxj = 0\ni,j\nbecause terms with switched i, j cancel.\nThese two properties give us the structure of a differential graded algebra on Ω∗(M) =\np Ωp(M).\n- ∀φ ∈ Cinf(M, N), α ∈ Ωp(N), φ∗(dα) = d(φ∗α).\nOther operations:\n- For v ∈ Cinf(TM) a vector field, α ∈ Ωp(M) a form, we have the interior product ivα = α(v, · · · ) ∈\nΩp-1(M ).\n- For X ∈ Cinf(TM) a vector field, f ∈ Cinf(M), we have the Lie derivative X · f = LX f = iX df = df(X).\nd\nIf X generates diffeomorphisms φt on M with φ0(x) = x and dt φt(x) = X(φt(x)), then\n(6)\ndt\nd ((φt)∗f) = dt\nd (f * φt) = φt∗(X · f)\n\nR\nX\nX\nP\nProf. Denis Auroux\nWe can extend this construction to forms: given α ∈ Ωp(M), X ∈ Cinf(TM ) a vector field, LX α ∈ Ωp is\ndefined s.t.\n(7)\ndt\nd ((φt)∗α) = φ∗\nt (LX α)\nNote that the Lie derivative satisfies\n(8)\nLX (α ∧ β) = LX α ∧ β + α ∧ LX β\nand LX (dα) = d(LX α).\nCombining these two properties, we find that:\nProposition 1. LX α = diX α + iX dα.\nProof. By induction: base case is trivial, so assume statement for p-forms. Locally, a (p + 1) form is the sum of\nfdα for f ∈ Cinf(M), α ∈ Ωp. Thus,\nLX (fdα) = (LX f)dα + fdLX α\n(9)\n= (iX df)dα + f(ddiX α + diX dα)\n= (iX df)dα + fdiX dα\nNow,\ndiX (fdα) + iX d(fdα) = d(fiX dα) + iX (df ∧ dα)\n(10)\n= df ∧ iX dα + fdiX dα + (iX df)dα - df ∧ iX dα\n= (iX df)dα + fdiX dα\ngiving us the desired equality.\n\n2. de Rham cohomology\nDefinition 3. We say that α ∈ Ωp is closed if dα = 0, exact if α = dβ for some β. The de Rham cohomology\nof M is the collection of groups\nker(d : Ωp\nΩp+1)\n(11)\nHp(M, R) =\n→\nIm (d : Ωp-1\nΩp)\n→\nExample. For M connected, df = 0\nf is constant, so H0(M, R) = R.\n⇔\nProposition 2 (Poincar e Lemma). Hp(Rn) = 0 ∀p ≥ 1.\nProof. By induction on n. The case n = 1 is obvious, as f =\nαdx =\ndf = α. For general n, write\n⇒\n(12)\nα =\nαi1···ip dxi1 ∧· · · ∧ dxip\n1≤i1<\n<ip≤n\n···\non Rn and assume α is closed. Let\n(13)\nβ =\nβj1···jp-1 dxj1 ∧· · · ∧ dxjp-1\n2≤j1<\n<jp-1≤n\n···\nwhere\n∂βj1··· p-1\n(i.e. βj1···\n=\nR\ndx1). Then i ∂ dβ = i ∂ α by construction. Let α0 =\n∂x1\nj\n= α1j1···jp-1\njp\nα1j1···jp-1\n∂x1\n∂x1\nα-dβ. Then α0 =\n2≤i1 <\n<ip≤n α0\nip\nwith no dx1 by construction and dα0 = dα - d(dβ) = 0,\n···\ni1··· dxi1 ∧· · ·∧dxip\nπ\nshowing that α0 is pulled back from Rn-1 by (x1, . . . , xn) 7→ (x2, . . . , xn). Writing α0 = π∗η, η ∈ Ω(Rn-1), we\nhave that dη = 0 and η = dγ by our inductive hypothesis. Thus, α = α0 + dβ = d(π∗γ + β) as desired.\n\n2.1. Variants of de Rham Cohomology.\n- If M is noncompact, we can also consider the space of compactly supported differential forms Ωp\nc (M, R)\nand get the associated compactly supported de Rham cohomology Hc\np(M, R).\n- If U ⊂ M is a submanifold (e.g. an open subset), we can define relative differential forms Ωp(M, U; R) =\n{α ∈ Ωp(M, R)|α|U = 0} and obtain the relative de Rham cohomology Hp(M, U; R).\n\n-\nR\nR\nR\nSYMPLECTIC GEOMETRY, LECTURE 1\n3. Exact sequences of complexes\nIf M = U ∪ V , U, V ⊂ M open, we have an exact sequence on forms\n(14)\n0 → Ωp(M) → ΩP (U) ⊕ Ωp(V ) → Ωp(U ∩ V ) → 0\nwhere the first map sends α 7→ (α|U , α|V ) and the second (α, β) → α|U∩V - β|U∩V . Both these maps commute\nwith d, and exactness is clear: for the surjectivity of the last map, use a partition of unity 1 = u + v, where\nsupp(u) ⊂ U, supp(v) ⊂ V , so γ ∈ Ωp(U ∩ V ) is the image of (vγ, -uγ). This short exact sequence then gives a\nlong exact sequence (called the Mayer-Vietoris sequence)\n(15)\nHp(M)\nHp(U) ⊕ Hp(V )\nHp(U ∩ V )\nδ Hp+1(M)\n· · · →\n→\n→\n→\n→· · ·\nThe map δ is obtained as follows:\n(1) Choose a splitting σ : Ωp(U ∩ V )\nΩp(U) ⊕ Ωp(V ).\n(2) Given γ ∈ Ωp(U ∩ V ) closed, dσ(γ\n→\n) lands in the image of i∗ : Ωp+1(M)\nΩp+1(U) ⊕ Ωp+1(V ), and its\npreimage gives the desired element of Ωp+1(M).\n→\nSimilarly, for U ⊂ M, we get a sequence 0 → Ωp(M, U) → Ωp(M) → Ωp(U) → 0, with the maps given\nby inclusion and restriction respectively, and thus a long exact sequence of relative cohomology. Using these\nproperties along with Poincar e duality and functoriality under diffeomorphisms, we get\nTheorem 1. The de Rham and singular (simplicial) cohomologies are equivalent.\n3.1. Operations on de Rham cohomology.\n- Cup product: [α] ∪ [β] = [α ∧ β]. This is well defined: dα = dβ = 0 = ⇒ d(α ∧ β) = 0, and\n(α + dη) ∧ β = α ∧ β + d(η ∧ β).\nPairing with homology: for Σ ⊂ M a p-dimensional submanifold which is oriented and closed, we have\nan element [Σ] ∈ Hp(M) and thus a pairing h[α], [Σ]i =\nα. More generally, given a p-cycle [Σ]\nP\nΣ\nrepresented by\nniCi, with Ci p-dimensional submanifolds with ∂, we get the same pairing extended\nlinearly. That this is well-defined is a consequence of Stokes' theorem RΣ dα = ∂Σ α.\nPoincar e duality: For M n compact, [α] ∈ Hp(M), [β] ∈ Hn-p(M) 7→\nα ∧ β = ([α] ∪ [β]) [M] is a\n-\nM\n·\nnondegenerate linear pairing and gives an isomorphism Hn-p ∼\nIn the noncompact case, we have\nR\n= Hp.\n[α] ∈ Hp(M), [β] ∈ Hn-p\nα ∧ β giving Hn-p = Hp.\nc\nM\nc\n(M) 7→\n∼"
    },
    {
      "category": "Lecture Notes",
      "title": "lect02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/fd89fa50606822d1fb5c91d763e39c9d_lect02.pdf",
      "content": "Z\nZ\nZ\nZ\nSYMPLECTIC GEOMETRY, LECTURE 2\nProf. Denis Auroux\n1. Homology and Cohomology\nRecall from last time that, for M a smooth manifold, we produced a graded differential algebra (Ω∗(M), ∧, d)\ngiving us a cohomology H∗(M) with cup product [α] ∪ [β] = [α ∧ β] (which is well-defined since d(α ∧ β) =\ndα ∧ β + (-1)deg αα ∧ dβ and (α + dη) ∧ β = α ∧ β + dη ∧ β). Furthermore, we obtain a pairing with homology:\nfor Σ ⊂ M a p-dimensional, oriented, closed submanifold with associated class [Σ] ∈ Hp(M), we define\n(1)\nh[α], [Σ]i =\nα\nΣ\nfor [α] ∈ Hp(M, R), and extend this by linearity to give a pairing with all of Hp(M). That this is well-defined\nis a consequence of Stokes' theorem:\n(2)\ndα =\nα\nΣ\n∂Σ\nRemark. A form is closed\nits integral on submanifolds depends only the homology class of the submanifold.\n⇔\nFurthermore, if M n is compact, closed, and oriented, we have a nondegenerate pairing\n(3)\nHp(M, R) ⊗ Hn-p(M, R) → R, [α] ⊗ [β] 7→\nM\nα ∧ β\nwhich induces the Poincar e duality Hn-p(M, R)\nHp(M, R). In the noncompact case, we have the same\n→\nstatement using cohomology with compact support HC\nn-p(M, R).\n2. Symplectic Vector Spaces\nLet V be a f.d. vector space /R.\nDefinition 1. A symplectic structure on V is a bilinear, non-degenerate, skew-symmetric pairing Ω : V × V →\nR. That is, as a matrix, it is invertible and skew-symmetric.\nExample. For R2n with basis {ei}n\nwe have a standard symplectic form given by Ω0(ei, ej ) =\ni=1, {fi}n\ni=1,\n\nΩ0(fi, fj ) = 0 ∀i, j, Ω0(ei, fj ) = δi,j = -Ω0(fj , ei). As a matrix, it is given by\n-\nIn\nI\nn\n.\nDefinition 2. For E ⊂ V a linear subspace, Ω a bilinear form, the orthogonal complement of E is EΩ = E⊥ =\n{v ∈ V |Ω(u, v) = 0 ∀u ∈ E}.\nNote that Ω is non-degenerate\nV Ω = {0}.\n⇔\nExample. In R2n with basis as above,\nSpan{e1}Ω = Span{e1, . . . , en, f2, . . . , fn}\n(4)\nSpan{e1, f1}Ω = Span{e2, . . . , en, f2, . . . , fn}\nSpan{e1, . . . , en}Ω = Span{e1, . . . , en}\nDefinition 3. A standard (symplectic) basis of (V 2n , Ω) is a basis ({ei}, {fi}) satisfying the above.\nTheorem 1. For (V n , Ω) a symplectic vector space, ∃ a standard basis.\n\nP\nP\nP\nP\nProf. Denis Auroux\nProof. We induce on n: the base case is trivial. Choose some vector e1 ∈ V r {0}. By nondegeneracy,\nΩ(ei, ) = 0 =⇒∃f1 s.t. Ω(e1, f1) = 1. Let W = Span{e1, f1}Ω: then Ω W is symplectic since u ∈ W, Ω(u, q) =\n0 ∀w\n·\n∈\nW = ⇒ Ω(u, e1) = 0, Ω(u, f1) = 0 = ⇒ u = 0. Furthermore, V\n|\n= Span{e1, f1} ⊕ W . To see this, note\nfirst that, if v = ae1 + bf1 ∈ W, Ω(e1, v) = b = 0 and Ω(f1, v) = a = 0, so W ∩ Span{e1, f1} = ∅. Secondly, for\nv ∈ V , we can write v = w + ae1 + bf1, where w = v - Ω(e1, v)f1 + Ω(f1, v)e1 ∈ W . Since W has dimension\nn - 2, we are done.\n\nCorollary 1. V symplectic =\nV is even-dimensional and symplectomorphic to (R2n , Ω0).\n⇒\nWe denote the symplectic automorphisms of (V, Ω) by Sp(V, Ω) = Sp(2n, R).\n=\nRemark. dim EΩ = dim V - dim E because V\n∼V ∗ → E∗, v 7→ Ω(v, ) 7→ Ω(v, ) E is surjective with kernel\n→\n·\n· |\nEΩ .\nDefinition 4. E ⊂ V is a symplectic subspace if Ω|E is nondegenerate, e.g. in a standard basis E is the span\nof\n(5)\n(e1, f1, . . . , ek, fk)\nProblem. Prove that E is a symplectic subspace ⇔ E ∩ EΩ = {0} ⇔ V = E ⊕ EΩ .\nDefinition 5. E ⊂ V is an isotopic (resp. coisotopic, lagrangian) subspace if E ⊂ EΩ (resp. EΩ ⊂ E, EΩ = E),\ne.g. in a standard basis E is the span of (e1, . . . , ek) (resp. (e1, f1, . . . , ek, fk, ek+1, . . . en), (e1, . . . , en)).\nExample. For E ⊂ V Lagrangian with basis (e1, . . . , en), we can complete this to a symplectic basis\n(6)\n(e1, . . . , en, f1, . . . , fn)\nof V .\nDefinition 6. The symplectic volume form is n! Ω∧n (where Ω is considered as an element of V2(V ∗).\nNote that, since Ω is nondegenerate, we can write Ω =\ni ei ∧ f i, so Ω∧n = n!e1 ∧ f 1 ∧ · · · ∧ en ∧ f n is a\nnon-zero top form, and our volume form is well-defined. In fact, Ω∧n = 0\n⇔ Ω is nondegenerate.\n3. Symplectic Manifolds\nLet M be a smooth manifold.\nDefinition 7. A symplectic form on M is a 2-form ω (i.e. a skew-symmetric pairing ωp : TpM × TpM\nR\nfor all p ∈ M) which is nondegenerate (i.e. 1 ωn is a volume form) and closed (i.e. dω = 0).\n→\nn!\nRemark. M symplectic =\nit is even-dimensional and naturally oriented. Moreover, [ω] ∈ H2(M, R) plays an\nimportant role, especially if\n⇒\nM is compact, as in this case\nR\nM\nω\nn\nn\n! = vol(M) > 0 = ⇒ [ω] = 0.\nExample. For R2n, ω0 =\ndxi ∧ dyi is the standard symplectic structure: for Cn , we write this as ω =\ni\ndzj ∧ dzj instead. Furthermore, for an orientable surface Σ, any area form is a symplectic form.\nProblem. For which values of n does S2n (resp. T 2n) have a symplectic structure?\nDefinition 8. A symplectomorphism is a diffeomorphism φ : (M, ω)\n(M 0, ω0) s.t. φ∗ω0 = ω.\n→\nWe denote the group of symplectomorphisms of M by Symp(M, ω).\nExample. For S2 ⊂ R3, Symp(S2) is the group of area and orientation preserving diffeomorphisms, which is\nmuch larger than the group of isometries.\nTheorem 2 (Darboux). Every symplectic manifold is locally symplectomorphic to (R2n, ω), i.e. it has local\ncoordinates in which ω =\ndxi ∧ dyi."
    },
    {
      "category": "Lecture Notes",
      "title": "lect03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/05a8f27da65e592f5c4ef8ff2d52ee0c_lect03.pdf",
      "content": "SYMPLECTIC GEOMETRY, LECTURE 3\nProf. Denis Auroux\n1. Symplectic Manifolds\nLet (M, ω) be a symplectic manifold, i.e. a smooth manifold with nondegenerate closed 2-form ω.\nExample. For X a smooth manifold, the cotangent bundle M = T ∗X is a symplectic manifold. Specifically,\ngiven a chart U ⊂ X with coordinates x1, . . . , xn, we have a basis of Tp\n∗X given by dx1, . . . , dxn and every\nξ ∈T ∗X can be written as ξidxi. This gives us a map\n(1)\nT ∗ X|U →R2n , (x, ξ) →(x1, . . . , xn, ξ1, . . . , ξn)\nLet α be the Liouville form defined by\nξidxi on each coordinate patch. It is well-defined as a 1-form on M,\nand ω = dα =\ndξi ∧dxi is the desired symplectic form. Furthermore, given a diffeomorphism X1 →X2, we\nhave an induced map\n(2)\nF : T ∗ X1 →T ∗ X2, (x, ξ)\nf)-1∗ ξ)\n→(f(x), (dx\nwhich is a symplectomorphism (because ∃ local coordinates in which f is the identity). Also, given h ∈\nCinf(X, R), we have an associated symplectomorphism τh : M →M, (x, ξ)\nh) since\n→(x, ξ + dx\n(3)\nτh\n∗ α = α + dh =⇒ τh\n∗ ω = τh\n∗(dα) = dα + ddh = ω\nas desired.\n1.1. Submanifolds.\nDefinition 1. A submanifold W ⊂ (M, ω) is symplectic if ω|W is symplectic (specifically, nondegenerate).\nThis implies that TpW ⊂TpM is a symplectic subspace ∀p. L ⊂(M, ω) is Lagrangian if ω|L = 0 and dim L =\n1 dim M.\nExample. By our above construction, the 0-section X →T ∗X = M is a Lagrangian submanifold. Furthermore,\nsections of T ∗X are graphs Xμ = {(x, μ(x))|x ∈X} ⊂T ∗X of 1-forms μ ∈Ω1(X, R): such a graph is Lagrangian\niff dμ = 0, since denoting iμ(x) = (x, μ(x)), i∗\nμα = μ =⇒ i∗\nμ(ω) = i∗\nμ(dα) = di∗\nμα = dμ.\nExample. For Σk ⊂Xn a submanifold, define the conormal space to x ∈Σ by\n(4)\nNx\n∗Σ = {ξ ∈Tx\n∗ X|ξ|TxΣ = 0}\nThis gives us subbundle N ∗Σ ⊂T ∗X|Σ and a submanifold N ∗Σ ⊂T ∗X. For Σ = X, we get the 0-section: for\nΣ = {p}, we get the fiber T ∗X. By definition, α|N∗Σ = 0, so N ∗Σ is Lagrangian.\np\n1.2. Symplectomorphisms and Lagrangian Submanifolds. Let φ : (M1, ω1) →(M2, ω2) be a diffeomor\nphism: we want to know whether φ is a symplectomorphism as well, i.e. whether φ∗ω2 = ω1. Consider the\ngraph Γφ ⊂M = M1 × M2. The latter space has one symplectic structure via ω = ω1 ⊕ω2 = π1\n∗ω1 + π2\n∗ω2,\nwhich is nondegenerate since\n(5)\nωn1+n2 = n1 + n2 π1\n∗ ω1\nn1 ∧π2\n∗ ω2\nn2\nn1\nHowever, here we will consider the alternate symplectic structure given by ˆω = π1\n∗ω1 -π2\n∗ω2.\nProposition 1. φ is a symplectomorphism ⇔Γφ is Lagrangian.\nProof. Γφ is the image of the embedding γ : M1 →M1 × M2, p\nω = γ∗π∗\n2 ω2 =\n→(p, φ(p)), and γ∗ ˆ\n1 ω1 -γ∗π∗\nω1 -φ∗ω2 is 0 ⇔Γφ is Lagrangian.\n\nProf. Denis Auroux\n2. Hamiltonian Vector Fields\nLet M be a manifold.\nDefinition 2. An isotopy on M is a Cinf map ρ : M × R →M s.t. ρ0 = id and ∀t, ρt is a diffeomorphism.\nGiven an isotopy, we obtain a time-dependent vector field vt : p →\nd ρs(q)|\nwhere q = ρ-1(p). We say\nds\ns=t\nt\nthat ρt is the flow of vt. Conversely, if M is compact or vt is sufficiently \"good\", we can integrate to obtain the\nflow from the vector field. If v is time-independent, we obtain a 1-parameter group ρt = exp(tv), with associated\nvector field v. Recall the Lie derivative Lvα = d (exp(tv)∗α)|\ndt\nt=0.\nProposition 2 (Cartan's Formula). Lvα = divα + ivdα.\nIf (ρt) is generated by (vt) then d (ρ∗α) = ρ∗\nα).\ndt\nt\nt (Lvt\nNow, let (M, ω) be a symplectic manifold, H : M →R a Cinf map. Then dH ∈Ω1(M) =⇒∃a unique\nvector field XH s.t. iXH ω = dH, called the Hamiltonian vector field generated by H (H itself is called the\nHamiltonian function). Now, assume that M is compact, or that the flow of XH is well-defined. Then we obtain\nan isotopy ρt : M →M of diffeomorphisms generated by XH.\nProposition 3. ρt are symplectomorphisms.\nd\nProof. Note that dt(ρt\n∗ω) = ρt\n∗(LXH ω) but LXH ω = diXH ω + iXH dω = d2H = 0. Since ρ0 is the identity,\nρ∗\nt ω = ω for all t.\n\nExample. For R2n with coordinates x1, . . . , xn, p1, . . . , pn, the function H(x, p) = 1 |p|2 + V (x) has derivative\ndH = pidpi + ∂V dxi. Thus, the associated vector field is XH = -pi ∂ + ∂V\n∂ , giving us Hamilton's\n∂xi\n∂xi\n∂xi ∂pi\nequations\n(6)\ndxi = -pi = - ∂H , dpi = ∂V = ∂H\ndt\n∂pi\ndt\n∂xi\n∂xi"
    },
    {
      "category": "Lecture Notes",
      "title": "lect04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/864a8cbd55d8d9696a717db38f8668a9_lect04.pdf",
      "content": "SYMPLECTIC GEOMETRY, LECTURE 4\nProf. Denis Auroux\n1. Hamiltonian Vector Fields\nRecall from last time that, for (M, ω) a symplectic manifold, H : M → R a Cinf function, there exists a\nvector field XH s.t. iXH ω = dH. Furthermore, the associated flow ρt of this vector field is an isotopy of\nsymplectomorphisms.\nExample. Consider S2 ⊂ R3 with cylindrical coordinates (r, θ, z) and symplectic form ω = dθ ∧dz (ω is the\nusual area form). Then setting H = z gives the vector field ∂ : the associated flow is precisely rotation by angle\n∂θ\nt.\nNote also that the critical points of H are the fixed points of ρt, and ρt preserves the level sets of H, i.e.\n(1)\ndt\nd (H *ρt) = dt\nd (ρ ∗\nt H) = ρ ∗\nt (LXH H) = ρ ∗\nt (iXH ω(XH)) = ρ ∗\nt (ω(XH, XH)) = 0\nOne can apply this to obtain the ordinary formula for conservation of energy.\nDefinition 1. X is a symplectic vector field if LXω = 0, i.e. iXω is closed. X is Hamiltonian if iXω is exact.\nBy Poincar e, we see that, locally, symplectic vector fields are Hamiltonian. Globally, we obtain a class\n[iXω] ∈H1(M, R).\n∂\n∂\n∂\n∂\nExample. On T 2 , ∂x and ∂y are symplectic vector fields: since dy and dx are not exact, ∂x and ∂y are not\nHamiltonian.\nNow consider time-dependent Hamiltonian functions, i.e. Cinf maps R × M → R, (t, x)\nLet\n→ Ht(x).\nHam(M, ω) denote the space of Hamiltonian diffeomorphisms on ω, i.e. the set of diffeomorphisms ρ s.t. ∃Ht\nwith corresponding flow ρt satisfying ρ1 = ρ.\nRemark. The Arnold conjecture states that for M compact, φ ∈Ham(M, ω) with nondegenerate Fix(φ) (i.e. at\na fixed point p, dφ(p) -id is invertible),\n(2)\n#Fixφ ≥\ndim Hi(M)\nThis statement is false for non-Hamiltonian vector fields, as seen in the case of ∂ on a torus.\n∂x\nWe can measure the difference between symplectomorphisms and Hamiltonian symplectomorphisms via the\nflux function\n(3)\nFlux(ρt) =\n[iXt ω]dt ∈H1(M, R)\nIn general, the flux depends on the homotopy class of the path from the identity to ρ1.\nRemark. The Flux conjecture concerns the integral of the flux on π1Symp(M, ω), i.e. the nature of\n(4)\n⟨Flux, π1Symp(M, ω)⟩⊂H1(M, R)\nGeometrically, for γ : S1 → M a loop, let γt = ρt *γ : S1 → M be the image of γ under ρ and define\nΓ : [0, 1] × S1 →M by (t, s) →\n\nγt(s).\nProblem. ⟨Flux(ρt), [γ]⟩= Area(Γ) = [0,1]×S1 Γ∗ω.\n\nProf. Denis Auroux\n2. Moser's Theorem\nOne can ask whether, for a given manifold M, two symplectic structures ω0, ω1 are equivalent, i.e. whether\nthere is a symplectomorphism M → M which pulls back one to the other. In general, [ω0] = [ω1] does not\nimply that the two structures are symplectomorphic. To study this question further, we give other notions of\nequivalence.\nDefinition 2. Two forms ω0, ω1 are deformation equivalent if ∃(ωt)t∈[0,1] a continuous family of symplectic\nforms, and isotopic if there is such a family with [ωt] constant in H2(M, R).\nRemark. There exist pairs of symplectic forms with the same cohomology class which are not deformation\nequivalent, as well as pairs which are deformation equivalent but not isotopic (in dimension ≥ 6).\nLet M be a compact manifold with ω0, ω1 isotopic symplectic forms (i.e. ∃ωt as above with each ωt nonde\ngenerate).\nTheorem 1 (Moser). ∃ an isotopy ρt : M → M s.t. ρ∗\nt ωt = ω0.\nThat is, (M, ω0) and (M, ω1) are symplectomorphic.\nProof. (This technique is known as Moser's trick.) By assumption, [ωt] is independent of t, i.e. [ dωt ] = 0. Thus,\ndt\ndωt\n∃αt a 1-form s.t.\ndt = -dαt: moreover, we can choose this αt smoothly w.r.t. to t (via the Poincar e lemma).\nSince ωt is nondegenerate, ∃Xt s.t. iXt ωt = αt. Moreover, since M is compact, we have a well-defined flow ρt\nof Xt. Now,\n(5)\nd (ρt\n∗ ωt) = ρt\n∗(LXt ωt) + ρt\n∗\ndωt\n= ρt\n∗(diXt ωt + dωt ) = 0\ndt\ndt\ndt\nSince ρ0 is the identity, we have our desired isotopy.\n\nExample. For symplectic forms ω0, ω1 with [ω0] = [ω1], consider the family ωt = tω0 + (1 - t)ω1. By the above,\nif this family is nondegenerate, the two forms are symplectomorphic. In general, there is no reason for this\nto be true: in dimension 2, it always is. More generally, this follows from compatibility with almost-complex\nstructures.\nTheorem 2 (Darboux). For (M, ω) symplectic, p ∈ M, ∃U ∋ p with a coordinate system (x1, y1, . . . , xn, yn)\ns.t. ω|U =\ndxi ∧ dyi.\nProof. (TpM, ωp) has a standard basis (e1, . . . , en, f1, . . . , fn), so there exist local coordinates (x1, y1, . . . , xn, yn)\ns.t. ωp =\ndxi ∧ dyi. On a neighborhood U of p, we obtain two symplectic forms: ω and the standard form.\nThe family ωt = (1 - t)ω0 + tω1 is one of closed forms: since nondegeneracy is an open condition, we can\nshrink our neighborhood to assure that ωt is nondegenerate for each t on some U ′ ∋ p. Thus, ∃α ∈ Ω1(U) s.t.\nω1 - ω0 = -dα. Subtracting a constant, we can assume αp = 0. Let vt be the vector field on U s.t. ivt ωt = α.\nThen ∃U ′′ ∋ p s.t. its flow ρt is defined ∀t. By the Moser's trick, we fnd that ρ∗\n1ω1 = ω0, implying that the\nsymplectic form is indeed standard after composing our chosen coordinates with ρ1."
    },
    {
      "category": "Lecture Notes",
      "title": "lect05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/238234d53148cb71c5880e529a96c73f_lect05.pdf",
      "content": "SYMPLECTIC GEOMETRY, LECTURE 5\nProf. Denis Auroux\nLast time we proved:\nTheorem 1 (Moser).\n(M, ω1).\nLet M be a compact manifold, (ωt) symplectic forms, [ωt] constant = ⇒ (M, ω0) ∼=\nTheorem 2 (Darboux). Locally, any symplectic manifold is locally isomorphic to (R2n, ω0).\n1. Tubular Neighborhoods\nLet M n ⊃ Xk be a submanifold with inclusion map i. Then we get a map dxi : TxX ,→ TxM, with associated\nnormal space NxX = TxM/TxX. Note that if there is a metric, one can identify this with the orthogonal space\nto X at x. Putting all these spaces together, we get a normal bundle NX = {(x, v)|x ∈ X, v ∈ NxX} with zero\nsection i0 : X → NX, x 7→ (x, 0).\nTheorem 3. ∃U0 a neighborhood of X in NX (via the 0-section) and U1 a neighborhood of X in M s.t.\n∃φ : U0\n∼ U1 a diffeomorphism.\n→\nProof. (Idea) Equip M with a Riemannian metric g, so NxX\n∼ TxX⊥ ⊂ TxM. Then, given x ∈ X, v ∈ NxX\np\n→\nfor |v| sufficiently small (|v| =\ng(v, v) < ), we obtain an exponential function expx(v) (defined by considering\na small geodesic segment with origin x and tangent vector v). We obtain a map U0 → M, (x, v) 7→ exp (v). For\nx\nx ∈ X, T(x,0)(NX) = TxX ⊕ NxX and\n(1)\nd(x,0) exp(u, v) = u + v ∈ TxX ⊕ TxX⊥\nthis giving us a local diffeomorphism near the 0-section. Thus, locally on some neighborhood of the 0-section\nin NX, exp induces a diffeomorphism onto exp(U0) = neighborhood of X in M.\n\nLet U1 = {expx(v)| |v| < 0(x)} ⊂ M be a tubular neighborhood of X in M as constructed above, with\nU0 ⊂ NX the corresponding neighborhood of the zero section. Via the projection π : U0 → X, whose fibers are\nballs in Rn-k, we see that U1 retracts onto X, i.e. we have a null-homotopic map U1\nπ X\ni U1.\n→\n→\nCorollary 1. i∗ : H∗(U1, R)\nH∗(X, R) is an isomorphism.\n→\nProposition 1. β ∈ Ω`(U), dβ = 0, i∗β = β|X = 0 =⇒∃μ ∈ Ω`-1(U), β = dμ and μx = 0 ∀x ∈ X.\nProof. Identify U ∼= U0 ⊂ NX, set ρt : (x, v) 7→ (x, tv), and let\nZ 1\n(2)\nμ(x,v) =\nρt\n∗(i(0,v)β)dt\nThen μ = 0 on the zero section, and\nZ 1\n(3)\ndμ =\nρ∗\nt (diXt β)dt\nwhere Xt(x, tv) = (0, v). Since β is closed, diXt β = LXt β, so\nZ 1\n(4)\ndμ =\nd (ρ∗\nt β)dt = ρ∗\n1β - ρ∗\n0β = β - π∗i∗β = β\ndt\nTheorem 4 (Local Moser). Let X ,→ M be a submanifold, ω0, ω1 symplectic forms on M s.t. (ω0)p = (ω1)p∀p ∈\nX. Then ∃ neighborhoods U0, U1 ⊃ X and φ : U0\n∼ U1 s.t. φ∗ω1 = ω0 and φ X = id.\n→\n|\n\nProf. Denis Auroux\nThat is, we have a symplectomorphism (U0, ω0)\n∼ (U1, ω1) commuting with the inclusion of X.\n→\nProof. Let U0 be a tubular neighborhood of X. Since ω1 - ω0 is closed and is 0 on X, by the above proposition\nwe have a form μ ∈ Ω1(U0) s.t. ω1 - ω0 = dμ and μ is 0 along X. Now, let ωt = (1 - t)ω0 + tω1: these form a\nfamily of closed two-forms which are ω0 along X and thus nondegenerate at X. Since nondegeneracy is an open\ncondition, ∃U0\n0 ⊂ U0 on which ωt is symplectic ∀t. ∃vt a vector field on U0\n0 s.t. ivt ωt = -μ with vt = 0 along\nX. Letting ρt be the flow of vt, we find that ρt is the identity along X, and ∃ a neighborhood U 00 on which the\nflow is well defined. Finally,\n(5)\nd (ρ∗\nt ωt) = ρ∗\nt\nLvt ωt + dωt\n= ρt\n∗(-dμ + (ω1 - ω0)) = 0\ndt\ndt\nProposition 2. Let X ,\n(M, ω) be a Lagrangian submanifold. Then NX\n∼ T ∗X.\n→\n→\nProof. E ⊂ (V, Ω) a Lagrangian subspace = ⇒ Ω : V → V ∗ E∗, v 7→ Ω(v, ·) is onto with kernel ∼\n= E,\n∼\n= E⊥Ω\nso V/E ∼\n\n= E∗.\nTheorem 5 (Weinstein's Lagrangian Neighborhood). Let (M, ω) be a symplectic manifold, i : X ,\nM a closed\n→\nLagrangian submanifold, i0 : X → (T ∗X, ω0) the zero-section. Then ∃U0 a neighborhood of X in T ∗X and U a\nneighborhood of X in M s.t. we have a symplectomorphism (U0, ω0)\n∼ (U, ω) which is the identity on X.\n→\nProof. NX ∼= T ∗X, so ∃N0 ⊃ X in T ∗X, N ⊃ X in M, and a diffeomorphism ψ : N0\n∼ N which preserves X.\n→\nNow, let ω0 be the canonical form on T ∗X and ω1 = ψ∗ω. These are both sympectic forms on N0 ⊂ T ∗X s.t.\nthe zero section X is Lagrangian for both.\nWe claim that we can build (canonically) a family of isomorphisms Lp : TpN0 → TpN0 for p ∈ X s.t.\nLp|TpX = id and (Lp\n∗ω1)p = (ω0)p. By Whitney's extension theorem, ∃ a neighborhood N 0 ⊃ X and an\nembedding h : N 0 ,\nN0 s.t.\n→\n(6)\nh|X = id, dhp = Lp∀p ∈ X\n(Idea: use a Riemannian metric, and set h(p, ξ) = expp,0 Lp(0, ξ)). Then ∀p ∈ X, (h∗ω1)p = (ω0)p, so we can use\nlocal Moser for h∗ω1 and ω0. We therefore obtain U0, U1 ⊃ X and a local symplectomorphism f : (U0, ω0)\n∼\n(U1, h∗ω1). Setting φ = ψ * h * f gives us the desired result.\n→\nTo prove the claim, decompose T(p,0)N0 = TpX ⊕ Tp\n∗X, with a chosen basis for TpX and the dual basis for\nT ∗X. We have two symplectic forms on this space, namely ω0 =\nI\n0 -\nI\n, ω =\nB\n-\nC\nBt\n. That is, we\np\nknow that\n(7)\nω0((v1, ξ1), (v2, ξ2)) = ξ1(v2) - ξ2(v1)\nand ω|TpX = 0. We want to find a matrix L =\nI\n∗\ns.t. LtωL = ω0. Setting\n∗\nI\n1 B-1CB-t\n(8)\nL =\n-\nB-t\ngives the desired matrix: furthermore, the construction doesn't depend on the choice of basis."
    },
    {
      "category": "Lecture Notes",
      "title": "lect06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/1168a558edf107963f1a5ef030c93926_lect06.pdf",
      "content": "P\nZ\nZ\nSYMPLECTIC GEOMETRY, LECTURE 6\nProf. Denis Auroux\n1. Applications\n(1) The work done last time gives us a new way to look at TidSymp(M, ω) (using C1-topology, wherein\nfi : X\nY converges to f iff fi\nf uniformly on compact sets and same for dfi : TX\nTY .\n→\n→\n→\nNow, f ∈ Symp(M, ω) gives a graph graph(f) = {(x, f(x))} ⊂ (M × M, pr∗\n1ω - pr2\n∗ω) which is a\nLagrangian submanifold. If f is C1-close to the identity map, then graph(f) is C1-close to the diagonal\nΔ = {(x, x)} ⊂ (M × M, pr∗\n1ω - pr2\n∗ω) (i.e. the graph of the identity map). By Weinstein, a tubular\nneighborhood of Δ is diffeomorphic to U0 ⊂ (T ∗M, ωT ∗M ), and the graph of f gives a section (C1-close to\nthe zero section), i.e. the graph of a C1-small μ ∈ Ω1(M). The fact that its graph is Lagrangian implies\nthat μ is closed, i.e. dμ = 0. Thus, we have an identification Tid(Symp(M, ω)) ∼\ndμ = 0} with\n= {μ ∈ Ω1|\nC1 topologies.\n(2)\nTheorem 1. For (M, ω) compact, if H1(M, R) = 0, then every symplectomorphism of M which is C1\nclose to the identity has ≥ 2 fixed points.\nTheorem 2. For (M, ω) symplectic, X ⊂ (M, ω) compact and Lagrangian, if H1(X, R) = 0, then every\nLagrangian submanifold of M which is C1 close to X intersects X in ≥ 2 points.\nThe first theorem follows from the second, using the diagonal embedding Δ ⊂ M × M. To see the\nsecond theorem, note that H1(X) = 0 implies that, given any graph Y = graph(μ) C1-close to X with\ndμ = 0, we have μ = dh for some h : X → R. Since such an h must have at least 2 critical points, ∃ at\nleast 2 points at which μ = 0, i.e. points at which Y intersects X.\n2. Arnold Conjecture\nArnold's conjecture: Let (M, ω) be compact, f ∈ Ham(M, ω) the time 1 flow of XHt for Ht : M → R a\n1-periodic Hamiltonian (H : M × R → R smooth with Ht+1 = Ht). Then the number of fixed points of f is at\nleast the minimal number of critical points of a smooth function on M. Moreover, assume the fixed points of f\nare nondegenerate, i.e. if f(x) = x then det (dxf - id) = 0. Then #Fix(f) is at least the minimal number of\ncritical points of a Morse function on M, which in turn is ≥\ndim Hi(M).\ni\nRemark. The last inequality follows from classical Morse theory. Given a Morse function f on a manifold\nM (equipped with a Riemannian metric satisfying the Morse-Smale condition), we have the Morse complex\nCi generated by critical points of index i, and the Morse differential d : Ci\nCi+1 which counts gradient\ntrajectories between critical points. Then H∗(C∗, d) ' H∗(M), so #Fix(f) = P→\ndim Ci ≥ P dim Hi .\nThe case where Ht = H is independent of t is easy: if p is a critical point of H then XH (p) = 0 so the flow f\nfixes p. The general case was proved by Conley-Zehnder, Floer, Hofer-Salamon, Ono, Fukaya-Ono, Li-Tian, ...\nusing Floer homology. Floer homology is formally the inf-dimensonal Morse theory of a functional on a covering\nof the loop space, g = {γ : S1\nM contractible + homotopy class of disc with ∂D = γ}:\nΩM\n→\n(1)\nΩM\nR, AH (γ) = -\nH(t, γ(t)) dt\nAH : g →\nD2 u∗ω -\nS1\nwhere the first term involves u : D2\nM with u(∂D) = γ in the given homotopy class.\n→\n\nGiven v : S1\nγ∗TM (a vector field along γ), the differential of AH is given by\n→\nZ\nZ\nZ\nDAH (γ)(v) = -\nω(v(t), γ (t)) dt -\ndHt (γ(t))(v(t)) dt =\n(iγ (t)ω - dHt)(v(t)) dt.\nS1\nS1\nS1\nSince dHt = iXt ω, this vanishes ∀v if and only if γ(t) = Xt(γ(t)), i.e. γ is a periodic orbit of the flow. Hence\ncritical points of AH correspond to fixed points of f. Moreover, formally gradient trajectories of AH correspond\nto solutions u : R × S1 × M, (s, t) 7→ u(s, t) of the PDE\n∂u\n∂u\n(2)\n∂s + J(u)\n∂t -rHt(u) = 0.\nProf. Denis Auroux"
    },
    {
      "category": "Lecture Notes",
      "title": "lect07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/9188ed65ddf5e1662307d486b2c0418f_lect07.pdf",
      "content": "P\nP\nSYMPLECTIC GEOMETRY, LECTURE 7\nProf. Denis Auroux\n1. Floer homology\nFor a Hamiltonian diffeomorphism f : (M, ω)\n(M, ω), f = φH\n1 , Ht : M\nR 1-periodic in t, we want to look\n→\n→\nfor fixed points of f, i.e. 1-periodic orbits of XH , x0(t) = XHt (x(t)). We consider the Floer complex CF ∗(f),\nwhose basis are 1-periodic orbits; these correspond to critical points of the action functional AH on a covering\nof the free loop space Ω(M). The differential 'counts' solutions of Floer's equations\n(1)\nu : R × S1\nM, ∂u + J(u(s, t))( ∂u\n(u)) = 0\n→\n∂s\n∂t - XHt\nsuch that lims→±inf u(s, ·) = x± (1-periodic orbits). The solutions are formal gradient flow lines of AH between\nthe critical points x±.\nTheorem 1 (Arnold's conjecture). If the fixed points of f are nondegenerate, then #Fix(f) ≥\ndim Hi(M),\ni\ni.e. #Fix(f) = rk CF ∗ ≥ rk HF ∗ = rk H∗(CF ∗, ∂) = rkH∗(M).\n1.1. Lagrangian intersections. There is a notion of Lagrangian Floer homology, which is not always defined\n(in fact, there are explicit obstructions to its existence). The idea is to count intersections of Lagrangian\nsubmanifolds L, L0 ⊂ M in a manner which is invariant under Hamiltonian deformations (isotopies). Assume\nthat L and L0 are transverse (if not, e.g. when L = L0, replace the submanifold L by the graph Lt of an\nexact 1-form in T ∗L). To define Floer homology, one defines a complex CF ∗(L, L0) whose basis is the set of\nintersection points, and whose differential is given by ∂p =\nq np,qq, where np,q counts solutions to\n(2)\nu : R × [0, 1]\nM, u(R × 0) ⊂ L, u(R × 1) ⊂ L0, ∂u + J ∂u = 0\n→\n∂s\n∂t\nUnder suitable assumptions, one finds that ∂2 = 0, giving us a Floer homology\n(3)\nHF ∗(L, L0) = H∗(CF ∗(L, L0), ∂)\nwhich is invariant under Hamiltonian deformations of L, L0. Moreover, rk HF ∗ ≤ rk CF ∗ = |L ∩ L0|.\nTheorem 2 (Floer, Oh, Fukaya-Oh-Ohta-Ono). Given a compact Lagrangian submanifold L ⊂ M which is\n\"relatively spin\" (i.e. w2(TL) ∈ Im{i∗ : H2(M, Z/2Z)\nH2(L, Z/2Z)}) s.t. i\n: H1(L, Q)\nH1(M, Q) is\n→\n∗ P\n→\ninjective, then ∀ψ ∈ Ham(M, ω) s.t. ψ(L) intersects L transversely, #(L ∩ ψ(L)) ≥\ndim Hi(L, Q).\nRemark. Applying this theorem to the diagonal Δ = Δ(M) ⊂ M × M and the graph of a Hamiltonian\ndiffeomorphism f on M, one recovers Arnold's conjecture.\n2. Almost-Complex Structures\nTo begin, we will study complex structures on vector spaces.\nDefinition 1. A complex structure on a vector space V is an endomorphism J : V → V s.t. J2 = -I.\nThinking of this J as multiplication by i turns V into a complex vector space, (x + iy)v = xv + yJv. If V is\na symplectic vector space with symplectic form Ω, a complex structure is compatible if G(u, v) = Ω(u, Jv) is a\npositive symmetric inner product. Note that being symmetric is equivalent to Ω(Ju, Jv) = Ω(u, v), and being\npositive is precisely Ω(u, Ju) > 0 ∀u = 0\n.\n\nProf. Denis Auroux\nExample. Let V = (R2n , Ω0) be the standard symplectic vector space, with standard basis e1, . . . , en, f1, . . . , fn,\nand define J0 by ei 7→ fi, fi 7→ -ei. Then\n(4)\nJ0\n2 = -id , G0(u, v) = Ω0(u, J0v) = ⇒ G0(ei, ei) = 1, G0(fi, fi) = 1\nand all other pairings are 0. In matrix terms, Ω0 =\n-\nI\nI\n, and J0 =\nI\n0 -\nI\n, so G0 = Ω0J0 = I.\nThis gives us a natural isomorphism with Cn .\nProposition 1. If (V, Ω) is a symplectic vector space, ∃ a compatible J. Moreover, given any positive inner\nproduct h·, ·i on V , we can build an Ω-compatible complex structure on V canonically (though it has no direct\nrelation to the given inner product).\nProof. For the first part, taking J = J0 in a standard basis gives the desired endomorphism. For the second\npart, by the nondegeneracy of Ω, we have isomorphisms u 7→ Ω(u, ) and u 7→ hu, ·i from V to V ∗. We thus\n·\nobtain an endomorphism A = hi-1 * Ω s.t. Ω(u, v) = hAu, vi. A is invertible and skew-symmetric w.r.t. hi,\ni.e. A∗ = -A (since Ω(v, u) = hAv, ui = hv, A∗ui = hA∗u, vi = -Ω(u, v) = -hAu, vi). Thus, AA∗ = -A2 is\nsymmetric and positive definite, therefore diagonalizable with real, strictly positive eigenvalues. This implies\nthe existence of a square root\n√\nAA∗(= diag(√λi)), so define J = (\n√\nAA∗)-1A. (Note that the decomposition\nA =\n√\nAA∗J gives a \"polar decomposition\" of A.) A commutes with\n√\nAA∗: letting Vi be the eigenspace of\nAA∗ with eigenvalue λi, or similarly that of\n√\nAA∗ with eigenvalue √λi, we find that,\n(5)\n∀v ∈ Vi, (AA∗)Av = -A3 v = A(AA∗)v = λiAv = ⇒ Av ∈ Vi\nSo J also commutes with A and with\n√\nAA∗, and thus is skew-symmetric\n(6)\nJ∗ = A∗(\n√\nAA∗)-1 = -A(\n√\nAA∗)-1 = -J\nand orthogonal\n(7)\nJ∗J = A∗(\n√\nAA∗)-1(\n√\nAA∗)-1A = id\nIn particular, J2 = -J∗J = -id. For compatibility, note that\nΩ(Ju, Jv) = hAJu, Jvi = hJAu, Jvi = hAu, vi = Ω(u, v)\n(8)\nΩ(u, Ju) = hAu, Jui = h-JAu, ui = h-(\n√\nAA∗)-1AAu, ui\n= h(\n√\nAA∗)-1(AA∗)u, ui = h(\n√\nAA∗)u, ui > 0\nthus completing the proof.\n\nRemark. Note that G(u, v) = Ω(u, Jv) = h\n√\nAA∗u, vi, so if h·, ·i was already compatible with Ω, then AA∗ =\nI, J = A, G = h·, ·i.\nDefinition 2. An almost-complex structure on a manifold M is J ∈ End(TM) s.t. J2 = -I (i.e. ∀x ∈ M, Jx\nis a complex structure on TxM). If M = (M, ω) is a symplectic manifold, J is compatible if ∀x ∈ M, Jx is\nωx-compatible, with associated Riemannian metric gx(u, v) = ωx(u, Jxv). We say that (ω, g, J) is a compatible\ntriple, with any two determining the third."
    },
    {
      "category": "Lecture Notes",
      "title": "lect08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/ae6565bbfacae2e53361e06acc340213_lect08.pdf",
      "content": "-\nSYMPLECTIC GEOMETRY, LECTURE 8\nProf. Denis Auroux\n1. Almost-complex Structures\nRecall compatible triples (ω, g, J), wherein two of the three determine the third (g(u, v) = ω(u, Jv), ω(u, v) =\ng(Ju, v), J(u) = g-1( ω(u)) where g, ω are the induced isomorphisms TM\nT ∗M).\n→\nProposition 1. For (M, ω) a symplectic manifold with Riemannian metric g, ∃ a canonical almost complex\nstructure J compatible with ω.\nIdea. Do polar decomposition on every tangent space.\n\nCorollary 1. Any symplectic manifold has compatible almost-complex structures, and the space of such struc\ntures is path connected.\nProof. For the first part, using a partition of unity gives a Riemannian metric, so the rest follows from the\nproposition. For the second part, given J0, J1, let gi = ω( , Ji·) for i = 0, 1 and set gt = (1 - t)g0 + tg1. Each\n·\nof these (for t ∈ [0, 1]) is a metric, and gives an ω-compatible J t by polar decomposition, with J 0 = J0 and\nJ 1 = J1.\n\nThe mechanism of the proof also gives\nProposition 2. The set J (TxM, ωx) of ωx-compatible complex structures on TxM is contractible, i.e. ∃ht :\nJ (TxM, ωx) →J (TxM, ωx) for t ∈ [0, 1], h0 = id, h1 = J → J0, ht(J0) = J0∀t.\nCorollary 2. The space of compatible almost-complex structures on (M, ω) is contractible. It is the space of\nsections of a bundle whose fibers are contractible by the previous proposition.\nMore generally, let E\nM be a vector bundle.\n→\nDefinition 1. A metric on E is a family of positive-definite scalar products h·, ·ix : Ex × Ex\nR. E is\nsymplectic (resp. complex) if there is a family of nondegenerate skew-symmetric forms ωx : Ex × Ex\n→\nR (resp.\ncomplex structures Jx : Ex → Ex, Jx\n2 = -1).\n→\nThen metrics always exist, and every sympletic vector bundle is a complex vector bundle and vice versa.\nProposition 3. For (M, J) an almost-complex manifold, ω0, ω1 two symplectic forms compatible with J, ωt =\n(1 - t)ω0 + tω1 is symplectic and J-compatible ∀t ∈ [0, 1] (i.e. the space of J-compatible ω is convex).\nNote that\n- The space of such ω might be empty, as there are almost complex manifolds (like S6) which have no\nsymplectic structures.\n- Not every manifold has an almost-complex structure (e.g. S4, by the Ehresman-Hopf theorem).\nProblem. ∃ an almost-complex structure ⇔∃ a nondegenerate 2-form.\nThe proposition works if we put tame instead of compatible, i.e. require ω(u, Ju) > 0 ∀u = 0 but not\nsymmetry.\nProof. ωt is closed and ωt(u, Ju) = (1 - t)ω0(u, Ju) + tω1(u, Ju) > 0 ∀u 6= 0, so ωt is nondegenerate and thus\nsymplectic. Moreover, gt(u, v) = ωt(u, Jv) = (1 - t)g0(u, v) + tg1(u, v) is a metric.\n\nDefinition 2. X ⊂ (M, J) is an almost-complex submanifold if J(TX) = TX, i.e. ∀x ∈ X, v ∈ TxX, Jv ∈ TxX.\n\nP\nProf. Denis Auroux\nProposition 4. If X is an almost-complex submanifold in compatible (M, ω, J), then X is symplectic (i.e. ω|X\nis nondegenerate).\nProof. ∀u ∈ TxX, u = 0\n, Ju ∈ TxX and ω(u, Ju) > 0, so ∀u ∈ TxX r {0}, ω(u, ·)|TxX ∈ Tx\n∗X is nonzero, giving\nus an isomorphism TX\nT ∗X as desired.\n\n→\nLet (R2n , Ω0, J0, g0) be the standard symplectic structure, complex structure, and metric on R2n .\n- Sp(2n, R) is the group of linear symplectomorphisms of (R2n , Ω0), i.e. {A ∈ GL(2n, R)|Ω0(Au, Av) =\nΩ(u, v) ∀u, v}.\nGL(n, C) is the group of C-linear automorphisms of (R2n, J0), i.e. {A AJ0 = J0A}.\n-\nO(2n) is the group of isometries of (R2n, g0), i.e. {A AtA = 1}.\n|\n-\nU(n) = GL(n, C) ∩ O(2n).\n|\n-\nProposition 5. Sp(2n) ∩ O(2n) = Sp(2n) ∩ GL(n, C) = O(2n) ∩ GL(n, C) = U(n).\nProof. The intersection of any two of these sets is the set of automorphisms preserving two of the three in a\ncompatible triple, and thus must preserve all of them.\n\n- For (V, Ω, J) a symplectic vector space with compatible almost-complex structure, ∃ an isomorphism\n(V, Ω, J)\n∼ (R2n , Ω0, J0).\n→\n- The space Ω(V ) of all symplectic structures on V is ∼\n= GL(2n, R)/Sp(2n), as GL(V )\n= GL(V )/Sp(V, Ω0) ∼\nacts transitively on Ω(V ) by φ 7→ φ∗Ω0 with stabilizer Sp(V, Ω).\n- The space J (V ) of almost-complex structures on V is ∼\n= GL(2n, R)/GL(n, C).\n= GL(V )/GL(V, J) ∼\n- The space J (V, Ω) of Ω-compatible J's on V is ∼\n= Sp(2n, R)/U(n).\n= Sp(V, Ω)/Sp(V, Ω) ∩ GL(V, J) ∼\n- The constractibility of J (V, Ω) is now the fact that Sp(2n, R) retracts onto its subgroup U(n).\n2. Vector Bundles and Connections\nFor E\nM a real or complex vector bundle, we have an exact sequence\n→\n(1)\nEx\nTpE\ndπ TxM\n→\n→\n→\n→\nfor each p ∈ E, x = π(p). Here, Ex ⊂ TpE gives the set of vertical directions: we would like a splitting\nTpE = Ex ⊕ (TpE)horiz , i.e. a way to transport from one fiber to another. The data required to do this is a\nconnection.\nDefinition 3. A connection r on E is an R or C-linear mapping Cinf(M, E) → Cinf(M, T ∗M ⊗E) = Ω1(M, E)\ns.t. r(fσ) = df σ + frσ. For v ∈ TxM, we let rv denote the mapping σ 7→ rσ(v).\n·\nChoose a local trivialization of E, i.e. a frame of sections ei s.t. Rr (or Cr)×U ∼\nU , (ξ1, . . . , ξr\nP\nP\n= E|\n) 7→\nξiei.\nThen rσ = r(\nξiei) =\n(dξi)ei + ξirei, i.e. locally r = d + A, where A = (aij ) ∈ Ω1(M, End(E))\nis a matrix-valued 1-form (the connection 1-form) with aij the component of rej along ei. Globally, given\nr, r0, r(fs) -r0(fs) = f(rs -r0s), so r -r0 is Cinf(M, E)-linear and the space of connections is an affine\nspace modeled on Ω1(M, End(E)).\n2.1. Horizontal Distribution. Let σ : M\nE be a section, dxσ : TxM\nTσ(x)E the induced map. Then\n→\n→\nrσ(x) ∈ Tx\n∗M ⊗ Ex depends only on dσ(x). Thus, we can also think of r as a projection πr : Tσ(x)E → Ex,\nwith rvσ = πr(dσ(v)). Then Hr = Ker πr is the horizontal subspace at p(x).\nDefinition 4. For h·, ·i a Euclidean or Hermitian metric on E, r is compatible with the metric if dhσ, σ0i =\nhrσ, σ0i + hσ, rσ0i.\nAs above, locally one can find an orthonormal frame of sections (ei), hei, ej i = δi,j . Writing r = d + A in\nthis trivialization, the compatibility becomes\n(2)\nhrξ, ηi + hξ, rηi = hdξ, ηi + hAξ, ηi + hξ, dηi + hξ, Aηi\nSince dhξ, ηi = hdξ, ηi + hξ, dηi, this means that the connection 1-form A must be skew-symmetric (or anti-\nHermitian).\nAlso note that r on E induces a r∗ on E∗ by d(φ(σ)) = hr∗φ, σi + hφ, rσi, and similarly for E ⊗ F , etc."
    },
    {
      "category": "Lecture Notes",
      "title": "lect09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/4a7f8380afdfdf71421eaf31cd13f0fa_lect09.pdf",
      "content": "P\nP\nX\nX\nX\nX\nX\nX\nX\nX\nX\n`\nP\nP\nP\n\nSYMPLECTIC GEOMETRY, LECTURE 9\nProf. Denis Auroux\n1. Curvature\nLet r be a connection as before: then we get a curvature tensor Rr ∈ Ω2(M, End(E)), i.e. a matrix of\n2-forms (in local coordinates).\nDefinition 1. Given a local section σ and vector fields U, V ,\n(1)\nRr(U, V )σ = rU rV σ -rV rU σ -r[U,V ]σ\nProposition 1. Rr is a tensor (i.e. it is defined pointwise, depending only on σ(x) and not on its derivatives).\n∂\nRemark. Use local coordinates, let fi = ∂xi : then Rr =\ni<j (rfi rfj σ -rfj rfi σ)dxi ∧ dxj .\nIn a local trivialization (ei), r = d + A, A ∈ Ω1(End E), i.e. rej =\ni aij ei. Then\n(2)\nRr(U, V )ej = rU (\naij (V )ei) -rV (\naij (U)ei) -\naij ([U, V ])ei\ni\ni\ni\n=\n(U\naij (V ))ei +\naki(U)aij (V )ek -\n(V\naij (U))ei -\naki(V )aij (U )ek -\naij ([U, V ])ei\n·\n·\ni\ni,k\ni\ni,k\ni\nThe component along ei is\n(3)\nRr(U, V ) = U\naij (U) - aij ([U, V ]) +\nij\naij (V ) - V\nai`(U)a`j (V ) - ai`(V )a`j (U)\n·\n·\nThat is, Rr = daij +\n` ai` ∧ a`j .\nij\nRemark. We can take this as the definition of Rr, i.e. write Rr = dA + A ∧ A.\nIf we change trivializations (e1, . . . , en\n1, . . . e0 ) via e0\nj =\ngij ei s.t. g is a matrix-valued function, then\nP\nP\n) 7→ (e0\nn\nwe can write s =\nξj\n0 e0\nj =\ngij ξj\n0 ei. In other words, if s corresponds to a vector ξ in the trivialization (ei) and ξ0\nin the trivialization e0, then ξ = gξ0, i.e. ξi =\ngij ξj\n0 . Now we write rs in the trivialization: r(ξ)e = (dξ +Aξ)e\ni\nfor A the connection 1-form in the trivialization (ei). Changing trivializations gives r(g-1ξ)e0 = g-1(dξ+Aξ)|e0 ,\n(???)\ni.e. r(ξ0)e0 = (g-1(d(gξ0) + Agξ0))e0 = dξ0 + (g-1Ag + g-1d(g))ξ0. Thus, the connection 1-form in the new\ntrivialization is A0 = g-1Ag + g-1dg (as matrix-valued form).\nProposition 2. dA0 + A0 ∧ A0 = g-1(dA + A ∧ A)g, i.e. Rr = dA + A ∧ A is a well-defined element of\nΩ2(M, EndE) independently of trivialization.\nRecall that the product here is matrix multiplication, with the entries 1-forms multiplied under ∧.\nProof. First, gA0 = Ag + dg: taking exterior derivatives, we get dg ∧ A0 + gdA0 = dA g - A ∧ dg + 0. Thus,\n·\ng(dA0 + A0 ∧ A0) = (dA g - A ∧ dg - dg ∧ A0) + gA0 ∧ A0\n·\n(4)\n= dA · g - A ∧ dg - dg ∧ A0 + (Ag + dg) ∧ A0\n= dA g - A ∧ dg + Ag ∧ A0\n·\n= dA g - A ∧ dg + A ∧ (dg + Ag) = (dA + A ∧ A)g\n·"
    },
    {
      "category": "Lecture Notes",
      "title": "lect10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-966-geometry-of-manifolds-spring-2007/2e7d5aae3c1b3c6f935960608851165b_lect10.pdf",
      "content": "P\nP\nSYMPLECTIC GEOMETRY, LECTURE 10\nProf. Denis Auroux\n1. Curvature and the Covariant Derivative\nLet r be a connection, Rr ∈ Ω2(M, End E) its curvature, where\n(1)\nRr(u, v)s = rurvs -rvrus -r[u,v]s\nLast time, we saw that in a local trivialization, r = d + A, where A is a 1-form with values in End(E), and\nRr = dA + A ∧ A. Moreover, a change of basis given by g ∈ Cinf(U, End(E)) acts by\n(2)\nA 7→ g-1Ag + g-1dg, Rr 7→ g-1Rrg\nWe can extend the covariant derivative r\nΩp+1(M, E). Locally, Ωp(M, E) is given by sums\nCinf(M, E) →\nαisi, where αi\nΩ1(M, E) to an operator dr : Ωp(M, E)\n:\n→\n⎞\n⎛\n= dxi1 ∧· · ·∧dxip are p-forms and ei\nIn a trivialization r = d + A, we have\nip\n= si1 ···\nare sections of E, and dr maps this to\n(rsi) ∧ αi + sidαi.\n⎞\nα\nα\nα\n⎛\n⎞\n⎛\n⎜\n⎝\n. . .\n⎟\n⎠= d ⎜\n⎝\n. . .\n⎟\n⎠+ A ∧ ⎜\n⎝\n. . .\n⎟\n⎠\n(3)\ndr\nαr\nαr\nαr\nThat is, dr = d + A ∧ ( ).\n·\nProposition 1. Rr = (dr)2 : Ω0(M, E)\ndr Ω1(M, E)\ndr Ω2(M, E). More generally,\n→\n→\n(4)\nRr ∧· = (dr)2 : Ωp(M, E) → dr Ωp+1(M, E) → dr Ωp+2(M, E)\nProof. In a local trivialization,\n(5)\ndr(drα) = dr(dα + A ∧ α) = d(dα + A ∧ α) + A ∧ (dα + A ∧ α)\n= (dA) ∧ α - A ∧ dα + A ∧ dα + A ∧ A ∧ α = (dA + A ∧ A) ∧ α\nas desired.\n\nRemark. Rr can be thought of as an obstruction for 0\nCinf(E)\ndr\nΩ1(E)\ndr\nbeing a complex. If the\n→\n→\n→· · ·\nmanifold is flat, i.e. Rr = 0, then we obtain a twisted de Rham cohomology with coefficients in E. Rr is\nalso an obstruction to the integrability of the horizontal distribution Hr, i.e. homotopy invariance of parallel\ntransport.\nWhen E = TM for (M, g) a Riemannian manifold, there is a unique metric (X\ng(u, v) = g(rX u, v) +\n·\ng(u, rX v)) connection on TM s.t. rX Y -rY X = [X, Y ], called the Levi-Cevita connection. Now, let\n(M, ω, g, J) be a symplectic manifold with a compatible almost complex structure. Then TM is a complex\nvector bundle, but rLC is not C-linear in general. Indeed, it is C-linear ⇔rJ = 0 for the induced connection\nr on End(TM) ⇔ J is integrable (i.e. an actual complex structure).\n2. Complex Vector Bundles and Chern Classes\nLet L → M be a complex line bundle, r a connection (possibly Hermitian w.r.t. a Hermitian metric h·, ·i).\nIn a local trivialization, Rr = dA ∈ Ω2(M, C) (resp. Ω2(M, iR)) since A ∈ Ω1(U, C) (resp. Ω1(M, iR)) has\nA ∧ A = 0. Thus, Rr is a closed 2-form, and has a corresponding class c = [Rr] ∈ H2(M, C) (resp. Ω2(M, iR)).\nFor r0 another connection, we have a global decomposition r0 = r + a for a ∈ Ω1(M, C), so Rr0 = Rr + da\nand [Rr] = [Rr0 ]. Thus, c is an invariant of L independent of r in H2(M, C) (resp. H2(M, iR)). Since we can\nalways choose a connection compatible with a given Hermitian form, we have\n\nProf. Denis Auroux\nDefinition 1. The first Chern class of L is c1(L) = [ 1 Rr] ∈ H2(M, R).\n2π\nRemark. From algebraic topology, we can obtain an associated integer class c1(L) ∈ H2(M, Z) corresponding\nto this form.\nNow, let E → M be a complex vector bundle with connection r.\nDefinition 2. The total Chern form is\ni\nM\n(6)\nc(E, r) = det (I + 2π Rr) ∈\nΩp(M, C)\np even\nDecomposing this element, we obtain projections cj (E, r) ∈ Ω2j (M, C). Here I + i Rr is a matrix with\n2π\nentries (const + 2-forms) in a local trivialization, and det is the usual determinant under the ∧ product. As\nbefore, this is independent of change of basis.\nRemark. By the formula for det (I + tM) = 1 + t Tr(M) +\n, we find that c1(E, r) = i Tr(Rr), and\n·\n· · ·\n2π\n\nr\ni\n(7)\ncr(E, r) =\n2π\ndet Rr\nWe can do the same for any ad-invariant polynomial in Rr, giving Chern-Weil theory (for complex vector\nbundles, simply get functions of c1, . . . , cr).\nTheorem 1. cj (E, r) is closed, and cj (E) = [cj (E, r)] ∈ H2j (M, R) is independent of r.\nProof. Closedness follows from the Bianchi identity for dr(Rr), and independence follows from showing that\ncj (E, r0) - cj (E, r) is a sum of exact terms.\n\nRemark. Another approach involves the Euler class of an oriented rank k real vector bundle E\nM over\n→\na compact, oriented manifold M. Let s be a section of E, chosen so s is transverse to the zero section and\nZ = s-1(0) is a smooth, oriented submanifold of codimension k. Then, at a point of Z, rs : NZ → E|Z is an\nisomorphism. We define e(E) = [Z] ∈ Hn-k(M, Z) ∼= Hk(M, Z) by Poincar e duality. If E was a rank r C-vector\nbundle, then cr(E) = e(E).\nRemark. For TM → M, e(TM) ∈ Hn(M, Z) = Z ⇔ χ(M) = e(TM) · [M]. Moreover, for E, r a flat connection,\ncj (E) = 0 ∈ H2j (M, R)."
    }
  ]
}