{
  "course_name": "German Culture, Media, and Society",
  "course_description": "The topic for Fall 2006 is short film and radio plays. This course investigates current trends and topics in German literary, theater, film, television, radio, and other media arts productions. Students analyze media texts in the context of their production, reception, and distribution as well as the public debates initiated by these works. The topic for Fall 2006 is German Short Film, a popular format that represents most recent trends in film production, and German Radio Art, a striving genre that includes experimental radio plays, sound art, and audio installations. Special attention will be given to the representation of German minorities, contrasted by their own artistic expressions reflecting changes in identity and a new political voice. Students have the opportunity to discuss course topics with a writer, filmmaker, and/or media artist from Germany. The course is taught in German.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Language",
    "German",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies",
    "Fine Arts",
    "Media Studies",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Language",
    "German",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nKursbeschreibung\n\nDieses Seminar behandelt zwei in Deutschland besonders aktive Mediengenres: Kurzfilm und Horspiel/Radiokunst. Beide Formate lassen sich einerseits bis auf die Anfange des Films bzw. des Radios zuruckverfolgen, andererseits haben sie als besonders kreative Formen in der gegenwartigen deutschen Medienlandschaft einen festen Platz eingenommen. Dazu tragt nicht unwesentlich die Struktur staatlicher Forderung durch offentliche Rundfunkanstalten und die Filmforderung bei, aber auch Festivals und regelmaßige Sendungen im offentlichen Fernsehen und Radio.\n\nFast alle der beruhmten Filmemacher wie Wim Wenders („Himmel uber Berlin\"), Tom Tykwer („Lola rennt\") und Edgar Reitz (\"Heimat\") haben mit Kurzfilmen ihre Karriere begonnen und produzieren gelegentlich auch noch heute Kurzfilme. Der Kurzfilm ist auch ein besonders beliebtes Format fur Abschlussarbeiten bei Studenten der Filmhochschulen Deutschlands. Zahlreiche Kurzfilm-Festivals wie z.B. die Internationalen Kurzfilmtage Oberhausen oder spezielle Sektionen bei großen Festivals wie der Berlinale unterstreichen die Bedeutung des Kurzfilms. Regelmaßige Kurzfilmsendungen mit neuesten Produktionen besonders auf 3sat und arte sind ein weiteres Indiz fur seine Popularitat.\n\nMit jahrlich uber 600 neuen Produktionen allein bei den offentlichen Rundfunkanstalten ist die Radiokunst ein uberaus beliebtes Rundfunkgenre. Das Horspiel ist neben dem Feature ein genuines Format, das sich nur im Rundfunk entwickelt hat. Mehrfache Sendeplatze pro Woche zeichnen ein uberaus breit gefachertes Bild, das vom traditionellen Horspiel, dem Kriminalhorspiel bis hin zu experimenteller Radiokunst reicht.\n\nIm Kurs lernen wir anhand zahlreicher Beispiele die verschiedenen Genres von Kurzfilmen und Horspielen/Radiokunst kennen- und analysieren. Wir lesen zahlreiche Texte zur Geschichte der beiden Formate, bekommen Einblicke in Produktionsweisen und erortern Fragen der Rezeption, Distribution und Forderung. Einer der Schwerpunkte im Kurs werden Werke von in Deutschland lebenden Auslandern sein. Die Schriftstellerin und Horspiel-Autorin Esther Dischereit wird uns im Kurs besuchen und uber das Schreiben und Produzieren von Horspielen sprechen. Daruber hinaus werden die Studierenden in Miniprojekten selbst kleine Horspiele und Kurzfilme produzieren und am Ende vorfuhren.\n\nBenotung\n\nAktivitat\n\nWertung\n\nTeilnahme am Unterricht\n\n25%\n\nZusammenfassungen, Texte\n\n25%\n\nPresentationen\n\n25%\n\nProjekte\n\n25%\n\nKursplan\n\nWOCHE #\n\nTHEMEN\n\nAUFGABEN\n\nEinfuhrung in den Kurs\n\nKurzfilm und Horspiel: Definition und Geschichte\n\nAufgabenstellung\n\nKurzfilm-Festivals, Filmhochschulen Genre: Kriminalhorspiele\n\nAufgabenstellung\n\nVom Text zum Film: Umsetzung eines Textes in einen Film am Beispiel „Freundinnen\"\n\nAufgabenstellung\n\nKurzfilme: \"Meine Eltern,\" \"Abhaun!\" und \"Fragile\"\n\nAufgabenstellung\n\nProduktion eines Horspiels, erste Entwurfe zu einem eigenen Horspiel/Kurzfilm\n\nAufgabenstellung\n\nSchriftstellerin und Horspiel-Autorin Esther Dischereit zu Gast in unserem Kurs\n\nAufgabenstellung\n\nKurzfilme von internationalen Kunstlern in Deutschland\n\nAufgabenstellung\n\nDas O-Ton Horspiel am Bespiel von \"Preislied\" von Paul Wuhr und \"Apollo Amerika\" von Ferdinand Kriwet\n\nAufgabenstellung\n\nExperimenteller Kurzfilm am Beispiel der Filme\n\nAufgabenstellung\n\nVorbereitung zur Horspiel-/Kurzfilmproduktion\n\nAufgabenstellung\n\nBerliner sehen, intermedium Festival, Animationsfilme\n\nAufgabenstellung\n\nNeue on-line Formen des Horspiels, Podcasts, Neue Kurzfilmformate\n\nAufgabenstellung\n\nMedienfest: Vorstellung der Studentenproduktionen\n\nStudentenproduktionen\n\nStatement on Plagiarism\n\nPlagiarism attacks the freedom and integrity of thought. Especially in a class that will depend to some extent on online research, you must know what constitutes plagiarism and avoid it. The Literature Department has formulated this statement and policy for all plagiarism cases.\n\nPlagiarism - use of another's intellectual work without acknowledgement - is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution consult the style guides available at the\nMIT Writing and Communication Center\nand\nMIT Academic Integrity: Avoiding Plagiarism\n.",
  "files": []
}