{
  "course_name": "Germany and its European Context",
  "course_description": "This course focuses on main currents in contemporary German literary and visual culture. Taking Nietzsche’s thought as a point of departure, students will survey the dialectics of tradition and modernity in both Germany and other European countries, particularly the UK, France, Denmark, and Poland. Primary works are drawn from literature, cinema, art, and performance, including works by Peter Sloterdijk, Thomas Vinterberg, and Michel Houellebecq.",
  "topics": [
    "Humanities",
    "Literature",
    "Criticism",
    "International Literature",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "Literature",
    "Criticism",
    "International Literature",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nWhat is German? Precision design and a profound work ethic. Romantic reverie and authoritarian tendencies. All these spring to mind when we consider Germany and its heritage. But today, more than ever, \"the German question\" must be located within a broader social field. For just as Germany enjoys great influence over the rest of Europe -- both culturally and politically -- neighboring societies exert their own forces over German literature and art with ever-greater intensity.\n\nThis course focuses on main currents in contemporary German literary and visual culture. Taking Nietzsche's thought as a point of departure, students will survey the dialectics of tradition and modernity in both Germany and other European countries, particularly the UK, France, Denmark, and Poland. Primary works are drawn from literature, cinema, art, and performance, including works by Peter Sloterdijk, Thomas Vinterberg, and Michel Houellebecq. Topics to be discussed are:\n\nLeitkultur\nand the will to power\n\nThe \"death\" of the author\n\nLiterary responses to the green movement and bioengineering\n\nThe\nGesamtkunstwerk\n\nDoctrine, dogma, and the breakdown of tradition\n\nThe cultural wagers of unification within Germany and beyond\n\n\"Germany and Its European Context\" places a premium on excellence in reading and writing. Over the course of the term students are expected to demonstrate progress in critical analysis and expression.\n\nPurpose\n\nThe course will introduce main currents of social thought and will expose you to a range of issues of cultural significance. You will be expected to construct arguments of your own, both in speech and writing, about the issues raised.\n\nRequirements\n\nClass participation is essential to this course. In order to make a valuable contribution students should come prepared to each class. Assigned readings must be completed before each class meeting. A guiding question shall accompany each assignment. Students who are unable to attend a class must inform the instructor in advance, either in person or by telephone. Students with more than four unexcused absences shall be dropped from the class.\n\nOn most days students shall submit\nbrief written responses\n(200-250 words each) to the question on the reading assignment. Although these responses will not be graded, such individual preparation will enhance class discussions. Further, regular writing practice will prepare students for longer papers, both in this course and beyond. Of the 13 questions distributed over the course of the semester students may select 10 to which they would like to respond. Students shall account for their progress with this series by consecutively marking each text (i.e. 1/10, 2/10... ). No extensions shall be granted for these writing assignments.\n\nCourtesy toward others in discussions is expected.\n\nGrading: Participation in class discussion and submission of ten brief written responses -- 25%.\n\nOne of the primary goals of this course is the development and refinement of critical analysis and argument. To this end students will write\nthree essays\nof increasing length. About two weeks before a given due date students must submit a brief outline of the essay they plan to write. In finished essays any and all references must be cited. Essays must conform to MLA standards.\n\nEssays are due at noon on the dates indicated. Essays submitted late without prior permission from the instructor will be penalized by one full letter grade. Essays submitted more than one week will be penalized by two full letter grades. Always keep a printed copy of your essay.\n\nGrading: First essay -- 20%, second essay -- 20%, third essay -- 25%.\n\nIn addition to the writing assignments, students will also be expected to deliver an\noral presentation\n. Students shall prepare and present a one-page handout on the day's reading. In these twenty-minute presentations students should provide a summary of the author's main points, describe the historical context in which the text was produced, and open up a few questions for discussion.\n\nPresentations will be evaluated according to the following criteria: insight, clarity, and, importantly, the degree to which presenters are able to stimulate the thoughtful participation of their classmates.\n\nGrading: One oral presentation -- 10%.\n\nTo receive a passing grade for this course, students must meet all course requirements\n.",
  "files": [
    {
      "category": "Resource",
      "title": "Andrew Piper, “project uebermensch”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/e77d7cfe9a8c55fe57d41649a68ac066_MIT21G_017F02_lec_11_2.pdf",
      "content": "andrew piper, \"project uebermensch\"\n\nwhat does sloterdijk mean by \"lektionen und selektionen\"?\n\nwhat's offensive about sloterdijk's phrase?\n\nsee cottingham:\n\nhttp://www.kcott.com/1990_92/92_index.html\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Berlin Babylon",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/c989c1a89d11c91df75b82293b37da37_MIT21G_017F02_lec_2_1.pdf",
      "content": "Berlin Babylon\n\nmade 1996-2000\nTitle Berlin Babylon refers to Tower of Babel, from Genesis.\nLinks to our class: Nietzsche, Byatt, Vinterberg, Kieslowski.\nDocumentary about post-Wende reconstruction\n\nQ: what is a documentary?\n\nIdeally, images speak for themselves, no voiceovers\nHere, there aren't even any interviews\nSiegert tells Berlin's story with pictures--from present and past\nThe human subjects include prominent architects\nlike Rem Koolhaas\n\nsee www.wellesley.edu/.../architecturalforum/ photos/laura.html\n\nand Renzo Piano,\nhttp://www.GreatBuildings.com/cgi-bin/gbi.cgi/Centre_Pompidou.html/cid_2348201.gbi\n\nas well as contractors, politicians, city officials and\nconstruction workers.\n\nYou get to see underwater construction by hard hats in wet suits,\nconcrete being poured,\nand arguments about whether the building where\nAlbert Speer designed monuments for Hitler\nshould be preserved and rebuilt, or\ndemolished.\n\nSo, Berlin after the wall. Berlin Babylon recounts the melancholy of a city that wants\n\nto win back its destroyed structure, power, and profile...\nA city that wants to \"vanquish\" the specters of its past.\nWe see the scars of Germany's history, from first unification under Bismark in 1871 to\nreunification in 1989\n\nQ:\nWhat should belong there? What should be torn down?\n\nPlaces that were once empty are now teeming with action\n\nmeanwhile, some buildings that stood are now being torn down\n\nSiegert captures a moment when Berliners hesitate between\n\nfear of emptyness, horror vacuui\n\nand the drive to bring everything to completion\n\nA quote:\n\nEin Film uber die hoffnungslose Bauwut, die in den Himmel wachst und seltsam flach und\nmittelmaßig bleibt, uber die verfuhrerische Faszination und prosaische Brutalitat des Bauens. Die\nbabylonische Zivilisationsfabel scheint in der wiedervereinten Metropole an der Schwelle zum 21.\nJahrhundert fortzuleben.\n\nMan muß sich beeilen, die Stadt noch ungeschminkt zu erleben, bevor sie ganz geliftet ist-- und\nzugebaut. Hubertus Siegert\n\n(translation)\nA film about the hopeless Building-Rage, that grows in the skies, that rarely remains flat and\neven.\nA film about the seductive fascination and prosaic brutality of building and architecture.\n\nAt the turn of the 21st century, the bablyonian fable of civilization seems to live on in the reunited\nmetropolis.\n\nhere are some links about the tower of babel\nGenesis 11\nhttp://www.cforc.com/kjv/Genesis/11.html\n\nTower of Babel\nwww.pop-up.org/europa/ words/babeleng.gif\n\nQ: what is the organizing principle of the film? Is there a narrator of any sort?\nQ: what is the chronology of the film?\nNo real chronological order, just collection of conversations and images\nIs it coherent?\n\nQ: Siegert says he wants to slow down the accelerated pace of german transition. how\ndoes he do this?\n\nQ: what is the language of this film?\n\nbody language, mimicry, gesture... it's fragmented\n\nSiegert calls berlin a \"Zivilisationsfabel\" (tale, code, rosetta stone)\n\nhere's the home link for the film:\nhttp://worldfilm.about.com/gi/dynamic/offsite.htm?site=http://www.berlinbabylon.de/\n\nBerlin Babylon situates itself at turn from modern to postmodern.\n\nQ: what was the modern? when did it start and end?\n\ncan answer this in terms of architecture and public space...\nstart: French Revolution, storming of Bastille, 14 July 1789\nend:\ntwo structures\n\n1.\nopening of Berlin Wall, 9 November 1989\n2.\n3.32 pm on 15 July 1972, \"when the Pruitt-Ingoe\nhousing development in St. Louis (a prize-winning version of Le Corbusier's\n\"machine for modern living\") was dynamited as an uninhabitable environment\nfor the low-income people it housed\n\nJurgen Habermas, one of the most prominent living German thinkers, has argued that modernity\nremains an unfinished project, that it is too late to turn the postmodern corner and leave\nbehind the Enlightenment project.\n\nIf Englightenment agents saw reason and experience (education, formation) as the universal\nfoundations of modernity, Nietzsche was writing against this, before his time.\n\n(we could also include notions of order, pragmatism, and progress)\n\nWhen we look more closely at Nietzsche, and his take on civilization, and on God, after the film.\n\nquestion:\nHow to think together: Twilight of the Idols, Berlin Babylon, and Babel Tower?\n\nasking this question is also asking about our condition in modernity...\n\nNietzsche spoke of a \"weightlessness\" or \"lightness\" of existence following the weight of God.\n\nYeats said, \"things fall apart\"\n\nMarx said, \"all that is solid melts into air\"\n\nArchitects of Tower of Babel were trying to make something more concrete than what God had\ngiven them.\n\nTheir questioning, doubting nature marked them as proto-modern\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Botho Strauß",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/b06eaf83e44399380ff8fb38ebe7c7ad_MIT21G_017F02_lec_9_1.pdf",
      "content": "Botho Strauß\n\nwrites about:\n--the terror of technological and economic intelligence\n--the loss of culture and memory\n--our distancing from god\n\n\"idiots of the immediate' (date)\n\nhow does strauss relate to wolf? to nietzsche?\n\nwho are the idiots? what is the immediate?\n\n99/\nwe have anxieties about the future...\n\nbut we're too tied up in the present to confront them\n\nwhat is the specific context?\n\n101/\npreparing for war\n\n'if you want peace, then arm for war'\n\n***read first highlight\n\nwhat correspondences with cassandra?\n\nlust for war (102)\n\nmyth vs. history\n\nmyth-- ref to cassandra, 104\n\nref to aeneas, 104\n\nhistory: national socialism\n\nthis is primal scene for contemporary germany\n\nsecret center, prison\n\nhow to escape this prison of history?\n\nthrough the immediate!\n\n104/\ntop highlight\n\nmedia boom\n\n108/\nworld-vision ruled by the jump cut\n\n109/\nmass media moral tremors (Holocaust)\n\ngermans also escape their history through turning inward to study (nietzsche \"use and abuse\")\n\nhe also cites nietzsche on 109 @ anti-semitism\n\nmemory crisis\n118/\nhow does technology threaten human memory?\n\nregression of our mnemonic faculties\n\nonly total consumer does not remember\nnietzsche-- that which does not cease to hurt remains in memory\n\nwhat is he saying about iranian revolution??\n\nradical turn away from telos of history\n111/\nmiddle highlight\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Buchloh on Beuys, “twilight of the idols”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/4c77a0dc36e8af5a139cf29f5c93e4eb_MIT21G_017F02_lec_12.pdf",
      "content": "buchloh on beuys, \"twilight of the idols\"\n\ncf. beuys to andy warhol\n\nhttp://www.jssgallery.org/Other_Artists/Andy_Warhol/Campbells_Soup_Can.htm\n\nwhat kind of artist is beuys?\n\nsculptor\n\nbut also conceptual artist\n\nroots in surrealism/dada (but doesn't acknowledge this)\n\ncf. duchamp\nhttp://www.geocities.com/Paris/8111/fountain.htm\n\nin postwar context\n(healing)\n\nmember of greens\n(planting trees)\n\nwhat does buchloh mean by \"twilight of the idol\"?\n\nhow is this different to nietzsche's title?\n\nbeuys sets himself up as an idol\n\n-- by \"antiquing\" his works (adds mythic dimension)\n\n-- plane crash in crimea\n\nwhat's the problem with this?\n\nloses authentic sense of history\n\nbuchloh's points of critique:\n\n1.\ngerman rejection of myth, messianism, and grandeur (and metaphysics)...\n\noverriding shame\n\n2.\nmyth of crimean plane crash is\n\ndenial of participation\n\n3.\n205/\nfunctional structures of meaning in art are intricately\nbound into their historical context\n\nduchamp radicalizes readymade,\n\nbeuys just copies and dilutes\n\n4.\nwants to aestheticize politics\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Christa Wolf, Cassandra",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/8a879094d6810d2478cc6f66709dab9f_MIT21G_017F02_lec_8_1.pdf",
      "content": "Christa Wolf, Cassandra\n\nwhat is cassandra about?\ncritique of industrial modernity, east and west\n\nis it a utopia/dystopia?... it's a parable against socialist realism\n\nabsence of 'positive hero' of socialist realism\n\nsome see cassandra as critique of enlightenment.\n\nwhat is enlightenment?\n\nwhat does cassandra 'say' about rationality?\n\n8/\nconquer feelings with thought\n(enlightenment)\n\nbinary oppositions:\n\nfeelings/thought\n\ntrojans/greeks\n\nman/woman\n\nsun/moon\n\nrulers/ruled\n\nfriends/foe\n\nright/wrong\n\nas king priam's daughter, she knows and is complicit with law\n\n62-63/ wolf torn bw conformity and questioning\n\nat end, she makes her critique clear:\n115/\nhow can you draw such distinctions in this moment of crisis?\n\ncass choses male profession, and forfeits her femininity\n\nselbstfindung\n\ntrue to self, unto death\n\nobjective failure/inner moral victory\n\nselbstfindung is a kind of utopian project\n12/\nshe finds happiness, becomes useful to society\n\nthis is outside time and space u-topic\n\nself-change, self-realization\n\nof what is cassandra an allegory?\n\nwhat is allegory?\n1. Description of a subject under the guise of some other subject of aptly suggestive\nresemblance.\n\n2. Allegory is a form of extended metaphor,\nin which objects, persons, and actions...\nin a narrative,\n\nare equated with the meanings\nthat lie outside the narrative itself.\n\nThe underlying meaning has\nmoral, social, religious, or political significance...\n\nand characters are often\npersonifications of abstract ideas as charity, greed, or\nenvy.\n\nThus an allegory is a story with two meanings,\na literal meaning and a symbolic meaning.\n\nexamples:\n\nplato's allegory of the cave\n\ntroy and gdr-- shared fate\n\ntransition from trojanism (more matriarchal, sensual) to hellenism (patriarchal order)\n\nwords win out over images, reason over feeling\n\n136/\ndoesn't leave with aeneas bc she doesn't want 'hero' or 'statue'\n\ncass doesn't really speak. but her body speaks.\n\ncass looks for third way (utopian alternative)\n***106-07, 118\n\nbut who is this 'we'? women, trojans, prehistoric...?\n\nquestion\nwhat are the utopian possibilities of the novel?\n121/\nprocession leading 'nowhere on earth'\n\n138/\nstones seem to move\n\n[utopian hope]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Christa Wolf: The leftover baggage of German history",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/6634b66e120f5623461ed9543e980bd9_MIT21G_017F02_lec_7_2.pdf",
      "content": "christa wolf: the leftover baggage of german history\n\nwho is juergen habermas?\n\nwho is wolf? what was the \"was bleibt\" controversy?\n\nwhat's the leftover baggage\n\nwhat's the zero hour?\n\nwhat's the debate bw jh and cw?\n\n111/\njh says the east german SED had nazi tendencies\n\n113/\njh compares gdr to nation of workers and peasants\n\n113/\njh fears communism more than anti-semitism\n\n114/\njh criticizes cw's argument that both east and west were fraught and fragmentary\n\nindustrial modernity\n\nJH warns that gdr may get swept under the rug...\nbut still he himself rejects gdr cultural legacy\n\n118/\nsays he admires attempt to start eastern academy of arts... but this never came to be\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Dogma film",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/7ad7f47cf2b36fa772e97ef0b203d8b3_MIT21G_017F02_lec_10_2.pdf",
      "content": "Dogma film\n\nhere are links to essential dogma materials:\nvow:\n\nhttp://imv.au.dk/publikationer/pov/Issue_10/section_1/artc1A.html#i2\n\ncertificate:\nhttp://imv.au.dk/publikationer/pov/Issue_10/section_2/artc1A.html\n\nwith Sloterdijk we considered enlightenment, and reason...\n\nthese philosophical concepts are still very important to european thought\n\nwe'll continue to employ them over the next two weeks\n\nmichel houellebecq's elementary particles is a reflection on morality (and on the emergence of\nscience as the only arbiter of meaning)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "From Twilight of the Idols to Babel Tower",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/2a5cce8ae3616fa098714310be61a350_MIT21G_017F02_lec_3.pdf",
      "content": "017 ocw course materials\n\nFrom Twilight of the Idols to Babel Tower\nN. considers four things..\nworship\nrevaluation\nmusic + form\n\nbut, the most important of these is the fourth:\n44/ \"how much beer there is in the german intellect\"\n\nTI asks what we worship, and why\n\nbreaks down all the idols\n\nQ: what are they?\n\nthe ancients, religion, the german state\n\nrevaluation\nanticipates his projected revaluation of all values\n10/\nmoral: one must take shots at morality\n73/ \"have we really become more moral?\"\n\nQ: are we more moral today, than during the holocaust?\n\nQ:\nwhat about slavery. are we more moral now than during the transatlantic slave\ntrade?\n\nnot necessarily. today more people are living in slavery.\n\nQ: what is N's problem with socrates? with greek thought? with classical morality?\n\n017 ocw course materials\n\n13/\njudgments and morality are symptoms of ideology\n\nthey are constructs, they are man-made\n\nideology-- the study of the ways ideas are expressed in language\nrel. to idol.... ideo-- sensation, specter, idea\n\n38/\n\"Morality is just an interpretation... sign language... any use of it.\"\n\nKeep in mind here-- in \"Those who 'Improve' Humanity\"-- Nietzsche's attack on the\nEnlightenment project of education\n\n38/\nhe puts taming, breeding, education all in same category\n\nSloterdijk will do this too\n\nhe launches his criticism of reason (as our ideology) in \"The four Great Errors\"...\n30/\nthe first error is confusing cause and effect\nNietzsche sees all culture and society as an effect\n\nQ: how is religion a kind of ideology?\n21/\n\"we revenge ourselves on life with the phantasmagoria of 'another,' 'better' life\n\nNietzsche doesn't want to wait for the afterlife...\n\nhe doesn't want Christian meekness, he thinks this is fey\n25/\nchurch castrates our will to power\n\nOnly that which does not kill... right?\n26/\nto get better, we need enemies\n\n017 ocw course materials\n\nLet's compare Nietzsche to Darwin.\n\nthey resemble and differ from one another\n\non 26 he says, to get better we need enemies...\n\nbut on 59 he sets out against darwin.\n\nread this passage on 59\nthe weak are more intelligent (which means...cautious, patient)\n\nbut N. is interested in strength, not intelligence\n\nthe will to power\n\n6/\nwhat doesn't kill me makes me stronger\n\n74-75**/\nnietzsche's concept of freedom\n\nhe's trying to reactivate the life force that civilization has dimmed. sexuality, esp. masculine\nsexuality, is one of these forces.\n90/\nchristians made sex into a sin... but nietzsche wants to return us to the raw power of sex\nand death\n\nthat's what he's getting at when he speaks about \"the psychology of the origiastic\"\nthat's why he champions tragedy-- tragedy is a part of great art,\n\nit unlocks catharsis, it moves us\n\nmusical structure\n\n017 ocw course materials\n\n3/\nwhat does it mean, to sound out idols?\n\nQ: what is the musical structure of this book?\nfirst: epigrams and arrows\nlast: hammer speaks... like a coda\nlongest: raids of an untimely man\nthen N. admits his indebtedness to the ancients\n\nConnecting to A.S. Byatt's Babel Tower\n\nNietzsche takes a stab at many institutions, even justice.\n\nQ: what is justice? how is justice part of modern civil society?\nfrench and american revolution:\n\ndecl. of independence\n\nWe hold these truths to be self-evident, that all men are created equal, that they are endowed by\ntheir Creator with certain unalienable Rights, that among these are Life, Liberty and the\npursuit of Happiness.\n\nQ: if N. thinks you need competition to be strong, what would he say about the\ndeclaration's statement of equality?\n\n83/\n\"Equal for equals, unequal for unequals-- that would be the true voice of justice.\"\n\nmarriage\n\n017 ocw course materials\n\nQ: what do you think about marriage? about arranged marriage? what did nietzsche\nthink?\none of Nietzsche's many target institutions is marriage\nmarriage must be indissoluble to work, it can't be founded on love\n\nbut frederica was looking for love, right?\n\nlook at page 76, \"a case in point\"\n\nThese questions of sexuality and morality are\n\na product of the 60s\n\nQ: what do you know about the 60s?\n\nwomen's movement-- the pill\ndrugs\n\nin the book, at the end, the 60s are summed up in\n\nthe expression \"anything goes\"\n\nhow does this manifest in the art students?\n\n228/\nart students waging holy war against tradition\n\ngo to extremes to find authenticity\n\nlet's look at frederica's character\n\nmirrors elizabeth I, acts her role in an earlier book\n\n017 ocw course materials\n\ncambridge education\ngreat friendships with men\n\nbabel tower picks up from here.\n\nhere's the narrative progression:\nthen marries upper class nigel, goes into seclusion\n\ncut off from work (pre-internet)\naccidentally reencounters hugh pink, then other friends start writing to her\nnigel's jealousy\nviolence\nshe leaves for london\nstarts teaching and editing\nmeets john ottokar and jude mason, author of babbletower\npursues divorce with nigel;\n\nthese proceedings echoe jude's own trial\nthese trials become narratives\nit's not just byatt's book that we're reading...\nwe're also reading narratives of jude's and fred's trials\n\nAND jude's book itself\n\nSo, Frederica is\n\ncoming to terms with\n\nindependence, and sexuality\nShe's attracted to danger,\n\nbut to the brink...\n\nshe's also endangered.\n\n017 ocw course materials\n\nQ: what is her relationship to nigel?\n\naxe scene with nigel:\nshe tells him the relationship is over, and then violent fight breaks out\nthis is her attempt to flee: 121-24\n\nQ: how does Frederica's education and writerly interest affect her life,\n\nhow does it affect her understanding of herself?\n\nShe sees herself as a fiction, looking for reality\n\nQ: how about in her teaching?\n-- she wants to connect prose to passion\n-- comes of age recognizing that she teaches well... maybe she'll write too\n\nQ: describe frederica's relationship leo\n\nleaving with leo:\nagonizing decision of whether or not to take leo: 128-29\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Houellebecq, The Elementary Particles",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/aa2e7dd514549f468b4a5714feca2834_MIT21G_017F02_lec_11_1.pdf",
      "content": "Houellebecq, The Elementary Particles\n\nbruno suffers because he desires too much\n\ncynical view\nmichel too smart to allow himself to suffer\n\nwho are bruno and michel?\n\n--how related?\n\n--what are their professions?\n\n--who are the women in their lives?\n\nmeets annabelle in german class\n\nchristiane\n\nwhat's real, what's really french about this book\n\nsollers is kristeva's husband\n\nmonoprix\n\nminitel\n\nI want to think about how Houellebecq enters into conversation with enlightenment rationality.\n\nHe refers to August Comte (1798-1857)\n\n--advanced principles of positivism\n\n(rel. to empiricism)\n\n--logical extension of kant\n\n--against metaphysics\n\nAristotle, \"after\" physics\n\nWhat is the role of religion in this novel?\n\ndeath of god, bc man appropriates power of life\n\nonly hubczejak cynically engages spirituality\n\nfor lack of god, humans develop \"morality of marseillan beach\"\n\n\"a sexual social democracy\" (182)\n\n--this is an example of the German discipline\n\nthat informed wwI and II and enabled\n\nWirtschaftswunder\n\nAre Michel's theories informed by positivism? by rationalism? by individualism?\n\nevery cell can be copied\n\n... so we are immortal thru cloning\n\nlife is nasty, brutish, and short (materialism of Hobbes)...\n\nso nature deserves to be wiped out in\n\na holocaust (page 29)\n\nHow might the theory of \"elementary particles\" apply to society?\n\nHow does Hubczejak interpret Michel's work?\n\nmankind must disappear to give way to immortal species\n\n... a species which has outgrown individuality,\n\nseparation, and evolution\n\nconvinces UNESCO to conduct cloning\n\nnew species\n\nmoves beyond \"personal freedom,\" \"human\n\ndignity\" and \"progress\"\n\nWhat is the last note we have from Michel?\n\n253/\nsky, sea, light converge\n\nWhere does he die?\n\nWhy is Michel depressed?\n\nsees the possible future, and can't imagine any way to avoid it\n\nhe's not a monster: he grieves his grandmother's death,\n\neven 20 years after\n\nenvisions two spheres:\n\n1. being and separation (death, pain)\n\n2. non-being and destruction of individual\n\n... he chooses this one\n\ndoesn't he want personal freedom? don't all the suicides want control over their own\ndeath?\n\nif humankind can control birth, maybe the only agency\n\nthat remains to us is suicide.\n\nMichel's theory of human freedom\n\nquantum theory must directly impact on human events (page 104)\n\n77/\nquantum uncertainity of transfer of electrons\n\nbut human behavior is rigorously determined\n\nonly in rare cases (acts of grace) does free will arise\n\ngood teacher: jean cohen\n\n38/\nsees nietzsche as progenitor of nazi ideology\n\n--rejection of compassion\n\n--elevation of inidividuals above moral order\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Ingo Schulze",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-017-germany-and-its-european-context-fall-2002/e99d893a540c2f64d408c4b2b51340ea_MIT21G_017F02_lec_7_1.pdf",
      "content": "Ingo Schulze\n\nEast German.\n\nIn Simple Stories, he\nreturns to his hometown of Altenburg, a small community located in the former East\nGermany.\n\nThe 29 anecdotal tales in Simple Stories range from the years immediately after the\nfall of the Berlin Wall through the end of the decade,\nas the citizens of Altenburg deal with\nthe particulars of their newfound freedom.\n\nQ: does it satisfy as a novel?\n\nQ: how to describe the narrative form?\n\nHe frequently brings back key characters in later\nchapters as a means of clarifying earlier events:\n\nQ: can you diagram the relationships among the characters?\n\n(ernst, martin, andrea, holitschek (someone end up living with her)\n\nThe psychiatrist in chapter five,\nturns out to have been responsible for the death of the wife\nof the unemployed art historian met in chapter 4...\n... but Schulze doesn't reveal that the wife has died\n\nuntil chapter ten,\nat which point it's revealed that the art historian's son\nis living with his journalist aunt, met in chapter three.\n\nquestion\nwhat is the purpose of all this episodic rambling?\n\nch. 1-- italy trip\n\nrenate and ernst meurer\n\nch. 4-- panic\n\nandrea and martin meurer\n\nch. 5-- barbara and badger\n\nb. holitzschek\n\nQ: what are the references to the wende?\n\nlimited travel, stasi\n\nernst meurer page\n\nQ: what are the acts of defiance at end?\n\nnordsee, martin meurer\n\nhere are some related links:\nhttp://images-eu.amazon.com/images/P/3423127023.03.LZZZZZZZ.jpg\n\nhttp://images-eu.amazon.com/images/P/342308569X.03.LZZZZZZZ.jpg\n\nhttp://images-eu.amazon.com/images/P/3827000513.03.LZZZZZZZ.jpg\n\nhttp://www.hh.schule.de/herdersh/schulze/\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.017 Germany and its European Context\nFall 2002\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}