{
  "course_name": "Girls Who Build Cameras",
  "course_description": "The Girls Who Build Cameras workshop for high school girls is a one-day, hands-on introduction to camera physics and technology (i.e. how Instagram works!) at the MIT Lincoln Laboratory Beaverworks Center. The workshop includes tearing down old dSLR cameras, building a Raspberry Pi camera, and designing Instagram filters and Photoshop tools. Participants also get to listen to keynote speakers from the camera technology industry, including Kris Clark who engineers space cameras for NASA and MIT Lincoln Laboratory, and Uyanga Tsedev who creates imaging probes to help surgeons find tumors at MIT. During lunch, representatives from the Society of Women Engineers and the Women’s Technology Program at MIT will present future opportunities to get involved in engineering in high school and college.",
  "topics": [
    "Energy",
    "Technology",
    "Engineering",
    "Teaching and Education",
    "Curriculum and Teaching",
    "Energy",
    "Technology",
    "Engineering",
    "Teaching and Education",
    "Curriculum and Teaching"
  ],
  "syllabus_content": "Workshop Meeting Time\n\nOne seven-hour session\n\nDescription\n\nWhat is the Girls Who Build Cameras Program?\n\nThe Girls Who Build Cameras workshop for high school girls is a one-day, hands-on introduction to camera technology (i.e. how Instagram works) at the\nMIT Lincoln Laboratory Beaverworks Center\n. It consists of two major projects: Building a camera and programming image filters.\n\nWhat Will the Participants Do?\n\nThe workshop includes tearing down old digital cameras, building a Raspberry Pi camera, and coding Instagram filters and Photoshop tools. Participants also get to listen to keynote speakers from the camera technology industry, including Kris Clark who engineers space cameras for NASA and MIT Lincoln Laboratory, and Uyanga Tsedev who creates imaging probes to help surgeons find tumors at MIT. During lunch, representatives from the\nSociety of Women Engineers\nand the\nWomen's Technology Program\nat MIT will present future opportunities to get involved in engineering in high school and college.\n\nGrading\n\nThere are no grades for this workshop.\n\nAcknowledgements\n\nThe curriculum and workshop were made possible by the MIT Lincoln Laboratory's Community Outreach Initiative. Behind its success was a team of volunteers from MIT Lincoln Laboratory, Fathom Inc., Society of Women Engineers, MIT, and other local organizations: Jessica Johnson, Kelly Geyer, Elizabeth Kramer, Kat Kononov, Elizabeth Salesky, Christine Cunningham, Christine Weston, Meredith Drennan, Anthony Matt, Katherine Rosenfeld, Christina Prested, Elise Spedden, Kate Showers, Elizabeth Astle, Bob Schulein, Sarah Lichtman, Dan Schuette, Jennifer Sloboda, Gavin Lund, Carol Carveth, Alex Lorman, Jing Wang, Sara James, Bich Vu, Paige Connelly, Chiamaka, Rich Marino, Phil McKinley, Carrie Seiberling, Chelsea Peragallo, Jessamyn Liu, Shannon Roberts, Karine Marino, Richard Marino, Kristin Dahl, Julie Arloro-Mehta, Daniela Bourges, Ben Waltuch, Susan Cass, Alicia Laduke, Dave Granchelli, Yari Rodriguez, Nicole Woon, Barbara Hughey, Leslie Watkins, Olivia Glennon, Elaine Lee, Tom Greaves, Kris Clark, Uyanga Tsedev, Lisa Baer, Jon Barron, John Vivilecchia, Rob Elkind.",
  "files": []
}