{
  "course_name": "Global Strategy and Organization",
  "course_description": "This subject focuses on the specifics of strategy and organization of the multinational company, and provides a framework for formulating successful and adaptive strategies in an increasingly complex world economy. Topics include the globalization of industries, the continuing role of country factors in competition, organization of multinational enterprises, and building global networks. This particular version of the subject is taught and tailored specifically to those enrolled in the MIT Sloan Fellows Program.",
  "topics": [
    "Business",
    "Globalization",
    "Management",
    "Operations Management",
    "Organizational Behavior",
    "Business",
    "Globalization",
    "Management",
    "Operations Management",
    "Organizational Behavior"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week for 6 weeks, 1.5 hours / session\n\nDescription\n\nCompanies today confront an increasing array of choices regarding geographic markets, locations for key activities, ways of organizing international business, and processes for managing across borders. This subject provides students with the evidence, concepts and models for understanding company performance in a global world and the issues facing executives in the early 21st century. The aim of the subject is to prepare students to manage effectively in today's interconnected world by understanding this changing environment, principles of global strategy, and the relation between global strategy and organization.\n\nThe first section of the subject discusses motivations and models for international expansion. After reviewing the concept and impact of globalization on company performance, we look into the motivations for internationalization and how a company exploits its home base or the world for advantage and superior performance. In parallel, we explore the process of internationalization, recognize its many challenges and the specific choices available to management to overcome such challenges, and how these have evolved over time.\n\nThe second section of the subject focuses on company-level strategy and related organizational capabilities. First, we examine how firms may shape different global business models. We then consider the choices posed by global integration, local adaptation and worldwide learning and how these choices impact local and global performance. We end with the topic of innovation in multinational companies, in particular by observing the added value of global innovation.\n\nPrerequisites\n\nWhile this course has no formal prerequisites, this particular version of the subject is taught and tailored specificaly to those enrolled in the\nMIT Sloan Fellows Program\n. Participants are expected to be able to draw upon and contribute their prior working and managerial experiences in the classroom.\n\nAssignments\n\nThere are two short papers that comprise the individual written assignments for this course. The first paper is due after the first section of the course (Part I: Understanding Internationalization), and the second paper is due after the second section of the course (Part II: Relating Strategy and Organization).\n\nIn addition to these papers, students are expected to form groups of 4-5 students to submit group case postings. The case readings form a crucial component of the class, whether referenced in the group case postings or in class discussions. Study the cases as if you were\nthere\nand\nthen\n, not here and now. The extra bonus is that you will be training your contextual sensitivity, a crucial skill in international business and in international management.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nIndividual written assignments\n\n50%\n\nGroup case postings\n\n25%\n\nParticipation and discussion\n\n25%",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Lecture 1: Going \"Global\" and Being \"Global\"",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-220-global-strategy-and-organization-spring-2012/513e596c917a4badb3990a1cb1bd9541_MIT15_220S12_lec01.pdf",
      "content": "Global Strategy & Organization\nJoe Santos\nClass 1\n\n\"Going Global\" and \"Being Global\"\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal?\n(c) Farrar, Straus and Giroux. All rights reserved. This\ncontent is excluded from our Creative Commons license.\nFor more information, see http://ocw.mit.edu/fairuse.\nFor the Sloan Fellows - (c) Jose Santos, 2012\nLevitt, Theodore. \"The Globalization of Markets.\"\nHarvard Business Review 61 (May 1983): 92-102.\n\nFriedman, Thomas L. \"The World Is Flat: A Brief\nHistory of the Twenty-First Century.\" Farra, Straus\n& Giroux, April 2005.\n\nPalmisano, Sam. \"The Globally Integrated: The New\nGlobal Business.\" Ideas from IBM (June 2006): 1, 4-8.\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n(Source: Levitt, 1983)\n(Source: Palmisano, 2006)\n(Source: Friedman, 2006)\n\"Companies must learn to operate\nas if the world were one large market œ\nignoring superficial regional and\nnational differences.\"\n\"The modern global corporation contrasts\npowerfully with the aging multinational cor-\nporation. Instead of adapting to superficial\nand even entrenched differences within and\nbetween nations, it will seek sensibly to force\nsuitably standardized products and practices\non the entire globe.\"\nThe Globalization\nof Markets\n\nTheodore Levitt\nThe Globally\nIntegrated Enterprise\n\nSamuel J. Palmisano\n\"'The world is flat.' As soon as I wrote them, I realized that this was the\nunderlying message of everything that I had seen and heard in Bangalore\nin two weeks of filming. The global competitive plyaing field was being\nleveled. The world was being flattened.\"\n\"... emerging globally integrated enterprise is a company that fashions\nits strategy, its management, and its operations in pursuit of a new\ngoal: the integration of production and value delivery worldwide.\"\n\nGlobal ?\neverywhere\nsameness\ntotality\n\"all over the world\"\n\"a unique world\"\n\"a united world\"\n(worldwide)\n(universal)\n(global)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal ?\n1)\nThe expressions \"global\" and \"globalization\" are relatively recent but quickly became a central feature of our\ncontemporary world. But what does \"global\" mean? What does a CEO mean with \"our company is global\"? Or\nwhen stating \"our company has started a process of globalization\"?\n2)\nI have observed at least three very different uses of \"global\", each corresponding to a different meaning of\n\"globalization\". They are all out there, and we can't really say that they are wrong. But we do need to be careful,\nas the ensuing confusion is quite dysfunctional.\n3)\nSome use \"global\" to mean everywhere in the world, or at least in many parts or the world. A company would be\n\"global\" if it were present in many countries, perhaps in all continents. Globalization would then mean the same\nas internationalization. Sure, \"global\" sounds more contemporary. But if this is the meaning we wish to express,\nwhy not say \"very international\" or simply \"worldwide\"? Those terms mean exactly that, without being confusing.\n4)\nOthers use \"global\" to mean the same everywhere in the world. In this sense, globalizing would be tantamount to\nstandardizing at the world level. This is the meaning inspired by cases such as McDonald's, Coke, or Visa. It comes\nfrom the concept of a \"global market\", which by definition is a market of one (same) product everywhere (as\nopposed to a set of national markets, each one with a local variation of the product and different terms of trade).\nIndeed, McDonald's became the symbol of globalization, and its restaurants have at times served as the instigator of\nthose who are anti-globalization.\n5)\n(When I look around the world, both inside and outside companies, this use of \"globalization\" has the most negative\nconnotation: \"We don't want to become like them\" is often uttered, namely by young people - and the \"them\"\ntends to be \"the American\". I gather that it was the British in the 19th Century or the Romans over twenty\ncenturies ago. I wonder if it will be the Chinese or the Indian in a not-too-distant future.)\n6)\nIn line with this \"global market\" meaning, the adjective \"global\" came to mean the strategy of a company that is\nnot responsive to national differences, and therefore aggregates its offering to benefit from economies of scale.\n\"Act global\" (do the same everywhere) came to mean the opposite of \"act local\" (do different things in each\nlocale).\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal ? (cont.)\n6)\nThere is nothing wrong in principle with having the same thing (product, process, rule, and so on)\neverywhere in the world. Many companies do, and to their benefit. But then, if we wish to say that\nsomething is the same everywhere, why not just say that such thing is \"universal\"? If you wish for\nall of a company's subsidiaries around the world to purchase a raw material using the same specifications,\nrules and process, then just state that the procurement of such raw material is universal.\n7)\nIndeed, a company cannot exist (let alone perform) as a multinational company unless some of its\nelements, such as strategy and organization, are universal. Such elements (which I refer to as the\n\"universal core\") constitute the essence of the company and the source of its differentiated\nworldwide performance and value. Elements of such a \"universal core\" may include a value proposition,\na set of principles and values, a decision-making process, a governance regime, and so on. However, the\ngeneral rule is that only a part of what makes up a successful company is universal. Even in the high\nperforming MNC, there is a lot of room for feeling and acting locally.\n8)\nThe expression \"global\" is used in yet another meaning - its most meaningful nowadays. It means the\ntotality of something, its entirety or wholeness. In this sense, a \"global\" company is a multinational\ncompany that is \"one\", in that its organization is united across borders (as opposed to a set or portfolio of\nlocal organizational units). This is the meaning of global that is in line with the contemporary process that\neconomists and political scientists call \"globalization\". Globalization is, of course, not the process by which\nthe world becomes the same, but the process by which it becomes integrated.\n9)\nA \"global world\" is a union of different nations. Indeed, the more global the world, the more the local\ndifferences matter for company performance. More generally, the more global the world (that is, the\nmore extended and deeper the process of globalization around the world), the more that nations will be\ndifferent. The value of global integration arises from the different specialization of each national part, not\nfrom each part copying the rest.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal ? (cont.)\n10) Adam Smith remarkably intuited that the larger the extent of the market, the deeper the division of\nlabour. Hence, the more global markets that exist, the more locations will specialize - and make national\ndifferences more relevant. The more global the world, the more the differences matter for the performance of\ncompanies - not the opposite.\n11) Note that the three uses of the expression \"global\" are somehow related. In a \"global\" (united) world,\nthe process of internationalization is different and the value of a \"global\" (worldwide) reach is higher than in a\ndivided world. Such new internationalization process and higher global value largely depend on how\n\"global\" (universal) the company is, or may be, across countries.\n12) The received polysemy of globalization is, as it were, here to stay. One could even imagine a CEO\nuttering: \"Our vision is to have a global, global, global company\" - translation: \"a worldwide, universal, and\nglobally integrated company\". Aristotle warned us: \"a man is more likely to know what it is he asserts, if it has\nbeen made clear to him how many meanings it may have\". So must we, whenever we discuss \"globalization\"\nand \"global\".\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nA Global World\nGlobalization is a process of increased\ninterdependence across nations.\nA global world is a united world in the sense that the\nmost meaningful performance is the performance of\nthe whole.\nA global world is a union of differences.\nOne World, Many Dreams.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nA Global World\n1) Interdependence is the keyword of globalization. It means that the performance of each nation is impacted by the\nperformance of the other nations, and this is true for all nations including the bigger ones. Therefore, the\nperformance of each nation (say, its economic growth) in a global world is not autonomous (it can't be\ndetermined by the will of its People alone) but rather depends on how other nations are performing too. It is of\ncourse possible to measure each nation's performance at any point in time, but such metrics are only meaningful\nif taken as part of a non-linear dynamic system that models the whole world. A country may do very well, and in\nso doing bring about such large growth in the production of carbon, locally and worldwide, that it may ultimately\ncontribute to the destruction of the planet.\n2) We only have one planet. This is why globalization (as interdependence) is not a matter of choice, but rather an\nhistoric imperative. It was always so, and \"globalization\" as a process has been out there since the dawn of human\nsocieties, though now it is more obvious as our technology can really impact our physical environment).\n3)\nHowever inevitable or positive globalization may be (and not all will agree on that), we know the process itself is\nnot smooth and is rather difficult for many (namely for those that see their jobs and livelihoods seriously\ndisturbed by new patterns of international specialization). History and the shadow of the past may also have a\nnegative impact, as some nations may feel that this is their turn to be centre stage. Globalization may well recede\nat some point, as it did in the past. The question is if one can pursue it and have contingent plans at the same\ntime.\n4) In a globally integrated company, the only meaningful performance is that of the whole. That is what a \"one\ncompany\" policy actually entails. We can (and must) somehow measure the economic and financial performance\nof each national unit, but such measurement is largely conventional. National institutions such as local tax\nregulations and international trade agreements make such accounting a legal requirement. But such fiscal\naccounting at the country level is a technical matter for the multinational company's CFO, not for the general\nmanagers of local or global units.\n5)\nIt is quite a spectacle to watch managers of the same multinational company (that is, colleagues) behave like\nenemies when it comes to transfer pricing across countries. Something that is an abstract construction for the\nmost part (no market equivalents, for example) becomes the source of mistrust and loss of energy in what was\nsupposed to be a united organization around the world. This is not to say that \"local performance\" does not\nmatter. It surely matters a great deal locally to local employees, media, governments, and so on. But it has to\nbe taken as \"local\", not more than that - but, even so, interdependent with the rest.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nThe Impact of Globalization\nu A global world\nu Local/International specialization\nu Dispersion of world-class knowledge\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n... the more national differences will matter.\nFocus on the differences across nations,\nfor there you will find extraordinary sources\nof innovation, growth, and value ....\nInternational\nspecialization\nDispersion\nof world-class\nknowledge\nInterdependence\nThe more the world becomes global ...\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.220 Global Strategy and Organization\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3-a: Different Nations and National Culture",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-220-global-strategy-and-organization-spring-2012/b7a1fc872f5824fb4455e1bf4b097239_MIT15_220S12_lec03a.pdf",
      "content": "Global Strategy & Organization\nJoe Santos\nClass 3-a\n\nNations Matter!\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nTechnology\nH.\nI.T.C.\nP.\nPhysical\nHistory\nInstitutions\nCulture\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nNations matter!\n1) Nations are different. This is evident the moment you get to know two \"nations\"* - and you may not even need to\nleave your country: just ask the Belgium, the Spanish, the Swiss, or the Indian. Or recall that the British even\nhave four different national teams in soccer. There is nothing new in national diversity. It has always been so, and\nit will always be so. Sure, many may believe that nations are all alike or will one day be so. \"We are all humans,\naren't we?\", is a common argument. Wrong argument. It is exactly because we are all human that nations are\ndifferent. Because, as humans, our environment, the context we live in, matters a lot - and environmental\ndifferences carve our national differences over time.\n2) Human beings are local beings. We are fully dependent on the immediate surroundings for life. Without a number\nof vital material and energetic exchanges with our surroundings, we simply die. We can't feel at a distance, as\nmost of our senses are very limited in physical scope. Our technical achievements mitigate some of these\nboundaries, but that does not change our nature. Emotions decay quickly. When we see a huge disaster in\nsome distant country on TV, it will not normally affect us as intensely as an accident on our street.\n3) As human beings, we have a physical nature as well as a social nature. Both are natural to us. We are shaped by\nboth \"nature\" and \"nurture\". Where we are born and raised matters a great deal. People born and raised near the\nsea are different from people inland. Perhaps it is the \"salt\" in the air or the smell of the sea that we love to\ninhale, or that since a very young age we see such an uneven, physical world around us, or that our child\nwonders about the \"other side\" of the sea, or even being accustomed to sailors from distant lands. And, an\nisland people is different from a continental people.\n4)\nSmaller nations or peoples, such as the Slovenes or the Catalans, are different from larger nations, such as the\nAmericans or the Brazilians. It is both the size of the national community and the extension of their homelands. The\nexposure to a different people is much more likely when you belong to a small nation. Many Americans will never\nleave the US, and never truly be exposed to a different nation; one can live and work in very different places in such\nlarge country, one can do almost all kinds of tourism, and one can retire to a welcoming climate - and the rivalry\namong cities and regional differences are enough to fuel several great sports. There are of course local\ndifferences within a large country such as the US, but a unique language and common, country-wide institutions\nmatter a lot.\n* It is not always clear what one means by \"nation\" - which I will take as a \"People\" and their territory.\nHowever, when we use the expressions \"international\"/\"multinational\" we tend to mean across/multiple \"countries\".\n\"Nation\" and \"country\" are most often used interchangeably. To confuse matters, countries may comprise one or more\nnations or Peoples, and be formally organised as one or more \"states\". And this matters too...\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nNations matter! (cont.)\n5)\nOur national communities are shaped by the local natural resources, by the local climate, by the local geographic\nposition, and by the surrounding communities. As local collective entities, we found the solution of recurring\nproblems by shaping institutions - and recurring problems are not the same in all locales. And we found collective\nmeaning and motivation by shaping our local culture over long stretches of time. Our national history is there.\nThere is nothing we can do to transform our past, and even the shadow of the future shapes our collective\nfeelings and will.\n6)\nNational differences matter in many respects. A nation shapes each business there: the needs of customers and\nusers, the expectations of shareholders, the behaviour of competitors, the available technology, and so on.\n7) Nations matter for company performance. This is of great relevance for managers and investors. Nations shape\ncompany performance in three ways: nations directly affect a company's organization and strategy (product and\nmarket choices, business models, expectations and skills of employees, beliefs and values of managers, and so\non); nations shape the international performance of their local companies; and more visibly, nations cause\nforeign companies to adapt to their peculiar features when such companies cross borders to become MNCs.\n8)\nThe fact that one company is successful, even very successful, in its nation (country) of origin does not mean that\nthe company will be successful elsewhere, or everywhere. So, your company success at \"home\" does not mean\nthat you will succeed abroad, at \"host\". Retailers such as Wal-Mart and Carrefour or nationally acclaimed Natura\nand Starbucks provide first-class instances.\n9)\nThe fact that your company is successful abroad does not mean that the company itself is the primary cause of\nsuch success. Such primary cause may simply be its origin: \"home\" is the key success factor of the company's\nsuccess abroad. IKEA's success in furniture is primarily because it is ... Swedish.\n10) The fact that your company is unable to achieve world-class performance may also be caused by its \"home\"\nattributes. If management is capable of freeing the company from geography, its performance may dramatically\nimprove. Acer, AmBev and STMicroelectronics provide evidence of such \"homeless\" or a-centered performance.\n11) Because nations evolve, time matters too. IKEA's prized business model was developed in Sweden during the 50s\nand 60s (the period after WWII). Counterfactual history tells us that the same is unlikely to happen now. The\n\"home\" effect also varies as industries evolve over time; GM is a case in point.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nP.I.T.C.H.\n1)\nEvery nation (or people) constitutes a specific context or \"environment\".\n2)\nEvery company's performance is the result of the dynamic interaction between its environment (where it\nis), its organization (what it is) and its strategy (what it does). Therefore, every national context will have\na definite impact on a company's performance there. This is true for local companies (companies that\noriginate there) and for local units of foreign companies.\n3)\nOne of the major challenges in international business and international management is to recognize such\nnational context specificity. Such recognition would allow managers to know which elements of the\norganization and strategy of their company are \"local\" (peculiar to the local national context) and which\nones are \"strictly local\" (valuable only in the local national context).\n4)\nI propose a simple model of national (local) context or environment, made of five related pieces:\nP.I.T.C.H. Each nation has its own \"pitch\", so to speak.\n5)\nThe P. stands for the local physical environment (\"geography\" or \"nature\"). It is the most visible piece. Is\nit an island or a vast continental space? Near the sea or inland? In the north or in the south? Cold or\nwarm? A fertile ground? With minerals? With oil? And so on. The local P. determines the relative\npresence of natural resources, the extent of certain businesses, and the importance of certain needs and\npreferences in its population.\n6)\nThe I. is the institutional context, the set of local institutions. Examples of local institutions, formal or\ntraditional, are the local laws, government, political system, judicial system, education and training, the\nnational innovation system, financial markets, economic and business systems, and so on. Institutions\nare \"visible\", namely to the trained eye: political scientists, lawyers and economists are good sources of\ninformation on local institutions and on how they shape business and companies.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nP.I.T.C.H. (cont.)\n7) The T. is the local technological environment, which refers to the ways in which locals do what they do and\nthe proficiency with which they do it. We may distinguish the scientific and the technical contexts. The local\ncraftsmanship and technological knowledge are not just about designing and making things, but also\nabout using things (be it goods or services). The T. is often in direct relation with P. (for example,\nnatural medicine, \"flex\" car engines, or deep sea drilling), cultural traditions (for example, culinary), and\ninstitutions (for example, universities, research institutes, or arts and crafts schools).\n8) The C. stands for cultural context, or local (national) culture. Culture is our collective \"view of the world\".\nNational culture, following Ed. Schein, is a set of basic assumptions that defines what we - as members\nof a nation - pay attention to, what things mean, how to react emotionally to what is going on, and what\nactions to take in various kinds of situations. Culture is collective (note that one individual does not\n\"have\" a culture, one \"belongs\" to a culture) and implicit. Culture is mostly invisible and it can only be\ninferred. Certain collective values and beliefs can be revealed and cultural artifacts and behaviours can\neasily be observed. Anthropologists and other specialists are trained to observe and study local cultures.\nNational culture has a pervasive effect on organization and on management itself - and, unsurprisingly,\nsuch effect is mostly invisible to its managers and employees.\n9) H. is of course the historical context, or simply history. It is the piece that we cannot experience nor see\nunless for recent history or for some figments of the past. We can only hear or read about it. In this\nsense, the H. is the other extreme compared to the P. The H. has a significant impact on C., but it also\nshapes T. and I.\n10) P. and H. are crucial pieces of local context in the sense that they are both real (that is, outside current\nhuman will). However, for the first time in human history, current T. in selected nations (nuclear power,\ncarbon production) can, or may, have a very relevant impact on P., not just locally but elsewhere, even\neverywhere. Or, put otherwise, a single nation or a small number of nations can destroy the whole world.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nMetaphors, Metaphors ...\n1)\nNational languages are different, so much so that we find ourselves easily lost in translation. There isn't even such\nthing as a \"universal English\". This is not good news for managers when they cross national borders.\n2)\nWe frequently use metaphorical language for it can greatly improve communication. Local communication, that is.\nMetaphors may be very dysfunctional in international communication, as they are often highly local and context-\nspecific, their meaning particularly confusing for a foreigner.\n3)\nThe book title The World is Flat presents a nice paradox. The World is Flat caused an outburst of counter-\narguments from Europe and elsewhere, claiming that it was wrong and that the world was \"not flat\". By this, it was\nmeant that the world is not the same everywhere, that differences subsist even after \"globalization.\" What is\ninteresting is that the main thesis of The World is Flat is not that the world is becoming the same everywhere. Its\nauthor is an American writing for his fellow Americans. The title metaphor must therefore be understood in the\nAmerican context (again, a national difference altogether). Part of the so-called \"American dream\" is the equality\nof opportunities, a \"level playing field.\" What the author means (an insight from a conversation with an Indian\nCEO) is that in today's world the opportunities of a company created in Bangalore or in Silicon Valley are the\nsame, or quickly becoming the same. It is not that the world does not have differences and barriers, but that such\nbarriers no longer constrain definitively the entrepreneurial ability and technical skills of distant people in less\ndeveloped countries, nor do they protect the advantage of those in developed ones. Interdependence, no less.\n4)\nWhat do you make of the head of the Boeing 777 project team stating that the plane was going to be designed as\n\"a Fisher Price toy\"? Or the English colleague who utters, \"that's not cricket,\" after you decided to offshore an\nactivity? Think twice before using metaphors or analogies with foreigners. Or if you really have to, try using\nuniversal or quasi-universal metaphors - but check them out, just in case. What about \"pitch\" for a nation?\n5)\nYou may hear that all words are metaphors. Most are dead metaphors indeed. But that is besides the point. The\npoint is about the crucial differences in language and the use of language across nations. If all words were\nmetaphors, you just had one more incentive to learn another language - namely if your native language is\nEnglish.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different geography and history,\ndifferent businesses/markets\nPhotographs of windmills, solar panels, bicyclists, and car removed due to copyright restrictions.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different geography,\ndifferent businesses/markets\n1)\nThe point here is that the P., the physical context of each nation, matters. The table on previous slide exhibit\ndifferencesin the consumption per capita, in kilos per year, of a very mature beverage: coffee. Such differences\ncan't be attributed to newness in different markets. In all the countries listed (and even not in the list, such as\nthe UK), coffee has been a common beverage for decades if not centuries. A major explanation of the large\ndifferences in consumption is climate (and average amount of sun light). When we consume a cup of coffee, we\nare consuming hot water (a very efficient intake of energy), and tasty water for that matter (apart from caffeine).\nPeople in warm countries don't really need that: Italian and Brazilian solved the matter with very small cups of\ncoffee (and a lower consumption per capita, despite the love for espresso in Italy and the fact that Brazil is the\nworld's largest producer of green coffee).\n2)\nSome differences in the consumption of coffee remain unexplained with P.. Japan is cold and low in coffee, but\nit addressed the same needs with the consumption of tea (caffeine is also present in many sorts of tea). Likewise\nwith the UK, which turned into a tea-drinking kingdom by historical accident during the reign of Charles II. Japan\nand the UK here show that not only P. but also H. and C. matter in the differences of local tastes and preferences,\nand therefore of perceived value by local customers, users, or consumers.\n3)\nIt is not just consumption rates. With different tastes and preferences come different products and eventually\ndifferent technologies, different local competitors, different businesses. The business of coffee in Finland, Italy\nand the US are quite different, and so are the companies that exhibit the larger market shares in each national\nmarket: a Finish company in Finland, an Italian company in Italy, and an American company in the US - despite\nthe fact that the business of coffee has been under international consolidation for decades and is highly\nconcentrated. And all three national market leaders are multinational companies too. Indeed, we should say\n\"businesses of coffee\" and not \"business of coffee\".\n4)\nOther businesses (such as \"green electrical power\" or ethanol for cars) are highly shaped by local geography and\nlocal regulations, which tend to follow nature too. It should not be surprising that Brazil produces a lot of\nhydroelectric power or that its excess sugar cane turned first into ethanol for cars - and the \"flex\" car engine (P.\nshapes T. too, and T. shapes business). One should not be surprised that American homes and cars are large,\nand that Japanese homes and cars are small. After all, size, population density, and the vastness of land matter -\nand more so when energy prices were low.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different Institutions ...\nImages of U.S. Senate chamber; statue of justice; MIT Building 10 and Killian Court;\ngross national product; symbols for English pounds; U.S. dollars, Japanese yen, and\nthe Euro; a sign of Wall Street removed due to copyright restrictions.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different \"business systems\" ...\n1)\nDifferent nations exhibit different institutions (I.), among which the institutions of business (such as competition,\nboth as a practice and as a law) and forms of capitalism. Indeed, one can argue that the power of capitalism is\nthat there isn't one: American and British capitalism may be similar, but French capitalism, German capitalism,\nJapanese capitalism, Chinese capitalism, and so on, are all local and different. Different culture and institutional\ncontexts foster different patterns of company ownership, different systems of relation among companies, and\ndifferent kinds of management: different \"national business systems\" in a global world, as Gordon Redding put it.\n2)\nThere are differences in how competition works in different countries. In Japan we find a practice of intense\ncompetition among local companies, exemplified by the forceful retail of competing consumer electronics in\nAkihabara, Tokyo. In Canada, for example, we find an institutionalized oligopoly among banks, which many have\nidentified as the cause of stability in the recent global financial debacle of 2008. In Brazil, we find a company\nsuch as AmBev, created in 2000 by an authorized merger that led to an impressive position of market dominance,\nwhich was unfair and unacceptable by most other national standards. Anti-trust is not universal either: GE was a\nauthorized by Washington to acquire Honeywell, only to be blocked by Brussels ... much to the surprise and chagrin\nof Jack Welsh, who so discovered that even \"being first\" is not advantageous everywhere.\n3)\nDifferent national business systems and regulatory institutions have an impact on the performance of local\ncompanies and on the performance of local units of foreign companies. Company acts, labour law, tax systems,\npricing rules, competition law, and government procurement policies are among the more obvious elements of the\nlocal administrative and economic regimes that shape company choices and results. A foreign company will be\naffected by the local directives on cross-border transfer of funds and profits, double taxation treaties, and visa\npermits. Local ownership and governance rules may well determine the entry mode of a willing foreign investor\n(for example, by imposing a joint-venture with local partners).\n4)\nThe local institutional context may have \"voids,\" as is regularly argued about \"emerging markets\" or\n\"underdeveloped economies.\" Though \"voids\" are in the eye of the beholder, the fact remains that the\ninstitutional context is largely visible from the outside, even in that in which it may be less transparent. If a\ncompany chooses to enter a country, it should not complain later on the negative effect of some local rule or\npractice that it could and should have known before it entered. Google's \"surprises\" in China are, well, surprising.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different technical performance ...\n(Source: Hall & Soskice, 2001)\nFor the Sloan Fellows - (c) Jose Santos, 2012\nBar graph\nwith u\npper ha\nlf of graph\nwith bar\ns extendi\nng l\neft\nand\nlowe\nr\nha\nlf\nof\ngra\np\nh with bars extending right.\nImage by MIT OpenCourseWare.\n\nDifferent Nations, different technical performance ...\n(Source: Hall & Soskice, 2001)\nFor the Sloan Fellows - (c) Jose Santos, 2012\nBar graph with upper half of graph with bars extending right and lower half of graph with bar\ns extending left.\nImage by MIT OpenCourseWare.\n\nDifferent Nations, different technical perfromance ...\n... and different skills\n1)\nDifferent nations constitute different technological environments (the T. in the local \"pitch\"). This implies\na differentiated access to technical efficiency and innovation by companies in different countries.\n2)\nAnecdotal evidence is all around us - as in the news about SAP and its finding of local specialist skills.\nFinancial markets knowledge is concentrated in places such as New York and London; wine technology in\nFrance; design skills in Italy; TV production skills in Hollywood or Rio de Janeiro; scientific knowledge in\nthe US or Russia; and so on.\n3)\nThe evidence provided by Hall and Soskice is telling. National patent specialisation is a proxy for technical\nproficiency and innovation in different industries. What the evidence shows is that a statement about the\ngeneral superior innovation capability of the US is false: there are many industries in which Germany is\nmore innovative than the US. In some industries (such as semiconductors, information technologies,\nmedical engineering, biotechnology), US companies are relatively more technically savvy and innovative\nthan their German counterparts. But in industries such as agricultural machines, mechanical elements, or\nengines, German companies lead technically. The same is surely valid for other countries - if only we had\ncomparable evidence.\n4)\nNote that, broadly put, the industries where Germany exhibits high patent specialization have heavy\nproducts (metals, for most part), call for skills that take long to master, have long product development\ncycles, require large factories, and tend to have incumbents as innovators. Those were the US leads are\nlight products (even immaterial), are science-based, have fast development cycles, can be made in a lab,\nrequire relatively small sums to start up and promise fast returns.\n5)\nWhy such differences in technical aptitude? National history and culture, on one side, and the natural and\ninstitutional contexts on the other, are very relevant here. A serendipitous invention by a local individual\nor company may turn into a big thing and start a stream of technical specialization and innovation. If we\nlook into the history of science and technology, the history of different industries in different countries,\nthe respective education systems, company ownership structures, financial markets, government\nintervention, and so on, we can start to explain and perhaps even predict the differences of technological\nperformance across nations.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nNational Culture: Mapping Differences\n(Source: Hofstede, 1980 and later)\nPower Distance is the extent to\nwhich the less powerful\nmembers accept and expect\nthat power is distributed\nunequally.\nIndividualism is the degree to\nwhich ... ties between\nindividuals are loose: everyone\nis expected to look after him/\nherself and his/her immediate\nfamily.\nGraph of fou\nr quadran\nts with circ\nled regions\nwithin ea\nch quadrant.\nImage by MIT OpenCourseWare.\n\nDifferent Nations, different culture ...\n1)\nDifferent nations have different national culture (the C. in the \"pitch\"). Such differences will impact elements of\ncompany strategy, organization, and management.\n2)\nThe work of Hofstede and others has attempted to map differences across cultures as well as provide some\nindication of the beliefs and values held by a nation (people). Schneider and Barsoux's book Managing Across\nCultures is a very good reference on these matters.\n3)\nAs an example, take the cultural factor that Hofstede called \"Power Distance\": the (positive) acceptance by a\npeople of power inequalities in an orderly society. In low PD nations, such as the Scandinavian countries (in which\npower differences have a negative connotation and call for a justification) one may expect, for example, that\norganizations exhibit a lower number of hierarchical levels than in countries such as Japan or Brazil, other things\nbeing equal.\n4)\nWhen a company such as IKEA exhibits a \"flat organization\" in which those in lower levels may often request an\nexplanation following a given instruction, in which people of different levels treat each other as equals, and in\nwhich some symbols of power (such as a loftier office or a named parking space) are rare or nonexistent, all this\nis not because the leaders of IKEA made particular choices about such features of their organization - but simply\nbecause they were Swedes in Sweden. IKEA is, in this respect, a normal Swedish company. It was just socially\nnatural to be so. Indeed, the \"corporate culture\" of local companies is, by and large, a representation of local\n(national) culture. Please note that there is nothing universally superior in having a \"flat\" organization structure.\nIKEA's superior performance is not due to being \"flat\", but to a number of features in its organization and\nstrategy, one of which is being \"flat.\" Just that. The belief that \"flat\" is better because IKEA and other companies\nsucceed with being \"flat\" is, well, superstition.\n5)\n\"Individualism,\" another of Hofstede's cultural factors, impacts work processes (teamwork, for example, is more\nnatural in Japan than in the US where so much has to be written and taught about being a \"good team player\")\nor the effectiveness of incentive systems (for example, expect bonuses based on individual level performance not\nto be equally effective in Japan as in the US); \"uncertainty avoidance\" impacts investment decisions and\nentrepreneurship; \"masculinity\" shapes how we measure success; and so on. If you want a quick overview of\nHofstede's findings, \"there is an app for that\": google \"culture gps\" and you will find it.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different customers and users ...\n1)\nThe differences across nations are also visible in the qualities of local demand. Local tastes and preferences are\nshaped by local geography, culture, and history. The expectations and behaviour of local customers and\nconsumers are guided by local regulations and other institutions, such as education, health organizations, or\nconsumer activists. User proficiency is affected by the overall stage of local technology. The perceived and\nactual value of a product, good, or service in different countries is different.\n2)\nSuffice to drive a car in different places around the world ... and one has little doubt about how local traits shaped\ncar drivers, pedestrians, police officers, and so on - let alone cars. Japanese cars were not smaller because of\nsome grand vision of fuel efficiency, but rather because space is one of the scarcest resources in Japan. Try to\nbuy a dedicated parking space or have a private garage for your car there, and you'll quickly find out why it\nmakes sense to have a small car and a good anti-corrosion finish.\n3)\nThe local \"pitch\" effects customers, clients, prescribers, consumers and users in other relevant ways. Two are\nworth noting: exigency and lead-use.\n4)\nNot all customers are equally demanding. That is true in any country, and especially true across countries. It is\nnot just cultural beliefs (such as universalism or particularism) and values (such as fairness) that shape such\ndifferentiated national exigency, it is also institutional practices and their effectiveness (such as local warranty\nregulations or consumer rights activism). Such cultural and institutional differences create different expectations\nabout the quality of goods and the level of services.\n5)\nOne of my observations, anecdotal as it may be, is that a detrimental difference between the \"North\" and the\n\"South\" of the world is the level of customer exigency, more so than technology gaps. Companies in the \"South\"\nare often poorer in quality and higher in relative price simply because their local customers do not demand too\nmuch of them or have learned over time that claiming for better value is simply ineffective. A particularistic bias\nand a relationship-oriented culture (two common traits in many \"Southern\" cultures) do create more passive\ncustomers. \"The product is in bad shape, but it was the higher temperature during transport; you know, it was\nnot their fault. We've known them (the supplier) for long and they are very nice people. Let's use the product anyway.\nOur customers won't complain either and if they do we will explain that the alternative was to wait quite a while\nfor a new shipment.\"\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different customers and users (cont.)\n6)\nCustomers and consumers across borders are therefore not just different in expectations and preferences on\nproduct features and functionalities, but also in their expectations on product quality, delivery terms, pre- and\nafter-sales service, and so on. Customers with exacting wants are relevant as they continuously press their\nsuppliers into better products and lower prices, let alone making them comply with agreed-upon quality and service\nlevels. High customer exigency leads to incrementally improving company performance - or to customers and\nconsumers who will be easily dissatisfied and who will not be silent or passive about it.\n7)\nSome users and consumers are also particular in that they tend to have today the needs that the rest of the\nmarket has tomorrow. They are referred to as \"lead users\", following von Hipel. A lead user may also be\ndemanding, but these are two different things. A lead user cares for the functionality that the product brings\nabout, namely the new functionality or features that existing products do not have. Lead users tend to be \"early\nadopters\" of a new product, as they will not mind substituting the solution of their unmet needs for an yet\nimperfect product or a relatively high price. Because they use the new apparatus, the new service, or the new good\nearlier than other users, they will accumulate more knowledge about such use than what others can - namely tacit\nknowledge. Their motivation for using a new product early on, learning about it and eventually improving it,\noverwhelm any costs of such endeavours. Lead users are instrumental to companies in bringing about innovative\nand improved products when they launch them into the wide market. Lead users hold valuable amounts of user\nknowledge of particular products or applications; they are a cause of local industry leadership.\n8)\nLead users are not equally distributed in the world. Different countries, with different \"pitch\", will produce lead\nusers of some product categories but not others. So, though you may know the lead users in your country, they\nmay be \"followers\" of lead users in another country. Some examples: Italian men are lead (and demanding) users\nof high-fashion. It should not be surprising that Italian companies are leading the world of high-fashion for men,\nthough it was not always so. Until the 60's, British men were lead users of fashion and Savile Row, in London, was the\nsymbol of British industry leadership in men's clothes. But, as Italian men surpassed British men with bright\ncolors, looser cuts and lighter materials, so did Italian fashion designers and companies.\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nDifferent Nations, different customers and users (cont.)\n9) The lead users of PC chips were American for long. Companies such as IBM, HP, Compaq or Dell were\nthe forefront of innovation in PCs and challenged and were challenged by Intel with the ever evolving\nx86 chips. A matter of history (IBM invented what came to be the PC) and national scientific and\ntechnical leadership in semiconductors and IT. American users of computers, be it in military or business\napplications, were also lead users relative to other countries. The growth of the laptop PC and the\ninternet were going to change that for a while. Suddenly, the lead users of Intel chips were not American\ncompanies but Taiwanese companies (such as Acer and Asus), as Taiwan became the dominant origin of\nlaptop production and engineering. Asus even invented a new kind of laptop, the \"netbook\". The new\nlead customers of chips wanted extended battery life, not fast computing. And another kind of lead user\ncame up: the users from \"emergent economies\" who required a much, much lower price leveleven if at\nthe expense of some features less desired. The \"zero-segment\" that Intel had successfully\naddressed with the Celeron was now replaced by a \"below-zero\" and altogether different kind of\ndemand.\n10) It is not yet easy to predict when the attributes of a country's \"pitch\" will produce demanding or\nadvanced users of a particular product class. History and culture are good points to start. Japanese\nwomen were demanding and leading users of skin cosmetics long ago, and probably still are for some\nkinds of products. French women seem to be most advanced and knowledgeable consumers of perfumes\n... which Japanese women will rarely use, if ever, on traditional and cultural grounds. Brazilian are very\ndemanding and advanced consumers when it comes to entertainment, and the prime time TV soap opera\nbetter begin on time every day (interesting, that suddenly even Brazilians value punctuality). In some\nbusinesses, spotting demanding and lead users internationally is not trivial. Where in the world are the\nmost exigent and innovative users of retail? And why?\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.220 Global Strategy and Organization\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lectures 3, 4, & 5: Exploiting Home-Based Advantage; Augmenting Home-Based Advantage; Building Metanational Advantage",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-220-global-strategy-and-organization-spring-2012/2ba8eea75160b3d0f92b0b65b5fe34f9_MIT15_220S12_lec03-04-05.pdf",
      "content": "Global Strategy & Organization\nJoe Santos\n\nClass 4\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\"Home, Sweet Home\"\n\ncourtesy of)left*+ 66)right)7!\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nFlowchart of ten images th\nat show the pro\ncess of buying furni\nture and related activiti\nes at IKEA.\nImage by MIT OpenCourseWare.\n\nFor the Sloan Fellows - (c) Jose Santos, 2012 Four bar graphs depicting growth over the years in each related category, with the last year highlighted in green.\nIKEA\n\n(Source: Ikea)\nImage by MIT OpenCourseWare.\nFour bar graphs depicti\nng growth over the\nyears in each relate\nd cate\ngory, with the las\nt year highlighted in\ngreen.\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nIKEAs business model (radical) innovation:\nLarge scale build-to-stock + instant satisfaction (and more) at a low price\nFurniture\nDesign\nProduction\nDelivery\nAssembly\nStore for\nDisplay and\nOrder\nThe traditional furniture business:\nLow scale build-to-order\n\n+ slow full-service at a high price\nOutsourcing\npartnerships\nin LCCs\n...... by customer ......\nSweden\n(~1955 ~1970)\nFurniture\nDesign\nProduction\nSelf-service,\nwarehouse+\nretail store\nCatalogue,\nAdvertising\nAssembly\nDelivery\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\"Home, Sweet Home\"\n\ncourtesy of)*+ ,-) *+\n23!)*, 66)*7!\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nis Swedish because...\n1.\nThe non-mobile resources required to produce its breakthrough\ninnovation were available in Sweden\n\n2.\nIt found the optimal combination of resources through an emergent\nprocess of interaction with local customers, competitors, and\nshareholders in Sweden (~1955-70).\n\ni.\nIKEA's performance worldwide was superior because the local\noptimum in Sweden was a global optimum (Porter, 1990) ...\n\nii.\n... and it found such local optimum with superior efficiency than other\nSwedish companies to whom the same resources and combinatorial\ncontext were available ...\n\niii.\n... and it increased its geographic scope in such a way that its original\nnational advantage was at least maintained.\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nNational companies ... turned \"global\"\n\n9:3\n\n9;\n\n96<=\n\n9>3\n\n9-6\n\n9?\n\n9-\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe primacy of \"Home, Sweet Home\"\nThe home-base of the \"national\" company turned global success\nprovided the company with a set of key success factors:\n\nThe ideal cultural context and institutional environment\n\nLocal access to superior technologies and organizational capabilities\n\nThe origin of critical resources, key suppliers and complements\n\nIntense competition\n\nThe most demanding customer base\n\nLead (advanced/knowledgeable) users\n\n(Sources: M. Porter; Kogut, Redding, ... ( Marshall, Vernon, Krugman, Lorenzoni, von Hippel...)\n)\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n(Source: Porter)\nThe \"competitive advantage of nations\"\nFour blocks of text, each\none connected to all three\nothers wit\nh bidirectional a\nrrows.\nImage by MIT OpenCourseWare.\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe Cluster as Home\n\n;\n\n9:6\n\n9?\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe primacy of \"Home, Sweet Home\"\nThe home-base of the \"national\" company turned global success\nprovided the company with a set of key success factors:\n\nThe ideal cultural context and institutional environment\n\nLocal access to superior technologies and organisational capabilities\n\nThe origin of critical resources, key suppliers and complements\n\nIntense competition\n\nThe most demanding customer base\n\nLead (advanced/knowledgeable) users\n\nSources: M. Porter; Kogut, Redding, ... ( Marshall, Vernon, Krugman, Lorenzoni, von Hippel...)\n\nShimano's Timeline\nFor the Sloan Fellows - (c) Jose Santos, 2012\n1920s\n1930s\n1940s\n1950s\n1960s\n1970s\n1980s\n1990s\n2000s\n2010s\nMajor external events\nMajor company events\nCompany founded\nCompany expands in Asia\nCompany reestablished\nafter war\n3 speed hub, Company\nbegin exports to US,\naccesses technology in\nUS\nJapan expands in Asia\nWWII\nPRC\nOil embargo/\nNixon shock\nEuropeans \"reinvent\"\nbicycling\nDownhill emerges\nin US\nRise of China, India\n\nRecall\nFounders death\nOffshoring\nSPD\nKeizo S. dies\nSRAM suit\nEuro racing\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nInternationalization 1.: Exploiting Capabilities\n- What capability(ies) do we have that we seeking to exploit\ninternationally?\n\n- Do they pass the RATs test in a particular target country:\n- Are they Relevant?\n- Are they Appropriable?\n- Are they Transferable?\nSource: Lessard et al, 2012 (forthcoming)\nHome-based\ncapabilities\nTarget country\nMarket Position/\nCustomer Value\nExploit\nRAT\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nInternationalization 2.: Enhancing Capabilities\n- What capability(ies) might we tap in a particular target country?\n\n-\nApply the CATs test:\n-\nAre they Complementary?\n-\nAre they Appropriable?\n-\nAre they Transferable?\nSource: Lessard et al, 2012 (forthcoming)\nEnhance\nAugmented\ncapabilities\nat home\nTarget country-\nderived\ncapabilities\nCAT\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nInternationalization: The Full Cycle\nSource: Lessard et al, 2012 (forthcoming)\nHome-based\nresources/\ncapabilities\nTarget country\nMarket Position/\nCustomer Value\nExploit\nRAT\nEnhance\nAugmented\ncapabilities\nat home\nTarget country-\nderived\ncapabilities\nCAT\n\n(Source: Renault-Nissan Corp. docs.)\nFor the Sloan Fellows - (c) Jose Santos, 2012\nRenault-Nissan\n@!AB\nA\n,\n0C!6#'+\"$$$\n0?3;\nD09<3\nC0CD0\n\nC,90E\n!9\n9C +\n+9+\n\n9C\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nJapanese? French?\n(Source: Corp. presentations)\n0,\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nIn a Global World :\n- The cost of distance is so low that it ...\n-\nEliminates the profitability of arbitraging things that are easy to move\n-\nIncreases the intensity of global competition and transnational production\n-\nTraditional sources of superior performance (such as scale or low labor cost)\nbecome requirements for normal performance (that is, for competitive parity,\nnot competitive advantage)\n\n- Competitive advantage is primarily based on knowledge (skills,\ntechnologies, user experience, ...) and other\n*\nintangibles\n(reputation, culture, institutions) that are very hard to move or\ncopy.\n\n- Knowledge (of the \"hard to move\" kind) is increasingly dispersed\naround the world\n\n(Source: Doz, Santos, & Williamson,\"From Global to Metanational\")\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nGlobal Advantage: National or Metanational?\nNational\nMetanational\nSuperior performance\nSuperior performance\ndepends on the attributes\ndepends on the capabilities of the\n(\"pitch\") of national origin\norganisation and management team\nProjecting to the World\nLearning from the World\n(Porter, 1990)\n(Doz, Santos, & Williamson, 2001)\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nTechnical Knowledge (own)\nTechnical Knowledge (supplier)\nUser Knowledge\nBusiness / Market Knowledge\nThe Roots of Competitive Advantage and Global Market Leadership\nInnovating by melding home-base knowledge or globally dispersed knowledge?\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe Roots of Global Superior Performance\nAugmenting home base\nadvantage by exploiting\ncapabilities and market insights\nfrom different countries\n\nProjecting home base advantage\ninto different countries\n\nNational\nNational Plus\nSensing and melding multiple\ncapabilities and market insights\nacross countries\n\nMetanational\nNational exploration provides\nthe sufficient factors for\ncompetitive advantage\nat the World level\nNational exploration provides\nnecessary factors that are\ncomplemented globally for\ncompetitive advantage\nat the World level\nInternational exploration provides\nthe sufficient factors for\ncompetitive advantage\nat the National or World level\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nWhy Internationalize\n\"National\" Advantage\nInternationalizing to exploit home-based competitive advantage.\nThe World as a source of efficiency and continuous improvement.\n\"National Plus\" Advantage\nInternationalize to exploit and enhance home advantage.\nThe World as a source of efficiency and discontinuous improvement.\n\"Metanational\" Advantage\nInternationalize to create competitive advantage.\nThe World as a source of breakthrough innovation.\nIKEA\n\nShimano\n\nRenault Nissan\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.220 Global Strategy and Organization\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lectures 6 & 7: Between a Global Business and a Global Company; Global Integration and National Responsiveness",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-220-global-strategy-and-organization-spring-2012/f80c4df7c1d4753a22cb08da059fc32a_MIT15_220S12_lec06-07.pdf",
      "content": "Global Strategy & Organization\nJoe Santos\nClass 6 & 7\n\nHaier\nImage of The Haier Building, US removed due\nto copyright restrictions.\nHaier USA\nhttp://www.youtube.com/watch?v=5F2lSPEZPbA\nHaier Europe\nHaier Global\nHaier. \"Company Profile.\" October 26, 2011.\n(Source: Haier corp. websites)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nThe Strategy of the MNC as Multinational\n1)\nThe multinational company (MNC) is particular because its organization spans different countries, not because it\ndoes business in different countries. The MNC is a multi-unit hierarchy with units in two or more countries.\nManaging in a MNC is particular in that one manages with, and for different peoples in their respective\nnational contexts.\n2)\nThe strategy of a MNC as a MNC has to include an organizational value proposition. Any description of a MNC\nstrategy without such organizational element is incomplete. This MNC-specific strategy element has for long been\nestablished as \"global integration.\"\n3)\n\"National responsiveness\" and \"global integration\" constitute the two fundamental factors of the economic (value\ncreated) and financial (value captured) performance of the MNC.\n4)\n\"National responsiveness\" refers to how the MNC responds to the economic, political, and organisational forces\nthat arise from the differences and similarities across nations. National responsiveness choices are content\nchoices embodied in two kinds of specialization. One is \"local specialization\" (or \"local adaptation\" or\n\"localization\"): the extent to which the product and the activities of the MNC in each country are specific to the\nnational context there (i.e. dependent on the local \"pitch\" and applied only there). Local specialization optimizes local\nperformance (say, the country unit P. & L.). The other is \"international specialization\": the extent to which locally\nspecific product features and activities in a particular country apply to the world or to a set of countries.\nInternational specialization optimizes local and global performance. For example, if a MNC decides to have a\n\"center of excellence\" of design in Milano, Italy for Europe, that is \"international specialization\" there; if the same\nMNC decides that its products for Italy will be branded with Italian names, that is \"local specialization.\"\n5)\n\"Global integration\" determines the overall (global) organization of the MNC. The global integration of a MNC\nreflects the value of the union of the country units that constitute the MNC. Global integration is not - at all - the\nextent (let alone the increase) of similarity or standardization across country units in the MNC. Choices of\nsimilarities and differences are \"national responsiveness\" choices.\n6)\nNote that the local organizational choices in each country unit of a MNC depend also on its global integration.\nOnly if global integration is zero (the MNC is a pure portfolio of country-business units) would the local\norganization in each country be a consequence of the business strategy there (i.e. the local unit of the MNC would\nbe equivalent to a local indigenous company).\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nLow\nHigh\nLow\nHigh\nGlobal\nIntegration\n\nNational Responsiveness\n\n(Source: Prahalad & Doz, 1987; Bratlett & Ghoshal, 1989)\nThe two dimensions above define the strategy of a multinational company as multinational.\nIKEA, for example, has a business strategy: it is furniture retailer, with a particular offering and a unique\nbusiness model. But IKEA has a multinational strategy too: high in \"global integration\" and low in \"national\nresponsiveness\" (or \"local adaptation\" or \"localization\").\n\nIBM\n(Source: IBM Canada website)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal Integration\n1)\nAs the world becomes globally integrated, so does the production and delivery of many goods and services. The\n\"global supply chain\" is now a common feature in many industries. \"Made in the World\" is becoming the norm.\nPrinted on the back of an iPhone, you will read: \"Designed by Apple in California. Assembled in China\". Implicit is\nthe statement that the various components are made in many countries. The iPhone is a good instance of national\nspecialization along the value chain.\n2)\nIn the case of apparel, Li & Fung is one remarkable instance of an innovative global business model that relies on\nthe global integration of production activities by local companies. Li & Fung's part is to locally differentiate and\nglobally coordinate and control the whole process (what the company calls \"orchestration\"). This model can be\nreplicated in many other businesses. Apparel was a good candidate to begin with, for it is a very mature business\nwith international trade involved for over one century. Note that the business of Li & Fung is not \"international\ntrade\" (nothing new there) but rather \"international management.\" This is the novelty. A relatively small\nmultinational company \"manages\" the business of thousands of local companies around the world. In the past,\nsuch activity would have very high transaction costs and, if it had existed, it would be inside a large multinational\ncompany, not in a global world. The more global the world, the less important multinational companies will be in\nterms of numbers of employees and value of fixed assets. In a global world, even local companies will have a\nglobal strategy within a global network of partnerships. This still has a long way to go, but is one way.\n3)\nThe Renault-Nissan alliance provides yet another model of global integration, in this case through a strategic\nalliance between two large MNCs from distinct countries.\n4)\nHowever, just a couple of decades ago, the norm for multinational companies (MNCs) was not \"global integration\"\nbut \"local autonomy\" in the the so-called \"multinational\" or \"multidomestic\" model, in which country subsidiaries\nwere rather self-sufficient and geared towards the optimization of local performance (e.g., country P&L). The high\nautonomy of many local units made them known as \"fiefdoms\" and the respective country managers were\n\"barons.\" Several MNCs spoke of their worldwide \"federation\" of national units with pride. They saw the world as\na portfolio of country markets.\n5)\nThe global integration \"of production and delivery\" started early for some companies. Some GIEs (\"globally\nintegrated enterprises\", as IBM's CEO Sam Palmisano called them) were already visible in the 80s. As one might\npredict, the \"GIE\" movement began in industries with high economies of scale in R&D and manufacturing: cars,\nconsumer electronics, and semiconductors, just to name a few.\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\n\"Global Integration\": option or imperative?\n- \"The multinational corporation ... is taking on a new form, one\nthat is promising for business and society.\"\n- \"The emerging globally integrated enterprise is a company that\nfashions its strategy, its management, and its operations in\npursuit of a new goal: the integration of production and value\ndelivery worldwide.\"\n- \"Moving toward the globally integrated entreprise will require\nlong term vision and continous investment ... [and] also call for\npatience and understanding from the part of stockholders\".\n- \"The alternative to global integration is not appealing. Left\nunaddressed, discontent with globalisation will only grow.\"\n(Source: Sam Palmisano (CEO, IBM), \"The Globally Integrated Enterprise\", FA, 2006)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n(Source: IBM presentation, 2008)\nLow\nHigh\nLow\nHigh\nGlobal\nIntegration\n\nNational Responsiveness\n\nIBM\nA 3 x\n2 table wit\nh arro\nws betw\neen th\ne colum\nns to sho\nw organization tra\nnsition.\nImage by MIT OpenCourseWare.\n\nIBM's Integration of Production and Value Delivery Worldwide\n(Source: IBM presentation, 2008)\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThree adjacen\nt blocks of text\nand respectiv\ne headings\non producti\non and val\nue delivery.\nImage by MIT OpenCourseWare.\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nuSpecialization\n(market knowledge, ...)\nuProximity to customers\n(international lead customers, distant customer sites, ...)\nuIntegrity\n(consistency of image, international reputation, ...)\nuServing global customers\n(namely, customers becoming global!)\nuSpecialization\n(technologies, skills, operational capabilities. ...)\nuScale\n(R&D, manufacturing, operations, procurement, ...)\nuScope (across countries)\n(management teams, plants, offices, distribution channels, ...)\nuFlexibility\n(redundancy in the supply chain, arbitrage of factor costs,...)\nuCompeting globally\n(coping with multipoint competition and \"grey trade\")\nLower global c3\nHigher overall p\nHigher global v3\nThe value of Global Integration\n\nGlobal Integration: The value propositions\n1)\nGlobal integration is not equally advantageous to all companies in all businesses. One needs to assess the\neconomic and financial value of global integration, for the cost of global integration is granted and noticeable\n(namely for the multi-domestic MNC). There is no benchmark here. However, if the extra value of global\nintegration is not substantial (say, 15% or more of your top line), it may be wiser to reconsider it. However,\nfailure to globally integrate may simply mean going out of business, in which case it becomes an imperative, not\nan option. When estimating the value propositions of global integration, the base case is the same MNC with\nautonomous country subsidiaries.\n2)\nHigh global integration brings added value to customers or users (and higher \"willingness to pay\") because of one\nor more of the following factors: market specialisation; proximity to customers; integrity; and serving global\ncustomers.\n3)\nThe active proximity to local customers is particularly valuable during customer acquisition, business negotiation,\nand delivery, more noticeably in the provision of services and solutions. Behaving like a drone will not satisfy a\nlocal customer that values a supplier that is \"easy to work with\", flexible and able to perform real time\nadjustments. If the MNC supplier is seen as distant or slow, this will easily generate a perception of unreliability\nand turn into loss of business. However, this is valid for all MNCs as suppliers, globally integrated or not. What the\nglobally integrated MNC can achieve by being proximate to its local customers is to access the knowledge of users\nin the product's lead country market, even tacit and locally-specific knowledge, as well as to learn how to respond\nto the most demanding customers in the world and convey such knowledge internally to its other units around\nthe world. In both cases this will potentially turn into differentiated offerings and superior value proposition to\nlocal customers everywhere. For example, an integrated MNC can augment their offering to a local customer by\nthrowing in the role of international knowledge broker. Accenture, for example, can benefit a local ERP\nimplementation by adding the knowledge it gained from its experience of similar implementations in more\nadvanced contrives in the client's industry with due respect for third-party IP. This will most likely increase the\nperformance of the client, or be perceived as such. Local suppliers or local units of non-integrated MNCs can't\neasily offer that.\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal Integration: The value propositions (cont.)\n4)\nLocal units should be specialists of local demand and be intimate with local lead users, local demanding customers\nand local non-customers. Such local market knowledge (for example, what product attributes local customers\nvalue more and value less, now and tomorrow) is then brought into the product design and development\nprocesses together with that from colleagues from other country markets. It is this comparative and parallel\nprocess of product design and development that will optimize the value for the various local customers while\naggregating those features that are commonly shared across borders (the \"global product platform\", as is called\nin some industries). A product is no longer the ad-hoc adaptation of a home-based design to each local market (a\nsequential process, regularly sub-optimal), but a globally integrated design.\n5) Integrity and reputation are valuable in all businesses and paramount in some, be it goods such as\npharmaceuticals, food and beverages, or cars, or services such as healthcare, auditing, or corporate banking. This\nis not new in a global world. What is new is that an incident anywhere, even in a small and remote location of the\nplanet, will quickly be turned into worldwide news. Customer trust and investor goodwill everywhere can be lost in\na blink of an eye. Just recall that Arthur Andersen, an old, large and highly respected auditing firm by all over the\nworld, disappeared in a fortnight after the Enron imbroglio, which was traced to a failure by a relatively small\noffice in Texas - of which most partners around the world had never heard of before. The recent BP disaster in\nthe Gulf of Mexico is another case in point - and the BP chief executive had never heard of that platform either.\nThis has a direct bearing on global integration, for both local failures and ineffective responses are indicators of a\nnon-globally integrated organisation, particularly one where local performance optimization is managed\nirrespective of global risk, and where global compliance and global oversight are lacking. Arthur Andersen and BP\nare exemplary in these respects too; in the instances above, and given the high status and businesses of the two\ninstitutions, what the world did not forgive was the obvious lack of compliance with professional and safety\nnorms. \"One for all\" is even more effective in the negative.\n6)\nA global customer finds value in a MNC supplier that is equally integrated or more so. The particular needs of a\nglobally integrated customer include the coordination of procurement and delivery across borders, joint worldwide\ncapacity, logistics planning and review meetings, flexibility in delivery locations, worldwide quality assurance,\nglobal service levels, and, not least, global pricing agreements. A non-integrated MNC supplier is disruptive to a\nMNC customer in the process of integrating as the supplier local units will act as centrifugal forces to the\ncustomer local units.\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal Integration: The value propositions (cont.)\n7)\nHigh global integration brings lower costs because of the following factors: specialization; scale; scope (across\ncountries); and flexibility.\n8)\nThe international specialization of operations brings lower costs through two direct efficiency effects. Focusing a\nplant or a service center on a particular product for a set of countries, even the whole world, brings faster\naccumulated experience, a \"learning curve\" effect. But it also allows for a unit's location choice that will optimize\nthe local availability of world-class technicians and workers, suppliers, and knowledge spillovers from similar local\nunits, a \"cluster\" effect. Furthermore, the MNC can learn first-hand experientially where in the world are the\nmore technically savvy, capable and efficient suppliers, R&D institutes, banks, consultants, and so on. Such deep\naccess to superior technologies and other inputs will not only provide for the continuous improvement of the\nMNC's operations and product offering everywhere, but even bring about new breakthrough products.\n9)\nGlobal integration allows for the geographical concentration of operations. This will bring about larger economies\nof scale than even the largest country market affords (technology permitting). Historically, the Japanese MNCs in\ncars and consumer electronics that grew to prominence in the 80s (such as Toyota, Sony, or Matsushita/\nPanasonic) took great cost advantage from their \"export-model\", often based on a single plant in Japan producing\nfor the whole world. Their Western competitors, established MNCs, had a large number of plants around he world,\nsometimes producing for one country only - the legacy of a non-global world. Such impact of economies of scale\nand lower prices in the growth of Japanese MNCs in such industries (at the expense of famous local and\ninternational brands such as Volvo, Rover, RCA, Philips, and many more) prompted scale to become the most\nobvious and popular effect of globalization. Bargaining power with suppliers is steeply increased by buying at a\nmulti-country level. Economies of scale in R&D are also very relevant in industries such as chemicals,\nsemiconductors, or pharmaceuticals, where product differentiation across countries is minimal - and which were\namong the first industries to become \"global.\" (\"R&D intensity,\" the ratio of R&D expenditures over sales, is one\nof the accepted measures of an industry's propensity to globally integrate.)\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal Integration: The value propositions (cont.)\n10) However, the more specific efficiency effect of global integration lies in economies of scope across countries. Such\ninternational scope in the MNC can easily be confused with scale. Economies of scope derive from the use of the\nsame asset to produce two (or more) different products or activities. Economies of scale come from it producing\ntwice or more of the amount of one product or activity. The confusion between scope and scale in the MNC\ncomes from the fact that \"global markets\" are rare, and therefore most goods and services are somewhat locally\nadapted. Such localization in a non-global world meant one factory per country with local scale. In a global world,\nit means one factory capable of producing several country variations of the product. There will be economies of\nscale in the production of the common parts or \"global platform\" of the product, and economies in scope in the\nrest of the product. However, if one considers the economics of the whole product, then what we should\naccount for are economies of scope across countries, for that is the source of variation. If one repeatedly\nfocuses on economies of scale, there may be the usual and uncalled for confusion between aggregation and\nintegration, the belief that globalization requires standardization of the product across borders. The potential for\neconomies of scope is yet very large in all functions and tasks, including management. Many MNCs have now\ndispensed of country head offices, and one regional office manages selected activities in a number of countries.\nAgain, note that overseeing sales in Spain and Portugal are not the same activity (local languages differ, labour\nand commercial law are different, buying patterns are different, and so on). One should not state that a central\noffice in Madrid for the whole of the Iberian Peninsula provides an economy of scale across the two countries -\nwhat it constitutes are economies of international scope. For what has happened in some cases is that the Madrid\noffice starts to treat sales in Spain and Portugal as if the two were the same. The corollary is poorer top line\nperformance, usually superior to the realized economies of scale (literally, in such case...).\n11) Flexibility across borders is a particular source of lower costs or higher returns in the integrated MNC. There are\ntwo sources of advantage here. One is the flexibility of diverting operations to another country unit in the\npresence of local surges in demand, local shortages of inputs, or local disasters. The other is the arbitrage of\nfactor costs, namely on the price of inputs that are immobile or non-tradable across borders, such as energy\nprices, labour rates, tax rates, licensing rights, or exchange rates. The ability to draw on flexibility in the MNC calls\nfor redundant capacity by design; worldwide information on current capacity utilization, short term requirements,\nand factor prices; as well as suppleness in capacity planning and procurement routines across countries. Flexibility\nin the MNC also reduces the bargaining power of local unions as the threat of activities being sent abroad is\ncredible. Unions have responded by coordinating their actions across countries (globalization is for all...).\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal Integration: The value propositions (cont.)\n12) High global integration also brings a higher value captured though higher price because of higher willingness-to\npay and superior ability to compete globally.\n13) Industrial economists were among the first to look into how competition would change in an open world. Take the\npopular \"five forces\" model by economist Michael Porter. If the forces that matter in one industry are all by local\nagents (suppliers, buyers, rival incumbents, new entrants, and substitutes), then the industry will behave as a\ndomestic industry in different countries (hence, multi-domestic), even in a global world. The global integration\nimpact on product prices and on factor prices will be zero or very small. However, if one or more forces have\ninternational reach, then the industry is \"global.\" The case of multipoint competition is illustrative. Company A\ncompetes with company B in country X and in country Y. If A lowers the price in X and forces B to lose an\nimportant deal there, then B can lower its prices in Y to cause even greater damage to A. The country manager\nof A in Y won't know what hit him, and may not even suspect that the cause of such loss was an act by his\ncolleague managing A in X. In an industry where incumbents reach internationally, global integration keeps the\naverage price higher by coordinating pricing within the company across countries and by stopping or minimizing\nlocal competitive races to the bottom. Another instance: facing up to a powerful international buyer or supplier\nwill imply coordinated sales or purchasing negotiations across countries. A non-integrated MNC supplier will have\nlower bargaining power when facing a more integrated MNC customer, who can better gather and put to use\ninformation about the procured product market conditions, pricing and terms around the world.\n14) Higher average price will also result from a higher willingness-to-pay by local and global customers that will value\nthe global positioning of the MNC as we saw above with the customer value proposition of global integration.\n15) The coordination and control of sales and prices across borders inside the MNC can also keep the world average\nprice higher by eliminating or minimising the viability of grey-trade (when a local customer buys from a\nMNC and is able to re-sell the same goods in another country in competition with the same MNC or its official\ndistributor there). These practices usually fall under local and international competition laws.\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nGlobal Integration: The value propositions (cont.)\n16) A note on the transfer of \"best-practices\": The international transfer of best-practices is not a trademark of the\nglobally integrated MNC. Any local unit of any MNC or even any local company can benefit from sourcing\nknowledge abroad. Such transfer is difficult and costly anyway because of the messy and sticky nature of\nknowledge (for example, technical know-how and operational skills are markedly tacit and context-specific).\nHowever, global integration creates the conditions for superior transfer of best-practices in two ways. Even before\nthe transfer begins, the receiving unit must be aware of the very existence of the different practice abroad and\nwhether it constitutes a best-practice. And then it must be able to source it, which may simply be impossible or\nvery costly if the IP is owned by a competitor. The globally integrated MNC addresses these access difficulties by\ninstitutionalizing internal contests and exhibitions of best-practices, technical steering committees, cross-country\nfunctional teams, centers of excellence, and through the mutual visits of local managers around the world or via\nthe information exchange at the eGLT. We also know that the transfer of best-practices depends on the\nabsorptive capacity and motivation (the \"skill and will\") of the receiving unit, and on the quality of relations\nbetween the sending and receiving units. Again, the global integrated MNC fosters a corporate context in which\nsuch factors can be addressed with team spirit across countries, complemented with training in-context and\nspecial performance appraisal metrics and incentives. So, the transfer of best practices is not specific to global\nintegration, but a globally integrated MNC can benefit from a more effective and efficient transfer of best-\npractices across its units around the world. Therefore, global integration causes a better performing transfer of\nbest-practices.\n17) And what about risk? Global integration may sharply increase economic performance and financial returns, but it\nwill also increase risk. The multi-local MNC diversifies country risk, the globally integrated company amplifies\nenterprise risk. That is the hallmark of interdependence. What happens anywhere can affect everywhere. Note\nthat the root cause of such added risk is the \"global world\" we live in. Even a multi-local company can suffer from\nthe domino-effect of a failure across countries. What is special about the global integrated MNCs is that structural\nchoices made by the company render its units in each country dependent on units in other countries, irrespective\nof what happens in the world. An operational failure in one country may turn into higher costs in many countries.\nA global customer poorly served in one country may react everywhere. The internal and external global risk\namplification may produce very nasty effects, as the recent Toyota's \"sudden acceleration\" case shows.\n(Source: Santos, 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.220 Global Strategy and Organization\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lectures 8 & 9: Local Adaptation & Lecture; Global Strategy and Knowledge Management",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-220-global-strategy-and-organization-spring-2012/00944d1bcc36d4ea8b0f89b975444587_MIT15_220S12_lec08-09.pdf",
      "content": "Global Strategy & Organization\nJoe Santos\n\nClass 89\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nNational Responsiveness or Local Adaptation or Localization\n\nounterc\n\n%&'&(\n'' ,&,, %-\n\n/&\n01&\n(2\n305&&\n%\n304&\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\n6&' &\n-\n/\n&(&& &\n% (( '\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nPiece\nRate\nBonus\nMerit\nRank.\nE. Adv.\nBoard\nUS\n\nNetherlands\n\nPoland\n\nVenezuela\n\nMexico\n\n(team)\n\n(home loans)\nFlexible Adaptation to national labor institutions\n(Source: Siegel, 2009)\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nManaging Localization*\nHow do we respond to the differences across nations\nto optimize local performance?\n\n\"Act Local\"\n\"Act Universal\"#\nLow\nHigh\n# Avoid using \"Act Global\"\nNational Responsiveness\n(\"Local Adaptation\" or \"Localization\")\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe value of \"National Responsiveness\"\nSatisfaction of Local Preferences\nLocal Customers, Prescribers, Users/Consumers\nLocal Government\nLocal Society\nEffective Competition with Local Competitors\nLocal companies\nLocal subsidiaries of other MNCs\nLocal substitutes\nEfficient Use of Local Resources\nLocal managers and employees\nLocal vendors and partners\nOther local resources (tangible, intangible)\nHigher Local v\nHigher Local p\nLower Local c\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe prize of high local responsiveness\nin a global world is high!\n(Source: Company data)\nA shaded\nline gra\nph\nsh\nowi\nng\nste\nady\n, th\nen s\nteep\ncli mb i\nn ma rket\ngro\nwth.\nWorld\nmap with\nnumbers\nover th\ne A\nmericas,\nEurope, Asia, a\nnd the southern t\nip of Africa.\nImage by MIT OpenCourseWare.\nImage by MIT OpenCourseWare.\n\nNational Responsiveness\nFor the Sloan Fellows - (c) Jose Santos, 2012\nHyundai USA Unemployment Insurance, Jan 2009\n\ne!\n\"#\n\nLincoln Electric Regional Performance (2005)\nRegion\nROA\nSales/Assets\nSales ($M)\n\nAssets ($M)\nUSA & Ca\n0.28\n1.7\n1,078\nMex & LA\n0.16\n1.5\nEurope\n0.07\n1.4\nAsia & Aust\n0.05\n1.3\n\n(NB. US and Germany with highest wages were amongst the best performing units)\n(Source: Lincoln Electric in China - INSEAD case)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n(Source: Milgrom & Roberts, 1995)\nComplementarities* and Performance\n*More of one increases the return of more of the other. So, if A and B are complements, both [low\nA, low B] and [high A, high B] will exhibit positive outcomes (higher vpc for different market\nsegments, for example) and (low, high) combinations will exhibit negative outcomes (lower vpc) -\nrecall the pianist-violinist analogy.\n(c) Elsevier. All rights reserved. This content is excluded from our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n(Source: Siegel and Larson, Management Science, 2009)\n\nNational Responsiveness at Lincoln Electric\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe challenge of growing international\nE\nS\nO\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nStrategy\nWhat we do, for whom,\nwhere, and how we do it\nEnvironment\nOrganization\nOur people ,\nmanagerial mindset,\nstructure, pr\n\nocesses,\nperformance metrics,\nincentives\nElements of company* performance\nWhat is around us:\ncustomers, shareholders;\nsuppliers, competitors,\npartners, government,...;\nsociety\n* Company or \"business unit\". The expression We in the elements above means the company\" or business unit.\nNB. If you manage a unit, then the rest of your company is part of the Environment of your unit.\n(Source: Santos, forthcoming 2012)\n\nElements of company performance\n- Environment: the company's customers and its shareholders; its suppliers,\ncompetitors, partners, ...; and society, the national or international context of\nits activities. Such context exhibits not only physical, institutional,\ntechnological, and cultural properties, but also a particular history - i.e., a\ngiven \"PITCH\".\n\n- (Business) Strategy: the company's offerings (good and services) and\nposition (value propositions) in its target markets, its set of activities (its\n\"business model\") and resource allocation. This is the real or actual\n\"business strategy\" of the company - hence, what the company does and\nhow it does it - and should not be confused with the planned or intended\nstrategy.\n\n- Organization (see next slide)\n\n(Source: Santos, forthcoming 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nA model of Organization\n\n- \"People\" is the set of individuals in the organization, with their individual traits, style, experience and skills. It\nincludes particularly all its managers: the general manager (\"CEO\"), the top management team and the other managers. If we\ntake the whole organization, it will include also the other employees , and even outsourcing agents that are closely\nintertwined with the people of the organization in their daily activities.\n\n- \"Managerial Mindset\" refers to the principles, values and frames of reference shared by the general\nmanager (\"CEO\") and the management team. The \"purpose\" of the company, its \"vision\", and its \"goals\" are elements of the\n\"managerial mindset\" and express the intent and dreams of the management team. The \"managerial mindset\" determines\nwhat is right, good, and beautiful for the organization - and therefore guides the managers in their choices.\n\n- \"Structure\" is the organizational structure, i.e. the differentiation of roles, location, information, and authority\n(decision rights) and their integration through a number of coordination and control mechanisms. The structure includes the\npattern of relations between the individuals and units that make up the organization, be it the formal relations (the \"org\nchart\") and the informal relations (the \"network\").\n\n- \"Processes\" include, in general, the decision making processes in the organization, be it resource allocation\n(budgeting, headcount and capex planning,...), conflict resolution, and the handling of exceptions. Specifically, it includes\ninformation processes and people processes. (N.B. These are the processes that make the organization be (the \"physiology\" of\nthe organization), not the activities/processes that are elements of \"Strategy\"(such as delivering a solution to a client).\n\n- \"Performance Metrics\" is the set of indicators (quantitative and qualitative) used in the company to measure\nthe individual, unit, and organization level performance.\n\n- \"Incentives\" include the instruments of recognition, retribution, and motivation of managers -- and other\nemployees -- for their own performance: the salaries and equivalent; the bonus systems and other special rewards; and the\ncareer and promotion rules.\n\n(Sour\nce: Santos, forthcoming 2012)\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nA model of Organization\n\nPeople\n(Managers)\nManagerial\nMindset\nStructure\nProcesses\nPerformance\nMetrics\nIncentives\nN.B. 1. There are several systemic models of \"Organization\", each giving special emphasis to particular elements. I developed the\nmodel above to focus on managerial intervention, but you can use another model - for example, the \"PARC\" model (by Roberts) or\nthe model built in the 7Ss (by Waterman et al, aka the \"McKinsey model\") or in the \"STAR\" (by Galbraith).\n\nN.B. 2. I developed and depict the model this way in order to signify the critical role of the \"right side\" (Mindset, Processes,\nIncentives) in global integration.\n(Source: Santos, forthcoming 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nThe challenge of growing international\nE\nS\nO\nComplementarities\nImplementation\nEH = ET\nSH = ST and OH = O T\n(Source: Santos, forthcoming 2012)\nFor the Sloan Fellows - (c) Jose Santos, 2012\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nThe challenge of growing international\n\nWhat is the essential bit that companies don't know\nwhen they start to reach bey\n\nond their home country?\nThe Home Context Impact at Home + The \"double-fit\" of O\n\nE\nS\nO\n?\n(Source: Santos, forthcoming 2012)\n\nFor the Sloan Fellows - (c) Jose Santos, 2012\nManaging \"Localisation\":\nUniversal Core and Local Substance\nUniversal\ncore\nLocal substance\nNational Responsiveness\n(\"Local Adaptation\" or \"Localization\")\nLow\nHigh\n[E, O(o1,o2,o3,o4,...,...,on-1, on), S(s1,s2,s3,s4,...,...,sm-1,sm)] X\n\n(Source: Santos, forthcoming 2012)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.220 Global Strategy and Organization\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}