{
  "course_name": "Global Africa: Creative Cultures",
  "course_description": "This course examines contemporary and historical cultural production on and from Africa across a range of registers, including literary, musical and visual arts, material culture, and science and technology. It employs key theoretical concepts from anthropology and social theory to analyze these forms and phenomena. It also uses case studies to consider how Africa articulates its place in, and relationship to, the world through creative practices. Discussion topics are largely drawn from Francophone and sub-Saharan Africa, but also from throughout the continent and the African diaspora.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music Performance",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "History",
    "African History",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Fine Arts",
    "Music",
    "Music Performance",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "History",
    "African History",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course, but French language concentrators should have taken\n21G.028 African Migrations\nor have the permission of the instructor.\n\nCourse Description\n\nThis course examines contemporary and historical cultural production on and from Africa across a range of registers, including literary, musical, and visual arts, material culture, and science and technology. We employ key theoretical concepts from anthropology and social theory to analyze these forms and phenomena, and historical perspectives help to both situate contemporary cultural production and to interrogate the future directions of African being in the world. Anchoring our discussions in case studies, we consider how Africa's place in and relationship to the global is articulated through creative practices. The course shows creative cultures and cultural production as not only aesthetic or functional, but also thoroughly political. We explore cases from throughout the continent.\n\nThe course is taught in English; French language concentrators have the option to complete additional assignments in French.\n\nRequired Readings\n\nRequired readings are listed in the\nReadings and Videos\nsection.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nReading responses (weekly, 10 total)\n\n20%\n\nPresentation of readings (1)\n\n20%\n\nPaper\n\n20%\n\nFinal project\n\n30%\n\n(20% for project + 10% for project presentation)\n\nClass participation\n\nThe class will run largely on discussion, so I expect you to come having completed the readings and ready to discuss the material with your classmates!\n\n10%\n\nFor further detail on the activities above, see the\nAssignments\nsection.\n\nAcademic Integrity\n\nMIT students are expected to adhere to MIT's\nAcademic Integrity\npolicies. All work (research papers, weekly papers, presentations) must be completed independently. Students are encouraged to discuss the readings and their projects with each other (they may, for example, want to practice their presentations for their classmates), but they are individually responsible for all written work.",
  "files": [
    {
      "category": "Assignment",
      "title": "21G.026_S18 Assignments: Reflection4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-026-global-africa-creative-cultures-spring-2018/4d4ba50c020805491f024eaecb7be735_MIT21G_026S18_Reflection_4.pdf",
      "content": "Reflection 4\nThe narrative of African film, perhaps one that is not as commonly explored outside the\ncontinent, has a long history. Initially the African Film scene was tied closely to European\nfilmmaking and was characterized by auteur cinema, often with a francophone bias. Auteur\ncinema's search for the 'African aesthetic' as Saul and Austen mention, involved attempting to\n'contribute to universal art' as well as 'reach the local audience'. Despite this, few 'respected'\nfilm makers pursued the commercial route of film, perhaps both due to the 'low critical appeal'\nas well as the narrow region-based markets, both of which created unfavorable financial\ncircumstances. This style of cinema is often contrasted to Nollywood, a type of filmmaking that\nhas been revolutionary in its 'transnationality' as Krings and Okome mention. Nollywood is\npresented by its critics as everything African auteur cinema is not, the latter aiming to re-define\nthe image of Africa, the former re-affirming stereotypes. Despite this, not even critics can deny\nits overwhelming international popularity as well as its recognizable Africanness. Additionally,\ntowards the end of the Krings and Okome piece, he brings forward how even highly critiqued\nNollywood movies, namely Osuofia in London, can be read a variety of different ways and can\noffer a place for Africans to reinvent and debate their Africanness. This aim, held by the makers\nof African auteur cinema as well, was perhaps really achieved continent-wide by Nollywood\nfilms. Despite this, these two styles of filmmaking remain separate and often each style is\n'proud' to be defined as the counter of other. The question I personally find interesting is that of\nthe African stereotype and Globality. Is it fair to critique exploiting the African stereotype? Or is\n\nthe critique towards Nollywood yet a further relic of African exclusion, in that African art cannot\nescape the baggage of African stereotypes. The famous filmmaker, Ousmane Sembene, remarked\nin the Saul piece, 'Rubbish for rubbish, let's make African rubbish' but the real questions as\nglobal Africans is, 'Can we afford to?'\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.026 Global Africa: Creative Cultures\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21G.026_S18 Assignments: Reflection6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-026-global-africa-creative-cultures-spring-2018/29382c8c775e48ce26c45800991b5474_MIT21G_026S18_Reflection_6.pdf",
      "content": "Reflection 6\nThe idea of a tradition is not commonly one that invokes images of flexibility or\nversatility. Instead tradition is often seen as the opposite, as the antithesis of change or\nvariability. But not all traditions are truly as aged as they may seem and in some cases these\nperceptions of age are deliberately forced. The idea of an 'invented tradition', coined by\nHobsbawm and Ranger, then describes this use of both overt and tacit rules, as well as rituals of\na symbolic nature to instill principles and norms. Here the distinction between an invented\ntradition and an 'organic' one comes in that, with an invented tradition the continuity with the\npast is largely artificially constructed. In addition, the writers mention that the crucial functions\nof these invented traditions can largely fall under three umbrellas, to establish social unity, to\nlegitimize relations of power and to indoctrinate beliefs.\nAlthough the piece discusses distinctions between invented traditions and other similar\ncultural forms, such as customs, in detail, perhaps not as well discussed were the limits of so-\ncalled 'invented traditions'. In this sense I mean, how does an 'invented tradition' become\nrecognized as 'not legitimate' by the people that practice it and in the cases where this happens\nhow does this affect the legitimacy of the values and norms that it chooses to impose. This\nquestion becomes relevant, in my opinion, to understand the creation of an ethnic identity among\na group of people and the power dynamics that then align in either in harmony or opposition with\na similarly constructed national identity. When a certain ethnic identity questions the truth of a\n\nnational one, how does a community then respond? Hobsbawm and Ranger argue that an\nimportant role of 'invented traditions' is that it is relevant to invent and imagine the idea of a\n'nation'. And on a parallel note, the Boateng piece uses the idea of 'imagined communities' to\nask probe ideas of ownership and appropriation in the content of a Ghanaian state. The next\nquestion to ask, in my opinion, then becomes 'Can we think of communities being invented in a\nsimilar way to traditions?' If indeed so, Boateng may be able to provide understanding of\nevolving ethnic identities in his argument stating that the important questions to ask are those of\nthe stakes involved. Then perhaps this forms an avenue to truly understanding how self-\nperceived nationalities and ethnic groups interact with a 'national' identity.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.026 Global Africa: Creative Cultures\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21G.026_S18 Assignments: Reflection7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-026-global-africa-creative-cultures-spring-2018/3aec8ed26acf3c6c9911d4ace2115b53_MIT21G_026S18_Reflection_7.pdf",
      "content": "Reflection 7\nAfrican creative writing and writing in general as an idea is one that comes fraught with\nbaggage. In addition to the normal questions that are asked of any piece of writing and how it\nconnects to its audience, African writing is sometimes seemingly expected to hold itself to a\n'higher' standard. As Chinua Achebe states in his piece on the purpose of African writing, an\nAfrican writer that 'avoids big social and political issues' is completely irrelevant. This thinking\nAchebe justifies by stating that the great issues Africa deals with it almost uniquely and thus\nAfrican writing must operate by a different set of criteria. This later ties in with the idea from the\nindividual perspective that 'artists' have a heightened sense of perception and thus cannot be\n'unaware' of this injustice that happens around them. Because they are then 'aware', these\nwriters must work for the 'just' causes of their people.\nThis debate is not one that is now antique but still very much alive and well. From the\ncritics of various popular African art forms, including Nollywood and Afrobeats, we hear of this\nAfrican creators' burden, to create something that engages with the socio-economic reality of the\nAfrican continent as opposed to being 'unaware'. These arguments often come ingrained with\nthe assumption that creation and in this case writing that engages these issues is not only of more\nintrinsic artistic and moral value but is also able to impart more value to African people.\nHowever, as Krings and Okome mention about the value of Nollywood and its novel creation of\nthe conversation around African identity, a goal that had not been reached by the 'political'\ncinema of the day, these basic assumptions often need to be revisited and perhaps revised.\nEspecially in today's day and age where the African existence itself can be leveraged as a means\nof resistance and self-affirmation, the question that evolves then becomes 'Must an African\nwriter and creator at large who does not engage with these larger socio-economic issues be\ndeemed irrelevant? And what does this say about about own biases however we choose to\nanswer this question?'\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.026 Global Africa: Creative Cultures\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21G.026_S18 Assignments: Reflection9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-026-global-africa-creative-cultures-spring-2018/4d321487b2a96854e4de6d3a39cc312e_MIT21G_026S18_Reflection_9.pdf",
      "content": "Reflection 9\nWhen discussions are had on science and technology, especially with regards to pushing\nfrontiers, no continent exists closer to the margins than Africa. Although language these days is\nchanging to have Africans become owners of technology and improvement as opposed to just\nreceivers of 'Western technology', I would argue a large mental barrier still exists in the minds\nof the world that essentially separates the idea of 'Africa' from that of tech. I believe it is this\nbarrier that Eglash tried to overcome in his work about Generative tech in Africa. Eglash speaks\nof the power of bottom up technology to create a true egalitarian society not dominated by the\n'monopoly' of large companies. Throughout the piece we learn of various ingenious and\nsustainable ways to create value and give power to people, be it through urban gardens or\n'fractal' style housing. However, the author also warns against the 'self-deluding' practice of\nbelieving this technology created by Africans can take on the role of 'mending' a harsh history.\nThis piece makes good points about African technology and the benefits it can carry for but\nleaves an important question relatively unanswered. Given the state of large multinational\neconomies in the world, something the author points out very early in the piece, it becomes hard\nto see how ordinary people can create technology that may be against the interests of these\ncorporations. The author seems to speak of an Africa that is not grappling with these same\ncorporations and discusses very little how bottom-up egalitarian tech may be thwarted by\n'bigger' interests. And overall the piece seems to imagine Africa as removed from these\ninterests, a playground for true creativity so to speak. However, I believe a detailed discussion\nand auditing of these interests and examples of African tech that have been able to co-exist with\nand even outcompete these influences may be something that not only helps our understanding\nthe potential of African generative tech but also help identify avenues for advancing this\npotential to reality.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.026 Global Africa: Creative Cultures\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21G.026_S18 Final Project Example: Price of Love",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-026-global-africa-creative-cultures-spring-2018/60cd02f6a6f179431bdedab4acc442e7_MIT21G_026S18_Final_Project.pdf",
      "content": "\"The Price of\nLove\"\nBy Nwamaka Amobi and\nGabrielle Ballard\n\nOn a cool summer evening, two Nigerian-American girls sit in their Boston apartment and\ndiscuss their life plans:\nI don't want to\nbe an empty\nbarrel like the\nwomen in this\nbook.\nAnd all the single people\nare looking for love. You\nknow I got what they\nneed.\nWell, you should\nget married\nthen.\nOMG I love\nweddings: family\nbonding, amazing\nmusic, great food.\nWINK!\n\"\n\nGirl, I wasn't serious.\nWeddings are entirely\ntoo much work. First of\nall, they cost too much\nmoney.\nYour family has to pay for all the food, the\npalm wine, and the kola nut.\nAnd you have to buy everything in excess so\nthat everybody can eat.\nYou know the whole village bout to show out.\nThat sounds fun though!\nI stay planning events!\nThat's all I do around\nhere.\n#\n\nNo no no.... You\ndon't understand.\nYou're not planning\nthis event.\nWell that's okay. I still get\nto participate in culture and\nstuff. I get to eat the kola\nnut, drink some palm wine...\nyou know, get lit.\n#CULTURE\nThe men make all the\ndecisions; you just cook and\nserve the jollof. You don't even\ndecide what to cook; the older\nwives in the family direct you.\nEw.\n$\n\nYou thought. You'll be lucky if\nsome kola nut gets to you\nafter the titled men, older\nmen, younger men, titled\nwomen, and older women all get\nsome.\nAnd palm wine? Forget it.\nAll you take is a sip and\nthe groom drinks the rest.\nFine. I hear what you're\nsaying, but I'll just put my\nown spin on tradition. And\ndo things my way.\nYIKES!\n%\n\nAre you crazy? No one will\nrespect that marriage!\nSMACK!\nWhat do\nyou mean?!\nYou can't just \"put your own\nspin\" on tradition. If you don't\nfollow the strict practices, it's\nnot legit. Period. It just not.\n&\n\nWhat if I can't\nafford all that\nstuff you talked\nabout??\nWell my auntie said that\nif you can't pay for it,\nthat's your problem.\nTRADITION IS\nNON-NEGOTIABLE.\n'\n\nEND\n(\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu/\n21G.026 Global Africa: Creative Cultures\nSpring 2018\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}