{
  "course_name": "Global Markets, National Politics and the Competitive Advantage of Firms",
  "course_description": "This course examines the opportunities and risks firms face in today’s global world. The course provides conceptual tools for analyzing how governments and a variety of social and economic institutions influence competition among firms embedded in different national settings. Public policies and institutions that shape competitive outcomes are examined through cases and analytic readings on different companies and industries operating in both developed and emerging markets.  In addition to traditional case/class discussions, this course will include some presentations by various guest speakers. The hope is that greater exposure to/interaction with these real-world practitioners will “bring to life” some of the issues discussed in the readings/cases. Whenever possible, informal dinners and/or coffees will be organized for small groups of students interested in meeting with our guest speakers.",
  "topics": [
    "Business",
    "Globalization",
    "Social Science",
    "Economics",
    "Industrial Organization",
    "International Economics",
    "Public Administration",
    "Public Policy",
    "Business",
    "Globalization",
    "Social Science",
    "Economics",
    "Industrial Organization",
    "International Economics",
    "Public Administration",
    "Public Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nReadings\n\nReadings include a combination of analytic articles and company case studies drawn from a variety of different industries (manufacturing and services) in Europe, Latin America and Asia.\n\nRequirements\n\nThe requirements for the course and the contribution of each towards the final grade are as follows:\n\n3 Case Write-ups (10% x 3) 30%\n\nIn Class Final Exam 30%\n\nClass Participation 40%\n\nThese requirements are described in detail below:\n\nCase Write-ups\n\nThe case write-ups should be brief, no more than 3 double-spaced pages. You may choose any 3 cases to analyze. Cases include both the traditional HBS cases and company/industry cases discussed in some of the readings. Write-ups are due on the day the case is to be discussed in class. They are intended to be analytic discussions of some issue central to the case. Please do not write a precis of the case or repeat case facts except to bolster your argument. Based on the information provided in the case materials, please be analytically judgmental and evaluative. You should propose alternate managerial views and action plans whenever appropriate and discuss the relevance and applicability of the frameworks proposed in the readings and lectures. In short, you should write what you think of the situation in the case and not merely what the author of the case says.\n\nFinal Exam\n\nA final exam will be given in class. The exam will be an essay exam based on questions discussed in class. Details will be explained in class.\n\nClass Participation\n\nYour active participation in the discussion in class is integral to the design of this course. Prior preparation of the cases and assigned readings are essential as this background is presumed in the lectures and case discussions. Those of you whose native language is not English and/or may have difficulty speaking up in class are encouraged to meet with me to discuss how your participation in class can be ensured. Weekly discussion sections will be organized so that we can clarify/elaborate on any points raised in class. These discussion sections are optional, intended only for those of you who find these extra sessions helpful.",
  "files": [
    {
      "category": "Resource",
      "title": "Gerber Case",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-224-global-markets-national-politics-and-the-competitive-advantage-of-firms-spring-2003/6250d1c6800e1e0f71df6820c21e78c0_gerbercasenoteslect.pdf",
      "content": "15.224 Governments, Markets and International Competition\nGerber Case\nBasic Facts\n73-year-old firm from Freemont, Michigan.\nProduces and sells baby food - 165 varieties.\nFocus on Quality vs. price. Pediatrician recommended, etc.\nHeld 72% of US Market, but the US only counts for 3% of world babies.\nThe company is looking to grow traditional business, after failing in other areas\nsuch as day care centers.\nDecided to focus on Eastern European market to attack local market and as a\nplatform for entry to Western Europe.\nPoland - Reasons for closing deal\nNeeds FDI.\nNeeds hard foreign currency.\nHas to signal to the world that it is embracing market reforms. Has the goal of the\nEU in the future.\nNeeds to generate exports. This project will create stimulus to the important\nagricultural sector.\nGerber - Reasons for closing the deal\nPlatform to sell in France and other Eastern Europe countries.\nFirst mover advantage: Heinz is also looking at opportunities.\nSeems to be a low price ($ 25 million) vs. $ 100 million of investment to build\nplant from scratch.\nAttractive existing market: both Gerber and Alima\nRelated industries are developed: local farmers, similar to Freemont and glass\nproducers.\nPromises from government: tax breaks, profit repatriations and duties.\nAlima's plant is in good shape, reasonable technology and good manager.\nCheap inputs: labour, agricultural products, etc.\nGreat opportunities to improve the operation.\nThe deal increases the speed of Gerber's entry to these markets.\nRisks\nUnstable environment, doubt about market reforms.\nProperty rights: claim to land from previous nationalization waves.\nSustainability of Financial system.\nExpectations of inflation? Social pressures & unrest?\nNo international regime on FDI to resort to in case of problems.\nOpposition to deal from church and workers.\nLogistical problems such as retail channels and distribution.\nEnvironmental hazards."
    },
    {
      "category": "Resource",
      "title": "Liberal Market Economies – The United States",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-224-global-markets-national-politics-and-the-competitive-advantage-of-firms-spring-2003/41ba4aaa169a188b431929b287e66654_analogdevicecasenot.pdf",
      "content": "15.224 Governments, Markets and International Competition\nLiberal Market Economies - The United States\nCase: Analog Devices Inc.\nA study on the problems of the US economy - \"Made in America\" - 1989\nIn the late 1980's the US economy is viewed as weak, with no competitiveness and\nhaving lost its edge over competitors.\n\"Made in America\": bottom up study of problems in US manufacturing industry.\nCommon problems found by study\n1- Outdated strategies\na. Reliance on mass production vs. product differentiation strategy. US\nindustry trying to be price leaders, mostly commodity industries.\n2- Short term horizons\na. Capital Markets force managers to pay attention to short-term earnings\nstrategies.\n3- Technological weakness, specially in Product Development\na. Competing countries speeding up product development cycles by using\nnew organizational structures. Cross functional vs. sequential development\nb. There seemed to be a lot of innovation in the US, but no\ncommercialization\nc. Weak links between technical knowledge and business realization\n4- Neglect for Human Resources\na. Low levels of training. Technological shifts complicated due to lack of\nnecessary skill sets\n5- Failure to cooperate in and between companies\na. Cooperation among companies or industries many times considered illegal\nb. No sharing of standards\nc. Low intra-firm cooperation\n6- Government & Industry working at cross-purposes\na. Court battles\nb. Regulation blocking from businesses\n\n15.224 Governments, Markets and International Competition\nSources of problems\n1- Nature of US government\na. Contrary to general perception of \"laissez-faire\" government, it actually\ncreates a very regulated environment through regulatory agencies, courts\nand state governments, often with contradictory policies\n2- Financial markets\na. Capital markets create wrong incentives\n3- Industrial relations\na. Contrary to general perceptions, unions create significant problems for\nbusinesses. Fragmented unions produce fights with management. US 2nd\nto Italy in days lost due to strikes.\nb. Business Associations: only used to lobby congress rather than to upgrade\nthe industry or agree on standards.\n4- Education / Training\na. Even though the US has incredible educational institutions, the public\neducation system is unequal and highly dependant on income levels.\nFive years after \"Made in America\" the US is now viewed as the \"ideal\" economy with\ngreat strengths. Why?\n1- Wrong analysis:\nStructural problems vs. moment in time\nThe US had advantage of being fast & flexible, with opportunities to\ninnovate but the disadvantage of little coordination which is probably\nbetter for more stable periods\n2- Companies actually learnt from international competition\nAuto industry integrating suppliers into their plants.\nImproved training\nImproved product development\n3- Some minor changes at the institutional level.\nFinancial system changed and became less regulated\nIndustrial relations: change in labor markets at the state level\n\n15.224 Governments, Markets and International Competition\nAnalog Devices\nParadox: the company introduces TQM and sees an increase in productivity, quality and a\ndecrease in defects and lead-time. However, the company goes into economic crisis.\nFactors contributing to firm's distress:\nDid not change accounting: % distribution of costs now shows an increase in\nindirect costs that makes analysts weary of company's strategy. Choices made by\nthe firm reinforced analyst actions due to the incentives of the system\nFall in share price increases chances of take-over bid\nEven though the company strategy was on technological leadership, it focused its\neffort on manufacturing vs. product development\nFocused on short term returns from manufacturing\nGeneral industry recession\nTQM falls from grace due to vicious circle created by employee lay-off\nMismatch between internal and external objectives"
    },
    {
      "category": "Resource",
      "title": "Nike & Corporate Social Responsibility",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-224-global-markets-national-politics-and-the-competitive-advantage-of-firms-spring-2003/9cbc5ef80e504b699851400d0cbd9a09_nikeandcsrcasesnote.pdf",
      "content": "15.224 Governments, Markets and International Competition\nNike & Corporate Social Responsibility\nBasic facts / Problems\n-\nOutsourcing to LDC's\n-\nSavings from not manufacturing poured into marketing / endorsements\n-\nLabor unrest\n-\nLiving Wages? Company Responsibility?\n-\nNGO role in creating media attention against Nike\n-\nChild Labor / Health and safety\n-\nCorruption in outsourced countries\n-\nHuge profit margins can turn against them\n-\nIssue of protectionism for US Labour\nWhat should Nike do?\nNike\n-\nGet more information of situation. Hired external auditor, NGO contested validity\ndue to Nike paying auditors. Language issues / translator undermines credibility\n-\nMinimum wages. Whose minimum wages to apply?\n-\nIndustry competitors\n-\nReality vs. perceptions\nLDC\n-\nEconomic development issues\n-\nPoverty / productivity\n-\nForce a rise in living standards\nNGO / Labor\n-\nGood use of Media\n-\nCoalition of NGO's\n-\nAre they pushing for protectionism?\nSubcontractors\n-\nEstablish standards for their suppliers\nInteractions between MNC and the local economy\nWhy are there differences in different countries when MNC leave? Is what is left\nsustainable? I.e.: Taiwan / Korea\n\n15.224 Governments, Markets and International Competition\nCompetitive analysis\nFive forces\nBuyers\n-\nConsumers participation in improving conditions in LDCs\n-\nSegmented buyers\no high price points surveys show people are willing to pay more\no People do not usually do what they say\nSuppliers\n-\nReally powerful suppliers. One company is producing 40% of worldwide shoes.\n-\nHow can you impose your standards on them? What about the other companies?\n-\nThey can forward integrate, they have the technology\nNew entrants\n-\nCompeting shoes and new companies coming in\nRivalry\n-\nCompetitors are doing the same thing. Low production cost / High marketing\nSubstitutes"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4: Daewoo Case Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-224-global-markets-national-politics-and-the-competitive-advantage-of-firms-spring-2003/24bd78e50c0f478e5d79e5790465adb3_daewoocasenoteslect.pdf",
      "content": "15.224 Governments, Markets and International Competition\nUS Review\nRole of government\nIdeology\nFinancial System\nIndustrial relations\nBusiness organization\nEducation system\nWho drives the system\nStrengths / weaknesses\nKorea\nUS\nIndirect/regulatory\nLaissez-faire\n\nCapital Market based\nFragmented / weak unions\nWeak Business Associations / lobbies\nBi-polar (top univ. vs weak public schools)\nFirms\nFlexibility, entrepreneurs / weak coordination\n(across companies, gov. vs firms)\n-\nGovernment role is impressive. State led developmental model. Similar to\nother Asian countries and also France.\n-\nAfter Korean war GDP was below Brazil, Mexico, India. Incredibly fast\ngrowth after that targeting certain successful industries.\n-\nGood social welfare and educational system.\nHow did Korea do this? Is this model sustainable?\nGovernment role\n1- Plans:\na. 1960's: infrastructure and simple industries: plywood and cotton\nspinning (light industries). Later on garments and shoes.\nb. 1970's: promotion of heavy industry (steel, chemicals, autos)\nc. 1980's: High Tech (ships, electronics)\nd. 1990's: continue in high tech.\n-\nDiscipline: Government played an important role in discipline of the\nworkforce (organized labor) and firms (performance based credit\nassignment, mainly on exports)\n-\nSubsidized credit: borrowed from abroad and used control of financial\nsystem to promote its plans.\n-\nWrong Prices:\n- Protectionism for its market (i.e. steel)\n- Subsidies\n- Import restrictions: not ISI, but as a way to develop\nlocal industries.\n-\nTechnology: used market access to extract licenses from multinationals.\n\n15.224 Governments, Markets and International Competition\n-\nEducation: huge investment in primary / secondary schools. 95%\nenrollment (1994). 20% higher education. Vocational training promoted.\n1980's huge investment in engineering and science. People sent abroad\nand bring back knowledge to Korea.\nOther actors / factors\n-\nChaebols: conglomerates of firms, similar to Japanese model.\nGovernment played role in forming this groups. Strategy: form powerful\ngroups to be able to compete.\n-\nCold war: US played some role in helping this development.\nGiven that this model appeared to work, what happened after July 1997? Was\nthere a collapse? If yes, why did the system collapse? Is it sustainable?\n-\nReform pushed by IMF / Government.\n-\nBankruptcies in different sectors.\n-\nJob guarantee no longer exists.\nDaewoo Case - What happened to this Chaebol?\n-\nHighly leveraged. D/E of four.\n-\nGrowing and grabbing cheap deals in order to increase size and power.\nIncentive of system is for market share.\n-\nDecision to go into auto industry may have been a problem.\nIndustry\n-\nNew entrants: difficult due to size of conglomerates.\n-\nBuyers: recession, devaluation so it is hard to sell. Principal markets are\nother developing countries also in trouble\n-\nSubstitutes: not a problem\n-\nSuppliers: captive\nPorter's Diamond\nIndustry problems exacerbated by national system and set incentives.\n-\nDemand: suppressed at country level. High overcapacity\n-\nFactors: skewed cost of capital in the system. Government intervention.\n-\nRelated industries: no power vs. the Chaebols\n-\nStructure: Chaebol is key to understanding the complicated system. Big\nplayers lock up new markets.\n\n15.224 Governments, Markets and International Competition\nShould the government pull the plug on Daewoo?\n4 I's\n-\nIssue: bankruptcy or nationalization?\n-\nInterest: government, suppliers, financial communities. Which do we take\ninto consideration?\n-\nInstitutions: not only the firm, but relationship with other players and\nactors.\n-\nInform: what information do we want? Going forward, how does it use the\ninformation to show it was a good gamble?\nRole of government\nIdeology\nFinancial System\nIndustrial relations\nBusiness organization\nEducation system\nWho drives the system\nStrengths / weaknesses\nKorea\nDirect / Interventionist\nDevelopmental\n\nCredit based\nDocile at first, now Militant\nStrong Chaebols\nStrong\nFirms\nCoordination / Transparency, flexibility"
    }
  ]
}