{
  "course_name": "Globalization",
  "course_description": "This seminar explores changes in the international economy and their effects on domestic politics, economy, and society. Is globalization really a new phenomenon? Is it irreversible? What are effects on wages and inequality, on social safety nets, on production, and innovation? How does it affect relations between developed countries and developing countries? How globalization affects democracy? These are some of the key issues that will be examined.",
  "topics": [
    "Business",
    "Globalization",
    "Social Science",
    "Economics",
    "International Economics",
    "Political Economy",
    "Sociology",
    "Social Justice",
    "Business",
    "Globalization",
    "Social Science",
    "Economics",
    "International Economics",
    "Political Economy",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nThis seminar explores changes in the international economy and their effects on domestic politics, economy, and society. Some of the key issues that will be explored include:\n\nIs globalization really a new phenomenon?\n\nIs it irreversible?\n\nWhat are effects on wages and inequality, on social safety nets, on production, and innovation?\n\nHow does it affect relations between developed countries and developing countries?\n\nHow does globalization affect democracy?\n\nThe seminar is open to undergraduates and graduate students. Some prior work in political science or economics is strongly recommended. For undergraduates there will be an additional one-section meeting (one hour) to be scheduled at the first meeting of the class. Graduate students will be expected to do most of the recommended as well as the assigned readings. The requirements for undergraduates and graduate students are:\n\nTo complete each week's assigned reading before class;\n\nTwo essays on assigned topics.\n\nThe papers require thinking about issues raised in readings and class discussion. They should be between 12 to 15 typed double-spaced pages. Graduate students who wish to write a major research paper instead of the two essays should meet during the first month of term with Suzanne Berger and discuss an outline of the research.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lecture_1_questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/9b52f14433ee0deef17a2819b53fa9ee_lecture_1_questions.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 1 - September 12\nQuestions for Study\nGeneral\nThis week's authors cover many of the arguments for and against globalization that we\nwill come across in greater detail throughout the semester. After reading them, ask\nyourself:\na. Which arguments do you find most convincing, and why? You may like to\nreconsider your answer to this question again at the end of the semester to see\nif you've changed your opinion.\nb. Are the supporters and critics of globalization always as much in\ndisagreement as they appear? If yes, what are the main points of contention? If\nnot, then what do you think drives their disagreements?\nc. What, of anything, is different about the types of evidence used by supporters\nand critics of globalization? To what degree are the authors' positions on\nglobalization determined by the types of evidence they employ?\nSpecific\nTina Rosenberg, \"The Free Trade Fix\"\n1. Rosenberg argues both that globalization is too open, and also that it is not open\nenough. How does she reconcile these apparently contradictory positions? What do\nyou make of her arguments?\n2. What are the solutions Rosenberg offers for the ills of globalization? To what degree\ndo they address the criticisms she levels? Do you find them realistic?\nThe Economist, \"Globalization and its critics: A Survey of Globalization\"\n1. The Economist survey argues that Import Substituting Industrialization (ISI) policies\nfailed in part because policy implementation led to unexpected and pernicious\noutcomes. How was import substitution supposed to operate? Why is it understood to\nhave failed? Could such policies work if done differently?\n2. The Economist survey refutes critics of globalization who argue it harms state\ncapacity. What are the three main charges made by critics against globalization's\neffect on state capacity? What does The Economist argue in response?\n1Lecture\n\n17.195/196 - Globalization\nFall 2005\nWilliam Greider, One World, Ready or Not, ch.1-2.\n1. What is the main driver of globalization for Greider? Does this capture everything in\nyour opinion? If not, what does Greider miss?\n2. Who are the main actors in Greider's story? Who are the winners and losers in the\n\"One World?\" Why? Do you agree?\n3. Greider offers a grab bag of social consequences inherent in the development of \"One\nWorld\"? Are all of these persuasive? What evidence does he bring to bear to prove\nhis thesis?\n4. Do you think Greider is a supporter or a critic of \"One World\"? Why?\nMartin Wolf, Why Globalization Works, ch.6-8.\n1. Wolf states that the conflict between \"the natural tendency of markets to cross\nborders, and the need for the states that define those borders to support markets is at\nthe heart of all the challenges created by the global economy.\" (p.78-79). What does\nhe mean?\n2. Wolf argues that liberalization is not \"an all or nothing affair.\" (p.80) Do you agree?\nWhich components of the world economy are most liberalized today? Which are not?\n3. What are the advantages of trade, as presented by Wolf? Do you agree that each of\nthese benefits are attributable to trade openness? What other explanations are possible\n(p.81-82)?\n4. On pages 107-108 Wolf shows us the case for a relationship trade and prosperity. Do\nyou find his evidence convincing? If not, why not?\n5. Wolf presents a version of history that groups the anti-globalizers of today with\ncollectivist ideologies of the 19th and 20th centuries, such as nationalism, fascism, and\ncommunism. Is this a reasonable reading of history?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_2_questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/f3735c2e1ac6898c3616af275ae30742_lecture_2_questions.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 2 - September 26\nHow to Read Polanyi's The Great Transformation\nThe readings from Polanyi's The Great Transformation for this week may seen a little\nobscure at first. In chapter three for example, he gives a lengthy history of the \"enclosure\nmovement\" - a transformation of the economic structure of England that occurred around\nfour hundred years ago. In chapter four he then extends his discussion to encompass the\nnature of economic interactions in pre-modern societies.\nIt is important to remember that Polanyi's intention in doing this is not simply to give us\na history lesson. He has a purpose in recounting these histories to us which is highly\nrelevant to our discussions on globalization. Consequently it is not necessary for you to\nremember all the historical details in The Great Transformation, although we hope you\nfind them interesting.\nRather, when reading Polanyi you may find it useful to focus on the following three\nquestions. If you can answer these after reading The Great Transformation, then you\nhave gone a long way towards understanding the book.\n1) Why is Polanyi recounting these histories? What process does he see them as\nexamples of?\n2) What does Polanyi mean when he says that the institution of the market embeds\nsocial relations in the economy? How does this occur? What is the double movement\nthat he sees as the inevitable consequence of this?\n3) What are the major differences between Polanyi's account of the growth of the\nmarket and the \"orthodox\" position given by Martin Wolf? What are the implications\nof these differences?\nFinally, we have prepared quite a number of questions for this week to help guide you\nthrough each chapter. Please don't be too taken aback. Remember that these questions are\nintended only as a reading aid, although you should be prepared to discuss them in\nclass/recitation.\n1LL\n\n17.195/196 - Globalization\nFall 2005\nQuestions for Study\nKarl Polanyi - The Great Transformation, ch.3-6,12,21.\nChapter Three\n1. Polanyi goes into some detail about the enclosure movement, which occurred in\nEngland from the late fifteenth to the mid-seventeenth century. What was the\nenclosure movement? Who precipitated it? Who argued against it? What do you think\nthe relevance of this story is to globalization today?\n2. What drove the emergence of the market system, according to Polanyi?\nChapter Four\n1. Polanyi gives us another history lesson in chapter four. Why? Who is he arguing\nagainst when he says that \"the institution of the market...was no more than incidental\nto economic life?\" (p.45)\n2. If the market was incidental, what was central to economic life for Polanyi for most\nof human history? Why is this difference important to him?\nChapter Five\n1. Why does the market institution mean that \"instead of the economy being embedded in\nsocial relations, social relations are embedded in the economic system?\" (p.60)\n2. Contrast Polanyi's presentation of the spread of markets with the \"orthodox\"\nexplanation he gives us on page 61, or with Wolf. How are they different? Why does it\nmatter?\n3. What social role did towns play, according to Polanyi? (p.65) Why does Polanyi place\nsuch an emphasis on the separation of the internal and external market?\nChapter Six\n1. How did the treatment of land and labor change in moving from the mercantile to the\nmarket economy in the late eighteenth century?\n2. In chapter six Polanyi tells us what The Great Transformation is. What is it? What are\nits implications?\n\n17.195/196 - Globalization\nFall 2005\n3. Why does Polanyi say that the treatment of land and labor as commodities is\nfictitious? (p.76) Do you think he is right?\n4. Polanyi states that \"nothing saved the common people of England from the impact of\nthe Industrial Revolution.\" (p.79) Compare his arguments with those of contemporary\ncritics of globalization. Do you think the Industrial Revolution and Globalization are\nexamples of the same process at work?\n5. What is the \"double movement?\" (p.79)\nChapter 12\n1. What are the three components that make up the doctrine of laissez-faire? When did\nlaissez-faire emerge as an ideology?\n2. What does Polanyi argue is the \"paradox\" of laissez-faire? (p.147)\n3. Why, according to Polanyi, did the move to greater state intervention in national\neconomies occur? What evidence does he use to back his argument?\nChapter 21\n1. What does Polanyi argue is the solution to The Great Transformation? Is it workable\nin your opinion?\nBarry Eichengreen Golden Fetters: The Gold Standard and the Great Depression\n1919-1939, ch.1-3.\n1. What was the Gold Standard? When did it operate? What caused it to fail?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_3_questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/77f1057989f3cca563acdc2b8efc5a1e_lecture_3_questions.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 3 - October 3\nQuestions for Study\nNorman Angell, The Great Illusion, ch.1-4.\n1. Angell challenges the view that the wealth, prosperity, and well-being of a nation\ndepend upon its military power.\" (p98) How does he do this? Are you convinced by\nhis arguments? Why/why not?\n2. Why has conquest become unprofitable in his view? Was it ever profitable? What has\nchanged? What are the costs involved in seizing and holding onto another country?\nCan you think of examples that might support or refute his argument?\n3. How do economic and financial interdependence preserve peace according to Angell?\nWhat do you think of his argument?\n4. In which critical respects [i.e., critical for the argument he is making] was the\neconomic and political world that Angell analyzed the same as ours? In which\nsignificant respects have the international economy or power relations among nations\nchanged?\nPaul Hirst & Grahame Thompson, Globalization in Question, ch.1-2\n1. Hirst and Thompson distinguish between internationalization and globalization. What\nare the differences? Why do these distinctions matter?\n2. What are the some of the economic indicators that can be used to \"measure\"\nglobalization? Do you find some more useful/relevant/informative than others and if\nso, why?\n3. What are the main monetary regimes that have been used to facilitate international\neconomic interactions? What key feature is common to them?\nBarry J. Eichengreen et al, \"Is Globalization Today Really Different that\nGlobalization 100 Years Ago?\" NBER Working Paper #7195, 1999\n1. What conclusions do the authors reach about the levels of globalization in trade and\ncapital today compared to 100 years ago?\n2. What accounts for the differences, if any, between their conclusions and those of Hirst\nand Thompson? Who do you find more convincing? Why?\n1L"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_4_questions_oct_17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/eda9de3e4b8b5aba2f5e3317de901aa2_lecture_4_questions_oct_17.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 4 - October 17\nPeter Gourevitch, Politics in Hard Times, ch. 1-4.\n1. What is the puzzle that Gourevitch is trying to analyze? What is his definition of a\ncrisis? Is globalization a \"crisis\"? Can his analysis be used in our current situation?\n2. Gourevitch outlines five different ideologies that define the legitimate relationship\nbetween the state and the market. What are they? What are the major differences\nbetween them?\n3. Gourevitch contends that: \"Economic conditions rarely operate directly on policy\ndisputes. Other factors mediate them.\" What are these factors? Why do they make it\ndifficult to deduce the positions of groups in society towards protectionism and free\ntrade directly from their economic interests?\n4. Assuming Gourevitch is right, which factors today \"mediate\" the varying responses to\nglobalization? Does Gourevitch offer a useful model in helping us identify the critical\nvariables that explain different political responses to economic pressures today?\nMartin Wolf, Why Globalization Works, ch. 10\n1. Wolf sets about debunking what he argues are nine myths about the negative effects\nof free trade. Which of his arguments do you find convincing, and why? Where do\nyou disagree with him?\n2. Many critics of globalization, including Morris, propose local autonomy as a solution\nto its perceived ills. What are the principle arguments Wolf marshals to rebut such\narguments? Do you agree with them?\n3. Wolf makes some suggestions to reform the World Trade Organization (WTO).\nWhat is the role of the WTO in the globalization process? What recommendations\ndoes Wolf make to reform it? Which criticisms of the WTO does he reject, and why?\nDo you agree with him?\nDavid Morris, \"Free Trade: The Great Destroyer,\" in Jerry Mander and Edward\nGoldsmith, The Case Against The Global Economy, pp. 218-228.\n1. What, according to Morris, is free trade ultimately destroying?\n2. What solutions does Morris offer to the problems he identifies? How might they be\nachieved?\n1LectureLec"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_5_reading_questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/efe12eeba9ed7cbab1f95118e23d5c26_lecture_5_reading_questions.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 5\nSusan Strange, Casino Capitalism Chap 1-2, 6\n1. What are the two requirements, according to Strange, of a functioning monetary\nsystem? What affect does open capital markets have on the relationship between these?\n2. What are the key decisions (or non-decisions) that Strange argues led to instability in\nthe international financial system? Is the analytic lens developed by Gourevitch last\nweek useful for explaining these outcomes? If so, which factors do you think were\nmost important in leading to this outcome? If not, what factors not mentioned by\nGourevitch do you think were important?\n3. How does Strange justify her focus on decision-making in the United States in relation\nto the international financial system? Is this focus justified in your opinion? Is this still\nthe case today?\n4. Writing in 1986, Strange was pessimistic about the prospects of greater international\npolicy coordination or the strengthening of international institutions as viable solutions\nto the problem of international financial volatility. Do you agree with her pessimism?\nWhy/why not?\n\"Fear of Finance,\" The Economist\n1. The Economist suggests that the expansion of international capital flows was largely\ninevitable. What forces/factors were responsible for the growth of these flows? Which\nfactors do you think were especially important and why?\n2. How has the ability of governments to manage national economies been affected by\nincreased capital mobility and the move to a system of floating exchange rates? What\ndevelopments in international finance have influenced the conduct of monetary and\nfiscal policy, and how?\n3. According to the Economist survey (published in 1992), the danger of international\nfinancial instability has grown because of the expansion and increased mobility of\ninternational capital flows. What evidence does it use to prove its case? Have its\nconcerns about instability been substantiated by recent crises in Asia, Russia and Brazil,\nor are these best viewed as incidents unrelated to the relaxation of capital controls?\nMartin Wolf, Globalization in Question, ch.13\n1. Wolf's position on the free movement of capital stands in contrast to his general\nsupport for trade openness. What differences explain his different positions on these\ntwo issues?\n\n17.195/196 - Globalization\nFall 2005\n2. What benefits does Wolf argue nevertheless accrue from open capital markets?\n3. The International Monetary Fund was heavily criticized in the wake of the Asian\nFinancial Crisis of 1997. What were the main charges against it? Do you agree with\nWolf's assessment of these criticisms?\n4. Compare the recommendations made by Strange and Wolf concerning how best to\nregulate international financial flows. Whose arguments do you have greater\nsympathy for? Why?\nJeffry Frieden, \"Invested Interests: The Politics of National Economic Policies in a\nWorld of Global Finance,\" International Organization, vol. 45 (1991), pp. 425-51.\n1. What are the three types of capital flows identified by Frieden? How do they differ\nfrom one another?\n2. Frieden asserts that capital flows affect different types of government policy in\ndifferent ways. Which set of government policies are less affected by the free flow of\ncapital? Which are more affected? Why?\n3. What is the \"specific-factors\" model? What does it predict about the preferences of\ndomestic groups towards policy? What do you think might be missing from this\nmodel?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_6_reading_questions_oct31.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/0ba3ef56c7ad0f34c58efd9e1883853e_lecture_6_reading_questions_oct31.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 6 - October 31\nHerman Daly, \"Free Trade: The Perils of Deregulation,\" in The Case Against the\nGlobal Economy, pp. 229-238\n1. What are the inefficiencies, according to Daly, that are ignored within the system of\nfree trade?\n2. What is the internalization of costs? What is externalization? Why are they important\nto Daly's argument?\n3. Daly proposes an alternative measure of progress, which he calls \"steady-state\"\neconomics. What is this? What problem is it intended to solve? How does it work?\nLori Wallach, Whose Trade Organization? Corporate Governance and the\nErosion of Democracy, ch. 5\n1. Wallach asserts that globalization is causing rising inequality both within and between\ncountries. What evidence does she bring to bear in arguing her case? What problems, I\nany, do you see with her analysis?\n2. What are the causes of rising inequality, according to Wallach?\n3. Wallach gives an example of US action against preferential trade arrangements\nbetween the European Union and banana-producing Caribbean nations. What do you\nthink she trying to show? What implications does her argument have, if any, for the\nidea of free trade in general?\nNY Times, \"Harvesting Poverty\" Editorial series\n1. The NYT argue that developed nations face a \"credibility gap.\" What are they referring\nto? Do you agree?\n2. What are the causes, according to the NYT, of protectionist sentiment in the US,\nEurope and Japan? Do these arguments have merit?\n3. What is the current status of the Doha round of WTO negotiations mentioned in the\nNYT editorial \"The Cancun Failure\"?\n4. What general lessons can be drawn from the series of NYT articles? What measures do\nyou think are available to combat the problems they highlight?\n1L"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_7_reading_questions_nov7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/1e8b6b76c33dea11405773586b1fbf9e_lecture_7_reading_questions_nov7.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 7 - November 7\nHirst & Thompson, Globalization in Question, ch. 3\n1. What are the most important factors, according to Hirst and Thompson, that lead\npatterns of trade and investment to diverge from theories of comparative advantage\nand efficient capital allocation?\n2. What are the major differences between patterns of trade and FDI? What accounts for\nthese differences? What are the consequences, according to Hirst and Thompson?\n3. What factors other than labor costs do Hirst and Thompson suggest affect investment\ndecisions by multi-national corporations (MNCs)? How important do you think these\nare relative to labor costs? What are the implications of their argument?\n4. Hirst and Thompson argue that governments can create endowment advantages (p.62).\nWhat do they mean? What types of endowments do you think governments might be\nbest at creating? What is the significance of this argument in light of the classical\nmodels of free trade we have considered?\nSuzanne Berger, How We Compete, ch. 5, 6, 9, 10\n1. What is modularization? Which processes are more likely to be modularized? How\ndoes modularization influence firm decisions about how they organize themselves?\n2. What policies, according to Berger, are still available to governments in attempting to\nprevent jobs from relocating beyond national boundaries? What other factors\ncontribute to the continuing importance of national borders?\n3. What is the key factor that drives firms to decide to locate production or other\nfacilities internationally? What factors act, on the other hand, to constrain relocation\nand/or reduce the economic benefits of relocation?\n4. Firms in a wide variety of countries and industries are choosing to maintain\nmanufacturing capabilities domestically rather than choosing to outsource. What are\nthe factors that are driving this outcome?\nDavid McKendrick, \"\"Levering Locations\"\n1. Both Berger and McKendrick point to firm clustering as an important dynamic in the\ninternational economy. What are the two types of clusters, according to McKendrick?\nWhat are the implications of clustering for the costs and benefits of firm relocation?\n\n17.195/196 - Globalization\nFall 2005\n2. The US and Japan hard-disk industries followed markedly different patterns in the\n1980s. What explains the divergence between the two? Were both approaches equally\nviable in the long-run? Why/Why not?\nTimothy Sturgeon and Richard Florida, \"Globalization, Deverticalization and\nEmployment in the Motor Vehicle Industry\"\n1. What factors explain the retention of employment levels in US motor vehicle\nmanufacturing? Is this trend sustainable?\n2. What benefits, other than lower labor costs, have accrued to firms that have shifted\nmanufacturing abroad? Are these benefits likely to occur in other industries also? If\nso, which ones?\n3. What new skills have firms in the motor vehicle industry had to develop because of\nthe globalization of production? How are these skills likely to affect their\ncompetitiveness in relation to one another?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_8_reading_questions_nov14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/62895ab25696b1bb3b1e997df486ed90_lecture_8_reading_questions_nov14.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\n\nLecture 8 - November 14\n\nHirst & Thompson, Globalization in Question, ch. 5\n\n1. In Chapter 5, Hirst and Thompson evaluate the prospects for future growth in\ndeveloping countries. What key domestic political, economic, and social/demographic\nrequirements do Hirst and Thompson identify for future growth? Do you agree with\ntheir analysis? Can you think of any other important domestic factors that were not\nidentified by Hirst and Thompson?\n\n2. Hirst and Thompson outline two basic development strategies: 1) a laissez-faire\napproach of openness to international trade and capital flows, advocated by the United\nStates and other developed countries; 2) an interventionist strategy premised on\ngovernment regulation of the interaction between the domestic and international\neconomy, along the lines of Asian NICs (newly industrializing countries). Which\napproach do they support and what arguments do they make to back their position?\nWhat kinds of policies with regard to trade, capital flows, and FDI would Hirst and\nThompson recommend to the governments of developing countries? Which\ndevelopment strategy do you favor and why? Which strategy do you think is more\nfeasible?\n\n3. According to Hirst and Thompson, opponents of globalization tend to overstate the\ndangers associated with multinational corporations relocating their operations to\ndeveloping countries with low wages. Moreover, they suggest that trends in production\ntechnology and practice raise the possibility that MNCs may actually begin to\nreconcentrate their activities in their home country. Are you persuaded by their\nanalysis or do you think they understate the seriousness of the problem?\n\nWorld Bank, The East Asian Miracle, ch. 1-3\n\n1. What are the key characteristics of East Asian growth, according to the World Bank?\nWhat factor(s) does the World Bank argue underlies this remarkable growth? What are\nthe alternative explanations that it partially or wholly rejects?\n\n2. What domestic factors and/or developments at the international level are likely to\ninfluence the extent to which the \"East Asian miracle\" can be reproduced in other parts\nof the world?\n\n3. How important does the World Back argue macroeconomic stability was to growth in\nEast Asia? How does the report define macroeconomic stability? How much credit do\nyou think this should be given, as opposed to export promotion, as a driver of growth?\n\n4. What economic policies did East Asian governments pursue to encourage exports?\nAccording to the World Bank, how did a focus on exports foster economic growth and\n\n17.195/196 - Globalization\nFall 2005\n\ndevelopment in these countries? What similarities existed in the export promotion\nstrategies of the HPAEs? How did approaches differ across countries? Do you think\nexport-led growth remains a viable development/growth strategy as a whole for\ndeveloping countries?\n\nJ. Mathews and Dong Sung Cho, Tiger Technology, pp.29-102\n\n1. What is the authors' explanation for why many Asian economies successfully entered\nthe semiconductor industry in the 1990s? What are the implications of their argument\nfor traditional theories of comparative advantage?\n\n2. Why do they argue Hong Kong did not develop an equivalent industry? Do you find\nthe authors' argument convincing? What other possible explanations are there for this\noutcome?\n\n3. What characteristics of the world economy make it reasonable, according to the\nauthors,' for states to intervene in order to promote particular technologies or\nindustries?\n\n4. What is the difference between the Schumpeterian and neo-classical models of\ncapitalism? Which do you find more convincing as a framework for understanding\nglobalization?\n\n5. Mathews and Cho ask how Korea and Taiwan \"were able to overcome such severe\ndisadvantages in terms of knowledge, technologies and access to advanced markets so\ncompletely and so quickly, in the face of such overwhelming competitive pressures\nfrom incumbent firms?\" What key concept do they use to answer this question, and\nwhat are its components? What factors do you think would help/hinder their\napplication to other developing countries?\n\nJ. Stiglitz and S. Yusuf, Rethinking the East Asian Miracle, ch. 9-11.\n\n1. What factors does Woo-Cumings argue are ignored by the World Bank analysis of the\n\"East Asian Miracle?\" How, does she argue, do these factors have a systematic effect\non growth rates? How do they effect the ability of governments to carry out economic\nreform? Do you find her argument convincing?\n\n2. What are the key characteristics of the Nippo-Reinish model of corporate governance\nthat Woo-Cummings are found in both China and Japan? How does it differ from the\nChinese model? Why does this matter?\n\n3. Lawrence and Weinstein argue that the World Bank ignore the importance of imports\nin driving productivity gains, and therefore growth, in Japan and Korea. How, do they\nargue, do imports improve productivity? What are the implications of their argument\n\n17.195/196 - Globalization\nFall 2005\n\nfor infant industry protection and other forms of government intervention that are\ndesigned to spur growth?\n\n4. What factors does Urata argue contributed to rising FDI and trade levels in East Asia?\nCan these factors be understood through the analytic lens developed by Gourevitch?\n\n5. What effect did rising FDI have on the ways firms organized themselves? What are the\nimplications of this for economic growth in the developed/developing states in the\nregion?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_9_reading_questions_nov21.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/5b18557b73bd16de08bf84a3d71313f1_lecture_9_reading_questions_nov21.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 9 - November 21\nEdward Steinfeld \"Cross-Straits Commercial Integration and Industrial Catch-Up\"\n1. What is the significance of modularization for the form that inter-firm competition\ntakes in mainland China? What strategies are available to firms to attempt to change\nthis outcome? What are its implications for their ability to innovate?\n2. How has the strategy the Chinese government has taken towards economic reform\ninfluenced the way that mainland firms have been incorporated into the global\nproduction system? How (un)successful has the state been in shaping China's\nengagement with the international economy? Why?\nGeorge Schultz, \"Offshoring, Import Competition, and the Jobless Recovery\"\n1. How does Schultz explain America's \"jobless recovery\"? Are the factors he points to\nalso linked somehow to increasing economic openness in trade in goods and services,\nor are the two phenomena unrelated?\nThomas Friedman, \"The World is Flat\"\n1. Friedman argues that we are about to enter an \"era in which technology will truly\ntransform every aspect of business, of government, of society, of life.\" To what degree\nare his claims for the future unique? Are we really seeing something new happening,\nand if so, what makes it different from previous periods of technological change?\n2. Friedman argues that in 30 years China will be competing with the US not only in\nmanufacturing, but also in design and other segments of the value chain. Who do you\nthink is right? Can both authors be right? Which sectors do you think this is more/less\nlikely to occur in?\nSuzanne Berger, How We Compete\n1. Berger argues that it is possible for firms in advanced industrial states (AIS) to succeed\nin industries that theories of comparative advantage suggest should no longer be viable.\nWhat, according to the author, is different about industry structures that enable this to\nhappen? What parts of the value chain are more likely to stay in AISs, and why?\n2. What are legacy resources? Why, according to Berger, are they important?\n\n17.195/196 - Globalization\nFall 2005\n3. What are the risks to firms of outsourcing? What strategies can they employ to\nmitigate these risks?\n4. Berger argues that the world is still rounder than Friedman would have us believe.\nWhat flaws does she find in his argument? Who do you find more convincing, and\nwhy? What advantages, does Berger argue, do firms in AISs retain over their\ncompetitors in developing states, and how durable are these?\nPaul A. Samuelson, \"Where Ricardo and Mill Rebut and Confirm Arguments of\nMainstream Economists Supporting Globalization,\" in Journal of Economic\nPerspectives 18:3 (Summer 2004), pp135-146.\n1. Samuelson argues that the Ricardian model of free trade need not necessarily lead to\nmutual gains for all sides through free trade. How can a negative outcome be obtained\nunder conditions of free trade? How significant are the implications of his argument?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_10_questions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-196-globalization-fall-2005/c726143ee8afbd0410a05c6a1cd4bcb1_lecture_10_questions.pdf",
      "content": "17.195/196 - Globalization\nFall 2005\nLecture 10 - November 21\nMartin Wolf, Why Globalization Works, ch. 9\n1. Wolf argues that countries that have grown economically have chosen economic\nliberalization and global integration. What do you make of his claim that this is the\n\"heart of the matter [and] all else is commentary.\" (p.144)\n2. Wolf argues that it is disingenuous for critics of globalization to focus on inequality,\nand that poverty is a better metric through which to judge its merits. What rationale\ndoes he use to justify this claim? Do you agree that it is not useful to use inequality to\nmake judgments about globalization?\n3. Wolf concludes that a fall in inequality among countries has offset a rise in\ninequality within them (p.151). What is the difference between these two facts? What\nfactors might explain the rise in within-country inequality and simultaneous fall in\nbetween-country inequality? What are the implications for the role of national\ngovernments?\nDani Rodrik, Has Globalization Gone Too Far?\n1. Rodrik argues that continued globalization is dependent on the continued ability of\ngovernments to provide social welfare. What, according to Rodrik, is the effect of\ntrade and capital openness on the capacity of governments to provide these services?\n2. How does increased openness exacerbate social tensions, according to Rodrik?\n3. Compare Rodrik's argument with that of Wolf. How might you use Rodrik to criticize\nWolf's assertion that criticisms of globalization are nothing but \"commentary\"?\n4. What procedural and substantive changes should be made to the WTO, according to\nRodrik? Can you think of other changes in this or other international institutions that\nmight help mitigate the pernicious effects of openness he outlines?\nRobert Wade, Winners and Losers\n1. Arguments on whether inequality within and between countries is rising or falling\nturn largely on measurement issues. What are the main differences in the methods\nused to measure inequality, according to Wade? Which do you think is the most\nuseful approach for measuring inequality, or do you think, like Wolf, that poverty is\nthe most appropriate focus of research?\n\n17.195/196 - Globalization\nFall 2005\n2. Why has inequality widened according to Wade? What are the implications of the\npoints he raises, if any, for the case for continued openness?"
    }
  ]
}