{
  "course_name": "Global Cityscope - Disaster Planning and Post-Disaster Rebuilding and Recovery",
  "course_description": "No description found.",
  "topics": [
    "Energy",
    "Climate",
    "Technology",
    "Engineering",
    "Civil Engineering",
    "Environmental Engineering",
    "Social Science",
    "Urban Studies",
    "Housing Development",
    "Regional Planning",
    "Urban Planning",
    "Energy",
    "Climate",
    "Technology",
    "Engineering",
    "Civil Engineering",
    "Environmental Engineering",
    "Social Science",
    "Urban Studies",
    "Housing Development",
    "Regional Planning",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nMIT students were required to obtain permission from the instructor.\n\nOverview\n\nYear after year we witness earthquakes, floods, tornados, hurricanes, and blizzards. And, these events seem to be happening more frequently. We are aware of slow-cooking human disasters on the horizon such as sea level rise, glacier melting, and extreme weather patterns attributed to climate change.\n\nDisasters can be the result of natural phenomenon (earthquakes, tsunamis, floods, landslides, hurricanes, and other natural events) human error (BP oil spill), disease (Ebola in Africa/Cholera in Haiti) and, more frequently, conflict and terrorism (Boston Marathon Bombing). We can look to the tsunami disasters in Japan and Banda Ache, the 2010 earthquakes in Haiti and Chile, the hurricanes of Katrina and Rita in the US city of New Orleans for examples of disasters that have leveled cities and brought about rethinking and massive replanning efforts. What lessons have we learned about our abilities to pre-plan, respond, and our abilities to offer sustainable, capacity-building approaches? What do we know about response, planning and assessment?\n\nThis class is designed to expose you to the cycles of disasters, the roots of emergency planning in the U.S., how to understand and map vulnerabilities, and expose you to the disaster planning in different contexts, including in developing countries.\n\nThe overall objectives of this class are as follows:\n\nUnderstand the role of the various phases of disaster management and issues concerning planning and policies in these phases.\n\nUnderstand emergency management from a planning and policy perspective.\n\nDelineate the role of the federal, state, and local governments in disaster planning and policies.\n\nExpose the international context, roles, and various responses and responders.\n\nDefine mitigation planning and policy strategies.\n\nExpose students to emergency management and related plans.\n\nUnderstand the factors affecting short and long-term recovery and rebuilding and the role of planners and policy-makers.\n\nUnderstand the factors that give rise to disaster vulnerabilities (e.g., natural, physical, social, economic, policies, and governance.)\n\nUnderstand the factors that give rise to different vulnerabilities and levels of community resilience.\n\nKnowledge and capabilities to assess and manage these vulnerabilities through disaster planning and policy-making.\n\nData, methods, tools, including exposure to GIS techniques that can enhance vulnerability assessments and knowledge building.\n\nCompetencies to use mapping in mitigation planning and response operations.\n\nRequirements\n\nDuring the spring semester, the class will meet twice weekly. The first session of the week is 1-1/2 hours in length and is devoted to reviewing materials either through lecture, audio, or visual media. The second session of the week is also 1-1/2 hours and will sometimes be used for in-class work time, discussion and peer review of work products, and guest speakers. This schedule does not apply to the first two weeks of class, which will be focused on background materials.\n\nThis class includes a Spring Break workshop in Valparaiso, Chile in Week 7. Fieldwork and some class lectures will take place during this trip. A final report deliverable is due one week after the trip.\n\nClass requirements include reading, ongoing assignments related to development of the project, active class participation, blogging, participation in the field trips, and active involvement in the class.\n\nAttendance:\nAttendance is absolutely mandatory. Discussions and targeted presentations will form the heart of the class and determine the direction of exploration for you and the instructors alike. As a project-based course, we will introduce a number of tools that will allow you to explore the city in novel ways. This exploration and the path of the class as a whole will be dependent on your presence and participation.\n\nPeer Review and Feedback:\nIn addition, team members will be asked to provide critical feedback on report drafts, and visual presentations. Much learning happens when we subject our work to review and evaluation by our peers. Many times we cannot see the flaws or problems in our thinking because we are much too close to the material. Peer review and feedback will happen during class time.\n\nReading Assignments:\nAll\nreadings\nwill be posted on the class website. It is essential that all reading be completed by the due date and comments, questions and thoughts be offered in class. For this reason, readings have been kept to a minimum so that students can review and digest material prior to class. Pop quizzes help ensure that students stay current with the material offered in the class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation/Attendance\n\n15%\n\nDisaster Mitigation Plan Memo (draft and revision)\n\n15%\n\nField Travel, Research and Report (draft and revision)\n\n15%\n\nResearch Blog\n\n20%\n\nPosters/Presentations (draft and revision)\n\n15%\n\nQuizzes\n\n10%\n\nFinal Report\n\n10%\n\nFinal grades are based on a weighted average for the term. Grade cutoff points are as follows: A = 93-100% B+ = 87-89% C+ = 77-79% D+ = 67-69% A- = 90-92% B = 83-86% C = 73-76% D = 63-66% B- = 80-82% C- = 70-72% D- = 60-62% F = <60",
  "files": [
    {
      "category": "Resource",
      "title": "MIT11_027JS17_Memo_Writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-027-global-cityscope-disaster-planning-and-post-disaster-rebuilding-and-recovery-spring-2017/63c8908d98c315fd5d2e3391561e2e97_MIT11_027JS17_Memo_Writing.pdf",
      "content": "W.?.\n( G ) (40) 211.\nat?? Aumst , 19 40\nTo do curn bark, we el have t o =ci\na mss cf pzpers. Nezly\nof\ntk~\nP- 5 s ~ C O\n1w.g. Tnis wastes t*,\n.file =erg-y\n;TS\nTo 'h %at Li b k -\ni?g fLm t3e essential wL?ts.\n- -\nI ask .my C Q ~ ~ ~ ~ , C I I ~ S\nt?ein stzZis t c see t o it f*zt ~ ? e i n 3e-s\nzrz- shcrtsr.\n(1) 3.e ;.ln s h l c 'be R e m s whi& s2t cut 'ke\nF&-\n@zts in a sezziss\nof sh& , cis? r z n ~ r a p h s .\n(2) If a R e m ro,li=s cr! c e t z i i d a y s i s of m ccnplic=ted fact-,\nc r cr! stztistics, t5ese shoud be set cut irl zn Ap~e~:&.x.\n-\ni i e r m , hut ti. .~icIe-zemLz ccnsisting of 'nez&gs\nonly, whiL~\nczr! bs e-..deci,\no r c l y ir' need&.\n:\n4)\nLet u ' k v e zr. ~,-.d of SICT pPmases as fwse:\n11 T i -\n-,\n1s also of + m a c e\nt o be=\n*.e\n~e follming mnslcea-\nt i c r s . . . . . .\nl1 m \"Corsi6eraticn s W d 'ce g55veq t a 'he\npss%i'Lty\n?\n- -\n. of c z ~ k g\n=to errect.. . . . .\". &st of these - m l l y p h s e s zzz\nm~\nwi-ic? rpn ke lc-t cut d.tcget?m, or z z p h e d by a\nsingle -.\nkt G not s'mink Ah\nu~k3\ntke shcrt T s s i v e\n. -\n?brzs2, even 1z it is csnve?rsztim~l.\nTi?ms -3\nUU cn f?e l L ~ e s I F c p S e fray a t\n=I- b;itl? the flat S-T-ZE\nc f 0fficl;llese j q o n .\n~511\nbe v z t , while t5e Ciscipliie of s e ~ i n g\nout\n~511\nprove an aid to clep-r tininking.\n?:st seal rcujlzs cn-\nEut\nsaving in t b\n5- FA WLYKS m c i s e l y W.S.C.\nSiP-3\n(c) Source unknown. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nOld Owl Consulting\nSpecialists in TQlld (Total wty Memos)\n- 1\nRobert D. Behn, Head Owl\nTO:\nColleagues and Friends\nBox 90246, ~urham,\nNC 27708-0246\nFROM:\nBob Behn\n9 19-684-4477\nF\nm\n\n9 19-68 1-8288\n-\nRE:\nThe Art of the Memo\nDATE:\nThursday, December 2, 1993\nA memo communicates ideas. But it does this not only through its words and sentences.\nA memo also communicates ideas through its headings and layout. A reader should understand\nthe message of a one-page (or ten-page) memo not only after a thorough reading, but also at a\nglance.\nI.\nHeadings Can Convey A Lot of Information\nHeadings accomplish three important purposes:\n(1)\nHeadings force you to organize your memo. You can't produce intelligent and useful\nheadings unless you have thought through both your message and how you will\ncommunicate it.\n(2)\nHeadings convey your organization to the reader. Like the chapter titles in a book, the\nheadings in a memo tell the reader what information to expect when.\n(3)\nHeadings can also convey your message themselves. Well organized and well designed\nheadings can quickly give your reader the basics of your message.\n11.\nThe Layout Can Make the Message Easy to Understand\nThe esthetics of a memo contribute to its message. Indeed, a memo's layout can make\npeople want to read it. So, design a layout to convince potential readers that you have an\nimportant message that they can easily understand by quickly reading your memo.\nConsequently, don't make your readers go searching through your trees to find your\nforest. Don't clutter up your memo with italics, boldface, underlining, double underlining, or\nCAPITAL LETTERS. Use such devices sparingly to highlight the core of your message, not\nto obscure it.\nIII.\n\"Message: I Care!\"\nIf you have an important message -- if you have a message that warrants spending the\ntime to write it out carefully and clearly -- then you also ought to spend enough time to ensure\nthat the page on which that message appears contribute to the communication of the message.\nA well-written, well-organized, well-laid-out memo tells the reader that you have a message that\nis so important that it was worth your valuable time to present it clearly.\nWise\n(c) Bob Behn. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMassachusetts Institute of Technology\nGuidelines for Effective Informational Memos\nWriting clear, informative memos is a critical to your career whether you are a policy maker, engineer, architect,\nconsultant, or activist. Informative memos help lay the ground work for critical decisions that you and others will be\nmaking. Informative memos are not decision memos; they do not recommend a course of action. Instead,\ninformative memos are directed to a decision maker and seek to:\n-\nhighlight options\n-\ncompare alternatives\n-\nprovide analysis\nAs such your ability to covey complex information simply is key. Also important is your forethought about the\nconcerns of the decision maker and deciding how to address each concern.\nOf course no writing is unbiased and while you will likely have an opinion about the best course of action, save\nthese strong opinions for later. Instead, challenge yourself to carefully lay out each critical issue, idea or plan and\nanalyze these using a carefully chosen structure (e.g., pros/cons, long term/short term). Think of an informational\nmemo as a document that sets the stage, frames the issues, and provides the detailed analysis that feeds into the\nlarger decision. When you what know your decision maker expects (audience) and you give her what she needs\nclearly and concisely (meeting expectations), you become part of the decision making team.\nOkay, so here's the strategy:\n1. Include a Summary Paragraph:\nSimilar to an action memo, here you need to summarize the contents of the memo. However, your decision maker\ndoesn't want an action plan. She will create that (or have you create it later). Instead:\n-\nState the issue (1 sentence)\n-\nSummarize the analysis briefly (1-3 sentences)\n-\nOutline the options (1-3 sentences)\n2. Focus on the content of the memo:\nThe body of the memo is where the analysis goes. Here you want to explicitly tell the decision maker that she will\nneed to make a decision about the issues that you will present one by one. For each issue you need to:\n-\nName and explain briefly each issue - most important issue goes first\n-\nProvide the analysis at a level expected by the reader (don't include raw data, if she wants to focus on\ntrends)\n-\nDiscuss options\n-\nUse a sub heading to divide issues\n3. Craft the Conclusion\nInformational memos have conclusions that state what the next steps are, but don't draw conclusions or recommend\nany specific action. It is not about providing a distinct answer to a question but providing a variety of well-analyzed\noptions.\nCherie Miot Abbanat, Lecturer\nDepartment of Urban Studies and Planning\n\nMassachusetts Institute of Technology\n4. Don't under estimate the power of tone in writing\nGet in the habit of thinking about who you are writing to and where the memo might end up (the press, a higher up,\netc.) Everything you write these days and send electronically (even e-mail) should be carefully crafted, edited and\nthen scanned for problems. Informative memos have a distinctively neutral tone. They don't seek to sell and idea,\nalthough your choices about what to present and how will often persuade a decision maker. In general tone should\nbe:\n-\nDiplomatic\n-\nAcknowledge problem areas\n-\nAdvance options without arguing with existing policies\n-\nTactful, not patronizing or insistent\nPracticing more than one style of memo writing will help you fine tune and develop your individual style.\nCherie Miot Abbanat, Lecturer\nDepartment of Urban Studies and Planning\n\nCHECKLIST FOR WRITING ACTION\nMEMORANDA\nStructure\n-\nDirectly address your reader's needs in the opening lines.\n-\nCover background in just a few words and then go quickly into\na summary of your recommendations.\n-\nBreak down your discussion into meaningful sections in a\nsignificant order, reflect that order very briefly in your opening\nparagraph, and then stick to it.\n- Use subheads to summarize key points, like headlines, for easy\nskimming (in boldface or underlined .\n-\nState the main idea of each paragraph within the first two\nsentences.\n-\nThe rest of the paragraph supports or qualifies the main idea with\nconcrete data.\n-\nDistill and group information into bullet points with appropriate\nheadings.\n-\nIf using a conclusion, frame your recommendations in a broader\ncontext, rather than merely summarizing your main ideas.\nContent\n- Anticipate your reader's most pressing needs and focus on what\nyou know and she or he doesn't.\n- Specify your assumptions and justify them when necessary.\n- Keep discussions of problems and their potential solutions close\ntogether and indicated as such.\n- Find creative, meaningful ways to express key statistics.\n- Evaluate your options by balancing out their costs and benefits.\n- Briefly discuss alternatives or counterarguments whenever feasible.\n- Balance recommendations with discussions of their evaluation and\nimplementation\nCourtesy of Xavier de Souza Briggs. Used with permission.\nPage 1 of 2\n\n-\nConsider the political implications of your recommendations\nwhenever relevant.\n-\nWhenever possible provide your reader with fallback positions in\ncase your preferred options are not attainable.\n- Make sure issues of equal importance take up equivalent space: the\nmore important, the more space, and vice versa.\n-\nConsider closing with a discussion of \"next steps\"-\nshort- and long-term implementation.\nAudience\n-\nGive your reader a clear answer to his or her paramount concern:\n\"Why am I reading this?\n-\nRecognize your intended reader's degree of prior knowledge:\ntry not to over- or under-explain.\n-\nAnticipate your reader's probable questions, concerns, and\nobjections and answer them directly.\n-\nChoose your words carefully: your memo may be forwarded to\nsecondary readers.\nStyle\n-\nAvoid such wordy introductions as \"It is an important\nconsideration to keep in mind that....\" Instead, you just get right\ndown to the point.\n-\nNever use two words when one will do.\n-\nUse the active voice whenever possible.\n-\nUse parallelism in all types of lists.\n-\nChoose the plain English word over its more inflated Latinate\nequivalent.\n-\nMatch vocabulary, word choice, and use of jargon to your reader's\nbackground and level of expertise.\nCourtesy of Xavier de Souza Briggs. Used with permission.\nPage 2 of 2\n\n\"ihe lat:.e Commerce Secret:.arv :talcolm Baldridge issu ed t:.l1is direct:.ive t:.o his staff\nin December 1984.\nWe repr@duce it here by permission and invite your reactions.\nS!CR!TARY'S w1l.ITING STYLE**\nClarity aod brevity are key factors wben preparing correspoodenc f6r the\nSecretary\nshort words,\neffective\no·r Deputy Secretary.\nThe Secretary\nwith emphasis oo plain English.\nexpression requires.\nwants\nUse oo\nsb.ort\nmore\nsente!lces and\nwords than\noe Answer questions specifically.e\noe--The response should be no more than one p31e, where possible.e\nw'ben answering a series of quƁstions, prepare a brief covere\nletter and atch question and answer page (or pazes).\noe--If the response is negative, be polite, not 3brƂpt.e\noe--Avoid wordiness. Xeep sentencs lƃan 2nd lhort.e\noe--Use t!le active rather than tb.e pasƄive voice.e\noe--Use no unnecessary adjectives or adverbs. ƅrite witƆ nouns ande\nverbs to strengthen letter.e\noe--Do not wae nouns or adjectives as verbs, Ƈuch as:e\nto i.:pact\nto interface\nit obsoletes\noe-- Use the precise word or phrase.e\ndatum (singular) - data (plural)e--\ncriterion (singular) - criteria (plural)e--\nsubsequent means after, not beforee--\ndifferent from, not differ'ent thane--\ninsure means to guarantee agai:LSt financial losƈ.e--\nensure means to m.aƉe sure or certain.\n(Although insure and Ɗsuree--\nshare the sƋe meaning, this usage is preferred.)\naffect means to influe?ice; to act upon; to alter; to ƌs3ume; to adopt\ntllinx is mental; feel is physical or e!:!Otional (thizix thouƍhtƎ;\nfeel feelings)\noe--?lease stop using affected or imprecise words. Some ƏƐles:e\naltƑ:natives (use choices)\nOUt?U:.\ndelighted (use pleased or happy)\noverviev\ndialogue\nparametƓr (use boundary\ndfect.u.ated\nor limit\nenhance\n1el:-initi.1tƔ\nfacilitate\nspecificity\nglad (use pleased or happy)\nt3.rget or r;ƕtƖd\nhereinafter\nthrust\nhopefully (use I hope)\nunique\nimage\nviable\ninput\nongoing (prefer continuing)\noriƒ!lt\nThis content is in the public domain.\n\nSTYLE\no Please stop using ALL \"ire\" words.\nSome examples:\nfinalize\np r i o r i t i z e\nmaximize\nu t i l i z e (prefer use)\nminimize\nutilization\noptimize\no\nPlease stop using the following phrases:\na s you bow, as I am sure you LOW,\na s you a r t avart\na t the present time (use a t t h i s t h e )\nbottom l i n e\ncontingent w o n\ndue t o (use because)\nI am dee?ly concerned\nI appreciate your concern (or i n t e r e s t or views)\nI believe, we believe (unless speculating on future action)\nI regret I cannot be more responsive (or encouraging)\nI share your concern (or i n t e r e s t o r views)\nI understand (unless speculating on furore action)\nI would hope (use I hope)\ni n esseace, the esaencr\nin terps of\nit is my intention\nmore importantly (use more isportant)\noutually beneficial\nneedless t o say\npoint i n time\npositive f etdback\np r i o r t o (use befort)\nsubject matter\nthank you f o r your l e t t e r erprrssing concern (use T h a d you\nf o r your l e t t e r rtgarding ... )\ntime frame\nsubject P a t t e r\no\nAvoid\nclosing the l e t t e r too a b r q t l y .\n(Than4 t3e writer f o r h i s o r her-\ni n t e r e s t or support.)\none-sentence paragraphs in body of the l e t t e r .\nover-quoting Writer's letter.\no\nEliminate gender-specific language vheoever possible.\nworker (instead of workman)\nchairperson (ins:ead\nof chairsan)\nreporter o r newscsstcr (instead of newsman)\nofficer (instead of policman)\nastronaut\n(instead of spaceman)\nmail c a r r i e r (instead of posman)\ncomitteeperson (instead of cormnitteeman)\nThis content is in the public domain.\n\nWRITING STPLE\no Avoid redundancies, such as\nenclosed herewith\nend result\nfuture plans\nhportant essentials\nnew initiatives\npersonally reviewed\nserious c r i s i s\no\nAvoid s p l i t infinitives (placing an adverb between t o and the verb)\nunless a s o l i t infinitive sates the sentcncr less rwkvard.\no Do not use addressee's f i r s t name i n the body of the l e t t e r .\no Do not refer t o the data of the hczming leffer.\no Stop apologizing, such as:\nI regret the delay in responding t o you.\no Do not close a l e t t e r w i t h *e\nfolloving'phrases:\nPlease l e t me know i f I can be of further assistance.\nI hope this inforsation i s helpful.\no Annual Se?orts t o Congress (transmittal l e t t r z )\nUse:\nI am pleased t o submit\no Closing the l e t t e r\nDo not use:\nW i t h best wishes,\nThe following quote from The Eleaents of Stvle by St,&\nand %it=\nreflects the Secretary's style:\nYiporous writing is caneire.\nA sentence should contain no\nunnecrssary words, a paragraph no unnecessary sentences, for the\nsame reason that r drawing should have no unnecrssa=y lines and\na =chine no unnecessary parts.\nThis requires not t h a t the\nwriter make a11 his sentences short, o r that he avoid a l l detail\nand t r e a t his subjects only in outline, but that every word tcll.\"\nSecrttary Baldrige says, \"In short, halfway bet-detn Ernest Hesinpay\nand Zane Grey with no\nWRITING STPLE\no Avoid redundancies, such as\nenclosed herewith\nend result\nfuture plans\nhportant essentials\nnew initiatives\npersonally reviewed\nserious c r i s i s\no\nAvoid s p l i t infinitives (placing an adverb between t o and the verb)\nunless a s o l i t infinitive sates the sentcncr less rwkvard.\no Do not use addressee's f i r s t name i n the body of the l e t t e r .\no Do not refer t o the data of the hczming leffer.\no Stop apologizing, such as:\nI regret the delay in responding t o you.\no Do not close a l e t t e r w i t h *e\nfolloving'phrases:\nPlease l e t me know i f I can be of further assistance.\nI hope this inforsation i s helpful.\no Annual Se?orts t o Congress (transmittal l e t t r z )\nUse:\nI am pleased t o submit\no Closing the l e t t e r\nDo not use:\nW i t h best wishes,\nThe following quote from The Eleaents of Stvle by St,&\nand %it=\nreflects the Secretary's style:\nYiporous writing is caneire.\nA sentence should contain no\nunnecrssary words, a paragraph no unnecessary sentences, for the\nsame reason that r drawing should have no unnecrssa=y lines and\na =chine no unnecessary parts.\nThis requires not t h a t the\nwriter make a11 his sentences short, o r that he avoid a l l detail\nand t r e a t his subjects only in outline, but that every word tcll.\"\nSecrttary Baldrige says, \"In short, halfway bet-detn Ernest Hesinpay\nand Zane Grey with no burcaucratese.\"\nThis content is in the public domain.\n\nFOR SENATOR KENNEDY\nDecember 15, 1960\nFROM :\nRICHARD E. NEUSTADT\nSUBJECT: REORGANIZATION POWERS\nAs you know, the Reorganization Act of 1949, as amended, expired without\nextension on June 1, 1959. A number of reorganization actions which you may\nwish to take early in your term could be advantageously handled by\nReorganization Plans, in lieu of legislation, if reorganization powers were\navailable to the President.\nSenator Jackson has told me of your agreement that he should negotiate\nwith Senators Humphrey and McClennan to jointly sponsor a renewal of the Act\n.\nfor introduction in bill form immediately after Congress convenes. This would\nbe a matter of their initiative and they would arrange for simultaneous\nintroduction in the House.\nThe vision of a McClennan-Dawson Bill delights me!\nWhile you would not have to make a formal recommendation on this matter\nwhen the Bill was introduced - - since you would not be President -- prospects\nfor quick action require, first, that your preferences be knovn to the\nsponsors, and second, that the Congressional leaders know you would appreciate\nfast action.\nThe second point can be left for later discussion. What concerns me now\nis the first point: your preferences for the content of a \"McClennan-Jackson-\nHum~hrey-Dawson\nBill\" to be negotiated, in the first instance, by Senator\nJackson's office.\nIn establishing your preferences, there are five things to be decided:\nI. Duration. McClennan's view has been that one Congress should not\ncommit the next. Despita this, I think it would be well if you encouraged\nJackson to try for \"the duration of the President's term\"; that is to say,\nfour years. One can bargain down from this.\n2. Coverage. The Act, as last amended before its expiration, had no\nsignificant exclusions except: (1) that Departments could not be abolished by\nReorganization Plan and (2) that\nnon-civil serrice posts established\nthrough a Plan were subject to Senate confirmation. There is no need to\nquarrel with the first of these limitations. It would be nice, however, to\nget rid of the requirement for confirmation in the case of all appointive\nofficials. So long as this requirement remains in the Act, complicated\ngimmicks are necessary to get subordinate bureau chiefs, special assistants to\nSecretaries, et al., out from under confirmation.\nThe confirmation provision could be dropped more easily by the House\nthan by the Senate, but it seems to me wor~hwhile for Senator Jackson to have\na try at it.\nB-1\nThis content is in the public domain.\n\nb.\nConeressionaln the original Roosevelt\nReorganization Act, a Congressional veto of Reorganization Plan required a\njoint resolution of both Houses (but in return for this, number of agencies\nwere excluded from reorganization). In the 1949 Act, as amended, most\nexclusions were dropped and a one-House veto substituted, with'the requirement\nthat disapproval be by \"constitutional\" majority. In the 1957 Amendment of\nthe Act, the one-House veto came to be a matter of simple majority. This\noccurred when you were Subcommittee Chairman, and I hope I do not bore you\nwith details.\nFrom your poine of view as President, it would be nice to get back to'\nthe constitutional majority provision while returning veto by one House. I\nsee no point in trying to go farther than that. But I expect it would be\nworthwhile for Jackson to seek that much. Agaic, this leaves some room for\nbargaining.\n4. Authorizinn new a~encies\nto use other aeenctes . The Budget Bureau\nstaff favors a technical amendment which would specifically perinit a new\nagency created by Reorganization Plan to utilize the services of other\nagencies in carrying out its functions. This amendment is desirable, though\nnot urgent. I would not recommend that Jackson's staff, or anybody else,\nfight to the death for it. But it might prove useful in the case of a\nDeparunent of Urban Affairs, if this went the reorganization route. So I\nthink Jackson should seek it in the first instance.\n5, SDecialpowers.\nThe Budget\nBureau has long favored soecial reorganization power regarding the Executive\nOffice of the President. The idea is to give you freedom to shift titles,\nfunction, staffs, as suits your convenience, without further reference to\nCongress.\nAn attempt to tack this special power onto the Reorganization Act\nprobably would slow the progress of the new bill. But Senator Jackson could\ntake soundings on this if you wished. Alternatively, he could take a flier at\na separate bill to be introduced by the same sponsors at the same time.\nFinally, he could do nothing about it at all. On balance, I suggest doing\nnothing. The special power would be nice, but you can manage without it.\nIt is quite likely that Congressional consideration of reneved\nreorganization powers before Inaugural will involve two kinds of bargaining\nor, more precisely, of efforts to draw you into bargaining.\na. With regard to reorganizations that you have in mind, or\nwhich you are thought to have in mind for Defense, M A .\nState, etc., etc.\nb . With regard to your position on rules changes in the two\nHouses, on the timing of Civil Rights legislation, and on\nthe timing of Executive actions in the sphere of Civil Rights.\nFor example, I hear rumblings from a source associated with Senator Kerr\nthat \"responsible\" Senators arc concerned about a Deparisent of Urban Affairs.\nThis content is in the public domain.\n\nb\nI take it for granted that this expression of concern has something to do with\nother concerns. If the Reorganization Bill is to be introduced on January 3,\nit may be necessary, soon, to formulate the limits of your interest in the\nBill's progress as it relates to these other matters.\nAdministration sources have informed me that President Eisenhower might\nbe happy to recommend a renewal of reorganization powers before he leaves\noffice. This seems to me a useful thing for him to do provided it is not done\non vour solicitation. However, it is to be hoped zhat any spontaneous\ninitiative by the President would be supportive of a prior action on the part\nof Democratic Senators and Congressmen. I doubt that it would improve Senat0.r\nJackson's negotiating position if those wich whom he had to deal were asked,'\nin effect, to carry out Eisenhower's recommendation.\nPerhaps Elmer Staats could keep track of this matter, with reference to\nyour interests as well as to Eisenhower's.\nOnce I know your preferencas on the points outlined above, Senator\nJackson's staff can begin negotiations with the other Senators and\nCongressmen. R.E.B.\nThis content is in the public domain.\n\nSecreta-y of the I n t e r i o r Rogers C.B.\nMorton\nTHROUGH:\nUnder Secretary John Whitaker\nFROM:\nA s s t . S e c r e ' q ,\nProgram Development and Budget\nLaurence E. Lynn Jr.\n:\nBonneville U n i t , Central Utah Project\nDATE: October 19, 1973\nRecornendation\nAfter analyzing t h e Bomeville unit and e x m i n g the W e d i a t e gzcssal\nt o award a contract f o r c s n ~ ~ ~ ~ c t i o n\nof cursant C-eek Dam, I recsrmnend t h a t\n-*\nyon e l e c t t o refo-mulate the aonneville U n i t .\nS..- ,....\n2-7 of Analysis\nMost of t h e problens witlh the cantinuation of t h e 3onneville Unit st=\n:---\n-&\n--,...\n,,e\nZiversion of Uinta Sasin water t o Lle 3cnneville Sasin: high q ~ a l i t y\n-. .\n:rsneries wocll be dmagec',; proSlmms of re?lacing t h e deferre2 Indian water\nhave c c t Seen faced, and n ~ j c r\ne n e r w developnent g c s s i b i l i t i e s such as o i l\nshzle, o i l f i e l d develosaezt and refiainq, an8 the--1\n_power would be forgone.\n!\nCr. the other har.2, increnental su??lies of X&I water can be developed i n %le\n-\nsczneville 3zsin Sy feztures of the Bonneville Unit and other alte-qatives\nt o nee:\nt h e needs of S a l t Lake C c u t y u n t i l well i n t o t h e next centuzz.\n7 - 7 -\n,..-the-mcre,\ni t is ocr understan2ing t h a t w e can even meet ouz s h o 2 tern\nc=::z.iL~ezts t o provide M L I water, because t h e e x i s t i n g p r . i o n s of t l e\nStrawberry Aque2uct a r e yiel&ng about 4,000 a.5. -per year, vhich is befr,g\nstore& i n Stzawberry Reservoir.\nConclusion\nI n the f u t u e , w e should place ouz emphasis on t,?e orderly deve1o:aent\nof K c 1 water f o r S a l t Lake Caunty, developing a fi-a plan f o r proviZing\nwater t o t h e Ute 1n2iar.sr a?d ensuing v a t e r a v a i l b i l i t y f o r enerw\ndevelceaen: in the Uinta 3asin.\nB-2\nThis content is in the public domain.\n\nUHITE HOUSE\nMemorandum From the President\nAugust 2, 1979\nFor the Director, National Science Foundation\nIn my Environmental Message of August 2, 1979, I expressed concern about\nthe rapid disappearance of the earth's forest, especially in the tropics and\nsub-tropics. I believe there is much that the United Srates can do in\ncooperation with other nations to contribute to envlrormentally sound care and\nmanagement of the earth's foresz and to the well-being or' people affected by\nthem.\nI am therefore requesting that you give high priority in your budget and\nprogram planning and research support programs to foreszs and to the following\nareas of basic and applied research:\nresearch on the ecology of rropical forests;\n. improved monitoring of world forest trends, parzicularly\ntropical forests, including use of satellite obsezvations ;\n. research on necessary preservation of natural forest: ecosystems\nand their rich complex of plant and animal life;\n. research on multiple uses of highly diverse tropical forests,\nincluding management of natural stands, development of\necologically sound forest plantations, and combined agriculture\nand forestry;\n. studies on increasing yields in family-scale tropical agriculture,\nto relieve pressures on forest lands that are not suitable for\ncultivation;\n. identification of research methods to define the ecological\ndisturbance in tropical forests from human activities, and to\npredict recovery of stressed forest systems.\nPlease give this assignment your immediate attention.\nJimmy Carter\nB-3\nThis content is in the public domain.\n\nADMI'NISTRBTrvE OFFICE OF THE\nUNITED STATES COURTS\nWashington, D.C. 20544\nChief of the\n.\n-\nJ\nDivision of\n)\nProbation\nDepuc. Director\nAugusr 11, 1987\nMMORANDUH TO ALL CaIEF PROBATION AXD CXXZF PRETRIAL SERVICES OFFICERS\nSUBJECT:. Ifurnan Immunodeficiency Virus\nThis memorandum addresses issues concerning the supervision of persons on\nprobation, parole, or charged with offenses who have been infected with human\nimmunodeficiency virus (HIV) which causes acquired immune deficiency syndrome\n(AIDS).\nAs a result of the recent policy of the Federal Bureau of Prisons to\ntest inmates for HIV prior to release, there will be an increase in the number\nof persons under parole supervision vno are hown to have been infected with\nHIV. Some of these persons may develop AIDS during supervision.\nHIV and AIDS are essentially public health issues. We should, however,\ndevelop linkage between our serrice and public health systems to ahquataly\naddress any responsibilities we may have to persons under supervision and the\ncommunity. We recommend you contact state or local health departments to\nascertain the availability of programs for the treatment and counseling of\npersons who test positive for HIV or have developed AIDS. Please familiarize\nyourselves with state public health laws. There may be other community\norganizations and networks which offer services specifically to persons with\nAIDS or AIDS-related conditions. Referrals to drug treatment programs for\ndrug dependent offenders should also be given a high priority.\nIt is important to make certain officers are educated concerning HIV and AIDS\nso that they may provide information on AIDS prevention to persons under\nsupervision. Education on preventing exposure to or transmission of the virus\nis strongly advised for clients who are homosexual or bisexual, or who have\nbeen involved vith intravenous drug abuse or prostitution. Persons released\nfrom confinement who have been identified as positive for HIV or as having\nAIDS should be evaluated immediately upon release to determine their\ntreatment, education, and counseling needs. Unless prohibited by state or\nlocal law, officers should make referrals to public health care systens or\nother conmunity organizations. Such referrals are particularly wrtant if\nthe client presents a risk of transmission of the virus to others in the\ncommunity. Local and state public health agencies may be able to pro*&\ncounseling and, in some jurisdictions, tracing of prior sexual and intravenous\ndrug contacts, in addition to making appropriate third party warnings.\nThe Probation Division has provided a variety of AIDS information in section\n\"Gn of the training binder from the National Conference for Chief and Deputy\nChief U.S. Probation and Pretrial Services Officers. A recent publication by\nthe National Institute of Justice entitled \"The cause, transmission, and\nincidence of AIDSn is attached to this memorandum. ~dditional infomation\nfrom the National Institute of Justice and other sources will be provided as\nB-4\nThis content is in the public domain.\n\n-\n.> .\nit becomes available.\nThe U.S. Parole Commission w i l l be requesting public\ncomment on conditions of parole for persons who t e s t positive f o r HIV, and\n-\ndisclosure of blood t e s t results and foreseeable r i s k t o t h i r d p a r t i e s .\nFurther a c t i o n is contemplated a t the Commission's October meeting.\nThe\nOffice of General Counsel plans to provide more i n f o m a t i o n relacing t o\ndisclosure and t h i r d party r i s k for persons on probation o r b a i l supervision.\nQuestions r e l a t i n g t o HITI and AIDS may be directed to Probation Programs\nSpecialist\na t tTS\nThis content is in the public domain.\n\nwNrvERSITY'\nJOHN F. KEiiEDY SCHOOL OF GOTERNMEiiT\nM A R K k R K m M A N\nAssociate Professor of Public Policy\nTO:\nMr. JOS; Cerda\nDomestic Policy Staff\nFROM: Hk Mark Kleiman\nSUBT:\nReorganizing Drug Law Enforcement\nDATE:\nSeptember 15, 1993\nMerging the DEA into the FBI, if it could be implemented s u c c ~ y ,\nwould have\n- -\nsome long-te,m benefits, especially in the redution of d m c t i v e competition and the\nstrengthening of the Department's position vis-a-vis other ageacies, especially the Customs\nService.\nBut the dmost certain immediate results would be reduced productivity and\nmanagement control within the entire merged entiq. Managing the merger would be an\nalmost bottomless sink into which the new Director's time and energy would flow, Iimikg\nhis ability to navigate the Bureau through its post-Cold War transition. If the period of\ndisor,pization and d i m d o n were as short as three years, that would count as a\nconsiderable managerid achievemeat.\nMoreover, even in the long mu, some of the resultx of a merger would be\nundesirable. Drug enforcement needs to reflect the logic of the drug markets, which dictates\nthat new suppliers will appear to fill the market niches left by enforcement actions against\nexisting suppliers. The strategy of catching as many of the worst bad guys as possible, which\nis a sensible strategy for non-tmsctional, \"predatory\" crimes such as bank robbery and auto\ntheft, and which is at the heart of the FBI's approach to law enforcement generally, is\nseriously deficient as applied to drug law enforcement. Crafting drug enforcement strategy\nwith careful attention to its Likely effects on the drug markets would be completely contrary\nto the way the Bureau does the rest of its business.\nThus a merger would seriously compromise the prospect of fielding a drug law\nenforcement effort welldesigned to reduce the supply of drugs. DEA's capacity for market\nanalysis, and its commitment to act on the results of that analysis, both need to be\nstr&gtbened; the new DEA A+ . ., tor, if there is one, will fdce no more imporrant task.\nBut at least the DEA understands that its bottom line is not arrests and convictions, but\nprogress against drug abuse. It can and should be encouraged to put that undemanding into\npractice. For the FBI to do so would be such a departure fiom the operating style which has\nsaved it well in other areas as to be wildly implausible.\nB-5\nThis content is in the public domain.\n\nare alternatives to a merger with better prospects for good results. A partial\nreverse merger, with the FBI keeping Title 21 jurisdiction but investigating drug cases only\nagainst individuaIs or groups previously identified as nondmg violators (e.g,, LCN, El\nRukns), and most FBI drug resources (with or without bodies) gradually being W e n e d to\nDEA, would reduce destructive competition and increase productivity and m-ategic focus.\nEven in the status quo within DoJ is maintained, a renegotiation of the treaty with the\nCustoms Service could do more to reduce the overall level of interagency friction in drug\ninvestigations than would a merger.\nFrom what I can see, ody the FBI and some of the stafY of the National Performance\nReview support the merger. TG\nnewspapers report that Congressional sentiment toward it is\ncool. That is considerably warmer than the sentiment among the handfbl of academic\nstudem of drug enforcement: Pem Reuter, James Q. Wiion, and Mark Moore all think. it a\nthoroughly bad idea- My small and unscientific survey of local law enforcement suggests not\n. -\nmuch more enthusiasm from that quarter. All the former DEA admnstmtors, including the\ntwo who came from the FBI, are against it.\nNone of this opposition would matter much if the process produced rapid success, but\nthey could mske a difficult transition a political catas&ophe. Both current DEA agests,\nembittered by their subjugation to an agency which despises them, and the Customs Service,\nthreamed by facing a much more powerful DoJ competitor agency, would be eager to make\n:\nthe rocky nature of the &amition known to the press and the Congress. Reports of\nd i s o ~ t i o n , accompanied by W\ng arrest statistics (and by falling heroin and marijuana\nprices, Likely to happen in any case for unrelated reasons), could provide the pretext for still\n. .\nmore complaints that once again the A-tion\nhas neglected the war on drugs, can't\n-e\ncompetently, and so on. There seems to be no reason to accept short-term problems\nand accompanying political static without the prospect of better long-run results than the\nmerger is Ilkely to deliver.\nThis content is in the public domain.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n11.027 Global Cityscope - Disaster Planning and Post-Disaster Rebuilding and Recovery\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}