{
  "course_name": "Godzilla and the Bullet Train: Technology and Culture in Modern Japan",
  "course_description": "This course explores how and why Japan, a late-comer to modernization, emerged as an industrial power and the world’s second-richest nation, notwithstanding its recent difficulties. We are particularly concerned with the historical development of technology in Japan especially after 1945, giving particular attention to the interplays between business, ideology, technology, and culture. We will discuss key historical phenomena that symbolize modern Japan as a technological power in the world; specific examples to be discussed in class include kamikaze aircraft, the Shinkansen high-speed bullet train, Godzilla, and anime.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Society",
    "Asian Studies",
    "Fine Arts",
    "Media Studies",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nThis course explores how and why Japan, a late-comer to modernization, emerged as an industrial power and the world's second-richest nation, notwithstanding its recent difficulties. We are particularly concerned with the historical development of technology in Japan especially after 1945, giving particular attention to the interplays between business, ideology, technology, and culture. We will discuss key historical phenomena that symbolize modern Japan as a technological power in the world; specific examples to be discussed in class include,\nkamikaze\naircraft, the\nShinkansen\nhigh-speed bullet train, Godzilla, and anime.\n\nCourse Requirements\n\nAttendance in all class sessions is expected. As this is a seminar course, students are expected to be prepared for and to participate in discussion, either planned or impromptu. Readings for each session should be completed before the discussion on that unit begins, so pace yourself throughout the semester. A list of questions to discuss in class will be provided in advance. By the end of the course, students are expected to develop the ability to think critically about cultural issues of historical interest and importance in the history of technology within a non-Western context. Students are also expected to gain basic factual knowledge of Japanese history, and be able to reach informed conclusions about factual information regarding technology and culture in Japan.\n\nDuring the semester, all students are required to make two presentations, each of about 15-minutes' duration. The subjects and dates will be determined by the student in consultation with the professor. Further instructions on these presentations, short papers, and weekly readings will be provided later.\n\nCalendar\n\nLec #\n\nTopics\n\nKEY DATES\n\nIntroduction: Understanding Japan\n\nReading Maps and Defining Technology\n\nBrief in-class presentation\n\nTokugawa Japan, 1600-1868\n\nPaper 1 due\n\nMeiji Japan, 1868-1911\n\nImperialism, Technology, and Business\n\nPaper 2 due\n\nKamikazation\nof Japan, 1937-1945\n\nPostwar Japan I, 1945-73\n\nSymbol of Postwar Japan: Godzilla\n\nSymbol of Postwar Japan: The\nShinkansen\nBullet Train\n\nPostwar Japan II, 1973-Present\n\nSymbol of Postwar Japan: Anime\n\nJapan in the \"West\"\n\nReview: Technology and Culture in Modern Japan\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nShort Papers\n\n20%\n\nPresentation I\n\n25%\n\nPresentation II\n\n25%\n\nAttendance\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "studyguide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/267cc6bcfee29643e007ef117e206b70_studyguide.pdf",
      "content": "STS. S28 Week 3 Reading\n\nStudy Guide\n\nRichard Samuels, \"Rich Nation Strong Army\": National Security and the Technological\nTransformation of Japan (Ithaca: Cornell Univ. Press, 1994)\n\nRead Chapter 2, \"The Ideological Basis of Japanese Technonationalism.\" Based on your\nreading of pp. 33-56 (reading pp. 57-78 is not required, but welcome), be ready to\ncomment on the following:\n\n1) Did you like the reading? Why or why not?\n\n2) What is the author's main argument in the chapter?\n\n3) According to the author, what are the three stages of technological transformation\nwhich he refers to as \"the three-note chord\"?\n\n4) Define each of the following terms in a paragraph or so.\n\n- \"technonationalism\"\n\n- fukoku kyohei\n\n- shokusan kogyo\n\n- kokusanka"
    },
    {
      "category": "Resource",
      "title": "response_paper_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/b4b3555544b51db81eaec1b1c8ac47ec_response_paper_1.pdf",
      "content": "STS. S28\n\nResponse Paper 1 (maximum 3 double-spaced pages)\n\nRead Chapters 1 and 2 of The Formation of Science in Japan: Building a Research\nTradition by James. R. Bartholomew. Based on your reading of pp. 1-25 (reading\npp. 26-48 is not required, but welcome), answer TWO of the following questions briefly:\n\nMandatory Question\n1) Did you like the reading? Why or why not?\n\nPick (2) or (3)\n2) Japan has often been portrayed as a nation of copycats when it comes to science\nand technology. According to the author, scientists in Japan and the West have\nlong criticized what they saw as Japan's lack of originality in scientific research.\nWhat are some of the critics' claims? Does the author agree or disagree with their\nviews? Do you agree or disagree with the critics as they are presented in the book?\n\nOR\n\n3) Many have claimed that Tokugawa Japan (1600-1867) did disservice to the\ndevelopment of modern science in subsequent decades. According to the author,\nwhat contributions did Tokugawa Japan (1600-1867) make to the scientific\ncommunity and research after 1868? What Tokugawa legacy does the author\nobserve in his study? Do you agree or disagree with his argument?"
    },
    {
      "category": "Resource",
      "title": "student_respons1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/dae8499a6741d6f63a55763b19d9c794_student_respons1.pdf",
      "content": "STS.S28\nResponse Paper 1\n9/22/05\n\n1. I like the reading very much in general. This is one of the few times I've read\nJapanese history in English. It is always helpful to read several excerpts by\ndifferent authors from different backgrounds to get the objective view of a topic,\nespecially in history. Chapter One introduces the topic and discusses why it is\ninteresting to study this subject. It also gives the readers an overview of what is to\ncome in the rest of the book. I think the author should have included a regional\nmap or given reason why Japan only traded with China and the Netherlands when\nhe talks about the national seclusion in Chapter Two. Most importantly, not\neveryone knows where Nagasaki is located or its historical importance, and thus\nwouldn't understand why it was the only port open to the limited trade.\n2. Critics claim that Japanese science has little original work because of the\napprenticeship system and the lack of democracy in science. There is normally no\nfreedom and scientists are not motivated to find resources. Also, some critics\nclaim that the general public treated the scientists as \"tools for the extraction of\nknowledge from the West\" but not \"creators of knowledge.\" Also capitalism\ndevelopment was so behind to Western world that scientists do not have individual\ndecision power. Other claims include that postwar despair led to the fast-growing\n\ntechnology improvement built on the existed work. Although the author does not\nexpress his agreement or disagreement on these claims, he explains several\nreasons why those claims might be true and includes other factors that might\nresulted the claims. He also raises the question of how to define science because\ndifferent definitions may lead to different interpretation of the phenomenon. I\npersonally agree with the apprenticeship claim. This system still exists, especially\nin the universities. One example I can think of is the \"Suzuki Coupling\". It is a\nnew method to couple two heterocycles together in a convenient way (using\npalladium as catalyst). Suzuki is the senior professor, however, this research was\nactually done by his junior faculty, Miyaura. Because of the apprenticeship, the\nchemistry world only calls this method as Suzuki Coupling and forgets the main\ncontributor. During the same period (1970s), at least 3 other similar coupling\nmethods were published by Japanese researchers: Negishi, Kumada, and\nFukuyama. Their works may be considered as \"original research\", but they were\nall based on the same idea of using palladium as catalysts."
    },
    {
      "category": "Assignment",
      "title": "assignment2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/6c8e6fa1a2ba94adf03c569c5ff0894e_assignment2.pdf",
      "content": "STS S.28\nProgram in Science, Technology, and Society\nMassachusetts Institute of Technology\nDr. Takashi Nishiyama\nDibner Institute,\n\nGodzilla and the Bullet Train:\nTechnology and Culture in Modern Japan\n\nFall 2005\n\nWeek 2: Reading maps and defining technology\n\nThe session is primarily designed to help you become familiar with the country's\ngeography and cultivate your interest in it in a friendly, interactive setting. It will consist\nof two parts.\n\nFirst, be prepared to talk before class for 5 to 10 minutes about your experiences\nconcerning Japan. If you have visited the country for any duration of time, please indicate\nwhere you stayed and what you did on the map that I will bring to class. It would be great\nif you could share in class any photographs you took during the visit. If you have not\nbeen to Japan yet, outline on the map for us your future itinerary in terms of where you\nlike to go and what you like to do for, say, 1 week or so.\n\nSecond, please bring to class at least two different maps of Japan that you like; it is\nperfectly okay to search the Internet and print the maps that interest you, though it would\nbe a plus if you could bring to class maps of Japan that were compiled outside the United\nStates. You will be asked a few questions based on them. First, from where and how did\nyou get the maps you chose? Second, why did you choose what you brought to class?\nThird, what do the maps tell us (and do not tell us) about the country?\n\nNote: This presentation work is NOT part of the two presentations required for class. If\nyou have any questions before class, do not hesitate to contact me via e-mail."
    },
    {
      "category": "Resource",
      "title": "response_paper_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/eb53d124dbcf9ca2769fe6b3cf692f03_response_paper_2.pdf",
      "content": "STS.S28\n\nResponse Paper 2 (Maximum 3 double-spaced pages)\n\nDue October 6, 2005\n\nThis assignment requires your creative thinking. Read \"Rich Nation, Strong Army\" by Richard\nSamuels (Chapter 2, pp. 33-56) as well as The Rise of Modern Business in Great Britain, the\nUnited States, and Japan (Chapter 5, pp. 103-127). Then let us suppose facetiously that we have\na time machine, developed by Nobel laureates at MIT, which can take us back to Japan right\nafter the Meiji Restoration of 1868. You are a novice industrialist trying to develop some new\nbusiness/engineering enterprise during the Meiji-Taisho years (1868-1925). Equipped with\nhindsight gained from the two chapters, what engineering/business project(s) would you initiate\nin Japan at the time if you were there? Note that Mitsubishi and Mitsui already launched their\nbusiness before our arrival. They are formidable rivals. Direct competition with any of such giant\ncommercial firms in the country needs to be avoided at all costs. In your paper, briefly describe\nthe new venture you have in mind, then answer the following questions. Why did you choose it?\nWhat international and domestic factors of the decades would support your effort? What would\nbe some barriers? What strategies would you employ to overcome such impediments?"
    },
    {
      "category": "Resource",
      "title": "student_respons2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/215e1a75608f236aecfab6d48901c606_student_respons2.pdf",
      "content": "Katherine Han\n1) Did you like the reading? Why or why not?\nAlthough I didn't find this reading as interesting as the last one (perhaps I'm not\nas interested in the improvement of technology through time), I did find this\nreading very informative. Through the explanation of why technology was so\nimportant to the Japanese government at the time, I've formed a hypothesis (that\nmay very well be erroneous) about Japan's seemingly strange actions prior to\nWWII. If I'm not mistaken, Samuels's main argument is that the need for greater\ntechnology, greater riches with an emphasis on nationalism stems from the West's\ncolonial activities. The Opium War, the subjugation of most Asian countries has\nunderstandably dredged up a sense of paranoia in Japan's leaders. Perhaps one of\nthe reasons for the race for better technology is a fear of losing what\nindependence Japan had at the time. Japan wanted independence, respect and the\nability to be on par with the Western countries. But Japan probably overzealous\nin this mostly due to the fear that, if Japan were not strong, it, too, would become\njust another puppet country for the West. Thus, the emphasis on technology\n(specifically arms), technonationalism and fukoku kyohei. Thus, the mimicking\nof the West in the (much later) invasion of Asia.\n2) I believe Samuels is arguing the basis of fear of the West's militaristic and\nimperialistic might for Japan's emphasis on technology and technonationalism.\nJapan sees what's going on around her (with the Opium War, the colonization of\nAsia, etc), realizes that, unless she can be as independent and strong as the\ncountries of the West, she will be next. To promote independence, Japan relies on\nthe concept of fukoku kyohei. By working on economic and technological\n\nstrength, Japan will have the technology to stand as an independent, westernized\nnation and will have the money to sustain its independence.\n3) Three-note chord deals with \"the pursuit of technological autonomy, diffusion,\nand the nurturance of Japanese industry\" (pg. 54). These three all are key to\nJapan's need for reassurance in the world. The basis of the article is the insecurity\nJapan had felt after numerous encounters with Western nations. With\ntechnological autonomy, Japan would gain independence. She would be able to\ncounter foreign threats and keep her independence. Diffusion comes from the\ndesire to take the West's strength (technology) for one's own and improve upon\nit. Lastly, the nurturance of Japanese industry ties the first two concepts together.\nNurturance allows Japan to use the skills from the pursuit of technological\nautonomy and diffusion and make something of them.\n4) Technonationalism--I see this as the entire concept of making a country's\ntechnology stronger by, not only integrating and adapting superior foreign\ntechnologies but encouraging domestic use of these technologies. Although this\nmethod promotes independence and stimulates the economy, its drawback is the\ninferiority of products.\nFukoku kyohei--literally \"rich nation, strong army,\" this concept emphasizes the\nadvanced technology to help national security (or at least the appearance of\nnational security), with an equal emphasis on economic growth to maintain the\nstatus and independence of a strong nation.\nShokusan kogyo--literally \"production promotion,\" this concept concentrates on\nthe stimulation of the economy by increasing Japanese industry. To increase\n\nJapanese industry, purchases of imports were discouraged and purchase of\nproducts made in Japan greatly encouraged.\nKokusanka--encouragement of purchase of national products. For the Japanese\ngovernment, this campaign included everything from songs to poems connecting\na healthy, modern nation with supporting national goods over foreign goods. As\nfar as Samuels states, the strategy large succeeded. The Japanese economy and\nsense of self-sufficiency certainly benefited."
    },
    {
      "category": "Resource",
      "title": "week1_timeline.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/669b2d50c16b3a8b2d389f879758d4ac_week1_timeline.pdf",
      "content": "STS 28 Week 1: Time Table\nJapan\nYear\nU.S.\nOther Civilizatons\n1,800\nMinoan-Aegean Civilization\n(1,750-1,100BC)\nJomon Period (11,000-300BC)\n1,100\nGreek City States (750-400)\nSocrates\nAlexander the Great\nBC\nYayoi Period (300BC-AD250)\nCE 0\nRoman Empire\n(27BC-478-AD)\nTomb Period (250-552)\nYamato Period (552-710)\nMuhammend and the Koran\nNara Period (710-794)\nHeian Period (794-1185)\n1,000\nThe Crusades (1096-1204)\n1,100\nKamakura Period (1185-1333)\n1,200\n1,300\nAshikaga Period (1336-1467)\n1,400\nRenaissance\nChristopher Columbus (1492)\nWarring States (1467-1568)\n1,500\nOverseas Exploration\nAzuchi-Momoyama (1568-1600)\n1,600\nMayflower Pilgrims (1620)\n1,700\nTokugawa (1600-1868)\nDeclaration of Independence (1776)\n1,800\nCivil War (1861-65 MIT)\nMeiji Era (1868-1911)\n1,900\nTaisho Era (1912-1925)\nWWI\nShowa Era (1926-1988)\nWWII\nHeian Era (1989-Present)\n2,000\nPrepared by Takashi Nishiyama"
    },
    {
      "category": "Resource",
      "title": "ich_paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-s28-godzilla-and-the-bullet-train-technology-and-culture-in-modern-japan-fall-2005/1aef178b1fc8a7a8177a78c19f465073_ich_paper2.pdf",
      "content": "Bring the State Back in the Global/Genomic World:\nRacial Difference and the Transforming States of Japan, Taiwan and Singapore\nAbstract\nObserving the trend that drugs have become more standardized and globalized in\nthe past decade, this paper looks at how East Asia has responded to this change.\nConsidered both as powerful commodities and scientific advancements designed to\nimprove people's health, pharmaceuticals make for a globally interesting narrative subject\ncompared to other products. This also merits an anthropological investigation for the\nreason that at the interfaces between the West and the East, between the global and the\nlocal, between politics and science, we observe issues and disputes that involve how\nracial difference should be dealt with in an attempt to eliminate unnecessary clinical trials\nfor new drug approvals.\nBased on fieldwork surrounding the International Conference on Harmonization of\nTechnical Requirements for Registration of Pharmaceuticals for Human Use (ICH), this\nstudy is intended as a \"deep description\" of East Asian states' response to the attempt to\nglobalize pharmaceuticals and to do this by exploring the intricate process of negotiation,\ncommunication and self-government. It will venture beyond a simple explanation of how\nglobalization is sweeping over the non-western region. Japan, Taiwan and Singapore are\nthe subjects of our investigation, and the question at hand is as follows. Through the\nsingle example of pharmaceuticals, what are the emerging characteristics of how these\nthree Asian nations are coping with globalization and how does each negotiate the\nuniversal standard proposed, while maintaining the overruling legal need to not\ncompromise on health at a national level?\nAlthough \"globalization\" is the theme of this study, this paper does not wish to\nbring it to the foreground of our discussion. What we intend to focus on is how \"state\"\nand \"race\", two classical concepts that constitute a national state, are firstly challenged by\nglobal capitalism, and then referenced by the new strategies and visions being developed.\nBased on the idea that understanding the differences in their respective reactions to\nchange will help our recognition of the nature of states from the global viewpoint, this\nstudy would like to call the need of ethnographies for these emerging subjects.\n\nBring the State Back in the Global/Genomic World:\nRacial Difference and the Transforming States of Japan, Taiwan and Singapore\nWen-Hua Kuo\nIntroduction\nObserving the recent trend of drugs becoming more standardized and globalized\nover the past decade, this study looks at how Asia has responded to this change. When\nconsidering how the global interacts with the local, previous literature has tended to focus\non the former, emphasizing the tactics used to impose on individuals and local groups.\nHowever, this study will venture beyond a simple explanation of how globalization is\nsweeping over the non-Western region. Taking into consideration the usual phenomenon\nof the local's resistance to globalization, it will work at the national level, exploring the\nintricate processes of negotiation, communication and self-government that occurs when\nstates deal with global capitalism.\nThe aim of the inquiry at hand is to ask the following. Through the single example\nof pharmaceuticals, what are the emerging characteristics of three East Asian nations,\nJapan, Taiwan and Singapore, when coping with globalization and how does each\nnegotiate the requirements for imported drug products, while maintaining the overruling\nlegal need to not compromise health at a national level? Another interesting aspect of this\ndebate is how these nations' different responses involve the ever-present issue of \"racial\ndifferences.\" Here, this term does not refer to the typical Caucasian versus non-Caucasian\ndynamic. Regarded as a \"non-tariff barrier\" from a narrow-sighted business viewpoint,\nracial difference becomes a reference surpassing skin color and is imbedded deep in the\n\ncultural and social nuances that separate the three individual nations.\nIndeed, it merits an anthropological investigation for the reason that at the interfaces\nbetween the West and the non-Western, the global and the local, politics and science, we\nobserve issues and disputes regarding how racial difference should be managed in an\nattempt to penetrate the state boundary by imposing a universal standard for new drug\napprovals. It is for this reason that the state is the subject of this study. It is chosen\nbecause it is, as Ernest Gellner calls, a political shell in which a culture can be shared and\nnationalism can be crafted (Gellner 1983). From an interpretive perspective, it is the\nstarting point where we recognize the characteristics of a territory where people work and\nlive from the global viewpoint. Unlike the conventional understanding that the state is\neither an apparatus simply delivering capitalism to its people without discrepancy or an\nempty promise after globalization, this study shows its subjectivity as an actor in the\nglobal stage. We believe that only by understanding differences in their respective\nreaction to change will we recognize the post globalization nature of states, their visions\nof the world and their goals.\nThe field for this work is conferences surrounding the International Conference on\nHarmonization of Technical Requirements for Registration of Pharmaceuticals for\nHuman Use (ICH.) For more about this conference, please see its website at www.ich.org.\nAs the first ever attempt to standardize all standards for proprietary drugs, many meetings\nand symposiums concerning the ICH have been and are held at different levels for\ndifferent guidelines. They are what I would call lively interfaces where people come,\nmeet, share, update, and refresh themselves, and I have three reasons for choosing them\nfor ethnography. First, the conference is itself a discursive site in which the state presents\nits current attitudes on certain issues or even brings in new topics. As one would expect\n\nwith possible responses and actions, these policies may not yet have been written down\nor even fully formed. Unlike already established regulations and published papers, these\ncutting edge ideas are fresh and have the potential to change or to adopt one form from\nanother. As a modern version of the \"Universal Exhibition,\" conferences visualize and\nverbalized the desire and will of the state's actions and thoughts, and thus should be\nconsidered a site for interpretative ethnography.\nThe second reason is related to the conferences' interactive function. As occasions\nfor discussion or interchanges of opinions, conferences involve two seemingly\ncontradictory functions of comparing different opinions at one hand, and of working\ntogether or exchanging views, on the other. It is an arena where both controversies and\nconvention are expected. This is especially true at the ICH and is specifically true for the\ntopic of racial differences. As to the topic itself, the ICH is an attempt to create a\nuniversal standard for drugs by neglecting as much as possible bodily differences.\nHowever, the issue of ethnicity has resulted in differences among various races. Thus, the\nconference on this issue presents the best site to see what opinions are expressed and how\nthey tended to merge into one standard. In addition, the contradictory nature of the\nconference provides the best site where the local acts in the global. Echoing Bruno\nLatour's notion about the making of social actions (Latour 1987), my ethnographical\ninvestigation explores the idea that the different interests among states have made\nconferences a complex zone where various people are compelled to trade information and\nvisions.\nThe third reason I argue for conferences as an ethnographic site can be found in\ntheir accumulative and periodical nature. The participants at a conference act upon the\ninformation they receive; then their actions will be presented at the next conference along\n\nwith others. Additionally, through written and visual technologies, such as proceedings\nand slides published in papers or posted on websites, the effect of the information is long\nlasting, spreads and generates new information. It is a living archive. Until a policy can\nbe formed and settled, the information conferences are the only source where these\nactions can be traced and analyzed. Although it is of no doubt that oral interviews cannot\nbe excluded from our scrutiny, my field experience convinces me that the conferences\nthemselves seem to be more reliable. Already heavily occupied by everyday routine,\nmany experts rely a great deal on this kind of material as a reference for the\nreconstruction of their memories and these memories represent the nature of the\nconferences, both fragmental and periodical.\nTaking advantages of the rich archive formed by the ICH, this paper's aim is to\ncarry out an interpretative ethnography on the real-time behavior of Asian states\nregarding globalization. We will see in this paper how \"state\" and \"race\", two classical\nconcepts that constitute a national state, were firstly challenged by science and global\npolitics, and then referenced by the new strategies and visions that are being developed.\nOne attempting to fit all: the uncanny capitalism\nIn this section I will explore the conventional understanding of pharmaceutical\nindustry, and then provide a new interpretation from the perspective of standardization.\nThere is no doubt that drug development is a long, expensive, high-risk activity.\nDevelopment times, as given by the PhRMA, have been increasing steadily over the past\ntwenty years to an average of thirteen years (PhRMA 2002). However, there is a need to\nquestion what the basis of these numbers is. Let us use the data the PhRMA provides as\n\nan example. It claims that the average cost to bring a new chemical entity (NCE) to the\nmarket is in excess of 800 millions US dollars, but in fact development costs of a specific\ndrug is not nearly that much. Much of the cost is spent on NCEs that fail to make the\nstandard during the process of development. The number of these NCEs is astonishing.\nOnly twenty out of five thousand compounds that are screened enter preclinical testing,\nand only one drug in five that enters clinical trials is approved for use. In other worlds,\nmost of these costs are spent on the failures and the need to keep an extremely high\nstandard.\nGovernment intervention is crucial in this process, since health is the last thing to be\ncompromised. Nonetheless, this standard is now higher than it was prior to the early\n1960s. The amendments of Food and Drug Acts in 1962 required firms to demonstrate\nthe efficacy, as well as the safety of new products, through extensive use of human\nclinical trials. These more rigorous requirements have lengthened the pre-marketing\nperiod for new products. In the mid 1970s, statistics became involved as clinical trials\nbecame highly complicated and difficult to manage. Both the regulatory side and industry\nhired more experts and statisticians for each clinical trial and their efforts made it a highly\ntechnical and abstract task to outsiders.\nLike other sectors, the pharmaceutical industry has long sought a global market, and\nthe desire has become more intensive in the past twenty years. Although extremely high\nstandards have protected the monopoly by raising the barriers to new market entrants, for\nthose that can afford to pass, there is an urgent need to get back the costs they have paid\nas soon as possible. The reason is simple, the effective marketing period of approved\ndrugs has shortened and effectively so has the period in which the drug is protected by a\npatent. Although the regulations set by other governments are not as high as in the United\n\nStates, they cannot be simply replaced because of the special requirements and standards\nused. To a global pharmaceutical company, there appears to be no need to fulfill the\nincreasingly difficult standards one by one. Thus, the standardization of the standards\nbecame important. It does not only make it easier to move drugs from one country to\nanother; it creates a larger single market that would reduce costs.\nFrom the perspective of standardization, the ICH presents a unique global project\nthat has never previously existed. Unlike other conferences of this kind that consists of\nonly governments or non-government organizations, the ICH allows industry to work\ntogether with the regulators. It knows well that without the industry there would be no\ninitiative to create innovative drugs; however, it is also necessary to have regulators\nsitting in the conference, since only they can decide whether a product is granted\napproval. Thus, the ICH had a complicated mission to achieve and it is both commercial\nand scientific. It is an attempt to \"smooth out\" these non-tariff barriers and also an\nattempt in the area of public health to eliminate unnecessary administrative regulations so\nthat the most advanced medicine available can be delivered to the patients in need.\nIt is important to note its exclusive nature and complicated working process. Unlike\nother scientific meetings, which are open to all, the ICH carefully selected Europe,\nUnited States and Japan, whose pharmaceutical market represents over 85% of the world.\nThe regulators from the three regions and also industry representatives make up the main\nbody of this conference. The International Federation of Pharmaceutical Manufacturing\nAssociation, which is an observer, provides the Secretariat and administrative aids needed.\nIn addition, in order to make sure that the guidelines it makes are implemented, the ICH\ncreated a complicated working process to achieve consensus. Every proposal for new\nharmonization has to be initiated by the Steering Committee and discussed in an expert\n\nworking group (EWG) assigned to it. Every guideline has to be agreed by all parties\nbefore being confirmed and released. Even taking into account these steps, what makes\nthe ICH unique is its final step. A follow-up mechanism is applied to see whether the\nguidelines are adopted by local regulatory agencies within six months after release. With\nthis lengthy process, a guideline requires at least twelve to eighteen months to be\nimplemented.\nEven so, the ICH has achieved much since its foundation in 1990. Up to its sixth\nconference (ICH6) held in Osaka in November 2003, fifty-four guidelines have been\nfinalized and some others are in the process for harmonization. Industry certainly\nappreciates. As Stuart R. Walker of CMR international praised, \"I believe that the\npharmaceutical industry must continue to strongly support the ICH program. As a result\nof this initiative, the drug regulatory process has become smoother, quicker and less\nburdensome (IFPMA 2000, p.9). It further attempts to spread the new standard to\nnon-ICH counties. Starting in 1999, the ICH Global Cooperation Group (GCG) was\norganized and serves as a bridge that reaches out to other countries that are affected by\nthese guidelines. As written, the objective of this group is \"to act as a resource for the\nunderstanding, and even acceptance, of many of the guidelines\" (IFPMA 2000, p.10).\nThrough the standardization of the standards, the ICH continues working to achieve a\nsingle global market/health community. For the ICH, one will finally fit all.\nOne request; three answers: racial difference and the state in the ICH\nThe East Asian states encountered the ICH in various situations and at different\n\ntime points. The request is simple, \"to eliminate unnecessary clinical trials\", yet each\nstate responded differently. I will introduce Japan, Taiwan and Singapore, in the order of\ntheir appearance, outlining the international situation that they met at the ICH and then\ntheir first responses when encountering the question of standardization.\nJapan was the first state that interacted with the ICH. Compared to the Europe and\nUnited States, where almost all global pharmaceutical industries are located, Japan was\ninvolved to the ICH not because of its ability to carry out research and development on\npharmaceuticals, but because of its incomparably huge drug market and tough regulation\nrequirements. Before 1986, almost all products that sought a market in Japan had to\nrepeat all the clinical trials required in Japan using Japanese subjects. Even after 1986,\nwhen a notification was enacted allowing \"in principle\" the acceptance of the foreign data,\nalmost no product was granted a waiver. Industry complained that Japan was practicing\nprotectionism with drugs, and it became a target for blame.\nIt was Japan that brought up the issue of racial difference at the ICH. Doi Osamu,\nthe Japanese representative, thought that it was crucial in judging whether the foreign\ndata was acceptable and the consensus on this topic should be decided at a scientific\noccasion like the ICH. Upon this insistence, ethnicity was agreed as a topic for discussion.\nAt that time, nobody could image that this later called \"E5\" issue (the fifth issue to make\na guideline under the category of efficacy) became one of the most difficult topics ever in\nthe ICH history. Six years were spent and only a vague guideline was formed. As I will\nmention later in this section, its vagueness and incompleteness gave Taiwan a chance to\nspeak for itself.\nIt is not necessary to review in detail the tiresome process of discussion on racial\ndifferences at the EWG. To be brief, Europe presumed that individual variation is larger\n\nthan interethnic differences and that this supported the idea that further clinical trials\nshould be added only if a real difference among Asians could be proved. On the other\nhand, assuming the uniqueness and homogeneity of the Japanese race, Japan insisted that\nno clinical trials should be waived unless the similarity between the Japanese and\nCaucasians could be proved. Therefore, after an agreement on waivers of PK studies,\nseveral proposals were submitted in two divergent directions. While Europe and United\nStates asked for more waivers on Phase II and III studies, Japan, in order to discover\npossible differences, expected a clinical trial system to have equal contributions of\nsubjects enrolled; that is, Caucasians, Blacks and Asians (i.e., Japanese). None of these\nproposals pleased all parties, although they were scientists and experts, and deadlock\nresulted.\nAn FDA expert's suggestion rescued the dialogue. As a vague concept serving well\nin both proposals, the idea of \"bridging studies\" became the key term in making the\nguideline on racial difference. It was a political compromise. From the Western viewpoint,\na bridging study was a test to judge whether the existing data can be extrapolated to the\nregion where the product was seeking to be marketed and was only to be applied when\nthe product was suspected as being racial sensitive. However, in Japan's thought, the\nbridging study functioned quite differently. Formatted as a full study, but using fewer\nsamples, the bridging study was a local study especially for Japan. It was mandatory\nunless the applicant could prove similarity of the PK, PD and dose-response curve\nbetween Japanese and foreigners. The guideline was finally formed at the ICH4 in 1997\nand was implemented in 1998.\nTaiwan started noticing the E5 issue at the ICH3 but did not become actively\ninvolved until the guideline was implemented. There were two reasons. First, although\n\nhosting 30% of the population of the world, the pharmaceutical market in Asia outside of\nJapan remained small. Taiwan, like other Asian states, felt highly pressured to bargain for\nmore local trials before granting approvals, not withstanding the regulations on new drug\napprovals by the global industry. Second and more specifically is Taiwan's political\nsituation. Because of the PRC's illegal interventions under international law, Taiwan has\nfailed to be allowed to join any international organizations for governments, and medical\nones are no exception. Although some Taiwanese experts had seen the need to form a\nnetwork on the regulatory science in Asia, it was hard to realize this without a specific\nfocus.\nAgreement on the E5 guideline gave Taiwan a concrete topic to speak out about.\nContrasting Japan's ambiguous attitude toward this guideline, the Taiwanese government\nannounced immediately that it would like to be the first non-ICH state in Asia that would\nadopt this guideline, including the touchiest parts of the E5. The Center for Drug\nEvaluation (CDE), a FDA like institute, was established in July 1998, offering high\nquality in-house reviews on new drug applications. It also, in reality, took responsibility\nfor the implementation of the ICH guidelines and handling all international affairs related\nto regulatory science on drugs.\nWhat made the CDE famous are its evaluations concerning racial differences. On\nthe one hand, it recognized that there were biological differences between Asians and\nCaucasians; nonetheless it did not insist on racial uniqueness. Based on a genetic survey\nof Asian populations, the CDE required bridging studies only when the application was\nconsidered ethnically sensitive, and all Asian data conducted outside of Taiwan was\nwelcome. Up to 2003, only fifteen out of sixty-two applications were asked to carry out\nbridging studies, and all of them had convincing reasons for the request. Its\n\naggressiveness attracted international notice, resulting in it leading a forum working on\nbridging studies at the APEC, the only international organization where Taiwan is\nrecognized as a state. Starting in 2000, the APEC network provided Taiwan with a way\ninto the ICH. It was invited to present, as the APEC representative, at the satellite\nmeetings of ICH5 and ICH6. It was characterized as an exemplar to show how a non-ICH\ncountry deals with the global pharmaceutical industry. Unlike Japan's passive\nengagement in the process of globalization, Taiwan, which has been long isolated from\nthe world, embraced it as a chance to be heard and made the best use of it.\nAmong the industrial Asian states, Singapore was relatively behind in following\ndevelopment of the ICH. Although, in 1995, Singapore was proposed as the coordination\ncenter for good clinical practice (CCGCP), as an aid to its burgeoning biotechnology, its\nregulation of drugs was still behind other countries. It did not renew its regulating system\nuntil 1998, when a center for drug evaluation was established involving the collaboration\nof the National Science and Technology Board, the Ministry of Health, and Singapore\nGeneral Hospital. This developed slowly before being incorporated into the Health\nScience Authority (HSA), a new institute derived from the existing regulatory section of\nthe Ministry of Health, in 2001. Singapore not only missed the debate over the E5 issue,\nin which Japan was hugely involved during the early 1990s, it also missed the chance to\nform a professional and independent institute, like Taiwan did, in the late 1990s.\nHowever, this does not mean that Singapore has no chance to catch up with other\nAsian states. I have discussed APEC as the gateway for Taiwan to join global village. For\nSingapore, ASEAN is its platform. The initiative for harmonization of pharmaceuticals in\nthe ASEAN countries is economic. There is a hope to create a single pharmaceutical\nmarket through mutual recognition among the different regulatory authorities. A timetable\n\nhas been set out, whereby the process would start in 2002 and there would be an\nimplementation of harmonization starting by January 2005.\nEven so, Singapore's role in ASEAN is ambiguous. Although ASEAN's goal is\nclear, what it needs does not well match with Singapore's needs. Singapore is rich and\ncapable enough of enjoying the most advanced chemicals in the world, not just generics\nof variable quality. On the other hand, Singapore's market is too small to make any claim\non the global industry. Like Taiwan, Singapore also needs a regional network that it can\nrely on. Thus, while it has started being involved in some ASEAN activities, it also keeps\nshowing up at APEC. Even as the global industries set up their Asian subsidiaries in\nSingapore, it still cannot find its position in the global network.\nCrafting \"genomic\" race, saving the state by more bridges, and finding self in global\nnetworks: three post-bridging study responses\nIn this section, I will continue to introduce the strategies Japan, Taiwan and\nSingapore developed to cope with bridging studies. I will argue that although these\nresponses are related to each other, these responses are distinct. Each state has its own\nvision and emphasis, which cannot be easily compromised by commercial concerns.\nThe first state to be discussed is Japan. As described in previous section, bridging\nstudies are not the solution Japan expected. As described by two analogies, the Japanese\nhave been portrayed as either an ant lying on the huge foreign data of an elephant or a\nbaby turtle (bridging data to be born) on the back of its mother (existing foreign data)\n(Figure 1). Clinical trials in Japan are considered to follow those of foreign countries and\nthe sampling size required is extremely small. For Japan it is regional discrimination; its\n\nthoughts on globalization are that of harmony and Japan's contribution has to be clearly\npresent.\nFigure 1 Echo of the past: Japanese impression on bridging study\nSource: Mori Kazuhiko's presentation in the APEC 2003 meeting, Taipei,\nNovember 17-18, 2003.\nJapan's emphasis is clearly to ensure the presence of the Japanese race in clinical trials\nand the simultaneity of its involvement. It did this by rejecting \"retrospective\" bridging\nstudies and the approval rate is pretty low at 14% in the total up to October 2003.\nMeanwhile, a new discourse called \"global drug development\" was proposed. It is not a\nnew approach, but in the context of Japan's E5 policy, it must be considered a solution\nthat fulfills two requirements: enough enrollment of Japanese subjects and simultaneous\nclinical trial design.\nFor this purpose, two newly developed sciences, the Advanced Life Science\nInformation System (ALIS) and pharmacogenetics, have been introduced to serve this\nneed. The ALIS is a website database on the Japanese genome. It consists of several\ndatabanks and is open to the public. Although it is taking an enormous amount of money\nto achieve this, obviously Japan has its own concerns with this. It seems that Japan want\nto redefine the Japanese race by this genomic information, as one MHLW official\nadmitted: \"from now on the intrinsic factors of racial difference can be replaced by the\n\ngenome.\"\nYet, this new definition still requires a theoretical tool to make it work in global\ntrials. A statistical method, which can be called \"genomic statistics\", was thus created to\nserve this need. It was promoted by Takeuchi Masahiro and the Kitasato-Harvard\nsymposium was the place to realize his vision. Starting from 2000, this symposium\nserved as an informal channel between the MHLW and the FDA experts on clinical trials.\nThe main idea is as follows. In order to avoid population bias, the genomic information is\napplied to select the best target groups for clinical trials. Only through this design, can a\nsimultaneous global trial program can be conducted.\nAccording to Takeuchi, it seems that Japan has given up its cultural assumption to\nembrace the globalization. Indeed, genomics is not a science that belongs to Japan\nexclusively. However, we should also keep in mind that genomics is an expensive science\nthat not many states can afford. Though not claiming this clearly, Japan is willing to\nspend as much money as needed to prove their racial uniqueness. What science does not\nsay to us is why Japan is able to lift the bar on cultural protectionism; the reason is\nbecause a higher standard of genomics will replace it. Benefiting from its advance\nscience, Japan does not have to worry about competing with other Asian races in the\nglobal era. When I reminded Takeuchi that in his explanation of the global clinical trials\nhe always used \"Japanese\" where he should have used \"Asians,\" he gave me a charming\nsmile and said: \"Well, yes. But do you think it will make any difference if I do?\"\nUnlike Japan that chose to focus on the concept of the Japanese race, Taiwan tries to\nconfirm the existence of the Taiwanese state. Although the CDE's strategy to separate\nrace from the state was successful, this advantage is losing as the paradigm was shifting\nto global drug development. Responding to this, three statistical methods were presented\n\nin the 2003 APEC meeting to \"save\" bridging studies under this new scheme (CDE\n2003).\nThe first is the group sequential method. It is proposed to facilitate a practical\napproach that includes of patients from the new region as a part of the recruitment of the\nwhole study for the submission to the original region; that is, the bridging study is\nconsidered a sub-study of a \"whole\" trial. In order to ensure the consistency of the study\nprotocol, special sample sizes and design are required. The second strategy can be called\n\"weighted/discounted\" approach. It is derived from the traditional Z-test method, arguing\nthat while conducting the bridging study, the prior information obtained from the study in\nthe original region will hugely affect the partition of sample space in the new study, thus\nthe result obtained requires to be weighted according to the region in which it is\nconducted. The third strategy can be named \"multi-centered/ hierarchical.\" Recognizing\nthe fact that Asia-Pacific region is small when bargaining a full clinical trial, this\nstatistical method constructs a hierarchical operational structure that groups the centers\nrecruited in a global clinical trial. In order to have reasonable measures for all regions in\nwhich the product would seek to be marketed, this method insists that every region\nshould have a representative center and a \"state-national effect\" should be attached.\nAt first glance, these methods are nothing but scientific elaborations. However, like\nJapan's proposal in genomics, there are assumptions hiding behind these methods. Using\nhighly abstract statistical methods, these strategies do not only want to prove that\nbridging studies are still workable, they also try to emphasize the importance of \"regional\ndifferences\", which do not appear in the E5 guideline, and ask for subjects to be enrolled\nfrom every state where the product is to be marketed. Despite the differences in statistical\nmethodologies, the goals are similar. They do not necessarily reflect the trend of the\n\nCDE's policies; instead, they provide visions that Taiwan can follow while the country\nwelcomes globalization.\nCompared to Japan and Taiwan, Singapore was far behind at the ICH. Worse, its\nethnic diversity is more complicated. It would seem there is no way for Singapore to\ncatch up with other Asian states in the global era. However, Singapore's strategy is to just\nignore racial difference so its can \"skip\" the dispute over bridging studies. It is able to\nprovide the best sites for clinical trials to study Asian people, but does not apply the\nresults to its nationals. Identifying itself as a node in global business, Singapore seems to\nwants to be a global state, a state with no local characteristics. As one Singaporean\nofficial claimed at an APEC meeting: \"if we are global, there will be no need to bridge.\"\nThis strategy can be been in its new reviewing system, which features two\ncomponents. The first is the \"verification\" evaluation, the quickest route applicable to\nnew drugs that have been granted marketing approval by major advanced regulatory\nagencies. As part of the second-tier drug approval system, Singapore is hoping to accept\nthe results made by these authorities to shorten the time to drug accessibility from the\nprimary reviewers. The aim is clear, since it is hard for Singapore to be a primary\nreviewer in the world, it hopes to the first country in East Asia that has access to the latest\ndrugs marketed in the most advanced countries. Secondly, this system requires good\nconnections to countries inside and outside of Asia, and Singapore is qualified. On the\none hand, Singapore maintains its former connections. It re-links with these states by\nmutual recognition and free-trade treaties. On the other hand, it makes connections to\nstates within Asia as well. It does so through regional organizations. While joining the\nAPEC network, Singapore continues participating in the making of ASEAN common\ntechnical document (ACTD) with Thailand and Malaysia.\n\nOne cannot say that Singapore is the only player to make this global network\nhappen. However, the only thing we can be sure of is that Singapore will definitely\nbenefit from this homogenous market of pharmaceuticals. This is the way Singapore\nchooses to survive. Unlike Japan's vision of a national state made up of a homogenous\nJapanese race, or Taiwan's struggle to make itself recognizable as a state, Singapore is\nseeking itself through global networking. The network exists and therefore the state lives.\nPut the State back in the global/genomic world\nUsing the standardization of the requirements for new pharmaceuticals, this paper\nexamines how East Asian states have coped with the impact of this process. It argues that\nno state behaves alike in the face of global capitalism; only at the lively interfaces where\nthe state meets the global can we identify their distinct characteristics, which I have\nnamed the ethnography of the state. Following Michael Fischer and George Marcus'\nnotion regarding anthropology as cultural critique for the world political economy\n(Chapter 4), I suggest another direction, where it is necessary to incorporate cultural\nfactors into the traditional interpretation of the modern world and in which the state has\nbeen either simply ignored or replaced by transnational terms such as \"colonization\" or\n\"class.\"\nIn the case of pharmaceuticals, this paper would like to portray the state as a\nregulatory body, an intermediate matrix between the individuals and the global. It\ncompletes with others in the world while maintaining its ruling legitimacy in the name of\nhealth and thus the state has to create ways to survive, visions to develop, and goals to\naccomplish, not all of which are mechanical or utilitarian thoughts. At this point, I believe\n\ninterpretative ethnography is useful.\nFor interpreting the state's behavior, this paper brings up the issue of racial\ndifference. As one of the traditional elements that constructed national states and\nnationalism, race is perhaps the first that has been challenged and buried into the waves\nof globalization. This is especially true of the nationalisms of the East Asia states, where\nthe \"imagined communities\" are achieved by many factors other than race (Anderson\n1983). Thus, when it was brought up at the ICH, it was already not simply a call back to\nnationalism. As this paper has tried to show, race has two functions in this story. First,\nrace is itself a topic in a social context, which is fluid and always questionable. Any\nscientific attempt to clarify it creates more confusion and reveals the cultural and social\nassumptions behind it. Second, race is a \"lens\" that gathers the observer's attention.\nBorrowing Clifford Geertz's analogy of cock fighting (Geertz 1973), race is an issue\nthrough which we appreciate the deep play of Asian states in the ICH.\nThree transforming views on globalization and the state/race are described. Japan\nseems to be the only state that holds strongly to the concept of a pure Japanese race. It\ndoes not mean that this idea faithfully reflects either the population composition of the\nJapanese or what Japanese individuals really think of themselves. Instead, it presents a\nvision of the Japanese state clashing with globalization. According to this vision, the\nJapanese race and the Japanese state are two sides of the same coin. As we can see from\nJapan's reaction at the ICH on racial differences, this vision emphasizes the race more on\nits collectivity than purity. Simultaneously, global drug development nicely realizes its\nexpectation. In order to ensure the niche of Japan, race is the cause for making such a\nclaim, and the state is the subject that insists and benefits from it.\nTaiwan has another concern about its race/statehood. Unlike other more \"normal\"\n\nstates, Taiwan is always eager to prove itself a good \"citizen\" in the global village. This\ndesire drives it to extremes. The greatest and the best are its immediate goals and\nmissions. This does not reflect faithfully the real achievements of Taiwan in the world. It\nis a vision of the Taiwanese state embracing globalization. As seen in the ICH, although\nbridging studies presume a worldview of \"West-center; East-peripheral\", this is not a\nproblem for Taiwan. Not yet considering whether it should resist or accept, for Taiwan,\nglobalization presumes formal recognition by the world and this should be welcomed.\nWith the same logic, race gives Taiwan a bridge to the world. It always claims that E5\nguideline should be considered a \"regional\" problem rather than one for a single state,\nand, while Japan started pushing the worldview on global clinical trials by genomics,\nTaiwan survives bridging studies by making statistical bridges to others. Although these\nmethods are not yet ready for implementation into policies, the vision is to maintain\nTaiwan's global visibility and this will keep leading these strategies as long as it can\nprotect its statehood through globalization.\nShining through its biotechnology, Singapore is recognized as a competitive spot in\nthe network of global business. Very few remember the small city-state's complex racial\ncomposition and its government tends not to remind anyone. It is a vision of the\nSingaporean state than can survive globalization. Unlike Taiwan, which recognized Asian\nracial differences and took advantage of these through bridging studies, Singapore does\nnot see any benefit because of the complexity of its racial structure and of possible\ndamage to its politics and economy. As a new factor added to global clinical trials, race\ninvolves nothing but a chance for contract research organization business. Singapore's\nstrategy is thus to boost pharmaceutical sector in Asia, and to be its hub.\nAlthough the state is the main concern of this paper, we do not intend to reject other\n\nconcerns that link the local to the global within the topic of the body and drugs are major\nchallenges to the state's aim of \"protecting its people's health.\" At this point, this paper\nhas shown that each Asian country has it own concerns, which are not exclusively related\nto health per se. Nonetheless, what entity other than the state can serve as the ultimate\nguardian when dealing with this global risk? Globalization does not sweep all things\naway, as many have claimed. Among the genomic/globalized world states, race has\ngained new life. One must argue that it is too early to declare the funeral of the state and\nrace in the name of \"globalization\"; the contribution of this paper is that it fundamentally\nshows how this world is being referenced and changed in terms of state and race.\nAs an unfinished conclusion, let me cite Gellner's observation on the state in the\nmodern world. Viewing two ethnographic maps before and after the age of nationalism\nand looking at the ethnographic and political map of the modern world, he observes:\n\"there is little shading; neat flat surfaces are clearly separated from each other, ...we see\nan overwhelming part of political authority has been concentrated in the hands of one\nkind of institution, a reasonably large and well-centralized state\" (pp.139-140). Upon this\nnotion, this paper further argues that every state deserves ethnography. Gellner is right. In\nthe age of globalization, the state, still, matters.\nSelected References\nCDE, the Proceedings of 2003 Symposium on Statistical Methodology for Evaluation of\nBridging Evidence, Nankang, Taiwan, November 15, 2003.\nGellner, Ernest 1983 Nations and Nationalism. Oxford: Basil Blackwell.\nMarcus, George E. and Michael M.J. Fischer 1999 Anthropology as Cultural Critique.\nChicago: University of Chicago Press.\nLatour, Bruno 1987 Science in Action: How to Follow Scientists and Engineers through\nSociety. Cambridge, Mass.: Harvard University Press.\n\nGeertz, Clifford 1973 The Interpretation of Cultures, Basic Books.\nPhRMA, the 2002, Phrmaceutical Industry Proflle, PhrMA.\nIFPMA 2000, The Value & Benefits of ICH to Industry, website version at\nhttp://www.ich.org/MediaServer.jser?@_ID=458&@_MODE=GLB,\ndownloaded\non August 9, 2004.\nAnderson, Benedict 1983 Imagined Communities: Reflections on the Origin and Spread\nof Nationalism. London: Verso."
    }
  ]
}