{
  "course_name": "Good Food: Ethics and Politics of Food",
  "course_description": "This course explores the values (aesthetic, moral, cultural, religious, prudential, political) expressed in the choices of food people eat. Analyzes the decisions individuals make about what to eat, how society should manage food production and consumption collectively, and how reflection on food choices might help resolve conflicts between different values.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Society",
    "Gender Studies",
    "Global Poverty",
    "The Developing World",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Society",
    "Gender Studies",
    "Global Poverty",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLecture: 2 sessions / week, 1 hour / session\n\nRecitation: 3 sessions / course, 1 hour / session\n\nPrerequisites\n\nNone\n\nCourse Description\n\nOur choices about what to eat are expressive of different sorts of value. Some choices are expressive of our\naesthetic\nvalues: they concern which foods are or are not tasty, appealing, delicious, revolting, etc. Some choices are expressive of our\nmoral\nvalues: which foods we are morally permitted to eat; which kinds of food production are permissible, or not, due to forms of labor required, and the environmental impact, or health implications. Some food choices are expressive of our\ncultural or religious\nvalues: which foods are culturally or religiously required or forbidden, which are high- or low-status, etc. All of these sorts of values are tremendously important to the ways we live our lives.\n\nIn considering our food choices, we will discuss several specific moral issues:\n\nWhat sorts of moral obligations, if any, do we have toward non-human animals?\n\nHow are our personal choices e.g., about what to eat, related to global justice?\n\nWhat is the state's responsibility to provide reliable information to consumers?\n\nAre we each individually morally required to take action to reduce global warming?\n\nWe'll look at questions both about\nindividual food choices\nand about\nfood policy\n-- at questions both about what we should, as individuals, decide to eat, and what actions we, as a society, ought to take in order to influence how our food is grown, processed, marketed, sold and consumed.\n\nCourse Objectives\n\nThe course is designed to improve students' ability to\n\nIdentify moral and political issues and interpret arguments relevant to food choices and policies.\n\nGather and evaluate information relevant to these issues.\n\nBecome familiar with normative frameworks for making moral decisions, and apply them to food choices and policies.\n\nDevelop a more sophisticated moral perspective on their own food choices.\n\nCommunicate information and engage in moral discussions about controversial topics.\n\nRequirements\n\nReading, discussing, and writing about the assigned readings are the central activities of this class. There is a reading assignment for each lecture. Some are quite difficult and demand careful study. You should complete the assigned readings\nbefore\neach lecture, as the lecture will often resuppose familiarity with the material in the texts.\n\nGrading\n\nAssignment\n\nGrade\n\nRecitation\n\n20%\n\nShort Assignments\n\n10%\n\nPapers 1, 2 and 3\n\n60%\n\nFinal Communication Project\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "Second Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/8a738f3f056c27ef7acefce159d66690_24.03_Second_Paper_Topics_17.pdf",
      "content": "24.03: Good Food\n10 April 2017\nTopics for Second Paper\nThe syllabus describes the second paper as follows:\nPaper 2 (1250 words (5 pages)): You have a choice of writing on topics distributed in class or on a\ntopic you pose (original paper topics must be approved in advance). (Due Monday, April 24,\n11:59pm.)\nRecall also that you have a choice in your third paper (Due last day of class, Wednesday May 17, 11:59pm.).\nEITHER\nOption A: Expansion of paper 2. Based on feedback on paper 2, you will develop your argument in\npaper 3 (2500 words (10 pages)).\nOption B: New paper. You will write on a topic that you pose (topics must be approved in advance).\nSo your decision about your second paper topic may bear on your third paper as well.\nGuidelines for a paper on a topic you compose\n1. If you want to compose your own topic, it must be submitted to Abby by Friday, April 14\n(11:59pm) and approved by her. Your topic must touch on issues and readings we have been discussing\nin class, but may extend beyond the precise topics we've covered. Any issue on the syllabus - other than\nthose you covered in your first paper - may be developed into a topic.\nOn the back of this page you will find a form that you must follow in order to propose a topic for your\nsecond (or third) paper.\nAdditional topics\n2. Both Singer and Korsgaard give us reason to think that in important ways, non-human animals must\ncount, morally, just as humans do. State either Singer's or Korsgaard's argument for the particular\nversion of the claim that they endorse, and then consider: If a non-human animal lives a perfectly happy\nlife, and then is killed instantly and painlessly for food, has that animal been wronged? What will the\nauthor you have chosen say, and why? Do you agree? Why or why not? Would you say the same about a\nhuman? Why or why not?\n3. In their discussion of \"Consumer Ethics,\" the editors of FES (pp. 165-188) consider what they call the\n\"Simple Principle,\"\n...if something is produced in a way that is wrong, then it is always wrong to be a consumer of it.\"\n(pp. 165-66)\nThe editors argue that this principle is not compelling, but a revised version of it might be. Critically\nevaluate the principle, drawing on the material in the \"Consumer Ethics\" essay and other essays in section\n4 of FES. On your view, what is the best approach to consuming (or not) things that are produced in ways\nthat are wrong?\n4. Industrial animal agriculture seems to pose a number of ethical problems. At least as it currently\nexists, it causes substantial suffering to non-human animals; it reduces quality of life for those engaged in it\nand/or those who live near it; it brings with it health risks to humans (e.g., resistance to antibiotics), and it\ncauses substantial pollution and environmental degradation. (See FES, \"Industrial Animal Agriculture,\"\n(pp. 322-341) and essays in section 7 and 8 of the text.) Do you think that any of these problems (or others\nyou identify) are sufficient to conclude that societies should not engage in industrial animal agriculture?\nWhat alternative(s) do you think are reasonable and morally justified, (considering not only the effects on\nnon-human animals)?\n\n24.03: Good Food\n10 April 2017\nYour Name: _______________________________\nTopic question - note that the topic must be in the form of a question (or sequence of questions). Be sure that your topic\nis well-enough defined that you can plausibly address the issue in a short paper. It is fine to make reference to particular\narticles or arguments we have discussed and consider or compare their strengths and weaknesses.\nThesis you hope to defend in response to the question.\nWhat is the main opposing position, i.e., the view you disagree with, that you will need to address in developing your\nargument?\nList 2-3 sources you will draw on in developing your argument (at least one should be a required or recommended reading\n- please mark those with a '*').\nOPTIONAL: Sketch the outline of your argument in defense of your thesis.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/be13470165ebe6335d5083ae94947961_MIT24_03_assignment1.pdf",
      "content": "In his essay, \"Famine, Affluence, and Morality,\" Singer argues that there is a close analogy between\nPOND and CHARITY (see p. 38 of FES).\n1. What are the relevant similarities between POND and CHARITY for the purposes of Singer's\nargument?\n2. Do you think that the analogy supports his conclusion? Why or why not?\n3. Suppose someone objected:\nBut in POND, there is one drowning child. In CHARITY, there are too many starving children to help\nby a single action, so I would have to give something additional up daily for my whole life. This is too\nmuch to ask.\nHow would Singer respond?"
    },
    {
      "category": "Resource",
      "title": "Paper 1 Revision",
      "type": "DOCX",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/b588e4d9ecb6aafad3318257a853cb08_24.03_paper_revision.docx",
      "content": "Paper 1 Revision\n\nSome notes:\n\n1. Revised papers are held to a higher standard than the originals. That means that no matter how well you did the first time around, if you do not make substantial improvements in your revision, your grade may not go up (it could even, in extreme cases, go down). Give your entire paper a pass to find ways you can make it more clear, more concise, and more compelling.\n\n2. Because you are being asked to do more, your revised paper may be slightly longer than your original one. But do not exceed 1 additional page. And before you add length, try to find ways to be more concise.\n\n3. If you have questions, contact Abby! aejaques@mit.edu"
    },
    {
      "category": "Assignment",
      "title": "Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/777219a6f129fa5b52dc87e216de8e43_MIT24_03_assignment2.pdf",
      "content": "Assignment on Flow: For the Love of Water\nScreened in Class 3/20/17\nAlso available on Amazon.com\n\nPlease write 250-500 words (total) on the following questions.\n\n1. Please describe one segment of or image from the film Flow that you found powerful. What\nmessage did you get from it?\n\n2. Please critically reflect on the message in your own terms. Do you see connections with\nreadings we have done so far on global justice, food security, food sovereignty, the social\nmeaning of food/water, capitalism, labor justice?\n\n3. If you were to teach someone something you learned from the film, what would you tell\nthem?"
    },
    {
      "category": "Assignment",
      "title": "Assignment 3: Activism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/ce3d3092cff2e898be6d32da17d4f352_24.03_Assignment_on_Activism.pdf",
      "content": "24.03: Good Food\n\n4/10/17\nHaslanger\n\nAssignment Three on Activism\n\nPlease write 250-500 words (total) on one of the following options (below). Assignments are due by\n11:59pm, Wednesday April 19. Please upload your answers to Stellar.\n\nOn April 18, there will be a Day of Engagement/Day of Action at MIT. http://dayofaction.mit.edu\n\nThe website calls for a \"renewed civic engagement among the scholars, students, and staff of our\ncommunity [and]...open-minded dialogue with peers and colleagues of diverse backgrounds and views.\"\nIn this day's events...we act to fulfill MIT's mission \"to bring knowledge to bear on the world's great\nchallenges.\"\n\nYou have three choices for your assignment:\n\nOption 1: Attend one or more of the events at the Day of Engagement/Day of Action and write a\nreflection on what you learned, or an evaluation of the presentation, workshop, or film. The schedule is\nhere: https://www.dayofaction.mit.edu/events (I believe more detail will be provided soon.)\n\nOption 2: If you are going to be participating in MIT's Day of Service on April 18, write a reflection on\nyour experience considering what you learned, what you contributed (or didn't), or your sense of the value\nof the organization you worked for.\n\nOption 3: Please read Brian Martin, \"Activism, Social and Political.\" (on Stellar) and reflect on the\nquestion: do we all have a moral responsibility to be engaged in activism in the current social context,\n(and if not all, then who)? You may consider activism on any topic, e.g., food security, animal welfare,\nLGBTQ rights, feminism, antiracism, smaller government, pro-life, pro-choice, prayer in public schools,\nor any other topic that matters to you."
    },
    {
      "category": "Resource",
      "title": "24.03 First Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/935e0e799eb4f3a776df6aae52f124af_24.03_firstpapertopics.pdf",
      "content": "First Paper Topics\nWrite a 5-page (1250 word) argumentative essay on one of the following topics. Guidelines\nand tips for papers are available on the Stellar site. Please submit your papers on Stellar.\nNote that your paper must articulate a thesis in response to the topic and defend the thesis with\nargument(s). At the top of the first page of your paper - above your title (if you have one)\nand your first paragraph - please state your thesis in bold. This is the claim that you are\narguing for in the rest of your paper. (You should also state the thesis in the body of your text.)\nPapers will be judged by (i) demonstrated understanding of the assigned texts and lectures, (ii)\nclarity of ideas and strength of arguments, and (iii) contribution to the debate. Enjoy!\n1. Banerjee and Duflo found that people who are very poor and hungry, if they come to have\nmarginally more resources, do not always choose simply to increase the number of calories\nconsumed; instead, they often choose tastier (but more expensive) foods. And people who do\nnot have enough to eat often go even hungrier in order to save up for things like televisions and\ncell phones. This suggests that for many people, merely having enough to eat is not better than\nremaining somewhat hungry but having a life that includes other goods as well. It may be that a\nlife worth living necessarily includes some amount of pleasure (from food or entertainment, for\nexample) and hope for a better future (which a phone, serving as a bridge to information and\neconomic possibilities, might also provide). This suggests that doing without tasty food,\nentertainment, etc is a very bad thing. Singer argues that if we can prevent something very bad\nfrom happening, without sacrificing anything morally significant, we ought to do it, and that\ntherefore we should all be doing much more to relieve famine. Does his argument also entail,\ngiven how many people do not have access to cell phones, televisions, and tasty food, that we\nshould all be making similar sacrifices to ensure that everyone has those things, in addition to\nnutrition and medical care sufficient for survival? Why or why not?\n2. Norman Borlaug, a Nobel Peace Prize winner and biologist who led the advances in food\nscience that enabled a massive increase in global food production, is credited with having saved\na billion lives through his work. His career began in 1942, and he continued working until his\ndeath in 2009. If we amortize the billion lives saved across that time, he saved a little more than\n28 lives per minute, every minute, for 67 years. (This figure is not ideal for our purposes,\nbecause it does not include deductions for any time off, even for sleep. The number of lives he\nsaved for every working hour will be noticeably higher. But you get the idea.) If stopping to save\na drowning child would take him 2 minutes, but he would have saved (well over) 56 lives by\nworking during those two minutes instead, should Borlaug ignore the drowning child? Why or\nwhy not? What would Singer say? Why might someone think that even Norman Borlaug is doing\nsomething wrong if he ignores the child? What does this tell you about POND?\n3. What is the \"Singer Solution to World Poverty\"? And why does Kuper think it is committed to\n\"a dangerously individualist 'practical ethics'\"? Explain, in your own words, Kuper's criticism of\nthe \"Singer Solution\" and the corresponding 'individualist' ethics. Is Kuper's criticism correct?\n\n[Note that just saying that more and different things could also be done to prevent hunger is not\nsufficient to criticize Singer's view.] Explain why or why not.\n4. Marilyn Frye claims, in her essay \"Oppression,\" that:\nThe experience of oppressed people is that the living of one's life is confined and shaped by\nforces and barriers which are not accidental or occasional and hence avoidable, but are\nsystematically related to each other in such a way as to catch one between and among them\nand restrict or penalize motion in any direction. It is the experience of being caged in: all\navenues, in every direction, are blocked or booby trapped. (See handout for class 2/27 and for\nFrye's whole essay, see recommended readings.)\nDrawing on Young's essay, critically evaluate her analogy: (i) What about oppression is\nsupposed to be similar to a birdcage? (ii) What is this similarity supposed to reveal to us about\noppression? (iii) How well does the analogy work? Are there ways in which the analogy is\nmisleading or incorrect? Can you suggest a different characterization of oppression (either an\nanalogy, or definition, or general description)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Consumer Ethics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/e9333b2dfecccbd804ab9a7f9d0f9128_MIT24_03S17_lec18.pdf",
      "content": "24.03: Good Food\n4/19/17\nConsumer Ethics (2)\n1. Intro\nSuppose you learn that a product has been produced under morally problematic conditions. What should\nyou do? YOU aren't causing pain to or killing animals. YOU aren't exploiting slaughterhouse workers or\npolluting the rivers with pesticides. So should you adjust your behavior? If so, what is the principle that\nyou should rely on in judging what to do?\nCompare:\n- The NCAA exploits college students. Should we watch college basketball, attend games, etc.?\n- After a party an extra plate of cold cuts is left over. It is in perfect condition. Is there any reason\nnot to eat it?\n- The electrical company in your town relies on coal to produce power. The result is terrible air\npollution. Should you go without electricity?\nThink through the models we have for making moral judgments:\nEfficacy/Inefficacy issues? Does it really matter what an individual decides to do?\nHow do we calculate the expected consequences of an action? (See p. 173)\nAre consequences all that matter?\n2. Threshold effects and supply chains\nMany have pointed out that it is very unlikely that a single individual's decision to become vegetarian (or\nvegan) will make a difference to the suffering and/or death of non-human animals. There is plenty of\n\"slack\" in the system to accommodate the \"waste\" of a few animals.\nBut what about threshold effects? Singer and others have argued that even if your decision is not likely to\nmatter, there is a chance that it will matter. For example, there is \"threshold\" at which a meat producing\nenterprise will cut down the amount it produces in response to consumer demand. How do you know\nthat your decision is the one that makes the difference? Or more plausibly, shouldn't we calculate the\nconsequences of your decision taking into account the chances that your decision will matter?\n3. Practical rationality and expected consequences\nJust to get the hang of this, suppose that you are facing a decision \"under conditions of uncertainty\":\nsuppose the question is whether to take an umbrella or not, on a day when the chance of rain is one half.\nSince the value of taking as opposed to leaving the umbrella will be different depending on whether or not\nit rains, we might start out by listing all the possible scenarios, and how well things work out for us in all of\nthem. There are four:\n- Take it and it rains\n- Take it and it doesn't rain\n- Leave it and it rains\n- Leave it and it doesn't rain\nHow should we decide? Here's a proposal:\nPractical Rationality Principle: The practically rational thing to do is the thing with the highest expected\nvalue, where the expected value (x) = the sum of the values of the various possible outcomes that x could\ngive rise to, weighted according to their probabilities.\nShould I take an umbrella along to class on a day when the chance of rain is 50%?\nHaslanger\n\n24.03: Good Food\n4/19/17\nProbability\n.50\n.50\nPossibilities\nRain\nDry\nExpected Value\nTake\n-4\n3 ♥\nLeave\n-20\n-9\nExpected value of TAKE\n= value of taking if rain x chance of rain + value of taking if dry x chance of dry\n= 10 x .50 + -4 x .50 = 3\nExpected value of LEAVE\n= value of leaving if rain x chance of rain + value of leaving if dry x chance of dry\n= -20 x .50 + 2 x .50 = -9.\nThis suggests you should take the umbrella. But if the probability of rain is different, (or the values you\nassign to the possible outcomes) you could reach a different result. E.g., if the probability of rain is only\n10%:\nEV(TAKE)= 1 + 3.6 = -2.6\nEV (LEAVE)= -2 + 1.8 = -.2 -\nHow is this relevant in the case of, say, the decision to purchase meat? It may be a low probability that\nyour choice will make a difference, but the outcome, if it does, may be significant. It may be, for example,\nthat your decision occurs at a tipping point, so that along with others' choices to be vegetarian, the day\ncomes when a slaughterhouse becomes unprofitable and so closes. The chances are low, but the good\noutcomes, one might think, are huge.\nProbability\n.001\n.999\nPossibilities\nCloses\nStays open\nExpected Value\nGo Veg\n1,000,000\n-1\n~999\nStay Omnivore\n-20\n-9 ♥\nIt looks like even if there is a small chance of making a big difference, the practically rational thing to is go\nvegetarian!\nIn the readings, however, there seems to be some doubt about whether this is the right approach by\nemphasizing that we know how supply chains work. E.g., Budolfson argues that \"the problem with [this\nsort of] reasoning is that we can know enough about the supply chains...to know that threshold effects are\nnot sufficiently likely and are not of sufficient magnitude to drive the expected effect of consumption\nanywhere close to the average effect....we might call that mistake the \"Average Effects Fallacy.\" Do you\nfind that argument convincing?\n4. Group Harm\nMcPherson argues that there is a further way of thinking about the wrong of meat eating, even if the\nexpected consequences argument doesn't work. Here is the principle:\nGROUP HARM: If one can avoid being part of a group that together does serious wrong, then one acts\nwrongly by continuing to be a member of that group. (FES 198)\nHaslanger\n\n24.03: Good Food\n4/19/17\nApplication to the case at hand: If omnivores, as a group, do wrong, then one acts wrongly by continuing\nto be an omnivore.\n5. Complicity\nANTI-COMPLICITY: It is typically wrong to aim to benefit by cooperating with the wrongful elements\nof others' plans. (FES 199)\nCan you think of an example that demonstrates this? Is it wrong even if your involvement in the other's\nplans make no difference to the harm that is caused, e.g., if the wrong is \"demand-insensitive\"?\n6. Kantianism/Deontology\nIs there a way to apply Korsgaard's Kantian argument to draw consequences for consumer ethics? All\nconsumer ethics, or only ethics concerning vegetarianism/veganism? What about sweatshop labor?\nOther labor practices?\n7. Virtue Ethics\nRecall the discussion of social meaning (see handout from 3/6/17 on \"Food and Social Meaning\" and\n3/8/17 on \"Religion, Virtue, Food\"). How do our consumer choices convey our values? What values\ndoes the purchase of meat convey? Does it really convey a disrespect for animals?\nHaslanger\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Genetically Modified Organisms",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/94047b7ea208b16cf7e0cd76357ec181_MIT24_03S17_lec24.pdf",
      "content": "24.03: Good Food\n10 May 2017\nGenetically Modified Organisms (GMOs): Good, Bad, or ???\nHow do we engage in discussion with others who disagree with us? How do we engage in discussion with\nthe scientifically illiterate? The discussion of GMOs seems especially challenging. Why?\nTo some extent, it is a product of our political culture. There is often little critical scrutiny of the\nissues within a particular \"tribe.\" For example, just as many on the political right discount the\nbroad scientific consensus that human activities contribute to global warming, many on the left\ndisregard the decades of scientific studies demonstrating the safety and wide-reaching benefits of\nGE crops.\nBoth the left and the right (and the center) discard reason when it doesn't suit their politics.\n(Ronald, FES 451)\nHow might we undertake constructive discussion with those who disagree with us, or when we are\nuncertain of the right conclusion?\n1. Why are GMOs an issue? (Clarify the issue)\n- Is the question a matter of individual choice (what should I eat?), or education (should GMOs be\nlabeled?), or broad policy (should GMOs be banned, or regulated, or ??)?\n- Is the question about the existing GMO system, or about any GMO system, even under more\nideal conditions?\n2. What are GMOs? (Agree on definitions)\n- Are there multiple definitions? Why? (Do different stakeholders give different definitions?)\n- Are there terms within the definition that need to be defined?\n- How do we decide between the different definitions?\n- What is at stake in giving a definition?\nFor example: Definitions from, e.g., Wikipedia:\nA genetically modified organism (GMO) is an organism whose genetic material has been altered\nusing genetic engineering techniques. Genetic engineering, also called genetic modification, is the direct\nmanipulation of an organism's genome using biotechnology.\nBiotechnology is generally accepted as the use of living systems and organisms to develop or make useful\nproducts. For thousands of years, humankind has used biotechnology in agriculture, food production and\nmedicine.[1] The term itself is largely believed to have been coined in 1919 by Hungarian engineer Karl\nEreky. In the late 20th and early 21st century, biotechnology has expanded to include new and diverse\nsciences such as genomics, recombinant gene technologies, applied immunology, and development of\npharmaceutical therapies and diagnostic tests.[2].\n3. Who are the stakeholders in the development, consumption and critique of GMOs? (Identify the\ncommunity of stakeholders)\n4. What is at issue between these stakeholders? What are their different claims? (Identify conjectures and\ndisagreements)\n- Are there errors and misunderstandings that might be corrected?\n- Are some stakeholders better positioned to have the relevant knowledge?\nSome considerations against (but remember...these must be evaluated in relation to the issues defined in\n(1)):\nHaslanger\n\n24.03: Good Food\n10 May 2017\na) GMOs may not be safe.\nb) GMOs are not adequately tested.\nc) GMOs may be environmentally risky.\nd) The companies and university scientists developing GMOs are not to be trusted.\ne) GMOs are not sustainable.\nf) Resistance to GMOs is politically important way to protest rampant capitalism, globalization,\ncorporate greed, the decline of rural communities, etc.\ng) Other??\nSome considerations for:\na-b) Many GMOs have been tested extensively; although they are not a \"testable class,\" we can test\nthem individually.\nc) There are ways to regulate the use of GMOs to address risks of environmental impact; not using\nGMOs in many cases causes other environmental hazards.\nd) This is too broad a claim - many companies and scientists are trustworthy. But it is true that\nmany are just out to \"make a buck,\" including apparently benign companies like Whole Foods.\ne) This needs to be elaborated, but there is a risk of \"super bugs\" and \"super weeds\" that are\nherbicide and pesticide resistant. This is a risk for any farmer that relies on a single\nherbicide/pesticide, and might be managed by deploying a \"refuge strategy\" (FES, 450) in crop\nmanagement (not relying on monocultures and creating spaces where insects can find refuge from\nthe insecticide).\nf) It will be difficult to feed the hungry around the globe, especially given expected climate change,\nunless we invest in GMOs. Also, some GMOs can make a huge difference to the health of a\npopulation, e.g., golden rice.\ng) Other??\n5. On what points (if any) do the stakeholders agree and disagree? (Find common ground)\n- Can we use points of agreement to settle disagreements?\n- Are there some disagreements that will be intractable? Why?\n- Should we focus on debates between only a subset of the stakeholders? Which ones? Why?\n6. How should we determine the value of GMOs? (Identify what matters, any competing values)\n- What values should guide our evaluation of the positions?\n- Are there shared values to rely on?\n- If there aren't shared values, how might we defend the values we will employ against our\nopponents' values?\n7. What policy should be endorsed? (Policy)\n- Based on our evaluation of GMOs, what policies should be put in place?\n- How does individual preference based on individual values relate to public policy?\nHaslanger\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Industrial Plant Agriculture",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/4098d302271473230e7d522bf3b5e719_MIT24_03S17_lec20.pdf",
      "content": "24.03: Good Food\nMay 1, 2017\nIndustrial Plant Agriculture: Weighing Values?\n1. Terms and Questions\nAs the textbook suggests, the current state of industrial plant agriculture (IPA) involves:\n- Large farms that mainly raise monocultures using methods of highly mechanized production;\n- Substantial reliance on synthetic herbicides, fungicides, pesticides, fertilizer, and large irrigation\nsystems;\n- Embrace of increasing number of GMOs;\n- Long-distance transportation of yield and trade in relatively unregulated global marketplace, i.e.,\nunder neo-liberal policies.\nNote that industrial plant agriculture may involve more or less of each factor, e.g., plausibly one would\nstill have industrial agriculture without the use of GMOs, or where the global marketplace was highly\nregulated. So we might want to distinguish: actual IPA, and ideal IPA. In considering ideal IPA,\nhowever, we should bear in mind what is actually feasible in the world as it currently exists.\nHere are some questions:\n1) Is actual IPA morally required as the primary mode of agricultural production?\n2) Is actual IPA morally permissible as the primary mode of agricultural production?\n3) Is it morally permissible to include actual IPA as part of a global system of food production?\n4) What would ideal IPA look like? Would ideal IPA be morally required/permissible?\nLet's begin by brainstorming some of the morally relevant factors answering these questions. To start\n(let's elaborate each, considering both +/-):\n- Global hunger/famine\n- Environmental degradation/sustainability\n- Health impacts of synthetic pesticides (etc.)\n- Economic justice\n- Well-being of future generations (imposing risks)\n- Regulatory interventions and state responsibilities, e.g., for education, solving coordination\nproblems.\n- Human rights to procreate, to engage in local cultural practices and traditions, etc.\nAs the textbook introduction to the issues makes clear, there are both empirical questions and normative\nquestions to consider. But even if we can't completely settle the empirical questions, we should also\nconsider the risks involved.\n2. Future Generations and the Identity Problem\nA major challenge in weighing the factors at stake is how to take risk into account, i.e., how to make a\nmoral decision under conditions of substantial uncertainty. Another is how to consider the impact on\nfuture generations. Let's consider the latter in a bit more detail by exploring the non-identity problem. It\nis usually introduced with a version of this example:\nPregnancy Choice: A couple is deciding whether or not to conceive a child. The doctor tells them that,\ndue to a medication the woman is currently taking, if they conceive now, the child will suffer a medical\ncondition that will sometimes cause a mild discomfort and a premature death at 40. However, if she stops\ntaking the medication and waits a month for it to clear her system before conceiving, she will conceive a\nhealthy child who can be expected to live an average lifespan. Either way, the child's life will (as a whole)\nbe a life worth living.\n\n24.03: Good Food\nMay 1, 2017\nWhat should she do? Most people say that she should wait a month. Why?\nNote, however, that if the woman had waited a month before conceiving, she would have conceived a\ndifferent child. In other words, the unhealthy child would not have existed if the woman had waited\nanother month to conceive. So, the two alternatives for the unhealthy child are either (a) a good life that is\ncut short, or (b) no life at all. Surely a good life that is cut short is better than no life at all. So, it seems that\nthe woman has not harmed the \"unhealthy\" child by deciding not to wait a month before conceiving.\nNotice that a similar argument can be developed regarding environmental degradation (see FES, p. 423).1\nLet \"Depletion\" be a set of policies that \"makes our lives better in the present but at the cost of making\nthe lives of future people significantly worse.\" (423)\n1. Depletion does not make future generations worse off than they otherwise would have been.\n2. An act harms someone if and only if it causes them to be worse off than they otherwise would have\nbeen.\n3. Therefore, depletion does not harm future generations.\n4. Depletion benefits presently existing people, and harms no one.\n5. Any action that harms no one, and benefits some, is not wrong.\n6. Therefore, depletion is not wrong.\nNotice the conflicting principles that seem to be at issue here:\nA. An act can be wrong only if it makes someone (presently existing, or someone in the future) worse off.\nB. Making it the case that someone's life is not ideal, but is still better than not existing at all, is not a way\nof harming them or making them worse off.\nC. In some cases we do wrong, even if we don't make someone worse off. More generally, some possible\nscenarios are morally worse than others, even though there is no one for whom that scenario is worse.\nWhich principle (A, B, C) would you reject?\n1 See also the Stanford Encyclopedia of Philosophy article on the Non-Identity Problem, and Chad Vance's handout\nhere: http://rintintin.colorado.edu/~vancecd/phil3140/nonid.pdf\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Is it Bad to Kill Animals?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/478488dfc82fcb03f66657cac36603c1_MIT24_03S17_lec17.pdf",
      "content": "24.03: Good Food\n4/10/17\nIs it Bad to Kill Animals?\nI. The duty to eat our friends\nIn his essay, \"Eating our Friends,\" Roger Scruton argues that we may agree that the current system of\nindustrial animal agriculture is morally problematic because of the pain and suffering it causes to non\nhuman animals. However, suggests that we are not only allowed to eat meat, raised humanely, but may\neven have a duty to do so.\nIn support of his claim that we are morally permitted to eat animals that are raised and killed humanely,\nhe claims that for cattle:\nTo be killed at 30 months is not intrinsically more tragic than to be killed at 40, or 50, or 60. And\nif the meat is at its best after 30 months, and if every month thereafter represents an economic\nloss, who will blame the farmer for choosing so early a death? In doing so he merely reflects the\nchoice of the consumer, upon whose desires the whole trade in meat, and therefore the very\nexistence of his animals, depends. (392-3)\nBut he goes beyond this to argue that humane animal husbandry is \"a complex moral good.\" (393)\nAnimal farming is \"one of the kindest uses of land yet devised,\" and \"\n...the result of raising animals [traditionally, humanely] will change the character of meat-eating,\nwhich will become not only more expensive, but more ceremonial...The animal brought to the\ntable will have enjoyed the friendship and protection of the one who nurtured him, and his death\nwill be like the ritual sacrifices described in the Bible and Homeric literature - a singling out of a\nvictim for an important office to which a kind of honor is attached. Such it seems to me would be\nthe life of the virtuous carnivore, the one who is prepared to eat only his friends. (393)\nHe goes on to suggest that virtuous carnivorism will be more effective in changing farming practices than\nvegetarianism. \"...I would suggest not only that it is permissible for those who care about animals to eat\nmeat; they have a duty to do so.\" (394) Why? Conscientious carnivores can exert more pressure on those\nengaged in meat production to do so only through humane practices.\nII. The Surprising Claim:\nElizabeth Harman argues against \"The Surprising Claim\" (396):\n(a) We have strong reasons not to cause intense pain to animals: the fact that an action would cause\nintense pain to an animal makes the action wrong unless it is justified by other considerations; and\n(b) We do not have strong reasons not to kill animals: it is not the case that killing an animal is wrong\nunless it is justified by other considerations.\n[Note that in Harman, 'animals' sometimes seems to mean non-human animals, and sometimes animals\ngenerally.]\nA. Argument against the Surprising Claim (397):\n1. If it is true that we have strong moral reasons against causing intense pain to animals, such that doing\nso is impermissible unless justified by other considerations, then part of the explanation of this truth is that\nanimals have moral status.\n2. If it is true that we have strong moral reasons against causing intense pain to animals, such that doing\nso is impermissible unless justified by other considerations, then part of the explanation of this truth is that\nsignificantly harming something with moral status is impermissible unless justified by other considerations.\n3. If an action painlessly kills a healthy animal in the prime of life, then that action significantly harms the\nanimal.\n\n24.03: Good Food\n4/10/17\n4. If it is true that we have strong moral reasons against causing pain to animals, such that doing so is\nimpermissible unless justified other considerations then painlessly killing a healthy animal in the prime of\nlife is impermissible unless justified by other considerations (1,2,3).\n5. Therefore, the Surprising Claim is false (4).\nResponse 1 (728): Death is bad for an animal. But it doesn't harm an animal to kill it (painlessly) after a\nlife in which the animal is well cared for, because one does not harm someone by depriving him/her/it of\nsomething good.\n- What is it to harm something? Note the difference between harming and failing to benefit.\n- Is harming something just a matter of causing that thing bad experiences?\n- \"Actively and physically interfering with [an animal] in such a way that [it] is deprived of a\nbenefit does typically harm that [animal]. (398)\n- When is the animal harmed, if painlessly caused to die?\nResponse 2 (398):\n(i) The death of a person is bad for her only because it frustrates her desires and plans for the future.\n(ii) Therefore, death is bad in general only because it frustrates desires and plans.\n(iii) Animals do not have desires and plans for the future.\n(iv) Therefore, animals' deaths are not bad for them.\nProblem: (i) is false because someone's future may be good for him/her/it, even if he/she/it doesn't have\nplans and desires for it. (398-9)\nResponse 3 (399):\nIt is true that animal pain matters morally. But it is a mistake to conclude that this is because animals have\nmoral status. Rather, animals lack moral status. But stages of animals have moral status. Animal pain\nmatters morally because an animal stage is in pain. What is better or worse for the animal does not matter\nmorally, though what is better or worse for stages of it does.\n- This view is implausible. When we perform painful surgery on an animal, we cause discomfort to\nstages of the animal for the sake of the whole. This is what justifies the surgery. We are not\npermitted to cause pain to one morally significant being for the sake of others. But we are justified\nin causing pain to one stage of an individual for the sake of her long term good.\nResponse 4 (401): McMahon's \"Time Relative Interests View\"\nWe have strong reasons against causing animal pain, and we have some reasons against painlessly killing\nanimals in the prime of life, but these reasons are weakened by animals' lack of deep psychological\ncontinuity over time. On this view, we may have weak reasons not to kill animals, but not strong ones.\nProblem: the fact that non-human animals have a weak connect to their futures does not show that they\ndon't have an interest in a long and healthy future. Consider the examples of Billy and Tommy: we\nshould perform surgery on animals - even painful surgery - that will enable them to live a longer healthy\nlife. Why would this be the case if killing them now is permissible and doesn't harm them?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Locavorism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/8804f53b49b24541602cb9da0f4b3749_MIT24_03S17_lec23.pdf",
      "content": "24.03: Good Food\n8 May 2017\nLocavorism\n1. Basic questions\n(i) What moral considerations should we bring to bear on our food choices, as individuals?\n(ii) How should we organize ourselves socially and politically to produce and consume food in a way that\nis just?\nFactors to consider (others??):\nHuman health & nutrition\nGlobal justice (global hunger, exploitation)\nEnvironmental impact, sustainability\nCultural meanings, community\nAnimal well-being\nAesthetic concerns\nFair labor practices\nProsperity\n1. Locavorism: What is it?\na) \"...the idea that an ever-growing portion of our food supply should be produced in close proximity to the\nconsumers who will eat it.\" (Desrochers and Shimizu 2012, 4; all references in parentheses below are to this\nbook; those indicated FES are to Helena de Bres's article.)\nb) The idea that the food we eat should be indigenous to the region. (6)\nc) The attitude that \"...local food is...desirable simply because of its geographical origin and is not more affordable,\nnutritious, safer, or better tasting than alternatives produced further away.\" (13)\nQuestions:\n-\nAre these adequate definitions? How could they be improved?\n-\nWhat is the most plausible/charitable version of locavorism?\no\nDistinguish radical locavorism from moderate locavorism. (FES, 497)\nPossibly:\nd) Consumers should choose to purchase food grown and processed locally, if the climate supports such crops,\nand should limit the food they purchase requiring significant transportation and energy expenditure.\n2. Arguments in favor of locavorism:\nMost seem to have the form:\n1) Buying local food is better for ______ [the economy, the environment, our health, our community....], than\nbuying non-local food.\n2) We are morally required to do what is best for ________.\nConclusion: We are morally required to buy local food in preference to non-local food.\nNote that even if premise (1) is true, the normative premise (2) is very strong: it says what we are required to do,\nnot just what is permissible or good to do. None of the arguments seem to provide a basis for a radical locavorism\nthat requires one to buy only local food at all times. Are there reasons to draw a more moderate conclusion?\nConsider:\nEconomic (7, FES 500)\nTaste, Nutrition and Safety (9, FES 499-500)\nEnvironmental (7, FES 498-99)\nSocial (6), Agrarian (FES 500-505)\nSecurity (8)\nPolitical (FES 505-506)\n3. Against Locavorism\nDesrochers and Shimizu's main claims:\n\n24.03: Good Food\n8 May 2017\n\"If widely adopted, either voluntarily or through political mandates, locavorism can only result in higher costs and\nincreased poverty, greater food insecurity, less food safety, and much more significant environmental damage than is presently the\ncase.\" (14)\n\"Only through greater technological advances, economies of scale and international trade can we achieve the\nlocavores' worthy goals of improving nutrition while diminishing the environmental impact of agricultural\nproduction.\" (14)\n\"...buying or abstaining from buying local food should be a shopping decision, not a moral or political one.\" (15)\n\"Getting the most for your hard-earned dollar is not only enlightened self-interest, but also the best way to\ncreate a better world.\" (15)\nWhat is \"enlightened self-interest\"? What is the relationship between morality and enlightened self-interest?\nIII. A variety of arguments\nProsperity argument: \"...all economically prosperous episodes in human history have been characterized to one\ndegree or another by the expansion of a community's food provisioning.\" (18)\n-\nProsperity and economic growth depends on cities: they produce \"concentrated markets for rural\ngoods,\" \"technological innovations,\" and capital for rural development (22).\n-\nUrbanization is impossible without food imports (22).\n-\nUrban food producers have been increasingly distant from urban centers due to increasing land value,\nbetter transportation and preservation technology and health reasons (24).\nCultural Argument: Humans have always traded foods and recipes, and this is how cultures have flourished. (6,\n19, 25)\nEfficiency Argument: Agricultural areas should be devoted to producing the food that their soil and climate best\nsupports. (26)\nHealth Argument: \"In the last two centuries...consumers went from shopping in \"dry goods\" stores to the\n\"permanent summertime\" produce sections of progressively larger supermarkets whose ever expanding range\nof offerings have become only safer, healthier, and considerably more affordable.\" (29)\nFood Security Argument: \"Perhaps most remarkable...has been humanity's capacity to nearly defeat famine and\nhunger.\" (29)\nCritique of Suspicion: \"Historically, the push for greater agricultural self-sufficiency was never limited to political\nand military leaders bent on imperialistic pursuits, but also often included a fair number of romantic\nideologues, politically connected nationalists, supporters of \"good old\" and \"small is beautiful\" ways...\" (31)\n- note what they are asking: in whose interests is the recommendation that we should buy local food? What\nidea/symbol/meaning is being sold in addition to the food? (This critique of suspicion is also evident in the\nIntroduction where they discuss the claim that \"SOLE is essentially a fad promoted by bicoastal urban \"agri\nintellectuals\" whose knowledge of and practical experience with food production is limited to the world of\nhobby gardening...\" (9))\nHistorical argument: Buy/grow local food has been tried before and was not successful. (35-40) \"...the fact\nremains that none of [the past attempts] lasted once more people had more options available to them. (39)\nQuestions:\n1) De Bres says that \"you need to ask yourself some questions about your own values, attachments, and\npriorities.\" (506). Are there particular values, etc. such that, if you adopt them, you should be a moderate\nlocavore? Which ones?\n2) Desrochers and Shimizu seem to suggest that they agree with locavores on the moral and political objectives\nand simply disagree on how to achieve them. Do you agree? Are there moral and/or political differences too?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Three Moral Theories",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/7140ce8c933049452724b1bc75683ba3_MIT24_03S17_lec03.pdf",
      "content": "24.03: Good Food\nFebruary 13, 2017\nThree Moral Theories\nI. Introduction\nHere are five questions we might want an ethical theory to answer for us:\ni)\nWhich acts are right and which are wrong? Which acts ought we to perform (understanding the\n\"ought\" as a moral \"ought\")?\na. Who is part of our moral community? Towards whom (or what) do we have moral duties and\nobligations? (Some/all other humans? Animals? Ecological systems? Androids/computers?)\nb. How do moral 'oughts' interact with other reasons for action? Do they always \"trump\" other\nreasons?\nii)\nWhat makes a particular action right or wrong?\nstatus?\nWhat is it about the action that determines its moral\niii)\nHow do we know what is right and wrong?\niv)\nWhat, if anything, motivates us to do what is right?\nNormative ethics: addresses \"first-order\" questions about our moral lives, questions about what morality\nrequires/permits us to do, and what is morally valuable. E.g. should we be vegetarians? Is euthanasia\npermissible? Is it (morally) good to devote oneself to a life of pleasure?\nMeta-ethics: addresses questions about first-order (normative) ethical judgments, e.g., about the nature of\nmorality; the meaning of moral talk; whether morality is absolute or relative; whether moral judgments can\nbe true or false (objective) or merely subjective, how we can have knowledge of moral truth.\nII. The Big Three\n1. Consequentialism: focus is on consequences of action.\nOne version of consequentialism is Utilitarianism (Mill):\nGreatest Happiness Principle: ...actions are right in proportion as they tend to promote happiness,\nwrong as they tend to produce the reverse of happiness.\nOr as contemporary moral theorists state it:\nYou ought always to act so as to maximize happiness, i.e., the right act is the act that results in the\ngreatest amount of happiness overall.\n2. Deontology (Kant): focus is on moral rules or reasons.\nCategorical Imperative (version 1: Principle of Universal Law): Act only on that maxim whereby\nthou canst at the same time will that it should become a universal law.\nCategorical Imperative (version 2: Principle of Humanity) So act that you use humanity, whether in\nthine own person or in that of any other, in every case as an end withal, never as a means only.\nIn more contemporary terms:\nYou are No Exception Principle (YANE): \"...in whatever you do, you should act for reasons that\ncould serve as acceptable reasons for everyone.\" (Sayre-McCord, 5)\nand\nRespect for Persons Principle (RPP): In all action one should respect others as sources of value and\nnever merely as an instrument for one's own purposes. (Sayre-McCord, 7)\n\n24.03: Good Food\nFebruary 13, 2017\n3. Virtue Ethics (Aristotle): focus is on character.\nVirtue (excellence), then, is (a) a state of character concerned with choice, (b) lying in a mean, (c)\nthe mean relative to us, (d) this being determined by a rational principle, (e) and by that principle by\nwhich the man of practical wisdom would determine it. (Nich. Ethics 1106b36-1107a2)\nIn simpler terms:\nAn action is right insofar as it is the manifestation of a virtuous character trait, where virtuous\ncharacter traits are those that are present in the fully flourishing human being.\nIII. Utilitarianism (a version of consequentialism)\nIn developing a theory of right and wrong, utilitarians begin by asking what, if anything, is good in and of\nitself, something that is not merely instrumentally good--as a means to some other good--but is good per se.\nThey answer this question by looking at the structure of human desire, what it is that (well-informed) people\nultimately aim for in action. The idea is that once we understand what this good is, the right act is the one\nthat promotes the maximum amount of it.\nSo what is the ultimate good? We considered several possibilities in the first section of the course on\ngoodness (or welfare). Mill, however, proposes that happiness is the greatest good. Suppose he's right. It\nwould seem then that the more happiness the better--if it is good for me to be happy, it's even better if I'm\nhappy and others are too; and then it seems that if happiness is really what's important, then in order to\npromote the good we ought simply to aim to bring about the greatest amount of happiness. Our own\nhappiness is a fine thing, but it's no more valuable than someone else's happiness--it's the total amount of\nhappiness that matters. Thinking along these lines leads to the Utilitarian or \"greatest-happiness\" principle.\nObjections:\n- What utilitarianism says is right/wrong conflicts with ordinary moral judgments, e.g., promise keeping,\nnot punishing the innocent.\n- Utilitarian thinking doesn't respect ordinary moral distinctions, e.g., between killing and letting die,\nharming and failing to help.\n- Utilitarianism is too demanding: every decision and every action has to be morally evaluated for its\nconsequences.\n- Utilitarianism is not demanding enough: sometimes reasons or motivations for acting seem relevant to\nmoral appraisal, not just the consequences; but utilitarianism doesn't care about what comes before the\naction except insofar as it has good or bad consequences.\nUseful distinctions for the utilitarian:\n- Direct vs. indirect effects.\n- An action's being right/wrong vs. an action's being praiseworthy/blameworthy\nIV. Deontology (Kantianism)\nThe most important alternative to utilitarianism, historically speaking, derives from the work of Immanuel\nKant (1724-1804), and so predictably is called a Kantian approach, or sometimes a deontological approach.\nAt the core of Kant's ethics is a principle known as the Categorical Imperative (CI) which Kant states in\ndifferent ways.\nOne interpretation of the CI is the \"You are No Exception Principle.\" (YANE) It does seem to be ubiquitous\nin moral life. We generally think it is wrong to do something that we know would be problematic if\neveryone else did it too, e.g., cheating on an exam, removing a pollution control device from a car, stealing a\nbook from the bookstore. In each of these cases the agent's goals could not be achieved if everyone else did\nthe same thing, so the success of the action depends on making a distinction between what the agent does and\nwhat others do. But making oneself an exception this way seems wrong. Kant thought that in cases like this\nthere was a sort of inconsistency.\n\n24.03: Good Food\nFebruary 13, 2017\nThe idea is that in any intentional action, I am implicitly or explicitly acting on a principle of some kind.\nConsider two shopkeepers, both of whom are committed to giving correct change to their customers. They\nact, however, on different principles, or what Kant called \"maxims\":\nMr. Practical:\nWhen I can gain a good business reputation by giving correct change, I shall give correct\nchange.\nMr. Righteous:\nWhen I can perform a morally right act by giving correct change, I shall give correct\nchange.\nIn each case there is a generalized form of the maxim of the form:\nGeneral Form:\nWhenever one is ________, he/she shall ________.\nOn Kant's view, what matters in evaluating an action is not the consequences, but the principle that is\nemployed in intending or willing. Two individuals can do the same thing, but one of them do wrong and the\nother right, depending on what they will. Some maxims fail the test, so the corresponding action is immoral,\ne.g., (in generalized form):\nWhenever one has an exam and doesn't feel like studying, she shall copy off of her neighbor's work.\nPresumably we could not all act on this maxim, for if we are all planning to copy off each other, there will be\nno work to copy! The underlying rationale for an approach such as this is to show that the source of morality\nis in reason or rationality; those who are immoral are in some important sense acting irrationally. On this\nview, we don't ground morality in God's will, or in the seemingly arbitrary moral codes of particular cultures.\nMorality is grounded in reason itself, and the demands of morality can be discovered through rational\nreflection.\nObjections:\n- It appears in many cases that one can adjust the statement of the maxim so that the problem disappears,\ne.g., consider the maxim: whenever one has an exam and doesn't feel like studying, and everyone else is\nwell-prepared, and she can do it without being caught, she shall copy off her neighbor's work.\n- In some cases a maxim cannot be generalized, but its failure is not due to moral factors. E.g., consider a\nperson who decides to withdraw all his money from the bank as soon as the Dow Jones reaches a certain\nnumber...x. This maxim would not be one that everyone could act upon, but not due to constraints on\nmorality.\nConsider another formulation of the CI drawing on the \"Respect for Persons Principle\" (RPP). This principle\nallows that we can use others as a means to accomplish our own ends; after all, we rely crucially on others all\nthe time. You rely on your professors to teach you things--we serve as a means to your ends of gaining\nknowledge. But these are cases in which there is consent--your professors aren't deceived or coerced into\nserving your needs. According to the (RPP), cheating on your final would be wrong because you would be\nusing me (or your TA) as a mere means to a good grade: you would be involving us in a scheme whereby\nyou would get a good grade, but it would be a scheme that we would not--or better: could not reasonably--\nconsent to.\nOn this view the Kantian picture has a strong negative component comprising the duty of justice: Don't treat\nothers as a mere means. And a positive component comprising the duty of beneficence: As far as possible\ntreat others as ends in themselves, i.e., as a rational person with his or her own aims, objectives, goals,\nconceptions of the good, etc.\nObjections:\n- It is a difficult and complicated matter to figure out how to help others achieve their own ends. We can't\nprovide them with everything they need or want. How much is enough?\n- How is it a demand of rationality that we respect others as ends in themselves (remember that Kant\nwanted to ground morality in reason itself)? What justifies this account of morality?\n\n24.03: Good Food\nFebruary 13, 2017\nTo summarize, on the Kantian view (in contrast to utilitarianism):\n-\nThe focus of moral evaluation is the maxim or principle implicit in the act, not the results. A good action\nmight have bad results and vv.\n-\nActs can't be ranked on an order of merit.\n-\nThe theory works well when information is scarce. Utilitarian calculations require a lot of data in order\nto make plausible predictions about consequences. But because it is usually clear when an action would\nuse another as a mere means (in contrast to what would promote human happiness overall), a Kantian\nview doesn't require that we have as much knowledge in order to determine what is right or wrong.\nV. Virtue Theory\nThere seem to be three components of any action:\na) The person who performs the action\nb) The action itself\nc) Consequences that result from the action\nTo determine the moral status of an action, utilitarianism has us look at (c), deontology (b), and virtue theory\n(a). What matters for virtue theory, more specifically, is the character of the agent.\nFor example, suppose your friend is struggling in 8.01 and the course is a breeze for you. Your friend asks\nfor help with the material. You, however, want to watch Heroes. What should you do? According to the\nutilitarian, you should consider the likely consequences: overall it will bring about more happiness in the\nworld if your friend does well in 8.01 than if you watch Heroes right now. According to the deontologist,\nyou should consider the maxim of your action: helping others when it is of little cost to you is\nuniversalizable, and respects your friend's ends. Suppose you help your friend, but purely out of moral duty,\nnot because you want to or care about how well your friend does. It seems that you have done the right\nthing, but have you done it for the right reasons? If you act in this way - so that your desires and emotions\nare disengaged from your action - do you have a healthy moral character? The virtue theorist says 'no'.\nFor the virtue theorist the primary question is: how can I live a good life? Aristotle thought that the best life\nwas the life of a fully realized human being: a human being who demonstrated excellence in all human\ncapacities, e.g., the capacity for emotion, for practical rationality, for theoretical rationality. This was a life\nof human flourishing. Just as the virtues of a tool (e.g., a pen) are those features (e.g., having flowing ink)\nthat enable the tool to perform its proper function (e.g., writing), so the virtues of a person are those features\n(kindness, generosity, courage...) that enable it to excel as a human being.\nVirtues are dispositions to act in certain ways for certain reasons and with certain feelings. Amy has the\nvirtue of courage if Amy tends to take the appropriate risks for the sake of important things without\npanicking. Amy has the vice of cruelty if she tends to hurt others without concern for their well-being and\ntakes pleasure in it. Unlike utilitarianism and deontology, virtue ethics cannot give us a formula for deciding\nhow to act. Rather, it can only suggest a model for how we should aim to be, what sort of character we\nshould strive for: have those character traits that are present in a fully flourishing human being.\nObjections:\n- Could one be happy or flourish, without a good character? Could one have a good character without\nbeing happy or flourishing?\n- Aren't there some actions that are morally right, even if a non-virtuous person performs them? If a\nvirtuous person does something that has terrible consequences (perhaps unforeseen), wasn't it the wrong\nthing to do?\n- If we are a novice at virtue, and don't have knowledge of how to act properly, how do we know how to\nbecome virtuous? What are the states of character that lead to human flourishing? Are there a single set\nor are there different ways of flourishing?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Waste",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/dd29e1ffd22ed6126580d7df95bc4afd_MIT24_03S17_lec19.pdf",
      "content": "24.03: Good Food\n4/24/17\nWaste\nSome data?\n- Crazy Horse Canyon Landfill received the delivery of 200 tons of \"excess, rejected, or misbagged\nproduce everyday until the landfill's closure in 2009. The dump closed because it was full.\"\n(Bloom 2010, 2)\n- \"The average U.S. supermarket produce item travels 1,500 miles before it arrives at its\ndestination.\" (Bloom 2010, 4)\n- If you allow the (unrealistic) estimate that growers of lettuce harvest 90% of the crop, then it is still\na huge loss. In 2007, the Salinas Valley produced 153,495 acres of lettuce. So that means it left\nto rot 15,350 acres (over 13 million pounds). (Bloom 2010, 5)\n- The estimate in 2009 was that the US \"wastes roughly half of its food\" and \"40 percent of\navailable calories.\" (Bloom 2010, 10)\n- In 1995, the USDA estimated \"that milk had the second-highest loss rate of any food item: about\na third of it isn't consumed. That year, 16 billion pounds of milk were wasted.\" (Bloom 2010, 10)\nSome reasons to be a freegan?\n- \"Many of agriculture's ill effects on laborers, animals, and the environment could be reduced if\nwe ate what would otherwise be wasted.\" (Singer and Mason, FES, 223).\n- \"We're saving food that would otherwise totally go to waste - perfectly good food.\" (FES, 221)\n- \"Even products that contain no animal ingredients can hurt animals, when land is cleared to grow\ncrops or when oil companies go into wilderness areas to provide the fuel needed to truck the\ngoods around the country.\" (FES, 222)\n- \"Freeganism is not only about free food. Behind it lies a view about how to live one's life, one\nthat rejects the priorities set by the consumer society and the lifestyle that results from accepting\nthose priorities. Because most people see their status as linked to wealth and what they can buy,\nthey are locked into working, often unsatisfying jobs, to earn the money to enhance their\nstatus....[Freegans] are doubly free - free from the subordination to the consumer ethos and free\nfrom the need to work to satisfy their needs.\" (FES, 223)\nHaslanger\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "4: Consequentialism and Famine",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/bd1ebd62bd17919b6c77c492f287dd17_MIT24_03S17_lec04.pdf",
      "content": "24.03: Good Food\n2/15/17\nConsequentialism and Famine\nI. Moral Theory: Introduction\nHere are five questions we might want an ethical theory to answer for us:\ni)\nWhich acts are right and which are wrong? Which acts ought we to perform (understanding the \"ought\"\nas a moral \"ought\")?\na.\nWho is part of our moral community? Towards whom (or what) do we have moral duties and\nobligations? (Some/all other humans? Animals? Ecological systems? Androids/computers?)\nb.\nHow do moral 'oughts' interact with other reasons for action? Do they always \"trump\" other\nreasons?\nii)\nWhat makes a particular action right or wrong?\nstatus?\nWhat is it about the action that determines its moral\niii)\nHow do we know what is right and wrong?\niv)\nWhat, if anything, motivates us to do what is right?\nNormative ethics: addresses \"first-order\" questions about our moral lives, questions about what morality\nrequires/permits us to do, and what is morally valuable. E.g. should we be vegetarians? Is euthanasia permissible?\nIs it (morally) good to devote oneself to a life of pleasure?\nMeta-ethics: addresses questions about first-order (normative) ethical judgments, e.g., about the nature of\nmorality; the meaning of moral talk; whether morality is absolute or relative; whether moral judgments can be\ntrue or false (objective) or merely subjective, how we can have knowledge of moral truth.\nII. One Normative Theory (to start): Consequentialism\nConsequentialism's whole focus is on consequences of action. The project is to figure out what is intrinsically\ngood, e.g., pleasure, happiness, welfare, preference satisfaction, or some other list of objective goods (health,\nknowledge, etc.), and then the right thing is to bring that good(s) about or minimize the opposite.\nOne version of consequentialism is Eudaimonistic Utilitarianism ('eudaimonia' means 'flourishing' in\nGreek):\nGreatest Happiness Principle: ...actions are right in proportion as they tend to promote happiness,\nwrong as they tend to produce the reverse of happiness. (John Stuart Mill, Utilitarianism)\nOr as contemporary moral theorists state it:\nYou ought always to act so as to maximize happiness/flourishing, i.e., the right act is the act that\nresults in the greatest amount of happiness/flourishing overall.\nDifferent forms of consequentialism vary in the kind of consequences they consider relevant, and the kind of\nrequirement with respect to those consequences (maximize, etc). A template might look like this:\nYOU OUGHT ALWAYS TO ACT SO AS TO [fill in mode of action here] [fill in kind of\nconsequence here].\nFor example, another consequentialist principle might look like this:\nYou ought always to act so as to relieve suffering.\nIII. Duty to Prevent Suffering\nConsequentialism does seem to capture some basic elements of moral thinking, e.g., that consequences matter,\nand that moral thinking ought to be impartial in how it regards each person's well-being. Drawing on these\ninsights Peter Singer argues that our obligations to those who suffer are much greater than what we might have\nthought.\n\n24.03: Good Food\n2/15/17\nNote that Singer is not aiming to defend consequentialism. His point is to draw on consequentialist insights about\nmorality to raise deep challenges to our ordinary moral beliefs; in particular, he's concerned to show that the line\nwe draw between DUTY and CHARITY is misplaced. Here's the argument:\n1. Suffering and death from lack of food, shelter and medical care are very bad.\n2. PREVENT SUFFERING PRINCIPLE (PSP): If it is in our power to prevent something bad from\nhappening, without thereby sacrificing anything of comparable moral importance, we ought,\nmorally, to do it.\n- This principle doesn't require that we promote happiness; it simply requires that we prevent bad. It also allows\nthat we only have to act if nothing comparably important is at stake.\n- For the principle to avoid collapsing into a maximizing requirement, we have to introduce the notion of a\nbaseline (otherwise, if things are bad simply by being less than optimal, then we'd be required to do everything\na maximizing principle requires).\n3. The things we'd have to give up in order to make large contributions of money, time, and/or\nenergy to famine relief, are less important (morally speaking) than life, food, shelter, or medical\ncare.\n4. So we ought to make large contributions of money, time, and/or energy to famine relief.\nFurther notes:\n- What we ought to do is not affected by the proximity or distance of those we're aiming to affect. It may be\npsychologically difficult to identify with others far away, and so difficult to care about them, but that's compatible\nwith its being a moral requirement that I act with their welfare in mind.\n- What we ought to do doesn't depend on whether I alone or millions of us could equally well help out. One\nmight feel less guilty if others are also shirking--but why should this matter morally? Am I less obligated to save\nthe drowning child if others are also watching?\nBut is the Prevent Suffering Principle plausible? It would seem to require that we make contributions that would\nreduce ourselves (and dependents?) to the level of marginal utility--i.e., that level at which, by giving more, I'd be\nworse off than those I'm aiming to help. This clearly contradicts our ordinary judgments, so would require very\nstrong backing--which Singer doesn't try to offer. Instead he suggests a weaker principle that seems extremely\nplausible. Here are the revised premises:\n2*. MODIFIED PREVENT SUFFERING PRINCPLE (MPSP: weaker/moderate version): If it is\nour power to prevent something very bad from happening, without thereby sacrificing anything\nmorally significant, then we ought, morally, to do it.\n- Example: saving a drowning child only at the cost of ruining one's new shoes.\n3*. The things we'd have to give up in order to make large contributions of money, time, and/or\nenergy to famine relief, are not morally significant.\n4 (same as before). So we ought to make large contributions of money, time, and/or energy to\nfamine relief.\nQuestions for Singer:\n-\nSinger relies heavily on an analogy with refusing to sacrifice one's new shoes to save a drowning child. Is this\nanalogy apt? How is this case different from giving to famine relief? What can we learn from the differences?\n\n24.03: Good Food\n2/15/17\n-\nHow should we determine the moral significance of something? Are my shoes morally significant if they bring\nme happiness? If they help me to get a good job that supports my family?\nIV. Duty and Charity\nThe move from the strong to the weak version helps, but it puts added pressure on premise (3*) - are the sacrifices\nwe'd have to make morally insignificant? We tend to distinguish DUTY from CHARITY - what we give to relief\norganizations here or abroad is morally optional - we're good to do it, but we don't really have to. If we\nrecognized that aid and assistance to relieve suffering is not morally optional, then our lives would look very\ndifferent.\nBut why should we think that our \"luxuries\" aren't morally significant? If happiness is morally significant, and\n\"luxuries\" bring us happiness, why aren't they morally significant? What marks the line between the morally\nsignificant and the morally insignificant? Singer seems to think that the only thing that matters morally is\nsuffering and relief from it - as long as you've reached the baseline for a reasonable life, anything more is morally\nirrelevant. Is this plausible? It might seem that a life for everyone at the baseline might be a pretty gloomy\nexistence, but is this true? What does the research in empirical psychology tell us? Singer would certainly ask us to\nlook at the alternative: some people suffer and die when they could be helped, while others luxuriate in their\nriches? Is this a morally acceptable situation?\nV. Lifeboat Ethics\nIt might be tempting to respond to Singer that the affluent have a right to what they have earned and what they\nhave purchased with what they have earned. And no one has a right to demand it be given to them. Let's grant\nthis for the sake of argument. The problem is that Singer is not arguing that those dying of starvation have a\nright to be given aid (though some others would argue for that). Rather, he is arguing that even if we have a right\nto our wealth, we are doing something morally wrong by holding onto it and not using it to help those who are\nsuffering and dying for lack of food, water and medical care.\nGarrett Hardin offers an argument against aid in consequentialist terms. In fact, he claims that not only do we\nhave no moral obligation to give relief aid to poor countries, but we are morally obliged not to provide aid. He\nrelies on an analogy with a lifeboat. Do those on a lifeboat have an obligation to bring aboard all others who are\ndrowning? Hardin says \"No.\" The right action is to bring aboard only that number compatible with the safety of\nthose on board, for any other action would be to bring about, or at least risk, disaster. He then argues that we\nshouldn't help feed the starving in poor countries because given the patterns of population growth and limitations\non resources, like overloading the lifeboat, this will only result in worse consequences down the road.\nQuestions for Hardin:\n-\nAre we currently in a lifeboat situation? Are rich countries at their \"carrying capacity\"?\n-\nDoes it matter if the lifeboat (wealth) was obtained unjustly or immorally?\n-\nWho is responsible for the famine? If we [those in the First World] are responsible for inequity in the\ndistribution of resources, should they [those in the Third World] suffer for it?\n-\nIs population growth in poor countries the primary cause of famine? Is it plausible that aid to poor countries\ncauses population growth? How does adequate food, education and health care affect population growth?\n-\nIs it really better to avoid the risk of a slightly worse disaster [the lifeboat capsizing] by allowing a certain\ndisaster [all those in the sea to drown]?\n-\nSuppose we grant that, in the future, more will die of starvation if we give to famine relief now than will die if\nwe withhold aid. What are we to make of all the additional years lived and people born between now and\nthen? Many lives will be lost, but many will also be gained.\n\n24.03: Good Food\n2/15/17\nAppendix: Tragedy of the Commons\nQuestion: Is it true that if each individual acts rationally to promote their own self-interest, this will result in the\nbest for society as a whole? Garrett Hardin argues not (see recommended readings):\nThe tragedy of the commons develops in this way. Picture a pasture open to all. It is to be expected that\neach herdsman will try to keep as many cattle as possible on the commons. Such an arrangement may\nwork reasonably satisfactorily for centuries because tribal wars, poaching, and disease keep the numbers of\nboth man and beast well below the carrying capacity of the land. Finally, however, comes the day of\nreckoning, that is, the day when the long-desired goal of social stability becomes a reality. At this point,\nthe inherent logic of the commons remorselessly generates tragedy.\nAs a rational being, each herdsman seeks to maximize his gain. Explicitly or implicitly, more or less\nconsciously, he asks, \"What is the utility to me of adding one more animal to my herd?\" This utility has\none negative and one positive component.\n1) The positive component is a function of the increment of one animal. Since the herdsman receives all\nthe proceeds from the sale of the additional animal, the positive utility is nearly +1.\n2) The negative component is a function of the additional overgrazing created by one more animal. Since,\nhowever, the effects of overgrazing are shared by all the herdsmen, the negative utility for any particular\ndecision-making herdsman is only a fraction of -1.\nAdding together the component partial utilities, the rational herdsman concludes that the only sensible\ncourse for him to pursue is to add another animal to his herd. And another; and another.... But this is the\nconclusion reached by each and every rational herdsman sharing a commons. Therein is the tragedy.\nEach man is locked into a system that compels him to increase his herd without limit-in a world that is\nlimited. Ruin is the destination toward which all men rush, each pursuing his own best interest in a society\nthat believes in the freedom of the commons. Freedom in a commons brings ruin to all.\n(See Hardin 1968, http://www.garretthardinsociety.org/articles/art_tragedy_of_the_commons.html)\nAlso YouTube:\nhttps://www.youtube.com/watch?v=WYA1y405JW0\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "5: Deontology and Famine",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/6d21a5d08a2395141503187394ac1ede_MIT24_03S17_lec05.pdf",
      "content": "24.03: Good Food\n2/21/17\nDeontology and Famine\nI. Recap\nConsequentialism (Bentham, Mill, Singer)\nThe rightness or wrongness of something depends entirely on the goodness or badness of its consequences.\nAct Utilitarianism: You ought always to act so as to maximize utility [different theories emphasize\nhappiness, pleasure, or welfare....], i.e., the right act is the act that results in the greatest amount of utility\noverall.\nSinger relies on a consequentialist assumption to conclude that we ought to give large amounts to charity to\nrelieve the suffering of distant others:\nModified Prevent Suffering Principle: If it is our power to prevent something very bad from\nhappening, without thereby sacrificing anything morally significant, then we ought, morally, to do it.\nNote that although Singer focuses on famine, the bad in question need not be hunger. It might be medical\ncare, the ravages of war, injustice of other kinds.\nFor many, Singer's conclusions seem too demanding. Why shouldn't we each enjoy what we have? Are the\ndistant needy really entitled to what Singer demands of us? Possible lines of criticism are many:\n-\nPartiality: Far away people I don't even know have no moral claim on me. Distance/relationships\nmatter. (See also pp. 43-46 in FES.)\no\nWhy does distance matter morally?\no\nBut what about the homeless in Central Square?\n-\nIndividual Responsibility: It isn't my fault that some people are suffering. Why should I have to sacrifice\nfor them? In fact, empirical research suggests that people are making their own choices to buy TVs\ninstead of food. If they are hungry, it is their own fault. (See Duflo et al.)\no\nIs moral responsibility a causal notion, i.e. I am responsible for what I cause? Or is it broader?\n-\nIs there a forward-looking notion of responsibility: I am responsible for making the world\nbetter than it is now? We all must do our part.\n-\nIs there a collective notion of responsibility: I alone didn't cause suffering, but I am part of a\nsystem that did? (See also pp. 46-47 in FES.)\no\nAre individuals always sufficiently educated to make good food/health choices?\no\nWhat is the standard of living that we are entitled to? Is it only bare existence?\n-\nCharity skepticism: It is unlikely that anything I give will make a difference. In fact, charity might make\nthings worse. (See pp. 57-59 in FES.)\no\nIs this true of all giving? Is there no useful intervention, ever?\n-\nLifeboat: There are too many people on the planet anyway. It is inevitable that some will die, and we\nmust allow this so that the rest (and the planet?) can survive. (See pp. 47-52 in FES.)\no\nSee questions about this approach on the previous (2/15) handout.\nII. Deontology\nLet's think more about individual responsibility. According to deontology there are some basic or non-\nderivative moral considerations beyond or in addition to good effects, and these give rise to our moral obligations,\ni.e., what we ought to do. The most important alternative to consequentialism, historically speaking, derives\nfrom the work of Immanuel Kant (1724-1804), and so predictably is called a Kantian approach. The\nutilitarian takes happiness or pleasure to be intrinsically good and seeks to maximize it; Kantians, however,\ntake the good will, i.e., our ability to conform our will to reason, to be intrinsically good. The right way to honor\nwhat's good about a good will is not to maximize, however, but to respect such wills.\nA. Kantian Deontology: Categorical Imperative\nAt the core of Kant's ethics is a principle known as the Categorical Imperative (CI) which Kant states in different\nways. (See Kant's Groundwork for the Metaphysic of Morals in recommended reading.)\n\n24.03: Good Food\n2/21/17\nCI - Universal Law formulation: Act only on that maxim whereby thou canst at the same time will that it should\nbecome a universal law. (11)\nCI - Principle of Humanity formulation: So act that you use humanity, whether in thine own person or\nin that of any other, in every case as an end withal, never as a means only. (29)\nIn more contemporary terms:\nYou are No Exception Principle (YANE): \"...in whatever you do, you should act for reasons that could\nserve as acceptable reasons for everyone.\" (Sayre-McCord, 5)\nand\nRespect for Persons Principle (RPP): In all action one should respect others as sources of value and\nnever merely as an instrument for one's own purposes. (Sayre-McCord, 7)\nB. You Are No Exception Principle\nWe generally think it is wrong to do something that we know would be problematic if everyone else did it too,\ne.g., cheating on an exam, removing a pollution control device from a car, stealing a book from the bookstore.\nIn each of these cases the agent's goals could not be achieved if everyone else did the same thing, so the success\nof the action depends on making a distinction between what the agent does and what others do. But making\noneself an exception this way seems wrong. Kant thought that in cases like this there was a sort of irrationality.\nThe idea is that in any intentional action, I am implicitly or explicitly acting on a principle of some kind. The\nprinciple is given by your reason for acting, not necessarily your motive. Consider three shopkeepers, both of whom\nare committed to giving correct change to their customers. They act, however, on different principles, or what\nKant called \"maxims\":\nMr. Practical:\nWhen (and only when?) I can gain a good business reputation by giving correct change, I\nshall give correct change.\nMs. Sympathetic:\nWhen I feel it appropriate to give correct change--which I always do because I'm a\nsympathetic person--I shall give correct change.\nMr. Righteous:\nWhen I can perform a morally right act by giving correct change, I shall give correct\nchange.\nIn each case there is a generalized form of the maxim of the form:\nGeneral Form:\nWhenever one is ________, he/she shall ________.\nOn Kant's view, what matters in evaluating an action is the principle that is employed in intending or willing.\nTwo individuals can do the same thing, but one of them do wrong and the other right, depending on what they\nwill. Some maxims fail the test, so the corresponding action is immoral, e.g., (in generalized form):\nWhenever one has an exam and doesn't feel like studying, she shall copy off of her neighbor's work.\nPresumably we could not all act on this maxim, for if we are all planning to copy off each other, there will be\nno work to copy! The underlying rationale for an approach such as this is to show that the source of morality\nis in reason or rationality; those who are immoral are in some important sense acting irrationally.\nC. Respect for Persons Principle\nAlthough there seems to be something right about the (YANE) version of the CI, it isn't clear that it captures\nwhat makes an action right or wrong. So let's turn to the \"Respect for Persons Principle\" (RPP): In all action\none should respect others as sources of value and never merely as an instrument for one's own purposes.\n(Sayre-McCord, 7)\nThis principle allows that we can use others as a means to accomplish our own ends; after all, we rely crucially\non others all the time. Your professors serve as a means to your ends of gaining knowledge. But these are\ncases in which there is consent--your professors aren't deceived or coerced into serving your needs. According\nto the (RPP), cheating on your final would be wrong because you would be using me (or your TA) as a mere\nmeans to a good grade: this would be a scheme that we would not--or better: could not reasonably--consent\n\n24.03: Good Food\n2/21/17\nto. Why not? Because we are choosing a life based on the value of imparting knowledge. Our choice to do\nthis is something of value, and deserving of respect.\nWorth noting: on the Kantian view (in contrast to utilitarianism):\n-\nThe focus of moral evaluation is the maxim or principle implicit in the act, not the results. A good action\nmight have bad results and vv.\n-\nThe theory works well when information is scarce. Utilitarian calculations require a lot of data in order to\nmake plausible predictions about consequences. But because it is usually clear when an action would use\nanother as a mere means (in contrast to what would promote human happiness overall), a Kantian view\ndoesn't require that we have as much knowledge in order to determine what is right or wrong.\nD. Kantian Duties towards Others\nOn this view the Kantian picture has a strong negative component comprising the duty of justice:\nDon't treat others as a mere means.\nYou can't abuse and exploit people, or treat them as merely things in your way, things to be \"dealt with,\" or\nthings in any sense. And a positive component comprising the duty of beneficence:\nAs far as possible treat others as ends in themselves, i.e., as a rational person with his or her own aims,\nobjectives, goals, conceptions of the good, etc.\nSo granted, we must never exploit, deceive, or coerce others; but it is a more difficult and complicated matter\nto figure out how to help others achieve their own ends. People are complicated: we each want and aim for\nmany things and sometimes our goals are even incompatible. Moreover, in treating people as ends, we must\nbe sensitive to human limitation, both cognitive limitations and limitations on our autonomy. Onora O'Neill\nsuggests:\nTo treat one another as ends in themselves such beings have to base their action on principles that do not\nundermine but rather sustain and extend one another's capacities for autonomous action...Since finite\nrational beings cannot generally achieve their aims without some help and support from others, a general\nrefusal of help and support amounts to failure to treat others as rational and autonomous beings, that is as\nends in themselves. (O'Neill in DMI (recommended readings) 469)\nIn traditional terms, duties of justice are perfect duties, i.e., they are absolute requirements, the violation of which\nis immoral. Duties of beneficence are imperfect duties, i.e., they are duties to act in ways that further certain ends\nor goals, but there are legitimate choices about how to do this. Another way to think of it is that corresponding\nto duties of justice are rights: I have a right to bodily integrity and you have a perfect duty to respect my bodily\nintegrity. People have many needs, however, and although you may have a duty to help those in need, it may\nbe morally permissible to meet someone else's needs rather than mine. But it would be morally wrong of you\nto ignore everyone's needs but your own.\nIII. Rights\nDo individuals, however, have a moral right to adequate nutrition? (Or, in Sen's words, food entitlements?\nWe'll talk more about Sen et al tomorrow.) What if we are starving and no one steps up to help? Does no one\nhave a duty to help me?! (See especially pp. 54-57 in FES.)\nRights are standardly divided into negative rights and positive rights. It is possible to map some of the discussion of\nthese onto the Kantian picture. Negative rights correspond to perfect duties: we are all, always, morally\nrequired to treat others with respect for their integrity and not interfere with them. Positive rights, however,\ne.g. the right to food, healthcare, etc. seem to require that we take action not only to respect and protect the\nright in question, but also to fulfill it. If I have a positive right to adequate nutrition, then someone must fulfill\nit if I lack food. According to those who hold that we only have imperfect duties to provide for others, i.e., that\nproviding food to others is only a duty of beneficence, there is no positive right to adequate nutrition; at best\nothers have an imperfect duty to do what they can.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "6: Famine Relief: Ethics or Politics?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-03-good-food-ethics-and-politics-of-food-spring-2017/6e049070311f0286fa52ee4d562e220d_MIT24_03S17_lec06.pdf",
      "content": "24.03: Good Food\n2/22/17\nFamine Relief: Ethics or Politics?\nI. Ethics or Political Philosophy?\nThe distinction between an ethics and a political philosophy is the central idea in Kuper's critique of Singer.\nKuper argues that Singer takes famine to be an ethical problem, i.e., one that we should address as\nindividuals; instead, he maintains, it is really a political problem and should be addressed by a political\neconomy (which \"charts the causal dynamics of the global economy), a theory of justice (provides normative\nideals and principles), and a political sociology (identifies the roles of individuals and institutions in achieving\nthe just ends). (Kuper, 114)\nII. Sen and Entitlements\nWhy should we take global hunger to be a matter of politics? Isn't it just about having enough food? Sen\nargues not. Although there are cases of natural disasters and such that call for emergency aid, the\nmajority of hunger in the world is chronic, and is not necessarily an issue of poverty, i.e., the poorest are\nnot always those who suffer from chronic hunger. Why not?\nSen suggests that the issue is food entitlements. A person's food entitlement is \"roughly, the food that that\nperson actually has the ability to acquire.\" (52) There are three elements of the system to consider:\nEndowments - land, labor power, wealth\nDirect entitlements - what can be acquired directly from one's endowments\nExchange entitlements - what can be acquired from exchange/trade of one's endowments and direct\nentitlements.\nIf one owns no land and has no wealth, everything depends on the exchange of one's labor power, or\nwhat one earns from the exchange of labor power. \"The actual command over food that different\nsections of the population can exercise depends on a set of legal and economic factors, including those\ngoverning ownership, transfer, production and exchange. It is, thus, quite possible for some groups, e.g.,\na particular occupation group such as landless rural labourers, to have a sharply reduced food entitlement\neven the overall availability of food in the economy is unaffected or enhanced.\" (77) Can you give a\nscenario where this might happen? (E.g., see p. 53)\nBecause the issue isn't directly about food production and food supply, but about food distribution and\nentitlements, the discussion of hunger has shifted to the issue of food security, \"where food security is\nunderstood primarily as a matter of how reliably people have the actual ability - physically and\neconomically - to acquire proper nutrition.\" (54)\nIII. Cosmopolitanism?\nIn his book Cosmopolitanism, Kwame Anthony Appiah's discusses several principles relevant to our global\nresponsibilities:\nGlobal Community Principle: We belong to a global community and have [moral] obligations to all other\nhumans.\nCultural Equality Principle: Cultures organize themselves in different and (mostly) in equally valuable ways,\nwith different and (mostly) equally valuable practices.\nOn Appiah's version of cosmopolitanism, a kind of partiality towards one's family and compatriots is\npermissible:\nIndividual Partialism: It is morally permissible in deciding how to act to be somewhat partial towards one's\nnear and dear, and to conform one's behavior to the morally acceptable norms of one's society.\nWe should distinguish, however, individual partialism from state partialism:\n\n24.03: Good Food\n2/22/17\nState Partialism: It is morally permissible for a state to be partial towards some proper subset of its citizens\nand to conform its decisions to norms of some sub-groups of citizens over others.\nState partialism is arguably contrary to the demands of justice. However, state partialism should be\ndistinguished from State Isolationism, the extreme version of which states:\nState Isolationism: A state is responsible for its own citizens, and is not responsible for the citizens of other\ncountries.\nSinger seems to hold a very strong form of ethical cosmopolitanism. As Singer puts it in his reply to Kuper:\nStrong Cosmopolitanism: The interests of all persons ought to count equally [in an individual's decision about\nhow to act], and geographic location and citizenship make no intrinsic difference to the rights and\nobligations of individuals. (121)\nIt seems that Kuper wants to agree with Singer on strong cosmopolitanism, and their disagreement lies in\nwhether we can be good cosmopolitans without relying on political philosophy in order to make the right\ndecision. As Singer sees it, the disagreement between them is really about the facts: which course of\naction will make the most positive difference. Kuper suggests that individual action is likely to be harmful\nwithout a full appreciation of social structures and their interdependence. Singer can allow this, though he\nthinks that Kuper is wrong about the facts. Singer believes that it is very clear that some direct charitable\ngiving will make a positive difference, even if it doesn't solve the problem in the long run.\nWhat exactly, then, is Kuper asking for (115-6)?\n1) Appropriate ideal ends. (theory of justice, political economy)\n2) Coordination of collective action. (political sociology, politics)\n3) Sustainable development strategies over the long run. (political economy and sociology, also effective\nglobal organizations and policies?)\n4) Criteria for distinguishing fair from unfair unequal distributions. (theory of justice)\n5) Realistic limits on our idealism. (political economy)\n6) Respect for the poor as agents. (maybe relevant to Duflo et al?)\n7) Identification of the proper agents of justice and aid: who bears responsibility for the poor? (theory of\njustice)\nQuestions:\n-\nSinger seems to maintain that he does not need fancy political theories to provide answers to these\nquestions. (1, 4, and 7) are answered by his utilitarianism. (2, 3. 5) are answered by the agencies he\nrecommends (Oxfam, etc.). (5) is provided by both. So how do his recommendations fall short?\n-\nKuper seems to hold that state action is ultimately required in order to solve the problem of hunger\nrelief. Does Singer disagree?\n-\nDoes Kuper's list (1-7) really address the issue of food security? How?\n-\nDoes Kuper really endorse strong cosmopolitanism? What should I as an individual do if I take my\nobligations to the hungry seriously? Buy clothes from fair-trade organizations? Go on holidays to\ncountries that depend on tourism? Lobby my government to give aid? Oppose corporations that are\nexploitative of the global poor? Is this enough? Does it take my obligations seriously enough?\n-\nDo you think that the issue of food security is just about the facts? Or are there normative moral and\npolitical issues to be addressed? If so, what are those issues?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.03 Good Food: The Ethics and Politics of Food Choices\nSpring 2017\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}