{
  "course_name": "Graduate Seminar in American Politics II",
  "course_description": "This is the second in a sequence of two field seminars in American politics intended for graduate students in political science, in preparation for taking the general examination in American politics. The material covered in this semester focuses on American political institutions. The readings covered here are not comprehensive, but it is sufficiently broad to give students an introduction to major empirical questions and theoretical approaches that guide the study of American political institutions these days.",
  "topics": [
    "Social Science",
    "Political Science",
    "American Politics",
    "Social Science",
    "Political Science",
    "American Politics"
  ],
  "syllabus_content": "Course Meeting Times\n\n1 session/week, 2 hours/session\n\nPrerequisites\n\nMIT students are required to get the permission of the instructor to enroll in this course.\n\nDescription\n\nThis course analyzes the institutions of the American political system, with primary emphasis on the national level. Examines American federalism, political parties, national political institutions, and the policymaking process. Focuses on core works in contemporary American politics and public policy. Critiques both research methodologies and the explicit and implicit theoretical assumptions of such work. The readings covered here are not comprehensive, but it is sufficiently broad to give students an introduction to major empirical questions and theoretical approaches that guide the study of American political institutions these days.\n\nRequirements\n\nWeekly attendance and class participation\n\nWeekly one-page memos\n\nFour longer, four-page essays",
  "files": [
    {
      "category": "Resource",
      "title": "Bureaucracy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/e6e8d39ecd56a31f2e14f2f2b748717e_MIT17_202S10_Bureacracy_es.pdf",
      "content": "17.202\nGeneral Exam #3 - Re-write\nBureaucracy\nWhat means does Congress have at its disposal to ensure the laws it passes are\nimplemented as intended by the bureaucracy? What are the challenges to overseeing\nthe bureaucracy? On the whole, do you believe Congress is able to provide adequate\noversight?\nThe size and complexity of the federal government (as well as constitutional\nseparation of powers) prevents Congress from exercising direct control over all\nfacets of bureaucratic action. To accomplish the multitude of tasks carried out daily\nby the federal government requires wide-ranging expertise, time, and effort that\n535 people simply do not have at their disposal. Congress must delegate authority\nto government agencies. What happens then? Should Congress oversee the actions\nof the executive branch to ensure its laws are faithfully executed? If so, does it\npossess adequate powers to do so?\nTraditionally, political scientists saw scant evidence that Congress was taking\nsteps to oversee the actions of the bureaucracy (Pearson 1975, Fiorina 1977), going\nso far as to refer to oversight as Congress' \"neglected function\" (Bibby 1968).\nHowever, it is not clear that oversight is a required function of the legislative\nbranch--while Congress has the power to write laws, the Constitution provides that\nthe President should \"take care that the laws be faithfully executed.\" The Supreme\nCourt found in several cases, such as Buckley v. Valeo and INS v. Chadha, that there\nare limits on the extent that Congress may encroach on the executive's privilege to\nimplement federal programs. Moreover, Moe and Howell (1999) note a variety of\ninstances in which Congress may want to give broad discretion to the executive\nbranch, such as shifting responsibility for tough decisions to the bureaucracy (pg\n\n17.202\nGeneral Exam #3 - Re-write\n859). That said, McCubbins, Noll, and Weingast (1987) note that a \"central\nproblem\" of a democracy is ensuring that policy is responsive to the interests of\ncitizens (pg 243); elected leaders in Congress may be more able to ensure this than\nthe non-elected officials of the bureaucracy (though presidents also frequently claim\na \"mandate\" from the people). Moreover, members of Congress may have a\npersonal stake in the laws enacted and may want to see their wishes come to\nfruition. Indeed, most of the literature assumes that Congress should work to\nensure its laws are enacted as intended. The debate has centered, rather, on how\nand when they do so.\nIn particular, there has been some challenge to define what it means to\noversee the bureaucracy. Traditional views of oversight included comprehensive\nmonitoring, with rewards and sanctions awarded based on monitoring findings. As\nmany authors have pointed out, however, this approach is expensive, difficult, and\nmay not provide sufficient incentives for Congressional action (Mayhew 1974,\nMcCubbins and Schwartz 1984, McCubbins, Noll, and Weingast 1987). If the goal is\nnot simply seeking out bureaucratic malfeasance, but rather a broader goal of\nensuring compliance with congressional intent, there may be other mechanisms of\ncongressional action available. McCubbins and Schwartz (1984) introduced the idea\nof \"fire-alarm\" oversight, where Congress relies on constituents and interest groups\nto alert it to problems in the bureaucracy. This approach saves the time and\nexpense of traditional, \"police patrol\" oversight (i.e., traditional monitoring) and\nalso allows members of Congress to claim credit for solving their constituents'\nproblems. McCubbins, Noll, and Weingast (1987) expanded on this idea by outlining\n\n17.202\nGeneral Exam #3 - Re-write\nthe role of administrative law in automating oversight. These authors identified the\nAdministrative Procedures Act of 1946 as a means for Congress to limit the possible\nactions of the bureaucracy, require the collection and dissemination of relevant\ninformation needed for oversight, and empower constituents and the court to take\naction (e.g., pull a \"fire-alarm\") in response to undesired bureaucratic action.\nThese methods allow Congress to circumvent the principal-agent problem\nthat has plagued analysis of oversight behavior. The principal (Congress) directs\nthe work of the agent (the bureaucracy); the problem stems from the fact that these\ntwo actors may have different goals. Moreover, because the agent is actively\ninvolved in carrying out the tasks of the principal, the agent may have more\ninformation than the principal, permitting the agent to deceive the principal. For\nCongress, this problem is augmented by the existence of multiple principals--the\nwork of the bureaucracy is overseen by the president and Congress; by the Senate\nand the House; by various committees within Congress; and by constituents and\ncourts. These various principals may have divergent goals for bureaucratic action;\nas McCubbins, Noll, and Weingast (1987) note, by representing different interests,\nthese diverse principals \"will likely seek to influence an agency's policy choices in\ndifferent directions\" (pg 248). Moe (1985) found that the National Labor Relations\nBoard may have been able to avoid compliance with congressional demands by\nplaying different subcommittees off one another (see also Ogul and Rockman 1990).\n1 Though absent from the literature, it may be worth noting that for many issues, there are also\nmultiple agents. For example, GAO recently found the federal government funds 151 different\nprograms in support of early childhood, elementary, and secondary education, administered by 19\ndifferent federal agencies (GAO-10-51). It is not immediately clear how the principal-agent problem\nchanges with both multiple principals and multiple agents.\n\n17.202\nGeneral Exam #3 - Re-write\nAs noted, however, fire-alarm oversight using administrative procedures can\ncircumvent this problem. Administrative procedures structure agency action in\nsuch a way that Congress can overcome the challenge of imperfect information. For\nexample, McCubbins, Noll, and Weingast (1987) describe the Administrative\nProcedures Act of 1946 (APA), which required that agencies announce new\ninitiatives and explicitly describe the evidence in support of major decisions. The\nauthors also note that the APA allows Congress to protect the original interests of a\nparticular statute by requiring that agencies solicit comments from interested\nparties in making these decisions (pg 257-258). In this way, congressional\ncommittees may be able to ensure the desired implementation of their laws, without\ntaking pro-active steps to oversee a particular agency.\nIt may also be worth noting that recent literature on congressional oversight\nhas found institutional changes that may even encourage the use of traditional,\npolice patrol oversight. In particular, budgetary concerns have limited Congress'\nability to propose new government programs; where before the re-election goal\nprioritized the development of new programs, now congressmen may receive more\nelectoral credit for reviewing and re-shaping the bureaucracy (Ogul and Rockman\n1990; Aberbach 1990). Additionally, the shift to divided government has provided\nan added incentive to engage in oversight activity; Mayhew (2005) found that in the\nHouse, committees were more inclined to initiate investigations during periods of\ndivided government, though the Senate was more equitable in their treatment of the\nexecutive branch (see also Doyle 1986). Finally, Aberbach notes that funding for\n\n17.202\nGeneral Exam #3 - Re-write\ncommittee staff and congressional support agencies has grown dramatically in\nrecent years, making traditional oversight activity, such as monitoring, less costly.\nEven if these changes have only marginally changed the costs and benefits of\ntraditional oversight activities, however, the use of fire-alarm oversight certainly\nallows for Congress to ensure--at a basic level--that the bureaucracy is following\nits initial lead. It is nonetheless worth noting that congressional goals can change\nwith future elections--committee chairs can retire, the House or the Senate can\nchange partisan hands, new issues or new perspectives on old issues can emerge.\nAdditionally, the president has wide latitude to take unilateral actions to influence\nthe bureaucracy (Moe and Howell 1999). McCubbins, Noll, and Weingast (1987)\nmaintain that administrative procedures give bureaucracies the flexibility to\nrespond to new situations, but still restrain them to respond to the original interests\nof a particular statute. It is less clear from this literature that Congress is able to re\nshape a bureaucracy to respond to new interests. However, findings from Lewis\n(2002) show that 62 percent of agencies created since 1946 have been eliminated\nand that a primary cause of agency death is partisan turnover. Given these wide\nprerogatives, it appears that Congress is able to ensure sufficient fidelity to the laws\nthat it enacts.2\nReferences\nAberbach, Joel D. 1990. Keeping a Watchful Eye: The Politics of Congressional\nOversight. Washington, DC: The Brookings Institution.\n2 Again, however, \"sufficient\" is relative; in some cases, Congress is constitutionally unable to take a\nmore active role in bureaucratic functions. In others, it may not want to. In still other cases, the\nactions desired by one house or one committee may be countermanded by another.\n\n17.202\nGeneral Exam #3 - Re-write\nBibby, John F. 1968. \"Congress' Neglected Function\" in Melvin R. Laird, ed., The\nRepublican Papers. New York: Praeger.\nDoyle, Richard B. 1986.\"Partisanship and Oversight of Agency Rules in Idaho.\"\nLegislative Studies Quarterly. 11:109-18\nFiorina, Morris. 1977. Congress: Keystone of the Washington Establishment. New\nHaven: Yale University Press.\nGovernment Accountability Office. 2010. \"Federal Education Funding: Overview of\nK-12 and Early Childhood Education Programs.\" GAO-10-51.\nLewis, David E. 2002. \"The Politics of Agency Termination: Confronting the Myth of\nAgency Immortality.\" Journal of Politics. 64: 89-107.\nMayhew, David. R. 1974 (2004). Congress: The Electoral Connection. New Haven:\nYale University Press.\nMayhew, David R. 1991 (2005). Divided we Govern: Party Control, Lawmaking, and\nInvestigations, 1946-2002. New Haven: Yale University Press.\nMcCubbins, Mathew D., Roger G. Noll, and Barry R. Weingast. 1987. \"Administrative\nProcedures as Instruments of Political Control.\" Journal of Law, Economics, &\nOrganziation. 3 (2): 243-277.\nMcCubbins, Mathew D. and Thomas Schwartz.\nOverlooked: Police Patrols versus Fire Alarms.\"\n1984. \"Congressional Oversight\nAmerican Journal of Political\nScience.\nMoe, Terry\n\nM\n28 (1): 165-179.\n. 1985. \"Control and Feedback in Economic Regulation: The Case of\nthe NLRB.\" American Political Science Review. 79 (4): 1094-1116.\nM. and William G. Howell. 1999. \"Unilateral action and presidential\npower: A theory.\" Presidential Studies Quarterly. 29(4): 850-872.\nOgul, Morris S. and Bert A. Rockman. 1990. \"Overseeing Oversight: New Departures\nand Old Problems.\" Legislative Studies Quarterly. 15 (1): 5-24.\nPearson, James. 1975. \"Oversight: A Vital Yet Neglected Congressional Function.\"\nKansas Law Review. 23: 277-288.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Bureaucracy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/b493f41afceb8ecb6b9c03c58f4e31b2_MIT17_202S10_Bureaucracy.pdf",
      "content": "17.202\nResponse Paper #7\nBureaucracy\nBecause we've discussed this so often with other political actors, I was intrigued by\nthe occasional discussion of the goals of the bureaucracy that showed up in this\nweek's readings. Carpenter (2006) stated his position most clearly (though still as\nan aside) that reputation, prestige, and esteem are motivators for bureaucracies.\nThis is obviously in contrast to the common perception of bureaucracies as seekers\nof greater budgets and program scope. In fact, Carpenter explicitly rejects this\nproposition (60). He cites Wilson in this discussion, and indeed, Wilson's\ndescription of the increasing professionalization of many agencies in the federal\ngovernment suggests that reputation (both internal to the agency as well as to th\nwider field in which a federal worker places him or herself) matters more than\ne\nmoney. This is in contrast to what Wilson sees as Niskanen's argument--that\nbureaucracies are interested in increasing their budgets and are able to do so by\nwithholding information from Congress about how exactly they have spent last\nyear's funds (118).\nIf my experiences in the federal government are anything to judge, most\nbureaucrats seemed to be struggling just to accomplish the goals of the program at\nhand. While they would all welcome additional funds (though not as a measure of\ntheir power, simply to get the job done), they would not welcome any kind of\nprogram creep. I'm curious what others see as the goals driving the bureaucracy.\nDo they vary by level (operator, manager, political appointee)? How, if at all, can\nthese goals be leveraged to produce improved outcomes (where one can measure\nthe outcomes, that is)?\nThis last question dovetails nicely with another issue I was interested in this week--\nnamely, the means available to oversee the work of the bureaucracy in achieving\npolicy outcomes. Wilson concentrated primarily on the efforts internal to an\nagency--how do managers know what their subordinates are doing? Other authors,\nparticularly Moe and McCubbins, Noll, and Weingast were more interested in how\nbureaucracies are held accountable by forces external to the agency. It seemed like\nthe authors emphasized anticipatory actions--appointment of agency leaders,\nwith laws.\nrative procedures, etc--rather than on-going actions to ensure compliance\nThe possible excep\nadminist\ntion to this is the power of the judiciary to review\nagency actions, but Moe noted that the courts have historically made limited use of\nthese powers. I guess my question here is whether these anticipatory actions are\nsufficient. Would policy outcomes improve with additional on-going efforts to\noversee the bureaucracy? It's certainly a trade-off between allowing discretion and\nensuring accountability, but have we struck the right balance? Are we ensuring\naccountability on meaningless things (inputs or outputs) while granting too much\ndiscretion on the important issues (outcomes)? More importantly, perhaps, how do\nwe tell?\n1 I didn't see this argument explicitly in the sections we read of Niskanen, but it comports with his\nfindings that bureaucracies oversupply services and his conclusions advocating a reduction in the\nsize and scope of the government.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Congress",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/4d4e9b585388b89dd854690bd97ffd55_MIT17_202S10_Congress_es.pdf",
      "content": "17.202\nGeneral Exam #1 - Re-Write\nCongress\nThe application to political science of Hotelling's model of spatial positioning suggests\nthat competitive political parties will take positions on issues so as to capture the most\nvotes. In doing so, the parties will move towards the policy position of the median\nvoter. As a result, there will be little to distinguish these parties on policy issues.\nProvide theoretical reasons and empirical data to show whether or not Hotelling's\nmodel has proven applicable in American politics; you may concentrate on one branch\nof government, if you so choose.\nIn 1929, Harold Hotelling proposed a model of economic convergence and\nbriefly applied his idea to the political realm, stating that \"the competition for votes\nbetween the Republican and Democratic parties does not lead to a clear drawing of\nissues . . . Instead, each party strives to make its platform as much like the other's as\npossible\" (pg 54). Hotelling reasoned that, by taking a position close to the median,\na party would gain votes from moderates, but would not lose any voters at the\nextremes of the liberal-conservative spectrum, since these voters were unlikely to\never change parties. Party convergence is a useful first approximation to\nunderstanding party behavior, particularly applications of Black's related median\nvoter theory (1958). Unfortunately, the empirical evidence does not support\nHotelling's model at the level of US Congress; moreover, theoretical arguments have\nbeen advanced that explain why we should not expect convergence.\nIn terms of congressional voting patterns, it is clear that Democrat and\nRepublican politicians have not converged. Poole and Rosenthal (1997; 2007)\nfound that after a period of coming together in the mid-twentieth century, parties\n1 Note that even Hotelling did not anticipate full\nresult in a price war, rather than a stable equilibrium.\nconvergence: he says that \"excessive sameness\" will\nHowever, any new product will likely closely\nresemble those already on the market, with some plausible \"improvement\" (pg 54).\n\n17.202\nGeneral Exam #1 - Re-Write\nbegan moving away from each other again, such that party polarization is now as\nstrong as it was in the early 1900s (pg 107). It is hard to support an argument that\nparties converge on the views of the median voter, when elected leaders\ndemonstrate virtually no overlapping ideological positions (see also Erikson and\nWright 1989, who find that congressional candidate positions diverge).\nAdditionally, in looking at party behavior in state legislatures, Gerber (1996) found\nthat states enacted laws that were more similar to the median voter position when\nthe state allowed for voter initiatives. Congress--obviously not faced with the threat\nof voter initiatives--likely behaves similarly to Gerber's legislatures in states\nwithout initiatives. There is also evidence that Congressional parties occasionally\nstake a very clear claim to represent a distinct platform. In particular, the 1994\nContract with America allowed Republican congressional candidates to campaign on\na platform explicitly different from that pursued by Democrats.\nA factor preventing convergence in Congressional parties is that individual\nconstituencies are not microcosms of the nation as a whole. In a game-theoretic\nmodel, Snyder (1994) shows that parties are likely to choose disparate platforms\nthat allow them to maintain a hold on safe seats. He claims that individual interest\nin electoral outcomes in one's own district trump a collective interest in expanding\nthe reach of the party. It may be, then, that parties diverge at the national level, but\nthat electoral competition within districts is described by convergence to an\nelectorally-relevant district median. However, the empirical data do not support\nthis view, either. Ansolabehere, Snyder, and Stewart (2001) find that convergence\nat the local level is, if anything, less likely than at the national level. In fact, between\n\n17.202\nGeneral Exam #1 - Re-Write\n1874 and 1996, only two of the 1,814 elections studied showed strong evidence of\ncandidate convergence (pg 148). McCarty, Poole, and Rosenthal (2007) also find\nthat Congressional polarization stems primarily from differences in the behavior of\nDemocrats and Republicans representing the same district, rather than other\npotential patterns that could lead to polarization. This finding indicates that, at least\nat the level of roll call voting after election to Congress, Democrats and Republicans\nare not converging at the district level.\nWhat explains this lack of convergence? One reason is that parties are not\nfacing a unidimensional array of issues. On one dimension, the equilibrium position\nfor both parties to take is the median voter position (Downs 1957), but in a\nmultidimensional space, there typically is no equilibrium (Aldrich 1995). Some\npredict that parties will continue to converge in the absence of an equilibrium\n(Kramer 1977), while other scholars have shown that when one party outperforms\nthe other on a significant valence issue, there is an equilibrium where the\nadvantaged party selects a moderate policy stance with the other party choosing a\nmore extreme position (Ansolabehere and Snyder 2000, McDonald and Rabinowitz\n1998).\nAnother problem that arises when policy choices become increasingly\nmultifaceted is the increasing difficulty justifying assumptions of full information on\nthe part of candidates and voters. While it may seem as though candidates should\nhave a good sense of their district's preferences, they likely do not have full\ninformation on a wide array of policy choices. For example Miller and Stokes (1963)\nfound that although Representatives know their district's position on civil rights (a\n\n17.202\nGeneral Exam #1 - Re-Write\nhighly salient issue), they have imperfect information about the views of their\nconstituency on less salient issues, such as foreign policy. More recently, Butler and\nNickerson (working paper) showed that state legislators were more likely to vote in\nline with their districts when provided survey data about their district's\npreferences. While national representatives may have more resources to ascertain\ndistrict opinion than do state representatives, it seems unlikely that they are\nsufficiently informed to understand the median voter position on a wide range of\nissues.\nAnother problem with informational requirements is at the voter level.\nAlthough Downs theorized that parties will converge even when voters are not\npaying attention to the elections, other spatial models assume that voters are\nrationally choosing a preferred alternative. This assumption requires voters have\nclear preferences about policy positions and know the position of the two parties.\nThis is a strong assumption, when evidence suggests that voters often lack political\ninformation (Converse 1964), frequently vote based on economic factors over which\na single Congressman has little control (Mayhew 1974) or based on retrospective\nevaluations of policies with which the politician may or may not have been involved\n(Fiorina 1981), and often re-elect incumbent candidates regardless of party. Baron\n(1994) presents a theoretical model showing that, in the presence of uninformed\nvoters, parties will diverge to cater to the subset of knowledgeable voters who may\n\n17.202\nGeneral Exam #1 - Re-Write\ntake more extreme positions. As the percentage of uninformed voters increases, so\nwill the divergence of party positions.\nKnowledgeable and active voters may also play a key role in pulling apart the\nparties. Aldrich and McGinnis (1989) show that there is a stable (and divergent)\nequilibrium even in multidimensional space for policy-motivated activists. As\nAldrich (1995) notes, this activist equilibrium \"has the potential for adding pressure\ntoward divergence in a theory that otherwise mostly yields convergence\" (pg 185).\nIndeed, Wright (1994) finds that party divergence in Congressional roll call votes is\nprimarily due to pressure from activists within politicians' districts or states.\nIn short, although Hotelling's model may provide some intuition into how\nparties think about attracting voters, there are powerful theoretical reasons why\nthis model may not apply in practice, particularly at the Congressional level. More\nimportantly, the empirical data simply do not support the view that parties\nconverge in their ideological positions to the median voter position, either on a\nnation-wide basis or in district- or state-specific contests.\nReferences\nAldrich, John H. 1995. Why parties? The origin and transformation of political\nparties in America. Chicago: The University of Chicago Press.\nAldrich, John H. and Michael McGinnis. 1989. \"A model of party constraints on\noptimal candidate positions.\" Mathematical and Computer Modeling. 12(4\n5): 437-450.\n2 While speaking to a slightly different point, Heatherington (2001) notes that \"those who place\nthemselves near the poles of the seven-point scales demonstrate an understanding of ideology and\npartisanship and hence should be more inclined to see differences [between parties] than those who\nplace themselves at mid-scale\" (625). Thus, the more partisan respondents are also more\nknowledgeable about ideological positions; the reverse may also be true, though Baron's findings do\nnot rest on this assumption.\n\n17.202\nGeneral Exam #1 - Re-Write\nAnsolabehere, Stephen and James M. Snyder, Jr. 2000. \"Valence politics and\nequilibrium in spatial election models.\" Public Choice. 103: 327-336.\nAnsolabehere, Stephen, James M. Snyder, Jr., and Charles Stewart III. 2001.\n\"Candidate positioning in U.S. House elections.\" American Journal of Political\nScience. 45(1): 136-159.\nBaron, David P. 1994. \"Electoral competition with informed and uniformed voters.\"\nAmerican Political Science Review. 88(1): 33-47.\nBlack, Duncan. 1958. The theory of committees and elections. Cambridge:\nCambridge University Press.\nButler, Daniel and David Nickerson. \"Are Legislators Responsive to Public Opinon?\nResults from a Field Experiment\" (working paper). butler.research.yale.edu\nConverse, Philip E.\nDavid Apter (ed.)\n1964.\nIdeology and Discontent\n\"The Nature of Belief Systems in the Mass Publics,\" in\n. New York: Free Press.\nDowns, Anthony. 1957. An Economic Theory of Democracy. New York:\nErikson, Ro\nHarperCollins.\nbert S. and Gerald C. Wright, Jr. 1989. \"Voters, Candidates, and Issues in\nCongressional Elections,\" in Congress Reconsidered, 4th ed., ed. Lawrence C.\nDodd and Bruce I. Oppenheimer. Washington, D.C.: Congressional Quarterly\nPress.\nFiorina, Morris. 1981. Retrospective Voting in American National Elections. New\nHaven: Yale University Press.\nGerber, Elizabeth. 1996. \"Legislative Response to the Threat of Popular Initiatives.\"\nAmerican Journal of Political Science. 40: 99-128.\nHeatherington, Mark. 2001. \"Resurgent Mass Partisanship: The Role of Elite\nPolarization.\" American Political Science Review. 95: 619-631.\nHotelling, Harold. 1929. \"Stability in Competition.\" The Economic Journal. 39: 41\n57.\nKramer, Gerald H. 1977. \"A dynamical model of political equilibrium.\" Journal of\nEconomic Theory. 16: 245-268.\nMacDonald, Stuart Elaine and George Rabinowitz. 1998. \"Solving the paradox of\nnonconvergence: valence, position, and direction in democratic politics.\"\nElectoral Studies. 17(3): 281-300.\nMayhew, David. [1974] 2004. Congress: The electoral connection. New Haven: Yale\nUniversity Press.\nMiller, Warren E. and Donald E. Stokes. 1963. \"Constituency influence in Congress.\"\nAmerican Political Science Review. 57: 45-56.\nPoole, Keith T. and Howard Rosenthal. [1997] 2007. Ideology and Congress. New\nBrunswick, NJ: Transaction Publishers.\nSnyder, James M., Jr. 1994. \"Safe Seats, Marginal Seats, and Party Platforms: The\nLogic of Platform Differentiation.\" Economics and Politics. 6: 201-213.\nWright, Gerald C. 1994. \"The meaning of 'party' in congressaional roll call voting.\"\nPaper delivered at the annual meeting of the Midwest Political Science\nAssociation, Chicago, April 14-16.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Congress – Party, Polarization and Ideology",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/f0f664433785be7106d4d01c1202d0e7_MIT17_202S10_Congress_II.pdf",
      "content": "17.202\nResponse Paper #2\nCongress - Party, Polarization and Ideology\nKrehbiel focused on answering the question: why is Congress continually mired in\ngridlock? He developed a theory emphasizing the constraints of dealing with\nCongressional rules requiring supermajority support for many types of legislati\nWithout surpassing these \"pivotal points,\" Congress is unable to effectively pass\non.\nlaws. This is true regardless of whether Congress and the president represent the\nsame party. I thought Krehbiel's illustration on page 41 showing how it was\ntheoretically possible that the unified government under Clinton would be unable to\nsurpass the supermajority requirements was particularly illuminating.\nCox and McCubbins, though telling a very different story about how Congress\nfunctions, also provided evidence for why legislating may be difficult. Their theory\nrested on the power of the Speaker (and, though not explicit, the related power of\ncommittee leaders). The Speaker exercises significant control over which bills come\nbefore the floor of the House--and under what rules they are considered. These\nrules mean that committees, in proposing legislation, must consider the (potentially\nvery different) ideal points of (1) the committee, (2) the Speaker, and (3) the House\nfloor.\nFinally, Poo\nIf these ideal points are too dissimilar, no legislation will be proposed.\nle and Rosenthal's data show that the ideologies of Congressmen in the\ntwo parties began moving away from each other about 30 years ago, when\nRepublicans replaced Democratic congressmen in the south. At this point, there is\nno overlap in the parties' coalitions, which should make legislating more difficult.\nIt also seems to me that there are other potential constraints on Congress' ability to\nenact legislation. For example, I would think that anticipat\now some Congressmen\nother chamber or in the White House could play a part in h\nion of priorities in the\nact. However, Poole and Rosenthal show a regression that this is uncommon at best.\nThey also claim that many votes on legislation coming out of the conference\ncommittee is passed overwhelmingly. That could mean the conference committee is\nreally good at what they do, or it could mean that the conference committee is\nanother place where bills go to die. Many of the authors also hinted at the power of\nthe committee chairs (most explicitly, Cox and McCubbins), and clearly they can and\nhave played a big role in stopping legislation of which they don't approve.\nIn light of all these constraints, my biggest question is: how does Congress pass any\nlegislation at all? Every year, a budget eventually gets passed. Major legislation--\nincluding emergency bills like the stimulus package and non-emergency laws like\nNo Child Left Behind--also gets through this gauntlet. What are the situations that\nprovide Congress with sufficient fortitude (or votes) to get a bill signed?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Congress – Representation and Institutionalization",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/1155cc0fe197967f1f6499c4015dfca8_MIT17_202S10_Congress_I.pdf",
      "content": "17.202\nResponse Paper #1\nCongress - Representation and Institutionalization\nI decided to focus on two of the selections we read and how I think their analyses\nare complementary. Miller and Stokes identified three mechanisms for how House\nmember behavior with regard to their constituencies: acting as a Burkean\nrepresentation of constituency interest, rather than constituency will; towing the\nline of a responsible party; and serving as an instructed delegate, guided by\nconstituency opinion. Not surprisingly, the authors found that issue salience and\nthe knowledge and understanding voters had\ntype of behavior the House members assumed.\nof issues made a difference in what\nFor issues such as civil rights, where\nvoters understood the issues and found them to be highly salient, Miller and Stokes\nfound that representatives were well aware of\nn predicting roll call votes. On other\nthis awareness was \"preeminently important\" i\ntheir district's sentiments and that\nissues, such as foreign affairs, where the public is less well-informed, Congressmen\ntend to look to other sources to guide their votes. In particular, Miller and Stokes\nsaw Congressmen looking for guidance from the executive branch.\nThis idea--that congressional behavior varies across issues--is one that, in my\nmind, dovetailed nicely with Mayhew's analysis of credit claiming and position\ntaking, as well as their level of interest in mobilizing their colleagues. Mayhew did\nnot spend much time analyzing behavior with regard to specific issues, with the\nexception of how these issues related to the various committees, such as the chaos\nassociated with issues overseen by the Education and Labor committee. However, it\nseems as though the salience of issue areas amongst the public likely guides\nwhether and how a congressman will try to take credit or stake a position. For\nexample, one of Miller and Stokes foreign policy issues, aid to neutral countries,\nprobably would not inspire many congressmen to claim credit, as there is no easily\nconveyable positive outcome; to take a position, as most people probably do not\nknow of (or care about) our plans for neutral country foreign aid; or mobilize\nothers, as, again, there is no clear electoral benefit on this issue. Another issue\nraised in Miller and Stok\nbehavior by congressmen.\nes analysis, public housing, would likely lead to different\nThey might claim credit for keeping a public housing\nproject out of a downtown area, but could also simultaneously take a position in\nfavor of affordable housing.\nIn short, I feel like there may be empirically-testable patterns for how congressmen\nuse the different strategies identified by Mayhew in advancing their electoral\nprospects.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Courts I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/2ddf26bf250b78c455181b45269f2352_MIT17_202S10_Courts_I.pdf",
      "content": "17.202\nResponse Paper #5\nCourts I\nFor anyone who sees the Courts as a powerful, independent branch of government,\nthis week's readings were pretty disillusioning. Rosenberg made a convincing case\nthat the Courts are not able to effect broad social change without the consent of\nbroad swaths of the rest of government or the public. Dahl claimed that, in the rare\ncases where the Courts express an opinion contrary to the ruling majority, the\nlegislature is quick to overturn the judiciary. Whittington theorized that the Courts\ncan be captured by other parts of government to take the heat by making unpopular\nbut politically desirable decisions. Only Casper presented an argument in favor of\nan independent and influential Court and I, personally, wasn't convinced of his\nevidence.\nIn general, I thought the papers we read this week did a fairly poor job of\nmarshalling evidence to support their claims. The articles, in many ways, seemed to\ntreat Supreme Court outcomes as suffering from similar small-N problems as did\nresearch on the presidency. Dahl only examined 78 cases; Whittington's argument\nwas based on 5 cases; Casper added 28 cases to Dahl's analysis and suggested\nextending his arguments further, but offered only a few cases to illustrate this\nextension. Rosenberg, in the section we read, looked at a handful of civil rights\ncases (and closely at only one), though he also brought a variety of other evidence to\nbear on his argument.\nexamined, I was left\nWhile I understand in each case why so few cases were\nfeeling like I still couldn't speak to the influence or\nindependence of the Court more generally. The authoritative source, WikiAnswers,\nsuggested that courts hear between 75 and 100 cases a year, meaning they've\nconservatively heard 15,000 cases - certainly not a small N, and ripe for more\nquantitative analysis (which is, perhaps, coming next week).\nOne thing that could have been done, for example, would be to analyze whether the\nSupreme Court shows deference to the executive branch. Rosenberg (I believe)\nprovided statistics about how often the Court grants certiorari to cases when\nrequested by the executive branch as well as information about how often cases are\ndecided in favor of the government when it is a party or a \"\nboth cases, the statistics seem to show a clear deference to the government, but\nfriend of the court.\" In\ncould be misleading on their face. I don't believe Rosenberg excluded cases like the\none inmate who filed more than 700 appeals, most of which were refused, and\nwould serve to skew the numbers. Further, because the government is involved\nwith litigation at this level more frequently, it is likely that the government is simply\nbetter\nresults.\nthan other parties at making such arguments, which would also skew the\nI would have liked to see an analysis that tried to account for some of the\nstructural reasons why the government is likely to win (both in terms of getting a\ncase heard and in the decisions).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Courts II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/60f84aa6671577b74048ee6ae218d4b1_MIT17_202S10_Courts_II.pdf",
      "content": "17.202\nResponse Paper #6\nCourts II\nI intuitively agree with Segal and Spaeth's conclusion that Supreme Court justices\nare guided in their decision-making by their personal beliefs and attitudes. For one\nthing, if jurists ideological beliefs were not important, the party of the president who\nnominated a justice would not matter, which seems clearly at odds with the facts. I\nalso acknowledge the difficulties the authors face in attempting to empirically prove\ntheir assertion that judges act on attitudes rather than precedent. As difficult as\nidentifying congressional ideal points was, I see that determining a judicial ideal\npoint is exponentially more complicated. However, given both these points, I was\nnot convinced by the evidence presented by Segal and Spaeth as to whether judges\nare restrained by precedent in their decisions.\nThe authors consider the behavior of dissenting judges in the \"progeny\" of (a sample\nof and subsequently all) landmark cases as well as in a sample of \"ordinary\" cases.\nTheir argument is that the original case is decided based on true judicial preference,\nwhile if dissenting judges subsequently support the majority this shows deference\nto precedent. This feels circular to me--to determine whether judges vote based on\ntheir preferences, they start by assuming judges vote based on their preferences.\nThese landmark cases likely had precedents of some sort, meaning that you cannot\nsimply assume that rulings are entirely preferential. Additionally, as Segal and\nSpaeth point out, (1) precedent applies on both sides of any given case, (2) judges\nhave wide latitude to interpret the issue at hand in a case (e.g., their example of the\nChristian newspaper in Virginia), and (3) the facts of any particular progeny case\nmay be closely or only vaguely related to the relevant parent case. Given these\ncomplications, their argument seems to rely heavily on coding decisions--is a\nparticular justice's switching behavior based on a deference to precedent or because\nthe case facts differ?\nciting the case in passing?\nIs a particular case a progeny of a landmark ruling or simply\nWhile it may be that all judicial experts would agree on\nSegal and Spaeth's codings, without that knowledge, it feels a little like hand waving\nto me.\nA few other random thoughts on the readings: First, I wish we had read the\nchapters on certiorari, an issue that seems critical to understanding how the courts\nwork. It's particularly relevant to Segal and Spaeth's argument, since the only cases\nthe Court is likely to hear are ones where the precedent is somewhat ambiguous. If\na case is clear on the issues, it is first and foremost unlikely to be litigated at all,\ngiven the costs of litigation, nevermind rise to the level of the Supreme Court.\nSecond, Segal and Spaeth argue that judges are motivated by policy goals. I find it\nhard to believe that judges are so publicly-minded when we assume no actors in\nother branches are. Other than policy, are there other goals that might plausibly\nmotivate justices (e.g., legacy, as with presidents)?\nimpact the model put forward by Segal and Spaeth?\nIf so, how do these varying goals\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Interest Groups",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/9e4cc772ee1debb02362b0f1cf5ed788_MIT17_202S10_Interest_Grp.pdf",
      "content": "Response Paper #9\nInterest Groups\nThis week's readings spent a lot of time discussing how and why interest\ngroups might form and maintain themselves. Schattschneider started off this\nto serve diffuse interes\nhat interest groups tend to be small, as they are \"ill-designed\ndiscussion by noting t\nts\" (35), and biased toward the upper class. However, he\nnotes that these small, exclusive groups can widen the conflict by taking their case\nto the public, which changes the balance of power in an argument. I was a little\nunclear about whether the \"audience\" in this discussion was specifically the\ngovernment or if it was the wider polity, as seemed to be implied in some cases. If\nSchattschneider was referring to the latter, I think Olson raises some good questions\nabout whether the wider polity would do anything about such a conflict, even if it\nwas in their interests to care who won. It is, as he points out, irrational to engage in\nsuch a conflict when your actions are irrelevant to the outcome. The earlier\nquestion, which both Schattschneider and Olson raise, is whether there might be\nany (small and exclusive) interest group that would exist that could initiate a\nconflict likely to result in beneficial outcomes for the public. Olson ends his piece on\nthe depressing note that \"unorganized groups, the groups that have no lobbies and\nexert no pressure, are among the largest groups in the nation\" (165).\nSchattschneider estimates that 90 percent of the public is not involved in any way\nwith the \"pressure system\" (35).\nWalker's piece on interest group formation and maintenance painted a\nsomewhat rosier picture. He noted that private patrons--including the government,\nfoundations, and wealthy individuals--have been critical in initiati\nsupporting a wide range of interest groups, including citizen groups.\nng and\nOlson\nexplained that the start-up costs for large, latent groups (such as Walker's citizen\ngroups) are typically preventatively high. In a small group, interested parties know\neach other and may not need an organization to maintain themselves (especially if\none or more participants have an incentive to support the group interest on their\nown). In larger groups, on the other hand, initial efforts must be taken to identify\npeople to deny their\nerested, organize a subset to form the group, and convince\nthose who might be in\nin\nt\ndividual interest in free riding to gain relatively small\ncollective gains. If, as Walker found, private patrons can fund this initial start-up\ncost (and, potentially, any selective incentives the group could offer to attract\nmembers), it may be significantly easier to bring together latent groups.\nwonder--as Walker himself pointed out--if he was studying a particular\nI did\nthere was increased interest in promoting citi\ntime when\ncontemporary success of Ralph Nader, for example.\nzen group power, based on the\nA final depressing note came from Lowery and Gray, who found that interest\ngroup density is defined by environmental factors. While they were looking within\nspecific industries, rather than across the wide range of potential interest groups,\ntheir findings suggest that there might be an overall limit to the number of groups a\nsystem can hold. If that's the case, and small, moneyed interests are easier to form,\nit seems entirely plausible that we'll reach our limit before we get to any latent\ngroups that might be able to organize and maintain themselves in the absence of\nsuch environmental constraints.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Parties",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/e9957913e0d830a7618ba7ab740d8efd_MIT17_202S10_Parties.pdf",
      "content": "17.202\nResponse Paper #8\nParties\nWhile it's an important and obvious fact of American politics, I'm somehow always\nsurprised by how much difference the \"Solid South\" makes.\nReconstruction (and, later, the role of the Civil Rights and V\nThe Civil War and\noting Rights Acts) had\ntheir hand in the electoral results of national politics, the development of part\ncompetition in the South, the overlapping (and subsequent separation) of the\ny\nDemocratic and Republican parties in Congress, the development of public policies\nin southern states, and so much more. The three articles that discussed\ncontemporary parties all dealt with southern politics directly or indirectly. Key's\npiece, obviously, is all about how parties functioned i\ntwo-party competition or stable factions, the elected leaders largely governed\nn one southern state. Without\nwithout a clear policy platform and without consistent and reliable support from\nother politicians. Gibson, et. al., (in a previous article) found that state-level parties\nin the South were relatively weak for the Democrats and strong for the Republicans.\nThey attribute the strength of the Republican party to a national-level efforts to\ndevelop state parties in the South, while the Democratic party made no such effort\nuntil later. Finally, even though Bartels finds that resurgent partisanship was not\nregionally-based, he nonetheless speculates that the changes in the south led to\nnation-wide partisanship changes. I don't know that I have a question here, but I\nguess I'm just generally interested in how this \"Solid South\" phenomenon influences\nour politics, how long this issue will continue to influence our understanding of\npolitics and policy, and what the normative impacts of these issues are.\nAnother issue I found interesting was Aldrich's discussion of parties as creations of\npoliticians to solve a variety of collective action and other problems. In particular,\nhis contention was that parties are a solution to a variety of problems, but they often\nrepresent only one of a variety of possible solutions. While he did a good job of\nexplaining how parties addressed these issues, he didn't typically specify what the\nother institutions or solutions could be (clearly not central to his thesis, but it would\nhave been interesting). One issue I thought Aldrich might have explored further was\nthe extent to which parties became the solution-by-default. Once the country had\nexperience with how parties could address the challenges of elections and\ngovernment, why would they turn to other alternatives? This is where some\ndiscussion of what those other alternatives could be would be important. If there\nare other institutional arrangements that would provide similar advantages as\nparties, did anyone experiment with implementing those?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Parties/Interest Groups",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/cfdf0608354b570ab823a398cb93559b_MIT17_202S10_Parties_essay.pdf",
      "content": "17.202\nGeneral Exam #4 - Re-Write\nParties/Interest Groups\nThe role and impact of the Tea Party movement has been a constant media narrative\nin the lead-up to the 2010 midterm elections. What can the literature tell us about the\norigins of such social movements in America?\nThe Tea Party movement dates its origins to February 2009, when a handful\nof (largely unknown) conservative commentators urged the public to protest the\ngovernment's response to the financial crisis of the previous fall (McGrath 2010).\nSeveral different national organizations now claim to be involved in stirring support\nfor rallies and meetings, including the Tea Party Express, Tea Party Patriots, and Tea\nParty Nation, among others. According to Patchwork Nation, as of April 2010,\napproximately 67,000 people are members of one of these organizations (Chinni\n2010), though a mid-April New York Times/CBS poll estimated that about 18\npercent of Americans (or approximately 55 million) associate themselves with the\nbroader movement (Zernike and Thee-Brenan 2010). How did this group come\ntogether and how does it compare to other American social movements? The\nliterature on social movement formation is wide-ranging, so for the purposes of this\nessay I am going to focus on the role of leadership (both organizational and\nfinancial) in the growth of movements like the tea party.\nOne important debate in the literature is whether social movements arise\norganically out of crisis and deprivation or whether entrepreneurial leaders take\nadvantage of existing grievances to foster the rise of social protests. The traditional\npluralist literature maintains that for every interest a group will form (Bentley\n1949, Truman 1958); when faced with a common goal, such as a change in\n\n17.202\nGeneral Exam #4 - Re-Write\ngovernment policy, interested parties will come together to make their case.\nAlthough this view has largely fallen from favor in modern political science, more\nrecent authors maintain that organizational activity may arise spontaneously out of\ncrisis. In the 53 social movements studied by Gamson (1975), 39 were initiated\nduring \"turbulent\" times, such as the Great Depression (pg 112). Piven and\nCloward (1977; pg 3-4) claim that social protest emerges when the political system\nloses legitimacy and disaffected people begin to believe they can make a change by\nasserting their rights. The authors note that such spontaneous social movements\nare fostered when the \"routines of daily life\"--which maintain the social and\npolitical system--are broken (pg 10). This certainly comports with the foundations\nof the tea party movement, coming on the heels of the worst financial crisis since the\n1930s and leading to record levels of unemployment. On the other hand, many\nauthors suggest that crisis or increasing deprivation is not necessary to the\nformation of social groups (Jenkins 1983). McCarthy and Zald (1977) cite several\nstudies showing a relatively weak connection between actual or perceived\ndeprivation and the formation of social movements. Instead, entrepreneurial\nleaders \"prospect\" for issues that can mobilize a group (Diani 1996). Salisbury\n(1969) develops an economic model of this effort, where entrepreneurs offer a\npackage of benefits for potential group members in exchange for joining the\nmovement; this offer may be in response to a perceived grievance but need not be.\nIt is not clear that the tea party was initiated by an entrepreneurial leader, but\n1 Gamson does not claim these new interest groups were spontaneously formed, but the statistic is, I\nbelieve, important to note.\n\n17.202\nGeneral Exam #4 - Re-Write\ncertainly leaders have subsequently arisen that can fit the resource mobilization\nmodel. For example, the private (and costly) Tea Party Nation conference in\nFebruary may be considered an entrepreneurial effort to capture an otherwise\nspontaneous movement.\nAnother area of disagreement in the literature is the role of financial\nresources: some research notes the role selective benefits in internally funding such\nmovements, while other research highlights the importance of patrons in starting\nand maintaining interest groups. Olson (1965) is one of the first to observe the\nimportance of selective benefits in both forming groups as well as ensuring funding\nfor group efforts; in fact, he claims that without such benefits, collective action\ngroups are unlikely to exist. As mentioned above, Salisbury (1969) continues\nOlson's argument, theorizing that leaders put together a package of material,\nsolidarity, and expressive benefits that are offered for the price of membership.\nThe other side of this argument looks at the role of financial patrons in initiating\nsocial movements. McCarthy and Zald (1977) identify \"conscience constituents,\" or\nsupporters of a movement that do not stand to benefit from the collective good\nsought. These patrons typically help fund organizations that lack internal resources,\nbut seek to accomplish goals perceived as worthy. Walker (1983) finds strong\nsupport for the role of patrons in supporting citizen's groups. Eighty-nine percent of\n2 The \"price\" of membership need not be monetary; it can be as simple as signing a petition or, in\nother cases, more complex and expensive.\n3 Olson also sees a role for individual beneficiaries, such as when the individual share of a potential\ncollective benefit is more valuable to a patron than the cost of providing such a benefit to all.\nHowever, Olson believes such patrons are only likely to arise in small groups; in larger groups, the\ncosts of a collective benefit are probably too great (34). Although most of his discussion concerns\npatrons internal to an interest group, he notes that purposive benefits may inspire outsiders to\nrationally contribute to a cause (64).\n\n17.202\nGeneral Exam #4 - Re-Write\nthese groups received aid from an outside source to start their operations, and 43\npercent of citizen group revenue in 1980 stemmed from nonmember contributions\n(pg 398-400). Although the funding for tea party groups is not yet clear, it seems as\nthough much of the support comes from patrons rather than members. At a local\nlevel, there are likely limited costs and some are subsidized by national\norganizations, such as the Tea Party Patriots. There is speculation that national\norganizations, particularly the Tea Party Patriots, are funded by Republican think\ntanks and lobbying firms, such as FreedomWorks, though there is limited evidence\nto support (or refute) such claims (McGrath 2010).\nA final fault line in the social movement literature is whether groups benefit\nfrom organization and centralization. Piven and Cloward (1979) believe that\norganization is antithetical to the success of social movements. In their view,\nleadership spends time in organizational efforts for group maintenance, while their\ntime could be better spent pursuing the specific goals of the group. Moreover,\norganized leadership efforts often result in the \"channeling\" of concerns into\n\"normal politics,\" which may not serve the group's interest (pg xi-xii). On a related\nnote, McCarthy and Zald (1977) note that federated group, with local chapters, can\nbe formed more quickly than national movements seeking \"isolated constituents,\" in\npart due to the ability to leverage pre-existing social groups. Federation also lends\nstability to social movements, as isolated constituents are more ephemerally tied to\nthe cause (pg 1228). On the other hand, Gamson (1975) proposed that successful\nsocial movements tended to be more bureaucratized and centralized (pg 94), in part\n4 See http://www.teapartypatriots.org/AboutUs.aspx.\n\n17.202\nGeneral Exam #4 - Re-Write\nbecause centralization may prevent the splintering of a group into competing\nfactions (though, interestingly, bureaucratization does not prevent factionalization;\npg 104-105). Staggenborg (1988) echoed Gamson's argument, finding that\n\"formalized\" groups can engage in necessary activities, such as lobbying and\napplying for support from foundations; they are also able to maintain coordination\nwith other similar social movement organizations. The tea party is certainly\nfederated, with thousands of local groups only loosely affiliated with any national\norganization. It likely also benefits from pre-existing social ties, such as former\nmembers of the Reform Party or previously-mobilized retiree groups. Campbell\nfinds that senior citizens are highly mobilized by political parties, even lower\nincome seniors who are politically active with regard to Social Security funding. To\nthe extent that these groups are central the tea party movement, their previous\nmobilization can only be an advantage.\nThe origins of the tea party movement combine a complex mixture of\norganizational and financial leadership and loosely-tied local groups. As Jenkins\n(1983) notes, Zald and Ash (1966) contend that different organizational structures\nsupport different group goals; Jenkins also theorizes that most social movements\nlikely fall \"somewhere between\" the bureaucratic and decentralized models (pg\n5 A New York Times editorial referred to the tea party movement as \"a Frankenstein movement - an\nodd collection of factions, loosely stitched together, where the head, to the extent that it exists, fails to\ncontrol the body\" (Blow 2010).\n6 It is not entirely clear that the tea party movement is driven by either of these groups, however.\nSchaller (2010) of 538 and Balz (2010) of the Washington Post both compare the tea party to Perot's\nReform Party and find some similarities, but both conclude that there are important differences\nbetween the groups, notably the overwhelming support for the Republican party among tea party\nadherants. The New York Times/CBS poll found that tea party supporters tend to be over 45\n(Zernike and Thee-Brenan 2010), but an earlier USA Today/Gallup poll reported that tea party\nsupporters are only slightly more likely than all U.S. adults to be over 50 or retired (Saad 2010).\n\n17.202\nGeneral Exam #4 - Re-Write\n542). Entrepreneurial leaders and financial patrons have played only a moderate\nrole in the tea party movement thus far--they were not largely involved in the\norigins of the movement, but seem to be taking an increasing role as time\nprogresses. How these trends progress and influence the success of the tea party\nremains to be seen.\nReferences\nBalz, Dan. April 18, 2010. \"Don't be too quick to mistake tea party for Perot\nmovement.\" Washington Post.\nBentley, Arthur. 1949. The Process of Government. Evanston, IL: Principia Press.\nBlow, Charles M. May 8, 2010. \"Trying to Outrun Race.\" The New York Times.\nChinni, Dante. April 21, 2010. \"Tea party: How big is it, and where its it based?\"\nPatchwork Nation (http://patchworknation.csmonitor.com).\nDiani, Mario. 1996. \"Linking mobilization frames and political opportunities:\ninsights from regional populism in Italy.\" American Sociological Review.\n61(6):1053-1069.\nGamson, William A. 1990 (1975). The Strategy of Social Protest. Belmont, CA:\nWadsworth.\nJenkins, J. Craig.\nMovements\n1983. \"Resource Mobilization Theory and the Study of Social\n.\" Annual Review of Sociology. 9: 527-553.\nMcCarthy, John D. and Mayer N. Zald. 1977. \"Resource mobilization and social\nmovements: a partial theory.\" American Journal of Sociology. 82:1212-1241.\nMcGrath, Ben. February 1, 2010. \"The Movement: The rise of Tea Party activism.\"\nThe New Yorker.\nOlson, Mancur. 1965. The Logic of Collective Action: Public Goods and the Theory of\nGroups. Cambridge, MA: Harvard University Press.\nPiven, Frances F, and Richard Cloward. 1978. Poor People's Movements: Why They\nSucceed, How They Fail. New York: Vintage.\nSalisbury, Robert H. 1969. \"An Exchange Theory of Interest Groups.\" Midwest\nJournal of Political Science. 13(1): 1-32.\nSchaller, Tom. April 19, 2010. \"How Similar Are Tea Party and Perot Movements?\"\nFiveThirtyEight.com.\nStaggenborg, Suzanne. 1988. \"The Consequences of Professionalization and\nFormalization in the Pro-Choice Movement.\" American Sociological Review.\n53(4): 585-605.\nTruman, David B. 1958. The Governmental Process. New York: Alfred A. Knopf.\nZald, Mayer N. and Roberta Ash. 1966. \"Social movement organizations: growth,\ndecay and change.\" Social Forces. 44:327-341.\n\n17.202\nGeneral Exam #4 - Re-Write\nZernike, Kate and Megan Thee-Brenan. April 14, 2010. \"Poll Finds Tea Party\nBackers Wealthier and More Educated.\" The New York Times.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Comments on congressional readings",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-202-graduate-seminar-in-american-politics-ii-spring-2010/5747565276c3811ddbc16384ad4806cb_MIT17_202S10_readcomses3.pdf",
      "content": "Comments on congressional readings\nThis week's readings bring into focus three major themes in the congressional literature, the role of\nparties in Congress, the use of the spatial model in theory-building and prediction-making, and the\nproblem of measurement in congressional scholarship.\nRole of parties\nWe will spend plenty of time worrying about parties later in the semester, but Congress is an obvious\nplace to begin worrying about the role of parties in American politics. Americans --- both normal\nAmericans and American political scientists --- are of two minds about parties. We remember\nsomething the Founders said denigrating parties (or \"factions\") and (in popular culture) tend to view\nparties as something corrupt, stifling individual agency. At the same time, party affiliation is the most\npowerful predictor of a lot of political behavior, including mass behavior, and political scientists have\nspilled a lot of ink bemoaning America's weak parties and salivating over Europe's strong parties.\n(Perhaps realizing we are living in an era of strong American parties will diminish our appetite a bit.)\nThe history of how parties have been treated in congressional scholarship follows the popular and\nscholarly ambivalence. Focusing on scholarship, early political science was founded out of a conviction\nthat parties were corrupting devices and that professional social scientists had a duty to destroy them,\nor at least regulate them heavily. As a consequence, much of the early political science treating parties\nand Congress was reformist in nature and short on dispassionate analysis. A major exception was A.\nLawrence Lowell's 1902 essay on \"The Influence of Party Legislation in England and America,\" published\nin the American Historical Association proceedings. This essay is also notable (see the points below) for\nbeing the first quantitative study of roll call voting that I know about --- all from a historian. (The next\ntime you walk through the doorway leading from Lobby 7 to the Infinite Corridor, notice that the bronze\ndoorway is dedicated to him. Bow.)\nParties and Congress became noticed again in the middle part of the 20th century, as the behavioral\nrevolution came about. David Truman's Congressional Party (1959), is the classic here. The take-away\nthere was that party leaders were middle-men, negotiating the difficult factional politics of the parties,\nparticularly the Democrats. Here, the analysis is more scientific. The one problem, though, was that it\nwas done in a period that we now know to be atypical in America --- a time when the parties were\nespecially divided, in the electorate and in the government. So, the view of Truman, and those who\nfollowed (Mayhew's essay from last week is infected with this view) may have tended to generalize\nsomething that was atypical in American politics.\nAnother feature of the mid-century literature on party and Congress is that there was an undercurrent\nof worry that the Democratic party is insufficiently liberal, or rather, that the liberal majority body\nseemed to be wagged by the conservative southern tail. We didn't read any of this literature, but\naddressing this argument became the work of David Brady and some of his collaborators. (For instance,\nsee his article with Joseph Cooper, \"Institutional Context and Leadership Style: The House from Cannon\nto Rayburn.\") The long and short of this literature is that if, by \"strong parties\" we mean parties that\nstrong-arm followers into loyalty, the historical electoral and government environment has been hostile\nto strong parties. So, leaders like Rayburn are weak not because they lacked backbone, but because the\nelectoral environments of the parties was so diffuse. Strong leaders like political scientists and activists\nwanted at the time wouldn't last a day (or at least an election cycle.)\n\nWhen the rational choicers came along, they had two opportunities. For those who believed that\nAmerican parties are always \"weak\" (whatever that means), the technology of spatial voting theory\nprovided a mechanism to explain the service that party leaders provide. If parties are really atomistic to\ntheir core, then it would be natural that centrists would be chosen as leaders, and it would also be\nnatural that they would be given the task of coordination, rather than strong-arming. Krehbiel's book\n(and his other work) is very much influenced by the \"weak parties\" view. Parties are so weak, in fact,\nthat the D's and R's we observe are simply convenient labeling devices.\nThe interesting thing about Cox and McCubbins (and their other works, including the newer Setting the\nAgenda [2005]) is that they take seriously the need to create a theory that produces positive levels of\neffort by party leaders [think about one implication of Krehbiel's work --- all the effort of party leaders\nmust be based on their being delusional]. As I mentioned in class, the book we read was written at a\ntime when the theory of the firm was a hot topic among institutionalists. It's not so hot these days, but\ncoordination continues to be something we all worry about.\nAnother work we didn't read, but which is huge, is David Rohde's Conditional Party Government book.\nKrehbiel discusses it, so you probably have a sense of his argument, at least in its straw person version. I\nwould encourage you to read the book yourself one way, so that you can judge for yourself. It's hugely\ninfluential (and relatively short).\nTo conclude this part, the role and power of parties continues to be one of the hottest topics in the\nstudy of Congress today. For someone preparing for a general exam, for instance, it is important for you\nto understand what it means for parties to be \"strong,\" why it's difficult to achieve, what the marks of a\nstrong legislative party might be, what the historical trends are, etc. In other words, this should be a\nmajor focus of your study.\nSpatial model\nThe spatial model is behind all of the three readings for this week. Krehbiel's book relies on it explicitly\nin its core argument, and much of the Cox/McCubbins book can easily be put in the context of the\nspatial model, too. My Analyzing Congress has an accessible (I hope) introduction; Enelow and Hinich's\nThe Spatial Theory of Voting is also accessible, if more technical.\nMost people encounter the spatial model via Downs's Economic Theory of Democracy. Downs's account\nof the theory is actually filled with a couple of important errors, so I do encourage you to move on from\nthere. The founding use of the spatial theory in the study of Congress is actually Duncan Black's The\nTheory of Elections and Committees (1956).\nIn my mind, the instability and chaos results of the multidimensional spatial model provide a way of\nthinking about some of the most profound questions of democratic life and the rule of political\ninstitutions in complex societies. They are very disturbing. However, after about 30 years of noodling\non the spatial model in great depth, we have mostly settled on building and interrogating one-\ndimensional models. They're complicated and interested enough that if you're willing just to suppress\nthe thought that there really are no equilibria in politics, you'll go far.\nAs a student of American politics, it is very important that you feel comfortable manipulating the\nunidimensional spatial model, including understanding how common institutional features interact with\n\nit. These institutional features include various voting rules (like the filibuster and veto rule Krehbiel\nhighlights) and practices like endowing certain sub-institutions (like committees) with agenda-setting\nand veto powers. In fact, understanding these things will allow you to gain a fuller, and more precise,\nappreciation of what Cox and McCubbins are talking about.\nMeasurement\nTo the degree that Congress legislates (as opposed to offering a cushy job that people was to hold just\nfor the sake of holding), understanding how inputs (preferences) translate into outputs (policy) is very\nimportant. From the moment scholars tried to approach Congress scientifically, the issue of measuring\ninputs and outputs precisely rose to the fore. (Think about A. Lawrence Lowell again.)\nEfforts like Miller and Stokes's article we read a couple of weeks ago, and even the work I've done with\nJim and Steve A., are all attempts to try and gauge the rawest of legislative inputs, the preferences of\nthe members themselves. Keep in mind that this is a terribly difficult thing to do, and I would caution\nagainst assuming you can ever successfully do this. (One cautionary story, for instance, is that after we\nwrote our paper using the Project VoteSmart data, the party campaign committees cautioned their\ncandidates against responding to the survey. Nowadays, only fringe candidates tend to fill out the\nsurvey.)\nBecause of the difficulties in measuring \"pure\" legislative preferences, political scientists and activists\nhave attempted to measure the preferences of members, or at least their behaviors, in a systematic\nfashion. As I mentioned, in the 1940s, the New Republic started calculating the percentage of times\nmembers of Congress voted in a liberal manner, which eventually morphed into the ADA (Americans for\nDemocratic Action) score. Many other interest groups followed suit. You can't swing a dead cat in DC\nnow without hitting an interest group with a support score.\nSome cautions about these scores. One of these, attributable to Jim Snyder's \"Artificial Extremism...\"\narticle is that the purpose of these scores is to separate friends from enemies, not provide a clean\npsychological measure. There's also a literature showing convincingly that while you might think that\nthe different interest groups are measuring different things, the components of their scores are often\nthin on votes that pertain to the interest group's interests --- most of these scores are actually based on\nthe same roll call votes, they aren't independent. So, because they're basically all versions of a left-right\nideological scale, they have another glaring problem: they're usually based on a small number of votes\nwhich are atypical.\nEfforts by Keith Poole, Jim Snyder, and others have tried to overcome the glaring problems of interest\ngroup ratings --- to the point that I'm surprised when anyone uses them rather than Poole-Rosenthal or\nHeckman-Snyder score. These comprehensive scales are simply better measures.\nI made mention of a great lecture Keith Poole once gave about the history of dimensional analysis. I'm\nstill searching for the video, and when I find it, I'll give you the link.\nThe Poole-Rosenthal corpus convinces me that there is a great, powerful regularity to the behavior of\nlegislators that most casual observers don't appreciate, and many experts overlook, too. Where the\nregularity comes from remains an important question. P&R normally take the position that the\nregularity and low dimensionality comes from the type of issue constraint first described in the\nAmerican Voter research of the 1950s. What are the other factors, though, and can we partition among\n\npsychological recruitment, electoral, party activity, and institutional factors. On top of all of this, to\nwhat extent is the regularity and low dimensionality just an artifact of the statistical technique --- if you\ncrunch a bunch of numbers through an algorithm that is based on a maintained hypothesis of low\ndimensionality, that's what you're going to get.\nI do not expect you to be able to reproduce the WNOMINATE procedure. However, at some point in\nyour training, learning some data-reduction technique, such as principal component factor analysis\n(which is the basis of the Heckman-Snyder procedure) would be very useful --- at least to convince you\nthat the output of such procedures isn't magic.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.202 Graduate Seminar in American Politics II\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}