{
  "course_name": "Gödel, Escher, Bach",
  "course_description": "How are math, art, music, and language intertwined? How does intelligent behavior arise from its component parts? Can computers think? Can brains compute? Douglas Hofstadter probes very cleverly at these questions and more in his Pulitzer Prize winning book, “Gödel, Escher, Bach”. In this seminar, we will read and discuss the book in depth, taking the time to solve its puzzles, appreciate the Bach pieces that inspired its dialogues, and discover its hidden tricks along the way.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Cryptography",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Philosophy",
    "Science",
    "Cognitive Science",
    "Engineering",
    "Computer Science",
    "Cryptography",
    "Humanities",
    "Literature",
    "Creative Writing",
    "Philosophy",
    "Science",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nDescription\n\nThis course, as part of the Experimental Study Group Seminar Series, offers students the opportunity to participate in a small discussion-based class. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nHow are math, art, music, and language intertwined? How does intelligent behavior arise from its component parts? Can computers think? Can brains compute? Douglas Hofstadter probes very cleverly at these questions and more in his Pulitzer Prize winning book, \"Godel, Escher, Bach\". In this seminar, we will read and discuss the book in depth, taking the time to solve its puzzles, appreciate the Bach pieces that inspired its dialogues, and discover its hidden tricks along the way.\n\nGrading\n\nThis course is graded pass/fail. Getting a \"pass\" grade is very straightforward:\n\nAttend the seminar. You can miss two class sessions and still pass; more than that, and you'll have to make up the missed sessions somehow.\n\nDo the reading before each class, and participate in discussions.\n\nComplete the assignments that I'll give out at various times (no more than once a week).\n\nText\n\nThe course text is, of course, the book:\n\nHofstadter, Douglas.\nGodel, Escher, Bach: An Eternal Golden Braid\n. New York, NY: Basic Books, 1999. ISBN: 9780465026562.",
  "files": []
}