{
  "course_name": "Hands-On Astronomy: Observing Stars and Planets",
  "course_description": "This class introduces the student to the use of small telescopes, either for formal research or as a hobby.\nThis course covers background for and techniques of visual observation, electronic imaging, and spectroscopy of the Moon, planets, satellites, stars, and brighter deep-space objects. Weekly outdoor observing sessions using 8-inch diameter telescopes when weather permits. Indoor sessions introduce needed skills. Introduction to contemporary observational astronomy including astronomical computing, image and data processing, and how astronomers work. Student must maintain a careful and complete written log which is graded. (Limited enrollment with priority to freshmen. Consumes an entire evening each week; 100% attendance at observing sessions required to pass.)",
  "topics": [
    "Engineering",
    "Computer Science",
    "Graphics and Visualization",
    "Health and Medicine",
    "Spectroscopy",
    "Science",
    "Earth Science",
    "Planetary Science",
    "Physics",
    "Astrophysics",
    "Engineering",
    "Computer Science",
    "Graphics and Visualization",
    "Health and Medicine",
    "Spectroscopy",
    "Science",
    "Earth Science",
    "Planetary Science",
    "Physics",
    "Astrophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3+ hours / session\n\nOverview\n\nThis seminar covers background for and techniques of visual observing and imaging with a small telescope. As the physics and math involved are elementary, 12.409 does not make the brain-bashing problem-set demands characteristic of many other MIT courses.\n\nHowever, you will need to invest a fair amount of time and care in your work for the course, and the time investment tends to collide with some of your prime homework-time. Clear nights in Cambridge are rare enough that we must take full advantage of each one: sometimes we're extremely fortunate, with a section getting 5 to 7 clear nights during the term. Sometimes we're extremely UNfortunate, and a section gets only 2 or 1 (or less?) useful nights. As any given class night may be an 'observing night', you must be prepared to devote one entire evening each week to 12.409.\n\n12.409 uses six 8-inch reflecting telescopes; you'll be paired off and work two persons per scope. We set up the telescopes on campus until you've had enough experience to be able to take full advantage of a darker locale.\n\nGrading\n\nYour pass/fail grade will be determined using two criteria:\n\nAttendance\n\nAs 12.409 is a hands-on 'techniques and experience'-type course, we state the following for the record: in order to pass 12.409, you must attend your section each week. Actually, this will probably be the most challenging part of this seminar - arraying your other commitments to handle one night a week of observing.\n\nIt's possible that, despite all your best efforts to pick a class night you can make every week, some unforeseen illness, personal emergency, or critical schedule conflict will crop up during the term on a class night and force an \"excusable\" absence. If this happens, contact your section instructor promptly, before the class if at all possible. We don't hassle you for one excusable absence, although it's virtually guaranteed to be on a clear night for your section. However, requests to excuse more than one absence are looked upon with extreme disfavor, and generally speaking are not granted except in extraordinary circumstances.\n\nA student puts it succinctly: \"two misses equals death.\"\n\nNormally to make-up a class we'll give you a written lab exercise to complete. It's difficult to arrange to make-up a class by attending another section, since sections of 12.409 are usually quite full and non-uniform weather causes them to diverge soon after the first week anyway.\n\nAbsences for reasons under your control are not excused, such as \"punting\", \"have to prepare for a quiz scheduled/paper due for the following morning\", or \"unprepared for class\" (too tired, didn't bring warm clothes, etc.). In case of an unexcused absence you'll be encouraged to drop the subject and try again in some future term as an alternative to the failing grade you otherwise would receive. We also reserve the option of counting repeated tardiness as an unexcused absence.\n\nIF THIS SEEMS TOO EXTREME A TIME COMMITMENT, PLEASE RECONSIDER NOW WHETHER THIS SEMINAR IS REALLY THE RIGHT ONE FOR YOU!\n\nObserving Notebook\n\nYou'll need to have some sort of laboratory notebook to use for recording observations and writing calculations. In 12.409, it will be inspected by your instructor as a major criterion for evaluating your performance in the course.\n\nPlease get yourself an observing notebook before your first 12.409 class. An 8.5- by 11-inch spiral-bound notebook of about 50 pages has always been more than enough for an entire term (even assuming piles of clear nights), so that's what we recommend. Some observers prefer a notebook with lined or graph-paper pages (to help in reproducing angles and making sketches) though plain paper should be adequate for our purposes. You need a notebook in which the pages are bound together, since looseleaf notebooks tend to be clumsy if you're out working on a windy rooftop. (Plus, fishing white looseleaf sheets out of a white snowdrift in the dark a few stories down is kind of a pain.) Spiral notebooks are particularly well-suited for 12.409 work: you can conveniently fold the cover all the way back, and can include your handouts using looseleaf rings. (Hint: avoid black covers; they're impossible to locate in the dark.) Please arrange to have this notebook be exclusively for your 12.409 work, so that its being collected for inspection won't deprive you of your notes for any other classes you may accidentally be taking. Please be certain also to bring your notebook to ALL class sessions (including the first one).\n\nTextbook\n\nMost of the \"material\" (such as it is) for 12.409 is distributed as a set of handouts. However, if you don't yet know the major constellations and bright stars you should also purchase: Rey, H.A.\nThe Stars\n. Boston, MA: Houghton Mifflin, 1976. ISBN: 0395245087. Even if you already know your way around the sky, but learned to picture the constellations by a method other than Rey's method of showing them, you might want to get yourself the book since we'll many times describe locations of stars by where they fit into Rey's pictures (e.g. \"Perseus' left armpit\").\n\nExpected Student Preparation\n\nExpected student preparation for an evening of observing includes coming to class on-time, awake, fed, and warmly dressed (see next paragraph).\n\nA few words about \"Evening Attire for the Sensible Observer\":\n\nThe reality of observing (or more properly, one reality, for there are several) is that you can get cold, all the way from late autumn through early spring. In particular, rooftops are almost always breezy (therefore cold) and Westford, MA is an \"outlying area\" (therefore cold). (Lest you think summer observing is completely trouble-free, forget not Mr. Mosquito.)\n\nWhen observing you'll want at least one EXTRA layer over whatever you usually find effective for a given air temperature; I recommend dressing as if the air temperature where you'll be observing were an extra 15 to 20 degrees lower than what the thermometer reads. This extra is necessary because for the most part you're NOT MOVING AROUND enough to generate any body heat that way. Here's what I wear for wintertime observing (since it's really un-cool for the instructor to get cold...):\n\nLong underwear (recommend two sets if T below 25 degrees F)\n\nHeavy trousers; heavy shirt (wise to bring wool sweater as well)\n\nWool socks\n\nHiking boots (mine aren't specifically insulated but they're made out of thick stuff; my wool socks do the insulating.) Insulated boots are good also; sneakers are usually inadequate and are NOT recommended.\n\nWool neckwarmer or scarf\n\nWool hat (Having some hat is CRUCIAL, since most of your body heat is lost through your head.)\n\nWarm gloves\n\nLike so many other things in life, observing is significantly less fun than it could be if you're underdressed for the occasion. So, if you err, arrange to do so on the side of preparedness: if you bring too many warm clothes you can always decide you need not wear all of them, but if you bring too few, you lose, in a most uncomfortable way.",
  "files": [
    {
      "category": "Resource",
      "title": "handout1_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/805af99dcfc3bbf940b31bc418fb6b52_handout1_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Hands-On Astronomy, Spring 2002\nHandout 1 Week of February 11, 2002\nCopyright (c) 1999\nCreated S. Slivan\nRevised A. Rivkin and J. Thomas-Osip\n12.409 Course Information\n\nMASTER PLAN - to give you a sense of what this class entails. Final plans for a specific class are\ndependent upon weather conditions, so the \"scheduling\" of items from this list will be determined\nweek-by-week. Sometimes we're extremely fortunate, with each section getting 5 to 7 clear nights\nduring the term. Sometimes we're extremely UNfortunate, with only 2 or 1 (or less?) useful nights.\no Organization. Observing Notebook. Finding North.\nWe begin the term using the telescopes on-campus.\no Setting up your LX200. If clear --- free night to observe from MIT.\no List of suggested objects. Coordinates and time. Basic object-finding.\no Observe ``easy'' objects. Selected exercises in class.\no Finish ``easy'' objects. Do some ``intermediates''.\no Possibly arrange daytime session to try solar observing.\no Finding charts. Palomar Sky Survey. Coordinate precession.\no CCD setup and use for imaging\no Optics.\nThe telescopes get moved out to Wallace later on in the term (conditions permitting), to give us darker\nsky conditions for harder, fainter objects.\no More advanced CCD techniques including color imaging and image processing\ntechniques\no More rock, less talk.\no Assorted videotapes for use on poor-weather nights, selected from: \"The Mechanical\nUniverse\": Kepler's 3 Laws, Navigating in Space, special relativity. \"Ring of Truth\" by\nPhilip Morrison: Mapping, Doubt. \"Spaceflight\" (American space program). \"The\nAstronomers\": Where is the Rest of the Universe?, Prospecting for Planets. NOVA: The\nDoomsday Asteroid.\n\nNOTEBOOK INSPECTIONS: We plan to collect your observing notebook for inspection at least\nthree times. Nominally, this will be the week of March 11, April 22, and May 13, though these dates\nare subject to change if we get really uncooperative weather. I'll remind you the week before an\ninspection, so that you can plan to bring any imaging results you've accumulated and turn them in with\nyour notebook. Notebooks will be returned at the start of the next class.\n\nPlease be certain to bring your notebook to ALL class sessions.\n\nMake sure to get signatures in your notebook from your instructor or TA when you pass a\ncompetency demonstration (e.g. being sufficiently capable at finding objects without assistance to be\nable to go on to use the GOTO feature on the LX200).\n\nTo help decide whether it'll be clear enough to observe on any given class night, use on-line weather\ninformation, which is linked to the 12.409 Web page\n(http://web.mit.edu/12.409/www/12.409.html):\n1.weather model \"guidance\" output (this is the information which the weather service guys\ninterpret to get the forecast in English for the media)\n2.Satellite images\n3.NWS most recent forecast\nOther available sources for weather forecast information include\n1.finger weather@cirrus.mit.edu\n2.telnet um-weather.sprl.umich.edu 3000\n3.Accu-weather tape, 936-XXXX (any 4 digits work here)\n4.www.weather.com, the Weather Channel's website.\nI'll do my ding-dang best to put a note on the website like \"Definitely going out tonight\" or\n\"Definitely staying in tonight\" if the decision's sufficiently obvious that I can make the call by 3-\n4 PM or so. Unless you see a current note indicating we're staying in, it may not be safe to\nassume we're staying in! Typically, if it seems it's going to be clear enough that you'll be able to\nsee somestars, we'll try observing.\n\nIf it's cloudy and the forecast says \"clearing this evening\" it's prudent to bring your\nobserving clothes anyway---we may just go for it and you don't want to be caught\nunprepared by surprise!\n\n\"Partly cloudy\"in a forecast can mean anything from completely clear through\ncompletely overcast; it seems to actually mean \"The numerical weather models\ndisagee so we don't know what to forecast so we'll just say `partly cloudy' and be\ndone with it.\" The actual sky conditions during the afternoon are often a good cue.\n\nFor Wallace nights (as for all classes) we'll still meet in the classroom as a group. We then travel as a\ngroup to wherever the van is parked. (This assumes of course that you get to class on-time. If you're\nlate and haven't made arrangements with me in advance, all bets are off as to whether/where we've\ngone...)"
    },
    {
      "category": "Resource",
      "title": "handout2_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/588a79eabb14885f738fd1c2221cc53f_handout2_sp2002.pdf",
      "content": "Handout 2 Week of February 11, 2002\nCopyright 1999\nCreated S. Slivan\nRevised A. Rivkin and J. Thomas-Osip\nCare and Feeding of Your Observing Notebook\nPart 1: Overview and Visual Observing1\nThe observing notebook we asked each of you to get for use in this class will be used mostly for\nrecording observations, and sometimes also for writing calculations (and whatever other fun things we\ncan think up for doing on cloudy class nights).\nMassachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Observing Stars and Planets, Spring 2002\nThe two primary reasons for keeping such a log are\n\nto remind yourself of what you did, and to allow you to analyze and interpret your recorded\ninformation more carefully at a later time.\n\nto remind you of things you might want to try or retry in the future.\n\n(besides, in this class, it gets inspected by the instructor.) OOPS, who said that?\nSometimes the log finds use as additional data for some future project, yet unplanned when the\nobservations were initially recorded, or is used by others as confirmation of something someone else saw\nor even possibly as additional data for one of their future projects. As your work gets more oriented\ntoward obtaining useful data for quantitative scientific or engineering work (e.g., 12.410J ``Observational\nTechniques of Optical Astronomy'', or physics ``Junior Lab'', or the electronics lab portion of 6.002,\n12.?e9 \"Weather Control on Terrestrial Planets\" and others), maintaining a quality lab notebook becomes\ncrucial, and you'll probably hear this spiel again with even more verve and passion in those other classes.\nIt makes sense, then, that Your Observing Notebook be maintained with particular attention paid to\nclarity, neatness, and completeness. These aspects are all related and are all equally important (think for a\nmoment about the limited value of orderly sketches without any indication of what the seeing 2 or other\natmospheric conditions are like, or a neat log whose contents otherwise make no apparent sense\nwhatsoever). A good observing log includes all the information necessary to reproduce your observations.\nThe idea is to record all facts that may contribute in any way possible to your later interpretation and\nunderstanding of the observation.\n\n1Part 2 comes in another handout later in the term.\n2Seeing refers to the smearing and defocusing of images by temperature-caused and other variations in\nthe Earth's atmosphere.\n\n1 \"What am I expected to write in it?''\nAs you become more practiced at making astronomical observations, you will find it easier to know what\nmight be most useful to record. Here's the list of basics to get you started:\n1.1 Before you go out\nExperience has shown that spending a little time planning a set of suitable targets for an evening's\nobserving will, in the long run, allow you to make better use of available observing time. Choose objects\nyou know will be well up in the sky during the time you plan to be at the telescope (altitude 20o) or\ngreater is a good rule-of-thumb) because the seeing gets really really bad at lower altitudes. (You'll get a\nhead-start on this for use during the term, in the form of a forthcoming handout with visibility information\nalready computed for you.) Even if you're doing \"easy\" objects which don't require that you make\ndetailed finder charts, use your notebook to sketch out a plan for the \"star hopping\" you'll use to locate\nthe object with the telescope (more about this later). It's better to do as much of this preliminary\npaperwork as possible indoors beforehand, since trying to browse without direction through handouts and\nreference books out at the telescope in the (cold) wind with a red flashlight makes observing seem much\nmore complex than it really is, and sops up valuable observing time.\nWhen you get outside\nAt the beginning of the observing session you can record\n\nDate and Location of observing session, Observer(s), and Instrument Used\n(In our class situation it's particularly useful to record the number of the telescope kit you're using, so\nthat if you find an equipment problem that should be looked at by seminar staff outside of class you\ncan definitively identify the offending kit.)\n\nSky Conditions - general description.\nDate: 1991 July 11\nLocation: Keauhou Beach Hotel, 5 miles south of Kona, Hawaii.\n3:00 am HST: Mostly clear to the east where Sun will be during eclipse; a few scattered\nclouds visible overhead. What a relief! Go back to bed.\n4:35 am: ACK! OVERCAST! Panic! Should we try to go north? Indecision: stick it out\nhere a while and see what happens.\n5:45 am: appears to be clearing, from the SOUTH, contrary to usual weather patterns.\n6:00 am: definite breaks in clouds now down here, but still looks solid to north (where all\nthe TV crews are...). Looks like we may actually win!\n\nTo quantify sky conditions, include an estimate of limiting magnitude, the magnitude beyond which\nyou cannot see with your dark-adapted but otherwise unaided eye; the chart in Figure 1 is provided\nfor this purpose.3\nDate: 1984 Jan 21\nLocation: Pine Glen, PA\n9:20 pm EST: Very dark sky (only 2 nights past New Moon),\nlimiting mag. about 5.5\n\n3 If you REALLY want to do this RIGHT, include also an estimate of the size of the seeing disc in\narcseconds, and grade the sky transparency on a 1-10 scale.\n\nThen, for each individual object you observe or photograph, include\n\na clear statement of what you are doing and why. This needn't be anything particularly earth-\nshatteringly exciting or philosophical: something like\nFinding M13 to observe and sketch a globular cluster\nis fine.\n\nName of object observed: common name if it has one, otherwise you're stuck with the catalog\ndesignation (e.g. ``Rosette Nebula'' vs. ``NGC-2237'').\n\nIf you obtained the celestial coordinates of the object from a reference source, it'll be convenient to\nhave them in your notebook as you proceed to find the object with the telescope.\nHowever, working in the other direction by recording coordinates that you read off of the paddle\nreadings on your LX200 may be somewhat less useful and less accurate (though they shouldn't be\ntoooooo bad).\nFigure 1: Reference Magnitudes in Ursa Minor\nwww.starastronomy.org/Library/umical.html copyright 1999 S*T*A*R Astronomy\n\nDescription and Comments - especially points which may not be clear in the pencil sketch you're\nabout to make. Don't worry about being overly structured with these; just keep them clear in meaning\nand clear in handwriting:\nLocated Pleiades with naked eye; looks like a small faint cloud. Pointed telescope at it by\nsight. Many stars spread over a fairly large field; decide to sketch the finder field (mag.\n6 times) as suggested in Handout 5 to be able to cover its area.\n\nThe longer we stared at M42, the more we saw --- by moving my eye around in the field,\naverted vision picks up details in different areas. Faint wisps of nebula appear to extend\nover the entire field.\nM35 in Gemini just a big, dim glow.\nM74 face-on galaxy not found, though we verified that we had the correct star field\nvisible at 50?. The instructor agrees we have the right field.\nImpressions and other qualitative comments give your records some character and make your\nobservations more personally interesting to review later on:\nM13 is spectacular viewed through the LX200!\nFor a moment I had a weird feeling of seeing depth, as of a flat object held up in front of\nthe Trapezium. The Orion Nebula feels ``cold'' (although this may be mostly because I'M\nCOLD!!)\n\nTime observations were made. ``The time'' of an observation which isn't instantaneous, such as a\nsketch or long photographic exposure, should be recorded as separate start and end times (best), or as\na start time and a duration (adequate). Traditionally, astronomers use ``UT'': Universal Time, the time\nat Greenwich, England, but local time is fine for us provided you explicitly record which time zone\nyou're using (e.g. EST or EDT). If no UT clock is handy I'll normally just write down the clock time\n(zone time) and time zone while at the telescope and figure out the UT later on, the idea being that\nI'm less likely to misread my watch than goof an on-the-fly UT computation.\n\nSketches - through finder scope and/or through the various eyepieces you have available, as\nappropriate: you'll want to use low powers or the finder scope to sketch the field of spread-out\nobjects like open star clusters; use high powers for small bright objects with detail like planets or for\nseeing details on the Moon. (Remember also to note if you're using the diagonal mirror attachment,\nsince this yields a non-inverted but left/right-reversed image in the eyepiece.)\n∑\nPencil works better than ballpoint pen does for showing objects of varying intensity (e.g.\nnebulae or planet atmospheric features), and you can also try representing wispy effects by\nintentionally smearing pencil marks with your finger. Ballpoints also freeze.\n\nThe circular outline of the visible field should be drawn, so that sizes of and distances between\nobjects can be estimated later. With fifty pages of notebook for the term, there's no reason to\nstruggle with micro-sized field circles less than about 3 inches (8 cm for the metric lovers) in\ndiameter or to try to cram multiple sketches in with the written notes on any given page. In fact, for\nobjects with significant detail (like the Moon), one 4 to 5 inch (10 to 13 cm, 0.3 to 0.4 light-\nnanoseconds) sketch per page works best, giving you room to draw as well as room on the page for\nthe written portion of your log; see figure 2 for a full-size sample of a boffo, high-class sketch drawn\nby an experienced visual observer. Some students have found it helpful to prepare empty circles on\nnotebook pages indoors while planning the evening's work, to be filled in outdoors with sketches.\n\nRecord what visual magnification you were using for the sketch. A common point of confusion here\nis to read the focal length of the eyepiece off its barrel and record that as the magnification. While the\ntwo values are related, they're not the same!\nThe magnification is more generally useful information than merely the focal length of the\neyepiece because the latter by itself doesn't tell the whole story: the focal length of the telescope\noptics also figures in to what you see.\nFor an LX200 the magnification equals 2000/fe, so with a standard selection of eyepieces:\n\n50x when using 40mm eyepiece\n\n77x when using 26mm eyepiece\n\n161x when using 12.4mm eyepiece\n(For now you get these numbers free, along with a promise that you'll be shown the ``why and\nhow'' derivation later on when we do some theory and practice of optics.)\n\nOne easy but crucial bit of information to record with your sketch is to mark with arrows the\ndirections of north and east. Don't let us forget to demonstrate this individually for you:\nTo identify north in your field, set the paddle speed to \"CNTR\" and move the telescope to the north\n(push the N button) while at the same time observing the field in the eyepiece; and stars will move\nsouth. East and west can be determined similarly by moving the telescope toward the east (direction\nfrom which objects are rising); and the stars will move west.\nA most common observation enhanced with this information is a sketch of Jupiter and the relative\npositions of its four Galilean satellites: armed with north and east, you'll be able to use a reference\n(such as the Astronomical Almanac 2002, or the Voyager III software application) and definitively label\nwhich moon is which.\n\nAs best you can, identify the objects in your sketched visual field with labels, before you forget what\nit is that you drew! AT THE TELESCOPE, put in enough information so that you can do the detailed\nlabelling on your next trip inside. Include at least enough ``field stars'' near the object in your sketch\nto provide definitive information about orientation and scale. (This is where even the best of\nintentions can start to slip on particularly cold nights...)\n\nAny Weather Conditions specifically affecting this observation, especially if the conditions have\nchanged since the overall sky condition was noted when you started the session.\nTrying to view M31, but it's right in the path of the exhaust from the steam plant\nsmokestack across the street.\n\nAnything Unusual about sky or equipment, e.g.\nImages have been dimmer and increasing in blurredness though sky conditions\nseem unchanged. (?)\n(...more observing notes in here...)\nAha! Noticed that a significant covering of dew has formed on the corrector plate.\nProbably affects at least my preceding six photographs of the Moon.\nor\n\nExposure #4: twelve minutes into a fifteen-minute exposure, and JO SEEMS TO HAVE\nGOTTEN HER TONGUE STUCK TO THE FREEZING COLD TRIPOD! What was she\nthinking? Closed shutter immediately. Takes 20 min. to polar align again.\nWhen in doubt, write it down. Record anything interesting about the object, even if it seems trivial or\nirrelevant at the time. Your first observations in this class won't be as good as the last ones you'll do\ntowards the end of the term (or at least, they shouldn't be, if we get a reasonable number of clear nights);\nyou'll be training your eyes to see details you'd have missed at the beginning of the term and training your\nhands to write nice neat notes and amazing beautiful sketches in a wind-whipped notebook, in the dark,\nwhile wearing your thick winter gloves, even as your fingers are getting cold and numb and I'm sipping a\nmocha and catching up on the latest professional lacrosse scores. (Sounds great, doesn't it?)\n2 A note about working in pairs\nWe work in pairs in this class for a number of reasons: it makes planning and set-up more efficient,\nyou can help each other while observing, and it's usually a lot more fun than working alone, particularly if\nneither of you are quite sure of what you're doing (this is unquestionably the usual state of life in this\nseminar, so don't feel inadequate).\nOf course, the point of running the seminar is to individually afford you the opportunity, including\nequipment and knowledgeable staff resources, to do some observational astronomy yourself, at a specific,\nfairly relaxed level. Thus, we feel it inappropriate to have students merely hand-duplicating others' at-\nthe-telescope observing records rather than recording their own observations; such copying would, quite\nfrankly, be a complete waste of time and effort (yours, and ours too) and misses the whole point of this\nclass. Please feel free to chat with your instructor if you've any questions or concerns along these lines."
    },
    {
      "category": "Resource",
      "title": "handout3_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/290d856f660cee59875bd4f51564080c_handout3_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Hands-On Astronomy, Spring 2002\nHandout 3 /week of 2002 February 11\nMeade 8\" LX200 Set-up\nContents\nTelescope Kit Checklist...................................................................................................1\nA. Items external to the telescope case.........................................................................1\nB. Items inside the telescope case ................................................................................2\nC. Items inside the accessory case...............................................................................2\nGeneral Usage Hints........................................................................................................3\nAlignment .......................................................................................................................4\nTable 1: Some Bright Stars Available For Alignment..............................................6\nPacking Up......................................................................................................................6\nThere will be a second handout covering more advanced use of the telescope and the\nextra equipment (and cases!) we'll use. For now, this will cover the topics needed for\nbasic visual observing with the LX200.\nTelescope Kit Checklist\nUse the following checklists to\n1. Alert the instructor or TA about missing pieces before beginning a night's\nobserving and\n2. Ensure that the kit is complete for use by your classmates next time.\nA. Items external to the telescope case\n1. Tripod with C Clip, threaded rod and tension knob, and spreader bar\n2. A Sky Atlas 2000.0, laminated edition, and Atlas Supplement notebook\n3. 120VAC power outlet strip\n4. Counterweights\n5. Flashlights (one red and one white)\n\nB. Items inside the telescope case\nMeade 8\" LX200 Telescope with 8\" dust cover and cap for rear cell\n1. Power adapter and cord\n2. Handheld electronic control keypad\n3. 2 coiled cords (one for keypad w/ 4 pin phone jack connectors and one for the\ndeclination motor w/ DB-9 connectors that are slightly wider)\nC. Items inside the accessory case\n1. Finderscope\n2. Visual back (allows connection of an eyepiece or diagonal)\n3. Diagonal prism\n4. 7 Meade series 4000 Super Plossel eyepieces each in their own plastic case\n6.4 mm (313¥ magnification, 0.17° field of view when used on f/10 Meade 8\")\n9.7 mm (206¥, 0.25°)\n12.4 mm (161¥ , 0.32°)\n15 mm (133¥ , 0.39°)\n20 mm (100¥ , 0.52°)\n26 mm (77¥ , 0.68°)\n32 mm (63¥ , 0.83°)\n40 mm (50¥ , 0.88°)\n5. 2¥ Barlow lens\n6. Eyepiece filters (Moon filter and set of color filters)\n7. Light Pollution Reduction Filter\nGeneralized Setup Procedure\n1. Attach telescope base to tripod. There's only one screw, and it can be a bit tricky to\nset it in correctly. When the telescope is screwed to the tripod correctly, there should\nbe no space between the base and tripod and the telescope base should not rotate.\n2. Attach finderscope to main telescope (see below)\n3. Level telescope (use bubble as guide, hopefully it shouldn't be too far off).\n4. Attach cables:\nDec motor to main base\nPaddle to base\nPlug to converter\nConverter to base\n5. Power up!\n\nFOR EMERGENCY STOP: TURN OFF POWER ON BASE\nOR PULL POWER PLUG FROM BASE!\nWhen will you need to do this? Hopefully, never. When we attach CCD cameras to the\ntelescopes later in IAP, however, there are situations where you realize in the middle of a\nlong slew that there isn't clearance for the CCD camera to fit where it needs to. While\nthis is not the most elegant solution, it will work. Realize, however, that this will\nnecessitate realigning the telescope (see below). But that's better than wrecking a new\ntelescope and CCD (hint, hint)...\nGeneral Usage Hints\n1. When selecting a spot for your tripod think about how any potential obstructions\nnear your observing area (buildings, trees, etc...) will screen areas of the sky\n2. Tripod adjustments: The tripod should be stable once you've secured the spreader\nbar using the threaded rod with the tension knob. The length of the legs can be\nadjusted using the lock knobs (bolts with star shaped handles) at the ends of the legs.\nThese are also used to level the telescope.\n3. DO NOT EVER force the motion of the telescope; unlock the clamp first or use the\nelectronic keypad controls.\n4. Finderscope:\nThe finderscope is located in the accessory case. You will need to mount it on the\ntelescope by sliding its bracket into the base and tightening the thumbscrews.\nThe view is inverted and has a field size of 5.2°.\nCheck the finderscope alignment before you begin observing by centering a bright\nobject at least 1/4 mile distant in a low-power (low magnification) eyepiece and\nthen see how far off this object is from the center of the crosshairs in the finder. It\nwill most likely need adjustment, if you want it to be centered. Ask the instructor\nor a TA to show you how to use the three thumbscrews on the finder's mount to\nalign it. Or remember where the position of an object that is centered in the\neyepiece is located relative to the finder crosshairs. If you choose this second\noption, make sure you make a note of it in your notebook in case you forget.\n5. Focusing:\nThe focusing mechanism is designed to allow for very fine adjustment of focus.\nIt takes up to 45 turns of the knob to go from focusing at close distances(which\nyou should not need to do in this class) to infinity.\nTurning the knob counter clockwise focuses towards infinity.\nIt may be best to choose a partner with similar vision correction (i.e. those with\ncoke bottle glasses should stick together to avoid many focusing adjustments).\nIt is often difficult to focus on dim objects so if you are having trouble, it can be\nhelpful to focus on a bright object and bring the telescope back to aim at your\noriginal object.\n\n6. Never wipe any optics especially the corrector plate; the anti-reflection coating is\nvery thing and will scratch easily. If your corrector plate becomes covered with dew,\nalert your instructor or TA and we'll use a heat gun to evaporate it off.\nAlignment\nThe purpose of the following procedure is to allow the telescope drive motor to properly\ntrack objects in the sky as the Earth rotates beneath them causing their apparent motion\nacross the sky. The LX200 telescopes are mounted in an altitude/azimuth (called alt-az\nfor short) format meaning that the telescope moves along vertical and horizontal axes. In\norder for the LX200 to be able to track objects in the night sky properly, it must be able\nto convert between altitude/azimuth coordinates along which the telescope moves and\nDeclination/Right Ascension coordinates along which celestial objects appear to move.\nThus, the LX200 must \"know\" its location, and the local date and time should all be pre-\nprogrammed (by the instructor or TA). The LX200 will store this information with the\npower off so there should be no need for you to change this information until we use the\ntelescopes at Wallace and thus need to change the location. In addition, the LX200 must\nalso \"know\" where certain positions in the sky are located. This is accomplished by\npointing the telescope consecutively at two stars with known positions and is called\nalignment. The procedure is outlined below.\n1. Turn on the telescope and after the self-diagnostic start-up test is complete the display\nwill give you two choices (TELESCOPE and OBJECT LIBRARY).\nSelect Telescope (by pressing enter with the arrow pointing at Telescope).\n2. Now your choices should be (SITE and ALIGN).\nPress the Next key to move the arrow to Align and select it using enter.\n3. The display should had two choices again (ALTAZ and POLAR).\nIf there is NO checkmark next to ALTAZ, press enter once and the keypad should\nbeep and a checkmark should appear next to ALTAZ. Now press enter again to\nuse the checked mode.\nIf there is a checkmark next to ALTAZ, press enter to use the checked mode.\n4. Your choices now should be (1 Star or 2 Star Alignment).\nPress next to move the arrow to 2 Star Alignment and then press enter to select it.\n5. The display should now read (Level Base, then press ENTER)\nThis is good time to double check that the base of the telescope is level and adjust\nthe legs of the tripod if necessary.\nWhen you press enter you will see (Press ENTER, then pick align star)\n\n6. Now you will see the beginning of the list of alignment stars contained in the\nLX200's memory.\nThere are 33 choices in alphabetical order so it may save you time over the course\nof the semester to learn where some bright stars with names beginning with A and\nB are in the sky.\nBefore you choose a star find it in the sky and if you are not yet familiar with\nbright stars and constellations it might be worth double checking that you have\nthe correct star with the instructor or TA.\nPress the Next key to move the arrow down the list of stars until you get to the\none you want (if you go past it use the Previous key to go back up)\nSelect the star by pressing enter\n7. The display will read (Center \"the star you chose in step 6\" and then press ENTER)\nYou may move the telescope manually: UNLOCK the Dec and RA clamps and\npoint the telescope towards the star. Sight along the telescope and adjust the\ntelescope until you can see the star in the finder, then fine tune until it is centered\nin the finder and then the eyepiece.\nOr you may move the telescope electronically: Make sure the speed is set to\nSLEW (this button on the keypad should be lit up). Use the N, S, E, and W\nbuttons to move the telescope until it is aimed at the star. When you can see it in\nthe finder, switch the speed to FIND to center it in the finder. Then change the\nspeed again to CNTR and center the star in the eyepiece.\nThe more carefully you center the star in the eyepiece, the more precisely your\ntelescope will be aligned. Early in the semester when you will be looking at\nbright objects and not using the telescopes internal object library to find faint\nobjects, it is not important to align the telescope too precisely. Just make sure that\nthe star is somewhere near the center of the eyepiece. Later in the semester, when\nyou may want to rely on the telescope to find very faint objects, a more precise\nalignment will be necessary.\nOnce you have centered the star in the eyepiece, press enter. Try not to delay too\nmuch between centering the star and pressing enter since at this point the\ntelescope is not yet tracking the stars and thus if you wait too long the star will\ndrift out of the center of the eyepiece.\n8. Repeat steps 6 and 7 for the second star EXCEPT FROM THIS POINT ON DO\nNOT UNLOCK THE RA AND DEC CLAMPS AND ATTEMPT TO MOVE\nTHE TELESCOPE MANUALLY. This will result in the telescope \"forgetting\"\nwhere it is pointed and you will need to start the alignment process all over. Move\nthe telescope only by using the keypad at speeds SLEW, FIND, or CNTR in\ndirections N, S, E, and W.\n9. After you have completed aligning the second star, the display should read\n(TELESCOPE/OBJECT LIBRARY). You are ready to use the telescope for\nobservation now!\n\nTable 1: Some Bright Stars Available For Alignment\nStar\nVisible in the evening in\nwhich semester?\nConstellation\nMagnitude (smaller\nnumbers are brighter)\nAldebaran\nSpring\nTaurus\n0.87\nAlkaid\nSpring or early Fall\nUrsa Major (Big Dipper)\n1.85\nAltair\nFall\nAquila\n0.76\nArcturus\nEarly Fall or late Spring\nBootes\n-0.05\nBetelguese\nSpring\nOrion\n0.45\nCapella\nSpring\nAuriga\n0.08\nDeneb\nFall\nCygnus\n1.25\nDubhe\nFall and Spring\nUrsa Major (Big Dipper)\n1.81\nVega\nFall\nLyra\n0.03\nPacking Up\nUse the telescope kit checklist to make sure you still have everything you started with\n(check around the ground nearby, your pockets, and nearby telescope kits if necessary)\nand that you haven't inherited extra parts from someone else's kit. The LX200 only fits\nin the case one way so please don't force it in the wrong way. Once in the case, unlock\nthe RA and Dec clamps as this will avoid damaging the drive and clamp mechanisms\nduring transport of the cases. Remember to remove the finderscope from the telescope\nby loosening the thumbscrews on the quick-release mount. Use the checklist to make\nsure the accessories get back in the proper case (be it the telescope case or the accessory\ncase). If after you leave class, you discover that you've accidentally walked off with\nsomething from class please make sure you contact you instructor by email as soon as\npossible to arrange for its return. This can be avoided by using the cases as working\nstorage rather than your pockets!"
    },
    {
      "category": "Resource",
      "title": "handout4_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/faca4522847a38c176261a2be6039bc2_handout4_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Observing Stars and Planets, Spring 2002\nHandout 4 week of February 11, 2002\nCopyright 1999\nCreated S. Slivan\nRevised A. Rivkin and J. Thomas-Osip\nCan We Observe x Tonight?\nThis is an important question to be able to answer, this being an observing subject and all.\nThe answer to this question is \"yes\" only if the answer to the following 4 questions is\n\"yes\":\n1.Is the weather cooperating?\n2.Is x bright enough, given our observing equipment?\n3.Is the sky dark enough?\n4.Is x high enough above our horizon?\nThis handout addresses the answering of questions 2, 3, and 4, and explains how to use\ninformation published in the Astronomical Almanac to decide whether to go for a specific\nobject at any given time.\nAs for question 1, that's a different class... (12.310)\nContents\n1 Brightness Scale........................................................................................................... 2\n1.1 Effects on apparent brightness............................................................................... 3\n2 Coordinate Systems...................................................................................................... 4\n2.1 Terrestrial coordinates........................................................................................... 4\n2.2 Celestial coordinates.............................................................................................. 5\n2.3 Observer-based coordinates................................................................................... 6\n3 Time Scales.................................................................................................................. 6\n3.1 Solar times ............................................................................................................ 6\n3.2 Sidereal times........................................................................................................ 6\n4 Sun/Moon Rise/Set tables ............................................................................................ 7\n5 Other useful items in the Astronomical Almanac.......................................................... 8\n\n1 Brightness Scale\nThe magnitude system refers to the numeric scale used by astronomers to quantify object\nbrightness. Its rather baroque character can be traced to its origins over 2000 years ago,\nwhen the Greek scholar Hipparchus first began visually classifying stars into six\nbrightness categories, with the brightest stars called \"stars of the first magnitude\", slightly\nfainter ones \"stars of the second magnitude\", and so on. When 19th century astronomers\nsat down to come up with some sort of mathematical expression corresponding to\nHipparchus' original six magnitudes, it was discovered that the brightness of some of the\nstars he'd assigned magnitude 1 were actually too bright to be so classed based on the rest\nof his system; these brightest stars now carry magnitudes of 0 and -1.\nOops.\nBut, let's press on, shall we?\nCall the intensity of light source n In, measured in\nenergy\narea time\n◊\n. The difference in magnitude\nbetween objects with respective intensities I1 and I2 is then defined as\nDm\nm\nm\nI\nI\n=\n-\n∫-\n2 5. log\n(1)\nThis definition can be rearranged to show the admittedly non-intuitive relationship\nbetween the objects' intensities in terms of magnitudes:\n-\n=\n=\n=\n◊\n-\n-\n0 4\n0 4\n0 4\n.\nlog\n;\n;\n.\n.\nD\nD\nD\nm\nI\nI\nI\nI\nI\nI\nm\nm\n\n(2)\nHappily, for most of our purposes here in the seminar we won't need to mess around with\nEquation 1 up there; a few tabulated values should prove sufficient:\nDDDDm\nI2/I1\n1.0\na2.5\na6.3\n2.5\na16\na40\nObject\nMagnitude\nSun\n-26.8\nFull Moon\n-13.6\nVenus (at brightest)\n-4.4\nJupiter\n-2\nSirius (a Cma)\n-1.4\nVega (a Lyr)\n0.0\nUranus\n+6 (naked eye limit)\nquasar\n+13\nfaintest object detected (Earth-based) (a_glow of\ncigar on Moon seen from Earth)\n+29\n\n1.1 Effects on apparent brightness\n1.Extinction: Loss of light as it passes through the atmosphere. Normal extinction on a\nclear night is about 0.2 mag. at the zenith and increases quickly as you start looking at\nlower altitudes.\n2.Telescope: How much does it help us? It collects an amount of light proportional to\nthe AREA of the objective mirror, as shown in Figure 2.\nFor dark adapted pupil\nFor 8\" LX200 telescope\nHow many magnitudes fainter should we be able to see (theoretically) with the LX200,\nunder IDEAL conditions (clean and otherwise perfect optics, ...)?\nI\nI\nA\nA\ntelescope\neye\n=\n(3)\n3. Effect of distance on apparent brightness is known as the \"inverse square law.\" The\nchanging brightness of Mars is due mostly due to its changing distance as it orbits the\nSun. This also contributes to changes in brightness of Venus (along with phase, the\namount of the disk that we see illuminated by the Sun).\n\nHere's how the change, in magnitudes, depends on distance --- if an object with distance\nR away from an observer appears to be magnitude M, then from a different distance r the\nsame object would appear to be magnitude m according to\nm\nM\nm\nI r\nI R\nI R\nR\nr\nI R\nR\nr\nR\nr\n-\n=\n= -\n= -\n◊\nE\nEA\nˆ\n\n= -\nE\nEA\nˆ\n\n= -\nD\n2 5\n2 5\n2 5\n. log ( )\n( )\n. log\n( )\n( )\n. log\nlog\n(4)\nThis last form of the equation is commonly known as the distance modulus.\n2 Coordinate Systems\n2.1 Terrestrial coordinates\nlatitude (ffff): + north / - south of the equator (range: -90°<f<90°)\nlongitude (llll): +east / - west of the Prime Meridian at Greenwich, UK where:\nl = 0o 00' 00'' = 0h 00m 00s (range: -180°<l<180° although sometimes you might see\n0<l<360°).\n[the ' and '' are ARC MINUTES and ARC SECONDS.]\n[the h, m and s are HOURS, MINUTES and SECONDS OF TIME.]\nThis sign convention is known as \"east longitude\", the currently-adopted standard for\nusage in astronomy. (Watch out when using older references though, which may have\nused the opposite sign convention, \"west longitude\"). The rest of this handout assumes\nuse of east longitude.\nExamples of notation and useful coordinates:\n∑ MIT Campus:\nf = +42o 21' 38\" = +42o.3606\nl = -71o 05' 36\" = -71o.0933 = -4h.73956 = -4h 44m 22s.4\nfor the LX200 which uses only positive longtitude in degrees:\nl=288° 54' 24\" = 288°.9067\n\n∑ Wallace Observatory, in Westford, MA:\nf = +42o 36'.6 = +42o.610\nl = -71o 29'.1 = -71o.485 = -4h.7657 = -4h 45m 56s\nfor the LX200 which uses only positive longtitude in degrees:\nl=288° 30' 54\" = 288°.515\n2.2 Celestial coordinates\ndeclination (\"Dec\", dddd): + north / - south of the celestial equator\nright ascension (\"RA\", aaaa):+ east of vernal equinox (\"First Point of Aries\")\nNote that the celestial equator and vernal equinox are not fixed with respect to the stars\nover long time periods (by virtue of a slow phenomenon called precession of the\nequinoxes) so celestial coordinates are referenced to the equator and equinox at some\nparticular date and time, such as year 2000.0 or 1950.0. In general, the RA and Dec of an\nobject at a specific date and time t may also be given in \"apparent coordinates\", which\nare referenced to the true equinox at that same particular date and time t. Apparent\ncoordinates are given for aiming properly-aligned telescopes with accurate and precise\nsetting circles, while 2000 or 1950 coordinates are used for plotting objects on star atlases\nfor use in star-hopping.\nSample notation: the bright star Vega (a Lyr), referenced to \"equator and equinox of\n1986.5\":\nDec1986.5 = d1986.5 = +38o 46' 14''\nRA1986.5 = a1986.5 = 18h 36m 28.9s\nNote that for RA, 24h = 360o , so 1h of RA = 15o .\nThis is the basis of converting time to degrees and vice-versa:\n18h 36m 28.9s Æ 18.60803h ¥ 15 deg/hr = 279.1204o Æ 279o 07' 13''\nand clarifies the otherwise weird-looking expression\ncos(18h 36m 28.9s) = 0.1585\n\n2.3 Observer-based coordinates\naltitude (Alt): measured \"due up\" from horizon ∫ 0o\nazimuth (Az): measured East from \"North point\" ∫ 0o. Note that this creates a left-\nhanded coordinate system!\nhour angle (HA): lines of constant hour angle are identical to those of constant right\nascension, but HA values are measured eastward and westward from the observer's\nmeridian ∫ 00h 00m 00s. HA's are conventionally specified in the range -12h to +12h:\nobjects which have yet to transit your meridian have a negative HA, while objects already\npast transit have a positive HA.\n3 Time Scales\n3.1 Solar times\nSolar times are based on the period of the rotation of the Earth with respect to the Sun.\nUT = Universal Time: mean solar time at Prime Meridian at Greenwich (l = 0o 00' 00''\n= 0h 00m 00). This is by convention the time scale used when documenting astronomical\nobservations.\nZT = Zone Time: (e.g. EST, EDT) mean solar time at the reference longitude for\nwhatever time zone you happen to be in. The reference longitude for the eastern time\nzone is lEST = -75o (it passes roughly through Philadelphia), so\nUT = EST - (-75o/(15o /hour)) = EST + 5 hours\nLMT = Local Mean Time: mean solar time at your particular longitude lObs. Tables in\nthe Astronomical Almanac for sunrise/set, moonrise/set, and the various flavors of\ntwilight are given in LMT.\nRelations:\nUT\nZT\nUT\nLMT\nzone\nobs\n=\n-\n-\n-\nl\nl\n;\n(5)\n3.2 Sidereal times\nSidereal times are based on the interval between successive meridian passages of the\nvernal equinox (a point in space defined as a point on the meridian of Greenwich at the\ntime of the vernal equinox - the change from winter to spring in the northern\nhemisphere).\n\nGST = Greenwich Sidereal Time: \"HA of vernal equinox for observer at Greenwich\";\ncorresponds to the RA of the objects transiting the meridian for an observer at\nGreenwich.\nLST = Local Sidereal Time: \"HA of vernal equinox for local observer\"; corresponds to\nthe RA of the objects transiting the meridian for an observer's particular longitude.\nRelations for sidereal timescales:\nLST\nGST\nsidereal time\nsolar time\nsidereal days in year\nsolar days in year\nobs\n=\n+\n=\n¥\n=\n=\nl\n;\n\nwhere\n\nD\nD\n1 0027379\n1 0027379\n366 25\n365 25\n.\n.\n.\n.\n(6)\nAnother way to look at this relates sidereal time to observer based coordinates and\ncelestial coordinates above:\nLST\nRA\nHA\n=\n+\n(7)\nNote that a sidereal clock runs faster than a solar clock by 1 day/year, which is about 4\nminutes/day.\nA table mapping 0h UT each day to its corresponding GST is given in the Astronomical\nAlmanac, Section B, \"Universal and Sidereal Times\".\n4 Sun/Moon Rise/Set tables\nIn Section A of the Astronomical Almanac, you'll find tables which can be used to\nquickly determine times of\n∑ sunrise and sunset\n∑ moonrise and moon set\n∑ civil twilight (morning & evening)\n∑ nautical twilight (beginning & ending)\n∑ astronomical twilight (beginning & ending)\nWe can call the state when the sky is as dark as it's going to get \"astronomical darkness\",\nso \"ending astronomical twilight\" becomes \"beginning astronomical darkness\", and\n\"beginning astronomical twilight\" becomes\n\"ending astronomical darkness\".\nFor our purposes, and for now, we'll stop here. In this day and age, it is unusual for an\nastronomer (amateur or professional) to determine the hour angle, altitude, or azimuth for\na target object longhand. Usually, observers use software like Voyager III, or online\nephemerides for moving targets (the planets and asteroids), to determine when and\n\nwhether an object is observable at a given time. However, it can be done with a bit of\nspherical trig and some time...\n5 Other useful items in the Astronomical Almanac\nYou may not use the use the Astronomical Almanac to calculate the sunset time, or the\naltitude of an object but you might find some other useful purposes for it. For example,\nSection F contains information regarding the configuration of the satellites of the planets\nwhich would help you identify which moons of Jupiter (or another planet) you are seeing.\nAlso located right at the beginning are dates for the various phases of the moons, dates\nfor any lunar and solar eclipses for the year, and other astronomical planetary\npheonomena."
    },
    {
      "category": "Resource",
      "title": "handout5_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/21130d3bbbb14511c8e8ef64c295ab1f_handout5_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Observing Stars and Planets, Spring 2002\nHandout 5 / week of 2002 February 25\nCopyright (c) 2002\nCreated S. Slivan\nRevised A. Rivkin and J. Thomas-Osip\n\"Chez 12.409\" Menu for Spring 2002\nThis handout is intended to give you some direction as to what you might want to hunt for with your telescope. It's\ndivided into sections as follows:\nContents\nReference information ...............................................................................................................................................................1\n1 Without the Telescope ............................................................................................................................................................2\n2 ( easy) Moon; Bright Planets & Deep Sky Objects ...........................................................................................................4\n2.1 The Moon........................................................................................................................................................................4\n2.2 Planets .............................................................................................................................................................................4\n2.3 Some Stars.......................................................................................................................................................................5\n3 ( intermediate) Lunar Features and Non-trivial Deep Sky Objects...................................................................................6\n3.1 The Moon Again.............................................................................................................................................................6\n3.2 Variable Stars - making visual estimates.......................................................................................................................8\n3.3 More Clusters, Nebulae, Galaxies..................................................................................................................................8\n4((r) expert) Faint Planets, Asteroids, and Other Challenging Stuff ...................................................................................9\n4.1 More Planets....................................................................................................................................................................9\n4.2 Asteroids..........................................................................................................................................................................9\n4.3 Still More Clusters, Nebulae, Galaxies........................................................................................................................10\n4.4 More Variable Stars......................................................................................................................................................11\n4.5 Satellite Observations ...................................................................................................................................................11\n5 Charts and Tables..................................................................................................................................................................12\n5.1 Object Information Table .............................................................................................................................................12\n5.2 Visibility of Easy () Objects .....................................................................................................................................13\n5.3 Visibility of Intermediate () and Expert () Objects..............................................................................................14\nReference information\nCelestial coordinates for the clusters, nebulae, variable stars, and galaxies included in this handout are provided in the\ntable on page 12.\nMore Information: This handout is intended to help you select what to observe. In order to actually locate the objects in\nthe sky, you'll need some additional \"at-the-telescope\" reference material:\n\nThe Stars by H. A. Rey. Superior naked-eye introduction to the constellations, including much of the lore\ngoing along with them. (Lindgren Library course reserve) 12.409 has copies you'll use while observing in\nclass.\n\nSky Atlas 2000.0 - a rather large ringbound set of star charts showing stars to 8th mag. It's well-suited for\nlocating objects with our LX200's and is in year 2000 coordinates. (Lindgren Library course reserve; Science\nLibrary map room) 12.409 has laminated copies you'll use outdoors while observing in class, as well as regular\npaper copies for use indoors.\n\n12.409, Spring 2002\n\nNorton's 2000 -useful for finding brighter objects (down to mag. ~ 6) or for use with binoculars. This 18th\nedition is fairly recent; you may see the 17th edition (Norton's Star Atlas) around as well. The main difference\nis that the new version is in 2000 coordinates while the older is in 1950. (Science Library Map Room; CSR\nReading Room)\nAdditional reference materials, more appropriate for ``desk work'' such as making finder charts, computing\nobservability, or obtaining detailed information about objects you're observing, include:\n\nThe Astronomical Almanac 2002 - the \"official\" reference for more careful work, with LOTS of information\n(some of which is even useful for 12.409 work), including rise and set times for the Sun and Moon,\ncoordinates for planets, bright asteroids, stars brighter than 5th magnitude, (Lindgren Library; Science Library\nmap room ; CSR Reading Room; 12.409 classrooom).\n\nUranometria 2000.0, Vols. 1 & 2 - hardcover atlas with stars to mag. 9.5. Ideal for photocopying to make\nfinder charts for harder objects! (Lindgren Library ; Science Library map room; 12.409 classroom).\n\nVoyager III application for Macintosh (installed on ibook computers in 12.409 classroom)\n\nHST Guide Star Catalog CD-ROMs and Pickles application for Macintosh -most useful for making charts to\nuse when tracking down faint objects with our CCD cameras (Lindgren Library; 12.409 classroom)\n\nBurnham's Celestial Handbook, Vols. 1--3 - The \"ultimate\" source of detailed information about objects you're\nobserving. (Science Library, CSR Reading Room; 12.409 classroom).\nFinally, note that the contents of this handout are intentionally restricted in scope to primarily those objects visible in\nthe evenings during the Spring. More general information about what interesting celestial targets are up when can be\nfound in:\n\nAstronomy magazine (monthly). The section titled \"Sky Almanac\" has a few subsections: \"Eye on the Sky\"\ndealing with naked-eye observations, \"Through the Eyepiece\" dealing with telescopic targets, and a useful\nchart of planetary data. (CSR Reading Room) (stocked by \"Out Of Town News\" in Harvard Square)\n\nSky and Telescope magazine (monthly), with columns \"Rambling Through the Skies\", \"Celestial Calendar'\",\n\"The Evening Sky\", and \"Stars & Planets\". (CSR Reading Room) (stocked by ``Out Of Town News'' in\nHarvard Square, also see www.skypub.com)\n1 Without the Telescope\nWhenever you can, try to get in some naked-eye observing on clear nights outside of class time.(Also try binoculars, if\nyou have them.) It's not bad as a study break---grab a comfy chair, a copy of Rey's book and some cookies (and maybe\na sweater), amble on up to the roof of your living group (maybe not if it's MacGregor, though) and just mellow out\nunder the sky. But, you say, what will I be able to look at on clear nights which aren't my lab night ,when I won't\nhave a telescope?\nWell,\n\nDo you know how to tell the compass directions at night? (If you don't already, you will REAL SOON; you'll\nneed to get through one of the checkpoints in the class.) Start by finding North to get your bearings.\n\n12.409, Spring 2002\n\nCan you identify these constellations?\nAndromeda\nCepheus\nLyra\nPerseus\nBootes\nCygnus\nOrion\nTaurus\nCassiopeia\nHercules\nPegasus\nUrsa Minor\n(Fainter constellations such as Cancer or Monoceros are difficult to see in Cambridge, since only the brightest stars\nshow up here. MUCH less of a problem at Wallace Observatory!) You do need to learn the brightest stars and\nconstellations in order to be able to find your way around the sky with binoculars, or with small telescopes such as\nours. If you don't yet know those 12 listed above, this is where having a copy of Rey's book with you really can help\nout.\n\nWhere is the Moon in the sky? (Also try to find it during the day if it's visible.) When and where did/will it\nrise? Set? What phase is it in now? Is is waxing (getting bigger) or waning (getting smaller)? Where is it with\nrespect to the stars? The position of the Moon changes SIGNIFICANTLY, about 12o to 15o from night to\nnight.\n\nPredict the next full moon - Plot the Moon's positions through the stars for a few weeks, carefully sketching\nthe phase at each observation. Make a diagram of the Earth and Moon's orbit, showing the direction in which\nthe Sun lies. Label the appropriate position on the orbit with the corresponding date of each of your\nobservations. With enough observations, you should be able to calculate a date for the next full moon - check\nthe AA afterward to see how close you came!\n\nPlot a Planet's Path - Jupiter and Saturn are up all semester. They are easy objects to find, so it's easy to\nrecord their motion on a star chart. Photocopy the proper pages out of (in Uranometria 2000) and affix them\nto pages in your notebook. Each observing night, look at one (or both) using your finderscope---although the\nplanets are bright enough to see without optical aid, the field stars near Jupiter and Saturn might not be easily\nvisible from Cambridge without using the finder. Plot the positions as accurately and as precisely as you can,\nrecording the date and time of each marked position. In which direction is each moving, and how fast? Do\nthey appear to change direction over the course of the month? Do you have enough positions to tell if/how the\napparent speed of motion changes over the course of the term?\n\nCan you find the constellation corresponding to your so-called astrological \"sun sign\"? Is it even up for\nviewing anytime this term? You can use the Sun's coordinates in Astronomical Almanac together with a Sky\nAtlas 2000 or Uranometria 2000 to figure out which of the thirteen constellations which lie along the ecliptic\nthe Sun is really in on your birthdate---it won't be your so-called \"sun-sign\". (We will get to seeing why this\nis the case.)\nWhen you go out for an eyes-only session, feel invited (coerced, exhorted, cajoled) to bring along your Observing\nNotebook, and FEED IT!\n\n12.409, Spring 2002\n2 (\n\neasy) Moon; Bright Planets & Deep Sky Objects\n2.1 The Moon\nThe Moon isn't up during the first week of the class, but is around for the end of it. It's a bit of a shame since it's a\ngreat object for beginning observers. Nevertheless, we can enjoy it when it shows up. Sketch the phase of the Moon\n(e.g. \"full\", \"waxing crescent\"), then try your hand at drawing in some of the larger surface features. (If it's\nuncomfortably bright through the LX200, use the Moon filter.) How much of the Moon can you see at once through the\nfinder and through the various eyepieces? Try different eyepieces to obtain the magnification that gives the best views\nfor the prevailing sky conditions. What, in your opinion, did this optimal magnification turn out to be? (A more\ncomplete observing guide to the Moon is included in Section 3.1 as \"intermediate\"-level observing.)\n2.2 Planets\n1.\nJupiter - The \"King of the Planets\" rules the skies all month long. Jupiter is at opposition this month, and is also\nunusually close to Earth Shining about mag. -2.6. Jupiter is a large bright feature-filled object. At low power, you\nsee a small oval disc flanked by some or all of its four bright Galilean moons. Even with low powers you'll be able\nto pick out one or two of the dark cloud (belts) near its equator. Higher powers will reveal smaller features only if\nthe seeing is good (if the stars are twinkling madly forget it - you won't be able to use your telescope's resolving\npower to its fullest). If we do get a good night, you should be able to observe the Red Spot if it's facing us, on the\nsouth edge of the south equatorial belt. Careful observations of these details can show visible changes even over\nthe time span of only one night's observing, since Jupiter rotates once on its axis every 10 hours, and the inner\nsatellites move fairly quickly in their orbits around Jupiter. A blue eyepiece filter helps to increase contrast of the\ndark band(s) and Red Spot (also try yellow-green, green, and orange).\nTry to observe Jupiter each opportunity you get! Take care to accurately record the positions of the visible\nGalilean satellites, so that it will be possible to properly identify each with its name. Avoid just taking a hurried\nlook and then moving on to something else - take some time and give your eye a chance to really see what's there,\nparticularly if our sky conditions are favorable. (Jupiter's almost always worth at least 10 min. of observation,\nminimum.) In order to observe more belts and hints of spots, patches, and other detail, you'll need to keep\nwatching for many minutes to catch the moments of good seeing and study the disk carefully.\n2.\nSaturn - Available all semester (but in the later part only early in the evening). Saturn's bright at around mag.\n+0.7 this term, sitting in Taurus. This term its rings are wide open, near their maximum, so the shape of an object\nyou think is Saturn should be unmistakably elliptical even at low power. If conditions are good try viewing Saturn\nthrough your yellow filter; it may help reveal some non-uniformity on the disc you see (also try other colors, and\nrecord your \"results\"). Locating and positively identifying brightest satellites Titan (mag. +8.3) and Rhea (mag.\n+9.7) is an only slightly more difficult project: you need to compute their expected locations, most easily done\nusing the Voyager III application, or online sites (see your instructor for details).\n3.\nMars - Spring 2002 we find Mars hanging very low in the southwestern sky for the first half of the term. It fades\nfrom mag. +1.0, as Earth pulls steadily away over the course of the semester and its size decreases steadily. How\nbig is it at the start of the class relative to the end? Mars will be a tough observation to make relative to Jupiter and\nSaturn.\n4.\nOther Planets - Unfortunately, the other major planets (Mercury, Venus, Uranus, Neptune, and Pluto) are all\npoorly situated for observing this Spring. They're all too close to the Sun to see. That's OK, we don't need them\nanyhow.\n\n12.409, Spring 2002\n2.3 Some Stars\nStarting with some objects that should make easy finding...\n1. Use a star atlas to locate these stars by greek letter in the indicated constellation, then find them visually with your\ntelescope.\na. a Canis Majoris (Sirius, in Canis Major) - What color does this star appear to be? Sirius is the brightest star\nin our sky at mag. -1.4. Low in the eastern sky during class time. Try the following while it's still in the murk below\n20o:\n\nCompare the unfiltered image of Sirius with that of Capella (a star nearer the zenith: Zenith is the\npoint in the sky directly overhead) at the same high magnification. Can you detect any difference in\noverall quality, and in size? Why would there be a difference?\n\nCompare the size of Sirius' image at high magnification (use your 12mm eyepiece with the 2x\nBarlow lens to get 340x as seen through blue and through orange eyepiece filters. Can you detect\nany difference in size? Why would there be a difference?\nb. a Aurigae (Capella, in Auriga) - what color does this star appear to be?\nc. b Ori (Rigel n Orion) - What color does this star appear to be?\n2. Sketch the fields of these double stars. Locate each using your lowest power (i.e., 6x), using your finder scope) and\nthen work up in magnification until you can resolve the pair. Given the field of view sizes for the eyepieces in which\nthey can be resolved, estimate the angular separation between the component stars.\na. i Cancri (in Cancer) - sketch the star field. How do the two component stars differ? Try viewing this pair\nslightly out-of-focus to intensify color.\nb. b Monocerotis (in Monoceros) - Carefully sketch the star field; you'll need to use fairly high magnification\nfor b Mon to appear double. In what ways do b Mon and i Cnc differ? If the sky conditions are particularly good, try\nto inspect the component stars very carefully at your highest power. Notice anything?\n2.4 Clusters and Nebulae Locate, describe and sketch each of the following objects (For coordinates of\nobjects here, see the table last page of this handout:\n1.\nM42 in Orion - The \"Great Orion Nebula\": a bright diffuse emission nebula, about 1300 light-years away. You\nshould be able to locate this one VISUALLY in order to point the telescope, even in Cambridge, but in case you\nwimp out, its coordinates are in the table at the end of the handout. M42 contains stars in formation; look for the\n\"Trapezium\", a knot of four stars near the middle. These four young hot stars apparently supply most of the\nenergy which excites the nebula's hydrogen gas, making it glow.\n2.\nM45 in Taurus - \"The Pleiades\": an open cluster. This is another object you should have little trouble finding\nwithout the telescope in Cambridge. A large object - sketch the view through the finder scope (6x since the whole\ncluster won't fit in the field at the higher magnifications using the LX200). Its worthwhile to try drawing a smaller\narea in more detail using lowest power eyepiece as well. Do you know what car company takes its name from this\nastronomical object?\n3.\nM44 in Cancer - The \"Beehive Cluster\": another open cluster. Barely visible to naked eye under good conditions\nas a faint glow or hazy patch of light. It's a sprawling cluster, so you must use the low power eyepiece to be able\nto get a reasonable amount of it in the field. Look for the ``beehive'' itself: the trapezoid formed by mag. 6.5 stars\nat the heart of the cluster.\n\n12.409, Spring 2002\n4.\nh and C Persei in Perseus (also called NGC 869 and 884) - The \"Double Cluster\": a pair of open clusters. A large\nobject - sketch it in your finder scope and lowest power (pair just barely fits in field at 50x).\n5.\nM3 in Canes Venatici - a globular cluster: a few tens or hundreds of thousands of stars in an essentially spherical\ndense concentration. Being near Arcturus, M3 rises a little late for us early in the term, but becomes more\ncooperative after a few weeks.\n6.\nM13 in Hercules - The \"Hercules Cluster\": one of the most famous globular clusters. Contains about 300,000 stars,\n24,000 light-years away. Only available the last month of the semester.\n2.5 Galaxies In general, galaxies are NOT easy objects; M31 is the only exception.\n1.\nM31 in Andromeda - the \"Andromeda Galaxy\": a spiral galaxy, similar to our own and (relatively speaking) close\nby; it's only 2,400,000 light-years away. It is only available during the first half of the Spring term. We see it\ntilted about 15o from edge-on. Can you see it in Cambridge without the telescope? (At Wallace observatory, you\nwould be able to find it visually, without the telescope.) Use your lowest power to find it. Sketch its appearance\nthrough the finder scope and through the available eyepieces. The nucleus is easy to see; the fuzz of the spiral\nstructure is much more difficult: estimate its angular size through the LX200, and compare this with the extent of\nits ellipse as plotted in the Sky Atlas 2000.\n3 (\n\nintermediate) Lunar Features and Non-trivial Deep Sky Objects\nThis set of objects is designed to refine and sharpen your observational skills. You will be trying to find some more\ndifficult objects here; be patient and thorough.\n3.1 The Moon Again\nThe Moon is one of the most rewarding celestial objects for viewing with a small telescope. Since it is so nearby, the\nMoon shows far more detail than anything else in the sky, even without using any telescope. (Besides, there's no\nproblem finding it). The idea here is to become familiar with the various types of features visible on the lunar surface.\nWhich particular types of features are best-viewed on a given night depend somewhat on the lunar phase. The best\ntime to view craters and mountains is when they lie along the terminator, which divides day and night on the Moon.\nThere, the sunlight strikes features at a glancing angle causing them to cast long shadows which helps a great deal to\nbring out topographic (strictly speaking, \"selenographic\") relief visually. The terminator is particularly rich in relief\nnear First Quarter (and Last Quarter) phase. In contrast, the flat light and dark areas and the lunar rays will be more\nclearly seen away from this shadow line, especially around Full Moon phase.\nn.b. It may be wise to consider using the eyepiece-mountable ``Moon filter'' in your kit if you plan to be observing a\nsubstantially-lit Moon for a fairly long time; it's a very bright object! (up to mag. -13!). (The kit has an assortment of\ncolored filters too, if you're feeling particularly artistic).\nBegin by making a LARGE rough sketch of the visible lunar surface, mainly to serve as a sort of \"scaffolding\" within\nwhich you can subsequently make your more detailed observations. Don't spend too much time on this first sketch!\nInclude only large dark patches, very noticeable craters, and other large features. Once you've got your large sketch,\nyou can proceed with some more detailed observations by selecting and answering questions from the following list,\nadding features to your sketch and indexing them appropriately as you go along.\nOne way to handle this is to use the \"question number\" from the list as a short label for the feature on the sketch itself,\n(e.g., labeling a feature 2e on the sketch itself and noting 2e = crater with center peak) in your notebook. As you sketch\nand index the features in your notebook, leave space for the correct given name of each. Back inside, you can use a\nprinted Sky and Telescope Lunar Map to find the correct name for each feature you observed. If you want more\n\n12.409, Spring 2002\ndetailed reference maps, go to the Stein Map Room in the Science Library or to the Lindgren Library (54-200) and use\na lunar atlas there.\nIf you look for but can't find an example of a particular feature, then record that fact in your notebook. Of course, feel\nfree to sketch in any other features or structure you find intriguing.\n1 The lunar \"seas\": maria, the flat darker gray lunar plains\na) Estimate the percentage of visible surface covered by maria.\nb) What is the general shape of the maria?\nc) In general, are the maria connected to one another? Try to find an example of a lunar plain which is not connected\nto the others.\nd) Can you find areas which differ distinctly in reflectivity (darker or brighter) from that of the rest of the surface?\ne) Some of the mare floors show wavelike ripples when sunlight strikes them at a glancing angle (i.e. near the\nterminator). Try to find an example of this effect.\nf)\nCan you find examples of different sorts of interaction between craters and maria? Which appears to have\nhappened earlier in lunar history:\n\nlarger-scale cratering, or\n\nformation of maria?\ng) Examine the ``Straight Wall'' cliff, in eastern Mare Nubium. (labeled xx on the Lunar Map, near crater Birt {#37)\nIt's 130 km long, 180 m high, slope of 40o).\n2. The lunar craters\na) In which quadrant of the visible surface do most of the craters lie?\nb) In general, which wall of a crater (inner or outer) is steeper?\nc) Do most of the crater floors appear to be above, below, or level with the general ground-level of the surrounding\nregion? Try to find at least 1 example of each of these 3 cases.\nd) The largest craters, such as Clavius, Plato, and Ptolemaeus, are often called walled plains. Find one and contrast\nits shape and outside wall or lack thereof with that of the more moderately-sized craters.\ne) Do all large craters have central peaks?\nf)\nAre peaks always at the center?\ng) Can you find an example where the central peak exhibits a hole at the summit?\nh) Can you see examples of small craters on the rims of larger craters, deforming their walls?\ni)\nLocate and examine a few twin craters.\n3. The lunar mountains - you can use the Lunar Map to easily locate one or more visible mountain ranges.\na) Do the mountain ranges appear in general to be straight or curved?\nb) Does one side appear to be steeper, in general?\nc) Look for a mountain peak (or a high crater wall) on the night side of the Moon, just over the terminator, that rises\nhigh enough to catch some of the rays of the rising Sun and shine like a bright spot of light.\n4. Lunar rays - these are best seen with Sun \"overhead\" (shadows absent). Craters Tycho and Copernicus have\nparticularly notable ray systems.\na) Are the rays continuous across the lunar surface? Do rays appear to pass equally well over maria, crater walls, and\nmountains?\nb) Do rays always appear to radiate from crater centers?\nc) Estimate the lengths of the rays associated with one crater (your choice!). (The diameter of the Moon is about\n3480km.)\n5. Rilles and craterlet chains - Rilles are long narrow cracks in the surface, half a mile or so across.\na) Find some rilles.\nb) Can you tell if rilles appear to be associated primarily with one specific type of lunar feature or are they fairly\nuniform in distribution?\n\n12.409, Spring 2002\nc) Note that at high powers under conditions of good seeing, some rilles will be revealed to really be craterlet chains\n(e.g. the Rheita Valley, labeled S on the Lunar Map, near crater Rheita #251). Locate and examine one or more\nchains of craters.\nd) Examine the `\"Alpine Valley'\", a deep straight gorge cutting through the lunar Alps at the northeast corner of Mare\nImbrium. (labeled aa on the Lunar Map, near crater Protagoras #238)\n3.2 Variable Stars - making visual estimates\nThe stars listed here vary in brightness fairly regularly over a period of a few days. If you observe one or more of\nthese stars carefully on two or more different nights, you should be able to detect these changes.\nTo make a visual estimation of the magnitude of a star, sketch the field you'll use (including the variable). Choose a\nnumber of other stars in the field and assign them each a letter name in order of decreasing magnitude (e.g., A =\nbrightest, B = not quite as bright as A, ...), recording the letter names on your sketch. Then make an estimate for the\nvariable star, so that on a scale of 1 to 10 between two ``lettered'' stars, say B and C, a B2 would represent a brightness\nabout 20\\% of the way from B down to C (brighter than C by about four times as much as it is fainter than B). Keep\nyour eyes moving; look back and forth repeatedly among the 3 stars (brighter, fainter, variable) and judge the variable's\nbrightness as best you can. (Don't worry about trying to assign numerical values for the magnitudes at the telescope.)\nIt is important that you approach the brightness estimation task without letting any preconceptions of \"what you think\nthe star should be doing\" affect your work. At first you may find it difficult to distinguish between brightnesses which\nare less than 0.3 or 0.4 mag. apart; brightness estimation skill is improved only by practice.\n1. b Persei (Algol, in Perseus) - an eclipsing binary - orbiting pair of stars of different brightnesses whose orientation\ncauses them to eclipse each other as seen from Earth. A bright (bright enough for Cambridge!) variable star with a\nshort period. [Dm = 1.3; period = 2.9 days] Using Rey's book or the atlas, you'll be able to locate it with your unaided\neye, and will need to estimate its brightness relative to other nearby naked-eye stars (i.e. don't use the telescope at all\nfor this one; even the finder field is too small a field).\nSuggestions for estimations using the LX200:\n\nThis type of work is best done with a low-power eyepiece. If the variable is the brightest object in the field, try\nusing the finder scope; you want at least one star in the field to be brighter than the variable so you can make\nan accurate estimate. It isn't as instructive to know only that the star was brighter than 7th magnitude if the star\nwas actually varying between 7th and 5th magnitude.\n\nCenter the star(s) in your field of view (to avoid vignetting, false contrast with inside of tube).\n\nTry viewing the star(s) slightly out-of-focus: apparently it's easier to compare the brightnesses of discs than of\npinpoints.\n2.\nHU Tauri (in Taurus) - another eclipsing binary. [Dm = 0.8; period = 2.1 days] Although plotted in the Sky Atlas\n2000}, the 12s23 Atlas Supplement (hanging around the room) goes one better, with a copy of Uranometria chart\n#134 for use as a finder chart. You'll probably need to use your finder scope to get a good set of in-field\ncomparison stars. HU~Tau has a fairly small magnitude range, so make your estimates as carefully and as\naccurately as you can.\n3.3 More Clusters, Nebulae, Galaxies\nFor these objects, the task of finding them at all among trackless expanses of stars is non-trivial, mainly because it's not\nnearly as obvious when you've successfully got one in your field. To locate them, you'll need to be fairly adept at using\nstar charts and finding your way around confusing star fields. (Any awkwardness with charts in the dark spells\ntrouble.) Your success or lack thereof also depends on your eyesight and the prevailing sky conditions, so please keep\n\n12.409, Spring 2002\nthat in mind as you begin to consider throwing your partner off the roof out of sheer frustration. (We note, in fairness,\nthat you have a couple of \"secret weapons\" we'll let you in on partway through the semester...)\nWhen you do find one, draw what you see, with different eyepieces if there is a distinction. Normally you'll want to\nstick with low power to get brighter images. Note especially the important characteristics, such as angular size, shape,\nand any visible color. Using \"averted vision\" may help you see faint objects. You can also try using the ``LPR'' (Light\nPollution Reduction) filter to increase contrast by darkening the sky background (works best on emission nebulae).\n1.\nRosette Nebula (NGC-2237, -2238, -2239, -2246; and open cluster NGC-2244) in Monoceros - a diffuse emission\nnebula. You won't see this one visually: even though it's about three times the size of the full moon, it is an\nEXTREMELY LOW-CONTRAST nebula. It's included here as an intermediate-level target for CCD observations\n(from Wallace?) rather than for sketching. To observe it, use the LX200 to locate NGC-2244, the open cluster it\nlives with.\n2.\nM1 in Taurus - The Crab Nebula, a diffuse emission nebula. Remnant of the Supernova of A.D.1054. Be\npatient! A small AND faint object!\n3.\nM38 in Auriga - an open cluster\n4.\nM81 in Ursa Major - a spiral galaxy seen face-on\n5.\nBubble Nebula in Casseopia (aka NGC 7635) - Bright Nebula (HII region)\n6.\nM5 in Serpens - Globular cluster available late in the semester\n7.\nM92 in Hercules - Globular cluster also available late in the semester.\n8.\nM64 in Coma Berenices - The Black-eye Galaxy, a spiral\n9.\nM104 in Virgo - The Sombrero Galaxy, a spiral seen almost edge-on. A small object that would fit nicely in the\nCCD FOV.\n10. M57 in Lyra - The Ring Nebula, a planetary nebula. A small object that looks somewhat like a \"focus doughnut.\"\n3.5 Alien Spacecraft Note especially any bumper stickers on the spaceship (as information about alien society).\nAbove all, it's important to FEED YOUR NOTEBOOK!\n4((r)(r)(r)(r) expert) Faint Planets, Asteroids, and Other Challenging Stuff\n4.1 More Planets\nAs mentioned, earlier, Uranus, Neptune, and Pluto, which would normally go in this section, are not even theoretically\npossible during Spring in 2002.\n4.2 Asteroids\nTypically at least one or two of the four largest asteroids will be bright enough to observe using our telescopes.\nLocating and positively identifying an asteroid takes a bit of extra effort since they move significantly each day, so you\nneed an accurate finder chart that also shows stars at least as faint as you expect the asteroid to be. To observe an\nasteroid, star-hop to its location as shown on your finder chart, and then at low magnification carefully and completely\nsketch the pattern of field stars you see. Hopefully one of those \"stars\" is really your asteroid! Be sure to save your\n\n12.409, Spring 2002\nfinding chart, so that the next night you observe you can verify that the asteroid really was in your field by finding and\nsketching the same field a second time; your asteroid will be the object that moved!\nMaking a finder chart: The charts can be made using the Voyager III application. This is an especially\nstraightforward approach because the software handles both calculating the asteroid position as well as plotting it on a\nstar chart.\nBut you can plot a finder chart even if you don't have a spiffy program to do it for you, as long as you can get hold of\nan ephemeris (Ephemeris is astronomer-speak for a tabulation of an object's RA, Dec, and distance for some set of\ntimes at regular intervals. Complete ephemerides (plural form) for the four brightest asteroids 1-Ceres, 2-Pallas, 3-\nJuno, and 4-Vesta are printed each year in the Astronomical Almanac; partial tables for other asteroids which are\nfainter but still potentially observable with small telescopes appear from time to time in Sky and Telescope and\nAstronomy, usually with finder charts. Various online sources for asteroid ephemerides also exist--ask Andy for their\naddresses) for the asteroid covering the time you wish to observe. You'll need a star atlas that shows stars at least as\nfaint as the asteroid, such as Sky Atlas 2000 (to mag. +8), Uranometria 2000 (to mag. +9), or the brand new\nMillennium Star Atlas (to mag. +11). (Remember that you need to use a chart referenced to the same equinox as the\ncoordinates you have, usually 2000. Watch out for older charts in 1950 coordinates!) Photocopy the appropriate chart\nand plot the asteroid's position at five- to ten-day intervals lightly in pencil, then draw a smooth curve passing through\nall the points.\nAnother way to handle the observations is reminiscent of the way asteroids are discovered today--when we begin\nusing CCDs on the telescopes, move the telescope to the field containing the asteroid of interest (several relatively\nbright ones available this semester are listed below), and take several integrations separated by a few minutes. You\nshould easily be able to see the asteroid move relative to the background stars. If the exposure is long enough and the\nasteroid is moving fast enough, you might even be able to get the target to leave a trail (this exercise is left for the\nreader...).\nPlausibly observable asteroids this semester: Vesta (pieces of Vesta have fallen to Earth), Mathilde (faint, maybe\ntoo faint. The first body visited by the NEAR Shoemaker spacecraft), Juno, Zelinda, Kalliope, Papagena, Flora...\n4.3 Still More Clusters, Nebulae, Galaxies\n1.\nopen cluster M103 in Cassiopeia (quite a small one)\n2.\n\"Owl Nebula\" - planetary nebula M97 in Ursa Major\n3.\nirregular galaxy M82 in Ursa Major, seen on-edge\n4.\nGlobular cluster NGC 2419 (quite faint and small), possibly not gravitationally bound to Milky Way\n5.\nspiral galaxy M66 in Leo\n6.\nspiral galaxy M65 in Leo\n7.\n\"Whirlpool Galaxy\" - spiral galaxy M51 in Canes Venatici, seen face-on. Fairly close to the zenith late in the\nsemester; so do some neck-stretches to loosen up beforehand.\n8.\nirregular galaxy M82 in Ursa Major, seen on-edge\n9.\nglobular cluster M107 in Ophiuchus available late in the semester.\n\n12.409, Spring 2002\n4.4 More Variable Stars\n1.\nVZ Cancri: (a pulsating variable) - one kind of star that intrinsically changes in brightness. [Dm = 0.7; period =\n4.3 hours] This star's brightness sports a rapid rise followed by a slower fall. Its period is short enough that you\nshould be able to detect a brightness change over the course of only one night's observing, if you make your\nbrightness estimates carefully. Use your finder scope field and compare the star with field stars to its N and NW.\nTry making observations at intervals of about 1 hour, at the beginning, middle, and end of class.\n2.\nz Geminorum (in Gemini): one of the brightest Cepheid variables, another type of intrinsic variable. [Dm = 0.5;\nperiod = 10.2 days] You should be able to find it `eyes-only' by using the Sky Atlas 2000. z Gem has an\nabnormally symmetric light curve but a fairly small magnitude range, so make your estimates as carefully and as\naccurately as you can. This is a candidate for naked-eye comparison (no telescope); The two nearby stars k Gem\n[mag. +3.6] and u Gem} [mag. +4.1] correspond closely in brightness to the extrema of z Gem.\n3.\nU Geminorum: Namesake of the small class of stars \"U Gem/SS Cyg type, with outbursts'\", sometimes called\ncataclysmic variables or mini-novae. [Dm = 6.7; unpredictable period ~ 60 to 260 days] Use your 40mm eyepiece\nto get 50x. This will probably be one of the most challenging objects to find --- don't become discouraged if it\ntakes some time (like attempts on more than one class night), because it glows faintly at only mag. +14.9 during\nthe fainter part of its cycle. 14.9 is really pushing beyond the visual limits of an 8-inch telescope, even under ideal\nconditions, so don't feel incompetent if you decide it's invisible (even from Wallace). But most importantly, you\nshould learn the star field, because that way, you can set an upper limiting magnitude to the star's brightness. At\n60- to 260-day intervals, U Gem brightens quickly (taking 24 to 48 hours) to about magnitude +8.2, and stays there\nfor a week or two --- you should have no trouble identifying it then, either in Cambridge or at Wallace! A finder\nchart appears in Burnham's Celestial Handbook, Vol.2} on page 930, along with a plan of attack on page 925. Who\nwill be the first to see U~Gem if it brightens for us this term?\n4.5 Satellite Observations\nPassages of the HST spacecraft and International Space Station (ISS) can be visible sometime during the couple hours\nfollowing the end of twilight. It's visible from our location with a LX200 at low power provided you're looking in\nprecisely the right place at the right time; it takes only 1 to 2 seconds to pass through the field. Due to atmospheric\ndrag and other effects constantly affecting the orbit, accurate finder charts cannot be prepared until the day of the\nplanned observations. Online sites will also give observation predictions for the Boston area.\n\n12.409, Spring 2002\n5 Charts and Tables\n5.1 Object Information Table\nItems in bold indicate well-known objects of special interest. Visibility information appears on\npages 13 and 14. Note that coordinates given here for objects are for equator and equinox J2000.0.\nDescription key: EN = emission nebula\nPN = planetary nebula\nGC = globular cluster\nOC = open cluster: mag. given as \"brightest member (integrated)\"\nGX = galaxy\nVS= variable star\nObject\nCon.\nRA2000\nDec2000\nmvisual\nType\nDescription\nB Per\nPer\n3h08m10s.1\n+40°57'.3\n~2\nVS\n\nz Gem\nGem\n7h04m07s\n+20°34'.1\n3.7-4.2\nVS\n\nHU Tau\nTau\n4h38m16s\n+20°41'.0\n5.9-6.7\nVS\n\nU Gem\nGem\n7h55m05s\n+22°00'.2\n8.2-14.9\nVS\n\nVZ Cnc\nCnc\n8h40m52s\n+9°49'.5\n7.2-7.9\nVS\n\nh Per\nPer\n2h19.m0\n+57°09'\n7 (4.3)\nOC\n\nhalf of the Double Cluster\nc Per\nPer\n2h22.m4\n+57°07'\n7 (4.3)\nOC\n\nthe other half; h's buddy\nNGC2244\nMon\n6h32.m3\n+4°51'\n7 (5.2)\nOC\n\nRosette Nebula cluster\nNGC2419\nLyn\n7h38.m1\n+38°52'\n10.3\nGC\n\nNGC7635\nCas\n23h20.m7\n+61°12'\n6.9\nEN\n\nBubble Nebula\nM1\nTau\n5h34.m5\n+22°02'\n8.4\nEN\n\nCrab Nebula\nM3\nCVn\n13h42.m1\n+28°23'\n6.3\nGC\n\nM5\nSer\n15h18.m5\n+2°06'\n6.1\nGC\n\nM13\nHer\n16h41.m7\n+36°28'\n5.9\nGC\n\nHercules Cluster\nM31\nAnd\n0h42.m7\n+41°16'\n3.5\nGX\n\nAndromeda Galaxy\nM38\nAur\n5h28.m7\n+35°51'\n8 (7.0)\nOC\n\nM42\nOri\n5h35.m4\n-5°23'\nEN\n\nOrion Nebula\nM44\nCnc\n8h40.m1\n+20°00'\n6 (3.9)\nOC\n\nBeehive Cluster\nM45\nTau\n3h47.m0\n+24°07'\n3 (1.6)\nOC\n\nThe Pleiades\nM51\nCVn\n13h29.m9\n+47°12'\n8.4\nGX\n\nWhirlpool Galaxy\nM57\nLyr\n18h53.m7\n+33°02'\n9.0\nPN\n\nRing Nebula\nM64\nCom\n12h56.m7\n+21°33'\n8.5\nGX\n\nBlackeye Galaxy\nM65\nLeo\n11h19.m0\n+13°05'\n9.4\nGX\n\nspiral galaxy\nM66\nLeo\n11h20.m2\n+12°59'\n9.0\nGX\n\nspiral galaxy\nM81\nUMa\n9h55.m8\n+69°03'\n7 0\nGX\n\nspiral galaxy\nM82\nUMa\n9h56.m0\n+69°41'\n8.4\nGX\n\nirregular galaxy\nM92\nHer\n17h17.m1\n+43°09'\n6.4\nGC\n\nM97\nUMa\n11h14.m9\n+55°00'\n11.1\nPN\n\nOwl Nebula\nM103\nCas\n1h33.m3\n+60°43'\n9 (6.9)\nOC\n\nM104\nVir\n12h40.m0\n-11°38'\n8.3\nGX\n\nSombreroGalaxy\nM107\nOph\n16h32.m5\n-13°04'\n9.2\nGC\n\n12.409, Spring 2002\n5.2 Visibility of Easy (\n\n) Objects\nBar marks dates between which object is above 20° altitude sometime during class for our location.\n\n12.409, Spring 2002\n5.3 Visibility of Intermediate (\n\n) and Expert (\n\n) Objects"
    },
    {
      "category": "Resource",
      "title": "handout6_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/36959f2eef8b915f9a2db2350693e08d_handout6_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Observing Stars and Planets, Spring 2002\nHandout 6 / week of 2002 February 25\nObserving Tips\nVision\nDark adaptation\nDark adaptation takes time. The eye's pupil expands to its maximum diameter in seconds after the lights go out. The\nmain cause of dark adaptation, however, is chemical and not related to the size of the pupil. After going from light to\ndark our eyes gain in sensitivity due to the release of a chemical called rhodopsin that acts to bleach the photopigments\nin the cells in the retina.. The retina contains two main types of cells, rods and cones. The rods are distributed over the\nentire retina, are sensitive to lower light levels, and are insensitive to red light. In contrast, the cones are clustered\ntowards the center of the optical axis, are sensitive to bright light, and have three types each of which are sensitive to\nred, green, or blue wavelengths. Over the first 5-10 minutes in the dark, the cones reach their maximum level of dark\nadaptation. This allows the general sense that one is dark adapted. But over the next 20-40 minutes the rods will\nasymptotically approach their sensitivity limit and during this time period the eye can gain 2 or more magnitudes of\nsensitivity (how much fainter is this...by what factor in intensity? Hint: see handout 4). Using a red flashlight will\nhelp protect your night vision because the rods that are most sensitive at low light levels after dark adaptation are not\nsensitive to red light.\nAverted vision\nAverted vision (placing your target object away from the center of your eye's FOV by say 8°-16° ) can help you see\nvery faint objects. The reason for this is that the cones (sensitive to bright light) are centrally located creating\nsomewhat of a blind spot to very dim objects whereas the rods (sensitive to lower light levels especially after dark\nadaptation) are distributed over the entire retina.\nColor\nFaint, deep-sky objects often disappoint beginning observers due to the lack of brilliant color as seen in the published\nimaging results. The reason for this is again due to the physical nature of our natural detector. Remember that only the\ncones are sensitive to color. Unfortunately, they are also insensitive to low light levels compared to the rods. Thus at\nlow light levels we are using just our rods and making black and white detections. M42 is one of the only nebulae with\nhigh enough surface brightness to stimulate at least some people's cone cells (this varies greatly from person to\nperson).\nEye glasses\nMany who wear eyeglasses find it difficult to properly position their eye for viewing with an eyepiece; the amount of\ndifficulty varies somewhat with eyepiece design. There's also a problem of unwanted reflections of your eye and lights\nin the observing environment. The solution is to remove your glasses and then adjust the focus for your now\nuncorrected eye; you and your partner (and probably your instructor and UTA) will thus each prefer slightly different\nfocus settings (this works if your glasses correct primarily for nearsightedness or farsightedness; if you're severely\nastigmatic you're sort of stuck with viewing with your glasses on although you should try it both ways to see which is\nbetter for you).\nMiscellaneous\n\nUse the moon filter to cut down the uncomfortable intensity from the full Moon\n\nViews through finderscope and main scope without the diagonal are inverted. The view through the diagonal\nis left-right reversed but not inverted. Explanation of this is left until handout 7 on optics and telescope\ndesign.\n\n12.409, Spring 2002\nStar Hopping\nStar hopping is analogous to looking at a map and jotting down some directions to follow while you're driving but you\nalso want to include some picture of landmarks so you know you're on the right track. Sufficient planning before an\nevening of observing can greatly decrease your frustration level when searching for faint fuzzies.\nThe following is an example of a well prepared set of directions to find NGC 2392 (a planetary nebula ~8 mag that\nwould count as an intermediate object in the menu). In order to proceed you will need a Star atlas (preferable\nNorton's) and the atlas overlays from the Atlas Supplement notebooks.\n1.\nFind Castor and Pollux (bright stars in Gemini) in the Atlas.\n2.\nCenter the finderscope overlay on Pollux (aka b Geminorum).\n3.\nNote the triangle formed by Pollux, s Geminorum (to the northwest), and u Geminorum (near the southwest edge\nof the field).\n4.\nMove the overlay so it is now centered on u Geminorum (this corresponds to your first telescope movement).\n5.\nNote the two new pairs of stars (64, 65 and i Geminorum, 59) that have entered from the west of the field.\n6.\nMove the overlay so it is centered on i Geminorum (the fainter 59 just to the southwest will confirm you have the\nright star at the telescope...you might need to check your eyepiece).\n7.\nNote 57 at the south edge of the field.\n8.\nMove the overlay so that it is centered on 57.\n9.\nNow the fairly bright star, d Geminorum, should be just out of the FOV to the south (in the same direction you\nmoved from i Geminorum to57).\n10. Move the overlay to the south and then center on d Geminorum.\n11. Note the equilateral triangle formed by d Geminorum, and 56 and 63 (to its southeast).\n12. Note the two faint stars on either side of 63 (this will confirm you have 63 in your eyepiece at the telescope).\n13. Note the flat triangle that 61 and 63 form with our target NGC 2392.\n14. Center (or put it at the sweet spot if your finder is a bit mis-aligned) the finderscope on the position of NGC 2392\nin the triangle (you will not be able to see it in the finder).\nA word about directions: Notice that in a star atlas, east is left of north (opposite to land maps). If you need to\nconvince yourself of this remember that RA increases to the east. Next remember that north is up on your map but in\nthe sky it is the direction pointing to Polaris (sometimes it helps to turn your map accordingly when you are outside at\nthe telescope).\nAt the telescope: Before you attempt to locate the object, figure out which way is N,S, E, and W when looking through\nyour finder (and do the same for your eyepiece if you are using the diagonal). Move the telescope N (using the N\nbutton) and stars will enter from the North edge of the field. Do the same for E-W and you're ready to go.\nIf you get lost, start over from the beginning of the process rather than attempting to figure it our on the fly...this will\nonly lead to frustration.\nThe following is an article from Sky and Telescope \"Backyard Astronomy\" from Feb. 1984, pp. 131-133.\n\n12.409, Spring 2002\nSky and Telescope, Feb. 1984, pp. 131-133\n\n12.409, Spring 2002\nSky and Telescope, Feb. 1984, pp. 131-133\n\n12.409, Spring 2002\nSky and Telescope, Feb. 1984, pp. 131-133"
    },
    {
      "category": "Resource",
      "title": "handout7_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/1e0eae8fa82d2694f2e61014362b40a9_handout7_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\n12.409 Observing Stars and Planets, Spring 2002\nHandout 7 week of February 25, 2002\nCopyright 1999\nCreated S. Slivan\nRevised A. Rivkin and J. Thomas-Osip\nUseful Optics Information\nWhat you know so far (or at least may know so far) by experience with the LX200:\nViews through the telescope and finder scope are inverted\nDiagonal mirror view is right-side-up but left/right reversed\nYou see fainter objects in the finder than you can with the unaided eye, and\nobjects which are fainter still with the telescope itself\nOf the eyepieces in your kit,\n6.4 mm has the smallest field of view, highest magnification, and dimmest\nimages\n40 mm has the widest field of view, least magnification, and brightest\nimages\nRings of color (particularly red and blue) around bright objects, especially bright\nstars and planets near the horizon\nA very defocused image of a point source has a \"doughnut\" shape\nThe SECRETS behind these phenomena will be revealed herein!\nContents\n1 HOW DO TELESCOPES WORK?\n1.1\nLight-Gathering and Image Formation\n1.2\nImage Size Depends On Focal Length\n1.3\nImage Brightness Depends On Focal Ratio\n1.4\nResolving Power (and limit thereof)\n1.5\nMagnification and Field of View\nTELESCOPE DESIGNS\n2.1\nRefractors\n2.2\nReflectors\n2.3\nCatadioptric (a combination of refracting and reflecting)\n\n12.409, Spring 2002\n1 How Do Telescopes Work?\n1.1 Light-Gathering and Image Formation\nOptical telescopes make use of 2 phenomena:\n∑ Reflection of light, by mirrors (Figure 1), and\n∑ Refraction of light, by lenses (Figure 2)\nFigure 1: Light ray reflected from flat surface\nRefraction is the bending of light ray as it passes from one medium to another.\nApplication of Snell's Law:\nn\nn\ni\nr\nsin\nsin\nq\nq\n=\n(1)\nwhere the value of n, the refractive index, is characteristic of the material the ray is\npassing through:\nn = 1.0000 for a perfect vacuum\nn = 1.0002 for air\nn a 1.5 for glass\nn is really\nspeed of light in vacuum\nspeed of light in m\n\nedium . Figure 2 illustrates the case where n2 > n1.\nFigure 2: Light ray refracted at a boundary between 2 media\nThat's how you make a lens, as shown in Figure 3. The distance labeled f is the focal\nlength of the lens. The image of an object at \"infinity\" will be formed at the distance f\nbehind the lens. As we'll see later in Section 2, telescopes come in a variety of optical\narrangements. Many designs contain both refractive and reflective optics, but for the\nsake of simplifying the following presentation, only lenses are used for the sample\ntelescopes. In fact, for our purposes reflection and refraction are equivalent, in the sense\nthat one can in principle construct a system using only lenses which is optically\nindistinguishable from a system using mirrors. By using our lens as an objective to\ncollect light from some far-away object to create an image, we find we have constructed\nthe basic astronomical refractor telescope.\n\n12.409, Spring 2002\nFigure 3: Refraction by lens\n1.2 Image Size Depends On Focal Length\nNote that our refractor as described so far has no eyepiece lens and thus will not allow\nsomeone to directly view the image it has created, since the human visual system isn't\ndesigned to use already-focused light rays. Even so, our simple instrument is in fact a\ntelescope, and to see how and where the image is formed you could hold a white card or\npiece of photographic film at the focus, as in Figure 4 in which two stars are separated in\nthe sky by angle q and are being observed.\nFigure 4: Film at focus\nBy similar triangles q is unchanged, so the separation of the stars in the image is\nproportional to their angular separation in the sky.\nFigure 5: Angular separation transformed to linear distance\nAlso, from Figure 5 see that:\ntanq = d fObj\n(2)\nwhere d is the linear distance between the stars in the image, and fObj is the focal length of\nthe lens. Now, (physicists love to pull sneaky tricks like this one) since q is so small,\nwhat with the stars being at infinity and all, tanq a q. This gets us\n\n12.409, Spring 2002\nq\nq\n=\nfi\n=\nd\nf\nf\nd\nObj\nObj\n(3)\nThus, 1/ fObj is a constant (with units of radians\nlength ) directly relating angular separation in the\nsky to linear distance on the image!\nLet's fix up the units to be something convenient: 1 radian a 206265 arcseconds\nSo the image scale of the objective lens (also called the plate scale) is\nplate scale\nf\nin mm\narc\nper mm\nObj\n\na\n(\n)\nsec\n(4)\nEXAMPLE: What is the linear diameter of the Moon on an image taken at the straight\ncassegrain focus of an LX200?\nFirst, we need the image scale. For the LX200, fObj = 2000 mm, so the image\nscale at \"cassegrain focus\", by Equation (4), is\n206265 arcsec/2000 mm = 103 arcsec/mm\nTo use the image scale to determine image size, we now need to know the angular\nsize of the target object. The disk of the Moon subtends a diameter of about 1/2o ,\nwhich is 1800\".\n800 arcsec\n\narc\nmm\nmm\nsec\na\nThus, if we try to image the Moon onto a CCD detector (the SBIG ST-7E you'll\nbe using in class are approximately 7 mm ¥ 5 mm), the whole thing won't fit. In\nthis case we would need to either use different optics, or resign ourselves to\nsplicing together an array of images.\n1.3 Image Brightness Depends On Focal Ratio\nThe brightness of the image you get depends upon two things (the symbol μ is used here\nto indicate proportionality):\n1. How much light you collect from the object in the first place, which depends only on\nthe area of your objective lens, or mirror (like raindrops into a bucket).\nThe following is how \"how much does a telescope help us increase apparent brightness\"\nwas computed in the \"Can we observe X tonight\" handout.\nA\nr\nd\nd\nage Brightness\nd\nObj\nObj\nObj\nObj\n=\n=\nE\nEA\nˆ\n=\nfi\nμ\np\np\np\nIm\n\nSo our 8-inch-objective telescope collects 64 times as much light as does a 1-inch-\nobjective finder scope.\n\n12.409, Spring 2002\n2. How big an image size you're spreading the light over.\nIf you keep the amount of light constant, IMAGE BRIGHTNESS μ 1/AREA, and since\nAREA μ f2 as shown in Figure 6, the IMAGE BRIGHTNESS μ 1/f2\nFigure 6: Exposed area is proportional to distance squared\nPutting points 1 and 2 together we get:\nIMAGE BRIGHTNESS μ d2 ¥1/f2 = d2/f2 = (d/f)2\nThe square root of the reciprocal of this quantity is called the focal ratio or f-number,\nfamiliar to those of you who've used SLR cameras.\nf\nnumber\nfocal ratio\nf\nd\nfocal length\nobjective diameter\n-\n=\n=\n=\n\n(5)\nFor our telescopes, the f-number is fixed at 2000mm/200mm = \"f/10\"\nOn a camera lens, the f-numbver is adjustable by virtue of an iris diaphragm which is\nused to effectively reduce d; f stayes fixed unless you're using a zoom lens.\nLOW F-NUMBERS: brighter image, wide field (many arcsec per mm) so individual\nobjects appear smaller. Better for galaxies, faint nebulae, and the Milky Way, or for\nallowing shorter exposure times for bright objects (Moon, planets).\nHIGH F-NUMBERS: dimmer image, narrow field, so individual objects appear larger.\nBetter for limiting the accumulation of sky brightness fogging during long-exposures, or\nfor larger images of bright objects.\n\"narrow field\" here does not mean that as you close up the aperture on your camera lens\nyou narrow your field; rather, it means that for two optical systems with the same\ndiamter objective but with different f-numbers, the system with the higher f-number has a\nsmaller field.\nFinally, even with the advantage afforded us by the \"bigger eye\" of the telescope, there\nare some rather anti-social effects which will cause us difficulties with our attempted\nviewing of faint objects:\n\n12.409, Spring 2002\nExtinction--light is scattered and absorbed as it passes through the atmosphere.\nThis effect is minimum when the object you're observing is directly overhead,\nand is maximum when it's down near the horizon.\nContrast (or lack thereof)--In Cambridge, there's lots of ambient light scattered\nin a sky with lots of dust and haze for it to reflect back at us from (though less,\nthere's some in Westford as well, particularly if you look low in the east toward\nthe nearby city of Lowell or to the southeast toward Boston).\n1.4 Resolving Power (and limit thereof)\nSo far, our treatment of telescope operation has used refraction and reflection only.\nThis is a subset of what's called geometric optics, and describes a sort of an \"ideal\nworld\" case. Geometrically, point-source stars in the sky would appear in the image\nas perfect Euclidean points as in the left side of Figure 7, but here in the real world\nwe get blobs instead as shown on the right. Why isn't the real world geometric?\nFigure 7: Ideal vs. Real-World resolution\nFirst, because of the physics of light being partly wave-like, a point source\nimaged through a circular aperture such as a telescope will not produce a point\nimage but will in fact yield a small circular blot called a diffraction disk (also\nknown as an Airy disk) on the image instead.\nThe physics of this are included in subject 8.03\nThe disk diameter is well-defined and is inversely proportional to the diameter of\nthe original aperture, so by successively increasing the aperture size from that of\nthe unaided eye, to finder scope, to binoculars, to telescope, we can decrease the\nblot size by virtue of successively larger objectives, and thus increase the\nresolution available in the image...\n... until we hit the limit of observing conditions, that is. Somewhere around the\nsmall-binocular-sized aperture range, another player kicks in to hold image blurs\nback to the 1\"-5\" range, in the guise of atmospheric seeing--you're looking up\nthrough an atmosphere complete with turbulence and density variations due\nprimarily to temperature variations (e.g. when viewing from campus, the Bldg. 42\nsteam plant smokestack). Seeing at the best ground-based sites (such as Las\nCampanas, Chile) sometimes gets down in the range 0.4\" to 0.8\" . Good seeing at\nWallace is typically 3-5\". (Even with the seeing limit, larger apertures still win\non the image brightness front; at least you can get brighter seeing blotches...)\n\n12.409, Spring 2002\nBreaking the seeing-limited barrier was one of the major motivations behind orbiting the\nHubble Space Telescope, which could in fact be diffaction-limited to some truly amazing\nresolution if the primary mirror had been figured properly...\nFinally, the resolution of the image you actually see or record with some detector\ncan be further limited by the structure of the detector used, if it's coarser than that\nintrinsically available in the image. For example, the coarseness of the structure\nof light detectors on the retina limits resolution perceived by the eye to about 1'.\nThere's a subtle distinction here between increasing the resolution available in the image\nitself by using a larger objective (at least up to the limit imposed by the seeing), and\nincreasing the magnification of the image as you've done when observing visually by\nchanging to a shorter focal-length eyepiece, which is dealt with in the following section.\nIn short: magnifying a non-resolved blotch will yield only a bigger non-resolved blotch.\n1.5 Magnification and Field of View\nOur demonstration telescope objective so far has been fine by itself for imaging, but for\nvisual observing we need to add an eyepiece which will let us see the image. An\neyepiece is just another lens, but instead of using it to collect light (as we do for an\nobjective lens) we'll use it as if it were a magnifying lens like those you've played with\nbefore--what you were doing was putting an object at the focal point and observing it\nfrom the other side (Figure 8) .\nFigure 8: Magnifying lens\nTo you, it looks like the image of the fly is at infinity--this is the most comfortable\nviewing arrangement for your eye (i.e. your eye focuses as if the fly were at infinity). So,\nif we put these two lenses together, the eyepiece and the objective, we finally have a\nrefractor telescope for visual observing (Figure 9).\nFigure 9: Refractor telescope\n\n12.409, Spring 2002\nThe finderscope on the LX200 is this type of telescope.\nNotice that the image you see is inverted (Figure 10).\nFigure 10: Refractor with eyepiece\nq\nq\nf\nf\na\n=\na\n=\ntan\ntan\nd\nf\nd\nf\nObj\ne\n;\nf\nq =\n=\nÆ\napparent angle\nreal angle\nf\nf\nObj\ne\n\nthis is the magnification\nM\nf\nf\nObj\ne\n=\n(6)\nYou see that the magnification of a telescope is variable, in the sense that exchanging\namong eyepieces of different focal length changes the magnification you get. Using\nequation (6), you can calculate the magnifications that are obtained with the eyepieces in\nyour observing kit and the 8\" LX200 (you can check your math with handout 3). As\npower increases, the image brightness decreases rapidly as does the perceived image\nsharpness.\nField of view (FOV):\nIt varies with the focal length of the eyepiece and also with the particular optical design\nof the eyepiece (i.e. a 25 mm \"orthoscopic\" probably has a different field of view than a\n25 mm \"Kellner\").\nThe only definitive way to determine your field of view with a given eyepiece is to put a\nstar near the celestial equator at the east edge of your field, turn off your clock drive, and\ntime it drifting across the field. If it takes t seconds of time for a star at declination d to\ncross the width of the field, the field diameter d in arcseconds will be:\nd arc\nt\narc\n(\nsec)\n(sec) cos\n(\n)\nsecsec\n=\n◊\n◊\nd 15\n\n12.409, Spring 2002\nAn approximate method, taking the FOV of the eye to be 40o: Using an eyepiece, your\neye still sees a FOV of 40o but now you know that the telescope magnifies angles by a\nfactor of M, so\nFOV a 40o/M\nA few angular sizes, to help give you a feel of numbers vs. real-life:\nObject\nAngular size\nSun, Moon\n0.5° = 30'\nM57 (Ring Nebula)\n1' = 60\"\nSaturn ring extent\n40\"\nMars, at opposition 1990\n18\"\nMercury, Nov 1987\n6.5\"\n2 Telescope Designs\n2.1 Refractors\nFigure 11: Galileo's refractors\nFigure 12: Kepler's refractors\n...and here we have our friend the refractor from Page 7.\nAdvantages:\nThey're tough--sealed tubes; little or no maintenance\nNo obstruction (as found in Newtonian or Cassegrain reflectors in the next\nsection) in light path to foul up the contrast\nUnsurpassed image quality for Moon, planets, double stars\n\n12.409, Spring 2002\nDisadvantages:\nvery expensive per inch of aperture\n(lenses have to be perfect; larger Æ more difficult to make Æ more expensive)\nbig and heavy\nrequire tall mountings--shaky, expensive (again)\nChromatic aberration (Figure 13): Refracted light splits up into a spectrum, and\nbecause different wavelengths focus at different distances, objects suddenly\nappear to grow red and blue rings around themselves that really don't belong\nthere at all.\nEven though our LX200s are generally referred to as reflectors (as described in an\nupcoming section) the \"corrector plate\" is (as you may have suspected) in fact a lens, as\nare the eyepieces. These elements could in principle cause chromatic aberration, but the\ncorrector doesn't bend light enough to cause any appreciable amount, and the\ncombination of lenses built into a particular eyepiece design are specifically chosen to\nmostly cancel out each other's aberration and thus yield \"good color correction\".\nThe fringe colors you may see around bright objects when observed at very low altitudes\nare due to differential refraction by the atmosphere itself: same physics, different culprit.\nFigure 13: Chromatic aberration\nBig refractors are a pain.\n2.2 Reflectors\nAll large modern instruments are reflectors of some kind. A parabolic mirror will focus\nparallel rays to a single point, as shown in Figure 14.\nFigure 14: Focus of parabolic mirror\n\n12.409, Spring 2002\nAdvantages:\nNo chromatic aberration!\nMost light-collection capability for the money (you don't need perfect glass)\nFewer optical surfaces\nOpen tube less likely to dew up on you\nDisadvantages:\nThe focus is in the incoming light path. This means that whatever you use to\neither collect the light or redirect it and then collect will form a central\nobstruction.\nOpen tube permits image-fuzzing air currents to wander around inside the tube as\nit cools to outside temperature\nOpen-tube telescopes also require more careful treatment and maintenance, what\nwith trying to keep dust (and worse) out and also keep the mirrors aligned.\nAlso... parabolic mirrors work really well for images which are right on the\ncentral optical axis, but off-axis stuff is increasingly distorted into football-shaped\nblobs (i.e. only the very center of the field is undistorted) This effect (\"coma\") is\nparticularly bad with short f-ratios (A spherical mirror would fix this problem,\nbut won't focus all incoming light to a focal point like a paraboloid does).\nFigure 15: Newtonian reflector\nNewtonian reflectors (Figure 15) are ideally suited to short, stable mounts, ,and are of\nsimple construction (many amateurs make their own!)\nFigure 16: Cassegrain reflector\nA Cassegrain reflector (Figure 16) involves a rearrangement of the light path more\nconvenient for larger telescopes. The telescopes one finds at observatories typically are\nCassegrains (including the 16-inch and 24-inch 'scopes at Wallace).\nSo why doesn't the image have a whole in it due to the central obstruction?\n\n12.409, Spring 2002\nFirst, lets think about a slightly different question. What happens to the image of the box\nin Figure 17 as the aperture A gets smaller? Will the size of the image shrink or will a\npart of it be chopped off? No, because each tiny portion of a lens forms a complete\nimage and therefore the final observed image is simply the sum of all of the independent\ncontributions!\nFigure 17*: Aperture experiment\nApplying this to our refractor means that each part of the mirror also creates a complete\nimage. If you were to block another part of the mirror (as shown in Figure 18), we can\nsee that and image is still created but with somewhat less intensity. How much less\nintensity (hint: see handout 4)?\nFigure 18*: Why isn't there a whole in the image?\n2.3 Catadioptric (a combination of refracting and reflecting)\nRecall that parabolic mirrors focus incoming light to a focal point but distort off-axis\nimages into footballs, while spherical mirrors don't have this coma problem but neither\ndo they have one focal point. One answer--use a spherical mirror with a refractive\ncorrector plate of a certain (complex) curvature to correct the focus, thus creating a\nSchmidt-Cassegrain (Figure 17). It's a very popular design for smaller telescopes; this\nis exactly the design of the LX200s we use: \"8-inch (20 cm) f/10 SCT\"\nFigure 19: Schmidt-Cassegrain\n\n12.409, Spring 2002\nAdvantages:\nWider undistorted field of view than a Newtonian\nMore easily portable\nMass-producible (spherical mirrors easy; corrector plate made by virtue of\ncleverness on the part of some telescope genius a few years back)\nTube is sealed\nCompact tube allows motor drive to track sky motion more reliably\nDisadvantages:\nMore optical surfaces than a Newtonian\nLarger central obstruction; some decrease in contrast of images results due to\ndiffraction around the central obstruction.\nNeed a diagonal mirror to observe objects at high altitude; this left/right swaps the\nimage, making life more confusing...\n\n* K. Gleason, Accelerated Introduction to Astronomy, University of Colorado at Boulder, 2001"
    },
    {
      "category": "Resource",
      "title": "handout8_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/43ce23807ea59c934e3908d61a78c16a_handout8_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\nHandout 8 /week of 2002 March 18\n12.409 Hands-On Astronomy, Spring 2002\nCCD User's Guide\nSBIG ST7E CCD camera and Macintosh iBook control computer with\nMeade flip mirror assembly mounted on LX200\nContents\nCCD Kit Checklist ..........................................................................................................1\nItems inside the case....................................................................................................1\nEquipment Setup Procedure.............................................................................................2\nFocusing..........................................................................................................................4\nFocus Procedure ..........................................................................................................4\nObserving Information ....................................................................................................6\nTarget Acquisition.......................................................................................................6\nImaging.......................................................................................................................6\nFeeding Your Observing Notebook .............................................................................8\nCalibration Frames ..........................................................................................................8\nWhat for? ....................................................................................................................8\nHow many? .................................................................................................................8\nWhat kind?..................................................................................................................8\nDark frames:............................................................................................................8\nZero-biases..............................................................................................................9\nFlat field frames.......................................................................................................9\nPacking Up......................................................................................................................9\nCCD Kit Checklist\nUse the following checklists to\n1. Alert the instructor or TA about missing pieces before beginning a night's\nobserving and\n2. Ensure that the kit is complete for use by your classmates next time.\nItems inside the case\n1. SBIG ST7E CCD camera\n2. Camera power supply (large one with cords out either end)\n3. Parallel-to-SCSI converter box (small black box)\n4. Converter box power supply (small one)\n5. Parallel cable (long tan one)\n6. SCSI cable (short gray one)\n7. SCSI-to-USB adapter/cable (short white one)\n8. Meade flip mirror\n\nEquipment Setup Procedure\n1. Setup and align the telescope.\n2. Attach flip mirror to visual back (do not attach camera yet)\n3. Connect camera to SCSI box with parallel cable (long tan one)\n4. Plug power cord into camera (but do not plug the other end to power yet)\n5. Attach camera to telescope (do not attach the camera to the telescope before all\ncords have been plugged into the camera or you risk ruining your telescope\nalignment).\n6. Mount and adjust counterweights on telescope\n7. Connect SCSI box to USB adapter cable (short white one) with SCSI cable (short\ngray one)\n8. Plug in and power SCSI box\n9. Plug in camera power cord to power (this powers the camera, there is no switch)\n10. Check that computer is on, not sleeping, and plugged in (DO NOT ATTEMPT TO\nCONTROL CAMERA WITH COMPUTER USING BATTERY POWER)\n11. Connect USB cable to computer\n12. Start CCDOps software (double click CCDOps icon on computer desktop). You\nshould see a window similar to that below: If you get an error message that requires\nyou to restart your computer, do so and then drag the CCDOps preference file from\nthe preferences folder inside the System folder to the trash and restart CCDOps.\nIf you see Not found next to Link: in the lower left corner of the above window, check the\nfollowing:\nUnder the Misc menu, select Graphics/Comm Setup...\nThe following window will be displayed\n\nCheck that SCSI is the selected Port (it is the third symbol) and click OK\nNow under the Camera menu, select Establish COM Link\n13. Under the Camera menu, select Setup... The following window will pop up:\nSet the Temperature regulation to Active. The Setpoint should be about 30C below\nambient. Set Reuse dark frames to Yes. After you gain some experience with CCD\nimaging and what calibration frames you will need for a nights worth of imaging you will\nwant to turn this option off.\nA word about which resolution mode to run in. In High resolution mode the camera is\nconfigured for the smallest pixels and the highest resolution. In Low resolution mode,\npixels are binned together in 3x3 boxes to produce the largest effective pixels and thus\n\nthe lowest resolution. This is results in smaller data files and thus faster download times\nfrom the camera to the computer.\nResolution\nBinning\nApprox. Saturation Level\nHigh\nNone\n40,000\nMedium\n2x2\n65,000\nLow\n3x3\n65,000\nOnce you press okay the camera will begin to cool and you should see the temperature\nbegin to drop. It will stabilize in a short time, you should see the % next to the\ntemperature value drop below 100%. You want to let the temperature stabilize before you\nfocus or take data. If the percentage does not drop below 100% in 10 minutes, you should\nraise your set point. Monitor the percentage throughout the night, you can make it lower\nas the ambient temperature drops to reduce thermal noise.\nFocusing\nIn order to obtain the best possible data from your image, you must pay some attention to\ngetting the best focus possible. Unlike focusing when viewing through an eyepiece, when\nyou focus the CCD camera you can't directly observe the image to determine its quality.\nThus it may take a little practice to get the knack of dealing with the display because of\nthe time lag between making a focus adjustment and being able to see its effect on the\ndisplay screen. You can reduce this delay by choosing a focus star that is bright enough\nto be well exposed with only a short (~0.1 sec) integration time and also by only\ndigitizing the small part of the image that contains the star.\nFocus Procedure\n1. Select a relatively bright star (+2.5 to +3.5) that is well above the horizon (that way\nyou are looking through less atmosphere, less seeing or scintillation problems closer\nto the zenith). You want something that is bright enough to focus with in a short\ntime, but dim enough not to saturate the detector (see approximate saturation counts\nin table on previous page).\n2. With the flip-mirror in the \"visual\" position, acquire the star in center of the FOV and\ndo a preliminary focus by eye in the acquisition eyepiece. The focus of the CCD will\nbe quite a bit different from this focus so this does not need to be done carefully...its\njust to get you in the right ballpark.\n3. Now, flip the mirror so that the light goes to the CCD rather than your eye. Under the\nCamera menu, select Focus... to bring up the focus control window (example shown\nbelow). The exposure time is measured in seconds. Change the exposure time to\nsomething short, like 0.1. There are three options under frame size, Full, Planet, or\nDim Choose Full to begin with so you get the entire image and can figure out where\nyour star is located. Choose Manual for the Update Mode. This allows you to tell it\nwhen to take and exposure manually. Automatic will simply keep taking exposure\nafter exposure until you tell it to stop. Click ok -- the computer will tell you the image\nis being taken and then displayed.\n\n4. The focus mode displays the image as well as the peak value in brightness of the\nbrightest object in the FOV. Make sure the star is in the FOV and check for\nsaturation and adjust exposure time or find another dimmer if necessary. Make sure\nto record the exposure time in your notebook!\n5. After you get your first image, you can significantly shorten your download time by\nusing Planet mode. It will take a full size image and then ask you to move a box (in\nboth placement and size) to the part of the image you want to download. Click on the\nbox and move it to where your star is located. Then press Resume. Again it will take a\nimage, but this time only of the small area you have selected.\n6. Now the general idea is to adjust the focus knob on the telescope, take an image,\ninspect it and iterate on this until you achieve the best focus possible. It is best to\nstart with fairly rough adjustments in one direction (say 1/2 turns of the focus knob).\nIf the focus gets worse, then go in the other direction. Go past a good focus and then\ncome back. A sufficiently out-of-focus image will appear as a \"doughnut\" shape\nowing to the secondary mirror obstruction of this Schmidt-Cassegrain design of\ntelescope. Adjust the focus knob so as to maximize the peak brightness value\n(without saturation) and minimize the size of the star image. If saturation occurs you\nwill need to choose a dimmer star if you can't decrease the exposure time enough\nprevent saturation. The peak brightness value can vary by 30% or so due to seeing\nvariations so when you are getting close to good focus you should take several images\nbefore deciding whether you need to adjust further.\n7. When you get close to good focus, it may help to use the Automatic Update Mode so\nthat the system will continually take images until you tell it to stop.\n8. Once you are happy with the focus in the CCD camera, adjust the position of the\neyepiece in its seat in the flip-mirror. To do this, first flip the mirror back to the\n\n\"visual postion\". Then loosen the set screw for the eyepiece and slide the eyepiece in\nand out of the flip mirror seat until what you see in the eyepiece looks focused. Do\nnot adjust the focus knob after you have set it for the CCD.\nObserving Information\nTarget Acquisition\nNow you are ready to acquire your target and take some data! Remember that the view\nthrough the eyepiece is left-right reversed, because the flip mirror has an internal\ndiagonal mirror. Sometimes it may be helpful to use the Dim Focus Mode until you have\nfound and centered your target in the CCD FOV. This is a full chip 3x3 binned mode\nwhich allows fast downloads making the setup go a bit faster.\nImaging\n1. Once you have acquired your target, dismiss the focus window. Under the Camera\nmenu, select the Grab... command for taking individual images. The window below will\npop up. Set your exposure time and choose your image size, full, half, or quarter of the\nCCD array. When you first start imaging, you can choose Also for Dark frame. This will\ntake a dark frame each time you take an image and subtract it before displaying it. As\nyou get more experienced, it will become more efficient to take your dark frames at the\nbeginning or end of your imaging session (see the Calibration section below for more\ninfo).\n2. Under the Edit menu, you can select Show icon bar to provide shortcuts to some\ncommon commands:\n\nYou may find this useful.\n3. Saving an Image:\nUse the File/Save As command, rather than Save. This is a safeguard so you don't\noverwrite an image. Use the compressed or uncompressed file format (if you choose\nanother format CCDOps will not be able to open this file).\nCreate a folder in the data files directory on the machine with your name. Inside this\nfolder, create a folder with the date. Inside this you can save your images. Make sure you\nchoose a useful name for each image and create a paper log file with the pertinent\ninformation about the image.\nExample directory path:\nData Files:AndyR:20020110:\nFor example an image name might be:\ndate.imagenumber.sb(YYMMDD.XXX.sb) or some other descriptive title like:\nSaturn1.sb (the sb stands for SBIG image format which is the only format the CCDOps\ncan read)\n\n4. Additional things to be aware of:\nWhile observing, keep an eye on the size of your stellar images. If they seem to\nhave gotten blobbier over time, then either the focus has changed, the seeing has\ndeteriorated, or both.\nTry to keep your target away from the edge of the array.\nAs you work through your observing program, be aware of and check frequently\nfor possible over-exposure.\nBe very careful to check what you have entered for your exposure time. At this\npoint, we don't know the outcome of aborting an integration process. If you want\nto start a 60-sec exposure and accidentally type in 600-sec you may have to wait a\nbit for the longer exposure to finish. Whenever you enter a new exposure time,\ndouble-check for typos before hitting ok or <return>!\nCheck the position of the flip mirror, especially before taking a long exposure. If\nyou can see through the eyepiece, the flip mirror is not lined up with the CCD.\nFeeding Your Observing Notebook\nJust as you did for visual observing, you need to take sufficient notes for each image as\nwell as record general information about the conditions.\nFor each data image record the following: Number in image sequence, time, object, and\nexposure time\nFor darks: exposure time is sufficient\nCalibration Frames\nWhat for?\nTaking calibration images and applying them to your data images reduces the amount of\nnoise in your final product and allows you to see more detail.\nHow many?\nIn order to reduce the random noise in your calibration images, it is necessary to take\nmultiple calibration images and average them. In general averaging n images will reduce\nthe random noise in the product by a factor of\nn . It is a good idea to get in the habit of\ntaking n+1 images so that you have an extra and can afford to throw one out if you find a\ncosmic ray hit. A cosmic ray completely fills the wells of any pixel it hits as it passes\nthrough the detector. If the signal from any contaminated pixels gets into your\ncalibration image then the resulting image artifacts will be passed onto every data image\nyou process with this calibration image.\nWe recommend that you expose and save at least 5 of each type of calibration frame you\nneed.\nWhat kind?\nThere are three basic type of calibration frames: darks, zero-biases, and flats. For 12.409\npurposes you will only need to take and apply dark frames.\nDark frames:\nA dark frame is simply an image taken at the same temperature and for the same duration\nas the light frame with the source of light to the CCD blocked. This dark frame will\ncontain an image of the noise caused by dark current (thermal noise) and other fixed\n\npattern noise such as read out noise. When the dark frame is subtracted from the light\nframe, this pattern noise is removed from the resulting image.\nAlways take dark frames of equal exposure length to your data images. A set of 3-5 dark\nframes per exposure time per session (for all data taken at the same chip temperature is\nrecommended.\nZero-biases\nA zero-second exposure with the shutter closed that records readout noise. This is\nincluded in the dark frames. It is mentioned separately because advanced imagers\nsometimes use them in combination with a scaled master dark frame to reduce the\namount of time spend taking dark frames. This type of calibration is not recommended.\nFlat field frames\nA flat frame is a regular exposure of uniformly illuminated featureless surface such as a\nwhite projection screen or a blank patch of twilight sky through the same optics as your\ndata images. The purpose is to record pixel to pixel variations in the detector sensitivity\ncaused by intrinsic variability in the detector as well as dust or other obstructions or\naberrations in the optical path. They are used to get the maximum possible accuracy\nfrom photometry (measuring magnitudes). It is time consuming to get good ones and bad\nones can actually make your images and photometry worse. This type of calibration will\nalso not be used in 12.409\nPacking Up\nWhen you are finished for the evening:\n1. Quit CCDOps (if it asks you to deactivate the temperature control, say yes)\n2. Unplug USB cable from computer\n3. Unplug camera from power (do not remove any cables from the camera just yet)\n4. Power off the SCSI converter box\n5. Remove the camera from the flip mirror\n6. Remove flip mirror and counterweights from telescope\n7. Unplug all remaining cables\n8. Carefully store all equipment in the case the way you found it\nUse the kit checklist to make sure you still have everything you started with (check\naround the ground nearby, your pockets, and nearby telescope kits if necessary) and that\nyou haven't inherited extra parts from someone else's kit."
    },
    {
      "category": "Resource",
      "title": "handout9_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/179a97ffd8e05ecae5b59476da7cedb3_handout9_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\nHandout 9 /week of 2002 April 1\n12.409 Hands-On Astronomy, Spring 2002\nBasic CCD Image Processing\nWhat exactly is a CCD?...................................................................................................1\nContributions to signal ....................................................................................................1\nColor Tables and S t r e t c h e s.........................................................................2\nSaving your work ............................................................................................................2\nSome specifics.................................................................................................................3\nCrosshairs .......................................................................................................................3\nCoadds ............................................................................................................................3\nDark Subtraction .............................................................................................................4\nOther commands .............................................................................................................4\nWhat exactly is a CCD?\nWe're glad you asked. To make a connection that doubtless many of you have already\nmade, the CCD is basically a digital camera. In fact, the digital cameras you can buy in\nthe mall have CCDs as their detectors. Astronomical CCDs are designed to be more\nsensitive to low light levels but the idea is the same: the chip is divided into pixels and\nlight falling onto each pixel is converted into an electronic signal. This signal is typically\nexpressed in \"counts\". The resulting image is output in one of a few typical formats and\ncan be manipulated by any number of image processing programs.\nContributions to signal\nThe number of counts recorded will come from a number of sources. Ideally, the target\nobject will contribute the majority of the signal, and is of course the signal we're most\ninterested in. The sky will unavoidably contribute signal, depending upon the light\npollution conditions and proximity to (and phase of) the Moon among other things. As\nmentioned in Handout 8, signal unrelated to photons is also present in your images: read\nnoise which occurs even in zero-second exposures with no incident light and dark current\nwhich is inherent in the electronics of the instrument, building up with time even with no\nincident light. Differences in sensitivity across a chip leads to flat-field effects.\nAgain, as mentioned in Handout 8 it is important to take calibration frames to help make\nthe most of your images though in this class it won't be necessary to take the kinds of\ncalibration data necessary for astronomical research. We can get away with just dark\nframes for our purposes. The dark frames will be subtracted from the object frames,\nwhich will also take care of the read noise.\nAside: Can you think of a way to take care of the sky counts? Would you still need dark\nframes?\n\nColor Tables and S t r e t c h e s\nOK. Now you've got your image. How best to display it to bring out the details?\nLet's assume we have an image where the peak intensity is 10,000 counts, and we have a\ndisplay where zero counts shows up as black, 10,000 shows up as white. Most image\nprocessing software defaults to a linear mode where 5,000 counts would show up half as\nbright as 10,000 but twice as bright as 2,500. This set of display parameters (black level,\nwhite level, function between them) is informally called the stretch. What if you have a\nvery faint object that only has 1000 counts? Or what if you're looking at Jupiter and\ninterested in the atmospheric features, all of which fall between 7,000 and 8,000 counts?\nAs may be obvious, you can change the stretch. Most commonly, the white or black\nlevels are changed to maximize contrast-in the first example you'd set the white level\nlow, perhaps to only 2,500 or 3,000 counts to make the faint object appear brighter. In\nthe second, you'd set the black level quite high, maybe 5,000 or 6,000 counts. A general\nrule of thumb (which you may have deduced) is to set the black level a bit below the\nfaintest level you want to see and the white level a bit above the brightest level you want\nto see. In some software you can change from a linear to a log (for example) stretch.\nWhat would that do? A square root stretch? An exponential stretch?\nNote! CCDOPS uses a black level and range rather than a black level and a white level. As you\ncan see, the two are exactly equivalent (e.g. use black level of 5,000 and range of 1,000 for the\nJupiter example).\nThere is no hard and fast rule about what levels should be set where, however.\nParticularly in 12.409, the main point is to get images that look good to you! And since\nthe original data doesn't get affected (check to make sure this is true in the program\nyou're using!), you can always keep tweaking!\nThe use of black for faint and white for bright is ultimately an arbitrary one. Many\ndisplay programs will allow you to invert the image , making faint objects white and\nbright ones black. This simulates what you would see in a photo negative, which is the\nimaging medium most astronomers used up until the 1980s. Some astronomical software\nwill allow setting blue through red or yellow, or user-defined color schemes. These are\ncalled color tables (or occasionally lookup tables). For our purposes here, we assume a\nstandard black-to-white color table, but since looking cool is the name of the game, your\nmileage may vary.\nSaving your work\nThere are 3 different file formats that the software we'll be using can handle. One is\n\"SBIG\", which is the native format created by the camera and specific to it. The second\nis the more familiar TIFF format, and the third is FITS format, commonly used in\nastronomical research.\n\nFor these purposes, you should save your work in the SBIG format. That is the only kind\nof data that can be read by CCDOPS (though it can write in others). Saving in\ncompressed format will save a lot of space and has no negative effects, so we suggest you\nsave your work compressed.\nSome specifics\nMuch of the following comes from the CCDOPS manual (Version 4.0) by the Santa\nBarbara Instrument Group. There are copies of the manual around the classroom and in\nPDF format on the computers in the same folder as the CCDOPS application. It's useful\nto get more details of the software and menus.\nTo load an image that you have previously taken, use the Open command. Easy! The\nfirst thing that comes up is a window containing header information: file name, date and\ntime the image was taken, exposure time, etc. Click it to make it go away, and the image\nappears in a new window, with another new window labeled \"Contrast.\" If you need the\nheader information again, click \"Parameters\" in the Display menu.\nThere are a few ways to set the stretch: you can enter values for the background (\"back\")\nand range (\"Range\") and hit return, you can click on the arrows which update in real-time\n(the buttons with two arrows move the numbers twice as quickly), or you can let the\ncomputer decide by clicking Auto. Other things you can do in this window are invert the\nimage so that black represents brighter pixels, smooth the image, and change the\nmagnification of the image. Play with the settings to get a feel for what things do-- there\nshould be a sample image or two available if you haven't taken your own yet.\nCrosshairs\nTo activate a set of crosshairs, pick Show Crosshairs under the Display menu. Now\nwhen you move the crosshairs over the image you get the X and Y value for the point\n(measured from upper left), the value in counts for the pixel the crosshair is directly over,\nthe average value for a box centered under the crosshair (the initial size is 5 x 5 pixels,\nbut that's changeable through a menu at the bottom of the window), and the RMS (root\nmean square) variation of the pixels in the box. We're not going to worry about the other\nentries in the window, though you should at least be able to recognize the words!\nCoadds\nSometimes it is necessary to take relatively short exposures due to sky brightness\nconditions or to keep an object from saturating. If your target is too faint (or the contrast\ntoo low on bright objects) to show up well in short exposures, the typical approach is to\ntake several exposures and coadd them. In order to coadd images, use the crosshairs tool\nto determine their relative offsets (and write them down-- the computer doesn't keep this\ninformation) and then use the Co-add command in the Utility menu. You can also use\n\nthis command in order to average a number of frames without registering them (dark\nframes for instance). Unfortunately, you'll have to do the coadding 2 images at a time.\nBetter would be to use Average Images, also in the Utility menu, which lets you average\nmany objects at once.\nDark Subtraction\nIf you are going to take a large number of frames with the same exposure times, it is best\nto turn off auto dark subtraction and do it post facto. Auto-subtracting images will take\nover twice as long as doing it manually. Take a dark frame of the relevant exposure time\nfirst, then after your object frames have been taken use the Dark Subtract command\nunder the Utility menu.\nOther commands\nThe Utility menu has a number of other commands of greater-or-lesser importance for\n12.409. Smooth has the effect of replacing every pixel with a weighted sum of itself and\nits neighboring pixels. Sharpen could also be used to, well, sharpen the image. Both of\nthese functions can be done with varying strengths. Neither one would be used in\nresearch-quality data, but since we don't have that problem here, feel free to mess with\nthem to see what they do! The same goes for the other commands in the Utility menu.\nJust make sure you know what you're saving when you save it, and keep backup copies of\nimages!"
    },
    {
      "category": "Resource",
      "title": "handout10_sp2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-409-hands-on-astronomy-observing-stars-and-planets-spring-2002/296e5db9428fa247cfea9cf55242a07a_handout10_sp2002.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Earth, Atmospheric, and Planetary Sciences\nHandout 10 /week of 2002 April 1\n12.409 Hands-On Astronomy, Spring 2002\nThe LX200 Object Library\nWhat's in the Library?.....................................................................................................1\nHow to Use it ..................................................................................................................1\nSetting the Zenith Limit (strongly recommended)............................................................2\nUsing the Hi-Precision Pointing Option...........................................................................2\nGOTO for Objects not in the Library...............................................................................3\nMatching Coordinates (compensating for inaccurate alignment)......................................3\nWhat's in the Library?\nThe LX200 has a library with 64,359 objects in it. These are separated into eight\ndatabases (shown below) accessible through three keys on the keypad (M, STAR, and\nCNGC located on the right side of the keypad).\n110 Messier objects\n351 alignment stars: this list contains the 250 brightest stars, 100 doubles, and\nSigma Octantis (the southern pole star).\n15,928 SAO (Smithsonian Astrophysical Observatory) catalog stars including all\nstars brighter than 7th magnitude.\n21,815 GCVS (General Catalog of Variable Stars): complete catalog.\n8 planets\n7,840 NGC (New General Catalog) objects including galaxies, diffuse and\nplanetary nebula, and globular and open clusters: complete catalog\n12,921 UGC (Uppsala General Catalog) galaxies as faint as 15th magnitude:\ncomplete catalog.\n5,386 IC (Index Catalog) Objects: complete catalog.\nA complete listing of the 351 alignment stars, and the Messier objects along with a partial\nlisting of NGC objects can be found in the atlas supplements.\nHow to Use it\nIn order to use the object library, the telescope must first be aligned using the two-star\nalignment procedure discussed in handout 3. The more carefully you level your telescope\nand center your alignment stars the more accurate will be the pointing of the telescope.\nOne can directly access the library using the M, STAR, and CNGC keys along with the\nspecific catalog number of the desired object. The Messier catalog is accessed by\npressing the M key and then the appropriate M number for the desired object. The SAO\n\nstars, the 250 brightest stars, interesting double stars, the GCVS, and the planets are all\naccessed with the STAR key. The NGC, IC, and UGC are all accessed with with the\nCNGC key. When either the STAR or CNGC key pressed, the display will show which\nof the above databases is currently active. The LX200 will remember the last database\nused.\n1. Press M, STAR, or CNGC\n2. If necessary, change the database by pressing enter without entering a number\n3. Enter a the desired object catalog number and press ENTER\n4. To move the telescope press GOTO\nSetting the Zenith Limit (strongly recommended)\nTo avoid hitting the base of the telescope with the CCD when performing a GOTO\noption, one can set a limit on how close the telescope can slew towards the zenith.\n1. select PARAMETERS from the OBJECT LIBRARY menu\n2. select LOWER from the PARAMETERS menu\n3. enter the limit in degrees from the zenith (start with 10°) and press ENTER\nUsing the Hi-Precision Pointing Option\nWith the hi-precision setting activated, and an accurate alignment, the LX200 is capable\nof a pointing accuracy of 1 arc minute (for comparison, the 6.4 mm eyepiece has a FOV\nof about 10 arc minutes and the CCD has one of about 8x11 arc minutes). Technically, in\norder to use the hi-precision pointing option it is helpful to use an illuminated reticle\neyepiece. But you can also use the CCD or equivalently a 6.4 mm eyepiece.\nIt is not at all necessary that you use this option. In fact, we suggest that you leave if off\nmost of the time. It may come in handy if you are trying to find a very dim object that\nyou can't see in the eyepiece but intend to take a long exposure to capture it. This could\nbe very a frustrating experience if you are not sure it is in the CCD FOV. Turning on this\noption will not guarantee that you will avoid this frustration but with an accurate\nalignment, it may make it less likely.\nTo activate Hi-Precision pointing do the following:\n1. Select TELESCOPE from the TELESCOPE/OBJECT LIBRARY menu\n2. Scroll and select hi-precision (option #9) by pressing ENTER.\n3. When selected HI-PRECISION will change to upper case letters.\nWhen HP is active, the LX200 will perform a GOTO slightly differently. The LX200\nwill find and slew to the nearest alignment star and prompt you to center the star (on the\nCCD or using a reticle eyepiece) and then press GOTO.\n\nGOTO for Objects not in the Library\nIf you would like to point to an object that is not in the library such as a comet or an\nasteroid, you will need accurate coordinates. Remember that solar system objects move\ndaily through the sky so you need to find coordinates for them either using an ephemeris\nor Voyager (for the brighter asteroids). It is best to find them for a time that is within an\nhour of when you want to observe it. In the following procedure you input the\ncoordinates to which you would like the telescope to point.\n1. Press and depress MODE until coordinates in RA and DEC are displayed (these are\nthe coordinates where the telescope is currently pointing).\n2. Press the GOTO button (next to MODE, upper right corner of keypad).\n3. After a double beep, enter the new RA and press ENTER\n4. Enter the new DEC and press ENTER (if you need to enter a minus DEC setting,\nmove the blinking cursor over the + sign using the W key and then press NEXT to\nchange + to -, PREV will change - to +).\nThe telescope will now slew to your desired coordinates. If your object is not\nthere...check your coordinates!\nMatching Coordinates (compensating for inaccurate\nalignment)\nIf, after executing a GOTO operation, you find that your desired object is not well\ncentered in the eyepiece (possibly due to poor leveling or centering of the alignment\nstars), you can fudge a bit to compensate for this without having to redo the whole\nalignment procedure (but just in an area of sky near where the telescope is currently\npointing). The following procedure will allow the next GOTO execution to be better\ncentered provided that it is not too far away from the object you used to match\ncoordinates.\n1. Center the object in the eyepiece\n2. Press and hold ENTER until the display reads \"Coordinates Matched\""
    }
  ]
}