{
  "course_name": "Harmony and Counterpoint II",
  "course_description": "In this subject, we explore the harmonic, melodic, and formal practices of western music, principally the so-called “Classical” idiom of central Europe, ca. 1750-1825. Topics include a quick review of material covered in 21M.301, chromatic harmony (viio7, bII6, and chords of the augmented sixth), and chromatic modulation; lecture study and discussion are complemented by work in the keyboard laboratory and sight-singing laboratory. All areas of study will be integrated in a semester-long project of composing a theme and two variations in Classical style.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music History",
    "Music Performance",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music History",
    "Music Performance",
    "Music Theory"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSight-Singing Laboratory: 1 session / week, 1 hour / session\n\nKeyboard Laboratory: 1 session / week, 1 hour / session\n\nCourse Description\n\nIn this subject, we explore the harmonic, melodic, and formal practices of western music, principally the so-called \"Classical\" idiom of central Europe, ca. 1750-1825. Topics include a quick review of material covered in\n21M.301\n, chromatic harmony (vii\no7\n, bII\n, and chords of the augmented sixth), and chromatic modulation; lecture study and discussion are complemented by work in the keyboard laboratory and sight-singing laboratory. All areas of study will be integrated in a semester-long project of composing a theme and two variations in Classical style.\n\nSubject Components\n\nRequired Sight-Singing Laboratory\n\nVocal models underlie virtually\nall\nthe contrapuntal bases of our classical music (yes, even in purely instrumental idioms); hence, practice in singing classical music is one of the most efficient ways for you to internalize the classical norms of voice-leading.\n\nThe lab meets each once a week for one hour. Please be sure to bring the following materials to the first lab meeting: the required texts: Various Composers.\nFive centuries of choral music for mixed voices\n. Vol. 1. New York, NY: G. Schirmer, 1963.: Ottman, Robert.\nMusic for sight-singing.\n6th ed. Upper Saddle River, NJ: Prentice Hall, 2003. ISBN: 9780131456709., music paper, a pencil, and a tuning fork.\n\nRequired Keyboard Laboratory\n\nEven in our modern age of computer-assisted sound manipulation, the traditional musical keyboard still provides the most efficient way for an individual to perform or improvise contrapuntal polyphony in real time, and thus receive instantaneous aural feedback.\n\nKeyboard lab consists of a weekly session with a private piano instructor, doing keyboard exercises based on this subject but tailored to your individual skills. You are requested to work in the lab for one hour each week, during which the instructor will work with you individually for about 15 minutes.\n\nDaily Homework Assignments\n\nExpect to complete one assignment for each class meeting. Each late assignment is penalized one letter grade for each calendar day it is late; no assignment will be accepted more than three days late. If you must miss a class meeting, leave your work in the bin by my office door by 2:00p the day it is due, or have a friend leave it there.\n\nQuizzes\n\nNearly every week, I will give a timed quiz (typically of five minutes' duration). These quizzes will measure your mastery of the most basic vocabulary (triads and seventh chords) as well as some of the more important syntactic concepts of harmony and voice-leading.\n\nAnalytic Reports\n\nYou will present two or three brief oral reports to the class, lasting about 10 minutes apiece, in which you summarize the important features of a Classical variation in relation to its theme. In particular, you will seek to abstract useful procedures for transforming a simple theme into a figurated variation, so that you can share them with the class for everyone's benefit. On the day that you report, you must submit to me by noon a copy of your handout so that I can make copies for the class. (If you miss this deadline, then you are responsible to make multiple copies for the class.)\n\nTests\n\nTwo class sessions are reserved for midterm tests: one on voice-leading and diatonic harmony (i.e., material covered in 21M.301), and one on elementary chromatic harmony (vii\no7\n, bII\n, and chords of the augmented sixth) and modulation. Each test will last one hour.\n\nFinal Project\n\nOver the course of the semester, you will write an original theme and variations (at least four, but no more than six) in Classical style, most likely for piano (but possibly for a small instrumental group).\n\nWeighting of the Components of Your Semester Grade\n\nACTIVITIES\n\nPERCENTAGES\n\nLecture Preparation and Participation\n\n10%\n\nSight-Singing Lab\n\n10%\n\nPiano Lab\n\n10%\n\nDaily Homework Assignments\n\n15%\n\nWeekly Quizzes\n\n10%\n\nAnalytic Reports\n\n10%\n\nTest 1 (Voice-Leading and Diatonic Harmony - Lecture 8)\n\n10%\n\nTest 2 (Elementary Chromatic Harmony - Lecture 16)\n\n10%\n\nFinal Project (Theme and Variations)\n\n(Drafts = 5%; Final Set = 10%)\n\n15%\n\nFailure to complete any one of these components will result in failure as your semester grade. The labs are graded by their respective instructors; I will grade all other components.\n\nMusic Manuscript Paper\n\nEuropean classical music notation is a (comparatively) efficient graphic medium for conveying musical information. Unfortunately, many manufacturers don't know (or don't care) about the principles of proper graphic organization, so that there is much\nsoi-disant\nmusic paper on which it's virtually impossible to produce proper, legible notation.\n\nThere are four\nabsolute\nrequirements for the music manuscript paper you use.\n\nEach page must be no smaller than letter-size, and no larger than 9\"x12\".\n\nAnything smaller is probably intended for the simple jottings of small children; anything larger is probably intended for professionals writing for large ensembles.\n\nEach page must contain at least ten staves, and no more than 16 (12 is usual).\n\nAt this paper size, nine or fewer staves would be excessively large and/or excessively far apart. The larger the staff, the more effort is required to produce appropriately round noteheads, thick beams, straight barlines, etc.\n\nThe space\nbetween\nstaves must be greater than the width of a single staff.\n\nWith less than a staff's width between staves, there's not enough room for notes that require ledger lines, flags and beams when multiple voices share a staff, or analytic symbols below the bass.\n\nIn each staff, the lines must be of\nhairline\nthickness.\n\nIdeally, the staves are printed in gray or brown ink, for further contrast between the hairlines of the staff and the slightly thicker lines of stems, barlines, etc.\n\nAt this writing, the bookstore sells two products that are acceptable\n\nRoaring Spring Paper Products, 12-stave music refills\n\nRoaring Spring Paper Products, 12-stave music book\n\nMusic paper may be purchased online from various vendors.\n\nYes, obtaining such paper requires some extra initial effort on your part, but it will make your life (and, more critically, my life) easier over the course of the semester. Properly proportioned staves will make it easier for you to produce legible notation, and heavier paper will better sustain repeated erasure.\n\nWhat About Free Music Paper on the Web?\n\nDon't go there. Some people have made files freely available for printing your own paper. So far, I haven't seen\nany\nacceptable music paper available in this way. It typically fails to meet requirement no. 4 above (staff lines of\nhairline\nthickness), so music written on it falls short of ideal legibility. This problem is compounded if the paper is printed by inkjet. Laserprinting achieves better hairlines, but the toner doesn't hold up under repeated erasure; this is also true of photocopied manuscript paper.\n\nOK...now that you've obtained proper music paper.\n\nThere are\ntwo\nabsolute requirements for your use of the paper.\n\nAlways\nleave a blank staff between notated staff systems.\n\nIf you use every staff on the page, the marks below each bass staff (including Roman numerals and bass figures) will collide with the marks above the treble staff of the next system. For the sake of legibility, you\nmust\nleave at least one blank staff between systems. (If the staves are small and the bass staff includes many low notes, phrase or pedal markings, it may be desirable to leave\ntwo\nblank staves between systems.)\n\nAlways\nuse only\none\nside of the paper.\n\nIf you write on both sides of the paper, it will be inconvenient to compare parallel passages on opposite sides of the same leaf, and it will be that much more difficult for you to spot errors in the move from the end of one page to the beginning of the next.\n\nMusic Notation Software\n\nMusic notation software (e.g.,\nSibelius\n,\nFinale\n,\nGNU LilyPond\n) is typically capable of producing professional-quality output. The problem, though, is that such software often doesn't produce proper output by default. If you use notation software, you are responsible to learn how to edit your files to produce proper output. I\nwill\ndeduct points for improper notation, and I will\nnot\naccept \"But this is what the software does!\" as an excuse. (When in doubt, consult classical scores from publishers such as Breitkopf & Hartel, G. Henle, C.F. Peters, G. Schirmer, Schott, Universal).",
  "files": [
    {
      "category": "Resource",
      "title": "errorstable_simp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/f5b9244de6c7ecc888a5f306ab319c4f_errorstable_simp.pdf",
      "content": "21M.301--Common errors in student work\n\nTable of Abbreviations\n\nabbrev.\ntransgressions\npenalty\nAldwell & Schachter\n(2nd or 3rd ed.)\n= chord construction\n\ncc\ndoubled leading tone,\nimproper use of a second-inversion triad,\ninclusion of tones not specified by the bass figures,\nomission of tones (or alterations) specified by the bass figures,\nfailing to form the leading tone as specified by figures,\nomission of the root or third (major or minor triad),\nomission of the root, third, or fifth (diminished triad)\n\n-5\n-5\n-2 / note\n-2 / note\n-5\n-5\n-5\nCh. 6, 25\nCh. 10, 19\nsee index, \"figured bass\"\nsee index, \"figured bass\"\nCh. 1\nCh. 5\nCh. 5\n= harmonic syntax\n\nhs\ninappropriate cadence,\nharmonic retrogression,\nneglecting to form the leading tone in a minor key\n\n-3 to -5\n-3 to -5\n-5\nsee index, \"cadence\"\nCh. 9, 11\nCh. 1\n= melodic writing\n\nmw\naugmented melodic interval,\ndiminished melodic interval,\nimproper resolution of a leading tone,\nimproper resolution of a seventh,\nlarge leap requiring a change of direction\n(both before and after),\nnon-triadic tone approached and departed by leap\n\n-5\n-3\n-5\n-5\n-5\n\n-5\nCh. 5\nCh. 5\nCh. 6, 7\nCh. 6, 12, 23, 24\nCh. 5\n\nCh. 20\n= approach to a perfect consonance\n\npc\nsimultaneous large leaps to a perfect consonance,\nsuccessive perfect fifths (or their octave expansions)\ncreated by motion in the same pair of voices,\nsuccessive octaves (or their octave expansions)\ncreated by motion in the same pair of voices\n\n-3 to -5\n-5\n\n-5\nCh. 5\nCh. 5\n\nCh. 5\n= rhythmic error\n\nre\nharmonic rhythm contradicts the meter,\n\nimproper placement of a cadential six-four,\nincomplete measure,\nmismatch of durations\n\n-3 to -5\n\n-5\n-2 / note\n-2 / note\nsee index, \"rhythm and\nchord progression\"\nCh. 10\nCh. 3\nCh. 3\n= handling of vertical relationships\n\nvr\nmore than an octave between adjacent upper voices,\noverlapping of parts,\nvoice crossing\n\n-3 to -5\n-3 to -5\n-3 to -5\nCh. 5\nCh. 5\nCh. 5"
    },
    {
      "category": "Assignment",
      "title": "assignmentno1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/a5e0839c9ed72d619696965bb382c3ea_assignmentno1.pdf",
      "content": "21M.302--Prof. Robison\nName _____________________________\nAssignment no. 1\n1. a) Identify the key, and label the harmonies with\nthe appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining\na four-part VOCAL texture.\n2) Do likewise, but this time\nmaintaining a four-part\nKEYBOARD texture\n(SAT in r.h., with no more than\nan octave between S and T).\nDo not alter the given bass line in any way. Do not add any non-triadic tones or figuration other than what the figures specify.\n\n8--------7\n6---5\n6-----5---\n4---#\n4-----3---\n3. a) Harmonize the melody, maintaining a four-part VOCAL texture.\nb) Identify the key, and label the harmonies with the appropriate Roman numerals and bass figures.\nc) At the end of each phrase, label the cadence.\nDo not alter the melody in any way. Do not let the inner voices cross above the given soprano.\n\n\"Bachgen ifanc ydwyf\"\n\n4) Do likewise, but this time maintaining a four-part KEYBOARD texture."
    },
    {
      "category": "Assignment",
      "title": "assignmentno2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/87a89cbde3a8e7d3ed80b9b26e6accc5_assignmentno2.pdf",
      "content": "21M.302--Prof. Robison--Assignment no. 2\nName _____________________________________\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture with only the soprano\nin the r.h. (i.e., with all three lower voices in the l.h., and no more than an octave between A and B)\nd) Between the staves, identify the intervals between the outer voices.\n\n¿\n6----5\n8----7\n4----#\n6----5\n4----#\n2) Do likewise, but this time maintaining a four-part VOCAL texture (SA on treble staff, TB on bass).\n\n6---5\n8-------7\n4---3\n6---5----\n4---3----"
    },
    {
      "category": "Assignment",
      "title": "assignmentno3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/6a6dc3336ed384e9cde4c8c38acfa386_assignmentno3.pdf",
      "content": "21M.302--Prof. Robison\nName _____________________________________\nAssignment no. 3\n1. For each bass line,\na) Identify the key.\nb) Compose a soprano line, observing the rules for strict note-against-note (\"first species\") counterpoint in two parts.\nc) Between the staves, label the vertical interval between the two voices.\n\n2. For each soprano line,\na) Identify the key.\nb) Compose a bass line, observing the rules for strict note-against-note (\"first species\") counterpoint in two parts.\nc) Between the staves, label the vertical interval between the two voices."
    },
    {
      "category": "Assignment",
      "title": "assignmentno4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/5a653be6f75a565149ac393ed5aeb52e_assignmentno4.pdf",
      "content": "21M.302--Prof. Robison--Assignment no. 4\nName _____________________________________\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture with only the soprano\nin the r.h. (i.e., with all three lower voices in the l.h., and no more than an octave between A and B)\nd) Between the staves, identify the intervals between the outer voices.\n\n§4\n[passing chord]\n6-------5\n4-------§\n§\n2) Do likewise, but this time maintaining a four-part VOCAL texture (SA on treble staff, TB on bass).\n\n#4\n8----------7\n6-----5-----\n4-----3-----"
    },
    {
      "category": "Assignment",
      "title": "assignmentno5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/ccf0ab769b09fca53f9943214152a62f_assignmentno5.pdf",
      "content": "21M.302--Harmony and Counterpoint II--Prof. Robison\nName _____________________________________\nAssignment no. 5\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture with only the soprano\nin the r.h. (i.e., with all three lower voices in the l.h., and no more than an octave between A and B)\nd) Between the staves, identify the intervals between the outer voices.\n\n§\n4----#\n2) Do likewise, but this time maintaining a four-part keyboard texture with only the bass in the l.h.\n(i.e., with all three upper voices in the r.h., and no more than an octave between S and T)\n\n#4\n8----7\n6----5\n\n8---------7\n§3\n\n¿\n¿\n6-----5----\n4-----3----\n3) Harmonize the given melody, maintaining a four-part VOCAL texture (SA on treble staff, TB on bass).\n\nAs above, label the harmonies, the cadence(s), and the intervals between the outer voices."
    },
    {
      "category": "Assignment",
      "title": "assignmentno6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/23a9f9988888df7ec2f6f2691bb678e7_assignmentno6.pdf",
      "content": "21M.302--Prof. Robison--Assignment no. 6\nName _____________________________________\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture with only the soprano\nin the r.h. (i.e., with all three lower voices in the l.h., and no more than an octave between A and B).\nAt the cadence, add a fifth voice; to resolve everything in the proper register, the r.h. takes the upper voices at this point.\nd) Between the staves, identify the intervals between the outer voices.\n\n9----------8\n8-------7\n7----------8\n6---5----\n5-----------\n5---4----\n4----------3\n\n2) Do likewise, but with only the bass in the l.h. (i.e., with all three upper voices in the r.h., no more than 8ve between S and T).\n\n¿\n#4\n§3\n#6\n6----5\n4----#"
    },
    {
      "category": "Assignment",
      "title": "assignmentno7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/94d1ff1fa442425b72589ade3d5b873b_assignmentno7.pdf",
      "content": "21M.302--Prof. Robison\nName _____________________________\nAssignment no. 7\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture (ATB in l.h., with no more than an octave between A and B).\n\n¿\n§6\n#4\n§6\n§4\nb6\n6---5\n#4\nb3\n§\n4---§\n2. a) Identify the key of the following melody, and choose an appropriate cadence at the end of each phrase.\nb) Harmonize in a four-part VOCAL texture, using a bII6 (\"Neapolitan\") harmony at the appropriate point.\nc) Label the harmonies with the appropriate Roman numerals and figures.\n\nHELPFUL HINTS\n1. As always, formulate your harmonic rhythm according to the meter (i.e., don't mechanistically change to a new harmony for each melody note).\n2. You may find it useful to end the first phrase in a key other than the tonic."
    },
    {
      "category": "Assignment",
      "title": "assignmentno8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/bace6703d5400a402f54ab72cc26c363_assignmentno8.pdf",
      "content": "21M.302--Prof. Robison\nName _____________________________\nAssignment no. 8\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture (SAT in r.h., with no more than an octave between S and T).\n\n6---5\n¿\n7§\n¿\n#\n--------\n\n¿\n¿\n4---#\n#\n3. a) Identify the key of the following melodic phrase, and choose an appropriate cadence.\nb) Harmonize in a four-part VOCAL texture, using a chord of the augmented sixth at the appropriate point.\nc) Label the harmonies with the appropriate Roman numerals and figures."
    },
    {
      "category": "Assignment",
      "title": "assignmentno9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/57c4279148b06c3afb3bfac212f09e0a_assignmentno9.pdf",
      "content": "21M.302--Prof. Robison--Assignment no. 9\nName _____________________________\n1. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture\n(SAT in r.h., with no more than an octave between S and T).\n\n¿\n8 ----7\n8 ----7\n6 ----5\n6 ----5\n4 ----#\n4 ----#\n2. Transfer your solution above, to create a parallel major-key solution. If you need to revise,\nbe sure to adjust both solutions, so that all scale degrees in all parts correspond, all harmonic\nfunctions (i.e., Roman numerals) correspond, etc.\n\n8 ----7\n8 ----7\n6 ----5\n6 ----5\n4 ----3\n4 ----3\n3. a) Mix 'n' match: Choose either key signature above, and then create a solution that\ninterleaves your two solutions, moving between the parallel modes at least once.\n(Please pay obsessive attention to accidentals, to make sure that\nyou don't mix modes simultaneously, i.e., within the same chord.)\nb) Supply all appropriate Roman numerals and figures (with particular attention to chord qualities).\nc) If you like, feel free to replace one (or both) of the 1st-inv. supertonic triads with a bII6.\nIf you do, please be sure to label it (or them) accordingly.\n\n4. a) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part KEYBOARD texture\n(ATB in l.h., with no more than an octave between A and B).\n\n#4\n6------5\n4------#\n5. Transfer your solution above, to create a parallel major-key solution. If you need to revise,\nbe sure to adjust both solutions, so that all scale degrees in all parts correspond, all harmonic\nfunctions (i.e., Roman numerals) correspond, etc.\n\n6------5\n4------3\n6. a) Mix 'n' match: Choose either key signature above, and then create a solution that\ninterleaves your two solutions, moving between the parallel modes at least once.\nb) Supply all appropriate Roman numerals and figures (with particular attention to chord qualities).\nc) If you like, feel free to replace one (or both) of the inverted V7 chords with a leading-tone\nseventh chord (preserving the given bass note). Likewise, feel free to replace the cadential\npre-dominant with the corresponding chord of the augmented sixth.\nIf you do, please be sure to label the new chord(s) appropriately."
    },
    {
      "category": "Exam",
      "title": "pracquizintetrds.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/82e9a17b8482c513a9d26ba1c769928d_pracquizintetrds.pdf",
      "content": "2. Identify the following intervals, specifying both quality (P, M, m, d, A) and size (2, 3, 4, etc.).\n\n3. Identify the following triads by Roman numeral within C, a, G, e, F, and d.\nUse uppercase and lowercase numerals as dictated by the qualities of the triads.\nIf a triad is foreign to a key, write \"X\"; do NOT write a Roman numeral with alterations.\n\nC:\na:\nG:\ne:\nF:\nd:"
    },
    {
      "category": "Exam",
      "title": "practicequiz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/9cd9429fe745eea0ce614c7eeb543a82_practicequiz.pdf",
      "content": "21M.302--Practice quiz\n\nName ______________________________\n\nThis is a TIMED quiz.\nPlease do NOT unfold\nthis answer sheet\nuntil I give\nthe signal to begin.\n\nScales, intervals, and triads: Keys of C, a, G, e, F, d\n\n1. Requested by scale-degree name;\nspecify by PITCH-CLASS\n(letter, plus \"#\" or \"b\" as needed)\n\nC major\na minor\nG major\ne minor\nF major\nd minor\nleading tone\n\ndominant\n\nsupertonic\n\n2. Identify the following intervals, specifying both quality (P, M, m, d, A) and size (2, 3, 4, etc.).\n\n3. Identify the following triads by Roman numeral within C, a, G, e, F, and d.\nUse uppercase and lowercase numerals as dictated by the qualities of the triads.\nIf a triad is foreign to a key, write \"X\"; do NOT write a Roman numeral with alterations.\n\nC:\na:\nG:\ne:\nF:\nd:"
    },
    {
      "category": "Exam",
      "title": "quiz1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/c08dbba9ce9b5027409ec6795de7e157_quiz1.pdf",
      "content": "21M.302--Quiz no. 1\n\nName ______________________________\n\nThis is a TIMED quiz.\nPlease do NOT unfold\nthis answer sheet\nuntil I give\nthe signal to begin.\n\nScales, intervals, and triads: Keys of C, a, G, e, F, d\n\n1. Requested by scale-degree name;\nspecify by PITCH-CLASS\n(letter, plus \"#\" or \"b\" as needed)\n\nC major\na minor\nG major\ne minor\nF major\nd minor\nsupertonic\n\nsubmediant\n\nleading tone"
    },
    {
      "category": "Resource",
      "title": "test1_music.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/229838fc40237b38f987ca88c4c2b102_test1_music.pdf",
      "content": "II. INTERVAL identification (20 pts.)\nIdentify the following intervals, specifying both quality (P, M, m, d, A) and size (2, 3, 4, etc.).\n\nIII. FIGURED BASS realization (30 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part VOCAL texture\n(SA on treble staff, TB on bass staff; all S and T stems up, all A and B stems down)\nd) Between the staves, identify the intervals between the outer voices.\n\n¿\n6--5\n#4\n4--#\n8--------7\n#\n#\n6----5----\n4----#----\n\nIV. ANALYSIS (25 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Label each tone of figuration with the appropriate abbreviation (CS, arp, P, N, IN, sus, ant, ped).\nWherever possible, feel free to group like figuration under a bracket (as shown in the r.h., mm. 5-8).\narp\narp\n\nmf\np\n\nP\nP\n\nmf\n\nmf\n\np\nf\ncresc."
    },
    {
      "category": "Resource",
      "title": "test1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/4c8d04a55ad65251bfc54393110fea97_test1.pdf",
      "content": "21M.302--Test no. 1\n\nName ____________________________________\n\nThis is a timed test.\nPlease do not unfold your answer sheet\nuntil I give the signal to begin.\n\nEXTRA CREDIT\n\n(up to 5 pts) Describe the normal exception(s) to Part I, item 1.\nBe sure to specify all necessary conditions.\n\n(up to 5 pts) Describe the normal exception(s) to Part I, item 2.\nBe sure to specify all necessary conditions.\n\nI. FILL-IN-THE-_____________ (25 pts.)\n\n(noun)\n\n1. In any dominant harmony (including any applied dominant), the leading tone must resolve\n\n_____________ by _____________ to its _____________.\n\n(direction)\n\n(interval)\n\n(scale degree)\n\n2. In any seventh chord, regardless of its root, quality, or function, the seventh must resolve\n\n_____________ by _____________ .\n\n(direction)\n\n(interval)\n\n3. Any dominant seventh in first inversion must resolve to a _____________ _____________.\n\n(position)\n\n(harmony)\n\n4. Any dominant seventh in third inversion must resolve to a _____________ _____________.\n\n(position)\n\n(harmony)\n\n5. The dominant seventh in second inversion normally occurs as a _____________ chord\n\n(contrapuntal function)\n\nbetween a _______________ _______________ and a _______________ _______________\n\n(position)\n\n(harmony)\n\n(position)\n\n(harmony)\n\n(or vice versa), and thus is functionally equivalent to a _______________ _______________.\n(position)\n\n(harmony)\n\n6. A dissonant _____________ comprises three distinct stages: first, _____________ as\n\n(tone of figuration)\n\n(noun)\n\na chord-tone in the preceding harmony (on a _____________ beat); then, retention of this tone\n\n(adjective)\n\nin the same voice as a dissonance (on a _____________ beat), clashing with the new harmony;\n\n(adjective)\n\nand lastly, resolution _____________ by _____________ to a chord-tone of the new harmony\n\n(direction)\n\n(interval)\n\n(on a _____________ beat).\n\n(adjective)\n\nII. INTERVAL identification (20 pts.)\nIdentify the following intervals, specifying both quality (P, M, m, d, A) and size (2, 3, 4, etc.).\n\nIII. FIGURED BASS realization (30 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part VOCAL texture\n(SA on treble staff, TB on bass staff; all S and T stems up, all A and B stems down)\nd) Between the staves, identify the intervals between the outer voices.\n\n¿\n6--5\n#4\n4--#\n8--------7\n#\n#\n6----5----\n4----#----\n\nIV. ANALYSIS (25 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Label each tone of figuration with the appropriate abbreviation (CS, arp, P, N, IN, sus, ant, ped).\nWherever possible, feel free to group like figuration under a bracket (as shown in the r.h., mm. 5-8).\narp\narp\n\nmf\np\n\nP\nP\n\nmf\n\nmf\n\np\nf\ncresc."
    },
    {
      "category": "Exam",
      "title": "quiz2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/42d3587fd39de7b2e2bd9666436e42f2_quiz2.pdf",
      "content": "21M.302--Quiz no. 2\n\nName ______________________________\n\nThis is a TIMED quiz.\nPlease do NOT unfold\nthis answer sheet\nuntil I give\nthe signal to begin.\n\nScales, intervals, and triads: Keys of D, b, Bb, g\n\n1. Requested by scale-degree name;\nspecify by PITCH-CLASS\n(letter, plus \"#\" or \"b\" as needed)\n\nD major\nb minor\nBb major\ng minor\n\ndominant\n\nleading tone\n\nsubdominant\n\nsubmediant\n\nsupertonic"
    },
    {
      "category": "Resource",
      "title": "test2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/1d26a54512a60b24f5b42466b58a8a73_test2.pdf",
      "content": "21M.302--Test no. 2\n\nName ____________________________________\n\nThis is a timed test.\nPlease do not unfold your answer sheet\nuntil I give the signal to begin.\n\nEXTRA CREDIT (up to 10 pts)\n\nList the chords that most convincingly precede a root-position dominant harmony (in addition to decorating such\na harmony with a cadential six-four). Please include any appropriate applied chords and chords available through\nmode mixture.\n\nI. FILL-IN-THE-_____________ (25 pts.)\n\n(noun)\n\n1. In any major key, the seventh chord built on the leading tone is\n\na _____________________ chord, containing ________ tritone(s).\n\n(quality)\n\n(integer)\n\n2. In any minor key, the seventh chord built on the leading tone is\n\na _____________________ chord, containing ________ tritone(s).\n\n(quality)\n\n(integer)\n\n3. In resolving a leading-tone seventh chord, the tritone(s) normally resolve as follows:\n\neach diminished fifth proceeds by _____________ motion to a _____________,\n\n(adjective)\n\n(interval)\n\nwhile each augmented fourth proceeds by _____________ motion to a _____________.\n\n(adjective)\n\n(interval)\n\n4. In any seventh chord, regardless of its root, quality, or function, the seventh must resolve\n\n_____________ by _____________ .\n\n(direction)\n\n(interval)\n\n5. In the bII6 (or \"_____________________\" chord), the b2 normally proceeds\n\n(meaningless geographical nickname)\n\n_____________ by ________ to the _____________________, while the\n\n(direction)\n\n(interval)\n\n(scale degree)\n\n(b)6 proceeds _____________ by ________ to _____.\n\n(direction)\n\n(interval)\n(scale degree)\n\nIII. FIGURED BASS realization (30 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part VOCAL texture (SA on treble staff, TB on bass staff;\nall S and T stems up, all A and B stems down). Please take care to supply all necessary accidentals!\nd) Between the staves, identify the intervals between the outer voices.\n\n8-----7\n#6\n§6\n# ------------\n\nIV. ANALYSIS (25 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Label each tone of figuration with the appropriate abbreviation (CS, arp, P, N, IN, sus, ant, ped).\nBeethoven: Sonata for violin and piano, op. 30, no. 2, IV\nAllegro\n\n-\n\n-\np\ncresc.\nff\n\ncresc.\n\np\nff\np\n\n-\n\n-\n-\n\n-\n-\n\np\n\np\n\np\ncresc.\nff\n\ncresc.\nff\n\np\n\n-\n-\n\n-"
    },
    {
      "category": "Resource",
      "title": "test2bass.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/b3cc9a7478e820c5a11fd57da80cf372_test2bass.pdf",
      "content": "III. FIGURED BASS realization (30 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of the phrase, label the cadence.\nc) Supply the upper voices, maintaining a four-part VOCAL texture (SA on treble staff, TB on bass staff;\nall S and T stems up, all A and B stems down). Please take care to supply all necessary accidentals!\nd) Between the staves, identify the intervals between the outer voices.\n\n8-----7\n#6\n§6\n# ------------"
    },
    {
      "category": "Resource",
      "title": "test2beeth.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/2d9b8a0d516efe58e0f7ad2e64bbaa3c_test2beeth.pdf",
      "content": "IV. ANALYSIS (25 pts.)\na) Identify the key, and label the harmonies with the appropriate Roman numerals.\nb) At the end of each phrase, label the cadence.\nc) Label each tone of figuration with the appropriate abbreviation (CS, arp, P, N, IN, sus, ant, ped).\nBeethoven: Sonata for violin and piano, op. 30, no. 2, IV\nAllegro\n\n-\n\n-\np\ncresc.\nff\n\ncresc.\n\np\nff\np\n\n-\n\n-\n-\n\n-\n-\n\np\n\np\n\np\ncresc.\nff\n\ncresc.\nff\n\np\n\n-\n-\n\n-"
    },
    {
      "category": "Exam",
      "title": "quiz3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/60057f3dcc8363d59bbdcb23db3ac8dc_quiz3.pdf",
      "content": "21M.302--Quiz no. 3\n\nName ______________________________\n\nThis is a TIMED quiz.\nPlease do NOT unfold\nthis answer sheet\nuntil I give\nthe signal to begin.\n\nScales, intervals, and triads: Keys of A, f#, Eb, c\n\n1. Requested by scale-degree name;\nspecify by PITCH-CLASS\n(letter, plus \"#\" or \"b\" as needed)\n\nA major\nf# minor\nEb major\nc minor\n\nsupertonic\n\nsubdominant\n\ndominant\n\nsubmediant\n\nleading tone\n\n2. Identify the following intervals, specifying both quality (P, M, m, d, A) and size (2, 3, 4, etc.).\n\n3. Identify the following triads by Roman numeral within the keys of A, F#, Eb, and c.\nUse uppercase and lowercase numerals as dictated by the qualities of the triads.\n\nIf a triad is foreign to a key, write \"X\"; do NOT write a Roman numeral with alterations.\n\nA:\nf#:\nEb:\nc:"
    },
    {
      "category": "Resource",
      "title": "dennis_miaw_correct.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/86b9ce2b0571027e5596ef9e82e8231a_dennis_miaw_correct.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "dennis_miaw_uncorre.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/49cf5d49f4d679f8301f581d44c9f0f7_dennis_miaw_uncorre.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "john_lee_correct.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/948a0e824aa09d29b4f9b1aa7e6bd51b_john_lee_correct.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "john_lee_uncorre.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/31bb99dba7df6d89362a82f231bbc0a5_john_lee_uncorre.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "joy_ebertz_correct.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/f6b13f690ee3b7f06764b0e5c7521287_joy_ebertz_correct.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "joy_ebertz_uncorre.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/7dbcad94eb2c7f28c3a686e468e7b5bf_joy_ebertz_uncorre.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "justin_lo_correct.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/5e0d956f914c25e1455fb760d2cb8ec7_justin_lo_correct.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "justin_lo_uncorre.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/1e8784ff5e6a647a741be5353069afff_justin_lo_uncorre.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "laura_burton_correct.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/514fe13194ad31a1d9906fdd2931f705_laura_burton_correct.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "laura_burton_uncorre.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-302-harmony-and-counterpoint-ii-spring-2005/7c3b91aafa60027d13cfeb856ca7549d_laura_burton_uncorre.pdf",
      "content": ""
    }
  ]
}