{
  "course_name": "Histories of Information, Communication, and Computing Technologies",
  "course_description": "The histories of information, communication, and computing technologies have attracted attention from scholars across a variety of disciplines. This course introduces students to prominent voices in these topics across fields. Alongside readings introducing students to this broad scholarly terrain, the course offers guidance in research and writing for publication based on the reality that PhD candidates on the job market need to be published authors, and that every term paper has the potential to be a journal article. We work towards publication by reading widely-cited scholarly histories both for their content and for what they can tell us about scholarly craft.",
  "topics": [
    "Humanities",
    "History",
    "Historical Methods",
    "History of Science and Technology",
    "Social Science",
    "Communication",
    "Humanities",
    "History",
    "Historical Methods",
    "History of Science and Technology",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThe histories of information, communication, and computing technologies have attracted attention from scholars across a variety of disciplines--history of science and technology, communication and media studies, library and information science, education, computer science, sociology, history, business, engineering, geography, anthropology, political science, architecture and planning, art history... the list goes on. This course introduces students to prominent voices across fields. Early weeks of the class are organized around several topics that have brought together researchers across disciplines for discussion and debate, with a focus on histories of information, communication, and computing technologies in the U.S. since the late 19\nth\ncentury. We also devote attention to identifying the conversations that are\nnot\ntaking place across disciplinary divides.\n\nAlongside readings introducing students to this broad scholarly terrain, the course offers guidance in research and writing for publication based on the reality that PhD candidates on the job market need to be published authors - and that every term paper has the potential to be a journal article. We work toward publication guided by the idea that the best way to acquire training in historical research is not to begin by reading \"how to\" sources on historical techniques and methods but rather to read widely-cited scholarly histories in a given area both for their content and for what they can tell us about scholarly craft. Shorter exercises are designed to break down the research and writing process into more manageable tasks. These aim to help students to acquire skills of constructive criticism in group settings which will be useful in their future careers as scholars and teachers - and also will offer feedback on their evolving work. By the third week of the course, students (individually or in small groups) will have selected a topic for research and as the course proceeds will devote increasing time to researching and writing up, ideally with a specific journal in mind. As an introduction to the fields and methods of historical research in this multidisciplinary area, the course requires no previous exposure to the subject; William Kelleher Storey,\nWriting History: A Guide for Students\n(Oxford University Press is recommended (but not required) for those with little background. Students who would like to use the class to continue research on a historical project-in-progress are welcome.\n\nThe overarching goal of this seminar is to teach you, the next generation of academic professionals, to instinctively look beyond disciplinary boundaries in your research - so that you can make use of the diversity of voices on any single subject, work to create a conversation about the histories of information, communication, and computing technologies that spans multiple disciplines, and identify with greater precision the originality of your own scholarly contributions. We will of course only be able to scratch the surface of this rich field in a single quarter, so where possible I will offer suggestions for further reading.\n\nPrerequisites\n\nNone.\n\nCourse Requirements\n\nACTIVITIES\n\nPERCENTAGES\n\nFinal Research Paper\n\n50%\n\nShort Assignments\n\n30%\n\nClass Participation\n\n20%",
  "files": []
}