{
  "course_name": "History and Anthropology of Medicine and Biology",
  "course_description": "This course explores recent historical and anthropological approaches to the study of medicine and biology. Topics might include interaction of disease and society; science, colonialism, and international health; impact of new technologies on medicine and the life sciences; neuroscience and psychiatry; race, biology and medicine. Specific emphasis varies from year to year.",
  "topics": [
    "Humanities",
    "History",
    "History of Science and Technology",
    "Humanities",
    "History",
    "History of Science and Technology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nDescription\n\nThis course explores recent historical and anthropological approaches to the study of life, in both medicine and biology. After grounding our conversation in accounts of natural history and medicine that predate the rise of biology as a discipline, we explore modes of theorizing historical and contemporary bioscience. Drawing on the work of historian William Coleman, we examine the forms, functions, and transformations of biological and medical objects of study. Along the way we treat the history of heredity, molecular biology, race, medicine in the colonies and the metropole, and bioeconomic exchange. We read anthropological literature on old and new forms of biopower, at scales from the molecular to the organismic to the global. The aim of this seminar is to train students to be participants in scholarly debates in the humanities, social sciences, and natural sciences about the nature of life, the body, and biomedicine.\n\nPrerequisites\n\nNone.\n\nRequirements\n\nThis is a seminar. Students are required to give at least one seminar presentation, offering a critical evaluation of positions represented in the readings for their chosen day. There are two writing assignments: a short paper (5 pages) on course readings up through session 6, and a 15-20 page paper that can be either (A) a research paper using course materials to discuss a case study of interest to you, or (B) a more extended argumentative literature review. A prospectus for this paper will be due session 8 and the final paper will be due session 12, in time for our class conference. Grading will be based on class participation and presentation (30%), the short paper (20%), and the final paper (50%).\n\nGrading\n\nACTIVITES\n\nPERCENTAGES\n\nClass participation\n\n30%\n\nShort paper\n\n20%\n\nFinal paper\n\n50%\n\nCourse Schedule\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction: What Is Life, and How Do We Study It?\n\nBefore Biology: Experiencing and Organizing Bodies and Nature\n\nBiology, in Theory\n\nBiology Emerging: Heredity and Life in Formation and Evolution\n\nForm I: Genes, Molecular Biology\n\nForm II: Race, Then and Now\n\nShort paper due\n\nForm III: Bodies and Religion\n\nFunction I: Medicine and Difference\n\nProspectus due\n\nFunction II: Medicine and Markets\n\nTransformation I: New Biopolitics and Bioeconomies\n\nTransformation II: Life at Sea\n\nPaper Presentations\n\nFinal presentations\n\nCollaboration Policy\n\nStudents should be aware that in this course collaboration on the two writing assignments is not permitted. While you may discuss your topics and ideas with your classmates, all written text that you submit must be your own. You must use appropriate citation practices to acknowledge the use of books, articles, websites, lectures, discussions, etc., that you have consulted to complete your assignments.\n\nRequired Texts\n\nPlease see the\nReadings Section\nfor a list of required texts.",
  "files": [
    {
      "category": "Resource",
      "title": "The Pigs That Therefore We Are: Anatomy, Biology, and Transplantation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/sts-330-history-and-anthropology-of-medicine-and-biology-spring-2013/43fbf0660f36fef5746901ec9e331cd3_MITSTS_330S13_BolmModePigs.pdf",
      "content": "Brad Bolman\nStefan Helmreich/David Jones\nHS 246\nAugust 9, 2013\nThe Pigs That Therefore We Are: Anatomy, Biology, and Transplantation\nThe Huangpu, Athwart Pigs\nWhen more than 16,000 pigs started floating down China's Huangpu river, the local\nresponse was confusion. The Huangpu, which serves as a principal source of Shanghai's\ndrinking water, had become a site of disposal for pigs carrying porcine circovirus (PCV), a\nsingle-stranded DNA virus. Alarmed commentators were quickly calmed: circovirus does not\naffect humans. Circovirus, it appears, only affects pigs. And yet in 2010, when the FDA\nrecommended against the use of Rotarix, a vaccine intended to fight rotavirus, it was due to the\nappearance of PCV DNA in the vaccine, possibly present from the first stages of product\ndevelopment. Pigs, of course, were the cause, particularly their DNA used at early phases of\nclinical testing. Circovirus affects humans after all. The deceased, floating pigs of the Huangpu\nare entirely real, but they also sailed down the river like a \"return of the repressed\" for a system\nof industrial agriculture massively over-producing these porcine beings at the expense of a\ngenuine consideration of their health and well-being. Though pigs, as pork, form an essential part\nof diets and pigs, as iconography, play a significant historico-symbolic role in China,1 the\nHuangpu pigs were little more than trash, whether they were polluting once-pristine streams or\nfestering as unwanted industrial waste.\nThough pigs are widely acknowledged to be one of the most intelligent non-human\nanimals2 -- Aristotle would call them \"the animals most like people\"3 -- in America the\nconsideration of porcine beings largely ends at the dinner table. \"People say, 'Oh yes, pigs really\nare rather clever, aren't they?'\" says professor of evolutionary psychology, Richard W. Byrne,\nand then they take a bite from their Chipotle carnitas burritos.4 Modern industrial agriculture,\nparticularly its oft-reviled Concentrated Animal Feeding Operations (CAFOs), produces\n1 The Mandarin character for house includes the radical \"shi,\" meaning pig.\n2 Natalie Angier, \"Pigs Prove to Be Smart, if Not Vain\" (November 9, 2009).\nhttp://www.nytimes.com/2009/11/10/science/10angier.html?_r=0.\n3 Brett Mizelle, Pigs (London: Reaktion Books, 2011): p. 31.\n\nBolman 2\nenormous quantities of these beings to feed a rapidly growing world population whose hunger\nfor pork sees little risk of diminishing. Looking backwards in both Eastern and Western history,\nit is difficult to locate a moment when pigs were not, at least somewhere, becoming-pork.\nWhen Emøke Bendixen and colleagues wrote in a 2010 literature review on the potential\nof pigs to become \"model organisms\" for the study of human disease, a prominent reason cited\nfor pigs' high \"utility\" for biomedical research could have emerged straight out of a CAFO\nindustry PR pamphlet:\nThe size of pigs obviously makes them less suited for keeping and studying in laboratory\nfacilities than the rodent model, but the agricultural industry produces 1 billion pigs every\nyear globally [5]. Thus, industrial pig production represents a valuable resource from\nwhich experimental animals can be selected ... Making full use of this exceptionally\nlarge biological resource for developing useful biomedical animal models has so far been\nhampered by the relative lack of information about the molecular biology of the pig,\nwhich does not currently match the vast amount of biological information available on\nclassic model organisms like drosophila [8] and rodents [9].5\nPigs are prime targets for the status of \"model organism\" in biomedicine because, unlike\nthe \"fruit fly (Drosophila), zebrafish and rodents,\" porcine \"anatomy, genetics and physiology ...\nreflect human biology more closely than the classic animal models.\"6 The rhetoric of \"reflection\"\nand the fact that pigs \"mirror\" various human systems emphasize that the scientifico-rhetorical\nconstruction of similarity is crucial to establishing pigs as a new \"model organism.\" We are\nlooking, in other words, for something just like us that can carry human disease like we do, that\ncan replicate those disease's effects, and, simply enough, that can suffer like us. The problem\nwith establishing pigs as model organisms -- henceforth, creating \"model pigs\" -- resides in an\ninformation deficit about porcine genomic and proteomic information. In other words, we do not\ncompletely understand the \"mapping\" of pig genomes and pig organs onto the human. The pig\n-- the real, living and feeling porcine being -- is reduced to a bank of information.\nCompletely absent from the paper, which purports to \"highlight the current progress of\nthese ongoing areas of research,\" is any consideration of the ethicality of creating \"model pigs,\"\nor any nuanced consideration of factory farming as such. Factory farms simply are, pigs simply\n4 Angier, ibid.\n5 Bendixen, Emøke, Marianne Danielsen, Knud Larsen, and Christian Bendixen.\n\"Advances in Porcine Genomics and Proteomics - a Toolbox for Developing the Pig as a Model\nOrganism for Molecular Biomedical Research.\" Informational Genomics 9, no. 3 (2010): 209.\n\nBolman 3\nexist, and the fortunate combination of the two is a wonderful boon for genetic research\nattempting to unlock the secrets of human disease. The unproblematic acceptance of porcine\nsacrifice to alleviate human suffering is omnipresent in literature on model pigs: we have\nproduced a lot of pigs, might as well use them for science. This trope forms the rhetorical\nstructure of what I call \"porcine standing reserve,\" a particularization of Martin Heidegger's use\nof \"standing reserve\" to describe technological thought's reduction of the world into energy\navailable for human use.7 This twerked deployment conveys something beyond its\nterminological novelty: pigs have been, more than their non-human \"medical model\" brethren\n(rats, dogs, cats, apes and others), historically mediated by human collection and corralling; that\nmode of interaction has defined their ontological status in relation to \"human\" beings. From their\nvery outset, \"pigs\" were an artificial construction: domestication, hybridity, and cultural\nnarratives created a thing called \"pig.\" Thus, the promulgation of scientific narratives about pig\n\"models\" and the waste-ness of pigs actively create -- or shift -- that thing we call \"pigs.\" And\npigs -- the \"dirty\" pink beings with corkscrew tails -- have shaped science. Science, particularly\nbiology and anatomy, has explicitly porcine beginnings.\nThere is something paradoxical in an unproblematic affirmation of the \"model pig.\" To\nunravel that paradox is the goal of this paper. If the purpose of better understanding human\ndisease is to alleviate the suffering that it brings -- schizophrenia, cystic vibrosis, and cancer are\nall areas where model pigs could generate scientific enlightenment -- then why do organisms\nchosen for their similar \"anatomy, genetics and physiology\" warrant so little ethical\nconsideration? Why do we accept porcine sacrifice for human salvation? Why do pigs not seem\nto suffer? As is immediately clear, an investigation into this question stretches across many\ncenturies and multiple disciplinary contexts: the construction of pigs in science was also a\ncultural and economic question from its earliest moments. Thus, this paper will restrict itself to\nthree, rough historical moments, even as its analysis constantly spills over and beyond my self-\nimposed boundaries: first, the early anatomical texts written across roughly a century in Italy;\nsecond, the emergence of fetal pigs as waste bodies for dissection and places from which to\nextract general mammalian knowledge; and third, the recent debate over the use of \"model pigs\"\n6 Ibid., 208-209.\n7 Martin Heidegger, \"The Question Concerning Technology\" Basic Writings (New York:\nHarper Perennial, 2008).\n\nBolman 4\nfor potential xenotransplantation of organs from porcine bodies into human ones. At all three\nmoments, one sees a scientific willingness to offer pig bodies as oblations for the sake of better\nunderstanding human ones. That willingness, I will suggest, is intricately related to another\ncharacteristic possessed by pigs, beyond simply their similarity: their \"edibility.\"\nYet consumed, cut up, or grown, the Huangpu and the \"model pigs\" float back into the\npicture whenever or wherever we least expect them. Whether it is fear of disease from\nxenotransplantation, the difficulties of making fetal pigs like us, or simply the final aquatic\nvoyage of the Huangpu pigs, \"real\" pigs, and not simply their informatic bodies, keep\ninterrupting the scientific attempt to \"de-pig\" the pig. This paper, following in the vein of\nattempts at \"multispecies ethnography,\"8 attempts something like a \"multispecies history\" by\ntracing, following, and highlighting porcine bodies in a history of their modeling and capture\nwhich often acts as if they were never alive in the first place. Pigs, more dramatically and\nextensively than many other domesticated animals, have been both materially and symbolically\ndeprived of agency. The pigs that used to \"roam the countrysides\" (of our cultural imagination, if\nnothing else) are now confined to industrial slaughterhouses with chilling similarities to the\nconcentration camps of Nazi Germany. The \"Terminator Pigs\" of the ancient Americas have\nbeen replaced, in our predominant subjective conceptions of \"the pig,\" with pink corkscrew-\ntailed Babes -- even as \"real\" pigs die by the millions every year. Even scientific narratives\nabout pigs tend to reduce them to bystanders in the great human drama of scientific progress.\nWhen Bendixen and his co-authors discuss industrialized pigs as a \"valuable resource\" for\nmedicine, living pigs themselves are concretized as little more than resources: porcine standing\nreserve.\nBut as Brett Mizelle suggests, vis-a-vis the debate over pig domestication, \"it is possible\nthat ... pigs in some sense 'chose' domestication, or at least were more integral to the process\nthan earlier anthropocentric models that made domestication solely a matter of human agency.\"9\nIn a very similar way, scientific narratives -- particularly in the way that the debate on \"model\norganisms\" proceeds in medical journals -- have depicted porcine beings as determined\nmonocausally by \"human agency.\" I try to reverse this by reading history, economics, and\n8 Kirksey, S Eben, and Stefan Helmreich. \"The Emergence of Multispecies\nEthnography.\" Cultural Anthropology 25, no. 4 (October 13, 2010): 545-576.\ndoi:10.1111/j.1548-1360.2010.01069.x.\n\nBolman 5\nculture athwart pigs,10 and more contextually, how pigs dirty accepted boundary distinctions.\nThe end of the paper gestures toward fugitive forms of porcine agency: how pigs have, in some\nsense, \"chosen\" their involvement with scientific research and also, more importantly, how they\nhave refused. Their efforts to escape -- their \"fugitivity\" -- from various forms of captivity will\nhaunt the present piece. My interest in this question mirrors, closely if idiosyncratically, Fred\nMoten's attentiveness to \"that constant escape of life, that constant escape of the bios.... a kind\nof fugitivity.\"11 Pigs have escaped human attempts at capture, repeatedly, and the finale of the\npaper engages with moments when the eater's place at the table \"turns.\" The following is an\ninitial, if necessarily incomplete, archaeological dig, looking to retrieve a place for pigs in the sty\nof biology and culture.\nThe Loathsomeness of Expression\nThe pig made its most prominent early appearance as a pedagogical and medical object in\nthe work of the famous Greco-Roman anatomist, Galen. Galen wrote, concerning his choice of\npigs over apes in experiments connecting \"lesions in the nervous system\" to the voice, that\ncutting open a pig allowed him \"to avoid seeing the unpleasing expression of the ape when it is\nbeing vivisected.\"12 Apes, Galen noticed quickly, find little enjoyment in live dissection. An\nequally important reason to prefer a pig in anatomical experiments that include injuring an\nanimal's vocal capacities is that \"the animal on which the dissection takes place should cry out\nwith a really loud voice.\"13 Based on his On Anatomical Procedures, Galen appears to have\nmade liberal use of pigs to demonstrate various aspects of biological functioning \"because there\nis no advantage in having an ape in such experiments and the spectacle is hideous.\"14 An\nunspoken cause of Galen's preference for pigs rather than apes was an economic one: \"Pigs were\nan important food in ancient Greece, as they were economical to raise, easy to sell and good to\neat.\"15 Pigs would remain \"an important food\" and popular object of hunting in the Roman\n9 Mizelle, 15.\n10 Stefan Helmreich, Alien Ocean (Berkeley: University of California Press, 2006): 21.\n11 Fred Moten, \"The Insurgency of Objects.\" 123678945 Vol. 1 (November 7, 2005).\n12 Galen. Duckworth WLH, trans. On anatomical procedures, the later books.\n(Cambridge (MA): Cambridge University Press, 1962): 15.\n13 Ibid.\n14 Ibid.\n15 Mizelle, 32.\n\nBolman 6\nEmpire of Galen, making them quite a bit easier to come by than apes.16 Primates were part of a\nmarvelous and unbelievable trade in exotic species throughout the Roman Empire, but they\nexisted primarily as pets imported from military conquests or trading partners in Asia Minor or\nAfrica. That status, with its hint of a \"companional\" distinction between pigs and apes, would\nhave made them expensive, particularly when considering the disposability of animals destined\nfor Galen's dissecting table.17 Pigs were, however, domestically raised and would have been\nrelatively easy to come by -- wealthy Romans may have even possessed their own private boar-\nhunting parks.18\nIn one of his most popular, public demonstrations -- \"Many distinguished politicians and\nscholars [even] came, including Alexander Damascenus, an Aristotelian philosopher...\"19 --\nGalen \"showed them [the nerves controlling breathing] and how damage to the nerves activating\nthe muscles of the larynx results in a loss of voice\" in a live pig.20 With a single cut, the \"really\nloud voice\" was silenced almost immediately. The crowd loudly expressed its shock and\nwonderment. Galen's public medical spectacle was, perhaps, \"the first experimental and publicly\nrepeatable evidence that the brain controls behavior.\"21 That spectacle revolved entirely around\nthe mute pig.\nIn his various references to porcine creatures, Galen avoids any claim even\napproximating the discussions today of the pig as a medical \"model\" for human disease. His\nproclivity for pigs was much more closely tied to a series of pragmatic concerns than to the\nexemplarity or similarity of the pig -- Galen still regarded the ape as being much more \"similar\"\nto humans. At one point, he does go far enough to suggest that \"there is no need to dissect any\nliving animal except pigs or goats\" in order to understand the general relationship between spine\nand voice.22 Yet his point is never explicitly that one can \"map\" the anatomical aspects of the pig\nbody to the human body -- throughout most of the text, Galen's comparisons concern the\nproximity of pig anatomy to ape, rather than human, anatomy. Instead, his point is that the voice\n16 Ibid.\n17 J. Donald Hughes (2003): Europe as Consumer of Exotic Biodiversity: Greek and\nRoman times, Landscape Research, 28.1: p. 24.\n18 Mizelle, 33.\n19 Charles G. Gross, \"Galen and the Squealing Pig,\" The Neuroscientist, p. 218.\n20 Ibid., 219.\n21 Ibid., 220.\n22 Galen, 87.\n\nBolman 7\n\"of the pig is loud and strong.\"23 Much the better, then, to show your results to the interested\npublic and experience \"for yourself\" the connection between the nervous system and vocal\nutterances. There is, then, a performative reason to select the pig as your dissection animal. As he\nwrites, \"leave the live apes alone, and turn to these animals.\"24\nThere is another dimension, however, to the decision about the most suitable animal for\nanatomical dissection, \"for in all animals which have a larynx... the expression in vivisection is\nnot the same.\"25 Beyond the spectacularity of having the \"squealing pig\" silenced, then, there is\nalso a strong ethico-affective reason to prefer the pig over the ape. The \"expression\" of the ape is\ndifficult for the industrious anatomist to stomach and, while the reasons for it remain unspoken,\nthe mute pig seems to arouse no such sympathy. Galen is quick to caution that you can and\nshould still dissect an ape, to \"extend your studies.\" But this dissection can be satisfactorily done\non \"a dead man and an ape,\" rather than a live subject.26 The pig -- the goat is acceptable, as\nwell, but Galen's preference toward porcine dissections is clear throughout On Anatomical\nFunctioning -- is the non-human animal that the anatomist can do violence to with the least\npsychological unease. And violence seems an inescapable description for procedures like this\none:\nShould you have progressed so far that you have been able to discover this nerve, then\ndraw it upwards far enough to enable you to ligature it, if you want, or to damage it in\nsome other manner. If you do that, you see that the tone of the exhalation of the animal,\nwhich still persisted after the damage to the recurrent laryngeal nerve, becomes lost...\nAnd you observe also that as a result of the damage which has involved the muscles and\nthe remaining nerves of the larynx, only a very slight change comes over the voice in\nrespect of its weakness, power, sharpness and depth.27\nGalen may have been one of the first to engage in frequent and documented dissections\nof pigs -- he certainly popularized the practice and it would only become more economically\nreasonable with the vast increase in pig husbandry throughout Europe28 -- but he puts forth one\n23 Galen, 88.\n24 Galen, 87.\n25 Ibid.\n26 Ibid., 86.\n27 Ibid., 107.\n28 Mizelle, ibid. See also: SOFIE VANPOUCKE, FABIENNE PIGIERE, ANN\nDEFGNEE & WIM VAN NEER, \"Pig husbandry and environmental conditions in northern Gaul\nduring Antiquity and the early Middle Ages: the contribution of hypoplasia analysis\"\nArchaeofauna 16 (2007): 7-20.\n\nBolman 8\nof the earliest and clearest comparative justifications for using porcine beings for medicine and\nbiology. He does so through a discourse which reemerges repeatedly throughout the historical\ncollision of pigs and medicine: the \"non-companionality\" of the pig or the economic \"edibility\"\nof the pig. Unlike the ape, which resembles humans too much for comfort, or the dog, to which\nwe maintain provisional pet-inspired sentiments, pigs lack the \"loathsomeness of the expression\"\nthat arouses ethical concern from the \"man of science.\"29 Why, though, does this difference in\ncapacity to arouse ethical sentiment occur? Though Galen provides no immediate answer, the\npieces of the discussion so far can formulate a \"working hypothesis\" on the subject: the\ncombination of the \"industrial\" and \"consumptive\" relationship of humans toward pigs shapes,\ndramatically, the range of possible ethical feeling that the animals could create. Cutting into pigs,\nGalen teaches us, is easier: \"Previously I have also said that it is best if the animal be a pig.\"30\nGalen contributed, perhaps more than any previous thinker, to the creation and centralization of\nthe pig as critical object of anatamo-scientific inquiry.\nIf Galen was an early exemplar of the medical interest in pigs, the centrality of the\nporcine body as a tool to grow anatomical knowledge would continue in the work of the\nanatomists and biologists at the Salerno institute during the early Medieval period. Largely due\nto a difficulty in acquiring human corpses for dissection, the Salerno scientists used \"porcine\ndissections\" to create \"one of the first European anatomic texts\"31 -- like Galen's work, the text\ncreated at Salerno was pedagogically focused from the outset. \"The Anatomy of the Pig,\" the\ntextbook created for the students of Salerno, sets out to improve upon and respond to Galen's\nprogress:\nBecause the structure of the internal parts of the human body was almost wholly\nunknown, the ancient physicians, and especially Galen, undertook to display the positions\nof the internal organs by the dissection of brutes. Although some animals, such as\nmonkeys, are found to resemble ourselves in external form, there is none so like us\ninternally as the pig, and for this reason we are about to conduct an anatomy upon this\nanimal.32\n29 Gross, 85.\n30 Ibid., 105.\n31 Zoe Alaina Ferraris and Victor A. Ferraris, \"The Women of Salerno: Contribution to\nthe Origins of Surgery From Medieval Italy,\" Ann Thorac Surg 1997, 64: 1855-1857 .\n32 Anonymous, George W. Corner trans., \"The Anatomy of the Pig\"\nhttp://wb.westernstandard.com/nxt/gateway.dll/sc/scgs/0002%20a%20source%20book%20in%2\n0medieval%20science/010002-00099.xml?fn=document-frame.htm$f=templates$3.0.\n\nBolman 9\nExpanding upon Galen, who classifies animals into \"six classes\" of similarity to human,\nthe Salerno scientists articulate a sub-division of similarity: internal and external likeness. Thus,\nwhile monkeys may resemble humans \"in external form,\" it is in fact the pig that shares the\nstrongest resemblance in terms of internal organic composition. The Salerno text goes no farther\nthan this: no explanation of what similarities there are, how they are known, etc. It is highly\nlikely that the choice of pigs was a direct response to the inability to dissect human cadavers.33\nBut while \"Western anatomical study did not spring full-fledged from the slit torso of a pig,\" it is\nclear that the pig dissections at Salerno were an important step in the evolutionary process of\nanatomically dissecting bodies.34 The Salerno school played an essential role in spreading the\nanatomical teaching of Galen, as well as the post-Galen discoveries of Arabic scientists,\nthroughout Europe:\nTranslated from arabic into latin, medical knowledge was passed to the school of Salerno\nin the tenth and eleventh centuries, where it spread outwards so that, by the thirteenth\ncentury, four major centres of medical teaching were flourishing in Europe: Salerno,\nBologna, Montpelier, and Paris.35\nPerhaps most importantly, at Salerno the pig becomes a stand-in for the human body.\nThat is, when the anatomists at Salerno select the pig rather than the ape as the object of their\ndissection, they are also engaging in a critical effort to render human and pig bodies internally\ntranslatable, rather than simply analogous. The pig becomes a surrogate human when it comes\nacquiring medical knowledge and, specifically, for teaching that knowledge to students through\n\"hands on\" dissections. The \"porcine body\" becomes an educational and anatomical object for\nunderstanding the human body: \"human\" and \"pig\" organs are, in a sense, emptied of their\ncontainers; a biological eversion of Deleuze's body-without-organs. The \"pig\" becomes organs\nwithout-body which is most \"like us internally.\"36 Similarities in outward appearance will have\ndecreasing importance as dissection as a practice grows. This shift appears most importantly and\npowerfully in the work of Vesalius, the most influential anatomist in history, who would prefer,\n33 Nancy G. Siraisi, Medieval & Early Renaissance Medicine: An Introduction to\nKnowledge and Practice (Chicago: University of Chicago Press, 1990): p. 86.\n34 Ibid.\n35 Jonathan Sawday, The Body Emblazoned: Dissection and the Human Body in\nRenaissance Culture (New York: Routledge, 1997): 36.\n36 Siraisi, 86.\n\nBolman 10\nonce again, pigs as his dissective animals to monkeys. The title page of the 1604 edition of his\nFabricus includes an elaborate engraving displaying:\na triumphal arch, its niches filled with various anatomical figures; in the archway,\nVesalius is seen performing a dissection in the presence of several learned colleagues,\nwhile above him, reclining on the sloping sides of a broken pediment, are shown two\nanimals of special significance to the professional reader: a pig, commonly used for\nvivisections because its inner organs were regarded as similar to those of man,32 and an\nape, the source of Galen's mistakes and the creature closest to man in its bony structure.37\nIf our above analysis was accurate, the drawing seems to display not simply Vesalius's\npreference for the pig over the ape, but the difficulties of Galen as well.\nBut the story appears a bit too simple -- that pigs were chosen because they were most\n\"similar\" might be correct by today's standards, but it appears, particularly in the case of\nSalerno, like something of a Munchhausen trilemma. There were, after all, quite a few possible\nanimal substitutes for the human body, and knowledge of anatomy at the Salerno school in the\neleventh century was nowhere near its current situation where discussions about porcine-human\nsimilarity still repeatedly reach stumbling blocks of comparison. We are right to wonder what we\nasked of Galen as well, \"Why the pig?\" The answer, as I have already suggested, is inextricably\ntied to the economic production and edibility of the pig, and not simply to science's search for\nmedical truth.\nIn Rome, pig consumption was tremendously common. Yet that they were eaten widely\nbarely exhausts the importance of porcine creatures in Roman times. After all, \"no other animal\nhad so many Latin names (e.g., sus, porcus, porco, aper) or was the ingredient in so many ancient\nrecipes as outlined in the culinary manual of Apicius\" as the pig.38 As the Roman agronomist\nVarro wrote, \"who of our people runs a farm without keeping pigs?\"39 Based on a mix of written\nreferences and archaeological remains, Michael Mackinnon argues that pigs almost certainly\nmade up a substantial part of the Roman diet, whether rural or urbane. Indeed, based on\nrecovered bones, there appear to have been at least two breeds of pig -- with the smaller one\ndominant in cities, suggestive of economic importation -- and \"the overall size of pigs tends to\n37 H. W. Janson, \"Titian's Laocoon Caricature and the Vesalian-Galenist Controversy\"\nThe Art Bulletin, Vol. 28, No. 1 (Mar., 1946): p. 52.\n38 Michael Mackinnon, \"High on the Hog: Linking Zooarchaeological, Literary, and\nArtistic Data for Pig Breeds in Roman Italy,\" American Journal of Archaeology, Vol. 105, No. 4\n(Oct., 2001): p. 649.\n\nBolman 11\nincrease slightly over time, suggestive of improved breeding conditions through antiquity.\"40 As\nRome entered the fourth and fifth centuries, the specialization of pig sellers appears to have\nincreased as well. The economics of pig production were well-developed, as domestication made\nthem both more accessible and easier to farm throughout the Empire (whether in forests or\nstalls). At the time of Galen's writing, around early 200 AD, raising pigs on large Roman farms\nand selling pigs in city markets would have been tremendously profitable operations -- though\nthey would see continued expansion -- and it is no accident that this animal which appears to\nhave been so widely sold and consumed appears as the logical choice for dissection in Galen's\nmedical treatises.41\nThe pig would have appeared to Galen as both a quotidian victim of sacrifice and\nconsumption. And Galen makes clear repeatedly that he has eaten pigs: \"Take pigs, for example:\neven if the spleen is not as good as the liver for eating, yet it is not inedible.\"42 Even larger scale\nproduction of pigs as a source for food was very clear to Galen, who describes the shift from a\ntime when \"acorns were formerly forage for pigs... [until] instead they slaughtered them at the\nbeginning of winter and used them for food.\"43 Perhaps the clearest discussion comes in his text\n\"On the Powers of Foods: Book 3,\" where he extols the value of consuming pork: \"Of all foods,\ntherefore, pork is the most nutritious... As regards the digestion, pork is far better, both for those\nin the prime of life, the strong and people who pursue the activities of those in their prime, and\nalso for anyone else who is still growing.\"44 Galen clearly understands the consumptive\nimportance of pigs: they help young Romans grow, they contain the most nutritious flesh, etc.\nAnd when he turns to the various animals that are, today, dissection alternatives to the pig, he\nappears much less confident and knowledgeable: \"As for the dog, what can I say?\" When he\narrives at the \"little animal in Spain looks like a hare (which people call a rabbit),\" Galen can\n39 Rust. 2.4.3\n40 Mackinnon, 657.\n41 Ibid., 667.\n42 Galen. Mark Grant trans., \"On Black Bile\" in Galen on Food and Diet (London:\nRoutledge, 2000): p. 30.\n43 Galen. Mark Grant trans., \"On the Powers of Foods: Book 2\" in Galen on Food and\nDiet (London: Routledge, 2000): p. 136.\n44 Galen. Mark Grant trans., \"On the Powers of Foods: Book 3\" in Galen on Food and\nDiet (London: Routledge, 2000): p. 154.\n\nBolman 12\nprovide no recommendation on edibility, for he presumably had never seen such an animal.45 Yet\nwhen he comes to discussing the \"extremities\" of the animal, Galen is quick to suggest \"piglet's\ntrotters\" over \"their noses\" which are better than the \"ears.\"46 The pig becomes the model of\nconsumption for other animals, a proposition of Galen's which is of no small importance when\nconsidering the selection of the pig as the object of science: \"Note that the relationship between\nwhat I am saying here with the rest of the animals is the same, because the gap in excellence\nbetween the food from the extremities and the meat of pigs, mirrors the gap between the\nextremities of pigs and the corresponding parts of other animals.\"47 [Emphasis mine] Galen's\nrecommendations for consuming pig links with his vivisections to form a veritable carnivorous\nanatomy. We could say, further, that Galen's science -- because his dietary suggestions and\nanatomical investigations were not isolated endeavors -- was a priori a carnivorous one.\nThe individuals present for his famous \"mute pig\" spectacle would have been high-class\nand comfortably living Romans -- diplomats and philosophers, as well as lower class spectators\n-- for whom pig slaughter, as food and religious ritual, would have appeared equally quotidian.\nIn Rome, coincident both with some of the largest early advances in anatomical learning under\nGalen and the beginning of the use of pigs as objects of medical knowledge, we see the large-\nscale industrial manufacture of porcine bodies -- an early porcine standing reserve. The cultural\n\"edibility\" of pigs, if we take Galen at least somewhat at his word, was incredibly well-defined:\npigs were very rarely described as pets (wealthy Romans would have chosen more exotic\nspecies, like monkeys or birds) and are instead nearly always the victims of sacrifice or\nconsumption.48 Though it extends beyond the aim of the current work, the relationship between\nsacrifice to the Gods and sacrifice to anatomy also seems well-defined: pigs and goats are the\ntwo animals that Galen is most willing to cut open for science, and these two animals were two\nof the most common sacrificial victims at the altars of Roman temples. The pig, then, was not\nsimply a good model for a public dissection in Rome, and for medical learning in general: it was\nthe ideal. A culture of edibility and a vast machinery of production would have meant not simply\nthat Galen had easy access to pigs for anatomical experimentation, but that any of his potential\n45 Ibid., 156.\n46 Ibid., 158.\n47 Ibid.\n48 Mackinnon, 667.\n\nBolman 13\nreaders -- his texts are nearly always didactic in tone -- would have been able to access them as\nwell.\nYet to make this connection between Galen and pig consumption more than a temporally\nspecific one, we would have to follow the pigs from Rome to Salerno. And at Salerno, in the\nsouth-central section of Italy, we discover another location where pig husbandry during and\nfollowing the Roman Empire was highly developed. Archaeological evidence from nearby\nPompeii confirms substantial deposits of pig bones in qualities which suggest that the Campania\nregion, and specifically this eastern one proximate to the water, would have been ideal for pigs.49\nAnd though the industry itself clearly fell off following the dissolution of the Roman Empire,\npigs would continue to play a growing and important role in Medieval Italian diets. In all\nlikelihood, pigs emerged from the sacking of Italy by various \"barbarian\" tribes better positioned\nthan their Roman masters. Indeed, the laboratories at Salerno would have been hard-pressed to\nlocate a significant supply of the apes which Galen had sought to avoid maiming. Pigs, on the\nother hand, were undoubtedly in good supply. They were, in fact, likely \"one of the most\nimportant sources of meat and fat\" in large swaths of medieval Europe.50 Because they could\nboth roam forest areas as well as eat garbage in city streets, pigs were an ideal animal for\nproduction and consumption during medieval times. And due to \"the central role the pig played\nin the medieval diet, it is not surprising that physicians used various parts, such as feet, gall, and\nlard, for a variety of remedies.\"51 Equally, one could say, it is not surprising that anatomists at\nSalerno used pig bodies for a variety of dissections. Vesalius, teaching at the University of Padua\nduring a period when food production was developing at a much quicker pace and remained\nmuch more stable than in the medieval period -- the Renaissance was, after all, in full speed in\n1540 -- would have had no trouble at all accessing a large store of pigs.52 The thing that saved at\nleast a number of pig bodies from the dissection scalpels of European history was not, in fact, the\ndiscovery that they were not suited to the practice or the awakening of an ethical feeling toward\n49 Ibid.\n50 Melitta Weiss Adamson, Food In Medieval Times (Westport, CT: Greenwood, 2004):\np. 30.\n51 Ibid.\n52 Elizabeth S. Cohen and Thomas Vance Cohen, Daily Life in Renaissance Italy\n(Westport, CT: Greenwood, 2001): 228.\n\nBolman 14\nporcine creatures. It was, instead, the simple fact that human bodies themselves finally became\nmorally and ethically less problematic dissection objects under and following Vesalius.\nAnd yet Vesalius partook as well in the dissection of pigs, tapping into the standing\nreserve of porcine bodies that had helped anatomists before him, like his \"rival\" Galen and the\ntextbook writers of Salerno. Vesalius continued a \"carnivorous\" form of anatomy -- anatomy as\nwe understand it, I suggest, was always already carnivorous: the practice of cutting open and\nbreaking up animal bodies was inseparable from a relationship of edibility toward those bodies\n-- that saw pigs in particular as, essentially, walking food. This lens, through which the early\nanatomists both related to and understood pigs, as animals for consumption, circumscribed the\ntelos to any particular pig's life: it was, or would be, eaten. Pigs were, from their earliest\nmoments, becoming-pork: though they might serve other purposes during their lives, like\ncleaning streets or foraging, the end of a pig's life was always the dinner table, in one form or\nanother. That becoming-pork was inextricably related to the difficulty in ethically identifying\nwith pigs that Galen expresses so clearly. Pigs were, during Roman times, and are, today, still\none of the most widely and completely consumed animals in existence -- one can and did eat\nalmost the entirety of the pig. That their production for this purpose would increase rapidly with\nthe growth of industrial farming was not incidentally related to their reappearance much later in\nhistory as medical and dissection model: this production and consumption was that re\nemergence's condition of possibility. As the rest of this paper will attempt to demonstrate, the\nbecoming-pork of pigs maintained a privileged place in scientific discourse -- becoming more\nexplicit over time, not less. And one of the least likely but most important places for the re\nemergence of the porcine body in science was the high school classroom.\nFetal Pigs, Inc.\nIn his review of W. J. Baumgartner's 1924 book, Laboratory Manual of the Foetal Pig,\nH. H. Lane writes that the \"laboratory manual\" deserves \"the consideration of every teacher of\ncomparative vertebrate anatomy. It contains excellent directions for the dissection and study of a\nform hitherto largely over-looked, which presents certain obvious advantages over the dog, cat or\nother mammal more frequently the object of such study.\"53 \"Foetal pigs,\" importantly, were\n\"over-looked\" in 1924, which is an observation that seems strikingly anachronistic in 2013\n53 H. H. Lane, \"Scientific Books: Laboratory Manual of the Foetal Pig. by W.J.\nBaumgartner,\" Science LXI, No. 1591 (June 26, 1925): 658-659.\n\nBolman 15\nwhere laboratory dissections of fetal pigs form a central part of many high school biology\ncurricula. Foremost -- numerically and, one could wager, symbolically -- among the \"obvious\nadvantages\" presented by the pig is \"(1) The unlimited number of specimens which may be\nobtained at any good-sized packing plant with a minimum expenditure of time and labor.\"54\nHere, nearly a century in advance, we find an early version of the argument Bendixen and\ncolleagues will leverage for the usefulness of pigs as model organisms: their presence at hand.\nFor Lane (citing Baumgartner), pigs are \"unlimited,\" largely due to advances at the time in\nrefrigerated transportation that allowed for the consolidation of pig production in major centers.\n\"Centralized packing plants were located adjacent to the stockyards\" in most pork industry\ncenters, so the enterprising medical supplier could acquire a significant batch of fetal pigs with a\n\"minimum expenditure of time and labor.\"55 According to Bendixen, in 2010 pigs are an\n\"exceptionally large biological resource ... [thanks to] industrial pig production...\"56 In both\ncases, due to over-production by industrial pig farms, the size of the porcine standing reserve is\ntrends toward infinity, or excess, while the ease of their acquisition for scientific purposes is\nrepresented as incredibly simple. For both Lane and Bendixen, the \"facticity\" of this reserve\narmy of scientific pigs -- the origins of and reasons for this production, its potential cancellation,\nfactory farming itself, etc. -- is taken completely for granted. As a more recent manual covering\nthe benefits of using fetal pigs for dissection -- citing Nebraska Scientific, self-billed as the\n\"world's largest processor of fetal pigs\"57 -- suggests: \"Fetal pigs are not bred for the purpose of\ndissection. They are a by-product of the pork food industry.\"58 This rhetorical move is meant to\nassuage potential guilt about the way that fetal pigs are acquired for dissection use, but it does so\nthrough precisely the same unproblematic acceptance of the industrial origins of \"model pigs.\" It\ndepicts fetal pigs as the excess or waste of an industrial process that will continue ad infinitum,\n54 Ibid., 658.\n55 Mick Vann, \"A History of Pigs in America\" Austin Chronicle, April 10, 2009:\nhttp://www.austinchronicle.com/food/2009-04-10/764573/.\n56 Bendixen, et al. Ibid.\n57 Nebraska Scientific, \"Everything You Wanted to Know About Fetal Pigs... But Didn't\nKnow Who to Ask,\" no date. http://www.nebraskascientific.com/wfdata/frame2200\n1252/File3.pdf.\n58 James Miller, \"Why fetal pigs are good dissection specimens,\" 1997.\nhttp://www.goshen.edu/bio/pigbook/dissectionadvantages.html.\n\nBolman 16\nwhich is to say that it relies upon the becoming-pork of pigs because industrial production of\npigs will inevitably create fetal excesses.\nLane, however, continues to elucidate reasons that pigs possess utility for medical\ninspection other than simply their large, available stock. He continues his list of the advantages\nthus:\n(2) The convenient size of the specimens...\n(3) The absence of an objectionable odor or other quality that would make them objects\nof disgust to the most \"finicky\" student.\n(4) The impossibility of any sentimental restrictions on their use arising from humane\nsocieties or antivivisection societies. Related to this is the fact that the student has no\ntender associations to be outraged as is sometimes the case where 'pet' animals are used.\n(5) The softness of the muscular and skeletal systems in the fetal pig make easier the\ndissection of the nervous and circulatory systems. And finally,\n(6) The student gets a very good idea of the course of the fetal circulation in mammals.59\n(Emphasis mine)\nLane was, clearly, incapable of predicting the situation that fetal pig dissection finds itself\nin today: actual fetal pigs are being replaced by \"cyber\" dissections or other substitutes because\n\"finicky\" students of multiple varieties (religious, ethical, etc.) have, in fact, made these pigs into\n\"objects of disgust\";60 and \"sentimental restrictions\" from \"humane societies\" like PETA have\narisen.61 He was wrong on both \"moral\" counts. However, those later shifts -- toward a more\ncosmopolitan lab makeup, toward a stronger animal rights lobby -- were far removed from\nLane's foresight, and it would be unfair to fault him for failing to anticipate PETA and cyber\npigs.\nThe second half of point (4) and point (6), however, deserve a closer analysis. Already, in\n1925, small pigs were separated from the \"tender associations\" that students maintained with\n\"pet\" animals: dogs, as well as cats, were the other primary dissection target at the time due to\ntheir similarity with humans. Due to increasing industrialization and their disappearance from\ntraditional small farms, pigs had begun their transition into invisibility for the educated and\n59 Lane, 658.\n60 Even supporters of the practice have agreed that it should not be an obligatory one, see\nGarcia Barr and Harold Herzogl, \"Fetal Pig: The High School Dissection Experience,\" Society\nand Animals, Volume 8, Number 1, 2000 , pp. 53-69(17).\n61 Their \"Dissection: Lessons in Cruelty\" webpage makes this point clearly.\n\nBolman 17\nurbane students of anatomy as well as for society at large.62 The fetal pig is situated, in Lane, at\nan entirely different level than \"companion animals\" or \"pets,\" thereby severing these entities\nfrom the complex modes of interaction that \"companion animals\" can provoke. The interaction\nbetween dogs and their owners, as writers like Donna Haraway have investigated, can disrupt\n\"the absolute animal-human binary\" as \"pet owners 'readily mix and match' different\ninterpretations of their animals as both 'human' and 'animal'...\"63 For Lane and Baumgartner,\npigs are, quite simply, animals -- in the fully derogatory mode of the term's deployment -- and\nthey, as well as their fetal waste by-products, can be used ethically as objects for medical\nknowledge.\nImportantly, as well, it is not simply porcine knowledge that student dissection of a fetal\npig provides but knowledge about \"the course of the fetal circulation in mammals\" (emphasis\nmine). The fetal pig -- along with the constitution and general arrangement of its biological\nsystems -- comes to metonymically represent mammals in toto, and fetal pig bodies become\nsites from which knowledge about those other bodies can be extracted. The fetal pig, then, is one\nessential player in the creation of the \"model pig.\" The analogization of the pig had already\nreemerged powerfully in the later 1800s with the dissection of pig eyes as potentially useful for\nunderstanding the structure and function of sight in general.64 The shift, however, in the\npositioning of fetal pigs as analogically and physiologically similar to humans and other\nmammals in their complete interior makeup went farther than simply noting the complexity of\npig eyes had: the pig became a body where human physiology was reduced and where the\nsystems of larger mammals were visible in a simplified totality -- organs-without-body. And if\nthe pig had been understood in this way since Vesalius, it was only around this time that the pig\nwas re-popularized as an object of pedagogical inquiry.65 As Franklin Mall wrote in his piece\n62 Mizelle, 9.\n63 Schlich, Thomas, Eric Mykhalovskiy, and Melanie Rock. \"Animals in Surgery\nSurgery in Animals: Nature and Culture in Animal-Human Relationship and Modern Surgery.\"\nHist. Phil. Life Sci. 31 (2009): 1-35.\n64 For example, in Veasey (1896): \"For use in practicing the various operations, the pig's\neyes seem to be the best.\" Clarence Archibald Veasey, Ophthalmic operations as practiced on\nanimals' eyes (Philadephia: Edwards & Docker Co., 1896). In Edwards (1923): \"Pigs' eyes may\nbe easily obtained from a slaughter house.\" Edwards, H W. \"A Look Into One's Eye.\" School\nScience and Mathematics (1923).\n65 Why the pig disappeared from this position is a question large enough to merit more\nsubstantial consideration elsewhere.\n\nBolman 18\n\"On the Teaching of Anatomy,\" the use of a pig would help resolve that \"difficulty [whereby] a\nsystem, e. g., the digestive, is treated as a whole by having each student dissect it rapidly in a\nfetal pig. That which is studied in regions in the dissecting room is here studied as a whole.\"66\nThe introduction and popularization of fetal pig dissection is thus an integral moment in an effort\nat comparing pig \"bodies\" to human ones -- though this had occurred in Galen's time, as we\nhave seen. What was new here? The answer, I think, is the attempt to miniaturize human systems\nand force them to appear in the dissected pig so that they could be seen \"as a whole.\" Thus, the\ndissector of a fetal pig comes to understand that pigs are biologically like us on not simply the\nlevel of organ comparison, but from a systems perspective as well.\nOne might expect that this similarity would arouse more sympathy on the part of the\ndissector, which is why the importance of the \"impossibility of sentimental restrictions\" and\n\"tender associations\" is stressed in Lane and Baumgartner. Pigs are thus placed in a paradoxical\nrelation whereby they are simultaneously biologically like us and morally valueless -- a way of\noccupying both sides of the animal-human boundary simultaneously (while maintaining the\nbarrier of the middle), a pharmakos/pharmakon67 of animality. This divergent juxtaposition (or,\ncomparadoxicality) of pigs and humans finds some of its earliest justifications precisely in the\nanatomical manuals on pig dissection. As a 1965 lab manual for dissecting fetal pigs in college\nlabs writes:\nThe purpose of a study in Anatomy is to acquaint you with the structure of the\nmammalian body, that is, your own. Any number of different animals might be used for\nthis purpose, but the fetal pig combines a number of advantages which make it ideal for\nuse in the laboratory -- it is abundant, convenient in size and thus easily handled,\nrelatively inexpensive and, in addition, serves to illustrate fetal structures as well as most\nof those which will be present in the adult.68\nThe phrase \"any number ... might be used\" is a rhetorical trope that emerges repeatedly\nthroughout scientific literature justifying pig use: initially, it is established that the pig is not\nexactly necessary for learning, research, etc. Instead, the pig is sufficient because of a series of\nadvantages established by cost-benefit calculation against a non-present alternative animal\n66 Mall, Franklin P. \"On the Teaching of Anatomy.\" The Anatomical Record 2, no. 8\n(November 1908): 1-23.\n67 The pharmakos was sacrificed in Ancient Athens during times of hardship. In Greek,\npharmakon connoted simultaneously poison and cure.\n\nBolman 19\nmodel. Like Lane, Odlaug deploys the vastness of the porcine standing reserve: the fetal pig is\n\"abundant\" and \"relatively inexpensive,\" as well as manageable and representative of \"the\nmammalian body.\" The fetal pig was a critical instance of the conversion of the \"pig\" into an\nitem of advanced medical understanding not by inaugurating its use -- that had happened\nalready -- by routinizing the pig: dissection of pig eyes was primarily undertaken by medical\nstudents, and eventually it would filter into high school classrooms. The availability, the\ndissectability of the pig became something non-specialized individuals were aware of and, as\nTheodore Adorno writes, \"Representation gives way to universal fungibility. An atom is\nsmashed not as a representative but as a specimen of matter, and the rabbit suffering the torment\nof the laboratory is seen not as a representative but, mistakenly, as a mere exemplar.\"69 The pig\nmaintained its status, from Galen to now, as a \"mere exemplar,\" mere organs-without-body, for\n\"the mammalian body\" more generally.\nAnd if the \"availability\" and \"palatability\" of the fetal pig as the object of student\nmedical dissection was conditioned by industrial production of the pig, it was also haunted by\nwhat I described above as a \"carnivorous\" anatomy. As Odlaug writes in the manual, \"Bear in\nmind that you are dissecting, not butchering.\"70 His instruction is obviously meant to ward off\nunnecessary destruction to the entity being dissected, but it cannot escape the familiarity with\npork consumption that most of Odlaug's prospective students would have possessed. It is a\nnearly inescapable conclusion in the American context that the conditions of possibility for\ndissecting fetal pigs was, in fact, factories producing pork for human consumption. The pork\nindustry grew rapidly in America following the 1950s due to relaxed government regulations and\nheavy subsidies.71 Yet in 1906 the American pork slaughterhouses were already operating at a\nferocious pace, enough to provoke Upton Sinclair's musing in The Jungle:\nOne could not stand and watch very long without becoming philosophical, without\nbeginning to deal in symbols and similes, and to hear the hog squeal of the universe. Was\n68 Theron O. Odlaug, Laboratory Anatomy of the Fetal Pig, Fourth Edition (Dubuque,\nIA: WM. C. Brown Company Publishers, 1969): p. 1.\n69 Theodore Adorno and Max Horkheimer, Dialectic of Enlightenment (Stanford:\nStanford University Press, 2004): p. 7.\n70 Ibid., 37.\n71 Mizelle, 77.\n\nBolman 20\nit permitted to believe that there was nowhere upon the earth, or above the earth, a heaven\nfor hogs, where they were requited for all this suffering?72\nThough Lane also lays out a series of potential disadvantages, they remain \"biological,\"\nrather than \"deal[ing] in symbols and similes\": the pigs become too mushy, their muscular\nsystems are strange, etc. Nonetheless, in Lane's calculations, \"The disadvantage is after all such\na minor one that it is far outweighed by the greater usefulness of the pig in all other aspects.\"73\nAfter noting a few spelling errors -- Lane finds Baumgartner's use of \"foeti\" instead of \"fetus\"\nproblematic both for the anachronicity of the \"oe\" and for its improper Latin pluralization (\"-i\"\ninstead of \"-us\") -- he concludes that \"Baumgartner... makes available for [comparative\nanatomy teacher's] use a form the availability of which has not been so widely realized as it\ndeserves.\"74 Though Lane saw Baumgartner's book primarily as a pedagogical advance, it was\nalso doing something much more significant: inaugurating and seizing a new space for the\n\"model\" pig in scientific discourse and scientific space.\nYet it went farther, because the existence of little pigs in dissection rooms was hardly a\nhistorical revelation, even if it had vanished in importance for a time. The growing utility of\neducational fetal pigs also plays an integral role in the conversion of pigs into scientific\ncommodities, where before there was mere cooperation between pig production companies and\nlaboratories. It is no wonder, as well, that multiple companies very quickly appear on the scene\nto profit from the distribution and marketing of \"fetal pigs\" as a product sold for dissection labs\n-- Nebraska Scientific, et al. The pigs were abundant, cheap, and easily handled, which meant\nthey were also easily circulated and sold, as well as easily inserted into already existent channels\nof scientific transfer. The \"waste\" of a rapidly expanding industry, rather than simply being\nthrown away, could be recycled and reintroduced back into chains of circulation. As James\nMiller writes in his section covering \"Why fetal pigs,\" \"Those that are not used for education\nwill be used for fertilizer production or discarded.\"75 And so, instead of being simply\n\"discarded,\" they could be re-marketed as educational products. This fits a much larger trend in\nthe development of markets in what Zygmunt Bauman has called \"liquid modernity,\" in which\n\"nothing dies, nothing disappears for good; no waste can be disposed of radically and\n72 Upton Sinclair, The Jungle (E-books Directory, 1906): unpaginated.\n73 Lane, 658.\n74 Ibid.\n75 Miller, \"Why fetal pigs.\"\n\nBolman 21\ncompletely, it can only be recycled.\"76 The \"fetal pig\" -- the commodity, not simply the body to\nbe dissected -- is the object by which industry continues to recycles its waste. \"Capital sees\nwaste as the final frontier for commodification,\"77 suggests Todd McGowan, and the fetal pig\nbecomes a converted waste-commodity in the \"unlimited\" quantities that Lane describes. The\n\"fetal pig\" is the final frontier for a carnivorous anatomy, the echoes of which we have traced at\nmultiple points in history. The edibility of pigs, their becoming-pork establishes a social world in\nwhich porcine mass production is an inevitability: that over-production inevitably produces its\nown excesses. And, reversing the previous statement, that excess would be impossible without\nthe over-production of pigs for consumption. With the \"fetal pig,\" porcine excesses could be\nutilized, continuing the cultural tendency to use as much of the pig as possible. Here,\nconsumption by mouths is offloaded to science by placing fetal pigs in explicitly anatomo\nscientific channels, re-branding those pigs. They will be used -- the only questions are by whom\nand for what? Yet even this re-commodification of porcine refuse necessarily entails its own\nwaste: after all, something has to be done with the dissected fetal pigs (bodies-without-organs,\nagain)... As Bauman says, \"recycling of waste is in itself a waste-producing process.\"78\nThe fetal pig was an important bridge between the pork industry and science, a\nconnection that would become more explicit later on. In fetal pigs, industrial trash became\nscientific treasure, commodified and marketed as an educational product. Thus, the \"fetal pig\"\nhelped ensure that biology classrooms around America would be places, not where the \"hog\nsqueal of the universe\" is finally heard, but where the cold bodies of porcine waste produced by\nan infinitely expanding industrial pork industry would be opened up to \"acquaint\" us with \"our\nown\" bodies.79 Because, after all, \"Most people do not think of pigs as 'pets'.\"80 If industrial\nproduction of pig bodies for science was a natural development from a sprawling industry, then\nwe might also not be surprised that the process would be inverted: the production of pig bodies\nfor science (and industry) by science itself.\nWe Have Never Been Sentimental\n76 Zygmunt Bauman, Forget Baudrillard? (New York: Routledge, 1993): p. 39.\n77 Todd McGowan, \"The Obsolescence of Mystery and the Accumulation of Waste in\nDon DeLillo's Underworld.\" Critique: Studies in Contemporary Fiction 46, no. 2 (2005): 123-\n145.\n78 Bauman, 39.\n79 Odlaug, 1.\n\nBolman 22\nDavid C. England spent World War II as a Naval pharmacist's mate in New Caledonia.81\nReturning to civilian life, he earned a bachelor's degree with distinction from Washington State\nand later M.S. and Ph.D. degrees, \"majoring in animal breeding and genetics\" at the University\nof Minnesota.82 England quickly became attached to the Hormel Institute at the University of\nMinnesota, Austin. His work at Hormel focused on the development of a new organism ideal for\nmedical research: the Minnesota Miniature Swine. The Minnesota minipig was one of the earliest\nminiature pigs designed explicitly for scientific inquiry. The minipig was a response to the\ngrowing realization, beginning roughly in the 1940s, that pigs were a useful object for scientific\ninquiry: \"The advantages of small pigs, [included] the ease of handling, the decreased\nrequirements for food and space, and the lower amounts of pharmacological products and\nanaesthetics needed in the studies...\"83 In a preliminary report announcing their progress in\nproducing such a creature, England and colleagues suggest that the \"specific objects\" of their\nproject are to \"produce\" a \"laboratory animal\" that is \"prolific and easily handled... which\nanatomically and physiologically closely resembles human beings.\"84 This \"laboratory animal\"\nwould ideally \"be susceptible to disease agents\" and would be \"useful in a wide variety of\nlaboratory research.\"85 The first successful Minnesota Miniature Swine created quite a stir, not\nsimply in the scientific world: the Hormel Institute earned a LIFE magazine article heralding this\npig breakthrough. The LIFE writers described minipigs as \"ideal for medical research.\"86\nMinipigs resolved a difficulty that regular swine presented to scientific research: though their\ninternal similarities to humans warranted medical consideration, handling a heavy pig was no\nsimple task for even well-equipped laboratories, especially because pigs were happiest and most\n80 Miller, \"Why fetal pigs.\"\n81 J. E. Oldfield, \"David C. England, 1922-2001: A brief biography\" American Society\nof Animal Science, April 20, 2001, http://www.asas.org/docs/publications/england.pdf?sfvrsn=0:\n1.\n82 Ibid., 1.\n83 Friederike Kohn, \"History and Development of Miniature, Micro- and Minipigs\" in\nThe Minipig in Biomedical Research: p. 6.\n84 David C England, Laurence M Winters, and Lawrence E Carpenter. \"The Development\nof a Breed of Miniature Swine -- a Preliminary Report.\" Growth 18 (1954): 207.\n85 Ibid.\n86 LIFE Magazine, \"Mini-pigs for biomedical research,\" November 29, 1954: p. 83.\n\nBolman 23\nstable in large social groups. Unlike \"the pig\" qua industrial stock, \"no matter how much corn he\neats the little pig above will never grow up to be a big hog.\"87\nThere was one further benefit to developing miniature pigs for scientific research rather\nthan dogs, monkeys, or other animals that shared anatomical and biological similarities to\nhumans. As the LIFE magazine author cheekily points out at the article's conclusion, \"practically\nnobody is sentimental about pigs.\"88 We have traversed nearly a thousand years of anatomical\ninvestigation of porcine bodies and, while many factors about that relationship changed, one\nthing remained relatively static, from Galen's insistence that pigs lacked the \"loathesomeness of\nexpression,\" to Lane's claim that pigs had \"no tender associations,\" and finally to LIFE\nmagazine's suggestion that \"nobody is sentimental about pigs.\" It seems, to remix slightly Bruno\nLatour's phrase,89 \"We have never been sentimental\" -- if \"we\" is understood to highlight a\nconnective tissue between these different moments in anatomical and biological history, rather\nthan to suggest they formed a cohesive, continuous narrative. And yet for many Americans, the\nidea that there is no sentimental relationship toward pigs would seem highly inaccurate: look at\nstate fairs, look at Babe! Or, perhaps, we might look at Arnold Ziffel.\nIntroduced in 1965 to the popular television situational comedy, Green Acres, Arnold\nZiffel is a highly intelligent pig who can do nearly anything that a human can: paint, play piano,\nwatch television, etc. Arnold, the boy pig, was likely played by a female pig. Female pigs were\nsmaller and tended to be slightly easier to manage. Arnold Ziffel captured the public's attention,\nwinning multiple awards for animal acting. He was the first pig to be centrally portrayed in a\nmass media venue such as this, and he was explicitly \"humanized\" throughout the run of Green\nAcres: much of the \"humor\" of Arnold Ziffel is the frequency with which he does things that\nonly humans can do, like joining the U.S. Army or delivering newspapers. The joke exists in the\nirony of the situation: the urbane spectator of a television drama in 1965, four years before\nOdlaug's lab manual, would have related to pigs mostly through their status as pork. And,\nindeed, despite his success, Arnold Ziffel could not escape the pull of becoming-pork. A popular\nrumor, denied by the show's producers and \"Arnold's\" trainer, during the height of Green Acres'\n87 Ibid.\n88 Ibid.\n89 Bruno Latour, We Have Never Been Modern (Cambridge: Harvard University Press,\n1993).\n\nBolman 24\npopularity was that the cast frequently dined on Arnold.90 Arnold was haunted by the cultural\nassociation of pigs and pork, of what I have called the \"edibility\" of pigs in the cultural\nimaginary. Indeed, \"One storyline had Arnold inheriting millions of dollars as the sole\ndescendant of the favorite pig of a pork-packing magnate, distinguished by his ability to predict\nthe weather with his tail.\"91 That a pork-packing magnate might possess a \"favorite pig\" plays on\nthe disposability that the majority of industrial pigs possessed then, and now. Upton Sinclair's\ndescription of the horrors of a mass production pork factory was hardly an isolated experience.\nThus, Arnold Ziffel possessed a paradoxical liminality similar to that of the dissected\nfetal pigs, but his was dramatized due to his explicitly humans behaviors and not simply his\ninternal biological makeup: Arnold was simultaneously a human-pig and pig-meat, two divergent\ntrajectories united in a single body. And Arnold's influence was not circumscribed to Green\nAcres. He would have a serious influence on the \"pigs\" that circulated in the American culture\nimaginary ever since: \"The 1995 theatrical film Gordy was originally conceived in the early\n1970s by Green Acres creator Jay Sommers and writer Dick Chevillat as a vehicle for the Arnold\nZiffel character.\"92 But Arnold's edibility and disposability, and that of the other famous pigs,\nwould never entirely escape them. That Porky, the most famous cartoon pig, possesses a named\nderived explicitly for his relationship to pig consumption is unsurprising, regardless of, and\nperhaps even due to, his popularity. But despite their humanization and their favor in the cultural\neye, pigs could not escape their connections to mass, industrial availability, to their becoming-\npork. That Wilbur and Babe, two of literature's most famous and adored pigs were both saved\nfrom slaughter confirms this connection. The famous pigs were saved from the inevitable course\nof their lives, their becoming-pork\nIn Quentin Tarantino's Pulp Fiction, Vincent and Jules debate why Jules refuses to eat\nbacon. As Jules says, \"Pigs are filthy animals. I don't eat filthy animals.\" Vincent retorts that\ndogs are also filthy animals, \"But,\" Jules declares, \"a dog's got personality. Personality goes a\nlong way.\"\n90 see Snopes, \"Pork and Screens\" http://www.snopes.com/radiotv/tv/ziffel.asp (accessed\nMay 15, 2013). Similar rumors would emerge about Babe.\n91 see Wikipedia, \"Arnold Ziffel,\" Wikipedia, The Free Encyclopedia,\nhttp://en.wikipedia.org/w/index.php?title=Arnold_Ziffel&oldid=514872670 (accessed May 15,\n2013).\n92 Ibid.\n\nBolman 25\nVincent: \"Ah, so by that rationale, if a pig had a better personality, he would cease to be a\nfilthy animal. Is that true?\"\nJules: \"Well we'd have to be talkin' about one charming motherfuckin' pig. I mean he'd\nhave to be ten times more charmin' than that Arnold on Green Acres, you know what I'm\nsayin'?\"93\nTen times more charming than Arnold, the pig would have to essentially be human to\nescape its connotations of filth and disposability, its status as trash. But how do these cultural\npigs connect to the laboratory ones that we have focused on? More obviously than expected, the\nanswer is Arnold Ziffel, who was \"perhaps The [Hormel] Institute's most famous contribution\":\nthe Institute provided all of the pigs who would cycle through roles as Arnold Ziffel.94 The\n\"type\" of pig used for Arnold is difficult to discover, even from the various Green Acres fan sites\nscattered around the net, but there is one highly likely answer: the Hormel Institute donated extra\nyoung pigs that its research did not require. The Institute would have possessed a series of\ndifferent kinds of pigs for its porcine research generally, but particularly because the minipig\nresearch required multiple different species of swine that could be combined together to create an\nartificially smaller organism.95 Thus, this time the excesses of science made their way back into\nthe public and into industry (the culture one): Adorno's \"mere exemplars\" became, temporarily,\ntrue \"representatives.\" And the \"minipig\" was, from its beginnings, connected to industry-\nfocused research carried out by the Hormel Institute. As England writes about the initial\nminiature swine research, \"This project is envisioned as a further test of the effectiveness of the\nflexible systems of inbreeding and selection used in producing the Minnesota No. 1 and\nMinnesota No. 2 breeds of ordinary-sized swine.\"96 The Minnesota No. 1 and No. 2 pigs were\ncelebrated a mere five years before for \"revolutioniz[ing] the whole pig business, applying\nscientific methods over a long period of years... They've produced one complete new\nstreamlined brand of swins (sic)...\"97\n93 Samuel Jackson and John Travolta, Pulp Fiction, Film, directed by Quentin Tarantino\n(1994; USA: A Band Apart.), Blu-Ray.\n94 Ann M. Bode, \"In Pursuit of a Cure: Searching for Food-Based Cancer Therapies and\nPreventions at The Hormel Institute,\" Rural Minnesota Journal, Vol. 4 (2009): p. 109.\n95 England et al., 207.\n96 Ibid.\n97 Reading Eagle, \"Streamlined Pigs Are Produced By Applying Scientific Methods,\"\nAugust 15, 1949: online.\n\nBolman 26\nA frequent suggestion by those who study pigs is that people do not really understand\n\"what pigs are\": we think of the light pink, chubby and cute farm creatures like Babe or Arnold\nrather than the vast variety of pigs that exist around the globe. One result of the above discussion\nseems inescapable, however, and it is this: science played an integral role in shaping what sorts\nof pigs Americans think of when they think of pigs. Science provided exemplars: Arnold was a\nfamous one, but so too was \"Pig No. 311,\" the miraculous survivor of United States military\nradiation testing.98 And though funding for Hormel Institute's minipig research would eventually\ndry up, \"Dr. Tumbleson of the Sinclair Comparative Medicine Research Farm\" would acquire a\nbreeding stock and take it elsewhere: the Minnesota Miniature Swine was relocated and re\nnamed the Sinclair Miniature Swine in Missouri. This Minnesota pig became the \"foundation\"\nline for the \"Nebraska, Gottingen, FDA Hormel-Hanford, NIH Minipig, [and] Minipig of Czech\nRepublic.\"99 The Hanford minipig, developed in Washington at the Hanford National\nLaboratory, close to where David. C. England had relocated after his work in Minnesota, would\nbe central to a series of studies by the National Institute of Health and radiological studies by the\nAtomic Energy Commission.100 England, who was one of the more famous experts on the\nscience of minipigs, served as president of the Western Section of the American Society of\nAnimal Science in 1975 and was well regarded for his expertise -- even by \"the Oregon Pork\nProducers' Association, which honored him with its distinguished service award.\"101 L. M.\nWinters, co-author on England's minipigs paper, was recognized by \"the Federal Reserve Bank\nof Minneapolis\" for these wondrous new swine. Winters, for his part, argued that \"this was and\nis a research project... not a demonstration nor a promotion,\"102 but back in 1924, when the\nproject began, he did not hesitate to suggest that the goal of this research was to improve the\n\"merit of the product.\"103 The \"merit\" was great, because No. 1 hogs contained a \"larger\nproportion of the higher-priced cuts of meat\" than any of their \"natural\" predecessors, which\npackers \"praised.\"104 The doorway between pork and scientific pigs, it seems, remained open.\n98 \"This Little Pig Came Home.\" Time, April 11, 1949.\n99 The Minipig in Biomedical Research\n100 Kohn, 10.\n101 Oldfield, 1.\n102 Reading Eagle, online.\n103 Ibid.\n104 Ibid.\n\nBolman 27\nThe minipig was perfect for science because of its similarity to humans while avoiding\nthe \"sentimentality\" that companion animals in lab settings, like dogs or monkeys, could\nprovoke. As two scientists at the Gottingen Minipig laboratory write recently, there is an\n\"ethical\" benefit to using pigs -- specifically minipigs -- as medical models because \"the use of\nnon-rodent species as primates and dogs in biomedical research is confronted with an increasing\nresistance from society. The pig is an advantageous alternative species, since it is accepted by\nsociety as a production animal and thus has a lower emotional merit.\"105 [Emphasis mine] We\nhave seen this logic repeated throughout, but what this paper has articulated as well, I hope, is\nthe growing explicitness with which the production imperative of the industrial pork industry\njustified the scientific use of medical pigs and the increasing ability of science to produce, as\nwell, its own supply of porcine bodies, tailored to specific experimental pursuits. Bollen and\nEllegaard's rhetoric here is an especially sanitized version of what we have seen up to this point:\nthe pig now simply does not \"deserve\" emotional response as much. With the minipig, the\nexplicit meddling in pig genetics and anatomy becomes a scientific standard, which is \"ethically\"\nacceptable because of pigs' \"lower emotional merit.\" Scientists can ethically meddle with pigs\nhowever they want. And thus, when Bendixen and colleagues write in 2010 about the massive\nindustrial availability of the scientific porcine standing reserve waiting to be converted into the\nnew medical model for human diseases of various sorts, we are, at this point, rather desensitized\nto such scientific rhetoric.\nIf minipigs seemed to transition logically into the medical models that pigs are\nincreasingly projected to become, that projection is marked by hesitations and uncertainties\nabout how similar pigs really are to humans. Scientific research on pigs is growing in popularity,\nparticularly in the United States, where \"NIH-sponsored research (over 20 institutes and centers)\nsupported over 2,500 separate grants using the pig.\"106 One central area of this research is in\norgan transplantation of pig organs into human bodies, in part as a response to the growing\n\"crisis\" in organ availability and the neoliberal need for fresh markets of organs.107 As Nancy\n105 Peter Bollen and Lars Ellegaard, \"The Gottingen Minipig in Pharmacology and\nToxicology,\" Pharmacology & Toxicology, Vol. 80, Issue Supplement s2 (1997): p. 3.\n106 Beattie et al., \"Swine in Biomedical Research: Creating The Building Blocks Of\nAnimal Models,\" Animal Biotechnology, Vol. 16 (2005): p. 184.\n107 Nancy Scheper-Hughes. \"The Last Commodity: Post-Human Ethics and the Global\nTraffic in 'Fresh' Organs.\" 1-14, Blackwell Publishing (2005): 150.\n\nBolman 28\nScheper-Hughes has pointed out, \"A new source of organ scarcity is, however, being socially\nproduced by the artificial expansion of organs waiting lists in North America and Europe\" which\nare \"inflating the demand for organs and promoting desperate means to obtain them.\"108 One\npossible answer to the growth of \"organ tourism\" and what Scheper-Hughes calls \"grey\" markets\nfor organs is, from the mouth of the medical community itself, the possibility of harvesting\norgans from pigs. \"In the 10 years that have elapsed since the previous Swine in Biomedical\nScience Conference,\" announces Beattie and his colleagues, \"tremendous technological advances\nnow support xenotransplantation of pig organs into humans.\"109 If Scheper-Hughes worries that\nthe artificially constructed \"waiting lists\" are pushing to more desperate forms of human\nharvesting, they are equally propping up efforts by scientists to convert pigs into suitable bodies\nfor organ harvesting. The porcine body \"remains the front-runner as a potential xenobiotic source\nof many organs, while thousands of patients die each year in this country waiting for a\nhistocompatible donor.\"110 Even the conventionally conservative Vatican has thrown limited\nsupport behind xenotransplantation -- particularly from porcine donors.111\nThe problem, however, is not as simple as acquiring the pigs. Both \"cloned pigs\" and\n\"miniature pigs\" are widely available, and the development of the minipig and the increasing\ninterest in pigs as a site for xenotransplantation of organs into human bodies are intricately\nrelated issues, as a conference presentation in 2005 suggested. The presentation demonstrated\n\"how difficult it is to separate the development of pig lines for xenotransplantation without\nconsidering the remarkable progress made in genetic modification and cloning of pigs.\"112 The\nproduction of large quantities of model pigs produced not simply an available stock of porcine\nmodels, but a knowledge base about pigs in general that has produced essential for the\ndevelopment of xenotransplantation. Even with this knowledge, Jeffery Sachs and his colleagues\nat Harvard have only very recently managed to extend \"the functional viability of pig xenografts\nin baboons beyond two months.\"113 A complete and successful organ transplant between a\nhuman and pig remains, for the moment, out of sight, with a disturbing history of failures\n108 Ibid., 154.\n109 Beattie et al., 187.\n110 Ibid.\n111 Basil Cole, \"\"Prospects for Xenotransplantation\": A Brief Overview,\" The National\nCatholic Bioethics Quarterly, Volume 2, Number 3 (2002): 391 - 397.\n112 Beattie et al., 187.\n\nBolman 29\nhaunting any future progress: a failed heart transplant into a small child known as \"Baby Fae\" in\n1984, a failed heart transplant by a Polish doctor in 1992.114 As a United Kingdom\nXenotransplantation Regulatory Authority report in 2001 argued, \"on the basis of current\nevidence, whole-organ xenotransplantation, as a solution to the ongoing shortage of organs for\ntransplant, appears to be some way off.\"115\nBeyond simply getting the pigs, one has to effectively \"humanize\" and \"de-pig\" the pig,\nand it is this step which has managed to so far baffle xenotransplantation scientists. The process\nrequires creating \"knockout\" organs where certain genes that might otherwise signal the\n\"porcinity\" of the organ are removed. The central question of organ transplantation is \"avoidance\nof organ rejection,\" and the solution is \"to humanize pig organs ... by genetic modifications.\"116\nScientists have even managed to create pigs \"with multiple genetic modifications, i.e. more than\none gene knocked out.\"117 How many genes have to be knocked out? How many can be? The\nspecter haunting these questions of transplant effectiveness is chimerism: the chimera, the \"fire\nbreathing female monster with a lion's head, a goat's body, and a serpent's tail,\"118 as well as\nchimerism, proper, the genetic state of possessing two genetically distinct cells. The organ\ntransplant surgeon and scientist must understand his very work as chimeric and the experience of\nreceiving such a transplant would surely, also, be a type of chimerism.119 To create organ\n\"tolerance\" requires the creation of chimeras.120 As Jean-Luc Nancy wrote, discussing his own\nheart surgery, the experience of chimerism \"resides in a double strangeness\" with \"this grafted\nheart, which the organism identifies and attacks as being a stranger, and... the state in which\nmedication renders the graftee in order to protect him.... It thereby makes him a stranger to\n113 Ibid., 186.\n114 PBS Frontline, \"A History of Xeno Experiments,\"\nhttp://www.pbs.org/wgbh/pages/frontline/shows/organfarm/etc/cron.html.\n115 Ibid.\n116 Bendixen et al., 214.\n117 Ibid.\n118 New Oxford American Dictionary, \"Chimera.\"\n119 Starzl, Thomas E, Anthony J Demetris, Noriko Murase, Luis Valdivia, Angus W\nThomson, John Fung, and Abdul S Rao. \"The Future of Transplantation: with Particular\nReference to Chimerism and Xenotransplantation.\" Transplant Proc. 29, no. 1 (1997): 19-27.\n120 Yamada et al., \"Pigs as Xenogeneic Donors.\" Transplantation Reviews 19, no. 3 (June\n2005): 174. doi:10.1016/j.trre.2005.10.004.\n\nBolman 30\nhimself, to this immunitary identity, which is akin to his physiological signature.\"121 And yet this\n\"strangeness\" is only in the context of a strange human heart in a strange human body. What\ndoes receiving the heart of a porcine being do? As Yamada and colleagues caution,\n\"Psychosocially, the patients would have to have the support necessary and be sufficiently\nresponsible to handle the required immunosuppressive regimen.... they should receive\ncounseling regarding any emotional issues that develop as a result of receiving xenogeneic\norgans.\"122\nThis process of \"humanizing\" or \"de-pigging\" pig organs sits uneasily as the apotheosis\nof the porcine conversion to \"organs-without-bodies\": humanizing the pig removes from the pig\neven the genetic indicators of its porcine status; the skin, I have already suggested, was done\naway with long ago. What, then, are these \"knockout\" minipigs walking around scientific\nlaboratories, the stepping stones toward an infinite organ bank to fill our drastically growing\nneed? The same pig bodies with different organs, or completely different bodies? \"Even when\ntaken as a body without organs,\" writes Jean-Luc Nancy, the body \"still has a hundred organs,\neach of which pulls and disorganizes the whole, which can no longer manage to be totalized.\"123\nThe de-pigging of pigs, the humanizing of pigs, the pigging of humans: clearly all of these mark\na scientific (non)realization that the body \"can no longer manage to be totalized,\" with organs of\nall kinds moving, straining, pulling in so many different directions. The problem, scientifically,\nwith xenotransplantation is that pig organs pull elsewhere than human organs, that human organs\npush away pig organs: the failures of xenotransplantation were violent realizations of the non-\ntotality of the body. The chimera falls apart at its seams, like the body of a poorly sewn cloth\ndoll, which was never as well tied as centuries of discourses on the body would have us believe.\nIn the haphazard circulation of organs between bodies, \"Man becomes what he is: the most\nterrifying and the most troubling technician... who denatures and remakes nature, who recreates\ncreation, who brings it out of nothing and, perhaps, leads it back to nothing. One capable of\norigin and end.\"124\n121 Jean-Luc Nancy, \"The Intruder\" in Corpus (New York: Fordham University Press,\n2008): p. 167.\n122 Yamada et al., 173.\n123 Jean-Luc Nancy, \"Fifty-eight Indices on the Body,\" in Corpus (New York: Fordham\nUniversity Press, 2008): p. 155.\n124 Nancy, \"Intruder,\" 170.\n\nBolman 31\nIs the transplanted pig organ, assuming it could avoid rejection by the \"human\" body, still\nporcine? What is the status of \"human\" bodies that, according to the more optimistic\nxenotransplantation scientists, will be increasingly full of these \"knockout\" organs? Do porcine\nxenotransplants de-pig the pig or re-pig the human? In part due to xenotransplantation,\nsomething like Donna Haraway's \"cyborg\" is increasingly coming to mark the horizon of what\nthe human could and will become: a type of organ \"vampirism\" making use of a standing reserve\nof pig bodies that has always been there, waiting for new scientific uses to direct it.125\nXenotransplantation is still a consumption of pig parts but one with a different mode of\ningestion. While becoming-pork defined pig bodies, allowing certain offshoots to \"escape\" into\nscientific laboratories, and while it may still circumscribe the telos of pig life in the cultural\nimaginary -- in the life of nearly every famous pig, the only end is the human dinner plate, with\nAlfred Ziffel remaining exempt -- there is increasingly, as well, a populations of pigs that are\never more perfect organs-without-bodies. And this population is losing the genetic \"definition\"\nof its porcinity, as the pig genome is cracked and \"read\" in order to be better subverted.126 But to\n\"knockout\" certain genetic information is, in some sense, akin to Robert Rauschenberg's \"Erased\nde Kooning\": something remains behind, a trace of the previous state, and the frame and\ntrimmings gesture toward that previous existence. There is still a \"porcinity\" to the pig which\ncannot be humanized, a fugitivity the constantly strains against all attempts to knock it out.\nWhen we see a minipig, one cannot help but think of Babe and Alfred, and of Porky too: of a\nfugitive sentimentality that never quite disappeared. There is still something piggish about\nknockout pigs. And rather than view this relationship in the uni-directional mode that this essay\nhas so far presented it, we could say that pigs have been infecting us, affecting us in ways that\nare becoming clear in the inability to make pigs work for humans as the sites of organ harvesting.\nWhen pig organs fight back against human bodies by refusing their assimilation: insisting on\nremaining strangers. Consumption of pigs has shaped the history of anatomy and biology in\nprofound ways, which has been a central point of this essay, and pigs have played a central role\nas both objects and subjects of that carnivorous science. Their \"edibility\" made them not simply\n125 Donna Haraway, \"Universal Donors in a Vampire Culture: It's All in the Family:\nBiological Kinship Categories in the Twentieth-Century United States.\" In Uncommon Ground,\n1-24, 1996.\n126 Lily E. Kay, \"In the Beginning Was the Word? the Genetic Code and the Book of\nLife,\" in The Science Studies Reader (New York: Routledge, 2006): pp. 224-233.\n\nBolman 32\nobjects of scientific inquiry, but agents that science had to enlist for best results. This is perhaps\nbecoming increasingly clear in recent scientific realizations that experimental subjects need\ncomfortable, social lives -- the Gottingen labs promise that their pigs get to play with toys -- in\norder to produce the best experimental results. If pigs in some sense chose domestication, they\nhave also forced the scientist's hand in how their scientific habitats would be constructed.\nIn his first published short story, \"Beyond Lies the Wub,\" Philip K Dick tells of a\nspaceship crew that takes aboard an alien, pig-like creature called a \"wub.\" The captain of the\nship is diverted from his original plan to cook the wub by a sudden discovery: not only can the\nwub speak, but it can read human minds. In response, the wub suggests, \"You spoke of dining on\nme. The taste, I am told, is good. A little fatty, but tender. But how can any lasting contact be\nestablished between your people and mine if you resort to such barbaric attitudes? Eat me?\nRather you should discuss questions with me, philosophy, the arts--\"127 The captain refuses, but\none of the other men aboard the ship discusses philosophy with the wub, specifically the myth of\nOdysseus. The wub finds \"in your Odysseus a figure common to the mythology of most self-\nconscious races,\" but before he explain much farther, the captain interrupts: the wub will be\neaten and even the sympathetic members of the crew make only subtle pleas over licked lips. As\nthe wub muses, moments before its corporeal demise, \"Apparently, your scientific hierarchy is\nnot equipped to solve moral, ethical--,\" but it is once again cut off before concluding the\nthought. The supposedly \"higher\" human beings are utterly incapable of appreciating the depth\nof intellectual capacity -- and similarity -- between the wub and the humans, even as the raw\ncapacity of their scientific prowess increases. And this situation mirrors, almost precisely, the\none that pigs seem to find themselves in today: even as humans increasingly understand porcine\ncognitive and social capacities to be higher than ever expected, pigs are restricted due to their\nedibility, their becoming-pork. After the wub is murdered, the narrator notes that \"The taste was\nexcellent.\"128 After the wub is consumed, the captain turns to Peterson, the crew-member who\nconversed with the wub about philosophy, and begins, \"As I was saying before I was interrupted,\nthe role of Odysseus in the myths...\" The wub, rather than simply being consumed,\ncommandeers something in the mind of the captain for itself.\n127 Philip K. Dick, \"Beyond Lies the Wub,\" in Planet Stories (Project Gutenberg, 1952,\n2009): http://www.gutenberg.org/files/28554/28554-h/28554-h.htm.\n128 Ibid.\n\nBolman 33\nWhat Dick's story points out is the profound capacity for eating to transform both the\nconsumer and the animal/object of consumption. Peter Sloterdijk has noted the importance of not\nsimply what is consumed but of where humans are positioned in the consumptive act. For\nSloterdijk, \"all oral truth is based on the differentiation of tables. In order to be adequately\ncomplete human beings, we must learn at which tables we are the eaters and at which we become\nthe eaten. The tables at which we eat are called dining tables; those at which we are eaten are\ncalled altars.\"129 In the pig-human relationship, the situation has been maintained at relatively\nstable levels: pigs go on dining tables, on altars; humans sit at dining tables, sacrifice pigs at\naltars. Pigs get their revenge each year when an unlucky farmer stumbles in his pig sty. With the\nwub, ithe \"dining table\" qua decider of human adequacy is frustrated: the wub consumes the\nmind of the captain, even as its body is digested. Pigs have, in many ways, formed a hegemonic\ngrasp over human minds through a long history of interaction, and a major part of that has\noccurred on a different sort of table: the anatomo-surgical one.\nWe can plot a provisional end to this expedition, which has already generated more leads,\nmore lines of flight, than it could possibly follow, with Yann Martel's short story, \"We Ate the\nChildren Last.\" More clearly than almost any theoretical or scientific texts, Martel places on the\ntable the conceptual ambiguities and psychic disturbances that xenotransplantation brings, while\nuniting the themes that this essay has engaged with. \"We Ate the Children Last\" begins with the\nfirst successful transfer of a pig organ into a man suffering from severe colon cancer. Despite all\nodds, \"His recovery was astounding. Two days after the operation, he ate six lunch meals in one\nsitting.\"130 His French doctors celebrate: the first successful xenotransplant used the digestive\norgans of the pig and placed them into the man. And not only did he survive, but his condition\nimproved miraculously. There was one, however, side-effect: \"Patient D rapidly came to dislike\nsweet dishes, then spicy ones, then cooked food altogether.\" Though his health improved, the\nlater checkups by doctors and nurses found that the man, Patient D, now kept no food in his\napartment and preferred to scavenge each night for the garbage surrounding his apartment. This\ntransplant recipient, like the pigs who \"donated\" organs to him, becomes a vigorous consumer of\ngarbage. The xenotransplant soon extends beyond its medical uses and becomes the new \"chic\"\n129 Peter Sloterdijk, Bubbles (New York: Semiotext(e), 2012): 523.\n130 Yann Martel, \"We Ate the Children Last,\" July 16, 2004:\nhttp://www.guardian.co.uk/books/2004/jul/17/originalwriting.fiction4.\n\nBolman 34\nform of life-improving surgery, with \"the young and the bohemian, the chic and the radical,\namong all those who wanted a change in their lives.\"131 The social effects of its growing\npopularization are astounding, but:\nLittle was made at the time of a report by the Societe protectrice des animaux on the\nsurprising drop in the number of stray cats and dogs. Garbage became a sought-after\ncommodity. Unscrupulous racketeers began selling it. Dumps became dangerous places.\nGarbage collectors were assaulted. The less fortunate resorted to eating grass.... Then old\npeople began vanishing without a trace. Mothers who had turned away momentarily were\nfinding their baby carriages empty.132\nThese \"new\" humans, powered by the \"Ferrari engine\" digestive tracts of their pig\nbrethren, retain all the semblances of their \"humanity\" but gain the porcine drive for\nconsumption. They cannot stop eating trash, they will eat grass, and more importantly than either\nof those transformations: they will eat each other. The government reacts quickly, killing many\nof the individuals who receive the surgery and placing the rest into internment camps. In these\ncamps, there is no need to feed the inhabitants, because \"first the detainees ate their clothes and\nwent naked. Then the weaker men and women disappeared. Then the rest of the women. Then\nmore of the men. Then we ate those we loved most.\" Of all those who received the surgery, a\nsingle man was left, \"an exceptional brute by the name of Jean Proti,\" who survives for forty-one\ndays \"without a morsel of food except his own toes and ears.\" Finally, \"after 30 hours of\nincessant screaming, he died.\"133 If only Galen had been present to provide a lesson in\nvivisection...\nThe narrator of the story ends by claiming he \"escaped.\" What are we to make of this\nstrange tale? Pigs do not consume each other under normal conditions -- sometimes deceased\ncorpses fall victim to consumption -- so it would be incorrect to simply say the humans acquired\nporcine manners of consumption. At one level, Martel's story plays on the deep concern that\nexists about the \"confusion\" of the \"species barrier\" that xenotransplantation might create: what\nif humans became like pigs? What if new organs in strange places made us less recognizable to\nourselves? Yet Martel's point is not simply one about the strangeness of combining pigs and\nhumans together. The fundamental truth of the story is that shifts in human consumption have the\ndramatic power to transform the entire social life of the human species: in many ways, the gut\n131 Ibid.\n132 Ibid.\n\nBolman 35\ndetermines our ethical sensibilities. When the \"xeno\" -- the truly \"foreign,\" the wholly other134\n-- organ is transplanted into human bodies, it is not simply rejected: it takes over, rendering\nconventional notions of ethicality and morality void. Our representations of the world are\ndestabilized and the world of commodities is thrown upside down: garbage becomes \"a sought-\nafter commodity\" rather than a scourge, then old people \"began vanishing without a trace,\" until\nfinally \"we ate the children last.\" The xenotransplantation effects an instability in the particular\nmode of world-formation that occurs due to consumption and absorption, that same manner of\nworld-formation that has for centuries driven a relationship to pigs due to their becoming-pork,\ntheir edibility. And it would be wrong to underestimate the power of these consumptive shifts\nbecause, as Sloterdijk also argues, \"The field of absorption-based truths is of fundamental\nsignificance for the construction of human reason because it is precisely there that the essential\ndistinction between true and false comes into effect.\"135 After all, more than in even in the world-\nformation created by representation, \"the false ultimately brings death; that which enables and\nextends life, on the other hand, can be considered the true.\"136\nYet if the inclusion of the pig organ into the human is the cause of this cannibalistic\nviolence, surely Martel's point is that the \"human\" way of eating produces a certain, valuable\nzero-level of ethical stability? The conclusion of the story contradicts this, as the one who\n\"escaped\" notes that \"I still have a good appetite, but there is a moral rot in this country that even\nI can't digest.\"137 This moral rot is left unexplained, unnamed, but the recipients of the transplant\nhave all disappeared so it cannot reside there. Instead, \"Everyone knew what happened, and how\nand where... But no one talks about it and no one is guilty.\"138 What is this taboo subject? The\nanswer, I think, is articulated by Galen, of all people, in his text on the Powers of Foods: \"The\nsimilarity between the flesh of man and pig in taste and smell has been observed when certain\npeople have eaten unawares human meat instead of pork. Such incidents perpetrated by\nunscrupulous restaurateurs and other such people have been witnessed in the past.\"139 The\nxenotransplantation surgery forces a simple, brutal realization: that the consumption of pigs upon\n133 Ibid.\n134 Jacques Derrida, The Gift of Death (Chicago: University Of Chicago Press, 2007).\n135 Sloterdijk, 523-523.\n136 Ibid., 523.\n137 Martel, \"Children.\"\n138 Ibid.\n\nBolman 36\nwhich so much of Western society and knowledge was built relies on a carnivorous distinction\nthat could, at any moment, have dissolved into cannibalism; that eating pigs was never so\ndifferent from eating humans; and that cutting open pigs to learn about humans is not so different\nfrom cutting open humans to learn about pigs (the latter is, ironically, what happens in Martel's\nstory). It is not that the humans of Martel's tale become like pigs: they treat each other as\nhumans have always treated pigs. Wubs and biomedical pigs find a queer (a swined) revenge.\nCould a vegetarian Galen be imagined and re-inserted back into history? Anatomical\nknowledge may have proceeded along the same lines. A vegetarian anatomy, a science with\nradically agnostic relationships to porcine tests, and a world without pig organ farms: are these\neven imaginable today? This paper cannot answer those questions. Instead, it has watched pigs\nfloat by humans in rivers of all kinds, into and outside of the \"human body.\" It has tried, if not to\nsave those floating pigs, at least to talk about them. To render them, momentarily, difficult to\nchew.\n139 Galen, Powers of Foods: Book 3, 155.\n\nBolman 37\nNotes\n\nBolman 38\nWorks Cited\nAdamson, Melitta Weiss, Food In Medieval Times, Greenwood, 2004.\nAngier, Natalie. \"Pigs Prove to Be Smart, if Not Vain,\" November 9, 2009,\nhttp://www.nytimes.com/2009/11/10/science/10angier.html.\nAnonymous (Salerno School). George W. Corner trans., \"The Anatomy of the Pig,\"\nhttp://wb.westernstandard.com/nxt/gateway.dll/sc/scgs/0002%20a%20source%20book%20in%2\n0medieval%20science/010002-00099.xml?fn=document-frame.htm$f=templates$3.0.\nBauman, Zygmunt, \"The Sweet Scent of Decomposition\" in Forget Baudrillard?\nRoutledge. New York, 1993.\nBendixen, Emøke, Marianne Danielsen, Knud Larsen, and Christian Bendixen.\n\"Advances in Porcine Genomics and Proteomics - a Toolbox for Developing the Pig as a Model\nOrganism for Molecular Biomedical Research.\" Informational Genomics 9, no. 3 (2010).\nBode, Ann M. \"In Pursuit of a Cure: Searching for Food-Based Cancer Therapies and\nPreventions at the Hormel Institute.\" Rural Minnesota Journal (August 4, 2009): 1-11.\nBollen, Peter, and Lars Ellegaard. \"The Gottingen Minipig in Pharmacology and\nToxicology.\" Pharmacology & Toxicology 80, no. 2 (1997): 3-4.\nCohen, Elizabeth S., and Thomas Vance Cohen, Daily Life in Renaissance Italy,\nGreenwood, 2001.\nDerrida, Jacques. The Gift of Death, University Of Chicago Press, 2007.\nDick, Philip K. \"Beyond Lies the Wub,\" in Planet Stories, Project Gutenberg, 1952,\n2009: http://www.gutenberg.org/files/28554/28554-h/28554-h.htm.\nEdwards, H W. \"A Look Into One's Eye.\" School Science and Mathematics (1923).\nEngland, David C, Laurence M Winters, and Lawrence E Carpenter. \"The Development\nof a Breed of Miniature Swine -- a Preliminary Report.\" Growth 18 (1954): 207-214.\nFerraris, Zoe Alaina, and Victor A. Ferraris, \"The Women of Salerno: Contribution to the\nOrigins of Surgery From Medieval Italy,\" Ann Thorac Surg, 64 (1997).\nGalen. Duckworth WLH, trans. On anatomical procedures, the later books, Cambridge\nUniversity Press, 1962.\nGalen. On Diseases and Symptoms. Translated by Ian Johnston, Cambridge University\nPress, 2006.\nGrant, Mark. Galen on Food and Diet, Routledge, 2002.\n\nBolman 39\nGross, Charles G. \"Galen and the Squealing Pig.\" The Neuroscientist 4, no. 3 (1998):\n216-221.\nHaraway, Donna. \"Universal Donors in a Vampire Culture: It's All in the Family:\nBiological Kinship Categories in the Twentieth-Century United States.\" In Uncommon Ground,\n1-24, 1996.\nHeidegger, Martin. \"The Question Concerning Technology\" in Basic Writings, Harper\nPerennial, 2008.\nHelmreich, Stefan. Alien Ocean, University of California Press, 2009.\nHorkheimer, Max, and Theodor W Adorno. Dialectic of Enlightenment, Stanford\nUniversity Press, 2002.\nHughes, J Donald. \"Europe as Consumer of Exotic Biodiversity: Greek and Roman\nTimes.\" Landscape Research 28, no. 1 (January 2003): 21-31. doi:10.1080/01426390306535.\nJanson, H W. \"Titian's Laocoon Caricature and the Vesalian-Galenist Controversy.\" The\nArt Bulletin 28, no. 1 (March 1946): 49-53.\nKirksey, S Eben, and Stefan Helmreich. \"The Emergence of Multispecies Ethnography.\"\nCultural Anthropology 25, no. 4 (October 13, 2010): 545-576. doi:10.1111/j.1548\n1360.2010.01069.x.\nKohn, Friederike. \"History and Development of Miniature, Micro- and Minipigs\" in The\nMinipig in Biomedical Research, CRC Press, 2011.\nLane, H H. \"Laboratory Manual of the Foetal Pig by W. J. Baumgartner.\" Science 61, no.\n1591 (June 26, 1925): 658-659.\nLatour, Bruno. We Have Never Been Modern. Harvard University Press. 1993.\nLIFE Magazine, \"Mini-pigs for biomedical research,\" November 29, 1954: p. 83.\nMacKinney, Loren C. \"The Beginnings of Western Scientific Anatomy: New Evidence\nand a Revision in Interpretation of Mondeville's Role.\" Medical History 6, no. 3 (1962): 233.\nMacKinnon, Michael. \"High on the Hog: Linking Zooarchaeological, Literary, and\nArtistic Data for Pig Breeds in Roman Italy.\" American Journal of Archaeology (2001): 649-\n673.\nMall, Franklin P. \"On the Teaching of Anatomy.\" The Anatomical Record 2, no. 8\n(November 1908): 1-23.\n\nBolman 40\nMartel, Yann. \"We Ate the Children Last,\" July 16, 2004:\nhttp://www.guardian.co.uk/books/2004/jul/17/originalwriting.fiction4.\nMcGowan, Todd. \"The Obsolescence of Mystery and the Accumulation of Waste in Don\nDeLillo's Underworld.\" Critique: Studies in Contemporary Fiction 46, no. 2 (2005): 123-145.\nMiller, James. \"Why fetal pigs are good dissection specimens,\" 1997:\nhttp://www.goshen.edu/bio/pigbook/dissectionadvantages.html.\nMizelle, Brett. Pigs, Reaktion, 2011.\nMoten, Fred, and the Octopus. \"The Insurgency of Objects,\" 0123468957, November 7,\n2005.\nNancy, Jean-Luc, and Michael Naas. Corpus, Fordham Univ Press, 2009.\nNebraska Scientific, \"Everything You Wanted to Know About Fetal Pigs... But Didn't\nKnow Who to Ask,\" no date. http://www.nebraskascientific.com/wfdata/frame2200\n1252/File3.pdf.\nOdlaug, Theron O. \"Laboratory Anatomy of the Fetal Pig,\" Fourth Edition, WM. C.\nBrown Company Publishers, 1969.\nOldfield, J. E. \"David C. England, 1922-2001: A brief biography\" American Society of\nAnimal Science, April 20, 2001: http://www.asas.org/docs/publications/england.pdf?sfvrsn=0: 1.\nSawday, Jonathan. The Body Emblazoned: Dissection and the Human Body in\nRenaissance Culture, Routledge, 1997.\nScheper-Hughes, Nancy. \"The Last Commodity: Post-Human Ethics and the Global\nTraffic in 'Fresh' Organs.\" Blackwell Publishing, 2005.\nSchlich, Thomas, Eric Mykhalovskiy, and Melanie Rock. \"Animals in Surgery - Surgery\nin Animals: Nature and Culture in Animal-Human Relationship and Modern Surgery.\" Hist. Phil.\nLife Sci. 31 (2009): 1-35.\nSchook, Lawrence, Craig Beattie, Jonathan Beever, Sharon Donovan, Russell Jamison,\nFederico Zuckermann, Steven Niemi, Max Rothschild, Mark Rutherford, and Douglas Smith.\n\"Swine in Biomedical Research: Creating the Building Blocks of Animal Models.\" Animal\nBiotechnology 16, no. 2 (January 2005): 183-190. doi:10.1080/10495390500265034.\nSinclair, Upton. The Jungle, 1906.\nSiraisi, Nancy G. Medieval and Early Renaissance Medicine: an Introduction to\nKnowledge and Practice, University of Chicago Press, 1990.\n\nBolman 41\nSloterdijk, Peter. Bubbles, Semiotext(e), 2012.\nStarzl, Thomas E, Anthony J Demetris, Noriko Murase, Luis Valdivia, Angus W\nThomson, John Fung, and Abdul S Rao. \"The Future of Transplantation: with Particular\nReference to Chimerism and Xenotransplantation.\" Transplant Proc. 29, no. 1 (1997): 19-27.\nTarantino, Quentin. Pulp Fiction, Film, directed by Quentin Tarantino, 1994, Blu-Ray.\nVann, Mick. \"A History of Pigs in America,\" Austin Chronicle, April 10, 2009:\nhttp://www.austinchronicle.com/food/2009-04-10/764573/.\nYamada, Kazuhiko, Adam Griesemer, and Masayoshi Okumi. \"Pigs as Xenogeneic\nDonors.\" Transplantation Reviews 19, no. 3 (June 2005): 164-177.\ndoi:10.1016/j.trre.2005.10.004.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nSTS.330 / HS.246 / 21A.319 History and Anthropology of Medicine and Biology\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}