{
  "course_name": "History and Philosophy of Mechanics: Newton's Principia Mathematica",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "History",
    "History of Science and Technology",
    "Intellectual History",
    "Philosophy",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Intellectual History",
    "Philosophy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nOverview\n\nThe heart of this course will be a close reading of key sections of Newton's\nPrincipia Mathematica Philosophiae Naturalis\n(first published 1687; 3rd edition 1726). Newton's\nPrincipia\nhas been aptly described as \"the most unread famous book in the Western world.\" It's publication in 1687 marks that seminal moment in the history of Western thought when the work of the greatest scientists became too difficult for the greatest philosophers to understand on their own. (John Locke, for one, had to be reassured by his friend Huygens that the\nPrincipia's\nreasoning was sound.) From here on, the gulf between the \"two cultures\" began to widen dramatically. In this course we shall attempt to bridge that gulf by combining a rigorous study of the text of the\nPrincipia\nwith full discussion of its philosophical implications.\n\nThe basic text will be:\n\nDensmore, Dana.\nNewton's Principia: The Central Argument, Translation, Notes, and Expanded Proofs. 3rd ed.\nGreen Lion Press, 2003. ISBN: 9781888009231.\n\nSupplementary readings on philosophical issues in Newtonian mechanics will be provided in the form of excerpts from Aristotle, Buridan, Descartes, Galileo, Boyle, Huygens, Leibniz, Berkeley, Kant, and Mach.\n\nAs background to the study of Newton's\nPrincipia\n, we will begin with the philosophic problem of motion in Greek antiquity, focusing on Zeno's paradoxes and Aristotle's definition of motion. Then we will consider the radically different mathematical treatment of motion in Galileo's\nDiscourses on Two New Sciences\n(1638). From there we will turn to Newton's Definitions, Laws of Motion, and Corollaries to the Laws, with their attendant Scholia, as well as the Lemmas of Book I (Newton's development of the calculus as it is used in the\nPrincipia\n).\n\nNext, about half the semester (Ses #19) will be devoted to an intensive study of the first seventeen propositions of Book I, starting with the problem of centripetal force and culminating in the proof that inverse square central forces produce elliptical, parabolic, or hyperbolic orbits. A week will be spent learning the theory of ellipses, parabolas, and hyperbolas in Apollonius'\nOn Conic Sections\n.\n\nFrom the mathematical propositions of Book I we turn to Book III, \"On the System of the World,\" where we study Newton's Rules of Philosophizing and his 6 Phenomena (based on astronomical observation of the orbits of the moons of Jupiter and Saturn, of the planets about the sun, and of the moon about the earth). We then study the first 8 and the 13th Propositions of Book III, showing how universal gravitation operates in our world and proving Kepler's Laws of Planetary Motion. We conclude with a reading of Newton's General Scholium.\n\nIn this course we will not only be following step-by-step the extraordinary course of Newton's \"central argument;\" we will throughout the semester be discussing such philosophical and historical questions as: the nature of motion, the fundamental differences between ancient and modern mathematics, the changing meaning of \"physics\" from Aristotle to Galileo to Newton, the mathematical uses of infinity and infinitesimals, the ideas of \"laws of nature,\" \"hypotheses,\" \"causes,\" \"rules of philosophizing,\" the concepts of space, force, inertia, instantaneous velocity, etc., and the problem of action at a distance. By the end of this course you will have mastered the fundamental ideas and methods of one of the greatest minds in the history of Western thought.\n\nExpectations\n\nThe course will emphasize written and spoken communication: all students will be expected to write several short papers, be active in class discussion, and formally demonstrate three propositions (lemmas, corollaries) at the board while also leading the class discussion of those propositions.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAssigned study papers (3)\n\n20%\n\nParticipation\n\n30%\n\nFirst paper\n\n20%\n\nSecond paper\n\n15%\n\nThird paper\n\n15%\n\n20%: Three two-page papers addressing assigned study questions, to be submitted electronically before the class in which they are discussed. These papers are due before Ses #4, 15, and 33.\n\n30%: Classroom participation. Students will be expected to play an active role in class discussion and in critiquing others' demonstrations at the board. In addition, every student will be required to make at least three formal demonstrations before the class of a Proposition, Lemma, or Corollary from the\nPrincipia\n. During the demonstration, the student will take questions from the class and lead the discussion of the proposition, etc.\n\n20%: A six-page paper is due in class at Ses #12. This paper will be re-written in response to the instructor's comments and re-submitted. The grade will be assigned for the rewritten paper.\n\n15%: A second six-page paper is due in class at Ses #26.\n\n15%: A third six-page paper is due in class at Ses #39.\n\nCI-H Requirements\n\n[a] The first 6-page paper must be rewritten; [b] each student will formally demonstrate three propositions (lemmas, corollaries) at the board and will be responsible for leading the class discussion of those propositions.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nThe problem of motion in Greek Antiquity: Zeno and Aristotle\n\nMotion according to Galileo\n\nIntroduction to Newton's\nPrincipia\n\nThe Definitions: Newton's understanding of force\n\nAssigned study paper 1 due\n\nNewton's Axioms or Laws of Motion\n\nBook I Section 1--The Lemmas: Newton's application of mathematics to motion--his \"method of first and ultimate ratios\"\n\nThe Lemmas (cont.)\n\nThe Lemmas (cont.)\n\nThe Lemmas (cont.)\n\nThe Lemmas (cont.)\n\nBook I Section 2--Newton's Propositions on Centripetal Forces\n\nNewton's Propositions (cont.)\n\nFirst paper due\n\nNewton's Propositions (cont.)\n\nNewton's Propositions (cont.)\n\nNewton's Propositions (cont.)\n\nAssigned study paper 2 due\n\nExcursus on Apollonius'\nOn Conic Sections\n\nExcursus on Apollonius'\nOn Conic Sections\n(cont.)\n\nExcursus on Apollonius'\nOn Conic Sections\n(cont.)\n\nNewton's Propositions (cont.)\n\nNewton's Propositions (cont.)\n\nBook I Section 3--Newton's Propositions on the motion of bodies in eccentric conic sections\n\nNewton's Propositions on conic sections (cont.)\n\nNewton's Propositions on conic sections (cont.)\n\nNewton's Propositions on conic sections (cont.)\n\nBook III--Of the System of the World\n\nSecond paper due\n\nThe Phenomena\n\nThe Phenomena (cont.)\n\nThe Phenomena (cont.)\n\nBook III Propositions on the planets and their moons\n\nBook III Propositions (cont.)\n\nBook III Propositions (cont.)\n\nFlashback to Proposition II.24\n\nBook III Propositions (cont.)\n\nAssigned study paper 3 due\n\nFlashback to Proposition I.69; Proposition III.7\n\nFlashback to Propositions I.71-I.76\n\nFlashback to Propositions I.71-I.76 (cont.)\n\nBook III Propositions (cont.)\n\nBook III Propositions (cont.)\n\nConclusion of the Course: Newton's General Scholium\n\nThird paper due",
  "files": []
}