{
  "course_name": "History and Theory of Historic Preservation",
  "course_description": "This class examines the history and theory of historic preservation, focusing on the United States, but with reference to traditions and practices in other countries. The class is designed to examine the largely untold history of the historic preservation movement in this country, and explore how laws, public policies and cultural attitudes shape how we preserve or do not preserve the built environment. The class will give students a grounding in the history, theory and practice of historic preservation, but is not an applied, technical course.",
  "topics": [
    "Humanities",
    "History",
    "Social Science",
    "Urban Studies",
    "Humanities",
    "History",
    "Social Science",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis class examines the history and theory of historic preservation, focusing on the United States, but with reference to traditions and practices in other countries. The class is designed to examine the largely untold history of the historic preservation movement in this country, and explore how laws, public policies and cultural attitudes shape how we preserve or do not preserve the built environment. The class will give students a grounding in the history, theory and practice of historic preservation, but is not an applied, technical course. We will not, for example, be examining in great detail the practice of building conservation and restoration. The course will also involve visits to historic preservation sites in and around Boston. Students will have the opportunity to pursue either a traditional research paper or an applied project. Graduate students from Urban Studies and Planning, Architecture, History, and other related fields are welcome. Advanced undergraduates in these fields may take the class with permission of the instructor.\n\nReadings\n\nThe textbooks for this class are:\n\nPage, Max, and Randall Mason.\nGiving Preservation a History: Histories of Historic Preservation in the United States\n. New York, NY: Routledge, 2003. ISBN: 9780415934435.\n\nWalkowitz, Daniel J., and Lisa Maya Knauer.\nMemory and the Impact of Political Transformation in Public Space\n. Durham, NC: Duke University Press, 2004. ISBN: 9780822333647.\n\nCourse Requirements\n\nClass Attendance and Participation -- A lecture class in which one doesn't say a single word all semester might actually be enjoyable and intellectually stimulating, depending on the quality of the readings and lectures. A seminar, however, depends on the regular, informed, energetic participation of its members. I am strongly committed to encouraging everyone to participate in class discussions.\n\nWeekly Commentaries -- In order to spark discussion, I would like each of you to email me, by midnight the night before class, a brief (no more than one page) series of questions or commentary about the topic and/or readings for that week. Some weeks I may ask you to visit a particular site. The weekly questions and comments will not be graded, but you must do them (i.e.\nnot\nsubmitting them will affect your grade).\n\nShort Papers -- There are two short (2-4 page) papers for the course:\n\nHistoric building or landscape -- I would like you to visit a significant historical building or place of your choice and write a paper evaluating that place, how it is or is not being preserved, and what the value of the place is.\nDue at the beginning of class, before Ses #2\n.\n\nBoston Landmarks Commission -- I would like you to attend a regular public meeting of the Boston Landmarks Commission and write a paper evaluating the meeting: what issues were covered, what particularly struck you, what the meeting says about how preservation is done.\nDue at the beginning of class in Ses #8\n.\n\nFinal Paper or Project -- You will have two options. For the paper option, you will, alone or together, examine a recent preservation controversy and analyze the issues raised in the controversy. For the project option, you are encouraged to develop an innovative proposal for a preservation intervention at a particular site: an innovative method of adaptive reuse, a new preservation bylaw, a model way of providing public interpretation of an historic site. Obviously, the topics will be developed in consultation with me.\nPresentations will be in Ses #12; final drafts due to me to the following week\n.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "lect1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/eb6f4daac2a5a86702f0ce9e8cbfd194_lect1.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\nLecture 1: Introduction: What is Historic Preservation?\n\nThe course has three main themes: (1) the history of historic preservation, (2) the\npolitics of historic preservation, and (3) how the past is brought into the present.\nOne goal of the course is for students to examine debates in the field and to develop\ntheir own ideas about the past: to develop an ethic or an approach to historic\npreservation. In some ways, then, this is a course in moral philosophy as well as the\nhistory and theory of preservation.\n\nHistoric preservation is often considered to be a recent movement, one that is\nfocused on \"great old buildings.\" It is usually characterized as oppositional, but not\nradical. Much of what we think we know about the history of historic preservation is\nbased on a few prominent myths: that it was \"blue-haired old ladies\" who pioneered\nit, that is concentrated in the northeastern United States, that it is not central to\ndebates about land use and planning, that it only concerns the leftovers of urban\ndevelopment.\n\nHistorians have begun to challenge these myths, the \"stock history\" of historic\npreservation in several ways:\n\nHistoric preservation has a history that is older than the National Historic\nPreservation Act of 1966. Furthermore, historians are exploring what makes\nAmerican historic preservation different than historic preservation or \"conservation\"\nin other parts of the world.\n\nHistoric preservation is not only concerned with \"saving\" one building at a time, or\nadvocacy related to great old buildings. Historic preservation is related to other\nhistoric activity, including the creation and management of museums, monuments,\nand archives.\n\nHistoric preservation was not always \"obsessed with architecture.\" In some ways, a\nsharp break in the history preservation occurred when architectural concerns\nreplaced association with past events as a major focus. For example, the earliest\npreservation efforts tended to focus on sites of the American Revolution not\narchitectural masterpieces. These debates about architectural and historic\nsignificance are closely related to what many consider a lack of attention to\n\"interpretation\" in contemporary preservation practice.\n\nPreservation practice is sometimes characterized as having an undue focus on saving\nan object or an artifact with less attention paid to stories and interpretation. These\nactivities are not a separate endeavor; they are interconnected.\n\nAnother theme of the course, and an orientation toward the study of the past, will be\nthat the present is not necessarily the highest point in history. That is, we have\nthings to learn from the study of the past. For example, fighting sprawl is an old\nidea.\n\nAt the same time, we should try not to glorify the past. In many ways, historic\npreservation has served to perpetuate inequality and racism in American society.\n\nCertain stories were told, not others. Historic preservation is a powerful tool. It has\nthe ability to add new stories, to challenge the stories already told.\n\nIt is a myth that preservation activity began only in Massachusetts and Virginia.\nScholars have recently described regional variations in the history of historic\npreservation. Economic development is another key theme in understanding historic\npreservation practice. It is one of the most powerful engines behind historic\npreservation today. Sometimes this tendency leads to results that are criticized as\nnot merely a celebration of the old, but Disney-fication.\n\nStudents should take the online survey about American attitudes about the past\nbefore the next class session. A short paper, described in the syllabus, is due at the\nbeginning of the next class session.\n\nSlide Lecture\n\nThe following four projects illustrate some of the key themes of the class. Two of\nthese can be considered \"cultural landscapes,\" two as historic homes.\n\nProject #1: Maxwell Street, Chicago. Located on the near west side of Chicago, not\nfar from the Hull House. The district was similar to the Lower East Side in New York,\na bustling, crowded immigrant neighborhood centered around an outdoor market\nand shopping district. In the years of the Great Migration it became known as the\nbirthplace of the urban blues. Performers often played outside of record shops on the\nsidewalk, with extension cords running inside to power electrical amplification. The\narea was the site of a recent preservation conflict related to expansion of the\nUniversity of Illinois, Chicago. The definition of the term of \"historic integrity\" played\na key part in this battle. In the end, the remaining historic structures were\ndemolished, replaced by sports fields and surface parking.\n\nProject #2: Lower East Side, New York. The term \"Lower East Side\" has been used\ndifferently over the past two hundred years, referring to areas of different size and\ncomposition and with different boundaries in Lower Manhattan. The area was\nrecently designated an historic district, but the boundaries of this district are\npeculiar. The way these boundaries were drawn reflects something worth noting\nabout contemporary preservation practice. While the story of the Lower East Side\ninvolves a complex mixing of cultures, including free blacks, Irish, German, Jewish,\nChinese, Polish, and many others, the district gives primary attention to Jewish\nhistory. A key term in this debate was \"contributing buildings,\" which again points to\nthe centrality of \"historic integrity\" in contemporary practice.\n\nProject #3: Site of W.E.B. DuBois Home, Great Barrington, Mass. The home of\nDuBois, the eminent sociologist, critic, and founder of the NAACP, was demolished\nmany years ago. All that remains is a ruin. Yet, the site has been designated a\nNational Historic Landmark. Other sites which represent DuBois life in the town\nremain standing, but the home site remains undeveloped. What should be done\nhere? Is reconstruction a good idea? How might DuBois be remembered at this site?\n\nProject #4: Emily Dickinson Museum, Amherst, Mass. The class will visit the\nhomestead of the influential poet to reflect on and discuss the interpretation of the\nsite. Of particular note is the use and interpretation of The Evergreens, one of two\nhouses on the site.\n11.947, Historic Preservation\n\nLecture 1\nProf. Max Page\n\nPage 2 of 3\n\nFinally, Another Place to Consider: Emmett Till Lynching, Money, Mississippi. The\nbrutal murder of Till in 1955 was a major event in the Civil Rights Movement. The\nstore where the Till allegedly whistled at a white woman, the afternoon before he\nwas kidnapped and killed, still stands. What should happen at this site? What might\nfuture students, tourists, or activists encounter at this place?\n11.947, Historic Preservation\n\nLecture 1\nProf. Max Page\n\nPage 3 of 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lect2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/6253d9ae8ec9a47f7669b98c2a7380cc_lect2.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\nLecture 2: The Roots of Historic Preservation in the United States\n\nIntroduction and Announcements: This week's assignment included a lot of reading\nand a lot of raw data to consider. The reading load will not be as great in future\nweeks. The purpose of this front-loading of material is to prepare for future classes\nwhere we will discuss specific cases in detail. Note that the April 2nd class will be\nrescheduled to April 5th. Also, students should set up individual meetings with the\nprofessor to discuss paper topics.\n\nDiscussion Question: What is your favorite, or what in your mind is the most\nsignificant, historic place, one that has made an impact on you?\n\nStudents describe a wide variety of places around the world, including hometowns,\nworld-famous sites, and museums.\n\nOutline for this Class Session\n\nreview the Nora reading from last class session\ndiscuss the survey that asked Americans about their attitudes about the past\nRuskin and Morris, nineteenth-century ideas about historic preservation outside the\nU.S.\nFounding principles and roots of the historic preservation in the U.S.\n\nLast class we discussed Nora's concepts of \"sites of memory\" versus\nworlds/environments (milieu) of memory. While there are criticisms to be made of\nthe way in which Nora presents his argument in black and white, creating a sharp\ndivision between a traditional past and the modern way, the article is significant for\nits main point. Nora asks, where are we in relation to the past? He describes a\n\"rupture\" or a break (and note that Phillipot, one of the other authors we read for\ntoday, also used this word). We are surrounded by \"totems\" of memory: photos,\nbooks, artifacts, etc. He argues that there is a human need for connection to the\npast, but our way of connecting is particular.\n\nThe article also asks fundamental questions about memory and the insecurity,\nnervousness, and sense of \"not belonging\" in contemporary life. He argues that we\naccumulate more and more archives, and more preserved buildings, and we make\nmore attempts to connect to the past because of a feeling of loss. In this sense, he\nshows how there is a rumbling background behind a lot of preservation battles.\n\nDiscussion of the survey by Roy Rosenzweig and David Thelen\n\nQuestions: Were the results a surprise? What did you think about the survey results?\nHow do you think Americans feel about history?\n\nThe survey had a major impact on preservation professionals. Many historians,\narchivists, and museum curators considered it a surprise. Conventional wisdom had\nit that Americans did not especially care about the past. The survey became an\nimportant part of debates about historic preservation, museums, and interpretation\nof the past.\n\nRuskin and Morris\n\nRuskin is one of those thinkers, like Jane Jacobs, that is written about so often that\npeople rarely read the work in the original. In some ways, his work has been reduced\nto a single catchphrase: \"anti-scrape.\" Discussion questions: What surprised you or\nwhat did you find in Ruskin's writing?\n\nRuskin's writing reflects the major changes occurring in Europe at that time: a sense\nof political upheaval, the changes in building and society brought on by the Industrial\nRevolution (interchangeable parts, mass production). Christianity and ideas about\nthe home, the domestic sphere, also feature prominently. The home is described as\na place of moral virtue, safe from the changes of the workplace. He stresses\npermanence and argues strongly against restoration. He writes that restoration is a\n\"lie.\" These words about restoration are the most well-known part of his\npreservation-related work.\n\nRuskin's writing raises some challenging issues to consider. One of which is that we\ndon't really have a concept of architectural death. His work also pushes us to\nconsider ruins and their meaning. Discussion question: do we have ruins as such, of\nthe kind that Ruskin describes, in America?\n\nRuskin is known as \"the father\" of modern preservation.\n\nMorris adds to this line of thinking. He writes that we should \"stave off decay by daily\ncare.\"\n\nDiscussion of Readings dealing with the roots of historic preservation in the\nU.S.\n\nQuestion: what did you think about the letter arguing for the preservation of the\nIndian Mound in 1822? How do we make sense of a letter like this one in relation to\ngenocide?\n\nThe two are not necessarily incompatible, as preservation and extermination\naccompanied one another. Claiming control over ancient sites was a way to access a\nsense of a longer history, a connection to the land and the artifacts without the living\nculture of the peoples.\n\nQuestion: What about Mount Vernon and the descriptions of the Mount Vernon\nLadies Association in the 1850s and 1860s? The centrality of women to the story is\nnotable. What about Architecture? Was architecture the reason for the preservation\nof Mount Vernon?\n\nNo. It was Mount Vernon's association with George Washington and patriotic themes\nthat early preservationists considered important. Interestingly, more than a century\nlater postmodern architects found the odd and quirky elements of Mount Vernon's\narchitecture a source of inspiration.\n\n11.947, Historic Preservation\n\nLecture 2\nProf. Max Page\n\nPage 2 of 3\n\nQuestion: What about the Boston case that Holleran describes? What was the reason\nfor preservation in the cases he cites? Architecture or something else?\n\nHolleran highlights the links between early preservation thinking and city planning.\nIn this period, advocates and reformers were developing the principles of what to\npreserve and why. There was an increased focus on architecture beginning in the\nearly twentieth century and continuing through to the present. There was also a new\nfocus on certain individual structures: to display the building as an artifact, an\napproach to preservation that saw historic buildings as an \"outdoor museum\nproject.\" City Hall Park in New York is an example of this phenomenon.\n\nQuestion: What was significant about the State House Dome and views in Holleran's\nargument? What were the preservationists trying to do?\n\nThey were interested in more than saving the structure, they were also concerned\nabout the ability to see it from different parts of the city. This idea of protecting\nviews was very unusual, coming years before zoning was established. Holleran's\ndescription of the Boston case shows that some of the most innovative ideas are not\nnecessarily the ones closest to us in time. This case can be seen as an opening up,\nan extension of preservation ideas into something much broader.\n\nQuestion: Several readings mention Appleton as a key figure, the creation of the\nSociety for the Preservation of New England Antiquities (SPNEA), and the\nprofessionalization of preservation. Why was Appleton so influential? What are the\ncharacteristics of these groups and their approach to preservation?\n\nThe fact that private groups were leading this campaign, not the government, is very\nimportant. Also, the emphasis on ownership and control of the site is notable.\nAppleton was a complex figure. He was an antiquarian, but also a modern\nbusinessman- he introduced the use of revolving funds into the preservation field.\nBut he was also anti-immigrant and anti-Semite. His work at Revere House presents\nan interesting example of his attitude toward preservation and immigrants. We might\nalso note how he is presented differently by the different authors we read for this\nweek.\n11.947, Historic Preservation\n\nLecture 2\nProf. Max Page\n\nPage 3 of 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lect3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/2cd72e66ef03ecaf1c1ae2d3717fad17_lect3.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\nLecture 3: Preservation in the 20th Century: History and Policy\n\nIntroduction and Announcements: This class session we will review the traditional\ntale of preservation history in the U.S., then we will try to complicate it, to\nunderstand where it fails. Bluestone and Wilson, as well as other readings, show how\nthe traditional tale is incomplete. We will be talking about preservation up through\nthe 1966 National Historic Preservation Act (NHPA). Then, we will discuss the process\nof having something listed as a landmark, what it involves. Finally, we will talk about\nthe assignment from last week: to look up what, if any, historic places from your\nhometowns are listed in the National Register of Historic Places.\n\nOn the Stellar site for next week's class- be sure to follow the links to the Presidents\nHouse web site, and learn about the controversy in Philadelphia. This is a timely\nissue, as tomorrow it will be revealed which design has won- showing what the\nhistoric interpretation of the site will be. The website shows all five designs that were\nconsidered in the final round.\n\nMarch 5 is next week's class, by the week after students should have a prospectus\nprepared in three parts: (1) a statement of the topic in a few paragraphs, the\nargument summarized and state your biases, (2) the sources you plan to use\n(library, interviews, etc.), and (3) timeline. The prospectus should be a couple of\npages in length, total. Later we will set a date for students to present in class.\n\nSlide Lecture\n\nLast week we talked about Ruskin and his ideas. His house and the landscape of the\nlake district, the site, and its neo-Gothic architecture show something about him. As\nimportant as Ruskin was, his claims about restoration and preservation, he actually\ninspired Revival movements in architecture. A key term is \"picturesque,\" a\ncomplicated phrase in English. This movement invented new landscapes that would\nmerge the human-made and the natural. For example, Central Park in New York.\n\nThe picturesque was supposed to promote restful feelings, but not eliminate human\nactivity. It sought a delicate balance between human and natural. Ruskin was trying\nto build for the ages, something that would seem to be part of the landscape. The\npromoters of the picturesque created something to look like a picture, a new\nlandscape. This movement shows the influence of Ruskin's views, which, in many\nways, led to this movement. One could argue that they were a contradictory outflow\nof his ideas. Ruskin's \"veneration of the object\" and age were very important\nconcepts, these ideas make him a crucial figure, especially in the U.S.\n\nIn 1816, Independence Hall in Philadelphia was threatened with destruction. At that\ntime, preservation was a weak idea. Historic preservation is a modern invention. This\nidea of preservation as modern is paradoxical and one that is not easy to get our\nmind around. But, we can see that change and upheaval promote nostalgia. Some\nhistorians say nostalgia itself is a modern notion. In any case, it is a key concept.\nProtecting an historic building on a permanent basis, it is a modern concept.\nObviously, at the time of the preservation campaign to save Independence Hall, this\nidea is just beginning to be articulated. Today, Independence Hall is considered a\n\nsacred site. Note that this early preservation effort centers around a patriotic\nheadquarters.\n\nIndian mounds were another focus of early preservation campaigns. They were\nvalued as uniquely North American landscapes and as archeological sites. They\nrepresented a time beyond the revolutionary sites. This site is in Ohio, one of major\nroutes, one of the developments beyond the Cumberland Mountains. The Sansom\nreading relates to one of these sites. The impact of road building on the mounds\npresented one of the earliest preservation debates. The roads got built.\n\nMount Vernon. Note that these developments are going on at the same time:\npatriotic sites and Indian sites are being preserved. We have read about the Mount\nVernon Ladies Association, 1856, and Ann Pamela Cunningham. But we should keep\nin mind that these sites had meaning because of their patriotic associations, only\nmuch later were they valued for their architecture. Mount Vernon appears\nsymmetrical, but it has oddities in its pediments and columns. Postmodern architects\ncelebrated it, especially Venturi who described it as an example of \"complexity and\ncontradiction.\" But earlier, it was Mount Vernon's connection to the \"Father\" of our\ncountry that mattered.\n\nDevil's Tower. The 1906 Antiquities Act was the first federal intervention, dealing\nwith historic sites on federal land. It represented a pairing of conservation and\npreservation. Later the National Park Service (NPS) was established, and it became a\ncommon claim that \"monuments\" of nature must be saved. In the 20th Century\nthese movements would go separate ways. However, they may be returning again to\nthese older ideas in the current time.\n\nHouse museums were a major part of early preservation efforts, often ones with a\npatriotic theme. Revere House in the North End is an example. The reconstruction at\nthe turn of the 20th Century put a new front on it, reconstructed it, gave it a\n\"Medieval\" flavor. Central to the movement was the ideal of a moral, woman-\ncentered home, especially as an example to the new immigrants. Many\npreservationists asked, how do we inculcate \"American values\" in \"those people\"?\n\nHenry Ford's Greenfield Village. He collected homes and buildings from across the\nplace, and brought them to one place. He created a Disney-type place using historic\nbuildings.\n\nWilliamsburg. Rockefeller was a major force in its redevelopment in the late 1920s.\nThe declining town of Williamsburg was reconstructed, one of the most massive\nurban renewal efforts in U.S. history. It sought to go back to a colonial era using\nreconstruction, and it was carried out in ways that make preservationists today\ncringe. The reconstruction was undertaken on very little evidence. Furthermore,\nslavery is written out of the story until the past 20 years. In the 1920s and 30s,\nrecreating full historic environments was central to preservation practice.\n\nCharleston. This city passed the first law, that any changes to heart of Charleston,\nwhich was once the wealthiest city in America, had to have approval from an\narchitectural review board. The law was adopted in 1931. Note that it is not federal\nlaw, but rather state or town laws that are essential to preservation. It is remarkable\nhow complete the effect of such regulation is, if you go to Charleston today.\n\n11.947, Historic Preservation\n\nLecture 3\nProf. Max Page\n\nPage 2 of 7\n\nThe Historic Sites Act of 1935 was rather limited; it identified some key landmarks\nand promoted research.\n\nAlso in the 1930s, \"habbs hair\" was created, acronyms that stand for the Historic\nAmerican Building Survey (HABS) and the Historic American Engineering Record\n(HAER). Federal agencies began to document historic places. Some of these\nprograms were created to give work to people, like the WPA Guides, for starving\nartists and writers, architects. These efforts didn't actually preserve buildings, but\nthey gave a record. They were documentation efforts.\n\n1949. The National Trust, modeled after the British, was established a quasi-\ngovernmental organizational.\n\n1963. Penn Station became the center of a major preservation controversy. It was\nbuilt in 1910 by the architectural firm of McKim, Mead, and White. One of the most\nglorious buildings in New York. It was modeled after baths in Rome, and perhaps the\nultimate in Neo-Classical building styles. Famous photos by Berenice Abbott depict\nthis building before it was demolished. A proposal was put forth to tear it down to\nbuild office tower and Madison Square Garden. Its threatened (and eventual)\ndemolition launched a growing preservation movement. Philip Johnson, Jane Jacobs,\nand many others protested. Soon after the NYC Landmarks Law passed, and the New\nYork Landmarks Commission was created.\n\n1966 National Historic Preservation Act (NHPA). The \"key law\" shapes much of\ncontemporary preservation practice, introducing such concepts and programs as the\nNational Register, State Historic Preservation Offices, various rules, the notions of\nhistoric significance and integrity- all the key concepts were \"crystallized\" in this act.\n\nOne sculpture from Penn Station ended up in a fountain in Kansas City. The new\nPenn Station was a disaster, and its efforts to try to recall the old station were\nworse. Vincent Scully wrote, \"Once we entered the city like gods, now we scuttle in\nlike rats.\"\n\nToday the Post Office is across the street, and there has been talk about moving the\ntrain station there. Former Senator Moynihan pushed for it for many years before his\ndeath.\n\nStudent question: What about Grand Central?\n\nA 1978 effort to tear down Grand Central station failed. By that time laws were in\nplace. A legal challenge ensued. The development company sued saying that the\ncity's action was a \"taking.\" The United States Supreme Court reaffirmed that\nhistoric preservation laws were within police power of municipal governments. It was\na key legal decision in preservation law.\n\nPenn Station was a \"pivotal\" event, but it came from a long history. Preservation law\nand preservationists did not just come out of the woodwork, but these events were\nconnected a long tradition of thinking about preservation.\n\nNow, to complicate this story a little. In the early twentieth century, rapid\ndevelopment posed all kinds of problems. It led to new building types, but also\ncaused changes to the old city. Poverty terrified and worried city leaders, poverty\ncould be seen right in the heart of the business and civic district. Educating\n11.947, Historic Preservation\n\nLecture 3\nProf. Max Page\n\nPage 3 of 7\n\nimmigrants became a major focus of social reformers and historic sites were\nconsidered an important part of this education into American values. In New York,\nCity Hall was a significant site. It was threatened with demolition as it was\nconsidered too small, and many though the city should build a grander one. Several\nlarge buildings are built around City Hall during this period, including the Woolworth\nbuilding nearby. During this period, there were a whole series of preservation battles\ngoing on in New York, likewise, in other places, as Holleran describes for Boston.\n\nSt. John's Church. This preservation battle was not about architecture, but about\nkeeping a church on the site. Trinity Church is another example of a preservation\nconflict from this time. Some far-reaching ideas about preservation were floating\naround. In Boston, views of State House become a focus for preservationists. There\nare many ideas of what the purpose and possibilities of preservation are.\n\nAt New York City Hall, some preservationists proposed to tear down the Post Office\nbuilding to create a better view of City Hall. Today, we would preserve a structure\nsuch as the Post Office. At that time, it was argued that it blocked the view of City\nHall. In the end, the city cleared out the park so that there was only one historic\nbuilding in the middle of it. This is largely what City Hall Park looks like today. This\napproach becomes a paradigm- the historic building in a little park.\n\nHamilton's Grave. It was moved to a park. It is another example, like a jewel in a\njewel box, an exhibit in a museum.\n\nAs such, ideas about how far preservation can go get narrowed down in the late\n1920s. St. John's gets demolished.\n\nWall Street. George Washington was inaugurated there at the Treasury Building. It\nwas taken down, brick by brick, and reassembled. It became the entrance to the\nAmerican Museum of Art at the Met. It is literally a museum piece.\n\nDiscussion\n\nQuestion: How does that complicate our history of preservation? What does Wilson\nsay? What happens in Santa Fe?\n\nDiscussion: Santa Fe becomes a tourist attraction. The preservation approach was\nbased upon catering to tourism. It was decided to downplay the Spanish\narchitectural styles and play up a Pueblo theme. These decisions defined the way\nSanta Fe looks today, The city still draws a lot of people, it captivates- its uniform,\nand it presents itself as authentic. It began with a proposed 1912 requirement of\nwhat the architectural style should be.\n\nQuestion: What does Wilson think about it? Is he critical of it? He actually kind of\ndefends it, which is interesting.\n\nDiscussion: An architectural language is created for an area, one that is distinctive.\nIt's an amalgamation to create a sense of place, to build on traditions they merged\nthem. The designers and city leaders were after the tourist trade, but also they\nsought to create their \"thing\"- when you are in Santa Fe, you know you are in Santa\nFe. Isn't that what preservation is about, to create a sense of place? Not orthodox\npreservation, but creating a sense of place. It gets to how we think about\n11.947, Historic Preservation\n\nLecture 3\nProf. Max Page\n\nPage 4 of 7\n\nauthenticity. Some would say there is a \"dissonance that we bristle at,\" that it\ndisplays a false recreation.\n\nApplying it to a living city seems different, to try to accommodate new buildings and\nto foster it the style of old buildings, to make them look like they belong. But, its not\nlike Williamsburg, there isn't the same claim to be historic. No one is saying that in\nSanta Fe. The original Pueblo-type style was an outgrowth of climate and culture, but\nthis Revival style is decoration. They put frills on a building. It doesn't build a sense\nof place. Also, as Wilson notes Hispanics are pushed out of neighborhoods.\nGreenfield tells a similar story about Providence.\n\nProfessor's comment: Wilson makes a very important point here. Look at page 197,\nat the bottom: preservation theory embraced a modernist concept, the spirit of the\ntime. It turned into a moral imperative that additions embody contemporary styles.\nThe spirit of the time became more important than sense of place. The author says\nthat there are other ideas out there that are much more popular than the\npreservationists' approach. This view, the Santa Fe perspective, is influential, it is in\nSouthwest, and it is in Disney. The major historian of historic preservation doesn't\neven mention it.\n\nQuestion: What about the Bluestone article? Mecca Flats? It is a story of African\nAmerican preservation, in 1940s in a very segregated city. Why did they want to\nsave it?\n\nDiscussion: They fought for good housing, affordable housing, to preserve a social\ncenter, a place that had stature in the community. It was not patriotic, not great\narchitecture. They were active, organized, go to State Senate and fight for it.\n\nQuestion: Why does it fail? What is being built next door?\n\nDiscussion: The Illinois Institute of Technology campus by Mies van der Rohe is\nconstructed there. It would be considered Mies's masterwork. The problem was there\nwas a building standing in the way.\n\nProfessor's comment: Chicago was considered the center of modern architecture,\nthat is a tale that was frequently told. Certain buildings by modern architects were\nconsidered part of a cannon with no room for another kind of innovation. A such, we\nsee that the modernist bias in Santa Fe also is a bias here. In the 20th Century\npreservationists blind themselves, and start to exclude things that might be\nmeaningful to people. History shows that there were a lot more choices than people\nthought. Preservation gets progressively narrowed down, the idea of what is\npossible. But, like Santa Fe, we should ask how wrong is it? You can understand the\nattraction to it.\n\nDiscussion of Preservation Practice\n\nSummary: The National Historic Preservation Act of 1966 was the \"first\ncomprehensive historic preservation act.\" Private preservation activity remains a\nfocus. Writers of the federal regulation take care not to interfere with property\nrights, while they assert the public interest. The act creates a vocabulary, a\nlanguage, the key words of preservation practice. \"Aspects of integrity\" are created\nlater. Four criteria are established for National Register eligibility. Section 106\n11.947, Historic Preservation\n\nLecture 3\nProf. Max Page\n\nPage 5 of 7\n\nbecomes one of the more powerful aspects of the law. The act also creates State\nHistoric Preservation Officer.\n\nQuestion: What is the process if you wanted to put a building (like one at MIT, such\nas Building7) on the National Register?\n\nDiscussion: Preservation work almost always starts with local or state, then works its\nway up to federal. It's a federal system. The one exception is National Historic\nLandmarks. To prove that a building like Building 7 is historic, that is, eligible for the\nNational Register would require historic photos and an argument, a story about why\nit is significant. One might argue, for example that is the architecture of 1920s, or\nthe inventions of MIT researchers. You could have multiple reasons, and write a\nhistory of the building.\n\nQuestion: But, what about if it were a total ruin?\n\nProfessor's Comment: Remember the term \"integrity.\" Historic buildings are\nsupposed to represent that moment of significance. There must be enough \"stuff\" of\nthe building that goes back to 1920s.\n\nDiscussion: There was a similar debate about Building 20. Since demolished and now\nthe location of the Stata Center.\n\nProfessor's Comment: Another key concept in preservation practice is the \"era of\nsignificance.\" In general, it is not acceptable to say we are interested in the whole\nlife of the building. In the documentation, it is necessary to choose a point in time to\ncelebrate. The period of significance usually starts at date of construction, especially\nwith Criterion C argument.\n\nQuestion: OK, so you've done the research. You have convinced the local historic\ncommission, you've filled out the form yourself- assembled the photographs and the\ntechnical parts of the application. Then it goes to the state: in this case, the Mass.\nHistorical Commission What do they do?\n\nDiscussion: They check to see if the application is complete, if more information is\nneeded.\n\nProfessor's Comment: Here is another point of potential bias. The state commission\nor state office is unlikely to forward nominations that they think will not be accepted\ninto the National Register.\n\nQuestion: Say the property is listed. Then what happens? What do you get?\n\nDiscussion/Professor's Comment: The building gets a brass plaque which says: \"This\nproperty is listed on the National Register of Historic Places\" on such-and-such date.\nThat's it. Nothing else. The sign does not include an explanation of why the building\nis considered historic. The building is not protected by virtue of being listed and\nsomeone could knock it down. A combination of property rights and federalism form\nthe basis of the current system. The National Register gives nothing in terms of\nprotection. However, historic buildings do get protected. But, how? Usually, it is city\nordinances that provide the most protection. Under the federal system, states have\nthe right to allow cities to pass the more effective landmark legislation. That's where\nthe power comes in. In some places, the city law allows for a demolition delay.\n11.947, Historic Preservation\n\nLecture 3\nProf. Max Page\n\nPage 6 of 7\n\nDiscussion: The historic tax credit only applies to commercial properties.\n\nQuestion: What struck you about the properties in your town listed on the National\nRegister?\n\nDiscussion: Some properties are not listed on the Register. Other properties are\nunknown or it is mysterious as to why they are listed. To be listed requires someone\nto put it on the Register. Often, for an historic district, a majority of people in the\nproposed district have to approve. Some properties may be listed locally, but not on\nthe National Register. Overall, we should keep in mind that the Register is a list of\nplaces that have made it on to the National Register. That's it. Not a comprehensive\nlist of anything. The Matthews article asks, is the list too big? Is it a problem? Maybe\nit is too small? Does it matter? One value is that it can be used to convince people.\nWe should not forget the uniqueness of the American approach to preservation. We\nhave our own system, very different than other places. It is a system born of\nproperty rights and federalism.\n\nNext week we will discuss the Presidents House in Philadelphia.\n\n11.947, Historic Preservation\n\nLecture 3\nProf. Max Page\n\nPage 7 of 7"
    },
    {
      "category": "Lecture Notes",
      "title": "lect4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/a4936431759b6e483eaeb44cbffe8953_lect4.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\nLecture 4: The Politics of Significance: The Presidents House on\nIndependence Mall, Philadelphia\n\nIntroduction and Announcements: Each student should prepare a prospectus by next\nweek's class, which will meet in Amherst, Mass. The day's events will include a tour\nof the Emily Dickinson Museum, a talk with the Museum Director, a look at the\nlandscape of the site, a talk with the head of the Historical Commission, lunch, a\nwalk through town, and a visit to an adaptive reuse project. The tour starts at 11:00\na.m., the day's events should end by 3:00 p.m.\n\nOutline for this Class Session\n\nA brief review the key themes from last week's discussion of the history of historic\npreservation\nDiscuss historic preservation policies\nDiscuss the concept of \"historic significance\" and the case of the Presidents House\nSlide Lecture\n\nPhiladelphia. To problematize and complicate the traditional narrative of historic\npreservation's history leads to a rethinking of preservation practice. The traditional\ntale and mode of preservation has hidden stories. As we discussed last week, the\nearliest sites were considered significant for their patriotic association, not\nnecessarily their architectural quality.\n\nMound City, Ohio; Mt. Vernon; Chaco Canyon; Devil's Tower. Devil's Tower was one\nof the sites that was to be protected by the 1906 Antiquities Act. The involvement of\ngovernment in historic preservation was slow, but it came, bit by bit. These\ndevelopments, as we have read, culminated in the 1966 National Historic\nPreservation Act.\n\nPaul Revere House. Remember that alongside this series of developments, the\nincreasing presence of government in the historic preservation field, early\npreservationists are engaged in a number of other significant activities. Of particular\nimportance, in this respect, is using historic sites to educate and encourage the\nassimilation of (the \"uplift\") of immigrants.\n\nGreenfield Village, Dearborn, Michigan; Williamsburg, Virginia; Charleston, South\nCarolina; Penn Station, New York; Santa Fe, New Mexico. Keep in mind our\ndiscussion from last class about the focus of preservation work in Santa Fe: the idea\nof creating a sense of place. This idea goes against the dominant trend in historic\npreservation, which is sometimes described as \"object\" or \"artifact-focused.\" This\ndifferent sense of preservation could be seen in Santa Fe as early as 1912.\n\nIllinois Institute of Technology campus, Chicago. Recall the Bluestone article. The\nAfrican American preservationists who sought to save Mecca Flats argued for a\ndifferent kind of preservation, too. They were concerned with community, with the\nbuilding as a social center, with the building as a home. Modernist principles became\na dominant view within the preservation movement: the object-focus and the notion\n\nof the pure moment in time. Alternatives and challenges to this view are represented\nby the histories we read of sites in Santa Fe and Chicago.\n\nSome Comments on Preservation Policies\n\nThere are three basic steps to preservation policy:\n\nfinding and describing an historical resource\nevaluation and registration\nprotection\n\nIn the first step, local government is the most important player. In step 2,\nresponsibility \"flows up\" to the state and federal level. In step 3, responsibility \"flows\nback down\" to the local level.\n\nWays of protecting a building can vary from gentle to severe and they can involve\nthe \"carrot\" (incentives) as well as the \"stick\" (regulation). These ways include: tax\nincentives (for federal tax credits only commercial buildings are eligible), mediation\n(Section 106 of the NHPA), demolition delay ordinances (local governments), design\nreview (requiring a certificate of appropriateness, for example), and, most powerful\nof all, eminent domain. One of the most important tools for preservation advocates\nhas been the creation of historic districts, an innovation which began in 1966 in the\nU.S. Historic districts allow for much broader consideration of context. For the most\npart, historic preservation is federally organized, but locally run. Private initiative\nremains very important.\n\nSlide Lecture, Part 2 and Discussion: The Politics of Significance\n\nRobben Island, South Africa; demolished Ayodhya mosque, India; site of Nazi\nheadquarters, Berlin; Emmett Till site, Money, Mississippi; Lorraine Motel, Memphis,\nTennessee; City Hall plaza, Memphis, Tennessee. These sites raise questions about\nsignificance. Significance is an amorphous concept. There is no single definition of\nhistoric significance. Significance is socially constructed.\n\nDiscussion of Ayodhya case. Questions: What happened here? How was the mosque\ndestroyed? What part did anthropologists play? How does the history of colonialism\nand its association with anthropology and modernity factor into an analysis of these\nevents?\n\nDiscussion of Robben Island case. Questions: How should this place be\nmemorialized? How has its meaning changed over time? What does the author\nargue? How might a place like Robben Island assume new meaning in a new South\nAfrica? What is the interpretive lens that is being put forward?\n\nDiscussion of Presidents House case. Questions: How do we define significance?\nWhat is shown? Why was the memory of this place lost? How was it rediscovered?\nWhat were the series of events Lawler describes? What was the NPS response? Why?\nWhat did you think about the proposed designs for a new structure or structures\n(and interpretation activities) on the site of the Presidents House at the entrance to\nthe Liberty Bell Center?\n11.947, Historic Preservation\n\nLecture 4\nProf. Max Page\n\nPage 2 of 2"
    },
    {
      "category": "Lecture Notes",
      "title": "lect5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/c6e3b31706c7c4f2208d9a15c640cf8d_lect5.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\nLecture 5: Preservation and Interpretation: The Emily Dickinson Museum\n\nThis week's class met in Amherst, Massachusetts. The day's events included a tour of\nthe Emily Dickinson Museum, a discussion with the Museum Director and the head of\nthe Historical Commission, lunch, a walk through town to the historic cemetery, and\na visit to an adaptive reuse project. The tour started at 11:00 a.m., the day's events\nconcluded around 4:00 p.m.\n\nEmily Dickinson Museum\n\nThe visit began with a tour of the house by a Museum guide. During the tour,\nstudents asked various questions about the interpretation of the site and the\nmuseum's collection of artifacts. The site includes two adjacent houses, The\nHomestead and The Evergreens, and the garden landscape between them.\n\nThe tour began at the Homestead with a presentation of some of the key events in\nthe life of Emily Dickinson, the historic context of the town of Amherst during her\nlifetime, and a discussion of how various elements of the historic house and artifacts\nin the Museum's collection represent Emily Dickinson's life story. A major theme of\nthis part of the tour involved how visitors experienced the house and how that\nexperience related to visitors' understanding of Emily's Dickinson's poetry. Our guide\nnoted that some visitors come to the house as if it were a shrine, with great\nappreciation and respect for her poetry. Others have simply decided to visit the\nhouse while sightseeing around Amherst and have little to no knowledge of it.\n\nThe group then walked across the property to the Evergreens for the second part of\nthe tour and discussion. Students asked a number of questions related to the\ncondition and proposed restoration and interpretation plans for the Evergreens,\nwhich displays an unusual degree of historic integrity and a large collection of\nmaterial artifacts. In several places, temporary shoring and other interventions could\nbe seen; these devices, our guide explained, were intended to preserve elements\nsuch as deteriorated historic plaster in place. Some visitors, she remarked, were\ndistracted by and uncomfortable with the presence of original materials in poor\ncondition, such as peeling wallpaper, expressing a desire for a more orderly,\nmuseum-like restoration. The Museum is currently exploring restoration options.\n\nThe group also discussed the use of an historic audio recording, a guided \"tour\" of\nthe house which was part of a radio program (circa 1940).\n\nAt the conclusion of the tour, the group returned to an upstairs meeting room at the\nHomestead for a discussion with the Museum Director Jane Wald and Edith Nye\nMacMullen, head of the Historical Commission. Ms. Wald gave a brief presentation on\nthe planning, conservation, maintenance, and related studies produced for the\nmuseum over the last several years. Students were invited to ask questions and an\ninformative discussion followed, covering topics such as the use of signage in the\nMuseum, the training of tour guides, the challenges of presenting and interpreting\ntwo historic houses as part of one museum, and the fundraising and financial\nmanagement of the organization.\n\nFor more information on the Emily Dickinson Museum, see the Museum's official\nwebsite:\n\nhttp://www.emilydickinsonmuseum.org/\n\nAmherst Cemetery Mural\n\nAfter lunch, the class made a trip to the Amherst cemetery to see a new mural\ndepicting historic themes and personages in the town's development. The group also\nstopped at the Dickinson family gravesite. The mural has been painted on the back\nof a commercial building immediately adjacent to the cemetery. The class discussed\nthe role of public art in the interpretation of historic sites.\n\nTo view a detailed photograph of the mural, see muralist David Fichter's website:\n\nhttp://davidfichter.net/images/l/amherstComm1.jpg\n\nAdaptive Reuse: Amherst Cinema (Offices of Kuhn Riddle, Architects)\n\nThe final stop on the tour was the former Amherst Cinema, a large, brick, shed-like\nstructure near the center of town. A comprehensive, multi-million dollar adaptive\nreuse of this building, formerly used as stables, a car dealership, and a movie\ntheater, was recently completed. An architect from the offices of Kuhn Riddle gave a\ntour and a description of the design decisions made in executing this complex\ndevelopment project.\n\nFor more information, see the photos and renderings of the project at the Amherst\nCinema website:\n\nhttp://www.amherstcinema.org/gallery/index.php\n\n11.947, Historic Preservation\n\nLecture 5\nProf. Max Page\n\nPage 2 of 2"
    },
    {
      "category": "Lecture Notes",
      "title": "lect6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/74b24118b43f73f1627705e470854ead_lect6.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\n\nLecture 6: The Politics of Significance II: Poe, McKim and the NYU Law\nSchool Project\n\nThis week's class featured a guest speaker, Susan Lowance from the architecture\nfirm Kohn Pedersen Fox.\n\nIntroduction and Announcements: Students should be prepared to give a short\npresentation in class on April 5th about their final research paper.\n\nClass Outline:\n\nReview last week's field trip.\nDiscuss the readings.\nListen to presentation by guest speaker.\n\nThe class began with a brief discussion of the trip to the Emily Dickinson Museum in\nAmherst, Massachusetts the previous week. Several students commented on the\ninterpretive approach by the Museum. In particular, the Museum focused its tour and\nexhibits towards the goal of showing how the house and setting provide insights into\nthe life and poetry of Emily Dickinson. In this way, the \"significance\" of this particular\nhistoric site is in based in the life of an individual (Criterion B in the language of\nNational Register of Historic Places eligibility).\n\nNext, the class discussed the week's readings with particular attention to Mehrotra\n(2004) on cultural significance in Bombay, Hoaglund (1998) on the application of\nhistoric significance in preservation practice in the United States, and Zerubavel\n(2004) on changing notions of significance at Masada in Israel.\n\nStudents noted that the articles showed some of the problems with a fixed idea of\nhistoric significance. In Bombay, many of the most lively and culturally significant\nplaces in the city are outside of the districts of \"historic\" colonial architecture.\nDrawing on discussions in previous classes, several students noted how the post-\ncolonial context shapes preservation politics and notions of cultural-historic\nsignificance.\n\nThe class reviewed and discussed Hoaglund's (1998) description of the conflict\nbetween the regulation of residential historic districts and their use as living places.\nThe class discussed how sometimes \"history\" can be seen in the changes over time\nand not simply the \"fixed\" way of establishing a \"period of significance.\"\n\nFinally, in considering the Masada case, several students commented on how it\nshows how meaning can be imposed on a historic site (and the interpretation of\nevents that took place there) for political purposes- in this case the goals of Zionism\nand the establishment of the state of Israel. It was also commented that the\narcheological discoveries at the site and changing political context within Israel led to\nchanging interpretation of the site and new understandings of what makes it\nsignificant. Specifically, the discovery of religious artifacts led to the view that the\nsite has primary significance for its evidence of continued religious practice and less\nfor its association with patriotism or bravery.\n\nPresentation by Guest Speaker\n\nSusan Lowance presented a detailed description of the design and construction of a\nnew building for the New York University School of Law in Manhattan. The case\ninvolved several interrelated \"historic\" issues: the character of Greenwich Village and\nthe area around Washington Square Park, the historic Judson Church (a landmark),\nan annex to the Church which hosted a variety of important cultural events, and a\ntownhouse that poet Edgar Allen Poe once lived in. She explained from the\nperspective of one of the architects working on the proposed new building how this\ncontroversial project unfolded, showing a wealth of visual materials in a powerpoint\npresentation: numerous historic photos of the area, renderings of proposed plans,\nand newspaper clippings showing press reports during the design and construction\nprocess.\n\nMs. Lowance described how an intricate compromise was worked out between the\nuniversity and various groups opposed to (1) the demolition of the so-called Poe\nHouse, (2) the demolition of the annex, and/or (3) the construction of the new\nbuilding. Instrumental in process of getting the new building built, she explained,\nwas a legal settlement between the law school and various parties. Interestingly, one\nof the key provisions of this agreement involved the protection not of a building per\nse, but of a view. The agreement stated that the building be constructed in such a\nmanner that when viewed from Washington Square Arch blue sky would remain\nvisible behind the historic tower of Judson Church.\n\nThe agreement allowed construction of the new Law School building, but required\nvarious steps be taken to commemorate or interpret the Annex and the Poe House.\nLowance explained how a reconstruction of the exterior features of both demolished\nbuildings was incorporated into the exterior design of the new building, detailing the\ngreat amount of time and effort required to produce it. Some of the issues\nencountered in the process included code requirements that treated the\nreconstruction as new construction (making it more difficult to reproduce the historic\nappearance), the identification of which material artifacts to save from the Poe House\nand how to incorporate them into the new building, and determining how to organize\ninterior spatial volumes in concert with exterior fenestration.\n\nThe presentation ended with a brief question and answer session with students. It\nwas commented that the project seemed to reflect first and foremost the\nphenomenon of \"planning as deal making.\" In addition, one student remarked that\nlocal residents and community groups seemed primarily concerned about the\npotential impact on the architectural and social character of Greenwich Village: that\nis, neighborhood compatibility rather than, strictly speaking, historic preservation.\nSeveral students commented on the appearance of the \"Poe Room\" in the new\nbuilding, asking questions about how it is used and by whom.\n\n11.947, Historic Preservation\n\nLecture 6\nProf. Max Page\n\nPage 2 of 2"
    },
    {
      "category": "Lecture Notes",
      "title": "lect7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/30fc670e377c6afefcefaa33c7ee1b0b_lect7.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\n\nLecture 7: If you Can't See It, Can you Preserve It? The Danger of\n\"Integrity\"\n\nIntroduction and Announcements: Next week's class will include a tour of the former\nCharles Street Jail. This historic building is currently under construction so please\ndress accordingly. Reminder: please send comments and suggestions for your mid-\nsemester review of the course.\n\nClass Outline:\n\nDiscuss the concept of \"historic integrity.\"\nStudent presentations introducing topic for final paper.\n\nThe class began with a Professor's Comment and student discussion of the previous\nweek's presentation. The expansion of the New York University Law School in\nGreenwich Village and the controversy surrounding the so-called Poe House\nrepresent an example of one of \"hard cases\" of historic preservation. The class\nagreed that the final result is the product of a detailed, carefully worked out\ncompromise; it did not result in great new architecture, but a kind of background\nbuilding. It destroyed some artifacts of the past, while trying to save others. The\nclass reviewed some of the conclusions from the previous week: notably, that the\nlimited building height, the provision to protect an historic view, and the attempt to\nmatch the earlier building height and character of the street frontage on Thompson\nand West 3rd Streets may be the building's most significant design features.\n\nProfessor's Comments\n\nIntegrity is a central idea to historic preservation practice. As the Thelen and\nRosenzweig study showed, many Americans feel connected to history and they trust\nmuseums and historic sites to present it. In particular, many Americans seek out the\nexperience of seeing \"the real thing,\" \"authentic\" objects from the past. One of the\ntopics we will discuss today is how people in different parts of the world have\ndifferent ideas about the past. Furthermore, the idea of \"integrity\" and the\npreservation of the past in material artifacts has differed historically. In the West, it\nhas only been since the Enlightenment that this view of preservation has been\ndominant. When we look at other places and other times, we realize that the concept\nof preservation is very much a contested idea.\n\nDiscussion\n\nStudents discussed cases from the readings: Stille (2002) on the \"culture of the\ncopy\" in China, the decision not to grant World Heritage Site status to the Issei\nShrine in Japan, Carter (2004) on the mixed architectural heritage of the northern\nChinese city of Harbin, Ladd (1998) on preservation issues related to the Berlin Wall,\nand Brookstein's (2001) description of the Maxwell Street case in Chicago.\n\nSeveral students commented on Stille's description of the Chinese use of high-quality\ncopies of ancient artifacts for the purposes of museum exhibition. Some students\nwere of the opinion that the Western experts involved in the projects at Xi'an and\nLuoyang did not seem open to non-Western views. The rapid transitions in China in\nthe past decade, especially the expansion of capitalist economic activity, were cited\nby several students as a major factor in preservation-related questions in China. The\nclass disagreed on whether these changes would lead to a disappearance of the past\nand the continued destruction or possible mismanagement of historic sites in China.\n\nTwo students questioned the reasons why the Issei Shrine would be denied World\nHeritage Site status. The class generally agreed that while some factors may be\nunknown, the case seems to show the extent to which international preservation\nstandards reflect the post-Enlightenment, primarily Western notions of \"artifact\" and\n\"integrity.\"\n\nIn discussing Harbin, students commented on how the changing political regimes and\neconomic context led to very different treatment of historic architecture. In\nparticular, the influences of tourism, regionalism, and globalization seem to\nincreasing, while symbolic \"nationalist\" concerns have become less important.\n\nMany students commented on their own experience seeing the Berlin Wall or its\nmeaning as a political or historic icon. One student stated that one of the remarkable\naspects of the wall to her was its continuing power as a symbol and artifact, its\nability to evoke emotion in people, even removed from its original context and\ndisplayed in new places. Discussion centered around how the wall functioned when it\ndivided East and West Berlin and how it was treated as an object after \"the fall.\"\n\nOne student described to the class her recent trip to Dubai, explaining that the city\nhas embraced a multi-cultural, Orientalist symbolism in the design of its new\nskyscrapers, malls, and resorts.\n\nFederal guidelines describing the \"aspects\" of integrity were discussed. Students\ndisagreed on whether or not the aspects were useful or not. One student explained\nthat she felt \"location\" should not be an aspect of integrity because the area around\nhistoric buildings may change and what is more significant is the interpretation of the\nbuilding. She cited an historic building that was moved to a park and the\narrangement of historic artifacts in an interpretive setting at the Cloisters in\nManhattan. Another student countered that he felt that integrity of location was\nimportant because the factors of topography, setting, and spatial relationships\ninfluence how buildings are designed and how we perceive them.\n\nFinally, students reviewed the Maxwell Street case and the events described by\nBrookstein (2001). Students tended to agree that the site should have been\ndesignated and preserved, but disagreed on whether the concept of \"integrity,\" the\nprocedures of preservation practice, or the individuals and groups involved (and not\ninvolved) were responsible for the destruction. One student commented that the\ncase showed the influence that powerful landowners, politicians, and institutions can\nhave in the process. Students expressed surprise that state government officials at\nthe Office of Historic Preservation reversed themselves on the issue of \"integrity.\"\n\n11.947, Historic Preservation\n\nLecture 7\nProf. Max Page\n\nPage 2 of 3\n\nStudent Presentations\n\nStudents presented their topics for final papers: a comparison of management\npractices of town commons, an analysis of historic preservation issues related to\nsubway systems, an exploration of a public art project using recorded sound and its\nimplications for interpretation of urban historic districts, a discussion of the work of\nphotographer Robert Adams and his influence on preservation thinking in the 1970s,\nan analysis of the group called the Society for Creative Anachronisms, and a\ndiscussion of the practice of historic preservation in low income neighborhoods.\n\n11.947, Historic Preservation\n\nLecture 7\nProf. Max Page\n\nPage 3 of 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lect8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/7fa34a1f17790fc104e1396dc6eb93fb_lect8.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\n\nLecture 8: Adaptive Reuse: The Charles Street Jail Redevelopment\n\nThis week's class involved a visit to the former Charles Street Jail in Boston. Over the\npast several years the building and its site have undergone an unusual\ntransformation. The project has combined partial demolition, historic rehabilitation,\nand new construction to create a new luxury hotel adjacent to the Massachusetts\nGeneral Hospital complex. The two building complex, which includes the rehabilitated\njail building and a new tower, will be known as the Liberty Hotel, with an expected\nopening in late summer 2007.\n\nThe class met at 77 Massachusetts Avenue and students walked to the project site.\nThe afternoon's tour and discussion began with a presentation from a rehabilitation\narchitect with the firm AnnBeha Architects. The project manager and construction\nmanager were also present. The preservation architect showed historic images of the\nsite over time as well as architectural renderings illustrating the many changes made\nin the conversion process. She also stated that the building is listed on the National\nRegister of Historic Places and that the project qualified for the federal Historic\nRehabilitation Tax Credit.\n\nNext, the class took a guided tour of the historic building on the site: the former jail.\nThe project team provided details on the retention of historic materials in the\nrehabilitation, the architectural changes made to accommodate hotel use, and the\nprocess of working with the National Park Service (which administers the federal tax\ncredit program). Students asked a variety of questions about the former uses of\nvarious parts of the building, the location of jail cells, interpretation plans, the\nnumber of rooms in the new hotel, and the use of specific materials in certain\nbuilding locations. The class learned that materials from the jail cells, after being\nremoved and cleaned, have been reinstalled in their original locations as part of the\nhistoric rehabilitation process. The team also described how in some locations, such\nas\n\nFollowing the tour, the class visited a full-scale model of a new hotel room. Project\nmanagers explained that the room, constructed in a closed-off section of an adjacent\nparking structure, was designed to provide the owner(s) with a detailed example of\nthe new furnishings.\n\nThe day's activities concluded with a brief on-site discussion among students and the\nprofessor. Several students commented on the location of the new tower, which\neffectively obscures views of the Massachusetts Eye and Ear building. Standing at\nthe street edge of the site, the class discussed the relationship between the two\nbuildings which comprise the project: the compatibility of exterior building materials\n(especially the color and texture of brick used to clad the tower), the siting of the\ntower in relation to the historic building, the areas of site that will remain open (to be\ndeveloped as landscape elements and/or driveways), and the allocation of uses\nbetween the two buildings. The relationship of the historic building to its\nsurroundings also attracted the attention of the class: the contemporary appearance\n(especially the use of glass) and close proximity of buildings in the hospital complex,\nthe presence of the T station (currently under construction), and proximity to Beacon\nHill.\n\nFor more information on the Charles Street Jail project, see:\n\nhttp://www.annbeha.com/portfolio-project-\ndetails.html?category=historic%20preservation&id=23\n\n11.947, Historic Preservation\n\nLecture 8\nProf. Max Page\n\nPage 2 of 2"
    },
    {
      "category": "Lecture Notes",
      "title": "lect9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/907d1cf110c560c7ec544b67f51a9f0d_lect9.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\n\nLecture 9: Preserving Contemporary Life: The Ugly and Ordinary and the\nHigh-Style\n\nThis week's class featured a guest speaker from the international preservation\nadvocacy group known as DOCOMOMO. The class began with an introductory lecture\nby the professor on the topic of cultural landscapes. Students were reminded to visit\nthe Woodberry Library at Harvard University and to prepare a draft presentation on\ntheir final paper topics before the next class meeting.\n\nSlide Lecture: Cultural Landscapes\n\nThe preservation of modernist architecture and the preservation of cultural\nlandscapes appear, at first glance, to be very different movements within the field of\nhistoric preservation. For instance, cultural landscapes tend to be anonymous while\nmodernist architecture is not. However, these movements are similar in that they\nboth represent \"blind spots\" of traditional historic preservation activity. These\nmovements represent the frontiers of historic preservation and vibrant areas of\ncontemporary practice. They ask the question of \"historic significance\" in new ways,\nraising questions about authorship and symbolic importance. They also raise the\nquestion: How do we protect those resources which have few defenders? In the\ncases of 2 Columbus Circle and Boston City Hall, we find that many people consider\nthese modern buildings to be ugly and unworthy of landmark status. These debates\nraise the question of what is considered beautiful and what place beauty has in\nquestions of historic significance.\n\nSlides\n\nMaxwell Street, Chicago\nCasitas, South Bronx, New York\nBoston Common\nConnecticut Valley\nPullman, Illinois\nLower East Side Tenement Museum, New York\nLevittown\nGated community, Green Valley, Nevada\n2 Columbus Circle, New York\nWoodberry Library, Harvard University\nMarina Apartments, Chicago\nWood's Hole, Massachusetts\nNoguchi playground\nFountainbleau Hotel by Morris Lapidius, Miami Beach, Florida\n\nThe class briefly discussed ideas of cultural landscapes, focusing on the example\nfrom the readings of casitas as an example of Puerto Rican vernacular architecture,\nsocial space, and cultural symbol in New York. Other examples of cultural landscapes\nwere mentioned in the course of the discussion: battlefields, designed landscapes,\nand working agricultural landscapes such as farms and ranches. Two students with\nprior work experience in historic preservation commented on the ways in which\ncultural landscape thinking has been incorporated into evaluation and designation\nwork. The issue of the changing, dynamic quality of landscape- especially of plant\nmaterial- was mentioned in reference to the concept of historic integrity.\n\nGuest Lecture: Helene Lipstadt\n\nDOCOMOMO was created in 1989 and held its first meeting in 1990. It was founded\nas a pluralistic, interdisciplinary forum for design professionals, architectural\nhistorians, enthusiasts of modern architecture, and others. While some countries\naround the world had measures in place for the protection of \"young monuments\" or\nthe \"recent past,\" in many places such protection was not possible under standard\nhistoric preservation laws. At the time, postmodern architecture was popular and\nmodernism was out of favor. Nevertheless, some of the most famous works of\nInternational Style or Modern Movement architecture had been recognized and\npreserved, notably the work of Le Corbusier.\n\nOriginally formed as an agreement between people from thirteen different countries,\ntoday DOCOMOMO has representatives from more than fifty countries or regions.\nWorldwide the group has about 2,000 members.\n\nDOCOMOMO has three main goals: advocacy, awareness, and documentation.\n\nSlides\n\n2 Columbus Circle\nTWA Terminal\nLincoln Center\nJamaica Savings Bank, Queens\nLever House\nJohnson Wax building\nCase Study Houses, Los Angeles\n\nDOCOMOMO's activities and concerns are now considered a part of mainstream\nhistoric preservation practice. The National Trust for Historic Preservation has\ndeveloped a resource guide. The National Park Service has begun to recognize\nmodern architecture. According to National Register of Historic Places criteria and\nguidelines, resources less than fifty years old are not eligible for designation unless\nthey possess extraordinary significance. Not long ago, the few buildings and sites\nlisted under this exception tended to be recognized for their association with historic\nevents, not for architecture. For example, the Kennedy Space Complex was\ndesignated as historic well before it was fifty years old. It was rare for works of\nmodern architecture to be designated up until the mid-1990s. A few notable\nexceptions include the Carpenter Center at Harvard University, Dulles airport, and\nLever House.\n11.947, Historic Preservation\n\nLecture 9\nProf. Max Page\n\nPage 2 of 3\nDiscussion\n\nIn 1991 a special issue of APT, a well-recognized and extensively-read journal within\nthe field, devoted an entire issue to the preservation of modern architecture. In 1995\nthe National Park Service hosted the \"Preserving the Recent Past\" conference in\nChicago. These events were instrumental in bringing the concerns of advocates into\nthe mainstream of historic preservation practice.\n\nNevertheless, this recognition among professionals did not extend to the general\npublic. Many people still do not consider these resources as worthy of preservation.\nThe architectural historian Richard Longstreth commented in this regard that the\nproblem is that many people just can't see it and don't understand it. In addition,\nmany of these works are associated with the period of urban renewal, which many\npreservationists fought against. Longstreth urged preservationists to forego their\nconcerns with architectural style and to stop thinking that history is finite.\nPreservations should become better historians and preservation work, he argued,\nshould embrace the recent past by recognizing that evaluating what is significant and\nwhat is not will be a continuous and ever-changing process.\n\nThe debate over the preservation of the TWA Terminal at Kennedy Airport in New\nYork provided the first major exposure to DOCOMOMO. In December 2000, New York\nTimes architecture critic Herbert Muschamp wrote an article on the topic. In April\n2001, a press conference was held, highlighting the preservation perspective. Soon\nthereafter, a letter writing campaign to the Port Authority (which manages the\nairport) commenced. As a result of the Section 106 review process, the Port\nAuthority entered into a Memorandum of Agreement (MOA) agreeing to preserve the\nbuilding.\n\nDOCOMOMO's interdisciplinary character is one of its strengths: it provides a place\nfor architectural historians and preservationists to engage with one another.\nDOCOMOMO is also valuable because its activities help put the U.S. preservation\nmovement in context.\n\nDiscussion\n\nThe class ended with a discussion of Boston City Hall. The local chapter of\nDOCOMOMO and other advocates have argued that the building should be considered\neligible for landmark designation by the City of Boston. Students presented their\nperspectives on the building's architectural design, its setting (including the plaza),\nits association with urban renewal, the proposal to construct a new City Hall on the\nSouth Boston waterfront, and its landmark eligibility. To the surprise of the guest\nspeaker, only a few students expressed support for landmark designation.\n\n11.947, Historic Preservation\n\nLecture 9\nProf. Max Page\n\nPage 3 of 3"
    },
    {
      "category": "Lecture Notes",
      "title": "lect10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-947-history-and-theory-of-historic-preservation-spring-2007/7f21d55b6a0a3d2ffe9ef439ba500cf8_lect10.pdf",
      "content": "11.947, History and Theory of Historic Preservation\nProf. Max Page\n\nLecture 10: Preserving Modern Architecture: The Case of Aalto in\nCambridge\n\nThis week's class involved a visit to the Baker House dormitory on the MIT campus\nwith guest speaker David Fixler from the firm Einhorn Yaffee Prescott, Architecture\nand Engineering.\n\nFor more information on Baker House, see:\n\nhttp://web.mit.edu/baker/www/"
    }
  ]
}