{
  "course_name": "How to Stage a Revolution",
  "course_description": "This course explores fundamental questions about the causes and nature of revolutions by looking at how people overthrow their rulers and establish new governments. Considers a set of major political transformations throughout the world and across centuries to understand the meaning of revolution and evaluate its impact. Examines how revolutionaries have attempted to establish their ideals and realize their goals. Asks whether radical upheavals require bloodshed, violence, or even terror. Seeks to explain why some revolutions succeed and others fail. Materials include the writings of revolutionaries, declarations and constitutions, music, films, art, novels, memoirs, and newspapers.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Middle Eastern History",
    "Modern History",
    "Humanities",
    "History",
    "American History",
    "Middle Eastern History",
    "Modern History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 lectures / week, 1 hour / lecture\n\nRecitations: 1 recitation / week, 1 hour / recitation\n\nFor this course, there are three instructors, each of whom leads a recitation.\n\nDescription\n\n21H.001, a\nCI-H subject\n, explores fundamental questions about the causes and nature of revolutions. How do people overthrow their rulers? How do they establish new governments? Do radical upheavals require bloodshed, violence, or even terror? How have rolutionaries attempted to establish their ideals and realize their goals? Have revolutionary outcomes ever matched initial expectations? To answer these and other questions, we will study three major examples of profound political, social, cultural, and economic transformation in the late eighteenth and early nineteenth centuries: the American, French, and Haitian Revolutions. We will also compare these revolutions to the events that have unfolded in Egypt since the beginning of 2011. By the end of the course, students will be able to offer reasons why some revolutions succeed and others fail. Materials for the course include the writings of revolutionaries, declarations and constitutions, music, films, art, memoirs, and newspapers.\n\nPrerequsites\n\nNone.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\nWebsite forum posts\n\nWriting assignments (four)\n\nClass Participation: 20%\n\nYour grade for class participation will be based on the following:\n\nReading: You must complete all reading assignments labelled on the syllabus as \"required\" in time for the meeting with which they are associated, as indicated on the schedule. You are also required to bring with you to lecture / recitation a copy of any reading that has been assigned. Readings labeled \"recommended\" are intended for those who wish to read more on a lecture topic, or who want to consult more primary and secondary sources when preparing the four papers.\n\nActive participation: You are expected to arrive at your weekly recitations having completed all the reading and prepared to pose questions and to contribute\nactively\nto the discussion of the material covered that week. In addition to our regular discussions, we will hold two or three formal in-class debates for which each student will be required to contribute to an oral argument in a more structured format, as encouraged by the guidelines for the CI-H requirement.\n\nWebsite Forum Post: 5%\n\nDuring Extra Session 1 you will be required to post a response of 200-300 words to a topic that will be posted on the class forum.\n\nWriting Assignments: 75%\n\nThere are\nFour\nrequired writing assignments for this subject; each will be 1250 words long. The first paper must be revised and resubmitted in accordance with the guidelines for CI subjects. The four papers and the rewrite will each count for 15% of your final grade. You are encouraged to consult with your recitation leader regarding your papers well in advance of the due date. You may wish to run ideas by your instructor, and / or show him an outline of your paper, a draft of the first paragraph, or a draft of the entire paper.\n\nThe Revision:\n\nCI-H guidelines stipulate that one paper during the term must be revised and resubmitted. In order to catch any early problems as well as to allow time for thoughtful revision, you will be required to revise and resubmit the first 1250 word paper. You may consult with your recitation instructor regarding the rewrite, and you may also seek help at the Writing and Communication Center, as noted above.\n\nDue dates for the writing assignments are as follows:\n\nPaper 1 (1250 words): Due Extra Session 2, between Sessions 5 and 6.\n\nRevision of Paper 1: Due Recitation 4\n\nPaper 2 (1250 words): Due Recitation 6\n\nPaper 3 (1250 words): Due Recitation 10\n\nPaper 4 (1250 words): Due Session 27\n\nSuggested paper topics and guidelines will be distributed in due course. There will be no final exam.\n\nCriteria for HASS CI Subjects\n. Communication intensive subjects in the humanities, arts, and social sciences should require at least 5000 words of writing divided among 3-5 assignments. Of these 3-5 assignments, at least one should be revised and resubmitted. HASS CI subjects should further offer students substantial opportunity for oral expression, through presentations, student-led discussion, or class participation. In order to guarantee sufficient attention to student writing and substantial opportunity for oral expression, the maximum number of students per section in a HASS CI subject is 18, except in the case of a subject taught without sections (where the faculty member in charge is the only instructor). In that case, enrollments can rise to 25, if a writing fellow is attached to the subject.\n\nStatement on Cheating and Plagiarism\n. The web now hosts many sites which offer college level papers of varying quality on a variety of topics. We are well acquainted with these sites, and with others that offer detection services to professors. Buying a paper and submitting it as your own work is cheating. Copying sections from someone else's print or online work into your own without an acknowledgement is plagiarism. MIT has strict policies against both activities that we will fully enforce. For the appropriate MIT definitions and policies, visit the following website. If you are uncertain about what constitutes cheating or plagiarism, please contact your recitation instructor before submitting the work in question.\n\nAcademic Integrity at MIT:\nA Handbook for Students\n\nCalendar\n\nRecitation sessions are marked with an R. There are also extra sessions, marked with an E, where there is a special activity or assignment due. These sessions are outside of the normal class schedule.\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nR1\n\nThe 2011 Revolution in Egypt\n\nE1\n\nForum posting due\n\nUnit 1: The American Revolution, 1763-1783 (Professor Wilder)\n\nThe American Revolution and the Problem of National History\n\nBritain's Fatal Triumph: The English Colonies, 1754-1765\n\nR2\n\nRecitation: Ethnic Cleansing in Modern Warfare\n\nRace and Revolution: Slavery and the Roots of Colonial Independence\n\nA Manifesting Destiny: Transforming Colonists into Americans\n\nE2\n\nDue: 1\nst\nPaper\n\nA Violent Transfer of Sovereignty: The Birth of the United States\n\nThe New American Nation in a Turbulent Atlantic World\n\nR3\n\nRecitation: Is Revolution Contagious?\n\nUnit 2: The French Revolution\n\nThe Origins of the French Revolution: Local and Global Issues\n\nThe Principles of 1789\n\nE3\n\nClass dinner\n\nR4\n\nRecitation: The Parisian Crowd in 1789\n\nDue: Rewrite of 1\nst\nPaper\n\nThe Collapse of the Monarchy and the Terror, 1791-1794\n\nA Cultural Revolution?\n\nR5\n\nRecitation. Religion and the French Revolution\n\nEndings and Beginnings\n\nR6\n\nRecitation: Comparing Revolutionary France (1789-1815) and Revolutionary Egypt (2011-2012)\n\nDue: 2\nnd\nPaper\n\nUnit 3: The Haitian Revolution, 1784-1804 (Prof. Ghachem)\n\nThe Making of a Caribbean Plantation Colony: Slavery and Slave Revolts before the Revolution\n\nHow did the Revolution in Haiti Begin? (I) The Free People of Color\n\nE4\n\nClass dinner\n\nR7\n\nRecitation: Debating the \"Causes\" of Revolution\n\nHow Did Revolution in Haiti Begin? (II) The Slave Revolts\n\nFinal Freedom? The Abolition of Slavery in Haiti\n\nR8\n\nRecitation: Who Abolished Slavery in Haiti?\n\nThe Road to Independence: Toussaint Louverture's Story\n\nAchieving Statehood: Haiti Among the Powers of the Earth\n\nR9\n\nRecitation: The United States and the Haitian Revolution\n\nUnit 4: Outcomes, Theories, Comparisons\n\nFrom Radicals to Conservatives: The United States after 1802\n\nThe United States from African Colonization to Indian Removal, 1816-1838\n\nR10\n\nRecitation: Race and Revolutionary Nation Building\n\nDue: 3\nrd\nPaper\n\nThe Marxist Interpretation of the French Revolution\n\nPanel Discussion: Hannah Arendt, \"The Social Question\"\n\nR11\n\nRecitation: The 21\nst\nCentury: Global Meanings of the French Revolution\n\nGuest speaker: Yasmine el Rashidi\n\nE4\n\nConsultation with Instructors\n\nComparing the American, French, and Haitian Revolutions\n\nAuthoritarianism, Poverty, and Foreign Intervention: Explaining Modern Haiti\n\nR12\n\nRecitation: Violence, Freedom, and the Atlantic Revolutionary Tradition\n\nRevolution Today: Faculty and Student Discussion\n\nConclusion and Student Evaluations\n\nDue: 4\nth\nPaper",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 1: The Ouster of Mubarak in Egypt",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/7aaab70022f10aa0e578f769bca3ce2b_MIT21H_001F13_lec_01.pdf",
      "content": "THE OUSTER OF MUBARAK IN EGYPT\n\nTWO QUESTIONS FOR RECITATION THIS WEEK:\nWhy was Mubarak forced to resign the Presidency?\nWas the overthrow of Mubarak a revolution?\n\nImage courtesy of W123 on Wikipedia. CC-BY.\n\nThis image is public domain.\n\nDemographics\nPopulation of Egypt in 2013: 84,314,000\nPopulation of Other North African and Middle Eastern Countries (2012)\n\nLibya: 6.423,000\nTunisia: 10,777,500\nSyria: 22,530,746\nSaudi Arabia: 29,195,895\nIraq: 31,129,225\nIran: 77,176,930\nMajor Egyptian Cities (2012):\n\nCairo: 8,105,071\nAlexandria: 4,388,219\nGiza: 3,348,401\nReligious Breakdown:\n\nMuslim (Sunni): 90%\nCoptic Christian: 9%\nOther Christian: 1%\n\nGamal Abdel Nassar\nSecond President of Egypt, 1954-1970\nEmergency Law, 1967-2012:\n\n-\nPolice powers extended\n-\nConstitutional rights suspended\n-\nHeavy censorship enforced\n-\nAll non-governmental political activity, street demonstrations, and\n\nnon-approved political organizations,unregistered financial\n\ndonations were formally banned.\n\nThis image is public domain.\n\nAnwar Al-Sadat, Third President of Egypt, 1970-1981\nThis image is public domain.\n\nHosni Mubarak,\nFourth President of Egypt,\n1981-2011\nThis image is public domain.\n\nMohamed Morsi, Member of the Muslim Brotherhood of Egypt\nFifth President of Egypt (30 June 2012 to 3 July 2013), currently under arrest\nThis image is public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 12: Endings and Beginnings",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/69509a6cf0240891788580a3a7d0cc60_MIT21H_001F13_lec_12.pdf",
      "content": "Endings & Beginnings\n\nRecitation Debate Prompt:\n\n\"The events in Egypt in 2011 and 2012\nparallel developments in France from\n1789 to 1794.\"\n\nPrepare arguments for both\nthe \"pro\" and \"con\" positions.\n\nWhen did the\nFrench Revolution\nend?\nSatirical, post-\nThermidorian print:\n\"Robespierre\nguillotining the last\nexecutioner.\nThis image is public domain\n\nVicomte Paul Barras,\nAristocrat and Officer\nPaul Barras,\nDirector\nThe Directory,\n1795-1799\nThese images are public domain\n\nJacques-Louis David,\nPortrait of Emmanuel-\nJoseph Sieyes, 1817\n(Fogg Art Museum,\nHarvard University)\nThis image is public domain\n\nDeclaration of the Rights and\nDuties of Citizens, 22 August 1795\nRights\n\n2)Liberty consists in the power to do that which does not injure the rights of others.\n3)Equality consists in this, that the law is the same for all, whether it protects\n\nor punishes.\n4)Security results from the cooperation of all in order to assure the rights of each.\n5)Property is the right to enjoy and to dispose of one's goods, income, and the\n\nfruits of one's labor and industry.\n\nDuties\n\n1)The declaration of rights contains the obligations of the legislators; the\n\nmaintenance of society requires that those who compose it should both\n\nknow and fulfill their duties.\n4)No one is a good citizen unless he is a good son, good father, good brother,\n\ngood friend, good husband.\n8)It is upon the maintenance of proerty that the cultivation of the land, all the\n\nproductions, all means of labor, and the whole social ordre rest.\n\nThe Constitution of 1795\nLegislature: Bicameral; Council of 500 to initiate all legislation; Council of Elders\n(250, married or widowed, over 40 years old) to pass or reject, but not amend, legislation\nfrom Council of 500; 2/3 of first councils to come from previous National Convention;\nhas complete control over treasury and law, and can declare war\nVoting: Direct universal male suffrage over 21, but only eligible to vote for representatives\nto electoral assemblies. These representatives must own or rent property worth 100-200\ndays' worth of labor (about 60,000 electors). These electors in turn elect the 750 deputies\nto the two Councils.\nExecutive: No king; instead a Directory of five members, chosen by the Elders from a list\npresented by the 500. A new Director each year, so that the entire body would turn over\nevery 5 years. Assembly also chooses ministers, who report directly to Assembly\n(no Cabinet). Directory could not initiate, make, or veto laws, but only suggest laws to\nCouncil of 500; can conduct diplomacy, supervise military, and enforce laws.\n\nA-C-G Lemonnier,\nEntre deux chaises:\nle cul par terre, 1797\nDirectory Coups\n1)\nYear V (1797): 182 of 234 deputies elected\nare royalists - arrest of 2 directors, 53 deputies,\nClosing of rt-wing newspapers, deportations of royalists.\n2)\nYear VII (1799): Neo-Jacobins growing too strong,\npurge 3 Directors, leads to 18-19 Brumaire coup against\nCouncil of 500, end of Directory.\nThis image is public domain\n\nBacler d/Albe, General\nBonaparte in Milan in\nYear V (1797).\nThis image is public domain\n\nJacques-Louis David,\nNapoleon Crossing\nThe Alps, 1801\nThis image is public domain\n\nHyacinthe Rigaud,\nLouis XIV, 1701\nJ-A-D Ingres, Napoleon\nEnthroned, 1806\nThe First Empire,\n1804-1815\nThese images are public domain\n\nThis image is CC-0\n\nThe Bourbon Restoration,\nLouis XVI, 1789\nLouis XVIII, ca. 1815\nThese images are public domain\n\nEighteenth-Century Map of the Caribbean\nThis image is public domain\n\nToussaint Louverture\n& Napoleon Bonaparte\nThese images are public domain\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 13: The Making of a Caribbean Plantation Colony",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/6407c530be85ed92ab39dfcaf65b4276_MIT21H_001F13_lec_13.pdf",
      "content": "The Making of a Caribbean Plantation Colony:\nSlavery and Slave Revolts before the Revolution\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThese images are public domain\n\nThese images are public domain\n\nThis image is public domain\n\nThis image is public domain\n\nFrederick Douglass, speech at the 1893\nChicago World's Fair\n\"We should not forget that the freedom you and\nI enjoy to-day, that the freedom that eight\nhundred thousand colored people enjoy today\nin the British West Indies; the freedom that has\ncome to the colored race the world over, is\nlargely due to the brave stand taken by the black\nsons of Haiti ninety years ago. When they struck\nfor freedom . . . they struck for the freedom of\nevery black man in the world.\"\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nA demographic transformation\n7,000 total\n65% white\n31% slave\n3% free black\nand mulatto\n\n530,000 total\n5% white\n90% slave\n5% free people of\ncolor\n\n14,000 total\n29% white\n66% slave\n3.6% free black\nand mulatto\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nMap of the Trans-Atlantic Slave Trade removed due to copyright restrictions.\nSee The Trans-Atlantic Slave Trade Database.\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nArticle 26\n\nSlaves who are not fed, clothed and maintained by\ntheir masters according to what we have ordered by\nthese articles will be able to notify our attorney general\nand provide him with their statements, on the basis of\nwhich, and even on his own initiative, if the\ninformation comes to him from elsewhere, the masters\nwill be prosecuted upon his motion and without cost,\nwhich we wish to be observed for the crimes and\nbarbarous and inhumane treatment of masters towards\ntheir slaves.\n\nArticle 42\n\nOnly masters shall be permitted, when they\nbelieve their slaves so deserve, to chain them\nand beat them with canes or rope. We forbid\nmasters from applying torture to their slaves or\nfrom inflicting any kind of mutilation, on pain\nof confiscation of the slaves and special\nprosecution of the masters.\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 14: The Free People of Color",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/cd4a8161ca423af6a65baa4202c13f2b_MIT21H_001F13_lec_14.pdf",
      "content": "How Did the Revolution in Haiti Begin? (I):\nThe Free People of Color\n\nThese images are public domain\n\nRevolts/Rebellions in the\n18th-Century Caribbean\n- Gaoule in Martinique\n(1717)\n- Scattered white revolts\nin colonial Saint-\nDomingue, and by free\npeople of color in 1760s\n- Makandal in 1757-1758\n- Tacky's revolt in Jamaica\n(1760-1761)\n\nThis image is public domain\n\nGrowth of the free colored population\n\n12.3%\n\n5,500\n\n33.5%\n\n27,548\n\n89.4%\nYear\n\nTotal Pop.\n\nAs % of white\npopulation\nNote: These figures almost certainly significantly undercount the\nactual numbers of free people of color, since they are based on\nthe official census figures which did not include persons\nmanumitted informally so as to evade payment of the freedom\ntax after late 1730s/early 1740s.\n\nArticle 55\n\nMasters twenty years of age may free their\nslaves by any act toward the living or due\nto death, without their having to give just\ncause for their actions, nor do they require\nparental advice as long as they are minors\nof 25 years of age.\n\nThis image is public domain\n\nThis image is public domain\n\nArticle 59\n\nWe grant to freed slaves the same rights,\nprivileges and immunities that are enjoyed\nby freeborn persons. We desire that they\nare deserving of this acquired freedom,\nand that this freedom gives them, as much\nfor their person as for their property, the\nsame happiness that natural liberty has on\nour other subjects.\n\n11 Degrees of Racial Separation\nMulattos (also called\nsang-meles): persons\nborn of one white\nand one black\nparent, or a mulatto\nparent and a\nmulatresse, or a\nquarteron and a\ngriffe\nThis image is public domain\n\n11 Degrees of Racial Separation\n- Griffe: child of a mulatto and a black person (3/4th\nblack)\n- Quarteron: a person of 1⁄4 black background\n- Mestifs: 1/8th black\n*\n- A language of biological criteria based on social\nconventions\n- Racial \"mixture\" corrupts\n- Translating sexual fantasy and anxiety\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nJulien Raimond, 1791 pamphlet on the history\nof white prejudice against free people of color\n\n-\nLouis XIV had \"granted to freed persons, properly\nunderstood, the right of citizens.\"\n\n-\n\"Will the National Assembly be less just than a\ndespot?\"\n\nRobespierre, May 1791\n\n-\nThe issue was not whether to \"accord\npolitical rights\" to the free people of\ncolor, but rather whether to\n\"conserve\" rights they already\nenjoyed prior to the Revolution.\n\n-\n\"[T]he old laws\" (\"les lois\nanciennes\") had never been\nabrogated, and had vested free people\nof color with \"the same rights as\nwhite colonists.\"\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nArticle 26\n\nSlaves who are not fed, clothed and maintained by\ntheir masters according to what we have ordered by\nthese articles will be able to notify our attorney general\nand provide him with their statements, on the basis of\nwhich, and even on his own initiative, if the\ninformation comes to him from elsewhere, the masters\nwill be prosecuted upon his motion and without cost,\nwhich we wish to be observed for the crimes and\nbarbarous and inhumane treatment of masters towards\ntheir slaves.\n\nArticle 42\n\nOnly masters shall be permitted, when they\nbelieve their slaves so deserve, to chain them\nand beat them with canes or rope. We forbid\nmasters from applying torture to their slaves or\nfrom inflicting any kind of mutilation, on pain\nof confiscation of the slaves and special\nprosecution of the masters.\n\nThis image is public domain\n\nThis image is public domain\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 15: The Slave Revolts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/7095c3e5147612983cfab60a1e25dc58_MIT21H_001F13_lec_15.pdf",
      "content": "How Did the Revolution in Haiti Begin? (II):\nThe Slave Revolts\n\nThis image is public domain\n\nThis image is public domain\n\nWhat is a Slave Revolution?/\nWhat Does It Mean to Abolish Slavery?\n- Improve the conditions of labor (more free days\nper week) for all slaves\n- Free only the most prominent slave insurgents\nand permit them to exercise a leadership role\n- Compensate for labor while keeping \"slaves\"\nattached to their plantations\n- Rid the land of white masters/overseers\n- Divide plantations into small landholdings to be\nmaintained by peasants\n\nMap of the Trans-Atlantic Slave Trade removed due to copyright restrictions.\nSee The Trans-Atlantic Slave Trade Database.\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nNews of the 1791 slave insurgency\n- https://archive.org/stream/gazettedesaintdo0\n1moza#page/854/mode/2up\n- https://archive.org/stream/gazettedesaintdo0\n1moza#page/890/mode/2up\n\nJean-Francois and Biassou to the\nCivil Commissioners, Dec. 21, 1791\n\"The bad treatment of their masters, most of whom torture their slaves by\nmistreating them in all sorts of ways, taking away their two hours [of\nmidday rest], and their holidays, and Sundays, leaving them naked,\nwithout any help even when they are sick, and letting them die of misery.\nYes, sirs, how many barbarous masters there are who enjoy being cruel to\nthese miserable slaves, or else managers or administrators who, to stay in\ntheir employers' good graces, afflict a thousand of the same cruelties on\nthe slaves as they pretend to carry out their responsibilities.\nOh, sirs, in the name of humanity, deign to look favorably on these\nunfortunates by clearly outlawing such harsh mistreatment, abolishing the\nterrible plantation prisons, . . . and trying to improve the condition of this\nclass of men.\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\n\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 16: Final Freedom",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/7a467429615ae10ae6820b0b9fcabdee_MIT21H_001F13_lec_16.pdf",
      "content": "Final Freedom?\nThe Abolition of Slavery in Haiti\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\n\"23 August. Revolt of the negroes in Saint-\nDomingue. The contradictory decrees of the\nNational Assembly on the freedom of the negroes,\nnotably that of May 13, have handed the colony\nover to all of the horrors of civil war.\"\nThis image is public domain\n\nWhat is a Slave Revolution?/\nWhat Does It Mean to Abolish Slavery?\n- Improve the conditions of labor (more free days\nper week) for all slaves\n- Free only the most prominent slave insurgents\nand permit them to exercise a leadership role\n- Compensate for labor while keeping \"slaves\"\nattached to their plantations\n- Rid the land of white masters/overseers\n- Divide plantations into small landholdings to be\nmaintained by peasants\n\nJean-Francois and Biassou to the\nCivil Commissioners, Dec. 21, 1791\n\"The bad treatment of their masters, most of whom torture their slaves by\nmistreating them in all sorts of ways, taking away their two hours [of\nmidday rest], and their holidays, and Sundays, leaving them naked,\nwithout any help even when they are sick, and letting them die of misery.\nYes, sirs, how many barbarous masters there are who enjoy being cruel to\nthese miserable slaves, or else managers or administrators who, to stay in\ntheir employers' good graces, afflict a thousand of the same cruelties on\nthe slaves as they pretend to carry out their responsibilities.\n\nOh, sirs, in the name of humanity, deign to look favorably on these\nunfortunates by clearly outlawing such harsh mistreatment, abolishing the\nterrible plantation prisons, . . . and trying to improve the condition of this\nclass of men.\"\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nSonthonax, Decree of Aug. 29, 1793\n\"To restore order and tranquility . . .\n\nAll the negres and mixed blood peole currently in\nslavery are declared free to enjoy all the rights of\nFrench citizens; they are nevertheless subject to the\n[following] regime . . .\n\nThe negres currently working on the plantations of\ntheir former masters are required to remain there.\nThey will work in agriculture . . .\n\nThe Code Noir is provisionally repealed.\"\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 17: The Road to Independence",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/6523508f1908d4e31a8026717a8f4cf3_MIT21H_001F13_lec_17.pdf",
      "content": "The Road to Independence:\nToussaint Louverture's Story\n\nThis image is public domain\n\nThis image is public domain\n\nCamp Turel Proclamation, Aug. 29, 1793\n\"Brothers and friends\n\nI am Toussaint Louverture; perhaps my name has made itself\nknown to you. I have undertaken vengeance. I want Liberty\nand Equality to reign in Saint Domingue. I am working to\nmake that happen. Unite yourselves to us, brothers, and fight\nwith us for the same cause.\n\nYour very humble and obedient servant,\n\nToussaint Louverture.\nGeneral of the armies of the king, for the public good.\"\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThese images are public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nImages of Fort de Joux and a statue of Toussaint Louverture removed\ndue to copyright restrictions. Please see: Above links to Wikipedia.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 18: Achieving Statehood",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/e8098ade0a47ddd943bece41c4c8443b_MIT21H_001F13_lec_18.pdf",
      "content": "Achieving Statehood:\nHaiti Among the Powers of the Earth\n\nWhat is a Slave Revolution?/\nWhat Does It Mean to Abolish Slavery?\n- Improve the conditions of labor (more free days per\nweek) for all slaves\n- Free only the most prominent slave insurgents and\npermit them to exercise a leadership role\n- Compensate for labor while keeping \"slaves\" attached\nto their plantations\n- Eliminate the \"property\" element\n- Eliminate the element of racial subordination\n- Rid the land of white masters/overseers\n- Divide plantations into small landholdings to be\nmaintained by peasants\n\n\"When in the Course of\nhuman events, it\nbecomes necessary for\none people to dissolve\nthe political bands which\nhave connected them\nwith another, and to\nassume among the\npowers of the earth, the\nseparate and equal\nstation to which the\nLaws of Nature and of\nNature's God entitle\nthem . . .\"\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nThis image is public domain\n\nPhoto courtesy of Stefan Krasowski on Flickr. CC-BY.\n\nMaps of the United States prior and after the 1763 Treaty of Paris have\nbeen removed due to copyright restrictions. See: Wikipedia.\n\nMap of the United States and Territories from April 20, 1803 to March 27,\n1804 removed due to copyright restrictions. See: Wikipedia.\n\nPast and Coming Attractions\n- Units 1-3: the Atlantic revolutionary era\n(minus the Spanish American revolutions of\nthe early 19th century)\n- Unit 4\n- Legacies\n- Comparisons\n- Theory\n- Egypt\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 19: Radicals to Conservatives",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/948fcb29871012b3c7886780ed64d791_MIT21H_001F13_lec_19.pdf",
      "content": "Radicals to Conservatives\n\nThere has been in town a conspiracy of\nthe negroes. At present it is kept\npretty private, and was discovered by\none who endeavoured to dissuade\nthem from it. He being threatened\nwith his life, applied to Justice Quincy\nfor protection. . . . I wish most\nsincerely there was not a slave in the\nprovince; it always appeared a most\niniquitous scheme to me to fight\nourselves for what we are daily\nrobbing and plundering from those\nwho have as good a right to freedom\nas we have.\n\n--Abigail Adams,\n\nBoston Garrison\n\n22 September 1774\nThis image is public domain\n\nConspiracies and Uprisings\nCuba: 1795, 1798, 1802, 1805, 1809\nCuracao: 1795\nDominica: 1791, 1795, 1802\nGrenada: 1795\nGuadeloupe: 1789 (French)\nJamaica: 1791, 1795, 1806\nLouisiana: 1811 (largest in US history)\nMartinique: 1789-1792 (French)\nTobago: 1801, 1807\nTortola: 1790\nTrinidad: 1805\nVenezuela: 1795\n\nHaiti in the United States\nRestricting the Slave Trade\nUS Constitution (Article 1; Section 9): \"The Migration or Importation\nof such Persons as any of the States now existing shall think\nproper to admit, shall not be prohibited by the Congress prior to\nthe Year one thousand eight hundred and eight, but a Tax or\nduty may be imposed on such Importation, not exceeding ten\ndollars for each Person.\"\n\nSouth Carolina: 1792-1801\nGeorgia: 1793\nKentucky: 1794, 1798\nNorth Carolina: 1795\nMaryland: 1796\n\nThe chief of the servants here who are good for any\nthing are Negroes who are slaves. The white ones\nare all Foreigners & chiefly vagabonds. I really now\nknow more than ever how to Prize my English\nservants.\n\n--Abigail Adams\n\nRichmond Hill\n\n28 April 1790\nThis image is public domain\n\nGabriel Prosser\nThe failed assault on Richmond, Virginia,\n30 August 1800\nThis image is public domain\n\nDenmark Vesey\nThe conspiracy in Charleston, SC, 1822\nThis image is public domain\n\nLouisiana Purchase\nThe fates of the Southeastern Indians\nThis image is public domain\n\nCotton at the Port of New York\nThis image is public domain\n\nAmerican Colonization Society\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nThis image is public domain\n\nThe Haitian Revolution at\nBowdoin College\nJohn B. Russwurm's 1826 Commencement Address\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nThis image is public domain\n\nFreedom's Journal, 1827\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nThis image is public domain\n\nThe Liberator, 1831\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nQuickTimeTM and a\ndecompressor\nare needed to see this picture.\nThis image is public domain\n\nAmerican Anti-Slavery Society\nNew-York Anti-Slavery Society, 1831\nNew England Anti-Slavery Society, 1831\n\nThis image is public domain\n\nNative Americans on Indian Removal\nWilliam Apes, Pequot (1798-1839)\nThis image is public domain\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21h.001 Lecture 24: Comparing the American, French, and Haitian Revolutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-001-how-to-stage-a-revolution-fall-2013/582af28223e6fbe5d609498760e8a153_MIT21H_001F13_lec_24.pdf",
      "content": "Comparing the American,\nFrench, and Haitian Revolutions\n\nHannah Arendt\nThis image is\npublic domain\n\n1969 photo of Hannah Arendt removed due to copyright restrictions.\n\n\"The Social Question\"\nThe French Revolution \"was overwhelmed by\nthe cares and worries which actually belonged in\nthe sphere of the household and which, even if\nthey were permitted to enter the public realm,\ncould not be solved by political means, since\nthey were matters of administration, to be put\ninto the hands of experts, rather than issues\nwhich could be settled by the twofold process of\ndecision and persuasion.\" (81)\n\nProsperity or freedom?\n\n\"The outcome of the American Revolution, as\ndistinct from the purposes which started it, has\nalways been ambiguous, and the question of\nwhether the end of government was to be\nprosperity or freedom has never been settled.\"\n(127)\n\nHaiti and the \"Social Question\"\n\n\"[T]o avoid this fatal mistake [of trying to solve\nthe social question with political means, thereby\nleading to terror] is almost impossible when a\nrevolution breaks out under conditions of mass\npoverty.\" (102)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.001 How to Stage a Revolution\n\nFall 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}