{
  "course_name": "How To Build An Animal: Cell Fate and Identity in Development and Disease",
  "course_description": "In this course, we will explore how animals determine and maintain cell fate. We will discuss changes to DNA structure and packaging, special proteins (known as “master regulators”) with the ability to alter cell fate via transcription, cell-cell signaling, and RNA localization.\nThis course is one of many Advanced Undergraduate Seminars offered by the Biology Department at MIT. These seminars are tailored for students with an interest in using primary research literature to discuss and learn about current biological research in a highly interactive setting. Many instructors of the Advanced Undergraduate Seminars are postdoctoral scientists with a strong interest in teaching.",
  "topics": [
    "Health and Medicine",
    "Biomedicine",
    "Science",
    "Biology",
    "Cell Biology",
    "Developmental Biology",
    "Stem Cells",
    "Health and Medicine",
    "Biomedicine",
    "Science",
    "Biology",
    "Cell Biology",
    "Developmental Biology",
    "Stem Cells"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nPrerequisites\n\nStudents are expected to have taken at least one of the following courses:\n\n7.03 Genetics\n\n7.06 xCell Biology\n\nor\n\n7.28x Molecular Biology\n\nPrerequisites may be waived with permission by the instructor.\n\nCourse Description\n\nMulticellular organisms develop from single cells that form as a result of fusion between two haploid gametes, e.g., sperm and egg. The fertilized egg, known as a zygote, undergoes a series of dynamic developmental events to give rise to a multitude of cell types, such as neuronal cells in the brain and central nervous system and hematopoietic cells that generate the immune system.\n\nUnderstanding how these different cell types, each with their own unique functions, are generated from the totipotent zygote is a major goal of research in the fields of developmental biology and biomedicine. Because most cells within a given organism contain the same genetic information regardless of differentiated state, cell identity is manifested through a number of molecular mechanisms that influence cellular behavior and function without altering DNA sequence.\n\nIn this course, we will explore how animals determine and maintain cell fate and discuss changes to DNA structure and packaging, special proteins (known as \"master regulators\") with the ability to alter cell fate via transcription, cell-cell signaling, and RNA localization. We will examine how researchers have defined cell identity and potency and analyze critical papers describing the discovery and characterization of stem cells, which are undifferentiated cells able to give rise to multiple cell types.\n\nAdditionally, we will examine the development and maintenance of numerous specialized cell types considering, for example, evolutionarily conserved developmental pathways that lead to a germ cell (sperm or egg) identity as opposed to a somatic (non-germ) cell identity in a variety of animal species. We will discuss crucial somatic developmental pathways, including the restriction of cell fate in differentiating hematopoietic lineages. We will conclude by examining how failure to maintain proper cell fate and identity can lead to disease and consider disorders of sexual development as well as a number of cancers.\n\nFormat & Expectations\n\nThe goal of this course is to learn how to critically analyze and discuss primary scientific literature. Each week has two primary research papers assigned for required reading. Students should come to class having read both papers thoroughly, and be prepared to discuss and critique each paper. This will entail close examination of both the text and figures presented in the paper, such that the students should be able to comment on the authors' approach, experimental design and control experiments, interpretation of data, and conclusions. Each class will primarily consist of discussion of the assigned papers, with a short segment at the end of each class to introduce background information for the next week's topic.\n\nAssignments\n\nThere will be one short written assignment and a final oral presentation during the course.\n\nGrading\n\nThis course is graded pass / fail. As the course is discussion-based, attendance at every class is mandatory and participation is an essential requirement for a passing grade.\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nClass introduction\n\nPotency and pluripotent stem cells\n\nSignatures and mechanisms of pluripotency: Transcriptional networks\n\nSignatures and mechanisms of pluripotency: Bivalent chromatin domains\n\nGerm cell identity\n\nReprogramming of germ cells and stem cells\n\nSubmit proposed paper for writing assignment to instructors\n\nReprogramming soma by pioneer transcription factors\n\nDefining hematopoietic identities: Part 1\n\nWritten Assignment due\n\nDefining hematopoietic identities: Part 2\n\nRegulatory mechanisms for immune cell identity: Chromatin and transcription factors\n\nRegulatory mechanisms for immune cell identity: Cell signaling\n\nDisorders of cell identity: The reproductive tract and germ cell identity\n\nDisorders of cell identity: Hematopoiesis\n\nSubmit proposed paper for final oral presentation to instructors\n\nCellular reprogramming and therapeutics\n\nOral presentations and evaluations\n\nOral Presentations due",
  "files": [
    {
      "category": "Resource",
      "title": "Week 1 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-how-to-build-an-animal-cell-fate-and-identity-in-development-and-disease-fall-2017/41eff6d89f3120d59f27d8bb906e4aff_MIT7_342F17_Week_1_handout.pdf",
      "content": "- More details on these assignments are within the syllabus.\n\n-This course is graded pass/fail. Attendance and participation, the written assignment, and the\nfinal presentation will all be components of your final grade.\n\nResources for Primary Research Articles\n\n-PubMed\n\n-Google Scholar\n\n-Web of Science\n\n-Assigned readings will be posted on the course website\n\n7.342 How to Build an Animal: Cell Fate and Identity in Development and Disease\nWeek One\n\nIntroductions\n\n-Write on the notecards your name, email address, course, year, previous relevant biology classes,\nwhether you've had experience with primary literature, and any extracurricular activities, hobbies, or interests.\n\nCourse Expectations\n-The primary objective of this course is to learn how to read, analyze, and discuss primary scientific\nliterature.\n\n-!ttendance and participation in each week's discussion is mandatory.\n\n-There will be two assigned papers to read for each week's class.\n\n-Each week, you should come to class having read both papers and be prepared to discuss and\ncritique each paper. This could entail articulating the paper's main question(s) and hypothesis,\npresenting figures from the paper, and/or commenting on whether the paper's data sufficiently\nsupports its claims.\n\n- In addition to the mandatory weekly reading, there will be one written assignment due Week\n8, and one final oral presentation during our last class meeting (Week 15).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 How To Build An Animal: Cell Fate and Identity in Development and Disease\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 1 Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-how-to-build-an-animal-cell-fate-and-identity-in-development-and-disease-fall-2017/808fa384945906bb31c3d7b413771e38_MIT7_342F17_Week_1_notes.pdf",
      "content": "-Identify the approach\n\n-Break down the results sections, bit by bit (cycle between the figures and text)\n\n-Compare the results to the author's conclusions\n\n-Take notes! Annotate, underline, highlight, summarize.\n\nThinking about cell fate and identity\n7.342 How to Build an Animal: Cell Fate and Identity in Development and Disease\nWeek One\n\nIntroductions\n\n-Write on the notecards your name, email address, course, year, previous relevant biology classes,\nwhether you've had experience with primary literature, and any extracurricular activities, hobbies, or interests.\n\n-Go around the table to share\n\n-Pass in the cards\n\nOverview of syllabus and expectations\n\n-The primary objective of this course is to learn how to read, analyze, and discuss primary scientific\nliterature.\n\n-!ttendance and participation in each week's discussion is mandatory.\n\n-There will be two assigned papers to read for each week's class.\n\n-Each week, you should come to class having read both papers and be prepared to discuss and critique\neach paper. This could entail articulating the paper's main question and hypothesis, presenting a figure from\nthe paper, and/or commenting on whether the paper's data sufficiently supports its claims.\n\n- In addition to the mandatory weekly reading, there will be one written assignment due Week 8, and\none final oral presentation during our last class meeting (Week 15).\n\n- More details on these assignments are within the syllabus.\n\n-This course is graded pass/fail. Attendance and participation, the written assignment, and the final\npresentation will all be components of your final grade.\n\nPrimary research\n\n-What constitutes a primary scientific research article?\n\n-novel data published within a peer-reviewed journal\n\n-i.e., not a review, not a news article, not a Wikipedia page\n\n-Articles have a typical structure; knowing this structure ahead of time can help orient the reader\n\n-Different journals use slightly different structures, so take the time to note the structure before diving\nin\n\n-Abstract (think: what's an abstract?)\n\n-Introduction/background\n\n-Main questions, hypothesis, and rationale for study\n\n-Results (containing both written text and figures)\n\n- the figures are the meat of the research article\n\n-Conclusions/Discussion (think: what's the difference between the results and the discussion?)\n\n-Methods\n\n-References\n\n-Supplementary Data\n-Where do we find primary research articles?\n\n-Pubmed, google scholar, web of science\n\n-How to read a paper:\n\n-Identify the big-picture question within the field\n\n-Go through the background, see if you can summarize the big points in your head\n\n-Identify the specific questions/goal of the paper\n\n-There are many different cell types that we're familiar with and that scientists have characterized. How\nmany specific cell types can you name? (Examples: Stem cell, germ cell, etc. Types of brain cells (neurons,\nastrocytes, oligodendrocytes, microglia), types of immune cells (T cells, B cells, dendritic cells, macrophages),\ntypes of bone cells (osteoclasts, osteoblasts), types of epithelial cells, etc.)\n\n-How do scientists identify and classify different cell types?\n\n-Imagine more basic and more complex ways of identification:\n\n-What does the cell look like? (microscopy)\n\n-What does the cell do over time? (microscopy, functional capabilities)\n\n-What genes are transcribed?\n\n-What proteins are present?\n\n-What signals does the cell express and/or secrete?\n\n-Germ cells are the specialized haploid cells that fuse and give rise to the next generation (sperm and\negg). Somatic cells are everything else.\n\n-!n important facet of a cell's identity is its potency.\n\nPotency is the degree to which a cell is able to give rise to other cell types.\n\nLevels of potency: Totipotency, Pluripotency, Multipotency, Oligopotency, Unipotency.\n\nTotipotency - embryonic and extraembryonic tissue\n\nPluripotency - all three germ layers (endoderm, mesoderm, ectoderm)\n\nEndoderm: interior stomach lining, gastrointestinal tract, the lungs\n\nMesoderm: muscle, bone, blood, urogenital\n\nEctoderm: epidermal tissues and nervous system\n\nSperm +\nEgg = Zygote\n\nBlastocyst\n\n(totipotent) (cell division) (pluripotent inner cell mass;\n\n\"embryonic stem cells\")\n-Waddington's landscape\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 How To Build An Animal: Cell Fate and Identity in Development and Disease\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 2 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-how-to-build-an-animal-cell-fate-and-identity-in-development-and-disease-fall-2017/4b5ee221a6d43ac489f042d671071ddd_MIT7_342F17_Week_2_handout.pdf",
      "content": "7.342 How to Build an Animal: Cell Fate and Identity in Development and Disease\nWeek Two\nMartin, 1981\nTerms and concepts of note:\n-\nTeratocarcinoma vs. teratoma\n-\nDifferentiated vs. undifferentiated\n-\nCell culture and conditioned media\n-\nNeoplastic conversion\n-\nAthymic mice\n\nTakahashi & Yamanaka, 2006\nTerms and concepts of note:\n-\nSelection assays using antibiotic resistance\n-\nMouse embryonic fibroblasts as feeder cells\n-\nDNA methylation and histone modifications\n-\nSSEA-1 and alkaline phosphatase\n-\nThe three germ layers: mesoderm, endoderm, ectoderm\n\nLooking Ahead:\nSilva et al, 2009: Nanog is the Gateway to the Pluripotent Ground State\n-\nWhat is meant by the \"pluripotent ground state\"?\n-\nWhat's the distinction between ES cells, iPS cells, and epiSCs?\n-\nHow is Nanog's function distinct from the \"canonical quartet of transcription factors\" from Takahashi\nand Yamanaka?\n-\nWhat is the significance of X chromosome in-/re-activation as it relates to pluripotency?\n\nAng et al, 2011: Wdr5 Mediates Self-Renewal and Reprogramming via the Embryonic Stem Cell Core\nTranscriptional Network\n-\nWhat are different types of epigenetic marks, and what does each indicate?\n-\nWhat are \"bivalent domains\"?\n-\nHow does ChIP-Seq work?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 How To Build An Animal: Cell Fate and Identity in Development and Disease\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 3 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-how-to-build-an-animal-cell-fate-and-identity-in-development-and-disease-fall-2017/aae206d22473d5c7be0b1bc52c485db1_MIT7_342F17_Week_3_handout.pdf",
      "content": "Looking Ahead:\nBernstein et al, 2006: A Bivalent Chromatin Structure Marks Key Developmental Genes in Embryonic Stem\nCells\n-\nWhat is the biological significance of highly conserved noncoding elements (HCNEs)?\n-\nWhat is the proposed purpose for bivalent domains in ES cells?\n-\nHow does sequential ChIP work?\n-\nWhat is the biological significance of transposon exclusion zones?\n\nLesch et al, 2013: Parallel evolution of male germline epigenetic poising and somatic development in\nanimals\n-\nWhy does the analysis include five mammals and one avian species? (i.e., what purpose does the avian\nspecies serve?)\n-\nHow do the cell types studied in Lesch et al compare with those studied in previous papers?\n-\nHow is the 'core' set of poised genes determined?\n-\nHow do poised genes in the 'core' set differ biologically from poised genes not in the 'core' set?\n\n7.342 How to Build an Animal: Cell Fate and\nIdentity in Development and Disease\nWeek Three\n\nSilva et al, 2009\nTerms and concepts of note:\n-\nPluripotent ground state\n-\nES cells vs. iPS cells, vs. epiSCs, vs. epi-iPS cells\n-\nPartial reprogramming\n-\nX chromosome inactivation and reactivation in development\n\nAng et al, 2011\nTerms and concepts of note:\n-\nThe Polycomb complex\n-\nThe Trithorax complex\n-\nProtein occupancy at gene promoters\n-\nshort hairpin RNA (shRNA) knockdowns\n-\nFlag and Myc epitope tags\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 How To Build An Animal: Cell Fate and Identity in Development and Disease\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 7 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-how-to-build-an-animal-cell-fate-and-identity-in-development-and-disease-fall-2017/b1ad2a02fffc6362168ffe4e645c8789_MIT7_342F17_Week_7_handout.pdf",
      "content": "7.342 How to Build an Animal: Cell Fate and\nIdentity in Development and Disease\nWeek Seven\n\nCritiquing a research article\nThere are varying strategies and approaches for critiquing a research article, depending on available length,\nwhat the critique aims to accomplish, and the research article itself. Given the relative short length of the\nassignment (2 pages double-spaced), it is important to write clearly and tightly.\n\nHere are some questions to consider when critiquing a paper:\n-\nDoes the focus of the paper address an overarching gap in knowledge in the field?\n-\nIs the chosen research approach appropriate for the question and hypothesis?\no Does the model (whether a model organism, in vitro culture, etc.) make sense?\no Do the chosen experiments provide the most direct evidence for their question?\n-\nDoes the paper have sufficient evidence to answer their question(s)?\no Orthogonal types of experiments and data\no Sufficient positive and negative controls\no Biological and technical replicates\no Statistical power\n-\n!r± t ± ut ors' nt±rpr±ttons n° on lusons support±° (r)y t ± °t?\n-\nDo the authors sufficiently address any data that might be unusual or inconsistent with their\nconclusions?\n-\nDo the authors propose future experiments that make sense?\n\nThese questions are just a starting point to get you th\n\ninking about the paper. There may be other additional\ntypes of critique that you find t t r± r±l±vnt to t ± r±s±r pp±r t t you'v± os±n. The overall goal of the\ncritique is to communicate strengths and limitations of the paper. As a (hypothetical) researcher, what are the\nsalient take-home points of the paper? What does the paper truly add to the scientific field?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 How To Build An Animal: Cell Fate and Identity in Development and Disease\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 8 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/7-342-how-to-build-an-animal-cell-fate-and-identity-in-development-and-disease-fall-2017/0c5da445419639d2e1a9efde2be5b572_MIT7_342F17_Week_8_handout.pdf",
      "content": "Image removed due to copyright restrictions. Please see: Hematopoiesis in humans, by A. Rad - Own work, on\nWikimedia Commons. CC BY-SA 3.0\nhttps://en.wikipedia.org/wiki/Haematopoiesis#/media/File:Hematopoiesis_(human)_diagram.png\n7.342 How to Build an Animal: Cell Fate and\nIdentity in Development and Disease\nWeek Eight\n\nThe immune system is composed of numerous specialized cell\ntypes called hematopoietic cells, and the process through which\nthese cells differentiate from a stem cell to their final cell fate is\ncalled hematopoiesis.\n\nHematopoietic stem cells and early hematopoietic progenitors\nreside within the bone marrow, before dispersing throughout the\nbody based on their identity and function.\n\nPublic domain, FreeClipartNow.com\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n7.342 How To Build An Animal: Cell Fate and Identity in Development and Disease\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}