{
  "course_name": "Human Origins and Evolution",
  "course_description": "This course examines the dynamic interrelations among physical and behavioral traits of humans, environment, and culture to provide an integrated framework for studying human biological evolution and modern diversity. Topics include issues in morphological evolution and adaptation; fossil and cultural evidence for human evolution from earliest times through the Pleistocene; evolution of tool use and social behavior; modern human variation and concepts of race. The class also studies stone artifacts and fossil specimens.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Biological Anthropology",
    "Archaeology",
    "Social Science",
    "Anthropology",
    "Biological Anthropology",
    "Archaeology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nScope of the Subject\n\nAn introductory subject which presents the main outlines of human evolution, both physical and cultural. The subject's scope encompasses our immediate pre-hominid ancestors of the Miocene, dating to between 6 and 22 million years ago, and all subsequent hominids including anatomically modern\nHomo sapiens\nwho first appear within the past 150,000 years. The class charts hominid evolution from savanna/woodland dwelling primates with a distribution in tropical Africa to modern humans whose mental abilities and complex technology have enabled them to colonize all corners of the world. The class includes a survey of the late Pleistocene human cultural adaptations which formed the basis for the subsequent development of agricultural and pastoral based economies and urbanization which are the hallmarks of many human societies of the past 10,000 years. The subject concludes with discussion of modern human morphological variation and races.\n\nThe subject integrates recent research in human palaeontology and archaeology to examine the interconnections between human physical and cultural development during the course of human evolution. Beginning with the Oligocene and Miocene primate substratum, the subject examines the five subsequent major stages of hominid evolution: 1) the earliest hominids (australopithecines), 2) the earliest\nHomo\n, 3)\nHomo erectus\n, 4)\nHomo heidelbergensis\nand\nneanderthalensis\n, and 5) modern\nHomo sapiens\n. For each stage a synopsis of the historical highlights of previous research will be presented, as will a description of the hard fossil evidence contributing to our knowledge of the hominid's physical form. The archaeological evidence for the cultural behavior (including symbolic behavior, subsistence patterns, and the level of technological capabilities) represented in each stage will be discussed using the format of mini-case studies using selected archaeological sites including Olduvai Gorge, East Turkana, Olorgesailie, Terra Amata, Dolni Vestonice and Abu Hureyra.\n\nBy the very nature of the fossil and archaeological record the detailed history of human evolution can never be certainly known, but it is the subject's aim to provide students with an appreciation of what is reliably known (the \"facts\") about human evolution, what must remain informed speculation, and what avenues still remain to be investigated.\n\nSubject Mechanics\n\nTwo meetings per week: a combination of lectures, discussions, and practical handling of fossil casts and artifactual materials.\n\nRequired work: includes a midterm exam, several short lab exercises, quizzes, two reading commentaries and two 4-5 page response papers, a group based presentation in class and a second midterm exam given during exam period.\n\nN.B.\nattendance at lectures and participation in the discussions will be considered in evaluating your performance in this class.\n\nOverall Weight of Assignments\n\nACTIVITIES\n\nPERCENTAGES\n\nReading Response - Waal and Mitani\net al\nPapers (3 Pages)\n\n6%\n\nOsteology Quiz\n\n5%\n\nEarly Hominid Variation Discussion\n\n12%\n\nIsaac / Lovejoy / Bingham Reading Discussion (4-5 Pages)\n\n11%\n\nFirst Midterm Examination\n\n22%\n\nShipman\net al\nReading - Logic Evaluation - 1 Page Outline\n\n4%\n\nBinford - Mousterian Critique (4-5 Pages)\n\n11%\n\nReading Response - Diamond / Molleson Papers (3 Pages)\n\n6%\n\nSecond Midterm Examination (Exam Period)\n\n23%\n\nCalendar\n\nSES #\n\nTOPICS\n\n1-2\n\nIntroduction: The Search for Human Ancestors, Approaches to the Study of Human Evolution and an Introduction to Human Osteology\n\n3-4\n\nEvolutionary Processes and Time Scales\n\nModern Primates and Their Relevance to Understanding Human Origins\n\nTertiary Higher Primates: Our Pre-Hominid Predecessors\n\n7-8\n\nEarliest Hominids: The Australopithecines and Affines\n\nEarly Hominids - Variations and Taxonomy - Presentations\n\nHominid / Human Origins: Hypotheses and Speculation\n\nEarly\nHomo\n: How Should\nHomo\nBe Defined?\n\n12-13\n\nThe Archaeology of the Early Hominids I: Olduvai Gorge and Koobi Fora\n\nThe Archaeology of the Early Hominids II: Interpreting Early Hominid Behavior and Current Research Directions\n\nMidterm Exam\n\nHomo ergaster\nand\nerectus\n: Emerging Modern Morphology\n\nSlowly Emerging Modern Behaviors: Early Stone Age / Lower Palaeolithic Age\n\nHomo heidelbergensis\nand\nneanderthalensis\nor Early \"Archaic\"\nH. sapiens\n?\n\n19-20\n\n\"Archaics\": Not Quite Us Physically, Not Quite Us Mentally\n\nOrigin of Modern\nHomo sapiens\n: Morphology and Genetic Evidence\n\n22-23\n\nModern\nHomo sapiens\nI: Cultural Diversity Becomes the Norm\n\nModern\nHomo sapiens\nII: To the Threshold of Civilization\n\n25-26\n\nModern Human Diversity: Distribution, Morphological Variation and \"Races\"",
  "files": [
    {
      "category": "Resource",
      "title": "discussion.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/aa9397b07f30965bbb04de8303726318_discussion.pdf",
      "content": "------------------------\n3.987\n-\nHuman Origins and Evolution\nSpring, 2006\n\"Discussion\" project: Early hominid (hominin) variation and species identification\nBackground:\nOver the past three decades an increasing number of early hominid and putative early hominid fossils\nhave been found in northern and eastern Africa. These fossils range between 7.0 and 1.75 million years ago.\nMoreover, there has been a proliferation of new names to describe these fossils. Some of these new taxa of\naustralopithecines include:\nmajor issues of controversy\nAustralopithecus afarensis\nhomogeneity of specimens referred to the taxa\nAustralopithecus anamensis\ndifference from A. afarensis and other australopiths\nAustralopithecus garhi\ndifference from all other australopiths\nAustralopithecus bahrelghazali\ndifference from A. afarensis\nKenyanthropus platyops\nvalidity of genus and difference from all other australopiths\nParanthropus aethiopicus (aka Australopithecus) differences between one another\nParanthropus boisei\nArdipithecus ramidus\ndifferences from A afarenis and one another\nArdipithecus kadabba\nSahelanthropus tchadensis\nevidence for status as hominid\nOrrorin tugenensis\nevidence for status as hominid\nThe issues are, to what extent are these taxa actually different from one another, and is the\nestablishment of so many separate species either justified or useful? What are the researchers trying to\naccomplish by naming new genera and species?\nIn this particular case we are going to examine the Paranthropus taxa. Notice too that many\nresearchers do not recognize Paranthropus as a distinct genus here, but call it Australopithecus.\nFor your short paper compile a table which lists the diagnostic features which are said to distinguish\nthe taxa boisei and aethiopicus. (Appendix III in your textbook is great for this purpose.) Whenever\npossible also include those basic features which distinguish the taxa from panids (chimps) as well as those\nfeatures which distinguish it from the other early hominids. (This may also require you to check the\ndescriptions of some of the other hominids - see Asfaw et al. 1999 for such a list.) Write a commentary\nwhich considers generally what the problems may be in recognizing fossil genera and species in human\npalaeontology. Consider whether recognition of this particular genus and these two species seems justified,\n(both by definition and by amount of material) and separated enough in time and space to be useful in\npalaeoanthropological research. Limit your discussion to 4 (double spaced) pages, plus your table.\nDue:\nMarch 8\nP.T.O.\n\nReferences for the early hominid variability discussion\nFor a general reference and discussion see your textbook.\nCampbell, B.G., J.D. Loy and K. Cruz-Uribe\nHumankind Emerging (9th ed.). (esp. Appendix III)\nor\nCampbell, B.G. and J.D. Loy\nHumankind Emerging (8th ed.). (esp. Appendix III)\nFor a commentary on the practicality of recognizing palaeontological taxa.\nDelson, E.\n1997. One skull does not a species make. Nature 389:445-46\nother useful refs.\nAsfaw, B., T. White, O. Lovejoy, B. Latimer, S. Simpson, and G. Suwa\nAustralopithecus garhi: a new species of early hominid from Ethiopia.\nScience 284:629-635.\nuseful chart\nGrine, F.E.\nAustralopithecine taxonomy and phylogeny: historical background and recent\ninterpretation, in R.L. Ciochon and J.G. Fleagle (eds.) The Human Evolution Source\nBook. Prentice Hall, pp. 198-210.\nLeakey, M.G., F. Spoor, F.H.Brown, P.N. Gathogo, C. Kiarie, L.N. Leakey, and I. McDougall.\nNew hominin genus from eastern Africa shows diverse middle Pliocene lineages.\nNature 410:433-440.\nuseful chart\nSuwa, G., B. Asfaw, Y. Beyne, T.D. White, S.Katoh, S. Nagaoka, H. Nakaya, K. Uzawa, P. Renne\nand G. WoldeGabriel.\nThe first skull of Australopithecus boisei. Nature 389:489-92.\nWalker, A., R.E. Leakey, J.M. Harris, and F.H. Brown.\n2.5-Myr Australopithecus boisei from west of Lake Turkana, Kenya. Nature 322:517-22."
    },
    {
      "category": "Resource",
      "title": "guide_for_refs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/aa6d4c12dc9d3b5eb5dcb170a5ff3c39_guide_for_refs.pdf",
      "content": "3.987 - Human Origins and Evolution\nBibliographic referencing and citations\nSeveral slightly different styles are used for bibliographic referencing and citation in the\ndisciplines of Anthropology and Archaeology. One of the most widely used styles is that\nfollowed by the journal American Anthropologist. You should use it for your written work in\nthis course. Sample references for journal articles, books and papers in books are shown below.\nAll types of references are listed alphabetically in one list regardless of the source in book,\njournal, etc. \"References Cited\" sections are normally single-spaced.\n(examples for journals)\nBrown, F., J. Harris, R. Leakey and A. Walker\nl985\nEarly Homo erectus Skeleton from West Lake Turkana, Kenya. Nature\n316:788-792.\nIsaac, G. Ll.\nThe Food-Sharing Behavior of Protohuman Hominids. Scientific American\n238(4):90-109.\nMann, A. and E. Trinkaus\nNeandertal and Neandertal-like Fossils from the Upper Pleistocene.\nYearbook of Physical Anthropology 17:169-193.\n(examples for books)\nReader, J.\n1981 Missing Links: the Hunt for Earliest Man. London: William Collins Sons\nand Co.\nWolpoff, M.H.\nPaleoanthropology. New York: Knopf.\n(examples for papers in books)\nLeakey, M.D.\n1974 Cultural Patterns in the Olduvai Sequence. In After the Australopithecines.\nK.W. Butzer and G. Ll. Isaac, eds. Pp. 477-493. The Hague: Mouton.\nZihlman, A.\n1981 Women as Shapers of the Human Adaptation. In Woman the Gatherer.\nF. Dahlberg, ed. Pp. 75-120. New Haven, CT: Yale University Press.\nIn most palaeoanthropological writing footnotes are not used for citations. Instead the\nauthor's last name and the date of the publication are placed in parentheses at the end of the\nsentence (but within it), to acknowledge the source of the idea or information. Similarly, the\nsource for a quotation is given in parenthesis at the end of the quote. The citation includes the\nauthor's name, date and page number. The following citations are based on the references above.\nstandard citation\ncitation for a quote\n(Isaac 1978).\n(Isaac 1978:95).\n(Mann and Trinkaus 1973).\n(Mann and Trinkaus 1973:192).\n(Brown et al. l985).\n(Brown et al. l985:790).\nrev: 2/7/07"
    },
    {
      "category": "Resource",
      "title": "guidelines_refs.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/d7d7a8ba977feec821d8da2b185db700_guidelines_refs.pdf",
      "content": "3.987 - Human Origins and Evolution\nBibliographic referencing and citations\nSeveral slightly different styles are used for bibliographic referencing and citation in the\ndisciplines of Anthropology and Archaeology. One of the most widely used styles is that\nfollowed by the journal American Anthropologist. You should use it for your written work in\nthis course. Sample references for journal articles, books and papers in books are shown below.\nAll types of references are listed alphabetically in one list regardless of the source in book,\njournal, etc. \"References Cited\" sections are normally single-spaced.\n(examples for journals)\nBrown, F., J. Harris, R. Leakey and A. Walker\nl985\nEarly Homo erectus Skeleton from West Lake Turkana, Kenya. Nature\n316:788-792.\nIsaac, G. Ll.\nThe Food-Sharing Behavior of Protohuman Hominids. Scientific American\n238(4):90-109.\nMann, A. and E. Trinkaus\nNeandertal and Neandertal-like Fossils from the Upper Pleistocene.\nYearbook of Physical Anthropology 17:169-193.\n(examples for books)\nReader, J.\n1981 Missing Links: the Hunt for Earliest Man. London: William Collins Sons\nand Co.\nWolpoff, M.H.\nPaleoanthropology. New York: Knopf.\n(examples for papers in books)\nLeakey, M.D.\n1974 Cultural Patterns in the Olduvai Sequence. In After the Australopithecines.\nK.W. Butzer and G. Ll. Isaac, eds. Pp. 477-493. The Hague: Mouton.\nZihlman, A.\n1981 Women as Shapers of the Human Adaptation. In Woman the Gatherer.\nF. Dahlberg, ed. Pp. 75-120. New Haven, CT: Yale University Press.\nIn most palaeoanthropological writing footnotes are not used for citations. Instead the\nauthor's last name and the date of the publication are placed in parentheses at the end of the\nsentence (but within it), to acknowledge the source of the idea or information. Similarly, the\nsource for a quotation is given in parenthesis at the end of the quote. The citation includes the\nauthor's name, date and page number. The following citations are based on the references above.\nstandard citation\ncitation for a quote\n(Isaac 1978).\n(Isaac 1978:95).\n(Mann and Trinkaus 1973).\n(Mann and Trinkaus 1973:192).\n(Brown et al. l985).\n(Brown et al. l985:790).\nrev: 2/7/07"
    },
    {
      "category": "Resource",
      "title": "outline.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/af3c71f3fc0b072a2432c23248e380e0_outline.pdf",
      "content": "3.987 - Human Origins and Evolution\nSpring, 2006\nReading Response: Butchery of giant geladas (4%) - Due April 19th\nPlease read the following article.\nShipman, P., Bosler, W. and Davis, K.L.\nButchering of giant geladas at an Acheulian site.\nCurrent Anthropology 22:257-68.\n(Also read commentaries following this article.)\nPerhaps the best case for systematic hunting by Homo erectus anytime during the Early Stone\nAge, prior to 400,000 bp, can be made based on the evidence from the site of Olorgesailie in\nKenya, dated to about 700,000 years ago.\nIn one or two pages (max.) outline or summarize the argument (and it's structure) which the\nauthors present. (Don't simply outline the paper.)"
    },
    {
      "category": "Resource",
      "title": "study_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/a8389055678b864080f7633ad7c5838c_study_guide.pdf",
      "content": "______________________________________________________________________\n______________________________________________________________________\n3.987:\nHuman Origins and Evolution\nSpring, 2007\nMidterm - Review and Study Questions\nThe midterm exam consists of a \"closed book\" examination given in class on April 4th. The examination\nwill cover all the readings listed on the syllabus through April 2nd.\nDuring the examination you will be asked to: 1) identify, define and associate a number of terms, concepts\nand items, 2) place some of these items in chronological order and 3) write a short essay.\n1.\nIdentifications: consists of Jeopardy-style questions and a series of short (one paragraph)\nidentifications of various places, sites, objects, ideas, theories and concepts. At a minimum you\nshould identify or define the term and include information as to its age and geographic location,\nwhere appropriate. Also indicate its significance in (or to) the study of human evolution.\nThe identifications will be drawn from the \"Key terms\" sheets for the lectures. (Key terms sheets for\nlectures 1-3, 4, 6, 7-9, 10, 11 and 12-14.) [Vocab sheets #1 - 7 on the website.]\n2) Temporal framework - be prepared to place the following sites, taxa and technologies in\ntheir proper chronological relationships on a table similar to the attached sheet.\nPleistocene\nCenozoic Era\nMiocene\nAegyptopithecus\nSivapithecus\nProconsul\nSahelanthropus\nArdipithecus\nDryopithecus\n(Australopithecus)\nA. anamensis\nA. afarensis\nA. africanus\nKenyanthropus platyops\nParanthropus aethiopicus (KNM WT 17000)\nP. boisei\nHomo\nHomo rudolfensis\nHomo habilis\nLower Palaeolithic/Early Stone Age\nhard hammer technology\nunretouched flake\nchopper\nOlduvai Gorge\nOldowan Industry\nDK I site\nFtJi 1 and 2 sites\nKBS site\nFxJj 50\n3) Essay -\nbe prepared to write a one essay (no choice - the essay will be selected from\namong the following possibilities.)\n-)\nWhy is it so difficult for palaeoanthropologists to determine how many hominin species and genera\nthey have discovered, and how they relate to one another phylogenetically? Consider the nature of\nthe fossil record and the challenges of recognizing species in the fossil record. Provide specific\nexamples using problematic specimens or taxa when appropriate\n-)\nBipedalism is the principal defining characteristic of the earliest hominins. What are the selection\npressures commonly cited as potential major contributors to the development of bipedalism.\nWhich of these pressures do you feel warrant the most serious consideration and why?\nP.T.O\n\n-)\nIsaac in his food-sharing behavior paper (1978) proposes that the core of modern human home base\nand food sharing behaviors were present at archaeological sites in eastern Africa at ca. 2 million\nyears ago. What other explanations might account for the associations of stone and bone at these\nearly sites.\n-)\nDescribe what we think we know of the lifestyles of two of the best known australopithecine\ngenera (Australopithecus and Paranthropus). Be sure to include information about habitat,\nlocomotion (i.e., the variety, if any, of locomotor patterns), diet, and material culture.\n\n____________________________________________________________________________________________________________________\nPart 2\n-\nCulture-stratigraphic table:\nN a m e : _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _\nTime\n\"AGE\"\nBiological\nIndustry or\nSite\nTechnology/\n(yrs BP)\n\"Era\"\ntaxa\n\"culture\"\nartifact type\nPresent\n12,000\n50,000\n100,000\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n200,000\n500,000\n1,000,000\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n1,500,000\n2,000,000\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n3,000,000\n4,000,000\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n- -\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n6,000,000\n10,000,000\n20,000,000\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n\n30,000,000\n65,000,000"
    },
    {
      "category": "Resource",
      "title": "paper1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/caf8888ac5424ddc92501041680a8beb_paper1.pdf",
      "content": "3.987 - Human Origins and Evolution\nSpring, 2006\nReading response paper # 1: Chimp and bonobo behavior and its relevance to interpreting\nearly hominid behavior.\nRead the following three sources for background, and refer to your handout on defining\nhumanness for possible physical and behavioral issues to address.\nWaal, F. de\nBonobo sex and society. Scientific American 272(3):82-88.\n(March issue)\nMitani, J.C., D.P. Watts and M.N. Muller\nRecent Developments in the Study of Wild Chimpanzee Behavior.\nEvolutionary Anthropology\n11(1):9-25.\nCampbell B.G., J.D. Loy and K.Cruz-Uribe\nHumankind Emerging (9th ed.). Ch. 4 and especially pp. 115-128.\nOn the basis of these readings in what ways do you think that bonobos would make better\nmodels (analogs) for interpreting early hominid (hominin) behavior than common chimps?\nIn what ways might chimps make better analogs? Present specific examples of physical or\nbehavioral characteristics which support your view. Limit your discussion to 4 pages.\nPlease use the referencing style summarized in the handout on the reverse.\nDue: February 22"
    },
    {
      "category": "Resource",
      "title": "read_response1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/a6d861b5923e190d82ab97585664ff66_read_response1.pdf",
      "content": "3.987 - Human Origins and Evolution\nSpring, 2007\nReading response paper # 1: Chimp and bonobo behavior and its relevance to interpreting\nearly hominid behavior.\nRead the following three sources for background, and refer to your handout on defining\nhumanness for possible physical and behavioral issues to address.\nWaal, F. de\nBonobo sex and society. Scientific American 272(3):82-88.\n(March issue)\nMitani, J.C., D.P. Watts and M.N. Muller\nRecent Developments in the Study of Wild Chimpanzee Behavior.\nEvolutionary Anthropology\n11(1):9-25.\nCampbell B.G., J.D. Loy and K.Cruz-Uribe\nHumankind Emerging (9th ed.). Ch. 4 and especially pp. 115-128.\nOn the basis of these readings in what ways do you think that bonobos would make better\nmodels (analogs) for interpreting early hominid (hominin) behavior than common chimps?\nIn what ways might chimps make better analogs?\nPresent specific examples of physical or\nbehavioral characteristics which support your view. Limit your discussion to 4 pages.\nPlease use the referencing style summarized in the handout on the reverse.\nDue: February 21"
    },
    {
      "category": "Resource",
      "title": "paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/e7c229b4864832268a9da6baa2f77fc2_paper2.pdf",
      "content": "______________________________________\n3.987 -\nHuman Origins and Evolution\nSpring, 2006\nReading response paper # 2 - Contrasting views of the origins of humans: Isaac, Lovejoy and Bingham\nPlease read the three journal articles referenced below. Then write a 4-5 page (double spaced) paper in\nresponse to these readings. (Remember to reference your sources and please do not exceed 7 pages.) Please\nthink about and address the following issues and questions in your paper.\nHumans in general, tend to look for simple, single causal explanations of the complex phenomena\naround them. Certainly there has been no dearth of this type of explanation in palaeoanthropology.\nHistorically, numerous single factors have been cited as the primary or triggering force behind the origins of\nhominids and of humans, even if a somewhat more integrated multi-factor approach has gradually emerged\nrecently. The papers by Bingham, Isaac, and Lovejoy represent some of the more recent views and arguments\nconcerning \"human\" origins. Lovejoy deals largely with the origin of hominids and bipedalism in the 7 - 4\nmyr. time range. Isaac and Bingham with the origins of larger brained modern humans, essentially post -2.5\nmyr.\n1)\nBriefly review the central points of each model, paying close attention to what types of evidence and\narguments are used to support the models. To what extent are the models in marked opposition and to\nwhat extent are they complementary?\n2)\nHow would you go about testing the data and assumptions in each of these models? Can you suggest\nany such tests or predictions? Can such models be tested scientifically?\n3)\nDoes any one of these models seem particularly compelling to explain why either hominids or larger\nbrained humans evolved in the directions they did? And if so, why? For the others what seems to be\ntheir principal weaknesses.\nFor additional ideas and views, read Chapter 9 of either the 9th or 8th ed. of the text for Campbell and Loy's\ndiscussion of the ideas presented in Lovejoy and Isaac.\nReadings:\nBingham, P.M. 2000. Human evolution and human history: a complete theory. Evolutionary\nAnthropology 9(6):248-257.\nIsaac, G. Ll. 1978. The food-sharing behavior of protohuman hominids. Scientific American 238(4):90\n109. (April issue)\nLovejoy, O. 1993. Modeling human origins: are we sexy because we're smart, or smart because we're\nsexy? In: The Origin and Evolution of Humans and Humanness, (Ed.) D.T. Rasmussen.\nBoston: Jones and Bartlett, 1993, pp. 1-28.\nDue:\nMarch 22nd\nN.B.\nMake sure that you adequately reference and cite the sources of your readings. Please use the standard\nanthropological referencing format provided with the first discussion paper assignment."
    },
    {
      "category": "Resource",
      "title": "read_response2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/53ae05f5fd5907a1345e7aa54c43809f_read_response2.pdf",
      "content": "______________________________________\n3.987 -\nHuman Origins and Evolution\nSpring, 2007\nReading response paper # 2 - Contrasting views of the origins of humans: Isaac, Lovejoy and Bingham\nPlease read the three journal articles referenced below. Then write a 4-5 page (double spaced) paper in\nresponse to these readings. (Remember to reference your sources and please do not exceed 7 pages.) Please\nthink about and address the following issues and questions in your paper.\nHumans in general, tend to look for simple, single causal explanations of the complex phenomena\naround them. Certainly there has been no dearth of this type of \"explanation\" in palaeoanthropology.\nHistorically, numerous single factors have been cited as the primary or triggering force behind the origins of\nhominins and of humans, even if a somewhat more cautious and nuanced multi-factor approach has gradually\nemerged recently. The papers by Bingham, Isaac, and Lovejoy represent some of the traditional views and\narguments concerning \"human\" origins. Lovejoy deals largely with the origin of hominins and bipedalism in\nthe 7 - 4 myr. time range. Isaac and Bingham with the origins of larger brained modern humans, essentially\npost -2.5 myr.\n1)\nBriefly review the central points of each model, paying close attention to what types of evidence and\narguments are used to support the models. To what extent are the models in marked opposition and to\nwhat extent are they complementary?\n2)\nHow would you go about testing the data and assumptions in each of these models?\nany such tests or predictions? Can such models be tested scientifically?\nCan you suggest\n3)\nDoes any one of these models seem particularly compelling to explain why either hominids or larger\nbrained humans evolved in the directions they did? And if so, why? For the others what seems to be\ntheir principal weaknesses.\nFor additional ideas and views, read Chapter 9 of either the 9th or 8th ed. of the text for Campbell et al.'s\ndiscussion of the ideas presented in Lovejoy and Isaac.\nReadings:\nBingham, P.M. 2000. Human evolution and human history: a complete theory. Evolutionary\nAnthropology 9(6):248-257.\nIsaac, G. Ll. 1978. The food-sharing behavior of protohuman hominids. Scientific American 238(4):90\n109. (April issue)\nLovejoy, O. 1993. Modeling human origins: are we sexy because we're smart, or smart because we're\nsexy? In: The Origin and Evolution of Humans and Humanness, (Ed.) D.T. Rasmussen.\nBoston: Jones and Bartlett, 1993, pp. 1-28.\nDue: March 21st\nN.B.\nMake sure that you adequately reference and cite the sources of your readings. Please use the standard\nanthropological referencing format provided with the first discussion paper assignment."
    },
    {
      "category": "Resource",
      "title": "paper3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/c426e70e9185f550f9ee7636d2018bd7_paper3.pdf",
      "content": "_____________________\n____________________\n3.987 -\nHuman Origins and Evolution\nSpring 2006\nReading discussion paper #3: Due April 26th\nContrasting views of the behavior of Neandertals:\nPlease read Chapters 12-14 in Campbell et al. [Chapters 14 and 15 in Humankind Emerging (8th ed)] for\nbackground information on later Middle Pleistocene and early Upper Pleistocene hominids. In the past many\nresearchers (the lumpers) have considered them generally as \"archaic\" H. sapiens. The splitters, including Campbell\net al., see them as representing multiple species, variously classified as H. antecessor, H. heidelbergensis, H.\nneanderthalensis and H. sapiens (although the known scant fossil record for the last only begins about 120,000 years\nago).\nDespite the splitters' view that Neandertals represent a separate species, the absence of a significant\narchaeological record for the earliest H. sapiens (before about 50,000 years ago), encourages many researchers to view\nNeandertal behavior, for which we have a pretty good record, as prototypic of early modern sapiens behaviors.\nCampbell et al.'s view is typical of the consensus view. In sharp contrast are the views of archaeologist Lewis\nBinford, presented in the journal article by Fischman referenced below. Binford postulates a very distinctive\n?hunting? and gathering adaptation for Neandertals based on a gender based division of labor (or lack thereof).\nAfter reflecting on the behaviors of the very large brained Neandertals that Campbell et al. describe, prepare\na 4 page (double spaced) paper in response to Campbell and Loy's and Binford's discrepant views. Please think\nabout and address the following issues in your paper. What are the Neandertal behaviors that still appear archaic, and\nwhich appear to verge on modernity and may likely have been shared with early modern Homo sapiens? What kind\nof adaptation is Binford proposing? In view of Isaac's and Lovejoy's arguments that food sharing and provisioning\nexist much earlier, not to mention Bingham's view that large brains reflect complex coalitions!, how reasonable do\nyou think Binford's arguments about Neandertal social and economic behaviors may be? Can you think of\nalternative behavioral patterns that Neandertals might have exhibited that could have created the patterning in the\nartifacts and bones that Binford observed in the Combe Grenal sites?\nReadings:\nFischman, J. 1992.\nHard Evidence. Discover 13(2):44-51. (February 1992)\nCampbell, B., J. Loy and K. Uribe 2006.\nHumankind Emerging. 9th Ed. Chapters 12 - 14.\nor\nCampbell, B. and Loy, J.D. 2000.\nHumankind Emerging. 8th Ed. Chapters 14 and 15.\nN.B.: 1.\nNumber your pages\n2.\nProvide references to the sources of information presented in your paper, both in\nthe text and in a \"references cited\" section.\n3.\nProofread your paper carefully."
    },
    {
      "category": "Resource",
      "title": "compiled_fyi.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/68d29690246ab64a986483c28bddf84d_compiled_fyi.pdf",
      "content": "3.987 -\nHuman Origins and Evolution\nSpring 2006\nList of FYI's\n-\ne-mailed \"handouts\" and communications\nThe following items were circulated to students before or after lectures as background and/or follow-up\ninformation on questions and points raised in specific lectures.\nLecture 6\nFYI #1\nOreopithecus\nLecture 8\nFYI #2\nTooth formation rates\nLecture 11\nFYI #4\nThe gluteus maximus\nLecture 8\nFYI #5\nOn the diet of australopithecines\nLecture 12\nFYI #6\nOn early stone tool use\nLecture 17\nFYI #7\nHeadstrong hominids\nLecture 17\nFYI #9\nTan-Tan Acheulian figurine\nLecture 17\nFYI #10\nSchoningen spear\nLecture 15\nFYI #11\nThe role of cooking in human evolution\nLecture 21\nFYI #12\nEarly sapiens mtDNA in Australia\nLecture 21\nFYI #13\nPossible Neandertal/sapiens hybrid?\nLecture 20\nFYI #14\nNeandertal mobility patterns\nLecture 22\nFYI #17\nOne last mystery at Dolni Vestonice\n--------------------------\n\n--------------------------\nFYI #1 - Oreopithecus\nDate: 3/2/06\nI threatened you with some spam about Oreopithecus, a Miocene, possibly bipedal, ape. Well here it is.\nAs I mentioned one of the really interesting recent discoveries is that there may have been another genus of now\nextinct apes which independently developed bipedalism. The candidate is Oreopithecus a 9 to 7 million year old\ngenus of European ape, however, your textbook authors don't provide any real discussion of this evidence or this\npossibility. The genus Oreopithecus has been recognized for over 130 years, it being one of the first fossil apes to be\ndiscovered and described. Below are several references and abstracts of relatively recent papers which have reanalyzed\nthe Oreopithecus remains and have somewhat controversially proposed that Oreopithecus was a habitual biped. It is\nclear that even if Oreopithecus turns out to be a biped, other physical features strongly suggest that it wasn't in the\nancestral lineage leading to humans.\nKohler, Meike and Salvador Moya-Sola\nApe-like or hominid-like? The positional behavior of Oreopithecus bambolii reconsidered.\nProc. Natl. Acad. Sci. USA Vol. 94, pp. 11747-11750, October 1997.\nAbstract: Comparative morphological and functional analyses of the skeletal remains of Oreopithecus bambolii, a\nhominoid from the Miocene Mediterranean island of Tuscany-Sardinia (Italy), provides evidence that bipedal activities\nmade up a significant part of the positional behavior of this primate. The mosaic pattern of its postcranial morphology is\nto some degree convergent with that of Australopithecus and functionally intermediate between apes and early hominids.\nSome unique traits could have been selected only under insular conditions where the absence of predators and the\nlimitation of trophic resources play a crucial role in mammalian evolution.\nRook, Lorenzo, Luca Bondioli, Meike Kohler, Salvador Moya-Sola and Roberto Macchiarelli\nOreopithecus was a bipedal ape after all: evidence from the iliac cancellous architecture.\nProc. Natl. Acad. Sci. USA Vol. 96, Issue 15, 8795-8799, July 20, 1999.\nAbstract: Textural properties and functional morphology of the hip bone cancellous network of Oreopithecus bambolii, a\n9- to 7-million-year-old Late Miocene hominoid from Italy, provide insights into the postural and locomotor behavior of\nthis fossil ape. Digital image processing of calibrated hip bone radiographs reveals the occurrence of trabecular features,\nwhich, in humans and fossil hominids, are related to vertical support of the body weight, i.e., to bipedality.\nMoya-Sola, Salvador, Meike Kohler and Lorenzo Rook\nEvidence of hominid-like precision grip capability in the hand of the Miocene ape Oreopithecus.\nProc. Natl. Acad. Sci. USA Vol. 96, Issue 1, 313-317, January 5, 1999.\nAbstract: Functional and allometric analyses of the hand of the late Miocene ape Oreopithecus bambolii (Tuscany,\nItaly) reveal a series of features that reflect an improved grasping capability including firm pad-to-pad precision\ngripping that apes are unable to perform. Related features such as hand length, relative thumb length, a deep and large\ninsertion area for the tendon of the long thumb flexor, and the form of the metacarpal 2/capitate articulation are not\npresent in extant or fossil apes. In these features, the Oreopithecus hand closely matches the pattern of early hominids,\npresumably as a response to similar functional demands.\nFYI #2 - more about hominid tooth formation than you probably wanted to know\nDate: 3/8/06\nI think an important part of your education in 3.987 should be for you to be aware of some of the amazing \"high tech\"\nstudies that have been undertaken recently in palaeoanthropology, even if we don't manage to discuss them in detail in\nlecture and your text barely mentions them.\nRemember on Monday I mentioned the age of the Taung australopithecine child at death and it's dental developmental\nsequence, the following article and abstract is a follow up. - The paper referenced below has a good general description\nof the technique of analyzing daily enamel formation increments, although it deals specifically with determining the\nages of two more recent Homo erectus individuals.\n\n--------------------------\n--------------------------\nThe paper dealing directly with the Taung child is by Bromage, T.G. and Dean, M.C. 1985, Re-evaluation of the age at\ndeath of immature fossil hominids. Nature 317:525-527.\nThe following is an elegant analytical study.\nDean, C., M.G. Leakey, D. Reid, F. Schrenk, G.T. Schwartz, C. Stringer & A. Walker.\nGrowth processes in teeth distinguish modern humans from Homo erectus and earlier hominins.\nNature 414:628-631.\nAbstract: A modern human-like sequence of dental development, as a proxy for the pace of life history, is regarded as\none of the diagnostic hallmarks of our own genus Homo. Brain size, age at first reproduction, lifespan and other life-\nhistory traits correlate tightly with dental development . Here we report differences in enamel growth that show the\nearliest fossils attributed to Homo do not resemble modern humans in their development. We used daily incremental\nmarkings in enamel to calculate rates of enamel formation in 13 fossil hominins and identified differences in this key\ndeterminant of tooth formation time. Neither australopiths nor fossils currently attributed to early Homo shared the slow\ntrajectory of enamel growth typical of modern humans; rather, both resembled modern and fossil African apes. We then\nreconstructed tooth formation times in australopiths, in the,1.5-Myr old Homo erectus skeleton from Nariokotome,\nKenya, and in another Homo erectus specimen, Sangiran S7-37 from Java. These times were shorter than those in\nmodern humans. It therefore seems likely that truly modern dental development emerged relatively late in human\nevolution.\nFYI #4 - The gluteus maximus\nDate: 3/20/06\nThis is a definite read! There's a news commentary , 'Faster Than a Hyena? Running May Make Humans Special' by\nCarl Zimmer in Science 306:1283 (19 Nov. 2004) that deals with recent research on the possible connections\nbetween the emergence of striding gait bipedalism, long distance endurance running and hunting. But more to your\nnext assignment - when you get around to evaluating Bingham's view of the role of the gluteus maximus muscle in\nhuman evolution, you might want to consider other possible functions for it, as reported herein. In fairness to\nBingham, he wrote in 2000 relying on older research, and this more detailed study came out in 2004.\nThe original article by Bramble and Lieberman which deals with their view of early hominid locomotion is:\nBramble, D.M. & D.E. Lieberman\nEndurance running and the evolution of Homo. Nature 432:345-352.\nAbstract: Striding bipedalism is a key derived behaviour of hominids that possibly originated soon after the divergence\nof the chimpanzee and human lineages. Although bipedal gaits include walking and running, running is generally\nconsidered to have played no major role in human evolution because humans, like apes, are poor sprinters compared to\nmost quadrupeds. Here we assess how well humans perform at sustained long-distance running, and review the\nphysiological and anatomical bases of endurance running capabilities in humans and other mammals. Judged by several\ncriteria, humans perform remarkably well at endurance running, thanks to a diverse array of features, many of which\nleave traces in the skeleton. The fossil evidence of these features suggests that endurance running is a derived capability\nof the genus Homo, originating about 2 million years ago, and may have been instrumental in the evolution of the human\nbody form.\n\n--------------------------\nFYI #5 - On the diet of australopithecines\nDate: 3/2006\nMore palaeoanthropological spam. We got into a discussion of the possibility of using isotopes to investigate diet\nsimilarity and food sharing in Isaac's Lower Pleistocene sites. While practically that would be a very long shot due to a\nlack of skeletal material, I mentioned it has been possible to look at diet of the australopithecines and paranthropines\nin southern Africa.\nIn recent years it has sometimes become possible to study the isotopic ratios of carbon, nitrogen and strontium in\nancient bone and teeth. This allows researchers to determine the types of plants and animals that may have been eaten\nby these creatures. References to three such studies of South African australopithecines and their diets are below. -\nObviously all of the australopithecines seem to have had fairly nutritious, widely variable, and potentially omnivorous\ndiets.\nSponheimer, Matt and Julia A. Lee-Thorp\nIsotopic evidence for the diet of an early hominid, Australopithecus africanus.\nScience 283:368-70\nAbstract: Current consensus holds that the 3-million-year-old hominid Australopithecus africanus subsisted on fruits and\nleaves, much as the modern chimpanzee does. Stable carbon isotope analysis of A. africanus from Makapansgat\nLimeworks, South Africa, demonstrates that this early hominid ate not only fruits and leaves but also large quantities of\ncarbon-13- enriched foods such as grasses and sedges or animals that ate these plants, or both. The results suggest that\nearly hominids regularly exploited relatively open environments such as woodlands or grasslands for food. They may\nalso suggest that hominids consumed high-quality animal foods before the development of stone tools and the origin of the\ngenus Homo.\nvan der Merwe, N.J., J. F. Thackeray, J. A. Lee-Thorp and J. Luyt\nThe carbon isotope ecology and diet of Australopithecus africanus at Sterkfontein, South Africa.\nJournal of Human Evolution 44 :581-597.\nAbstract: The stable carbon isotope ratio of fossil tooth enamel carbonate is determined by the photosynthetic systems of\nplants at the base of the animal's foodweb. In subtropical Africa, grasses and many sedges have C4 photosynthesis and\ntransmit their characteristically enriched 13C/12C ratios (more positive 13C values) along the foodchain to consumers.\nWe report here a carbon isotope study of ten specimens of Australopithecus africanus from Member 4, Sterkfontein (ca.\n2.5 to 2.0 Ma), compared with other fossil mammals from the same deposit. This is the most extensive isotopic study of an\nearly hominin species that has been achieved so far. The results show that this hominin was intensively engaged with the\nsavanna foodweb and that the dietary variation between individuals was more pronounced than for any other early\nhominin or non-human primate species on record. Suggestions that more than one species have been included in this\ntaxon are not supported by the isotopic evidence. We conclude that Australopithecus africanus was highly opportunistic\nand adaptable in its feeding habits.\nLee-Thorp, Julia A., van der Merwe, N.J. and C.K. Brain\nDiet of Australopithecus robustus at Swartkrans from stable carbon isotopic analysis.\nJournal of Human Evolution 27:361-372.\nAbstract:\nDietary adaptations of early hominids are generally understood to have played a crucial role in hominid\nevolution. The dietary habits of Australopithecus robustus are of special interest because the robust masticatory\napparatus and characteristic dental features point to a distinctive dietary niche. Suggestions have ranged anywhere\nbetween carnivory and specialist herbivory, but current consensus has focused mainly on small hard items within the\ncontest of a vegetarian diet, and more particularly, frugivory. Few studies have challenged this perspective, although the\nresults of a recent Sr/Ca study of A. robustus ar Swartkrans were found to be inconsistent with herbivory. ----- Results\nfor A. robustus, compared with other fauna from Swartkrans, show a mixed diet including both C3 and C4 foods. Since\nthe C4 contribution must derive from consumption of grass or grazing animals, the data do not support either a specialist\nfrugivorous or graminivorous niche for A. robustus, rather, they suggest a more generalized or omnivorous diet.\n\n--------------------------\n--------------------------\nFYI #6 - on early stone tool use\nDate: 3/ 22 /06\nLike you didn't have enough to read or do. More palaeoanthropological spam. Following up on the issue of visibility\nof early stone tool use, you might want to refer to the paper below for a discussion of possible behavioral changes that\nmight have triggered the appearance of discernible \"archaeological sites\" around 2.6 myr.\nPanger, M.A., A.S. Brooks, B.G. Richmond and B. Wood\nOlder than the Oldowan? rethinking the emergence of hominin tool use.\nEvolutionary Anthropology 11:235-245.\nAbstract: Intentionally modified stone tools first appear in the hominin archeological record about 2.5 mya. Their\nappearance has been variously interpreted as marking the onset of tool use by hominins or, less restrictively, the origin of\nhominin lithic technology. Although the 2.5 mya date has persisted for two decades, several related but distinct questions\nabout the origin and evolution of hominin tool use remain to be answered: Did hominins use tools before 2.5 mya? Did\nhominins use unmodified stones as tools before 2.5 mya? Does the earliest appearance of stone tools in the archeological\nrecord represent the earliest use of intentionally modified stones as tools?\nFYI #7 - headstrong hominids\nDate: 4/12/06\nTry this URL for an interesting discussion of skull thickness and Homo erectus behavior. If this is all about male\ncompetition, why are female skulls so thick too?\nhttp://www.naturalhistorymag.com/0204/0204_feature.html\n\n--------------------------\nFYI #9 - Tan-Tan Acheulian figurine\nDate: 4/25/06\nI threatened you with some palaeoanthropological spam yesterday. Here are illustrations of the only other known\npossible figurine of Acheulian age . It comes from the Tan-Tan Acheulian site in Morocco. The original article which\ndescribes this find and its setting is:\nBednarik, R.G.\nA figurine from the African Acheulian. Current Anthropology 44(3):405-413.\nPhotos of a specimen from the front and back views removed due to copyright restrictions.\n\n--------------------------\nFYI #10 - Schoningen spear\nDate: 4/25/06\nYet more palaeoanthropological spam. Here's an image and close-up of the point of one of the three spruce spears from\nthe Schoningen site in Germany. According to the textbook this may be a product of H. heidelbergensis.\nThe\noriginal article is:\nThieme, H.\nLower Palaeolithic hunting spears from Germany.\nNature 385:807-810.\nImage removed due to copyright restrictions.\nThe photograph showed spear II, which is 2.30m long. The spear was shown at the left of an incomplete horse pelvis,\nwith the base broken off.\n\n--------------------------\n--------------------------\nFYI #11 - The role of cooking in human evolution\nDate: 4/26/06\nYet more cooked (?) spam. There is an extremely interesting article by Wrangham and Conklin-Brittain on the role of\ncooking in human evolution, that argues, given the human gut length,dentition and the nutritional value of raw food,\nthat cooking has to have been an important evolutionary factor from the time of the emergence of Homo\nerectus/ergaster. They basically argue that there wasn't time enough in a day to chew and digest enough food to support\nthe large body size of erectus without cooking. The abstract of the article is below.\nWrangham, R. and N.L. Conklin-Brittain\n'Cooking as a biological trait'.\nComparative Biochemistry and Physiology Part A 136 (2003) 35-46.\nAbstract: No human foragers have been recorded as living without cooking, and people who choose a 'raw-foodist' life\nstyle experience low energy and impaired reproductive function. This suggests that cooking may be obligatory for\nhumans. The possibility that cooking is obligatory is supported by calculations suggesting that a diet of raw food could not\nsupply sufficient calories for a normal hunter-gatherer lifestyle. In particular, many plant foods are too fiber-rich when\nraw, while most raw meat appears too tough to allow easy chewing. If cooking is indeed obligatory for humans but not\nfor other apes, this means that human biology must have adapted to the ingestion of cooked food (i.e. food that is tender\nand low in fiber) in ways that no longer allow efficient processing of raw foods. Cooking has been practiced for ample\ntime to allow the evolution of such adaptations. Digestive adaptations have not been investigated in detail but may include\nsmall teeth, small hind-guts, large small intestines, a fast gut passage rate, and possibly reduced ability to detoxify. The\nadoption of cooking can also be expected to have had far-reaching effects on such aspects of human biology as life-\nhistory, social behavior, and evolutionary psychology. Since dietary adaptations are central to understanding species\nevolution, cooking appears to have been a key feature of the environment of human evolutionary adaptedness. Further\ninvestigation is therefore needed of the ways in which human digestive physiology is constrained by the need for food of\nrelatively high caloric density compared to other great apes\nFYI #12 - Early sapiens mtDNA in Australia\nDate: 5/1/06\nThe paper below reports the occurrence of an archaic mtDNA pattern among early Australians. The implication being\nperhaps that early H.s.s populations may have had a more complex geographic origin than that suggested by the 'out\nof Africa' scenario.\nAdcock, G.J., E.S. Dennis, S. Easteal, G.A. Huttley, L.S. Jermiin, W.J. Peacock and A. Thorne.\nMitochondrial DNA sequences in ancient Australians: Implications for modern human origins.\nProceedings of the National Academy of Sciences USA 98(2):537-542.\nAbstract: DNA from ancient human remains provides perspectives on the origin of our species and the relationship\nbetween molecular and morphological variation. We report analysis of mtDNA from the remains of 10 ancient\nAustralians. These include the morphologically gracile Lake Mungo 3 ['60 thousand years (ka) before present] and\nthree other gracile individuals from Holocene deposits at Willandra Lakes (<10 ka), all within the skeletal range of\nliving Australians, and six Pleistocene/early Holocene individuals (15 to <8 ka) from Kow Swamp with robust\nmorphologies outside the skeletal range of contemporary indigenous Australians.\nLake Mungo 3 is the oldest\n(Pleistocene) ''anatomically modern'' human from whom DNA has been recovered. His mtDNA belonged to a lineage\nthat only survives as a segment inserted into chromosome 11 of the nuclear genome, which is now widespread among\nhuman populations. This lineage probably diverged before the most recent common ancestor of contemporary human\nmitochondrial genomes. This timing of divergence implies that the deepest known mtDNA lineage from an anatomically\nmodern human occurred in Australia; analysis restricted to living humans places the deepest branches in East Africa.\nThe other ancient Australian individuals we examined have mtDNA sequences descended from the most recent common\nancestor of living humans. Our results indicate that anatomically modern humans were present in Australia before the\ncomplete fixation of the mtDNA lineage now found in all living people. Sequences from additional ancient humans may\nfurther challenge current concepts of modern human origins.\n\nFYI #13 - possible Neandertal/sapiens hybrid?\nDate: 5/1/06\nI mentioned the Abrigo do Lagar Velho skeleton today. Here's the abstract and an illustration of the burial. At 24,500\nbp, it is one of the earlier burials of H. s. s. known in westernmost Europe. It's attribution as a result of long term\ngenetic admixture between Neandertals and H.s.s. controversial.\nDuarte, C., J. Maurice, P.B. Petite, P. Soot, E. Trunks, H. Van Deer Plight, and J. Zilhao\nThe early Upper Paleolithic human skeleton from the Abrigo do Lagar Velho (Portugal) and modern\nhuman emergence in Iberia.\nProceeding of the National Academy of Sciences USA 96:7604-7609.\nAbstract: The discovery of an early Upper Paleolithic human burial at the Abrigo do Lagar Velho, Portugal, has\nprovided evidence of early modern humans from southern Iberia. The remains, the largely complete skeleton of a '4\nyear-old child buried with pierced shell and red ochre, is dated to ca. 24,500 years B.B. The cranium, mandible, dentition,\nand post crania present a mosaic of European early modern human and Neandertal features. The temporal bone has an\nintermediate-sized juxtamastoid eminence. The mandibular mentum osseum and the dental size and proportions,\nsupported by mandibular ramal features, radial tuberosity orientation, and diaphyseal curvature, as well as the pubic\nproportions align the skeleton with early modern humans. Body proportions, reflected in femorotibial lengths and\ndiaphyseal robusticity plus tibial condylar displacement, as well as mandibular symphyseal retreat and thoracohumeral\nmuscle insertions, align the skeleton with the Neandertals. This morphological mosaic indicates admixture between\nregional Neandertals and early modern humans dispersing into southern Iberia. It establishes the complexities of the Late\nPleistocene emergence of modern humans and refutes strict replacement models of modern human origins\n\nImage removed due to copyright restrictions.\n\nThe photograph showed Lagar Velho 1 in situ, with damaged skull and left forearm elements already removed.\n\nFYI #14 - Neandertal mobility patterns\nDate: 5/1/06\nOn the issue of Neandertal mobility patterns. There is a really elegant piece of research by Lieberman and Shea\n(abstract below) that examines the problem. It used a really novel technique of studying cementum increments on\ngazelle tooth roots to determine the season of death of the animals found in the sites. The abstract of the paper\npresenting this research is below, as is an illustration of the two basic residential mobility patterns for\nhunter/gatherers. - The Neandertals are thought to practice the one on the right, radiating, while our ancestors are\nthought to have practiced the circulating pattern on the left.\nLieberman, D. and Shea, J.J.\nBehavioral differences between archaic and modern humans in the Levantine Mousterian.\nAmerican Anthropologist 96(2):300-332.\nAbstract: Early modern and archaic humans are associated with similar lithic industries in the Middle Paleolithic of the\nsouthern Levant, but new data suggest that they used the environment in different ways. Evidence from analyses of\nseasonally deposited increments of the teeth of the animals they hunted suggests that modern humans primarily practiced\na strategy of circulating seasonal mobility, while archaic humans in the same region 30,000 years later were more\nresidentially mobile. Analyses of their lithic hunting technology further suggest that archaic humans hunted more\nfrequently than did modern humans. We argue that this greater hunting intensity may have been a strategy for coping\nwith the consequences of resource biodepletion resulting from long-term multiseasonal occupation of sites. These\nbehavioral contrasts may be related to some of the morphological differences between early modern and archaic\nhumans. Circulating Mobility vs. Radiating Mobility.\nCirculating Mobility\nvs. Radiating Mob\nility.\nFigure by MIT OCW.\n\nFYI #17 - one last mystery at Dolni Vestonice\nDate: 5/8/06\nAs if exploded ceramic figurines associated with an elaborate burial of an older woman with congenital facial\ndeformities weren't enough. Then there was the triple burial and the wooden stake. Was this a truly dysfunctional\nfamily?\nAlt, K.W., S. Pichler, W. Vach, B. Klima, E. Vlcek and J. Sedlmeier.\nTwenty-Five Thousand-Year-Old Triple Burial From Dolni Vestonice: An Ice-Age Family?\nAmerican Journal of Physical Anthropology 102:123-131.\nAbstract: In 1986 a palaeolithic triple burial was discovered near Doln Vestonice (Czech Republic). The occurrence of\nanatomic variants in all three skeletons gave rise to speculations that the buried individuals may have been closely\nrelated. To test this hypothesis the skeletons were submitted to a systematic kinship analysis based on odontologic and\nother non-metric traits. Statistical tests showed that the coincident occurrence of several rare traits in the individuals is\nhighly unlikely to occur at random. This and further data included in the analysis therefore suggest that the three\nindividuals buried together were genetically related and actually belonged\nto one family.\nImage removed due to copyright restrictions.\nThe photograph showed the upper palaeolithic triple burial that was discovered in the Pavlov hills above the village\nof Dolni Vestonice, Moravia, Czech Republic. The bodies were partially covered with red ochre. Grave goods included\nsilex knives, ornamental shells of Tertiary snails, and pierced animal teeth (Alopex lagopus, Canis lupus), as well as\npendants of mammoth ivory formerly attached to headbands.\nIndividuals from left to right: DV 13, DV 15, DV 14."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture01_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/2d64e0164231fdb80e49ebe41dc0731d_lecture01_02.pdf",
      "content": "3.987 - Human Origins and Evolution\nSpring, 2006\nLectures 1 - 2: Key Terms, Concepts and questions to ponder\nYou should become familiar with the following terms and concepts from the first two\nlectures and your readings in Campbell/Loy. You should also give some consideration to the\nproblems and issues mooted in the \"To Ponder\" section.\nVocabulary\npalaeoanthropology\narchaeology\npalaeontology\nanthropology\nprinciple of superposition (Steno's law)\nparsimony (Occam's Razor)\nuniformitarianism (Charles Lyell)\nnatural selection (Charles Darwin)\nGeological Time Scale\ncontinental drift\nrelative dating\nchronometric dating\nstratigraphy\nK-Ar dating\nbiostratigraphy (faunal correlation)\npalaeomagnetism\nspecies\nbinomial classification system (Carl Linnaeus)\nPrimates\nAnthropoidea (anthropoids)\nHominoidea (hominoids)\nPongidae (pongids)\nPanidae (panids)\nHylobatidae (hylobatids)\nHominidae\n(hominids)\nParental investment\nK - selection - pattern of few offspring and extensive parental care\nr - selection - pattern of large number of offspring and little parental care\nTo Ponder\n)\nWhat characteristics define \"humanness\"?\n)\nWhat are the characteristics which distinguish hominids from the remaining great apes?\n)\nIn general, what pattern of parental investment do Primates exhibit in comparison with\nother mammals and non-mammals?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/a069e168fd54f74dea0d37943f2ae17d_lecture05.pdf",
      "content": "3.987\n-\nHuman Origins and Evolution\nSpring, 2006\nKey Terms, Concepts and questions to ponder\nLecture 5: Primates - their importance in understanding human evolution\nYou should become familiar with the following terms and concepts from this lecture and your\naccompanying readings in Campbell et al. You should also give some consideration to the problems and\nissues mooted in the \"To Ponder\" section.\nVocabulary\nPrimates\nProsimii (prosimians)\nlemurs\nlorises\ntarsiers\nAnthropoidea (anthropoids) - monkeys, and apes including humans\nCeboidea - Platyrrhini - New World monkeys\nCercopithecoidea - Catarrhini - Old World monkeys\nHominoidea (hominoids) - apes, lesser and greater including humans\nHylobatidae (hylobatids) - gibbons and siamangs\nPongidae (pongids) - orangutans\nPanidae (panids) - gorilla, chimpanzee, bonobo (pygmy chimp)\nHominidae (hominids) - humans\nfeatures characterizing Primates\nfeatures characterizing hominoids\nreproductive strategies: parental investment\nK - selection - pattern of few offspring and extensive parental care\nr - selection - pattern of large number of offspring and little parental care\nTo Ponder\n)\nWhat selection pressures might have selected for bonobo behaviors?\n)\nWhat selection pressures might have selected for chimpanzee behaviors?\n)\nHow does the environment contribute to selection pressures in terms of\ndistribution of food resources?\navailability of safety and shelter?\npresence of predators?\n)\nWhat behavioral characteristics are likely to have been displayed by the common ancestor of chimps,\nbonobos and humans?\n)\nCan we always recognize when similar modern traits are derived from a common ancestor, as opposed\nto similarities which evolved in parallel?\n)\nWhat is the role of sexual dimorphism in Primate species?\n)\nWhat are the roles of canines and canine dimorphism in Primates?"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/7a455bfc408e228907ce2a59d682fe10_lecture06.pdf",
      "content": "3.987\n-\nHuman Origins and Evolution\nSpring, 2006\nLecture 6: Key Terms, Concepts and questions to ponder\nYou should become familiar with the following terms and concepts from your readings in Campbell et\nal for this lectures. You should also give some consideration to the problems and issues mooted in the \"To\nPonder\" section.\nVocabulary\ncontinental drift\nLaurasia\nGondwanaland\narboreal hypothesis\nvisual predation hypothesis\nEocene\nAdapidae\nOmomyidae\nSiamopithecus\ndental formulas\npostorbital bar\nprosimians\nanthropoids\nOligocene\nFayum Depression\noligopithecines\nparapithecids\npropliopithecids\nAegyptopithecus\ncatarrhines\nplatyrrhines\nMiocene\nProconsul\nOreopithecus\nSivapithecus\nGigantopithecus\nDryopithecus\n\"dental apes\"\n\"suspensory apes\"\nTo Ponder\n)\nWhat features distinguish prosimians from higher primates?\n)\nCampbell et al. point out that perhaps 2 to 4 % of the 5-7,000 fossil primates species which probably\nexisted in the last 60 millions years are known to us. What factors contribute to the scarcity and\nincompleteness of the primate fossil record?"
    },
    {
      "category": "Resource",
      "title": "fyi07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/0e7baf65b715d72b41d930755fa74710_fyi07.pdf",
      "content": "FYI #1 (also sent as e-mail)\n\nDate: 3/2/06\nFrom: \"Harry V. Merrick\"\nSubject: 3.987 FYI #1 - Oreopithecus\n\nHi folks,\n\nI threatened you with some spam about Oreopithecus, a possible Miocene bipedal\nape. Well here it is.\n\nAs I mentioned one of the really interesting recent discoveries is that there\nmay have been another genus of now extinct apes which independently developed\nbipedalism. The candidate is Oreopithecus a 9 to 7 million year old genus of\nEuropean apes, however, your textbook authors don't provide any real discussion\nof this evidence or this possibility. The genus Oreopithecus has been\nrecognized for over 130 years, it being one of the first fossil apes to be\ndiscovered and described. Below are several references and abstracts of\nrelatively recent papers which have reanalyzed the Oreopithecus remains and\nhave somewhat controversially proposed that Oreopithecus was a habitual biped.\nIt is clear that even if Oreopithecus turns out to be a biped, other physical\nfeatures strongly suggest that it wasn't in the ancestral lineage leading to\nhumans.\n\nH. Merrick\n\n------------\n\nKohler, Meike and Salvador Moya-Sola\n\nApe-like or hominid-like? The positional behavior of Oreopithecus bambolii\n\nreconsidered.\n\nProc. Natl. Acad. Sci. USA Vol. 94, pp. 11747-11750, October 1997\nAbstract:\n\nComparative morphological and functional analyses of the skeletal remains of Oreopithecus\nbambolii, a hominoid from the Miocene Mediterranean island of Tuscany-Sardinia (Italy), provides evidence\nthat bipedal activities made up a significant part of the positional behavior of this primate. The mosaic\npattern of its postcranial morphology is to some degree convergent with that of Australopithecus and\nfunctionally intermediate between apes and early hominids. Some unique traits could have been selected\nonly under insular conditions where the absence of predators and the limitation of trophic resources play a\ncrucial role in mammalian evolution.\n\nRook, Lorenzo, Luca Bondioli, Meike Kohler, Salvador Moya-Sola and Roberto Macchiarelli\n\nOreopithecus was a bipedal ape after all: Evidence from the iliac cancellous\n\narchitecture.\n\nProc. Natl. Acad. Sci. USA Vol. 96, Issue 15, 8795-8799, July 20, 1999\nAbstract:\n\nTextural properties and functional morphology of the hip bone cancellous network of Oreopithecus\nbambolii, a 9- to 7-million-year-old Late Miocene hominoid from Italy, provide insights into the postural and\nlocomotor behavior of this fossil ape. Digital image processing of calibrated hip bone radiographs reveals the\noccurrence of trabecular features, which, in humans and fossil hominids, are related to vertical support of\nthe body weight, i.e., to bipedality.\n\nMoya-Sola, Salvador, Meike Kohler and Lorenzo Rook\n\nEvidence of hominid-like precision grip capability in the hand of the Miocene ape\n\nOreopithecus.\n\nProc. Natl. Acad. Sci. USA Vol. 96, Issue 1, 313-317, January 5, 1999\nAbstract:\n\nFunctional and allometric analyses of the hand of the late Miocene ape Oreopithecus bambolii\n(Tuscany, Italy) reveal a series of features that reflect an improved grasping capability including firm pad-to-\npad precision gripping that apes are unable to perform. Related features such as hand length, relative\nthumb length, a deep and large insertion area for the tendon of the long thumb flexor, and the form of the\nmetacarpal 2/capitate articulation are not present in extant or fossil apes. In these features, the\nOreopithecus hand closely matches the pattern of early hominids, presumably as a response to similar\nfunctional demands."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture07_09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/2e8442a8ff9516046a38d1da9338f0eb_lecture07_09.pdf",
      "content": "3.987\n-\nHuman Origins and Evolution\nSpring, 2006\nLectures 7 to 9: Key terms, concepts and questions to ponder\nYou should become familiar with the following terms, concepts, people and places from your\nreadings in Campbell et al and the other assigned readings for these three lectures. You should also give some\nconsideration to the problems and issues mooted in the \"To Ponder\" section.\nVocabulary\nAustralopithecus\n\"australopithecines\"\nSahelanthropus tchadensis\nca. 6 - 7 myr\nChad\nOrrorin tugenensis\nca. 6.0 myr\nBaringo Hills, Kenya\nArdipithecus ramidus\nca. 5.5 - 4.6 myr\nAwash, Ethiopia\n(initially Australopithecus ramidus)\nArdipithecus kadabba\nMiddle Awash\nAustralopithecus\nA. anamensis\nWest Turkana, Allia Bay\nA. afarensis\nLaetoli, Hadar\nA. africanus\nTaung, Sterkfontein S. Africa\nA. garhi\nMiddle Awash, Ethiopia\nA. bahrelghazali\nLake Chad\nKenyanthropus platyops\nca. 3.5 myr\nWest Turkana\nParanthropus\nP. aethiopicus\nWest Turkana, S.W. Ethiopia\nP. boisei\nOlduvai Gorge, Koobi Fora, S.W. Ethiopia\nP. robustus\nS. Africa\ntype specimen\nRaymond Dart\nOsteodontokeratic culture\nTo Ponder\n)\nHow are 'species' of living animals recognized and defined? How are fossil species recognized. Are\nliving and fossil species comparable entities?\n)\nWhy is it so difficult for palaeoanthropologists to determine how many hominid species and genera\nthey have discovered, and how they relate to one another evolutionarily?\n)\nWhat theoretical positions underlie \"lumping\" and \"splitting\" in the classification and taxonomy of\nfossil Plio-Pleistocene hominids?\n)\nWhat are the variables commonly cited as possibly contributing to the reduction of canine size in early\nhominids?\n)\nHow can we recognize which early hominids were potential makers and users of stone tools? What are\nthe sources of evidence available to us to attempt this?"
    },
    {
      "category": "Resource",
      "title": "fyi08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/8909e1034082a37c206e5643781e1af0_fyi08.pdf",
      "content": "FYI #2 (also sent as e-mail)\n\nDate: 3/8/06\nFrom: \"Harry V. Merrick\"\nSubject: 3.987 - FYI #2 - more about hominid tooth formation than you\nprobably wanted to know\n\nHi,\n\nI think an important part of your education in 3.987 should be for you to be\naware of some of the amazing \"high tech\" studies that have been undertaken in\npalaeoanthropology, even if we don't manage to discuss them in detail in\nlecture and your text barely mentions them.\n\nRemember on Monday I mentioned the age of the Taung australopithecine child at\ndeath and it's dental developmental sequence, the following article and\nabstract is a follow up. - This paper has a good general description of the\ntechnique of analyzing daily enamel formation increments, although it deals\nspecifically with determining the ages of two more recent Homo erectus\nindividuals.\n\nThe paper dealing directly with the Taung child is by Bromage, T.G. and Dean,\nM.C. 1985, Re-evaluation of the age at death of immature fossil hominids.\nNature 317:525-527.\n\nHM.\n\nThe following is an elegant analytical study.\n\n-----------------------------\nDean, Christopher, Meave G. Leakey, Donald Reid, Friedemann Schrenk, Gary T. Schwartz,\n\nChristopher Stringer & Alan Walker.\nGrowth processes in teeth distinguish modern humans from Homo erectus and\nearlier hominins.\n\nNature 414:628-631 (| 6 DECEMBER 2001)\n.............................................................................................................................................\nAbstract: A modern human-like sequence of dental development, as a proxy for the pace of life history, is\nregarded as one of the diagnostic hallmarks of our own genus Homo. Brain size, age at first reproduction,\nlifespan and other life-history traits correlate tightly with dental development . Here we report differences in\nenamel growth that show the earliest fossils attributed to Homo do not resemble modern humans in their\ndevelopment. We used daily incremental markings in enamel to calculate rates of enamel formation in 13\nfossil hominins and identified differences in this key determinant of tooth formation time. Neither\naustralopiths nor fossils currently attributed to early Homo shared the slow trajectory of enamel growth\ntypical of modern humans; rather, both resembled modern and fossil African apes. We then reconstructed\ntooth formation times in australopiths, in the,1.5-Myr old Homo erectus skeleton from Nariokotome, Kenya,\nand in another Homo erectus specimen, Sangiran S7-37 from Java. These times were shorter than those in\nmodern humans. It therefore seems likely that truly modern dental development emerged relatively late in\nhuman evolution."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/3cf8c188293e38774668fbb87a875f9d_lecture09.pdf",
      "content": "3.987\n-\nHuman Origins and Evolution\nSpring, 2006\nLecture 9: Key Terms and Concepts\nVocabulary:\nprime movers\nhypotheses\nmultiple factor/systems approaches\ntheories\nteleology\nmodels\nscenarios\nNotes:\nHominin/human origins: hypotheses and speculation\nprime movers versus more integrated approaches in explaining origins of humans/hominids\nthe fallacy of teleology - A doctrine explaining phenomena by final causes or outcomes.\nThe two major developments in human evolution\n)\ntransition to bipedal locomotion\n)\nelaboration of brain/culture system\nGenerally acknowledged functions of bipedalism\n)\nseeing over tall grass - greater ability to avoid predators\n)\ncarrying weapons\n)\ntool use, free hands\n)\nlong distance stride and energy efficiency\n)\ncarrying young (delayed maturation - longer learning time)\n)\nprovisioning - carrying food\n)\nthermo-regulation potential\nConditions for the original adoption of bipedalism - continued debate\narboreal bipedalism\nforest and woodland floor adaptation\nsavanna, light woodland adaptation\nHypotheses -\nold and new\n)\nTool use and hunting hypothesis - Darwin is an early proponent - male focus, esp. hunting\nprincipal elements: bipedalism, tool using in hunting/defense, small canines, intelligence, manual\nskills, tool making, tool using - sociability\n)\nTool use and gathering hypothesis - Nancy Tanner - On Becoming Human a response to\nperceived male chauvinistic bias of previous model\n\nargues for primacy of gathering - based on chimp models - female chimps more frequent tool\nusers\nlong range gathering and foraging strategy in which adults carried babies, tools and food over a\nwide range, eventually becoming upright bipeds.\nfemale food gathering/tool use heightened sociability and increased communication was\nadvantageous, leading to brain/culture elaboration.\n)\nAquatic ape hypothesis -\nElaine Morgan - 1972 - The Descent of Woman\n- a feminist viewpoint (developed ideas first suggest by a marine biologist, Alister Hardy in 1960)\nargues apes became aquatic in the late Miocene and the Pliocene as the African environment\ndried out, animals took to water for shelter and resources. - Then returned to land in the past\ncouple of million years.\na recent variant (2002) of the underlying aquatic nature of early hominin evolution is that of M.\nVerhaegen who suggests that bipedalism is an adaptation for wetland wading and climbing as early\nhominins foraged for plants in shallow water and along stream channels\nDietary and foraging posture related models\n)\nSmall object feeding\n- C. Jolly (1970) \"Seed eaters\"\nbased on baboon model - Theropithecus gelada\ndeveloped as a feeding posture to eating small objects which are evenly distributed within patches, in\nlow trees and bushes. A refinement of these views can be found in\nMark F. Teaford and Peter S. Ungar\nDiet and the evolution of the earliest human ancestors.\nProceeding of the National Academy of Sciences USA 97 (25) 13506-11.\nAbstract: Over the past decade, discussions of the evolution of the earliest human ancestors have focused on the\nlocomotion of the australopithecines. Recent discoveries in a broad range of disciplines have raised important\nquestions about the influence of ecological factors in early human evolution. Here we trace the cranial and dental\ntraits of the early australopithecines through time, to show that between 4.4 million and 2.3 million years ago, the\ndietary capabilities of the earliest hominids changed dramatically, leaving them well suited for life in a variety of\nhabitats and able to cope with significant changes in resource availability associated with long-term and short-term\nclimatic fluctuations.\n) Foraging postures - Recently Jonathan Kingdon (2003) in Lowly Origin suggests that bipedalism\narises as a condition from preadaptations evolved among Miocene \"squat feeding ground apes\".\nFeatures such as stable flexed leg, broad pelvis, flexible waist, vertical spine, good head balance and\nmobile shoulders evolve before bipedalism.\n)\nHabitat Variability/Instability -\nR. Potts (1996)\nbipedalism as an adaptation to instability of habitats in periods of marked environmental change.\nBipedalism combined with retained arboreal abilities provides earliest hominids a wide and\nflexible ecological niche.\nEnergy efficiency models - based on the assumption that bipedal locomotion is evolving in an\nopen hot tropical savanna among diurnal gathering and ?scavenging/hunting? hominoids.\n\n)\nEnergy efficiency of bipedal locomotion model\nspecial advantage of bipedalism - greatest energy efficiency - walking at a slow pace.\n)\nThermo-regulation model -\nP. Wheeler (1991)\nbipedalism reduces skin exposure to sun and heating in midday.\nModels involving reproductive and social behaviors relating to food acquisition\n)\nProvisioning/supplemental feeding model - Lovejoy\n)\nDual reciprocity subsistence model - \"food sharing\" - Isaac\nModels involving behaviors relating to social cooperation within and between groups\n)\nCoalitional enforcement hypothesis -\nBingham\nthe possibility of \"remote killing\" promotes social cooperation"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/ae3c4e135c88fde86beac30770bd0f83_lecture11.pdf",
      "content": "3.987\n-\nHuman Origins and Evolution\nSpring, 2006\nLecture 11:\nKey Terms, Concepts and questions to ponder\nYou should become familiar with the following terms and concepts from your readings in Campbell et\nal and Wood and Collard, 1999 for this lecture. You should also give some consideration to the problems and\nissues mooted in the \"To Ponder\" section.\nVocabulary\nHomo habilis\n? (Australopithecus habilis)\nHomo rudolfensis (?Kenyanthropus rudolfensis?)\n? (Australopithecus rudolfensis)\nHomo ergaster\nmonophyly\ncommon adaptive strategy\nNotes:\nDefinition of the genus Homo - historical perspectives\nCompeting definitions of the \"genus\" category\n) evolutionary systematic method\na genus is a species or group of species of common ancestry that occupies a\ndifferent ecological situation or \"adaptive zone\" than occupied by the species of\nanother genus.\nfor a very reasoned defense of the traditional evolutionary taxonomic method and its\napplication to recognizing genera, see Marks, J. 2005. Phylogenetic trees and\nevolutionary forests. Evolutionary Anthropology 14:49-53.\n) cladistic method\na genus is a group of species that are more closely related to one another than they\nare to any species assigned to another genus.\nfor an attempt to address both the issue of genera as monophyletic entities and the\nrecognition of genera as presenting different adaptive zones see Wood, B. and M. Collard,\n1999 The changing face of genus Homo. Evolutionary Anthropology\n8(6):195-207.\nTo Ponder\n) What are the characteristics which distinguish Australopithecus from Homo?\n\nFigure 3. Oblique views of KNM-ER 1470, the lectotype132 of Homo rudolfensis, and KNM-ER\n1813, the best-preserved cranium of Homo habilis sensu stricto.31 It has been proposed that\nboth these taxa should be transferred from Homo to Australopithecus. These species would\nthus become, respectively, Australopithecus rudolfensis (Alexeev, 1986)130 Wood and Collard,\n199964 and Australopithecus habilis (Leakey, Tobias, and Napier, 1964)31 Wood and Collard,\n1999.64\n\nFigure 4. Lateral views of KNM-ER 3733, a representative of Homo ergaster, and KNM-ER 1813,\na representative of Australopithecus habilis.\n\nImages of skulls removed due to copyright restrictions.\nImages of skulls removed due to copyright restrictions.\nCommon ad\naptive st\nrategy an\nd monophyly.\nFigure by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "handout12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-987-human-origins-and-evolution-spring-2006/8c26ee3679b1ea7fa3063fb87d69ff5e_handout12.pdf",
      "content": "3.987 - Human Origins and Evolution\nLecture 12:\nStone Technology -\nNotes\n1) Methods of fracturing and shaping of stone for artifact manufacture\ncontrolled shaping\npercussion\nabrading (grinding, polishing, drilling)\npressure\nsplitting\npecking\nA) Percussion flaking\nPrinciple of conchoidal fracture\nVarieties of percussion flaking\nDirect percussion\nhard hammer\nfree hand\nbipolar (uses hammerstone and anvil)\nanvil percussion (uses only anvil)\ncontrolled\n\"fling\"\nsoft hammer\nIndirect percussion (\"punch\" technique or \"blade\" technique)\ninvolves use of a hammer and a punch\nB) Pressure flaking\nutilizes the principle of conchoidal fracture - but application of force is by direct\nsustained pressure, not high impact percussion, varieties include; normal\npressure flaking by hand, use of a chest punch\nC) Pecking/Pounding\nD) Grinding/polishing/drilling/cutting\n2) Materials suitable for flaking by conchoidal fracture\nVolcanic origin - (lavas)\nbasalt\nphonolite\nignimbrite\nwelded tuffs\nrhyolite\nobsidian\nChalcedony (crypto- or micro- crystalline silica)\nflint\nagate\nsilicified wood\nchert\njasper\nOthers\nopal\nsilicified sandstone\nquartzite\nfelsite\ncrystal quartz\nglass\nslate\n3) Tool types characteristic of the Oldowan Industrial complex\nchoppers\nsubspheroids\ndiscoids\nunretouched flakes and fragments\npolyhedrons\n(manuports)"
    }
  ]
}