{
  "course_name": "Human Rights: At Home and Abroad",
  "course_description": "This course provides a rigorous and critical introduction to the foundation, structure and operation of the international human rights movement, as it has evolved through the years and as it impacts the United States. The course introduces students to the key theoretical debates in the field including the historical origin and character of the modern idea of human rights, the debate between universality and cultural relativism, between civil and human rights, between individual and community, and the historically contentious relationship between the West and the Rest in matters of sovereignty and human rights, drawing on real life examples from current affairs.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Public Policy",
    "Sociology",
    "Social Justice",
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Public Policy",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours /session\n\nCourse Overview\n\nThis course provides a rigorous and critical introduction to the foundation, structure and operation of the international human rights movement, as it has evolved through the years and as it impacts the United States. The course introduces students to the key theoretical debates in the field including the historical origin and character of the modern idea of human rights, the debate between universality and cultural relativism, between civil and human rights, between individual and community, and the historically contentious relationship between the West and the Rest in matters of sovereignty and human rights, drawing on real life examples from current affairs. The course also covers leading policy issues in which human rights are implicated such as the contentious relationship between human rights and economic development / globalization, issues raised by poverty and economic-social and cultural rights, democracy promotion as a human rights agenda, women's rights, ethnic violence, and the tension between security and human rights. It discusses ways in which human rights are sought to be realized in practice, both within countries, with an emphasis on the United States, and through transnational mechanisms such as the United Nations. The course explores the often contentious relationship between the U.S. and international human rights movement, including arguments about American exceptionalism, and the current human rights issues raised by mass movements from criminal justice, policing, mass incarceration and economic and social justice. The course materials will draw from many disciplines including law, philosophy, international relations, sociology and political science and will also rely upon the publications of leading international agencies.\n\nThis course is open to all students at MIT, both graduate and undergraduate. The course will adopt a double focus--both theory and practice, and at home and abroad--to break down the usual binaries which characterize human rights debates. That is to say, we will address the theoretical fundamentals of human rights while emphasizing the practical aspects of human rights work, the purpose being to enable students to understand the ways in which human rights scholars, activists, social movements, and international and governmental officials argue about human rights and their implementation. Practitioners from the world of local non-governmental organizations (NGOs) / social movements and international organizations may also guest lecture.\n\nPrerequisites\n\nThere are no prerequisites for the course, but students are expected to have interest in international and public affairs.\n\nCourse Materials\n\nThe course will be based on readings from three main texts (see below) and several articles and items, which will be placed on course website or are available on the net. For more background in international law students may refer to the recommended text (see below). Class format will be both lecture and discussion.\n\nRequired Texts\n\nDonnelly, Jack.\nUniversal Human Rights in Theory & Practice\n. 3rd ed. Cornell University Press, 2013. ISBN: 9780801477706. [Preview with\nGoogle Books\n]\n\nHurwitz, Deena, Margaret Satherthwaite, and Douglas Ford.\nHuman Rights Advocacy Stories\n. Foundation Press, 2008. ISBN: 9781599411996.\n\nRajagopal, Balakrishnan.\nInternational Law from Below\n. Cambridge University Press, 2003. ISBN: 9780521016711. [Preview with\nGoogle Books\n]\n\nRecommended Text\n\nBackground in International Law-\n\nJanis, Mark.\nInternational Law\n. 6th ed. Aspen Publishers, 2012. ISBN: 9781454813682.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nRegular and active class participation\n\n20%\n\nWeekly class blog\n\n40%\n\nFinal paper\n\n40%\n\nClass Participation\n\nReadings are compulsory\nbefore\nthe relevant class and students' discussion will be assessed. Readings marked 'recommended' should also be read in advance as much as possible in order to get the maximum out of this class. Attendance is compulsory.",
  "files": [
    {
      "category": "Resource",
      "title": "Human Rights and Undocumented Immigrants in the United States",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-164-human-rights-at-home-and-abroad-fall-2015/d378dda4422a4f79f5547ebbe2e51654_MIT11_164F15_HumanRights.pdf",
      "content": "Human Rights and Undocumented Immigrants in the United States\n\nI. Introduction\nHuman rights were constructed within a system of nation states and were contemporary\nwith the decline of colonialism, during a time in which national sovereignty and the right to\ndevelopment were considered indicators that a nation of former colonial holdings had become\nself sufficient. The Universal Declaration of Human Rights (UDHR) was written under the\nassumption of national sovereignty, a democratic political system, and a capitalist economy.\nThese three systems are embedded in the common understanding of human rights. As long as\nan individual falls inside these systems, human rights is a useful tool for guarding against the\ndangers of these systems. However, when individuals or groups fall outside of these systems,\nhuman rights is no longer a useful or appropriate tool for protecting their rights. This paper\nfocuses on one such group of people - undocumented immigrants in the United States.\nWestern ideas of national sovereignty, democracy, and capitalism are ingrained in the\nUDHR. Take, for example, Article 21 which describes the system of governance that is required\nby this understanding of human rights: the \"will of the people shall be the basis of the authority\nof the government; this will shall be expressed in periodic and genuine elections which shall be\nby universal and equal suffrage and shall be held by secret vote or by equivalent free voting\nprocedures\"1. Article 29 states that limitations on an individual's rights and freedoms can only be\ndue to \"morality, public order, and the general welfare in a democratic society\" - the mention of\ndemocracy is further proof of the democratic framework that the UDHR was built within.\nArticle 17 (guaranteeing the right to own property) and Article 23 (guaranteeing the right to\nwork and, if necessary, supplementation by \"other means of social production,\") both confirm\nthat the UDHR is anchored in the realm of western capitalism and its associated social welfare\nprograms.\n1 The Universal Declaration of Human Rights. Paris, 10 December 1948\n\nUndocumented immigrants are hardly the only people who fall outside of the\nabove-mentioned systems of nationalism, capitalism and democracy. Indigenous people of the\nAmerica are vulnerable to human rights violations because they do not fit within these\nframeworks. Indigenous peoples have higher unemployment rates than the national average,\nand higher poverty rates as well2. Citizenship was not granted to indigenous people until the\nearly 1900's, when 90 million acres of indigenous peoples' land was traded for 154,674\ncitizenships3; the right to vote was not granted until the 1960's4. Indigenous communities\norganize around the cause of increased autonomy and self-sovereignty, a notion which is\nstaunchly opposed by the U.S. government because it would infringe on the United States's\nnational sovereignty.\nAnother vulnerable group are incarcerated persons. Some states permanently\ndisenfranchise people convicted of felonies, which prevents them from taking part in\ndemocratic elections. Jailed persons are allowed to vote by law, but bureaucrats in local jails can\nbe ignorant of, or purposefully ignore, this fact. This effectively strips jailed persons of their\nvoting rights. Incarcerated persons are used as a cheap labor force, as the minimum wage is so\nlow in some prisons as to be effectively nonexistent5. Trade unions are banned inside prisons, a\nright which is specifically protected by the UDHR in Article 23. The job search after\nincarceration is negatively affected by a criminal record, even controlling for the fact that\nindividuals who commit crimes are less likely to work6.\n2 Austin, Algernon. \"Native Americans and Jobs: The Challenge and the Promise.\" December 13, 2013.\nhttp://www.epi.org/publication/bp370-native-americans-jobs/.\n3 Rollings, Willard. \"Citizenship and Suffrage: The Native American Struggle for Civil Rights in the American West,\n1830-1965.\" Nevada Law Journal 5, no. 126 (2004). pg 134\n4 ibid.\n5 \"Section III: The Prison Economy.\" The Prison Policy Initiative.\nhttp://www.prisonpolicy.org/prisonindex/prisonlabor.html.\n6 Schmitt, John, and Kris Warner. \"Ex-Offenders And The Labor Market.\" WorkingUSA, 2010, 87-109.\n\nPeople whose nation ceases to exist, or whose nation is taken over and conquered, are\nalso vulnerable to human rights violations because they fall outside the international system of\nnation-states that, between them, are supposed to account for all individuals in the world.\nExamples include Palestinians, whose territory has been occupied by Israel since 1967, and the\nrecently displaced refugees from Syria. Their situation complicates Article 13 of the UDHR,\nwhich states that everyone has the right \"to return to his country\" - does this human right apply\nwhen your country is taken over or when you have no place to return to? These problems are\nsupposed to be remedied by Article 15, which states that \"everyone has the right to a\nnationality,\" but it is obvious that this is not a practical solution for the palestinian and Syrian\nconflicts.\nClearly, the problem of individuals and groups falling outside the systems of nationalism,\ncapitalism and democracy are widespread. This paper studies this phenomenon through the lens\nof undocumented immigrants in the United States. Undocumented immigrants cannot enjoy the\nfull benefits of nationalism, capitalism and democracy because of their immigration status. They\nare also not protected from the drawbacks of these systems.\nThis paper is divided into three sections. Section II deals with the history of\nself-determination and national sovereignty in former colonies during the time that the UDHR\nwas being written. It explores the effects of national sovereignty in the United States, including\nthe idea of closed borders and controlled immigration; social programs that are available to all\ncitizens in exchange for payment of taxes and obedience to the law; and civil rights that guard\nagainst the state violating its citizens' human rights. Section III discusses the limitations on\nundocumented immigrants when it comes to the economic opportunities available in the United\nStates, and their exclusion from social programs that correct for wealth inequality and poverty.\nSection IV examines the exclusion of undocumented immigrants from the democratic political\n\nprocess and the dangers of the majority rule when it comes to immigration laws. Section V\noffers analysis and conclusions.\n\nII. National Sovereignty and Self-Determination\nThe rise of nationalism and self-determination was a powerful shaping force for the\nUnited Nations and the idea of human rights. Specifically, human rights took a back seat to\nnational sovereignty - the Bandung Conference in 1955 made the statement that the \"right of\npeoples and nations to self-determination is a prerequisite to the full enjoyment of all\nfundamental human rights\"7. This effectively limited the scope of human rights to be subservient\nto the system of nation-states in possession of strong self-determination powers.\nThe right to self-determination has traditionally included the right to closed borders and\ncontrol over the entry of immigrants. These sovereign rights of the nation supersede the human\nrights of an immigrant in the United States. A specific example is the case of Alexis\nBarrera-Echavarria, a Cuban national who was one of 124,000 undocumented Cuban\nimmigrants that entered the United States in 1980 in the Mariel Boatlift8. Barrera had been\njailed in Cuba on a theft charge; so when he arrived in the U.S. he was released on immigration\nparole a few months after arriving9. However, in 1985, Barrera was denied formal admission to\nthe U.S. and was ordered to be deported. The problem was that Cuba refused to readmit those\nwho had left the country during the Mariel Boatlift, and no third country would take him.\nTherefore, Barrera could not be deported; however, the U.S. decided to keep him indefinitely\ndetained in spite of the fact that there was no realistic way that Barrera could be deported. His\nlimited work history, lack of marketable skills, \"poor work record,\" several theft incidents\n7 Final Communique of the Asian-African conference of Bandung. 24 April 1955. Section C.1\n8 \"Mariel Boatlift.\" Global Security. May 7, 2011. http://www.globalsecurity.org/military/ops/mariel-boatlift.htm.\n9 Barrera Echavarria v. Rison, 44F.3d 1441 (9th Cir. 1995)\n\nbetween 1981 and 1982, and an armed robbery with a firearm conviction in 1983 were held\nagainst him in the court hearing that upheld his indefinite detention status in 1995. The court\nfound that \"the Attorney General has authority to detain aliens who are subject to exclusion\nproceedings or who have been ordered excluded,\" in spite of the fact that it is unclear in 8 U.S.\nCode ยง 1227a(1) whether prolonged detentions of undeportable aliens are allowed, since there is\nno chance of deportation in the future. This case illustrates the difficulties that come when\nundocumented immigrants are not accepted by current country of residence, where they are\nattempting to build a life, or their home country, where they were unable to build a life; each\nnation refused responsibility for Barrera, and so his right to not be held in indefinite detention\nwas violated.\nProtection against indefinite detention is just one of the many basic rights that citizens\nof the United States possess. Further rights include a fair judicial process and protection of\npolitical engagement. Undocumented immigrants are disadvantaged in these areas of judicial\nfairness and political engagement; they cannot serve as jurors, which means that undocumented\npeople are never judged by their peers. Indigenous peoples face a similar problem of being\njudged by a culture in which they choose not participate. In the case of undocumented\nimmigrants, they are being judged by a culture in which they are not allowed to participate. They\nare subject to deportation for engaging in activities in which citizens can engage. For example,\nundocumented immigrants have been targeted for deportation because of their involvement in\npolitically unpopular groups such as the Popular Front for the Liberation of Palestine10 or the\nCommunist Party11,12. This was authorized under the notion that \"the power to deport aliens is\ninherent in every sovereign state\"13.\n10 Reno v. American-Arab Anti-Discrimination Committee, (97-1252) 525 U.S. 471 (1999).\n11 Galvan v. Press, 347 U.S. 522, 74 S. Ct. 737, 98 L. Ed. 911 (1954)\n12 Harisiades v. Shaughnessy, 342 U.S. 580 (1952)\n13 ibid. Syllabus - 1.a.1\n\nCitizens of a nation also have a right to public services that are designed to alleviate\npoverty and hunger, as well as financial aid for universities. These public services are part of an\nimplicit deal between citizens and their nation - in exchange for taxes and obeying the laws of\nthe nation, citizens are entitled to certain public goods which are designed to uphold human\nrights standards and quality of life. Undocumented immigrants pay into state and local taxes\nthrough income taxes14. They pay into Social Security15, but don't collect the benefits, as only\nlawfully present immigrants can collect social security16. Most food stamp programs, including\nthose in Massachusetts, require proof of legal presence in the United States17. Medicaid and\nwelfare are also not available to undocumented immigrants18. Federal financial aid is not\navailable to illegal immigrants, and only recently have universities opened the possibility to\nundocumented students to obtain in-state tuition or private scholarships19. All of these public\nservices were created to give vulnerable populations access to public services, and all are being\nfunded by, and denied to, undocumented immigrants on the basis of their citizenship.\nThe main purpose of human rights when it operates within a framework of the sovereign\nnation state is to guard against the power of the state. The above cases are examples of this\nconcept. The right to a trial, to being charged for something and not being held in indefinite\ndetainment, to a jury of your peers, to political free speech without repercussions, to the right to\nvote, are all mechanisms to ensure that the power of the state does not silence dissident voices\nand target vulnerable minorities. One often-used tool for silencing such voices is the use of\n14\"Undocumented Immigrants' State & Local Tax Contributions | ITEP Reports.\" ITEP. April 15, 2015.\nhttp://itep.org/itep_reports/2015/04/undocumented-immigrants-state-local-tax-contributions.php#.Vm4VZ1WrSV\nM.\n15 Goss, Stephen. \"Effects of Unauthorized Immigration on the Actuarial Status of the Social Security Trust Funds.\"\nActuarial Note, no. 151 (2013).\n16Boyle, Matthew. \"Exclusive - Report: Obama's Executive Amnesty Will Give Illegal Aliens Public Benefits -\nBreitbart.\" Breitbart News. November 17, 2014.\n17 \"9 Myths and Facts about SNAP Benefits and Immigrants.\" MassLegalHelp. November 1, 2013.\n18 Santana, Maria. \"5 Immigration Myths Debunked.\" CNN|Money, November 20, 2014.\n19 \"I Am an Undocumented Immigrant | NerdScholar FAFSA Guide.\" FAFSA.\n\npolice forces to target minorities and other undesirable populations. In his book, The Ethics of\nImmigration, Joseph Carens pitches the idea of a firewall between state actors (such as the\npolice) who are responsible for keeping the peace and fostering stability, and with those who\nuphold human rights20. The problem is that the police in the U.S. are supposed to uphold human\nrights, but they are also mandated to report immigration violations. This limits the likelihood\nthat undocumented immigrants would go to the police when their human rights are being\nviolated because of this fear of deportation. Therefore, the police, whose purpose is to ensure\nthat there are no human rights violations occurring in their communities, are cut off as a\nresource for undocumented immigrants.\nThis problem can be logically extended to other areas outside of the police.\nUndocumented immigrants may feel that they cannot speak with teachers and school\nadministrators, doctors and hospital officials, rape crisis counselors or social services, because of\na fear of deportation. Many of these institutions and the services that they provide were created\nto uphold human rights for all citizens; fear of deportation and the lack of a \"firewall\" prevents\nthese human rights from being supported for undocumented immigrants.\n\nIII. Capitalism and the Threat of Deportation\nUndocumented immigrants are often left out of the system of capitalism implemented in\nthe United States. Capitalism is based on the assumption that workers can take their labor\nelsewhere if working conditions, pay, and other environmental factors are unsatisfactory to\nthem. These assumptions are invalid when considering undocumented immigrants, because\ntheir freedom to move jobs is severely limited by their immigration status.\n20 Carens, Joseph H. The Ethics of Immigration. New York, NY: Oxford University Press, 2013. pg 133\n\nUndocumented immigrants are particularly vulnerable in this matter because of the\ndifficulty in enforcing the minimum wage for the labor of undocumented immigrants.\nCompanies who employ legal residents and American citizens can be reported to the relevant\ngovernment authorities if they are not being paid minimum wage as mandated by federal and\nstate laws. However, undocumented immigrants are often are supporting relatives in their\ncountry of origin (if they are economic migrants) and do not have social programs as safety nets\nto fall back on. This means that they have higher risks if they lose their job, and less leverage\nbecause their employer could report them to INS and have them deported. For the same\nreasons, undocumented immigrants can also be pressured by their employers to not form trade\nunions, which is a right protected directly by the UDHR.\nHuman Rights Watch reports that the agriculture industry, whose employees are 50%\nundocumented immigrants, is a dangerous trade for women because of high rates of sexual\nharassment and rape21. Supervisors of field workers often rape undocumented women, knowing\nthat these women will feel pressure to accept this violence because they cannot afford to lose\ntheir job, or because the supervisor is confident that he can block his victim from obtaining\nwork on other farms22. Agricultural workers in general are not protected under the usual U.S.\nlabor laws in terms of guaranteeing overtime pay or the right to collective bargaining, making\nthe agricultural industry particularly susceptive to human rights violations already.\nAside from direct disadvantages in terms of minimum wage violations and a lack of\ncollective bargaining rights, undocumented immigrants are also blocked from taking advantage\nof social programs that offset wealth and income inequality in the U.S. The dangers of rampant\ncapitalism are supposedly corrected by social programs such as Medicare, Medicaid,\n21 \"Cultivating Fear: The Vulnerability of Immigrant Farmworkers in the US to Sexual Violence and Sexual\nHarassment.\" Human Rights Watch. May 15, 2012.\n22 ibid.\n\nunemployment assistance, the Affordable Care Act, the minimum wage, and others. This wealth\ninequality can be boiled down to the idea that the rich get richer, especially in the United States,\nwhere wealth and income inequality has been growing for the last few decades and stands out\namong OECD countries23. Citizens who live in poverty and are able to take advantage of these\nprograms still have trouble scraping together enough money to support themselves;\nundocumented immigrants, who are not covered under these programs and who face lower\nwages and unsafe, unhealthy, and sometimes violent working conditions are even more\nvulnerable than poor U.S. citizens.\n\nIV. Democracy and the Tyranny of the Ma jority\nIn the traditional understanding of human rights, democracy guards against dictatorships\nand ensures that the government remains accountable to the people of a nation. In his treatise\non human rights and Marxism, Harold Laski describes democracy and human rights as both\nfundamentally opposed to capitalism. He finds it hard \"to believe either that the institutions of\npolitical democracy are permanently safe, or that human rights essentially to the life of a free\nman will be assured of respect\" if the society that these institutions exist in are divided between a\nclass that owns the means of production, and a class that labors on such instruments24.\nDemocratic institutions, to Laski, are \"intended to safeguard\" human rights, and \"function\nwithin the limits of a framework imposed upon them\" by capitalism25. Democracy is an\ninstitution that works against capitalism as a great equalizer, an institution that erases the\n23Ingraham, Christopher. \"If you thought income inequality was bad, get a load of wealth inequality.\" The Washington\nPost, May 21, 2015.\n24 Laski, Harold. \"Towards a Universal Declaration of Human Rights.\" In Human Rights: Comments and\nInterpretations, 78-92. New York: Columbia University Press, 1949. pg 87\n25 ibid pg 87\n\ndifferences in power created by the wealth divide. The idea is that democracy makes human\nrights possible in a framework of capitalism.\nThis view assumes that democracy erases discrimination and the targeting of minorities\nby the state. Marxism would divide the world only along wealth lines - those who have wealth,\nand those who labor for the rich; other dividing identities, such as race, religion, or gender,\nwould be erased in a Marxist world. However, democracy, though it does have many positive\neffects such as public accountability and a decrease in corruption, can also have negative effects.\nTocqueville's theory of the tyranny of the majority is a valid concern for vulnerable minorities in\na democracy such as the United States26. However, the tyranny is not of the elective body over\nother divisions of power (such as the Courts and the executive branch in the United States), and\nit does not involve the harassment and silencing of opposition political parties. Instead, the\ntyranny of the majority is over vulnerable minority groups that are defined by their religion,\nrace, or socioeconomic class. Democracy and representative government has many benefits that\nhave been extolled by western democracies as bringing freedom, peace, and prosperity to their\nrespective countries, but it also can allow a majority to create laws that disenfranchise or\ndiscriminate against certain groups of people who are deemed by society to be undesirable. The\nUnited States abounds in examples of this, from the discriminatory policies of the military\nconcerning gay service members, to the repeal of the Voting Rights Act that prevented\ndisenfranchisement policies being implemented in the southern states, to the current question\nof limiting the rights of Muslims in the U.S. as a response to fundamentalist Muslims launching\nterrorist attacks on U.S. soil.\nThese policies are rampant in immigration law. Arizona's law, \"Support Our Law\nEnforcement and Safe Neighborhoods Act,\" allows law enforcement to check the immigration\n26 Tocqueville, Alexis De. Democracy in America. 1835.\n\nstatus of anyone they have a \"reasonable suspicion of being in the U.S. illegally\"27, which, in\nArizona where the majority of undocumented immigrants are Latino, implies racially profiling\nindividuals. Similar versions have been implemented in Alabama, Georgia, Indiana, South\nCarolina, and Utah28. The Supreme Court upheld the provision that required law enforcement\nofficials to check the immigration status of people who they detained and suspected of being\nillegal immigrants; it rejected the part that made it a misdemeanor for immigrants to not carry\nregistration documents and the criminalization an illegal immigrant attempting to seek\nemployment. Justice Scalia explicitly refers to the sovereignty of the state of Arizona in his\ndissent against the rejection of these provisions, stating that \"Arizona has moved to protect its\nsovereignty\" in a way in which is compatible with federal law\"29. Sovereignty in this context is\nused as a shield for racism and border control.\nThese laws are examples of legislation that targets a vulnerable group - undocumented\nimmigrants. Though key provisions were struck down by the Supreme Court, the core of the law\nwas upheld. Caren's firewall idea is violated explicitly in this law, as law enforcement officers,\nwhose purpose is to protect and serve their communities, are transformed into undocumented\nimmigrant seekers. Their purpose in dealing with undocumented immigrants is not to protect\ntheir human rights, but to inquire into their immigration status and, if appropriate, start the\ndeportation process. If, for example, an undocumented Latina woman went to the police to\nreport a sexual assault, domestic violence, or workplace health and safety violations, and the\npolice she spoke to suspected that she was an illegal immigrant, her deportation process could be\ntriggered by this action.\n27 \"Arizona's SB 1070.\" American Civil Liberties Union. https://www.aclu.org/feature/arizonas-sb-1070.\n28 \"What's At Stake: SB 1070 at the Supreme Court.\" American Civil Liberties Union.\nhttps://www.aclu.org/whats-stake-sb-1070-supreme-court.\n29Barnes, Robert. \"Supreme Court Upholds Key Part of Arizona Law for Now, Strikes Down Other Provisions.\" The\nWashington Post, June 25, 2012, Politics sec.\n\nSimilar immigration laws are manifestations of the idea that the majority in the United\nStates gets to decide who will be accepted into their nation as citizens, beyond the basic\nlimitation set down by the natural born citizen law which grants citizenship to individuals born\non U.S. soil. Immigration law, decided indirectly through the United States's system of\nrepresentative democracy, discriminates against undocumented immigrants and denies them the\nhuman rights that they deserve as contributors to U.S. society.\n\nV. Analysis and Conclusions\nThe question can then be asked: what circumstances are necessary for a nation to extend\nhuman rights protections to an individual? Is citizenship necessary? Are certain human rights\nonly protected by a nation if the individual is a citizen in that particular nation? This is the\nquestion that Carens focuses on in his book. His answer is that belonging to a society and to a\nnation is defined by more than just one's citizenship. His argument is that social ties and length\nof residence in a country qualifies individuals for citizenship and all of its associated rights and\nprotections. His theory of social membership rejects the idea of national sovereignty where a\nnation decides when an outsider who is not a citizen is allowed to become a citizen. Carens'\ntheory would remove the power of approval of citizenship from the nation. This theory is\ntherefore unrealistic because it ignores the founding principle of our modern system of\ninternational order which supersedes human rights - national sovereignty.\nWendy Brown grapples with this tension between the theory of human rights and the\nsystems that formed this theory. She recognizes that human rights are a way of counteracting\nthe imbalance of power that occurs naturally within a liberal western society, but that human\nrights \"vanquish neither the regime not its mechanism of reproduction\"30. Human rights can\n30 Brown, Wendy. \"Suffering Rights as Paradoxes.\" Constellations 7, no. 2 (2002). pg 422\n\nwork only within the frameworks imposed by nationalism, capitalism and democracy as they\nattempt to counteract the effects of these three systems. They can do nothing to change these\nsystems intrinsically. \"Rights function to articulate a need, a condition of lack or injury, that\ncannot be fully redressed or transformed by rights, yet within existing political discourse can be\nsignified in no other way\"31. Human rights cannot ever fully end the discrimination and injuries\nthat undocumented immigrants receive at the hands of U.S. society.\nAn alternative to individual human rights has often been proposed, especially in\nconnection with indigenous rights: group rights could provide an alternative narrative that\nworks outside the currently instituted frameworks of western society. Group rights can be seen\nas a system that is fundamentally in opposition to the sovereignty of nations, as indigenous\ngroups seek to increase their autonomy and live outside the systems of western society.\nHowever, this opposition implies that group rights cannot be effectively defined using a\nframework of democracy, capitalism and nationalism. Karen Engle's arguments concerning\ngroup human rights supports Wendy Brown's conclusions by noting that indigenous cultural and\ncollective rights \"are ultimately defined by a human rights framework that is based on some of\nthe very premises that they are meant to challenge\"32. Though Engle's arguments were centered\naround indigenous peoples, they are applicable to undocumented immigrants in the United\nStates as well. Undocumented immigrants fall outside of the same systems that indigenous\npeoples in the United States do, and so individual human rights do not reach as far as they are\nintended to with both groups. Collective rights might provide a more appropriate or useful\nframework for viewing undocumented immigrants rights, because they do not automatically use\n31 ibid. pg 431\n32 Karen Engle, On Fragile Architecture: The UN Declaration on the Rights of Indigenous Peoples in the Context of\nHuman Rights, pg 149\n\nnationality to define which of an individual's human rights are allowed to be violated by a\nnation.\nWill Kymlicka attempts to do just what Engle warns against by defining collective rights\nusing existing human rights frameworks. His argument draws an arbitrary line between \"internal\nrestrictions\" on \"the claim of an indigenous group against its own members\" and \"external\nprotections\" which involve \"the claim of an indigenous group against the larger society\"33. He\nargues that external protections are to be enforced, as these are the indigenous peoples' group\nrights, but that internal restrictions cannot be intruded upon34. Internal restrictions have the\npotential to violate the human rights of group members; however, because Kymlicka compares\nindigenous groups to other nations in promoting their self-determinism, these internal\nrestrictions have to be respected under the assumption of sovereignty. In this argument, human\nrights are again demoted in favor of sovereign, nationalist rights. This contradiction indicates\nthe impossibility of reconciling such an understanding of group rights with current systems of\nnational sovereignty. Such an argument would increase the nationalist autonomy of the\nvulnerable group (indigenous populations), but would not increase the strength of their human\nrights protections.\nUnfortunately, the reality of our world is that the nationalist, democratic and capitalist\nframeworks are near impossible to upend, especially in the United States. Concrete steps to\nimprove the condition of undocumented immigrants can be taken by business owners and by\nlegislative bodies, but these changes will always be subject to reversal because of the systems in\nthe U.S. Classifying undocumented immigrants as a suspect class may improve the situation as\nwell, but the Supreme Court decided in 1982 in Plyer vs. Doe that \"undocumented aliens cannot\nbe treated as a suspect class, because their presence in this country in violation of federal law is\n33 Kymlicka, William. \"The Good, the Bad, and the Intolerable: Minority Group Rights.\" pg 23\n34 ibid. pg 26\n\nnot a \"constitutional irrelevancy\" and because \"entry into this class [undocumented immigrants],\nby virtue of entry into this country, is the product of voluntary action. Indeed, entry into the\nclass is itself a crime\"35. As long as these systems of western society remain dominant, the\nhuman rights of undocumented immigrants are subject to abuse by the state, the tyranny of the\nmajority, and the dangers of rampant capitalism.\n35 Plyler v. Doe, 457 U.S. 202 (1982)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n11.164 / 17.391 / 11.497 Human Rights: At Home and Abroad\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}