{
  "course_name": "Hydrodynamics (13.012)",
  "course_description": "This course covers the development of the fundamental equations of fluid mechanics and their simplifications for several areas of marine hydrodynamics and the application of these principles to the solution of engineering problems. Topics include the principles of conservation of mass, momentum and energy, lift and drag forces, laminar and turbulent flows, dimensional analysis, added mass, and linear surface waves, including wave velocities, propagation phenomena, and descriptions of real sea waves. Wave forces on structures are treated in the context of design and basic seakeeping analysis of ships and offshore platforms. Geophysical fluid dynamics will also be addressed including distributions of salinity, temperature, and density; heat balance in the ocean; major ocean circulations and geostrophic flows; and the influence of wind stress. Experimental projects conducted in ocean engineering laboratories illustrating concepts taught in class, including ship resistance and model testing, lift and drag forces on submerged bodies, and vehicle propulsion.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Ocean Engineering",
    "Hydrodynamics",
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Ocean Engineering",
    "Hydrodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLabs / Recitations: 1 session / week, 2 hours / session\n\nPrerequisites\n\n8.02, 18.03\n\nCourse Outline\n\nThe following topics are planned for this term, although not all may be covered in practice.\n\nPart I: Introduction to Marine Hydrodynamics\n\nBasic Fluid Properties\n\nHydrostatic Pressure\n\nBasic Principles of Hydrodynamics\n\nPart II: Free Surface Waves and Wave Forces on Offshore Structures and Vehicles\n\nLinear Wave Theory: Boundary Value Problem; Simplifying Assumptions\n\nDispersion Relationship\n\nUnsteady Bernoulli's Equation, Dynamic Pressure\n\nIncident Wave Forces on Bodies\n\nAdded Mass, Damping, and Hydrostatic Restoring Coefficients (Strip Theory)\n\nEquations of Motion for Seakeeping; Natural Frequency\n\nPart III: Viscous Flows and Free Surface Flows\n\nViscous Lift and Drag\n\nDrag and Resistance of Streamlines and Bluff Bodies\n\nVortex Induced Vibrations (VIV); Morrison's Equation (Offshore Platforms)\n\nShip Resistance Testing\n\nRudders and Propellers, Cavitation and Flow Noise\n\nNavier Stokes Equations: Separated Flows and Boundary Layers\n\nPart IV: Geophysical Fluid Dynamics\n\nMajor Ocean Circulations and Geostrophic Flows\n\nHeat Balance in the Ocean\n\nInfluence of Wind Stress\n\nCoriolis Force, Tidal Forces, Geostrophic Currents\n\nEquations of Motion\n\nTextbooks\n\nThere is no required textbook for the course, although students are expected to complete the assigned readings.\n\nTwo recommended books are:\n\nSmits, A. J.\nA Physical Introduction to Fluid Mechanics\n. New York, NY: John Wiley & Sons, 1999. ISBN: 9780471253495.\n\nWhite, F.\nFluid Mechanics\n. 5th ed. New York, NY: McGraw-Hill, 2002. ISBN: 9780072831801.\n\nCourse Organization\n\nWeekly problem sets will be assigned and are due the following week unless otherwise noted.\nHomework solutions are expected to be the result of individual effort\n. However, group discussions of the concepts covered on the homework and review of the course material is encouraged.\n\nLaboratory projects and reports should also be done individually. While the data will be the result of a collective effort, the final processing and analysis should be done individually unless otherwise noted. Lab assignments will be due on the date specified on the lab hand-out. Pre-lab exercises should be done prior to coming to class and can be done collectively.\n\nThere will be two exams administered in class and a final exam scheduled during exam week. Partial credit will be given on all problems, except multiple choice and fill in the blank type questions.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n15%\n\nLaboratory\n\n25%\n\nTwo In-class Exams\n\n30%\n\nFinal Exam\n\n30%\n\nThe three exams are closed book. However, one single-sides sheet of notes will be allowed for each in-class exam, and one double-sided sheet of notes will be allowed for the final exam.",
  "files": [
    {
      "category": "Resource",
      "title": "questionaire.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/b5f9dbbad60bc1060f5be887955aa762_questionaire.pdf",
      "content": "2.016 Hydrodynamics\nProf. Alex Techet\nFall 2005\nAssessment\nDue Tuesday Sept 13, 2005\nThis exercise is a closed book exercise designed to generally assess your knowledge\ncoming into this course. This will not be marked for a grade, however completion of the\nexercise will be noted. You may find that you do not understand some of the questions or\nthat others are very basic - this is intentional, do not worry. Try to complete this exercise\nwithout stopping and make a note of the time you spent working on it.\nApproximate time to complete exercises: ______ minutes (to the nearest 5 minutes)\n1) Given a function f(x), expand f(x) using Taylor Series Expansion (to third order):\n2) Given a continuously differentiable scalar function f(x,y) define its vector\ngradient. What does this mean qualitatively?\n3) Given a continuously differentiable vector function v(x,y) define its divergence.\nWhat does this mean qualitatively?\n4) Given a continuously differentiable vector function q(x,y) define its curl. What\ndoes this mean qualitatively?\n\nK\nV\nD\nK\nV\n5) The Material Derivative of a vector,\n, is written as\n. What is the definition\nDt\nof a Material Derivative? Expand the Material Derivative into its components.\n6) Under what conditions does a fluid become a gas?\n7) As a submarine moves through the ocean far under the surface such that surface\nwaves can be neglected, do you expect the fluid at the submarine surface to:\na. Remain stationary\nb. Move at the speed of the sub\nc. Move at a speed slower than the sub\nd. Move at a speed faster than the sub\n8) Which of the following is not conserved in a fluid system:\na. Mass\nb. Energy\nc. Pressure\nd. Momentum\n9) Rank from 1-5 the following fluids based on their dynamic viscosity. (1 == most\nviscous; 5 == least viscous)\n___ Ethyl Alcohol\n___ Gasoline\n___ Water\n___ Honey\n___ Motor Oil\n\n10) The Reynolds number represents the ratio of the following forces in a fluid flow:\na. Inertia force to gravity force\nb. Pressure force to inertia force\nc. Inertia force to viscous force\nd. Inertia force to surface tension force\n11) Assuming atmospheric pressure is equal to Po. Determine the fluid pressure at a\ndistance D below the calm free surface, given that gravity is g.\n12) Explain why cavitation occurs.\n13) A sinusoidal plane progressive surface wave, in deep water, has an amplitude, A,\na period, T, and a wavelength, λ. Write the expression for the corresponding free\nsurface elevation as a function of time, relative to a reference coordinate system.\nDefine the wave frequency, ω, and wavenumber, k, in terms of the above\nquantities. How does ω relate to k (hint: you need to use the gravitational\nconstant, g)?"
    },
    {
      "category": "Resource",
      "title": "hw1_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/677ff2c17d527cb231092242a38da1d4_hw1_soln.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/f982f6f72a36ab7be690f69a86390e31_hw1.pdf",
      "content": "2.016 Hydrodynamics\nProf. Alex Techet\nFall 2005\nHW #1\nOut: 13 Sept 2005\nDue: 20 Sept 2005\nProblem 1:\nWhich of the following are isotropic? Why or why not?\na)\nTemperature\nb) Pressure\nc)\nShear stress\nd) Dynamic viscosity\nProblem 2:\nAt a particular point in the Pacific Ocean, the density of sea water increases non-linearly with depth according to\nmz\no +\n= !\n!\nwhere\no\n! is the density at the surface, z is the depth below the surface, and m is a constant. Develop an algebraic\nequation for the relationship between pressure and depth.\nProblem 3:\na)\nDetermine the horizontal and vertical forces acting on a wall sloped at angle, θ, to the horizontal seafloor as\na function of z. Assume that the water is h deep and that atmospheric pressure acts everywhere.\nb) Determine the total resulting force and center of pressure.\n\nProblem 4: Archimedes Principle on a floating vessel\nExtend the results you found in problem 3 to the case of a \"V\" shaped vessel floating on the surface of the ocean to\nshow that the resulting pressure acting on the hull balances the weight of the water displaced by the vessel.\nProblem 5:\nA rectangular barge floats in water, ρw. When it is empty it is immersed at depth D below the surface. Oil with\ndensity, ρo, is poured into the barge until it is about to sink. Find a relationship for the depth of the oil at this point in\nterms of the initial depth, D, the total height of the barge H and the barge width W.\n\nProblem 6:\nYou are asked to design an underwater laboratory at the bottom of the Gulf of Mexico, in order to study the habits of\nMigrating Whale Sharks. After attending a lecture given by Samuel Raymond, founder of Benthos, you realize that\na spherical structure would be ideal for this project. So you have decided that the laboratory will be built as a hemi\nsphere off the sea floor and sketch the following concept design:\ng\nH\nD/2\na)\nWhat is the distribution of pressure over the wetted surface of the laboratory?\nb)\nWhat are the total fluid force and moment vectors exerted on the laboratory by the surrounding\nfluid?"
    },
    {
      "category": "Resource",
      "title": "hw2_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/dcb9a16587750c88f6ac15d81d127612_hw2_soln.pdf",
      "content": "y=squareroot(3)*x is the equation for the line."
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/e588a2edca4ce88e182f915b93d66db8_hw2.pdf",
      "content": "2.016 Hydrodynamics\nProf. Alex Techet\nFall 2005\nHW #2\nOut: September 20, 2005\nDue: September 27, 2005\nProblem 1: Buoyancy (3 pts.)\nAn AUV is designed as shown below. It has three, hollow, cylindrical canisters arranged\nin an upside down triangle. The cylindrical canisters are constructed out of aluminum,\nspecific gravity of 2.7, and have a wall thickness of 1 cm, length 2 meters, and an inner\ndiameter 14 cm. What is the maximum load (kg) this vehicle can carry without sinking,\nignoring the additional weight and buoyancy of the struts? (Think neutrally buoyant!)\nAssume the vehicle will be operating in SALT water (\n/\nkg m\n! =\n).\nAUV Design.\nProblem 2: Basic Fluids & Math (3 pts.)\na) Although fluids, such as water, are really made up of discreet molecules, we can\ndescribe their behavior by differential equations by virtue of the ________ hypothesis.\nb) Discuss the difference between a pathline and a streamline. Under what conditions\nare they the same?\nc)\n(\nr\nV -\nr\n\" )\nr\nV = 1\nr\n\"\nr\nV -\nr\nV\n(\n)\n(\nr\n\" #\nr\nV = $w\n$y % $v\n$z\n&\n' (\n)\n* + ˆ i + $u\n$z % $w\n$x\n&\n' (\n)\n* + ˆ j + $v\n$x % $u\n$y\n&\n' (\n)\n* + ˆ k = 0ˆ i + 0 ˆ j + 0 ˆ k\nShow by expanding and collecting terms that\nfor irrotational\nflow. Hint:\nfor\nirrotational flow.)\n\nProblem 3: Velocity Field (8 pts.)\na) A velocity field is given by\nr\nV = (x2 \" y2)ˆ i \" 2xyˆ j . Is this a valid velocity field for an\nincompressible fluid? (Hint: It must satisfy the Continuity Equation.)\nb) Is the flow steady?\nc) Sketch arrows depicting the velocity vectors at each point on the graph below. (Hint:\nThere is no flow across the dashed lines.)\nd) Sketch the streamlines on your graph.\ne) Determine the angle \" . (Recall, streamlines are everywhere tangent to the flow, so\ndy\ndx = v\nu along a streamline.)\nf) Is the flow irrotational? (Hint:\nfor this 2-D flow.)\nr\n\" #\nr\nV = $v\n$x % $u\n$y\n&\n' (\n)\n* + ˆ k\ng) Sketch \"Bob the Fluid Blob\" at four different points along his path through this flow.\nSketch his acceleration vector for each point.\nh) If we assume that pressure is the only force acting on Bob, then where is the pressure\nthe highest?\n\nProblem 4: Control Volume Analysis (3 pts.)\nThe largest artery in the body is the one that supplies blood to the legs. As it comes down\nthe body it splits into a Y-junction, as shown in the figure below. Blood with specific\ngravity of 1.05 is pumped into the junction at speed V1= 1.5 m/s. The diameter of the\nentrance is d1=20 mm. The two branches have diameter d2 = 15 mm and d3 = 12 mm. If\nthe mass flow rates at stations 2 and 3 are equal, find the velocities V2 and V3.\nFigure by MIT OCW.\nProblem 5: Bernoulli's Equation (3 pts.)\na) Write down Bernoulli's Equation for steady flow.\nb) Under what conditions does this equation hold?\nFluid passes through a fan placed in a constant diameter duct shown in the figure\nbelow. Assume the density is constant.\nFigure by MIT OCW.\nFAN\nc) Is the volume flow rate at station 1, the same as at station 2? Why?\nd) Can Bernoulli's equation be applied between stations 1 and 2? Why?"
    },
    {
      "category": "Resource",
      "title": "hw3_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/31e6d6845034106844e6da1d6a3771ef_hw3_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/0a60fde1c91a7411e5e7fae8600bf182_hw3.pdf",
      "content": "2.016 Homework #3\nProf. A. Techet; Fall 2005\nIssued: September 27, 2005\nDue: October 4, 2005\nProblem 1: Unsteady Potential Flow and Added Mass\na. Derive added mass around a sphere. Hint: if you print out the Added Mass\nDerivation handout, the math is all done for you, and you can hand that worksheet in.\n(\nr\nF , p,d\nr\nA ,R,r\nAll you have to do is draw a picture on the page illustrating how to set up the integral\ni.e. a picture of a sphere showing the coordinate system,\nand \" , and\nanother picture showing how to calculate\nfrom d\nr\nA .\nd\nr\nA x\nb. In this derivation, are we integrating the static pressure or the dynamic pressure?\nWhat happens if we include the other pressure term as well?\nc. The equation she\n\" =U cos# r + R3\n2r2\n$\n% &\n'\n( )\n\" =U cos# R3\n2r2\n$\n% &\n'\n( )\net says that the potential function for flow around a stationary sphere\nis\n, but the potential function given in the derivation is\n. What is the difference between these two potential functions?\nWhat type of flow does this correspond to? Why would we not include that in the\nderivation?\n\" =U cos# R3\n2r2\n$\n% &\n'\n( )\nHint: think about the answer to part d.\nquiescent fluid?\n(\n)\nd. True or false,\ncorresponds to flow around a moving sphere in\ne. Derive added mass around a cylinder. Just draw a picture on the page illustrating\n(\nsystem,\nr\nF , p,d\nr\nA ,R,r\nhow to set up the integral\nand \"\nd\nr\nA x\ni.e. a picture of a sphere showing the coordinate\n, and another pic showing how to calculate\nfrom d\nr\nA .\nf. In this derivation, are we integrating the static pressure or the dynamic pressure?\nWhat happens if we include the other pressure term as well?\ng. In class, we learned that the potential function for flow around a stationary cy\n\" =U cos# r + R2\nr\n$\n% &\n'\n( )\n\" =U cos# R2\nr\n$\n% &\n'\n( )\nlinder is\n, but the potential function given in the derivation is\n. What is the difference between these two potential functions?\nWhat type of flow does this correspond to? Why would we not include that in the\nderivation? (\n\" =U cos# R2\nr\n$\n% &\n'\n( )\nHint: think about the answer to part d.)\nh. True or false,\ncorresponds to flow around a moving cylinder in\nquiescent fluid?\n\nProblem 2: Pressure Distribution Around a Stationary Cylinder\na. The potential function for flow around a stationary cylinder is \" =U cos# r + R2\nr\n$\n% &\n'\n( ) ,\nwhere U is the free\nr\nV (r,\") = #$\n#r\nˆ e r + 1\nr\n#$\n#\"\nˆ e \"\n-stream velocity far away from the cylinder. Find the velocity\nfield\n.\nb. Find the pressure at the surface of the cylinder, r = R\n(\n), using Bernoulli's equation,\nmaking use of the fact that the pressure at the stagnation points (where V=0) is the\nstagnation pressure, ps.\nc. Show that the coefficient of pressure, cp = p \" p#\n12$U 2 , can be expressed in the form\ncp =1\" V 2\nU 2 .\nd. Plot the coefficient of pressure using Matlab or Excel for 0 <\" < 2# .\nProblem 3: Added Mass\nCalculate the added mass coefficients m33 and m44 for a circular cylinder of radius\nand length\nR =1cm\nwhose axis is along the 1 axis.\nL =1m\nProblem 4: Added Mass\nIn lab, we discussed how added mass affects the natural frequency of a cylinder bobbing\nup and down under water.\na. Write the equation for the natural frequency for this underwater spring-mass\nsystem.\nb. What do you expect to happen if the cylinder has a square cross section?\n\nProblem 5: Buoyancy and Added Mass\nA buoy consists of a large sphere of radius, a, under a circular cylinder of radius, r:\nThe added mass of the cylinder is negligible compared to that of the sphere:\na. Write the equation of motion for heave. (Note: there is a force that increases\nlinearly with depth.)\nb. What is the buoy's natural frequency in heave.\nProblem 6: Buoyancy and Added Mass\nAn offshore platform has the configuration shown:\nThe diameter of the uprights is 10 m, and that of the pontoons is 10 m. The length of the\npontoons is 100 m. The added mass of the uprights is negligible compared to that of the\npontoons.\na. Write the equation of motion for heave.\nb. What is the platform's natural frequency in heave."
    },
    {
      "category": "Resource",
      "title": "hw4_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/d38f6e17da11ebf0cf1fe439ea471d9e_hw4_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "hw4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/76186e6cdc117a7843af127260659aaa_hw4.pdf",
      "content": "2.016 HW #4\nOut: October 4, 2005\nDue: October 18, 2005\n1) A sphere of volume V in a fluid of density ρ is located at a point (0, L, 0) with respect\nto a certain coordinate system. In terms of this coordinate system, identify whether\neach of the 6x6 added mass coefficients are zero (0), or non-zero (x) (do not work out\n).\nx\ny\nz\n(\n)\nany values\n0, L, 0\n2) A positively buoyant cone with length L, and maximum radius Ro is placed with the\napex at the origin of a coordinate system as shown below.\nz\ny\na) Calculate the center of buoyancy for the cone.\n\nb) Determine which added mass coefficients are zero or non-zero. You can fill out a\n6x6 matrix with X for non-zero and 0 for zero.\nc) Use Strip Theory to calculate M55, M11, M44, M66, M51, and M22. Hint: first\nconsider any symmetry that might make these calculations easier.\nd) Write the equation of motion of the cone in roll, and calculate the natural\nfrequency.\n3) A new class of submarine can be modeled by a cylinder of length L and radius R, with\na vertical sail and horizontal elliptical wings of major and minor axis radii a and b\nand length h, as shown.\nAssuming that these main members are slender so that their longitudinal added mass may\nbe ignored, and neglecting also the interactions among the members, determine\na) M33\nb) M35\nc) M55\nd) Find the instantaneous force and moment, F\nv\nand Mv\n, on the submarine at an\ninstant when its 6 degree-of-freedom motions are: velocity [1,2,3,1,2,3] and\nacceleration [3,2,1,3,2,1]. You may leave your answers in terms of Mij.\n\n4) Housing for certain underwater sensor equipment has a geometry shown below. The\nsphere has radius 2a, and the cylinders have radius rc = a/2 and length lc=4a. The\ndensity of the device can be assumed to be uniform and have a value of twice that of\n(\n-\n)\nwater. ASSUME NON VISCOUS FLOW ONLY!\na) To get it to the sea floor, the device is lowered into the water and then is released,\nfind its initial acceleration for (i) a vertical orientation; and (ii) a horizontal\norientation.\nb) Assuming deep water, calculate the terminal drop velocity for the device falling in\na horizontal orientation for (i) very small a; and (ii) large a.\nc) If the instrument is dropped horizontally with initial generalized velocity (0, -U2, U3,\n0, 0, 0). Find the moments (M1, M2, M3) on the cylinder at the instant the cylinder is\ndropped in terms of a, ρ, U2, U3.\nd) An engineer is concerned that if dropped in a\nvertical orientation, the device may become\n\"unstable\" and reach the bottom in an\nunpredictable manner. If the equipment is\nfalling with steady downward velocity U, at a\nsmall angle θ from its vertical position, estimate,\nbased on potential (non-viscous) flow effects\nonly, the overturning moment M2 on the device\nas a function of U and θ5.\n\n5) 2D Deep Water Waves can be described by a velocity potential function φ(x, z,t).\n( , , )\nsin(\n)\nkz\na\nx z t\ne\nkx\nt\nk\n!\n\"\n!\n= #\n#\nThe relationship between frequency, ω, and wave number, k, is given by the dispersion\nrelationship for deep water waves:\ngk\n! =\nAssuming deep water wave of amplitude a = 2.5ft, wavelength λ = 120ft\nfrequency, ω, dictated by the dispersion relation. Use the expressions for a linear wave,\nderived in class, to plot:\n(\n2 / k\n!\n\"\n=\n) and\na. Plot the dynamic pressure, the horizontal velocity and acceleration, the vertical\nvelocity and acceleration as a function of the variable x, for a fixed value of the\ntime t, all quantities can be evaluated at z = zn, where zn = λ/8.\nYou can calculate the velocities and accelerations based on the relationship\nbetween potential function and velocity for fundamental potential flow theory.\nAlign all plots so that the relative phase can be deduced, and plot the wave\nelevation, also as a function of x, for comparison.\nb. Plot the same quantities as in the first question as a function of time t (at a fixed\nvalue of x and for z = zn).\nc. The inviscid force is proportional to the fluid acceleration. When is the horizontal\ninviscid force maximum: under the wave crest, the wave trough, or the wave\nnodal point? Answer the same question for the vertical inviscid force.\nd. The viscous force is proportional to the fluid velocity squared. When is the\nhorizontal viscous force maximum: under the wave crest, the wave trough, or the\nwave nodal point? Answer the same question for the vertical viscous force.\ne. Calculate the TOTAL pressure under a plane progressive wave at some depth H1\nthat you should find under the wave crest, the wave trough, and the wave nodal\npoint. Explain from where you measure the vertical distance z used in the\nhydrostatic pressure."
    },
    {
      "category": "Resource",
      "title": "hw5_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/96bc328eef5d7a33251d2fc29833c81a_hw5_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "lab_report.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/73a942906f33e6c99e2c1e31b173437c_lab_report.pdf",
      "content": "2.016 Hydrodynamics\nLab Report Guidelines\nAt the completion of an experimental investigation, a report must be written that explains the\ndesign of your experiment in a manner that will permit others to understand and repeat your\nmeasurements. Your report should present an analysis of your data, including discussion of its\nlimitations and the conclusions you draw.\nAll lab reports are to be prepared individually. However, since the experiments are a joint\neffort, data can be reduced and conclusions discussed by the group. Your report must be typed\non a word processor using the template below and should contain no more than three pages of\ntext (11pt font, Times New Roman, 1.5 line spaced), in addition to graphs.\nGraphs must be produced using MATLAB, Excel, or other plotting program. Although you will\nuse SI units for the report text, graphs should be made non-dimensional by normalizing\n(multiplying) by a factor (this will be explained in class). Show appropriate error bars on your\ndata points. Label all axes.\nReferences to collaborators [1] and technical works [2] consulted must be given in the text and\nlisted in the format shown below.\nYour grade will account for clarity of writing and organization of arguments in addition to\ntechnical content. Reports should be complete, concise, and edited for grammatical and spelling\nerrors. Reports of poor quality, or those that fail to follow this required format, will be returned\nfor editing.\nReports are due in the next laboratory period following the completion of the experiment.\nReduced credit will be given for late reports, including those returned for editing.\n\nIvanna Goodgrade\nLab Report 1\n2.016 Hydrodynamics\nDue 9/1/2005\nAbstract\nType your 30- to 50-word summary here. Be sure to include the experimental objectives,\nmeasured quantities, results obtained, and important conclusions. This should be the last section\nwritten.\nIntroduction\nType your introduction here. Be sure to include the objectives of the experiment, theoretical\nbackground (i.e. demonstrate your understanding of the material), and answers to pre-lab\nquestions. Detail a diagram of the experimental setup. Describe the specific procedure of the\nexperiments. And finally, explain what the theory predicts for data measurements.\nResults\nType your results section here. Present your data in a reduced form, using graphs wherever\npossible. Direct the graphs towards the conclusions you expect to draw in your discussion. Be\nsure to show appropriate error bars on data points in graphs.\nDiscussion\nType your discussion section here. Evaluate your results in the context of the theoretical\npredictions, and draw conclusions about the suitability of the experimental system for the\npostulated task. Demonstrate your understanding of your experimental results and their\nrelationship to the original questions posed. Include answers to post-lab questions in this section.\n\nEvaluate the sources of error in your measurements, identify the limitations of the techniques\nused, and compare your data to theoretical predictions, prior experiments, and accepted values for\nmeasured parameters. Draw conclusions from this analysis, and make recommendations for ways\nin which the experiment could be improved.\nReference\n[1] Mya Classmate.\n[2] Robert W. Fox and Alan T. McDonald. Introduction to Fluid Mechanics. John Wiley & Sons,\nInc., fifth edition, 1998."
    },
    {
      "category": "Resource",
      "title": "lab1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/6e586911b87035a5e7b9ebe0f5674c63_lab1.pdf",
      "content": "Object Impact on the Free Surface and Added Mass Effect\n2.016 Laboratory Fall 2005\nProf. A. Techet\nIntroduction to Free Surface Impact\nFree surface impact of objects has applications to ocean engineering such as ship\nslamming hydrodynamics. The simplest geometric object to study is a sphere. The\nhydrodynamics are three dimensional, but several basic concepts can be observed using\nhigh speed video sequences.\nThe main focus of Part A of this laboratory exercise is to determine the terminal velocity\nof a sphere that impacts the free surface of a tank of water at high speeds. When an\nobject which is falling under the influence of gravity or subject to some other constant\ndriving force is subject to a resistance (drag force) which increases with velocity, it will\nultimately reach a maximum velocity where the drag force equals the driving force. This\nfinal, constant velocity of motion is called a \"terminal velocity\", a terminology made\npopular by skydivers. For objects moving through a fluid at low speeds so that turbulence\nis not a major factor, the terminal velocity is determined by viscous drag.\nFdrag\nFbuoyancy = ρgV\nFg = mg\nM\ndrag\nbuoyancy\ngravity\nF\nF\nF\n+\n=\ndrag\nd\nF\nU C A\n!\n=\n(1.1)\nThe drag force is\n(1.2)\nwhere U is the speed of the object, A is the frontal area of the object, and Cd = 0.5 is the\ncoefficient of drag for a sphere.\n\nThe buoyancy force is\nbuoyancy\nF\ng\n!\n=\n\"\ngravity\nF\nmg\n=\n(1.3)\nand force of gravity is simply\n(1.4)\nTwo photos removed for copyright reasons.\nFlow about a sphere in a wind tunnel.\nLab part A:\nIn this section of the lab you will observe objects impacting the free surface at two speeds\nand continuing down into the tank. You are asked to qualitatively consider the behavior\nof the sphere at the moment of impact: the splash formation (height and shape), wave\ngeneration, bubble/cavity formation behind the sphere, etc. You will take high speed\nvideo of the objects and use a software package to determine the position of the ball as a\nfunction of time, x(t). A graduate student will show you how to operate the image\nrecognition software. You will then use the data to determine the velocity of the ball as a\nfunction of time.\nAs the ball approaches the bottom of the tank it may reach terminal velocity. Using the\nvideo recorded during the experiments you will determine whether this occurs and how\nthis value compares with the expected value calculated using equation(1.1).\nSpinning Sphere: A case of a sphere spinning at a high rate of rotation will be\ndemonstrated and video of the event will be posted on the website. Consider the physics\nassociated with this run. Think about hitting a tennis ball or kicking a soccer ball with\ntop spin. When the ball reaches a certain depth it will make a sharp turn in one direction.\nWhat direction do you expect it to turn compared to its direction of spin? Think about the\nforce balance on the sphere towards the end of the run and how the sphere can travel\nsideways given that gravity is acting downwards on the object.\n\nWrite Up:\n- For the two non-spinning sphere cases:\no Briefly describe and discuss the following features of the short moment of\nimpact: the splash shape, height, wave pattern generated, and the cavity\nformation behind the ball. Discuss how this cavity might affect the speed of\nthe ball as it goes through the water?\no Determine the terminal velocity analytically.\no Plot dx/dt from the high-speed camera data, and determine if the ball has\nreached terminal velocity. Compare dx/dt from the camera to the terminal\nvelocity calculation you made in the pre-lab assignment.\no How do the two different speed runs compare? Is the terminal velocity the\nsame? Different? Does this make sense in light of the definition of terminal\nvelocity?\n- For the one spinning sphere case:\no Compare the hydrodynamics features (splash shape, height, etc.) at the\nmoment of impact for a spinning and non-spinning sphere.\no Describe the trajectory of the sphere and the bubble that forms at impact.\no Discuss the direction that the sphere turns compared to its direction of spin\no Try to rationalize the behavior of the spinning sphere considering the basic\nforce balance on the sphere towards the end of the run, including how the\nsphere can travel sideways given that gravity is acting downwards on the\nobject.\n\nIntroduction to Added Mass\nFor the case of unsteady motion of bodies underwater or unsteady flow around objects,\nwe must consider an additional effect (force) acting on the structure when formulating the\nsystem equation.\nA typical mass-spring-dashpot system can be described by the following equation:\nm x +b x + kx = f (t)\n(1.5)\nwhere m is the system mass, b is the linear damping coefficient, k is the spring\ncoefficient, f(t) is a driving force acting on the mass, and x is the displacement of the\nmass. The natural frequency ω of the system is simply\nk\nm\n! =\n.\n(1.6)\nGiven an object of mass m attached to a spring, you can determine the spring constant by\nsetting the mass in motion and observing the frequency of oscillation, then using equation\n(1.6) to solve for k. Alternately we can also determine the spring coefficient k by simply\napplying a force f and measuring the displacement x:\nf\nkx\n=\n.\n(1.7)\nThe apparent mass of an object in air differs from the apparent mass of an object in water.\nStatically, the buoyancy force acting on the body makes it appear less massive. Using a\nload (force) cell to measure the weight Mg of an object will reveal this disparity quite\nclearly. It is important to take this into account when formulating the natural frequency\nof a spring-mass system in water. In this lab we will compare the natural frequency of\nsuch a spring-mass system in air and in water. In addition to the buoyancy effect, an\nadded mass term must be considered.\nIn a physical sense, this added mass is the weight added to a system due to the fact that an\ndU dt !\naccelerating or decelerating body (ie. unsteady motion:\n) must move some\nvolume of surrounding fluid with it as it moves. The added mass force opposes the\nmotion and can be factored into the system equation as follows:\nm x +b x + kx = f (t)\" ma x\n(1.8)\nwhere ma is the added mass. Reordering the terms the system equation becomes:\n\n(m + ma) x +b x + kx = f (t)\n(1.9)\nsuch that the natural frequency of the system is now\n-\n-\na\nm\nm\nm\n! =\n+\nFrom here we can treat this again as a simple spring mass dashpot system with a new\nmass\na\nk\nk\nm\nm\nm\n!\" =\n=\n\"\n+\n(1.10)\nTheoretically the added mass of simple geometric shapes can be calculated using the\nfollowing formulas:\nSphere:\na\ns\nm\n!\n=\n\"\n(1.11)\nwhere\ns\nr\n!\n\" =\nis the volume of the sphere.\nCylinder:\na\nm\na L\n!\"\n=\n(1.12)\nwhere a is the cylinder radius and L is the cylinder length.\nIn this lab, you will be measuring the added mass of several objects. Using a simple, one\ndegree-of-freedom spring-mass system with a strain gauge and an oscilloscope (that\nmeasures the voltage the strain gauge outputs), you will measure the natural frequency of\noscillation in air and water. From this information you will be able to form an\nexperimental measurement of the added mass of three different objects. You will\ncompare your experimental results to the theory and comment on the differences that may\narise.\n\nAdded Mass Experiment\nBelow is a picture of the idealized system set-up:\nX(t)\nX(t)\n\n/\nn\nk M\n!\n=\nK\nM\nK\n(\n)\nn =\n\nadded\nk\nM\nm\n!\n+\nForce Gauge\nMASS\nForce Gauge\nMASS\nMw\nNote: We will be ignoring the viscous damping in this experiment. This approximation is\nacceptable for small amplitude oscillations in which inertial terms (accelerations)\ndominate.\nProceedure:\n1. Calibrate the force gauge\nThe force gauge measures load and outputs that as a voltage. In order to use the force\ngauge, you need to be able to relate the voltage to the load (via a calibration constant C\n[kg/V]). Hang 4 weights of known mass from the hook, and record the voltage output\nfrom the oscilloscope. Make a plot of voltage versus load.\n\n2. Measure the dimensions of the three objects\nOnce you have finished the calibration, break into groups and choose an object to\nmeasure. (Each group measure one object, and share the measurements with the other\ngroups for the post lab write-up.) Record the dimensions of the object you picked.\n3. Measure weight and natural frequency of oscillation in air\nTo measure the mass, hang your object from the force gauge, and record the voltage\noutput corresponding to its weight in air. To find the natural frequency, hang the object\nfrom the end of the spring and perturb it slightly. Observe the natural frequency data from\nthe oscilloscope. Knowing the mass and natural frequency, you should now be able to\ncalculate the spring constant, k. Keep in mind that k does not change when you oscillate\nto object in water.\n4. Measure weight and natural frequency of oscillation in water\nUse the cable extension to hang the object in the water. Repeat step 3.\n5. Compute the added mass of the object\nWith the data you have gathered, you have everything you need to calculate an\nexperimental value for the added mass of each object tested.\nLab Write Up\n- Report the values for natural frequency of the systems (for all three objects) in\nboth air and water. Physically explain the differences in the two frequencies.\n- Compare the added mass value that you measured for each object and compare\nthis to the theoretical value as determined by equation (1.11) or (1.12). Explain\nany differences between the values.\n- For the experimental value of the added mass, determine the ratio between the\nexperimental added mass and the mass of a volume of water equivalent to the size\nof your object. Does this make sense? Explain.\n- How does buoyancy affect our system?"
    },
    {
      "category": "Resource",
      "title": "lab2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/8855a20481c940658c8f6d2853c4d496_lab2.pdf",
      "content": "Massachusetts Institute of Technology\n2.016 Hydrodynamics\nFall 2005\nSurface Waves Kinematics\nFriday 14 October 2005, 9-11am\n***Ocean Engineering Towing Tank ***\nIntroduction\nThis lab is in an investigation into some of the properties of surface gravity waves.\nThe purpose is to gain an understanding of some of the fundamental concepts and\nrelationships of surface wave kinematics by means of an experimental study. The wave-\nmaking and wave-detection capabilities of the MIT Towing Tank will be used in\nconjunction with empirical observations.\nLaboratory Setup/Procedures\nEquipment\nThe towing tank is a long rectangular basin of water with a wave-maker at one end and a\n\"beach\" at the other. The wave-maker is a hydraulically driven vertical paddle with\ncontrollable amplitude and frequency. The \"beach\" is a region of absorbing material\nintended to prevent the reflecting of waves from this end of the tank.\nYou will be using wave probes to measure the amplitude, or height, of the passing waves.\nThe wave probes are a \"resistance\" type probe, which produce a voltage proportional to\nthe submerged length. This voltage can be logged by a computer at a prescribed\nsampling rate. As waves pass the probe, the computer will display the height of the free\nsurface as a function of time. The data will be recorded to a disk.\nVisual measurements will also be taken for corroboration of the methods and equipment.\nA stop watch and tape measure will be provided for such measurements.\nObjectives\nTo measure the basic surface wave properties in terms of wave amplitude, period,\nwavelength, phase velocity, and group velocity.\n\nMeasurements\nTowing Tank personnel will provide instructions for the operation of the wave-maker and\ndata collection system. Please follow their instructions.\nThe class will be broken into three groups (A, B, C). The groups will rotate through each\nrunning 3-4 wave packets.\nFirst rotation:\nGroup A: Operates wave paddle/records wave probe data.\nGroup B: measures group speed/phase speed/wavelength/amplitude by\neye/stopwatch/ruler (Tasks 5 and 6)\nGroup C: observes qualitative features of the waves, waves appear/disappear at\nend/beginning of packet, including surface patterns with glitter/pepper and\nparticle orbits under waves. (Tasks 3, 4, and 7)\nSecond rotation, etc.\nGroup C then goes to B's Station, B to A, and A to C, and so on.\nThe post processing of the electronic data can be done on Athena in MATLAB (or even\nexcel) after the lab session. For the group measuring speeds/heights by hand/eye make\nsure your data makes sense - does your phase speed equal twice the group speed, etc?\nFOR ALL GROUPS TO DO:\n1. Record the water depth h.\n2. Calibrating the wave probes: The calibration of the probes consists of determining the\nrelationship between the voltage read by the computer and the submerged length of\nthe probe. The probes will be calibrated before you arrive. Make sure you write\ndown the calibration data before leaving lab.\nBY GROUP (A, B, C):\nThe following steps (3) through (6) are to be completed for a range of frequencies\nbetween1hz and 3hz, each at a small amplitude and a large amplitude. Plan your runs so\nthat you cover a large range of frequencies first, if time remains you can fill in interim\nfrequencies for better resolution.\n3. Determine the amplitude, A, and the frequency, ω = 2π/T, where T is the wave\nperiod, of the wave using the wave probes and by sight.\nIf η(x; t) is the free surface elevation, a good definition of the wave amplitude here is\nA = (ηmax - ηmin)/2 at some given x. Station someone at the tank window to confirm\nthese measurements by a direct visual measurement of A and T (determine the time it\ntakes for a fixed number of wave crests to pass a given point).\n\n4. Determine the wavelength, λ, which is the distance between two crests (or troughs\nor equal phase points). This value can be found by examining the simultaneous\nsignals from two wave probes a known distance apart.\n(Think about whether the probes should be close together or far apart?)\nAlso estimate the wavelength by visual observation (this might be easiest with two\npeople).\n5. Determine the wave phase velocity, Vp, which is the speed at which the wave crests\n(or constant phase points) move in the direction of propagation.\nThis can also be determined from the simultaneous signals of two wave probes a\nknown distance apart.\nEstimate the phase speed using the ruler on the rail of the towing tank, a stopwatch\nand visual observation.\n6. Determine the wave group velocity, Vg, which is the speed at which a wave group\ntravels, corresponding to the speed at which the wave energy travels.\nThis can be found be measuring the arrival time of a point of constant position within\na group at two probes a known distance apart, eg. the \"front\" or \"back\" of the group.\nThink whether the probes should be located close together or far apart?\nAlso measure the group velocity directly with the tank ruler and stopwatch.\n7. Surface observations and particle orbits: For any frequency and amplitude wave\npacket, spread grains of pepper on the free-surface and along the bulk of the water.\nObserve the motion of the pepper grains as waves are passing to get an indication of\nthe particle motion. What happens to the particles at the surface when a wave crest\npasses? When a wave trough passes?\nPost-Lab Analysis\nIn your lab report, the final results you present must be in non\n\" = (gk)1/2 -dimensional form. Since\nthe wavenumber is k = 2π/λ and the frequency is\n(where g = 9.80 m/s2 ), a\ngood choice is to normalize (divide) length by 1/k and time by (gk)-1/2. In other words, the\nnon-dimensional length, x', is given by x' = x / (1/k) = kx, and the non-dimensional time,\n/\nt', is given by t' = t / (gk)-1/2 = (gk)1 2 * t. Tables and graphical plots should be used.\nLABEL ALL AXES!\n\nThe lab report should include the specific procedure of the experiments, data analysis,\nand a discussion of your results.\nBesides the discussion and explanation the above measurement steps, the following\nresults are required to be analyzed and discussed in your lab report.\n- Relationship between wave length and frequency (from both the wave probe and\nvisual measurements).\n- Relationship between phase velocity and frequency.\n- Relationship between group velocity and frequency.\n- Relationship between phase velocity and group velocity.\n- Dependence of the above results on the wave amplitude.\n- Also discussion of the observed particle orbits and surface motions.\nPlots or tables may be useful in these discussions. In addition to these, you are\nencouraged to discuss other hydrodynamic issues you have learned from the experiments.\nThe lab report should be written in a professional way. It should be type-written and\nshould have been edited for grammatical and spelling errors. Although it needs to be\ncomplete, conciseness is also emphasized."
    },
    {
      "category": "Resource",
      "title": "add_mass_deriv.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/3336f1654b762fbcbac5c26757b37332_add_mass_deriv.pdf",
      "content": "Added Mass Force\nFormulation\nProf. A. Techet\n\nAdded Mass Tensor\n\nVector Velocity\nAccelerations:\n\nAdded Mass Forces and Moments\n\nTensor Notation\n+\n_\n\nEinstein Summation\nSum up the terms for all i,j,k,l options:\nFor example take: j =1 for the Force in the 1-direction (x-component)\nSum over all i = 1:6:\nNext consider k = 1,2,3 then l = 1,2,3 Æ\n\nFor\nk = 1,2,3\nSince we are considering the F1 component where j = 1, then all terms with ε in\nthem where j = k = 1 will be zero. So there is no reason to consider k = 1 here.\nSo we just sum up the terms where k = 2 and k = 3:\n(same as before)\nLet: k = 2\nNext Let: k = 3\n\nNext look at\nl = 1,2,3\nSince we are considering the F1 component where j = 1, then all terms with e in\nthem where j = l = 1 will be zero. So there is no reason to consider l = 1 here.\nSo we just sum up the terms where l = 2 and l = 3:\n(same as before)\nLet: l = 3\nNote that any term where k = l then ε is zero\nNext Let: l = 2\n\nTotal Force:\n\nExample\nOnly need to look at values of i = 1,3,6\n\nForce becomes:\nSince velocity is\nthen\nNow the only non-zero terms are for l = 2 therefore\n\nSlender Body\n\nAdded Mass Matrix\n\nFigure removed for copyright reasons. Please see:\nTable 4.3 in\nNewman, J. \"Added-Mass Coefficients for Various Two Dimensional Bodies.\" In Marine Hydrodymanics.\nCambridge MA: MIT Press, 1977. ISBN: 0262140268."
    },
    {
      "category": "Resource",
      "title": "free_surf_wave.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/3133000c14ec08086951d724ff277b13_free_surf_wave.pdf",
      "content": "Free-Surface Waves\n2.016 Fall 2005\nProf. A. Techet\nDept. Mechanical Engineering\n\nOcean Waves\nPhotos removed for copyright reasons.\n\nWave Breaking\nPhotos removed for copyright reasons.\n\nBreaking wave in a Laboratory\n\nPIV under the interface\nPlunging Breaker\nWe = 4568, Re = 6.94x105\nf = 2.0Hz, = 0.366m, = 42 dynes/cm\n\nPIV under the interface\nPlunging Breaker\nWe = 4568, Re = 6.94x105\nf = 2.0Hz, = 0.366m, = 42 dynes/cm\n\nPIV under the interface\nPlunging Breaker\nWe = 4568, Re = 6.94x105\nf = 2.0Hz, = 0.366m, = 42 dynes/cm\n\nPIV under the interface\nPlunging Breaker\nWe = 4568, Re = 6.94x105\nf = 2.0Hz, = 0.366m, = 42 dynes/cm\n\nEffect of Surface Tension on\nwave profile\nPure Distilled\nWater\nHigher surface\nClean Tank\ntension\nConditions\nDistilled Water\nLower surface\n+ 3% IPA\ntension\nClean Tank\nConditions\n\nCauses of Ocean Waves\n- Wind blowing across the ocean surface\n- Frequency f =10-2 to 102 Hz\n- Period T = 1/f = 0.01 to 100 seconds\n- Pull of the sun and moon\n- Frequency is on the order 10-4 to 10-6 Hz\n- Period T = 12, 24 hours (tides)\n- Earthquakes - e.g. Tsunamis\n- Frequency less than 10-2 Hz\n- Long wave period\n\nOCEAN WAVES SPECTRUM\nFIGURE 1. Wave energy spectra. Red text indicates wave generation mechanisms\n\nand blue text indicates damping/restoring forces.\n\nWorld Meteorological Org.\nSea State Codes\nSea State\nCode\nSignificant Wave Height\nRange\nMean\n0 (meters)\n0 (meters)\n0-0.1\n0.05\n0.1-0.5\n0.3\n0.5-1.25\n0.875\n1.25-2.5\n1.875\n2.5-4.0\n3.25\n4.0-6.0\n5.0\n6.0-9.0\n7.5\n9.0-14.0\n11.5\n> 14.0\n> 14.0\nDescription\nCalm (glassy)\nCalm (rippled)\nSmooth (mini-waves)\nSlight\nModerate\nRough\nVery Rough\nHigh\nVery High\nHuge\n\nGeneral Wave Problem\n\nUnknowns\n- Velocity Field\nuv\nV ( , , , ) = ( , , , )\nx y z t\nx y z t\n- Free Surface Elevation\nz x y t\nx y t\n( , , ) =( , , )\n- Pressure Field\n( , , , ) =\np x y z t\npdynamic + phydrostatic\n\nGoverning Equations & Conditions\n- Continuity (Conservation of Mass):\n0 for z\n\n=\n<\n- Bernoulli's Equation (given ):\n\ngz\n+\n\n2 + p\npa +\n=\n\n0 for z <\nt\n\n- No disturbance exists far away:\n, 0 and p\npa gz\n\n=\nt\n\nBoundary Conditions\n- In order to solve the boundary value problem for\nfree surface waves we need to understand the\nboundary conditions on the free surface, any\nbodies under the waves, and on the sea floor:\n- Pressure is constant across the interface\n- Once a particle on the free surface, it remains there\nalways.\n- No flow through an impervious boundary or body.\n\nPressure Across the FS Interface\n=\non z =\np\npatm\n\nBernoulli's Eqn.\nat the free surface\n( )\np +\n+ 1 V 2 + gz\n\n= c\n\nt\n\nt\n\n( ) = p\np =\n+ 1 V 2 + gz + c t\natm\nt\n\nSince c(t) is arbitrary we can choose a suitable constant that\nfits our needs:\n( ) = p\nc t\natm\nThus our pressure boundary condition on z = becomes:\n{\n} 0\n2 V\ng\nt\n\n+\n+\n=\n\nOnce a Particle on the FS...\nThe normal velocity of a particle on the FS follows the normal\nvelocity of the surface itself:\nz =(x t\n\n)\nz-position of the particle\n,\np\np\nLook at small motion z :\np\n\nz + z =(xp + x t\n\n+t) =(x t\n\n) +\nx +\nt\n,\n,\np\np\np\np\np\nx\nt\nOn the surface, where z p =, this reduces to:\n\nx p\nz = xp t +\nt\n= u\nzp = w\np\nx t\nt\nt\nt\non\nw\nu\n\nz\n\nx\nt\n\n=\n+\n=\n\nNo flow through an impervious boundary\nVelocity of the fluid normal to the body must be equal to\nthe body velocity in that direction:\n( , , ,\nOn the Body: B x y z t ) = 0\nur r\nr\nur\n\nV nˆ =\nnˆ =\n=U (\n) ˆ(\n)\n\nx t\n,\n=Un on B = 0\n,\nn x t\nn\nAlternately a particle P on B remains on B always; i.e. B is a material surface.\nFor example: if P is on B at some time t = to such that B(x,to) = 0 and we were to\nfollow P then B will be always zero:\nr\nr\n( , o\n( ,\n=\n\n0 for all t,\nIf B x t ) = ,\n\nthen B x t )\nDB\nB\n\n=\n+ (\n\n)B = 0 on\n\nB\n\n= 0\nDt\nt\nTake for example a flat bottom at z = H then /z = 0\n\nLinear Plane Progressive Waves\nLinear free-surface gravity waves can be characterized by\ntheir amplitude, a, wavelength, = 2/k, and frequency,\n.\n( , ) = a cos( kx t)\nx t\n\nLinear Waves\nh / < 1/\n\n- a is wave amplitude, h = 2a\n-\nis wavelength, = 2/k where k is wave number\n- Waves will start to be non-linear (and then break)\nwhen h/ > 1/7\n\nLinearization of Equations &\nBoundary Conditions\na\n\n=\nt\nt\n\n=\nu\nu\na\n\n=\nx\nx\n\n=\nw\nw\na\n\n=\na\n\n=\nd\na\nd\n\n=\nd\nt\nt\nd\n\n= /\ndx\ndx\n\n=\nNon-dimensional variables :\n\nFS Boundary Conditions\n1. Dynamic FS BC:\n{ + 1 V 2 + g} = 0\n(Pressure at the FS)\nt\n\nCompare\nand V 2 ~\n\nt\nx\n\na 2 2 (\n)\na (\n)\n\nx\n(\n)\n\nx\nx\n=\n=\n\na 2\n\nt\n\nt\nt\n\n/\n\n1 14 since h = 2a.\nIf h/\n<<1 7 then a/\n<< /\n\n( )2\n\n<<\nx\nt\n\n{\n+ 1 V 2 + g} = 0 becomes\ng\nt\n\n+\n=\n\non z =\nt\n\nFS Boundary Conditions\n2. Kinematic FS BC:\n\n=\n(Motion at the Surface) w\nu\n+\nx\nt\nNon-dimensionalize:\n*\n*\n\n*\n* a\na w = a u\n+ a\n*\n*\nx\nt\n\n/\nIf h/\n<<\n\n1 7\nu\n<<\nand u\n<< w\nx\nt\nx\nTherefore:\n\nw\nu\n+\nbecomes\n=\nz\nt\n\n=\n\non z =\nx\nt\n\nFSBC about z=0\nSince wave elevation, , is proportional to wave amplitude, a, and a is small\ncompared to the wavelength, , we can simplify our boundary conditions one\nstep further to show that they can be taken at z = 0 versus z = .\nFirst take the Taylor's series expansion of (x, z=, t) about z=0:\n\n,\n(x z =, t) = (x, 0, t) +\n+ ...\nz\nIt can be shown that the second order term and all subsequent HOTs are\nvery small and can be neglected. Thus we can substitute (x, z=0, t) for\n(x, z=, t) everywhere:\nt\ng\n\n=\n\n1 2\n\n=\n+ g = 0\nt\nt\ng t\nn\n0 o\nz\nt\nz\ng\n\n+\n=\n=\n\n=\nz\nt\n\nLinear Wave\nBoundary Value Problem\n\n=\n+\n= 0 for z < 0\nx\nz\n1. Sea Floor Boundary Condition (flat bottom)\n= 0 on z = H\nz\n2. Dynamic FSBC (Pressure at the FS)\n=\non z = 0\ng t\n3. Kinematic FSBC (Motion at the Surface)\n\n+ g\n= 0 n\no z = 0\nt\nz\n\nSolution to Laplace's Equation\nBy Separation of Variables we can get a solution for linear FS waves:\n(\n)\nx t\n,\n= a cos(\n\nkx t + )\na\n, ,\nz\n(x z t ) =\nf ( ) sin( kx t + )\nk\n( , ,\nz\nu x z t ) = a f (\n\n)\n\ncos(\n\nkx t + )\nw(x, z,t ) = af1(z)sin(kx t +)\n= gk tanh( kH ) dispersion relation\nWhere:\nk z + H )]\nsinh[ (\ncosh[ (\nk z + H )]\nf z\n1( ) =\n( ) =\nf z\nsinh(kH )\nsinh(kH )\n\nDispersion Relationship\nThe dispersion relationship uniquely relates the wave frequency\nand wave number given the depth of the water.\n= gk tanh( kH )\nThe solution must satisfy all boundary conditions.\nPlugging into the KBC yields the dispersion relationship\n- Approximations\n- As kH 0 tanh( kH ) kH\ngk H (shallow)\n- As kH tanh( kH ) 1\ngk\n(deep)\n\n(\n\nPressure Under Waves\nUnsteady Bernoulli's Equation:\n\np =\n\nV gz\n\n{\nt\n{\nhydrostatic\nunsteady\n2nd Order\npressure\nfluctuation\nterm\nDynamicPressure\nSince we are dealing with a linearized problem we can neglect the\nnd order term. Thus dynamic pressure is simply:\n\np\nx\nz\nt\n\n) =\nd ( , ,\nt\na\n\n( ) cos( t kx ) =\nf ( ) (x t\n)\n=\nf z\nz\n,\nk\nk\ncosh k z + H )\nx\n\nt\n\n= g (\n)\n,\ncosh (\n)\nkH\n\nMotion of a Fluid Particle\ncos\n\nParticle Orbits\nUnder the waves particles follow distinct orbits depending on whether\nthe water is shallow, intermediate or deep. Water is considered deep\nwhen water depth is greater than one-half the wavelength of the wave.\n\nParticle Orbits in Deep Water\nH (kH\n\n1)\n= gk dispersion relationship\n( ) f ( ) ekz\nf z\nz\nkz\nae\n2 + p =(\n)\np\nCircular orbits with\nexponentially\ndecreasing radius\nParticle motion extinct at z\n-/2\n\nat the free surface...\nThe intersection between the circle on which\nand p lie and the elevation profile (x,t)\np\ndefine the location of the particle.\nThis applies at all depths, z:\np(x,z,t) = a ekz cos(t-kx+) = (x,t) ekz\n\nParticle acceleration and\nvelocity\n\nPhase Velocity\n\nV =\n=\n=\ng tanh kH\n\nPhase Velocity= speed of the\np\nk\nwave crest\nT\nk\nMotion of crest\nin space and time\n\nGroup Velocity\nSimple Harmonic Wave: (x,t) = a cos(t-kx)\na\n,\n= lim {2 cos ([\n]t [k k ]x)+ a cos ([ +]t [k +k ]x)}\n(x\n\nt\n\n)\n\nk , 0\n\n= lim {a cos( t kx\n\n) cos( t k\n\nx\n\n)}\nk , 0\n\n(t, x = 0)\n\nGroup Velocity\n\nd\nV =\n=\n= gk tanh( kH )\ng\nspeed of the\nwave energy\nk\ndk\n\nd\nd\n{ }= dk {kg tanh( kH )}\n\ndk\nd\nkgH\n\n= g tanh( kH\n\n) +\ndk\ncosh ( kH )\nd\n1 g\n\nkH\n\n=\ntanh( kH ) 1+\n\ndk\n\nsinh( kH ) cosh( kH )\n=V\nk\np\n\ng\np\nkH\nC\nC\nkH\nkH\n\n=\n+\n\nkg\n=\ng\np\nC\nC\n=\n=\ng\np\nC\nC\n=\nH\nH\nShallow water\nDeep water\nsinh\ncosh\ngH k"
    },
    {
      "category": "Resource",
      "title": "introslides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/005a2dfb01d258022c80c55cbe6da798_introslides.pdf",
      "content": "i\n2.016:\nHydrodynamics\nAlexandra H. Techet\nDept. of Mechanical Engineering\nLecture 1\nMIT Dept. Mechanical Engineer ng, 2005\n\ni\nWhat is Hydrodynamics?\n- Hydrodynamics v. Aerodynamics\n- Marine Hydrodynamics\nplatforms\npropellers, etc.\nMIT Dept. Mechanical Engineer ng, 2005\n- Water is almost 1000 times denser than air!\n- Design of underwater vehicles, ships,\n- Waves, wave energy,\n- External flows around ships, hydrofoils,\n- Added Mass!\n- Flow-structure interactions\n\ni\nFluid Properties @20oC\n- Air\n-\n- Dynamic Viscosity\n- Kinematic Viscosity\n-\n- Dynamic Viscosity\n- Kinematic Viscosity\n/\nρ =\n1.2\n/\nρ =\n/\n/\nm\ns\n\nν\nμ ρ\n-\n=\n=\n×\n2 /\nm\ns\nν\n-\n= ×\n/\nμ\n-\n=\n×\n⋅\n/\nμ\n-\n=\n×\n⋅\n/\n(\n)\nρ =\nMIT Dept. Mechanical Engineer ng, 2005\nDensity\n- Water\nDensity\n(fresh water)\nkg m\nkg m\n1.51 10\n1 10\n1.82 10 N s m\n1.0 10 N s m\nseawater\nkg m\n\ni\nOcean Exploration &\nHydrodynamics\n- 70-75% of the earth's surface is covered by\nwater.\n-\nresources.\n-\nsuch as Food, medicines, energy, and water.\n-\nocean exploration capabilities and to assure that\nour ocean resources will persist for generations\nto come.\n-\nus to design better ocean vessels and to\nunderstand physical ocean processes.\nMIT Dept. Mechanical Engineer ng, 2005\nThe earth's oceans are one of our least explored\nMany exciting discoveries lie waiting in the deep:\nGood engineering is needed to advance current\nUnderstanding marine hydrodynamics can help\n\ni\nUnderwater Vehicles & Submarines\nAlvin, WHOI\nABE, WHOI\nOdyssey, MIT SeaGrant\nUSN Submarine\nMIT Dept. Mechanical Engineer ng, 2005\nPhotos removed for copyright reasons.\n\ni\nShip Hydrodynamics\nis Shum\nBuilt by International Catamarans\nFast Ferries\nCONTAINER SHIPS &\nCARGO TRANSPORTS\nRacing Yachts\nResearch Vessels\nNaval Vessels\nPhotos removed for copyright reasons.\nMIT Dept. Mechanical Engineer ng, 2005\nPhoto by Denn\nTasmania, Hobart\nPrada at Americas Cup 2000\n\ni\nOffshore Engineering\nDue to explosion onboard\nThe offshore platform must be\ndesigned to simutaneously\nwithstand hurricane force waves\nand winds.\nPhotos removed for copyright reasons.\nMIT Dept. Mechanical Engineer ng, 2005\nPetrogras Rig Sinking off Brazil\nThe Ursa unit is located approximately\n130 miles south-east of New Orleans.\nhttp://www.offshore-technology.com/projects/ursa/\n\ni\nGenesis Spar Platform\nPhotos removed for copyright reasons. Please see:\nhttp://www.offshore-technology.com/projects/genesis/\nMIT Dept. Mechanical Engineer ng, 2005\n\ni\nBiologically Inspired Vehicles?!?\n-\nled to engineering designs for underwater\nvehicles inspired by these creatures amazing\nability to exist in the ocean.\n-\nscience and engineering and is referred to as\nbiomimetics...\nMIT Dept. Mechanical Engineer ng, 2005\nThe study of fish and other aquatic animals has\nThis mimicking of nature is widespread through\n\ni\nOcean Waves\nMIT Dept. Mechanical Engineer ng, 2005\nPhotos removed for copyright reasons.\n\ni\nRandom Ocean Waves\nSignificant Wave Height\nMIT Dept. Mechanical Engineer ng, 2005\n\ni\nWave Energy Spectra\nFIGURE 1. Wave energy spectra. Red text indicates wave generation mechanisms\nand blue text indicates damping/restoring forces.\nMIT Dept. Mechanical Engineer ng, 2005\n\ni\nWake Instability\nFigure removed for copyright reasons.\nMIT Dept. Mechanical Engineer ng, 2005\n\ni\nHydrodynamic Forces on\nVessels\n- Linear wave theory\n-\n- Wave forces on bodies\n-\n-\nMIT Dept. Mechanical Engineer ng, 2005\nAdded mass!!!\nViscous forces on bodies:\n- Skin Friction Drag\n- Vortex shedding, Vortex induced vibrations\nViscous damping\n\ni\nShip Motions\nRight hand rule rules!\nx\nz\ny\nh3\nh4\nh1\nh2\nh6\nh5\nh1\nh2\nh3\nh4\nh5\nh6\nMIT Dept. Mechanical Engineer ng, 2005\nSign convention for translatory & angular displacements\n= surge\n= sway\n= heave\n= roll\n= pitch\n= yaw\nFigure by MIT OCW.\n\ni\nNomenclature\n- Length on Waterline (LOW)\n- Beam (width of vessel at widest point)\n-\n(center of ship)\n- Draft (depth of the keel below the water)\n- Keel = part of the vessel extending below the hull\nMIT Dept. Mechanical Engineer ng, 2005\nMidships\n\ni\nSyllabus\n-\n- Basic Fluid Properties\n-\n- Basic Principles of Hydrodynamics\n- Part II: Free Surface Waves and Wave Forces on Offshore\nStructures and Vehicles\n-\n- Dispersion Relationship\n-\n-\n- Added Mass, Damping, & Hydrostatic restoring coefficients (Strip\ntheory)\n- Equations of motion for Seakeeping; natural frequency\nMIT Dept. Mechanical Engineer ng, 2005\nPart I: Introduction to Marine Hydrodynamics\nHydrostatic Pressure\nLinear Wave Theory: Boundary Value Problem; Simplifying assumptions\nUnsteady Bernoulli's Equation, Dynamic Pressure\nIncident wave forces on bodies\n\ni\nSyllabus\n- Part III: Viscous Flows and Free Surface Flows\n- Viscous Lift and Drag;\n-\n- Vortex Induced Vibrations (VIV); Morrison's Equation (Offshore\nPlatforms)\n- Ship Resistance Testing\n-\n-\n-\n-\n-\n-\n-\n- Equations of motion\n* time permitting\nMIT Dept. Mechanical Engineer ng, 2005\nDrag and resistance of streamlines and bluff bodies\nRudders and Propellers, Cavitation and Flow Noise\nNavier Stokes Equations: Separated Flows and Boundary Layers *\nPart IV: Geophysical Fluid Dynamics*\nMajor ocean circulations and geostrophic flows;\nHeat balance in the ocean;\nInfluence of wind stress\nCoriolis force, Tidal forces, geostropic currents\n\ni\nGrading\n- Grading Policy:\n-\n15%\n- Laboratory:\n20%\n- 2 In-class Exams:\n30%\n-\n35%\n- Exam #1 In class: 10/6 Thursday\n- Exam #2 In class: 11/17 Thursday\n-\nMIT Dept. Mechanical Engineer ng, 2005\nHomework:\nFinal Exam:\nFinal Exam: TBA\n\ni\nLabs\n- Lab Safety Brief\n9am\n- Lab #1 Added Mass:\n-\n- Lab #2 Waves\n-\n- Lab #3 Ship Resistance\n-\n- Lab #4 Group Project\n-\n- Labs due on the following THURSDAY in class.\nMIT Dept. Mechanical Engineer ng, 2005\n- Tomorrow\nFriday 9/23\nFriday 10/14\nFriday 11/4\nTBA, reports due 12/2, presentations 12/9\n\ni\nRecitations\n- During non-lab weeks recitations will be\nheld Fridays from 9-11 am.\n-\nexamples and course material as\nnecessary.\n-\nscheduled by the TA.\nMIT Dept. Mechanical Engineer ng, 2005\nThese recitations will cover additional\nAdditional exam reviews may also be\n\ni\nHomeworks\n- Weekly problem sets will be assigned and are\ndue the following week unless otherwise noted.\n-\nresult of individual effort.\n-\nthe homework and review of the course material\nis encouraged.\n-\nTuesday.\nMIT Dept. Mechanical Engineer ng, 2005\nHomework solutions are expected to be the\nGroup discussions of the concepts covered on\nHW handed out on Tuesdays, due the following"
    },
    {
      "category": "Resource",
      "title": "2005reading1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/dc299d2ff05553b3515dccc23fc0f7d2_2005reading1.pdf",
      "content": "2.016 Hydrodynamics\nReading #1\n2.016 Hydrodynamics\nProf. A.H. Techet\nWhy study Marine Hydrodynamics?\nThe Earth's oceans are one of our least explored resources. About 70-75% of the Earth's\nsurface is covered by water. The total area of water covering the earth's surface is\n361,419,000 km2, of which the oceans make up 335,258,000 km2 (97%). There is the\npotential for many exciting discoveries in the deep: such as sources of food, medicines,\nenergy, and water. Advanced engineering knowledge is needed to propel current ocean\nexploration capabilities and to assure that our ocean resources will persist for generations\nto come. Understanding marine hydrodynamics can help us to design better ocean\nvessels and to understand physical ocean processes.\nMarine Hydrodynamics encompasses many topics, including how surface ships,\nunderwater vehicles and surface platforms interact with their environment. Waves and\ncurrents significantly affect these structures and a solid understanding of the fluid\ndynamics and forces that arise from fluid motions are crucial to designing and building\ncomplex ocean systems. Such systems include:\n- Design of offshore platforms, such as tension leg platforms and marine risers\n- Offshore instrumentation buoys for oceanographic measurement\n- Design of surface ships and propellers\n- Design of underwater vehicles\nStudying marine hydrodynamics provides a greater understanding of a wide range of\nphenomena of considerable complexity involving fluids. Understanding these\nphenomenon allow us to make predictions for practical ocean engineering applications. A\nfluid is a continuous medium made up of small particles. In general, fluid mechanics\nallows us to study groups of these particles without having to know what each individual\nparticle is doing.\nThe study of fluids at rest is called hydrostatics, and in this case, hydrostatic pressure is\nthe predominate forcing. Of course, moving fluids are more interesting. When the fluid\nstarts moving or a body in a fluid moves relative to the fluid, things start getting\ninteresting and often quite complicated.\nversion 4.0\nupdated 8/30/2005 aht\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #1\nHydrodynamics v. Aerodynamics\nWater is almost 1000 times denser than air!\nHydrostatic pressure is important\nAdded Mass is an important factor in dynamic systems in the ocean.\nBasic Fluid Properties\nWhat defines a fluid?\nFluid vs. Solid:\nSolids at rest will deform only so far under forces.\nFluids cannot rest - they must be in motion to sustain shear stress.\n- Conservation of Mass\n)\nSimilarities\nThe continuum hypothesis is used for both fluids and solids.\nThe fundamental laws of mechanics apply to both fluids and solids.\n- Newton's law of motion (conservation of momentum\n- First law of thermodynamics (conservation of energy)\nBoth have constitutive laws relating stress and rate of strain.\nLiquid vs. Gas:\nLiquid settles under gravity and forms a free surface.\nGas fills the entire containing space evenly.\n(Note that \"fluid\" is a general term encompassing both liquids and gases).\nHow can we describe a fluid?\nFluid is made up of molecules that move freely relative to each other. This motion is\nimperceptible in bulk fluid processes like we will consider in this class. The variation of\nthe properties within the fluid is so smooth that we can use differential calculus to\nanalyze the substance. Thus we will assume that a fluid is a continuous medium for the\nremainder of this course. This is the \"continuum hypothesis\".\nFor example a bulk of fluid has mass ∆m associated with volume ∆V the average density\nof the fluid is ∆m/∆V. Considering a fluid to be continuous allows us to take the limit as\nthis volume goes to zero (thus dividing our bulk of fluid into smaller and smaller parcels).\nSuch that the mass density of the fluid at a point can be defined as:\nlim ∆m\nρ ≡V →0 ∆V\n(1.1)\nversion 4.0\nupdated 8/30/2005 aht\n-2-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #1\nContinuum fails when the volume gets so small that the volume is less that 10 x lm\n(where lm is the average path length a molecule follows before bumping into another\nmolecule - this is like 10-7 m for air at sea level - so 1000 times smaller than a strand of\nhair).\nThroughout the course we will talk about a particle of fluid - this is just a very small\nelement of fluid - large enough however to have its properties defined as in the limit\nabove.\nUnits of Measurement:\nDimensional units used in this class will primarily be SI units (from the French Le\nSysteme International d'Unites). Later in the course we will look at the use of\ndimensional analysis in scaling laboratory model testing or comparing flow at different\nspeeds or length scales. It is always a good idea to check your units when doing\nengineering problems.\nThere are only four primary dimensions in fluid mechanics from which all other\ndimensions can be derived. These are mass [M], length [L], time [T] and temperature\n[Θ]. (In the case of electromagnetic effects, electric current [I] may also be useful.)\nSecondary dimensions are those derived as combinations of the primary dimensions, for\nexample: velocity, acceleration, and force.\nTake as an example, Newton's Second Law: F = m a\n1 Newton force = 1 N ≡1 kg ⋅ m / s2\nso dimensionally we can see that force has the units of mass times length divided by time\nsquared:\n[F] = [M L T-2]\nversion 4.0\nupdated 8/30/2005 aht\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #1\nArea\n[L2]\nm\n\nVolume\n[L3]\nm\n\nVelocity\n[L T-1]\nm/s\n\nAngular Velocity\n[T-1]\n1/s\nAcceleration\n[L T-2]\nm/s2\nPressure or stress\n[M L-1T-2]\nPa = kg / (m s2)\nEnergy, heat, work\n[M L2 T-2]\nJ = N m\n\nPower\n[M L2 T-3]\nW = J/s\nDensity\n[M L-3]\nkg / m3\nDynamic Viscosity\n[M L-1 T-1]\nkg/(m s)\n\nKinematic Viscosity [L2 T-1]\nm2/s\nWe will refer back to this notation when we discuss dimensional analysis further.\nPhysical Properties of a Fluid:\nDensity, ρ, is defined as mass/unit volume.\nCan be effected by pressure and temperature (i.e. as you heat air, it becomes less\ndense and rises).\nDensity of freshwater at 4o C is 1000 kg/m3; at 20o C is 998.2 kg/m3.\nDensity of seawater is 1025 kg/m3 at 20oC and 1 atmosphere pressure.\nDensity of air is 1.204 kg/m3; at 20oC at atmospheric pressure. NOTE: Water is\n1000 times more dense than air!\nIf density does not change under pressure the fluid is deemed incompressible.\nCompressibility is affected by the speed of sound in the medium. Denser fluids have a\nhigher speed of sound. For example, in air the speed of sound is 300 m/s and in water it\nis about 1000 m/s. Fluid will compress only if its velocity exceeds the speed of sound.\nIn air this is not so difficult (think concord and sonic boom). Also the density of air is\nmuch less than that of water. In aerodynamics this opens up the study of subsonic (below\nspeed of sound), transonic (near the speed of sound) and supersonic (above the speed of\nsound) flows.\nFor this course and most ocean/water flows compressibility will not be an issue and it\nwill be assumed that the fluid is incompressible unless otherwise noted.\nSpecific Gravity, SG = density of substance/density of water\nIf the SG is less than 1, the substance will float in water.\nIce floats because it specific gravity is about 0.917 (at 20oC)\nversion 4.0\nupdated 8/30/2005 aht\n-4-\n(c)2005 A. Techet\nSecondary\nPrimary\nSI unit\n\ndimension\ncomponents\n\n2.016 Hydrodynamics\nReading #1\nPressure, p:\nPressure is a scalar quantity and always acts at right angles to a surface.\nPressure is isotropic: it is equal in all directions and acts regardless of orientation.\nPressure is a stress (force per area) and produces a force normal to the body\nsurface that it acts upon.\nForce = -p dA n\n(1.2)\nEven a small pressure can create a huge force if the area it acts on is large.\nPressure inside or outside of a vessel causes stress within the containers walls.\nTake a balloon for example: Pressure of the air inside forces the balloon walls out\nuniformly - if too much pressure builds and the walls are stretched too thin they will\nbreak.\nIn a pipe, pressure acts radially outwards and stress is built up in the pipe walls requiring\na circumferential force within the pipe walls. This outward pressure causes a tensile\nstress in the material.\nPressure is transmitted evenly through a fluid:\nIf you push your finger into a full balloon - this applied pressure will distribute through\nthe gas (air) and cause the internal pressure to rise - If you push too hard the balloon will\npop.\nIf you increase the pressure by 10 psi at one point in a long pipe, the pressure will\neventually increase throughout the entire pipe by 10psi. This may not be instantaneously\nthough. Pressure disturbances travels at the speed of sound! After all sound is simply a\npressure disturbance propagating through the air or water.\nIncreases in velocity can affect pressure: assuming a small parcel of fluid is accelerated\nfrom V1 to V2, at the same height, the pressure change would be\n∆p = - /2 ρ (V2\n2-V1\n2).\n(1.3)\nPressure due to a change in velocity is called dynamic pressure.\nViscosity, (ν or μ), is related to the ability of a fluid to flow freely. Different fluids flow\nmore freely than others: Glycerin, water, vs. motor oil. Viscosity indicates how a fluid\nwill react to stresses and strains.\nversion 4.0\nupdated 8/30/2005 aht\n-5-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #1\nFigure 1: Strain Rate and shear stress in a fluid element.\nStrain rate in a fluid is given by δθ/δt. Newtonian fluids such as water, oil, and air have a\nlinear relation between applied shear and resultant strain rate:\nτ ∝ δθ/δt\n(1.4)\nSir Isaac Newton first postulated this resistance law in 1687. Those that do not follow this\nrelationship are referred to as non-Newtonian fluids (such as silly putty).\nBy geometry, tan δθ = (δu δt) / δy.\nIf we limit the motion to small changes,\ntan δθ ≈ δθ, and we get that\ndθ/dt\n=\ndu/dy\n(1.5)\nshear strain rate = velocity gradient\nSince shear stress is linearly proportional to shear strain rate, it is so related to velocity\ngradient as well. In hydrodynamics, the idea of a strain rate is not as important as the\nvelocity gradient in the fluid, so we write the proportional relation for shear stress in\nterms of the velocity gradient.\nτ = μ dθ/dt = μ du/dy.\n(1.6)\nThe constant of proportionality, μ, is called the dynamic viscosity, since it relates to the\nforces on the fluid. The dynamic viscosity has units of stress-time.\n[μ] = [kg/(m s)]=[N s / m]\n(1.7)\nversion 4.0\nupdated 8/30/2005 aht\n-6-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #1\nKinematic Viscosity, ν , so called because it relates to the motion of the fluid, is the ratio\nof the dynamic viscosity to density:\n/\nν = μ ρ .\n(1.8)\nUnits of kinematic viscosity are [length2/time] or [m2/s].\nBoth dynamic viscosity and kinematic viscosity can change with temperature.\nTemp.@20° C\nAir\nWater\nDynamic Viscosity (kg/m s)\n1.82 x 10-5 N s/m2\n1.0 x 10-3 N s/m2\nKinematic Viscosity (m2/s)\n1.51 x 10-5 m2/s\n1 x 10-6 m2/s\nViscosity is most important near a body boundary. You can also think of viscosity as a\nmeasure of the \"stickiness\" of the fluid. Any amount of viscosity causes the fluid to\n\"stick\" to a surface without slip. This \"no-slip\" condition requires that for a stationary\nbody the fluid velocity must approach zero as it approaches the wall. The no-slip\ncondition results in a thin shear-layer, called a boundary layer, to develop when fluid\nmoves over a plate.\nFigure 2: Boundary Layer Schematic\nFor water moving at U0 = 1 m/s, 1 meter down the plate the boundary layer has only\ngrown to be 0.005 m thick. That's really thin!\nBoundary layers play a crucial role in marine hydrodynamics from ocean floor boundary\nlayers, to boundary layers on ship or submarine hulls to those on offshore structures,\nhydrofoils and propellers.\nCONCEPT QUESTION: How would you go about determining the viscosity of a fluid?\nThink about different ways to design an apparatus that allows us to measure the fluid\nviscosity.\nversion 4.0\nupdated 8/30/2005 aht\n-7-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #1\nNon-Dimensional Parameters are very useful to describe engineering problems,\nespecially in fluids where experiments, models and reality do not always occur on the\nsame scale, velocity or size! In order to compare two similar cases, say an experiment\nwith a model ship and a full size Navy Destroyer (100 times larger than the model), we\nuse non-dimensional parameters to scale the experiments to match reality. Often we\ncannot quite match up exactly, but that where experimental experience and numerical\nmodels come in handy!\nReynolds Number is an important number in fluid mechanics. We'll introduce it here in\nthe context of viscosity and discuss it further in later lectures. Reynolds number is\ndefined as a ratio of the inertial forces to the viscous forces.\nRe = U L/ν\n(1.9)\nwhere U the fluid velocity, L the useful length scale, and ν is the kinematic viscosity.\nThe Reynolds number indicates, among other things, how thick a boundary layer will be.\nSurface Tension, σ\nAt the interface between a liquid and a gas (in other words where there is a density\ndiscontinuity), surface tension plays an important role. Surface tension arises from the\nattractive forces of that exist between molecules at the interface. Liquid surfaces tend to\ncontract to the smallest possible surface area - thus the reason water droplets tend to form\nspherically. Molecules fully submerged within a fluid tend to repel due to their close\npacking. However those on the surface are missing half of their neighbors and thus a\ntension arises across the surface layer. This mechanical effect is that of surface tension.\nFigure 3: Surface tension in a blob of water\nSurface tension has the units work per unit area:\n\n[σ] = [work]/[area] = N/m\nversion 4.0\nupdated 8/30/2005 aht\n-8-\n(c)2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "2005reading2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/e39d56269e95a75014c8e9a87b1324e4_2005reading2.pdf",
      "content": "2.016 Hydrodynamics\nReading #2\n2.016 Hydrodynamics\nProf. A.H. Techet\nPressure effects\nFluid forces can arise due to flow stresses (pressure and viscous shear), gravity forces,\nfluid acceleration, or other body forces. For now, let us consider a fluid in static\nequilibrium - with no velocity gradients (and thus, no viscous stresses).\nForces on fluid in static equilibrium are due only to:\n1. Pressure acting on the fluid volume\n2. Gravity acting on the mass of the fluid\n3. Other external body forces (e.g. electromagnetic)\nUsing standard conventions, we consider pressure to be positive for compression. Recall\nthat we said pressure is isotropic: it acts in all directions equally, and it always acts\nnormal to surfaces. Let us prove that it acts in all directions equally by considering a\ntriangular volume of fluid with height, dz, length, dx, and unit width, b, into the page:\nFigure 2.1: Elemental fluid volume\nversion 4.0\nupdated 8/30/2005\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nThe fluid element cannot support shear while at rest (by our definition of a fluid). Thus\nthe sum of the forces on the triangle, in the x- and z- directions, MUST equal zero:\nz\n∆\n-\n\np\n\nb\n\n(∆s)sin\n\nθ = 0\n(2.1)\n∑F = p\n\nb\n\n(\n)\nx\nx\nn\n∑F = pz (b∆x) -pn (b∆s)cosθ -1 ρ(b∆x∆z) = 0\n(2.2)\nz\nBy geometry, ∆z = ∆s sinθ and ∆x = ∆s cosθ , such that\n∑F = px -pn = 0\n(2.3)\nz\nand\n∑F = pz -pn -1 ρ∆z = 0 .\n(2.4)\nz\nTaking the limit as ∆x, ∆z goes to zero (i.e. the triangle goes to a point), we see that\np = p = p = p .\n(2.5)\nx\nz\nn\nSince θ is arbitrary, pressure at a point in a fluid is independent of orientation and is thus\nisotropic. Pressure (or any stress for that matter) causes NO net force on a fluid element\nunless it varies spatially!\nversion 4.0\nupdated 8/30/2005\n-2-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nLet us find how spatial pressure variation causes net force by considering a small fluid\nelement:\nFigure 2.2: Fluid Element Volume (z is positive upwards by convention).\nLet us assume that the only forces are due to gravity and pressure gradients. Let the\npressure on the bottom equal a reference pressure pbot = po . Then, the pressure on the top\nmay be found using a Taylor's series expansion:\n=\n(δz) + 1 d 2 p (δz)2 +...\n(2.6)\nptop\np0 + dp\ndz\n2! dz2\nTaking the limit as δz goes to zero we are able to ignore the higher order terms and keep\nonly up to second order. The resultant force due to pressure on the face is\ndxdydz .\n(2.7)\nFpress = ( pbot -ptop )dxdy = -dp\ndz 0\nWe have defined Fpress to act in the positive z-direction. (We will resolve the negative\nsign when we sum forces.) Acting in tandem to the pressure force is the force due to\ngravity. The fluid density and volume give the mass of the element. Let us assume that\nour fluid element is small enough that the density is constant within the element.\nTherefore (defining the force in the positive z-direction, we have)\nFweight = -mg = -ρVg\n(2.8)\nversion 4.0\nupdated 8/30/2005\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nFor static equilibrium, pressure forces MUST balance gravitational/body forces:\nFpress + Fweight = 0\n(2.9)\n- dp (dxdydz) -ρg(dxdydz) = 0\n(2.10)\ndz o\nWe can drop the subscript \"o\" from the pressure gradient term since we have taken the\nlimit to a small element of fluid. This equation is valid at any point in the fluid.\nCanceling the elemental volume terms we are left with the hydrostatic equation.\n(2.11)\ndp\n-\n=\nρg\nHydrostatic Equation:\ndz\nThe negative sign is valid here since the z-direction is taken positive pointing up, in the\nopposite direction to the gravitational force. In other words, the pressure decreases as\nyour elevation increases. Remember, there is no pressure in outer space! Conversely, the\npressure increases as your elevation decreases. The pressure at the bottom of the pool is\nhigher than it is at the surface, which is why you have to equalize the pressure in your\nears! (If we defined the z-direction to coincide with gravity then the negative sign would\nbe dropped.)\nIn this case, we only considered pressure variations in the z-direction (kˆ). In general,\nthere are pressure changes in the x- or y-directions as well, and we define the pressure\ngradient as:\n∇p = dp iˆ + dp ˆj + dp kˆ.\n(2.12)\ndx\ndy\ndz\nWe can rewrite the hydrostatic equation as:\n∇p = -ρgkˆ\n(2.13)\nThe pressure gradient is always balanced by gravity, acceleration, viscous forces, and any\nother external body forces.\nversion 4.0\nupdated 8/30/2005\n-4-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nGauge and vacuum pressure:\nPressure is usually referred to in one of two ways:\n1) Absolute, or total, pressure\n2) Relative to ambient (atmospheric) pressure\na) p > pa\nGage Pressure\np(gage) = p - pa\nb) p < pa\nVacuum pressure p(vacuum) = pa - p\nSince most pressure instruments measure the pressure in the fluid relative to atmospheric\npressure, relative pressure is the commonly used quantity.\nIn order to get the total (absolute) pressure from the gage or vacuum pressure, the\natmospheric pressure must be known.\nP (Pascals)\n120,000\n50,000\n40,000\n30,000\nHigh Pressure\n90,000\nLocal Atmospheric\n50,000\nVacuum Pressure\nAbsolute Zero\ntension\nFigure 2.3: Relative pressure chart\nversion 4.0\nupdated 8/30/2005\n-5-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nHydrostatic Force on a Wall:\nRecall the equation for the hydrostatic pressure gradient in a liquid is\n∇p = -ρgkˆ\n(2.14)\nwhich, in the vertical direction this translates to\ndp\n-\n= ρg ,\n(2.15)\ndz\nor\ndp = -ρ\ndz\ng\n.\n(2.16)\nIntegrating in the z-direction we get pressure as a function of depth:\npa∫ dp = -∫\n0ρg dz\n(2.17)\np\nz\npa - p = -ρg (0 - z)= ρgz\n(2.18)\np = pa -ρgz\n(2.19)\nNote that z is defined as zero at the surface, so pressure increases with depth (since\nz < 0 under water) with a constant slope, ρg . Pressure is either considered relative to a\nreference pressure or in absolute terms. Most pressure gauges are differential\nmeasurement devices that measure pressure relative to ambient (or atmospheric) pressure.\nThus it is important to keep in mind the effects due to atmospheric pressure in your\nlaboratories and calculations.\nPressure is isotropic, and therefore pressure is the same on a vertical or horizontal surface\nat a given depth. Take for instance the ocean bottom and a vertical seawall that extends\nto the bottom. At depth H, the horizontal pressure acting on the wall is equivalent to that\npressure acting along the entire seafloor at that same depth.\nFigure 2.4: Absolute Pressure vs. Gauge pressure\nversion 4.0\nupdated 8/30/2005\n-6-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nHorizontal Force acting on a vertical surface:\nUsing absolute pressure formulation we can find the force on the wall from the pressure\nas a function of depth:\np = pa -ρgz\n(2.20)\nThus the elemental force acting in the x-direction due to the pressure is\ndF = pdA = ( pa -ρgz)wdz ,\n(2.21)\nx\nwhere w is the width of the wall into the page.\nTo determine the force on the wall we must consider the pressure acting on both sides of\nthe wall. Let's assume that on the left of the wall water of depth, h, is exerting force F1 on\nthe wall. The right side of the wall is open to the air with atmospheric pressure acting\nover the height of the wall. Under this setup we must account for the atmospheric\npressure on both sides of the wall. The elemental force in the x-direction at some depth z\nbelow the free surface is formulated on the left and right sides of the wall to determine\nthe total force acting on the wall:\nLeft:\ndFl = ( pa -ρgz)wdz\n(2.22)\nRight:\ndF = -pa wdz\n(2.23)\nr\nTotal force:\ndF = dFl + dF = P wdz -ρgzw dz -P wdz\n(2.24)\nx\nr\na\na\nThe two underlined terms cancel and we are left only with the effect due to the presence\nof the water. Integrating the pressure over the depth\nF = ∫-\nH -ρgzdz = 12 ρgwH 2\n(2.25)\nIf we use gauge pressure to calculate the force on the wall, we already take into account\nthe effect of atmospheric pressure and can directly calculate the force from:\npg = -ρgz (gauge pressure)\n(2.26)\nversion 4.0\nupdated 8/30/2005\n-7-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\ndF = pgdA = (-ρgz)w dz\n(2.27)\nResulting in the same force found when we used absolute pressure.\nThe force acting on the wall is a \"distributed load\" which acts along the entire depth of\nthe wall. However it is possible to determine how this force \"acts\" on the wall using a\nsimple moment balance:\ndMo = z × dF\n(2.28)\nwhere Mo is the moment on the wall about the origin and z is the moment arm\nperpendicular to the force direction.\nFigure 2.5: Moment balance on the wall.\nThe elemental moment about the origin due to the hydrostatic pressure is:\ndMo = z ⋅ (-ρgz)wdz\n(2.29)\nIntegrating leads to the total moment about the origin:\nMo = - 1 3 ρgwH 3\n(2.30)\nversion 4.0\nupdated 8/30/2005\n-8-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nBy definition the product of the force F times the moment arm z must equal the moment\nM:\nM =\nz\nF\n(2.31)\nSuch that the point at which the force acts on the wall is z :\nz = -13ρgwH 3\n12 ρgwH 2 = -2 3 H\n(2.32)\nFigure 2.6: The point at which the resultant force acts is known as the center of pressure.\nWe can use a similar approach to the problem of pressure on a sloped wall. This is left for\na homework exercise. Since atmospheric pressure acts everywhere then gage pressure is\nthe ideal pressure to use in these exercises. The resultant forces and moments on the\nsloped wall can be found using simple geometry and then extended to the case of a \"V\"-\nshaped ship hull.\nFigure 2.7: V-shaped Hull\nversion 4.0\nupdated 8/30/2005\n-9-\n(c)2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "2005reading3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/b97992061b6ee90cd549e01a678b08e5_2005reading3.pdf",
      "content": "2.016 Hydrodynamics\nReading #3\n2.016 Hydrodynamics\nProf. A.H. Techet\nIntroduction to basic principles of fluid mechanics\nI. Flow Descriptions\n1. Lagrangian (following the particle):\nIn rigid body mechanics the motion of a body is described in terms of the body's position\nin time. This body can be translating and possibly rotating, but not deforming. This\ndescription, following a particle in time, is a Lagrangian description, with velocity vector\nJK\n\n=\nV\nu\n\ni\n\n+ v j + w\n\nz\n\n.\n(3.1)\nUsing the Lagrangian approach, we can describe a particle located at point\nJJK\nx = (\n,\nx\ny\n, z ) for some time t = to, such that the particle velocity is\no\no\no\no\nG\nG ∂x\nV = ∂t ,\n(3.2)\nand particle acceleration is\nJK\nK\n∂V\na =\n.\n(3.3)\n∂t\nG\nWe can use Newton's Law of motion ( F = ma G ) on the body to determine the acceleration\nand thus, the velocity and position. However, in fluid mechanics, it is difficult to track a\nsingle fluid particle. But in the lab we can observe many particles passing by one single\nlocation.\n2. Eulerian (observing at one location):\nIn the lab, we can easily observe many particles passing a single location, and we can\nmake measurements such as drag on a stationary model as fluid flows past. Thus it is\nuseful to use the Eulerian description, or control volume approach, and describe the flow\nat every fixed point in space (x y z) as a function of time, t .\n, ,\nversion 3.0\nupdated 8/30/2005\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\n\nReading #3\n\nversion 3.0\nupdated 8/30/2005\n-2-\n(c)2005 A. Techet\n\nz\nx\nw\nu\n\nFigure 1: An Eulerian description gives a velocity vector at every point in x,y,z as a\nfunction of time.\n\nIn an Eulerian velocity field, velocity is a function of the position vector and time,\n( , )\nV x t\nJK K\n. For example:\n\n( , )\nV x t\ntx i\nzy j\nxyt z\n=\n+\n+\nJK K\n\n3. Reynolds Transport Theorem (the link between the two views):\n\nIn order to apply Newton's Laws of motion to a control volume, we need to be able to\nlink the control volume view to the motion of fluid particles. To do this, we use the\nReynolds Transport Theorem, which you'll derive in graduate fluids classes, like 2.25.\nSuffice it to say that the theorem exists. For this class, we'll use control volumes to\ndescribe fluid motion.\n\n4. Description of Motion:\n\nStreamlines: Line everywhere tangent to velocity (Eulerian) (No velocity exists\nperpendicular to the streamline!)\n\nStreaklines: instantaneous loci of all fluid particles that pass through a given point xo.\n\n2.016 Hydrodynamics\nReading #3\nParticle Pathlines: Trajectory of fluid particles (\"more\" lagrangian)\nIn steady flow stream, streak, and pathlines are identical!! (Steady flow has no time\ndependence.)\nII. Governing Laws\nThe governing laws of fluid motion can be derived using a control volume approach.\nThis is equivalent to a \"fluidic black box\" where all we know about the flow is what is\ngoing in and what is coming out of the control volume: mass, momentum, and energy.\nThe control volume (CV) can be fixed or move with the fluid. For simplicity it is often\nideal to fix the CV, but this does not always provide the easiest solution in all cases. For\nmost of this class the CV will be fixed.\nWhen analyzing a control volume problem there are three laws that are always true:\n1. Conservation of Mass\n2. Conservation of Momentum\n3. Conservation of Energy\n1. Conservation of Mass:\nBasic fluid mechanics laws dictate that mass is conserved within a control volume for\nconstant density fluids. Thus the total mass entering the control volume must equal the\ntotal mass exiting the control volume plus the mass accumulating within the control\nvolume.\nmass in - mass out = mass accumulating\n\nmin - mout = m\n(3.4)\nacc\nLet us consider three cases:\nversion 3.0\nupdated 8/30/2005\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\nCase I:\nIn control volume 1, water is poured into a tub with a drain. The mass flow rate into the\ntub is min = ρ V\n\nA in . Similarly, the mass flow rate out of the tub is m out = ρ Vout A out . If the\n\nin\nmass flow rate in is greater than the mass flow rate out, water will accumulate in the tub.\nIf the mass flow rate out is greater, then the tub will drain. If the two are equal, then no\nwater will accumulate in the tub. Think about it next time you're in the shower!\nCase II:\nControl Volume 2 is a section of a pipe full of water. Since the CV is full, the only way\nmore mass can accumulate is if it becomes denser. Remember, in this class, we treat\nwater as incompressible, so the density cannot change and we never have mass\naccumulating in a full control volume. Thus, the mass flow rate in equals the mass flow\nrate out. Furthermore, since CV2 is drawn in a pipe of constant area, then the velocity in\nmust equal the velocity out. For an incompressible fluid, there is no change in velocity\nthrough a pipe of constant area!\nversion 3.0\nupdated 8/30/2005\n-4-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\nCase III:\nLet's now consider a general control volume immersed in a fluid:\nWe can write a 2D mass balance equation for the fluid entering and exiting the control\nvolume.\n-mout = m\n(3.5)\n\nmin\nacc\n∂u\n∂v\nρudydz + ρvdxdz -ρ(u +\ndx)dydz -ρ(v +\ndy)dxdz = 0\n(3.6)\n∂x\n∂y\n∂u\n-ρ\ndxdydz -ρ ∂v dydxdz = 0\n(3.7)\n∂x\n∂y\nWhich simplifies to,\n∂u ∂v\n+\n= 0\n(3.8)\n∂x ∂y\nIn three dimensions, the derivation is the same, and we have:\n∂u ∂v ∂w\n+\n+\n= 0\n(3.9)\n∂x ∂y\n∂z\n∂\n∂\nor in vector notation, recalling the gradient operator: ∇= ( ∂, ∂y , ∂z ) , we have\n∂x\nG\n∇⋅V = 0\n(3.10)\nversion 3.0\nupdated 8/30/2005\n-5-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\n2. Conservation of Momentum:\nNewton's second law is simply the law of conservation of momentum.\nIt states that the time rate of change of momentum of a system of particles is equal to the\nsum of external forces acting on that body.\nd\nΣ\n=\n{MV}\n(3.11)\nFi\ndt\nwhere M = ρ x z is the mass of the fluid parcel (in two dimensions, ie mass per unit\nδ δ\nlength) and MV is the linear momentum of the system (V is the velocity vector). Since\nthe fluid density is constant, the time-rate of change of linear momentum can be written\nas\nd\nx\n{MV} = ρδ δ z dV .\n(3.12)\ndt\ndt\nThe rate of change of velocity of the fluid parcel can be found, for small δt , as\ndV = lim\n\n1 {V (x +δ x\nz\n\n+δ z ,\n\n+δt p ) -V(x\nz\nt\n\n)}\n(3.13)\ndt\nδt →0 δt\np ,\np t\n,\n\n,\n\nδ\nδ\nWe can substitute, δ xp = u t , and, δ zp = w\n\nt\n\n, into equation (3.13) and cancel terms to\narrive at a more familiar form of the momentum equation.\nThe total derivative of the velocity is written as:\nDV = ∂V + ∂V u + ∂V w\n(3.14)\nDt\n∂t\n∂x\n∂z\nwhich can be simplified using the vector identity,\nV ⋅∇= u ∂\n∂\nx + v ∂\n∂\ny + w ∂\n(3.15)\n∂z\nversion 3.0\nupdated 8/30/2005\n-6-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\nThe total (material) derivative of the velocity is the sum of the conventional\n∂\nacceleration, V , and the advection term, (V ⋅∇)V :\n∂t\nDV\n∂V\n=\n+ (V ⋅∇)V.\n(3.16)\nDt\n∂t\nFinally, the momentum equation, from equation (3.11), can be rewritten in two\ndimensions as\nDV\nΣ\n= ρ\nδ δ z .\n(3.17)\nFi\nx\nDt\n3. Forces\nThe LHS of equation (3.17) is the sum of the forces acting on the control volume.\nContributions from gravity and pressure both play a role in this term as well as any\napplied external forces. These forces are found as follows:\n1. Force on a fluid volume due to gravity:\n) ˆ\nF = -(ρ δ δ\ng x z k\n(3.18)\ng\n2. Pressure Forces due: Force due to pressure is simply pressure times the surface area it\nacts on\n⋅\nFP = P\n\nA\n\n.\n(3.19)\nThe pressure force in x-direction is\n⎛\n⎞\nx\nFPx = ⎛ p + 1 ∂p δ z ⎟\n⎞δ z -⎜p + 1 ∂p δ z + ∂p δ\n\nδ\n\nz = -∂p δ δ\n\nz\n(3.20)\n⎜⎝\n2 ∂z\n⎠\n⎝\n2 ∂z\n∂x\nx ⎟⎠\n∂x\nand the pressure force in z-direction is\nFPz = -∂p δ xδ z .\n(3.21)\n∂z\nversion 3.0\nupdated 8/30/2005\n-7-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\nThus the total pressure force in two dimensions is\n∂\n,\nx\nFP = -(∂p\np)δ xδ z = -∇ pδ δ\n\nz.\n(3.22)\nx\nz\n∂\n∂\n4. Euler Equation\nSubstituting relations (3.18) and (3.22) for the gravity and pressure forces acting on the\nbody, into the momentum equation (3.17) we arrive at\n⎫ x\ng x z k -∇\n\npδ δ\nρ ⎧⎨\n∂V + (V ⋅∇\n\n)V⎬δ δ z = (-ρ δ δ ) ˆ\nx z\n(3.23)\n⎩∂t\n⎭\nfor any δ x,δ z . The final result is the Euler equation in vector form:\n⎫\nρ ⎧⎨\n∂V + (V ⋅∇)V⎬= -ρgkˆ -∇ .\n(3.24)\n⎩∂t\n⎭\np\nWe can further manipulate this equation with the vector identity\n(V ⋅∇)V = 1 ∇(V\n\nV\n\n) ,\n(3.25)\n⋅\nsuch that the Euler equation becomes\n⎫\nρ ⎨⎧∂V + 1 ∇(V V)⎬= -ρgkˆ -∇\n\n.\n\n(3.26)\n⋅\n⎩∂t\n⎭\np\nversion 3.0\nupdated 8/30/2005\n-8-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\n5. Bernoulli's Equation:\nApplication of Newton's Second Law along a streamline:\np +\nρV1 + ρgz\n\n= p +\nρV2 + ρgz\n\n= C\n(3.27)\nAssuming the following conditions:\n1) Points 1 and 2 are on the same streamline!\n2) Fluid density is constant\ndV\n3) Flow is steady:\n= 0 (no time dependence or turbulence)\ndt\n4) Fluid is \"inviscid\" or can be approximated as inviscid. No frictional\neffects\n5) No Work Added!\nWe can derive this through a Lagrangian derivation:\nLooking at a small elemental volume along a streamline d∀= dn\n\nds\n\ndx\n\n(dx is the depth\ninto the paper).\nFluid weight in the (-z) direction.:\ng dn ds dx\nρ\n(3.28)\nComponent of weight acting in the s-direction:\ng sin\ndn\n\nds\n\ndx\n\nρ\nβ\n-\n\n(3.29)\nWhere sin\ndz\nds\nβ =\nso that the weight in the s-direction is:\nversion 3.0\nupdated 8/30/2005\n-9-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\ndz\n-ρg\ndn\n\nds\n\ndx\n\n.\n(3.30)\nds\nThe force due to pressure in the s-direction is found similarly:\nFs = ⎜\n⎛ p -∂ p ⎞\n⎛\n∂ p\n\nds\n\n⎞\n⎛\n∂ p\n⎝\n∂ s ⎠⎟ dn dx -\n⎝⎜ p + ∂ s 2 ⎠⎟ dn dx =\n⎝⎜- ∂ s -ρ g ∂\n∂\nz\ns ⎠⎟\n⎞ dn ds dx\n(3.31)\nThe force accelerates the fluid along the streamline such that the rate of change in\nmomentum, per unit volume, is\n⎛\n∂ V\n⎞\nρ ⎜\n⎜ V + ∂ s ds\n\n- V ⎟\n∂ V\n⎟= ρ V\n(3.32)\n⎜\ndt\n⎟\n∂ s\n⎝\n⎠\n∂ s\nwhere V =\n.\n∂ t\nSo Euler's equation in one dimension along a streamline becomes:\n∂ V\nρ V\n+ ∂ p + ρ g ∂ z = 0 .\n(3.33)\n∂ s\n∂ s\n∂ s\nChange in Pressure along a streamline: dp = ∂ p ds\n∂ s\n∂ V\nChange in Velocity along a streamline: dV =\nds\n∂ s\n∂ z\nChange in height along a streamline: dz =\nds\n∂ s\nMultiplying equation 23 through by ds gives us\nρ V dV + dp + ρ g dz = 0\n(3.34)\ndp + V dV + g dz = 0\n(3.35)\nρ\nIf density is constant along the streamline then we can integrate along the streamline to\nget:\nversion 3.0\nupdated 8/30/2005\n-10-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #3\np + 12 V 2 + g\n\nz\n\n= C\nρ\nAlong a streamline Bernoulli's equation relates pressure, height and velocity at two\npoints:\np1\n+ 12 V1\n2 + g\n\nz\n\n= p + 12 V2\n2 + g\n\nz\n\n= C\n(3.36)\nρ\nρ\nThis equation also assumes that NO additional heat or work is added to the system along\nthe streamline.\n6. Irrotational flow\nAn irrotational flow is defined as a flow for which each and every fluid particle is not\nrotating. Mathematically speaking, the curl of the velocity is identically zero.\nˆi\nˆj\nˆk\nx\nω\n∂\n= ∇ × = ∂\nV\ny\n∂\n∂\nz\n∂ =\n∂\n\n(3.37)\nu\nv\nw\n∂ v\n∂ w\n∂ u\nω = iˆ( ∂ w -\n) + ˆj( ∂ u -\n) + kˆ( ∂ v -\n) = 0.\n(3.38)\n∂ y\n∂ z\n∂ z\n∂ x\n∂ x\n∂y\nFor 2D flow this reduces to ∂ u = ∂ w .\n∂ z\n∂ x\nversion 3.0\nupdated 8/30/2005\n-11-\n(c) 2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "2005reading4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/c472432debcf6ee250209b68cf18cc12_2005reading4.pdf",
      "content": "2.016 Hydrodynamics\nReading #4\n2.016 Hydrodynamics\nProf. A.H. Techet\nPotential Flow Theory\n\"When a flow is both frictionless and irrotational, pleasant things happen.\" -F.M.\nWhite, Fluid Mechanics 4th ed.\nWe can treat external flows around bodies as invicid (i.e. frictionless) and irrotational\n(i.e. the fluid particles are not rotating). This is because the viscous effects are limited to\na thin layer next to the body called the boundary layer. In graduate classes like 2.25,\nyou'll learn how to solve for the invicid flow and then correct this within the boundary\nlayer by considering viscosity. For now, let's just learn how to solve for the invicid flow.\nWe can define a potential function, , , , as a continuous function that satisfies the\n(x z t )\nbasic laws of fluid mechanics: conservation of mass and momentum, assuming\nincompressible, inviscid and irrotational flow.\nThere is a vector identity (prove it for yourself!) that states for any scalar, ,\n= 0\nBy definition, for irrotational flow,\nr\nV = 0\nTherefore\nr\nV =\nwhere\n( , , ) is the velocity potential function. Such that the components of\n=\nx y, z t\nvelocity in Cartesian coordinates, as functions of space and time, are\n\nu\ndx\n=\n, v\ndy\n=\nand w = dz\n(4.1)\nversion 1.0\nupdated 9/22/2005\n-1-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nLaplace Equation\nThe velocity must still satisfy the conservation of mass equation. We can substitute in\nthe relationship between potential and velocity and arrive at the Laplace Equation, which\nwe will revisit in our discussion on linear waves.\nu + v + w = 0\n(4.2)\nx\ny\nz\n\n+\n+\n= 0\n(4.3)\nx\ny\nz\nLaplaceEquation 2 = 0\nFor your reference given below is the Laplace equation in different coordinate systems:\nCartesian, cylindrical and spherical.\nCartesian Coordinates (x, y, z)\nr\n\nˆ\n\nV = uiˆ+ vjˆ+ wkˆ =\niˆ+\nj +\nkˆ =\nx\ny\nz\n\n=\n+\n+\n= 0\nx\ny\nz\nCylindrical Coordinates (r, , z)\nr 2 = x 2 + y 2 , = tan\ny\n1 ( )\nx\nr\n\nV = u eˆ +u eˆ +u eˆ = eˆ + 1 eˆ +\neˆ =\nr\nr\n\nz\nz\nr\n\nz\nr\nr\nz\n1 2\n=\n+\n+\n+\n= 0\nr\nr r\nr\nz\n1 243\nr\n\nr r r\n\nversion 1.0\nupdated 9/22/2005\n-2-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nversion 1.0\nupdated 9/22/2005\n-3-\n2005 A. Techet\nSpherical Coordinates (r, , )\nr\nx\ny\nz\n=\n+\n+\n,\n( )\ncos\nx r\n\n=\n, or\ncos\nx\nr\n\n=\n,\n( )\ntan\nz y\n\n=\nr\nV = ur ˆer +u ˆe +u ˆe =\nr\nˆer + 1\nr\n\nˆe +\nrsin\n\nˆe =\n2 = 2\nr2 + 2\nr\n\nr\nr 2\n\nr r 2\nr\n\n1 2\n+\nr2 sin\n\nsin\n\n+\nr2 sin2\n2 = 0\nPotential Lines\nLines of constant are called potential lines of the flow. In two dimensions\nd =\nx dx +\ny dy\nd = udx + vdy\nSince d = 0 along a potential line, we have\ndy\ndx = u\nv\n(4.4)\nRecall that streamlines are lines everywhere tangent to the velocity, dy\ndx = v\nu , so potential\nlines are perpendicular to the streamlines. For inviscid and irrotational flow is indeed\nquite pleasant to use potential function, , to represent the velocity field, as it reduced\nthe problem from having three unknowns (u, v, w) to only one unknown ( ).\nAs a point to note here, many texts use stream function instead of potential function as it\nis slightly more intuitive to consider a line that is everywhere tangent to the velocity.\nStreamline function is represented by . Lines of constant are perpendicular to lines\nof constant , except at a stagnation point.\n\n2.016 Hydrodynamics\nReading #4\nLuckily and are related mathematically through the velocity components:\n\nu =\n=\n(4.5)\nx\ny\n\nv =\n=\n(4.6)\ny\nx\nEquations (4.5) and (4.6) are known as the Cauchy-Riemann equations which appear in\ncomplex variable math (such as 18.075).\nBernoulli Equation\nThe Bernoulli equation is the most widely used equation in fluid mechanics, and assumes\nfrictionless flow with no work or heat transfer. However, flow may or may not be\nirrotational. When flow is irrotational it reduces nicely using the potential function in\nplace of the velocity vector. The potential function can be substituted into equation 3.32\nresulting in the unsteady Bernoulli Equation.\n{\n(\n)2}\n\n+ 1\n+ p + gz = 0\n(4.7)\nt\nor\n\np\n\n+\nV +\n+ gz\n}= 0 .\n(4.8)\n{ t\n\np\n( )\n(4.9)\nUnsteadyBernoulli\n+\nV +\n+ gz = c t\nt\nversion 1.0\nupdated 9/22/2005\n-4-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nSummary\nPotential\nStream Function\nDefinition\n\n=\nV\n=\n\nV\nv\nContinuity\n(\n0)\nV =\n=\nAutomatically Satisfied\nIrrotationality\n(\n0)\nV =\nAutomatically Satisfied\n(\n)\n(\n)\n\n=\nv\nv\nv = 0\nIn 2D :\n0,\nw\nz\n\n=\n=\n\n=\nfor continuity\nz\n\n=\nv\nfor\nirrotationality\nCauchy-Riemann Equations for and from complex analysis:\ni\n\n=\n+\n, where is real part and is the imaginary part\nCartesian (x, y)\nu\nx\n\n=\nv\ny\n\n=\nu\ny\n\n=\nv\nx\n\n=\nPolar (r, )\nu\nr\n\n=\nv\nr\n\n=\nu\nr\n\n=\n\nv\nr\n\n=\nFor irrotational flow use:\nFor incompressible flow use:\nFor incompressible and irrotational flow use: and\nversion 1.0\nupdated 9/22/2005\n-5-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nPotential flows\nPotential functions (and stream functions, ) can be defined for various simple flows.\nThese potential functions can also be superimposed with other potential functions to\ncreate more complex flows.\nUniform, Free Stream Flow (1D)\nr\nV =Uiˆ+ 0 ˆj + 0kˆ\n(4.10)\n\nu\nU\n=\n=\n=\n(4.11)\nx\n\ny\n\nv =\n=\n=\n(4.12)\ny\n\nx\n\nWe can integrate these expressions, ignoring the constant of integration which ultimately\ndoes not affect the velocity field, resulting in and\n=Ux\nand\n=Uy\n(4.13)\nTherefore we see that streamlines are horizontal straight lines for all values of y (tangent\neverywhere to the velocity!) and that equipotential lines are vertical straight lines\nperpendicular to the streamlines (and the velocity!) as anticipated.\nU V\n-\n2D Uniform Flow: V = ( , ,\n0) ; =Ux +Vy ; =Uy Vx\n-\n3D Uniform Flow: V = ( , ,\nVy\nU V W ) ; =Ux +\n+\n\nWz ; no stream function in 3D\nversion 1.0\nupdated 9/22/2005\n-6-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nLine Source or Sink\nConsider the z-axis (into the page) as a porous hose with fluid radiating outwards or\nbeing drawn in through the pores. Fluid is flowing at a rate Q (positive or outwards for a\nsource, negative or inwards for a sink) for the entire length of hose, b. For simplicity take\na unit length into the page (b = 1) essentially considering this as 2D flow.\nPolar coordinates come in quite handy here. The source is located at the origin of the\ncoordinate system. From the sketch above you can see that there is no circumferential\nvelocity, but only radial velocity. Thus the velocity vector is\nr\nV = u eˆ + u eˆ + u eˆ = u eˆ + 0eˆ + 0eˆ\n(4.14)\nr\nr\n\nz\nz\nr\nr\n\nz\nQ\nm\n\nu =\n=\n=\n=\n(4.15)\nr\n2r\nr\nr\nr\nand\n\nu = 0 =\n=\n(4.16)\n\nr\nr\nIntegrating the velocity we can solve for and\nln\n= m\nr\nand = m\n(4.17)\nQ\nwhere m =\n. Note that satisfies the Laplace equation except at the origin:\nr = x + y = 0 , so we consider the origin a singularity (mathematically speaking) and\nexclude it from the flow.\n- The net outward volume flux can be found by integrating in a closed contour\naround the origin of the source (sink):\nˆ\nV n dS = V dS = u r d = Q\nr\no\nC\nS\nversion 1.0\nupdated 9/22/2005\n-7-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nIrrotational Vortex (Free Vortex)\nA free or potential vortex is a flow with circular paths around a central point such that the\nvelocity distribution still satisfies the irrotational condition (i.e. the fluid particles do not\nthemselves rotate but instead simply move on a circular path). See figure 2.\nFigure 2: Potential vortex with flow in circular patterns around the center.\nHere there is no radial velocity and the individual particles do not rotate\nabout their own centers.\nIt is easier to consider a cylindrical coordinate system than a Cartesian coordinate system\nwith velocity vector V = (\n,\n\n, u ) when discussing point vortices in a local reference\nu u\nr\nz\nframe. For a 2D vortex, uz = 0 . Referring to figure 2, it is clear that there is also no\nradial velocity. Thus,\nr\nV = u eˆ + u eˆ + u eˆ = 0eˆ + u eˆ + 0eˆ\n(4.18)\nr\nr\n\nz\nz\nr\n\nz\nwhere\n\nu = 0 =\n=\n(4.19)\nr\nr\nr\nand\n\nu = ? =\n=\n.\n(4.20)\n\nr\nr\nLet us derive u . Since the flow is considered irrotational, all components of the\n\nvorticity vector must be zero. The vorticity in cylindrical coordinates is\nV =\n1 uz u\ne r +\nur u\n\ne\n1 ru\n\n1 u\nz\n\ne z = 0 ,\n(4.21)\n+\nr\n\nr\nz\n\nz\nr\n\nr r\nr\nwhere\nversion 1.0\nupdated 9/22/2005\n-8-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nu = u + u ,\n(4.22)\nr\nx\ny\nu = u cos ,\n(4.23)\n\nx\nand\nu = 0 (for 2D flow).\nz\nSince the vortex is 2D, the z-component of velocity and all derivatives with respect to z\nare zero. Thus to satisfy irrotationality for a 2D potential vortex we are only left with the\nz-component of vorticity ( e z )\nru\nu\n\nr = 0\n(4.24)\nr\n\nSince the vortex is axially symmetric all derivatives with respect must be zero. Thus,\n(ru ) u\n\nr\n=\n= 0\n(4.25)\nr\n\nFrom this equation it follows that ru must be a constant and the velocity distribution for\na potential vortex is\nK\nu =\n,\nr\nu\n= ,\nz\nu\n=\n(4.26)\nr\n\nBy convention we set the constant equal to\n, where is the circulation,. Therefore\n\nu =\n(4.27)\n\n2r\nU\nr\nFigure 3: Plot of velocity as a function of radius from the vortex center.\nAt the core of the potential vortex the velocity blows up to infinity and is\nthus considered a singularity.\nversion 1.0\nupdated 9/22/2005\n-9-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nYou will notice (see figure 3) that the velocity at the center of the vortex goes to infinity\n(as r 0 ) indicating that the potential vortex core represents a singularity point. This is\nnot true in a real, or viscous, fluid. Viscosity prevents the fluid velocity from becoming\ninfinite at the vortex core and causes the core rotate as a solid body. The flow in this core\nregion is no longer considered irrotational. Outside of the viscous core potential flow can\nbe considered acceptable.\nIntegrating the velocity we can solve for and\nln\n= K and = K\nr\n\n(4.28)\nwhere K is the strength of the vortex. By convention we consider a vortex in terms of its\ncirculation, , where = 2 K is positive in the clockwise direction and represents the\nstrength of the vortex, such that\n\n=\nand\nln\nr\n\n=\n.\n(4.29)\nNote that, using the potential or stream function, we can confirm that the velocity field\nresulting from these functions has no radial component and only a circumferential\nvelocity component.\nThe circulation can be found mathematically as the line integral of the tangential\ncomponent of velocity taken about a closed curve, C, in the flow field. The equation for\ncirculation is expressed as\n= C V\ns\nd\nwhere the integral is taken in a counterclockwise direction about the contour, C, and\nds is a differential length along the contour. No singularities can lie directly on the\ncontour. The origin (center) of the potential vortex is considered as a singularity point in\nthe flow since the velocity goes to infinity at this point. If the contour encircles the\npotential vortex origin, the circulation will be non-zero. If the contour does not encircle\nany singularities, however, the circulation will be zero.\nversion 1.0\nupdated 9/22/2005\n-10-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nTo determine the velocity at some point P away from a point vortex (figure 4), we need\nto first know the velocity field due to the individual vortex, in the reference frame of the\nvortex. Equation Error! Reference source not found. can be used to determine the\ntangential velocity at some distance ro from the vortex. It was given up front that ur = 0\neverywhere.\nSince the velocity at some distance ro from the body is constant on a circle, centered on\nthe vortex origin, the angle\nis not crucial for determining the magnitude of the\no\ntangential velocity. It is necessary, however, to know o in order to resolve the direction\nof the velocity vector at point P. The velocity vector can then be transformed into\nCartesian coordinates at point P using equations (4.22) and (4.23).\nFigure 4: Velocity vector at point P due to a potential vortex, with strength\n, located some distance ro away.\nversion 1.0\nupdated 9/22/2005\n-11-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nLinear Superposition\nAll three of the simple potential functions, presented above, satisfy the Laplace equation.\nSince Laplace equation is a linear equation we are able to superimpose two potential\nfunctions together to describe a complex flow field. Laplace's equation is\n\n=\n+\n+\n= 0 .\n(4.30)\nx\ny\nz\nLet\n\n=\n+\nwhere 2 = 0 and = 0 . Laplace's equation for the total potential is\n(\n)+ (\n)\n(\n)\n+\n+\n+\n=\n+\n.\n(4.31)\nx\ny\nz\n\n1 +\n2 +\n1 +\n(4.32)\n2 =\n1 +\n2 +\n\nx\nx\ny\ny\nz\nz\n\n2 =\n1 +\n+\n2 +\n2 +\n(4.33)\n2 +\n\nx\ny\nz\nx\ny\nz\n\n= 0\n(4.34)\n\n= 2 + =\n+\nTherefore the combined potential also satisfies continuity (Laplace's Equation)!\nExample: Combined source and sink\nTake a source, strength +m, located at (x,y) = (-a,0) and a sink, strength -m, located at\n(x,y) = (+a,0).\n\n+\n= 1 m ln ((x + a)\n2 + y 2 ) ln ((x a)\n2 + y 2 )\n(4.35)\n= source\nsink\n\nThis is presented in cartesian coordinates for simplicity. Recall r 2 = x + y 2 so that\n1 2\nm\nr\nm\n\nln (x + y ) = 1 m ln (x + y )\n(4.36)\nln =\n\n(x\na)\n2 + y\n+\n= m ln\n(4.37)\n(x\na)\n2 + y\n\nThis is analogous to the electro-potential patterns of a magnet with poles at (±a,0).\nversion 1.0\nupdated 9/22/2005\n-12-\n2005 A. Techet\n\n2.016 Hydrodynamics\nReading #4\nExample: Multiple Point Vortices\nSince we are able to represent a vortex with a simple potential velocity function, we can\nreadily investigate the effect of multiple vortices in close proximity to each other. This\ncan be done simply by a linear superposition of potential functions. Take for example two\nvortices, with circulation 1 and , placed at ±a along the x-axis (see figure 5). The\nvelocity at point P can be found as the vector sum of the two velocity components V1 and\nV2, corresponding to the velocity generated independently at point P by vortex 1 and\nvortex 2, respectively.\nFigure 5: Formulation of the combined velocity field from two vortices in\nclose proximity to each other. Vortex 1 is located at point (x, y) = (-a, 0)\nand vortex 2 at point (x, y) = (+a, 0).\nThe total velocity potential function is simply a sum of the potentials for the two\nindividual vortices\n\n+ =\n1 +\n=\n+\n=\nT\nv1\nv2\nwith and taken as shown in figure 5. One vortex in close proximity to another vortex\ntends to induce a velocity on its neighbor, causing the free vortex to move.\nversion 1.0\nupdated 9/22/2005\n-13-\n2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "2005reading5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/7b7f30b7b534f4613d671fd7eb1052cc_2005reading5.pdf",
      "content": "2.016 Hydrodynamics\nReading #5\n2.016 Hydrodynamics\nProf. A.H. Techet\nFluid Forces on Bodies\n1. Steady Flow\nIn order to design offshore structures, surface vessels and underwater vehicles, an\nunderstanding of the basic fluid forces acting on a body is needed. In the case of steady\nviscous flow, these forces are straightforward. Lift force, perpendicular to the velocity, and\nDrag force, inline with the flow, can be calculated based on the fluid velocity, U , force\ncoefficients, CD and C , the object's dimensions or area, A , and fluid density, ρ . For\nL\nviscous flows the drag and lift on a body are defined as follows\nFDrag =\nρU\n\nA\n\nCD\n(5.1)\nFLift =\nρU\n\nA\n\nCL\n(5.2)\nThese equations can also be used in a quiescent (stationary) fluid for a steady translating\nbody, where U is the body velocity instead of the fluid velocity, since U is still the\nrelative velocity of the fluid with respect to the body.\nThe drag force arises due to viscous rubbing of the fluid. The fluid may be thought of as\ncomprised of several \"layers\" which move relative to one another. The layer at the surface\nof the body \"sticks\" to the surface due to the no-slip condition. The next layer of fluid\naway from the surface rubs against the layer below, and this rubbing requires a certain\namount of force because of viscosity. One would expect that in the absence of viscosity,\nthe force would go to zero.\nJean Le Rond d'Alembert (1717-1783) performed a series of experiments to measure the\ndrag on a sphere in a flowing fluid, and on the basis of the potential flow analysis he\nexpected that the force would approach zero as the viscosity of the fluid approached zero.\nHowever, this was not the case. The net force seemed to converge on a non-zero value as\nthe viscosity approached zero. Hence, the vanishing of the net force in the potential flow\nanalysis is known as d'Alembert's Paradox.\nversion 3.0\nupdated 8/30/2005\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nD'Allembert's Paradox for a fixed sphere in uniform inflow: Force on a sphere (radius\na) in an unbounded STEADY moving fluid with velocity U is explored in the following\nf\ndiscussion.\nUf\nz\nr\nx\nθ\nThe corresponding 3D potential function for a sphere in uniform inflow is simply:\na3 ⎞\nφ (r,θ ) =U ⎜\n⎛ r + 2r 2 ⎠⎟cos\n\nθ\n(5.3)\nf ⎝\nThe hydrodynamic force on the body due to the unsteady motion of the sphere is given as a\nsurface integral of pressure around the body. Pressure formulation comes from the\nunsteady form of Bernoulli. Force in the x-direction is\n⎞\n⎛\n2 ⎟\nF = -ρ\n⎜\n⎜∂φ + | ∇φ | ⎟n\n\ndS\n(5.4)\nx\nx\n∫∫⎜⎝ ∂t\n⎠⎟\nB\nHere, the time derivative of the potential is zero since the flow is steady and velocity is not\na function of time. Since we want the force acting on the body we need the velocity\ncomponents on the sphere surface ( r\na ). In spherical coordinates the velocity is found\n=\nby taking the gradient of the potential function as follows:\nK\n⎛∂φ 1 ∂φ\n∂φ ⎞\n⎛\n⎞\nV = ∇φ = ⎜V\n\nV\n\n,Vφ ⎠⎟= ⎜⎝∂r r ∂θ , r sinθ\nφ ⎠\n(5.5)\n,\n⎝ r ,\nθ\n∂\n⎟\nThe velocity at the body, on r = a, can only be tangential to the body due to the kinematic\nboundary condition ( KBC ⇒ V = 0\n):\nr\nr a\n=\nK\nV = ∇φ\n= (0, -2 U f sin θ, 0 )\n(5.6)\nr a\n=\nversion 3.0\nupdated 8/30/2005\n-2-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nThe magnitude of the velocity is simply:\n∇φ = 9 U 2 sin θ\n(5.7)\nUsing (5.7) in the formulation for Fx, from equation (5.4), we get the horizontal force on\nthe body:\nF = -ρ)(2πa )\nπ -cos\n\nθ sin\n\nθ ⎣⎡8 U f sin\n\nθ\n\nθ\n\n(5.8)\nx\n(\n∫0\n2 ⎤⎦d\nπ\nd\nF = 9 ρπa U f\nsin θ cos θ θ\n\n(5.9)\nx\n∫0\nThis integral can be integrated by parts or substitution of variables:\np = sinθ ; dp = cosθ dθ\n(5.10)\nd\n∫sin θ cos θ θ = ∫p\n\ndp\n\n= p = sin θ\n(5.11)\n2 ⎡sin4 θ\n⎥\n⎤\nπ\n= 0\n∴Fx = 4 ρπa\n\nU f ⎢\n(5.12)\n⎣ 4 ⎦0\nTHERE IS NO FORCE ON A BODY IN A STEADY FLOW IN THE ABSENCE OF\nVISCOSITY! THIS IS D'ALLEMBERT'S PARADOX.\nThe resolution becomes clear when we realize that any non-zero viscosity, no matter how\nsmall, will result in a boundary layer and the tangential flow velocity vanishing at the\nsurface of the sphere. As we lower the viscosity, the thickness of the boundary layer is\nreduced, but the flow velocity still drops to zero across that layer (the \"no-slip\" condition).\nThe results of this boundary layer lead to losses in the momentum of the flowing fluid and\nthe transference of momentum to the sphere, i.e., to a net unbalanced force.\nversion 3.0\nupdated 8/30/2005\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\n2. Unsteady Motion and Added Mass.\nDo this at home:\nA) Wave your hand in the air. Feel the force it takes to accelerate your hand. F=ma.\nB) Fill your bathtub with water. Run your hand through (with the palm facing forward)\nat a slow, constant speed. Feel the drag on your hand. Notice that the water must\nmove to flow around your hand.\nB1.5) Run your hand through at another constant, faster speed. Notice that it takes\nmore force. Recall the drag force is proportional to U^2. Notice that the water\nnow moves at some constant, faster speed around your hand.\nC) Try and accelerate your hand from the slow speed to the fast speed. It's hard, huh?!\nNotice that the water flowing past your hand has to accelerate as your hand\naccelerates. Since some mass of water must accelerate, your hand feels heavier.\nWe capture this idea with the concept of added mass.\nBeyond steady flow, especially in the presence of free surface waves, we must consider\nunsteady, time dependent motions of both the fluid and the body and the fluid inertial\nforces arise, adding to the total forcing on a body.\n(\nTake the case of an unsteady moving body, U t) , in an unbounded inviscid, irrotational\nb\nfluid ( μ = 0 ) with zero velocity, U = 0 . The time-dependent force on the body is directly\nf\nproportional to the body acceleration:\nt\nF t( ) = -m dUb ( )\n(5.13)\na\ndt\nwhere m , is the system added mass, depends on the body geometry and direction of\na\nmotion. This is an added inertial force or added mass force on the body. By comparison, in\nan inviscid steady flow, by D'Alembert's Paradox, the force on the body would be zero.\nversion 3.0\nupdated 8/30/2005\n-4-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nUnsteady Moving Body Stationary Fluid: Force on a sphere (radius a) accelerating in an\nunbounded quiescent (non-moving) fluid. U\nU\n\nt\n\n=\n( ) is the unsteady body velocity.\nU(t)\nz\nr\nx\nθ\nThe Kinematic Boundary Condition on the sphere, guaranteeing no fluid flow through the\nbody surface, is\n∂φ\n( ) cos θ.\n(5.14)\n= U t\n∂r r\na\n=\nThe potential function for a moving sphere with no free stream (still fluid) is simply\n( ) a cos θ .\n(5.15)\nφ = -U t 2r 2\nYou can double check this solution for the velocity potential by substituting φ into the\nKinematic Boundary Condtion (eq. (5.14)) to make sure this potential works at the\nboundary of the sphere.\nThe hydrodynamic force on the body due to the unsteady motion of the sphere is given as a\nsurface integral of pressure around the body. Pressure formulation comes from the\nunsteady form of Bernoulli. Force in the x-direction is\n⎞\n⎛\n2 ⎟\nF = -ρ\n⎜\n⎜∂φ + | ∇φ | ⎟ n\n\ndS\n(5.16)\nx\nx\n∫∫⎜⎝ ∂t\n⎠⎟\nB\nSince we want the force acting on the body we need the velocity components on the sphere\nsurface ( r\na ).\n=\nIn spherical coordinates the velocity is found by taking the gradient of the potential\nversion 3.0\nupdated 8/30/2005\n-5-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nfunction as follows:\nK\n⎛∂φ 1 ∂φ\n∂φ ⎞\n⎛\n⎞\nV = ∇φ = ⎜V\n\nV\n\n,Vφ ⎠⎟= ⎜⎝∂r r ∂θ , r sinθ\nφ ⎠\n(5.17)\n,\n⎝ r ,\nθ\n∂\n⎟\n( ) for a moving sphere is\nsuch that the gradient of φ t\n∇φ r a =\n⎝⎜\n⎛U t\n(\n( ) cos θ, U t)sin θ,0 ⎟\n⎞ .\n(5.18)\n=\n⎠\nTo evaluate the pressure around the sphere we need the magnitude of the velocity ∇φ\n2 on\nthe surface (r = a):\n(\n\n∇φ )\n=U 2 cos θ + 1 U 2 sin θ; n = -\n\n;\n\nnx = -cosθ\n(5.19)\neˆr\nr a\n=\nNext, the time derivative of the velocity potential, evaluated at the sphere surface, is\n1 ( )a cos θ\n(5.20)\n= -U t\n∂φ\n( ) a cos θ\n= - U t\nr a\n=\n∂t\n2r 2\nr a\n=\nand the surface integral can be re-written in spherical coordinates as\nπ\ndS = ∫0 (a d θ)(2πa sin\n\nθ)\n(5.21)\n∫∫\nb\nSubstituting (5.19), (5.20), and (5.21) into (5.16) we can solve for Fx, the added mass force\non a spherical body moving with an unsteady acceleration:\n⎛\n⎞\n⎟\n⎜\n( ) ⎜ ρ\nπ a\n3 ⎟\n(5.22)\nF = -U\n\nt\n\nx\n⎜\n⎟\n\n⎜\n⎟\n⎝unit =Mass ⎠\nThe volume of a sphere is ∀=\n3 πa thus equation (5.22) is simply\ns\n( ) (\nF = -U\n\nt\n\n2 ρ∀s )\n(5.23)\nx\nversion 3.0\nupdated 8/30/2005\n-6-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nwhere m = 2 ρ∀ is the added mass in the system.\na\ns\nUnsteady Moving Fluid Stationary Body: Force on a sphere (radius a) in an unbounded\nunsteady moving fluid. U =U f (t) is the unsteady fluid velocity.\nf\nx\nθ\nz\nUf(t)\nr\nThe corresponding potential function is simply:\na3 ⎞\nφ (r, ,\nt ) =U (t )⎜\n⎛ r + 2r 2 ⎠⎟cos\nθ\n(5.24)\nθ\nf\n⎝\nThe velocity, at the body on r=a, can only be tangential to the body due to the kinematic\nboundary condition ( KBC ⇒ V = 0\n) :\nr\nr a\n=\nK\nV = ∇φ\n= (0, -2 U f sin θ, 0 )\n(5.25)\nr a\n=\nThe time derivative of the potential is\n\n∂φ\n=U f\n3a cos θ\n(5.26)\n∂t\nr a\n=\nThe magnitude of the velocity is simply:\n∇ φ = 9 U 2 sin θ\n(5.27)\nAgain, using (5.26), (5.27), (5.21) in the formulation for Fx, from equation (5.16), we get\nversion 3.0\nupdated 8/30/2005\n-7-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nthe horizontal force on the body:\nF = -ρ)(2πa )∫0\nπ -cos θ sinθ ⎣⎡U\nf\na cos θ + 8 U sin θ\n\nθ\n\n(5.28)\nx\n(\nf\n2 ⎤⎦d\nd\nπ\nF = 3ρπa U f\nπ cos2 θ sin\n\nθ θ + 4 ρπa U\nsin\n\nθ cos\n\nθ θ\n\n(5.29)\nd\nx\nf\n∫0\n∫0\nBy parts the right most term in the integral in (5.29) reduces to zero, and the integral from\nleft term is simply:\nπ cos2 θ sin θ θ =\n(5.30)\nd\n∫0\nso we are left with a force:\nF = 3ρπa U f ⋅\n2 = 2ρπa U f\n(5.31)\nx\nThis can be rewritten in terms of the sphere volume, ∀= 3 πa , and added mass,\ns\nm = 1 ρ∀ , from (5.23) as follows\na\ns\n\nF =U f (ρ∀+\n\nma )\n(5.32)\nx\nThe non-added mass term of equation (5.32) is due to the pressure gradient necessary to\naccelerate the fluid around the sphere. This is like a buoyancy effect.\nUnsteady Moving Fluid; Unsteady Moving Body: Force on a moving sphere (radius a)\nversion 3.0\nupdated 8/30/2005\n-8-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #5\nin an unbounded moving fluid. U =U f (t) is the unsteady fluid velocity and U =Ub (t) is\nf\nb\nthe body velocity.\nUf(t)\nUb(t)\nz\nr\nx\nθ\nThe case of the unsteady moving body and fluid can be determined by combining the\nresults from the previous two cases.\n\nF = -Ub ( 2 ρ∀s )\nF =U f (ρ∀+\n\nma )\nx\nx\nMoving Body\n\nMoving Fluid\nStill Fluid\n\nStill Body\nMoving Body, Moving Fluid:\n\nF = -Ub (m ) +U (ρ∀+ m ) =U ρ∀+ m (U -Ub )\n(5.33)\nx\na\nf\na\nf\na\nf\nSo now, all we have to do is find the added mass!\nversion 3.0\nupdated 8/30/2005\n-9-\n(c)2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "2005reading6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/6124a1fd14e811d9ea753f85e0dfc8d0_2005reading6.pdf",
      "content": "2.016 Hydrodynamics\nReading #6\n2.016 Hydrodynamics\nProf. A.H. Techet\nAdded Mass\nFor the case of unsteady motion of bodies underwater or unsteady flow around objects, we\nmust consider the additional effect (force) resulting from the fluid acting on the structure\nwhen formulating the system equation of motion. This added effect is added mass. Most\nfloating structures can be modeled, for small motions and linear behavior, by a system\nequation with the basic form similar to a typical mass-spring-dashpot system described by\nthe following equation:\n( )\n(6.1)\nmx + bx + kx = f t\nwhere m is the system mass, b is the linear damping coefficient, k is the spring coefficient,\nf(t) is the force acting on the mass, and x is the displacement of the mass. The natural\nfrequency ω of the system is simply\nk .\n(6.2)\nω = m\nIn a physical sense, this added mass is the weight added to a system due to the fact that an\naccelerating or decelerating body (ie. unsteady motion:\n=\ndU dt\n0 ) must move some\nvolume of surrounding fluid with it as it moves. The added mass force opposes the motion\nand can be factored into the system equation as follows:\n( ) - m x\n(6.3)\nmx + bx + kx = f t\na\nwhere ma is the added mass. Reordering the terms the system equation becomes:\n( m\nm\n) + bx\n\n+ kx\n\n= f\nt\n\n+\nx\n( )\n(6.4)\na\nFrom here we can treat this again as a simple spring-mass-dashpot system with a new mass\nm\nm′ =\n+\n\nm such that the natural frequency of the system is now\na\nk\nω′ =\nk =\n(6.5)\nm′\nm + ma\nIt is important in ocean engineering to consider floating vessels or platforms motions in\nmore than one direction. Added mass forces can arise in one direction due to motion in a\ndifferent direction, and thus we can end up with a 6 x 6 matrix of added mass coefficients.\nversion 3.0\nupdated 8/30/2005\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nLooking simply at a body in two-dimensions we can have linear motion in two directions\nand rotational motion in one direction. (Think of these coordinates as if you were looking\ndown on a ship.)\nTwo dimensional motion with axis (x,y) fixed on the body. 1: Surge, 2: Sway, 6: Yaw\nThe unsteady forces on the body in the three directions are:\n-\n=\n\nm11\n\ndu1 + m du2 + m du6\n(6.6)\nF1\n\ndt\n\ndt\ndt\n-F2 = m21\n\ndu1 + m du2 + m du6\n(6.7)\ndt\n\ndt\n\ndt\n-F6 = m61\n\ndu1 + m du2 + m du6\n(6.8)\ndt\n\ndt\n\ndt\nWhere F1, F2, and F6, are the surge (x-) force, sway (y-) force and yaw moments\nrespectively. It is common practice in Ocean Engineering and Naval Architecture to write\nthe moments for roll, pitch, and yaw as F4, F5, and F6 and the angular motions in these\ndirections as X4, X5, and X6.\nThis set of equations, (6.6)-(6.8), can be written in matrix form, F = [\n]\n\n,\nM u\n⎛ du1 ⎞\n⎟\n⎜ dt\n⎡m11\nm12\nm16 ⎤⎜\n⎟\nF = ⎢\n⎢m21\nm22\nm26 ⎥\n⎥\n⎜\n⎜du2 ⎟\n(6.9)\ndt ⎟\n⎣\n⎟\n⎢m61\nm62\nm66 ⎦⎥⎜du6\n⎜\n⎟\n⎜⎝ dt ⎠⎟\nversion 3.0\nupdated 8/30/2005\n-2-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nConsidering all six degrees of freedom the Force Matrix is:\nu1\n⎡m11\nm12\nm13\nm14\nm15\nm16 ⎤⎛\n⎞\n⎢\n⎥⎜\n⎟\nu2\nm\n⎢m21\nm22\nm23\nm24\nm25\nm26 ⎥⎜\n⎟\n\n36 ⎥⎜\n⎟\n\n⎢m31\nm32\nm33\nm34\nm35\nu3\nF = ⎢\n⎥⎜\n⎟\n\n(6.10)\nu4\nm\n⎢m41\nm42\nm43\nm44\nm45\nm46 ⎥⎜\n⎟\n\n56 ⎥⎜\n⎟\n\n⎢m51\nm52\nm53\nm54\nm55\nu5\n⎢\n⎥⎜\n⎟\n\n⎣\nu6\n⎢m61\nm62\nm63\nm64\nm65\nm66 ⎦⎥⎝\n⎠\nWe will often abbreviate how we write the Force matrix given in (6.10) using tensor\nnotation.\nThe force vector is written as\n=\n, where i =1 2 3 4 5 6 ,\n(6.11)\nF\nFi\n, , , , ,\nN N\nLinear\nMoments\nForces\nthe acceleration vector as\n2,\nui = [ ,\nu u3, u u5, u ] ,\n(6.12)\nu1\n4,\nand the added mass matrix [ma] as\n,\nmij where i j =1, 2, 3, 4, 5, 6.\n(6.13)\ni\nA good way to think of the added mass components, mij , is to think of each term as mass\nth\njth\nassociated with a force on the body in the\ndirection due to a unit acceleration in the\ndirection.\nFor symmetric geometries the added mass tensor simplifies significantly. For example,\nfigure 2 shows added mass values for a circle, ellipse, and square. In the case of the circle\nand square, movement in the 1 and 2 directions yields similar geometry and identical added\nmass coefficients ( m = m22 ).\nversion 3.0\nupdated 8/30/2005\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nCircle\nEllipse\nSquare\nm11 = m22 = ρd\nm11 = ρπb\nm11 = m22 =1 51 πρa\n.\nm66 = 0\nm22 = ρπa\nm66\n0 234 πρa\n= .\n⎛\nm66 = ρ ⎜a -b2 ⎞\n⎟⎠\n⎝\nTwo dimensional added mass coefficients for a circle, ellipse, and square in 1: Surge, 2: Sway, 6: Yaw\nUsing these coefficients and those tabulated in Newman's Marine Hydrodynamics on\np.145 we can determine the added mass forces quite simply.\nIn three-dimensions, for a sphere (by symmetry):\nm11 = m22 = m33 = ρ∀= mA\n(6.14)\nALL OTHER mij TERMS ARE ZERO ( i =j ).\nversion 3.0\nupdated 8/30/2005\n-4-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nGeneral 6 DOF forces and moments on a Rigid body moving in a fluid:\nVelocities:\nG\nTranslation Velocity U t\n1,\n: ( ) = (U U ,U3)\n(6.15)\nG\nt\n(\n)\nRotational Velocity : Ω( ) = Ω,Ω,Ω ≡ (U ,U5 ,U )\n(6.16)\nAll rotation is taken with respect to Origin of the coordinate system (often placed at the\ncenter of gravity of the object for simplicity!).\n1 2 3 4 5 6 and j, , = 1, 2, 3)\nForces: (force in the jth direction). ( i = , , , , ,\nk\n\nl\n\nFj = -U imij -ε jkl Ui Ωk m\n(6.17)\nli\n\n1 2 3 4 5 6 and j, , = 1, 2, 3)\nMoments: ( i = , , , , ,\nk\n\nl\n\nM j = -U i mj + , i -ε jklUi Ωk ml + , i -ε jkl U\n\nU\n\nmli\n\n(6.18)\nk\ni\nEinstein's summation notation applies!\nThe alternating tensor ε jkl is simply\n, ,\n⎧0;\nif any j k l are equal\n⎪\n, ,\nε jkl = ⎨1;\nif j k l are in cyclic order\n(6.19)\n⎪\n, ,\n⎩-1; if j k l are in anti-cyclic order\nThe full form of the force in the x-direction (F1) is summed over all values of i:\nF1 = -U 1 m11\n\n-U 2 m21\n\n-U 3 m31\n\n-U 4 m41\n\n-U 5 m51\n\n-U 6 m61\n\nN\nN\n\nj=1\ni=1\ni=2\ni=3\ni=4\ni=5\ni=6\nU2 Ωk ml 2 -ε\nU3 Ωk ml 3 -ε1kl\n-ε1kl U1 Ωk ml1 -ε1kl\n1kl\nU4 Ωk ml 4\n(6.20)\n\ni=1\ni=2\ni=3\ni=4\n-ε\nU5 Ωk ml 5 -ε1kl\n1kl\nU6 Ωk ml 6\n\ni=5\ni=6\nfor k l, =1, 2, 3 .\nversion 3.0\nupdated 8/30/2005\n-5-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nNext we can choose the index k to cycle through. It is helpful to note that the only terms\nwhere k plays a role, contain ε jkl . Following the definition for ε jkl given in (6.19) and\nsince j = 1, all terms will be zero for k = 1. Therefore k can only take the value of 2 or 3:\nF1 = -U 1 m11\n\n-U 2 m21\n\n-U 3 m31\n\n-U 4 m41\n\n-U 5 m51\n\n-U 6 m61\n\nN\nN\n\nj=1\ni=1\ni=2\ni=3\ni=4\ni=5\ni=6\n-ε12\n\nl U1 Ω2 ml1 -ε12\n\nl\nU3 Ω2 ml 3 -ε12\n\nl\nU5 Ω2 ml 5 -ε12\n\nl\nU2 Ω2 ml 2 -ε12\n\nl\nU4 Ω2 ml 4 -ε12\n\nl\nU6 Ω2 ml 6\n\ni=1\ni=2\ni=3\ni=4\ni=5\ni=6\n\nk =2\n-ε13\n\nl U1 Ω3 ml1 -ε13\n\nl U2 Ω3 ml 2 -ε13\n\nl\nU5 Ω3 ml5 -ε13\n\nl U6 Ω3ml 6\nU3 Ω3 ml 3 -ε13\n\nl U4 Ω3 ml 4 -ε13\n\nl\n\ni =1\ni=2\ni=3\ni=4\ni=5\ni=6\n\nk =3\n(6.21)\nFinally we cycle through the index l. Again it is helpful to note that the only terms where l\nplays a role, contain ε jkl . Following the definition for ε jkl given in (6.19) and since j = 1,\nand k = 2 or 3, then all terms will be zero for l = 1 and some zero for the case l = 2 and\nothers zero when l =3. Like before l can only take the value of 2 or 3 such that l\nk\n=\n=j :\nF1 = -U 1 m11\n\n-U 2 m21\n\n-U 3 m31\n\n-U 4 m41\n\n-U 5 m51\n\n-U 6 m61\n\nN\nN\n\nj=1\ni=1\ni=2\ni=3\ni=4\ni=5\ni=6\n-ε123\nU2 Ω2 m32 -ε123\nU4 Ω2 m34\nU5 Ω2 m35 -ε123\nU1 Ω2 m31 -ε123\nU3 Ω2 m33 -ε123 -ε123\nU6 Ω2 m36\n\ni=5\ni=6\n\ni=1\ni=2\ni=3\n\ni=4\nk =2; l =3\n-ε132 -ε132 U2 Ω3 m22 -ε\nU3 Ω3 m23 -ε132 U4 Ω3 m24 -ε132\nU6 Ω3m26\nU1 Ω3 m21\n\nU5 Ω3 m25 -ε132\n\ni=5\ni=6\n\ni =1\ni=2\ni=3\n\ni=4\nk =3; l =2\n(6.22)\nOn the second row of the equation above, the indices of the alternating tensor, ε jkl , are in\ncyclic order jkl = 123 ( ε\n= +1). In the third row, the indices are in anti (or reverse) cyclic\norder: ε\n= -1 where jkl = 132.\nMore than likely you will never have to write out all six force equations with all the terms\nas the velocity and acceleration of the body will be zero in certain directions. However for\na full seakeeping analysis of a ship then one day you just might need to be able to determine\nall the forces!\nversion 3.0\nupdated 8/30/2005\n-6-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nTypical Example: For a body moving in the fluid with velocity\nKV = (1,0,1,0,0,1) = (U ,0, U , 0, 0, U ) = (U ,0, U , 0, 0, Ω )\n(6.23)\nand acceleration\na K = (1,0,0,0,0,1) = (U ,0,0,0,0, U )\n(6.24)\nwe can find the force on the body in the X-direction. The force in the x-direction is F1 so\nj=1.\nFirst substitute \"1\" for every instance of j in equation (6.17) to get:\nFj=1 = F1 = -U i mi1 -ε1kl Ui Ωk mli\n\n(6.25)\nNext we need to \"cycle\" through the possible values for i (i = 1,2,3,4,5,6). Looking at\nequation (6.25), it is clear that the only \"ith\" accelerations that will matter are the non-zero\n\nones from (6.24), thus U1 and U6 , and the only \"ith\" velocities to consider are for i = 1,3,\nand 6 [eqn (6.23)].\nF1 = -U 1 m11\n\n-U 6 m61\n\n-ε1kl U1 Ωk ml1 -ε1kl\nU6 Ωk ml 6\n(6.26)\nU3 Ωk ml 3 -ε1kl\nN\n\ni=1\ni=6\ni=1\ni=3\ni=6\nj\nNow look at the k-index: ( k =\n∴k = 2, 3 ) However Ω2 = 0 and Ω\n\n=\n\n0 thus for k = 2 all\nassociated terms will be zero, so we only have to deal with k = 3. Since j =1and k = 3the\nonly value left for l, that could result in non-zero terms, is 2.\nF1 = -U 1 m11\n\n-U 6 m61\n\nN\n\ni=1\ni=6\n(6.27)\nU1 Ω3 m21\n\nU6 Ω3 m26\n-ε132 -ε132 U3 Ω3 m23 -ε132\n\ni=1\ni=3\ni=6\n\nk =3; l =2\nIf the body in question was a simple, symmetrical sphere we could reduce this even further.\nUsing the added mass values from (6.14) and trusting that the off-diagonal added mass\nterms are zero (just for the sphere), the force in the x-direction on a sphere, given (6.23) and\n(6.24), is\nF1 = -U 1 m11\n\n(6.28)\nN\ni=1\nversion 3.0\nupdated 8/30/2005\n-7-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nDetermining 3D Added Mass Using Slender Body Theory\nTo formulate the added mass of a system such as a ship or submarine that can be modeled\nas a slender body, we first need the two-dimensional sectional added mass coefficients.\nWe will consider a slender body to have a characteristic length in one direction that is\nconsiderably longer than its length in the other two directions. For these slender bodies we\ncan use known 2D coefficients to find the unknown 3D added mass coefficient for the\nbody.\nThe added mass force acting on the body due to unsteady motion is\nFj = -U imij -ε jkl Ui Ωk m\n(6.29)\nli\n\nwhere mij is the added mass in the ith direction due to a unit acceleration in the jth direction\nand i,j = 1:6. The added mass tensor, mij , is symmetric!\nTo find the 3D added mass coefficients consider simply the body geometry, ignoring for\nnow the actual motions of the vessel. To start, orient the 1-axis along the long axis of the\nslender body as shown in figure 1. The 3D added mass coefficients will be found by\nsumming (or integrating) the added mass coefficients of the 2D cross-sectional slices along\nthe body.\nSlender body oriented with the long axis in the 1-direction.\nversion 3.0\nupdated 8/30/2005\n-8-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #6\nThe sectional added mass coefficients are tabulated for simple geometries. In general, with\nthe slender body aligned lengthwise along the 1-axis, the 2D cross-sectional slice is aligned\nwith the 2-3 plane, some distance x from the origin (figure 1). This 2D slice is shown in\nfigure 2. To find the 3D coefficients we need to know the 2D coefficient of each section\n(strip) along the length of the vessel. For a uniform diameter cylinder this is quite simple,\nbut for ships with complex geometry there is a bit more work involved.\n2D cross-sectional slice of slender body.\nThe 2D coefficients will be written as aij whereas the 3D coefficients are written as mij .\nFrom here on we will follow the basic formulations used in the handbook: Principles of\nNaval Architecture Vol III., (1989) Soc. Naval Arch. and Marine Engineers, p. 56.\nL\nm\na dx\n= ∫\nL\nm\na dx\n= -\n\n∫\nL\nm\na dx\n= ∫\nL\nm\nx a dx\n= ∫\nm\na\n\ndx\n\n= ∫\nm\nx\n\na\n\ndx\n\n= -\n\n∫\nL\nL\nL\nm\na dx\n= ∫\nL\nm\nx a dx\n= ∫\nL\nm\nx\n\na\n\ndx\n\n= ∫\nL\nm\nx\n\na\n\ndx\n\n= ∫\nversion 3.0\nupdated 8/30/2005\n-9-\n(c)2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "2005reading7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-016-hydrodynamics-13-012-fall-2005/8f21a5cde79c7f8bd8dc435d5b6e902b_2005reading7.pdf",
      "content": "2.016 Hydrodynamics\nReading #7\n2.016 Hydrodynamics\nProf. A.H. Techet\nFall 2005\nFree Surface Water Waves\nI.\nProblem setup\n1. Free surface water wave problem.\nIn order to determine an exact equation for the problem of free surface gravity waves we\nwill assume potential theory (ideal flow) and ignore the effects of viscosity. Waves in the\nocean are not typically uni-directional, but often approach structures from many directions.\nThis complicates the problem of free surface wave analysis, but can be overcome through a\nseries of assumptions.\nTo setup the exact solution to the free surface gravity wave problem we first specify our\nunknowns:\nG\n- Velocity Field: V (x, y, z,t ) = ∇φ(x, y, z,t )\n(x y t)\n- Free surface elevation: η\n, ,\n- Pressure field: p(x y z t )\n, , ,\nversion 3.0\nupdated 8/30/2005\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nNext we need to set up the equations and conditions that govern the problem:\n- Continuity (Conservation of Mass):\n2φ\n\n∇\n= 0 for z <η (Laplace's Equation)\n(7.1)\n- Bernoulli's Equation (given some φ ):\np\npa\n-\n∂φ\n\n+\n∇φ\n2 +\nρ\n+ gz = 0 for z <η\n(7.2)\n∂ t\n- No disturbance far away:\nφ\n\n∂φ , ∇\n→0 and p = p -ρ gz\n\n(7.3)\n∂ t\na\nFinally we need to dictate the boundary conditions at the free surface, seafloor and on any\nbody in the water:\n(1) Pressure is constant across the free surface interface: p = p\non z =η .\natm\n⎧∂φ\n⎫\n( ) = patm .\n(7.4)\np = -ρ\n⎩⎨ ∂ t - 1\n2 V 2 - gz\n\n⎬+ c\n\nt\n\n⎭\n(\nChoosing a suitable integration constant, c t) = p\n, the boundary condition on\natm\nz =η becomes\nρ{∂φ\n1 V 2\n+\n+ gη} = 0.\n(7.5)\n∂t\n(2) Once a particle is on the free surface, it remains there always. Similarly, the\nnormal velocity of a particle on the surface follows the normal velocity of the\nsurface itself.\nz =η (xp , t)\np\n∂η\n∂η\nz +δ z =η (xp +δ x , t +δ t) =η (xp , t) +\nδ x +\nδ t\n(7.6)\np\np\np\np\n∂ x\n∂t\nOn the surface, where zp =η , we can reduce the above equation to\n∂η\n∂η\nδz =\nuδt +\nδt\n(7.7)\np\n∂ x\n∂ t\nand substitute δ z = wδ t and δ x = u\nt\nto show that the normal velocity follows\nδ\np\np\nthe particle:\nversion 3.0\nupdated 8/30/2005\n-2-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\n∂η\n∂η\nw\nu\n+\non\n\nz\n\n=η.\n(7.8)\n= ∂x\n∂t\n( , , ,\n(3) On an impervious body boundary B x y z t ) = 0 . Velocity of the fluid normal to\nthe body must be equal to the body velocity in that direction:\nG\n∂φ\nJG\n\nG\n\nG\nv nˆ\n(\n)\n\n⋅ ˆ(\n)\n\n= U on B = 0.\n(7.9)\n⋅\n=\nφ ⋅ nˆ =\n= U x t n x t\n∂n\n,\n,\nn\nAlternately a particle P on B remains on B always; ie. B is a material surface.\nFor example: if P is on B at some time t\nt such that\n=\no\nG\nG\n,\n( ,\nB(x t ) = 0, then B x t ) = 0 for all t ,\n(7.10)\no\no\nso that if we were to follow P then B = 0 always. Therefore:\nDB\n∂B (\n=\n+\n\n∇φ ⋅∇)B = 0 on\n\nB\n\n= 0.\n(7.11)\nDt\n∂t\nTake for example a flat bottom at z = -H :\n∂φ/∂z = 0 on z = -H\n(7.12)\nII.\nLinear Waves\n2. Linearized Wave Problem.\nversion 3.0\nupdated 8/30/2005\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nTo simplify the complex problem of ocean waves we will consider only small amplitude\nwaves (such that the slope of the free surface is small). This means that the wave amplitude\nis much smaller than the wavelength of the waves.\nAs a general rule of thumb for wave height to wavelength ratios ( h / λ , where h is twice the\nwave amplitude) less than 1 7 we can linearize the free surface boundary conditions.\n/\nNon-dimensional variables can be used to assess which terms can be dropped.\nNon-dimensional variables:\nη = aη∗\nω t\nt∗\n=\n=\nu\naω u∗\nx = λ x∗\n∗\n=\nw\naω w∗φ = aωλ φ\nLooking back to equation (7.5) we can evaluate the relative magnitude of each term by\nplugging in the non-dimensional versions of each variable. For example:\nd\ndφ = aωλ φ ∗\ndt = /ω dt∗\ndx = λ dx∗\n∂φ\nCompare ∂φ and V ∼ (\n)2 to determine which terms can be dropped from equation (7.5):\n∂t\n∂x\n(\n)\n∂φ∗\n∂φ∗\n∂φ 2\na ω (\n)\na (\n)\n∂x\n∂x ∗\n∂x ∗\n∂φ\n=\n∂φ∗ = λ\n∂φ∗ .\n(7.13)\naω λ\n∗\n∗\n∂t\n∂t\n∂t\n/\n<<\n\n1 7 , then\nHere we see that if h λ\n/\n( ∂φ 2\n∂φ\n(7.14)\n∂x ) << ∂t ,\nand we can drop the smaller term resulting in linearized boundary conditions\n∂η = ∂φ\n∂t\n∂z ,\n∂φ + gη = 0 ,\n∂t\nwhich are applicable on z =η .\nversion 3.0\nupdated 8/30/2005\n-4-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nThroughout this discussion we have assumed that the wave height is small compared to the\nwavelength. Along these lines we can also see why η is also quite small. If we expand\n( , ,\nφ x z t) about z = 0 using Taylor series:\n∂φ\n,\nφ(x z =η, t) = φ( x, 0, t) +\nη + ... ,\n(7.15)\n∂z\nit can be readily shown that, the second term, ∂φ η and the subsequent higher order terms\n∂z\nare very small and can be ignored in our linear equations allowing us to rewrite the\nboundary conditions at z =η as boundary conditions on z = 0 . 0.2in\n∂2φ + g ∂φ = 0\n(7.16)\n∂t2\n∂z\n1 ∂φ\nη = -g ∂t\n(7.17)\non z = 0.\nA Solution to the Linear Wave Problem\nThe complete boundary value wave problem consists of the differential equation,\nspecifically Laplace's Equation,\n2 ( , ,\n∂φ\n∂φ\n∇φ x z t ) =\n+\n= 0\n(7.18)\n∂x2\n∂z2\nwith the following boundary conditions:\n1) Bottom Boundary Condition:\n∂φ = 0 on z = - H\n(7.19)\n∂z\n2) Free Surface Dynamic Boundary Condition (FSDBC):\n1 ∂φ\nη =\n(\n) on z = .\n(7.20)\ng ∂t\nversion 3.0\nupdated 8/30/2005\n-5-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\n3) Free Surface Kinematic Boundary Condition (FSKBC):\n∂φ\n∂φ\n+ g\n= 0\n(7.21)\n∂t 2\n∂z\nThrough separation of variables we can solve Laplace's Equation for η and φ .\n(\n)\ncos(\n\n)\nx t\na\nkx\nt\nη\nω\nψ\n, =\n-\n+\n\n(7.22)\n(\n)\n\n(\n\n)\n\nsin(\n\n)\na\nx z t\nf z\nkx\nt\nk\nω\nφ\nω\nψ\n, , = -\n- +\n\n(7.23)\n(\n)\n\n(\n\n)\n\ncos(\n\n)\nu x z t a f z\nkx\nt\nω\nω\nψ\n, , =\n- +\n\n(7.24)\n(\n)\n\n(\n\n)\n\nsin(\n\n)\nw x z t\na f z\nkx\nt\nω\nω\nψ\n, , = -\n- +\n\n(7.25)\ncosh[ (\n)]\n( )\nsinh(\n)\nk z H\nf z\nkH\n+\n=\n\n(7.26)\nsinh[ (\n)]\n( )\nsinh(\n)\nk z H\nf z\nkH\n+\n=\n\n(7.27)\ntanh(\n)\ngk\nkH\ndispersion relation\nω =\n⇒\n\n(7.28)\nwhere a, ω , k, ψ are integration constants with physical interpretation: a is the wave\namplitude, ω the wave frequency, k is the wavenumber ( k = 2π/λ ), and ψ simply adds a\nphase shift.\nIII.\nDispersion Relation\nThe dispersion relationship uniquely relates the wave frequency and wave number given\nthe depth of the water. The chosen potential function, φ , MUST satisfy the free surface\nboundary conditions (equation (7.20) and (7.21)) such that plugging φ in to the FSKBC\n(eq. (7.21)) we get:\n-ω 2 cosh kH + gk sinh kH = 0\n(7.29)\nResulting in the Dispersion relationship:\nω = gk tanh kH ;\n(7.30)\nversion 3.0\nupdated 8/30/2005\n-6-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nFor deep water where H →inf tanh kH →1 so that the dispersion relationship in deep\nwater is:\nω = gk\n(7.31)\nIn general, k ↑ as ω ↑ or λ ↑ as T ↑.\nPhase and Group Speed\nPhase speed, Cp , of a wave (velocity that a wave crest is traveling at) is found in general\nusing:\nω\ng\nλ = C =\n=\ntanh kH\n\n.\n(7.32)\np\nk\nT\nk\nThis simplifies for the case of deep water such that\nC =\ng\n(7.33)\np\nk\nSolution to the dispersion relationship in general form can be found graphically.\nIV.\nPressure under a Wave\nThe pressure under a wave can be found using the unsteady form of Bernoulli's equation\nand the wave potential, ( , ,\nφ x z t) :\np = - ρ ∂φ - ρV -ρgz\n\n(7.34)\nN 2\nN\n∂t\n\nhydrostatic\nunsteady\n2nd Order\npressure\nfluctuation\nterm\n\nDynamicPressure\nSince we are only considering the case for LINEAR free surface waves we can neglect all\nhigher order terms. Dropping the second order term in the dynamic pressure from equation\n(7.34), the pressure under a wave is simply\n∂φ\n( , ,\np\nx\nz\nt\n\n) = -ρ\n\n(7.35)\nd\n∂t\nversion 3.0\nupdated 8/30/2005\n-7-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\naω\n=\nρ f z( ) cos(ωt -kx -ψ )\n(7.36)\nk\nω\nz\n, ) ,\n(7.37)\n= ρ\nf ( )η(x\n\nt\n\nk\nwhere\nω\n(\n(\ncosh[k z + H )] .\n(7.38)\nf z) = g tanh( kH ) cosh[k z + H )] = g\n(\nk\nsinh( kH\n\n)\ncosh( kH\n\n)\nTherefore the dynamic pressure for all depths becomes\n(\ng\n,\ncosh[ k z +H )]\np\nx\nz\nt\n\n) = ρ η(x\nt\n\n)\ncosh(kH )\n( , ,\n(7.39)\nd\nV.\nMotion of Fluid Particles below a Wave\nWe can define the motion of fluid particles underneath a linear progressive wave to have a\nhorizontal motion,ζ p and a vertical motion, η , such that\np\np\n, ,\nt) +\nζ (x z t ) = a f (z)\n\nsin(kx -ω\nψ\n\n)\n(7.40)\np\n, ,\nk\nx\nη (x z t ) = a f (z)\n\ncos(ωt - - +ψ )\n(7.41)\nThe orbital pattern is given by the equation for an ellipse:\n⎡ζ p ⎤\n2 ⎡ζ p ⎤\n= a\n(7.42)\n⎣f z\nz ⎥\n⎢ ( ) ⎥⎦\n+\n⎣⎢f1( ) ⎦\nwhere a is the amplitude of the waves. Plugging in f(z) and f1(z) from equations (7.26) and\n(7.27) we get\nversion 3.0\nupdated 8/30/2005\n-8-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\n⎡\nζ\n⎤\n⎡\nζ\n⎤\np\np\n⎢\n⎥+ ⎢\n(7.43)\n(\ncosh k z +H )\nsinh k ( z +H )\n⎢a (\nsinh kH )⎥\n⎢a (\nsinh kH )\n⎥\n⎥\n=1\n⎣\n⎦\n⎣\n⎦\nThe horizontal and vertical velocity components, u and w, of these particles are simply the\ntime derivatives of the motions:\nu =\n∂ζ\n∂t\np\n(7.44)\nw =\n∂η\n∂t\np\n(7.45)\n3. Fluid particles move in elliptical orbits below the surface. In deep water,\nas H →inf, these ellipses become circular.\nDeep Water Simplification\nz\nz\nIn deep water as H →inf, then f ( ) ≈ f1( ) ≈ekz , and the particle orbits become circular\nwith an exponentially decreasing radius. All particle motion dies out at z ≈-λ/2.\nversion 3.0\nupdated 8/30/2005\n-9-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nPhase and Group Velocity\nPhase Speed\nThe phase speed of a wave is defined as the speed at which the wave is moving. If you were\nto clock a wave crest you would find that it moves at the phase speed, Cp =\n/k .\nω\nGroup Velocity\nGroup velocity is the speed of propagation of a packet, or group, of waves. This is always\nslower than the phase speed of the waves. In a laboratory setting group speed can be\nobserved by creating a short packet of waves, about 8-10 cycles, and observing this packet\nas it propagates down a testing tank. The leading edge of the packet will appear to move\nslower than the waves within the packet. Individual waves will appear at the rear of the\npacket and propagate to the front, where the pressure forces their apparent disappearance.\nWe can derive Group Velocity starting with a harmonic surface wave with surface\nelevation\n(\n)\n\n= a cos(ωt -kx\n\n)\n(7.46)\nη x,t\nand then looking at that wave as if it was the sum of two cosines with very similar\nfrequencies ( ω ±δω ) and wavenumbers ( k ±δ k ):\n,\n=\nlim\n{ a cos\n\n([ω\nδω ]t -[k -δk\n\nx\n\n) + a cos\n\n([ω\nδω ]t -[k +δk\n\nx\n\n)} (7.47)\n(\n)\n\nδ\nδ\n-\n]\n+\n]\nη x t\nk , ω→0\nt -\n= lim {a cos(ωt -kx\n\n)cos(δω\n\nδ\n\nk\n\nx\n\n)}\n(7.48)\nk , ω→0\nδ\nδ\nη\n)\n(t, x = 0\ntime\n4. A wave train (red line) constructed with two waves having similar\nfrequency/wavenumber components. This wave appears to be beating. The\nblue line shows the \"envelope\" or group outline.\nversion 3.0\nupdated 8/30/2005\n-10-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nIn general the envelope (or \"Group\") of the wave travels at the group speed, Cg,\nδω\nC =\n.\n(7.49)\ng\nδ k\nIn the limit as δω →0 and δk →0 , the group velocity becomes the derivative of the\nfrequency with respect to the wavenumber:\ndω\nC =\n\n(7.50)\ng\ndk\nThis can be found using the dispersion relationship from equation (7.30), and then taking\nthe derivative of it with respect to the wavenumber.\nWe can derive the group speed as follows:\nd\nd\n{\n} = dk {kg tanh( kH )}\n(7.51)\nω\ndk\ndω\n2ω\n= g tanh( kH\n\n) +\nkgH\n\n(7.52)\ndk\ncosh2(kH )\ndω\n1 g\n⎧\nkH\n⎫\n=\ntanh( kH ) ⎨1+\n⎬\n(7.53)\ndk\n2 ω\nsinh( kH )cosh( kH ) ⎭\n\n⎩\n= k\nω =C p\n⎧\nkH\n⎫\n∴C = Cp ⎨1+\n⎬\n(7.54)\ng\n⎩\nsinh\n\nkH cosh\n\nkH ⎭\nDeep Water: H →inf\nω2 = kg and Cg = 1 C\n(7.55)\np\nShallow Water: H →0\nω =\ngH k and Cg = C\n(7.56)\np\nversion 3.0\nupdated 8/30/2005\n-11-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nWave Energy\n- Potential Energy\nλ\ng\nEP = 1\nλ 1 ρ η 2 dx\n\n= λ ∫0\n2 ρga cos (ωt -kx )\n(7.57)\nλ ∫0 2\nEP = 1 ρga\n\n(7.58)\n- Kinetic Energy\nλ\n0 1 ρ(u2 + w2) dz\n\ndx\n\n(7.59)\nEk = λ ∫∫-H 2\nEk = 1 ρga\n\n(7.60)\n- Total Energy per wavelength\nE = EP + Ek = 1 ρga\n\n(7.61)\nFlux of Energy through a Vertical Plane\n)\nPower = force ∗velocity = ( p dz u\n- Energy flux:\ndE\n= ∫-H p u dz\ndt\n(7.62)\n= 1 ρga2ω cos 2 (ωt -kx )\n2k\n(7.63)\n- Average energy flux over one cycle, assuming deep water,\nd E = 1\nT dE dt = 1 ρga2ω = E C g\ndt\nT ∫0 dt\n4k\n⋅\n(7.64)\nversion 3.0\nupdated 8/30/2005\n-12-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #7\nUseful References\nThe material covered in this section should be review. If you have not taken 13.021 or a\nsimilar class dealing with basic fluid mechanics and water waves please contact the\ninstructor. The references below are merely suggestions for further reading and reference.\n- J. N. Newman (1977) Marine Hydrodynamics MIT Press, Cambridge, MA.\n- M. Faltinsen (1990) Sea Loads on Ships and Offshore Structures Cambridge\nUniversity Press, Cambridge, UK.\n- M. Rahman (1995) Water Waves: Relating modern theory to advanced engineering\npractice Clarendon Press, Oxford.\nversion 3.0\nupdated 8/30/2005\n-13-\n(c)2005 A. Techet"
    }
  ]
}