{
  "course_name": "Identity and Difference",
  "course_description": "This course explores how identities, whether of individuals or groups, are produced, maintained, and transformed. Students will be introduced to various theoretical perspectives that deal with identity formation, including constructions of “the normal.” We will explore the utility of these perspectives for understanding identity components such as gender, sexual orientation, race, ethnicity, religion, language, social class, and bodily difference. By semester’s end students will understand better how an individual can be at once cause and consequence of society, a unique agent of social action as well as a social product.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Society",
    "Gender Studies",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Society",
    "Gender Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis course explores how identities, whether of individuals or groups, are produced, maintained, and transformed. Students will be introduced to various theoretical perspectives that deal with identity formation, including constructions of \"the normal.\" We will explore the utility of these perspectives for understanding identity components such as gender, sexual orientation, race, ethnicity, religion, language, social class, and bodily difference. By semester's end students will understand better how an individual can be at once cause and consequence of society, a unique agent of social action as well as a social product.\n\nRequirements\n\nIn addition to written work, students are expected to keep up with all assigned readings (a book per week; 100 pp. a week for articles). Students\nmust\nattend class and participate; this part of the course, coupled with Reader Responses, accounts for 25% of the grade. Students who miss more than 3 classes will lose credit. Students will write 3 papers, each counting 25%. There is no final examination. Several video/DVDs will be shown in class.\n\nReader Responses\n\nThese consist of a brief paragraph describing your reaction to one or more of the readings for that week. You will post them on the \"Forum\" section of the class Web site by 2:00 PM the day of class. Do not provide an analysis or summary, give us your\nresponse\nto the reading. These should take no more than 15 minutes, although you may write more if you wish. They are not graded but are required to pass the course.\n\nPapers\n\nYou will write three papers, 7 or more pages (roughly 2000 words) each on an assigned topic. You must rewrite the first two papers in light of the comments you receive. The revised draft is the version that will be graded. Rewriting the third paper is optional, but highly recommended.\n\nThe first paper is due Week #5. You will get it back one week later, Week #6, and must submit your rewrite one week later, Week #7. The second paper is due Week #9. You will get it back one week later, Week #10, and must submit your rewrite in Week #11. If you plan on revising the third paper, the first version must be handed in during Week #12 (as e-mail attachment if you wish), and will be handed back Week #13. For the entire class, the final paper is due Week #14.\n\nPresentation\n\nStudents will give presentations, lead discussion, and participate in various kinds of group activities. Each student will give a formal presentation of the third paper, time limit to be determined on the basis of enrollment. These final presentations are not graded.\n\nFormat\n\nThe first class hour will be lecture, followed by student presentations and structured discussion. Participating enthusiastically in the group activities and structured discussions is extremely important.\n\nRequired Books\n\nBourgois, Philippe.\nIn Search of Respect: Selling Crack in El Barrio\n. New York, NY: Cambridge University Press, 2002. ISBN: 9780521017114.\n\nPascoe, C. J.\nDude\n,\nYou're a Fag: Masculinity and Sexuality in High School\n. Berkeley, CA: University of California Press, 2007. ISBN: 9780520252301.\n\nRhodes, Lorna A.\nTotal Confinement: Madness and Reason in the Maximum Security Prison\n. Berkeley, CA: University of California Press, 2004. ISBN: 9780520240766.",
  "files": [
    {
      "category": "Resource",
      "title": "MIT21A_218JS10_comments.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-218j-identity-and-difference-spring-2010/f75dd8081341666d4f4e84d4a93f7c05_MIT21A_218JS10_comments.pdf",
      "content": "General comments on papers:\nBe sure to hand in your 1st draft with the final one.\nRead your next-to-final draft out loud; you're likely to catch any awkward phrasing. Switching\nto \"print layout\" view and reading through can help, too.\nProofread! Do a spell check!\nProvide definitions for terms you're using a lot. These don't have to be permanent choices; the\nbest definition is one that helps you the most in your current task.\nMake every sentence say something.\nCheck for redundancies.\nProvide a road map somewhere on the first page that lets the reader know what the paper will do.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.218J / WGS.170J Identity and Difference\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_218JS10_howtowrite.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-218j-identity-and-difference-spring-2010/99c49f39d02bab192952d120dcc5964e_MIT21A_218JS10_howtowrite.pdf",
      "content": "Excerpts from Appendix from Stephen Van Evera, Guide to Methods for Students of\nPolitical Science (Ithaca, NY: Cornell University Press, 1997).\nHow to Write a Paper\nI often offer the following suggestions to undergraduates writing class papers.\nGENERAL FORMAT\nThe following general format is often appropriate: \"tell them what you're going to tell\nthem; then tell them; then tell them what you told them.\"\nINTRODUCTION FORMAT\nBegin your paper with a short summary introduction.This summary introduction should\nanswer up to five (5) questions:\n1. What question or questions do you address?\n2. Why do these questions arise? From what literature or real-world events? Offer\nbackground that clarifies your questions and puts them in context.\n3. What answer or answers do you offer? Summarize your bottom line in a few\nsentences.\n4. How will you reach your answers? Say a few words about your sources and\nmethods.\n5. What comes next? Provide a roadmap to the rest of the paper: \"Section I\nexplains how I began my life of crime; Section II details my early arrests; Section\nIII describes my trip to death row; Section IV offers general theoretical conclusion\nand policy implications.\" Something of that sort.\nNumber 1 (\"What is your question?\"), number 2 (\"Why does this question arise?\"), and\nnumber 3 (\"What is your answer?\") are essential: make sure you cover them. Numbers 4\nand 5 are optional.\nSummary introductions of this sort help readers grasp your argument. They also help you\ndiagnose problems with your paper. A summary introduction can be hard to write. A\npossible reason: gaps or contradictions in your arguments or evidence, which summary\nexposes. Solution: rethink and reorganize your paper.\nCONCLUSION FORMAT\nAuthors often recapitulate their argument in their conclusion; however, a good summary\nintroduction often makes a full summary conclusion redundant. If so, recapitulate quickly\nand then use your conclusion to explore the implications of your argument. What policy\nprescriptions follow from your analysis? What general arguments does it call into\nquestion, and which does it reinforce? What further research projects does it suggest?\n\nARGUMENTATION Four injunctions on argumentation should be kept in mind.\n1. Use empirical evidence-- facts,numbers, history-- to\nsupport your argument. Purely deductive argument\nis sometimes appropriate, but argument backed by evidence\nis always more persuasive.\n2. Clearly frame the general point(s) that your evidence supports. Don't\nask facts to speak for themselves.\nTo summarize points 1 and 2: offer evidence to support your arguments\nand state the arguments your evidence supports.\n3. \"Argue against yourself.\" After laying out your argument, acknowledge\nquestions or objections that a skeptical reader might raise, and briefly\naddress them. This shows readers that you were thoughtful, thorough, and\npaid due regard to possible objections or alternate explanations.\nOften, of course, the skeptic would have a good point, and you should\ngrant it. Don't claim too much for your theories or evidence!\n4. Use footnotes to document all sources and statements of fact. On\nfootnote and citation format, consult and obey KateL. Turabian, A Manual\nfor Writers of Term Papers, Theses, and Dissertations,6th ed., rev. John\nGrossman and Alice Bennet (Chicago: Universityof Chicago Press, 1996),\nin paperback. You should own a copy.\nWRITING\nGood writing is essential to clear thinking and effective communication. So bear the\nfollowing points in mind:\n1. Your paper should make a single point or a handful of related points\nand should follow a simple organization. Avoid cluttering it with extra\npoints. If you developed an argument that later became ancillary as you\nrethought your paper, drop the argument from thepaper. This is painful (\"I\nsweated hours on that idea!\") but extraneous arguments drain power from\nyour main argument.\n2. Break your paper into numbered sections and subsections. More\nsections is better than fewer. Sections help readers see the structure of your\nargument.\nI recommend the following structure for sections / subsections:\n\na. Your argument;\nb. Your supporting evidence;\nc. Counter arguments, qualifications, and limiting conditions of\nyour argument.\n3. Start each section with several sentences summarizing the argument\npresented in the section. You may cut these sentences from your final draft\nif they seem redundant with your summary introduction,but you should\ninclude them in your first drafts to see how they look.Writing such\nsummaries is also a good way to force yourself to decide what you are and\nare not doing in each section, and to force yourself to\nconfront contradictions or shortcomings in your argument.\nOften these section summaries are best written after you write the section,\nbut don't forget to add them at some point.\n4. Start each paragraph with a topic sentence that distills the point of the\nparagraph. (Note: The topic sentence can appear as the second sentence in\na paragraph, but should not appear later than that.) Later sentences should\noffer supporting material that explains or elaborates the point of the topic\nsentence. Qualifications or refutation to counter arguments should then\nfollow. In short, paragraphs should have the same structure as whole\nsections.\nA reader should be able to grasp the thrust of your argument by reading\nonly the first couple of sentences of each paragraph.\n5. Write short, declarative sentences. Avoid the passive voice. (Passive\nvoice: \"The kulaks were murdered\"--but who did it? Active voice: \"Stalin\nmurdered the kulaks.\")\n6. Write from an outline. Outlines are major aids to coherence and\nreadability.\n7. Write at a level appropriate for college undergraduate readers--i.e.,\nsmart readers without too much background knowledge on your topic. In\nfact your class papers will be read by teachers who probably know\nsomething about your topic, but they want to see how you would lay out\nyour argument for folks who don't. For more advice onwriting, see\nWilliam Strunk Jr., and E. B. White, The Elements of Style, 3d ed. (New\nYork: Macmillan, 1979).\n\nVETTING Ask a friend or two to give your paper a look before you turn it in; and return\nthe favor for them when they have a paper underway. Two heads are better than one, and\ngiving and receiving comments are important skills.\nGENERAL BEAUTY TIPS\nTake care to turn in a neat, clean paper. Run your spellchecker. A messy-looking paper\nsuggests a messy mind.\nHOW TO LEARN MORE ABOUT HOW TO WRITE PAPERS\nReread articles you or others admire and imitate their better aspects.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.218J / WGS.170J Identity and Difference\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_218JS10_rules.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-218j-identity-and-difference-spring-2010/bc8ca2736726cbe03ca194b3bc1c0cc0_MIT21A_218JS10_rules.pdf",
      "content": "SOME RULES OF THUMB FOR WRITING PAPERS\nJosh Cohen, MIT\nHere are a few suggestions about writing papers. Please read through them\nbefore you write the first paper.\n1. State the main thesis of your paper at (or near) the beginning: say, in the first\nparagraph. It is not bad to say something like: \"I will argue that ....\" If you do not\nhave a thesis, get one.\n2. Stay focused. Your papers should critically assess some important aspect of\none of the theories we have been discussing: the thesis of your paper, stated\nnear the beginning (see point 1 above) will say what that aspect is. Before you\nget to the evaluation you will need to describe the relevant aspect(s) of the theory\nyou are assessing. But do not try to provide a comprehensive overview of the\ntheory. Instead, guide your presentation by the particular problems that animate\nyour paper. For example, if you are writing on John Rawls's \"difference principle,\"\nyou should not first try to sketch his theory of the original position and the\nargument for the principle within the original position. Confine yourself to the\naspects of Rawls's view that are of immediate relevance to his account of fair\ndistribution. Anything else will be a distraction (and in the short space available,\nwill be done badly).\n3. Do not lead with (or conclude with, or otherwise include) sweeping\ngeneralities: \"Rawls's theory of justice is the most important recent contribution to\nthe perennial human search for the ideal society.\" \"Since Plato, philosophers\nhave sought out the meaning of justice.\" \"For thousands of years, human beings\nhave searched for truth. \"Philosophy is based on reason, not rhetoric.\" (What\nabout: \"Man is born free, but is everywhere in chains.\" If you are Rousseau, then\nyou can break any rule that I have stated here.) Such remarks add nothing of\nsubstance; indeed, they subtract by distracting from the issues at hand.\nMoreover, they suggest that the writer is unsure what to say, and is looking for a\nway to fill some space. You do not want to create that suspicion. So just get right\nto the point.\n4. Write clearly. That's easier said than done, and hard to make operational. But\nyou can make a first step by writing short sentences, avoiding page-long\nparagraphs, and being careful to signal transitions. Operationally: If a sentence\ngoes on for more than (say) 5 lines, find a way to divide it up; if a paragraph goes\non for more than 20 lines, find a way to divide it up; if your paper falls into\nsections, make sure to include a sentence or two of connective tissue between\nthe sections. Moreover, put things as simply as you can. Writing philosophy does\nnot require elaborate formulations, esoteric words, purple prose, neologisms, or\npolysyllabophilia. In a poetry course, things would be different, but in this course,\n\nyour writing should focus readers' attention on the ideas you wish to express, not\nto the words you have chosen to express those ideas.\n5. Do not make the writing boring and clumsy, even if it is clear. Introduce some\nstylistic variety. For example, do not start every sentence with the subject.\nMoreover, stay away from passive constructions: instead of \"The wheel was\ninvented by Joe,\" why not: \"Joe invented the wheel.\" Do not have too many\nsentences that begin \"It is...\" or \"There is....\" Though such constructions are\nsometimes appropriate, overusing them slows things down. Avoid long strings of\nprepositional clauses. And try not to repeat the same words (unless, by repeating\nthe same words, you are aiming at emphasis).\n6. Support assertions. When you attribute views to the person whose ideas you\nare addressing, indicate the evidence for the attribution by noting relevant\npassages. But you need not include quotations. As a general rule, you should\nonly quote a passage if the passage plays an important role in the paper (say, it\nis a passage that you will want to be able to refer back to at various points in the\nargument), or if you think that there is some controversy about whether the\nphilosopher actually held the view that you are attributing to him or her. Do not\nsubmit a paper that strings together lots of quotations.\n7. Take the views you are discussing seriously. The philosophers we are reading\nare not fools. If, as you describe the relevant parts of their views, you find\nyourself attributing foolish views to them, assume you have misinterpreted.\n(Perhaps you have not. But treat \"misinterpretation\" as the default setting.) One\nstrategy for taking a view seriously is to \"argue against yourself\": ask yourself\nhow the philosopher you are criticizing would respond to your criticism. Try to get\n\"inside\" the conception you are discussing; develop a sense of its internal\nintegrity, and see if you are able to understand how someone (who is neither a\nmoron nor a sociopath) might have come to hold the views in question. The\nbooks and articles we are reading are the product of sustained reflection, over a\nlong period. The authors often distributed drafts of their manuscripts to other\npeople, and then tried to incorporate responses to the objections they received.\nThe result is not that their views are right, or genuinely coherent, or nice. But you\ncan be sure that they have greater depth and coherence than you may suspect\non first reading.\n8. When you finish writing, read your paper out loud. Writing that does not sound\nright will not read right.\nApplying these rules of thumb will require that you spend some time editing your\npapers after writing a first draft. But the additional time will be worth it. Your\npapers for this course will be better than they would otherwise be, and you will\neventually start to edit as you write.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.218J / WGS.170J Identity and Difference\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21A_218JS10_tips.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-218j-identity-and-difference-spring-2010/d05515af0fb12619bd88ae7a0cb57bd1_MIT21A_218JS10_tips.pdf",
      "content": "A few points about writing assignments:\n1.\nPapers will be handed back one week after you hand them in, so if you ask for an\nextension, the entire process will be extended.\n2.\nYour revision is due a week after you get your first draft back. If scheduling with the\nwriting tutor becomes difficult, let me know and we'll extend the deadline. You must tell\nme the new deadline you are requesting.\n3.\nA \"first draft\" of a paper does NOT mean that you can hand in a \"rough\" draft. It needs\nto be as finished as you can possibly make it, which includes proper citations, date, title,\nnumbered pages (!!), correct spelling, logical structure, introduction and conclusions, etc.,\netc.\n4.\nIf you have questions about proper citation practice, consult any of our readings.\n5.\nAvoid long quotes. If you must include one, any quote that takes up more than 5 lines\nneeds to be indented. But far more preferable is to paraphrase, which is perfectly fine so\nlong as you cite your source. For example:\nJohnson notes that the quick brown fox jumped over the lazy poodle, and goes on\nto say that colorless green ideas sleep peacefully (1987: 16).\n7.\nWhen writing your papers, create a reader in your mind and then write addressing that\nperson. Your Aunt Sue or your Uncle Bob are good candidates. This imagined reader\nshould be someone you have to explain a fair amount to. Keeping that reader in mind\nwill help you to include important background information. Do NOT write thinking of\nme as your reader.\n6.\nRead \"Written Assignments--Rules of Thumb\" and \"How to Write a Paper\" on the class\nwebsite.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.218J / WGS.170J Identity and Difference\nSpring 2010\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}