{
  "course_name": "Immaterial Limits: Process and Duration",
  "course_description": "This studio proposes to engage tectonics as a material process. By exploring transformation, indeterminacy and mutability inherent in material and landscape processes, students will be challenged to engage notions of duration as a design strategy for architecture and urbanism. While the second law of thermodynamics states that the material universe tends toward a state of increasing disorder, architects build and construct in opposition to these forces. Attempting to delay the processes of disorder, decay and collapse, tectonics is often seen as the embodied expression of an arrested moment the finite resolution of the building process. Yet the processes that enable and disable architecture extend beyond any arrested moment.\nA more detailed description can be found in the syllabus section.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Engineering",
    "Architectural History and Criticism",
    "Fine Arts",
    "Architecture",
    "Architectural Engineering",
    "Architectural History and Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 4 hour / session\n\nAbout This Course\n\nThis studio proposes to engage tectonics as a material process. By exploring transformation, indeterminacy and mutability inherent in material and landscape processes, students will be challenged to engage notions of duration as a design strategy for architecture and urbanism. While the second law of thermodynamics states that the material universe tends toward a state of increasing disorder, architects build and construct in opposition to these forces. Attempting to delay the processes of disorder, decay and collapse, tectonics is often seen as the embodied expression of an arrested moment the finite resolution of the building process. Yet the processes that enable and disable architecture extend beyond any arrested moment.\n\nWhile the design of materials is not new, the recent evolution of mutant materials and fabrication technologies has created a material culture pregnant with possibilities. Plastics can be endowed with the properties of glass, wood made to appear like fabric, and foams given the power of memory. Materials and their methods are multiplying while our inherited notions of material significance and signification are increasingly challenged. 'Truth' in materials or in their methods of construction is no longer (and arguably never was) an absolute concept.\n\nHighlighting the multiple states of materials (raw, finished, decomposed) and new methods for fabrication (CAD-CAM, CNC, rapid prototyping), this studio seeks to understand the processes that form, deform and ultimately dematerialize built matter. This studio will explore the limits of materiality and immateriality to engage a tectonics of temporal change, transformation, and succession. Materials will be treated, not merely as finishes, but as critical points of departure for investigating new spatial possibilities. Students will design and fabricate full scale material constructs in order to explore a material's inherent properties. Investigations of casting, stressing, weathering, eroding, corroding, etc. will be part of the design process.\n\nStudents will translate these studies into critical architectural propositions for the Stearn's Quarry site in Chicago. Dating back 400 million years, the site was once a part of an ancient reef near the equator before the shift in the North American tectonic plate. Rich in calcium carbonate, the 23 acre Stearns quarry site was excavated from 1936 to 1970 to a depth of 350 feet. Located within Chicago's city grid, the quarry supplied the dolomite used to line the cities waterways and yielded an unprecedented amount of fossils from the Silurian Age. Since 1970 the quarry has been used as a dumping site for incinerator ash, and construction debris. Designated a 'Superfund Site' due to concerns over its toxicity, the city of Chicago is currently examining the reprogramming, reuse and reclamation of the site. Students will design a series of architectural interventions and public interfaces to enable, support and house the geological and ecological processes and artifacts of the site.\n\nThe Stearns Quarry site presents a unique opportunity to engage temporal change, transformation, adaptation and succession at the scale of the building, the city and the landscape. By engaging the materials on the site in a process of excavation, recycling, and recovery, the studio addresses a prolonged understanding of architecture, one that acknowledges duration within the framework of architectural design. Engaged in the unpredictable interface of nature, history, construction and imagination, we will attempt to arrest, reverse, stretch, divert, adhere and accelerate the temporal qualities of architecture. The studio hopes to arrive at a strategy of reworking the landscape, rather than a finite architectural object- a shift from product to process. In doing so, it seeks to unleash urban scaled material effects within the deep surface of the landscape.\n\nProblems\n\nProblem 1: Out of Joint (\nPDF\n)\n\nProblem 2: Duration and Depth (\nPDF\n)\n\nProblem 3: Extreme Geology Center (\nPDF\n)",
  "files": [
    {
      "category": "Resource",
      "title": "Measures and Scapes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-143-immaterial-limits-process-and-duration-fall-2002/a1ab084af91ee2c9a60c57b84b6c8726_project1.pdf",
      "content": "MEASURES AND SCAPES\nThe purpose of this assignment is threefold:\n1. To develop conceptual skills through research and analysis.\n2. To explore the depth of seeing, marking and recording.\n3. To expand the vocabulary and tools the enable design production.\nPart A: exactitude in SCIENCE Documentation and Analysis\nEach student must select one of the sets if measurement devices:\n-\nChains and Tapes, Surveyor's Rule, Gunter scale or rule\n-\nHodometer, Waywiser, Surveyor's Wheel, Pedometer\n-\nGroma, Surveyors Cross, Optical Square\n-\nQuadrant, Altazimuth Quadrant, Astronomical Quadrant\n-\nCircumferentor, Graphometer\n-\nLevel, Spirit Level, Balance Level, Water Level\n-\nCompass, Azimuth compass\n-\nPhotogrammetry, Photographic surveying\n-\nTrigonometer, Triangulation Instrument\n-\nSurveying Sextant\n-\nTheodolite, Altazimuth Theodolite\n-\nMural Arc, Mural Quadrant\n-\nSundial, Universal Equinoctial Ring Dial, Hour Glass\n-\nCross Staff, Backstaff, Mariner's Astrolab\nEach student must locate, acquire, analyze and document their analysis of the object.\nIn order to analyze the object, students are encouraged to occupy, disassemble, take apart,\nunfold, lay flat, slice, dice, de-laminate, reoccupy, or excavate their objects.\nStudents are asked to consider: How the object is informed by the body? How do pieces\ncome together and why? How is material and structure employed to protect, empower,\ngive form to, soften, harden, reinforce, obscure, interface with, reveal and enclose the\nbody in space? How do seams, surfaces, adjacencies, overlaps, thresholds, closures,\norifices, profiles, transitions, fasteners find articulation and create formal/ spatial\ninterrelationships.\nThe methods and means of documenting the analysis should be determined on an\nindividual basis according to the nature of the speculation.\nSuggested Final Requirement: Presentable, provocative, coherent and rigorous\ndocumentation of the provocative, coherent and rigorous analysis.\n\nPart B: reFABRICATIONS Transformation\nStudents are asked to spawn from their analysis the transformation of their object by re-\nmaterializing it in materiality, identity and construction. Students must choose one or two\nmaterials from the following list for their transformations.\nLead\nSteel\nCopper\nAluminum\nWood\nPaper\nInterfacing\nCloth\nConcrete\nPlaster\nPoured Rubber\nResin\nFiber glass\nShape Memory Foam\nSalt Block\nLatex\nVinyl\nWire\nNote: Some of these materials are hazardous to work with. Students will be responsible\nfor researching the properties of their materials and taking adequate precautions for\ntheir health and safety as well as the health and safety of others. Students working with\nlead, resin, and fiber glass should take particular precautions. Students working with\nplaster and concrete should not\ndo their pours in the Studio as both plaster and concrete dust is external damaging to the\ncomputers, plotters and printers.\nThe transformed object should not replicate the initial object in a new material, instead it\nshould evolve beyond and deviate from its predecessor into its own. While the\ntransformed object may have traces of the original object imbedded within its matrices, it\nmust be in a state of becoming something other. Consider this transformation study\nbetween body and wall.\n\nThe transformed object must :\n-\nInclude a unit of measurement related to the body part studied\n-\nBe able to be taken apart and reassembled\n-\nBe well crafted, paying considerable attention to joinery and hinges\n-\nConsider 'Hardware' integral to the object as oppose to superfluous\n-\nNot use glue anywhere\n-\nLEC #\nTOPIC\nIssue Problem 1\nNotebook on Cities and Clothes, Wim\nWenders\nDesk Crits\nDesk Crits\nInformal Group Crits\nDesk Crits and Demonstration\nTrain Crits\nNYC Fieldtrip\nNYC Fieldtrip\nDesk Crits\nDesk Crits\nInformal internal Pin-up in threes\nIMPORTANT DATES\nProject 1, Part A DUE\nLeave for NYC Fieldtrip\nProject 1 REVIEW, Part A and\nB;\nPreliminary Wall proposal for\nProject 2"
    },
    {
      "category": "Resource",
      "title": "Student Projects",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-143-immaterial-limits-process-and-duration-fall-2002/496b01608f2fb26a4662e5188b3ef2bc_projectpage.pdf",
      "content": "Aaron Wittkamper\nCharles Austin\nJohn Braddock"
    },
    {
      "category": "Resource",
      "title": "Problem 2: Duration and Depth: Site Strategies in 3 Dimension/ De-familiarization in Flat",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-143-immaterial-limits-process-and-duration-fall-2002/aa06bab22a6459a393973d2289f4a349_project2.pdf",
      "content": "I M M AT E R I A L L I M I T S\nL 2\nLEVEL 2 - FALL 2002\nT, R, F\nSCHEDULE\nOctober\nModels, atleast two versions due\nOctuber\n3 Models, Set 1 due (Issue Program specific\nsquare footages)\nOctober\nLevel 2 Forum, Trajectory 2 posted\nOctober\n3 Models, Set 2 due\nOctober\nDefamiliarization Representations Due.\nScale jump to 1\"=1/32\" for sketch model\ninvestigation of specific areas.\nNovember\nPin- Up- 2 Models due in sketch model form\nat 1\"=1/32\"\nNovember\nScale jump to 1\" = 1/8\" Models and Drawings\nNovember\nLecture by Brigitte Shim\nNovember\nDesk crits\nNovember\nMid Review\nNote: Final Review is scheduled for December, 2002.\nPROBLEM 2:\nDURATION AND DEPTH\nSITE STRATEGIES IN 3 DIMENSION/ DE-FAMILIARIZATION IN FLAT\nYou are asked to engage the schematic design process with two parrallel studies which\noperate against each other to create a critical friction of ideas as a catalyst for designing on\nthis site.\nTrajectory 1:\nYou are asked to create a series of models at 1:250 scale which investigate a strategy for\nyour design intervention as a series of phases that engage the notion of duration and the\nconstruction process. These models must be distilled from the conceptual ideas of the last\nexcercise but are not bound to its material or formal characteristics, though in many cases,\nthis may be helpful. The models must speculate on the design intervention at a minimum\nof three time intervals. Think about the process of construction and land removal as inte-\ngral to the design intervention. You must remove atleast 30 Percent of the land fill in the\nfirst interval, 50 Percent in the second and 100 Percent in the third. The pattern, order,\nmethod, and orientation of the excavation is up to you and must participate as a compo-\nnent of the design idea.\nSet 1:\nThe first set of three models must create a conceptual site, built not as one would repre-\nsent dirt or earth, but as one would represent your conceptual approach to your site based\non your previous explorations. (ie. layers and layers of plates with weak hinges, wrinkled\nsurfaces, composite solids, cast mass, a web on tension elements). Model 1 Set 1 is the\nsite as a 100% filled condition. Model 2 and 3 Set 1 creates a series of manipulations\nbased on your imposed strategy and design idea within the parameters of the material\nproperties of your Model 1 Set 1.\nSet 2:\nThe second set of three models should tranform your conceptual site models as an\napproach of intervention as a more normative proposition of removing the earth on the site\nand inserting your architectural intervention(s) in relation to your new landscape(s). The in\ndoor components of the program will total 15,000 square feet and the outdoor components\nof your program will total a minimum of 50,000 square feet. Remember, you are now\nMaking Site as well as Making Architecture.\nTrajectory 2:\nYou are asked to constantly defamiliarize yourself from the production of your own artifacts\nthrough a series of manipulated representations. You are asked to choose a consistent\nmethod for this defamiliarization as a Documentary Log of your process. The method must\ntake a digital photograph of your image and defamiliarize it through one filtering process\n(ie. high contrast black and white, blurr, invert etc.) You are bound to the process you\nselect you think about how you want to re-represent your project back to yourself through\nthe whole project. This should have a strong relation to your conceptual approach to the\ndesign of either the last project or to the next project. You are required to output this flat\nrepresentation as a series of images that are 4\" x 4\" beginning with your last project.\nMinimum of 5 shots per phase, that should be organize initially as a horizontal band."
    },
    {
      "category": "Resource",
      "title": "Problem 3: Extreme Geology Center: Program",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-143-immaterial-limits-process-and-duration-fall-2002/fb01331c87cacfa26123bc94176532b4_project3.pdf",
      "content": "I M M AT E R I A L L I M I T S\nL 2\nLEVEL 2 - FALL 2002\nT, R, F\nFINAL REQUIREMENTS:\n1:100 (or equivalent) model at scale of the whole site/ old one\nwill work if accurate\n1:100 (or 250) site drawing with context (surrounding site),\nand phasing of project\nDiagrams of:\ncirculation\nprogram/ and or/ spatial strategy\n1/8\" : 1'-0\" critical plans\n1/8\" : 1'-0\" critical longitudinal section\n1/8\" : 1'-0\" critical transverse section(s)\n1/8 ; 1 -0 models\n1/4\" or 1/2 : 1 -0 sectional model of envelope+structure\n1 perspective/ axon or collage of intervention in the site\n1 perspective of inside architecture looking out.\nPROBLEM 3:\nEXTREME GEOLOGY CENTER\nPROGRAM\nThe Extreme Geology Center is a Museum, Education, and Recreation facility, offering its\nvisitors a unique experience of geology, environmental science and recreation. The center\nwill tell the story of the 4.5 billion year history of the Earth, focusing particularly on the his-\ntory and current evolution of the Stearn's Quarry site as well as the greater Chicago Area,\nwhile providing a large scale urban amenity to Chicago.\nThe Museum of Geology is a teaching and research facility with collections of more than\n50,000 vertebrate fossils and 2,000 minerals and the largest geological cross section of\nChicago (50 feet in length). While its acquisitions and staff are modest in size at the\nmoment, it is speculated that the museum facility will expand over time. Planning its\nexpansion is part of the design process. Furthermore, the recreational facility is not only\nseen as a vital component that will bring the public to the site and museum, but as a pro-\ngram that will help subsidize the cost of maintaining the museum facility.\nThe four major activities of the complex include:\nAcquisition of specimens done principally through field expeditions to collect specimens\nand attendant data. These data provide the placement of specimens in a geologic context,\nrock type, position in the sequence of rocks seen in the rocks of the region, and the rela\ntionship of specimens to one another.\nCuration of acquisitions starts with the preservation, preparation and conservation of spec\nimens. Detailed notes and documentation are kept on the location of where the specimen\nwas collected and the methods used to preserve and conserve the specimen.\nEducation involves taking the complexities of research findings and presenting them to a\nvariety of public groups.\nRecreation involves a wide array of possibilities that re-acquaint a larger population to the\nearth they inhabit through sport and leisure.\nSQUARE FOOTAGES:\nIndoor Galleries- total 12,000 square feet\nHistorical excavation and mining instruments\n2,000 square feet (minimum)\nStones and Land Processes\n5,000 square feet (minimum)\nOres\n3,000 square feet (minimum)\nFossils\n2,000 square feet (minimum)\nOutdoor Galleries- 10,000 square feet\nCafe- 2,000 square feet\nRest Rooms- As necessary\nLibrary- 5,000 square feet\nMuseum Shop- 2,000 square feet\nIndoor Auditorium- to seat 50\nOutdoor Auditorium- to seat 100\nResearch Classrooms- 4,000 square feet\nAdministrative Offices- 4,000 square feet\nIndoor Rock Climbing Wall- 2,000 square feet\nOutdoor Recreation: (may choose any or some of the following) -total approx. 80,000 square feet\nRock-Climbing, In-line Skating, Skateboarding, Mountain Biking, Ski Jumping, Bungee\nJumping, Sky Diving, Jogging, Walking, Sun-bathing, Hiking"
    }
  ]
}