{
  "course_name": "Indistinguishable From... Magic as Interface, Technology, and Tradition",
  "course_description": "No description found.",
  "topics": [
    "Fine Arts",
    "Game Design",
    "Performance Arts",
    "Visual Arts",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Science",
    "Biology",
    "Neuroscience",
    "Fine Arts",
    "Game Design",
    "Performance Arts",
    "Visual Arts",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Science",
    "Biology",
    "Neuroscience"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Overview\n\nWhen Aleister Crowley defined magic as \"the Science and Art of causing Change to occur in conformity with Will,\" he might as easily have been describing technology. In fact, \"magic\" is still the word we use to encompass the wonders of a new technology before it becomes ubiquitous.\n\nFrom Neolithic ceremonies to Las Vegas stage shows, \"magic\" describes a long tradition of using technology, ritual, and performance to create wonder. As 21\nst\ncentury technologists there's still a lot we can learn from this tradition. Engineering illusions requires close attention to the limits of human perception, disciplined practice of the art of showmanship, and subtle use of the crafts of deception--skills that are just as relevant to contemporary technology demos as they were to 19\nth\ncentury stage illusions.\n\nFurther, magic is one of the central metaphors people use to understand the technology we build. From install wizards to voice commands and background daemons, the cultural tropes of magic permeate user interface design. Understanding the traditions and vocabularies behind these tropes can help us produce interfaces that use magic to empower users rather than merely obscuring their function.\n\nWith a focus on the creation of functional prototypes and practicing real magical crafts, this class combines theatrical illusion, game design, sleight of hand, machine learning, camouflage, and neuroscience to explore how ideas from ancient magic and modern stage illusion can inform cutting edge technology.\n\nGuest lecturers and representatives of member companies will contribute to select project critiques. Requires regular reading, discussion, practicing magic tricks, design exercises, a midterm project and final project.\n\nPrerequisites\n\nMIT students were required to obtain permission from the instructors.\n\nMaterials for Assignments\n\nBerglas, Marvin.\n110 Amazing Magic Tricks with Everyday Objects\n. Marvin's Magic.\n\nPogue, David.\nMagic for Dummies\n. For Dummies, 1998. ISBN: 9780764551017.\n\nWizards RPG Team.\nDungeons and Dragons Player's Handbook\n. 5th ed. Wizards of the Coast, 2014. ISBN: 9780786965601.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n30%\n\nTrick++ Assignment\n\n15%\n\nMidterm Project\n\n15%\n\nFinal Project\n\n40%",
  "files": [
    {
      "category": "Resource",
      "title": "Creating a Dungeons and Dragons Character",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-s66-indistinguishable-from-magic-as-interface-technology-and-tradition-spring-2015/d87f93de50d3896d72f502acabe6bbe6_MITMAS_S66S15_CreatngDD.pdf",
      "content": "MAS.S66 Indistinguishable From... Magic as Interface, Technology, and\nTradition\n\nCreating a Dungeons and Dragons Character\nNote: this assignment will provide you with a series of writing prompts as it goes.\n\n\"You are sitting in a tavern. You look down and see a D&D homework assignment on\nthe table...\"\n\nHello and welcome to the D&D homework assignment.\nIn this assignment you're going to learn about how role-playing games depict\ncharacters and events in magical worlds using numbers. You're going to conduct a\nseries of exercises meant to give you a sense for how these kinds of games use\nnumbers to make the fantasy they depict feel real for the player. Specifically, you're\ngoing to roll a few D&D characters.\n\nIf you've never played D&D (or any other role playing game) before that's no\nproblem. This assignment will walk you through everything you need to do. If\nyou've played D&D before, that's great. Still go through these exercises while\nthinking specifically about how the game is depicting the story world using its\nnumerical systems.\n\nAn Example of Play\nFirst, though, let's start by reading this short description of play from Advanced\nDungeons and Dragons 2nd Edition.\n\nNotice how play chiefly proceeds in the form of an interactive story. The DM sets the\nscene, the players make choices, and the DM figures out how those choices affect the\nworld and what the outcomes are. Sometimes in the process of doing this the DM\nchecks various \"scores\" belonging to the players' characters or rolls dice.\n\nQuestion: How would you characterize the moments in this account in which\nstats are referenced or dice are rolled? What is happening in these moments?\nHow do they differ from the rest of the account? How do they differ from each\nother (that is, how are the stats lookups different from the dice rolls)?\n\nWrite a short answer to this. It can just be a few sentences or even a short list of words.\n\nCreating Your First Character\nOK! Now that you have a basic sense of what playing D&D should look like let's start\nmoving you towards being ready to play.\n\nStart by downloading the Fifth Edition Character Sheet. Click \"Fifth Edition\nCharacter Sheets\" to download then use the file named \"DnD_5E_CharacterSheet -\nForm Fillable.pdf\". You'll also need the Dungeons and Dragons Player's Handbook,\nFifth Edition.\n\nPrint out the character sheet or open it in a PDF editor that will allow you to fill in\nthe form.\n\nThe first place we're going to focus is your character's attributes. Those are listed\nalong the left side of the character sheet and they are (definitions courtesy of\nWikipedia):\n\n-\nStrength is the ability of an animal or human to exert force on physical\nobjects using muscles\n-\nDexterity is the coordination of small muscle movements--usually involving\nthe synchronization of hands and fingers--with the eyes. Fine motor skills.\n-\nConstitution is a general state of health and well-being and, more\nspecifically, the ability to perform aspects of sports or occupations. High\nconstitution is generally achieved through correct nutrition, exercise,\nhygiene and rest.\n-\nIntelligence the ability to perceive and/or retain knowledge or information\nand apply it to itself or other instances of knowledge or information creating\nmodels about the world. Related to capacity for logic, abstract thought,\nunderstanding, self-awareness, communication, learning, emotional\nknowledge, memory, planning, creativity and problem solving.\n-\nWisdom is the ability to think and act using knowledge, experience,\nunderstanding, common sense, and insight.\n-\nCharisma compelling attractiveness or charm that can inspire devotion in\nothers.\n\nThe characters we create are going to start off with scores for each of these\nattributes. The scores will range from three to 18. Typically these scores are created\nby rolling dice (usually three or four six-sided die depending on the specific version\nof the game referred to as 3d6 or 4d6, respectively).\n\nA higher score means more ability in that attribute. A character with a higher\nstrength score is stronger, one with a higher constitution is in better shape, etc. If\nyou want to get a vivid sense for what a particular score might mean in practice read\nthis: D&D Stats in Simple Language (don't worry about the modifiers and other\ntechnical details in there; for now just pay attention to the descriptions and try to\nimagine a real person with those qualities).\n\nYou can think of your character's attribute as their heritable traits. Your attributes\nare what you're born with. Everything else gets built on top of them.\n\nFor your very first character, you're going to use a set of numbers I came up with.\nThese are special magical numbers. They are:\n\n16, 6, 11, 9, 14, 12\n\nAssign each one of these numbers to one of the six character attributes.\n\nImagine what kind of person you've just created based on these attributes.\nWhat personality is created by combining these attributes? Do you know\nanyone in real life who matches this mix of characteristics? How would you\ndescribe someone like this to a friend? What jobs would they thrive in? What\nare some situations in which they'd be really out of place?\n\nWrite a paragraph describing your character as if they were a real person. Pretend\nyou're describing a friend or professor of yours to someone you know.\n\nNow move the numbers around and do this again. Try to create a character\nwho's very different from your first character without just being the exact\ninverse.\n\nWrite a paragraph describing this second character. Would your two characters get\nalong? How would they interact? If they were on a team would they complement each\nother? Would they be able to collaborate?\n\nPick one of these two characters that you'd like to proceed with through the next\nstages (or heck do all the stages for both, it really won't take long).\n\nCharacter Classes: Give Your Character a Job\nNow that you know your character's attributes, the next step is to give them a\n\"Character Class\". This is the D&D term for what is basically your profession. So far\nas things like \"entering a battle rage\" or being \"bound to a sacred oath\" can be a\nprofession.\n\nTake a look at Chapter 3 of the Player's Handbook. On page 39 it lists the 12\ncharacter classes included in 5th edition D&D along with a short description of each\n(don't worry about the other columns for now; in fact ignore them, they are wrong\nand evil). The rest of that chapter also includes more details about those classes if\nyou want to read up on them.\n\nNow, the traditional way to pick a class is to match it to your characters best\nattributes. High strength score? You're a Fighter or a Barbarian? High dexterity?\nYou're a Rogue. This is what shows up under the \"Primary Ability\" column in that\ntable. But, to this, I say: bah! This method of coming up with characters is both\nboring and highly unrealistic. Is everyone you've ever met perfectly well-suited to\ntheir job? Do they each have exactly the traits you'd hope for in their given line-of-\nwork and no mismatches? Have you ever had a stupid or uncharismatic teacher?\nSeen a musician who really believed in themselves and meant well but had no\ntalent? Heard of a police officer or soldier who was weak or naive? Of course, these\nkinds of \"contradictions\" happen all the time.\n\nIn addition to missing most of the complexity of life, the traditional way of creating\ncharacters also makes for boring and predictable role playing. Some of the most fun\ncharacters to play are the ones whose attributes are surprising mismatches for their\nclasses. Imagine a Rogue with low dexterity and charisma, but high intelligence and\nwisdom. Maybe they grew up in desperate circumstances and so even though they\nweren't cut out to be a criminal they had to use their wits and street smarts to\nsurvive and so became a hustler and con artist instead of a sneak thief. Or imagine a\nWizard with incredibly low wisdom and intelligence but very high charisma and\ndexterity. What if they actually can't use magic, but convince people around them\nthey can by sheer force of personality and a lot of skill at sleight of hand? Sound like\nanyone we know?\n\nNotice how these combinations of attributes and classes got me started telling a\nstory. I'm immediately imagining a bit of the character's background, personality,\nand the kinds of actions they might take. This is exactly what we want to happen\nduring the character creation process. It should start to develop its own momentum,\nas if you were staring to describe a real interesting person. Each choice you make\nshould fit in with what you already know about your character, making them more\nwell-rounded. You should feel free to make creative choices, but also constrained by\nthe choices you've already made, compelled to come up with a story that makes\nyour new choices feel consistent with your previous ones.\n\nSelect a class for your character. While considering options try imagining a\nperson with your character's attributes in each of the 12 classes. How would\nthey have ended up doing that job? How would they make it work even if it\nmight seem wildly inappropriate on the surface?\n\nWrite down your character's profession on your character sheet. Also write a short\nparagraph explaining how their profession matches up with their attributes. Are they\ngood at it? Were they a natural who always knew this was what they wanted to do?\nWere they forced into it by circumstance? Was it the result of a weird religious calling?\nDid they have some other prior life or career before doing this? Make up anything you\ncan to make a coherent story out of these two aspects of your character.\n\nPick Your Race (Uh, Creepy)\nNext comes one of the worst and one of the best parts of D&D's character system.\nD&D's Race system is, frankly, kind of gross. The idea that a person's race tells you\nsomething about their character is a sign of the racist elements in the fantasy\ntradition before and around D&D. If you read J. R. R. Tolkein, it's difficult to escape\nthe conclusion that the tall pale people from the north are good and the dark ugly\npeople from the south are bad. This reproduces the attitudes of the colonial era in\nwhich Tolkein came of age and it's one of the worst aspects of his legacy (and that of\nmany other contemporary and prior fantasy writers).\n\nAt its best, if you approach it from a very generous mindset, modern D&D tries to\nuse the Race system to mean something more like cultural background than racial\nidentity. You can soften the racism of deriving personality traits directly from a\ncharacter's race by imagining that these are generalized descriptions of the\nmainstream societal values of each of these (partially geographically distinct) races.\nDwarves are good at building things not because of some essential genetic racial\nqualities, but because they are raised in a culture that values building and passes on\na certain set of traditional practices around it.\n\nIf you read Chapter 2 of the Player's Handbook, though, you'll see they mean race in\nthe more troubling sense I'm trying to avoid here. They list nine races:\n\n-\nDwarf\n-\nElf\n-\nHalfling\n-\nHuman\n-\nDragonborn\n-\nGnome\n-\nHalf-Elf\n-\nHalf-Orc\n-\nTiefling\n\nLike we did with the classes, I'm going to encourage you to take a more creative and\ninterpretive approach to selecting your race than the official rules suggest.\n\nIs your character highly intelligent but weak, somewhat unworldly? Consider\nmaking them a dwarf. What would it have been like to grow up as the one dwarf\nwho loved books? How would being an outsider from that kind of culture shape\nyour character's personality? Did they always wish they could fit in? Or were they\nmore of a rebel who grew to resent and hate the mainstream of their community's\nculture?\n\nAgain, you don't only have to go for straight contrast like this, just find something\nthat you find makes an interesting story.\n\nAs you read through the race descriptions, try each one on for size. How would\nthey fit with the character you've been building? What story would you make\nup to explain your character's experience growing up within this culture?\nMaybe they were emigrants so they didn't grow up amongst too many people\nof their kind. How would that change their attitudes to their race's\nmainstream values? Would they romanticize them or be embarrassed of the\ntraits that made them different from their surroundings?\n\nWrite down your character's race on your character sheet. Also write a short\nparagraph adding to your character's growing biography to incorporate their race.\nTry to sketch the outlines of their relationship to the \"mainstream\" of their race\n\ncommunity. Did they grow up traditionally for their race or not? What is their\nrelationship to those traditions, positive or negative?\n\nAlignment\nWhere D&D's race system is somewhat yucky, its alignment system is awesome.\nOnce you learn it you'll find yourself applying to real people. The alignment system\nconsists of two axes: one ethical and one moral.\n\nThe ethical axis ranges between lawful and chaotic. According to 3rd Edition, \"Law\nimplies honor, trustworthiness, obedience to authority, and reliability.\" Whereas\n\"chaos implies freedom, adaptability, and flexibility.\" The moral axis ranges between\ngood and evil, \"Good implies altruism, respect for life, and a concern for the dignity\nof sentient beings.\" Whereas \"Evil implies harming, oppressing, and killing others.\"\n\nCombining these two into a 3×3 grid yields the following possibilities:\n\nLawful Good Neutral Good Chaotic Good\nLawful Neutral (True) Neutral Chaotic Neutral\nLawful Evil Neutral Evil Chaotic Evil\n\nTry to think of one or two examples of well-known historical, public, or\nfictional figures who match each category.\n\nWrite down the examples of each category that you came up with. It will be interesting\nto see how much we as a class overlap here. Can you come up with a realistic example\nfor Chaotic Evil? It's probably the hardest one...\n\nNow select an alignment for your character. As should be familiar by now,\nstart by exploring each option and imagining how you'd incorporate it into the\nexisting portrait you've been building for your character. What stories can you\ncome up with to make them make sense? Are there any alignments that seem\nto match particularly well with your character's attributes, class, and\nrelationship to their race?\n\nWrite down you character's alignment on your character sheet and write a short\nparagraph explaining how that alignment fits into their wider biography.\n\nFill in the Details\nYou've basically completed the important parts of character creation from the role-\nplaying and storytelling perspective. You should have a pretty good sense of who\nyour character is at this point. But there's still a lot to fill in, particularly as it relates\nto wrapping the storytelling choices you've made with all of the numbers that are\nnecessary to make your character playable within the systems of D&D.\n\nYou've written all this great back story about your character, but haven't filled in\nmuch of this sheet at all. Now's the time to do that.\n\nRather than reproducing the instructions from the Player's Handbook here, I'm just\ngoing to send you there to fill in the rest of the details. Refer to the sections of the\nmanual that are relevant to your class and race in particular to see lots of the\nnumbers that you need. If you're a magic user (Cleric, Sorcerer, Warlock, or Wizard)\nyou'll also need to choose spells from the appropriate section of Part 3 of the\nPlayer's Handbook.\n\nYou'll also need to select some basic gear for your character (see Chapter 5).\n\nNote: many of the steps in the Player's Handbook will call for dice rolling. If you see an\nattribute listed as, for example, the Druid is listed as having \"Hit Dice: 1d8 per Druid\nlevel\", that means you need to generate a random number between 1 and 8. If you\nalready have access to an 8-sided die you probably don't need me to explain this to\nyou. If not, feel free to use any programming language or computational tool of choice.\nOr, for efficiency, Wizards of the Coast's online dice roller.\n\nAs you go through each of these steps try as much as you can to root your decisions\nin your understanding of who your character is.\n\nNotice how the Handbook uses numbers to represent the differences between\nparts of its world. It tells you to add and subtract from various character\nattributes when you select a class and a race. What are those changes meant to\nrepresent? Do they match the story you're telling about you're character or do\nthey water it down?\n\nWrite down one or two examples of these kinds of numerical changes the Handbook\nsuggested that struck you as a particularly bad match for the character you were\ntrying to create. Document them and then don't do them! Don't let the Handbook push\nyou into stereotype. Its purpose is to translate the character you want to play into\nnumbers that let that character interact in a structured way with other elements and\ncharacters in the shared world. It's just a starting point.\n\nAnd, finally, don't forget to give your character a name.\n\nFill out the rest of your character sheet using the instructions in the Player Handbook.\n\nCreate Some More Characters\nSince I spent almost 3000 words explaining how you should create a character the\nfirst time, you're probably not eager to go through it all again. But what follows are a\nseries of exercises to create stubs for characters. They're meant to help you to gain\nmore experience with how D&D's systems represent various characteristics of\npeople. You can do each of these relatively quickly, just writing down a quick set of\nnumbers, a class, a race, and a couple sentence biographical sketch for each (where\nappropriate).\n\nRoll a random character using D&D's suggested method. For each character\nattribute, roll 4d6 (a six-sided die four times) and discard the lowest die. Add the\nother three together to produce the attribute score. Once you've filled in all six\nattributes, select a class, race, and alignment, building a story about your character\nas you go.\n\nHow was this process different from creating your main character before?\nHow did the different distribution of the numbers you got for attributes\nchange the process of coming up with the character's story.\n\nWrite down your character's attributes, class, race, alignment, and background sketch.\nAlso write down some notes about how this time was different from last time. Was it\neasier or harder to come up with a story? Why?\n\nNow pick two people from the following list:\n\n-\nSailor Moon\n-\nRon Weasley\n-\nLady Gaga\n-\nStarlord from Guardians of the Galaxy\n-\nGenghis Khan\n-\nSerena Williams\n-\nMartin Luther King, Jr.\n-\nTina Fey\n-\nThe Bride (from Kill Bill)\n-\nNeil Gershenfeld\n-\nWolverine\n\nFor each one that you pick, write down what you think their strength,\ncharisma, wisdom, intelligence, dexterity, and constitutions scores are. What's\nthe closest class to what they do in real life? What race's traditions or\naesthetic matches them? What alignment are they?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nMAS.S66 Indistinguishable From...Magic as Interface, Technology, and Tradition\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Creating a Dungeons and Dragons Character",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-s66-indistinguishable-from-magic-as-interface-technology-and-tradition-spring-2015/add9e1345eff6d748ac3843b7f14d50c_MITMAS_S66S15_DDCharacter.pdf",
      "content": "MAS.S66 Indistinguishable From... Magic as Interface, Technology, and\nTradition\n\nCreating a Dungeons and Dragons Character\n\nExercise: Create 2 characters from different ability values\n\nCharacter 1 - Anna\n\n14 con | 12 str | 6 cha | 16 int | 11 dex | 9 wis\n\nAnna is a brilliant mechanical engineer, but her curt, snappy exterior makes people\nthink she's mean and insensitive, rather than just busy or impatient. She was at the\ntop of her class in college, although many resented her for it. Her few close friends\nwould say that she's actually a wonderful person, but she thinks her life is too busy\nto develop too many \"unnecessary\" relationships with others. She is very dedicated\nand focused on her job, and although she occasionally has existential crises about\nthe impact and value of her work, they always pass. She drinks a lot of coffee, and\nwas an avid fan of the BlackBerry.\n\nCharacter 2 - Charles\n\n16 con | 11 str | 14 cha | 9 int | 6 dex | 12 wis\n\nCharles is an easygoing, amiable high school senior who never quite recovered from\npuberty. He's clumsy and awkward, but is talkative and self-deprecating enough to\nmake light of it with anyone. He's a great public speaker and is an amateur stand-up\ncomedian. He's an insightful, dependable friend, even though he struggles to apply\nhimself in the real world or in situations where he has to focus and be productive.\nHe strongly believes in family values and patriotism, and he often volunteers in the\ncommunity. He's still not sure what he's going to do for college or a career, but he\ndoesn't want to be bored by a lot of academics.\n\nAnna and Charles wouldn't be friends, but they wouldn't clash either. Anna simply\nisn't invested in developing friendships, but isn't overtly mean, so their interaction\nwould depend on the circumstance. They'd never sit down for lunch together, but\nthey'd work together if necessary. Anna might get frustrated with Charles' lack of\ndrive but she'd pick up the slack like she's used to doing. After meeting, Charles\nwould walk away thinking Anna is a strong, independent woman, and Anna would\nwalk away thinking Charles is an idiot.\n\nChosen character - Charles Dorn\n\nClass - Bard\n\nCharles is a Bard. He was the youngest of all his siblings and it was clear from an\nearly age that he wasn't as analytical or ambitious. He realized in adolescence that\nhe wanted to be a Bard, but his parents insisted that he try to \"apply himself\" in\nsomething \"useful\". He respected his parents and gave it his best shot in school, but\nhe never understood the lofty ideals that they wanted him to pursue. After\nconvincing his parents that he would be a total failure, Charles left home to adopt a\nsimple, straightforward, happy life of a Bard specializing in comedic entertainment.\nMaking people happy makes Charles happy.\n\nRace - Human\n\nThe human race is diverse, but it is fraught with ambition, politics, and serious\ntalking. Charles doesn't like any of it. He prefers not to trouble himself with drama,\nwhich isolated him as a child. His family was very aggressive, always trying to\nsqueeze value and capital out everything they could, and always reaching for the\nnext rung of the social ladder. So when Charles expressed to desire to follow that\ntrend, he was mocked by his community as a drifter, a loner, and a dimwit. In reality,\nhe just wanted to be content. He knew how to read people and make them laugh,\nand that's all he thought he needed.\n\nAlignment - Neutral Good\n\nCharles is kindhearted, genuine individual, but he has no qualms about deviating\nfrom authority or disregarding standards. He didn't fit in with the society he grew\nup in, so he abandoned it without regrets. He tries to do the right thing, but sees no\nreason to go out of his way to do the legal thing.\n\nAlignment Characters\n\n-\nLawful Good - The Lone Ranger, Superman, most childhood heroes\n-\nNeutral Good - Forrest Gump\n-\nChaotic Good - Robin Hood\n-\nLawful Neutral - Claire Underwood\n-\nTrue Neutral - Beorn\n-\nChaotic Neutral - Sherlock Holmes, Ferris Bueller\n-\nLawful Evil - Darth Vader, most organized leader villains\n-\nNeutral Evil - Frank Underwood\n-\nChaotic Evil - Moriarty, The Joker, most psychopaths\n\nPick two people from the given list. For each one that you pick, write down\nwhat you think their strength, charisma, wisdom, intelligence, dexterity, and\nconstitutions scores are.\n\nStarlord:\n\n11 con | 12 str | 13 cha | 10 int | 9 dex | 9 wis\n\nSerena Williams:\n\n15 con | 14 str | 10 cha | 8 int | 16 dex | 9 wis\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nMAS.S66 Indistinguishable From...Magic as Interface, Technology, and Tradition\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}