{
  "course_name": "Information Exploration: Becoming a Savvy Scholar",
  "course_description": "This freshman course explores the scientific publication cycle, primary vs. secondary sources, and online and in-print bibliographic databases; how to search, find, evaluate, and cite information; indexing and abstracting; using special resources (e.g. patents) and “grey literature” (e.g. technical reports and conference proceedings); conducting Web searches; and constructing literature reviews.",
  "topics": [
    "Humanities",
    "Literature",
    "Academic Writing",
    "Humanities",
    "Literature",
    "Academic Writing"
  ],
  "syllabus_content": "This page includes a\nschedule\nof class sessions.\n\nCourse Meeting Times\n\nLectures: 1 session / week, 1 hour / session\n\nCourse Objectives\n\nAfter completing this course, students will:\n\nHave a better understanding of the research environment by\n\nunderstanding the scientific publication cycle and research process\n\nknowing the difference between various types of publications and when to use them\n\nbeing able to identify appropriate research tools for their coursework\n\nBecome effective researchers by\n\nhaving the ability to search online research tools efficiently\n\nbeing familiar with the MIT Libraries system and the Libraries Web page\n\nbeing able to critically evaluate information\n\nDevelop a scientific communication foundation by\n\nbeing able to cite sources appropriately and be aware of bibliographic management tools (e.g. RefWorks) as well as other help (e.g. Writing Center)\n\nbeing able to recognize the parts of a citation (source title, author, etc.) and what type of material is being cited (journal, book, conference proceedings, etc)\n\nrecognizing the purpose and value proper citations hold in the scholarly world\n\nAssignments\n\nStudents will complete 6 assignments throughout the semester, accompanied by research logs (see Course\nSchedule\nfor assignment dates). Assignments will be explained in detail during class. Students will also review a series of online tutorial modules that relate to class lectures and will give feedback on them. No tests or final exam.\n\nGrading\n\nFreshmen - Pass/No Record (Institute requirement for Pass: Performance at C level or better.)\n\nGrade Composition\n\nACTIVITIES\n\nPERCENTAGES\n\nAssignments\n\n30%\n\nModule Reviews\n\n30%\n\nResearch Logs\n\n30%\n\nClass Participation\n\n10%\n\nGrading Scale\n\nRANGES\n\nSCORES\n\n100 - 90%\n\nA (Pass)\n\n89 - 80%\n\nB (Pass)\n\n79 - 70%\n\nC (Pass)\n\n69% or Below\n\nD (No Record)\n\nAttendance\n\nAttendance and participation at each of the 13 class meetings is expected. If for some reason you can not attend a class, or if you must leave early, please notify the Instructor in advance.\n\nAbout this Course\n\nThis course is part of a project developed by staff of the MIT Libraries and Professor Donald Sadoway and funded by MIT's d'Arbeloff Fund for Excellence in Education. The project, titled \"Finding and Evaluating Information,\" is designed to introduce first year students to the scientific research process and provide them with the skill necessary to find, evaluate and use information successfully throughout their educational careers. The project consists of this course, 3.093, and the set of online tutorial modules that students will review and evaluate.\n\nSchedule\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nGoals of the Class\n\nWhat to Expect\n\nOverview of Assignments, Research Logs, Online Modules\n\nSelf Assessment\n\nScientific publication Cycle, and What it Means to you as a Student\n\nPrimary vs. Secondary Sources (e.g. Books and Barton)\n\nEvaluation of Information Sources\n\nAssignment 1: Literature Review 1 + Research Log due\n\nTutorial Module Review 1 due\n\nSpecific Primary Sources (e.g. Research Articles)\n\nHow this Fits into Your Scholarly Careers\n\nPeer Review\n\nPlagiarism in Research\n\nAssignment 2: Module Review 1A due\n\nSecondary Sources: Indexing and Abstracting Sources (Needed to Find Primary Sources)\n\nDemonstration of Vera, Specific Databases (Getting Started and Using and Creating Citations)\n\nAssignment 3: Literature Review 1 + Research Logs due\n\nTutorial Module Review 2 due\n\nDemonstration of Specific Databases: Inspec(r)/Compendex(r), Web of Science and What Makes it Different\n\nAssignment 4: Research Log due\n\nTutorial Module Review 2A due\n\nDatabase Searching - Tips and Tricks\n\nSearching for Review Articles Importing Citations into Software like RefWorks\n\nAssignment 5: Research Log due\n\nTutorial Module Review 3 due\n\nSecondary Sources - Handbooks and Encyclopedias\n\nAssignment 6: Research Log due\n\nTutorial Module Review 3A due\n\nMore Secondary Sources\n\nAssignment 7: Research Log due\n\nSpecial Resources (e.g. Patents) and Grey Literature (e.g. Technical Reports, Conference Proceedings)\n\nThe Free Web and Web Searching\n\nAssignment 8: Tutorial Module Review 4 due\n\nGroup Exercise: In-class Searching on Topics in Various Disciplines\n\nAssignment 9: Research Log due\n\nTutorial Module Review 4A due\n\nDiscussion of Literature Reviews, what they are and how they are Done\n\nStoryboarding Online Tutorial Modules\n\nAssignment 10: Literature Review 2 + Research Log due\n\nWrap up\n\nFeedback, Class Discussion on What was Learned, How to Improve for the Future\n\nSelf Assessment",
  "files": [
    {
      "category": "Assignment",
      "title": "assignment1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/306a525afd7d42e632e7335e72370d54_assignment1.pdf",
      "content": "3.093 Literature Review I Assignment\nDue September 19\n\nLiterature Survey:\nCutting Edge Materials Research\n\nFind at least five (no more than 10) sources on one of the following topics:\n\n-\nUse of DNA in solving crime\n-\nMedical uses of ceramics\n-\nMaterials for information storage\n-\nMetals for construction (e.g. bridges, tunnels)\n-\nAlternative fuels\n-\nAnother Topic (Must be approved by Prof. Sadoway or Angie Locknar)\n\nKeep a Research Log that describes your search process (sample research log provided in\nclass and in assignment section). Write a summary of each source you have selected, along with\na complete citation.\n\nEmail your assignment to Angie Locknar before class begins on Tuesday\nSept. 19.\n\nSample citation and summary:\n\nDvash, T.; Ben-Yosef, D.; Eiges, R. Human Embryonic Stem Cells as a Powerful Tool for\nStudying Human Embryogenesis. Pediatric Res, 2006, 60, 111-117.\n\nThis is an article that describes how human embryonic stem cells are derived and\ncharacterized. The authors explain how stem cells are used for studying human development\nand why they are so vital in research. The article is written in an explanatory manner and gives\nthe reader a solid background for further research on this issue. Several articles cited by this\nauthor may also be useful to read."
    },
    {
      "category": "Resource",
      "title": "log_sample1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/3aa886f721e62a63cd35caa48a721564_log_sample1.pdf",
      "content": "Research Log for Assignment 1\nTopic: nanotechnology\n\nDatabase/Action\nTime\nSpent\nSearch Terms\nJustification\nResult\nFeelings\nCompendex and\nInspec\n3 min\nNanotechnology,\n2005-2006\nJust starting out. Want\nrecent records\nrecords!\nWay too many records.\n\n2 min\n[Light/Optics,\nCarbon\nNanotubes,\nJournal Article]\nINCLUDE\nRefining last search.\nrecords\nBetter, but want around 30\n\n1 min\n[Nanotechnology]\nINCLUDE\nRefining last search.\n27 records\ngood, can sort through these to\nfind an interesting article\nMIT SFX\n15 min\n\nWant full text of selected\narticle\nAvailable\nthrough\nMIT\nModerately difficult to find.\nActual volume was 74A, not\n74, and SFX link didn't go\ndirectly to the article. Put\narticle title into search on the\njournal site.\nCompendex and\nInspec\n1 min\nCollagen, Carbon\nNanotubes,\nScaffold*\nFind other articles like\nthe starting article.\n2 records\nFound a new article, but search\nmay have been too narrow.\nMIT SFX\n10 min\n\nWant full text of selected\narticle\nAvailable\nthrough\nMIT\nFrustrated. The PDF of the full\ntext was password protected.\nCould email MIT libraries.\n\nCompendex and\nInspec\n5 min\nCarbon\nNanotubes,\nCollagen\nFind other articles like\nthe starting article.\n10 records\nGreat! Perfect number to sort\nthrough to find 4 more\nsupporting articles.\nSort the articles by\nreading the abstracts.\n10 min\n\nFind the most relevant\nwork.\n4 new\nrecords\nSuccessfully found five\nsources."
    },
    {
      "category": "Assignment",
      "title": "assignment2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/7d56c1871052ab53be7fc35c3ddc7e4f_assignment2.pdf",
      "content": "3.093 Assignment 2\nFind an Expert in a Field\nDue October 17\n\n-\nChoose one of the following scenarios (see details below).\n\n-\nSearch for two people who you feel are experts in that field (outside MIT). The experts\nmust be technically qualified in the field, with appropriate educational and professional\nexperience that justifies them as \"experts\".\n\n-\nFind at least 2 journal articles or books representative of each expert's work in the field.\nProvide a complete citation for each document you find that justifies the expertise of the\npeople you have chosen, along with a summary of why you chose each document.\nDescribe their educational backgrounds and professional experiences, as well as any\nhonors or awards that may further justify their expertise.\n\n-\nAccompany this assignment with a research log that describes your search process.\n\nScenario #1:\nThe law firm you work for is embroiled in litigation involving a patent your client owns, regarding\na liquid crystal display (LCD) monitor. With millions of dollars on the line, your job is to find an\nexpert witness to testify for your client's side.\n\nScenario #2:\nYou are applying to graduate school in the field of Green Chemistry. Thinking ahead to writing\na graduate thesis, you want to find people in that field who would be ideal thesis advisors, or\nwhose research interests you.\n\nScenario #3:\nAs an intern for NPR, you have been assigned the task of identifying potential interviewees on\nglobal warming and the destruction of the ozone layer. The experts you recommend to your\nboss must have current knowledge of the issue (e.g. publication on the topic within the last 5\nyears)."
    },
    {
      "category": "Resource",
      "title": "log_sample2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/5c452791a8f695eb81aa81898682e28f_log_sample2.pdf",
      "content": "Research log\nLiterature review on human embryonic stem cell research\n\n- I know this topic is pretty popular, so I'm confident that I can find a lot of stuff on stem\ncells.\n- I started at the MIT Libraries web page and chose the link for databases and e-journals\nbecause I want to find the most recent information on this topic online.\n\nI typed in the search box \"embryonic stem cells\" and got no results. This only took about\n2 minutes. I'm disappointed because I thought I would find a lot here.\n\n- Next I went to Google since I know there will be a lot of recent information on the web.\nAgain I typed in \"embryonic stem cells\". This time I got a lot of results - about\n13,000,000. I should find some really good sites here and it should be easy to read since\nit's all online on the web.\n- I chose the link for \"Embryonic stem cell - Wikipedia.\" This looks like a really good site\nbecause it has an explanation of what stem cells are, then some nice graphics and also a\nsection on research history and developments. I think I'll use this one.\nhttp://en.wikipedia.org/wiki/Embryonic_stem_cell_research\n\n- Then I went back to the Google results and chose \"What are embryonic stem cells?\" This\nalso looks good and has a lot of different sections, covering the difference between\nembryonic and adult stem cells and potential uses of human stem cells. There are also\nsome interesting graphics here. I think I can learn a lot from this site, so I'll use it.\nhttp://stemcells.nih.gov/info/basics/basics3.asp\n- Back at the Google results page, I chose \"Fact sheet: embryonic stem cell research\"\nwhich is from the White House -\nhttp://www.whitehouse.gov/news/releases/2001/08/20010809-1.html. It's short but it has\nto be good because it's a government site.\n__________________________________________________\n\n- The last result from Google's first page is \"Embryonic stem cells isolation\". It's from the\nWashington Post and it's short with a nice graphic, so this is something to look at.\nhttp://www.washingtonpost.com/wp-srv/national/cell110698.htm\n- The Google search took only about 10 minutes total, between doing the search and\nlooking at the 4 results. I'm feeling pretty good because I'm almost done!\n- For my last result, I'll go back to the MIT Libraries page because I must have missed\nsomething the first time.\n- This time I searched directly from the main page under Barton catalog quick search. I\nsearched again for \"embryonic stem cells\". I got 6 results.\n\n- I chose the second result because the title is exactly what I need: Human embryonic stem\ncells. I clicked to display the full record and then clicked the link for the Table of\ncontents. This looks good because it has chapters on a lot of aspects of stem cells, like\nthe biology of them, characteristics, and genetic engineering. I think I'll get this, but I'm\nnot sure how to get it because it only gives me the table of contents and not the whole\nthing. This is the location: Hayden Library - Stacks | QH588.S83.H86 2005\nI'm not sure where that is and when I click the link, it only gives me a short\n\"Availability/holdings display\" and nothing else. I'll ask some friends if they know how\nto get stuff from the library. If I can't find this, then I'll just go back to Google again\nsince there were a lot of results I didn't look at the first time.\n- The library search took about 5 minutes to do the search and look at the results.\n- I feel really good about this because it was pretty quick and easy to find 5 documents\nabout stem cell research.\n\n_______________________________________________"
    },
    {
      "category": "Assignment",
      "title": "assignment3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/82e3cfe4afaf974a7ed19ecdeda532f2_assignment3.pdf",
      "content": "3.093 Forward Citation Assignment\nDue October 24\n\nTracing an Idea Backwards and Forwards in Time\n\nFor this assignment, you will be given a \"classic\" paper in chemistry or materials science. Your\ntask is to find out who the author of the classic paper cited in his/her work (tracing backwards)\nand then who cited the classic paper (tracing forwards).\n\n-\nChoose one classic paper to begin with.\n-\nUsing an appropriate science article database, search for the classic paper to find the\ncomplete citation. Provide the full citation for this article.\n-\nFind a copy of the full text of the article (indicate whether you found the full text online or\nin print, and which library it was in). Provide complete citations for at least 3 papers\ncited in this article.\n-\nUse the appropriate index or database to determine how many times this paper has\nbeen cited since it was published. Provide complete citations for at least 3 papers that\nhave cited the classic article.\n-\nBased on your search, how important is the classic article?\n-\nKeep a research log to record your search process.\n\nARTICLES TO CHOOSE FROM:\n\n\"C60: Buckminsterfullerene\" in Nature, November 1985.\n\n\"Organic electroluminescent diodes\" in Applied Physics Letters, September 1987.\n\n\"Electrical Conductivity in Doped Polyacetylene\" in Physical Review Letters, October 1977."
    },
    {
      "category": "Assignment",
      "title": "assignment4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/3c95dce243c2aff2be1e3d6972bab31b_assignment4.pdf",
      "content": "3.093 Secondary Sources Search Assignment\nDue November 14\n\nUsing Secondary Sources to Find Facts and Answer Questions\n\nThis assignment requires you to use the types of secondary sources discussed in class to\nanswer factual questions about a topic. YOU MUST USE THE RESOURCES REQUIRED IN\nEACH QUESTION, FOUND IN THE MIT LIBRARIES. If additional citations are asked for, you\nmay use any resources at your disposal to provide the complete citation.\n\nPlease answer the following questions. Include the answer to the question, plus a complete\ncitation (including all author names, titles, pages the information was found on) for the\ninformation source. Also include the library call number or indicate if this resource is found\nonline.\n\nKeep a research log to record your search process.\n\n1. Using the Kirk-Othmer Encyclopedia of Chemical Technology:\na. You want to learn more about measuring kinetics, more specifically the Rate\nLaw. Is there a section in the Kirk-Othmer about this topic? What is the chapter\ntitle?\nb. Provide complete citations for 3 articles cited in this chapter.\n\n2. Using the CRC Handbook of Chemistry and Physics (85th edition or higher):\na. What is the CAS Registry number for K2O? Its melting point?\nb. What is the activation energy of GaAs with the diffusant Au? What method of\nmeasurement is used?\n\n3. Using The Encyclopedia of the Elements:\na. Who discovered Silicon?\nb. What is the mean content of Si in an adult human body?\n\n4. Using The Merck Index (12th edition or higher):\na. Find Al2O3. This substance occurs in nature as which 6 minerals? What is the\nCAS Registry number?\nb. Find citric acid. What is the CAS Registry number? The molecular formula?\nProvide 2 complete citations for references found in this entry.\n\n5. Using the ASM Handbook:\na. Who is the author for the chapter on Zinc and Zinc Alloys?\nb. Find Commercial Rolled Zinc, Zn-0.3PB-0.03Cd. What are the applications for\ntypical use of this alloy? Its melting point? Its annealing temperature?"
    },
    {
      "category": "Assignment",
      "title": "assignment5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/7d5339bc1988bd2e0dcbd80e3237a75e_assignment5.pdf",
      "content": "3.093 Corroboration Assignment\nDue November 21\n\nCorroborating Information in Authoritative Sources\n\nThis assignment requires you to use more than one authoritative information source when\nresearching a topic in order to verify facts and ensure accuracy.\n\nPlease answer three of the following questions using two different information sources for each.\n- Include the answer to the question found in each source, plus a complete citation\n(including all author names, titles, pages the information was found on) for each of the\ninformation sources you used.\n- Include the library call number or indicate if this resource is found online.\n- In addition, justify why you believe the information sources you used are authoritative.\n\nKeep a research log to record your search process.\n\nChoose three of the following to answer:\n\n1. I saw a web page (http://www.nukepills.com/nuclear_dirty_bombs.htm) about how\npotassium iodide (KI) can be taken in the event of a nuclear power plant accident or\nexposure to radioactive waste to prevent thyroid cancer. Please verify if this is accurate.\n\n2. My lab partner said that saccharine has the CAS Registry Number 58-08-2, but I need to\nmake sure that's right. Help!\n\n3. I saw a quote from an article in my textbook, and I want to cite it in my paper. Please\nverify that this is the complete citation for the article:\n\"Aldehyde suppression of copepods blooming in a ubiquitous planktonic diatom\" by\nAdrianna Ianora in Nature, 2004.\n\n4. The Wikipedia says that Adolf Fick derived his laws of diffusion in 1855. How old was\nFick when he did this? [http://en.wikipedia.org/wiki/Fick's_law_of_diffusion]\n\n5. I've heard that glass is actually a liquid, which explains why in very old buildings like\nchurches the glass is thicker at the bottoms of windows. Is this true?"
    },
    {
      "category": "Assignment",
      "title": "assignment6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-093-information-exploration-becoming-a-savvy-scholar-fall-2006/8ac66ccc4a34b74e0de602a433b214e2_assignment6.pdf",
      "content": "3.093 Literature Review II Assignment\nDue December 5\n\nLiterature Survey:\nMaterials Research\n\nYour task for this assignment is to use all the knowledge you have gained from this course to conduct\na scholarly literature review on a topic dealing with materials research. You may choose from the\nsuggested topics, or pick one of your own (must be approved by Prof. Sadoway). You must choose a\ntopic you have NOT ALREADY SELECTED in a previous assignment.\n\n-\nFind at least 10 citations from scholarly sources on your topic. 5 must be scholarly journal\narticles (2 journal articles must be published before 1990); 1 must be a book or conference\nproceedings\n-\nFormat your citations in ACS style (Hayden Library - Science Reference QD8.5.A25 2006)\n-\nSummarize or annotate each citation\n-\nKeep a NARRATIVE research log of your search process. Tell the story of what you did to\ncomplete this assignment. Keep all the required elements of the research log:\no\nThe name(s) of the database(s), web site(s), book(s), or other source(s) you used to\nfind information for the assignment\no\nDescribe why you chose those sources for your information search. Try to be\nspecific and justify your choices.\no\nDescribe your search process (the steps you took, the keywords you searched, how\nyou went about searching).\no\nExplain the results you got from each source. Did you find what the information you\nexpected to find? Were your results scholarly/academic in nature? Which results did\nyou select, and why did you choose them?\no\nThe amount of time you spent searching each source.\no\nDescribe your emotional response to the experience. Were you frustrated, confused,\nconfident, worried about time, etc.?\n\nSuggested Topics:\n\n-\nUse of DNA in solving crime\n-\nMedical uses of ceramics\n-\nMaterials for information storage\n-\nMetals for construction (e.g. bridges, tunnels)\n-\nAlternative fuels\n-\nUse of lasers in biomedical applications\n-\nLab on a chip technologies\n-\nBuckminster fullerenes\n-\nOrganic LEDs\n-\nGreen chemistry\n-\nGlobal warming and the ozone layer (chemical perspective)\n-\nZinc alloys and their uses\n-\nGaAs and its uses\n-\nUses of KI in medicine\n\nSample citation and summary:\n\nDvash, T.; Ben-Yosef, D.; Eiges, R., Human embryonic stem cells as a powerful tool for studying human\nembryogenesis. Pediatr Res 2006, 60, (2), 111-7.\n\nThis is an article that describes how human embryonic stem cells are derived and characterized. The\nauthors explain how stem cells are used for studying human development and why they are so vital in\nresearch. The article is written in an explanatory manner and gives the reader a solid background for\nfurther research on this issue. Several articles cited by this author may also be useful to read."
    }
  ]
}