{
  "course_name": "Information and Communication Technologies in Community Development",
  "course_description": "This practicum subject integrates theory and practice through the design, implementation, and evaluation of a comprehensive community information infrastructure that promotes democratic involvement and informs community development projects. Students work with Lawrence Community Works, Inc. to involve constituents and generate solutions to an important planning problem in the City of Lawrence, Massachusetts. Final project presentations take place in a public forum, and serve to inform future development of the information infrastructure. Subject begins with an overview of the digital divide, e-government, public participation GIS, and neighborhood information systems. Subject includes a reflection component and a deliberate investigation of race, class, and gender dynamics.",
  "topics": [
    "Business",
    "Information Technology",
    "Social Science",
    "Communication",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Urban Planning",
    "Business",
    "Information Technology",
    "Social Science",
    "Communication",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week,\n\nLecture 1: 3 hours / session\n\nLecture 2: 1.5 hours / session\n\nCourse Description\n\nStudents work with members of Lawrence Community Works, Inc. (LCW), a community development corporation dedicated to organizing and community planning, to advance the\nReviviendo\nGateway Initiative (RGI). The RGI is a long-term and resident-led community development plan that promotes family asset building and physical redevelopment in the North Common neighborhood located in the City of Lawrence, Massachusetts.\n\nTo begin, students will research the subject of individual development accounts (IDAs), a new and innovative asset building program. IDAs are usually thought of as helping individual families in terms of long term capital expenditures like homeownership and education, yet we will explore the ways the concept can be used for collective decisions in a given physical area. Students will work with LCW members to collect data and explore the potential implications of involving residents in an aggressive IDA program.\n\nThe course content covers three broad areas. They are: e-planning, community development, and reflective practice. This subject gives students an opportunity to acquire important professional skills by exploring the extent to which marginalized constituencies - like youth, immigrants, and minorities - identify problems, produce information, build power and consensus to affect planning-related outcomes using ICTs around a particular issue. Those skills include effective one-on-one and group communication, the production of a tangible product for the community, and the manipulation of such tools as HTML, Photoshop, Access, ArcPad, and ArcGIS.\n\nUnlike the conventional model of academic research and the most prevalent types of applied research, LCW members will not function as passive subjects, nor do students act as experts whose principal responsibility is to deliver a final product. Rather the practicum follows a participatory action research model whereby students work hand-in-hand with LCW members. The course format requires students to form two distinct groups, each focusing their energies on a different set of tasks. The first group will conduct research on asset building through IDAs, interview residents, and create a web site to disseminate IDA information, while the other group designs a protocol for collecting spatial data, works with residents in the field to inventory the housing stock, and constructs a ArcGIS project that will reside in LCW's Design Center.\n\nReviviendo means \"return to life\" in Spanish.\n\nBackground\n\nIn October 2003, the Lawrence City Council voted unanimously to pass the Reviviendo overlay district proposal, which went into effect immediately. The overlay district, RGI's first initiative, represents an historic modification to the zoning code that streamlines the approval process for developers and property owners interested in building or expanding structures. This victory is meaningful to the MIT faculty and students who worked to promote the overlay district in Advanced GIS Project course held in spring of 2003. For seven weeks and in conjunction with LCW staff, MCP students designed a neighborhood information system, or sistema de informacion sobre el vecindario, to publicize information pertaining to the overlay district project. The site is located at\nReviviendo - Gateway Initiative\n. This course seeks to build on this work.\n\nPartners\n\nLCW Design Center\n\nLCW's Design Center is an in-house technical assistance office which provides support to the real estate, family asset-building, and community organizing teams. The Center's purpose is to make planning technologies available to residents, increase access across the digital divide, and train a team of youth and adult volunteers to provide analytical assistance to other residents. CommunityWorks' Design Center Team will be the primary link between local residents and MIT/DUSP.\n\nIDA Program (Assets Build Communities - ABC)\n\nABC is an asset-building program primarily focused on building the wealth of low-income Latina women and youth, as both groups are impacted disproportionately by poverty and barriers to success. ABC is centered on IDAs, which are matched savings accounts with restricted uses to help low-income families gain tangible assets (such as a home or a business) and intangible assets (such as economic literacy and self-sufficiency). The twin cornerstones of the program are the savings and match dollars central to helping participants achieve their dreams, and the education, training, and counseling that participants receive to improve their economic literacy and financial stability.\n\nGrading\n\nAssignments are detailed in the assignments section.\n\nASSIGNMENTS\n\nPERCENTAGES\n\n10%\n\n2a / 2b\n\n10%\n\n3a / 3b\n\n20%\n\n25%\n\n5%\n\n6a / 6b\n\n20%\n\nOther\n\n10%\n\nTotal\n\n100%",
  "files": [
    {
      "category": "Assignment",
      "title": "assignment1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/9e97c4e5fb37600c1cca631c75af93ab_assignment1.pdf",
      "content": "Assignment 1 (class), Confronting Logistical Issues (10%) - Due February 12th\n\nAssignment 1: Students must meet and comb through the entire syllabus together. The\nfirst task is to establish a protocol for communicating among yourselves outside of class\n(i.e. Will you rely on Stellar? Will you compile a list of e-mail addresses and cell phone\nnumbers?). Next, discuss how you will organize your time and coordinate your schedules\nfor project. How will you get to the on-site meetings? Third, determine membership for\nthe two working groups, designate a project manager for each, and outline his/her\nresponsibilities. Do other positions need to be designated? For example, who will contact\nand communicate with LCW members? Each group should submit a single document that\nexplicitly addresses these and other relevant logistical issues. This assignment is due on\nFebruary 12th. For an example of such a document, look at student work from last year\navailable in the course locker - athena/course/11/11.423/."
    },
    {
      "category": "Assignment",
      "title": "assignment2a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/77fe5999afaa1186090c195f2767d814_assignment2a.pdf",
      "content": "Assignment 2a (group one), IDA Discussion (10%) - Due February 24th\n\nAssignment 2a: Group one leads the classroom discussion on IDAs. First, we will discuss\nwhat they have discovered about IDA programs and the potential implications of an\naggressive IDA program in the City of Lawrence. Next, group one will work to inform\nthe data collection efforts underway in group two. For example, we might ask: What data\nare needed to represent housing demand? Housing supply?2\n\n2For example, we might consider housing supply in terms of a \"landscape of opportunity.\"\nIn this case, how can we visually represent the landscape? Will we need to know the\nfollowing: Where are the vacant buildings? Where are the vacant lots? Where are the\nunits owned by absentee landlords? Where are the opportunities for conversion?\nWhere are the multi-unit structures? Which structures are owned by elderly residents?"
    },
    {
      "category": "Assignment",
      "title": "assignment2b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/c4954cf26d681754646a2ece7f346e3b_assignment2b.pdf",
      "content": "Assignment 2b (group two), Data Collection Discussion (10%) - Due March 2nd\n\nAssignment 2b: Group two leads the discussion on data collection. First, they will\ndescribe the data sets that are already available and those we might soon acquire.\nNext, group two will provide a detailed presentation of their data collection strategy."
    },
    {
      "category": "Assignment",
      "title": "assignment3a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/a3f0fca01b31511184b5d71bec5d238a_assignment3a.pdf",
      "content": "Assignment 3a (group one), IDA Scenarios (20%) - Due April 15th\n\nAssignment 3a: Group one submits a document and leads the classroom discussion on the\nIDA scenarios they crafted."
    },
    {
      "category": "Assignment",
      "title": "assignment3b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/26ff52e6084a930878324747e9eacbb1_assignment3b.pdf",
      "content": "Assignment 3b (group two), Data Collection (20%) - Due April 13th\n\nAssignment 3b: Group two submits the final data set (housing demand and supply) for the\nCity of Lawrence and the North Common neighborhood and describes the new data sets\nto the class."
    },
    {
      "category": "Assignment",
      "title": "assignment4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/cb6cb64f05546211be9e4108343c4a2d_assignment4.pdf",
      "content": "Assignment 4 (class), Report (25%) - May 10th\n\nAssignment 4: The final product for LCW is an argument, supported by the data you have\ncollected and analyzed in the ArcGIS project, which describes how an aggressive IDA\nprogram would impact the City of Lawrence and the North Common neighborhood. You\nwill prepare a comprehensive report that articulates a vision for using IDAs as a strategic\n(collective instead of individual) and place-based economic development tool. Keep in\nmind that LCW will later use this document to secure funding from foundations and other\nfunders to expand their IDA program. In addition, a member from each group will\npresent this report at the May 10th RGI Steering Committee."
    },
    {
      "category": "Assignment",
      "title": "assignment5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/092a5d2651a11a8410c79d8863a1ce42_assignment5.pdf",
      "content": "Assignment 5 (class), Final Presentation (5%) - Due May 11th\n\nAssignment 5: This session represents a formal and final presentation of the report to the\npublic. Consider and resolve the following in advance. Which members of the design\ncenter team, group one, and group two will participate in the final presentation? Where\nwill the presentation take place? Who constitutes \"the public?\" Will you advertise the\nmeeting or will LCW take the lead on that task? Will you invite key actors in the\ncommunity like elected officials, non-profit organizations, and community leaders? If so,\nhow will you determine who they are? Who will contact them? Will there be\nrefreshments? Do you need to consider the physical accessibility of the site? Should the\nmeeting be held in the evening? Exactly what aspects of the gathering will you ask LCW\nto handle?"
    },
    {
      "category": "Assignment",
      "title": "assignment6a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/f546540c33638e29252884954256b2ff_assignment6a.pdf",
      "content": "Assignment 6a (group one), IDA Web Site (20%) - Due May 18th\n\nAssignment 6a: Students will add IDAs to the online redevelopment toolbox Professor\nHoyt is constructing for research and teaching purposes. The IDA website will have a\nminimum of four pages (home, project, research, and links) and will be modeled after the\nexisting BID site at http://web.mit.edu/11.204/www/webportfolio/BID/index.html."
    },
    {
      "category": "Assignment",
      "title": "assignment6b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/f864f8d527c756d194af7be902c86697_assignment6b.pdf",
      "content": "Assignment 6b (group two), Customized ArcGIS Project (20%) - Due May 18th\n\nAssignment 6b: Students (MIT and LCW) will assemble an ArcGIS Project to conduct\nIDA outcome scenarios and host all of the data layers we've created/compiled to date. At\nthe end of the semester, the final Map Document (including the updated files) will be\ntransferred to a workstation at LCW.\nReminder for both groups: Since you have completed an important phase of an ongoing\nproject, it is important that you document your accomplishments. As a group, you will\nbundle and submit all project-related information, including group meeting minutes,\ncorrespondence with the client (e-mail, meeting minutes, etc.), correspondence with the\nconsultant (e-mail, meeting minutes, application files and documentation, etc.),\nassignments, etc. This information must be submitted to the instructor on compact\ndiskettes before 5:00pm on May 18th."
    },
    {
      "category": "Lecture Notes",
      "title": "lec_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/fb02668dd490b8e6deb96b888ba9668e_lec_1.pdf",
      "content": "Information and Communication Technologies in Community Development\n11.423\n\nFebruary 5, 2004\n\nSchedule\n\n1. Client Introduction\na. What did you think of the client presentation?\nb. What is RGI?\n\n2. A Review of the Deliverables/ PAR Model - Andre/IDA Graduates/Design Center\na. Report (place-based, collective vision for IDAs at two scales)\nb. Customized ArcGIS Project for LCW\nc. IDA Web Site http://web.mit.edu/11.204/www/webportfolio/BID/index.html\n\n3. Organizational Matters\n\na. Sign-up sheet\n\nb. Stellar\n\nc. Course Locker\nd. Division of Labor\ne. Next Week\ni. Assignment 1 (Due Thursday during class)\n\nMeet as a group to review the syllabus\nProtocol for communicating\nGroup membership/leadership\nii. Reflection Exercise\n\nIndividual/Collective (beliefs/assumptions)\n\nFree flow/memo to instructors by Wed. at noon\niii. Site Visit (Agenda, Transportation ($), Other\n\nContact Information\n\nName\nEmail Address\nCell/Home Phone Number"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/065653151b7fb83352fac631e85d5f18_lec_2.pdf",
      "content": "Information and Communication Technologies in Community Development\n11.423\n\nFebruary 3, 2004\n\nIntroductions\n\n1. Instructors\n\n2. Students; Program group/interests\n\n3. What you hope to learn/experience; Why you are interested in the subject\n\n4. Syllabus\n\nSchedule\n1. Course Introduction\n\na. Pedagogical Model - Community Development; E-planning; Action Research\n\nb. Problem - Home Ownership, Context - the City of Lawrence\n\nc. Client - Lawrence Community Works, Inc.\n\nd. Project - A Strategic Vision for Strengthening Families and Neighborhoods\n\ne. Logistical Matters - Transportation, Language Issues, etc.\n\n2. BREAK (5:15 to 5:30)\n\n3. Client Introduction\n\na. Presentation by Andre Leroux, Neighborhood Planner, LCW Inc.\n\nb. Q & A\n\n4. END (7:00)\n\nPedagogical Model - Community Development; E-planning; Action Research\nCommunity Development\n- Homeownership and neighborhood stability\n- Building as a community revitalization strategy\n- Vacant and abandoned property problems\n\nE-Planning\n\n-Data Collection and Local Knowledge\n-Public Participation GIS\n-What if?\n\nCommunication\n\n-Building institutional capacity through collaborative planning\n\n- Information in communicative planning\n\n- Reflection\n\nProblem - Home ownership, Context - The City of Lawrence\nImpressions and knowledge of Lawrence\n-What do people think they know?\n\nFacts about Lawrence\n\n-Founded in 1847, highly planned industrial town - population of about 72,000\n\n-Located 25 miles north of Cambridge; textile manufacturing (cotton/wool)\n\n-Long known as \"Immigrant City\" - Mid 1800s; Ireland/Canada/Eng/Germany\n-Early 1900s; Italy, Poland, Lithuania; Mid 1900s; DR, PR, Vietnam, Cambodia\n-2000 Census; 60% inhabitants self-identify as Latino (N and NW - map)\n-Highest proportion of Latino student enrollment in the state, 81%\n-Median household income $28K; $47K Massachusetts\n\n-68% of housing units are renter occupied; national home ownership rate 68%\n-Unemployment around 14%, around 6-7% region\n-Size and age; Third Tier City like Camden, Lowell, Reading\n\nFacts about the North Common Neighborhood\n\n-Residential; North of the Merrimack River; Poorest neighborhood in the city\n\n-Former working class white community, began to change in the 1960s/1970s\n\n-About 90% of residents are Latino (DR and PR)\n-Today more than half the residents live in poverty\n-Home ownership from 7% in 2001 to 9% in 2002\n\n-One-third of land vacant/abandoned buildings\n\nClient - Lawrence Community Works, Inc.\nA Bit of History\n\n-Formerly Lawrence Planning & Neighborhood Development Corporation\n-1986 by affordable housing activists/170 unit; 1998 defunct\n-1999; Bill Traynor, native, community development consultant\n-Tamar, Kristen, and Jessica beginning community org efforts\n\nCommunity Works Today\n\n-Staff of about 30/a multi-million dollar operation\n\n-Bricks and mortar; Community organizing\n-Other - Tom Gaglianni. Mollye Wolhan, Maggie Super\n\nProject - A Strategic Vision for Strengthening Families and Neighborhoods\nThe Reviviendo Gateway Initiative (RGI) - a movement; smoke and mirrors?\n\n-Entrance off of 495; Opportunity to redevelop/reframe\n\n-Resident led strategy (700+)\n\n-Zoning Overlay District; expedite development\nThe LCW Design Center\n\nThe IDA Program\n\n-Family asset building\n\n-Investing in people as well as place\n-Matched savings accounts\n-For purposes such as home ownership, education, & small business\n-At rates as high as $4 for every dollar saved\n-Allows states to use welfare block grants to match savings in IDAs\n-Sponsored by Carol Mosely-Braun; bi-partisan support\n-Local organizations (often non-profit) counsel and monitor\nparticipants/control match funds"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_3rgi.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/ce3e543a7dcdc6c5e6a600f8ba1f4463_lec_3rgi.pdf",
      "content": "What is RGI?\nWhat is RGI?\nGateway\nProject\n-GenCorp $\nReviviendo\nReviviendo\nGateway\nGateway\nInitiative\nInitiative\n(RGI)\n(RGI)\nCommunity\nWorks\nGroundworks\nLawrence\nFederal\nAgencies\n-Task Force $\nSmall\nBusinesses\nArtists\nResidents\nProperty\nOwners\nSchool,\nHospital,\nEtc.\nElected\nOfficials"
    },
    {
      "category": "Resource",
      "title": "a_newfin_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/cf3da1c54bc0e1ec1a712aa56327761e_a_newfin_rep.pdf",
      "content": "People and Place:\n\nIndividual Development Accounts, Technology &\nCommunity Revitalization in Lawrence, MA\nMIT Department of Urban Studies and Planning with Lawrence CommunityWorks | Spring 2004\n\nACKNOWLEDGEMENTS\nLorlene Hoyt\nLangley Keyes\nShannon McKay\nKim Alleyne\nAlberto Ortega\nMonica Romis\nValentina Zuin\nDuncan Kincaid\nDaniel Sheehan\nJess Andors\nAnnery Brea\nDeborah Fox\nKristen Harol\nDidier Kouassi\nTamar Kotelchuck\nAndre Leroux\nIris Marte\nJulia McNabb\nAlex Pina\nRafael Revi\nBill Traynor\nValerie Aponte\nReyna Burges\nTrina De Jesus\nPetronilia De la Rosa\nAna Fuertes\nAna Heredia\nGloria Hernandez\nJuana Jimenez\nLuz Mirabel\nMary Moquete\nMonica Ohoa\nFlorencia Otero\nMayra Paulino\nAntonia Payano\nInez Perez\nRose Pierre\nTeofila Richardson\nYvette Romen\nMercedes Solano\nMaria Soto\nMaria Tejada\nAltagracia Valdez\nRebecca Camargo\nJustin Cyr\nFrank Ditren\nRichard Fernandez\nRickey Gonzalez\nReynal Pena\nEvan Perez\nRonald Tapia\nYordi Urena\nPatricia Urena\nArmand Hyatt\nCamille Miragliotta-Daly\nJuan Ortega\nJohn P. Teoli\nW\ne worked with fabulous\npeople this semester\nand we thank you all for a\nwonderful experience!\n\nTABLE OF CONTENTS\nExecutive Summary\nPreface\nIntroduction\nIndividual Development Accounts: National Trends\nCommunityWorks IDA Program\nPeople\nPlace\nSynthesis: Bringing Together People & Place\nBarriers\nRecommendations\nResources\nAppendix A: Participatory Workshop Information\nAppendix B: GIS Maps & Data Tables\n\nEXECUTIVE SUMMARY\nThis is the final report of the Spring 2004 MIT class,\n\"Information and Communication Technologies in Community\nDevelopment.\" The class is part of an ongoing relationship\nbetween the Department of Urban Studies and Planning at MIT\nand Lawrence CommunityWorks.\nOur class was given the task of\ninvestigating the possible expansion of\nthe Individual Development Account\n(IDA) program at CommunityWorks. The\nIDA program is designed to encourage\nasset building through individual saving\nmatched by grants and federal funds. It\nfocuses on financial literacy and future\nplanning, allowing participants to save\nfor starting a small business, paying for\nhigher education, or purchasing a home.\nThe organization would like to expand\nthe program to many more residents of\nLawrence, focusing on homeownership as\na strategy of neighborhood revitalization.\nWe conducted a wide array of activities to gather information\nand create relationships with the many people who participate\nin CommunityWorks programs. In order to better understand\nthe housing stock in Lawrence, we worked with youth in the\nYoung Architects and Young Professionals classes. We used\nhandheld computers to gather data about every parcel in the North\nCommon neighborhood of Lawrence, which we then input into a\nGeographic Information System (GIS) project.\nWe also conducted participatory workshops with IDA\nparticipants in order to gather information about the program\nand the participantsʼ goals for the future. We learned a great deal\nabout the needs of the IDA participants and also helped them learn\nmore about housing options in Lawrence. Finally, we conducted\ninterviews with CommunityWorks staff\nand key stakeholders. These interviews\nallowed us to learn more about program\nadministration and better understand the\nhousing market in Lawrence.\nOur recommendations stem from a\nvision of an expanded and enhanced IDA\nprogram that impacts participantsʼ lives\nas well as the City of Lawrence. This\nreport presents a flexible process in three\nstages: today, near future, and future.\nThroughout these stages, we recommend a\ncontinued focus on three principles: 1) an\nemphasis on living in Lawrence, 2) peer\nsupport and social networks, and 3) youth\ndevelopment.\nOur recommendations are directed not solely at the IDA\nprogram, but at each department within CommunityWorks. We\nrecommend that CommunityWorks continue the housing data\ncollection process as an integral part of the youth programs.\nWe also recommend continuing participatory workshops, across\ngroups, as part of the expanding IDA program.\n\nPREFACE\nThis report is the final output of the MIT Department of Urban\nStudies and Planning (DUSP) class, \"Information and Communication\nTechnologies in Community Development,\" offered in Spring 2004.\nThis class is part of an ongoing partnership of DUSP and Lawrence\nCommunityWorks from 2003 to 2008. A brief description of this\npartnership (from the partnership agreement) follows.\nThe three main partners in this project are CommunityWorks,\nDUSP/MIT, and the City of Lawrence. CommunityWorks and\nMIT conceived this project together based on needs arising\nfrom CommunityWorks' organizing and planning work with\nneighborhood residents and stakeholders, and following\nten years of various student and then alumni involvement\nin the City. The development of CityNet is part of a five-\nyear commitment by MIT to CommunityWorks, in which\nCommunityWorks will become the client for an ongoing series\nof core DUSP practica classes centered around technology as\na tool for revitalization. To the process of project development\nMIT has brought strong technical expertise and knowledge\nof best practices in the field, while CommunityWorks has\nbrought a clear and deep understanding of local and resident\nneeds. This understanding is based on extensive and central\nneighborhood organizing work and experience in dozens of\ncommunity planning meetings with residents as they worked\nto design housing projects, parks and playgrounds, community\ngardens, educational facilities, and youth and family\nprograms. The City of Lawrence is providing access to their\nparcel-level GIS database of the entire City, Departmental\ninformation, and time from their GIS staff person.\nAs defined on its website:\n\"Lawrence CommunityWorks (LCW) is a community\ndevelopment corporation dedicated to the sustained\neconomic and physical revitalization of the City of\nLawrence. LCW had its beginnings in the early 1980s\nstruggle to build affordable housing in North Lawrence,\nand has built or renovated nearly 200 units of affordable\nhousing for the people of Lawrence. Our mission is rooted\nin a commitment to:\n- fostering individual and neighborhood empowerment\nand leadership through organizing residents to develop\neconomically, politically, and socially,\n- producing and preserving safe, decent, and affordable\nhousing for low- and moderate-income families, and\n- creating programs and facilities that help meet the\neducational and economic development needs of\nneighborhood young people, adults, and families.\"\n\nINTRODUCTION\n\nIn Spring 2004, a class from the Department of Urban\nStudies and Planning (DUSP) at the Massachusetts Institute of\nTechnology (MIT) undertook the task of investigating how to\nexpand the Individual Development Account (IDA) program\nat Lawrence CommunityWorks. CommunityWorks has a goal\nof significantly increasing the size of its IDA program and\nencouraging program participants to use their savings to purchase\na home in Lawrence. This would serve two goals: improve the\nlives of participants by enabling them to own a home, and improve\nLawrence by having a set of residents who own their homes and\nare strongly committed to their neighborhoods. Our class set\nabout figuring out a way to accomplish both of these goals. Our\nteam focused on the following four areas:\nHomeownership\nWhile we recognize that homeownership is just one asset type that\nparticipants may select, we were asked to focus on homeownership.\nProcess for Scale\nWe were asked to evaluate the process of creating a large scale\nIDA program and its impact on Lawrence. We have narrowed\nour efforts to creating a process by which CommunityWorks can\nachieve an IDA program of significant scale.\nOrganizational\nInstead of solely looking at the IDA program, the process we\ndeveloped addresses CommunityWorks as a whole.\nNeighborhood: North Common\nWe focused on the North Common neighborhood and on\ndeveloping a model that can be replicated for other parts of the city.\nOur Approach: People and Place\nOur work is split into two main areas of focus: people and place.\n\"People\" refers to current and future IDA participants who want to\npurchase a home in Lawrence. \"Place\" refers to the housing options\nin Lawrence, which are currently too expensive for most participants\nto afford. The goal of this project was to figure out a way to bring\npeople and place together. In order to do this we designed a process\nto gather more information and inform the activities of many\ndifferent parts of CommunityWorks.\nT\nhe ʻLandscape of Opportunityʼ is really in the people.\nCommunityWorks recognizes this and succesfully\ninvests in its members. The next step is ensuring that those\nmembers are equipped with the resources they need to make\nLawrence a great place.\n\nWhat is an Individual Development Account?\n\nAn Individual Development Account (IDA) is a financial\nand economic development tool designed help low-income\nfamilies save and accumulate assets. Sponsoring organizations\nmatch the savings of participants, thereby encouraging residents\nwith low-incomes to save more than they normally would. In\norder to receive the matching funds, residents must purchase\nan asset - typically a home, education, or capital for a small\nbusiness. These assets help to close wealth inequality, which is\nmore disparate than income inequality in the United States. IDAs\nare designed to provide assets to leverage additional wealth and\nengage low-income households in long-term financial planning.\nHistory\n\nIDAs represent an ideological shift from traditional\nwelfare income maintenance policies to a focus on asset building\nand financial independence. In 1997, the American Dream\nDemonstration (ADD) project initiated and evaluated 13 IDA\nprograms across the country. In 1999, the federal Assets for\nIndependence Act (AFIA) was passed, which provided $125\nmillion dollars of funding for IDA programs to be matched by local\nsources. AFIA established IDAs as a primary asset building tool\nfor local organizations. Currently, there are 554 IDA programs in\nthe United States with over 20,000 participants. The vast majority\nfocus on adults and provide some matching funds. IDA savings\nare most often spent on education, small business and home\nownership, with homeownership being the most popular option.\nRefer to the Resources section for more nationwide IDA data.\nINDIVIDUAL DEVELOPMENT ACCOUNTS:\nNATIONAL TRENDS\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFunding\n\nThe primary source of Individual Development Account\nfunding comes from AFIA. Thus far, congress has appropriated\nmore than $95 million in AFIA funding for IDA programs across the\ncountry. While federal funding has been available, the challenge\nfor many IDA programs has been acquiring local match sources\nthat are necessary to access AFIA money. Applicant organizations\ntypically seek money from state government, foundations, and\nbanks with varying levels of success. Additionally, many local\nfunders, particularly foundations, specify that grants should go\ndirectly to match savings. As a result, little money is left for the\noperation and management of the program itself.\nPolicy\n\nThe need for greater support at the local level has driven\nmany state policy initiatives. Collaborations of IDA organizations\nhave proposed state legislation which provides state funding for\nIDA programs and sometimes administrative support for managing\nlarge quantities of IDA accounts. State support is critical for\nIDA programs, as it begins to solve the problem of a lack of\nlocal support to match AFIA funding. As a result, IDA program\ncollaborations lobby state legislators and state administrators to\ncreate funding streams and administrative support for IDAs. In\nmany states, these collaborations have been quite successful, as\n21 states have IDA legislation, and 7 states have administratively\ncreated IDA support.\nMassachusetts\n\nThe Commonwealth of Massachusetts does not provide\nsupport to IDA programs through funding or administrative\nassistance. IDA legislation was proposed, which died in 2001.\nNo new legislation has been introduced since that time. However,\nMassachusetts does have IDA-like programs which encourage\nsavings and asset accumulation for low-income families. One\nis a savings program for public housing residents, and another\nis a subsidized education account program. Where the state has\nnot been particularly supportive of IDAs, funding and technical\nsupport have come from local private and non-profit sources.\nFunding support has primarily come from foundations and banks.\nTechnical support has come from a collaboration of Massachusetts\ncommunity-based organizations that operate IDA programs,\ncalled Massachusetts IDA Solutions (MIDAS). MIDAS is also\nworking towards IDA legislation at the state level.\nAlternative Funding Strategy: New Hampshire\n\nBy the time New Hampshireʼs five-year statewide IDA\nprogram has been implemented, it will have served 500 families,\nmaking it one of the largest IDA programs in the country. In\n2000, the New Hampshire Community Loan Fund (NHCLF)\nwas approached by Concord Area Trust for Community Housing\n(CATCH) to develop a statewide IDA program. After a small\npilot, NHCLF launched its five-year statewide effort funded by\n$2.2 million in match funds from AFIA, foundations, banks, and\nstate TANF money. The program is run in collaboration with\n17 community-based organizations and the University of New\nHampshireʼs Cooperative Extension program, which provides\nthe financial literacy training. NHCLF role is to coordinate with\nthe community collaborators, manage the process, and raise and\nmanage the matching funds.\n\nCOMMUNITYWORKS IDA PROGRAM\nProgram Design\n\nThe Lawrence Community Works IDA program is unique.\nThe elements of the CommunityWorks IDA program that\ndistinguish it form many other national programs are:\n- Place-based\nCommunityWorks seeks to use individual accounts to build a\nstronger community in Lawrence. While the impact of IDA\nprograms on individuals is well documented and studied, the\nimpact of IDA programs on place is not well understood by\nresearchers.\n- Women Only\nSecond, the program, as it currently exists, is solely\nfor women, who are one of the most economically\ndisenfranchised groups in Lawrence.\n- Support, Social Networks\nThird, the LCW program is not only a savings mechanism, but\nalso a support and educational network for IDA participants.\nWomen are able to share their struggles and triumphs in life\nand saving, which attaches participants to the program and\nbuilds social networks and trust amongst Lawrence residents.\nThus, the IDA program is about more than just savings, it is\nabout building community and relationships in Lawrence.\n\nResidents with household incomes that are below 200% of\nthe poverty line are eligible for the IDA program. Women apply\nto the program, CommunityWorks nominates eligible candidates,\nand a lottery is then held for the final list of participants. There are\na total of 36 IDA participants, broken up into three groups of 12.\nGroup One already graduated from the program, Group Two is in\nits second year, and Group Three is in its initial year. Each group\nmeets at least twice a month for two years.\nDuring the two years, IDA participants attend training\nsessions covering skills such as organizing personal finances and\nbuying a home. They also attend more social sessions where\nparticipants get to know each other and provide support through\nevents like spaghetti dinners. They also meet personally with\nthe IDA manager about life, savings, and their trajectory in the\nIDA program. When the participant purchases their asset, every\ndollar that each participant saved is matched with three dollars of\nmatching money. The asset must be acquired in the Merrimack\nValley area, which can be inside of, or outside of Lawrence.\nCurrently, the source of the match money is AFIA and local\nfoundations and banks.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nWhat We Did - Interviews\n\nIn addition to background research on the LCW program, we\ninterviewed Julia McNabb, the youth IDA manager, and Annery\nBrea, the adult IDA manager. The interviews allowed us to ask\nspecific questions about the program related to CommunityWorksʼ\ngoals of scaling up the IDA program in Lawrence. The managers\nsuggested how a larger IDA program might work in the future.\nHowever, they also expressed concerns about how the IDA\nprogram could improve to better serve participants today.\n\nWe also conducted several interviews to understand more\nabout other IDA programs. Margaret Miley of Massachusetts\nIDAs (MIDAS) was very helpful in identifying trends and\nchallenges at the state level. Ben Managan is executive director\nof San Francisco Earned Asset Resource Network, an organization\nthat manages 350 IDA accounts. This interview clarified how this\nparticular organization approached the issue of scale. Stephanie\nBodie of the Center for Social Development at Washington\nUniversity in St. Louis was helpful in understanding both the\nworkings of an urban IDA program, but also what is happening at\na policy level.\nAdministration\n\nThe administration of the IDA program is connected to\nthe community, which, in many ways, defines the program.\nAs mentioned above, there are several social support sessions\nthroughout the year, and the IDA manager meets with each\nparticipant personally at least once a year. The manager knows the\nnames of participantsʼ children and problems women are having\nwith their spouses that prevent them from saving. Additionally,\nmany of the participants were brought into the program through\nthe program manager, who is personally connected to the\ncommunity in many ways. She makes radio announcements\nabout the program in Spanish. She also uses her extensive social\nnetworks in the community to attract eligible participants into the\nprogram. Thus, the integration of the community in these ways\nhas improved social support and marketing of the program.\n\nIDA accounts are held with a local bank, and IDA managers\nare required to keep track of deposits through a database using\nthe Management Information System for IDAs (MISIDA). The\nMISIDA and the bank systems are not connected, and MISIDA\nis not automatically updated when bank deposits are made.\nTherefore, each deposit has to be updated every month into the\nMISIDA system, which is a frustrating and time-consuming\nprocess. Updating the MISIDA requires one full day of an\nadministratorʼs time. Maintaining both the social supports for the\nIDA program and the accounts is a Herculean task for any one\nIDA manager."
    },
    {
      "category": "Resource",
      "title": "newfinal_pres.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/56128f2af38a79b685d8bfea2fbb0bf0_newfinal_pres.pdf",
      "content": "5.11.04\nDepartment of Urban Studies &\nPlanning\nWelcome! Bienvenidos!\nVision\nOur vision is an expanded and improved IDA Program that\nincreases opportunities for those who want to own a home in\nLawrence.\nWe designed a process that Lawrence CommunityWorks can\nuse to identify and assess development opportunities as well\nas the needs and demands of program participants.\nhousing needs of\nLawrence residents\nhousing units in\nLawrence\npeople\nplace\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPeople\nGoal: Learn about IDA Program and understand participants'\nhome-buying preferences\nWhat We Did:\nFinal Presentation to\nLawrence CommunityWorks\n- Staff Interviews\n- Nationwide Research\n- Participatory Workshops\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPeople\nParticipatory Workshops:\n-\n-\n-\nLawrence?\n-\nand Ownership\nPreferences\nFinal Presentation to\nLawrence CommunityWorks\nWhy People Join the IDA Program?\nWhat People Like About Lawrence?\nWhere People Want to Live in\nHousing Type\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPlace\nGoal: Learn about Housing Opportunities in the North\nCommon as a part of Lawrence\nWhat We Did:\nFinal Presentation to\nLawrence CommunityWorks\n- Field Survey with Youth\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPlace\nGoal: Learn about Housing Opportunities in the North\nCommon as a part of Lawrence\nWhat We Did:\nMapping & Analysis\nFinal Presentation to\nLawrence CommunityWorks\n- Field Survey with Youth\n- Constructed GIS Project for\n- GIS Training\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPlace\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nFinding Barriers\nHomeownership\n-\nCost, Quality, Preferences\nOrganizational\n-\nCharacter, Administration\nInstitutional\n-\nCity of Lawrence, Other Organizations\npeople\nplace\n=\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nToday\nNear Future\nFuture\nIDA Program\nEnhancements\nCommunityWorks\nIntegration\nSustainability: City/RGI,\nBanks, State\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nToday\nFocus: Encourage\ncommitment to\nhomeownership in\nLawrence\nIndividual Development\nAccount Program\n, establish\nFamily Investment Center\nReal Estate\nYouth & Design Center\nFinal Presentation to\nLawrence CommunityWorks\n- Integrate workshops\n- Collect and Share Information\n- Continue GIS Training\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nToday\nReal estate\ndepartment\nprojects\nreflect IDA\nparticipant\ninformation\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nNear Future\nFocus: Expanded\nArea and membership network\nReal Estate\n-Scaled development\nFamily Investment Center\n-Well-oiled machine\nYouth and Design Center\n-Data Collection/Analysis\nCommunity Organizers\n-NeighborCircles\nFinal Presentation to\nLawrence CommunityWorks\nCommunityWorks neighborhood\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nNear Future\nMore & Better Data\nExpanded Area\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nFuture\nFocus: Organizational\noutreach\nFamily Investment Center\nReal Estate\nYouth & Design Center\nCommunity Organizers\nFinal Presentation to\nLawrence CommunityWorks\n\n5.11.04\nDepartment of Urban Studies &\nPlanning\nConclusion\nHow do we get to this vision?\nWhat's next:\n-\n- IDA Participants\n- Youth Members\nhousing needs of\nLawrence residents\nhousing units in\nLawrence\npeople\nplace\nFinal Presentation to\nLawrence CommunityWorks\nCommunityWorks Staff"
    },
    {
      "category": "Resource",
      "title": "Newfinal_report.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/b08bb6760d1b6833edc4cc3519fcf7c9_Newfinal_report.pdf",
      "content": "People and Place:\n\nIndividual Development Accounts, Technology &\nCommunity Revitalization in Lawrence, MA\nMIT Department of Urban Studies and Planning with Lawrence CommunityWorks | Spring 2004\n\nACKNOWLEDGEMENTS\nLorlene Hoyt\nLangley Keyes\nShannon McKay\nKim Alleyne\nAlberto Ortega\nMonica Romis\nValentina Zuin\nDuncan Kincaid\nDaniel Sheehan\nJess Andors\nAnnery Brea\nDeborah Fox\nKristen Harol\nDidier Kouassi\nTamar Kotelchuck\nAndre Leroux\nIris Marte\nJulia McNabb\nAlex Pina\nRafael Revi\nBill Traynor\nValerie Aponte\nReyna Burges\nTrina De Jesus\nPetronilia De la Rosa\nAna Fuertes\nAna Heredia\nGloria Hernandez\nJuana Jimenez\nLuz Mirabel\nMary Moquete\nMonica Ohoa\nFlorencia Otero\nMayra Paulino\nAntonia Payano\nInez Perez\nRose Pierre\nTeofila Richardson\nYvette Romen\nMercedes Solano\nMaria Soto\nMaria Tejada\nAltagracia Valdez\nRebecca Camargo\nJustin Cyr\nFrank Ditren\nRichard Fernandez\nRickey Gonzalez\nReynal Pena\nEvan Perez\nRonald Tapia\nYordi Urena\nPatricia Urena\nArmand Hyatt\nCamille Miragliotta-Daly\nJuan Ortega\nJohn P. Teoli\nW\ne worked with fabulous\npeople this semester\nand we thank you all for a\nwonderful experience!\n\nTABLE OF CONTENTS\nExecutive Summary\nPreface\nIntroduction\nIndividual Development Accounts: National Trends\nCommunityWorks IDA Program\nPeople\nPlace\nSynthesis: Bringing Together People & Place\nBarriers\nRecommendations\nResources\nAppendix A: Participatory Workshop Information\nAppendix B: GIS Maps & Data Tables\n\nEXECUTIVE SUMMARY\nThis is the final report of the Spring 2004 MIT class,\n\"Information and Communication Technologies in Community\nDevelopment.\" The class is part of an ongoing relationship\nbetween the Department of Urban Studies and Planning at MIT\nand Lawrence CommunityWorks.\nOur class was given the task of\ninvestigating the possible expansion of\nthe Individual Development Account\n(IDA) program at CommunityWorks. The\nIDA program is designed to encourage\nasset building through individual saving\nmatched by grants and federal funds. It\nfocuses on financial literacy and future\nplanning, allowing participants to save\nfor starting a small business, paying for\nhigher education, or purchasing a home.\nThe organization would like to expand\nthe program to many more residents of\nLawrence, focusing on homeownership as\na strategy of neighborhood revitalization.\nWe conducted a wide array of activities to gather information\nand create relationships with the many people who participate\nin CommunityWorks programs. In order to better understand\nthe housing stock in Lawrence, we worked with youth in the\nYoung Architects and Young Professionals classes. We used\nhandheld computers to gather data about every parcel in the North\nCommon neighborhood of Lawrence, which we then input into a\nGeographic Information System (GIS) project.\nWe also conducted participatory workshops with IDA\nparticipants in order to gather information about the program\nand the participantsʼ goals for the future. We learned a great deal\nabout the needs of the IDA participants and also helped them learn\nmore about housing options in Lawrence. Finally, we conducted\ninterviews with CommunityWorks staff\nand key stakeholders. These interviews\nallowed us to learn more about program\nadministration and better understand the\nhousing market in Lawrence.\nOur recommendations stem from a\nvision of an expanded and enhanced IDA\nprogram that impacts participantsʼ lives\nas well as the City of Lawrence. This\nreport presents a flexible process in three\nstages: today, near future, and future.\nThroughout these stages, we recommend a\ncontinued focus on three principles: 1) an\nemphasis on living in Lawrence, 2) peer\nsupport and social networks, and 3) youth\ndevelopment.\nOur recommendations are directed not solely at the IDA\nprogram, but at each department within CommunityWorks. We\nrecommend that CommunityWorks continue the housing data\ncollection process as an integral part of the youth programs.\nWe also recommend continuing participatory workshops, across\ngroups, as part of the expanding IDA program.\n\nPREFACE\nThis report is the final output of the MIT Department of Urban\nStudies and Planning (DUSP) class, \"Information and Communication\nTechnologies in Community Development,\" offered in Spring 2004.\nThis class is part of an ongoing partnership of DUSP and Lawrence\nCommunityWorks from 2003 to 2008. A brief description of this\npartnership (from the partnership agreement) follows.\nThe three main partners in this project are CommunityWorks,\nDUSP/MIT, and the City of Lawrence. CommunityWorks and\nMIT conceived this project together based on needs arising\nfrom CommunityWorks' organizing and planning work with\nneighborhood residents and stakeholders, and following\nten years of various student and then alumni involvement\nin the City. The development of CityNet is part of a five-\nyear commitment by MIT to CommunityWorks, in which\nCommunityWorks will become the client for an ongoing series\nof core DUSP practica classes centered around technology as\na tool for revitalization. To the process of project development\nMIT has brought strong technical expertise and knowledge\nof best practices in the field, while CommunityWorks has\nbrought a clear and deep understanding of local and resident\nneeds. This understanding is based on extensive and central\nneighborhood organizing work and experience in dozens of\ncommunity planning meetings with residents as they worked\nto design housing projects, parks and playgrounds, community\ngardens, educational facilities, and youth and family\nprograms. The City of Lawrence is providing access to their\nparcel-level GIS database of the entire City, Departmental\ninformation, and time from their GIS staff person.\nAs defined on its website:\n\"Lawrence CommunityWorks (LCW) is a community\ndevelopment corporation dedicated to the sustained\neconomic and physical revitalization of the City of\nLawrence. LCW had its beginnings in the early 1980s\nstruggle to build affordable housing in North Lawrence,\nand has built or renovated nearly 200 units of affordable\nhousing for the people of Lawrence. Our mission is rooted\nin a commitment to:\n- fostering individual and neighborhood empowerment\nand leadership through organizing residents to develop\neconomically, politically, and socially,\n- producing and preserving safe, decent, and affordable\nhousing for low- and moderate-income families, and\n- creating programs and facilities that help meet the\neducational and economic development needs of\nneighborhood young people, adults, and families.\"\n\nINTRODUCTION\n\nIn Spring 2004, a class from the Department of Urban\nStudies and Planning (DUSP) at the Massachusetts Institute of\nTechnology (MIT) undertook the task of investigating how to\nexpand the Individual Development Account (IDA) program\nat Lawrence CommunityWorks. CommunityWorks has a goal\nof significantly increasing the size of its IDA program and\nencouraging program participants to use their savings to purchase\na home in Lawrence. This would serve two goals: improve the\nlives of participants by enabling them to own a home, and improve\nLawrence by having a set of residents who own their homes and\nare strongly committed to their neighborhoods. Our class set\nabout figuring out a way to accomplish both of these goals. Our\nteam focused on the following four areas:\nHomeownership\nWhile we recognize that homeownership is just one asset type that\nparticipants may select, we were asked to focus on homeownership.\nProcess for Scale\nWe were asked to evaluate the process of creating a large scale\nIDA program and its impact on Lawrence. We have narrowed\nour efforts to creating a process by which CommunityWorks can\nachieve an IDA program of significant scale.\nOrganizational\nInstead of solely looking at the IDA program, the process we\ndeveloped addresses CommunityWorks as a whole.\nNeighborhood: North Common\nWe focused on the North Common neighborhood and on\ndeveloping a model that can be replicated for other parts of the city.\nOur Approach: People and Place\nOur work is split into two main areas of focus: people and place.\n\"People\" refers to current and future IDA participants who want to\npurchase a home in Lawrence. \"Place\" refers to the housing options\nin Lawrence, which are currently too expensive for most participants\nto afford. The goal of this project was to figure out a way to bring\npeople and place together. In order to do this we designed a process\nto gather more information and inform the activities of many\ndifferent parts of CommunityWorks.\nT\nhe ʻLandscape of Opportunityʼ is really in the people.\nCommunityWorks recognizes this and succesfully\ninvests in its members. The next step is ensuring that those\nmembers are equipped with the resources they need to make\nLawrence a great place.\n\nWhat is an Individual Development Account?\n\nAn Individual Development Account (IDA) is a financial\nand economic development tool designed help low-income\nfamilies save and accumulate assets. Sponsoring organizations\nmatch the savings of participants, thereby encouraging residents\nwith low-incomes to save more than they normally would. In\norder to receive the matching funds, residents must purchase\nan asset - typically a home, education, or capital for a small\nbusiness. These assets help to close wealth inequality, which is\nmore disparate than income inequality in the United States. IDAs\nare designed to provide assets to leverage additional wealth and\nengage low-income households in long-term financial planning.\nHistory\n\nIDAs represent an ideological shift from traditional\nwelfare income maintenance policies to a focus on asset building\nand financial independence. In 1997, the American Dream\nDemonstration (ADD) project initiated and evaluated 13 IDA\nprograms across the country. In 1999, the federal Assets for\nIndependence Act (AFIA) was passed, which provided $125\nmillion dollars of funding for IDA programs to be matched by local\nsources. AFIA established IDAs as a primary asset building tool\nfor local organizations. Currently, there are 554 IDA programs in\nthe United States with over 20,000 participants. The vast majority\nfocus on adults and provide some matching funds. IDA savings\nare most often spent on education, small business and home\nownership, with homeownership being the most popular option.\nRefer to the Resources section for more nationwide IDA data.\nINDIVIDUAL DEVELOPMENT ACCOUNTS:\nNATIONAL TRENDS\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFunding\n\nThe primary source of Individual Development Account\nfunding comes from AFIA. Thus far, congress has appropriated\nmore than $95 million in AFIA funding for IDA programs across the\ncountry. While federal funding has been available, the challenge\nfor many IDA programs has been acquiring local match sources\nthat are necessary to access AFIA money. Applicant organizations\ntypically seek money from state government, foundations, and\nbanks with varying levels of success. Additionally, many local\nfunders, particularly foundations, specify that grants should go\ndirectly to match savings. As a result, little money is left for the\noperation and management of the program itself.\nPolicy\n\nThe need for greater support at the local level has driven\nmany state policy initiatives. Collaborations of IDA organizations\nhave proposed state legislation which provides state funding for\nIDA programs and sometimes administrative support for managing\nlarge quantities of IDA accounts. State support is critical for\nIDA programs, as it begins to solve the problem of a lack of\nlocal support to match AFIA funding. As a result, IDA program\ncollaborations lobby state legislators and state administrators to\ncreate funding streams and administrative support for IDAs. In\nmany states, these collaborations have been quite successful, as\n21 states have IDA legislation, and 7 states have administratively\ncreated IDA support.\nMassachusetts\n\nThe Commonwealth of Massachusetts does not provide\nsupport to IDA programs through funding or administrative\nassistance. IDA legislation was proposed, which died in 2001.\nNo new legislation has been introduced since that time. However,\nMassachusetts does have IDA-like programs which encourage\nsavings and asset accumulation for low-income families. One\nis a savings program for public housing residents, and another\nis a subsidized education account program. Where the state has\nnot been particularly supportive of IDAs, funding and technical\nsupport have come from local private and non-profit sources.\nFunding support has primarily come from foundations and banks.\nTechnical support has come from a collaboration of Massachusetts\ncommunity-based organizations that operate IDA programs,\ncalled Massachusetts IDA Solutions (MIDAS). MIDAS is also\nworking towards IDA legislation at the state level.\nAlternative Funding Strategy: New Hampshire\n\nBy the time New Hampshireʼs five-year statewide IDA\nprogram has been implemented, it will have served 500 families,\nmaking it one of the largest IDA programs in the country. In\n2000, the New Hampshire Community Loan Fund (NHCLF)\nwas approached by Concord Area Trust for Community Housing\n(CATCH) to develop a statewide IDA program. After a small\npilot, NHCLF launched its five-year statewide effort funded by\n$2.2 million in match funds from AFIA, foundations, banks, and\nstate TANF money. The program is run in collaboration with\n17 community-based organizations and the University of New\nHampshireʼs Cooperative Extension program, which provides\nthe financial literacy training. NHCLF role is to coordinate with\nthe community collaborators, manage the process, and raise and\nmanage the matching funds.\n\nCOMMUNITYWORKS IDA PROGRAM\nProgram Design\n\nThe Lawrence Community Works IDA program is unique.\nThe elements of the CommunityWorks IDA program that\ndistinguish it form many other national programs are:\n- Place-based\nCommunityWorks seeks to use individual accounts to build a\nstronger community in Lawrence. While the impact of IDA\nprograms on individuals is well documented and studied, the\nimpact of IDA programs on place is not well understood by\nresearchers.\n- Women Only\nSecond, the program, as it currently exists, is solely\nfor women, who are one of the most economically\ndisenfranchised groups in Lawrence.\n- Support, Social Networks\nThird, the LCW program is not only a savings mechanism, but\nalso a support and educational network for IDA participants.\nWomen are able to share their struggles and triumphs in life\nand saving, which attaches participants to the program and\nbuilds social networks and trust amongst Lawrence residents.\nThus, the IDA program is about more than just savings, it is\nabout building community and relationships in Lawrence.\n\nResidents with household incomes that are below 200% of\nthe poverty line are eligible for the IDA program. Women apply\nto the program, CommunityWorks nominates eligible candidates,\nand a lottery is then held for the final list of participants. There are\na total of 36 IDA participants, broken up into three groups of 12.\nGroup One already graduated from the program, Group Two is in\nits second year, and Group Three is in its initial year. Each group\nmeets at least twice a month for two years.\nDuring the two years, IDA participants attend training\nsessions covering skills such as organizing personal finances and\nbuying a home. They also attend more social sessions where\nparticipants get to know each other and provide support through\nevents like spaghetti dinners. They also meet personally with\nthe IDA manager about life, savings, and their trajectory in the\nIDA program. When the participant purchases their asset, every\ndollar that each participant saved is matched with three dollars of\nmatching money. The asset must be acquired in the Merrimack\nValley area, which can be inside of, or outside of Lawrence.\nCurrently, the source of the match money is AFIA and local\nfoundations and banks.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nWhat We Did - Interviews\n\nIn addition to background research on the LCW program, we\ninterviewed Julia McNabb, the youth IDA manager, and Annery\nBrea, the adult IDA manager. The interviews allowed us to ask\nspecific questions about the program related to CommunityWorksʼ\ngoals of scaling up the IDA program in Lawrence. The managers\nsuggested how a larger IDA program might work in the future.\nHowever, they also expressed concerns about how the IDA\nprogram could improve to better serve participants today.\n\nWe also conducted several interviews to understand more\nabout other IDA programs. Margaret Miley of Massachusetts\nIDAs (MIDAS) was very helpful in identifying trends and\nchallenges at the state level. Ben Managan is executive director\nof San Francisco Earned Asset Resource Network, an organization\nthat manages 350 IDA accounts. This interview clarified how this\nparticular organization approached the issue of scale. Stephanie\nBodie of the Center for Social Development at Washington\nUniversity in St. Louis was helpful in understanding both the\nworkings of an urban IDA program, but also what is happening at\na policy level.\nAdministration\n\nThe administration of the IDA program is connected to\nthe community, which, in many ways, defines the program.\nAs mentioned above, there are several social support sessions\nthroughout the year, and the IDA manager meets with each\nparticipant personally at least once a year. The manager knows the\nnames of participantsʼ children and problems women are having\nwith their spouses that prevent them from saving. Additionally,\nmany of the participants were brought into the program through\nthe program manager, who is personally connected to the\ncommunity in many ways. She makes radio announcements\nabout the program in Spanish. She also uses her extensive social\nnetworks in the community to attract eligible participants into the\nprogram. Thus, the integration of the community in these ways\nhas improved social support and marketing of the program.\n\nIDA accounts are held with a local bank, and IDA managers\nare required to keep track of deposits through a database using\nthe Management Information System for IDAs (MISIDA). The\nMISIDA and the bank systems are not connected, and MISIDA\nis not automatically updated when bank deposits are made.\nTherefore, each deposit has to be updated every month into the\nMISIDA system, which is a frustrating and time-consuming\nprocess. Updating the MISIDA requires one full day of an\nadministratorʼs time. Maintaining both the social supports for the\nIDA program and the accounts is a Herculean task for any one\nIDA manager.\n\nPEOPLE\nTo obtain information about the housing needs and\npreferences of IDA clients, we conducted two workshops on\nApril 9 and 16. Although the workshops were a vehicle for\ncollecting information, they were also a venue for facilitating\ndialogue among IDA clients and between IDA clients and\nCommunityWorks staff. In what follows we first summarize the\nprimary objectives of the workshops. Next, we briefly describe\nthe workshop design and planning process. Third, we indicate\nthe number of people who attended the workshops as well as the\nmembers of the facilitators and support team. Fourth, a summary\nof the main activities and findings of the workshops is provided.\nFinally, we outline some of the comments that participants made\nregarding their experiences during the workshops.\nWorkshop Objectives\n- Promote dialogue among participants (and between\nparticipants and CommunityWorks staff) about key issues\nrelated to the program and their individual goals;\n- Strengthen social ties among group participants;\n- Generate interest and commitment to living in and improving\nthe city of Lawrence;\n- Promote dialogue and learning among participants about\nhomeownership, including the benefits and drawbacks of\ndifferent housing types and forms of ownership; and\n- Collect information from participants to assess their demand\nfor housing in Lawrence and the barriers to homeownership\nthat they are experiencing.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nDesigning the Workshops\nThe design and planning process took approximately five\nweeks. We met more than fifteen times for a total of approximately\n35 hours during the semester to plan the various activities of the\nworkshop. We also met with CommunityWorks staff three times\nto obtain feedback and suggestions on the types of activities to\ninclude in the workshops.\nAlthough many of our ideas were adapted from previous\npersonal experiences with participatory workshops in the United\nStates and abroad, most of our ideas were developed through\nbrainstorming as a group. The focus of our efforts throughout\nthe entire design phase was not to develop methods for collecting\ninformation but rather to create processes that would promote\ndialogue and learning among IDA participants as well as between\nIDA participants and CommunityWorks staff. This dialogue\nand learning are necessary to realize CommunityWorksʼ vision\nof bringing people and place together. For this reason, we\nbelieve that these workshops are not just one-time events for\nuse during a semester to collect information. They are tools\nthat CommunityWorks staff can use on an annual basis to ensure\nthat people are discussing and reflecting on issues central to the\nconvergence of people and place.\nIn addition to developing formal activities for the\nworkshops, we designed informal social activities for creating\na relaxed and friendly environment that would foster bonding\nnot only between workshop participants, but also between the\nparticipants and the facilitators. Examples of these informal\nactivities are an ice-breaker game that enabled people to quickly\nbecome acquainted with each otherʼs names, a raffle with multiple\nprizes, salsa dancing and music, and a live guitar concert at the\nend of the second workshop.\nParticipants and Facilitator/Support Team\nEach workshop was held after business hours on a Friday\nfor approximately two and a half hours. Sixteen IDA clients\nattended the first workshop. Two were from Group 1, five from\nGroup 2 and nine from Group 3. In addition, one of the members of\nthe Young Architects group, Rebecca Camargo, who participated\nin the GIS data collection process, also attended the workshop in\norder to learn more about the project and participatory techniques.\nThe second workshop consisted of twelve participants, two of\nwhom were in Group 1, seven in Group 2 and three in Group 3.\nThe workshop facilitators and support team consisted of\nnine MIT students and three CommunityWorks staff members\nduring the first workshop, and six MIT students, one MIT\nprofessor and two CommunityWorks staff during the second\nworkshop. Appendices 1 and 2 provide the names of the\nworkshop participants and members of the facilitators and support\nteam, respectively.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nWorkshop Activities and Findings\nThe activities and findings of the workshops can be grouped into\nthree main categories: (1) About the IDA program, (2) About\nLawrence, and (3) About Homeownership.\nAbout the IDA program\nThis section of the workshop was designed to enable IDA\nclients to share how they heard about the program, why they\njoined and what benefits and challenges they have experienced so\nfar as a result of being part of the program. We also asked them\nto think about how the benefits and challenges of the program\nwould change if the program were expanded to include 35 people\nper class instead of the current 12, and if men were invited to take\npart in the program.\na. How did you hear about the program?\nPeople heard about the program through a variety of means.\nSome women expressed learning about the program through\nAnnery Brea, the IDA program manager, because they were either\nfriends with her or they had had an informal encounter with her\nin and around Lawrence. Two women learned about the program\nbecause they had their children enrolled in after-school activities\nat CommunityWorks. Others said they learned about it through\nword of mouth in their neighborhoods or through flyers. The story\nthat best exemplifies the word of mouth phenomenon observed in\nLawrence relates to a daughter who, upon hearing two strangers\ntalk about CommunityWorks and the IDA program in the street,\nrushed home to tell her mother about it. These differing methods\nof learning about the IDA program are indicative of how deeply\nembedded CommunityWorks is in the community of Lawrence.\nb. Why did you join the program?\nAlthough one woman said that she joined the program to\nestablish a business, all other women mentioned that they were\nthere because they wanted to save money for purposes of buying\na house. One of these women expressed that she wants to buy a\nhome because she wants to accumulate equity that she can use in\nthe future to pay for her childrenʼs 1education.\nc. What benefits and challenges have you experienced since you\njoined the program?\nParticipants were asked to write on index cards the answer to\ntwo questions:\n1. What are the main benefits of being in the IDA program?\n2. What are the biggest challenges of being in the program?\nThe index cards were grouped by facilitators and discussed later\nin the workshop (see part f below).\nd. If the program were expanded to include 35 people per class\ninstead of the current 12, how do you think the benefits and\nchallenges of the program would change?\nInitially, women were concerned about the potential negative\nimpact of a program expansion on the close friendships and\nsupport mechanisms that characterize the program at its current\nscale. However, after some discussion, the women concluded\nthat a program expansion would be desirable because it would\nenable more women to benefit from the program. Hence, a brief\ndiscussion followed that focused on how expansion could occur\nwithout jeopardizing the benefits of a small program.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nParticipants agreed that the highest number of people per\nclass should be 35. It was also mentioned that IDA program\ncoordinators could promote interaction and solidarity among\nIDA clients by compiling class lists with addresses and telephone\nnumbers, which people could then use for coordinating carpooling\nor other types of activities.\nAlso, women thought about new benefits that a program\nexpansion could generate. First, IDA program-related classes\ncould be offered in multiple locations throughout the city\nrather than in just one location. This would reduce travel time\nfor participants and make the program more visible in the\nneighborhoods. Second, the more women that graduate from the\nprogram, the bigger impact they can make in Lawrence if they\nwork collectively.\ne. If the program were expanded to include men, how do you think\nthe benefits and challenges of the program would change?\nInitially, the idea of including men in the program triggered\nsignificant negative reactions from the women. The women\ndid not want men to be part of the program because they felt\nthat the presence of men would prevent them from expressing\nthemselves. The women also said that one of the best things of\nthe IDA program is that it provides them with the opportunity to\nset aside time for themselves away from their hectic lives, and\nthat bringing men into the program would take that time away\nfrom them. They also felt that the difference between menʼs and\nwomenʼs outlooks on life would act as a communication barrier\nbetween the two groups.\nUpon reflection, however, a married woman said that she\nthought that it would be good for her husband to learn how to\nsave and buy a home, but that he should learn separately from her.\nAnother woman mentioned that she thought that the differences\nin perspective between men and women could improve her\nexperience in the program. Hence, the women agreed that if\nmen were included in the program, they could be part of certain\nskills-building classes with women, but that peer support group\nmeetings for women should be held separately from men.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nf. Discussion of index cards created in part c: benefits and\nchallenges.\nThe facilitators then collected and grouped the cards into\ncategories, which were listed on flip charts for purposes of\nguiding a detailed discussion about the benefits and challenges of\nthe program.\nThrough these discussions, we learned that participants\nwere extremely positive in general about the program, and\ncontributed many more answers to the \"benefits\" question than\nto the \"challenges\" question. Comments ranged from learning\nabout savings and financial management to enjoying the social\nand support aspects of the program. Participants wrote about\nlearning the importance of \"paying bills on time,\" looking for\nbank \"hidden fees,\" and \"planning for the future.\"\nThe programʼs value as a support network and place to create\nmeaningful friendships was mentioned by many of the women.\nA number of participants simply wrote \"friendship\" or \"support\"\non their index cards. Another spoke of how the program let her\nreduce stress and realize there is \"a way to get ahead.\"\nMany women also commented that the IDA program gave\nthem the opportunity to buy their first home. One participant\nwrote, \"Itʼs the only way Iʼm going to be able to save for a\nhouse.\"\nThe comments about challenges people faced while in the\nIDA program covered topics both about the program itself\nand difficulties faced outside CommunityWorks. Participants\nacknowledged that it was often difficult to attend the meetings -\nbecause of and family commitments. One participant complained\nof not being able to attend because she was sick, and another\nsaid that her baby is sometimes sick. Participants expressed\nfrustrations related to the large number of meetings required for\nthe program, or the fact that the meetings are sometimes scheduled\nduring inopportune times. People also expressed concern about\nthe meetings consistently starting late. Others said they wanted\nmore education/skills building workshops to be incorporated into\nthe program. Finally, disagreement among workshop participants\nabout the duration of the program was identified. While a few\nGroup 3 participants considered a two-year duration to be too\nlong, Group 1 participants, possibly reflecting nostalgia for the\nprogram, said two years was too short.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nAbout Lawrence\nNext, discussion and community mapping techniques\nwere used to initiate a dialogue among the women about their\nperceptions of the city and their preferred locations for buying\na home. The following sections provide a summary of these\ndiscussions and mapping exercises\nYears of Residence in Lawrence\n\"How long have you lived in Lawrence?\" facilitators asked.\nTable 3 (below) shows that the majority of women in the workshop\nhave lived in Lawrence more than 10 but less than 20 years.\nTable 3: Years of Residence in Lawrence\nNumber of Years\nNumber of People\n1 to 4 Years\n5 to 10 Years\n11 to 19 Years\n20 or More Years\nCommunity Mapping\nFacilitators then conducted a series of community mapping\nexercises to encourage people to consider their social networks\nand the spatial aspects of their daily activities when deciding\nwhere to live in Lawrence.\nFacilitators divided workshop participants into three small\ngroups of three to four people. Each group gathered around a\nmapping workstation with two or more facilitators. Mapping\nworkstations consisted of one large 30\"X30\" map of the city of\nLawrence, a legend indicating the symbols for the information\nrequested from participants, and stickers and markers of various\ncolors for participants to use based on the legend.\nThe information that participants were asked to map were:\n- Where do you live in Lawrence?\n- Where do your friends and family live?\n- What areas do you perceive to be unsafe?\n- Where are the best schools in Lawrence?\n- Where do your children play?\n- Where do your children go to for after-school activities?\n- Where do you go to church?\nAll groups then reconvened as a large group for a more in depth\ndiscussion about the information that had been mapped as well as\npeopleʼs perceptions about Lawrence.\nIDA Client Perceptions of Lawrence\n\"What do you like the most about Lawrence, or why do you\nwant to stay?\" the facilitator asked? Women provided many\nreasons for why they like Lawrence. Some said that they consider\nLawrence to be a safe place, especially compared to their home\ncountries. They described Lawrence as a town with warmth (\"un\npueblito que tiene calor\"), a familiar atmosphere where one can\nshare more with others, and a good place to raise children and get\nold in. \"People know me in Lawrence,\" one woman said.\nThen the facilitator asked what people liked least about\nLawrence, or why they would want to leave. The problems that\npeople reported were poor quality schools, the absence of nice\nparks for children, and the lack of affordable summer activity\nprograms for children under age 12. Although some women\nreported vandalism and stolen cars to be a problem, all agreed\nthat those problems had been substantially reduced since the new\nsheriff came to Lawrence approximately four years earlier. One\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nwoman, who has lived in Lawrence for 18 years, spoke of old\nLawrence with nostalgia: \"A new wave of immigrants came who\nwere primarily on welfare and they increased crime tremendously\nas a result.\" Approximately half of the women expressed that they\nwanted to leave Lawrence.\nAmenities\n\"Why do you live where you live now?\" the facilitator then asked.\nThe main amenities that women mentioned were proximity to school,\nchurch, park, post office, bus stop and hospital.\nLocation of Where People Want to Buy a Home\nFollowing this conversation, facilitators distributed an 11X17 map of\nLawrence to each participant and asked the participants to indicate\non the map the area(s) of the city in which they would want to buy\na home. Maps 1 through 5 below show these areas along with some\nof the spatial information that was collected during the mapping\nexercises described above .\nMap 1: Location of IDA Clients' Current Homes\nAs can be seen in the map above, four of the IDA clients currently\nlive in areas where IDA clients have indicated they would want to\nbuy a home. Also, although IDA clients live in areas throughout\nthe city, they seem to be mostly concentrated north of the\nMerrimack River which roughly divides the city in half.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nMap 2: Location of Friends and Family\nThe above map shows that despite the fact that most of the families and\nfriends of IDA clients are distributed throughout north Lawrence, there\nare some people who would like to buy a house in south Lawrence.\nMap 3: Areas Perceived to be Unsafe\nThe above map shows that most people avoid areas that they\nperceive to be unsafe when deciding where they want to buy their\nhome.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nMap 4: Location of Best Schools, Where Children Play and\nAfter School Activities\nThe above map shows that there is no clear relationship between\nthe location of where people want to buy a home and the location\nof the best schools, where children play and after-school\nactivities. Nevertheless, proximity to schools and parks was\none of the desired amenities that IDA participants mentioned\nwhen discussing why they live where they currently live.\nMap 5: Location of Where People go to Church\nThe above map shows that there is no clear relationship between\nthe location of where people want to buy a home and the location\nof the churches that IDA clients visit. Nevertheless, proximity to\nchurches was one of the desired amenities that people mentioned\nwhen discussing why they live where they currently live.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nAbout Homeownership\nThe final section of the workshop focused on homeownership,\nspecifically assessing womenʼs preferences with regards to\nhousing types and ownership forms.\nHousing Type Preferences\nWe prepared four large 30\"X30\" posters, one for each type\nof housing discussed in the workshop: single-family house, 2-4\nfamily house, multi-family building and mill building. Each\nposter contained photos of the exterior and/or interior of the\nhousing structures it represented.\nAfter briefly describing the four types of housing structures,\nfacilitators distributed three stickers to each participant.\nParticipants were then asked to indicate their preferences by\nplacing their stickers on the correct housing type posters. For\nexample, if a woman had one preference, she could place all\nthree stickers under the poster that represented her top choice. If\na woman had two top choices, she could distribute her stickers\namong these two choices by pasting two stickers on her top\nchoice and one on her second choice.\nFollowing this exercise, the cost associated with each housing\nstructure was introduced: $1,700 to $2,200 per month for single\nfamily homes, and $1,300 to $1,600 for a condo in the three other\nhousing types. Facilitators described these costs and showed how\nthey differed based on housing type. They then distributed three\nmore stickers to the women and asked them to vote one more time\nbased on the new cost information.\nThe introduction of costs resulted in the expected shift in\npreferences. As shown in Table 4 below, the groupʼs a priori\npreferred housing types in order of highest number of votes to\nlowest were single-family house, 2-4 family house, mill building\nand then the multi-family building. After costs were revealed,\nthis order changed to include 2-4 family house first, followed by\nthe single-family house and then by the mill and multi-family\nbuildings.\nTable 4: Housing Preferences Before and After Costs Were Revealed\nHousing Type\nTotal Number of Votes\nBefore Costs\nAfter Costs\nSingle-family\n2-4 Family\nMulti-family\nMill\nWhen the facilitators asked why people preferred single-family\nhomes over other housing types, women responded by saying that\nthey considered them to be more stable investments. They also\npreferred the higher degree of privacy, greater amount of indoor\nspace and the yard that single-family homes usually offer. Lastly,\nthey found single-family homes to be safer than apartments in\nlarge buildings.\nThose who voted for the 2-4 family house said that they did\nso because it was the closest option to the single-family house\nin terms of privacy, safety and space. Those who voted for the\nmill building said that the mill buildings looked beautiful and\nspacious, but that they had to see the interior in real life to confirm\ntheir votes. A lot of women said that they did not vote for the\nmulti-family building because they did not look nice and they\nseemed too crowded.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nWhen facilitators asked why people did not want to live in the\nother types of housing structures, several interesting facts about\nthe shortcomings of this workshop activity were revealed. First,\nsome people did not vote for non-single family housing options\nbecause they thought that they had to buy the whole building rather\nthan just an apartment within the building, and they were afraid\nabout how they would maintain such a building. Others thought\nthat their investment was less stable than in a single-family home.\n\"It is not something that is mine,\" various women said.\nWe also learned that most women did not know that while\nowners of single family homes need to be sufficiently self-\ndisciplined to save for future maintenance costs on their own, the\nowners of condo in multi-family or mill buildings benefit from the\npresence of a management company that charges them monthly\nfees and then sets money aside for future building maintenance\ncosts. Others had not thought about the risks that an owner of a\ncondo in a 2-4 family faces if large maintenance expenses arise\nand no one else in the building is willing to pitch in to cover the\ncosts.\nThe above mentioned comments show that the women had\nnever seriously looked into buying anything other than a single-\nfamily house, and that substantial additional technical information\nneeded to be provided to them if they were to make informed\ndecisions about their housing type preferences. Nevertheless,\nthe exercise was useful in informing workshop participants and\nCommunityWorks staff of the importance of organizing future\ncourses on the advantages and disadvantages of different housing\ntypes.\nForms of Homeownership\nDue to the rising home prices in Lawrence, it is becoming\nincreasingly difficult for IDA graduates to qualify for home\nmortgages. Hence, we wanted to introduce IDA clients to the\nbenefits and drawbacks of collective buying and see what their\nthoughts on the subject were.\nTo introduce the concept of collective buying, the facilitator\nasked five women to stand in the front of the room. The facilitator\nthen asked one of the women to represent individual ownership by\nstanding on her own. Next, she instructed the next two women\nto represent the concept of informal collective purchasing by\nstanding together and holding hands. Lastly, the facilitator\nassigned the remaining two women to represent the concept of\nformal collective purchasing. She did this by placing a chair\nbetween the two women and asking each of them to hold one side\nof the chair. The chair was described as the shared parts of the\nbuilding - the lobby, laundry room, etc.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nThe facilitator then explained the benefits and drawbacks of\neach scenario. The main points that were made for the individual\npurchasing scenario were that although the ownership form\nprovides financial autonomy, independence and control, it is also\nhigh risk because the owner is solely responsible for maintenance\nand insurance costs, as well as mortgage payments. If the owner\ncannot make the full payments, no one else is there with whom to\nsplit the costs.\nThe facilitator described the informal collective ownership\nscenario as an option that offers cost savings for maintenance\ncosts, insurance, yard work, etc. since they are shared among\nthe various homeowners. However, drawbacks exist due to the\ndifficulties associated with having to understand the complex legal\nstructures associated with collective ownership. In addition, having\nan investment partner limits a personʼs autonomy and increases\nfinancial and social risk.\nFinally, the formal collective ownership scenario was described\nas a case where two or more people get together to buy a building\nand then convert it into individual condos. The benefits of this\nendeavor are similar to the informal purchasing scenario in that\nthere are substantial cost savings due to sharing of maintenance\ncosts, insurance, etc. Furthermore, owners of condos experience\nfinancial autonomy, control and independence much like the owners\nwho purchase individually. Some of the main drawbacks, however,\nare the high costs required to convert the units into condos as well\nas the need for the homeowners to understand the complex legal\nstructures of collective ownership. The women were very intrigued\nby these three types of ownership forms and expressed a desire to\nlearn more about them. Andre Leroux from CommunityWorks\nsuggested that additional workshops could be held to cover the\nbasics with regards to housing types and ownership options, and the\nIDA participants unanimously supported his suggestion.\nDebriefing\nAt the end of the second workshop, the facilitator asked the\nparticipants to share their thoughts on their experiences during\nthe workshops.\nPeople said that the workshops were fun and informative at\nthe same time. \"I liked them because they helped me see the\ntruth,\" one woman said. A number of women agreed that it was\nvery helpful to see both the risks and benefits of collective buying\nas well as the differences among housing types. Another woman\nsaid that the workshop had opened her eyes to the possibility of\nbuying a home other than a single-family home. \"I had not even\nconsidered the other options,\" she said. The women also said that\nthey enjoyed reflecting on Lawrence, and learning about what\ntheir other classmates think about the city of Lawrence.\nFinally, the women said that the workshops were well-\nfacilitated. They were especially happy that the workshops were\nheld in Spanish, allowing those without strong English skills the\nability to fully participate.\n\nPLACE\nSophisticated information technologies are emerging as a\ntool for community building efforts of planners and Community\nDevelopment Corporations (CDCs). Websites, Geographic\nInformation System (GIS), and other visualization methods are\nnow available to assist in place-based revitalization efforts. These\ntools facilitate better visioning, concept illustration, community\nplanning & data collection efforts. GIS is perhaps the most\nimportant technological tool available to LCW in its efforts to\nunderstand and expand the IDA program, because it allows for a\nplace-based analysis of community-building efforts not available\nthrough other tools.\nOne of the key questions we needed to answer for this project\nwas how to create a GIS project that would be both useful and\nusable by CommunityWorks. Literature on successful use of GIS\ntechnology shows that useful systems focus on simplicity and small\ntrials (Innes, 1993). Systems which effectively communicate their\nbenefit to all stakeholders will encourage future use. Small trials\nallow users and creators the ability to change systems as needs\nevolve and also build effectiveness over time. A key concern for\nthe sustainability of a project is the capacity of the organization\nto maintain and improve the GIS system (Kellogg, 1999). An\nimportant consideration for CommunityWorks is creating a\ncore group of users who are comfortable with GIS software and\ncan instruct others. Finally, any system must be accessible to\ncommunity members both as a tool and as an expressive device, a\nhelpful way to communicate needs and desires (Talen, 2000).\nThe process we designed to create the GIS project is based\non strong participation from the various youth programs at\nCommunityWorks. We worked closely with the Young Architects\nand Young Professionals programs to collect data for entry into the\nproject and also conducted training on the GIS software. The youth\nprogram participants will continue to be users, administrators and\nadvocates for GIS use across the CommunityWorks organization.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nData Collection\nOur team facilitated collection of two important types of\ninformation related to the IDA program:\n1.\nInformation collected on housing supply in Lawrenceʼs\nNorth Common Neighborhood\n2.\nInformation provided by existing IDA Program\nParticipants\nThe first category of information is intended to assist\nCommunityWorks in encouraging IDA participants to purchase\nhomes in the North Common neighborhood, an area of particular\nconcern to CommunityWorks. The second category is intended\nto help CommunityWorks better understand the needs and\ndesires of existing IDA participants. The ability to visualize and\nanalyze these two types of information (on people and place)\nwill help CommunityWorks to join the housing needs of the IDA\nparticipants with the available supply within the community.\nFuture data collection will allow CommunityWorks to expand its\nunderstanding of the community, and to increase the efficiency of\nits place-based revitalization efforts.\nPocketPCs and Geographical Information System\nTalented youth from CommunityWorks joined graduate\nstudents from MIT to walk the North Common neighborhood\nand collect physical information on the 485 properties therein.\nA series of workshops was conducted with IDA participants to\ncollect information on their needs and desires with regard to\nhome-buying. For further information on specific maps and data\ntables refer to Appendix B.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nComprehensive Binder\nDistributed separately from this report is a comprehensive\nbinder entitled \"Lawrence Community Works: North Common\nArcGIS Project & Data Collection Manual.\" The binder contains\nall information collected during this project related to the supply\nof housing in the North Common Neighborhood, as well as\ninformation collected at the IDA Participatory Workshops, and\ngeneral information about the City of Lawrence. (Additional\ninformation is included on the use and programming of Pocket\nPCs for data collection, use of ArcPad, ArcGIS, ArcExplorer,\nand ArcPad Application Builder.) This wealth of geographic and\ndatabase information will assist Lawrence Community Works\ninto the future with the installation of its first comprehensive\nGeographic Information System (GIS) later this month. MIT\nsecured two licenses for ESRIʼs state-of-the-art ArcView GIS\nsoftware, and will assist with installation and setup of the\nnecessary data and map layers. The five-year collaboration\nbetween MIT and LCW will benefit greatly from this platform of\ninformation, as well as the establishment of a process by which\nnew information can be gathered and added to the system.\nProperty Disribution in North Common\n\nSYNTHESIS: BRINGING TOGETHER\nPEOPLE & PLACE\nHaving conducted a wide array of information gathering\nand community building activities, we next considered how to\nbring people and place together in Lawrence. This synthesis of\nthe information we gathered was aided greatly by a focus group\ndiscussion conducted at CommunityWorks and organized by\nArmand Hyatt, staff lawyer and Board member. The focus group\nconsisted of two real estate attorneys, two local realtors and two real\nestate lending officers from local banks. The discussion focused\non IDA participants, their purchasing power, local housing stock,\nand opportunities for moving IDA members into homeownership.\nThis discussion was useful both as an information gathering tool\nand as a way for these real estate professionals to meet and discuss\nongoing difficulties and new possibilities.\nAlong with conducting various activities to better understand\nboth people and place in Lawrence, we spent time trying to\nunderstand the barriers that kept these two apart. The primary\nbarrier is easy to identify: the high cost of housing in Lawrence.\nEven small condominiums in poor condition cost at least\n$100,000 to purchase. The average IDA participant can afford the\nmonthly payments on a home that costs about $65,000. A more\nadequate home that fills the needs of most program participants\nwill cost around $175,000-$200,000. Homes in the surrounding\nareas are even more expensive. This gap between the purchasing\npower of the program participants and the market price of the\navailable housing stock is the primary impediment to increased\nhomeownership by IDA participants. There are other barriers that\nkeep people out of the home buying market, including an aging\nhousing stock and individual preferences.\nIn order to understand the dynamics of the real estate market,\nwe analyzed recent sales data as well as Multiple Listing Service\n(MLS) listings, a service showing homes currently for sale.\nThis data helped us to identify market levels for Lawrence, and\ncan also be applied at the neighborhood level to understand the\nsubmarkets. This process of reviewing sales and the available\nfor sale market is an ongoing activity that should be repeated by\nthe CommunityWorks real estate department as part of its basic\noperations.\nWe also analyzed the purchasing power of the IDA participants,\nbased on income levels and approximate down payments. The\nmaximum income of IDA participants is set at 200% of the federal\npoverty level. In 2004 this means that in order to participate in the\nprogram an IDA member needs to earn less than $30,000 per year.\nThe average participant probably earns between $20,000-$25,000\nper year. Based on tax and insurance levels, this means that the\naverage participant can afford a home worth between $60,000-\n$80,000 (see Appendix A for detailed calculations). This analysis\ncan be repeated and improved upon with information about \"soft-\nsecond\" mortgages and other mortgage subsidy programs, which\nmay be utilized to increase purchasing power.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nOur discussion with local real estate brokers, lawyers and\nbankers also revealed some of the difficulties in moving low and\nmoderate income residents into homeownership. The available\naffordable options have many problems associated with them.\nOwning a multi-family home and renting out apartments is a\ngood way to lower housing costs, but it involves being a landlord\nand dealing with tenants. This is a very difficult thing for new\nhomeowners to do, with little financial backing to handle a few\nlate rent payments or vacant units. In addition, the maintenance\ncosts of 2-4 family homes are quite high and these homes can\nbe difficult to maintain if funds are not properly budgeted by the\nowner.\nPurchasing a home with another participant (informal\ncollective purchasing) is also a way to reduce home costs, but it is\na very risky proposition for most families. This process involves\njointly purchasing a home, making each individual responsible\nfor making monthly payments. It is a useful option for some,\nespecially single mothers who can use assistance with child care\nand chores. But leaving such an arrangement is difficult as it\nnormally involves selling the home, which each owner may want\nto do at a different time. This arrangement requires a great deal\nof trust and communication between owners and is therefore only\nrecommended for close friends and family members who have a\nclear exit strategy and understanding of the balancing act required\nto make it work.\nFinally, owning a portion of a larger building may be the\nbest option for many low and moderate income residents. The\npurchase price of a condominium is generally lower than for\na single-family home because the size of condos is lower and\ncertain features (entrances, utilities, etc.) must be shared with\nother owners. One possibility for IDA participants is to purchase\na three family home and then \"condominiumize\" it, splitting it into\nthree separate units which would then be owned by the individual\nfamilies. The primary problem with doing this is that it requires\nsignificant upfront costs for engineers and attorneys who are\nneeded to draw up legal documents and structural arrangements\nfor the condominium association. These costs may push the cost\nof this option out of the range of IDA participants.\nThere are also difficulties in matching the housing desires\nof IDA participants and the housing options in Lawrence. Our\nworkshops with IDA participants revealed that many of them did\nnot necessarily want to purchase a home in Lawrence, and almost\nall wanted to own a single family home. Much of the housing\nstock in Lawrence is of the multi-family variety, especially in the\ncore neighborhoods that CommunityWorks will focus on into the\nforeseeable future.\n\nThe focus groups, workshops and basic financial analysis we conducted revealed a set of barriers that CommunityWorks will\nneed to overcome if the IDA program can be successful in helping program participants purchase their homes. We have grouped\nthese into three major themes of homeownership, program administration and institutional partnerships.\nHomeownership\n- Housing preferences Amongst Participants\nMany program participants expressed a desire to leave\nLawrence for various reasons, including crime, schools and\npoor housing. If participants do not want to live in Lawrence,\nthe program goal of people helping transform the place cannot\nsucceed.\nProgram participants also expressed a desire to live in the\nparts of Lawrence which are already in good condition, namely\nProspect Hill and South Lawrence. These neighborhoods do not\nneed as much improvement as the CommunityWorks expanded\nservice area, which is one of the places that the IDA program can\nhelp transform. IDA members need to want to participate in the\nimprovement of a neighborhood, not just move to already high\nquality areas.\nThe disconnect between the desire of program participants\nto live in a single family home and the available housing stock\nin Lawrence must be addressed by CommunityWorks. If IDA\nmembers do not want to purchase the types of homes that are\navailable in Lawrence, they cannot help to transform the city.\n- Timing\nThe five-year time limit on AFIA funds presents a barrier for\nmoving participants into homes. This is especially true for those\nin Groups 2 & 3 since they face the same deadline as those in\nGroup 1.\nBARRIERS\nProgram Administration\n- Maintaining Intimacy\nThere is a basic contradiction between the most important\nstrength of the IDA program, its intimacy and support structure,\nand the future goal of dramatically increasing the program size.\nAs the IDA program expands it needs to maintain that intimacy\nand peer support if it is to be successful.\n- Integrating entire families into the IDA process\nAs the program expands it will need to include a broader\nrange of people, integrating men and other family members into\nthe IDA process. Integrating these new people into the program\nwill require a delicate balancing process in order to expand the\nprogram and maintain its high quality.\n- Focusing on one area of Lawrence could lead to gentrification\nAs CommunityWorks picks concentration areas to help program\nmembers move into, they hope these neighborhoods will improve.\nThe classic problem with improving neighborhoods is gentrification,\nthe process of middle class outsiders moving in, improving homes\nand increasing housing prices. If the concentration areas improve,\nit will attract middle class residents who have been priced out\nof other parts of the Boston area. A way of dealing with this\npossibility should be part of the CommunityWorks strategy.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nInstitutional Partnerships\n- Reviviendo Gateway Initiative (RGI)\nThe progress made by RGI, and the role that CommunityWorks\nhas played in that effort, is commendable. The 11,642 new\nresidents that RGI predicts will be drawn to Lawrence will have\na significant impact on the housing market, and therefore the\nsuccess of the IDA program. RGIʼs work should take into account\nCommunityWorksʼ efforts and vice versa.\n- City of Lawrence\nEfforts to align people with place, make change on a large\nscale, and support youth development, are all hampered by\nthe politics of City government. It has been demonstrated that\nsuccessful IDAs have strong partnerships with City and local\nadministration. To date, the Cityʼs lack of support has been a\nfrustration. In moving the IDA program to scale, having the\nsupport of the City of Lawrence will be critical.\n- State of Massachusetts\nWhile\nthe\nMassachusetts\nIDA\nSolutions\n(MIDAS)\ncollaborative is making significant progress towards raising the\nprofile of asset-building programs at a state level, Massachusetts\nstill has no legislation on IDAs. This barrier leaves only federal,\nfoundation, and private funding options for the IDA program.\nOther states have passed legislation, for example, making accrued\ninterest tax-exempt, allowing TANF money to be used towards\nIDAs, and allocating tax credits for organizations to provide\nmatching funds. This lack of state support in Massachusetts\nrepresents a tangible barrier to going to scale.\n- Other organizations\nAs the IDA and other FAB programs expand, coordination\nwith other organizations - churches, schools, social service\nagencies, etc. - will be more and more critical. In terms of\nmarketing, funding, facilities, etc., CommunityWorks will need to\ncollaborate with other organizations in Lawrence and the region.\n\nGiven the mission of envisioning a large-scale IDA program,\nwe designed a process with direct recommendations for certain\ndepartments that is also flexible enough to be adapted and\napplicable to a long-term vision. The process does not outline a\nspecific number of participants at each stage because the goal is for\nCommunityWorks to evaluate progress and define scale for itself.\nThe following recommendations are based on what we imagine to\nbe the challenges at several stages of scaling up the IDA program\nat Lawrence CommunityWorks. It is also a combination of what\nwe observed at CommunityWorks and what we have investigated\nnationally.\nThe process is outlined with several time periods that indicate\nthe immediacy of the next steps necessary for each department.\nNote that although these suggestions are listed chronologically\nand by department, all parts are equally important in informing\ncurrent decisions. Each department should understand the long-\nterm vision and how other departments are integral to that vision.\nIdeally, there is an individual (or a committee) who could guide\nand assess the process as a whole. This entity should also be\nresponsible for implementing a regular and thorough evaluation\nprocess of each department and the organization. Seeking\nparticipant feedback is a valuable part of this process.\n\nT\nhere are three principles that should continue to\nbe strong themes in all the work that goes on at\nLawrence CommunityWorks:\n1) Focus and emphasis on the importance of staying in\nLawrence\n2) Peer support and social networks are at the core of all\nefforts\n3) Encouraging youth development as integral to the\nsustainability and vitality of Lawrence.\nRECOMMENDATIONS\nTODAY\nNEAR FUTURE\nFUTURE\nRecommended Phases\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nL\nESSONS LEARNED\n\nWorkshop:\nThe housing type discussion during the\nsecond was enlightening but incomplete. A more complete\ndescription of different housing types along with costs and\nbenefits should be part of future discussions.\nThis phase addresses the challenges we identified within the current program that hinder the\nsuccess of going to scale. Our greatest concern at this stage is impressing upon residents that\nthere are opportunities to own a home in Lawrence. Making this work with current participants is\nimperative to any steps to follow. TODAY focus on the Individual Development Account Program\nas it exists with the goal of promoting a commitment to homeownership in Lawrence.\nTODAY\nIndividual Development Account Program\nAccount Administration:\n-\nEstablish the Family Investment Center\n- Ensure that all account statements are updated monthly and\ndistributed to participants.\n- Establish a direct deposit system. This helps with insuring\nthat people are indeed using their work income. Without a\ndirect deposit system, the updating the accounts in MISIDA\noften falls behind. The problem with this is that AFIA requires\nthat an accurate record of accounts be maintained to withdraw\nmatch monies. If accounts are not in order, federal match\nmoney will not be available when IDA participants are ready to\npurchase their assets. Without up-to-date statements, the federal\ngovernment may take several months to deliver a check. When\na participant is ready to purchase a home, she may not be able\nto acquire it because of her inability to move quickly enough.\nAdditionally, there is a small window of opportunity for many\naccounts to be placed in order. The deadline for purchasing an\nasset with AFIA money for the group of IDA participants that\nhas already graduated is less than two years. These graduates\nwill soon be scrambling to acquire their assets, and their account\ninformation should be updated well beforehand.\n- Considering the approaching five-year time limit, emphasis\nshould be placed on assisting Group One participants to\npurchase their asset.\nWorkshop/Curriculum/Marketing Administration:\n-\nOutreach to first time homebuyers and savings club members\n-\nThe summer barbeque that beings together all the participants\ncan also be a celebration and acknowledgement of the graduates of\nthe program. Holding biannual celebrations for alumni would be\nencouraging for participants.\n-\nEncourage IDA participants to attend RGI meetings, especially\nsessions like the charettes that were held in April and May 2004.\n-\nContinue participatory workshops. Many aspects of the\nparticipatory workshops that we conducted will be very useful to\nthe IDA program. Housing type preference discussions and some\nmapping exercises uncovered interesting trends and were very\neducational for program participants. These discussions should\ncontinue in some form, either as separate workshops or as part of\nthe IDA program already in place.\n-\nConduct exit surveys of each participant. An example from\nCentral Vermont Community Action Council is listed on the CFED\nIDANetwork website.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFamily Investment Center (FIC)\nWe imagine that the FIC will be able to address asset\nbuilding holistically as an umbrella group that oversees all\nsavings, homebuyer education, fi nancial literacy, and adult and\nyouth IDA programs.\nInstead of a collection of stand-alone programs, FIC will be\na place where CommunityWorks members can be connected to\nthe continuum of programs and services available. The Center\nwill also coordinate partnerships with collaborators such as banks,\nrealtors, and universities.\nFor example...\nPossible Participant Pathway\n1)\nIt is April 2005, and a Lawrence resident, \"Solana,\" needs help on\nher taxes. A friend mentions that CommunityWorks provides tax\npreparation services.\n2)\nShe visits the Family Investment Center where she receives help\nfrom Carla to complete her tax forms.\n3)\nCarla refers her to Enrique, a representative from Lawrence Savings\nBank, who helps her open a new savings account that day.\n4)\nSolana is then invited to join CommunityWorks as a member and\nlearns about the other programs and services available.\n5)\nNext month, Solana joins the Savings Club, meeting other single\nmothers in her neighborhood. Her two kids join the Young\nProfessionals program.\n6)\nIn 6 months, after making progress in repairing her credit and\nbuilding some savings, Solana reaches a benchmark so that she now\nqualifi es for the IDA program.\n7)\nAt the same time, she is identifi ed as a potential neighborhood\nleader, and starts a NeighborCircle.\n8)\nOne day, Solana picks up a fl yer from the real estate department\nfeaturing a new three family building with units for sale. She meets\nwith Patricia in the real estate department to discuss the options of\npurchasing the home.\n9)\nIn 2 years, after graduating and purchasing her fi rst home, Solana is\ntrained and certifi ed, through a partnership with Cambridge College,\nto become an Alumni IDA Instructor.\nNational Examples:\nExtra-Credit Savings program\n\"The Extra Credit Savings Program is a partnership between\ntwo organizations that have an interest in building the fi nancial\nstrength of families and communities. ShoreBank got involved\nbecause it wanted to encourage saving, asset building and wealth\ncreation in the mostly African-American communities that\nare its Chicago base. The Center for Law & Human Services\nwelcomed the bankʼs interest because each year, the center must\nfi nd convenient, secure locations for its tax preparation centers.\nShoreBank offered attractive and well located spaces - free of\ncharge - for the evening and weekend tax preparation sessions,\nwhile providing the extra service of opening bank accounts for\ndirect deposit of refunds.\" -MONEY IN THE BANK: The Extra Credit\nSavings Program How Federal Tax Refunds and Credits Help Households\nBecome Bank Users\n\"Get Checking\" Program, Asset Building Coalition\n\"In this model, certain functions, such as case management or\nfi nancial education, are conducted by other complementary\norganizations. The Milwaukee site, for example, refers IDA\nparticipants who need intensive fi nancial literacy training to\nthe citywide \"Get Checking\" program. This program is part of\nthe citywide Asset Building Coalition, a partnership of thirteen\nlocal fi nancial institutions and other organizations that promote\nfi nancial education and asset building among the cityʼs unbanked\nhouseholds. Those who are not eligible for checking accounts\nare able to enroll in a four-session fi nancial literacy course taught\nby several providers. Those who complete the program and who\nhave resolved their debt problems are presented with a certifi cate\nthat allows them to open a checking account at a participating\nbank or credit union. In turn, IDAs are valuable asset-building\ntools for the citywide initiative as well.\" -Abt Associates, 2002,\nAssets for Independence Act Evaluation: Second Annual Site Visit Report\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nDesign Center & Youth Programs\n-\nAfter getting the GIS software, consider the possibility\nof starting another program. The success of this program is\ncontingent upon a demonstrated interest and long-term, focused\nproject that is integrated into other current programs and\ndepartments.\no For example: integrate GIS with the work of the Young/\nJunior Architects class.\no Use GIS project to inform the work of the Reviviendo\nGateway Initiative, gathering data and producing maps\nand data reports.\no Continue housing data collection in areas designated in\nconjunction with real estate department.\nReal Estate\n-\nContinue to meet with real estate agents, lawyers and bankers\nthat understand the Lawrence housing market. These same\nrepresentatives can help with informing both the real estate\ndepartment and the individual development account program about\nopportunities within the Lawrence market.\n-\nInvestigate the realities of condominiums and cohousing:\nadvantages and disadvantages.\nAssessment & Evaluation\nPeriodically assess progress of the departments and\norganization to attain short and long-term goals. Frequent\nevaluations to participants provides valuable feedback on how\nbest to fit their needs.\nL\nESSONS LEARNED\n\nWorkshop:\nMapping exercises are difficult and time\nconsuming. Adequate time should be set aside in order for people\nto orient themselves and feel comfortable. Special care should be\ntaken to ensure accurate data and full participation by everyone.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nNEAR FUTURE\nWe imagine that at this point the character of the program is shifting because the\nnumber of participants requires more administration and the cost of the program\nis considerable. In the NEAR FUTURE continue to generate commitment\nin North Common and designated expanded area by focusing on Lawrence\nCommunityWorks integration and tightening the expanding network.\nFamily Investment Center: Individual Development\nAccount Program\nAccount Administration:\n- Work with MIDAS to figure out a collective accounting system.\nWorkshop/Curriculum/Support Administration:\n- Begin integrating alumni into workshop facilitation: qualify\nthem as \"financial fitness\" instructors through local universities\nor agencies that certify instructors.\n- Consider services that can be contracted out and those that need\nto stay in house.\n- Consider how to address differing low-income populations.\n\"Advance market segmentation; IDA initiatives need to develop\nmore expertise in market segmentation. Not all IDA participants\nneed extensive support services. Some may need just the\nopportunity to open an IDA or asset-specific training. Not all\nparticipants need the same support and instruction and tailoring\nthe program to needs could be more cost effective.\" (Zednek 10)\nThe San Francisco Earned Assets Resource Network (SF EARN)\nis an umbrella organization for several others in the area and also\nholds its own accounts. They serve a large immigrant population\nand use an approach that considers its members in three\ndifferent phases of financial independence. Those who are the\n\"established working poor\" usually need the least amount of case\nmanagement, the recent transition immigrants, and the immigrant\nworking poor usually need the most case management.\n- Consider how to increase the number of participants and meeting\nplaces. Work with the community organizers to develop\nalternative satellite sites that are local to pockets of current IDA\nparticipants and NeighborCircles.\n- Outline a strategy for ensuring that the quality of participation\namongst IDA members remains high. Possibly implement higher\nqualifications for enrolling in the IDA program. For example, a\nPittsburgh site has adopted a \"triage system that gives everyone\nthe opportunity to work toward IDA participation, but allows it\nonly for those who are within 12 months of being mortgage-\nready. Individuals who work hard to become mortgage-ready\nare allowed the opportunity to enroll in the IDA project.\"-Abt\nAssociates\n- Establishing a continuum of services (from member to saver to\nIDA participant) can also help shorten the wait list for IDAs and\nget people saving as soon as possible.\nL\nESSONS LEARNED\n\nWorkshop:\nAll activities took much longer than\noriginally planned. Care should be taken to allocate enough\ntime for workshop activities, even if certain parts need to\nbe sacrificed or taken up in the future. Time should also be\nallocated for evaluation of activities.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nReal Estate\n- Investigate ways to preserve funding and protect affordable\nhousing. Concepts like community land trusts, limited-equity\ncooperatives, and mutual housing associations can help address\nissues of affordability for individuals, community development\nand sustainability of funding. Resident Ownership Mechanisms\n(ROMs) will be critical to stabilizing prices and preserving\naffordability. See \"Sharing the Wealth: Resident Ownership\nMechanisms\" by PolicyLink, 2001.\nCommunity Organizers\n- The Community Organizing department can play a critical\nrole in the success of the IDA program. NeighborCircles\nalready represents a promising outreach process within LCW\nthat the IDA program should utilize. Through NeighborCircles\nthe Community Organizing Department can advertise and\nidentify strong candidates for the IDA program. Additionally,\nNeighborCircles can also serve as a geographic framework for\nfuture IDA groups. IDA groups could meet at the block level,\nwhich would create stronger ties between individual development\nand place. IDA group discussion could not only focus on social\nsupport and financial planning, but also could focus on how groups\nof neighbors can upgrade their own block through buying locally.\nThus, Community Organizing can provide marketing assistance\nand a geographical framework for future IDA groups.\nDesign Center\n- Continue data collection in target neighborhoods\n- Work with IDA program, helping workshops with mapping\nexercises\n- Conduct \"visioning\" sessions with RGI and other planning\nprograms\nL\nESSONS LEARNED\n\nData Collection:\nThe simplicity of the forms on the\nPocketPCs was very useful in making the data collection move\nsmoothly. Care should be taken not to complicate the process\nwith too many data fields or too many subjective judgments.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFUTURE\nAt this point, near future plans have been fully implemented. All departments in CommunityWorks\nactively play a role in the IDA program, from recruitment to training to information resources. The\nIDA program is a well-oiled machine, with many different players helping it work well. For the\nFUTURE phase, focus on integrating CommunityWorks with the City of Lawrence, RGI and\nother partners. Advocate on a state and regional level for IDAs and affordable housing.\nAs the program increases in size and impact, the focus\nof the organization should shift to external institutions. The\nRGI committee, the City of Lawrence, and state and federal\ngovernments are among the institutions that are needed to help\nthe IDA program operate to its fullest capacity. These institutions\nare important because they will enable increased funding and\nlegislative support for the IDA program and assist with the real\nestate activities of IDA participants.\nWe also imagine that coordinating at the state level with\nother IDA programs would be advantageous for funding and\npolicy-level work. On the national level, many are currently\nadvocating for IDA tax credits, and CommunityWorks should be\nin a position to advocate and take advantage of this resource. This\nwould provide funding much like current affordable housing tax\ncredits. This is an example of the type of outreach and creative\nthinking that is necessary to expand the IDA program and ensure\nits sustainability.\nThere are few specific recommendations for the far future. We\ndo not presume to be able to predict exactly how CommunityWorks\nand the IDA program will evolve over the next few years, so it is\ndifficult to predict what will be necessary at that point. More\nuseful is a look at important issues for CommunityWorks to\nconsider as the program expands and improves.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFamily Investment Center: Individual Development Account\nProgram\nWorkshop/Curriculum/Support Administration:\n\"Provide online financial education and asset-specific\ntraining. IDA participants should have the option of taking\nfinancial education and asset specific training in a classroom\nsetting or online. The online setting allows participants to learn\nat different paces and reinforces the lessons through exercises and\nother interactive learning techniques. Online financial education\nand asset specific training should be available in languages other\nthan English. Key stakeholders are practitioners and national\nnetworks\" (Zednek 11).\nReal Estate\n-Analyze the impact of IDAs on the housing market. See example\nof Atlanta work. LCW could take a similar approach towards\nmeasuring the effects of the IDA program on place. Data was\ncollected in the workshop about which areas of Lawrence are\nunsafe. Three years from now, after there is a critical mass of IDA\ngraduates in homes, data could again be collected about which\nareas are unsafe in 2007. Areas that have changed from \"unsafe\"\nto \"safe\" could be spatially related to IDA home purchase locations\nto show the IDA programʼs neighborhood impact.\nGeorgia Tech Data and Policy Analysis Group\nThe primary think tank for IDAs in the country, the Center for Social\nEnterprise Development (CSD) acknowledges that limited research exists on\nhow IDAs have place effects in neighborhoods. This question is critically\nimportant for community-based IDA programs and community development\nfoundations, as they are not only interested in how IDAs can improve\nindividualʼs lives, but also how IDAs can improve neighborhoods. As a\nresult, CSD funded a study to be executed by Georgia State and the Georgia\nTech Data and Policy Analysis group (DAPA) in Atlanta that would fill this\nresearch gap.\nDAPA found that spatial analysis using GIS was essential to understand\nthe impact of IDA programs. They evaluated three Atlanta intown\nneighborhoods over two years, and used GIS to relate the location of\nIDA home purchases to neighborhood indicators, such as building code\nviolations, trash, vandalism, home sales amount, and vacant lots. Thus, IDA\nsponsor organizations could begin to answer questions, such as:\n-\nDoes vandalism decrease near areas where IDA participants\npurchased homes?\n-\nDo property values increase in areas where IDA participants\npurchased homes?\n-\nIs there less trash in the streets close to where IDA\nparticipants purchased homes?\nL\nESSONS LEARNED\n\nData Collection:\nCertain details, such as how to assess\nvacant lots and building types, need to be figured out before\ngoing into the field to gather data. This is necessary to insure\nconsistency of the data in the GIS project.\n\nRESOURCES\nResearch and Policy\nwww.cfed.org (r) \"The Center for Enterprise Development\n(CFED) fosters widely shared and sustainable economic\nwell-being. CFED promotes asset-building and economic\nopportunity strategies, primarily in low-income and\ndistressed communities, that bring together community\npractice, public policy, and private markets in new\nand effective ways.\" They also host a site called the\n\"IDAnetwork\" (www.idanetwork.org) that has several\npublications on everything from IDA program design, to\nfunding, to accounting practices.\nCenter for Social Development at Washington University\nin St. Louis\nhttp://gwbweb.wustl.edu/csd/Areas_Work/Asset_\nbuilding/IDAs/Adminstration.htm\nZdenek, Robert and Beverly Stein. Recommendations from the\nField: Individual Development Accounts as Part of a Universal\nAsset-Building System. Center for Social Development, Washington\nUniversity in St. Louis, 2003.\nUsing GIS for Community Development\nTalen, Emily. Bottom Up GIS: A New Tool for Individual and\nGroup Expression in Participatory Planning. American Planning\nAssociation Journal, Summer 2000, Vol. 66, No. 3.\nInnes, Judith and Simpson, David. Implementing GIS for Planning.\nAmerican Planning Association Journal, Spring 1993, Vol. 59, No. 2.\nKellogg, Wendy. From The Field: Observations On Using GIS To\nDevelop A Neighborhood Environmental Information System For\nCommunity-Based Organizations. URISA Journal, Spring 1999, Vol.\n11, No. 1.\nBest Practices/Case Studies\nAbt Associatesʼ Assets for Independence Act Evaluation\nhttp://www.abtassociates.com/reports/AFIA_2nd_annual.pdf\n\nAdministration\nBaggett,\nWalter.\nINDIVIDUAL\nDEVELOPMENT\nACCOUNTS: AN ACCOUNTING AND AUDITING GUIDE\nSharing the Wealth: Resident Ownership Mechanisms,\nPolicy Link Report, 2001. Highlights include pages 94-101. This\noutlines mechanisms for preserving affordability for individuals\nand the community.\nMoney in the Bank: The Extra Credit Savings Program - http:\n//www.shorebankadvisory.com/resources/moneyinthebank.pdf\nHow-to guide for outreach on tax credits\nCenter on Budget and Policy Priorities CBPP offers a free,\ndetailed how-to guide to develop and implement outreach\nstrategies around the Earned Income Tax Credit. It includes\nguidelines and ideas on staffing, timing, promotion and technical\nconsiderations. The materials can be viewed at www.cbpp.org or\nordered by mail from Center on Budget and Policy Priorities, 820\nFirst St., NE, Suite 510, Washington, DC 20002; telephone 202-\n408-1080.\nOutreach to promote the Earned Income Tax Credit City of\nChicago Mayorʼs Office of Workforce Development\nThe city of Chicago has aggressively promoted the benefits\nof the Earned Income Tax Credit to help bring more federal\ndollars back into the local economy. Intensive outreach through\nemployers, community organizations, newsletters and grocery-\nbag advertisements helped attract households to free tax-\npreparation services, where they claimed an estimated $16 million\nin EITC refunds. A booklet and Web site describe the outreach\nstrategies. Contact Julie Rubins Wilen at 312-744-WORK or visit\nwww.chicago-eitc.org\n\nAPPENDIX A\nIDA Participants in Workshops 1 and 2\nParticipants\nApril 9, 2004\nParticipants\nApril 16, 2004\nFirst Name\nLast Name\nFirst Name\nLast Name\nInez\nPerez\nFlorencia\nOtero\nTeofila\nRichardson\nTeofila\nRichardson\nAna\nHeredia\nReyna\nBurges\nGloria\nHernandez\nTrina\nDe Jesus\nJuana\nJimenez\nPetronilia\nDe la Rosa\nMonica\nOhoa\nGloria\nHernandez\nAntonia\nPayano\nJuana\nJimenez\nValerie\nAponte\nMonica\nOchoa\nAna\nFuertes\nAntonia\nPayano\nLuz\nMirabel\nAna\nFuertes\nMary\nMoquete\nMary\nMoquete\nMayra\nPaulino\nRose\nPierre\nYvette\nRomen\nMercedes\nSolano\nMaria\nTejada\nAltagracia\nValdez\nMIT and CommunityWorks Staff in Workshops 1 and 2\nWorkshop 1: Friday, April 9\nMIT\nLCW staff\nYouth\nJames Alexander\nAnnery Brea\nRebecca Camargo\nClaudia Canepa\nNelson Butten\nShannon McKay\nAndre Leroux\nAlberto Ortega\nAndy Port\nSolana Rice\nMonica Romis\nMelody Tulier\nValentina Zuin\nWorkshop 2: Friday, April 16\nMIT\nLCW staff\nJames Alexander\nNelson Butten\nClaudia Canepa\nAndre Leroux\nLorlene Hoyt\nAlberto Ortega\nEd Pauls\nMichael Weisner\nValentina Zuin\n\nData Collected on Housing Supply in the North Common\n1.\nLand Vacancies\n=Yes (Skips to # 6 below?)\nNo\n2.\nBuilding Occupancy (Appears to be):\n- Occupied\n- Vacant\n3.\nCurrent Use Type (Pulldown):\ny Single Family\ny 2-4 Family\ny Multi-Family Buildings (5 or more)\ny Mixed Use\ny Commercial\ny Industrial\n4.\nEstimated Number of Existing Housing Units\n(Pulldown):\n- (1,2,3,4, 5,6, More than 6)\n5.\nBuilding Material:\nBrick\nVinyl\nWood Siding\nShingles\nOther\n6.\nGeneral Condition of Structure:\ny Excellent\ny Good\ny Moderate\ny Poor\n7.\nGeneral Condition of Land:\ny Excellent\ny Good\ny Moderate\ny Poor\n8.\nPhotographs ID # (Type) or N/A\n9.\nComments Field (Story/History/Additional\nComments)\n\nParcel Ownership in North Common\n2-4 Family Homes in North Common\n\nAdditional Data Available in ArcGIS Project\nCreated by MIT (partial listing)\nCity Parcels & Assessors Data (2004)\nAssessors Tiles\nNorth Common Neighborhood\nB&W Aerial Photos\nSchools Locations\nMunicipal Parks\nFlood Zones (100/500 Year) & Upland Areas\nSpicket Watershed\nTopography\nWaterways & Waterbodies\nRoads (Tiger & City with Street Names)\nWards & Precincts\nZoning Layers & Existing Land Use\nMA Cities & Towns\nRegional Planning Agency Areas\nSchools Locations\nMunicipal Parks\nHigh-Quality Color Orthophotos\nMHD Roads & Centerlines\nCommuter-Rail & MVRTA Routes\nCensus Block Groups\nProtected & Recreational Open Space\nState Register of Historic Places\nNeighborhood Boundaries\nHistoric Districts\nMap of Amenities in North Common\n\nData Collected on Housing Demand by IDA Participants\nNo.\nLayer Title Concept\nFile Name (3 files\neach)\nType (Point/Line/\nPolygon)\nWhere are the bad\nplaces?\nbadplaces\nPolygon\nWhere would you buy a\nhome?\nbuyhome\nPolygon\nWhere do your friends\nand family live?\nfriendfamily\nPoint\nWhere are the best\nschools?\nbestschool\nPoint (\"snap to\" existing\nschool points)\nBest places where your\nchildren play?\nchildplay\nPolygon\nWhere do your children\ngo to for after school\nactivities?\nafterschool\nPoint\nWhere do you go for\nchurch?\nchurch\nPoint"
    },
    {
      "category": "Resource",
      "title": "NewFinalPresentation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/1fe6cf5c8e06993f376511df2e56e35c_NewFinalPresentation.pdf",
      "content": "Final Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nWelcome! Bienvenidos!\nVision\nOur vision is an expanded and improved IDA Program that\nincreases opportunities for those who want to own a home in\nLawrence.\nWe designed a process that Lawrence CommunityWorks can\nuse to identify and assess development opportunities as well\nas the needs and demands of program participants.\nhousing needs of\nLawrence residents\nhousing units in\nLawrence\npeople\nplace\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPeople\nGoal: Learn about IDA Program and understand participants'\nhome-buying preferences\nWhat We Did:\n- Staff Interviews\n- Nationwide Research\n- Participatory Workshops\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPeople\nParticipatory Workshops:\n-\nWhy People Join the IDA Program?\n-\nWhat People Like About Lawrence?\n-\nWhere People Want to Live in\nLawrence?\n-\nHousing Type and Ownership\nPreferences\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPlace\nGoal: Learn about Housing Opportunities in the North\nCommon as a part of Lawrence\nWhat We Did:\n- Field Survey with Youth\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPlace\nGoal: Learn about Housing Opportunities in the North\nCommon as a part of Lawrence\nWhat We Did:\n- Field Survey with Youth\n- Constructed GIS Project for\nMapping & Analysis\n- GIS Training\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nMIT / CommunityWorks Project\nPlace\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nFinding Barriers\nHomeownership\n-\nCost, Quality, Preferences\nOrganizational\n-\nCharacter, Administration\nInstitutional\n-\nCity of Lawrence, Other Organizations\npeople\nplace\n=\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nToday\nNear Future\nFuture\nIDA Program\nEnhancements\nCommunityWorks\nIntegration\nSustainability: City/RGI,\nBanks, State\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nToday\nFocus: Encourage\ncommitment to\nhomeownership in\nLawrence\nIndividual Development\nAccount Program\n- Integrate workshops, establish\nFamily Investment Center\nReal Estate\n- Collect and Share Information\nYouth & Design Center\n- Continue GIS Training\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nToday\nReal estate\ndepartment\nprojects\nreflect IDA\nparticipant\ninformation\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nNear Future\nFocus: Expanded\nCommunityWorks neighborhood\nArea and membership network\nReal Estate\n-Scaled development\nFamily Investment Center\n-Well-oiled machine\nYouth and Design Center\n-Data Collection/Analysis\nCommunity Organizers\n-NeighborCircles\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nNear Future\nMore & Better Data\nExpanded Area\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nRecommendations\nFuture\nFocus: Organizational\noutreach\nFamily Investment Center\nReal Estate\nYouth & Design Center\nCommunity Organizers\n\nFinal Presentation to\nLawrence CommunityWorks\n5.11.04\nDepartment of Urban Studies &\nPlanning\nConclusion\nHow do we get to this vision?\nWhat's next:\n- CommunityWorks Staff\n- IDA Participants\n- Youth Members\nhousing needs of\nLawrence residents\nhousing units in\nLawrence\npeople\nplace"
    },
    {
      "category": "Resource",
      "title": "a2_newfin_rep.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/145ed70ab78eb2a0ed0725352f341f4b_a2_newfin_rep.pdf",
      "content": "PEOPLE\nTo obtain information about the housing needs and\npreferences of IDA clients, we conducted two workshops on\nApril 9 and 16. Although the workshops were a vehicle for\ncollecting information, they were also a venue for facilitating\ndialogue among IDA clients and between IDA clients and\nCommunityWorks staff. In what follows we first summarize the\nprimary objectives of the workshops. Next, we briefly describe\nthe workshop design and planning process. Third, we indicate\nthe number of people who attended the workshops as well as the\nmembers of the facilitators and support team. Fourth, a summary\nof the main activities and findings of the workshops is provided.\nFinally, we outline some of the comments that participants made\nregarding their experiences during the workshops.\nWorkshop Objectives\n- Promote dialogue among participants (and between\nparticipants and CommunityWorks staff) about key issues\nrelated to the program and their individual goals;\n- Strengthen social ties among group participants;\n- Generate interest and commitment to living in and improving\nthe city of Lawrence;\n- Promote dialogue and learning among participants about\nhomeownership, including the benefits and drawbacks of\ndifferent housing types and forms of ownership; and\n- Collect information from participants to assess their demand\nfor housing in Lawrence and the barriers to homeownership\nthat they are experiencing.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nDesigning the Workshops\nThe design and planning process took approximately five\nweeks. We met more than fifteen times for a total of approximately\n35 hours during the semester to plan the various activities of the\nworkshop. We also met with CommunityWorks staff three times\nto obtain feedback and suggestions on the types of activities to\ninclude in the workshops.\nAlthough many of our ideas were adapted from previous\npersonal experiences with participatory workshops in the United\nStates and abroad, most of our ideas were developed through\nbrainstorming as a group. The focus of our efforts throughout\nthe entire design phase was not to develop methods for collecting\ninformation but rather to create processes that would promote\ndialogue and learning among IDA participants as well as between\nIDA participants and CommunityWorks staff. This dialogue\nand learning are necessary to realize CommunityWorksʼ vision\nof bringing people and place together. For this reason, we\nbelieve that these workshops are not just one-time events for\nuse during a semester to collect information. They are tools\nthat CommunityWorks staff can use on an annual basis to ensure\nthat people are discussing and reflecting on issues central to the\nconvergence of people and place.\nIn addition to developing formal activities for the\nworkshops, we designed informal social activities for creating\na relaxed and friendly environment that would foster bonding\nnot only between workshop participants, but also between the\nparticipants and the facilitators. Examples of these informal\nactivities are an ice-breaker game that enabled people to quickly\nbecome acquainted with each otherʼs names, a raffle with multiple\nprizes, salsa dancing and music, and a live guitar concert at the\nend of the second workshop.\nParticipants and Facilitator/Support Team\nEach workshop was held after business hours on a Friday\nfor approximately two and a half hours. Sixteen IDA clients\nattended the first workshop. Two were from Group 1, five from\nGroup 2 and nine from Group 3. In addition, one of the members of\nthe Young Architects group, Rebecca Camargo, who participated\nin the GIS data collection process, also attended the workshop in\norder to learn more about the project and participatory techniques.\nThe second workshop consisted of twelve participants, two of\nwhom were in Group 1, seven in Group 2 and three in Group 3.\nThe workshop facilitators and support team consisted of\nnine MIT students and three CommunityWorks staff members\nduring the first workshop, and six MIT students, one MIT\nprofessor and two CommunityWorks staff during the second\nworkshop. Appendices 1 and 2 provide the names of the\nworkshop participants and members of the facilitators and support\nteam, respectively.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nWorkshop Activities and Findings\nThe activities and findings of the workshops can be grouped into\nthree main categories: (1) About the IDA program, (2) About\nLawrence, and (3) About Homeownership.\nAbout the IDA program\nThis section of the workshop was designed to enable IDA\nclients to share how they heard about the program, why they\njoined and what benefits and challenges they have experienced so\nfar as a result of being part of the program. We also asked them\nto think about how the benefits and challenges of the program\nwould change if the program were expanded to include 35 people\nper class instead of the current 12, and if men were invited to take\npart in the program.\na. How did you hear about the program?\nPeople heard about the program through a variety of means.\nSome women expressed learning about the program through\nAnnery Brea, the IDA program manager, because they were either\nfriends with her or they had had an informal encounter with her\nin and around Lawrence. Two women learned about the program\nbecause they had their children enrolled in after-school activities\nat CommunityWorks. Others said they learned about it through\nword of mouth in their neighborhoods or through flyers. The story\nthat best exemplifies the word of mouth phenomenon observed in\nLawrence relates to a daughter who, upon hearing two strangers\ntalk about CommunityWorks and the IDA program in the street,\nrushed home to tell her mother about it. These differing methods\nof learning about the IDA program are indicative of how deeply\nembedded CommunityWorks is in the community of Lawrence.\nb. Why did you join the program?\nAlthough one woman said that she joined the program to\nestablish a business, all other women mentioned that they were\nthere because they wanted to save money for purposes of buying\na house. One of these women expressed that she wants to buy a\nhome because she wants to accumulate equity that she can use in\nthe future to pay for her childrenʼs 1education.\nc. What benefits and challenges have you experienced since you\njoined the program?\nParticipants were asked to write on index cards the answer to\ntwo questions:\n1. What are the main benefits of being in the IDA program?\n2. What are the biggest challenges of being in the program?\nThe index cards were grouped by facilitators and discussed later\nin the workshop (see part f below).\nd. If the program were expanded to include 35 people per class\ninstead of the current 12, how do you think the benefits and\nchallenges of the program would change?\nInitially, women were concerned about the potential negative\nimpact of a program expansion on the close friendships and\nsupport mechanisms that characterize the program at its current\nscale. However, after some discussion, the women concluded\nthat a program expansion would be desirable because it would\nenable more women to benefit from the program. Hence, a brief\ndiscussion followed that focused on how expansion could occur\nwithout jeopardizing the benefits of a small program.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nParticipants agreed that the highest number of people per\nclass should be 35. It was also mentioned that IDA program\ncoordinators could promote interaction and solidarity among\nIDA clients by compiling class lists with addresses and telephone\nnumbers, which people could then use for coordinating carpooling\nor other types of activities.\nAlso, women thought about new benefits that a program\nexpansion could generate. First, IDA program-related classes\ncould be offered in multiple locations throughout the city\nrather than in just one location. This would reduce travel time\nfor participants and make the program more visible in the\nneighborhoods. Second, the more women that graduate from the\nprogram, the bigger impact they can make in Lawrence if they\nwork collectively.\ne. If the program were expanded to include men, how do you think\nthe benefits and challenges of the program would change?\nInitially, the idea of including men in the program triggered\nsignificant negative reactions from the women. The women\ndid not want men to be part of the program because they felt\nthat the presence of men would prevent them from expressing\nthemselves. The women also said that one of the best things of\nthe IDA program is that it provides them with the opportunity to\nset aside time for themselves away from their hectic lives, and\nthat bringing men into the program would take that time away\nfrom them. They also felt that the difference between menʼs and\nwomenʼs outlooks on life would act as a communication barrier\nbetween the two groups.\nUpon reflection, however, a married woman said that she\nthought that it would be good for her husband to learn how to\nsave and buy a home, but that he should learn separately from her.\nAnother woman mentioned that she thought that the differences\nin perspective between men and women could improve her\nexperience in the program. Hence, the women agreed that if\nmen were included in the program, they could be part of certain\nskills-building classes with women, but that peer support group\nmeetings for women should be held separately from men.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nf. Discussion of index cards created in part c: benefits and\nchallenges.\nThe facilitators then collected and grouped the cards into\ncategories, which were listed on flip charts for purposes of\nguiding a detailed discussion about the benefits and challenges of\nthe program.\nThrough these discussions, we learned that participants\nwere extremely positive in general about the program, and\ncontributed many more answers to the \"benefits\" question than\nto the \"challenges\" question. Comments ranged from learning\nabout savings and financial management to enjoying the social\nand support aspects of the program. Participants wrote about\nlearning the importance of \"paying bills on time,\" looking for\nbank \"hidden fees,\" and \"planning for the future.\"\nThe programʼs value as a support network and place to create\nmeaningful friendships was mentioned by many of the women.\nA number of participants simply wrote \"friendship\" or \"support\"\non their index cards. Another spoke of how the program let her\nreduce stress and realize there is \"a way to get ahead.\"\nMany women also commented that the IDA program gave\nthem the opportunity to buy their first home. One participant\nwrote, \"Itʼs the only way Iʼm going to be able to save for a\nhouse.\"\nThe comments about challenges people faced while in the\nIDA program covered topics both about the program itself\nand difficulties faced outside CommunityWorks. Participants\nacknowledged that it was often difficult to attend the meetings -\nbecause of and family commitments. One participant complained\nof not being able to attend because she was sick, and another\nsaid that her baby is sometimes sick. Participants expressed\nfrustrations related to the large number of meetings required for\nthe program, or the fact that the meetings are sometimes scheduled\nduring inopportune times. People also expressed concern about\nthe meetings consistently starting late. Others said they wanted\nmore education/skills building workshops to be incorporated into\nthe program. Finally, disagreement among workshop participants\nabout the duration of the program was identified. While a few\nGroup 3 participants considered a two-year duration to be too\nlong, Group 1 participants, possibly reflecting nostalgia for the\nprogram, said two years was too short.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nAbout Lawrence\nNext, discussion and community mapping techniques\nwere used to initiate a dialogue among the women about their\nperceptions of the city and their preferred locations for buying\na home. The following sections provide a summary of these\ndiscussions and mapping exercises\nYears of Residence in Lawrence\n\"How long have you lived in Lawrence?\" facilitators asked.\nTable 3 (below) shows that the majority of women in the workshop\nhave lived in Lawrence more than 10 but less than 20 years.\nTable 3: Years of Residence in Lawrence\nNumber of Years\nNumber of People\n1 to 4 Years\n5 to 10 Years\n11 to 19 Years\n20 or More Years\nCommunity Mapping\nFacilitators then conducted a series of community mapping\nexercises to encourage people to consider their social networks\nand the spatial aspects of their daily activities when deciding\nwhere to live in Lawrence.\nFacilitators divided workshop participants into three small\ngroups of three to four people. Each group gathered around a\nmapping workstation with two or more facilitators. Mapping\nworkstations consisted of one large 30\"X30\" map of the city of\nLawrence, a legend indicating the symbols for the information\nrequested from participants, and stickers and markers of various\ncolors for participants to use based on the legend.\nThe information that participants were asked to map were:\n- Where do you live in Lawrence?\n- Where do your friends and family live?\n- What areas do you perceive to be unsafe?\n- Where are the best schools in Lawrence?\n- Where do your children play?\n- Where do your children go to for after-school activities?\n- Where do you go to church?\nAll groups then reconvened as a large group for a more in depth\ndiscussion about the information that had been mapped as well as\npeopleʼs perceptions about Lawrence.\nIDA Client Perceptions of Lawrence\n\"What do you like the most about Lawrence, or why do you\nwant to stay?\" the facilitator asked? Women provided many\nreasons for why they like Lawrence. Some said that they consider\nLawrence to be a safe place, especially compared to their home\ncountries. They described Lawrence as a town with warmth (\"un\npueblito que tiene calor\"), a familiar atmosphere where one can\nshare more with others, and a good place to raise children and get\nold in. \"People know me in Lawrence,\" one woman said.\nThen the facilitator asked what people liked least about\nLawrence, or why they would want to leave. The problems that\npeople reported were poor quality schools, the absence of nice\nparks for children, and the lack of affordable summer activity\nprograms for children under age 12. Although some women\nreported vandalism and stolen cars to be a problem, all agreed\nthat those problems had been substantially reduced since the new\nsheriff came to Lawrence approximately four years earlier. One\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nwoman, who has lived in Lawrence for 18 years, spoke of old\nLawrence with nostalgia: \"A new wave of immigrants came who\nwere primarily on welfare and they increased crime tremendously\nas a result.\" Approximately half of the women expressed that they\nwanted to leave Lawrence.\nAmenities\n\"Why do you live where you live now?\" the facilitator then asked.\nThe main amenities that women mentioned were proximity to school,\nchurch, park, post office, bus stop and hospital.\nLocation of Where People Want to Buy a Home\nFollowing this conversation, facilitators distributed an 11X17 map of\nLawrence to each participant and asked the participants to indicate\non the map the area(s) of the city in which they would want to buy\na home. Maps 1 through 5 below show these areas along with some\nof the spatial information that was collected during the mapping\nexercises described above .\nMap 1: Location of IDA Clients' Current Homes\nAs can be seen in the map above, four of the IDA clients currently\nlive in areas where IDA clients have indicated they would want to\nbuy a home. Also, although IDA clients live in areas throughout\nthe city, they seem to be mostly concentrated north of the\nMerrimack River which roughly divides the city in half.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nMap 2: Location of Friends and Family\nThe above map shows that despite the fact that most of the families and\nfriends of IDA clients are distributed throughout north Lawrence, there\nare some people who would like to buy a house in south Lawrence.\nMap 3: Areas Perceived to be Unsafe\nThe above map shows that most people avoid areas that they\nperceive to be unsafe when deciding where they want to buy their\nhome.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nMap 4: Location of Best Schools, Where Children Play and\nAfter School Activities\nThe above map shows that there is no clear relationship between\nthe location of where people want to buy a home and the location\nof the best schools, where children play and after-school\nactivities. Nevertheless, proximity to schools and parks was\none of the desired amenities that IDA participants mentioned\nwhen discussing why they live where they currently live.\nMap 5: Location of Where People go to Church\nThe above map shows that there is no clear relationship between\nthe location of where people want to buy a home and the location\nof the churches that IDA clients visit. Nevertheless, proximity to\nchurches was one of the desired amenities that people mentioned\nwhen discussing why they live where they currently live.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nAbout Homeownership\nThe final section of the workshop focused on homeownership,\nspecifically assessing womenʼs preferences with regards to\nhousing types and ownership forms.\nHousing Type Preferences\nWe prepared four large 30\"X30\" posters, one for each type\nof housing discussed in the workshop: single-family house, 2-4\nfamily house, multi-family building and mill building. Each\nposter contained photos of the exterior and/or interior of the\nhousing structures it represented.\nAfter briefly describing the four types of housing structures,\nfacilitators distributed three stickers to each participant.\nParticipants were then asked to indicate their preferences by\nplacing their stickers on the correct housing type posters. For\nexample, if a woman had one preference, she could place all\nthree stickers under the poster that represented her top choice. If\na woman had two top choices, she could distribute her stickers\namong these two choices by pasting two stickers on her top\nchoice and one on her second choice.\nFollowing this exercise, the cost associated with each housing\nstructure was introduced: $1,700 to $2,200 per month for single\nfamily homes, and $1,300 to $1,600 for a condo in the three other\nhousing types. Facilitators described these costs and showed how\nthey differed based on housing type. They then distributed three\nmore stickers to the women and asked them to vote one more time\nbased on the new cost information.\nThe introduction of costs resulted in the expected shift in\npreferences. As shown in Table 4 below, the groupʼs a priori\npreferred housing types in order of highest number of votes to\nlowest were single-family house, 2-4 family house, mill building\nand then the multi-family building. After costs were revealed,\nthis order changed to include 2-4 family house first, followed by\nthe single-family house and then by the mill and multi-family\nbuildings.\nTable 4: Housing Preferences Before and After Costs Were Revealed\nHousing Type\nTotal Number of Votes\nBefore Costs\nAfter Costs\nSingle-family\n2-4 Family\nMulti-family\nMill\nWhen the facilitators asked why people preferred single-family\nhomes over other housing types, women responded by saying that\nthey considered them to be more stable investments. They also\npreferred the higher degree of privacy, greater amount of indoor\nspace and the yard that single-family homes usually offer. Lastly,\nthey found single-family homes to be safer than apartments in\nlarge buildings.\nThose who voted for the 2-4 family house said that they did\nso because it was the closest option to the single-family house\nin terms of privacy, safety and space. Those who voted for the\nmill building said that the mill buildings looked beautiful and\nspacious, but that they had to see the interior in real life to confirm\ntheir votes. A lot of women said that they did not vote for the\nmulti-family building because they did not look nice and they\nseemed too crowded.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nWhen facilitators asked why people did not want to live in the\nother types of housing structures, several interesting facts about\nthe shortcomings of this workshop activity were revealed. First,\nsome people did not vote for non-single family housing options\nbecause they thought that they had to buy the whole building rather\nthan just an apartment within the building, and they were afraid\nabout how they would maintain such a building. Others thought\nthat their investment was less stable than in a single-family home.\n\"It is not something that is mine,\" various women said.\nWe also learned that most women did not know that while\nowners of single family homes need to be sufficiently self-\ndisciplined to save for future maintenance costs on their own, the\nowners of condo in multi-family or mill buildings benefit from the\npresence of a management company that charges them monthly\nfees and then sets money aside for future building maintenance\ncosts. Others had not thought about the risks that an owner of a\ncondo in a 2-4 family faces if large maintenance expenses arise\nand no one else in the building is willing to pitch in to cover the\ncosts.\nThe above mentioned comments show that the women had\nnever seriously looked into buying anything other than a single-\nfamily house, and that substantial additional technical information\nneeded to be provided to them if they were to make informed\ndecisions about their housing type preferences. Nevertheless,\nthe exercise was useful in informing workshop participants and\nCommunityWorks staff of the importance of organizing future\ncourses on the advantages and disadvantages of different housing\ntypes.\nForms of Homeownership\nDue to the rising home prices in Lawrence, it is becoming\nincreasingly difficult for IDA graduates to qualify for home\nmortgages. Hence, we wanted to introduce IDA clients to the\nbenefits and drawbacks of collective buying and see what their\nthoughts on the subject were.\nTo introduce the concept of collective buying, the facilitator\nasked five women to stand in the front of the room. The facilitator\nthen asked one of the women to represent individual ownership by\nstanding on her own. Next, she instructed the next two women\nto represent the concept of informal collective purchasing by\nstanding together and holding hands. Lastly, the facilitator\nassigned the remaining two women to represent the concept of\nformal collective purchasing. She did this by placing a chair\nbetween the two women and asking each of them to hold one side\nof the chair. The chair was described as the shared parts of the\nbuilding - the lobby, laundry room, etc.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nThe facilitator then explained the benefits and drawbacks of\neach scenario. The main points that were made for the individual\npurchasing scenario were that although the ownership form\nprovides financial autonomy, independence and control, it is also\nhigh risk because the owner is solely responsible for maintenance\nand insurance costs, as well as mortgage payments. If the owner\ncannot make the full payments, no one else is there with whom to\nsplit the costs.\nThe facilitator described the informal collective ownership\nscenario as an option that offers cost savings for maintenance\ncosts, insurance, yard work, etc. since they are shared among\nthe various homeowners. However, drawbacks exist due to the\ndifficulties associated with having to understand the complex legal\nstructures associated with collective ownership. In addition, having\nan investment partner limits a personʼs autonomy and increases\nfinancial and social risk.\nFinally, the formal collective ownership scenario was described\nas a case where two or more people get together to buy a building\nand then convert it into individual condos. The benefits of this\nendeavor are similar to the informal purchasing scenario in that\nthere are substantial cost savings due to sharing of maintenance\ncosts, insurance, etc. Furthermore, owners of condos experience\nfinancial autonomy, control and independence much like the owners\nwho purchase individually. Some of the main drawbacks, however,\nare the high costs required to convert the units into condos as well\nas the need for the homeowners to understand the complex legal\nstructures of collective ownership. The women were very intrigued\nby these three types of ownership forms and expressed a desire to\nlearn more about them. Andre Leroux from CommunityWorks\nsuggested that additional workshops could be held to cover the\nbasics with regards to housing types and ownership options, and the\nIDA participants unanimously supported his suggestion.\nDebriefing\nAt the end of the second workshop, the facilitator asked the\nparticipants to share their thoughts on their experiences during\nthe workshops.\nPeople said that the workshops were fun and informative at\nthe same time. \"I liked them because they helped me see the\ntruth,\" one woman said. A number of women agreed that it was\nvery helpful to see both the risks and benefits of collective buying\nas well as the differences among housing types. Another woman\nsaid that the workshop had opened her eyes to the possibility of\nbuying a home other than a single-family home. \"I had not even\nconsidered the other options,\" she said. The women also said that\nthey enjoyed reflecting on Lawrence, and learning about what\ntheir other classmates think about the city of Lawrence.\nFinally, the women said that the workshops were well-\nfacilitated. They were especially happy that the workshops were\nheld in Spanish, allowing those without strong English skills the\nability to fully participate."
    },
    {
      "category": "Resource",
      "title": "b_newfinrep_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/4b31d80855fb5584f230bdb5b87c9db7_b_newfinrep_3.pdf",
      "content": "PLACE\nSophisticated information technologies are emerging as a\ntool for community building efforts of planners and Community\nDevelopment Corporations (CDCs). Websites, Geographic\nInformation System (GIS), and other visualization methods are\nnow available to assist in place-based revitalization efforts. These\ntools facilitate better visioning, concept illustration, community\nplanning & data collection efforts. GIS is perhaps the most\nimportant technological tool available to LCW in its efforts to\nunderstand and expand the IDA program, because it allows for a\nplace-based analysis of community-building efforts not available\nthrough other tools.\nOne of the key questions we needed to answer for this project\nwas how to create a GIS project that would be both useful and\nusable by CommunityWorks. Literature on successful use of GIS\ntechnology shows that useful systems focus on simplicity and small\ntrials (Innes, 1993). Systems which effectively communicate their\nbenefit to all stakeholders will encourage future use. Small trials\nallow users and creators the ability to change systems as needs\nevolve and also build effectiveness over time. A key concern for\nthe sustainability of a project is the capacity of the organization\nto maintain and improve the GIS system (Kellogg, 1999). An\nimportant consideration for CommunityWorks is creating a\ncore group of users who are comfortable with GIS software and\ncan instruct others. Finally, any system must be accessible to\ncommunity members both as a tool and as an expressive device, a\nhelpful way to communicate needs and desires (Talen, 2000).\nThe process we designed to create the GIS project is based\non strong participation from the various youth programs at\nCommunityWorks. We worked closely with the Young Architects\nand Young Professionals programs to collect data for entry into the\nproject and also conducted training on the GIS software. The youth\nprogram participants will continue to be users, administrators and\nadvocates for GIS use across the CommunityWorks organization.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nData Collection\nOur team facilitated collection of two important types of\ninformation related to the IDA program:\n1.\nInformation collected on housing supply in Lawrenceʼs\nNorth Common Neighborhood\n2.\nInformation provided by existing IDA Program\nParticipants\nThe first category of information is intended to assist\nCommunityWorks in encouraging IDA participants to purchase\nhomes in the North Common neighborhood, an area of particular\nconcern to CommunityWorks. The second category is intended\nto help CommunityWorks better understand the needs and\ndesires of existing IDA participants. The ability to visualize and\nanalyze these two types of information (on people and place)\nwill help CommunityWorks to join the housing needs of the IDA\nparticipants with the available supply within the community.\nFuture data collection will allow CommunityWorks to expand its\nunderstanding of the community, and to increase the efficiency of\nits place-based revitalization efforts.\nPocketPCs and Geographical Information System\nTalented youth from CommunityWorks joined graduate\nstudents from MIT to walk the North Common neighborhood\nand collect physical information on the 485 properties therein.\nA series of workshops was conducted with IDA participants to\ncollect information on their needs and desires with regard to\nhome-buying. For further information on specific maps and data\ntables refer to Appendix B.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nComprehensive Binder\nDistributed separately from this report is a comprehensive\nbinder entitled \"Lawrence Community Works: North Common\nArcGIS Project & Data Collection Manual.\" The binder contains\nall information collected during this project related to the supply\nof housing in the North Common Neighborhood, as well as\ninformation collected at the IDA Participatory Workshops, and\ngeneral information about the City of Lawrence. (Additional\ninformation is included on the use and programming of Pocket\nPCs for data collection, use of ArcPad, ArcGIS, ArcExplorer,\nand ArcPad Application Builder.) This wealth of geographic and\ndatabase information will assist Lawrence Community Works\ninto the future with the installation of its first comprehensive\nGeographic Information System (GIS) later this month. MIT\nsecured two licenses for ESRIʼs state-of-the-art ArcView GIS\nsoftware, and will assist with installation and setup of the\nnecessary data and map layers. The five-year collaboration\nbetween MIT and LCW will benefit greatly from this platform of\ninformation, as well as the establishment of a process by which\nnew information can be gathered and added to the system.\nProperty Disribution in North Common\n\nSYNTHESIS: BRINGING TOGETHER\nPEOPLE & PLACE\nHaving conducted a wide array of information gathering\nand community building activities, we next considered how to\nbring people and place together in Lawrence. This synthesis of\nthe information we gathered was aided greatly by a focus group\ndiscussion conducted at CommunityWorks and organized by\nArmand Hyatt, staff lawyer and Board member. The focus group\nconsisted of two real estate attorneys, two local realtors and two real\nestate lending officers from local banks. The discussion focused\non IDA participants, their purchasing power, local housing stock,\nand opportunities for moving IDA members into homeownership.\nThis discussion was useful both as an information gathering tool\nand as a way for these real estate professionals to meet and discuss\nongoing difficulties and new possibilities.\nAlong with conducting various activities to better understand\nboth people and place in Lawrence, we spent time trying to\nunderstand the barriers that kept these two apart. The primary\nbarrier is easy to identify: the high cost of housing in Lawrence.\nEven small condominiums in poor condition cost at least\n$100,000 to purchase. The average IDA participant can afford the\nmonthly payments on a home that costs about $65,000. A more\nadequate home that fills the needs of most program participants\nwill cost around $175,000-$200,000. Homes in the surrounding\nareas are even more expensive. This gap between the purchasing\npower of the program participants and the market price of the\navailable housing stock is the primary impediment to increased\nhomeownership by IDA participants. There are other barriers that\nkeep people out of the home buying market, including an aging\nhousing stock and individual preferences.\nIn order to understand the dynamics of the real estate market,\nwe analyzed recent sales data as well as Multiple Listing Service\n(MLS) listings, a service showing homes currently for sale.\nThis data helped us to identify market levels for Lawrence, and\ncan also be applied at the neighborhood level to understand the\nsubmarkets. This process of reviewing sales and the available\nfor sale market is an ongoing activity that should be repeated by\nthe CommunityWorks real estate department as part of its basic\noperations.\nWe also analyzed the purchasing power of the IDA participants,\nbased on income levels and approximate down payments. The\nmaximum income of IDA participants is set at 200% of the federal\npoverty level. In 2004 this means that in order to participate in the\nprogram an IDA member needs to earn less than $30,000 per year.\nThe average participant probably earns between $20,000-$25,000\nper year. Based on tax and insurance levels, this means that the\naverage participant can afford a home worth between $60,000-\n$80,000 (see Appendix A for detailed calculations). This analysis\ncan be repeated and improved upon with information about \"soft-\nsecond\" mortgages and other mortgage subsidy programs, which\nmay be utilized to increase purchasing power.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nOur discussion with local real estate brokers, lawyers and\nbankers also revealed some of the difficulties in moving low and\nmoderate income residents into homeownership. The available\naffordable options have many problems associated with them.\nOwning a multi-family home and renting out apartments is a\ngood way to lower housing costs, but it involves being a landlord\nand dealing with tenants. This is a very difficult thing for new\nhomeowners to do, with little financial backing to handle a few\nlate rent payments or vacant units. In addition, the maintenance\ncosts of 2-4 family homes are quite high and these homes can\nbe difficult to maintain if funds are not properly budgeted by the\nowner.\nPurchasing a home with another participant (informal\ncollective purchasing) is also a way to reduce home costs, but it is\na very risky proposition for most families. This process involves\njointly purchasing a home, making each individual responsible\nfor making monthly payments. It is a useful option for some,\nespecially single mothers who can use assistance with child care\nand chores. But leaving such an arrangement is difficult as it\nnormally involves selling the home, which each owner may want\nto do at a different time. This arrangement requires a great deal\nof trust and communication between owners and is therefore only\nrecommended for close friends and family members who have a\nclear exit strategy and understanding of the balancing act required\nto make it work.\nFinally, owning a portion of a larger building may be the\nbest option for many low and moderate income residents. The\npurchase price of a condominium is generally lower than for\na single-family home because the size of condos is lower and\ncertain features (entrances, utilities, etc.) must be shared with\nother owners. One possibility for IDA participants is to purchase\na three family home and then \"condominiumize\" it, splitting it into\nthree separate units which would then be owned by the individual\nfamilies. The primary problem with doing this is that it requires\nsignificant upfront costs for engineers and attorneys who are\nneeded to draw up legal documents and structural arrangements\nfor the condominium association. These costs may push the cost\nof this option out of the range of IDA participants.\nThere are also difficulties in matching the housing desires\nof IDA participants and the housing options in Lawrence. Our\nworkshops with IDA participants revealed that many of them did\nnot necessarily want to purchase a home in Lawrence, and almost\nall wanted to own a single family home. Much of the housing\nstock in Lawrence is of the multi-family variety, especially in the\ncore neighborhoods that CommunityWorks will focus on into the\nforeseeable future."
    },
    {
      "category": "Resource",
      "title": "c_newfinrep_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-423-information-and-communication-technologies-in-community-development-spring-2004/a949ddc5e17195a652e36f05d5628fb1_c_newfinrep_3.pdf",
      "content": "The focus groups, workshops and basic financial analysis we conducted revealed a set of barriers that CommunityWorks will\nneed to overcome if the IDA program can be successful in helping program participants purchase their homes. We have grouped\nthese into three major themes of homeownership, program administration and institutional partnerships.\nHomeownership\n- Housing preferences Amongst Participants\nMany program participants expressed a desire to leave\nLawrence for various reasons, including crime, schools and\npoor housing. If participants do not want to live in Lawrence,\nthe program goal of people helping transform the place cannot\nsucceed.\nProgram participants also expressed a desire to live in the\nparts of Lawrence which are already in good condition, namely\nProspect Hill and South Lawrence. These neighborhoods do not\nneed as much improvement as the CommunityWorks expanded\nservice area, which is one of the places that the IDA program can\nhelp transform. IDA members need to want to participate in the\nimprovement of a neighborhood, not just move to already high\nquality areas.\nThe disconnect between the desire of program participants\nto live in a single family home and the available housing stock\nin Lawrence must be addressed by CommunityWorks. If IDA\nmembers do not want to purchase the types of homes that are\navailable in Lawrence, they cannot help to transform the city.\n- Timing\nThe five-year time limit on AFIA funds presents a barrier for\nmoving participants into homes. This is especially true for those\nin Groups 2 & 3 since they face the same deadline as those in\nGroup 1.\nBARRIERS\nProgram Administration\n- Maintaining Intimacy\nThere is a basic contradiction between the most important\nstrength of the IDA program, its intimacy and support structure,\nand the future goal of dramatically increasing the program size.\nAs the IDA program expands it needs to maintain that intimacy\nand peer support if it is to be successful.\n- Integrating entire families into the IDA process\nAs the program expands it will need to include a broader\nrange of people, integrating men and other family members into\nthe IDA process. Integrating these new people into the program\nwill require a delicate balancing process in order to expand the\nprogram and maintain its high quality.\n- Focusing on one area of Lawrence could lead to gentrification\nAs CommunityWorks picks concentration areas to help program\nmembers move into, they hope these neighborhoods will improve.\nThe classic problem with improving neighborhoods is gentrification,\nthe process of middle class outsiders moving in, improving homes\nand increasing housing prices. If the concentration areas improve,\nit will attract middle class residents who have been priced out\nof other parts of the Boston area. A way of dealing with this\npossibility should be part of the CommunityWorks strategy.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nInstitutional Partnerships\n- Reviviendo Gateway Initiative (RGI)\nThe progress made by RGI, and the role that CommunityWorks\nhas played in that effort, is commendable. The 11,642 new\nresidents that RGI predicts will be drawn to Lawrence will have\na significant impact on the housing market, and therefore the\nsuccess of the IDA program. RGIʼs work should take into account\nCommunityWorksʼ efforts and vice versa.\n- City of Lawrence\nEfforts to align people with place, make change on a large\nscale, and support youth development, are all hampered by\nthe politics of City government. It has been demonstrated that\nsuccessful IDAs have strong partnerships with City and local\nadministration. To date, the Cityʼs lack of support has been a\nfrustration. In moving the IDA program to scale, having the\nsupport of the City of Lawrence will be critical.\n- State of Massachusetts\nWhile\nthe\nMassachusetts\nIDA\nSolutions\n(MIDAS)\ncollaborative is making significant progress towards raising the\nprofile of asset-building programs at a state level, Massachusetts\nstill has no legislation on IDAs. This barrier leaves only federal,\nfoundation, and private funding options for the IDA program.\nOther states have passed legislation, for example, making accrued\ninterest tax-exempt, allowing TANF money to be used towards\nIDAs, and allocating tax credits for organizations to provide\nmatching funds. This lack of state support in Massachusetts\nrepresents a tangible barrier to going to scale.\n- Other organizations\nAs the IDA and other FAB programs expand, coordination\nwith other organizations - churches, schools, social service\nagencies, etc. - will be more and more critical. In terms of\nmarketing, funding, facilities, etc., CommunityWorks will need to\ncollaborate with other organizations in Lawrence and the region.\n\nGiven the mission of envisioning a large-scale IDA program,\nwe designed a process with direct recommendations for certain\ndepartments that is also flexible enough to be adapted and\napplicable to a long-term vision. The process does not outline a\nspecific number of participants at each stage because the goal is for\nCommunityWorks to evaluate progress and define scale for itself.\nThe following recommendations are based on what we imagine to\nbe the challenges at several stages of scaling up the IDA program\nat Lawrence CommunityWorks. It is also a combination of what\nwe observed at CommunityWorks and what we have investigated\nnationally.\nThe process is outlined with several time periods that indicate\nthe immediacy of the next steps necessary for each department.\nNote that although these suggestions are listed chronologically\nand by department, all parts are equally important in informing\ncurrent decisions. Each department should understand the long-\nterm vision and how other departments are integral to that vision.\nIdeally, there is an individual (or a committee) who could guide\nand assess the process as a whole. This entity should also be\nresponsible for implementing a regular and thorough evaluation\nprocess of each department and the organization. Seeking\nparticipant feedback is a valuable part of this process.\n\nT\nhere are three principles that should continue to\nbe strong themes in all the work that goes on at\nLawrence CommunityWorks:\n1) Focus and emphasis on the importance of staying in\nLawrence\n2) Peer support and social networks are at the core of all\nefforts\n3) Encouraging youth development as integral to the\nsustainability and vitality of Lawrence.\nRECOMMENDATIONS\nTODAY\nNEAR FUTURE\nFUTURE\nRecommended Phases\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nL\nESSONS LEARNED\n\nWorkshop:\nThe housing type discussion during the\nsecond was enlightening but incomplete. A more complete\ndescription of different housing types along with costs and\nbenefits should be part of future discussions.\nThis phase addresses the challenges we identified within the current program that hinder the\nsuccess of going to scale. Our greatest concern at this stage is impressing upon residents that\nthere are opportunities to own a home in Lawrence. Making this work with current participants is\nimperative to any steps to follow. TODAY focus on the Individual Development Account Program\nas it exists with the goal of promoting a commitment to homeownership in Lawrence.\nTODAY\nIndividual Development Account Program\nAccount Administration:\n-\nEstablish the Family Investment Center\n- Ensure that all account statements are updated monthly and\ndistributed to participants.\n- Establish a direct deposit system. This helps with insuring\nthat people are indeed using their work income. Without a\ndirect deposit system, the updating the accounts in MISIDA\noften falls behind. The problem with this is that AFIA requires\nthat an accurate record of accounts be maintained to withdraw\nmatch monies. If accounts are not in order, federal match\nmoney will not be available when IDA participants are ready to\npurchase their assets. Without up-to-date statements, the federal\ngovernment may take several months to deliver a check. When\na participant is ready to purchase a home, she may not be able\nto acquire it because of her inability to move quickly enough.\nAdditionally, there is a small window of opportunity for many\naccounts to be placed in order. The deadline for purchasing an\nasset with AFIA money for the group of IDA participants that\nhas already graduated is less than two years. These graduates\nwill soon be scrambling to acquire their assets, and their account\ninformation should be updated well beforehand.\n- Considering the approaching five-year time limit, emphasis\nshould be placed on assisting Group One participants to\npurchase their asset.\nWorkshop/Curriculum/Marketing Administration:\n-\nOutreach to first time homebuyers and savings club members\n-\nThe summer barbeque that beings together all the participants\ncan also be a celebration and acknowledgement of the graduates of\nthe program. Holding biannual celebrations for alumni would be\nencouraging for participants.\n-\nEncourage IDA participants to attend RGI meetings, especially\nsessions like the charettes that were held in April and May 2004.\n-\nContinue participatory workshops. Many aspects of the\nparticipatory workshops that we conducted will be very useful to\nthe IDA program. Housing type preference discussions and some\nmapping exercises uncovered interesting trends and were very\neducational for program participants. These discussions should\ncontinue in some form, either as separate workshops or as part of\nthe IDA program already in place.\n-\nConduct exit surveys of each participant. An example from\nCentral Vermont Community Action Council is listed on the CFED\nIDANetwork website.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFamily Investment Center (FIC)\nWe imagine that the FIC will be able to address asset\nbuilding holistically as an umbrella group that oversees all\nsavings, homebuyer education, fi nancial literacy, and adult and\nyouth IDA programs.\nInstead of a collection of stand-alone programs, FIC will be\na place where CommunityWorks members can be connected to\nthe continuum of programs and services available. The Center\nwill also coordinate partnerships with collaborators such as banks,\nrealtors, and universities.\nFor example...\nPossible Participant Pathway\n1)\nIt is April 2005, and a Lawrence resident, \"Solana,\" needs help on\nher taxes. A friend mentions that CommunityWorks provides tax\npreparation services.\n2)\nShe visits the Family Investment Center where she receives help\nfrom Carla to complete her tax forms.\n3)\nCarla refers her to Enrique, a representative from Lawrence Savings\nBank, who helps her open a new savings account that day.\n4)\nSolana is then invited to join CommunityWorks as a member and\nlearns about the other programs and services available.\n5)\nNext month, Solana joins the Savings Club, meeting other single\nmothers in her neighborhood. Her two kids join the Young\nProfessionals program.\n6)\nIn 6 months, after making progress in repairing her credit and\nbuilding some savings, Solana reaches a benchmark so that she now\nqualifi es for the IDA program.\n7)\nAt the same time, she is identifi ed as a potential neighborhood\nleader, and starts a NeighborCircle.\n8)\nOne day, Solana picks up a fl yer from the real estate department\nfeaturing a new three family building with units for sale. She meets\nwith Patricia in the real estate department to discuss the options of\npurchasing the home.\n9)\nIn 2 years, after graduating and purchasing her fi rst home, Solana is\ntrained and certifi ed, through a partnership with Cambridge College,\nto become an Alumni IDA Instructor.\nNational Examples:\nExtra-Credit Savings program\n\"The Extra Credit Savings Program is a partnership between\ntwo organizations that have an interest in building the fi nancial\nstrength of families and communities. ShoreBank got involved\nbecause it wanted to encourage saving, asset building and wealth\ncreation in the mostly African-American communities that\nare its Chicago base. The Center for Law & Human Services\nwelcomed the bankʼs interest because each year, the center must\nfi nd convenient, secure locations for its tax preparation centers.\nShoreBank offered attractive and well located spaces - free of\ncharge - for the evening and weekend tax preparation sessions,\nwhile providing the extra service of opening bank accounts for\ndirect deposit of refunds.\" -MONEY IN THE BANK: The Extra Credit\nSavings Program How Federal Tax Refunds and Credits Help Households\nBecome Bank Users\n\"Get Checking\" Program, Asset Building Coalition\n\"In this model, certain functions, such as case management or\nfi nancial education, are conducted by other complementary\norganizations. The Milwaukee site, for example, refers IDA\nparticipants who need intensive fi nancial literacy training to\nthe citywide \"Get Checking\" program. This program is part of\nthe citywide Asset Building Coalition, a partnership of thirteen\nlocal fi nancial institutions and other organizations that promote\nfi nancial education and asset building among the cityʼs unbanked\nhouseholds. Those who are not eligible for checking accounts\nare able to enroll in a four-session fi nancial literacy course taught\nby several providers. Those who complete the program and who\nhave resolved their debt problems are presented with a certifi cate\nthat allows them to open a checking account at a participating\nbank or credit union. In turn, IDAs are valuable asset-building\ntools for the citywide initiative as well.\" -Abt Associates, 2002,\nAssets for Independence Act Evaluation: Second Annual Site Visit Report\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nDesign Center & Youth Programs\n-\nAfter getting the GIS software, consider the possibility\nof starting another program. The success of this program is\ncontingent upon a demonstrated interest and long-term, focused\nproject that is integrated into other current programs and\ndepartments.\no For example: integrate GIS with the work of the Young/\nJunior Architects class.\no Use GIS project to inform the work of the Reviviendo\nGateway Initiative, gathering data and producing maps\nand data reports.\no Continue housing data collection in areas designated in\nconjunction with real estate department.\nReal Estate\n-\nContinue to meet with real estate agents, lawyers and bankers\nthat understand the Lawrence housing market. These same\nrepresentatives can help with informing both the real estate\ndepartment and the individual development account program about\nopportunities within the Lawrence market.\n-\nInvestigate the realities of condominiums and cohousing:\nadvantages and disadvantages.\nAssessment & Evaluation\nPeriodically assess progress of the departments and\norganization to attain short and long-term goals. Frequent\nevaluations to participants provides valuable feedback on how\nbest to fit their needs.\nL\nESSONS LEARNED\n\nWorkshop:\nMapping exercises are difficult and time\nconsuming. Adequate time should be set aside in order for people\nto orient themselves and feel comfortable. Special care should be\ntaken to ensure accurate data and full participation by everyone.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nNEAR FUTURE\nWe imagine that at this point the character of the program is shifting because the\nnumber of participants requires more administration and the cost of the program\nis considerable. In the NEAR FUTURE continue to generate commitment\nin North Common and designated expanded area by focusing on Lawrence\nCommunityWorks integration and tightening the expanding network.\nFamily Investment Center: Individual Development\nAccount Program\nAccount Administration:\n- Work with MIDAS to figure out a collective accounting system.\nWorkshop/Curriculum/Support Administration:\n- Begin integrating alumni into workshop facilitation: qualify\nthem as \"financial fitness\" instructors through local universities\nor agencies that certify instructors.\n- Consider services that can be contracted out and those that need\nto stay in house.\n- Consider how to address differing low-income populations.\n\"Advance market segmentation; IDA initiatives need to develop\nmore expertise in market segmentation. Not all IDA participants\nneed extensive support services. Some may need just the\nopportunity to open an IDA or asset-specific training. Not all\nparticipants need the same support and instruction and tailoring\nthe program to needs could be more cost effective.\" (Zednek 10)\nThe San Francisco Earned Assets Resource Network (SF EARN)\nis an umbrella organization for several others in the area and also\nholds its own accounts. They serve a large immigrant population\nand use an approach that considers its members in three\ndifferent phases of financial independence. Those who are the\n\"established working poor\" usually need the least amount of case\nmanagement, the recent transition immigrants, and the immigrant\nworking poor usually need the most case management.\n- Consider how to increase the number of participants and meeting\nplaces. Work with the community organizers to develop\nalternative satellite sites that are local to pockets of current IDA\nparticipants and NeighborCircles.\n- Outline a strategy for ensuring that the quality of participation\namongst IDA members remains high. Possibly implement higher\nqualifications for enrolling in the IDA program. For example, a\nPittsburgh site has adopted a \"triage system that gives everyone\nthe opportunity to work toward IDA participation, but allows it\nonly for those who are within 12 months of being mortgage-\nready. Individuals who work hard to become mortgage-ready\nare allowed the opportunity to enroll in the IDA project.\"-Abt\nAssociates\n- Establishing a continuum of services (from member to saver to\nIDA participant) can also help shorten the wait list for IDAs and\nget people saving as soon as possible.\nL\nESSONS LEARNED\n\nWorkshop:\nAll activities took much longer than\noriginally planned. Care should be taken to allocate enough\ntime for workshop activities, even if certain parts need to\nbe sacrificed or taken up in the future. Time should also be\nallocated for evaluation of activities.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nReal Estate\n- Investigate ways to preserve funding and protect affordable\nhousing. Concepts like community land trusts, limited-equity\ncooperatives, and mutual housing associations can help address\nissues of affordability for individuals, community development\nand sustainability of funding. Resident Ownership Mechanisms\n(ROMs) will be critical to stabilizing prices and preserving\naffordability. See \"Sharing the Wealth: Resident Ownership\nMechanisms\" by PolicyLink, 2001.\nCommunity Organizers\n- The Community Organizing department can play a critical\nrole in the success of the IDA program. NeighborCircles\nalready represents a promising outreach process within LCW\nthat the IDA program should utilize. Through NeighborCircles\nthe Community Organizing Department can advertise and\nidentify strong candidates for the IDA program. Additionally,\nNeighborCircles can also serve as a geographic framework for\nfuture IDA groups. IDA groups could meet at the block level,\nwhich would create stronger ties between individual development\nand place. IDA group discussion could not only focus on social\nsupport and financial planning, but also could focus on how groups\nof neighbors can upgrade their own block through buying locally.\nThus, Community Organizing can provide marketing assistance\nand a geographical framework for future IDA groups.\nDesign Center\n- Continue data collection in target neighborhoods\n- Work with IDA program, helping workshops with mapping\nexercises\n- Conduct \"visioning\" sessions with RGI and other planning\nprograms\nL\nESSONS LEARNED\n\nData Collection:\nThe simplicity of the forms on the\nPocketPCs was very useful in making the data collection move\nsmoothly. Care should be taken not to complicate the process\nwith too many data fields or too many subjective judgments.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFUTURE\nAt this point, near future plans have been fully implemented. All departments in CommunityWorks\nactively play a role in the IDA program, from recruitment to training to information resources. The\nIDA program is a well-oiled machine, with many different players helping it work well. For the\nFUTURE phase, focus on integrating CommunityWorks with the City of Lawrence, RGI and\nother partners. Advocate on a state and regional level for IDAs and affordable housing.\nAs the program increases in size and impact, the focus\nof the organization should shift to external institutions. The\nRGI committee, the City of Lawrence, and state and federal\ngovernments are among the institutions that are needed to help\nthe IDA program operate to its fullest capacity. These institutions\nare important because they will enable increased funding and\nlegislative support for the IDA program and assist with the real\nestate activities of IDA participants.\nWe also imagine that coordinating at the state level with\nother IDA programs would be advantageous for funding and\npolicy-level work. On the national level, many are currently\nadvocating for IDA tax credits, and CommunityWorks should be\nin a position to advocate and take advantage of this resource. This\nwould provide funding much like current affordable housing tax\ncredits. This is an example of the type of outreach and creative\nthinking that is necessary to expand the IDA program and ensure\nits sustainability.\nThere are few specific recommendations for the far future. We\ndo not presume to be able to predict exactly how CommunityWorks\nand the IDA program will evolve over the next few years, so it is\ndifficult to predict what will be necessary at that point. More\nuseful is a look at important issues for CommunityWorks to\nconsider as the program expands and improves.\n\nAlexander | Canepa | Pauls | Port | Rice | Weisner\nCourse 11.423 | Spring 2004\n& Lawrence CommunityWorks\nFamily Investment Center: Individual Development Account\nProgram\nWorkshop/Curriculum/Support Administration:\n\"Provide online financial education and asset-specific\ntraining. IDA participants should have the option of taking\nfinancial education and asset specific training in a classroom\nsetting or online. The online setting allows participants to learn\nat different paces and reinforces the lessons through exercises and\nother interactive learning techniques. Online financial education\nand asset specific training should be available in languages other\nthan English. Key stakeholders are practitioners and national\nnetworks\" (Zednek 11).\nReal Estate\n-Analyze the impact of IDAs on the housing market. See example\nof Atlanta work. LCW could take a similar approach towards\nmeasuring the effects of the IDA program on place. Data was\ncollected in the workshop about which areas of Lawrence are\nunsafe. Three years from now, after there is a critical mass of IDA\ngraduates in homes, data could again be collected about which\nareas are unsafe in 2007. Areas that have changed from \"unsafe\"\nto \"safe\" could be spatially related to IDA home purchase locations\nto show the IDA programʼs neighborhood impact.\nGeorgia Tech Data and Policy Analysis Group\nThe primary think tank for IDAs in the country, the Center for Social\nEnterprise Development (CSD) acknowledges that limited research exists on\nhow IDAs have place effects in neighborhoods. This question is critically\nimportant for community-based IDA programs and community development\nfoundations, as they are not only interested in how IDAs can improve\nindividualʼs lives, but also how IDAs can improve neighborhoods. As a\nresult, CSD funded a study to be executed by Georgia State and the Georgia\nTech Data and Policy Analysis group (DAPA) in Atlanta that would fill this\nresearch gap.\nDAPA found that spatial analysis using GIS was essential to understand\nthe impact of IDA programs. They evaluated three Atlanta intown\nneighborhoods over two years, and used GIS to relate the location of\nIDA home purchases to neighborhood indicators, such as building code\nviolations, trash, vandalism, home sales amount, and vacant lots. Thus, IDA\nsponsor organizations could begin to answer questions, such as:\n-\nDoes vandalism decrease near areas where IDA participants\npurchased homes?\n-\nDo property values increase in areas where IDA participants\npurchased homes?\n-\nIs there less trash in the streets close to where IDA\nparticipants purchased homes?\nL\nESSONS LEARNED\n\nData Collection:\nCertain details, such as how to assess\nvacant lots and building types, need to be figured out before\ngoing into the field to gather data. This is necessary to insure\nconsistency of the data in the GIS project.\n\nRESOURCES\nResearch and Policy\nwww.cfed.org (r) \"The Center for Enterprise Development\n(CFED) fosters widely shared and sustainable economic\nwell-being. CFED promotes asset-building and economic\nopportunity strategies, primarily in low-income and\ndistressed communities, that bring together community\npractice, public policy, and private markets in new\nand effective ways.\" They also host a site called the\n\"IDAnetwork\" (www.idanetwork.org) that has several\npublications on everything from IDA program design, to\nfunding, to accounting practices.\nCenter for Social Development at Washington University\nin St. Louis\nhttp://gwbweb.wustl.edu/csd/Areas_Work/Asset_\nbuilding/IDAs/Adminstration.htm\nZdenek, Robert and Beverly Stein. Recommendations from the\nField: Individual Development Accounts as Part of a Universal\nAsset-Building System. Center for Social Development, Washington\nUniversity in St. Louis, 2003.\nUsing GIS for Community Development\nTalen, Emily. Bottom Up GIS: A New Tool for Individual and\nGroup Expression in Participatory Planning. American Planning\nAssociation Journal, Summer 2000, Vol. 66, No. 3.\nInnes, Judith and Simpson, David. Implementing GIS for Planning.\nAmerican Planning Association Journal, Spring 1993, Vol. 59, No. 2.\nKellogg, Wendy. From The Field: Observations On Using GIS To\nDevelop A Neighborhood Environmental Information System For\nCommunity-Based Organizations. URISA Journal, Spring 1999, Vol.\n11, No. 1.\nBest Practices/Case Studies\nAbt Associatesʼ Assets for Independence Act Evaluation\nhttp://www.abtassociates.com/reports/AFIA_2nd_annual.pdf\n\nAdministration\nBaggett,\nWalter.\nINDIVIDUAL\nDEVELOPMENT\nACCOUNTS: AN ACCOUNTING AND AUDITING GUIDE\nSharing the Wealth: Resident Ownership Mechanisms,\nPolicy Link Report, 2001. Highlights include pages 94-101. This\noutlines mechanisms for preserving affordability for individuals\nand the community.\nMoney in the Bank: The Extra Credit Savings Program - http:\n//www.shorebankadvisory.com/resources/moneyinthebank.pdf\nHow-to guide for outreach on tax credits\nCenter on Budget and Policy Priorities CBPP offers a free,\ndetailed how-to guide to develop and implement outreach\nstrategies around the Earned Income Tax Credit. It includes\nguidelines and ideas on staffing, timing, promotion and technical\nconsiderations. The materials can be viewed at www.cbpp.org or\nordered by mail from Center on Budget and Policy Priorities, 820\nFirst St., NE, Suite 510, Washington, DC 20002; telephone 202-\n408-1080.\nOutreach to promote the Earned Income Tax Credit City of\nChicago Mayorʼs Office of Workforce Development\nThe city of Chicago has aggressively promoted the benefits\nof the Earned Income Tax Credit to help bring more federal\ndollars back into the local economy. Intensive outreach through\nemployers, community organizations, newsletters and grocery-\nbag advertisements helped attract households to free tax-\npreparation services, where they claimed an estimated $16 million\nin EITC refunds. A booklet and Web site describe the outreach\nstrategies. Contact Julie Rubins Wilen at 312-744-WORK or visit\nwww.chicago-eitc.org\n\nAPPENDIX A\nIDA Participants in Workshops 1 and 2\nParticipants\nApril 9, 2004\nParticipants\nApril 16, 2004\nFirst Name\nLast Name\nFirst Name\nLast Name\nInez\nPerez\nFlorencia\nOtero\nTeofila\nRichardson\nTeofila\nRichardson\nAna\nHeredia\nReyna\nBurges\nGloria\nHernandez\nTrina\nDe Jesus\nJuana\nJimenez\nPetronilia\nDe la Rosa\nMonica\nOhoa\nGloria\nHernandez\nAntonia\nPayano\nJuana\nJimenez\nValerie\nAponte\nMonica\nOchoa\nAna\nFuertes\nAntonia\nPayano\nLuz\nMirabel\nAna\nFuertes\nMary\nMoquete\nMary\nMoquete\nMayra\nPaulino\nRose\nPierre\nYvette\nRomen\nMercedes\nSolano\nMaria\nTejada\nAltagracia\nValdez\nMIT and CommunityWorks Staff in Workshops 1 and 2\nWorkshop 1: Friday, April 9\nMIT\nLCW staff\nYouth\nJames Alexander\nAnnery Brea\nRebecca Camargo\nClaudia Canepa\nNelson Butten\nShannon McKay\nAndre Leroux\nAlberto Ortega\nAndy Port\nSolana Rice\nMonica Romis\nMelody Tulier\nValentina Zuin\nWorkshop 2: Friday, April 16\nMIT\nLCW staff\nJames Alexander\nNelson Butten\nClaudia Canepa\nAndre Leroux\nLorlene Hoyt\nAlberto Ortega\nEd Pauls\nMichael Weisner\nValentina Zuin\n\nData Collected on Housing Supply in the North Common\n1.\nLand Vacancies\n=Yes (Skips to # 6 below?)\nNo\n2.\nBuilding Occupancy (Appears to be):\n- Occupied\n- Vacant\n3.\nCurrent Use Type (Pulldown):\ny Single Family\ny 2-4 Family\ny Multi-Family Buildings (5 or more)\ny Mixed Use\ny Commercial\ny Industrial\n4.\nEstimated Number of Existing Housing Units\n(Pulldown):\n- (1,2,3,4, 5,6, More than 6)\n5.\nBuilding Material:\nBrick\nVinyl\nWood Siding\nShingles\nOther\n6.\nGeneral Condition of Structure:\ny Excellent\ny Good\ny Moderate\ny Poor\n7.\nGeneral Condition of Land:\ny Excellent\ny Good\ny Moderate\ny Poor\n8.\nPhotographs ID # (Type) or N/A\n9.\nComments Field (Story/History/Additional\nComments)\n\nParcel Ownership in North Common\n2-4 Family Homes in North Common\n\nAdditional Data Available in ArcGIS Project\nCreated by MIT (partial listing)\nCity Parcels & Assessors Data (2004)\nAssessors Tiles\nNorth Common Neighborhood\nB&W Aerial Photos\nSchools Locations\nMunicipal Parks\nFlood Zones (100/500 Year) & Upland Areas\nSpicket Watershed\nTopography\nWaterways & Waterbodies\nRoads (Tiger & City with Street Names)\nWards & Precincts\nZoning Layers & Existing Land Use\nMA Cities & Towns\nRegional Planning Agency Areas\nSchools Locations\nMunicipal Parks\nHigh-Quality Color Orthophotos\nMHD Roads & Centerlines\nCommuter-Rail & MVRTA Routes\nCensus Block Groups\nProtected & Recreational Open Space\nState Register of Historic Places\nNeighborhood Boundaries\nHistoric Districts\nMap of Amenities in North Common\n\nData Collected on Housing Demand by IDA Participants\nNo.\nLayer Title Concept\nFile Name (3 files\neach)\nType (Point/Line/\nPolygon)\nWhere are the bad\nplaces?\nbadplaces\nPolygon\nWhere would you buy a\nhome?\nbuyhome\nPolygon\nWhere do your friends\nand family live?\nfriendfamily\nPoint\nWhere are the best\nschools?\nbestschool\nPoint (\"snap to\" existing\nschool points)\nBest places where your\nchildren play?\nchildplay\nPolygon\nWhere do your children\ngo to for after school\nactivities?\nafterschool\nPoint\nWhere do you go for\nchurch?\nchurch\nPoint"
    }
  ]
}