{
  "course_name": "Information and Communication Technology in Africa",
  "course_description": "This is a discussion-based, interactive seminar on the development of information and communication technology in Sub-Saharan Africa. The students will seek to understand the issues surrounding designing and instituting policy, and explore the possible ways in which they can make an impact on information and communication technology in Africa.",
  "topics": [
    "Business",
    "Information Technology",
    "Engineering",
    "Electrical Engineering",
    "Telecommunications",
    "Society",
    "The Developing World",
    "Business",
    "Information Technology",
    "Engineering",
    "Electrical Engineering",
    "Telecommunications",
    "Society",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nFormat\n\nThis course, as part of the\nExperimental Study Group\nSeminar Series, offers students the opportunity to participate in a small discussion-based class taught by an MIT upperclassman under the guidance of a faculty supervisor. Student Raja Bobbili (B.S. 07 Computer Science and Electrical Engineering, Economics) taught this seminar in cooperation with Prof. Shigeru Miyagawa of the Foreign Languages and Literatures Department. Seminars taught in this format are all graded Pass/Fail and receive 1/2 of the academic credit assigned to regular academic classes.\n\nBackground and Motivation\n\nInformation and Communication technology has changed the world in ways that no other piece of innovation has in the past century. The countries of East Asia are booming economies, controlling the technological landscape of the world. Even smaller nations such as Vietnam and Thailand are receiving huge benefits from Information Technology. But Africa has been left out. Except South Africa, almost 32 countries in Africa don't even have access to the vital Fiber Optic.\n\nInformation and Communication Technology in Africa has been the recent focus of much international development. While HIV/AIDS and poverty are still popular areas in international aid, improvement in technology is picking up at a tremendous pace. But development can not be restricted to the United Nations and large NGOs - the potential for impact by MIT students, with their faculty support, is enormous and beyond what one can imagine. The seminar will merely scratch this potential by attempting to explore into ways in which MIT students can make an impact on the Information and Communication Technology landscape of Africa.\n\nSeminar Overview\n\nThis seminar will explore into two major themes relating to Information and Community Technology: national policy and project implementation.\n\nTheme I\n\nThe students in this course will seek to understand the issues surrounding designing and instituting policy on Information and Communication Technology in Sub-Saharan African countries. What do governments consider? What are the donor's expectations? Students also explore into the complex issues involved in implementing such a policy - what are the draw backs, what is the long term sustainability? They will follow an interesting path of exploration and discovery, through both case-studies and live speaker presentations, that will help them understand not only issues surrounding Information Technology but also cultural and social factors that come into play when implementing a new technology.\n\nTheme II\n\nThe second important aspect of the seminar will be the project implementation. This alternative method of learning will focus on hands-on projects that students will pursue through 2/3rd of the semester, in which they choose a particular issue and a region of their interest, and initiate a development project in that area. Past examples of these projects could be teaching programming to a group of students in Kenya, or implementing OpenCourseWare in African universities, initiating iLabs in Zambia. A series of guest speakers will encourage students to pursue projects, and guide them towards appropriate funding sources. Students will also be taught effective proposal-writing techniques.\n\nSeminar in Detail\n\nTheme I\n\nTheme I is for students who would like to understand the theoretical aspects of Information and Communication Technology in Africa. This could also be specially relevant to those students that have commitments for the majority of the summer, disabling them to pursue hands-on projects started during the semester.\n\nJust like Theme II, students participating in Theme I have a strong, satisfying deliverable. The National Institute for Scientific and Industrial Research is promoting Information and Communication Technology in Africa. One of the many ways in which it is pursuing this goal is by implementing an \"ICT Policy\". This is the policy that will effectively guide the government and federal institutions towards promoting ICT.\n\nThe researchers involved in establishing this policy have very limited knowledge of information and communication technology. While they are aware of the cultural and social aspects surrounding the policy, they are not very well rehearsed in aspects surrounding ICT itself. In an effort to engage the community in developing this policy, they have requested specific people to draft their own feedback to a sample version of the policy. These people include common IT professionals working in Internet Cafes as well as the Minister of Science and Technology himself.\n\nThe students in SP.259 will have the unique opportunity of being part of this group of people involved in voluntarily supporting the institution of the National ICT Policy. Through discussions, seminar presentation, guest speakers and support of Political Science professors, students will have the opportunity to extensively establish policy on Information and Communication Technology.\n\nStudents who invest their SP.259 efforts into Theme I will receive a certificate of recognition from the Ministry of Science and Technology in Zambia, and the Minster of Communications and Transport.\n\nTheme II\n\nTheme II will be particularly useful to students who would like to conduct a hands-on ICT-related project in Africa. Over the course of the semester, students will be exposed to different ICT-projects, both within MIT and outside. Guest speakers will be invited and live presentations will expose them to many different types of projects. Student speakers will lead discussions on acquiring funding and securing material and advisory support. Leaders from ICT projects such as iLabs and OCW have been invited.\n\nThe students following Theme II will have the freedom to select their project, region, implementation plan. The course will also focus heavily on acquiring funding. Guest speakers will be invited to give lectures on writing effective proposals and approaching funders. A wide array of talents will be acquired, and a large international exposure is an unbeatable experience. It is hoped that the majority of the students in the class will be able to acquire funding to travel abroad over the summer.\n\nTheme II students will be expected to put in more work outside of class, since they will need to write proposals, acquire funding and consult faculty for project support. Therefore, the students that choose this track should be motivated and have specific expertise that they would like to take onto the field.\n\nAttendance Policy\n\nSince this a seminar-style class, attendance is very important. The seminar is going to be highly discussion-based, so participation is even more important!\n\nMaximum number of unexcused absences: 2\n\nGrading\n\nActivities\n\npercentages\n\nIn-class Participation\n\n20%\n\nPresentation 1\n\n15%\n\nPresentation 2\n\n15%\n\nFinal Project\n\n50%",
  "files": [
    {
      "category": "Resource",
      "title": "A Voice Portal For Health",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/ef95776b5d5bd5ceeb51850890cf18f5_MITES_259S06_scott_1.pdf",
      "content": "A Voice Portal For Health\nCase Study Presentation\nMark Scott\n1st March 2006\nES.259 ICT Solutions for Africa\n\nCOMPANY OVERVIEW\n-\nVoxiva provide ICT solutions to improve exchange of information\n-\nReal-time collection, analysis, response\n-\nAccess through telephone, fax, email, SMS or web\n-\nSuitable for use with under-developed infrastructures\n-\nSpecialises in co-ordination of:\n-\nHealthcare: Disease surveillance, response management,\npatient care\n-\nDevelopment Co-ordination\n-\nE-Government\n\nCASE STUDY\nPERU HEALTHCARE INFORMATION\nDISTRIBUTION SYSTEM\n\nTHE PAIN - Current Situation\n-\nOver 6,000 healthcare centres in Peru\n-\nRequire constant stream of communication between floor-level\nhealthcare practices and centralized Ministry of Health.\n-\nTypical communication requirements include\n-\nDisease reporting eg. Malaria, Cholera, Polio\n-\nFeedback from centralised MoH\n-\nCurrent system is paper based on floor-level, with computer\nfacilities only available at top levels of the health service.\n-\nConsequence: 90% of healthcare centres rarely or never\nreceive information regarding health alerts\n\nPeruvian Demographics\nPopulation:\n27M\nCountry Area:\n1.3Msqkm\nICT Prevalence:\n5.7M telephones\n3.6% Internet Users\nSource:\nACTETSME (2003)\n\nMISSION STATEMENT\n\"Improve the speed and reach of communication\nbetween health professionals and organisations\nwith no investment in new hardware\"\n\nThe Solution\n-\nWell developed and widely available telephone network\nÆ\nCreate a chiefly telephone based information portal! Also\nintegrate it with additional internet solutions.\n-\nProvision of a Freephone number to healthcare practices and\norganisations for:\n-\nReporting diseases\n-\nCollection of voicemails\n-\nAccess to databases or reports\n-\nAccess voice-recorded library information\n-\nContact an operator\n-\nMake transactions\n-\nDeveloped a bespoke platform ALERTA, launched 2001\n\nFinance and Sustainability\n-\nFor profit\n-\nSetup funded by a $250,000 grant from InfoDev\n-\nDoes not charge users\n-\nAims to become fully supported by Peruvian MoH after an\nevaluation of its sustainability\n-\nSales opportunities to groups across the globe. Current\ninterested groups include the Peruvian Navy and US FDA.\n\nSuccesses\n-76 health facilities connected (188 more pending)\n- 200,000 habitants\n-4,269 reports submitted\n-28,296 cases filed\n-Immediate communication between ground-level and\ncentral organizations for suspected diseases such as\ncholera\n-Branching out of services into crime reporting\n\nMerits for Success\n- No charge to healthcare practice\n- Uses currently installed infrastructure - no new hardware.\n- Effective training programme for installing ALERTA into new\npractices.\n- User friendly platform\n- Flexible means of connectivity\n- Receipt of grants\n- Wide range of uses for technology model (high customer\nbase)\n- Co-operation with Peruvian MoH\n\nObstacles\n-Lack of telephones in many rural areas\n-High rate of personnel turnover in healthcare and government\noffices - difficult to maintain a trained workforce.\nHOW CAN THESE BE OVERCOME?\n-Access of portal via radio communication\n-Telefonica intends to make greater use of radio\ncommunication to connect rural areas to the mainline\ntelephone system.\n\nFeedback\n-Voxiva are continuously reforming the system in response to\nuser feedback.\n\"We can see the information immediately. Now everyone is\ninformed about a case and the appropriate measures can be\ntaken. It is truly an important benefit. It could help iradicate\ndiseases.\"\n\nConclusions\n- A successful seeding of new technology in healthcare\ncommunications\n-\nUses currently installed infrastructure\n-\nFree for users\n- Developed a sustainable commercial programme\n-\nWide customer base\n-\nAdaptable technology\n\nBut I thought this was a\nclass about ICT solutions\nfor AFRICA!\n\nALERTA for Africa\n-ALERTA's future successes lie in the acceptance of the\ntechnology in other countries and organisations across the\nglobe.\n-Is Africa a potential customer for this system?\n\nSub-Saharan Demographics\n2003 ICT Data for Sub-\nSaharan Africa\nSource ITU 2003\nTelephone Access: 3.0%\nInternet Access: 1.6%\n\nAre there Enough Telephones?!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment One: Case-study Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/c3705d4d61335969df21d242292f6da7_MITES_259S06_Ass_one.pdf",
      "content": "Assignment One: Case-study Presentation\nES.259\nRaja H. R. Bobbili\nAssignment:\nPlease choose one of the topics from the case-study summaries e-mailed to you.\nFollowing that, prepare a 15-minute power point presentation to be presented during\nclass. This presentation will contain a summary of your case, and a detailed analysis\nSubmit the presentation on the stellar site on or before 7 pm on the day of the\npresentation.\nCriteria for assessment will be (Courtesy Manish Gaudi):\n* Introduction - What is the problem being addressed? What is the idea\nto solve this problem? What is the project scope? Is this a non-for-\nprofit, or a business? Why do YOU think the project chose to be non\nprofit or for-profit?\n* Project Implementation - How is the idea implemented? How does the\norganization run on a daily basis? How does it generate revenue? Is the\napproach successful?\n* Use - How did the target audience react to this idea? Is it catching\non, or is it struggling to stay afloat? Why do YOU think this is the\ncase?\n* Impact - Is the project making a substantial difference? What is the\ndata that supports your claim? Did this project benefit or hurt the\ncommunity it affected in ways that were not predicted?\n* Conclusions - How has this project succeeded? How has this project\nfailed? What are YOUR conclusions about it?\nThis is just a template - you are able (and encouraged) to deviate from\nit as you see fit.\nNote: You are expected to research into the case-study in-depth. The information\npresented in the case-study is not sufficient for the presentation.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment Two: A Partnership between MIT and Computer Aid International",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/553c874a78c8fcee73e5101ef14855ae_MITES_259S06_gill_2.pdf",
      "content": "Assignment Two: A Partnership between MIT and Computer Aid International\nES.259: Information and Communication Technology in Africa\nHarmeet Gill\nMarch 8, 2006\n\nA Partnership between MIT and Computer Aid International\n\nThe digital divide continues to expand as communities with advanced technology\ncontinue to grow and those without access to technology get left behind. This divide can\nbe seen between communities living in the same city or state or between communities\nfrom completely cultures and countries. The solution in both cases is to educate\nunderserved communities about computers and other technology, and describe ways in\nwhich it can help them in their education and daily lives.\n\nStarting this summer, students at MIT would join hands with Computer Aid International\nto help provide refurbished computers to organizations in developing countries of Africa.\nIn addition to fixing old PCs, MIT students would also travel to Africa to teach educators,\nstudents, and/or families about computers. Students could join one of Computer Aid\nInternational's current projects or a new community with the need would be found.\n\nComputer Aid International is an organization based in London, England that works to\nprovide organizations in developing nations, including African countries such as\nSwaziland, Kenya, Zimbabwe, Rwanda, Cameroon, and Ethiopia, with refurbished PCs.\nThey send PCs to areas where this application of information technology would have the\ngreatest social and economic impact. In the UK they ask businesses to donate old PCs\nthat they no longer need after upgrading to better technology. Then the hard drives of the\ndonated PCs are completely cleared of data, the PCs are refurbished, and tested before\nshipment to their destinations.1\n\nMIT has a two-part program at the Public Service Center called CommuniTech that\nworks to shorten this technology gap. Through the MIT Used Computer Factory (UCF),\nCommuniTech provides refurbished computers to families in need in the Boston area.\nThen through Families Accessing Computer Technology (FACT), it trains the families to\nbe able to use these computers.2\n\nMIT students would work with or under CommuniTech to help Computer Aid\nInternational on one or more of its current projects.\n\nOne of the current projects is an initiative with Computers for Schools Kenya.\nComputers for Schools Kenya is a non-profit organization that works to create a\nsustainable use of computers in Kenya's secondary schools. Since August 2002, over\n1000 PCs have been installed into 54 Kenyan state secondary schools.3\n\nComputer Aid International has also provided computers to the Computer Education\nTrust (CET) in Swaziland. Created in 1998, CET is an initiative to help the sustainable\nuse of PCs in Swaziland schools. Since the project began in August 2000, over 2,186\n\n1 www.computeraid.org. March 8, 2006.\n2\"CommuniTech,\" http://web.mit.edu/mitpsc/programs/communitech/. March 8, 2006.\n3 www.computeraid.org. March 8, 2006.\n\ncomputers have been donated improving the use from almost zero to half of all secondary\nschools.\n\nAnother possibility is working with the Community and Individual Development\nAssociation (CIDA) University in South Africa. Computer Aid International and CIDA\nare working together to provide low-income students with high tech, low cost IT\nfacilities.4\n\nWhile MIT students could greatly help with these initiatives, it may initially be a little\ndifficult to incorporate the MIT students into these established programs. However after a\nshort period of time, there may not be any problems. Since the goals of all of the\norganizations will be very similar, if not the same, the MIT students would most certainly\nbe valuable additions to the efforts. We would all be working together to provide\nresources and the PCs and to educate the members of the focus communities.\n\nThe team of MIT students would consist of several students who would clear the hard\ndrives, a couple to refurbish, and one or two team leaders. Any of the students would be\nable to teach and work in implementing the efforts. The team could include members of\nCommuniTech. Ideally, the project would be a joint effort between CommuniTech or by\na team under CommuniTech and Computer Aid International.\n\nSince the PCs would be donations and we would be using the MIT facilities to clear the\nhard drives and to refurbish the computers, the main costs would be shipment costs, if we\nship the computers, and the costs of travel to and living expenses in Africa. Part of the\nmoney could be fundraised. Companies could also provide monetary donations if not\ndonating their old PCs.\n\nOnce the team is set up, work could begin immediately since it is very likely that\ndonations would begin flowing in and we already have access to facilities and resources.\nThere is no doubt that a team of MIT students could provide passion, knowledge, and\ndrive to this effort to bridge the digital divide.\n\n4 www.computeraid.org. March 8, 2006.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment Two: Idea",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/e2d90bfb328a7532d4e7b5cb05602b52_MITES_259S06_Ass_two.pdf",
      "content": "ES.259: INFORMATION AND COMMUNICATION TECHNOLOGY IN AFRICA\nAssignment Two: IDEA\n(due 8th of March, by 7 pm)\n\nYou may choose either of the following two options to present on:\n\nOption One: TechVillage\n\nUnder the materials section of the MIT server, you'll notice there is a picture-essay of\nan African Village. The different aspects of the village, which should given you an idea\nof the surroundings, children, sanitation levels etc. You'll get into a group of 5 people to\ndesign a technology. Proceed as follows:\n\n- Get into a group of 5 people\n- Outside of class, choose a technology that you think will benefit this village. It\nhas to be ONE product ONLY. This can be a new type of motor, a new sanitation\nsystem etc.\n- Your job in the next class (8th of March) will be to do a short 5- minute skit, in\nwhich you'll sell this technology. The skit can either be a TV advertisement, a\nspeech, anything.\n\nGrading: You'll be graded on the content of your skit, as well as the style, how\ninteresting it is, your use of audio/visual media, etc.\n\nOption Two: Two-page Paper\n\nThe second option will be suitable for those that already have an idea of a program or a\nnew technology that they would like to see implemented in Africa. This will essentially\nbe a 'preliminary project proposal'. The proposal should be two single-spaced pages in\nlength, and should contain the following:\n\n- What is your idea? What problem will this idea potentially solve if implemented?\n- Tell us a little about the implementation of such an idea. How will it work? How\nfeasible is it?\n- What are the potential obstacles? What do you see as the main problems, in terms\nof long-term sustainability?\n- What scale of funding will you require? Can you think about any sources for your\nfunding?\n- How many people, and what sort of people, would you require on your team?\n- What is the approximate timeline?\n\nGrading: We understand that you may not have a very clear picture of what you'd like\nsee done in Africa this summer. This will materialize as the class goes. However, we\nwould like to summarize whatever the ideas you have, and present them on paper. You'll\nbe marked not as much on your idea, as your goals, and how you are thinking about\nimplementing them.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Grameenphone and Grameen Telecom",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/47c85b903f41c8c894e4f01c45a188df_MITES_259S06_gill_1.pdf",
      "content": "GRAMEENPHONE & GRAMEEN\nTELECOM\nVillage Phone Program\nInformation & Communication Technology in Africa\nHarmeet Gill\nMarch 1, 2006\n\"The telephone is a weapon against poverty.\"-GrameenPhone\n\nGrameenPhone\n\nCreated by Grameen Bank\n\nNov 1996- offered a cellular license in Bangladesh\n\nMarch 26, 1997- launched service on Independence Day\n\nNovember 2005- more than 5 million subscribers\n\nGrameenPhone's two purposes:\n-\"to receive an economic return on its investments\"\n-\"to contribute to the economic development of\nBangladesh where telecommunications can play a critical\nrole.\"\nwww.grameenphone.com, March 1, 2006\n\nThe Strategy & The People\n\nStrategy: rather than connecting \"islands\" of urban\nareas, grow the network one cell phone at a time\n\nPeople: hires young people who are passionate and very\nwell-educated from institutions in Bangladesh and\nabroad\nwww.grameenphone.com, March 1, 2006\n\nGrameen Telecom (GT)\n\nCreated by Grameen Bank\n\nWholly-owned non-profit organization\n\nInitiative of Professor Muhammad Yunus\n\nHolds 35% share of GrameenPhone\nhttp://www.grameen-info.org/grameen/gtelecom/, March 1, 2006\n\"What Works: Grameen Telecom's Village Phones,\" Nevin Cohen, June 2001\n\nBangladesh\n-144,000 sq km total (133,910 sq km land &\n10,090 sq km water)\n-Slightly smaller than Iowa\n-Population: approx. 144,320,000\n-Literacy rate:\ntotal pop 43.1%\nmales 53.9%\nfemales 31.8%\n-main issues: extreme poverty & 1/3 of country\ngets flooded annually during monsoon season\n-\nProblem: 97% of homes and almost all rural areas do not have a phone\n(teledensity rate is 40 phones per 1000 people and almost negligble in rural areas)\nhttps://www.cia.gov/cia/publications/factbook/index.html, March 1, 2006\n\"What Works: Grameen Telecom's Village Phones,\" Nevin Cohen, June 2001\nwww.sgi.org, March 1, 2006\n\nVillage Program (VP)\n\nBegan in 1997\n\nMore than 165,000 VP subscribers as of August\n\nHow it works:\na) Grameen Bank approves financing of a phone\nand gives a loan\nb) GT buys a cell phone subscription, provides the\nconnection, hardware, and training for the\nentrepreneur\nwww.grameenphone.com, March 1, 2006\n\"What Works: Grameen Telecom's Village Phones,\" Nevin Cohen, June 2001\n\nOutcomes\n\nAverage revenue per user of VP subscribers is twice average\nrevenue of the GP business user\n\nRevenue in 1997: BDT 0.53 million\n2002: BDT 1,114 million\n2003: BDT 2,070 million\n\nThrough VP, more than 60 million people have access to\ntelecommunications facilities.\n\nOn average, each operator serves a village with a population\nof 2,500\n\nWon the \"GSM in the Community Award\" in 2000 &\nPetersberg Prize in 2004\nwww.grameenphone.com, March 1, 2006\nwww.sgi.org, March 1, 2006\nwww.globalenvision.org, March 1, 2006\n\nBenefits\n\n95% of operators are women and so has\nimproved the status of women and allowed them\nto contribute financially\n\nAccording to a study by the TeleCommons\nDevelopment Group:\n\nThe consumer surplus from one call to Dhaka\nranges from 264% to 9.8% of the average\nmonthly household income\n\nThe phone call replaces a trip to the city which\ncan be 2 to 8 times the cost of one call\n\nFarmers and local businesses use the phone to\nreduce costs, get better prices, and plan\nshipments.\nwww.grameenphone.com, March 1, 2006\n\"What Works: Grameen Telecom's Village Phones,\" Nevin Cohen, June 2001\n\nChallenges\n\nGovernment control of telecommunications market\nthrough monopolistic provider, BTTB:\nBTTB unwilling to help connect mobile systems to\nfixed phone infrastructure, limiting expansion of the\nrural phone network\n\nLarge fees for BTTB phone service\n\nGP's use of cellular technology for fixed phone\ncenters. GSM is more expensive than fixed wireless\nlocal loop (WLL) systems. GSM towers cover 15 to 20\nkm while WLL towers reach areas within 50 km. WLL\nhas better bandwidth and is less expensive.\n\"What Works: Grameen Telecom's Village Phones,\" Nevin Cohen, June 2001\n\nThe Future\n\nContinue helping more entrepreneurs and grow network\n\nMulti purpose telecenters which will offer phone, fax, e-\nmail, Internet, word processing, data entry, distance\neducation, health assistance, adult education, and other\nIT benefits\nhttp://www.grameen-info.org/grameen/gtelecom/, March 1, 2006\n\nLaily Begum\n\nLaily Begum and her husband Atiqullah, a day laborer began in poverty living in a\ntiny house in Patira outside of Dhaka\n\nEncouraged by husband to join Grameen Bank to get loan to buy a cow.\n\nEncouraged by branch manager to apply to VP to become the first Village Phone\nLady of Grameen Telecom.\n\nBegan her business and began to earn enough to save BDT 3000 monthly.\n\nHas set up 5 shops now\n\nChildren are in schools\n\nLive in a brick-built home with two beds, two color TVs, one fridge, and one cassette\nplayer.\n\nNow plans to diversify their IT business and have applied for an Internet line\n\nQuestions\n\nHow else can this method using entrepreneurship and\nsmall business be applied to other problems?\n\nWhere else can this telecommunications initiative be\napplied?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ICT in Africa",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/e625d4337c47bb39c7e96efa37f1a63f_MITES_259S06_gul_3.pdf",
      "content": "ES.259: ICT in Africa\n\nFinal Policy Paper\n\nSABA GUL\n\nI. Background\n\n24% of Zambia's economy rests on its agricultural sector, and about 85% of its labor\nforce is employed in the sector. Agriculture in Zambia is dominated by small-scale\nfarmers or peasants, who operate their businesses without access to information, financial\nservices or structured markets. When you bite into a bar of chocolate, there is a\nreasonable chance that it will not just be the cocoa farmer that was denied a fair price for\nhis produce but that the dairy farmer, who produced the other main ingredient, also\nreceived a raw deal. Small farmers across the world are often forced to sell their produce\nfor less than it cost to produce it.\n\nIn Zambia, the majority of selling for food crops takes place in local 'farmers' markets'\nwhere buyers and sellers get together weekly or daily, depending on the perishability of\nthe crop. This market is primarily structure-less, with no fixed prices or buying rules.\nFarmers are usually forced to sell their crop immediately after harvest, fetching very low\nprices for it, hurting family income and leading to seasonal hunger. Lack of economic\nclout in the market, lack of information about buyers, and the absence of a price floor\nmeans that prices are open to negotiation and more often than not, exploitation, by\nbuyers. There is a tangible lack of a forum that brings together buyers and sellers, stores\ntheir biographies for reference, documents buying power and availability of product, and\nlends a structure to pricing policies. Such a forum can transform the ad-hoc buying\npractices of the market, and boost selling prices for the farmers by reducing exploitation\nbecause of ignorance.\n\n2. Suggested Technology and its Uses\n\nMy solution is a database called FarmNet that will be implemented in a computer (kiosk)\nat a single farmers' market this summer. Both farmers and sellers input their data into this\nsoftware, whereby it acts as a searchable database. It can then be used by both farmers\nand buyers to find quick and accurate matches for their buying and selling needs.\n\nFrom the sellers' (farmers) side, relevant data would be:\n- Name, location and contact information of farmer\n- Name of crop\n- Quantity of crop available\n- Selling period\n- Selling price\n\nBuyers would then input data such as:\n- Crop they want to buy\n\n- Quantity to buy\n- Price they are willing to pay\n\nFarmNet supports querying, and generates web forms with the relevant information. It\nmaintains the data of farmers (sellers) and the buyers in two separate tables, that can be\nqueried and sorted according to the farmer's name, their selling price of any of the other\nvariables. Similarly, the buyers' data is stored such that queries can be run on it according\nto what price they are willing to pay for it. For example, a farmer looking for a minimum\nprice of 20 Cedis for a ton of yam, could ask for all buyers in his village who are willing\nto buy yam for 20 Cedis or more. The script will generate a list of such buyers, which can\nthen be used by the farmer to make a decision about who to sell his crop to. All buyers\nand sellers will also input their contact information so that deals can be made over the\nphone, or in person (if both parties are in the same village).\n\nBy using this software, farmers can reap multiple benefits. They can enjoy a wider target\nmarket that has access to their biographies, and can contact them to arrange a crop deal.\nIn addition, they themselves can now make more informed selling choices. Instead of\nbeing forced to sell at low prices at the local market, they can now name a reasonable\nprice and expect to meet it. Since prices are quoted in the database, there is no danger of\nprice exploitation through negotiation. Both buyers and sellers can find complementary\nparties that match their needs.\n\n3. Implementation Plan\n\nThe implementation phase of this project involves two distinct parts: the in-house\ndevelopment of FarmNet and the on-the-field deployment of this technology.\n\nThe deployment part has multiple phases:\n- Setting up of kiosk\nThis can be a simple one-room unit, with a computer that will have FarmNet\ninstalled on it, a printer, two or three desks for the managers, and a space for\npamphlets. The location should be central to the farmers' market since farmers\nwill be visiting often to update their data, and request information about\nbuyers.\n\n- Selection of team to run kiosk\nThis is the team that will actually use FarmNet, and input data given to them\nby the farmers (sellers) and the buyers. It will consist of a handful of other\ncomputer-literate villagers who will initially serve as the managing team for\nthe kiosk. They will undergo a training session to get familiar with FarmNet,\nlearn how to gather data from farmers, and answer information queries for\nboth buyers and sellers. Thereafter, they will run the kiosk and be responsible\nfor any further training of new managers.\n\n- Introducing farmers to the technology\nOn setting up the kiosk and selecting a managing team, the village farmers\nwill be introduced to FarmNet. Even though they will not directly be using it\nsince that will be the managers' task, familiarity with the technology will\nensure that they trust what it is used for, feel comfortable giving their data to\nthe managers, and are in a position to make queries about the buyers in order\nto make informed decisions about the sale of their crop.\nIt is here that the farmers will have a chance to ask any questions, voice\nconcerns, and give suggestions.\n\n- Collecting data for FarmNet\nThe kiosk managers will update data on a pre-selected day of the week. On\nthis day, farmers will visit the kiosk and relay the latest information about\ntheir crop by filling out a paper form, which will save time that might\notherwise be spent waiting in queues for a manager. If a farmer's data\nbecomes outdated before that day, they have the discretion to visit the kiosk\nand fill out the form. The kiosk managers enter data from the forms into the\ndatabase on a daily basis.\nData will similarly be collected from buyers. Data queries can be made by\nbuyers or sellers with specific needs whereby they visit the kiosk and simply\npose the query to a kiosk manager. The manager will run the query, and\ngenerate a printable list for the buyer or seller.\n\n- Monitoring usage/Review of FarmNet\nOnce FarmNet is put to use, kiosk managers will also start collecting data for\nthe following variables, which will help evaluate the success of FarmNet:\n1) Number of visits by buyers and sellers over the course of a week\n2) Number of queries made by buyers and sellers over a week\n3) Number of deals made by matches through FarmNet\nThis data will be kept on file and evaluated at the project's completion.\n\nAfter FarmNet has been in use for a while, feedback from the farmers, as well\nas the buyers, will be incorporated into the final implementation of the\ntechnology.\n\n3.1 Potential Policy Issues\n\nThe adoption of a technology by the farmers will be highly dependent on a support\nsystem, such as extension and training services, credit availability, input supplies etc.\nSome of these are potential policy issues and are briefly outlined below:\n\n- Technology diffusion i.e., the transfer of technology to make it widely\naccessible will be the responsibility of extension services. The full benefits\nof agricultural research are not likely to be realized until the research\n\nresults are appropriately communicated, especially to farmers with limited\nholdings. Some research results have been so successful that their\nwidespread adoption occurred without concerted extension efforts. More\nfrequently, however, there is a large gap between the productivity that\nmodern research makes possible and the actual productivity realized by\nthe vast majority of small farmers. The integration and widespread\nadoption of research results can be supported by extension services, by\nresearchers with farm-level experiments, by communications people with\nmass media, by private suppliers, or, ideally, some combination of these.\n\n- Zambia has a high level of VAT on imported computer equipment and\ntechnology, which could be a potential issue.\n\n- Installation of lease lines for internet access is very low in Zambia. In the\ncase that this technology needs online support or supplementation, this\ncould be a hinderance.\n\n- The local agricultural offices are where there are technical assistants in\ncharge of villages in the area. Many of these technical assistants will not\nbe well trained, and will have to rely on public transport to visit the farms.\nAvailability of input supply, government silos, and marketing facilities\nprovided by the government do not feature very positively in Zambia and\ncould pose a bottleneck.\n\n- Availability of banks or credit agencies in the area will need to be\ninvestigated. New technology can be expensive if one also takes into\naccount the prices of fertilizers, high-yielding seeds, implements, and so\non. Farmers need to raise loans to buy all these inputs. Development\nagencies in the district should find a way to grant loans to farmers.\n\n- Storage will pose a considerable challenge for most. Traditional methods\nfor storage limit the length of time that the crops can be stored. There is\nalways the pressure to sell off whatever is stored before it goes bad. Under\nsuch circumstances, farmers accept low prices for their produce. State-\nowned enterprise, or government agencies need to be set up to buy and\nstore the farmers' produce.\n\n4. General Setbacks\n\nWe also anticipate some non-policy hurdles in implementing this technology in\nZambia, the more salient ones, are outlined below:\n\n1. Customizing FarmNet to meet farmers' needs\n\nTechnologies that are developed in isolation and without regard for the needs\nof the user are rarely successful in the deployment stage. The users of FarmNet\nwill be villagers with minimal computer training. It is important to note that the\nmain function of FarmNet will be to connect buyers and sellers, to give them\neasily accessible information about the other party, and to improve pricing\npolicies. Special attention needs to be paid to pricing information and\ndissemination of the contact information of the two parties.\n\n2. Overcoming farmers' resistance to technology\nThe implementation of this technology requires overcoming the resistance\nthe farmers might show to using technology and to changing the selling practice\nthat has been rooted in the farming community for a long time. The first change is\nthe hardest, but it also opens up the avenue for further, even more valuable\nchanges.\n\n3. Setting up kiosk\nThere might be unprecedented hurdles in this stage, such as electricity cuts\nor issues with where to set up the kiosk.\n\n4. Updating the data for FarmNet\nThe success of FarmNet rests partly on how reliable the data is. For this\nreason, it should be updated as often as possible. The responsibility for this will\nbe the kiosk managers'. In the 'training program' outlined above, the managers\nmust be made aware of the importance of regular updating. The farmers must be\nadvised of the fact that they need to make regular visits to the kiosk to ask the\nmanagers to update their information. If this does not happen, buyers will easily\nget disillusioned and learn to distrust farmers whose data is often out-of-date, and\nwill instead buy from farmers whose data is always up-to-date.\n\n5. Conclusion\n\nImplementing this technology in Zambia means infiltrating the existing fabric of the\nagricultural sector. The government's policies on importing technology, dissemination of\ntechnology, training of technical labor force, marketing the technology, transport and\nstorage facilities to supplement the technology, and providing credit services for the users\nof the technology will all need to be looked into.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ICT Solutions for Africa",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/4d698912e7910087d4ee2d4320590946_MITES_259S06_scott_2.pdf",
      "content": "ES.259 ICT SOLUTIONS FOR AFRICA\n\nProject Proposal:\nThe Production and Distribution of\nLandmine and Unexploded Ordinance\nAwareness Software\n\nMark Scott\nMarch 6th 2006\n\nProject Introduction\n\nLandmines and unexploded ordinance (UXO) kill or severely injure over 20,000 people\nannually1. Injuries typically result in the amputation of one or both legs, arms, hands and\nsevere damage to torso, face or eyes. There are currently over 100 million mines still\nstockpiled around the world2. A disproportionate number of casualties resulting from\nlandmine or UXO accidents are children. This is as a result of lack of education.\nLandmines and UXO are often collected and used by children as toys, unaware of the\nlethal contents within. Children frequently are unable to recognize landmines or UXO,\nand are unfamiliar with mine markings, common mine locations and recommendations in\nthe event of finding a mine.\n\nThe project is to produce an item of software for use in educating children on the dangers\nof landmines and UXO in an enjoyable manner. The software will include landmine\ndatabases, quizzes, photographs and a comprehensive teaching wizard. It will be easy to\ndistribute to centers around Africa and other mine inflicted parts of the world.\nFurthermore, the software could be distributed to other countries for raising awareness of\nthe day-to-day living with landmines and UXO.\n\nBackground - The Pain\n\nAfrica is one of the most mined continents in the world. Anti-personnel mines, anti-\nvehicular mines and UXO are the remnants from Africa's numerous civil wars and\nconflicts. Common mined areas include villages and their surrounding agricultural\nlandscape. After the war, when refugees return to their villages, they find them riddled\nwith mines. The social and economic effect is enormous. However, through suitable\neducation on mine-safety, it is possible to mitigate the negative effects of mines and\nUXO.\n\nThere is currently no standard education practice in place for African children. An easily\ndistributed, cheap educational tool would greatly improve many children's access to mine\nknowledge.\n\nIdea Implementation\n\nThe main task of this project is in the programming of the computer software. The\nsoftware will include the following features:\n- A documented 4-session course on landmine and UXO safety for teachers\n- A Picture archive of mines and UXO with descriptions and comments\n- A quiz and game section to test the knowledge of the children. This will include\nnaming mines, scrutinizing photographs and producing minefield maps.\n- An archive of landmine incidents with advice on mitigation of effects and risks\nOnce the software has been produced, it can be made freely available and distributed to\neducational systems across Africa.\n\nPotential Obstacles\nMany areas in Africa do not have access to computers for use of the software. It is\npossible in these circumstances to produce paper copies of the course and quizzes,\nalthough this will be harder to produce and distribute.\n\nThe outreach programme required to raise awareness in the product amongst teaching and\ncommunity circles in Africa will be difficult to pitch. It will be best to approach outreach\nfrom both the top-down and the bottom-up concurrently. In other words, connections\nwill be established with both the central education system and individual education\ncenters.\n\nProject Funding\nFunds will be required for the following areas:\n\nCollection of data:\nIntensive research will be required to collect mine data. Advice\nwill be sought from mine experts.\n\nProgramming:\nProgrammers will be required for the production of the software\nafter research has been completed.\n\nProduction:\nThe software will be burnt onto CD's.\n\nDistribution:\nAn outreach programme will be required to inform and supply the\nteachers with the software.\n\nTraining:\nThe teachers will require a small amount of training in the use of\nthe software. Most of this can be built in to a special teacher's\nsection of the software.\n\nFunds can be obtained by several international development organizations. These could\ninclude demining organizations such as Halo trust, or NGO's such as Oxfam. The UN\nmight also provide funding for such a project, (UNICEF), or finally, funding can be\nsought from the governments in individual countries badly affected by the landmine\nproblem.\n\nThe Team\n\nThe team will comprise of: 1 coordinator, 2 data collectors, 2 programmers and 5\noutreach staff - requiring a total team of 10 people.\n\nTimeline\n\nJuly 2006\n\n- Gain funding\nJuly 2006\n\n- Dec 2006: Data collection\nSep 2006\n\n- July 2007: Software production\nJuly 2007\n\n- Production\n\nJuly 2007 onwards\n- Outreach and distribution\n\n1 http://www.landmineaction.org/problem.asp\n2 http://www.landmineaction.org/problem.asp\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Improving Computer Literacy Through Training Programs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/6abf3e84418be97da6f22dff2459de09_MITES_259S06_weiner_3.pdf",
      "content": "Improving Computer Literacy Through Training Programs\n\nBy: Angelica Weiner\n\n... they learn how to express themselves through these tools. They learn not only the\ntechnical details, but the heuristics of being a good designer: how to conceptualize a\nproject, how to make use of the materials available, how to persist and find alternatives\nwhen things go wrong, and how to view a project through the eyes of others. In short,\nthey learn how to manage a complex project from start to finish...\n\nA. Background\n\nZambia has made a lot of progress in introducing technology to enhance classroom\nlearning. Despite increased accessibility and expansion, fluency in computer skills has\nnot been achieved by a majority of students and individuals. Advanced computer\napplications are not common. The report sent explains the importance of training school\nteachers in basic computer skills as a precursor to introducing computers, Internet, and\neducational materials to a classroom. The current situation shows there is little usage of\ncomputers in Zambia schools, and only a little more usage for adult and higher-level\neducation where networking remains very low. The study states that the rapid\ndeployment of computers and Internet to schools with trained teachers is a must. The\nultimate goal is to not only distribute computers, but promote useful computer literacy.\nThis includes well trained teachers and sophisticated computer use by pupils for\ncurricular purposes. In order to promote thorough understanding of computer topics, new\nways should be adopted to teach them.\n\nB. Uses\n\nA proposed solution for increasing computer literacy in young people is by adapting\ncomputer training programs. Mitchel Resnick of the Massachussetts Institute of\nTechnology's Media Lab explains the value of using creative media to teach about\ncomputers and programming in his initiative called Computer Clubhouses. His system of\nafter-school centers for young people (ages 10-18) has successfully taught youth how to\nexpress themselves creatively with new technologies. Clubhouse members work on\nprojects based on their own interests, with support from adult mentors. By creating their\nown animations, interactive stories, music videos, and robotic constructions, Clubhouse\nmembers become more capable learners and fluent in the workings of advanced computer\napplications. A full and thorough knowledge of computers is necessary for complicated\ntasks, and through student-led projects that goal can be achieved. Thus the proposal for a\npolicy change is to alter computer training curricula so they more effectively teach\ncomputer usage, an invaluable educational tool. By using computer technology as a\ncreative medium for expression and teaching about computers in such a way, there will\n\nbe greater output for the time and money invested. Computers, software, and networking\ndo not, by themselves, lead to the development of technological fluency.\n\nIn recent years, a growing number of researchers and educators have argued that design\nprojects provide rich opportunities for learning (e.g., Harel, 1991; Papert, 1993; Lehrer,\n1993; Soloway, Guzdial, & Hay, 1994). There are many reasons for this interest in\ndesign-based learning:\n- Design activities engage youth as active participants, giving them a\ngreater sense of control (and responsibility) over the learning process, in\ncontrast to traditional school activities in which teachers aim to \"transmit\"\nnew information to the students.\n- Design activities encourage creative problem-solving, avoiding the\nright/wrong dichotomy prevalent in most school math and science\nactivities, suggesting instead that multiple strategies and solutions are\npossible.\n- Design activities can facilitate personal connections to knowledge, since\ndesigners often develop a special sense of ownership (and caring) for the\nproducts (and ideas) that they design.\n- Design activities are often interdisciplinary, bringing together concepts\nfrom the arts, math, and sciences.\n- Design activities promote a sense of audience, encouraging youth to\nconsider how other people will use and react to the products they create.\n- Design activities provide a context for reflection and discussion,\nenabling youth to gain a deeper understanding of the ideas underlying\nhands-on activities.\n\n(Resneck)\n\nC. Implementation Plan\n\nThe implementation is not overly complicated or costly but requires an investment of\ntime and effort. To support these activities, the Clubhouse provides a variety of design\ntools, from introductory paint programs (such as KidPix) to high-end animation tools\n(such as Macromedia Director). Other software tools include: digital music recording,\nediting, and mixing tools; desktop publishing tools; programming tools (such as\nMicroworlds Logo); virtual-reality design tools for developing three-dimensional models\n\non the computer screen; and construction kits for creating and controlling robotic\nmachines (such as LEGO Control Lab). Clubhouse provides professional software\npackages that are commercially available, as well as prototype educational tools\ndeveloped at MIT's Media Lab.\nClubhouse professional level software tools include:\n\nGraphics/Design/Animation\nAdobe Illustrator(r)\nAdobe Acrobat(r)\nAdobe After Effects(r)\nAdobe InDesign(r)\nAdobe Pagemaker (Plus)(r)\nAdobe Photoshop(r)\nCredo INT Lifeforms\nMindscape KID PIX Deluxe\nMacromedia Director MX(r)\nMacromedia Flash(r)\nMacromedia Fireworks(r)\nMacromedia Freehands(r)\nCorel: DrawTM\nCorel: PainterTM\nBroderbund Printshop Deluxe\nScansoft SuperGoo(r)\nScansoft Kai's Power Tools(r)\nUlead Face Factory\n3D Programs\nAutodesk: 3D Studio Max & Plug-Ins(r)\nCorel: Bryce(r) 4\nCurious Labs Poser\nHavas Home Architect\nWriting\nMicrosoft: Creative Writer(r)\nOffice XP Pro\nWeb Design\nAdobe GoLive(r)\nMacromedia: Dreamweaver\nMusic and Sound\nCakewalk: Sonar XL\nMixman Technologies: Mixman Studio Pro\n\nRobotics and Science Exploration\nSierra: Havas Incredible Machine\nLEGO: Mindstorms Robotics Discovery Set\nProgramming\nMicrosoft: Visio 2000 Technical Edition(r)\nMicroworlds PRO\nVisual Studio Pro\nVideo Editing\nAdobe: Premiere(r)\nUlead Video solution\n\nTo implement this project requires a reworking of curriculum in schools were computer\neducation is part of the school. Even at the university level this sort of creative learning\nwould be productive even though a traditionally younger student-base has tested these\nClubhouses in the states. A trained faculty is essential in leading a class or after school\ncomputer program first. Once the software is purchased and teachers are trained,\nimplementation just requires a refocused direction in teaching. While Clubhouses are\nafter school programs in the United States, they could replace a class in school instead\nand ideally. The high-tech classrooms involve software that is easily transportable, so the\nClubhouse learning initiative can travel to different schools and classes with ease by the\nyear.\n\nD. Set-Backs\n\nThe Set-backs are the costs in purchasing new software and spending time training\nteachers. The risk is that teachers will not master the material enough to administer a\nclass, which is essential according to the Mitchel Rezneck, Clubhouse founder. Another\nfactor is that emphasis might be taken off of other material in schools to focus on\ncomputer training. As with any major change, it runs the risk of poor implementation and\nwasted money. If fully promoted however, the results of a two year study show that\nClubhouse methods of teaching computers have been successful and will continue to be.\nThe only variant on student success was how much exposure they had to computers prior\nto the program; more knowledgeable students were more successful in making advanced\ncomputer programs.\n\nE. Fall-Back Options\n\nThe alternative would be to continue teaching computers as it is done now. In either\nscenario, the priority should be to spread the availability and use of computers. The point\nof the program is to immerse students in creative media\nsoftware so that they learn not how to play computer games for example, but to create\nthem. Only integrating some forms of creative software into a computer curriculum\nwould be beneficial, but no longer part of the MediaLab's vision.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Integrating ICT in Zambian High Schools",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/0940a941bc49e0cdc040ecb5d881b120_MITES_259S06_Befekadu.pdf",
      "content": "Ashenafi Befekadu\nInstructor: Raja Bobbili\nES.259: Information and Communication Technology in Africa\nPolicy Paper\n\nIntegrating ICT in Zambian High Schools\n\nI. Background\nZambia, a nation in Southern Africa with an area of 752 614 square kilometers and\na population of 10.3 million, is one of the developing countries in Africa which took on\nthe project of developing \"Strategic Framework for the Implementation of Education For\nAll (EFA)\" policy1. The motivation behind Education For All (EFA) policy, according\nthe document produced by the Zambian Education Ministries in May 2005, is primarily\nderived from the Universal Declaration of Human Rights (1948) which states that:\n\"everyone has the right to education.\" 2 The problem with the current educational policy,\nin the case of Zambia, is mainly due to:\n1. the lack of textbooks, equipment and laboratory infrastructure.\n2. problems in information sharing and its flow within the system.\n3. poor quality of learning, fewer classroom places and learning hours.3\nThese three problems were mentioned in the document as the main challenges the\nZambian education system is facing. In this paper, I am mainly interested in addressing\nthe role of Information and Communication Technology (ICT) in addressing some of\nthese issues. The education system in Zambia is designed as a tool to alleviate poverty\nand minimize educational disparities between rural and urban areas as well as to achieve\nincreased enrollment of girls in school. Therefore, I will also address the role of ICT in\naddressing gender disparities and achievement gap between rural and urban school\nsystems. In particular, I believe that connecting public high schools to internet is step\nforward in bringing Zambia closer to achieving its goal of improving the quality of\neducation in public schools.\n\nICT Profile\nInternet access in Zambia is provided by a number Internet Service Providers\n(ISPs) including Zamtel which provides its customers of about 5000 connection via dial-\nup. The company also provides broadband connection at a charge of $25-35 per month.4\nOther ISP providers include Coppernet and UUNET with strong financial backing from\ninternational corporations. There are a number of Internet cafes in Zambia, several in\nLusaka, Livingstone and Ndola, and also in the smaller towns. However, the cost of\nbandwidth remains very high and the speed of connection is 128 kbps in most of these\ncafes. 5\n\n1Ministries of Education, \"Strategic Framework for the Implementation of Education for all\", May 2005.\n<http://portal.unesco.org/education/en/file_download.php/93fcf7a8dc4f26a3555fc25d47736b2cEFAStraZA\nM.pdf >\n2 Ibid\n3 Ibid\n4 Esselaar et al, \"A Country ICT Survey for Zambia\", November 2002.\n5 Ibid\n\nSecondary Education in Zambia\nZambia will be facing an increased enrollment of students in high schools thus\nincreasing the demand for high schools teachers. Enrolment for high schools is projected\nto increase from 161,281 in 2008 to 578,654 in 2015.6 With an increased enrollment also\ncomes the burden of providing additional educational resources (such as teaching aids,\nmore schools, books, etc) and the need for additional high schools.\n\nIn addition, the pupil/teacher ratio for grades 1 to 7 was projected to be 52:1 by 2015 with\n17 percent of the teachers teaching double shifts; for Grade 8 to 9 pupil/teacher ratios will\nbe 35:1 by 2015 while the secondary school pupil/teacher ratio will be 28:1 by 2015. The\nZambian government thus must look at alternatives to adapt a more efficient education\nsystem to cope with increasing cost of secondary education and increasing student to\nteacher ratio.\n\nUses of Internet in High Schools\n\nThe primary goal of providing internet access to Secondary Schools is to\nintroduce innovative teaching approaches and provides teachers flexibility in developing\ntheir own teaching approaches. Having internet in high schools would also enable\nteachers to create instructional material online and access model teaching plans online.\nTable 1 illustrates how internet is used in most American Public Schools. Thus, a similar\napproach in Zambia, if successfully implemented, would greatly enhance the quality of\nthe teaching process.\n\nIn Zambian high schools, an additional benefit of incorporating ICT in schools is\nto bridge achievement gap between rural and urban high schools on national exams.\nPutting educational material on compact CDs and distributing them to rural schools,\nwhich lack the necessary resources, is also an option in the presence of computers. In\nrural areas where electricity is unavailable, the alternative is to work jointly with internet\ncafe owners in the nearby towns to make arrangement for students to use the cafe's\ninternet service.\n\n6 Ministries of Education, p.63\n\nThe current system is also believed to come short of preparing students for\nemployment opportunities. Furthermore, in today's global world, a child needs to not\nonly receive an education relevant to his/her own environment but also he/she needs to\ngain a proper skill that would enable him/her compete in the global world. Thus a\ncurriculum which integrates ICT is suited to fulfilling such goals.\n\nImplementation of the program\nIntegrating ICT into the educational system of Zambia requires financial and\nhuman resource investment. In addition, the cost of implementation of technologies and\nthe expansion of existing infrastructures, such as internet service and electricity, should\nnot be overlooked. However, countries such as Jamaica were able to overcome these\nobstacles and install computers in all of their secondary schools with access to internet7.\nConsidering the similarity of the projects, the project in Zambia can also be implemented\neffectively with proper planning and management.\n\nBecause of the cost involved and lack of human resource, the implementation\nphase of the project will require a planning. The most cost effective approach is to pick\nrepresentative high schools, from various regions of Zambia, and develop a pilot program\nto study the feasibility of the program. The first step is to prepare a workable plan which\nincludes the number of pilot programs, number of students participating, cost of the pilot\nprogram and as well as have a system in place for measuring the success or failure of the\nprogram. Once a complete proposal is adapted, the next step will be to look for funding\n\n7Wagner et al., \"Monitoring and Evaluation of ICT in Education Projects,\" 2005\n<http://www.infodev.org/files/2942_file_M_E_ICT_Education_draft_WSIS_optimized.pd\nf>\nsources which might include international donor organizations. A collaborative effort,\nbetween the body in charge of the pilot project and higher institutions such as the\nUniversity of Zambia, and other Multinational Universities/Colleges, would greatly\ncontribute to the success of the project.\nTeachers in charge of the pilot program can be trained to oversee the pilot project.\nA better option is to involve students from University of Zambia or foreign Universities\nto overlook the progress of the project. Not only will this approach introduce students to\nnew and innovative learning approach but it will also enable policy makers explore what\nis working and what is not.\n\nChallenge\n\nIn executing this project, the main problems that would quickly hinder the\nprogress or success of the project are financial constraints, lack of trained experts and\nabsence of basic infrastructure to provide such a service. If the initial phase of the project\nis successful, expanding the project to various regions and providing the schools with\nappropriate teaching material will also be a challenge. The sustainability of the project\ndepends on the long term commitment of the government as wells a continuous funding\nfor the project by either the government or donor organizations. In the long run,\nupgrading in to new computers as well as training experts who can troubleshoot problems\nwith internet connections will also be problematic in case insufficient funding.\n\nAlternatives in Case of Failure\n\nIn case the pilot project does not succeed, problems with the project should be\nwell understood. The outcome of the pilot study should not only suggest future actions\nfor policy makers but it should also speculate whether the idea itself is feasible to be\nimplemented in Zambia given the country's limited resources. If the project does not\nsucceed for lack of adequate funding, trained experts or lack of infrastructure, the\ngovernment should revise its policy primarily by encouraging the private sector to invest\nin the development of new infrastructures. Many developing nations have emphasized\ninvestment in ICT as a key policy intervention not only to improve the IT infrastructure\nbut also to fight poverty. Similar policy measures would also work if the government\nimplements and uses ICT to reduce poverty and fulfill its commitment of \"Education For\nAll\" initiative.\n\nConclusion\n\nEducation policy in Zambia currently overlooks the role of ICT in improving the\nquality of education. To meet the its commitment of achieving the \"Education For ALL\"\ninitiative, the government of Zambian should also explore the option of integrating ICT\ninto the public school system in order to foster innovative teaching approaches. Providing\nhigh schools with internet access not only improves the learning process but also enables\nthe Zambian government to overcome some of the difficulties it's facing with the current\neducation policy. In particular, ICT will improve the quality of information sharing\nbetween various stake holders and at the same time minimize the poor learning condition\ncurrently in places. ICT would serve as tool to bridge the achievement gap between urban\nand rural public schools by enhancing the communication system between the two\nregions, and by enabling a better distribution of educational resources.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "IT in Africa",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/adebdf22b5c13a8ced11140144d974ff_MITES_259S06_maltes_2.pdf",
      "content": "Ana Lorena Ramos Maltes\nES.259- IT in Africa\n\n\"We are living a tragedy in Africa now, because of the destruction of our population\ncaused by a disease we cannot cure. I think what we can do now is to strengthen and\nimprove our efforts at prevention.\" -Abdoulaye Wade, President of Senegal.1\n\n\"If she [a woman] gathers together a group of ten or twenty women and she talks to them\n- without fanfare, without drums or trumpets - and explains the problems of AIDS so that\nit sinks in, then we will make progress. And that is possible in Senegal.\"2\n-Andoulaye Wade, President of Senegal\n\nOverview\n\nSenegal is one of the forefront leaders in the prevention of AIDS in Africa.\nThough only 0.8% of its population is infected with the HIV virus, the number is\nescalating due to immigration, lack of education and cultural and religious barriers. In the\nvillage on Niomre, near the city of Louga, there is an urgent need for women's sexual\neducation. In the village, 94% of the population is Muslim and practices such as\npolygamy and wife inheritance are common. The project plans on assessing the needs of\nthese women and to find ways in which sexual education can be brought to them in a\nmanner that will not interfere with their culture or religion. The educational program will\nconsist on teaching to the women in the village how the HIV virus is transmitted, how it\nmay be prevented, the benefits of testing and the use of different types of contraceptives.\nDifferent educational tools and methods include having a leader from the village\norganizing different workshops to discuss different topics and bringing a theater group\nfrom the nearby city of Louga to perform a skit that tells of the prevention and\nseriousness of HIV.\n\nImplementation\n\nThe chief of Niomre, Serigne Thierno Lo, has expressed his concern for the\nspread of AIDS and has been open in accepting educational programs and organizations\ninto his village. He also points out that religion teaches Muslim women to be discreet\nabout their sexual lives which may cause some women to be apprehensive towards the\nprograms.\n\nThe basic framework for the educational program would be developed at the\nMassachusetts Institute of Technology in the months leading to its on-site\nimplementation. It is important to be in contact with different Non-Governmental\nOrganizations who work in the area such as the United Nations' Development Fund for\nWomen (UNIFEM), the Society of Women Against AIDS in Africa (SWAA) and\nintroduce others to this region such as Interact Worldwide which supports regional\npartners who work in the affected area. This organization not only provides educational\n\n1 http://allafrica.com/stories/200107020491.html\n\n2 http://allafrica.com/stories/200107020491.html\n\nmedia to be used in teaching but also facilitates contraceptives. Hopefully, through this\nproject Interact Worldwide will decide to bring its services to Niomre.\n\nThere should be a deep study into the Senegalese and Muslim culture in order to\ndevelop successful teaching techniques. This may include consulting professors from the\nMIT and/or Harvard community who are experts in Muslim culture and religion. Also,\nthere should be a study of the most successful contraceptives to bring to the village\nregarding price, sustainability and simple usage. There has been the introduction of the\nfemale condom to some female factory workers that according to Yassine Fall, UNIFEM\ndirector in Dakar, has shown success. The project could also include the founding of a\nWomen's Dispensary in the village, where women can turn to for support, sexual\neducation and contraceptives. This last idea could be hard to develop and potentially\nunsuccessful due to the cultural and religious barriers present in the village.\n\nThe project is an effort to create a support network for women in the Senegalese\nvillage of Niomre. This network will include different NGOs and will be complemented\nby a series of educational conferences or presentations that will include topics such as:\nMuslim women and religion, contraceptive methods, what is HIV and how is it\ntransmitted, HIV testing and, most importantly, the prevention of the spread of AIDS and\nits correlation with having a healthy sexual life.\n\nFunding\n\nThe funding could be attained from different programs and organizations\nincluding the MIT Public Service Center, possibly from the IDEAS Competition and PSC\nFellowship. The Senegalese government has shown a strong compromise in the\nprevention of AIDS and the different NGOs mentioned above could help contact the\nMinistry of Health of Senegal for the program's funding. The participation of the NGOs\nwill be crucial for this project, not only for what they can give in monetary terms, but\nalso for the support and previous knowledge that will help enhance and secure the\nperpetuity of this program.\n\nTeam\n\nThe team will need no less than 5 participants. Each member could be in charge\nof a particular area of research and/or study such as, religion and culture, the different\ncontraceptive methods, etc.\n\nTimeline\n\nThe most important part of the project that is the developing of the educational\nframework will be developed in MIT by students and their mentors. This will include the\ninput of different organizations which we contact as well as input coming from\nSenegalese programs, organization and, hopefully, the government.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nES.259 Information and Communication Technology in Africa\nSpring 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Grading Rubric for Oral Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/es-259-information-and-communication-technology-in-africa-spring-2006/mites259_s06_rubric.pdf",
      "content": "Grading Rubric for Writing: Media, Ed & Marktplc 9.05\n\nWritten assignments give students practice in analyzing course content and formulating\nwell reasoned arguments that become engaging and accessible to readers. Helping\nstudents to master such skills is the reason for CI classes. Your papers will be graded\naccording to the following criteria:\n\n- ARGUMENT: Is there a coherent thesis in the paper? Are the key questions and\nevolving argument(s) of the paper clear and understandable? Are evidence and\nexamples to support argument/ideas selected and explained well? Is a comfortable\namount of time spent on each idea? Is there any confusion, or is content engaging and\ncompelling? Is there a strong opening paragraph and a solid thoughtful conclusion?\n(45%)\n\n- EVIDENCE: How well does the essay use evidence available from class materials\n(readings, lectures, films) and other research to support the central arguments of the\npaper? Have solid evidence and examples been marshaled to support claims in the\nessay? Are there contradictory examples which could be used to eliminate doubts\nabout the writer's claims? Use of detail, story and evidence remain the best way to\ncreate engaging essays and arguments. (25%)\n\n- STYLE: How effectively does the student communicate his/her ideas, questions, and\ninsights? Are there syntax problems--awkward phrasing, lack of clarity, errors of\nnoun/verb agreement, poor word choice, illogical thinking? Has the paper been\ncarefully proofread (showing concern for detail)? Has the writer fulfilled the\nrequirements for length as well as content? (30%)"
    }
  ]
}