{
  "course_name": "International Relations Theory in the Cyber Age",
  "course_description": "This course examines cyber dynamics and processes in international relations from different theoretical perspectives. It considers alternative theoretical and empirical frameworks consistent with characteristic features of cyberspace and emergent transformations at all levels of international interaction. Theories examined include realism and neorealism, institutionalism and liberalism, constructivism, and systems theory and lateral pressure. The course also highlights relevant features and proposes customized international relations theory for the cyber age.\nStudents taking the graduate version are expected to pursue the subject in greater depth through reading and individual research.",
  "topics": [
    "Social Science",
    "Political Science",
    "International Relations",
    "Social Science",
    "Political Science",
    "International Relations"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 1 session / week, 2 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course for undergrads. Graduate students need the permission of the instructor.\n\nCourse Description\n\nThis course examines cyber dynamics and processes in international relations from different theoretical perspectives. It considers alternative theoretical and empirical frameworks consistent with characteristic features of cyberspace and emergent transformations at all levels of international interaction. Theories examined include realism and neorealism, institutionalism and liberalism, constructivism, and systems theory and lateral pressure. The course also highlights relevant features and proposes customized international relations theory for the cyber age.\n\nStudents taking the graduate version are expected to pursue the subject in greater depth through reading and individual research.\n\nCourse Requirements\n\nActive seminar participation--critical approach to materials\n\nPresentations of the arguments in the readings which allow students to select what they wish to talk about, develop slides, present these items, and get reactions\n\nMid Term essay\n\nFinal essay\n\nGraduate students can substitute a research paper for the final essay.\n\nReadings\n\nThe following books are required reading:\n\nChoucri, Nazli.\nCyberpolitics in International Relations\n. MIT Press, 2012. ISBN: 9780262517690. [Preview with\nGoogle Books\n]\n\nNye, Jr., Joseph S.\nThe Future of Power\n. PublicAffairs, 2011. ISBN: 9781610390699. [Preview with\nGoogle Books\n]\n\nAdditional readings can be found in the\nReadings\nsection.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nClass attendance and participation\n\n20%\n\nMidterm (take home)\n\n25%\n\nLocating web based resources as inputs into the class data base\n\n20%\n\nFinal (take home) or a research paper on topic of your choice with approval of instructor\n\n35%\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nPart I: Structure And Process In International Relations\n\nThe Classics--Concepts and Contexts\n\nFirst Meeting Lecture Slides (PDF - 1.3 MB)\n\nInternational Relations--Construction of Cyberspace\n\nCyberspace and the State System--New Challenges\n\nGlobalization and Emergent Dynamics\n\nPart II: Theories of International Relations\n\nPower and Security--Realism and Neo-Realism\n\nGovernance and Order--Institutionalism and Neo-Institutionalism\n\nPerceptions and Expression--Constructivism\n\nMidterm (take home) essay due\n\nGrowth and Expansion--Lateral Pressure\n\nCyberpolitics in International Relations\n\nPart III: Strategic Issues\n\nInternational Conflict and War\n\nInternational Cooperation and Global Agenda\n\nContending Authority--Principles and Practice\n\nAlternative Futures--21st Century Challenges\n\nFinal (take home) essay due",
  "files": [
    {
      "category": "Resource",
      "title": "The Distribution of Authority in Cyberspace",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/17-445-international-relations-theory-in-the-cyber-age-fall-2015/c6ad3b8ed6b09f9d46ed6212b1111692_MIT17_445F15_Essay1.pdf",
      "content": "Question 1: The Distribution of Authority in Cyberspace\n\nMIT Student\nCyberpolitics in IR\nProfessor Choucri\nDecember 10, 2015\n\nToday, 3.3 billion Internet users - about 45% of the world's population - sent 149 billion\nemails, ran 3 billion Google searches, and wrote 412 million Tweets.1 For contrast,\napproximately 1.2 billion active phone lines existed worldwide in 2014.2 Unlike other, less\npowerful forms of communication - such as radio, television, or landline telephones - the\nInternet has no clear authority or single governance structure. Yet given the importance and\nubiquity of the Internet as a tool for communication and potential harm, questions of Internet\ngovernance are crucial in the study of global politics.\nDespite the emergence of other actors, such as private corporations, non-state terrorist\ngroups, or international NGOs, international politics today is still dominated by nation-states\ndemarcated by territorial boundaries. Notably, however, the influence of states does not map\ndirectly onto the cyber domain. Instead, a plurality of actors clamor for authority, including\nstates, nonprofit institutions such as the Internet Corporation for Assigned Names and Numbers\n(ICANN), epistemic communities such as the Internet Engineering Task Force (IETF) and the\nInternet Society, multinational Internet service providers, private companies, and civil society. In\nthis diverse topography of actors, where is authority located?\nThis paper will seek to answer the question of how authority is dispersed across the\nInternet. I will utilize a layered model of the Internet, and argue that different types of authority,\ncoming from different sources, are present at each layer. I will discuss how traces of realism,\ninstitutionalism, and contructivism at the code layer of the Internet contribute to the structure of\nauthority. Finally, I will put this analysis in the context of the debate about multilateral versus\nmultistakeholder models of Internet governance, and discuss the implications for governance at\neach layer of the Internet if one or the other position prevailed. Ultimately, I argue that while\nstate governments have primary authority over the content layer of the Internet, non-state\ninstitutions such as ICANN and the World Wide Web Consortium (W3C) have authority over\nthe code layer. Authority over the physical underpinnings of the Internet is primarily in the hands\nof corporations, tightly regulated by state governments.\nClark describes the Internet as a layered construction with seven distinct levels. At the\nbase, the physical layer of the Internet comprises the copper fibers, the radio waves, the undersea\n\n1 According to Internet Live Stats, a website which gathers data on Internet users and web traffic. Internet Live\nStats has been cited by the World Wide Web Consortium and by Tim Berners Lee, and can be found at\nhttp://www.internetlivestats.com/\n2 The World Factbook 2013-14. Washington, DC: Central Intelligence Agency, 2013.\n\ncables, and all physical infrastructures needed to support the Internet. Above that, the datagram\nlayer, transport layer, and three protocol layers govern the packaging, coordination, and transport\nof data. The sixth layer comprises the language with which Internet users navigate the content of\nthe Internet, and the seventh and highest-level layer is the content of the Internet itself - the user-\ngenerated Tweets, web pages, photographs, and other information that is generated and\ndistributed on the Internet.\nIn analyzing the locations of authority in the Internet, it will be useful to abstract from\nClark's detailed depiction to Lessig's three-layered model of the Internet. Slightly less refined,\nLessig's model comprises a physical layer (corresponding to the first layer in Clark's model), a\ncontent layer (corresponding to the seventh layer in Clark's model), and a code layer, which\nsubsumes the remainder of Clark's model. Though each layer of the Internet has its own\ndistinctive features which pose unique challenges to governance, the overall governance\nstructures operating in the middle five layers are similar enough that to abstract to Lessig's\nmodel does not entail too great a loss of detail. This paper will therefore examine the dynamics\nof authority and governance at each of the three layers of the Internet.\nHowever, it is first useful to clarify the concept of authority, and in particular, to\ndistinguish between authority and power. It is also useful to describe the conditions under which\nan actor such as a government might delegate authority to an agent, ceding its own control, and\nthe potential consequences of doing so. Hall and Biersteker describe an authority as an actor\nwhich \"perform[s] the role of authorship over some important issue or domain. They claim to be,\nperform as, and are recognized as legitimate by some larger public as authors of policies, of\npractices, of rules, and of norms. They set agendas, they establish boundaries or limits for action,\nthey certify, they offer salvation, they guarantee contracts, and they provide order and security.\"3\nCrucially differentiating authority from power is the \"legitimacy of claims of authority,\" which\nderives from consent.4\nCowey and Mueller argue that governments are likely to delegate to nongovernmental\nauthorities in order to \"reap efficiency gains\" and to \"create gains from specialization and expert\n\n3 Hall, Bruce and Thomas Biersteker \"The Emergence of Private Authority in Global Governance,\" Ch. 1.\nThe Emergence of Private Authority in Global Governance. Cambridge University Press. 2002. Page 4.\n4 Ibid, p. 5.\n\nknowledge.\"5 Cowey and Mueller also describe two distinct processes by which a principal may\ncome to delegate to an agent. First, a principal may delegate to an agent by a \"formal act of\ndeliberative delegation.\" However, it may also be the case that a principal becomes \"interested in\nan area where there is a preexisting \"agent\" who emerged for other reasons.\"6 In this case, the\nprincipal, such as a state government, could accept the existing agent as an authority, could try to\nmodify the agent's scope of authority, or could try to replace the agent altogether.\nIn the context of the Internet, these claims are consistent with Cerny's argument that a\ngrowing gap between the capacity of the state to provide and the demands for public goods will\nresult in an erosion of state power and a curtailment of state activities, since the sheer volume of\ndemand for Internet services overwhelms the capacity of a single state.7 But to who could the\nstate delegate authority and what consequences might delegation entail? Haas argues that under\nconditions of uncertainty - when the state seeks to \"create gains from...expert knowledge\" -\nepistemic communities may gain authority as legitimate international actors.8 Epistemic\ncommunities may provide information, or take part in setting and enforcing policy. Haas argues\nthat epistemic communities may \"bound the range of collective choice\" by excluding options\nfrom policy debate, or help identify state interests. However, Cowey and Mueller describe\nseveral strategies by which states might reduce the autonomy of such agents, including through\n\"stacking the deck\" in the agency's personnel system or in \"outside advisory processes\" to\nensure that people \"favorable to the goals of the principals have a disproportionate role.\"9\nThus, even before analyzing the dynamics of Internet authority, several predictions can\nbe made. First, non-state organizations may have more authority in areas that require technical\nknowledge or expertise. Second, even in cases where non-state actors appear to have authority,\nstate governments may have taken steps to curtail their autonomy. Finally, authority may be most\ncontested in areas where pre-existing 'agents' accrued authority prior to the involvement of the\nstate.\n\n5 Cowey, Peter and Milton Mueller. \"Delegation, Networks and Internet Governance\" in Kahler,\nNetworked Politics: Agency, Power, and Governance. Cornell University Press. 2009. Pages 174-175.\n6 Ibid, p. 176.\n7 Cerny, Philip G. 1995. \"Globalization and the Changing Logic of Collective Action.\" International\nOrganization 49 (4): 595-625.\n8 Haas, Peter M. 1989. The Fourth Image Reversed: Epistemic Communities and Knowledge Based Bargaining as a\nResponse to Uncertainty.\" prepared for delivery at the 1989 Annual Meeting of the American Political Science\nAssociation, Atlanta, Georgia. August 30-September 3, 1989.\n9 Cowey and Mueller, p. 176.\n\nAuthority in the Content Layer\n\nThe content layer of the Internet comprises the content of webpages, Tweets, blog posts,\nvideos, photographs, and all user-generated material. Policy objectives of authority in the content\nlayer include \"controlling illegal and harmful content, consumer protection, data protection, and\ncontrol of spam.\"10 These objectives mainly fall into the domain of authority of the state -\ncontrolling crime and protecting citizens from criminal activity is a well-established prerogative\nof state governments, and the legitimate authority of the state to protect its citizens in the \"real\nworld\" extends into the cyber domain as well. In addition, the instruments available for\nachieving the policy objectives, combined with the prevailing standards and enforcement\nmechanisms, create an environment where state governments exercise most authority, though\ntheir jurisdiction is fragmented across territories.\nTo protect data and consumer information, and to control spam and illegal content,\norganizations can implement certification systems, encryption schemes, and programs to filter\nunwanted content.11 While the creation of these programs may be delegated to private\nauthorities, state governments are the primary standard setters when it comes to Internet content.\nTo demonstrate this, consider the following legislation passed by U.S. Congress: the\nCommunications Decency Act (1997), the No Electronic Theft Act (1997), the Children's Online\nPrivacy Protection Act (1999), the Digital Millennium Copyright Act (1998), the Anti-\nCybersquatting Consumer Protection Act (200), the Electronic Communications Privacy Act\n(2000), and the USA Patriot Act (2001). These policies set the standards for appropriate Internet\ncontent, protecting users from harmful content, from malicious attacks, and enforcing intellectual\nproperty law. Since these standards are encoded in law, enforcement also falls to the state.\n\nAuthority in the Code Layer\n\nThe code layer of the Internet is the area in which the state had the least pre-existing\nlegitimacy. In comparison, organizations such as ICANN, W3C, and IETF had both the technical\nknowledge and the capacity to establish themselves as legitimate authorities. In some cases, the\n\n10 Caral, J. \"Lessons from ICANN: is self-regulation of the Internet fundamentally flawed?' International\nJournal of Law and Information Technology, Volume 12 (1) 1-31. Page 12.\n11 Ibid, p. 13.\n\nstate was content to delegate authority to these institutions. However, where the interests of the\nstate conflict with the established interests of these non-state institutions, contestation over\nauthority comes to a head.\n\nThe IETF, W3C, and ICANN are the primary standard-setters for the code layer of the\nInternet, with the IETF developing communications standards, W3C developing document\nstandards for the World Wide Web to ensure that text, graphics, audio, and video are accessible\nand displayable, and ICANN developing standards for the Internet's domain name and\naddressing system.12 Delegation to these institutions is predicted by Haas's theory of epistemic\ncommunities, and indeed, the U.S. government did recognize its own inability to act as a\nstandard-setter for the Internet. The Framework for Global Electronic Commerce, developed by\nthe Clinton administration in 1997, delegated standard-setting authority away from the\ngovernment, establishing that:\n\nThe marketplace, not governments, should determine technical standards and other\nmechanism for interoperability on the Internet. Technology is moving rapidly and\ngovernments' attempts to establish technical standards to govern the Internet would only\nrisk inhibiting technological innovation.13\n\nCaral argues that because of the technical expertise required to effectively govern the\ncode layer, and because non-compliance with set standards results in non-inclusion in the\nInternet, that government enforcement is not necessary and self-regulation among the three\nprincipal non-state actors is the source of authority in the code layer. However, this depiction\nbelies the contestation between global, decentralized governance and the interests of the nation-\nstate system.\nIn particular, contentions have arisen around delegation of authority over critical Internet\nresources, defined by Mueller as \"the governance of Internet standards, domain names, and IP\naddresses\" as well as \"the interconnection and routing arrangements among Internet service\nproviders.\"14 These critical Internet resources are the choke points of the Internet - among the\n\n12 Caral, p. 9.\n13 President William J. Clinton & Vice President Albert Gore, Jr., A Framework for Global Electronic Commerce. July\n1, 1997.\n14 Mueller, Milton L. Networks and States, 2010. Cambridge, MA.: MIT Press, Chapter 8.\n\n\"few points of global leverage,\" according to Mueller, and the points of the networks that states\n\"had almost no control over.\"15 However, as predicted previously, the United States government\nconstructed ICANN in a way that would give it a disproportionate influence - it \"stacked the\ndeck\" in favor of its priorities.16 In particular, the U.S. government \"disproportionately\nempowered the Internet technical community and intellectual property owners.\" In addition, it\n\"retain[ed] policy authority over the root zone file,\" requiring ICANN to submit any proposed\nchanges to the Department of Commerce for approval, and any approved changes are\nimplemented by a U.S. corporation. Thus, non-state actors are the primary authorities in the code\nlayer of the Internet, but state governments in general, and the U.S. government in particular, still\nexert low levels of control.\nThe code layer of the Internet is relevant to the content layer, since the architecture of the\ncode layer determines how, when, and to whom content is accessible. It is in the code layer that\nideals from constructivism, institutionalism, or realism would have the most impact on how\npeople use the Internet. The architecture of the Internet was built to ensure free and rapid\ncommunication. It was intentionally designed to allow the spread of ideas, and innovation within\nthe network, close to ideals of constructivism, which views the spread of ideas as a causal agent\nfor change. One effect of the Internet, to promote new forms of collaboration and overcome\nproblems of collective action, is identified with the institutionalist mode of thought. Absent from\nthe design of the Internet were concerns for security, jurisdiction, and identity of individuals -\nkey realist concerns.\nIt is relevant that the state, which has authority in the content layer, has diminished\nauthority in the layer of the Internet where design choices are made that affect the ability of the\nstate to regulate its borders, provide for its security, and identify its citizens. Presumably, had the\nstate more influence in the code layer of the Internet, realist concerns about security and\njurisdiction would be more strongly manifest in the underlying architecture of the Internet.\n\nAuthority in the Physical Layer\n\n15Ibid, p. 216.\n16 Cowey and Mueller, p. 187.\n\nThere is precedent for the state to have authority in matters of national infrastructure-\nbuilding. The state has a history in overseeing the development by private companies of\nrailroads, telephone lines, and telecommunications networks, and this precedent creates the\nlegitimate authority for the state to regulate the infrastructure of the Internet.\nHowever, the private companies which build the infrastructure for the Internet differ from\nhistorical examples in that they are multinational, and their operations cross through multiple\njurisdictions. Nevertheless, there are mechanisms for states to regulate private companies - even\nones which cross jurisdictions. Caral looks to the example of international banking to see how\ngovernments have imposed order on entities which cross territorial borders, and suggests that the\nlevel of co-operation among public and privates regulators be increased to deal with ambiguities\narising from unclear jurisdiction.\nThus, at the physical layer of the Internet, private companies have a large role in building\ninfrastructure, but state governments have the authority to regulate and oversee these companies.\n\nA Multilateral Model of Governance\n\nGiven this structure of authority distribution in the Internet, a multistakeholder versus\nmultilateral model of Internet governance would most likely be manifest at the code layer. A\nmultilateral model of governance, in which states are the primary authorities, might see a\nfundamental shift in the organization of the DNS system and root zone files. The current\narrangement represents a multistakeholder model, and is what allows for relatively free and open\ncommunication. States, which are generally more concerned with issues of security and\njurisdiction, might arrange the domain name system to support a number of separate networks,\ncorresponding to each territorial state, connected at a few, tightly controlled, bottleneck points.\nThis would clarify the issue of jurisdiction, and give states a monopoly over the ability to control\naccess to their network by non-citizens.\n\nConclusion\n\nUltimately, authority it distributed in different ways at different levels of the Internet. At\nthe content layer and physical layer, the state can rely on its legitimate power to protect its\n\ncitizens and control crime, and regulate corporations, respectively. However, at the code layer,\nwhere the state has neither the technical expertise nor the preexisting mandate, non-state\nnonprofit organizations have accrued authority. Nevertheless, the state has tried to reassert its\nauthority over these institutions, and the United States government in particular retains some key\nelements of control over crucial Internet resources. The distribution of authority in the Internet\nmay shape key functionalities of the Internet itself, and if it were to change, could be reflected in\nchanges to the underlying design of the Internet which would alter how it could be used. Yet in\nsome sense, checks and balances of power exist between authorities at different layers of the\nInternet, since each layer depends on all others to operate to its full potential.\n\nWorks Cited\n\nCaral, J. \"Lessons from ICANN: is self-regulation of the Internet fundamentally flawed?'\nInternational Journal of Law and Information Technology, Volume 12 (1) 1-31. Page 12.\n\nCerny, Philip G. 1995. \"Globalization and the Changing Logic of Collective Action.\"\nInternational Organization 49 (4): 595-625.\n\nPresident William J. Clinton & Vice President Albert Gore, Jr., A Framework for Global\nElectronic Commerce. July 1, 1997.\n\nCowey, Peter and Milton Mueller. \"Delegation, Networks and Internet Governance\" in Kahler,\nNetworked Politics: Agency, Power, and Governance. Cornell University Press. 2009.\nPages 174-175.\n\nHaas, Peter M. 1989. The Fourth Image Reversed: Epistemic Communities and Knowledge\nBased Bargaining as a Response to Uncertainty.\" prepared for delivery at the 1989\nAnnual Meeting of the American Political Science Association, Atlanta, Georgia. August\n30-September 3, 1989.\n\nHall, Bruce and Thomas Biersteker \"The Emergence of Private Authority in Global\nGovernance,\" Ch. 1. The Emergence of Private Authority in Global Governance.\nCambridge University Press. 2002. Page 4.\n\nMueller, Milton L. Networks and States, 2010. Cambridge, MA.: MIT Press, Chapter 8.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n17.445 / 17.446 International Relations Theory in the Cyber Age\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}