{
  "course_name": "International Environmental Negotiation",
  "course_description": "This seminar will explore the difficulties of getting agreement on global definitions of sustainability; in particularly building international support for efforts to combat climate change created by greenhouse gas emissions as well as other international resource management efforts. We will focus on possible changes in the way global environmental agreements are formulated and implemented, especially on ways of shifting from the current “pollution control” approach to combating climate change to a more comprehensive strategy for taking advantage of sustainable development opportunities.",
  "topics": [
    "Engineering",
    "Environmental Engineering",
    "Environmental Management",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Environmental Policy",
    "Urban Studies",
    "Engineering",
    "Environmental Engineering",
    "Environmental Management",
    "Science",
    "Earth Science",
    "Sustainability",
    "Social Science",
    "Political Science",
    "International Relations",
    "Public Administration",
    "Environmental Policy",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis class is jointly presented by the MIT Department of Urban Studies and Planning (DUSP), the\nFletcher School of Diplomacy\nat Tufts University, and the\nProgram on Negotiation\nat Harvard Law School.\n\nThis seminar will explore the difficulties of getting agreement on global definitions of sustainability; in particular, building international support for efforts to combat climate change created by greenhouse gas emissions, as well as other international resource management efforts.\n\nAt their core, disagreements of this kind must be addressed through multilateral negotiations. This course will focus on possible changes in the way global environmental agreements are formulated and implemented, especially on ways of shifting from the current \"pollution control\" approach to combating climate change to a more comprehensive strategy for taking advantage of sustainable development opportunities. The discussions will focus, in particular, on ways of shifting the global dialogue from greenhouse gas emission reduction to green technology innovation aimed at spurring economic development and enhancing fairness in the global economic system.\n\nFormat\n\nThe class will begin with a short review of international negotiation theory. That will be followed by a section on possible strategies for supporting a shift away from the \"pollution control model\" of reducing the risks associated with climate change to a \"sustainable development and global technology sharing model.\" The last third of the class will be devoted to student presentations of prescriptive research papers. Each student will be expected to prepare and present specific ideas for transforming and enhancing multilateral environmental negotiations. Enrollment will be limited to 25. DUSP and Fletcher students will be given priority.\n\nGrading\n\nGrading for this class will be based on the following assignments:\n\nACTIVITIES\n\nPOINTS\n\n3 response papers @ 10 points each\n\n30 points\n\nFeedback essay on the Chlorine game\n\n15 points\n\nShort statement evaluating the Copenhagen negotiations\n\n10 points\n\nOutline of the final paper\n\n10 points\n\nSummary presentation of the final paper\n\n15 points\n\nFinal paper\n\n35 points\n\nMaximum possible = 115 points:\n\n90 to 115 = A\n\n80 to 89 = B\n\n70 to 79 = C\n\nBelow 70 = F",
  "files": []
}