{
  "course_name": "Intermediate Macroeconomic Theory",
  "course_description": "This course is a survey of modern macroeconomics at a fairly advanced level. Topics include neoclassical and new& growth theory, consumption and saving behavior, investment, and unemployment. It also includes use of the dynamic programming techniques. Assignments include problem sets and written discussions of macroeconomic events. This course is recommended for students planning to apply to graduate school in economics.",
  "topics": [
    "Engineering",
    "Systems Engineering",
    "Systems Optimization",
    "Social Science",
    "Economics",
    "Macroeconomics",
    "Engineering",
    "Systems Engineering",
    "Systems Optimization",
    "Social Science",
    "Economics",
    "Macroeconomics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 Sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThis course is a communications intensive subject, and there are two papers required. These will count for total of 35% of the grade. The first paper will be an essay of 5 pages. It should draw on the tools of macroeconomics (including models, equations, and graphs) you acquired in 14.02. The topic will be based on current events. The first paper will be worth 10% of the final grade. The deadline is by lecture no. 3. The second paper will be an essay of about 15 pages. The topic is described later in the course outline. A rough draft or an outline of the second paper is due by lecture no. 8. Credit will be given for both the outline (10% of the final grade) and the paper (15% of the final grade). The final version of the second paper is due by lecture no. 9. More details about the paper can be found at the end of the syllabus. Problem sets will count for 20% of the final grade. There will also be a midterm and final examination. The midterm will count for 15% of the grade and the final for 30% of the grade.\n\nThe text for the course is David Romer,\nAdvanced Macroeconomics\n, Second Edition (New York: McGraw Hill, 2001). The detailed course outline lists other readings, which will include journal articles and selections from other books. A few other resources for the paper are listed at the end of the syllabus.\n\nOutline of the Course\n\nNeoclassical Growth Theory\n\nRomer (2001), Chapter 1.\n\nSolow, Robert M. \"Technical Change and the Aggregated Production Function.\"\nReview of Economics and Statistics\n39 (1957): 312-320.\n\nThe \"Solow Model\" with Human Capital\n\nMankiw, N. Gregory, David Romer, and David N. Weil. \"A Contribution to the Empirics of Economic Growth.\"\nQuarterly Journal of Economics\n107 (May 1992): 407-437.\n\nRomer (2001), Chapters 3.8-3.9.\n\nKnowledge Accumulation and Growth\n\nRomer, Paul M. 1990. \"Endogenous Technological Change.\"\nJournal of Political Economy\n98 (October, Part 2): S71-S102.\n\nRomer (2001), Chapters 3.2-3.6.\n\nDynamic Optimization\n\nDixit, Avinish.\nOptimization in Economic Theory.\nOxford: University Press, 1990. (Chapter on dynamic optimization and the maximum principle).\n\nDorfman, Robert. \"An Economic Interpretation of Optimal Control Theory.\"\nAmerican Economic Review\n(December 1969): 817-31.\n\nThe Ramsey Problem\n\nBlanchard, Olivier J., and Stanley Fischer.\nLectures on Macroeconomics\n. MIT Press, 1989, Chapter 2.1-2.2.\n\nRamsey, F. P. \"A Mathematical Theory of Saving.\"\nEconomic Journal\n38 (December 1928): 543-559.\n\nDebt and Deficits\n\nBarro, Robert J. \"Are Government Bonds Net Wealth?\"\nJournal of Political Economy\n82 (November/December 1974): 1095-1117.\n\nBlanchard, Olivier J., and Stanley Fischer.\nLectures on Macroeconomics\n. MIT Press, 1989, Chapter 2.3.\n\nBusiness Fixed Investment\n\nChirinko, Robert S., and Huntley Schaller. \"Business Fixed Investment and 'Bubbles': The Japanese Case.\"\nThe American Economic Review\n91, 3 (2001): 663-680.\n\nJorgenson, Dale, and Robert Hall. \"Tax Policy and Investment Behavior.\"\nAmerican Economic Review\n(June 1967).\n\nSummers, Lawrence. \"Taxation and Corporate Investment: A q-Theory Approach.\"\nBrookings Papers on Economic Activity\n(1981).\n\nInventory Investment\n\nBlinder, Alan, and Louis J. Maccini. \"Taking Stock: A Critical Assessment of Recent Research on Inventories.\"\nA Journal of Economic Perspectives\n, 5 (1991): 73-96.\n\nMaccini, Louis J., Bartholomew Moore, and Huntley Schaller. \"\nThe Interest Rate, Learning, and Inventory Investment\n.\"\nMIT Working Paper\n(2003): 03-04.\n\nRamey, Valerie A., and Kenneth D. West. \"Inventories.\" Chap. 13 in\nHandbook of Macroeconomics\n. Vol. 1B. Edited by John B. Taylor, Micheal Woodford, and Elsevier. 1999.\n\nSavings and Investment in a Small, Open Economy\n\nBlanchard, Olivier. \"Debt and the Current Account Deficit in Brazil.\" In\nFinancial Policies and the World Capital Market: The Problem of Latin American Countries\n. Edited by Pedro Aspe Armella et al. University of Chicago Press, 1983.\n\nFischer, Stanley, and Jacob Frankel. \"Investment, the Two-Sector Model, and Trade In Debt and Capital Goods.\"\nJournal of International Economics\n2 (August 1972): 211-233.\n\nSvensson, Lars E.O. \"Oil Prices, Welfare, and the Trade Balance.\"\nQuarterly Journal of Economics\n99, 4 (November 1984): 649-672.\n\nReal Business Cycle Models\n\nChang, Yongsung, Joao Gomes, and Frank Schorfheide. \"Learning by Doing as a Propagation Mechanism.\"\nAmerican Economic Review\n92, 5 (2002): 1498-1521.\n\nRomer (2001), Chapter 4.\n\nThe First Paper for 14.06\n\nThis paper should be a paper that uses the tools of 14.02 to analyze a current public policy issue. It should be about 5 pages long, double-spaced (on numbered pages), with a bibliography of works consulted. It should demonstrate an understanding of concepts and models from 14.02 and an ability to apply these to an issue in the real world. Knowledge of the models should be demonstrated by a use of written analysis closely based on a model, graphs, and/or equations. The topic of the paper is: why did Japan's economy slump in the early 1990s and why is Japan in a recession today? (If you wish to write on a different topic, you must receive written permission from your TA.)\n\nThe Second Paper for 14.06\n\nThis paper should be a research paper that is about 15 pages long, double-spaced (on numbered pages), with a bibliography of works consulted. It should demonstrate both your understanding of the subject and your ability to write in English. An outline (or, even better, a rough draft) is due by lecture no. 8. The outline also will be the basis on which you can get feedback from a TA for the final version. Credit will be given for both the outline (10% of the final grade) and the paper (15% of the final grade).\n\nYou should bring your outline with you when you discuss your paper with a TA. A first draft of the paper also should be written soon after lecture no. 8, if a second draft is to be turned in by lecture no. 9. Late papers will be penalized on a steep sliding scale that makes it worth your while to submit the paper on time rather than trying to wait a week to improve it.\n\nThe paper should be a comparison of economic conditions in two countries. One country could be the country you live in, or from which your parents came, or with which you have other strong attachments. The other country should be chosen to provide a good contrast with this one. Feel free to discuss the choice of country with your instructors. You can describe and analyze economic growth in the two countries in the last half of the 20th century. The aim of the paper should be to use the theories learned in 14.06 to explain the qualitative and quantitative performance of the two countries. Comparing and contrasting two countries should provide enough movements of interest for our theories to explain.\n\nLike any good paper, this one should have a beginning, a middle, and an end. The beginning should state clearly the topic of the paper and what you are planning to do. It should be rewritten after the rest of the paper is finished to make sure it fits the paper as written and presents a good case for someone to read the paper. In particular, the beginning should explain what theories you are employing in your analysis. The middle of the paper should contain your description of qualitative and quantitative performance of the two countries and your analysis of them. This part can contain diagrams and data as needed to show what you are explaining or how you are explaining it. It is the longest and most substantial part of the paper. The end of the paper should summarize your argument, state your conclusions, and draw any implications of your analysis that you think warranted.\n\nPlagiarism is a major problem when writing research papers under time pressure. You should avoid plagiarism at all costs. If you are in doubt about whether you are over the line of acceptable behavior, you are too close to the edge. Omit the questionable passage and draw back from the edge. Provide full citations for all sources you consult in your work. Feel free to quote from them, but indicate clearly when you are quoting.\n\nThe following two books may be useful in addition to the material on the syllabus.\n\nChang, Ha-Joon.\nKicking Away the Ladder-Development Strategy in Historical Perspective\n. London: Anthem Press, 2002.\n\nEasterly, William.\nThe Elusive Quest for Growth: Economists' Adventures and Misadventures in the Tropics\n. Cambridge, MA: MIT Press, 2001.\n\nData for a wide variety of countries are available from the Penn World Tables, available on the web at\nhttp://datacentre2.chass.utoronto.ca/pwt/\n.\n\nPaper Standards for 14.05\n\nHere are ten questions to pose of each paper. The answers can be scored on, say, a five-point scale. The addition of these scores will yield an overall score on a base of 50. If you prefer, a narrower or wider score could be used for each question; the aim is to record information without forcing paper graders into meaningless discriminations. My hope is that almost all papers will score high in the first five questions; the discrimination between papers will come in questions 6 through 10.\n\nDoes the paper look like a proper paper (Title, 20 pp., bibliography, etc.)?\n\nIs it in English (as opposed to literal translation of foreign phrases)?\n\nDoes the paper have a beginning, middle and an end?\n\nDoes the paper use the Solow model reasonably (not necessarily totally correctly)?\n\nDoes the paper use other growth theory reasonably (not necessarily totally correctly)?\n\nAre there relevant quantitative data in the paper?\n\nIs there a clear comparison between two countries?\n\nDo the details in the paper advance the argument (as opposed to filling space)?\n\nDoes the argument flow and/or cumulate as the paper continues?\n\nIs the paper persuasive?",
  "files": [
    {
      "category": "Exam",
      "title": "Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-06-intermediate-macroeconomic-theory-spring-2003/205558dd90003e4a5e644493d6737101_final.pdf",
      "content": "14.06 Macroeconomics\nSpring 2003\nFinal Exam\nInstructions: You have 3 hours to complete the exam. Please be concise and write legibly.\nThere are two parts, each worth 50 points. Answer all questions in both parts, using a\nseparate bluebook for each part.\nPart A (True, false or uncertain)\nSay whether the following statements are true, false or uncertain. Justify your answer in a\ncouple of paragraphs (10 points per statement).\n1. Because more capital allows more output to be produced, it is always better for a\ncountry to have more capital stock.\n2. A market economy will generate the optimal growth rate.\n3. Critics of the Bush Administration's tax cut are wrong when they say that increasing\nthe budget deficit will reduce national saving.\n4. If the federal government introduced an investment tax credit (a policy that effectively\nreduces the price of capital goods) immediately and kept it in place until the end of\nthe year, the stock market would tend to rise between now and the end of the year,and\nthere would be a long-run increase in productive capacity.\n5. In a small, open economy like Venezuela, a temporary negative shock (such as a\ntemporary drop in the price of oil) will have a bigger effect on consumption and\nlong-run interest payments to foreigners than a permanent shock.\nPart B (Real Business Cycles)\nSuppose there are many firms in the economy, all with the following production function:\nYt = Kt\nα(AtLt)β\nwhere Yt is output, Kt is physical capital stock, Lt is employment, and α and β are pa\nrameters, with α + β = 1. At represents the state of technology and follows a stochastic\nprocess. There is only one asset in the economy, physical capital. Physical capital is owned\nby households and rented to firms. It depreciates at rate δ . Throughout the problem,\nassume that this is a closed economy with no government sector (for simplicity).\n1. Set up the typical firm's problem, find the first-order conditions, and provide an\neconomic interpretation. (10 points)\n\nFor simplicity, suppose households live forever, have a rate of time preference of ρ , and\nhave the following instantaneous utility function:\nu(ct, 1 - lt) = ln ct + b ln(1 - lt)\nwhere ct is the household's consumption, lt is the household's labor supply, and b is a\nparameter, b > 0.\n2. Set up the typical household's intertemporal optimization problem including,\n(a) The household's flow budget constraint (linking labor income wtlt, capital in-\ncome rtkt, consumption ct, today's capital kt and tomorrow's capital kt+1).\n(3 points)\n(b) Provide a derivation of the intratemporal first-order condition relating contem\nporaneous consumption and labor supply. Give an economic interpretation.\n(3 points)\n(c) Provide a derivation of the intertemporal first-order condition linking current\nconsumption and consumption in the next period, i.e. the Euler equation (re-\nmember that there is uncertainty). Give an economic interpretation. (4 points)\n3. Find the equations that describe labor supply and demand. For simplicity, you may\nwork through the problem as if there were a single representative firm and a single\nrepresentative household. (5 points)\n4. Suppose that shocks to A are positively serially correlated. Use a combination of the\nfirm's and household's optimality conditions and economic intuition to explain the\neffects on output, labor supply and demand, the wage rate, employment, the interest\nrate, consumption, savings, and the physical capital stock of a one-time shock that\nincreases A. Where possible, explain the effect both in the initial period and later.\n(15 points)\n5. (a) How could you calibrate α and β? What conditions would be required for this\ncalibration to be valid? (5 points)\n(b) Suppose α + β > 1. Would the calibration you described in (a) still be valid?\nIf α + β > 1, how would this affect the interpretation of Solow residuals as\ntechnology shocks? (5 points)"
    },
    {
      "category": "Exam",
      "title": "Final Exam Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-06-intermediate-macroeconomic-theory-spring-2003/07673f1a9754b9cd7b727d4fb97b66d9_final_solutions.pdf",
      "content": "14.06 Macroeconomics\nSpring 2003\nFinal Exam Solutions\nPart A (True, false or uncertain)\n1. Because more capital allows more output to be produced, it is always better for a coun-\ntry to have more capital stock.\nFalse. A per capita capital stock above the golden rule level is so costly to maintain\ndue to depreciation and population growth that reducing the capital stock would ac-\ntually make it possible to increase consumption in all future periods. The golden rule\nlevel is associated with the steady state that maximizes steady-state consumption.\nRemember that agents in the economy want to maximize their (discounted) utility\nwhich depends on consumption, not on maximizing the capital stock.\n2. A market economy will generate the optimal growth rate.\nUncertain. In many models of endogenous growth, firms do not take into account\nhow their accumulation of capital contributes to the accumulation of knowledge. Due\nto this externality the growth rate is below its socially optimal level. Recall that\nwe found that the social marginal product of capital exceeded that private marginal\nproduct of capital in these models. However in cases of perfect competition, constant\nreturns to scale and no market imperfections and externalities, then the decentral\nized (market) optimum will be identical to the centralized (social planner) optimum.\nThese are the cases we saw in class for the Ramsey model and its extensions to\ninvestment in an open economy.\n3. Critics of the Bush Administration's tax cut are wrong when they say that increasing\nthe budget deficit will reduce national savings.\nUncertain. If Ricardian equivalence holds, then households will realize that taxes will\nhave to be increased in the future and thus they will not change their consumption\npath and will simply save the tax cut. Recall that Ricardian equivalence is if,\nfor example, the government cuts taxes without changing its path for government\nspending then this will have no effect on consumption because the present discounted\nvalue of taxation has not changed if government spending has not. National savings\n(equal to sum of public and private savings) would be unaffected by the tax cut. But\nif households are liquidity constrained (or if there are other imperfections that were\nnot discussed in class such as finite horizons, myopia etc), they will spend part of the\ntax cut, so national savings will fall.\n\n(If your answer was along the lines above, that was sufficient for full credit on this\nquestion but here are some additional implications... The above discussion abstracted\nfrom investment decisions, but now suppose that the tax cut implies an increase in\nafter tax income for firms. In the q-theory, this implies that steady state capital\nincreases and along the transition investment is positive. Net output, (1 - τ )f (k) -\ni(1 + T (i/k)), may either increase or decrease initially depending on whether the\nincrease in output is larger or smaller than the increase in investment. In the long\nrun, it increases. Consumption is determined by a constant share (the rate of time\npreference) of the PDV of net output, so it increases relative to before the tax cut (to\nthe level at which the sum of the area between it and net output over time is equal\nto zero). If net output is initially below the increase in consumption, then consumers\nwill be borrowing in anticipation of higher net output later. Private savings are equal\nto (1 - τ )f (k)- PDV net output, and may also fall initially, so national savings will\nfall initially. But in general there is no simple relation because private savings could\nincrease initially and the effect on national savings would be ambiguous.)\n4. If the federal government introduced an investment tax credit (a policy that effectively\nreduces the price of capital goods) immediately and kept it in place until the end of\nthe year, the stock market would tend to rise between now and the end of the year,\nand there would be a long run increase in productive capacity.\nFalse. This can be analyzed in a q-theory approach, where q approximates the stock\nmarket. The effect on the stock market at impact is ambiguous, but what is unam\nbiguous is that we are still above the steady state associated with the investment\ntax credit. So while the investment tax credit is in place the stock market will be\nfalling over time as more and more capital is installed. The intuition is that because\ninvestment increases initially, the industry's profits (aside from the tax credit) will\nbe lower and thus the existing capital is less valuable. At the end of the year the tax\ncredit is removed and the economy will gradually return to its old steady state, so\nthere is no long-run increase in productive capacity.\n(The specifics of what is happening is discussed in the Summers paper, Figure 3.\nSummers considers a permanent increase in the investment tax credit but the logic\nextends to the case of a temporary increase. If there is an investment tax credit,\nthen in the(q, k) space, k = 0 shifts down to the new steady state value of cost of\n∗\ninvestment q = 1 - φ (where φ is the tax credit per unit of investment). But if the\ncapital stock enters the adjustment cost function, T (i/k), then the q = 0 curve will\nshift to the right. The initial impact on q could either be an increase or a decrease\ndepending on the saddle paths. In Summers, he draws a particular saddle path so\nthat the initial impact is an increase but he notes that if the saddle paths were flatter,\nthe intial effect could be a fall. In contrast, as in Romer chapter 8, if adjustment\n\ncosts only depend on investment, T (i), then the q = 0 curve does not shift and\nthere is an unambiguous fall in q at time of announcement of tax credit. However,\n∗\nwhether initial q rises or falls, it will still be above new q and will therefore fall in\nthe transition. But then because it is temporary, will return to old equilibrium and\nthe stock market will increase along the transition.)\n5. In a small, open economy like Venezuela, a temporary negative shock (such as a tem-\nporary drop in the price of oil) will have a bigger effect on consumption and long-run\ninterest payments to foreigners than a permanent shock.\nFalse. A temporary shock reduces wealth less than a permanent shock, so consump\ntion will fall less (remember PDV of consumption equals PDV of wealth). However,\nin response to a temporary shock the economy will borrow to smooth consumption,\nso long run interest payments to foreigners will be higher. In response to a permanent\nshock there is no point in borrowing, so long-run interest payments do not change.\nSo the statement is correct with respect to long-run interest payments but not wrt\nconsumption.\n\nPart B\n1. Because β = (1 - α), the firm exhibits constant returns to scale. The firm chooses\nfactor inputs Kt and Lt to maximize profits at each date t\nKt\nα(AtLt)β - wtLt - (rt + δ)Kt\nwhere δ is the rate of depreciation. The firm increases its demand for a factor until\nthe marginal product equals the factor price, which yields the first order conditions\nαKt\nα-1(AtLt)β = rt + δ,\nβKt\nαAβ\nt Lβ\nt\n-1 = wt.\n2. The household maximizes expected utility\n( inf\nX\nt=0\nμ\n1 + ρ\n¶t\nu(ct, 1 - lt)\n)\nsubject to its flow budget constraint.\n(a) The household's flow budget constraint will be:\nkt+1 = kt + wtlt + rtkt - ct.\nb\n(b) If the household works one more unit today, the associated disutility is 1-lt .\nConsuming the additional labor income generates utility wt . Along an optimal\nct\npath this variation cannot change utility, so we get the intratemporal optimality\ncondition\nb\nwt\n=\n.\n1 - lt\nct\n(c) If the household reduces consumption today by one unit, the loss in utility is\n1 . Investing the proceeds in capital and consumption them tomorrow gives\nct\nexpected discounted utility\n· 1 + rt+1 1\nEt\n1 + ρ ct+1\n\n.\nAlong an optimal path this variation cannot change utility, so we get the Euler\ncondition\n·\n1 + rt+1 1\n= Et\nct\n1 + ρ ct+1\n\n.\n\n3. Labor demand is given by firms' optimization wrt labor:\nA\n! 1\n1-β\nLd =\nβKt\nαAβ\nt\nt\nwt\nwhile labor supply is given by households' optimization (from 2b):\nbCt\nLs = 1 -\n.\nt\nwt\n4. The following discussion is valid for the baseline parameter values in section 4.7 of\nRomer (2001). According to these baseline parameters the shock to A will eventually\ndie out as ρA < 1.\nOutput will increase on impact and then gradually return to normal. The initial\nincrease is partly due to the direct effect of higher productivity and partly due\nto an increase in employment (the initial capital stock is given). Over time both\nemployment and productivity decline, which tends to reduce output. The capital\nstock will grow temporarily, but not enough to offset the two other forces, so\nover time output will fall.\nLabor Supply Due to the wealth effect consumption will be higher than normal\nduring the transition but gradually return to normal. From the labor supply\nequation we see that the labor supply schedule will shift to the left on impact\nand gradually return to its initial position. (wage on y-axis and labor on x-axis)\nLabor Demand On impact the labor demand schedule shifts to the right due to\nhigher productivity. The temporary increase in the capital stock will also shift\nthe schedule outward, but eventually it will return to normal (wage on y-axis\nand labor on x-axis).\nWage Rate As labor supply shifts to the left while labor demand shifts to the right,\nthe wage must increase. It increases on impact, then increases for a few quarters\nbefore it gradually returns to normal.\nEmployment The outward shift in labor demand is stronger today that it will be\nin the not to distant future. Thus working is more attractive today than it\nis tomorrow. This motive for intertemporal substitution is stronger than the\nwealth effect, so employment will increase on impact. But it will actually fall\nbelow normal before gradually returning to its normal level.\nInterest Rate On impact the interest rate increases due to higher productivity.\nOver time the shock to productivity will die out while temporarily the capital\nstock is growing. As a consequence the interest rate falls below normal before\nreturning to its normal level.\n\nConsumption Consumption increases on impact due to the wealth effect. The\nhigh interest rate together with the Euler equation implies that for a while\nconsumption will be growing. But eventually the interest rate falls below normal\nand consumption will be falling and gradually return to normal.\nSavings The gain from higher productivity will be smoothed over time. First savings\nwill be higher than normal, but eventually the household will dissave.\nPhysical Capital Physical capital is given and cannot change on impact (from 2a\nit depends on t-1 variables). From the discussion of savings it follows that\nphysical capital will be increasing for a while, but eventually it will peak and\nthen gradually return to normal.\n5. (a) The capital share and labor share in income could be used to calibrate α and β.\nBut remember we are assuming that α = 1 - β and for this to be valid, factors\nmust be paid their marginal products. This condition can fail for various reasons\nsuch as imperfect competition, externalities, labor hoarding etc.\n(b) The calibration suggested in part (a) is only valid under CRS, so it fails if\nα + β > 1. This would imply that the Solow residuals no longer just capture\ntechnology shocks. A high Solow residual may simply be a consequence of a\nhigh level of production in combination with increasing returns to a factor."
    },
    {
      "category": "Exam",
      "title": "Midterm Exam Solutions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-06-intermediate-macroeconomic-theory-spring-2003/5f695369b46fbd9f8b4043a881e046f9_midterm_solutions.pdf",
      "content": "14.06 Macroeconomics\nSpring 2003\nMidterm Exam Solutions\nPart A (True, false or uncertain)\n1. An economy that increases its saving rate will experience faster growth.\nUncertain. In the Solow model an economy that increases its saving rate will tem\nporarily experience faster growth, but the long-run growth rate remains unchanged.\nIn endogenous growth models the long-run growth rate may be an increasing function\nof the saving rate. An example for this is the AK model.\n2. Once human capital is included, the Solow model does a good job at explaining ob\nserved per capita income differences across countries.\nUncertain. Introducing human capital has the potential to greatly increase the abil\nity of the Solow model to account for cross-country differences in per capita income.\nTo see that, recall that in class we derived that in the Solow model, the long run\nα\nelasticity of output with respect to the saving rate is 1-α , where α is capital's share.\nIf capital's share is moderate, this elasticity is not large. So differences in the savings\nrate across countries do not translate into large differences in per capita income across\ncountries. But if capital's share is close to one, a small increase in s causes a large\nincrease in per capital output. Recognizing the existence of human capital implies\nthat we must raise our estimate of the share of income that is paid to capital (the\nusual estimate we used was one third), and this larger captial's share may enable us\nto explain large differences in per capita income across countries.\nHowever, according to empirical studies by Hall and Jones (1999) and Klenow and\nRodriguez-Clare (1997), variations in both physical and human capital are of of non\nneglibile imporatance, but variations in output for given capital stocks are the most\nimportant source of income differences across countries (see Romer, Part B of Chapter\n3).\n3. Growth theory predicts that poor countries should grow faster than rich countries, and\nresearchers have found the evidence to be consistent with this prediction.\nThe hypothesis that poor economies tend to grow faster per capita than rich ones\n- without conditioning on any other characteristics of economies - is referred to\nas abolute convergence. Does the Solow model predict absolut convergence? If all\ncountries have the same parameters (technology, saving rate, etc.) then they all\nhave the same balanced growth path and only differ by how far they are away from\n\nthe balanced growth path, and indeed the model would predict absolut convergence.\nIf countries have differ in technology, savings rate etc., then the model does not\nnecessarily predict absolut convergence. But one may still expect absolut convergence\nto occur. If only saving rates differ, then countries with low capital per worker due\nto a low savings rate will have a higher marginal product of capital, which provides\nincentives of capital to flow from rich to poor countries. If differences in per capita\nincome are due to differences in technology, one may expect these differences to shrink\nas poorer countries gain access to state-of-the art methods.\nIs the evidence consistent with absolut convergence? In class we discussed the study\nof Baumol (1986), and his results provided strong support for absolut convergence.\nHowever, De Long (1988) demonstrates that Baumol's findings are largely spurious\ndue to problems of sample selection and measurement error (see Romer, section 1.7).\n4. A Ramsey economy that starts above the golden rule capital stock will converge to the\ngolden rule. But if it starts below the golden rule it will also converge to a level below\nthe golden rule because impatient consumers are unwilling to sacrifice consumption\nduring the transition.\nFalse. The economy will converge to the modified golden rule capital stock irrespective\nof whether the initial stock is below or above the golden rule capital stock. Recall\nthe Euler equation of the Ramsey model:\nct = σ(ct)[f 0(kt) - θ - n]\nct\nOnly the modified golden rule level k∗ implicitly defined by f 0(k∗) = n+θ is consistent\nwith zero consumption growth. If f 0(kt) > θ + n, then consuming the same today\nand tomorrow is not optimal because then the the marginal rate of transformation\nwould exceed the marginal rate of substitution and the representative family could\nincrease utility by increasing consumption tomorrow relative to today. An analogous\nargument applies to the case f 0(kt) < θ + n.\n\nPart B\n1. This specification can be interpreted as a learning-by-doing model in which knowledge\naccumulation occurs as a side effect of goods production.The idea of learning-by-doing\nis that, as individuals produce goods, they inevitably think of ways of improving the\nproduction process. For example, Arrow (1962) cites the empirical regularity that\nafter a new airplane design is introduced, the time required to build the marginal\naircraft is decreasing in the number of aircraft of that model that have already been\nproduced. In contrast to R&D activities, this type of knowledge accumulation is not\na result of deliberate efforts, but a side effect of conventional economic activity. (see\nRomer, page 120)\n2. This question turned out to be an unintended trick question. If the specification\nhad been A(t) = Y (t)φ , then φ = 0 would have implied A(t) = 1 for all t, and\nthe model would have reduced to the Solow model without exogenous technological\nprogress. We added this question after writing and solving the problem, thinking\nthat it would give you the opportunity to get some points without a lot of algebra,\nand we thought φ = 0 was the answer. But with the specification A (t) = Y (t)φ ,\nA (t)\nφ = 0 implies A (t) = 1 for all t, and so A(t) = A(0) + t and gA(t) = A(t) = A(0)+t . So\nthere is always some technological progress, but this technological progress eventually\nbecomes negligible. So in the long run the economy will look very similar to a Solow\neconomy without technological progress, but the equations governing the economy\nare not identical.\n3. There was a typo in the question which was corrected during the exam. The question\nshould have read \"Find expressions for gA(t) and gK (t) in terms of A(t), K(t), L(t)\nand the parameters.\", and the answer is\ngA(t) = Y (t)φ\n= K(t)φαA(t)φ(1-α)-1L(t)φ(1-α),\nA(t)\nμ\n¶1-α\nA(t)L(t)\ngK (t) = s\n.\nK(t)\n4. Differentiation yields\ng A(t) = φαgK (t) + (φ(1 - α) - 1)gA(t) + φ(1 - α)n,\ngA(t)\ng K (t) = (1 - α)(gA(t) + n - gK (t)).\ngK (t)\nYou can get this answer very quickly by using the following rules:\n\n(a) If X(t), Y (t) and Z(t) are functions of time and Z(t) = X(t) · Y (t), then\nZ (t)\nX (t)\nY (t)\n=\n+\n.\nZ(t)\nX(t)\nY (t)\n(b) If X(t) and Y (t) are functions of time and Y (t) = X(t)α , then\nY (t)\nX (t)\n= α\n.\nY (t)\nX(t)\nYou should have been aware of these rules from problem sets and recitation, but\nfor some reason most of you did not apply them, and thus wasted precious time on\ntedious algebra.\nWhat is important here is that the right hand side of the resulting equations depend\non time only through gK (t) and gA(t), i.e. K(t), A(t) and L(t) no longer appear in\nthese equations. If this were not the case, it would not be possible to draw a phase\ndiagram.\nThe g A = 0 and g K = 0 schedules are given by\n1 - φ(1 - α)\nφ(1 - α)\ngK =\ngA -\nn,\n(1)\nφα\nφα\ngK = gA + n,\n(2)\n∗\n∗\nφ\nrespectively. The two schedules intersect in (gA, gK ) =\n1-φ n, 1-φ n . The phase\ndiagram is shown in figure 1.\n5. As is clear from the phase diagram the economy converges to a balanced growth path\n∗\n∗\non which A grows at rate gA and both K and Y grow at rate gK . The balanced growth\npath essentially looks like the balanced growth path of the Solow model, but instead\nof exogenous technological progress at rate g we now have technological progress at\n∗\nφ\nan endogenously determined rate gA = 1-φ n.\n6. What we are usually interested in is the growth rate of per capita output. Here\nY\nthe growth rate of output per capita L on the balanced growth pathis given by\n∗\n∗\nφ\ng Y = gA = 1-φ n. An increase in s has no effect on long run per capita growht while\nL\nan increase in n will increase long run per capita growth. The long run growth rate\ngoes to infinity as φ gets close to one.\n7. The growth rate of output per capita is not on average higher in countries with faster\npopulation growth, so this is not a good model to account for differences in growth\nrates across countries.\n\n8. The private marginal product of capital as a function of K(t), L(t) A(t) and the\nparameters is given by\nμ\n¶1-α\nA(t)L(t)\nr(t) = α\n.\nK(t)\n9. The Euler equation is\nC (t)\nr(t) - ρ\n=\n.\nC(t)\nσ\nTo derive it (not required in the exam), notice that the flow budget constraint of the\nrepresentative household is\nA (t) = r(t)A(t) + w(t)L(t) - C(t),\nso the Hamiltonian is\n-ρt C(t)1-σ\nH(t) = e\n+ μ(t)[r(t)A(t) + w(t)L(t) - C(t)].\n1 - σ\n∂H(t)\nThe two first order conditions used in the derivation of the Euler equation are ∂C(t) =\n0, which can be written as\ne -ρtC(t)-σ = μ(t)\nand μ (t) = - ∂H(t)\n∂A(t) , which can be rewritten as\nμ (t) = -r(t).\nμ(t)\nDifferentiating the first equation with respect to time yields\nμ (t)\nC (t)\n= -ρ - σ\n.\nμ(t)\nC(t)\nCombining these results yields the Euler equation.\nTo give an economic interpretation of this condition, suppose it were violated in the\nfollowing way:\nC (t)\nr(t) - ρ\n<\n,\nC(t)\nσ\nIn this situation the interest rate (the marginal rate of transformation) exceeds the\nmarginal rate of substitution between consumption tomorrow and consumption to-\nday, and the representative household can do better by consuming more tomorrow\nrelative to today, i.e. by increasing consumption growth. An analogous argument\nrules out the reversed inequality. Here σ is the inverse of the elasticity of intertempo\nral substitution. If this elasticity is high, the household is very willing to substitute\nconsumption across time, and as a consequence consumption growth is very reponsive\nto differences between the interest rate and the rate of time preference.\n\n\"\n#\n·\n·\n\n10. This part is very difficult and actually nobody solved it. Here we are dealing with a\nthree-dimensional dynamic system. The three variables I will use are gA, gK and r\n(there are more convenient choices, but this one is more consistent with the compu\ntations for a constant savings rate). It is straigthforward to compute\ng A(t) = φαgK (t) + (φ(1 - α) - 1)gA(t) + φ(1 - α)n,\ngA(t)\nr(t) = (1 - α)(gA(t) + n - gK (t)).\nr(t)\nThe equation of motion for capital is K (t) = Y (t) - C(t), so\nr(t)\nC(t)\ngK (t) =\n-\n.\nα\nK(t)\nDifferentiation yields\n1 r(t)\nC (t)\nK (t) C(t)\ng K (t) =\nr(t) -\n-\nα r(t)\nC(t)\nK(t) K(t)\n(1 - α)\nr(t) - ρ\nr(t)\n=\n(gA(t) + n - gK (t))r(t) -\n- gK (t)\n- gK (t) .\nα\nσ\nα\n∗\n∗\n∗\nThen the growth rates on the balanced growth path are gC = gY = gK = 1-φ n and\n∗\nφ\n∗\nσ\ngA = 1-φ n, and the interest rate on the balanced growth path is r = 1-φ n + ρ.\n∗\n∗\nThe condition ρ > 1-σ\n1-φ n insures that r > gY , which is needed because otherwise the\nhousehold could attain infinite lifetime utility.\nEndogenizing savings does not change the growth rates on the balanced growth path.\nIn particular, they do not depend on σ and ρ. This is not surprising given that the\ngrowth rates were also independent of the exogenous savings rate. Savings behavior,\nwhether optimizing or given by a constant savings rate, does not affect long run\ngrowth in this model.\n\nA\ng\nK\ng\n=\nA\ng&\n=\nK\ng&\n*\nA\ng\n*\nK\ng\nn"
    }
  ]
}