{
  "course_name": "Integrated Chemical Engineering I",
  "course_description": "This course uses reaction kinetics, batch reactor analysis, batch distillation, batch operations scheduling, safety analysis, and the ABACUSS process simulator to introduce process design and analysis techniques.\nAcknowledgements\nThe materials for the Fall 2006 offering of this course were drawn extensively from the materials that Professor Paul Barton used while teaching this course in past years. We are indebted to him for his long service to 10.490.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Science",
    "Chemistry",
    "Analytical Chemistry",
    "Engineering",
    "Chemical Engineering",
    "Science",
    "Chemistry",
    "Analytical Chemistry"
  ],
  "syllabus_content": "A\nCalendar\nshowing lectures, recitations, and office hours is listed below.\n\nCourse Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nGoals\n\nWe want you to learn about:\n\nDesign of Batch Processes\n\nUse of Process Simulators, Including the Skills of Modeling, Coding, and Interpretation\n\nThe Limitations of Mathematical Models, and What Really Happens in Process Equipment\n\nObjectives\n\nWe plan to show you:\n\nReaction Kinetics and Batch Reactor Analysis\n\nBatch Distillation\n\nThe Use of the ABACUSS Simulator\n\nScheduling of Batch Operations\n\nSafety Analysis in Process Design\n\nA Way to Analyze and Modify a Process During Design\n\nDescription\n\nThis course introduces chemical process design. The homework assignments familiarize students with ABACUSS simulations, batch processes, and separation systems. Students then develop a base case scenario as a first solution to the design problem. Students evaluate the economic feasibility of the base case solution. Through discussions with the instructors and TAs, students refine their model parameters to arrive at an optimized solution. Lastly, students communicate their solution by writing a report.\n\nPrerequisites\n\nThe prerequisites for this course include 10.37,\n10.32\n, 10.301, 10.213 and\n5.60\n.\n\nMeeting Hours\n\nThere is no formal restriction on which section you attend. The class will have three types of meeting: regular lectures, recitation sessions, and instructor office hours. Regular lectures will be held on campus and are indicated on the course schedule. Recitation sessions will also be held in the same room. No formal lecture material will be taught in recitation sessions; instead, students will be expected to bring questions and participate in a discussion of their design projects. Instructor office hour sessions will be held in the instructor's office. During these periods, the instructor's office will be open to any students with questions concerning their design projects.\n\nRecommended Texts\n\nKing, C. J.\nSeparation Processes\n. 2nd ed. New York, NY: McGraw-Hill, 1980. ISBN: 9780070346123.\n\nSmith, J. M., H. C. Van Ness, and M. M. Abbott.\nIntroduction to Chemical Engineering Thermodynamics\n. 7th ed. Boston, MA: McGraw-Hill, 2004. ISBN: 9780073104454.\n\nFogler, H. S.\nElements of Chemical Reaction Engineering\n. 4th ed. Upper Saddle River, NJ: Prentice Hall PTR, 2005. ISBN: 9780130473943.\n\nFix-its\n\nWe learn better if we examine the input as we receive it. At the end of each class, please submit the fix-it form. The fix-it asks (1) What was the most important thing you learned? (2) What topic or point was least clear? Of course additional comments, questions, and requests are welcome, as well. If you use fix-its earnestly, you will benefit.\n\nHomework\n\nHomework assignments should be completed individually, while all report assignments should be submitted as group contributions. Draft sections of the final report will be graded for style and technical content and will count towards the final report grade. It is course policy that students should not refer to either homework or final project solutions from earlier years. If it is discovered that reference has been made to earlier years, the students involved will receive no credit for the assignment in question. Note that we change the underlying models in ABACUSS from year to year, so the results generated by this software change.\n\nLate Submission of Work\n\nAssigned work is due at the beginning of class on the dates given in the schedule. Extensions cost 10 percent for each 24 hours beyond the deadline, up to a maximum of 30 percent. Medical and beyond-your-control problems will be dealt with individually. Plant trips and other scheduled activities are not beyond your control - allocate your time to meet all your obligations.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n40%\n\nFinal Report\n\n60%\n\nABACUSS II\n\nABACUSS II is an equation-based process simulator that has been developed at MIT. ABACUSS II can solve dynamic as well as steady-state problems. For example, it can model charging a batch reactor, reactions in a batch reactor, shutting valves, phase transitions, as well as continuous plant operation. ABACUSS II is not available from this site.\n\nCalendar\n\nThe calendar below provides information on the course's lecture (L), recitations (R), and office hours (OH) sessions.\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nL1\n\nCourse Goals and Requirements\n\nIntroduction to Batch Processing\n\nL2\n\nLucretex Project\n\nProject Team Assignments\n\nL3\n\nData Request for Reaction Kinetics\n\nL4\n\nLaboratory Kinetic Data and Curve-fitting\n\nL5\n\nBatch Reactor Modeling\n\nL6-L8\n\nReactor Model in ABACUSS\n\nHomework 1 due in Ses #L6\n\nL9\n\nBatch Distillation\n\nL10\n\nVapor-Liquid Equilibrium Models\n\nHomework 2 due\n\nL11-L12\n\nBatch Distillation in ABACUSS\n\nL13\n\nBase Case Simulation\n\nHomework 3 due\n\nL14-L16\n\nBatch Process Scheduling\n\nL17\n\nBatch Process Economics\n\nBase Case Simulation\n\nL18\n\nSafety as an Industrial Concern\n\nL19\n\nSafety Assessment Methods\n\nL20\n\nEnvironmental Issues in Process Design\n\nL21\n\nReview Final Project, Discuss Optimization\n\nBase Case Economics\n\nOH1\n\nOffice Hours\n\nR1\n\nProcess Optimization\n\nOH2-OH4\n\nOffice Hours\n\nR2\n\nProcess Optimization (cont.)\n\nOH5-OH6\n\nOffice Hours\n\nR3\n\nProcess Optimization (cont.)\n\nL22\n\nCourse Evaluation\n\nFinal report due",
  "files": [
    {
      "category": "Resource",
      "title": "homework_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/e57cb7fdf7d3e063a2f0f408e17a5f3f_homework_1.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nProblem Set 1\nThis problem set reviews reactor engineering and batch processing topics. Later, we will do\nsimilar problems, but more complicated, so that we will require a process simulation code to\nreach an answer. Here, a spreadsheet suffices.\n\nProblem 1: Data Analysis and Parameter Estimation (40 points)\nOne reaction in the Lucretex process is the hydrolysis of E to give D. The chemistry of the\nreaction (also given in the problem statement) is\n\n2E + H2O → D + 2MeOH\n(1)\n\nThe chemists conducted batch experiments in the laboratory to generate kinetic data. They\ncarried out Reaction (1) in a flask at three different temperatures, and measured the concentration\nof E in the flask over time. The flask initially contained 1.3 mol/liter of E and 26 mol/liter of\nwater, along with inert materials. The data for the experiments are shown in Table 1.\n\n- From their measurements, determine a rate expression for the hydrolysis reaction. (The\nchemists feel that the reaction is either first order in E and water, or second order in E).\n- Calculate the kinetic rate constant at the three different temperatures.\n- Determine the pre-exponential factor and the activation energy in the Arrhenius expression\nfor the rate constant for this reaction.\n\nTable 1: Concentration of E (molar)\n\ntemperature (oC)\ntime(h)\n1.3\n1.3\n1.3\n0.25\n0.599\n0.732\n0.911\n0.5\n0.380\n0.523\n0.714\n0.226\n0.319\n0.481\n1.5\n0.159\n0.244\n0.384\n0.116\n0.182\n0.297\n2.5\n0.104\n0.151\n0.264\n0.084\n0.124\n0.209\n3.5\n0.075\n0.106\n0.194\n0.064\n0.108\n0.163\n4.5\n0.065\n0.100\n0.150\n0.063\n0.086\n0.139\n5.5\n\n0.065\n0.122\n\n0.074\n0.129\n6.5\n\n0.061\n0.110\n\n0.066\n0.107\n7.5\n\n0.049\n0.086\n\n0.086\n8.5\n\n0.098\n\n0.073\n9.5\n\n0.084\n\n0.072\nrevised 2006 Sep 7\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nProblem Set 1\nProblem 2: Batch Reactor Sizing (30 points)\nIt is desired to produce 1000 Mg of D in 200-day operating campaign via batch reaction. The\nreactor is to be charged with reactants in the proportions of Problem 1 and run at 84oC. The\nstopping criterion is 97% conversion of E. A complete batch consists of fill/react/empty. The\nflow rate for pumping reactants in and products out is 200 L min-1. Calculate the required\nvolume of a reactor vessel, assuming it is to run no more than 80% full.\n\nProblem 3: Back-of-the-Envelope Calculation (30 Points)\nRaw material costs for the Lucretex process are given in Table 2. Given the information\ncurrently available to you, estimate a lower bound on the cost of manufacturing 280,000 lbm of\nLucretex. List and explain your assumptions.\n\nTable 2: Raw Material Costs for the Lucretex Process\n\nR1\n4.25\n$ kg-1\nR2\n9.2\n$ kg-1\ntoluene\n1.52\n$ kg-1\n$ L-1\nPt cat\nMeOH\n1.34\n$ kg-1\nH2O\n0.015\n$ kg-1\n\nrevised 2006 Sep 7"
    },
    {
      "category": "Resource",
      "title": "depend_tree_hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/63388b6dda6f0be7308b8bdcdf037a5e_depend_tree_hw2.pdf",
      "content": "Model Dependency Tree for ICE Reactor 1\ncomprising MODELs found in the files ICE_Reactor1_Model.ABACUSS and PhysicalProperties.ABACUSS\nEMPIRICAL MODELS\nTHERMODYNAMIC QUANTITIES\nEQUIPMENT PIECES\nOPERATING UNITS\nPureComponentRackett\nIdealLiquidVolume\nLiquidVolume\nBubblePoint\nR1Condenser\nExtendedAntoine\nVaporPressure\nNonIdealVLE\nVLE\nDewPoint\nWilson\nActivityCoefficient\nRegularSolution\nExcessEnthalpy\nNonIdealLiquidEnthalpy\nLiquidEnthalpy\nReactor1\nReactorSystem\nIdealGasEnthalpy\nVaporEnthalpy\nSource\nPlant\nR1SteamJacket\nWatsonEquation\nHeatOfVaporization\nR1SteamSystem\nIdealGasEOS\nEOS\nR1SteamFeed\nAt this end are defined low-level parameters,\nvalues for parameters and independent variables\nAt this end, the values of low-level\nsuch as the coefficients in a model\nFLOW LEFT\nparameters are supplied for each\nof activity coefficients.\nchemical component of interest.\ncomputed values for dependent variables\nFLOW RIGHT\nIn 'production use' of the code, however,\nwe could have a library of physical\nproperty model coefficients stored, and\nmerely select chemical components here."
    },
    {
      "category": "Resource",
      "title": "homework_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/92c0426a8e2304606e31041bc8fed0fe_homework_2.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nProblem Set 2\nThis problem allows you to simulate Reaction 1 of the Lucretex process. The model\nencompasses temperature change, boiling of the reaction mixture, and vapor loss. Use the input\nfile named HW21A.ABACUSS as the starting point.\n\nProblem 1: Batch Mode (40 points)\n(a) Use ABACUSS to simulate Reaction 1 in a batch mode of operation. Simulate for 6 hours.\nCharge 30 kg R1, 35 kg R2, 0.3 L Pt catalyst, and 120 kg toluene solvent at time = 0. The\ncatalyst slurry has 5 moles of Pt per litre. The remaining volume consists of toluene. Specify the\ninitial charge to be at 70oC. Leave the stem position of the steam supply valve at zero (adiabatic\noperation). See memo #5 in order to access the input files for this problem and how to run it.\n\n- Use the plotting facility to examine the molar amounts of the species with time. What is the\nlimiting reagent?\n- Examine the volume in the reactor contents as a function of time. Does it change\nsignificantly? Would it change even if all of the liquids had exactly the same molar volume?\n- Compare the bubble temperature and the temperature of the reactor. Interpret your results.\n\n(b) Now modify the stopping criterion for the simulation. Stop the simulation when the amount\nof either R1 or R2 gets below 0.5 mol. At what time does this occur? See the language\nreference in memo #5 on how to alter the input file to achieve this. Whenever you change an\ninput file, copy it and edit the copy! Please turn in the SIMULATION block that you used to\nstop the reaction at this time.\n\nProblem 2: Fed-Batch Mode (30 points)\nUse ABACUSS to simulate Reaction 1 in the following fed-batch mode of operation. Charge\n25% of the amounts given in Problem 1 for R1 and R2. Charge all the catalyst and solvent at\ntime = 0 (use the same total amounts as those in Problem 1). The charge should be at 75oC.\nFeed the remaining 75% of R1 and R2 at 60oC at a constant rate over the first 4 hours of\noperation. Use adiabatic operation. Then, continue the reaction for 2 more hours.\n\nTurn in a copy of your SIMULATION block.\n\nProblem 3: Comparison (30 points)\n(a) Compare the two operating strategies. Make the following plots:\n- Total mols A vs. Time\n- Total mols C vs. Time\n- Condenser cooling load vs. Time\nPut the two curves (corresponding to results for Problems 1 and 2) on each plot.\n\n(b) Calculate the final molar yields of A and C based on R2 for each operating strategy.\nCalculate the final selectivities (mols A / mols C) for each method.\n\n(c) Discuss the relative merits and drawbacks of the two operating strategies. Address these\nquestions:\n\n- Which scheme provides better selectivity?\nrevised 2006 Aug 18\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nProblem Set 2\n- Which scheme provides better conversion?\n- What would happen if we were limited in the amount of cooling water that was available for\nthe condenser, and we could only remove 5 kJ/sec?\n- What further changes to the operating policy might we try to improve the selectivity?\n\nrevised 2006 Aug 18"
    },
    {
      "category": "Resource",
      "title": "homework_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/a9f102c8e1be0a8f8e16473b324cdfb7_homework_3.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nProblem Set 3\nThis problem set explores simulation of batch distillation with ABACUSS. .\n\nProblem 1: Binary Batch Distillation (50 Points)\nA process produces a waste stream of 4500 kg of a 55 mass% methanol/ethanol mixture (per\nbatch). The sales department believes it could sell methanol recovered from this waste stream,\nprovided that its concentration is increased to 80 mass%. The plant manager would like you to\nstudy the feasibility of recovering methanol of the desired purity. A batch rectifier is available\nfor the solvent recovery operation. It takes 2.1 hours to charge, preheat, discharge, and clean the\ncolumn for each batch (the still is used for other separations between solvent recovery batches).\nThe still is normally operated at a constant boilup rate of 50 kmol/h. The fractionating capability\nis equivalent to 9 theoretical stages (including the reboiler). A suitable model has been prepared\nin a file stored in the course locker: /mit/10.490/Public/ABACUSS/include/DistHW.ABACUSS\n\nThe mixture can be considered to have a constant relative volatility of 1.72. The sales office\nsuggests that you evaluate the column productivity, P, through the simple formula:\n\nw\ndist\nchange\nD\nP\nt\nt\n=\n+\n\nwhere Dw is the mass of on-specification methanol product collected in the accumulator, tdist is\nthe distillation time, and tchange is the changeover time (2.1 h). To avoid simulation failures,\ninitialize the accumulator with 1 mole of methanol (models cannot predict mole fractions when\nholdups are zero).\n\n(a) Provide a derivation of the model in DistHW.ABACUSS, detailing the consequences of\nall assumptions.\n(b) Run a series of simulations with different constant reflux ratios. Plot column\nproductivity vs. reflux ratio. What is the optimum reflux ratio?\n(c) Can you improve the productivity further by designing a time-varying reflux policy?\n(d) What factors does the productivity metric not measure?\n\nHand in ABACUSS input files for your optimal policies in parts (b) and (c).\n\nProblem 2: Multicomponent Distillation with ABACUSS (50 points)\nThe first distillation task in the Lucretex process separates a mixture of six components.\nSuppose 20 kmol of product from the second reaction task is charged to a batch rectifier. The\nmolar composition of the feed (on a catalyst-free basis) is:\n\nComponent\nMole fraction\nA\n0.15\nE\n0.12\nI2\n0.02\nMeOH\n0.24\nAllyl Alcohol\n0.19\nToluene\n0.28\n\nrevised 2006 Aug 23\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nProblem Set 3\nThe packing height can be considered to be equivalent to ten equilibrium stages. The distillation\nis conducted in the following way:\n\n1. Atmospheric distillation:\n(a) Pres-Profile: Atmospheric pressure, zero pressure drop in the column.\n(b) Col-Specs: Vapor rate from reboiler is 15 kmol/h; reflux ratio is 8.0.\n(c) Stop-Crit: Since the Pt catalyst slurry catalyzes unwanted side reactions above 140oC,\ndistillation should be stopped when the reboiler temperature reaches 130oC.\n2. Vacuum distillation:\n(a) Pres-Profile: Pressure of 150 mm Hg is applied to the column. The rate of vacuum\napplication is linear, and it takes 30 minutes to go from 760 mm to 150 mm Hg.\nPressure drop in the column is zero.\n(b) Col-specs: Vapor rate from reboiler is 15 kmol/h; reflux ratio is 8.0.\n(c) Stop-Crit: Stop when reboiler temperature reaches 135oC.\n\nUse ABACUSS to simulate this sequence of operating tasks. For physical properties, use the\nWilson activity coefficient model and the ideal gas equation of state. The property file should be\nincluded from the course locker as you did for the tutorial. Switch the distillate to the second\naccumulator between the two tasks.\n\n(a) Give the amount and composition of the material in the first accumulator after the\natmospheric distillation step.\n(b) Determine the amount and composition of the material in the second accumulator\nafter vacuum distillation. What is left in the reboiler?\n(c) Calculate the total amount of (A+E) lost in the distillation, if only the second cut\n(overhead from the vacuum distillation) is passed to the downstream process.\n(d) What is the total time of operation of the column?\n(e) Record the instantaneous distillate composition for each of the six components as a\nfunction of time. Print out a plot of these compositions versus time and point out\nwhere the vacuum distillation cut is made.\n(f) Plot the temperature profile in the column at a number of equally spaced points in\ntime during the course of the operation.\n\nNB: the reflux ratio values stated above are according to the usual definition, i.e., R = L/D,\nwhich can vary between zero and infinity (total reflux). ABACUSS cannot deal with infinity as\na number, so the reflux ratio used in the ABACUSS model is a normalized reflux ratio defined\nbetween zero and unity (total reflux).\n\nnorm\nL\nR\nR\nL\nD\nR\n=\n=\n+\n+\n\nrevised 2006 Aug 23"
    },
    {
      "category": "Lecture Notes",
      "title": "eng_econ_lecture.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/98288885a32c8a4054460082cb87a426_eng_econ_lecture.pdf",
      "content": "Engineering Economics\nOverview and Application in\nProcess Engineering Industry\n10.490 ICE\nKangyi MAO\n02 OCT 2006\nWHAT IS ECONOMICS?\n\"Economics is the study of how people and society choose\nto employ scarce resources that could have alternative\nuses in order to produce various commodities and to\ndistribute them for consumption, now or in the future,\n...\"\nfrom Paul Samuelson and William Nordhaus, Economics, 12th Ed., McGraw-\nHill, New York, 1985.\nWHAT IS ENGINEERING ECONOMICS?\nThe application of economic principles to engineering\nproblems, for example in comparing the comparative\ncosts of two alternative capital projects or in determining\nthe optimum engineering course from the cost aspect.\n\nWHY DO WE NEED TO KNOW ABOUT THIS?!\n- Optimal cost-effectiveness\n- Alternative possibilities (Cal Tech Industries!)\nWHAT DO WE NEED TO KNOW?\n- Time value of money\n- Estimation of cash flows\n- Quantitative measurements of profitability\n- Systematic comparison of alternatives\nTime Value of Money\nThe fundamentals underlying all financial activities!\n\nTIME VALUE OF MONEY\n- Why does money have time value?\n- The owner of the money must defer its use. Thus,\nthe person using the money must pay for deferring the\nbenefits.\n- An alternative use of the money could have\ngenerated other benefits, e.g. interests.\n- How do we characterize time value?\n-We use an interest rate, so that the effect of time is\nproportional to the total amount of money involved\nand positively related with the length of time.\nFV\nPV = (1 + r)n\nCASH FLOW DIAGRAM\n- Cash flow diagram is adopted to show the\ncash flows for a project over time.\nCash Flow: $M\n+7\n+7\n+15\nTIME:Year\n-10\n-5\nA Typical CFD for an engineering project\n- How to project cash flows?\n- Cost estimation (the task of engineers!)\n- Product pricing and sales projection (Mutual efforts of\nS&M dept., consulting, engineers, and project managers)\n\nQuantification of Profitability\nThe central target of most projects!\nNET PRESENT VALUE (NPV)\nN\nNPV = ∑Cn(1+ i)-n\nn=1\nExamines the total value of all cash flows at time 0.\n\"i\" is defined as the rate of return that could be achieved otherwise, or\ncost of capital.\nIf NPV>0, the project is acceptable.\nFor our sample CFD\n- The expected rate of return (cost of capital) is 10%\n- The present value of C(0): PV[C(0)] = -$10M\n- The present value of C(3): PV[C(3)] = 7/(1+10%)^3 = $5.23M\n- The net present value of the project: SUM{PV[C(i)]} = $6.74M\n- Project accepted!\n\nPAYBACK PERIOD\n- This measure is often used as a \"quick and dirty\" measure of\nprofitability\n- Also called Payout Time\n- Defined in units of time (months or years)\n- The time for the cumulative cash flow to achieve a value of 0.0.\nUsually, payback time does not consider interest.\nCash Flow: $M\n+7\n+7\n+15\nTIME:Year\n-10\n-5\n- For our sample CFD, the payback period is approximately 3.1\nyears.\nRETURN ON INVESTMENT (ROI)\n- A comparison of the money earned (or lost)\non an investment to the amount of money\ninvested.\nAnnual Average Profit\nROI =\nTotal Investment\n- Generally does not calculate time value.\n- In the example, if we assume cash flows at\nyear 1&2 are total investment, we have\nROI=(7+7+15-10-5)/4/(10+5)=~24%\n\nINTERNAL RATE OF RETURN (IRR)\n- The IRR is defined as any discount rate that\nresults in a net present value of zero, and is\nusually interpreted as the expected return\ngenerated by the investment.\n- In general, if the IRR is greater than the project's\ncost of capital rate, the project will add value for\nthe company.\nN\nn\nNPV = ∑Cn (1 + IRR )-= 0\nn=1\n- In our example, IRR is calculated to be 26%\nRECOMMENDATION?\n- Use NPV and IRR\n- The others neglect the time value of money!\n- Microsoft Excel have a group of functions\ndesigned to calculate these values.\n- Don't forget about the soft benefits and the\nrequirements from other perspectives!\n\nTYPICAL ACCOUNTING TOOLS\n- Income Statement is prepared on an accrual\nbasis. It records expenses when the cost is\nincurred, not when the bill is paid. It gives an\noverview about how much the project is actually\ngaining during individual years.\n- Project Cash Flow Statement is similar to the\nproject checkbook. It shows the exact time that\nthe checks are written and the savings are\nreceived. Compared with income statement, the\ncash flow statement does not include\ndepreciation expense. Instead, the cost of the\nsystem is a cash outflow in the initial period,\nwhen the check is written.\nExample: Income Statement\nYear\n\nTotal\nImplementation Costs\n-22,000\nSystem Depreciation\n-400\n-400\n-400\n-400\n-400\n-2,000\nService Contract\n-1,750\n-1,750\n-1,750\n-1,750\n-1,750\n-8,750\nSupplies & Miscellaneous\n-250\n-250\n-250\n-250\n-250\n-1,250\nModification of the LIMS\n-10,000\n-10,000\nInstallation\n\n153,880\nLabor Savings\nSalary\n21,650\n21,650\n21,650\n21,650\n21,650\n108,250\nTax\n1,660\n1,660\n1,660\n1,660\n1,660\n8,280\nBenefits\n6,500\n6,500\n6,500\n6,500\n6,500\n32,480\nViariable Costs\n4,870\nMaterial Savings\n10,400\nLabel\n1,720\n1,720\n1,720\n1,720\n1,720\n8,600\nInk\n1,800\nNet Income*\n20,460\n30,460\n30,460\n30,460\n30,460\n142,280\n*: The net income here is actually net savings, so there is no income tax associated.\n\nExample: Project Cash Flow Statement\nYear\n\nTotal\nImplementation Costs\n-$22,000\nSystem Cost\n\n-2,000\n\n-2,000\nService Contract\n-1,750\n-1,750\n-1,750\n-1,750\n-1,750\n-8,750\nSupplies & Miscellaneous\n-250\n-250\n-250\n-250\n-250\n-1,250\nModification of the LIMS\n-10,000\n-10,000\nInstallation\n\nLabor Savings\n153,880\nSalary\n21,650\n21,650\n21,650\n21,650\n21,650\n108,250\nTax\n1,660\n1,660\n1,660\n1,660\n1,660\n8,280\nBenefits\n6,500\n6,500\n6,500\n6,500\n6,500\n32,480\nViariable Costs\n4,870\nMaterial Savings\n10,400\nLabel\n1,720\n1,720\n1,720\n1,720\n1,720\n8,600\nInk\n1,800\nNet Cash Flow*\n-12,000\n30,860\n30,860\n30,860\n30,860\n30,860\n142,280\nAccumulative Cash Flow\n-12,000\n18,860\n49,710\n80,570\n111,420\n142,280\n142,280\n*: The Net Cash Flow here is actually net savings, so there is no income tax associated.\nCost Estimation\nTask of Engineers!\n\nTYPES OF COSTS\nCapital Costs\nOperating Costs\n-\nFixed equipment\n-\nDirect costs\n-\nWorking capital\n-\nFixed costs\n-\nGeneral costs\nEvaluating rough cost estimates for both using the same\napproach:\nUse historical data to develop correlations and apply\ncorrections for unique factors in specific situations.\nHOW ACCURATE DO YOU WANT IT TO BE?\nWe must balance the needed accuracy with the cost to perform.\n(See Peters and Timmerhaus, Pg 160-162)\nName\nAccuracy\nApplication\nProcess detail\nOrder of magnitude\n-30 to +50%\nScreen investments\nBlock flow diagram\nStudy\n-15 to +30%\nFinalize major choices PFD + rough design\nof major equipment\nDefinitive\n-5 to +15%\nControl costs\nP&I Drawing, detailed\nM&E balances,\nequipment\nspecifications\nRather overestimate\nthan underestimate\nWhere\nwe are!\nNo shortcut: A flowsheet simulation (e.g., ABACUSS) is\nrequired when developing a definitive cost estimation.\nThe information is required for accurate estimates of\nboth capital and manufacturing costs.\n\nESTIMATION OF CAPITAL COSTS\n- A couple of very rough methods (initial\nscreening)\n- Turnover Ratio\n- Lang's Factor\n- Bare Module method\n- The primary method used in process industry\n- First calculate the cost of individual equipment\n- Specific equipment type\n- Material of construction\n- Operating pressure\n- Estimate other indirect costs with appropriate factors\n- See Guthrie (1974) and Ulrich (1984) for further\ndetails\nTURNOVER RATIO\n(Total capital cost)\n(\nDelivered cost of major equipment )\nLF = ∑\nVERY ROUGH CAPITAL COST ESTIMATION\n(Use this with caution!)\n-Values of 0.2 to 8.0; usually 1.0 to 1.25 in process industries\nWe can use this to estimate the fixed capital costs for a plant making a known\nquantity for sales.\nWe use this as a guideline for the ratio of major equipment to total capital\ncosts.\nLANG'S FACTOR\n(gross annual sales)\n(fixed capital)\nTR =\n\nOPERATING COSTS\nThese are incurred with every unit of production and do\nnot include capital items.\n-\nDirect - Materials, labor, utilities,\nsupplies, waste treatment, etc.\n-\nFixed (indirect) - Land taxes,\ninsurance, plant administration,\netc.\n-\nGeneral expenses - Corporation,\nsales&marketing, R&D, etc.\nHow do these costs\ndepend on the plant\nproduction rate?\nOPERATING COSTS\nThese are incurred with every unit of production and do\nnot include capital items.\n-\nDirect - Materials, labor,\nutilities, supplies, waste\ntreatment, etc.\n-\nFixed (indirect) - Land taxes,\ninsurance, plant administration,\netc.\n-\nGeneral expenses- Corporation,\nsales&marketing, R&D, etc.\nproduction\nproduction\nLabor\nproduction\nMaterial streams\n\nHINTS FOR ESTIMATION OF OPERATING COSTS\n-\nDo not use standard inflation for energy\nor raw materials costs.\n- These can change rapidly + and - due to international\nincidents.\n-\nAccount for all shifts and overhead when\nestimating labor costs\n-Overhead is about 40% of salary\n-\nPersonnel do not scale with production\nwhen equipment size can be increased.\nREQUIREMENT OF ICE PROJECT?\n- Categorized cost estimation\n- Equipments (Assuming no other capital costs)\n- Rental or purchase?\n- Piece-wise calculation\n- Raw materials\n- Utilities\n- Heating/Cooling/Pressure&Vacuum Supply\n- Waste treatment\n- Wastes in various phases\n- Target?\n- Cost per pound\n- Campaign time\n\nSUMMARY\n- Time value of money\n- Why does money have time value?\n- How to calculate?\n- Quantification of profitability\n- NPV / Payback period / ROI / IRR\n- Typical accounting tools\n- Income statement and cash flow statement\n- Cost estimation\n- Capital costs and operating costs\n- Requirement of ICE project"
    },
    {
      "category": "Resource",
      "title": "memo_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/e3bc00744b3c78f0ebafdadf1d397a52_memo_1.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\nDIVERSIFIED CHEMICAL PRODUCTS\nSpecialty Products Division\nCambridge MA\n\nTO:\nU. R. Engineer\nFROM:\nI. M. Supervisor\nDATE:\n2006 Sep 8\nSUBJECT: Lucretex Batch Process Development Project Description and Goals\n\nChemists in the Research and Product Development Division in Blacksburg VA have\nsynthesized a promising new class of silicon-based polymers. These polymers have been under\nstudy for the past four years, and a series of pilot trials has recently been completed at the\nBlacksburg facility. Marketing executives at Corporate Headquarters in New York believe that\nthe potential world market for this family of polymers (to be called Lucretex) exceeds $200\nmillion annually because of the exceptional strength and flow properties of the material.\n\nManagement has authorized the production of 280,000 lb of the new polymer for extensive test-\nmarketing. The monomer will be produced here at our Cambridge plant because of the\nmultiproduct nature of our facility. The polymerization step will subsequently be carried out by\nthe Polymers Group in Worcester. Marketing would like to have the Lucretex as soon as\npossible in order to maximize market penetration. Pasadena Polymer Products is believed to\nhave a competitive product under development.\n\nYou have been assigned the problem of developing the process to produce the monomer. A\ndescription of the pilot plant trials conducted by the Research and Product Development Division\nis attached in order to give you a starting point for your design. Additional data will be available\nfrom Blacksburg in the near future. Various equipment units will be made available here in the\nplant for your use. Existing equipment should be used wherever possible.\n\nManagement wants to know: (1) how much it will cost to make the monomer and (2) how soon\nthe campaign can be completed. Cal Tech Industries (CTI) has just submitted a proposal to\nmanagement that claims they can produce 280,000 lb of monomer in 25 days at a cost of $9/lb.\nAs your supervisor, I will see that suitable incentives are made available if we can beat the CTI\nperformance figures.\n\nYou will prepare a detailed report to describe the proposed design, including the recommended\nequipment, operating procedures, safety analysis, and cost estimate. Corporate Headquarters\nindicates that no more than eight weeks should be taken for developing and optimizing your\nprocess design.\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\nPILOT PLANT RUN\nThe following is a description of the recent successful pilot plant run for manufacturing the\nmonomers used in production of Lucretex. Refer to Figure 1 for the molecular structure of the\nreactants and products, and Figure 2 for the stoichiometry of the main reactions taking place in\nthe process.\n\nThe entire process was conducted in the single agitated glass-lined jacketed kettle of 150-gallon\nvolume shown in Figure 3. The kettle was equipped with a 4-inch diameter overhead column\npacked with ceramic packing up to a depth of 48 inches. There was an overhead condenser with\ncooling water on the shell side. Steam and cooling water could also be passed through the kettle\njacket. There were four receivers to receive the various products and byproducts.\n\nThe following amounts of reactants were measured out and stored in safe containers:\n\n300 lbm tetramethyldisiloxane (TMDS)(R2)\n261 lbm allyl alcohol (R1)\n1 L Pt catalyst slurry (5 mol Pt per L toluene)\n43.6 gal toluene\n71.4 lbm methanol\n\nAll the toluene was charged into the clean kettle, followed by 20% of the catalyst. Steam\npassing through the jacket was used to bring the reactor to steady state under total reflux. The\ntwo reagents R1 and R2 were then added steadily at 0.6 - 0.7 lbm/min over about 10 hours.\nAdditional catalyst was added every hour such that all the catalyst had been added at the end of\n10 hours.\n\nVapor leaving the kettle bypassed the column into the overhead condenser, and condensate was\nreturned to the kettle. The noncondensable hydrogen released in the reaction (Reaction 1) was\ndiluted with nitrogen before exiting to the atmosphere. Temperature in the kettle was controlled\nby adjusting flow of cooling water/steam in the jacket. However, the temperature in the kettle\ndropped with time from an initial value of 110oC to a final value of 95oC.\n\nAfter 10 hours, the reaction mass was further heated under reflux for an hour when an IR\nspectrum of a sample showed no residual Si-H bonds. The reactor was allowed to cool to 75 -\n80oC, all the methanol charged into it, and refluxed for a couple of hours. During this time,\nReaction 2 occurred, leading to formation of E.\n\nThe next step in the process was atmospheric distillation. Steam was passed through the jacket\nas the heating medium. Vapor from the kettle passed through the column into the overhead\ncondenser, and the condensate was collected in Receiver 1. Rectification was conducted until\nthe pot temperature reached 135oC. This extracted all the unreacted allyl alcohol, methanol, and\nbulk of the toluene. (Safety note: above 140oC, the Pt catalyzes highly undesirable exothermic\nside reactions, leading to the formation of impurities and/or thermal runaway due to the heat\ngenerated by reaction.)\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\nThe kettle was then cooled in preparation for the vacuum distillation. A vacuum of 5 mm Hg\nwas applied to the kettle and a second overhead cut was taken in Receiver 2. This was composed\nof the remaining toluene and most of the A and E. The pot residue was mostly Pt catalyst and\nsome oligomers.\n\nThe residue from the kettle was removed, the kettle cleaned with toluene, and the A and E from\nReceiver 2 transferred back to the kettle. The hydrolysis reaction was carried out by adding\nexcess water.\n\nAt the end of the hydrolysis reaction (Reaction 3), another atmospheric distillation was\nconducted. This time the overhead fraction was predominantly water, methanol, and toluene.\nThe distillation proceeded until the pot temperature reached 160oC. A and D were left in the\nbottoms, and 434 lbm of this mixture was recovered for polymerization.\n\nThe total cycle time for the above process was 80 hours. The total yield of A+D was 92%.\nFigure 4 shows schematically the sequence of processing tasks to make A+D.\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\n\nFigure 1: Structures of Chemical Species in the Lucretex Process\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\n\nFigure 2: Reactions in the Lucretex Process\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\n\nFigure 3: Pilot Plant Equipment Schematic\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 1\n\nFigure 4: Pilot Plant Lucretex Task Network\n\nrevised 2006 Aug 24"
    },
    {
      "category": "Resource",
      "title": "memo_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/d3def97b4d5b6b66041e288d800926fa_memo_2.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 2\nDIVERSIFIED CHEMICAL PRODUCTS\nResearch and Product Development Division\nBlacksburg VA\n\nTO:\nU. R. Engineer\nFROM:\nPhil D. Chemist\nDATE:\n2006 Sep 11\nSUBJECT: Results of Kinetic Experiments for Reaction 1\n\nPer your request, we performed a number of batch kinetics experiments in order to provide you\nwith data to evaluate models for the kinetics of the first reaction in the production of the\nLucretex monomers.\n\nThe experiments were carried out according to the following protocol:\n\n- Charge the 250 mL flask with 41.7 mL of toluene.\n- Charge the flask with 35 g of TMDS (R2).\n- Place the flask in a constant temperature bath for 1 hour.\n- Add 0.22 mL of platinum catalyst slurry (5 mol Pt per L toluene) at t = 0.\n- Add X g of allyl alcohol (R1) at t = 0.\n- Take 1 mL samples from the flask every 24 min. These samples are immediately quenched\nin ice water. Concentration analyses are done later to determine the concentrations of R1,\nR2, A, and C.\n- The reaction is allowed to run for 4 hours.\n\nWe were unable to accurately measure the hydrogen evolution rate as you requested. Everything\nhad to be done with extreme care because the materials we were dealing with are toxic. In\naddition, the temperatures that were requested were above the boiling points of the initial\nreaction mixtures. Therefore, trials were done at lower temperatures.\n\nThe following runs were done: three sets of experiments were done, each set at a particular\ntemperature, leading to a total of nine runs. The temperatures investigated were 80, 85 and 90oC.\nIn each set, the amount of R1 charged into the flask, X, was varied. X took values of 15.135,\n30.27, and 45.405. These values correspond to molar ratios of 1:1, 2:1, and 3:1 (R1:R2). Two\nfinal experiments were conducted at 85oC with X = 30.27 g, with catalyst loadings of 0.11 and\n0.33 mL.\n\nrevised 2006 Aug 16\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 2\nREACTION I KINETICS STUDY\nCatalyst Loading: Base Amount: 0.22 mL (Concentrations in millimolar)\n\nTime, h\nR1/R2=1/1\nR1/R2=2/1\nR1/R2=3/1\n\nR1\nR2\nA\nC\nR1\nR2\nA\nC\nR1\nR2\nA\nC\nTemp=80oC\n0.0\n2458 2457\n4211 2105\n5526 1842\n0.4\n1601 1759 158\n2984 1208\n4167 912\n0.8\n1088 1437 349\n3400 556\n1.2\n781 1264 483\n2977 382 1089\n1.6\n589 1162 573 107 1573\n1066 101 2726 284 1242\n2.0\n463 1097 634 128 1395\n1170 118 2568 223 1340\n2.4\n377 1053 677 149 1270\n1245 134 2461 183 1406 108\n2.8\n315 1023 708 169 1178\n1301 149 2387 155 1452 117\n3.2\n270 1001 732 189 1109\n1343 164 2334 135 1485 125\n3.6\n986 750 209 1055\n1377 177 2294 120 1510 132\n4.0\n974 764 228 1013\n1404 189 2264 109 1529 138\nTemp=85oC\n0.0\n2458 2457\n4211 2105\n5526 1842\n0.4\n1349 1572 224\n3793 699\n0.8\n815 1244 430 105 1892\n103 3029 366 1022\n1.2\n541 1089 548 149 1511\n1053 140 2669 226 1241 119\n1.6\n386 1003 617 189 1289\n1181 172 2476 153 1362 140\n2.0\n950 660 227 1149\n1265 202 2362 111 1434 158\n2.4\n916 687 265 1049\n1323 228 2290\n1480 172\n2.8\n893 706 301\n1365 252 2242\n1511 184\n3.2\n877 720 336\n1397 273 2208\n1532 193\n3.6\n865 730 369\n1422 292 2185\n1548 200\n4.0\n857 737 400\n1442 308 2167\n1559 205\nTemp=90oC\n0.0\n2458 2457\n4211 2105\n5526 1842\n0.4\n1086 1378 293\n3422 497\n0.8\n580 1069 489 181 1579\n173 2734 216 1166 148\n1.2\n937 580 255 1263\n1148 233 2460 115 1339 188\n1.6\n868 626 325 1089\n1248 285 2328\n1424 218\n2.0\n828 651 390\n1311 328 2257\n1471 239\n2.4\n802 667 450\n1354 364 2215\n1499 253\n2.8\n785 677 505\n1385 395 2190\n1517 263\n3.2\n773 684 554\n1408 419 2173\n1528 270\n3.6\n765 688 599\n1425 440 2162\n1536 275\n4.0\n759 692 639\n1439 457 2155\n1540 278\n\nrevised 2006 Aug 16\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 2\n\nCatalyst Loading: Low: 0.11 mL\nR1/R2 = 2/1\nTemperature = 85oC\n\nTime, h\nR1\nR2\nA\nC\n0.0\n4215 2107\n0.4\n2948 1215 376\n0.8\n2234 857\n1.2\n1836 674\n1.6\n1593 566 1081 148\n2.0\n1433 496 1171 172\n2.4\n1321 448 1234 195\n2.8\n1240 413 1281 215\n3.2\n1179 387 1316 232\n3.6\n1132 368 1344 248\n4.0\n1095 353 1365 261\n\nCatalyst Loading: High: 0.33 mL\nR1/R2 = 2/1\nTemperature = 85oC\n\nTime, h\nR1\nR2\nA\nC\n0.0\n0.4\n0.8\n1.2\n372 1090 149\n1.6\n286 1214 183\n2.0\n233 1295 214\n2.4\n198 1350 243\n2.8\n173 1390 268\n3.2\n155 1421 291\n3.6\n142 1445 311\n4.0\n132 1464 328\n\nCOMPARISON OF CONVERSIONS AND YIELDS AFTER 4.0 HOURS IN THE REACTOR\n\nR1/R2\nTEMP, oC\nCAT, mL\nMOLS A/R2\nMOLS C/R2 TOTAL YIELD\nMOLS A/C\n1:1\n80.0\n0.22\n0.3116\n0.0927\n40.43%\n3.361\n\n85.0\n0.22\n0.3009\n0.1633\n46.42%\n1.843\n\n90.0\n0.22\n0.2825\n0.2600\n54.25%\n1.087\n2:1\n80.0\n0.22\n0.6678\n0.0907\n75.85%\n7.363\n\n85.0\n0.22\n0.6862\n0.1472\n83.34%\n4.662\n\n90.0\n0.22\n0.6847\n0.2177\n90.24%\n3.145\n3:1\n80.0\n0.22\n0.8321\n0.0746\n90.67%\n11.154\n\n85.0\n0.22\n0.8490\n0.1109\n95.99%\n7.656\n\n90.0\n0.22\n0.8382\n0.1512\n98.94%\n5.544\n2:1\n85.0\n0.11\n0.6494\n0.1230\n77.24%\n5.280\n2:1\n85.0\n0.33\n0.6958\n0.1559\n85.22%\n4.463\n\nrevised 2006 Aug 16"
    },
    {
      "category": "Resource",
      "title": "memo_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/9bf41cdd927be9a61c6e0aa723fd0799_memo_3.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 3\nDIVERSIFIED CHEMICAL PRODUCTS\nSpecialty Products Division\nCambridge MA 02139\n\nTO:\nU. R. Engineer\nFROM:\nHyung Ko Op\nDATE:\n2006 Sep 11\nSUBJECT: Analysis of Kinetic Experiments for Reaction 1\n\nPer your request, I applied the techniques of Fogler (p. 209) to analyze the kinetic data we\nobtained from Blacksburg. I assumed reaction rate expressions of the form: rate = k ∗ R1αR2β. I\nused the data from the eleven experiments to regress values for α, β, and k for each reaction\n(formation of A and C). The numerical results for the fitted parameters are given below. The\nvalues for the parameters showed large variations from experiment to experiment. No attempt\nwas made to correlate the kinetic rate constant, k, to the temperature because the values obtained\nseemed clearly unrelated to the temperature.\n\nREACTION IA (FORMATION OF A):\nR1/R2\nTemp., oC\nCAT, mL\nk\nα\nβ\nerr2/N\n1:1\n80.0\n0.22\n1.64e+00\n2.689\n-4.690\n0.027\n\n85.0\n0.22\n1.36e+00\n2.374\n-3.697\n0.021\n\n90.0\n0.22\n1.29e+00\n2.211\n-3.041\n0.018\n2:1\n80.0\n0.22\n2.12e-11\n25.780\n-18.454\n0.011\n\n85.0\n0.22\n2.01e+02\n-5.557\n5.397\n0.139\n\n90.0\n0.22\n7.10e+02\n-6.475\n5.174\n0.051\n3:1\n80.0\n0.22\n1.13e+05\n-7.992\n3.767\n0.047\n\n85.0\n0.22\n1.01e+03\n-4.516\n2.256\n0.033\n\n90.0\n0.22\n1.65e+02\n-3.066\n1.619\n0.025\n2:1\n85.0\n0.11\n1.99e-14\n33.978\n-24.781\n0.045\n\n85.0\n0.33\n1.20e+04\n-9.528\n7.382\n0.087\n\nREACTION IB (FORMATION OF C):\nR1/R2\nTemp., oC\nCAT, mL\nk\nα\nβ\nerr2/N\n1:1\n80.0\n0.22\n1.06e-01\n0.614\n-1.440\n0.048\n\n85.0\n0.22\n1.71e-01\n0.484\n-1.141\n0.031\n\n90.0\n0.22\n3.22e-01\n0.573\n-1.336\n0.019\n2:1\n80.0\n0.22\n1.43e-06\n11.392\n-8.357\n0.019\n\n85.0\n0.22\n4.50e-02\n1.024\n-0.162\n0.044\n\n90.0\n0.22\n2.14e+01\n-4.697\n3.275\n0.026\n3:1\n80.0\n0.22\n4.16e+00\n-2.895\n1.499\n0.041\n\n85.0\n0.22\n7.92e+00\n-2.901\n1.299\n0.028\n\n90.0\n0.22\n2.46e+01\n-3.277\n1.221\n0.031\n2:1\n85.0\n0.11\n1.04e-09\n19.983\n-14.995\n0.015\n\n85.0\n0.33\n2.12e+00\n-2.848\n2.243\n0.035\n\nrevised 2006 Aug 16"
    },
    {
      "category": "Resource",
      "title": "memo_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/56c1ffdf486626f7f7ef0e9759c31c0e_memo_4.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 4\nDIVERSIFIED CHEMICAL PRODUCTS\nResearch and Product Development Division\nBlacksburg VA\n\nTO:\nU. R. Engineer\nFROM:\nPhil D. Chemist\nDATE:\n2006 Sep 14\nSUBJECT: Kinetic Model for Reaction 1\n\nA detailed study of possible kinetic models for Reactions IA and IB has been underway for some\ntime now at the Research Center. Evidence from experiments such as the one carried out just\nrecently at your request has suggested that the overall reactions:\n\n2R1 + R2 → A\nR1 + R2 → C + H2\n\nare not elementary. A number of possible reaction mechanisms were proposed by the organic\nchemists here in Blacksburg. Kinetic models were developed and tested using experimental data\nsimilar to that which we collected for you.\n\nThe following mechanism was determined to best describe the data:\n\nR1 + R2 → I1 (Pt catalyzed)\n(1)\nR1 + I1 → A\n(2)\nI1 → C + H2\n(3)\nC + I1 ↔ I2 (reversible)\n(4)\nPt → Pt∗\n(5)\n\nThese reactions are elementary and follow the \"expected\" mechanisms with the exception of the\ncatalyzed reaction (1). C further reacts to form an unwanted byproduct I2 in a reversible reaction\n(4). The catalyst deactivates during the course of the reaction (5). The molecular structures of I1\nand I2 are shown in Figure 1.\n\nKinetic rate constants were determined from the data. With the help of Art Jockey's Technical\nServices Group, a computer simulation program was developed to simulate the reaction network\nnumerically. This program will allow you to analyze various operating strategies and design the\nfirst reactor.\n\nrevised 2006 Aug 16\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 4\n\nFigure 1: Molecular Structure for I1 and I2\nrevised 2006 Aug 16"
    },
    {
      "category": "Resource",
      "title": "memo_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/da6bfa6d2496408604519defc3e1deee_memo_5.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 5\nDIVERSIFIED CHEMICAL PRODUCTS\nSpecialty Products Division\nCambridge MA\n\nTO:\nU. R. Engineer\nFROM:\nA. I. Jockey (Technical Services Group)\nDATE:\n2006 Sep 15\nSUBJECT: Instructions for using ABACUSS II on MIT server\n\nThe attached document explains how to access ABACUSS II (Advanced Batch And Continuous\nUnsteady State Simulator). ABACUSS II will be used to simulate the distillation tasks and the\nfirst reaction task during the design of the Lucretex monomer process. You will be using\nABACUSS II's dynamic simulation features. Dynamic simulation is the use of mathematical\nmodels to predict the time dependent or dynamic behavior of a chemical process (as opposed to\nsteady-state simulation, which is only concerned with predicting the steady-state of a process).\n\nIn addition, you may find the following points helpful:\n- Save your work frequently; the editor has been observed to crash during some delete/cut\noperations.\n- Error messages from the compiler can be accurate without being revealing. You may have to\nchange your assumption about what might be wrong to interpret the message correctly. For\nexample, a coding error in line n-1 can cause a reported error in line n; line n may be entirely\ncorrect, of itself, but the compiler interprets it in the context of line n-1.\n- Most ABACUSS statements reside inside the BLOCKS. However, INCLUDE statements\nare an exception.\n- BLOCKS require END statements. Many of the sections within blocks do not require END\nstatements, but some do. Among others, the WITHIN structure, and the RESET and\nREINITIAL sections in the SIMULATION block, require END statements.\n- Remember to distinguish = and :=.\n- Distinguish among different types of names:\no file names - used by the computer operating system to open and save files. A single\nfile such as PhysicalProperties.ABACUSS contains many MODELs.\no model names - identify general MODELs that contain the parameters, variables, and\nequations to describe some operation or relationship. MODEL IdealGasEOS contains\nthe ideal gas equation.\no unit names - a UNIT is a particular instance of a MODEL, so that the same MODEL\nmay be used for multiple purposes in a simulation. The pathnames by which\nvariables are identified comprise these UNIT names, not the MODEL names.\no simulation names - the results of a SIMULATION are written in output files that bear\nthe name given to that particular simulation.\n- When you have run a simulation and wish to modify your file for a different case, execute\n\"remove from translation\" to avoid name conflicts with the previous run.\n- Desirable as it might seem, no new quantities may be introduced in a SIMULATION block.\nThis means that you may not, for example, compute the ratio of two reaction products from\nyour results. Any such quantity to be calculated must be written into a MODEL and then\nDISPLAYed in the SIMULATION.\nrevised 2006 Aug 24"
    },
    {
      "category": "Resource",
      "title": "memo_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/0744226734e6928bb213a8ae079abe24_memo_6.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 6\nDIVERSIFIED CHEMICAL PRODUCTS\nSpecialty Products Division\nCambridge MA\n\nTO:\nU. R. Engineer\nFROM:\nA. I. Jockey (Technical Services Group)\nDATE:\n2006 Sep 21\nSUBJECT: Instructions for using the ABACUSS batch distillation model on MIT server\n\nTutorial Example: First Distillation Task in the ICE Process\n\nThis example uses a more complex model to simulate a separation similar to the first distillation\ntask in the ICE process. The model is of the flowsheet shown in Figure 1, which contains a\nbatch rectifier and a number of accumulators to collect overhead cuts. The number of\naccumulators can be changed by changing the value of an integer parameter in the flowsheet\nmodel.\n\nStart up ABACUSS, if it is not already running.\n\nand in File menu Open for Edit the file Distillation1.ABACUSS. We strongly suggest that you\nread through this file and understand it before proceeding. This file contains the following\nblocks:\n\n- a DECLARE block introducing a stream type for mole balance only flowsheets.\n- a MODEL block BatchRectifier implementing the dynamic model for a batch rectifier\ndiscussed in class. Note that because the file PhysicalProperties.ABACUSS is included, the\nWilson activity coefficient model will be used to predict VLE, in particular the azeotropes\nthat constrain the separation.\n- a MODEL block Splitter for a static stream splitter that can be used in particular to direct the\ndistillate to any one of a number of accumulators.\n- a MODEL block Accumulator that models the dynamic accumulation of material in an\naccumulator if the distillate stream is directed towards the accumulator by the splitter.\n- a MODEL block RectifierFlowsheet that models the entire flowsheet shown in Figure 1. It\ncreates instances of BatchRectifier, Splitter, and a number of Accumulators determined by\nthe integer parameter No_Accum (two accumulators initially). The Equation section\nconnects the streams of these model instances together. Also, the number of chemical\ncomponents in the flowsheet is given, and values are specified for physical property\nparameters related to pure component vapor pressure and binary parameters for the Wilson\nmodel.\n- a SIMULATION block Distillation1 that describes a simulation uncannily close to one of the\nhomework problems.\n\nrevised 2006 Aug 16\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 6\n\nFigure 1: Flowsheet for Batch Rectifier and Associated Equipment\n\nThe functionality of the MODEL blocks in particular should be evident from reading the\ncomments in the input file and the discussion in class.\n\nClick the Update button to translate the file and then click the Execute button to execute the\nSIMULATION block Distillation1. This should take about 10 seconds. Once this is complete\nyou can bring up the plotting window and plot results such as the pot composition vs. time, the\ncolumn temperature profile at a number of different times, or the accumulator holdups vs. time.\nrevised 2006 Aug 16"
    },
    {
      "category": "Resource",
      "title": "memo_7_appendix.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/20dcd79f4dc0b8fd0222cf7c2aed755f_memo_7_appendix.pdf",
      "content": "Table 1: Pure Component Properties\nComponent Property\nValue\nUnits\nA\nBoiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Volume\nCritical Compressibility Factor\nVapor Pressure At TB\nAt 0.9*TC\nAt TC\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\nUNIQUAC Volume Parameter, r\nUNIQUAC Surface Area Parameter, q\n442.\n250.48\n653.58\n0.16103E+07\n0.6760\n0.2003\n0.10132E+06\n0.42209E+06\n0.16103E+07\n1.2824\n0.62857E+08\n0.19257\n19281.\n0.32267E+06\n0.47868E+06\n0.69720E+06\n0.17045\n11.8022\n9.908\nK\nK\nN/SQM\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\nE\nBoiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\ncritical Volume\nCritical Compressibility Factor\nVapor Pressure at TB\nat 0.9*TC\nat TC\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\nUNIQUAC Volume Parameter, r\nUNIQUAC Surface Area Parameter, q\n416.48\n222.43\n525.42\n0.17237E+07\n0.5401\n0.2131\n0.10132E+06\n0.52053E+06\n0.17237E+07\n1.0432\n0.45471E+08\n0.17095\n18156.\n0.27867E+06\n0.40862E+06\n0.59384E+06\n0.19278\n9.924\n8.176\nK\nK\nN/SQM\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\n\nTable 1: Pure Component Properties - contd.\nI2 Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Volume\nCritical Compressibility Factor\nVapor Pressure at TB\nat 0.9*TC\nat TC\nAcentric factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\nUNIQUAC Volume Parameter, r\nUNIQUAC Surface Area Parameter, q\n618.27\n382.72\n757.43\n0.10718E+07\n1.2749\n0.2170\n0.10132E+06\n0.33472E+06\n0.10718E+07\n0.9688\n0.60603E+08\n0.43351\n12946.\n0.47741E+06\n0.70415E+06\n0.10271E+07\n0.19934\n16.8535\n13.371\nK\nK\nN/SQM\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\nD Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Volume\nCritical Compressibility Factor\nVapor Pressure at TB\nat 0.9*TC\nat TC\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\n752.66\n398.79\n939.80\n0.10252E+07\n1.7592\n0.2308\n0.10132E+06\n0.36408E+06\n0.10252E+07\n0.7469\n0.66080E+08\n0.64668\n11567.\n0.49038E+06\n0.72412E+06\n0.10467E+07\n0.22028\nK\nK\nN/SQM\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\n\nTable 1: Pure Component Properties - contd.\nI1 Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Volume\nCritical Compressibility Factor\nVapor Pressure at TB\nat 0.9*TC\nat TC\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\n373.97\n192.33\n485.19\n0.21259E+07\n0.4169\n0.2197\n0.10132E+06\n0.68797E+06\n0.21259E+07\n0.9293\n0.40288E+08\n0.13591\n18789.\n0.24064E+06\n0.35527E+06\n0.52282E+06\n0.20362\nK\nK\nN/SQM\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\nC Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Volume\nCritical Compressibility Factor\nVapor Pressure at TB\nat 0.9*TC\nat TC\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\n336.57\n190.40\n494.01\n0.30423E+07\n0.5015\n0.3715\n0.10131E+06\n0.13574E+07\n0.30423E+07\n0.3490\n0.29323E+08\n0.13159\n15277.\n0.20487E+06\n0.33357E+06\n0.53086E+06\n0.25857\nK\nK\nN/SQM\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\n\nTable 1: Pure Component Properties - contd.\nR2 Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Volume\nCritical Compressibility Factor\nVapor Pressure at TB\nat 0.9*TC\nat TC\nAcentric factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nIdeal gas CP at 300 K\nat 500 K\nat 1000 K\nRackett equation, ZRA\n346.00\n134.33\n512.55\n0.31036E+07\n0.3775\n0.2749\n0.10132E+06\n0.14084E+07\n0.31036E+07\n0.3174\n0.29694E+08\n0.13578\n15305.\n0.15815E+06\n0.23977E+06\n0.35377E+07\n0.26156\nK\nK\nN/sqm\nCUM/KMOL\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nJ/KMOL-K\nR1 Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Compressibility Factor\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nRackett equation, ZRA\nUNIQUAC Volume Parameter, r\nUNIQUAC Surface Area Parameter, q\n370.00\n58.08\n545.\n0.57147E+07\n0.2560\n0.6300\n0.39984E+08\n0.07614\n25679.\n0.25665\n3.0198\n2.9160\nK\nK\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\n\nTable 1: Pure Component Properties - contd.\nMeOH\nBoiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Compressibility factor\nAcentric factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nRackett equation, ZRA\nUNIQUAC Volume Parameter, r\nUNIQUAC Surface Area Parameter, q\n337.80\n32.042\n512.60\n0.80959E+07\n0.2240\n0.5590\n0.35278E+08\n0.04350\n29669.\n0.23768\n1.4311\n1.4320\nK\nK\nN/sqm\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nToluene Boiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Compressibility Factor\nAcentric Factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nRackett equation, ZRA\nUNIQUAC Volume Parameter, r\nUNIQUAC Surface Area Parameter, q\n383.80\n92.141\n591.70\n0.41138E+07\n0.2640\n0.2570\n0.333201E+08\n0.11833\n18272.\n0.26498\n3.9228\n2.9680\nK\nK\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\nH2O\nBoiling Point\nMolecular Weight\nCritical Temperature\nCritical Pressure\nCritical Compressibility factor\nAcentric factor\nHeat of Vap at TB\nLiquid Mol Vol at TB\nSolubility Parameter\nRackett equation, ZRA\n373.20\n18.015\n647.30\n0.22048E+08\n0.2290\n0.3440\n0.40683E+08\n0.01964\n48146.\n0.24317\nK\nK\nN/SQM\nJ/KMOL\nCUM/KMOL\n(J/CUM)**.5\n\nTable 2: Temperature Dependent Properties\nCoef. A\nE\nI2\nD\nI1\nC\nA1\n-20884.\n1143.0\n-6784.0\n-24284.\n-657.00\n-0.13542E+06\nA2\n1400.3\n1113.1\n1941.7\n2095.6\n961.38\n1522.7\nA3\n-0.92240\n-0.67220\n-1.1714\n-1.3704\n-0.56020\n-1.4824\nA4\n0.24E-03 0.15E-03 0.26E-03 0.34E-03 0.12E-03 0.62E-03\nA5\n0.\n0.\n0.\n0.\n0.\n0.\nA6\n0.\n0.\n0.\n0.\n0.\n0.\nA7\n280.00\n280.00\n280.00\n280.00\n280.00\n280.00\nA8\n1100.0\n1100.0\n1100.0\n1100.0\n1100.0\n1100..0\nA9\n36029.\n36029.\n36029.\n36029.\n36029.\nA10\n57.226\n48.538\n88.532\n91.050\n40.822\n25.582\nA11\n1.5000\n1.5000\n1.5000\n1.5000\n1.5000\n1.5427\nB1\n160.00\n128.43\n127.31\n106.49\n115.72\n61.623\nB2\n-17059.\n-11654.\n-16097.\n-16630.\n-9833.5\n-5620.8\nB3\n0.\n0.\n0.\n0.\n0.\n0.\nB4\n0.\n0.\n0.\n0.\n0.\n0.\nB5\n-18.041\n-14.768\n-13.991\n-11.021\n-13.169\n-5.7449\nB6\n0.93E-17 0.29E-16 0.31E-17 0.71E-18 0.43E-16 0.21E-16\nB7\n6.0000\n6.0000\n6.0000\n6.0000\n6.0000\n6.0000\nB8\n532.00\n416.48\n618.27\n752.66\n373.97\n336.57\nB9\n653.58\n525.42\n757.43\n939.80\n485.19\n494.01\n\nTable 2: Temperature Dependent Properties - contd.\nCoef. R1\nR2\nH2O\nMeOH\nToluene\nA1\nA2\nA3\nA4\nA5\nA6\nA7\nA8\nA9\nA10\nA11\n-1105.3\n314.64\n-0.20319\n0.53214E-04\n0.\n0.\n300.00\n1272.8\n33256.\n8.3101\n1.5000\n-29644.\n783.51\n-0.57862\n0.17853E-03\n0.\n0.\n280.00\n1100.0\n36029.\n23.961\n1.5000\n33738.\n-7.0176\n0.27296E-01\n-0.16647E-04\n0.\n0.\n200.00\n3000.0\n33256.\n0.18978E-19\n9.2846\n21152.\n70.924\n0.25870E-01\n-0.28516E-04\n0.\n0.\n300.00\n1261.8\n33256.\n0.37813E-01\n2.2014\n-24355.\n512.46\n-0.27654\n0.49111E-04\n0.\n0.\n300.00\n1665.4\n33256.\n13.965\n1.5000\nB1\nB2\nB3\nB4\nB5\nB6\nB7\nB8\nB9\n100.41\n-8482.7\n0.\n0.43966E-02\n-11.435\n0.13959E-16\n6.0000\n318.00\n545.00\n58.959\n-5591.9\n0.\n0.0\n-5.3538\n0.16714E-16\n6.0000\n346.00\n512.55\n65.154\n-6842.9\n0.\n0.27835E-02\n-6.1364\n0.33117E-17\n6.0000\n319.27\n647.30\n58.710\n-6364.7\n0.\n-0.23901E-02\n-4.7344\n0.20888E-16\n6.0000\n288.67\n512.60\n71.277\n-6413.3\n0.\n0.41663E-02\n-7.5054\n0.54200E-17\n6.0000\n318.72\n591.70\n\nTable 3: Binary Wilson Parameters\nComponent i Component j\naij\nbij\nA\nToluene\nA\nE\nA\nR1\nA\nI2\nA\nMeOH\nA\nH2O\nA\nD\nA\nI1\nA\nC\nToluene\nE\nToluene\nR1\nToluene\nI2\nToluene\nMeOH\nToluene\nH2O\nToluene\nD\nToluene\nI1\nToluene\nC\nToluene\nA\nE\nA\nR1\nA\nI2\nA\nMeOH\nA\nH2O\nA\nD\nA\nI1\nA\nC\nA\nE\nToluene\nR1\nToluene\nI2\nToluene\nMeOH\nToluene\nH2O\nToluene\nD\nToluene\nI1\nToluene\nC\nToluene\n1.625\n1.226\n-182.6\n0.2196\n1.079\n0.06673\n-0.5559\n-0.0520\n1.558\n-4.377\n-0.1479\n2.994\n-2.082\n0.8763\n-0.1774\n-0.3745\n0.4545\n1.4980\n3.1440\n-1.1440\n-0.7929\n1.581\n4.567\n0.9163\n-0.5263\n-2087\n-265.5\n-1134\n38.64\n-1306\n-80.24\n-2937\n168.5\n-1256.7\n865.10\n-91.69\n-503.7\n82.62\n-672.7\n-236.9\n-3440\n-25.53\n-801.4\n-265.8\n-3915\n-118.064\n-172.32\n\nTable 3: Binary Wilson Parameters - contd.\nComponent i Component j\naij\nbij\nE\nR1\nE\nI2\nE\nMeOH\nE\nH2O\nE\nD\nE\nI1\nE\nC\nR1\nI2\nR1\nMeOH\nR1\nH2O\nR1\nD\nR1\nI1\nR1\nC\nI2\nMeOH\nI2\nH2O\nR1\nE\nI2\nE\nMeOH\nE\nH2O\nE\nD\nE\nI1\nE\nC\nE\nI2\nR1\nMeOH\nR1\nH2O\nR1\nD\nR1\nI1\nR1\nC\nR1\nMeOH\nI2\nH2O\nI2\n0.9424\n-1.2550\n-25.24\n-1.3440\n1.1160\n-6.273\n-0.5128\n-179.4\n-2.175\n-4.048\n0.9573\n2.2540\n0.3904\n-0.3265\n-2.6976\n0.6033\n1.313\n2.877\n-3.092\n1.491\n1.9570\n1.6720\n131.6\n-441.7\n-1.655\n-122.4\n-1411\n61.36\n-2.175\n-4.048\n-23.51\n-2886\n-370.7\n277.1\n342.36\n-573.14\n-21.11\n-2815\n-196.98\n-3513\n-239.6\n\nTable 3: Binary Wilson Parameters - contd.\nComponent i Component j\naij\nbij\nI2\nD\nI2\nI1\nI2\nC\nMeOH\nH2O\nMeOH\nD\nMeOH\nI1\nMeOH\nC\nH2O\nD\nH2O\nI1\nH2O\nC\nD\nI2\nI1\nI2\nC\nI2\nH2O\nMeOH\nD\nMeOH\nI1\nMeOH\nC\nMeOH\nD\nH2O\nI1\nH2O\nC\nH2O\n-2.030\n0.049\n1.845\n2.669\n13.55\n3.788\n-0.022\n-5.526\n807.62\n-39.55\n-160.4\n-3136\n-5112.68\n-1603.07\n72.18\n-5702"
    },
    {
      "category": "Resource",
      "title": "memo_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/05d1a7dd8fe3a4e08e442b76bcff0a0c_memo_7.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 7\nDIVERSIFIED CHEMICAL PRODUCTS\nResearch and Product Development Division\nBlacksburg VA\n\nTO:\nU. R. Engineer\nFROM:\nPhil D. Chemist\nDATE:\n2006 Sep 22\nSUBJECT: Physical Property Data for Lucretex Components\n\nThis memo provides physical property data for all the components in the case-study. Table 1\ncontains pure-component property values.\n\nModels for Temperature-Dependent Pure-Component Properties (see Table 2)\n\nIdeal Gas Heat Capacity (J kmol-1 K-1):\n\np,ig\nA\nC\nA\nA T\nA T\nA T\nA T\nA T\nA\nT\nA\nA\nA T\nT\nA\n=\n+\n+\n+\n+\n+\n≤\n≤\n=\n+\n<\n\nExtended-Range Antoine Equation for Vapor Pressure (N m-2):\n\nB\ns\nB\nln P\nB\nB T\nB lnT\nB T\nB\nT\nB\nT\nB\n=\n+\n+\n+\n+\n≤\n≤\n+\n\nBinary Wilson Model for Activity Coefficients (see Table 3)\nThe liquid interactions between components i and j are represented by the Wilson liquid\nsolution model in the following form:\n\nji\nji\nj\nij\nij\nb\nn\na\nB\nT\ni\ni\nj 1\nb\nn\na\nT\ni\nj\nj 1\nln\nB\ne\nx\nB\nln\ne\nx\n+\n-\n=\n+\n=\nγ = -\n-\n⎡\n⎤\n=\n⎢\n⎥\n⎢\n⎥\n⎣\n⎦\n∑\n∑\nj\n\nwhere γi denotes the activity coefficient of component i, aij and bij represent binary interaction\nparameters between component pairs (i, j), and T denotes the temperature (in kelvins) of the\nsystem. All available binary interaction parameters are shown in Table 3.\nrevised 2006 Aug 24"
    },
    {
      "category": "Resource",
      "title": "memo_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-490-integrated-chemical-engineering-i-fall-2006/14c230596b45cfde1153bc532b599396_memo_8.pdf",
      "content": "10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 8\nDIVERSIFIED CHEMICAL PRODUCTS\nSpecialty Products Division\nCambridge MA\n\nTO:\nU. R. Engineer\nFROM:\nI. M. Supervisor\nDATE:\n2006 Sep 29\nSUBJECT: Lucretex Batch Process Development Project Description and Goals\n\nAs you know, your objective is to produce 280,000 lbs of Lucretex monomer at our Cambridge\nplant at minimum cost and minimum campaign time. We are anxious to test market the polymer\nas soon as possible. Please keep in mind the competing Cal Tech Industries estimate of 25 days\nat a cost of $9/lb. Your final design should be able to improve on this estimate.\n\nI have collected essential economic information required for you to estimate the cost of your\nproposed design. In addition, I have summarized the process information that has been\ndeveloped by you and our associates at Research and Product Development in Blacksburg.\nFinally, I have specified a number of design constraints that must be imposed in order to assure\nsafe and feasible operation.\n\nA number of equipment units have been made available for your use in the plant. You may select\nthe units you need from this inventory.\n\nSummary of Process Information:\n\n1. Reaction I: Use ABACUSS II (model ICE_Reactor1_Model.ABACUSS) to simulate the\noperation of Reaction I.\n\n2. Reaction II: Reaction II is 1st order in methanol concentration and 1st order in the\nconcentration of C.\n\nStoichiometry: MeOH + C → E\n\nRate expression:\nE\nMeOH\nC\ndC\nkC\nC\ndt =\n\nTime of batch reaction (well-mixed):\n(\n)\n(\n)\nC\nMo\nCo\nC\nCo\nMo\nCo\nMo\nC C\nln C\nC\nC\nC\nt\nk C\nC\n-\n+\n=\n-\n\nwhere:\n\nCCo, CC are initial and final concentrations of C\nCMo, CM are initial and final concentrations of MeOH\nk is the kinetic rate constant = 0.9 L mol-1 h-1\n\n3. Reaction III: Reaction is 2nd order in concentration of E:\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 8\nRate expression:\nH O\nE\nE\ndC\n1 dC\nkC\ndt\n2 dt\n=\n= -\n\nTime of batch reaction (well-mixed):\nE\nEo\n2kt\nC\nC\n-\n=\n\nArrhenius Expression:\na\nE\nRT\no\nk\nk e\n-\n=\n\nko = 9.14215·1011 L mol-1 h-1, Ea = 83,354 J mol-1\n\n4. Distillations: Use ABACUSS II to simulate the batch distillation tasks.\n\nEquipment Inventory:\n\nUnit type\nVolume (gal) Usage cost ($/h)\nReactors\n\nUnit type\n# trays\nVolume (gal)\nVapor Rate\nUsage cost ($/h)\n\n(kmol/h)\n\nColumns\n\nCombination\nreactor/column\n\nIntermediate Storage is available in any total amount but only in increments of 250 gallons.\nStorage costs $5 / h (250 gal increment). Other items of equipment may be made available\non negotiation with management.\n\nCost of Raw Materials:\nMaterial\nCost ($/unit)\nR1\n4.25 /kg\nR2\n9.2 /kg\nToluene\n1.52 /kg\nPt catalyst\n55 /L slurry\nMeOH\n1.34 /kg\nH2O\n0.015 /kg\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 8\nCost of Waste Treatment:\n\nWastes\nSource\nCost ($/kg)\nSolids (Pt catalyst, I2, A)\nBottoms Distillation II\n14.2\nAqueous (MeOH, H2O, Toluene, E)\nOverheads Distillation III\n2.3\nOrganic\nOverheads Distillation I\nCredit\n\nNote the that overheads of distillation task I is organic waste, and the waste treatment facility can\nrecover 80% by mass of the toluene, methanol, and R1 in this stream as pure solvent and reagent\nfor recycle. The waste treatment facility will credit your design with 40% of the raw material\ncost for the mass it can recover.\n\nCost of Utilities ($/batch):\n\n1. Reaction I heatup:\n\n(\n)\nheat\ncap\nfeed\nfinal\nN\nN\nT\n25 V\n-\n\nwhere\n\nNheat [$ kJ-1] = 5.16·10-6\nNcap [kJ L-1 oC-1] = 4.18\nTfeed [oC] is the temperature the reactor contents are preheated to\nVfinal [L] is the volume of the reaction mass at the end of the reaction step\n\n2. Reaction I condenser cooling:\n\ncool\nc,max rxn\nN\nQ\nt\n\nwhere\n\nNcool [$ kJ-1] = 8.1·10-7\nQc,max [kJ h-1] is the maximum condenser duty required during reaction\ntrxn [h] is the duration of the reaction step\n\n3. Reaction I cooldown:\n\n(\n)\ncool\ncap\nfinal\nfinal\nN\nN\nT\n65 V\n-\n\nwhere\n\nTfinal [oC] is the temperature of the reactor contents and the end of reaction\n\n4. Column boilup/condensing:\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 8\ncond\ndist\nboil\ndist\nN\nvt\nN\nvt\n\nwhere\n\nNcond [$ kmol-1] = 0.0382\nNboil [$ kmol-1] = 0.135\nv [kmol h-1] is the vapor rate in the column\ntdist [h] is the time over which the utility is used\n\n5. Vacuum:\n\n(\n)\nvac\nvac\navail\nN\nln\nt\nt\nP\n+\n\nwhere\n\nNvac [$ h-1] = 152\nP [mmHg] is the absolute pressure in the column during the vacuum step\ntvac [h] is the time period over which vacuum is applied\ntavail [h] = 0.3\n\nAssumptions and Process Constraints:\n\n1. Reaction I:\n(a) Reaction solvation. The ratio of the total mass of R2 fed to the reactor over the entire\ncycle to the volume of toluene initially charged to the reactor at the preheat temperature\nshould not exceed 0.83 kg L-1. Note that at least the volume of toluene indicated by this\ncriterion must be added in the initial charge to the reactor.\n\n(b) Consumption of key reactant. The ratio of the mass of R2 remaining in the reactor at the\nend of a cycle to the volume of toluene initially charged to the reactor should not exceed\n0.014 kg L-1.\n\n(c) Reflux cooling duty. Each reactor is constrained by the maximum cooling duty of the\noverhead condenser used to condense and reflux solvent and reagent that is boiled off\nduring the exothermic reaction. The condensers are sized in proportion to the reactor\nvessels; thus the maximum cooling duty may be expressed as 150 kJ h-1 per litre of\nreactor volume. If this constraint is exceeded at any time, solvent and reagent will be\nvented to the flare with undesirable consequences.\n\n(d) Initial reaction heat-up takes 0.5 h.\n\n(e) Post-reaction cool-down requires 0.5 h.\n\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 8\n(f) No reaction takes place during heat-up or cool-down.\n\n(g) Molar concentration of undiluted catalyst slurry is 5 mol L-1.\n\n2. Reaction II:\n(a) Reaction temperature is fixed and constant at 68 oC.\n\n(b) Conversion of C must be ≥ 0.98.\n\n(c) Assume no volume change (use a conservative estimate: the larger of the reactant volume\nor the product volume).\n\n3. Reaction III:\n(a) Feed ratio specification: The molar ratio of water to E in the charge must exceed 30.\n\n(b) Reaction temperature is constant and may not exceed 95 oC\n\n(c) Assume no volume change (use conservative estimate).\n\n(d) Assume mixture does not boil.\n\n4. Distillations I and II:\n\n(a) Lump components C, R2, I1, and R1 into R1. Use the properties of R1.\n\n(b) Lump component I2 and catalyst into I2. Use the properties of I2.\n\n(c) There is a maximum pot temperature of 140 oC. Exceeding this temperature allows\nunwanted byproduct reactions to be catalyzed. These reactions will rapidly degrade\nproduct A.\n\n(d) An initial operating period of 0.5 h is required at total reflux to bring the column to\nsteady-state before distillate can be removed. At any later time it takes the column 0.25 h\nto stabilize after any step change in reflux rate (note that this transient is not modeled by\nthe ABACUSS simulation, so that these times must be added to the computed distillation\ntime).\n\n(e) The pressure in the column may be reduced at a maximum rate of 0.4 mmHg s-1. The\ntime it takes to apply vacuum is included in the simulation time reported by ABACUSS.\n\n(f) The pressure in the column may not be reduced below 15 mmHg.\n\n(g) The second cut must be cooled before it can be transferred to reaction III. This cooling\nperiod will take 0.5 h.\n\n5. Distillation III:\nrevised 2006 Aug 24\n\n10.490\nICE Module I - Batch Process Development\nFall 2006\n\nMemo 8\n\n(a) Do not model components that are not present in the charge to the pot, nor components\nthat are present only in trace amounts. This will make the numerical solution much more\nrobust.\n\n(b) There is a purity specification on the product (A and D) from this distillation. The\nproduct should be at least 99% pure A and D on a mass basis.\n\n(c) An initial operating period of 0.5 h is required at total reflux to bring the column to\nsteady-state before distillate can be removed. At any later time it takes the column 0.25 h\nto stabilize after any step change in reflux rate (note that this transient is not modeled by\nthe ABACUSS simulation, so that these times must be added to the computed distillation\ntime).\n\n(d) The pressure in the column may be reduced at a maximum rate of 0.4 mmHg s-1. The\ntime it takes to apply vacuum is included in the simulation time reported by ABACUSS.\n\n(e) The pressure in the column may not be reduced below 15 mmHg.\n\n(f) Use the Wilson model for the liquid phase fugacity and the ideal gas equation of state for\nthe vapor phase fugacity. (In fact, water and toluene are immisicible, but the Wilson\nmodel is incapable of predicting vapor-liquid-liquid equilibria.) Neglect this inaccuracy\nin your model. All necessary physical property parameters may be found in Memo #7.\n\n6. Additional Constraints and Assumptions:\n\n(a) Transferring material between pieces of equipment will take 0.5 h. This should be taken\ninto account when conducting the analysis of the simulation.\n\n(b) Any density data that you require should be taken from the property file provided earlier\nor from standard references.\n\nrevised 2006 Aug 24"
    }
  ]
}