{
  "course_name": "Introduction to Anthropology",
  "course_description": "Through the comparative study of different cultures, anthropology explores fundamental questions about what it means to be human. It seeks to understand how culture both shapes societies, from the smallest island in the South Pacific to the largest Asian metropolis, and affects the way institutions work, from scientific laboratories to Christian mega-churches. This course will provide a framework for analyzing diverse facets of human experience such as gender, ethnicity, language, politics, economics, and art.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Social Science",
    "Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nCourse Description\n\nThrough the comparative study of different cultures, anthropology explores fundamental questions about what it means to be human. It seeks to understand how culture both shapes societies, from the smallest island in the South Pacific to the largest Asian metropolis, and affects the way institutions work, from scientific laboratories to Christian mega-churches. This course will provide a framework for analyzing diverse facets of human experience such as gender, ethnicity, language, politics, economics, and art.\n\nAttendance and Participation\n\nStudents are expected to attend all lectures and recitations. If you must be absent, alert us in advance. Any unexcused absences will affect your final grade.\n\nUse of laptops, cell phones or other devices unrelated to the class is strictly forbidden.\n\nCome prepared to discuss and answer questions about all readings. This means you must bring copies of all readings to lecture and recitation.\n\nYour grade for class participation is not calculated based on how much you speak, but rather how you contribute to a lively, useful, and sustained conversation both inside and out of class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and Participation\n\n15%\n\nCommentary papers (6 x 5% each)\n\n30%\n\nResearch papers (2 x 15% each)\n\n30%\n\nMidterm exam\n\n10%\n\nFinal exam\n\n15%\n\nRequired Texts\n\nAhearn, Laura M.\nInvitations to Love: Literacy, Love Letters, and Social Change in Nepal\n. University of Michigan Press, 2001. ISBN: 9780472067848. [Preview with\nGoogle Books\n]\n\nDowney, Greg.\nLearning Capoeira: Lessons in Cunning from an Afro-Brazilian Art\n. Oxford University Press, 2005. ISBN: 9780195176971.\n\nReference Material\n\nOxford Reference: Dictionary of Social Science",
  "files": [
    {
      "category": "Resource",
      "title": "1st Research Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-00-introduction-to-anthropology-spring-2013/40e2ae621bd57a0a6ec5fdbaddccf954_MIT21A_00S13_fstprtopic.pdf",
      "content": "21A.00\nIntroduction to Anthropology\nSpring 2013\n\n1st Research Paper Topics\n\nFor the first ethnographic research paper, you have several options. In each case, you will\ncollect qualitative data using one or more ethnographic methods (interviewing,\nparticipant observation, description of cultural artifacts...). Then write a paper of\napproximately four pages analyzing that data. Analyze your particular case comparatively\nin respect to at least one course reading, perhaps by employing a middle range concept\n(such as gender or agency) in the comparison. It is important that any interviews or\nresponses remain anonymous, so do not use real names or identifying material (you can\nidentify yourself, but you don't have to). You may find it difficult to present your\nfindings in the space of four pages, thus requiring you to synthesize some details (and/or\nprovide an appendix with additional data).\n\n(1) One of the key themes in Invitations to Love is the effect of communications\ntechnologies on social relationships--and the effect of social relationships on the way\nthose technologies are used. To explore this issue, interview someone you know\n(parent, relative, friend, classmate, etc.) about the way they use different\ncommunications mediums (letters, phone, texting, IM, email, Facebook...) to\nestablish or maintain social relationships. Are some forms of communication more\nappropriate than others for specific kinds of relationships (e.g., with parents,\nprofessors, friends, love interests...) or for specific kinds of activities? Elicit specific\nexamples (e.g., a text message, wall post...) if possible. Alternately, you may explore\nthis issue by addressing the role of a particular medium in fostering a specific kind of\nrelationship or community--but again, make sure to employ primary data.\n\n(2) Love stories are at the center of Ahearn's study of social change in contemporary\nNepal. Following her example, elicit a love story from someone you know (parent,\nrelative, friend, classmate, etc.). How does this story compare to those elicited by\nAhearn? What kinds of attitudes does your respondent convey towards particular\ncultural ideals or social expectations? What kinds of obstacles stood in the way? How\ndoes the way the narrative is structured claim or deny agency? A key to doing this\nkind of interview (and to ethnographic interviewing more generally) is asking open-\nended questions so that respondents are able to structure the story according to their\npersonal priorities or preferences.\n\n(3) Interview someone you know (parent, relative, friend, classmate, etc.) who is a non-\nnative speaker of American English residing in the U.S. about his or her linguistic\nviews, experiences, and practices. What are this person's views about the different\nlanguages s/he speaks, and when it is appropriate to use one language or the other?\nAre there things that can't be translated between the languages, or different views of\nthe self associated with using one or another language? Is speaking English liberating\nor constraining? Does this person ever consciously (or unconsciously) switch between\n\nlanguages when talking to other bilinguals? Do any \"language ideologies\" emerge\nfrom this interview? The interview need not be conducted in English.\n\n(4) Working with a parent or older relative if necessary, draw a kinship diagram of your\nown family that extends back at least to grandparents' generation (it doesn't have to\nbe complete, but do your best). Identify relatives with kinship terms from EGO's\nperspective (i.e., yours) in whatever languages are used within the family. You may\nhave to develop conventions for representing phenomena we did not cover in class\n(for starters, put an X through a deceased figure; a dotted vertical line represents\nadoption; = represents divorce...). Reflecting on your own experience, what\ncategories of kin are most important and why? What functions do different kinds of\nkin play? How does your experience of kinship (in terms of things like descent,\nmarriage, caregiving...) reflect your particular cultural background and/or historical\ncircumstances (such as migration or diaspora)? You may wish to adapt your diagram\nto better illustrate the particularly issues you want to discuss, but provide a key to\nmake it legible. Alternately you may perform this exercise with a friend, relative, or\nclassmate, diagraming his or her family back to grandparents' generation, and\ninterviewing him/her about the relevant significance of different kin relationships.\n\n(5) Kulick argues (in his both his articles on Brazil and Gapun) that gender is not an\ninnate personal attribute, but rather a set of learned qualities that are performed or\ndisplayed. Pick an arena or setting of gendered self-display to study through\nparticipant observation, interviewing, or the collection and analysis of cultural\nartifacts (a website, a magazine). Describe how people organize their activity in this\narena to conform to gender ideals, to challenge those ideals, or both. More\nspecifically, you might look at the way particularly styles of speech, communication\nor language use connect to gendered identity, for instance in an Internet forum\ndevoted to stereotypically male or female interests, or within a community that\nchallenges prevailing gender norms (like Bronies, for instance).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.00 Introduction to Anthropology\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2nd Research Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-00-introduction-to-anthropology-spring-2013/6ff5a4cde7a90780b476f0a9d00b5d78_MIT21A_00S13_sndprtopic.pdf",
      "content": "21A. 00\nIntroduction to Anthropology\nSpring 2013\n\n2nd Research Paper Topics\n\nFor the second ethnographic research paper, you have two very broad options. In either\ncase, you will collect qualitative data using one or more ethnographic methods illustrated\nin the class. This may involve a participant observation approach of taking part in an\nactivity or event (or visiting a place where an activity routinely occurs) and documenting\nit with field notes and recordings (if permissible). It could also involve \"virtual\nethnography\" of cultural practices online. Then write a paper of approximately four pages\nanalyzing your data. Analyze your particular case comparatively by employing middle\nrange concepts drawn from at least one of the course readings. You must explicitly cite at\nleast one relevant reading. Presenting your findings in the space of four pages may\nrequire you to synthesize some of primary data for the sake of brevity.\n\nYou may do this project with a partner (no more than 2 people per group) for a shared\ngrade, however the resulting paper should be at least 6 pages long, and both partners must\ncontribute equally.\n\n(1) Chose a form of expressive culture to study anthropologically. You will recall that we\ndefined expressive culture as specialized activities of manipulating symbolic forms to\nproduce absorption, create meaning, and enact identity (not necessarily in that order),\nand identified it in a variety of arenas: performance, ritual (secular and sacred), art,\nverbal art, music, body adornment (including fashion), material culture (like\narchitecture and the built environment), food... Thus you have an almost limitless\narray of possibilities. You may want to pick a form of expressive culture you know\nwell, or something you don't know anything about (yet). The challenge is to identify\nhow if creates meaning and enacts identity for people who produce and consume it.\nHow does this form of expressive culture promote social cohesion or create social\ndifference? Are there conflicting understandings or interpretations surrounding it?\n\nI have a suggestion that might be particularly timely and potentially beneficial to\npeople outside our class: In the wake of the Boston Marathon bombings, there has\nbeen an outpouring of emotion, sympathy, and support conveyed through the medium\nof expressive culture (ritual, art, music, memorials...). Using what we know about\nexpressive culture, examine how the role it plays in confronting and addressing the\naftermath of this violent, traumatic event. If there is sufficient interest, I suggest we\nmake this a group (or even class) project in the form of a website that will live on\nonce the semester is over. If you are interested in this topic, please email me so I can\ncoordinate the group project. Also, it will be imperative to begin conducting research\nimmediately since these events are unfolding rapidly.\n\n(2) Observe an instance of knowledge transmission, either formal (a class or lesson) or\ninformal (such as a club). How is the instruction organized? How do experts and\nnovices interact? What is the relationship between the transmission of knowledge and\nskill and social/cultural reproduction? What are people learning (or gaining) besides\nthe explicit object of instruction? Does the organization of instruction/pedagogy\nreflect specific cultural priorities, themes, or ideas about personhood, subjectivity, or\nauthority? You might consider a class in Brazilian music, dance\n\n, or capoeira--which\nare available at MIT and throughout the area (e.g., http://www.boston-capoeira.com).\nIn this case, does the experience reflect Downey's discussion?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.00 Introduction to Anthropology\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final study guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-00-introduction-to-anthropology-spring-2013/ab7b38d98aa8fcdc1fa981de2804fc52_MIT21A_00S13_Fnstudyg.pdf",
      "content": "21A. 00\nIntroduction to Anthropology\nSpring 2013\n\nFinal study guide\n\nThe final exam will resemble the midterm, consisting of multiple-choice and essay\nquestions in a variety of formats. The exam will focus on readings and lectures from the\nsecond half of the course. However, you may be asked to draw on major themes or\nconcepts from the first half of the course that we have continued to address (e.g., culture,\nparticipant observation, personhood, modernity, etc.). Generally speaking, you won't be\nasked to spontaneously recall or define the following key concepts, but you should know\nwhat they mean and be prepared to discuss their significance. Questions may require\nknowledge of particular ethnographic case studies, but you will not be asked about cases\nwe haven't discussed at length, and you don't need to memorize the titles of articles or\nauthors' names. You will have some latitude in selecting questions to answer.\n\nAe\nAp\ns\np\nt\nl\nh\nie\ne\nd\nti\n\nc\na\ns\nn\n\nArt\nthropology\nAu\nBaby talk r\ntoethnog\ne\nr\nCa\ngi\na\ns\np\nte\nhy\nr\n\nchamada\npoiera\n\nCol\nCommunicative competence vs. linguistic competence\nConversation analysis (preference hierarchy, assessment...)\nCultural producer\nDiscourse\nThe \"Dreaming\"\nDurkheim, Emile\nExpr\nEmbodi\nes\nment\nE\nHa\nxot\nbit\nic\nu\nis\ns\ns\nm\n\nive cultur\n\ne\nHidden\nHumanism\nL\nInt\nimi\neraction ritual\nLin\nLangua\nu\nL\ng\nge\ncu\nS\nrricu\nocial\nl\niz\nm\na\n\nudi\nu\nc\nn\n\nist\nal/\nic\nlimi\nan\nn\nthrop\nality\ntion vs. language acquisition\nMagic (vs. Science vs\nolog\n. Religion)\nMagic: principles of sim\ny\nil\n\narity and contagion\nMagic, theories of: intellectualism, functionalism, structural functionalism\nColl\nle\nect\ncti\n\nive\nve e\nrep\nffe\nresen\nrvesc\nt\ne\na\nnc\ntion\ne\n\nMalicia (cunning)\nOntology\nO\nP\nP\nl\nh\nri\na\ne\ny\ne\nn\nnt\n,\no\nf\na\no\nme\nl\nr\ni\nms\nsm\nno\n\nlogy\nPoliteness (\n\nd\nof\ny\n:\nn\nag\nami\non\nc\n/\ns\nc\no\no\nf\nmp\ninv\ne\no\nti\nl\nt\nv\nio\neme\nn; m\nn\nim\nt/r\nes\nes\nis\ntr\n/\na\nimi\nint\nt\n)\na\n\ntion; chance; vertigo\nRace\nRitual\nRoda\n, theor\n\nies of: social constructionist, biological realist\nSacr\nSalvage\ned/Pr\nanth\nofane\nropo\n\nSecrecy\nlogy\nSocialization\nS\nSocial r\nS\nol\neproduction\n(vs. encul\n\nturation vs. education)\nymb\nida\no\nrit\n\"T\nTot\ne\ne\nc\nm\nhni\n\nli\nq\nc\ny\nue\na\n(or socia\nn\ns\nt\nl\ny)\no\nhr\nth\nopol\nsol\nog\nrit\nf\ne bod\ny\nida\n\ny\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.00 Introduction to Anthropology\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Midterm study guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-00-introduction-to-anthropology-spring-2013/de9d75450fd3ea0e9585fef2e8bf9a30_MIT21A_00S13_Mdtrmstudyg.pdf",
      "content": "21A. 00\nIntroduction to Anthropology\nSpring 2013\n\nMidterm study guide\n\nThe midterm will consist of a fifty-minute, closed-book examination comprising multiple\nchoice and short answer (i.e., 3 or 4 sentences) questions. Generally speaking, you won't\nbe asked to spontaneously recall the following key concepts, but you should know what\nthey mean and recognize their anthropological significance in the context of this class.\nShort questions may require knowledge of particular ethnographic case studies (e.g., why\ndo the Wari' eat dead affines?). You will not be asked about cases we haven't discussed\nat length, and you don't need to memorize the titles of articles or authors' names, or the\nnames of anthropologists mentioned in lecture. You will have some latitude in selecting\nquestions to answer based on your own areas of strength.\n\nAnthropology--four fields\nCulture\n\"Layer-cake\" vs. \"co-evolutionary\" theory of culture\nEthnography\nParticipant Observation\nEmic vs. Etic\nHolism\nReflexivity\nCultural relativism\nSocial Evolutionism vs. Historical Particularism\nFranz Boas\nIdeology\nEthnocentrism\nMiddle range theory\nCase study\nAgency vs. structure\nSubjectivity\nPersonhood\nAffect/emotion\n\"Structure of feeling\"\nSex\nGender\nSexuality\nMasculinity/Femininity\nKinship, kinship systems, kinship diagrams\nMarriage\nArranged, Capture, and Companionate Marriage\nCross-cousin marriage (in the Junigau example)\nDescent: matrilineal, patrilineal...\nResidence: Patrilocal, Matrilocal, Neolocal\n\nAffine vs. Consanguine\nExogamy, Endogamy\nLinguistic exogamy\nCaregiving and nurturance\nNarrative vs. story\nLife crisis (and life crisis ritual)\nModernity (vs. primitive, tradition, non-modern, pre-modern, anti-modern)\nLocal/alternative/parallel modernities\nanomie\n\"Denial of coevalness\"\nModernization, Development\nMicroprocesses\nHegemony\nOtherness (or alterity)\nRomanticism\nMedia ideology\nLanguage ideology\nOrality vs. literacy\nLanguage shift, language death, language revitalization\nSpeech genre\nAutonomous vs. ideological theories of literacy\nSocial/cultural change\nSocial/cultural reproduction\nInnovation\nApprenticeship vs. education\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21A.00 Introduction to Anthropology\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}