{
  "course_name": "Introduction to Education: Understanding and Evaluating Education",
  "course_description": "This class uses K-12 classroom experiences, along with student-centered classroom activities and student-led classes, to explore issues in schools and education. Students in this course spend time each week observing pre-college math and science classes. Topics of study include design and implementation of curriculum, addressing the needs of a diversity of students, standards in math and science, student misconceptions, methods of instruction, the digital divide, teaching through different media, and student assessment.",
  "topics": [
    "Teaching and Education",
    "Curriculum and Teaching",
    "Education Policy",
    "Teaching and Education",
    "Curriculum and Teaching",
    "Education Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prequisites for this course.\n\nCourse Overview\n\nThis subject uses K-12 classroom experiences, along with student-centered classroom activities and student-led classes, to explore issues in schools and education. Students in this course spend time each week observing pre-college math and science classes. Topics of study include design and implementation of curriculum, addressing the needs of a diversity of students, standards in math and science, student misconceptions, methods of instruction, the digital divide, teaching through different media, and student assessment.\n\nParticipation\n\nIn addition to the Assignments listed in the Grading section below, students are required to participate in a multitude of ways:\n\nWeekly blog entries based on observations (6-8 total)\n\nCurrent events including weekly participation and one week leading discussion and summarizing article\n\nIn class teaching and participation\n\nDaily participation in class discussion (for full class period)\n\nGrading\n\nASSIGNMENTS\n\nPOINTS\n\nFour formal written assignments\n\nFinal project\n\nFinal portfolio\n\nTown hall presentation and participation\n\nClass participation\n\nTotal",
  "files": [
    {
      "category": "Assignment",
      "title": "Final Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/9eb3e99949b74ba04706fe22982c659d_MIT11_125s09_assn_Final_Assignment05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nFinal Assignment\n\nYou are a first year teacher. Your principal is going to observe your class for a day. You\nneed to prepare a lesson for that day of class, and set it in a context so that your principal\ncan understand how it fits in.\nAs a part of this assignment you must do the following:\n-\nDesign and teach a lesson to the class drawing upon class themes\n-\nSubmit a detailed written description of your lesson plan, along with the context\nin which it is set (target class, the place this falls in the unit, other activities and\nlessons that would be done before and after this lesson, etc.)\n-\nWrite a reflection on the lesson.\nThe lesson should be approximately 35-40 minutes long.\nFor our class you will be working on these projects in pairs. You will be teaching the\nlessons the last two to three weeks of classes. You should set your lesson in one of the\nschools that you have been observing in this semester. But you should define the school,\nclass, and subject that you are teaching and use this to justify your lesson plans. The\nprimary criteria for these lessons is how you reflect the educational themes that we\ndiscussed in class (and in your other practice teaching) this year. This is best\naccomplished by focusing on one or two themes and specifically pointing those out in a\nbrief introduction to your lesson.\nThe written part may be integrated into the final portfolio or submitted separately."
    },
    {
      "category": "Resource",
      "title": "Final Portfolio",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/fa48df7d4add59544b731335bb6f502b_MIT11_125s09_assn_Final_Portfolio06.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nFinal Portfolio\nIt is late spring of your senior year (as it very well may be for some of you), and you have\ndecided to apply for a teaching job. As part of the application process the school requests\nthat you define your teaching philosophy and back up your statement with previous work\nand experiences. Your job is to define your philosophy (describing how you would teach\nand assess students, run your classroom, etc.) citing work done from the class this\nsemester. The statement should be of a format of a piece of work that you would send\nalong to a potential employer, only this piece of work is presented online and has\nhyperlinks to previous work from this class that supports your statement. You will need\nto choose a small number (4-6) pieces of work from this semester that support your\nstatement. This should include at least two class related pieces of work and two\nobservations related pieces of work. You may also choose to integrate your reflections\nand preparation for the final lesson into this portfolio. Things you might want to\nconsider include:\n-\nthings that you have learned that would prepare you to teach or work with\nstudents in a K-12 classroom\n-\nevidence of development of or changes in your understanding of teaching and\nlearning (especially modes of teaching)\n-\nactivities which support your preferences for modes of teaching and assessment\n-\nclassroom experiences that providence evidence supporting your statement\nSince we have have done a number of hands-on activities in class during the semester,\nyou should include some mention of these in your portoflio.\nYou should create a document in your blog (or linked to from your blog) for this\nassignment that discusses these issues and points to other documents (assignments, in\nclass work, observations) in your blog. You are welcome to add additional documents to\nyour blog that reference readings from class (strongly recommended), your experiences\nin the schools, or your reflections on class work. This should be a combination of new\nwriting plus the links and references to your previous work."
    },
    {
      "category": "Resource",
      "title": "Standards Town Hall",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/ffd97f8c2d25510c3af46b3575e683b0_MIT11_125s09_cal_Standards_Town_Hall03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nStandards Town Hall\nThe City of Cambridge is considering abandoning the Massachusetts defined standards in\nfavor of locally controlled standards and assessment. You will form six groups\n(government/community, parents/students, teachers/administrators all both for and\nagainst) to debate this issue in Town Hall style.\nEach group will have 5 minutes to present their case, followed by 5 minutes of Q&A\nfrom the town representatives and audience. At the end will be an additional 10 minutes\nof discussion. You should come to the debate equipped with evidence and reasons for\nyour position. Reading some of the linked articles from the syllabus page will be a good\nplace to start.\n10 points for oral presentation and participation."
    },
    {
      "category": "Resource",
      "title": "Technologies for Learning - Velocity and Acceleration",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/d1461ce896a9d1562fd5811ebeb0d085_MIT11_125s09_cal_Week8_Physics_Lab02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nTechnologies for Learning - Velocity and Acceleration\nThe goal of this unit is to understand how different technologies and approaches can\ncontribute to the understanding of velocity and acceleration. You will be using several\ndifferent versions of the same experiment to learn first hand how these media affect the\nlearning process. As you conduct your experiments you should also be considering\nimplementation and curricular issues such as:\n-\nhow the different media could be combined to enhance student learning, and in\nwhat order you might present them\n-\nwhat time and material constraints might dictate your choice of one medium over\nanother\n-\nwhich media you would choose for different types of learners\n-\nwhat your particular learning goals are for your students.\nThe experiment that you will be doing is a classic physics experiment in which you roll a\ncart down an inclined plane. In this experiment you will investigate how the angle of the\ninclined plane affects the velocity and acceleration of the cart. Specifically, you will be\nanswering the following questions:\n-\nHow does the angle of the inclined plane affect the distance that the cart travels\nonce it leaves the plane?\n-\nWhat happens to the velocity and acceleration of the cart as it proceeds down the\nplane and then onto the floor?\n-\nHow does friction affect the outcome of the experiment?\n-\nWhere does the cart hit maximum velocity and acceleration? What factors\ninfluence the velocity and acceleration?\nAt the end of each experiment you should be able to describe a theory that explains the\nvelocity and acceleration of the cart as it proceeds down the ramp, how these are affected\nby the angle of inclination and predicts the distance that the cart travels after it leaves the\nramp.\nThe four approaches that we will be using are:\n1. Rolling a cart down an inclined plane. You will measure velocity and acceleration\nusing a stopwatch and a ruler.\n2. Rolling a cart down an inclined plane. You will measure velocity and acceleration\nusing the sonic ranger that continuously outputs data to the computer.\n3. Using the Explore Learning simulations to simulate rolling a cart down an\ninclined plane.\n4. Designing your own experiment based on Matchbox cars and track.\nInstructions for using the sonic ranger, the Interactive Physics program and the Stella\nmodules are provided here.\n\nSonic Ranger\nFollow the instructions for the Motion Sensor. You can find the instructions here for the\nMotion Sensor and here for the USB Link.\nExplore Learning Simulations\nThere are three simulations at the Explore Learning site that deal with velocity and\nacceleration that have been selected for this activity (requires Shockwave). They are:\n-\nRoller Coaster Physics\n-\nInclined Plane\n-\nAnts on a Slant\nThese, along with instructions can be found on the class Explore Learning Page.\nYou may also try these two free simulations (require Java):\n-\nJersey Cow\n-\nInclined Plane\nNon-Electronic Labs\nIn addition to the two electronic labs (simulation and probes) there are two versions of\nthe lab that are to be conducted without technology. The first is simply timing a cart\nrolling down the inclined plane at different angles to compute velocity and acceleration.\nThe second provides you with track and matchbox cars and asks you to design your own\nexperiment with these same learning goals."
    },
    {
      "category": "Resource",
      "title": "Activity 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/c516048b20785913c3310afbba6db342_MIT11_125s09_cal_activity01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nActivity 1\nBreak up into groups of 8-10 students. Within those groups break up into pairs. Each pair\nwill rotate through the role of teacher, while the rest of the group is students. Teachers\nshould pick an academic topic to teach such as:\n-\nMultiplication of Fractions\n-\nProbability\n-\nVelocity and Acceleration\n-\nSimple Genetic Crosses\n-\nMitosis\n-\nOptics\nEach pair of teachers should prepare to teach the topic for 10-15 minutes. The catch is\nthat you aren't allowed to use any words, either written or oral (with one exception - you\nare allowed to very briefly explain the context for the activity, i.e. what grade level and\nwhere in the unit this falls).\nAs you are teaching and learning, consider what methods of communication people are\nusing, how effective you find the methods of communication, and how you can tell\nwhether your students or classmates are understanding."
    },
    {
      "category": "Assignment",
      "title": "Assignment 1 - MIT Observation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/a4484f4539a71b583382bfb42f34eafa_MIT11_125s09_assn_Assignment01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment 1 - MIT Observation\nAttend a class that you have taken at MIT. Sit in the class and do \"an observation.\" Take\nnotes on what is going on during class. Focus on certain aspects of the class, or certain\npeople in the class. What are they doing? What are your indications that they are or are\nnot paying attention or comprehending what is going on in class?\nAnalyze what you think the sources of the behavior are (on both the part of students and\nteachers) in a paper of five pages. You will also be responsible for reviewing other\npeople's work."
    },
    {
      "category": "Assignment",
      "title": "Assignment 2 - Misconceptions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/5ef326ae3efed379d8ed11bd734b419a_MIT11_125s09_assn_Assignment02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment 2 - Misconceptions\nThink of your own field of study. What misconceptions do high school/middle school\nstudents have in this field? Pick one or two specific misconceptions that have been\ndiscussed in the literature and in a paper of five pages write about:\n-\nWhy these misconceptions persist.\n-\nWhy they should be remediated.\n-\nSuggest possible strategies for remediation."
    },
    {
      "category": "Assignment",
      "title": "Assignment 3: Reflection of Formative Assessment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/226071036079316e10865c4dea706ad2_MIT11_125s09_assn_Assignment03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment 3: Reflection of Formative Assessment\n\nDelving Deeper into Differentiated Instruction\n\nThis paper provides an opportunity for you to delve deeper into some of the\npractical and theoretical considerations around differentiated instruction. You will\nneed to take a position on one perspective in differentiated instruction and back\nup that position with good arguments, some (limited) research and experience\n(from your observations and experience). There are two options for the paper\nthat we will discuss in class.\n\n1) Pick a particular method for developing and implementing differentiated\ninstruction. This method can be used to address any particular heterogeneity\nthat you would like, and is likely to be drawn from the in-class jigsaw that we\nconducted. Thinking about that method take a position on the benefits of this\nmethod and what its pros and cons are. Back up that position with information\nfrom the reading, as well as additional information that you can find either from\npractice or research. Really think through your argument and take a clear\nposition.\n\n2) Pick a particular student population (e.g., dyslexic, deaf, new immigrants,\ndrop-outs, autistic, etc), identify an area of contention (e.g., bilingual education vs\nimmersion; cost of special education) and take a position on the issue. Similar\nto the previous option, you will need to do some research (likely a bit more in this\ncase) and develop a clear concise argument.\nThe paper should be 5 pages in length."
    },
    {
      "category": "Assignment",
      "title": "Assignment 4: Comparison of Media",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/1aa5f9bb57ae6455b5892c43a614297c_MIT11_125s09_assn_Assignment04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment 4: Comparison of Media\nYou are an educational consultant that has been hired by a school board to design the new\n\"ramp and cart\" lab for a school district. Given what you have learned through\nconducting the experiments in class you must write a letter in which you specify and\ndefend how teachers in the school should perform this experiment. You might want to\ninclude information about\n-\nHow the media would apply to different types of learners\n-\nHow the media helped build understanding about physical concepts and\nexperimental design\n-\nHow it addresses core FITness concepts\n-\nTime taken to perform experiments\n-\nEase of conducting the experiments and training teachers\n-\nCost of purchasing material\nThe letter should be five pages in length."
    },
    {
      "category": "Assignment",
      "title": "Assignments for 11.125",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-125-introduction-to-education-understanding-and-evaluating-education-spring-2009/874a65540ea213320de628ff847ac727_MIT11_125s09_assn_Assignments_Overview07.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.125 Introduction to Education: Understanding and Evaluating Education\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignments for 11.125 take several different forms. The assignments for this semester\nwill include:\n-\nFour Formal Written Assignments of 10 points each\n-\nFinal Project Worth 15 points for Written and Presentation Portions\n-\nThe Final Portfolio worth 20 points total (10 for work cited and 10 for new\nportfolio piece)\n-\nTown Hall presentation and participation (10 points)\n-\nClass Participation 25 points including\no Weekly blog entries based on observations (6-8 total)\no Current events including weekly participation and one week leading\ndiscussion and summarizing article\no In class teaching and participation\no Daily participation in class discussion (for full class period)\nTotal = 110 Points"
    }
  ]
}