{
  "course_name": "Introduction to Photography",
  "course_description": "This course combines practical instruction, field trips, group discussions, and individual reviews intended to foster a critical awareness of how images in our culture are produced and constructed. Student-initiated term projects are at the core of this exploration of the relationship of image to language and issues of interpretation and personal history. Besides, this course also offers practical instruction in basic black and white techniques, digital imaging, fundamentals of camera operation, lighting, film exposure, development and printing. Course provides opportunity for continued exploration.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Photography",
    "Fine Arts",
    "Visual Arts",
    "Photography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 session / week, 3 hours / session\n\nClass Components\n\nProduction\n\nEach student works on a self-initiated project or group project during this time in the darkroom or computer lab; field work is possible and must be presented in the following individual or class review; production is generally two weeks before midterm and final reviews.\n\nTalk\n\nEach student is required to give a 10-15 minute presentation on one artist/photographer listed.\n\nIndividual Review\n\nPrearranged meeting to discuss student projects in further detail with Instructor; 15-minutes once a week.\n\nClass Review\n\nProjects are continuously presented in a critical forum.\n\nFinal Class Review\n\nProject must be completed and installed, exhibition situation.\n\nTalk Topics & Potential Artists\n\nCandida Hofer, Duane Michals, Andy Warhol, Alfredo Jarr, James Nachtwey, Cindy Sherman, John Gossage, Joel Sternfeld, Lewis Hine, Robert Frank, Richard Misrach, Michiko Kon, Simon Attie, August Sander, Dorothea Lange.\n\nCalendar\n\nWeek #\n\nTopics\n\nEvents\n\nCourse Philosophy, Introduction to the facilities etc.\n\nTerm Assignment: \"The same again differently\"\n\nDarkroom Orientation\n\nAnne Cahill, Nikon Inc., Technical Representative (Come prepared with questions regarding equipment use)\n\nDarkroom Orientation\n\nClass Review\n\nYvonne Rainer, \"Out of a Corner of the Sixties\"\n\nIntroduction to Digital Imaging (Dan van Roekel) Workshop in 3 groups, Individual Reviews per sign-up schedule\n\nProduction\n\nWorkshop I (Aaron Wittkamper and Aaron Malnarick)\n\nIndividual Reviews\n\nPaul Messier, Guest Lecturer on Color Photography and Processes\n\nClass Review (Last class review before midterm! Please pin-up prior to class)\n\nProduction and Lighting Workshop with Dan van Roekel\n\nProduction\n\nMidterm Review\n\nClass Review\n\nPhotography in the Museum: Metropolitan Museum of Art, NYC\n\nClass Review\n\nIntroduction to local art venues: Bill Arning, Curator, MIT List Center\n\nWorkshop II\n\nClass Review\n\nProduction\n\nIndividual Reviews\n\nCritique (Last class review! Address all important issues!)\n\nProduction\n\nProduction\n\nFinal Review",
  "files": [
    {
      "category": "Resource",
      "title": "alanalafferty.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/bcf37b09bcf19f9fe7be12542ceb4dca_alanalafferty.pdf",
      "content": "Alana Lafferty\n\nProject Description:\nMy book explores the loss of innocence through the use of Barbie dolls, toy soldiers, and\nreal people.\nexplore specific large ideas related to humanity.\nsimple with a black rectangle in the center and a Band-aid.\nsticker that reads \"From the Library of Alana Hope Lafferty\" with a teddy bear and a pile\nof books.\nThe individual images\nThe project is a dark satire of modern society.\nThe cover, which is not shown, is\nThe inside cover contains a"
    },
    {
      "category": "Resource",
      "title": "andrewcarvey.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/70d578d1b2467a30eb15945b9d0bab9a_andrewcarvey.pdf",
      "content": "Andrew Carvey\n\nProject Description:\nFor my final photo project, I photographed patterns and structures which occurred in\nnature.\nwhich compose the overall item, but are\nusually overlooked during a normal viewing.\ncaptured in each photo eventually made even the simplest object appear amazingly\nintricate.\non item revealed that the once mundane item\nbecame interesting and the merely odd quickly became mind boggling.\nExamining nature in greater depth revealed a new perspective on what was originally\nseen as ordinary.\nemerge, bringing a new level of detail to be scrutinized.\ndiscovered structure, a new, captivating, and mysterious image was revealed.\nEmbedded among more recognizable details, my images were cropped into a photo\nbook, revealing the now foreign structures. These images are digital representations of\nwhat one would see looking through my book.\nI focused on the close up details\nPaying close attention to the fine detail\nDiving further into the comm\nWith this new view, unrecognizable patterns and structures began to\nViewing only the newly"
    },
    {
      "category": "Resource",
      "title": "charissemassay.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/f84cdc3fdb8738980007a1d176a5e226_charissemassay.pdf",
      "content": "Charisse Massay"
    },
    {
      "category": "Resource",
      "title": "jonbraddock.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/98300f0a43d628ca6202d366e20b126c_jonbraddock.pdf",
      "content": "Jon Braddock\nI Photograph Everything I Eat\n\nProject Description:\nI photographed everything I ate during the semester. Whenever I failed to\ndo so, I provided clues through receipts or drawings, which I included with\nthe photographs in the wall installation near the Dome Cafe on the MIT\ncampus."
    },
    {
      "category": "Resource",
      "title": "lauranoren.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/cb5a4599c966c37e0e90c59e941e0f25_lauranoren.pdf",
      "content": "Laura Noren"
    },
    {
      "category": "Resource",
      "title": "mariannashnayderman.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/5d2e85cc61b96a7c70b922c1162e16e4_mariannashnayderman.pdf",
      "content": "Marianna Shnayderman\n\nProject Description:\nThe goal of my project was to explore the role of relationships between the subject and\nphotographer, and to try to capture my relationships with the people that surround me in\nphotographs. The route I took to do this was ask my subjects to write about personal\nissues and lead intimate conversations while I was taking their pictures.\nI presented the final images in a small room where the portraits lined the perimeter on\neye level and were close to each other in hopes of giving an intense experience for\nviewers who would ideally enter the room one by one and get saturated with the same\nexpressions that I encounter every day in my life.\nfragments of handwritten ideas that my sitters left with me. These visuals were meant to\nadd to the individualities of my subjects and give an idea of the kinds of interactions I\nhave with them.\nWith each portrait, I provided"
    },
    {
      "category": "Resource",
      "title": "rantao.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/7de6b970711d65e1904af1bc0611fde8_rantao.pdf",
      "content": "Ran Tao"
    },
    {
      "category": "Resource",
      "title": "simonhalpern.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/5e0f0ae755bc7f94b76d8987f19fb019_simonhalpern.pdf",
      "content": "Simon Halpern\n\nProject Description:\nI enjoy studying light. Light is a force that exists as a physical medium and an emotional\ncircuit. On a physical level, light has obvious scientific properties. It serves as a light\nsource and an energy source for architecture and technology in society. Human\ninteraction with light results in a humanistic symbolism of light- usually as a provider.\nLight inspires warm emotional feelings and it adopts certain societal stereotypes. Light is\nsuch a phenomenal entity that cannot be permanently defined. Only when in comes in\ncontact with a life source can it be interpreted in a certain way.\nMy photography project is a small biography, or journal, of light. I designed the project in\nsuch a way as to provoke inspiration in the viewer. It is not mandatory that the viewer\nunderstand each image. Moreover, the viewer should imagine a chapter of light for each\nframe in the same way that one recognizes a sensation when looking at an impressionist\npaining. I tried to select (more or less) abstract backgrounds that would represent, or\neven dictate, elements of the theme of light particular for each title. By overlaying artistic\ndiagrams or appropriate poetic quotations over these backgrounds, part, or whole, of the\nchapter is represented. Light is an infinitely large field of study, My intention in this\nproject was to provide a first glance at some of the aspects that I find interesting, or\nconversational, about light."
    },
    {
      "category": "Resource",
      "title": "stephaniehsu.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/251295975892b34ac50ae2cca67173be_stephaniehsu.pdf",
      "content": "Stephanie Hsu"
    },
    {
      "category": "Resource",
      "title": "StudentWorknew.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-341-introduction-to-photography-fall-2002/bf9d17685269d5095788875c28f64c22_StudentWorknew.pdf",
      "content": "Photography\nVisual Arts Program\nFall 2002\nMIT\n/\n\nIntroduction to Photography(4.341) and Photography and Related Media(4.343)\nare workshop-centered courses in the Visual Arts Program at the Massachusetts Institute\nof Technology.\nThey combine practical instruction, readings, lectures, field trips, visiting\nartists and group discussions intended to foster an aesthetic appreciation of\nphotography/digital imaging, and a critical awareness of how images in our culture\nare produced and constructed.\nA student-initiated term project provides opportunities to develop technical skills as\nwell as for personal exploration. Projects are continuously presented in a critical forum.\nThe following documentation presents a number of student projects from Fall 2002.\nCover Photograph: Peter Jamieson '03, from series Strangers\n\nPeter Jamieson\nStrangers\n\nProject Description:\nI have found that many people truly act themselves when they are not put on the spot. Moreover,\nthey will often have indeed forgotten you are pointing a camera at them, and instead are focused\non themselves. This is what I am exploring. I am going out into the world, into all walks of life.\nMany of my pictures are taken from the waste level without looking through the viewfinder.\nPeter Jamieson\n\nAndrew Marcus\nSo it was I lost the light of day...\n\nProject Description:\nMy interest is in capturing an ephemeral mood or sense of a place, however sublime or banal.\nImplicit in this is an attempt to document a complexity impossible to verbally relate.\nI've found that a mood, or more vaguely, a sense of being from a place may be related through\nan image that communicates on a visceral level, and I hope to further my understanding of that\nphenomenon while communicating a subjective reading of a site.\nMy thirty by forty inch large black and white prints were installed in an MIT building with a large\nglass facade allowing pedestrians to view the installation during daytime and nighttime.\nAndrew Marcus\n\nLiz Burow\nIn Green Pastures\n\nProject Description:\nFor the past 6 years I have been painting large scale works of acrylic, pastel and charcoal on\npaper. I have always said that I only paint what I see and what I see are correlations between\ncolor, light, layering, space and media. More recently, I have become more interested in urban\nlandscapes as a subject matter, especially 'street clutter.' I find beauty in these everyday scenes\nand numerous exciting compositions and relationships. I have used photographs for the starting\npoint of paintings, but now instead of having these two mediums fight against each other, I am\ninterested in bringing them together in my work.\nI have mounted the photographs on panels that separate them from the wall and installed them\nin a grid formation.\nographs are highly manipulated in the darkroom by changing focus\nduring exposure as well as dodging and burning.\nphotograph is about twenty by twenty-\nfour inches in size.\nLiz Burow\nThe phot\nEach\n\nJon Braddock\nI Photograph Everything I Eat\n\nProject Description:\nI photographed everything I ate during the Fall 2002 semester. Whenever I failed to do so, I\nprovided clues through receipts or drawings, which I included with the photographs in the wall\ninstallation near the Dome Cafe on the MIT campus.\nJon Braddock\n\nChristine Gaspar\nWhen he came home from work on Sunday, the seventh day, his wife had disappeared.\n\nProject Description:\nIn the past, photography has allowed me to access some ideas that I have been unable to get\nthrough other media. However, the graphaical nature of my work seems to override the content\nand its reading. I am interested in getting away from the preciousness of my previous work and\nget more at the content.\nChristine Gaspar\n\nAndrew Carvey\nUntitled\n\nProject Description:\nFor my final photo project, I photographed patterns and structures which occurred in nature.\non the close up details which compose the overall item, but are usually overlooked during a normal\nviewing.\nose attention to the fine detail captured in each photo eventually made even the\nsimplest object appear amazingly intricate.\nurther into the common item revealed that the once\nmundane item became interesting and the merely odd quickly became mind boggling.\nExamining nature in greater depth revealed a new perspective on what was originally seen as\nordinary.\nis new view, unrecognizable patterns and structures began to emerge, bringing a new\nlevel of detail to be scrutinized.\nred structure, a new, captivating, and\nmysterious image was revealed.\nore recognizable details, my images were\ncropped into a photo book, revealing the now foreign structures. These images are digital\nrepresentations of what one would see looking through my book.\nAndrew W Carvey\nI focused\nPaying cl\nDiving f\nWith th\nViewing only the newly discove\nEmbedded among m\n\nAlana Lafferty\nUntitled\n\nProject Description:\nMy book explores the loss of innocence through the use of Barbie dolls, toy soldiers, and real\npeople.\na dark satire of modern society.\nimages explore specific\nlarge ideas related to humanity.\nh is not shown, is simple with a black rectangle\nin the center and a Band-aid.\nntains a sticker that reads \"From the Library of\nAlana Hope Lafferty\" with a teddy bear and a pile of books.\nAlana Lafferty\nThe project is\nThe individual\nThe cover, whic\nThe inside cover co\n\nLaura Noren\nUntitled\n\nSimon Halpern\nA Conversation About Light\n\nProject Description:\nI enjoy studying light. Light is a force that exists as a physical medium and an emotional circuit.\nOn a physical level, light has obvious scientific properties. It serves as a light source and an\nenergy source for architecture and technology in society. Human interaction with light results in a\nhumanistic symbolism of light- usually as a provider. Light inspires warm emotional feelings and\nit adopts certain societal stereotypes. Light is such a phenomenal entity that cannot be\npermanently defined. Only when in comes in contact with a life source can it be interpreted in a\ncertain way.\nMy photography project is a small biography, or journal, of light. I designed the project in such a\nway as to provoke inspiration in the viewer. It is not mandatory that the viewer understand each\nimage. Moreover, the viewer should imagine a chapter of light for each frame in the same way\nthat one recognizes a sensation when looking at an impressionist paining. I tried to select (more\nor less) abstract backgrounds that would represent, or even dictate, elements of the theme of\nlight particular for each title. By overlaying artistic diagrams or appropriate poetic quotations over\nthese backgrounds, part, or whole, of the chapter is represented. Light is an infinitely large field\nof study, My intention in this project was to provide a first glance at some of the aspects that I\nfind interesting, or conversational, about light.\nSimon Halpern\n\nStephanie Hsu\nUntitled\n\nCharisse Massay\nUntitled\n\nMarianna Shnayderman\nUntitled\n\nProject Description:\nThe goal of my project was to explore the role of relationships between the subject and\nphotographer, and to try to capture my relationships with the people that surround me in\nphotographs. The route I took to do this was ask my subjects to write about personal issues and\nlead intimate conversations while I was taking their pictures.\nI presented the final images in a small room where the portraits lined the perimeter on eye level\nand were close to each other in hopes of giving an intense experience for viewers who would\nideally enter the room one by one and get saturated with the same expressions that I encounter\nevery day in my life.\nh portrait, I provided fragments of handwritten ideas that my sitters\nleft with me. These visuals were meant to add to the individualities of my subjects and give an\nidea of the kinds of interactions I have with them.\nMarianna Shnayderman\nWith eac\n\nRan Tao\nUntitled"
    }
  ]
}