{
  "course_name": "Introduction to Civic Media",
  "course_description": "No description found.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Social Science",
    "Communication",
    "Fine Arts",
    "Media Studies",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "\"\nCivic media is any form of communication that strengthens the social bonds within a community or creates a strong sense of civic engagement among its residents.\n\" -- MIT Center for Civic Media\n\nCourse Meeting Times\n\nLecture: 1 session / week, 3 hours / session\n\nDescription\n\nThis course examines civic media in comparative, transnational and historical perspectives. We will explore various theoretical tools, research approaches, and project design methods. Students will engage with multimedia texts on concepts such as citizen journalism, transmedia activism, media justice, and civic, public, radical, and tactical media. Case studies focus on civic media across platforms (print, radio, broadcast, internet), contexts (from local to global, present-day to historical), and use (dialogic, contentious, hacktivist). As a final project, students develop a paper, case study, or civic media project design. Students taking the graduate version complete additional assignments. Limited to 20 students.\n\n\"\nThe need for a 21st century freedom discourse is paramount. The Obama campaign proved that the connection of media technology and organizing holds much promise for constructing electoral movements. Now, how can that technology help us construct new spaces for black and other subaltern voice? Which tools and platforms will help collective deliberation and debate, not just aggregate or pass on information? What venues and mechanisms will aid formation of political identities of dispersed and despised groups? How can these groups find opportunities for speech back to the majority?\"\n-- Dayna Cunningham\n\nCourse Goals\n\nStudents who complete Introduction to Civic Media will be able to:\n\nUnderstand key concepts in the field of Civic Media, for example: public sphere; networked counterpublics; citizen journalism; radical media; media justice; hacktivism.\n\nArticulate and defend their own definition of the term \"Civic Media.\"\n\nAssess common arguments about the role of digital media technologies in social change.\n\nWork with peers on shared projects using collaborative real-time authoring tools.\n\nUnderstand, and explain to others, what's new and what's not so new about the 'new media' debates.\n\nConceive, develop, and present a final civic media project.\n\nLearning Tools and Activities\n\nIn addition to reading and in-class discussion, participants in this course will work together intensively thro ghout the semester to develop a shared practice of real-time collaborative note-taking, writing & editing, and public participation in debates about civic media via the course blog. We'll also share links via Twitter using the\n#civicmedia hashtag\n.\n\nLearning activities include:\n\nEngage with class texts and discussions;\n\nLead a class discussion;\n\nTake shared notes via etherpad;\n\nTransform shared discussion notes into blog posts;\n\nWrite posts summarizing key positions in civic media debates;\n\nConduct peer review of each others' work, via in-class feedback and the blog;\n\nWrite a short case study about a civic mapping project;\n\nFind an example of a failed civic media project, and write a post about what it was, how and why it failed, and by what criteria it is considered a failure;\n\nCreate and present a final project proposal midway through the semester;\n\nCreate and present a final project at the end of the term.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nTexts and discussion\n\n20%\n\nWeekly reflections\n\n30%\n\nDiscussion facilitation and synthesis\n\n10%\n\nMidterm Project proposal\n\n10%\n\nFinal Project and Presentation\n\n30%\n\nA Note about Blogging and Anonymity\n\nAll participants in the course are expected to post regular blog entries on a publicly accessible site (the\ncourse blog\n). You may, however, choose to remain anonymous (actually, pseudonymous) by publishing under a pseudonym not easily linkable to your real name.\n\nRequired Statement on Plagiarism\n\nPlagiarism - use of another's intellectual work without acknowledgement - is a serious offense. It is the policy of the CMS Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted (or linked). Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the\nWriting and Communication Center\nand the\nMIT Website on Plagiarism\n.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nThe 'Crisis in Journalism' and Digital Inequalities\n\nFirst blog post due\n\nDialogic Approaches: From the Public Sphere to Networked Counter publics\n\nSecond blog post due\n\nContentious Approaches: Power and Conflict, from Hegemony to Media Justice; Project Proposal Workshop\n\nProject proposals due\n\nProject Proposal workshop.\n\nCritical Political Economic Approaches: Is it the System or is it Propaganda? Yes.\n\nThird blog post due\n\nFree Cultural Labor\n\nFourth Blog Post due\n\nCivic Maps\n\nFifth blog post due\n\nHands On: Local Ground\n\nPlatforms and Affordances: From Pamphleteers to Peer-to-Peer\n\nCase Study due\n\nNet Culture, Civic Remix, and Kony 2012\n\nSixth blog post due\n\nHands On: #hurricanehacking!\n\nFrom the Barricades to the New Normal, or, From Indymedia to the Age of Citizen Journalism\n\nSeventh blog post due\n\nFreedom of Information: from the Pentagon papers to Wikileaks and Beyond\n\nEighth blog post due\n\nMobile Civic Media\n\nNinth blog post due\n\nCivil Disobedience and Hacktivism, from the Black Bloc to DDOS and Beyond\n\nTenth blog post due\n\nVideo Activism, Free Software, and Human Rights in the Asia-Pacific Region\n\nEleventh blog post due\n\nFinal Project IGNITE Talks\n\nFinal projects due\n\n\"There is no guarantee that networked information technology will lead to the improvements in innovation, freedom, and justice that I suggest are possible. That is a choice we face as a society. The way we develop will, in significant measure, depend on choices we make in the next decade or so.\" --\nYochai Benkler,\nThe Wealth of Networks: How Social Production Transforms Markets and Freedom.",
  "files": []
}