{
  "course_name": "Introduction to Analysis",
  "course_description": "Analysis I (18.100) in its various versions covers fundamentals of mathematical analysis: continuity, differentiability, some form of the Riemann integral, sequences and series of numbers and functions, uniform convergence with applications to interchange of limit operations, some point-set topology, including some work in Euclidean n-space.\nMIT students may choose to take one of three versions of 18.100: Option A (18.100A) chooses less abstract definitions and proofs, and gives applications where possible. Option B (18.100B) is more demanding and for students with more mathematical maturity; it places more emphasis from the beginning on point-set topology and n-space, whereas Option A is concerned primarily with analysis on the real line, saving for the last weeks work in 2-space (the plane) and its point-set topology. Option C (18.100C) is a 15-unit variant of Option B, with further instruction and practice in written and oral communication.",
  "topics": [
    "Mathematics",
    "Calculus",
    "Differential Equations",
    "Mathematical Analysis",
    "Mathematical Logic",
    "Mathematics",
    "Calculus",
    "Differential Equations",
    "Mathematical Analysis",
    "Mathematical Logic"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nPrerequisites\n\n18.02 Multivariable Calculus\n;\n18.03 Differential Equations\n; or\n18.034 Honors Differential Equations\n\nCourse Description\n\nThis course is an introduction to devising mathematical proofs and learning to write them up. It is primarily for students with no prior experience with this. It features a somewhat gentler introduction to the standard Analysis I material than the traditional course. It emphasizes one-variable analysis and de-emphasizes point-set topology. It assumes students did well in a standard single-variable calculus course. The textbook is written in a user-friendly style, discursive rather than brief, making the book usable for self-study.\n\nThe subject matter for the first 2/3 of the syllabus (up to Exam 2) is the proofs of one-variable calculus theorems and arguments which use these theorems. The emphasis is on estimation and approximation, two basic tools of analysis. It is assumed that students know ordinary calculus fairly well, or once knew it and will review it when they need to. Calculus is used from the beginning as a source of examples.\n\nThe last third goes beyond calculus, getting into uniform convergence of series of functions, to justify differentiation and integration term-by-term; there is similar work involving integrals depending on a parameter, to justify differentiating under the integral sign with respect to the parameter. (Differentiating the Laplace transform F(s) = L(f(t)) with respect to the s-variable is an example.)\n\nToward the end, there is a brief introduction to point-set topology, which is used in upper-level courses having an analysis prerequisite, and if students are interested, at the very end an even briefer introduction to sets of measure zero and the Lebesgue integral.\n\nTextbook\n\nMattuck, Arthur.\nIntroduction to Analysis\n. Pearson, 1998. ISBN: 9780130811325.\n\nThe textbook gives the clearest idea of the course, which follows the textbook closely. The\nIntroduction to Analysis\ntextbook website\ngives the preface, a detailed table of contents, fifteen pages of sample sections from the first three chapters illustrating the level and style of writing, and a brief account of why the book was written.\n\nAssignments\n\nHomework is due in class twice weekly, on Monday and Friday, and returned graded at the following class meeting. There are usually from 3-6 problems, depending on their difficulty or length, or whether it's an assignment due Monday or Friday. Sometimes \"Questions\" are included (exercises having solutions at the end of the chapter), as an aid in learning how to write up solutions, and as a source of hints. Since the homework is really where the learning takes place, and timely feedback is essential to improving, handing in 3/4 of the assignments when they are due is a requirement for passing; any exceptions have to be for cause, and arranged in advance. Students who are accepted into the class late have to make up the missed assignments.\n\nThe textbook is by and large an adequate substitute for class attendance; students in the past have found it sufficiently clear. A few just read the book, get the assignments online, and slip the homework under my door before class, retrieving the returned homework from a box outside my door.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\n1/3\n\nTwo 1.5 hour exams\n\n1/3\n\nFinal 3 hour exam\n\n1/3",
  "files": [
    {
      "category": "Exam",
      "title": "Introduction to Analysis: Practice Final Exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-100a-introduction-to-analysis-fall-2012/853a95821fda65c333a085b4b520cd3f_MIT18_100AF12_Finalexam.pdf",
      "content": "X\nZ\nZ\n18.100A Introduction to Analysis - Practice Final 3 hours\nDirections. You can use the textbook, but no other material.\nTo justify the arguments, quote theorems, by name or number, verifying their hypotheses\nwhere necessary.\nWork problems totalling 100.\nYou can include just parts of some\nproblems. Problems will be graded in their numerical order, stopping at 100 or as close\nabove it as possible, the total scaled back to 100 if it goes over.\ninf\n1. (15: 5, 10)\nLet f(x) =\n.\nx2 + n2\na) Prove that f(x) is defined and continuous on (-inf, inf). (Do not use part (b).)\nb) Prove f(x) is differentiable on (-inf, inf). (Hint: Use intervals of the form [-a, a].)\n2. (15: 10,5)\na) Let S be a compact subset of the open first quadrant Q = {(x, y) : x > 0, y > 0} .\nProve there is a point x in S such that the ray connecting it to the origin has maximum\nslope (i.e., no other point in S gives a ray with bigger slope).\nb) Does (a) continue to be true if S is only assumed to be closed, not compact? If yes,\nshow how to modify the proof in (a) to prove it; if no, give a counterexample.\n3. (15) Let f(x) be a continuous function on the plane R2, with values in R, and let I be\na closed interval in R. Prove that the set f -1(I) is a closed set, where\nf -1(I) = {x o R2 : f(x) o I} .\nIndicate clearly where you are using that f(x) is continuous.\n(Suggestion: in your argument, use 25.2,(1c) as the definition of cluster point.)\n4. (15: 7,3,5) The convolution f(x) ∗ g(x) of two continuous functions f(x) and g(x) is a\nfunction of x defined by the formula\nx\nf(x) ∗ g(x) =\nf(t) g(x -t) dt\n.\nd\na) Find, with proof, a formula for its derivative\nf ∗g; the formula should be expressed\ndx\nonly in terms of f(x), g(x), f ′ (x), g ′ (x), f(0), g(0) and their convolutions.\nax -\nbx\ne\ne\nax ∗ ebx\nb) Test your formula on the convolution\ne\n=\n.\na -b\n(Note that the convolution is linear: (cf) ∗ g = c(f ∗ g).\n′′\nc) Using your formula, prove that y = f(x) ∗ sin x is a solution to y + y = f(x) on\n(-inf, inf)\ninf\n-xt\ne\n5. (15)\nLet f(x) =\ndt .\n1 + t\nProve that f(x) is defined and differentiable for x > 0, and is a solution to the differential\n′\nequation y -y = 1/x, x > 0.\n\nP\nR\nZ\nZ\n6. (15: 8,7)\n(a) Prove the set M of all square matrices with integer entries is countable.\n(b) Let S be a set of real numbers having measure zero.\ninf\n\nProve that, for any given o > 0, the set S\n⊆\nIn, where the In, n = 1, 2, 3, . . . are\nopen intervals having total length < o .\n7. (10: 5,5)\na) \"If a sequence {xn}, n ≥ 0 is bounded above for n ≫ 1, then it is bounded above for\nall n ≥ 0.\"\nThe analogous statement for a function f(x) defined on [0, inf] would be:\n\"If f(x) is bounded above for x ≫ 1, it is bounded above for x ≥ 0 .\"\nShow that this statement is false; strengthen the hypothesis on f(x) in a reasonable way,\nand prove the amended statement.\nb) \"If an infinite series\nan converges, then lim an = 0.\"\nAn analogous statement for\nn→inf\nfunctions would be:\ninf\n\"If f(x) is continuous on [0, inf), and\nf(x) dx converges, then lim f(x) = 0.\nn→inf\nShow this statement is false; strengthen the hypothesis on f(x) so the amended statement\nis true. (You need not prove it.)\n8. (10: 6, 4) Let f(x) be uniformly continuous on the interval I in R; the interval I is not\nassumed to be compact.\na) Prove that if {xn} is a Cauchy sequence in I, then {f(xn)} is a Cauchy sequence.\nb) Use part (a) to prove that f(x) = 1/x is not uniformly continuous on (0, 1).\n(You can use that a sequence is a Cauchy sequence if and only if it is convergent.)\n9. (10: 6, 4)\nSuppose f(x) is a function on [a, b]; assume that f(a) < f(b). If f(x) is\ncontinuous and strictly increasing, the following statement will be true:\nFor each point y in the interval [f(a), f(b)], there is one and only one point x in the\ninterval [a, b] such that y = f(x).\na) Prove this statement.\nb) For each of the two hypotheses on f(x), tell what part of the statement will not be\ntrue in general if that hypothesis is dropped, and give an example to illustrate this.\n10. (10: 5, 5) a) Suppose f(x) is continuous on [a, b] and there is a sequence of distinct\npoints xn in [a, b] such that f(xn) = 0 for all n.\nProve there is a subsequence of xn which converges to a point c in [a, b] such that f(c) = 0.\nb) Continuing part (a), suppose that f ′ (x) exists on [a, b] and is continuous. Prove that\nalso f ′(c) = 0.\n11. (10) Suppose that f(x) is Riemann-integrable and f(x) = 1 whenever x is a rational\nnumber. (Its value when x is an irrational number is not known.)\nb\nEvaluate, with proof, the integral\nf(x) dx.\na\ninf\ndx\n12. (5) For what values of k does ;the integral\n√\nconverge?\n0+ xk x + x2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.100A Introduction to Analysis\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Introduction to Analysis: Exam 1 Practice True/False Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-100a-introduction-to-analysis-fall-2012/6bb91fb1d079d06baee13acefff13a76_MIT18_100AF12_Truefalse.pdf",
      "content": "!\n\"\n\"#$%\n\n#&\n'("
    },
    {
      "category": "Exam",
      "title": "Introduction to Analysis: Practice Questions for Exam 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-100a-introduction-to-analysis-fall-2012/0a62e5cffcf6e4c170cefcf0d798b652_MIT18_100AF12_Exam1.pdf",
      "content": "18.100A Practice Questions for Exam 1\nThis could take 2 hours or more to complete and check over; the actual exam 1 will be\nshorter and easier, about 2/3 the length. You can use the material in the book, Chs. 1-8,\nbut no other material (notes, problem sets, calculator, etc.)\nTo justify steps, cite (by number or by name) Theorems or Examples in the book. You\nshould not cite anything else: Questions, Exercises, or Problems.\n1.\nProve directly from the definition of limit (i.e., without using limit theorems), that\n(3n2\nlim\n-\n)\n=\n.\nn→inf\nn + n\n(Use | |, replacing complicated expressions by simpler ones, paying due attention to\nwhich way the inequalities have to go.)\ninf\n(2n)! xn\n2. Find the radius of convergence R of\nL\n.\nn!(n + 1)!\n\ncn\n3. a) Prove that if c > 1, the sequence an =\nis decreasing for n ≫ 1.\nn!\nb) Prove lim an = 0, by starting at some suitable point N in the sequence and give an\nn→inf\nestimate of the size of the factors which allows you to use Theorem 3.4 .)\ninf\nc) Prove part (b) differently by considering the series\nL\nan .\n4. Prove by elementary reasoning (i.e., without using any theorems from calculus), that if\nan\na > 1, then lim\n= inf.\n(Adapt suitably the proof of Theorem 3.4 .)\nn→inf n\n5. Prove that if a\nn\nn\n√\n≥ 0 for all n, and\nlim\nan = L > 1, then\nan diverges.\nn→inf\n(You can use theorems in Chapter 7, but not the n-th root test (Th\nL\neorem 7.4B).)\n6. Let h(n) be the largest prime factor of the integer n > 1, and s(n) be the sum of its\nprime factors, so h(12) = 3, s(12) = 7.\nProve the sequence {h(n)/s(n)}, n = 2, 3, 4, . . . has 1/k as a cluster point for every\npositive integer k, but no limit.\n7. Let S be a non-empty set of real numbers which has no upper bound. Prove there is a\nsequence {xn} of elements in S such that xn →inf as n →inf.\n(Construct the sequence step-by-step, proving each step is possible, and then show its\nlimit is inf by using Defn 3.3 .)\n8. Prove that the sequence {tan n}, n = 0, 1, 2, 3, . . . has a convergent subsequence.\n(Section 5.4 is useful. The function tan x is unbounded; it has the vertical asymptotes\nx = nπ/2, where n is an odd integer.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.100A Introduction to Analysis\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Introduction to Analysis: Practice Questions for Exam 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-100a-introduction-to-analysis-fall-2012/53e8f0ee348525b22ad5fdb5dda869c5_MIT18_100AF12_Exam2.pdf",
      "content": "Z\nZ\nZ\nZ\n18.100A Practice Problems for Exam 2 F-12 120 minutes (exam is 80 min.)\nDirections: You can only use the book; cite relevant theorems when asked to.\n1. A function f(x) has three distinct zeros a0 < a1 < a2 on an interval I, and in addition\nf ′ (a2) = 0. Assume f(x) has a third derivative f\n′′′ (x) at all points of I.\nProve there is a point c o I such that f\n′′′ (c) = 0.\n2. Let f(x) = √ 1\n= (1 + x)-1/2 . Find the best lower and upper quadratic estimates\n1 + x\nof the form 1 -x/2 + Kx2, valid on [0, 3], given by the Linearization Error Theorem.\nln x\n3.\nFor what values of the constant k > 0 will the equation\n= k have no solutions?\nx\n(You can use instead the alternative form ln x = kx; in either case, make a good drawing,\nshow calculations and brief reasoning; cite relevant theorems.\ndt\n4. Prove from a definition of continuity: f(x) =\nis continuous at 0.\n0 1 + xt4\n5. a) A function f(x) is defined on all of R, and its secants (i.e., line segments joining two\narbitrary points (x ′ , f(x ′ )) and (x ′′ , f(x ′′ )) on its graph) have bounded slope.\nProve f(x) is uniformly continuous on I.\n(Note that I is not compact, and f(x) is not assumed to be differentiable.)\nb) Give an example of an f(x) which satisfies all the hypotheses of part (a) but is not\ndifferentiable on I; give with proof explicit bounds on the secant slopes of f(x).\n6. Using the two different methods given below, prove that if f(t) is continuous on [a, b],\nZ b\nf(t) dt = f(c)(b -a)\nfor some c between a and b.\na\nCite theorems used for each step, and indicate where the continuity of f(t) is being used.\nx\na) Prove it by considering the function F(x) =\nf(t) dt.\na\nb) Prove it by using the intermediate value theorem, making use of points t ′ and t ′′ where\nf(t) attains respectively its minimum and maximum values on [a, b].\n(Assume say t ′ < t ′′ ; begin by writing the resulting inequalities f(t) satisfies on [a, b].)\n7.\nLet f(x) be continuous on [0, inf), and assume lim f(x) = L\n(L = ±inf).\nx→inf\nProve f(x) is bounded on [0, inf).\n(Cite theorems; note that the interval is not compact.)\n8.\nLet f(x) be an integrable function on the interval [a, b] of positive length, and assume\nZ b\nthat f(x) = 0 whenever x is a rational number.\nProve that\nf(x) dx = 0.\na\n(Nothing is known about the value of f(x) when x is irrational. For a weaker result,\nyou can add the assumption: f(x) ≥ 0 for all x o [a, b].)\nZ 1-\nk\nx\n9. For what values of k does\n√\ndx converge? Give reasoning, cite theorems.\n0+\nx -x3\nkx\n10. Suppose f ′ (x) exists on [0, inf) and is continuous, f(0) = 0, and 0 ≤ f(x) ≤ e\nfor\ninf\ninf\nsome constant k < 1. Citing theorems, prove\nf ′ (x) e -xdx =\nf(x) e -xdx .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n18.100A Introduction to Analysis\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}