{
  "course_name": "Introduction to French Culture",
  "course_description": "This course examines major social and political trends, events, debates and personalities which help place aspects of contemporary French culture in their historical perspective through fiction, films, essays, newspaper articles, and television. Topics include the heritage of the French Revolution, the growth and consequences of colonialism, the role of intellectuals in public debates, the impact of the Occupation, the modernization of the economy and of social structures. The sources and meanings of national symbols, monuments, myths and manifestoes are also studied. Recommended for students planning to study abroad. Taught in French.",
  "topics": [
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies",
    "Humanities",
    "Language",
    "French",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "European and Russian Studies"
  ],
  "syllabus_content": "Heures de cours\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nOne intermediate subject in French or permission of instructor.\n\nLe cours\n\nCe cours est une introduction a la culture francaise qui se propose d'etudier la culture au sens de la constitution d'une identite nationale et de la production culturelle de la France. Il s'organise autour du theme des types ou des personnages de la culture francaise que nous etudierons a travers des romans, des bandes dessinees, des films, de la musique, de l'art, et de la poesie. Nous commencerons avec une definition du mot 'culture' et en quoi consiste une analyse culturelle. Puis nous abordons des 'produits' culturels qui nous amenerons au cœur de la culture francaise des 20ieme et 21ieme siecles. Du criminel Arsene Lupin a la Marianne, en passant par la flaneuse Cleo du film d'Agnes Varda nous chercherons la particularite de ces types francais. Nous-meme serons detectives - en suivant ces personnages, nous enqueterons sur les habitudes, le langage, et l'espace qui les entourent. D'un bout a l'autre du cours, nous essaierons de comprendre la societe et la culture de la France d'aujourd'hui. Pour cette raison, je vous demande de lire quotidiennement, en ligne, un journal francais de votre choix (\nLe Monde, Le Figaro, Liberation\n, etc.) et / ou d'ecouter regulierement la radio (RFI fait des infos en 'francais facile'). Cette activite sera indispensable pour votre papier de recherche.\n\nNotes finales\n\nACTIVITES\n\nPERCENTAGES\n\nParticipation\n\n20%\n\nReponses\n\n20%\n\nPresentation\n\n15%\n\nPapier de recherche\n\n25%\n\nExamen final\n\n20%\n\nParticipation\n\nVotre presence et participation en classe sont essentielles et obligatoires. Les discussions sont essentielles, en partie parce que ce cours est un Hass-D, mais surtout pour comprendre ce que nous regardons ensemble et ameliorer votre francais oral. A moins d'une excuse medicale valable, toute absence aura des repercussions serieuses sur votre note finale. Votre note de participation prend en compte non seulement votre presence mais la qualite (et pas simplement la quantite) de votre participation.\n\nReponses\n\nChaque semaine vous ecrirez une reponse ecrite de 3400 mots au sujet des textes pour la semaine. Je demande que ces reponses articulent un argument et vous donnerai chaque semaine une question a la quelle vous pouvez repondre.\n\nPresentation\n\nVous allez choisir un type ou personnage francais, faire de la recherche sur lui, et le presenter a la classe. Ceci peut etre un personnage connu (un scientifique, inventeur, acteur), fictif (Gavroche, Lucky Luke) ou un personnage type (le petit bourgeois, l'ouvrier, le raleur). Ceci peut aussi bien etre un personnage de l'actualite. Presentations (avec images) de 10 minutes.\n\nPapier de recherche\n\nVotre papier de 1500 mots va approfondir les recherches que vous avez faites pour votre presentation. Plus de precisions a suivre.\n\nProgramme du cours\n\nSES #\n\nSUJETS\n\nDATES CLES\n\nIntroduction\n\nQu'est-ce la culture ?\n\nReponse\n\nLa France et les types\n\nLe flaneur\n\nReponse\n\nLa flaneuse\n\nLa flaneuse (cont.)\n\nReponse\n\nExcursion Culture: Isabella Stewart Gardner Museum\n\nLe criminel : Arsene Lupin\n\nReponse\n\nLe criminel : Arsene Lupin (cont.)\n\nLe criminel : Arsene Lupin (cont.)\n\nReponse\n\nLe criminel : Arsene Lupin (cont.)\n\nLe criminel : Arsene Lupin (cont.)\n\nReponse\n\nLe criminel : Arsene Lupin (cont.)\n\nPresentations\n\nReponse\n\nPresentations (cont.)\n\nLa femme\n\nReponse\n\nLa femme (cont.)\n\nLa Marianne\n\nReponse\n\nPlan du papier de recherche a rendre\n\nLa Marianne (cont.)\n\nJour ferie\n\nLe francais contemporain : Benjamin Malaussene\n\nLe francais contemporain : Benjamin Malaussene (cont.)\n\nLe francais contemporain : Benjamin Malaussene (cont.)\n\nPapier de recherche a rendre\n\nLe francais contemporain : Benjamin Malaussene (cont.)\n\nLe francais contemporain : Benjamin Malaussene (cont.)\n\nCours annule\n\nLe francais contemporain : Benjamin Malaussene (cont.)\n\nExamen finale",
  "files": [
    {
      "category": "Resource",
      "title": "Extrait de « Le deuxième sexe » de Simone de Beauvoir – 21F.311 Spring 2014",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-311-introduction-to-french-culture-spring-2014/666a43874b8e3c2f2feb54f7184d9cd5_MIT21G_311S14_Extrait_de.pdf",
      "content": "Extrait de « Le deuxieme sexe » de Simone de Beauvoir\n\nOn ne nait pas femme : on le devient1\n\n« On ne nait pas femme : on le devient. Aucun destin biologique, psychique, economique ne\ndefinit la figure que revet au sein de la societe la femelle humaine ; c'est l'ensemble de la\ncivilisation qui elabore ce produit intermediaire entre le male et le castrat qu'on qualifie de\nfeminin. Seule la mediation d'autrui peut constituer un individu comme un Autre. En tant qu'il\nexiste pour soi, l'enfant ne saurait se saisir comme sexuellement differencie. Chez les filles et les\ngarcons, le corps est d'abord le rayonnement d'une subjectivite, l'instrument qui effectue la\ncomprehension du monde : c'est a travers les yeux, les mains, non par les parties sexuelles qu'ils\napprehendent l'univers. Le drame de la naissance, celui du sevrage se deroulent de la meme\nmaniere pour les nourrissons des deux sexes ; ils ont les memes interets et les memes plaisirs ; la\nsuccion est d'abord la source de leurs sensations les plus agreables ; puis ils passent par une\nphase anale ou ils tirent leurs plus grandes satisfactions des fonctions excretoires qui leur sont\ncommunes ; leur developpement genital est analogue ; ils explorent leur corps avec la meme\ncuriosite et la meme indifference ; du clitoris et du penis ils tirent un meme plaisir incertain ;\ndans la mesure ou deja leur sensibilite s'objective, elle se tourne vers la mere : c'est la chair\nfeminine douce, lisse elastique qui suscite des desirs sexuels et ces desirs sont prehensifs ; c'est\nd'une maniere agressive que la fille, comme le garcon, embrasse sa mere, la palpe, la caresse ; ils\nont la meme jalousie s'il nait un nouvel enfant ; ils la manifestent par les memes conduites :\ncoleres, bouderie, troubles urinaires ; ils recourent aux memes coquetteries pour capter l'amour\ndes adultes. Jusqu'a douze ans la fillette est aussi robuste que ses freres, elle manifeste les memes\ncapacites intellectuelles ; il n'y a aucun domaine ou il lui soit interdit de rivaliser avec eux. Si,\nbien avant la puberte, et parfois meme des sa toute petite enfance, elle nous apparait deja comme\nsexuellement specifiee, ce n'est pas que de mysterieux instincts immediatement la vouent a la\npassivite, a la coquetterie, a la maternite : c'est que l'intervention d'autrui dans la vie de l'enfant\nest presque originelle et que des ses premieres annees sa vocation lui est imperieusement\ninsufflee. »\n\nLa femme n'a jamais eu ses chances2\n\n« Les accomplissements personnels sont presque impossibles dans les categories humaines\ncollectivement maintenues dans une situation inferieure. 'Avec des jupes, ou voulez-vous qu'on\naille?' demandait Marie Bashkirtseff 3. Et Stendhal : 'Tous les genies qui naissent femmes sont\n\n1 Simone de Beauvoir, Le deuxieme sexe 1, pp 285 et 286. Extrait (c) Gallimard 1949. All rights\nreserved. This content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/help/faq-fair-use/\n2 Ibid. pages 176 a 178. Extrait (c) Gallimard 1949. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see http://ocw.mit.edu/help/faq-fair-\nuse/\n3 [Bashkirtseff (Maria Bachkirceva, dite Marie), peintre et ecrivain russe (pres de Poltava, 1860 -\nParis, 1884). Son Journal (posth., 1887), commence en 1872 et ecrit en francais, et ses Cahiers\n\nperdus pour le bonheur du public.' A vrai dire, on ne nait pas genie : on le devient ; et la\ncondition feminine a rendu jusqu'a present ce devenir impossible.\n\nLes antifeministes tirent de l'examen de l'histoire deux arguments contradictoires : 1° les femmes\nn'ont jamais rien cree de grand ; 2° la situation de la femme n'a jamais empeche l'epanouissement\ndes grandes personnalites feminines. Il y a de la mauvaise foi dans ces deux affirmations ; les\nreussites de quelques privilegiees ne compensent ni n'excusent l'abaissement systematique du\nniveau collectif ; et que ces reussites soient rares et limitees prouve precisement que les\ncirconstances leur sont defavorables. Comme l'ont soutenu Christine de Pisan, Poulain de la\nBarre, Condorcet, Stuart Mill, Stendhal, dans aucun domaine la femme n'a jamais eu ses chances.\nC'est pourquoi aujourd'hui un grand nombre d'entre elles reclament un nouveau statut ; et encore\nune fois, leur revendication n'est pas d'etre exaltees dans leur feminite : elles veulent qu'en elles-\nmemes comme dans l'ensemble de l'humanite la transcendance l'emporte sur l'immanence ; elles\nveulent qu'enfin leur soient accordes les droits abstraits et les possibilites concretes sans la\nconjugaison desquels la liberte n'est qu'une mystification4. Cette volonte est en train de\ns'accomplir. Mais la periode que nous traversons est une periode de transition ; ce monde qui a\ntoujours appartenu aux hommes est encore entre leurs mains ; les institutions et les valeurs de la\ncivilisation patriarcale en grande partie se survivent. Les droits abstraits sont bien loin d'etre\npartout integralement reconnus aux femmes : en Suisse, elles ne votent pas encore ; en France la\nloi de 1942 maintient sous une forme attenuee les prerogatives de l'epoux. Et les droits abstraits,\nnous venons de le dire, n'ont jamais suffi a assurer a la femme une prise concrete sur le monde :\nentre les deux sexes, il n'y a pas aujourd'hui encore de veritable egalite. »\n\nintimes (posth., 1925) composent un recit lucide et emouvant de sa breve existence. (Hachette\nMultimedia / Hachette Livre (c) 2001)]\n4 Ici encore les antifeministes jouent sur une equivoque. Tantot, tenant pour rien la liberte\nabstraite, ils s'exaltent sur le grand role concret que la femme asservie peut jouer en ce monde :\nque reclame-t-elle donc? Tantot ils meconnaissent le fait que la licence negative n'ouvre aucune\npossibilite concrete et ils reprochent aux femmes abstraitement affranchies de n'avoir pas fait\nleurs preuves.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.311 Introduction to French Culture\nSpring 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}