{
  "course_name": "Introduction to European and Latin American Fiction",
  "course_description": "This subject serves as a broad introduction to the field of European and Latin American fiction. It is taught in an historical manner—beginning with the first picaresque novel, Lazarillo de Tormes, and ending with contemporary European fiction. It is designed to help students acquire a general understanding of major fictional modes-from 18th century epistolary fiction, Liaisons dangereuses, to 20th century avant-garde fiction: Cosmicomicsi and Aura. Attention is paid not only to the literary movements these works represent, but also to the subtle interplay of history, geography, language and cultural norms that gave rise to specific literary forms. While the reading load is heavy, the books are compelling.",
  "topics": [
    "Humanities",
    "Literature",
    "Fiction",
    "International Literature",
    "Humanities",
    "Literature",
    "Fiction",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hour / session\n\nCourse Overview\n\nThis subject serves as a broad introduction to the field of European and Latin American fiction. It is taught in an historical manner--beginning with the first picaresque novel,\nLazarillo de Tormes\n, and ending with contemporary European fiction. It is designed to help students acquire a general understanding of major fictional modes-from 18th century epistolary fiction,\nLiaisons dangereuses\n, to 20th century avant-garde fiction:\nCosmicomicsi\nand\nAura\n. Attention is paid not only to the literary movements these works represent, but also to the subtle interplay of history, geography, language and cultural norms that gave rise to specific literary forms. While the reading load is heavy, the books are compelling.\n\nThis course is designed for a variety of students. Some will be taking a literature course for the first time, others may have taken literature but may not have had experience with the kinds of approaches to texts that characterize this subject.\n\nThis subject is a \"communication intensive\" class. That means that in our work together, students will have the opportunity to refine their written and oral communication skills. Each student will write three 7-8 page papers in the course of the term. Students will submit drafts which will be corrected and discussed individually before the final paper is due. The assignments will be varied and designed to strengthen writing skills. Feedback on every draft will be given within the week in which papers are submitted so that students can use corrections in producing the final essays. Students will also participate in teaching groups which will afford the opportunity for oral presentations. These presentations will be critiqued by peers and by the instructor. Students will also submit journal entries on each reading. These journals are due in class the day of class discussion on that work. While they are not graded, failure to submit the journals on the appointed day will lower the grade.\n\nCourse Requirements\n\nYou are expected to attend all classes since class discussion is central to the course. Unexcused absences will automatically lower your grade.\n\nYou will turn in short journal entries as indicated on the syllabus. Three asterisks indicate days on which these are due. One purpose of the journals is to get your thoughts and reactions together for class discussion; therefore, they must be submitted when you come to class--not a few days or an hour later. Unless you have a convincing excuse, any late paper will lower your grade. Thought questions usually will be distributed before we read each work. These questions will be generated by the instructor or by the teaching group presenting that work.\n\nThe class will divide itself into groups. Each group will be responsible for teaching one class. The group will meet to discuss the reading and to outline its teaching plan; the group will prepare \"thought questions\" on the reading and distribute them at the class meeting\nprior\nto discussion of the book. Teaching groups may meet with the instructor before they finalize their teaching plans. They should obtain bibliography on the author and/or the culture under discussion through library work.\nYou are not required to submit a paper on the book for which your teaching group is responsible.\n\nYou will write three papers each from 7-8 pages in the course of term. The dates for the drafts as well as final copy are noted on the syllabus.\n\nAny films listed on the syllabus are an integral part of the course. They will be available for a full week in the language lab so that you can see them at your convenience.\n\nIf at any time during the semester you find yourself having trouble with work for the class, let me know right away--not at the end when it is too late. If you have any suggestions regarding any aspect of the course--how it is taught, organized, etc.--feel free to let me know either by seeing me or by attaching a note to your papers.\n\nI will be distributing photocopied materials. They must be paid for before the end of the semester.\n\nGrading\n\nThe final grade in the course will be based on the following activities:\n\nACTIVITIES\n\nPERCENTAGES\n\nJournal Entries\n\n10%\n\nOral Presentations\n\n20%\n\nClass Participation\n\n20%\n\nShort Papers\n\n50%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nLazarillo de Tormes\n\nLes Liaisons Dangereuses\n\nResponse due\n\nFilm:\nCruel Intentions\n. Directed by Roger Kumble.\n\nCruel Intentions\nand\nLes Liaisons Dangereuses\n\nTeaching Group on\nCruel Intentions\n\nLes Liaisons Dangereuses\n(cont.)\n\nFilm:\nLes Liaisons Dangereuses\n. Directed by Josee Dayan.\n\nFirst version of first paper due\n\nNotes From the Underground\n\nTeaching Group on\nNotes From the Underground\n\nWrite response paper\n\nNotes From the Underground\n(cont.)\n\nResponse due\n\nFinal version of first paper due 1 day after Ses #9\n\nTherese Raquin\n\nTeaching Group on\nTherese Raquin\n\nResponse due\n\nDom Casmurro\n\nFilm:\nDona Flor and her Two Husbands\n. Directed by Bruno Barreto.\n\nFilm response due 1 day after Ses #12\n\nMetamorphosis\n\nTeaching Group on\nMetamorphosis\n\nFinal version of secnd paper due 1 day after Ses #13\n\nThe Back Room\n\nTeaching Group on\nThe Back Room\n\nThe Back Room\n(cont.)\n\nResponse due\n\nFilm:\nWomen on the Verge of a Nervous Breakdown\n. Directed by Pedro Almodovar.\n\nFilm response due 1 day after Ses #16\n\nKiss of the Spider Woman\n\nTeaching Group on\nKiss of the Spider Woman\n\nFilm:\nThe Cat Woman\n. Directed by Alfred Shaughnessy.\n\nFilm response due 2 days after Ses #18\n\nThe Cat Woman\nand\nKiss of the Spider Woman\n\nTeaching Group on the film and the roles of films in\nKiss of the Spider Woman\n\nKiss of the Spider Woman\n(cont.)\n\nFilm:\nKiss of the Spider Woman\n.\nDirected by Hector Babenco.\n\nResponse paper due 1 day after Ses #21\n\nAccident: A Day's News\n\nTeaching Group on\nAccident: A Day's News\n\nWrite response paper\n\nAccident: A Day's News\n(cont.)\n\nResponse paper due\n\nCosmicomics\n\nTeaching Group on\nCosmicomics\n\nWrite response paper\n\nCosmicomics\n(cont.)\n\nResponse paper due\n\nAura\n\nThird paper due",
  "files": [
    {
      "category": "Resource",
      "title": "First Essay Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-010-introduction-to-european-and-latin-american-fiction-fall-2006/a564c5db72c534180d87bc1edb83d99e_MIT21G_010F06_first_essay.pdf",
      "content": "21G.010, Introduction to European and Latin American Fiction\nProf. Margery Resnick\nFirst Essay Topics\n\n1. How does Valmont change his understanding of \"winning\" in the course of his attempted\nconquest of Mme. Tourvel. Is there more to her \"prudery\" than meets the eye intially? Is there\na similar function that her code of prudery serves, as the code of the libertine does Valmont?\nIs one of them freer to discover more about life and truth than the other? Explore what the\nnovel teaches you about the role of power vs. love as the characters explore control over\nothers, vulnerability to another, primacy of oneself, and \"winning\" vs. \"losing.\"\n\n2. If it's true that Laclos as a soldier has a real admiration for the strategy and tactics of V and\nM, he also presents them as \"upper class bullies who prey on the weak and gullible,\nsquandering their intellectual gifts on mean acts of petty destruction.\" In what ways can the\ntwo of them be seen then as tragic heroes in the Shakespearean sense? They attempt to lay\nbare an emptiness and hypocrisy in conventional morality, but what is their grandeur, if any,\nand what tragic flaw(s) overtake them to bring their own destruction and prevent them from\nwinning the war between the sexes? Be sure to be specific, cite brief passages, and use action\nand reaction from characters to support your claims.\n\n3. Track the film characters of Cruel Intentions or the film version of Les Liaisons vs. the\nnovel. Be sure to give an overview of core character and story arcs, telling about the\nsimilarities and differences in the film and the novel. Refer to characters in the film, plot points\nin the film, character actions and apparent revelations (with other detail) that show\ndifferences/similarities you noticed. Talk about the differences related to film/print. As you\ncompare the unfolding actions, observations and character in the film vs. the novel you must\nrelate them to an argument about the two versions--not simply compare the two works.\n\n4. How close do Valmont and Merteuil get to understanding differences between Love vs.\nConquest in the course of the novel? Define \"real\" love for yourself as shown by one character\nin the novel. What is the usefulness of Reason vis-a-vis love in this novel? What do you think\nLaclos wants the reader to discover about human relationships here? Why is their Code of\nConquest so rigid? How does their code serve each of them? Does maintaining power prevent\neither/both from knowing \"real\" love? Does Merteuil demonstrate that it's possible to lose the\nwar between the sexes in the longterm, despite winning every battle to control another? What\ndo they show us about the role of Reason and Emotion in the world of 18th century\nenlightenment?\n\n5. Considering the fact that a central theme of Liaisons Dangereuses is sexual conflict between\nMerteuil and Valmont, there are surprisingly few overtly sexual scenes. Yet there is a lot of\nsexual tension. How is this tension created? Discuss why the book is not a more sensual one.\nHow does the form contribute to the creation of this atmosphere. Is it pornographic?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.010 Introduction to European and Latin American Fiction\nFall 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Last Essay Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-010-introduction-to-european-and-latin-american-fiction-fall-2006/2cdcd27a867a974a6f1e2c071ab0aceb_MIT21G_010F06_last_essay.pdf",
      "content": "21G.010, Introduction to European and Latin American Fiction\nProf. Margery Resnick\nLast Essay Topics\n\nHere are some thoughts for final topics that you may turn into a thesis and a short,\nconcise, clear essay. Try to limit yourselves to 5 pages. Use textual evidence to\nprove your point. Think of something you want to argue in one of these works. If\nyou are writing a comparative paper, make it very clear which element of each novel\nyou are comparing and have a good reason concerning what the reader will learn\nfrom this comparison. You may write on: Kiss of the Spider Woman, Cosmicomics\nor Aura. Of course you should not feel limited by the topics below. I will accept\nthe essays any time from now until the last class session at 12 noon.\n1. Calvino pushes us to SEE what evolution has wrought in the breathtaking diversity\nof life, of the changes in life forms over millenia, of the consciousness humans bring\n(rather small in comparison) to the relentless evolutionary complexity in all life,\nfrom mollusks to the evolution of the eye in life forms, to the human mind looking at\nall of this (The Spiral). SEE, he says, look carefully, be amazed. He uses a\nfabulist style for this (The art of creating mixtures of fiction and reality in order to\nentertain, confuse, perform ontological sabotage or educate). Pick one or two of the\nstories and argue either that the mixture of science and fiction enhances, detracts\nfrom, or is irrelevant to the text it precedes. Be specific.\n2. Calvino: \"In an age when other fantastically speedy, widespread media are\ntriumphing and running the risk of flattening all communication onto a single,\nhomogeneous surface, the function of literature is communication between things\nthat are different simply because they are different, not blunting but even\nsharpening the differences between them, following the true bent of the written\nlanguage.\" (Six Memos for the Next Millennium) Choose any story or two and argue\nthat Calvino, in his own prose, is successful in linking \"things that are different\" to\nenrich the language and fantasy we enjoy in his work. Argue about what makes\nthese stories so compelling.\n3. In Six Memos for the Next Millennium, by Calvino and published posthumously in\n1987 and made up of the lectures he had prepared, just prior to his death, to be\ndelivered at Harvard for the Charles Eliot Norton series, he states, talking about art\nand science:\n\"Overambitious projects may be objectionable in many fields, but not in literature.\nLiterature remains alive only if we set ourselves immeasurable goals, far beyond all\nhope of achievement. Only if poets and writers set themselves tasks that no one else\ndares imagine will literature continue to have a function. Since science has begun to\ndistrust general explanations and solutions that are not sectorial and specialized, the\ngrand challenge for literature is to be capable of weaving together the various\nbranches of knowledge, the various \"codes,\" into a manifold and multifaceted vision\nof the world.\"\nPick any story or two and argue that Calvino's \"project\" gives literature a function in\ncontemporary life by providing a multifaceted vision of the world. How does he do\nthis? Is the story you analyze successful in accomplishing this goal? Be specific\nabout the \"vision\" the reader can gain from this text(s.)\n\n4. Calvino is brilliant in opening up the dualism with which we deal with the world,\ndividing everything into this, not that, me, not you, us, not them, as if all reality is\nabout distinction rather than reality extending from one to another, and a kind of zen\nunity in all things. Choose one or two stories and argue that this dualistic framing of\nthe world allows us to understand human nature in important ways unavailable to\nreaders of conventional fiction.\n\n5. The novel is, in part, a genre that teaches us how to live, how not to live; how to\ndistinguish between good and evil; how to love; how to be a good friend; how\ndialogue with others can, for better or for worse, change us. Choose a section of\nKiss of the Spider Woman and argue that the novel is truly didactic in terms of\nteaching the reader something important about how we should live.\n\n6. \"The personal is political\" was a theme of the 1960s. Can this saying be applied\nto Kiss of the Spider Woman? Why? Argue that our personal fantasies are an\nimportant element of our political life. Use examples from the text.\n\n7. Kiss of the Spider Woman deals with the theme of power: political, social and\nsexual. Argue that the novel does or does not break conventional notions of power.\nExplain how it does or does not do that. Be specific.\n\n8. To what extent does Kiss of the Spider Woman show how conventional sex roles\nlimit personal autonomy? How are they dangerous? How is Molina limited by his\nrole? Valentin? Does either of them change his sexual identity? If the sexual\nidentity does not change, expand, etc. what does change?\n\n9. In Aura the reader is drawn into a surreal \"family\" and invited to participate in in a\nway we might not have imagined prior to reading. Explain how elements of Fuentes'\nwriting style captured your imagination to engage you in this family's present, past\nand future. Why did you keep reading (aside from the fact that it was assigned.)\nArgue that through his use of magic, Fuentes illuminates certain aspects of the\nhuman spirit that might not otherwise be examined.\n\n10. Aura may be interpreted on several levels. On a literal level, it is a classic tale of\nhorror with the hero losing autonomy as he is taken over by a witch. However, on a\nsymbolic level the book engages our imagination in a much richer way, causing us to\nquestion our own passions, notions of destiny and free will, and inexplicable\nattractions. Argue any interpretation of the novel.\n\n11. Think about the relationships among characters in Aura. What are the sex roles\nthey represent? What is their social position within the family? What is their\neconomic reality and their geographic and historical situation. In what way is this a\npowerful commentary on Mexico's past? Does Fuentes link the present Mexico with\nthat past? How?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.010 Introduction to European and Latin American Fiction\nFall 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Second Essay Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-010-introduction-to-european-and-latin-american-fiction-fall-2006/975a7158d638cca8e72f3a300715132f_MIT21G_010F06_second_essay.pdf",
      "content": "21G.010, Introduction to European and Latin American Fiction\nProf. Margery Resnick\nSecond Essay Topics\n\nThe first version of the second essay is due one day after session #13. It must be at\nleast 5 pages, double-spaced, with 1\" margins. What follows below are some ideas:\nyou are not required to take-off from these ideas--they simply represent some\npossible directions.\n\n1. Many forms of repression are examined in these works. Use Kiss, Aura,\nTherese Raquin to think about how political/social repression plays itself out\nin personal relationships.\n\n2. Several of the works we have read offer a social/political critique either\ndirectly or indirectly. Using two of the authors we have read, examine ways\nin which fiction is used to provide a social commentary. Many of these works\nallow the reader to understand political (post-colonial, governmental,\neconomic) violence. Choose one or two characters and discuss how this\nviolence is not necessarily physical, but also social, ethical or economic.\n\n3. Choose any of the thought questions distributed by the teaching groups or by\nme and use them as the basis for an essay.\n\n4. Fiction often invites us to participate in family life in a way we might not have\nimagined prior to reading. Choose one or more of the novels or short stories\nand explain how you were or were not drawn into a style of family life that\nwas unfamiliar or familiar to you before reading the novel.\n\n5. Think about the relationships among characters in any of the works we have\nread. What are the sex roles they represent? What is their social position\nwithin the family? What is their economic reality and their geographic and\nhistorical situation. In what way is this work distant from your experience?\nIn what way is it close to your life experience?\n\n6. TWO FIRST PERSON NARRATORS\n\nDiscuss, compare and contrast the narrators of Dom Casmurro and Accident.\nMachado and Wolf created extremely different characters, wrote them a century\napart, published the novels before and after Freud's work on the unconscious\nappeared. Use passages to illustrate how each narrator's Voice powerfully reveal\nstory in different ways (perhaps purposely confuses the reader at times, to cause us\nto think about uncomfortable ideas like love, death, loss, jealousy, guilt, and rage).\nOne is calm, very measured. The other is agitated in dealing with a nuclear\ncatastrophe. They have different motives in describing their experience, have\ndifferent views of the world, and deal with elements of their own crazed fears in\ndifferent ways. How sane or \"normal\" is each?\n\nYou could deal with how one narrator reveals himself as unreliable (self-\ninterested bias, memory loss, lying, etc.) and the other as excitable and fearful of\nthe loss of \"normal\" daily life (her brother's, her daughter's, whole populations,\nher own). What does the first person narrator allow each author to do in these\n\nnovels? (deal with the unconscious compulsions and darkness we are all capable\nof, demonstrate how subjective reality/perception can be, how self-interested\nand biased our \"life narratives\" are - who we are, who's at fault in our lifetime\nevents, etc.?)\n\nWhat is most affecting to you about how these narrators were created by Machado\nand Wolf -- the distinctive personalities and perspectives which interpret their\nexperiences? What did you realize or think about for the first time about yourself\n(preferably) or others in this reading? [Note: Outline your ideas, collect examples,\nthen organize your sections into a convincing argument based, not on general\nimpressions, but a close reading of both novels. Carefully decide what your central\nidea is when you have written for a while.]\n\n7. The HEART of DARKNESS in Accident\n\nChrista Wolf uses a single day set near the Chernobyl accident to present \"stream of\nconsciousness\" reflections on what makes us human, what makes life \"normal,\" what\nwe cherish human experience and what drives us to destroy it - in families, in war,\nand in scientific accidents. What does she mean when she discusses the heart of\ndarkness several times?\n\nAlthough she seems to free associate*, she carefully weaves together elements of\npersonal life, scientific accident and domination of nature to think about what makes\nus human and how destructive we can be. She savors the pleasures of the senses,\nlovely sights, tastes, images and memories that make life precious. She alternates\nworry about her brother's brain surgery (no relation to the accident?) with worry\nabout her daughter's family's health, living near the nuclear cloud, and concern for\nthe effects of radiation on evolution, crop and water safety for masses of people.\nThen she moves into memories of the last apocalypse, World War II and the typhoid\nfever epidemic of 1945 that she and her brother survived at war's end. Talk about\nhow she uses her writer's craft to recreate the horror of the accident in ways the\nnews media never could or would, for whatever reasons.\n\nDiscuss the denial many use to avoid painful realities while others -- like the author--\nplunge into the midst of our fears - \"this early fear of the dark side of our\nnature from which we can never liberate ourselves except through death and\ndestruction.\" (74) Discuss how she explores joy and pain and tell where she comes\ndown in the end -- life is precious or life is vulnerable? How powerful is the darkness\nshe relates, and what does fear do to us in her novel? What do simple actions and\nthe everyday pleasures do for us? Does she see the glass half empty or half full? Do\nyou agree with her mistrust of the some scientists and their fear that isolates them\n\"so reliably against that which we normal people call life...[so they] would rather free\nthe atom than themselves\" (65)? Explain, again, with a clear thesis and examples to\nsupport your claims.\n\n* \"Everything I have been able to think and feel has gone beyond the boundaries of\nprose.\" (58)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.010 Introduction to European and Latin American Fiction\nFall 2006\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}