{
  "course_name": "Introduction to Western Music",
  "course_description": "This course gives a broad overview of Western music from the Middle Ages to the 20th century, with emphasis on late baroque, classical, romantic, and modernist styles (1700-1910). It is also meant to enhance students’ musical experience by developing listening skills and an understanding of diverse forms and genres. Major composers and their works will be placed in social and cultural contexts. Weekly lectures feature demonstrations by professional performers, and introduce topics to be discussed in sections. The focus of the course is on the weekly listening and reading assignments.",
  "topics": [
    "Fine Arts",
    "Music",
    "Music History",
    "Music Theory",
    "Fine Arts",
    "Music",
    "Music History",
    "Music Theory"
  ],
  "syllabus_content": "This page includes a\ncalendar\nof lecture topics.\n\nCourse Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nGeneral Information\n\nThis course gives an overview of forms and styles of Western classical music, with emphasis on the period of common practice, 1700-1910. The focus of the course is on the weekly listening and reading assignments. Weekly lectures will sometimes feature live performances by members of the staff and other professional musicians; tests and quizzes will draw on this material, which cannot be gleaned elsewhere. The core reading and listening assignments should be completed before the lecture and/or recitation in which the material is introduced. Your recitation instructor will provide a supplementary schedule of assignments for every class meeting.\n\nEnrollment\n\n21M.011 is both a HASS-D and CI-HASS subject. This means that each recitation can accept a maximum of 18 students. Priority is given to students who are registered in the class through the HASS-D lottery, but these students must attend the first two recitation meetings to keep their place in the class. Students who must change their preassigned recitation may do so, but they should inform the original instructor at once, so that an accurate count and class list can be quickly established. Normally the instructor will accept any additional students who wish to enter a recitation, so long as there are open slots, through the second week of classes. After that, instructors may or may not admit additional students at their discretion.\n\nText\n\nThe required textbook and music CDs are:\n\nKerman, Joseph, and Gary Tomlinson.\nListen\n. 5th brief ed. Boston, MA: Bedford/St. Martin's Press, 2004. ISBN: 9780312401153.\n\nKerman, Joseph, and Gary Tomlinson.\nA 6-Cd Set to Accompany Listen.\nBoston, MA: Bedford/St. Martin's Press, 2003. ISBN: 9780312411220.\n\nPapers\n\nFour essays are required of all students.\n\nOral Presentations and Class Participation\n\nStudents are required to attend lectures and recitations and to participate actively as part of the CI requirement of this class. Additionally, students will be asked from time to time to give oral presentations in recitation, such as reports on reading or listening, or to lead the discussions on the reading or listening.\n\nTests\n\nA midterm exam will be given the week before Spring Break; there is a three-hour final exam during finals week. Questions on these tests will cover material discussed in lecture and/or in recitation. Some questions will deal with concepts (definitions of important terms, descriptions of musical forms, etc.), and some will concern particular excerpts from the assigned listening. In general the tests will follow the following format:\n\ndefinitions and short answers,\n\nquestions based on aural excerpts from the assigned repertoire,\n\nquestions based on unassigned (new) listening,\n\nconceptual and short essay questions.\n\nA preview will be provided before the midterm and final. Recitations may include announced and unannounced quizzes.\n\nCourse Grade in 21M.011\n\nThe individual recitation instructors give the grades in this class, adhering to the following percentages:\n\nACTIVITIES\n\nPERCENTAGES\n\nPapers, Oral Contributions to Recitation, and Attendance\n\n50%\n\nMidterm and Final Exams\n\n50%\n\nCalendar\n\nLec #\n\nTOPICS\n\nKEY DATES\n\nIntroduction; Music of the Middle Ages\n\nRenaissance and Early Baroque Music for Church, Chamber, and Theater\n\nBaroque Instrumental Music: Suite, Concerto, and Fugue; Bach\n\nEssay 1 due in recitation\n\nBaroque Vocal Music: Opera, Oratorio, and Cantata; Handel\n\nThe Classical Symphony and Sonata: Haydn\n\nThe Classical Concerto and Opera: Mozart\n\nEssay 2 due in recitation\n\nMidterm Exam\n\nFrom Classic to Romantic: Beethoven\n\nRomantic Songs and Piano Pieces: The Art of the Miniature\n\nRomantic Program Music and Opera: Fantasies on a Grand Scale\n\nLate Romantic Orchestral Music: Looking Forward and Back\n\nEssay 3 due in recitation\n\nThe Twentieth Century: The European Tradition\n\nThe Twentieth Century: The American Tradition\n\nEssay 4 due in recitation\n\nCatch-up and Review\n\nAcknowledgements\n\nI would like to acknowledge my colleagues who have assisted in the preparation of this class over many semesters: Martin M. Marks, George Ruckert, Charles Shadle and Teresa Neff.",
  "files": [
    {
      "category": "Resource",
      "title": "format_yr_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/0cce1163f5898c429848c359490bab47_format_yr_paper.pdf",
      "content": "21M.011 Syllabus, Spring 2006 - 1\nSmith, Lucy\nConcert Report #1\n\n21M011 [Instructor's last name]\n\nFormatting Your Papers: Some Guidelines for a Good Start\n\n1) Note the position and format of the name-class-date block in the upper right-hand corner. It is\nright-justified, single-spaced, and in 12-point type.\n\n2) Note the 14-pt. size title above, set in bold typeface, and centered. It is in a sans-serif font\n(or typeface) called Helvetica, which is suitable for titles but not for text. Text should be\nset in a serif type face such as this one (Times), Palatino, or Bookman, etc.\n\n3) Do not use a right-justified margin for the text. Simply set the text flush left. The text should\nbe in twelve-point type with double spacing. The text should be in twelve-point type with\ndouble spacing. The text should be in twelve-point type with double spacing. The text should be\nin twelve-point type with double spacing. The text should be in twelve-point type with double...\n4) Because they are short, the papers written for 21M 011 need no extra title page or added blank\npages. The text should be on one side of each page only.\n\n5) Number your pages. The simplest way to do this is to create a header or a footer consisting\nof your last name plus automatic page numbering, set in smaller type: e.g., Smith 2. If using a\nheader, set it flush right at the top; if a footer, center it at the bottom. (Note that E-Z will not do\nthis, so you must learn to use a more sophisticated word-processing program.)\n\n6) Here are a few standard rules of sentence punctuation. (i) Double-space after periods;\nsingle-space after colons, semicolons and commas. (ii) Quotation marks come after commas and\nperiods: i.e., ...music,\" or ...music.\" (iii) Learn the use of the em-dash--that is, avoid using a\nhyphen (-) or two hyphens (--) in place of an em-dash (--). Hyphens are used in compounds,\nsuch as the word em-dash; dashes may be used to separate sentence clauses when there is an\nabrupt break, as in the previous sentence. (There should be no spaces before or after the em-\ndash.)\n\n7) To format a citation, whether for a direct quotation, a paraphrase, or an indirect quotation,\nfollow a consistent method. Here are examples of a standard method. Note the placement of the\npunctuation:\n\ndirect quotation: \"German churches took special pride in their organs, both in their appearance\nand their acoustic quality. Organ technology developed prodigiously in the Baroque era\"\n(Kerman: 162).\n\nparaphrase: Organ technology developed enormously during the Baroque period (Kerman: 162).\nFebruary 30, 1999 [or 30 Feb. 1999]\n\n21M.011 Syllabus, Spring 2006 - 2\n\nindirect quotation: According to Kerman, the organs in Baroque German churches were a source\nof special pride (148). OR The organs in Baroque German churches were a source of special\npride. (Kerman: 162).\n\n8) In research papers, it is standard procedure to supplement such citations in the text with a list\nof books (or other reference materials) at the end of your essay. Please use this format:\n\nKerman, Joseph and Gary Tomlinson. Listen, Brief Fifth Edition (Boston: Bedford/St.\nMartin's, 2004).\n\n9) While we do not encourage it, you may wish to cite a source found on the Internet. If so,\ninclude the title of the entry and try to secure the author's name (which often appears at the very\nend). In addition, you must cite URL (the address of the Internet source).\n\nNorriah, Michael. Beethoven, in Biographies of Classical Composers,\n\nhttp://www.cl.cam.ac.uk/users/mn200/music/composers.html.\n\n10) A word of caution on plagiarism: Using the words or ideas of another person without\nattribution is plagiarism (in other words, the theft of intellectual property). Please remember,\nthere is nothing wrong with quoting or citing a source; what is wrong is NOT citing the source.\nMIT has a strict policy on plagiarism; instances of plagiarism are investigated and punished at\nthe Institute level. In addition, plagiarism will mean automatic failure in this class.\n11) For the sake of clarity, use italics for titles of musical works.\n\nBeethoven's Symphony No. 3 in E-flat Major, \"Eroica\"\n\nBrahms's Tragic Overture\n\nColtrane's version of My Favorite Things\n\nBut if you are citing a portion of a larger work, such as a song, it's OK to use quotation marks.\n\n\"My Favorite Things\" first appeared in the Broadway musical The Sound of Music.\n\nSting's \"Every Breath You Take\" was first released on the album Synchronicity.\n\nMy favorite segment of Schumann's Carnaval is \"Eusebius.\"\n\n12) The first paper must be revised. The second and third may be revised for a higher grade.\nThe original graded paper must be handed in with its revision.\n\n***************************\nNeed a good writing manual?\nTurabian, Kate L. A Manual for Writers of Term Papers, Theses, and Dissertations, 6th\nedition (Chicago: Chicago University Press, 1996), the traditional standard with very specific\nguidelines and directions on formatting, punctuation and style\n\n21M.011 Syllabus, Spring 2006 - 3\nStrunk, William Jr., and E. B. White. The Elements of Style, 4th ed. (New York: Longman,\n2000), this is a little gem of a book (95pp.) on style and usage (no formatting instructions) that\nshould be a part of every person's library; one reading will change your writing!\n\nNeed feedback on your writing?\nTake your paper or a draft to the Writing Center: http://web.mit.edu/writing/\n\n****************************"
    },
    {
      "category": "Resource",
      "title": "essay_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/7f1f9e9b45781b2ae875f0a7be78df03_essay_1.pdf",
      "content": "ESSAY #1\n\nDUE at your second recitation of Week III.\n\nLENGTH: 4 double spaced, single-sided pages (see \"Formatting your papers.\")\n\nTOPIC: compare and contrast (both pieces are in Kerman): (1) Perotin, \"Alleluia. Diffusa est\ngratia\" with (2) Josquin, \"Kyrie,\" from the Missa Pange Lingua considering the text setting, pre-\nexistant material (chant) and the resultant sound\n\nPREPARATION\n1) Listen to the two compositions and write down your general impressions of each piece,\nfocusing on what aspects held your attention. What do you think is the musical (or symbolic)\npurpose of the chant in each? To what extent can the words be understood--and why is this an\nimportant part of the \"resultant sound\"?\n\n2) Carefully read Kerman's descriptions of the following musical elements: melody,\nrhythm/meter, texture and form.\n\n3) Listen to the two compositions again (and again) and think about how each composer used the\nmusical elements listed above in terms of the questions in (1). Does one element seem to take\nprecedence over the others?\n\nTHE FOLLOWING ESSAY STRUCTURE IS EXPECTED (see also \"Formatting your\npapers.\")\n\n1) Title. State or suggest the essay's overall theme in a concise manner. DO NOT merely\ntitle your work \"Essay 1.\" Usually one devises a title AFTER an essay has been written, although\nyou may have an idea about it well before you finish.\n\n2) An introduction of one or at most two paragraphs. This gives the reader an overview\nof the essay to come. The goal of the introduction as a whole is to identify the subject and topic\nof your paper and to explain briefly the method and purpose of your exploration. The\nintroduction of your essay should include the names and composers of the pieces and your\ngeneral impressions of each composition.\n\n3) Body. Develop your points of comparison and/or contrast describing, in as much\ndetail as possible, the melody, rhythm/meter, texture and form of each piece in a series of (about\nfour to six) paragraphs. You may want to organize these by discussing one element at a time.\nRefer to the text of the compositions, to their original context (sacred, secular), and the\nperforming forces as necessary; these might provide additional paragraphs in support of your\ncomparison or contrast. Try to make the essay increasingly strong as its builds to the conclusion.\n\n4) A conclusion of one or at most two paragraphs. Unite your ideas in summary fashion,\nand carry the summary into a strong conclusion (that is, strive to make a final point that extends\nor enriches previous ones). As part of your conclusion, consider the following questions: how are\nthe musical elements used to convey a general mood or meaning and how did your understanding\nor impression of each piece change after listening analytically?\n\nThe assignment has a threefold purpose: (1) to introduce you to the task of writing about music\nclearly; (2) to get you thinking actively about the compositional elements of melody,\nrhythm/meter, texture and form that are introduced early in the semester; (3) to provide a writing\ndiagnostic.\n\nThis essay must be revised and the revision handed in within ten days of the return of the original\nessay from your instructor. The original graded paper must be handed in with the revision."
    },
    {
      "category": "Resource",
      "title": "essay_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/b1e166574217a278d67b3435f123c47f_essay_2.pdf",
      "content": "21M.011 Syllabus, Spring 2006 - 1\nESSAYS #2 AND 4: CONCERT REPORTS\n\nEssay #2 (4 pp.) is due in the second recitation of Week VI (Mar. 16/17).\nDescribe what you saw, heard, and learned in attending two concerts of classical music the first five\nweeks of the semester. This essay may be revised for a higher grade within ten days of the return of the\noriginal essay from your instructor. The original graded paper must be handed in with the revision.\n\nEssay #4 (4-6 pp.) is due in the second recitation of Week XIII (May 11/12).\nThe topic is similar to that of Essay #2, the discussion of two concerts attended between the midterm and\nthe weekend following Week XII. This essay should show an increase in your ability to handle the\ncomponents of musical analysis. You are permitted, but not required, to include the concerts from Essay\n#2 as part of your discussion. For one of the concerts, try to listen in the Music Library to one of the\npieces to be performed in advance of the event, to gain familiarity with it; otherwise, choose a piece from\nthe concert and listen to a recording after hearing it live. Could you hear or feel important differences\nbetween the live performance and the recording? This essay may not be revised.\n\nKeep in mind that right after you attend a program is the best time to write about it.\n\nTypes of concerts. The four concerts you attend should vary, but, in general, should reflect the\nrepertory to which you are being introduced in 21M011: e.g., a Boston Symphony Orchestra concert, a\nstring quartet, a choral concert, a piano or vocal recital, a new-music group, etc. You must attend the\ncomplete concert and discuss, at least briefly, every piece on the program. At least two concerts should\nbe performances by professionals. One concert of jazz, rock, musical theater, folk, ethnic, or pop may be\nincluded with advance permission from your instructor. You may not write about a concert in which\nyou are performing.\n\nForm and style. The essays should be structured like others for the class, but the tone may be\nless formal. Write in a descriptive manner, but do not try to be a music critic-your \"mission\" is to\nshape ideas about these concert experiences into a thoughtful personal essay. Arrange your thoughts in\ncoherent paragraphs (with topic sentences); there should, as always, be a theme and logical argument\ndeveloped throughout.\n\nSome questions to consider. Three topics and sets of questions are given below. You can use\nthese questions to help you collect your thoughts. In Essay #2, you may concentrate on topics a and b;\nEssay #4 should emphasize topic c. Again, write some notes about each concert you attend very soon\nafter the event, while it is still fresh in your mind.\n\na. Personal experience: How did the concert compare to your other musical experiences? Was\nthe music new to you? Did it make sense? What fascinated you, moved you, or surprised\nyou? Why?\nb. The performance: Where did the concert take place? How did that affect your experience?\nHow many players were there? Were they in close communication with one another? Were\nthey directed by someone? What struck you about the way they represented themselves and\nthe music? Did you like or understand their approaches to the music?\nc. Style and character: Discuss the music that you hear using the vocabulary introduced in class:\ntexture, harmony, rhythm/meter, melody, and form. In what ways did the music compare to\npieces studied or performed in 011? Could you detect the style characteristics of the music's\ntime period, genre, or form? Did the program notes help? What were the music's most\nexpressive, exciting, or difficult qualities?\n\nBOTH ESSAY #2 AND ESSAY #4 MUST BE SUBMITTED with concert programs and ticket\nstubs: reports will not be accepted without them. These materials should be enclosed in a pocket\nfolder. Completed Essay #2 must be resubmitted with Essay #4.\n\n21M.011 Syllabus, Spring 2006 - 2\n\nTWO ADDITIONAL SUGGESTIONS: (1) Take notes during the concert on a piece of paper or on the\nprogram--but NOT during the actual performance! This is very disturbing to those around you and\nprevents you from learning by watching and listening. Wait until breaks between pieces or movements to\njot down ideas. Then try to write down further ideas within a day or two of the concert, while your\nmemories are still fresh. (2) Use the concerts to learn how various instruments sound and are played. If\nyou don't know what the instruments are, ask a friend or neighbor in the audience."
    },
    {
      "category": "Resource",
      "title": "essay_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/86bc3ea082b8fed12e770a6df127c407_essay_3.pdf",
      "content": "21M.011\nEssay #3\nDUE: at section Thursday or Friday, April 27 or 28\nLENGTH: 8-10 pages\nTOPIC: The opposition of formal structure and free inspiration in music has been discussed by\ntwo great twentieth-century composers. On the one hand, Igor Stravinsky wrote:\nIt is a fact of experience, and one that is only seemingly paradoxical, that we find freedom\nin a strict submission to the object.... Let us take the best example: the fugue, a pure form\nin which the music means nothing outside itself. Doesn't that fugue imply the composer's\nsubmission to the rules? And is it not within those structures that he finds the full\nflowering of his freedom as a creator?\nOn the other hand, Aaron Copland has written:\nAn imaginative mind is essential to the creation of art in any medium, but it is even more\nessential in music.... In saying this I am not forgetting that music has its disciplines: its\nstrict forms and regular rhythms, and even in some cases its programmatic content. Music\nas mathematics, music as architecture or as image, music in any static, sizable form has\nalways held fascination for the lay mind. But as a musician, what fascinates me is the\nthought that by its very nature music invites imaginative treatment, and that the facts of\nmusic, so called, are only meaningful insofar as the imagination is given free play.\nAre these two statements diametrically opposed? Do they assume two mutually exclusive\nways of composing (and two different ways of listening)? Is there a relation between form and\nmeaning in music? Is there meaning in the form or is meaning separate from form? How does\nthe relation differ from piece to piece?\nYour paper should focus on three works from Kerman in the following way:\n(1) Beethoven's 5th Symphony, second movement AND one each from the following (2)\nChaikovsky, or Brahms, or Musorgsky or Mahler, (3) Ravel, or Bartok, or Debussy, or two\nconsecutive movements from Crumb's Black Angels. You may refer to other works, but the\nmain argument of your paper should revolve around your three specifically chosen pieces.\nThis is an analytic essay; please refer to the guidelines for Essay #1. Your argument will\ndepend on the evidence you draw from your understanding of the texture, harmony, melody,\nrhythm/meter, and form of your chosen pieces. You could also discuss tempo, dynamics,\ntimbre/sound, articulation, as well as performance context and expression. However, you\nshould bear in mind that this is an interpretive analysis for which there is no \"right\" answer.\nYou have in general written more freely in your concert papers than in the first analytic essay,\nin part because you felt free to express your reaction to the music you have heard. You have\nthat opportunity here as well, with the caveat that your opinion needs to be supported by\nevidence (as, indeed, you tended to do in your concert papers). Do not simply describe the\npieces you chose (\"the oboe plays a cadenza in the recapitulation\"). If you include\ninformation, it should be evidence for your argument.\nYour first paragraph should introduce the issue you have chosen to discuss and your argument;\nthe second paragraph should introduce the compositions you will use to make your point. A\nclosing paragraph or two should sum up your points and present your conclusion."
    },
    {
      "category": "Resource",
      "title": "essay_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/1ffce2d0cc3576865e77ac7e30217767_essay_4.pdf",
      "content": "21M.011 Syllabus, Spring 2006 - 1\nESSAYS #2 AND 4: CONCERT REPORTS\n\nEssay #2 (4 pp.) is due in the second recitation of Week VI (Mar. 16/17).\nDescribe what you saw, heard, and learned in attending two concerts of classical music the first five\nweeks of the semester. This essay may be revised for a higher grade within ten days of the return of the\noriginal essay from your instructor. The original graded paper must be handed in with the revision.\n\nEssay #4 (4-6 pp.) is due in the second recitation of Week XIII (May 11/12).\nThe topic is similar to that of Essay #2, the discussion of two concerts attended between the midterm and\nthe weekend following Week XII. This essay should show an increase in your ability to handle the\ncomponents of musical analysis. You are permitted, but not required, to include the concerts from Essay\n#2 as part of your discussion. For one of the concerts, try to listen in the Music Library to one of the\npieces to be performed in advance of the event, to gain familiarity with it; otherwise, choose a piece from\nthe concert and listen to a recording after hearing it live. Could you hear or feel important differences\nbetween the live performance and the recording? This essay may not be revised.\n\nKeep in mind that right after you attend a program is the best time to write about it.\n\nTypes of concerts. The four concerts you attend should vary, but, in general, should reflect the\nrepertory to which you are being introduced in 21M011: e.g., a Boston Symphony Orchestra concert, a\nstring quartet, a choral concert, a piano or vocal recital, a new-music group, etc. You must attend the\ncomplete concert and discuss, at least briefly, every piece on the program. At least two concerts should\nbe performances by professionals. One concert of jazz, rock, musical theater, folk, ethnic, or pop may be\nincluded with advance permission from your instructor. You may not write about a concert in which\nyou are performing.\n\nForm and style. The essays should be structured like others for the class, but the tone may be\nless formal. Write in a descriptive manner, but do not try to be a music critic-your \"mission\" is to\nshape ideas about these concert experiences into a thoughtful personal essay. Arrange your thoughts in\ncoherent paragraphs (with topic sentences); there should, as always, be a theme and logical argument\ndeveloped throughout.\n\nSome questions to consider. Three topics and sets of questions are given below. You can use\nthese questions to help you collect your thoughts. In Essay #2, you may concentrate on topics a and b;\nEssay #4 should emphasize topic c. Again, write some notes about each concert you attend very soon\nafter the event, while it is still fresh in your mind.\n\na. Personal experience: How did the concert compare to your other musical experiences? Was\nthe music new to you? Did it make sense? What fascinated you, moved you, or surprised\nyou? Why?\nb. The performance: Where did the concert take place? How did that affect your experience?\nHow many players were there? Were they in close communication with one another? Were\nthey directed by someone? What struck you about the way they represented themselves and\nthe music? Did you like or understand their approaches to the music?\nc. Style and character: Discuss the music that you hear using the vocabulary introduced in class:\ntexture, harmony, rhythm/meter, melody, and form. In what ways did the music compare to\npieces studied or performed in 011? Could you detect the style characteristics of the music's\ntime period, genre, or form? Did the program notes help? What were the music's most\nexpressive, exciting, or difficult qualities?\n\nBOTH ESSAY #2 AND ESSAY #4 MUST BE SUBMITTED with concert programs and ticket\nstubs: reports will not be accepted without them. These materials should be enclosed in a pocket\nfolder. Completed Essay #2 must be resubmitted with Essay #4.\n\n21M.011 Syllabus, Spring 2006 - 2\n\nTWO ADDITIONAL SUGGESTIONS: (1) Take notes during the concert on a piece of paper or on the\nprogram--but NOT during the actual performance! This is very disturbing to those around you and\nprevents you from learning by watching and listening. Wait until breaks between pieces or movements to\njot down ideas. Then try to write down further ideas within a day or two of the concert, while your\nmemories are still fresh. (2) Use the concerts to learn how various instruments sound and are played. If\nyou don't know what the instruments are, ask a friend or neighbor in the audience."
    },
    {
      "category": "Lecture Notes",
      "title": "week01_lecture01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/efee8ff57624686c2f4c5790d62823cc_week01_lecture01.pdf",
      "content": "C\n21M011 (spring, 2006)\nEllen T. Harris\nLecture I\nIntroduction (with in-class examples)\nMusic exists in time and is notated on a vertical and horizontal axis. The vertical axis\nrepresents sounds heard simultaneously. The horizontal axis consists of the unfolding of\nmusic over time, as a melodic, harmonic and rhythmic progression. The vertical and\nhorizontal can be easily grasped in terms of a simple round, like \"Row, row, row your\nboat.\" If everyone sings the tune together, the resultant melody represents a horizontal\nline. If sung as a four-part round, a distinct vertical element is created by the\nsimultaneities as the different voices enter in delayed sequence. This can be graphed as\nfollows. The tune itself has four parts:\nA\nRow, row, row your boat,\nB\nGently down the stream.\nMerrily, merrily, merrily, merrily,\nD\nLife is but a dream.\nAs a melody, this reads: ABCD. Once the melody is sung as a round, the vertical\nelement begins to appear:\nA B C D A B C D A ...\nA B C D A B C D A...\nA B C D A B C D A...\nA B C D A B C D A...\nNote that once all the voices enter, the vertical column becomes: A\nB\n\nC\n\nD,\n\nwhich repeats over and over again. This sound can be duplicated by having each of the\nfour sections sing only one phrase over and over again, such as AAAA, or BBBB. The\nsound columns remain the same. The reason a round works is that each of the phrases\n\"works\" with the others over a repeating harmonic pattern. In \"Row, row, row your\nboat,\" the pattern essentially consists of the repetition of a single chord (with an upbeat\nleading into it to provide rhythmic and harmonic impetus). That is, each phrase (giving\nan Arabic number to each chord) is simply: 1 1 . Or, possibly 1 (2)-1 (2)- .\nA longer pattern exists in the familiar \"Heart and Soul,\" based on four chords. This four-\nchord pattern is frequently used: its four \"vertical columns\" also support such familiar\nsongs as \"Blue Moon\" and \"Santa Catalina\" (\"Twenty-six miles across the sea\")\noriginally sung by the Four Preps in 1958. What does this shared bass mean? First, it\nmeans that all these songs can be sung together (which is a lot of fun).\nHeart and soul,\nI fell in love with you. Heart and soul, ...\nTwenty-six miles across the\nsea,\nSanta Catalina\nBlue\nmoon\nI saw you standing\nalone, ...\n\nSecondly, like \"Row, row, row your boat,\" it means that any of these songs can be sung\nas a round over the repeating four chords--or, if you have enough people, all of the\nsongs can be sung as rounds together.\nNotated music has five components that determine what is played: texture (how the\nvarious parts intertwine); harmony (the vertical axis and its progression over time);\nrhythm (duration and organization into strong and weak beat patterns); melody (the\nhorizontal tune or tunes); and form (large-scale organization in terms of repeated, varied\nor contrasting units). These are all important things to notice about any piece of music.\nIn addition composers can add notations about how the notated music should be\nperformed: dynamics (volume), tempo (speed), timbre (by what instruments or voices),\narticulation (for example, legato [smooth connections between notes] or staccato [short,\nindividual attacks] ). These are all things we will consider as we consider the history of\nWestern classical music.\nMiddle Ages\n-fall of the Roman Empire (476) to 1400\n-Robin Hood, King Arthur; St. Augustine, Charlemagne, St. Francis of Assisi, St.\nThomas Aquinas, Dante, Petrarch, Boccacio, Chaucer\n-a period of massive migration and privation due to repeated invasions, famine and\nplagues\n-education and technology of ancient Roman and Greek civilizations were lost in the\nWest (just as previously the advances of Egyptian and Babylonian cultures were lost)\n-this period called the \"dark ages\"\nMusic (sacred and secular)\nChant (or, plainchant) is the starting point for the history of Western music because it is\nthe first music to be notated, collected, and preserved. Its liturgical function within the\nCatholic church is, of course, responsible for its codification. However, chant was not\nnewly discovered by the Catholic church, but was and remains a function of many, if not\nmost, religious liturgies, Jewish, Muslim and Christian. The Catholic chant of the\nMiddle Ages derives from earlier Byzantine and Jewish chant through an oral, not written\ntradition. Development of musical notation occurs in about the 9th c.\n1) Preface: \"Vere dignum\": introduction to the mass (the liturgical service of the\nCatholic Church (Kerman/Tomlinson disk 1, track 1: henceforth K 1.1)\n-reciting tone\n-formulaic: ascending to the reciting tone, declaiming the text, descending at end of\nphrase\n-repetition of this formula\n2) Antiphon: In paradisum: chant for the burial service , requiem (mass for the dead)\n(K 1.2)\n\nrhythm: no regular pulse\nform: no repetitive structure\n\ntexture: monophony\ntimbre: men's voices\nmelody: free-floating, with line rising upward on \"paradisum\" and extended\nover many syllables (a melisma) on \"aeternum\" (eternal), a kind of \"word-painting\"\nmusic is meant here to lift the listener away from the everyday world, away from\nthe physical, to the meditative and spiritual\n*Please note that Kerman/Tomlinson mistakes the Biblical reference to Lazarus in this\ntext, associating it with the raising of Lazarus from the dead by Jesus (John 11: 1-54).\nRather the text alludes to the parable of Lazarus the beggar who is raised to heaven in the\nbosom of Abraham (Luke 16: 9-31).\nThanks to Martin M. Marks (Music Faculty) for making this correction.\nqualities:\n-monophonic (all male)\n-non-tonal (modal)\n-non-metrical (free rhythmically)\n-conjunct; small range\n-text-setting: largely syllabic (one note for each syllable)\n-through composed (without formal repetition)\n-context: processional--repeated as many times as necessary during transport of the body\nfrom the church to the burial ground\n3) Hildegard von Bingen\n\"For Hildegard, music was an avenue of access to mystical experience. She composed\nmusic as a way to make palpable God and divine beauty\" (Karin Pendle, Women and\nMusic [Indiana University Press, 1991])\nAlthough the church forbade the singing of women in church or in public, cloistered\nwomen were encouraged to create and perform their own music. Through the\nseventeenth century, the religious calling (or profession) offered women a creative outlet\nthat was not possible anywhere else in society.\nHildegard thought of the human soul as \"symphonic,\" which expressed itself by tuning\nitself to the celestial music of the spheres not only by responding to musical vibrations\nbut by creating harmony with the human body with singing.\nSequence: Columba aspexit (K 1.3)\nform AA' BB' CC' . . .\n(beginning of congregational singing, responsorial, \"call and response\": soloist sings the\nfirst text phrase and the congregation--here a congregation of nuns--responds with the\nnext text phrase (which is written to be parallel in length and rhythm) using the same\nmusic; for each set of paired phrases this pattern repeats using different music)\ntexture: monophonic with drone accompaniment\n\nharmony: modal\nrhythm: free\nmelody: mostly conjunct, wide range (especially upper range)\ncontext: cloister\nexpression: regulated (in form) and ecstatic (in melody)\nperformance: all female\nWhereas sacred music was meant to create an out-of-body, transcendental religious\nexperience, either through meditation (repetitive chanting) or ecstasy (soaring melodies),\nsecular music and composition emphasized earthly and bodily needs and desires. This\nmusic uses rhythm to make the body respond and clarifies its formal structure with\nclearly audible forms.\nSecular: Troubadours, trouveres, minnesingers (wandering minstrels)\nsongs: strophic; each strophe=aab\njazzy accompaniment: and \"activated\" pitch drone using a repeated rhythmic pattern\n4) Bernart de Ventadorn, \"La dousa votz\"-- late 12th c. (K 1.4)\nrhythm strong pulse\nform AAB, strophic\n\ntimbre: monophony accompanied on stringed instrument (the oud, or early\nlute/guitar)\nPolyphony\norganum developed out of chant as a kind of vertical embellishment or elaboration\nchronological development is from simple to more and more elaborate, although a good\ndeal of overlapping between categories can also be assumed\nparallel organum: accompanying voice moves along with the chant note for note in\nparallel motion\nmelismatic organum: many notes in the upper, newly composed voices to one of the\noriginal chant\n5. Perotin: melismatic organum: \"Alleluia: Diffusa est gratia\" (1200) (K 1.5)\ntexture: polyphonic; non-imitative counterpoint (3 voices)\nharmony: modal\nrhythm: free on bottom; measured and elaborate on top\n\nmelody: undulating and entwining; very melismatic\nform: organized by texture (and melody): chant--organum--chant\nThe monophonic chant consists of an \"alleluia,\" which is itself melismatic\n(compare to the more syllabic \"In paradisum.\" The last syllable of the \"alleluia\"\nis typically extended into a huge melisma called a \"jubilus\" (think \"jubilation\" or\n\"jubilee\"). The biblical verse (\"Diffusa est gratia\") is then set as polyphonic\norganum, but its last two words (\"in aeternum\"/ in eternity) are sung to the\nmonophonic jubilus. The monophonic \"alleluia\" then repeats.\nFunction:\nAlleluiaÆjubilus\nbiblical verseÆjubilus\nAlleluiaÆjubilus\nTexture:\nchant\n\norganum----Æchant\nchant\ncontext: liturgical\nperformance: all male, all vocal\n**expression: lowest voice (chant) = cantus firmus: a religious foundation supporting the\nearthly intertwining of the upper voices, symbolic of the church as--\n\"a mighty fortress,\"\n\"how firm a foundation,\"\n\"on this rock will I build my church\"\nblending of sacred and secular; world view that has secular supported by the sacred;\narchitectonic\n6) motet: Machaut: \"Quant en moy\" (1350) (K 1.6)\n-smaller rhythmic units: repeated bricks rather than long layers\n-cantus firmus: repeated measured chant\n-sacred and secular merger emphasized by used of different texts and different languages\n(religious and vernacular)\n-cantus firmus=instrumental (wordless)\nmusical construction changes here from joining the flow of celestial harmony to\nrecreating the mathematical formulas found in the nature\nconsciously compositional and calculating\nfrom the bottom to the top, each line of music is increasingly active: the chant segments\nmove the most slowly, the middle voice moves at a moderate pace, the upper voice\nmoves very quickly; this is related to text: the bottom line is untexted, the middle line\nsets about half as much text as the upper line\nform: each stanza of the poem is set to music in the same rhythm but not the same\nmelody, which can be heard best in the hockets, where the two upper voices interact with\none another in quick succession with short motives; because the upper two voices have\ndifferent texts, the hockets provide the only moments when the text is clear--offering a\nkey to the meaning of the piece\n\nisorhythm: creating cycles of sound through repetitive rhythms without a repeating\nmelody"
    },
    {
      "category": "Lecture Notes",
      "title": "week02_lecture02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/67bd1c59e3e12173afc2c9e4a9088084_week02_lecture02.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\n\nLecture II\n\nRenaissance (1400-1600)\n\n-growing role of the individual and lessening authority of the church (Renaissance\nhumanism)\n-Reformation: Martin Luther (1483-1546); Church of England (1534)\n-rise of city states and the era of princes: rule of the Medici (from 1430), Machiavelli\n(1469-1527)\n-age of exploration and scientific discovery: Copernicus (1473-1564), Columbus (first\nvoyage 1492), Da Gama (voyage to India 1497), Leonardo da Vinci (1452-1505)\n-development of printing press and disbursement of knowledge: Gutenberg (1398-1468)\n-great artists: Albrecht Durer (1471-1528), Michelangelo (1475-1564), Shakespeare\n(1564-1616)\n\nContinuing use of medieval musical structures in the Renaissance:\n\ncantus firmus techniques\n\nfragmentation and repetition of chant in all parts as impetus\n\n(origin)\nas well as these differences:\n\ngrowing role of the individual and lessening authority of the church (Renaissance\nhumanism)\n\nincreased tunefulness (melody and rhythm)\n\nA Cappella Sacred Music\n\n1) Dufay, \"Ave maris stella\": harmonized Gregorian hymn (K 1.7)\n\nparaphrase of chant melody (ornamented and rhythmicized)\n\nhomophony\n\n***If the great discovery in music of the middle ages is the development of a musical\narchitecture, moving from a layering process to a more motivic (brick-like) construction,\nin which rhythmic, metered, and secular melodies are supported by and constructed out\nof sacred origins,\n\n***then the great musical discovery of the renaissance was the development of points of\nimitation, humanly-conceived and independent of chant, as the means of creating large-\nscale and multi-voiced musical structures. Ideal of equality/balance among all the parts\n(compare to organum or Machaut's \"Quant en moi\") and of a cappella singing. Text-\ndominated composition vs. layers/patterns of construction.\n\n2) Josquin, Pange lingua Mass, \"Kyrie\" and \"Gloria\" (K 1.8 and 9)\n\n\"Kyrie\": points of imitation\nPlease note that Kerman/Tomlinson gives a simplified analysis of this movement. He\nwrites that the Kyrie has one point of imitation, the Christe has two, and the final Kyrie\nhas one. This is a relatively easy way to hear the piece. If you want to try to listen\nharder, this is what you must keep in mind. The chant on which this movement is based\nhas six phrases. Kerman/Tomlinson gives them in the right margin of p. 80. Josquin\nbuilds a point of imitation on each of these in order, emphasizing the opening motive of\neach. The first two occur in the first Kyrie, but do not differ significantly from each other\nas the first emphasizes a rising and falling half-step, whereas the second emphasizes the\nrising and falling whole step. In the succession of entries given by Kerman/Tomlinson,\nthe first point consists of tenor, bass, wait, soprano, alto. After his second wait, the\nsecond point consists of the following three entries for bass, tenor and soprano. The two\npoints in the Christe, based on phrases 3 and 4 of the chant are easier to distinguish as the\nsecond point begins with the first entry of the word \"eleison.\" The final Kyrie begins\nwith a point of imitation on phrase 5, which Josquin disguises somewhat by omitting the\nfirst note of the chant phrase and using a falling and rising third; its entrances occur in\ndescending order of soprano, alto, tenor, bass. The last point follows and is built on the\nsame opening motive as the second point of the Christe with descending entries (as in\npoint 5): soprano, alto, [tenor--very free], bass. You do NOT need to be able to hear all\nthis, but it's worth trying to capture it with repeated listening.\n\n\"Gloria\": beginning of polyphonic textural contrast\n\n3) Palestrina, Pope Marcellus Mass, \"Gloria\" (K 1.10)\n\nReformation (Luther: 1517)/Counter-Reformation (1545)\n\nhomophony/rich vocal sonority\n\nMadrigal\n\nWith the development of texture-driven formal structures, came the idea of contrast.\n(Josquin, Palestrina). Textural contrast, in connection with increased personal\nexpressiveness, led to an increased emphasis on the text. Although this is apparent in all\nvocal music, sacred and secular, it is particularly obvious in the secular madrigal. This\nform of secular a cappella part-song was established in Italy and then flowered separately\nin England. The illustration of specific words in music is often called madrigalism as a\nresult. It is also called word-painting.\n\n4) Thomas Weelkes (c. 1575-1623) (K 1.11)\n\nAs Vesta was from Latmos hill descending\nShe spied a maiden Queen the same ascending,\nAttended on by all the shepherds' swain;\nTo whom Diana's darlings came running down amain\nFirst two by two, then three by three together\nLeaving their Goddess all alone, hasted thither;\nAnd mingling with the shepherds of her train,\nWith mirthful tunes her presence did entertain.\n\nThen sang the shepherds and nymphs of Diana:\nLong live fair Oriana!\n\nPlease note that Kerman/Tomlinson gives the traditional reading of this text, saying that\nOriana represents Queen Elizabeth I. This older view has now been corrected in an\narticle published in the Journal of the American Musicological Society in January 2006.\nThe association with Elizabeth only arose in the late 18th century and has continued since\nthat time. In fact, Oriana represents Ann of Denmark, queen of King James VI of\nScotland, who became King of England (James II) after Elizabeth's death. This madrigal\nsupports his succession during the lifetime of Elizabeth, which was treasonous. In this\nmadrigal, Vesta (the virgin goddess) represents Elizabeth descending; Oriana (the good\nwife of the legendary Amadis) represents Queen Ann rising; Diana, who celebrates the\narrival of Oriana, represents the sister of Lord Essex who had just been executed for\ntreason.\n\nJohn Farmer (b. c1570): \"Fair Phyllis\"\n\nFair Phyllis I saw sitting all alone\n\nmonophony (\"all alone\")\nFeeding her flock near to the mountain side.\n\nhomophony (\"flock)\nThe shepherds knew not whither she was gone\n\nimitation (shepherds' confusion)\nBut after her lover Amyntas hied.\n\necho (Amyntas following)\nUp and down he wandered whilst she was missing,\nup and down (up and down!)\nWhen he found her, O, then they fell a-kissing.\n\ntriple meter, dance-like\n(fell a-kissing\")\n\nThe repetition of the last two lines then changes the grammatical structure and adds an\nadditional sexual charge to the madrigal--\"O, then they fell a-kissing up and down ...\"\n\nRecording: The King's Singers' Madrigal History Tour, Anthony Rooley, conductor\n(EMI Records, 1989)\n\nInstrumental Music\n\nIncreasing development of instrumental music as a self-sustained genre independent of\naccompaniment through the dance\n\n5.1) \"Daphne\" (K 1.12)\n\n5.2) \"Kemp's Jig\"--late 16th c. (K 1.13)\n\nrhythm strong pulse\n\nform AAB\n\nB=aab\n\nb=aab\n\n(that is, each B divisible into aab through two levels)\n\nmelody continual and increasing elaboration, ornamentation\n\ntimbre: contrast of recorder and string instrument\n\nEARLY BAROQUE (1600-1650)\n\nmedieval: architectonic\nrenaissance: humanistic expression\nearly baroque: personal expression in solo song and opera\n\nMotet\n\n6) Gabrieli, O magnum mysterium (pub. 1615) (K 1.14)\n\nnot a biblical text\nword painting (sacred madrigal)/ \"O\" astonishment\ninstrumental accompaniment: \"sumptuous blend of brass instruments and voices\"\nwider range of sound; in particular, rich bass sound\nsequence: at beginning and end\nantiphonal writing"
    },
    {
      "category": "Lecture Notes",
      "title": "week03_lecture03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/70eb2414c59c44cc0d10d699e222a167_week03_lecture03.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\nLecture III\nBaroque (order and extravagance)\nScience: Newton (mechanics, gravity), Leibniz, Harvey (circulation of the blood), Kepler\nPhilosophy: Descartes (analysis and classification of human emotions), Spinoza, Locke,\nHume (individual and the state)\nArt: Rubens, Bernini, Tiepolo, Velasquez; elaborate formal gardens indicating man's\ncontrol over nature\nLiterature, Drama and poetry: Milton, Racine, Dryden; birth of the novel: Fielding (Tom\nJones), Defoe (Robinson Crusoe)\nExploration and colonialism: Hudson explores the later-named Hudson River (1609);\nlanding of Pilgrims at Plymouth (1620); Manhattan bought from native Americans\n(1626); Boston founded (1630); Harvard University founded (1636)\nPolitics: absolutism (\"divine right of kings\") supplanting the Church as power base\n(Louis XIV [1638-1715]; Peter I, Tsar of Russia), Thirty Years War (1618-1648),\nEnglish Civil War and Commonwealth period (1642-1660)\nRise of instrumental music\ntriple derivation: 1. dance and 2. virtuosity (e.g. Kemp's Jig), and 3. vocal music (form\nand texture)\nStyle features:\nTexture: continuo homophony and counterpoint (points of imitation)\nHarmony: 1) \"functional harmony\": each chord has its own function in relation to the\nhome chord or tonic; 2) change from Renaissance: instead of 8 church modes, 2 modes\n(major and minor) transposable to/interchangeable at any pitch; 3) tuning (equal\ntemperament) allowed free transposition; 4) increased use of dissonance as a means of\nincreasing intensity and forward motion\nRhythm: definite and regular; clear meter, repeating beat patterns (dance), energy\nMelody: extended (spinning out \"endlessly\"), ornamented and ornate, embedded use of\nsequence\nForm: ground bass and ritornello (derived from vocal music)\nDynamics: strong contrasts (solo, ripieno; echo effects)\nTone color/Timbre: vastly increased in variety and originality, but in many cases flexible;\n\"birth\" of orchestra with core of strings (Louis XIV); continuo\nTempo: tends to be regular with even beat patterns (related to dance)\nToday's genre:\nConcerto (concerted [to bring together] or \"concertare\" [to dispute or contend])\n\nsolo vs. ripieno\nmovements in the tempo pattern fast-slow-fast\nTerms:\nconcerto/ concerto grosso\nbasso continuo/ continuo/ figured bass (harmonic support of Baroque music, a bass line\nwith numbers [figures] that indicate the specific chords; used in all but solo\nkeyboard music)\nground bass/basso ostinato (found in Frescobaldi, Passacaglia; Vivaldi, slow movement;\nPurcell, aria; note: \"ostinato\" also used to depict repeated unit anywhere, not\njust in bass)\nwalking bass (a bass that moves in absolutely even notes, i.e. that \"walks\": Bach Suite,\nAir)\n(compare all three of the above to cantus firmus)\nritornello (return/refrain), theme, motive\nsolo, ripieno (full, ripe), tutti\nsuite, movement\ncadence, cadenza\nsequence (not to be confused with medieval sequence)\nfugue, entry\n1) Vivaldi, Violin Concerto in G, La stravaganza, Opus 4, No. 12 (1712-13) K 1.23\nfirst movement: fast, ritornello form\nNote: 1) segmented ritornello (here abc), with the return of sections\n2) sequence in b\n3) increasing freedom of ritornello\n4) solos largely episodic\nsecond movement: slow, ground bass (variation form) K 1.24\nNote: 1) major to minor shift in variation 5&6\n2) perhaps more familiar example is Pachabel's \"Canon\"\nthird movement: fast, free ritornello form K 1.25\nNote: 1) opens with solo\n2) Rit. 2 not related to Rit. 1\n3) Rit. 3: minor\n2) Bach, Brandenburg Concerto No. 5 for flute, violin, harpsichord, and orchestra\n(before 1721)\nPerformed by\nConcertino:\nOle Nielsen, flute (G) Electrical Engineering and Computer Science\nAmanda Wang, violin (G) Electrical Engineering and Computer Science\nMary Farbood, harpsichord (G) Media Arts and Sciences\nRipieno:\nJacqueline O'Connor, violin (06) Aeronautics and Astronautics\nMarcus Thompson, viola (Faculty) Music and Theater Arts\n\nSunny Wicks, cello (07) Aeronautics and Astronautics\nPaul Glenn, bass (guest) President of Bauer Associates\nKerman/Tomlinson provides the first movement only; we will study the entire work. The\nrecording we will use for these movements is Boston Baroque, Martin Pearlman, director,\nBrandenburg concertos nos. 4, 5 & 6 (Telarc, 1993)\nfirst movement: fast, ritornello form K 2.1-5\nNote: 1) segmented ritornello as in Vivaldi (abc)\n2) solos contain recurring motives of their own (not just episodic): (a)\ndescending scale, (b) triplets, (c) version of Rit. \"b\"\n3) long center section dominated by solos, unique motives\n4) opening section (R1-R5) closed in tonic key, returns after center\nsection at R7, creating large ABA' form\n5) A' differs from A by inclusion of large cadenza (parallel to da capo\nform)\nsecond movement: slow, ritornello form\nNote: 1) solo instruments only: trio sonata texture (two treble parts with\ncontinuo)\n2) continuing use of ritornello form with the contrast of solo vs.\nripieno; ripieno signaled by harpsichord playing as continuo\n3) \"solos\" (or episodes) have independent motivic structure,\nnevertheless related to ritornello theme, with independent, solo\n\nharpsichord part (1st episode at 0:42 in Pearlman)\n4) inversion of episode theme (2nd episode at 1:26 in Pearlman)\nthird movement: fast, fugue\nNote: 1) fugue is like one enormous point of imitation\n2) soloists begin; ripieno treated as additional soloists\n3) the equality of the parts (entries) makes this essentially an ensemble\nmovement without typical ritornello/solo alternation\n4) opening section includes all the entries followed by material related\nto fugue theme, moving away from tonic and returning for strong\ntonic cadence (at 1:16 in Pearlman)\n5) middle section largely for soloists with tutti interjections;\n\nharpsichord increasingly dominates, harmonic pedal increases\n\ntension before return to tonic (at 3:46 in Pearlman)\n6) final section is exact repetition of first (=da capo form)\nOther baroque instrumental forms discussed in section:\ndance suite (repeated binary form; minuet-trio form)\nFrescobaldi (canzona = early fugal form based on point of imitation; passacaglia = type\nof ground bass) K 1:19-22\nBach (walking bass)\nfugue Bach, Art of Fugue K 1.26-27"
    },
    {
      "category": "Lecture Notes",
      "title": "week04_lecture04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/1521e03d818d51afa6a04a252a5ab6ca_week04_lecture04.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\nLecture IV\nBaroque Vocal Music\nGenres:\nTerms:\nopera (per musica)\n\naria\n\n(air)\n\nopera seria\n\nrecitative\n\nopera buffa\nsecco (simple)\noratorio\naccompanied\nchurch cantata\nword-painting\n\ncastrato\nOpera\n1. Monteverdi, The Coronation of Poppea (1642) K 1.15-16\nrecitative: recitation, declamation, syllabic, fluid/free form, reduced accompaniment\ncontinuo: bass line played by cello and harmonized by harpsichord or lute\naria: more elaborate, ornamented, repetitive forms, richer accompaniment\ncastrato: male treble, virtuoso singer\nmusic as drama\nmusical characterization of individuals\n2. Purcell, Dido and Aeneas (1689)\nRecitativeÆ ariaÆ chorus\nRecitative: \"Thy hand, Belinda\" K 1.17\nVocal descent through chromatic line, as Dido sinks into death\nLargely syllabic recitation, but still with some melismas (\"darkness\" extended\nlike a miasma around her)\nAria: \"When I am laid in earth\" K 1.17\nChromatic ground bass (relentless fate)\nRising vocal line pushes away and cadences overlap (elide) until Dido \"meets\"\nher fate at the joint vocal and ground bass cadence (\"forget my fate\")\ninstrumental postlude: full chromatic scale from top of register\nRecitative and Aria performed by Ellen Harris (music faculty), voice and piano\nChorus: \"With drooping wings\" K 1.18\n\nFull diatonic scale from top to bottom (moving from the transcendental to those\nleft on earth to mourn)\nMadrigal word-painting: \"drooping,\" \"scatter,\" \"soft,\" \"never\"\n\n3. Handel, Giulio Cesare (1724): opera seria\nRecitativeÆ aria\nRecitative: more like recitation, less melody, moves very quickly (secco or simple\nrecitative) NOT INCLUDED with example\nAria: \"La giustizia\" (\"Justice\") K 2.8\nda capo form\nunison violins and continuo\n\"revenge aria\": one of many types of affects depicted by da capo arias\nsingularity of the accompaniment\nrushing scales and forward motion\n\nespecially long coloratura (melismas) on \"vendetta,\" \"traditor\" (=arrow\nready for vengeance)\nhigh notes on \"punire\"\nornamentation on da capo makes it less a repetition and more of a heightening\n(racheting up) of intensity\n4. other examples of Handel arias, showing da capo form, manipulation of the formal\ntemplate, instrumentation\nRinaldo (1711) complete recording: Cecilia Bartoli with Christopher Hogwood,\nconductor (l'Oiseau-lyre, 2000)\n1. Armida (a sorceress): da capo aria\n(harpsichord solo in the A section; in the B section strings pizzicato in running eighths)\nA: Vo' far guerra, e vincer voglio\ncollo sdegno chi m'offende\nvendicar i torti miei.\nI shall wage war, and will defeat\nwith disdain the man who has insulted me\nto avenge my wrongs.\nB: Per abbatter quell'orgoglio,\nch'il gran foco in sen m'accende,\nsaran meco i stessi Dei.\nThe gods themselves will be with me\nin crushing the pride\nthat enrages me.\nA: da capo\n2. Armida: accompanied recitative and da capo aria\n(accompanied recitative: strings reflect her shifting mood--longing and agitated)\n(longing bassoon-oboe duet in A section moving into 2-note motive: \"crudel\" and\n\"pieta\"; in B section raging runs in orchestra and voice)\nrecitative\nDunque i lacci d'un volto,\nSo the snare of a face,\ntante gioie promesse,\nthe promise of so much joy,\nli spaventi d'Inferno,\nand the terrors of hell\nforza n'avran per arrestar quel crudo?\nare not strong enough to hold that cruel\nman?\nE tu il segui, o mio core!\nMy heart, you go with him!\n\nFatto trofeo d'un infelice amore!\nNo:// si svegli 'l furore,\nsi raggiunga l'ingrato,\ncada a' miei pie svenato.//\nOhime! Che fia!\nUccider l'alma mia?\nAh! Debole mio petto,\na un traditor anco puoi dar ricetto?//\nSu, furie, ritrovate\nnova sorte di pena e di flagello;\ns'uccida, si.// Eh! No. ch'e troppo bello.\nYou are the trophy of an unhappy love!\nNo:// let my anger arise,\nand find the ungrateful man,\nlet him fall lifeless at my feet.//\nAlas! How can it be?\nCan I kill the man I love?\nAh, my feeble heart,\nCan you shelter a traitor still?//\nArise, furies, and discover\nnew types of pain and punishment;\nlet him die.// Ah, no, for he is too handsome.\naria\nA: Ah, crudel!\nil pianto mio,\ndeh! Ti mova per pieta.\nAh! Cruel man,\nfor pity's sake,\nbe moved by my tears.\nB: O infedel\nUnfaithful\nal mio desio\nto my desire\nproverai la crudelta.\nyou will feel my cruelty.\nA: da capo\n3. Semele (1744) after the manner of an Oratorio, complete recording: Samuel Ramey\nwith John Nelson , conductor (Deutsche Grammophon, 1990)\nSomnus (the god of Sleep):\nA: Leave me, loathsome light.\nReceive me, silent night.\nB: Lethe, why does thy ling'ring current cease?\nOh, murmur me again to peace.\n(rich four-part strings; Somnus becomes increasingly tired and falls asleep at the end of\nthe B section; listen to how incomplete the aria sounds--not only have you become\naccustomed to hearing the return of text and music, but listen for the ending in the\n\"wrong\" key that is not the key of the beginning)\nThe Enlightenment can be defined in part by its interest in rational methods of analysis\nand classification; it was the era of the encyclopedists; we find this outlook in Bach's\nexploration of all 24 keys in the Well-Tempered Clavier or in his close examination and\nexplication of contrapuntal methods in the Art of the Fugue; similarly, Handel, in his\nlifetime (in opera, oratorio, cantata), wrote over 2000 arias, resulting in an encyclopedic\ninvestigation of human emotion.\nSee next page for comparison of da capo, ritornello, and fugue form.\n\nDa Capo form (typical \"five-part\" pattern of late Baroque era):\nA\nR1\nS1 (=A1)\nR2\nS2 (=A2)\nR3\n||\nhome key\n\nnew key(s)Æ\n\nhome key\n(these 5 parts=A section)\nB\nS3 (=B section)\nnew keyÆ\nA\nda capo (\"from the head\" or \"from the top\": from R1 to R3)\nRitornello form:\nBrandenburg #5, mvt 1 (shown in relation to da capo form)\nA\n\n(=A1)\n\n(=A2)\n\nR1\nE1\nR2\nE2\nR3\nE3\nR4\nE4\nR5\nmedium\ntutti\nsolo/t t\ns(t)\nt\ns(t)\nt\ns(t)\nt\nmotives\nabc\nxy/a\na\nb\nb\nfree(a) b\nx-by\nb\nkeys\nhomeÆ newÆ\n\nhome\n\ntrack/time\n\n(1)\n\n(2)\n\nmeasure/bar\nB\n\nE5\n\nR6\n\nE6\n\ns(t)\n\nt\ns/t\nb/c--a\nfree\na\nxy/a\nnew (encompassing what\n(like E1)\nKerman calls the \"central solo\")\n(2/0:06)\n\n(3)\nA\n\nR7\nE7\nR8\nE8\nR9\nt\ns(t)\nt\ns(t)--solo\nt\nab\nb\nb\nzw--cadenza abc\nI\nI\nI\nI-x-V\nI\nhomeÆ\n\n(3/1:30)\n\n(4)\n(5)\n\n219 (-227)\nFugue (related to da capo and ritornello form)\nsubject\nepisode\nsubj.\nepisode\nsubj.\nepisode\nsubj.\nhome keyÆ\nnew key(s)Æ\n\nhome\n\nkey\n\n=Rit.\nS1\nR2\nS2\nR3\nS3\nR4\nBrandenburg #5, mvt 3: is actually in Da Capo form (that is, the return is not written out)\nand, further, the ritornellos are fugal, so that Bach is combining three forms in this\nmovement\n\nOratorio\n3. Handel, Messiah (1741)\na. \"There were shepherds\"--\"Glory to God\" K 2.9\nSeccoÆAccompaniedÆSeccoÆAccompaniedÆChorus\n-Musical imagery of angel wings in the accompanied recitatives and chorus\n-Word-painting in chorus: \"highest\" = high voices; \"earth\" = low voices; \"good will\" =\nfugue (acclamation of the \"multitude of the heavenly host\") leading to sequence (coming\ntogether)\n-Instrumental postlude: decrescendo depicts angels departing\nb. \"Hallelujah\" K 2.10\nChorus: \"sacred madrigal\" with very effective use of texture\n-homophony: opening \"Hallelujah\" (and \"Hallelujah\" as refrain) representing\ncongregational voices joined together\n-monophony: \"For the Lord God omnipotent reigneth\" (=one God)\n-counterpoint (fugue): \"And he shall reign for ever and ever\" (like a round, without end)\nChurch Cantata\n4. Bach, \"Christ lag in Todesbanden\" K 2.11-13\nchorale cantata: a sacred cantata based on a Lutheran chorale (hymn); use of the chorale\nas a sacred, pre-existent foundation (similar to the earlier use of Gregorian chant\nas a cantus firmus or paraphrased); typically each stanza of the chorale is given a\ndifferent compositional presentation\ngapped chorale: a movement in which the chorale melody is heard in long notes phrase\nby phrase against a continuously moving melody or texture in counterpoint to it\n(see pattern in Kerman/Tomlinson, p. 160, right margin)\na. stanza 3:\n-solo tenor against a continuous solo violin part (=death?)\n-note how the music stops after the word \"nichts\" (nothing) and starts up again slowly\nwithout the continuous violin part at first\nb. stanza 4:\n-the altos, doubled by organ, sing the chorale in long notes\n-the continuous music consists of imitative entries of the other voices, like points of\nimitation, phrase by phrase\n-the imitative entries use paraphrase, while the alto uses quotation\nc. stanza 7:\n-a straightforward and richly harmonized version of the chorale\n5. Bach, Chorale Prelude, \"Christ lag in Todesbanden\" K 2.14\n\nchorale prelude: a composition for organ incorporating a chorale melody\n-this prelude incorporates a continuous melody in the bass (organ pedals) played in\ncounterpoint with the chorale, which is heard without any gaps"
    },
    {
      "category": "Lecture Notes",
      "title": "week05_lecture05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/7d28bb83d7e5c57b86cc52c4447b00a8_week05_lecture05.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\nLecture V\nClassical Era (1750-1800)\n1. Enlightenment: the application of rational, \"scientific\" principles to the social contract\n(morality, education and politics), especially in terms of social injustice/breaking down\nof monarchical and aristocratic societies/ so-called \"rise of the middle class\"/ freedom of\nreligion/ understanding of market economy\nGreat thinkers of the age include: Immanuel Kant, Rousseau, Voltaire, Adam Smith,\nBenjamin Franklin, Thomas Jefferson\n1776: American Revolution\n1789: French Revolution\nLiterature: continued expansion of the novel, examining social forces, women writers:\nFrances Burney (1752-1840); Jane Austen (1775-1817)\n2. \"Classical\" refers to the parallel \"neo-classical\" period in the visual arts and\narchitecture that was hugely influenced by Classical Greek and Roman models\nClassical revival: a reaction against the extravagance and exuberance of the Baroque\n(which term was first used as a derogatory description meaning misshapen black pearl)\ntoward order and symmetry\nVarious stimuli for these trends, in particular these two:\n-archaeology: the excavations in Pompeii began in 1748; excavations in Greece began in\n1751 led to the book The Antiquities of Athens (1762+); Winkelmann's A History of the\nArt of the Ancients (1764)\n-architecture: revival of Palladian style of the Renaissance (this period itself considered a\n\"rebirth\" of classical ideals; Andreas Palladio, an Italian architect of the 16th century who\nattempted to recreate the style and proportions of the buildings of ancient Rome)\nArt: Sir Joshua Reynolds (1723-1792) studied classical literature, went to Rome to study\nGraeco-Roman sculpture; famous for his portraits, \"formal rhetoric\"; Thomas\nGainsborough (1727-1788); Jean-Honore Fragonard (domestic \"hedonism\"; Jacques\nLouis David (1748-1825) a painter of classical images, firm supporter of the revolution\nMusic influenced by both the \"enlightenment\" and \"classical\" traditions of this period\n-public concerts: opera houses and concert halls\n-opera: development of comic opera, depiction of contemporary, social life (rather than\nhistorical or mythological) \"common people\" and/or middle class rising against the\naristocracy\n-instrumental music: development of the symphonic form, new formal structures that\ngrow out of the symmetrical dance forms\n\nStyle features:\nTexture: essentially homophonic with lyric melody predominating; \"classical\ncounterpoint\" included as a textural contrast within larger movements, used to heighten\ntension or increase forward flow, treated with great clarity of structure (more transparent)\nHarmony; slow harmonic rhythm; abandonment of basso continuo (harmony composed\nin inner parts as part of homophonic structure); less adventuresome harmonies and\ndissonances\nRhythm: a marked change from earlier periods, where the rhythmic flow tends to set up a\npulse or rhythmic pattern and maintain it; classical rhythms are varied, flexible,\ndistinctive\nMelody: folk-like simplicity, song-like; organized into discrete phrases\nForm: rather than formal patterns that expand by multiplication (ritornello, ground bass);\nclassical forms tend to expand hierarchically from within; expansion of rounded binary to\nsonata form\nDynamics: variety and flexibility; wide gradations, carefully indicated\nTone Color/Timbre: development of the \"Classical orchestra\": abolition of the continuo,\naddition of middle range woodwinds (clarinets) and brass (horns) that complete the\ntexture and harmony; again, flexibility in use of tone color\nTempo: wider range of tempi and flexibility within single movements\nToday's genre: Symphony (from the Greek: united in sound); sym-biosis (united in life);\nsym-pathy (united in feeling)\nMovements: sonata allegro, slow movement, minuet, rondo\nWolfgang Amadeus Mozart\nSymphony 40 in G minor (1788), first movement K 2:15-20\nFranz Joseph Haydn (1732-1809)\nSymphony 95 in C minor (1791) K 2:21-35\nVariation form\n[recall \"Kemp's Jig\": aab form in improvised variations, where the repeated 'a' is also\nvaried: aab a1a1 ′b1, a2a2 ′b2 a3a3 ′b3......\nClassical music grows out of similar binary forms; but rather than expanding solely by\nmultiplication, the classical binary form (or rounded binary) is expanded through internal\nand hierarchical elaboration\nHaydn Symphony 95, second movement, variation form (Kerman/Tomlinson, p. 189; K\n2:22-26)\nHaydn's music is typified by \"continuous variation\"; it is as if he could not leave a theme\nbe without adding variety; his music, therefore, is continuously developing; this will be\nshown to be in direct contrast to Mozart, who seems not to have been able to stop\ncreating new themes, so that rather than vary or develop he was just as likely to write\nsomething completely new\n\naabb\na1a2b1b1\na3b2b3(trans.)\na a4 b4\ncoda\nbeyond this linear form, listen to the larger, hierarchical form:\naabb\na1a2b1b1\na3b2b3(trans.)\na a4 b4\ncoda\nA\nA′\nB (minor)\nA′′\nA′′′\nA (theme) A′ (ornamented theme with added triplet sixteenth notes) B (developmental\nsection in minor; added winds for tone color; alteration of underlying formal template)\nA′′ (compressed and elaborated repetition of AA′) A′′′ (coda)\nMinuet-trio form\nHaydn Symphony 95, third movement, minuet-trio (Kerman/Tomlinson, p. 193; K 2:29-\n31)\nintroduction of rounded binary (aaba) form [compare to the hierarchical form of the\nsecond movement]; note that b begins with a variation of a2 and that a′ begins with an\nexact repetition of a1 - Haydn is always playing with his themes\nminuet: a(=a1a2) :||: b(a2′b) a′(=a1coda)\ntrio: c :||: dc′\nminuet: a || ba′\nSonata form (see next page)\n\nSonata forms (showing the use of continuing variation)\nrounded binary\n||: a\n:||: b\na\n:||\nMozart Symphony 40, first movement, sonata form (Kerman/Tomlinson, p. 185)\n||: A (Exposition)\n:||: B (Development) A′ (Recapitulation)\n:||\nA (T\n1kT1s b T2T2′tT1′C)\n:||: B (T1′′T1iT1f)\nA′\n(T1kT1s′ b′ T2′′T2′′′tT1′′′C′) Coda\n:||\nHaydn Symphony 95, first movement, sonata form (Kerman/Tomlinson, p. 187)\n||: A (Exposition)\n:||: B (Development) A′ (Recapitulation)\n||\nA (T1T1\n′ b T2T2 ′ C)\n:||: B (T1 ′′ T2 ′′ C′ T1 ′′′) A′ (T1 ′′′′ T2 ′′′ C′′)\n||\n0:49\n22 0:42\n0:59\n[T=Theme; C=Cadence theme; b=bridge; k=closing; t=little thematic transition;\ns=shortened; i=imitation; f=fragmented]\n\n21M.011\nFORMAL PATTERNS\n1. variation form\nA A' A'' A''' . . .\n(each A may be in rounded binary form; individual variations may be in\nsecondary keys or in the opposite mode: major or minor)\nvariations may be based on a melody or a bass theme/harmonic scheme\n2. ternary forms\na. simple ternary or song form\nA B A\nI X I\nb. rondo\nA B A C A . . . [coda]\nI X1 I X2 I\n\nor\n\nA B A C A B A\n\nA B C A\n\netc.\n\n3. binary forms\na. simple binary form\n||: a :||: b :||\nI-X\nX-I\nb. rounded binary form\n||: a :||: b a :||\nI-X\nX-I\nc. sonata form\n||: A\n:||: B\nA\n:||\n[intro] T1-trans-T2-closing\ndev-retrans T1-trans-T2-closing [coda]\nor\nor\nbridge cadence\ntheme\n[intro]\nexposition\ndevelopment recapitulation [coda]\nI\nX\nmodulation I ----------------\n(tonic/\n(second\nhome key)\nkey)\n\nSymphonic form\n1. 1st movement/ sonata allegro\n2. slow movement\na. binary\nb. ternary\nc. variation\n3. minuet/trio; or scherzo/trio\n||: a :||: b a :|| ||: c :||: d c :||\na || b a\n(note: no sectional repetitions on\nA\nÆ I\nB\nÆ X\nA Æ I\nthe return of the minuet/scherzo)\nminuet\ntrio\n\nminuet\n4. rondo (or sonata/rondo)\nConcerto form (and also the movement scheme for most sonatas)\n1.\nconcerto: 1st movement, double-exposition form (Kerman/Tomlinson: 201)\nsonata: sonata form\n2.\nslow movement\n3.\nrondo\nrepertory\nMozart, Symphony No. 40 in G Minor (1st movt: sonata)\nHaydn, Symphony No. 95 in C Minor (4 movts: sonata, variation, minuet, rondo)\nMozart, Piano Sonata in B-Flat, K. 570 (3rd movt: irregular rondo)\nMozart, Piano Concerto in A (1st movt: double-exposition sonata form)\nBeethoven, Symphony No. 5 in C Minor (4 movts: sonata, variation, scherzo, sonata)\nBeethoven, String Quartet in F, Op. 135 (2nd movt: scherzo-trio)\nChaikovsky (Tchaikovsky), Overture-Fantasy Romeo and Juliet (free sonata form)\nBrahms, Violin Concerto in D, Op. 77 (3rd movt: rondo)\nMahler, Symphony No. 1 (3rd movt: irregular march-trio)\nRavel, Piano Concerto in G (1st movt: compressed double-exposition sonata form)\nBartok, Music for Strings, Percussion, and Celesta (2nd movt: sonata form)"
    },
    {
      "category": "Lecture Notes",
      "title": "week06_lecture06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/41b99f20de424f93d0138de233440773_week06_lecture06.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\n\nLecture VI\n\nClassical Era: Opera\n\nThree distinct genres:\n1. Opera seria, continuing from the Baroque period used the same kind of (often\nliterally the same!) librettos depicting historical or, less often, mythological\nevents; arias continued to be in da capo form, now increasingly merged with\nsonata form; arias became much longer, so there were fewer; recitative continued\nto be both simple (secco) and accompanied; 3 acts; in Italian\n2. Opera buffa, also continuing from the Baroque period, but more a product of the\nClassical than Opera seria; began as a type of \"intermezzo\" (an entertainment in\nbetween the acts of an Opera seria); characters were typically contemporary and\noften depicted the lower classes or a mixture of lower and upper classes (with the\nlower classes usually dominating in some way; frequently with a serving girl\noutwitting her master--class and gender being two important and continuing\ntopics in Opera buffa); arias continued for some time to be in da capo form, but\ngradually changed into more through-composed forms under the influence of\nincreased ensembles (or concerted movements for more than one singer: these\nwere largely absent in Opera seria, except for a few duets); ensembles were used\nto close the acts and incorporated the crisis in the action, moving the plot forward;\nultimately the distinction in Opera seria between the action of the recitative versus\nthe aria as a pause in the action for the expression of deep emotion was\ncompletely (or just about completely) abandoned in favor of a dramatic structure\nin which all the music (recitative, aria and ensemble) carried the action forward;\nrecitative typically secco only; 2 acts (growing out of the expansion of the\nintermezzo through the 2 intermissions of Opera seria); in Italian\n3. Singspiel, a type of music drama that sprang up in various European countries by\nmid-century in competition with Opera buffa; used spoken dialogue combined\nwith musical numbers (Ballad Opera in England; Opera Comique in France); in\nthe vernacular (thus: Singspiel [a \"singing play\"] in German); absorbed and\nadapted the ensembles and forward trajectory of Opera buffa while still admitting\nmusical numbers that stopped the flow of action for emotional exploration;\nSingspiel based on texts that depicted country life or magic; Ballad Opera began\nas political satire but increasingly turned to sentimental drama; Opera comique\nbegan depicting country life but became increasingly political (Revolutionary\ndrama); this in turn had an impact on Singspiel; Beethoven's one opera, Fidelio,\nis a Singspiel based on a French Revolutionary opera; typically 2 acts\n\nWolfgang Amadeus Mozart (1756-1791)\n\nA prodigy: first public performances on keyboard at the age of 6; early compositions for\nkeyboard and orchestra date from around the same time (but heavily indebted to his\nfather Leopold)\n\nHis earliest symphonies (definitely attributable) dating from before 1767 are in the\n\"concerto\" 3-movement form without minuet-trio; symphonies from 1768 (dating from\nhis trip to Vienna) take on the four-movement form\n\nMozart began writing opera/music drama at the age of 11:\n1767: Apollo et Hyacinthus (a Latin school drama)\n1768: La finta semplice (opera buffa)\n\nBastien und Bastienne (Singspiel)\n1770: Mitridate (opera seria) for Milan, placed him squarely in the international circuit\n...\nWith the following two works in 1781, Mozart reached the top of his profession\n1781: Idomeneo (opera seria)\n\nDie Entfuhrung aus dem Serail (Singspiel)\n...\nTrio of operas with librettos by Lorenzo Da Ponte represent a merging of the buffa and\nseria styles\n1786: Le nozze di Figaro\n1787: Don Giovanni\n1790: Cosi fan tutte, ossia La scuola degli amanti\n...\nLast operas:\n1791: Die Zauberflote (Singspiel)\n\nLa clemenza di Tito (opera seria)\n\nDon Giovanni\n\n\"a dramatic testimony to powerful class and gender oppositions fuming in Enlightenment\nEurope\"\n\nCast list: (note: Don=Sir and Donna=Lady)\nDon Giovanni (an aristocrat who is a scoundrel)\nDonna Anna (an aristocratic lady seduced by Don Giovanni)\nDon Ottavio (an aristocrat who is Donna Anna's fiance)\nDonna Elvira (an aristocratic lady previously seduced by Don Giovanni)\nCommendatore (Donna Anna's father)\n\nLeporello (Don Giovanni's servant)\nZerlina (a peasant girl, betrothed to Masetto)\nMasetto (a peasant)\n\nAs opposed to Baroque opera that depicts emotion; Mozart's late operas depict character.\n\nDramatic action of movements discussed:\n\nLeporello: \"Notte e giorno faticar\"\npacing back and forth; syllabic; no ornamentation; 8-bar phrase that extends rather than\nends (depicting the waiting); accompaniment picks up when he expresses his wish to be a\n\"gentleman\"; use of \"patter\"\n\nDonna Anna and Don Giovanni: \"Non sperar, se non m'uccidi\"\nDon Giovanni running out of Donna Anna's bedroom with Donna Anna struggling to\ndetermine his identity; she sings the first line; the stage direction says that \"Don Giovanni\ntries to conceal his features\"; musically, therefore, he mimics her line rather than taking\non any musical characteristics of his own; this continues throughout the scene until\nDonna Anna's exit; after Don Giovanni kills her father, he still continues with \"her\"\nmusic, even though it is now in minor--throughout the opera Don Giovanni is a musical\nchameleon\n(Throughout this scene, Leporello mutters and comments from his hiding place)\n\nDonna Elvira: \"Ah, chi mi dice mai\"\n\"out of bounds\"; huge dynamic contrasts; rhythmic discontinuities; extended phrase\nstructure; huge leaps; Elvira is often described as having \"Baroque\" music; depicting her\nas unstable\n(throughout this scene Don Giovanni and Leporello comment on this \"poor woman,\"\nonly realizing who she is at the very end, dissolving the aria into recitative)\n\nZerlina and Masetto: \"Giovinette che fatte all'amore\"\nLike a peasant dance; sustained drone (supposedly like a bagpipe); 6/8 meter; Zerlina\nstarts and Masetto follows with the same tune\n\nMasetto: \"Ho capito, signor si\" K 2:39\nSings alternately to Giovanni, to Leporello (who is trying to drag him away) and to\nZerlina (whom he rebukes for being shameless by sarcastically referring to her as a\n\"lady\") See Kerman/Tomlinson\n\nZerlina and Don Giovanni: \"La chi darem la mano\" K 2:41\nPerformed by Pamela Wood (Music faculty) soprano, Michael Ouellette (Theater\nfaculty), baritone, Charles Shadle (Music faculty) piano\nDon Giovanni begins in a simple tune accompanied with simple chords in a clear 8-\nmeasure phrase; Zerlina responds by saying she is hesitant, but with his tune (indicating\nthat he's \"calling the tune\"); they then alternate phrases with Giovanni asking on the\ndominant (the chord that calls out for resolution to the tonic), which Zerlina avoids\ngiving; then their phrases overlap, bringing them closer and closer; note the difference in\nZerlina's repetition of \"presto non son piu forte\" (\"already I'm not strong enough\")\nwhere the ending of the phrase droops rather than rises, indicating further weakening;\nfinally she consents and they reach the tonic together in a little dance in 6/8 with drone.\nIts relation to the \"wedding song\" of Zerlina and Masetto (\"Giovinette\") shows how\ncompletely Giovanni has stepped into Masetto's shoes (as this section is so close in style\nto the wedding song \"Giovenette\" above). See Kerman/Tomlinson"
    },
    {
      "category": "Lecture Notes",
      "title": "week08_lecture07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/ce17ca22e6007da80f5acb1be1567a89_week08_lecture07.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\n\nLecture VII\n\nLudwig van Beethoven (1770-1827)\n\nLike Monteverdi, who bridges the Renaissance and the Baroque, Beethoven stands\nbetween two eras, not fully encompassed by either. He inherited the Classical style\nthrough Mozart and Haydn, and this is represented in works from what is typically called\nhis \"first period\" (to about 1800), during which time Beethoven performed actively as a\nvirtuoso pianist. The \"middle period\" (about 1800 to 1818) saw Beethoven break\nthrough the classical templates as he wrestled with his increasing deafness, the growing\ninability to perform or conduct, and his disillusion with Napoleon, whom he had\nconsidered a hero of the French Revolution until Napoleon declared himself Emperor in\n1804.\n\n1802: Heiligenstadt Testament depicts Beethoven's desolation over his deafness;\n1803: composition of the 3rd Symphony, originally titled Bonaparte, but changed to\nEroica after,\n1804: Napoleon declares himself Emperor\n1808: 5th Symphony in C minor, Op. 67\n\nFrom Beethoven's middle period come the works most often associated with Beethoven\nand with what is known of his personality: forceful, uncompromising, angry, willful,\nsuffering, but overcoming extraordinary personal hardship, all of which traits are read\ninto his music. The Romantic cult of the individual who represents himself in his music\nand of the genius who suffers for his art begins here with Beethoven.\n\nBeethoven's \"late period\" (1818 to his death [1827]) becomes more introspective and\nabstract, as Beethoven's deafness increasingly forces him to retreat into himself.\nAlthough the 9th Symphony dates from these years, it is the only symphony to do so, and,\nin many respects, is a throwback to the middle period. The late period is typified more\nby smaller, more complex chamber works, among which the \"late quartets\" are the most\nabstract in style.\n1826: String Quartet in F, Op. 135, 2nd movement K 3:21\n\n**\n\nBeethoven, Symphony No. 5 in C Minor\n\nThis complete four-movement work is discussed by Kerman/Tomlinson, pp. 227-233; it\nfollows the typical symphonic pattern at the same time as it moves beyond it in multiple\nways. The four-movement scheme is: sonata, slow movement (variations), \"minuet-trio\"\n(scherzo), finale (sonata form).\n\n1st movement (K 3:6-14): perhaps known in some form to more people than any other\nclassical work. It begins with a declaration of its \"motive\" in a four-measure phrase with\na hold (fermata) on the second and fourth measures. In some ways this is a preliminary\nstatement, a slow introduction reduced to its smallest components. There is no clear\nmeter, nor even key (it could be E-flat major rather than C minor), certainly no melody to\nspeak of--only this motivic \"seed\" from which the entire symphony takes sustenance.\nWe have not heard a symphony with a slow introduction before the exposition of the first\nmovement, but they were common. Haydn used them frequently, and Beethoven did as\nwell in his earlier (and later) symphonies. Typically they present less formed material\nthan occurs in the exposition: the harmony is often in flux and distant from the key of the\nmovement, and the overall feeling is anticipatory. Never are they as profiled or chiseled\nas the four measures that begin the 5th Symphony. Further, the fermata at the end of the\nfirst theme brings into question whether the exposition has actually begun, even at this\nlate point, or whether this is just an extension of the anticipatory section. Beethoven\npersistently keeps the listener on edge, upsetting convention and expectation.\n\nIt becomes clear pretty quickly, however, that the little, four-note motive is going to\ndominate the movement. It forms the four-bar \"introduction,\" first theme, transition\nmaterial and the bridge to the new key; it harps away under the more lyrical (major)\nsecond theme, and forms the closing (or cadence theme) as well. In the development the\nbridge theme of four notes is reduced to three, to two and then to one (!) note, but the\ntheme is so dominant that even the one note is recognizable as thematic. The\nrecapitulation begins with the motivic announcement again, suggesting maybe that this IS\na part of the 1st theme; slow introductions do not normally return at this point. Then over\nthe fermata at the end of the 8-bar theme, an oboe cadenza unexpectedly appears, a hint\nperhaps, in the maelstrom of this relentless movement, of a different kind of time, of\nbeauty and of peace. The coda explodes out of the recapitulation, again referring to the\nmain motive, and develops into what Kerman/Tomlinson calls a \"grim minor-mode\nmarch.\"\n\nIn the second movement (K 3:15-16): double variations in A-flat major; 1st theme\n(cellos), 2nd theme (clarinets and bassoons)Ægrabbed by trumpets who blare it in C\nmajor. The trumpet \"snatch\" emphasizes an unexpected relationship between this second\ntheme and the rhythmic motive of the first movement, which is emphasized by the\nhushed (frightened) section where the motive sounds more clearly. The repeated ff\ninterruptions of the trumpets during the second theme (in the midst of what otherwise\nwould seem to be a straight-forward set of double variations) give this movement an\nincreasingly disturbing and ominous feel.\n\nThird movement (K 3:17-18): again starts off with cellos, now with a mysterious, hushed\nsound. Again the brass, now the French horns, interrupt with a loud, insistent version of\nthe 1st movement motive, now hammered on a single note. An alternation of these two\nideas fails to coalesce into the typical rounded binary form, but works almost like a small\ndouble variation of its own through three hearings (aab | a′a′b′| a′′b′′). The next section\nmore traditionally plays the role of trio and does just about fall into rounded binary form\n(c:||:dc), but the repetition of the second part is reorchestrated and runs without pause into\n\nthe return of the \"scherzo\" (c:||dc′| d′c′′), and the scherzo itself is shortened and\nreorchestrated, and it disintegrates into a transition where the timpani play the 1st\nmovement rhythmic motive (the whole trio to scherzo looking like: c:||dc′| d′c′′a′′′---).\n\nFinally, the tension and uncertainty is overcome (conquered?) with the entrance of the\ntriumphant C major march theme of the final movement. The second theme of this\nsonata form movement then takes the 4-note rhythmic motive and transforms it into joy.\nHowever, the return of the C minor scherzo at the end of the development (just before the\nrecapitulation) seems to imply that while one can overcome fate, one cannot eradicate it.\n\nPiano Sonata No. 17 in D minor, Op. 31, no. 2 (1802)\nPerformed by Nick Joliat, special student in Physics and Music\n\nThis sonata was written in 1802, the year of the Heiligenstadt Testament. Beethoven is\nsaid to have claimed that it was based on Shakespeare's The Tempest, but this cannot be\ntaken to mean that it depicts the story through individual characterizations. Rather, if\nthere is a relationship, it would appear to be to the figure of Prospero, who overcomes all\nthe difficulties and obstacles that have been placed in his path. Beethoven, with the\nincreased onset of his deafness, may (MAY) have related to this story. At any event, the\nsonata is certainly tempestuous. A recording of the sonata with Russell Sherman, pianist,\nis available on Stellar. The following listening guide gives some of the important\nstructural moments. It is based on the recording by Russell Sherman: Ludwig van\nBeethoven, Piano Sonatas (10 cds: GM Recordings, 1995-2000).\n\nFirst movement: Sonata form\n0:00\nFirst theme has some characteristics of Beethoven's 5th Symphony; it starts slowly\nwith a four note rising theme and pauses (as indicated by a fermata); it then rushes\nforward (allegro) coming to a slow cadence and a second pause; this is then repeated and\nexpanded\n0:52\nBridge: note the use of the rising four-note theme in the bass, now played very\nloudly\n1:15\nSecond theme group, part 1\n1:28\nSecond theme group, part 2\n1:50\nClosing material\nThe exposition is then repeated\n4:16\nDevelopment: first expanding the opening four-note theme in the very slow\ntempo; then expanding the Bridge theme with the four-note theme in the bass\n\nRecapitulation\n5:50\nFirst theme now with added recitative in the piano after the slow four-note theme\non both appearances (compare to the oboe cadenza in Beethoven's 5th Symphony)\n7:40\nSecond theme group\nThere is a short coda at the end\n\nSecond movement: a type of binary movement frequently referred to as a sonata form\nwithout a development; that is, there are two themes that are differentiated by melody,\n\nrhythm and harmony in the first part; these are recapitulated in the home key in the\nsecond part\n0:00\nFirst theme: a standard 8-bar phrase but VERY expanded in terms of time\n1:29\nBridge: note the oscillating four-note pattern (NOT the same as the first\nmovement) in the bass\n2:34\nSecond theme, after which there is a short transition, using the oscillating Bridge\nmaterial back to the\n3:47\nRecapitulation\n6:53\na more extended coda using the oscillating bass motive and some thematic\nmaterial; this is the closest this movement gets to a development\n\nThird movement: Sonata form\n0:00\nFirst theme, a kind of perpetual motion that animates the whole movement\n0:34\nSecond theme, recognizable by the rapid movement between two consecutive\nnotes\n0:51\nClosing material\nThe exposition is then repeated\n2:22\nDevelopment, at first of the general motivic material\n3:04\nfull statement of the First theme\n\nRecapitulation\n3:52\nFirst theme\n4:34\nSecond theme\n5:10\nCoda--very extended this time, including--\n5:33\nfull statement of the First theme\n6:01\nabbreviated statement of the First theme\n(note the recurrences of the first theme give a feeling of rondo form, and indeed\ncomposers regularly blended these two forms in the final movements of symphonies and\nsonatas)\n\n--Another example from last semester\nViolin Sonata, Op. 47 in A major/minor (\"Kreutzer\") (1803), first movement\nPerformed by Amanda Wang, violin (G, EECS) and Yu Yasufuku, piano (G, Math)\n\nBeethoven wrote this work for the violinist George Augustus Polgreen Bridgetower, who\nplayed it with Beethoven in 1803 (Lewis Lockwood, Beethoven: The Music and the Life\n[New York, 2003] , p. 143). Only later was the dedication offered to Rodolphe Kreutzer,\na famous French violinist who taught at the Paris Conservatoire, but who never\nperformed the work. Beethoven himself described the piece as \"Sonata scritta in un stilo\nmolto concertante quasi come d'un concerto\" (\"written in a highly concerto-like style,\nalmost in the manner of a concerto\"). This was never a work intended for amateurs; it is\ntruly virtuosic throughout, showing Beethoven's stretching of technique for both violin\nand piano.\n\nYou will hear a \"real\" slow introduction, which vacillates between major and minor, an\nimportant attribute of the following sonata form movement. The introduction starts off in\nvirtuoso style with the violin solo playing from 2 to 4 notes at a time (double-stopping);\n\nthis is in major, but the piano immediately responds in minor. This section increasingly\nfragments as it progresses. The sonata movement in minor follows the typical plan of 1st\ntheme, transition, 2nd theme group (with two clear themes: I will call them theme 2 and 3)\nplus closing. The development emphasizes the third theme. There are fermatas and\npauses throughout, which disrupt the forward motion. There is a mini, false\nrecapitulation for the piano in the wrong key before the \"real\" recapitulation enters in the\nviolin. The coda brings back the 1st theme and a long Adagio (slow) pause in the midst of\nturbulent activity. In short, the movement contains most of the features you would expect\nin this period from heroic Beethoven breaking through the bonds of tradition. Timings\nfollow the recording by Isaac Stern, violin, and Eugene Istomin, piano (Sony Classical,\n1996, p1986).\n\n0:00\nslow introduction (major/minor, harmonic shifts, fragmentation)\n1:37\nEXPOSITION\n\ntheme 1 (A minor)\n2:00\ntransition\n2:43\ntheme 2 (E major [violin]; E minor [piano])\n3:14\ntransitional material/closing? No, it leads to--\n3:36\ntheme 3 (E minor)\n4:04\nclosing\n4:15\nend of exposition on \"deceptive cadence\"\n4:22\nDEVELOPMENT using theme 3\n6:23\nmini, false recapitulation of theme 1 in wrong key (D minor for piano)\n6:43\nRECAPITULATION theme 1 in right key (A minor for violin)\n7:39\ntheme 2 (A major [violin]; A minor [piano])\n8:31\ntheme 3 (A minor)\n9:15\ncoda"
    },
    {
      "category": "Lecture Notes",
      "title": "week09_lecture08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/cacb8e58a101113e7bc6fbd535ddb52c_week09_lecture08.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\nLecture VIII\nRomantic Era (Nineteenth Century)\nLiterature: Gothic novels (Mary Shelley, Frankenstein, 1818), Grimm brothers Fairy\nTales, Thoreau's Walden, Dickens\nPoetry: Goethe, Wordsworth, Coleridge, Shelley, Keats, Byron, Whitman, Blake, Edgar\nAllan Poe\nVisual Arts: Constable, Turner, Cezanne, Rodin, Renoir, Monet, Seurat, Van Gogh\nScience, engineering and industrialization: Pasteur; McCormick's mechanical reaper;\nMorse's telegraph; Daguerre's photographs; first electric light; ether used for first time as\nanesthetic (1846); Darwin Origin of Species (1859); first Atlantic cable (1864); first\ntranscontinental railway in U.S. (1869); Suez Canal (1869); Bell's telephone (1876);\nEdison's phonograph; automobile patented by Daimler; Roentgen's X-ray\nExploration: Lewis and Clark reach the Pacific (1806); first steamship crosses the\nAtlantic (1818); Japan opened to the West (1853)\nPolitics: 1804: Napoleon crowns self Emperor; 1805: Battle of Trafalgar; War of 1812\nbetween England and U.S.; Napoleon invades Russia (1812); Battle of Waterloo (1815);\nGreek War of Independence (1822); July Revolution in France (1830); Polish revolt\n(1830); Revolutions in France, Prussia, Austria-Hungary and Italian states (1848); Marx\nand Engels, Communist Manifesto (1848); Italian risorgimento (1859-1861); Anti-slavery\nmovement in U.S.; Abraham Lincoln, United States Civil War (1861-1865); Spanish-\nAmerican War starts (1898)\nKerman/Tomlinson provides a good introduction to this century (pp. 235-242). The\nfollowing builds on that, emphasizing certain aspects.\n1. The Romantic Era is closely tied to literature; the very name comes from the\nliterary world, whose authors themselves adopted the name \"Romantics.\" For\nmusic, the close tie with literature is a dominant feature of the period. Composers\nchose to set the words of their contemporaries, not just in opera and song, but text\nbecame increasingly important in symphonies and piano music. Rather than\nfollowing some abstract form: ritornello, sonata form, composers molded their\nmusic more freely to the sung text; examples include Beethoven's Ninth\nSymphony, Berlioz's \"Dramatic Symphony\" Romeo and Juliet. Even without\ntext, music frequently used a narrative or literary idea as an organizing idea or\naffective basis. Thus, symphonies and overtures (frequently overtures to nothing)\nwere written that tell a specific story; sometimes these (loosely) followed\ntraditional forms; these are called \"program music\" or, later, particularly in the\nmusic of Richard Strauss, \"symphonic poems.\" Examples include Beethoven's\nPastoral Symphony; and, from your listening, Berlioz's Symphonie Fantastique;\nChaikovsky's Romeo and Juliet Overture-Fantasy. A lot of piano music depicted\n\nspecific images or characters rather than falling into the typical movement plan of\nthe sonata: from your listening, examples include Schumann's Carnaval and\nChopin's Nocturne. The tie to literature affects all aspects of music, but may be\nmost important in terms of loosening form.\n2. The Romantic Era is closely tied to the individual: poetry, art and music strove in\nthe nineteenth century to represent individual feeling and emotion. This had\nmany effects on music of this century, one of which is the importance of the\ncomposer's life to his music, This is apparent in large-scale works, such as\nBeethoven's Symphony No. 5, Berlioz's Symphonie Fantastique, and Wagner's\nTristan. It also played an important part in the rise of the miniature. This\nrepertoire includes principally songs and piano pieces, frequently lasting only a\nfew minutes, depicting sometimes intense, sometimes fleeting emotions.\nSometimes composers grouped a lot of these into a larger set; in the case of songs,\nthese sets combined the miniatures into a longer narrative. The song was\ndominated in the nineteenth century by German composers; examples from your\nlistening include Schubert, and Robert and Clara Schumann. As a result, the song\nis often known by its German name: Lied or, plural, Lieder. Piano miniatures are\nfrequently called character pieces, since they depict a single character or mood;\nmore often than songs, these are grouped into sets. Examples include\nMendelssohn's Songs Without Words; Chopin's Etudes and Preludes (like many\nof the symphonic overtures, these preludes preceded nothing); and, from your\nlistening, Chopin's Nocturnes, Schumann's Carnaval and Mussorgsky's Pictures\nat an Exhibition (first written for piano and then orchestrated). [This aspect of the\nRomantic also tied to Revolution: Chopin, Wagner, Verdi]\n3. The Romantic Era is closely tied to the supernatural and macabre: as\nKerman/Tomlinson puts it, this fits in with the effort to transcend the ordinary and\nthe conventional. Goethe's Faust and Shelley's Frankenstein mark the beginning\nof the Romantic fascination with the supernatural, which also finds strong voice\nin such disparate authors as the Grimm brothers (fairy tales), Blake, and Edgar\nAllan Poe. Music reacted strongly to such literature, ranging from Mendelssohn's\ninimitable depiction of the fairies in his \"Overture to Midsummer Night's Dream\"\nto Saint-Saens Danse Macabre. Operas frequently used supernatural stories, like\nVerdi's setting of Macbeth or Wagner's Flying Dutchman about a ghost ship\nwhose crew need the redemption of love to find eternal rest. Examples from your\nlistening include Schubert's setting of Goethe's Erlkonig, Schumann's Die alten,\nbosen Lieder, and Berlioz's Symphonie Fantastique, which conjures up a\nnightmare of witches. Related to the attraction to the supernatural is a fascination\nwith boundless nature, which, as Kerman/Tomlinson states, is sometimes\nmenacing. This sense of the overwhelming and the desolate in nature is depicted,\non the one hand, by the artist Turner and, on the other, by the poet Sir Walter\nScott, who dramatized old Scottish tales and ballads set in the Scottish lowlands\nand highlands; Turner began his career painting scenes for opera, and Scott's\nworks formed the basis of operas by Donizetti (Lucia da Lammermoor),\nsymphonic poems by Berlioz (Waverly and Rob-Roy) and some extraordinary\nsongs by Schubert (Lady of the Lake).\n\nStyle characteristics:\nTexture: melody with accompaniment dominates; frequently very thick as opposed to the\nclarity of the Classical era\nTimbre: piano a dominant instrument (Lied, character piece, concerto); individual tone\ncolor of single instrument; unique combinations of instruments (less focus on orchestral\nsections: strings, woodwinds, brass)\nHarmony: tonal, but with a weaker sense of key center due to chromaticism, fusion of\nmajor and minor modes, deceptive cadences, modal harmonies of folk song; use of\nharmony and specific sonorities to create mood\nRhythm: less regular: complex and rhapsodic (Chopin using groups of 5 or 11 notes to a\nbeat, for example); rubato (flexible tempo)\nMelody: less regular: fragmentary or very extended (use of chromaticism, dynamic\nclimaxes)\nForm: less regular: less dependence on standard forms, freer shapes of ballade or fantasy,\noverlapping with vague boundaries, BUT use of motivic repetition or thematic\ntransformation to create cyclic forms (Schubert, Erlkonig; Berlioz, Symphonie\nfantastique)\nRomantic miniatures\nTerms\nlied, lieder\n\ncharacter pieces\naccompaniment\nnocturne\nthrough-composed\nrubato\nstrophic\nstrain\nmodified strophic\nsong cycle\nPiano repertoire: Character pieces for piano: short piano works that convey a certain\nmood or character, frequently given generic titles: preludes, ballades, nocturnes, etudes,\netc.\nSchubert, Moment Musical\ntitle is picturesque and poetic, creating no expectation other than brevity. Sometimes\nthese small forms gave composers a chance to experiment with juxtaposition of materials\nand with structures without formal patterns. Compare to Berlioz, Fantastic Symphony,\nfifth movement, where the form is created in response to the drama.\n1. No. 2 in A-flat K 4:1\nStarts out basically ABA′, and the piece could clearly end at this point. The return of B\nin a new key and fortissimo is an anguished interruption/extension that the next return of\nA cannot entirely quell--will it come back again after the return of A with its coda?\nA\n(a a′)\nB\nA′\n(a′′ coda)\n|\nB′\nA′′\ncoda\n0:00\n0:35 1:20\n2:23\n3:17\n|\n3:57\n4:54\n5:36\n\nSometimes there is a close connection to the dance.\n2. No. 3 in F minor (Kerman CD-Rom 10)\nThe use of three \"strains\" (a discrete or characteristic section or tune in dance or march\nmusic) is similar to the form of the Renaissance galliard Daphne in your listening, but\neven in such a small piece, there are other formal connections: (1) minuet-trio and (2)\nABA coda. The complexity of such little pieces can be astonishing, and close readings\noffer multiple interpretations.\nintro\n|: a :|\n|: b :| |: c :|\na\nd\na′\n(3 strains plus coda)\n0:00\n0:03\n0:26\n0:49\n1:14\n1:25\n1:42\n\nmin.\nMaj.\nm->M\nother readings:\n|: a :|\n|: b :|: cb :|\na (coda)\n(\"minuet/trio\")\nA\nB\nA\nÆ\ncoda\n(ternary)\nSchumann, Carnaval\nA collection of miniatures representing masked revelers at Carnival (festival in advance\nof the period of penitence before Easter called Lent--e.g. Mardi gras = last day of Lent)\nSchumann represents characters from improvised Italian comedy (commedia dell'arte),\nSchumann's friends and colleagues, and Schumann himself.\n\"On 8 June (his 21st birthday) Schumann wrote in his diary: 'It sometimes seems ... as if\nmy objective self wanted to separate itself completely from my subjective self, or as if I\nstood between my appearance and my actual being, between form and shadow' \" (John\nDaverio, \"Robert Schumann,\"Grove Music Online, ed. L. Macy).\nIn his musical criticism, Schumann signed himself by two distinct names:\nEusebius (=thoughtful dreamer, introspective)\nFlorestan (=impetuous and mercurial, prone to mood shifts, extrovert)\nThe full title of this collection is Carnaval: scenes mignonnes sur quatre notes: these\nnotes are A, E flat, C, B natural or A[E]s C H in German (see #10 of the set, below).\nASCH = name of town where Schumann's fiancee, Ernestine von Fricken, lived or\nRobert Alexander SCHumann\nSCHA = SCHumAnn\nASCH = Ash (Ash Wednesday, first day of Lent); FASCHing = carnival\nKerman/Tomlinson implies by its wording that the abrupt, non-ending of the Florestan\nmovement leads directly to Chiarina (representing Clara Wieck, who would become\nSchumann's wife), but at this time Clara was only 13, and Schumann was engaged to\nErnestine. But beyond all of these facts, as the list of movements indicates, the\ntempestuous Florestan movement leads directly to Coquette--a very different\nimplication.\n\nSchumann, Carnival (depicts masked revelers at Carnival)\n1.\nPreamble\n\n12.\nChopin\n2.\nPierrot\n\n13.\n\nEstrella (Baroness E. von Fricken)\n3.\nHarlequin\n\n14.\n\nRecognition (\"Reconnaissance\")\n4.\nNoble Waltz\n\n15.\nPantalon and Columbine\n5.\nEusebius (poetic Schumann)\n6.\nFlorestan (passionate Schumann)\n7.\nCoquette\n\n16, 17.\n\nGerman Waltz-Paganini German Waltz\n8.\nRejoinder\nButterflies (the title of an\nearlier piano cycle by Schumann\n\n18.\nConfession of Love\n19.\nPromenade\n20, 21. Pause - March of the League of David\n10.\nASCH-SCHA: Dancing Letters\nagainst the Philistines (including\n11.\nChiarina (Schumann's beloved Clara)\nsections of the Preamble, no. 1)\n\"Eusebius\" K 4:2\nlike Schubert's Moment Musical, Eusebius has multiple formal implications; note\nmoreover, that a and b are not distinctively different. Motive a blurs the beat by using 7\nequal notes per measure; motive b enlarges the upward intervallic leap and breaks the\nmeasure into two parts, the first divided into 5 equal notes, the second 3 equal notes.\nMotive a is accompanied by a rising chromatic line in the bass; motive b by a\ndescending chromatic line. If the movement were simply |: a :|: ba :| it would, obviously,\nbe in rounded binary form, but the interruption of the extra ba with thicker chords creates\na disruption in that formal scheme similar to the disruption in Schubert's Moment\nMusical No. 2 in A-flat that also expands what seems a conventional form.\na\na\nb(=a′) a\nb\na\nb\na\n0:00\n\n0:23\n0:52\n1:19\n\nfuller,\n\nthicker chords\n|: a :|\n\nba\nBA\nba\n(rounded binary with loud\ndisruption)\nA\nB\nA′\n(ternary with only texture and\ndynamic contrast)\n\"Florestan\" K 4:3\nan impetuous single theme movement with \"nostalgic\" interruptions (indicated by a 'p' in\nthe chart below) from an earlier collection of piano pieces by Schumann, Papillons\n(1831), based on a scene of a masked ball in a novel (Flegeljahre by Jean Paul);\n\"papillons\" = butterflies, which relates to the theme of transformation inherent in the\nmasking.\nForm:\na\n[p]\na\n[p]\na\n|: b :| b'\na'\nTimings:\n0:00\n0:11\n0:26\n0:51\n# of measures: 8\n|: 8 :| 8\nsection form: aaba\naaba\naaba\ncaca\nccc′c′ a a ASCH-ASCH\n2 2 4\n\nChopin, Nocturne in F-sharp, Op. 15, No. 2 K 4:4\nNocturne = night piece (serenade? lament?); the blurring of the beat that occurs in\nSchumann's \"Eusebius\" is an inherent part of Chopin's style and enhanced by extensive\nuse of rubato, a flexible adherence to tempo that allows for slowing down and speeding\nup. Chopin's use of groups of 3, 5, 6, 7 (and at one point 30!) notes over the space of 1 to\nfour measured notes creates a completely liquid sound on the surface. The underlying\nstructure, however, is amazingly regular and based on 8-bar phrases.\na\na′\nb\nc\na′′\ncoda\n0:00\n0:26\n0:57\n1:27\n2:13\n2:54\nA\nB\nA\nChopin, Ballade No. 3 in A-flat major\nPerformed by Lindy Blackburn, G (Physics), pianist\n1. the \"ballade\" partakes of the piano miniature in its freedom of form, but is\ntypically bigger in length and substance\n2. the term \"ballade\" derives from song and refers to a narrative that typically takes\nstrophic form (Der Erlkonig is a ballade)\n3. Chopin wrote four ballades\nBallade No. 3 in A-flat major\nA\na legato (smooth) theme moving largely by step; it takes the shape of a ternary\nstatement: aba\nB\na more lively theme off the beat (syncopated); it also takes a ternary shape: cdc\nC\na true \"central section\" in the mode of a waltz; Chopinesque flowing notes\nB\nreturn and extended development\nA\nfortissimo return with much thicker texture (think of the similarly \"thickened\"\npassage in Schumann's Eusebius)\nC\ncoda using C material\nRecording: Great Pianists of the 20th Century, vol. 85, Artur Rubinstein, piano (Philips\nClassics, 1998)\n\nSong Repertoire: read Kerman/Tomlinson; some emphases and additional points below\nPerformed by faculty members Ellen Harris (soprano) and Charles Shade (piano)\nClara Schumann: \"Der Mond kommt sill gegangen\" K 3:25\npoem in three strophes\nmusical setting is in modified strophic form\nthe first two strophes are set alike, but the third differs\nsome reasons for the change:\nthe first two strophes speak of the atmosphere; the third is a personal statement\nthe third strophe has more syllables while maintaining the same poetic foot (or\naccent pattern)\nthe first two strophes end reaching out, drifting; the third strophe \"could\" end this\nway and \"could\" in fact be set to the same music as the first two (as\ndemonstrated in class), but this would give the song an inconclusive\nending and poor text setting\nthe changes to the third strophe include: a lengthening of note value for the word\n\"drunten\" (down below); a quickening of note values on \"funkeln\"\n(flickering candle light), a melodic climax (high note) on the reference to\nthe loved one's house (\"Haus\"); a fragmented descent through the\ndarkness and stillness (\"Dunkeln\" and \"Still\") to a definitive (and\ntherefore somewhat desolate) closure on \"Welt hinaus\" (the staring \"out to\nthe world\").\nRobert Schumann: \"Im wunderschonen Monat Mai\" K 3:23\nthe first song from the song cycle Dichterliebe (\"A Poet's Love\"); the poems by Heinrich\nHeine\npoem in two stanzas\nmusical setting is strophic\nthe accompaniment blurs the main beat by anticipating it with a single note that is then\nheld over and not articulated on the beat--this happens repeatedly; the\naccompaniment also repeatedly uses a melodic fragment that makes an upward\nleap that goes a little \"too far,\" so creates a dissonance that needs to \"relax\"\ndownward by step; this melodic motion feels like yearning or longing and is often\nused to depict the same; the same kind of occurs at the opening of \"There's a\nplace for us\" in West Side Story (on \"There's a place\" with the resolution on\n\"place\"); the motion is also distinctive of the \"love-death\" motive of Wagner's\nTristan und Isolde, on the listening for next week\nthe song doesn't \"end\" in the sense of having a conclusive cadence; it just reaches out\n(yearning) on a chord that asks for resolution\nRobert Schumann: \"Die alten, bosen Lieder\" K 3:24\nthe last (16th) song of Dichterliebe; the love and yearning have not been reciprocated; this\nsong depicts the lover's reaction: he wants to build a huge coffin in which to put\nall the \"old, hateful love songs\" and describes just how big; he then explains why\nit has to be so large: it will hold not just the songs but he will bury in it all his love\nand grief\n\npoem in 5 stanzas\nmusical setting is through-composed; that is, it doesn't follow the strophic pattern or any\nother pre-determined form\nthe first stanza sets the scene and Schumann sets the text with a highly profiled and\naccented set of downward leaps; the repeated strong downward pulls emphasize\nthe dismissiveness, throwing away, burying of the text\nstanzas 2-4 describe \"how big\"; each climaxes with a leap upward and with each strophe\nthe motion moves up one scale degree (the higher and higher notes depicting a\nbigger and bigger stretch)\nstanza 5 returns to what has to happen to the coffin; Schumann here returns to the music\nof the opening strophe (varied)\nstanza 6 (like the last strophe of Clara Schumann's song) brings in the individual, the\nuse of first person, and here the music changes completely from the hammering\ndismissiveness to quiet reflection (recitative-like) and disintegration\n(fragmentation)\nrather than end on this note, Schumann provides a substantial piano postlude; remember\nthat this is a postlude not just to one song, but to the set of 16; Kerman/Tomlinson\nsuggests that it is meant to comfort the poet; I rather think that its repeated\ndownward motion reaches back to the brutal downward motion of the opening of\nthis song, now transformed from the initial angry mood into the personal grief\nexpressed in the last strophe\nSchubert, \"Erlkonig\"\nK 3:22\nan individual song composed by Schubert at 18\npoem in 8 stanzas by Goethe\nthe poem is rich in the use of form and style to depict its story: the rhythm of the wild\nnight ride through the woods is clearly heard in the rhythm of the poetic meter (as\nread in class); the strophes are set up to indicate the progress of the story: stanza\n1, the narrator sets the scene; stanza 2, the father asks what troubles his son, the\nson identifies the Erlking, and the father dismisses the notion; stanza 3, the\nErlking entreats the boy to come with him and play games in a beautiful place;\nstanza 4, the boy cries out to his father who tries to calm the boy; stanza 5, the\nErlking entreats the boy to come sing and dance with his daughters; stanza 6, the\nboy cries out again and the father again offers empty consolation; stanza 7, the\nErlking, having lost patience, reaches out and grabs the boy by force, who cries\nout for the last time (this is the first time that the Erlking and the boy have shared\na stanza; it indicates the coming together of death and the boy; the father doesn't\nrespond; it is as if the Erlking has replaced the father); stanza 8, the narrator\ndescribes the arrival at home and the death of the boy\nClearly the poetic meter, rhythm, strophic form and characterization are all important\nelements of the poem; as a result, Goethe liked settings that preserved all of this;\nan example of such a setting by Johann Friedrich Reichardt (1752-1814; about the\nsame lifespan as Haydn); this setting uses strict strophic form, but the voice sings\nin monotone (one note) for the Erlking's part while the piano continues to play the\nmelody; this was Goethe's favorite setting (performed in class)\nSchubert's setting puts the rhythm of the poem in the piano (the pounding hoofbeats of\n\nthe horse); as a result the rhythm of the poem is often drained from the setting of\nthe words; the father's part lies low in the voice; the boy's part lies high; the\nfather's part is often accompanied by \"empty\" octaves, depicting his \"empty\"\nconsolation; the Erlking sings in major and tries to entreat the boy with jolly\nmelodies, but the boy cries out in pain, set by Schubert to a searing dissonance,\nand each of his three responses rises higher as if the pain thus increases (compare\nSchumann's use of this rising technique to depict ever bigger); the Erlking's last\nlines are brutal and declamatory (no more pretended sweetness); the last strophe\nreturns to the rushing wind motive of the opening as the father drives the horse\nfaster and faster; Schubert depicts the arrival at home, the slowing and stopping,\nand then drops into the most quiet and unembellished recitative to state that when\nthe father arrived home, the boy was--dead; and the song ends; the abruptness of\nthis ending adds to the shock; Goethe heard this setting but disapproved as the\nmusic completely overwhelms the poem and its distinctive compositional\nmethods"
    },
    {
      "category": "Lecture Notes",
      "title": "week10_lecture09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/adbb2909ce07c29cf4f2eea751305c93_week10_lecture09.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\nLecture IX\nRomantic Grand Opera\nThe key elements of the nineteenth century emphasized last week for the \"miniature\"\nrepertoire, apply equally well to the \"grandiose\":\n1. tie to literature\n2. tie to individual\n3. tie to the supernatural and macabre\nNineteenth-century opera developed along two fronts.\nComic opera continued following Mozart in both its Italian through-composed form\nwith recitative (like Don Giovanni) and in the dialogue style common to France,\nGermany and England. Giacomo Rossini (1792-1868) and Gaetano Donizetti (1797\n1848) were two composers whose comic operas sparkled in the early nineteenth century\nand continue to hold a major place in operatic repertoire today. Dialogue style comic\nopera evolved into what is now called operetta (or little opera), which rose in the second\nhalf of the century as Italian opera buffa declined. Three composers stand out: in France,\nJacques Offenbach (1819-1880: Orpheus in the Underworld, 1874)), in Germany,\nJohann Strauss, the younger (1825-1899: Der Fledermaus, 1874), and in England, Arthur\nSullivan (1842-1900), especially in his collaborations with W. S. Gilbert (1836-1911).\nSerious opera (opera seria) also followed divergent paths based on national traditions,\nalthough the influence of literary works by Shakespeare, Goethe and Sir Walter Scott\ncrossed all boundaries. Opera seria continued in Italy with Rossini (Guglielmo Tell,\n1829), Donizetti (Lucia da Lammermoor, 1835, based on Sir Walter Scott) and Vincenzo\nBellini (1801-1835: I Capuleti e i Montecchi, 1830). In France, grand opera flourished\nin the hands of Hector Berlioz (1803-1869: Les Troyens, 1863), Georges Bizet (1838\n1875: Carmen, 1875) and Charles Gounod (1818-1893: Faust, 1859; Romeo et Juliette,\n1867). In Germany, a national opera based on folk tales and legends grew up through\nthe efforts of Carl Maria von Weber (1786-1826: Der Freischutz, 1821) and Jakob (later\nGiacomo) Meyerbeer (1791-1864), who was largely responsible for the fusion of the\nthree national, European operatic styles: his first three operas were written for\nGermany (1812-1814), then from 1817 to 1824 he composed Italian opera for Milan and\nVenice, and from 1831 to 1865 he wrote French grand opera for Paris. The two titans of\nserious opera by the second half of the century, Richard Wagner (1813-1883) and\nGiuseppe Verdi (1813-1901), were indebted to Meyerbeer's work and followed his\nlead in their own unique ways.\n\nWagner (1813-1883)\nEarly influences:\nLiterary: Shakespeare and Goethe:\n1828 (aet: 15) wrote a tragedy based on King Lear and Hamlet\n1830 (17) 7 compositions based on Faust\n1834 (21) Das Liebesverbot (based on Shakespeare's Measure for Measure)\nMusical:\n1829 (16) Beethoven's opera Fidelio\n1830 (17) wrote a piano reduction of Beethoven's 9th symphony\n1834 (21) Mozart's Don Giovanni\n1838 (25) Mozart's 40th Symphony\nEarly period (1833-1842)\nincludes years in Paris (1839-1842); influence of Berlioz (Symphonie Fantastique;\nRomeo et Juliette); threatened with prison on account of his debts\nThe Flying Dutchman (begun 1840; premiered 1843)\n2nd period (1843-1849) Dresden; Conductor of the Royal Opera; insurrectionary\noutbreaks in Paris 1848 heralded as a model by middle-class German liberals; Wagner\nbacked the revolutionaries and was forced to flee to Switzerland with the help of Liszt\nLohengrin (begun 1845; premiered 1850)\n3rd period (1849-1863) Zurich exile; patronage of Otto Wesendonk, whose wife Mathilde\nbecame a love interest; lull in composition; theoretical works (The Artwork of the Future,\n1849; Opera and Drama, 1851); beginning of Ring of the Niebelung (libretto published\n1853); interruption of composition of Ring to compose Tristan und Isolde (begun 1854;\ncompleted 1859; premiered 1865)\n4th period (1864-1877) Munich; establishment of Bayreuth (1872); premiere of Ring\n(1876)\nlast period (1878-1883)\nParsifal (premiered 1882)\nfirst marriage: 1836 (23) to Minna Planner (d. 1866)\nsecond: to Cosima, the daughter of Liszt and Countess Marie d'Agoult (see image in\nKerman/Tomlinson, p. 236; and discussion, p. 263); Cosima had been previously the wife\nof Hans von Bulow, conductor and supporter of Wagner, who conducted the first staged\nperformance of Tristan in 1865. Cosima bore Wagner two children out of wedlock; after\nreceiving a divorce from von Bulow, Wagner and Cosima married in 1870.\nWagner was demanding and difficult in his professional life; he placed his own needs and\ndesires above friendship and patronage (as seen in his love life); and he remains\npermanently scarred by his anti-semitic attacks on Jewish composers Mendelssohn,\n\nMeyerbeer, and Halevy, each of whom had been an important musical influence and two\nof whom, Meyerbeer and Halevy, had personally assisted Wagner in his career. His\nwritings were taken up by the Nazis in the 20th century, and his music was made a\nmusical symbol for their political party. Wagner, more than any other composer perhaps,\nraises the issue of whether a person can be separated from his or her work. Nevertheless,\nWagner's importance can be gauged by the fact that almost everyone holds an opinion\nabout his music, whether they like it or not and even whether they know it or not.\nWagner's music is without question among the most important in the history of Western\ncomposition. Happily, Tristan und Isolde raises fewer of these questions than some of\nWagner's other operas.\nTristan und Isolde (1854-1865)\nAncient Celtic legend\nfirst written down in the 12th century\n1854--first ideas\n1856--first sketches\n1857--completed the text\n1858-59--composition\n1860--prelude performed\n1865--first performed; conducted by von Bulow\nthe opera commemorates and celebrates Wagner's love affair (probably never\nconsummated) with Mathilde Wesendonk, the wife of his most supportive patron; it was\nultimately conducted by von Bulow, the husband of the woman he would steal away and\nmarry, who was Liszt's daughter; Tristan has strong musical ties to \"Die Lorelei\" a song\nby Liszt and Nirwana, a symphonic poem by von Bulow\nthere is a strong (and clearly intended) relation to Romeo and Juliet; forbidden love; the\nimportance of magic potions on which the plot hinges; and the uniting of the lovers in\ndeath.\nThe opera tells of the Irish maiden Isolde who is betrothed to Morold, her kinsman. He is\nkilled in battle in Cornwall by Tristan, who, mortally injured himself, disguises himself\nand seeks out Isolde to cure him with her medicinal arts. Although Isolde recognizes\nhim, she spares and saves his life, as her pity and love have been aroused. Tristan,\nreturning in health to Cornwall, has offered to claim Isolde as a bride for his uncle, King\nMark. The opera opens on board ship as Isolde is being transported with her maid,\nBrangane, from Ireland to Cornwall.\nIsolde's anger about Tristan's treachery is exacerbated by rude songs about Irish maidens\nsung by the sailors, and she is distraught at the thought of being forced into a loveless\nmarriage. Brangane, who had not been aware that Tristan is the same person she watched\nIsolde nurse back to health, thinks to mollify her mistress by reminding her that she can\nbind King Mark to her with the love potion. However, this serves only to remind Isolde\nof the death potion, and she resolves to kill herself and Tristan. Brangane, in horror,\n\nsubstitutes the love potion, which Tristan and Isolde drink just as the ship arrives in\nCornwall and King Mark appears to claim his bride.\nAct II depicts the lovers' nighttime tryst. Heedless of Brangane's sung warning and of\nthe growing dawn, they are interrupted by the arrival of King Mark and his retinue.\nTristan is wounded by one of Mark's courtiers, Melot.\nAct III takes place at Tristan's castle in Brittany where he lies dying and delirious. Isolde\narrives by ship just in time to have him die in her arms. King Mark's ship, closely\nfollowing, arrives immediately after and despite his intention to allow the lovers the\nfreedom to be together and his pleas for calm, there is fighting in which both Melot and\nKurwenal, Tristan's devoted servant, are killed. The opera ends with Isolde's\ntransfiguration during which she sinks onto Tristan's body and is mystically united with\nhim in death.\nPrelude K 4:16-20\nPhilter Scene K 4:21-23\nDVD: National Theater Munich during the Munchner Opernfestspiele, 1998: Waltraud\nMeier (Isolde), Marjana Lipovsek (Brangane), Han Wilbrink (Helmsman), Zubin Mehta,\nconductor\nWagner's use of\n1. small motives, as in the miniature character pieces, spread over a huge canvas,\nand with specific meaning (Leitmotiv); that is, an opera should not divide into\nrecitative and aria \"as if it were a concert featuring self-contained musical pieces\"\n(Jon T. Finson, Nineteenth-Century Music: The Western Classical Tradition\n[Prentice-Hall, 2002] p. 165)\n2. chromaticism\n3. deceptive cadences\n4. rich orchestral tapestry, with \"the artistic position and status equal to that of the\ngreatest symphonic music\" (Rey M. Longyear, Nineteenth-Century Romanticism\nin Music [Prentice-Hall, 1973] p. 170); \"the orchestral accompaniment [should]\nplay an active role in the drama, [avoiding] periodic phrasing...[and containing]\nits own melody composed of motivic presentiments [Leitmotiv]\" (Finson, p. 166)\n5. vocal sprech-gesang: \"Wagner's vocal melody [is] often just another strand in the\norchestral texture and chiefly devoted to expressing the text\" (Longyear, p. 175);\n\"vocal lines [should] avoid virtuosic display, bel canto, and regular, repeated\nphrases\" (Finson, p. 166),\n6. Gesamtkunstwerk (integrated unity of plot, poetry, music, scenery, costume and\naction); \"focus on dramatic interactions between characters rather than scenes\ninserted merely to produce spectacle\" (Finson, 166).\n\nVerdi (1813-1901)\n1st period (1839-1849) mainly in Milan: 14 operas, many associated with the movement\ntoward Italian independence from Austria, France and the papacy through their political\nsubjects; e.g. Macbeth (1847) based on Shakespeare and dealing with political unrest in\nScotland\n2nd period (1849-1857) spent a lot of time in Paris; revised I Lombardi for performance in\nParis; operas of this period (for Italy) more typically about \"personal relationships\nbetween characters (rather than on grand political conflict)\" (Finson, p. 146); e.g.\nRigoletto (1851) and La traviata (1854)\n3rd period (1857-1874) experimentation with French grand opera culminating in Don\nCarlos (Paris, 1867); in 1860s Verdi closely associated with the movement toward\nindependence and unification of Italy (\"Risorgimento\"), for which he \"served as both\nchampion and symbol\" (Finson, p. 152); last name taken as acronym for the cry to have\ntheir chosen monarch unite Italy under secular rule: \"Vittore Emanuele, Re D'Italia\"\n(Victor Emmanuel, King of Italy); Victor Emmanuel became king in 1861; unification\ncomplete in 1871; in 1874 Verdi \"elected to an honorary position in the Italian senate\"; in\n1871, Verdi \"finally succeeded in combining elements of French grand opera and\ntraditional Italian opera in a completely way\" in Aida, \"commissioned for the Cairo opera\nhouse in celebration of the new Suez Canal\" (Finson, p. 152)\n4th period: (1875-1879) retirement to his farm; in 1875 his publisher Ricordi suggested an\nopera based on Shakespeare's Othello with a libretto by Arrigo Boito; Otello (1885); then\nFalstaff based on Shakespeare's Merry Wives of Windsor (1893).\nAida\n1870 commissioned on basis of written scenario by the Egyptologist Auguste Mariette;\nlibrettist commissioned to write the full libretto (Ghislanzoni);\nVerdi and Ghislanzoni worked closely; Verdi pressuring Ghislanzoni\n1871 premiere delayed by Franco-Prussian War, \"the siege of Paris having trapped the\nsets and costumes in the French capital\" (Roger Parker, \"Aida,\" Grove Music\nOnline, ed. L. Macy); further problems with casting; premiere 24 December\nSet \"at the time of the Pharoahs,\" the opera takes place during hostilities between Egypt\nand Ethiopia. Young \"Radames is appointed to command the Egyptian armies.\nLoved by the Pharoah's daughter Amneris, he himself is in love with Aida,\nAmneris's Ethiopian slave, captured during a previous campaign.\" It is unknown\nthat Aida is daughter to the King of Ethiopia, who himself is captured by\nRadames in the current campaign. Meeting with his daughter, the king \"bullies\nher into persuading Radames to betray an important military secret.\" Learning of\nthis Amneris betrays Radames, with the intent of saving him if he will pledge his\nlove to her. Only after he refuses to be false to Aida and is condemned to die by\nentombment, does Amneris realize too late what she has done. All her efforts at\nthis point to have him pardoned fail. In the last scene, a spectacular, specified\n\nvertically split stage shows Radames entombed below with the priests intoning\nabove; Aida has crept into the tomb unobserved; Radames is at first horrified, but\nAida envisions the angel of death approaching in \"radiance.\" Aida sings her\nfarewell to earthly sorrows, seeing the heavens open to eternal day; Radames\nrepeats this with interjections by Aida; finally they sing it together as above them\nAmneris in a monotone prays for their souls to rest in peace. The duet melody,\ntaken over by the violins, implies their death and ascendance (compare to the end\nof Dido's \"When I am laid in earth,\" where the repeating bass ascends to the\nhighest register in the violins and descends the full scale after Dido's death)\nFinal scene K 4:12-15\nDVD: Metropolitan Opera House, New York, 1988: Aprile Millo (Aida), Placido\nDomingo (Radames), Dolora Zajick (Amneris), James Levine, conducting\nAs Kerman/Tomlinson illustrates, the scene begins in recitative, moves through an arioso\nfor Radames, followed by one for Aida, then a duet. With each segment, the\nmusic becomes more simple and clear in organization and more lyrical as the\ncharacters pass from reality to transcendence.\n1. recitative: Radames--largely monotone (first move away from monotone when\nhe speaks Aida's name)\n2. recitative: Radames--more agitated; and Aida--more melodic, but note death\nknell--the sound of a low-pitched tolling bell--in the orchestra\n3. arioso: Radames--more tuneful but orchestra very subdued and hesitant\n4. arioso: Aida--classical a a′ | b a′ | c pattern with full Romantic harmony\n5. duet: Aida and Radames: aa′ | ba′ | c (x4!) (compare to In paradisum in terms of\ncontext and repetition; compare to the end of Dido's Lament in terms of the\norchestra taking over the melodic function after the voices cease)"
    },
    {
      "category": "Lecture Notes",
      "title": "week11_lecture10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-011-introduction-to-western-music-spring-2006/6c22b65374ce9402449964df612bf0eb_week11_lecture10.pdf",
      "content": "21M011 (spring, 2006)\nEllen T. Harris\nLecture X\nRomantic Orchestral Music\nThroughout the 19th century, composers continued to write orchestral music in two\ndifferent tracks. In the first, the music evolved exclusively out of its own musical\ncomponents following the example of most symphonies by Haydn, Mozart and\nBeethoven. Schubert, Schumann and Brahms are major composers in this form, referred\nto as \"absolute\" music. This was opposed to the second track of program music, or music\ncomposed to depict some extra-musical storyline, as exemplified by Berlioz's Fantastic\nSymphony. Of course, this is not to say that program music lacked internal musical\norganization, but rather that it was harnessed to an extra-musical topic. There is, needless\nto say, some blurring of these categories.\nBrahms, Violin Concerto, third movement K 5:5-10\nA good example of absolute music. This last movement follows a traditional, if\nsomewhat modified, rondo form: A B A′ C B A′′ . Further, the A theme is in written out\nrounded binary form: aa | ba′ . Each return of A then presents a section of the theme\n(similar to the way Bach fragments the returns of his ritornellos); the use of variation in\nthe returns is similar to Haydn's process.: A′ = aa′′ and A′′ = ba′′′ . The lack of a return\nafter C is the only oddity.\nMahler, Symphony No. 1, third movement K 5:11-18\nThis movement, the third of five in the symphony, falls somewhere between absolute and\nprogram music. Kerman/Tomlinson refers to its form as a type of minuet/trio (with two\ntrios). In this interpretation the funeral march = the minuet (here a march instead), and\nthe trios are Kerman/Tomlinson's Section 2 (dance-band) and Section 3 (song). Indeed,\nSection 2 falls into a repeated binary form (written out): ab ab′ . However, this analysis\nseems to overlook the return of the march at 4:12; at least, this return is not identified\nwith a \"section\" number. I think, rather, that this movement can be considered a rondo\nform: A B A′ C A′′ . We will come back to this movement later.\nChaikovsky, Overture-Fantasy, Romeo and Juliet K 4:24-25\nThis self-contained piece in one movement is an excellent example of program music; it\nis based on Shakespeare's Romeo and Juliet. However, unlike many programmatic\npieces that fall into free forms dependent on the story line, Chaikovsky manages to tell\nthe story within the confines of sonata form.\nPyotr Ilyich Chaikovsky (1840-1893), like Wagner, was strongly influenced by Mozart's\nDon Giovanni, Italian opera, Berlioz (orchestration and narrative form), Chopin (freedom\nof form), and Liszt (power of the large-scale, less specific narration)\nChaikovsky met Berlioz in 1867.\n\nChaikovsky wrote symphonies and many operas; he is particularly famous for his ballets\n(The Nutcracker, Swan Lake, Sleeping Beauty) that tell stories in free, narrative form.\nChaikovsky's Romeo and Juliet\n1869: first version\n1870 (2nd version)\n1880 (3rd version)\nbasic story line:\nRomeo (Montague)\nJuliet (Capulet)\nsecret wedding\nMercutio killed by Tybalt (Romeo tries to prevent)\nRomeo kills Tybalt\nRomeo exiled\nwedding night\nJuliet told to marry Paris\nFriar provides a sleeping potion to Juliet that mimics death\nin the tombs, Romeo kills Paris, takes poison\nJuliet, waking to find Romeo dead, kills herself with his knife\nKerman/Tomlinson states that \"Chaikovsky followed the outlines of the original play\nonly in a very general way,\" but I would suggest that the connection is stronger than that.\nThe overture-fantasy, in sonata form, opens with a slow introduction based on a modal\nhymn theme representing Friar Lawrence and giving the whole story a more magical,\nmystical cast (much like Tristan und Isolde).\nThe exposition opens with the \"vendetta theme\" depicting the fighting between the young\nMontagues and Capulets by the use of contrapuntal (fugal) techniques (compare Berlioz,\nSymphonie fantastique last movement). The \"sighing\" theme (at 7:16) with its\nalternating notes comprising a dissonant and unresolved interval represents Juliet, and\ndepicts her tremulous excitement at this point in the balcony scene (\"Romeo, Romeo,\nwherefore art thou Romeo?\"). The love theme represents Romeo (compare with the idee\nfixe theme of Berlioz in its yearning intervals and use of sequence).\nThe development plays the fighting theme against the hymn of the introduction--the\nhymn here representing the wedding of Romeo and Juliet by Friar Lawrence in the face\nof the opposition of their families.\nThe recapitulation explodes with the fighting theme, representing the deaths of Mercutio\nand Tybalt, with the immediately following \"sighing theme\" (12:24) indicating Juliet's\nreaction to the Duke's decision to exile Romeo as she anticipates his arrival, signaled by\nthe return of the love theme. The combination of these themes represents their wedding\nnight together, with the love theme fragmenting at Romeo's departure (14:04). The\n\nreintroduction of the \"vendetta\" theme and of conflict portrays her family's insistence\nthat Juliet marry Paris; the return of the hymn theme depicts Juliet's plea for help from\nFriar Lawrence, who gives her the sleeping potion.\nIn the coda, Romeo arrives in Juliet's tomb (love theme with muffled funeral drums); he\ndrinks poison (the theme fragments further); Juliet awakens (transformation of the\nsighing theme [16:40]). In most nineteenth-century productions of the play, Juliet\nawakens just before Romeo dies so that they have a moment together: this may be\nrepresented by the \"transcendent\" version of the love theme (17:46).\nThe drum roll and final cadences may depict Juliet's desperate suicide following\nRomeo's death, the final scene of death illustrating the ghastly result of the feud between\nthe families. It is striking that Chaikovsky chooses to end the movement not with the\nlove theme dying away, but with this sense of violence and loss, which is more\nShakespearean than Romantic.\nNationalism\nWestern music from its origins had a shifting geographical center. In the Middle Ages\nand Renaissance, the dominant group of composers were Franco-Flemish (Perotin,\nVentadorn, Machaut, Dufay, Josquin). Toward the end of the 16th century, the center\nshifted to Italian cities and courts (Palestrina, Gabrieli, Monteverdi, Frescobaldi,\nVivaldi). Over the course of the eighteenth century, the center (with the exception of\nopera) shifted to German-speaking lands (Bach, Handel, Haydn, Mozart, Beethoven,\nSchubert, Schumann, Wagner, Brahms). Increasingly, however, with the rise of nation\nstates (Italian risorgimento; see Verdi), the overthrow of absolute monarchy through\nrevolution (France, Russia) and the rise of constitutional monarchy in England following\nthe American Revolution, the arts began to take on specifically national characteristics,\nusing folk music (song and dance) as a basic for composition. In countries that lost\nindependence, such as Poland, nationalism took on perhaps even more importance than in\ncountries that gained it. In part, of course, this musical trend was political, and political\nmessages have always been important in music. For example, Mozart in his operas\ndepicted the strength and morality of the lower classes against the weakness and\nimmorality of the upper classes and Beethoven originally intended his 3rd Symphony to\nhonor Napoleon. Later, Verdi's operas became important political vehicles. In part,\nhowever, the trend by the end of the 19th century was as much (or more) toward the\nportrayal a distinctive national sound through the incorporation of \"characteristic\" folk\nidioms than the depiction of political or revolutionary subject matter. In a way,\nnationalism in music blends early 19th-century politicism with the development of\n\"character\" pieces, the \"character\" in this case being a national identity. Both kinds of\nnationalism continued well into the 20th century. When composers adopt a national\nidiom other than their own, the term \"exoticism\" is used (Verdi's imitation of Egyptian\nmusic for the hymn of the priests; another example not in your text is Ravel's \"Bolero\").\nSome examples (underlined composers in your text):\n\nPoland: Chopin (Polonaises, Mazurkas), Paderewski, Penderecki, Lutoslawski\nCzech: Smetana, Dvorak, Janacek\nHungary: Liszt, Bartok, Kodaly, Ligeti\nGermany: Johann Strauss (family: waltzes, Landler), Mahler\nScandanavia: Grieg, Sibelius, Nielson, Saariaho\nEngland: Sullivan, Elgar, Vaughan Williams, Britten\nFrance: Saint-Saens, Faure, Debussy, Ravel, Satie, Poulenc\nSpain: Granados, de Falla\nU.S: Gottschalk, John Philip Sousa, Joplin, Ives, Copland, Ellington, Gershwin, Bernstein\nPerhaps the greatest national school was the Russian: Rimsky-Korsakov, Musorgsky,\nBorodin, Chaikovsky, Stravinsky, Prokofiev, Shostakovich\nMusorgsky, Pictures at an Exhibition K 5:1-4\nModest Musorgsky (1839-1881) was not a trained musician. Because of his social class\n(he came from a wealthy land-owning family of north central Russia), he was trained as\nan officer in the Russian Imperial Guard (the Tsar's bodyguards), but after revolutionary\nchanges in Russia that \"caused the liquidation of his family estate,\" he made his living in\na clerical job. His continuing interest in composition admitted him to a loose-knit group\n(Kucha) of nationalist Russian composers organized by Balakirev that included Glinka,\nBorodin, Rimsky-Korsakov and, briefly, Chaikovsky, among others.\nAs a child, his mother taught him piano. While in the guards he sought composition\nlessons in musical form from Balakirev based on a study of Beethoven symphonies. In\n1858, he resigned from the guards to pursue music as a gentleman. However, the\nemancipation of the serfs in 1861 forced him to take civil service jobs to keep body and\nsoul together. He shared a room with the composer Rimsky-Korsakov.\nPictures at an Exhibition (1874) is based on paintings by the architect Victor Hartmann.\nMusorgsky had met Hartmann in 1870, and they had become close friends. When\nHartmann died suddenly in 1873, Musorgsky grieved deeply, and an exhibition of\nHartmann's \"characteristic\" paintings in 1874 prompted this musical cycle. Influenced\nby the work of Schumann (compare Carnaval) and Liszt, Pictures is a cycle of piano\nminiatures tied together by the \"Promenade\" from room to room of the museum.\nHartmann believed that Russian architecture should draw its inspiration from folk\ndesigns; Musorgsky's Pictures follows this nationalistic goal.\nRimsky-Korsakov edited the score for publication. Maurice Ravel orchestrated it in\n1922. In the list of contents below, the paintings are indicated by italic. The original\npiano version follows from the tradition of Schumann's Carnaval in its serial depictions\ncreating a set of miniature character pieces. (Notes based in part on Jon W. Finson,\nNineteenth-Century Music: The Western Classical Tradition [Prentice-Hall, 2002], pp.\n231-241).\n\nKerman/Tomlinson includes four movements in Ravel's orchestration:\n1. Promenade (groupings of five and six with a pentatonic melody, based on Russian\npentasyllabic verse and folk melody)\n2. Gnomus (nutcracker: lurching rhythms, dissonant harmony)\n3. Promenade\n16. The Great Gate of Kiev (chorale-like setting, including Promenade theme and Russian\nfolk song)\nListening to the original piano version is highly recommended: Musorgsky, Pictures at\nan Exhibition, Anatol Ugorski, piano (Deutsche Grammophon, 1992).\n[In a recent semester the piano version was played in class by Joey Zhou '07 (EECS).]\nMahler, Symphony No. 1, third movement--again K 5:11-18\nIt is now possible to reconsider Mahler's movement in light of nationalism. The\nmovement, like Musorgsky's Pictures is based on a \"well-known nursery picture of the\ntime\" (Kerman/Tomlinson, p. 303); see p. 304 for the picture. Mahler bases his march on\na parody of a familiar nursery tune, \"Frere Jacques,\" putting it in minor at a slow tempo.\nKerman/Tomlinson writes that Mahler's distorted marches can be traced to his\nrecollections of parade music at the military barracks near the home where he grew up.\nThe first episode, or dance band music, is based on the sound (or perhaps a specific\nexample) of Jewish klezmer music heard in Bohemia, a tribute, perhaps, to Mahler's own\nJewish heritage. The second episode is based on a song about lost love. The use of pre\nexistent folk-like material to conjure up the sounds of his German environment gives this\nmovement a significant nationalistic content. (Brahms's use of gypsy music in his Violin\nConcerto is a form of exoticism, see Kerman/Tomlinson, p. 300.)\nDebussy, Nocturne No. 1, \"Clouds\" K 5:19-24\n1. the term \"nocturne\" evokes a night-time scene\n2. model = Chopin's Nocturnes for piano (piano miniature)\n3. Debussy's Nocturnes, and \"Clouds\" in particular, influenced by the impressionist\npainting of James McNeill Whistler--the third example in your syllabus of a\nmusical composition influenced by visual art (compare Mahler, Musorgsky).\nKerman/Tomlinson describe this piece in ternary form. In doing so, the English horn\nmotive is given no identity, although it is this theme that returns the most often and ends\nthe piece. I think it is difficult to hear this work in simple ternary form. Like clouds\nthemselves, it is more amorphous, moving in and out of familiar material and\nfragmenting at the end. I have compared the two analyses below.\n\nKerman:\nA(a\nb\na)\nB\nA′\nHarris:\na\nb\nc\nb\na\nd\nb\na\nd\nb\n\nfragmenting\n\nThemes a-d (Harris analysis) have distinctive characteristics: a (cloud theme; chromatic);\nb (English horn; octatonic); c (rising section); d (flute; pentatonic). The use of non-tonal\nscales and amorphous form give this piece its \"impressionistic\" quality.\n\nSummary of Romantic era: Schubert to Debussy\nChronology\nSchubert, Erlkonig (1815)\nSchubert, Moments Musical (1827?)\nBerlioz, Fantastic Symphony (1830)\nChopin, Nocturne (1831)\nRobert Schumann, Carnaval (1833-35)\nRobert Schumann, Dichterliebe (1840)\nClara Schumann, Der Mond kommt still gegangen (1843)\nWagner, Tristan und Isolde (1859)\nChaikovsky, Romeo and Juliet Overture-Fantasy (1869; revised 1880)\nVerdi, Aida (1871)\nMusorgsky, Pictures at an Exhibition [for piano] (1874)\n--orchestrated by Ravel (1922)\nBrahms, Violin Concerto (1878)\nMahler, Symphony No. 1 (1888)\nDebussy, Nocturne (1899)\nMiniatures/Character pieces\nProgram music based on narrative stories\nSchubert\nBerlioz\n\nSchumann(s)\nChaikovsky\n\nChopin\nOrchestral movements\nBerlioz (symphony)\n\nChaikovsky (symphonic poem)\n(Mussorgsky)\nBrahms (concerto)\n\nMahler (symphony)\n\nDebussy (symphonic poem)\nProgram music based on paintings\nMussorgsky\nMahler\nDebussy\nSelf-depiction\nBerlioz\nRobert Schumann\n(Wagner)\n\"Absolute\" music\n(Chopin Ballade)\n\nOpera\n\nBrahms\n\nWagner\n\nVerdi\nNationalistic\nMahler\n\nExotic\n(Schubert)\nVerdi\nMussorgsky\n\nBrahms"
    }
  ]
}