{
  "course_name": "Introduction to Biological Engineering Design",
  "course_description": "This class is a project-based introduction to the engineering of synthetic biological systems. Throughout the term, students develop projects that are responsive to real-world problems of their choosing, and whose solutions depend on biological technologies. Lectures, discussions, and studio exercises will introduce (1) components and control of prokaryotic and eukaryotic behavior, (2) DNA synthesis, standards, and abstraction in biological engineering, and (3) issues of human practice, including biological safety; security; ownership, sharing, and innovation; and ethics. Enrollment preference is given to freshmen.\nThis subject was originally developed and first taught in Spring 2008 by Drew Endy and Natalie Kuldell. Many of Drew’s materials are used in this Spring 2009 version, and are included with his permission.\nThis OCW Web site is based on the OpenWetWare class Wiki, found at OpenWetWare: 20.020 (S09)",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Engineering",
    "Biological Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nStudios: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThis class is project-based introduction to the engineering of synthetic biological systems. In this subject, you will have an opportunity to develop projects that are responsive to real-world problems, using solutions that depend on biological technologies. Through interactive lectures and studio time, you will learn techniques, strategies and vocabulary to enable the engineering of your synthetic biological system. These will be gained by considering:\n\nhow biology can be made easier to engineer, including the use of DNA synthesis, standards, and abstraction in biological engineering\n\nthe consequences of success, introducing issues of human practice, including (a) biological safety, (b) security, (c) ownership, sharing, & innovation, and (d) ethics\n\nthe clever solutions that nature has found to solve physical challenges, specifically examining the components that control cellular behavior\n\nthe ways nature innovates, examining the evolution and reuse of good components as well as the reboot of living systems after catastrophic collapse\n\nIt is hoped this subject will provide an engaging introduction for would-be biological engineers as well as a foundational framework for anyone interested in the responsible and reliable programming of genetic material.\n\nIntroducing Synthetic Biology\n\nPoetry\n\nNot long ago when biology meant\n\nlooking and prodding and fixing what's bent\n\nthere were armies of scientists working away\n\nto list what they found\n\nand to know life's display\n\nBut not all was well as they tried to discover\n\nhow life could be programmed since some but not other\n\nexperiments worked and each person designed\n\ntheir template for learning\n\nas they were inclined\n\n\"Share!\" said the engineers \"and try to remember\n\nthat others will use your work only whenever\n\nthe tools you develop are standard and simple\n\nthink of most screwthreads and\n\nthink of the wheel.\n\nMaybe in this way life by design\n\ncould work out of the box and others will find\n\nlots of interesting ways to build up from the bottom\n\nmaking useful new parts\n\nthen new systems. No problem!\"\n\nBy combining devices in new and fun ways\n\nthe biologists builders could spend their workdays\n\nlearning what's out there and making new widgets\n\nto responsibly meet\n\nthe needs of our planet.\n\nVideo\n\nDo-It-Yourself Biology\n: Natalie Kuldell and Reshma Shetty at the MIT Museum, January 14, 2009\n\nThis video was produced and provided by\nMITWorld\n, and is not covered under our\nCreative Commons license\n.\n\nThis presentation and audience discussion briefly covers some of the synthetic biology concepts introduced in this class, and especially speaks to how amateurs and self-learners can work on this subject.In this 1 hour 10 minute program, the first 24 minutes are presentation; then a group discussion is initiated by considering two questions:\n\nIf you could build anything out of biology, what would you build and why?\n\nWhat would you ask your neighbors if they were building this organism in the house next door to you?\n\nThe Implications of Synthetic Biology\n: Drew Endy at the MIT Museum, March 21, 2006\n\nThis video was produced and provided by\nMITWorld\n, and is not covered under our\nCreative Commons license\n.\n\nCourse Details\n\nPolicies\n\nStudents in 20.020 should:\n\nDo great things\n\nDo their best\n\nCome to class with an open mind and some energy to engage with the challenges\n\nWork collegially and constructively\n\nTell people who need to know if there is a problem\n\nWhat You'll Work On\n\nDesign a plausible and compelling synthetic biological system\n\nDevelop a detailed design plan and construction roadmap\n\nEvaluate ownership, commercial, and ethical aspects of the project\n\nLearning Objectives\n\nUnderstand the operation of genetic programs in prokaryotes and eukaryotes\n\nDescribe key enabling technologies that support the engineering of biology, including synthesis, abstraction and standardization\n\nDevelop awareness of issues of human practice that impact and result from the development and application of biological technologies\n\nJoint Meetings with 20.902 Advanced Topics in Synthetic Biology\n\nAn advanced undergraduate course 20.902\nAdvanced Topics in Synthetic Biology\nmeets with 20.020. 20.902 is a reading/journal club class in which the students also act as mentors for the 20.020 project teams, and give weekly presentations on their readings for the combined 20.020 / 20.902 group.\n\nCourse catalog description of 20.902:\n\n\"Provides an in-depth understanding of the state of research in synthetic biology. Critical evaluation of primary research literature covering a range of approaches to the design, modeling and programming of cellular behaviors. Focuses on developing the skills needed to read, present and discuss primary research literature, and to manage and lead small teams. Students mentor a small undergraduate team of 20.020 students.\"\n\nTwo particular aspects of 20.902 are woven into the 20.020 OCW site.\n\nPapers on the\nreadings\npage are assigned only to the 20.902 students. However, 20.020 students are exposed to these papers through the weekly in-class presentations and discussions.\n\nThe project mentoring roles and expectations for 20.902 students are included on the\nprojects\npage\n\nRequirements and Grading\n\nPersonal Design Portfolio (individual grade, up to\n25%\nof your final grade)\n\nA sequence of eight short homework assignments during the first half of the term.\n\nProject Development Notebook (team grade, up to\n10%\nof your final grade\n\nIncludes the team facebook page, team contract, and project log\n\nThe project log is worth 20 points, and the other two components are worth 10 points each\n\nTeam Project Presentations (team grade, up to\n60%\nof your final grade)\n\n3 Ideas Presentation (15%)\n\nTechnical Specification Review (15%)\n\nFinal Presentation\n\ntechnical documents (20%)\n\npresentation (10%)\n\nInstructor Leverage (individual grade, up to\n5%\nof your final grade)\n\nCalendar\n\nL = Lecture\n\nS = Studio\n\nWEEK\n\nSES #\n\nTOPICS\n\nACTIVITIES\n\nKEY DATES\n\nL1\n\nDesign, build, test\n\nPaper airplane\n\nS1\n\nSampling of past projects\n\niGEM project review\n\nL2\n\nScience as a take-apart\n\nTake apart a tape recorder\n\nHomework PDP1 due\n\nL3\n\nEngineering as a rebuild\n\nReassemble the tape recorder\n\nHomework PDP2 due\n\nS2\n\nBroader project landscapes\n\nScripts and storyboards\n\nHomework PDP3 due\n\nL4\n\nDecide what's worth doing\n\nPlay \"Decide\" (an exercise in policy and team dynamics)\n\nS3\n\nSorting hat into project camps\n\nTemporary teams brainstorm project ideas\n\nHomework PDP4 due\n\nL5\n\nKnowns vs. unknowns\n\nThe Clock of the Long Now\n\nHomework PDP5 due\n\nL6\n\nBackyard biology\n\nKitchen DNA, LegoTMPhoresis\n\nS4\n\nProject teams assigned\n\nWork on team contract and Facebook page\n\nTeam contract and Facebook page due\n\nHomework PDP6 due\n\nHomework PDP7 due\n\nL7\n\nFooCampers guide to bioengineering\n\nMore LegoTMPhoresis\n\nL8\n\nScientist as activist\n\nVideo of DNA experimentation hearings, 1976\n\nHomework PDP8 due\n\nS5\n\nDesign day 1\n\nMIT Libraries research guide webpage\n\nWork on projects\n\nL9\n\nInterface between scientific/engineering community and the broader public\n\nGuest lecture by Prof. Jonathan King, MIT\n\nL10\n\nProject work day\n\n3 ideas presentation due\n\nS6\n\n3 ideas presentations\n\nL11\n\n3 ideas feedback\n\nFinal project selection\n\nL12\n\nSystem overviews\n\nFlip books, iGEM \"bacterial buoy\" project\n\nS7\n\nDesign day 2\n\nAbstraction in action part 1: systems to devices\n\nWork on projects\n\nL13\n\nAbstraction in action part 2: devices to parts\n\nL14\n\nParts and registry\n\nS8\n\nDesign day 3\n\nTest and debug; data-driven decision making\n\nL15\n\nHypothesis-driven engineering\n\nValidate system operation, learn from modes of failure\n\nL16\n\nProject work day\n\nTech spec review due\n\nS9\n\nTech spec review presentations\n\nL17\n\nTech spec feedback\n\nPlan project re-design\n\nL18\n\nReliability\n\nFailures of materials, system performance and human sources\n\nS10\n\nRe-design day 1\n\nJoin registry of standard biological parts\n\nL19\n\nOwnership and sharing\n\nInventor vs. investor role playing\n\nS11\n\nRe-design day 2\n\nDrew Endy teaching\n\nL20\n\nProject work day\n\nDrew Endy teaching\n\nL21\n\nProject work day (cont.)\n\nS12\n\nConsultations on projects\n\nL22\n\nTips on oral presentations\n\nL23\n\nProject work day\n\nS13\n\nFinal presentations day 1\n\nThree teams present\n\nL24\n\nQ&A and project work\n\nClass evaluation\n\nL25\n\nQ&A and project work (cont.)\n\nS14\n\nFinal presentations day 2\n\nThree teams present\n\nFinal reports due\n\nL26\n\nWrap-up and celebration\n\nProject log due",
  "files": [
    {
      "category": "Resource",
      "title": "MIT20_020S09_prj1_log_smpl.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-020-introduction-to-biological-engineering-design-spring-2009/c1f0de4c2349dd15ff64ad704cb4e219_MIT20_020S09_prj1_log_smpl.pdf",
      "content": "20.020/20.902/20.947\nBrain/Machine Hybrids\nStudio Meeting Notes/Project Log\nOverview:\nThe Brain/Machine Hybrids project log is a compilation of notes taken at our group meetings as well as\nnotes from separate interviews and research done individually. Most of our meeting time was in class or\nstudio time, and we shared most of our research material via the Facebook group, email, and Google\nDocs. Studio days with no explicit log entry were spent on individual research.\nMore than providing a breakdown/trail of work or comprehensive body of research, this project log should\nprovide an idea of our ideas, considerations, and thought processes throughout the semester as we\ntackled the challenge our group was given.\nBRAIN/MACHINE HYBRIDS Studio 1 (02/27/2008)\nAdvisors (20.902/20.947)\nKate Broadbent, Han Zhu, Sophia Roosth\n20.020 Students\nAnonymous student JE\nCharlotte Yang\nAlex Rodriguez\nAngela Chang\nIntroductions\nAngela chose this project because it seemed like a good intersection between Courses 6, 9, 20;\nbackground in Course 6\nCharlotte Project Seastar, Course 9 > 20\nAlex interested in neuroengineering, tagging neurons, current UROP work (Ed Boyden), resources\nJE interested in neurology, psychology, changed from studying epilepsy to cancer studies\n\nWhat is the importance of brain/machine hybrids?\nAllows for greater control (eg. surgery)\nHelps people with disabilities (eg. prosthetics)\nApplications help extend functionality, go places where you normally can't or do things you can't\nnormally do\nCognition/Information processing\nWhat exactly defines a machine and what counts as biological tissue? Scaffolding? Radioelectronics?\nGenetic encoding?\nCan they contain biological material?\nDoes genetic engineering count?\nAre engineered biological systems machines or not?\nPhilosophy: Dualism\nLiving is a combination of the physical and the spiritual\nDrew says that there has to be a piece of genetic engineering in it, because we're engineering\nbiology\nSolution isn't just an external stimulus\nCells receive stimulus automatically\nWhat do we mean by \"interface\" between biology and the mechanics?\nDifference between bacterial computing and brain/machine hybrids\nBiological computing is trying to recreate the computer in a biological way to perform machine\nprocesses\nWe are trying to accept/send signals to and from the brain and translate them into electrical\nsignals to perform tasks\nWhich way are we going with this topic?\nSynthetic biology? (viruses, cells, bacteria)\nProsthetics?\nTechnology? (eg. brain imaging)\nNeurons? Reading input, stimulate neurons for a response\nMethods of delivery? Problems: resistance\nWe need to know more about neurons/connections\nBlood/brain barrier\nThen what about encephalitis? Meningitis? Bacteria can cross the barrier\nCreate some sort of control over a system and being able to deliver stimuli\nBrain also affects hormones (how much is known about this?) Target pituitary/hypothalamus?\nEngineer a bacteria that can take up and release neurotransmitters (NT)\nExperiments have shown neurons to accept certain types of light and respond differently\nMain challenge: converting neural signals into electrical signals\nMake this as minimally intrusive as possible\nDistinct approaches:\n1. Reading brain signals and translating them to control technological devices\nExample: prosthetic limb that accepts brain signals and translates them to motion.\nCould incorporate living tissue (tissue engineering?)\nIssues: too Course 6? Too wide a scope for our topic and abilities?\n2. Engineering biological elements to alter/fix/enhance brain function\nExample: A bacteria or engineered cell that could replace radiation chemotheraphy by\ntargeting certain areas or stimuli in the brain\nIssues: not truly or uniquely a brainmachine interaction; the use of engineered biology to\naffect the brain, but how is this a hybrid of brain/machine?\nGrafted neurons/rewiring the human body (for prosthetics, movement and sensory) should these be\nartificial or grafted?\nWhat purpose is there for reading neural signals over a lifetime? Is there any? Because genetically\nengineered [cells, etc] would have to remain in the brain/body/genetic code for the rest of your life. Just\napplying it to brain imaging and research doesn't seem to be worth the genetic/biological alteration.\n\nThree Ideas Presentation\nNeeds to be pretty detailed\nEssentially pitching three ideas: to ourselves and the class\nMust be interesting and realistic\nWe're basically asking for resources and feedback so that we can just run with one idea\nChoose a positive decision vs. just falling into one (should feel confident about your idea!)\nSuggestions\nCheck the new Facebook group for discussions, communication of ideas:\nhttp://mit.facebook.com/group.php?gid=22104395636\nLook at iGEM videos/look up research to see where the world is at this point/how much has been done;\nwe want to start at the right place\nFor next time, bring in 35 concrete ideas/topics/areas of research that interest you\nWhat do you think the impact would be?\nWhat form can the solution possibly take?\nHow plausible is this idea given the technology we have today? It's okay to not know, but we\nhave to ask.\nVery little is known about how neural networks actually work right now\nContacts MIT\nEd Boyden\nKarl Deisseroth\nBRAIN/MACHINE HYBRIDS Class (03/04/2008)\nProsthetic limbs/muscle implants\nBrain imaging - more specific application?\nArtificial neurons\nVisual neuroprosthetics\nWhy would we want to grow things in our brains?\nInsert something into our genome that would kick in if anything catastrophic happened (like a stroke)\nBut machine?\nReads and analyzes hormone activity in the brain? Kicks in if we need anything supplementary? But this\nwould change the human being species...\nBrain pacemakers for depression, epilepsy, Parkinson's, neural disorders etc\nHelp people whose brains have degraded\nInsert a simple logical circuit (biological hardware)\nMotor strip\nUse existing technology, like simple on/off switch\nFocus on neurons in a specific area (such as motor strip)\nBRAIN/MACHINE HYBRIDS Studio 2 (03/05/2008)\nNeuroscience: Converting Thoughts into Action\nhttp://www.nature.com/nature/journal/v442/n7099/full/442141a.html\n[individual research]\n\nTeam Log 03/13/08\nPresent: Angela, Charlotte, Alex\n> DREW/NATALIE FEEDBACK:\nAll of our projects are about getting info in/out of neural system\nLooking at EM/RF (RF = Radio frequency)\nReal projects: want a generic input/output device\nUsing magnetic fields, whatever that can pick up and send\nGo meta there are myriad applications\nBut make a generic device\nFast time scale\nInput/output\nHone down on the practical details of implemention!\nDon't get too bogged down in one application\nDon't forget about the real technical difficulties of implementation\n> DISCUSSION\nMetasolution\nIt's easier to read the brain than communicate to the brain\nIdea #3oriented approach\nRead NT levels? If we can figure out where NTs are being sent, we can do something about it...\npractically anything.\nHow about not reading to an external device... keep it internal.\nOR how about engineering a purely external device and not have to worry about touching the brain?\nTag NTs with radioactive or fluorescent markers. Can we read these somehow?\nGlia notneurons that we can use?\nTimescales\nMagnetotactic bacteria\nToo slow\nToo much noise\nCan we modify them?\nYeast cells?\nRadiofrequency would be hard to detect. How would that work?\nEveryone should do a little reading on neuroscience... it may help.\nBrain/Machine Hybrids Brainstorming with Mom 03/17/2008\nAngela\nNOTE: My mother is kind of ridiculous. There are wild brainstorms in these notes that are not meant to\n\nbe taken seriously! However, she did teach me a lot about neuron signaling and the anatomy of the\nnervous system.\nBlind kid can navigate by echolocation\nSound waves, machine will have vibrations. If vibrations and sound waves match up, communicate with\nthe brain.\nVoice control comes from the brain\nPre/post synapse at cleft between nerve terminals\nIntercept with presynapse\nProduce a postsynapse wave\nMachine to read wavelength\nCan't possibly plant millions of bacteria at each nerve terminals/heads.\nHow do psychics read brain waves?\nDeal with peripheral nerves/spinal cord instead?\nThere's no central connection location between the brain/spinal cord/rest of the body. The brain is like a\nnetwork of highways.\nPupils dilate/shrink\nRead pupil size\n> too machinelike\nGlia cells are support structures... but too many glia is bad! Creates glioblastoma, stage 4 astrocystoma\nBrain becomes like a thicket, loses elasticity, plasticity. Skull is very rigid so there's not as much space\nto work with, but the brain itself is very elastic. So we can't plant too many of our own things!\nThe more folds (gyrus) there are, the smarter (human vs. apes, etc).\nHearing/Speech patients. Can we narrow focus?\nHeat bacteria/cells be able to detect the difference and transmit that information\nCentral, peripheral, autonomic nerve systems\nAutonomic system (involuntary):\nSympathetic fight and flight (e.g. pupils constricting, involuntary urination)\nParasympathetic relaxation (e.g. heat)\nReflexes: not totally controlled by the brain; controlled by spinal cord.\nAutomatically, one synapse, in order not to hurt yourself.\nAlphamotorneuron > gammamotorneuron\nIf not sharp stimulus, there's time to go to the brain (e.g. hot/cold)\nDifferent stimuli transmit to different parts of the spinal cord ascending to the brain (e.g. hot/cold travels\nthe spinalthalamic track), then the brain sends a descending signal down one cortical spinal track\nNerves have branches, filaments, branch out.\nActual impulses... are they electrical or chemical? Neurotransmitters are chemical compounds... but are\nelectrolytes electrical or chemical? Brain impulses are not necessarily neurotransmitters.\n\n\"You know what, why don't you just clone a creature?\"\nPET machine\nLike regular MRI, but inject a dye into your blood vessels, it goes to the brain, make the person think\nabout something, or rehearse a mental exercise, and observe brain colors... some kind of biological dye\nwith a trace/something magnetic/fluorescent/something SMALL but that you can see.\nFades away in time.\nWhat about creating neural impulses?\nAlzheimer's forgetting things, create neural impulses to help. Stimulate neurons, create neural\nnetworks, bridges over gaps.\nParkinson's movement initiation; can't walk immediately, can't stop immediately\nAphasia (can't speak, stroke patients) create a palmsized brain that's mapped to a specific person's brain\nor thinking, use communication tools (eyes, etc) transmit impulses, or touch to some part of the body,\ntransmit the impulse, and do something with it\nBRAINMACHINE HYBRIDS: Studio Log (in images)\nOverview of issues still needing to be resolved (and possible solutions)\n\nHow electrodes plug into the brain\nNeurotransmitters\n\nDiagram of the brain/nervous system\nHow we would handle ion channels\n\nStill unsure of how we would handle voltagegated channels\nIndividual Research: Physiology (ion channels, biochemistry, neurophysiology), Basic\nNeuroanatomy\nAngela\nPhysiology\nSensory systems pg. 32\nDifferent receptors (e.g. light, touch) receive different types of signals... this is the beginning of\nhow they are differentiated\nPgs. 3435: transmission of and how sensory receptors are consciously perceived\nEndocrine Physiology pg. 211\nHormone concentrations can be measured by radioimmunoassay (radioactively labeled vs.\nunlabeled hormone concentration)\nRegulation of hormone secretion pg. 213\nNegative feedback is most common\nDevelop something that creates negative feedback when too much of\nsomething undesired is created?\nNeuroanatomy\nChapter 22: Neurotransmitters and Pathways pg. 275\nThe Human Brain\nChapter 6: Sensory Receptors\n\"The basic task of a receptor is to monitor some aspect of its environment by converting and\namplifying part of the stimulus energy into an electrical signal that is meaningful to the nervous\nsystem.\"\n\nThe brain knows what happens to the body because specialized receptors do all the measuring and\nconverting of information and converts it to electrical signals that it can understand. We can't really\noptimize this intermediary process any further. There's no real need to measure it, because the\nintermediary steps are just a means to the end. Measuring them doesn't really provide a \"snapshot\" of\nthe final effect or response, because sometimes many signals act on the same synapse, for example, or\nsignals travel down different pathways that are hard to predict and vary widely. What we can control are\nthe external stimuli. Machines can do this. However, we have to make sure that we are not just\n\"stimulating the body and watching what happens\". We can also try to intercept signals that are being\ntransmitted with our own. The problem is how to determine which signals to intercept, because since all\nsignals have a specialized purpose, there's not really such thing as a \"bad\" signal.\nBrain/Machine Hybrids Notes 04/01/2008\nVoltage Sensors\nFlaSh protein is extremely competitive\nCan already measure electric potentials of each neuron\nSpecific enough to bind to each one\nHow FlaSh protein works\nTakes Ca2+ concentrations\nChange in potential is measured\nRead out by GFP\nEmits flash through gates\n(See Facebook for link: second Research discussion)\n(Discussion: Ion flux, how signals are transmitted)\nFlaSh is directly injected in vitro, and it works (right now with K+)\nDon't want to just use FlaSh because we need some sort of innovation\nBetter way to inject FlaSh?\nVector?\nTaking from phage therapy... virus? Viruses in the brain?\nThe necessity of having something in the brain?\nSignals are sent from sensory neurons to brain and brain sends signals to motor neurons.\nWe may only need the \"downwardtraveling\" signals. Kind of how prosthetics work, except we\ncan read specific signals at the connecting nodes. Wouldn't have to worry about taking\nmeasurements in the brain.\nTimescale of Na+: 2 ms\nSo: we're going to use some sort of variation of FlaSh\nFaster\nInput > Output device\nIon concentrations > DEVICE > Fluorescence\nIon:\n(Try not to use Na+ or K+)\nNa+ is pretty fast, but not very accurate (because they'll open even if nothing's fired)\nK+ is slower, but more accurate\n\nDevice:\nInclude amplification?\nHow much stronger does it need to be?\nWe're focusing a lot on input right now. Remember that we need the device.\nSimpler may be better\nThere may be proteins that we can use/that do what we want\nWe can make combinations/chimeric proteins\nTo keep it simple, amplification may not be necessary\nBrain/Machine Hybrids 04/02/2008\nWant to use fluorescence, chromophores\nBioluminescence\nTwo luminescence components on the receptor\nWhen brought close together, will luminesce\nFor our project:\nLet a receptor have a half of the component\nCreate a ligand that has the other half\ne.g. dopamine (a stronger binder) is released, and there would be no more fluorescence\nMeasure negative change in fluorescence\nWould help differentiating between different kinds of neurons\nEach releases a different NT (e.g. acetylcholine)\n(FlaSh can change the protein/color)\nOn the other hand, if we choose to focus on a specific kind of neuron (sensory or motor), we won't have\nthe differentiation problem\nWhich ion to use? Ca2+ is probably the best choice... but look at Chameleon, has it already been done?\nFRET (fluorescence resonance energy transfer)\nFiguring out how FlaSh works, exactly\n>>> bioluminescent FlaSh!\nTarget specific neurons by finding promoter sequence\n\nImages from this studio:\nOverview of bioluminescence and a split luciferase/luciferin system\nSplit luciferase/luciferin system with asyetunknown ion channel\n\nOverview of FRET and fluorescencebased voltagegated ion channel sensors\nBeginnings of a general diagram/system overview\n\nTech Spec Review Expectations\nBe sure to briefly reintroduce everyone. You can start with your team/project name(s) and the project\nidea (i.e. what you'll be addressing and, very roughly speaking, how). Then you can spend the\nbulk of your time getting down to the brass tacks.\nEach project idea must have\n* A description of your system's design in terms of devices\nBioluminescent FlaSh variant\nInput:\nvoltage/ion channels on FlaSh variant\nDevice 1: Ion channel detector\nDevice 2: Bioluminescence\nOutput: Biolumnescence\nRhodopsintreated bacteria? (necessary?)\nDevice 3:\nCCD camera\n* A description of your system's design in terms of parts\nHow is FlaSh made?\nPatented in Berkeley\nParts list for bioluminscence\n* A timing diagram to show anticipated system operation\n* A plan for testing and debugging your first generation system\nIn vitro:\nDump in something with an ion gradient. It should light up and be detected by the camera.\nTest over time? Different temperatures?\nDebugging:\n* A description of the impact you envision for your system\n* A description of any concerns raised and open issues within your team\n* A \"GO/NO GO\" decision\nThe format for this technical specification is likely to be powerpoint but other platforms for describing the\nwork may also be approved. Each person in your group should plan to speak for some of the\ntime.\n\nBrain/Machine Hybrids Studio Log 04/03/2008\nDiscussion: Whether to stay with K+ or switch to Ca2+\nProbably going to stay with K+\nFlaSh is just GFP attached to a Shaker K+ ion channel\nWe can just attach a luciferase to the ion channel and create our own version.\nWhere to find the sequence?\nLuciferase + Luciferin glows\nWe can attach one to each side, when they come together, they glow.\nBioluminescence is easier to image in vivo\nNothing in the body produces visible light, so there won't be noise\nBioluminescence:\nhttp://www.diagnosticimaging.com/molecularimagingoutlook/2004jun/03.jhtml\nhttp://www.diagnosticimaging.com/molecularimagingoutlook/2005mar/02.jhtml\nCan change colors (e.g. for motor or sensory neurons) but probably doesn't quite work the same way for\nbioluminescence.\nCa2+ concentrations are assigned musical notes and creates MIDI files\nAnother variation on our project\nWorks with EEG (electroencephalography)?\nWe probably don't know enough about this to go with it...\nBegan powerpoint of Tech Spec Review\nBrainMachine Hybrids - Studio Log 04/08/2008\nGetting ready for the Tech Spec Review in images:\nDetailed diagram of split Renilla luciferase attached to ion channel; beginning of a plasmid sequence\n\nWorking out the timing diagram\nPropagation of an action potential; voltagesensor relationship\n\nBrainMachine Hybrids Studio Log 04/16/2008\nApplications:\nCan we pick one of the original three ideas presentation ideas?\nNeurotransmitters seems most accessible... neurodisorders are pretty straightforward... imbalance of NTs\nAlign with purposes of current research.. imaging?\nSpecificity?\nCoE from small sea creatures\nLarger creatures get CoE from small shrimps, etc. that they eat\nEven if we just do imaging, it hasn't been done with bioluminescence before and we'd also be introducing\nspecificity.\nBrain/Machine Hybrids Studio Log 04/17/2008\nContinued research/individual reading and posting articles to Facebook to share.\nSolution!: CCD Camera\nSignals are electrical signals that can be interpreted by any video or imaging device\nTutorial posted on Facebook\nSolution!: Synthesizing CTZ\nA process has been patented that uses a geneencoded peptide\nLink posted on Facebook\nOpen questions:\nLentivirus gene delivery\nOver the long weekend, everyone should familiarize themselves with the articles on the Facebook group.\nNext week, begin work on testing/debugging and DNA sequences\nAfter incubation with CTZ for 1 h, luminescence signals were clearly observed inside cells (Fig. 2D) and\ncontinued after removing CTZ from the cultured medium. The luminescence image of cells might be\nexplained by continuous replenishment of CTZ remaining in intracellular organelles. These observations\nsuggest that CTZ is imported into the membrane traffic network for protein secretion and the\nluminescence image shows the lumen of secretory organelles in this network.\nBrainMachine Hybrids Studio Log 04/23/2008\nNOTE: The individual assignments have changed since these notes were taken!\nTechnical Documentation\nYou will need TWO hard copies of these documents to turn in. You must also upload a copy to the class\nStellar site here These technical documents must inclue:\n1. A narrative that is ~12 pages long that includes > or = a paragraph for each of the following:\n* the problem, challenge, or opportunity your project has addressed\n* the existing or developing alternative technologies that address this problem, challenge or\nopportunity\n\n* a system description\n* a description of the impact your solution will have if implemented\n* a safety/security analysis\n* a plan of work for the first 6 months for 6 people working full time on this project\n2. A Devicelevel system diagram\n3. A Timing Diagram\n4. A Parts list (table)\n5. A paragraph description of your spotlighted Part and where to find it in the Registry of Standard\nBiological Parts\n6. The DNA sequence for your key new part or device\n7. A test/debug plan for that part and for your system or key intermediate device\nThese technical documents are worth 20% of your team's final grade and must be turned in at the time of\nyour final presentation. You should also turn in your project design notebook if you have not been keeping\nan online version.\nFinal Presentation\nYou will have 20 minutes to present your project and there will be time for 10 minutes of questions. You\nare expected to follow all the best practices you've learned for oral presentation planning and delivery.\nThis oral presentation is worth 10% of your team's final grade.\nALL:\n1. Narrative\n* Problem\nJE\n* Alternative technologies\nAlex\n* System description\nAngela\n* Impact\nCharlotte\n* Safety/security analysis\nAlex\nlentivirus\nbioluminescence forever?\nCCD camera\n* 6month plan of work\nAll\nAdd CoE and lentivirus to system diagrams (Angela has files):\n2. Devicelevel system diagram (minor modification)\n3. Timing Diagram (minor modification)\n4. Parts list (table)\n5. Paragraph desc. of Part (Shaker K channel)\nCharlotte\n6. DNA sequence\nCharlotte\nShaker protein\nRluciferase (2 parts)\nCoE peptide (patented)\nPlasmid/restriction enzymes (lentivirus)\n7. Test/debug plan\nJE\n8. Project Design Notebook\nAngela\nCalendar\nRR = Reading Room\nM 4/28 36 RR Group mtg for parts 14\nW 4/30 in class Meeting with Ed Boyden\nSun 5/4 36 RR Final group mtg for presentation and polishing\nRead up on Facebook articles: Patented CoE peptide\nCheck GoogleDocs\n\nBrain/Machine Hybrids Studio Log 04/28/2008\nCharlotte, JE, Alex, Angela\nWhat is our general overview?\nVia lentivirus vector, introduce new DNA sequence to neurons (later on, target to a specific type. For\nright now, we can target neurons and add specificity in a later project. Neurons code for preCoE + BlaSh.\nPreCoE converts to CoE [spontaneously?] When repolarization occurs, [K+] change is detected by\nShaker channel. This causes luciferases to come together and bioluminesce. Bioluminescence is picked\nup by external CCD camera.\nUnknowns\nSpecific neuron types: how to determine/localize? Will lentiviruses be able to do this?\nWhat processes are involved in transforming neuron with lentivirus DNA?\nHow does preCoE become CoE?\nAdd to timing diagram (?)\nHow long it will take lentivirus to reach neuron? (determined experimentally?)\nHow long will it take to produce initial sufficient concentration of preCoE?\nHow long will the reaction from preCoE to CoE take?\nAnswers to questions\nWorking with lowtomedium copy number plasmid (experimentally determine ideal copy number)\nWill create new protein channels along with normal functioning ones. Because of low copy number, will\nhopefully not inhibit natural neuron function.\nMax gene expression occurs within 26 weeks\nSafety\nThere is no immune response to lentiviruses\nHIV/retroviruses can be rendered replicationincompetent (doesn't transfer viral genes, just our desired\ngene)\nK channels remain separate from existing ones\nSlides to add\nHow a lentivirus works (ties into safety); its role as a host of our vector\nHow luciferase is split\nCCD camera: we can convert any output to any other form of output\nTesting/Debugging\nTEST: Luciferase/CoE binding (in vitro)\nInject CoE to location of modified Shaker channel, introduce K+ ions and see if bioluminescence\nchanges.\nPass:\nNegative bioluminescence change detected\nFail:\nNo change\nTEST: Whether Shaker channel (BlaSh) works in neuron (in vitro)\nAllow our BlaSh and CoE to be expressed in a neuron in vitro. Stimulate with voltage see if\nbioluminescence changes.\nPass:\nNegative bioluminescence change detected\nFail:\nNo change\nTEST: Does our device REALLY work? (in vivo)\nIntroduce our gene to plasmid and insert to lentivirus. Allow to transform neuron genome in vivo and\nsee if bioluminescence changes over time (as correlated to voltage detectors/brain images?)\n\nTODO:\nDocumentation is on GoogleDocs! Update it! Make changes in color and the original person can\napprove them by making them black again.\nEveryone just keep reading and working.\nFinish Parts table (begun in MS Excel today)\nBrain/Machine Hybrids Studio Log 04/30/2008\nVisit from Ed Boyden\nHow does preCoE become CoE?\nHappens in the presence of oxygen\nPlasmid can be ordered online within the ATCC\nEd Boyden\nFind papers that talk about preCoE peptide, not just patent\nPatents talk mostly about what is possible, not what has been done\nPatents cite other patents\nHow do you know this is going to be fast enough? Think about Kinetics\nFlaSh lags a little\nThis will probably lag more\nSustained/amplified signal\nNeed to worry about saturation\nProblem is plateau, will never go any higher\nLook at molecules similar to this one\n19962007 FRET ?\nDon't need to completely unfold protein to stop bioluminescence, just need to tweak\nModel with proteins of similar size and sanity test to see if we're totally off or not\nNeuron will fire 300400 times a second, while FlaSh takes a few seconds to plateau\nCome up with a plan to make it faster\nDo less FRET\n2 molecules have to change orientation w.r.t. each other\nFigure out how to take a small amount of energy and warp it\nBioluminescence is a chemical property; requires molecules to move, which is why it takes longer than\nfluorescence\nKINETICS:\nHow do we know the thing can actually warp at all?\nHow do we make it a useful sensor?\nFireflies blink on/off at Hz\nCheck latency to turn off\nMany different substrates\nLuciferin/aequorin relationship\nIf the time scale is slower than we make it, we could just use existing sensors. What applications would\nthere be?\nYou want better than 20 ms resolution\nDon't want a plateau after a few ms and hit a plateau\nLook up Friedrich, Liam Paninski\nCould come up with a screening for drugs\nDon't need real time\nNeurons are not dividing cells\ne.g. don't get cancers from neurons\nCould probably put a lentivirus and get away with it\nMight inject 10^10 viruses and hit an oncogene\nAAV (adenoassociated) viruses can't hold as many 3kb (~700aa, 2100 bases), but is safer\n5 - 10 years down the road, it might be possible\n\nVery difficult to do in real life\nJust hangs out in the nucleus\nGene gun, blast gold particles with a little gold gun\nDozens of other methods, but stick with viruses\nBind luciferase to most delicate helix\nWhen it gets tweaked, just move a helix, don't completely split\nIf split, you may have long dark periods\nNeed to worry about whether it will recombine or work after recombining\nRecommends using just one molecule\nNeuron targeting\nDNA regulator\nPut into cells that can only activate that specific promoter\nChromosome 19 is a safe part to land on\nFind out what makes it target?\nAAV doesn't go to chr19 in mice b/c they don't have it\nProblem: how to you make sure it doesn't go to other places?\nAdenovirus is even bigger and more toxic than the other two\nNot many more great options\nChannels are huge\nMay not be able to fit into AAV\nLook up CiVSP\nNot a channel; a voltagesensing something else\n\"Optics is a whole other ball of wax\"\nBest way is to assume that microscopes work\nFind vendor that sells microscopes that use CCD cameras\nLook at specs, sample pictures\nDo a sanity check with kinetics\nIf we're concerned with not seeing, then:\nDo tests, you may be fine\nIncrease number of molecules\nMaybe you can't see single cells, but you can see clumps of cells\nDo calculations\nCan illumination of X cells be seen Y cm away from the brain\nIf it doesn't work out, can still find a new way to image/drug screening, etc.\nSanity check of the resolution\n1 Check patents\n2 Consider kinetics\n3 Don't worry about viruses\n4 Look at systems, check out some real pictures\nAlex's Ed Notes\nLook up latency times for bioluminescence.\nCan it warp, and what is the latency for it?\nSignals:\nfriederick germany\npaninski columbia\n<20 ms to be useful.\nAAV |Adenone associated virus| 3 kb after promoter.\n\nGene gun.\ncellspecific promoters\nCIVFP\nBioluminescence resolution of cells through the brain and skull.\nNew Drug Screening platform if original idea fails.\npatent\nkinetics\nNOT VIRUSES\nphoton emission\nPostInterview Notes\nTime of gene expression from injection of virus to expression is ~ 2 weeks\nUse GFP kinetics data\nIf we use a tweaked luciferase, we'd be looking for a flash of light rather than loss of light\nCan save substrate that way\nMore intuitive\nTo find which area to tweak, screen\nLook at crystal structure (Xray crystallography)\nGFP was tested with screening\nCiVSP\nJust the voltagesensing section of a voltagegated channel\nSignificantly smaller\nWould make it more likely to fit into an AAV\nCiVSP (Ciona voltagesensor containing phosphatase) link:\nhttp://www.ionchannels.org/showabstract.php?pmid=17615106\nLiam Paninski, Columbia University\nResearch on statistics of neuroresponse; probabilities, tracking, regression, etc.\nRead Tuning FlaSh\nNOTE: Notes from 04/30/2008 were the last formal notes taken. Meetings afterwards involved everyone\nin preparing the final presentation.\n\nRemaining images from final few meeting days:\nBeginning to work out kinetics\nOrdering of actions during bioluminescence for kinetics analysis\n\nFinal kinetics overview\n\nFinal system overview\nEND OF PROJECT LOG\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.020 Introduction to Biological Engineering Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT20_020S09_prj10_neuro_sp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-020-introduction-to-biological-engineering-design-spring-2009/cbd38ec0cfb740e13914e16df5497bc3_MIT20_020S09_prj10_neuro_sp.pdf",
      "content": "Immunoliposome directed drug delivery\n\nAlzheimer's lowers quality of life\nImportance of memory\nLonger life (Alzheimer's is ultimately fatal)\nAn estimated 26.6 million people 65 years\nand older had Alzheimer's worldwide in 2006\n\n- Strong correlation\nbetween\nAlzheimer's and\nbeta-amyloid\nplaques\n- Causes neural\ndegeneration\n- Beta amyloid\nprotein vs. beta\npleated sheets\nImage removed due to\ncopyright restrictions.\n\ncomponent of\nAlzheimer's\n* Beta-amyloid protein\nReduce neural damage\n* By inhibiting the\nformation of plaques\nDiagram showing how plaque growth damages dendrite and axon.\nFigure by MIT OpenCourseWare.\n\nA polyphenol with many antioxidant\nproperties found in many plants\n- Binds to BA\nprecursor protein,\nprevents it from\ntaking final shape\nwith its potent iron\nchelating abilities\n\nGoes to\nbrain\nImmunoliposomes\nAttaches to BA\nprecursor protein\nReleases\nEGCG\n\nBeta-Amyloid\nPrecursor Protein\nLiposome\nAntibody\nBacteria (E. coli)\nEGCG\nBeta-\nAmyloid\nBinding\nSite\n\nInput\nOutput\nY\nY\nY\nModified antibodies\ndetect beta‐amyloid\nplaques\nImmunoliposomes\ncontaining EGCG\nFeedback system:\nbased on\nconcentration of\nplaques\n\nDrug Delivery Device\n-Immunoliposome\nInput\nOutput\nBeta-amyloid Detector\n-Receptor sequence on antibody\nTrigger\nInput\nOutput\n-Release of EGCG\nStop/Feedback Mechanism\n-Large amount of EGCG inhibits production of EGCG\nInput\nOutput\nB-A\nProtein\nB-A\nDetector\nBinding\nB-A\nBinding\nTrigger\nRelease\nEGCG\nExcess\nEGCG\nNegative\nFeedback\nInhibition\n\nDDD\nBAPD\nTrigger\nImmunoliposomes go to brain\nReaches beta‐amyloid protein\nReleases EGCG\n(Immunoliposome)\n Detection\nLiposome\nModified\nAntibody\nI\nEGCG\nDrug Delivery Device \nBeta‐amyloid Protein\nReleases EGCG\nImmunoliposomes\nFeedback\nEGCG inhibits production\nof more\nFeedback\n\nImmunoliposomes go to brain\nReaches beta‐amyloid protein\nReleases EGCG\nExcess of EGCG\nDrug Delivery Device\n\nPARTS\nLiposome\nDSPE-PEG\nMonoclonal Antibody\nOX26\nRadioligands\nBeta-Amyloid Sensor\nE. Coli Promoter\nPEC3876\nEGCG gene\nEGCG Inhibitor Enzyme\nTranscription Terminators\n\nPEC3876\nEGCG\nEGCG\ninhibitor\nPEC3876\nPEC3876\nLiposome\nAntibody\nDSPE‐\nPEG\nOX26\nBA\nprecursor\nsensor\nRadio‐\nligand\nPEC3876\nEGCG\nTXN\nTerm.\nTXN\nTerm.\nTXN\nTerm.\n\n= Promoter\n= RBS\n= ORF\n= Terminator\nE. Coli Cell\nEGCG\nGene\nIn excess concentrations of EGCG,\nEGCG\nEGCG binds to inhibitor which binds to the\nInhibitor\npromoter site to prevent the production of\nmore EGCG.\n\nClinical trials with mice with Alzheimer's\nNeed to determine:\n1. Amount of EGCG needed\n2. Side effects of excess EGCG\nTest that:\n1. Liposome binds to antibody\n2. Insertion of bacteria\n3.Immunoliposome attaches to BA proteins\n4. EGCG is released\n\n1.\n3.\n4.\n2.\n\nImage brain for beta-amyloid plaques\n* If plaques have not formed\nOverall system has the desired effect\n* If plaques have formed\nOverall system is not working\nCheck individual parts of the system for problems\n\nTest in vitro\n* Chromatography\nSeparates liposomes, antibodies, and bonded antibody-\nliposomes\nBonded immunoliposomes heaviest\nSelect for attached antibody-liposomes\n\nTest in vitro\n* Set-up: Known amount of bacteria into solution with\nimmunoliposome\n* Chromatography:\nImmunoliposomes with bacteria will be heavier and\ntravel a shorter distance than immunoliposomes\nwithout bacteria\n\nIsolate BA precursor protein from brain\nIntroduce known amount of immunoliposomes\nin culture\nDetermine change in immunoliposome levels\n\"Radioligands\" - probe that can pass through\nblood-brain barrier and detect/label plaques,\nwhich can then be imaged\n\nPlace immunoliposomes with EGCG-containing\nbacteria in solution with beta-amyloid\nprecursor protein\nIf all previous steps work\n* Concentration of EGCG in solution should increase\nwhen beta-amyloid protein introduced\n* If concentration of EGCG does not increase check\ntrigger device\n\nPros\n-Immunoliposome gets past the\nblood-brain barrier\n-Efficient/Concentrated Drug\nDelivery\n-Beta-amyloid Specific Targeting\n-Feedback based on\nconcentration of EGCG\nCons\n-Bacteria in the brain\n-Does not address all causes\nof Alzheimer's\n-May need large quantities of\nEGCG to be effective\n-Hard to test in vitro\nMay cure\ndisease but\nhave side\neffects\n\nDSPE-PEG 2000 in Chlorophyll Solution ( C )\n25mg => $195\nE. coli promoter (PEC3876) => $80\nRadioligands => $150\nAntibodies (OX26) => $3,900\nEstimated Cost: ~$5000\n\nMain difficulty: moving substances into brain\npast blood-brain barrier (BBB)\nCurrent methods:\n* direct injection into brain\n* surgical implantation/catheters\n* All invasive, dangerous, and have limited\neffectiveness\n\nCompetition - several current techniques in\ndevelopment:\n* drugs to temporarily open BBB\n* attachment to nanoparticles\n* Ultrasound\nUnknowns:\n* Side effects of excess EGCG\n* The base cause of Alzheimer's\n\nhttp://pt.wkhealth.com/pt/re/jneu/abstract.00005064\n00020.htm;jsessionid=Jb9H6hf38zQcBBjl2qyypqWpbT0JXnPx\nwlWM8CpKQWL8zHLnh1ST!\n1694466489!181195629!8091!-1\nhttp://www.nature.com/nsmb/journal/v15/n6/full/nsmb.143\n7.html\nhttp://books.google.com/books?id=Lh5r0WYYQBQC&pg=PA2\n90&lpg=PA290&dq=attaching+the+lipid+and+antibody&sourc\ne=bl&ots=E45VfQ5sEg&sig=vsvjEbnOHM0jiyH0slsV4k7FWaA\n&hl=en&ei=l\nXUSZCFAqLmlQfp15XdDA&sa=X&oi=book_result&ct=result&r\nesnum=10#PPA294,M1\nhttp://cat.inist.fr/?aModele=afficheN&cpsidt=942563\nhttp://www.pnas.org/content/97/13/7609.full?ck=nck\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.020 Introduction to Biological Engineering Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT20_020S09_prj11_neuro_td.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-020-introduction-to-biological-engineering-design-spring-2009/390dda4d72444e24c8325b3657a5aa2c_MIT20_020S09_prj11_neuro_td.pdf",
      "content": "20.020 Spring 2009\nTeam: Sleep-away\nFinal Report\nNarrative\nProblem: Sleeping\n\nThe problem we are addressing is sleep. On its face, sleep seems like such a waste of\ntime: why do people need to spend a third of their day (much less here at MIT) being\nunproductive? Life would be so much better - and more practical - if our time was spent\nPSetting or studying rather than lying in bed. (5000 undergrads x 6 hrs/day x 350 days/yr =\napproximately 10 million undergrad-hours/yr... we could have cured cancer by now or\nsomething!)\n\nBecause much is still unknown about sleep - including the fundamentals of its\nfunction/purpose - trying to \"cure\" sleep would be a little overambitious. We decided to start by\ntackling a smaller problem: temporarily extending the time which people could stay awake.\n\nOf course, there already exist solutions to this problem - stimulant drugs such as\nModinafil and caffeine. Caffeine, for example, has been proven effective in live trials every day\n(and probably is the only reason half the class isn't passed out during the presentation); it is also\ncheap and easily obtainable. However, one problem with caffeine is the body's development of a\ntolerance for the drug: because it works by blocking adenosine receptors, the body responds by\nincreasing the number receptors in the central nervous system so that increasing doses of the\ndrug are needed. This increase also causes withdrawal symptoms from caffeine.\n\nOur proposed system will work in similar ways to caffeine - by manipulating the\nadenosine-receptor system in the brain. Instead of blocking the receptors with a foreign molecule,\nhowever, we will focus on preventing adenosine from reaching the receptors in the first place.\n\nAdenosine is produced in the brain when cells burn ATP to produce energy. Adenosine is\na byproduct of the reaction; it builds up inside the cell until the concentration gradient is enough\nfor the cell to pump it out. It then attaches to receptors on the outside of the cell, which then\ninhibit the production of stimulants and induces tiredness. When the brain is resting, the\nadenosine is gradually broken down into inosine by enzymes.\nOur system consists of an immunoliposome - which can pass through the blood-brain barrier and\ndeliver the system into the brain - enclosing a group of adenosine receptors and adenosine\ndeamilase, the enzyme which breaks down adenosine. Once inside the brain, the\nimmunoliposome releases its contents, and the receptors sequester the adenosine outside the cell\nbefore it attaches to the real receptors on the cell. The enzyme then breaks down the adenosine so\nthe receptors can capture more molecules.\n\nEventually, we expect the levels of adenosine production in brain cells to overtake the rate at\nwhich our system can capture it, either through degradation of our parts or pure stoichiometry.\nThus, our system will serve more as an adenosine buffer, delaying the rate at which the brain\nbecomes tired (like a spare tank of gas). If this system is successful, we can further develop it\ninto a long-term solution for sleepiness.\nThe initial impact of this project might be limited - this system is essentially a replacement for\ncaffeine, which serves its purpose effectively. Although it does not have the side effects of\ncaffeine, its relative cost and complexity would hinder its practicality as a replacement. As\nlonger-term systems are developed, however, its potential impact is huge (as shown by the ten\nmillion undergrad-hours per year calculation earlier).\nThere are still many unanswered questions about the workings of our system. For example, we\nmust consider the possible side effects of continuously sequestering adenosine. The actual\nreaction of our system is safe - we are simply emulating a process which occurs naturally in the\nbrain, and caffeine is deemed safe - but sleep is more than a chemical process involving\nadenosine. Until more is known about sleep itself, we can't really determine the effects of our\nsystem on the brain without in vivo testing. In addition, we must always be cautious when\ndelivering substances into the brain, taking care to avoid contamination or other errors.\nSince the theory behind our system is fairly straightforward, our work plan will consist of\nconstructing and testing our system.\n\nTechnical Documentation\nOur device is a coding sequence for adenosine deaminase (ADA) in e. coli. This sequence\nconsists of 1002 base pairs, numbers 1724186 to 1725187 in the e. coli genome. ADA, found in\nmany organisms - including humans - is the enzyme which breaks down adenosine into inosine.\nWe are especially interested ADA for our project because adenosine plays a key role in inducing\ntiredness. By creating a system to sequester and break down adenosine inside the brain, we hope\nto disrupt the adenosine-receptor system and delay the onset of tiredness. Because of the\ndifficulty of creating proteins extracellularly and the risk of inserting foreign cells into the brain,\nwe plan to produce ADA outside the body through e. coli or other cells, and deliver them to the\nbrain via immunoliposomes.\n\nAdenosine Deaminase in e. coli (http://partsregistry.org/wiki/index.php/Part:BBa_M12000)\n1 atgattgata ccaccctgcc attaactgat atccatcgcc accttgatgg caacattcgt\n61 ccccagacca ttcttgaact tggccgccag tataatatct cgcttcctgc acaatccctg\n121 gaaacactga ttccccacgt tcaggtcatt gccaacgaac ccgatctggt gagctttctg\n181 accaaacttg actggggcgt taaagttctc gcctctcttg atgcctgtcg ccgcgtggca\n241 tttgaaaaca ttgaagatgc agcccgtcac ggcctgcact atgtcgagct gcgtttttca\n301 ccaggctaca tggcaatggc acatcagctg cctgtagcgg gtgttgtcga agcggtgatc\n361 gatggcgtac gtgaaggttg ccgcaccttt ggtgtgcagg cgaagcttat cggcattatg\n421 agccggacct tcggcgaagc cgcctgtcag caagagctgg aggccttttt agcccaccgt\n481 gaccagatta ccgcacttga tttagccggt gatgaacttg gtttcccggg aagtctgttc\n541 ctttctcact tcaaccgcgc gcgtgatgcg ggctggcata ttaccgtcca tgcaggcgaa\n601 gctgccgggc cggaaagcat ctggcaggcg attcgtgaac tgggtgcgga gcgtattgga\n661 catggcgtaa aagccattga agatcgggcg ctgatggatt ttctcgccga gcaacaaatt\n721 ggtattgaat cctgtctgac ctccaatatt cagaccagca ccgtagcaga gctggctgca\n781 catccgctga aaacgttcct tgagcatggc attcgtgcca gcattaacac tgacgatccc\n841 ggcgtacagg gagtggatat cattcacgaa tataccgttg ccgcgccagc tgctgggtta\n901 tcccgcgagc aaatccgcca ggcacagatt aatggtctgg aaatggcttt cctcagcgct\n961 gaggaaaaac gcgcactgcg agaaaaagtc gccgcgaagt aa\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.020 Introduction to Biological Engineering Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT20_020S09_prj12_neuro_td.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-020-introduction-to-biological-engineering-design-spring-2009/16915319b9cfa618bc17326ff2e3fee0_MIT20_020S09_prj12_neuro_td.pdf",
      "content": "Sleep‐away\n\nParts\nPARTS\nLiposome\nDSPE-PEG\nMonoclonal Antibody\nOX26\nAdenosine Deaminase\nAdenosine Receptor\nADORA1\nTranscription Terminators\nTL1\nPromoter\nPEC3786\nReceptor-Associated Protein of\nSynapse\nRAPSN\nWe can produce these system parts through\ngenetic modification of e. coli bacteria\n\nTime Diagram\nA\nA\nC\nB\nC\nB\nImmunoliposomes\nenter brain.\n.Receptors attach to\nextracellular adenosine\nImmunoliposome opens,\nreleases system.\nDrug Delivery\nDevice\nReceptors\nADA\nD ADA breaks down\nadenosine held in receptors\nD\n\nGeneral System Diagram\nImmunoliposomes\nImmunoliposomes\nenter brain\nReleases the\nreceptors and\nenzymes\n\nDevice Diagram\nEnzymes and\nreceptors will\ncapture and\nbreak down\nadenosine\nImmunoliposome\ncontaining the\nenzyme and\nreceptors\n\nTesting\ny Testing parts in vitro\n¬ Testing system in vivo\ny Immunoliposome\n¬ Trials with mice\n\nDrug delivery system\nattaching antibodies\n\nSide effects of system\ninserting receptors and\ncomponents\nenzyme\n\nSide effects of delaying sleep\ny Adenosine\n¬ Trials with humans\nattachment to\n\nSimilar steps\nreceptor\ny Effectiveness of ADA\n\nAdenosine Receptor/Enzyme\nTesting\ny Adenosine Receptor\ny Add determined amount\nof receptor to adenosine\nsolution\ny Use chromatography to\ndetermine efficacy of\nreceptors\n¬ Adenosine Deaminase\n¬ Create solution with known\namount of adenosine\n¬ Add ADA, measure change in\nadenosine levels\n¬ Can use methylene blue‐\nbased detector for adenosine\nCourtesy of ScienceProjectLab.com. Used with permission.\n\nImmunoliposome Testing\ny Two steps to test:\ny Attach antibodies\ny Insert receptors and enzyme\ny Can use chromatography after\neach step\ny Separates particles by mass\ny Only select immunliposomes\nwith specific mass (i.e.,\nsuccessful attachment of\nantibodies or insertion of\ncontents)\n3D Model of an Immunoliposome by Dr. R. Rezka,\nMDC, Berlin and Dr. Reto A. Schwendener\nCourtesy of Reto A. Schwendener Ph.D. Used with permission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.020 Introduction to Biological Engineering Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT20_020S09_prj16_onco_ctct.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-020-introduction-to-biological-engineering-design-spring-2009/72a79b9f97b47040b5d305f84cc601e2_MIT20_020S09_prj16_onco_ctct.pdf",
      "content": "20.020\n25 February 2009\nTeam Facebook Page/Contract\n=Team Facebook Page=\n* Team Name: oncoCURES\n* Team Members: Anonymous students MK and NM\n* Team Mentors: Anonymous student RA\n* Challenge: Medicine ‐ Cancer Treatment (Oncology)\n\nPossible Cancer Types:\n* Leukemia\n* Breast Cancer\n* Skin Cancer\n* Lung Cancer\n* Brain Tumors\n\nIdeas:\n# Enzyme Activity ‐ block off pathways common to cancerous cells\n# Virus ‐ targets cancerous cells that exhibit uncontrollable grown, mitotic divisions\n# Genetic Screening ‐ certain genes indicative of cancer, gene therapy, telomerase linked with cancerous\ngrowth\n# Thermotherapy/Deprivation ‐ denature proteins in cancer cells, cut off blood and oxygen flow, starve\nthem\n# Targeted Chemotherapy ‐ drug delivery\n\n=Team Contract=\n==Part 1: Goals==\n* What are the goals of the team?\nTeam Goals: to create an inexpensive treatment for cancer with long‐lasting impact that can substitute\ncurrent more‐damaging therapies such as chemotherapy and radiation\n\n* What are your personal goals for this assignment?\nPersonal Goals: to gain a new understanding of biology specifically relating to cancer, to develop\nproblem solving skills that relate to experimental bioengineering, to learn about the working parts that\nmake up synthetic biology systems\n\n* What kind of obstacles might you encounter in reaching your goals?\nObstacles: need a thorough and complete understanding of cancer, complications due to systems,\nefficiently processing all of the current technology and research available\n\n* What happens if all of you decide you want to get an \"A,\" but because of time constraints, one person\ndecides that a \"B\" will be acceptable?\nThe response to this is contingent on the circumstances, but because this project is team‐based and\nresults in a shared overall grade, it will be expected that each team member will do his or her assigned\nwork to support the rest of the team.\n\n* Is it acceptable for two or three team members to do more work in order to get an \"A\" ?\n\nEveryone is free to do more than their share of work if they so choose to, however, everyone is\nexpected to do his or her part (a certain minimum amount).\n\n==Part 2: Meeting Norms==\n* Do you have a preference for when meetings will be held? Did you have a preference for where they\nshould be held?\nMeetings will be held based on the listed availability. The location will be chosen for everyone's\nconvenience, but will likely be an empty classroom on campus.\n\n* How often do you think the team will need to meet outside of class? How long do you anticipate\nmeetings will be?\nMeetings will be at least once a week, and likely last for one hour as the team checks up on each other\nand looks at individual assignments and current progress.\n\n* Will it be O.K. for team members to eat/email during meetings?\nIt is perfectly fine for team members to eat and email during meetings as long as work is done and the\nteam is productive.\n\n==Part 3: Work Norms==\n* How much time per week do you anticipate it will take to make the project successful?\nWith the unit distribution, it is fair to expect each team member to do 3 hours per week. This will\nchange with coming deadlines and depending on obstacles.\n\n* How will work be distributed?\nEvenly.\n\n* How will deadlines be set?\nDeadlines will be set to match those of the class. In addition, there will be team/individual deadlines\nthat are specific to our project that will be listed elsewhere on this wiki.\n\n* How will you decide who should do which tasks?\nWork will be delegated based on interests, strengths, and time commitment, while still being divided\nevenly.\n\n* What will happen if someone does not follow through on a commitment (e.g., missing a deadline, not\nshowing up to meetings)? What will you do if one or more team members are not doing their share of\nthe work?\nThis will lead to some conferences to discuss how to deal with the problem or the cause of this trend,\nplus some planning ahead to prevent this from reoccurring in the future.\n\n* How will the work be reviewed?\nAll individually done work will be reviewed by the other members of the group. Feedback will be given\nand appropriate improvements will be made once a consensus is reached. Also, the team will consult\nwith the team mentor, Rebecca Adams, on bigger decisions for some critiquing.\n\n* What happens if people have different opinions on the quality of the work?\nIf someone is willing to offer improvements, they are free with the other members' permission to go the\nextra mile on an assignment. If the quality of work is indeed sub par, then the team should agree to\n\nrework the material and make it presentable. However, if different opinions mean a change of the\noverall idea, some discussion should precede any changes.\n\n* How will you deal with different work habits of individual team members (e.g., some people like to get\nassignments done as early as possible; others like to work under the pressure of a deadline)?\nAssignments will be given with this in mind so time‐sensitive work will be given to those who get work\nout of the way early, while dense, creative work will be given to those who need the pressure of a\ndeadline to inspire good work.\n\n==Part 4: Decision Making==\n* Do you need 100% approval of each team member before making a decision?\nThere needs to be a majority vote as well as a partially convinced opposition who is at least willing to go\nalong with the decision so that team unity is not destroyed.\n\n* What will you do if one of you fixates on a particular idea?\nThe team will try to accommodate everyone's interests. Yet, if this particular idea is beyond the\npreference or expertise of the rest of the team, then it is fair that the member be expected to change\ntheir idea.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.020 Introduction to Biological Engineering Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT20_020S09_prj17_onco_fnp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-020-introduction-to-biological-engineering-design-spring-2009/c32aaf4a77758521faf716f53d65bc64_MIT20_020S09_prj17_onco_fnp.pdf",
      "content": "Final Presentation\nFinal Presentation\nAnonymous student MK and NM\nAnonymous student MK and NM\nImage credits: Left, courtesy of Torsten Witmann, used with permission. Right, Donald Bliss and Sriram Subramaniam, National Library of Medicine, NIH.\n\nOUR MISSION\nOUR MISSION\nCANCER\nCANCER\nMETASTASIS\nMETASTASIS\nCOMMON DISEASE, KILLS 500,000 A YEAR\nCOMMON DISEASE, KILLS 500,000 A YEAR\nABNORMAL CELL GROWTH AND DIVISION\nABNORMAL CELL GROWTH AND DIVISION\nCAN ORIGINATE IN DIFFERENT ORGANS\nCAN ORIGINATE IN DIFFERENT ORGANS\nSPREAD FROM ORIGINAL TUMOR\nSPREAD FROM ORIGINAL TUMOR\nTRAVELS THROUGH BLOOD/LYMPH\nTRAVELS THROUGH BLOOD/LYMPH\nMAIN CAUSE OF DEATH\nMAIN CAUSE OF DEATH\n\nOUR MISSION\nOUR MISSION\nDIAGNOSTIC IMAGING TOOLS\nDIAGNOSTIC IMAGING TOOLS\nBETTER UNDERSTANDING OF METASTASIS\nBETTER UNDERSTANDING OF METASTASIS\nPATTERNS OF MOVEMENT, TIMING\nPATTERNS OF MOVEMENT, TIMING\nLEAD TO DEVELOPMENTS IN TREATMENTS\nLEAD TO DEVELOPMENTS IN TREATMENTS\nCOULD BE USED FOR KILLING CANCER CELLS\nCOULD BE USED FOR KILLING CANCER CELLS\nA SOLUTION\nA SOLUTION\nIMPACT\nIMPACT\n\nSCIENCE BEHIND IT\nSCIENCE BEHIND IT\nSIGNALS\nSIGNALS\nOVEREXPRESSION OF ENZYMES\nOVEREXPRESSION OF ENZYMES\nCOX\nCOX--2: PREVENTS APOPTOSIS\n2: PREVENTS APOPTOSIS\nMMP\nMMP--1: BREAKS BASEMENT MEMBRANE\n1: BREAKS BASEMENT MEMBRANE\nCourtesy of Larry Marnett, Ph.D. Used with permission.\nhttp://www.mc.vanderbilt.edu/lens/article/?id=49&pg=999\nImage: http://www.rcsb.org/\n\nSCIENCE BEHIND IT\nSCIENCE BEHIND IT\nDETECTION\nDETECTION\nRIBOZYMES CLEAVE MRNA\nRIBOZYMES CLEAVE MRNA\nPRODUCTS OF REACTIONS\nPRODUCTS OF REACTIONS\nBINDING ENDS LUCIFERASE INHIBITION\nBINDING ENDS LUCIFERASE INHIBITION\nEXPRESSION LEADS TO LIGHT\nEXPRESSION LEADS TO LIGHT\nImage removed due copyright restrictions.\nFluorescent imaged mouse, from http://www.caliperls.com/tech/\noptical-imaging/image-gallery/oncology-angiogenesis-models.htm\n\nHOW IT WORKS\nHOW IT WORKS\nTREATMENT\nTREATMENT\nREMOVE PATIENT CELLS\nREMOVE PATIENT CELLS\nADD PLASMIDS/CHANGE DNA\nADD PLASMIDS/CHANGE DNA\nDELIVER MODIFIED T\nDELIVER MODIFIED T--CELLS\nCELLS\nADD DOSE OF LUCIFERIN\nADD DOSE OF LUCIFERIN\nTAKE IMAGES WITH CCD CAMERA\nTAKE IMAGES WITH CCD CAMERA\nImage removed due copyright restrictions.\nPhoto of CCD imaging system, http://www.caliperls.com/\nproducts/contract-research/in-vivo/optical-imaging-studies.htm\n\nHOW IT WORKS\nHOW IT WORKS\nSYSTEM OVERVIEW\nSYSTEM OVERVIEW\nENDOCYTOSIS\nENDOCYTOSIS\nDIFFUSION\nDIFFUSION\nBINDING\nBINDING\nEXPRESSION\nEXPRESSION\nLIGHT\nLIGHT\n\nHOW IT WORKS\nHOW IT WORKS\nTIMING DIAGRAM\nTIMING DIAGRAM\nCOLLAGEN RECEPTOR\nCOLLAGEN RECEPTOR\nINHIBITOR\nINHIBITOR\nLIGHT PRODUCER\nLIGHT PRODUCER\n\"\"DEBRIS\nDEBRIS\"\"\nPROSTANOIDS\nPROSTANOIDS\nSS\nSS\nSS\nAA\nAA\nAA\n\nHOW IT WORKS\n\nDEVICE OVERVIEW\n\nINHIBITOR\n\nCOLLAGEN\nRECEPTOR\nLIGHT PRODUCER\n\nBREAKING IT DOWN\nBREAKING IT DOWN\nCOLLAGEN RECEPTOR\nCOLLAGEN RECEPTOR\nCOLLAGEN BINDS\nCOLLAGEN BINDS\nENDOCYTOSIS OF\nENDOCYTOSIS OF\nCOLLAGEN\nCOLLAGEN\nENDO180\nENDO180\n\nBREAKING IT DOWN\nBREAKING IT DOWN\nCOLLAGEN RECEPTOR\nCOLLAGEN RECEPTOR\nGFP\nGFP\nMCMV\nMCMV\nENDO180\nENDO180\nSTRONG PROMOTER\nSTRONG PROMOTER\nENDO180 RECEPTOR GENE\nENDO180 RECEPTOR GENE\nGFP FOR TESTING/DEBUG\nGFP FOR TESTING/DEBUG\nPARTS\nPARTS\n\nBREAKING IT DOWN\nBREAKING IT DOWN\nINHIBITOR\nINHIBITOR\nINHIBITION ENDS\nINHIBITION ENDS\nCLEAVAGE OF MRNA\nCLEAVAGE OF MRNA\nRIBOZYME\nRIBOZYME\n\nBREAKING IT DOWN\nBREAKING IT DOWN\nINHIBITOR\nINHIBITOR\nRIBOZYME\nRIBOZYME\nPROMOTER DEPENDENT ON LUCIFERASE\nPROMOTER DEPENDENT ON LUCIFERASE\nRIBOZYME GENE\nRIBOZYME GENE\nDOUBLE APTAMER LOOP\nDOUBLE APTAMER LOOP\nPARTS\nPARTS\nAPTAMERS\nAPTAMERS\n\nBREAKING IT DOWN\nBREAKING IT DOWN\nLIGHT PRODUCER\nLIGHT PRODUCER\nOXIDIZES\nOXIDIZES\nPIGMENT\nPIGMENT\nLIGHT\nLIGHT\nLUCIFERIN\nLUCIFERIN\nO\nO22\nLUCIFERASE\nLUCIFERASE\n\nBREAKING IT DOWN\nBREAKING IT DOWN\nLIGHT PRODUCER\nLIGHT PRODUCER\nPARTS\nPARTS\nSTRONGEST PROMOTER, COULD VARY\n\nLUCIFERASE GENE\n\nGFP FOR TESTING/DEBUG\n\nH2CMV\n\nSV40\n\nLUCIFERASE\n\nGFP\n\nPUTTING IT TOGETHER\nPUTTING IT TOGETHER\nREVIEW OF SYSTEM\nREVIEW OF SYSTEM\nLIGHT\nLIGHT\n\nPOTENTIAL PROBLEMS\nPOTENTIAL PROBLEMS\nCHANGES\nCHANGES\nDIFFERENT RECEPTORS\nDIFFERENT RECEPTORS\nLONGER DETECTION TIME\nLONGER DETECTION TIME\nOTHER SIGNAL BESIDES LIGHT\nOTHER SIGNAL BESIDES LIGHT\nUNKNOWNS\nUNKNOWNS\nDEGREE OF VISIBILITY\nDEGREE OF VISIBILITY\nCOLLAGEN DEGRADATION\nCOLLAGEN DEGRADATION\nIMMUNE RESPONSE\nIMMUNE RESPONSE\n\nMAKING IT WORK\nMAKING IT WORK\nDEBUGGING\nDEBUGGING\nPRESENCE OF LUCIFERIN\nPRESENCE OF LUCIFERIN\nLUCIFERASE REACTIONS\nLUCIFERASE REACTIONS\nUSE OF GFP IN VITRO\nUSE OF GFP IN VITRO\nFREEZE\nFREEZE--FRACTURE METHOD\nFRACTURE METHOD\nTESTING\nTESTING\nPROMOTER STRENGTH\nPROMOTER STRENGTH\nIN\nIN--VITRO BINDING TO RIBOZYME\nVITRO BINDING TO RIBOZYME\nENDOCYTOSIS EXPERIMENTS\nENDOCYTOSIS EXPERIMENTS\nEXPRESSION OF RECEPTOR/LUCIFERASE\nEXPRESSION OF RECEPTOR/LUCIFERASE\nImage removed due copyright restrictions.\nD-Luciferin Firefly vial from Caliper Life Sciences\n(http://www.caliperls.com)\n\nMAKING IT WORK\nMAKING IT WORK\nA PLAN\nA PLAN\nRECEPTOR EVOLUTION FOR SPECIFICITY\n\nSLOW DEGRADATION\n\nAPTAMER DEVELOPMENT\n\nIN VITRO BINDING/REACTIONS\n\nLUCIFERIN ADDITION AND EFFECTS\n\nIN VIVO TESTING/TRIALS\n\nImage removed due to copyright restrictions.\n\"Firefly Luciferase antibody for ICC/IF (Rat)\"\nby Mal Niladri.\nhttp://www.abcam.co.jp/index.html?pagecon\nfig=reviews&intAbID=21176&intAbReviewID\n=5843\n\nQUESTIONS REMAINING\nQUESTIONS REMAINING\nSAFETY\nSAFETY\nPOSSIBILITY OF REJECTION\n\nLUCIFERIN EFFECTS\n\nTAXING ON BODY\n\nDEGRADATION DELAY\n\nO\nO\nH\nH\nN\nN\nH\nN\nH\nO\nO\nNH\nH2N\n+\nNH2\nFigure by MIT OpenCourseWare.\n\nQUESTIONS REMAINING\nQUESTIONS REMAINING\nSECURITY\nSECURITY\nDESIGNED TO SURVIVE IN HUMAN\n\nPOSSIBLE TOXIN DELIVERY\n\nSHOULD NOT MAKE PUBLIC\n\nT-CELL ENGINEERED TO DIE\nElectron microscope image\nremoved due to copyright\nrestrictions.\nimage source: http://www.ncc.go.jp/\nCourtesy of the National Cancer Center (Japan). Used with permission.\n\nWOULD IT SELL\nWOULD IT SELL\nSUNK COSTS\nSUNK COSTS\nTT--CELL HARVESTING: ~$700\nCELL HARVESTING: ~$700\nDNA TRANSFECTION: ~$300\nDNA TRANSFECTION: ~$300\nLUCIFERIN DOSE: $400 PER GRAM\nLUCIFERIN DOSE: $400 PER GRAM\nFIXED COSTS\nFIXED COSTS\nCCD CAMERA: ~$3,000\nCCD CAMERA: ~$3,000\nRIBOZYME SEQUENCING: $100+\nRIBOZYME SEQUENCING: $100+\nRECEPTOR PLASMID AND\nRECEPTOR PLASMID AND\nLUCIFERASE PLASMID: $1000+\nLUCIFERASE PLASMID: $1000+\n\nWOULD IT SELL\nWOULD IT SELL\nEFFECTIVENESS\nEFFECTIVENESS\nCOMPETITION\nCOMPETITION\nGRADIENT OF LIGHT\nGRADIENT OF LIGHT\nDYNAMIC OVER A PERIOD OF TIME\nDYNAMIC OVER A PERIOD OF TIME\nSCALE AND 3D CLARITY\nSCALE AND 3D CLARITY\nSTATIC TESTS\nSTATIC TESTS\nCTC/TMEM BLOOD TESTS\nCTC/TMEM BLOOD TESTS\nLYMPH NODE SCREENING\nLYMPH NODE SCREENING\n\nOUR PROBLEM\nOUR PROBLEM\nOUR SOLUTION\nOUR SOLUTION\nIN SUMMARY\nIN SUMMARY\nCANCER DEATHS DUE TO METASTASIS\nCANCER DEATHS DUE TO METASTASIS\nLACK OF KNOWLEDGE\nLACK OF KNOWLEDGE\nNO ACCURATE, DETAILED TESTING\nNO ACCURATE, DETAILED TESTING\nACTIVE MAPPING OF METASTASIS\nACTIVE MAPPING OF METASTASIS\nSHOWS PROBLEM AREAS\nSHOWS PROBLEM AREAS\nGIVES SENSE OF HOW/WHEN IT TRAVELS\nGIVES SENSE OF HOW/WHEN IT TRAVELS\n\nFOR THEIR HELP!\nFOR THEIR HELP!\nTHANKS TO\nTHANKS TO...\n...\nNATALIE KULDELL\nNATALIE KULDELL\nMENTOR\nMENTOR \"\"RA\nRA\"\" (anonymous)\n(anonymous)\nDREW ENDY\nDREW ENDY\nROGER KAMM\nROGER KAMM\nAGI STACHOWIAK\nAGI STACHOWIAK\nCHRISTINA SMOLKE\nCHRISTINA SMOLKE\nCHRIS ANDERSON\nCHRIS ANDERSON\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n20.020 Introduction to Biological Engineering Design\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}