{
  "course_name": "Introduction to Propulsion Systems",
  "course_description": "This course presents aerospace propulsive devices as systems, with functional requirements and engineering and environmental limitations along with requirements and limitations that constrain design choices. Both air-breathing and rocket engines are covered, at a level which enables rational integration of the propulsive system into an overall vehicle design. Mission analysis, fundamental performance relations, and exemplary design solutions are presented.",
  "topics": [
    "Engineering",
    "Aerospace Engineering",
    "Propulsion Systems",
    "Engineering",
    "Aerospace Engineering",
    "Propulsion Systems"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nCourse Description\n\nThis course presents aerospace propulsive devices as systems, with functional requirements and engineering and environmental limitations along with requirements and limitations that constrain design choices. Both air-breathing and rocket engines are covered, at a level which enables rational integration of the propulsive system into an overall vehicle design. Mission analysis, fundamental performance relations, and exemplary design solutions are presented.\n\nPrerequisites\n\n16.50 Introduction to Propulsion Systems\nhas\n16.004 Unified Engineering IV\nor\n2.005 Thermal-Fluids Engineering I\nas a prerequisite.\n\nAcknowledgement\n\nThe class guide and objectives are courtesy of Dr. Alan Epstein and Dr. Edward Greitzer.\n\nLearning Objectives\n\nList and explain the characteristics and performance of aerospace propulsion systems.\n\nModel newly-conceived rocket or air breathing propulsion systems and estimate their performance and behavior.\n\nCarry out preliminary designs of rocket or air breathing propulsion systems to meet specified requirements.\n\nMeasurable Outcomes\n\nExplain the different features and capabilities of chemical and non-chemical rocket propulsion systems.\n\nCalculate the specific impulse and mass flow for a rocket engine with the fluid considered as an ideal gas with constant specific heats.\n\nEstimate the specific impulse and mass flow for a rocket engine accounting for chemical reaction and non-constant specific heats.\n\nExplain the causes of, and estimate, the stress on rocket casings, turbomachine blades, and blade disks in turbomachines.\n\nEstimate the heat transfer rates in rocket nozzles and in aeroengine turbine components.\n\nExplain the different performance metrics, and the corresponding performance limits, for gas turbine aeroengines and link these to the design features.\n\nExplain the physical constraints which couple the different components in a gas turbine.\n\nCalculate the design thrust and overall efficiency of turbojet and turbofan engines, with and without afterburners, from given component performance.\n\nCalculate pressure and temperature changes across the turbomachinery, inlet, and exhaust nozzle in a gas turbine engine from a knowledge of the geometry.\n\nExplain the limits imposed on gas turbine engine design by environmental restrictions.\n\nCourse Materials\n\nRecommended Texts\n\nKerrebrock, J. L.\nAircraft Engines and Gas Turbines\n. 2nd ed. MIT Press, 1992. ISBN: 9780262111621.\n\nSutton, G. P., and O. Biblarz.\nRocket Propulsion Elements\n. 7th ed. Wiley Interscience, 2000. ISBN: 9780471326427. [Preview with\nGoogle Books\n]\n\nLecture Notes\n\nLecture notes are offered as an aid to students' comprehension of the subject of aerospace propulsion. They are not meant to replace textbooks, a pair of which is strongly suggested for additional reading.\n\nSubject Content and Rationale\n\nThis subject treats aerospace propulsion systems of all kinds, from civil turbofans to spacecraft thrusters. Its intent is to foster an understanding of the characteristics of these diverse propulsion systems from the basic principles, showing how each uses sources of propulsive mass and energy to produce thrust.\n\nThe subject is divided into two roughly equal parts, the first covering rocket propulsion and the second aircraft propulsion. In the portion devoted to rocket propulsion, two classes of propulsion systems are considered: chemical, in which the propulsive mass and energy are combined in chemical propellants, and electrical, in which the propulsive mass is separate from the energy source, which may be either nuclear or solar. Emphasis is on chemical propulsion. In the portion of the subject devoted to aircraft propulsion, aircraft turbine engines are discussed, both those primarily suitable for military aircraft and commercial transport. For lack of time, very high velocity (hypersonic) air breathing propulsion is not discussed.\n\nAs reflected in the learning objectives, a goal is to introduce you to the methods of mathematical modeling of propulsion systems and then to use these modeling techniques to develop an understanding of the characteristics of the several types of propulsion systems treated.\n\nThe modeling uses thermodynamic arguments based on the First and Second Laws, and fluid mechanical principles that enable the linking of the thermodynamic behavior to the geometry of the propulsion devices. In this respect the subject goes considerably beyond most introductory treatments of propulsion, which usually limit the logic to thermodynamic arguments. Such developments can be somewhat abstract and lacking in physical substance in that they do not connect the behavior of the devices to their geometry.\n\nBecause of the time limits of a single-semester subject, the mechanical or structural aspects of propulsion devices are touched upon with less emphasis, as are such issues as cost and environmental effects. Some understanding of these aspects of the systems is essential to provide context for the more extensive thermodynamic and fluid mechanical developments.\n\nPedagogical Structure\n\nThis subject presents propulsion devices as systems, through mainly two modeling structures, one thermodynamic, the other fluid mechanical. It is important that these logical structures are employed to describe the behavior of the propulsion devices as complete systems. The disciplines are used as logical tools to understanding the behavior of the propulsion systems. As systems, the propulsion devices must satisfy well-defined requirements, and their performance measured by equally well-defined criteria. These include the traditional measures of thrust/mass and specific fuel consumption but also the (currently) less easily quantifiable measures of cost, durability, operability and environmental impact. All of these are referred to, with varying degrees of emphasis.\n\nAs noted, the subject is divided into two main parts, aircraft engines and rockets. To the extent that thermodynamic and fluid mechanical arguments span both of these classes of systems, they are developed for one but not both. Thus for example, the understanding of the behavior of exhaust nozzles, developed mainly for rockets, is assumed to be applicable to aircraft engines. The understanding of compressible channel flow, including the effect of chemical reactions, is developed mainly in the context of rockets, but is equally applicable to aircraft engines, while turbomachinery is treated primarily in the context of aircraft engines.\n\nGrading\n\nThe grade is determined from 10 problem sets, a midterm quiz and a comprehensive final quiz. Both examinations will be open-book, open-notes.\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n40%\n\nMid-term Quiz\n\n30%\n\nFinal Quiz\n\n30%\n\nHomework has two purposes:\n\nTo provide the student with timely exercise in the use of the models developed in the lectures.\n\nTo extend the logic in directions of importance that cannot be covered within the time constraints of the lectures.\n\nThe problem sets must, therefore, represent your own work. You may certainly discuss the sets with your fellow students but the engineering should be your own.\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nRocket equation; gravity loss; optimum acceleration\n\nRocket staging; range of aircraft; climb & acceleration\n\nHomework 1 posted\n\nOrbital mechanics; single force center\n\nHyperbolic orbits; interplanetary transfer\n\nNon-chemical rockets; optimum exhaust velocity\n\nHomework 1 due\n\nHomework 2 posted\n\nModeling of thermal rocket engines; nozzle flow; control of mass flow\n\nModeling of rocket nozzles; effects of nozzle area ratio\n\nTypes of nozzles; connection of flow to nozzle shape\n\nHomework 2 due\n\nHomework 3 posted\n\nSolid propellant gas generators; stability; grain designs\n\nModels for rocket engines; flow of reacting gases\n\nReacting gases (cont.); temperature dependence of specific heats\n\nHomework 3 due\n\nHomework 4 posted\n\nNozzle flow of reacting gases\n\nRocket casing design; structural modeling\n\nHeat transfer and cooling\n\nHomework 4 due\n\nHomework 5 posted\n\nAblative cooling\n\nThrust vectoring; engine cycles; mass estimates\n\nAircraft propulsion, configuration and components\n\nHomework 5 due\n\nOptional homework posted\n\nAircraft engine modeling; turbojet engine\n\nTurbojet engines (cont.); design parameters; effect of mass flow on thrust.\n\nMid-term quiz\n\nIntroduction to component matching and off-design operation\n\nTurbofan engines\n\nHomework 6 posted\n\nInlets or diffusers\n\nExhaust nozzles\n\nCompressors and fans\n\nVelocity triangles; compressor performance maps\n\nHomework 6 due\n\nHomework 7 posted\n\nCompressor blading; design; multi-staging\n\nTurbines; stage characteristics; degree of reaction\n\nHomework 7 due\n\nHomework 8 posted\n\nTurbine solidity; mass flow limits; blade temperature\n\nTurbine cooling; general trends and systems; internal cooling\n\nFilm cooling; thermal stresses; impingement cooling; how to do cooling design\n\nHomework 8 due\n\nHomework 9 posted\n\nCompressor-turbine matching; gas generators\n\nEngine structures; centrifugal stresses; engine arrangements\n\nCritical speeds and vibration\n\nHomework 9 due\n\nHomework 10 posted\n\nCombustors; afterburners\n\nPollutant; motivations for control; formation; strategies for reduction\n\nAircraft engine noise: principles; regulations\n\nHomework 10 due\n\nJet noise, turbomachinery noise\n\nRotordynamics of the jet engine\n\nFinal quiz",
  "files": [
    {
      "category": "Resource",
      "title": "Optional heat transfer homework",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/7b6e79dfc944a97a3d19827b8f13e061_MIT16_50S12_hw_opt.pdf",
      "content": "16.50 Propulsion Systems\nOptional Heat Transfer Homework\n\nConsider a rocket with a combustor-nozzle contour specified through a Mach number\ndistribution as follows:\n\nM= 0.2 + 17.2667 ቀ\nx\nLቁ\n-19.3333 ቀ\nx\nLቁ\n+ 5.8667 ቀ\nx\nLቁ\n\nwhich is arranged so as to place a sonic point at x/L=0.25 and to reach M=4 at the exit\n(x=L). x is measured from the injector plane.\n\n(a) Assuming γ = 1.2, generate and plot profiles of A/At, P/Pc and T/Tcversus\nx/L.\nAs additional data, take a molecular mass of 20 g/mole, Pc= 70 atm, Tc= 3300 K ,\nTw= 1,000 K and L/De= 2. The gas viscosity is approximately given by\nμg= 3 × 10-5(T/Tc)0.6. The absolute size of the rocket is determined by the\nrequirement to generate a matched thrust Fmatch= 2 × 106N.\n\n(b) Calculate and plot the wall heat flux distribution. Multiply times the\napproximate wall area πD(x)dx of a nozzle element of length dx and integrate\nto find the total amount Q of heat loss (use a simple trapezoidal rule\nintegration). Calculate Q/(m cpTc), the fraction of input power that is lost to the\nwall.\n(c) Assume cooling is done regeneratively by the kerosene fuel, which enters\nthe cooling passages at 300K, and calculate the temperature reached by this\nfuel as it leaves the cooling passages to be injected into the combustor. Take the\nOxidizer/Fuel mass ratio as O/F= 2.4, and assume the specific heat of the\nliquid kerosene is 2,090 J/kg/K.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Homework 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/96c7cd7dff79ed96e58c95c9de74c182_MIT16_50S12_hw1.pdf",
      "content": "16.50 Propulsion Systems HWK #1\n\nPreliminary design of a Satellite launcher\n\nWe wish to produce a first-order design of a 3-stage launch vehicle to place a 3 kg.\nnanosatellite in a circular equatorial of 500 km. altitude. Launch will be from the\nEquator, in an Easterly direction. All stages will use solid propellant rocket motors\nwith Is= 270s, and each will have a structural mass fraction εi= Msi/M0i= 0.1\n(i=1,2,3).\n\nFor a first approximation to the required stage ∆V's, assume two instantaneous\nimpulses, one delivered near the ground (r= RE= 6730 km) at an average elevation\nangle α= 20°, that will place the vehicle in an ascent trajectory with apogee at 500 km\naltitude, and the other at the apogee, to add enough velocity to reach orbital\nconditions. Use conservation of angular momentum and energy (kinetic plus potential)\nin the ascent trajectory to find the initial velocity v1 after the first impulse and the\napogee velocity va. The velocity v1 will be regarded as made up of the sum of the two\nvelocity increments ∆V1 + ∆V2 of the first and second stages, plus the Earth rotation\nvelocity ωERE cos α, minus the full gravity loss ∆VG and the full drag loss ∆VD. This\ndetermines ∆V1 + ∆V2; assume ∆V1 = ∆V2 and calculate both.\n\nTo estimate the gravity loss, assume a variation of the elevation angle γ such that sin γ\nvaries linearly in time during the first stage burn, from 1 (vertical launch) to 0. Of\ncourse, the 20° assumed for α above is a rough approximation of the average of γ\nduring both, the first and second stage burns. To calculate the stage firing times,\nassume each motor provides an initial trust acceleration Fi/M0i= 3g. One other piece\nof information for this time calculation is the propellant mass which itself depends on\nthe stage ∆V; this is not really known until the gravity loss is estimated, but you can\niterate a bit, or make a simple first cut for this purpose only.\n\nThe calculation of the drag loss is more involved, and depends on a trajectory\ncalculation, plus the aerodynamic characteristics of the vehicle. For now, assume\n∆VD= 150m/s.\n\nWith these assumptions, or some reasonable modification you may prefer (but if so,\nthe new assumptions should be clearly stated and justified in some manner), calculate\nthe initial mass of each of the stages, as well as their structural and propellant masses.\nNote that the payload for each stage is the initial mass of the next stage, except for the\nthird stage, whose payload is the overall payload. Calculate also the firing time and the\nthrust of each motor.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Solution 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/6c61545a0bc37b33997a605562923a65_MIT16_50S12_sol1.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2012\nHomework 1: Preliminary Design of a Satellite Launcher\n\na) Velocity Calculations:\n\nPoint A: Start of ascent trajectory\nPoint B: Apogee of ascent trajectory\n\nConservation of Angular Momentum:\n\nݒଵ ߙாൌݒ\n\nRearranging becomes:\n\nݒൌݒ\nோಶ\nଵ\nߙ (1)\nோ\n\nValues, Constants, and Given Parameters:\nாൌ͵Ͳ\nൌ Ͳ\nߤாൌ͵Ǥͻ ͳͶ\nయ\n௦య\nߙൌʹͲι\n\nOrbital Velocity:\nݒൌ\nఓ\nට\nಶ (3)\nோ\nݒൌටଷǤଽଵସ\nǤ\nݒൌͳͳ\n\nConservation of Energy:\n௩మ\nଶ\nభെఓ\nమ\nమ\nಶൌ௩ೌ\nோ\nோ\nെఓಶ\nಶ\nଶ\nோൌ௩భ\nଶ\nಶ\nଶቀಶ\nோ ߙቁെఓಶ\n\nோಶ\nͳ\nଶ\nଶ\n\nߤ\nݒቆͳ െ\nாଶߙቇൌ\nா\nߤ\nെ\nா\nʹ\nଵ\n\nଶ\nா\n\nೃ\nଵିಶ\nݒ\nଶఓಶ\nೃ\nଵൌඩோ\nቌ\nమ\nೃ\nቍ (2)\nಶ\nଵିಶ\nమୡ୭ୱమఈ\nೃ\n\nSubstituting Values:\nUsing equation (2) to find ݒଵ:\nݒଵൌඨቀ\nଶכଷǤଽଵସ\nଵିଷൗ\nǤଷହቁቆ\n\nଵି൫ଷ\nమቇ\nൗ\nୡ୭ୱଶι\n\nݒଵൌͳͶͷ\n\nUsing equation (1) to find ݒ:\nݒൌͳͶͷ ൈ\nଷ\nʹͲι\nݒൌͷ͵ͷͶ\n\nb) Stage οࢂ Calculations:\nWe allocate the full \"apogee kick\" to the third stage:\nοଷൌݒെݒ (4)\nοଷൌͳͳ\n௦െͷ͵ͷͶ\nοଷൌʹʹͷ\n\nThe initial ascent velocity ݒଵ contains the velocity increments of the 1st and 2nd stages, plus the\ncontribution from Earth rotation, minus the losses from gravity and drag:\nݒଵൌοଵοଶாா ߙെοீെο (5)\n\nBy design:\nοଵൌοଶൌଵሺݒଵെாா ߙοீ\n\nଶ\nοሻ\n\nTo solve:\nாா ߙൌǤʹ ሺെͷሻௗ\n௦ൈǤ͵ൈ ʹͲι\n\nாா ߙൌͶ͵ͷ\n\nTo estimate the gravity loss (1st stage only) we assume:\nߛൌͳ െ\n௧ (6)\n௧భ\n( ߛis linear between ߛൌͳ at ݐൌͲ and ߛൌͲ at ݐൌݐଵ )\n\nDetermining relations among parameters:\nெ\nெ\nெ\nݐଵൌ\nభൌ\nభ\n\nி\nభ\nቀభ\nൌ\nభ\nൗቁ\nெబభכଷ\nெభ\nெ\nοೇ\nൌͳ െ\nభൌͳ െି\nభ\n\nெబభ\nெబభ\n\nWe need to make a preliminary guess at οࢂ.\nοൌ͵ʹͲͲ\nTake for now\nଵ\n.\nெ\nషయమబబ\nభൌͳ െవǤఴכమళబ\nெ\nൌͲǤͲͳ\nబభ\nݐଵൌ\nǤଵሺ\nଷכଽǤ\nͻǤ כ ʹͲሻൌ͵Ǥͳͷݏ\n\nSolving for οࢂࡳ:\nMaking the substitution ݖൌ\n௧భ\nοൌ\n\nభ\n\nଵ\nଵ\nீ\nߛݐൌ\nݐଵ ሺͳ െݖሻݖൌ\nݐଵ (7)\n\nଶ\n\nAs a first approximation:\nοൌଵ\nீ\nଶൈͻǤ ൈ͵Ǥͳͷ\nοீൌ͵Ͳͻ\n\nሶ\n\nWe can now calculate a better οࢂ:\nοଵൌ\nଵሺ\nଶͳͶͷ െͶ͵ͷ ͵Ͳͻ ͳͷͲሻ\nοଵൌ͵Ͳ ͷ\n\nRefine other quantities:\nఓ\nయబఴఱ\nభ\nఓ\nൌͳ െିమలరలൌͲǤ Ͷ\nబభ\nݐଵൌǤସ\n\nଷ\nʹͲ ൌͳǤͻͷݏ\nοீൌ\nଵ\nଶൈͻǤ ൈͳǤͻͷ ൌ͵ͲͶ\n\nοଵൌ͵Ͳ ʹ\n\nοଶൌοଵൌ͵Ͳ ʹ\n\nThese values are close enough to the first approximation, and we accept them as converged.\n\nc) Calculation of Stage Masses:\nFor each stage:\nఓ\nοೇ\nೌa\nఓ\nൌି\n\nെߝ (8)\nబa\nWe apply this first to the 3rd stage, for which ௬aଷൌ௬ൌ͵Ǥ\nܯଷൌ\nଷ\nమమఱళ\nష\nൌ\nଷ\nమలరల\nǤଷଷଵൌͻǤʹͲ\nିǤଵ\nThe structural mass of the third stage is then:\nܯ௦ଷൌͲǤͳܯଷൌͲǤͻʹ\nThe propellant mass is:\nమమఱళ\nܯଷൌͻǤʹͲ ቀͳ െିమలరలቁൌͷǤʹ\n\nAs a check: ܯ௦ଷܯଷܯ௬ଷൌͲǤͻʹ ͷǤʹ ͵ ൌͻǤʹͲൌܯଷ (as it should)\n\nFor the second stage:\nܯ௬ଶൌܯଷൌͻǤʹͲ\nܯଶൌ\nଽǤଶ\nయబఴమ\nൌ\nଽǤଶൌͶ͵Ǥ͵ͻ\n\nషమలరల\nǤଶଵଶ\nିǤଵ\nܯ௦ଶൌͲǤͳ ൈͶ͵Ǥ͵ͻ ൌͶǤ͵Ͷ\nయబఴమ\nܯ\nൌͶ͵Ǥ͵ͻ ቀͳ െି\nଶ\nమలరలቁൌʹͻǤ ͷ\n\nAgain, we check that: ܯ௦ଶܯଶܯ௬ଶൌͶǤ͵Ͷ ʹͻǤ ͷ ͻǤʹͲ ൌͶ͵Ǥ͵ͻൌܯଶ\n\nFor the first stage:\nܯ௬ସൌܯଶൌͶ͵ǤͶͻ\nܯ\nସଷǤଷଽ\nସଷǤଷଽ\nଵൌ\nయబఴమ\nష\nൌ\nൌʹͲͶǤ\n\nమలరల\nǤଶଵଶ\nିǤଵ\nܯ௦ଵൌͲǤͳ ൈʹͲͶǤ ൌʹͲǤͶ\nయబఴమ\nܯଵൌʹͲͶǤ ቀͳ െିమలరలቁൌͳͶͲǤ ʹ\nWe verify that ܯ௦ଵܯଵܯ௬ଵൌʹͲǤͶ ͳͶͲǤ ʹ Ͷ͵Ǥ͵ͻ ൌʹͲͶǤ\n\nd) Thrusts and Firing Times:\n\nܨଵൌܯଵൈ͵ൌʹͲͶǤ ൈ͵ ൈͻǤ ൌaͲͳ\nܨଶൌܯଶൈ͵ൌͶ͵Ǥ͵ͻ ൈ͵ ൈͻǤ ൌͳaʹ\nܨଷൌܯଷൈ͵ൌͻǤʹͲ ൈ͵ ൈͻǤ ൌʹͲ\n\nFlow rates are then:\nଵൌ\nଵ\nଶସൌʹǤʹͶ\n\n௦ൈൈ\nൌ\nଵଶ\n\nଶ\nଶସൌͲǤͶ ʹʹ\n\nଵൌଶൌͲǤͳͲʹͲ\nଶସ\n\nFiring times are given by ࢈ൌ\n\nݐଵൌଵସǤଶ\nଶǤଶସൌͳǤͻ͵ݏ\nݐ\nଶଽǤହ\nଵൌǤସଶଶൌͳǤͻͳݏ\nݐଵൌ\nହǤଶ\nǤଵଶൌͷͳǤݏ\n\nሶ\nሶ\nሶ\nሶ\n\n!\"\n! #$$\n\n% & ' # &()*"
    },
    {
      "category": "Resource",
      "title": "Homework 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/5fece1cab8ebad744083572b8f61820d_MIT16_50S12_hw2.pdf",
      "content": "16.50 Propulsion Systems\nHWK no. 2\n\nThis exercise is about comparing the performance of chemical versus electrical\nthrusters for a specific mission. The mission is a heliocentric transfer from near\nEarth to near Mars. The initial mass M0=20,000 kg starts \"near\" Earth, but outside\nits SOI, and ends \"near\" Mars, but again, outside its SOI.\n\n(a) Chemical\n\nAssume a two-‐impulse heliocentric Hohmann transfer, and calculate the total ΔV\nrequired. No staging is assumed. Assume a jet velocity c=4500 m/s (specific impulse\nI=459 s, typical of a LOX-‐LH rocket), and calculate the final mass delivered to near\nMars. Of this, assume 5% of the initial mass (1000 kg) is structure+engine, and the\nrest is \"payoad\"; calculate this payload. Finally, calculate the transfer duration.\n\n(b) Electrical\n\n(b1) One peculiarity of low thrust trajectories is that their required ΔV is\ntypically greater than that of impulsive maneuvers. The trajectory is a gradual\nspiral, and using some reasonable approximations, one finds that for a mission like\nthis,\n\n!V = vc1 \" vc2 =\nμs\nr1\n\"\nμs\nr2\n\nThis seems backwards (initial minus final), but it is not; it reflects the fact that the\nvehicle gains twice as much potential energy than the kinetic energy it loses in the\nclimb. Calculate this ΔV.\n\nIn designing the low-‐thrust electrical propulsion system, there are two free\nparameters:\n\n-‐The initial acceleration a0, or, equivalently, the thrust duration Δt, which is basically\nthe whole transfer duration.\n-‐The jet velocity c, or specific impulse I to use, since that can be adjusted by design.\n\nAssume the mass of the power and propulsion system per unit power is 10 kg/kW.\nThe efficiency of the thruster and power system is taken as η=0.7. Notice that the\nNotes assumed η=1; with this efficiency included, the payload fraction expression is\nmodified to\n\nm pay\nmtot\n= e\n! \"V\nc ! (# eao\"V\n2$\n)( c\n\"V )\n\n(b2) Since the mission duration is more or less free, select a few initial\naccelerations, in the range from a0=10-‐4 m/s2 to 6x10-‐4 m/s2. For each a0, there is an\noptimum jet velocity c that maximizes the payload ratio given above. Calculate this\noptimum c for each case, and the corresponding payload ratio. For consistency with\nthe chemical case, subtract 5% of the initial mass as being \"inert mass\", and\ncalculate the final \"payload\" in each case.\n\n(b3) One argument frequently used against low thrust systems is that the very low\nacceleration implies very long mission times. However, since the acceleration acts\nall the time, this is not necessarily so, and it must depend on the amount of electrical\npower available per unit initial mass. To quantify these statements, calculate the\ntransfer time for each of the cases considered in (b2). Do this by dividing the\npropellant mass used by the mass flow rate. The mass flow rate is in turn the thrust\nF=M0a0, and the propellant mass follows from the rocket equation. In addition,\ncalculate the implied specific power P/M0. Here, P = Fc\n2! .\nFor reference, modern GEO communication satellites already have specific powers\napproaching 10 W/kg, even though their power system is not designed for primary\npropulsion, but rather for their communications mission.\n\nPresent your results for Part (b) in tabular or graphical form. A useful format\ncould be a set of graphs of specific impulse, initial acceleration, transfer duration\nand payload mass, all vs. specific power. Compare the payload and the duration to\nthose for the chemical case.\n\n!\"\n! #$$\n% & ' # &()*"
    },
    {
      "category": "Resource",
      "title": "Solution 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/89930959e5bcf2b00a9938bac1c72368_MIT16_50S12_sol2.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2012\nHomework 2: Chemical vs. Electrical Thrusters\n\na) Chemical:\nWe start outside the sphere of influence (SOI) of Earth, and end outside the SOI of Mars, so no \"escape\"\nor \"capture\"\nare involved. The whole motion is under the Sun's influence alone.\nοݏ\n\nTo enter the transfer orbit:\nοଵൌݒെݒaா௧ൌ\nఓ\nට\nೄ\n൬ට\nଶಾ\nಶ\nಶା\nെͳ൰ (1)\nಾ\n\nKnown and calculated values:\nయ\nߤௌൌͳǤ͵ʹܧʹͲ\n௦మ\nݎாൌͳǤͶͻܧͳͳ\nݎெൌͳǤͷʹ͵ כ ݎாൌʹǤʹͻܧͳͳ\nݒ\n\naா௧ൌʹͻa Ͳ\n\nݒaெ௦ൌʹͶaͳ͵Ͳ\n\nSubstituting values:\nοൌʹͻa Ͳ ቆටଶכଵǤହଶଷെͳቇൌʹaͻͶͷ\n\nଵ\n\nଶǤହଶଷ\n\nTo enter circular orbit near Mars:\nοଶൌݒaெ௦െݒ\nఓೄ\nଶಶ\nൌට൬ͳ െට\nಾ\nಶା൰ (2)\nಾ\nοଶൌʹͶaͳ͵Ͳ ቆͳ െට\nଶ\nଶǤହଶଷቇൌʹaͶͻ\n\nTotal οࢂ:\n\nοൌοଵοଶൌͷǤͷͶͻ\n(Chemical)\n\nTransfer duration:\nThe transfer time is 1⁄2 the orbital time in the transfer ellipse.\n\nSemiaxis: ൌ\nಾାಶ\nଶ\nൌͳǤ ܧͳͳ\nοݐൌ\nଵ\nయAమ\n(3)\nଶכ ʹߨכ\nඥఓೄ\nοݐൌʹǤʹ͵ܧݏൌଶǤଶଷா\nସൌʹͷͻݕݏ\nࡹ\nοೇ\nࢇൌࢋିെߝ (4)\nࡹ\nఱaఱరళ\nܯ௬ൌʹͲaͲͲͲ ൬ିరaఱబబ൰െͲǤͲͷ ൌͶaͲ\n\nb) Electrical:\nThe propulsive οࢂ is now:\nοൌݒaாെݒaெൌʹͻa Ͳ െʹͶaͳ͵Ͳ ൌͷaͷͲ\n(Electric Propulsion)\n\nThis is only slightly more than the chemical ο; for transfers to larger radii, the difference is more\nnoticeable.\nFor optimization of the low-thrust mission, define non-dimensional variables:\nெ\nߤൌ\nೌ (5)\nெబ\nݒൌ\nο (6)\n\nߣൌఈబο (7)\nଶఎ\nߝൌ\nெೞೝ (8)\nெబ\nߙൌͳͲ\nൌͲǤͲͳ\nis the specific mass (per unit power) of the power and propulsion equipment.\nௐ\nௐ\nis the initial acceleration.\nCombining expressions:\nߤൌି௩െఒ\n௩െߝ\n(9)\nTo find the best specific impulse , we have differentiate with respect to ݒ:\nെି௩ఒ\n௩మൌͲ\n\nߣൌݒଶି௩\n(10)\nSubstituting values:\nߣൌǤଵכହହ\n\nଶכǤ\nൌͶͲǤ͵ͻ\nFor each value of we then need to solve (by trial and error) the equation:\nͶͲǤ͵ͻൌݒଶ\n௧ି௩ (11)\nOnce ݒ௧ is known, we calculate:\n௧ൌ\nൌହହ\n\nThe implied transfer time follows from:\nషೇ\nெ\nఓ\nబቆଵି\nቇ\nೇ\nhݐൌ\nೝൌ\nൌ൬ͳ െି\nο\n൰؆ ο\nا\n(12)\n\nிൗ\n\nబ\nబ\n\nThe power per unit initial mass:\nி\n\nൗ\nൌ\nଶఎൌబ\n(13)\nெబ\nெబ\nଶఎ\nFinally, the payload mass is:\nߤ௬ൌߤ௧ܯൌܯ൬ି௩െ\nఒ\nെߝ൰ (14)\n\nThe results are tabulated below for a range of initial accelerations:\nሶ\nቂ\nݏଶ\nൗ\nቃ\nߣ\nݒ௧\n௧ሾݏ\nΤ ሿ\nhݐሾݕݏሿ\n\nܯ\nቂ\nൗ\nቃ\nܯ௬ሾሿ\nሾܯሿ\n1E-4\n4.039E-3\n0.06567\n633.3\n6.149\n0.123\n2E-4\n8.078E-3\n0.09421\n322.2\n(chem)\n8.572\n0.1714\n4E-4\n0.01616\n0.1361\n152.9\n11.867\n0.2373\n6E-4\n0.02423\n0.1694\n100.3\n14.302\n\nWe see several important things here:\na) For any specific power ൗ\nͳͲ ൗ\n, the transfer is faster than chemical.\nܯ\n\nb) The payload delivered is 3-4 times greater than with chemical.\nc) The specific impulse is in the range from 3,400s to 8,700s.\n\nd) The required power is from 120-290 KW, possible with large solar arrays.\n\n!\"\n! #$$\n\n% & ' # &()*"
    },
    {
      "category": "Resource",
      "title": "Homework 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/2a8a910621ec4f0a61000f695c3ae23f_MIT16_50S12_hw3.pdf",
      "content": "16.50 Propulsion Systems HWK no. 3\nA two-‐Position Nozzle\n\nAs we discussed in class, the highest thrust at a given external pressure\nobtained when the nozzle is sized such as to have an exit-‐plane pressure\npa is\nth\nof atmospheric pressures from the ground to near vacuum (as in the case of all first\nmatches that external pressure. For rockets that must climb through the full range\npe\nat\nst\ncompromise must be made. From the simplest to the most complex, these could be:\nage engines), this matching cannot be achieved at each such pressure, and some\n\n1. A fixed geometry bell nozzle (the most common approach). The nozzle is\nsized for matching at some intermediate pressure, and is over\noptimized through trajectory simulations, and it is common to find that this\nthe ground. The precise choice of area ratio or pressure ratio c\n-‐\nan be\nexpand\n\ned on\n2. A two-‐\noptimum would entail flow separation on the ground. Since this is\nund\nsepa\nes\nra\nir\ntion\nable f\nat\nor\nla\na r\nunch\nobust engine, the choice is then to design for incipient\nof the ascent is made with a relatively low under\nposition nozzle\n(\n, such as the one depicted in the sketch: the initial par\npe / pa0 ! 0.4 ).\n-‐expansion nozzle, w\nt\nint\ncoul\no pl\nd be designed as in (a), but at some point a nozzle extension is dropped\nhich\nace, to provide additional thrust at the higher altitudes. The exit area\nfor this extension and the point of transition are design parameters to be\ninvestigated in this HWK.\n\n3.\npressure-‐matched during the ascent. This is obviously impractical, but the\nA \"rubber nozzle\" that would be gradually extended so as to be always\nconcept is useful as a performance ideal.\nFigure removed due to copyright restrictions.\nFig. 14 Hagemann, Gerald, Hans Immich, et al. \"Advanced Rocket Nozzles\".\nJournal of Propulsion and Power 14, no. 5 (1998): 620-34.\n\n(a)\nmolecular mass\n! = 1.2\nM = 18g /\n. The throat area is\n. Calculate the\n\nto\ncharact\nall th\nerist\ne var\nic vel\niants\nocit\ncons\ny\ni\nm\nc\nd\n*\ner\nand the mass fl\ned\nol\nbelow.\now rate\nAt =0.1m2\nm! . These will be common\nThe inner b\npe1 / pa0 ! 0.4\nell\n.\nof it\nCalcu\ns t\nand\nla\nw\nt\no position nozzle is\n\ngr\ne\n-‐\nt\no\nhe\nund\nex\nth\nit a\nr\nrea\nust,\nAe1\nFV1 = m! ue1 + pe1A\n, ex\nd\nit\nes\nvel\nigned\nocit\n, as\ny u\nnoted\ne1 , vacuum thrust,\nabove, for\n) Let\nand\n\nt1\n.\n(b\ntb\nm1\nbe\nthe stage burnout time. The initial mass is\nthe \"trans\ne1\nition time\", at which\nF\nth\n0 =\ne\nFV1 ! p\nmb\nouter be\naAe1\nm0\nll i\n, the mass at transition\ns dropped into place\nis\nascent be\n, and the burnout mass is\nfore and\nv1 =\naf\nFV\nte\n1 l\nr\nn(\nm\ntr\nm\nans\n0 )\ni\n!\nm\nti\ngt\non ar\n. Show that the velocities gained in ver\nt1 pa(t)\ntical\n1 ! Ae1\n!\ne gi\n\"0\nve\nm\nn by\ndt\n(t)\n\nwhere\nF\nm\np (t)\nv\nv\nV 2\nb !\n1 =\nln(\n)! g(tb ! t1)! A\n(a\nherefore t\n\n\"\ntb\na\nm\ne\nt\ndt\nm\nb\n1 m(t)\n\nnd t\n!\nm(t) = m0\nhe new\n! m! t . Assuming now that the exit area\nexhaust velocity\nexit pre\nAe2\nue2 and\nvb\nssur\nha\ne\ns been selected\nshow\ntransition happens when the atmospheric pressure satisfies\nby differentiation that the final velocity\nis maximized if the\npe2 as well),\n\nis a\nand\ndded.\nthat i\n\nf this is satis\np\nfi\na\ne\n(\nd\nt1\n,\n)\nth\nF\n=\ne\nA\nth\nV1\nV 2\ne2\nr\n!\n!\nus\nF\nA\nt h\ne1\nas no discontinuity when the extension\n(c) Assume the new nozzle configuration is also such as to start close to\nsep\ncondition above, determine\naration , i.e. pe2 = 0.4 p\n. This condition, together with the optimality\n\nunder consideration (iteration or some other method will be needed).\na(t1)\npe2 or Ae2 . Perform the calculation for the case\n(d) Show in tabular form the values of thrust on the ground, at the altitude where\ntransition occurs, and in vacuum, for the fixed geometry bell, the two-‐position bell\nthree thrust profiles vs. z (up to about 60 km).\nand the \"rubber engine\" bell. Using the approximation pa(atm) = e!z/6.8km, plot the\nConsider a rocket whose chamber pressure is 70 atm., its chamber\ntemperature is 3300K, the gas has a specific heat ratio\nand a\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Solution 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/0262c8ff6670508a1598cb54f41be82b_MIT16_50S12_sol3.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2012\nHomework 3: Two-Position Nozzle\n\na) כ ൌ\nඥோ (1)\nሺஓሻ\nംశభ\nH ൌξߛቀ\nଶ\nఊାଵቁ\nమሺംషభሻ (2)\nమǤమ\nH ൌξͳǤʹ ቀଶ\nଶǤଶቁ\nమכబaమൌͲǤͶ ͷ\n\nǤଷଵସ ൗ\nൌ\nି\nܬ\n(3)\n\nൌͶͳǤͻ ൗ\nǤଵ\nൗ\nെܭ\n\nSolving for ࢉכand :\nכ ൌξସଵǤଽכଷଷ\nǤସହ\nൌͳͻͲ͵ǤAݏ\nൌ\n\nכ ൌ\nכଵǤଵଷாହכǤଵ\nଵଽଷǤ\nൌ͵ʹǤͷAݏ\n\nFor the inner bell:\nభ\n\nൌͲǤͶ\nೌబ\n\nTherefore, the exit Mach number is given by:\nభǤమ\nൌቀͳ\nଵǤଶିଵܯଶ\nబǤమ\nଵ\nǤସ\nଶ\nቁ\n\nܯଵൌ͵Ǥͻͷ\n\nThe area ratio is then:\nംశభ\nംషభ\n\nభሻ\nభ\nଵା\nൌ\nଵ\nெమ\nమሺംష\nெ\nቆ\nమ\nభ\nംశభ\nቇ\n(4)\n\nభ\nమ\nభ\nൌͳ Ǥʹ͵Ͷ\n\nܣଵൌͳǤ ʹ͵Ͷଶ\n\nThe vacuum thrust is:\nܨ௩ଵൌݑଵଵܣଵ (5)\nംషభ\nݑ\nൌඨʹ\nఊቈͳ െቀభ\nଵ\n\nఊିଵ\nቁ\nം (6)\n\nబǤమ\nݑଵൌඨʹ\nଵǤଶ\nǤସ\nభǤమ\n\nǤଶͶͳǤͻ כ ͵͵ͲͲ ቈͳ െቀቁ\nൌ͵ʹͶͳAݏ\n\nሶ\nሶ\nሶ\n\nOn the ground:\nܨൌܨ௩ଵെܣଵ (7)\nܨൌͳǤʹ Ͷʹܧ െͳǤͲͳ͵ܧͷ כ ͳǤ ʹ͵Ͷ ൌͳǤͲͻͻͷܧ\nܨ௩ଵൌݑଵଵܣ௪ଵൌ͵ʹǤͷ ൈ͵Ͷʹͳ ͲǤͶ ൈͳǤͲͳ͵ͷ ൈͳǤ ʹ͵Ͷ ൌͳǤʹ Ͷʹ\n\nb)\nௗ௩\nௗ௧ൌܨെൌܨ௩െܣെ (8)\nௗ௩\nௗ௧ൌிೡ\nെെೌ (9)\n\nൌെݐ (10)\nൌെݐ (11)\n\nPutting equations together:\n\nݒൌെ\nிೡௗെݐെೌ\n\nݐ (12)\n\nIntegrating between ݐൌͲ and ݐൌݐଵ (with ܨ௩ൌܨ௩ଵ and ܣൌܣଵ) :\nݒൌிೡభቀ\nబቁെݐെܣ\n\nభೌሺ௧ሻ\nଵ\nଵ\nଵ\n\nభ\n\nሺ௧ሻݐ (13)\n\nIntegrating between ݐൌݐଵ and ݐൌݐ (with ܨ௩ൌܨ௩ଵ and ܣൌܣଶ):\nݒെݒଵൌ\nிೡమቀ\nభቁെሺݐ\nെݐଵሻെܣଶ\nೌሺ௧ሻݐ (14)\n\n௧భሺ௧ሻ\n\nAdding equations (13) and (14):\n\nݒ\nி\nൌ\nೡభ\nቀబ\nቁிೡమ\nቀభ\nቁെݐ\nെܣଵ\nభ\nೌሺ௧ሻ\nభ\n\nሺ௧ሻݐെܣ\nଶ\nೌሺ௧ሻ\n(15)\n௧భሺ௧ሻݐ\n\nHere, of course:\nଵൌെݐଵ (16)\nSo ݐଵ appears in ଵ and in the limits of integration.\n\nTo optimize\nௗ௩\nௗ\n, set\n\n, us\nௗ௧ൌͲ\ning\nభ\nభ\nௗ௧\nൌെ\nభ\nିிೡభଵሺെሻ\nி\n\nೡమଵሺ\nሻ\nೌሺ௧భሻ\nೌሺ௧భሻ\nଵ\nଶ\n\nభ\n\nെെܣ\nభ\n\nܣ\nభ\n\nൌͲ\nభ\nܨ௩ଵെܨ௩ଶሺܣଶെܣଵሻሺݐଵሻൌͲ\nሺݐሻൌிೡమିிೡభ\n\nଵ\n(for optimum\nమି\nݐଵ)\nభ\nIf this ݐଵ is chosen, the thrust is:\n\nJust before the transition:\nܨଵሺݐଵെߝሻൌܨ௩ଵെிೡమିிೡభ\n\nି\nܣ\nி\nଵൌ\nೡభమିிೡమభ (17)\nమ\nభ\nమିభ\nJust after the transition:\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ23\n\nܨሺݐߝሻൌܨ\nെ\nிೡమିிೡభܣ\nൌ\nிೡభమିிೡమభ\nଶ\nଵ\n௩ଶ\nଶ\n(18)\nమିభ\nమିభ\n\nTherefore,\nܨଵሺݐଵെߝሻൌܨଶሺݐଵߝሻ There is no discontinuity in the thrust.\n\nc) If we impose now ଶൌͲǤͶሺݐଵሻ (incipient separation on the extended nozzle), we must have:\n\nிೡమିிೡభ\nሺ௨మାమమሻିிೡభ\nଶൌͲǤͶ\n(19)\n\nൌͲǤͶ\n\nమିభ\nమିభ\nHere, , ܨ௩ଵ, and ܣଵ are already known (from part a), and all the other quantities (ݑଶ, ଶ, ܣଶ)\ndepend on a single parameter like ܯଶ. Hence the equation above determines ܯଶ, and all other\nquantities. Equation (19) can be solved by trial and error as follows:\n\na) Guess ܯଶ\nംశభ\nംషభ\nଵା\nெమ\nమሺംషభሻ\nb) Calculate ܣ\nൌቆ\nమ\nమ\nଶ\nெ\nംశభ\nቇ\n\nమ\nమ\nc) Calculate\n\nଶൌ\nംషభ\n, then\nଵା\nெమ\nݑଶൌܯଶඥߛଶ\nమ\n\nം\nd) Calculate\nൌቀమቁ\nംషభ\nଶ\n\ne) Calculate the right hand side of equation (19), compare to ଶ from the left hand side.\n\nResults of this process are plotted in Figures 1a and 1b, and the solution is seen to be ܯଶൌͶǤ ͳͷ.\nFrom this, we find:\nమ\nൌͻͲǤͳ͵\n\nܣଶൌͻǤͲͳ͵ଶ\nݑଶൌ͵aͷͷAݏ\nଶൌͲǤͲͷʹ͵ݐ\n\nܨ௩ଶൌݑଶଶܣଶൌͳǤ͵ͻͷܧ\nሺݐଵሻൌ\nிೡమିிೡభ\n\nൌͲǤͳ͵Ͳ ݐ\nమିభ\nݖଵൌǤ ቀ\nଵ\nǤଵଷቁൌͳ͵Ǥ ͵\n\nThe thrust at transition (from either nozzle 1 or 2) is:\nܨሺݐଵሻൌܨ௩ଵെሺݐଵሻܣଵൌͳǤʹͷͲܧ\n\nc) For the ideally expanded (\"rubber\") nozzle, ൌሺݖሻ, and then:\nംషభ\nݑൌඨʹ\nఊ\nఊିଵቈͳ െቀೌሺ௭ሻ\n\nቁ\nം\n\nܨൌݑ\nሶ\nሶ\nሶ\nሶ\n\nFor ݖൌͲa ݖൌݖଵ, and ݖ՜ λሺൌͲሻ, and for the three types of nozzles, Table 1 collects the values of\nthrust:\nTable 1: Thurst calculations for three nozzles at varying altitudes.\nThrust (MN)\nNozzle\nݖൌͲ\nݖൌݖଵൌͳ͵Ǥ ͵\nݖ՜ λ\nFixed Geometry\n1.0995\n1.2570\n1.2842\nTwo-Position\n1.0995\n1.2570\n1.3795\nIdeally Expanded\n1.1348\n1.2836\n1.5931\n\nNotice:\na) Thrust increases with altitude in all cases.\nb) The two-position nozzle is equivalent to the fixed nozzle at ݖଵ, but clearly superior at the vacuum\ncondition.\nc) The ideally expanded nozzle outperforms the others at all altitudes.\n\nFigure 2 compares the thrust profiles of the thrust nozzles. The two-position nozzle would follow the\ncurve for nozzle 1 up to ݖൌݖଵ, then follow the nozzle 2 curve.\n\nNotice how the ideally expanded curve touches that for nozzle 1 at ݖൎǤʹ͵; that is where this\nଵ\nଵ\nnozzle is matched ሺǤ ቀ\nቁൌǤʹ͵ሻ. It also touches that of nozzle 2 at\nǤସ\nݖൌǤ ቀǤହଶଷቁൌ\nʹͲǤͳ, where nozzle 2 is matched.\n\nFigure 1a) Solving equation (19).\nFigure 1b) Solving equation (19) at a higher resolution. Solution is ࡹࢋൌǤ ૡ.\n\nFigure 2: Thrust profiles for the three nozzles.\n\n!\"\n! #$$\n\n% & ' # &()*"
    },
    {
      "category": "Resource",
      "title": "Homework 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/2e29c225b534268de25416c7e657ddb2_MIT16_50S12_hw4.pdf",
      "content": "16.50 Propulsion\n\nSystems\nHWK#4\nSolid propellant rockets are often equipped with \"termination\n\nProblem 1\nports\" (placed\npressure\", of the order of 20 atm in most cases. This problem analyzes the behavior\nsymmetrically), that can be blown open on command to terminate thrust in an\nemergency. This can be achieve\n\nd if the internal pressure goes below an \"extinction\nof this system.\n\n(1a) Start with the mass balance equation, written before and after the ports, of total\narea Ap , are blown open. Before the opening, we assume steady operation, so that\n\nAfter the opening, the area for flow discharge changes to\nA P\na !pAbP n\nt\nc\nc \"\n= 0\nc*\n\nAt + Ap\nSince typically the extinction pr\nVc dPc\nAt + A\n= a\nessur\n! A\ne\nP n\"\nis much less than the initial pressure\n(\np)Pc\nRTc dt\np\nb\nc\nc*\n, and we have\nis needed. To fa\nthe linearization made in class is not accurate enough, and\n,\ncilitate the al\nPext\nPc0\n\nt\nV c*\n!\ngeb\n=\nra, define the non\n, with\nt\nc\nc\n-‐dimensional variables\na full non-‐linear solution\nh =\ntch\nRTcAt\no\nn the Ber\nulli-‐type no\nA\n\" = A\n\nto btai\nno\ndy\nd!\nnli\n=\nne\np ;\ny =\nt\nar diffe\nP\nP\nr\nc\nc0\nyn \" (1+#)\ne\ny\nntial equation\n\nThis becomes linear with the change\ny(0)=1 is\nu\n\n= y1!n\n\n(1b) Assume\n=70 atm., c*=1,800 m/s,\n1+! e\"(1+! )(1\n[\n\"n)#\ny =\n]1\n. Show that the solution satisfying\n\"n\n+!\nextinction (in infinite time), and then calculate the extinction times for a few values\n. C\nP\nalculate the\nc0\nminimum port ar\n!p\n\nea r\n= 1,\natio,\n700kg / m\nT\n, Vc / At = 10\nc = 3400K\n! min\nand\n, that will achieve\nm\n! > ! min\nof\n.\n\nAs was mentioned in class, monopropellant H\nProblem 2\ncatalytic decomposition chambers that are purposely sized\n\nydrazine rockets often operate with\ndecomposition into N2\ntoo small for full\n\"disproportionation\" reaction into Ammonia and nitrogen, followed by a fractional\n(\nhigher than with full decomposition, due to the presence of endothe\nH2\ndecomposition of the Ammonia in\nNH 3\nand\n, in which case the gas temperature ends up being\n) among the products. The net reaction can be split into a fast hydrazine\nrmic Ammonia\n4 !\nN\na s\nH\nlower\n\nN2 H\n3 +\nN\nreaction:\nformulate the net reaction. (H\n(b1) Assume only 40% of the Ammonia decomposes in the second reaction, and\nN H 3 !\nint: add the first reaction plus 0.4 times the second).\nN2 + 2 H2\n( fractional)\n\n(b2) Since the temperature may be too high for a constant specific heat assumption\n(l\ntemperatures (in J/mole, with\ninear enthalpy vs. T), use the following quadrat\n):\nic fits for the relevant gas\n\n! = T /1000K\nhN2 = !11.84 + 32.42\" + 0.76\" 2\nh\nThe heat of formation of H\nH2 = !8.23+ 27.61\" +1.54\"\nhNH3 = !70.40 + 51.66\" + 4.11\" 2\n\nydrazine, in the liquid state, is\nand the liquid is assumed to be injected at the standard\n!H f\nN2H4 ,l = 50,630 J / mol ,\nCalculate the adiabatic temperature of the final gas, its mean molecular mass\ntemperature of 298.2K.\nmean specific heat, in J/kg/K.\n, and its\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Solution 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/ef232c1daa3253cc5ad3a34d51b59f12_MIT16_50S12_sol4.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2012\nHomework 4.1: Solid Propellant Rocke\n\n1a) Normal operation mass balance:\nߩܣ\nെ\nబ\nכ\nൌͲ (1)\n\nTransient operation after port opening:\nௗൌߩܣ\n\nെ\nሺାሻ\nכ\n(2)\nோௗ௧\n\nDefine:\nݐൌ\nכ\n(3)\nோ\nൌ௧ (4)\nߙൌು (5)\n\nݕൌ (6)\nబ\n\nIn terms of these variables, equation (2) becomes:\nௗ௬\nௗఛൌݕെሺͳ ߙሻݕ (7)\n\nt\n\nMultiply equation (7) by ି:\nݕିௗ௬\nௗఛൌͳ െሺͳ ߙሻݕଵି (8)\nሺͳ െሻݕିݕൌሺݕଵିሻ\n\nDefine:\nݕଵିൌݑ (9)\nଵ\nௗ௨\nଵିௗఛൌͳ െሺͳ ߙሻݑ (10)\nThis relationship is linear\nଵ\nand can be easily solved. The particular solution is ݑൌ\n, and the\nଵାఈ\nhomogeneous solution is ݑൌିሺଵିሻሺଵାఈሻఛ. The complete solution is then ݑൌ\nଵܣିሺଵିሻሺଵାఈሻఛ,\nଵାఈ\nwhere A is arbitrary.\n\nAt ݐൌͲሺൌͲሻ, we have ൌሺݕൌݑൌͳሻ, so\nͳ ൌ\nଵ\nଵାఈܣ\nܣൌ\nఈ\nଵାఈ\n\nTherefore:\n\nశഀ\nݑൌଵାఈషሺభషሻሺభ\nሻഓ\n\nଵାఈ\n\nUsing ൌష:\nభ\nݕൌଵାఈషሺభషሻሺభశഀሻഓ\nభష (11)\nଵାఈ\n\n1b) The combustion stops when ʹͲݐ ቀݕ௫௧௧ൌ\nଶൌ\nଶቁ. For ݐ՜ λሺ՜ λሻa we obtain\n\nfrom equation (11):\nݕሺλሻൌ\nଵ\nభ (12)\nሺଵାఈሻభష\n\nଶ\nFor this to be equal or less than , ߙ must be more than:\n\nଵି\nଵିǤଶ\nߙൌቀ\nଵ\n௬ሺஶሻቁ\nെͳ ൌቀ\n\nଶቁ\nെͳ (13)\nቀ\nು\nቁ\nൌͳǤʹͶ (14)\n\nFor values of ߙͳǤʹͶ\nଶ\n, the extinction limit ݕൌ is reached in a finite time. Solving equation (11) for\n\ngives:\n௫௧ൌ\nଵ\nሺଵାఈሻሺଵିሻቀ\nఈ\nሺଵାఈሻ௬భష\nೣିଵቁ (15)\n\nൌͲǤʹ\nሺͳ ߙሻݕଵିൌ\nሺଵାఈሻ\nSince\nand\nሺͳ ߙ\nଵି\nሺଵାఈ\nሻݕ\n:\nౣሻ\n௫௧ൌ\nଵ\nఈ\n(16)\nǤሺଵାఈሻቆభశഀ\nቇ\nିଵ\nమǤళమర\nݐ\nൌ\n\nכ\n\n(17)\nோ\n\nAssuming a molecular mass ܯൌʹͲ\n(not specified in problem statement),\n\nכ\nൌ\nଵൈଵ\nఴǤయభర\nൌͳǤʹͶ ൈͳͲିଶݏ (18)\nோ\nൈଷସ\nబǤబమ\n\nWe can now calculate a few extinction times corresponding to choices of\nು above the minimum, shown\n\nin Table 1.\n\nTable 1: Extinction Times\nߙൌܣ\nܣ௧\n\n1.724\nλ\n1.243\n0.5803\n0.3915\nݐ௫௧ሾݏሿ\nλ\n1.583e-2\n7.42e-3\n4.99e-3\n\nHomework 4.2: Monopropellant Hydrazine Rocket\n\nܪ՜ ସ\nଵ\nRapid disproportionation:\nଶ\nସ\nܪଷ\nଶ (1)\nଷ\nଷ\nSlow ࡺࡴ\nସ\nଶ\ndecomposition:\nଷܪଷ՜\nଶ\nଶ (2)\nଷʹܪ\n\nSince we assume 40% Ammonia decomposition, form equation (1) + 0.4*equation (2):\nଶܪସ՜ ସሺͳ െͲǤͶሻܪଷଵାǤଶͲǤͶ כ ʹܪଶ (3)\nଷ\nଷ\nଶܪସ՜ ͲǤ ܪଷͲǤଶͲǤ ܪଶ (4)\n\nWe can now write the enthalpy balance for the reaction. The enthalpy of the reactants (liquid Hydrazine\nat 298.2K) is +50.63 kJ/mol, so using the fits provided for gaseous ܪଷa ଶa and ܪଶ:\n\nͷͲǤ͵ ൌͲǤ ሺെͲǤͶͲ ͷͳǤͳߠͶǤͳͳߠଶሻͲǤሺെͳͳǤ Ͷ ͵ʹǤͶʹߠͲǤߠଶሻڮ\nͲǤ ሺെ Ǥʹ͵ ʹǤͳߠͳǤ͵Ͷߠଶሻ\nͶǤͻߠଶ ʹǤͷͲ ߠെͳʹͲǤͶ ൌͲ\n\nమ\nߠൌିଶǤହାξଶǤହାସכସǤଽכଵଶǤସൌͳǤ͵ͷʹ ൌ\n(5)\nଶכସǤଽ\nଵ\nൌͳa͵ͷʹܭ\n\nMean molecular mass:\nܯഥൌ\nǤכଵାǤכଶାǤכଶ\nǤାǤାǤ\nൌͳǤͲ\n\nൌͲǤͲͳ\n\nMean specific heat:\nǤ൫෦൯\nାǤ൫෦൯\nାǤ൫෦൯\nಿಹయ\nಿమ\nಹమ൙\nሺǤାǤାǤሻ\nൌ\n\nǤଵ\n\nడ\nడ\nൌ\nಿಹయൌ\nଵ\nಿಹయ\n\nேு\nడ\nଵ\nడఏ\nൌ\nହଵǤ\n\nଵ\n\nכൌͷͳǤ\n\nయ\nכ\nడ\nడ\nಿమ\nଵ\nಿమ\nଷଶǤସଶ\n\nேൌ\nడൌ\nడఏൌଵכൌ͵ʹǤͶʹ\nమ\nଵ\nכ\nడ\nுൌ\nಹమ\nడൌ\nଵ\nడಹమ\nଵ\nడఏൌ\nଶǤଵ\n\nଵכൌʹǤͳ\n\nమ\nכ\n\nǤସכହଵ\nൌ\nǤାǤଷכଷଶǤସଶାǤସכଶǤଵ\nǤଵ\nൌʹaͷͻͲ\n\nכ\nǤଷଵସ\n\nWe could now calculate ௩ൌʹaͷͻͲ െǤଵൌʹǤͲͲ\nand so\n\nכ\nߛൌൌͳǤʹͷͳʹ\nೡ\n\n!\"\n! #$$\n\n% & ' # &()*"
    },
    {
      "category": "Resource",
      "title": "Homework 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/d37dd289bc3a1ff11d25284f65587d85_MIT16_50S12_hw5.pdf",
      "content": "16.50 Propulsion Systems\nHWK no. 5\nThis problem is an exploration of Thermochemistry for rocket nozzles, using as a\ntool the C\ncearun.grc.nasa.gov.\nEA code from NASA, which is available online at http://\nThe specific ca\n\nOxygen (LOX) as propellants, with the Oxidizer/Fuel mass ratio ranging from 2 to\nse to be studied is a rocket using Kerosene (C H1.975 ) and Liquid\n2.8. The chamber pressure will be 70 atm., and the exit pressure will be 0.4 atm. The\ncal\nexpansion, and (b) Frozen C\nculation will be done for both limiting assumptions (a) Shifting Equilibrium\nCEA menu). The running menu is mostly self-‐\nhemistry expansion from the throat (Option 2 in the\noxidizer. Notice that the code gives the vacuum specific impulse and the \"specific\nand later the RP-‐1 fuel choice (this is the Kerosene) and t\nexplanatory. Use t\nhe O2(L) choice for t\nhe \"Rocket\" opt\nhe\nion,\nimpulse\" with no specification; this latter one is\n\nWe are interested in these, but also the \"take-‐off\" condition, at pa=1 atm.\nfor the matched pressure condition.\nExamine carefully your output files, and answer the following questions:\n(1) Is there an optimum O/F proportion for maximum take-‐off performance? Is it\nthe same for the equilibrium and the frozen cases, and if\n(2)\nthese optima fuel-‐rich or fuel-‐lean?\nnot, why not? Are\nTake the case for best equilibrium performance, and select (by inspection of\nth\nmass, possibly the ones at the throat. With these values, and the computed\ne results) one representative value of ! , and one of the mean molecular\nchamber temperature, do a standard \"ideal gas\" calculation of the\ncharacteristic velocity (c*), the exit Mach number, the exit temperature, and\nthe specific impulse (vacuum and take-‐off). C\ncomment on the degree of agreement.\nompare to the CEA results and\n(3)\nconditions of atom conservation and entropy conservation. For the latter, do\nFor this same case, verify that the CEA exit-‐plane results do satisfy the\nyour own calculation of the entropy (J/kg/K) from the\ncomposition and temperature. You can use the following skeleton table of the\nstated gas\nStandar\nThe table is extracted from Fundamentals of C\nd Molar Entropy (1 atm) of the main molecules involved, in J/mole/K.\nWylen/Sonntag):\nlassical Thermodynamics (Van\n\nCO\n250.702\n600K\n\n1800K\n254.907\n\n258.710\n2000K\nCO2\n296.010\n302.990\n309.320\n\nH2\n180.929\n\nH2O\n253.622\n184.833\n259.371\n\n188.406\n264.681\n\nThe calculated Entropy per kg should agree fairly well with that reported by CEA for\nthe chamber.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Practice Mid-term Quiz",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/0ca8745515511c1eec7e19c3d971ceb4_MIT16_50S12_prac_quiz.pdf",
      "content": "16.50 Propulsion Systems\n\nYear Unspecified\nQuiz 1\n\nOne hour, open book, open notes\n\nTRUE-FALSE QUESTIONS (50%)\nPlease include a 1-2 line explanation for each of your answers.\n\nStatement\nTrue False\n1. If one takes a given rocket, with a fixed chamber pressure, and replaces its operating\ngas by one with half the molecular mass, the thrust does not change.\n\n2. For any external pressure, adding segments to a supersonic nozzle (increasing\n\n)\nalways increases thrust.\n\n3. A conventional rocket nozzle operates on the ground with . A device is\nproposed that will force flow separation at the point in the nozzle where This\nwill increase thrust.\n\n4. A small test rocket is fired in vacuum and measurements are made of the jet flow speed\nmany exhaust diameters downstream. When this is done using different expansion area\nratios\n\n, the downstream speed is found to be invariant.\n\n5. The method of characteristics can be used to design the contour of a nozzle, but only\ndownstream from the throat.\n\n6. In a solid propellant rocket, increasing the throat area increases the thrust.\n\n7. The characteristic damping time of pressure oscillations inside a solid propellant rocket\nis proportional to the linear dimensions (assuming geometrically similar rockets).\n\n8. In an equilibrium nozzle expansion, dissociated species recombine fairly completely.\nThis means the performance is the same as one would calculate if dissociation were\nignored in the chamber.\n\n9. The chemical reactions that are selected for imposing equilibrium in the calculation of\nchamber temperature must be the ones that actually happen during combustion.\n\n10. Heat flux to the nozzle walls peaks at the throat because that is where stagnation\ntemperature is maximum.\n\nPROBLEM (50%)\nThe gas leaving the combustion chamber of a LOX-LH rocket has the following characteristics:\n-\nMolecular mass:\n-\nSpecific heat ratio:\n-\nTemperature:\n-\nPressure:\n-\nViscosity:\n\n-\nPrandtl's number:\n\nThe nozzle throat has a diameter , and its first wall is a thin Copper shell which is cooled\non its back side to . The thermal conductivity of Copper is .\n\nWhat is the maximum Copper thickness such that the hot-side temperature does not exceed\n?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Practice Mid-term Solution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/0bfe3535a8503d7cbf384b314cba7db1_MIT16_50S12_prac_sol.pdf",
      "content": "16.50 Propulsion Systems\n\nYear Unspecified\nQuiz 1\n\nOne hour, open book, open notes\n\nTRUE-FALSE QUESTIONS (50%)\nPlease include a 1-2 line explanation for each of your answers.\n\nStatement\nTrue False\n1. If one takes a given rocket, with a fixed chamber pressure, and replaces its operating\n√\n\ngas by one with half the molecular mass, the thrust does not change.\nܨൌܣ௧ி and ி depends on geometry and ߛ, not molecular mass.\nܣ\n\n2. For any external pressure, adding segments to a supersonic nozzle (increasing\nൗ\n)\nܣ\n√\nalways increases thrust.\nMaximum thrust when ൌ. Extending the nozzle more than that creates suction,\nreduces thrust.\n3. A conventional rocket nozzle operates on the ground with ൌͲǤͷݐ. A device is\n√\n\nproposed that will force flow separation at the point in the nozzle where ൌͳݐǤ This\nwill increase thrust.\nSeparation will allow back-filling of the negative pressure region past ൌͳݐǤ\n4. A small test rocket is fired in vacuum and measurements are made of the jet flow speed\n√\nmany exhaust diameters downstream. When this is done using different expansion area\nratios ܣΤܣ௧, the downstream speed is found to be invariant.\nThe speed for downstream is ൌܨൗ, i.e. the specific impulse (times ). This does vary\n\nwith ܣΤܣ௧.\n5. The method of characteristics can be used to design the contour of a nozzle, but only\n√\n\ndownstream from the throat.\nThe M.O.C. does require ܯͳ.\n6. In a solid propellant rocket, increasing the throat area increases the thrust.\n\nభ\n√\nభ\nష\nܨൌ\nכ\n௧ி; ൌቀߩ\n\nܣ\nቁ\nభష, so ܨܣଵି\nభషൌܣ௧భష, F decreases with ܣ௧. In\n\naddition, also decreases (through\n\nி\ndecreasing).\n\n7. The characteristic damping time of pressure oscillations inside a solid propellant rocket √\n\nis proportional to the linear dimensions (assuming geometrically similar rockets).\nሺͳ െሻఘൌሺͳ െሻఘכ\nFor similar geometry,\n\nܮ\n8. In an equilibrium nozzle expansion, dissociated species recombine fairly completely.\n\n√\nThis means the performance is the same as one would calculate if dissociation were\nignored in the chamber.\nThe heat of dissociation is all recovered in the nozzle recombination, but part of it at\n൏, so the expansion to is less efficient than it would be from .\n9. The chemical reactions that are selected for imposing equilibrium in the calculation of\n\n√\nchamber temperature must be the ones that actually happen during combustion.\nThey can be selected arbitrarily, as long as they linearly span the space of possible\nreactions.\nሶ\nሶ\n\n10. Heat flux to the nozzle walls peaks at the throat because that is where stagnation\n\n√\ntemperature is maximum.\nStagnation temperature is everywhere. What is maximum at the throat is ߩݑ.\n\nPROBLEM (50%)\nThe gas leaving the combustion chamber of a LOX-LH rocket has the following characteristics:\n\nMolecular mass: ܯൌͳ͵A\n\nSpecific heat ratio: ߛൌͳǤʹ\n\nTemperature: ൌ͵ͲͲܭ\n\nPressure: ൌʹͳͲݐ\nǤ\n\nViscosity: ߤൌ͵ ൈͳͲିହቀ\n\nଷቁ\nܭAAݏ\n\nPrandtl's number: ൌͲǤͻ\n\nThe nozzle throat has a diameter ܦ௧ൌͲǤʹ, and its first wall is a thin Copper shell which is cooled\non its back side to ௪ൌ͵ͲͲܭ. The thermal conductivity of Copper is ൌ͵ͲAAܭ.\n\nWhat is the maximum Copper thickness such that the hot-side temperature ௪ does not exceed\nͲͲܭ?\n\nFormulas and constants:\nംశభ\nோ\nߩ௧ݑൌ\nכ, with כ ൌඥ\n\n,\nଶ\n\nሺఊሻ\nH ൌξߛቀఊାଵቁ\nమሺംషభሻ\nమǤమల\nʹ\nమൈబǤమల\nH ൌξͳǤʹ ൬\n൰\nൌͲǤͷͻͻ\nʹǤʹ\nǤ͵ͳͶ\nܬ\nൌ\nൌ͵ͻǤͷ ൗ\n\nͲǤͲͳ͵\nܭ\nTo calculate:\n\nכ\n\nʹͳͲ ൈͳǤͲͳ͵ ൈͳͲହ\n\nൌʹʹͻͻ\n՜ ߩݑ\nݏ\n௧ൌ\nൌͻʹͷʹ\nൗ\nʹʹͻͻ\nଶ ݏ\n\nǤ\nൌ\n\nൌ͵ͳ ܭ՜ ߤൌ͵ ൈͳͲିହ͵ͳ\n\nఊିଵ\n൰\nൌ͵Ǥͳͳ ൈͳͲିହ\nൗ\n\nͳ\nଶൈͳଶ\n͵ͲͲͲ\nAݏ\nReynolds number:\nߩ௧ݑ௧ܦ\nͲǤ\nൌ\nͻʹͷʹ ൈ\nʹ\nൌ\nൌ ǤʹͶ ൈͳͲ\nߤ௧\n͵Ǥͳͳ ൈͳͲିହ\nͲǤͲͶ\nͲǤͲͶ\nൎǤଶൌ\nൌͳǤʹͲͳ ൈͳͲିଷ\nሺͳǤʹͶ ൈͳͲሻǤଶ\nStanton number:\n\nͳǤʹͲͳ ൈͳͲିଷ\n௧ൌʹǤൌ\nିସ\nʹ ൈͲǤͻǤ\nൌǤͶͶ ൈͳͲ\n\nHeat flux at throat:\n\nͳǤʹ\nݍ௪ൌߩ௧ݑ௧ሺെ௪ሻ௧ൌͻʹͷʹ ൬\nൈ͵ͻǤͷ൰ሺ͵ͲͲ െ ͲͲሻൈǤͶͶ ൈͳͲିସ\nͲǤʹ\nݍ௪ൌͷǤͳ ൈͳͲAଶ\nHeat conduction through Copper shell:\n\nݍ௪ൌ\n௪െ௪\nߜ௨\n\nെ\nߜ௨ൌ\nͲͲ െ͵ͲͲ\nൌ͵Ͳ\nൌ͵ǤͶ ൈͳͲିଷAଶ\nݍ௪\nͷǤͳ ൈͳͲ\n\nSo the shell must be less than 3.5 mm thick.\n\n!\"\n! #$$\n% & ' # &()*"
    },
    {
      "category": "Exam",
      "title": "2011 Final Quiz",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/1ca6a489d0cebb85b9b7ce2d4a5819aa_MIT16_50S12_final_quiz.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2011\nQuiz 2 May 18, 2011\n\nTwo hours, open book, open notes\n\nTRUE-FALSE QUESTIONS\nJustify your answer in no more than two lines.\n4 points for correct answer and explanation\n2-3 points for a correct answer with only partially correct explanation\n1-2 points for an incorrect answer with some valid argument\n0 for an incorrect answer with an incorrect explanation, or any answer with no explanation\n\nStatement\nTrue False\n1. For a turbojet, a high\n\ngives a high thermodynamic efficiency at any\ncompression ratio .\n\n2. The pressure ratio of the turbine does not change when the pilot changes the fuel/air\nratio f.\n\n3. If the throat area of a turbojet decreases due to some obstruction, the compressor\noperating line moves closer to the stall line.\n\n4. The bypass ratio of a turbofan engine is fixed by the geometry, and does not change\nwith operating conditions.\n\n5. For a fixed compressor face Mach number , the cowl lip of a subsonic inlet would\nchoke if its area were less than , where is the non-dimensional flow\nfactor.\n\n6. The Euler equation is only valid for ideal, isentropic flow.\n\n7. The stall line on a compressor map can be pre-determined by flow matching conditions\neven before the specific compressor has been selected.\n\n8. In a multi-stage turbine in which each stage has the same isentropic efficiency ,\nthe overall turbine isentropic efficiency is greater than .\n\n9. The nitrogen oxides produced in the primary zone of a jet engine burner are largely\ndestroyed by the cooler secondary air that is injected downstream.\n\n10. A quadrupole made up of four monopoles emits less acoustic power than would each\nof the monopoles separately.\n\nPROBLEM 1 (30 points)\n\nThe design of a certain turbofan engine is such that the turbine inlet temperature at takeoff on a\nstandard day is , and the compressor-face Mach number is\nThe compressor is designed to provide maximum thrust at that condition. A set of\nsuch engines provides the required thrust (including margin) for takeoff of a passenger jet\nplane.\n\nConsider now a \"hot day\" situation for the same plane, with the\nsame load and at the same take-off Mach number. How will the following quantities change\nfrom their design values?:\n\n-\nThrust\n-\nNormalized thrust\n\n-\nNormalized peak temperature\n\n-\nPeak temperature\n-\nNormalized flow rate\n-\nFlow rate\n-\nFuel flow rate\n-\nCompressor pressure ratio\n\nPROBLEM 2 (30 points)\nIn designing one of the identical stages of a compressor, we wish to maximize the stage temperature\nrise , so as to minimize the number of stages, while limiting the stage loading to avoid\nexcessive losses. Assume a 50% reaction design, with the axial velocity w determined by a\ncompressor-face Mach number and an inlet total temperature .\n\na) Show from the Euler equation that high per stage is favored by high wheel spin and\nlow stator exit angle (or, for this design,\n). Assume the wheel speed is as high as\nallowed by hoop stress limitations on the rim (assumed to be self-sustaining, namely, the blade\ncentrifugal pull is compensated by the disk tension). The rim material is a Titanium alloy with\nworking stress , and density . Take the blade ratio\n\n, so that\n\n. Calculate .\n\nb) Draw the velocity triangle and show that the flow turning angle (the angle between and\n, or between\nand\n) increases as decreases. Values of that are too small will\ntherefore lead to excessive blade losses, and possibly to stall. Choose the smallest that keeps\n.\n\nc) With these choices, calculate the temperature rise per stage. How many stages would be required\nto achieve an overall pressure ratio ?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2011 Final Solution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/3be8827e475b21cdd6b9a31e1f017ec1_MIT16_50S12_final_sol.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2011\nQuiz 2 May 18, 2011\n\nTwo hours, open book, open notes\n\nTRUE-FALSE QUESTIONS\nJustify your answer in no more than two lines.\n4 points for correct answer and explanation\n2-3 points for a correct answer with only partially correct explanation\n1-2 points for an incorrect answer with some valid argument\n0 for an incorrect answer with an incorrect explanation, or any answer with no explanation\n\nStatement\nTrue False\n1. For a turbojet, a high ߠ௧ൌ௧ସൗ\n\ngives a high thermodynamic efficiency ߟ\nat any\n\n√\ncompression ratio ߨ.\nOne can have a ௧ସൗ\nwith very small pressure ratio in the cycle. This gives a Brayton\ncycle low efficiency.\n2. The pressure ratio of the turbine does not change when the pilot changes the fuel/air\n√\n\nratio f.\nమሺംషభሻ\n\nళ\n௧ൌቀ\nቁ\nംశభ is fixed by geometry (due to double choking of the flow).\nర\n3. If the throat area ܣ of a turbojet decreases due to some obstruction, the compressor\n√\n\noperating line moves closer to the stall line.\nమሺംబభሻ\nThe compressor operating line is ഥ\nൌళߨ\nଵିఛ\n\nംషభ\n, and ൌቀళ\n\nം\nቁ\nംశభ\nଶ\n. If\nర\nඨ\nర\nగ\nିଵ\nܣ՛,௧՝,ഥଶ՝.\n4. The bypass ratio ߙ of a turbofan engine is fixed by the geometry, and does not change\n\n√\nwith operating conditions.\nIt does not vary with ߠ.\n5. For a fixed compressor face Mach number ܯଶ, the cowl lip of a subsonic inlet would\n√\n\nchoke if its area ܣଵ were less than ഥଶሺܯଶሻܣଶ, where ഥଶ is the non-dimensional flow\nfactor.\nEquate flows when ܣଵchokes: ഥ\nమమ\nଶ\nൌబభ, and since ௧ଶ\n\nൌ, ௧ଶൌ௧,\nඥమ\nඥబ\nഥଶܣଶൌܣଵ\n6. The Euler equation is only valid for ideal, isentropic flow.\n\n√\nIt is a mechanical work balance, so it is not sensitive to non-idealities.\n7. The stall line on a compressor map can be pre-determined by flow matching conditions\n\n√\neven before the specific compressor has been selected.\nThe working line is pre-determined, but the stall line depends on compressor details.\n8. In a multi-stage turbine in which each stage has the same isentropic efficiency ߟ௦௧,\n√\n\nthe overall turbine isentropic efficiency ߟ is greater than ߟ௦௧.\nThe inefficiency ͳ െߟ௦௧ of each stage means that extra heat is deposited in the flow by\neach stage, and the subsequent stages convert some of it to work by expansion.\n\n9. The nitrogen oxides produced in the primary zone of a jet engine burner are largely\n\n√\ndestroyed by the cooler secondary air that is injected downstream.\nThe destruction reactions are very slow.\n10. A quadrupole made up of four monopoles emits less acoustic power than would each\n√\n\nof the monopoles separately.\nThere are partial cancellations between positive and negative monopoles.\n\nPROBLEM 1 (30 points)\n\nThe design of a certain turbofan engine is such that the turbine inlet temperature at takeoff on a\nstandard day ሺͲ ൌʹ ܭaͲ ൌͳݐ is ͳͷͲܭ, and the compressor-face Mach number is\nܯଶൌͲǤͷǤ The compressor is designed to provide maximum thrust at that condition. A set of\nsuch engines provides the required thrust (including margin) for takeoff of a passenger jet\nplane.\n\nConsider now a \"hot day\" situation ሺൌ͵Ͳͷܭa ൌͳݐሻ for the same plane, with the\nsame load and at the same take-off Mach number. How will the following quantities change\nfrom their design values?:\n\nThrust ܨ\n\nNormalized thrust ൌ\nி\n\nమమ\n\nNormalized peak temperature\n\nߠൌ\n௧ସൗ\n\nPeak temperature ௧ସ\n\nNormalized flow rate ഥଶ\n\nFlow rate\n\nFuel flow rate\n\nCompressor pressure ratio ߨ\n\nSame plane weight W, same ܯ, gives same lift L, and assuming same aerodynamic L/D, same\ndrag D. Therefore, same thrust.\nሶ\nሶ\n\nFor the same ܯ and , same ௧, so same normalized thrust.\n\nNow, from lesson 18b, ൌሺߠaܯͲሻ, hence same ߠ:\n\nܨᇱൌܨ\nᇱൌ\nܨԢ\nᇱܣʹ\nൌൌ\nܨ\nݐͲܣͲ\n\nߠᇱൌ௧ସ\nᇱ\nᇱൌߠൌݐͶ\nݐͲ\n\nᇲ\nSince ܯᇱ\nൌܯͲ, బൌ\nᇲబൌ\nଷହ\nᇲ\nᇲ\nൌͳǤͲͷͻ. Therefore,\nరൌ\nబൌͳǤͲͷͻ.\nబ\nబ\nଶ\nర\nబ\n\nThe normalized flow rate ഥଶ , the compressor ratios ߨ , , and the ratio\ndepend\nబ\nexclusively on ߠ, so\n\nNow, ൌഥଶH\nబమ, and so\nඥோబ\nሶ\n\nAlso, ൌ\n\nᇲ\nᇲ\n, so\n\nൌ\nᇱᇱ\nᇲ\nൌ\nబ\n\nబට\nబ\nᇲൌටబ\nబ\nబ\nሶ\nሶ\nሶ\nሶ\nሶ\nሶ\n\nPROBLEM 2 (30 points)\nIn designing one of the identical stages of a compressor, we wish to maximize the stage temperature\nrise οݐ, so as to minimize the number of stages, while limiting the stage loading to avoid\nexcessive losses. Assume a 50% reaction design, with the axial velocity w determined by a\ncompressor-face Mach number ܯଶൌͲǤͷa and an inlet total temperature ௧ൌʹͷͲܭ.\n\na) Show from the Euler equation that high ο௧ per stage is favored by high wheel spin ݎ and\nlow stator exit angle ߚଵ (or, for this design, ߚᇱ\nଶൌߚଵ). Assume the wheel speed is as high as\nallowed by hoop stress limitations on the rim (assumed to be self-sustaining, namely, the blade\ncentrifugal pull is compensated by the disk tension). The rim material is a Titanium alloy with\nworking stress\nݎ\nߪൌ ൈͳͲ, and density ߩൌͶͷͲͲAଷ. Take the blade ratio ுൗݎൌ\nͲǤ , so that ݎൗݎுൌͻA . Calculate ݎ.\nҧ\nҧ\nҧ\n\nAxial velocity: ݓൌܯଶඥߛଶൌܯ\nఊோ\nଶට\nబ\nംషభ\nଵା\nெమ\nమ\nమ\n௧ସ\nᇱൌͳǤͲͷͻ ൈͳͷͲ ൌͳͶܭ\nߨᇱൌߨ\nഥଶ\nᇱൌഥଶ\nሶԢ\nሶൌඨ௧\nᇱൌ\nͳ\nξͳǤͲͷͻ\nൌͲǤͻʹ\nሶ\nᇱ\nሶ\nൌξͳǤͲͷͻ ൌͳǤͲʹͻ\n\nͳǤͶ ൈʹ ൈʹͷͲ\nݓൌͲǤͷඨ\nଶ\nൌ͵ͲͻǤ͵Aݏ\nͳ ͲǤʹ ൈͲǤͷ\nWheel speed: or self-sustaining rim, ߪൌߩሺଶݎଶ\nுሻ, and ݎൌͻA ሺݎሻ, so\nܪ\nͻ\nͻ\nߪ\nͻ\nൈͳͲ\nݎൌ\nݎ\n\nுൌ\nඨ\nൌ\nඨ\n\nߩ\n\nͶͷͲͲ\nҧ\nҧ\n\nEuler equation: ο௧ൌݎሺݎെʹݓ ߚଵሻ\nBecause ݒଵൌݓ ߚଵa ݒଶൌݎെݓ ߚଵ, so ݒଶെݒଵൌݎെʹݓ ߚଵ\nҧ\nҧ\nҧ\nҧ\n\nEuler's equation shows ο௧ increases with ݎ and decreases with ߚଵ, as stated.\n\nb) Draw the velocity triangle and show that the flow turning angle ߜ (the angle between ଵ and\nଶ, or between ᇱ\nᇱ\nଵ and ଶ) increases as ߚଵ decreases. Values of ߚଵ that are too small will\ntherefore lead to excessive blade losses, and possibly to stall. Choose the smallest ߚଵ that keeps\nߜͳͷι.\n\nLet us consider three values of ߚଵ: zero, a medium value, and the maximum that still makes\nݎെʹݓ ߚଵͲ:\nҧ\nҧ\n\nIt is clear that as ߚଵ increases (left to right), ߜ decreases. So, the smallest ߚଵangles give the\nhighest blade loading (most flow turning).\n\nݎҧ ൌͶͳͲǤ Aݏ\n\nIf ߜ is prescribed, what is ߚଵ? We have, from geometry,\nିଵݎെݓ ߚ\nߜൌ\nଵ൰െߚ\nݓ\nଵ\nDefine t = ߚଵ ,\nఠൌ߶:\nିଵͳ\nߜൌ\nെݐ൰െିଵݐ\n߶\nTake the tangent of both sides:\nଵ\nߜൌ\nథെʹݐ\n\nͳ ቀ\nଵ\nథെݐቁݐ\nThis can be rearranged as a quadratic equation for t:\nݐଶ\nͳ\nʹ\nͳ\nെ൬\n\n൰\nെͳ ൌͲ\n߶\nߜ\n߶ ߜ\nWith solution:\nͳ\nͳ\nͳ\nͳ\nݐൌ\n\nേඨ\n\nͳ\nʹ߶\nߜ\nͶ߶ଶ\nߜ\nIn our case, ߜൌͳͷι (using the negative square root, the positive makes ݎെʹݓ ߚଵ൏Ͳ).\nͶͳͲǤ\nͳ\nͶͳͲǤ\nଶ\nͳ\nݐൌ ߚଵൌ\n\nെඨ൬\n൰\n\nʹ ൈ͵ͲͻǤ͵\nͳͷι\nൈ͵ͲͻǤ͵\nଶ\nͳ\nʹ\nͳͷι\nҧ\nҧ\nҧ\n\nNote: This can be also found by direct trial-and-error on\nߜൌିଵͶͳͲǤ\nെ ߚͳ൰െߚ\n͵ͲͻǤ͵\nͳ\n\nc) With these choices, calculate the temperature rise ο௧ per stage. How many stages would be required\nto achieve an overall pressure ratio ߨൌʹͳ?\n\nFor ݎൌͶͳͲǤ Aݏ, ݓൌ͵ͲͻǤ͵\n௦a ߚଵൌʹͷǤͶͶι. Euler gives:\nͶͳͲǤ ሺͶͳͲǤ െʹ ൈ͵ͲͻǤ͵ ൈͲǤͲͶͷሻ\nο௧ൌ\n\nͳͲͲͷ\nሺο௧ሻ௦௧ൌͶǤܭ\nംషభ\nభ\nIf ߨ\nͳ\nം\nൌʹ , ൌߨ\nൌʹͳయǤఱൌʹǤ͵ ͷ\n\nThe number of stages is:\n\nൌ\n௧ሺെͳሻ\nʹͷͲሺʹǤ͵ ͷ െͳሻ\nൌ\nൌǤʹ\nሺο௧ሻ௦௧\nͶǤ\nRounding up:\nҧ\nߚଵൌʹͷǤͶͶι\nൌ\n\n!\"\n! #$$\n% & ' # &()*"
    },
    {
      "category": "Exam",
      "title": "2011 Mid-term Quiz",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/05b9ef72957d47f6ab4031cb2233fb56_MIT16_50S12_mid_quiz.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2012\nQuiz 1 March 18, 2011\n\nOne hour, open book, open notes\n\nTRUE-FALSE QUESTIONS:\nGive an explanation for your answer in no more than 2 lines. For each question,\n\nRight answer, valid explanation\nRight answer, bad explanation\nRight answer, no explanation\nWrong answer, some coherent argument\nWrong answer, no explanation (or bad\nexplanation)\n4-5 points\n1-3 points\n0 points\n1-2 points\n0 points\n\nT\nF\nQ1\nThe larger the weight/thrust ratio of a rocket engine, the higher the optimum\ninitial acceleration of the vehicle.\n\nQ2\nFor a satellite in an elliptical orbit about Earth, the minimum required to\nescape occurs at perigee.\n\nQ3\nThe maximum payload that can be carried over a given with an Electric\nPropulsion thrust system of a fixed specific mass increases with the thrusting\ntime chosen.\n\nQ4\nSince the flow speed at a choked throat is always sonic, and density is inversely\nproportional to temperature, the choked mass flow rate scales as\n\n.\n\nQ5\nA rocket nozzle is pressure-matched on the ground. As the rocket climbs and\nmatching is lost, thrust decreases.\n\nQ6\nIf separation were somehow suppressed in an over-expanded nozzle with\n\n, the thrust would increase.\n\nQ7\nReducing the throat area of a solid propellant rocket increases its thrust.\n\nQ8\nIn an externally heated rocket (like a nuclear or solar thermal rocket),\ndissociation of the gas increases thrust (for fixed chamber temperature and\npressure).\n\nQ9\nIn a chemical (combustion) rocket, dissociation of the gas increases thrust (for\nfixed chamber pressure).\n\nQ10 Frozen flow expansion implies .\n\nQ11 Of the two mechanisms affecting ablative cooling, heat absorption by\nvaporization of the surface material is dominant.\n\nQ12 Jet engines operate fuel-lean in order to maximize specific impulse.\n\nPROBLEM (40% of grade)\n\nIn a LOX-Kerosene rocket the gas-side \"film coefficient\", is estimated to be\n\nwhen the chamber pressure is , the chamber temperature is\n, and the hot-side wall temperature is . The first wall, separating the\ngas from the coolant, is a plate of Copper/Tungsten (thermal conductivity\n. The coolant is the kerosene fuel, and it is estimated to be at when it\narrives at the throat section after cooling the nozzle skirt.\n\na) Calculate the heat flux at the throat.\n\nb) By equating the same heat flux to that crossing the first wall, calculate the cool-side wall\ntemperature .\n\nc) By also equating to the heat flux through the liquid-side boundary layer, calculate the\nrequired liquid-side film coefficient, .\nd) Assuming for the liquid and a specific heat , and taking\nthe liquid-side Stanton number to be , calculate the implied liquid velocity in the\ncooling passages.\ne) (For 10 points of extra credit) If, due to excessive pressure drops, the maximum liquid\nvelocity is , what would be the maximum chamber pressure compatible with these\nconditions?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "2011 Mid-term Solution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/e20c9bd72ae7f54bffec26d5cf09e119_MIT16_50S12_mid_sol.pdf",
      "content": "16.50 Propulsion Systems\nSpring 2012\nQuiz 1 March 18, 2011\n\nOne hour, open book, open notes\n\nTRUE-FALSE QUESTIONS:\nGive an explanation for your answer in no more than 2 lines. For each question,\n\nRight answer, valid explanation\n4-5 points\nRight answer, bad explanation\n1-3 points\nRight answer, no explanation\n0 points\nWrong answer, some coherent argument\n1-2 points\nWrong answer, no explanation (or bad\n0 points\nexplanation)\n\nT\nF\nQ1\nThe larger the weight/thrust ratio of a rocket engine, the higher the optimum\n\n√\ninitial acceleration of the vehicle.\nWith a heavy engine, increasing would reduce payload more than the\nlowered ο would reduce it.\nQ2\nFor a satellite in an elliptical orbit about Earth, the minimum ο required to\n√\n\nescape occurs at perigee.\nThe speed is highest at perigee, i.e. closer to escape velocity.\nQ3\nThe maximum payload that can be carried over a given ο with an Electric\n√\n\nPropulsion thrust system of a fixed specific mass ߙ increases with the thrusting\ntime chosen.\nLong burn time implies lower power, so a lighter power system.\nQ4\nSince the flow speed at a choked throat is always sonic, and density is inversely\n\n√\nproportional to temperature, the choked mass flow rate scales as ͳൗ.\n\nThe other factor is speed of sound, which scales as ඥ so, in the end,\nଵ\n\nඥ\nQ5\nA rocket nozzle is pressure-matched on the ground. As the rocket climbs and\n\n√\nmatching is lost, thrust decreases.\nPressure matching maximizes thrust at fixed , but when is lowered (climb),\nthrust increases.\nQ6\nIf separation were somehow suppressed in an over-expanded nozzle with\n\n√\nൗ\n൏ͲǤͶ\n\n, the thrust would increase.\n\nSuppressing separation would re-introduce suction near the exit plane, reducing\nthrust.\nQ7\nReducing the throat area of a solid propellant rocket increases its thrust.\n√\n\nሶ\n\nభ\nቀ\n\nభ\nష\n\nכቁ\nభష and ܨܣכܣכఒି\n\nభషൌܣכభష\nSo, less ܣכ, more thrust.\nQ8\nIn an externally heated rocket (like a nuclear or solar thermal rocket),\n√\n\ndissociation of the gas increases thrust (for fixed chamber temperature and\npressure).\nIf is fixed, dissociation allows addition of extra heat, part of which is\nconverted to jet velocity.\nQ9\nIn a chemical (combustion) rocket, dissociation of the gas increases thrust (for\n\n√\nfixed chamber pressure).\nIn this case, there is no extra heat to be had, so dissociation lowers . Even if\nthe heat of dissociation is recovered in the expansion, it is recovered at lower P.\nQ10 Frozen flow expansion implies ߛൌݏݐݐ.\n\n√\nThe of each component species still changes with T, so even at constant\ncomposition ߛൌߛሺሻ.\nQ11 Of the two mechanisms affecting ablative cooling, heat absorption by\n√\n\nvaporization of the surface material is dominant.\nRelatively little gas is generated at the surface, so its effect on ௧ is fairly small.\nThe main effect is the heat absorbed in the decomposition.\nQ12 Jet engines operate fuel-lean in order to maximize specific impulse.\n\n√\nThey operate lean to protect the turbine.\n\nPROBLEM (40% of grade)\n\nIn a LOX-Kerosene rocket the gas-side \"film coefficient\", ؠ ݍ௪Aሺെ௪ሻ is estimated to be\nͳǤͶ ൈ\nଵరௐ\nమAܭ when the chamber pressure is ൌͳͲͲݐǤ, the chamber temperature is\nൌ͵͵ͲͲܭ, and the hot-side wall temperature is ௪ൌ ͲͲܭ. The first wall, separating the\ngas from the coolant, is a ʹ plate of Copper/Tungsten (thermal conductivity ൌ\n͵ͲͲAAܭ. The coolant is the kerosene fuel, and it is estimated to be at ൌͶ͵Ͳܭ when it\narrives at the throat section after cooling the nozzle skirt.\n\na) Calculate the heat flux ݍ௪ at the throat.\n\nݍ௪ൌሺെ௪ሻൌͳǤͶ ൈͳͲସሺ͵͵ͲͲ െ ͲͲሻൌ\n\nb) By equating the same heat flux to that crossing the fi\ntemperature ௪.\nሺ\nെ\nሻ\nߜ\nݍ௪ൌ\n௪՜\nߜ\n௪ൌ௪െ\nݍ\n\nݓൌʹൈͳͲെ͵\nቀ\n͵ͲͲ\n͵Ǥͷ ൈͳͲቁൌ\nrst wall, calculate the cool-side wall\n͵Ǥͷ ൈͳͲAଶ\nͷܭ\n\nc) By also equating ݍ௪ to the heat flux through the liquid-side boundary layer, calculate the\nrequired liquid-side film coefficient, .\n\nݍݓൌሺݓെሻ՜ൌ\nݍݓ\nݓെൌ͵ǤͷൈͳͲ\n\nͷെͶ͵Ͳ ൌ\n\nd) Assuming for the liquid ߩൌ ͲͲAଷ and a specific heat ൌͳͻͲͲܬAAܭ, and taking\nthe liquid-side Stanton number to be ͲǤͲͲͳͷ, calculate the implied liquid velocity ݑ in the\ncooling passages.\nൌߩݑሺݐሻ\nݑൌ\nଶǤହൈଵఱ\nൈଵଽൈଵǤହൈଵషయൌ\n\ne) (For 10 points of extra credit) If, due to excessive pressure drops, the maximum liquid\nvelocity is ͲAݏ, what would be the maximum chamber pressure compatible with these\nconditions?\nǤ\nFrom Bartz's equation, ݍ௪ሺሻǤ, so ݍ\nൌ͵Ǥͷ ൈͳͲቀ\n\nଵቁ\n\nǤ\nǤ\n௪ൌ ͲͲ െ\nǤଶሺ\nଷ\n͵Ǥͷ ൈͳͲሻቀ\n\nଵቁ\nൌ ͲͲ െʹ͵͵ ቀ\n\nଵቁ\n\nWith ݑൌ Ͳ\n\n௦a\n\nǤ\n͵Ǥͷ ൈͳͲ ൬\n\nǤ\n൰\nൌቆ ͲͲ െʹ͵͵ ൬\n൰\nെͶ͵Ͳቇ\nͳͲͲ\nͳͲͲ\n\nൌ ͲͲ ൈ Ͳ ൈͳͻͲͲ ൈͳǤͷ\nͳͲିଷ\n\nǤ\nൈ\nቆ͵Ͳ െʹ͵͵ ൬\n൰\nቇ\nͳͲͲ\nǤ\n͵Ǥͷ ൈ\n\nͳͲ ൬\n൰\nൌͳǤ ʹͷ ൈͳͲହ\n\nǤ\nቆ͵Ͳ െʹ͵͵ ൬\n൰\nቇ\nͳͲͲ\nͳͲͲ\n\nǤ\n\nͳǤ ʹͷ ൈͳͲହൈ͵Ͳ\n൰\nൌ\n\nͳͲͲ\n͵Ǥͷ ൈͳͲͳǤ ʹͷ ൈ\nହ\nൌͲǤ ͳ\nͳͲ ൈʹ͵͵\n\nʹǤͷ ൈͳͲହ\nௐ\nమ\nͳͳʹAݏ\nൌ ͶǤʹݐ\n\n!\"\n! #$$\n% & ' # &()*"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/aae531b188bc97d45407b2c4303940e5_MIT16_50S12_lec1.pdf",
      "content": "16.50 Lecture 1\n\nSubjects: Rocket Equation; Gravity Loss; Optimum Acceleration.\n\n1) Rocket Equation\n\nA rocket is a propulsive device that produces a thrust force F on a vehicle by ejecting\nmass a high relative velocity c. This force is simply equal to the rate of momentum\noutflow from a control volume that encloses the vehicle. If m! is the mass expulsion rate,\nwe then find\n\nF = m\n.\nc\nThis is a particularly useful result because c and m\n.\nare insensitive to the operating\nenvironment of the rocket. In more detail, c is not necessarily the velocity of the expelled\nmass as it leaves the rocket's exit plane, because the pressure field may continue\naccelerating this mass for some distance. In that case, c represents the limiting \"far field\"\nvelocity of the ejected mass.\n\nFor a rocket-powered vehicle in a vertical launch from the Earth,\nm dv = !c dm ! mg \" dv = !c dm ! gdt\ndt\ndt\nm\n\nv\nt\n= !\" c(h) dm\nt\n!\n\"0 g(h)dt; h\nt\n=\nvdt\nm\n!0\nAs indicated, both c and g are functions of h. In the case of c, the dependence is through\nthe atmospheric pressure, p0, an effect we will explore in detail later. The atmospheric\npressure varies with weather and with temperature, but a rule of thumb is:\np\nr r\n\n!\n= e\n!\nE\n6.68 r - rE = km\np0(rE)\nIn fact the pressure variation is much more important in the context of aircraft engines,\nwhose thrust is essentially proportional to the atmospheric density, other factors being\nequal.\nThe gravitational attraction varies as g(r) = g (r\nE\nE/r)2\n\n, where rE is the Earth's radius, r =\n+ h and gE is the gravitational acceleration at the Earth's surface. Since rockets\ntypically operate for a short time only, g may be taken here as a constant to a good\napproximation.\nIf as a first approximation we take c and g constant we can integrate the rocket equation\nto get:\n\nv ! v\nm(t)\n0 = !c ln\n! gt\nm0\nand this is the usual form of the Rocket Equation. Remember that it applies to a vertical\nlaunch. For other flight paths the last term changes. Also remember that we have\nneglected atmospheric drag forces (this last approximation is valid for large rockets, but\nmay not be for smaller vehicles, which have more area per unit volume).\n2) Gravity Loss & Optimum Acceleration\nAs we will see, it is helpful to express this relation as one for the mass ratio in\nterms of the velocity change, since it is the latter that is set by the mission, e.g. launch to\nLEO. But this leaves gt to be determined. If we make the additional assumption that m\n.\n= constant, then\nm\nm(t)\nm\n.\nt\nF t\nm0a0\n0 !\n=\n=\n=\nt\nc\nc\nwhere a0 is the \"initial acceleration\", defined as the thrust divided by the initial mass.\nNote that a0>g for achieving takeoff.\nSo now we can eliminate t, to find\nv ! v0\nm(t)\ng \"\nm(t) %\n= !!n\n!\n1 !\nc\nm\na $\n0 #\nm\n'\n0 &\nrE\n\nThis is an (implicit) equation for m(t) in terms of v ! v0 , with the initial acceleration a0\nm0\nc\nas a parameter.\n\nThe last term is often termed the\"gravity loss\", since it is the reduction in velocity\nincrement that the vehicle suffers due to the (downward) acceleration of gravity. As a0\nincreases, the gravity loss decreases, since the time over which gravity acts is reduced. So\nwhy not use a very large a\nv ! v\nm(t)\n0 to get the largest possible\n0 for a given\n? To see\nc\nm0\nwhy we must examine the effect of the acceleration on the mass of the propulsion system.\nWe divide the mass of the rocket into parts:\nm0 = mstruct + meng + mpay + mprop\nWhen all the propellant has been expended, at the time tb, m(tb) = mstruct + meng + mpay, or\nas a fraction of initial mass\nm(tb)\nm\n=\n0 ! m prop = 1\nm\n!\nprop \" 1! m'\n\nm0\nHere the prime on the propellant fraction indicates that it is divided by m0, i.e. is the\nfraction of the initial mass represented by the propellant.\nClearly, the smaller m(t) or the closer m' prop is to 1, the larger the v ! v0 that can be\nm0\nc\nachieved. But the limit is set by:\nm(tb) =1 ! m'\nm\nprop= m' struct +m' eng +m' pay\nWe want to design the components of our vehicle so that m'struct and m'eng are as small as\npossible, given the loads and available technology.\nThe engine mass is proportional to the thrust it develops; define\nEngineWeight\nm\ng\nm\nm\"\n! =\n=\neng\n=\neng\n=\neng\nThrust\nF\nm0(a0 / g)\nn\nwhere we call for short a0/g=n. Notice that this is the number of \"g's\" due to thrust only,\nwhile the more commonly used g-number (the specific downwards force felt by a pilot)\nincludes gravity and would be n+1.\n\nWe now have m!(tb) = m!pay + ms!tr + n\" , and the rocket equation becomes\n1! m\"\n! m\"\nvb ! v0 = !cln(m\"pay + ms\"tr + n#)! (\npay\nstr !#)\nn\nm\nm\nprop\n\nWe notice here that the logarithmic term (the ideal velocity increment) decreases with n\n(heavy engine), but the last parenthesis (the gravity loss) decreases with n (reduced burn\ntime). We can optimize the choice of initial acceleration by differentiating wrt. to n:\n\n\"\n1! m#\n!\n+\npay ! ms#tr = 0\nm#\ns#\npay + m tr + n\"\nn\nwhich is a quadratic equation with the solution\n\n1! m\"pay ! ms\"tr\n1! m\"pay ! ms\"tr\n(m\"pay + ms\"tr)(1! m\"\n\"\n\nnopt\n+\n(\n) +\npay ! m\n=\nstr)\n#\nSome reasonable estimates are:\nm'struct ! 0.1 ;\n! = 0.02\nFor these values, Fig. 1 shows how the actual velocity increment varies with n=a0/g for a\nrange of payload fractions. The optima are clearly visible, and can be obtained from the\ngraph or calculated from our quadratic solution. These nopt values, and the associated\nmaximum velocity increments, are shown in Fig. 2. Interestingly, n varies little, and\nstays in the range from 3 to 4, familiar to astronauts. The velocity inc\nopt\nrement is usually set\nby the mission requirement, e.g. to get to LEO, and Fig. 2 illustrates how small the\npayload fraction becomes if this required velocity increment exceeds the jet velocity c (in\nfact, for this example, m0! = 0 for (v ! v0) ! 1.5 )\n\nThis optimization has considered only the effects of the \"gravity loss\" and the engine\nweight on the choice of a0 . If we include other effects, such as drag, we may get a\ng\ndifferent answer. A large value of n implies reaching high speeds at low altitudes, where\nair density is still high, and for small rockets this would generate large drag losses.\n\nFig. 1\n\nFig. 2\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/8c272e14e6e30005e832430f022bb0ad_MIT16_50S12_lec2.pdf",
      "content": "16.50 Lecture 2\n\nSubjects: Rocket staging; Range of aircraft; Climb & Aceleration\n\n1) Rocket Staging\n\nThe reason for staging is to avoid having to accelerate empty tanks. Assume for\nsimplicity only two stages; one does not want to stage either too early (and then carry a\nheavy second stage tank) or too late (and carry a heavy first stage tank for a long time). It\ncan be shown that for ideal symmetrical stages (same specific impulse, same structural\nfractions), the velocity increment should be divided equally between the stages, and this\nis a good first cut for more general cases.\n\nIn its simplest form, staging consists of just replacing the payload of the first stage by a\ncomplete second stage, which in turn has its own payload, as shown in the sketch.\n\nWe go back to the rocket equation, and neglect gravity losses. Write for short ! = ms\"tr ,\nand assume this structural fraction is the same for both stages (in each case the structural\nmass is normalized by the initial mass of that stage); assume also that the jet velocity c is\nthe same for both stage engines (although typically the first stage engine will be larger\nand have a bigger thrust). The final payload is given by\n\n(mpay)2 = (m'\npay)2(m0)2\nand we also have\nV\n\n(\n\"\nm0)2 = (m f )1 ! (mstr)\n1 = (m )1(e\n! c\n! #)\nSchemat\nic show\ning rocket staging.\nImage by MIT OpenCourseWare.\n\n#V\nand\n\n(m\n!pay)2 = (m!\nt )\nc\nf )2 \" (ms!\n\"\nr\n2 = e\n\" $\n\nBut the total velocity increment !V = !V1 + !V2 is prescribed, and so we obtain\n\n(mpay)2 = (\n\"V\ne\n!\n\"V!\"V\nc ! #)(e\n!\nc\n! #)\n\n(m0)1\n\n\"V\n\"V\n\"V\n(\n!\"V\n= e\n!\n! # e\n!\nc + e\n!\nc\nc\n)+ # 2\n\nIt is easy to se that this is maximum when !V1 = !V \" !V1, i.e., when !V2 = !V1. If this\nstaging is selected, the overall payload fraction is\n\n(m\n)\n\"V\n\n(\npay 2 )\n= (e\n! 2c\nm0)\nopt\n! #)2\n(\nThis derivation can easily be extended to N>2 stages, but things are more complicated if\nthe structural fractions or the jet velocities are different among stages.\n\nRange of Aircraft\n\nFor aircraft, the simplest measure of performance is cruise fuel consumption and\nthe resulting range. At one time this was also the critical performance measure for\ntransports, bombers and fighters. This is less true now for transports because the ranges\naccessible with modern engines and airframes are in the order of 8,000 miles. For\nbombers aerial refueling extends the range to the extent that again range is no longer such\na challenge (although refueling is quite expensive). Range is still important for fighters\nbecause the requirements for high speed and maneuverability conflict with those for long\nrange.\n\nConsider an aircraft in straight, level flight\n\nF = D\nL\nmg\n=\n=\n\nL / D\nL / D\n\nWe define the Specific Impulse by:\nF = gI m\n.\nwhere m\n.\nis the fuel mass flow, so that m\n.\ndm\n= -\n. Note that the inverse of I is the\ndt\n'Specific Fuel Consumption, SFC, in appropriate units. From this definition and the force\nbalances we obtain\nmg\ndm\n= !gI\nL / D\ndt\ndm\nD\n= !\ndt\nm\nLI\nIf we assume D/L and I are constant (Here we are implying models for both the\npropulsion system and the aircraft), then\nm(t)\nD\n!n\n= !\nt\nm0\nLI\nThe range R = u0t where u0 is the flight velocity, so\nL\nm\nR = u0I\n!n\nD\nm(R)\nwhere m(R) is the aircraft mass at the range R. This is the Breguet Range Equation.\nAs in the case of the rocket, it is useful to divide the mass m0 into structural,\npayload, engines and fuel:\nm0 = mstruct + meng + mfuel + mpay\nor\n1 = m\n'\nstruct + m\n'\neng + m\n'\nfuel + m\n'\npay\nIf the fuel is expended at R,\nm(R) = m\n'\n+ m\n'\n+ m\n'\n=\nm\nstruct\neng\npay\n1! m\n'\nfuel\nFor a fixed m\n'\nstruct and m\n'\neng, we can trade off between m\n'\n'\npay and m fuel , hence between\nRange and Payload. If we define:\nm\n'\nempty = m\n'\n+ m\n'\nstruct\neng\n\nwe can write\nm(R) = m\n'\nm\nm\nempty +\n'\npay\nand\nR = u0I L !n\nD\nm\n'\nempty + m\n'\npay\nfrom which\nR\nm\n'\npay = e\n!U 0I(L/D) ! m\n'\nempty\n(quite similar to what we obtained for a rocket).\nFrom this we can construct a Range vs. Payload chart. As an example, suppose\nm\n'\nempty = 0.7;\nu0I L = (300 m)(4000s)(15) = 1.8x107m\nD\ns\nR(km)\nm\n'\npay = e\n!\n1.8x10\n4 ! 0.7\n0 0\n'\nmpay\nR(km)\n1.8 x 104\nNote this is not a straight line, although it is close.\nClimb & Acceleration\nSometimes we are more interested in climb and maneuver rather than cruise, as\nfor fighter aircraft. Then an Energy Approach is most helpful.\n.1\n.2\n.3\n.357\n.4\n.3\n\nSuppose the aircraft is climbing at angle ! from the horizontal. The equation of motion\nalong the path is\nm du0 = F ! D ! mgSin\"\ndt\nu du0\n(F ! D)u0\n=\n! gu\ndt\nm\n0Sin\"\nbut\nu0Sin\ndh\n! =\n, so it follows that\ndt\ng dh + u du0\n(F ! D)u0\ndE\n=\n\"\ndt\ndt\nm\ndt\nWere we define a Total Energy E\ngh\nu 2\n=\n+\n0 per unit mass.\nIf we had a simple model for F and D as a function of u0 and h we could integrate this as\nwe did for the rocket. But, as we shall see later in the semester these dependencies are\nmuch more complex for the aircraft engine than for the rocket. Thus for the two classes\nof engine we have these quite different thrust characteristics:\nRocket Engine\n- Nearly independent of its environment, atmosphere and speed.\nAircraft Engine\n- Strongly dependent on flight speed and atmosphere.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/ed0c2e057d08d0d954a206a622962b3c_MIT16_50S12_lec3.pdf",
      "content": "16.50 Lecture 3\n\nSubjects: Orbital mechanics; Single force center\n\nThe most usual application of rocket engines is to propel vehicles under conditions where\nthe behavior of the vehicle is largely determined by the gravitational attractions of one or\nmore bodies of the solar system, and where aerodynamic drag is not very important. So it\nis essential to understand the behavior of an orbiting body in order to appreciate the\nrequirements which must be met by the rocket engine. For this reason we shall spend a\nshort time discussing orbital mechanics. It should be noted, however, that the intent is to\npresent only the aspects that define the requirements for propulsion systems, not to\ndiscuss the details of orbital computations. For these the student should refer to a text on\ncelestial mechanics or spacecraft guidance.\n\nForces between bodies. The planetary Sphere of Influence\n\nThe gravitational attraction between two bodies of masses m and M is given by\n\nQ = GmM 1\nr\nwhere G = 6.67x10-11m3 kg-1 s-2, and r is the distance between the bodies. The\ngravitational acceleration is then f = GM / r2 ! μ / r2 , where μ=GM is the gravity\nconstant of the body with mass M.\n\nWe are interested in the motion of a small body (spacecraft) in the force fields of one or\nmore larger bodies. If we consider the Sun and two or more planets, the problem is\nextremely difficult mathematically. For our purposes, it can be simplified immensely by\nconsidering the motion of the spacecraft under the influence of only the dominant\nattractor at any given time. On the interplanetary scale, this means the Sun most of the\ntime, but near enough one of the planets (inside its \"Sphere of Influence\", SOI), the\nplanet will dominate. To estimate correctly the radius of the SOI, one should work in the\nframe of reference of the planet. The gravitational acceleration of the planet alone on the\nS/C is fp,SC, and the perturbation due to the Sun of the spacecraft acceleration with respect\nto the planet is fS,SC-fS,p. Conversely, the gravitational acceleration of the Sun alone on the\nS/C is fS,SC, and the perturbation due to the planet of the spacecraft acceleration with\nrespect to the Sun is fp,SC-f , which, since the distance to the Sun is much greater that that\nto the SC, is almost equal t\np,\no f\nS\nalone. We now state that the relative errors in ignoring\neither of the two perturbations\np,\nSCare the same on the SOI:\n\nfS,SC ! fS,p\nf\n!\np,SC\nf\n!\np,SC\n\nfp,SC\nfS,SC\nfS,p\n\nThe difference on the left hand side numerator is approximated to first order as\n\n\" f\nf\n,\nS,SC ! f\nS\nrp SC\nS,p !\nr\nr\np,SC = 2μ\n\"\nS r3\nS,p\nSubstituting this and the other accelerations into the SOI definition, and rearranging, one\nfinds rSOI (= rp,SC) to be given by\n\nrSOI\n!\nrS,p\n21/5 (M p )2/5\nM S\n\nSince Mp/MS is a small number, r\n/r <<1. We can therefore model the relative body\nmotion near the planets (r<r\nSOI\nS,p\nSOI) as being under the influence of a single force center (the\nplanet), while the body and the planet experience a common acceleration toward the Sun.\nFar from the planet (r>r\n) we ignore its field and consider the body motion as influenced\nonly by the Sun. For pre\nSOli\nIminary calculations, these limiting models are simply \"patched\"\nat the SOI.\n\nTo see how far from a planet is far, we refer to Table 1-1, which gives the ratios of the\nplanet's mass to that of the Sun and the size of hteir spheres of influence.\n\nTable 1-1\n\nRelative mass Orbital Radius, km\nrSOI (Km)\nMercury .167 x 10-6 .578 x 108\n98,000\nVenus .245 x 10-5 1.08 x 108\n536,000\nEarth .300 x 10-5 1.49 x 108\n791,000\nMars .324 x 10-6 2.27 x 108\n501,000\nJupiter .956 x 10-3 7.77 x 108\n41.6x106\nSaturn .286 x 10-3 1.42 x 109\n47.3x106\nUranus .437 x 10-4 2.86 x 109\n44.9x106\nNeptune .518 x 10-4 4.49 x 109\n75.5x106\nPluto .28 x 10-5 5.89 x 109\n30.8x106\nEarth's Moon, M /M =.368 x 10-7 r\n=.384 x 106\n\nM\nE\nE,M\n57,600\nWe see for example that the sphere of influence of the Earth is just about twice the\ndistance to the Moon. On one hand this means we can just barely ignore solar\nperturbations in considering cis-lunar operations not very near the Moon, but also that the\nMoon's own motion about the Earth must be appreciably affected by the Sun's attraction.\nNotice also the relatively large size of the SOI of the Moon in the Earth-Moon system\n(15% of the Earth/Moon distance).\n\nWe can therefore reduce the complex many-force center situation to a set of simpler ones,\nnamely\n\na) Motion in the single force field of a planet\n\nb) Motion in the single force field of the Sun\n\nc) Transition from a Sun-dominated to a planet dominated situation, or vice\nversa. As we shall see this transition can be thought of as a change of coordinate system.\n\nMotion under a Single Force Center\n\nThe subject of motion under a single gravitational attractor is covered in all Dynamics\ntextbooks, and so we only give here a summary of the main conclusions and working\nequations.\n\nc=aε\na(1-ε)\np\nr\n\nπ-θ\n\nWith reference to the figure, the polar equation of the trajectory is r =\n,\n1+ ! cos\"\nwhere p = a(1! \" 2) , ε is the eccentricity and a is the semi-major axis. If ε<1, all the\nquantities listed are positive and the trajectory is closed (an ellipse with a focus at r=0).\nThe case when ε>0 will be discussed later. The quantity p is called \"the parameter\", and\nhas the significance shown in the figure. The minimum and maximum radii are called the\n\"periapsis\" and \"apoaxis\", respectively (perigee and apogee for orbits around Earth); they\nare given by\n\nr\np\np =\n= a(1\" !);\nr\np\na =\n= a(1+ !)\n1+ !\n1\" !\nThe potential energy per unit mass, with zero at infinity, is Ep = !μ / r .\n\nThe two constants of the motion are:\n(a) The total energy per unit mass,\n\nE\n=\nv2\nμ\nμ\n!\n= !\n\nr\n2a\n(b) The angular momentum per unit mass,\n\nh = r2!! =\nμp =\na(1\" # 2)\n\na3/2\nThe time to complete one orbit is\n\nT = 2!\n\nμ\nUsing the conservation of energy, the velocity magnitude is given by the so-called \"vis-\nviva\" equation:\n\nμ\nμ\nv =\n!\n\nr\na\nThe circular orbital velocity (r=a) is therefore\n\nμ\nμ\nvc =\n=\n\nr\na\nNotice that the kinetic energy in a circular orbit is EK = μ / 2a = !E = !1/ 2Ep . More\ngenerally, the average kinetic and potential energies satisfy these same curious\nrelationships for any elliptic orbit.\n\nThe trajectory first becomes open when ε=1, r tends to infinity, and the total energy\nbecomes zero. When this happens, the body is\na\non a trajectory to barely \"escape\" the\nattractor, arriving at infinity with zero velocity. The velocity on this trajectory depends on\ndistance as\nμ\nvesc =\n.\nr\nAs a final note, the apogee and perigee velocities occur frequently in orbital calculations.\nThey are related to the apogee and perigee radii by\np\n\nμ\nr\n\nμ\nr\nvp =\na\n> v\n;\nv =\np\n< v\n\nr\nc\np ra + r\n,p\na\np\nra ra + r\nc,a\np\nAlthough the formulation in terms of the classical \"orbital elements\" a, ε, p, etc, is\nstandard, most simple problems can be solved quickly by using the energy and angular\nmomentum conservation laws between judiciously selected points, often the apogee and\nperigee themselves.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/ef7a14782dfa20ad3abeefb779c02fe5_MIT16_50S12_lec4.pdf",
      "content": "16.50 Lecture 4\nSubjects: Hyperbolic orbits. Interplanetary transfer.\n(1) Hyperbolic orbits\nThe trajectory is still described by\np\nr =\n, but now we have ε>1, so that the\n1+ ! cos\"\nradius tends to infinity at the asymptotic angle !\" = # $ cos $1(1/ % ).\nThe \"parameter\" p still has the geometrical significance indicated in the figure, and is\ntherefore a positive number. It is still related to a and ε through p= a(1! \" 2 ) , but now a\nis a negative number, so it is (-a) that has a geometrical significance, as indicated in the\nfigure. Note also tat ε is still defined as the ratio of the distance from periapsis to center\nto the distance from focus to center.\nThe energy is still given by\nE =\nv\nμ\nμ\n!\n= !\n, and is now positive. The angular\nr\n2a\nmomentum is still given by h = r2!!\n\n=\nμp =\na(1\" # 2) .\nThere are a few new parameters of interest in this case:\nThe trajectory deflection,\n! = \" # 2(\" #$\n#\n% ) = \" # 2cos\n= 2sin\n#1\n&\n&\n\nθ\nθinf\n-a\nδ\np\nΔ\nr\n-aε\n\nThe miss distance\np\n! = \"a# sin($ \"% & ) = \"a# sin% & =\n# 2 \"1\nThe excess hyperbolic velocity,\nμ\nv! =\n2E =\n(\"a)\nIn the specialized technical literature, the term \"c3\" is often used, meaning simply v2\n! .\n2) Interplanetary transfer\nWe assume for the moment that our craft has \"escaped the field of planet 1\" (meaning it\nis outside its sphere of influence), and so may be considered to be in orbit about the Sun.\nIn order for it to reach planet 2, its orbit about the Sun must intersect that of planet 2.\nAssume that the planetary orbits are circular. Then it is clear that the trajectory of least\nenergy which will allow the transfer is that which is just tangent to the orbits of the home\nand target planets; this is called the Hohmann transfer orbit, which is the half-ellipse that\nis sketched in the figure. The Heliocentric velocity at the start of this Hohman arc is the\nperiapsis (perihelion in this case) velocity, as described at the end of the last lecture:\nμ\nvp1 =\nS\n2r2\nr1 r1 + r2\nr1\nr2\nr2\nP1 at\nlaunch\nP2 at\nlaunch\nSun\nP1 and P2\nat arrival\n\nso that if we launch the ship in the direction of motion of the planet, it must have a\nrelative velocity\nμ\nvrel ,1 =\nS\n2r\n(\n!1)\nr1\nr1 + r2\nwith respect to planet 1 after escape from the planet. By definition, this is the \"excess\nhyperbolic velocity\" relative to the planet, v 1, and the total energy relative to planet 1 at\nhe edge of the sphere of influence is simply\ninf\n1⁄2( v\ninf1) .\nSuppose the launch was for the surface of planet 1 (radius R ), and ignore its rotation.\nJust after launch, during which the rocket has imparted an ins\ntantaneous velocity\nincrement ΔV1, the energy per unit mass (relative to the planet) is\n(!V\nμ1\n1) \"\n, and this\nR1\nmust be the same as 1⁄2( vinf1)2, by energy conservation with respect to planet 1 inside the\nsphere of influence. We then have\nμ1\n1 μ\n(!V) \"\n=\nv =\nS\n2r\nR1\n#1\n(\n\"1)\n2 r1\nr\nfrom which the first delta-\n1 + r\nV delivered by the rockets must\nbe\n!V\n2μ\n=\nμ\n+\nS\n2r\n(\n\"1)2\nR1\nr1\nr1 + r2\nThe procedure is similar when considering the approach to planet 2. The spacecraft will\nhave then a heliocentric velocity equal to the apoaxis (apohelion) velocity\nμ\nva2 =\nS\n2r1\n\nr r + r\nand a relative velocity with respe\nc\nt to t\nhe planet\nμ\nvrel ,2 =\nS\n2r\n(1!\n)\nr\nr + r\nwhich is also the excess hyperbol\nic veloc\nity w\nith respect to planet 2. It is worth noting a\nthis point that the spacecraft heliocentric velocity is less than that of the planet itself, so\nthat, as seen from the planet, the spacecraft will be approaching from its advancing side.\nFor capture into a circular orbit of radius Rc2, the geometry is shown below:\nTo Sun\nVrel,2\nΔV2\nrc,2\n\nJust before the insertion rocket firing, the energy per unit mass relative to planet 2 is\nequal to 1⁄2 (vrel,2)2, and it is also equal to the sum of the kinetic energy at that point of\nclosest approach, plus the potential energy:\n(vclosest app.)2\nμ\n!\n2 . Thus we must have\nrc2\nμ\nv\nμS\n2r\n=\n+\n(1!\n1 )2\nclosest app.\nrc2\nr2\nr1 + r2\nand the insertion velocity increment must be this, minus the orbital velocity around planet\n2:\n2 μ2\nμS\n2r\n(1\n1 )2\nμ\n!V2 =\n+\n\"\n\"\nrc2\nr2\nr1 + r2\nrc2\nComparison to simple Escape+Transfer+Capture.\nA simple-minded approach to the same mission would be to first apply an impulse at the\nsurface of planet 1 to achieve escape ( !V\nzero velocity with respect to planet 1, apply a second impulse to enter th\nesc,1 =\n2μ1 / R1 ), then, after slowing down to\ne elliptic transfer\norbit towards planet 2 (this would be our v\n,1 ), then, in the vicinity (but still outside the\nSOI of ) planet 2, apply a third impulse to m\nrel\natch the heliocentric velocity of planet 2 (this\nwould be our v\n,2 ), and finally, starting from zero relative velocity \"far\" from planet 2,\napply a fourth impulse to capture the craft into orbit about planet 2 (this is equal to the\nrel\nescape velocity from a distance R2 to the planet, !Ve\n,2 =\n2μ2 / R2 ). You can easily\ncheck that the two impulses we derived before are, res\nsc\npectively,\n!V1 =\n(!Vesc,1)2 + (v\nrel,1)\n!V2 =\n(!V\nsc,2)2\ne\n+ (vrel,2)\nand so our previous scheme is definitely more effective. These two strategies are called\nsometimes the Hohmann (simple, four impulses) and the Oberth (combined, two\nimpulses) maneuvers.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/e4cb87941e69943d0040f995fd88f45b_MIT16_50S12_lec5.pdf",
      "content": "16.50 Lecture 5\nSubjects: Non-Chemical rockets; Optimum exhaust velocity\n1) Non-chemical rockets\nA shared characteristic of all non-chemical propulsion systems is that the energy and\npropellant mass are separate initially\nChemical\nChemical\nEnergy\nmass\nmc\n.\nNon-chemical\nEnergy\nSource\nPropulsive\nMass\nm\n.\nm\n.\nc\nmc\n.\nThere are several possible energy sources:\n1) Solar\na) Photovoltaic\nb) Solar thermal\nc) Solar pressure\n2) Nuclear\na) Fission\nb) Radioisotope\nc) Fusion?\nThere are also many ways to bring the mass and energy together to produce thrust, but all\nbehave according to the rocket equation.\nm\n\"V\nfinal = e\n! c\nmtot\nor breaking the final mass into its constituent parts,\n\nm\n\"V\npay\n!\nmpropsys + m\n= e\nc !\nstruct\nmtot\nmtot\nThere are 2 general categories of systems, Thermal and Electrical, separable according to\nwhether the energy is available in electrical or mechanical form, or only as thermal\nenergy at some limiting temperature.\nA. Thermal\nHere the energy is used directly to heat the propellant, which is then expanded\nthrough a nozzle to produce thrust.\nC\nTc\nEnergy\nPropellant\nNow there is a chamber temperature Tc, limited by the energy source, and the exhaust\nvelocity is given approximately by:\nc2\ncpTc =\nor\nc !\n\"\nR\ncpTc !\nT\n\" #1 M\nc\nWhat limits Tc?\n1) Source Temperature e.g. Tsun = 6000°K\n2) Materials\nSo for these we generally want low M, e.g., H2 ! 2H. For a nuclear thermal rocket\nH2\ngraphite\nc\nT <~ 3000°K\nc < 8500 m/s\nFigures of merit are:\na) Specific impulse, c;\nb) Thrust per unit mass,\nF\nmengg\n\nB. Electrical\n\nIf the energy is available in electrical form, then there is no limit in principle on c (other\nthan the speed of light) and in practice we can achieve very high c with good efficiency\nby using any of a number of electrical accelerators.\nThe system requirement is to produce a ΔV on a payload, mpay. In the absence of gravity\nm\nloss,\n\"V\nfinal = e\n! c , so why not make it very close to 1 by increasing c? To see the answer\nmtot\nwe must analyze the whole system, and take account of the mass of the energy source.\nm\n.\nm, c\n.\nm\nmpay\nmelect\nP\nm accel\npropellant\nThe total mass of the system can be broken out as:\nmtot = mpay + melect + mprop + meng + mstruct\nso that ratio of final mass to initial mass is\nm\n\"V\nfinal\n!\n+\nc\nmpay\nmelect + meng + m\n= e\n=\nstruct\nmtot\nmtot\nThe Figure of Merit for such a system is\nm\n\"V\npay = e\n! c\nm\n!\nelect + meng + mstruct\nmtot\ntot\nLet us neglect meng + mstruct for the moment, compared to m\nm\n+ m\nelect (or simply redefine m\nto\ninclude\neng\nstruct, which makes sense for some missions).\npay\nWe know that:\nF = m c\nand the power P is\nP\nm c2\nFc\n!\n=\nDefine a specific weight\nm\n!e \"\nelect , and an initial acceleration a\nF\nP\no =\n. Then\nmtot\nm\n\"V\npay = e\n! c\n#\n!\neP\n\"V\n= e\n! c\n#\n!\neFc\nmtot\nmtot\n2mtot\nor finally in terms of the minimum number of dimensionless parameters,\nm\n\"V\npay = e\n! c ! (# eao\"V\nc\n)(\n)\n(1)\nmtot\n\"V\nm\n\nHere the group (! eao\"V ) is determined by technology level\n(!e), the mission\nrequirement (ΔV) and how fast we want to achieve it (ao). So we should consider this\nrelation a way to find copt to maximize mpay/mtot , given ΔV, ao and αe.\nDifferentiating,\nm\n!(\npay )\nm\n\"V\n#\ntot\nc\n$a \"\n#\n(\nV\n=\ne\n+\no V\nc\n)(\n)2 = 0\n(\"\n)\n\"\n!\nV\nc\n(!V )\n)\n2 e\n\"( !V\nc\nopt\nc\nopt\n= (#ao!V )\n(2)\nwhich we must solve for the optimum c/ΔV). For graphical presentation, let us eliminate the\ngroup (!ao\"V ) between (2) and (1):\nm\n\"V\npay = e\n! c\nV\n(1\n\"\n!\n)\n(3)\nmtot\nc\nEquations (3) and (2) are represented below over a broad range of ΔV/c:\n\nSo we see that it only makes sense to choose !V\nc\n<1 or\n>1 for such systems. This is\nc\n!V\nbecause for !V >1 the exponential is so small it outweighs the term representing melect.\nc\nExpanding the range 0 < (!V )\nc\nopt <1,\n\nLet us take a look at the meaning of these results:\nV\n1) If we choose a and have given\nand V, this gives us the (!\no\nαe\nΔ\n)\nc\nopt , and in turn the\nm\nmaximum\npay .\nmtot\n2) For given ΔV and\n!V\nαe, increasing ao (for a faster mission) increases(\n)\nc\nopt , which reduces\nm pay .\nmtot\nm\n3) For given ΔV and a0 , reducing αe (lighter power plant) increases\npay .\nmtot\nTake an example:\n\nSuppose that the mission gives as a requirement ΔV = 104 m/s and technology enables αe =\nmelect = 20 kg/kW = 0.020 kg/W\nP\n\na\nThen ! e\no\"V = 100 ao where ao is in m/s2.\nWe can still choose how fast we want to do the mission, within limits. We know that the\nupper limit of ! eao\"V = 1/e= .368. So for the assumed mission and technology,\na\n100ao= ! e\no\"V !.368. This implies ao !.00368 m/s2 or 3.8x10-4 g's and for this maximum\nm\navailable acceleration,\npay\nm\n= 0, not a very useful result! Suppose we insist on\npay = 0.5.\nmtot\nmtot\nThis gives ( !v)\n= .3, which in turn implies !eao\"v = .07. The acceleration is then ao =\nc\nopt\n.07 = 7x10-4 m/s2 = 7x10-5 g's. This is only about 1/5 the maximum acceleration, but now\nwe have lots of payload.\nThe time required to achieve the ΔV is\n\"V\nmpr\nm\n!\nopellant\n0(1! e\nc )\nc\nt =\n=\n\"V\n=\n( ! e\n! c )\n\nm!\nF / c\na0\nand for our example,\n104 / 0.3\nt =\n\"4 (1\" e\"0.3)\n7 !10\n! 1.23!10 s.= 142 days\n\nThis type of propulsion requires patience! Note that for a H2, 02 rocket,\nm\n#V\nm\npay ! e\n\"\n\"\nc \"\nstruct ! e\n4500\".1 !.0084\nmtot\nmtot\nSo we would probably use 2 stages. But the main point is the very much smaller payload to\ntotal mass ratio of the chemical system. In addition, if the coasting period for a chemical\nrocket is very long, as in an interplanetary transfer, a continuous low thrust can in many cases\naccelerate the mission.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/60d90feed9edd8f7149349f3af57e293_MIT16_50S12_lec6.pdf",
      "content": "16.50 Lecture 6\nSubject: Modeling of Thermal Rocket Engines; Nozzle flow; Control of mass flow\nThough conceptually simple, a rocket engine is in fact physically a very complex device and\ndifficult to represent quantitatively by mathematical models. But the difficulty and high cost\nof arriving at a successful design makes it essential that the performance-limiting\nphenomena be described as accurately as possible. It is no longer feasible to approach the\ndevelopment of a new rocket engine by a purely cut-and-try method.\nThe range of phemomena that must be dealt with is suggested by the sketch. They range\nfrom the fluid dynamics of the pumping system through the very complex phenomena of\ncombustion to structures with heat transfer rates beyond those experienced anywhere other\nthan in reentry from space.\nHot gas, Tc p c\n3D Supersonic Flow\nFuel\nOxidizer\nPump\nThrust Chamber\nmixing and combustion\nq\nHeat Transfer\nu e\npe\nTo deal with this complex situation, we use models that represent adequately the phenomena\nwe want to deal with, while suppressing other phenomena. Some models we will find useful\nare those for:\n1)\nTurbopumps\n2)\nInjectors\n3)\nCombus ion\n4)\nNozzle Flow\n5)\nHeat Transfer\n6)\nStructure of combustion chambers and nozzles\n\nNozzle Flow\nLet us focus on the Nozzle Flow first. For this purpose we regard the combustor as just a\nsource of hot gas of known chemical composition, stagnation temperature Tc and stagnation\npressure p .c\nWe have already used a very simple model to represent the result of this flow process.\nAssuming that the expansion was to zero pressure and therefore zero temperature we used\nconservation of energy to show that\nc =\n2cpTc =\n!\nRT\n! \"1\nc (model 1)\nwhere c was defined as the \"exhaust velocity\" meaning the velocity which, multiplied by the\nmass flow rate, gives the thrust. Now we want to explore the fluid mechanical processes in\nmore detail, and also represent the characteristics of the gas more accurately.\nThe gas is in fact a mixture of gases resulting from the combustion process Its composition is\nspecified in terms of mole fractions yi of species i or mass fractions xi of species i.\nFor example if the rocket burns H2 and O2 in a mixture ratio of 3 moles of H2 to 1 mole of\nO2 to produce H20 and H2, (by mass O/F=32/(3x2)=5.3, comparable to O/F=6 in the Shuttle\nSSME engine),\n3H2 + 02 ! 2H20 + H2\nthen the mole fractions and mass fractions of H20 and H2 are as shown in the table.\n\nH2\nH20\nx\n1/19\n18/19\ny\n1/3\n2/3\nWith these mole or mass fractions we can compute the properties of the gas mixture, such as\nthe specific heats, the gas constant and γ.\nThe fluid-mechanical and heat transfer phenomena that are of importance to describe are:\n1)\nThe effects of nozzle shape on flow\n2)\nThe effects of chemical reactions during the flow\n3)\nThe heat transfer from the flow to the nozzle\n\nEffect of Nozzle Shape\n\nThe phenomena that influence the coupling between nozzle shape and the flow can be\ndivided into two general classes, first those associated with the gas dynamics and second\nthose associated with the properties of the gas. Depending on how accurately we attempt to\nmodel each of these, our model of the flow can vary enormously in complexity. The range of\npossibilities is shown schematically in the figure, where sophistication of the modeling\nincreases away from the origin along two axes, one measuring gas dynamics, the other fluid\nproperties.\n\nAlong the gas dynamic axis the description can range from the simple channel flow model\nthat we will discuss here to very sophisticated three-dimensional descriptions of the transonic\nflow. Similarly along the properties axis the range is from the thermally and calorically\nperfect gas model we will use (often called the \"ideal gas\") to full kinetic description of the\neffects of chemical reactions that occur as the gas flows through the nozzle. The simplest\nmodel of all (Model 1) equates the kinetic energy of the exhaust flow to the thermal energy\nin the chamber\n\nHere we will limit the discussion of the coupling of flow to the geometry of the nozzle to a\nsimple model (Model 2) at the origin. The implications of the more complex phenomena will\nthen be discussed separately through two more models. Model 5 will deal with the effects of\nchemical reactions, and Model 3 with the effects of nozzle shape other than the simple area\nvariation. Model 4 will represent some special chemical and fluid mechanical aspects of solid\nrocket motors.\n\nCFD+Combustion\nMOC with\nideal gas\nDusty flow\nFrozen, but cp(T)\nOne-D reacting gas\n\nModel 2: Channel Flow of Perfect Gas\nThe channel flow model (often erroneously referred to as \"one-dimensional flow\") is one in\nwhich the entire flow is considered to be in a single stream tube having a mass flow that is\nconstant along the axis of the stream tube. The stream tube is considered to be narrow\nenough that the angle of the walls to the axis may be considered small, the gas properties\nnearly constant across the stream tube, and the components of velocity normal to the axis\nsmall enough that their squares are negligible compared to that of the streamwise velocity.\nIf the cross-sectional area of the streamtube is denoted A(x), the conservation of mass\nbecomes\nρuA(x) = m\n.\n= constant\n(1)\nThe conservation of energy becomes\nh\nu2\n+\n= h (Note: v2\n<<1)\nc\nu\nor if the specific heat is assumed constant.\ncpT\nu2\n+\n= c\npTc\n(2)\nThe final relationship defining the flow is a connection between two of the thermodynamic\nproperties of the fluid. In general this is a description of the variation of the entropy of the\nfluid along the flow direction. For our simple model we assume that the flow is Isentropic\n(Adiabatic and Reversible). The entropy is referred to a reference state which we take to be\nthe chamber condition. Conventionally, we assume that the velocity in the chamber is low\nenough that this is also the stagnation condition in the chamber.\ns ! s\nT\nc = \" c dT\np\n! R!n p =\nT\nc\nT\npc\nso if s is constant, and cp is as well,\nc\np\n!n T\np\n! R!n\n= 0\nTc\npc\nand from this it follows that\nT\np\nR\n= (\n)\nC p\np\n! \"1\n= (\n)\n!\nTc\npc\npc\n(3)\nwhere\nc\n! \"\np ;\ncp-cv=R\ncv\nWe want to manipulate these three relationships to arrive at an expression giving the\nvariation of Mach number with A, hence with x. We begin by expressing equation (2 )in the\nform:\nT\nu2\n! \" 1\nu2\nc = 1 +\n= 1 +\nM\n2,\nM\n2 !\nT\n2cpT\n\"RT\n\nand then from (3)\np\n\nc\n!\n= (1\n\"1\n!\n+\nM\n2)\n! \"1\np\nWith these we can write (1) in the form,\np\np T 1\nT p\nm\n.\n= !uA =\nuA =\nc\nM\n\"RT\nc\nRT\npc T R\nc\nTc Tc\n= (1\n! \"1\n!\n+\nM\n2)\n\"\n+\n! \"1 2\np\nM\nc\n!T / RA\nT\nc\nc\nm\n.\n!\nM\n= p\nA\nc\nRT\n! +1\nc (1\n! \"\n+\nM2)\n2(! \"1)\nFor given (and constant) pc and Tc, this expression gives the mass flow per unit area as a\nfunction of the Mach number M. Since the mass flow is constant, we have the desired\nexpression for M as a function of A(x).\nWe see that the mass flow per unit area, ρu, is proportional to the stagnation pressure and\ninversely proportional to the square root of the stagnation temperature.\nIt is both conventional and useful to plot the function of Mach number in ratio to its value at\nthe point in the flow where M=1. The value of ρu at this point we call ρ\n\" +\nu*. It is given by\n*\n\"\n# \" +1\n'\n(!u)\np\n% 2(\" '1)\n=\nc\nRT $ 2\n&\nC\nThen the ratio is\n\" +1\n$\n'\n2(\" #1)\n\" +\n!u\nA*\n&\n)\n=\n= M\n*\n&\n)\n!u\nA\n\" #\n& +\nM 2 )\n%\n(\nThis function of M is shown in the figure.\n\nSome of the dominant features are:\n1) There is a maximum in the mass flow per unit area at M=1.\n2) For M<1, ρu (and also u) increases with M, so M increases with decreasing A.\n3 For M>1, ρu (and also u) decreases with M, so M increases with increasing A.\nWe note however that p always decreases with increasing M. It follows that if we want to\nincrease M from a small value to one in excess of 1, as we do in a rocket nozzle, the nozzle\nshould be shaped as in the sketch at the beginning of the lecture, with a convergence to a\nminimum area \"throat\", followed by a divergence.\nFor given pc and Tc, the area of the throat controls the mass flow.\nTo get an idea of the required throat size we can evaluate the (dimensional) factor in front of\nthe function of M for a set of typical values.\nSay\npc = 100 atm = 107 N/m2\nTc = 3000°K\n! = 1.2\n\nR = 8.32x103\n= 640 J/kg/K\n\n!\np\n=107\n1.2\n= 7.91x103\nc\nkg/m2 /s\nRTc\n(640)(3000)\n\nWe define the throat of the nozzle as the point of minimum area, where M=1 and call the\narea there At. Then\n\nm\n.\n!\n! +1\n=\n(\n)\n2(! \"1)\npc At\nRTc ! +1)\nThe conclusion that the point of minimum area in the nozzle controls the mass flow is valid\nbeyond the limits of our simple ideal gas mode.. More generally, we define a quantity c* by\nm\n.\np\n!\ncAt that is a measure of the mass flow per unit area at the throat. For the ideal gas\nc*\nmodel,\nRT\n! +1\nc*\nc ! +\n=\n(\n)2(! \"1)\n!\nFor the example above,\n(640)3000 2.2\nc* =\n(\n)5.5\n1.2\n! 2138m / s\nIn general c* depends only on the propellant combination and pc.\nOne further condensation of these formulas that is sometimes useful is to define the\n\" +1\nquantity ! =\n\" (\n) 2(\" #1), which is close to 0.65 for most values of γ, and then write\n\" +1\nc*\nRT\n=\nc\np\n;\nm =\ncAt\n!\nc*\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/e2035e49d0312366d0772766f594b671_MIT16_50S12_lec7.pdf",
      "content": "16.50 Lecture 7\n\nSubject: Modeling of rocket nozzles; effects of nozzle area ratio.\n\nIn the last lecture we saw how the throat area of the nozzle controls the mass flow rate. Now\nwe will explore the effects of the shape of the nozzle downstream of the throat.\n\nThe Mach number and hence velocity at any point in the nozzle is determined by the ratio of\nthe area of the stream tube to the area of the throat (the area ratio), so if we assume that\n\na) The nozzle flows full, i.e. the streamtube shape matches the\n\nshape of the nozzle\n\nb) The flow is supersonic to the point x downstream of the throat,\n\nthen we can find M(x) from A(x)/At and it in turn determines p(x), T(x) and u(x).\n\nAs we shall see, it is the pressure that determines whether the nozzle flows full, so it is\nconvenient to relate the exit velocity directly to the pressure. We do this from the Energy\nEquation,\nu2\n\nTc ! T +\n\n2cp\n\nu2 = 2cp(Tc !T ) = 2cpTc[1\nT\n!\n]\nTc\nSo at any point in the nozzle where s=sc\np\n\" !1\n\nu =\n2cpTc[1! (\n) \" ]2\npc\nand this is independent of whether the nozzle is full at this pressure, because the area is not\nreferred to. In particular, if we apply this at the end of the nozzle where the pressure is pe,\nthe velocity at that point is\np\n\" !1\n\nue =\n2cpTc[1! (\ne ) \" ]2\npc\nYou know from your previous work that if the nozzle flows full the thrust of the rocket can\nbe written\n\nF = m\n.\nue + Ae( pe ! po)\n\nsubstituting the expression for ue we then have the following expression for F in terms of the\npressure ratio pe/p0.\np\n\n.\n\" !1\nF = m!\n2cpTc[1! (\ne ) \" ]2 + Ae(pe ! p\n\np\no)\nc\nThe mass flow rate is given in terms of c* by\n\nm\n.\np\n!\ncAt\nc*\n\nand for ideal gases, we have the estimate of c* given by\n\nc*\nRT\n=\nc\n\" +\n;\n! =\n\" (\n)2(\" #1)\n!\n\" +1\nF\nSubstituting these into the expression for F and non-dimensionalizing it:\n\nF\n! +\n\n!\n\n! 2 #\n2 &\n\"\n%\n! \"1\np\n#\n[\n]\n\"\n=\n%\np\n1 \" (\ne\nA\np\n)\n!\n\n+\ne\ne\no & (\npc At\n! \"1$ ! +1'\npc\nAt $\npc\n'\nwhere the area ratio is itself related to the pressure ratio through continuity:\n\nA\n!\n\" +\ne =\ntut\n\" #1\n=\n(\n) 2(\" #1)\n\nAt\n!eue\n\" +1\npe )1/\"\np\n\" #1\n(\n1# (\ne ) \"\npc\npc\nMore generally, we define a Thrust Coefficient by\n\nF ! pcAtcF\n\nand the above expression then gives us an estimate of cF for ideal gases.\n\nThe dependence of cF on nozzle area ratio and pressure ratio is conventionally\nsummarized as in the figure below, which is drawn for γ=1.2 and 1.3. Notice:\n\n-γ is replaced by k in these graphs\n-pc is replaced by p1\n-pe is replaced by p2\n-pa, or p0, the ambient pressure, is replaced by p\n\n3Thrust coefficient Cf versus nozzle area ratio for k=1.20.Thrust coefficient Cf versus nozzle area ratio for k=1.30.Thrust coefficient Cf versus nozzle area ratio for k=1.30.\nThr\nust\nco\neff\nici\nent\nCf\nve\nrs\nus nozzle area ratio\nfor k=1.20.\nThrust coefficient Cf versus nozzle area ratio for k=1.30.\nImage by MIT OpenCourseWare. After Sutton and Biblarz 2001.\nImage by MIT OpenCourseWare. After Sutton and Biblarz 2001.\n\nThe thrust is also expressible in terms of the effective exhaust velocity c, as we discussed in\nLecture 1. Then we have\n\nF ! m!c\np\n=\ncAt = p\n\nc*\ncAtcF\nand we see that\n\nc = c*cF\n\nThe \"Characteristic Velocity\" c* depends mainly on propellant properties. The Thrust\nCoefficient cF depends on propellant properties through γ (or equivalent), but mainly on the\npressure ratio and nozzle geometry. So by the definitions of cF and c* we have managed to\nseparate the effects of propellant properties and the effects of nozzle geometry into the two\nfactors of c. This separation, though demonstrated only for ideal gases, holds also for the\nmore general situation of complex chemically reacting propellants.\n\nEffects of Non-ideal Expansion\n\nSo far we have assumed in the discussion of cF that the flow fills the nozzle and is supersonic\nto the exit. If this is the case, the thrust is given by the above expression for cF . But in fact\nthe flow can be somewhat more complex than this, depending the ratio pc/p0 compared to\nthat which leads to ideal expansion. This behavior is summarized in the figure below.\n\nHere An is the throat area, Ae the exit area. The ideally expanded situation is at the upper\nright, and it is the condition at which thrust is maximum for a given external pressure p0. This\nis easier to visualize than to prove analytically: if the divergent nozzle were extended a little\nby adding a section at its exit, this section would see an internal pressure lower than p0, and\nwould therefore generate suction, or negative thrust. If on the contrary, the nozzle were\nshortened a little, one would lose the positive thrust that was being produced by the removed\nportion.\n\nReturning to consideration of a given nozzle, if p0 is lowered below its ideal matching\npressure (for example by the rocket ascending in the atmosphere) the nozzle becomes\nunderexpanded, as at the lower right. In this case the flow fills the nozzle and our formula\nfor F works fine.\nKerrebrock, Jack L. (1992). Aircraft Engines and Gas Turbines (2nd Edition).\nMIT Press, (c) Massachusetts Institute of Technology. Used with permission.\n\nIf on the other hand p0 is larger than corresponds to ideal expansion, the situation can\nbecome more complex. For pressure ratios p0/ pe< 2 to 2.5, the nozzle is likely to remain\nfull, and again the formula holds. But for larger pressure ratios the oblique shocks that form\nat the exit of the nozzle are strong enough to separate the boundary layer, and the point of\nseparation moves into the nozzle so that its effective area decreases, as shown at the upper\nleft. In this case the separation occurs approximately at a pressure ps such that ps/p0 = 1⁄2 to\n1/(2.5).\n\nAgain we can use the formula for thrust by replacing pe by ps and Ae by As, the area at which\nthe pressure is ps. So now\n\nF = m\n.\nus + As(ps ! po)\n\nWith this understanding, we can write the thrust coefficient for the separated nozzle as\n\nF\n!\n\n!\n+\n#\n&\np\n! \"\n! \"1\nA # p\n[1\n(\ns\ns\ns \" p\n)\n! ]\no&\n%\n=\n\"\n+\n%\n(\npc At\n! \"1$ ! +1'\npc\nAt $\npc\n'\n\nwhere now it is understood that ps is the pressure at which the separation occurs and As is\nthe corresponding area.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/3b75070e215e47a890e43d88047d2b0f_MIT16_50S12_lec8.pdf",
      "content": "16.50 Lecture 8\nSubjects: Types of Nozzles; Connection of flow to nozzle shape.\nTypes of Nozzles\nThe axisymmetric convergent-divergent \"bell\" nozzle that has been used as the example to\nthis point is the standard for rocket nozzles, for several reasons:\n1) Structural - It has essentially only \"hoop\" or tangential\nstresses which are the easiest to design for.\n2) Cooling - It can be constructed with walls of simple tubular\nconstruction that enables the cooling in a straightforward way.\n3) Matching to combustor - It is easy to match to the\ncombustor, which is most naturally a simple cylinder.\nBut it has some disadvantages, which stem from the need to operate at overexpanded\nconditions at low altitude (specifically, the nozzle is overexpanded, not the flow). The flow\nsituation shown as the left diagrams in the last lecture implies:\n4) An overexpansion thrust loss, whether or not separation occurs.\n5) Flow instability when overexpanded with separating flow, which may lead to\nuncertainty or unsteadiness of the thrust direction.\nThese have led to variations on the basic bell nozzle design, and some radically different\ndesigns. Amongst the variations are:\na) Extendable nozzles. Here the idea is to use the short inner nozzle at low altitudes, and\ndeploy the outer extension at high altitudes, so that the expansion ratio is more nearly ideal at\nall operating conditions.\n\nb) The External Expansion nozzle, termed by Rocketdyne the \"Aerospike\". Schematically, it\noperates with the flow configuration shown in the top figure at design, with the outer\nstreamtube essentially parallel to the axis and at atmospheric pressure.\nAt higher back pressures, that is at lower altitudes than the design value the bounding\nstreamline adjusts by moving inward as shown in the lower figure, and there is no problem\nwith suction, and no separation as encountered in the bell nozzle at high external pressure\nconditions. In detail, the flow now has a complex structure, with repeated oblique shocks and\nexpansions, but this has little effect on performance.\nAdvantages cited for this type of nozzle are:\n1) Better off-design performance\n2) Ability to use modular combustors around a nozzle spike, as suggested by the view\nbelow, looking upstream at the spike.\nDisadvantages are:\n3) It is difficult to cool the spike.\n4) It tends to be heavy, because the structure is not based on simple cylindrical\npressure vessels as in the bell nozzle.\nImage by MIT OpenCourseWare.\nNo\nzz\nle schemat\nic.\n\nMach wave\na\nV\n\nV\nV\ndu\nd\ndV\n\ndv\n\nAssociated with this turning is a change in total velocity dV and changes in velocity du and\ndv in the original direction and perpendicular to it. For d small,\n\ndv Vd , du dV\n\nFrom the geometry of the diagram,\ndu\n\ntan\ndv\nand substituting the above values for du and dv,\nNote - Such a nozzle was originally planned for the DC-X, but was not used because of\nweight and development cost. It was included in the Rockwell concept for the X-33, which\nwas abandoned for unrelated structural reasons.\nConnection of flow to nozzle shape\n\nOur channel flow model connects the flow Mach number to the area of the flow passage, but\nit gives no information as to how the area should vary along the axis. We will now consider\nanother model for the flow, called in its more fully developed form the Method of\nCharacteristics, or MOC. This is our Model 3, that provides a basis for quantifying the\nconnection between the nozzle shape and the flow. For this purpose we will consider the\nflow to be in two dimensions, supersonic and isentropic. The same procedures can be\nextended to axisymmetric flow, but the mathematics are somewhat more involved. For\nreferences see the following:\n\nKuethe & Chow, pp 219-228\nHill & Petersen, pp 523-530\n\nThe expansion of the flow in the supersonic nozzle occurs primarily through weak,\nisentropic waves. Such a wave in a supersonic flow stands at an angle to the flow, and\nturns that flow through an angle d as shown in the diagram.\nsin1\nsin1\ntan 1\nV\nM\nM\n2 1\ntan\nM2 1\na\n\ndu\ndV\n=\n=\ndv\nVd!\nM2 \"1\nIt follows that we can relate V to θ and M\ndV\nd!\n=\nV\nM2\n\n\"1\nFrom the energy equation we can relate V to M.\nT\ndT\n\"1\n=\n(! \"\nT\n! \"1\n#\n=\n1)MdM\nM2\nT\n! \"\n+\n+\nM2\nM2\nV\ndM\ndV\ndT\n=\n# 2\n= 2\n\"\n!RT\nM\nV\nT\n\" !1 M\ndV\ndM\ndT\ndM\n=\n+\n=\n!\ndM\nV\nM\n2 T\nM\n\" !\n+\nM2 M\ndM [\n=\n\nM\n\"\n]\nd#\n!\n+\nM2\nM2 \"1\nRearranging, and counting angles from the sonic point, we have an expression for θ in terms\nof M (the so-called Prandtl-Meyer function):\nM\nM2 !1\ndM\nθ(M) = \"1\nr\n!\n\n+\nM2 M\n=\n! +1Tan\n\"1\n! \"1(M\n2 \"1) \" Tan\n\"1 M\n2 \"1\n! \"1\n! +1\nThis function is tabulated in Kuethe & Chow and Liepmann & Roshko. It is plotted below:\n\nThere is a maximum angle (equal to 130.5 degrees for γ=1.4, and 208.5 degrees for γ = 1.2).\nNozzle Shaping\nHow do we shape a nozzle using this information? Let us assume γ=1.4 so we can use the\ntables, and suppose we want to design a nozzle for (pc/pe)design = 100.\n1) Start with\nChannel Flow to get the exit Mach number and area ratio. For γ = 1.4,\nMe is approximately 3.7, and Ae/At is 8.2. Suppose we want a nozzle that produces this\nMach number at the exit, and that the flow should be approximately parallel to the axis. The\nnozzle should therefore look something like:\nFor simplicity, let us assume the flow turns around a corner downstream of the throat, where\nthe Mach number is M0 > 1, to an angle θ1, and let us indicate just three of an infinite number\nof waves making up the \"expansion fan\". Since the centerline is an axis of symmetry, the\nwaves must reflect from it while canceling the flow deviation, so that the flow downstream of\nthe reflection is axial. When the flow passes through these reflected waves it is deflected\ntoward the axis. If the wall turns to match this deflection where the reflected wave hits it, the\nwave is just cancelled. The net result is that the flow arrives at the exit with an axial\ndirection and a uniform Mach number. Because of the crossing of waves from two\nexpansion fans, the detailed flow properties at most points need to be computed step-by-step.\nFor a good discussion of this see Liepmann & Roshko. Unfortunately time does not permit it\nhere, except for the uniform region just downstream of the sharp turn, where things are\nsimple.\nSince the flow is isentropically turned by the corner to the angle θ1, M1 is determined by this\nangle, from !(M1) \"!(M0) = !1. Also, since the flow is again turned by the second set of\nwaves through the same (but opposite) angle, !(Me) \"!(M1) = !1. By addition,\n2!1 = !(Me) \"!(M0)\nNo\nzz\nle\ns\nchematic.\nImage by MIT OpenCourseWare.\n\nwhich determines θ1. After this, the Mach number M1 follows directly from either of the\nabove formulas. Of course, if M0=1, θ( M0)=0, and the results simplify further.\n\nTo get the geometry correct we have to take account of the actual shape of the nozzle throat.\nMore important, this whole argument has been in two dimensions and real rocket nozzles are\nalmost always axisymmetric, but again time does not permit discussing these matters.\n\nThis sort of calculation results in a nozzle that will produce an axial exit flow of uniform\nMach number for a given expansion ratio. The length can be excessive, however, and non-\nidealities tend to cancel the small thrust contributions of the far downstream sections.\nMethods have been developed to generate shorter nozzles while accepting some losses due to\nnon-uniformities. The so-called \"Rao nozzle\" is the nozzle with the optimal contour for a\ngiven (less than ideal length).\n\nThese same ideas can by used to understand the external expansion, or \"plug\" nozzle. It looks\nlike:\nIn this case each of the expansion waves from the outer \"lip\" is cancelled by a turn in the\ncontour of the center body, so that there is just one family of expansion waves. This can be\neither a two-dimensional nozzle or an axi-symmetric one. It is the basis for the Aerospike\nnozzle projected for use in the X-33 by Lockheed Martin. It has also been used for aircraft,\neg. the F-4, in which the underside of the aft fuselage provides the expansion surface. Such a\nnozzle is also a key ingredient of the SCRAMJET idea, as exemplified by the X-30 and later\nimplementations.\nNo\nzz\nle schematic.\nImage by MIT OpenCourseWare.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 9",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/a1f24f4bc2440a5651aaa5ecdffa3d78_MIT16_50S12_lec9.pdf",
      "content": "16.50 Lecture 9\nSubject: Solid Propellant Gas Generators; Stability; Grain designs\nWe have thus far discussed two models for the nozzle flow in rocket engines, the Channel\nFlow Model and the Two Dimensional Isentropic Model. Now we will introduce a model for\nthe source of the hot gases in Solid Propellant Rockets.\nGas Generators\nThe distinguishing feature of a solid propellant rocket is that the fuel and oxidizer are pre-\nmixed. Typically, a modern propellant consists\nof:\npolybutadiene\n14%\naluminum\n16%\nammonium perchlorate\n70%\nIt is prepared as a physical mixture of NH4 ClO4 grains and aluminum powder in the plastic\nmatrix\nThe mixture reacts at the surface of the propellant grain to produce hot gas. The surface\nregresses( i.e. decomposes and evaporates) at a rate:\nr\n.\n= ap\nn\nc\nwhere a and n are empirical coefficients. This is an empirical rule. There is no\nstraightforward way to derive it from first principles. The physical processes involved are\nquite complex, including heat transfer to the grain by conduction, convection and radiation,\ndecomposition of the solids, mixing and finally combustion in the gas phase.\nTypical values of the empirical constants are:\nr = 6.8x10-3 @ 6.9x106 N/m2\nn = 0.15\nr = 1,775 kg/m3\nand as we shall discuss, such a propellant gives a specific impulse\nIs = 260 - 265 sec\n(at ground)\nIs =280 - 295 sec\n(in vacuum)\n\nOnce the rocket is built and ignited, it has a mind of its own. That is pc, Tc, r and the mass\nflow are all set by the propellant properties and geometryof the grain. For design purposes\nwe want to find the relationship between these performance parameters and the geometry.\n\nFirst assume the rocket is operating in steady state, then\nm\nrA\npc A\np =\nb!p =\nt\nc*\nand using the above expression for the regression rate,\nap\nn\nc A\np\nb!p =\ncAt\nc*\nwhere Ab is the \"burning area\", ie the surface area of the grain that is regressing. Solving for\npc gives\np\n1!n\nc\n= ac *\nA\n\"\nb\np\n(1)\nAt\nSo given the propellant properties we can compute the chamber pressure, and the mass flow\nof the propellant. Combined with a nozzle model, this enables us to compute the thrust of the\nrocket and its specific impulse\n\nStability\n\nThis relationship applies if the operating point is stable, that is if the pressure and mass flow\nare steady in time. If a, n, c*, ρp are all well defined, we can get pc from it. Note however\nthat pc depends on Ab and that it can be sensitive to unintended variations in the grain\nconfiguration..\n\nCracking of the grain or its debonding from the case can lead to increases in the burning area,\nvery high pc and an \"explosion\". This is probably the most frequent cause of solid rocket\nfailures.\nWe have assumed that there is a steady pc. To determine whether this is a stable operating\npoint, we first construct a model that allows unsteady behavior of pc. In first approximation,\nunsteadiness implies a variation in the mass stored in the chamber, which modifies the mass\nbalance we used to determine pc.\n\nd (\n.\np A\n! V\nc\nc\nA\ndt\nc ) = r\nb!p \"\nt\nc *\nGr\nai\nn\ncr\nac\nk\ni\nng sc\nhematic for solid propellant rocket.\nImage by MIT OpenCourseWare.\n\n= ap\nn\nc A\np\nb! p \"\nc At\nc*\nd (\ndV\n1 dp\n! V\nc\nc\nc) = !c\n+V\nc\nc\n;\nT \" const\ndt\ndt\nRTc dt\nc\n= ! r\n.\nA\nV\ndp\n+\nc\nc\nb\nc RT\n\nc dt\n= !cap\nn\nV\nc Ab +\nc dpc\nRTc dt\nSubstituting above, and noting that !p >> !c ,\nVc dpc\np A\np A\n= (!p \" !c)Abapn\nc \"\nc\nt\nRTc dt\nc*\n# ! Abapn\nc \"\nc\nt\np\nc*\nNow suppose the chamber pressure consists of a steady part plus one that varies in time,\npc = pco + δpc(t) where δpc<<pco\nVc d!pc = a( p\np )\nn A\n( pco + !p\nco + !\nc\ndt\nc\nb\"p #\nc)At\nRT\nc*\nap\nn(1\n!pc )\nnA\np A\n=\nco\n+\nc\nb\"p #\nco\nt (1\n!p\n+\n)\npco\nc*\npco\n! ap\nn(1 + n \"pc )A\np\n# $\ncoAt\nco\np\nb\np\n(1\n\"p\n+\nc )\nco\nc *\npco\nThe zero'th order terms on the right hand side cancel out, leaving\nVc d!pc\n!\n=\n)\np\n\"pap\nn\nco Abn( pc #\ncoAt (!pc )\nRTc\ndt\npco\nc*\npco\n#\n= ap\nn!1\nAt\nco\nA\n%\n$\nbn\" p !\n'p\nc*&\nc\n1 d!pc\nRT\n=\nc [ap\nn\"1Abn\nA\nco\n# p \"\nt ]\n!pc\ndt\nVc\nc*\nSo we have divergence if the quantity in brackets >0, stability if it is <0. Simplifing\nthe expression by use of Eq. (1):\napn!1A n\nA\n\" !\nt\naA\nco\nb\np\n= \"\nbn\nA\np\n!\nt = (n !1) At\nc*\nA\nac* \"\nb\nc*\nc*\np At\n1 d!pc\nRT\n= \"\nc At (1\" n)\n!pc\ndt\nVc c *\n\nSo we have:\nstability for n < 1\ninstability for n > 1\nThe time scale for growth is\nVcc *\n, and using\n(1\n)\n!c = pc /(RTc) and m! = p A / c* ,\n! n RTcA\n\nc\nt\nt\nt\n#\ngrowth !\ncVc\nt\n!\nresidence\n1\" n\nm\n1\" n\nFor typical values, this time is about 1 millisecond, which is of course short compared to\nmost rocket burning times, so we conclude that if n<1 the chamber pressure will relax from a\nperturbation in a time of order of 1 millisecond. If n>1 the rocket will explode in about the\nsame time.\n\nGrain Designs\n\nThe burning time is set by mission requirements, in particular by the acceleration level of the\nvehicle. For example for an acceleration of 2 \"g's\" and a propellant fraction of 0.7,\nt\nc [1\nm(t)\n=\n!\n] \"\n[.7] \" 89sec\nao\nm(o)\n2(9.8)\nThe regression rate as quoted above is about 0.7 cm/s, so in the direction normal to the\nburning the thickness of the grain must be about 56 cm.\n\nGrain Designs\n\nThe geometry of the grain must be chosen so as to meet the above requirements. The\nsimplest grain configuration is what is termed \"end burning\".\n\na) End burning:\nHere the grain regresses axially across the end facing the nozzle. The outer (cylindrical)\nsurfaces of the grain are generally bonded to the case with an intermediate layer of insulating\nmaterial such a rubber and coated with a substance that inhibits decomposition. As the grain\nrecesses it leaves the layer of rubber, which protects the case from the hot combustion gases.\nThis type of grain works well if the size of the grain needed for the application results in a\nlength that matches the desired burning time. But if the two do not match then a design must\n4End burning grain configuration schematic.\nImage by MIT OpenCourseWare.\nEn\nd\nburning grain co\nnfiguration schematic.\n\nbe found that gives the right burning length for the particular grain mass that is required for\nthe mission.\nb)\nRadial burning:\nA configuration that shortens the burning time for a given grain mass is the \"radial burning\"\ngrain:\nThis configuration has the disadvantage that the burning area increases as the grain regresses,\nresulting in an increase of chamber pressure with time, a situation that is undesirable for three\nreasons. First, the case must be designed structurally for the maximum pressure and it is used\ninefficiently for much of the burn time. Second, at least for launch systems, we want a high\nchamber pressure at the beginning of the burn to provide a high nozzle pressure ratio in the\npresence of the high atmospheric pressure. And finally, if the thrust increases with time it\nexacerbates the increase in acceleration due to the decreasing mass of the vehicle that results\nfrom the propellant consumption, and results in very high g loads at the end of burning.\nTo get around these difficulties, many large rocket engines use a \"star\" grain\nconfiguration that has the objective of maintaining the burning area constant as the grain\nregresses, or even decreasing it.\nc)\n\"Star\" grain\nThese grains have a series of points protruding inward, as shown in the sketch, such that as\nthe points burn off, they keep the area roughly constant. In a first approximation one can see\nthat the periphery of the \"star\" should be equal to the outer(circular) periphery of the grain, so\nthat the burning area is equal at beginning and end. Detailed geometric constructions have\nbeen developed that keep the area very nearly constant throughout the burn.\n\nc)\nSegmented Grains\n\nThe normal process for manufacturing solid propellant grains consists of mixing the\ningredients in a batch process (essentially a big food mixer), then pouring it into the case,\nwhere the rubber matrix cures. Because of limits on the size of the mixer and for safety and\ntransportation reasons, the amount that can be poured into a single case is limited. So for\nvery large rocket motors such as the Space Shuttle Solid Rocket Boosters, the grain is made\nup of several axial \"segments\" that are poured separately then assembled to make the\ncomplete motor. It was a failure of one of the case joints that led to the Challenger accident.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-50-introduction-to-propulsion-systems-spring-2012/a4c596bfba454c7fbf89a03dae3ba9c8_MIT16_50S12_lec10.pdf",
      "content": "16.50 Lecture 10\nSubjects: Models for rocket engines; Flow of reacting gases\nModels for Rocket Engines\nIn Lecture 6 we described in general terms a set of models we might use to describe the\nvarious features of rocket engines, making the point that no one model incorporates all the\nfeatures. The models we have discussed thus far are:\nModel 1;\nc2\n= c\npTc\nwhich simply equates the kinetic energy of the exhaust to the thermal energy in the\nchamber, ignoring all questions of efficiency and gas dynamics.\nModel 2;, which describes the nozzle flow for cp and γ constant, enabling an\napproximate description of the effects of the pressure expansion ratio and of the gas\nproperties. This resulted in the definitions of the Thrust Coefficient cF, and\nCharacteristic Velocity c*, which are applicable for more general situations than this\nmodel represents. The model in turn gave us approximate formulae for estimating cF\nand c* for particular nozzle geometries and propellants.\nModel 3, which describes the behavior of the flow in terms of the actual geometry of\nthe nozzle, but within the simplification of ideal gas behavior.\nModel 4, which dealt with Solid Propellant Internal Ballistics. This models the gas\nformation process for solid rockets, combined with the most important fluid\nmechanical phenomena governing the burning rate and stability.\nIn all of these models, the properties of the gases in the combustion chamber were taken as\ngiven. It should be clear by now that this is a key issue in understanding rocket engines. So\nwe need a model that connects the properties of the gases in the chamber to the propellant\ncharacteristics, i.e. a model that describes the combustion process. This set of processes we\nterm Combustion Thermochemistry. We will treat it as Model 5.\nModel 5 - Combustion Thermochemistry\nIn this model we want to represent what happens in the combustor, to convert liquid\npropellants (one or two) to hot gases at Tc and pc. Qualitatively, what happens is that the\ndifference between the chemical energies of the reactants (the chemicals injected into the\ncombustion chamber) and that of the reaction products ( the hot gases we seek to describe)\nshows up as thermal energy of the latter. To describe this quantitatively it is helpful to show\nit as a sequence of two steady flow processes. The first is the formation by chemical\nreactions of the products from the reactants at standard temperature and pressure. Of course\nsuch a process cannot happen in an isolated reactor, but we can think of it as a process in\n\nwhich the reactions occur at standard temperature and pressure while heat is added or\nremoved in the amount necessary to keep the temperature constant, and the volume is\nexpanded or contracted as needed to maintain the pressure constant as well. The heat added\nin such an ideal process is defined as the Standard Heat of Formation !H\nf of the products if\nthe reactants are the elements in their standard states.\n\nThe second step involves using the heat added in the first step to change the temperature of\nthe products. The temperature change is then given by the Steady Flow Energy Equation as\nh(T\np, p0) ! h(T0, p0) = !\"Hf\nwhere the products are indicated by the subscript p and the reactants by the subscript 0, but\nnote that the pressure is the same in both states.\n\nEvery chemical substance has a Standard Heat of Formation defined in this way. For\nexample for water,\nH\n2 +\nO\n2 ! H2O(l)\n\n\"H 0\nf , H2O(l) = #68.3174kcal / mole\nThe rather cumbersome notation is necessary to indicate that the reaction product in this case\nis liquid water. The heat of formation of gaseous water would differ from this by the heat of\nvaporization.\nNote that the heat of formation of water is negative, so that heat is released in its formation.\nThe convention that heat added is positive is purely arbitrary.\nFrom the definition of the heat of formation, it is zero for the elements in their standard\nstates.\nIn general one should remember that substances that are stable at normal temperature and\npressure have negative heats of formation, those that are unstable (explosives) have positive\nheats of formation.\nAs a simple example of the application of these ideas to rocket engines, consider a\nmonopropellant rocket engine using Hydrazine, N2H4:\n\nThis substance has physical properties much like those of water, but has a positive Standard\nHeat of Formation of 50.6 kJ/ mole. If we assume for now that it decomposes to produce N2\nand H2, and the enthalpy of each can be approximated by cpT, then the chamber temperature\nis given by\n\n[cpN2 + 2cpH2 ](Tc ! T0) = \"H\nf , N2 H4\n\nwhere the specific heats are per mole if the heat of formation is as well. In this argument we\nhave assumed that the products of combustion are nitrogen and hydrogen. In general there\nmight be some ammonia and perhaps other compounds in the decomposition products of\nhydrazine. We will see how to deal with this in the following discussion. For a first-cut\nestimate, say both N2and H2 behave as ideal diatomic molecules with γ=1.4, so that, for each\nof them, cp=γ/(γ-1)R=1.4/0.4*8.314= 29.1 J/mole/K. We then obtain Tc-T0=580K, and if\nT0=298K, Tc=878K.\n\nNow let us extend the argument to the somewhat more complex situation of a H2 - O2 liquid\nbipropellant rocket\n\nTo avoid some complexity, we assume that the hydrogen and oxygen are gases, at 298.16°K.\nThey react to form products according to\n\nH2 + nO2 ! \"H2O +#H2 + $OH + %H + &O2 + 'O\n\nHere n is set by the mix of propellants injected, but the coefficients on the right side are to be\ndetermined. We regard pc as given for this discussion. Actually it is set by the nozzle throat\narea for specified mass flows of hydrogen and oxygen, which in turn are determined by the\npressure differential across their injector orifices, and the total orifice areas. So we have to\nfind Tc and the values of !,\",#,$,%, & for given n.\n\nTo find !,\",#,$,%, & (6 unknowns), we first note that the total moles of hydrogen and\noxygen atoms must be equal on the right and left. In general we must have Conservation of\nAtomic Species\nH :\n2! + 2\" + # + $ = 2\n(1)\nO :\n! + \" + 2# + $ = 2n\n(2)\nIf the reaction products are in Chemical Equilibrium (as we shall assume) the other four\nrelations needed to find the six unknowns are provided by the Law of Mass Action, which\nprovides a set of relationships between the pressure of each of the compounds which is not an\nelement and the pressures of its elementary constituents. These expressions take the form of\nEquilibrium Constants defined through the stoichiometric relationship for formation of each\nof the compounds:\nH2 + 1\n2 O2 ! H2O\nKpH2O(Tc )\np\n=\nH2O\npH2 (p\n(3)\nO2 )\nH2 ! 2H\nKpH(Tc)\np2\n=\nH\n(4)\npH 2\nH2 + O2 ! 2OH\nKpOH(Tc )\np2\n=\nOH\n(5)\npH 2 pO2\nO2 ! 2O\nKpO(Tc )\np2\n=\nO\n(6)\npO2\nThe actual choice of reactions to be \"equilibrated\" is arbitrary, as long as the chosen set can\nbe used to generate by linear combinations any of the included species out of the \"major\"\nexpected product species. In our case we mainly expect to see H2O and, since the mixture is\npurposely fuel-rich (n<1/2), excess hydrogen in the form of H2. It is a good practice to select\nreactions in which only one of the \"minor\" species appears, so as to facilitate iteration\nstarting with the majors only. In the set above, this is true of all but reaction (5), in which two\n\"minors\" (O2, OH) appear. We can replace (5) by the result of eliminating O2 between (3)\nand (5), namely\nH2\nK 2\np\n+ OH ! 2H\np H2O =\nH2O\n2O\n(5')\nK pOH\npH2 pOH\nAs indicated by the functional expression, the K's are dependent only on the temperature.\nThis can be shown fairly readily by general thermodynamic arguments. Because of the wide\nlatitude in selecting the set of reactions to equilibrate, Standard thermodynamic tables do not\nlist all possible Kp(T), but they do list the basic quantities from which they can be calculated,\nnamely, the \"Standard Chemical Potentials\", μ0\ni (T ) (molar Gibbs Free Energies at 1 atm.\n\npartial pressure), or the Standard Entropies, s0\ni (T ), also at 1 atm. pressure. For example, the\nequilibrium constant for reaction (3) above is calculated as\nμ0\nK pH2O = exp[\nH2O ! μ0\nH2 !\nμ0\n!\nO2 ]\n!T\nwhere each of the chemical potentials is read from the tables for the given T. If the standard\nmolar entropies are listed instead, we can calculate first each of the standard chemical\npotentials as μ0\ni(T ) = hi(T )!T s0\ni(T ) , where hi is the molar enthalpy.\nReturning to Eqs. (3)-(6), each of the p's can be written in terms of α, β, etc, if pc is set.\nThus if ! \" # + $ +% + & + ' + ( then by Dalton's Law of Partial Pressures,\np\n! p\np\n! p\n!\nH 2O =\nc\nH 2 =\nc p\n!\nOH =\npc\npH =\npc\np\n!\n\"\n\"\n\"\n\"\nO2 =\np\n\"\nc\np\n!\nO =\np\n\"\nc\nWe will continue this discussion in the next lecture.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n16.50 Introduction to Propulsion Systems\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}