{
  "course_name": "Introduction to Latin American Studies",
  "course_description": "This course is designed as an introduction to Latin American politics and society for undergraduates at MIT. No background on the region is required. Overall workload (reading, writing, class participation, and examinations) is similar to that of other HASS-D courses. Many of the themes raised here are covered in greater detail in other courses: 21G.020J (New World Literature), 21G.716 (Introduction to Contemporary Hispanic Literature), 21G.730 (Twentieth and Twentyfirst-Century Spanish American Literaturere), 21G.735 (Advanced Topics in Hispanic Literature and Film), 21A.220 (The Conquest of America), 21H.802 (Modern Latin America), 3.982 (The Ancient Andean World), 3.983 (Ancient Mesoamerican Civilization), 17.507 (Democratization and Democratic Collapse), and 17.554 (Political Economy of Latin America).F",
  "topics": [
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Society",
    "Latin and Caribbean Studies",
    "The Developing World",
    "Humanities",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Political Science",
    "Society",
    "Latin and Caribbean Studies",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nPurpose\n\nThis\nHASS-D/CI\ncourse is designed as an introduction to Latin American politics and society for undergraduates at MIT. No background on the region is required. Overall workload (reading, writing, class participation, and examinations) is similar to that of other HASS-D courses. Many of the themes raised here are covered in greater detail in other courses: 21G.020J (New World Literature), 21G.716 (Introduction to Contemporary Hispanic Literature), 21G.730 (Twentieth and Twentyfirst-Century Spanish American Literature), 21G.735 (Advanced Topics in Hispanic Literature and Film), 21A.220 (The Conquest of America), 21H.802 (Modern Latin America), 3.982 (The Ancient Andean World), 3.983 (Ancient Mesoamerican Civilization), 17.507 (Democratization and Democratic Collapse), and 17.554 (Political Economy of Latin America).\n\nCourse Requirements\n\nRequirements include weekly course readings and videos; active participation in class discussions, class presentations, and the class debate; three short papers (two of which must be revised and resubmitted); one in-class map test; and one three-hour final exam.\n\nWritten Requirements\n\nThere will be a 30-minute map test at the end of the second week of the course. (Those students joining the course late can make up the map test outside of class with no penalty.) This test will cover all countries in Latin America, as well as major cities and geographical regions (e.g., the Amazon basin, the Andes, etc.).\n\nOver the course of the semester, you will also write three papers addressing different topics raised in the course of the semester. Due dates for the papers are noted in calendar section, and the paper topics themselves are included toward the end of this package. Rewritten papers\nmust\ntake into account comments you receive on the original version.\n\nFinally, at the end of the semester during the official exam period, there will be a three-hour exam covering all course materials. Half of this exam will be based on identification or short answer questions; half will be based on an essay. Last year's final exam is attached; this year's exam will be identical in the essay questions and very similar in the list of potential items for the short answer section.\n\nClass Participation\n\nYou are expected to participate in class discussion throughout the semester. Participation includes informal class discussion of the readings and films, in-class presentations, and a formal class debate. Attendance is obviously a prerequisite for class participation. If you must miss a class, you should notify me in advance. More than two unexcused absences will seriously jeopardize your class participation grade. (A handy reference sheet on what constitutes an excused absence is include in this package.)\n\nAlso, please notify me at the beginning of the class if, for whatever reason, you are unprepared to participate in class discussion that day. (You need not explain yourself unless you wish to do so.) I \"cold call\" people occasionally; in a small class there is nowhere to hide. Again, more than two unexcused \"unprepared\" will jeopardize your class participation grade.\n\nMy somewhat odd habit is to record class participation grades for each student after each non-lecture class. If your attendance record is perfect, the lowest two of your regular class participation grades will be dropped at the end of the semester. If you miss only one class over the semester, the lowest of your regular class participation grades will be dropped.\n\nPlease note that we will have one formal class debate, one individual class presentation, and several group presentations over the course of the semester. Information on these is attached to the syllabus.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n10%\n\nClass Debate\n\n10%\n\nIndividual Presentation on Economic Development\n\n7.5%\n\nThe \"Extemporaneous\" Presentation on Mexican Development\n\n7.5%\n\nTwo Group Presentations (7.5% each)\n\n15%\n\nThree Papers (10% each)\n\n30%\n\nMap Test\n\n5%\n\nFinal Exam\n\n15%\n\nGeneral class participation will count for 10% of your grade. The class debate will count for 10%, the individual presentation on economic development, the \"extemporaneous\" presentation on Mexican development, and the two group presentations will each count 7.5%. The three papers will each count for 10% (with rewritten papers receiving the average of their first and their final grades), the map test for 5%, and the final exam will count for 15%. Thus oral and written contributions will be weighed equally. Within the limits imposed by equity, grading will attempt to take into account the fact that some students (seniors, those who have lived for a long time in Latin America, political science majors, etc.) have had far more exposure to the material covered in the class.\n\nPlease note also that the bar for rewrites is higher than it is for the original draft. A paper that received an A- the first time around, and that was not revised based on your instructors' comments, is unlikely to receive an A- on the rewrite. Of course, it is difficult to get an A on the rewrite if you flailed completely on the original version, so there is still a strong incentive to \"get it right\" the first time.\n\nFinally, please pay attention to the list of stylistic and substantive hints included in this package.\n\nHow to Hand in Papers\n\nFor stylistic and substantive advice on writing your papers, see the hints attached to this syllabus.\nPapers must be submitted by 4pm the day they are due\n.\n\nPapers that are late will be penalized by one-third of a letter grade for each day late. If you need an extension, please tell me ahead of time. Extensions requested a week or more in advance will be automatically granted; extensions requested the night before are virtually automatically denied. I am lenient about granting extensions of a few days on the final paper.\n\nThe TA(s) and I would like to practice blind grading, so please don't include a title page or put your name in the footer; instead, put your name on a separate page after the paper. Also, at the risk of stifling self-expression and generally sounding like a pain, I ask that all essays and short papers be double-spaced and submitted in Times 12 font. (Otherwise I learn people's fonts after the first paper, which defeats the purpose of blind grading.)\n\nResources on Writing\n\nExtensive resources are available to you if you want help with writing. These resources include the MIT Writing Center on campus, the TAs, and me. Please take advantage of these if you have any questions or doubts!\n\nPlagiarism Clause\n\nWhen writing a paper (or an essay exam), you must identify the nature and extent of your intellectual indebtedness to the authors whom you have read or to anyone else from whom you have gotten ideas (e.g., classmates, invited lecturers, etc.). You can do so through footnotes, a bibliography, or some other kind of scholarly device. Failure to disclose your reliance on the research or thinking of others is\nPlagiarism\n, which is considered to be the most serious academic offense and will be treated as such. If you have any questions about how you should document the sources of your ideas, please ask your instructors\nbefore\nyou submit your written work.\n\nCriteria for HASS CI Subjects\n\nBecause this is a HASS-D CI subject, it must meet the following mechanical criteria. These include at least 20 pages of writing divided among 3-5 assignments (in the case of this class, three plus the essay portion of your final exam). Of these assignments, at least one must be revised and resubmitted. (In this case at least two must be.) HASS CI subjects must further offer students substantial opportunity for oral expression, through presentations, student-led discussion, or class participation.\n\nIn order to guarantee sufficient attention to student writing and substantial opportunity for oral expression, the maximum number of students per section in a HASS CI subject is 18, except in the case of a subject taught without sections where the faculty member in charge is the only instructor. In that case, enrollments can rise to 25, if a writing fellow is attached to the subject.\nIf our class exceeds 25, we will change around the schedule to create recitation sections\n.\n\nRules for Class Attendance\n\nLegitimate Excuses for Missing Class\n\nI was injured and was taken to the hospital (and here is the note from the doctor / paramedic / ambulance driver).\n\nI was sick (and here is the note from the Dean / doctor / faith healer / local voodoo priest).\n\nI am on the verge of a nervous breakdown (and here is the note from the Dean / shrink / licensed mental health care professional).\n\nI play competitive sports and will be away that day for a match / swim meet / full-contact mud-wrestling contest. [Note future tense]\n\nMy dorm room flooded / burned down / fell over in an earthquake (and here is the notice from the newspaper / the Dean / the Fire Marshal / the Army Corps of Engineers).\n\nA close relative was very sick / injured / dying / dead so I had to fly out of town (and here is the notice from my family / the Dean / the hospital / the funeral home).\n\nNon-excuses for Missing Class\n\nI needed to pick my mother up at the airport.\n\nMy boyfriend / girlfriend / long-lost cousin arrived unexpectedly in town.\n\nMy boyfriend / girlfriend / alien lover broke up with me.\n\nI am taking two classes whose time slots conflict.\n\nI overslept / needed to sleep / felt like sleeping / was overcome by that soporific feeling I sometimes get in the afternoon and didn't feel like drinking any more coffee.\n\nMy alarm clock fell off of my shelf overnight and shattered into lots of plastic pieces, and consequently, it didn't go off. I think my kitten must have done it.\n\nI had work for my other classes.\n\nI needed a break.\n\nI am not interested in _____ (insert topic of the week).\n\nI actually believed those Master Card ads that say I deserve whatever I want.\n\nMy dog / cat / goldfish / pet mongoose died.\n\nThere was a rerun of Star Trek on TV.\n\nThe lecture conflicted with my aqua-aerobics class.\n\nI invented a time machine for my senior project and was trapped in 2071 when everyone else was in class, but I promise that three years from now, when I've gotten all the bugs out of the system, I'll go back to last week and make up the session.\n\nNote: You get up to\ntwo\nunexcused absences without penalty per semester for a course that meets twice per week and up to one unexcused absence per semester for a seminar.",
  "files": [
    {
      "category": "Resource",
      "title": "Hints for Class Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-084j-introduction-to-latin-american-studies-fall-2005/21ff635fff7aeeee7a0275688bff693a_MIT21G_084JF05_hintsforpre.pdf",
      "content": "Hints for Class Presentations\n1. Practice\n2. Get in and get out gracefully\n- Make sure you have a good opening and closing line\n- Provide an orienting context, a reply or follow-up to what someone else has\njust said, an acknowledgement of the previous speaker, etc.\n- If you are part of a team, conclude with a good hand off to the next speaker\n3. Give a roadmap of your presentation: (1) tell them what you're going to tell them, (2)\ntell them, and (3) tell them what you told them.\n4. Organize your presentation in a format that makes them easy to absorb - e.g., 1, 2, 3,\nsummary.\n5. If the presentation is to be longer than a few minutes, use visual aids to orient and\nengage your audience. Slides are often better than handouts, as there is often a\ndanger that the audience will start flipping through the handouts noisily, distracting\nothers and sometimes themselves. For the graphical presentation of data, consult\nEdward Tufte, The Visual Display of Quantitative Information, 2nd Edition (Cheshire,\nEngland: Graphics Press, 2001).\n6. Where possible, invite questions and audience participation.\n7. If your will be interrogated or cross-examined afterward (for example, if you are\npresenting to an academic audience or a legislative oversight body), anticipate the\nquestions that you may be asked and come with prepared answers. If you do not like\nthe question and cannot answer it, say why it's the wrong question, explain what the\nright question is, and answer that one.\n8. Practice\n9. Practice\n10. And finally, PRACTICE!\nIf you want to sound smart but are not slated to present, prepare a question on the\nmaterials to ask at the appropriate time.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.084J / 21A.224J / 17.55 Introduction to Latin American Studies\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Hints for writing papers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-084j-introduction-to-latin-american-studies-fall-2005/b63515fd4b6d02a8f79f97e9e144d177_MIT21G_084JF05_sylbs200211.pdf",
      "content": "Hints for writing papers\nStylistic hints\n1. Avoid contractions in formal writing. In informal writing, they're OK.\n2. Avoid the passive voice (e.g., \"it was done to him\") where possible.\n3. In formal writing, never use the second person as a substitute for impersonal or general\nreferences. Thus you should not write: \"living in a democracy makes you less likely to be\narrested for political reasons\". You might write instead: \"Citizens in democratic societies are\nless likely to be arrested for political reasons.\"\n4. Consider avoiding the first person singular. If using that format, however, stick with it\nthroughout. Do not switch back and forth between impersonal presentation of your argument\nand the first person singular. Thus, you could write: \"In the first section of this paper, I discuss\nthe reasons for the collapse of Chilean democracy in 1973. In the second section, I discuss\nhow General Augusto Pinochet was able to consolidate a personalistic dictatorship.\" You could\nalso write: \"The first section of this paper discusses the reasons for the collapse of Chilean\ndemocracy in 1973. The second section describes how General Augusto Pinochet was able to\nconsolidate a personalistic dictatorship.\" But you would not write: \"In the first section of this\npaper, I discuss the reasons for the collapse of Chilean democracy in 1973. The second\nsection describes how General Augusto Pinochet was able to consolidate a personalistic\ndictatorship.\"\nThe same point holds for the first person plural (\"we\").\n5. \"It's\" is a contraction of \"it is\". \"Its\" is the possessive of \"it\". As you will not be using\ncontractions in formal writing, you won't be using \"it's\" ever.\n6. Do not use impersonal pronouns (e.g., it) when the referent is unclear or nowhere in sight. The\n\"it\" should refer clearly to a specific noun used in the preceding clause, not to a general concept\ncontained in the previous clause, nor to a specific noun two or more clauses away.\nSimilarly, avoid using \"this\" and \"that\" as subjects or direct objects. Thus, you would not write:\n\"Dahl and other scholars have advanced the argument that democratization depends little on\ninternational influence. But this ignores important exceptions, such as Greece, Argentina,\nTaiwan, and the Eastern Europe.\" Instead, write: \"Dahl and other scholars have advanced the\nargument that democratization depends little on international influence. But this argument ignores\nimportant exceptions, such as Greece, Argentina, Taiwan, and the Eastern Europe.\"\n7. Do not use \"and/or\", as in \"they fought for God and/or country\". Instead, you might try \"they\nfought for God, country, or both\".\n\n8. Be careful not to use \"which\" when you mean to use \"that\". Use \"which\" when the phrase or\nclause set off is parenthetical to noun it qualifies. Thus, you would write: \"U.S. pressure pushed\nthe Salvadoran government toward democracy, which it probably would have favored in any\ncase.\" By contrast, use \"that\" when the phrase or clause it introduces is integral to the noun\ndescribed. Thus you would write: \"U.S. pressure pushed the Salvadoran government toward\nthe kind of democracy that Salvadoran civilian leaders were already promoting.\"\n9. Avoid using \"while\" in the place of \"even though\" or \"although\", and an a mushy substitute for\n\"but\" and \"and\".\n10. If your first language is not English, check for common mistranslations. For instance, if you are\na native speaker of Portuguese or Spanish change you should make sure to write \"make\ndecisions\" instead of \"take decision\" and \"soccer\" instead of \"futbol\" or football\".\n11. Do not worry about split infinitives. If Captain Kirk can do it (\"to boldly go where no one has\ngone before\"), so can you.\n12. If in doubt about style and grammar, consult Strunk and White or some similar volume.\n13. Always include page numbers on your papers.\n14. Spell check and proofread your paper before handing it in.\n15. If your footnotes are abridged or you are using the academic journal style of including citations\nin parentheses, be sure to include a list of references cited.\nMake sure the formatting of you bibliography and references corresponds to one of the\nappropriate styles. Stick with ONE style and use it throughout. If in doubt about formatting\nissues, consult the Chicago Manual of Style.\n16. For your first paper, allow at least two hours after that paper is completely written to your\nsatisfaction to go back through it and check to make sure that you have covered all these points.\nFor subsequent papers, check through your paper both for these points and for any hints you\nhave received on previous papers.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.084J / 21A.224J / 17.55 Introduction to Latin American Studies\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Items for the Map Test",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-084j-introduction-to-latin-american-studies-fall-2005/7beaaa980cb1df9c3a4ec6d4b9cbfc11_MIT21G_084JF05_itemfothema.pdf",
      "content": "Items for the Map Test\nPeruvian-Ecuadorean disputed area\nBeagle Islands (southern tip of South America)\nAtacama Desert (Chile)\nAltiplano (Bolivia)\nSouth American rain forests\nCentral American rain forests\nFalklands Islands (Islas Malvinas)\nHispaniola\nVieques (off Puerto Rico)\nStraight of Magellan\nCaribbean Sea\nGulf of Mexico\nGulf of California (a.k.a. Sea of Cortez)\nLake Titicaca\nLake Nicaragua\nPanama Canal\nParana River\nOrinoco River\nAmazon River\nRio de la Plata\nSierra Madre\nSierra Maestra\nAndes\nMt. Aconcagua\nBaja Peninsula\nYucatan Peninsula\nGuajira Peninsula (Colombia/Venezuela)\nArgentina\nBelize\nBolivia\nBrazil\nChile\nColombia\nCosta Rica\nCuba\nDominican Republic\nEcuador\nEl Salvador\nFrench Guyana\nGrenada\nGuatemala\nGuyana\nHaiti\nHonduras\n\nJamaica\nMexico\nNicaragua\nPanama\nParaguay\nPeru\nPuerto Rico\nSuriname\nTrinidad and Tobago\nUruguay\nVenezuela\nCapital cities of the above countries\nTijuana, Mexico\nCiudad Juarez, Mexico\nMonterrey, Mexico\nGuadalajara, Mexico\nVeracruz, Mexico\nBluefields, Nicaragua\nCartegena, Colombia\nCali, Colombia\nMedellin, Colombia\nMaracaibo, Venezuela\nGuayaquil, Ecuador\nCuzco, Peru\nCordoba, Argentina\nMendoza, Argentina\nMar del Plata, Argentina\nSao Paolo, Brazil\nRio de Janiero, Brazil\nSalvador, Brazil\nManaus, Brazil\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.084J / 21A.224J / 17.55 Introduction to Latin American Studies\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Last year’s final exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-084j-introduction-to-latin-american-studies-fall-2005/93f392354b8e2d71f54e5e8c4a90f3db_MIT21G_084JF05_finalexam.pdf",
      "content": "Last year's final exam\nThe exam will have two parts: an essay component and an ID component. Both will be\nweighed equally. The ID portion of the exam will be closed book and closed note. ID\nanswers should be 1-2 paragraphs each, and should identify the ID item, place it in\ncontext, and explain its importance. (The exception is items from the map test, for which\nyou should just identify the place on the map or place something on the blank map, as\nappropriate). The essay portion of the exam, which will be open-book and open-note,\nwill include only ONE topic from the list of three, chosen at random. You must write the\nessay in class, but you may use any notes or other materials you bring with you. We\nrecommend that you prepare detailed outlines of all three questions in advance. You may\ncollaborate in the sense of discussing these questions ahead of time with other students,\nbut you should draw up your own outlines and answers.\nCitations for an in-class exam do not need to be formal. If the citation is from the\nsyllabus, the author's name in parentheses will suffice. Lecture can be cited as \"(Lawson,\nDate)\". If the citation involves a specific fact or quote, you should include a page\nnumber. If you cite a work not included in the syllabus, you should include the full\nformal citation.\nEssay topics\n1. Gabriel Garcia Marquez's fictitious village Macondo is often described as a\nmicrocosm of Latin America. Which features does Garcia Marquez portray\naccurately? Which does he exaggerate? Which does he downplay or ignore\naltogether?\n2. Next week you find yourself talking with an acquaintance who has recently returned\nfrom vacation in Mexico. He remarks (boorishly) on how poor the country seems in\ncomparison to the United States, how incomplete the democratic transition seems,\nand how weak the rule of law is. The reason, he feels, is that Mexicans have a\ndifferent attitude toward time, authority, and financial dealings. As he puts it: \"They\nare always talking about manana, and everyone is on the take.\" What sort of an\nexplanation is this for underdevelopment and authoritarianism in Mexico? Do you\nagree with this perspective? What other explanations might you offer for differences\nbetween Mexico and the United States?\n3. Evaluate the following statement: \"Neoliberal democracy in Latin America is\neither a farce or a fraud, a comedy or a tragedy, depending on one's perspective;\nit is certainly no cure for the region's ills. The real problems that average Latin\nAmericans confront - poverty, corruption, abuse at the hands of an indifferent\nstate - remain unchanged.\"\n\nID items for final exam (last year)\n20 IDs will be drawn at random from the list below\nLatin America as a \"living museum\"\nThe Conquest\nHernan Cortes\nAztecs\nNahuatl\nMexica\nMachu Picchu\nencomienda\nlatifundia\n\"obedezco pero no cumplo\"\nhacienda\ncriollo\nmestizo\nmulatto\ncommodity cycles\nguilds\nviceroy\nfueros\nMaximilian\nmonoculture economy\nMacondo\nBig Mama\ncorporatism\nclientelism\nDependency Theory\nCore\nPeriphery\nMode of insertion (in dependency theory)\nNeoliberalism\nstages of dependency\nMNC's\nimperialism\nModernization theory (as it applies to economic development)\nKuznets curve\nAutarkic development\nRacist theories of Development\nCultural theories of development\n\"protestant ethic\" argument\nneoliberal argument for underdevelopment\n\ncomparative advantage\nLiberalism (in the European sense)\nCoase theorem\nfactor endowments\nrent-seeking\nhyperinflation\ndebt crisis\nautarkic development\nthe \"lost decade\"\nValue-added chain\nMarket failure\nEconomies of scale\nEconomies of learning\ninfant industries\nimport substituting industrialization (ISI)\nstructuralism\ntariffs\nsubsidies\nnationalization\nprimary commodities\nRaul Prebisch\nterms of trade\nproducer cartels\nurban bias\nIMF\nTINA\nausterity measures\npaquetazos\nneoliberalism\nstructural adjustment\neconomic reform/economic liberalization\nmarket-friendly reform, market-oriented reform\ninformal sector of the economy\nHuman capital\n\"second stage\" reforms\nVirgin of Guadalupe\nPentacostalism\nEvangelical Protestantism\nAssembly of God\nLiberation theology\nsyncretism\nLeonardo Boff\nCamilo Torres\nErnesto Cardenal\nArchbishop Oscar Romero\nPope John Paul II\n\nVatican II\nPuebla 1968\nMedellin Conference of Bishops\nThe \"second counter-reformation\"\nChristian base communities (comunidades eclesiales de base, CEBs)\nAzuleika Sampaio\nPatricio Alvarez (in Colombia)\nexorcism\nAfrican spiritism\norixas\nCandomble\nSanteria\nUmbanda\nKardac\ncursillos de cristiandad\nChe Guevara\nfoco movement (foquismo)\nMarxist\nSendero Luminoso (Shining Path)\nSandinista National Liberation Front (FSLN)\nFMLN\nMRTA\nEZLN (zapatistas)\n\"red-green\" alliances\nFernando Henrique Cardoso\nArturo Alessandri\nPatricio Alwyn\nEduardo Frei Sr.\nEduardo Frei Jr.\nRicardo Lagos\nThe House of Spirits\nEsteban Trueba\nPedro Tercero Garcia\nBarrabas (in The House of Spirits)\nClara Del Valle\nAlba Trueba\nBlanca Trueba\nPedro Segundo\nTres Marias\nLeftist\nRightist\nSalvador Allende\nUnidad Popular (Popular Unity)\nChristian Democratic Party (of Chile)\nNational Party (of Chile)\nRadical Party (of Chile)\n\nMIR\nstatute of guarantees\nGeneral Rene Schneider\nPatria y Libertad\ncoup d'etat\nSeptember 11, 1973\nthe \"mummies\"\nTruckers' strike\nOrlando Letelier\nJaime Guzman\nChilean junta\nPlan Z\nbureaucratic authoritarianism\nAugusto Pinochet\ncarabineros\nDINA\nCNI\n\"caravan of death\"\nCopiapo\nComando Conjunto\nManuel Rodriguez Patriotic Front\nChilean plebiscite of 1978\nChilean plebiscite of 1989\nChilean Constitution of 1980\nCoalition for the \"No\"\nmalapportionment\nproportional representation\nbinomial electoral system\nManuel Contreras\nNational Stadium in Santiago\nLa Moneda\nCODELCO\ndegollados\nGeneral Sergio Arellano Stark\ndemocratic consolidation\ndemocratic transition\ndemocracy\nelectoralism\nmajority rule\nparliamentary sovereignty\npluralism\npresidentialism\nThe Battle of Chile\nGustavo Leigh\nJose Merino\nCesar Mendoza\n\nOscar Bonilla\nRodolfo Strange\nNelson Morales Leal\ncuidadores de autos\nChicago Boys\nNational Stadium (Chile)\nDawson Island\nConcertacion (Chile)\nThe \"two Chiles\"\nnunca mas/nunca mais\ncontrol of the episode \"dominio de los hechos\"\nSamuel Huntington's \"torturer problem\"\nSamuel Huntington's \"praetorian problem\"\nmilitary prerogatives\ncivilian control of the military\ntruth commissions\nBaltasar Garzon\ndesaparecidos\nauthoritarian enclaves\nfavela\nJosue (from Central Station)\nDona Dora (from Central Station)\nBom Jesus da Silva, Bahia (from Central Station)\nThe \"misrule of law\" (from Holston)\nJardim das Camelias\nJoe Mondragon (from The Milagro Beanfield War)\nLadd Devine (from The Milagro Beanfield War)\nSheriff Montoya (from The Milagro Beanfield War)\nRuby Archuleta (from The Milagro Beanfield War)\nAmarante Cordova (from The Milagro Beanfield War)\nmachismo\nmaquiladoras\nNGOs\n\"color line\"\nBrazil as a \"racial democracy\"\nsocial construction of race\nDisjunctive democracy\nPrivatization of justice\njusticeiros\nChico Mendes\n4 spheres of the rule of law\nformalized usurpation\nMovimento dos sem terra (MST - Brazilian Landless People's Movement)\nAckel estate\nSolutions proposed in class to the problem of unclear land title\nBenito Juarez\n\nMexican Revolution\nPorfiriato\nPorfirio Diaz\nFlores Magon brothers\nFrancisco Madero\n\"Effective Suffrage and No Reelection\"\nEmiliano Zapata\nFrancisco \"Pancho\" Villa\nPedro Carranza\nAlvaro Obregon\nPlutarco Elias Calles\nLazaro Cardenas\nejidos\nMiguel Aleman\nMexican Miracle\npresidencialismo\ndedazo\ncaudillismo\ncaciques\ncamarillas\nPNR\nPMR\nPRI\nPRD\nPAN\nTlatelolco massacre\nNational bankruptcy in Mexico\n1988 Mexican presidential elections\nChiapas\nIFE\nCuauhtemoc Cardenas\nCarlos Salinas de Gortari\nErnesto Zedillo\nVicente Fox\nLiberals (Colombia)\nConservatives (Colombia)\nANUC\n\"oligarchical democracy\" in Colombia\nAndres Pastrana\nCesar Gaviria\nM-19\nELN\nFARC\nAUC\nChoco region\nMedellin Cartel\n\nCali Cartel\nparamilitares\nErnesto Samper\nNational Front\nla violencia\nJusticia Regional\nThe Desmonte\n\"Classic revolution\"\nIDs from the Map Test\nPeruvian-Ecuadorean disputed area\nBeagle Islands (southern tip of South America)\nAtacama Desert (Chile)\nAltiplano (Bolivia)\nSouth American rain forests\nCentral American rain forests\nFalklands Islands (Islas Malvinas)\nHispaniola\nVieques (off Puerto Rico)\nStraight of Magellan\nCaribbean Sea\nGulf of Mexico\nGulf of California (a.k.a. Sea of Cortez)\nLake Titicaca\nLake Nicaragua\nPanama Canal\nParana River\nOrinoco River\nAmazon River\nRio de la Plata\nSierra Madre\nSierra Maestra\nAndes\nMt. Aconcagua\nBaja Peninsula\nYucatan Peninsula\nGuajira Peninsula (Colombia/Venezuela)\nArgentina\nBelize\nBolivia\nBrazil\nChile\nColombia\nCosta Rica\nCuba\nDominican Republic\n\nEcuador\nEl Salvador\nFrench Guyana\nGrenada\nGuatemala\nGuyana\nHaiti\nHonduras\nJamaica\nMexico\nNicaragua\nPanama\nParaguay\nPeru\nPuerto Rico\nSuriname\nTrinidad and Tobago\nUruguay\nVenezuela\nCapital cities of the above countries\nTijuana, Mexico\nCiudad Juarez, Mexico\nMonterrey, Mexico\nGuadalajara, Mexico\nVeracruz, Mexico\nBluefields, Nicaragua\nCartegena, Colombia\nCali, Colombia\nMedellin, Colombia\nMaracaibo, Venezuela\nGuayaquil, Ecuador\nCuzco, Peru\nCordoba, Argentina\nMendoza, Argentina\nMar del Plata, Argentina\nSao Paolo, Brazil\nRio de Janiero, Brazil\nSalvador, Brazil\nManaus, Brazil\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.084J / 21A.224J / 17.55 Introduction to Latin American Studies\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Pop quiz",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-084j-introduction-to-latin-american-studies-fall-2005/95898e4858f0d10d74dcb153f2c36925_MIT21G_084JF05_popquiz.pdf",
      "content": "Pop quiz\n1. Which is the most urbanized country in Latin America (i.e., where the largest\npercentage of people live in cities of more than 100,000)?\n2. Which is the country with the highest percentage of indigenous people?\n3. What is the longest ruling political party in the region?\n4. What country has been democratic the longest?\n5. Name at least two of the four major international wars in South America since 1830?\n6. What country has the highest homicide rate?\n7. Which countries have been slowest to undertake economic reforms during the 1980s\nand 1990s?\n8. Which country is a member of OPEC?\n9. Which country is most dependent on the U.S. for trade (i.e., has the highest\npercentage of its dollar-volume trade with the U.S.)?\n10. Which country has the highest life expectancy?\n11. Which is the richest country in terms of GDP per capita?\n12. The poorest?\n13. Which country has the most unequal distribution of income?\n14. How many languages are recognized as \"official\" by countries in the continent of\nSouth America? Which of these languages is spoken by most people in South\nAmerica?\n15. Which country in Spanish-speaking America has the highest percentage of\nProtestants?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.084J / 21A.224J / 17.55 Introduction to Latin American Studies\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}