{
  "course_name": "Introduction to Doing Research in Media Arts and Sciences",
  "course_description": "This course is intended for students pursuing research projects at the Media Laboratory. Topics include Media Lab research areas, documenting research progress, ethical issues in research; patents, copyrights, intellectual property, and giving oral, written, and online presentations of results. A final oral presentation is required. Enrollment limited with preference given to students in the Media Arts and Sciences freshman program.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Fine Arts",
    "Media Studies",
    "Digital Media"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nTexts\n\nThere are no textbooks for this class.\n\nDescription\n\nThis course is for students doing UROP (\nUndergraduate Research Opportunities Program\n), who are pursuing research projects at the Media Laboratory. We will discuss the areas of research going on in the media lab as well as topics associated with all research: documenting progress, ethical issues, intellectual property issues (like copyright and patents), and giving oral, written, and online presentations of results. A final oral presentation is required. Enrollment limited with preference given to students in the Media Arts and Sciences freshman program.\n\nCalendar\n\nCLASS\n\nTOPICS\n\nOBJECTIVES/QUESTIONS\n\nResearch\n\nA brief overview of the semester\n\nWhat is research, and what kind do we do at the Media Lab?\n\nHow to design an experiment\n\nHow and why to keep a lab notebook\n\nEthics\n\nResearch involving human subjects (Dr. Leigh Firn, Chair of COUHES)\n\nEthics/ownership/teamwork\n\nIntellectual Property (IP)\n\nUnderstanding intellectual property, copyright, patents\n\nResources\n\nWhat kinds of resources exist and how to find them\n\nWhat's \"peer review\" anyway?\n\nHow to read/write a research paper\n\nKinds of conferences and journals\n\nCFP's and review processes\n\nWhat the web means to all this\n\nHow (and when) to do a research-results Web page\n\nHow does this stuff get paid for?\n\nResearch funding and how it works\n\nDemoing and presenting\n\nHow to demo\n\nHow to make slides and do an oral presentation\n\n9-10\n\nFinal presentation practice\n\nPractice presentations and critiques\n\n11-12\n\nFinal presentations\n\nFinal presentations",
  "files": [
    {
      "category": "Resource",
      "title": "Clarity in Technical Reporting",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-111-introduction-to-doing-research-in-media-arts-and-sciences-spring-2011/3e0247f63d443761e21320b30eee24f9_MITMAS_111S11_read_ses5.pdf",
      "content": "NASA SIP-7016\nNATIONAL AEWQNAUTiCS AND SPACE ADMlNBSfRATlON\n\nNASA SP-7010\nCLARITY IN\nTECHNICAL REPORTING\nby S. Katzoff\nLangley Research Center\nSecond Edition\nScientijic and Technical Information Division\nNATIONAL AERONAUTICS AND SPACE ADMINISTRATION\nWashington,D.C.\n\nSecond printing, 1965\nThird printing, 1968\nFourthprinting, 1973\nFOR SALE BY THE SUPERINTENDENT OF DOCUMENTS, U.S. GOVERNMENT PRINTING\nOFFICE, WASHINGTON. D.C. 20402. PRICE 35 CENTS. DOMESTIC PREPAID: 25 CENTS,\nGPO BOOKSTORE\nSTOCK NUMBER 3300-00513\n\nFOREWORD\nWith the sharp increase in recent years of the volume of\ntechnical reports in aerospace fields, it has become even more\nimportant for report authors to present their material\nclearly and concisely. This booklet, which offers common-\nsense suggestions for improving written and oral reports, is\ndesigned not only for prospective writers within the National\nAeronautics and Space Administration but also for scientists\nand engineers among the agency's contractors whomust\nreport the results of their research.\nThe history of this booklet is that of a publication that\ndid not set out to be one, but that has been virtually forced\ninto print by the demand of would-be readers. For a num-\nber of years prior to and since the initial printing, the author,\na busy scientist at the Langley Research Center, has acted\nas counselor to fresh-out-of-college youngsters coming to\nwork at the Center-guiding\nthese inexperienced authors in\nthe art of writing technical reports that measure up to\nLangley's exacting standards. In 195 5, Dr. Katzoff, con-\nvinced of a widespread need for practical pointers on technical\nwriting, put some of his thoughts on the subject on paper.\nTyped and duplicated in small numbers, this highly informal\ndocument was classed as a Langley internal paper.\nBut publications, notably the best ones, have a life of\ntheir own quite separate from* the intentions of their authors.\nSoon \"Clarity in Technical Reporting? began to earn a\nword-of-mouth reputation as a small cl~ssic. Several times\ncopies became scarce, and were run off in small amounts,\nand became scarce once more. Meantime Langley, acting\nas a kind of seedbed for its rapidly expanding parent agency,\niii\n\nsent many of its alumni to other NASA Research Centers,\nand thus treasured personal copies were carried to other\nlocations, there to repeat similar cycles of modest reproduc-\ntion and scarcity.\nWhen this curious spread of an elderly informal docu-\nment was discovered, this Division concluded that so prized\nand useful a paper merited better treatment. In fairness to\nits author, now Senior Staff Scientist of the Langley Research\nCenter, one should note that he had no intention of appearing\nin print as an authority on technical writing.\nInstead, this\nbooklet should be read as what it is: counsel for those who may\nwish it from a man who has read-and\nwritten-many\ntech-\nnical papers.\nMELVIN\nDirector\nS. DAY,\nScientific and Technical Information Division\n\nINTRODUCTION\nTHERATE OF PRODUCTION of technical reports is now so\nhigh that the typical research worker is continually frustrated\nin his desire to keep informed of other workers' progress\nwhile working effectively on his own problem. His pre-\ndicament is made worse by the fact that many of the reports\nthat he must read are so ineptly written that the effort\nrequired to assimilate them is several times as much as their\ncontents should require.\nThe monetary cost of this ad-\nditional effort is certainly an appreciable fraction of the\ntotal cost of research and development, while the hindrance\nto our nation's scientific progress may be of crucial\nimportance.\nThe basic reasons for lack of clarity are sometimes\ndifficult to identify,' and no doubt vary from one author to\nanother. Work with inexperienced authors has indicated,\nhowever, that they generally do not have ineradicable\nweaknesses, and that a few discussions of basic principles\nof report writing frequently suffice to improve considerably\nthe quality and lucidity of their reports.\nThis pamphlet contains the essence of these discussions.\nMost of it is contained in some form in the existing literature\non report writing. This pamphlet is not intended, however,\nas a replacement for this literature, nor is it intended as\na short summary or review course in report writing. It is\npresented only as a small supplement to such formal courses\nor formal directions for report preparation, and it discusses\nonly a few principles that experience has indicated generally\nneeded special attention. In particular, it discusses basic\nattitudes, some elements of composition, the organization\n\nand contents of the report, and the editorial review.\nStress\nthroughout is on striving for clarity, for if this one ideal can\nbe deeply impressed upon the report writer, the desired\nresult will have been largely achieved.\nSince technical information is transmitted not only in\nwritten reports but also in talks and lectures, as during tech-\nnical meetings or formal conferences, a section has been in-\ncluded on the technical talk-the\norally delivered technical\nreport. Some special treatment of this subject was consid-\nered necessary because the technical worker frequently shows\nhimself to be profoundly unaware of the difference between\na written and an oral report. Here again the emphasis has\nbeen laid on principles found frequently to need attention,\nand no effort has been made to provide a thorough discussion\nof the oral report or of public speaking.\nBASIC ATTITUDE\nPurpose\nThe purpose of the report is to present information.\nYou will hardly disagree with this statement; yet many au-\nthors seem to subordinate this purpose and quite forget the\npoor reader when preparing a report. For example, when a\nreviewer complains that a certain word seems incorrect, the\nauthor may proceed to an unabridged dictionary and tri-\numphantly point out the rare definition that clarifies his\nsentence. Obviously such an author is more interested in\ndemonstrating his erudition than in presenting information\nclearly to his harried reader; for if he had his reader in mind,\nhe would try immediately to substitute a more common\nphraseology .\nThis example is only one of many that could be given.\nApparently the presumed purpose to present information is\nfrequently forgotten in the author's desire to show his own\nbrilliance, to impress the boss, to impress the secretary, to\ndemolish the rival, or to get a raise. Worthy as these ob-\njectives may be, the basic objective should be to make the\n\nreport clear and informative; furthermore, if this objective\nis attained, the secondary objectives will automatically be\nattained.\nThis basic viewpoint is fundamental. If you remember\nnothing else of this pamphlet, you will have retained the\nessence if, when writing your report, you continuously bear\nin mind the busy reader, who has only a limited time to\ndevote to your report and who, in addition, may not be\nvery familiar with your subject.\nThe great scientists who established the foundations of\nmodern science seldom had to admit an error, if for no other\nreason than that they generally had time to correct any\ninadequacies that became apparent. The high degree\nof thoroughness and perfection that characterized their\nwork, however, is often unattainable in many modern\nlaboratories. For example, a complete test program may\nbe run through a particular experimental facility before\na single result is available for examination; and the equip-\nment may no longer be available when eventual examination\nof the results shows that the crucial test was not within\nthe range of variables chosen, or that some of the tests\nwere spoiled, or that perhaps the whole program was not\nvery cleverly conceived. Thus, the hectic pace of modern\nresearch frequently results in studies that, although useful,\nhave rather significant faults or weaknesses.\nEven purely\nanalytical studies may suffer in this way, when the worker\nis forced to publish what he has and proceed to a more\nurgent job.\nSuch situations are, of course, unfortunate, and are\nparticularly distressing to authors trained in admiration\nof the masters.\nWhat is more unfortunate, however, is\nthe fact that these same authors may strive desperately to\nhide the faults. They may spend days trying to concoct\nwording that will lead the reader's attention away from\nthe faults or that will make the faults appear less significant\n\nor less blameworthy, or they may simply write up the re-\nsults without any suggestion that they are inadequate.\nActually, your reader is aware of the origin of such\ndifficulties and is not interested in blaming anyone. He will\nbe most grateful, and may even admire you, if you give him\na frank and open statement of omissions, errors, inac-\ncuracies, or even gross blunders; and he will definitely not\nappreciate being forced to wade through your incompre-\nhensible doubletalk in order to find out for himself that\nyour work has grave faults.\nShadowboxing\nClear technical writing presupposes ability to think\nlogically. Such ability as you have represents years of\ntraining, and no effort will be made in this pamphlet to add\nto it. Some remarks will be made, however, on the illogical\nor irrelevant outbreaks that occasionally arise to bewilder\nthe reader.\nSometimes a usually rational author will produce some-\nwhere in his report an essentially incomprehensible state-\nment. Questioning in such cases may bring out that the\nstatement involves a complex of motives and is the result of\nan effort to overload it with special meaning. For example,\nit may represent a refutation of some remark by an associate\n(perhaps the boss) or of some statement published by another\nworker in the same field, and the phraseology may constitute\nan effort to be very polite (or perhaps impolite) in this\nrefutation. Such a delicately cut statement with both\nscientific and personal undertones tends merely to confuse\nthe reader, and its significance may be lost even on the\nperson for whose special benefit it was composed.\nSuch shadowboxing is, of course, only one of the motives\nbehind the impenetrable fogs that sometimes settle over\nsimple technical discussions. Another common motive is the\ndesire to build a sentence or a discussion around a particular\nphrase that has taken the author's fancy. It may be some\n\nheroic remark by Julius Caesar, or it may be some impressive\ntechnical phrase equally inapplicable in the particular\nsentence.\nThe remedy for such apparently illogical outbreaks is to\navojd secondary motives and efforts at elegance and to stay\nclose to straight scientific reporting. In general, if you find\nyourself struggling excessively in composing a statement,\nyou might do well to pause and ask yourself whether the\nidea is necessary and, if so, whether it is actually complex or\nwhether you are muddling it as a result of extraneous motives.\nCLEAR THOUGHTS, CLEARLY EXPRESSED\nWords\nOnly a few remarks are needed with regard to choice of\nwords. As has already been suggested, avoid using a rare\nword unless it is essential. Under no circumstances use a\ncommon word in a rare usage, because it will mystify your\nreader without even suggesting that he consult an unabridged\ndictionary. Foreign words and phrases should not be used;\nwhatever elegance or subtlety they may add to your paper is\nprobably lost on your reader, who will merely find the paper\nthat much more difficult to follow. These remarks, of\ncourse, do not refer to the technical words of your branch of\nscience. Be sure, however, that your technical words are\nnot merely the jargon of your own laboratory, because such\nlanguage can be meaningless to workers at another laboratory.\nThis advice is possibly contrary to the style encouraged\nduring your formal education, when your English instructor\nmay have beamed if you used a phrase from Shakespeare or\na bit of Latin in your themes. Now you must emphasize\nclarity and easy readability, remembering that your readers\nare not English instructors, and save your ornamentation\nfor other occasions.\n\nSentences\nOne cannot prescribe, for sentences, \"do\" and \"don't\"\nrules that are as simple and obvious as those just presented\nfor words.\nThe basic purpose, however, to present your\nmaterial as clearly as possible is still your guide; and the\nfollowing few suggestions, of fairly general applicability,\nwill exemplify the approach.\nThe length of a sentence should generally not exceed\nabout 35 words, unless it is broken up (as by semicolons)\ninto two or three distinct and logically consecutive parts.\nAny sentence presents the reader with the task of first\nidentifying its constituent phrases, and then bearing them\nall in mind while their logical interrelation crystallizes.\nForcing him to bear in mind and fit together more than\nabout 10 phrases (each of about three words) is unnecessarily\ncruel. Here again your English instructor's joy at your\nability to compose grammatically correct 200-word sentences\nmust be disregarded as against your present goal of simpli-\nfying your reader's job.\nAn equally important rule is that a sentence should\ngenerally contain some indication as to how it is related to\nthe preceding sentence or to the development of the para-\ngraph. This indication is usually near the beginning of the\nsentence. For example, in the first three sentences of this\nparagraph, the opening phrases (\"An equally important\nrule,\" \"This indication,\" and \"For example\") all serve to\nshow relationship to what has gone before.\nOmitting such\ntie-in wording may not essentially alter the main content\nof the sentence, but it forces the reader to figure out for\nhimself how the sentence fits into your train of thought.\nIn general, then, you must remember, while composing each\nsentence, to indicate by appropriate wording how it is\nrelated to the preceding sentence.\nYou must take your\nreader by the hand, and lead him step by step along the path\nby which you develop your topic.\n\nMake every effort to eliminate ambiguous phraseology\nfrom your sentences. Unfortunately the English language\noffers many opportunities for ambiguity, as in the following\nwell-known pitfall:\nTime flies.\nYou can't.\nThey fly too fast.\nwhere the reader is quite confounded by the third sentence\nuntil he goes back and reinterprets the first two sentences.\nAsk yourself as you write each word, phrase, or sentence\nwhether its meaning would be clear or whether it has a chance\nof being momentarily misunderstood.\nFrequently a particular fact or idea must be stated more\nthan once in a report; for example, it may be given in the\nIntroduction and then also in the Tests and in the Discussion.\nRather than treating it every time as brand-new material,\nyou might introduce the repeat with a phrase such as \"As\nhas already been mentioned\" or \"Here, again, the fact\nthat . . .\"; otherwise the reader may wonder whether his\nmemory is playing tricks.\nSuch introductory phrases are\nnot always essential, but their omission can sometimes be\nvery annoying.\nParagraphs\nThe main characteristic of the clear paragraph has\nalready been mentioned; namely, that the relation of each\nsentence to the preceding or following one be clear, as by\nmeans of transition words or phrases.\nIn addition, it may\nbe desirable to indicate definitely the relationship of each\nparagraph to the preceding or the following one. Usually\nthe relationship to preceding material is indicated in the\nopening sentence or sentences of the paragraph; and relation-\nship to following material is indicated in the final sentence\nor sentences of the paragraph.\nIn any case, make sure\nthat your reader is not required to proceed very far into the\nparagraph (say, beyond the second sentence) before the\ngeneral drift of the subject matter becomes apparent. Do\nnot make him read on and on while wondering just how the\nparagraph fits into your report. You, as the author, are\n\nin a much better position than is your reader to organize\nyour material; and the responsibility both for organizing it\nand for showing the organization rests on you.\nDo not make your paragraphs too long. Just as a\nsentence with too many phrases is difficult to grasp as a\nunit, so is the paragraph with too many sentences. A long\nparagraph should not, of course, be broken up into shorter\nones by arbitrary subdivision. If you find your paragraph\ngetting very long, either simplify the idea or break up the\nidea into smaller units, with a paragraph for each.\nORGANIZATION OF A TECHNICAL REPORT\nDifferent writers have different methods of organizing\ntheir reports, and some seem to have no discernible method\nat all. Most of the better writers, however, appear to be in\nremarkably close agreement as to the general approach to\norganization. This approach consists essentially of stating\nthe problem, describing the method of attack, developing\nthe results, discussing the results, and summarizing the con-\nclusions. You may feel that this type of organization is\nobvious, logical, and natural. Nevertheless, it is not uni-\nversally accepted. For example, many writers present\nresults and conclusions near the beginning, and describe the\nderivation of these results in subsequent sections. Although\nsome obvious arguments exist for this latter type of organiza-\ntion, most readers and most of the better writers seem to\nprefer the former. The straightforward organization, then,\nis recommended here, not only because it seems basically\nmore logical, but also because your reader will be more\nfamiliar with it and will therefore have to expend less effort\nin understanding your paper if it is so organized. Even if\nhe is impatient for the final results and conclusions he can\nmerely turn to the back of your report; and he will hardly\ndemand that you destroy the logical sequence of your\npresentation in order to present the conclusions first.\n\nThe following sections discuss the main parts of the\nreport in more detail. As already indicated, the detail will\nbe far from complete, since the purpose is only to throw\nsome light where the inexperienced author most often\nblunders. The experimental research report and the\nanalytical research report will be treated separately.\nThe Experimental Research Report\nThe typical report of experimental research is organized\nroughly as follows :\n1. Introduction\n4. Results\n2. Equipment\n5. Discussion\n3. Tests\n6. Conclusions\nThe contents of these parts will be briefly reviewed.\nIntroduction-Many\npeople have a notion that the In-\ntroduction serves to put the writer's best foot forward, to\ncharm the reader and excite his interest, or somehow to\nease the reader into the subject matter; and they accordingly\nstruggle to produce a literary gem with which to begin the\nreport. Actually no gems are needed or are particularly\ndesirable. The Introduction may be written in a straight-\nforward manner along the lines indicated in the following\nidealized outline :\n(a) Begin by describing enough of the background to\nshow where or how the problem arose and how important\nit is. For example:\nAs a result of such-and-such developments,\nsuch-and-such problems have arisen. In reference 1,\nsuch-and-such phases of the matter were studied.\nIh .reference 2, certain other phases were studied.\nThe results, however, leave the question of . . .\nunsettled, so that the basic problem of . . . remains,\nand it is not yet possible to design accurately. . . .\nThe main question in your composing such an opening is\nwhether you actually know the background well enough to\nwrite it accurately, with the emphasis placed correctly. If\nyou are not sure, reread the references or go to your super-\n\nvisor (or to whatever expert is available) and ask him to\ndiscuss the whole subject with you. In general, do whatever\nis necessary to give yourself sufficient background to com-\npose an opening that will not confuse the reader with in-\naccurate or off-key statements.\nIt may happen that an adequate review of the back-\nground, with enough detail to clarify the precise contribution\nof your report, would be much too long to be included in the\nIntroduction.\nIn such a case, summarize it in this first\nsection of the Introduction and provide a separate chapter\nfor the detailed background (or perhaps give the background\ndetail at appropriate points throughout the paper, depending\non the nature of the material).\n(b) Having indicated where the problem exists, or, in\ngeneral, what the background is, now state broadly what it\nis that you have tried to contribute by your research and\nalong what general lines you have worked. For example:\nIn an effort to obtain further insight into . . .,\nan experimental study was made of. . .,with special\nemphasis on. . . . The material available was con-\nsidered to be especially favorable for the study be-\ncause. . . . Furthermore, special apparatus (to be\nsubsequently described) developed for this purpose\nwas capable of . . ., thereby providing information\nof (a previously unavailable) type. . . .\n(c) Your reader is now aware of what you have tried to\ndo and why. I t is usually desirable at this point to add a\nfinal portion to the Introduction, in which you state more\nspecifically what types of tests and analyses were made, the\nranges of variables considered, and similar infor mation that\nbroadly defines the nature and extent of your work. The\nreader will thereby get an insight into the scope and thorough-\nness of your research and will know what to expect in the\nreport.\nThese three sections thus constitute the typical In-\ntroduction. Frequently the three sections are found in\nthree paragraphs, but such sharp separation is not essential.\n\nOne of the sections may require two or more paragraphs,\nor all three sections may be contained in one paragraph.\nThe general applicability of the preceding formula,\nas well as the ease with which it can be applied, is illustrated\nby an experience in a report-writing class of about 20 young\nresearch engineers. After receiving a brief lecture on the\npreceding material, every member of the class was able\nto write out, in less than an hour, an acceptable first draft\nof an Introduction for the report that he would eventually\nbe writing on his research.\nApparatus and Tests--Normally, the final portions of your\nIntroduction will have provided enough insight into the\nnature of your study so that little or no argument for your\nchoice of equipment or technique is needed. You may\nthen simply give a straighforward description of your\nequipment under Apparatus.\nIf, however, some par-\nticular ingenuity was involved, be sure that your presenta-\ntion makes the matter clear. The reason is not that you\nmust brag wherever possible, but that you must not present\nsomething new with so little emphasis (as if it were obvious\nor well known) that the contribution cannot be recognized.\nThe same rule, of course, applies to any part of your paper;\na reader becomes very bewildered when he cannot make\nout from your discussion what is old and what is new.\nSometimes different tests may have required different\npieces of equipment, or you may have developed your\napparatus as you proceeded from one test to the next.\nIn such a case, do not hesitate to make Apparatus and\nTests a single heading. If the two are not so intimately\nrelated, however, a separate chapter, Tests, will generally\nbe preferable.\nResults and Discussion-Some\nauthors prefer, wherever\npossible, to present all their experimental results (as in the\nform of charts or tables) first, under Results, and then to\ndiscuss them, others prefer to discuss their results as they\nare presented. Sometimes the subject matter develops in\nsuch a way that one or the other method is obviously to be\n\npreferred.\nIn any case, the nature of the decision is similar\nto that discussed for Apparatus and Tests and will not be\nfurther discussed here. Although this part of a report is\nnormally the most important part, adequate presentation\ndepends mainly on careful and logical analysis of the material\nrather than on rules of report writing.\nThe following\nremarks, however, may be useful.\nYou will recall that in the Introduction you described\nthe problem and what you hoped to accomplish or contribute.\nBear this Introduction in mind while you present your data,\nand show by your discussion how these data shed light\non the problem or, in general, to what extent your originally\nstated objectives were achieved. Some authors also find it\nhelpful to prepare a list of the main points that were developed\nin the investigation (these are, essentially, the final Con-\nclusions of the report) and then to aim the Results and\nDiscussion to bring out these points.\nOrganization along some such line is essential. Avoid a\nrambling, disorganized presentation. Above all, avoid the\nponderous revelation of unenlightening trivia, such as \"It\nmay be seen by reference to figure 8 that the lift increases\nwith angle of attack until the stall is reached, beyond\nwhich. . . .\n9 9\nConc/usions--Your Results and Discussion will already\nhave brought out the main contributions of your work. It\nhas become standard practice, however, to gather together\nthese main contributions and enumerate them in a final\nsection called Conclusions. Essentially, the Conclusions\nstate concisely (seldom more than two sentences per con-\nclusion) what you have concluded from your research.\nThey are the answer to \"So you have done a piece of research.\nWell, what did you find out?''\nThey should be written with\nlittle or no reference to the body of the report, as a favor to\nthose readers who like to go directly from the Introduction\nto the Conclusions in order to see how it turned out. An\nadditional purpose in making them approximately self-\nsufficient is to minimize the possibility of a misunderstanding\n\nif they are quoted. (For similar reasons, incidentally,\nit is generally desirable that figures be reasonably self-\nexplanatory.)\nSometimes the research turns out in such a way that\nenumerating sharply drawn conclusions is practically im-\npossible. In such cases a short discussion of the problem\nand what you learned and believe about it should be given\nunder Conclusions. Sometimes, however, the original prob-\nlem, as stated in the Introduction, remains essentially un-\nanswered (as when the experimental technique turned out\nto be inappropriate, or the information obtained turned out\nto be less useful than originally expected). A frank discus-\nsion of the situation, together with, possibly, suggestions for\nfuture research, is preferable in such cases to drawing unin-\nteresting or irrelevant conclusions. Such a final section is\ngenerally entitled Concluding Remarks.\nSometimes the technical report merely describes equip-\nment or procedures, or it tabulates design data obtained by\nstandard methods. Neither Conclusions nor Concluding\nRemarks is usually appropriate or desirable for such a paper.\nIf a closing section is desired, it might be a RbumC, in which\nthe information is briefly sketched and the charts or tables\ncontaining the data are indicated.\nChapter headings-In\nthe preceding discussion the chap-\nter headings were assumed to be the standard ones previously\nmentioned (Introduction, Apparatus and Tests, and so on).\nAlthough these headings are quite satisfactory, more specific\ntitles'are preferable whenever they can be used. Thus, in-\nstead of Apparatus, you might use Wind Tunnel and Models (or\ntwo separate chapters, one entitled Wind Tunnel, the other,\nModels) ; instead of Results and Discussion, you might use\nDihedral Effect, Longitudinal Stability, and soon (again, there\nis no objection to having several main headings to replace Re-\nsults and Discussion). The headings Introduction and Con-\nclusions (or Concluding Remarks or RbumC) are almost never\nreplaced by more specific titles.\n\nTables, charfs, and figures-The\ninexperienced writer\ntends to present his numerical results in the form of tables,\nusually because he has studied his results so thoroughly that\nhe can see the significant trends from the numbers them-\nselves. The reader, however, is much less familiar with the\nresults and may fail to see from the tables the trends that\nseem so obvious to the author. In general, visual presenta-\ntion by means of charts or curves will put across your\npoints much more effectively. Furthermore you should give\nconsiderable thought to the question of how to plot your\nresults so that their message will be most easily grasped.\nCrowding too many curves on one figure should be avoided\nso that the reader can easily identify each curve as you\ndiscuss it in the text.\nState clearly in the text what each figure shows and how\nthe figure shows it. Avoid referring to a figure in so casual\na manner (as by the simple parenthesis (fig. 2)) that the\nreader himself must determine how the figure is related to\nyour discussion.\nSummary--Among\nthe scientific journals there are a\nnumber, such as Science Abstracts, Chemical Abstracts, and\nApplied Mechanics Reviews, that provide abstracts, or\nsummaries, of practically all published papers in their fields.\nThe actual preparation of the abstracts is performed free,\nor for only nominal payment, by a large number of dedicated\nscientists who do this essential work at considerable personal\nsacrifice. The Summary that you append to your paper is\nyour contribution to this effort, and it should be prepared\nin such a way as to lighten the abstractor's burden. That\nis, it should be capable of being used directly as the abstract\nor of being easily summarized further if a relatively short\nabstract is desired.\nIn general, the Summary should contain only a minimum\nof background and should proceed as quickly as possible to\ndescribe what was learned. Considering that the report\nitself may not be readily accessible to the reader, put into\n\nthe Summary what you consider to be the most valuable\ncontributions that the report makes, including the most\nsignificant conclusions and some mention of interesting\ntechniques or concepts. There is no room, of course, for all\nthe detail that you would like. In any case, however,\ninclude enough so that the reader can determine whether\nhe should exert himself to get a copy of the report itself for\ncloser study.\nNote that the Summary is not actually a part of the\nreport itself, so that duplication of portions of the report\nneed not be avoided. For example, you need not hesitate\nto include sentences lifted unchanged out of the Introduction,\nConclusions, or any other part of the report.\nThe reader of a report will frequently begin by reading\nthe Summary in order to get a quick review of the contents.\nYou need not give any extra thought to such a reader, how-\never, since the material that satisfies the primary purpose of\nthe Summary will adequatelyaerve this additional purpose\nalso.\nThe Analytical Research Report\nTheoretical or analytical papers may not fit into stand-\nard organizational patterns as readily as do the usual\nexperimental papers. The remarks previously made with\nregard to the Introduction and Conclusions still apply, but\nthe body of the paper is arranged in whatever manner\nseems most logical. A long theoretical development, how-\never, frequently tends to leave the reader unable to see the\nwoods for the trees. Accordingly, you might do well to\ninclude near the beginning of such a report an overall view\nof your line of development, and as you begin each chapter,\nindicate what will be done in that chapter and how it fits\ninto the development. Incidental material, such as a side\nproof or derivation, may be put into an appendix in order to\navoid interrupting the continuity of the main development.\n\nREVIEWS AND CRITICISMS\nAfter your paper has been completed, it will generally\nbe reviewed by one or more separate reviewers or by a re-\nviewing committee. Many authors seem to consider such\na review to be an unwarranted impertinence, and they\napproach the review with various bewildering psychological\ndefenses, ranging from \"Here I am. Crucify me!\" to \"Do\nyou wanna fight?\"\nNeedless to say, such attitudes are absurd.\nYour purpose should not be to exhibit your own brilliance\nas against the reviewer's wickedness and stupidity, but only\nto make your paper more readable and more accurate\nscientifically.\nConsider all comments and suggestions carefully. Some\nof them may be incorrect or may indicate that the reviewer\nhas not understood you.\nIn such cases, do not scold the\nreviewer, but try to determine where he was misled and\nconsider whether others might be similarly misled. If an\nappreciable likelihood exists, try to revise the material so\nthat this danger will be minimized.\nRemember at all times\nthat your report should be clear and that your reviewer is\nprobably a typical reader -or\nis at least typical of a consider-\nable proportion of your readers.\nThe fact that you can\nexplain a passage to his satisfaction does not mean that the\npassage is satisfactory; it must be written so that it will be\nclear to the reader even when you are not present to explain\nit.\nSometimes the reviewer will make an important tech-\nnical contribution to your report, such as a clearly superior\nmethod of developing an equation. Such contributions\nshould be accepted. Do not insist on publishing inferior\nmaterial merely because you do not wish to take credit for\nwhat is not yours. Your responsibility to your reader is\nstill paramount.\nIt may be appropriate, however, to\nacknowledge the reviewer's contribution in the text, to ask\nhim to write an appendix under his own name, or to make\nhim a coauthor.\n\nTHE TECHNICAL TALK\nYou have doubtless been subjected to the lecturer who\nburies his face in his papers and, in an expressionless voice,\nreads long involved sentences while waving vaguely toward\nhopelessly complicated charts. One may wonder why any\nrational person would commit such an atrocity; yet many\nresearch workers actually seem to have no better concept\nof what a technical talk should be. Needless to say, the\ntalk, like the printed report, should convey information.\nSimplicity\nYou will be given, say, 20 minutes in which to present\nto visiting scientists a review of your research. Your first\nreaction is to insist that you need more than 20 minutes.\nYour arguments will be rejected, however, so you eventually\nproceed complainingly to your task. With great ingenuity\nyou apply yourself to outwit your stubborn and arbitrary\nboss by getting an hour's material into a 20-minute talk.\nYou concoct long and brilliantly comprehensive sentences\nfor your discussion, you organize all of your numerical\nresults so that you can present them in rapid-fire order, and\nyou lay out 15 slides, each crammed with detailed informa-\ntion. Unfortunately, when you first read through your\nprepared speech, it takes nearly 30 minutes instead of 20.\nYou are not very disturbed, however, because you are\nconfident that, with a little practice, you will be able to\nincrease your speaking rate until the delivery time is down\nto the required 20 minutes.\nAll that is missing from your approach is consideration\nfor the central figure-the\nman in the audience. After\n2 minutes of your talk he will be rapidly developing mental\nindigestion; after 5 minutes he will have lost the thread of\nyour discussion; and during the remainder of your talk he\nwill simply concentrate on hating you or on trying to sleep.\nIf you will consider that he will probably hear about 15talks\nduring the day, on a variety of subjects in perhaps none of\n\nwhich he is expert, and if you will ask yourself how much a\nperson can hope to learn in one day (learn, that is, so that he\nwill remember it for a long time), you will see the futility of\ntrying to cram detailed information into him as if you were\nstuffing a goose. Actually, your mission will usually be\nsuccessfully accomplished if you leave him with a fairly\nclear impression of the nature of your work and of your\nmost significant results or contributions.\nIn preparing your talk, then, your first task does not\nconsist of gathering together all of your data so that not a\nsingle detail is missing, but rather in thinking over your\nsubject and deciding just what fundamental progress you\nhave made, or what new fundamental ideas you have devel-\noped, that you wish to give your hearer to carry away with\nhim.\nIn fact, you will do better not to reacquaint yourself\nwith the details at this time, because if you yourself have\nforgotten them they certainly do not represent the basic new\nideas or contributions that you would like your hearer to\nremember.\nDetails such as numerical data have their place,\nof course, in the technical talk; but you must make clear\nwhether the numbers are of such fundamental importance\nthat they should be remembered as such, whether they are\npresented for comparison with other numbers, as in showing\ntrends or in showing agreement between theory and experi-\nment, or whether they are presented merely to show the\nthoroughness or the scope of your work (as when the\nresearch consists of determining large quantitities of design\ndata).\nYou should next consider how to organize your pre-\nsentation with utmost simplicity and logic, so as to maximize\nthe probability that your hearer will absorb your story.\nAs to whether the allotted time is adequate, the question\nneed not concern you.\nYou should be able to describe your\nwork in any specified amount of time, be it 1 minute or\n1hour, and all that is required of you is that you present as\ninformative and understandable a story as possible within\nthe allotted time.\n\nChoice of Language and General Approach to Presentation\nSuppose that your friend Joe should ask you to tell\nhim about your research.\nWould you proceed with language\nof the following type?\nThe momentum method of measuring profile\ndrag, which consists of making total-pressure and\nstatic-pressure measurements across the wake and\ninserting these measurements into certain integral\nexpressions developed by Betz and Jones, has been\nan important addition to experimental aerodynamics.\nUnfortunately, application to flight evaluation of the\ndrag contributed by wing surface roughness or by\nvarious protuberances has been hampered by the\nexperimental difficulty of making the necessary\nnumber of simultaneous pressure measurements in\nthe wake.\nIn the present research, an effort has been made\nto reduce the experimental complication in order\nthat application to flight testing may be made more\npractical. . . .\nSuch sentences might well be the introductory sentences\nof a printed technical report; but as spoken material they\ndemand a degree of concentration that most listeners cannot\nmaintain.\nIf, in addition, they are spoken in a rapid mono-\ntone, the listener's position is hopeless almost from the very\nbeginning.\nActually, as a result of your years of experience in\nconversation, both technical and nontechnical, you have\ndeveloped a speaking style that is not too demanding of\neither your own or your listener's mental processes, and that\nserves satisfactorily to convey your ideas; and this speaking\nstyle, in general, is entirely different from that of a printed\ntechnical report. Using this style, you would speak to Joe\nperhaps as follows:\nYou're probably familiar with the momentum\nmethod of measuring profile drag (a pause, while\nyou look at him to see whether he nods his head or\nmerely looks blank; you decide to add a few words of\n\nexplanation), in which you measure total and static\npressures at a number of points across the wake,\nput the readings into certain formulas, and finally\nintegrate across the wake to get the drag (a pause)-\nthe profile drag, that is. The method ought to be\nespecially useful for flight measurements behind\nactual airplane wings, in order to determine the drag\ndue to (a pause, a slight motion of the hand, while\nyou think of examples) rivet heads, gun ports, or\nany other irregularities. Now, trying to make all those\nmeasurements in the wake would require rather\ncomplicated instrumentation-which\nis the reason\nthat it hasn't been done-and\nwhat I have tried to\ndo is to simplify the method-especially\nto simplify\nthe instrumentation-down\nto something more\npractical. . . .\nSuch language and the indicated mannerisms (pauses,\nhand motions, and so on) are more characteristic of some\npeople than of others.\nYour own normal manner of speak-\ning, for example, may be entirely different. There is no\nobjection at all to your having and expressing your own\npersonality; and it is definitely not suggested that you try\nto imitate anyone else's mannerisms or style of speech.\nThe point emphasized here is that, in general, merely reading\nor reciting a carefully written technical report does not con-\nstitute a technical talk. In your daily technical discussions\nwith your coworkers, or if you were teaching a class, you\nwould not expect your friends or students to understand you\nif you poured forth such formal language-especially\nif you\nspoke rapidly and with an expressionless voice; and you\nshould not demand more of an audience at a technical\nconference.\nThe conclusion, then, is that the technical talk is not\nmerely a technical report that is short enough to read or\nrecite in, say, 20 minutes; rather, it is a monologue, presented\nin whatever conversational, or perhaps teaching, manner\nis natural to you, in which you try your very best to get\nacross a few basic ideas to your audience. Since the man\nin your audience cannot reexamine any sentence or para-\n\ngraph that he finds confusing, you must make every thought\nclear enough to be understood the first time. If the thought\nis a difficult one, you may even find it best to repeat it.\nYou may repeat it in the identical words, or you may use\ndifferent words and a slightly different approach. For\nexample, add \"Perhaps you didn't quite follow that idea.\nWhat I mean is that if . . . .\" Speak easily and not too\nrapidly. Even an awkward hesitation, while you grope for\nthe right word (just as in normal conversation), may have\nsome value in that it excites the hearer's interest while\nhe tries sympathetically to guess the word you want. Avoid,\nhowever, affecting excessive casualness or extemporaneous-\nness, since the effectiveness of the talk can be spoiled by\nthe appearance of carelessness in its preparation or lack\nof earnestness in its presentation.\nIn general, the talk should not be written out during\nits preparation.\nThe inexperienced speaker will usually be\nunable to write anything but the formal sentences of the\ntypical printed report, so that his talk is ruined from the\nmoment he puts pencil to paper.\nCompose it entirely in\nyour mind, and, as you compose each sentence, make the\nhand motions, hesitations, facial expressions, and so on that\nwill accompany it. At the same time ask yourself whether\nit will be clear; and if not sure, struggle with it some more.\nAfter you are satisfied with your opening sentences, your\nconclusions, and a few other especially critical sentences,\nyou may write them down in order to assure having them\nexactly as you compoaed them. Do not try to improve\nthem as you write them down, however, for you will surely\nspoil them.\nThe question as to whether your talk should be memo-\nrized will now be seen as rather irrelevant and misleading.\nAfter you have composed and rehearsed your talk so that\nin two successive rehearsals (alone or with a friend) you\nwere satisfied with it, you may be sure that the final talk\nwill be satisfactory. Some speakers will, by this time,\n\nhave essentially memorized every word and gesture, while\nothers will remain quite flexible as to detail. There is\nactually very little chance that you will forget anything\nimportant, and no more than a small card outlining your\nmain points should be taken with you to the speaker's\nst and.\nIt is not intended here to imply that preparing and\ndelivering a talk in this manner is a simple task for the\ninexperienced.\nThe same, perhaps, applies to almost all\nthe precepts presented in this pamphlet-they\nare easier\nto agree with than to incorporate in your style. On the\nother hand, the task is not nearly so formidable as many\npeople seem to believe.\nThe technique is merely one\nmore of those that could not be taught in your formal\nschooling but that you have to learn in order to be effective\nin your job.\nDoes the danger of stage fright make you want to rely\non written copy? Actually, much less reason exists for\nemotional reactions in technical talks than in typical college\n\"public speaking.\"\nIn the latter, emphasis is generally on\ndemonstrating or exhibiting the speaker, with the contents\nof his speech of minor significance, whereas, in the technical\ntalk, the contents are of paramount importance, while\nthe speaker is merely the medium through which they are\npresented. If you should ever listen to the comments of\nan audience after a technical conference has adjourned, you\nwould find that oddities of presentation, such as strange\naccents, speech defects, nervousness, or even grotesque\neccentricities of manner seem to go virtually unnoticed so\nlong as they do not interfere with intelligibility, while bitter\ncriticism is applied to speakers who read incomprehensible\npapers. Bear in mind, then, that you are not required to\ngive a polished performance, but only a clear one. Your\nlisteners are not interested in judging you. They want only\nto understand what you are telling them.\n\nVisual Aids\nIn the preceding discussion the point has been emphasized\nrepeatedly that your technical talk should resemble as closely\nas possible the description of your work that you might give\nto your friend Joe.\nJust as you might show him your appara-\ntus or your plots, or perhaps go to the blackboard and make\nan explanatory sketch, so should you use the same or similar\nvisual aids in your talk. Instead of being shown on paper\nor on the blackboard, your illustrative material will normally\nbe on charts or slides, prepared in advance with all necessary\naccuracy, clarity, and neatness. Do not consider, however,\nthat such previous preparation saves much time in the pres-\nentation, or that you may present a chart with nothing more\nthan a vague gesture and a remark like \"This chart illustrates\nwhat I have just said.\"\nActually, your charts and slides form the backbone of\nyour talk, and each must be presented with utmost effort at\nclarity. State the subject of the slide, say what the abscissas\nand ordinates are, explain, if necessary, the special signifi-\ncance of these abscissas and ordinates and of the method of\nplotting, and, if the origin is not at the juncture of the scales,\nmention that fact also. Run your pointer along each curve\nas you describe it, and tap sharply with your pointer at any\npoint on the curve to which you call special attention.\n(But\navoid vigorously rubbing or gouging the projection screen\nwith the pointer, as the glass-bead surface is easily damaged.)\nFurthermore, the language used while discussing your slides\nshould be appropriate to your use of the pointer. For\nexample, say \"This top curve shows . . .\" rather than \"The\nupper curve of figure 5 shows . . .\" or \"You can see in this\nequation that this term cancels this term and this term\ncancels this term\" rather than \"It may be seen in equation (4)\nthat the third and fourth terms on the left side are canceled\nby the second and fourth terms, respectively, on the right\nside.\"\n\nMake every effort to keep your charts and slides simple.\nAs has already been emphasized, your purpose is to get\nacross a few basic ideas rather than to present large quantities\nof information.\nThe number of slides and charts to prepare depends, of\ncourse, on many factors and can hardly be prescribed by\nformula. Nevertheless, it may be of interest to note that\nexperienced speakers seem to use, on the average, about one\nslide for every 2 or 3 minutes of their talks. Presumably, if\nyou use fewer slides, you may be needlessly sacrificing helpful\nillustrative material, or else you may be trying to crowd too\nmuch on each slide, while if you use more slides you may be\ntrying to present too much information. \"Two to 3 minutes\nper slide,\" of course, is hardly the type of rule to be followed\nstrictly; it is mentioned here only as a guide to the inexpe-\nrienced speaker. The only rule that is absolutely basic is that\nyour material should be presented as clearly as possible.\nOrganization and Contents\nThe organization and contents of a technical talk are, in\ngeneral, similar to those of the written report, although a\ncertain degree of flexibility is permissible for the purpose of\nincreasing clarity or of maintaining interest. As has\nalready been indieated, thoroughness, completeness, and\nrigor may have to be sacrificed in order not to present your\nhearers with more than they can assimilate. Emphasis will\nbe on no more than a very few topics, and all the incidental\nmaterial that would be meticulously detailed in a printed\nreport will be largely eliminated from the talk. For example,\nif your experimental results and their implications form the\nessence of your talk, you should minimize the description\nand justification of your experimental technique. Here, of\ncourse, your language and manner are especially important-\nwhile curtailing your remarks on experimental techniques,\nyou must nevertheless give your audience a feeling of reason-\nable confidence in your results.\n\nTechnical talks frequently seem to be organized around\nslides or other visual material. The talks seem to consist\nonly of descriptions and discussions of the slides, and even\nthe Introduction and the Conclusions may depend on slides.\nThere is no objection to such a presentation, so long as the\nspeaker gets his message across. You must not conclude\nfrom such talks, however, that the slides were prepared\nfirst and the talk was then composed around them. Slides\nand charts should be composed along with the talk, not\nbefore it. Avoid preparing them first and then trying to\ndecide what to say about them, because a considerable loss\nof smoothness and logic may result.\nThe Printed Version\nIf a printed version of your talk is to be included in\npublished proceedings of the meeting, write it in the more\nformal style of printed reports; but by no means feel obliged\nto carry over the same language and coverage into the talk\nitself. The printed version may, indeed, include data and\ndiscussion that had to be omitted from the talk, and may\neven include figures and tables that were not -used in the\ntalk itself. Such extensions of the paper should be held\nwithin bounds, however; published proceedings of technical\nmeetings are not usually intended as substitutes for normal\npublished reports.\nU. S.\nPRINTING OFFICE : 1968 0 - 314 - 680\n\n\"The aeraiz'iutical cnii rpcre irrtizj~ies of the liizited Statei .rhaI/ be\nrolzdi~ctrd so ns to ro?ztr.ibz~te . . . to he espnil.iiot2 o j h11111~212 Ktzotill-\nedge of pheizorne~zd it2 the atmosphet.e iltld ipnre. The .Id,r?i/zi~.tr.ntioiz\nshiz/l pro1 jde for the z~;idest pt~acticabie G I I ~npp~op~.i'itriiisse)i~i~zatiotz\nof infor.nratjo~z co~zcer~~ziizg\nits artiz ;ties nizd the l.e~ll/ti t h e ~ e o\nf.''\nNASA SCIENTIFIC AND TECHNICAL PUBLICATIONS\nTECHNICAL REPORTS: Scientific and technical information considered\nimportant, complete, and a lasting contribution to existing knowledge.\nTECHNICAL NOTES:\nInformation less broad in scope but nevertheless\nof importarlce as a contribution to existing knowledge.\nTECHNICAL ~~EMORANDULMS:\nInformation receiving limited distri-\nbution because of preliminary data, security classification, or other reasons.\nCONTRACTOR REPORTS: Technical information generated in con-\nnection with a NASA contract or grant and released under NASA auspices.\nTECHNICAL TRANSLATIONS: Information published in a foreign\nlanguage considered to merit NASA distribution in English.\nTECHNICAL REPRINTS:\nInformation derived from NASA activities\nand initially published in the form of journal articles.\nSPECIAL PUBLICATIONS:\nInformation derived from or of value to\nNASA activities but not necessarily reporting the results of individual\nNASA-programmed scientific efforts.\nPublications include conference\nproceedings, monographs, data compilations, handbooks, sourcebooks,\nand special bibliographies.\nDetails on the availability of these publications may be obtained from:\nSCIENTIFIC AND TECHNICAL INFORMATION DIVISION\nNATIONAL AERONAUTICS AND SPACE ADMINISTRATION\nWashington, D.C. 20546\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nMAS.111 Introduction to Doing Research in Media Arts and Sciences\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Generic powerpoint presentation for MAS111",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/mas-111-introduction-to-doing-research-in-media-arts-and-sciences-spring-2011/353decbf9dcdc88c9a18ea6b2557b6fa_MITMAS_111S11_mas111gnric.pdf",
      "content": "Descriptive But Brief Title\nYour Name\nYour Research Group\nIf this is sponsored research, acknowledge the sponsor\nhere (and also anyone else who has been a major\nhelper)\n\nOverview of the presentation\n- Background\n- Your contribution\n- Results\n- Conclusion\n\nBackground\n- What's the problem/idea?\n- Why should anyone care?\n- What's been done before, and by\nwhom?\n- What are you doing that's new, and\nwhat makes you think it's a good idea?\n\nYour Contribution\n- Explain here what you're doing, and\nhow it fits into the whole project\n\nResults\n- What happened?\n- What did you learn?\n\nConclusion\n- Wrap up what the audience should take\naway\n- What's next?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\nMAS.111 Introduction to Doing Research in Media Arts and Sciences\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}