{
  "course_name": "Introduction to Technology and Policy",
  "course_description": "This course explores perspectives in the policy process - agenda setting, problem definition, framing the terms of debate, formulation and analysis of options, implementation and evaluation of policy outcomes using frameworks including economics and markets, law, and business and management. Methods include cost/benefit analysis, probabilistic risk assessment, and system dynamics. Exercises include developing skills to work on the interface between technology and societal issues; simulation exercises; case studies; and group projects that illustrate issues involving multiple stakeholders with different value structures, high levels of uncertainty, multiple levels of complexity; and value trade-offs that are characteristic of engineering systems. Emphasis on negotiation, team building and group dynamics, and management of multiple actors and leadership.",
  "topics": [
    "Business",
    "Information Technology",
    "Leadership",
    "Operations Management",
    "Social Science",
    "Public Administration",
    "Science and Technology Policy",
    "Business",
    "Information Technology",
    "Leadership",
    "Operations Management",
    "Social Science",
    "Public Administration",
    "Science and Technology Policy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week for the first six weeks, 1 hour / session\n\nCourse Description\n\nESD.10 explores perspectives in the policy process - agenda setting, problem definition, framing the terms of debate, formulation and analysis of options, implementation and evaluation of policy outcomes using frameworks including economics and markets, law, and business and management. Methods include cost/benefit analysis, stakeholder analysis, and systems thinking. Exercises include developing skills to work on the interface between technology and societal issues; writing policy memos; keeping a policy principles journal; and case studies. Group projects illustrate issues involving multiple stakeholders with different value structures, high levels of uncertainty, multiple levels of complexity, and value trade-offs that are characteristic of engineering systems. Emphasis is placed on critical thinking, team building and group dynamics, and management of multiple actors and leadership.\n\nLearning Objectives\n\nAfter taking ESD.10, students should be able to:\n\nAppreciate the political, social, and institutional context of technological systems\n\nFormulate, analyze, and evaluate technology and policy options\n\nConceive, design, and execute a technology and policy research project, in the style of those done by the National Research Council\n\nCompare the historical dimensions of science and technology policy across countries\n\nExplain the impact of globalization on technology and policy\n\nDescribe how policy is done in the \"real word\" by its practitioners\n\nSummarize current technology and policy issues in environment, transportation, information technology, and standards setting policy\n\nWrite effectively for policy situations, both in short memos and longer reports\n\nSpeak effectively for policy situations, both in informal dialogue and formal presentations\n\nWork effectively in teams\n\nAssignments and Grading\n\nThere will be three individual written homework assignments, two group-based homework assignments, a policy principles journal, a team-based term project, and extensive reading and in-class discussions. Students will also attend and participate in six required discussion recitations in the first half of the semester.\n\nAll homework should be submitted in two ways: (1) electronically to the course website by the start of the class or the time specified on the due date, and (2) in hard copy that should be brought to class on the due date or submitted at another place if specified on the syllabus.\n\nIt is expected that assignments will be submitted on the due date and at the time noted in the course schedule (when no time is specified, assignment s are due at the beginning of class). The teaching team is well aware of the multiple time demands on students. In the case of unusual circumstance or unavoidable conflicts, please contact a member of the teaching team to discuss the details and explore alternatives. We are more receptive to hearing about issues well before the assignment is actually due.\n\nGrading will be on an absolute scale and not \"on a curve.\" That means that in principle, everyone in the class can earn an 'A' if they perform at an 'A' level. However, historically this has not been the case, with some portion of the class earning a 'B' or below. All assignments (with the exception of recitation deliverables, which will be graded on a pass/fail metric) will be graded on a letter basis according to the MIT definition of grades:\n\nA - Exceptionally good performance, demonstrating a superior understanding of the subject matter, a foundation of extensive knowledge, and a skillful use of concepts and/or materials.\n\nB - Good performance, demonstrating capacity to use the appropriate concepts, a good understanding of the subject matter, and an ability to handle the problems and materials encountered in the subject.\n\nC - Adequate performance, demonstrating an adequate understanding of the subject matter, and ability to handle relatively simple problems, and adequate preparation for moving on to more advanced work in the field.\n\nD - Minimally acceptable performance, demonstrating at partial familiarity with the subject matter and some capacity to deal with relatively simple problems, but also demonstrating deficiencies serious enough to make it inadvisable to proceed further in the field without additional work.\n\nF - Unsatisfactory performance.\n\nPlusses and minuses will be used in conjunction with the letters in grading all work. The final grade will include plusses and minuses.\n\nClass and Recitation Participation (20%)\n\nESD.10 is primarily a discussion-based experience, and it is through active listening, contemplation and participation in these discussions that much of your learning will take place. Thus, attendance is mandatory at both class and recitation, and students are expected to come to class and recitation having read the assigned reading beforehand, done any required assignments, and prepared to discuss the material and their assignment. Bring the books and reading to class each week, as they will be referred to in discussion, and come prepared to participate in discussion. Students should also come to class each week having read a national newspaper (from any country) and be prepared to discuss technology and policy related items in the news from time to time.\n\nHomework Assignments (30%)\n\nThere will be three individual homework assignments, and two group-based homework assignments. Answers to these should be coherent, well-written and follow the page length guidelines issued with the assignment (font must be Times, 12 point). They may also include a visual component. On the day an assignment is due (\"\nAssignment X due in class\n\"), come to class prepared to discuss your answer to the assignment, and contribute your work to the class discussion. A hardcopy of homework assignments should be brought to class on the day they are due.\n\nPersonal Policy Principles Journal (10%)\n\nA principle is a guideline or \"rule of thumb\" that is nearly universally applicable. Principles can be either prescriptive (they tell you how to do something) or descriptive (they describe a situation). Over the course of the semester, you will create the first entries in your own personal journal of policy principles that you will reference throughout the course of your career. Begin by writing down principles you observe or discern from the readings, guest lecturers and class discussions. The deliverable for this assignment is to pick 8-10 principles you have uncovered during the semester. For each principle, come up with a shorthand name for it, state the principle in no more than 1-2 sentences, and then elaborate on it further in a short paragraph. In the elaboration, you may wish to explain the principle in more detail if needed, give an example of it, say where or how you discovered this principle, what/who inspired it, what situations it would be most useful for, etc. - whatever would be most helpful to you in remembering all the richness that is embodied in the principle. Some of these principles (2-3) will be due mid-semester, and the remaining portion (6-8) will be due at the end of the semester, as indicated in the syllabus.\n\nTeam-based Term Project (40%)\n\nThere will be a team-based term project for the course - a group project conceived and conducted by small assigned groups of students (4-5 each). Each student is expected to contribute meaningfully to the project. Project grades will be based both on individual (40%) and collective (60%) performance. Term projects will be presented in class and to the ESD community at the end of the semester, and will also be written up in final papers. More information will be provided in a separate handout.\n\nBooks and Readings\n\nThere is one required text for this course:\n\nStone, Deborah.\nPolicy Paradox: The Art of Political Decision Making\n. New York, NY: W.W. Norton, 2001. ISBN: 0393976254.\n\nOther readings are listed on the\nreadings\npage.\n\nCalendar\n\nDuring the first half of the term, a small-group recitation session happens at the end of each week.\n\nThe calendar below provides information on the course's lecture (L) and recitations (R) sessions.\n\nSES #\n\nTOPICS\n\nLECTURERS\n\nKEY DATES\n\nL1\n\nIntroduction to Technology and Policy\n\nProf. Weigel\n\nL2\n\nThe Heart of Policy Arguments - Equity, Efficiency, Liberty, Security\n\nProf. Weigel\n\nHW 1 due\n\nL3\n\nPortraying Policy Problems - The Art of Framing in Many Languages\n\nProf. Weigel\n\nSelf assessment due\n\nTerm Project: NRC contact list due; NRC emails due three days before SES #L4\n\nR1\n\nVictim's Compensation Fund Case Study\n\nL4\n\nPolicy Strategy and Instruments\n\nProf. Weigel\n\nHW 2 due\n\nL5\n\nCurrent Issues in Technology and Policy: Environmental Policy Challenges I\n\nGuest - Prof. Dave Marks\n\nTerm project: Two committee charges due one day before SES #L6\n\nR2\n\nDiscussion of Stone Through the News: Equity and Efficiency\n\nL6\n\nClass Projects Update: Teams, Project Organization, and NRC Reports\n\nProf. Weigel\n\nHW 3 due one day before SES #L7\n\nR3\n\nDiscussion of Stone Through the News: Security and Liberty\n\nL7\n\nCurrent Issues in Technology and Policy: Environmental Policy Challenges II\n\nGuest - Prof. Dave Marks\n\nL8\n\nGovernment Policy and Technology I - History in the U.S.\n\nGuest - Prof. David Mindell\n\nTerm project: Committee list due two days after SES #L8\n\nR4\n\nCase Study - London Congestion Pricing\n\nL9\n\nGovernment Policy and Technology II - International\n\nProf. Weigel\n\nHW 4 due\n\nR5\n\nCase Study - KIDSNET\n\nL10\n\nChallenger Case Study\n\nGuest - Prof. Daniel Hastings\n\nTerm project - Project proposals due\n\nL11\n\nSystems Thinking: Origins and Why It Matters To Policy\n\nProf. Roos\n\nPersonal policy principles journal - 1st 3-4 principles due\n\nR6\n\nUnderstanding Systems Thinking\n\nL12\n\nPolicy Analysis I\n\nProf. Weigel\n\nTerm project - 360° team evaluations due\n\nL13\n\nGlobalization Impacts: Government - Industry Interactions\n\nGuest - Prof. Suzanne Berger\n\nL14\n\nPolicy Analysis II\n\nProf. Weigel\n\nHW 5 due\n\nL15\n\nGlobalization Impacts: Supply Chains\n\nGuest - Prof. Yoshi Sheffi\n\nL16\n\nGlobalization Impacts: Globalization and the Automotive Sector\n\nProf. Roos\n\nTerm project - draft report and executive summary due\n\nL17\n\nClass Projects Update\n\nAll\n\nL18\n\nPolicy Analysis III\n\nProf. Weigel\n\nL19\n\nFocus Area: Policy Perspectives on Transportation\n\nGuest - Bob Skinner\n\nL20\n\nFocus Area: The Big Dig - Policy Implications and Lessons\n\nGuest - Fred Salvucci\n\nL21\n\nNo Class; Project Work Time\n\nTerm Project - outside feedback due\n\nL22\n\nCurrent Issues in Technology and Policy: IT and Privacy\n\nGuest - Frank Field\n\nL23\n\nCurrent Issues in Technology and Policy: The Role of Standards In Technology and Policy\n\nGuest - Dr. William Jeffrey, Director, National Institute of Standards and Technology (NIST)\n\nL24\n\nFinal Project Presentations\n\nStudents\n\nL25\n\nFinal Project Presentations (cont.)\n\nStudents\n\nFinal project reports due one day after SES #L25\n\nTerm project: project team evaluations due one day after SES #L25\n\nL26\n\nPolicy Principles: Discussion and Reflection\n\nProf. Weigel\n\nHW 6 due\n\nL27\n\nConclusion and Wrap-up\n\nAll",
  "files": [
    {
      "category": "Resource",
      "title": "policy_journal.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/86e1952bdcdabbb0d2c2c563fe11c6ab_policy_journal.pdf",
      "content": "ESD.10 Introduction to Technology and Policy\nPolicy Principle Assignment\n\nDescription of Assignment\n\nA principle is a guideline or \"rule of thumb\" that is nearly universally applicable. Principles can\nbe either prescriptive (they tell you how to do something) or descriptive (they describe a\nsituation). Over the course of the semester, you will create the first entries in your own personal\njournal of policy principles that you will reference throughout the course of your career. Begin\nby writing down principles you observe or discern from the readings, guest lecturers and class\ndiscussions. The deliverable for this assignment is to pick 8-10 principles you have uncovered\nduring the semester. For each principle, come up with a shorthand name for it, state the principle\nin no more than 1-2 sentences, and then elaborate on it further in a short paragraph. In the\nelaboration, you may wish to explain the principle in more detail if needed, give an example of it,\nsay where or how you discovered this principle, what/who inspired it, what situations it would be\nmost useful for, etc. - whatever would be most helpful to you in remembering all the richness\nthat is embodied in the principle.\n\nDeliverable\n\n2-3 of these principles will be due in class October 18th, and the remaining 6-8 principles will be\ndue at the end of the semester, as indicated in the syllabus.\n\nSome suggestions on designing your policy principles:\n\nPrinciples should be strongly stated, almost like a hypothesis, and framed in a way that you can\ndo thought experiments to validate or invalidate the principle. Principles are statements of\nuniversal truth. Thus when you do thought experiments against your principle, you are chiefly\nlooking for \"violations\" where your principle wouldn't be true. This is how you know when\nyou've actually stumbled upon a principle that will always work for you and serve you well in\nyour career, instead of case- or context-specific guidance that would break down with a change\nin environment, etc.\n\nExample of a Good Principle\n\nShorthand tagline for principle:\nIf the politics don't fly, the system never will\n\nStatement of the principle:\nThe ultimate success of a large, complex, engineering system is determined at least as much -\nand often more - by social and political factors as by technical performance.\n\nElaboration:\nThis descriptive principle comes directly from Brenda Forman in her excellent chapter entitled\n\"The political process and systems architecting\" in the book The Art of Systems Architecting by\n\nMaier and Rechtin. Potent historical technology-based examples of this principle include the\ncase of the Super Conducting Super Collider (SCSC) and the Space Exploration Initiative (SEI)\nof the early 1990s. The SCSC did not have a strong constituency of scientists, and the funds\nspent on the program would be largely concentrated in a few Congressional districts. The SEI\nwas too expensive, and could not be justified in an era of declining budgets and post-Cold War\npeace. Examples from my own career include the rejection of innovative out-of-the-box space\nsystem architectures by Jimmy Hill and the other legacy grey beard \"men who made the box.\"\nTo think about this principle in a prescriptive manner might yield the advice \"Always consider\nsocial and political factors in evaluating and selecting engineering system designs.\""
    },
    {
      "category": "Resource",
      "title": "self_assess.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/7f7cd1732cda3e12bc220b9c7ab950bd_self_assess.pdf",
      "content": "ESD.10 Knowledge Self Assessment\nPlease fill in your corresponding level for each knowledge area\n\nLEVEL 0:\nTo have no exposure to or knowledge of\n- Have I never heard about these topics at all?\n- Have I only heard about these topics in casual\nconversation?\nLEVEL 1:\nTo have experienced or been exposed to\n- Have I had some organized introduction to or\ninstruction on these topics?\n- Have I used some of these topics in my work?\n- Can I tell myself what these topics really mean?\nLEVEL 2:\nTo be able to participate in and contribute to\n- Do I know enough about these topics that I can\ncomprehend what other people mean?\n- Can I participate in give-and-take dialogue on these\ntopics?\n- Have I ever participated in an activity when this\ntopic was used?\n- Did I contribute to the discussion or action\nsurrounding this topic?\nLEVEL 3:\nTo be able to understand and explain\n- To whom could I explain these topics?\n- What would I actually tell them?\n- Have I ever actually explained any of these topics\nto someone else?\n- Have I written something about these topics?\n- Have I given a presentation where I explained\nthese topics or needed these topics to explain\nsomething?\nLEVEL 4:\nTo be skilled in the practice or implementation of\n- Have I applied my knowledge in this area? How\ndid I apply it?\n- Was I able to improve a situation by applying my\nknowledge in this area?\n- Have I applied my knowledge more than once?\n- Did I learn new things about this area by applying\nmy knowledge?\nLEVEL 5:\nTo be able to lead or innovate in\n- Have I ever lead an activity in this area?\n- Have I taught someone else about these topics?\n- Have I discovered new knowledge that has\nimproved practices in this area?\n\nLEVEL\nESD.10 KNOWLEDGE AREAS\n\nPolicy goals: equity, efficiency, security,\nliberty\n\nPolicy problem framing: symbols,\nnumbers, causes, interests\n\nPolicy solutions: inducements, rules, facts,\nrights, powers\n\nPolicy analysis: stakeholders, positions,\npowers, resources, channels, windows,\ntechnology constraints/enablers\n\nTechnology and policy research projects:\nprocesses, content, role of committees,\nexperts and their views, the National\nResearch Council\n\nHistorical dimensions of science and\ntechnology (S&T) policy: national\norganizations, national innovation systems,\norigins of government support of S&T\n\nImpact of globalization on technology\nand policy: government reactions, business\nreactions, industrial dynamics\n\nReal-life practice of policy: who, what,\nwhy, where, when, how\n\nCurrent technology and policy issues:\nenvironment, transportation, information\ntechnology, and standards setting\n\nPolicy memos: purpose, structure, content,\nlength, style\n\nPolicy research reports: purpose,\nstructure, content, length, style\n\nSpeaking for policy situations: purpose,\nstructure, content, length, style\n\nTeam work in policy: leading, facilitating,\nempowering, resolving conflicts, work\nbreakdown structure, group time\nmanagement\nVersion 1.0\nESD.10 Introduction to Technology and Policy\nFall 2006\n\nESD.10 Knowledge Self Assessment Worksheet\n\nName:\n\nDate:\n\nESD.10 Knowledge Areas\nProficiency Level*\n1. Policy goals\n\n2. Policy problem framing\n\n3. Policy solutions\n\n4. Policy analysis\n\n5. Technology and policy research projects\n\n6. Historical dimensions of science and technology policy\n\n7. Impact of globalization on technology and policy\n\n8. Real-life practice of policy\n\n9. Current technology and policy issues\n\n10. Policy memos\n\n11. Policy research reports\n\n12. Speaking for policy situations\n\n13. Team work in policy\n\nTotal\n\nAverage Level (Total divided by 13)\n\n*Proficiency Levels - See previous page for more details:\n0. To have no exposure to or knowledge of\n1. To have experienced or been exposed to\n2. To be able to participate in and contribute to\n3. To be able to understand and explain\n4. To be skilled in the practice or implementation of\n5. To be able to lead or innovate in\nVersion 1.0\nESD.10 Introduction to Technology and Policy\nFall 2006\n\nESD.10 Classroom Personal Norms Assessment\n\nOne a scale from 1 to 5, where 1 is very uncomfortable and 5 is very comfortable, please rate\nyourself on the following items. Circle the number that best describes how you feel.\n\nItems\nVery\nUncomfortable\n\nNeutral\n\nVery\nComfortable\nDisagreeing with the\ninstructor\nDisagreeing with my\nclassmates\nUsing a laptop in class\nVolunteering my thoughts in\nclass, unless specifically\ncalled upon to speak\nTaking credit for my\ncontributions to group work\n\nVersion 1.0\nESD.10 Introduction to Technology and Policy\nFall 2006\n\nESD.10 Knowledge Self Assessment and\nClassroom Personal Norms Assessment \"Tear Out\" Sheet\n\nESD.10 Fall 2006\n\nDate:\n\nKnowledge Self Assessment\n\nESD.10 Knowledge Areas\nProficiency Level*\n14. Policy goals\n\n15. Policy problem framing\n\n16. Policy solutions\n\n17. Policy analysis\n\n18. Technology and policy research projects\n\n19. Historical dimensions of science and technology policy\n\n20. Impact of globalization on technology and policy\n\n21. Real-life practice of policy\n\n22. Current technology and policy issues\n\n23. Policy memos\n\n24. Policy research reports\n\n25. Speaking for policy situations\n\n26. Team work in policy\n\nTotal\n\nAverage Level (Total divided by 13)\n\nClassroom Personal Norms Assessment\n\nItems\nVery\nUncomfortable\n\nNeutral\n\nVery\nComfortable\nDisagreeing with the\ninstructor\nDisagreeing with my\nclassmates\nUsing a laptop in class\nVolunteering my thoughts in\nclass, unless specifically\ncalled upon to speak\nTaking credit for my\ncontributions to group work\nVersion 1.0\nESD.10 Introduction to Technology and Policy\nFall 2006\n\nVersion 1.0\nESD.10 Introduction to Technology and Policy\nFall 2006"
    },
    {
      "category": "Resource",
      "title": "hw1_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/921d4230ded087b50b4a70c0ca3688ea_hw1_soln.pdf",
      "content": "ESD.10 Introduction to Technology and Policy\n\nAssignment #1: Equity and Efficiency Issues\n\nDue: Monday, Sep 11th, at the start of class\n\nProblem:\nIn this assignment you will apply the concepts of equity and efficiency (as discussed in the Stone\nreading). The September 11th Victim's Compensation Fund will serve as the case study to\nexplore Stone's different concepts of membership, which is necessary before making decisions\non the distribution of resources.\n\n1. Create 8 different potential policy options for how to distribute the compensation for\nvictims of the September 11th attacks. These 8 options should be based on Stone's 8\ndifferent concepts of equality as laid out in the table on page 44 of her book. Fill in the\nattached matrix with a summary of your 8 policy options.\n\n2. Is there an equity-efficiency trade-off in this policy area? Make the case that there is a\ntrade-off, and then make the case that there is not a trade-off. Summarize both the \"Yes\"\nand \"No\" cases in a table on a single page.\n\nAssignment deliverables:\nQuestion 1: 1 page with a completed equity matrix (see next page)\nQuestion 2: 1 page laying out the opposing cases for the equity-efficiency trade-off\n\nEquity Matrix for Question #1 - September 11th Victim's Compensation Fund\n\nYour name: _______________________________________________\nDimension\nIssue\nYour Policy Option\nRecipients\nMembership\nAny victim of the Sept. 11 attacks (or their\nsurviving spouse) is given an equal share of\nthe VCF.\n\nRank-based distribution\nDistribute the VCF in amounts proportional to\nthe type of injury suffered from the attacks.\nSurviving spouses are given the highest\namount, followed by quadriplegics, then\nparaplegics, then amputees, and so on.\n\nGroup-based distribution\nDivide the VCF into two equal amounts, one\nfor surviving female victims and one for\nsurviving male victims. Because men are more\nlikely to be breadwinners and thus to have\nbeen injured in the workplace attacks, there are\nfewer members of the female group and they\nare thus given larger individual amounts of the\nVCF--compensating for their historical\nearnings disadvantage.\nItems\nBoundaries of the item\nDistribute the VCF so as to ensure that every\nvictim receives an equal total compensation\nfrom all sources including insurance, charities,\ngifts, etc.\n\nValue of the item\nUse a sliding scale to distribute larger amounts\nof compensation to poorer victims, who will\nvalue the benefits much more than the affluent.\nProcess\nCompetition\nInvite all victims and surviving spouses to the\nfield at Yankee Stadium. Drop the total\namount of the VCF in $100 bills from a\nhelicopter and allow everyone the chance to\ncollect as much as possible.\n\nLottery\nGive every victim and surviving spouse one\nticket for a random lottery that determines who\nreceives the entire amount of the VCF.\n\nVoting\nTreat every victim and surviving spouse as a\ncandidate for compensation. Allow the\ncandidates to campaign in the public arena and\nstate their case for compensation. Hold a\nnation-wide vote and then award the VCF in\namounts proportional to each candidate's\n(victim) share of the vote.\n\nQuestion #2: Is there an Equity-Efficiency Tradeoff with respect to the Sept. 11 Victim's\nCompensation Fund (VCF)?\nYes\nNo\nBy limiting the liability of air carriers for\ninjuries to third parties caused during the\nSept. 11 terrorist attacks, the VCF reduces\nincentives for air carriers and other\ncompanies to innovate and adopt counter-\nterrorism technologies and protocols.\nIf lawsuits were allowed to proceed\nunfettered against air carriers for injuries\ncaused on Sept. 11, the resulting awards\nmight be so large as to cripple the air\ntransport sector. Liability limits actually\nprovide the necessary financial security for\nair carriers to maintain operations and\nimprove counter-terrorism efforts.\nThe VCF transfers payments from taxpayers\nto terrorism victims, not from the parties that\ncaused injuries (terrorists, negligent security\nscreeners, defective radio manufacturers, etc.)\nto the victims. This exchange is more\nefficient than determining fault through\nlawsuits but is not as fair.\nThe taxpaying public has never questioned\nthe fairness of the VCF on these grounds.\nSociety accepts the premise that a publicly-\nfunded VCF demonstrates an \"unprecedented\nexpression of compassion,\" a worthwhile and\ndesirable characteristic.\nThe bureaucracy required to administrate the\nVCF cost the government $87 million,\nincluding a $77 million payment to\nPriceWaterhouseCoopers. It is wasteful to\ndivert funds to a third party administrator that\ncould be used for victims' payments.\nAdministration is a productive activity in\nitself. The $87 million fee represents valuable\ninput for accounting firms and creates jobs,\npays salaries, etc.\n\nThe terms of the VCF stipulates that victims\ncannot work if they file claims, reducing\nproductivity. Claims filing is also prohibited\nfor undocumented aliens, unmarried life\npartners, and victims who did not seek\nmedical help before Sept. 12, reducing equity.\nThe VCF increases productivity and equity by\nproviding a streamlined process for Sept. 11\nvictims to quickly receive much needed\nfinancial assistance and put their lives back\ntogether in the wake of tragedy.\n\nThe VCF sidesteps the civil justice system in\nthe name of efficiency but thus denies\ncitizens their rights to a major pillar of\nAmerican democracy.\nThe means of the VCF might vary from civil\nlitigation but the ends are the same: financial\nbenefits are awarded in just amounts to\nvictims. The VCF only speeds up the process.\nDistributing money discourages survivors to\nwork, lowering economic efficiency.\nDistributing money helps survivors gain\nfinancial security, necessary for them to be\nproductive members of an efficient economy."
    },
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/189d6dc97dee40b760d4b39fa360f039_hw1.pdf",
      "content": "ESD.10 Introduction to Technology and Policy\n\nAssignment #1: Equity and Efficiency Issues\n\nDue: Monday, Sep 11th, at the start of class\n\nProblem:\nIn this assignment you will apply the concepts of equity and efficiency (as discussed in the Stone\nreading). The September 11th Victim's Compensation Fund will serve as the case study to\nexplore Stone's different concepts of membership, which is necessary before making decisions\non the distribution of resources.\n\n1. Create 8 different potential policy options for how to distribute the compensation for\nvictims of the September 11th attacks. These 8 options should be based on Stone's 8\ndifferent concepts of equality as laid out in the table on page 44 of her book. Fill in the\nattached matrix with a summary of your 8 policy options.\n\n2. Is there an equity-efficiency trade-off in this policy area? Make the case that there is a\ntrade-off, and then make the case that there is not a trade-off. Summarize both the \"Yes\"\nand \"No\" cases in a table on a single page.\n\nAssignment deliverables:\nQuestion 1: 1 page with a completed equity matrix (see next page)\nQuestion 2: 1 page laying out the opposing cases for the equity-efficiency trade-off\n\nEquity Matrix for Question #1 - September 11th Victim's Compensation Fund\n\nYour name: ____________________________________________________________\n\nDimension\nIssue\nYour Policy Option\nRecipients\nMembership\n\nRank-based distribution\n\nGroup-based distribution\n\nItems\nBoundaries of the item\n\nValue of the item\n\nProcess\nCompetition\n\nLottery\n\nVoting"
    },
    {
      "category": "Resource",
      "title": "hw2_reading.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/d57eb0e5433535af63223cd54eaee129_hw2_reading.pdf",
      "content": "From the New York Times (nytimes.com)\nhttp://www.nytimes.com/2005/09/12/business/12fda.html?pagewanted=print\n(requires New York Times login, which is free)\n\nSeptember 12, 2005\nF.D.A. Had Report of Short Circuit in Heart Devices\nBy BARRY MEIER\nMonths before the Food and Drug Administration issued a safety alert in June about\nproblems with Guidant Corporation heart devices, the agency received a report from the\ncompany showing that some of those units were short-circuiting, agency records obtained\nby The New York Times show.\nBut the agency did not make that data public at the time because it treats the information\nit receives in such reports as confidential. While the agency has a policy of reviewing the\nreports within 90 days, it is unclear when regulators did so within that time frame or how\nthey first interpreted the information.\nAs part of a lengthy annual report that Guidant submitted to the F.D.A. in February, the\ncompany disclosed data showing that one of its widely used defibrillators, the Ventak\nPrizm 2 DR, was short-circuiting at the rate of about one a month, a rate that some\ndoctors say was troubling. A month later, a college student who had one of those units\nimplanted in his chest died of sudden cardiac arrest.\nIn June, the F.D.A. issued an alert about the model, later updating it to say that the short\ncircuits, while rare, posed a significant risk because they could render the device useless\njust when it was needed most. Defibrillators use jolts of electricity to stop erratic heart\nrhythms, which can be fatal.\nGuidant, which knew about the model's flaw for three years but did not tell physicians\nabout it until May, has recently found itself in the spotlight. But the disclosure that the\nF.D.A. also had data that might have alerted doctors is likely to increase scrutiny of the\nagency's policy of not releasing the information it requires heart device makers to submit,\nas well as how quickly it reviews such reports.\nDr. Daniel G. Schultz, the director of the F.D.A.'s Center for Devices and Radiological\nHealth, said in an interview Friday that it would tie up too many resources to review\nhundreds of filings the F.D.A. receives each year and determine which data could be\nroutinely released and what should be treated as confidential.\nMakers of defibrillators and pacemakers, which regulate heart rhythms, must file annual\nreports with the F.D.A. that say how often, and why, their devices fail. The level of detail\nin these reports, which are submitted on paper, is far higher than is required for other\n\nmedical devices because of their life-sustaining roles. Those filings also include much\nmore data than the summaries that companies give to doctors.\nThe issue of how much safety data is disclosed to doctors and patients is expected to be a\nmajor focus of a meeting on Friday of heart specialists in Washington that was called as a\nresult of the Guidant controversy. That meeting may pit physicians who want more\ninformation about device failures against manufacturers, as well as other doctors, who\nsay the current system is adequate to ensure patient safety.\nLast year, both the F.D.A. and the drug industry came under fire for failing to release data\nabout clinical drug trials like those involving the use of antidepressants in children. The\nGuidant controversy appears to be expanding that debate into the medical devices field.\nDr. Shultz said he did not believe that the effort of disclosing the massive amounts of\ndata sent in by manufacturers would be an effective use of agency resources and time.\n\"It does not at first blush look like an efficient way of getting information to the public in\na timely fashion,\" he said. He added that he hoped the meeting Friday would lead to\nimproved communication between the agency, device makers and doctors about device-\nrelated problems.\nThe agency's inquiry into Guidant began after The Times reported in late May that the\ncompany had not told doctors about flaws in the Prizm 2 DR and kept selling older\nversions of the model after developing an improved one in 2002. Guidant has said it\nknows of 28 units that have short-circuited out of 26,000 made before the modification.\nDr. Schultz said he was not familiar with the February report from Guidant that broke out\nthe short circuit figures. He said he did not have information about what percentage of\nreports were reviewed within 90 days.\nTold of Dr. Schultz's comments about the agency's disclosure policies, Dr. Douglas P.\nZipes, a professor at the Indiana University School of Medicine, said he took exception to\nthem, saying he believed that the Guidant episode had highlighted gaps in how the F.D.A.\noversaw the safety of heart devices. Dr. Zipes added that both the agency and\nmanufacturers needed to provide doctors with more data about product failures.\n\"It would help us put into better perspective the quality of each manufacturer's devices,\"\nsaid Dr. Zipes, who is also a consultant to Medtronic, a major device manufacturer that\nalso makes a defibrillator, and who will be participating in Friday's meeting.\nGuidant has said it made all required disclosures to the F.D.A., including notifying the\nagency in its 2003 annual report about the manufacturing change to the Prizm 2 DR. The\ncompany also submitted several filings in recent years to a publicly available F.D.A.\ndatabase about the failures of specific units, citing short circuits as the cause.\n\nThe F.D.A. does start investigations of product problems based on the reports in that\ndatabase and in annual filings. But unless F.D.A. officials were closely monitoring the\ndatabase, which receives tens of thousands of reports a year, the annual report in\nFebruary may have been their first chance to gauge the Guidant problem's scope, because\nit was the first of the annual filings to say that a number of devices had failed because of\nelectrical short circuits.\nThe problem came to light as a result of the death in March of Joshua Oukrop, a college\nstudent in Minnesota who received a flawed device. Since then, Guidant has issued\nrecalls covering both that device and tens of thousands of other defibrillators and\npacemakers.\nThe three largest makers of heart devices - Guidant, Medtronic and St. Jude Medical -\nregularly provide doctors with what are called product performance reports.\nMedtronic's reports are the most detailed, breaking down the number of failures for a\nmodel into two broad categories: electrical failures and early battery depletion. Guidant\nand St. Jude provide only an estimated \"survival\" rate for each model over time, without\ngiving the cause of failure. That rate indicates the risk that the device will have to be\nreplaced because of a problem or because its batteries are depleted, which normally\nhappens after five years.\nIn its 2004 product report, for example, Guidant reported that its Prizm DR 2 had an\nestimated survival rate of 98.14 percent after 3.5 years.\nA Medtronic spokesman, Robert Clark, said the company believed that its annual reports\ngave doctors the information they needed in an easy-to-use format. Mr. Clark added that\nMedtronic did not believe that releasing the detailed F.D.A. reports would be helpful. But\nboth Mr. Clark and a St. Jude spokeswoman, Charlotte Fransen, said their companies\nwere interested in discussing such matters at Friday's meeting of heart specialists. A\nGuidant spokesman, Steven Tragash, did not respond to an e-mail inquiry about the issue.\nSeveral doctors said that knowing specifically why devices are failing is important\nbecause some problems are more significant than others.\n\"Device failures that are abrupt and catastrophic are more critical than ones that happen\nslowly or don't interfere with life-saving functions,\" said Dr. Charles Swerdlow, a\ncardiologist in Los Angeles who is also a consultant to Medtronic.\nThe F.D.A. initially refused a Times request for several years of Guidant annual filings\nthat was made under the Freedom of Information Act, contending that the filings\ncontained trade secrets. The Times appealed that decision to the agency, and the F.D.A.,\nwithout citing a specific reason, reversed its position and last week released much of the\ndata.\n\nThose filings show the wide gap between the data provided to the F.D.A. and that given\nto doctors. For each defibrillator model it sells, Guidant provides data that runs for three\nto four pages citing specific reasons for device failure, including memory problems and\nprematurely low batteries, and how many units failed for that reason.\nIn its 2004 filing, Guidant devoted a 96-page section to data on its defibrillator models. In\na table on page 60 of that section, it reported that 10 Prizm 2 DR's had an \"electrical\nshort\" between June 1, 2003, and May 31, 2004, the period covered by the filing. That is\na failure rate of almost one device a month.\nThe filings may also raise new questions about Guidant's reporting of problems with the\nPrizm 2 DR. For instance, while Guidant has said that two of the units short-circuited in\n2002, the 2004 report is the first annual filing to use the term \"electrical short.\" The term\n\"electrical overstress\" was used in earlier filings, but it also appeared as a separate\ncategory from \"electrical short\" in the 2004 report. That report was submitted by Guidant\nthis February, eight months after the period it covered. In the three prior years, Guidant\ntook three months to file.\nMr. Tragash, the Guidant spokesman, did not respond to questions about specific reports\nbut reiterated that the company had made all required disclosures.\nIn December, Guidant agreed to be acquired by Johnson & Johnson in a deal worth $25.4\nbillion. Johnson & Johnson has said it plans to proceed with the acquisition but is\nreviewing issues related to the device recalls.\nThe F.D.A. says its investigation of Guidant is continuing and it has not determined what\naction, if any, to take against the company.\nIn recent months, some of Guidant's most outspoken critics have been the doctors who\ntreated Mr. Oukrop, the student who died. They say that if the company had made them\naware of the problem, they would have quickly replaced Mr. Oukrop's defibrillator. On\nFriday, one of those physicians, Dr. Robert Hauser of Minneapolis, said he was irate to\nhear that the F.D.A. was given such data in February. Dr. Hauser said that if the agency\nhad disclosed it, it might have saved Mr. Oukrop's life.\n\"They probably didn't even read the report,\" he said. \"This is just scandalous.\""
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/f4cb0c83c4d0ec0764574036d4ed893f_hw2.pdf",
      "content": "ESD.10 Introduction to Technology and Policy\n\nAssignment #2: Policy Memo\n\nDue: Monday, Sep 18, at the start of class. Please turn your assignments in to MIT Server before\nclass, and bring a hard copy to hand in during class.\n\nLearning objectives:\n- Understand the components of a good policy memorandum\n- Gain practice in writing policy memos\n\nPreparation:\nTo prepare for this assignment, please read the accompanying recent article from the New York\nTimes, entitled \"F.D.A. Has Report of Short Circuit in Heart Devices.\" Further extensive\nbackground research is not required nor expected for this assignment.\n\nAssignment:\nYou are a Special Assistant to the Director of the U.S. Department of Health and Human\nServices (DHHS). She has become aware of recent heart device malfunctions, and has asked\nyou to prepare a decision memorandum on this issue. Specifically, she wants to know what the\nproblem really is, and her potential courses of action for dealing with it. She wants to know the\nbrief pros and cons of each course of action, and then your recommendation and reasoning for\nwhich course of action DHHS should take. Since she is a very busy woman, she won't read\nmore than one page. Thus, you must keep the memo to one page or less, 11 point Times font\n(keep in mind the Director is an aging woman who wears reading glasses), and 1-inch margins\non all sides. She needs the memo on her desk no later than 2:30pm on September 18. She has a\nmeeting with the DHHS Board of Advisors that same day at 3pm, where she will present your\nrecommendation.\n\nSome guidelines for a good policy memo:\n[Material below is drawn directly and indirectly from various sources, in particular\nhttp://www.acs.brockport.edu/~gsaxton/introduction%20to%20memo-writing.htm . More\nexcellent resources on writing policy memos can be found at this website.]\n\nGood policy memos are short, concise, and to the point. Good policy memos distill the countless\naspects of an issue that could be mentioned down to the key few that really matter to a decision\nmaker. Simultaneously, they focus on the aspects of the issue that are actionable and within the\npurview and interest of the decision maker - it does you little good to recommend that a decision\nmaker take an action which he or she is organizationally or politically or legally unable to do!\n\nStructure\nA policy memo is a document that provides analysis and/or recommendations for a particular\naudience regarding a particular situation or problem. A well-written policy memo reflects\nattention to purpose; it is well organized; and it has a clear, concise style. There are three key\nparts of a good policy memo, usually presented in the following sequence:\n1. Introduction - Open the memo by summarizing the problem or situation about which you\nare writing, and by providing a very brief summary of the conclusions/recommendations\nyou have reached during your analysis. The rest of the memo is designed to support the\nconclusions or recommendations you present.\n2. Background - Keeping in mind that different audiences need different amounts of\nbackground information, follow your introduction with a concise summary of any\nhistorical or technical that your audience needs to understand the arguments you are\nbuilding. In many cases, it may be that no background information is needed at all.\n3. Supporting arguments or analysis - Once you have set the stage for your audience, show\nhow this information leads logically to the conclusions/recommendations you have\nprovided. You may wish to present and refute counterarguments, present courses of\nactions along with benefits and drawback of each, etc. - whatever will best support your\nconclusions.\n4. Restatement or summary - Often at the end of a policy memo you will reiterate in one\nsentence (two at the very most!) your recommendation and chief rationale(s) for it.\n\nAudience\nIn most cases, you will know the audience for a policy memo because (1) you have been hired by\nthat individual or organization or (2) your instructor provides that information to you. Think\ncarefully about the needs and expectations of your audience. For example, if your audience is an\nelected official seeking analysis on a highly technical matter, you should generally assume that\nthe official lacks substantial technical expertise. You will need to define technical terms and\nprovide enough background about the situation you are discussing that such a \"lay\" audience can\ngrasp your arguments. On the other hand, if you are writing for a technically trained audience,\nyou will waste time and energy providing background information that your readers already\nknow.\n\nStyle and grammar aspects of policy memos:\n- Policy memos are written in a professional style, with proper use of grammar, spelling,\nand punctuation.\n- Wording should be concise, crisp, clear and to the point. In a space-constrained\nassignment of a memo, your words are like currency that you choose to invest in making\nyour point. Choose them wisely.\n- Third- (more often) or first-person (less often) are typically used (e.g. \"The Board\nsuggests,\" \"The team recommends,\" \"We believe,\" \"I think,\" etc.)\n- Active voice is always preferable to passive voice.\n- Bulleted or numbered lists may be used in moderation.\n- Always proofread your memo. Then proofread it again. Then have a colleague or friend\nproofread it one last time. Remember, a policy memo is read by a very important person,\nso typos and incorrect grammar will reflect poorly on you.\n\nLength: If you can keep a policy memo to one page while giving the decision maker only the\nmost essential information they need, you have done an excellent job. You will find that the\nhigher the rank of the decision maker reading you memo, the less time they will have to read\nyour memo, and hence the shorter it must be. You will also find that it takes you longer to write\na one-page policy memo than it takes you to write a three-page paper. Thomas Jefferson\n(famous U.S. President) said, \"Had I but more time, I would have written less.\" Plan you time\naccordingly.\n\nGrading for this policy memo:\nThe following aspects will figure into your grade for the policy memo:\n- Concise and clear framing of the problem, issues, actions, and recommendations are a\ncritical aspect of this assignment.\n- The one-page limit, including font and margin specifications, must be strictly adhered to.\nSubmissions that do not meet these requirements must be resubmitted in the proper\nformat and will incur a penalty for intentionally violating the requirement.\n- Grammar, punctuation, spelling, and a neat presentation are important in this assignment.\nPoints will be deducted for misspellings, typos, incorrect grammar, and the like.\n\nPlease seek the help of the MIT Writing and Communications Center for help,\nhttp://web.mit.edu/writing/index.html (617-253-3090). The Center offers scheduled\nappointments for writing consultation and also takes walk-ins on a first-come, first-served basis.\nThe Center also offers help specifically geared toward nonnative English speakers. We\nencourage everyone in the class to take advantage of assistance from the Writing Center. They\nhelp writers of all skill levels, and even Shakespeare would learn a thing or two from them.\nWhen you visit them, bring a copy of your assignment, the work you have done on it, and a\nnotion of the goals you would like to achieve."
    },
    {
      "category": "Resource",
      "title": "hw3_port_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/d03e1b124b0a26cc64247f24d722cad0_hw3_port_slides.pdf",
      "content": "10/02/06\nWedge Presentation - Portugal\nWedge Game:\nPortugal Presentation\nOctober 2, 2006\nJeremiah Connolly\nPaulina Ponce de Leon Barido\nTarek Rached\nFaaiza Rashid\nDecker Ringo\n\n10/02/06\nWedge Presentation - Portugal\nIntroduction\nand Context\n- Strategies that Promote:\n- Energy Security\n- Financial Equity\n- Feasibility\n- Flexibility\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nIncreased Efficiency\nin Buildings (2x)\n- First of Two Wedges\nis Low-Hanging Fruit\n- Long Term Financial\nSavings\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\n50% Greater Auto\nFuel Efficiency\n- Reduce\nDependence on Oil\n- Public Health\nBenefits\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nNatural Gas\nReplacing Coal Plants\n- Technology Exists\n- Better Backup for\nIntermittent Sources\n- Less Impact in\nExtraction\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nSolar/Wind Replacing\nCoal (1⁄2 Each)\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n- Domestic Source\n- Solar, Wind, and\nHydroelectric\nSystems are\nComplimentary\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nSlowing\nDeforestation\n- Implementation\nMatters\n- Environmental\nBenefits (Biodiversity)\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nConservation Tillage\n- Long-Term Savings\nfor Modest Capital\nInvestment\n- Implementation\nMatters\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nSummary\n- Efficient Buildings (2)\n- Efficient Vehicles\n- Natural Gas for Coal\n- Solar/Wind for Coal\n- Reduce Deforestation\n- Conservation Tillage\nEnergy Security\nFinancial Equity\nFeasibility\nFlexibility\n7 GtC\nyr\n\n10/02/06\nWedge Presentation - Portugal\nQuestions?"
    },
    {
      "category": "Resource",
      "title": "hw3_portugal.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/abc6066ef4057da7acf602ef6d2cac9c_hw3_portugal.pdf",
      "content": "Portugal Fact Sheet\nGENERAL INFORMATION1\nGeography\nLocation: Southwestern Europe, bordering the North Atlantic Ocean, west of Spain\nCapital name: Lisbon, geographic coordinates: 38 43 N, 9 08 W\nArea: total: 92,391 sq km (slightly smaller than Indiana)\nClimate: maritime temperate; cool and rainy in north, warmer and drier in south\nTerrain: mountainous north of the Tagus River, rolling plains in south\nNatural resources: fish, forests (cork), iron ore, copper, zinc, tin, tungsten, silver, gold, uranium,\nmarble, clay, gypsum, salt, arable land, hydropower\nLand use: arable land: 17.29%, permanent crops: 7.84%, other: 74.87% (2005)\nIrrigated land: 6,500 sq km (2003)\nDemography\nPopulation: 10,605,870 (July 2006 est.) (77th in world)\nAge structure: 0-14 years: 16.5% (male 915,604/female 839,004)\n15-64 years: 66.3% (male 3,484,545/female 3,544,674)\n65 years and over: 17.2% (male 751,899/female 1,070,144) (2006)\nMedian age: total: 38.5 years\nmale: 36.4 years\nfemale: 40.6 years (2006 est.)\nPopulation growth rate: 0.36% (2006 est.)\nBirth rate: 10.72 births/1,000 population (2006 est.) (188th in world)\nDeath rate: 10.5 deaths/1,000 population (2006 est.) (59th in world)\nLife expectancy at birth: total population: 77.7 years (52nd in world)\nLiteracy: definition: age 15 and over can read and write\ntotal population: 93.3%, male: 95.5%, female: 91.3% (2003 est.)\nTransportation\nAirports: 66 (2006) (only 43 w/ paved runways !!)\nPipelines: gas 1,099 km; oil 8 km; refined products 174 km (2004)\nRailways: total: 2,850 km\nRoadways: total: 72,600 km\npaved: 62,436 km (including 1,700 km of expressways)\nunpaved: 10,164 km (2002)\nVehicle Ownership: 575 passenger cars per 1,000 inhabitants (2004) 5th in EU\n1 Source: CIA World Factbook https://www.cia.gov/cia/publications/factbook/geos/po.html and EIA Country\nAnalysis Briefs http://www.eia.doe.gov/emeu/cabs/portugal.html\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 1 of 10\n\nECONOMY OVERVIEW\nPortugal is a relatively poor country; in 2003, Portugal had the lowest nominal per-capita GDP of all EU\nmember states. As member of the EU, Portugal has received funds to invest in its infrastructure and help\nits economy. Between1986 -- 2000 the country had an average real economic growth rate of 3.7% per\nyear. In 2001 Portugal's budget deficit was 4.3% of GDP, breaching the EU ceiling of 3%. After being\nreprimanded by the European Commission (EC), the Portuguese government introduced an austerity\nprogram to reduce the deficit, which stifled economic growth. The budget deficit ceiling is an important\nconstrain to the government's ability to enhance Portugal's economic competitiveness. Low cost\nproducers in Central Europe and Asia have been preferred over Portugal for foreign direct investment.\nFurther, unemployment rate is close to historically high levels, and job-creation has become more\nchallenging with the government's tight budget. In the past two decades Portugal has become an\nincreasingly service-based economy. Many state controlled firms have been privatized and key areas of\nthe economy, such as telecommunications and financial sectors, have been liberalized2. The privatization\nof Galp Energia (public utility) and TAP (airline) was recently announced3.\nGDP (PPP): $204.4 billion (2005 est.) (43rd in world)\nreal growth rate: 0.3% (2005 est) (202nd in world)\nper capita: $19,300\nGDP - by sector: agriculture: 5.3%, industry: 27.4%, services: 67.3% (2005 est.)\nLabor force: 5.52 million (2005 est.), agriculture: 10%, industry: 30%, services: 60% (1999)\nUnemployment: 7.6% (2005 est.) (71st in world, w/ #1 at 0%)\nInflation rate 2.3% (2005 est.) (consumer prices)\nBudget: revenues: $78.84 billion, expenditures: $90.27 billion\nPublic debt: 63.9% of GDP (2005 est.)\nAgriculture - products: grain, potatoes, tomatoes, olives, grapes; sheep, cattle, goats, swine, poultry,\ndairy products; fish\nIndustries: textiles and footwear; wood pulp, paper, and cork; metals and metalworking; oil\nrefining; chemicals; fish canning; rubber and plastic products; ceramics;\nelectronics and communications equipment; rail transportation equipment;\naerospace equipment; ship construction and refurbishment; wine; tourism\nIndustrial production growth rate: 0% (2005 est.) (148th in world)\nExports: $38.8 billion f.o.b. (2005 est.)\nExports - commodities: clothing and footwear, machinery, chemicals, cork and paper products,\nExports - partners: Spain 26%, France 13.1%, Germany 12%, UK 8%, US 5.4%, Italy 4.3% (2005)\nImports: $60.35 billion f.o.b. (2005 est.)\nImports - commodities: machinery and transport equipment, chemicals, petroleum, textiles, agricultural\nproducts\nImports - partners: Spain 29%, Germany 13.5%, France 8.5%, Italy 5.2%, Netherlands 4.3%, UK\n2 Source: CIA World Factbook https://www.cia.gov/cia/publications/factbook/geos/po.html and EIA Country\nAnalysis Briefs http://www.eia.doe.gov/emeu/cabs/portugal.html\n3 Portugal Country Report, 2006. Economist Intelligence Unit - The Economist, London, UK\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 2 of 10\n\n4.2% (2005)\nENERGY OVERVIEW4\nMinister of the Economy Carlos Manuel Tavares da Silva\nElectricity - production/consumption: 44.32 billion kWh produced / 44.01 billion kWh consumed (2003 est)\nElectricity - exports/imports: 3.1 billion kWh exported / 5.9 billion kWh imported (2003 est)\nElectric Generation Capacity: 10.4 GW (thermal 60%; hydro 38%; biomass, solar, wind 2%) (2002 est)\nOil 326,500 bbl/day consumed in 2003; No production or reserves;\nCrude Oil Refining Capacity: 304,172 bbl/day (2004 est)\nNatural gas: 2.983 billion cubic meters consumed in 2003; No production or reserves\nCoal Consumption: 6.3 Mmst (all imported, 2004 est); 40 million short tons of reseves (2001 est)\nSource: Portuguese Directorate General for Geology & Energy http://www.dge.pt/main.asp?IdTemas=11\nPortugal has extremely limited domestic energy reserves. It imports about 90% of its energy\nrequirements, much of which is oil (66% in 2002). The largest domestic energy resource is hydropower,\nwhich is unreliable because its contribution depends on rainfall. For example, in 2002 domestic\nhydropower accounted for 7% of Portugal's total primary energy consumption, dropping from 13% in\n2001. Energy imports, mainly natural gas from Algeria, are transported through Spain via pipelines while\noil arrives at the country's Sines and Porto terminals. Natural gas was introduced in Portugal's energy mix\nin 1996. In 1998, Portugal began importing liquefied natural gas (LNG) from Nigeria, which is regasified\nat Spain's Huelva LNG terminal. The Portuguese government has been promoting the development of\nrenewable energy resources, such as wind, mini-hydro (under 10 megawatts-MW), wave and biomass. In\nApril 2004, the Portugal and Spain formally inaugurated Mibel, a regional market within the broader EU\ninternal electricity market. The Portuguese government is also trying to liberalize its oil and natural gas\nholding company, Galp Energia, and auctioning its remaining stake in formerly state-owned utility\nElectricidade de Portugal (EdP) 5.\n4 EIA Country Analysis Brief, http://www.eia.doe.gov/emeu/cabs/portugal.html\n5 EIA Country Analysis Brief, http://www.eia.doe.gov/emeu/cabs/portugal.html\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 3 of 10\n\nSource: Portuguese Directorate General for Geology & Energy http://www.dge.pt/main.asp?IdTemas=11\nOil: No proven commercially viable oil reserves. Despite decades of exploration activity, Portugal has yet\nto discover a commercially viable oil deposit. It has two refineries, located in the coastal cities of Sines\nand Porto, and owned / managed by Petroleos de Portugal (Petrogal), which have a combined capacity of\n304,174 bbl/d. In April 1999, the Portuguese government created the holding company Petroleos e Gas de\nPortugal, SGPS, S.A. (Galp) to operate and manage the country's oil and natural gas industries. Galp\nholds shares from Petrogal, Gas de Portugal (GdP, gas distribution) and Transgas (natural gas import,\ntransmission and sales company). In April 2003, the Portuguese government approved a plan to demerge\nand to privatize Galp by restructuring the holding company's assets. These measures will consolidate the\ncompany's natural gas assets under GdP, including Transgas. Galp will continue to own Petrogal's\nupstream (oil production in Brazil and Angola) and downstream operations (distributing petroleum\nproducts and operating Portugal's two refineries at Sines and Porto). They will also make EdP a major\nelectricity and natural gas player in the Iberian peninsula. EdP currently owns a 40% stake in Spain's\nutility company Hidrocantabrico and a 62% stake in Naturcorp, a natural gas distributor in Spain's Basque\nregion, and controls much of Portugal's electricity sector6.\nNatural Gas: Portugal lacks any viable reserves. The natural gas sector has grown within the last decade,\nparticularly over the past few years with the Sines LNG import terminal and Maghreb-Europe pipeline\nthat connect the Iberian Peninsula to Algerian natural gas sources. GdP is the main player because it\ncontrols the import, distribution, transmission and sales of natural gas. Since natural gas is its infancy, it is\nunder a temporary exemption from EU requirements of liberalization7.\nCoal: Portugal has not produced coal since its last mine closed in 1994. It does import relatively small\namounts of coal for electricity generation, especially in periods of decreased hydropower8.\nElectricity: The electricity grid in Portugal is connected to Spain's, with 44,127 miles of high/medium\nvoltage transmission lines and 69,640 miles of low voltage transmission lines. About 10% of the power\ndemand could be imported from and vice-versa. Within Portugal there are two electricity systems--the\nPublic and the Independent. The Public Electricity System (PES) guarantees power supply through long\nterm contracts between power generators and transmission grid operator. In the Independent Electricity\nSystem (IES) consumers are free to choose their suppliers. Further, generation and distribution services\nare not restricted9.\nRenewables: Portugal has to meet EU requirements on electricity and has to increase renewable energy's\nshare of total energy consumption to 12% and electricity produced from renewables to 22.1% by 2010.\nCurrently, production of electricity from renewables in Portugal is dominated by large hydropower plants.\n6 EIA Country Analysis Brief, http://www.eia.doe.gov/emeu/cabs/portugal.html\n7 Ibid\n8 Ibid\n9 Ibid\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 4 of 10\n\nIn 2002, hydro accounted for approximately 80% of electricity generated from renewables. The\nPortuguese government wants to increase renewables' share in the country's power mix, focusing its\nefforts away from large scale-hydro towards increasing installed generation capacity of wind (with an\nexpected capacity of 3,750 MW by 2010) and small hydro (400 MW by 2010). To attract investment, the\ngovernment has established a feed-in tariff system, which gives higher rates per kilowatt hour. As a result\nboth domestic and foreign companies such as Iberdrola (Spain), Enersis (Chile), Gamesa (Spain), and\nGenerg (Portugal), have invested in wind, solar and wave power projects. Portugal currently is building\nthe world's largest solar power plant in Moura (southern Portugal), with an installed generation capacity\nof 64 MW. Iberdrola has under development a 75-MW wind farm and is negotiating for permits to install\nanother 174 MW. In 2004, the company acquired an 18-MW wind farm- Catefica - from Spain's\nGamesa10 .\nNuclear Power: Portugal has no nuclear power plants.\nSource: Eurostat http://epp.eurostat.ec.europa.eu/portal/page?_pageid=0,1136239,0_45571444&_dad=portal&_schema=PORTAL\nEnvironmental Overview11\nEnvironment - current issues: soil erosion; air pollution caused by industrial and vehicle emissions; water\npollution, especially in coastal areas\nEnvironment/international\nagreements:\nparty to: Air Pollution, Biodiversity, Climate Change, Climate Change-Kyoto\nProtocol, Desertification, Endangered Species, Hazardous Wastes, Law of the\nSea, Marine Dumping, Marine Life Conservation, Ozone Layer Protection, Ship\nPollution, Tropical Timber 83, Tropical Timber 94, Wetlands\nsigned, but not ratified: Air Pollution-Persistent Organic Pollutants, Air\nPollution-Volatile Organic Compounds, Environmental Modification\n- Total Energy Consumption (2002E): 1.1 quadrillion Btu* (0.3% of world total energy consumption)\n- Energy-Related Carbon Dioxide Emissions (2002E): 67 million metric tons (0.3% of world total carbon\ndioxide emissions)\n- Per Capita Energy Consumption (2002E): 107.4 million Btu (vs. U.S. value of 339.1 million Btu)\n- Per Capita Carbon Dioxide Emissions (2002E): 6.7 metric tons (vs. U.S. value of 20.0 metric tons)\n- Energy Intensity (2002E): 6,467 Btu/$ nominal-PPP** (vs U.S. value of 9,344 Btu/$ nominal-PPP)\n10 Ibid\n11 The total energy consumption statistic includes petroleum, dry natural gas, coal, net hydro, nuclear, geothermal,\nsolar, wind, wood and waste electric power. The renewable energy consumption statistic includes hydropower, solar,\nwind, tide, geothermal, solid biomass and animal products, biomass gas and liquids, industrial and municipal wastes.\nSectoral shares of energy consumption and carbon emissions are also based on IEA data\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 5 of 10\n\n- Carbon Dioxide Intensity (2002E): 0.39 metric tons of carbon/thousand $ nominal-PPP ** (vs. U.S.\nvalue of 0.55 metric tons/thousand $ nominal-PPP )\n- Fuel Share of Energy Consumption (2002E): Oil (66%), Coal (14%), Natural Gas (11%) Hydro (7%)\nOther renewable (2%)\n- Fuel Share of Carbon Dioxide Emissions (2002E): Oil (71%), Coal (20%), Natural Gas (9%)\n- Status in Climate Change Negotiations: Annex I country under the United Nations Framework\nConvention on Climate Change (ratified December 21st, 1993). Signatory to the Kyoto Protocol\n(signed April 29th, 1998 and ratified May 31, 2002).\nSource: Energy Policies of IEA Countries, Portugal 2004 Review\nhttp://www.iea.org/textbase/nppdf/free/2004/portugal.pdf\nConstrains on Portugal's Energy System: Portugal's future energy and environment policy\nscenario must be explored in the context of its integration in the European Union (EU). Portugal's\npolicies are also subject to the various international agreements the EU and its Member States have\nagreed to participate in and support. Under the 2002 Lisbon Strategy, the EU expressed interest in\nimproving its competitiveness by increasing its energy-usage efficiency, to remain a \"global leader\" in\nlow carbon technologies, and to improve its energy supply security by reducing their increasing\ndependence on imported sources of energy.12 These sustainability, competitiveness, and security issues\nare likely to remain as EU's principal future energy concerns.13 Portugal and the EU ratified the Kyoto\nProtocol in May 2002. The EU agreed to decrease its Green House Gas (GHG) emissions by 8% against\nthe base year of 1990 by 2008 - 2012. The EU has developed the \"Burden Sharing Agreement,\"\nthrough which it distributes different reduction targets among its members and uses an internal emissions\ntrading system to achieve its 8% reduction goal. Under this agreement Portugal is to limit its net increase\nin GHG emissions to 27% above the 1990 levels.14 The table shows that it is unlikely that Portugal will\nmeet its Kyoto target without taking advantage of the EU Emission Trading Scheme.15\nKyoto Expectation\n2005 Estimate\nPresent Target\n2010 Emissions\nCurb net increase of GHG\nemissions to 27% above\n1990 levels\nGHG emissions will be\n52% higher than 1990\nlevels (In 2000\nemissions were already\n50% higher).\nLimit GHG\nemissions to 42%\nabove 1990 levels.\nPortugal's energy policies include: Liberalization of the electricity market; creation of an Iberian market\nthrough integration of Portuguese and Spanish electricity market; privatization of national energy\n12 Comission of the European Communities. Lisbon Action Plan Incorporating EU Lisbon Programme and Recommendations for\nActions to Member States for Inclusion in their National Lisbon Programmes. Brussels, 2005\nhttp://ec.europa.eu/growthandjobs/pdf/SEC2005_192_en.pdf, last viewed 09/26/06\n13 Comission of the European Communities. Green Paper: A European Strategy for Sustainable, Competitive and Secure Energy.\nBrussels, 2006 [http://ec.europa.eu/energy/green-paper-energy/doc/2006_03_08_gp_document_en.pdf, last viewed 09/26/06\n14 http://ec.europa.eu/environment/climat/kyoto.htm last viewed 09/26/06\n.15 http://ec.europa.eu/environment/climat/pdf/countries/2005/portugal.pdf last viewed 09/26/06\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 6 of 10\n\ncompanies; easing the burden of increasing energy demand; addressing various environmental issues16\nPortugal has developed a Climate Change National Program to monitor progress towards Kyoto\nProtocol's emission reduction targets. Portugal has thus far used various policy tools to decrease its GHG\nemissions. These include: Implementation of energy efficiency regulations in the industrial and residential\nsectors; creation of voluntary agreements with private stakeholders; use of tax credits on renewable\nenergy technologies in particular photovoltaic systems; improvement of the transit system.17\nThrough its Energy Efficiency and Endogenous Energies Program (E4 Program), Portugal has established\nprocedures for providing financial support to improve energy efficiency, to promote co-generation and\nwind-power projects, and to establish energy efficient programs within the private sector.18 It has not,\nhowever, taken full advantage of the Kyoto flexible mechanisms to further reduce its GHG emission\nlevels.19 Portugal's future policies will follow those of the EU, which will likely be shaped by the Lisbon\nStrategy. The following objectives are stated in a memorandum of the Council of the European Union:\n- \"Encourage a diversity of energy supply which enhances supply security\"\n- \"Implement agreed commitments on energy market liberalization and on interconnecting infrastructure\"\n- \"Develop policy/regulatory frameworks based on supply/demand, emissions analysis and projections\nthat promote investment in the EU economy and provide medium and long term planning certainty\"\n- \"Promote energy efficiency and related services. This will contribute to lower production costs and\nprovide further job opportunities.\" 20\n- Follow the Intelligent Energy - Europe Program, which sets as goals the following:\n\"Increase energy efficiency by around 1% per year; increase the use of renewable energy in\nconsumption from 6% to 12% by 2010; increase to 22.1% by 2010 the percentage of electricity\nproduced from renewable sources; increase the production of electricity produced from cogeneration\nby 2010; develop the potential of renewable sources of energy; promote Kyoto mechanisms\"21\nFACTS FOR WEDGE STRATEGY\nIncreased Efficiency in Coal Plants: 43% of the electricity consumed in Portugal is generated with coal\nor oil22 . The amount of electricity to displace is 43% of the 43Bkwh consumed annually, or 18.5Bkwh.\nAssuming 40% lower heating value efficiency and an emissions factor of 232 g C/kwh (as in the original\nWedge Game materials), Portugal's current coal and oil generation emits 4.7 million tons C per year.\nReducing the emissions factor with a 60% LHV efficiency would reduce emissions to 3.2 million tons C\nper year, or a savings of 1.5 million tons C per year. Cost is high. 60% efficiency does not currently exist,\nso this would require not only investment in expensive technologies but also decommissioning current\nplants before their useful life. Under this plan, Portugal will still have to import its energy requirements,\nthough coal is more stable than gas and oil. Coal producing nations such as the US and South Africa will\nfavor this wedge.\nNatural Gas Displacing Coal Plants: Portugal consumed 5.9 Mmst (million short tons) of coal in\n200323 . Only 4% of this is use for non-generation purposes, meaning 5.6 Mmst were used for electricity\ngeneration24. With an assumed weight fraction of carbon in coal of .71 (as assumed in the original Wedge\n16 International Energy Agency. Standard Reviews: Portugal. 2000\nhttp://www.iea.org/textbase/nppdf/free/2000/Portugal_comp02.pdf#search=%22energy%20standards%20in%20portugal%22 last\nviewed 09/26/06\n17 Ibid (see note 10)\n18 Ibid (see note 10)\n19 International Energy Agency. The Country Reports: In-Depth Review of Portugal. 2004\nhttp://www.iea.org/textbase/nppdf/free/2004/Portugal_comp04.pdf#search=%22PNAC%20Portugal%22 last viewed 09/26/06\n20 Council of the European Union. Memorandum: Energy, Environment & Technology - Towards an Energy contribution to the\n2005 Spring European Council. Brussels, 15 February 2005 http://www.ceer\neu.org/portal/page/portal/CEER_HOME/CEER_PUBLICATIONS/NON_CEER_DOCUMENTS/ENERGYCONTRIB_SPRING\nCOUNCIL_05-02-15.PDF last viewed 09/27/06\n21 http://ec.europa.eu/energy/res/intelligent_energy/index_en.htm last viewed 09/27/06\n22 EIA http://www.eia.doe.gov/emeu/international/portugal.html\n23 EIA Portugal http://www.eia.doe.gov/emeu/international/portugal.html\n24 Ibid (note 18)\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 7 of 10\n\nGame materials), and assuming the coal carbon is completely combusted to CO2, we have 3.98 million\ntons C per year. Assuming natural gas to displace 50% of C emissions, so we have 2 million tons C per\nyear saved by natural gas. It will require more transmission infrastructure and new plants to be built. The\ntechnologies involved are already known. However, price of natural gas is volatile and Portugal has no\ndomestic reserves of natural gas. Due to medium cost, savings with known technologies, and Portugal's\nneed to supplement hydropower generation this wedge is recommended.\nConservation Tillage: Portugal currently has 25,000 hectares (ha), or .8% of its total cultivated land,\nunder no-till practices25. This implies a total Portuguese cultivated land area of 3.1 million ha, and also\nshows that we can essentially ignore current no-till in Portugal. Assuming savings estimates of 0.3-0.6\ntons/ha/yr we would have total savings of 0.93 - 1.87 million tons C per year by converting Portuguese\nagricultural land to conservation tillage. According to the Food and Agriculture Organization of the\nUnited Nations (FAO), implementation of conservation tillage generally results in a reduction of costs\nand input labor. The FAO states, though, that higher costs and management will be required in the first\nfew years of implementation (due to new machinery required and the learning/oversight of new\ntechniques). These characterizations imply a low- to zero-cost of implementation over a longer time\nhorizon, but an upfront cost which may be higher than some farmers (esp. in developing nations) can\nafford, requiring subsidies. Resistance should be expected from the older Portuguese farmers to change\nand the current structure of EU farm subsidies.\nMore Fuel-Efficient Automobiles: Portugal does not have any auto manufacturers, so there would be\nlittle added R&D cost to develop more efficient autos. Plus, at the rate that Portuguese citizens are\nbuying cars, they could easily increase the % of fuel-efficient cars in their national stock (should those\ncars be made available). There is also the social benefit of paying less for gasoline.\nDrive 50% Less (light-duty vehicles): The Portuguese have been rapidly expanding their stock of light-\nduty autos. There would be social opposition if Portuguese citizens were told they cannot drive their new\ncars. While the country has a high amount of daily travel (26 daily km/person), their overall travel is\nrelatively low (~100bn km/yr).\nBiomass Fuel: Costly for Portugal! With mostly mountainous terrain, there would be little potential for\ncreating fuel from biomass. Should the country be required to use biofuels, they would likely purchase\nthem from elsewhere, creating a dependence on foreign energy. Also, there is potential for using biomass\nas 'atmosphere scrubber' (that would be a 'second period' application for 2050-2100).\nIncreased Efficiency in Buildings: The residential sector in Portugal has shown 16% improvement in\nenergy efficiency between 1990 and 2004. The industrial sector has undergone a 4% improvement\ncompared to the European Union industry's 10% improvement.26 It is estimated that in 2054, there will be\n50 billion light fixtures compared to today's 10 billion. We calculate that approximately 0.2% of the\nworld's light fixtures belong to Portugal. This indicates that Portugal's overall contribution to\ninternational efforts to institute this building efficiency wedge in the industrial and residential sector\nwould be small. Can be considered expensive because energy efficiency depends largely on how\nbuildings are constructed; some remodeling will be needed. Sub-categories such as electricity efficiency\nare cheaper and can have a significant impact in reducing GHG emission. It is also expected that most of\nthe contribution in this wedge will come from the residential and industry sectors in the developing world.\nBy utilizing the Kyoto Mechanisms, Portugal can take advantage of this and earn Carbon credits by\ninvesting in Energy Efficiency at a lower cost than it would at home. Based on the size of Portugal's\nlighting sector, we can say that the contribution of Portugal will be small, and hence Portugal would bear\nlittle of the total cost of the two wedges (one from residential, the other from industrial sector). There\nmight be opposition to stricter regulations due to the cost.\nSolar Power: Portugal is the third largest potential for solar energy amongst the EU countries. The\naverage number of hours of sunshine per year range between 1,800 and 3,100 from the North and South\nrespectively. The average annual solar radiation value ranges between 5.9 GJ m-2 and 7.1 GJ m-227 .\n25 European Conservation Agriculture Federation http://www.ecaf.org/\n26 http://www.odyssee\nindicators.org/Publication/country%20profiles%20PDF/prt.pdf#search=%22portugal%20building%20efficiency%22\n27 International Energy Conversion Engineering Conference\nhttp://pdf.aiaa.org/preview/CDReadyMIECEC04_858/PV2004_5544.pdf#search=%22portugal%20potential%20\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 8 of 10\n\nPortugal is building the world's largest solar plant which will save 30,000 tonnes of CO2 emissions per\nyear equaling to about 0.083 percent reduction in Portugal's CO2 emissions based on 2005 levels28 .\nTherefore, Portugal must go beyond increase its solar power output capacity by a factor of 23\n(2000GW/88GW). The solar plant will have an installed capacity of 49.6 MW, produce 88 GW of\nelectricity a year, have 350,000 solar panels over 114 hectares, provide electricity to about 8000 homes29 .\nCCS at coal-fired plants: Portugal has 2 coal fired power plants and Portugal does not rely much on coal\nas a source of energy. Also, since there are not coal gasification plants, this would be expensive. Not\nrecommended.\nWind power: This is in line with Portugal's current goals. \"With joblessness at nearly an 18-year high,\nthe Socialist government's auction also aims to create 1,600 jobs by mandating 900 million euros in\nspending on wind turbine equipment plants.\" 25 percent of the total new capacity in Europe was added in\nPortugal. It is seasonal and intermittent. Given Portugal's initiative in wind, we recommend this wedge.\nWind to Hydrogen for Cars: This is not feasible unless there is a hydrogen economy. It makes up for\nthe intermittency of wind -and can store energy during excess capacity. Still, this wedge is not feasible\nright now.\nCCS Coal to Syngas: In 2002, coal accounted for 14 percent of energy consumption and 20 percent of\nthe carbon dioxide emissions30 . CCS technology will be new to Portugal and result in increased cost of\nelectricity generation. Also, the gains from CCS technology will exhaust quickly because coal is not a\nlarge source of energy in Portugal. It is resorted to in times of hydroelectric power generation fluctuations\nwhich Portugal is trying to meet with solar power plants. Portugal contributes to 0.3 percent of world's\nCO2 emissions and Portugal's coal contributed to about 0.06 percent of world's CO2 emissions. This\nwedge is not recommended because given Portugal's economy and budget deficit Portugal would best\ncontribute to global CO2 emissions reductions through the other wedges proposed.\nCCS for Coal to Hydrogen to Vehicles: In 2002, coal accounted for 20 percent and natural gas\namounted for 10 percent of Portugal's carbon dioxide emissions31. Portugal does not produce coal or\nnatural gas. Natural gas is transported to Portugal through Spain. Coal is usually imported in Portugal\nduring times of low hydroelectric power generation. Therefore, to take advantage of this wedge Portugal\nwill have to significantly increase the coal and natural gas share in its energy mix. The cost is high in\nterms of hydrogen safety and the need for infrastructure. The shift to renewable sources of energy such as\nsolar, hydroelectric, wind and the possibility of nuclear energy will make the opportunity cost of\ninvestment in CCS technology high. Wedge not recommended.\nNuclear Power Substituting Coal Power: Portugal currently has no nuclear energy capabilities. Because\nnuclear power generation does not emit GHG this wedge represents potential savings of 4.7 million tons\nof Carbon per year. The government will need to streamline licensing and certification procedures, and\nprovide subsidies for construction cost.32 Questions of proper nuclear waste disposal, uranium acquisition,\nnot-in-my-backyard (NIMBY) issues, and safety hazards exist. Not recommended.\nReduced Deforestation, Plus Reforestation, Afforestation, New Plantations: Portugal has almost 4\nmillion hectares of forest area (41% of the country), out of which 1.45% is primary forest. Average\nannual reforestation rate during 1990 - 2000 was of 1.56%, and 1.2% during 2000 - 2005. Nonetheless,\nPortugal lost 5.5% of its forest and woodland habitat through habitat conversion during 1990 - 2005.33\nThe potential for Portugal rests on the Kyoto Mechanisms through which it can invest in deforestation-\nrelated projects in developing countries and cheaply gain GHG/Carbon credits. Carbon mitigation cost\nthrough forestry in developing countries is estimated to be US$0.1 - US$20/tC, and US$20 - US$100/tC\nin developed countries. This is low compared to other emission reduction options.34 Carbon reservoirs\nsaturate eventually. The carbon sequestration rate and the pool of carbon cannot both be maximized.\n28 BBC News http://news.bbc.co.uk/2/hi/europe/5056012.stm\n29 Ibid (note 28)\n30 CIA World Factbook 2005, https://www.cia.gov/cia/publications/factbook/geos/po.html\n31 Ibid (note 30)\n32 http://www.rmi.org/sitepages/pid305.php\n33 http://rainforests.mongabay.com/deforestation/2000/Portugal.htm\n34 http://www.grida.no/climate/ipcc_tar/wg3/156.htm\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 9 of 10\n\nWEDGE STRATEGY\nWedge Type\nPortugal Potential\nCost\nIssues\nRecommendation\nIncreased\nEfficiency in\nBuildings\n1990-2004: Residential sector has\nshown 16% improvement in\nenergy efficiency. Industrial sector\nhas shown a 4% improvement\ncompared to the EU's 10%\nimprovement. We estimate about\n0.2% of world's light fixtures\nbelong to Portugal.\n$$ Expensive because\nenergy efficiency\ndepends largely on how\nbuildings are\nconstructed. But some\nareas of improvement,\nsuch as lighting, are\nrelatively cheap.\nPossible opposition\nto stricter\nregulations due to\nthe cost. In the long\nrun increases\ncompetitiveness\nand reduces overall\ncosts.\n2 wedges (one from\nresidential sector, the\nother from the\nindustrial sector)\n50% Greater Fuel\nEfficiency in\nAutos (Light\nDuty)\nHigh potential for gain at little cost\nas Portugal does not have any auto\nmanufacturers. Given Portuguese\nrate of acquiring cars they can\neasily increase the % of fuel\nefficient cars in their stock.\nLittle R&D cost to\ndevelop more efficient\nautos. Social benefit\nof paying less for\ngasoline.\nPossible opposition\nfrom countries with\nauto-makers and\nolder, less efficient\nfleets of car.\n1 wedge\nNatural Gas\nDisplacing Coal\nPlants\n2 million tons C per year saved by\nnatural gas. (see wedge rationale\nsection for calculations)\n$ Medium because\ntechnologies and\ntechnical know how\nalready exists.\nExposes Portugal to\nthe volatility in\nnatural gas prices.\nCoal makers will\noppose this.\n1 wedge since cost is\nmedium. Will\nsupplement Portugal's\nintermittent generation\n(hydropower) with\ngeneration that can be\nmore easily switched\non and off.\nSolar/Wind\nreplacing coal\nAfter Spain and Greece, Portugal\nhas the third largest potential for\nsolar energy amongst the EU\ncountries. 25 percent of the total\nwind power added in Europe was\nthrough Portugal\nMedium; Portugal is\nalready building the\nworld's largest solar\nplant. Efforts to\nenhance wind power\nalready under way.\nBoth sources are\nseasonal\n1/2 wedge solar, 1/2\nwedge wind\nReduced\nDeforestation,\nPlus\nReforestation,\nAfforestation,\nand New\nPlantations\n41 percent of the country is forest\narea. Deforestation is not an issue\nin Portugal. Portugal lost 5.5% of\nits forest and woodland habitat\nthrough habitat conversion\nduring1990 and 2005. The\npotential for Portugal rests on the\nKyoto Mechanisms through which\nit can invest in deforestation-\nrelated projects in developing\ncountries and cheaply gain GHG /\nCarbon credits.\nThe costs of carbon\nmitigation through\nforestry in developing\ncountries are estimated\nto be US$0.1 - US$20 /\ntC, while in developed\ncountries the cost is\nestimated to be US$20\n- US$100 / tC. Low\ncompared to other\nemission reduction\noptions.\nPortugal will be\ninvesting in foreign\nrather than national\nprojects. Also,\ncarbon reservoirs\nare eventually\nmaximized.\n1 wedge. It is\nrelatively cheap,\nflexible and effective\noption for controlling\nGHG emissions\nConservation\nTillage\nUsing the savings estimates\npresented in the Wedge Game\nmaterials (.3-.6 tons/ha/yr) we\nwould have total savings of .93 -\n1.87 million tons C per year by\nconverting Portuguese agricultural\nland to conservation tillage\nLow- to zero-cost of\nimplementation over\nlong term. Upfront cost\nwhich may be higher\nthan some farmers (esp.\nin developing nations)\ncan afford, requiring\nsubsidies\nResistance of older\nPortuguese farmers\nto change and the\ncurrent structure of\nEU farm subsidies\n1 wedge. Low cost,\neasy to implement\nPortugal Wedge Group - Connolly, Ponce de Leon Barido, Rached, Rashid, Ringo\nPage 10 of 10"
    },
    {
      "category": "Resource",
      "title": "hw3_ukfacts.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/d8a3879d7af7acc76a5a96a0c9120354_hw3_ukfacts.pdf",
      "content": "Wedge Game Example UK Fact Sheet\n(Keep in mind this is very simple just to illustrate an example.)\nUK General Country Facts\n(Data Source: See http://en.wikipedia.org/wiki/Uk for footnotes and more information.)\nCapital\nLondon, 51°30′N 0°7′W\nMost populous conurbation\nLondon\nOfficial language(s) / Currency\nNone5 / Pound sterling (£) (GBP)\nGovernment\nConstitutional monarchy\n- Queen\nHM Queen Elizabeth II\n- Prime Minister\nThe Rt Hon Tony Blair MP\nEstablishment / Accession to EU\n1 January 1801 6 / 1 January 1973\nArea Total/Water (%)\n244,820 km2 (79th) (94,526 sq mi) / 1.34%\nPopulation 2005 est/2001 census\n- Density\n60,209,500 7 (21st) / 58,789,194\n\n243/km2 (48th) (629/sq mi)\nGDP (PPP)\n- Total\n- Per capita\n2005 estimate\n$1.833 trillion (6th)\n$30,470 (18th)\nHDI (2003)\n0.939 (15th) - high\nTransport Trends (http://en.wikipedia.org/wiki/Transport_in_the_UK)\nSince 1952 (the earliest date for which comparable figures are available), the UK has seen a dramatic shift away from the\nuse of public transport and towards the use of private transport, for both passengers and freight. In 1952 just 27% of\ndistance traveled was by car or taxi; with 42% being by bus or coach and 18% by rail. A further 11% was by bicycle and\n3% by motorcycle. The distance traveled by air was negligible. By 2003 85% of distance traveled was by car or taxi; with\njust 6% being by bus and 6% by rail. Air, pedal cycle and motorcycle accounted for roughly 1% each. In terms of journeys,\nslightly over 1,000,000,000 are made per annum by main line rail, 1,100,000,000 by London Underground and other\nmetro systems, 4,500,000,000 by bus, and 21,000,000 on domestic air flights. Approximately 95% of freight enters the\nUK by sea (75% by value).\nPassenger transport miles have grown significantly in recent years. Figures from the DTI [1] show that total passenger\ntravel inside the UK has risen from 403 billion passenger kilometres in 1970 to 797 billion in 2004.\nTable 2.2: Passenger kilometres by bus, rail, air, motorcycle, pedal cycle, 1970 to 2004 (1)\nRoad\nRail (4)\nCars, vans\nBuses and\nMotor\nPedal\n\nand taxis (2)\ncoaches (3)\ncycles (2)\ncycles (2)\nAll road\nExcluding water travel within the United Kingdom & Channel\nSource: Department for Transport\nIslands\nThe volume of freight moved had almost trebled to 254,000,000,000 tonne kilometres since 1953, of which 7.5% was\nmoved by rail, 26% by water, 4% by pipeline and 62% by road.\nPrepared by Kathy Donnelly,for any questions.\n\nWedge Game Example UK Fact Sheet\n(Keep in mind this is very simple just to illustrate an example.)\nThe rail network has halved from 31,336 km in 1950 to 16,116 km today, the motorway network, which today is 3476 km\nlong, did not exist in 1950. It has also been caused by rising economic affluence, the move of the population away from\ncity centres, and changes in industry.\nTransport accounts for the largest end usage for energy produced in the UK. Transport dominates the UK's use of oil with\n74% of supply used to power the cars, planes, buses, trains and lorries. This produces 42 million tonnes of carbon (MtC)\nper year or around 25% of all current UK emissions (DTI Energy Review, July 2006).\nEnergy Power Consumption and Security\nUK energy data paints a picture of increasing energy consumption across sectors, rising fossil fuel prices,\nand growing reliance on natural gas and fossil fuels for power generation and transport. The UK has traditionally\ndepended on natural gas for energy and space heating requirements, but since the 1990's natural gas reliance\nhas substantially increased. The UK has recently become a net importer of natural gas. Total gas and electricity\npower consumption is depicted by sector in the figure below. The figure illustrates sharp increases in energy\nconsumption between 1980 and 2000 and slightly decreasing total use between 2000 and 2005. Since 2000,\ntotal natural gas and electric energy consumption has slightly decreased from around 1450 to 1430 TWh per year.\nOver 75% of UK total power consumption is derived from natural gas sources. (DTI, \"Energy in Brief\", July 2005)\nTotal UK Power Consumption (TWh)\n1980 to 2005\n1400.0\n1200.0\n1000.0\n800.0\nTWh\n600.0\n400.0\n200.0\n0.0\nNatural Gas, 75%\nElectricity, 25%\nNot a Linear Scale\nServices\nDomestic\nIndustry\nElectricity Industries\nPrepared by Kathy Donnelly, for any questions.\n\nWedge Game Example UK Fact Sheet\n(Keep in mind this is very simple just to illustrate an example.)\nThe UK's Electricity generation mix from 2000 to 2020 is shown in the Chart below. (DTI, \"Energy Review\", July\n2006)\nSource: DTI Energy Review, July 2006\nHeating Trends\nUK central heating increases have been in gas heaters as shown in the figure below. This has\nrisen by 10% to 77% of home central heating by gas from 1970 to 2004. Solid fuel central heating\nhas dropped to 1% in 2004. Oil and electric central heating have remained relatively constant. (BRE\nTenure Fact File 2006).\nSource: BRE Tenure Fact File 2006\nPrepared by Kathy Donnelly, for any questions.\n\nWedge Game Example UK Fact Sheet\n(Keep in mind this is very simple just to illustrate an example.)\nDomestic space heating accounted for 53% of CO2 emission in 2005 (see table below).\n2005 UK Total Domestic Electricity Consumption\n\nKWh\nConsumption %\nCO2 %\nCooking\n6%\n5%\nLighting & Appliances\n63%\n22%\nWater\n16%\n20%\nSpace Heating\n16%\n53%\n\n100%\n100%\nSource: Derived from DUKES 2005\nstatistics and DTI Energy Review.\nThe UK had shown progress until 2004 at reducing the number of households in fuel poverty, defined as the need\nto spend more than 10% of income on fuel to maintain a satisfactory heating regime. Rising energy prices reversed the\ndownward trend. Although, the trend is expected to decrease by 2010, there will still be over 1 million households in fuel\npoverty. (DTI Energy Review, July 2006).\nGreenhouse Gas Trends\nApproximately 70% of UK greenhouse gas emissions come from production and use of energy. Chart 4 breaks\ndown UK carbon dioxide emissions by end user. (DTI Energy Review 2006)\nPrepared by Kathy Donnelly, for any questions.\n\nWedge Game Example UK Fact Sheet\n(Keep in mind this is very simple just to illustrate an example.)\nStrategy\nUse\nElectricity (E),\nTransport (T),\nHeat (H)\nDescription\nSize of a Wedge\nUK Potential\nCost Challenges\nCCS\nElectricty\n(Coal and\nNG)\nE\nCO2 from fossil fuel power\nplants stored and captured (700\nGW of coal or 1400 GW of\nnatural gas)\n1 wedge will require injecting a\nvolume of CO2 every year equal\nto the volume of oil extracted\nOver 50% of winter\nelectricity generation\ncomes from coal.\nPotential for algae CC,\nturn into biofuel.\n$$\nCO2 leakage\n!\nEfficiency-\nTransport\nT\nIncrease automobile fuel\nefficiency (2 billion cars\nprojected in 2050)\n1 wedge would require doubling\nthe efficiency of all the world's\ncars from 30 to 60 mpg\nUK produces around\n42 MtC per year\n(2006).\n$\nCar size &\npower,\nconsumer\npreference,\nurban design\n!\nEfficiency-\nElectricity\nE\nIncrease efficiency of lighting,\nmotors, power generation\n1/4 wedge would require\nreplacing ~500 million\nincandescent bulbs with compact\nfluorescents annually\nBy 2020, current\nenergy efficiency\nproposals could save\n18-21 MtC\n$\nIncreased stand\nby power use,\npersonal effort\n!\nEfficiency-\nHeat\nH\nIncrease insulation, furnace\nefficiency\n1 wedge could be achieved by\nusing best available technology\nin all new and existing buildings\nBy 2020, current\nenergy efficiency\nproposals could save\n25 MtC\n$\nHouse size,\nHouse design,\npersonal effort\n!\nWind\nElectricity\nE\nWind diplaces coal (50 x current\ncapacity)\n1 wedge will require an area\nequal to ~3% of US land area\nUK has large on-shore\nand off-shore wind\npotential.\n$$\nGrid\nChallenges,\nNIMBY\n!\nSolar\nElectricity\nE\nSolar PV displaces coal (700 x\ncurrent capacity)\n1 wedge will require the\nequivalent of a 100 x 200 m PV\narray\n30% of all building\nenergy could come\nfrom Solar roofs\n$$$\nPV cell\nmaterials,\nintermittency\n!\nBiofuels\nT\nBiomass fuels from plantations\nreplace petroleum fuels\n1 wedge requires scaling up\nworld ethanol production by a\nfactor of 50\nUK produces around\n42 MtC per year\n(2006).\n$$\nBiodiversity,\ncompeting land-\nuse\n!!\nPrepared by Kathy Donnelly, for any questions."
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/2ba81ed3377eb946f91807c86d9c847d_hw3.pdf",
      "content": "The Wedge Game Assignment--Slightly modified from Princeton University Carbon\nMitigation Initiative by Kathy Donnelly, TPP 07\nBY class on 9/20, read the entire Wedge Game Assignment and complete the Pre-\nGame Directions tasks below. Approximate time: 2.5 to 3 hours.\nPre-Game Directions:\nVisit the Princeton University Carbon Mitigation Initiative webpage\n(http://www.princeton.edu/~cmi/resources/stabwedge.htm) and explore the website in\nthe following order:\n1. Read Introduction and run shockwave introductory presentation\n2. Download and read the two background articles\n3. Download and read the stabilization wedge game rules (found under the\nInteractive title)\n4. Download and read the wedge strategies in detail (15 total)\n5. Re-read page 8 of the wedge game\n6. Review sample fact sheet from the UK\n7. Select your preferred country choice and two backup countries and email\nfor approval (by 8 pm 9/18). First come, first served!\nChoices: US, Brazil, New Zealand, Australia, Canada, South Africa, China,\nIndia, France, Venezuela, Germany, Japan, Russia. Your country and team\nassignments will be announced in class on 9/20. While we will try to give\neveryone their top choices, country assignments will be assigned to encourage\nglobal diversity.\n8. You may also wish to look through the articles from the September 2006\nScientific American magazine special issue \"Energy's Future--Beyond Carbon\"\nat http://www.sciam.com/issue.cfm.\nAdditional rules:\n1. You will determine the best global strategy considering the following factors for\nyour country: economic, energy demand, energy security, environmental, policy,\nequity, mobility, implementation, and technology issues when selecting your\nwedge strategies and building your wedge triangle.\n2. Your team may develop its own wedges, but must come up with very simplified\ncosts and impacts for each wedge (like the Princeton wedge calculations (see\nWedge Table in Princeton Wedge Concept Game directions)).\n3. Questions will be taken until Saturday, September 30th at\nnoon and answers will be emailed to the entire class.\n\nThe Wedge Game Assignment--Slightly modified from Princeton University Carbon\nMitigation Initiative by Kathy Donnelly, TPP 07\nGame Directions1\n1. Follow the Wedge Game Directions on page 8. Determine the global\nstrategy from your assigned countries' perspective.\n2. Develop your assigned countries' proposed global Wedge Table (like page\n12 to 13 of Wedge Concept Game Materials).\nSubmissions:\n1. One page outline of work plan (tasks, due dates, and resources (assigned\nperson)) (Due by end of class 9/20)\n2. Five to ten page Fact Sheet, including graphics and tables, summarizing\nyour global wedge strategy. See additional rules number 1 and simplified\nsample (turn in as PDF document--Due by 5 pm October 1st)\n3. 5 minute PowerPoint presentation of your wedge strategy (Due in class on\nOctober 2nd)\nOn October 2nd, each team will give a FIVE minute (very strict time limit) presentation on\nwhy the world should choose their strategies.\nGrading: Wedge Strategy: 40%, Fact Sheet: 35%, Presentation: 20%, Work Plan 5%\n1 Useful websites: UNC Chapel Hill Units Dictionary: http://www.unc.edu/~rowlett/units/index.html\nBP 2005 World Statistics:\nInternational Energy Agency, IEA: http://www.iea.org/\nCIA World Factbook figures: https://www.cia.gov/cia/publications/factbook/geos/uk.html\nhttp://www.bp.com/productlanding.do?categoryId=6842&contentId=7021390\n\nA Few Interesting Charts: Graph increasing from $45/bbl in Feburary 2005 to about $75/bbl in July 2006.\nFeb\nMar\nApr\nMay\nJun\nJul\nAug\nSep\nOct\nNov\nDec\nJan\nFeb\nMar\nApr\nMay\nJun\nJul\n$/barrel\nGraph increasing from $45/bbl in Feburary 2005 to about $75/bbl in July 2006.\n\nCourtesy of Point Carbon. Used with permission."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/984bb2dfeaa0d02563bd9f79da5ff9b9_lec1.pdf",
      "content": "ESD.10 Class Materials\nLecture 1\nSeptember 6, 2006\n\nDefinitions of policy\n- Webster\n- Policy: A plan to achieve a goal\n- Colloquial notion\n- Policy: The choices left over after analysis\ncan't tell you what to do\n- Another thought\n- Policy: The art of getting things done\nKeep thinking about your own, richer\nKeep thinking about your own, richer\ndefinition of policy throughout the semester\ndefinition of policy throughout the semester\n\nESD.10 Learning Objectives (I)\n- Appreciate the political, social, and institutional\ncontext of technological systems\n- Formulate, analyze, and evaluate technology\nand policy options\n- Conceive, design, and execute a technology and\npolicy research project, in the style of those\ndone by the National Research Council\n- Compare the historical dimensions of science\nand technology policy across countries\n- Explain the impact of globalization on\ntechnology and policy\n\nESD.10 Learning Objectives (II)\n- Describe how policy is done in the \"real word\" by\nits practitioners\n- Summarize current technology and policy issues\nin environment, transportation, information\ntechnology, and standards setting policy\n- Write effectively for policy situations, both in\nshort memos and longer reports\n- Speak effectively for policy situations, both in\ninformal dialogue and formal presentations\n- Work effectively in teams\n\nLearning to see:\nGoals (equity, efficiency, security, liberty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy solutions (inducements, rules, facts, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions, powers, resources,\nchannels, windows, technology constraints and enablers)\nEconomics (cost-benefit analysis, pareto optimality, utility)\nTerm Project (conceive, design, execute a policy research project)\nLearning to articulate:\nWriting (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPresentation (term project, group homeworks)\nHistorical context of S&T policy\nHistorical context of S&T policy\nImpacts of globalization\nImpacts of globalization\nCurrent issues in technology and policy\nCurrent issues in technology and policy\n\"\"Real world\nReal world\"\" experiences of policy practitioners\nexperiences of policy practitioners\nESD.10 Meta-Learning Objective: Appreciate the political,\nAppreciate the political,\nsocial, and institutional context of technological systems\nsocial, and institutional context of technological systems"
    },
    {
      "category": "Lecture Notes",
      "title": "lec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/bd0b2cbc893dd179300a965f3f85b497_lec3.pdf",
      "content": "ESD.10 Lecture Notes, Lecture 3: Portraying Policy\nProblems - The Art of Framing in Many Languages\nSeptember 14, 2005\n\nUse of stories to frame policy problems?\n- Story of decline\n- Stymied progress story\n- Change is only an illusion\n- Helplessness and control\n- Conspiracy\n- Blame the victim\n\nUse of metaphor?\n- Organisms (natural)\n- Machines (in order)\n- Inclines (slippery slope)\n- Containers (fixed space)\n- Wars (invasion, campaign)\n- Diseases (spreading, infecting, epidemics,\nbreeding ground, healthy, blight, dying)\n\nTheories of cause?\n- Mechanical (unguided, intended) -\nmachines work but harm, brainwashed\npeople\n- Accidental (unguided, unintended) - nature,\nweather, machines run amok\n- Intentional (purposeful, intended) -\noppression, conspiracies that work\n- Inadvertent (purposeful, unintended) -\nunforeseen side effects, carelessness\n\nConcepts of interests - \"sides\"?\n- Good and weak vs strong and bad\n- Objective vs subjective interests\n- Mobilization of groups around interests -\nconcentrated or diffused costs and benefits\n\nWhat about making decisions?\n- Cost-benefit analysis\n- Risk-benefit analysis\n- Decision analysis\n- Hobson's choice\n- Rational analysis as a form of dramatic\nstory, a persuasive appeal\n- Contrast of rational-analytical model and\npolis model for decision analysis strategies\no Precise, static goals vs ambiguous,\nshifting goals\no Consider and clearly define all\nalternatives and their costs and benefits\nvs selective, preferred, doable *and*\nunclear alternatives that support your\ncase\no Maximize total welfare vs minimize harm\nto powerful constituents"
    },
    {
      "category": "Lecture Notes",
      "title": "lec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/6689b5fa51409f420cd09d8fcb5b8a63_lec4.pdf",
      "content": "ESD.10 Class Materials\nLecture 4\nSeptember 18, 2006\n\nLearning to see:\nGoals (equity, efficiency, security, liberty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy solutions (inducements, rules, facts, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions, powers, resources,\nchannels, windows, technology constraints and enablers)\nEconomics (cost-benefit analysis, pareto optimality, utility)\nTerm Project (conceive, design, execute a policy research project)\nLearning to articulate:\nWriting (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPresentation (term project, group homeworks)\nHistorical context of S&T policy\nHistorical context of S&T policy\nImpacts of globalization\nImpacts of globalization\nCurrent issues in technology and policy\nCurrent issues in technology and policy\n\"\"Real world\nReal world\"\" experiences of policy practitioners\nexperiences of policy practitioners\nESD.10 Meta-Learning Objective: Appreciate the political,\nAppreciate the political,\nsocial, and institutional context of technological systems\nsocial, and institutional context of technological systems\n\nReview of Assignment #2\n- What's the real problem that you identified\nin your memo?\n- What are potential courses of action for\ndealing with the problem?\n- What are the pros and cons of each\ncourse of action?\n- Which course would you recommend?\n\nPolicy Strategy and Instruments\n-\nInducements\n-\nRules\n-\nFacts\n-\nRights\n-\nPowers"
    },
    {
      "category": "Lecture Notes",
      "title": "lec6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/8338624ef0d6ed011d6472a207059fe4_lec6.pdf",
      "content": "ESD.10 Class Materials\nLecture 4\nSeptember 18, 2006\n\nESD.10 Meta-Learning Objective: Appreciate the political,\nAppreciate the political,\nsocial, and institutional context of technological systems\nsocial, and institutional context of technological systems\nLearning to see:\nGoals (equity, efficiency, security, liberty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy solutions (inducements, rules, facts, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions, powers, resources,\nchannels, windows, technology constraints and enablers)\nEconomics (cost-benefit analysis, pareto optimality, utility)\nTerm Project (conceive, design, execute a policy research project)\nLearning to articulate:\nWriting (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPresentation (term project, group homeworks)\nHistorical context of S&T policy\nHistorical context of S&T policy\nImpacts of globalization\nImpacts of globalization\nCurrent issues in technology and policy\nCurrent issues in technology and policy\n\"\"Real world\" experiences of policy practitioners\nReal world\" experiences of policy practitioners\n\nTypical NRC Report Structure\n- Executive Summary\n- Introduction\n- Background\n- Analysis and Supporting Arguments\n- Summary and Conclusions\n- Appendices\n- Charge\n- Bios of Committee Members\n- Participants in Committee Meetings\n- Acronyms and Abbreviations\n- Other Supporting Material\n\nCharacteristics of High -\nPerformance, Effective Teams\n- Positive interdependence\n- Team focuses on a common goal or single product\n- Individual and group accountability\n- Each person takes responsibility for both her or his own work\nand the overall work of the team\n- Promotive interaction\n- Members do real work, usually face-to-face\n- Teamwork skills\n- Each member has the skill for and practices effective\ncommunication, active and careful listening, decision making,\nproblem solving, conflict management, and leadership\n- Group processing\n- Team periodically reflects on how well the team is working,\ncelebrates the things that are going well, and problem-solves the\nthings that aren't\nFrom Teamwork and Project Management by Karl A. Smith"
    },
    {
      "category": "Lecture Notes",
      "title": "lec11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/10bdd1522fa2f9446c8515637c20c1e5_lec11.pdf",
      "content": "Prof. Daniel Roos\nESD 10\n\nEngineering Systems Development At MIT\nTechnology and The Civil Sector\n1975-1985\n-\nPost Vietnam Era\n-\nEnd of Apollo\n-\nReductions in NASA and DOD Programs\n-\nWar on Poverty\n-\nSocial Awareness\n-\nSilent Spring - Rachel Carson\n-\nUnsafe At Any Speed - Ralph Nader\n-\nDean Alfred Kiel Focuses Engineering School on Socio-\nEconomic Systems\n-\nCenter For Policy Alternatives - 1971\n-\nCenter For Transportation Studies - 1973\n-\nTechnology and Policy Program - 1975\n\nCTS - Center For Transportation Studies\n-\nHolistic Problem Perspective - From Highway\nEngineering To Transportation Systems\n-\nDifferent Analysis Approaches - Operations Research,\nSystems Analysis, Econometric Modeling,\nSupply/Demand Equilibrium Models, Organizational\nTheory\n-\nInterdisciplinary Academic Program - Master of Science\nIn Transportation\n\nU.S. Industrial Competitiveness\n1985-1996\n-\nThree Converging Forces\n-\nSloan School of Management - Technology Is A Strategic\nAdvantage\n-\nEngineering School - Back To Basics (i.e. Design,\nManufacturing)\n-\nIndustry - Educate Students In Manufacturing to Compete\nWith Japan\n-\nMIT Responds\n-\nInternational Motor Vehicle Program (1985) - \"The Machine\nThat Changed The World\"\n-\nCommission on Industrial Productivity (1987) - \"Made In\nAmerica\"\n-\nCommittee on Large Scale Systems (1987) - Open and\nClosed Systems\n-\nLeaders For Manufacturing (1988) - \"Big M\" Manufacturing\n-\nSystem Design and Management (1996) - Product\nDevelopment\n\nMIT International Motor Vehicle Program\n(1985-1990)\n-\nWhat Determines Competitive Advantage In The Auto\nSector\n-\nComparative Research and Benchmarking-Researchers\nFrom Around The World, Coordinated by MIT\n-\nPolicy Forums For Senior Officials - Involving Stakeholders\nIn Research Has High Payoff, MIT As Objective Neutral\nParty\n-\n\"Machine That Changed The World\" - Data Based Book,\nFocused On Senior Executives And Government Officials\n\nTake Aways - Lean Production As An\nEngineering System\n-\nIntuition Is Often Wrong - Western Auto Companies\nMisunderstood The Reasons For Japanese Success\n-\nSystem Thinking Makes A Difference - Lean Changed Dynamics of\nInternational Competition - Superior Productivity, Improved\nQuality, Rapid Product Development, Production Flexibility\n-\nImplementing Lean Requires Structural Change - Changes In\nHuman Behavior Are Complex and Time Consuming, Denial and\nOpposition, But Change Is Possible\n-\nLean System Architecture - Holistic Framework, Foundation,\nComplete Logic, Fundamentally Different From Mass Production\n-\nThe Need For An Enterprise Wide Perspective - Everything\nChanges - Corporate Culture, Processes, Organizational Structure\nand Relationships, Information Systems, Incentives and Rewards\n-\nThe \"Illities\" Matter - Quality, Flexibility, Adaptability\n\nPlanning For The Future\n-\nProfessional Masters Programs\nTPP\nTechnology and Policy Programs (1975)\nLFM\nLeaders For Manufacturing (1988)\nSDM\nSystem Design and Management (1996)\nMLOG Master of Engineering in Logistics (1998)\n(and Supply Chain Management)\nNo Institutional Home for Engineering Systems Programs\n-\nConstraints\n-\nOnly Departments Admit Students and Hire Faculty\n-\nPrograms Needed Additional Faculty to Lead and Teach\n-\nDecentralized Systems, Faculty Below Critical Size\n-\nNew SOE Unit Recommended But Not Implemented\n\nESD Formation\n-\nBig \"E\" Engineering Committee (1995)\n- MIT Needs Leadership in Both Engineering Science\nand Engineering Systems\n- Develop Curriculum in Engineering Systems\n- Hire Additional Faculty in Engineering Systems\n- New Unit Proposed - Engineering Systems\nDivision\n-\nOpposition to ESD Formation\n- Too Soft - Not Real Engineering\n- Lacks Intellectual Content - Not a Discipline\n- Departments Already Doing Systems - Different\nSystems Perspectives\n- Use of Scare Resources\n\nESD Works With The MIT\nAcademic Units\n\nESD Mission\nEstablish engineering systems as a field of study\nfocusing on complex engineered systems and\nproducts viewed in a broad human, social and\nindustrial context. Use the new knowledge gained\nto improve engineering education and practice.\n\nESD Goals & Objectives\n-\nCreate An Intellectual Home for Faculty From Engineering,\nManagement, and the Social Sciences, Committed to Integrative,\nInterdisciplinary Engineering Systems Programs.\n-\nDevelop Concepts, Frameworks, and Methodologies That Codify\nKnowledge and Define Engineering Systems As A Field Of Study.\n-\nEducate Engineering Students To Be Tomorrow's Leaders, Via\nInnovative Academic and Research Programs. These Leaders Will\nPlan, Design and Develop Systems That are Technically Excellent,\nSocially Responsive and Are Implemented On Time and Budget.\n-\nIntroduce Engineering Systems Into The Mainstream of Engineering\nEducation, By Working With the MIT Engineering Departments, the\nInstitute As a Whole, and Other Engineering Schools Worldwide.\n-\nInitiate Research on Engineering Systems of National and\nInternational Importance, Working in Partnership With Government\nand Industry.\n\nproduct\ninfrastructure\nurban environment\nsustainability\nsociety\nPhotos removed\ndue to copyright restrictions.\nAutomobile schematic removed\ndue to copyright restrictions.\nEngineering Systems Scope\n\nEngineering Systems Requires a Different Way of Thinking\nEngineering Systems Characteristics and\nPerspectives\n-\nMultidimensional Complexity/Emergent Properties\n-\nTechnical Complexity - \"Illities\" - Quality, Flexibility, Sustainability,\nMaintainability, Robustness, etc.\n-\nOrganizational Complexity - The Extended Enterprise\n-\nContextual Complexity - Societal Perspective, Qualitative As Well\nAs Quantitative Analysis\n-\nEvaluative Complexity - Multiple Stakeholders, Life Cycle Analysis\n-\nSystem Architecture is the Starting Point - Holistic, Enterprise\nPerspective\n-\nContext in the Design Process - Internalize the Externalities\n-\nUncertainty Management of Design\n\nEngineering System Symposium Conclusions\n-\nCall To Arms - Confirming the Importance of Engineering Systems\n-\nA Community Is Forming - Big Tent\n-\nEngineering is Broadening - Leadership Opportunities For\nEngineering Profession In Engineering Systems\n-\nIndustry Will Not Lead In Developing Engineering Systems\n-\nUniversities Must Respond and Change, Change Will Be Difficult\n-\nMIT Thanked for Engineering System Leadership\n-\nExternal Acceptance, Internal Challenges At MIT\n-\nSystem Engineering Is Part of Engineering Systems\n-\nNumerous Intellectual Opportunities - Illities, Enterprise,\nUncertainty, Architecture\n\nThe Future of Engineering Systems\nThe Realities\n-\nEngineering Systems Will Continue To Increase in Size,\nScope and Complexity\n-\nEngineering Systems Thinking Is Necessary to Address\nthe Realities of the 21st Century - \"Messy Complexity\",\nUnanticipated Events, Globalization, Rapid Rate of\nChange, Societal Concerns, International Competition,\nOvercapacity, Rising Consumer Expectations\n-\nInformation Technology Advances Enable New\nEngineering Systems Problem Solving Frameworks\n\nEngineering Systems and The\nEngineering Profession\n-\nDeveloping Engineering Systems Requires Leaders that\nUnderstand Technology.\n-\nNew Opportunities for Engineers Developing\nEngineering Systems\n-\nThose Engineering Leaders Need More Than Technical\nKnowledge - Broader Understanding of Organizations\nand Context.\n-\nThe Challenge for Engineering Schools - Offer\nEngineering Systems Programs to Educate Future\nEngineering Leaders\n-\nA Ten Year Mission To Develop Engineering Systems\nAs A Field of Study -The Journey Has Just Begun"
    },
    {
      "category": "Lecture Notes",
      "title": "lec12_14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/8b07b9a2388285a42eec34dcf74d1651_lec12_14.pdf",
      "content": "Technology and Policy Analysis\nAnnalisa Weigel\nOctober 23, 2006\n\nESD. 10 Meta-Learning Objective: Appreciate the political,\nsocbl, and institutional context of technological systems\nCurrent issues in technology and policy\nLearning to see:\nGoals (equity, efficiency, security, li belty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy S O ~ U ~ ~ O ~ S\n(inducements, rules, fads, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions, powers, resources,\nchannels, windows, technology constraints and enablers)\nEconomics (cost-benefit analysis, pareto optirnality, utility)\nTerm Pr0j ect (conceive, design, execute a policy research project)\nLearning to articulate:\nWrif ing (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPre~en\ntat ion (term project, group homeworks)\n\"Real world\" experien-2s of policy p --ictitm\nlners\n\nIs there a difference?\nThe technology question\nz Let's begin with an important and fundamental question:\n- Do you think there is a difference between policy involving\ntechnology-related areas and non-technology-related areas?\nz My answer:\n- Not a really big difference, but...\n- Technology is usually subject to relatively immutable physical\nlaws of the universe, creating constraints\n- Non-technological things are usually more subject to social\nconstructs, which history has shown can change given time\ntechnology and\nPolicy Analysis\n\nWhat is\ntechnology and policy analysis?\nz Counter examples can be very useful\n- <show video clip of Dead Poets' Society movie>\nz No singular universal quantitative prescription\nz Think of technology and policy analysis as:\n- A toolbox (indeed a whole chest!) of principles, methods,\ntechniques, tools, analogs, experiences, etc. that help you\nunderstand, take action on, and assess T&P issues\nz How you structure your tools for analysis depends on\nyour objective:\n- Understanding\n- Acting\n- Reflecting and Assessing\n\n\"Drawers\" in your tool chest for\ntechnology and policy analysis\nIssue Framing\nStakeholders\nTechnology/Policy Interactions\nWindows\nChannels\nPowers & Resources\nWho\nWhat\nWhen\nWhere\nWhy\nHow\nHow much\n\n\"Drawers\" in your tool chest for\ntechnology and policy analysis\nIssue Framing\nStakeholders\nTechnology/Policy Interactions\nWindows\nChannels\nPowers & Resources\n\n\"Drawers\" in your tool chest for\ntechnology and policy analysis\nIssue Framing\nStakeholders\nTechnology/Policy Interactions\nWindows\nChannels\nPowers & Resources\nUnderstanding\n\n\"Drawers\" in your tool chest for\ntechnology and policy analysis\nIssue Framing\nStakeholders\nTechnology/Policy Interactions\nWindows\nChannels\nPowers & Resources\nActing\n\n\"Drawers\" in your tool chest for\ntechnology and policy analysis\nIssue Framing\nStakeholders\nTechnology/Policy Interactions\nWindows\nChannels\nPowers & Resources\nReflecting\nand\nAssessing\n\nAchieving success in implementing\npolicy involving technology\nIssue\nFraming Stakeholders\nTechnology/\nPolicy\nInteractions\nWindows\nChannels\nPowers &\nResources\nSuccess!\n\nAgenda\nz Review technology and policy analysis tools\nz Examine technology and policy implementation\nz Discuss technology and policy assessment\n\nTools in the Technology and Policy\nAnalysis Tool Chest\n\nIssue framing\nz What fundamental goals are in play?\nz What are the bounds of the issue?\nz How is the issue cast?\n- Economic (cost-benefit), safety (risk-benefit), interests (sides),\ncontrol, conspiracy, victimization, causes\nz For discussion: Strengths? Cautions? Your reflection\nfrom the readings? Apply to your term project?\nz Advice\n- Make use of Stone framework to gain new perspectives\n\nStakeholders\nz Who cares about the issue? What are their motivations?\nz What are their core beliefs and values?\nz How are stakeholders arrayed on the issue?\nz What coalitions exist?\nz For discussion: Strengths? Cautions? Your reflection\nfrom the readings? Apply to your term project?\nz Advice\n- Go out a few layers to gain perspective on vital, important,\nperipheral stakeholders\n\nTechnology and policy interactions\nz How does the technology constrain or enable policy?\nz How does the policy constrain or enable technology?\nz For discussion: Strengths? Cautions? Your reflection\nfrom the readings? Apply to your term project?\nz Advice\n- Deep understanding of the technology\n- Separate function / process from form / object\nPolicy\nTechnology\n\nChannels\nz What channels exist for taking action on the issue?\n- Electoral, legislative, legal, administrative, media, grassroots...\nz What are the costs and benefits of using various\nchannels, now and in the future?\nz For discussion: Strengths? Cautions? Your reflection\nfrom the readings? Apply to your term project?\nz Advice\n- Consider the political capital required for different channels\n\nPowers and resources\nz Who has formal and informal power to take action?\nz Who has resources to put to the issue?\nz Who can influence those that take action / have\nresources?\nz How can people with power/resources/influence be\nmobilized?\nz For discussion: Strengths? Cautions? Your reflection\nfrom the readings? Apply to your term project?\nz Advice\n- Powers, resources and channels are very often intertwined\n\nWindows\nz Which focusing events could be imagined that would put\nthe issue on the agenda?\nz Are there institutional routines for moving the issue?\nz For discussion: Strengths? Cautions? Your reflection\nfrom the readings? Apply to your term project?\nz Advice\n- Understand the seasonal and life cyclicality of stakeholders and\norganizations\n\nImplementing Technology and Policy\n\nImplementation\nVariables & Stages\nz What are your\nimpressions of\nimplementation?\nTractability of the Problem\n1. Technical difficulties\n2. Diversity of target group behavior\n3. Target group as a percentage of the population\n4. Extent of behavioral change required\nTractability of the Problem\n1. Technical difficulties\n2. Diversity of target group behavior\n3. Target group as a percentage of the population\n4. Extent of behavioral change required\nNonstatutory Variables Affecting\nImplementation\n1. Socioeconomic conditions and\ntechnology\n2. Public support\n3. Attitudes and resources of\nconstituency groups\n4. Support from sovereigns\n5. Commitment and leadership\nskill of implementing officials\nNonstatutory Variables Affecting\nImplementation\n1. Socioeconomic conditions and\ntechnology\n2. Public support\n3. Attitudes and resources of\nconstituency groups\n4. Support from sovereigns\n5. Commitment and leadership\nskill of implementing officials\nAbility of Statute to Structure\nImplementation\n1. Clear and consistent objectives\n2. Incorporation of adequate\ncausal theory\n3. Initial allocation of financial\nresources\n4. Hierarchical integration within\nand among implementing\ninstitutions\n5. Decision rules of implementing\nagencies\n6. Recruitment of implementing\nofficials\n7. Formal access by outsiders\nAbility of Statute to Structure\nImplementation\n1. Clear and consistent objectives\n2. Incorporation of adequate\ncausal theory\n3. Initial allocation of financial\nresources\n4. Hierarchical integration within\nand among implementing\ninstitutions\n5. Decision rules of implementing\nagencies\n6. Recruitment of implementing\nofficials\n7. Formal access by outsiders\nStages (Dependent Variables) in the Implementation Process\nStages (Dependent Variables) in the Implementation Process\nPolicy outputs\nof implementing\nagencies\nCompliance\nwith policy\noutputs by\ntarget groups\nActual\nimpacts\nof policy\noutputs\nPerceived\nimpacts\nof policy\noutputs\nMajor\nrevision\nin statute\nFigure by MIT OCW.\n\nThe policy lifecycle view\nz Consider creating policy in a lifecycle context, like\ndesigning a product\n- Remember \"Design for manufacturability, producibility,\noperability\"?\n- Conceive, Design, Implement, Operate, and incorporate learning\ninto the next iteration\n- Enter each phase of the policy lifecycle with a view towards\nupstream and downstream influences\n- What is the equivalent of \"disposal\" or \"retirement\" in the policy\nlifecycle?\n\nCharacteristics of effective policy\nimplementation\nz What makes for effective policy implementation?\n\nEffective implementation (1/2)\n1.\nPolicy mandates clear and consistent objectives\n2.\nPolicy based on sound theory of causal linkages, gives\nofficials sufficient jurisdiction and points of leverage to\nattain goals\n3.\nPolicy structures implementation process effectively;\nright agencies, integration, decision rules, dollars,\nsupport\n\nEffective implementation (2/2)\n4.\nLeaders of implementing agencies possess managerial\nand political skill and are committed to policy's goals\n5.\nPolicy is actively supported by constituency groups\nand leaders\n6.\nPolicy objective not undermined over time by changing\nconditions\n\nAssessing Technology and Policy\n\nPolicy assessment\nz What questions should you ask yourself in assessing a\npolicy in retrospect?\n\nAssessment and Reflection\nz How well did the policy achieve its goal?\nz What were unintended consequences?\nz What went well or poorly in the conception, design,\nimplementation?\nz What were unanticipated complications?\nz \"What if...\" we used a different framing, considered\ndifferent stakeholders, called on different powers,\nmobilized other constituencies, found different windows\nof opportunity, etc."
    },
    {
      "category": "Lecture Notes",
      "title": "lec16.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/70c145e908a49e4e751eef1569b54c09_lec16.pdf",
      "content": "Technology and Policy Analysis\nAnnalisa Weigel\nNovember 6, 2006\n\nESD. 10 Meta-Learning Objective: Appreciate the political,\nsocbl, and institutional context of technological systems\nCurrent issues in technology and policy\nLearning to see:\nGoals (equity, efficiency, security, li belty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy S O ~ U ~ ~ O ~ S\n(inducements, rules, fads, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions, powers, resources,\nchannels, windows, technology constraints and enablers)\nEconomics (cost-benefit analysis, pareto optirnality, utility)\nTerm Pr0j ect (conceive, design, execute a policy research project)\nLearning to articulate:\nWrif ing (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPre~en\ntat ion (term project, group homeworks)\n\"Real world\" experien-2s of policy p --ictitm\nlners\n\nApplying technology and policy\nanalysis techniques\nz Examine 6 drawers in the tool chest using an example\ntechnology and policy area\n- Telecommuting\nz Read stage setting article\n\n\"Drawers\" in your tool chest for\ntechnology and policy analysis\nIssue Framing\nStakeholders\nTechnology/Policy Interactions\nWindows\nChannels\nPowers & Resources\n\nIssue framing\nz What fundamental goals are in play?\nz What are the bounds of the issue?\nz How is the issue cast?\n- Economic (cost-benefit), safety (risk-benefit), interests (sides),\ncontrol, conspiracy, victimization, causes\n\nStakeholders\nz Who cares about the issue? What are their motivations?\nz What are their core beliefs and values?\nz How are stakeholders arrayed on the issue?\nz What coalitions exist?\n\nTechnology and policy interactions\nz How does the technology constrain or enable policy?\nz How does the policy constrain or enable technology?\nPolicy\nTechnology\n\nChannels\nz What channels exist for taking action on the issue?\n- Electoral, legislative, legal, administrative, media, grassroots...\nz What are the costs and benefits of using various\nchannels, now and in the future?\n\nPowers and resources\nz Who has formal and informal power to take action?\nz Who has resources to put to the issue?\nz Who can influence those that take action / have\nresources?\nz How can people with power/resources/influence be\nmobilized?\n\nWindows\nz Which focusing events could be imagined that would put\nthe issue on the agenda?\nz Are there institutional routines for moving the issue?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/b0c37c3e7ab10d552c8608d7d7718d24_lec17.pdf",
      "content": "Technology and Policy Analysis\nAnnalisa Weigel\nNovember 8, 2006\n\nESD.10 Meta-Learning Objective: Appreciate the political,\nsocbl,and institutionalcontext of technological systems\nCurrent issues in technology and policy\nLearning to see:\nGoals (equity, efficiency,security, libelty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy S O ~ U ~ ~ O ~ S\n(inducements, rules, fads, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions,powers, resources,\nchannels, windows, technology constraintsand enablers)\nEconomics(cost-benefit analysis, pareto optirnality, utility)\nTerm Pr0ject (conceive,design, execute a policy research project)\nLearning to articulate:\nWrifing (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPre~entation (term project, group homeworks)\n\"Real world\" experien-2s of policy p--ictitm\nlners\n\nWhat the term project should be\nstriving for\nz Fair, unbiased analysis of a technology and policy issue\n- Address all sides of the issues\n- Address pros and cons of all sides\n- Let your analysis make your point\nz Making a new contribution to the issue\n- Clearly explain what has been done by others in the area, and\nwhat your group will do that is new and different, and why it is\nnew and different. Make this explicit in your report.\nz Succinct, focused, cohesive report and presentation\n- Quality over quantity\n- Choose every paragraph, every point carefully\n- Organize along logical argument path; not historical sequence of\ngroup work\n\nCommon term project pitfalls\nz Laundry lists / book report\n- Often a result of stovepipe team organization\n- Solutions\n- Integrate team work more\n- Descope the project to a few items\nz Recommendations stated without discussion of\nimplementation benefits and challenges\n- Solutions\n- Discuss how to implement each recommendation\n- Raise the practical challenges to actually accomplishing the\nrecommendation\n- Do a channels, powers, and resources analysis for the\nrecommendation\n\nCommon term project pitfalls (2)\nz Not enough synthesis\n- Often a result of spending too much time gathering data; doing\nanalysis in stovepipes\n- Solutions\n- Stop data collection and analysis early enough to allow appropriate\ntime for synthesis thinking and bringing everything together\n- Think of graphical representations that represent your findings or\nconclusions\n- Accomplish synthesis as a group, not as individuals\nz Uniqueness of project contribution is unclear\n- Solution\n- Explicitly state the contribution; why is it new and different\n- Descope the project to allow time for making a new contribution\n\nCommon term project pitfalls (3)\nz Report is too long\n- Often a result of not wanting to cut text; feelings that quantity is\nimportant; wanting to show everything the group has learned\n- Solutions\n- Decide as a group what important points your report should make,\nand have discipline in choosing what text to use in making those\npoints\n- Put tables, history, background, etc. in appendices if you really\nwant to include them in the report. Whatever is not strongly\nassociated with supporting your main points doesn't belong in the\nreport\n\nCommon term project pitfalls (4)\nz Report lacks graphics\n- Often teams leave thinking about graphics til the end when they\nare making their presentations\n- Solutions\n- Think about graphics throughout the whole project\n- Include graphics in your report; they are synthetic and\nsummarizing; pictures are worth a thousand words\nz Too much background and introductory material\n- Solutions\n- Reduce to a minimum; focus instead on what the group has really\ncontributed to the issue - which is the most important part of the\nreport!"
    },
    {
      "category": "Lecture Notes",
      "title": "lec19.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/caaa8cef98aa4382caaf97e7d6c82c6f_lec19.pdf",
      "content": "Term Project Update,\nFeedback Summary\nAnnalisa Weigel\nNovember 15, 2006\n\nESD.10 Meta-Learning Objective: Appreciate the political,\nsocbl,and institutionalcontext of technological systems\nCurrent issues in technology and policy\nLearning to see:\nGoals (equity, efficiency,security, libelty)\nProblem framing (symbols, numbers, causes, interests)\nPolicy S O ~ U ~ ~ O ~ S\n(inducements, rules, fads, rights, powers)\nLearning to analyze:\nPolicy analysis toolkit (positions,powers, resources,\nchannels, windows, technology constraintsand enablers)\nEconomics(cost-benefit analysis, pareto optirnality, utility)\nTerm Pr0ject (conceive,design, execute a policy research project)\nLearning to articulate:\nWrifing (policy memos, policy research studies)\nDialogue (recitations, class discussions)\nPre~entation (term project, group homeworks)\n\"Real world\" experien-2s of policy p--ictitm\nlners"
    },
    {
      "category": "Resource",
      "title": "final_eval.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/e83b3af17c0d2a8086d4333d483de32f_final_eval.pdf",
      "content": "ESD.10 Introduction to Technology and Policy\nFall 2006\n\nTerm Project Contributions Evaluation\n\nInstructions\nFor each person on your team (including yourself), please describe their tangible and intangible\ncontributions to the project in a few sentences. This sheet will be turned in to the course faculty,\nand the information will not be shared with your teammates. Please turn in an electronic copy to\nMIT Server, and bring a hard copy to class.\n\nProject title:\n\nYour name:\nContributions:\n\nTeammate name:\nContributions:\n\nTeammate name:\nContributions:\n\nTeammate name:\nContributions:\n\nTeammate name:\nContributions:"
    },
    {
      "category": "Resource",
      "title": "nrc_request.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/b1e4e5cae0bd9f406da89ead4e8383be_nrc_request.pdf",
      "content": "Below is a sample email sent to a committee staffer of the National Research Council to\nrequest help in choosing a topic for the ESD.10 Group Project.\n\nHello Ms. XXXXX,\n\nMy name is ________ and I am writing to ask for your help with an MIT class\nproject on National Security. In particular, I would like to ask for your advice on\nchoosing a topic and, perhaps, suggested resources where we could find\ninformation. I am a first year graduate student in the Master's program on\nTechnology and Policy at MIT. I am working with a team of 4 other students to\ndevelop a report during the coming semester that reflects the studies of the NRC.\nOur report must be in the topic of National Security and it must tackle an issue\nthat connects technology with policy. I found that you are a Program Manager for\nthe Committee on Law and Justice. I found a report under this committee that\ncaught my interest: \"Information for Terrorism Prevention: Balancing Privacy and\nNational Security\".\n\nOur team has been brainstorming ideas. We are considering a study on the\nconflict between national security and personal rights. Two potential topics we\nconsidered were the rights of the immigrant entering the US and the rights of US\ncitizens to the privacy of their information. We are just beginning work on this\nproject and we are open to ideas. Our work can be anything related to Nation\nSecurity. Are there any projects that you feel should be pursued? We understand\nthat you are busy, and we would appreciate any feedback you are able to give\nus.\n\nThank you."
    },
    {
      "category": "Resource",
      "title": "projects.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/a58ca6d25f41a4118b576c62e7123199_projects.pdf",
      "content": "ESD.10 Introduction to Technology and Policy\nTeam-based Term Project Guidelines\nFall 2006\nFor your term project for this class, you will conceive, research, and write a study of an\narea of interest in science and technology policy. You will work in groups of 4-5 students.\nThe reports will be based on the format and process of the National Research Council\n(NRC), the leading source of advice to the US Government and the science and technology\ncommunity, and supplemented with views and analysis techniques learned in ESD.10.\nThroughout the project, the structure of the assignment will help you simulate the way\nstudies are executed in the National Research Council. Thus, one useful bi-product of this\nexperience is learning about the NRC study process. The term project is also your\nopportunity to synthesize what you will learn over the course of this semester and apply it\nto a real world problem.\nNote: Unless otherwise noted, assignments are due by the beginning of class on the date\ndesignated in parentheses.\n1. Introduction to projects, team assignments (9/6)\nThe lecture on September 6th will introduce the process to students, give some guidelines\nfor choosing a topic and getting started, and get the groups together in class for the first\ntime.\n2. Contact NRC program managers for ideas, research the issues (9/13,\n9/15)\nAt the NRC, studies are done based on a perceived need in a particular topic area. To\nchoose a study topic, each group will first need to develop an understanding of the\nimportant issues in their assigned subject area. You should contact the NRC program\nmanager for your relevant subject matter, and inquire about potential project ideas (we may\nsuggest other people to contact as well). Every NRC program manager has a list of ideas in\nmind that they would like to see done. We also recommend reading popular and trade press\narticles in your subject area. Students will then select from these ideas and develop them\nfurther. The research on the final projects, then, is both relevant and undone - the final\nreports will be a genuine contribution!\nNote: Several groups may wish to contact the same NRC program manager or other\npopular expert. To prevent overwhelming these gracious outside sources of information\nwith multiple requests, we ask that you submit in class on Wednesday, Sep 13th the\nappropriate NRC program manager or expert name(s) that you wish to contact. We will\nthen let you know which teams are contacting which NRC/expert people, and ask that\nteams work together and initiate only one contact per NRC/expert person on behalf of all\nteams interested in their project ideas. Contact should be initiated by Friday, Sep 15th.\n\nKeep in mind approaching NRC program managers and outside experts is a delicate\nmoment: How do you approach a busy person you don't know, explain to him or her what\nyou are doing, and persuade them to help you? Compose your memo/email with\ncare...Check out the class website on MIT Server for links to prior contact emails to use as\nmodels (under Materials, Final Project). You should also review the NRC library of\nprevious study reports to help you understand the \"anatomy of an NRC report.\" We will\nalso provide examples of previous term projects for your reference, but keep in mind every\nproject is unique by nature, and will look and feel somewhat different.\n3. Develop and submit committee charges (12pm on 9/26)\nNRC studies are not completed by standing NRC employees, but by outside experts who\nare brought in to serve for a finite time. In the NRC, the first step to initiating a study is to\ncreate a committee charge - a short, 1-page description of what the committee of experts\nshould accomplish in the study. For your projects, each group will develop and submit two\n(2) of these committee charges. Please see examples from NRC reports available on their\nwebsite. These charges are handed in to the teaching team, in order of preference, and we\nwill then approve your choices so you may begin doing the research. We request two\ncharges so that the teaching staff can select the project idea that best fits within the learning\nobjectives of the class. Be careful to write two completely distinct project proposals. Please\nalso hand in the responses from the NRC program managers and other experts to your\nqueries about topics.\n4. Select the committee (4pm on 10/6)\nThis part of the assignment mimics the process taken in the NRC to choose a committee of\nexperts to complete the study. Groups select the experts to serve on their \"virtual\ncommittee\", allowing for a balance of expertise and backgrounds (e.g.\nindustry/academic/government types). These can be, but do not have to be, people you are\nin contact with who can help you with your report. On the due date listed above, groups\nwill hand in lists of experts with brief explanations of their expertise, and what you would\nexpect them to contribute to the project.. The purpose of this assignment is both to follow\nthe NRC model and to get the teams started on finding out who has written about their\ntopic. This can help point the way to books, papers, and other interesting material on your\ntopic. These experts may also be useful to actually contact to ask for information, review\nsome of your ideas, etc.\n5. Submit project proposal (10/16)\nEach team should submit a 3 to 4 page proposal for your project. In the main body of the\ntext include the background, context and scope for your problem, policy and technical\nconsiderations, key framing questions, as well as the methodology you plan to use to\nexamine the problem. Write enough to let the teaching staff know that you have captured\nthe salient issues of your topic. In an appendix include the following:\n1. A list of resources - both sources you have used and sources you plan to study.\n2. A Work Breakdown Structure (WBS) for your team. The WBS should detail the\ntasks required to complete the study and a plan for how the work will be divided\nwithin your team. Consider issues such as whether you will have one person serve\nas group facilitator or rotate the facilitation position, etc. Also consider issues of\n\nhow the group will resolve differing opinions on the team, and how it will deal with\nany team conflicts that arise.\n3. A 1-page Outline of the Final Report.\n6. 360° Team Evaluation (10/23)\nThis is an exercise designed to allow students to reflect on the strengths and opportunities\nfor improvement of themselves and their teammates. This feedback technique is based on\nthose used by high-performance work organizations. Each student will evaluate\nthemselves and each of their teammates for strengths as well as opportunities for\nimprovement. Follow the template provided on the course website.\n7. Project draft report and executive summary (11/6)\nOn the due date above, groups will submit their rough draft of the final report. These\nshould be close to the final length, and have all of the major sections worked on. The\nteaching team will then read through the reports and give feedback shortly thereafter.\n8. Outside feedback on executive summaries (11/22)\nWhen the executive summaries are completed, they should be sent to people who are\nexperts in the field. These can be people at MIT or elsewhere who agree to read the\nexecutive summary and provide useful commentary. Keep in mind these experts are\nagreeing to give you some of their valuable time, and consider carefully how and when you\nwill ask these experts to help you. Groups will submit these comments on the due date\nabove, along with discussion about how they plan to respond to the reviewers' comments.\n9. Final Presentations (12/4, 12/6)\nGroups will present their findings in a specially-arranged forum during class time.\nMembers of TPP, ESD, and the MIT community will be invited to attend. Presentations\nwill be short - 15 to 20 minutes - and will be followed by a few minutes of questions and\ndiscussion.\n10. Final paper submissions (4pm on 12/8 - note this is a Friday)\nGroups will submit their final papers on the above due date, in polished form. These will\nbe graded by the teaching team, and then posted on the ESD Working Paper website\n(http://esd.mit.edu/WPS/) for further use by the community. They should include an\nannotated bibliography - i.e. each entry explained for its quality, content, and relevance.\nWe will also encourage you to submit them back to the National Research Council staff\nmember who you spoke with about initial project ideas. They will be interested to see the\nfinal work!\n11. Project Team Evaluation (12/11)\nEach student will submit an evaluation of the contributions they and their teammates\nprovided to the project. First, write 4 to 5 sentences describing your personal contribution\nto your team. Next, write 1 to 3 sentences for each of your teammates to describe their\ncontributions. Make sure to include both tangible and intangible help that people provided."
    },
    {
      "category": "Resource",
      "title": "commcharge1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/864dc5419eebad088d13955b9c3fad51_commcharge1.pdf",
      "content": "PRIVACY CONCERNS IN CORPORATE AND GOVERNMENT DATA MINING\n\nAppendix A: Committee Charge\nThe project will examine the current state of personal information data mining across a\nbroad selection of industries and applications. Important goals of the project are to\nidentify industries that use data mining to collect personal information about individuals\nand to evaluate how effective these techniques are at fulfilling the industry's needs. The\nreport will evaluate the effectiveness of data mining techniques, both those currently in\nuse and those under development in research. The report will also examine the threat to\nprivacy that data mining imposes. Case studies will be conducted in the discipline of\nhomeland security, health care, or consumer retail (to be decided by the committee).\n\nSpecific subjects to be addressed in the study will include:\n1. Which industries or disciplines use data mining to collect personal information\nabout consumers or citizens?\n\n2. What techniques do these industries use? What techniques are being developed\nand are they better than the current techniques?\n\n3. What goals are these industries trying to achieve through data mining?\n\n4. How do these industries measure success in achieving these goals? Is the\nknowledge that they gain from data mining useful and relevant?\n\n5. What are the privacy concerns associated with data mining? How can consumers\nor citizens protect their privacy?\n\n6. How will personal information data mining change the way that industries operate\nin the future?\n\n7. What should the government's role be, if any, in the use or regulation of data\nmining?"
    },
    {
      "category": "Resource",
      "title": "commcharge2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/e90a5d482284982094343c354c2109eb_commcharge2.pdf",
      "content": "Electronic Medical Records Committee Charge\n\nThe current state of medical data collection in the U.S. relies on individual systems for\nthe purpose of tracking patients in hospitals and physician offices. Networking data has\nbecome more common in regional areas in the last decade, but the health care industry\ncontinues to lack a national EMR structure. In 2004, President Bush committed $100\nmillion to the start-up of a national Electronic Medical Records (EMR) system. This\nfunding, under control of the Department of Health and Human Services, will be used for\nsmall-scale regional pilot projects. There are currently over 100 local groups applying for\nthese funds, which add to the number of local EMR systems that developed prior to the\ninitiative1. The majority of existing EMR systems were created in the 1990's after\nadvancements in technology and a changes in federal policy for Medicare and the\nhealth care system.\n\nThe benefits and pitfalls of a national EMR system as well as its feasibility have been\ndebated in the national policy arena over the past decade. After much political debate, the\ncreation of an EMR system has been deemed beneficial and necessary, receiving support\nfrom both political parties and recently proposed and funded by the Bush administration.\nGiven the administration's position that a national EMR is an effective solution to lower\nhealth care costs and improve care in America, we will not seek to evaluate the question\nof whether or not a national system should be created. Instead, we assume that such a\nsystem will be developed and discuss the policy and technology issues associated with\nprivacy.\n\nThis report will examine the new challenges in protecting medical privacy under a\nnational EMR system. Medical privacy is defined as identifying patient ownership of the\nsystem, determining stakeholder access to the system, and evaluating technology\nsolutions to protect the system from unauthorized use."
    },
    {
      "category": "Resource",
      "title": "360_colleague.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/714100270745108c5090b03a23e67501_360_colleague.pdf",
      "content": "Your name:_______________________________________________________________\nESD.10 360° Colleague Evaluation Form - Fall 2006\nFill out a form for each colleague on your term project team.\nColleague's name:_________________________________________________________\nAreas of excellence and improvement\nWith respect to the colleague named above, please evaluate the following areas by placing an 'X' in the appropriate\nbox below. Each statement in the first column completes the phrase \"My colleague...\nArea\nNeeds great\nimprovement\nNeeds a little\nimprovement\nAcceptable\nGood\nExcellent\nNot enough\nopportunity\nto observe\n...conducts himself / herself in\na professional manner\n...shows me respect\n...encourages me to share my\nideas and opinions\n...communicates information\neffectively to me\n...works constructively in our\nteam\n...takes responsibility for his /\nher own work\n...shares responsibility for the\noverall work of the team\n...takes initiative and follows\nthrough\n...attends team meetings\n...promptly completes tasks\n...shares equally in the work\nPlease list three strengths of this colleague:\n1.\n2.\n3.\nPlease list the three areas of improvement for this colleague, and explain how he / she might improve.\n1.\n2.\n3.\nIf you wish, please elaborate or make clarifications below."
    },
    {
      "category": "Resource",
      "title": "360_team.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/cc2a6640fbb168d9e8fa926bbbef59c8_360_team.pdf",
      "content": "Your name:_______________________________________________________________\nESD.10 360° Team Evaluation Form - Fall 2006\nFill out only one of these forms for your whole term project team.\nTeam's name:____________________________________________________________\nAreas of excellence and improvement\nWith respect to your entire team as a group, please evaluate the following areas by placing an 'X' in the appropriate\nbox below. Each statement in the first column completes the phrase \"My team...\nArea\nNeeds great\nimprovement\nNeeds a little\nimprovement\nAcceptable\nGood\nExcellent\nNot enough\nopportunity\nto observe\n...is focused on common goals\n...has a vision of its end\nproduct\n...shares work equally among\nits members\n...takes responsibility for its\nwork as a whole\n...does real work face-to-face\n...holds meetings that are\neffective\n...communicates effectively\n...listens to its members\n...listens to outside feedback\n...makes decisions effectively\n...manages conflict effectively\n...reflects on how well it\nworks together\n...solves problems that arise\nPlease list three strengths of this team:\n1.\n2.\n3.\nPlease list the three areas of improvement for this team, and explain how it might improve.\n1.\n2.\n3.\nIf you wish, please elaborate or make clarifications below."
    },
    {
      "category": "Resource",
      "title": "challenger.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/b5a6c97b0f7d3efd1e3dc116c5674c3b_challenger.pdf",
      "content": "The Challenger Disaster\nDaniel Hastings\nSeptember 2003\nOverview\nThe explosion of the Space Shuttle Challenger in 1986 has a specific proximate cause\nthat can be traced to a set of interlocking technology and policy decisions over many\nyears going back to the late sixties.\nTechnology Issues\nSpace technology: Large payload needs (40, 000 lbs up-mass) to orbit and the rocket\nequation (follows from conservation of mass and momentum for a rocket) and the deep\ngravity well on the surface of the Earth demand very high thrust rockets for takeoff\n(millions of lbsf). Economic development considerations drove the choice of segmented\nsolid rocket boosters to give the initial high thrust. Solid rockets burn solid fuel and\noxydiser at very high temperatures and cannot be turned off once lit. Thus once a leak\ndeveloped in an O-ring (necessary because it was segmented) the fate of the Challenger\nand the astronauts was sealed.\nPolicy Issues\nSpace policy: The US Space Policy statement of 1982 defined the Shuttle (STS) as the\nUS primary means of space transportation and said that it would be both fully operational\nand cost effective in providing routine access to space. Fully operational meant that it\ncould be used for routine operations (not test flights) and cost effective was interpreted to\nmean that it could launch on schedule without delays.\nThe policy statements put pressure on the NASA managers to use a technically unsound\ndesign and to launch in extreme conditions. This was the backdrop to the actual specific\ncause of the disaster. This illustrates one of the issues with complex systems, that some\nbehavior may be emergent since the sequence of events that led to the disaster was not\npredicted by anyone.\nReading\n\nLaunius , Roger D. and McCurdy, Howard E. Spaceflight and the Myth of Presidential\nLeadership. Urbana: University of Illinois Press, 1997. (Especially Chaps 2-6)\nIntroduction to Systems Thinking (10pp) [Sterman, John Business Dynamics: Systems\nThinking and Modeling for a Complex World, Irwin/McGraw-Hill, 2000 and other\ninformation is generally available at http://www.hps-inc.com]\nJudgment Under Uncertainty (25 pp) [Kahneman, D, Slovic, P. and Tversky, A. (1982)\nJudgment under Uncertainty: Heuristics and Biases. New York: Cambridge University\nPress, pp. 463-489.]\nAn Outsider's Inside View of the Challenger Inquiry (11pp) [Feynman, Richard (1988)\n\"An Outsider's Inside View of the Challenger Inquiry,\" Physics Today, February, pp. 26\n37.]\nThemes\n1. The Proximate Cause of the Challenger Disaster\n2. Poor Communication and Poor Ethics\n3. Dynamic Complexity\n4. The Technical Design & the Path to a Segmented Solid Rocket\n5. Risk and Cost Estimates for the Shuttle\n6. Flawed Space Policy\n7. Primary Policy versus Secondary Policy\n8. Effects of the Challenger Disaster\nThe proximate cause of the Challenger disaster\nOn 28 January, 1986 the Space Shuttle Challenger took off with a teacher on board and\nexploded 73 seconds later. The immediate cause of the explosion was a burn through of\none of the O-rings on one of the solid rocket boosters. This caused the solid rocket (steel)\nwall to fail at the burn-through point. The solid rocket then pivoted into the large external\ntank causing release of hydrogen which underwent a deflagration leading to the Shuttle\nChallenger being ripped apart at altitude.\n\nThe proximate cause was the leakage of two rubber O rings in a segmented solid rocket\nbooster. The rings has lost their ability to stop hot gas blow-by because on the day of\nlaunch they were cold (estimated at 20 degrees F, well below freezing). The ambient\ntemperature at launch was in the low 30s. See Figs 1-5 which show the location of\nthe boosters on the Shuttle, the segmented design of the solid rocket boosters, the detailed\ndesign and location of the O-rings, the start and end of the explosion.\nCourtesy of NASA.\nFigure by MIT OCW.\nFigure 1. Space Shuttle and Solid Rocket Booster Design showing location of O-\nRings\nExanded view of s\nidewall of the\nsolid rocket booster, showin\ng location and routing o\nf the o-rings\nFigure by MIT OCW.\nFigure 2. Detailed Location of O-Rings Diagram of Space Shuttle Challenger and solid rocket booster, showing location of the O-ring that failed during launch.\n\nFigure by MIT OCW.\nFigure 3. Detailed Design of O-Rings in Solid Rocket Booster\n\nCourtesy of NASA.\nFigure 4. Picture showing the start of the explosion\n\nCourtesy of NASA.\nSol\nid\nrocket booster cutaw\nay diagram, showing segmented design held together by pins with o-rings at the joints.\n\nFigure 5. Picture showing the end of the explosion - The Shuttle is gone\nAmazingly the exact cause of the accident was debated for hours the evening before the\nlaunch between Morton Thiokol engineers, managers and NASA managers. Given the\npredicted temperatures of 26 degrees F, the engineers were concerned that the O rings\nmight not be resilient and that there was a history of O ring erosion on the STS during\ncold weather launches. This led them to recommend that the STS not launch at these low\ntemperatures. This was the first no-launch recommendation from Morton Thiokol in the\nhistory of the STS. Initially, the Thiokol managers supported the engineers. But under\ndisbelieving questioning by the NASA managers, the Thiokol managers put on their\nmanagement hats (their phrase!), changed their minds and changed the Thiokol\nrecommendation to launch. The NASA managers were thus mollified and felt justified in\napproving a launch with the well-known result that Challenger exploded.\nWhile the proximate cause was debated at length the night before, the disaster was also\nthe result of a set of coupled, feedback loops between technical, economic and policy\ndecisions that made such an accident almost inevitable. These decisions set the stage for\nthe specific cause. In the case we will address those coupled decisions as well as the\ncommunication and ethics issues associated with the specific cause. These decisions\nilluminate the following questions.\nTechnical\n1. Why were solid rockets (solid high explosive) chosen to launch people when the\nknown failure rate of solid rocket boosters was 1 in 25 (based on years of\nlaunching solid rockets)?\n2. Why were the solid rocket boosters designed with segments thus introducing\npotential leak paths and necessitating O-rings?\n3. How was the failure rate of the Shuttle assessed at 1 in 10,000 when key\ncomponents (the solid rockets) had failure rates of 1 in 25?\nEconomic\n1. Why was the Shuttle development cost capped even though it was known it would\nlead to higher long term operating costs?\n2. Why was the solid rocket booster manufactured in a site that could not ship a\nwhole solid rocket booster?\n\nPolicy\n1. Why was the Shuttle made the primary US launch vehicle by policy?\n2. Why was it declared an operational vehicle after only four test flights?\n3. Why was the policy decision made to allow a teacher on board the flight?\nPoor Communication and Poor Ethics\nIn the investigation that followed a number of contributing factors were identified. First,\nNASA managers, under pressure to show the STS was reliable, had authorized a launch\neven though the temperature criteria were outside of the known operational range of the\nSTS. In a sense the operational mindset, dictated by policy, had over taken them. They\nover ruled the engineers who warned of possible danger. Second, NASA and Morton\nThiokol engineers had known for some time that there were problems with gas blow-by\nthrough the O-rings.\nHowever, the NASA system ignored these signs and did not\ncalculate the consequences of a blow-by in a way that was clearly communicated to senior\nmanagement. The next figure shows the actual data that was presented to the Morton\nThiokol and NASA senior managers at the discussion the night before.\nCourtesy of NASA.\nFigure 6. Actual presentation of the O-ring damage data before the Challenger\nlaunch\n\nThis presentation of the data shows that on some STS flights there had been damage to the\nprimary and secondary O-rings. Note this that this alone should have given pause for\nconcern since the technical design called for no damage to the primary and absolutely no\ndamage to the secondary. However, it does not show any temperature dependence (the\nkey variable) or give any indication of how serious the erosion actually was. Thus the\nengineers, who were very concerned since they knew the consequences of blow-by of the\nsecondary ring, did not present the data in a way that showed the trends or that could be\nexplained to a skeptical senior NASA manager. They thought they were communicating\nbut missed one of the fundamental rules of good communication which is to express your\nposition in a way that your customer can understand. The next figure shows how the data\ncould have communicated (note they had all of this data on hand in the discussion).\nFigure removed due to copyright restrictions.\nPlot of O-ring damage index vs. Temperature at time of launch.\nSource: Tufte, Edward. Visual Explanations: Images and Quantities,\nEvidence and Narrative. Cheshire, CT: Graphics Press, February 1997.\nISBN: 0961392126.\nFigure 7. How the O-ring damage data could have been presented before the\nChallenger launch\nThis presentation of the data makes anumber of things clear. It suggests that there is\ndamage to the O-rings associated with several flights. It also suggests that a reasonable\ncorrelation is that the damage increases with decreasing temperature although there is\nsome uncertainty associated with the data. However, it does show that every launch below\n66F resulted in damaged O-rings. Furthermore it shows that the predicted temperatures for\nthe launch were well outside the previous experience base that NASA had with this\ncomplex machine. This would have communicated to senior decision makers much better\nthe dangers and could have been shown to the NASA administrator who would have made\nthe final launch/no-launch decision if he had been at the Cape.\nHowever, the NASA communication system by this time was so poor that senior\nmanagers did not know of these potential issues and the NASA administrator for the first\ntime ever did not go to the Cape for the launch. He thought this was a routine launch of an\n\nThese factors point up issues of communication and ethics. Even though there was great\ndanger, no one in the system felt empowered to listen and act. The managers ignored the\nexperts and did not allow multiple ways of checking on these critical systems. There\nshould have been a communication system whereby the engineers could have spoken to\nthe NASA managers and caused an independent review of the relevant data (on the\ngrounds that two independent sets of eyes are better than one). In addition, the engineers\nshould have been willing to resign over an issue where the stakes were so high. Every\nengineer and decision maker needs to understand what is his or her bottom line with\nrespect to decisions. When the bottom line is crossed, then the ethical choice is to\nseparate oneself from the decisions. This is fundamentally a question of values based on\nintegrity & technical excellence. When a critical decision is imminent is too late to decide\non what values are important. The willingness to separate oneself from flawed decisions\nalso clearly demarcates the boundaries for the decision maker.\nDynamic Complexity\nThe STS Challenger accident is an example of dynamic complexity making a prediction\nof the behavior of a system very hard. Also called behavioral complexity, this is basically\nthe degree to which the outputs (behavior) of a system are difficult to connect to the\ninputs.1[1] In this case, decisions made in the late sixties helped set the stage for an\naccident fifteen years later.\nThe definition may not sound striking, but the concept is critical. Intuitive understanding,\nformal modeling, and rational decision-making are all fundamentally based upon our\nexpectations about how system behavior will change in response to specific changes in\ninputs. If our beliefs about these relationships are incorrect, we cannot use available\ninformation to make wise decisions. This is actually fairly common: there are numerous\nexamples of the process, sometimes called \"policy resistance,\" of believing we\nunderstand a problem, taking steps to try to remedy it, but failing (and too often making\nthings worse): anti-lock brakes in cars make drivers more aggressive, decreasing safety;\nfire-suppression policy results in more severe forest fires; low-tar cigarettes lead smokers\nto smoke more, increasing carcinogen intake, etc. Except in very special cases, however,\nthere is not really an aspect of the system deliberately resisting the intended solution.\nRather, our understanding of the system - specifically, the reasons for its behavior - is\ninadequate. Why? Many factors contribute to dynamic complexity. Six of the most\nimportant (commonly present but unrecognized or misunderstood) are introduced below.\n1[1] For the concept of dynamic complexity and some characteristics of dynamically complex systems, we\nare indebted to John Sterman. For more information, see Business Dynamics: Systems Thinking and\nModeling for a Complex World (Irwin/McGraw-Hill, 2000).\n\nDynamics - over a long enough time frame, almost any aspect of a system can change; in\na short enough period, none do. Unfortunately, key elements can change at dramatically\ndifferent rates, making them difficult to judge. Causes and effects may be distant in time,\nand their relationships may change by the time their connections are recognized.\nCoupling - components of a system are said to be \"coupled\" if changing one affects the\nother. Tightly coupled elements make it almost impossible to affect the intended target\nexclusively; any change also causes some other changes, each of which may cause still\nmore changes, ... with each induced effect being less intentional and therefore potentially\nless predictable, recognizable, and controllable.\nFeedback - the condition created by a causal loop of couplings. When a system involves\nfeedback, a known change to a factor can eventually travel back and exert an additional\nchange to the original factor. A single feedback loop can result in significantly greater or\nlesser effects than expected, if the feedback is not anticipated. Multiple loops, acting in\ndifferent time frames, can result in practically unpredictable behavior.\nNonlinearity - when the changes in one or more outputs are not proportional to changes\nin the inputs. This is caused by coupling or feedback, and is primarily problematic\nbecause people rarely anticipate - or fully understand - nonlinear relationships.\nChaos - for our purposes, this is basically unpredictable behavior from a deterministic\nsystem. Chaotic systems are characterized by extreme sensitivity to initial conditions and\nunpredictable, aperiodic evolution (with some stable structure) instead of convergence to\na steady-state. The classic description of chaotic behavior is the \"butterfly effect.\"\nAdaptation - if the capabilities or preferences of actors within the system can evolve,\n(i.e., they learn from or actively respond to events), self-organization, self-selection, and\nco-evolution can result in sophisticated \"emergent\" behavior.\nFailure to recognize these characteristics in a system may lead to underestimation of the\ndynamic complexity of the system. Consequently, predictions of system behavior may be\nseriously flawed, while unwarranted confidence in these predictions (stemming from the\nbelief that the \"mechanics\" of the systems are understood) may be maintained.\nThe Technical Design of the STS & the path to a segmented solid rocket design\nWhen President Nixon took office in 1969, NASA funding was already going down (see\nFigure 8).\n\nThe Technical Design of the STS & the path to asegmented solid rocket design\nWhen President Nixon took office in 1969, NASA funding was already going down (see\nFigure 8).\nFigure 8: NASA Funding\nThe first Moon landing occurred in July 1969. The race to the Moon with the Soviets was\nwon! It was like the dog that caught the truck. What would NASA do now? To some\nextent NASA was caught in a time warp. NASA felt that after the first lunar landing it\nshould get whatever funding it needed. In September 1969, a Space Task Group chaired\nby Vice President Agnew reported three possible long-range space programs for NASA.\nThe first was a manned mission to Mars by mid-eighties, an orbiting lunar station and a\nfifty man Earth orbiting station served by a reusable shuttle. Funding for this option was\n$8 to $10 billion/yr. (Recall that at its peak NASA had received 5 billion/yr, see figure\nabove, thus this was an a doubling of the annual NASA budget). The second plan\npostponed Mars until 1986 and limited funding to $8 billion/yr. The third plan chose only\nthe space station and shuttle, with annual spending between $4 billion-5.7 billion/yr.\nHowever relative to the long gone days of the early sixties, the mood of the country and of\nthe President had changed. Nixon came from the Eisenhower mentality that saw the\nbig manned effort as stunts and saw the national security space program\n(strategic reconnaissance satellites) as more important than the NASA effort. He was also\nFigure by MIT OCW.\nFund\ning\nfor\nNASA\nvs.\nDOD\n, in\nFY\n8 d oll ars .\n\nprogram (strategic reconnaissance satellites) as more important than the NASA effort.\nHe was also much more interested in promoting public cooperation rather than\ncompetition with the Soviets and the Chinese. Further he strongly believed in frugality in\ngovernment spending. All these combined to make him cast a skeptical eye on the\nNASA requests.\nThe country also had changed. In 1969, the US had reached the Moon. The national\nmood was to turn to other issues especially in light of riots in cities, the war in Vietnam,\netc. Flights to the Moon seemed boring. For NASA it was a boom or bust cycle. As a\nmeasure of this, the Congress reorganized the standing space committees out of existence\nand Nixon abolished the Presidential Science Advisory Committee that had been\ninstrumental in advocating the Apollo program. Space became a secondary issue for the\npolitical establishment. Thus the last two Apollo flights were cancelled, the Apollo\nApplication Program was reduced to one SKYLAB and in a blow to the Air Force the\nManned Orbiting Laboratory (the first US Space Station) was cancelled. President Nixon\nrefused to support any of the options that NASA wanted. There was no congressional\nsupport for any big new initiative so NASA started to wither.\nIt was only the 1972 election that saved something for NASA. The declining population\nin the aerospace industry in the big states of California, Texas and Florida forced the\nPresident to approve something for NASA so that he could blunt the criticism of the\nDemocrats in these big states. He chose half of half of option 3. The choice was for a\nSpace Transportation System (STS), a space truck but the place it was to go to was\ncancelled. That is, the Space Station was not approved. Thus it was a space truck to\nnowhere (this led to many conflicting requirements). It was even worse than that. NASA\nhad suggested a completely reusable design based around liquid rocket engines (which\ncan be actively throttled and turned off). The idea was to stop throwing away expensive\nhardware. Nixon would only give them half the money requested. Thus they did away\nwith the completely reusable design and even worse with the liquid rocket engines. In a\ncompromise to fit within a fixed $3.2 billion NASA budget, they chose a non-reusable\nmain tank and worst of all, to make up the thrust they chose solid rocket motors.\nAs an aside, Von Braun had said that no human should ever ride on solid rockets. They\nwere just too dangerous. One in twenty-five blew up due to defects. They could not be\nstopped once lighted and thus had the potential for a major loss of life. However, to\nreduce development costs of liquid rocket engines, NASA chose to go with solid rockets.\nIn another first, they chose to go with Morton Thiokol, from the home state of the NASA\nadministrator. Morton Thiokol was in Utah, which is where it manufactured the solid\nrocket segments. Of course, by this choice they also brought another state into the fold to\nsupport the President. However a completed solid rocket would be too big to transport by\n\nroad to a port on the Gulf of Mexico to get it over to Cape Canaveral in Florida. Thus it\nhad to be built in segments (which needed to be sealed with O-rimgs) and integrated at\nCape Canaveral. Thus the seeds were sown for the Challenger disaster of a decade or so\naway. As a continuation of the sixties mindset of higher, faster and farther, NASA chose\nto develop shuttle main engines which had the highest thrust to weight ratio of any ever\nbuilt. They would be wonders of technology. It was argued that each engine would be\nreusable for 100 flights and that the shuttle would fly 100 times a year. In the operational\nphase the cost for launch was supposed to be only $10 million a flight. Since its payload\nwas 40000 lbs. to Low Earth Orbit (LEO) it would give cost of $250/lb to LEO.\nHowever even then some issues were seen. Since the STS could only go to LEO\n(~250km in altitude) it would have to carry an upper stage for it to be useful for any other\nobit. NASA thus sold itself to other organizations to get the support it needed. The\nShuttle payload bay was sized for various military missions as well as the payload\ncarrying capacity to LEO. It persuaded the Air Force to develop a solid propellant upper\nstage (IUS) to put 500 lbs. into LEO. It persuaded McDonnell Douglas to build two\nupper stages in return for a monopoly position. These were the PAM-D and PAM-A\nupper stages. It also started a cryogenic upper stage based on Centaur technology.\nNASA was in the desperate position (as it saw it) of having to do a big project to keep\nitself going and it was selling itself to get approval for the big project. The cost\nprojections which finally sold the administration were based on a large number of flights\na year which was based on a market which did not yet exist- (even today ~50 flights /yr\nworldwide for all types of launches). Thus there was a classic chicken-and-egg problem.\nIn retrospect the fundamental problem was forcing a pioneering technical program to be\njustified in economic terms. In this sense there was a huge disconnect between NASA\nand the administration. Note that Apollo was never justified on economic terms.\nThus for fundamentally economic and political reasons, NASA chose a unsound technical\ndesign namely segmented solid rocket boosters to launch human beings. Note that even\ntoday Ariane 5, which launches only satellites, makes the solid rocket boosters it uses in-\nsitu in Guyana and makes them as unitary systems without segments. They decided that\nintroducing leak paths into solid high explosive was too risky.\nProbability Basics\nThe most widely used formalism for classifying uncertainty is probability. The classical\nview is that the probability of an event occurring in a set of trials is the frequency of\nevent occurrence. From this equation, it is clear that probability must always be a\nquantity between 0 (no probability of occurrence) and 1 (certain occurrence). Consider\ntwo events, A and B, with probabilities of occurrence of P(A) and P(B), respectively. If A\n\nand B are independent events - if one occurring or not has absolutely no bearing on\nwhether the other occurs - then we know the following:\nP (A and B) = P(A)P(B)\n{a.k.a. the intersection of A and B}\nThus given the probability of one of the Space Shuttle Main Engines failing is 1 in 100,\nthe probability of two engines failing (which would have led to loss of the Shuttle since\none engine out is insufficient to cause Shuttle failure & assuming the failures are not due\nto the same cause) is 1 in 10,000 which is what they estimated. Since they were planning\non 100 flights a year then the Shuttle would have flown for 100 years before there would\nhave been a catastrophic launch. If the probability of a solid rocket failing is 1 in 25 then\nthe probability of both solid rockets failing is 1 in 625 which would certainly cause\nShuttle loss. For reference, the current NASA estimate of catastrophic Shuttle loss is 1 in\n250.\nRisk and cost estimates for the Shuttle\nIn contrast to the rosy market projections, the facts are that NASA has never managed\nmore than nine STS flights a year (see Fig 4), the Shuttle Main Engines (SME) needed to\nbe replaced every flight and the cost estimates per launch range from $80 million to $500\nmillion. There are three ways to estimate cost. The first is to take the total amount spent\nso far on STS and divide by the number of flights. This gives about $500 million/yr. The\nsecond is to take the annual amount in the NASA budget and divide by the annual flight\nrate. This gives about $250 million/yr. The last is to ask how much is saved when an\nSTS flight is cancelled. This is about $80 million/yr. This last figure is telling since\nwhat are saved are only the consumables. Most of the cost is in the standing army\nnecessary to operate and maintain the shuttle. This cost and the low reliability of the\nshuttle were not appreciated in the initial estimates. There was also some specious\nthinking at NASA about markets and either wishful thinking or an under-appreciation of\nthe difficulty of developing a new engine. The new engine contributed to the delays of\nthe first STS launch until 1981 and have contributed greatly to the poor reliability of the\nSTS. A truck it is not, it is much more like a finely tuned racecar.\n\nBar\nc\nha\nrt\no\nf\nSh\nut\ntl\ne\nmi\nssi ons pe r y ear , s how ing im p\nFigure by MIT OCW.\nFigure 9: Number of Shuttle Launches against year\nIn 1977, NASA projected that the shuttle would fly 600 times in the first eleven years of\noperation. The failure rate was estimated at 1 in10,000 flights and the reliability (i.e.\nability to take off on time) was estimated at 98%. The total cost of developing the shuttle\nin 1972 was estimated at $8 billion with each new orbiter costing $250 million to build.\nThe first test flight was scheduled for early 1978. The Shuttle was designed to\nDOD requirements to place reconnaissance satellites in orbit and retrieve them. Thus both\nit's size and cross range flowed from the intelligence requirements. The facts were very\ndifferent. The first shuttle flew on April 12,1981, three years late mainly due to the\ntechnical requirements and difficulties associated with the Space Shuttle main engine. It\ncost $12.6 billion to develop and each orbiter cost almost a billion to produce. The cost\nper payload pound is over $10,000. In the years 1983-1994, it only flew seventy times\nand in 2000 only managed five flights. Far from having a failure rate of 1 in 10,000 it\nproved (unhappily) to have a failure rate closer to 1 in 25 (although by now it has become\n1 in more than 100). Interestingly this is very close to the historic failure rate for solid\nrockets. The STS has taken off on schedule less than 50% of the time, and it costs $3\nbillion per year whether it flies or not (primarily for the standing army of support\npersonnel). It was supposed to be frequent, cheap and manned. Instead, it is occasional,\nexpensive and manned.\nFlawed Space Policy\nA fundamental difference with the Apollo experience is in the space policy which drove\nthe Shuttle. Apollo had a clear simple goal, manon the moon within the decade. In\ncontrast, the STS was all things to all people. It was initially conceived by NASA as the\n\nA fundamental difference with the Apollo experience is in the space policy which drove\nthe Shuttle. Apollo had a clear simple goal, man on the moon within the decade. In\ncontrast, the STS was all things to all people. It was initially conceived by NASA as the\n\"truck\" which would carry humans and material to an Earth orbiting space station. It was\nalso sold as the nation's primary launch system for all payloads, large and small. It was\nsupposed to use the economics of reusability and be cheaper to fly than any existing or\nfuture expendable launch vehicle. It was to provide routine and frequent access to space.\nIt was also to provide and carry orbiting lab facilities until a space station could be built.\nThese were captured in the Reagan space policy of July 4, 1982 which defined the STS as\nthe primary space launch system and said that it would be both fully operational and cost\neffective in providing routine access to space. The president also believed strongly in the\ncommercialization of space, a policy that he tried with Landsat and foisted on the STS\nand NASA.\nSince NASA wanted the STS to be primary US launch vehicle and wanted to justify the\nprojected high flight rate it had to capture most of the launch market. Thus it got the Air\nForce to agree that all future military missiles would fly on the shuttle. The Air Force\nalso agreed to refurbish the old Manned Orbiting Laboratory Space Launch Complex at\nVandenberg AFB to have a site to launch into polar orbit from military missions. It of\ncourse required that all NASA payloads went on the shuttle. Thus the Hubble and\nGalileo were designed to go up on the Shuttle. It enticed the commercial customers in\ntwo ways. It offered very attractive prices for the first three years of Shuttle operations.\nThus a PAM-D class satellite launch could be had for $15 million whereas to get the\nsame launch in an Ariane was $30 million and $25 million on Delta. It also pulled it's\npayloads from Delta and Atlas. Since there were now being used less and less but they\nneeded to sustain their infrastructure, their launch costs rose. Thus the Delta cost rose\nfrom $5 million a launch in 1970 to $26 million a launch by 1980. NASA also\nterminated the Delta and Atlas production lines in 1985. The Air Force did buy some\nTitan 34D's and contracted to buy only a few Titan 4's but did so over the objections of\nNASA and agreed to stop doing this. Thus NASA and the government moved to a one\nlauncher policy driven by the desire for cost effectiveness. By January 1986, the STS\nhad only flown twenty four times and had proven to be neither cheap nor reliable.\nHowever, so committed was NASA to the thesis that this was an operational vehicle that\nafter only four test flights they had declared it an operational vehicle and on the 25th\nflight they were going to fly a teacher into space, an event to be watched by millions of\nschoolchildren. Instead of quick turnaround what they had found with this \"operational\"\nvehicle was that every one of the 17,000 tiles on it needed to be inspected after every\nflight and every SSME needed to be replaced every time. They had also noticed some\nworrisome erosion in the solid rocket joints where the segments were put together. Thus\n\neach Shuttle, instead of a turnaround of days, took months to prepare and required a large\nstanding army of people to maintain it at human flight safety levels (0.99999). How\ncould the 1977 estimates have been so wrong?\nIn retrospect, there were a number of factors. There was a deliberate NASA strategy of\ngetting support for large programs with optimistic operational estimates and low cost\nestimates. This is the well known Camel's nose under the test strategy which basically\nrelies on getting things going and building supporters who would sustain the program as\nthe costs mounted. This strategy would be very clear on Station. In addition, the\ndesigners were overly optimistic about the technical progress of NASA. Perhaps they\nwere still living in the glory days of Apollo. In any case they clearly underestimated the\nSSME difficulty. Still they seemed to have taken leave of common sense. The SSME is\noperated at 109% of total rated thrust. This is at the \"red line\". Any mechanic will tell\nyou that an engine routinely operated at the \"red line\" will break down frequently. Truck\nengines (the model for the STS) work so reliably because they operate far from the\nmaximum capabilities of the engine. The STS was certified as operational after only 4\nflights with the really flight critical part, the ascent, being only 8 minutes each. Thus it\nwas certified after 32 minutes of critical flight. In contrast the F-22 is required to be\ntested for a minimum of 183 hours of flight time before Congress authorizes buying the\naircraft. Finally, the historical probability, based on many launches, of solid rocket\nfailure has been 1 out of 25. How the NASA engineers managed to convince themselves\nthat the catastrophic failure rate would be 1 in 10,000 when the STS had solid rockets on\nit, is hard to rationalize.\nPrimary Policy versus Secondary Policy\nAnother reason for the failure is in primary versus secondary policy. Primary policy\nbreaks with past decisions and perspectives to meet the nation's top priorities. It has long\nterm goals and has organized efforts to achieve them, so for Reagan primary policy was\nbudget cuts, tax cuts and a huge defense buildup. For Bush primary policy was on the\nbudget deficits. Primary policy is innovation. By contrast ancillary policy does not solve\nidentified national problems. It has low grade status and receives limited attention and\nfunding. Ancillary policy is the policy of continuation. By all these measures, in the\n60's space policy was primary policy. It met the national angst after Sputnik and was\nbold and innovative. The Congress clearly bought in and money flowed freely (see Fig\n8). There was broad public support and consensus on the goal, which was to show that\nthe US could beat the Soviets. In contrast all the space policy behind the STS was\nsecondary or ancillary policy. The interest in the space enterprise had declined in the\npublic mind and there was no consensus between the White House and the Congress on\n\nwhere to go. There was no Vice President Johnson to build the consensus with the\nCongress. In primary policy the question is \"What should we do?\" In ancillary policy,\nthe question becomes \"What can we afford?\" and \"How can we sell it?\" The STS and\nSpace Station decision was marked by all of these large differences with the Apollo\ndecision. The biggest and clearest way to see the difference between the two is to look at\nthe difference in funding as a function of the Federal budget. This is a measure of the\nimportance the administration and Congress really puts on something. In FY60, the\nNASA budget was 0.8% of the Federal budget. In FY66 it was 4.4% of the Federal\nbudget, in FY80 it was back to 0.8% of the budget, in FY84 (Space Station) it was 0.8%\nof the budget and actually dropped the next year to 0.7% of the budget. In FY90 (Space\nExploration Initiative) it was 0.99% of the budget and has since dropped significantly.\nEffects of the Challenger disaster\nThe Challenger disaster struck the national psyche like Sputnik. It was made all the more\nvisible by the fact that so many schoolchildren were watching because a teacher was on\nboard. It plunged the space program and space policy into a huge crisis. Unhappily,\nthere were several other launch failures that occurred at about the same time. These\nincluded in April 1986, a Titan 34D at Vandenberg and in May, a NASA Delta rocket\nthat was launched into a thunderstorm. It seemed that NASA could do nothing right! The\nresult was that all launch activity was grounded for several years while the technical\nissues were fixed & while the space policy was adjusted. The consequences of putting all\nthe nation's eggs in only one major basket now meant that the US had no reliable means\nto get to space. The STS was grounded for 31 months and in that time space policy was\ntransformed and the Air Force, commercial, international and NASA communities\nrepositioned themselves. Since no launches were available on US rockets, many\ncommercial satellite contractors turned to Arianespace. The US market shares of\ncommercial launch plummeted and Ariane took significantly more than 50% of the free\nworld market. In a sense, the seventies space policy of not allowing the French to use\nAmerican rockets which pushed them to develop their own and putting all the US eggs in\nthe Shuttle basket led directly to Ariane capturing most of the commercial market.\nFortunately, many satellites had been designed to fly on the Shuttle and on the Ariane.\nAfter much debate in the space policy community, it was decided that the Shuttle would\nonly be used for national security missions and for scientific missions where human\npresence was essential. All commercial communication satellites were pushed off the\nShuttle and told to find other rides. This caused chaos in the commercial community and\npushed them into the arms of Ariane. Of course this policy of using the Shuttle only\nwhen essential is a testament to the fact that it will never be an economic proposition.\n\nThe DoD decided that it wanted to move away from the Shuttle and return to a mixed\nfleet of expendable launch vehicles for assured access to space. Thus it cancelled the\ndevelopment of the Shuttle launch pad at Vandenberg AFB and restarted the Delta,\nCentaur and Titan lines. It agreed to buy 20 Deltas, 11 Centaurs and 24 Titans as a\ndeliberate attempt by government policy to kick-start a dying industry. It also agreed to\nprovide range support for all launches at the Cape Canaveral and Vandenberg AFB for\nonly direct costs. Thus the DoD deliberately agreed to subsidize the commercial space\nindustry, which was a form of space industrial policy.\nThe NASA scientific satellites were shelved to await the STS return to flights. Thus both\nHubble and Galileo were put in storage to await later launch. In addition, the cryogenic\nCentaur upper stage for use from the Shuttle bay was cancelled. It was now seen as just\ntoo dangerous for a rare, high value asset like Shuttle. The direct consequence of this\nwas that the Galileo mission when it flew would take two more years since there was now\nno upper stage to push it directly to Jupiter. In order to get there it would have to do a\nflyby past Venus and the Earth twice to get enough velocity. Since it is a radio isotope\npowered vehicle, this meant that 30 kg of plutonium came flying by the Earth twice to get\nto Jupiter. This has had the consequence of inflaming the anti-nuclear movement and\nprobably set back substantially the use of nuclear power in space. The delays for Galileo\nand the Hubble turned out to have interesting consequences. For Hubble, it was fortunate\nsince problems were discovered with the space telescope paint that would have been\nmuch harder to fix in orbit and may have limited its utility. For Galileo, it was bad.\nGalileo was shipped across the country three times (twice to the Cape and once back).\nThis cross country trip and long storage led to the loss of lubricant in the high gain\nantenna which subsequently led to loss of that system on the way to Jupiter. Finally,\nNASA abandoned the policy of flying civilians (i.e. not regular astronauts) in the shuttle.\nIn 1991, the President's advisory commission on space found the STS was still in the\ndevelopmental phase after ten years of flights. So much for operational status!\nConclusion\nThe Challenger disaster illustrates the potential for coupled technology and policy\ndecisions. It was a flawed technology choice driven by economic realities that coupled\nwith a completely unrealistic set of policy statements set the stage for the disaster. It also\nshowed the importance of clear communications and multiple ways to look at critical\nissues. Finally, it illustrated the nature of ethics in the face of bad decisions.\nFor the concept of dynamic complexity and some characteristics of dynamically complex systems,\nwe are indebted to John Sterman. For more information, see Business Dynamics: Systems Thinking\nand Modeling for a Complex World (Irwin/McGraw-Hill, 2000).\n[1]"
    },
    {
      "category": "Resource",
      "title": "heywood_testmony.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/fd4e603bb391ff2814aef517944faf04_heywood_testmony.pdf",
      "content": "Testimony presented at U.S. House of Representatives' Science Committee,\nSubcommittees on Energy and Research joint hearing on \"Fueling the Future: On\nthe Road to the Hydrogen Economy,\" Wednesday, July 20, 2005 by Professor John\nB. Heywood, Director Center for 21st Century Energy and the Sloan Automotive\nLaboratory, MIT.\n\nIt is a pleasure to testify before your committee today on meeting the future energy needs\nof our U.S. transportation system. I have been working in this area at MIT for the past 37\nyears doing technical research and broader strategic analysis on how to reduce the\nenvironmental impacts and fuel consumption of our transportation vehicles. Summaries\nof our groups' relevant recent studies are attached to this testimony.\n\nOur work, and that of others, looking ahead some 10-30 years underlines how important\nit is that we in the U.S. aggressively pursue two parallel paths related to transportation\nenergy and greenhouse gas emissions. By we, I mean the relevant people in the\ngovernment, the auto and petroleum industries, the R&D community, and the broader car\nbuying and car using public.\n\nThe two paths are:\n\n1. Working effectively to improve current engine and drivetrain technologies, reduce\nvehicle weight and drag so we significantly reduce vehicle fuel consumption, and to\nprovide incentives to individual light-duty vehicle owners and users to buy such\nimproved technology vehicles and drive them less.\n\n2. Developing the framework and knowledge base for an eventual transition to\ntransportation energy sources, vehicle technologies, and energy consumption rates\nthat offset the expected declining availability and rising cost of petroleum-based\nfuels, and which on a well-to-wheels and cradle-to-grave basis have low greenhouse\ngas emissions. This future transportation energy carrier could be hydrogen, it could\ninclude electricity, and in part it could be biomass derived fuels.\n\nIt is very much in our national interest to pursue both these paths aggressively, and with a\nreal sense of urgency. The only feasible way to impact our steadily growing U.S.\npetroleum imports and consumption within the next twenty-five years is through reducing\nthe fuel consumption of our U.S. transportation fleet. There are many ways to improve\ncurrent vehicle technology to increase efficiency, but for most of these, the initial vehicle\ncost goes up by more than past experience indicates this consumer market will support.\nThere is a strong need, therefore, for the U.S. Government to provide incentives to all the\ninvolved stakeholders (including consumers), as soon as possible, to \"pull and push\" this\ntechnology into the marketplace and ensure it is used. I will discuss some of my MIT\ngroups' work on this shortly. However, even these actions will not result in much lower\npetroleum consumption and very low greenhouse gas emissions from the U.S. light-duty\nfleet. The importance of these actions is that given the size of our vehicle fleet (some 230\nmillion light-duty vehicle), this is the only way to get off the projected growth from\ntoday's light-duty vehicle fleets consumption of 140 billion gallons of gasoline a year (an\n\nenormous amount!) to some 1.6 times that (220 billion gallons per year) twenty-five\nyears from now. Whether petroleum resources are available to allow this growth is\nunclear. While it is likely that \"unconventional petroleum\" such as gasoline and diesel\nlike fuels made from tar sands, natural gas, and biomass, will increase their contribution,\nit will still be modest compared to this projected 25 year ahead total.\n\nThus the primary driver for this first path is to reduce the impact that higher petroleum\nprices, petroleum availability concerns and shortages, and rising negative balance of\npayment issues could have on our security, economy, and way of life.\n\nIn addition, however, success along this first path will have a significant enabling impact\non the second path. It is anticipated by many that by mid-century we will need (in the\nU.S. and elsewhere) to be on a transition path to much lower vehicle fleet greenhouse gas\nemissions. If the transportation energy demand in the U.S. at mid-century is as large as\nmany current projections now indicate, then that transition task due to its size,\ntechnological difficulty, and likely cost is unbelievably challenging. We are now starting\nto learn just how challenging that will be. If through improved efficiency and\nconservation we in the U.S. have cut that energy transition challenge in half, just think\nhow large a difference that will make.\n\nIt will not be easy to \"cut the challenge in half.\" Over the last 20-30 years, consumers\nhave bought larger and heavier vehicles, with higher performance, and have thus negated\nthe roughly 30 percent improvement in vehicle fuel efficiency that improvements in\nengine and transmission efficiencies, reduced drag, and materials substitution have\nrealized. A coordinated set of government actions will be needed to provide the push and\npull to realize in-use fuel consumption benefits from future improvements. My group has\nbeen analyzing such a coordinated regulatory and fiscal approach. Our assessment is that\nan integrated multi-strategy approach has the best chance of realizing our objectives,\nsince it shares the responsibility even handedly amongst the major stakeholders--\nindustry and consumers, and each strategy reinforces the others. Gains only will come if\nwe tackle all aspects of the problem simultaneously. Our proposal is to combine on\nimproved version of CAFE regulations to push more fuel-efficient technology into new\nvehicles with a reinforcing feebate system imposed at time of vehicle purchase\n(substantial fees for purchasers who buy high fuel-consuming vehicles and rebates for\nthose who buy low fuel consuming vehicles). Such a feebate system could be revenue\nneutral. To reinforce more fuel-efficient choices at vehicle purchase, taxes on\ntransportation fuels should be steadily increased year by year for the next few decades by\nsome 10c per gallon per year. These additional fuel taxes could be used to expand the\nnow depleted Highway Trust Fund revenues to renovate our deteriorating highway\nsystems and provide adequate maintenance. On the fuel side, in parallel, targets and a\nschedule could usefully be set for steadily increasing the amount of low greenhouse gas\nemitting biomass-based transportation fuels produced to augment our petroleum-based\nfuel supply. This would draw the petroleum and alternative fuel industries fully into our\nnational effort. Details of our proposal area given in the attached MIT Energy and\nEnvironment article, \"A Multipronged Approach to Curbing Gasoline Use\" June, 2004,\nand its Bandivadekar and Heywood reference. Such a multi-strategy approach could also\n\nprovide a transition period so major U.S. market suppliers with different model lineups,\nand health care and pension legacy costs, would have time to respond appropriately.\n\nNow let me say a few words about the second and longer-term path--working to\nimplement a low greenhouse gas emitting energy stream for transportation. It may be\nthat hydrogen will turn out to be the best of the low greenhouse gas emitting choices we\nhave identified to date. There are, however, other options that warrant substantial Federal\nand industry R&D. The time scales for radical changes in technology to be implemented\nand have impact are long, much longer than we realize. My group at MIT is working\nhard to understand these important time scales better. There are several sequential steps\nthat a new automotive technology must go through before that technology becomes a\nlarge enough fraction of the on-the-road vehicle fleet to make a difference. The first step\nis developing the new technology to the point where it is competitive in the marketplace\nwith standard technology vehicles. While more expensive new-technology more-\nefficient vehicles can be subsidized, this can only be done to push their introduction up to\nmodest levels. Once market competitive, the production volumes of the new technology\ncomponents must expand to a significant fraction of total new vehicle production. For\nengines, for example, this takes one to two decades. For fuel cell hybrid vehicles we\nestimate this to be 20-30 years. Then the new technology must penetrate the in-use\nvehicle fleet and be driven significant mileage, which takes almost as long as the\nproduction expansion step. Thus for internal combustion engine hybrids the total time to\nnoticeable impact is expected to be some 30-plus years. For hydrogen and fuel-cell\nhybrids it is likely to be more than 50 years. Hence my emphasis on the first path for\nnearer term improvements, and my judgment that any transition to hydrogen on a large\nscale is many decades away. (See MIT Energy & Environment article, \"New Vehicle\nTechnologies: How Soon Can They Make a Difference,\" March, 2005, attached).\n\nNow, some comments on a transition to hydrogen-fueled vehicles. First, the rationale for\nattempting such a transition is to significantly reduce greenhouse gas emissions from our\ntransportation systems in the longer-term. Thus the source of the energy used to produce\nhydrogen is critical. It would have to be either coal or natural gas with effective carbon\ncapture and sequestration, or nuclear power systems which generate both hydrogen and\nelectricity. Electrolysis of water with \"renewable electricity\" from solar or wind energy\ndoes not appear a plausible way to produce hydrogen; it makes much more sense to use\nrenewable electricity to displace coal in the electric power generating sector. Thus not\nonly are there major hydrogen fuel cell technology issues (including cost) to be resolved,\nthere are also major technical and cost challenges in the production, distribution and\nstorage of hydrogen to be resolved as well. Hydrogen produced directly from fossil fuels\nwithout carbon sequestration, or from the electric power grid via electrolysis, even when\nused in fuel cell powered vehicles (which could be significantly more efficient than\ninternal combustion engine powered vehicles), will not save energy nor reduce\ngreenhouse gases.\n\nAre there alternatives that warrant greater Federal resources? The above discussion\nsuggests that electric vehicles with advanced high-energy-density batteries recharged\nwith electricity from renewable or low CO2 electric power systems is one at least partial\n\nalternative. Such vehicles would be range limited, but if that range is more than say 200\nmiles these could be a substantial fraction of the market. Efficiently produced biofuels\ncan also be low net CO2 emitting and the extent these can contribute is not yet clear.\nNew, much lighter weight, vehicle concepts, may be significantly smaller in size, are also\nlikely to be a significant and necessary long-term option. All of these should be\nimportant parts of the U.S. Government's R&D transportation energy initiatives. While\nthey are part of the Government's current portfolio, the level of funding, strategic\nplanning, and industry and R&D community involvement should be increased.\n\nOur longer-term list of plausible efficient vehicle technologies and the energy sources\nthat go with them is too short, and the difficulties in realizing these options in the real\nworld are so challenging, that a much larger Federal effort on this second path I have\nbeen discussing is warranted.\n\nThe above discussion broadly to addresses the first two questions asked in the\nCommittee's letter requesting testimony. Let me now provide a more focused summary\nof my response.\n\nQuestion 1: How might the future regulatory environment, including possible\nincentives for advanced vehicles and regulations of safety and emissions, affect a\ntransition to hydrogen-fueled motor vehicles? How could the Federal government\nmost efficiently accelerate such a transition?\n\nI have explained how important it is for the U.S. Federal government through regulatory\nand fiscal policies to reduce the energy requirements of our total transportation system.\nNot only would this help reduce our petroleum consumption and thus our oil imports in\nthe nearer-term; it would also make the task of a future hydrogen transition (or more\ncomplex mix of low greenhouse gas emitting energy sources and technologies)\nsignificantly less challenging.\n\nQuestion 2: Is the current balance of funding between hydrogen-related research\nand research on advanced vehicle technologies that might be deployed in the interim\nbefore a possible transition to hydrogen appropriate? What advanced vehicle\nchoices should the federal government be funding between now and when the\ntransition to a hydrogen economy occurs? How are automakers using, or how do\nthey plan to use, the advanced vehicle technology developed for hydrogen-fueled\nvehicles to improve the performance of conventional vehicles? Are automakers\nlikely to improve fuel economy and introduce advanced vehicles without\ngovernment support?\n\nThe Government's FreedomCAR and Fuels program is a thoughtfully structured program\nof significant scale intended to advanced hydrogen fuel and vehicle technologies. It is a\npartnership between DOE, Ford, DaimlerChrysler, GM and several petroleum companies.\nIts focus is on applied research with some pre-competitive advanced development. The\nprogram plan has had, and continues to have, substantial industry input. DOE cost shares\nmajor advanced development projects with the auto companies. The companies involved\n\nhave substantial programs of their own in these areas, though the details of these\nprograms are largely proprietary. This program approach in my judgment does a\nreasonable job of using Federal funds to encourage the necessary development of new\nand better ideas, and new knowledge related to hydrogen and its use in transportation.\n\nThe FreedomCAR and Fuels Program also supports activities intended to improve the\nefficiency of mainstream engine and propulsion system technologies. Given the\nimportance of the first pathway I have described, this Federal effort should be expanded.\nAlso, efforts on advanced battery research and development, and biofuels should be\nexpanded to better meet their potential importance in the longer-term. The Federal\nGovernment must play the role of supporting a broad portfolio of research relevant to\ntransportation energy and transportations greenhouse gas emissions and involve all\nsectors of the R&D community that can contribute. Our universities, the source of the\ntechnical leadership we will need over the next several decades, must be more actively\ninvolved.\n\nQuestion 3: What role should the Federal government play in the standardization\nof local and international codes and standards that affect hydrogen-fueled vehicles,\nsuch as building, safety, interconnection, and fire codes?\n\nI have not addressed this question directly. Due to the long time scales involved in any\ntransition to hydrogen or other new technologies, this is not as urgent a task as is\ntechnology development. However, as is already happening in the FreedomCAR and\nFuels Program, work on these issues should be underway with the relevant Standards and\nCodes organizations, and with the industries involved.\n\nJohn B. Heywood\nDirector, Center for 21st Century Energy, and\nthe Sloan Automotive Laboratory, M.I.T."
    },
    {
      "category": "Lecture Notes",
      "title": "lec2_911_pr.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/d4d0a6388ffc9ae7193b8c3833efad77_lec2_911_pr.pdf",
      "content": "FOR IMMEDIATE RELEASE\nTHURSDAY, DECEMBER 20, 2001\nWWW.USDOJ.GOV\nAG\n(202) 514-2007\nTDD (202) 514-1888\nSEPTEMBER 11TH COMPENSATION FUND REGULATIONS ANNOUNCED\nWASHINGTON, D.C. - Today, less than one month after his appointment as Special Master\nfor the September 11 Victim's Compensation Fund, Kenneth R. Feinberg announced a set of\nInterim Final Regulations that will permit the program to start running immediately and begin\nproviding Advanced Benefits to those most in need. The September 11th Fund was created by\nCongress to provide victims with an alternative to the long and costly litigation process. Those\neligible to receive compensation from the Fund include representatives of victims who died at\nthe World Trade Center, the Pentagon and Shanksville, Pennsylvania.\n\"This Victims' Compensation Fund is an unprecedented expression of compassion on the part of\nthe American people to the victims and their families devastated by the horror and tragedy of\nSeptember 11th,\" said Feinberg. \"While there is no amount of compensation that can replace a\nhuman life, our goal is to aid those who have so greatly suffered as a result of this horrendous\nact. The Attorney General instructed me to cut all unnecessary red tape and deliver a program\nthat can help the victims as soon as possible. Such a program is precisely what we are\nannouncing today.\"\nThe program, as structured, will resolve every claim within a matter of months. Claimants may\nelect a procedure involving detailed submissions and a full hearing that will take approximately\n120 days, or may ask to have their claim calculated by an evaluator within 45 days from the date\nthey complete the claim forms. The Special Master can also provide Advance Benefits for\nvictims who need financial assistance during the time that the claims are pending - $50,000 for\nfamilies who lost loved ones, or $25,000 for seriously injured victims.\nThe final awards under the program will depend upon the individual circumstances of every\nclaimant, and will be calculated based upon an economic and non-economic component. The\nSpecial Master is today issuing charts and tables of estimated awards explaining generally how\nsuch awards will be calculated, and how claimants might estimate their likely awards. \"It is\nimportant to ensure that people have a sense of what they might receive from the program before\nthey decide to apply.\" Feinberg said.\nCongress required that the Special Master deduct \"collateral source compensation\" from the\naward, e.g. benefits from other government programs, insurance benefits, etc. However, the\nprogram will not deduct gifts from charities to the victims.\n\"We will also ensure that every family who lost a loved one receives, in total, at least a minimum\nlevel of compensation from all sources. For victims who were married or had children, that\nminimum will be $500,000 -- meaning that that they will receive a combined total of at least\n$500,000 from our program, other state and federal programs, life insurance and other\ncompensation (excluding gifts from charities). The minimum for deceased victims who were\nsingle will be $300,000. Many claimants will receive substantially more than these minimums.\"\n\nAny disputes over whether an individual should be named as a deceased victim's personal\nrepresentative shall be resolved according to state law.\nIn developing these Interim Final Regulations, the Department and Special Master reviewed\nmany hundreds of comments from interested parties, and consulted with economic experts. In\naddition, a number of meetings have been held with groups that represent the victims of the\nattacks, with elected officials and with other interested parties. Although the Special Master is\nsoliciting further comments from the public and may adjust the Interim Final Regulations as\nappropriate after analyzing such comments, claimants may now rely upon these regulations and\nmay begin the application process.\nThe Special Master will begin processing claims for Advanced Benefits tomorrow, Friday,\nDecember 21, and will have personnel available by telephone, and at locations in New York City\nat Pier 94, West 54th St. and 12th Ave., New York, New York 10019; and Metro Washington at\nthe Sheraton Crystal City, 1800 Jefferson David Highway, Arlington, VA 22202. Offices will\nopen at 1 p.m. on Friday. Claimants may also call 1-888-714-3385 (Toll-Free) or 202-305-1352\nand TDD: 1-888-560-0844.\nA copy of the Interim Regulations with explanatory material will be available at the Department\nof Justice website at http://www.usdoj.gov/archive/victimcompensation/. Also posted at that site are\nmaterials explaining how to estimate compensation under the Fund\n\nDepartment of Law\n120 Broadway\nNew York, NY 10271\nDepartment of Law\nThe State Capitol\nAlbany, NY 12224\n\nFor More Information:\n(518) 473-5525\nFor Immediate Release\nDecember 20, 2001\n\nSPITZER CRITICIZES DOJ REGULATIONS ON\nSEPTEMBER 11th VICTIM COMPENSATION FUND\n\nAttorney General Eliot Spitzer today criticized the proposed regulations governing the\nSeptember 11th Victim Compensation Fund, and called upon the Department of Justice\n(DOJ) to correct the many flaws in the regulations.\n\"Congress demonstrated its great generosity by creating the Victim Compensation Fund,\nthereby opening the door to monetary recovery for those injured in the September 11th\nattacks and the families of those killed,\" said the Attorney General. \"Unfortunately, the\nregulations issued by DOJ today are unduly restrictive and subvert the intent of Congress,\nwhich was to fully compensate all victims of the tragedy. The regulations are deficient in\nmany ways, and I therefore am calling upon DOJ to fix these problems before the\nregulations become final.\"\nAttorney General Spitzer identified numerous fundamental flaws in the DOJ regulations.\nMost significantly, the regulations:\n-\neliminate the right of injured victims to file claims if they continue to work\ndespite their severe pain and suffering;\n-\nrequire contemporaneous records demonstrating medical treatment within 24\nhours after the attack, even though:\n(1) there are no records for the hundreds of injured victims treated at emergency\ntriage locations on September 11th; and\n(2) many other victims first sought to reunite with their families, and did not seek\nmedical treatment for their injuries until September 12th;\n-\nprovide no protections for undocumented aliens whose spouses were killed or\nwho were themselves injured in the attacks;\n-\neffectively preclude recovery by unmarried life partners;\n-\nignore the statutory mandate that victims be able to present evidence of their\nlosses, and instead determine that all individuals killed in the attacks are\npresumed to have suffered exactly $250,000 in \"non-economic\" losses, regardless\nof individual circumstances, and permit increases in that amount only upon a\nshowing of \"extraordinary circumstances\";\n-\nreduce awards by the amount of collateral compensation that the claimant has\nreceived, even if the collateral compensation was unrelated to the damages for\nwhich recovery is sought;\n\n-\nstate that charitable donations will not be counted as \"collateral source\" payments\nresulting in reductions of awards, but at the same time authorize the Special\nMaster to determine that charitable payments are collateral sources, which will\ndeter charities from providing immediate payments to the victims; and\n-\nprovide that even unconscionably low damage awards are binding and\nunappealable.\n\"While the regulations appear to contemplate significant financial awards to the families\nof the deceased victims, there are numerous flaws in the regulations that close the door to\nmany others,\" said Attorney General Spitzer. \"Consider, for example, a secretary who\nworked in the World Trade Center, walked down 80 flights after the first plane hit, was\ncaught in the cloud of debris following the collapse, suffered severe respiratory distress\nand was carried by a firefighter to a triage location for medical treatment, went to see her\nown doctor the next day, and is now traumatized and unable to return to work. This is\nexactly the type of person that Congress intended to compensate, but she cannot file a\nclaim under the DOJ regulations.\"\n\"Since September 11th, Congress has passed laws placing caps on the liability of the\nairlines, aircraft manufacturers, airport operators and others, thereby severely limiting the\nability of the victims of the attacks to recover their damages in court. In return, the\nVictim Compensation Fund was supposed to provide full compensation to all victims of\nthe attack, and to provide a fast and efficient method for doing so. The regulations\npromulgated today by DOJ violate the language of the federal law, the intent of Congress\nand the will of the American people, by declaring many victims ineligible to recover\nfunds, and limiting the ability of all other victims to prove the full extent of their losses.\"\n\"These regulations are subject to a 30-day public comment period, after which DOJ will\nbe issuing the regulations in final form,\" the Attorney General added. \"It is essential that\nDOJ amend these regulations to address the many deficiencies noted above, and thereby\nensure full compensation for all of the victims of the September 11th terrorist attacks.\""
    },
    {
      "category": "Resource",
      "title": "stud_guidelines.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/cd97cb54fef3911bfff6434c9a2944ce_stud_guidelines.pdf",
      "content": "Student Guidelines for ESD.10 Recitation Groups\n\nBe prepared\nMake sure you have read everything that has been assigned and completed the written\nassignments. Be aware that the written deliverables are designed to help you prepare for\ndiscussion. Use them as notes to guide you in sharing ideas.\n\nArrive on time\nThe goal is to have a structured hour of discussion. Everyone likes to start on time and leave\nearly rather than start late and leave late.\n\nFoster good group dynamics\nThe role of the group facilitator - a second year student in TPP - is to create an atmosphere\nconducive to discussion. The facilitator will not dominate the conversation but allow the students\nto engage each other. As students, build off one another and discuss with each other. Maintain a\nwelcoming environment by responding respectfully to each person's ideas. Allow each person to\nhave a chance to talk, and encourage those who seem more hesitant to speak. If you are someone\nwho normally dominates conversation, make an extra effort to listen. If you are someone who\nnormally stays quiet, make sure to get your voice heard. Throughout the discussion, listen\nactively to whomever is sharing.\n\nLeave Distractions Outside\nThe discussion group time is meant for engaging conversation. There is no need to take notes.\nJust listen, think and share. Please refrain from bringing laptops or materials from other classes\nto the group. Feel free to bring a hot drink or snack. Allow yourself to be fully immersed in the\nconversation.\nSome material taken from University of Northern Iowa, Guidelines for Small Group Discussions, http://fp.uni.edu/reineke/guidelin.htm"
    },
    {
      "category": "Resource",
      "title": "assign1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/a5441c722b7b321c1a502b9ed24e360b_assign1.pdf",
      "content": "Discussion Group 1: September 11th Victim's Compensation Fund Case\nStudy\n\nObjective\n\nThe goal of this discussion is to apply the concepts of Policy Paradox to a real-world\ncontroversial policy in the US, evaluating the equity and efficiency of the policy decision.\nThe September 11th Victim's Compensation Fund will serve as the case study to explore\nStone's different concepts of membership, which is necessary before making decisions on\nthe allocation of resources.\n\nAssignment\n\nRe-read Chapters 2 and 3 of Policy Paradox that cover \"Equity\" and \"Efficiency.\" Also\nread the provided press releases \"September 11th Compensation Fund Regulations\nAnnounced\" and \"Spitzer Criticizers DOJ Regulations on September 11th Victim\nCompensation Fund,\" as well as sections I - III (pages 5 to 13) of the paper \"An\nUnprecedented Experiment in American Democracy.\" The purpose of these readings is to\nfamiliarize you with the procedure for allocating funds through the Victim's\nCompensation Fund. You should spend more time concentrating on how the funds were\nallocated and how that decision was made, rather than focus on specifics of the American\nlegal system. If you feel that you need more background information, there are several\nwebsites that might be helpful, including:\nhttp://www.voicesofsept11.org/victims_comp_fund.php\n\nBe prepared to discuss the current method of distributing victim compensation, as well as\nother methods of allocating funds that might have met the goals of equity and efficiency\ndifferently.\n\nDeliverables\n\nWrite one (1) paragraph (less than half a page) summarizing the September 11th Victim's\nCompensation Fund, specifically focusing on how funds were allocated to victims. Your\nresponse should be typed and will be due at the conclusion of your discussion session.\nThe responses will be graded on a pass-fail metric. While grammar and spelling error will\nnot count against you, please use complete and clear sentences to structure your thoughts\nand ideas.\n\nIn addition, bring a printed out copy of Homework #1, which was your list of alternative\ncompensation policies for the victims of September 11th defined by differing levels of\nmembership, a concept presented by Stone in Chapter 2."
    },
    {
      "category": "Resource",
      "title": "assign2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/21966f9d5b7d6f9689e57254098c109d_assign2.pdf",
      "content": "Discussion Group 2: Discussion of Stone through the News: Equity and\nEfficiency\n\nObjective\n\nThe purpose of this discussion group is to deepen your understanding of Stone's goals of\nEquity and Efficiency in Policy Paradox. This discussion will help you learn to apply\nStone's concepts to real-world policy decisions. Additionally, you will explore whether\ntradeoffs in achieving equity and efficiency goals do exist and how to manage such\ntradeoffs through policy decisions.\n\nAssignment\n\nRe-read chapters 2 and 3 of Policy Paradox that cover \"Equity\" and \"Efficiency.\" Also\nread the provided news articles \"Uganda AIDS Vaccine Test: Urgency Affects Ethics\nRules\" and \"In Drug Research, Some Guinea Pigs Are Now Human.\" Be prepared to\ndiscuss how Stone's concepts of equity and efficiency, as well as a tradeoff between the\ntwo goals, play out in these two news stories.\n\nDeliverable\n\nFor each news article, write 1-2 short paragraphs (less than 1⁄2 page) covering the\nfollowing questions:\n1. What are the issues of equity in the story?\n2. What are the issues of efficiency in the story?\n3. Is there a tradeoff between achieving both equity and efficiency?\n\nResponses should be typed and succinct. Be prepared to submit your responses to the\nsmall group facilitator at the end of your discussion session. The responses will be graded\non a pass-fail metric. While grammar and spelling error will not count against you, please\nuse complete and clear sentences to structure your thoughts and ideas."
    },
    {
      "category": "Lecture Notes",
      "title": "lec2_911_pr.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/c59a5ed99883bfbcf009642e3b0645e6_lec2_911_pr.pdf",
      "content": "FOR IMMEDIATE RELEASE\nTHURSDAY, DECEMBER 20, 2001\nWWW.USDOJ.GOV\nAG\n(202) 514-2007\nTDD (202) 514-1888\nSEPTEMBER 11TH COMPENSATION FUND REGULATIONS ANNOUNCED\nWASHINGTON, D.C. - Today, less than one month after his appointment as Special Master\nfor the September 11 Victim's Compensation Fund, Kenneth R. Feinberg announced a set of\nInterim Final Regulations that will permit the program to start running immediately and begin\nproviding Advanced Benefits to those most in need. The September 11th Fund was created by\nCongress to provide victims with an alternative to the long and costly litigation process. Those\neligible to receive compensation from the Fund include representatives of victims who died at\nthe World Trade Center, the Pentagon and Shanksville, Pennsylvania.\n\"This Victims' Compensation Fund is an unprecedented expression of compassion on the part of\nthe American people to the victims and their families devastated by the horror and tragedy of\nSeptember 11th,\" said Feinberg. \"While there is no amount of compensation that can replace a\nhuman life, our goal is to aid those who have so greatly suffered as a result of this horrendous\nact. The Attorney General instructed me to cut all unnecessary red tape and deliver a program\nthat can help the victims as soon as possible. Such a program is precisely what we are\nannouncing today.\"\nThe program, as structured, will resolve every claim within a matter of months. Claimants may\nelect a procedure involving detailed submissions and a full hearing that will take approximately\n120 days, or may ask to have their claim calculated by an evaluator within 45 days from the date\nthey complete the claim forms. The Special Master can also provide Advance Benefits for\nvictims who need financial assistance during the time that the claims are pending - $50,000 for\nfamilies who lost loved ones, or $25,000 for seriously injured victims.\nThe final awards under the program will depend upon the individual circumstances of every\nclaimant, and will be calculated based upon an economic and non-economic component. The\nSpecial Master is today issuing charts and tables of estimated awards explaining generally how\nsuch awards will be calculated, and how claimants might estimate their likely awards. \"It is\nimportant to ensure that people have a sense of what they might receive from the program before\nthey decide to apply.\" Feinberg said.\nCongress required that the Special Master deduct \"collateral source compensation\" from the\naward, e.g. benefits from other government programs, insurance benefits, etc. However, the\nprogram will not deduct gifts from charities to the victims.\n\"We will also ensure that every family who lost a loved one receives, in total, at least a minimum\nlevel of compensation from all sources. For victims who were married or had children, that\nminimum will be $500,000 -- meaning that that they will receive a combined total of at least\n$500,000 from our program, other state and federal programs, life insurance and other\ncompensation (excluding gifts from charities). The minimum for deceased victims who were\nsingle will be $300,000. Many claimants will receive substantially more than these minimums.\"\n\nAny disputes over whether an individual should be named as a deceased victim's personal\nrepresentative shall be resolved according to state law.\nIn developing these Interim Final Regulations, the Department and Special Master reviewed\nmany hundreds of comments from interested parties, and consulted with economic experts. In\naddition, a number of meetings have been held with groups that represent the victims of the\nattacks, with elected officials and with other interested parties. Although the Special Master is\nsoliciting further comments from the public and may adjust the Interim Final Regulations as\nappropriate after analyzing such comments, claimants may now rely upon these regulations and\nmay begin the application process.\nThe Special Master will begin processing claims for Advanced Benefits tomorrow, Friday,\nDecember 21, and will have personnel available by telephone, and at locations in New York City\nat Pier 94, West 54th St. and 12th Ave., New York, New York 10019; and Metro Washington at\nthe Sheraton Crystal City, 1800 Jefferson David Highway, Arlington, VA 22202. Offices will\nopen at 1 p.m. on Friday. Claimants may also call 1-888-714-3385 (Toll-Free) or 202-305-1352\nand TDD: 1-888-560-0844.\nA copy of the Interim Regulations with explanatory material will be available at the Department\nof Justice website at http://www.usdoj.gov/archive/victimcompensation/. Also posted at that site are\nmaterials explaining how to estimate compensation under the Fund\n\nDepartment of Law\n120 Broadway\nNew York, NY 10271\nDepartment of Law\nThe State Capitol\nAlbany, NY 12224\n\nFor More Information:\n(518) 473-5525\nFor Immediate Release\nDecember 20, 2001\n\nSPITZER CRITICIZES DOJ REGULATIONS ON\nSEPTEMBER 11th VICTIM COMPENSATION FUND\n\nAttorney General Eliot Spitzer today criticized the proposed regulations governing the\nSeptember 11th Victim Compensation Fund, and called upon the Department of Justice\n(DOJ) to correct the many flaws in the regulations.\n\"Congress demonstrated its great generosity by creating the Victim Compensation Fund,\nthereby opening the door to monetary recovery for those injured in the September 11th\nattacks and the families of those killed,\" said the Attorney General. \"Unfortunately, the\nregulations issued by DOJ today are unduly restrictive and subvert the intent of Congress,\nwhich was to fully compensate all victims of the tragedy. The regulations are deficient in\nmany ways, and I therefore am calling upon DOJ to fix these problems before the\nregulations become final.\"\nAttorney General Spitzer identified numerous fundamental flaws in the DOJ regulations.\nMost significantly, the regulations:\n-\neliminate the right of injured victims to file claims if they continue to work\ndespite their severe pain and suffering;\n-\nrequire contemporaneous records demonstrating medical treatment within 24\nhours after the attack, even though:\n(1) there are no records for the hundreds of injured victims treated at emergency\ntriage locations on September 11th; and\n(2) many other victims first sought to reunite with their families, and did not seek\nmedical treatment for their injuries until September 12th;\n-\nprovide no protections for undocumented aliens whose spouses were killed or\nwho were themselves injured in the attacks;\n-\neffectively preclude recovery by unmarried life partners;\n-\nignore the statutory mandate that victims be able to present evidence of their\nlosses, and instead determine that all individuals killed in the attacks are\npresumed to have suffered exactly $250,000 in \"non-economic\" losses, regardless\nof individual circumstances, and permit increases in that amount only upon a\nshowing of \"extraordinary circumstances\";\n-\nreduce awards by the amount of collateral compensation that the claimant has\nreceived, even if the collateral compensation was unrelated to the damages for\nwhich recovery is sought;\n\n-\nstate that charitable donations will not be counted as \"collateral source\" payments\nresulting in reductions of awards, but at the same time authorize the Special\nMaster to determine that charitable payments are collateral sources, which will\ndeter charities from providing immediate payments to the victims; and\n-\nprovide that even unconscionably low damage awards are binding and\nunappealable.\n\"While the regulations appear to contemplate significant financial awards to the families\nof the deceased victims, there are numerous flaws in the regulations that close the door to\nmany others,\" said Attorney General Spitzer. \"Consider, for example, a secretary who\nworked in the World Trade Center, walked down 80 flights after the first plane hit, was\ncaught in the cloud of debris following the collapse, suffered severe respiratory distress\nand was carried by a firefighter to a triage location for medical treatment, went to see her\nown doctor the next day, and is now traumatized and unable to return to work. This is\nexactly the type of person that Congress intended to compensate, but she cannot file a\nclaim under the DOJ regulations.\"\n\"Since September 11th, Congress has passed laws placing caps on the liability of the\nairlines, aircraft manufacturers, airport operators and others, thereby severely limiting the\nability of the victims of the attacks to recover their damages in court. In return, the\nVictim Compensation Fund was supposed to provide full compensation to all victims of\nthe attack, and to provide a fast and efficient method for doing so. The regulations\npromulgated today by DOJ violate the language of the federal law, the intent of Congress\nand the will of the American people, by declaring many victims ineligible to recover\nfunds, and limiting the ability of all other victims to prove the full extent of their losses.\"\n\"These regulations are subject to a 30-day public comment period, after which DOJ will\nbe issuing the regulations in final form,\" the Attorney General added. \"It is essential that\nDOJ amend these regulations to address the many deficiencies noted above, and thereby\nensure full compensation for all of the victims of the September 11th terrorist attacks.\""
    },
    {
      "category": "Resource",
      "title": "assign3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/33f3e18e7a459929d3e24b5696f19efb_assign3.pdf",
      "content": "Discussion Group 3: Discussion of Stone through the News: Security and\nLiberty\n\nObjective\n\nThe purpose of this discussion group is to deepen your understanding of Stone's goals of\nSecurity and Liberty in Policy Paradox. This discussion will help you learn to apply\nStone's concepts to real-world policy decisions. Additionally, you will explore whether\ntradeoffs in achieving security and liberty goals do exist and how to manage such\ntradeoffs through policy decisions.\n\nAssignment\n\nRe-read chapters 4 and 5 of Policy Paradox that cover \"Security\" and \"Liberty.\" Also\nread the provided news articles \"Airport Screeners could get X-rated X-ray views,\"\n\"High court to weigh security certificates: Civil liberties at core of three key challenges to\nanti-terrorism law,\" and \"Who does the net think you are?\" Be prepared to discuss how\nStone's concepts of security and liberty, as well as a tradeoff between the two goals, play\nout in these news stories. Also consider whether additional tradeoffs might exist between\nall four of Stone's policy goals: security, liberty, equity, and efficiency.\n\nDeliverable\n\nFor each news article, write 1-2 short paragraphs (less than 1⁄2 page) covering the\nfollowing questions:\n1. What are the issues of security in the story?\n2. What are the issues of liberty in the story?\n3. Is there a tradeoff between achieving both security and liberty?\n\nResponses should be typed and succinct. Be prepared to submit your responses to the\nsmall group facilitator at the end of your discussion session. The responses will be graded\non a pass-fail metric. While grammar and spelling error will not count against you, please\nuse complete and clear sentences to structure your thoughts and ideas."
    },
    {
      "category": "Resource",
      "title": "assign4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/0dfa08836fb1daf2f4bc23b54bb5300c_assign4.pdf",
      "content": "Discussion Group 4: Case Study- London Congestion Pricing\n\nObjective\n\nThis case study, provided by the Kennedy School of Government, details the decision by\nLondon Mayor Ken Livingstone to implement congestion pricing for the central part of\nLondon. It uses post-evaluation data to discuss whether an extension of congestion\npricing for the shopping/museum districts of London might also be successful. This case\nwill be used to highlight Stone's sections on \"Problems\" and \"Solutions.\" It provides an\ninternational real-world example of using numbers, stories, and causality to define a\nproblem, and then using a comparison of stakeholder interests and incentives to create a\nsolution.\n\nAssignment\n\nReview Chapters 6-15 of Policy Paradox that covers Stone's sections on \"Problems\" and\n\"Solutions.\" Also read the case study provided, \"Congestion Charging in London.\" Pay\nparticular attention to the initial decisions faced by Mayor Livingstone before congestion\npricing was started, as well as the analysis provided of that program's success. You do\nnot need to concentrate on the newer decision of whether or not to extend congestion\npricing into a new area. Be prepare to discuss how Stone's concepts were used by Mayor\nLivingstone and others in framing the problem of traffic in London and advocating for\ncongestion pricing as the solution. To initiate this thought process, identify the\nstakeholders in London congestion pricing and how they were included in either the\ndefinition of the problem or creation of the congestion pricing solution.\n\nDeliverable\n\nA number of questions relating congestion pricing to Stone's concepts will be discussed\nin the group discussion. Select 2 questions from the list below and write a 1-2 paragraph\nresponse for each question. Your response should be typed and no longer than one page.\nYou will submit your response to the small group facilitator at the end of your discussion\nsession. The responses will be graded on a pass-fail metric. While grammar and spelling\nerror will not count against you, please use complete and clear sentences to structure your\nthoughts and ideas. Although you only need to provide a written response to 2\nquestions, each person in the group should be prepared to discuss each of the\nquestions below.\n\n1. What are the causes of traffic in London? How does framing the cause lead to the\ndecision to implement congestion pricing?\n2. How are numbers used in the decision and analysis? Are they ambiguous?\n3. What are the interests at stake in London congestion pricing? How were these\ninterests accounted for in the decision to implement congestion pricing?\n\n4. What options were considered for alleviating traffic? How would you\ncategorizing these using Stone's definition of inducements?"
    },
    {
      "category": "Resource",
      "title": "assign5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/3a44f9fc5e7ddeae050f683a71458a8f_assign5.pdf",
      "content": "Discussion 5: Case Study- KIDSNET\n\nObjective\n\nThis case study, provided by the Kennedy School of Government, explains a state-wide\npolicy to implement an electronic medical records system to improve healthcare for the\nstate's children. At the heart of all issues over implementation of medical records, there is\na privacy concern for patient confidentiality. This issue can be discussed in terms of a\nsecurity-liberty-efficiency tradeoff using Stone's framework. Also interesting in this case\nis the number of other questions it raises about technology policy, including funding\ntechnology, equal access to technology, creating incentives to encourage use of the\ntechnology, and eliminating unnecessary waste in the form of inefficiencies. Therefore,\nthis case will be used to continue a discussion of Stone's concepts from Policy Paradox,\nbut will also expand that discussion to one about challenges that arise when\nimplementing technology policy.\n\nAssignment\n\nRead the case provided, \"The KIDSNET Story...\". Pay particular attention to the\nchallenges facing the KIDSNET system and the stakeholders involved. Be prepared to\ndiscuss the case, with emphasis on the cause of the challenges facing KIDSNET and\npotential solutions.\n\nDeliverable\n\nPrepare a 2-3 paragraph write-up to how you would address the challenges facing\nKIDSNET. Questions you may want to consider are as follows:\n- Dose the system adequately addresses the goals of equity, efficiency, liberty, and\nsecurity?\n- Why is KIDSNEY unsuccessful? What would make it more successful?\n- Would the system be different if participation was mandatory instead of\nvoluntary?\n- How would you address the problem of differing levels of access to the\ntechnology?\n- How can the government encourage diffusion of new technology?\n- Would the failing KIDSNET program best be fixed with new technology or new\npolicy?\n\nYour response should be typed and no longer than one page. It will be due at the\nconclusion of your discussion session. The responses will be graded on a pass-fail metric.\nWhile grammar and spelling error will not count against you, please use complete and\nclear sentences to structure your thoughts and ideas."
    },
    {
      "category": "Resource",
      "title": "assign6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/esd-10-introduction-to-technology-and-policy-fall-2006/8bb699b0431ef25ad03c5b7ff52540db_assign6.pdf",
      "content": "Discussion 6: Understanding Systems Thinking\n\nObjective\n\nThe purpose of this discussion is to ensure that each student has a good understand of what\nconstitutes a \"complex engineering system\" and what qualifies as \"systems thinking.\" These\nconcepts are useful policy tools as they also introduce a new way of thinking about complex\nproblems and suggest methodologies to evaluate systems. Understanding of \"systems thinking\"\nis especially important to TPP students, as part of the Engineering Systems Division. You will\nfind that this understanding of the concepts of systems thinking will be useful in constructing\nyour thesis, conversations with policymakers, and in explaining \"ESD\" on job interviews.\n\nAssignment\n\nRead the three Engineering Framing Papers posted on MIT Server, written by Dan Roos\n(\"Engineering Systems at MIT - The Development of The Engineering Systems Division\"),\nDaniel Hastings (\"The Future of Engineering Systems: Development of Engineering Leaders\"),\nand Joel Moses (\"Foundational Issues in Engineering Systems\"). Using the ideas in these papers,\nas well as material learned in ESD.10 classroom lecture, frame your own definition of what\nconstitutes an \"engineering system\" and \"systems thinking.\" Be prepared to share your ideas in\ndiscussion group through a group brainstorming session.\n\nDeliverable\n\nWrite a one-paragraph (4 to 5 sentences) definition of \"complex engineering system.\" Similarly,\nwrite a one-paragraph definition of \"systems thinking.\" There is no \"right\" answer for this\nassignment. You can use ideas in the ESD framing papers, ideas from your other TPP classes, or\nideas generated from you own personal or professional experiences. It might be helpful to\nprovide an example of a current complex engineering system or an example of a system that you\ndo not think qualifies as a complex engineering system. It also might be helpful to consider if\nadvanced technology itself constitutes a complex engineering system, or if framing the\ntechnology and system qualifies a systems as complex.\n\nYour responses should be types and be no longer than one page total. They will be due at the\nconclusion of your discussion session. The responses will be graded on a pass-fail metric. While\ngrammar and spelling errors will not count against you, please use complete sentences to\nstructure your definitions."
    }
  ]
}