{
  "course_name": "Introduction to Ocean Science and Engineering",
  "course_description": "This course is an introduction to the fundamental aspects of science and engineering necessary for exploring, observing, and utilizing the oceans. Hands-on projects focus on instrumentation in the marine environment and the design of ocean observatories for ocean monitoring and exploration. Topics include acoustics, sound speed and refraction, sounds generated by ships and marine animals, sonar systems and their principles of operation, hydrostatic behavior of floating and submerged bodies geared towards ocean vehicle design, stability of ocean vessels, and the application of instrumentation and electronics in the marine environment. Students work with sensor systems and deploy them in the field to gather and analyze real world data.",
  "topics": [
    "Engineering",
    "Ocean Engineering",
    "Ocean Exploration",
    "Science",
    "Earth Science",
    "Oceanography",
    "Engineering",
    "Ocean Engineering",
    "Ocean Exploration",
    "Science",
    "Earth Science",
    "Oceanography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nLabs: 1 session / week, 2 hours / session\n\nCourse Description\n\nThis course is an introduction to the fundamental aspects of science and engineering necessary for exploring, observing, and utilizing the oceans. Hands-on projects focus on instrumentation in the marine environment and the design of ocean observatories for ocean monitoring and exploration. Topics include acoustics, sound speed and refraction, sounds generated by ships and marine animals, sonar systems and their principles of operation, hydrostatic behavior of floating and submerged bodies geared towards ocean vehicle design, stability of ocean vessels, and the application of instrumentation and electronics in the marine environment. Students work with sensor systems and deploy them in the field to gather and analyze real world data.\n\nThe goal of this course is to give each student an introduction to fundamental ocean science, hydrodynamics, acoustics and ocean instrumentation and measurement. This introduction will serve as a spring board for future ocean related coursework and should help students sufficient background to \"place\" the importance of their future classes in the context of ocean science and engineering and current research trends.\n\nPedagogy\n\nThis conference paper describes several teaching innovations embodied in this course:\n\nTechet, A. H., T. T. Truscott, and M. K. Thompson. \"\nIntegration of hands-on laboratory modules to enhance the introduction of ocean science and engineering to undergraduates\n.\"\nProceedings of IEEE/MTS Oceans/Boston 2006 Conference\n, September 2006.\n\nPrerequisites\n\nMIT courses 8.01 and 18.02.\n\nHomework\n\nHomework assignments will be distributed weekly. A portion of the assignment will cover material not yet addressed in lecture and will require some independent study (e.g. reading the suggested text). The remainder of the assignment will re-cover and re-emphasize the material covered in lectures. Homework should be a result of individual effort. Homework will be due one week from their date of assignment.\n\nLaboratories\n\nLab safety and rules must be followed at all times. Lab assignments will include self-directed projects and instructor directed assignments. Laboratory grades will be based on written and oral reports as well as in-class participation and effort. The laboratory staff will be available for help with the assignments where necessary. If you don't know how to use a piece of equipment,\nask\nthe instructor before using it! Report all emergencies and accidents to the instructor and laboratory head within 12 hours of their occurrence.\n\nExams\n\nThere will be two exams during the term. The first exam will be in class, and the second exam will be a take-home exam due one week after its distribution.\n\nGrading\n\nActivities\n\nPercentages\n\nLaboratories/Projects\n\n40%\n\nHomeworks\n\n20%\n\nExams\n\n40%\n\nTextbooks\n\nThe required text for the course is freely available online.\n\nStewart, Robert.\nIntroduction to Physical Oceanography\n. August 2005 version.\n\nAdditional reference and supplemental books are listed in the\nreadings\nsection.",
  "files": [
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/15903fdc674c30cd6298eb4f58a2bb72_hw1.pdf",
      "content": "2.011 Spring 2006\nHomework #1\nResearch ONE underwater vehicle from the list provided. Choose from this list of\nvehicles. Only one student per vehicle.\nPrepare 5 minutes (2-3 Powerpoint slides maximum) about its main mission, any special\ndesign considerations (pros/cons), history, and any suggestions for making it a better\nvehicle. You will present your slides to the class in the first lab session.\n-\nJason II (WHOI)\n-\nAlvin I (WHOI)\n-\nABE (WHOI)\n-\nRemus (WHOI)\n-\nOdessey II b/c/ or d (MIT SeaGrant)\n-\nVentana (MBARI)\n-\nTiburon (MBARI)\n-\nMillenium ROV (Oceaneering)\n-\nHydra Magnum (Oceaneering)\n-\nBluefin-21 BPAUV ((Bluefin Robotics)\n-\nBluefin Glider - SPRAY (Bluefin Robotics/Scripps/WHOI)\n-\nSlocum Glider (Webb Research Corp.)\n-\nTheseus AUV (International Submarine Engineering Ltd. (ISE))\n-\nDorado AUV International Submarine Engineering Ltd. (ISE)\nWebsites:\n-\nWHOI\n-\nMBARI\n-\nWebb Research Corp.\n-\nOCEANEERING\n-\nInternational Submarine Engineering Ltd. (ISE)\n-\nMIT SeaGrant\n-\nBluefin Robotics"
    },
    {
      "category": "Resource",
      "title": "hw2_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/2f5f343e7e909861a07945a9b5f4f018_hw2_soln.pdf",
      "content": "2.011\n3/13/06\nHW# 2 Solution Set\nProblem 1: (10 points)\na. (3 points) Three points for something feasible (actually anything will do here). 1\npoint for something useful or convincing.\nb. (4 points) One point for description, two for spatial and temporal scales, and one\nfor expected results.\nc. (3 points) Three points for cost.\nProblem 2: (10 points)\na. (2 points) The deepest part of the ocean is The Marianas Trench between 10,911\nm (Kaiko March 24th, 1995), which is the most accurate reading. Other reports are\ndeeper by as much as 11,040.04. As a comparison Mt. Everest is 8444.43 m high.\nLocated at approximately 11o 19'N latitude and 142 15'E longitude, in the Pacific\nOcean.\nb. (2 points) 1o latitude = 111 km. 1o longitude = 111 cosine (latitude) km. Pg 21\nST.\nc. (3 points) The speed of sound in water is a function of temperature, depth, and\nsalinity. Pg 35 ST.\nd. (3 points) From Pg 35 ST. If the speed of sound is plotted as a function of depth\nthere is usually a minimum around 1000m. The depth of minimum sound speed\nis the sound channel. A sound channel can carry sound up to 10,000 km away.\nIt occurs in all oceans, and it usually reaches the surface at higher latitudes. In the\nsound channel sound can travel very far, sometimes half way around the earth.\nSound rays that begin to travel outside the channel are directed back to the sound\nchannel. I like to think of it as a large fiber optic cable for sound.\nProblem 3: (10 points)\na. (2 points) The Pacific (according to Google Earth) along the equator lies at 80o 6'\n34 W and 103o 48' 46 E, which is 19565 km or 12157.6 miles (~183o 54'). This\nis an assumption that the earth is generally spherical and uses google earth.\nb. (2 points) Google Earth.\nc. (2 points) The accuracy is down to the sub second according to google. I trust it to\nthe second, which is much better than the degree accuracy we are looking for. Of\ncourse the South American landing of the reading is very close to a river delta and\ncould be growing or shrinking by some amount each year!\nd. (2 points) I have a good feeling that this is within 1o of accuracy, because I was\nable to get sub second resolution using google earth. I gave everyone points for\nbeing close.\ne. (2 points) They go north because that happens to be the shortest route. If you\ncould place a string on the earth from one point to another and pull it taught you\nwould see that the shortest distance to Tokyo from LA is to head north for a while\nand then turn south.\n\n2.011\n3/13/06\nProblem 4: (10 points)\na. (2 points) The sky is blue because the atmosphere scatters shorter frequency\nwavelengths (ie blue, violet), but lets wavelengths that are longer (reds, oranges,\nyellows) through with little or no scattering. (Wikipedia)\nb. (2 points) The sky near the horizon is much thicker than above. Therefore, in the\ndaytime the light near the horizon tends to be paler than above. In the evening as\nthe sunsets the sunlight appears even redder because the remaining wavelengths\n(longer) are filtered even further, thus filtering almost all the blues and greens\nleaving a very orange or red Sun. The scattering effect is known as Rayleigh law.\n(Wikipedia)\nc. (2 points) C=λ*f (wave speed = wavelength * frequency)\nd. (2 points) Blue light = 430-500 nm, Green light = 520-565 nm, Red light = 625\n740 nm.\ne. (2 points) Blue light (~430nm) propagates furthest in water because it is the least\nabsorbed.\nProblem 5: (10 points)\na. (5 points) The direction of the winds is from the high-pressure zone to the low-\npressure zones. The 30oN and 30o S high-pressure regions blow towards the\nequator. The equatorial region tends to blow towards the west because of the\nconverging winds from the north and south. Pg. 41 ST.\nb. (5 points) The highest evaporation occurs around the 30oN and 30oS latitudes.\nThe equatorial region has heavy precipitation. Pg. 41 ST.\nProblem 6: (10 points)\na. (4 points) In general, the warmest surface temperatures are found at the equator\n~30o C. The heat gradually dissipates to ~23oC near the 30oN and 30oS longitude\nlines. Near the poles have the coldest surface temperatures -1oC. The moderate\ntemperatures (23oC - 10oC) occur between 30oN and ~55oN in the north and 30oS\nto 55oS. The rest of the water is cold toward the poles and varies from 10oC to -\n1oC. There are irregularities to this trend. In the Pacific along the equator near\nEquador has colder water below 23oC and extends from the coast ~10o longitude.\nThe Pacific coast of South America and the Atlantic coast of Africa are 10o\ncolder than the rest of the ocean at that latitude. There is also a 10o cooler region\nalong the pacific coast of America and Atlantic coast Europe. Together these\nregions narrow the warm surface temperatures region found at the higher\nlatitudes. The western Pacific is warmer on average than the eastern portion. The\nIndian ocean is dominated by 30oC temperatures.\nb. (4 points) The main cause of the ocean surface temperature is the sun. The sun\nheats the water through isolation. The ocean releases heat in the form of\nradiation. The average temperature of the sea relates to the intensity of the\nsunlight at that region. The sun reaches the earth most directly at the equator with\ndecreasing angles of incidence at the increasing latitudes. In general, this\nassumption is valid. The irregularities are due to wind driven currents and\nseparately from deep waters coming to the surface. For instance, along the\nequator the winds are typically westerly. This causes the warm waters along the\nWestern coast of the Americas to move eastward. To replace the movement of\n\n2.011\n3/13/06\nthose warm waters the cooler waters from higher latitudes move into those\nregions. They are of course heated but the cooler regions causes the narrowing of\nthe warm band along both the western coast of the Americas and the western\ncoast of Africa and Europe. The strange cold surface temperature off the coast of\nEquador may be explained as some upwelling of a cooler water from the deeper\nsea.\nc. (4 points) The simplest model is to say that the water temperature is linear decline\nof 30oC at 0o latitude to 24oC at 30oN and 30oS. Then taking another linear fit\nfrom 24oC at 30oN and 30oS to -1o at 90oN and 90oS. This is a very crude model\nbut in general works against the data. In general the sun affects the surface\ntemperature directly, which can vary if winds and currents are strong enough or\npersistent enough throughout the year. If you proposed a model that seemed\nreasonable I gave you full points. If you actually came up with an equation you\nget kudos.\nProblem 7: (10 points)\nFull points for mentioning your interests in this course."
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/f06398b6ec94056c7213899d7bc23121_hw2.pdf",
      "content": "2.011 Homework #2\nOut: 14 February 2006 (Tues)\nDue: 28 February 2006 (Tues)\nProblem 1: Isolate a phenomena of interest to you, either in the ocean or atmoshpere.\na. Design a feasible observational strategy you think would be useful to study such\nphenomena (and indicate why your strategy is good).\nb. Describe what type of instrumentation you need, what spatial and temporal scales\nyou are looking at, and what type of results you expect.\nc. Try to find out or Guess how much it would cost!\nProblem 2: Ocean Properties\na. The deepest part of the ocean is the ____________________ m deep. It is located\nat _______________° Longitude and _____________° Latitude (approximately)\nin the ______________ Ocean.\nb. One degree latitude is equal to _____________ km. Longitude is related to\nlatitude by the following relation: 1° Longitude = ______________ km.\nc. Speed of sound in water is a function of the following properties: (circle all that\napply) [Temperature] [Chlorophyll] [Light penetration depth] [Depth] [Salinity]\n[Oxygen].\nd. Explain the concept of a Sound Channel in the ocean, where it occurs and what its\nsignificance is.\nProblem 3: Later in the course, we will study the El Nino in the Pacific Ocean. It helps\nif we have a good idea of the size of the equatorial Pacific.\na. What is the width of the Pacific (in degrees of longitude) along the equator?\nb. Where did you get your information?\nc. How accurate is your information?\nd. How do you know the information is accurate? I am looking for an answer with\nan accuracy of about one degree (111 km).\ne. Airplanes flying nonstop from Los Angeles to Tokyo go almost north from Los\nAngeles. Assuming there are no air-traffic control reasons, why do they go north?\n\nProblem 4: Light and Light Propagation in the Ocean\na. Why is the sky blue?\nb. Why does the sky look a different color near the horizon at sunset or\nsunrise?\nc. Light and Sound propagate in waves. What is the relationship between the\nwave speed (meters/second), the wave length (meters), the wave\nfrequency (Hz = 1/second)?\nd. What are the wavelengths of blue, green and red light?\ne. Which wavelength of light from the sun propagates the furthest in water?\nProblem 5: Wind\nThe flow of surface winds affects evaporation and moisture in the air. On the figure\nbelow, draw\na) the direction of air flow (winds),\nb) locations with highest evaporation from the sea surface, and zone(s) of\nmaximum precipitation.\nCourtesy of William Prothero. Used with permission.\nFrom \"Question of the Day\" resourceEarth Education Online, http://earthednet.org/\n\nProblem 6: Describe and interpret the global average sea surface temperature (SST).\nCourtesy of William Prothero. Used with permission.\nFrom \"Question of the Day\" resource Earth Education Online, http://earthednet.org/\nThe data to describe: The image with data below is from Global Ocean Data Viewer. It\nrepresents the ocean temperature averaged over many years. This means that the variations\nthat naturally occur during the year and during different years are not represented in this one\nplot. This kind of plot is very useful when the purpose of the investigation is to determine the\nlong-term patterns that persist for many decades, without being confused by shorter-term\nvariations.\nThe task: Your job is to write a short scientific discussion of the data shown in the figure\nabove and to develop a model explaining this data.\nAverage Annual Sea Surface Temperature\na. Describe: Describe the data found in the image above. Be brief, but don't miss\nimportant features. Look at the most obvious temperature variations. Possible\nreferences, for descriptive purposes, are the geographic position such as latitude,\nlongitude, size of the body of water, or distance from a continent. Look for smaller\nvariations in the major pattern. When you write down your observations, use data\nvalues and locations to illustrate your statements. Be as quantitative as possible.\n(continued...)\n\nb. Interpret: Look for patterns and relationships that explain the overall distribution of the\nocean temperatures and write a short paragraph. Also, explain any variations from the\noverall pattern. Use simple drawings to support your explanation(s). Draw and/or write\non the figure if it will clarify your explanation. You should begin your description by\nmentioning the main phenomena that affect the temperature of the ocean's surface.\nNote: an interpretation requires a theory or model\nc. Model: Develop a model to explain the most dominant pattern of sea surface\ntemperature (SST). A helpful hint is to consider factors that contribute to heat\ninput. Diagrams and sketches can be very useful. Describe how the data fits the\nmodel. Also, discuss any data that do not correspond to the model (i.e. it does not\nsupport the model). You may also want to suggest other data that could help with\ndeveloping your model.\nProblem 7: Briefly indicate what you are most interested in learning about in this course."
    },
    {
      "category": "Resource",
      "title": "hw3_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/1949d1cbd98ae66ad257d529ca8e6d24_hw3_soln.pdf",
      "content": "2.011\n3/16/06\nHW# 3 Solution Set\nProblem 1: (5 points)\nHeat can be transported to deeper layers in the ocean by diffusion (1), density\ngradients(1), turbulence (wind and waves)(1), and currents(1). Pg. 82 Stewart. I\ngave 1 more point if you discussed one of the physical mechanisms in more\ndetail.\nProblem 2: (8 points)\na. (4 points) In fresh water the densest water is 4oC so water that is colder than 4oC\ncan be found above the bottom 4oC layer. This is not the case in seawater. In sea\nwater above 25 o/oo the maximum density occurs below the freezing point,\nmeaning that warmer water always overlies cooler water in a gravitationally\nstable situation, the salinity makes them different.\nb. (4 points) Since the freshwater at 4o is the densest it makes sense that all other\nwater would be above this temperature if left to rest. So if a lake has water that is\n4oC or less in it then the bottom temperature will be 4oC.\nProblem 3: (2 points)\nS=35o/00\nProblem 4: (10 points)\na. (2 points) Air will have a higher potential because the pressure at the surface is\ngreater than at 5 km which means it would heat up, and water will have a lower\npotential because it would expand coming to the surface thus decreasing its\ntemperature.\nb. (2 points) (i) 27.6 (ii) 26.4.\nc.\ni. (1 points) Density and sigma are related by ρ=σt+1000. Specific gravity is\nthe density of the water divided by the density of water at atmospheric\npressure Sg=ρ/1000 or Sg=1+σt/1000. So (i) becomes 1.0276 and (ii)\n1.0264.\nii. (1 points) The density at atmospheric pressure is thus ρ=σt+1000 [kg/m3].\nEssentially the numbers from the figure are the last two digits in the\ndensity for the water at that temperature and salinity. Therefore (i) is\n1027.6 kg/m3 and (ii) 1026.4 kg/m3.\nd. (2 points) Temperature has a greater effect on density in the ocean. From the\nfigure one can see that the slope of the line is fairly shallow. This means that\nalong lines of constant temperature the salinity can change greatly with little\nchange in density. However, for constant salinity if one changes the temperature\nthe density can change much more greatly. For example, if on varies the\ntemperature 10o one can get a change of nearly 8 kg/m3 however along constant\ntemperature a change of salinity by 1.5 o/oo only effects the density by 1.5 kg/m3.\n\n2.011\n3/16/06\nSurely a greater change in salinity may show a greater change in density, however\nsalinity in the ocean varies by as little as 2o/oo and so according to this figure\ntemperature has a greater effect on density than salinity.\nProblem 5: (10 points)\na. (2 points) The surface waters are much warmer than the deep ocean for latitudes\nfrom 50oS to 50o N. Beyond that the temperature gradient is fairly small. For\nlatitudes from 50oS to 20oN the water is saltiest near the surface then decreases to\n~1000 m then slightly increases until the bottom. Above the 60o latitudes the\nwater salinity is nearly constant with respect to depth. The area between 20oN\nand 60 oN is saltier at the surface but has a small change from surface to bottom.\nIn general there is a steep gradient near the surface for both salinity and\ntemperature, then the gradient becomes much more gradual after ~1000m.\nb. (2 points) A corresponds to profile 1 and B to profile 2.\nc. (2 points) A corresponds to profile 1 and B to profile 2.\nd. (2 points) The haloclines and thermoclines seem to be similar in shape and depth\nexcept for the salinity minimums. These occur around 700 m in general whereas\nthe minimum temperature is always below 3000 - 4000 m.\ne. (2 points) B shows greater decrease in salinity with depth.\nProblem 6: (4 points)\na. (2 points) (i) matches with a, (ii) matches with\nb. (2 points) Figure (a) shows an increase in temperature below 4000m thus this\nmust be in situ temperature (description i), whereas figure (b) must correspond\nwith description (ii) b/c it shows cooler water near the bottom, and is thus the\npotential temperature part (corrected for adiabatic compression). The potential\ntemperature profiles and cross sections are more realistic b/c of these\ncorrections so description (ii) is correct.\nProblem 7: (8 points)\na. (2 points) Light propagates in ocean at 2.25E8 m/s2 and sound at 1.5E3\nm/s2, which means light travels 150,000 times faster than sound in water.\nb. (2 points) The difference in refractive indexes between air and water cause\nsome of the rays of the sun to be reflected from the surface of the water.\nWhenever two interfaces meet and light passes between them, they will\nalways reflect light if they do not have the same refractive index (albedo).\nFor the ocean 2% of the light is reflected from a light sourse directly\nabove the surface.\nc. (2 points) Light attenuation is very high in the ocean. This means that the\nlight is absorbed rapidly and that it doesn't reach very deep before the\nocean appears without light. Because the particles in the water absorb the\nenergy so well the water near the surface is much higher temperature than\ndeeper down. Light attenuates to a depth of about 200 m.\nhttp://oceanexplorer.noaa.gov/explorations/04deepscope/background/deep\nlight/deeplight.html\n\n2.011\n3/16/06\nd. (2 points) Light is attenuated by particles in the water. Many waters\nappear blue, which can mean unproductive water or water that does not\nproduce a lot of microscopic life. Phytoplankton and algae absorb\ndifferent wavelengths of light and often change the color of the water from\nabove due to this absorption. When this happens it can often mean the\nwaters are more productive or full of microorganisms and appear blue\ngreen. It is also common to see brown waters near river inlets and deltas.\nThis is due to the absorption from the sediment in the water."
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/570cd76f0253d00a3e893b66b64afb6b_hw3.pdf",
      "content": "2.011 HW #3\nSpring 2006\nDue Thursday 3/9/06\nProblem 1: If the thermal energy from solar radiation is largely absorbed by the surface\nlayers how can it be carried deeper? Discuss possible physical mechanisms for heat\ntransport in the ocean.\nProblem 2: Seawater versus freshwater\na) Explain why colder water can overlie water at 4° C in a freshwater lake in a\ngravitationally stable situation. Could such a situation develop in the ocean?\nb) Explain why the temperature profiles in a freshwater lake will not show temperatures\ndecreasing with depth to values less than 4° C.\nProblem 3: Practical Salinity is related to the conductivity ratio K15 (ratio of conductivity\nof a seawater sample to conductivity of standard seawater [K Cl] solution @15°C and\n1atm) and determined by the following equation\n3/2\nS= 0.0080 - 0.1692 K15\n1/ 2 + 25.3851K15 +14.0941K15\n5/2\n- 7.0261K15\n2 + 2.7081K15\nWhen K15 = 1 what is S?\nProblem 4: Potential Temperature and sigma-t\na) Explain whether you expect the potential temperature of (i) air at a height of 5km and\n(ii) seawater at a depth of 5km to be greater or less than their in situ temperatures.\nb) Using the figure below, what are the values of sigma-t ( σ ) at (i) T = 2°C and\nt\nS=34.5 0 00\n0 00 ?\nand (ii) T = 15°C and S=35.6\nc) What do those values of sigma-t ( σ ) mean in terms of (i) the specific gravity of the\nt\nwater at atmospheric pressure and (ii) the density at atmospheric pressure?\nd) By looking at the figure, keeping in mind the range of T and S usually found in the\noceans, do you think that temperature or salinity would have a greater effect on seawater\ndensity?\n\n24.5\n25.5\n26.5\n27.5\nLines\nof constant\nσt\n28.5\nTemperature (oC)\n33.5\n34.5\n35.5\n36.5\nSalinity\nFigure by MIT OCW.\n\nProblem 5: The figures below are vertical sections showing the mean distribution of\ntemperature and salinity in the western Atlantic Ocean. Contour lines show the ocean\ntemperature in degrees Celsius in the top figure and salinity in parts per thousand in the\nlower figure.\na) Discuss how the range of temperature and salinity varies with depth. How do the\nsurface waters compare to the deeper waters.\nNote that for the temperature contour plot, the dashed isotherms step in\n1° C intervals, whereas the solid contour lines step in 5° C intervals,\nand for the salinity contours, the dashed haloclines vary in 0.1 and 0.2\nintervals.\n00 and the solid haloclines vary in 0.5 0 00\nb) Two vertical temperature profiles are taken at stations A and B. Determine which\nprofile plotted below the contour map corresponds to profile A and B.\nc) Which salinity-depth profile corresponds with the vertical lines (A, B) in the contour\nplot of salinity?\nd) How do the depth ranges of the haloclines compare with those of the thermoclines\nshown in the figure above?\ne) Which of the two halocline plots shows the greater rate of decrease of salinity with\ndepth?\n[FIGURES ON NEXT PAGE]\n\nFigures removed for copyright reasons.\n\nProblem 6: Using the following table and plots:\na) Match each plot with one of the following descriptions:\ni. Cool water flows over the sill (Marianas ridge), descending slightly across the\nMindanao Trench but remaining in the middle depths to leave the warmer\nbottom water undisturbed.\nii. Cool water passes over the sill and flows down the slope of to the bottom of\nthe trench.\nb) Assuming that salinity is not exerting any significant control over density, which of\nthe two situations, (i) or (ii), described above in (a) is likely to exist in reality?\nDepth\n(m)\nSalinity\nTemperature\nDensity\nIn situ\n(oC)\nPotential\n(oC)\nst\nPotential\n(sq)\n34.58\n3.20\n3.09\n27.55\n27.56\n34.64\n1.82\n1.65\n27.72\n27.73\n34.67\n1.59\n1.31\n27.76\n27.78\n34.67\n1.65\n1.25\n27.76\n27.78\n34.67\n1.93\n1.25\n27.74\n27.79\n34.69\n2.23\n1.22\n27.72\n27.79\n34.67\n2.48\n1.16\n27.69\n27.79\nComparison of in situ and potential temperatures in the Mindanao\nTrench off the Philippine Islands.\nFigure by MIT OCW.\n\nMarianas\nridge\n1.1\nMindanao\ntrench\nDepth (m)\n1.8\n1.7\n1.7\n.\n1.\nMarianas\nridge\nMindanao\ntrench\n1.7\n.5\n.\n1.2\na\nb\nFigure by MIT OCW.\n\nProblem 7: Light propagation in the ocean\na) At what velocity does light propagate in the ocean? Compare this to the speed of\nsound in the ocean.\nb) Describe briefly why some light is reflected at the ocean surface. How much is this on\naverage (% of light reflected)?\nc) Is there a correlation between light attenuation and ocean temperature? If so explain.\nd) What effects what \"color\" the ocean looks like on a clear day from space? Consider\nboth ocean properties and other 'stuff\" in the water."
    },
    {
      "category": "Resource",
      "title": "hw4_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/5e349ca36371fefa0fea28fe9f6b82ae_hw4_soln.pdf",
      "content": "2.011\n3/22/06\nHW# 4 Solution Set\nProblem 1: (10 points)\na. (2 points)The decibel (dB) is a measure of the ratio between two quantities, and is\nused in a wide variety of measurements in acoustics, physics and electronics.\nWhile originally only used for power and intensity ratios, it has come to be used\nmore generally in engineering. The decibel is widely used as a measure of the\nloudness of sound. It is a \"dimensionless unit\" like percent. Decibels are useful\nbecause they allow even very large or small ratios to be represented with a\nconveniently small number. This is achieved by using a\nIdB =10log10( I\nI0\n)\nPdB =10log10( P\nP0\n)\nlogarithm.\nIntensity is I and pressure is denoted by P.\nb. (3 points)\ni. Jet engine - 130 dB @ 30 m\nii. Car - motorcycle accelerating @ 5m = 110 dB\niii. Whale - Blue Whale humming at 1m = 180 dB\niv. Underwater Seismic Activity - seafloor volcanic eruption = 255 unerwater\ndB @ 1m.\nv. Rock concert - average is about 100 dB\nvi. Ships propeller - Supertanker = ~127 dB in air and 190 dB in water\nvii. Dolphin - 208 dB in water @ 6 m.\nc. (3 points)\ni. 10log10(A/B) = 10*(log10(A) - log10(B)) = log10(A10) - log10(B10)\nii. 10log10(A+B) = log10((A+B)10)\niii. 10log10(AB) = B*10* log10(A)\nd. (2 points)\ni. 10log10(1) dB = 0 dB\nii. 10log10(10) dB = 10 dB\niii. 10log10(0.5) dB = -3.01 dB\niv. 10log10(4) dB = 6.02 dB\nv. 10log10(16) dB = 12.04 dB\nProblem 2: (10 points)\na. (3 points) A sound wave is a pressure wave traveling at the speed of sound in\nsaltwater at ~1500 m/s and in air at ~343 m/s\nb. (4 points) using saltwater\ni. air = 343 m, saltwater = 1500 m\nii. air = 1.715E-4 m, saltwater = 7.5E-4 m\niii. air = 7.6E-4 m, saltwater = 3.3E-3 m\niv. air = 34.3 Hz, saltwater = 150 Hz\nv. air = 171.5 Hz, saltwater = 1500 Hz\nvi. air = 3.43 Hz, saltwater = 15 Hz\n\n2.011\n3/22/06\nc. (3 points) Higher frequencies attenuate more poorly than lower frequencies in all\nthree mediums, so the lower frequency (i) will travel the furthest or attenuate the\nleast. Sound waves travel fastest in steel, then water, then air.\nProblem 3: (2 points)\na. (2 points) Passive sonar only listens to sounds (receiver), whereas Active sonar\nsends and receives signals to determine distances, shapes etc.\nb. (2 points) Pref = 1μPa\nc. (2 points) Directivity determines how poorly the signal is attenuated in a certain\ndirection. If the signal is not directed at all, then the signal is attenuated equally in\nall directions, however, if the source is focused in a certain direction then it will\nattenuate much less in that direction and will be more intense in the direction it is\nintended. Directivity is used to determine if a receiver is within the focus\ndirection or inside a null node or side band signal etc, and can help determine the\nsignal strength.\nd. (2 points) DIline array=10log(2L/λ) and DIrectangular array=10log(4πLxLy/λ2) so the line\narray only considers the length, where the rectangular array must consider the\nlength and width, as well as dividing by wavelength squared.\nDIline/Directangle=λ/2L.\ne. (2 points) The line array on the left has a very large intensity at its center in the\nhorizontal direction; the line array on the left has a large intensity along its\nvertical centerline. John Leonard pointed out that the longer an array is the\nnarrower its beam is concentrated near its center.\nProblem 4: (10 points)\na. (5 points) Sound waves tend to bend towards regions with low velocities. In the\nupper mixed layer the sound tends to move towards the surface. In the upper\nlayer the sound waves cannot travel more than a few kilometers. If it is reflected\nfrom the surface it tends to bend back to the surface as it moves through the\nregion. In the thermocline the sound waves tend to bend toward the region of\nslowest velocity. When a sound is transmitted it is forced out in all directions\n(unless specifically directed towards on direction) as it travels near a higher\nvelocity it is bent back to the lower speed region. In the sound channel the sound\nwaves can travel thousands of kilometers.\nb. (5 points) The sound waves will tend to travel in large sinusoidal waves, not in a\nhorizontal line, because of the nature of the bending of the waves as they move\nthrough different sound speed regions. In general they always travel with some\nsinusoidal propagation.\nProblem 5: (10 points)\n(\n) p(r,t) = A\nr cos(kr \"#t) = Re A\nr e\"i(kr\"#t)\n$ % &\n' ( )\nI(r,\",#) = 1\n$c\nT\np2(r,\nT\n%\n\",#,t)dt\n&\n' (\n)\n* +\na.\n4 points\n\n2.011\n3/22/06\nDefinition of RMS: frms =\nT1 \"T2\nf (t)\n[\n]\n2dt\nT1\nT2\n#\nprmsT1=0 =\nT\np2(r,\",#,t)dt\nT\n$\nI(r,\",#) = 1\n$c prms\nb. (2 points) P(r) =\nI(r,\",#)d$\n%\nP(r) =\n\"c prms\n#=$%\n%\n&\n'=$%\n%\n&\nr2d' cos(#)d#\nP(r) = 4\"\n#c r2prms\n(\n) P(r)r=1m = 4\"\n#c prms\nSL =10log(P) =10log(4\"\n#c )+10log(Pref\n2 )+10log( P2\nPref\n2 ) = $50.8 $120+ SL\n\"SL =171+10log(P)\nc.\n2 points\nFor the source level.\nd. (2 points) The SL at 1m has an easier equation because the r-value is 1. It is also\na less noisy signal so the dominant source at that distance, so its power output is\nhigher than any surrounding signal."
    },
    {
      "category": "Resource",
      "title": "hw4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/0679a940ab2f3240ff6535fab4c466ba_hw4.pdf",
      "content": "2.011 HW # 4\nDue Tuesday March 21, 2006 In class\nProblem 1: Review of dB and logarithms:\na) Explain in words what a decibel is a measure of.\nb) Look up (Google, etc.) the relative Source Levels (in dB) for four (4) of the following\nsounds (cite your source)\ni.\nJet Engine\nii.\nCar\niii. Whale (specify type of whale)\niv. Underwater seismic activity\nv. A rock concert at the Fleet center or similar arena\nvi. A ships propeller (can be any ship, just specify)\nvii.\nA dolphin\nviii.\nSome other sound\nc) Expand the following expressions:\ni.\n10 log10( A / B) =\nii. 10 log10( A + B) =\niii. 10 log10( AB ) =\nd) Given your math in part e and your understanding of the definition for a decibel,\ncalculate the following quantities:\ni.\n10 log10(1) dB =\nii. 10 log10(10) dB =\niii. 10 log10(0.5) dB =\niv. 10 log10(4) dB =\nv. 10 log10(16) dB =\nProblem 2: Sound Wave properties\na) A sound wave is really a pressure wave traveling at the speed of _____(?)____.\nb) Determine the frequency or wavelength of sound waves:\ni. If frequency, f = 1.0 Hz , then λ = _____m in air and λ = ____m in water.\nii. If frequency, f = 2.0 MHz , then λ = _____m in air and λ = ____m in water.\niii. If frequency, f = 450 kHz , then λ = _____m in air and λ = ____m in water.\niv. If wavelength λ = 10 m, then f = _____Hz in air and f = _____Hz in water.\nv. If wavelength λ = 2 m, then f = _____Hz in air and f = _____Hz in water.\nvi. If wavelength λ = 100 m, then f = _____Hz in air and f = _____Hz in water.\nc) Which of the above waves will travel better (farther, with less attenuation) in each of\nthe following media: Fresh Water, Air (dry, 20oC), Steel. Explain Why?\n\nProblem 3: Sonar Systems\na) Explain the difference between active and passive sonar.\nb) In the definition for source level (SL) given in Prof. Leonard's notes, what is typically\nused as Pref in the general SL equation?\nc) What are the implications of directivity on the sound measured some distance away\nfrom a source?\nd) If you used a line array versus a disc or a rectangular array what considerations are\nnecessary when calculating the directivity index (DI)?\ne) Roughly sketch the beam spread patterns for the following transducers:\nProblem 4: Sound Reflection and Transmission\nWe know that the speed of sound is affected by water properties such as temperature,\nsalinity and depth (pressure). Considering a region with salinity of 35%o, and a typical\nTemperature/depth profile with a well-mixed, warm layer down to 100 meters, and a\nthermocline down to 1500 meters, where cold bottom temperature is found, discuss how\nsound waves would propagate within the upper, mixed layer and also the middle of the\nthermocline.\na) Do you expect them to travel far or not so far?\nb) Do you expect the sound to travel horizontally in a straight line (assume that it is a\nsimple pressure wave moving horizontally near it's source).\n\nProblem 5: Sines and Cosines\nGiven that the pressure wave in cylindrical coordinates is given by the following\nrelationship:\nA\n(\n( ,\n⎬\np r t ) =\ncos(kr -ωt) = Re ⎨⎧ A e-i kr -ωt ) ⎫\nr\n⎩ r\n⎭\na) Show that the intensity is related to the RMS of the pressure:\nI r ,\n( ,θ φ) = 1 p 2\nrms\nρc\nPower is the integral of the intensity:\n( ) = I r ,θ φ)dΩ\nP r ∫ (\n,\n,\nwhere dΩ= r dφ r cos\n\nd\n\nθ . The integral is evaluated over the range φ = [-π π ] and\n[\nθ = - 2\nπ , 2\nπ ].\nb) Determine (mathematically) the relationship between power (P(r)) and pressure (p(r)).\nc) Using your equation from (b) evaluate the power (at r = 1m) at any given time and\nshow how this can be related to source level.\nd) Why do we determine SL at 1m from the object versus some other distance?\nNote: RMS is the Root Mean Square of a function; for a function of time, f(t), its RMS\n(frms) is the square root of temporal average of the square of the function:"
    },
    {
      "category": "Resource",
      "title": "hw5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/a7a639dbd5c02bb2979a97103bab64e1_hw5.pdf",
      "content": "2.011 Spring 2006\nHomework #5\nI. Please complete the worksheets in the reading \"Introduction to Sonor.\"\n#1 pg. 10 Acoustic Bathymetry\n#2 pg. 16 Whale Tracking\n#3 pg. 18 Dolphin Tracking\nII. Outline your project goals and what you hope to accomplish for your project."
    },
    {
      "category": "Resource",
      "title": "hw6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/ef8cd4bc81fdc9860f015de3bfbfc07f_hw6.pdf",
      "content": "2.011 Spring 2006\nHomework #6\nGoal: Research a mechanism for turbulence generation in the ocean.\nRead the paper - Thorpe, S. A. \"Recent Developments in the Study of Ocean\nTurbulence.\" Annu. Rev. Earth Planet. Sci. 32 (2004):91-109. Look carefully at Figure 1,\nreproduced below. (Note: regions of strongest turbulence are stippled; and the drawing is\nnot to scale.)\n\nCourtesy of Annual Reviews. Used with permission.\nPick one of the mechanisms shown on this cartoon and research the role it plays in ocean\nmixing. Outline your findings in 2-3 Power point slides. Slide 1 should describe the\nphenomenon and slide 2+ should describe how it effects ocean mixing and circulation,\nwhere it is most commonly found, etc."
    },
    {
      "category": "Resource",
      "title": "hw7_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/fcc6a7054a11caa29110da7dab5c8f09_hw7_soln.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "takehome_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/d897b08e25017f64ae16a6448e679f5b_takehome_2.pdf",
      "content": "2.011 Take home exam; Spring 2006\nOut: Friday May 5th\nDue: Friday May 12th; by 5pm\nHand into TA or electronically via email.\nMake sure your name is on all submissions!\nProblem 1:\nYou are hired by a consortium of oceanographic agencies to investigate the Antarctic Circumpolar\nCurrent (ACC). From your basic knowledge of the ocean you know very little about the ACC, but\nyou do remember hearing once that it is a region of very high wind and waves and that the current\ntravels all the way around the continent of Antarctica.\na) Before you can start your project you need to do a little background research. In\napproximately one page, describe the ACC and its significance on global ocean circulation and\nweather, and transport of things like nutrients, fish, phytoplankton, etc. What are the general\nweather and water column properties in the current (e.g. waves, wind, temperatures, salinity,\ncurrent velocities...)? What is the predominant force driving this current? Web pages are\nacceptable sources - but cite your sources!\nb) From your research you may have read that the majority of water in the ACC passes through\nDrake's passage at the southern tip of South America. You can roughly model this passage as a\nrectangular channel (see sketch below) and a current flowing to the east (positive x-direction,\nclockwise around Antarctica). You can assume that this current does not vary with depth down\nto about half of the channel depth; below this you can assume there is no flow. Neglect\nCoriolis force in parts b and c only and neglect wind generated waves for parts b-d.\nUsing the basic governing equations for fluids and relevant boundary conditions, determine\nthe velocity profile across the channel from North to South (positive y-direction is considered\nto point northward, positive z-direction is take up from the free surface).\nYou can assume that this is steady, fully-developed flow (i.e. it's been flowing through the\nchannel for a long time and the profile hasn't changed in time). You can assume that the walls\nare vertical and that the channel can be considered infinite in length. To start consider only a\nsimple section looking down on the channel, and neglect the effect of depth on the flow.\nAssume that the pressure gradient in x-direction, along the channel, is constant.\nSouth\nAmerica\ny\nDrake's Passage\n(top view)\nN\nFLOW\nx\nW\nE\nS\nAntarctica\nHint: flow across this channel (N-S) is symmetric!\n\nc) Using the profile from part b, determine an approximate volume flow rate through the channel\nin terms of the constant pressure gradient in the x-direction. You can assume a specific\nchannel depth taken from literature compared with the channel's width, or leave this in terms\nof general variables. Assume, still, that the flow does not vary with depth down to half the\nchannel depth.\nd) The ACC loops around Antarctica and is driven primarily by wind. This wind creates an\nEkman Layer and results in Ekman pumping. Locally, the continent can be loosely modeled as\na straight shoreline with a vertical wall dropping off to the deep ocean. Assuming the wind is a\nwesterly wind (blowing out of the west to the east). Determine the direction of Ekman\nPumping and calculate the Ekman Mass transport in the x and y directions for a wind velocity\nU10 = 2 m/s. Use a reasonable estimate for Cd ~ 0.003.\nProblem 2:\nIn at least two (2) typed pages (~double spaced, 12point, 1in margins) detail your contributions to\nthe 2.011 Mega SeaPerch Vehicle. Detailed specifications and or photos can be added, but text\nshould be equivalent of about 2 pages.\n- This discussion can include both your part in the building of the basic ROV and your\nspecific \"advanced\" instrument.\n- Describe what your goal was (e.g. to build an instrument to measure x, why is x important\nin the ocean?); your approach to the problem (e.g. modified existing sensor or built from\nscratch using x, y, z parts; include basic schematics, or sketches, where appropriate); and\nany recommendations for future modifications/improvements.\n- Discuss calibration issues where necessary or problems that you anticipate might arise in\ntesting.\n- Discuss what you learned in the process of building your apparatus.\nJust for fun:\nName our ROV.\nThe END."
    },
    {
      "category": "Resource",
      "title": "labsafety.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/751b61175b22b82cc6f58838d851dc81_labsafety.pdf",
      "content": "MIT Ocean Engineering Teaching Lab\n\nGENERAL INFORMATION\n\nA well equipped lab, such as the Ocean Engineering Teaching Laboratory (OETL), is a\nwonderful resource in which you can do amazing things with your engineering\nknowledge. Unfortunately, your time in the lab will be limited, so it is imperative that\nyou come to the lab awake, prepared, and ready to work. Once in the lab you should work\nin an organized and efficient fashion. The following simple rules will help you to develop\ngood lab skills:\n1. Ready any assigned material before you come to the lab.\n2. Take the time to think about the purposes and procedures of the lab before diving\ninto the hardware.\n3. Plan and organize your work before you start, don't forget to discuss this plan\nwith your lab partner(s) if you have any.\n4. Organize your work space, you can't do good work if you' re uncomfortable.\n5. Take thorough notes and write them in your lab notebook while you work, not\nafter you work.\n6. Analyze your data as soon as possible after the lab, this will reduce the risk of\nforgetting any important points about the lab that you may have forgotten to write\ndown during the lab.\n\nIf you work in groups, then the group members are responsible for the fair division of\nlabor in carrying out the lab activities. Each person within a group must keep his/her own\nlab notebook and common data and other information must appear in each group\nmember's lab notebook. Each member of the group must do his/her own data analysis\nand write it up in his/her own lab notebook.\n\nTools and test equipment will be kept in common storage areas. You will get the\nequipment that you need at the start of the lab and return it to the proper storage areas at\nthe end of the lab. Setups that must remain intact for more than one lab session may be\nleft on the bench but they must be labeled with your name(s) and dated. If possible, such\nsetups should be placed on the shelves above the workbenches to leave the workbench\nspaces clear for other students to use. There will be a set of drawers and shelves assigned\nto you and /or your class for long-term storage of project-specific equipment and parts.\n\nWe will go to the proper use of each tool and test instrument as it is needed for the labs.\nYou will not be allowed to use a tool or test instrument unless you have been properly\ntrained in its use. All equipment must be properly cared for and put away after\nAfter each laboratory session. If any piece of equipment breaks notify the lab manager\nimmediately so it can be fixed or replaced. Other students will be using this equipment\nduring non-course hours. Notify the lab manager immediately if any equipment is left in\na disorganized or dysfunctional state by non-course students.\n\nYou can make your own directory on any of the lab's computers. Just place that directory\nin the \"My Documents\" folder of the computer you are working on. Alternatively, if you\n\nare a member of a course then you can put group work in the course's directory, for\nexample, \"My Documents\\2.017\".You will be given the computer login codes on the first\nday of the class. All your data, text and graphics should be kept organized in these\ndirectories. It is recommended that your directory be kept well-organized and backed-up\nperiodically onto floppy disks, zip disks, or CDROMs that we will provided as needed.\nEach of our lab's PC's is connected to the campus network and the Internet so you can\nalso upload your data to your campus account and do your analyses outside of the lab.\nThe Internet and World Wide Web are great tools for research and while you are in the\nlab they should be used such. CHATTING WITH YOUR FRIENDS OR OTHER NON-\nLAB RELATED INTERNET ACTIVITIES WILL NOT BE TOLERATED IN THE\nLAB!\n\nWhen you enter the lab place your coat, backpack and other personal items under a lab\nbench or chair, or otherwise out of the way. Do not dump your stuff on a workbench that\nyou or your fellow students will be using, or in the aisles. The only things you should\ntake to the workbench are your notebook, calculator and lab-related books. You should\ntake ALL your personal belongings with you at the end of the lab session. We are not\nresponsible for personal items left in the lab, they may be stolen and they definitely will\nbe thrown away when we periodically clean the lab. The storage space assigned to the\nclass is for class-specific items, not personal belongings. Bicycles are not allowed in the\nlab, they should be chained to the bicycle racks, outside, near the lab. Students may not\nwear roller blades in the lab or in the building."
    },
    {
      "category": "Resource",
      "title": "challenge_v2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/d29eeb75607857180b45b7b99727bd49_challenge_v2.pdf",
      "content": "2.011 Ocean Systems Design Challenge\nSpring 2006\nIntroduction:\nYou have been hired by an oceanographic research institute to find, map and collect data\n(especially temperature) from a field of hydrothermal vents in the Atlantic. There are\nmany types of hydrothermal vents but generally they are formed by rifts in the earth's\ncrust near the bottom of the ocean. Water from a chamber under the sea floor is heated by\nthe molten earth below and rises to the surface, due to buoyancy. The water temperature\nis very hot (400o-750oC), but these vents still serve as a home to millions of\nmicroorganisms.\nThis year's 2.011 challenge will focus on designing and building an ROV outfitted with\nthe necessary instrumentation to map and investigate a simulated vent field in a pool or\ntank. This project will give students a chance to collect data about the field from the\nsensors they build themselves. Points will be awarded for robustness, sensitivity,\nversatility of the vehicle, operability, and how useful the information will be for future\nscientific discovery.\nAfter completing the pool trials, we will venture to the Charles River or Boston Harbor to\n\"field test\" our ROV.\nStep 1: Planning your vehicle\nBreak out in small groups and brainstorm. Consider which instruments are crucial for the\nmission, and which instruments you would like to have on the vehicle (wish list). Also\nconsider, based on your choice of instruments, what the performance characteristics for\nyour vehicle need to be (e.g. maneuvering, forward/reverse swimming, up/down diving,\netc.), and what you might be interested in working on for this project.\nCourtesy of NOAA Pacific Marine Environmental Laboratory's Vents Program. Used with permission.\nPlease see: http://www.pmel.noaa.gov/vents/multimedia.html\n\nStep 2: Designing the Vehicle\nCollectively determine a preliminary instrumentation proposal, while keeping in mind the\nmissions it will be involved in.\nRegroup and share the information obtained from the brainstorming exercise. Consider\neach proposed instrument to assess its relevance to the project, estimated cost, usefulness,\nfeasibility (can it be completed in the time allotted, do we have/can we quickly learn the\nskills needed to build it), and overall student interest (is one person particularly\nexcited/against about building a certain instrument?).\nNext consider the actual vehicle design and configuration. Is the prototype frame\nsufficiently large and well designed for our needs? Are there enough places to mount\nequipment? Where should the motors be placed? Are there hydrodynamic/stability issues\nto consider? Where will the electronics go? What else should be considered? If the ROV\nis designed for the diving well of the MIT pool (about 16-20ft? deep), will it be limited in\nthe \"real-world\".\nStep 3: Build the ROV platform and test\nAfter the design phase, the ROV will be built and tested. There are three main parts, the\nstructure, the motors (the required motors and some extras, just in case), and the control\nbox. Once the components are built we will assemble the vehicle and test the ROV\nplatform for seaworthiness and controllability. At this step we can also review how well\nour design/ideas worked.\nStep 4: Build and test sensors\nOnce the ROV is built, sensor groups will be formed to design, and build the\ninstrumentation. Each group will design, build and test an instrument of their choosing.\nThe instruments will give students the opportunity to assess a need, design a solution,\nbuild a prototype, test, and report on the outcome. Instruments will be developed to\nobtain data for the challenge and open water dives. This step will take up most of the\nterm.\nStep 5: Face the 2.011 Challenge\nThe real test of the equipment will be acquiring data from the challenge and determining\nwhether it is accurate and useful. And further \"field exploration\" will be performed."
    },
    {
      "category": "Resource",
      "title": "ekman.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/71d23b701596048fdd858ecd31c562ea_ekman.pdf",
      "content": "2.011 Motion of the Upper\nOcean\nProf. A. Techet\nApril 20, 2006\n\nEquations of Motion\n- Impart an impulsive force on the surface of the fluid to\nset it in motion (no other forces act on the fluid, except\nCoriolis).\n- Then, for a parcel of water moving with zero friction:\n\nSimplify the equations:\n- Assuming only Coriolis force is acting on the\nfluid then there will be no horizontal pressure\ngradients:\n- Assuming then the flow is only horizontal (w=0):\n- Coriolis Parameter:\n\nSolve these equations\n- Combine to solve for u:\n-\n- Inertial Current Solution:\n(Inertial Oscillations)\nStandard Diff. Eq.\n\nInertial Current\n- Note this solution are equations for a circle\nDrifter buoys in the N. Atlantic\n- Circle Diameter:\n- Inertial Period:\n- Anti-cyclonic (clockwise) in N. Hemisphere; cyclonic\n(counterclockwise) in S. Hemi\n- Most common currents in the ocean!\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nEkman Layer\n- Steady winds on the surface generate a thin, horizontal\nboundary layer (i.e. Ekman Layer)\n- Thin = O (100 meters) thick\n- First noticed by Nansen that wind tended to blow ice at\n20-40° angles to the right of the wind in the Arctic.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nEkman's Solution\n- Steady, homogeneous, horizontal flow with friction on a\nrotating earth\n- All horizontal and temporal derivatives are zero\n- Wind Stress in horizontal (x, y) directions\n- Az is an eddy viscosity or diffusivity that replaces\nkinematic viscosity\n\nEquations of motion with wind stress\nSteady, homogeneous, horizontal,\nviscous, turbulent flow equations\nfor momentum from NSE\n\nEkman Current\n- When wind blows north T = T\nand\nyz\n- At z = 0\n- Wind stress:\n- Surface current speed versus wind speed:\nlatitude\n\nEkman Spiral\n- Current moves at speed Vo to the north east\n-\nGenerally the surface\ncurrent is 45° to the right\nof the wind when looking\ndown in the N.\nHemisphere and 40° to\nthe left of the wind in the\nS. Hemi.\nBelow the surface the velocity decays exponentially with depth\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nEkman Layer\n- Ekman Layer depth\nfor\n,\n- Depth below surface that the current is directly opposite\nsurface current:\n\nEkman Number\nRelates relative magnitude of Coriolis and friction forces\nU is typical velocities, d is typical depths,\nVertical mixing is considerably less than horizontal mixing because the\nocean is stratified\nAs depth increases, the frictional force becomes much smaller than\nCoriolis force\n\nEkman v. Reality\n- Inertial currents dominate\n- Flow is nearly independent of depth within the mixed layer on time\nperiods on the order of the inertial period (i.e. the mixed layer moves\nlike a slab)\n- Current shear is strongest at the top of the thermocline\n- Flow averaged over many inertial periods is almost exactly that\ncalculated by Ekman\n- Ekman depth is typically on target with experiments, but velocities\nare often as much as half the calculated value\n- Angle between wind and flow at surface depends on latitude and is\nnear 45 degrees at mid-latitudes\n\nEkman Mass Transport\n- Integral of the Ekman Velocities down to a depth d:\n- Ekman transport relates the surface wind stress:\n- Mass transport is perpendicular to wind stress\n- In the northern hemisphere, f is positive, and the mass\ntransport is in the x direction, to the east.\n\nCoastal Upwelling\n- Upwelling enhances biological\nproductivity, which feeds fisheries.\n- Cold upwelled water alters local\nweather. Weather onshore of\nregions of upwelling tend to have\nfog, low stratus clouds, a stable\nstratified atmosphere, little\nconvection, and little rain.\n- Spatial variability of transports in\nthe open ocean leads to upwelling\nand downwelling, which leads to\nredistribution of mass in the\nocean, which leads to wind-driven\ngeostrophic currents via Ekman\npumping.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nEkman Pumping\n- The horizontal variability of the wind blowing on the sea surface\nleads to horizontal variability of the Ekman transports.\n- Because mass must be conserved, the spatial variability of the\ntransports must lead to vertical velocities at the top of the Ekman\nlayer.\n-\nthe vertical direction:\nTo calculate this velocity, we first integrate the continuity equation in\n- By definition, the Ekman velocities approach zero at the base of the\nEkman layer, and the vertical velocity at the base of the layer\nwE(-d), due to divergence of the Ekman flow, must be zero.\n\nVertical Ekman Velocity\n-\nupper boundary layer of the ocean, and\nME\nWhere\nis the vector mass transport due to Ekman flow in the\nis the horizontal\ndivergence operator.\n- This states that the horizontal divergence of the Ekman transports\nleads to a vertical velocity in the upper boundary layer of the ocean,\na process called Ekman Pumping\n\nEkman Pumping and Wind Stress\n- If we use the Ekman mass transports in the previous\nequations we can relate Ekman pumping to the wind\nstress, T.\n- The vertical velocity at the sea surface w(0) must be\nzero because the surface cannot rise into the air, so\nwE(0) must be balanced by another vertical velocity.\n- This is balanced by a geostrophic velocity wG(0) at the\ntop of the interior flow in the ocean. (Next lecture!)"
    },
    {
      "category": "Resource",
      "title": "geostrophic.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/47a035a6428b728e53a08fc183bce9f3_geostrophic.pdf",
      "content": "2.011 Geostrophic Currents\nProf. A. Techet\nApril 25, 2006\n\nGeostrophic Balance (Horizontal)\n- Region: the mid-ocean, below surface\nlayer and above bottom Ekman layers\n- The horizontal pressure gradients almost\nexactly equal the Coriolis force resulting\nfrom the horizontal currents.\n- This balance holds over distances greater\nthan tens of meters and on time scales\nlonger than several days and is good\nwithin a few parts per thousand.\n\nHydrostatic Balance (Vertical)\n- Vertical pressure gradient is directly\nrelated to the weight of the water (gravity)\nwithin a few parts per million!\n- For a non-moving ocean in static\nequilibrium, pressure is related to gravity\nand density as:\n\nGeostrophic Equations\n- Assuming Steady flow (d/dt = 0)\n- Friction is negligible\n- Gravity is only external force\n- Vertical velocities are negligible (w << u, v)\n- Then the NSEs reduce to\nwhere\n\nGeostrophic Equations\n- These equations can be rewritten as\nfollows:\nVelocities:\nPressure p(z):\nNote: ζ can vary in x and y so pressure is a fcn of x,y, and z!\n\n- Pressure gradient at the surface is balanced by a\nsurface current:\nSurface velocity\nSurface velocity\nRelative velocity\nRelative velocity\n\nSea Surface Elevation\n(Random Ocean Seas)\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nSurface Geostrophic Current\n- Surface current is related to surface\nelevation:\n- From satellite data we can get the surface\ncurrents from the surface topology\n\nSatellite Measurement of Currents\n- The height of the sea surface, ζ, is the height of the sea\nsurface relative to a particular level surface coincident\nwith the ocean at rest. (This surface is the Geoid)\n- Since we can measure the surface topography from\nsatellites we can thus calculate the slope of the surface\nand in turn the surface geostrophic currents.\n- Typical slopes are ∂ζ/∂x ≈ 1-10 microradians for v = 0.1-\n1.0 m/s at mid latitudes.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nSatellite Altimetry\n- The first systems, carried on Seasat, Geosat, ers-1, and\ners-2 were designed to measure week-to-week\nvariability of currents.\n- Topex/Poseidon, launched in 1992, was the first satellite\ndesigned to make the much more accurate\nmeasurements necessary for observing the permanent\n(time-averaged) surface circulation of the oceans, tides,\nand the variability of gyre-scale currents. (replaced by\nJason in 2001, retired completely in early 2006)\n- The geoid was not well known locally before about 2004\nso altimeters were usually flown in orbits that have an\nexactly repeating ground track.\n- Topex/Poseidon and Jason fly over the same ground\ntrack every 9.9156 days.\n\nWhat can we measure with\nSatellites?\n-\nBy subtracting sea-surface height from one traverse of the ground track\nfrom height measured on a later traverse, changes in topography can be\nobserved without knowing the geoid.\n-\nThe geoid is constant in time, and the subtraction removes the geoid,\nrevealing changes due to changing currents, such as mesoscale eddies,\nassuming tides have been removed from the data\n-\nThe great accuracy and precision of the Topex/Poseidon and Jason\naltimeter systems allow them to measure the oceanic topography over\nocean basins with an accuracy of ±5 cm. This allows them to measure:\n- Changes in the mean volume of the ocean\n- Seasonal heating and cooling of the ocean\n-\nTides\n\n- The permanent surface geostrophic current system\n- Changes in surface geostrophic currents on all scales\n- Variations in topography of equatorial current systems such as those associated\nwith El Nino\n\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nGeopotentials\n- Geoid is a level surface and\nconsidered a surface of constant\npotential\n- Consider the work done in\nmoving a mass m by a distance\nh\nh perpendicular to a level\nsurface.\n- The work required is W = mgh,\ng\nand the change of potential\nenergy per unit mass is gh.\n- Thus level surfaces are surfaces\nof constant geopotential, where\nthe geopotential is\nWork = mgh\nM\nM\nM\nM\nM\nΦ = gh\n\nFind Geostropic Currents\n1.\nCalculate the slope of a constant pressure surface\nrelative to a surface of constant geopotential.\n2.\nCalculate the change in pressure on a surface of\nconstant geopotential. Such a surface is called a\ngeopotential surface.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nCalculate the slope\n- Oceanographers usually calculate the slope of constant-pressure\nsurfaces.\n- The important steps are:\n- Calculate differences in geopotential (Φ A - Φ B) between two constant\npressure surfaces (P1, P2) at hydrographic stations A and B. This is\nsimilar to the calculation of ζ of the surface layer.\n- Calculate the slope of the upper pressure surface relative to the lower.\n- Calculate the geostrophic current at the upper surface relative to the\ncurrent at the lower. This is the current shear.\n- Integrate the current shear from some depth where currents are known\nto obtain currents as a function of depth. For example, from the surface\ndownward, using surface geostrophic currents observed by satellite\naltimetry, or upward from an assumed level of no motion.\n\nBaroclinic vs. Barotropic Flows\n- Barotropic flow occurs when levels of constant pressure\nin the ocean are always parallel to the surfaces of\nconstant density.\n- Note, some authors call the vertically averaged flow the\nbarotropic component of the flow.\n- It has been noted that Barotropic is used in so many different\nways that the term is meaningless and should not be used.\n- Baroclinic flow occurs when levels of constant pressure\nare inclined to surfaces of constant density. In this case,\ndensity varies with depth and horizontal position.\n- Baroclinic flow varies with depth, and the relative current can be\ncalculated from hydrographic data.\n- Note, constant-density surfaces cannot be inclined to constant-\npressure surfaces for a fluid at rest.\n\n-\n-\nA good example of\nbaroclinic flow -\nthis shows levels of\nconstant density changing\ndepth by more than 1 km\nover horizontal distances\nof 100 km at the Gulf\nStream.\nRelative current as a function of depth\ncalculated from hydrographic data\ncollected by the Endeavor cruise south\nCross section of potential density across the Gulf Stream along 63.66*W\nof Cape Cod in August 1982. The Gulf\ncalculated from CTD data collected from Endeavor on 25-28 April 1986.\nStream is the fast current shallower\nThe Gulf Stream is centered on the steeply sloping contours shallower than\nthan 1000 decibars. The assumed\n1000m between 40* and 41*. Notice that the vertical scale is 425 times the\ndepth of no motion is at 2000 decibars.\nhorizontal scale.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nDisadvantage of Calculating\nCurrents from Hydrographic Data\n-\nCurrents calculated from hydrographic data have been\nused to make maps of ocean currents since the early\n20th century. Nevertheless, it is important to review the\nlimitations of the technique.\n1. Hydrographic data can be used to calculate only the current\nrelative to a current at another level.\n2. The assumption of a level of no motion may be suitable in the\ndeep ocean, but it is usually not a useful assumption when the\nwater is shallow such as over the continental shelf.\n3. Geostrophic currents cannot be calculated from hydrographic\nstations that are close together. Stations must be tens of\nkilometers apart.\n\nLimitations of the Geostrophic\nEquations\n-\nThe geostrophic balance is not perfect.\n-\nIf it were, the flow in the ocean would never change because the\nbalance ignores any acceleration of the flow.\n-\nImportant limitations of the geostrophic assumption are:\n1. Geostrophic currents cannot evolve with time because the balance\nignores acceleration of the flow. Acceleration dominates if the\nhorizontal dimensions are less than roughly 50 km and times are less\nthan a few days. Acceleration is negligible, but not zero, over longer\ntimes and distances.\n2. The geostrophic balance does not apply within about 2* of the equator\nwhere the Coriolis force goes to zero because sinφ → 0.\n3. The geostrophic balance ignores the influence of friction.\n\nWind/Ekman/Geostropic\n-\nAn example of how winds produce\ngeostrophic currents running\nupwind.\n-\nEkman transports due to winds in\nthe north Pacific (Left) lead to\nEkman pumping (Center), which\nsets up north-south pressure\ngradients in the upper ocean.\n-\nThe pressure gradients are\nbalanced by the Coriolis force due\nto east-west geostrophic currents\n(Right).\n-\nHorizontal lines indicate regions\nwhere the curl of the zonal wind\nstress changes sign.\n-\nAK: Alaskan Current, NEC: North\nEquatorial Current, NECC: North\nEquatorial Counter Current.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nLagrangian Measurements of\nCurrents\n- Lagrangian - Measurements in space and time following a specific\nparticle of fluid\n- Lagrangian techniques track the position of a drifter that follows a\nwater parcel either on the surface or deeper within the water\ncolumn.\n- The mean velocity over some period is calculated from the distance\nbetween positions at the beginning and end of the period divided by\nthe period.\n- Errors are due to:\n- Errors in determining the position of the drifter.\n- The failure of the drifter to follow a parcel of water. We assume the\ndrifter stays in a parcel of water, but external forces acting on the drifter\ncan cause it to drift relative to the water.\n- Sampling errors. Drifters go only where drifters want to go. And drifters\nwant to go to convergent zones. Hence drifters tend to avoid areas of\ndivergent flow.\n\nSatellite tracked drifters\n-\nSatellite systems, especially\nSystem Argos, use radio signals\ntransmitted from surface buoys to\ndetermine the position of the buoy.\n-\nThe satellite S receives a radio\nsignal from the buoy B.\n-\nThe time rate of change of the\nsignal, the Doppler shift F, is a\nfunction of buoy position and\ndistance from the satellite's track.\n-\nThe recorded Doppler signal is\ntransmitted to ground stations E,\nwhich relays the information to\nprocessing centers A via control\nstations K.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nPop-Up Floats (ALACE)\n-\nAutonomous Lagrangian Circulation\nExplorer (alace) floats are designed to\ncycle between the surface and some\npredetermined depth.\n-\nThe drifter spends ~10 days at depth,\nand periodically returns to the surface\nto report its position and other\ninformation using the Argos satellites\n-\nThe drifter thus combines the best\naspects of surface and neutrally-\nbuoyant floats.\n-\nIt is able to track deep currents, it is\nautonomous of acoustic tracking\nsystems, and it can be tracked\nanywhere in the ocean by satellite.\n-\nThe maximum depth is near 2 km, and\nthe drifter carries sufficient power to\ncomplete 70 cycles to 1,000 m or 50\ncycles to 2,000 m.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nEulerian Measurements\n- Eulerian techniques\nmeasure the velocity of\nwater at a fixed position.\n- Eulerian measurements\nhave been made by many\ndifferent types of current\nmeters attached to many\ntypes of moorings or\nships.\n- Moorings are deployed by\nships, and they may last\nfor many years.\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm"
    },
    {
      "category": "Resource",
      "title": "hydrost_pressure.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/39ff285af55b91f550473ba37192caf1_hydrost_pressure.pdf",
      "content": "2.016 Hydrodynamics\nReading #2\n2.016 Hydrodynamics\nProf. A.H. Techet\nPressure effects\nFluid forces can arise due to flow stresses (pressure and viscous shear), gravity forces,\nfluid acceleration, or other body forces. For now, let us consider a fluid in static\nequilibrium - with no velocity gradients (thus no viscous stresses).\nForces are then due only to:\n1. Pressure acting on the fluid volume\n2. Gravity acting on the mass of the fluid\n3. External body forces\nUsing standard conventions we will consider pressure to be positive for compression.\nRecall that we said pressure is isotropic: Consider a triangular volume of fluid with\nheight, dz, length, dx, and unit width, b, into the page:\nFigure 2.1: Elemental fluid volume\nversion 4.0\nupdated 1/30/2006\n-1-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nThe fluid element can support no shear while at rest (by our definition of a fluid). Thus\nthe sum of the forces on the triangle, in the x- and z- directions, MUST equal zero:\nz\n∆\n-p\n\nb\n\n(∆s)sin\n\nθ = 0\n(2.1)\n∑F = p\n\nb\n\n(\n)\nx\nx\nn\nx\n∆\n\n-\n\np\n\nb\n\n(∆s)cos\n\nθ - γb(∆∆\n\nz) = 0\n(2.2)\n∑F = p\n\nb\n\n(\n)\n\nx\nz\nz\nn\nWe can simplify the above equations using simple geometry:\nz =\n∆\n(∆s)sinθ and ∆x = (∆s)cosθ ,\n(2.3)\nsuch that\n∑F = ( p -p ) = 0\n(2.4)\nx\nx\nn\nand\n∑F = p -p -1/ 2 γ (∆z) = 0 .\n(2.5)\nz\nz\nn\nTaking the limit as ∆x, ∆z goes to zero (i.e. the triangle goes to a point), we see that\np = p = p = p .\n(2.6)\nx\nz\nn\nSince θ is arbitrary, pressure at a point in a fluid is independent of orientation and is thus\nisotropic. Pressure (or any stress for that matter) causes NO net force on a fluid element\nunless it varies spatially!\nversion 4.0\nupdated 1/30/2006\n-2-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nTake for example a small fluid element, δx, δy, δz:\nFigure 2.2: Fluid Element Volume (z is positive upwards by convention).\nWe will continue to assume that the only forces are due to gravity and pressure gradients.\nLet's start by looking at the pressure acting on the top and bottom of the element volume.\nUsing Taylor's series expansion:\n2 p\nd\nδ dp\nz\ndz\n⎛⎜⎝\nδz\n⎞⎟⎠\n- ...\n(2.7)\nptop = po +\n+\ndz2\n!2\nSecond term is positive b/c we are taking z positive upwards from the center of the\nelement.\n2 p\nd\nδ dp\nz\ndz\n⎛⎜⎝\nδz\n⎞⎟⎠\nbot = po -\n+ ...\n(2.8)\n+\np\ndz2\n!2\nTaking the limit as δz goes to zero we are able to ignore the higher order terms and keep\nonly up to second order. The resultant force due to pressure on the face is\nFpress .\np\n\ndA\n\np\n\ndx\n\ndy .\n(2.9)\n=\n=\nversion 4.0\nupdated 1/30/2006\n-3-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nF\n= ( p - ptop ) dx\n\ndy\n\n= dp dx\n\ndy\n\ndz\n\n.\n(2.10)\npress\nbot\ndz o\nFpress acts in the positive z-direction opposite to gravity. In summing the pressures acting\non the top and bottom we see that the second order terms cancel exactly and we are left\nwith the resulting force due to pressure.\nActing in tandem to the pressure force is the force due to gravity. The fluid density and\nvolume dictate the mass of the element (F=mg).\nbot\nbot\nFweight = ∫\ntop ρ(\ndxdydz\ng\nz\n=\ndxdy\ng\n∫\ntop ρ (\ndz\nz\n(2.11)\n)\n)\n=\ndxdy\ng\n2 (ρ top + ρ bot )dz\n(2.12)\nUsing Taylor's series expansion similar to the pressure terms above we get:\nρ top + ρ bot = 2ρ\n(2.13)\no\nFor static equilibrium, pressure forces MUST balance gravitational/body forces:\nFweight + F\n= 0\n(2.14)\npress\ndp\ndxdydz\ng\n)\n(2.15)\n(dxdydz)\n-\n=\nρ (\ndz o\nWe can drop the subscript \"o\" from the pressure gradient term since we have taken the\nlimit to a small element of fluid. This equation is valid at any point in the fluid.\nCanceling the elemental volume terms we are left with the hydrostatic equation.\ndp\n-\n=\nρg\nHydrostatic Equation:\n(2.16)\ndz\nThe negative sign is valid here since the z-direction is taken positive pointing up, in the\nopposite direction to the gravitational force. If z-direction coincided with gravity then the\nnegative sign would be dropped.\nIn this case, there are no acting forces or pressure changes in the x- or y-directions\ntherefore dp/dz is representative of the pressure gradient:\ndp = ∇ p .\n(2.17)\ndz\nversion 4.0\nupdated 1/30/2006\n-4-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nWe can rewrite the hydrostatic equation as:\nK\n∇p\n-\n= ρg K\n(2.18)\nIf there were additional gradients in the x- and y-directions similar steps could be\nfollowed and the resulting equation would be similar. Pressure gradient is always\nbalanced by gravity, acceleration, viscous forces, and any other external body forces.\nGauge and vacuum pressure:\nPressure is usually referred to in one of two ways:\n1) Absolute, or total, pressure\n2) Relative to ambient (atmospheric) pressure\nSince most pressure instruments are differential measurement devices, meaning they\nmeasure the pressure in the fluid relative to atmospheric pressure, absolute pressure is a\ncommonly used quantity.\nPressure is either greater or less than the ambient (atmospheric) pressure:\n1) p > pa\nGage Pressure\np(gage) = p - pa\n2) p < pa\nVacuum pressure\np(vacuum) = pa - p\nIn order to get the total (absolute) pressure, the atmospheric pressure must be known.\nversion 4.0\nupdated 1/30/2006\n-5-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nP (Pascals)\n120,000\n40,000\n50,000\n30,000\nHigh Pressure\n90,000\nLocal Atmospheric\n50,000\nVacuum Pressure\nAbsolute Zero\ntension\nFigure 2.3: Relative pressure chart\nHydrostatic Force on a Wall:\nRecall the equation for the pressure gradient in a liquid is\nK\n∇ p\n-\n= ρg K .\n(2.19)\nWhich, in the vertical direction this translates to\ndp\n-\n= ρg ,\n(2.20)\ndz\nor\ndp = -ρ dz\ng\n.\n(2.21)\nIntegrating in the z-direction we get pressure as a function of depth:\na\n∫ p\np dp = -∫ z ρ g dz\n(2.22)\n(\np - p = -ρg ( z - H ) = ρ H\ng\n- z)\n(2.23)\na\nNote that pressure increases with depth with a constant slope, ρ g . Pressure is either\nconsidered relative to a reference pressure or in absolute terms. Most pressure gauges\nversion 4.0\nupdated 1/30/2006\n-6-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nare differential measurement devices that measure pressure relative to ambient (or\natmospheric) pressure. Thus it is important to keep in mind the effects due to\natmospheric pressure in your laboratories and calculations.\nPressure is isotropic, and therefore pressure is the same on a vertical or horizontal surface\nat depth h. Take for instance the ocean bottom and a vertical seawall that extends to the\nbottom. At depth H, the horizontal pressure acting on the wall is equivalent to that\npressure acting along the entire seafloor at that same depth.\nHorizontal Force acting on a vertical surface:\nFigure 2.4: Absolute Pressure vs. Gauge pressure\nUsing absolute pressure formulation we can find the force on the wall from the pressure\nas a function of depth:\n(\np - p = -ρ\nz\ng\n- h)\n(2.24)\na\nThus the elemental force acting in the x-direction due to the pressure is\ndF = dA\np\n=\ndz\nw\np\n,\n(2.25)\nx\nwhere w is the width of the wall into the page.\nTo determine the force on the wall we must consider the pressure acting on both sides of\nthe wall. Let's assume that on the left of the wall water of depth, h, is exerting force F1 on\nversion 4.0\nupdated 1/30/2006\n-7-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nthe wall. The right side of the wall is open to the air with atmospheric pressure acting\nover the height of the wall. Under this setup we must account for the atmospheric\npressure on both sides of the wall. The elemental force in the x-direction at some depth z\nbelow the free surface is formulated on the left and right sides of the wall to determine\nthe total force acting on the wall:\n(\nLeft:\ndFx1 = (P + ρ h\ng\n- z)) dz\nw\na\nRight:\ndFx2 = -\ndz\nw\nP a\nTotal force:\ndF = dFx1 + dF =\ndz\nw\nP\n+ ρ h\ng\n-\ndz\nw\nz\n-\ndz\nw\nP\n(\n)\nx\nx2\na\na\nThe two underlined terms cancel and we are left only with the effect due to the presence\nof the water. Integrating the pressure over the depth\nh\nh\ng\n- dz\nz\n=\nF = ∫\n0 ρ (\n)\nρ gwh\n(2.26)\nIf use gauge pressure to calculate the force on the wall, we already take into account the\neffect of atmospheric pressure and can directly calculate the force from:\n(\npg = ρ\nh\ng\n- z) (gauge pressure)\n(2.27)\ndF =\ndA\np\n= ρ\nh\ng\n-\ndz\nw\nz\n(2.28)\n(\n)\ng\nResulting in the same force found when we used absolute pressure.\nThe force acting on the wall is a \"distributed load\" which acts along the entire depth of\nthe wall. However it is possible to determine how this force \"acts\" on the wall using a\nsimple moment balance:\ndMo = z × dF\n(2.29)\nwhere Mo is the moment on the wall about the origin (for now lets consider the origin the\nbottom of the wall) and z is the moment arm perpendicular to the force direction.\nversion 4.0\nupdated 1/30/2006\n-8-\n(c) 2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nFigure 2.5: Moment balance on the wall about the origin o with z taken positive from the\nground up.\nThe elemental moment about the origin due to the hydrostatic pressure is:\ndMo = ρ\nh\ng\n-\ndz\nz\nw\nz\n(2.30)\n(\n)\nIntegrating leads to the total moment about the origin:\nMo =\nρgwh\n(2.31)\nBy definition the product of the force F times the moment arm z must equal the moment\nM:\nM =\nz\nF\n(2.32)\nSuch that the point at which the force acts on the wall is z :\n16 ρgwh3\nz =\n12 ρgwh2 = 13 h\n(2.33)\nversion 4.0\nupdated 1/30/2006\n-9-\n(c)2005 A. Techet\n\n2.016 Hydrodynamics\nReading #2\nFigure 2.6: The point at which the resultant force acts is known as the center of pressure.\nWe can use a similar approach to the problem of pressure on a sloped wall. This is left for\na homework exercise. Since atmospheric pressure acts everywhere then gage pressure is\nthe ideal pressure to use in these exercises. The resultant forces and moments on the\nsloped wall can be found using simple geometry and then extended to the case of a \"V\"-\nshaped ship hull.\nFigure 2.7: V-shaped Hull\nversion 4.0\nupdated 1/30/2006\n-10-\n(c)2005 A. Techet"
    },
    {
      "category": "Resource",
      "title": "vorticity.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/99a66f4f41c6bc48b1b6225a1c696f90_vorticity.pdf",
      "content": "Vorticity in the ocean...\n2.011 Lecture\nApril 13, 2006\nProf. A. Techet\n\nBig whirls have little whirls...\n\"Big whirls have little whirls,\nThat feed on their velocity,\nand little whirls have lesser whirls,\nand so on to viscosity.\"\n-Lewis F. Richardson (1920)\nImage removed for copyright reasons.\n\nWhat is a vortex?\n- Swirling/rotating region of fluid\nUo\nUo\nSwimming Fish Wake\nCylinder Wake\nFigure by MIT OCW.\nFigure by MIT OCW.\n\nTornados and Water Spouts\nCourtesy of U.S. National Oceanic and Atmospheric Administration (NOAA).\n\nVortex Rings and Wake Morphology\nSeveral slides removed for copyright reasons.\n\nVortex Shedding\n- When the flow separates vortices are shed\nin the wake.\n- Vortices are small \"eddies\" that result in a\nforce on the body.\n- Recall vorticity is defined as the curl of the\nvelocity field:\nV\nω = ∇×\nJK\nJK\n\nClassical Vortex Shedding\nVon Karman Vortex Street\nl\nh\nAlternately shed opposite signed vortices\n\nVortex shedding results from a wake\ninstability\nSequence of six photos removed for copyright reasons.\n\nDiagrams of vortex structure due to Flapping (birds, fish), Undulating (eels), and Paddling (frogs) - removed for copyright reasons.\n\nFigure removed for copyright reasons.\nSource: Figure 1 in Dabiri, J. O., and M. Gharib. \"Vortex motion in the ocean: in situ visualization of jellyfish swimming and feeding flows.\"\nPhysics of Fluids 17 (2005): 91-108. Available at http://dabiri.caltech.edu/publications/9.pdf.\n\nGoverning Equations\n- Continuity equation (conservation of mass)\n- Navier-Stokes equations (F= ma)\n- Vorticity:\nu\nv\nw\nx\ny\nz\n∂\n∂\n∂\n∇⋅\n=\n+\n+\n=\n∂\n∂\n∂\nV\ncoriolis\nD\np\nF\nDt\nν\nρ\n= -\n∇+ ∇\n+\n+\nV\nV\ng\nK\nK\nω ≡∇×V\nθ\nr\n\nIrrotational Fluid\n- For irrotational flow the average angular velocity of every\nfluid particle is everywhere zero.\n- This does not mean that the flow cannot be rotating in\ngeneral, relative to some reference frame - just that the\nparticles themselves are not rotating.\nˆ\nˆ\nˆ\ni\nj\nk\nx\ny\nz\nu\nv\nw\nω\n∂\n∂\n∂\n≡∇×\n=\n=\n∂\n∂\n∂\nV\nˆ\nˆ\nˆ\n(\n)\n(\n)\n(\n)\nw\nv\nu\nw\nv\nu\ni\nj\nk\ny\nz\nz\nx\nx\ny\nω\n∂\n∂\n∂\n∂\n∂\n∂\n=\n-\n+\n-\n+\n-\n=\n∂\n∂\n∂\n∂\n∂\n∂\nVorticity\n\nVortex Velocity\n-\nLooking at the curl of the velocity, for a two-dimensional flow field, where x\nis the horizontal axis and y is the vertical axis, we can show that equation\nsimply reduces to\n-\nPlot of velocity as a function of radius from the vortex center. At the core of\nthe potential (inviscid) vortex the velocity blows up to infinity and is thus\nconsidered a singularity.\n-\nThis is not true in a real, or viscous, fluid. Viscosity prevents the fluid\nvelocity from becoming infinite at the vortex core and causes the core rotate\nas a solid body. The flow in this core region is no longer considered\nirrotational.\nˆ(\n)\nv\nu\nk\nx\ny\nω\n∂\n∂\n=\n-\n=\n∂\n∂\nu\nv\ny\nx\n∂\n∂\n=\n∂\n∂\nr\nUθ\n\nFish Vortex Wake\nFigures removed for copyright reasons.\nSource: paper by Nauen and Lauder, 2002.\n\nTurbulence\n- Turbulence is the irregular, random component of fluid\nmotion.\n- Its spatial scales are usually the smallest scales of the\nflow (from 0.01 to 10-meter overturning motions that\nresult in vertical transport and mixing)\n- Our conceptual framework for understanding turbulence\nis largely statistical.\n- Turbulent motions in a stratified fluid (layered fluid of\ndifferent densities) mix fluid parcels from different parts\nof the flow, thereby enhancing mixing across\nconcentration gradients by molecular diffusion.\n- Oceanographers want to know the end result: the rate at\nwhich the ocean is mixed.\n\nSources of Turbulence\nCourtesy of Annual Reviews. Used with permission.\n\nFigure removed for copyright reasons.\nSource: Figure 2a in Dickey, T. \"Emerging ocean observations for interdisciplinary data assimilation systems.\"\nJournal of Marine Systems 40-41 (April 2003): 5-48.\n\nEvidence of \"Coherent Structures\" in the\nOcean\nSeveral photos removed for copyright reasons.\nGulf Stream - Spiral Eddies\nGreek Islands - Spiral Eddies and Wakes\nGulf Stream - Shear zone and associated cold core eddies, shown by plankton bloom\n\nKarman vortices over the Aleutian islands in Alaska, viewed in infrared bands.\nVorticity in the Atmosphere\nCourtesy of U.S. Geological Survey (USGS).\n\nRegions of strong vorticity are associated with\nupwelling and downwelling and high plankton\nactivity\nFigure removed for copyright reasons.\n\nLarge Eddies\n-\nThe technique (subsequently termed the large-eddy technique)\nwhich will be implemented here originates in simple scaling analysis\nof the turbulent kinetic energy equation (Taylor 1935: Tennekes and\nLumley 1972).\n-\nIf q' and λ are respectively velocity and length scales characteristic\nof the largest energy-containing eddies of a turbulent flow, τ ~ λ / q'\nis the associated large-eddy time scale and\n\nEddy kinetic energy, inferred from three years of TOPEX data. (Figure 2\nin Stammer 1997. J. Phys. Ocean 27, 1743.)\nCourtesy of American Meteorological Society. Used with permission.\n\nTurbulent measurements\n-\nFundamental quantities used in the measurement of oceanic\nturbulence are:\n- ε == the rate of dissipation of kinetic energy per unit mass.\n- It tells us the rate at which energy is converted to heat by friction.\n- χ == the rate of destruction of temperature variance, i.e. the rate at\nwhich temperature gradients are smoothed by molecular diffusion.\n- N, the buoyancy frequency, provides a time scale for many aspects of\nstratified flow.\n- Kolmogorov scale,\nis an important spatial scale\n- It is the smallest scale on which velocity gradients can exist in the face of\nviscous smoothing. (ν is the kinematic viscosity)\n- vk == friction velocity (near the wall)\n- vk = (τ/ρ)1/2 , τ being the surface stress and ρ the fluid's density.\n- κ == vonKarman's constant (κ ~ 0.4 ).\n(\n)\n1/4\n3 /\nη\nυ\nε\n=\n\nOcean Mixing\n- But to understand the mixing, we have to deal with the\nmessiness of turbulence.\n- Turbulent motions are rapidly dissipated in the absence\nof an energy source\n- It is critical that we identify and quantify the sources of\nturbulence.\n- Understanding mixing is especially important for ocean\nmodels designed to predict global circulation, climate\nchange, pollutant dispersal and primary productivity,\n- These models can provide reliable predictions only when\nwe have the capability to quantify the subgrid-scale\neffects of turbulence.\n\nTurbulent Mixing\n-\nWithout turbulence and the mixing it causes, we would not have the\nsame ocean that we do now, nor indeed the same climate.\n-\nTurbulent mixing brings nutrients into the surface layer from below\nso that plankton can grow.\n-\nTurbulence near the surface, driven by surface winds and cooling,\ntransmits heat in and out of the ocean to create the reservoir of heat\nthat governs climate.\n-\nIt is turbulence that diffuses the permanent pycnocline separating\nthe cold bottom waters of polar origin from the atmosphere-\nconnected upper ocean, either directly, or indirectly by local mixing\nfollowed by distribution along isopycnals (surfaces of constant\ndensity).\n-\nTurbulence in the bottom layer affects the deposition, resuspension\nand movement of sediments.\n-\nTurbulence creates micro-environments for the small creatures that\nform the basis for life in the oceans."
    },
    {
      "category": "Resource",
      "title": "intro1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/412cb4e73f8fde4b1324a06198279335_intro1.pdf",
      "content": "2.011 Intro. to Ocean Science\nand Engineering\nProf. Alexandra Techet\nSpring 2006\n\n2.011 Course Organization\nFirst lab meeting will be held first week of\nclass.\n- 3-2-4 U Spring 2006 T/R 11-12:30p\n- Instructor: Prof. Techet\n- TA\n- Laboratory Session 3-5p;\n- 2 In-Class Exams: 40% Grade\n- Labs/Projects: 40% Grade\n- HW: 20% Grade\n\nHOMEWORK\n-\nmaterials. The necessary knowledge will come\nfrom the text or selected readings (on-line or\nconcepts that will not necessarily be covered in-\ndepth in lecture. This material will be covered on\nthe exams however.\n-\nthe material one step further and may on\noccasion not have a definite or single correct\nsolution.\nPortions of the HW will preview upcoming lecture\nclass handouts). These will typically cover basic\nThe remainder of the HW assignments will take\n\nLaboratories\nin Ocean\nEngineering Teaching Laboratory\nexperimentation and design for the ocean\nenvironment.\ninstruments and report your findings back\nto the class.\n- Labs will meet\n- Safety FIRST!\n- Labs will be a combination of\n- You will design, build, and test your\n\nINTRO TO OCEAN SCIENCE AND\nENGINEERING\n- TOPICS INCLUDE\n- Physical Oceanography\n- Oceangoing vehicles\n- Hydrostatics\n- Measuring the ocean\n- Sound propagation in the Ocean\n\nTHIS WEEK\n-\n-\n-\n-\n-\nSEE MIT Server FOR MORE DETAILS.\n- Next Week:\n-\n-\nMIT Server.\n-\nLectures T/R 11-12:30 - No Lab this week\nReadings: Chapters 1-4 in Stewart.\n-\nHW #1\n\nDUE NEXT WEDNESDAY IN LAB (2/15)\nResearch ONE underwater vehicle (see list next slide)\nPrepare 5 minutes (2-3max powerpoint slides) about it's main\nmission, any special design considerations (pros/cons),\nhistory, any suggestions for making it a better vehicle... You\nwill present your slides to the class in the first lab on 2/15.\nHW #2 out Tuesday\nLab Wednesday, UPLOAD PPT files to\nReadings: Stewart CH 4-5.\n\nVehicle List Assignment #1\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\n-\nWHOI\n-\nMBARI\n-\n-\nOCEANEERING\n-\n-\nMIT SeaGrant\n-\nChoose from this list of vehicles. Only one student per vehicle.\nAlvin I (WHOI)\nABE (WHOI)\n\nRemus\n\n(WHOI)\n\nOdessey II b/c/ or d (MIT SeaGrant)\nVentana\n\n(MBARI)\n\nTiburon (MBARI)\n\nMillenium ROV (Oceaneering)\nHydra Magnum (Oceaneering)\nBluefin-21 BPAUV ((Bluefin Robotics)\nBluefin Glider - SPRAY (Bluefin Robotics/Scripps/WHOI)\nSlocum Glider (Webb Research Corp.)\nTheseus AUV (International Submarine Engineering Ltd. (ISE) )\nDorado AUV International Submarine Engineering Ltd. (ISE)\nWebsites:\nWebb Research Corp.\nInternational Submarine Engineering Ltd. (ISE)\nBluefin Robotics\n\nI.\nWHAT'S SO COOL ABOUT\nTHE OCEAN?\n\nWater covers 71% of the earth\nThe Oceans represent\n97% of the total water\non earth\n\nWhy study Ocean Science and\nEngineering?\n☺\ncontrol, environment/weather, fuel (gas,\noil, alternate energy)\nneed to understand it through\noceans, so MEASUREMENTS are a priority!\n- It's cool...\n- Food, Water, Global Warming, Pollution\n- To operate in the marine environment we\n- Measurements (instruments, data)\n- Modeling (math, theory)\n- Simulations (numerical, computational)\n- To do all this we need actual DATA about the\n\nCool Creatures in the Ocean\nPhotos removed for copyright reasons.\n\nHistorically Speaking...\n-\n- First submarine?\n-\ndiscovered more than 4,700 new\n(1872-1876)\n-\n(\n)\nWant more?\nPhoto of Trieste II (DSV-1) removed for copyright reasons.\n- Ocean Observations and measurements\nFirst Recorded Depth Soundings and Sea Floor Samples?\nHMS Challenger\nspecies of marine life, including deep-sea organisms\nBathyspheres\n» History of the Trieste\nhttp://www.bathyscaphtrieste.com/\nhttp://www.ocean.udel.edu/deepsea/level-2/tools/history.html\nhttp://www.ocean.udel.edu/deepsea/Resources/8pg%20for%20print--Final.pdf\n\nAUV, ROV, or UUV?\nl\nREMUS\nJASON\nNew ALVIN concept drawing\ni\nl\nhttp://www.whoi.edu/science/AOPE/dept/OSL/remus.html\nhttp://www.whoi.edu/marine/ndsf/vehicles/jason/index.htm\nhttp://www.who .edu/marops/vehicles/newa vin/index.html\nCourtesy of Woods Hole Oceanographic Institution. Used with permission.\nNew Alvin illustration by E. Paul Oberlander, Woods Hole Oceanographic Institution.\nJason photo by Dan Fornari, Woods Hole\nOceanographic Institution.\nRemus photo by Tom Kleindinst, Woods Hole Oceanographic Institution.\n\nII.\nWHAT LIMITS OUR\nDESCENT TO THE DEPTHS\nOF THE OCEAN?\n\nHumans in the Sea\n- How deep can we go?\n- The deepest recorded dive\n- The deepest recorded dive\nby a scuba diver is 145\n-\nenable divers to reach\ndepths up to about 600\nsuits feature thruster\npacks that can boost a\nunderwater.\nPhoto removed for copyright reasons.\nSee http://www.achievement.org/autodoc/photocredit/achievers/ear0-004\nby a skin diver is 127\nmeters (417 ft).\nmeters (475 ft).\nRevolutionary diving suits,\nsuch as the \"jimsuit,\"\nmeters (2,000 ft). Some\ndiver to different locations\n\nChallenge:\n- What is the best shape for an AUV Design?\n- Consider:\n- How does your choice depend on what the\nmission/purpose/use of the AUV is?\n- How does depth play a role?\n- Other design issues?\n\nFeeling the Pressure Yet?\n- Why do my ears pop when I dive deep?\n\nPressure increases with depth\ng\ndz\ndp\nρ\nAbsolute\nPressure\n(\n)\nh\np\np\na\n-\n-\nρ\nGauge\nPressure\n)\n(\nz\np g\n-\n= ρ\nPressure is isotropic.\n- Hydrostatic Pressure\n- Pressure on a vertical wall:\n-\n=\nz\ng\n-\n=\nh\ng\nFOR MORE DETAILS WITH THE DERIVATION OF THE HYDROSTATIC EQUATION,\nSEE THE READING ON PRESSURE POSTED ON THE CLASS WEBPAGE\n\n- The buoyant force is equal to the weight of the\ndisplaced fluid.\nPressure, p\nx\nz\nD\nL\nM\nFz = ρ*L*D*W = ρ * Volume\nW\nArchimedes' Principle\n\nPressure on a sphere at depth?\nPressure acts normal to the surface. By convention pressure is positive in\ncompression. The total force is the integration of the ambient pressure over\nthe surface area of the sphere.\nˆ\nS\nF =\n⋅\n∫∫ p\n\nn dS\n\nBulk Modulus\n- If you are designing things that will go underwater or into\nthe air, where the water pressure, or the air pressure will\nacts on them from all sides, you have to worry about\nchanges in length in all three dimensions, which is actually\na change in volume.\n- Here, we define a bulk modulus, B, such that\n\n1.01 x 10 5\n2, CO2\nGases\n2.5 x 10 9\nMercury\n1.0 x 10 9\n2.0 x 10 9\n80 x 10 9\n15 x 10 9\n10 x 10 9\ngrain )\n45 x 10 9\n45 x 10 9\nGranite\n70 x 10 9\n50 x 10 9\nMarble\n14 x 10 9\n20 x 10 9\n70 x 10 9\n25 x 10 9\n70 x 10 9\n80 x 10 9\n35 x 10 9\n100 x 10 9\n140 x 10 9\n80 x 10 9\n200 x 10 9\n90 x 10 9\n40 x 10 9\n100 x 10 9\nIron, cast\nSolids\n2 )\n2 )\n2 )\nMaterial\nMaterial Properties\nAir, He, H\nAlcohol (ethyl)\nWater\nLiquids\nBone (limb)\n5 x 10\nNylon\n1 x 10\n(perpendicular\nto grain)\n(parallel to\nWood (pine)\nBrick\nConcrete\nAluminum\nBrass\nSteel\nBulk Modulus\nB ( N/m\nShear Modulus\nG ( N/m\nElastic Modulus\nE ( N/m\n\nCompression at Depth\n-\none place it is nearly seven miles beneath the surface of\nthe water. The water pressure at the bottom of the trench\nis enormous, being about ∆P = 1.1 x 108 Pa greater than\nof volume V0\nto the bottom of the trench. What is the change ∆V in the\nvolume of the ball when it reaches the bottom?\nThe Mariana trench is located in the Pacific Ocean, and at\nthe pressure at the surface of the ocean. A solid steel ball\n= 0.20 m is dropped into the ocean and falls\n\nBathysphere Physics\n-\n(B =1.6x1011\n2)\nPhoto removed for copyright reasons.\nEngineer Otis Barton with a replica of his steel bathysphere.\nThe American naturalist Charles William Beebe (1877-1962) set a\nworld record in 1934 when he made a dive to a depth of 923 m\nbelow the surface of the ocean. The dive was made in a device\nknown as the bathysphere, which was basically a steel sphere\n4.75 ft in diameter. How much did the volume of the sphere\nchange as it was lowered to its record depth?\nN/m\n\nDeepest Depths?\nIslands at 11°21′N, 142°12′E, near\nGuam.\nThe trench has a maximum depth of\n10,911 m (35,798 feet) below sea\nlevel, called\nOn 23 January 1960, the US Navy\nBathyscaphe Trieste descended to\nCourtesy of U. S. Navy.\nMap showing location of Mariana Trench removed for copyright reasons.\n- Mariana Trench\nIt is located east of the Mariana\nChallenger Deep.\nthe ocean floor in the trench.\n\nSeafloor Topology\nHydrothermal vents\nmid-ocean ridges\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\nare found along\nNOAA Pacific Marine\nPlease see: http://www.pmel.noaa.gov/vents/multimedia.html\nEnvironmental Laboratory's\nVents Program.\nCredit:\n\nOcean Floor\nrequire mapping for navigation and ocean\nmodeling\nfloor\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n- Geological formations on the ocean floor\n- How do we map the sea floor?\n- Satellite Altimetry Data\n- Acoustic scattering off the sea\n- Depth Sounding\n\nSatellite Altimetry Data\nof the Sea Floor\nl\nImage removed for copyright reasons.\nSmith, Walter H.F., and David T. Sandwel , \"Global Sea Floor Topography from Satellite Altimetry and Ship Depth\nSoundings\", Science, 277, 1956-1962, 1997.\n\nThe Earth and The Ocean\nminor axis.\n- Requator = 6,378.1349 km\n- Rpolar = 6,356.7497 km\n- Req > Rp\na\nb\n- The earth is an oblate ellipsoid\n- Ellipse: minor/major axes (a/b)\n- Oblate ellipsoid: ellipse rotated about\n\nLatitude and Longitude\n-\n111*cos φ\n- φ = degrees latitude\nCourtesy of NASA.\n- Latitude (equator)\n- Longitude (N-S)\n1 degree Latitude = 111 km\n- 1 degree Longitude =\n\nEarth's Rotation\n-\n-\nsidereal period (which means the period relative to\nstars). The sidereal period is not exactly equal to a day because by the\nbefore the Sun seems to be back in the same place in the sky that it\nwas in exactly a day before.\n-\nsidereal day.\n- The speed due to rotation at any other point on the Earth\ncan be calculated by multiplying the speed at the equator\nby the cosine of the latitude of the point.\nThe Earth rotates once in a few minutes\nunder a day (23 hours 56 minutes 04. 09053 seconds).\nThis is called the\ntime the Earth has rotated once, it has also moved a little in its orbit\naround the Sun, so it has to keep rotating for about another 4 minutes\nAn object on the Earth's equator will travel once around the\nEarth's circumference (~40,075.036 kilometers) each\n\nIs the Rotation Slowing?\n-\n0.005 seconds per year per year. This\nextrapolates to the earth having a fourteen-hour\nday 4.6 billion years ago, which is entirely\npossible.\n-\nhigher than average because the present rate of\nspin is in resonance with the back-and-forth\nmovement of the oceans.\n- Weather events can affect the earth's rotation\n(e.g. El Nino)\nThe earth's rotation is slowing at a rate of about\nThe rate at which the earth is slowing today is\nhttp://www.talkorigins.org/indexcc/CE/CE011.html\n\nDo winds affect the earth's spin rate?\n-\nearth rotation, you have to consider the ice\nskater on the ice doing a spin. If she\nchanges how far our she holds her hands\nspins.\n-\nearth, and their distance from the earth's\ncenter by a few miles, and they also carry\nthousands or even millions of tons of air in\nclouds.\n- It is easy to understand from this how, with\nconservation of angular momentum, the\nTo understand how air currents can affect\nby just a little, it affects how rapidly she\nAir currents change their location on the\nearth's spin is constantly changing.\nVertical Axis\nSkater\nFigure by MIT OCW.\n\nThree Major Oceans\n-\n-\n-\n-\n-\nare considerably \"thin\"\n-\nvelocity\nP\nA\nI\nAtlantic, Pacific, Indian\nRest are seas, e.g.\nMediteranean Sea\nMarginal Seas (Arabian Sea, S. China Sea)\n- Black Sea\nAspect Ratio (width to depth) is large & oceans\nVertical velocity can be < 1% of horizontal\n- SCALING!!\n\nVertical Exaggeration is 180:1\nVertical Exaggeration is 30:1\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nMajor Currents\nCourtesy of U.S. Navy.\n\nInteresting Articles and Websites\n-\n\"GET TO THE BOTTOM\nOF THINGS\"\n01/06\n-\n-\n-\nUNDERSEA TECHNOLOGIES HELP NOAA\nhttp://www.magazine.noaa.gov/stories/mag187.htm\nTHE GLOBAL EARTH OBSERVATION SYSTEM REVOLUTIONIZING\nOUR UNDERSTANDING OF HOW EARTH WORKS\nhttp://www.noaa.gov/eos.html\nEARTH OBSERVATION SUMMIT\nhttp://www.earthobservationsummit.gov/\nNOAA SATTELITE AND INFORMATION SERVICE\nhttp://www.nesdis.noaa.gov/"
    },
    {
      "category": "Resource",
      "title": "intro2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/92b05856ec9b5571b7b2f0377a284017_intro2.pdf",
      "content": "2.011 Intro. to Ocean Science\nand Engineering\nProf. Alexandra Techet\nSpring 2006\nLecture 3 (14 Feb 06)\n\nIII.\nWHAT DON'T WE KNOW?\n\nA LOT!\nneed to understand it better through\nthe oceans, so MEASUREMENTS are a\npriority!\n- To operate in the marine environment we\n- Measurements (instruments, data)\n- Modeling (math, theory)\n- Simulations (numerical, computational)\n- To do all this we need actual DATA about\n\nMeasurements in the Ocean\nmake?\nmeasurements?\n- What do we want to measure?\n- What types of measurements can we\n- How many measurements do we need?\n- How often should we make the\n\nTypes of Measurements\n- Point vs. Whole field\n- Spatial vs. Temporal\n- Average vs. Fluctuating\n- Steady vs. Unsteady\n\nwave. How often do we need to\nsample it to figure out its\nfrequency?\nwe can think it's a constant.\nwe can think it's a lower frequency\nsine wave.\nRate, we start to make some\nprogress. An alternative way of\nviewing the waveform\n(re)genereation is to think of\nstraight lines joining up the peaks\nof the samples. In this case (at\nthese sample points) we see we\nstart crudely approximating a sine\nwave.\n(1)\n(2)\n(3)\n(4)\n1. Suppose we are sampling a sine\n2. If we sample at 1 time per cycle,\n3. If we sample at 1.5 times per cycle,\n4. Now if we sample at twice the\nsample frequency, i.e Nyquist\nget a sawtooth wave that begins to\n\n-\nat least\ntwice\nNyquist rate\nFor lossless digitization, the sampling rate should be\nthe maximum frequency responses. Indeed many times\nmore the better.\n\nTypes of Measurements\n- Point vs. Whole field\n- Spatial vs. Temporal\n- Average vs. Fluctuating\n- Steady vs. Unsteady\n\nAccuracy of Measurements\n-\n-\n-\n-\n-\n-\n-\n-\nnd ed., University\nScience Books, 1996.\nStatistics\nMean, Standard Deviation,\nRMS, Variance\nCorrelation\n- Accuracy\nSample Error\nMeasurement/Instrument Error\nExcellent reference (text) on error analysis\nTaylor, John R. An Introduction to Error Analysis, The Study of\nUncertainties in Physical Measurements, 2\n\nMean & Standard Deviation\ngreen) account for 99.73%.\nDark blue is less than one standard deviation from the mean. For the normal distribution, this accounts\nfor 68.26% of the set. For the normal distribution, two standard deviations from the mean (blue and\nbrown) account for 95.46%. For the normal distribution, three standard deviations (blue, brown and\nCourtesy of Wikipedia.\n\nLinearity of Measurements\ny = m*x + b\n- Linear Fit:\n- Signal Drift:\n\nExisting Types of Data\n- Visual (sea surface height)\n- Buoys and Observatories\n- Cruise\n- Satellite\n- Depth profiles\n- Temperature\n- Salinity (saltiness of the water)\n- Pressure (depth)\n\nShip Cruises vs. Observatories\n- http://www.orionprogram.org/\n-\n(ORION) is a program that focuses the science, technology,\neducation and outreach of an emerging network of science\noceanography is commencing a new phase in which\nresearch scientists increasingly seek continuous interaction\nwith the ocean environment to adaptively observe the\nearth-ocean-atmosphere system. Such approaches are\ndirectly impact human society, our climate and the\nincredible range of natural phenomena found in the largest\necosystem of the planet.\nThe Ocean Research Interactive Observatory Networks\ndriven ocean observing systems. Building on the heritage of\nthe ship-based expeditionary era of the last century,\ncrucial to resolving the full range of episodicity and\ntemporal change central to so many ocean processes that\n\nOOI Goals\n-\nexpected to meet most of the following goals:\n- continuous observations at time scales of seconds to decades\n- spatial measurements from millimeters to kilometers\n- sustained operations during storms and other severe conditions\n- real-time or near-real-time data as appropriate\n-\n-\n- standard Plug-n-Play sensor interface protocol\n-\nrecharge\n-\nof specific observatories\n-\n-\n-\n-\nA fully operational research observatory system would he\ntwo-way transmission of data and remote instrument control\npower delivery to sensors between the sea surface and the seafloor\nautonomous underwater vehicle (AUV) dock for data download/battery\naccess to deployment and maintenance vehicles that satisfy the needs\nfacilities for instrument maintenance and calibration\na data management system that makes data publicly available\nan effective education and outreach program\n\nLACK OF SUFFICIENT\nSAMPLES IS THE LARGEST\nSOURCE OF ERROR IN OUR\nUNDERSTANDING THE\nOCEAN.\n\nIV.\nThe Atmosphere and\nThe Ocean\n\nAtmospheric Effects on the Ocean\n-\n-\nocean\nCourtesy of Prof. Robert Stewart. Used with permission.\nWeather: storms, winds, temperature\nSunlight is the main driving energy source for the\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nHurricanes\nHurricane Mitch 1998\nKatrina (2005)\nhttp://www.osei.noaa.gov/mitch.html\nhttp://www1.ncdc.noaa.gov/pub/data/images/hurr-katrina-poster-8x10.jpg\n\nWaves\nPhotos removed for copyright reasons.\n\nFigure 1. Wave energy spectra. Red text indicates wave generation mechanisms and blue text indicates damping/\nrestoring forces.\n\nCauses of Ocean Waves\n- Wind blowing across the ocean surface\n-\n-2 to 102 Hz\n-\n-\n-\n-4 to 10-6 Hz\n-\n-\n-\n-2 Hz\n- Long wave period\nFrequency f =10\nPeriod T = 1/f = 0.01 to 100 seconds\nPull of the sun and moon\nFrequency is on the order 10\nPeriod T = 12, 24 hours (tides)\nEarthquakes - e.g. Tsunamis\nFrequency less than 10\n\nWind Effects on the Ocean\nshear\nforce on the ocean surface\nwaves\nthe larger the waves can get. This\ndistance is called fetch.\n- Winds cause waves by generating a\n- Correlation between high wind and high\n- The longer distance wind blows over water\n- Wind also acts to exchange heat.\n\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nWind Patterns\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nCourtesy of JPL.\n\nCourtesy of JPL.\n\nhighest winds\nhighest waves\nwhere the wind speed is also the lowest.\nIn general, there is a high\ndegree of correlation between\nCourtesy of JPL.\nThe\ngenerally occur in the Southern Ocean,\nwhere winds over 15 meters per second (represented by\nred in images) are found. The strongest waves are also\ngenerally found in this region. The lowest winds\n(indicated by the purple in the images) are found\nprimarily in the tropical and subtropical oceans where the\nwave height is also the lowest.\nThe\ngenerally occur in the Southern\nOcean, where waves over six meters in height\n(shown as red in images) are found. The strongest\nwinds are also generally found in this region. The\nlowest waves (shown as purple in images) are found\nprimarily in the tropical and subtropical oceans\nwind speed and wave height.\nCourtesy of JPL.\n\nTypes of Forces Due to Fluid Flow\nSkin Friction\nDrag: Cf\nForm Drag: CD\ndue to pressure\n(turbulence,\nseparation)\nStreamlined bodies reduce separation, thus reduce form drag.\nBluff bodies have strong separation thus high form drag.\nlaminar\nturbulent\n\nBoundary layer development\nNO SLIP CONDITION: requires that the velocity of the fluid at the wall matches\nSince the velocity away from the wall is much faster a velocity gradient results in\nthe boundary layer region since fluid is a continuous medium. In this region\nviscosity plays a strong role.\nity gradient near the\nboundary due to the NO-SLIP condition.\nw\ny\nu\ny\nτ\nμ\n=\n∂\n=\n∂\nWall shear stress:\nthe velocity of the wall, such that it does not \"slip\" along the boundary.\nFlow over a flat surface causes a veloc\n\nThe transfer of momentum between the fluid particles slows the flow down\ncausing drag on the plate.\nFriction Drag\n[\n]\n[\n]\nf\nw\nF\nC\nU A\nρ\n-\n-\n=\nFriction Drag Coefficient:\nunits\nThis drag is referred to as friction drag.\nMLT\nMLT\n\nBoundary Layer\ny\na\nd\nU0\nU0\nu(y)\nx\nL\nj\ny = h\nPlate of width b\nBoundary layer\nwhere shear stress\nis significant\np = p\ny =\nStreamline ust outside\nthe shear-layer region\nOncoming\nstream\nparallel to\nplate\nFigure by MIT OCW.\n\nAs a boundary layer on a plate grows its thickness increases\nwith distance, x. The Reynolds number of a boundary layer is\ndefined as\nRe = Ux/ν\nBoundary Layer Growth\nPhoto removed for copyright reasons.\n\nsymmetrical profile.\nshown above.\nTowards\nBoundary layer growth\nBoundary layers develop along the walls in\npipe flow. A cross sectional view shows the\nlayer at the top and the bottom creating a\nThe flow in the middle is\nfastest since it has not been slowed by the\nmomentum transfer in the boundary layers.\nBoundary layers develop along the aerofoil\nThe velocity profile changes\nshape over the curved leading edge.\nthe trailing edge the flow tends to separate as\na result of an adverse pressure gradient.\nCourtesy of IIHR - Hydroscience & Engineering, University of Iowa. Used with permission.\n\nThis picture is a side view of the large eddies in a turbulent\nboundary layer. Laser-induced fluorescence is again used to\nleft to right.\nTurbulent Boundary Layers\nCourtesy of Prof. M. Gad-el-Hak. Used with permission.\ncapture the quasi-periodic coherent structures. Flow is from\n\ninduced fluorescence is used to visualize the streaks.\nTurbulent Wall Boundary Layer\n(Top View)\nCourtesy of Prof. M. Gad-el-Hak. Used with permission.\nThis picture is a top view of the near-wall region of a turbulent boundary layer\nshowing the ubiquitous low-speed streaks. Flow is from left to right and laser-\n\nTurbulent vs. Laminar\nBoundary Layers:\nIt can be seen from these\nplots that the two\nboundary layers have\nquite different shapes.\nw\ny\nu\ny\nτ\nμ\n=\n∂\n=\n∂\nWall shear stress:\nU/Ue\n/s;\nTurbulent\nTransitional\n0.01\n0.02\n0.03\nx = 5.25 ft\nx = 5.75 ft\nx = 8.00 ft\nU = 89 ft\nair flow\ny, ft\n0.04\n0.05\n0.06\n0.2\nLinear profile\nvery near wall\nLaminar\nTurbulent\n0.4\n0.6\n0.8\nFigure by MIT OCW.\n\nViscous Drag\nSkin Friction\nDrag: Cf\nForm Drag: CD\ndue to pressure\n(turbulence,\nseparation)\nStreamlined bodies reduce separation, thus reduce form drag.\nBluff bodies have strong separation thus high form drag.\nlaminar\nturbulent\n\nDrag Coefficient\n-\nbody due to viscous\neffects:\nD is often\nfound empirically\n(through\nexperimentation)\n- CD is dependent on\nReynolds number (ie.\nvelocity, geometry,\nand fluid viscosity)\nand is quite different\nin laminar vs.\nturbulent flows\nD\nD\nF\nC\nρ\n=\nD\nD\nF\nC\nU A\nρ\n=\nDrag Force on the\n- Where C\nAU\n\nCylinder Drag Coefficient\nGraph removed for copyright reasons.\n\nFlat Plate Friction Coefficient\nGraph removed for copyright reasons.\n\nSphere Drag Coefficient\nGraph removed for copyright reasons.\n\nWind Stress on Ocean Surface\nshear stress on the surface\n(like friction).\n- U10\nstandard height of a ships mast where\nwind is measured\nUnits [kg/m3 * m2/s2] = [kg/m/s2] = [Force/area]\nCD is a dimensionless parameter (no units)\na\nD\nC U\nτ\nρ\n=\n- Wind causes a\n- Stress is Force per Area:\n- chosen because 10 meters is the\n\nWind Drag Coefficient\n-\nCD (empirical data)\n-\nCD theoretical model\nCourtesy of Prof. Robert Stewart. Used with permission.\nSource: Introduction to Physical Oceanography, http://oceanworld.tamu.edu/home/course_book.htm\n\nWind Generated Waves\n-\nsea state is fully developed.\n-\ndependent on the wind speed due to the dispersion\nrelationship.\n/\n/\nwind\np\nU\nC\nk\ng\nω\nω\n≈\n=\n=\n/\nc\ng U\nω ≈\nLimiting frequency:\n)\ngk\nω =\nDispersion Relation:\nWind blows over long distance and long period time before\nWhen wind speed matches wave crest phase speed the\nphase speed is maximized. Thus the limiting frequency is\nwind\n\ntanh( kH\n\nWind Generated Waves\nEnergy imparted to the fluid by the wind increases proportional to\nthe fourth power of the wind speed!\nDepending on duration and distance (fetch), the waves develop\ninto a fully developed sea.\n(\n)\nFetch\nRipples\nMicro\nripples\nChop\nFully developed\nsea fds\nMaximum\nWind\nFigure by MIT OCW."
    },
    {
      "category": "Resource",
      "title": "hw5_sonar_leonar.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-011-introduction-to-ocean-science-and-engineering-spring-2006/073d1246f6aac0102c6b29e0bfdfa5bc_hw5_sonar_leonar.pdf",
      "content": "INTRODUCTION TO SONAR\nIntroduction to Sonar\nrange\nabsorption\nDI\nTL\nSL\nDT\nNL\nPassive Sonar Equation\nSL -TL -(NL -DI) = DT\nActive Sonar Equation\nRL\nSL\n*\nIceberg\nTL\nTS\nNL\nDI\nDT\nNL -DI\nSL -2TL + TS -(\nRL\n) = DT\n\nINTRODUCTION TO SONAR\n*\nSL\nTL\nNL\nUSA\nDT\nDI\nHawaii\nTomography\nSL -TL -(NL -DI) = DT\nParameter definitions:\n- SL = Source Level\n- TL = Transmission Loss\n- NL = Noise Level\n- DI = Directivity Index\n- RL = Reverberation Level\n- TS = Target Strength\n- DT = Detection Threshold\n\nINTRODUCTION TO SONAR\nSummary of array formulas\nSource Level\n- SL = 10 log\nI\n= 10 log p\np\n(general)\nIref\nref\n- SL = 171 + 10 log P\n(omni)\n- SL = 171 + 10 log P + DI\n(directional)\nDirectivity Index\n- DI = 10 log(ID)\n(general)\nIO\nID = directional intensity (measured at center of beam)\nIO = omnidirectional intensity\n(same source power radiated equally in all directions)\n- DI = 10 log(2\nλ\nL)\n(line array)\n- DI = 10 log((πD\nλ )\n(disc array)\nλ )2) = 20 log(πD\n- DI = 10 log(4πLxLy)\n(rect. array)\nλ2\n3-dB Beamwidth θ3dB\n- θ3dB = ±25.3λ deg.\n(line array)\nL\n- θ3dB = ±29.5λ deg.\n(disc array)\nD\n= ±25.3λ, ±25.3λ\n- θ3dB\nLx\nLy\ndeg.\n(rect. array)\n\nINTRODUCTION TO SONAR\nf = 12 kHz D = 0.25 m beamwidth = +-14.65 deg\nSource level normalized to on-axis response\n-20\n-40\n-60\n-80\n-90\n-60\n-30\ntheta (degrees)\nf = 12 kHz D = 0.5 m beamwidth = +-7.325 deg\n-20\n-40\n-60\n-80\n-90\n-60\n-30\ntheta (degrees)\nf = 12 kHz D = 1 m beamwidth = +-3.663 deg\n-20\n-40\n-60\n-80\n-90\n-60\n-30\ntheta (degrees)\nThis figure shows the beam pattern for a circular transducer for D/λ equal\nto 2, 4, and 8. Note that the beampattern gets narrower as the diameter is\nincreased.\n\n⎡\n⎣\n⎤\n⎡\n⎣\n⎤\nINTRODUCTION TO SONAR\ncomparison of 2*J1(x)/x and sinc(x) for f=12kHz and D=0.5m\n-80\n-70\n-60\n-50\n-40\n-30\n-20\n-10\nSource level normalized to on-axis response\nsinc(x)\n2*J1(x)/x\n-90\n-60\n-30\ntheta (degrees)\nThis figure compares the response of a line array and a circular disc\ntransducer. For the line array, the beam pattern is:\nsin( 1\n2kL sin θ)\nb(θ) =\n⎦\nkL sin θ\nwhereas for the disc array, the beam pattern is\n2J1(1\n2kD sin θ)\nb(θ) =\n⎦\nkD sin θ\nwhere J1(x) is the Bessel function of the first kind. For the line array, the\nheight of the first side-lobe is 13 dB less than the peak of the main lobe.\nFor the disc, the height of the first side-lobe is 17 dB less than the peak of\nthe main lobe.\n\n∼\nINTRODUCTION TO SONAR\nLine Array\nL/2\ndz\nr\nl\nα\nθ\nA/L\nz\nx\n-L/2\nProblem geometry\nOur goal is to compute the acoustic field at the point (r, θ) in the far field of a uniform\nline array of intensity A/L. First, let's find an expression for l in terms of r and θ. From\nthe law of cosines, we can write:\nl2 = r + z2 -2rz cos α.\nIf we factor out r2 from the left hand side, and substitute sin θ for cos α, we get:\n\n2z\nz2\nl2 = r\n1 -\nsin θ +\nr\nr\nand take the square root of each side we get:\n\n2z\nz2\nl = r 1 -\nsin θ +\nr\nr\nWe can simplify the square root making use of the fact:\n(1 + x)p = 1 + px + p(p -1)\n2!\n+ p(p -1)(p -2)\n3!\n+ · · ·\nand keeping only the first term for p = 2:\n(1 + x)\n= 1 +\nx\nApplying this to the above expression yields:\n\n2z\nz2\nl ∼= r 1 +\n(-\nsin θ +\n2 )\nr\nr\n\n⎡\n⎤\nINTRODUCTION TO SONAR\nFinally, making the assuming that z << r, we can drop the term z\nto get\nr2\nl ∼= r -z sin θ\nField calculation\nFor an element of length dz at position z, the amplitude at the field position (r, θ) is:\nA 1\n-i(kl-ωt)dz\ndp =\ne\nL l\nWe obtain the total pressure at the field point (r, θ) due to the line array by integrating:\np = A\nL\nL/2\n-L/2\nl e-i(kl-ωt)dz\nbut l ∼= r -z sin θ, so we can write:\np = A\nLe-i(kr-ωt)\nL/2\n-L/2\nr -z sin θeikz sin θdz\nSince we are assuming we are in the far field, r >> z sin θ, so we can replace\nr-z sin θ with\nr and move it outside the integral:\np = A\nrLe-i(kr-ωt)\nL/2\n-L/2 eikz sin θdz\nNext, we evaluate the integral:\np = A\nrLe-i(kr-ωt)\neikz sin θ\nik sin θ\nL/2\n-L/2\n⎡\n⎤\n2 ikL sin θ -e- 1\n2 ikL sin θ\nA\n-i(kr-ωt)\ne\np =\ne\n⎣\n⎦\nrL\nik sin θ\nNext move the term 1 into the square brackets:\nL\n2 ikL sin θ -e- 1\n2 ikL sin θ\nA\n-i(kr-ωt)\ne\np =\ne\n⎣\n⎦\nr\nikL sin θ\nix\n-ix\ne\n-e\nand, using the fact that sin(x) =\n, we can write:\n2i\n\nA\nsin( 1kL sin θ)\n-i(kr-ωt)\np =\ne\nr\nkL sin θ\nwhich is the pressure at (r, θ) due to the line array. The square of the term in brackets is\ndefined as the beam pattern b(θ) of the array:\nsin( 1kL sin θ)\nb(θ) =\n1kL sin θ\n\nINTRODUCTION TO SONAR\nSteered Line Array\nRecall importance of phase:\n- Spatial phase: kz sin θ = 2\nλ\nπz sin θ\n- Temporal phase: ωt = 2\nT\nπ ; T = f\n-L/2\nL/2\nr\nθ\nA/L\nz\nx\nθ 0\nk sin θ = vertical wavenumber\nk sin θ0 = vertical wavenumber reference\nTo make a steered line array, we apply a linear phase shift -zk sin θ0 to the excitation of\nthe array:\ndp = A/Leiz(k sin θ-k sin θ0)eiωtdz\n(1)\nr\nWe can write\nsin θ0\nzk sin θ0 = ωz\nc\nz sin θ0\nzk sin θ0 = ωT0(z) ; T0(z) =\nc\nThe phase term is equivalent to a time delay T0(z) that varies with position along the line\narray. We can re-write the phase term as follows.\niz(k sin θ-k sin θ0)eiωt\nikz sin θ -iω(t+T0(z))\ne\n= e\ne\nintegrating Equation 1 yields:\n\nA\nsin( kL\n2 [sin θ -sin θ0])\n-i(kr-ωt)\np = r\n(kL\ne\n2 [sin θ -sin θ0])\nThe resulting beam pattern is a shifted version of the beampattern of the unsteered line\narray. The center of the main lobe of the response occurs at θ = θ0 instead of θ = 0.\n\n⎡\nINTRODUCTION TO SONAR\nsteered and unsteered line array (theta_0 = 20 deg)\nSource level normalized to on-axis response\n-10\n-20\n-30\n-40\n-50\n-60\n-70\n-80\nunsteered beam\nsteered beam\n-90\n-60\n-30\ntheta (degrees)\nThis plot shows the steered line array beam pattern\n2 [sin θ -sin θ0])\nsin(kL\n⎤2\n⎣\n⎦\nb(θ) =\n(kL\n2 [sin θ -sin θ0])\nfor θ0 = 0 and θ0 = 20 degrees.\n\n- λ =\nINTRODUCTION TO SONAR\nExample 1: Acoustic Bathymetry\n2θ 3dB\nD = 0.5 m\nGiven:\n- f = 12 kHz\n- Baffled disc transducer\n- D = 0.5 m\n- Acoustic power P = 2.4 W\nSpatial resolution, ε\nε = 2d tan θ3dB\n= d ·\nFor d = 2 km\nε =\nδ =\nCompute:\n- DI =\n- SL =\n- θ3dB =\nDepth resolution, δ\nTF = 2d (earliest arrival time)\nc\nTL = 2r (latest arrival time)\nc\nδ = (TL -TF) · c/2\n= d(cos θ3dB -1)\n= d ·\n\nINTRODUCTION TO SONAR\nExample 2: SeaBeam Swath Bathymetry\n2 degrees\n90 degrees\nTransmit: 5 meter unsteered line array (along ship axis)\nsteered\n\nNo returns\nNo returns\nreturns received\nReceive array: 5 meter\nline array (athwartships)\nonly from +- 2 degrees\n\n2 degrees\nNet beam (plan view)\nShip's\nShip's\nTrack\nTrack\nOne beam,\n2 by 2 degrees\n100 beams, 2 by 2 degrees\n(without steering)\n(with steering)\n\nPROPAGATION PART I: SPREADING AND ABSORPTION\nPropagation Part I: spreading and absorption\nTable of values for absorption coefficent (alpha)\n13.00 Fall, 1999 Acoustics: Table of attentuation coefficients\nfrequency [Hz]\nalpha [dB/km]\n0.003\n15.9\n0.003\n19.8\n0.004\n23.2\n0.007\n26.2\n0.012\n28.9\n0.018\n100000 (100 kHz)\n31.2\n0.026\n47.4\n0.033\n63.1\n0.041\n83.1\n0.048\n0.056\n1000 (1kHz)\n0.063\n0.12\n0.18\n0.26\n1000000 (1 MHz)\n0.35\n0.46\n0.59\n0.73\n0.90\n10000 (10 kHz)\n1.08\n3.78\n7.55\n11.8\nfrequency [Hz]\nalpha [dB/km]\n10000000 (10 MHz)\n\nPROPAGATION PART I: SPREADING AND ABSORPTION\n10-5\n10-2\n10-2\n10-3\nBoron\nMgSO4\nα\nrl, Range in km (from α rl = 10 dB)\n10-1\nStructural\nS = 35\noC\n%\nAbsorption of Sound in Sea Water\nf, Frequency, kHz\n, Absorption in dB/km\nShear Viscosity\nT = 4\nP = 300 ATM\nFigure by MIT OCW.\nAbsorption of sound in sea water\n\n.\n\nPROPAGATION PART I: SPREADING AND ABSORPTION\nAbsorption of sound in sea water\nRelaxation mechanism\n(conversion of acoustic energy to heat)\nFour mechanisms\n- shear viscosity (τ ≈10-12 sec)\n- structural viscosity (τ ≈10-12 sec)\n- magnesium sulfate -- MgSO4 (τ ≈10-6 sec) [1.35 ppt]\n- boric acid (τ ≈10-4 sec) [4.6 ppm]\nRelaxation time, τ\n- if ωτ << 1, then little loss.\n- if ωτ ≈1 or greater, then generating heat (driving the fluid too fast).\nThe attenuation coefficient α depends on temperature, salinity, pressure\nand pH. The following formula for α in dB/km applies at T=4*C, S=35\nppt, pH = 8.0, and depth = 1000 m. (Urick page 108).\n0.1f 2\n44f 2\nα ≈3.0 × 10-3 +\n+\n+ 2.75 × 10-4f 2\n1 + f 2\n4100 + f 2\n\nα =\nPROPAGATION PART I: SPREADING AND ABSORPTION\nSolving for range given transition loss TL\nThe equation\n20 log r + 10-3αr = TL\ncannot be solved analytically. If absorption and spreading losses are\ncomparable in magnitude, you have three options:\n- In a \"back-of-the-envelope\" sonar design, one can obtain an initial\nestimate for the range by first ignoring absorption, then plugging in\nnumbers with absorption until you get an answer that is \"close\nenough\".\n- For a more systematic procedure, one can do Newton-Raphson\niteration (either by hand or with a little computer program), using\nthe range without absorption as the initial guess.\n- Another good strategy (and a good way to check your results) is to\nmake a plot of TL vs. range with a computer program (e.g., Matlab).\nNewton-Raphson method: (Numerical recipes in C, page 362)\nf(xi)\nxi+1 = xi -f ′(xi)\nTo solve for range given TL, we have:\nf(xi) = TL -20 log xi -10-3αxi\nf ′(xi) = -20 -10-3α\nr\nTL =\nx0 =\ni\nxi\n20 log xi\n0.001αxi\nf(xi)\nf ′(xi)\nf(xi)/f ′(xi) xi+1 = xi -f(xi)\nf ′(xi)\n\nλ =\nα =\nα\nPROPAGATION PART I: SPREADING AND ABSORPTION\nExample 1: whale tracking\nL = 2 km\nPassive sonar equation:\nGiven:\n- f0 = 250 Hz\n- DT = 15 dB\n- P = 1 Watt (omni)\n- NL = 70 dB\n- line array: L = 2 km\nQuestion: How far away can we hear the whale?\nTL =\n=\nDI =\nSL =\nTL = 20 log r + α ∗r ∗10-3 =\nRt = 8680 =\nr =\n(w/o absorption)\nr =\n(with absorption)\n\nα\nPROPAGATION PART I: SPREADING AND ABSORPTION\nTL vs range for alpha=0.003 dB/km, f=250 Hz\nTL (dB)\nrange (m)\nFigure 1: TL vs. range for whale tracking example (f=250 Hz, α = 0.003 dB/km).\nf(xi) = TL -20 log xi -10-3αxi =\nf ′(xi) = -20 -10-3α =\nr\nTL\n=\ni\nxi\n20 log xi\n500,000 114\n459,500 13.2\n445,000 112.96\n=\n0.001αxi\nf(xi)\nf ′(xi)\n1.5\n-1.5\n-3.7 × 10-5\n1.38\n-0.6\n-4.05 × 10-5\n1.34\n-0.3\nx0 =\nf(xi)/f ′(xi) xi+1 = xi -f(xi)\nf ′(xi)\n\nλ =\nα =\nα\nPROPAGATION PART I: SPREADING AND ABSORPTION\nL = 1 m\nExample 2: dolphin tracking\nPassive sonar equation:\nGiven:\n- f0 = 125 kHz\n- DT = 15 dB\n- SL 220 dB re 1 μ Pa at 1 meter\n- NL = 70 dB\n- line array: L = 1 m\nQuestion: How far away can we hear (detect) the dolphin?\nTL =\n=\nDI =\nTL = 20 log r + α ∗r ∗10-3 =\nRt = 8680 =\nr =\n(w/o absorption)\nr =\n(with absorption)\nr =\n(w/o spreading)\nf(xi) = TL -20 log xi -10-3αxi =\n\nα\nPROPAGATION PART I: SPREADING AND ABSORPTION\nTL vs range for alpha=30 dB/km, f=125 kHz\nTL (dB)\nrange (m)\nFigure 2: TL vs. range for dolphin tracking example (f=125 kHz, α = 30 dB/km).\nf ′(xi) = -20 -10-3α =\nr\nTL\n=\ni\nxi\n20 log xi\n69.6\n69.35\n=\n0.001αxi\nf(xi)\n-67\n90.9\n-3.5\n88.05\n-0.4\nf ′(xi)\n-0.034\n-0.037\n-0.368\nx0 =\nf(xi)/f ′(xi) xi+1 = xi -f(xi)\nf ′(xi)\n10.9\n\nPROPAGATION PART II: REFRACTION\nPropagation Part II: refraction\nIn general, the sound speed c is determined by a complex relationship\nbetween salinity, temperature, and pressure:\nc = f(S, T, D)\nMedwin's formula is a useful approximation for c in seawater:\nc = 1449.2 + 4.6T -0.055T 2 + 0.00029T 3\n+(1.34 -0.010T)(S -35) + 0.016D\nwhere S is the salinity in parts per thousand (ppt), T is the temperature in\ndegrees Celsius, and D is the depth in meters. (See Ogilvie, Appendix A.)\nPartial derivatives:\n∂c\n∂c\n∂c\n= 4.6 m/sec/C*\n= 1.34 m/sec/ppt\n= 0.016 m/sec/m\n∂T\n∂S\n∂D\nFor example:\n- ∆T = 25*=⇒∆c = 115 m/sec\n- ∆S = 5 ppt =⇒∆c = 6.5 m/sec\n- ∆D = 6000 m =⇒∆c = 96 m/sec\nsound speed\nD\nS\nT\nz\nc\nc\ndepth\n\nPROPAGATION PART II: REFRACTION\nSound across an interface\ny\nx\nθ2\nθ1\nθ1\nk = ω/c\nk = ω/c\nρ , c\nρ , c\np\np\np\ni\nr\nt\np1 = pi + pr = Ie-i(k1x cos θ1+k1y sin θ1) + Re-i(-k1x cos θ1+k1y sin θ1)\np2 = pt = Te-i(k2x cos θ2+k2y sin θ2)\nAt x = 0, we require that p1 = p2 (continuity of pressure)\n(I + R)e-ik1y sin θ1 = Te-ik2y sin θ2\nMatch the phase to get Snell's law:\nsin θ1\nsin θ2\n=\nc1\nc2\n\nPROPAGATION PART II: REFRACTION\nIf c2 > c1, then θ2 > θ1\ny\nx\nθ1\npi\nt\nc1\nc2\npt\nθ2\nIf c2 < c1, then θ2 < θ1\ny\nx\nθ2\nθ1\np\np\ni\nt\nc2\nc1\nSound bends towards region with low velocity\nSound bends away from region with high velocity\n\nREFLECTION AND TARGET STRENGTH\nReflection and target strength\nInterface reflection\nx\ny\np\ntp\nrp\ni\nθ\nθ\nθ2\nρ c\nρ c\npi = Ieiωt -i(k1x sin θ1-k1y cos θ1)\ne\npr = Reiωt -i(k1x sin θ1+k1y cos θ1)\ne\npt = Teiωt -i(k2x sin θ2-k2y cos θ2)\ne\n\nREFLECTION AND TARGET STRENGTH\nBoundary condition 1: continuity of pressure:\n@ y = 0\np1 = pi + pr = pt = p2\nBoundary condition 2: continuity of normal particle velocity:\n@ y = 0\nv1 = vi + vr = vt = v2\nMomentum equation\n∂v = -1\n∂p\n·\n∂t\nρ\n∂y\nbut\n∂v\n∂t = iωv\n(since v ∝eiωt)\n=⇒v = i ∂p\nωρ∂y\nContinuity of pressure:\npi |y=0 + pr |y=0 = pt |y=0\n(I + R)e-ik1x sin θ1 = Te-ik2x sin θ2\n(I + R)e\n= Te\n-iωx\n-iωx\nsin θ1\nsin θ2\nc1\nc2\nAnd so using Snell's law, we can write:\nI + R = T\n(2)\nContinuity of normal velocity:\ni\ncos θ1\nωρ1\nρ1c1\nvi =\n· ik1 cos θ1pi = -\npi\n\nREFLECTION AND TARGET STRENGTH\ncos θ1\nvr = ρ1c1\npr\nvt = -\npt\ncos θ2\nρ2c2\nvi |y=0 + vr |y=0 = vt |y=0\nρ2c2 cos(θ1)(I -R) = ρ1c1 cos(θ2)T\n(3)\n\nREFLECTION AND TARGET STRENGTH\nWe can solve Equations 1 and 2 to get the reflection and\ntransmission coeficients R and T :\nR\nρ2c2 cos θ1 -ρ1c1 cos θ2\nR =\n=\nI\nρ2c2 cos θ1 + ρ1c1 cos θ2\nT\n2ρ2c2 cos θ1\nT =\n=\nI\nρ2c2 cos θ1 + ρ1c1 cos θ2\nRecall that given θ1, we can compute θ2 with Snell's law:\nsin θ1\nsin θ2\n=\nc1\nc2\nSpecial case: θ = 0 (normal incidence)\nρ2c2 -ρ1c1\nZ2 -Z1\nR =\n≡\nρ2c2 + ρ1c1\nZ2 + Z1\n2ρ2c2\n2Z2\nT =\n≡\nρ2c2 + ρ1c1\nZ2 + Z1\nwhere Z = ρc is defined as the acoustic impedance.\n\nREFLECTION AND TARGET STRENGTH\nExample 1: source in water\nx\ny\ntp\nθ1\nAir\nWater\nθ1\nθ2\nr\np\np\ni\nρa = 1.2 kg/m3, ca = 340 m/sec =⇒Za = 408 kg/m2s\nρw = 1000 kg/m3, cw = 1500 m/sec =⇒Zw = 1.5 × 106 kg/m2s\n408 cos θ1 -1.5 × 106 cos θ2\nR =\n≈-1\n408 cos θ1 + 1.5 × 106 cos θ2\nT = 1 + R ≈0\n(no sound in air)\n\nREFLECTION AND TARGET STRENGTH\nExample 2: source in air\nx\ny\np\ntp\nrp\ni\nθ\nθ\nθ2\nAir\nWater\n1.5 × 106 cos θ1 -408 cos θ2\nR =\n≈+1\n1.5 × 106 cos θ1 + 408 cos θ2\nT = 1 + R ≈2\n(double sound in water!)\nDoes this satisfy your intuition?\nConsider intensity:\na\np 2\na\np\nIa =\n=\nρaca\nw\na\na\na\nIw = p\n4p\n4p\np\n=\n=\n=\nρwcw\nρwcw\n1.5 × 106\n3.75 × 105\n\nREFLECTION AND TARGET STRENGTH\n=⇒Iw ≈\nIa\nDoes this satisfy your intuition?\n\nREFLECTION AND TARGET STRENGTH\nTarget Strength\nAssumptions:\n- large targets (relative to wavelength)\n- plane wave source\n- no angular variation in beam at target\n- curvature of wavefront is zero\nExample: rigid or soft sphere\nIscat\nTS = 10 log\n|r=rref\nIinc\nr\nr0\nI\np\ninc =\nI\nP\nP\nρc\ninc = πr0\n2Iinc\nAssume Pscat = Pinc (omnidirectional scattering)\nscat\nπr0\n2Iinc\nscat =\n=\n4πr2\n4πr2\nFor r = rref = 1 meter:\nr0\nTS = 10 log\n(Assuming r0 >> λ)\nIf r0 = 2 meters, then TS = 0 dB\n\nDESIGN PROBLEM: TRACKING NEUTRALLY BUOYANT FLOATS\nDesign problem: tracking neutrally buoyant floats\nSonar design problem\n2r0 = 25 cm\nRequire:\n- Track to ± 3*bearing\n- Range error: δ ± 10 meters\n- Maximum range: R = 10 km\n- Active sonar with DT = 15 dB\n- sonar and float at sound channel axis\n- baffled line array (source and receiver)\n- Noise from sea surface waves (design for Sea State 6)\n\nDESIGN PROBLEM: TRACKING NEUTRALLY BUOYANT FLOATS\nreceiver DI:\nDIR =\npulse length:\nτ =\narray length:\nL =\nsource level:\nSL =\nnoise level:\nNL =\ntransmission loss:\nTL =\nwavelength:\nλ =\nsource DI:\nDIT =\ntime-of-flight:\nT =\nping interval:\nTp =\nfrequency:\nf =\ntarget strength:\nTS =\nrange resolution:\nδ =\nacoustic power:\nP =\naverage acoustic power: P =\n\nNOISE\nNoise\nSource: Urick, Robert J. Principles of Underwater Sound. Los Altos, CA: Peninsula Publishing, 1983.\nFigure removed for copyright reasons.\nFigure 7.5, \"Average deep-water ambient-noise spectra.\"\n\nNOISE\nSource: Urick, Robert J. Ambient Noise in the Sea. Los Altos, CA: Peninsula Publishing, 1986.\nFigure removed for copyright reasons.\nGraph of ocean noise, by frequency.\n\nNOISE\nFive bands of noise:\nI. f < 1 Hz: hydrostatic, seismic\nII. 1 < f < 20 Hz: oceanic turbulence\nIII. 20 < f < 500 Hz: shipping\nIV. 500 Hz < f < 50 KHz: surface waves\nV. 50 kHz < f: thermal noise\nBand I:\nf < 1 Hz\n- Tides\nf ≈2 cycles/day\np = ρgH ≈104 · H Pa\nnoise level: NL = 200dB re 1 μPa -20 log H\nexample: 1 meter tide =⇒NL = 200 dB re 1 μPa\n- microseisms\nf ≈1 Hz\nOn land, displacements are\nη ≈10-6meters\nAssume harmonic motion\ndη\nη ∝eiωt =⇒v =\n= iωη\ndt\nNoise power due to microseisms\np = ρcv = iωρcη = i2πfρcη\n|p| = 2πfρcη = 1.4Pa =⇒NL = 123 dB re 1 μPa\nBand II: Oceanic turbulence\n1 Hz < f < 20 Hz\nPossible mechanisms:\n\nNOISE\n- hydrophone self-noise (spurious)\n- internal waves\n- upwelling\nBand III: Shipping\n20 Hz < f < 500 Hz\nExample: ≈1100 ships in the North Atlantic\nassume 25 Watts acoustic power each\nSL = 171 + 10 log P = 215 dB re 1 μPa at 1 meter\nMechanisms\n- Internal machinery noise (strong)\n- Propeller cavitation (strong)\n- Turbulence from wake (weak)\n\nω\nNOISE\nBand IV: surface waves\n500 Hz < f < 50 KHz\n- Observations show NL is a function of local wind speed\n(sea state)\n- Possible mechanisms:\n- breaking waves (only at high sea state)\n- wind flow noise (turbulence)\n- cavitation (100-1000 Hz)\n- long period waves\n\nω = kg\ncp = k\ngλ\n2c =\np\n2π\nif λ ≈2000 km, then cp ≈1500 m/sec =⇒radiate noise!\nBand V: Thermal noise\n50 KHz < f\nNL = -15 + 20 log f\n\nNOISE\nDirectionality of noise\nVertical\n- Low frequency\n- distant shipping dominates\n- low attenuation at horizontal\nθ\nNL\n-90\n- High frequency\n- sea surface noise\n- local wind speed dominates\n- high attenuation at horizontal\nθ\nNL\n-90\nHorizontal\n- Low frequency: highest in direction of shipping centers\n- High frequency: omnidriectional"
    }
  ]
}