{
  "course_name": "Introduction to Media Studies",
  "course_description": "Introduction to Media Studies is designed for students who have grown up in a rapidly changing global multimedia environment and want to become more literate and critical consumers and producers of media. Through an interdisciplinary comparative and historical lens, the course defines “media” broadly as including oral, print, performance, photographic, broadcast, cinematic, and digital cultural forms and practices. The course looks at the nature of mediated communication, the functions of media, the history of transformations in media and the institutions that help define media’s place in society. This year’s course will focus on issues of network culture and media convergence, addressing such subjects as Intellectual Property, peer2peer authoring, blogging, and game modification.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Social Science",
    "Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nLabs: 1 session / week, 2 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nCourse Description\n\nIntroduction to Media Studies is designed for students who have grown up in a rapidly changing global multimedia environment and want to become more literate and critical consumers and producers of media. Through an interdisciplinary comparative and historical lens, the course defines \"media\" broadly as including oral, print, performance, photographic, broadcast, cinematic, and digital cultural forms and practices. The course looks at the nature of mediated communication, the functions of media, the history of transformations in media and the institutions that help define media's place in society. This year's course will focus on issues of network culture and media convergence, addressing such subjects as Intellectual Property, peer2peer authoring, blogging, and game modification.\n\nThe class as taught this year is a theory and practice course. During the semester we explore different theoretical perspectives on the role of media in influencing our social values, political beliefs, identities and behaviors as well as working with different forms of media production. The class will analyze specific media texts (such as film, net-based media, and sci-fi novels) and explore the standard of values in relation to terms such as \"true account\" or \"real time.\" When stories take new forms, does that change the nature of the stories themselves? We look at the ways in which the politics of nationality, globalism, and identity influence both the production and reception of media. To represent different perspectives on media, several guest speakers also present lectures. In addition to producing critical writing for the course (non-fiction essay and research papers), students will organize in work groups to produce a media project to be presented at the end of the semester.\n\nCourse Requirements\n\nACTIVITIES\n\nPERCENTAGES\n\n2 Oral Presentations\n\n15%\n\n2 Media Assignments (Wiki and Podcast)\n\n15%\n\n3 Papers 5-7 Pages (N.B. the Third Paper is a Revision of Paper 1 or 2)\n\n30%\n\nFinal Media Project\n\n(Working Groups) Media Project + 5 Page Project Description (Co. authored) + Bibliography\n\n40%\n\nDetails of assignments can be found under the dates they are due on the class\ncalendar\n.\n\nClass attendance and participation are required. Assigned reading must be done in time for the class for which is it assigned. Suggested readings are elective. Recitation sessions and evening labs are mandatory. All written assignments are to by typed, including notes for recitation.\n\nWorking Groups for Media Projects\n\nA media project shall be presented at the end of the course based on the research interests and technical design of a Working Group. Groups may contain between 2-3 people. Working Groups must be formed from within Recitation groups. Permission is required from instructor for larger groups. A minimum of 2 meetings outside of the class is required of the Working Groups. Each working group must give a presentation on a topic for class and a presentation on the final media project.\n\nField Trips\n\nMedia Lab in Lec #8\n\nRecitations\n\nRecitations meet on Thursdays during the scheduled class period. Students are expected to take notes from their reading. Reading notes (a one-page minimum) must be handed in at the start of the recitation session each week. They may also be posted on the discussion site for the class or as blog entries. Please email your recitation TA if you chose to electronically post notes-in this case, notes must be posted the evening prior to the second lecture each week.\n\nPlagiarism\n\nThe use of another's intellectual work without acknowledgement is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution consult the style guides available in the\nWriting and Communication Center\n. You may visit their Web site.\n\nWriting Center\n\nThe Writing and Communication Center offers consultations on student writing. We encourage you to visit the Writing Center at any point in the writing process: prewriting, drafting or revising a piece of writing. The Writing Center also offers consultations on oral presentations. You may visit their Web site.",
  "files": [
    {
      "category": "Resource",
      "title": "Guidelines for Papers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-015-introduction-to-media-studies-fall-2005/b7a0957828175890cb4c98f3d3ea8c09_guide_papers.pdf",
      "content": "Guidelines for Papers\n\nPapers should be typewritten, double-spaced (12-pt. Times font preferred) with name, date, course\nnumber/name, and title (no cover page necessary).\n\nA good paper will have:\n\n1 a clearly defined topic AND argument: Your essay should stake out a claim about one or another aspect\nof media. Your topic should be expressed in a clear thesis sentence, which I would like to see printed at\nthe top of the paper. Your topic should be something that is open to dispute, that is, not a factual\nstatement (i.e. Thomas Edison invented the light bulb) and not a statement of opinion (i.e I hate Thomas\nEdison), but an interpretive or argumentative proposition (i.e Thomas Edison's Laboratory provided the\nmodel for the contemporary think tank; or, Thomas Edison's inventions fit within a larger pattern of\ntechnological innovation in the late 19th century; or Thomas Edison promoted his light bulb through\nimages that fit within the larger tradition of \"technological utopianism\" in American thought.)\n\n2 a direct relationship to one or another of the readings or lectures: Ideally, your first paragraph will\ndescribe one or another claim made in the readings and then develop your thesis in relation to it. You\nwant to make sure that you clearly understand what the writer is arguing. You want to summarize and\nquote the argument directly. You want to make sure that you are focusing on a salient point in the\nargument, not a throwaway detail. You want to make sure that this claim by the writer is relevant to the\nargument you want to make. You may draw on the author elsewhere in the paper as well, and probably\nshould, but I want to make sure that from the start, your paper is engaging with the course concepts and\nmaterials.\n\n3 an organizational structure which allows you to develop your ideas in a systematic and logical fashion:\nOften, MIT students write their papers stream of consciousness style, finding their thesis somewhere\nnear the end of the process, and turning it in. In an age of word processors, you have no real excuse for\nnot shuffling around paragraphs, once you find your thesis, so that it structures and guides your\nargument throughout. You also don't have an excuse for not rethinking your key propositions if need be\nonce you figure out what your paper is about. In an ideal world, of course, you would think through the\nessay and outline it before you start writing.\n\n4 clear support for each major proposition you make: Think of a simple and basic formula. For every claim,\n1-3 concrete bits of evidence (quotes from the reading, facts, relevant stories, etc. which illustrate your\nmain ideas). For every example, some analysis which shows why it is relevant to the case you are trying\nto make.\n\n5 a clear conclusion which puts the whole into perspective and tells us why what you are arguing matters:\nThis is the part students at MIT often miss. They sometimes see the exercise as one of describing some\naspect of contemporary media, often in the breathless prose we come to expect from corporate\nprospectuses or WIRED magazine reports. And, then, they end without putting it into some larger social\nor cultural context. Remember this is a humanities course even if we are talking a lot about\ntechnologies. We still want to know the human consequences of media. So, as you write, imagine that I\nam sitting over your shoulder and every time you finish a paragraph, I look down at you sneeringly and\nsay, \"SO WHAT!\" You had better be able to answer that SO WHAT question and if you can't, you\nhaven't thought through your subject enough."
    }
  ]
}