{
  "course_name": "Introduction to Arithmetic Geometry",
  "course_description": "No description found.",
  "topics": [
    "Mathematics",
    "Algebra and Number Theory",
    "Topology and Geometry",
    "Mathematics",
    "Algebra and Number Theory",
    "Topology and Geometry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n18.702 Algebra II\n\nDescription\n\nArithmetic geometry lies at the intersection of algebraic geometry and number theory. Its primary motivation is the study of classical\nDiophantine problems\nfrom the modern perspective of algebraic geometry. Topics include:\n\nRational points on conics\n\np\n-adic numbers\n\nQuadratic forms\n\nAffine and projective varieties\n\nCurves and function fields\n\nDivisors on curves\n\nThe Riemann-Roch theorem\n\nElliptic curves and abelian varieties\n\nRational points on elliptic curves\n\nEach topic represents 1-2 weeks of lectures\n\nTextbook and Notes\n\nThere is no required text;\nlecture notes\nwill be provided.\n\nWe may make reference to material in the following books and online resources\n\nFulton, William.\nAlgebraic Curves: An Introduction to Algebraic Geometry\n.\n\nThis book is available for free on\nFulton's website\n.\n\nMilne, J. S.\nElliptic Curves\n. BookSurge Publishers, 2006. ISBN: 9781419652578.\n\nThis book is also available for free on\nMilne's website\n, along with\naddendum/erratum\n.\n\nSerre, Jean-Pierre.\nA Course in Arithmetic\n. Springer-Verlag, 1996. ISBN: 9783540900405.\n\nShafarevich, I. R. (translated by Miles Reid).\nBasic Algebraic Geometry I\n. 3rd ed. Springer-Verlag, 2013. ISBN: 9783642379550.\n\nStichtenoth, H.\nAlgebraic Function Fields and Codes\n. Berlin: Springer, 2008. ISBN 9783540768777. [Preview with\nGoogle Books\n]\n\nSilverman, Joseph H.\nThe Arithmetic of Elliptic Curves\n. Springer-Verlag, 2009. ISBN: 9780387094939. (\nerrata\n) [Preview with\nGoogle Books\n]\n\nSoftware\n\nSome of the theorems presented in lecture will be demonstrated using the\nSage\ncomputer algebra system, which is based on\nPythonTM\n. Sage is an open-source system that provides both a command-line interface and a browser-based GUI (the Sage notebook). Tutorials and many examples can be found online. You can download a copy of Sage to run on your own machine if you wish, or create an account for free on the\nSageMathCloudTM\n.\n\nEnrolled students will be given an account on a Sage notebook server set up for this course. But you are free to use other packages such as\nMagma\n,\nMapleTM\nor\nMathematicaTM\nif you wish.\n\nProblem Sets\n\nThere will be weekly problem sets. Problem sets are to be prepared in typeset form (typically via LaTeX) and submitted electronically as PDF files. Collaboration is permitted/encouraged, but you should first attempt to solve the problems on your own, and in any case, you must write up your own solutions. Any collaborators should be identified, as well as any resources you consulted that are not listed above.\n\nGrading\n\nYour grade will be determined by your average problem set score, after dropping your lowest score. There are no exams and no final.",
  "files": [
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/b9bf30e32ac75d84c45317397e7e13b1_MIT18_782F13_pset1.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #1\nDue: 09/17/2013\nDescription\nThese problems are related to the material covered in Lectures 1-2. I have made every\neffort to proof-read these problems, but there are may be errors that I have missed. The\nfirst person to spot each error will receive 1-5 points of extra credit on their problem set,\ndepending on the severity of the error.\nThe problem set is due before the start of class (2:30 pm) on 09/17/2013 and are to be\nsubmitted electronically as a pdf-file e-mailed to the instructor.You can use the\nlatex source for this problem set as a template for writing up your solutions; be sure to\ninclude your name in your solutions (you can just replace the due date in the header with\nyour name). Don't forget to do the last problem, which is a survey whose results will help\nto shape future problem sets and lectures.\nProblem 1. Smooth conics (10 points)\nRecall that a conic is a plane projective curve of degree 2. Let C/k be a geometrically\nirreducible conic over a field whose characteristic is not 2. Prove that C must be smooth\n(non-singular).\nProblem 2. Plane cubics that define elliptic curves (30 points)\nShow that over a field k of characteristic not 2, 3 (and for part (b), not 7), each of the\nfollowing irreducible cubic curves C/k with a rational point P defines an elliptic curve that\ncan be put in the form\ny2z = x3 + Axz2 + Bz3\nvia a change of variables that takes the point P to the point (0 : 1 : 0).\n(a) C : X3 + Y 3 + Z3 = 0,\nP = (1 : -1 : 0).\n(b) C : X3 + Y 3 + Z3 + XY Z = 0,\nP = (1 : 0 : -1).\nBe sure to verify that the curves are smooth (but you can take it is as given that they are\nirreducible and have genus 1).\nProblem 3. Rational points on conics (60 points)\nIn Lecture 2 we reduced the problem of finding a rational point on an irreducible conic\nover Q to the problem of finding an integer solution (x0, y0, z0) to the equation\nx2 -dy2 = nz2,\n(1)\nwhere d and n are positive square-free integers. We solved (1) using Legendre's method\nof descent, which can be described as a recursive algorithm Solve(d, n). To facilitate the\nrecursion, we let d and n also take negative square-free values.\n\nSolve(d, n)\n1. If d, n < 0 then fail.\n2. If |d| > |n| then let (x0, y0, z0) = Solve(n, d) and return (x0, z0, y0).\n3. If d = 1 return (1, 1, 0); if n = 1 return (1, 0, 1); if d = -n return (0, 1, 1).\n4. If d = n then let (x0, y0, z0) = Solve(-1, d) and return (dz0, x0, y0).\n5. If d is not a quadratic residue modulo n then fail.\n6. Let w2 ≡d mod n, with |w| ≤|n|/2, and set x0 = w, y\n0 = 1 so that x0 ≡dy0 mod n.\n7. Let t1t2\n2 = (x2\n0 -dy2\n0)/n with t1 square-free, let (x1, y1, z1) = Solve(d, t1),\nand return (x0x1 + dy0y1, x0y1 + y0x1, t1t2z1).\nYour task is to implement Solve and use it to find rational points on a conic.\n(a) Let a and b be the first two primes greater than your MIT ID, and let -c be the least\nprime greater than b for which -bc, -ac, and -ab are squares modulo a, b, and c,\nrespectively. Use Solve to find an integer solution (x0, y0, z0) to\nax2 + by2 + cz2 = 0.\n(2)\nHave Solve print out the values (d, n) just before step 1 so that you can see how the\ndescent progresses. Include a copy of this output, along with the values of a, b, and c,\nas well as the final solution (x0, y0, z0) in your answer. You do not need to include\nyour code (but you are welcome to if you wish).\nTip: In sage you can use m=Integers(n)(d) to obtain d as an element m of the ring\nZ/nZ, and then use m.is square() to check whether m is a square. If it is, you can\nthen use w=m.sqrt().lift() to get a square-root of m and lift it to an integer w in\nthe interval [0, n -1] (you may then need to subtract n from w in order to ensure that\n|w| ≤|n|/2).\nThe solution returned by Solve is typically much larger than necessary. As noted by\nCremona and Rusin [1], the algorithm can be easily improved by modifying step 6 so that\nit chooses a solution (x , y ) to the congruence x2 ≡dy2 mod n that minimizes x2 + |d|y2\n0.\nThis is achieved by finding a shortest integer vector (u0, v0) that minimizes the Z2-norm\n∥(u, v)∥2 = (wu + nv)2 + |d|u2,\nwhere w, d, and n are as in step 6. One can then use x0 = u0w + v0n and y0 = u0. To\nfind the vector (u0, v0), apply the standard 2-dimensional lattice reduction algorithm to\nthe basis B = {(1, 0), (0, 1)}: iteratively shorten the longer of the two vectors in B (where\nlength is measured by the norm ∥· ∥), by adding or subtracting copies of the shorter vector\nuntil no further improvement is possible.\n(b) Repeat part (a) using a modified version of Solve that minimizes x2\n0 +|d|y2\n0 as above.\n(c) Using your answer from (b), parameterize the solutions to (2) and find 2 more pro-\njectively inequivalent solutions that are also inequivalent under sign changes.\n\nProblem 4. Survey\nComplete the following survey by rating each of the previous problems on a scale of 1 to 10\naccording to how interesting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-\nblowing\"), and how difficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also\nestimate the amount of time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nProblem 3\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), and the novelty of the material (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nNovelty\n9/5\nIntroduction\n9/10\nRational points on conics\n9/12\nFinite fields\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\nReferences\n[1] J.E. Cremona and D. Rusin, Efficient solution of rational conics, Mathematics of Com-\nputation 72 (2003), 1417-1441.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/f12498949ff871927f56ddc2cd8ea9d6_MIT18_782F13_pset10.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #10\nDue: 12/3/2013\nThese problems are related to the material covered in Lectures 21-22. I have made every\neffort to proof-read them, but some errors may remain. The first person to spot each error\nwill receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 12/3/2013 and should be submitted\nelectronically as a pdf-file e-mailed to the instructor. You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your name\nin your solutions and to identify collaborators and any sources not listed in the syllabus.\nRecall that we have defined a curve as a smooth projective variety of dimension one\n(and varieties are defined to be irreducible algebraic sets).\nProblem 1. Bezout's theorem (50 points)\nIn this problem k is an algebraically closed field.\nA curve in P2 is called a plane curve.1\n(a) Prove that every plane curve X/k is a hypersurface, meaning that its ideal I(X) is\nof the form (f), where f is a homogeneous polynomial in k[x, y, z]. Then show that\nevery generator for I(X) has the same degree.\nThe degree of X (denoted deg X) is the degree of any generator for its homogeneous ideal.\n(b) Let F/k be a function field, let P be a place of F, and let f ∈OP . Prove that the\nring OP /(f) is a k-vector space of dimension ordP (f).\nGiven a nonconstant homogeneous polynomial g ∈k[x, y, z] that is relatively prime to f,\nwe can represent g as an element of the local ring OX,P of functions in X that are regular\nat P by picking a homogeneous polynomial h that does not vanish at P and representing g\nas g/h reduced modulo I(X), an element of k(X). Note that in terms of computing ordP (g)\nit makes no difference which h we pick, ordP (g) will always be equal to the order of vanishing\nof g at P, a nonnegative integer. We then define the divisor of g in Divk X to be\ndivX g =\nordP (g)P.\nNote that div\ng is not a principal divisor.2\nX\nX\nIndeed, deg divX g is never zero.\n(c) Prove that deg divX g depends only on deg g (i.e. deg divX g = deg divX h whenever\ng and h have the same degree and are both relatively prime to f). Then prove that\ndeg divX g is a linear function of deg g.\nNow suppose that g is irreducible and nonsingular, so it defines a plane curve Y/k.\n(d) Prove that deg divY f = deg divX g.\n1Plane curves are not usually required to be smooth or irreducible, but ours are.\n2By varying h locally we eliminate the poles that would be present if we fixed a global choice for h.\n\nDefinition 1. Let f and g be two nonconstant homogeneous polynomials in k[x, y, z] with\nno common factor, and let P be a point in P2. The intersection number of f and g at P is\nIP (f, g) := dimk OP2,P /(f, g)\nHere O\n2,P denotes the ring of functions in k(\nP\nP2) that are regular at P, and f and g are\nrepresented as elements of this ring by choosing homogeneous denominators of appropriate\ndegree that do not vanish at P, exactly as described above.\nAs above, let X/k and Y/k denote plane\nP\ncurves defined by relatively prime homogeneous\npolynomials f and g, and let I(f, g) =\nP IP (f, g).\n(e) Prove that I(f, g) is equal to deg divX g = deg divY f.\n(f) Prove Bezout's Theorem for plane curves:\nI(f, g) = deg f deg g.\nIn fact Bezout's theorem holds even when f and g are not necessarily irreducible and\nnonsingular, but you need not prove this. It should be clear that f and g do not need to\nbe irreducible; just factor them and apply the theorem to all pairs of factors. You proof\nshould also handle cases where just one of f or g is singular; it takes a bit more work to\nhandle the case where both f and g are singular and intersect at a common singularity.\nThe assumption that k = k is necessary, in general, but the inequality I(f, g) ≤deg f deg g\nalways holds.\nProblem 2. Derivations and differentials (50 points)\nA derivation on a function field F/k is a k-linear map δ: F →F such that\nδ(fg) = δ(f)g + fδ(g).\nfor all f, g ∈F.\n(a) Prove that the following hold for any derivation δ on F/k:\n(i) δ(c) = 0 for all c ∈k.\n(ii) δ(fn) = nfn-1δ(f) for all f ∈F × and n ∈Z.\n(iii) If k has positive characteristic p then δ(fp) = 0 for all f ∈F.\n(iv) δ(f/g) = (δ(f)g -fδ(g))/g2 for all f, g ∈F with g = 0.\nTo simplify matters, we henceforth assume that k has characteristic zero.3\nThe simplest example of a derivation is in the case where F = k(x) is the rational\nfunction field and δ: F →F is the map defined by δ(f) = ∂f/∂x. We want to generalize\nthis example to arbitrary function fields.\n3For those who are interested, the key thing that changes in characteristic p > 0 is that everywhere we\nrequire an element x to be transcendental we need to additionally require it to be a separating element,\nwhich means that F/k(x) is a separable extension.\n\nLet x be a transcendental element of F/k. Any y ∈F is then algebraic over k(x) and\nhas a minimal polynomial λ ∈k(x)[T]. After clearing denominators we can assume that\nλ ∈k[x, T]. We now formally define\n∂y\n∂λ/∂x\n:= -\n(y)\n∂x\n∂λ/∂T\n∈k(x, y) ⊆F\nand let the map δx : F →F send y to ∂y/∂x.\nOne can show (but you are not asked to do this) that δx is a derivation on F/k. Note\nthat we get a derivation δx for each transcendental x in F. Now let DF be the set of all\nderiviations on F/k.\n(b) Let x be a transcendental element of F/k. Prove that for any δ1, δ2 ∈DF we have\nδ1(x) = δ2(x) ⇒δ1 = δ2. Conclude that δx is the unique δ ∈DF for which δ(x) = 1.\n(c) Prove the following:\n(i) For all δ1, δ2 ∈DF the map (δ1 + δ2): F →F defined by f 7→δ1(f) + δ2(f) is a\nderivation (hence an element of DF ).\n(ii) For all f ∈F and δ ∈DF the map (fδ): F →F defined by g 7→fδ(g) is a\nderivation (hence an element of DF ).\n(iii) Every δ ∈DF satisfies δ = δ(x)δx (in particular, the chain rule δy = δy(x)δx\nholds for any transcendental x, y ∈F/k).\nIt follows that we may view DF as one-dimensional F-vector space with any δx as a basis\nvector. But rather than fixing a particular basis vector; instead, let us define a relation on\nthe set S of pairs (u, x) with u, x ∈F and x transcendental over k:\n(u, x) ∼(v, y) ⇐⇒v = uδy(x).\n(1)\n(d) Prove that ∼is an equivalence relation on S.\nFor each transcendental element x ∈F/k, let the symbol dx denote the equivalence\nclass of (1, x), and for u ∈F define udx to be the equivalence class of (u, x); we call dx a\ndifferential. It follows from part (iii) of (d) that every derivation δ can be uniquely repre-\nsented as δ = udx for some u ∈F, but now we have the freedom to change representations;\nwe may also write δ = vdy for any transcendental element y, where v = uδy(x) = u∂x/∂y.\n(e) Prove that d(x+y) = dx+dy and d(xy) = xdy+ydx for all transcendental x, y ∈F/k.\nLet us now extend our differential notation to elements of F that are not transcendental\nover k. Recall that k is algebraically closed in F, so we only need to consider elements of k.\n(f) Prove that defining da = 0 for all a ∈k ensures that (e) holds for all x, y ∈F, and\nthat no other choice does.\nNow momentarily forget everything above and just define ∆F to the F-vector space\ngenerated by the set of formal symbols {dx : x ∈F}, subject to the relations\n(1) d(x + y) = dx + dy,\n(2) d(xy) = xdy + ydx,\n(3) da = 0 for a ∈k.\nNote that x and y denote elements of F (functions), not free variables, so ∆F reflects the\nstructure of F and will be different for different function fields.\n\n(g) Prove that dimF ∆F = 1, and that any dx with x ∈k is a basis.\nThe set ∆= ∆F is often used as an alternative to the set of Weil differentials Ω. They\nare both one-dimensional F-vector spaces, hence isomorphic (as F-vector spaces). But in\norder to be useful, we need to associate divisors to differentials in ∆, as we did for Ω.\nFor any differential ω ∈∆and any place P, we may pick a uniformizer t for P and write\nω = wdt for some function w ∈F that depends on our choice of t; note that t is necessarily\ntranscendental over k, since it is a uniformizer. We then define ordP (ω) := ordP (w), and\nthe divisor of ω is then given by\ndiv ω :=\nX\nordP (ω)P.\nP\nAs in Problem 1, the value ordP (ω) does not depend on the choice of the uniformizer t.\n(h) Prove that div udv = div u+div dv for any u, v ∈F. Conclude that the set of nonzero\ndifferentials in ∆constitutes a linear equivalence class of divisors.\n(i) Let F = k(t) be the rational function field. Compute div dt and prove that it is a\ncanonical divisor. Conclude that a divisor D ∈Divk C is canonical if and only if\nD = div df for some transcendental f ∈F.\nPart (i) holds for arbitrary curves, but you are not asked to prove this. It follows that the\nspace of differentials ∆plays the same role as the space of Weil differentials Ω, and it has\nthe virtue of making explicit computations much easier.\n(j) Prove that the curve x2 +y2 +z2 over Q has genus 0 (even though it is not isomorphic\nto P1 because it has no rational points) by explicitly computing a canonical divisor.\nProblem 3. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n11/19\nRiemann's inequality\n11/21\nThe Riemann-Roch theorem\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/876559f31fa529caa5ba30e7f663b798_MIT18_782F13_pset11.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #11\nDue: 12/10/2013\nThese problems are related to the material covered in Lectures 22-23. I have made every\neffort to proof-read them, but some errors may remain. The first person to spot each error\nwill receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 12/10/2013 and should be submitted\nelectronically as a pdf-file e-mailed tothe instructor. You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your name\nin your solutions and to identify collaborators and any sources not listed in the syllabus.\nAs usual, a curve is a smooth projective (irreducible) variety of dimension one.\nProblem 1. A genus 1 curve with no rational points (30 points)\nConsider the homogeneous polynomial\nf(x, y, z) = x3 + 2y3 + 4z3.\n(a) Prove that the zero locus of f is a plane curve C/Q.\n(b) Prove that C has genus one.\n(c) Prove that C has no Q-rational points (so it is not an elliptic curve over Q).\nProblem 2. Hyperelliptic curves (70 points)\nA hyperelliptic curve C/k is a curve of genus g ≥2 whose function field is a separa-\nble quadratic extension of the rational function field k(x).\nThe non-trivial element of\nGal(k(C)/k(x)) is called the hyperelliptic involution. In this problem we consider hyperel-\nliptic curves over a perfect field k whose characteristic is not 2 (so every quadratic extension\nof k(x) is separable).\n(a) Let C/k be a hyperelliptic curve of genus g, Prove that C can be defined by an affine\nequation of the form y2 = f(x), where f ∈k[x] is a polynomial of degree 2g + 1 or\n2g + 2 (so C is the desingularization of the projective closure of this affine variety).\n(hint: consider the Riemann-Roch spaces L(nD) where D is the pole divisor of x, and\nproceed along the lines of the first part of the proof of Theorem 23.3; as a first step,\nfigure out what the degree of D must be).\n(b) Prove that the polynomial f in part (a) can be made squarefree, and that y2 -f(x)\nis irreducible in k[x, y]. Then show that if k is algebraically closed one can make f\nmonic and of degree 2g + 1.\n(c) Let f be any squarefree polynomial in k[x] of degree d ≥5. Prove that the curve\ndefined by y2 = f(x) is a hyperelliptic curve of genus g ≤(d -1)/2.\n(d) Let C/k be a hyperelliptic curve of genus g defined by y2 = f(x) with f squarefree\nof degree d, where k is algebraically closed. Prove that there are at least d distinct\nplaces of k(C) that are fixed by the hyperelliptic involution, but not every place of\nk(C) is fixed by the hyperelliptic involution.\n\n(e) Let C/k be a function field of genus g over an algebraically closed field k, and let σ\nbe an automorphism of k(C) that fixes k. Prove that if σ does not fix every place\nof k(C) then it fixes at most 2g + 2 places. (hint: show that there is a nonconstant\nfunction x ∈L((g +1)P), where P is a place not fixed by σ, and then show that every\nplace fixed by σ corresponds to a zero of σ(x) -x).\n(f) Using (b), (c), and (d), prove that every equation of the form y2 = f(x) with f ∈k[x]\na squarefree polynomial of degree d ≥5 defines a hyperelliptic curve C/k of genus\ng = ⌊d-1\n2 ⌋. Your proof should work whether or not k is algebraically closed.\n(g) Prove that every curve of genus 2 is hyperelliptic (hint: first show there exists an\neffective canonical divisor W, then consider a non-constant x ∈L(W)).\nProblem 3. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n11/26\nElliptic curves\n12/3\nIsogenies and torsion points\n12/5\nThe Mordell-Weil theorem\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/c6fd51a6325acbd6777ba43ebdd14500_MIT18_782F13_pset2.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #2\nDue: 09/24/2013\nDescription\nThese problems are related to the material covered in Lectures 4-5. I have made every effort\nto proof-read them, but there are may still be errors that I have missed. The first person\nto spot each error will receive 1-5 points of extra credit on their problem set, depending on\nthe severity of the error.\nThe problem set is due before the start of class (2:30 pm) on 09/24/2013 and should be\nsubmitted electronically as a pdf-file e-mailed to the instructor.You can use the\nlatex source for this problem set as a template for writing up your solutions; be sure to\ninclude your name in your solutions (you can just replace the due date in the header with\nyour name). Remember to identify any collaborators or sources that you consulted that are\nnot listed in the syllabus.\nProblem 1. The Chevalley-Warning theorem. (35 points)\nA C1 field is a field k in which every homogeneous polynomial f ∈k[x1, . . . , xn] of nonzero\ndegree d < n has a nontrivial zero (equivalently, the projective variety f(x1, . . . , xn) = 0\nhas a rational point). The Chevalley-Warning theorem states that finite fields are C1 fields.\n(a) For each nonnegative integer n and finite field Fq, determine the value of\nx\nxn.\n∈Fq\n(Note that 00 = 1).\nP\n(b) Prove that Fq is a C1 field. (Hint: consider\na ,...,a\nf\nn∈Fq\n-\n(a1, . . . , an)q-1 ).\n(c) Prove more generally that if f1, . . . , fm ∈Fq[\nP\nx1, . . . , xn] are\nhomogeneous polynomials\n\nfor which deg f1 + · · · deg fm < n, then the system of equations\nf1(a1, . . . , an) = 0\nf2(a1, . . . , an) = 0\n...\nfm(a1, . . . , an) = 0\nhas a nonzero solution.\nProblem 2. Nonarchimedean absolute values. (30 points)\nLet ∥· ∥be a nonarchimedean absolute value on a field k. Define\nR = {x ∈k : ∥x∥≤1},\nm = {x ∈k : ∥x∥< 1}.\nProve each of the following statements.\n(a) R is a subring of k.\n\n(b) m is an ideal of R.\n(c) R -m is the unit group R× of R.\n(d) m is a maximal ideal of R.\n(e) m is the only maximal ideal of R.\nA commutative ring R with a unique maximal ideal m is called a local ring.1 The field R/m\nis the residue field of R. Now let p be a prime and define\nZ(p) =\nna ∈Q : p ∣b\nb\no\n.\n(f) Prove that Z(p) is a local ring and describe its unique maximal ideal m.\n(g) Determine the residue field of Z(p).\nProblem 3. The ring of p-adic integers Zp (35 points)\n(a) Prove that Zp is a Euclidean domain.\n(b) Prove that Zp and R have the same cardinality.\n(c) Prove that Zp\nT Q = Z(p) (take the intersection in Qp).\n(d) Show that Z(p) is the set of elements in Zp whose p-adic expansion eventually repeats.\n(e) Characterize the set of elements in Zp whose p-adic expansion is eventually constant.\nIs it ring? If not, is it closed under either addition or multiplication?\nProblem 4. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nProblem 3\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), and the novelty of the material (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nNovelty\n9/17\np-adic integers\n9/19\np-adic numbers, Ostrowski's theorem\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n1Discrete valuation rings are local rings that are also principal ideal domains and not fields. One can\ndefine non-commutative local rings, but we will not use these in this course.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/ea1eb6102a9cf4ab0b74c08bfc2392e0_MIT18_782F13_pset3.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #3\nDue: 10/01/2013\nThese problems are related to the material covered in Lectures 5-7. I have made every\neffort to proof-read them, but there are may be errors that I have missed. The first person\nto spot each error will receive 1-5 points of extra credit.\nThe problem set is due by 5pm on 10/02/2013 and should be submitted electronically\nas a pdf-file e-mailed to the instructor . You can use the latex source for this\nproblem set as a template for writing up your solutions; be sure to include your name in\nyour solutions and remember to identify all collaborators and any sources that you consulted\nthat are not listed in the syllabus.\nProblem 1. Non-archimedean topology. (35 points)\nLet k be a field with a non-archimedean absolute value ∥∥. The metric d(x, y) = ∥x -y∥\nmakes k a metric space whose topology is defined by the basis of open sets consisting of all\nopen balls B(x, r) = {y : d(x, y) < r} with x ∈k and r ∈R>0.\nNon-archimedean topology can be very counterintuitive, so be sure to keep in mind the\nfollowing definitions, which apply to any topological space.\n1. The collection of open sets is closed under arbitrary unions (including infinite unions)\nand finite intersections, and always includes the empty set and the whole space.\n2. A set is closed if and only if its complement is open.\n3. The interior of a set S is the union of all the open sets S contains, and the closure of\nS is the intersection of all the closed sets that contain S.\n(a) Prove that every triangle in k is either equilateral, or acute isosceles. More precisely,\nfor any x, y, z ∈k prove that the three distances d(x, y), d(y, z), d(z, x) are either all\nequal, or two of them are equal and the third is smaller.\n(b) Prove that every point in an open ball B(x, r) is \"at the center\" by showing that\ny ∈B(x, r) implies B(x, r) = B(y, r). Conclude that two balls are either disjoint or\nconcentric (this means they have a common center).\n(c) Prove that every open ball is closed (and therefore equal to its closure).\n(d) Consider a closed ball C(x, r) = {y : d(x, y) ≤r}. Prove that every point in C(x, r) is\nat the center, and that every closed ball is open (and therefore equal to its interior).\n(e) Consider a sphere S(x, r) = {y : d(x, y) = r}. Prove that every sphere is both open\nand closed.\n(f) Prove that k is totally disconnected. This means that for all distinct x, y ∈k there\nare disjoint open sets X and Y containing x and y respectively, such that k = X\nY .\n(g) For k = Qp with the p-adic absolute value, prove that the closure of the open B(\nS\nx, r)\nis not necessarily the closed ball C(x, r), but sometimes is (give examples of both).\nProve that the total number of open balls is countable and that every open ball has\nuncountably many distinct radii (that is, B(x, r) = B(x, r′) for uncountably many r′).\n\nProblem 2. n-adic rings (35 points)\nFor any integer n > 1 define the n-adic valuation vn(x) of nonzero x ∈Q to be the unique\ninteger k for which x = ank, with n ∣a, gcd(a, b) = 1 and gcd(b, n) = 1, and let vn(0) = 0.\nb\nNow define the function | |n : Q →R≥0 by\n|x|n = n-vn(x),\nwhere we |0|n = n-infis understood to be 0.\n(a) Prove that | |n is an absolute value if and only if n is prime, but that | |n always\nsatisfies the non-archimedean triangle inequality |x + y|n ≤max(|x|n, |y|n).\nLet Ak = Z/nkZ and consider the inverse system of rings (Ak) with morphisms Ak+1 →Ak\ngiven by reduction modulo nk.\nDefine the ring of n-adic integers as the inverse limit\nZn = lim A\ndefinition\n-\nk (this generalizes our\nof Z\n←\np).\n(b) Prove that if n is not a prime power then Zn is not an integral domain.\nIn view of (b), we cannot define Qn as the fraction field of Zn in general. But we can define\nQn as the completion of Q with respect to | |n, in the same way that we constructed Qp as\nthe p-adic completion of Zp (giving us an alternative definition of Qp).\n(c) Formalize this definition of Qn and show that it is a ring. Make it clear what the\nelements of Qn are, define the ring operations, and extend the definition of | |n to Qn.\n(d) Which of parts (a) to (g) in Problem 1 still apply if we replace k with Qn and use the\nmetric d(x, y) = |x -y|n?\n(e) Prove that for all prime powers pe we have Qpe = Qp.\n(f) Prove that if p1, . . . pr are the distinct prime divisors of n then Qn is isomorphic to\nthe direct product of rings Qp1 ⊕· · · ⊕Qpr and is not a field unless r = 1.\nProblem 3. Quadratic extensions of Qp (30 points)\nLet p be a prime congruent to 3 mod 4.\n(a) Prove that -1 does not have a square-root in Qp and that the ideal p = (p) is prime\nin Z[i], the ring of integers of Q(i).\n(b) Consider the quadratic extension Qp(i) = Qp[x]/(x2 + 1) and extend the p-adic abso-\nlute value | |p to from Qp to Qp(i) by defining for each α = a + bi ∈Qp(i):\nQ\nQ\n|α| = |\n]\nN\n|1/[\n(\n(α)\np i):\np =\nq\n|a2 + b2\np\nQp(i)/Qp\np\n|p.\nProve that | |p is an absolute value on Qp(i), and that Qp(i) is complete with respect\nto this absolute value.\n(c) For α ∈Q(i) define\n|α| = N\n(p)-vp(α) = p-2vp(α)\np\nQ(i)/\n,\nQ\nwhere vp(α) is the p-adic valuation of α. Recall that the p-adic valuation of β ∈Z[i]\nis the exponent of p in the prime factorization of the Z[i]-ideal (β), and this extends\nto Q(i) via vp(β/γ) = vp(β) -vp(γ) (note that Q(i) is the fraction field of its ring of\nintegers Z[i]). Let Q(i)p denote the completion of Q(i) with respect to | |p. Prove that\nQp(i) and Q(i)p are isomorphic fields with equivalent (but not equal) absolute values.\n\n(d) Prove that p does not have a square root in Qp(i), thus the quadratic extensions\nQp(√p) and Qp(i) are distinct. Conclude that Qp(√-p) is also a quadratic extension\nof Qp, and it is distinct from both Qp(i) and Qp(√p).\nWe will see that up to isomorphism, Qp(i), Qp(√p) and Qp(√-p) are the only quadratic\nextensions of Qp, and that a similar statement holds for primes that are congruent to\n1 mod 4.\nThis is in contrast to Q, which has infinitely many non-isomorphic quadratic\nextensions, and to Q\n= R, which has only one.\ninf\n(e) Recall from problem set 2 that every field with a nonarchimedean absolute value has\nan associated residue field. Compute the residue fields of Qp(i) and Qp(√p).\nProblem 4. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nProblem 3\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), and the novelty of the material (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nNovelty\n9/24\nOstrowski't theorem for number fields\n9/26\nCompletions\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/51b7d14748c312a16c0b9473f497744c_MIT18_782F13_pset4.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #4\nDue: 10/08/2013\nThese problems are related to the material covered in Lectures 8-9. I have made every\neffort to proof-read them, but there are may be errors that I have missed. The first person\nto spot each error will receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 10/08/2013 and should be submitted\nelectronically as a pdf-file e-mailed to the instructor . You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your\nname in your solutions and remember to identify all collaborators and any sources that you\nconsulted that are not listed in the syllabus.\nProblem 1. A stronger form of Hensel's lemma. (30 points)\n(a) Let f ∈Zp[x] and suppose |f(a)|p < |f′(a)|2\np for some a ∈Zp. Let a1 = a, and for\nn ≥1 let\nan+1 = an -f(an)/f′(an).\nProve that this defines a Cauchy sequence (an) in Zp whose limit b uniquely satisfies\nf(b) = 0 and |a -b|p < |f′(a)|p, and moreover, |f′(a)|p = |f′(b)|p. (you may find it\nhelpful to reword this in terms of vp and work with congruences modulo powers of p).\n(b) Prove that the hypothesis in (a) is necessary in the following sense. Suppose that b is a\nsimple root of a polynomial f ∈Zp[x]. Prove that for any a ∈Zp, if |a -b|p < |f′(b)|p\nthen |f(a)|p < |f′(a)|2\np. Conclude that if no a ∈Zp satisfies the hypothesis of (a),\nthen f(x) does not have a simple root in Zp.\n(c) Use (a) to compute a square root of 57 in Z2 to 16 digits of 2-adic precision using\na = 1. How many an do you need to compute to achieve this precision?\nProblem 2. A faster form of Hensel's lemma. (20 points)\n(a) Let R be a commutative ring, let f ∈R[x], and let m ∈R. Suppose that x0, z0 ∈R\nsatisfy f(x0) ≡0 mod m and f′(x0)z0 ≡1 mod m (note that a ≡b mod m simply\nmeans that a -b is an element of the R-ideal (m)). Let\nx1 = x0 -f(x0)z0,\nz1 = 2z0 -f′(x1)z2\n0.\nProve that\n(i) x1 ≡x0 mod m,\n(ii) f(x1) ≡0 mod m2,\n(iii) f′(x1)z1 ≡1 mod m2,\nand that (i) and (ii) uniquely characterize x1 modulo m2.\n(b) Use part (a) to compute a cube-root of 9 in the ring Z10 to 64 digits of 10-adic precison\nby working modulo 10, 102, 104, 108, 1016, 1032, 1064.\n(c) Prove that Fermat's last theorem is false in Z10.\n\nProblem 3. Applications of Hensel's lemma (50 points)\nRecall that every element of Q×\np can be uniquely written as pru with r ∈Z and u ∈Z×\np .\nLet Q×n\np\n= {xn : x ∈Qp} denote the set of nth powers in Q×\np .\n(a) For all odd primes p, prove that pru is a square in Q×\np if and only if r is even and u\nis a square modulo p. Conclude that Q×\np /Q\n×\np\n≃(Z/2Z) (as finite abelian groups).\n(b) Using the strong form of Hensel's lemma, prove that 2ru is a square in Q×\n2 if and only\nif r is even and u ≡1 mod 8. Conclude that Q×\n2 /Q\n× ≃(Z/2Z) .\n(c) Determine the structure of Q×\np /Q×\np\nn for all primes p and odd primes n.\nLet μn,p = {x ∈Qp : xn = 1} denote the set of nth roots of unity in Qp.\n(d) Prove that μn,p is a subgroup of Z×\np .\n(e) Use Hensel's lemma to prove that for p ∣n the group μn,p is cyclic of order gcd(n, p-1).\n(f) Let p be odd. Use the strong form of Hensel's lemma to prove that μp,p is trivial.\nConclude that there are exactly p -1 roots of unity in Qp (be sure to address μpr,p).\n(g) Prove that μ4,2 = μ2,2 = {±1}. Conclude that ±1 are the only roots of unity in Q2.\nProblem 4. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nProblem 3\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n10/1\nHensel's lemma\n10/3\nQuadratic forms\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n1Anytime Z/pZ (or any ring for that matter) appears in a context where a group is required, you can\nassume it is the additive group that is being referred to (one uses (Z/pZ)× for the multiplicative group).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/fcc8b1e5f0f083a50aa348b03a1a8204_MIT18_782F13_pset5.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #5\nDue: 10/22/2013\nThese problems are related to the material covered in Lectures 3-10 (unlike previous\nproblem sets, you may need to refer to material covered in lectures and/or problem sets\nfrom earlier weeks). I have made every effort to proof-read them, but some errors may\nremain. The first person to spot each error will receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 10/22/2013 and should be submitted\nelectronically as a pdf-file e-mailed to the instructor. You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your\nname in your solutions and remember to identify all collaborators and any sources that you\nconsulted that are not listed in the syllabus.\nIn this problem set we will recapitulate much of the material covered over the past\nmonth, replacing the field Q with the field Fq(t), the field of rational functions in t with\ncoefficients in a finite field Fq. The fields Q and Fq(t) have much in common and are the\ntwo essential sources of global fields; by definition, every global field is a finite extension of\neither Q or Fq(t).\nRecall that Fq(t) is the fraction field of the polynomial ring Fq[t]. The ring Fq[t] is a\nprincipal ideal domain, hence a unique factorization domain, and its unit group is F×\nq . In\nparticular, every irreducible polynomial in Fq[t] is prime, and (up to scaling by units) the\nprime elements of Fq[t] are precisely the monic irreducible polynomials. We will use π to\ndenote such a prime (and also inf, see below).\nProblem 1. Absolute values on Fq(t) (35 points)\nFor each prime π ∈Fq[t] and any nonzero f ∈Fq[t], let vπ(f) be the largest integer for\nwhich πn|f, equivalently, the largest n for which f ∈(πn). For each f/g ∈Fq(t)× in lowest\nterms (meaning f and g have no common factor in Fq[t]), we define\nvπ(f/g) = vπ(f) -vπ(g),\nand we let vπ(0) = inf(with the usual conventions that n + inf= inf, max(n, inf) = inf, and\nn-inf= 0 if n = 0). We also define\ndeg(f/g) = deg f -deg g,\nand deg 0 = -inf.\n(a) For each prime π ∈Fq[t], define\n|r| = (qdeg π)-vπ(r)\nπ\nfor all r ∈Fq(t). Show that | |π is a nonarchimedean absolute value on Fq(t).\n(b) Let\n|r|\n= qdeg r,\ninf\nfor all r ∈Fq(t). Prove that | |\nis a nonarchimedean absolute value on F\ninf\nq(t).1\n1You may be surprised that | |\nis nonarchimedean, but recall from Corollary 5.4 of Lecture 5 that this\ninf\nis necessarily the case in a field of positive characteristic.\n\nRecall from Problem Set 2 that in a field k with nonarchimedean absolute value ∥∥,\nR = {x ∈k : ∥x∥≤1}\nis a local ring with unique maximal ideal m = {x ∈k : ∥x∥< 1}. The field R/m is called\nthe residue field of R (and of k, with respect to ∥∥).\n(c) Determine the residue field of Fq(t) with respect to | |π.\n(d) Describe the local ring R = {x ∈Fq(t) : |x|inf≤1} and its unique maximal ideal m.\nThen determine the residue field of Fq(t) with respect to | |\n.\ninf\n(e) Prove Ostrowski's theorem for Fq(t): every nontrivial absolute value on Fq(t) is equiv-\nalent to | |\nor | |π for some prime π ∈Fq[t].\ninf\nMore precisely, show that if ∥∥is a nontrivial absolute value on Fq(t), either ∥t∥> 1\nand ∥∥∼| |\n, or\ninf\n∥t∥≤1 and ∥∥∼| |π for some prime π ∈Fq[t].\nIn view of (e) we now regard infas a prime of Fq(t) and let π range over both monic\nirreducible polynomials in Fq[t] and inf.\n(f) Prove the product formula for absolute values on Fq(t): for every r ∈Fq(t)× we have\nY\nπ\n|r|π = 1.\nProblem 2. Completions of Fq(t) (30 points)\nLet Fq(t)π denote the completion of Fq(t) with P\nrespect to the absolute value | |π. Recall\nthat for any field k, ring of formal power series\nn\nn\n0 anT\nwith an ∈k is denoted k[[T]],\n≥\nand its fraction field k((T)) is the field of formal Laurent series\nn\nn anT n, where n0 ∈Z.\n≥\n(a) Prove that every π-adic field Fq(t)π is isomorphic to Fπ((\nP\nT)), where Fπ denotes the\nresidue field of Fq(t) with respect to | |π.\nFor each π determine the field Fπ and\ndescribe this isomorphism by identifying the element of Fq(t)π that corresponds to T\n(this element is called a uniformizing parameter, or simply a uniformizer).\nIt follows from (a) that if we fix a uniformizer (i.e., choose an isomorphism from Fq(t)π\nto\nP Fπ((T))), then every element a of Fq(t)π has a unique π-adic expansion of the form\nn\nn anT n, where n0 = vπ(a) is the π-adic valuation of a (extended from Fq(t) to its\n≥\ncompletion Fq(t)π). We can also write a as T vπ(a)u, where u ∈Fπ[[T]]× is a π-adic unit.\n(b) Determine for which π we have Fπ = Fq. Conclude that, unlike the p-adic fields Qp,\ndistinct π-adic fields Fq(t)π may be isomorphic as fields, even though they have in-\nequivalent with absolute values.\n(c) Determine the group of square classes Fq(t)×\nπ /Fq(t)\n×\nπ\n(your answer may depend on q\nand π, be sure to consider all possibilities).\n\nProblem 3. Hilbert symbols over Fq(t) (35 points)\nWe now assume q is odd. For a, b ∈Fq(t)×\n(\nπ , we define the Hilbert symbol\nif ax2 + by2 = 1 has a solution in Fq(t)π,\n(a, b)π =\n-1\notherwise.\nAs noted in class, the proofs of Lemma 10.2 and Corollary 10.3 work over any field, so you\ncan assume they apply to (a, b)π.\n(a) For a, b ∈Fq(t)×\nπ ≃Fπ((T))×, write a = T αu and b = T βv, with u, v ∈Fπ[[T]]×.\nProve that\n(a, b)π = (-\n#F\n1)αβ\nπ-1\nu\n\nβ v α\n,\nπ\nπ\nwhere ( u) is the Legendre symbol of the residue field\nπ\nFπ applied to the image of u\nin Fπ (so ( u) = 1 if and only if the first π-adic digit of u is a square in\nπ\nF×\nπ ).\n(b) Prove that the Hilbert symbol (·, ·)π is bilinear and nondegenerate.\n(c) Prove that for all a, b ∈Fq(t)× we have (a, b)π = 1 for all but finitely many π. Then\nprove the Hilbert reciprocity law:\n(a, b)π = 1.\nπ\nYou may assume the quadratic recipro\nY\ncity law for Fq[t], which states that for any\nmonic irreducible polynomials\n\nπ1, π2 ∈Fq[t] we have\nπ1\n= (-\nq\n1)deg(π1) deg(π2)\n-\nπ2\nπ2\nπ1\n\n,\nwhere ( π1 ) is defined to be 1 if π1 is a square modulo π2 and\n1 otherwise.\nπ2\n-\nProblem 4. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nProblem 3\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n10/8\nHilbert Symbols\n10/10\nHasse-Minkowski\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/88ca77ba19602fd8ebc7bc4139803380_MIT18_782F13_pset6.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #6\nDue: 10/29/2013\nThese problems are related to the material covered in Lectures 12-13. I have made every\neffort to proof-read them, but some errors may remain. The first person to spot each error\nwill receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 10/29/2013 and should be submitted\nelectronically as a pdf-file e-mailed to the instructor. You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your name\nin your solutions and to identify collaborators and any sources not listed in the syllabus.\nProblem 1. The absolute Galois group of Fq (50 points)\nLet Fq be the finite field Z/qZ for some fixed prime1 q, let Fq be a fixed algebraic closure\nof Fq, and for every positive integer n let\nF\nn\nqn = {x ∈Fq : xq\n= x}.\nRecall from Lecture 3 that Fqn is a finite field with qn elements, and the Galois group\nGal(Fqn/Fq) is cyclic of order n, generated by the Frobenius automorphism x 7→xq.\nIn several of the questions below you will be asked to compute various cardinal numbers.\nRecall that a cardinal number is an equivalence class of sets that can be put in bijection,\nand we write #A ≤#B whenever there is an injective map from A to B. Your answer\nshould be either (1) a nonnegative integer, (2) #Z, (3) #R, or (4) > #R. You are welcome\nto assume the continuum hypothesis, which says that #S > #Z =⇒#S ≥#R.2\n(a) Prove that Fq = S\nn≥1 Fqn.\n(b) Compute the cardinals #Fq and [Fq : Fq].\nIn order to compute the Galois group Gal(Fq/Fq), we need to generalize our notion of\nan inverse limit.\nDefinition. A directed poset is a nonempty set I with an order relation ⩽that satisfies\n1. i ⩽i (reflexive)\n2. i ⩽j and j ⩽i =⇒i = j (anti-symmetric)\n3. i ⩽j and j ⩽k =⇒i ⩽k (transitive)\n4. For all i, j ∈I there exists k such that i ⩽k and j ⩽k (upper bound)\nDefinition. An inverse system of groups is a collection of groups (Gi)i∈I indexed by a\ndirected poset I and homomorphisms Gj →Gi for each i ⩽j, such that Gi →Gi is the\nidentity map, and for all i ⩽j ⩽k the composition Gk →Gj →Gi is Gk →Gi. The inverse\nlimit G = lim\nGi is the group whose elements are all collections (g )\nwith g ∈G ,\nsubject to the\n←-i∈\ni i I\ni\ni\nI\n∈\nconstraint that for all i ≤j the component gi is the image of gj under the\nhomomorphism Gj →Gi. The group operation on G is defined component-wise (so G is a\nsubgroup of the direct product Q\ni∈I Gi).\n1Nothing in this problem depends on q being prime, we make this assumption only for the sake of making\nthings more concrete. The key point is that we are singling out a particular choice of Fq and every Fqn.\n2You are also welcome to use the cardinal notations אn and בn if these are familiar to you.\n\nIf we take our directed poset to be the positive integers with the usual ordering, the\ndefinition above agrees with our earlier definition of an inverse system (of groups). But now\nwe want our directed poset to be the positive integers with the divisibility ordering, that is,\nm ⩽n if and only if m|n. This is motivated by the fact that Fqm ⊆Fqn if and only if m|n.\nSo let Ndiv denote the set of positive integers ordered by divisibility, and consider the\ninverse system of groups\nGal(Fqn/Fq)\n\n,\nn∈Ndiv\nwhere for m|n the map Gal(Fqn/Fq) →Gal(Fqm/Fq) is the restriction map; that is, the\nimage of an automorphism σ ∈Gal(Fqn/Fq) in Gal(Fqm/Fq) is obtained by simply restricting\nthe domain of σ from Fqn to Fqm.\n(c) Prove that\nGal(Fq/Fq) ≃\nlim\nGal(Fqn/Fq) ≃\nlim\nZ/nZ.\n(1)\nn←\n∈N-\ndiv\nn←\n∈N-\ndiv\nConclude that Gal(Fq/Fq) is abelian (so all of its subgroups are normal).\nˆ\n(d) The group on the RHS of (1) is denoted Z (it also has a ring structure, but here we\nview it as an additive group). Prove that\nZˆ ≃\nY\nZp,\np\nas additive abelian groups.\n(e) Compute #Gal(Fq/Fq). Conclude that #Gal(Fq/Fq) = [Fq : Fq].\n(f) Compare the number of subgroups of Gal(Fq/Fq) to the number of intermediate\nfields F with Fq ⊆F ⊆Fq (as cardinals).\nConclude that the Galois correspon-\ndence does not hold for Gal(Fq/Fq), and that, in particular, two distinct subgroups\nof Gal(Fq/Fq) may have the same fixed field.\n(g) For any subgroup G ⊆Gal(Fq/Fq), let G denote the group generated by the union of\nall subgroups of Gal(Fq/Fq) that have the same fixed field as G, and call G closed if\nG = G.3 Show that there is a one-to-one inclusion-reversing correspondence between\nclosed subgroups G ⊆Gal(Fq/Fq) and intermediate fields Fq ⊆F ⊆Fq such that\n(i) G = Gal(Fq/F);\nG\n(ii) F = Fq .\nProblem 2. Homogeneous ideals and projective algebraic sets (50 points)\nLet k be a perfect field and fix an algebraic closure k. Fix a positive integer n, let R be\nthe polynomial ring k[x0, . . . , xn], and let Rh be the set of all homogeneous polynomials in\nR. Recall from lecture that (1) a homogenous ideal in R is an ideal generated by elements\nof Rh, (2) for any subset S ⊂R the algebraic set Z\nn\nS is the zero locus in P\nof S\nRh,\nand (3) for any subset Z ⊂Pn\n∩\nthe ideal I(Z) is the homogeneous ideal generated by the\npolynomials in Rh that vanish at every point in Z.\n3One can define a topology on Gal(Fq/Fq) for which G is precisely the closure of G; this is known as the\nKrull topology.\n\n(a) Prove the \"homogeneous Nullstellensatz,\" which says that if I ⊆R is a homogeneous\nideal and f ∈Rh is a nonconstant polynomial that vanishes at every point in ZI,\nthen fr ∈I for some r > 0 (hint: re-interpret the problem in An+1 and use the usual\nNullstellensatz).\n(b) Let R+ denote the set of all polynomials in R with no constant term. Prove that for\nany homogeneous ideal I ⊆R the following are equivalent:\n(i) ZI is the empty set;\n(ii) Either\n√\nI = R or\n√\nI = R+.\n(iii) I contains every polynomial in Rh of degree d, for some d > 0.\n(c) Prove the following:\n(i) If S ⊆T are subsets of Rh then ZT ⊆ZS.\n(ii) If Y ⊆Z are subsets of Pn then I(Z) ⊆I(Y ).\n(iii) For any two subsets Y, Z in Pn we have I(Y ∪Z) = I(Y ) ∩I(Z).\n(iv) For any algebraic set Z ⊆Pn we have ZI(Z) = Z.\n(v) For any homogeneous radical ideal I for which ZI = ∅we have I(ZI) = I.\n(d) Conclude from (a), (b), and (c) that there is a one-to-one inclusion-reversing corre-\nspondence between algebraic sets in Pn and homogeneous radical ideals in R that are\nnot equal to R+, given by the maps Z →I(Z) and I →ZI.4\n(e) Prove that an algebraic set Z ∈Pn is irreducible if and only if I(Z) is a prime ideal.\nProblem 3. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n10/17\nField extensions, algebraic sets\n10/22\nAffine and projective varieties\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n4The ideal R+ that does not appear in this correspondence is called the irrelevant ideal.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/0c32e3ce48a9637374e89902ae5c342d_MIT18_782F13_pset7.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #7\nDue: 11/5/2013\nThese problems are related to the material covered in Lectures 13-16. I have made every\neffort to proof-read them, but some errors may remain. The first person to spot each error\nwill receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 11/5/2013 and should be submitted\nelectronically as a pdf-file e-mailed to the instructor. You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your name\nin your solutions and to identify collaborators and any sources not listed in the syllabus.\nProblem 1. Short answer questions (25 points)\nPlease justify each of the following assertions in 25 words or less. They all have short easy\nproofs and are meant to check your understanding, not to challenge you.\n1. For any ideals I, J ⊆k[x1, . . . , xn] the affine algebraic sets ZI∪J and ZI+J are equal.\n2. For any ideals I, J ⊆k[x1, . . . , xn] the affine algebraic sets ZI J and ZIJ are equal.\n∩\n3. Every nonempty open set in An is dense.\n4. Every affine variety is connected.\n5. The closure of the image of a morphism of affine varieties is a variety.\n6. A morphism of affine varieties is dominant if and only if the corresponding morphism\nof coordinate rings is injective.\n7. An and Pn are birationally equivalent (prove this explicitly by writing down the ra-\ntional maps; indicate in each case whether your rational map is a morphism or not).\nProblem 2. Sheaves (25 points)\nIn this problem and the next all rings are commutative with identity. This includes the zero\nring, which is the unique ring with exactly one element 0 = 1.\nDefinition 1. A presheaf (of rings) F on a topological space X assigns to each open set\nU a ring F(U), and to each nested pair of open sets U ⊆V a ring homomorphism\nρV U : F(V ) →F(U),\n(note the direction) such that ρUU is the identity map and for all open sets U ⊆V ⊆W,\nρV U *ρWV = ρWU.\nIn the motivating examples for presheaves, each F(U) is a ring of functions defined\non U, and the maps ρV U simply restrict the domains of these functions from V to U. For\nthis reason the maps ρV U are called restriction maps, and for each f ∈F(U) the element\nρV U(f) ∈F(V ) is called the restriction of f to V .1\n1One can define presheaves for any category: just replace \"ring\" with your favorite type of object and\n\"ring homomorphism\" with the appropriate morphism; in general a presheaf is just a contravariant functor\nfrom the category of open sets of X (whose morphisms are inclusion maps) to any category you like.\n\nNow let X be an affine variety over k = k with function field k(X).\n(a) Show that for any open set U ⊆X the set\nO(U) = {f ∈k(X) : U ⊆dom(f)}\nis a subring of k(X) that contains k (hence is a k-algebra), and has fraction field k(X).\nProve that O(X) is equal to the coordinate ring k[X].\n(b) For open sets U in X, let F(U) = O(U), and for nested open sets U ⊆V in X, let\nρV U be the inclusion map O(V ) ⊆O(U). Show that F is a presheaf.\nDefinition 2. An open cover of an open set U is a collection of open sets {Uα}α∈A whose\nunion is U. A presheaf F is a sheaf if it satisfies the sheaf axiom.\nSheaf axiom: For every open cover {Ua}a∈A of U = S\na Ua and every collection {fa} with\nfa ∈F(Uα) such that for all a, b ∈A the restrictions of fa and fb to Ua ∩Ub are equal, there\nis a unique f ∈F(U) whose restriction to Ua is fa for all a ∈A.\n(c) Prove that in any sheaf of rings F, the ring F(∅) must be the zero ring.2\n(d) Modify the presheaf F defined in part (b) so that F(∅) is the zero ring and ρU∅\nis the unique homomorphism to the zero ring (for each open set U). The resulting\npresheaf OX is called the structure sheaf of X. Prove that OX is indeed a sheaf.3\nDefinition 3. A pair (X, OX) where X is a topological space and OX is a sheaf of rings\non X is called a ringed space.\nProblem 3. Affine schemes (50 points)\nAs in Problem 2, all rings in this problem are commutative rings with identity.\nLet R be a ring whose elements f we shall call regular functions. Let\nX = spec R\nbe the set of prime ideals of R. We shall call the elements P of X points. For any point\nP ∈X, the residue field of P is the quotient field of the integral domain R/P. For any\nregular function f ∈R and any point P ∈X we define f(P) to be the image of f in the\n\nresidue field of P (this means we reduce f mod P to get an element f of R/P that we then\n\nregard as the element f/1 of the fraction field). Notice that f(P) is defined at every point\nP ∈X, which is why we call f a regular function. The field in which f(P) lies will vary\nwith P, but in any case we can meaningfully ask whether f(P) = 0 or not. We now define\nan algebraic set Z as the zero locus of a set of regular functions S ⊆R:\nZS = {P ∈X : f(P) = 0 for all f ∈S}.\nWe now endow X with the Zariski topology by letting the closed sets be the algebraic sets.\n2Some authors include this restriction in the definition of a presheaf, but this is unnecessary.\n3While this modification may seem artificial, it can actually be justified by noting that if you restrict the\ndomain of a set of functions with the same codomain to the empty set they become a single function (there\nis exactly one function from the empty set to a given set S, it is the function whose graph is the empty set).\n\n(a) Prove that this actually defines a topology by showing that the empty set and X are\nboth closed, and that arbitrary intersections and finite unions are closed.\n(b) Show that for S ⊆R the algebraic set ZS is precisely the set of prime ideals of R\n(points of X) that contain S, and that ZS = ZI, where I is the ideal generated by S.\n(c) We call a point P ∈X a closed point if the set {P} is closed in the Zariski topology.\nProve that the closed points in X are precisely the maximal ideals of R.\n(d) Let R be the polynomial ring k[x1, x2] for some field k = k. Give a bijection between\nclosed points P in X and elements (a , a ) of A2\n(k), and show that under this bijection\nwe have f(P) = f(a1, a2) for any f ∈R and closed point P. Describe the points of\nX that are not closed and evaluate 3x2\n1 + 2x1x2 -5x2\n2 at two such points.\n(e) Let R = Z. Describe the opens sets in X and the residue fields at points P ∈X.\nEvaluate 15 ∈R at the points (0), (2), (3), (5) ∈X, and describe the zero locus of 15.\nNow let V ⊆An be an affine variety of dimension 1 over a field k = k, let R = k[V ] be\nits coordinate ring, let k(V ) be its function field, and let X = spec R.\n(f) Prove that every point in V corresponds to a maximal ideal of k[x1, . . . , xn] that\ncontains I(V ), which in turn corresponds to a maximal ideal of R, hence a closed\npoint in X. We may therefore identify V with the set of closed points in X.\n(g) Prove that the only point in X that is not in V is the zero ideal and that this point\nis dense in X and contained in every nonempty open set in X.\n(h) Let us say that an element f = g/h of the function field k(V ) is regular at P ∈X\nif h(P) = 0 (where h(P) is defined as above). Argue that for points P ∈V this\ndefinition agrees with the corresponding definition given in Lecture 15. Then show\nthat every f ∈k(V ) is regular at the point P = (0) and that we may thus add (0) to\ndom(f) for every f ∈k(V ).\nDefinition 4. An affine scheme is a ringed space (X, OX) where X = spec R for a ring R.\n(i) Use (h) to define a structure sheaf OX for X = spec k[V ], as in part (d) of Problem 2,\nthereby constructing an affine scheme corresponding to V .\n(j) Use (e) to define a structure sheaf OX for X = spec Z.\nJust in case you are interested, here is the general definition of a scheme.\nDefinition 5. A scheme is a ringed space (X, OX) for which every point has a neighbor-\nhood U for which (U, OU) is an affine scheme, where OU is OX restricted to U.\nProblem 4. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\n\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nProblem 3\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n10/24\nMorphisms and rational maps\n10/29\nFunction fields\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "18.782 Arithmetic Geometry Problem Set 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/75f6cee325018a8fa25dadb3e448a7e7_MIT18_782F13_pset8.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nProblem Set #8\nDue: 11/13/2013\nThese problems are related to the material covered in Lectures 16-17. I have made every\neffort to proof-read them, but some errors may remain. The first person to spot each error\nwill receive 1-5 points of extra credit.\nThe problem set is due by the start of class on 11/12/2013 and should be submitted\nelectronically as a pdf-file e-mailed to the instructor. You can use the latex source\nfor this problem set as a template for writing up your solutions; be sure to include your name\nin your solutions and to identify collaborators and any sources not listed in the syllabus.\nProblem 1. Products of varieties and completeness (50 points)\nFor topological spaces X and Y we write X ×top Y to denote their product as a topological\nspace; if πX and πY are the projection maps, the sets of the form π-1\nX (S) and πY\n-1(S)\nwith S closed generate the closed sets in X ×top Y (under intersection and finite unions).\nFor varieties X and Y we write X × Y to denote the product variety with the Zariski\ntopology, as defined in Lecture 16. In this problem k denotes an algebraically closed field.\n1. Prove that every closed set in Am ×top An is closed in Am × An, but that the converse\nis not true for any m and n.\n2. Prove that Am × An is isomorphic to Am+n (for any m and n), but that P1 × P1 is\nnot isomorphic to P2, nor to any subsvariety of P2.\n3. Define the map φ: P1 × P1 →P3 by\nφ((x0 : x1), (y0 : y1)) = [x0y0 : x0y1 : x1y0 : x1y1].\nProve that φ is a morphism whose image V is a variety (specify I(V ) explicitly). Then\nprove that P1 × P1 ≃V by giving an inverse morphism.\n4. Let x0, . . . , xm and y0, . . . , yn be homogeneous coordinates for Pm and Pn respectively,\nand for 0 ≤i ≤m and 0 ≤j ≤n let zij be homogeneous coordinates for PN, where\nN = (m + 1)(n + 1) -1. Prove that the Segre morphism from φ: Pm\nN\n× Pn →PN\ndefined by zij = xiyj is an isomorphism to a projective variety V ⊆P .\n5. The field C is an affine R-algebra (an integral domain finitely generated over R). Show\nthat the tensor product of R-algebras C ⊗R C is not an integral domain, hence not\nan affine R-algebra. Thus Lemma 16.4, which states that a tensor product of affine\nalgebras is again an affine algebra, depends on the assumption that k is algebraically\nclosed. Explain exactly where in the proof this assumption is used.\n6. Let X be a variety. Chevalley's criterion states that if for every variety Z ⊆X and\nevery valuation ring R of k(Z)/k there is a point P ∈Z such that OP,Z ⊆R, then X\nis complete. We proved in Lecture 16 that affine varieties of positive dimension are\nnot complete, hence such varieties cannot satisfy Chevalley's criterion. Write down\nan explicit affine plane curve X and exhibit Z and R for which X does not satisfy\nChevalley's criterion. Then indicate which point or points in the projective closure\nof X address this deficiency.\n\nProblem 2. Valuation rings (50 points)\nAn ordered abelian group is an abelian group Γ with a total order ≤that is compatible with\nthe group operation. This means that for all a, b, c ∈Γ the following hold:\na ≤b ≤a\n=⇒\na = b\n(antisymmetry)\na ≤b ≤c\n=⇒\na ≤c\n(transitivity)\na ≤b\n=⇒\nb ≤a\n(totality)\na ≤b\n=⇒\na + c ≤b + c\n(compatibility)\nNote that totality implies reflexivity (a ≤a) . Given an ordered abelian group Γ, we define\nthe relations ≥, <, > and the sets Γ\n0, Γ\n0, Γ<0, and Γ\nin\n≤\n≥\n>0\nthe obvious way.\nA valuation v on a field K is a surjective homomorphism v: K× →Γ to an ordered\nabelian group Γ that satisfies v(x + y) ≥min(v(x), v(y)) for all x, y ∈K×. The group Γ is\ncalled the value group of v, and when Γ = {0} we say that v is the trivial valuation.\n1. Let R be a valuation ring with fraction field F, and let v: F × →F ×/R× = Γ be the\nquotient map. Show that the relation ≤on Γ defined by\nv(x) ≤v(y) ⇐⇒y/x ∈R,\nmakes Γ an ordered abelian group and that v is a valuation on F.\n2. Let F be a field and let v: F × →Γ be a non-trivial valuation. Prove that the set\nRv := v-1(Γ≥0) ∪{0}\nis a valuation ring of F and that v(x) ≤v(y) ⇐⇒y/x ∈Rv (note that this includes\nproving that Rv is actually a ring).\n3. Let Γ an ordered abelian group, let k be a field, and let A be the k-algebra generated by\nthe set of formal symbols {xa : a ∈Γ\n0}, with multiplication defined by xaxb = xa+b.\n≥\nThis means that A consists of all sums of the form\nc\na∈\nX\naxa\nΓ≥0\nwith ca ∈k and only finitely many nonzero. Let F be the fraction field of A and\ndefine the function v: F × →Γ by\nv\nP caxa\n= min{a : ca = 0\ndaxa\n} -min{a : da = 0}.\nProve that v is a valuation\nP\nof F with value group Γ.\n4. Let v: F × →Γv and w: F × →Γw be two valuations on a field F, and let Rv and\nRw be the corresponding valuation rings. Prove that Rv = Rw if and only if there is\nan order preserving isomorphism ρ: Γv →Γw for which ρ *v = w (in which case we\nsay that v and w are equivalent). Thus there is a one-to-one correspondence between\nvaluation rings and equivalence classes of valuations.\n\n5. Let D be an integral domain that is properly contained in its fraction field F, and let R\nbe the set of local rings that contain D and are properly contained in F. Partially\norder R by writing R1 ≤R2 if R1 ⊆R2 and the maximal ideal of R1 is contained\nin the maximal ideal of R2.1 Zorn's lemma states that any partially ordered set in\nwhich every chain has an upper bound contains at least one maximal element. Use\nthis to prove that R contains a maximal element R, and then show that any such R\nis a valuation ring (note: the hypothesis of Zorn's lemma is understood to include the\nempty chain, so you must prove that R is nonempty).\n6. Prove that every valuation ring R is integrally closed. This means that every element\nof the fraction field of R that is the root of a monic polynomial in R[x] lies in R.\nProblem 4. Survey\nComplete the following survey by rating each problem on a scale of 1 to 10 according to how\ninteresting you found the problem (1 = \"mind-numbing,\" 10 = \"mind-blowing\"), and how\ndifficult you found the problem (1 = \"trivial,\" 10 = \"brutal\"). Also estimate the amount\nof time you spent on each problem.\nInterest\nDifficulty\nTime Spent\nProblem 1\nProblem 2\nPlease rate each of the following lectures that you attended, according to the quality of the\nmaterial (1=\"useless\", 10=\"fascinating\"), the quality of the presentation (1=\"epic fail\",\n10=\"perfection\"), the pace (1=\"way too slow\", 10=\"way too fast\"), and the novelty of the\nmaterial (1=\"old hat\", 10=\"all new\").\nDate\nLecture Topic\nMaterial\nPresentation\nPace\nNovelty\n10/31\nProducts of varieties, Chevalley's criterion\n11/5\nComplete varieties, tangent spaces\nFeel free to record any additional comments you have on the problem sets or lectures; in\nparticular, how you think they might be improved.\n1This is known as the dominance ordering.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/bb7d15e5b09a2af2f480847680378699_MIT18_782F13_lec1.pdf",
      "content": "Introduction to Arithmetic Geometry\n18.782\nAndrew V. Sutherland\nSeptember 5, 2013\n\nWhat is arithmetic geometry?\nArithmetic geometry applies the techniques of algebraic geometry to\nproblems in number theory (a.k.a. arithmetic).\nAlgebraic geometry studies systems of polynomial equations (varieties):\nf1(x1, . . . , xn) = 0\n...\nfm(x1, . . . , xn) = 0,\ntypically over algebraically closed fields of characteristic zero (like C).\nIn arithmetic geometry we usually work over non-algebraically closed\nfields (like Q), and often in fields of non-zero characteristic (like Fp),\nand we may even restrict ourselves to rings that are not a field (like Z).\n\nDiophantine equations\nExample (Pythagorean triples - easy)\nThe equation x2 + y2 = 1 has infinitely many rational solutions.\nEach corresponds to an integer solution to x2 + y2 = z2.\nExample (Fermat's last theorem - hard)\nxn + yn = zn has no rational solutions with xyz = 0 for integer n > 2.\nExample (Congruent number problem - unsolved)\nA congruent number n is the integer area of a right triangle with\nrational sides. For example, 5 is the area of a (3/2, 20/3, 41/6) triangle.\nThis occurs iffy2 = x3 -n2x has infinitely many rational solutions.\nDetermining when this happens is an open problem (solved if BSD holds).\n\nHilbert's 10th problem\nIs there a process according to which it can be determined\nin a finite number of operations whether a given Diophantine\nequation has any integer solutions?\nThe answer is no; this problem is formally undecidable (proved in 1970\nby Matiyasevich, building on the work of Davis, Putnam, and Robinson).\nIt is unknown whether the problem of determining the existence of\nrational solutions is undecidable or not (it is conjectured to be so).\nIf we restrict to equations with just 2 variables (plane curves), then this\nproblem is believed to be decidable, but there is no known algorithm for\ndoing so (unless we also restrict the degree to 2).\n\nAlgebraic curves\nA curve is an algebraic variety of dimension 1 (defined over a field k).\nIn n-dimensional affine space kn, this means we have a system of n -1\npolynomials in n variables (n + 1 variables in projective space).\nFor the sake of simplicity we will usually work with plane curves (n = 2)\ndefined by a single polynomial equation. But we should remember that\nnot all curves are plane curves (the intersection of two quadric surfaces in\n3-space, for example), and we may sometimes need to embed our plane\ncurves in a higher dimensional space in order to remove singularities.\nWhile we will often define our curves using affine equations f(x, y) = 0,\nit is more convenient to work with projective curves defined by\nhomogeneous equations g(x, y, z) = 0 in which every term has the same\ndegree. Such a g can be obtained by homogenizing f (multiplying each\nterm by an appropriate power of z); we then have f(x, y) = g(x, y, 1).\n\nThe projective plane\nDefinition\nThe projective plane P2(k) is the set of all nonzero triples (x, y, z) ∈k3,\nmodulo the equivalence relation (x, y, z) ∼(λx, λy, λz) for all λ ∈k∗.\nThe projective point (x : y : z) is the equivalence class of (x, y, z).\n\nThe projective plane\nDefinition\nThe projective plane P2(k) is the set of all nonzero triples (x, y, z) ∈k3,\nmodulo the equivalence relation (x, y, z) ∼(λx, λy, λz) for all λ ∈k∗.\nThe projective point (x : y : z) is the equivalence class of (x, y, z).\nWe may call points of the form (x : y : 1) affine points.\nThey form an affine plane A2(k) embedded in P2(k).\nWe may call points of the form (x : y : 0) points at infinity.\nThese consist of the points (x : 1 : 0) and the point (1 : 0 : 0), which\nform the line at infinity, a projective line P1(k) embedded in P2(k).\n(of course this is just one way to partition P2 as A2 S P1).\n\nPlane projective curves\nDefinition\nA plane projective curve C/k is defined by a homogeneous polynomial\nf(x, y, z) with coefficients in k.1\nFor any field K containing k, the K-rational points of Cf form the set\nC(K) = {(x : y : z) ∈P2(K) | f(x, y, z) = 0}.\nA point P ∈C(K) is singular if ∂f\n∂x, ∂f\n∂y , ∂f\n∂z all vanish at P.\nC is smooth (or nonsingular) if there are no singular points in C( k).\nC is (geometrically) irreducible if f(x, y, z) does not factor over k.\nWe will always work with curves that are irreducible.\nWe will usually work with curves that are smooth.\n1Fine print: up to scalar equivalence and with no repeated factors in k[x, y, z].\n\nExamples of plane projective curves over Q\naffine equation\nf(x, y, z)\npoints at inf\ny = mx + b\ny -mx -bz\n(1 : m : 0)\nx2 -y2 = 1\nx2 -y2 -z2\n(1 : 1 : 0), (1, -1, 0)\ny2 = x3 + Ax + B\ny2z -x3 -Axz2 -Bz3\n(0 : 1 : 0)\nx4 + y4 = 1\nx4 + y4 -z4\nnone\nx2 + y2 = 1 -x2y2\nx2z2 + y2z2 -z4 + x2y2\n(1 : 0 : 0), (0 : 1 : 0)\nThese curves are all irreducible.\nThe first four are smooth (provided that 4A3 + 27B2 = 0).\nThe last curve is singular (both points at infinity are singular).\n\nGenus\nOver C, an irreducible smooth projective curve is a connected compact\nC-manifold of dimension 1 (a compact Riemann surface).\nEvery such manifold is topologically equivalent to a sphere with handles.\nThe number of handles is the (topological) genus.\ngenus 0\ngenus 1\ngenus 2\ngenus 3\nLater in the course we will give an algebraic definition of genus that\nworks over any field (and agrees with the topological genus over C).\nThe genus is the single most important invariant of a curve.\n\nNewton polygon\nDefinition\nThe Newton polygon of a polynomial f(x, y) = P aijxiyj is the\nconvex hull of the set {(i, j) : aij = 0} in R2.\nAn easy way to compute the genus of a (sufficiently general) irreducible\ncurve defined by an affine equation f(x, y) = 0 is to count the integer\nlattice points in the interior of its Newton polygon:2\ny2 = x3 + Ax + B.\n2See http://arxiv.org/abs/1304.4997 for more on Newton polygons.\n\nBirational equivalence\nA rational map between two varieties is a map defined by rational\nfunctions (which need not be defined at every point). For example, the\nmap that sends the point (0, t) on the vertical line x = 0 to the point\n1 -t2\n1 + t2 ,\n2t\n1 + t2\n\non the unit circle x2 + y2 = 1 is a rational map of plane curves.\nThe inverse map sends (x, y) on the unit circle to (0, y/(x + 1)). Varieties\nrelated by rational maps φ and φ such that both φ *φ and φ *φ are the\nidentity at all points where both are defined are birationally equivalent.\nThe genus is invariant under birational equivalence (as are most things).\nWe will give a finer notion of equivalence (isomorphism) later in the\ncourse.\n\nCurves of genus 0\nAs may be seen by their Newton polytopes, plane curves C of genus 0 are\n(in general) either conics (degree 2 curves), or of the form y = g(x).\nIn the latter case we can immediately parameterize the points of C(k):\nthe affine points are all of the form\nt, g(t)\n\n, with t ∈k.\n\nCurves of genus 0\nAs may be seen by their Newton polytopes, plane curves C of genus 0 are\n(in general) either conics (degree 2 curves), or of the form y = g(x).\nIn the latter case we can immediately parameterize the points of C(k):\nthe affine points are all of the form\nt, g(t)\n\n, with t ∈k.\nIn the case of a plane conic ax2 +bxy +cy2 +dx+ey +f = 0 over a field\nwhose characteristic is not 2, after a linear change of variables (complete\nthe square at most 3 times) we obtain an affine equation of the form\nax2 + by2 = 1.\nIf this equation has a rational solution (x0, y0), then the substitution\nx = (1 -x0u)/u and y = (t -y0u)/u yields\na(1 -2x0u + x2\n0u2) + b(t2 -2y0tu + y2\n0u2) = u2\na + bt2 -(2ax0 + 2by0t)u = 0,\nand the parameterization\nt, g(t)\n\n, where g(t) =\na+bt2\n2ax0+2by0t ∈k(t).\n\nRational points in genus 0\nThus a curve of genus 0 either has no rational points, or it has infinitely\nmany. Another way to see this is to note that any line with rational slope\nthat passes through a rational point on a degree-2 curve intersects the\ncurve in another rational point (this gives a slope parameterization).\n\nRational points in genus 0\nThus a curve of genus 0 either has no rational points, or it has infinitely\nmany. Another way to see this is to note that any line with rational slope\nthat passes through a rational point on a degree-2 curve intersects the\ncurve in another rational point (this gives a slope parameterization).\nExample\nx2 + y2 = 3 has no rational solutions.\nx2 + y2 = 2 has infinitely many rational solutions.\nThe question of integer solutions is slightly more delicate.\nFor example, x2 + y2 = 2 has only four integer solutions (±1, ±1).\nBut x2 -2y2 = 1 has infinitely many integer solutions (xn, yn),\nwhere xn + yn\n√\n2 = (3 + 2\n√\n2)n.\nThe first few are (3, 2), (17, 12), (577, 408), . . .\n\nCurves of genus 1 - elliptic curves\nLet E/k be a smooth irreducible genus 1 curve with a rational point P.\nThen E is called an elliptic curve (which is not an ellipse!).\nNote: not every smooth irreducible genus 1 curve has a rational point.\nOver Q, the curve defined by x3 + 2y3 = 4 is such a case.\nEvery elliptic curve can be put in Weierstrass form:\ny2 + a1xy + a3y = x3 + a2x2 + a4x + a6,\nwhere P corresponds to the point (0 : 1 : 0) at infinity.\nIf k has characteristic different from 2 or 3 we can even put C in the form\ny2 = x3 + Ax + B.\n\nRational points in genus 1\nNow let E be an elliptic curve over Q defined by a Weierstrass equation.\nIf P is a rational point and lis a line through P with rational slope,\nit is not necessarily true that lintersects E in another rational point.\nHowever, if P and Q are two rational points on E, then the line PQ\nintersects E in a third rational point R (this follows from Bezout's\ntheorem and a little algebra). This allows us to generate new rational\npoints from old ones.\nEven better, it allows us to define a group operation on E(Q),\nor on E(k) for any elliptic curve E defined over any field k.\n\nThe elliptic curve group law\nThree points on a line sum to zero, the point at infinity.\n\nThe elliptic curve group law\nWith addition defined as above, the set E(k) becomes an abelian group.\n▶The point (0 : 1 : 0) at infinity is the identity element 0.\n▶The inverse of P = (x : y : z) is the point -P = (x : -y : z).\n▶Commutativity is obvious: P + Q = Q + P.\n▶Associativity is not so obvious: P + (Q + R) = (P + Q) + R.\nThe computation of P + Q = R is purely algebraic.\nThe coordinates of R are rational functions of the coordinates of P\nand Q, and can be defined over any field.\n\nRational points on elliptic curves\nThe group E(Q) may be finite or infinite, but in every case it is finitely\ngenerated.\nTheorem (Mordell 1922)\nThe group E(Q) is a finitely generated abelian group. Thus\nE(Q) ≃T ⊕Zr,\nwhere the torsion subgroup T is a finite abelian group corresponding to\nthe elements of E(Q) with finite order, and r is the rank of E(Q).\nIt may happen (and often does) that r = 0 and T is the trivial group.\nIn this case the only element of E(Q) is the point at infinity.\n\nThe group E(Q)\nThe torsion subgroup T of E(Q) is well understood.\nTheorem (Mazur 1977)\nThe torsion subgroup of E(Q) is isomorphic to one of the following:\nZ/nZ\nor\nZ/2Z ⊕Z/2mZ,\nwhere n ∈{1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 12} and m ∈{1, 2, 3, 4}.\n\nThe ranks of elliptic curves over Q\nThe rank r of E(Q) is not well understood.\nHere are some of the things we do not know about r:\n1. Is there an algorithm that is guaranteed to correctly compute r?\n2. Which values of r can occur?\n3. How often does each possible value of r occur, on average?\n4. Is there an upper limit, or can r be arbitrarily large?\n\nThe ranks of elliptic curves over Q\nThe rank r of E(Q) is not well understood.\nHere are some of the things we do not know about r:\n1. Is there an algorithm that is guaranteed to correctly compute r?\n2. Which values of r can occur?\n3. How often does each possible value of r occur, on average?\n4. Is there an upper limit, or can r be arbitrarily large?\nWe do know a few things about r. We can compute r in most cases\nwhere r is small. When r is large often the best we can do is a lower\nbound; the largest example is a curve with r ≥28 due to Elkies (2006).\n\nThe ranks of elliptic curves over Q\nThe most significant thing we know about r is a bound on its average\nvalue over all elliptic curves (suitably ordered).\nThe following result is very recent and is still being improved.\nTheorem (Bhargava, Shankar 2010-2012)\nThe average rank of all elliptic curves over Q is less than 1.\nIt is believed that the average rank is exactly 1/2.\n\nThe group E(Fp)\nOver a finite field Fp, the group E(Fp) is necessarily finite.\nOn average, the size of the group is p + 1, but it varies, depending on E.\nThe following theorem of Hasse was originally conjectured by Emil Artin.\nTheorem (Hasse 1933)\nThe cardinality of E(Fp) satisfies #E(Fp) = p + 1 -t, with |t| ≤2√p.\n\nThe group E(Fp)\nOver a finite field Fp, the group E(Fp) is necessarily finite.\nOn average, the size of the group is p + 1, but it varies, depending on E.\nThe following theorem of Hasse was originally conjectured by Emil Artin.\nTheorem (Hasse 1933)\nThe cardinality of E(Fp) satisfies #E(Fp) = p + 1 -t, with |t| ≤2√p.\nThe fact that E(Fp) is a group whose size is not fixed by p is unique\nto genus 1 curves. This is the basis of many useful applications.\nFor curves C of genus g = 0, we always have #C(Fp) = p + 1.\nFor curves C of genus g > 1, the set C(Fp) does not form a group.\n(But as we shall see, there is way to associate an abelian group to C.)\n\nReducing elliptic curves over Q modulo p\nLet E/Q be an elliptic curve defined by y2 = x3 + Ax + B, and let p be a\nprime that does not divide the discriminant ∆(E) = -16(4A3 + 27B2).\nThe elliptic curve E is then said to have good reduction at p.\nIf we reduce A and B modulo p, we obtain an elliptic curve\nE = E mod p defined over the finite field Fp ≃Z/pZ.\nThus from a single curve E/Q we get an infinite family of curves E,\none for each prime p where E has good reduction.\nNow we may ask, how does # E(Fp) vary with p?\n\nThe Sato-Tate conjecture\nWe know # E(Fp) = p + 1 -ap for some integer ap with |ap| ≤2√p.\nSo let xp = ap/√p. Then xp is a real number in the interval [-2, 2].\nWhat is the distribution of xp as p varies? Is it uniform?\nhttp://math.mit.edu:/~drew\n\nThe Sato-Tate conjecture\nWe know # E(Fp) = p + 1 -ap for some integer ap with |ap| ≤2√p.\nSo let xp = ap/√p. Then xp is a real number in the interval [-2, 2].\nWhat is the distribution of xp as p varies? Is it uniform?\nhttp://math.mit.edu:/~drew\nThe Sato-Tate conjecture, open for nearly 50 years, was recently proven.\nTheorem (Taylor et al., 2006 and 2008)\nLet E/Q be an elliptic curve without complex multiplication.\nThen the xp have a semi-circular distribution.\n\nThe Birch and Swinnerton-Dyer conjecture\nThere is believed to be a relationship between the infinite sequence of\nintegers ap associated to an elliptic curve E/Q and the rank r.\nThe L-function LE(s) of an elliptic curve E/Q is a function of a\ncomplex variable s that \"encodes\" the infinite sequence of integers ap.\nFor the \"bad\" primes that divide ∆(E), one defines ap to be 0, 1, or -1,\ndepending on the type of singularity E has when reduced mod p.\nLE(s) =\nY\nbad p\n(1 -app-s)-1 Y\ngood p\n(1 -app-s + p1-2s)-1 =\ninf\nX\nn=0\nann-s\n\nThe Birch and Swinnerton-Dyer conjecture\nBased on extensive computer experiments (back in the 1960s!), Bryan\nBirch and Peter Swinnerton-Dyer made the following conjecture.\nConjecture (Birch and Swinnerton-Dyer)\nLet E/Q be an elliptic curve with rank r. Then\nLE(s) = (s -1)rg(s),\nfor some complex analytic function g(s) with g(1) = 0, inf. In other\nwords, r is equal to the order of vanishing of LE(s) at 1.\nThey subsequently made a much more precise conjecture about LE(s),\nbut there is already a $1,000,000 bounty on the conjecture above.\n\nFermat's Last Theorem\nTheorem (Wiles et al. 1995)\nxn + yn = zn has no rational solutions with xyz = 0 and integer n > 2.\nWe may assume that n prime and x and y are relatively prime integers.\nSuppose an + bn = cn with n > 3 (Euler addressed the case n = 3).\nConsider the elliptic curve E/Q defined by\ny2 = x(x -an)(x -bn).\nSerre and Ribet proved that E is not modular.\nWiles (with help from Taylor) proved that every semistable elliptic curve,\nincluding E, is modular. So no solution an + bn = cn can possibly exist.\n\nCurves of genus greater than 1\nThe most important thing to know about rational points on curves of\ngenus greater than 1 is that there are only finitely many.\nTheorem (Faltings 1983)\nLet C/Q be an irreducible curve of genus greater than 1. Then the\ncardinality of C(Q) is finite.\nThis result was originally conjectured by Mordell in 1922 and later\ngeneralized to number fields (finite extensions of Q). Faltings actually\nproved the generalization to number fields.\nFaltings' theorem is notably ineffective. Even though we know the\ncardinality of C(Q) is finite, we have no upper bound on its size.\n\nJacobians of curves\nAs noted earlier, for curves C of genus g > 1, there is no natural group\noperation. However, it is possible to define a g-dimensional variety\nJac(C), the Jacobian of C, whose points admit a commutative group\noperation; Jac(C) is an example of an abelian variety.\nAn elliptic curve E is isomorphic to Jac(E) (as abelian varieties).\nWe will restrict our attention to Jacobians of hyperelliptic curves.\nOver fields of characteristic different from 2, hyperelliptic curves of\ngenus g can be defined by an affine equation of the form\ny2 = f(x),\nwhere f(x) is a polynomial of degree 2g + 1 or 2g + 2.\nThe case g = 1 corresponds to an elliptic curve.\nEvery curve of genus 2 is a hyperelliptic curve (not true in higher genus).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 10",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/196f7a627ae6d75ab009bbef96e7c8c9_MIT18_782F13_lec10.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #10\n10/8/2013\nIn this lecture we lay the groundwork needed to prove the Hasse-Minkowski theorem\nfor Q, which states that a quadratic form over Q represents 0 if and only if it represents 0\nover every completion of Q (as proved by Minkowski). The statement still holds if Q is\nreplaced by any number field (as proved by Hasse), but we will restrict our attention to Q.\nUnless otherwise indicated, we use p througout to denote any prime of Q, including the\narchimedean prime p = inf. We begin by defining the Hilbert symbol for p.\n10.1\nThe Hilbert symbol\nDefinition 10.1. For a, b ∈Q×\np the Hilbert symbol (a, b)p is defined by\n(\nax2 + by2 = 1 has a solution in Qp,\n(a, b)p =\n-1\notherwise.\nIt is clear from the definition that the Hilbert symbol is symmetric, and that it only depends\non the images of a and b in Q×\np /Q×2\np\n(their square classes). We note that\nQ×\np /Q×2\np\n≃\n\n≃Z/2Z\nif p = inf,\n(Z/2Z\n\n≃\n)2\nif p is odd,\n≃(Z/2Z)3\nif p = 2.\nThe case p = infis clear, since R× = Q× has just two square classes (positive and negative\ninf\nnumbers), and the cases with p < infwere proved in Problem Set 4. Thus the Hilbert\nsymbol can be viewed as a map (Q×/Q×2) × (Q×/Q×2) →{±1} of finite sets.\nWe say that a solution (x0, . . . , xn) to a homogeneous polynomial equation over Qp is\nprimitive if all of its elements lie in Zp and at least one lies in Z×\np . The following lemma\ngives several equivalent definitions of the Hilbert symbol.\nLemma 10.2. For any a, b ∈Q×\np , the following are equivalent:\n(i) (a, b)p = 1.\n(ii) The quadratic form z2 -ax2 -by2 represents 0.\n(iii) The equation ax2 + by2 = z2 has a primitive solution.\n(iv) a ∈Qp is the norm of an element in Qp(\n√\nb).\nProof. (i)⇒(ii) is immediate (let z = 1). The reverse implication is clear if z2-ax2-by2 = 0\nrepresents 0 with z nonzero (divide by z2), and otherwise the non-degenerate quadratic form\nax2 + by2 represents 0, hence it represents every element of Qp including 1, so (ii)⇒(i).\nTo show (ii)⇒(iii), multiply through by pr, for a suitable integer r, and rearrange terms.\nThe reverse implication (iii)⇒(ii) is immediate.\nIf b is square then Qp(\n√\nb) = Qp and N(a) = a so (iv) holds, and the form z2 -by2\nrepresents 0, hence √\nevery element of Qp including ax2\n0 for any x0, so (ii) holds. If b is not\nsquare then N(z +y\nb) = z2\n(\n√\n-by2. If a is a norm in Q\nb) then z2\nrepresen\n2 -ax2\n-ax2 -by2\nts 0\n(set x = 1), and if z\n-by2 represents 0 then dividing by x2 and adding a to both\nsides shows that a is a norm. So (ii)⇔(iv).\nAndrew V. Sutherland\n\nCorollary 10.3. For all a, b, c ∈Q×\np , the following hold:\n(i) (1, c)p = 1.\n(ii) (-c, c)p = 1.\n(iii) (a, c)p = 1 =⇒(a, c)p(b, c)p = (ab, c)p.\n(iv) (c, c)p = (-1, c)p.\nProof. Let N denote the norm map from Qp(√c) to Qp. For (i) we have N(1) = 1. For (ii),\n-c = N(-c) for c ∈Q×2 and -c = N(√c) otherwise. For (iii), If a and b are both norms\nin Q(√c), then so is ab, by the multiplicativity of the norm map; conversely, if a and ab are\nboth norms, so is 1/a, as is (1/a)ab = b. Thus if (a, c)p = 1, then (b, c)p = 1 if and only if\n(ab, c)p = 1, which implies (a, c)p(b, c)p = (ab, c)p. For (iv), (-c, c)p = 1 by (ii), so by (iii)\nwe have (c, c)p = (-c, c)p(c, c)p = (-c2, c)p = (-1, c)p.\nTheorem 10.4. (a, b)\n= -1 if and only if a, b < 0\ninf\nProof. We can assume a, b ∈{±1}, since {±1} is a complete set of representatives for\nR×/R×2. If either a or b is 1 then (√a, b)\n= 1, by Corollary 10.3.(i), and (-1, -1)\n=\ninf\n-1,\ninf\nsince -1 is not a norm in C = Q\n(\ninf\n-1).\nLemma 10.5. If p is odd, then (u, v)p = 1 for all u, v ∈Z×\np .\nProof. Recall from Lecture 3 (or the Chevalley-Warning theorem on problem set 2) that\nevery plane projective conic over Fp has a rational point, so we can find a non-trivial solution\nto z2 -ux2 -vy2 = 0 modulo p. If we then fix two of x, y, z so that the third is nonzero,\nHensel's lemma gives a solution over Zp.\nRemark 10.6. Lemma 10.5 does not hold for p = 2; for example, (3, 3)2 = -1.\nTheorem 10.7. Let p be an odd prime, and write a, b ∈Q×\np as a = pαu and b = pβv, with\nα, β ∈Z and u, v ∈Z×\np . Then\n(a, b)p = (-\np\n1)αβ\n-1\n\nβ\nu\np\nv\np\nα\n,\nwhere (x\nx mod p\n) denotes the Legendre symbol (\n).\np\np\nProof. Since (a, b)p depends only on the square classes of a and b, we assume α, β ∈{0, 1}.\nCase α = 0, β = 0: We have (u, v)p = 1, by Lemma 10.5, which agrees with the formula.\nCase α = 1, β = 0: We need to show that (pu, v)p = (v). Since (u\np\n-, v)p = 1, we have\n(pu, v)p = (pu, v)p(u-1, v)p = (p, v)p, by Corollary 10.3.(iii). If v is a square then we have\n(p, v)p = (p, 1)p = (1, p)p = 1 = (v). If v is not a square then z2 -px2 -vy2 = 0 has no non-\np\ntrivial solutions modulo p, hence no primitive solutions. This implies\nv\np-1\nCase α = 1, β = 1: We must show (pu, pv)\n\nu\np = (-1)\np\nlary 10.3 we have\n(p, v)p\nv\np\n\n= -1 = ( ).\np\n.\nApplying Corol-\n(pu, pv)p = (pu, pv)p(-pv, pv)p = (-p2uv, pv)p = (-uv, pv)p = (pv, -uv)p\nApplying the formula in the case α = 1, β = 0 already proved, we have\n(pv, -uv)p =\n-uv\np\n\n=\n-\np\nu\np\nv\np\n\nu\n= -\np-1\n( 1)\n\np\nv\np\n\n.\n\nLemma 10.8. Let u, v ∈Z×. The equations z2 -ux2 -vy2 = 0 and z2 -2ux2\n-vy = 0\nhave primitive solutions over Z2 if and only if they have primitive solutions modulo 8.\nProof. Without loss of generality we can assume that u and v are odd integers, since every\nsquare class in Z×\n2 /Z×2\nis represented by an odd integer (in fact one can assume u, v ∈\n{±1, ±5}) The necessity of having a primitive solution modulo 8 is clear. To prove sufficiency\nwe apply the strong form of Hensel's lemma proved in Problem Set 4. In both cases, if we\nhave a non-trivial solution (x0, y0, z0) modulo 8 we can fix two of x0, y0, z0 to obtain a\nquadratic polynomial f(w) over Z2 and w0 ∈Z×\n2 that satisfies v2(f(w0)) = 3 > 2 =\n2v2(f′(w0)). In the case of the second equation, note that a primitive solution (x0, y0, z0)\nmodulo 8 must have y0 or z0 odd; if not, then z2\n0 and vy2\n0, and therefore 2ux2\n0, are divisible\nby 4, but this means x0 is also divisible by 2, which contradicts the primitivity of (x0, y0, z0).\nLifting w0 to a root of f(w) over Z2 yields a solution to the original equation.\nTheorem 10.9. Write a, b ∈Q×\n2 as a = 2αu and b = 2βv with α, β ∈Z and u, v ∈Z×\n2 .\nThen\n(a, b)2 = (-1)ε(u)ε(v)+αω(v)+βω(u),\nwhere ε(u) and ω(u) denote the images in Z/2Z of (u -1)/2 and (u2 -1)/8, respectively.\nProof. Since (a, b)2 only depends on the square classes of a and b, It suffices to verify the\nformula for a, b ∈S, where S = {±1, ±3, ±2, ±6} is a complete set of representatives for\nQ×\n2 /Q×2\n2 . As in the proof of Theorem 10.7, we can use (pu, pv)2 = (pv, -uv)2 to reduce to\nthe case where one of a, b lies in Z×\np . By Lemma 10.8, to compute (a, b)2 with one of a, b\nin Z×, it suffices to check for primitive solutions to z2 -ax2\n-by\n= 0 modulo 8, which\nreduces the problem to a finite verification which performed by\nWe now note the following corollary to Theorems 10.4, 10.7, and 10.9.\nCorollary 10.10. The Hilbert symbol (a, b)p is a nondegenerate bilinear map. This means\nthat for all a, b, c ∈Q×\np we have\n(a, c)p(b, c)p = (ab, c)\nand\n(a, b)p(a, c)p = (a, bc)p,\nand that for every non-square c we have (b, c)p = -1 for some b.\nProof. Both statements are clear for p = inf(there are only 2 square classes and 4 combi-\np-1\nnations to check). For p odd, let c = pγw and fix ε = (-1)γ\n2 . Then for a = pαu and\nb = pβv, we have\nγ\nα\nγ\nβ\nv\n(\nc)\nα\nu\nw\nβ\nw\na,\np(b, c)p = ε\n\np\n\np\n\nε\n\np\n\np\nγ\nα+β\n\n= εα+β\n=\nuv\nw\np\np\n(ab, c) .\n\np\nTo verify non-degeneracy, we note that if c is not square than either γ = 1 or (w) =\np\n-1. If\nγ\nγ = 1 we can choose b = v with (v) =\n1, so that (b, c)p = (v) =\n1. If γ = 0, then ε = 1\np\np\nand (w\n-\n-\n) =\np\n-1, so withb = p we have (b, c)p = (w) =\np\n-1.\n18.782 Lecture 10 Sage\nWorksheet.\n\nFor p = 2, we have\n(a, c) (b, c) = (-1)ε(u)ε(w)+αω(w)+γω(u)(-1)ε(v)ε(w)+βω(w)+γω(v)\n= (-1)(ε(u)+ε(v))ε(w)+(α+β)ω(w)+γ(ω(u)+ω(v))\n= (-1)ε(uv)ε(w)+(α+β)ω(w)+γω(uv)\n= (ab, c)2,\nwhere we have used the fact that ε and ω are group homomorphisms from Z×\n2 to Z/2Z. To\nsee this, note that the image of ε-1(0) in (Z/4Z)× is {1}, a subgroup of index 2, and the\nimage of ω-1(0) in (Z/8Z)× is {±1}, which is again a subgroup of index 2.\nWe now verify non-degeneracy for p = 2. If c is not square then either γ = 1, or one\nof ε(w) and ω(w) is nonzero. If γ = 1, then (5, c)2 = -1. If γ = 0 and ω(w) = 1, then\n(2, c)2 = -1. If γ = 0 and ω(w) = 0, then we must have ε(w) = 1, so (-1, c)2 = -1.\nWe now prove Hilbert's reciprocity law, which may be regarded as a generalization of\nquadratic reciprocity.\nTheorem 10.11. Let a, b ∈Q×. Then (a, b)p = 1 for all but finitely many primes p and\nY\n(a, b)p = 1.\np\nProof. We can assume without loss of generality that a, b ∈Z, since multiplying each of a\nand b by the square of its denominator will not change (a, b)p for any p. The theorem holds\nif either a or b is 1, and by the bilinearity of the Hilbert symbol, we can assume that\na, b ∈{-1} ∪{q ∈Z>0 : q is prime}.\nThe first statement of the theorem is clear, since a, b ∈Z×\np for p < infnot equal to a or\nb, and (u, v)p = 1 for all u, v ∈Z×\np when p is odd, by Lemma 10.5. To verify the product\nformula, we consider 5 cases.\nCase 1: a = b = -1. Then (-1, -1)\n= (-1,\n1)\ninf\n-\n2 = -1 and (-1, -1)p = 1 for p odd.\nCase 2: a = -1 and b is prime. If b = 2 then (1, 1) is a solution to -x2 + 2y2 = 1\nover Qp for all p, thus\np(-1, 2) = 1. If b is odd, then (\nε\n-1, b)p = 1 for p\n(b)\n(b\n1)\n∈{2, b}, while\n(-1, b)2 = (-1)\nand (-1, b)b = (-), both of which are equal to (\nb\n-1)\n-\n/2.\nCase 3: a and b are\nQ\nthe same prime. Then by Corollary 10.3, (b, b)p = (-1, b)p for all\nprimes p, and we are in case 2.\nCase 4: a = 2 and b is an odd prime.\nThen (2, b)p = 1 for all p\nω(b)\n(b2\n1)/8\n∈{2, b}, while\n(2, b)2 = (-1)\nand (2, b)b = ( ), both of which are equal to (-1)\np\n-\n.\nCase 5: a and b are distinct odd primes. Then (a, b)p = 1 for all p ∈{2, a, b}, while\n(-1)ε(a)ε(b)\nif p = 2,\n(a, b)\na\np =\n\nb\n\nif p = b,\nb\nif p = a.\na\nSince ε(x) = (x -1)/2 mod 2, we have\nY\na-1 b-1\na\nb\n(a, b)p = (\n=\na\np\n-1)\n\nb\n\n1,\nby quadratic reciprocity.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 11",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/07649a23c61675ef75f12a8b77367e93_MIT18_782F13_lec11.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #11\n10/10/2013\n11.1\nQuadratic forms over Qp\nThe Hasse-Minkowski theorem reduces the problem of determining whether a quadratic form\nf over Q represents 0 to the problem of determining whether f represents zero over Qp for\nall p ≤inf. At first glance this might not seem like progress, since there are infinitely many p\nto check, but in fact we only need to check p = 2, p = infand a finite set of odd primes.\nTheorem 11.1. Let p be an odd prime and let f be a diagonal quadratic form of dimension\nn > 2 with coefficients a1, . . . , an ∈Zp\n×. Then f represents 0 over Qp.\nProof. The equation f(x1, . . . , xn) ≡0 mod p is a homogeneous equation of degree 2 in\nn > 2 variables over Fp.\nIt follows from the Chevalley-Warning theorem that it has a\nnon-trivial solution (y1, . . . , yn) over Fp ≃Z/pZ. Assume without loss of generality that\ny1 = 0 and let g(z) be the univariate polynomial g(y) = f(y, y2, . . . , yn) over Zp. Then\ng(y1) ≡0 mod p and g′(y1) = 2a1y1 ≡0 mod p, so by Hensel's lemma there is a root z1 of\ng(y) over Zp. We then have f(z1, y2, . . . , yn) = g(z1) = 0, so f represents 0 over Qp.\nCorollary 11.2. Every quadratic form of dimension n > 2 over Q represents 0 over Qp\nfor all but finitely many primes p.\nProof. In diagonal form the coefficients a1, . . . , an lie in Z×\np for all odd p ∣a1 · · · an.\nFor quadratic forms of dimension n ≤2, we note that a nondegenerate unary form never\nrepresents 0, and the nondegenerate form ax2 +by2 represents 0 if and only if -ab is square\n(this holds over any field). But when -ab is not square it may still be the case that ax2+by2\nrepresents a given nonzero element t, and having a criterion for identifying such t will be\nuseful in our proof of the Hasse-Minkowski theorem.\nLemma 11.3. The nondegenerate quadratic form ax2 + by2 over Qp represents t ∈Q∗\np if\nand only if (a, b)p = (t, -ab)p.\nProof. Since t = 0, the equation ax2 + by2 = t has a non-trivial solution in Qp if and only\nif (a/t)x2 + (b/t)y2 = 1 has a solution, which is equivalent to (a/t, b/t)p = 1. We have\n(a/t, b/t)p = (at, bt)p = (a, bt)p(t, bt)p = (a, b)p(a, t)p(t, bt) = (a, b)p(t, abt)p\n= (a, b)p(t, abt)p(t, -t)p = (a, b)p(t, -ab)p,\nwhere we have used that the Hilbert symbol is symmetric, bilinear, invariant on square\nclasses, and satisfies (x, -x)p = 1. Thus (a/t, b/t)p = 1 if and only if (a, b)p(t, -ab)p = 1,\nwhich is equivalent to (a, b)p = (t, -ab)p since both are ±1.\nCorollary 11.4. The nondegenerate form ax2 + by2 + cz2 over Qp represents 0 if and only\nif (a, b)p = (-c, -ab)p\nProof. By the lemma, if suffices to show that ax2 + by2 + cz2 represents 0 if and only if\nthe binary form ax2 + by2 represents -c.\nThe reverse implication is clear (set z = 1).\nFor the forward implication, if ax2\n0 + by2\n0 + cz2\n0 = 0 then either z0 = 0, in which case\na(x /z2) + b(y /z )2 = -c or z\n= 0 in which case ax2\n+ by\nrepresents 0 and therefore\nevery element of Qp, including -c.\nAndrew V. Sutherland\n\nCorollary 11.5. A ternary quadratic form over Q that represents 0 over all but at most\none completion of Q represents 0 over every completion of Q.\nProof. The corollary is trivially true if the form is degenerate and otherwise it follows from\nthe product formula for Hilbert symbols and the corollary above.\n11.2\nApproximation\nWe now prove two approximation theorems that we will need to prove the Hasse-Minkowski\ntheorem for Q. These are quite general theorems that have many applications, but we will\nstate them in a particularly simple form that suffices for our purposes here. Before proving\nthem we first note/recall that Q is dense in Qp and Z is dense in Zp.\nTheorem 11.6. Let p ≤infbe any prime of Q. Under the metric d(x, y) = |x -y|p, the\nset Q is dense in Qp and the set Z is dense in Zp.\nProof. We know that Q\n= R is the completion of Q and we proved that Q\ninf\np is (isomorphic\nto) the completion of Q for p < inf, and any field is dense in its completion (this follows\nimmediately from the definition).\nWe note that the completion Z\n= Z (any Cauchy\ninf\nsequence of integers must be eventually constant), and for p < infthe we can apply the fact\nthat Zp = {x ∈Qp : |x|p ≤1} and Z = {x ∈Q : |x|p ≤1}.\nTheorem 11.7 (Weak approximation). Let S be a finite set of primes p ≤inf, and for each\np ∈S let xp ∈Qp be given. Then for every ε > 0 there exists x ∈Q such that\n|x -xp|p < ε\nfor all p ∈S. Equivalently, the image of Q in Q\np S Qp dense under the product topology.\n∈\nProof. If S has cardinality 1 we can apply Theorem 11.6, so we assume S contains at least 2\nprimes. For any particular prime p ∈S, we claim that there is a yp ∈Q such that |yp|p > 1\nand |yp|q < 1 for q ∈S -{p}. Indeed, let P be the product of the finite primes in S, and\nfor each p < infchoose r ∈Z>0 so that p-r\n(\nP < 1. Then define\nP\nif p =\nyp =\ninf,\np-rP\notherwise.\nWe now note that for any q ∈S,\nif\nlim\nn→inf|yp q =\n(\ninf\nq = p,\n|\nif q = p.\nIt follows that for each q ∈S\nyn\np\nlim\n=\nn→inf1 + ynp\n(\n1 with respect to | |q for q = p,\n0 with respect to | |q for q = p,\nsince limn\n|1 -yn\np /(1 + yn\np )|p = limn\n|1/(1 + yn\n→inf\n→inf\np )|p = 0 and limn→inf|yn\np /(1 + yn\np )|q = 0\nfor q = p. For each n ∈Z>0 define\nX x yn\np p\nzn =\n.\n1 + yn\np∈\np\nS\nThen limn\nzn = xp with respect to | |p for each p ∈S. So for any ε > 0 there is an n for\n→inf\nwhich x = zn satisfies |x -xp|p < ε for all p ∈S.\n\nTheorem 11.8 (Strong approximation). Let S be a finite set of primes p < inf, and for\neach p ∈S let xp ∈Zp be given. Then for every ε > 0 there exists x ∈Z such that\n|x -xp|p < ε\nfor all p ∈S. Equivalently, the image of Z in Q\np S Zp is dense under the product topology.\n∈\nProof. Fix ε > 0. By Theorem 11.6, for each xp we can pick yp ∈Z≥0 so that |yp -xp|p < ε.\nLet n be a positive integer such that pn > yp for all p ∈S. By the Chinese remainder\ntheorem, there exists x ∈Z such that x ≡yp mod pn for all p ∈S, and for this x we have\n|x -xp|p < ε for all p ∈S.\nRemark 11.9. In more general settings it is natural to consider the infinite product of all\nthe rings of p-adic integers\nZˆ =\np<\nY\nZp.\ninf\nRecall that for infinite products, the product topology is defined using a basis of open sets\nthat consists of sequences (Up), where each Up is an open subset of Zp, and for all but\nfinitely many p we have Up = Z\nˆ\np. It follows from Theorem 11.8 that the image of Z in Z is\ndense.\nThere is another way to define Zˆ, which is to consider the inverse system of rings (Z/nZ),\nwhere n ranges over all positive integers n and we have reduction maps from Z/mZ to Z/nZ\nwhenever n|m (note that we now have an infinite acyclic graph of maps, not just a linear\nchain). The inverse limit\nZˆ = lim Z/nZ\n←-\nˆ\nis called the profinite completion of Z. One can show that these two definitions of Z are\ncanonically isomorphic. So a more pithy statement of Theorem 11.8 is that Z is dense in\nits profinite completion (this statement applies to profinite completions in general).\nRemark 11.10. Note the difference between weak and strong approximation. With weak\napproximation we obtain a rational number x that is p-adically close to xp for each p in a\nfinite set S, but we have no control on |x|p for p ∈S. With strong approximation we obtain\na rational number (in fact an integer) x that is p-adically close to xp for each p ∈S and also\nsatisfies |x|p ≤1 for all p ∈S, except the prime p = inf; in order to apply the CRT we may\nneed to make |x|\nvery large. More generally, we could allow\ninf\ninf∈S if we grant ourselves\nthe freedom to make |x|p0 large for one prime p0 ∈S; in this case x would be a rational\nnumber, not an integer, but its denominator would be divisible by no primes other than p0,\nso that x ∈Zp for all p = p0. This is characteristic of strong approximation theorems, we\nobtain an element whose absolute value is bounded at all but one prime.\nThe following lemma follows from the strong approximation theorem and Dirichlet's\ntheorem on primes in arithmetic progressions: for any relative prime integers a and b there\nare infinitely many primes congruent to a mod b.\nLemma 11.11. Let S be a finite set of primes p ≤inf, and for each p ∈S let xp ∈Q×\np be\ngiven. Then there exists an x ∈Q such that\n(i) x ∈xpQ×2\np\nfor each p ∈S.\n(ii) |x|p = 1 for all but at most one finite prime p0 ∈S.\n\nProof. Let S0 = S -{inf}, and define the rational number\ny = ±\nY\npvp(xp),\np∈S0\nwhere the sign of y is negative if inf∈S and x\n< 0, and positive otherwise.\nThen\ninf\n|y|p = |xp|p for all p ∈S0, and it follows that for each p ∈S0 we have y = upxp for some\nup ∈Z×\np . By the strong approximation theorem there exists an integer z ≡u\ne\np mod p p, for\nall p ∈S0, where ep = 1 for odd p and ep = 3 for p = 2. It follows that z ∈upQ×2\np\nfor all\np ∈S0, since the square class of up depends only on its reduction mod pep.\nThe integers z and m = Q\np S pep are relatively prime, so it follows from Dirichlet's\n∈\ntheorem that there are infinitely many primes congruent to z mod m. Let p0 be the least\nsuch prime. Then p0 ∈zQ×2\np\nfor all p ∈S0, and x = p0y satisfies both (i) and (ii).\n11.3\nProof of the Hasse-Minkowski theorem\nBefore proving the Hasse-Minkowski theorem for Q we make one final remark. The definition\nof the Hilbert symbol we gave in the last lecture makes sense over any field, in particular Q,\nand the proofs of Lemma 10.2 and Corollary 10.3 still apply. In the proof below we use\n(a, b) to denote the Hilbert symbol of a, b ∈Q×.\nTheorem 11.12 (Hasse-Minkowski). A quadratic form over Q represents 0 if and only if\nit represents 0 over every completion of Q.\nProof. The forward implication is clear, we only need to prove the reverse implication. So\nlet f be a quadratic form over Q that represents 0 over every completion of Q. We may\nassume without loss of generality that f is a diagonal form a x2\n1 + · · · + anxn, which we\nmay denote ⟨a1, . . . , an⟩. We write ⟨a1, . . . , an⟩p to denote the same form over Qp. If any\nai = 0, then f clearly represents 0 over Q (set xi = 1 and xj = 0 for i = j), so we assume\nf is nondegenerate and proceed by induction on its dimension n.\nCase n = 1: The theorem holds trivially (f cannot represent 0 over any Qp).\nCase n = 2: The form ⟨a, b⟩p represents 0 if and only if -ab is square in Qp. Thus\nvp(-ab) ≡0 mod 2 for all p < infand -ab > 0. It follows that -ab is square in Q, and\ntherefore ⟨a, b⟩represents 0.\nCase n = 3: Let f(x, y, z) = z2 -ax2 -by2, where a and b are nonzero square-free\nintegers with |a| ≤|b|. We know (a, b)p = 1 for all p ≤infand wish to show (a, b) = 1. We\nproceed by induction on m = |a| + |b|. The base case m = 2 has a = ±1 and b = ±1, in\nwhich case (a, b)\n= 1 implies that either a or b is 1 and therefore (a, b) = 1.\ninf\nWe now suppose m ≥3, and that the result has been proven for all smaller m. For each\nprime p|b there is a primitive solution (x0, y0, z0) ∈Z3\np to z2 -ax2 -by2 = 0. We must have\np|(z2\n0 -ax2\n0), since p|b, but we cannot have p|x0 since then we would have p|z0, contradicting\nprimitivity. So x0 ∈Z×\np and a = (z0/x0)2 is a square modulo p. This holds for every prime\np|b, and b is square-free, so a is a square modulo b.\nIt follows that a + bb′ = t2 for some t, b′ ∈Z with t ≤|b/2|. This implies (a, bb′) = 1,\nsince bb′ = t2\na is the norm of t + √\n√\n-\na in Q(\na). Therefore\n(a, b) = (a, b)(a, bb′) = (a, b2b′) = (a, b′).\nWe also have (a, bb′)p = 1, and therefore (a, b′)p = (a, b)p = 1, for all p ≤inf. But\n|b′| =\nt2 -a\nb\n\nt2\na\n|b|\n\n≤ b\n+\nb\n≤\n+ 1 <\n|b|,\n\nso |a|+|b′| < m and the inductive hypothesis implies (a, b′) = 1. Thus (a, b) = 1, as desired.\nCase n = 4: Let f = ⟨a1, a2, a3, a4⟩and let S consist of the primes p|2a1a2a3a4 and inf.\nThen ai ∈Z×\np for all p ∈S.\nFor each p ∈S there exists tp ∈Q×\np such that ⟨a1, a2⟩p\nrepresents tp and ⟨a3, a4⟩p represents -tp (we can assume tp = 0: if 0 is represented, by\nboth forms, so is every element of Qp). By Lemma 11.11, there is a rational number t and\na prime p0 ∈S such that t ∈tpQ×2\np\nfor all p ∈S and |t|p = 1 for all p ∈S ∪{p0}.\nThe forms ⟨a1, a2, -t⟩p and ⟨a3, a4, t⟩p represent 0 for all p ∈S ∪{p0} because all such p\nare odd, and ai, ±t ∈Z×\np , so (a1, a2)p = 1 = (t, -a1a2)p and (a3, a4)p = 1 = (\n-t, -a3a4)p,\nand we may apply Corollary 11.4. Since t ∈tpQ×\np\nfor all p ∈S, the forms ⟨a1, a2, -t⟩p and\n⟨a3, a4, t⟩p also represent 0 for all p ∈S. Thus ⟨a1, a2, -t⟩p and ⟨a3, a4, t⟩p represent 0 for\nall p = p0, and by Corollary 11.5, also for p = p0. By the inductive hypothesis ⟨a1, a2, -t⟩\nand ⟨a3, a4, t⟩both represent 0, therefore ⟨a1, a2, a3, a4⟩represents 0.\nCase n ≥5: Let f = ⟨a1, . . . , an⟩. Let S be the set of primes for which ⟨a3, . . . , an⟩p\ndoes not represent 0. The set S is finite, by Corollary 11.2. If S is empty then ⟨a3, . . . , an⟩,\nand therefore f, represents 0, by the inductive hypothesis, so we assume S is not empty.\nFor each p ∈S pick tp ∈Q×\np represented by ⟨a1, a2⟩, say a1x2\np + a2y2\np = tp, such that\n⟨a3, . . . , an⟩p represents -tp (such a tp exists since f represents 0 over Qp and, as above, we\ncan always pick tp = 0).\nBy the weak approximation theorem there exists x, y\nQ that are simultaneously close\nenough to all the x , y\n∈Q\nso that t = a x2\n∈\np\np\np\n+ a2y\nis close enough to all the tp to\nguarantee that t ∈tpQ×2\np\nfor all p ∈S (for p < infthe square class only depends on at most\nthe first three nonzero p-adic digits, and over R = Q\nwe can ensure that x and y have the\ninf\nsame signs as x\nand y\n).1 It follows that ⟨t, a3, . . . , a\ninf\ninf\nn⟩p represents 0 for all p ∈S, and\nsince ⟨a3, . . . , an⟩p represents 0 for all p ∈S, so does ⟨t, a3, . . . , an⟩p. Thus ⟨t, a3, . . . , an⟩p\nrepresents 0 for all p, and by the inductive hypothesis, ⟨t, a3, . . . , an⟩represents 0. Therefore\n⟨a3, . . . , an⟩represents -t = -a1x2 -a2y2, hence ⟨a1, . . . , an⟩represents 0.\n1Equivalently, the set of squares Q×2\np\nis an open subset of Q×\np , hence so is every square class tpQ×2\np .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 12",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/f8693d9e3afab505ba23b3b91590aa4a_MIT18_782F13_lec12.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #12\n10/17/2013\n12.1\nField extensions\nBefore beginning our introduction to algebraic geometry we recall some standard facts about\nfield extensions. Most of these should be familiar to you and can be found in any standard\nintroductory algebra text, such as [1, 2]. We will occasionally need to results in slightly\ngreater generality than you may have seen before, and here we may reference [3, 4].1\nWe start in the general setting of an arbitrary field extension L/k with no restrictions\non k or L. The fields k and L necessarily have the same prime field (the subfield of k\ngenerated by the multiplicative identity), and therefore the same characteristic. The degree\nof the extension L/k, denoted [L: k], is the dimension of L as a k-vector space, a not\nnecessarily finite cardinal number. If have a tower of fields k ⊆L ⊆M, then\n[M : k] = [M : L][L : k],\nwhere the RHS is a product of cardinals.2 When [L : k] is finite we say that L/k is a finite\nextension.\nAn element α ∈L is said to be algebraic over k if it is the root of a polynomial in k[x],\nand otherwise it is transendental over k. The extension L/k is algebraic if every element of L\nis algebraic over k, and otherwise it is transcendental. If M/L and L/k are both algebraic\nextensions, so is M/k. A necessary and sufficient condition for L/k to be algebraic is that L\nbe equal to the union of all finite extensions of k contained in L; in particular, every finite\nextension is algebraic.\nThe subset of L consisting of the elements that are algebraic over k forms a field called\nthe algebraic closure of k in L. A field k is algebraically closed if every every non-constant\npolynomial in k[x] has a root in k; equivalently, k has no non-trivial algebraic extensions.\n\nFor every field k there exists an extension k/k with k algebraically closed; such a k is called\n\nan algebraic closure of k, and all such k are isomorphic (but this isomorphism is not unique\nin general). Any algebraic extension L/k can be embedded into any algebraic closure of k,\nsince every algebraic closure of L is also an algebraic closure of k.\nRemark 12.1. When working with algebraic extensions of k it is convenient to view them\n\nall as subfields of a some fixed algebraic closure k (there is in general no canonical choice).\nThe key point is that we can always (not necessarily uniquely) embed any algebraic extension\n\nof L/k in our chosen k, and if we have another extension M/L, our embedding of L into k\n\ncan always be extended to an embedding of M into k.\nA set S ⊆L is said to be algebraically independent (over k) if for every finite subset\n{s1, . . . , sn} of S and every nonzero polynomial f ∈k[x1, . . . , xn] we have\nf(s1, . . . , sn) = 0.\n1With the exception of [1], which you should be familiar to you from 18.701/18.702, these references are\nall available online through the MIT library system (just click the title links in the references section at the\nend of these notes). I encourage you to consult them for further details on anything that is unfamiliar to\nyou. One note of caution: when jumping into the middle of a textbook (or, especially, the results of a web\nsearch), be wary of assumptions that may have been stated much earlier (e.g. at the beginning of a chapter).\n2Recall that a cardinal number is an equivalence class of equipotent sets (sets that can be put in bijection).\nThe product of n1 = #S1 and n2 = #S2 is n1n2 = #(S1 × S2) and the sum is the cardinality of the disjoint\nunion: n1 + n2 = #(S1 ⊔S2). But we shall be primarily interested in finite cardinals (natural numbers).\nAndrew V. Sutherland\n\nNote that this means the empty set is algebraically independent (just as the empty set\nis linearly independent in any vector space). An algebraically independent set S ⊆L for\nwhich L/k(S) is algebraic is called a transcendence basis for the extension L/k.\nTheorem 12.2. Every transcendence basis for L/k has the same cardinality.\nProof. We will only prove this in the case that L/k has a finite transcendence basis (which\nincludes all extensions of interest to us); see [3, Theorem 7.9] for the general case. Let\nS = {s1, . . . , sm} be a smallest transcendence basis and let T = {t1, . . . , tn} be any other\ntranscendence basis, with n ≥m. The set {t1, s1, . . . , sm} must then algebraically depen-\ndent, since t1 ∈L is algebraic over k(S), and since t1 is transcendental over k, some si, say s1,\nmust be algebraic over k(t1, s2, . . . , sm). It follows that L is algebraic over k(t1, s2, . . . , sm),\nand the set T1 = {t1, s2, . . . , sm} must be algebraically independent, otherwise it would\ncontain a transcendence basis for L/k smaller than S. So T1 is a transcendence basis for\nL/k of cardinality m that contains t1.\nContinuing in this fashion, for i = 2, . . . , m we can iteratively construct transcendence\nbases Ti of cardinality m that contain {t1, . . . , ti}, until Tm ⊆T is a transcendence basis of\ncardinality m; but then we must have Tm = T, so n = m.\nDefinition 12.3. The transcendence degree of a field extension L/K is the cardinality of\nany (hence every) transcendence basis for L/k.\nUnlike extension degrees, which multiply in towers, transcendence degrees add in towers:\nfor any fields k ⊆L ⊆M, the transcendence degree of M/k is the sum (as cardinals) of the\ntranscendence degrees of M/L and L/k.\nWe say that the extension L/k is purely transcendental if L = k(S) for some tran-\nscendence basis S for L/k. All purely transcendental extensions of k with the same tran-\nscendence degree are isomorphic. Every field extension L/k can be viewed as an algebraic\nextension of a purely transcendental extension: if S is a transcendence basis of L/k then\nL/k(S) is an algebraic extension of the purely transcendental extension k(S)/k.\nRemark 12.4. It is not the case that every field extension is a purely transcendental\nextension of an algebraic extension. Indeed, there are already plenty of counterexamples\nwith transcendence degree 1, as we shall soon see.\nThe field extension L/k is said to be simple if L = k(x) for some x ∈L. A purely\ntranscendental extension of transcendence degree 1 is obviously simple, but, less trivially,\nso is any finite separable extension (see below for the definition of separable); this is known\nas the primitive element theorem.\nRemark 12.5. The notation k(x) can be slightly confusing. If x ∈L is transcendental\nover k then k(x) is isomorphic to the field of rational functions over k, in which case we\nmay as well regard x as a variable. But if x ∈L is algebraic over k, then every rational\nexpression r(x) with nonzero denominator can be simplified to a polynomial in x of degree\nless than n = [k(x) : k] by reducing modulo the minimal polynomial f of x (note that\nwe can invert nonzero denominators modulo f); indeed, this follows from the fact that\n{1, x, . . . , xn-1} is a basis for the n-dimensional k-vector space k(x).\n\n12.1.1\nAlgebraic extensions\n\nWe now assume that L/k is algebraic and fix k so that L ∈ k. The extension L/k is normal\nif it satisfies either of the equivalent conditions:\n- every irreducible polynomial in k[x] with a root in L splits completely in L;\n- σ(L) = L for all σ ∈Aut(k/k) (every automorphism of k that fixes k also fixes L).3\nEven if L/k is not normal, there is always an algebraic extension M/L for which M/k is\nnormal. The minimal such extension is called the normal closure of L/k; it exists because\nintersections of normal extensions are normal. It is not true in general that if L/k and M/L\nare normal extensions then so is M/k, but if k ⊆L ⊆M is a tower of fields with M/k\nnormal, then M/L is normal (but L/k need not be).\nA polynomial f ∈k[x] is separable if any of the following equivalent conditions hold:\n-\n\nthe factors of f in k[x] are all distinct;\n- f and f′\n\nhave no common root in k;\n- gcd(f, f′) = 1 in k[x].\nAn element α ∈L is separable over k if any of the following equivalent conditions hold:\n- α is a root of a separable polynomial f ∈k[x];\n- the minimal polynomial of α is separable;\n- char(k) = 0 or char(k) = p > 0 and the minimal polynomial of α is not of the form\ng(xp) for some g ∈k[x].\nThe elements of L that are separable over k form a field called the separable closure of k\n\nin L. The separable closure of k in its algebraic closure k is denoted ksep and is simply\ncalled the separable closure of k. If k ⊆L ⊆M then M/k is separable if and only if both\nM/L and L/k are separable.\nA field k is said to be perfect if any of the following equivalent conditions hold:\n- char(k) = 0 or char(k) = p > 0 and k = {xp : x ∈k} (k is fixed by Frobenius);\n- every finite extension of k is separable over k;\n- every algebraic extension of k is separable over k.\nNote that finite fields and all fields of characteristic 0 are perfect.\nExample 12.6. The rational function field k = Fp(t) is not perfect. If we consider the finite\nextension L = k(t1/p) obtained by adjoining a pth root of t to k, the minimal polynomial\nof t1/p is xp -t, which is irreducible over k but not separable (its derivative is 0).\nAn algebraic extension L/k isGalois if it is both normal and separable, and in this case\nwe call Gal(L/k) = Aut(L/k) the Galois group of L/k. The extension ksep/k is always\nnormal: if an irreducible polynomial f ∈k[x] has a root α in ksep, then (up to scalars) f\nis the minimal polynomial of α over k, hence separable over k, so all its roots lie in ksep.\nThus ksep/k is a Galois extension and its Galois group\nGk = Gal(ksep/k)\n3Some authors write Gal(L/k) for Aut(L/k), others only use Gal(L/k) when L/k is known to be Galois;\nwe will use the later convention.\n\nis the absolute Galois group of k (we could also define Gk as Aut(k/k), the restriction map\n\nfrom Aut(k/k) to Gal(ksep/k) is always an isomorphism).\nThe splitting field of a polynomial f ∈k[x] is the extension of k obtained by adjoining\n\nall the roots of f (which lie in k). Every splitting field is normal, and every finite normal\nextension of k is the splitting field of some polynomial over k; when k is a perfect field we\ncan go further and say that L/k is a finite Galois extension if and only if it is the splitting\nfield of some polynomial over k.\nFor finite Galois extensions M/k we always have #Gal(M/k) = [M : k], and the funda-\nmental theorem of Galois theory gives an inclusion-reversing bijection between subgroups\nH ⊆Gal(M/k) and intermediate fields k ⊆L ⊆M in which L = MH and H = Gal(M/L)\n(note that M/L is necessarily Galois). Beware that none of the statements in this paragraph\nnecessarily applies to infinite Galois extensions, some modifications are required (this will\nbe explored further on the next problem set).\n12.2\nAffine space\n\nLet k be a perfect field and fix an algbebraic closure k.\nDefinition 12.7. n-dimensional affine space over k is the set\nAn\nk = {(x1, . . . , xn) ∈ kn},\nequivalently An\n\nk is the vector space kn regarded as a set. When k is clear from context we\nmay just write An. If k ⊆L ⊆ k, the set of L-rational points (or just L-points) in An is\nAn(L) = {\n\n(x\nn\n1, . . . , xn) ∈L } = An(k)GL,\nwhere An\n(k)GL\n\ndenotes the set of points in An\n(k) fixed by G\nsep\nL = Gal(L\n/L) = Gal(k/L).\nIn particular, An\n\n(k) = An(k)Gk.\n\nDefinition 12.8. If S is a set of polynomials in A = k[x1, . . . , xn], the set of points\nZS = {P ∈An : f(P) = 0 for all f ∈S},\n\nis called an (affine) algebraic set. If k ⊆L ⊆k, the set of L-rational points in ZS is\nZS(L) = ZS ∩An(L).\nWhen S is a singleton {f} we may write Zf in place of Z{f .\n}\nNote that if I is the A-ideal generated by S, then ZI = ZS, since f(P) = g(P) = 0\nimplies (f + g)(P) = 0 and f(P) = 0 implies (fg)(P) = 0. Thus we can always replace S\nby the ideal (S) that it generates, or by any set of generators for (S).\nExample 12.9. We have Z = Z\n∅\n(0) = An and Z{1 = Z\n}\n(1) = ∅.\nFor any S, T ⊆A we have\nS ⊆T\n=⇒\nZT ⊆ZS,\nbut the converse need not hold, even if S and T are ideals: consider T = (x ) and S = (x2\n1).\nWe now recall the notion of a Noetherian ring and the Hilbert basis theorem.\n\nDefinition 12.10. A commutative ring R is noetherian if every R-ideal is finitely gener-\nated.4 Equivalently, every infinite ascending chain of R-ideals\nI1 ⊆I2 ⊆· · ·\neventually stabilizes, that is, In+1 = In for all sufficiently large n.\nTheorem 12.11 (Hilbert basis theorem). If R is a noetherian ring, then so is R[x].\nProof. See [1, Theorem 14.6.7] or [2, Theorem 8.32].\nNote that we can apply the Hilbert basis theorem repeatedly: if R is noetherian then\nso is R[x1], and so is (R[x1])[x2] = R[x1, x2], . . . , and so is R[x1, . . . , xn]. Like every field,\nk is a noetherian ring (it has just two ideals, so it certainly satisfies the ascending chain\n\ncondition). Thus A = k[x1, . . . , xn] is noetherian, so every A-ideal is finitely generated. It\nfollows that every algebraic set can be written in the form ZS with S finite.\nDefinition 12.12. For an algebraic set Z ⊆An, the ideal of Z is the set\nI(Z) = {f ∈A : f(P) = 0 for all P ∈Z},\n\nwhere A is the polynomial ring k[x1, . . . , xn].\nThe set I(Z) is clearly an A-ideal (it is closed under addition and under multiplication\nby elements of A), and we note that\nY ⊆Z\n=⇒\nI(Z) ⊆I(Y )\nand\nI(Y ∪Z) = I(Y ) ∩I(Z)\n(both statements are immediate from the definition).\nWe have Z = ZI(Z) for every algebraic set Z, but it is not true that I = I(ZI) for every\nideal I. As a counterexample, consider I = (f2) for some polynomial f ∈A. In this case\nI(Z(f2)) = (f) = (f2).\nIn order to avoid this situation, we want to restrict our attention to radical ideals.\nDefinition 12.13. Let R be a commutative ring. For any R-ideal I we define\n√\nI = {x ∈R : xr ∈I for some integer r > 0},\nand say that I is a radical ideal if I =\n√\nI.\nLemma 12.14. For any ideal I in a commutative ring R, the set\n√\nI is an ideal.\nProof. Let x\n√\n∈\nI with xr\n√\n∈I. For any y ∈R we have yrxr = (xy)r ∈I, so xy\n√\n∈\nI. If\ny ∈\nI with ys ∈I, then every term in the sum\ns\n(x + y)r+s =\nX r +\nxiyr+s-i\ni\ni\nis a multiple of either xr ∈I or ys ∈I, hence lies in I, so (x+y)r+s ∈I and (x+y)\n√\n∈\nI.\n4The term \"noetherian\" refers to the mathematician Emmy Noether. The word noetherian is used so\ncommonly in algebraic geometry (and elsewhere) that it is typically no longer capitalized (like abelian).\n\nTheorem 12.15 (Hilbert's Nullstellensatz). For every ideal I ⊆k[x1, . . . , xn] we have\nI(ZI) =\n√\nI.\nProof. See [3, Theorem 7.1].\nNullstellensatz literally means \"zero locus theorem.\" The theorem above is the strong\nof the Nullstellensatz; it implies the weak Nullstellensatz:\n\nTheorem 12.16 (weak Nullstellensatz). For any proper ideal I ⊆k[x1, . . . , xn] the variety\nZI is nonempty.\nProof. Suppose I is an√ideal for which ZI is the empty set. Then I(ZI) = (1), and by the\nstrong Nullstellensatz,\nI = (1). But then 1r = 1 ∈I, so I is not proper.\n\nNote the importance of working over k. It is easy to find proper ideals I for which\nZI(k) = ∅when k is not algebraically closed; consider Z(x2+y2+1)(Q) in A2.\nA useful\ncorollary of the weak Nullstellensatz is the following.\n\nCorollary 12.17. The maximal ideals of the ring k[x1, . . . , xn] are all of the form\nmP = (x1 -P1, . . . , xn -Pn)\n\nfor some point P = (P1, . . . , Pn) in An(k).\n∈\n\nProof. The evaluation map that sends f\nk[x1, . . . , xn] to f(P) ∈k is a surjective ring\n\nhomomorphism with kernel mP .\nThus k[x1, . . . , xn]/mP ≃k is a field, hence mP is a\n\nmaximal ideal. If m is any maximal ideal in k[x1, . . . , xn], then it is a proper ideal, and by\nthe weak Nullstellensatz the algebraic set Zm is nonempty and contains a point P ∈An.\nSo mP ⊆I(Zm), but also m ⊆I(Zm). The ideal I(Zm) is a proper ideal (since Zm is\nnonempty) and the ideals m and mP are both maximal, so m = I(Zm) = mP .\nWe also have the following corollary of the strong Nullstellensatz.\nCorollary 12.18. There is a one-to-one inclusion-reversing correspondence between radical\n\nideals I ⊆k[x1, . . . , xn] and algebraic sets Z ⊆An(k) in which I = I(Z) and Z = ZI.\nRemark 12.19. It is hard to overstate the importance of Corollary 12.18; it is the basic\nfact that underlies nearly all of algebraic geometry. It tells us that the study of algebraic\nsets (geometric objects) is the same thing as the study of radical ideals (algebraic objects).\nIt also suggests ways in which we might generalize our notion of an algebraic set: there\n\nis no reason to restrict ourselves to radical ideals in the ring k[x1, . . . , xn], there are many\nother rings we might consider. This approach eventually leads to the much more general\nnotion of a scheme, but for our first foray into algebraic geometry we will stick to algebraic\nsets (in particular, varieties, which we will define momentarily).\nDefinition 12.20. A algebraic set is irreducible if it is nonempty and not the union of two\nsmaller algebraic sets.\nTheorem 12.21. An algebraic set is irreducible if and only if its ideal is prime.\n\nProof. (⇒) Let Y be an irreducible algebraic set and suppose fg ∈I(Y ) for some f, g ∈A.\nWe will show that either f ∈I(Y ) or g ∈I(Y ) (and therefore I(Y ) is prime).\nY ⊆Zfg = Zf ∪Zg\n= (Y ∩Zf) ∪(Y ∩Zg),\nand since Y is irreducible we must have either Y = (Y ∩Zf) = Zf or Y = (Y ∩Zg) = Zg),\nhence either f ∈I(Y ) or g ∈I(Y ). Therefore I(Y ) is a prime ideal.\n(⇐) Now suppose I(Y ) is prime and that Y = Y1 ∪Y2. We will show that either Y = Y1\nor Y = Y2. This will show that Y is irreducible, since Y must be nonempty (I(Y ) = A\nbecause I(Y ) is prime). We have\nI(Y ) = I(Y1 ∪Y2) = I(Y1) ∩I(Y2) ⊇I(Y1)I(Y2),\nand therefore I(Y ) divides/contains either I(Y1) or I(Y2), since I(Y ) is a prime ideal, but\nit is also contained in both I(Y1) and I(Y2), so either I(Y ) = I(Y1) or I(Y ) = I(Y2). Thus\neither Y = Y1 or Y = Y2, since algebraic sets with the same ideal must be equal.\nReferences\n[1] M. Artin, Algebra, 2nd edition, Pearson Education, 2011.\n[2] A. Knapp, Basic Algebra, Springer, 2006.\n[3] A. Knapp, Advanced Algebra, Springer, 2007.\n[4] J.S. Milne, Fields and Galois Theory, 2012.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 13",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/c6986079bc69909f419f02c76095c60b_MIT18_782F13_lec13.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #13\n10/22/2013\n\nAs before, k is a perfect field, k is a fixed algebraic closure of k, and An = An(k) is\nn-dimensional affine space.\n13.1\nAffine varieties\nDefinition 13.1. An algebraic set Z ∈An is said to be defined over k if its ideal is\ngenerated by polynomials in k[x1, . . . , kn], that is, I(Z) is equal to the ideal generated by\n\nI(Z) ∩k[x1, . . . , xn] in k[x1, . . . , kn]. We write Z/k to indicate that Z is an algebraic set\nthat is defined over k and define the ideal\nI(Z/k) = I(Z) ∩k[x1, . . . , xn].\nWhen Z is defined over k the action of the absolute Galois group G\non An\nk\ninduces an\naction on Z, since for any σ ∈Gk, any f ∈k[x1, . . . , x\nP\nn\nn], and any\n∈A\nwe have\nf(P σ) = f(P)σ.\nIn this case we have Z(k) = {P ∈Z : P σ = P for all σ ∈Gk} = ZGk.\nDefinition 13.2. Let Z be an algebraic set defined over k. The affine coordinate ring of\nZ/k is the ring\nk[x1, . . . , xn]\nk[Z] =\n.\nI(Z/k)\nWe similarly define\nk[x1, . . . , x\n\nn]\nk[Z] =\n.\nI(Z)\nThe coordinate ring k[Z] may have zero divisors; it is an integral domain if and only if\n\nI(Z/k) is a prime ideal. Even if k[Z] has no zero divisors, k[Z] may still have zero divisors\n(the fact that I(Z/k) is a prime ideal does not guarantee that I(Z) is a prime ideal; the\nprincipal ideal (x2 + 1) is prime in Q but not in Q, for example). We want k[Z] to be an\nintegral domain so that we can work with its fraction field. Recall from last lecture that\nI(Z) is a prime ideal if and only if Z is irreducible. This motivates the following definition.\nDefinition 13.3. An affine variety V is an irreducible algebraic set in An.1\nAn algebraic set Z is a variety if and only if I(Z) is a prime ideal; the one-to-one corre-\nspondence between algebraic sets and radical ideals restricts to a one-to-one correspondence\nbetween varieties and prime ideals (note that every prime ideal is necessarily a radical ideal).\n\nThe set An is a variety since I(An) is the zero ideal, which is prime in the ring k[x1, . . . , kn]\nbecause it is an integral domain (the zero ideal is prime in any integral domain).\nDefinition 13.4. Let V/k be an affine variety defined over k. The function field k(V ) of V\nis the fraction field of the coordinate ring k[V ].\nWe similarly define the function field of V over any extension of k on which V is defined.\n\nEvery variety is defined over k, so we can always refer to the function field k(V ).\n1Not all authors require varieties to be irreducible (but many do).\nAndrew V. Sutherland\n\n13.1.1\nDimension\nDefinition 13.5. The dimension of an affine variety V is the transcendence degree of the\n\nfield extension k(V )/k.\nLemma 13.6. The dimension of An is n, and the dimension of any point P ∈An is 0.\n\nProof. We have k[An\n\n] = k[x1, . . . , xn]/(0) = k[x1, . . . , xn], so k(An) = k(x1, . . . , xn) is a\n\npurely transcendental extension of k with transcendence degree n. For the point P, the\n\nideal I(P) = mP is maximal, so the coordinate ring k[P] = k[x1, . . . , xn]/mP is a field\n\nisomorphic to k, as is k(P), and the transcendence degree of k/k is obviously 0.\nLet us note an alternative definition of dimension using the Krull dimension of a ring.\nDefinition 13.7. The Krull dimension of a commutative ring R is the supremum of the\nset of integers d for which there exists a chain of distinct prime R-ideals\np0 ⊊p1 ⊊· · · ⊊pd.\nThe Krull dimension of a ring need not be finite, even when the ring is noetherian,\n\nbut the Krull dimension of k[x1, . . . , xn] is finite, equal to n, and this bounds the Krull\ndimension of the coordinate ring of any variety V ⊆An. The following theorem implies\n\nthat dimension of a V is equal to the Krull dimension of k[V ].\nTheorem 13.8. Let k be a field and let R be an integral domain finitely generated as a\nk-algebra. The Krull dimension of R is the transcendence degree of its fraction field over k.\nProof. See [1, Theorem 7.22].\n\nNow consider a chain of distinct prime ideals in k[V ] of length d equal to the Krull\n\ndimension of k[V ].\np0 ⊊p1 ⊊· · · ⊊pd.\n\nSince k[V ] is an integral domain, the zero ideal is prime, so p0 = (0) (otherwise the chain\nwould not be maximal). There is a one-to-one correspondence between ideals of the quotient\n\nring k[V ] = k[x1, . . . , xn] and ideals of k[x1, . . . , xn] that contain I(V ), and this correspon-\ndence preserves prime ideals (this follows from the third ring isomorphism theorem). Thus\n\nwe have a chain of distinct prime ideals in k[x1, . . . , xn]:\nI(V ) = I0 ⊊I1 ⊊· · · ⊊Id,\nThis corresponds to a chain of distinct varieties (with inclusions reversed):\nVd ⊊V1 ⊊· · · ⊊V0 = V.\nConversely, we could have started with a chain of distinct varieties V and obtained a chain of\n\ndistinct prime ideals in k[V ]. This one-to-one correspondence yields an alternative definition\nof the dimension of V .\nDefinition 13.9. The geometric dimension of a variety V is the largest integer d for which\nthere exists a chain\nV0 ⊊· · · ⊊Vd = V\nof distinct varieties contained in V .\nThe discussion above shows that this agrees with our earlier definition. This notion of\ndimension also works for algebraic sets: the dimension of an algebraic set Z is the largest\ninteger d for which there exists a chain of distinct varieties (irreducible algebraic sets)\ncontained in Z.\n\n13.1.2\nSingular points\nDefinition 13.10. Let V ⊆An\n\nbe a variety, and let f1, . . . , fm ∈k[x1, . . . , xn] be a set of\ngenerators for I(V ). A point P ∈V is a nonsingular (or smooth) if the m × n Jacobian\nmatrix M(P) with entries\n∂fi\nMij(P) =\n(P)\n∂xj\nhas rank n -dim V ; otherwise P is a singular point of V . If V has no singular points than\nwe say that V is smooth.\nA useful fact that we will not prove is that if one can show that the rank of M(P) is\nequal to n -d for every point P ∈An, then V is a smooth variety of dimension d.\n13.2\nProjective space\nDefinition 13.11. n-dimensional projective space Pn over k is the set of all points in\nAn+1 -{0} modulo the equivalence relation\n(a0, . . . , an) ∼(λa0, . . . , λan)\nfor all λ ∈ k×. We use the ratio notation (a0 : . . . : an) to denote the equivalence class of\n(a0, . . . , an), and call it a projective point or a point in Pn. The set of k-rational points in\nPn is\nPn(k) = {(a\nn\n0 : . . . : an) ∈P : a0, . . . , an ∈k}\n\n(and similarly for any extension of k in k).\nRemark 13.12. Note that (a0 : . . . : an) ∈Pn(L) does not necessarily imply that all ai lie\n\nin L, it simply means that there exists some λ ∈k× for which all λai lie in L. However we\ndo have ai/aj ∈L for all 0 ≤i, j ≤n.\nThe absolute Galois group Gk acts on Pn via\n(a0 : . . . : an)σ = (aσ\nσ\n0 : . . . : an).\nThis action is well defined, since (λP)σ = λσP σ ∼P σ for any λ ∈ k× and P ∈An+1 -{0}.\nWe then have\nPn(k) = (Pn)Gk.\n13.3\nHomogeneous polynomials\n\nDefinition 13.13. A polynomial f ∈k[x0, . . . , xn] is homogenous of degree d if\nf(λx0, . . . , λxn) = λdf(x0, . . . , xn)\nfor all λ ∈ k. Equivalently, every monomial in f has total degree d. We say that f is\nhomogeneous if it is homogeneous of some degree.\nFix an integer i ∈\n\n[0, n]. Given any polynomial f ∈k[x0, . . . , xi\n, x\n, . . . , x ] in n\n-1\ni+1\nn\nvariables, let d be the total degree of f and define the homegenization of f (with respect\nto xi) to be the polynomial\nd\nx0\nxi\nF(x0, . . . , xn) = xi f\n, . . . ,\n-1 xi+1\nxn\n,\n, . . . ,\nxi\nxi\nxi\nxi\n\n.\n\nConversely, given any homogenous polynomial F ∈k[x0, . . . , xn], the polynomial\nf(x0, . . . , xi-1, xi+1, . . .) = f(x0, . . . , xi\n1, 1, xi+1, . . . , x\n-\nn)\nis the dehomegenization of F (with respect to xi).\nLet P = (a0 : . . . : an) be a point in Pn and let and f be a homogeneous polynomial in\nk[x0, . . . , xn]. The value f(a0, . . . , an) will depend, in general, on our choice of representative\n(a0, . . . , an) for P. However,\n\nf(a0, . . . , an) = 0\n⇐⇒\nf(λa0, . . . , λan) = 0 for all λ ∈k×.\nThus it makes sense to write f(P) = 0 (or f(P) = 0), and the zero locus of a homogeneous\npolynomial is a well-defined subset of Pn.\n13.3.1\nAffine covering of projective space\nFor 0 ≤i ≤n, the zero locus of the homogeneous polynomial xi is the hyperplane\nHi = {(a0 : . . . : ai\n1 : 0 : ai+1 : . . . : a )\nn\nn ∈P\n-\n},\nwhich corresponds to a copy of Pn-1 embedded in Pn.\nDefinition 13.14. The complement of Hi in Pn is the affine patch (or affine chart)\nUi = {(a0 : . . . : ai\n1 : 1 : ai+1 : . . . : a\n-\nn) ∈Pn},\nwhich corresponds to a copy of An embedded in Pn (note that fixing ai = 1 fixes a choices\nof representative for the projective point (a0 : . . . : ai\n1 : 1 : ai+1 : . . . : a\n-\nn)).\nIf we pick a hyperplane, say H0, we can partition Pn as\nPn = U0 ⊔H0 ≃An ⊔Pn-1.\nWe can now apply the same procedure to H0 ≃Pn-1, and repeating this yields\nPn ≃An ⊔An-1 ⊔· · · ⊔A1 ⊔P0,\nwhere the final P0 corresponds a single projective point in Pn.\nAlternatively, we can view Pn as the union of n + 1 (overlapping) affine patches, each\ncorresponding to a copy of An embedded in Pn. Note that every projective point P lies in\nat least one affine patch.\nRemark 13.15. Just as a manifold is locally defined in terms of an atlas of overlapping\ncharts (each of which maps the neighborhood of a point to an open set in Euclidean space),\nwe can view Pn as being locally defined in terms of its overlapping affine patches, viewing\neach as mapping a neighborhood of Pn to An (this viewpoint can be made quite rigorous,\nbut we will not do so here).\n\n13.4\nProjective varieties\n\nFor any set S of polynomials in k[x0, . . . , xn] we define the (projective) algebraic set\nZS = {P ∈Pn : f(P) = 0 for all homogeneous f ∈S}.\n\nDefinition 13.16. A homogeneous ideal in k[x0, . . . , xn] is an ideal that is generated by a\nset of homogeneous polynomials.\nNote that not every polynomial in a homogeneous ideal I is homogeneous (the sum\nof homogeneous polynomials of different degrees is not homogeneous), but this has no\nimpact on the algebraic set ZI, since our definition of ZI ignores elements of I that are not\nhomogeneous.\nDefinition 13.17. Let Z be an algebraic set in Pn, the (homogeneous) ideal of Z is the\n\nideal I(Z) generated by all the homogeneous polynomials in k[x0, . . . , xn] that vanish at\nevery point in Z.\nWe say that Z is defined over k if its ideal can be generated by homogeneous polynomials\nin k[x0, . . . , xn], and write Z/k to indicate this. If Z is defined over k the set of k-rational\npoints on Z is\nZ(k) = Z ∩Pn(k) = ZGk,\n\nand similarly for any extension of k in k.\nAs with affine varieties, we say that an algebraic set in Pn is irreducible if it is nonempty\nand not the union of two smaller algebraic sets in Pn.\nDefinition 13.18. A (projective) variety is an irreducible algebraic set in Pn.\nAs you will show on the problem set, an algebraic set Z ⊆Pn is irreducible if and only\nif I(Z) is prime. One can then define the coordinate ring k[V ] and function field k(V ) of\na projective variety exactly as in the affine case. Here we take a different approach using\naffine patches, which yields the same result.\nDefinition 13.19. Let V be a projective variety with homogeneous ideal I = (f1, . . . , fm).\nLet Ii be the ideal generated by the dehomegenizations of f1, . . . , fm at xi. Then Ii is a\nprime ideal (since I is) and the ith\nideal is Ii. We can then write V = Saffine part of V is the affine variety Vi = V ∩Ui whose\ni Vi as the union of its affine parts.\nDefinition 13.20. The dimension of a projective variety V is the maximum of the dimen-\nsions of its affine parts, and V is smooth if and only if all its affine parts are.\nFinally, we define the coordinate ring k[V ] of a projective variety V/k to be the coor-\ndinate ring of any of its nonempty affine parts (we will prove below that it doesn't matter\nwhich one we pick), and the function field k(V ) of V is the fraction field of its coordinate\n\nring, and similarly for any extension of k in k.\n13.5\nProjective closure\nDefinition 13.21. If Z ⊆An is any affine algebraic set, we can embed it in Pn by identifying\nAn with the affine patch U0 of Pn; we write Z ⊆An ⊂Pn to indicate this embedding. The\nprojective closure of Z in Pn, denoted Z, is the projective algebraic set defined by the ideal\ngenerated by all the homogenizations (with respect to x0) of all the polynomials in I(Z).\n\nWhen the ideal of an algebraic set Z ⊆An is principal, say I(Z) = (f), then I(Z)\nis generated by the homogenization of f. But in general the homegenizations of a set of\ngenerators for I(Z) do not generate I(Z), as shown by the following example.\n\nExample 13.22. Consider the twisted cubic C = {(t, t2, t3) : t ∈k} ⊆A3 ⊂P3. It is the\nzero locus of the ideal\n(x2 -y, x3 -z)\n\nin k[x, y, z], hence an algebraic set, in fact, an affine variety of dimension 1 (an affine curve).\n\nTo see this note that k[C] = k[x, y, z]/I(C) ≃k[x] is obviously an integral domain, so I(C)\n\nis prime, and the function field k(C) ≃k(x) has transcendence degree 1.\nIf we homogenize the generators of I(C) by introducing a new variable w, we get the\nhomogeneous ideal I = (x2 -wy, x3 -w2z). The zero locus of this ideal in P3 is\n{\n\n(1 :\n: t2 : t3\n\nt\n) : t ∈k} ∪{(0 : 0 : y : z) : y, z ∈k},\nwhich ought to strike you as a bit too large to be the projective closure of C; indeed, the\nhomogeneous polynomial y2 -xz is not in I even though y2 -x is in I(C), so this cannot\nbe C. But if we instead consider the homogeneous ideal\n(x2 -wy, xy -wz, y2 -xz),\nwe see that its zero locus is\n{\n\n(1 : t : t2 : t3) : t ∈k} ∪{(0 : 0 : 0 : 1)},\nand we claim this is C. There are many ways to prove this, but here is completely elementary\nargument: Suppose that f ∈ k[w, x, y, z] is homogeneous of degree d, with C in its zero\nlocus. Then the polynomial g(t) = f(1, t, t2, t3) must be the zero polynomial (here we use\n\nthat k is infinite). If f(0, 0, 0, 1) = 0, then f must contain a term of the form czd with\nc ∈ k×. But then g(t) = ct3d + h(t) with deg h ≤3(d -1) + 2 = 3d -1 < 3d, which means\nthat g cannot be the zero polynomial, a contradiction. The claim follows.\nTheorem 13.23. If V ∈An ⊂Pn is an affine variety then its projective closure V is a\nprojective variety, and V = V ∩An is an affine part of V .\nProof. For any polynomial f ∈ k[x1, . . . , xn], let f ∈ k[x0, x1, . . . , xn] denote its homoge-\n\nnization with respect to x0. For any f ∈k[x1, . . . , xn] and any point P ∈An, we have\nf(P) = 0 if and only if f(P) = 0, where P = (1 : a1 : . . . : an) is the projective closure of P\n(viewing points as singleton algebraic sets). It follows that V = V ∩An.\nTo show that V is a projective variety, we just need to show that it is irreducible,\nequivalently (by Problem Set 6), that its ideal is prime. So let fg ∈I(V ). Then fg vanishes\non V , hence it vanishes on V , as does the dehomegenization f(1, x1, . . . , xn)g(1, x1, . . . , xn)\nBut I(V ) is prime (since V is a variety), so either f(1, x1, . . . , xn) of g(1, x1, . . . , xn) lies in\nI(V ), and therefore one of f and g lies in I(V ). Thus I(V ) is prime.\nTheorem 13.24. Let V be a projective variety and let Vi be any of its nonempty affine\nparts. Then Vi is an affine variety and V is its projective closure.\nProof. Without loss of generality we assume i = 0 and use the notation introduced in the\n\nproof above, identifying An with U0. As above, for any f ∈k[x1, . . . , xn] and any point\nP ∈An, we have f(P) = 0 if and only if f(P) = 0. It follows that V0 is an algebraic set\n\ndefined by the ideal generated by the dehomegenization of all the homogeneous polynomials\nin I(V ), and therefore V = V0.\nTo show that V0 is an affine variety, we just need to check that I(V0) is a prime ideal.\nSo let fg ∈I(V0). Then fg ∈I(V ) and therefore either f or g is in I(V ) (since I(V ) is\nprime), and then either f or g must lie in I(V0). Thus I(V0) is prime.\nRemark 13.25. Theorem 13.23 is still true if \"variety\" is replaced by \"algebraic set\", but\nTheorem 13.24 is not.\nCorollary 13.26. The dimension, coordinate ring, and function field of an affine variety\nare equal to those of its projective closure. The dimension, coordinate ring, and function\nfield of a projective variety are equal to those of each of its nonempty affine parts.\nRemark 13.27. One can define the function field of a projective variety V directly in\nterms of its homogeneous ideal I(V ) rather than identifying it with the function field\nof its nonempty affine pieces (all of which are isomorphic), but some care is required.\n\nThe function field k(V ) is not the fraction field of k[x0, . . . , xn]/I(V ), it is the subfield\n\nof k[x0, . . . , xn]/I(V ) consisting of all fractions g/h where g and h are both homogeneous\npolynomials (modulo I(V )) of the same degree, with h = 0. This restriction is necessary\n\nin order for us to sensibly think of elements of k(V ) as functions from V to k. In order to\nevaluate a function f(x0, . . . , xn) at a projective point P = (a0 : . . . : an) in a well-defined\nway we must require that\nf(λa0, . . . , λan) = f(a0, . . . , an)\nfor any λ ∈ k×. If f = g/h with g and h homogeneous of degree d, then\ng(λa\n. . , λa )\nλd\n0, .\nn\ng(a0, . . . , an)\ng(a0, . . . , an)\nf(λa0, . . . , λan) =\n=\n=\n= f(a0, . . . , an),\nh(λa0, . . . , λa )\nλd\nn\nh(a0, . . . , an)\nh(a0, . . . , an)\n\nas required. With this definition the function field k(V ) is isomorphic to the function field\nof each of its nonempty affine parts.\nReferences\n[1] A. Knapp, Advanced Algebra, Springer, 2007.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 14",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/c94ce47dd9f7df6f272faaeeb1ca8767_MIT18_782F13_lec14.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #14\n10/24/2013\n\nAs usual, k is a perfect field and k is a fixed algebraic closure of k. Recall that an affine\nn\n\n= A\n\n(resp. projective) variety is an irreducible alebraic set in An\n(k) (resp. Pn = Pn(k)).\n14.1\nAffine morphisms\nWe begin our discussion of maps between varieties with the simplest case, morphisms of\naffine varieties.\nDefinition 14.1. Let X ⊆Am and Y ⊆An be affine varieties. A morphism f : X →Y is a\n\nmap f(P) := (f1(P), . . . , fn(P)) defined by polynomials f1, . . . , fn ∈k[x1, . . . , xm] such that\nf(P) ∈Y for all points P ∈X. We may regard f1, . . . , fn as representatives of elements of\n\nthe coordinate ring k[X] = k[x1, . . . , xm]/I(X); we are evaluating f1, . . . , fn only at points\nin X, so there is no reason to distinguish them modulo the ideal I(X).\nAs befits their name, morphisms can be composed: if f : X →Y and g: Y →Z are\nmorphisms of varieties X ⊆Am, Y ⊆An, and Z ⊆Ar, then (g *f): X →Z is defined by\n(g *f)(P) := g(f(P)) =\ng1(f1(P), . . . , fn(P)), . . . , gr(f1(P), . . . , fn(P)) .\nNotice that in order for this composition to actually make sense, we need to pick particular\n\nrepresentatives g1, . . . , gr ∈k[y1, . . . , ym] modulo I(Y ) (of course it doesn't matter which).\n\nThe rings k[x1, . . . , xm] and k[X] are k algebras, so it makes sense to evaluate a polynomial\n\nwith coefficients in k in either of these rings (depending on our perspective), but it does not\n\nmake sense to \"evaluate\" an element of k[Y ] at elements of k[X]. We also have the identity\nmorphism f : X →X, which is defined by letting f\n.1\ni be the polynomial xi\nThus we have a category whose objects are affine varieties and whose morphisms are (no\nsurpise) morphisms. Contrary to what you might expect (if you happened to be thinking of\nmorphisms in the category of groups or rings), the image of a morphism is not necessarily\na variety, or even an algebraic set.\nExample 14.2. Consider the morphism f : A2 →A2 defined by f(x1, x2) = (x1, x1x2). Its\nimage is the entire affine plane except for the points on the x1-axis with x2 = 0. This is not\n\nan algebraic set; this is obvious if k = C, and in general, if g(y1, y2) vanishes on the image\n\nof f, then for any infinitely many c ∈k the polynomial h(t) = g(t, c) has infinitely many\nzeroes, hence is the zero polynomial, and this implies that g is the zero polynomial. Thus\nI(im f) is the zero ideal and the only algebraic set containing im f is all of A2.\nOn the other hand, if you were thinking of morphisms in the category of topological\nspaces (which is the better analogy), then morphisms of varieties behave as expected; indeed,\nthey are continuous maps (and more), we just need to put the right topology on our varieties.\nDefinition 14.3. In the Zariski topology on An (resp. Pn), the closed sets are precisely the\nalgebraic sets. Any algebraic set in An (resp. Pn) then inherits the subspace topology.\n1Note that we are using the symbol xi in three different ways: as an indeterminate used to define the\n\npolynomial ring R = k[x1, . . . , xm], as an element of R (i.e., a polynomial), and as the function xi : Am(k) →k\nthat evaluates the polynomial xi on a given input.\nAndrew V. Sutherland\n\nLet us verify that this actually defines a topology: the empty set and An are algebraic\nsets defined by the ideals (1) and (0), respectively (and similarly for Pn), and algebraic sets\nare closed under arbitrary intersections (we can take the zero locus of an arbitrary sum of\nideals), and finite unions (we can take the zero locus of a finite product of ideals).2\nWith a topology in place we can now use words like open, closed, dense, etc., when refer-\nring to subsets of An or Pn, with the understanding that they refer to the Zariski topology.\nNote that our definition of the projective closure of an affine variety V embedded in Pn is\nconsistent with this; we proved last time that the projective closure of V in Pn is a variety\n(hence closed), and it is clearly the smallest closed set that contains V : a homogeneous\n\npolynomial in k[x0, . . . , xn] vanishes on V in Pn if and only if its dehomogenization vanishes\non V in An.\nIt should be noted that the Zariski topology is extremely coarse. In A1, for example,\nevery nonempty open set is the complements of finite sets, and in general every nonempty\nopen set is dense in An (and in Pn); the same applies in the subspace of a variety. And the\nZariski topology is definitely not a Hausdorfftopology; indeed, the intersection of any pair\nof nonempty open sets is not only nonempty, it must be dense!\nTheorem 14.4. Every morphism f : X\n→Y of affine varieties is continuous. That is, the\ninverse image f-(Z) of any algebraic subset Z ⊆Y is an algebraic subset of X.\nProof. Showing that the inverse image of a closed set is closed is the same thing as showing\nthat the inverse of an open set is open, which is the definition of a continuous map. So\nlet Z be an algebraic subset of Y defined by the ideal (g1, . . . , gr) (we include generators\nfor I(Y ) in this list). Then f-1(Z) is the zero locus of g1(f1, . . . , fn), . . . , gr(f1, . . . , fn) (as\ncompositions of polynomials) in X, hence an algebraic of subset of X.\nRemark 14.5. It is not true that every continuous map between affine varieties is a mor-\nphism; the coarseness of the Zariski topology simply makes it too easy for a function to be\ncontinuous. The additional requirement that a morphism must satisfy is that it must also\nbe a rational map, as we will see in the next lecture.\nFor affine varieties, an isomorphism is a bijective morphism whose inverse is a morphism,\nbut we will use the more formal definition that applies in any category.\nDefinition 14.6. We say that two varieties X ≃Y are isomorphic if there exist morphisms\nf : X →Y and g: Y →X such that both f *g and g *f are the identity morphisms on X\nand Y , respectively. In this case we may refer to both f and g as isomorphisms.\nJust as not every continuous map is an morphism, not every bicontinuous map (home-\nmorphism) is an isomorphism. Indeed, not even a bicontinuous morphism is necessarily an\nisomorphism.\nExample 14.7. Consider the map from A1 to A2 defined by t 7→(t2, t3). The image of this\nmap is a variety V (the polynomial y2 -x3\n\nis irreducible in k[x, y], so the principal ideal\n(y2 -x3) is prime). Thus we have a morphism f : A1 →V , and it is clearly bijective; the\ninverse map can be defined as\n(\ny/x\nif x = 0,\nf-(x, y) =\notherwise.\n2One needs to check that this also works for projective varieties and homogeneous ideals, but this is\nstraight-forward; sums and products of homogeneous ideals are again homogeneous ideals and the rest\nfollows from Problem 2 of Problem Set 6.\n\nMoreover, f is a closed map (the only closed sets in A1 are points and A1 itself, and these\nare all mapped to closed sets in V ), so it is bicontinuous and thus both a morphism and a\nhomeomorphism. But it is not an isomorphism because its inverse is not a morphism; the\nfunction f-1 cannot be defined as a polynomial map.\nThe example above shows that two varieties may be isomorphic as topological spaces\nwithout being isomorphic as varieties; this should not be too surprising, the Zariski topology\nmakes it very easy for varieties to be homoemorphic (indeed, every affine curve is homeo-\nmorphic to A1). On the other hand, in the example of the twisted cubic (see Lecture 13)\nwe actually have an isomorphism of affine varieties.\nWe now come to a very important theorem that gives a one-to-one correspondence\nbetween morphisms of affine varieties φ: X →Y and homomorphisms of their coordinate\nrings φ∗\n\n: k[Y ] → k[X] (note that the directions of the arrows are reversed). Actually, we\nwant φ∗\n\nto be more than just a ring homomorphism, we also want it to fix the field k.\n\nA compact way of saying this is to regard k[X] and k[Y ] not as rings, but as algebras\n\nover k, and require φ∗to be a homomorphism of k-algebras. This means that that φ∗must\ncommute with sums and products (in our setting this makes φ∗a ring homomorphism), and\n\nit must fix elements of k.\nIn order to obtain an actual equivalence of categories, we want to specify objects that\ncorrespond to coordinate rings in a purely algebraic way that does not involve varieties. So\n\nconsider an arbitrary integral domain R that is also a finitely generated k-algebra; let us\ncall such an R an affine algebra. If we denote the generators of R by x1, . . . , xn, there is a\ncanonical ring homomorphism\nk[x1, . . . , xn] →R\nfrom the polynomial ring with indeterminates x1, . . . , xn onto R, and the kernel of this\n\nhomomorphism is an ideal I for which R = k[x1, . . . , xn]/I. The ideal I is prime (since R is\nan integral domain), hence a radical ideal. Let V be the variety it defines in An. Then by\n\nHilbert's Nullstellensatz, we have I = I(V ) (note that here we use that k is algebraically\n\nclosed). The coordinate ring of V is then k[V ] ≃ k[x1, . . . , xn]/I ≃R.\nThus we have a one-to-one correspondence between affine varieties and affine algebras\nin which varieties correspond to their coordinate rings and affine algebras correspond to\nvarieties as described above. By taking the morphisms to be k-algebra homomorphisms, we\ncan consider the category of affine algebras. In order to prove that the category of affine\nvarieties is equivalent to the category of affine algebras, we need to understand how their\nmorphisms correspond.\nTheorem 14.8. The following hold:\n\n(i) Every\nφ: X →\n\nmorphism\nY of affine varieties induces a morphism φ∗: k[Y ] →k[X]\nof affine algebras such that φ∗(g) = g *φ.\n(ii) Every morphism θ: R →S of affine algebras induces a morphism θ∗: X →Y of affine\n\nvarieties with R ≃k[Y ] and S ≃\n\nk[X] such that the image of θ(g) in k[X] is g *θ∗.\n(iii) If φ: X →Y and ψ: Y →Z are morphisms of affine varieties, then (ψ*φ)∗= φ∗*ψ∗.\nBefore proving the theorem, let us comment on the notation φ∗(g) = g *φ. In order for\nthis to make sense, we need to interpret it as follows: given g ∈\n\nk[Y ] = k[y1, . . . , yn]/I(Y ),\nwe pick a representative gˆ ∈ k[y1, . . . , yn] (so g is the coset gˆ + I(Y )) and then φ∗(g) is the\n\nreduction of the polynomial gˆ *φ = gˆ(φ1, . . . , φn) ∈k[x1, . . . , xm] modulo I(X) (i.e., its\nimage under the quotient map). In short, g *φ means lift/compose/reduce.3\nThe key point is that for any f in I(Y ), the composition f *φ yields an element of I(X),\nbecause φ maps points in X to points in Y and f vanishes at points in Y . Thus it does not\nmatter which lift gˆ we pick and our interpretation of g *φ is well defined.\nProof. We assume throughout that X and Y are varieties in Am and An, respectively.\n\n(i) We first note that the operations of lifting from k[Y ] to k[y1, . . . , yn] and reducing\n\nfrom k[x1, . . . , xm] to k[X] are both compatible with ring operations, and when lifting or\n\nreducing an element of k it remains fixed. Now if g ∈k is a constant polynomial, then\ng *\n\nφ = g, and for any f, g ∈k[y1, . . . , yn] we have\n(f + g) *φ = (f + g)(φ1, . . . , φn) = f(φ1, . . . , φn) + g(φ1, . . . , φn) = (f *φ) + (g *φ)\nand\n(fg) *φ = (fg)(φ1, . . . , φn) = f(φ1, . . . , φn)g(φ1, . . . , φn) = (f *φ)(g *φ).\n∗\n\nThus φ is a ring homomorphism that fixes k, hence a homomorphism of affine algebras.\n(ii) Let θ: R →S be a morphism of affine algebras. As described above, there exist\nvarieties X and Y for which R ≃\n\nk[Y ] and S ≃k[X], and any morphism R →S induces\n\na morphism k[Y ] →k[X] that commutes with these isomorphisms.4\nSo without loss of\n\ngenerality we assume θ: k[Y ] → k[X] is an affine algebra morphism of coordinate rings. We\nnow define a morphism θ∗: X →Y by letting θ∗= (θ(y1), . . . , θ(yn)), where θ(yi) denotes\n\nthe image under θ of the image of the polynomial yi in k[Y ] under the quotient map from\n\nk[y1, . . . , yn]. For any g ∈k[Y ] we have\ng *θ∗= gˆ(θ(y1), . . . , θ(yn)) = θ(g(y1, . . . , yn)) = θ(g),\n\nwhere the middle equality follows from the fact that θ is a ring homomorphism that fixes k.\nWe also note that for any f ∈I(Y ) we have f *θ∗= θ(f) = θ(0) = 0, so f(θ∗(P)) = 0 for\nall f ∈I(Y ) and P ∈X, which implies that the image of θ∗lies in Y . Thus θ∗is indeed a\nmorphism from X to Y as claimed.\n(iii) For any g ∈ k[Z] we have\n(ψ *φ)∗(g) = g *(ψ *φ) = (g *ψ) *φ = φ∗(g *ψ) = (φ∗(ψ∗(g)) = (φ∗*ψ∗)(g).\nCorollary 14.9. The categories of affine varieties and affine algebras are contravariantly\nequivalent.5\nProof. The only thing that remains to be shown is that the two functors arising from (i)\nand (ii) of Theorem 14.8 are inverses, that is, we need to show that (φ∗)∗= φ and (θ∗)∗= θ,\nup to isomorphism.6 The second equality is clear from the statement of the theorem and\nthe first is clear from its proof.\n\nIf we view φ1, . . . , φn as elements of k[X], we also need to lift the φi in order to compute g *φ.\n4One says that the induced morphism is natural; more precisely, the functor from the category of function\nfields to the category of function fields of varieties is a natural transformation (in fact, a natural isomorphism).\nIf you think this is just a fancy way of stating the obvious, you are right; but the same phenomenon occurs\nin more general situations where it is not always so obvious.\n5Contravariantly equivalent categories are also called dual categories; they are also said to be anti-\nequivalent, but we won't use this term.\n6Up to isomorphism means that the domains and codmains of the morphisms on either side of the equality\nneed not be precisely equal, they just need to be isomorphic, and the isomorphisms and the morphisms must\nform a commutative diagram; in other words, (φ∗)∗is naturally isomorphic to φ (and similarly for θ).\n\nCorollary 14.10. All the nonempty affine parts of a projective variety are isomorphic.\nProof. We proved in Lecture 13 (see Corollary 13.26) that the nonempty affine parts of a\nprojective variety all have the same coordinate ring (up to isomorphism).\nDefinition 14.11. If φ = (φ1, . . . , φn) is a morphism of varieties X →Y that are defined\nover k, we say that φ is defined over k if φ1, . . . , φn\nk[Y ]. Equivalently, φ is defined over k\nif φσ = (φσ, . . . , φσ) = φ for all σ ∈G .7\n∈\nn\nk\nIf φ is an isomorphism defined over k and it has\nan inverse isomorphism defined over k, then we say that X and Y are isomorphic over k.\nCorollary 14.12. Let X and Y be affine varieties defined over k.\nIf φ: X →Y is a\nmorphism defined over k then the affine algebra morphism φ∗\n: k[Y ] → k[X] restricts to an\naffine algebra morphism from k[Y ] to k[X].\nProof. This follows immediately from the definition φ∗(g) = g *φ.\nReferences\n[1] J.H. Silverman, The arithemetic of elliptic curves, 2nd edition, Springer, 2009.\n7Proving this equivalence is not completely trivial; see [1, Ex. I.1.12a].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 15",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/194e47df6e1f016ee3fb2719abe7e8d3_MIT18_782F13_lec15.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #15\n10/29/2013\n\nAs usual, k is a perfect field and k is a fixed algebraic closure of k. Recall that an affine\n\n(resp. projective) variety is an irreducible alebraic set in An = An(k) (resp. Pn = Pn(k)).\n15.1\nRational maps of affine varieties\nBefore defining rational maps we want to nail down two points on which we we were inten-\ntional vague in the last lecture. We defined a morphism φ: X →Y of varieties X ⊆Am\nand Y ⊆An as a \"map defined by a tuple of polynomials (φ1, . . . , φn).\" This definition is\nvague in two ways. First, is a morphism a map between two sets X and Y , or is it a tuple\nof polynomials? We shall adopt the second view; we still get a function by evaluating the\npolynomials at points in X.\nGiven that we regard φ as a tuple (φ1, . . . , φn), the next question is in which ring do\n\nits components φi lie?\nAre they elements of k[x1, . . . , xm] or k[X].\nThe function they\n\ndefine is the same in either case, but we shall regard the φi as elements of k[X]. This\nˆ\nmeans that in order to evaluate φi at a point P\nX, we need to lift φi = φi + I(X) to\nˆ ∈\n∈\nˆ\na representative φi\nk[x1, . . . , xm] and then compute φi(P). Of course it does not matter\nˆ\nˆ\nwhich representative φi we pick; we define φi(P) to be the value φi(P) for any/every choice\nˆ\nof φ, and thereby define φ(P) for P ∈X (but note that φ(P) is not defined for any P ∈X).\nOne advantage of this approach is that there is then a one-to-one correspondence between\nmorphisms and the functions they define. If φ = (φ1, . . . , φn) and ψ = (ψ1, . . . , ψn) define\nˆ\nˆ\n\nthe same function from X to Y then each of the polynomials φi-ψi in k[x1, . . . , xm] contains\nX in its zero locus and therefore lies in the ideal I(X). This implies, by definition, that in\n\nk[X] = k[xi, . . . , xm]/I(X) we have φi = ψi for 1 ≤i ≤m and therefore φ = ψ.\n\nWe now want to extend these ideas to the function field k(X). Elements of k(X) have\n\nthe form r = f/g, with f, g ∈k[X] and g = 0, and are called rational functions (or even\n\njust functions), on X, even though they are formally elements of the fraction field of k[X]\n\nand typically do not define a function from X to k; indeed, this is precisely the issue we\nmust now address.\nIt seems natural to say that for a point P ∈X we should define r(P) to be f(P)/g(P)\nwhenever g(P) = 0 and call it undefined otherwise.\nBut there is a problem with this\napproach: the representation r = f/g is not necessarily unique.1 We also have r = p/q\n\nwhenever pg = fq holds in k[X] (recall that this is part of the definition of a fraction field,\nit is a set of equivalence classes of fractions). The values f(P)/g(P) and p(P)/q(P) are\nnecessarily equal wherever both denominators are nonzero, but it may be that q(P) = 0 at\npoints where g(P) = 0 (and vice versa).\nExample 15.1. Consider the the zero locus X of x x\n2 -x3x4 in A\n(which is in fact a\nvariety) and the rational function r = x1/x3 = x4/x2. At the point P = (0, 1, 0, 0) ∈X the\nvalue x1(P)/x3(P) is not defined, but x4(P)/x2(P) = 0 is defined, and the reverse occurs\nfor P = (0, 0, 1, 0) ∈X. But we can assign a meaningful value to r(P) at both points; the\nonly points in X where r is not defined are those with x2 = x3 = 0.\nThis motivates the following definition.\n\nIf k[X] is a UFD then we can put r = f/g in lowest terms to get a unique representation. However, the\n\ncoordinate ring k[X] is usually not a UFD, even though k[x1, . . . , xm] is. A quotient of a UFD is typically\nnot a UFD, even when it is an integral domain; consider Z[x]/(x2 + 5), for example.\nAndrew V. Sutherland\n\nDefinition 15.2. A function r ∈\n\nk(X) is said to be regular at a point P ∈X if gr ∈k[X]\n\nfor some g ∈k[X] ⊆ k(X)2\n\nfor which g(P) = 0 (we then have r = f/g for some f ∈k[X]).\n\nThe set of points at which a function r ∈k(X) is regular form a nonempty open (hence\ndense) subset dom(r) of the subspace X: the complement of dom(r) in X is the closed\n\nsubset of X defined by the denominator ideal {g ∈k[X] : gr ∈k[X]}, which we note is not\nthe zero ideal, since r = f/g for some nonzero g.3\n\nWe now associate to r the function from dom(r) to k that maps P to\nr(P) = (f/g)(P) = f(P)/g(P),\n∈\nwhere g is chosen so that g(P) = 0 and gr = f\nk[X]. Now if r is actually an element of\nk[X], then r is regular at every point in X and we have dom(r) = X. The following lemma\nsays that the converse holds.\nLemma 15.3. A rational function r ∈\n\nk(X) lies in k[X] if and only if dom(r) = X.\nProof. The forward implication is clear, and if dom(r) = X then the complement of dom(r)\n\nin X is the empty set and the denominator ideal is (1), which implies r ∈k[X].\nDefinition 15.4. Let X\nAm and Y\nAn be affine varieties.\nWe say that a tuple\n∈\n⊆\n⊆\n(φ1, . . . , φn) with φi\nk(X) is regular at P ∈X if the φi are all regular at P. A rational map\n→\n∈\nφ: X\nY is a tuple (φ1, . . . , φn) with φi\nk(X) such that φ(P) := (φ1(P), . . . , φn(P)) ∈Y\nfor all points P ∈X where φ is regular. If φ is regular at every point P ∈X then we say\nthat φ is regular.\nThe set of points where φ is regular form an open subset dom(φ) = ∩i dom(φi) of X.\nThus φ defines a function from dom(φ) to Y , which we may also regard as a partial function\nfrom X to Y . We get a complete function from X to Y precisely when dom(φ) = X, that\nis, when φ is regular. This occurs precisely when φ is a morphism.\nTheorem 15.5. A rational map of affine varieties is a morphism if and only if it is regular.\nProof. A morphism is clearly a regular rational map. For the converse, apply Lemma 15.3\nto each component of φ = (φ1, . . . , φn).\nWe now want to generalize the categorical equivalence between affine varieties and their\nfunction fields, analogous to what we proved in the last lecture for affine varieties and their\ncoordinate rings (affine algebras), but with morphisms of varieties replaces by the more\ngeneral notion of a rational map. But there is a problem with this. In order to even define\na category of varieties with rational maps, we need to be able to compose rational maps.\nBut this is not always possible!\nExample 15.6. Let X = Y = Z = A2, and let φ: X →Y be the rational map (1/x1, 0)\nand let ψ: Y →Z be the rational map (0, 1/x2). Then the image of φ is disjoint from\ndom(ψ). There is no rational function that corresponds to the composition of φ and ψ (or\nψ with φ). Even formally, the fractions 1/0 that we get by naively composing φ with ψ are\n\nnot elements of k(X), and the function defined by the composition of the functions defined\n\nby φ and ψ has the empty set as its domain, which is not true of any r ∈k(X).\n2Recall that an integral domain can always be embedded in its fraction field by identifying g with the\n\nequivalence class of g/1, so we assume k[X] ⊆k(X) henceforth.\n\nWhen restricting our attention to a variety X in An it is simpler to work with ideals in k[X] =\n\nk[x1, . . . , xm]/I(X) rather than k[x1, . . . , xm]. The one-to-one corrsepondence between radical ideals and\nclosed sets still holds, as does the correspondence between prime ideals and (sub-) varieties.\n\nTo fix this problem we want to restrict our attention to rational maps whose image is\ndense in its codomain.\nDefinition 15.7. A rational map φ: X →Y is dominant if φ(dom(φ)) = Y .\nIf φ: X →Y and ψ: Y →Z are dominant rational maps then the intersection of\nφ(dom(φ)) and dom(ψ) must be nonempty; the complement of dom(ψ) in Y is a proper\nclosed subset of Y and therefore contains no sets that are dense in Y , including φ(dom(φ)).\nIt follows that we can always compose dominant rational maps, and since the identity map\nis also dominant rational map, we can now speak of the category of affine varieties and\nrational maps. Not every morphism is a dominant rational map, but affine varieties and\ndominant morphisms form a subcategory of affine varieties and dominant rational maps.\nAs you will show on the problem set, the closure of the image of a morphism of varieties is\na variety, so one can always make a morphism dominant be restricting its codomain.\nWe now prove the analog of Theorem 14.8, replacing morphisms with dominant rational\nmaps, and coordinate rings with function fields. We now use the term function field to\n\nrefer to any finitely generated extension of k, and we require morphisms of function fields\n\nto fix k (we could also call them k-algebra homomorphisms). Field homomorphisms are\n\nalways injective, so a morphism of function fields is just a field embedding that fixes k.\n\nNote that the all the interesting function fields F/k are transcendental. If F/k is algebraic\n\nthen F = k; this corresponds to the function field of a zero-dimensional variety (a point).\n\nGiven a function field F generated by elements α1, . . . , αn over k, let R be the k-algebra\ngenerated by α1, . . . , αn in F; this means that R is equal to the set of all polynomial\nexpressions in α1, . . . , αn, but there may be algebraic relations between the αi that make\nmany of these expressions equivalent. In any case, R is isomorphic to the quotient of the\n\npolynomial ring k[x1, . . . , xn] by an ideal I corresponding to all the algebraic relations that\nexist among the αi. The ring R is an integral domain (since it is contained in a field),\ntherefore I is a prime ideal that defines a variety X whose coordinate ring is isomorphic\nto R and whose function field is isomorphic to F, the fraction field of R.\nTheorem 15.8. The following hold:\n(i) Every dominant rational map φ: X\nY of affine varieties, induces a morphism\n∗\n→\n→\nφ : k(Y )\nk(X) of function fields such that φ∗(r) = r *φ.\n(ii) Every morphism θ: K →L of function fields induces a dominant rational map of\n∗\n→\n≃\n≃\naffine varieties θ : X\nY , with K\nk(Y ) and L\nk(X), such that the image of\n\nθ(r) in k(X) is r *θ∗.\n(iii) If φ: X →Y and ψ: Y →Z are dominant rational maps of affine varieties then\n(ψ *φ)∗= φ∗*ψ∗.\nAs in the analogous Theorem 14.8, to compute r *φ one needs to lift/compose/reduce,\n\nthat is, pick representatives for φ1, . . . , φn that are rational functions in k(x1, . . . , xm),\n\npick a representative of r in k(y1, . . . , yn), then compose and reduce the numerator and\ndenominator modulo I(X). The fact that φ is dominant ensures that the denominator of\n\nthe composition does not lie in I(X), so r *φ is an element of k(X).\nProof. The proofs of parts (i) and (iii) follow the proof of Theorem 14.8 verbatim, with\ncoordinate rings replaced by function fields, only part (ii) merits further discussion. As\n\ndiscussed above, we can write K ≃k(Y ) and L ≃k(X) for some varieties X and Y , and\n\nan\n→\n\ny morphism K\nL induces a morphism k(Y ) →k(Y ) that is compatible with these\n\nisomorphisms, so let us assume θ: k(Y ) →k(X).\nAs in the proof of Theorem 14.8 we define θ∗: X →Y by θ∗= (θ(y1), . . . , θ(yn)), where\n\nwe now regard the coordinate functions yi as elements of k(Y ). For any r ∈k(Y ) we have\nr *θ∗= rˆ(θ(y1), . . . , θ(yn)) = θ(r(y1, . . . , yn)) = θ(r).\nThe fact that r ∈ k(Y ) ensures that the denominator of rˆ ∈ k[y1, . . . , yn] is not in I(Y ),\nso this composition is well defined. The proof that the image of θ∗actually lies in Y is\nthe same as in Theorem 14.8: for any f ∈I(Y ) we have f *θ∗= θ(f) = 0, so certainly\nf(θ∗(P)) = 0 for all P ∈dom(θ∗). Thus θ∗is a rational map from X to Y .\nBut we also need to check that θ∗is dominant (this is the only new part of the proof).\n\nThis is equivalent to showing that the only element of k[Y ] that vanishes on the image of θ∗\n\nis the zero element, which is in turn equivalent to showing that the only element of k(Y )\nthat vanishes on the intersection of its domain and the image of θ∗is the zero element. This\nis in turn equivalent to showing that if r *θ∗= θ(r) vanishes at every point in its domain\n\nthen r = 0. But the only element of k(X) that vanishes at every point in its domain is the\nzero element, and θ is injective, so we are done.\nCorollary 15.9. The category of affine varieties with dominant rational maps and the\ncategory of function fields are contravariantly equivalent.\nProof. As in the proof of Corollary 14.9, the only thing left to show is that (φ∗)∗= φ and\n(θ∗)∗= θ, up to isomorphism, but both follow from Theorem 15.8 and its proof.\nDefinition 15.10. Two affine varieties X and Y are said to be birationally equivalent if\nthere exist dominant rational maps φ: X →Y and ψ: Y →X such that (φ *ψ)(P) = P\nfor all P ∈dom(φ *ψ) and (ψ *φ)(P) = P for all P ∈dom(ψ *φ).\nCorollary 15.11. Two affine varieties are birationally equivalent if and only if their func-\ntion fields are isomorphic.\nAs with morphisms, if φ: X →Y is a rational map of varieties that are defined over k,\nwe say that φ = (φ1, . . . , φn) is defined over k if the φi all lie in k(X).\nCorollary 15.12. Let X and Y be affine varieties defined over k.\nIf φ: X →Y is a\n\ndominant rational map defined over k then φ∗: k(Y ) → k(X) restricts to a morphism\nk(Y ) →k(X).\n15.2\nMorphisms and rational maps of projective varieties\nWe now want to generalize everything we have done for maps between affine varieties to\nmaps between projective varieties. This is completely straight-forward, we just need to\naccount for the equivalence relation on Pn.\n\nRecall from Lecture 13 that although we defined the function field k(X) of a projective\nvariety X ⊆Pn as the function field of any of its non-empty affine parts, we can always\nrepresent r by an element rˆ ∈ k(x0, . . . , xn) whose numerator and denominator are homo-\ngeneous polynomials of the same degree, and for any point P ∈X where rˆ(P) is defined\n(has nonzero denominator), we can unambiguously define r(P) = rˆ(P).\n\nDefinition 15.13. Let X be a projective variety. We say that r ∈k(X) is regular at a\npoint P ∈X if it has a representation rˆ that is defined at P. The set of points P ∈X\nat which r is regular form an open subset of X that we denote dom(r).4 For any point\nP ∈dom(r) we define r(P) = rˆ(P), where rˆ is chosen so that rˆ is defined at P.\nDefinition 15.14. Let X ⊆Pm and Y ⊆Pn be projective varieties.\nA rational map\nφ: X →\n\nY is an equivalence class of tuples φ = (φ0 : . . . : φn) with φi ∈k(X) not all zero\nsuch that at any point P ∈X where all the φi are regular and at least one is nonzero, the\npoint (φ0(P) : . . . : φn(P)) lies in Y . The equivalence relation is given by\n(φ0 : . . . : φn) = (λφ0 : . . . : λφn)\nfor any λ ∈ k(X)×. We say that φ is regular at P if there is a tuple (λφ0 : . . . : λφn) in its\nclass with each component regular at P and at least one nonzero at P. The open subset\nof X at which φ is regular is denoted dom(φ).\nRemark 15.15. We can alternatively represent the rational map φ: X →Y as a tuple\n\nof homogeneous polynomials in k[x0, . . . , xm] that all have the same degree and not all of\nwhich lie in I(X). To ensure that the image lies in Y one requires that for all f ∈I(Y ) we\nhave f(φ0, . . . , φn) ∈I(X). The equivalence relation is then (φ0 : . . . : φn) = (ψ0 : . . . : ψn)\nif and only if φiψj -φjψi ∈I(X) for all i.j.\nRemark 15.16. One can also define rational maps X →Y where one of X, Y is an affine\nvariety and the other is a projective variety. When Y is projective the definition is exactly\nthe same as in the case that both are projective (but we don't use homegenized functions\n\nto represent elements of k(X) when X is affine). When X is projective and Y is affine, a\nrational map is no longer an equivalence class of tuples, it is a particular tuple of rational\nfunctions on X. Of course there is still a choice of representation for each rational function\n(and the choice may vary with P), but note that in this case Remark 15.15 no longer applies.\nNow that we have defined rational maps for projective varieties we can define morphisms\nand dominant rational maps; the definitions are exactly the same as in the affine case, so\nwe can now state them generically.\nDefinition 15.17. A morphism is a regular rational map. A rational map is dominant if\nits image is dense in its codomain.\nThe analogs of Theorem 15.8 and Corollary 15.9 both apply to dominant rational maps\nbetween projective varieties.\nThe proofs are exactly the same, modulo the equivalence\nrelations for projective points and rational maps between projective varieties. Alternatively,\none can simply note that any dominant rational map X →Y of projective varieties restricts\nto a dominant rational map between any pair of the nonempty affine parts of X and Y (the\nnonempty affine parts of X (resp.\nY ) are all dense in X (resp.\nY ), and they are all\nisomorphic as affine varieties; see Corollary 14.10). Conversely, any dominant rational map\nof affine varieties can be extended to a dominant rational map of their projective closures\n(but this is not true of morphisms; see Example 15.20 below).\nTheorem 15.18. Theorem 15.8 and Corollary 15.9 hold for projective varieties as well as\naffine varieties.\n4It is clear that dom(r) is open in X; its intersection with each affine patch is an open subset of X.\n\nLet us now look at a couple of examples.\nExample 15.19. Let X ⊆A2 be the affine variety defined by x2 + y2 = 1, and let P be\nthe point (-1, 0) ∈X. The rational map φ: X →A1 defined by\nφ(x, y) =\n\ny\n1 -x\n=\nx + 1\n\ny\n\nsends each point Q = (x, y) ∈X different from P to the slope of the line PQ. The map φ\nis not regular (hence not a morphism), because it is not regular at P, but it is dominant\n(even surjective). The rational map φ-1 : A1 →X defined by\nφ-1(t) =\n\n-t2\n2t\n,\n1 + t2 1 + t2\n\nis an inverse to φ. Note that φ-1 is also not regular (it is not defined at √-1), but it is\ndominant (but not surjective). Thus X is birationally equivalent to A1, but not isomorphic\nto A1\n\n, as expected. The function fields of X and A1 are both isomorphic to k(t).\nNow let us consider the corresponding map of projective varieties. The projective closure\nX of X in P2 is defined by x2 + y2 = z2. We now define the rational map φ: X →P1 by\nφ(x : y : z) =\n\ny\n-x\ny\n: 1\n\n=\nz\n: 1\nx + z\n\n=\n\n1 :\ny\nz -x\n\nPer Remark 15.15, we could also write φ as\nφ(x : y : z) = (y : x + z) = (z -x : y)\nThe first RHS is defined everywhere except (1 : 0 : -1) and the second RHS is defined\neverywhere except (1 : 0 : 1), thus φ is regular everywhere, hence a morphism.\nWe also have the rational map φ: P1 →X defined by\ns2 -t2\n2st\n2st\ns2 + t2\nφ-1(s : t) =\n:\n: 1\n=\n1 :\n:\ns2 + t2\ns2 + t2\n\ns2 -t2\ns2 -t2\n\nwhich can also be written as\nφ-1(s : t) = (s2 -t2 : 2st : s2 + t2).\nThe map φ-1 is regular everywhere, hence a morphism, and the compositions φ\n*φ-1 and\nφ-*φ are both the identity maps, thus X and P1 are isomorphic.\nExample 15.20. Recall the morphism φ: A2 →A2 defined by φ(x, y) = (x, xy) from\nLecture 14, where we noted that the image of φ is not closed (but it is dense in A2, so φ is\ndominant). Let us now consider the corresponding rational map φ: P2 →P2 defined by\nx\nxy\nφ(x : y : z) =\n:\n: 1\n= (xz : xy : z2).\nz\nz2\nWe might expect φ to be a morphism,\n\nbut this is not\n\nthe case! It is not regular at (0 : 1 : 0).\nThis is not an accident. As we will see in the next lecture, morphisms of projective\nvarieties are proper, and in particular this means that they are closed maps (so unlike the\naffine case, the image of a morphism of projective varieties is a variety). But there is clearly\nno way to extend the morphism φ: A2 →A2 to a proper morphism φ: P2 →P2 (the image\nof φ in the affine patch z = 0 must be dense but not surjective), and this means that φ\ncannot be a morphism.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 16",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/62ecd19112f0baa33f151c5644f80b06_MIT18_782F13_lec16.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #16\n10/31/2013\nOur goal for this lecture is to prove that morphisms of projective varieties are closed\nmaps. In fact we will prove something stronger, that projective varieties are complete, a\nproperty that plays a role comparable to compactness in topology. For varieties, compact-\nness as a topological space does not mean much because the Zariski topology is so coarse.\nIndeed, every subset of An (and hence of Pn) is compact (or quasicompact, if your definition\nof compactness includes Hausdorff).\nTheorem 16.1. Let S be a subset of An, and let {Ua}a A be any collection of open sets\nof An\n∈\nwhose union contains S. Then there exists a finite set B ⊆A for which S ⊆{Ub}b∈B.\nProof. By enumerating the index set A in some order (which we can do, via the axiom of\nchoice), we can construct a chain of properly nested open sets {Vb}b∈B, where each Vb is\nthe union of the sets Ua over a ∈B with a ≤b (in our arbitrary ordering), and B ⊆A is\nconstructed so that each S ∩Va is properly contained in S ∩Vb for every pair a ≤b in B.\nThe complements of the sets Vb then form a strictly descending chain of closed sets whose\nideals form a strictly ascending chain of nested ideals {Ib}b∈B in R = k[x1, . . . , xn]. The\nring R is Noetherian, so B must be finite, and {Ub}b B is the desired finite subcover.\n∈\nIn order to say what it means for a variety to be complete, we first need to define the\nproduct of two varieties. Throughout this lecture k denotes a fixed algebraically closed field.\n16.1\nProducts of varieties\nDefinition 16.2. Let X ⊆Am and Y\nAn be algebraic sets. Let k[Am] = k[x1, . . . , xm],\nk[An\nm\n⊆\n] = k[y1, . . . , yn], and k[A\n+n] = k[x1, . . . , xm, y1, . . . , yn], so that we can identity k[Am]\nand k[An] as subrings of k[Am+n] whose intersection is k. The product X × Y is the zero\nlocus of the ideal I(X)k[An] + I(Y )k[Am] in k[Am+n].\nIf I(X) = (f1, . . . , fs) and I(Y ) = (g1, . . . , gt), then I(X × Y ) = (f1, . . . , fs, g1, . . . , gt)\nis just the ideal generated by the fi and gj when regarded as elements of k[Am+n]. We also\nhave projection morphisms\nπX : X × Y →X\nand\nπY : X × Y →Y\ndefined by the tuples (x 1, . . . , x m) and (y 1, . . . , y n), where x i and y j are the images of xi\nand yj, respectively, under the quotient map k[Am+n] →k[Am+n]/I(X × Y ) = k[X × Y ].\nThe coordinate ring of X ×Y is isomorphic to the tensor product of the coordinate rings\nof X and Y , that is\nk[X × Y ] ≃k[X] ⊗k[Y ].\nWhile the tensor product can be defined quite generally in categorical terms, in the case of\nk-algebras there is a very simple concrete definition. Recall that a k-algebra is, in particular,\na k-vector space. If R and S are two k-algebras with bases {ri}i I and {s\n,\n∈\nj}j∈J then the\nset of formal symbols {ri ⊗sj : i ∈I, j ∈J} forms a basis for the tensor product R ⊗S.\nProducts of vectors in R ⊗S are computed via the distributive law and the rule\n(ri1 ⊗sj1)(ri2 ⊗sj2) = ri1ri2 ⊗sj1sj2.\nAndrew V. Sutherland\n\nIn the case of polynomial rings one naturally chooses a monomial basis, in which case this\nrule just amounts to multiplying monomials and keeping the variables in the monomials\nseparated according to which polynomial ring they originally came from.\nIt is standard to generalize the ⊗notation and write r ⊗s for any r ∈R and s ∈S, not\njust basis elemen\nbasis elements Pts, with the understanding that r ⊗s represents a linear combination of\ni,j αij(ri ⊗sj) that can be computed by applying the identities\n(a + b) ⊗c = a ⊗c + b ⊗c\na ⊗(b + c) = a ⊗b + a ⊗c\n(γa) ⊗(δb) = (γδ)(a ⊗b)\nwhere γ and δ denote elements of the field k. We should note that most elements of R ⊗S\nare not of the form r ⊗s, but they can all be written as finite sums of elements of this form.\nWhen R and S are commutative rings, so is R ⊗S. There are then natural embeddings\nof R and S into R ⊗S given by the maps r →r ⊗1S and s →1R ⊗s, and 1R ⊗1S is the\nmultiplicative identity in R ⊗S. The one additional fact that we need is that if R and S\nare affine algebras (finitely generated k-algebras that are integral domains), so is R ⊗S. In\norder to prove this we first note a basic fact that we will use repeatedly:\nLemma 16.3. Let V be an affine variety with coordinate ring k[V ]. There is a one-to-one\ncorrespondence between the maximal ideals of k[V ] and the points of V .\nProof. Let P = (a1, . . . , an) be a point on V ⊆An, and let mP be the corresponding\nmaximal ideal (x1 -a1, . . . , xn -an) of k[x1, . . . , xn]. Then I(V ) ⊆mP , and the image of\nmP in the quotient k[V ] = k[x1, . . . , xn]/I(V ) is a maximal ideal of k[V ]. Conversely, every\nmaximal ideal of k[V ] corresponds to a maximal ideal of k[x1, . . . , xn] that contains I(V ),\nwhich is necessarily of the form mP for some P ∈V , by Hilbert's Nullstellensatz.\nLemma 16.4. If R and S are both affine algebras, then so is R ⊗S.\nProof. We need to show that R ⊗S has no zero divisors. So suppose uv = 0 for some\nu, v ∈R ⊗S. We will show that either u = 0 or v = 0.\nWe can write u and v as finite sums u = P\ni I ri ⊗si and v = P\nj J r\ns\n∈\n∈\nj ⊗\nj, with\nri, rj ∈R and si, sj ∈S all nonzero, and we can assume the sets {si}i∈I and {sj}j∈J are\neach linearly independent over k by choosing the si and sj to be basis vectors. Without loss\nof generality, we may assume R = k[X], for some affine variety X. Let Xu be the zero locus\nof the ri in X and and let Xv be the zero locus of the rj in X. For any point P ∈X we have\nthe evaluation map φP : k[X] →k defined by φP (f) = f(P), which is a ring homomorphism\nfrom R to k that fixes k. We now extend φP to a k-algebra homomorphism R ⊗S →S by\ndefining φP (r ⊗s) = φP (r)s. We then have\nφP (uv) = φP (u)φP (v) =\nX\nφP (ri)si\ni∈I\n!\nX\nφP (rj)sj\n= 0\nj∈J\n\nSince S is an integral domain, one of the two sums must be zero, and since\n\nthe si are linearly\nindependent over k, either φP (ri) = 0 for all the ri, in which case P ∈Xu, or φP (rj) = 0\nfor all the rj, in which case P ∈Xv. Thus X = Xu ∪Xv. But X is irreducible, so either\nX = Xu, in which cace u = 0, or X = Xv, in which case v = 0.\n\nCorollary 16.5. If X and Y are affine varieties, then so is X × Y .\nRemark 16.6. This proof is a nice example of the interaction between algebra and geom-\netry. We want to prove a geometric fact (a product of varieties is a variety), but it is easier\nto prove an algebraic fact (a tensor product of affine algebras is an affine algebra). But in\norder to prove the algebraic fact, we use a geometric fact (a variety is not the union of two\nproper algebraic subsets). Of course we could translate everything into purely algebraic or\npurely geometric terms, but the proofs are easier to construct (and easier to understand!)\nwhen we can move back and forth freely.\nA product of projective varieties is defined similarly, but there is a new wrinkle; we now\nneed two distinct sets of homogeneous coordinates. Points in Pm × Pn can be represented\nin the form (a0 : . . . : am; b0 : . . . : bn), where\n(a0 : . . . : am; b0 : . . . : bn) = (λa0 : . . . : λam; μb0 : . . . : μbn)\nfor all λ, μ ∈k×. We are now interested in polynomials in k[x0, . . . , xm, y0, . . . , yn] that\nare homogeneous in the xi, and in the yj, but not necessarily both. Another way of say-\ning this is that we are interested in polynomials that are homogeneous as elements of\n(k[x0, . . . , xm])[y0, . . . , yn], and as elements of (k[y0, . . . , yn])[x0, . . . , xm]. Let us call such\npolynomials (m, n)-homogeneous. We can then meaningfully define the zero locus of an\n(m, n)-homogeneous polynomial in Pm × Pn and give Pm × Pn the Zariski topology by\ntaking algebraic sets to be closed.\nRemark 16.7. The Zariski topology on Pm × Pn we have just defined is not the product\nof the Zariski topologies on Pm and Pn. This will be explored on the problem set.\nDefinition 16.8. Let X ⊆Pm and Y ⊆Pn be algebraic sets with homogeneous ideals\nI(X) ⊆k[x0, . . . , xm] and I(Y ) ⊆k[y0, . . . , yn]. The product X × Y is the zero locus of the\n(m, n)-homogeneous polynomials in the ideal\nI(X × Y ) := I(X)k[y0, . . . , yn] + I(Y )k[x0, . . . , xm]\nof k[x0, . . . , xm, y0, . . . , yn]. We say that X × Y is a variety if the ideal I(X × Y ) is prime.\nAs in the affine case, we again have k[X × Y ] = k[X] ⊗k[Y ], which implies that the\nproduct of two projective varieties is again a variety.\nRemark 16.9. One can identify Pm × Pn with a subvariety of a larger projective space PN\n(but N is definitely not m + n). Thus the product of two projective varieties is indeed a\nprojective variety. This will be explored on the next problem set.\nWe may also consider products of affine and projective varieties. In this case we are inter-\nested in subsets of Pm⊗An that are the zero locus of polynomials in k[x0, . . . , xm, y1, . . . , yn]\nthat are homogeneous in xi but may be inhomogeneous in the yj. Per the remark above, we\ncan smoothly embed a product of projective varieties in a single projective variety, and as\nwe have already seen we can smoothly embed a product of affine varieties in a single affine\nvariety. Thus any finite product of affine and projective varieties is isomorphic to one of (1)\nan affine variety, (2) a projective variety, (3) the product of a affine variety and a projective\nvariety.\n\n16.2\nComplete varieties\nWe can now say what it means for a variety to be complete.\nDefinition 16.10. A variety X is complete if for every variety Y the projection X ×Y →Y\nis a closed map; this means that the projection of a closed set in X × Y is a closed in Y .\nRemark 16.11. We get the same definition if we restrict to affine varieties Y . Any variety Y\ncan be covered by a finite number of affine parts {Ui}, and if the projection X × Ui →Ui\nis a closed map for each Ui, then the projection X × Y →Y is also a closed map, since the\nunion of a finite number of closed sets is a closed set.\nLemma 16.12. If X is a complete variety then any morphism φ: X →Y is a closed map\nwhose image is a complete variety.\nProof. Let us consider the set\nΓφ := {(P, φ(P)) : P ∈X} ⊆X × Y,\nwhich is the graph of φ. It is a closed set, the zero locus of y = φ(x) (here the variables x\nand y represent points in X and Y that may have many coordinates; the exact equation\ncan be explicitly spelled out in the ambient space containing X × Y using generators for\nI(X), I(Y ), and the coordinate maps of φ but there is no need to do so). The projection\nmap X × Y →Y is a closed map, since X is complete, so im(φ) is a closed subset of Y ,\nand it must be irreducible, since it is the image of a variety. Similarly, if Z is any closed\nset in X, by considering the graph of the restriction of φ to Z and applying the fact that\nX is complete we can show that φ(Z) is closed. Thus φ is a closed map.\nWe now show that φ(X) is complete. So let Z be any variety and consider the projection\nφ(X) × Z →Z. Let us define the morphism Φ: X × Z →Y × Z by Φ(P, Q) = (φ(P), Q).\nIf V is a closed set in φ(X) × Z ⊆Y × Z, then its inverse image Φ-1(V ) is closed in X × Z,\nsince Φ is continuous. Since X is complete, the projection of Φ-1(V ) to Z is closed, but this\nis precisely the projection of V to Z, since the Z-component of Φ is the identity map.\nLemma 16.13. If X is complete then so is every subvariety of X.\nProof. Let V ⊆X be a variety.\nFor any variety Z the projection V × Z →Z is the\ncomposition\nV × Z →X × Z →Z,\nwhere the first map is an inclusion and the second map is a projection, both of which are\nclosed maps. Thus the projection V × Z →Z is a closed map and V is complete.\nTheorem 16.14. Every complete affine variety consists of a single point.\nProof. We first consider A1 and the closed set\n(x, y) : xy = 1\nin A1\nA1. The projection\nto the second A1\n{\n}\n×\nis A -{0}, not a closed set, so the first A1 is not complete.\nNow suppose X is an affine variety of positive dimension and let f be a function in\nk[X] that does not lie in k; such an f exists since k(X) has positive transcendence degree.\nThe morphism f : X →A1 that sends P to f(P) most then be dominant, because the\ndual morphism of affine algebras k[A1] →k[X] is injective; it corresponds to the inclusion\nk[f] ⊆k[X] with k ⊊k[f]. But X is complete, so by Lemma 16.12 the image of f : X\nA1\nis a complete variety, and f is dominant, so A1\n→\nis complete, a contradiction.\nThus every complete affine variety has dimension 0 and is therefore a point.\n\nWith one trivial exception, affine varieties are not complete. In contrast, we will prove\nthat every projective variety is complete.\nIn order to prove this we will apply a theorem of Chevalley that gives a criterion for\nthe completeness of a variety in terms of the valuation rings in the function fields of all its\nsubvarieties; this is known as the valuative criterion for completeness. But we first take a\nbrief interlude to discuss valuation rings.\n16.3\nValuation rings\nWe have already seen many examples of valuation rings in this course, but let us now\nformally define the general term.\nDefinition 16.15. A proper subring R of a field K is a valuation ring of K if for every\nx ∈K×, either x ∈R or x-1 ∈R (possibly both).\nNote that a valuation ring R is an integral domain (since it is a subring of a field), and\nthat K is its field of fractions. Given an arbitrary integral domain R that is not a field, we\nsay that R is a valuation ring if it is a valuation ring of its fraction field. In Problem Set 2\nyou proved that if K is any field with an nonarchimedean absolute value ∥∥, then the set\nR = {x ∈K : ∥x∥≤1}\nis a valuation ring. You also proved that such an R is a local ring.\nDefinition 16.16. A local ring is a ring R with a unique maximal ideal m. The field R/m\nis the residue field of R.\nNote that fields are included in the definition of a local ring (the unique maximal ideal\nis the zero ideal), but specifically excluded from the definition of a valuation ring.\nLemma 16.17. A ring R is a local ring if and only if the set R -R× is an ideal.\nProof. If R -R× is an ideal, then it contains every proper ideal and is therefore the unique\nmaximal ideal of R. Conversely, every element of R -R× lies in a maximal ideal, and if\nthere is only one such ideal it must equal R -R×.\nTheorem 16.18. Every valuation ring is a local ring.\nProof. Let R be a valuation ring and let m = R -R×. We must show that m is an ideal. If\na ∈R× then ar ∈R× for all r ∈R. So mR ⊆m. If a, b ∈m then a/b or b/a lies in R. So\n(a/b + 1)b = a + b or (b/a + 1)a = b + a lies in m, hence m is an ideal.\nA key property of valuation rings is that their ideals are totally ordered.\nLemma 16.19. If a and b are two ideals of a valuation ring R then either a ⊆b or b ⊆a.\nProof. Suppose not. Then there exist a ∈a-b and b ∈b-a, both nonzero. Either a/b or b/a\nlies in R, so either (a/b)b = a ∈b or (b/a)a = b ∈a, both of which are contradictions.\nThe proof of Lemma 16.19 allows us to compare nonzero elements of R: we have a/b ∈R\nif and only if (a) ⊆(b). This leads to the following definition.\nDefinition 16.20. Let R be a valuation ring with fraction field K. The value group of R\nis Γ = K×/R×. The valuation defined by R is the quotient map v: K× →Γ.\n\nThe abelian group Γ is typically written additively, and it follows from Lemma 16.19\nthat it is totally ordered (its elements are associate classes and their inverses). We have\n1. v(x) = 0 if and only if x ∈R×,\n2. v(xy) = v(x) + v(y),\n3. v(x + y) ≥min(v(x), v(y)).\nThe first two properties are immediate from the definition; the third will be proved on the\nproblem set. For x ∈K× we then have v(x) ≥0 if and only if x is a nonzero element of R.\nBy convention we extend v to K by defining v(0) = inf, where infis greater than every\nelement of the valuation group Γ. We then have R = {x ∈K : v(x) ≥0}.1\nWhen a valuation ring R is a PID, it is then a UFD with a unique (up to associates)\nprime element p that generates its maximal ideal. In this case Γ ≃Z, since for nonzero\na ∈R we can associate v(a) to the largest integer n for which pn|a; this also determines\nv(1/a) = -v(a). In this situation we say that Γ is discrete and call R a discrete valuation\nring. Recall that earlier we defined discrete valuation rings as local rings that are PIDs but\nnot fields. We will see show that this definition is equivalent, and also precisely characterize\nthe distinctions in the inclusions\ndiscrete valuation rings\n⊂\nvaluation rings\n⊂\nlocal rings\nLemma 16.21. Every finitely generated ideal of a valuation ring is principal.\nProof. Let (a1, . . . , an) be a finitely generated ideal of a valuation ring R with n minimal and\nsuppose n > 1. We must have a1/a2 ∈R, else the generator a1 = (a1/a2)a2 is redundant.\nBut then a2/a1 ∈R and a2 = (a2/a1)a2 is redundant, a contradiction.\nLemma 16.22. A local ring is a valuation ring if and only if it is an integral domain that\nis not a field and all of its finitely generated ideals are principal.\nProof. The \"only if\" part of the statement is clear, so let us assume that R is a local ring\nthat satisfies the hypothesis on the right, and let a/b be any element of its fraction field. The\nideal (a, b) is finitely generated, hence principal, say (a, b) = (c). Thus for some d, e, f, g ∈R\nwe have a = cd, b = ce, and c = af + bg = cdf + ceg, and therefore df + eg = 1. If neither d\nnor e is a unit, then they both lie in the maximal ideal of R and so does 1, a contradiction.\nSo one of d or e is a unit, and therefore one of a/b = d/e and b/a = e/d lies in R.\nThe second lemma implies, in particular, that our two definitions of discrete valuation\nring are equivalent. Together the two lemmas give a third definition.\nCorollary 16.23. A valuation ring is discrete if and only if it is Noetherian.\nWhen the fraction field K of a valuation ring R is an extension of a smaller field k that\nis contained in R, we say that R is a valuation ring of the extension K/k.\n1Note that for Γ ⊆R we define ∥x∥= c-v(x) for some c > 0, so this agrees with R = {x ∈K : ∥x∥≤1}.\n\n16.4\nLocalization of a ring at a prime\nOne of the main ways in which local rings arise is by localizing an integral domain at one\nof its prime ideals.\nDefinition 16.24. Let R be an integral domain and let p be a prime ideal in R. The\nsubring of R's fraction field defined by\nRp := {a/b : a, b ∈R, b ∈p}\nis called the localization of R at p.2\nRemark 16.25. As we saw in Lecture 15, caution is needed when interpreting expressions\nlike a/b in fraction fields of rings that are not necessarily UFDs; Rp is a set of equivalence\nclasses, and a/b is just one representative of a particular class. It may happen that the\nequivalence class a/b lies in Rp even though b ∈p; this occurs if a/b = c/d for some d ∈p.\nWe have ad = bc, so if b ∈p then either a or d lies in p, but it could be a and not d.\nWe view R as a subring of the localization Rp via the canonical embedding r →r/1.\nLemma 16.26. The ring Rp is a local ring with maximal ideal pRp\nProof. This is obvious when Rp is a UFD, but we can't assume this; however we can assume\nthat we always pick representatives a/b ∈Rp so that b ∈p. If a/b ∈Rp is not in pRp then\nclearly a ∈p and therefore b/a ∈Rp, so a/b is a unit. Conversely, if a/b ∈Rp is a unit then\n(a/b)(c/d) = 1 for some c, d ∈R with d ∈p. We then have ac = bd, and if a is in p, then\nso is bd, but then either b ∈p or d ∈p, since p is prime, which is a contradiction. Thus\nRp = pRp ⊔Rp\n×, therefore Rp is a local ring with maximal ideal pRp.\nIn general, the localization Rp need not be a valuation ring, but provided that p is\nnonzero it is always contained in one, as you will prove on the problem set.\n16.5\nValuative criterion for completeness\nWe now return to our goal of proving that every projective variety is complete. Let X be\na variety with coordinate ring k[X], and let P be a point in X. We then define the ideal\nmP := {f ∈k[X] : f(P) = 0}.\nNote that we have defined what f(P) = 0 means, and even how to evaluate f at P, for\nall the varieties we have considered, so this definition applies to any variety, not just affine\nvarieties. Indeed, mP is the kernel of the evaluation map k[X] →k defined by f →f(P).\nThis makes it clear that mP is a maximal ideal, since the quotient k[X]/mP ≃k is a field.\nDefinition 16.27. Let X be a variety with coordinate ring k[X] and let P ∈X. The local\nring of P on X is the ring\nOP := OP,X := k[X]mP = {g/h ∈k(X) : h ∈mP }.\nWith Remark 16.25 in mind, it is clear that OP is precisely the ring of functions in k(X)\nthat are regular at P.\n2Be sure not to confuse Rp with the quotient R/p.\n\nWe are now ready to state Chevalley's valuative criterion for completeness.\nTheorem 16.28. Let X be a variety such that for every subvariety Z ⊆X and valuation\nring R of k(Z)/k there exists a point P ∈Z such that OP,Z ⊆R. Then X is complete.\nThe proof below is adapted from [2, Prop. 7.17].\nProof. So let Y be an affine variety and let V ⊆X × Y be a closed set. We may assume\nthat V is irreducible, since we can always write V as a finite union of irreducible sets (the\ncoordinate ring of X × Y is Noetherian) and then prove that the image of each is closed,\nand we may replace Y with the image of V ⊆X × Y →Y , since whether the image is\nclosed or not does not depend on anything outside of its closure. We now replace X with\nthe image Z of V ⊆X × Y →X, to which we will apply the hypothesis of the theorem.\nWe have the following commutative diagram with dominant morphisms φ and ψ.\nφ\nY\nπY\nV\n⊆\nZ × Y\nπZ\nψ\nZ\nWe need to show that the morphism φ is actually a surjection. So let Q be any point in Y ;\nwe will construct a point P such that (P, Q) is in V , which will prove Q ∈φ(V ).\nLet φ: k[Y ] →k be the evaluation map φ(g) = g(Q), which we note fixes k (and is\ntherefore surjective). The morphism of affine algebras φ∗: k[Y ] →k[V ] is injective, since φ\nis dominant, thus we may regard k[Y ] as a subring of k[V ], which is in turn embedded in\nthe function field k(V ). By Lemma 16.29 below, there exists a valuation ring S of k(V )/k\nthat contains the image of k[Y ] in k(V ) such that the quotient map Φ: S →k from S to\nits residue field k is an extension of φ.\nLet us now consider the inverse image R ⊆k(Z) of S under ψ∗: k(Z) →k(V ). The\nring R is a valuation ring of k(Z)/k, because its image S is a valuation ring of k(V )/k. By\nthe hypothesis of the theorem there is a point P ∈Z such that local ring OP,Z of Z at P\nis contained in R. We then have\nψ∗\nk[Z] ⊆OP,Z ⊆R -→S -→k\nBy construction, S contains k[Y ] ⊆k(V ), and it contains the injective image of k[Z] under\nthe map above. It follows that S contains the surjective image of k[Z × Y ] ≃k[Z] ⊗k[Y ]\nin k[V ] under the morphism dual to the inclusion V ⊆Z × Y , and therefore S contains\nk[V ] ⊆k(V ). The intersection of ker Φ with k[V ] is a maximal ideal of k[V ] corresponding\nto a point in V . This point must be (P, Q); in fact it suffices to show the second coordinate\nis Q, and this is clear: the map Φ: S →k is an extension of φ: k[Y ] →k, and for any\nQ′\n\n= Q we can find a function in k[Y ] that vanishes at Q but not at Q′ (since k = k).\nThe lemma used in the proof above is a standard result in commutative algebra that we\nwon't prove here.\n\nLemma 16.29. Let A be an integral domain contained in a field K and let φ: A →k be a\nhomomorphism to an algebraically closed field k. Then there exists a valuation ring B of K\ncontaining A and a homomorphism Φ: B →k that extends φ. The kernel of Φ is then the\nmaximal ideal of B and k is its residue field.\nProof. Apply Propositions 5.21 and 5.23 of [1].\nIt will follow easily from Theorem 16.28 that all projective varieties are complete once\nwe prove two lemmas. The first is a technical result that allows us to restrict the residue\nfield of the valuation ring R that appears in the hypothesis of the thoerem.\nLemma 16.30. Let R be a valuation ring of an extension F/k of an algebraically closed\nfield k. Then there is a valuation ring R′ ⊆R of F/k with residue field isomorphic to k.\nProof. Let m be the maximal ideal of R and let K = R/m be its residue field. We may\nview k as a subfield of K, since the map k ⊆R →R/m = K is a ring homomorphism\nof fields. So k is an integral domain contained in K, and the identity map φ: k →k is\na homomorphism to an algebraically closed field. By Lemma 16.29, there is a valuation\nring S of K/k whose residue field is k. The map k ⊆S →k is then the identity map.\nThe preimage of R′ = Ψ-1(S) ⊆R under the quotient map Ψ: R →K is a subring of\nR, and the kernel of the map R′ →S →k is a maximal ideal m′ (since k is a field), and\nm′ contains m = Φ-1(0). We claim that R′ is a valuation ring of F/k. It is clear that R′\ncontains k, we just need to show that it is a valuation ring of F.\nSo let x ∈F. If x ∈R then 1/x ∈m ⊆m′ ⊆R′. If x ∈R but x ∈R′, then x ∈m′\nand therefore x ∈m, implying that 1/x ∈R, since R is a valuation ring. The image of x\nin K under the quotient map R →K does not lie in S, since x ∈R′, so the image of 1/x\nin K must lies in S, since S is a valuation ring of K/k. Therefore 1/x ∈R′. Thus for every\nx ∈F either x or 1/x lies in R′. So R′ is a valuation ring of F, and R′/m′ ≃k.\nCorollary 16.31. If X is a variety such that for every subvariety Z ⊆X and valuation\nring R of k(Z)/k with residue field k there is a point P ∈Z such that OP,Z ⊆R, then X\nis complete.\nThe next lemma is almost trivial, but it is the essential reason why projective varieties\nare complete (in contrast to affine varieties), so we consider it separately.\nLemma 16.32. Let R be a valuation ring of F. For any x0, . . . , xn ∈F × there exists\nλ ∈F × such that λx0, . . . , λxn ∈R and at least one λxi is a unit in R.\nProof. We proceed by induction. For n = 0 we may take λ = 1/x0 so that λx0 = 1 ∈R×.\nWe now assume λx0, . . . , λxn\n1 ∈R with λxi ∈R× for some i < n. If λx\n-\nn ∈R then we are\ndone, and otherwise 1/(λxn) ∈R and we let λ′ = 1/xn. Then λ′xj = xi/xn = λxj/(λxn)\nlies in R for j < n, and λ′xn = 1 ∈R×.\nTheorem 16.33. All projective varieties are complete.\nProof. By Lemma 16.13, it is enough to show that Pn is complete. To do this we apply\nCorollary 16.31. Let Z be a variety in Pn and let R be a valuation ring of k(Z)/k with\nresidue field k. We will construct a point P ∈Z for which OP ⊆R.\nLet y0, . . . , yn be homogeneous coordinates for Pn and let z0, . . . , zn denote their images\nin k(Z). Recall that elements of k(Z) can be represented as rational functions whose numer-\nator and denominator are homogeneous polynomials of the same degree; these correspond\n\nto homegenizations of elements of k(Zi) with respect to yi, where Zi = Z ∩Zi is a nonempty\naffine part of Z.\nBy Lemma 16.32 there exists λ ∈k(Z)× such that λz0, . . . , λzn ∈R with at least one\nλzi ∈R×. Let φ: R →k be the quotient map from R to its residue field, and let P be the\nprojective point (φ(λz0) : φ(λz1) : . . . : φ(λzn)), where we note that at least one φ(λzi) is\nnonzero. The point P lies in Z, since for any homogeneous f ∈I(Z) of degree d we have\nf(λz0, . . . , λzn) = λdf(z0, . . . , zn) = 0\nas an element of k(Z), and therefore\n0 = φ(0) = φ(f(λz0, . . . , λzn)) = f(φ(λz0), . . . , φ(λzn)) = f(P).\nAny element of the local ring OP can be written as g/h with h(P) = 0, and we can write\ng and h as homogeneous polynomials in λz0, . . . , λzn that lie in R (since the λzi generate\nk(Z) as a k-algebra). We then have\nφ(h(λz0, . . . , λzn)) = h(φ(λz0), . . . , φ(λzn)) = h(P) = 0,\nso h ∈ker φ, and therefore h ∈R×, so g/h ∈R. Thus OP ⊆R, as desired.\nReferences\n[1] M. F. Atiyah and I. G. MacDonald, Introduction to commutative algebara, Addison-\nWesley, 1969.\n[2] D. Bump, Algebraic geometry, World Scientific, 1998.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 17",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/34da4eafb6fbe4d016d08aa7914a4be7_MIT18_782F13_lec17.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #17\n11/05/2013\nThroughout this lecture k denotes an algebraically closed field.\n17.1\nTangent spaces and hypersurfaces\nFor any polynomial f ∈k[x1, . . . , xn] and point P = (a1, . . . , an) ∈An we define the affine\nlinear form\nn\n∂f\nfP (x1, . . . , xn) :=\nX\n(P)(xi\n∂xi\ni=1\n-ai).\nThe zero locus of fP in An is an affine hyperplane in An, a subvariety isomorphic to An-1.\nNote that fP (P) = 0, so the zero locus contains P.\nDefinition 17.1. Let P be a point on an affine variety V . The tangent space of V at P is\nthe variety TP (V ) defined by the ideal {fp : f ∈I(V )}.\nIt is clear that Tp(V ) is a variety; indeed, it is the nonempty intersection of a set of\naffine hyperplanes in An and therefore an affine subspace of An isomorphic to Ad, where\nd = dim TP (V ). Note that the definition of TP (V ) does not require us to choose a set of\ngenerators for I(V ), but for practical applications we want to be able to compute TP (V )\nin terms of a finite set of generators for I(V ). The following lemma shows that we can do\nthis, and, most importantly, it does not matter which set of generators we pick.\nLemma 17.2. Let P be a point on an affine variety V . If f1, . . . , fm generate I(V ), then\nthe corresponding affine linear forms f1,P , . . . , fm,P generate I(TP (V )).\nProof. Let g = P hifi be an element of I(V ). Applying the product rule and the fact that\nfi,P (P) = 0 yields\ngP =\nXhi(P)fi,P + hi,P fi(P)\ni\n\n=\nX\nhi(P)fi,P ,\n(1)\ni\nwhich is an element of the ideal (f1,P , . . . , fm,P ). Thus I(Tp(V )) = (f1,P , . . . , fm,P ).\nWhen considering the tangent space of a variety at a particular point P, we may assume\nwithout loss of generality that P = (0, . . . , 0), since we can always translate the ambient\naffine space An; this is just a linear change of coordinates (indeed, this is the very definition\nof affine space, it is a vector space without a distinguished origin). We can then view the\naffine subspace TP (V ) ⊆An as a linear subspace of the vector space kn. The affine linear\nforms f\nare then linear forms on kn\nP\n, equivalently, elements of the dual space (kn)∨.\nRecall from linear algebra that the dual space (kn)∨is the space of linear functionals\nλ: kn →k. The orthogonal complement S⊥⊆(kn)∨of a subspace S ⊆kn is the set of\nlinear functionals λ for which λ(P) = 0 for all P ∈S; it is a subspace of (kn)∨, and since\nkn has finite dimension n, we have dim S + dim S⊥= n.\nTheorem 17.3. Let P be a point on an affine variety V ⊆An with ideal I(V ) = (f1, . . . , fm).\nIf we identify An with the vector space kn with origin at P, the subspace of (kn)∨spanned\nby the linear forms f1,P , . . . , fm,P is TP (V )⊥, the orthogonal complement of Tp(V ).\nAndrew V. Sutherland\n\nProof. This follows immediately from Lemma 17.2 and its proof; the set of linear forms in\nI(TP (V )) is precisely the set of linear forms that vanish at every point in Tp(V ), which, by\ndefinition, is the orthogonal complement TP\n∨. Moreover, we see from (1) that every linear\nform in I(TP (V )) is a k-linear combination of f1,P . . . , fm,P .\nThe vector space TP (V )⊥is called the cotangent space of V at P. As noted above,\nas a variety, TP (V ) is isomorphic to some Ad, where d = dim TP (V ), and it follows that\nthe dimenstion of TP (V ) as a vector space is the same as its dimension as a variety, since\ndim Ad = d = dimk kd. The dimension of TP (V )⊥is then n -d.\nRecall from Lecture 13 the Jacobian matrix\n∂f1 (P)\n· · ·\n∂f1 (P)\n∂x1\nxm\n.\n.\nJP = JP (f1, . . . , fm) :=\n\n..\n· · ·\n.\n.\n.\n∂fm (P)\n∂x1\n· · ·\n∂fn (P)\nxm\n\nFor a variety V with I(V ) = (f1, . . . , fm), we defined a point P ∈V to be smooth (or\nnonsingular) precisely when rank JP = n -dim V .\nViewing JP as the matrix of a lin-\near transformation from (kn)∨to (kn)∨whose image is TP (V )⊥, we obtain the following\ncorollary of Theorem 17.3.\nCorollary 17.4. Let P be a point on an affine variety V ⊆An with I(V ) = (f1, . . . , fm),\nand let JP = JP (f1, . . . , fm). Then dim TP (V )⊥= rank JP and dim TP (V ) = n -rank JP .\nIn particular, the rank of JP does not depend on the choice of generators for I(V ) and P\nis a smooth point of V if and only if dim TP = dim V .\nRemark 17.5. For projective varieties V we defined smooth points P as points that are\nsmooth in all (equivalently, any) affine part containing P. One can also define tangent spaces\nand Jacobian matrices for projective varieties directly using generators for the homogeneous\nideal of V . This is often more convenient for practical computations.\nCorollary 17.14 makes it clear that, as claimed in Lecture 13, our notion of a smooth\npoint P ∈V is well defined; it does not depend on which generators f1, . . . , fm of I(V ) we\nuse to compute JP , or even on the number of generators. Now we want to consider what can\nhappen when dim TP (V ) = dim V . Intuitively, we would should expect that dim TP (V ) is\nthen strictly greater than dim V ; this is easy to see when V is defined by a single equation,\nsince then JP (f) has just one row and its rank is either 0 or 1. We will prove that we always\nhave dim TP (V ) ≥dim V by reducing to this case.\nDefinition 17.6. A variety V for which I(V ) is a nonzero principal ideal is a hypersurface.\nLemma 17.7. Every hypersurface in An or Pn has dimension n -1.\nProof. Let V ⊆An be a hypersurface with I(V ) = (f) for some nonzero f ∈k[x1, . . . , xn].\nWe must have dim V ≤n -1, since V ⊊An. Let φ: k[x1, . . . , xn] →k[x1, . . . , xn]/(f)\nbe the quotient map. We must have f ∈k, since V = ∅, so degxi f > 0 for some xi,\nsay x1. If dim V < n -1 then the transcendence degree of k(V ) is less than n -1, therefore\nφ(x2), . . . , φ(xn) must be algebraically dependent as elements of k(V ). Thus there exists\ng ∈k[x2, . . . , xn] such that g(φ(x2), . . . , φ(xn)) = 0. But then φ(g) = 0, so g ∈ker φ = (f).\nBut this is a contradiction, since degx1 g = 0. So dim V = n -1. If V\nn\n⊆Pn, then one of its\naffine parts Vi is a hypersurface in A , and then dim V = dim Vi = n -1.\n\nThe converse to Lemma 17.7 is true; every variety of codimension 1 is a hypersurface.\nThis follows from the general fact that every variety is birationally equivalent to a hyper-\nsurface. Recall that a function field F/k if any finitely generated extension; the dimension\nof a function field is its transcendence degree.\nTheorem 17.8. Let F/k be a function field of dimension n. Then there exist algebraically\nindependent elements α1, . . . , αn ∈F and an element αn+1 algebraic over k(α1, . . . , αm)\nsuch that F = k(α1, . . . , αn+1).\nThe following proof is adapted from [1, App. 5, Thm. 1].\nProof. Let γ1, . . . , γm be a set of generators for F/k of minimal cardinality m, ordered so\nthat γ1, . . . , γn is a transcendence basis (every set of generators contains a transcendence\nbasis). If m = n then we may take γn+1 = 0 and we are done. Otherwise γn+1 is algebraic\nover k(γ1, . . . , γn), and we claim that in fact m = n + 1 and we are also done.\nSuppose m > n + 1. Let f ∈k[x1, . . . , xn+1] be irreducible with f(γ1, . . . , γn+1) = 0;\nsuch an f exists since γ1, . . . , γn+1 are algebraically dependent. We must have ∂f/∂xi = 0\np\np\nfor some xi; if not than we must have char(k) = p > 0 and f = g(x1, . . . , xn+1) =\ngp(x1, . . . , xn+1) for some g ∈k[x1, . . . , xn+1], but this is impossible since f is irreducible. It\nfollows that γi is algebraic, and in fact separable, over K = k(γ1, . . . , γi-1, γi+1, . . . , γn+1);\nthe irreducible polynomial f(γ1, . . . , γi\n1, xi, γi+1, . . . , γn+1 ) has γi as a root, and its deriva-\n-\n|\ntive is nonzero. Now γm is also algebraic over K, and it follows from the primitive element\ntheorem [2, §6.10] that K(γi, γm) = K(δ) for some δ ∈K.1\nBut this contradicts the\nminimality of m, so we must have m = n + 1 as claimed.\nRemark 17.9. Theorem 17.8 holds for any perfect field k; it is not necessary for k to be\nalgebraically closed.\nTheorem 17.10. Every affine (resp.\nprojective) variety of dimension n is birationally\nequivalent to a hypersurface in An+1 (resp. Pn+1).\nProof. Two projective varieties are birationally equivalent if and only if all their nonempty\naffine parts are, and the projective closure of a hypersurface is a hypersurface, so it suffices\nto consider affine varieties. Recall from Lecture 15 that varieties are birationally equivalent\nif and only if their function fields are isomorphic, and it follows from Theorem 17.8 that\nevery function field arises as the function field of a hypersurface: if k(V ) = k(γ1, . . . , γn+1)\nwith γ1, . . . , γn) algebraically independent, then there exists an irreducible polynomial f in\nk[x1, . . . , xn+1] for which f(γ1, . . . , γn+1) = 0, and then V is birationally equivalent to the\nzero locus of f in An+1.\nCorollary 17.11. For any point P on an affine variety V we have dim TP (V ) ≥dim V .\nCorollary 17.12. The set of singular points of a variety is a closed subset; equivalently,\nthe set of nonsingular points is a dense open subset.\nProof. It suffices to prove this for affine varieties. So let V ⊆An be an affine variety with\nideal (f1, . . . , fm), and for any P ∈V let JP = JP (f1, . . . , fm) be the Jacobian matrix.\nThen\nSing(V) := {P: dim TP(V) > dim V} = {P: rank JP < n -dim V}\n1As noted in [2], to prove K(α, β) = K(δ) for some δ ∈K(α, β), we only need one of α, β to be separable.\n\nis the set of singular points on V . Let r = n -dim V . We have rank JP < r if and only if\nevery r ×r minor of JP has determinant zero. If we now consider the matrix of polynomials\n(∂fi/∂xj), the determinant of each of its r × r minors is a polynomial in k[x1, . . . , xn], and\nSing(V) is the intersection of V with the zero locus of all these polynomials. Thus Sing(V)\nis an algebraic set, hence closed.\nRecall the one-to-one correspondence between points P = (a1, . . . , an) in An and max-\nimal ideals MP = (x1 -a1, . . . , xn -an) of k[An]. If V\nn\n⊆An is an affine variety, then\nthe maximal ideals mP of its coordinate ring k[V ] = k[A ]/I(V ) are in one-to-one corre-\nspondence with the maximal ideals MP of k[An] that contain I(V ); these are precisely the\nmaximal ideals MP for which P ∈V .\nIf we choose coordinates so that P = (0, . . . , 0), then MP is a k-vector space that\ncontains M2\nP as a subspace, and the quotient space MP /M 2\nP is then also a k-vector space.\nIndeed, its elements correspond to (cosets of) linear forms on kn. We may similarly view\nm\nP , mP , and mP /mP as k-vector spaces, and this leads to the following theorem.\nTheorem 17.13. Let P be a point on an affine variety V . Then TP (V )∨≃mP /m2\nP .\nProof. As above we assume without loss of generality that P = (0, . . . , 0). Then MP consists\nof the polynomials in k[x1, . . . , xn] for which each term has degree at least 1 (equivalently,\nconstant term 0). We now consider the linear transformation\nD: MP →(kn)∨\nthat sends f ∈MP to the linear form fP ∈(kn)∨. This map is surjective, and its kernel is\nM2\nP ; we have fP = 0 if and only if ∂f/∂xi(0) = 0 for i = 1, . . . , n, and this occurs precisely\nwhen every term in f has degree at least 2, equivalently, f ∈M2\nP . It follows that\nM /M2 ≃(kn\nP\nP\n)∨.\nThe restriction map (kn)∨→(TP )∨that restricts the domain of a linear form on kn to\nTP (V ) is surjective, and composing this with D yields a surjective linear transformation\nd: MP →TP (V )∨\nwhose kernel we claim is equal to M2\nP + I(V ) (this is a sum of ideals in k[x1, . . . , xn] that\nis clearly a subset of MP ). A polynomial f ∈MP lies in ker d if and only if the restriction\nof fP to TP (V ) is the zero function, which occurs if and only if fP = gP for some g ∈I(V ),\nsince TP the zero locus of gP for g ∈I(V ). But this happens if and only if f -g lies\nker D = M2\nP , equivalently, f ∈M2\nP + I(V ).\nWe therefore have\nMP\nMP /I(V )\nMP /I(V )\nT (V )∨\n≃\n=\nP /m2\nP\n≃\n≃m\nP .\nMP + I(V )\n(MP + I(V )/I(V )\nMP /I(V )\nCorollary 17.14. The smooth points P on a variety V are precisely the points P for which\ndim mP /m2\nP = dim V = dim k[V ]\nThe three dimensions in the corollary above are, respectively, the dimension of mP /m2\nP\nas a k-vector space, the dimension of V as a variety, and the Krull dimension of the co-\nordinate ring k[V ]; as noted in Lecture 13, we always have dim V = dim k[V ]. The key\n\npoint is that we now have a completely algebraic notion of smooth points. If R is any\naffine algebra, the maximal ideals m of R correspond to smooth points on a variety with\ncoordinate ring R, and we can characterize the \"smooth\" maximal ideals as those for which\ndimk m/m2 = dim R, where k = Rm/m is now the residue field of the localization of R\nat m. Smooth varieties then correspond to affine algebras R in which every maximal ideal\nis \"smooth\".\nReferences\n[1] I. R. Shafarevich, Basic algebraic geometry, 2nd edition, Springer-Verlag, 1994.\n[2] B. L. van der Waerdan, Algebra, Volume I, 7th edition, Springer, 1991.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "18.782 Arithmetic Geometry Lecture Note 18",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-782-introduction-to-arithmetic-geometry-fall-2013/bafddc611307dc47727498c8b532e1c2_MIT18_782F13_lec18.pdf",
      "content": "18.782 Introduction to Arithmetic Geometry\nFall 2013\nLecture #18\n11/07/2013\nAs usual, all the rings we consider are commutative rings with an identity element.\n18.1\nRegular local rings\nConsider a local ring R with unique maximal ideal m. The ideal m is, in particular, an\nabelian group, and it contains m2 as a normal subgroup, so we can consider the quotient\ngroup m/m2, where the group operation is addition of cosets:\n(m1 + m2) + (m2 + m2) = (m1 + m2) + m2.\nBut m is also an ideal, so it is closed under multiplication by R, and it is a maximal ideal,\nso R/m is a field (the residue field). The quotient group m/m2 has a natural structure as\nan (R/m)-vector space. Scalars are cosets r + m in the field R/m, and scalar multiplication\nis defined by\n(r + m)(m + m2) = rm + m2.\nIn practice one often doesn't write out the cosets explicitly (especially for elements of the\nresidue field), but it is important to keep the underlying definitions in mind; they are a\nvaluable compass if you ever start to feel lost.\nThe motivation for this discussion is the case where R is the local ring OP of regular\nfunctions at a point P on a variety V . In this setting m/m2 is precisely the vector space\nmP /m2\nP that is isomorphic to the TP\n∨, the dual of the tangent space at P; recall from the\nprevious lecture that P is a smooth point of V if and only if dim mP /m2\nP = dim V . We\nnow give an algebraic characterization of this situation that does not involve varieties. We\nwrite dim m/m2 to indicate the dimension of m/m2 as an (R/m)-vector space, and we write\ndim R to denote the (Krull) dimension of the ring R.\nDefinition 18.1. A Noetherian local ring R with maximal ideal m is a regular local ring if\ndim m/m2 = dim R (note that Noetherian is included in the definition of regular).1\nWe are particularly interested in regular local rings of dimension 1, these correspond to\nrings OP of regular functions at a smooth point P on a curve (a variety of dimension one).\nTheorem 18.2. A ring R is a regular local ring of dimension one if and only if it is a\ndiscrete valuation ring.\nProof. We prove the easier direction first. Let R be a discrete valuation ring (DVR) with\nmaximal ideal m = (t). Then R is a local ring, and it is certainly Noetherian, since it is a\nprincipal ideal domain (PID). Its prime ideals are (0) and (t), so it has dimension 1, and\nt + m2 generates m/m2, so dim m/m2 = 1. Thus R is a regular local ring of dimension 1.\nLet R be a regular local ring of dimension one. Its unique maximal ideal m is not equal\nto m2, since dim m/m2 = 1 > 0; in particular, m = (0) and R is not a field. Let t\nm\nm2.\nThen t+m2 generates m/m2\n∈\n-\n, since dim m/m = 1. By Corollary 18.4 of Nakayama's lemma\n(proved below), t generates m. So every x ∈R -(0) has the form x = utn, with u ∈R×\nand n ∈Z\n0 (since R is a local ring with m = (t)), and every nonzero ideal is principal,\n≥\nof the form (tn). It follows that the prime ideals in R are exactly (0) and (t), since R has\ndimension one. So R = R/(0) is an integral domain, and therefore a PID, hence a DVR.\n1More generally, a Noetherian ring is regular if all of its localizations at prime ideals are regular.\nAndrew V. Sutherland\n\nTo prove Corollary 18.4 used in the proof above we require a special case of what is\nknown as Nakayama's lemma. The statement of the lemma may seem a bit strange at first,\nbut it is surprisingly useful and has many applications.\nLemma 18.3 (Nakayama). Let R be a local ring with maximal ideal m and suppose that M\nis a finitely generated R-module with the property M = mM. Then M is the zero module.\nProof. LetPb1, . . . , bn be generators for M. By hypothesis, every bi can be written in the\nform bi =\nj aijbj with aij ∈m. In matrix form we have B = AB, where B = (b1, . . . , bn)t\nis a column vector and A = (aij) is an n × n matrix with entries in m.\nEquivalently,\n(I -A)B = 0, where I is the n × n identity matrix. The diagonal entries 1 -aii of I -A\nare units, because 1 -aii cannot lie in m (otherwise 1 ∈m, which is not the case), and\nevery element of R -m is a unit (since R is a local ring). However the off-diagonal entries\nof I -A all lie in m. Expressing the determinant d of I -A as a sum over permutations, it\nis clear that d = 1 + a for some a ∈m, hence d is a unit and I -A is invertible. But then\n(I -A)-1(I -A)B = B = 0, which means that M is the zero module.\nCorollary 18.4. Let R be a local Noetherian ring with maximal ideal m. Then t1, . . . , tn ∈m\ngenerate m if and only if their images generate m/m2 as an R/m vector space.\nProof. The \"only if\" direction is clear. Let N be the ideal (t1, . . . , tn) ⊆m. If the images\nof t1, . . . , tn in m/m2 generate m/m2 as an R/m-vector space, then we have\nN + m2 = m + m2\n(N + m2)/N = (m + m2)/N\nm(m/N) = m/N,\nwhere we have used N/N = 0 and m + m2 = m (since m2 ⊆m). By Nakayama's lemma,\nM = m/N is the zero module, so m = N and t1, . . . , tn generate m.\n18.2\nSmooth projective curves\nIt follows from Theorem 18.2 that for a smooth curve C the local rings OP = k[C]mP are\nall discrete valuation rings of k(C)/k. If C is a projective curve, then by Theorem 16.33\nit is complete, and from the proof of Theorem 16.33 we know that it satisfies Chevalley's\ncriterion: every valuation ring R of k(C)/k contains a local ring OP . The fact that OP\nis a discrete valuation ring actually forces R = OP ; this is a consequence of the following\ntheorem.\nTheorem 18.5. Let R1 and R2 be valuation rings with the same fraction field, let m1\nand m2 be their respective maximal ideals, and suppose R1 ⊊R2.\nThen m2 ⊊m1 and\ndim R2 < dim R1. In particular, R1 cannot be a discrete valuation ring.\nProof. Let x ∈R2 -R1. Then 1/x ∈R1 ⊆R2, so x is in R2\n× and therefore not in m2. We\nalso have 1/x ∈R1\n×, so 1/x lies in m1 but not in m2. Therefore m2 ⊊m1. Every prime ideal\nof R2 is contained in m2, hence in m1, and if p is prime in R2 then it is clearly prime in R1: if\nab ∈p for some a, b ∈R1 ⊆R2 then one of a, b lies in p. Thus every chain of prime ideals in\nR2 is also a chain of prime ideals in R1, and in R1 any such chain can be extended by adding\nthe prime ideal m1. Thus dim R2 < dim R1. If R1 is a DVR then dim R2 < dim R1 = 1,\nbut dim R2 ≥1, since R2 is a valuation ring (not a field), therefore R1 is not a DVR.\n\nThus we have a one-to-one correspondence between the points on a smooth projective\ncurve C and the discrete valuation rings of k(C)/k.\nTheorem 18.6. Let C be a smooth projective curve. Every rational map φ: C →V from\nC to a projective variety V is a morphism.\nProof. Let φ = (φ0 : · · · : φn) and consider any point P ∈C. Let us pick a uniformizer t\nfor the discrete valuation ring OP (a generator for the maximal ideal mP ), and let\nn = min{ordP (φ1), . . . , ordP (φn)},\nwhere ordP : k(C) →k(C)×/OP\n× ≃Z is the discrete valuation of OP . If n = 0 then φ is\nregular at P, since then all the φi are defined at P and at least one is a unit in OP\n×, hence\nnonzero at P. But in any case we have\nordP (t-nφi) = ordP (φi) -n ≥0\nfor i = 0, . . . , n, with equality for at least one value of i. It follows that\nt-nφ : · · · : t-n\nφn = (φ0 : · · · : φn)\nis regular at P.\nThis holds for every P\n\n∈C, so φ is a regular rational map, hence a\nmorphism.\nCorollary 18.7. Every rational map φ: C1 →C2 between smooth projective curves is either\nconstant or surjective.\nProof. Projective varieties are complete, so im(φ) is a subvariety of C2, and since dim C2 = 1\nthis is either a point (in which case φ is constant) or all of C2.\nCorollary 18.8. Every birational map between smooth projective curves is an isomorphism.\nIt follows from Corollary 18.8 that if a curve C1 is birationally equivalent to any smooth\nprojective curve C2, then all such C2 are isomorphic. We want to show that such a C2\nalways exists. Recall that birationally equivalent curves have isomorphic function fields.\nThus it suffices to show that every function field of dimension one actually arises as the\nfunction field of a smooth projective curve.\n18.3\nFunction fields as abstract curves\nLet F/k be a function field of dimension one, where k is an algebraically closed field. We\nknow that if F is the function field of a smooth projective curve C, then there is a one-to-one\ncorrespondence between the points of C and the discrete valuation rings of F. Our strategy\nis to define an abstract curve CF whose \"points\" correspond to the discrete valuation rings\nof F, and then show that it is actually isomorphic to a smooth projective curve.\nSo let X = XF be the set of all maximal ideals P of discrete valuation rings of F/k.\nThe elements of P ∈XF are called points (or places). Let OP,X = OP denote the valuation\nring with maximal ideal P, and let ordP denote its associated valuation. For any U ⊂X\nthe ring of regular functions on U is the ring\nOX(U) = O(U) := ∩P∈UOP = {f ∈F : ordP (f) ≥0 for all P ∈U} ⊆F,\n\nand we call O(X) the ring of regular functions (or coordinate ring) of X. Note that O(X)\nis precisely the intersection of all the valuation rings of F/k.\nFor f ∈OP we define f(P) to be the image of f in the residue field OP /P ≃k; thus\nf(P) = 0 ⇐⇒f ∈P ⇐⇒ordP (f) > 0.\nFor f ∈OX we have f(P) = 0 if and only if ordP (f) > 0. We then give X the Zariski\ntopology by taking as closed sets the zero locus of any subset of O(X).2 If F is actually the\nfunction field of a smooth projective curve, all the definitions above agree with our usual\nnotation, as we will verify shortly.\nDefinition 18.9. An abstract curve is the topological space X = XF with rings of regular\nfunctions OX,U determined by the function field F/k as above. A morphism φ: X →Y\nbetween abstract curves or projective varieties is a continuous map such that for every open\nU ⊆Y and f ∈OY (U) we have f *φ ∈OX(φ-1(U)).\nAs you will verify in the homework, if X and Y are both projective varieties this defini-\ntion of a morphism is equivalent to our earlier definition of a morphism between projective\nvarieties. The identity map X →X is obviously a morphism, and we can compose mor-\nphisms: if φ: X →Y and φ: Y →Z are morphisms, then φ *φ is continuous, and for any\nopen U ⊆Z and f ∈OZ(U) we have f *φ ∈OY (φ-1(U)), and then\nf *(φ *φ) = (f *φ) *φ ∈OX(φ-1(φ-1(U))) = OX((φ *φ)-1(U)).\nThus we have a category whose objects include both abstract curves and projective varieties.\nLet us verify that we have set things up correctly by proving that every smooth projective\ncurve is isomorphic to the abstract curve determined by its function field. This follows\nimmediately from our definitions, but it is worth unravelling them once just to be sure.\nTheorem 18.10. Let C be a smooth projective curve and let X = Xk(C) be the abstract\ncurve associated to its function field. Then C and X are isomorphic.\nProof. For the sake of clarity, let us identify the points (discrete valuation rings) of X as\nmaximal ideals mP corresponding to points P ∈C. As noted above there is a one-to-one\ncorrespondence between P ∈C and mP ∈X, we just need to show that this induces an\nisomorphism of curves. So let φ: C →X be the bijection that sends P to mP .\nFor any U ⊆C we have, by definition, OC(U) = ∩P\nand\n∈UOP,C\nOX(V ) = ∩mP\n,\n∈V OmP ,X\nso OC(U) = OX(φ(U)) In particular,\nO(C) = O(φ(C)) = O(X),\nhence the rings of regular functions of C and X are actually identical (not just in bijection).\nMoreover, for any open U ⊆X and f ∈OX(U) we have f *φ = f ∈OC(φ-1(U)), and for\nany open U ⊆C and f ∈OC,U we have f *φ-1 = f ∈OX(φ(U)).\nA set U ⊆C is closed if and only if it is the zero locus of some subset of O(C), and for\nany P ∈C, equivalently, any φ(P) ∈X, we have\nf(P) = 0 ⇐⇒ordP (f) > 0 ⇐⇒f(φ(P)) = 0,\nwhere we are using the definition of f(φ(P)) = f(mP ) for mP ∈X on the right. It follows\nthat φ is a topology isomorphism from C to X; in particular, both φ and φ-1 are continuous.\nThus φ and φ-1 are both morphisms, and φ *φ-1 and φ-1 *φ are the identity maps.\n2As we will prove in this next lecture, this is just the cofinite topology: the open sets are the empty set\nand complements of finite sets.\n\nOne last ingredient before our main result; we want to be able to construct smooth\naffine curves with a specified function field that contain a point whose local ring is equal to\na specific discrete valuation ring.\nLemma 18.11. Let R be a discrete valuation ring of a function field F/k of dimension one.\nThere exists a smooth affine curve C with k(C) = F such that R = OP for some P ∈C.\nProof. The extension F/k is finitely generated, so let α1, . . . , αn be generators, and replace\nαi with 1/αi as required so that α1, . . . , αn ∈R. Let S be the intersection of all discrete\nvaluation rings of F/k that contain the subalgebra k[α1, . . . , αn] ⊆F. Then S ⊆R is an\nintegral domain with fraction field F. The kernel of the map from the polynomial ring\nk[x1, . . . , xn] to S that sends each xi to αi is a prime ideal I for which S = k[x1, . . . , xn]/I.\nThe variety C ⊆An defined by I has coordinate ring k[C] = S ⊆R and function field\nk(C) = F, so it has dimension one and is a curve\nMoreover, the curve C is smooth; its coordinate ring S is integrally closed (it is an inter-\nsection of discrete valuation rings, each of which is integrally closed), and by Lemma 18.12\nbelow, all its local rings OP are discrete valuation rings, hence regular, and therefore every\npoint P ∈C is smooth.\nLet φ: R →R/m = k be the quotient map and consider the point P(φ(x1), . . . , φ(xn)).\nEvery f in the maximal ideal mP of OP satisfies\nφ(f) = φ(f(x1, . . . , xn)) = f(φ(x1), . . . , φ(xn)) = f(P) = 0\nand therefore lies in m. By Theorem 18.5, R = OP as desired.\nThe following lemma is a standard result of commutative algebra (so feel free to skip the\nproof on a first reading), but it is an essential result that has a reasonably straight-forward\nproof (using Theorem 18.2), so we include it here.3\nLemma 18.12. If A is an integrally closed Noetherian domain of dimension one then all\nof its localizations at nonzero prime ideals are discrete valuation rings.4\nProof. Let F be the fraction field of A and let p be a nonzero prime ideal. We first note\nthat Ap is integrally closed. Indeed, if xn + an-1xn-1 + · · · + a0 = 0 is an equation with\nai ∈Ap and x ∈F, then we may pick s ∈A -p so that all the sai lie in A (let s be the\nproduct of all the denominators ci ∈p of ai = bi/ci). Multiplying through by sn yields an\nequation (sx)n + san\n1(sx)n-1 + · · · + sna0 = 0 in y = sx with coefficients in A. Since A is\n-\nintegrally closed, y ∈A, therefore x = y/s ∈Ap as desired.\nLet m = pAp be the maximal ideal of Ap. The ring Ap has dimension one, since (0) ⊊m\nare all the prime ideals in Ap (otherwise we would have a nonzero prime q properly contained\nin m, but then q ∩A would be a nonzero prime properly contained in p, contradicting\ndim A = 1). Thus R = Ap is a local ring of dimension one. By Theorem 18.2, to show\nthat R is a DVR it suffices to prove that R is regular; it is clear that R is Noetherian\n(since A is), we just need to show dim m/m2 = dim R = 1. By Nakayama's lemma, m2 = m,\nso dim m/m2 = 0. To show dim m/m2 = 1 it suffices to prove that m is principal. To do this\nwe adapt an argument of Serre from [1, §I.1].\n3There are plenty of shorter proofs, but they tend to use facts that we have not proved.\n4Such rings are called Dedekind domains. They play an important role in number theory where they\nappear as the ring of integers of a number field. The key property of a Dedekind domain is that ideals can\nbe uniquely factored into prime ideals, although we don't use this here.\n\nLet S = {y ∈F : ym ⊆R}, and let mS denote the R-ideal generated by all products xy\nwith x ∈m and y ∈S (just like an ideal product). Then m ⊆mS ⊆R, so either mS = m\nor mS = R. We claim that the latter holds. Assuming it does, then 1 =\nxiyi for some\nxi ∈m and yi ∈S. The products xiyi all lie in R but not all can lie in m,\nP\nso some xjyj is\ninvertible. Set x = xj/(xjyj) and y = yj so that xy = 1, with x ∈m and y ∈S. We can\nthen write any z ∈m as z = 1 · z = xy · z = x · yz. But yz ∈R, since y ∈S, so every z ∈m\nactually lies in (x). Thus m = (x) is principal as desired, assuming mS = R.\nWe now prove that mS = R by supposing the contrary and deriving a contradiction. We\nwill do this by proving that mS = m implies both S ⊆R and S ⊆R. So assume mS = m.\nWe first prove S ⊆R. Since mS = m, for any λ ∈S we have λm ⊆m. The ring R is\nNo\nP etherian, so let m1, . . . , mk be generators for m. We then have k equations of the form\ni,j aijmj = λmi with aij ∈R. Thus λ is an eigenvalue of the matrix (aij) and therefore\na root of its characteristic polynomial, which is monic, with coefficients in R. Since R is\nintegrally closed, λ ∈R, and therefore S ⊆R as claimed.\nWe now prove S ⊆R, thereby obtaining a contradiction. Let x\nn\n∈m -{0}, and consider\nthe ring Tx = {y/x\n: y ∈R, n ≥0}. We claim Tx = F: if not, it contains a nonzero\nmaximal ideal q with x ∈q (since x is a unit in Tx), so q ∩R = m, and clearly q ∩R = (0),\nbut then q∩R is a prime ideal of R strictly between (0) and m, which contradicts dim R = 1.\nSo every element of T = F can be written in the form y/xn\nx\n, and this holds for any x ∈m.\nApplying this to a fixed 1/z with z ∈m -{0}, we see that every x ∈m\nn\n-{0} satisfies\nx\n= yz for some y ∈R and n ≥0, thus xn ∈(z) for all x ∈m and sufficiently large n.\nApplying this to our generators m1, . . . , mk for m, choose n so that mn\n1, . . . , mn\nk ∈(z), and\nthen let N = kn so that (\ni rimi)N ∈(z) for all choices of ri ∈R. Thus mn ⊆(z) for all\nn ≥N, and there is some\nP\nminimal n ≥1 for which mn ⊆(z). If n = 1 then m = (z) is\nprincipal and we are done. Otherwise, choose y ∈mn-1 so thaty ∈(z) but ym ⊆(z). Then\n(y/z)m ∈R, so y/z ∈S, but y/z ∈R (since z ∈m), so S ⊆R as claimed.\nWe are now ready to prove our main theorem.\nTheorem 18.13. Every abstract curve is isomorphic to a smooth projective curve.\nProof. Let X = XF be the abstract curve associated to the function field F/k. Then O(X)\nis an affine algebra, and there is a corresponding affine curve A. The curve A is smooth,\nsince all its local rings OP are discrete valuation rings, but it is not complete, so not every\npoint on X (each corresponding to a discrete valuation rings of F/k) corresponds to a point\non A. So let C be the projective closure of A; the curve C need not be smooth, but it is\ncomplete, and it satisfies Chevalley's criterion. Thus for each point P ∈X, the associated\ndiscrete valuation ring OP,X contains the local ring OQ,C of a point Q ∈C1. The point Q\nis certainly unique; if OP,X contained two distinct local rings it would contain the entire\nfunction field, which is not the case (to see this, note that for any distinct P, Q ∈C the\nzero locus of mP + mQ is empty).\nSo let φ: X →C map each P ∈X to the unique Q ∈C1 for which OQ,C ⊆OP,X.\nIt is easy to see that φ is continuous; indeed, since we are in dimension one it suffices to\nnote that it is surjective, and this is so: every local ring OQ,C is contained in a discrete\nvaluation ring OP,X (possibly more than one, this can happen if Q is singular).5 To check\nthat it is a morphism, if U ⊆C is open and f ∈OC(U) = ∩Q∈UOQ,C then we have\nOX(φ-1(U)) = ∩φ(P)∈UOP,X ⊇∩Q∈UOQ,C and therefore f *φ ∈OX(V ) as required.\n5This follows from Problem 2 part 5 on Problem Set 8.\n\nNow let C1 = C and φ1 = φ. There are finitely many singular points Q ∈C (the\nsingular locus has dimension 0), and for each such Q the inverse image φ-1(Q) ⊆X is\nclosed and not equal to X (since φ is surjective and C has more than one point), so finite.\nLet P2, . . . , Pn ∈X be the finite list of points whose images under φ1 are singular in C.\nFor each Pi we now let Ci be the projective closure of the smooth affine curve with\nfunction field F/k and a local ring OP,Ci equal to OPi,X, given by Lemma 18.11. Then\nk(Ci) = F and the point on Ci corresponding to Pi is smooth by construction, since its local\nring is precisely the discrete valuation ring OPi. Define a surjective morphism φi : X →Ci\nexactly as we did for φ1.\nWe now consider the product variety Y =\ni Ci and define the morphism φ: X →Y by\nφ(P) = (φ1(P), . . . , φn(P)). The variety Y is a product of projective varieties and can be\nsmoothly embedded in a single projective space.\nQ\n6 The image of φ in Y is a projective curve\nC whose function field is isomorphic to F, and C is smooth because, by construction, every\npoint P ∈C is smooth in one of its affine parts. By Theorem 18.10, the smooth projective\ncurve C is isomorphic to the abstract curve associated to its function field, namely, X.\nCorollary 18.14. Every curve C is birationally equivalent to a smooth projective curve\nthat is unique up to isomorphism.\nProof. By 18.10 there exists an abstract curve corresponding to the function field k(C),\nand by Theorem 18.13 this abstract curve is isomorphic to a smooth projective curve.\nUniqueness follows from Corollary 18.8.\nThe smooth projective curve to which a given curve C is birationally equivalent is called\nthe desingularization C. Henceforth, whenever we write down an equation for a curve (which\nmay be affine and/or have singularities) we can always assume that we are referring to its\ndesingularization.\nRemark 18.15. In the proof of Theorem 18.13 we made no attempt to control the di-\nmension of the projective space into which we embedded the smooth projective curve C\nisomorphic to our abstract curve X. Using more concrete methods, one can show that it is\nalways possible to embed C in P3. In general, one can do no better than this; indeed we\nwill see plenty of examples of smooth projective curves that cannot be embedded in P2.\nReferences\n[1] J. P. Serre, Local fields, Springer, 1979.\n6Using the Segre morphism, as proved in problem 1 part 4 on Problem Set 8.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.782 Introduction to Arithmetic Geometry\nFall 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}