{
  "course_name": "Introduction to Bioengineering (BE.010J)",
  "course_description": "Bioengineering at MIT is represented by the diverse curricula offered by most Departments in the School of Engineering. This course samples the wide variety of bioengineering options for students who plan to major in one of the undergraduate Engineering degree programs. The beginning lectures describe the science basis for bioengineering with particular emphasis on molecular cell biology and systems biology. Bioengineering faculty will then describe the bioengineering options in a particular engineering course as well as the type of research conducted by faculty in the department.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Science",
    "Biology",
    "Cell Biology",
    "Computation and Systems Biology",
    "Molecular Biology",
    "Engineering",
    "Biological Engineering",
    "Science",
    "Biology",
    "Cell Biology",
    "Computation and Systems Biology",
    "Molecular Biology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 14 sessions for 7 weeks, 1 hour / session\n\nOverview\n\nDesigned as a freshmen seminar course, faculty from various School of Engineering departments describe the research and educational opportunities specific to and offered by their departments. Background lectures by the 20.010J staff introduce students to the fundamental scientific basis for bioengineering. Specially produced videos provide additional background information that is supplemented with readings from newspaper and magazine articles.\n\nAssignments\n\nA five page paper on a bioengineering problem is due by session 13.\n\nGrading\n\nGrades are entirely based on the 5 page paper assignment.",
  "files": [
    {
      "category": "Resource",
      "title": "wang_paper_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/8b8dd9919f767256e51512147ff9e541_wang_paper_final.pdf",
      "content": "Wang\nJiao Wang\nBE.010J\nFinal Paper\nA Suitable Replacement Heart\nStatement of Problem\nFor a long time, scientists and doctors alike have been trying to engineer an efficient\nman-made heart. Today, estimates suggest that although 35,000 Americans could\nbenefit from a heart transplant, fewer than 4,000 actually place themselves on the\nwaiting list. Given that only 2,200 hearts are donated per year, many Americans spend\nmonths, years and even die before replacement organs are made available to them.\nAlthough patients who do receive replacement hearts consider themselves fortunate,\nthey cannot escape the many problems that are linked to the use of donor organs, such\nas tissue rejection, infection, and long time compatibility.\nHistorical Background\nThe quest for replacement body parts has interested the scientific community since\nancient times. In ancient Egypt, healers grafted human skin to the faces of disfigured\nwarriors to improve their appearances. Since then, the process, called transplant, has\nbeen broadly defined to refer to the transfer of any organ or tissue from one part of the\nbody to another or from one body to a different body.\nAs the importance of the human heart is increasingly recognized by the medical\ncommunity, more and more engineers are interested in its design in hopes of creating\nsuitable replacements. For the most part, their attempts have been largely unsuccessful.\nThe first artificial heart patent was filed in 1956 by Dr. Paul Winchell. The principles of\nhis model were similar to that which Dr. William Kolff of the University of Utah Medical\nSchool had been working on for some time. In 1957, Kolff transplanted a version of his\nmodel into the chest of a dog. The experiment was regarded as a failure since the\nanimal only lived for ninety minutes after the operation, yet pioneers were hopeful that\nfuture trials would yield more fruitful results.\nIn 1972, Robert K. Jarvik managed to develop out of aluminum, polyester, and plastic\nthe first human artificial heart. He named it Jarvik 3. Cows implanted with this device can\nlive up to four months with little or no medical intervention. Four years later, Jarvik\nimproved his design and created Jarvik 7, a two chambered device made of\npolyethylene with valves molded inside. Jarvik 7 ran on compressed air provided by an\nexterior air compressor connected to the artificial heart by a short, flexible tube, keeping\na calf alive for 268 days. In 1981, Jarvik 7 was approved for human implantation.\nIn 1982, the first human artificial heart was placed in the chest of Dr. Barney Clark, a 61-\nyear old Seattle dentist. Clark was dying from cardiomyopathy, an irreversible,\ndegenerative disease of the heart muscle that eventually rendered his condition so bad\nthat he was classified as a Class IV patient. He was not eligible for a heart transplant\nand would not survive if taken off a heart-lung machine following open-heart surgery. An\nartificial heart implantation was the only choice left. Thus, when his situation worsened,\nClark willingly served as the artificial heart's first human guinea pig.\n\nWang\nSurgeons William DeVries and Lyle Joyce used the two top atria chambers of Clark's\nheart to anchor Jarvik 7 in a procedure that lasted seven and a half hours. Although the\noperation prolonged his life by 112 days, Clark suffered from leaking lungs, seizures,\nand a broken valve before finally succumbing to complicated infections that resulted in\nmultiple organ failure.\nAfter Clark's surgery, the artificial heart was implanted in many other patients with\nvarying degrees of success. All patients suffered from infections and tissue rejection.\nTheir general low quality of life after surgery raised questions regarding ethics and\npatient care. In 1990, the Food and Drug Administration withdrew its approval of Jarvik-7\non the premise that the device was too crude for human use.\nCurrent Techniques\nToday, an artificial heart that can completely and permanently replace the functions of its\npredecessor without causing long-term medical complications has yet to be engineered.\nMost devices on the market prolong the lives of its consumers while they await\nreplacement human hearts.\nCompanies such as Thoratec, VentraCor, and MicroMed Technology market left\nventricular assist devices (LVAD) to ease the heart's workload. Some can be implanted\ndirectly in the aorta. Others are placed outside of the body, with input and output tubes\npassing through the chest and into the aorta. The latter type is used mostly in hospitals.\nHowever, LVAD's are ultimately hazardous to the health of its patients and are meant to\nbe removed after recovery or transplant.\nDrawbacks of Present Methods\nThe body is composed of organ systems that are innately opposed to metal, plastic, and\npolyester. In our internal aqueous environment, the development of infection due to the\npresence of a fist-sized device composed of non-biological materials is in many ways\ninevitable. If infection does not strike, blood clots form, leading to strokes and other\ncomplications. Decades of implantation have shown that the design of artificial hearts\nusing anything that is not tissue can only be so successful. In most instances, the heart\ncontinues to pump although the body is no longer viable.\nEven if the problem of tissue rejection is somehow resolved, mechanical devices are still\nultimately subject to wear and tear. Unlike living tissue, machines cannot repair\nthemselves and in the long run, cause damage to cellular elements of the heart, such as\nred blood cells.\nThe problem of a viable power source is also an interesting one. Most current models\nrequire the patient to carry an outside battery supply. In the past, there have been a few\ninstances where device malfunctions have led to complications.\nDue to the various problems discussed, artificial hearts today are mostly used as bridges\nto transplant. These devices assist in maintaining blood circulation through the body until\nreplacement organs are made available.\n\nWang\nA Possible New Approach: Genetic Engineering\nToday, engineers hope to design a heart completely out of biomaterials. In 1997, we\nmanaged to clone a sheep from udder cells through complex genetic manipulation.\nAlthough it took 277 times before scientists finally managed to produce Dolly, the\nprocess was dubbed a success and followed up by other companies, many of which\nmanaged to produce the same result with greater efficiency.\nIn the following years, we succeeded in cloning pigs, calves, and many other animals. It\nmay be possible that in the near future, we can use the process of genetic engineering\nto develop artificial organs for people.\nThe Potential of Stem Cells\nRecently, there has been a tremendous stir regarding the great potential of stem cells-\nthe premature, undifferentiated cells in the body, in the treatment of a wide range of\ndiseases, including heart disease, stroke, spinal cord injuries, and burns. Unlike the\nspecific adult cells in the body, embryonic stem cells can develop into a great variety of\ncell types, leading many to believe that they hold the answer to many medical problems.\nMuch research is currently devoted to understanding what directs stem cells to\ndifferentiate to serve different functions in the body. Researchers inject human\nembryonic stem cells into developed animals to determine if these cells can be properly\nengineered to produce the tissues and organs that we greatly need. Recently, scientists\nhave succeeded in the creation of chimeras- animals genetically engineered to possess\nhuman characteristics.\nTheir creation, as controversial as it is, gives scientists unique opportunities to watch\nhow organs develop, mature, and interact with each other in the body. For the first time,\nscientists can have as many so-called \"humanized patients\" as they care to generate.\nThe possibilities of experimentation in medicine are endless.\nThe sheep heart is approximately the same size of a human's. Dissections have shown\nthat the anatomies of the two are remarkably similar. We know that humans reject the\nblood of other animals, yet body parts have been successfully transplanted. The valves\nof calves and pigs are so routinely used in humans today that the process is no longer\nquestioned. Sheep livers remarkably close to that of humans' have already been\ndeveloped. It would just be a small step more to suggest that with the proper genetic\nengineering, the heart of sheep can be manipulated so that it is acceptable to the human\npopulation at large.\nTissue Engineering at MIT\nResearchers in the LangerLab at MIT are interested in analyzing the interaction between\nhuman embryonic stem cells and different materials, in hopes of ultimately being able to\nrepair the human heart. Initially, they used adult stem cells derived from the bone\nmarrow as their cell source. Due to its limited flexibility, they are currently pursuing the\nsame goal using human embryonic stem cells. Researchers culture and differentiate\nstem cells in vitro, target the cardiac cells in the body by applying them to an organ built\non a 3-D scaffold, and then vascularize the system. Ideally, the man-made scaffold\nwould degrade at the same rate at which new cells are produced.\n\nWang\nCurrently, cultures result in a mix of endothelial and small muscle cells. Researchers are\ntrying to maximize the amount of cells of the type that they want by understanding which\ngrowth factors are responsible for shear and stress influences.\nConclusion\nWe have come a long way since Barney Clark was wheeled into the operation\nroom on that faithful day in 1982 to receive the world's first human heart. Clark died a\npainful death, yet the dream of engineering a suitable heart that can completely replace\nthat of its predecessor lives on. In 2000, Jarvik produced a new model of his design and\nimplemented it for patient use. However, through the years, researchers have gradually\nstirred away from mechanical engineering in favor of tissue and genetic engineering as\nthe ultimate solution. Today, researchers use the stem cell lines made available by the\nNational Institute of Health and other cells lines to realize their goal.\nBibliography\n1. Bankston, John. Robert Jarvik and the First Artificial Heart. Bear, Delaware: Mitchell\nLane Publishers, 2003.\n2. Berger, Melvin. The Artificial Heart. New York, NY: Moffa Press, Inc., 1987.\n3. Jauhar, Sandeep. \"The Artificial Heart.\" N Engl J Med. Vol. 350, Issue 6 Feb. 5, 2004.\n4. Ross, Rachel. \"Rebuilding hearts: Tissue engineers are trying to grow patches to\nmake life-saving fixes on humans.\" Toronto Star 27 Sept. 2004.\n5. Thomson, Elizabeth. \"Biomedical research at MIT relies on engineering as well as\nscience, math: Engineers grow tissue that mends broken hearts.\" Tec Talk 15 Dec.\n2004.\n6. Weiss, Rick. \"Of Mice, Men and In-Between Scientists Debate Blending of Human,\nAnimal Forms.\" Washington Post 20 Nov. 2004."
    },
    {
      "category": "Resource",
      "title": "1lauffenburger.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/fb0e7645dc00a5aefbdffbb2ee1d87f0_1lauffenburger.pdf",
      "content": "BE.010 Spring 2005\nSession # 1 notes\nEngineering Science and Technology\nOutline of this session:\n-\ndiscussion of the components of engineering science and technology\n-\ncareer paths and industries for biomedical engineers\n-\ncomparison of the overlap between engineering and biology in the past and in\nthe present\nIntroduction\nProfessor of Biological Engineering and Chemical Engineering Douglas A. Lauffenburger\nis the co-director of the Division of Bioengineering and Environmental Health. Professor\nLauffenburger is interested in molecular cell bioengineering and in the computational\nmodeling of biological and physiological systems.\nEngineering Science and Technology\nThe process of engineering any product is usually composed of three parts: analysis,\nsynthesis, and design. Analysis is the study of systems in order to understand their\nfunction. Synthesis is the practical building of the systems under analysis. Both steps\ncontribute to the end goal of engineering, which usually lies in the final design of the\nproduct.\nMany of the different engineering disciplines at MIT are founded on a particular pure\nscience. Different branches of physics serve as bases for Civil Engineering, Mechanical\nEngineering, and Electrical Engineering. Similarly, different branches of chemistry serve\nas bases for Chemical Engineering, Nuclear Engineering, and Materials Science and\nEngineering. The engineering disciplines take off from a traditional science and use it to\nexplore, innovate, and finally design.\nThe quantitative engineering paradigm outlines the typical steps involved in the\nengineering of a product. It establishes a direction to pursue and a set of boundaries\nwithin which to explore. Ideas are first experimented with computational models and then\ntested in real life. The performance of individual components is evaluated and\nimprovements are made as necessary.\nThe Biology/Medicine-Engineering Landscape\nThe current disciplines at MIT of Chemical Engineering, Electrical Engineering,\nMechanical Engineering, Materials Science and Engineering, and the soon to be\nBiological Engineering are founded on the MIT general institute science requirements of\nbiology, chemistry, physics, and mathematics. Students in any of these fields are\nprovided with the necessary background to go into biology related disciplines. At one\nend of the spectrum is biotechnology, which is generally applied to diverse industries\nand to the development of health-related devices and pharmaceuticals. At the other end\n\nof the spectrum is biomedical engineering, which is generally used in the hospital\nsetting. The uses of bioengineering lie somewhere in-between the two.\nTraditional Career Areas for Biomedical Engineers\nThe work of traditional biomedical engineers actually did not require much knowledge of\nbiology. Due to many of the reasons listed and others, for a long time, biology was not\namenable to engineering analysis and synthesis design approach.\nThis slide show some examples of areas where engineers rely on the design and\nimplementation skills learned in their own disciplines to solve problems in biology. Until\nrecently, the development of imaging techniques to diagnose a particular medical\ncondition relied mostly on physics. The design of replacement body structures, the\nfabrication and fitting of artificial limbs, and the creation of devices used for repairing\nand/or replacing these body parts were founded on knowledge of mechanics and\nmaterial sciences. The processing and delivery of pharmaceuticals into biological\nsystems were based on chemistry.\nThe New Interface of Engineering and Biology\nThe genomic and molecular revolutions in biology, commonly identified by the Human\nGenome Project, has allowed us to identify all 26,000 genes in the human body and to\ndetermine many of their individual sequences. Our sequencing of amino acids in\nproteins and of bases in nucleic acids spurred the development of bioinformatics, which\nrelies on the use of computers to analyze the sequences for patterns and similarities.\nThe subsequent understanding of the information underlying the sequences resulted in\nthe creation of a comprehensive \"Parts List.\" Cellular molecular components can now be\neasily identified and manipulated.\nThese advances in the understanding of biology added much knowledge to our toolkit\nand spurred the growing interface between biology and engineering. For the first time,\nwe can look at biology from a different perspective and with a much greater attention to\ndetail. The operation of biological functions can now be understood as complex\n\"biomolecular machines.\" The regulation of biological functions can be seen as complex\n\"biomolecular circuits.\"\nThe following slides show a few of the many areas today that solicit the knowledge and\npractical skills of bio-engineers:\n1. In the past, only mechanical aspects such as flexibility, durability, and endurance to\nchanges in outside conditions were considered in the design of spacesuits. Now, bio-\nengineers incorporate knowledge of the physiology of the human body into the\nfinalization of their designs.\n2. Like the design of space suits, the design and implantation of hip implants was\npreviously solely a branch of mechanical engineering. The mechanics and movements\nof the hip were studied to produce the best metal substitute. Today, greater emphasis is\nplaced on the understanding of bone composition and tissue-implant suitability.\n3. MRI produces images of the body regardless of intervening bone by means of a\nstrong magnetic field and low-energy radio waves.\n\n4. Controlled-release drug delivery as explored in the Langer lab at MIT relies on\nknowledge of the body's enzymes and whether certain polymers/drugs would be\ndegraded by them.\n5. Image-guided surgery records surgical processes with greater detail and allows\ndoctors to consult past steps for comparison and completeness.\n6. The quest for an ideal replacement artificial heart continues to baffle the scientific\ncommunity. In the past, engineers devoted their efforts to designs based on non-\nbiological materials. They were met with repeated failure as the complex biological\nsystems of the body formed blood clots to signal rejection of foreign substances such as\nmetal, plastic, and polyester. Today, biological engineers are exploring ways to design\nhearts out of biomaterials and possibly other tissues.\n7. Bioprocessing is the method/procedure of preparing a biological material, especially a\nproduct of genetic engineering, for commercial use.\n8. An increasing emphasis is placed on environmental bioremediation to insure that all\nchemical processes must be environment friendly."
    },
    {
      "category": "Resource",
      "title": "3belcher.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/952ef436c0603e7fac9f7c5c49310276_3belcher.pdf",
      "content": "BE.010 Spring 2005\nSession # 3 notes\nEngineering Biology to Do Chemistry\nOutline of this session:\n-\ndiscussion of the use of the traditional toolkit to create new biomolecular\nmaterials\n-\ndiscussion of nano-scale and nano-strength\n-\nexploration of the bacteriophage library\nIntroduction\nAssociate Professor of Biological Engineering (BE) and Material Science and\nEngineering (DMSE) Angela Belcher is interested in the development of biological\nmechanisms and materials for the fabrication and self-assemblage of new nano-\nmatierials.\nDevelopment of Biomolecular Materials\nThe emerging field of bioengineering lies at the interface of chemistry, biology,\nmaterials science, and biotechnology. The bioengineer integrates knowledge from these\ndisparate fields in the development of new biomolecular materials.\nBiomolecular materials are designed through the use of the traditional biologist's\nand chemist's toolkits. Engineers draw from the creations of mother nature and from\ntheir previous inventions. This slide shows nature's different types of shells and the\nmaterials they are composed of. In class, we looked at some of the shells pictured and\ndiscussed how different materials, calcium carbonate and protein among them, are\ninvolved in their make-up.\nThe biologist's and chemist's toolkits, consisting of fundamental methods and\nprocedures, can be used to devise new rational designs that produce a particular\ndesired effect, identify parts that may need change, devise an algorithm or model,\namong other things. Biotechnology lies in the manipulation and engineering of biology\nand chemistry to create something useful. The question then becomes, to what extent\ncan we manipulate or evolve natural systems to suit our needs?\nWe rarely think of the world in nanometers. This slide puts in perspective just\nhow small a nanometer really is. An atom is 0.1 nm, a string of DNA is 1 nm, followed by\na Petri dish, a human thumb, a cow. The circumference of the MIT dome is 15 billion nm.\nThis slide shows the comparison of different types of cell parts, organelles, and sheets.\nEven the strongest materials in nature are derived from tiny, minute particles. The\nstrength of some of the strongest things in nature are composed on the microscopic\nscale.\n\nThis slide proposes the mechanism of protein mediated crystal growth. The top\npictures show the individual tablets of CaCO3 that make up the shell. The bottom\npictures show the protein layers in-between the protein tablets. Evolution has already\ncreated certain natural machines, such as ribosomes to produce protein.\nOur goal is to try to capture the essence of the molecular machine and build new\nmachines to make inorganic as well as organics materials.\nThe presence of molecules with or without the DNA linker can be indicative of\nwhere or not something is diseased.\nNanocircuits are built using device physics, material science, and DNA chemistry."
    },
    {
      "category": "Resource",
      "title": "4griffith.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/8ab91053b0992d47adb7701e8a5ebf85_4griffith.pdf",
      "content": "BE.010 Spring 2005\nSession #4 notes\nBioengineering at MIT\nOutline of this session:\n- overview of the new Biological Engineering (BE) undergraduate major at MIT\nnote: the following is a summary of the new SB Degree in Biological Engineering at MIT\nby the School of Engineering Biological Engineering Division\nIntroduction\nProfessor of Biological and Mechanical Engineering Linda G. Griffith is the director of the\nBiotechnology Process Engineering Center at MIT. She is interested in the applications\nof tissue engineering to replace damaged body parts, such as lost cartilage in the bone.\nSB in Biological Engineering\nThe molecular and genomic revolutions in the past decades paved the path for a greater\ndegree of overlap between two previously distinct fields. These revolutions made it\npossible for researchers to explore and develop new engineering applications to biology.\nThe new undergraduate degree program in BE at MIT was developed in response to\nthese changes. Proposed by the School of Engineering Biological Engineering Division\nand co-chaired by Linda G. Griffith and Roger D. Kamm, it is designed to be an\nextension to the PhD program in BE at MIT.\nBiological Engineering vs. Biomedical Engineering\nThe BE major stands distinct from Biomedical Engineering (BME). While BE employs\nengineering to the life sciences, particularly to biology, BME makes use of a wide range\nof engineering techniques to advance clinical medicine specifically. The emphasis on\nbiology in BME is not always stressed.\nStudents majoring in BE have a much broader view of engineering applications in\nbiology when compared with students in BME. The MIT schools of science and\nengineering are working to develop a wide range of options with which to explore\nbiological engineering, such as BME, Mechanical Engineering (course 2a), Electrical\nEngineering (course 6) with a biology related concentration, among others. These\noptions will be discussed on greater detail in future session notes.\nBiological Engineering Roadmap\nStudents with no advanced credit use year 1 to complete MIT's general institute\nrequirements (GIR's). Years 2 and 3 are spent taking a variety of courses in\nbiology (course 7), chemistry (course 5) and biological engineering. Laboratories\nsupplement classes by providing the necessary hands-on experience. Year 4 is\ndevoted to electives and a final, capstone design project.\nYear 1\n3.091/5.11x\nChemistry\n\n7.01x\nBiology I\n8.01\nPhysics I: Mechanics\n8.02\nPhysics II: Electricity and Magneticism\n18.01, 18.02\nCalculus I, II\nBE.010J\nIntroduction to Bioengineering (optional)\nYear 2\nBE.109\nLaboratory Fundamentals in Biological Engineering\nBE.110/2.772\nThermodynamics of Biomolecular Systems\nBE.180\nBiological Engineering Programming\nBE.320\nBiomolecular Kinetics and Cell Dynamics\n5.12\nOrganic Chemistry\n18.03\nDifferential Equations\nYear 3\n5.07\nBiochemistry\n7.03\nGenetics\n7.06\nCell Biology\nBE.181\nBiological Engineering Computation\nBE.310\nMolecular, Cellular, and Tissue Biomechanics\nBE.330\nFields, Forces, and Flows in Biological Systems\nYear 4\nBE.309\nBiological Engineering II: Instrumentation and Measurement\nBE.380\nCapstone Design Project\n2 BE electives\n(in Pharmacology/Toxicology, Cell and Tissue Engineering,\nSystems Biology, and/or Microbial Systems)"
    },
    {
      "category": "Resource",
      "title": "5kamm.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/8e6d04263d04a7ba6e969b05ccc94af3_5kamm.pdf",
      "content": "BE.010 Spring 2005\nSession #5 notes\nBioengineering in Mechanical Engineering\nOutline of this session:\n-\noverview of the Mechanical Engineering (ME) major and its undergraduate\nrequirements at MIT\n-\ndiscussion of the positions in industry available to Mechanical Engineers\n-\na sampling of current research activities in the department\n-\ndescription of some of the biological engineering classes at MIT\nIntroduction\nRoger D. Kamm is a professor of Mechanical Engineering and Biological Engineering at\nMIT. His current research involves biomedical fluid dynamics and solid mechanics.\nKamm describes most of his projects as \"a blend of experiment, theory and numerical\nanalysis.\" (from MIT faculty website)\nOverview of the ME Major\nThe traditional ME curriculum (course 2) consists of the core required subjects, mostly\ntaught by the ME faculty, two restricted electives, and four unrestricted electives, mostly\ntaken during the student's junior and senior years.\nThe 2a program allows more flexibility within the program by substituting some of the\nrequired ME subjects with other classes. Students in course 2a can choose between\nBiotrack and the Energy Conversion Engineering track. Shown in this slide are the\nsubstitutes made for Biotrack. As you can see, organic chemistry, biochemistry, and\nbiological engineering classes replace many of the second level ME classes.\nSome students in course 2 can easily minor in Biomedical Engineering since some of\nthe medical engineering electives overlap with the ME restricted elective requirements.\nThis spectrum shows the overlap between the school of engineering and the school of\nscience, in this case representing mostly biology and chemistry. Finally, students\nmajoring in the pure sciences such as biology are not much exposed to the school of\nengineering. The traditional ME major is founded on engineering. Course 2a brings the\nstudent in greater contact with biology and biological engineering. The proposed\nBiological Engineering (BE) major further acquaints the student with the life sciences.\nJob Opportunities for Mechanical Engineers\nThese two slides show the many ways students at MIT can be educated in\nbioengineering through choice of major and/or minor. The following slide shows industry\nopportunities for mechanical engineers with a biological engineering slant, such as 2a\nmajors in Biotrack.\nResearch Groups at MIT\n\nThis slide lists the MIT faculty in the ME department and some of the research projects\nthey are currently involved in. As you can see, mechanical engineers build useful\ndevices on a wide scale range.\nSo Lab: Cell Mechanics\nAssociate Professor of Mechanical and Biological Engineering Peter So studies cell\nmechanics using rheological and spectroscopic tools. His lab deforms the flow of matter\nand alters beads on the cell surface in order to observe its Brownian fluctuations. The\ngraphs on the right are expressed as functions of frequency.\nThe So Lab is interested in understanding tissue physiology through the use of\nfluorescent photons that are made to penetrate the brain tissue. The resulting\nfluorescent vs. non- fluorescent cells can be used to create gene and protein expression\nprofiles.\nTwo-photon endoscopy, a method for examining the interior of the body, can be used to\ndevelop non-invasive optical biopsy. The latter would result in faster diagnosis and\ntreatment, in addition to greatly reducing medical costs.\nIan Hunter: Bioinstrumentation using Nano-Technology\nProfessor of Mechanical and Biological Engineering Ian Hunter is interested in the\napplications of nanotechnology to the life sciences. This slide compares the standard 96\nwell plate to a computer image of nano-cuvette arrays fabricated in his lab. Clearly, the\nlatter's smaller size render it more efficient and portable.\nThe private biotechnology company BioTrove was founded five years ago by students in\nthe department of Mechanical Engineering at MIT who were inspired by Hunter's\nBioinstrumentation Lab. In the past, Hunter worked on the development of drug delivery\nsystem devices that allow the skin to be permeable for a certain period of time. Hunter\ndesigned the NanoWalker, a robot device that walks on the surface of its surroundings to\ntake measurements. This slide lists the functions that can be incorporated into the\nNanoWalker system. As you can see, highly orientated pyrolytic graphite is currently\nimaged with NanoWalker technology. This slide shows another fabrication of the\nBioinstrumentation lab. BioTrove is currently devoted to the development of drug\ndelivery system devices and other medical products through the\nuse of nano-scale technologies.\nThese pictures depict muscle tissue on different scales. Professor Hunter's lab made\nuse of the charged and uncharged states of Calix[4]arene bis-bithiophene to induce\nconformational changes in the molecules, resulting in its expansion and contraction. The\nmolecules were immersed in a bathing solution and attached to wires, allowing for the\nmovement of the robotic hand.\nLang Lab: Single Molecule Biomechanics\nAssistant Professor of Mechanical and Biological Engineering Mathew J. Lang is\ninterested in understanding the mechanical structure and function of proteins and\nenzymes in order to discover and develop biological motors. His lab makes use of\nfacilities such as the ones shown in this slide. These instruments allow for single\nmolecule fluorescence detection and optical trapping through the use of computers\n\nto control position and beam paths.\nIn this slide, a laser focuses down and traps a bead that has a different index of\nrefraction from the surrounding fluid. The bead is linked to a protein to test the strength\nand power this particular biological motor.\nIn this slide, an optical trap applies a known level of force to the trapped bead, which is\nattached to an actin filament. The Lang lab is interested in how different levels of force\ninfluence the degree of binding in proteins.\nGriffith Lab: Tissue Engineering\nThe Griffith Lab is interested in the development of a scaffold matrix to replace\ncancellous bone-bone with a spongy or Swiss cheese structure. Most of the elderly\ntoday with this ailment rely on grafting from another bone region to treat this ailment.\nThis slide shows a microfabricated bioreactor that can test for toxicity in liver tissue. The\ngrowth factor protein (GFP) is used to tag and identify cells. The flow media exposes the\ntoxin to liver cells. Fluorescent cells indicate the presence of toxin in solution.\nKamm Lab: Cellular and molecular biomechanics\nThis slide shows the cellular force transmission pathways in the matrix of a cell. The\nlayer between the intracellular and extracellular matrix is composed of many different\ntypes of protein. These proteins attract the cell membrane to its cytoskeleton. We will\nnow focus on the particular set of proteins in the box.\nAn external force is applied to the boxed area through the use of an electromagnet\nfocused to the sharp tip. The tip is brought to a bead and a magnetic force is applied.\nWe look at the response in the cell.\nIn the picture in this slide, the light spots indicate the presence of protein in the cell. The\ngraphs show the application of different levels of force and the resulting movement of the\ncell at different times and frequencies.\nThis slide shows a specific example of a force-induced conformational change. Focal\nadhesion targeting (FAT) is a sub-domain of focal adhesion kinase (FAK). Shown is a\nmolecular model of the domain of paxillin that binds to FAT. Using steered molecular\ndynamics (SMD), we apply a force to the molecular model and see how its conformation\nchanges.\nThis slide shows the stiffness properties of actin filaments in the cytoskeleton. The\npicture at the right shows a molecular model of an actin filament monomer. Granulues\nare small molecules found in neutrophils that later channel in the microfluidic device\nshown. The motion of the granulues is monitored. Brownian motion significantly\ndecreases when the cell is immersed in a stiff matrix.\nThe Kamm lab is interested in the systematic modeling of the cytoskeleton. They are\nconstructing a computational model that mimicks the behavior of the cytoskeleton. If the\ncytoskeleton is deformed, it may rupture the actin filaments and the cross-linking\nproteins between the filaments."
    },
    {
      "category": "Resource",
      "title": "6voldman.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/d03c438e1092b5d14a807950fd837ba7_6voldman.pdf",
      "content": "BE.010 Spring 2005\nSession #6 notes\nBioengineering Activities in EECS: Electrical Engineering\nOutline of this session:\n- description of biology related coursework taken by electrical engineering students\n- overview of the biological engineering research in the electrical engineering department\nIntroduction\nAssistant Professor of Electrical Engineering and Computer Science (EECS) Joel\nVoldman is interested in the integration of biology and engineering in the development of\nsmall scale devices such as biological micro-electromechanical systems (MEMS). His\nresearch focuses on improving information storage and transfer at the cellular level.\nFaculty in Electrical Engineering (EE) with Interest in Bioengineering\nThe EECS department (Course 6) at MIT is biology friendly. Approximately 25% of the\ndepartment is involved in some type of biology related research that makes use of\napplied electrical engineering. The following slides outline the research areas of these\nfaculty members.\nBio-Electrical Engineering on Course 6\nCourse 6 students interested in biology take the same four core courses as traditional\nEECS students. They are listed below:\n6.001 Structure and Interpretation of Computer Programs\n6.002 Circuits and Electronics\n6.003 Signals and Systems\n6.004 Computation Structures\n18.03 Differential Equations\nIn addition, they may choose a biology-oriented concentration and choose to take\nadditional classes such as:\n6.021J Quantitative Physiology: Cells and Tissues\n6.022J Quantitative Physiology: Organ Transport Systems\n6.023J Fields, Forces, and Flows in Biological Systems\n6.121J Bioelectronics Project Laboratory\nFreeman: Hearing Research\nAssociate Professor of EECS Dennis M. Freeman is interested in the study of how the\nmotion of hair cells is translated into hearing in the tectoral membrane. In this slide, the\nleftmost picture is a cartoon of moving hair cells. The right images are projections of the\nmovement of hairs at different heights above the surface of the membrane.\nFreeman also studies the mechanical properties of hair cells by tracking the movement\nof magnetic beads on the surface of the membrane when exposed to electromagnets on\neither side. In this slide, a probe pulls on the membrane to determine the stiffness of the\n\ncell.\nOppenheim: Signal Processing\nProfessor of EECS Alan V. Oppenheim is primarily interested in the applications of\nsignal processing to biological systems. In this slide, each dot represents a different\nprotein present in yeast and the lines indicate protein-protein interactions. Oppenheim is\ninterested in the modeling of how these protein functions are encoded at the network\nlevel. This graph plots the global properties of damage-recovery proteins. On the x-axis,\nthe protein degree (z) indicates the number of connections present. On the y-axis, p(z)\nindicates the percentage of the protein that has connections (i.e. the degree of\nimportance of the protein). It is the essential proteins that have the most connections.\nWhite: Computational and Systems Biology\nProfessor of EECS Jacob White is the associate director of the Research Laboratory of\nElectronics (RLE). He is interested in the use of computational methods to solve real-life\nproblems in areas such as electrical-biological engineering and optimal drug delivery.\nHis research on integrated circuit design led to the development of \"fast solver\"\nalgorithms for 3-D electromagnetic, electromechanical, and fluid flow analysis. These\nalgorithms can be developed into simple models.\nFujimoto: Laser Technology and its Application to Biomedical Optical\nImaging\nProfessor of EECS James G. Fujimoto, principal investigator in the Optics and Quantum\nElectronics Group of the Research Laboratory of Electronics, is interested in laser optics\nand in the development of low cost and high resolution laser technology. He uses strobe\nphotography, like the one shown on the right, and femtosecond optics to measure the\nrate of high speed processes. This slide shows a lab equipped with femtosecond pulse\ngeneration devices with a time scale of 10^-15, devices that can supposedly \"freeze\ntime.\"\nOptical coherence tomography (OCT) is an imaging technique used to obtain high-\nresolution cross-sectional images of the retina. Unlike sonar and ultrasound techniques,\nwhich make use of sound waves, OCT employs light through the use of high resolution\nlasers. This slide shows a cross section of the retina tissue. A portion of the incoming\nlight wave on the left is transmitted through the tissue and the rest is reflected back into\nthe environment. The diagram on the left shows the degree of penetration of the\nincoming light wave.\nThis slide shows two different views of the eye. Current OCT techniques combined with\nultra-high resolution (UHR) allows for finer images and allows for earlier detection and\ntreatment of diseases.\nVoldman: Microtechnology to Measure and Manipulate Cells\nAssistant Professor of EECS Joel Voldman uses electric fields and microfluidics to study\nhow cells behave in defined environments. The dielectrophoretic (DEP) trap shown in\nthis slide makes use of positive and negative charges to generate electric dipoles and\nmove particles around in a given cell. This DEP trap, designed at MIT, consists of four\ngold posts with alternating positive and negative ends. The opposing charges push\nparticles in certain directions. Different electroconfigurations create different traps. The\n\nscreening cytometer manipulates, traps, images and sorts cells (i.e. based on\nmutagenicity).\nThe Voldman lab is also interested in the fabrication of microscale devices which can\ncreate different conditions to grow and study cells. Its design makes use of a\ncombination of physics and chemical engineering modeling and transport. In the picture\non the right, the attached tubes allow for the inflow of material. The device can be easily\nmodeled through the use of fluid-flow resistors.\nWyatt: Vision Research\nProfessor of EECS John L. Wyatt is interested in the use of electric fields and\nsemiconductor devices to function as optical/electrical transducers. The retina of the eye\ntakes in an incoming light wave and turns it into an electrical signal. Wyatt's research\nfocuses on the correction of certain damaged parts of the retina. In this slide, the chip on\nthe right is inserted into the eye with the tools shown. This is an image of how surgery\nwould be done. The chip stimulates different electrodes in the retina and supposedly\ninduces sight. As of now, this research is still at its beginning stages. Patients are able to\nmake out certain images, but are not endowed with full sight.\nGrodzinsky: Cartilage Tissue Engineering\nProfessor of electrical, mechanical, and bioengineering Alan Grodzinsky is interested in\nthe mechanics associated with tissue function and in the design of suitable replacement\nbone cartilage. A set of proteins in the cartilage give it its stiffness and at the same time\nprevent adjacent bones from rubbing against each other. Electric fields in the body\ncreate the interactions between proteins in cartilage.\nCollagen is a structural protein that prevents tension and shear in the body. It\nstrengthens tendons, supports the skin, and connects tissue to the skeleton. This slide\nshows different scaled images of collagen, which is composed of three chains wound\ntogether in a triple helix.\nAggrecan is a proteoglycan that makes up 10% of the dry weight of cartilage, at least\n75% more of which is water. An aggrecan monomer consists of a protein backbone with\nnegatively charged side chains that repel each other. Over 100 individual monomer\naggrecans at a time bind to hyaluronic acid (HA) to form aggregates. These aggregates\nalso have side chains. Mechanical wear and tear contributes to the loss of the negatively\ncharged glycosaminoglycan (GAG) chains and causes the degeneration of aggrecan.\nAtomic force microscopy is used to detect the aggrecan on a plate of mica stone. In this\nslide, the red stain is for GAG. Its gradual loss leads to osteoarthritis.\nMechanotransduction is the process by which cells convert outside stimuli into\nbiochemical signals. This diagram indicates how different forces affect how the cell\nbehaves. In this slide, a load cell is placed in an incubator. The load cell applies a known\nload and pressure to the cartilage cells and subsequent cell behavior is observed. In\nexperiments, it is found that a dynamic compression, one that is changing with respect to\ntime, stimulates the most synthesis of replacement cartilage.\nNegatively charged GAG molecules are placed on the tip of the molecular force probe.\nThese like charged molecules repel each other. As the distance decreases, the force of\nrepulsion increases. The addition of positively charged Na allows two molecules to get\ncloser together before they begin to repel."
    },
    {
      "category": "Resource",
      "title": "8doyle.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/b4519a577bfe67a3575827d72a2e5817_8doyle.pdf",
      "content": "BE.010 Spring 2005\nSession #8 notes\nBioengineering Research in Chemical Engineering\nOutline of this session:\n-\ndefinition of Chemical Engineering (ChE) and an overview of its undergraduate\nrequirements at MIT\n-\ndiscussion of ChE starting salaries and of the place ChE holds among other\ndisciplines\n-\noverview of ChE research groups at MIT\nIntroduction\nPatrick S. Doyle is a Charles & Roddey Assistant Professor in Chemical Engineering at\nMIT. His current research in the dynamics of polymers and complex fluids under the\ninfluence of forces and fields lies at the interface of biophysics, polymer physics, and\ntransport phenomena.\nWhat is Chemical Engineering?\nThe American Institute of Chemical Engineers (AIChE), founded in 1908, is a\nprofessional organization that encourages undergraduate student activities and\nparticipation around the country and works to help students in the field to further their\ncareers. The AIChE at MIT takes part in departmental decision making and offers\nsessions on the graduate school application process and on how to find jobs. This slide\nstates the AIChE definition of ChE.\nThis is a fermentation-based process flow sheet for a particular biological product. As\nyou can see, many different steps are involved. One must understand how each step\nfunctions separately and in relation to the rest of the process.\nOverview of the Chemical Engineering and Chemical-Biological\nEngineering Majors\nBoth the Chemical Engineering curriculum (course 10) and the Chemical-Biological\nEngineering curriculum (course 10B) are built on the MIT general institute science\nrequirements of chemistry, biology, physics, and single and multi-variable calculus. Upon\nthe fundamental sciences, the chemical engineering curriculum adds the classes listed\nbelow, most of which are taken during the student's sophomore and junior years:\n5.60 Thermodynamics and Kinetics\n7.03 Genetics\n7.05 General Biochemistry\n7.06 Cell Biology\n\n10.10 Introduction to Chemical Engineering\n10.213 Chemical Engineering Thermodynamics\n10.28 Biological Engineering Laboratory\n10.29 Biological Engineering Projects Laboratory\n10.301 Fluid Mechanics\n10.302 Transport Processes\n10.702 Introductory Experimental Biology and Communication\nThe 10B curriculum exchanges some of the traditional ChE classes for ones that are\nmore biology based. Students are free to switch between the two tracks up to the end of\ntheir sophomore year. During senior year, students in both tracks take four capstone\nprocess chemical/biological engineering classes.\nThese are some examples of projects undertaken by students in 10.28, the Biological\nEngineering Laboratory during their junior year.\nThe 10B curriculum at MIT satisfies most of the Premed requirements. Students in 10B\ncan obtain a Biomedical Engineering minor degree by choosing to take two additional\nclasses from the core subject selections. Students can obtain an additional major in\nbiology by taking three additional classes.\nChE in Relation to Other Fields\nChemical engineering, like biological engineering, lies at the interface of many fields. In\nrecent decades, the molecular sciences have gradually overlapped more and more with\ntraditional engineering disciplines, resulting in greater needs for interdisciplinary work.\nThis Venn diagram categorizes the research areas of the various faculty in the ChE\ndepartment. As you can see, chemical engineering is a product of the integration of the\nchemical, biological and physical aspects of the world.\nThe following slides show the present and potential contributions of chemical engineers\nto biological engineering.\nLanger Lab: Novel Approaches to Drug Delivery\nChemical and Biomedical Professor Robert S. Langer is most well-known for his work in\nthe development of new drug delivery techniques that allow for the release of large\nmolecules into the body at a steady manner. Langer, MIT's newest Institute professor,\ngives credit to risk taking and non-conventionality as two traits that helped to further his\nown career. This slide shows present uses of biomaterials in medicine. As you can see,\npolymers traditionally unassociated with medicine now have medical uses.\n\nThese two slides show two different types of erosion. Bulk erosion leads to burst drug\nrelease which can be fatal for potent drugs, in addition to being harmful to the patient\nreceiving the medication. Surface erosion, on the other hand, leads to a much smoother\ndelivery. Increasingly, polyanhydride biodegradable polymers have been used to treat\ncancer patients. The degradation of these block polymers, which can be adjusted by\nvarying the ratio of X to Y, resemble surface erosion in that the matrixes degrade at a\nsteady rate and that the block polymer themselves degrade as they release the drug.\nThis graph shows the percentage degradation of different block polymers. The numbers\n0, 15, 55, 79 represent polymers with different chemical compositions. Block polymers\n79, 15 and 0 all steadily degrade during the given time interval, but at different rates. 55\ndegrades unsteadily, proceeding faster in the beginning and slowing down as time\npasses.\nThe World Health Organization (WHO) classifies Glioblastoma multiforme (GBM) as the\nmost common primary brain tumor in adults around the world. Most of these tumors\nquickly become malignant, leading to a uniformly fatal disease with an untreated, median\nlife expectancy of four weeks. Death results from tumor enlargement and its pressure\neffects on the brain. Most patients die before the tumor metastasizes in another part of\nthe body.\nBCNU/BiCNU is the trade name for 1,3-bis(2-chloroethyl)-1-nitrosourea, which by itself\nis very lethal. The drug, when coated with a polymer, is commonly used in\nchemotherapy to stop the growth of cancer cells, particularly those in the brain. It is\nadministrated through an injection into the vein over a period of one to two hours. A\nperson's appropriate dosage is dependent on body weight and prior food intake.\nIn 1980, the therapy proposed to combat GBM focused on the development of a novel\napproach in getting BCNU-polymers into the body. With a half life in vivo of 12 minutes,\nBCNU is susceptible to attack and degradation by the body's enzymes and cannot\nsurvive for prolonged periods by itself. Langer worked on the development of a novel\npolymer to protect BCNU in its journey, to prolong the effects of the drug, and to allow it\nto be delivered in a periodic manner.\nAs with all novel approaches, the idea was met with a lot of resistance. Even as each\nobjection listed was overturned through the years, more were generated to take its place.\nThese are pictures of the final product. These polymer wafers can be administrated\ndirectly at the site of the brain tumor. Delivery is made exactly to where it is needed,\ngetting rid of other unnecessary complications. This innovation marked the beginning of\npioneering work in local chemotherapy.\nThe survival statistics on this slide show that the lifespan of patients treated with the\ndrug is considerably longer than that of the control.\nTrout Group: Stabilization of Proteins\nThe Trout group, led by Associate Professor of Chemical Engineering Bernhardt L. Trout,\nis currently involved in the stabilization of therapeutic proteins for medical use. The many\nmotivations of the project lie not only in the financial rewards of the industry but also in\n\nthe vast potential uses of the discovery. The current approach, based mainly on the\nexperimentation and evaluation that comes along with trial and error, is not very efficient.\nThe Trout group chose to use physics to describe protein interactions and then to use\nthat understanding in the design of new stabilization approaches.\nCurrently, arginine, one of the twenty essential amino acids, is used to prevent\naggregation and to promote proper refolding in the body. The goal is to study the\nreaction mechanics of arginine in order to understand how it works in the body and then\nto design new additives which are much more effective.\nJensen Group: Microfluidic Devices for Biological Analysis\nProfessor of Chemical Engineering and Material Science and Engineering Klavs F.\nJensen designs microfluidic devices to increase the efficiency and effectiveness of\nlaboratory processes.\nThese are some examples of the current microfabrications and microelectronic\nmechanical systems (MEMS). The first two chips are products of the Jensen lab. The\nlast two are products of Caliper Tech. Co. The usefulness of the chip lies in its ability to\nintegrate many different processes together into a chain reaction which can be carried\nout in a device. The chip is put into a machine, which functions much like an ATM\nreceiving a card. The entire process is automated.\nThis is an outline of a typical system approach, which may take the lab technician much\ntime to perform. Here are a summary of the processes:\n1. Cells are cultured\n2. Cells are sorted based on fluorescence characteristics\n3. Cells are lysed- exploded, broken open\n4. Inner contents (organelles) are further separated\n5. Organelles are lysed\n6. Proteins in the organelles are separated\n7. Certain proteins are detected\nThe circled step, step 4, is discussed in detail.\nIsoelectric focusing operates based on the presence of an electric field and a pH\ngradient. Depending on their pH, many molecules, especially proteins, can be positively\nor negatively charged. In this example, let the red and blue dots represent arbitrary\norganelles. The red dot is positioned below its IpH. Thus, it accelerates toward the\ncathode. Additional red dots would accelerate in the same direction and eventually form\na vertical stream. The blue dot is positioned above its IpH. It accelerates in the opposite\ndirection. Separation is made possible by a flow field perpendicular to the force field. In\n\nthe final device, particles are continually fed from the bottom and separated out at the\ntop. This slide shows a detailed mathematical modeling of the system, describing how\ndifferent variables in the conservation and transport equations vary in time and space.\nThis computer simulation with the field lines aligned parallel to the plates A, B, and C\nresulted in well-defined focusing of the mitochondria and serves as a proof of principles.\nThis is a cartoon layout of the actual device. The electric contact pad connects the\nbattery to the external world. Ohmic heating due to resistance is disregarded. This slide\nshows the movement of different particles to separate exits. The result of an actual\nexperiment is shown here.\nDoyle Group: Magnetosensitive Self-Organizing Arrays for DNA Separation\nThe traditional method of gel electrophoresis is replaced by DNA electrophoresis in the\nseparation of large DNA molecules.\nSuperparamagnetic beads are created to serve as a custom obstacle course that allows\nsome molecules to pass through while blocking others. The magnets orient themselves\nhead to tail in the direction of the field. When the magnetic field is on, the beads are\nrelatively ordered. The different chemistries on the outside of the beads cause the\nselective permeability of different molecules. As statistics show, the method pursued by\nthe Doyle Group is much less time consuming.\nThis last slide shows the movement of a single molecule through the presence of an\nelectric field. There is an obstacle at the beginning of the path. The disentanglement\ntime of the molecule depends on its chain size."
    },
    {
      "category": "Resource",
      "title": "9polz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/72824e50b5c6f484b9158041c6517ea5_9polz.pdf",
      "content": "BE.010 Spring 2005\nSession #9 notes\nBioengineering Opportunities in Civil and Environmental\nEngineering\nOutline of this session:\n-\noverview of the Civil and Environmental Engineering (CEE) major and its\nundergraduate requirements at MIT\n-\ndiscussion of various techniques used in genomics to understand environmental\nmicrobiology\n-\noverview of some of the biological CEE research groups at MIT\nIntroduction\nMartin Polz is an associate professor of Civil and Environment Engineering at MIT who\nspecializes in environmental microbiology, microbial community structure, population\ndynamics, environmental genomics, and the ecology of pathogens.\nOverview of the CEE Major\nThe CEE department (Course 1) emphasizes the combination of mechanics, ecology,\nand mathematics in design. Classes teach students to apply learned knowledge in the\ncreation of practical solutions to common problems.\nAt MIT, all students must complete the freshman general institute requirements (GIR):\n8.01\nPhysics: Mechanics\n8.02\nPhysics: Electricity and Magnetism\n3.091/5.111/5.112 Chemistry\n7.01x\nBiology\nalong with eight humanities, arts, and social sciences (HASS) classes. The typical class\nrequires twelve hours per week and is allotted twelve units.\nThe CEE program begins sophomore year with fundamental engineering classes:\n18.03\nDifferential Equations\n1.00\nIntro. to Computers and Engineering Problem Solving\n1.010\nUncertainty in Engineering\nAt the end of sophomore year, students can choose between the environmental or the\ncivil engineering track. The environmental track teaches biology and chemistry while the\ncivil track focuses on computation and analysis of structures. Both tracks require its both\nunrestricted electives and culminate in a capping design project at the end of senior year.\nThese are some examples of common engineering design projects untaken during\nsophomore year. All projects emphasize team work, and the application of learned\nknowledge to solve practical problems in real life.\n\nEnvironmental Microbiology\nWithout the presence of bacteria and other micro-organisms, there would be no life on\nearth. An every-day process as simple as the nitrogen cycle would not be possible\nwithout microbes.\nProkaryotic organisms such as bacteria are present everywhere in the world. The\nfollowing slide shows the abundance of prokaryotic life in different types of water. The\nmicrobial biomass rivals plant biomass, but the former has much higher turnover.\nEstimations of the diversity of prokaryotes have changed over the years. In 1988, Wilson\nbelieved that prokaryotes compose of approximately 3,500 of the total 1.4 million\nspecies on earth. In 1995, Hammond estimated that prokaryotes compose of 10 million\nof the total 11 million species. We now believe that the majority of diversity of life comes\nfrom prokaryotes. Moreover, the bulk of this diversity cannot be cultivated in the\nlaboratory. In the example given of coastal and open ocean bacterioplankton, only two of\nthe many species are cultured representatives.\nThe Role of Genomics\nIn the tree of life, the tip of each branch represents an organism. Polymerase chain\nreaction (PCR) techniques can be used to measure prokaryotic biodiversity. Gene\nanalysis, used to trace relations between different species has shown that multi-cellular\norganisms have evolved relatively late in biological evolution.\nIn the universal phylogeny of culturable and unculturable bacteria, the place where the\ncurve reaches an asymptote denotes where species begin to proliferate. The\nunderstanding of gene diversity through methods such as PCR can be extrapolated to\nunderstand organismal diversity and community organization.\nBiological CEE Research Groups at MIT\nBuilding 48, the Parsons Laboratory building, is a part of the CEE department and\nhouses much of the environmental biology research groups at MIT. Much of the\nbiological research in CEE is currently involved in the genome sequencing of single\nmicro-organisms in order to understand their roles in community ecosystems. The\nfollowing slides describe the works of individual laboratories.\nAssociate professor of CEE Martin F. Polz is exploring the structure-function\nrelationships in microbial communities of coastal oceans. Through the use of\nevolutionary relationships and comparative genomics, his lab is building model systems\nof bacterial communities. These models will then be used to predict individual\ninteractions in micro-diverse communities.\n\nLee & Geraldine Martin Professor of Environmental Studies Penny Chisholm's lab is\ncurrently sequencing the entire genome of a minimal phototroph called Prochlorococcus.\nHer research focuses on use of these gene sequences to understand the microbial\necology of the ocean and the role of phytoplankton in general in the global carbon cycle.\nProfessor of Civil and Environmental Engineering and of Biological Engineering Edward\nDeLong is currently analyzing the genomes of uncultured communities. His lab extracts\nthe genes of single microbes and translates them into \"environmental libraries,\" where\nthey are analyzed for possible potential uses in developing biotechnologies.\nIn the water, the nutrients that are crucial to sustain life are consumed the fastest and\nnot evenly distributed. Marine snow, broadly defined as consisting of all kinds of primary\norganic particles, is generally white and rains down from the ocean. Bacteria depend on\nit for food and in the process leave behind a trail of nutrient-rich water, which serve as\nfood for other animals. The colonization of the marine snow by micro-organisms and the\neventual consumption of the bacteria by other animals mark the transfer of carbon from\none species to the next. Professor of Applied Mathematics Roman Stocker is interested\nin developing mathematical models of the chemical profile of the ocean as described\nabove."
    },
    {
      "category": "Resource",
      "title": "10gifford.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-010j-introduction-to-bioengineering-be-010j-spring-2006/3942492eb606c6448082cffb33434ca4_10gifford.pdf",
      "content": "BE.010 Spring 2005\nSession #10 notes\nBioengineering Applications in Computer Science\nOutline of this session:\n- definition of machine learning and of its relevance to computational genomics research\nIntroduction\nProfessor of EECS David K. Gifford is the head of the Computer Genomics Group and a\nmember of the Computer Science and Artificial Intelligence Laboratory (CSAIL) at MIT.\nMachine Learning\nMachine learning is the process by which a machine uses a sample training set to learn\nand then to generalize the data that it receives based on experience. Let us take\nhandwriting analysis as an example. Machine learning would involve the development of\na computer algorithm to recognize and interpret a person's handwriting based on a\nparticular sample set. Although this can be done with relative ease in the human brain,\nthis form of artificial intelligence is very difficult to program in computers.\nOne solution to the problem would be the memorization of large amounts of training data\nin hopes that all possible combinations of letters are covered. However, this method is\nnot very effective due to the limited memory space of all machines. The goal of any type\nof machine learning is to get beyond the mere data and to draw general conclusions.\nExpression Profiling Using DNA Microarray Technology\nRecently, the emergence of many technologies that allow for the study of organisms at a\ngenomic level has led to the demand for an efficient way to process the enormous\namount of information that is retrieved from expression profiling. The goal is to create\nreasonably accurate models of genes in order to generalize their individual levels of\nexpression.\nMicroarray technology makes use of data generated by genome projects to understand\nwhat types of genes are expressed in a particular cell in the organism at a particular time\nand under the influence of certain conditions. A microarray consists of a glass slide\nabout one inch or less onto which DNA molecules are attached at fixed locations. A\nparticular microarray may contain tens of thousands of such spots. Different gene\nexpression levels can be measured by comparing cells exposed to different conditions.\nMicroarray technology uses fluorescent dyes to indicate the presence of messenger\nRNA. Experiments generate colored images which are then submitted for analysis.\nBased on fluorescence intensities and colors of each individual spot, the expression\nlevels of particular genes can be determined through the use of image analysis software.\nAll images must be properly scaled to make different arrays comparable.\nGifford Lab: Computational Genomics\n\nThe Gifford lab is currently developing computational algorithms to analyze the results of\nmicroarray research. Their goal is to develop a 3-D model of cellular activities and\nfunction based on different levels of gene expression.\nProfessor Gifford's lab is currently collaborating with Professor of Biology Richard A.\nYoung's lab at the Whitehead Institute of Biomedical Research to develop a Genetic\nRegulatory Modules (GRAM) algorithm that can identify collections of genes that share\ncommon regulators and thus common expression profiles. GRAM combines the\ninformation from the microarray experiments previously discussed with protein-binding\ndata to create genome-wide regulatory networks that describe cellular function.\n(MIT faculty website- www.psrg.lcs.mit.edu/people/gifford.html)\nThere are between 1,000 and 1,200 regulators in the human body. At the experimental\nlevel, yeast cells are exposed to various stressful conditions such as acid, heat, high/low\nperoxide to determine which regulators would bind to a particular protein. We determine\nthe nucleic acid fragments that are bound to the protein and thus use the genome to\nfigure out which regulators are binding.\nCurrent Drawbacks\nThe problems of the GRAM algorithm are similar that of machine learning in handwriting\nanalysis described earlier. Currently, the GRAM algorithm must try every single one of\nthe 3x10^9 base pairs in the human genome to determine which one best matches the\nlikelihood of the data. The correlation between a particular combination of transcriptional\nregulators to genes expressed must be very strong in order to be valid. Thus, the\nalgorithm is repeated many times to detect genes with increasingly greater links to\nparticular regulatory gene combinations."
    }
  ]
}