{
  "course_name": "Introduction to Psychology",
  "course_description": "This course surveys questions about human behavior and mental life ranging from how you see to why you fall in love. The great controversies: nature and nurture, free will, consciousness, human differences, self and society. Students are exposed to the range of theoretical perspectives including biological, evolutionary, cognitive, and psychoanalytic. One of the best aspects of Psychology is that you are the subject matter. This makes it possible to do many demonstrations in lecture that allow you to experience the topic under study. Lectures work in tandem with the textbook. The course breaks into small recitations sections to allow discussion, oral presentations, and individual contact with instructors.",
  "topics": [
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology",
    "Science",
    "Cognitive Science",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Textbook\n\nGleitman, Henry, Alan J. Fridlund, and Daniel Reisberg.\nPsychology\n. 6th ed. New York, NY: Norton, 2004. ISBN: 0393977676.\n\nAbout This Course\n\n\"Psychology is the study of human behavior and human mental life.\" That is the first line (or a close approximation of the first line) of most Introductory Psychology texts. That line describes an immense territory that includes single cells in the brain, your memories of childhood, the motivations of terrorists, and the nature of dreams...for starters. This course is an introduction. We can't hope to exhaust the topic but we can show you the lay of the land and invite you to continue exploring when the course is done.\n\nThe Text\n\nI picked the Gleitman et al. Psychology text because it has been the best written, most intelligent of the texts on the market for many years. The book has many pages. Students who discover this fact the day before the exam are usually unhappy. The text is most useful when read in small quantities over the course of the term. This year, I have provided handouts with some questions and notes to help you to focus on the points that I consider most important.\n\nPlease Note: We expect you to have done the reading by the date listed on the syllabus. More precisely, we assume that you will show up in recitation having done the assigned reading. Thus, if Chapter 3 is assigned for session 2, you can be quizzed on it on next day. Timing is bit less stringent for a chapter that is assigned for a Thursday. Since all recitation fall between the Tuesday and Thursday lectures, you have the weekend to read the chapter.\n\nFAQ: The book is out in its 6th edition. Can you use the 5th that you found cheap somewhere?\n\nAnswer: Yes but don't fuss if some factoid on the exam turns out to be in the 6th but not the 5th. It is your choice but there is a risk.\n\nThe Lectures\n\nLectures are scheduled two days a week, each of one and a half hour duration. I think that lectures and recitations are the reason for taking the course at a place like MIT. You can read the book anywhere. You can take video lectures out of the library. I am a live person as is your TA. Ask questions and get involved. I will be happy to try to respond to raised hands during lecture. Respond to our questions. Engage with the material.\n\nThere will be a handout for most lectures. If I finish my summer project, these will be a bit more substantial than in years past but they are not intended as a substitute for attending lecture. If you miss a lecture, you should talk to a friend in the class so that you will be able to decipher the handout.\n\nFAQ: If I miss a lecture or recitation should I find the professor or TA and ask \"Did I miss anything\nimportant\n?\"\n\nAnswer: Be aware that this question, phrased in this manner, has been known to provoke sarcastic answers from faculty (\"No, we saw you were not there and realized that we could not discuss anything of substance today.\") However, it is just fine to ask if the material covered was similar to the material outlined in the handout.\n\nThe Recitation Sections\n\nThe Registrar's clever computers will put you into a recitation. They will all fall between the Tuesday and Thursday lectures. They are NOT optional. You are expected to be there. Your recitation instructor has primary responsibility for grading your work. Moreover, there are things that we can do in small groups that we cannot do in the 200-300 person lecture. Be there.\n\nThe Highly Sophisticated Grading Algorithm\n\nYou will be graded on four written assignments, a midterm, a final and some quizzes. Here is the formula that will form the basis for your grade:\n\nACTIVITIES\n\nPERCENTAGES\n\nPapers\n\n50%\n\nMidterm Exam\n\n15%\n\nFinal Exam\n\n25%\n\nOther Stuff Including Section Participation Oral Presentation, and Quizzes\n\n10%\n\nThe Writing Assignments\n\nThere are four writing assignments this year. You have some freedom in scheduling when you do them but you would be well-advised to spread the work over the term in a fairly even manner. The assignments are described in a separate handout.\n\nSome Notes about Writing\n\nLength: The desired length of these papers is given in the handouts. We are not going to sit around counting words BUT 350 words is not the same as 1000 words\neven if you use a big font\nand 2000 words is not twice as good as 1000 if we asked for 1000.\n\nCitations: Remember, if you use someone's ideas, give them credit by means of a citation (Franklin, 1776). The basic rules are a) You are not likely to get in trouble for having too many citations and b) it should be possible to track down the source of any assertion in your paper. If the source isn't you, let us know who it is. If you use someone's exact words, \"put them in quotes\" (Lincoln, 1864).\n\nRead Me!\nUse your own words:\nThis is important and, for some reason, some people don't get it. Most of the Dangerously Bad Papers in this class are cut-and-paste collages. These are papers that are made up of direct quotes or close paraphrases of your sources. Even if the citations and bibliography are flawless, this is not a good way to write. Worse, people tend to forget the citations and then this looks like plagiarism (see below). We want your OWN WORDS. Use direct quotation sparingly. Read, think, and then write. You have been warned.\n\nHonesty: Every now and then someone turns in work that is not their own. Plagiarism occurs when one person tries to take credit for the ideas or work of another. Fake data is academic fraud. Plagiarism is academic theft. We regard this very seriously. All of this is easier to detect than one might think (I could tell you some great stories). Academic dishonesty is grounds for failing the course and for referral to the Committee on Discipline.\n\nAccidental plagiarism is easy to avoid. Let's say you found some good ideas in a book. You can use those ideas in your own paper; just make sure to tell us the source. You can even use the same words (sparingly...see above.) Just make sure that they are in \"quotes\" and the source identified. We find that people do stupid things like plagiarizing when they are confused or in some last-minute panic. Try not to get into that state. Talk to us if you are having trouble with any part of the course. We feel sorry for people who come in with sad stories about how they came to plagiarize. We feel sorry, but they still fail.\n\nWriting Help: As a CI course, 9.00 has three writing tutors assigned to it to help with your papers. To request an appointment with one of the tutors, send an email at least 48 hours in advance of your desired meeting-time. Tutors can help at any stage of the writing process, but can be most helpful if you provide them with a complete rough draft. Send your draft to the tutor (as an email attachment) at least 48 hours before your scheduled meeting. In past years, students have found that using the writing tutors have helped them significantly raise their paper grade.\n\nDeadlines: Deadlines are real. The value of papers declines monotonically after the deadline. That said, I have been teaching for quite a while and I know that people will miss deadlines. A late paper is almost always worth\nsignificantly\nmore than no paper. Moreover, if you know you are going to be late, it is always better to tell me about it in advance. We hate surprises. Can you imagine what a warrior your mother would have been? Umm... speaking of surprises, that last bit was a quotation (without quotation marks...oops). It was inserted to see who actually reads the syllabus. If you found this line, tell me. First person to identify the source \"wins\".\n\nCommunication Requirement/Writing Requirement: As a HASS CI (CI-H) class, 9.00 gives freshmen and sophomores CI-H credit towards the Communication Requirement (if you pass the course!) Note that students who received grades of \"Writing Subject Required\" on the FEE will NOT receive CI-H credit for 9.00 unless they have previously completed an approved expository writing subject.\n\nAs with anything else in this class, if you are confused, stuck, lost, curious, or whatever - talk to us. Don't just guess that you have the right idea. That can be a recipe for disaster.\n\nAn Oral Presentation\n\nBecause this is a CI course, you will be making at least one oral presentation to the class. This presentation is 2 minutes long and will be on some aspect of the current assigned reading that you found interesting. Names will be drawn randomly (with no replacement - you only have to do it once) during section to choose the speakers. That means you should be in section. If you are not there and your name comes out of the hat (or whatever), your grade could be affected.\n\nThe Exams\n\nThe course will have a midterm (1 hour) two days after session 11 and a final (3 hours) during finals week. Exams are closed-book (and slightly strange). Note: Please don't schedule your flight home until you know the dates of your exams.\n\nQuizzes\n\nThere might be a quiz in your recitation section on any given week. It will be based on the current assigned reading. One of their functions is benignly coercive. We wish to persuade you to do some of the reading more than 24 hrs before the exam.\n\nA Final Note\n\nIt may strike you as somewhat unusual that Intro. Psych. is being taught by a Professor of Ophthalmology from the Harvard Medical School. Trust me, you are much better off having me as your Psychology Professor than as your ophthalmologist. All of my undergraduate (Princeton) and graduate (MIT) training is in Psychology. I have been teaching some version of this course at MIT since 1981. In my research life, I run the Visual Attention Lab. It is part of Brigham and Women's Hospital.",
  "files": [
    {
      "category": "Resource",
      "title": "badwriting.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/b23ffdd25e89aa0b62cb25bade8a5057_badwriting.pdf",
      "content": "Examples of Bad Writing\nWithin our society, it has been shown that there is an individual. An individual with individual thoughts\nand actions. But who determines whether or not he is correct in their choices? Are our thoughts brain\nwashed through the media with it's hellish ideas or our closet friends that try to direct us in the right\ndirection? No one may ever know what is right or wrong. So what is ethical relativism anyway? And\nwho is behind all of the madness of ethical relativism? It has been said that relativist's are believed to\nthink that relativism is true. Ethical Relativism is of a mind to say that whatever one's culture says is\nright is the right thing for him or her to do. One might conclude that the world we human beings live in\nis not without a variety of many different and diverse cultures with different cultural practices and\nhence different moralities. Studying ethics from a philosophical point of view, ethical relativist's might\nconclude that your wasting your time just like philosophers have always wasted they're time.\nThis change will allow us to better leverage our talent base in an area where developmental roles are\nunder way and strategically focuses us toward the upcoming Business System transition where\nSystems literacy and accuracy will be essential to maintain and to further improve service levels to\nour customer base going forward.\nIf the theories of science were the laws of origin how is it said that people have such strong emotions\nfrom a science experiment? Freud speaks of a child that is lost, but love created this child and God\ngave him a soul to love back. He thought religion fulfilled the gap for new adults who had no parents\nbut there seems to be a lot of children with parents that give them love, security, and their needs and\nthey still believe highly in God and the scriptures. This proves that religion does not fill the gap of a\nparent which has been lost.\nExamples of Good Writing\nIn June immense schools of small, silvery fish called capelin enter the hundreds of bays that dot the\neastern coast of Newfoundland to perform a fascinating ceremony. The males and females\nseparately approach the gravel beaches and are borne ashore in waves so laden with their bodies as\nto be virtual walls of fish. There, on the gravel, the females lay their eggs and the males fertilize them;\nthen most of the fish die. - \"The Spawning of the Capelin,\" Scientific American\n\"Colors,\" said Leigh Hunt, a 19th-century poet, \"are the smiles of Nature.\" Just how does an observer\ndistinguish one smile from another? To a great extent the answer lies in the three classes of cone-\nshaped, color-sensing cells in the retina of the eye. Each class responds differently to light reflected\nfrom a colored object, depending on whether the cells have within them red, green, or blue\npigments.\" - \"The Genes for Color Vision,\" Scientific American\nCan a machine think? Can a machine have conscious thoughts in exactly the same sense that you\nand I have? If by \"machine\" one means a physical system capable of performing certain functions\n(and what else can one mean?), then humans are machines of a special biological kind, and humans\ncan think, and so of course machines can think. And, for all we know, it might be possible to produce\na thinking machine out of different materials altogether--say, out of silicon chips or vacuum tubes. In\nrecent decades, however, the question of whether a machine can think has been given a different\ninterpretation entirely. The question that has been posed in its place is, Could a machine think just by\nvirtue of implementing a computer program? - \"Is the Brain's Mind a Computer Program?\" Scientific\nAmerican\n\nWhat makes writing bad?\nKeys to good writing\nPoints about Paper #2 Writing Assignment\nWriting Resources and Fun Pages\nExamples of real, actual bad writing - fun!\nhttp://www.bulwer-lytton.com/sticks.htm\nA nice essay on how to improve your writing\nhttp://www.developsense.com/GuidelinesForBetterWriting.html\nThis is mainly about wording and style rather than structure, but still is very apropos:\nhttp://kimberlychapman.com/essay/badwriting.html\nPrinciples of good writing\nhttp://www.dcs.qmul.ac.uk/~norman/papers/good_writing/general_.principles.html"
    },
    {
      "category": "Resource",
      "title": "paper1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/d11122b4482d2d0b7f5343ea400c603a_paper1.pdf",
      "content": "Paper One: Writing for the public\nDUE TO YOUR TA BY 9AM ON FRI, SEPT 24\nTopics: Note: You can write about a topic before you have heard the lecture on the topic\nThe Paper One topic must be drawn from the materials relating to Lectures 1-6 / Chapters 1-6\nFor this paper, you need to imagine that you are writing a science news or feature article for\npublication in the science section of the newspaper. If you want to see a model, find the New York\nTimes or the Boston Globe on any Tuesday and look at the science section.\nNOTE: The one BIG difference between your paper and a real article in the newspaper is that\nnewspaper articles do not use bibliographic citation. You do, please.\nStep 1: Convince your \"editor\"\nIf you were going to write an article for the newspaper, you would need to convince your editor that\nthis was an article that he/she might want to publish. In this case, your TA is your editor. At least ten\ndays in advance of the due date for the paper, you must give your TA a topic (just a sentence or two)\nand at least one source beyond what we give you on the server. You can probably email this but\nthat is up to your TA.\nStep 2: Fill in the background\nYou may not know much about your topic (reporters often do not). Reading broadly will help. You\ncan fish around on the web. You might do better to go to the library and look in some general\nsources like textbooks, handbooks, etc. As ever, the librarians can help. Again, this is a good reason\nto sign up for a library workshop.\nStep 3: Write an interesting and readable six-page paper.\nThe paper needs to have the following components (organization is up to you).\na. A good \"lead\": You need to draw your readers into the article. Why should they read about this\ntopic? There are lots of other articles in the paper.\nb. Background: There is no guarantee that your readers (well, your TA) will know anything about\nthis topic. Be sure to educate the reader.\nc. News: What is the news here? What specific nugget of information makes this worth space in the\npaper? NOTE: That might come from some article other than the article that got you started. You\nmight have gotten into the topic from whatever is on the website but your research might have\nuncovered The Really Interesting Stuff elsewhere.\nd. Bibliography: The listing of the works that you used."
    },
    {
      "category": "Resource",
      "title": "paper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/92f64469417309b56c0f5419ee35848c_paper2.pdf",
      "content": "Paper Two: Taking the next step\nDUE TO YOUR TA BY 9AM ON FRI, OCT 8\nPaper Two must be drawn from the materials relating to Lectures 7-16 / Chapters 8-12, & 14\nFor this paper, you goal is to identify a recent finding in the literature, come up with, and\npropose, a next step in the research program. Science is cumulative. Each finding suggests new\nquestions. A lot of the work of being a scientist lies in figuring out that next step and persuading\nsomeone to fund it.\nStep 1: A short \"letter of intent\"\nIf you were going to submit a grant proposal for research funding, you might first send a short\nnote to the granting agency (e.g. the National Science Foundation) saying \"I think I might write a\nproposal about X. What do you think?\" If they think it is lame, you can save yourself a lot of\ntime. So, pick a topic and send your TA a short note describing your plan. Do this at least ten\ndays in advance of the due date for the paper. Your TA will tell you if this seems like a\nreasonable plan.\nStep 2: Write a \"grant proposal\"\nYour paper should have the following parts (borrowed from a typical federal grant proposal\nformat).\na. Specific Aims: In one page (or less), clearly state the problem that you will be addressing\nand the goals of your proposed research. Typically, this section would start with a paragraph\nor two laying out the Big Picture (\"Depression is a major public health issue in the United\nStates....\" and so on). The section might end with a list of 3 or 4 specific goals. (\"This\nproposal has three specific aims: 1. To document the frequency of depression in the MIT\nundergraduate population. 2. To assess the possible therapeutic effects of Psychology paper\ndeadlines on depression, and 3. to determine the relationship between length of Psychology\npapers and depth of depression.)\nb. Background: This will be the longest section of your paper (perhaps 4 of the 6 pages). As\nthe title suggests, you will document the background for your proposal. What is already\nknown?\nc. Proposed Research: This would be the really critical part of a real proposal but, in your\ncase, you are free to be creative and not to worry too much about things like practicality and\nbudget. What would you like to know that does not seem to be known yet? How would you\nfind out if you had the resources?\nd. Bibliography: As before, the listing of the works that you used."
    },
    {
      "category": "Resource",
      "title": "paper3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/f8177a9b50c1389252d0b3bf429e8485_paper3.pdf",
      "content": "Paper Three: Rewriting the textbook\nDUE TO YOUR TA BY 9AM ON FRI, NOV 5\nPaper Three must be drawn from the materials relating to Lectures 17-24 / Chapters 13, 15-17\nFor this paper, you goal is to draft a new piece for the Gleitman et al. textbook. The centerpiece\nof this paper will be a piece of textbook prose. Aim for a piece that would be like one of the\nsections with a reddish-brown title in the text. If that makes no sense, open to page 384 (to pick a\nrandom page). You want to write something that could be like the \"Attribution as a rational\nprocess\" section or the \"Errors in the attribution process\" section. Note that these are very\ndifferent in length. Notice that different topics require different lengths of text. Pick a topic that\nwill give you 6 manuscript (not 6 textbook) pages of material.\nYour paper should have the following parts.\na. Rationale: Why is this topic something that really should be in an introductory text?\nNOTE: In coming up with an answer to this question, you may find that you need to\nbroaden your topic. A cool experiment, no matter how cool, is likely to get a line or two\nin a textbook. The articles posted in the folders on the server are, for the most\npart, pretty specific. You will need to read enough to generate a textbook section - not a\ntextbook sentence. This section is NOT what you would put in the textbook. It is your\nshort justification for the inclusion of this topic. It might be a cover letter to the editor.\nb. The textbook bit: In writing this, pay attention to textbook style. If you introduce an\nimportant new term, you should put it in boldface and, more importantly, you should be\nsure to define it in the text. Think about level of detail. There are not a lot of\nmethodological details in the typical bit of textbook prose. Don't forget to cite your\nsources in the text. Look at the rate of citation in Gleitman. Can't have a citation on every\nline but you can have quite a few in a section.\nc. Placement: Tell us where this would go in Gleitman. Now, if your TA were a real\ntextbook editor, he/she would tell you that you can't make your book any fatter or the\nstudents will scream. So a clever version of this section will describe what will be\nremoved to make room for your brilliant piece of prose.\nd. Summary: Look at page 411 of Gleitman. Summary point #9 covers the two sections\nmentioned above from page 384. You should write the very brief summary that would go\nat the end of the chapter. What critical bits do the students have to get into their heads in\norder to pass the exam?\ne. Bibliography: As ever, the listing of the works that you used."
    },
    {
      "category": "Resource",
      "title": "paper4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/6b8d4099a8e5ffac23b066d57f5f1ac7_paper4.pdf",
      "content": "Paper Four: Revision\nDUE TO YOUR TA BY 9AM ON FRI, DEC 3\nIf you write a newspaper story, a grant proposal, or a piece of prose for a textbook, it is very\nlikely that the first draft will not be the last. Your deathless prose will go to an editor/reviewer\nwho will declare that the work is not acceptable until you do X, Y, and Z. You can moan about\nthe stupidity of your reader. However, if you want the money, the fame, or whatever, you will\nneed to make that specific person happy. It is a very useful skill.\nThis paper will be somewhat longer than the others because there will be some new material.\nHowever, it is OK if substantial chunks come from the original paper (as long as you fix those\ntypos, etc)\nStep 1: What does your TA want?\nYour TA will hand back your papers marked up with various comments and there may be a section\ncontaining clear instructions for revision. Those instructions would include\n1) One specific question about content, asking for more information.\n2) Some general comments about stylistic changes (e.g. is the organization clear? How\nis the grammar, etc?)\nIf you want to revise a paper that does not have these instructions for whatever reason, you need to\nget instruction from your TA before you revise.\nAt least ten days in advance of the due date for the paper, you must give your TA a sentence or two\ndescribing your plans for revision. Your TA must agree with the general plan.\nStep 2: Add new material\nThe revised paper must make use of at least two scholarly sources beyond what you used in the\noriginal paper. You may already have some extra sources in hand or you may need to go back to the\nreal or virtual library.\nStep 3: Write the revised paper\nHere are the requirements for this paper:\n1. Length is probably about 8 pages.\n2. In the revised paper, be sure to correct the problems that your TA identified.\n\n3. You must answer the question posed by your TA (If that looks to be impossible, talk to your\nTA and maybe the question could change.)\n4. You must also expand the paper to include material from two primary sources beyond the\nsource of the original article. This new material might answer your TA's question it might\nbolster your existing points.\nNOTE: If you want help with the revision of this paper you can talk to your TA and/or to the\nWriting Center. To request an appointment with one of the tutors, send an email at least\n48 hours in advance of your desired meeting-time. If your TA seems significantly unhappy\nwith the writing of the first version of the paper it would be A Really Good Idea to seek\nsome help. That is the purpose of an assignment that can be revised. IN FACT....You\ncan ask the writing tutors for help with any of your papers. That might be A Good Idea.\nStep 4: Write the \"cover letter\"\nAs noted above, to get your paper published or your grant funded, you must satisfy the\nreader/editor/reviewer. So, you revise the work AND, typically, you write a letter explaining your\nrevisions. The last part of this assignment is to write that letter. Describe what you have changed in\nthe revised paper. Briefly explain how you have answered the questions raised by your TA. If you\ndisagreed with a suggestion, you can say that too (with an intelligent explanation) but remember,\nhere and in your later life, that your job, in this case, is to make the reviewer/editor/TA happy.\nYour cover letter should be about a page long (unless you made lots of changes.) It does not need\nto be in a very formal style. It just needs to guide the reader and persuade the reader that you\nwere listening to the prior round of comments."
    },
    {
      "category": "Exam",
      "title": "quiz1a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/d73239cc9010fa22488cb5a631358843_quiz1a.pdf",
      "content": "Quiz 1 - Chapters 4\n\nName:\n1. In a classical conditioning experiment in which a tone is paired with meat in the\nmouth, a dog comes to salivate to the sound of the tone. The tone is called the........\na) conditioned stimulus\nb) unconditioned stimulus\nc) stimulus generalization\nd) reinforcer\n2. Pre-synaptic facilitation and long-term potentiation\na) have been demonstrated only in the marine mollusk, Aplysia\nb) involve changes in sensitivity of the pre-synaptic neuron\nc) do not show activity dependence\nd) produce a net increase in sensitivity by acting at different sites\ne) a and b\n3. Kohler suggested that a way to distinguish insightful from trial and error learning is\nthat only insightful learning would\na) generalize\nb) show transfer of training\nc) be arbitrary\nd) be accomplished by apes\ne) show belongingness\n4. Which of the following instances of human learning most clearly represents arbitrary,\nas opposed to biologically specialized or prepared learning?\na) acquisition of grammar\nb) learning to catch a ball\nc) learning the rules of chess\nd) learning to judge distance\ne) a and d\n5. Growth of dendritic spines differs from pre-synaptic facilitation of long term\npotentiation in that\na) it is the only change that really explains learning\nb) it has nothing to do with the synapse\nc) it is a structural change\nd) it is not activity dependent\ne) all of the above\nExtra Credit\nWhat is learned helplessness? Tell me in approximately 2 sentences."
    },
    {
      "category": "Exam",
      "title": "quiz1b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/ecd8791db17720648af28a4cf5f00fff_quiz1b.pdf",
      "content": "Section Quiz #1\nName: __________\n1. John Locke postulated that all knowledge comes by way of experience. This school of thought is known\nas ______________________.\n2. Kant believed that a number of aspects of perception are innate. This view has since been labeled\n_____________________.\n3. The best example of a distal stimulus would be:\n(a) the pattern of light energy hitting the retina\n(b) this paper in front of you\n(c) a far-off mountain\n(d) a hallucination\n4. Fechner's law states that the strength of a sensation increases ______ with stimulus intensity.\n(a) inversely\n(b) minimally\n(c) logarithmically\n(d) linearly\n5. Signal detection theory: if, under certain circumstances, a person's hit rate when up while his false alarm\nrate stayed the same, we could conclude that his:\n(a) bias to say \"yes\" went up\n(b) accuracy decreased\n(c) sensitivity increased\n(d) accuracy and bias both remained the same\n6. The place theory of pitch perception states that:\n(a) pitch depends on where in the environment the sound is coming from\n(b) pitch depends on where the hair cells on the basilar membrane are stimulated\n(c) pitch depends on where on the auditory nerve the sound wave affects\n(d) pitch depends on where in the auditory cortex the sound signal is processed\n7. An area near the center of the retina with virtually no rods, only cones, is known as the:\n(a) blind spot\n(b) optic nerve\n(c) optic chiasm\n(d) fovea\n8. Red and green must differ on which dimension?\n(a) hue\n(b) brightness\n(c) saturation\n(d) amplitude\n9. Which of the following is a binocular depth cue?\n(a) linear perspective\n(b) relative size\n(c) retinal disparity\n(d) motion parallax\n10. If, by some freak of nature, the optic and olfactory nerves were crossed and led to the opposite sense\norgan, the law of specific nerve energies would predict the following result:\n(a) smelling red\n(b) prosopagnosia\n(c) figure-ground confusion\n(d) normal sensations"
    },
    {
      "category": "Exam",
      "title": "quiz3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/aa3b856ee366b1706d33cf42fc5b4209_quiz3.pdf",
      "content": "Name:\n\n1. In Ainsworth's Strange Situation, infants are less distressed at their father's than their mother's\ndeparture. Which of the following would be most likely to increase the infants' distress at the\nfather's disappearance?\nA. Dress the father as a woman\nB. Distract the infant right as the father leaves\nC. Find a father who had much more contact with the infant than is the norm\nD. Find a child whose interaction with the father was normal but was abused by the mother\n2. Monkeys deprived of mothers in the first six months of life\nA. Show a temporary depression in social behavior\nB. Have abnormal social behavior, but will be successful parents\nC. Are permanently and irrevocably deficient in most domains of social behavior\nD. Have severe deficits in social behavior that can be at least partly cured\n3. Given the difficulty getting cheap airline tickets, one strategy is to make three reservations on\ndifferent airlines at the same time for one person. Consider the following three objections to this\nstrategy: (a) you know your mother and friends would disapprove of it if they knew you used this\nstrategy; (b) using this strategy would unfairly hurt the people who want the same flights; (c) you\ncould get caught and possibly fined or punished.\nAccording to Kohlberg, how would these three reasons be ordered in terms of the\ndevelopment of moral reasoning? Put the earliest stage first.\nA. a, b, c\nB. a, c, b\nC. c, b, a\nD. c, a, b\n4. Evidence for a biological predisposition to homosexuality comes from all but one of the following.\nWhich of the following is not evidence?\nA. Twin studies\nB. Male hormone level differences between male homosexual and heterosexual adults\nC. Male hormone level differences between male homosexuals and heterosexuals prenatally\nD. Differences in brain structure between male homosexuals and heterosexuals\n5. A student takes the same test of reaction time at 10:00AM on two consecutive days. She gets very\ndifferent scores each time. If this was true of many other test takers, it would suggest that this test:\nA. Is not valid\nB. Is not standardized\nC. Is not reliable\nD. Is not well-motivated by psychological theory\n6. A psychometrician examines a verbal and a spatial intelligence test and finds that the scores on\nthese two tests correlate +0.38. From this he might conclude that:\nA. Performance on both tests is partly determined by \"g\" but mostly specific factors\nB. These tests measure very different things, and there is no \"g\" component here\nC. Both of these tests are excellent measures of \"g\"\nD. These results show that \"g\" is just a statistical artifact with no real-world validity\n7. Eysenck has formed a hypothesis that all personalities can be classified on the basis of a rating on\ntwo independent scales. They are _____ and _____.\nA. Agreeableness; aggressiveness\nB. Fluidity; crystallization\nC. Shyness; anxiety\nD. Neuroticism; extroversion\n\n8. Which of the following is true of sensation seekers?\nA. They are overaroused in certain systems of their brain\nB. They have underactive norepinephrine systems in their brain\nC. They have low pain tolerance\nD. They react more to external stimuli than those are not sensation seekers\n9. Freud made a major contribution to the understanding of human nature when he suggested that the\napparent irrationality of much of human behavior was a symptom of:\nA. Hysteria\nB. Unconscious conflict\nC. Wish fulfillment\nD. Penis envy\n10. When a child begins to think of himself as if he was the parent, the ____ has begun to develop.\nA. Ego\nB. Superego\nC. Id\nD. Oedipal conflict\n11. Freud's stages of psychosexual development go in which order, from beginning to end?\nA. Oral, anal, phallic, genital\nB. Anal, oral, phallic, genital\nC. Oral, anal, genital, phallic\nD. Anal, oral, genital, phallic\n12. Freud distinguished between two parts of a dream, which he called\nA. Conscious and unconscious\nB. Normal and deviant\nC. Latent and manifest\nD. Repressed and unrepressed\n13. Manic disorders share with some forms of schizophrenia which of the following symptoms?\nA. Hallucinations\nB. Social withdrawal\nC. Shifting erratically from one subject to another in conversation\nD. Blunted affect in response to social and verbal stimuli\n14. Which of the following hypothetical findings would oppose the organic explanations of higher\nincidence of depression in adult females?\nA. Equal incidence of schizophrenia in both sexes\nB. Equal incidence of depression in both sexes in other cultures\nC. Lower levels of norepinephrine in females\nD. Lower levels of activity in females\n15. The concordance rate among identical twins for schizophrenia is 55 percent, while the comparable\nfigure for fraternal twins is 9 percent. These results suggest that\nA. Genetic factors predominate as causes of schizophrenia\nB. Schizophrenia is essentially caused by environmental factors\nC. The primary cause of schizophrenia is probably hormones in the womb rather than genes\nD. Genetic and environmental factors play roughly equal roles in the cause of schizophrenia"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 1 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/60615112996e8d20e2476d565afb9cbc_h01.pdf",
      "content": "Handout One\n9.00 9/09/04\nQuestions to answer from Chapter One:\nP15 Can you describe the basics of an experiment in Psychology? Obviously, there are\nmany different methods but you should be able to talk about \"hypotheses\", \"dependent\"\nand \"independent\" variables, \"control groups\", and \"confounds\".\nPeople with a deeper interest in psychological research will look at Appendix A on\nStatistics at the back of the book.\nLecture One: Part One - What is this course all about?\nThe example of love (The book does emotion, in general).\nA few words about the course\nQuestions to answer from Chapter Two:\nP44 What are the basic methods used to study the brain?\nP49 What are the hindbrain and midbrain good for? And why don't forebrain, midbrain,\nand hindbrain correspond to front, middle, and back of your brain?\nP53 You should be able to say something about the function of the following bits of\ncortex: Primary motor projection area (or \"motor cortex\"), somatosensory cortex,\nauditory cortex, and visual cortex.\nP56 You should be able to say something about the likely effects of damage to each of\nthe lobes of cortex (And you should be able to locate those lobes: occipital, parietal,\ntemporal, frontal).\nP60 What is the corpus callosum and what happens if you cut it?\nP63 Describe the parts of a typical neuron and what they do. Terms: dendrite, cell body\n(soma), axon, nodes of Ranvier, myelin sheath, glial cells.\nP66 How does a neuron work? Terms: Action potential, resting potential, synapse,\nneurotransmitter (Those with real interests in this area ...e,g. pre-med sorts...will want to\nknow something about specific neurotransmitters.)\nPage 1\n\nHandout One\n9.00 9/09/04\nLecture One: Part Two - The Brain\nMaterialism and dualism\nHow can we find out what brain does?\nFour broad classes of method, each with advantages and problems\n1)\n2)\n3)\n4)\nBrain terms that you will want to know (repeated in the book)\nLobes of the cerebral cortex: Frontal, parietal, occipital, temporal\nWhere are visual cortex, somatosensory cortex, motor cortex, auditory cortex,\nWernicke's and Broca's areas\nLimbic system, basal ganglia, brain stem/core, cerebellum\nNeuron: axon, dendrite, soma, myelin, synapse\nNeuronal Transmission: action potential, neurotransmitter\nHow a neuron works: The basics\nSomething to write about, #1: The Faithful Vole\nCan fidelity in love be reduced to neurochemistry? If it can, how might that work?\nIs there a commercial product here? Start with the Vole Files (on the website).\nThe beginning reference is an article in Nature:\nLIM, M. M., WANG, Z., OLAZABAL, D. E., REN, X., TERWILLIGER, E. F., &\nYOUNG, L. J. (2004). Enhanced partner preference in a promiscuous species by\nmanipulating the expression of a single gene. Nature, 429(6993), 754-756.\nYou will also find\nDiamond, L. M. (2004). Emerging Perspectives on Distinctions Between\nRomantic Love and Sexual Desire. Current Directions in Psychological Science,\n13(3), 116.\nThis might provide some non-vole material for you. Also included are several\nnews stories about the vole article\nPage 2"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/874e1126a3b3d09dc177dfacf09cff7d_h02.pdf",
      "content": "Handout Two: Why do we do anything?\npage 1\nLeftover from last time\nHow a neuron works: The basics\nTerms:\nNeuron: axon, dendrite, soma, myelin, synapse\nNeuronal Transmission: action potential, neurotransmitter\nLecture Two: Why do we do anything?\nThe abstract: In this lecture I will combine topics from Chapters 3 and 4 to ask why we\ndo anything. The first answer is that we are slaves to our environment. Today, that point,\nwhich will recur, will be illustrated by Thorndike's \"Cat in the Puzzle Box\" experiments.\nThe second answer is that we are slaves to the wiring of our brains and, by extension, to\nour biology and our genes. That point, which will recur, will be illustrated by Olds and\nMilner's \"Rat Brain Stimulation\" experiments. Finally, we will try to go beyond cats and\nrats to talk about more complex human emotions and behavior.\nThe outline:\nPoint 1: Slaves to the environment\nWe start with my rabbit. How do we understand his behavior.\nOne answer: Romanes, George. (1897). Animal Intelligence ( Vol. XLIV). New York: D.\nAppleton and Co.\nA different answer:\nThorndike, E. L. (1898). Animal intelligence. Psychological Review, 2(4 (whole No 8)),\n1-109.\nThorndike's great experiment: The puzzle box\nFigure by MIT OCW.\n\nHandout Two: Why do we do anything?\nThorndike's Law of Effect says that a behavior that is followed by a reinforcer\nwill be reinforced. It will be more likely to happen again.\nWhat is a positive reinforcer?\nWhat is a negative reinforcer?\nWhat is punishment? (and why isn't it a negative reinforcer?)\nWhat does it mean to shape behavior?\nWhat is Behaviorism?\nNote: This is all Chapter 4 material, by the way.\nPoint 2: Slaves to our brains\nOlds and Milner (1954) make a cool mistake\nThey were running a different sort of puzzle box experiment\nThey found that stimulation of some bits of brain was powerfully reinforcing\nQuestion: Will you kill yourself for pleasure?\nSpies, G. (1965). Food versus intracranial self-stimulation in food deprived rats. J. Comp.\n& Phsyiological Psych., 60, 153-157.\nMultiple subsystems for \"pleasure\" (or, better, for 'reward\")\nNotice how \"nature\" and \"nurture\" are two sides of the same coin here?\nNotice also that the animal seems to be acting on its \"feelings\". (Safer to say, it is\nmotivated to act in order to get reward or avoid punishment).\nIs this true for us too?\nHume said that \"reason alone cannot move us to do anything\"\nTreatis on Human Nature, Bk II, pt II, sec III\nPoint 3: Drives and Emotions\nA word about preparedness (maybe)\nA word about hunger\nconsummatory and appetitive behaviors and pleasures\ndrive reduction theory\nWhat are emotions for?\npage 2\n\nHandout Two: Why do we do anything?\nPlutchik, R. (2001). The nature of emotions. American Scientist, 89(July-\nAugust), 344-350.\nA shorthand that helps mobilize resources\nAnd helps you generalize\nAnd helps you communicate\nPoint 4: Moving beyond sex and hunger\nEmpathy - a social emotion\nThe role of facial expression\nWhy aren't we happier?\nWhy isn't the world a better place?\npage 3\n\nHandout Two: Why do we do anything?\nQuestions to answer from Chapter Three:\nNOTE: These questions are intended as a guide to your reading. You do\nnot need to write the answers. At least, you do not need to turn them in.\nWriting them might be a useful form of study. In any case, I would go\nback and have a look at these when you are reviewing for exams.\nP91 The autonomic nervous system is split into sympathetic and parasympathetic\ndivisions. Why can't Prof Wolfe remember which is which? Can you? Teach me.\nP91 What is the hypothalamus and what is its role in thermoregulation?\nP94ff What signals tell us when to eat and when to stop eating?\nP97 What does the hypothalamus have to do with that hairy football in Figure 3.6?\nP97ff You will want to be able to say something about causes of obesity.\nP101 There is that sympathetic / parasympathetic division again. How does it relate to\nour responses to threat?\nP105 The biological underpinnings of sex are of some interest but, for purposes of an\nIntro Psych course, the interesting psychological questions come later in the term.\nP109 You will want to read the section on sleep and dreams but we will come to that\ntopic much later in the term. At that point, you should probably go back and reread these\npages.\nP117 Why does alcohol make people become hyper-excitable?\nSomething to write about, #2: The Emotional Brain\nDo different emotions have different homes in the brain?\nHere is a review article to get you started.\nCalder, A. J., Lawrence, A. D., & Young, A. W. (2001). Neuropsychology of fear\nand loathing. Nature Reviews Neuroscience, 2, 352-363.\npage 4"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/0e0e28f89ac726e7b850cccefe1cd4e8_h03.pdf",
      "content": "Lecture 3 - Learning\nLecture Three: Association Learning and Behaviorism\nThe abstract: In this lecture, I will make four main points.\n1) Classical conditioning (learning of stimulus-stimulus associations) is a very rule-\ngoverned phenomenon.\n2) Operant (or instrumental) conditioning (learning the consequences of your actions)\nhas many fundamental similarities with classical conditioning.\n3) Association learning exerts an important influence on human as well as animal\nbehavior.\n4) However, Behaviorism, the effort to build a complete psychology out of association\nlearning, went too far and is an interesting and important failure.\nThe outline:\nPOINT 1: CLASSICAL (PAVLOVIAN) CONDITIONING\nunconditioned\nunconditioned\nstimulus (US)\nresponse (UR)\nconditioned\nresponse (CR)\nconditioned\nstimulus (CS)\nWhat is being learned here?\nA word about consciousness\nSeveral words about constraints on learning\n1. What is a stimulus? This sounds trivial but isn't.\n2. Overshadowing shows that you need to notice the stimulus - stimulus\nconnection: What is the paradigm?\n3. Contingency: Relationships must be predictive. Mere contiguity is not enough,\n3.5 Extinction (of a response, not the organism):\nWhy is extinction a subhead under contingency?\n4. Preparedness shows that we are not just general purpose association learners.\n5. Timing is critical - specifically, the CS->US interval.\n6. Sensory Pre-conditioning points the way to more complex learning.\nPOINT 2: OPERANT CONDITIONING\nPoint 2: OPERANT CONDITIONING\nRemember the cat in the puzzle box?\nLet's do this again with a pigeon (rats are good, too)\npage 1 of 3\n\nLecture 3 - Learning\nWe use the Law of Effect to shape the animal.\nNow we can use reinforcement to control the behavior of the organism\n\"The Behavior of Organisms\" B F Skinner (1938)\nIn fact, contingencies of reinforcement rule the pigeon's behavior\n\"Contingencies of Reinforcement\" B F Skinner (1969)\nYou should be able to describe the effects of\nFixed and Variable Ratio (FR, VR)schedules of reinforcement\nand\nFixed and Variable Interval (FI, BI) schedules of reinforcement\nExtinction in operant conditioning\nPOINT 3: YOU ARE A SLAVE TO THESE RULES, TOO.\nExample 1: Food aversion\nGarcia, J., & Koelling, R. A. (1966). Relation of cue to consequence in avoidance learning.\nPsychonomic Science, 20, 313-314.\nExample 2: Superstitious Behavior\nExample 3: Parents and Children - who is conditioning whom?\nExtinction & schedules of reinforcement revisited\nExample 4: \"Getting to yes\"\nschedules of reinforcement in sexual behavior\nPOINT 4: BEHAVIORISM\nJohn Watson: \"founder\" of Behaviorism\n\"I believe that we can write a Psychology; define it as...the science of behavior... and never\ngo back upon our definition: never use the terms consciousness, mental states, mind,\ncontent, introspectively verifiable, imagery, and the like... It can be done in terms of habit\nformation, habit integration, and the like.\" {Psych Rev., 1913, 20, 158-77}\nA sketch of radical (Watsonian?) behaviorism.\n1. RULES\n2. AUTOMATIC RULES (and a note about consciousness)\n3. ENVIRONMENTALLY-DRIVEN RULES\n4. GENERAL RULES - Of course, there are some biological constraints but...\nToday, Evolutionary Psychology begs to differ\nWhy aren't we all Behaviorists?\npage 2 of 3"
    },
    {
      "category": "Resource",
      "title": "l04_visntrodem04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/5fee42a9ef3013f79934f3e0b7b27990_l04_visntrodem04.pdf",
      "content": "Visual areas in the brain\nVisual areas in the brain\nImage removed for copyright reasons.\n\nImage removed for copyright reasons.\nCORNEA\nCORNEA\nAQUEOUS\nAQUEOUS\nHUMOR\nHUMOR\nFOVEA\nFOVEA\nOPTIC\nOPTIC\nNERVE\nNERVE\nIRIS\nIRIS\nPUPIL\nPUPIL\nLENS\nLENS\nVITREOUS\nVITREOUS\nHUMOR\nHUMOR\nRETINA\nRETINA\n\nWhat do you see?\nWhy?\n\nThe world is a complicated place\nThe world is a complicated place\nImage removed for copyright reasons.\n\nImage removed for copyright reasons.\nCORNEA\nCORNEA\nAQUEOUS\nAQUEOUS\nHUMOR\nHUMOR\nFOVEA\nFOVEA\nOPTIC\nOPTIC\nNERVE\nNERVE\nIRIS\nIRIS\nPUPIL\nPUPIL\nLENS\nLENS\nVITREOUS\nVITREOUS\nHUMOR\nHUMOR\nRETINA\nRETINA\n\nhttp://web.mit.edu/bcs/schillerlab/research/A-Vision/A2-1.html\nCourtesy of Peter Schiller. Used with permission.\n\nOutside view\nOutside view\nVisual Cortex\nVisual Cortex\nView from the\nView from the\nmiddle\nImage removed for copyright reasons.\nmiddle\n\nFlatten the brain\nFlatten the brain\n(like making a map out of a globe,\n(like making a map out of a globe,\nOnly worse)\nOnly worse)\nImage removed for copyright reasons.\n\nDo we really have center\nDo we really have center--surround receptive fields?\nsurround receptive fields?\nThe Hermann Grid\nThe Hermann Grid\n\nDo we really have center\nDo we really have center--surround receptive fields?\nsurround receptive fields?\nThe Hermann Grid\nThe Hermann Grid\n\nDo we really have center\nDo we really have center--surround receptive fields?\nsurround receptive fields?\nUmm...what is\nUmm...what is\nhappening here?\nhappening here?\n\nBright\nLight\nDim\nLight\nBright\nLight\nDim\nLight\nTime\nThe stimulus\nA neuron's response\n\nLight\n% \"I see it\"\nResponses\nyou want\nyou get\n\nColor\nColor\nHow do you see color?\nHow do you see color?\n\nWavelength (nm)\nWavelength 1 produces a response of size X\nWavelength 1 produces a response of size X\n\nWavelength (nm)\nWavelength 2\nWavelength 2 produces a response of size X\nproduces a response of size X\n\nWavelength (nm)\nTwo wavelengths,\none response.\nThe problem of \"\nThe problem of \"univariance\nunivariance\"\"\n\nSo, we have a problem.\nSo, we have a problem.\nWavelength (nm)\n\nHere is a solution....add another cone type.\nHere is a solution....add another cone type.\nWavelength (nm)\n\nTwo cones can give you color vision\nTwo cones can give you color vision\nWavelength (nm)\nX\nY\nZ\nX/Y =\nX/Y = red\nred, X/Z =\n, X/Z = green\ngreen\nCOMPARISONS ARE CRITICAL\nCOMPARISONS ARE CRITICAL\n\nThree cones give you\nThree cones give you Trichromacy\nTrichromacy\nWavelength (nm)\nL\nM\nS\n\nThree cones give you\nThree cones give you Trichromacy\nTrichromacy\nWavelength (nm)\nL\nM\nS\nAny\nAny light =\nlight = aL\naL +\n+ bM\nbM +\n+ cS\ncS\n\nLet's add some patches together\nLet's add some patches together\nWavelength (nm)\n\nLet's take GREEN\nLet's take GREEN\nWavelength (nm)\nM1\nL1\n\nAnd add RED\nAnd add RED\nWavelength (nm)\nM1\nL1\nM2\nL2\nRed + Green\nRed + Green = (M1+M2)/(L1+L2) = 1\n= (M1+M2)/(L1+L2) = 1\n\nCompare that to YELLOW\nCompare that to YELLOW\nWavelength (nm)\nM3\nL3\nYellow\nYellow = M3/L3 = 1\n= M3/L3 = 1\n\nIt follows that\nIt follows that\nRED\nRED\n\nIt follows that\nIt follows that\nplus\nplus\nRED\nRED\nGREEN\nGREEN\n\nYields\nYields Yellow\nYellow\nR+G and Y are\nR+G and Y are\nMETAMERS\nMETAMERS\nThis is ADDITIVE color mixture\nThis is ADDITIVE color mixture\n\nBut what about color paint in kindergarten?\nBut what about color paint in kindergarten?\nx x x x x x x x x\nx x x x x x x x x\nBlue paint\nBlue paint\nYellow paint\nYellow paint\n\nMixing paint is SUBTRACTIVE\nMixing paint is SUBTRACTIVE\nx x x x x x x x x\nThe\nThe intersection\nintersection of\nof Blue paint and Yellow\nBlue paint and Yellow\npaint looks\npaint looks Green\nGreen\n\nRecall...Three cones give you\nRecall...Three cones give you Trichromacy\nTrichromacy\nWavelength (nm)\nL\nM\nS\nSuppose:\nSuppose: if S=M=L, then WHITE\nif S=M=L, then WHITE\n\nSuppose that L gets\nSuppose that L gets tired?\ntired?\nWavelength (nm)\nL\nM\nS\nWhat does S=M>L look like?\nWhat does S=M>L look like?\n\nPretty boring......\nPretty boring......\n\nPretty ......\nPretty ......\n\nPretty, not boring......\nPretty, not boring......\n\nTry this\nTry this\nNegative afterimage\nNegative afterimage\n\nVertical and Horizontal look the same?\nVertical and Horizontal look the same?\n\nGo forward\nGo forward\n\nGo back\nGo back\n\nVertical and Horizontal look the same?\nVertical and Horizontal look the same?\n\nSo, you found all these nice\nfeatures...what is the problem?\n\nWhich lines group together?\nWhich lines group together?\n\nHow about here? Why?\nHow about here? Why?\n\nWhich gray line is a likely\ncontinuation of the black\nline?\ngood bet\nnot bad\nmaybe\nnot likely\n\ngood bet\nnot bad\n\nWhich gray line is a likely\ncontinuation of the black\nline?\ngood bet\nnot bad\nmaybe\nnot likely\n\nWHAT IS THIS?\n\nDoes this seem likely?\n\nThis seems more likely\n\"Good continuation\"\n\nOne curved line or three?\nYou 'know' about occlusion\n\nOne curved line or three?\nYou 'know' about occlusion\n\nOrganized by columns or rows?\nOrganized by columns or rows?\n\nNow? Organized by columns or rows? Why?\nNow? Organized by columns or rows? Why?\nProximity\nProximity\n\nNow? Organized by columns or rows? Why?\nNow? Organized by columns or rows? Why?\nDid Similarity trump Proximity?\nDid Similarity trump Proximity?\n\nLet's\nmagnify\nthe\ncritical\nbit.\n\nSee that rectangle?\nSee that rectangle?\n\nHow about that rectangle?\nHow about that rectangle?\n\nHow about that circle?\nHow about that circle?\n\nNot as good?\nNot as good?\n\nEdges are important\n\nThe visual system distinguishes \"real\" edges from shadows\nThe visual system distinguishes \"real\" edges from shadows\nImage removed for copyright reasons.\nRemember: You want to know about the world, not your retina\nRemember: You want to know about the world, not your retina\n\nCOW\nCOW\n\nMinimal shadow can give you faces\nImages removed for copyright reasons.\nFaces from University of Bielefeld Cognitive Robot project.\n\nDepth Cues\nFrom 2D-3D\nImage removed for\ncopyright reasons.\n\nOcclusion\n\nIs this likely?\n\nSize\n\nTexture\n\nRelative position (height in field)\n\nHere is why it works\n\nYou don't need to recognize the objects\n\nAreal Perspective (haze)\nThe misty mountains far away\n\nLinear Perspective\nVanishing point\n\nLinear Perspective?\nImage removed for\ncopyright reasons.\nWhere is the vanishing point?\n\nLinear Perspective?\nThese local bits don't add up\n\nLinear Perspective?\nThese add up...ambiguously\n\nShadows\nShadows\nImage removed for\ncopyright reasons.\nBut where is the sun?\n\nAnd let's not forget\nStereopsis,\nVergence,\nand\nMotion parallax"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4 Handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/9-00-introduction-to-psychology-fall-2004/bae74ad0b47a2aa59ce33d4aa1b5640f_h04.pdf",
      "content": "Lecture 4 - Sensation\nLecture Four: Sensation and Signal Detection Theory\nThe abstract: This lecture will have three (or four) parts\n1) We will discuss the general problem of using the senses to understand the world.\n2) We will trace the visual pathway from eye to brain.\n3) We will consider the most basic sorts of perceptual decisions in the context of Signal\nDetection Theory and we will discuss some of the broader applications of the theory.\n4) We might get on to color vision....but history suggests that I may get side tracked long\nbefore that.\nThe outline:\nPOINT 1: THE BIG QUESTIONS: How do we see? How hard can that be to understand?\nA three-part answer\nSensation - Getting data in to the system from the world\nAttention - Selecting some of the data\nPerception - Interpreting the data\nPOINT 2: From eye to brain\nA lot of terms\nEye\n(fill in the blanks )\nAqueous Humor\nPupil\nLens\nVitreous Humor\nRetina\nRetina\nfrom the back\nPigment epithelium\nreceptors\nrods\ncones\nhorizontal cells\nbipolar cells\namacrine cells\nganglion cells\npage 1\nFigure by MIT OCW.\nTHE HUMAN EYE\nFigure removed for copyright reasons.\n\nLecture 4 - Sensation\nTo the brain\noptic nerve\noptic chiasm\nlateral geniculate nucleus of the thalamus\nprimary visual cortex\nextrastriate cortex\nThis is the Hermann (or Hering) grid....why is it interesting?\nThere is an endless amount of fascinating material to discuss\nhere. I am a vision researcher so we might get stuck here\nforever...\nAnd we are ignoring the other senses...which is heartbreaking.\nAh....well\nPOINT THREE: Signal Detection Theory\nJust about the simplest possible perceptual question: Did you see that spot of light in the dark?\nWhat is an absolute threshold?\nHow sensitive are you to light?\nTwo tour de force papers\nHecht, S., Shlaer, S., & Pirenne, M. H. (1942). Energy, quanta, and vision. J. General\nPhysiology, 25, 819-840.\nSakitt, B. (1972). Counting every quantum. J. Physiology (London), 223(1), 131-150.\nWhat would a neuron say?\npage 2\nBrain region schematic removed for\ncopyright reasons.\nOptic Nerve\nOptic Chiasm\nOptic Tract\nVisual Cortex\nLateral Geniculate\nNucleus\nLeft\nRight\nVisual Field\nEye\nFigure by MIT OCW.\n\nLecture 4 - Sensation\npage 3\nBright\nLight\nDim\nLight\nBright\nLight\nDim\nLight\nTime\nThe stimulus\nA neuron's response\nDid you see it? Let's do the experiment\nA couple of Signal Detection Theory websites\nhttp://www.cns.nyu.edu/~david/sdt/sdt.html\nhttp://wise.cgu.edu/sdt/overview.html\nHas a cute applet to make ROCs make sense\nMore terminology\n2AFC = 2-alternative forced-choice\nHits\nTrue Negatives\nMisses\nFalse alarms\ncriterion\nd'\nROC (Receiver operating characteristic) curves\nThe ubiquity of SDT problems\nFrom detection to discrimination\nWhat is Weber's law?\nLight\n% \"I see it\"\nResponses\nyou want\nyou get\n\nLecture 4 - Sensation\nIF we have time: SDT and prejudicial behavior\nYOUR GROUP\nABOVE MAY BE YOUR GROUP OR ANOTHER\nNow look at the consequences.\nColor Vision? Well, if we get there, I will have to make another handout!\npage 4\n\nLecture 4 - Sensation\nQuestions to answer from Chapter Five:\nP171 Can you describe Weber's Law and Fechner's law. Can you say a word about why they are\nof any interest?\nP173 Signal detection theory will get discussed in lecture. It tends to confuse people. But,\nespecially for the mathematically inclined, it is an interesting and important piece of the study of the\nsenses.\nP177 Can you describe the transduction of auditory stimuli from pressure waves in the air to a\nneural signal? You will want to be able to say something about the ossicles, cochlea, basilar\nmembrane, & hair cells.\nP184 The structure of the eye will get covered in lecture and I won't repeat the terminology here.\nP184 What does brightness contrast tell you about the way we see the world?\nP189 What does lateral inhibition do for us?\nP190 Color vision....oy, color vision. People ask more questions and get more confused about\ncolor vision than about any other topic in the course. So, here are the important points\n1) Light is the portion of the EM spectrum containing wavelengths between about 400 and 700\nnanometers (nm). Sunlight includes all of these wavelengths.\n2) Physical objects differ in the percentages of different wavelengths reflected from their\nsurfaces.\n3) You have three types of cone photoreceptors. Each is broadly sensitive to a wide range of\nwavelengths. However, they differ in their sensitivities as shown in this picture.\n4) This means that a single wavelength at a single\nintensity will produce three different responses:\nfrom the long- (L), medium- (M), and short-\nM\nwavelength sensitive cones (S).\nL\n5) In fact, any combination of wavelengths, no\nmatter how complicated, will produce three\nresponses; one each from the L, M, & S cones.\nS\nThis is the heart of Trichromatic theory\n(=Young-Helmholtz theory - p192).\nWavelength (nm)\n6) SO if two very different physical stimuli produce\nthe same three responses, they will appear identical. They are metamers.\n7) In determining the hue (p190) of a surface or a light, it is the ratio of the L, M, & S cone\nresponses that is important. Specifically, the L/M ratio tells you how red or green a surface\nappears and the (L+M)/S ratio tells you how yellow (L+M) or blue it is. This is the heart of\nopponent process theory (194). Trichromacy is step one. Opponent processes are step 2.\n8) Color mixing confuses the pants off people but it is not that complicated. It is just about\ndetermining what stimulus reaches the eye.\npage 5\n\nLecture 4 - Sensation\n9) In additive color mixture, two or more lights are combined so that the union of the two\nsets of wavelengths reach the eye. So if light one is the set {400 & 500 nm} and light two is\nthe set {600 & 650 nm}, light one plus light two will be the set {400, 500, 600, 650}.\n10) In subtractive color mixture, filters remove light and you see the intersection of the filter\nproperties. Paint, for example, is a filter. It sucks up one set of wavelengths and reflects\nback the remaining subset. Suppose you start with sunlight containing wavelengths from\n400 to 700 nm. Now, let's pass that light through filter one. Let's suppose it pass\nwavelengths between 500 and 600 nm. Let's pass that remaining light through filter two,\nsuppose it only passes light between 400 and 550nm. The resulting subtraction will leave\nyou with light between 500 and 550 nm - the only wavelengths passed by both filters.\nHope that helps.....\nP197 and you should be able to define the term \"receptive field\".\nSomething to write about, #4: Kitaoka's Snakes\nAkiyoshi Kitaoka makes some of the best visual illusions in the world. You will find his\nsnakes on the course web page in the KITAOKA'S SNAKES file. You can also visit his\nweb page. It has all sorts of gorgeous things on it.\nhttp://www.ritsumei.ac.jp/~akitaoka/index-e.html\nHis explanation is posted in the same file on our webpage\nYou can also check\nhttp://psych.upenn.edu/backuslab/vss/vss2004/backus2004.html\nBut no one really understands this effect.\nIf write about this, play with it. What makes it move? What makes it stop?\nDo you have a theory?\npage 6"
    }
  ]
}