{
  "course_name": "Intro to Japanese Culture",
  "course_description": "This course examines the major aesthetic, social, and political elements which have shaped modern Japanese culture and society. There are readings on contemporary Japan and historical evolution of the culture are coordinated with study of literary texts, film, and art, along with an analysis of everyday life and leisure activities.",
  "topics": [
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies",
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course looks at the way modern Japanese society and culture formed. Through tracing historical sources and discussing both modern and traditional aesthetics and social and political elements, students will create a picture of Japan as it is today. Analysis, scholarly research, and commentary will create a context through which to approach case studies of literary texts (e.g. \"Hoichi the Earless\"), film (e.g. \"Grave of the Fireflies\" and \"Makiko's New World\"), and art. Students will learn not just about Japanese culture, but how to approach the study of a culture and its development.\n\nInstructor Statements\n\nThis course explores contemporary debates about the nature of cultural differences through an in-depth study of Japan. (\nRead More\n)\n\nNote Regarding Course Number 21G.592 (The Japanese Language Option)\n\nThis course is taught in English. However, there is an option for Japanese language students. This option is 21G.592.\n\nThe course number 21G.592 Intro to Japanese Culture (the Japanese language option), is designed for students who are minoring in Japanese, and who have already completed at least roughly 5 semesters of Japanese language coursework. There will be an additional writing assignment (2-3 pages, double-spaced) in Japanese that must include research from at least two Japanese-language articles. This will be in addition to the assigned 21 pages of writing in English.\n\nWriting and Speaking Assignments for a Communication Intensive Course\n\nCommunication intensive subjects in the humanities, arts, and social sciences require at least 20 pages of writing divided among a number of assignments, at least one of which is revised and resubmitted. This class requires three (3) major writings assignments that total at least 21 pages in length (double-spaced). A schedule of due dates is given below.\n\nHASS-CI subjects also offer students substantial opportunity for oral expression, through class discussion and student presentations. This class requires all students to participate in a weekly discussion of the assigned reading and films. In addition, each student will make a formal presentation towards the end of the semester, and will receive written feedback and be graded by the professor. The presentation will be a formal 10-minute oral report to present an analysis of course materials in relation to your final project. To guarantee sufficient attention to student writing and substantial opportunity for oral expression, the number of students in this class is limited to 18.\n\nImportant Note on Attendance and Class Participation\n\nYour attendance is required at every single class. Except in cases of sickness or unavoidable family emergencies, I expect you in class. If you are going to miss class, I would prefer an email explanation prior to class, but after class is still appreciated. More than two (2) unexcused absences will result in a reduction by 1/3 (e.g., B to a B-) of your final grade. Additional absences will result in additional reductions. I do not give warnings in the event that you are in danger of such a penalty.\n\nGradings\n\nACTIVITIES\n\nPERCENTAGES\n\nMicrothemes and other 1-page papers\n\n10%\n\nEssay 1\n\n10%\n\nEssay 2 - First version\n\n15%\n\nEssay 2 - Revision\n\n10%\n\nFinal Essay\n\n25%\n\nOral presentation\n\n15%\n\nClass participation\n\n15%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nPart I: What is Japanese Culture? Everyday Life and Contemporary Issues\n\n1-2\n\nIntroduction to the Course: Brief history Japan and the contemporary study of culture\n\nIs Japan group-oriented?\n\nFilm:\nMakiko's New World\n(Dir. David Plath)\n\nIs Japan group-oriented? (continued)\n\nFilm:\nHoichi the Earless\n, excerpt from\nKwaidan\n(Dir. Masaki Kobayashi)\n\nCulture of Art, Folktakes, and Performance\n\nVisit to the Boston\nMFA\nand discussion on the representation of Japan at the MFA.\n\nPlease pay special attention to \"\nEchoes of Heian-Kyo: Court Culture and the Floating World\n,\" some of which depicts the world of the Tale of Genji.\n\nMen, Women, and Change\n\nSpecial Event: Hoichi the Earless: Music and Dance Performance (biwa/butoh)\n\nOptional: Master class workshop with dancer and musicians\n\nMen, Women, and Change (continued)\n\nClass visit: Video game makers from Akihabara (Japan)\n\nMen, Women, and Change (continued)\n\nDiscussion: Bumiller, Kelly/White and topic for Essay 1\n\nMen, Women, and Change (continued)\n\nEssay 1 Due\n\nFilm:\nInside Japan, Inc\n.\n\nPart II: Encounters with Cultural Difference\n\n10-13\n\nDiversity of Japan\n\nHiroshima: Did the Bomb End the War?\n\nEssay 2 due\n\nHiroshima: Did the Bomb End the War? (continued)\n\nFilm:\nGrave of the Fireflies\n(Dir. IsaoTakahata, Studio Ghibli)\n\n16-18\n\nContemporary Japan as Global Culture\n\nEssay 2 revision due\n\n19-23\n\nStudent Symposium on Japanese Culture\n\nPresentations\n\n24-25\n\nConclusions and Future Questions\n\nFinal paper due",
  "files": []
}