{
  "course_name": "Introduction to Linguistics",
  "course_description": "This course studies what is language and what does knowledge of a language consist of. It asks how do children learn languages and is language unique to humans; why are there many languages; how do languages change; is any language or dialect superior to another; and how are speech and writing related. Context for these and similar questions is provided by basic examination of internal organization of sentences, words, and sound systems. No prior training in linguistics is assumed.",
  "topics": [
    "Humanities",
    "Language",
    "Linguistics",
    "Syntax",
    "Humanities",
    "Language",
    "Linguistics",
    "Syntax"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis class will provide some answers to basic questions about the nature of human language. Throughout the course, we will be examining a number of ways in which human language is a complex but law-governed mental system.\n\nIn the first two thirds of the class, we will study some core aspects of this system in detail. In the final part of the class, we will use what we have learned to address a variety of other questions--including how language is acquired, how dialects arise, how languages change over time, and others.\n\nCourse Requirements\n\nReadings\n\nThe main textbook for the course is:\n\nO'Grady, William, John Archibald, et al.\nContemporary Linguistics: An Introduction\n. 6th ed. Bedford/St. Martin's, 2009. ISBN: 9780312618513.\n\nWe will also read the following book:\n\nBaker, Mark.\nThe Atoms of Language: The Mind's Hidden Rules of Grammar\n. Basic Books, 2002. ISBN: 9780465005222.\n\nFrom time to time, there will also be other required readings (mostly short), as well as some things to listen to or watch.\n\nAttendance\n\nAttendance in class and recitations is\nrequired\n, and will affect your grade. Though you can learn a lot from the readings,\nmany\nclasses will present material not in the readings--or will present the material in a slightly different way.\n\nParticipation in recitation discussions is part of the\ncommunications intensive\ncomponent required in\nCI-H\nclasses. Attendance will be taken in recitations.\n\nHomework: Problem Sets and Papers\n\nMost weeks, you will be assigned a\nproblem set\n. Most of the questions in these assignments will ask you to draw and justify conclusions about data that we supply from real languages (sometimes slightly simplified)--using and extending concepts and analytic techniques discussed in class and in the readings.\n\nSome of these problem sets will also require you to do\nfieldwork\n. For these assignments, you will ask be asked to find a speaker of a language that you do not speak and have never studied, and to learn some specific things about that language from that speaker. If possible, you should work on the same language in each problem.\n\nYou will also be required to write three relatively short papers:\nan analytical summary (4 pages); an argumentative essay (4 pages); and a field research paper (12 pages)\n. You will also submit an additional\npolished paper\n. This paper will be a substantially revised and extended version of either the first or second paper, reflecting new ideas and perspectives you have developed through this course and your response to the writing instructor's comments on your previous version. The choice of which paper to revise is yours. The grade for the revised, polished paper will emphasize the quality and thoughtfulness of the revisions.\n\nWe will discuss the topics of these papers as the semester progresses. Your opportunities for \"oral expression\" will arise in the fieldwork parts of the course, as well as in class and in recitation.\n\nQuizzes and final exam\n\nThere will be two in-class (45-minute) quizzes and a sit-down closed-book final exam. The final exam will cover material from the entire course, and will be a mixture of factual questions and problems.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\n20%\n\n2 quizzes\n\n20%\n\nFinal exam\n\n25%\n\nPapers\n\n25%\n\nAttendance and participation\n\n10%\n\nIf you have not done so already, please familiarize yourself with the\nMIT Academic Integrity guidelines\n.",
  "files": [
    {
      "category": "Assignment",
      "title": "24.900 Intro to Linguistics: Writing Assignment 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/9e3f478f759d85346809c84b0f0f5158_MIT24_900F12_Assignment1.pdf",
      "content": "4 pages, 1.5 or double-spaced. Indent each paragraph; no extra spaces between paragraphs.\nDescription\nFor the first paper in this class, you will read a published article that makes a claim about\nlanguage, and write a short critical paper that summarizes and evaluates the authors' claim.\nIn order to do this, you will need to consider the evidence that is put forward in support of\nthe claim and discuss the strengths and weaknesses of the authors' arguments. Are you\nconvinced by the authors' evidence and arguments? If not, why? If you see weaknesses,\nsuggest alternative interpretations or explanations of the evidence. You can also consider\nsuggesting alternative experiments or other types of evidence that could strengthen the\nauthors' claim. You are not expected to do any research or consult other sources of\ninformation for this assignment.\nA well-written paper should:\n- Concisely summarize the main thesis/claim of the paper\n- Describe the key evidence that is presented in support of the claim\n- Evaluate whether the evidence confirms the researchers' claim, or whether there might\nbe other possible interpretations of their findings\nIn addition, the paper should do one or more of the following:\n- If the evidence is ambiguous or insufficient to confirm the claim, discuss what type of\ndata would be helpful in order to distinguish between the competing hypotheses or\ninterpretations\n- If the evidence actually seems to support a different interpretation than the one that is\nadvanced in the article, provide an argument for why we should draw a different\nconclusion from what the researcher(s) advocate\n- Discuss possible implications of the finding, if you believe it is true. For example:\nWhat further predictions might we make, based on this result? What are some new\nhypotheses that we might make, and what sorts of additional data might we want to\ncollect to test them?\n24.900 Fall 2012\nBe sure to cite page numbers of any quotations from the article. Also, give your essay an\nengaging and descriptive title--not simply \"Writing Assignment #1\". Papers will be\nevaluated for content, coherence, clarity of expression, and mechanical correctness.\nArticles to choose from\nNote: While these articles do have some technical content, they are not intended solely for\nreaders with a strong background in linguistics. Although there will be some technical\nterms and details of the analysis that go beyond what you have studied so far, you should\nbe able to grasp central ideas and claims of the article--and that is all that we are\nexpecting. If you are uncertain as to whether you are interpreting a technical term or\nanalysis correctly, simply indicate so, and proceed on the assumption that you are correct.\n(It is also fine to ask the instructor or a TA to verify your interpretation.)\nBelow is the list of articles to choose from. Begin by glancing through the titles, and then\ngo to the papers whose titles pique your curiosity and read their abstracts. That\nshould enable you to pick an article that you'll find especially interesting to read, analyze,\nand write about.\n- Iris Berent, Tracy Lennertz, Jongho Jun, Miguel A. Moreno, and Paul Smolensky.\n\"Language universals in human brains.\" Proceedings of the National Academies of\nScience. 8 April 2008. Vol. 105, no. 14. pp 5321-5325.\n- Brian Butterworth, Robert Reeve, Fiona Reynolds, and Delyth Lloyd. \"Numerical\nthought with and without words: Evidence from indigenous Australian children.\"\nProceedings of the National Academies of Science. 2 September 2008. Vol. 105,\nno. 35. pp 13179-13184.\n- Marie Coppola & Elissa L. Newport. \"Grammatical subjects in home sign:\nAbstract linguistic structure in adult primary gesture systems without linguistic\ninput.\" Proceedings of the National Academies of Science. 27 December, 2005.\nVol. 102, no. 52. pp 19249-19253.\n- Jenny R. Saffran, Richard N. Aslin, and Elissa L. Newport. \"Statistical learning by\n8-month-old infants.\" Science, New Series, 13 December 1996. Vol. 274, no. 5294,\npp 1926-1928.\n- Wendy Sandler, Irit Meir, Carol Padden, and Mark Aronoff. \"The Emergence of\ngrammar: Systematic structure in a new language.\" Proceedings of the National\nAcademies of Science, 15 February 2005. Vol. 102, no. 7, pp 2661-2665.\nWriting Assignment #1:\nCritical Summary of an Article\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.900 Intro to Linguistics: Writing Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/05ed57928ad9e5b5d526c44c0ce062fa_MIT24_900F12_Assignment2.pdf",
      "content": "Writing Assignment #2\nArgumentative Essay (4-5 pages)\nFor this paper, you will be asked to think about the social, cultural, and political aspects of\nlanguage, and to formulate a response to a current debate about language and society. Your\nessay should have a clear central thesis and a set of arguments and evidence to support\nyour point of view. It should have a descriptive title and it should be 1.5 or double-spaced.\nYou may choose either of the following two topics. Use the three articles associated with\nthe topic you choose as background. You are not expected to do additional research for\nthis paper. The articles and chapters should provide you with sufficient background to\nhelp you develop your view about the issue.\nWe will be discussing some of these topics in the part of the course (when we discuss\nlanguage acquisition, dialects and language change), so your thinking and writing on this\ntopic are intended to prepare you for that discussion.\nTopic #1\nMost people are aware that biological species are becoming extinct at an increasing rate,\nand that this is happening everywhere on the planet. International organizations, research\ninstitutes, and foundations are involved in efforts to save endangered species by\npreserving and revitalizing their natural habitats. But another process of extinction is\ntaking place that is not so well known--the dying out of languages. Likewise, there are\nindividuals, communities, and organizations devoted to preserving endangered language\n\"species\".\nThese efforts are not universally applauded, however. Even linguists themselves disagree\nabout the cultural and political value, as well as the linguistic feasibility, of reviving or\nrevitalizing a dying language.\nWhat is your view? Are efforts to restore dying languages worthwhile and potentially\nfeasible?\nDrawing on what you have learned about language and linguistic theory in this class\n(morphology, phonetics and phonology, so far), as well as your own observations, ideas,\nand experiences (which might include what you've learned about your fieldwork language)\n-- and using the sources -- formulate a clear and well-argued position on this\ncontroversial question.\nSources:\n- Michael Krauss (1992). The World's Languages in Crisis. Language.\n- Peter Ladefoged (1992). Another View of Endangered Languages. Language.\n- Steven Wurm (1991). Language Death and Disappearance: Causes and\nCircumstances. Diogenes.\nTopic #2\nWe can see the political, social, and cultural significance of language in the intense\ncontroversies over national language policy that have arisen (and continue to arise) in\ncountries throughout the world, and in the policies that different governments adopt.\nContrasting examples include: the adoption of French as the sole official language of the\nCanadian province of Quebec in 1974; the long-standing official recognition of three\nlanguages (French, Swiss German, and Italian) in the multiethnic, multicultural country of\nSwitzerland; and the ruthless suppression of Catalan, the primary language of the\npopulation of the Spanish province of Catalonia, under the dictatorship of Franco in 20th\ncentury Spain.\nHere in the U.S., there has been a growing movement over the past two decades\nadvocating a federal law to designate English as the official language of the nation. The\nidea behind this proposal is to require that English be the sole language of all government\naffairs (e.g., courts, taxes, elections) and of education. This movement is highly\ncontroversial.\nWhat do you think? Should the U.S. adopt such a federal law? Alternatively, if you\ncome from a country where there have been controversies over language policy, what\nis your view about them?\nUsing what you have learned about language and linguistic theory in this class, as well as\nyour own observations, ideas, and experiences -- and the sources -- formulate a clear and\nwell-argued position on this controversial question.\nSources:\n- Robert King (1997). Should English Be the Law? Atlantic Monthly\n- S.I. Hayakawa (2005). Bilingualism in America: English Should Be the Official\nLanguage. In Language Awareness.\n- Dennis Baron (1990). An Official Language. In The English-Only Question.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.900 Intro to Linguistics: Writing Assignment 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/e0f687c42ce6f4e0ca71380594c73680_MIT24_900F12_Assignment3.pdf",
      "content": "24.900\nFall 2012\nWriting Assignment #3\nGrammatical Sketch (≥ 12 pages)\nIntroduction to the Assignment\nIn this assignment, you will be compiling the phonological, morphological, and\nsyntactic properties that you have discovered in your linguistic fieldwork into an\norganized, well-written, readable and interesting grammatical sketch.\nThe term \"grammatical sketch\" is a real one in linguistics. Linguists who have\nworked on a language report their findings in several different ways. They may write\nscholarly papers about particular puzzles and problems that they have uncovered (and\nmaybe solved) -- intended for other linguists interested in those sorts of puzzles. They\nmay also put their knowledge to practical use in cooperation with the community of native\nspeakers, helping to preserve and enhance the status of the language by collaborating on\ntextbooks, compilations of texts, and literacy initiatives.1 They may write a\ncomprehensive grammar of the language that documents as much of its structure as they\nhave uncovered, ideally accompanied with many examples, complete texts, audio and\nvideo etc. In addition, they will often distill some of their knowledge into a brief\ndescription that offers a kind of \"snapshot\" of the language, focusing on the most\nimportant, salient and interesting points. This kind of briefer description is called a\ngrammatical sketch. Here are some descriptions of grammatical sketches on the web, to\ngive you a flavor for the genre:\nhttp://www.eva.mpg.de/lingua/tools-at-lingboard/pdf/donohue_grammar_sketches.pdf\nhttp://pages.uoregon.edu/tpayne/engram.htm\nGoogling for \"grammatical sketch\" will bring up many examples of actual grammatical\nsketches, which you might like to browse. Please, however, do not look at a grammatical\nsketch of your own fieldwork language!!\nContents of your paper\nAudience: Imagine that linguists knew virtually nothing about your fieldwork language\nuntil you got to work on it, and you are the first linguist to conduct field work on this\nlanguage. Your task is to provide a preliminary \"grammatical sketch\" of the language,\nwhich can serve as the basis for further study of this language by other linguists. Your\naudience is someone who knows a bit about linguistics (you don't have to define\n\"phoneme\", for example), but nothing about your language -- for example, a fellow\n(enthusiastic) student in 24.900.\n1 This is especially important when linguists work on endangered or minority languages.\nIf you are interested in knowing more, lots of links can be found at\nhttp://projects.chass.utoronto.ca/lingfieldwork.\nData: You have probably already collected most of the data that you need for this\nassignment, but you will probably also want to return to your informant to verify facts\nabout which you are uncertain, and to flesh out parts of your description where your data is\nincomplete. This is probably the last assignment for which you will be asked to do this\n(though there might be an extra-credit fieldwork question or two coming up in future\npsets), so you can feel a bit freer to impose on your consultant's time -- since you can\npromise him/her that it's more or less the last time! (This is also a good time to thank your\nconsultant profusely, and take them to dinner,)\nQuestions your paper should answer:\n- Background information about the language: What language family does the\nlanguage belong to? Where is it spoken and by how many people (approximately)? Is\nthere a standard writing system for the language -- and if so, what kind of system is it?\nAs you probably remember, a good source for the most basic information on this topic\nis http://www.ethnologue.com/web.asp, but you will get extra points for doing a bit\nmore research in the library or on-line. Wikipedia is not an acceptable or reliable\ninformation source (and do not read what it might say about the structure of your\nlanguage -- it's cheating and eliminates all the fun), but it can sometimes be a good\nway to learn what reliable sources are out there.\n- Research methods: Describe your language consultant. Provide information that\nwould establish that the consultant is a native speaker of the language, and add any\nother information you think is relevant (e.g. whether the consultant is bilingual) -- but\nask permission before using any relevant information you think might be considered\npersonal. Mention how many times you met with the consultant, and briefly describe\nhow you elicited and recorded the language data.\n- Phonology: Identify as many sounds as you can that make up the phonemic inventory\nof the language. phonological rules you have discovered in the language (e.g.\ndevoicing; consonant assimilation; vowel harmony, vowel deletion).\n- Morphology: Identify some characteristics of word formation in the language. Did\nyou find evidence of both derivational and/or inflectional morphemes? Are these\nmorphemes prefixes, suffixes, or infixes? What grammatical properties do\ninflectional morphemes represent (e.g., case marking of nouns; verb tense)?\n- Syntax: Describe the basic phrase structure of the language. Is your language head-\ninitial, head-final, or mixed. Make sure you include some information about\nsubordinate clauses, so you know where complementizers go (if your language has\nthem). What can you discover about modifiers? Can you find evidence in this\nlanguage of any movement rule, such as wh-movement? Include trees!\n- General remarks: Each claim you make about a property of the language must be\nsupported with evidence in the form of actual language data. You can include tree\nstructures to illustrate syntactic structures and rules.\n\n-2-\nYou have probably reported most of this information in psets over the past few\nmonths, so do not be afraid of repeating yourself -- but make sure that you have taken\n\ninto account any comments or corrections that you received on those psets!\n\nAs always, you have probably found some phenomena that are puzzling and that you\naren't sure how to describe or explain. That's fine! That's a hallmark of original\nresearch. Feel free to include those phenomena, pointing out what's puzzling and\nsuggesting possible analyses.\n\nWhat you focus on will depend on the particular language you're investigating. You\nshould pursue what is most revealing and what you find most interesting.\n\nOrganizing and formatting the paper\n\nThis is a research paper, not an essay. The format will therefore differ from that of the\nprevious two papers. Your paper should include (at least) the following sections, with\nheadings identifying each section:\n\n1. Introduction (1-2 paragraphs)\n\nBriefly describe the purpose and scope of the paper. Give background about the\nlanguage.\n\n2. Methods (1-2 paragraphs)\n\n3. Phonology\n\n4. Morphology\n\n5. Syntax\n\n6. Conclusion (1-2 paragraphs)\nThere are a couple of ways you could conclude the paper: (1) consider how\nyour findings might relate to general issues discussed in class; or (2) suggest\nsome directions for further research on this language, given some of your\n\nresults.\n\nThe lengths of sections 3-5 will vary and will depend on your particular language, what\nyou discover, and what you choose to focus on.\n\nThe paper should be either 1.5 or double-spaced. Its length should be no less than 12\npages (thus fulfilling MIT's CI-H requirements), but since we are asking you to report the\ndata that supports your description, you will probably find that your own writing plus your\n\ndata will somewhat exceed the 12-page minimum. The important thing is to write an\nexcellent, informative grammatical sketch that answers the questions we want you to\nanswer.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "24.900 Intro to Linguistics: Writing Assignment 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/36ec0681387abd419d589841d3e2ed29_MIT24_900F12_Assignment4.pdf",
      "content": "24.900 Fall 2012\nWriting Assignment #4:\nA revision of Assignment #1 (the critical analysis essay)\nor Assignment #2 (the argumentative essay)\n4-5 pages\nFor your final writing assignment, you will revise one of the essays you wrote earlier this\nsemester. We are not necessarily looking for a longer paper. Rather, we are looking for a paper\nthat reflects an improvement in the overall quality of presentation and a greater understanding of\nthe linguistic topic or question you wrote about in the first version.\nYou should begin your work on this paper by critically re-examining the ideas, claims, and\narguments you presented in the previous version. In light of your greater knowledge of\nlinguistics, you are likely to discover that your thinking about the topic has changed in some way\nand that you need to modify your arguments to reflect changes in your perspective. Alternatively,\nyou may want to expand on some aspects of the topic or develop additional arguments to\nstrengthen your original ideas or claims. You should also address any areas of weakness that\nwere pointed out in the writing instructor's comments. For example, you may need to sharpen the\nfocus and organization of the paper, make more effective use of evidence from the source\nmaterial to support your claims, or improve the clarity and fluency of your prose. Revising also\nmeans editing the paper to eliminate grammatical, spelling, and punctuation errors.\nA good first step would be to read through your earlier paper, noting any key claims or\narguments that you want to modify or expand on. You may also find it useful to re-read the\nsource material provided for the assignment. Review the comments you received on the first\nversion, to see the patterns of strengths and weaknesses. Begin with the more substantive\nrevisions -- especially those involving focus, additional development, or organization. Then turn\nto phrasing and mechanics.\nAs before, the essay should have a title and be double-spaced. It should also include a\nbibliography of the source material you used.\nImportant: You should attach a one-paragraph summary that highlights the changes you made in\nrevising the essay.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "24.900 Intro to Linguistics: Final Exam Study Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/9c4ee8899e99744302b675e5d29b4c98_MIT24_900F12_FinlExamGuide.pdf",
      "content": "revision 12/18/201\nFinal Exam Study Guide\n(24.900 Fall 2012)\nIf we do our job well, the final exam should be neither particularly hard nor\nparticularly easy. It will be a comprehensive exam on the points stressed and\npracticed in this class, but should have no tricks or nasty surprises. There will be a\nfew questions designed to specially benefit those who faithfully attended class and\npaid attention, but that's as mean as it will get.\nExpect problems and questions of the same general type as those you tackled on your\nproblem sets and on the two quizzes. Thus, if there is any type of problem from one\nof the problem sets that you do not feel comfortable with, be sure to ask us for help as\nyou study.\nAlso expect short-answer questions and identification questions, as well as short\nparagraphs or mini-essays on concepts or issues discussed in class.\nYou are not responsible for terms, topics or issues discussed in the textbook that were\nnot also covered in class.\nThe converse is not true. You are responsible for all topics stressed in class lectures,\neven if they were not stressed in the readings. (This is in accordance with the general\nguidelines mentioned in the syllabus.)\n1. Introduction\n1. Types of linguistic knowledge: semantics, syntax, morphology, phonology,\nphonetics\n2. Knowledge of language as an example of tacit (unconscious) knowledge.\n3. storage vs. computation in language use. The lexicon (storage) vs. grammar\n(computation).\n4. The logical problem of language acquisition, otherwise known as Plato's\nproblem [or the problem of poverty of the stimulus]: how we end up knowing\nso much for which we have so little evidence. An answer: language as a\nmixture of innate knowledge vs. learned knowledge.\n5. An example: knowledge of words (and morphemes) despite the absence of\nword boundaries in the speech signal.\n2. Morphology\n1. Morpheme: bound vs. free, root vs., affix, base\n2. Types of affixes (by where they attach): prefix, suffix, infix\n3. Types of affixes (by source of their pronunciation): Affixes with their own\nphonological form vs. reduplication.\n4. Tips:\n- Avoid pitfalls like forgetting that a reduplicated morpheme may be a\nprefix, suffix or infix. Or forgetting that a word may contain a series of\nsuffixes (industrializational) and that the internal suffixes are not infixes!\n(An infix is a morpheme that attaches inside another morpheme.)\n- For this topic, the textbook is a good guide to what you need to know.\nTerms not covered at all in class (e.g. ablaut) will not be on the exam.\nOther good guides are your problem sets and the data on the morphology\nhandouts from class. You will have morphology problems just like the\nones you had in class.\n\n-2\n3. Phonetics\n1. Be able to label the parts of the vocal tract you labeled on the phonetics quiz.\nKnow the phonetic difference between a vowel, a consonant and a glide.\n2. Consonants: know the same facts about place of articulation, manner of\narticulation and voicing that you learned for the phonetics quiz. Know the\nsame IPA symbols you learned for the quiz.\n3. Vowels: Know the English vowels as you learned them for the phonetics quiz,\nincluding their classification by height and front/back. Revive your memory of\nthe relevant IPA symbols, e.g. know the symbol for the vowel in put and the\nvowel in but, and don't get them mixed up!\n4. Hint: As should be obvious, good advice is to restudy your phonetics quiz and\nthe materials you studied before taking it.\nNote: There will be no transcription into IPA, but there may be transcription\nout of IP into standard English spelling. That is, no one will say\n\"deforestation\" and expect you to write it in IPA, but wi majt æsk yu tu ɹiɹajt\nsʌmθɪŋ lajk ðɪs in normal English spelling.\n5. Acoustic phonetics: Consult your notes and lecture notes (posted) for the\nconcepts categorial perception, formant, transition (rapid fall or rise in a\nformant, which provides a cue for a consonant's place of articulaton). Recall\nthe findings of the infant speech perception experiments discussed in class.\nWhat is the McGurk effect?\n4. Phonology\n1. Best advice: Be able to do any phonology problem of the type presented in\nclass and in your problem sets. In particular:\n- Given a set of forms, be able to determine if a group of sounds are in\ncomplementary distribution. Be able to conclude from your investigation\nwhether the sounds in question are separate phonemes or allophones of a\nsingle phoneme. (Remember: if you find a minimal pair, you know you are\ndealing with separate phonemes!)\n- Given a set of forms from a language, be able to discover the existence of\nphonological rules active in that language. Sometimes such rules will\nrelate allophones to a common phoneme. At other times, the rules will\nrelate two sounds that might also function as separate phonemes elsewhere\nin the language.\n2. Examples: Turkish and Russian final devoicing. In such cases, you may be\nasked to discover the forms of the morphemes listed in the lexicon -- called the\nunderlying or phonemic representation. [Warning: This concept and activity\nis tricky and sometimes difficult to master. Pay some attention to it as you\nstudy for the exam, and ask questions if you don't get it.]\n3. Know the \"X → Y / ___ Z\" notation for phonological rules. You are not\nrequired to learn anything in particular about features except the concept. Use\nof articulatory labels like alveolar is fine in rules, for the purposes of this final\nexam. The book goes into much more detail than we did.\n4. Be able to look at a pair of rules that are crucially ordered and both (1)\ndetermine the correct ordering and (2) justify the ordering by showing how\nyour ordering yields the right forms and the opposite ordering yields the wrong\nforms.\n5. Writing systems\n-\nWriting systems as a technology for representing speech, not a form of\nlanguage in its own right.\n-\nTypes of systems: pictographic, syllabary, alphabet (good to know an example\nor two of each)\n-\nOrigins of the Roman alphabet in Phoenecian and Greek alphabets.\n-\nWhat alphabet did the missionaries Cyril and Methodius devise for the Slavs?\n(Hint: it wasn't Cyrillic!)\n-\nphonemic vs. phonetic alphabetic writing systems\n6. Syntax\n1. For the topics covered in syntax there were lecture notes posted on the web site\nwhich summarized and supplemented the textbook and class lectures. These,\nplus your problem sets and class notes, are your definitive guide to the topics\ncovered in syntax on the final exam. The book is also important, but what we\ndid in class should take priority in your studying.\n2. The topics thus include:\n- Phrases and phrase structure: basic tree drawing, the notion head, the\nhead-first/head-last parameter. The Final over Final Constraint (FOFC).\n- Subcategorization, Chomsky's locality condition on subcategorization,\nwhat was right and what was wrong about Chomsky's condition.\n- Movement motivated by apparent counterexamples to subcategorization.\nKnow and be able to diagram the effects of topicalization, wh-movement\nand verb-second.\n\n-3\n- Principle C, large small shirt and other interactions between syntactic\nstructure and meaning.\n3. Pay attention to the technical terms boldfaced in these handouts.\n4. Do reread the textbook chapter on syntax. You are not responsible for those\nsections that were not discussed in class, in particular the analysis of relative\nclauses.\n5. From Baker's book and what was supposed to be the final class on syntax (but\nactually was slipped into the acquisition class right before Thanksgiving):\nParameter, pro-drop (subject/object), incorporation, polysynthesis.\n7. Language Acquisition\n-\nKnow the standard wisdom about the stages of language acquisition, and the ages\nat which normally developing children tend to pass through them:\n-\nBabbling:\n6-12 months (roughly)\n-\n1-word:\n1 yr - 1.5 years\n-\n2-word:\n1.5 years -2 years\n-\ntelegraphic:\n2 years - 2.5\n-\napproaching adult-like:\n2.5\n-\nProduction always lags behind perception/comprehension.\n-\nPlato's Problem, Universal Grammar, Chomsky vs. Skinner (see overheads)\n-\nBe prepared to discuss the course of acquisition (with some examples) in the\nvarious parts of language discussed in class, especially phonetics (infant speech\nperception work), phonology (sound substitutions, non-adult rules, is the child\naware of them?), morphology (e.g. the wug test) and syntax (early pro-drop?, other\ntopics shown in videos). I'd hoped to discuss root infinitives, but ran out of time\nso that will not be on the exam.\n-\nTip: Review the acquisition lecture notes on the web, and make sure you know\nboldfaced or emphasized material.\n8. Semantics\nThe slides are quite complete, and you are responsible for their contents,\nincluding:\n- the principle of compositionality (and examples)\n- semantics of modification, role of connectives\n- basic modeling, modeling of determiner meanings (they denote set relations)\n- A semantic universal: conservativity.\n- meaning of the definite article the\n9. Historical Change\n1. Know how linguistic change arises (in part) as a by-product of the Plato's\nProblem (the fact that the information available to the child lacks word\nboundaries, trees, etc.). That is: language acquisition is close to perfect, but is\nnever in fact actually perfect. (Another name for Plato's Problem is the\n\"poverty of the stimulus\", a more common term that I'm sorry I failed to stress.\n2. Know how variation arises as a consequence of historical change (plus\ngeographic or social isolation). [Class notes plus common sense.]\n3. The notion dialect (vs. language) and the difficulties posed by this notion.\nExamples of mutually unintelligible languages called \"dialects of the same\nlanguage\" for political/sociological reasons (e.g. the Chinese \"dialects\" or the\nArabic \"dialects\"). Examples of mutually intelligible languages called separate\nlanguages for similar reasons (e.g. Norwegian, Swedish and Danish). \"A\nlanguage is a dialect with an army and a navy.\"\n4. The notion sound change as a phonological rule that enters the language (and\nmight eventually leave it again!) Look over the Italian/Latin handout and\nunderstand the point of florido/placare and bianco/schiavo.\n5. Discovery of language families, especially Indo-European!\n- Final exam special! Be able to name ten Indo-European languages from at\nleast five different subfamilies (e.g. Germanic, Romance, Slavic, etc.), and\nsay what subfamily each belongs to. [CL pp. 320-324]. Call this idea\njuvenile, annoying, or lots of fun. I've been doing it for a decade or two\nand I'm not going to stop now. [Discrepancy alert: Your book lists Baltic\nand Slavic as separate subfamilies, while others (e.g. my handout) group\nthem together as Balto-Slavic. Either is fine.]\n- The notion cognate.\n- Grimm's law: know what proto-Indo-European p, t, and k became in\nGermanic and be able to give English cognates for obvious examples from\nLatin or Greek, e.g. Latin pater/English father.. [CL p. 280-282 plus class\nnotes and handout.]\n6. History of English:\n\n-4\n- Know conventional dates for Old English [450-1100 AD], Middle English\n[1100-1500], and Modern English [from 1500].\n- Great Vowel Shift: Know what it is and learn the facts on pp. 258-259 of\nCL. It is not as hard as it looks, since the spelling of Modern English\nreflects the pre-GVS pronunciation.\n- Be able to state why up to early Modern English we find the verb\npreceding negation (He heard not that. My master seeks not me. etc).\n[Answer: the verb moved to I, as it does in modern French. You might\nlook at CL pp. 183-185 which discusses French. The Middle English\ncounterpart was discussed only in class. Also, I got lazy and did not\ninclude this in my lecture notes, but did include it in the posted slides.]\n[Not on the exam, since we did not get to it in class: non-Indo-European language\nfamilies; Historical reconstruction.]\n10. Dialects\n1. Be prepared to discuss the rule-governed nature of language and what it tells us\nabout dialect variation. You might want to have in mind some specific\nexamples of the sort discussed in the very last class. I will post my slides\nimmediately, and will try (but do not guarantee) to produce lecture notes by the\nweekend. The slides should be good enough, though.\n2. From these slides, know some important features of AAVE syntax and\nsemantics, at least well enough to write a short paragraph about it.\nNote: There will not be any questions from the \"myths\" class (Piraha, etc.).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "24.900 Intro to Linguistics: Phonetics Quiz Info",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/78494848385ce71acd19f0e3f5de1030_MIT24_900F12_PhonticQzInfo.pdf",
      "content": "There will be an in-class, closed-book phonetics quiz\nI instituted this quiz some years ago for a variety of reasons, the most important of which\nis that doing phonology and phonology-related topics presupposes raw memorization of\nbasic material about phonetics, including IPA transcription. There's no way around this\n(sorry!), hence the quiz. The quiz might take the super-speedy among you as little as 20\nminutes, but we will give all of you an hour on it.\nWhat you need to know for the quiz:\n- Know phonetic descriptions and the IPA symbols that correspond to them.\nSpecifically, there will be questions just like (though not identical to) CL p. 56\nproblems 5, 6, and 7.\n- Be able to fully label the parts of the vocal tract that are labeled in figure 2.3 on p.\n23 of CL (e.g. velum)-- as well as the names of the classes of speech sounds that are\nalso given in that figure (e.g. dentals). Basically...memorize that figure!\n- Be able to transcribe English words into IPA. If you attended class this week,\nattend recitation, and do the various assignments and practice exercises you will be\ngiven, you will do fine. During the quiz, I will read through the list of English words\ntwice in front of the whole class (or play a recording), to put native and non-native\nspeakers of English among you on an equal footing. You should transcribe the words\nas you hear them!\n- There are some topics covered in the book that we will not have discussed in class\n(such as tone and suprasegmental). They will not be covered on the quiz.\nThe IPA symbols you need to be able to identify and to use correctly in transcribing\nEnglish words into/out of IPA:\n- Vowels: The English vowels and diphthongs in figure 2.9, p. 37.\n- Consonants: The English consonants in figure 2.12 on p. 33 plus [ɸ], [β], [x] and\n[γ].\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "24.900 Intro to Linguistics: Syntax Quiz Practice Trees",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/0c07511197c7b7d6d42d343ae1d4c0bc_MIT24_900F12_SntxPracTree.pdf",
      "content": "Draw a tree for the following sentences. If any instances of movement are involved, indicate with arrows.\n\n1. The evil opponent of the plan will claim that the large small eagle is depending on the broken\nmachine.\n\n2. The man near her has arranged for Mary to visit a zoo.\n\nAlso: Her and Mary may be coreferent. Why?\n\n3. Which sad friend will the gullible rodent depend on?\n\nanswers on next page\n\n1.\n\nComment: A more finicky tree in the style of the textbook would include non-branching nodes\nso that every phase has a distinct Xo, X' and XP level, e.g.\nFor quiz and pset purposes, we will not ask you to do this -- but if you do follow the book, that's\nfine too.\n\n2.\n\nHer and Mary may corefer because her does not c-command Mary. How do we know? The node\nthat immediately dominates the NP her is the PP near her -- which does not dominate Mary.\n\nComment on Mary and on zoo: see the comment on the previous tree. It is ok to omit non-\nbranching nodes that the textbook would include (e.g. an N' immediately dominating Mary and\nzoo).\n\nPuzzled by for as a complementizer? Read the posted lecture notes.\n\nComment: In class on Wednesday, I didn't quite get to tell you where I ends up when it lands in\nC. This tree gives you an answer.\n3.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "24.900 Intro to Linguistics: Syntax Quiz Study Guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/6a338ecc764b5c300983b375a3b6030a_MIT24_900F12_SntxQzGuide.pdf",
      "content": "Syntax quiz study guide\nThis will be quite straightforward and shorter than the phonetics quiz, probably just 20-30\nminutes.\n1. You will be asked to draw 3 or 4 trees:\n- All or most will be English. Depending on what I get to on Wednesday of this week, one or\nmore may involve an instance of movement (such as wh-movement).\n- One may be Japanese, straight from the class lecture notes. You might want to practice doing\nthis. It might even be a big tree, with an embedded CP.\n2. You may be asked to explain Chomsky's sisterhood condition on subcategorization -- what he\ngot right and what he got wrong -- and its significance.\n3. You may be asked to indicate the heads of various phrases and give a reason or two why you\nmight think they are the heads. (Basically, you will want to say something about\nsubcategorization and something about head-initial vs. head-final languages.)\n4. You may be asked a question about FOFC.\n5. You may be asked a question about Principle C and c-command.\nPractice sentences? Next Saturday, I will post a few sentences for you to practice tree-drawing\non, with answers. I will post it earlier if I can, but no guarantees for earlier than Saturday.\nReason for the quiz: This is not a quiz about independent thinking or problem solving. Like\nthe phonetics quiz, it is mainly a device to make sure you acquire the basic tools for syntactic\nanalysis, so you can use them for more complex stuff to follow.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Notes: Historical Change",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/28157fa65cea5360391415fc563f4531_MIT24_900F12_HistoriclChan.pdf",
      "content": "Historical Change\n\nSir William Jones\n(1746-1794)\nThis image is in the public domain. Source: Wikipedia.org.\n\nT\nhe Sanskrit language, whatever be its antiquity, is of a\nwonderful structure; more perfect than the Greek, more copious\nthan the Latin, and more exquisitely refined than either, yet\nbearing to both of them a stronger affinity, both in the roots of verbs\nand in the forms of grammar, than could possibly have been\nproduced by accident; so strong indeed, that no philologer could\nexamine them all three, without believing them to have sprung from\nsome common source, which, perhaps, no longer exists: there is a\nsimilar reason, though not quite so forcible, for supposing that both\nthe Gothic and the Celtic, though blended with a very different idiom,\nhad the same origin with the Sanskrit; and the old Persian might be\nadded to the same family, if this were the place for discussing any\nquestion concerning the antiquities of Persia.\nSIR WILLIAM JONES\nTHE THIRD ANNIVERSARY DISCOURSE, ON THE HINDUS\nDelivered 2 February, 1786, to the Royal Asiatick Society\n\nSanskrit Greek\nLatin\nGothic Old\nIrish\nLithuanian Old\nChurch\nSlavonic\nBasque\nHungarian Turkish\n1.\nekas\nhei:s\nu:nus\nains\noin\nvienas\njedinu\nbat\negy\nbir\n2.\ndvau\nduo:\nduo\ntwai\nda\ndu\nduva\nbi\nketto\niki\n3.\ntrayas\ntrei:s\ntre:s\nθreis\ntri\ntry:s\ntrije\nhiru\nharom\nuc\n4.\ncatva:ras tettares quattuor fidwor cethir\nketuri\ncetyre\nlau\nnegy\ndort\n5.\npanca\npente\nquinque fimf\ncoic\npenki\npeti\nbost\not\nbes\n6.\nsat\nhex\nsex\nsaihs\nse\nsesi\nsesti\nsei\nhat\naltɪ\n7.\nsapta\nhepta\nseptem\nsibun\nsecht n\nseptyni\nsedmi\nzazpi\nhet\nyedi\n8.\nastau\nokto:\nocto:\nahtau\nocht n\nastuoni\nosmi\nzortzi\nnyolc\nsekiz\n9.\nnava\nennea\nnovem\nniun\nnoi n\ndevyni\ndeveti\nbederatzi kilenc\ndokuz\n10. dasa\ndeka\ndecem\ntaihun deich n de:seimt\ndeseti\nhamar\ntiz\non\nWhich of these languages are related?\n\nThis image is in the public domain. Source: Wikipedia.org.\nJacob Grimm\n\nJacob Grimm formulates \"Grimm's Law\".\nGrimm's law describes a regular correspondence between\nthe stop consonants of:\nLatin, Greek and Sanskrit\nand the consonants of the\nGermanic languages.\n\nLatin\nGreek\nEnglish\np~f ped-e\npod-e\nfoot\npisc-is\nfish\npyr\nfire\npater\npater\nfather\nLatin\nb~p labium\nGreek\nEnglish\nlip\nd~t\nduo\ndecem\ntwo\ndeka\nten\ng~k genu\ngno-sco\nknee\nknow\nt~θ tres\ntreis\nthree\ndent-e\ndont-e\ntooth\nk~h cord-e\nkard-ion heart\ncan-e\nkuon\nhound\ncannabis kannabis hemp\ncornu\nhorn\ncentum\nhekaton hundred\nph~b fer-o\nfrater\npher-o\nbear\nphrater\nbrother\nth~d\nvidua\nerythr-os\nred\n(w)eitheos widow\ngh~g hostis\nguest\n\nReality check:\nwe know these languages are all related:\nFrench\nItalian\nSpanish\nPortuguese\ncher\ncaro\ncaro\ncaro\nchamp\ncampo\ncampo\ncampo\nchandelle candela\ncandela\ncandeia\n(French ch is ʃ)\nand a regular sound law does distinguish French from the others!\n\nTwo lexical items that share a common ancestor are called\ncognates.\nFrench\nItalian\nSpanish\nPortuguese\ncher\ncaro\ncaro\ncaro\n\"French cher and Italian caro are cognates\"\n\nSome Indo-European languages\nAlbanian: Geg, Tosk dialects\nArmenian\nBalto-Slavic:\nBaltic: Latvian, Lithuanian\nSlavic: East (Russian, Ukrainian, Byelorussian), West (Czech, Slovak,\nPolish, Sorbian/Wendish, Old Prussian), South (Bulgarian, Macedonian,\nSerbo-Croatian, Slovenian)\nCeltic: Brythonic: Welsh, Breton, Cornish Goidelic: Irish, Scottish Gaelic, Manx\nContinental: Gaulish\nGermanic: Gothic\nScandinavian: Icelandic, Faroese, Norwegian, Danish, Swedish\nWest Germanic: German, Dutch, Frisian, English, Afrikaans, Yiddish\nHellenic: Greek\nAnatolian: Hittite, Luwian, Lydian, Carian, Palaic\nIndo-Iranian:\nIranian: Farsi [Persian], Pashto [Afghanistan], Kurdish\nIndic: Hindi-Urdu, Bengali, Punjabi, Marathi, Gujarati, Romany\nItalic: Ancient: Latin, Oscan, Umbrian.\nModern (= Romance) Spanish, Portuguese, Catalan, French,\nOccitan, Provencal, Romansch, Sardinian, Italian, Romanian, Haitian\nTocharian: Tocharian A, B\n\nIndo-European languages spoken here (non-gray)\nImage removed due to copyright restrictions. To see an Indo-European language\nmap, please go to: https://www2.bc.edu/~stantoro/en307/handouts/ie.htm.\n\nAll languages change:\n1. lexicon (all fields of the database)\n2. phonology\n3. morphology\n3. syntax\nRelatedness is best established on the basis of the lexicon:\no Because there are an unbounded number of possible words, finding the\nsame sets of words in multiple languages is low-probability. Also: UG\ndoesn't say anything (as far as we know) about the sound-meaning\ncorrespondences in lexical entries except that they exist.\no UG limits the range of variation among syntactic systems. There is a\nsubstantially smaller number of possible syntactic systems, so finding the\nsame syntax in multiple languages is higher-probability. Recall the\ndiscussion of V2 on four continents.\n\nBut be careful!\n\nA sound-change in Italian\nLatin\nItalian\n1. flamma fjamma 'flame'\n9. kla:ma:re kjamare 'shout' (L),\n'name' (I)\n2. flokkus fjokko 'flock of wool' 10. kla:rus\nkjaro\n'clear' (L),\n'bright' (I)\n3. flumen\nfjume\n'river'\n11. ekkle:sia\nkjeza\n'assembly'(L),\n'church' (I)\n4. ple:nus pjeno\n'full'\n12. klawstrum kjostro 'enclosure'\n5. plakere pjatʃere 'please'\n13. klawdere kjudere 'close'\n6. plumbus pjombo 'lead' (= Pb)\n14. glakies\ngjatʃio\n'ice'\n7. plu:ma\npjuma 'feather'\n15. glu:to(ne) gjottone 'glutton'\n8. klawis\nkjave\n'key'\n\n(Same chart in Latin and Italian orthography)\nLatin\nItalian\n1. flamma fiamma 'flame'\n9. clamare\nchiamare 'shout' (L),\n'name' (I)\n2. floccus fiocco 'flock of wool' 10. clarus\nchiaro\n'clear' (L),\n'bright' (I)\n3. flumen\nfiume\n'river'\n11. ecclesia\nchiesa\n'assembly'(L),\n'church' (I)\n4. plenus\npieno\n'full'\n12. claustrum chiostro 'enclosure'\n5. placere piacere 'please'\n13. claudere chiudere 'close'\n6. plumbus piombo 'lead' (Pb)\n14. glacies\nghiaccio 'ice'\n7. pluma\npiuma 'feather'\n15. gluto(ne) ghiottone 'glutton'\n8. clavis\nchiave 'key'\n\nA sound-change in Italian\nLatin\nItalian\n1. flamma fjamma 'flame'\n9. kla:ma:re kjamare 'shout' (L),\n'name' (I)\n2. flokkus fjokko 'flock of wool' 10. kla:rus\nkjaro\n'clear' (L),\n'bright' (I)\n3. flumen\nfjume\n'river'\n11. ekkle:sia\nkjeza\n'assembly'(L),\n'church' (I)\n4. ple:nus pjeno\n'full'\n12. klawstrum kjostro 'enclosure'\n5. plakere pjatʃere 'please'\n13. klawdere kjudere 'close'\n6. plumbus pjombo 'lead' (= Pb)\n14. glakies\ngjatʃio\n'ice'\n7. plu:ma\npjuma 'feather'\n15. glu:to(ne) gjottone 'glutton'\n16. plakare\n17. floridus\nplakare\n'calm'\n8. klavis\nkjave\n'key'\nflorido\n'flowery'\n\nA sound-change in Italian\nLatin\nItalian\n1. flamma fjamma 'flame'\n9. kla:ma:re kjamare 'shout' (L),\n'name' (I)\n2. flokkus fjokko 'flock of wool' 10. kla:rus\nkjaro\n'clear' (L),\n'bright' (I)\n3. flumen\nfjume\n'river'\n11. ekkle:sia\nkjeza\n'assembly'(L),\n'church' (I)\n4. ple:nus pjeno\n'full'\n12. klawstrum kjostro 'enclosure'\n5. plakere pjatʃere 'please'\n13. klawdere kjudere 'close'\n6. plumbus pjombo 'lead' (= Pb)\n14. glakies\ngjatʃio\n'ice'\n7. plu:ma\npjuma 'feather'\n15. glu:to(ne) gjottone 'glutton'\n8. kla:vis\nkjave\n'key'\n16. pla:kare\nplakare\n'calm'\n17. floridus\nflorido\n'flowery'\n18. albus\n19. servus\nbjanko\n'white'\nskjavo\n'slave'\n\nWhich two languages are related?\nA\nB\nC\n'two'\ner\nerku\nduo\n\nWhich two languages are related?\nMandarin ✓Armenian ✓Greek\n'two'\ner\nerku\nduo\n\"Looking similar\" is neither necessary nor sufficient to\nestablish a genetic relationship.\n\nProto-Indo-European *dw > Armenian erk\nArmenian Greek\n'two' erku\nduo\n'fear' erki\ndwi\n'long' erkar\ndwa:ron\n\nMbabaram\nEnglish\ndog < *gudaga\nYidin gudaga\nDyirbal guda\ndog < OE docga\n'mastiff'\n\"Looking similar\" is neither necessary nor sufficient to\nestablish a genetic relationship.\n\nMbabaram English\ndog\ndog\nPersian\nEnglish\nbad\nbad\nMalay\nGreek\nmata 'eye'\nmati 'eye'\n\nEnglish Kaqchikel\nmess\nmes\nman\naci\nmouse\nc'oy\nmoon\nqatiʔt\n\nProto-World?\nmaliq'a 'swallow' (Ruhlen & Greenberg)\nArabic\nm-l-j\n'suckle'\n(Afro-Asiatic)\nEnglish\nmɪlk\n'milk'\n(Indo-European)\nSaami\nmielga 'breast'\n(Finno-Ugric)\nTamil\nmelku\n'chew'\n(Dravidian)\nYupik\nmelug-\n'suck'\n(Eskimo-Aleut)\nKutenai u'mqolh 'swallow' (Almosan)\nTfaltik\nmilq\n'swallow' (Penutian)\nAkwa'ala milqi\n'neck'\n(Hokan)\nCuna\nmurki\n'swallow' (Chibchan)\nQuechua malq'a\n'throat'\n(Andean)\n\nFalse cognates:\nEnglish have\nLatin habere\nIn fact:\nEnglish have is related to Latin capere 'take'\nby a known sound law -- called...\n\nFalse cognates:\nEnglish fuck\nLatin futuere\nIn fact, Germanic *fuk- is probably from earlier\n*pug- (*peig-) by Grimm's law\n(and may be related to Latin pug- 'fight' though opinions differ)\n\nSound-Meaning correspondences are themselves unstable:\nOE (ge)bed 'prayer'\n> ModE bead\nOE steorfan 'die' (cf. German sterben)\n> ModE starve\nOE cniht 'servant'\n> ModE knight\n\nSound-Meaning correspondences are themselves unstable:\nLatin niger, nigra, etc. 'dark-colored', 'black >\nFr. negre 'black man' >\nHaitian Creole neg 'man'\n\nTraditional dates for the history of English\nOld English (Anglo-Saxon): 450-1100\nMiddle English:\n1100-1500\nModern English:\n\nfæder ure þu þe eart on heofonum si þin nama\ngehalgod tobecume þin rice gewurþe þin willa on\neorðan swa swa on heofonum urne\ngedæghwamlican hlaf syle us to dæg and forgyf us\nure gyltas swa swa we forgyfað urum gyltendum and\nne gelæd þu us on costnunge ac alys us of yfele\nsoþlice.\n\nOld English (West Saxon Gospels, 10th C.)\n9. fæder ure þu þe eart on heofonum\n10.si þin nama gehalgod tobecume þin rice gewurþe þin willa on eorðan swa swa on\nheofonum\n11.urne gedæghwamlican hlaf syle us to dæg\n12.and forgyf us ure gyltas swa swa we forgyfað urum gyltendum\n13.and ne gelæd þu us on costnunge ac alys us of yfele soþlice.\nMiddle English (Wycliff 1380)\n9. Oure fadir þat art in heuenes halwid be þi name;\n10.þi reume or kyngdom come to be. Be þi wille don in herþe as it is doun in heuene.\n11.yeue to us today oure eche dayes bred.\n12.And foryeue to us oure dettis þat is oure synnys as we foryeuen to oure dettouris\nþat is to men þat han synned in us.\n13.And lede us not into temptacion but delyuere us from euyl.\nEarly Modern English (King James 1611)\n9. Our father which art in heauen, hallowed be thy name.\n10.Thy kingdom come. Thy will be done in earth as it is in heauen.\n11.Giue us this day our daily bread.\n12.And forgiue us our debts as we forgiue our debters.\n13. And lead us not into temptation, but deliuer us from euill. Amen.\n\nOld English: 450-1100\nVerb-second/head-final\nþæt hus\nhæfdon Romane to\nðæm anum tacne geworht\nthat building had\nRoman with the\none\nfeature constructed\n(WIIom 6.52)\n...but subject pronouns precede the finite verb and do not\nnecessarily count for verb-second purposes:\nscortlice ic hebbe nu\ngesæd ymb þa þrie dælas...\nbriefly\nI have now spoken about the three parts\n(Or 0.18)\n\nOld English: 450-1100\nThree genders (masculine, feminine, neuter)\nNouns marked for case (subject, object, etc.)\nMasculine\n'fox'\nFeminine\n'learning'\nNeuter\n'animal'\nMasculine\n'foot'\nSINGULAR\nsubject\nobject\npossessive\nindirect obj\nPLURAL\nsubj/obj\npossessive\nindirect obj\nfox\nfox\nfox-es\nfox-e\nfox-as\nfox-a\nfox-um\nlar\nlar-e\nlar-e\nlar-e\nlar-a\nlar-a\nlar-um\ndeor\ndeor\ndeor-es\ndeor-e\ndeor\ndeor-a\ndeor-um\nfot\nfot\nfot-es\nfet\nfet\nfot-a\nfot-um\n\nMiddle English: 1100-1500\nLoss of verb-second, and rise of V-to-I movement...\nþe barnis þat ere yunge þat vnderstandis noht __\nthe children that are young that understand not\nwhat paine\nfallis til cursing\nwhat punishment falls to cursing\n\n...which is a feature of (surprise, surprise!) French!\nPierre ne-parle pas\n__ francais\nPierre ne-speaks\nnot\nFrench\n\nIP\nNP\nI\nV+I\nVP\npas\nV'\n'not'\nNP\nMiddle English: 1100-1500\n\nCase-marking gradually lost.\nMasculine\n'fox'\nFeminine\n'learning'\nNeuter\n'animal'\nMasculine\n'foot'\nSINGULAR\nsubj/obj\npossessive\nindirect obj\nPLURAL\nsubj/obj\nposs/ind.obj.\nfox\nfoxes\nfox-(e)\nfox-es\nfox-es\nloor\nloor-(e)\nloor-(e)\nloor-e\nloor-e\ndeer\ndeer-es\ndeer-(e)\ndeer\ndeer-(e)\nfoot\nfoot-es\nfoot\nfeet\nfoot-(e)\ncompare Old English:\nPLURAL\nsubj/obj\npossessive\nindirect obj\nfox-as\nfox-a\nfox-um\nlar-a\nlar-a\nlar-um\ndeor\ndeor-a\ndeor-um\nfet\nfot-a\nfot-um\n\nWhan that Aprille, with hise shoures soote,\nThe droghte of March hath perced to the roote\nAnd bathed every veyne in swich licour,\nOf which vertu engendred is the flour;\nWhan Zephirus eek with his swete breeth\nInspired hath in every holt and heeth\nThe tendre croppes, and the yonge sonne\nHath in the Ram his halfe cours yronne,\nAnd smale foweles maken melodye,\nThat slepen al the nyght with open eye\n\nSo priketh hem Nature in hir corages --\nThanne longen folk to goon on pilgrimages\nAnd palmeres for to seken straunge strondes\nTo ferne halwes, kowthe in sondry londes;\nAnd specially, from every shires ende\nOf Engelond, to Caunturbury they wende,\nThe hooly blisful martir for to seke\nThat hem hath holpen, whan that they were seeke...\n[Geoffrey Chaucer, Canterbury Tales, ca. 1385-1400]\n\nModern English\nLoss of V-to-I movement, still alive in Shakespeare:\nHe heard not __ that.\nI care\nMy master seeks not __ me.\nnot __ for her.\nDemetrius loves her and he loves not __ you.\n\nV-to-I movement is not completely dead even in Modern English:\n\"Ask not what your country can do for you; ask what you can do for your\ncountry\"\n\n...AND NOW...\n\nTHE G R E A T\n\nVOWEL\n\nSHIFT\n\nImage removed due to copyright restrictions. To see a graphic of the Great Vowel Shift,\nplease go to: http://users.ipfw.edu/thompsoc/LingL103/overheads/vowelshift.gif.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Notes: Historical Linguistics Summary",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/763f545266e2fd8dd3d424c368785ba8_MIT24_900F12_HisLingsumary.pdf",
      "content": "24.900 2011\nHistorical Change summary\n1.\nLanguage acquisition is surprisingly perfect...\n\"Plato's Problem\" (a term from Chomsky):\n- What's in the stimulus?\na) acoustic continuum between phonemes\nb) no chanting of the phonemic inventory or list of phonological rules\nc) no morpheme boundaries\nd) no word boundaries\ne) no syntactic trees\nf) no indices indicating coreference\n- How do we know so much, when we had so little evidence for this knowledge?\n- Answer: much of our linguistic knowledge is innate. (Universal Grammar)\no knowledge of the phonetic boundaries\no a drive to discover word boundaries, a drive to build a lexicon\no a drive to place phrase boundaries, innate knowledge of possible syntaxes\no innate knowledge of Principle C, compositional semantics etc.\n2.\n...but also unsurprisingly imperfect!\n- Still -- it's not surprising that learning might not be perfect even if input is perfect.\nImperfect learning should still deposit the child's knowledge of language within the\nboundaries of UG. Result: variation.\n- Also: language contact produces situations where a child's input might be diverse --\nnative speakers, non-native speakers. Result: variation.\n- In a random walk of variation, the variant adopted by the majority of speakers may be\ndifferent at different times. Result: linguistic change.\n- The course of linguistic change may be different in different speech communities that\nwere united but have since been separated. Result: dialect/language distinctions\nTwo speech communities that have seen a modest amount amount of distinct paths of\nlinguistic change are commonly said to speak dialects of the same language.\nBut: Dialect, language, even speech community are imprecise concepts. The important\npoint is that each of us speaks a dialect of a language.\nIt's not the case that some of us speak a language, and others a dialect. That usage is just\npropaganda:\n- An expectation: linguistic change is always grammatical change or lexical change. It\nshould reflect the structure of grammar and the nature of the lexicon.\n- Grammatical change should look orderly: new phonological rules entering the\nlanguage, old rules reordered, systematic changes in choices from the \"syntactic\nmenu\". Yes!\n- Uses of this fact:\no Understanding how a language whose history is recorded evolved over time.\no Understanding current linguistic change.\n- Figuring out whether two languages are related. But what does this mean?\nSomething like:\nOnce upon a time there was a speech community sharing a fairly uniform grammar\nthat we can call the proto-language that was the ancestor of modern languages X\nand Y.\nHistorical change produced dialects of the protolanguage. These dialects themselves\nproduced dialects, the process iterating until we reach a period where X and Y are two\nof the dialects that can trace their ancestry to the protolanguage.\n3.\nIndo-European\n[See textbook pp. 285-288 and 319-327.]\nCase in point: a large group of languages spoken in Europe and Central Asia are related,\nstemming from a proto-language called Indo-European.\nThe discovery of Indo-European\nSir William Jones\n(1746-1794)\n\"A language is a dialect with an army and a navy.\" -Uriel Weinreich (famous linguist)\nThis image is in the public domain.\nSource: Wikimedia Commons.\n\n-2\n\"The Sanskrit language, whatever be its antiquity, is of a wonderful structure;\nmore perfect than the Greek, more copious than the Latin, and more exquisitely\nrefined than either, yet bearing to both of them a stronger affinity, both in the\nroots of verbs and in the forms of grammar, than could possibly have been\nproduced by accident; so strong indeed, that no philologer could examine them all\nthree, without believing them to have sprung from some common source, which,\nperhaps, no longer exists: there is a similar reason, though not quite so forcible, for\nsupposing that both the Gothic and the Celtic, though blended with a very\ndifferent idiom, had the same origin with the Sanskrit; and the old Persian might\nbe added to the same family, if this were the place for discussing any question\nconcerning the antiquities of Persia.\"\nSIR WILLIAM JONES\nTHE THIRD ANNIVERSARY DISCOURSE, ON THE HINDUS\nDelivered 2 February, 1786, to the Royal Asiatick Society\n- William Jones' observation was informal, and we can make a similar observation for\nourselves, just by eyeballing relevant data. For example, the words for the first ten\nnumbers strongly suggest that Sanskrit, Greek, Latin, Gothic, Old Irish, Lithuanian,\nand Old Church Slavonic share a common ancestor -- but Basque, Hungarian and\nTurkish do not share that common ancestor. (My apologies for the small font size.)\n(1) Numerals 1-10. Which languages are related?\nSanskrit\nGreek\nLatin\nGothic\nOld Irish\nLithuanian\nOld Church\nSlavonic\nBasque\nHungarian\nTurkish\n1. ekas\nhei:s\nu:nus\nains\noin\nvienas\njedinu\nbat\negy\nbir\n2. dvau\nduo:\nduo\ntwai\nda\ndu\nduva\nbi\nketto\niki\n3. trayas\ntrei:s\ntre:s\nθreis\ntri\ntry:s\ntrije\nhiru\nharom\nuc\n4. catva:ras\ntettares\nquattuor\nfidwor\ncethir\nketuri\ncetyre\nlau\nnegy\ndort\n5. panca\npente\nquinque\nfimf\ncoic\npenki\npeti\nbost\not\nbes\n6. sat\nhex\nsex\nsaihs\nse\nsesi\nsesti\nsei\nhat\naltɪ\n7. sapta\nhepta\nseptem\nsibun\nsecht n\nseptyni\nsedmi\nzazpi\nhet\nyedi\n8. astau\nokto:\nocto:\nahtau\nocht n\nastuoni\nosmi\nzortzi\nnyolc\nsekiz\n9. nava\nennea\nnovem\nniun\nnoi n\ndevyni\ndeveti\nbederatzi\nkilenc\ndokuz\n10 dasa\ndeka\ndecem\ntaihun\ndeich n\nde:seimt\ndeseti\nhamar\ntiz\non\nCognate: a word in a language X that is hypothesized to share a common origin with\na different word in language Y.\n- So Sanskrit dvau 'two' and Greek duo: 'two' are cognates.\n- But simple identification of words that look similar (what I was calling \"eyeballing\") is\nnot enough to establish that two languages are related according to this scenario:\n1822: Jacob Grimm formulates \"Grimm's Law\", which describes a regular correspondance\nbetween the stop consonants of Latin, Greek and Sanskrit and consonants in\nGermanic languages. Pay particular attention to p>f, t>θ and k>h (the most famous\ncases -- final exam fodder):\n(2) Grimm's law\nLatin\nGreek\nEnglish\nLatin\nGreek\nEnglish\np~f\nped-e\npod-e\nfoot\nb~p\nlabium\nlip\npisc-is\nfish\nd~t\nduo\ntwo\npyr\nfire\ndecem\ndeka\nten\npater\npater\nfather\ng~k\ngenu\ngno-sco\nknee\nknow\nt~θ\ntres\ndent-e\ntreis\ndont-e\nthree\ntooth\nk~h cord-e\nkard-ion\nheart\nph~b fer-o\npher-o\nbear\ncan-e\nkuon\nhound\nfrater\nphrater\nbrother\ncannabis kannabis hemp\nth~d\nerythr-os\nred\ncornu\ncentum\nhekaton\nhorn\nhundred\nvidua\n(w)eitheos widow\ngh~g hostis\nguest\n- Reality check: Do regular sound correspondences result from historical change? Look\nfor cases where we know the languages are related. We do indeed see the regular\nsound correspondences that we expect to find:\n(3) We know these languages are related!\nFrench\nItalian\nSpanish\nPortuguese\ncher\ncaro\ncaro\ncaro\nchamp\ncampo\ncampo\ncampo\nchandelle\ncandela\ncandela\ncandeia\nNote: French written \"ch\" is [ʃ].\nHere's a partial list of Indo-European languages:\n\n(4)\nSome Indo-European languages (incomplete list)\nAlbanian: Geg, Tosk dialects\nArmenian\nBalto-Slavic:\nBaltic: Latvian, Lithuanian\nSlavic: East (Russian, Ukrainian, Byelorussian), West (Czech,\nSlovak, Polish, Sorbian/Wendish, Old Prussian), South (Bulgarian,\nMacedonian, Serbo-Croatian, Slovenian)\nCeltic:\nBrythonic: Welsh, Breton, Cornish\nGoidelic: Irish, Scottish Gaelic, Manx\nContinental: Gaulish\nGermanic:\nEast Germanic: Gothic\nScandinavian: Icelandic, Faroese, Norwegian, Danish, Swedish\nWest Germanic: German, Dutch, Frisian, English, Afrikaans,\nYiddish\nHellenic: Greek\nAnatolian: Hittite, Luwian, Lydian, Carian, Palaic\nIndo-Iranian:\nIranian: Farsi [Persian], Pashto [Afghanistan], Kurdish\nIndic: Hindi-Urdu, Bengali, Punjabi, Marathi, Gujarati, Romany\nItalic: Ancient: Latin, Oscan, Umbrian.\nModern (= Romance) Spanish, Portuguese, Catalan, French, Occitan,\nProvencal, Romansch, Sardinian, Italian, Romanian, Haitian\nTocharian: Tocharian A, Tocharian B\n4.\nFun Facts about the Indo-Europeans that I crazily forgot to tell you\n1. They had domesticated animals. Evidence: cognate words for dog *kwon, horse *ekwo,\ncow *gwow and pig *suH. [asterisk = hypothesized form in Proto-Indo-European]\n2. They had grain. Evidence - cognate words *yewo\n3. They had the wheel: *kwekwlo (cf. Greek kuklos, from which cycle is borrowed)\n4. They had bee-keeping, since they have cognate words for honey: *melit\n5. Numbers up to 100, but not 1000.\n-3\n- Most experts think: the parent language split well before 2000 BC.\n- Possible homesite: \"Kurgan culture\" east of the Dniepr river, modern-day Ukraine.\nBut there is hot debate about this. See, for example, a long series of blog postings in\nreply to an article in Nature here:\nhttp://geocurrents.info/cultural-geography/linguistic-geography/mismodeling-indo\neuropean-origin-and-expansion-bouckaert-atkinson-wade-and-the-assault-on\nhistorical-linguistics\n- Spread west around 4000-3500 BC; in Northern Iran 3500-3000BC; entered Greece,\nItaly, Western Europe 3500 BC. [speculation: do not memorize]\n5.\nGood and Bad methods in historical linguistics\nAll languages change, and change is found in all branches of language:\n- 1. lexicon: new words, borrowing\n- 2. phonology: new rules, loss of old rules\n- 3. morphology: new morphemes\n- 3. syntax: changes in parameter settings, kinds of movement, etc.s\nRelatedness is best established on the basis of the lexicon, not syntax:\no Because there are an unbounded number of possible words, finding the\nsame sets of words in multiple languages is low-probability.\no There is a substantially smaller number of possible syntactic systems, so\nfinding the same syntax in multiple languages is higher-probability: recall\nthe V2 example.\nBut we should be careful. Processes like borrowing complicate the picture:\n(5) A sound change in the history of Italian\nLatin\nItalian\n1. flamma\nfjamma 'flame'\n9.\nkla:ma:re\nkjamare 'shout' (L),\n'name' (I)\n2. flokkus\nfjokko\n'flock of wool' 10. kla:rus\nkjaro\n'clear' (L),\n'bright' (I)\n3. flumen\nfjume\n'river'\n11. ekkle:sia\nkjeza\n'assembly'(L),\n'church' (I)\n4. ple:nus\npjeno\n'full'\n12. klawstrum kjostro\n'enclosure'\n5. plakere\npjatʃere 'please'\n13. klawdere\nkjudere\n'close'\n6. plumbus pjombo 'lead' (= Pb)\n14. glakies\ngjatʃio\n'ice'\n7. plu:ma\npjuma\n'feather'\n15. glu:to(ne)\ngjottone 'glutton'\n8. klavis\nkjave\n'key'\n16. plakare\nplakare\n'calm'\n17. floridus\nflorido\n'flowery'\n\n- Example (5) shows a rule \"l→j / C_V\" entering, then leaving the language.\n- Some words (biancho, schiavo) were borrowed from other languages (Germanic and\nSlavic [via Greek], respectively) while this rule was active. Others (florido, placare)\nwere borrowed once the rule had left the language.\n- The rule left the language once its effects were no longer transparent to a language-\nlearning child.\nAnd there are many ways to go wrong when doing historical linguistics.\n(6)\nWhich two languages are related?\nA\nB\nC\n'two'\ner\nerku\nduo\n- Answer: B (Armenian) and C (Greek).\n- \"Looking similar\" is neither necessary nor sufficient to establish a genetic relationship\namong languages. In fact (and this is indeed weird), Armenian systematically shows\n[erk] where Proto-Indo-European is hypothesized to have shown [dw]:\n(7)\nArmenian-Greek sound correspondences\nArmenian\nGreek\n'two'\nerku\nduo\n'fear'\nerki-\ndwi\n'long'\nerkar\ndwa:ron\n- In class, we saw a number of examples of \"false cognates\", just to warn you against\naccepting theories of historical relatedness on the basis of \"eyeballing\". For example:\nMbabaram dog 'dog' vs. English dog 'dog' -- where we know the languages are\nunrelated, and Mbabaram dog is a cognate with words in nearby languages that have\nan additional first syllable lost in Mbabaram: Yidin gudaga and Dyirbal guda. (You\ncan find more information about these languages on the web.)\nAnd then you were further warned against \"mass comparison\" of lexical items that\nlook alike and have vaguely similar meaning. That was the big slide (which I won't\nreproduce here) with words for 'milk', 'suck', 'chew', 'breast', 'neck', 'throat' etc. -- all of\nwhich have an initial [m] (maybe onomatopeic, as some of you remarked) followed by\nan [l] somewhere and a velar or uvular consonant.\n6.\nHistory of English\nOld English: 450-1100 AD\nLanguages spoken in present-day England were very much Germanic in appearance.\nSOV, verb-second, case-marked noun phrases [see overheads]\n-4\nMiddle English: 1100-1500\n[1066 - Norman invasion of England, England under French domination]\nLoss of verb-second, case-marking, V-to-I\nFrench influence on lexicon:\n[blue = skipped this in class, alas]\n- pork, beef, veal, mutton, venison (French) vs. swine/sow, cow, calf, sheep, deer\n(Germanic) [see textbook, p. 270, table 7.32]\n- -able (from French)\n- Loss of some words:\nwer 'man' (cf. Latin vir as in English virile) - still found in werewolf\nrice 'domain' (cf. bishopric, German Reich -- related to reach)\n- Meaning change:\nhund 'dog' > hound\ndocga 'mastiff' > dog\n- Sound change:\n1. Loss of [x] (right, night)\n2. Very late in ME period: Great Vowel Shift\n[book, pp. 258-259]\nImage removed due to copyright restrictions. To see a graphic\nof the Great Vowel Shift, please go to: http://users.ipfw.edu/\nthompsoc/LingL103/overheads/vowelshift.gif.\n3. Order of loss of [x] w.r.t. GVS: [x] was lost when GVS was still active, vowel\nlengthened, then GVS applied. Thus: /rixt/ > /ri:t/ > /rajt/.\n\n-5\n-\nSyntactic change: V2 > SVO with V-movement to I (see overheads)\nModern English: 1500-present\n-\nLoss of V-to-I.\n-\nDefinitive loss of case.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Notes: Language Acquisition Summary",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/a1fa3447efa6d4897c6be05dabb98ba8_MIT24_900F12_LanguagAcqsum.pdf",
      "content": "24.900 2012\nAcquisition of Syntax summary\nPoints of interest not covered in class (for reasons of time) are in gray.\n1. Overview of language acquisition\nProduction\n§*\nBabbling:\n6-12 months (roughly)\n§*\n1-word:\n1 yr - 1.5 years\n§*\n2-word:\n1.5 years -2 years*\n§*\ntelegraphic:\n2 years - 2.5\n§*\napproaching adult-like: 2.5-\n*vocabulary spurt! 5-9 new words a day until 6 years old! An average\nAmerican high school senior has been estimated to know about 45,000\nwords.1\n-->There is no 3-word stage!\nPerception/comprehension always ahead of of production.\n§*\nFor example, detectable sensitivity to words and word boundaries from about 10\nmonths. First words appear 1-2 months later.\n§*\nDetectable sensitivity to functional categories in 10-11 month-olds, missing from\nproduction in the second year (work of LouAnn Gerken). For example:\nCritical period: Natural language acquisition process turns off...\n2. Do parents teach children how to speak? -- the central puzzle of language\nacquisition\n§*\nThe puzzle:2 How does the child learn language so quickly, given the complexity of\nthe system and the limited and faulty input.\n§*\nLanguage surrounding the child is error-full, not designed to accomodate the needs of a\nlanguage learner: no word boundaries, no morpheme boundaries, no trees ...\nAnswers\n§*\nDeliberate instruction (behaviorism): rewards and punishments?\n1 Take such numbers with a grain of salt, since the figure includes many morphologically complex words,\nand does not include many morphologically complex words that the average high-school senior easily coins\nand comprehends on the fly. The main point is that the average senior knows lots and lots of words.\n2 To my shock and horror, I realize that I did not mention in class Chomsky's cute term for ths issue:\n\n\"Plato's Problem\", i.e. how we as humans know so much on the basis of so little information from the\noutside world. Every time I have taught 24.900 in the past, I have not neglected this term, and it has always\nbeen a final exam question too! Shame on me ... but to reward those of you who are reading this footnote, it\nmight be on this year's final exam nonetheless.\nYes!-- a behaviorist view: \"In teaching the young child to talk, the formal\nspecifications upon which reinforcement is contingent are at first greatly relaxed.\nAny response which vaguely resembles the standard behavior of the community is\nreinforced. When these begin to appear frequently, a closer approximation is\ninsisted upon. In this manner very complex verbal forms may be reached.\"\n-B.F. Skinner (1957) Verbal Behavior, pp. 30-31\nNo! -- Chomsky's famous reply: \"It is simply not true that children can learn\nlanguage only through 'meticulous care' on the part of adults who shape their\nverbal repertoire through careful differential reinforcement, though it may be that\nsuch care is often the custom in academic families. It is a common observation\nthat a young child of immigrant parents may learn a second language in the\nstreets, from other children, with amazing rapidity, and that his speech may be\ncompletely fluent and correct to the last allophone, while the subtleties that become\nsecond nature to the child may elude his parents despite high motivation and\ncontinued practice.\"\n- N. Chomsky, 1957 review of Skinner's Verbal Behavior\n§*\nImplicit instruction -- motherese?\nChildren whose mothers use Motherese more consistently don't pass through the\nmilestones of language development any faster (Newport, et al, 1977).\nSocieties differ in use of Motherese.\nWarlpiri (central Australia): don't talk to someone who can't talk back.\nRecall our discussion of fuckin' infixation: those rules are not explicitly taught by\nloving parents intent on making sure their children don't say *Massachu-fuckin'-setts\ninstead of the wonderfully correct Massa-fuckin'-chusetts!\n§*\nAcquisition =\nUniversal Grammar (UG) + Experience\nJust as some languages don't occur, some errors are not made by children.\nActually, experience may be overrated as well. Google for discussions of spontaneous\nsign-language creation by children raised without adult sign speakers (so-called \"home\nsign\"), and the story of Nicaraguan Sign language.\nOf course social interaction plays some role in language acquisition. Severe\ndeprivation during the critical period impairs language acquisition.\n§*\nPerception and comprehension always away ahead of production.\nFor example, detectable sensitivity to words and word boundaries appears about 10\nmonths -- but the first produced words appear 1-2 months later.\nDetectable sensitivity to functional categories at 10-11 months -- but missing from\nproduction in the second year.\n\nSkinner, B. F. Verbal Behavior. Copley Publishing Group, 1992.\n(c) Copley Publishing Group. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\nChomsky, Noam. \"A Review of B.F.Skinner's Verbal Behavior .\" Language 35, no. 1 (1959): 26-58.\n(c) Linguistic Society of America. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\n3. Phonetics\n§*\nDiscussed earlier in the course. Infants discriminate the sounds of speech categorially,\nin an adult-like manner, even when the distinctions lie at arbitrary points along an\nacoustic continuum.\n§*\nDistinctions not used in the target language are lost (more accurately: suppressed in\nsome fashion) during the first year of life. See below.\n4. Phonology\nChild's tasks:\n§*\ndetermine the phonemic inventory (underlying segments) of the language\n§*\nbuild the phonological part of the lexicon (underlying representations)\n§*\ndetermine the rule system that relates underlying representations to surface forms\nDetermining phonemic inventory\nProduction:\n4-5 months, some speech sounds.\n6-7 months - \"canonical babbling\" begins.\nBabbling initially contains a wide repertory of speech sounds, and finally zeroes in on the\nspeech sounds of the target language.\n§*\nAround 8-10 months, adults can recognize the target language of a babbling child\n(French, Cantonese, Arabic). By 6 months, Chinese children's babbling contains more\ntonal variation than the babbling of an American child.\n§*\nDeaf children babble vocally as well, though naturally there's no gradual\napproximation to a target language.\n§*\nAlso: gestures analogous to babbling are noted in deaf children learning ASL.\nConclusion: inner biological clock governs onset of babbling; this clock is unaware of\nchild's deafness.\n§*\nJust as spoken language babbling shows properties of the language being acquired, so\ndoes sign language babbling.\nLaura Pettito's work: Hearing children who are acquiring sign (deaf parents) babble\nmanually. You can see the video clip from class, along with a fuller description of this\nwork, at http://petitto.gallaudet.edu/%7Epetitto/archive/nature.html. The other\nmaterials on Pettito's website are worth reading as well.\n-2\n§*\nChildren with tracheostomy surgery that eliminates vocal production do not hear\nthemselves babble. When the tracheostomy hole is closed, there are some delays in\nspeech, but they quickly jump to age-appropriate behavior, skipping various stages.\nConclusion: Babbling is linguistic (not motoric) -- but it is not \"practice\" essential\nfor language acquisition. It is a by-product of the process of language acquisition, not\nan essential building block.\nPerception: During first year, child stops discriminating certain distinctions that are\nnon-phonemic in his/her target language. This parallels the refinement of\nsounds produced in babbling that approximates the target language.\n§*\nFirst words/Production: Not all contrasts made, much individual variation in order\nwith which contrasts appear in production (e.g. alveolar/velar then labial).\nFor example, a typical development of contrasts:\nstage 1: p t-k\nstage 2: p t k\nstage 3: voicing\nstage 4: nasal\nPerception/knowledge lags behind production:\n§*\nChildren know the contrasts that they do not produce/\n§*\nAlso, numerous observations that children do not recognize words produced with\nthe very phonetic changes they put in them. A child who says sip for ship will not\nidentify a sip as something you sail in.\n\nUnderlying representations/rule system\n(1)\nA Japanese child's phonology\nAge 3;2: substitutes [t] for [k] -- but phonological rules that apply to adult [t] only\napply to those [t]'s that really are [t]'s for the adult.\nchild\nadult\ncomment\nmeaning\nmitaŋ\nmikan\nadult [k]->child [t]\n'orange'\npotetto\npoketto\n'pocket'\nneto\nneko\n'cat'\ntama\ntama\nadult [t] stays [t]\n'ball'\nterebi\nterebi\n'TV'\ntobɯ\ntobɯ\n'fly'\nmatʃi\nmatʃi\nt→tʃ /__i\n'city'\ntsɯta\ntsɯta\nt→ts/__ɯ\n'ivy'\nThese rules do not apply to child's [t] that corresponds to adult [k]:\nati\naki\n'fall'\ntɯma\nkɯma\n'bear'\nBut production differences are systematic and linguistic:\nFor example, common to use only initial onset and rhyme of adult production. This\ncreates syllable simplification in monosyllabic words: (bɛd → bɛ). But this simplified\nsyllable is copied (reduplication) in production of a disyllabic word: chicken → [dɪdɪ],\nwater →[wɑwɑ]. The syllable count of the word is preserved, with a morphological\nprocess known in the adult grammar (reduplication) used to create the second syllable.\n5. Lexicon\nDiscerning word-boundaries:\nKids already know more than they say. Work of (the late) Peter Jucszyk and others:\n- In 11-month old, selective looking reveals preference for pauses that coincide\nwith word boundaries over pauses inserted between syllables of words.\n- In 9-month old, no preference.\nSo what happens between 9 and 11? A bootstrapping problem.\nHow do you segment speech into words if you don't know the words?\nNo magic bullet, it seems!\ntwo possibilities:\n-3\nProsodic bootstrapping:\nSome common, but not universal phonological phenomena respect word boundaries.\n§*\nFor example, in French, the final a of panorama is longer than the first a of\nmatimaticien. 3-day old infants can distinguish ma-ti from panorama typique from\nma-ti out of matematricien. So the information, if relevant to guessing word\nboundaries, is perceived... [Mehler et al -- this is a sucking/habituation experiment]\n§*\nAlso, typical stress patterns get noticed. Czech - initial / French - final / Polish\npenultimate. English: 90% of nouns have stressed initial syllables. If a child\nanticipates this sort of regularity, it at least narrows hypotheses... In a 1993 study\nby Juszyk, Cutler and Redanz, 9-month old American infants listened longer to\nwords with initial stress than to other words. No such difference among 6-month\nolds.\n§*\nMaybe these features are exaggerated in production by parents (motherese)?\nStatistical bootstrapping\nSequences of syllables that overlap word boundaries are often less likely than sequences of\nsyllables within words, simply because it's words that are being learned.\n- pretty baby: [tibej] (pret-ty ba-by) less common because it's not a word. If kids\nare sensitive to these probabilities, they can form hypotheses about word/non\nword on the basis of these probabilities.\n- Computer corpus analysis does fairly well (emphasize \"fairly\") finding word\nboundaries this way. Do babies do this too? Perhaps.\n6. Morphology\nChild's tasks:\n§*\ndetermine the morphemes/words of the language\n§*\ndetermine the rules that combine morphemes into words\nExample:\nlearn that walked contains two morphemes\nOn the one hand...\n§*\nSome evidence that language acquisition device is \"pretuned\" to pick up\nmorphological patterns.\nThose of you who read the paper by Safran, Aslin & Newport on statistical\nlearning by infants (one of the choices for the first paper) might be interested in\na follow-up by Marcus et al (1999) in Science:\nIn a clever twist on the Saffran et al. experiment, Gary Marcus of NYU and three colleagues\ndid a similar experiment with 7-month old (actually, slightly younger) infants. (Science,\nJanuary 1, 1999). Once again, a two-minute stream of synthesized speech was played to the\ninfants. Once again, the speech stream was composed of three-syllable nonsense words, made\nfrom synthesized speech, with no cues identifying the word boundaries. Once again, the\n\n-4-\nchildren were played different recordings in a later presentation which they could control by\ngazing at or looking away from a blinking light.\n\nThis time, however, the nonsense words in the first presentation were not randomly chosen\nsequences of syllables, but conformed to simple rules, or templates. One group of infants, for\nexample, heard a string of nonsense words in which the second two syllables were identical (ga\nti ti, li na na). Another group heard words in which the first and third syllables were identical\n(ti ga ti, na li na).\n\nThe key recording in the second presentation did not consist this time of the same words\nrearranged, but consisted of entirely new words that followed the same rule as the first set of\nwords. Could infants distinguish new words that followed the rule from new words that did\nnot? Strikingly, they could. The infants preferred novel second presentations over familiar\nsecond presentations. But \"familiar\" here meant -- not containing the same \"words\" -- but\ncontaining new words that followed the old rule. In their words: \"Infants [can] extract abstract\nalgebra-like rules that represent relationships between placeholders (variables), such as \"the\nfirst item X is the same as the third item Y,\" or more generally, that \"item I is the same as item\nJ...In addition to having the capacity to represent such rules, our results appear to show that\ninfants have the ability to extract those rules rapidly from small amounts of input and to\ngeneralize those rules to novel instances.\"\n\nOn the other hand...\n§* Morphological rule learning across the entire language takes a while longer.\nIt's still miraculously fast, but far from instantaneous!\n\nClassic experiment: the \"wug test\". At what age do English-speaking children\nproduce the correct plural endings [-s], [-z] and [-əәz]? Answer: quite early for\n[-s] (cats), and [-z] (dogs), but quite late for the [-əәz] that follows sibilants\n(horses, edges). Testing is done with a mixture of nouns that the children know\nand invented nouns like the now-famous wug:\n\n% correct pre-school answers % correct first- grade answers\nglasses\nwugs\nluns\ntors\nheafs\neras\ntasses\ngutches\nkazhes\nnizzes\n\nNote about 2/3 of the first-graders tested failed to produce adult-like plurals for words that\nend in sibilants. That is very late by the standards of language acquisition experiments!\n\n7. Syntax\n\n(2)\nWhat we find when we carefully study the world's languages\n\nLanguages are not all the same, but the ways in which they differ are highly\nrestricted. The same peculiar bits show up again and again, all over the world.\n\nWhat's the same is called Universal Grammar (UG)\nWhat's different are settings of parameters within UG.\n\nAn acquisition perspective on UG and parameter setting:\n- UG reflects our genetic endowment for language\n- Parameter setting reflects our linguistic experience in early childhood.\n\n- For example, though we don't find verb-second in all the languages of the world,\nwe do find it popping up repeatedly -- as discussed in the syntax lecture notes. On\nthe other hand (I am repeating myself here) there are some types of languages that are\njust as easy to describe in words as the verb-second languages, which we never find:\n\n(3)\nSome languages that don't exist anywhere (as far as we know):\na. Like German, but patterns of embedded and main clause are reversed.\nb. Main verb must follow the second phrase, third phrase, etc.\nc. Not the main verb, but the direct object must follow the first phrase.\n\n- We made a similar point in class when we discussed the relative ordering of heads of\nphrases and their complements. We observed that the relative order of a head and the\nelement that it merges with varies systematically across languages.\n\nWe also observed that postulating a uniform \"head-first/head-last\" parameter across\nThree yellow c\nhicks.\nImage by MIT OpenCourseWare.\n\nentire languages oversimplifies the picture. Certain kinds of mixed languages do exist,\nbut they are restricted by FOFC (the Final-over-Final Constraint). If correct, FOFC is\n(or is a by-product of) a principle of UG -- a principle that restricts the ways in\nwhich languages vary (and restricts the \"search space\" for a child acquiring\nlanguage).\nSome other parameters (and how they are set in a few languages)\n[See Baker's book for much more,]\n1. Subject pro-drop\n(4)\nItalian: +\na. Io parlo italiano\n(I) speak Italian\nb. Noi parliamo italiano\n(we) speak Italian\n(5)\nChinese: +\nTa kanjian\n(he) see\n'He saw him'.\nta le.\nhe LE\n(6)\nEnglish:\n*(We) speak English.\n2. Object pro-drop\n(7)\nChinese: +\nTa kanjian ta\nle.\nhe see (him) LE\n(8)\nItalian:\n*Gianni lo\nvede.\nGianni (him) sees.\n(Object pronouns generally move to the left of I in Italian.)\n(9)\nEnglish:\n*John saw him.\n3.\nPolysynthesis\n(10)\nEnglish: [+ incorporation into N] (and A), but [- incorporation into V]\na, I disapprove of book-burning\nb. A user-friendly computer is a distant goal.\nc. *The baby meat-ate last night.\n-5\n(11)\nMohawk: [+ incorporation intoV]\nOwira'a waha'-wahrake'.\nbaby meat-ate\n(Baker p. 91)\nMohawk:\npolysynthesis (V):\n+\n(\"incorporation\")\nsubject pro-drop:\n+\nobject pro-drop:\n+\n(12)\na. Wa'eksohare'\n'She dishwashed'\nb. Wa'kenaktahninu'\n'I bed-bought.'\nc. Wahana'tarakwetare'\n'He bread-cut.'\nEnglish:\npolysynthesis (V):\n--\nsubject pro-drop:\n--\nobject pro-drop:\n--\n(13)\nThe verb-object constraint\nThe object of a verb must be the first noun (phrase) to combine with the verb; the\nsubject cannot combine with the verb until after the object does.\n(14)\n...in English compounding\na. I disapprove of meat eating in here. (i.e. meat getting eaten)\nb. *I disapprove of baby eating in here. (i.e. babies eating dinner)\n(15)\n...in Mohawk \"incorporation\"\n*Wahawirake' ne o'wahru.\nbaby-ate\nthe meat\n'The baby ate the meat.'\n(compare (11)\nAn acquisition perspective on parameter-setting\n- Early production of complete sentences may show parameters set in a fashion familiar\nfrom languages other than the language that the child is in the process of acquiring.\nExample: pro-drop\nDanish, English and French are not pro-drop languages, but early sentence production\nappears to show selective omission of subject pronouns:\n\n(16)\nEarly pro-drop\na. Danish\nSe, blomster har.\n(Jens, 2;2)\nlook flowers have/has\nb. English\nTickles me.\n(Adam, 3;6)\nc. French\nMange du pain.\n(Gregoire, 2;1)\neat-3sg some bread\nAre young English-speaking children in effect \"speaking Italian\" until they start\nregularly using subject pronouns? Much controversy ...\nWe also saw a video of English-speaking kids \"speaking German\" or \"speaking\nSwedish\" with respect to other phenomena, making the same points.\nAlas, we did not have time for the following discussion, but you may find the topic\ninteresting nonetheless:\n§*\nItalian kids drop subject pronouns much more often than their English-speaking\ncounterparts. So English pro-drop can't just be \"English-speaking children\nspeaking Italian\". There must be a different factor. Possibility: maturation.\n§*\nRoot infinitive stage: Speakers of many languages go through a period in which\nthey use infinitival verbs in main clauses, and these may lack subjects,\n(17)\na. Michel dormir.\n(French: 'Michel sleep-infin,')\nb. Ik ook lezen.\n(Dutch: 'I also read-infin.')\n-6\n(18)\nOptional root infinitive stage\na. Danish\nHun sove.\nshe sleep-INFIN\n(Jens, 2;0)\nb. Dutch\nEarst kleine boekje lezen.\nfirst little book read-INFIN\n(Hein, 2;6)\n'First (I/we) read little book'\nc. French\nDormir petit bebe.\nsleep-INFIN little baby\n'Little baby is sleeping.'\n(Daniel, 1; 11)\nEnglish does not have a specifically infinitive suffix, but the root infinitive state is\nfound among English-speaking children as well -- showing up as missing -s on\nthird-person present-tense verbs. This is not an inability to pronounce the -s, since\nplural and possessive -s is regularly present (with the caveat discussed above in\nconnection with the wug discussion):\n(19)\nEnglish root infinitives\na. Papa have it. (Eve, 1;6)\nb. Cromer wear glasses. (Eve, 2;0)\nc. Marie go. (Sarah, 2;3)\nd. Mumma ride horsie. (Sarah, 2;6)\n§*\nIt has been claimed that \"early pro-drop\" in languages like Dutch or English is\nlargely limited to such root infinitival clauses. Hmm... So is it pro-drop after all.\nAnd if so ...\nSo what about parameter setting? When does it happen?\nAnswer: Perhaps some syntactic parameters are set earlier than we can yet detect.\nFor example, German children around age 2 already know V2 -- and even\nthough they use root infinitives, they almost never apply V/2 to them.\nIn adult German, an infinitive verb does not move to C, but remains final in VP:\n(20)\nGerman (adult) infinitival verb does not move to C\nIch will [dieses Buch lesen]\nI want this\nbook read-INFIN\n'I want to read this book'\nHere are some examples of sentences uttered by the German speaking child\nAndreas (2;1). The first two examples show finite (non-infinitive) verbs, while the\nsecond two show root infinitives:\n\n-7\n(21)\nAndreas (2;1): finite and infinitive root sentence\na. Ich hab ein dossen Ball.\nI have a big\nball\n(note: dossen for grossen)\nb. Ich mach das nich.\nI\ndo\nthat not\n'I'm not doing that.'\nc. Thorsten Caesar haben.\n(note: Caesar = a doll)\nThorsten Caesar have-INFIN\nd. Du das haben.\nyou that have-INFIN\n- In fact, out of 281 sentences in a corpus of Andreas's utterances on a single day, which\nincluded 231 finite sentences and 51 sentences with root infinitives, Andreas\noverwhelmingly applied V2 to the finite verbs and failed to apply it to the non-finite\nverbs -- following the adult rule in this respect. (He disobeys the adult rules of V2\n7.8% of the time. Child data is always noisy.)\n+Finite -Finite\nVerb second 216\nVerb final\n- Some example of Andreas' finite sentences with V2:\n(22)\nDirect object topicalization\na. Kahehabahn fahr ich.\ntoy-race-car drive I\nb. Eine Fase hab ich.\na\nvase have I\n(23)\nAdverb topicalization\na. Da bin ich.\nthere am I\nb. So macht der.\nso does he\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Notes: Morphology",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/7b42ddf1f637ef5e082e215cb1b763c3_MIT24_900F12_Morphology.pdf",
      "content": "24.900 Fall 2012 lecture notes\nMorphology\nWhy morphology matters?\nInnate bias for words\n- If it is true that words are not marked in the physical stream of speech, two questions:\n- Why did our brains in childhood (infancy) go to the trouble of working out\nhow to parse the speech stream into words?\n- Why do our brains now go to the trouble of segmenting the speech stream\ninto words?\n- Why is the nature of the analysis so nearly identical across languages?\n- To question 1: One can give a functional explanation for the existence of words.\n- It is advantageous to construct a flexible communication system out of a\nsmallish set of units, combined and recombined.\nKeeps memory use under control.\nAllows novel utterances.\n- But does this tell us how or why the baby acquires the words? Does she do\na little communication theory and decide that speech must contain words?\nProbably not.\n- Answer is an innate bias to perform some sort of analysis of speech\n(explaining 1 and 2), and probably innate knowledge of what the product\nof this analysis will look like (explaining 3).\nArbitrariness\n- But remember:\nThe words themselves are not innately specified, or else they would not\ndiffer from speech community to speech community (arbitrariness).\n- Arbitratriness pervades language...\nEnglish dog, French chien, Russian sobaka...\n- ...even in \"onomatopoeia\" -- how we represent animal sounds linguistically is fixed:1\ncow: Dutch boeh, Hungarian bu, Thai maw maw (with mid tone), Bengali hamba\ndog: Russian gav-gav, Catalan bup-bup, Indonesian gong-gong\n1 http://en.wikipedia.org/wiki/Cross-linguistic_onomatopoeias#Animal_sounds\nWhat is Innate (in this domain):\nDrive to analyze speech into words.\nWhat is Learned (in this domain):\nWhat the words actually are.\nMorpheme: the minimal subpart of a word that expresses a meaning (or grammatical\nproperty)\nExample: dogs contains two morphemes:\ndogs\n= dog 'furry beast' + s 'plura\ndogs\n= d 'furry' + og 'beast' + s 'plural'\nHow we learn words and morphemes\nRapidly!\n- First words appear around age 1. (One-word stage.)\nKids already know more than they say:\n- In 11-month old, selective looking reveals preference for pauses that coincide\nwith word boundaries over pauses inserted between syllables of words.\n- In 9-month old, no preference.\nSo what happened between 9 and 11?\nHow do you segment speech into words if you don't know the words?\nNo magic bullet, it seems! Part of the story must be a statistical analysis of input\ndata carried out by the child -- and there are explicit proposals about this.\nBut a deeper question remains: Why does the baby perform this statistical analysis\nperformed, and why are the results saved in memory (ultimately, in the lexicon)?\nAn approach to an answer:\nAn instinct for language acquistion.\nInnate knowledge coupled with environment-dependent learning.\nThe knowledge underlying use of a complex word\n- Productivity of morphology:\n(1) industry, industrial, industrialize, industrialization., industrializational,\nindustrializationalize, industrializationalization, ...\n\n- There is no termination to the process, except that the words become too long and their\nmeanings too complex to keep track of all the morphemes.\n- An interesting difference between words and sentences: We have no problem parsing\nsentences with as many words as industrializationalization has morphemes (7 of\nthem!) -- compare even the process of turning a question about something else into a\nquestion about industrialization, which has the same meaning but 14 words! The\nmulti-word phrase is much easier to understand than the multi-morpheme word. We\nare not as good at parsing words as we are at parsing sentences.\n- Distinctions: bound morpheme vs. free morpheme / open-class vs. closed-class\nIndustry is a word on its own.\nfree morpheme\n-ize, -al, and -ation are not.\nbound morpheme\n- The free morpheme industry belongs to an open class of lexical items, an extendible\nclass of items with a wide range of meanings. You can make up new ones, and are not\nsurprised to learn new ones even in adulthood: screeve, Obama, cromulent.\n- The opposite of \"open class\" is \"closed class\" (also known as \"function words\").\nSince open class items can be coined at will (more or less), it is really the closed-class\nitems that identify the language -- that make English English, make French French etc.\nLewis Carroll's poem Jabberwocky contains lots of unfamiliar (\"nonsense\") open-class\nitems, but all its closed-class items -- all its function words -- are English. Crazy though\nthe poem may sound, it is clearly a poem written in English!\n'Twas brillig, and the slithy toves\nDid gyre and gimble in the wabe;\nAll mimsy were the borogoves,\nAnd the mome raths outgrabe.\nCompare a version in which the open-class words are replaced with normal English, but\nthe function words are replaced with \"non-sense\". It no longer looks like English:\nGlorm cloudy, yurk lim noisy frogs\nRur croak yurk fidget uf lim lake;\nCaj nervous trid lim hunting dogs,\nYurk lim hungry cats lay awake.\nOr worse, replace both function words and open-class items with made-up words:\nGlorm brillig, yurk lim slithnit tovem\nRur gyre yurk gimble uf lim wabe;\nCaj mimsnit trid lim borogovem,\nYurk lim mome rathem nusgrabe.\n-2\nBecause the real poem truly is written in English (because its closed-class items are\nEnglish), the notion \"translating Jabberwocky\" into a foreign language is a meaningful\none, and lots of translations have been made.\n- free vs. bound = open vs. closed class\n- For example:\nThere are free closed-class morphemes (prepositions, pronouns, articles...)\nThere are bound open-class morphemes (un+kempt, sanit+ize)\nHow to build a morphologically complex word: the rule Merge\nYou have to start somewhere!\nStep 0:\n- Take a morpheme from the lexicon whose lexical entry does not say \"I am a\nsuffix\" or \"I am a prefix\"... This starting point, which (as the textbook says)\ncarries \"the main meaning of the sentence\", is the called root.\n- Putting aside a special kind of complex word called a compound (to which\nwe return next week) -- if there's a free morpheme in the word, it's the root.\nStep 1:\n- A morphological rule that we can call \"Merge\" takes an appropriate\nmorpheme from the lexicon and glues it to the root. (We return soon to\nwhat we mean by \"appropriate\".)\n- A non-root morpheme in a word is called an affix. So morphologically\ncomplex words are made up of a root and some number of affixes.\n\nThe lexical entry for each morpheme specifies\n1. its sound\n2. its meaning\n3. whether it is a root or affix\n4. its part-of-speech (category): N, V, A...\n5. if it is an affix, the part of speech it merges with:\n6. if it is an affix, its place of attachment:\na. left edge (prefix)\nb. right edge (suffix)\n[c. after the first syllable, before the last syllable, before the main stress...\n(infix)]2\nStep 2:\n- The output of step 2 can undergo Merge again. Another affix can be attached to it.\n- The element to which an affix attaches (whether a root or a morphologically\ncomplex word) is called its base.\n- When an affix attaches to the root, the root is also its base. But when an affix\nattaches to a an already complex form, its base is not the root.\nTrees\n- A tree diagram can illustrate the internal structure of a word, and reflects how it was\nformed by one or more operations of Merge.\n[see the textbook for lots of actual trees]\n- Words really are trees (structures) -- not just strings of morphemes\nFor example ...\nthe suffix -ment attaches to a verb and produces a noun:\ngovern\ngovernment\nadjourn\nadjournment\ntreat\ntreatment\namuse\namusement\nbody --X→ *bodiment\ntrance --X→ *trancement\npower --X→ *powerment\n- You might say: \"the morpheme next to -ment must be a verb\" as an alternative to \"the\nbase to which -ment attaches must be a verb\".\n2 Discussed below.\n-3\n- An argument against this: find a prefix that makes a noun (or adjective) into a verb!\nThe prefix en- (sometimes em-) forms verbs out of nouns (and adjectives):\nbody --> embody\ntrance --> entrance\npower --> empower\nNow notice that these verbs can take the suffix -ment. Even though the morpheme next to\n-ment is not a verb morpheme, structurally -ment is being added to a verb.\n\"Sound\" in more detail\n- Whether a morpheme even has a sound is arbitrary.\nIn English, the fact that a noun is singular is not represented by an overt morpheme\n(one can say there is a zero morpheme) -- though plural is a morpheme with a sound\nof its own (dog vs. dog-s).\n- Some morphemes that do have a sound do not have a sound of their own. Their sound\nis a copy of sounds already present in the base. This is called reduplication:\nExample 1: Lakhota (Siouan, S. Dakota)\nsg\ninanimate pl\ngi\ngigi\n'to be rusty brown'\nska\nskaska\n'to be white'\nʃa\nʃaʃa\n'to be red'\ntho\nthotho\n'to be blue or green'\nʒi\nʒiʒi\n'to be yellow'\nSound: Copy first CV of the base.\nExample 2: Ilocano (Austronesian, Phillippines)\nsg\nplural\npiŋgan\npiŋpiŋgan\n'dish'\ntalon\ntaltalon\n'field'\ndalon\ndaldalon\n'road'\nbiag\nbibiag\n'lives'\nnuaŋ\nnunuaŋ\n'carabao'\nulo\nululo\n'head'\nmula\nmumula\n'plant'\ntawa\ntawtawa\n'window'\n\n- In the lexical entry for plural, under the heading \"sound\", it says not -ness, or un-, but:\n\"Copy first (C)V(C) of the base.\"\n[C = consonant, V = vowel, parentheses = \"if present...\")\n- Reduplication is extremely common in languages of the Austronesian group\n(Phillipines, Malaysia, Indonesia)\nAllomorphs\n- Sometimes the sound of a morpheme depends on the base to which it is attached, but is\nnot a copy of that base. Such a morpheme will have different arbitrary (i.e. not\ncopied) sounds depending on the base to which it attaches. These variants are called\nallomorphs.\nExample 1: English plural depends on the identity of the base to which it attaches.\ndog-s, cat-s, horse-s\nbut...\nox-en\nchild-ren\nsheep-ø, deer-ø\nNote that the -s plural is productive. It is the default plural marker which we\napply in the absence of special knowledge about an irregular plural marker.\nWhat is the plural of wug?\nThe situation is more complicated still: the default affix is -z, which regular\nphonology changes to /s/ for reasons we will discuss later. But after -s, -z, -ch, -sh,\n-j we get a vowel as well. This is more allomorphy...\nWhat is the plural of gruss?\nSometimes the plural involves a change of vowel: mouse/mice, woman/women.\nExample 2: English past tense:\nDefault is -d, but here too we have vowel changes, and sometimes both:\nwalk/walked, industrialize/industrialized\nrun/ran, sing/sang, lead/led, strive/strove\nsleep/slept\n-4\nExample 3: Latin forms of the verb meaning 'love'\npresent\npast\nfuture\nyou (sg)...\nama-s\nama-ba-s\nama-bi-s\nshe/he/it... ama-t\nama-ba-t\nama-bi-t\nwe...\nama-mus ama-ba-mus ama-bi-mus\nyou (pl.)\nama-tis\nama-ba-tis\nama-bi-tis\nbut:\nI ...\nam-(a)-o\nama-ba-m\nama-b(i)-o\nthey ...\nama-nt\namaba-nt\nama-bu-nt\nThe underlined bits are unexpected, and show allomorphs of the suffixes visible elsewhere\nin the chart.\n\"Place\" in more detail\nPoint 1: The place of attachment must be listed in the lexicon, because it's arbitrary.\n- For example, whether a morpheme with a particular affix is a prefix or a suffix\nvaries across languages.\nExample 1: Russian vs. Bulgarian comparative and superlative affixes.\n[I think I didn't do this one in class, but here it is anyway]\nBulgarian:\nsmesna / po-smesna\numna / po-umna\nRussian:\nsmesna / smesn-ee\numna / umn-ee3\n'funny' / 'funnier'\n'smart' / 'smarter'\nExample 2: The affix meaning (roughly) -ness is a prefix in Kanuri, but a suffix (as in\nEnglish) in Kurdish. It's also worth noting that English -ness attaches only\n(mostly) to adjectives, while its Kurdish cousin also attaches to nouns\nKanuri (Nilo-Saharan, Nigeria)\ngana\n'small'\nnəәmgana\n'smallness'\nkura\n'big'\nnəәmkura\n'bigness'\nkurugu\n'long'\nnəәmkurugu\n'length'\nkarite\n'excellent'\nnəәmkarite\n'excellence'\ndibi\n'bad'\nnəәmdibi\n'badness'\n3 Ignore for present purposes the -a of umna, which is a morpheme marking it as a\nfeminine adjective of a particular sort.\n\nKurdish (Indo-Iranian, Iraq)\naaqil\n'wise'\ndiz\n'robber'\ndraiʒ\n'long'\nzaanaa\n'wise'\ngarm\n'warm'\naaqilii\n'forethought'\ndizii\n'robbery'\ndraiʒii\n'length'\nzaanaaii\n'erudition'\ngarmii\n'warmth'\nWe know: prefix (attach to left edge of base), suffix (attach to right edge of base)\n- Now: Infix! Attach inside the base, according to a rule that refers to the base's sound\nstructure.\nExample 1: Bontoc (Austronesian, Philippines)\nThe infix -um- is positioned following the initial consonant of the base.\n'he is becoming ...'\nfikas\nfumikas\nkilad\nkumilad\nbato\nbumato\nfusul\nfumusul\nExample 2: Samoan (Austronesian, Samoa)\nThis example is interesting because it is also reduplication:\n'strong'\n'red'\n'stone'\n'enemy'\n\"copy penultimate syllable and position it next to the original\"\n'he ...'\n'they ...'\nmanao\nmananao\n'wish'\nmatua\nmatutua\n'be old'\nmalosi\nmalolosi\n'be strong'\npunou\npunonou\n'bend'\nsavali\nsavavali\n'travel'\npese\npepese\n'sing'\nlaga\nlalaga\n'weave'\natamaʔi\natamamaʔi\n'be wise'\ngalue\ngalulue\n'work'\naloga\nalologa\n'love'\nIn these cases, the morpheme is attached in the middle of the sounds belonging to another\nmorpheme. This type of affixation is called infixation.\nExample 3: fuckin' infixation (fan-fuckin'-tastic, Massa-fuckin'-chusetts, Missi-fuckin'\nssippi)4\n- The infixation of fuckin', which denotes a strong positive or negative attitude, appears\nto be determined by stress (accent). A first approximation at the correct rule is:\n4 In British, Irish, Australian and New Zealand English, bloody can be used, and appears to\nfollow exactly the same rule: Massa-bloody-chusetts, *Massachu-bloody-setts, etc.\n-5\n(2)\nfuckin'-infixation\nInfix fuckin' to the left of the syllable that bears main stress.\nThus:\n(3)\na. Massa-fuckin'-chusetts\nbut not :\nb. *Massachu-fuckin's setts.\n-- because the syllable -chu- bears the main stress. Likewise:\n(4)\na. Conn-fuckin'-ecticut\n[it helps to pause after the first syllable, or to draw it out]\nbut not:\nb. *Connect-fuckin'-icut.\nnor:\nc. *Connecti-fuckin'-cut.\n- This example shows that the rule does involve stress, and not counting syllables from\nthe end. since the stress in Connecticut falls on the third syllable from the end (the\nantepenult), while the stress in Massachusetts falls on the next-to-last syllable (the\npenult), as we've seen.\n(5)\nun-fuckin'-believable\n- What is especially worth noting about the whole phenomenon is that it really is rule-\ngoverned! We have clear intuitions about good vs. bad places to infix fuckin' within\nbases to which we have surely never heard this infixation rule applied.\n- People sometimes think that parental input and correction is a key to language\nacquisition. Pretty unlikely here: (\"No my little sweetheart, you know we don't say\nMassachu-fuckin'-setts. Say it properly, or you can't have dessert: Massa-fuckin'\nchusetts. Very good!\").\nMultiple affixes\n- In many languages, verbs or nouns bear a whole group of affixes. Often these affixes\nmark agreement: they represent properties like \"plural\" or \"3rd person\" that have no\nmeaning on the verb, but agree with a plural or 3rd person word or phrase somewhere\nelse in the sentence.\n- These agreement affixes often make it possible to leave out the plural or 3rd person\nwords, and just use a verb to express thoughts like \"we saw him\".\n- Languages with complex morphology of this sort present nice puzzles that will plague\nyour problem sets and exams in this class!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Notes: Phonology Summary",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/f305bb4cff88d8643ef77a3c2ab6b92a_MIT24_900F12_Phonologysum.pdf",
      "content": "Phonology Summary\n(contains all examples from class slides, and more!)\n1. Phonology vs. phonetics\n- The path from memory (lexical access) to speech is mediated by phonology.\n- Phonology = system of rules that apply when speech sounds are put together to form\nmorphemes and words.\n(1) stop consonant aspiration in English: initial within a stressed syllable\nASPIRATED\nUNASPIRATED\ninitial within a stressed syllable\nafter s or initial within an\nword-final (therefore syllable-\nunstressed syllable\nfinal)\npan\nspan\nnap\ntone\nstone\nnote\nkin\nskin\nnick\nupon\nsupping\nattack\nattic\nakin\nhacking\n- What English speakers know is a rule that relates a form stored in memory (in the\nsound field of the lexicon) to pronunciation. The rule concerns speech sounds, and\ntherefore involves phonetics. But aspiration at the beginning of stressed syllables is not\nan inevitable part of a human language -- you can have a human vocal tract and not\nuse the rule exemplified in (1). This makes it a rule of phonology rather than a fact\nabout phonetics.\n- Speakers of Spanish, for example, do not have the English rule, which is why the\nsyllable-initial stop consonants of a native speaker of Spanish sound \"funny\" to the\nEnglish ear (and vice-versa). More strikingly yet, speakers of Tojolabal (a Mayan\nlanguage of Mexico) have a rule that is almost the exact opposite of the English rule,\naspirating word (syllable?)-final [t]. but not [t] elsewhere:\n(2) aspiration of [t] in Tojolabal: word (syllable?)-finally1\n1. tʃit˭am\n'pig'\n5. tʃat˭ath\nkind of plant\n2. makt˭on\n'a patch'\n6. muth\n'chicken'\n3. pot˭otʼ\nkind of plant\n7. nahath\n'long'\n4. t˭inan\n'upside down'\n8. ʔinath\n'seed'\n(t˭ = unaspirated /t/)\n1 Source: Gleason, Henry A. (1955) Workbook in Descriptive Linguistics. New York:, Holt, Rinehart and\nWinston. Note: I only have information about [t], and don't know if the rule extends to the other stops.\nFall 2012\n- Speakers of English learned something from the data they were presented with as\nbabies that caused them to internalize (learn) the rule exemplified in (1) -- just as\nTojolabal speakers learned from the data that they heard as babies, and ended up with\nthe rule exemplified in (2).\n- The English rule is real and active \"on-line\", governing creative linguistic behavior. A\nnative speaker of English will apply it to new words they have never heard. The /t/ in\ntib will be aspirated, and the /t/ in stib (both nonsense words, I hope) will not be.\nProbably Tojolabal speakers will show similar behavior with respect to their rule.\n2. What phonetic distinctions are made in lexical entries?\nPart 1: phonological rules that eliminate distinctions from the lexicon\n- English: lexicon does not need to distinguish aspirated from unaspirated stops.\nThere is no reason to suppose that information about aspiration forms part of the sound\nfield of lexical entries of English words, since it is entirely predictable. Though pan is\npronounced /phæn/ and span /spæn/, there is no reason to distinguish the aspirated and\nunaspirated bilabial stops in the lexical entries of the two words. Instead, we may\nsimply use the unaspirated version in the lexicon for both words (pæn, spæn) and\nlet the phonological rule take care of the pronunciation difference.\n- To make the same point differently, we could not even conceive of two distinct words\nin English that differ only in the aspiration of a stop consonant. If you invent a product\nand call it \"phæb\", I could not invent a competing product and call it \"pæb\" to\ndistinguish it. The second form is simply the first form with a foreign accent! The\nEnglish lexicon does not even allow the aspirated and the unaspirated variants to be\ndistinguished. It hands the job off completely to the phonology.\n- This too is an English-specific fact! In some languages the lexicon does make the\nrelevant distinction. For example, Hindi, where words are often distinguished only\nby a contrast in aspiration for a stop consonant:\n(3) Hindi: lexicon distinguishes aspirated from unaspirated stops in the lexicon\nnote the minimal pairs\npal 'take care of'\nphal\n'knife blade'\ntal\n'beat'\nthal\n'plate'\nʈal\n'postpone'\nʈhal\n'wood shop'\ntʃal 'turn'\ntʃhal 'bark'\nkal 'era'\nkhal\n'skin'\n\n-2-\n- The same points can be made with other phonological rules. For example:\n(4) vowel length in English:\nV→ [+long] / __ [C, +voiced]\n(short and long vowels in complementary distribution, i.e. not distinguished in the\nlexical entries for English morphemes, but derived by a phonological rule)\nshort vowel\nlong vowel\nmeet\n[mit]\nmead\n[mi:d]\nback\n[bæk] bag\n[bæ:g]\npot\n[pɑt]\npod\n[pɑ:d]\nloss\n[lɔs]\nlaws\n[lɔ:z]\nhalf\n[hæf]\nhave\n[hæ:v]\nmade-up words\nwuck\n[wʌk] wug\n[wʌ:g]\nnis\n[nɪs]\nniz\n[nɪ:z]\n- Nonsense words and the pronunciation of non-English words like wuck and wug show\nthat this too is a rule. Vowel length is not part of lexical entries in English!\n- You could not imagine, for example, /nik/ and /ni:k/ being distinguishable names for\nnew inventions in English.\n- On the other hand, many languages do distinguish vowel length in the lexicon.\nLatin, for example, and many other languages, e.g. Finnish (a brilliantly demonstrated\nfor us in class):\n(5) vowel length in Finnish:\n(short and long vowels distinguished in the lexical entries for Finnish morphemes;\nnote the minimal pairs!)\ntuli\n'fire'\ntu:li\n'wind'\nehto 'condition'\nehto: 'evening'\nsika 'pig'\nsi:ka 'whitefish'\n(6) [l] vs. [r] in Luganda (Bantu, Uganda)\n[source: workbook by Gleason]\n[l]→[r] / [V, -back]2\n[l] and [r] in complementary distribution, i.e. not distinguished in the lexical entries\nfor Luganda morphemes, but derived by a phonological rule\n1.\nokudydyula 'to be full of'\n11.\nefirimbi\n'a whistle'\n2.\nokudydyula 'to dish up'\n12.\nendyaliiro\n'beam'\n3.\nokugula\n'to buy'\n13.\nerina\n'name'\n4.\nokuggula\n'to open'\n14.\nettuundiro 'shop'\n5.\nokuleeta\n'to bring'\n15.\nmyereere\n'only'\n6.\nokutabaala 'to attack'\n16.\nndyiri\n'Gospel'\n7.\nomulala\n'insane person'\n17.\nokuliira\n'to eat with'\n8.\nomulema\n'lame person'\n18.\nolugero\n'story'\n9.\nnaalwaana 'fought'\n19.\nokumiira\n'to swallow'\n10.\ntuleega\n'we tighten'\n20.\npiripiri\n'chili pepper'\n(7) [l] vs. [r] in Korean\n[source: workbook by Gleason]\n[l] → r / V __ V\n1.\nkal\n'that'll go'\n11. pulphyəәn 'discomfort'\n2.\nkɯnɯl\n'shade'\n12. silkwa\n'kind of fruit'\n3.\nmul\n'water'\n13. əәlmana\n'how much'\n4.\npal\n'foot'\n14. irɯm\n'name'\n5.\nphal\n'arm'\n15. kiri\n'length'\n6.\nsəәul\n'Seoul'\n16. kɯrəәm\n'then'\n7.\ntatɯl\n'all of them'\n17. kəәriro\n'to the street'\n8.\nilkop\n'seven'\n18. saram\n'person'\n9.\nipalsa\n'barber'\n19. uri\n'we'\n10. onɯlppam 'tonight'\n20. yəәrɯm\n'summer'\n([ɯ] is a high back unrounded vowel)\n(8) [l] vs. [ɹ] in English\ndistinguished in the lexical entries for English morphemes: note the minimal pairs\nlate\nrate\nlot\nrot\nlamb\nram\nbelly\nberry\nhail\nhair\npool\npoor\n2 The data are insufficient to tell us whether lexical entries contain [l] and a rule derives\n[r], or whether it is the other way around. The same is true for Korean below.\n\n-3-\n3. What phonetic distinctions are made in lexical entries?\nPart 2: phonological rules that do not eliminate distinctions from the lexicon\nRussian Consider the following pairs of forms from Russian. I call the forms in the left\ncolumn \"zero-ending forms\" and the forms in the left column \"-a forms\", though the\nmeaning and use of the two forms actually varies widely among the examples. Assume\nthat the -a form contains two morphemes: a root and a suffix -a (brought together into\nonew word by the rule Merge).\n(9) Final devoicing in Russian\nzero-ending form\n-a form\na.\ngrɔp\ngrɔba\n'coffin'\nb.\nlip\nlipa\n'linden tree'\nc.\nʃɔpəәt\nʃɔpəәta\n'whisper'\nd.\ngɔrəәt\ngɔrəәda\n'city'\ne.\nruk\nruka\n'hand'\nf.\nrɔk\nrɔɡa\n'horn'\ng.\nrɔk\nrɔka\n'fate'\nh.\nkəәrəәndaʃ\nkəәrəәndaʃa\n'pencil'\ni.\nekipaʃ\nekipaʒa\n'crew'\nj.\nras\nrasa\n'race'\nk.\nras\nraza\n'time'\n- step 1: Comparing the two columns, we note that sometimes the -a form has a voiced\nconsonant (stop or fricative) where the zero-ending form has the corresponding\nvoiceless consonant. (Example: the /p/ vs. /b/ in the first example.) This already\nsuggests that Russian has either a rule that makes voiced consonants voiceless in a\ncertain environment, or else a rule that makes voiceless consonants voiced. Which is\nit?\n- step 2: Next we notice that sometimes both columns have the voiceless alternant.\n(Example: the /p/ in the second example.) But there are no examples in which the\nzero-ending form has a voiced consonant while the -a form has a voiceless consonant.\n- Now let's add an additional fact: No Russian word is ever pronounced so as to end\nwith a voiced consonant (with some law-governed exceptions coming up). A Russian\naccent in English has this property too: an English word like [prawd] 'proud' comes out\nas [prawt].\n- Solution: Russian has a rule of final devoicing that devoices a voiced consonant at\nthe end of a word. The rule leaves consonants that are already voiceless alone.\n(10)\nFinal devoicing (first version, to be revised)3\n[+consonant] ! [-voiced] / ___ #\n3 The symbol # indicates the boundary of the word. See the textbook for the format of phonological rules\nused here.\nWhere the zero-ending form has a voiceless consonant and the -a form has a voiced\ncounterpart, the lexicon contains a voiced consonant that the rule of final devoicing\nturns into its voiceless counterpart.\n(11)\nFinal devoicing in Russian\nzero-ending form\n-a form\nlexical entry for the root4\na.\ngrɔp\ngrɔba\n'coffin'\ngrɔb\nb.\nlip\nlipa\n'linden tree'\nlip\nc.\nʃɔpəәt\nʃɔpəәta\n'whisper'\nʃɔpəәt\nd.\ngɔrəәt\ngɔrəәda\n'city'\ngɔrəәd\ne.\nruk\nruka\n'hand'\nruk\nf.\nrɔk\nrɔɡa\n'horn'\nrɔg\ng.\nrɔk\nrɔka\n'fate'\nrɔk\nh.\nkəәrəәndaʃ\nkəәrəәndaʃa\n'pencil'\nkəәrəәndaʃ\ni.\nekipaʃ\nekipaʒa\n'crew'\nekipaʒ\nj.\nras\nrasa\n'race'\nras\nk.\nras\nraza\n'time'\nraz\n- Important points:\n1. Listing the voiced alternant in the sound field of the lexical entries for the roots of\nthese words makes it possible to predict the pronunciation of both the zero-ending\nform and the -a form. If we were to list the voiceless alternant, we could not predict\nwhen the -a form shows a voiced consonant and when it shows a voiceless consonant.\n2. Forms with a voiced final consonant are never pronounced that way! So this is a\ncase in which the lexicon makes more distinctions than those made in the spoken form\nof the language (a voicing contrast in word-final position) -- a contrast to the previous\nsection, in which we saw the lexicon making fewer distinctions than those made in the\nspoken form (e.g. with respect to aspiration in English).\n- Finally, the details of Russian motivate a restriction of the rule in (10) to exclude\nliquids (/l/ and /r/) and nasals\n(12)\nNo devoicing of liquids and nasals\ndɔm\ndɔma\n'house'\nplan\nplana\n'plan'\nskəәzal\nskəәzala\n'said'\nvɔr\nvɔra\n'thief'\n(13)\nFinal devoicing (final version)\n+consonant\n-sonorant\n→ -voiced / ___ #\n4 Our lexical entries ignore some irrelevant additional details of Russian phonology -- for example, the fact\nthat the schwa vowels listed here are not actually part of the lexical entries either, but are the result of rules\nthat apply to other vowels when they are unstressed.\n\n-4-\n4. More phonology\n- Phonology vs. phonetics once more: Rules like (13) are very common in the\nworld's languages. But not universal. English, for example, does not have a rule of\nfinal devoicing.\nPart of having a \"Russian accent\" when speaking English is to erroneously apply this\nrule when speaking English.\nAnother very common (but not universal) kind of rule is assimilation.\nVoicing assimilation\n(14)\nVoicing assimilation in English: the plural suffix\na.\nplural morpheme as /s/:\n[lɪp-s, pɑt-s, nɛk-s, læf-s ...]\nb.\nplural morpheme as /z/:\n[kæb-z, pɑd-z, ɛg-z, hajv-z ...]\n(15)\nVoicing assimilation in English past tense: invented words\na.\nplural morpheme as /s/:\n[zɑp-s, wʌk-s, ...]\nb.\npast morpheme as /d/:\n[zɑb-z, wʌg-z, ...]\n-\nThe point (yet again!): the past tense rule is not about a list of phones turning into\nanother list. Rather it is about an abstract property of phones in general (voiced vs.\nvoiceless):5\n(16)\nVoicing assimilation\nz → [-voiced] / [-voiced] __\nNasal assimilation\n- As noted, rules like (16) -- assimilation rules -- are very common in the world's\nlanguages. One of the most common phonological processes across the world's\nlanguages is nasal assimilation. A nasal consonant takes on the place of articulation\nof a consonant that follows it.\n5 As came up in answer to a question, a schwa is inserted after sibilants: [kɪsəәz, bʌzəәz, edʒəәz] etc.\nEnglish nasal assimilation:\nCould there be a word chinp (vs. chimp)? What about /þink/ (vs. /þiŋk/ )? emd (vs.\nend)? No, because English has a rule of nasal assimilation, identical to the rule also\nillustrated in (17) below:\n(17)\nItza6 (Mayan, Guatemala): nasal assimilation\ntsʔon 'gun'\nʔintsʔon\n'my gun'\nkʔab\n'hand'\nʔiŋkʔab\n'my hand'\nbat\n'ax'\nʔimbat\n'my ax'\npal\n'son'\nʔimpal\n'my son'\nkol\n'field'\nʔiŋkol\n'my field'\nsiʔ\n'wood'\nʔinsiʔ\n'my wood'\nlak\n'bowl'\nʔinlak\n'my bowl'\nlets\n'trap'\nʔinlets\n'my trap'\n(18)\nNasal Assimilation Rule\nA nasal assimilates in place of articulation to the following consonant\n- Here is an approximation at a formal statement of the rule, using the terms introduced\nin class for the phonetic properties of consonants:\n[+nasal] → [a bilabial, b alveolar, γ velar]/ ___ [α bilabial, β alveolar, γ velar]\n-- where α, β, γ are variables that range over plus and minus values. Using the\nfeatures discussed in the book, but not in class, that would be:\n[+nasal] → [α labial, β coronal, γ dorsal]/ ___ [α labial, β coronal, γ dorsal]\nImportant note:\nFrom the data given, we can't tell what the underlying form of 'my' is in Mayan. It might\nbe ʔin, ʔiŋ or ʔim.\nVowel harmony\nWhen assimilation affects a vowel, the process is called vowel harmony. For example:\n6 Data once again from the Gleason worksbook cited above. Gleason calls the language \"Mayan\", which is\nactually a language family. Thanks to Robert Henderson for identifying the actual language.\n\n-5-\n(19)\nTurkish vowel harmony\nsingular\nplural\ndiʃ\ndiʃler\n'tooth'\ntʃotsuk\ntʃotsuklar\n'child'\nasker\naskerler\n'soldier'\nkedi\nkediler\n'cat'\nson\nsonlar\n'end'\nmasa\nmasalar\n'table'\ngetse\ngetseler\n'night'\nbaba\nbabalar\n'father'\nkuʃ\nkuʃlar\n'bird'\nkøj\nkøjler\n'village'\njyz\njyzler\n'face'\nkɯz\nkɯzlar\n'girl'\n[y], [ø] = high and mid front rounded vowels (Turkish spelling: u and o)\n[ɯ] = high back unrounded vowel (Turkish spelling: dotless ı)\n- In the plural suffix, we find a back vowel ([a]) when the root ends in a back vowel ([u],\n[a], [o], [ɯ;) and a front vowel ([e]) when the root ends in a front vowel ([[i], [e], [y],\n[ø]). This is the result of a rule of front-back vowel harmony.\n5. Phonemes\n- Question:\nWhat is the inventory of the sounds that are found in the morphemes of a language as\nthey are stored in the sound field of the lexicon?\nThe list of these sounds is the list of the phonemes of the language.\n- The list of actual sounds used in the language (the phonemes, as modified by the\nphonological rules of the language), is the list of its phones.\nThese concepts in context\n- Why did our brains in infancy go to the trouble of working out how to parse the speech\nstream into morphemes? Probable answer: to store information about these units in\nthe database that we call the lexicon.\n- When the infant acquiring language notes that two or more phones are in\ncomplementary distribution, he/she uses this fact to economize on the distinctions\nmade in the lexicon. Two phones in complementary distribution are taken to\ncorrespond to only one sound stored in memory, a phoneme -- with the variant\npronunciations related to the single phoneme by phonological rule.\n- The variant forms of phoneme that are related by rule are called its allophones.\n- Review, in this connection, our discussion of aspiration:\nTojolabal and English:\npredictable alternation of +aspirated and -aspirated (different rules)\nSpanish:\nalways unaspirated\nHindi:\nunpredictable whether a consonant is aspirated or not\nConclusions:\nTojolabal, English:\naspiration is not phonemeic\n(for example, /t/ and /th/ are allophones of the same phoneme)\nHindi:\naspiration is phonemic\n(for example, /t/ and /th/ are distinct phonemes)\n- We can immediately establish that two phones are not in complementary distribution in\na language if we can find a minimal pair of words that differ by only that phone.\nThe minimal pair is the gold standard of phonological analysis. but near-mininal\npairs will often do almost as well, i.e. two words containing XaY and XbY where X\nand Y are the same. At least we know that a vs. b is not predictable on the basis of X\nvs. Y.]\n6. Phonemic inventory\n- The set of phonemes of a language are called its phonemic inventory.\nrecord low: maybe Rotokas (S. Pacific), 11 phonemes\nrecord high: !Xoo (Khoisan group, Botswana, Namibia), 141~160.\n80 of them are clicks!\nEnglish:\nabout 37-41, depending on dialect and analysis\n- Alphabetic writing systems often choose represent phonemes rather than their\nallophones.\n- Speakers of languages tend to be minimally aware or unaware of allophonic\ndistinctions. (Were you aware of the rule governing stop aspiration in English?)\n-\nCategorical perception for non-phonemic distinctions seems to be suppressed in the\nprocess of language acquisition. Work done at Haskins laboratories in the 1970s and\n80s (by Virginia Mann, among others) seems to show that adult speakers of English\n\nmake a categorical distinction between [l] and [r], but adult speakers of Japanese do\nnot.\nOther experiments show that infants -- both Japanese and American -- make the\ncategorical distinction. So language acquisition from this perspective looks more like\na process of losing distinctions than gaining them -- unlearning rather than learning.\n7. Distinctive features.\n- Phonological processes tend to be \"natural\", in that they apply to natural classes of\nsounds. The environment of a rule is also generally a natural class of sounds, and the\nchange effected by the rule involves a natural class of sounds.\nWhat is a natural class of sounds? A group of sounds that have a common phonetic\nproperty. For example, for consonants: point of articulation, manner of articulation\nand voicing.\nOther (rather sophisticated) ways of classifying sounds are discussed at length in the\ntextbook, but were not discussed in class. Take 24.901 next Fall to learn more.\n8. Rule ordering\n- Lexical entries may undergo more than one phonological rule. The various rules do\nnot seem to apply equally or all at once, but are prioritized. There is controversy\nwithin the field of phonology about the precise nature of this prioritization. (One\ncurrently popular approach, called Optimality Theory is not the approach taught here,\nbut is stressed in other classes in linguistics.) For our purposes, the prioritization can\nbe understood as an ordering of the rules: they apply in a serial fashion, each rule\napplying to the output of the preceding rule.\n- The sequence of ordered rules is called a derivation. In class, we examined three\nproblems that show how an ordered derivation works.\n-6-\n- Example 1: Tunica\nAnswer: Vowel harmony in the 3sg fem form precedes unstressed vowel deletion --\nwhich if it had applied first, would have eliminated the environment for harmony\n[source: Roca, Iggy and Wyn Johnson. 1999. A Course in Phonology]\nExample 2: Shona\nAnswer: The output of nasal assimilation (see below) reveals the place of articulation\nof a following voiceless stop that has turned into [h]. So nasal assimilation must\nprecede the stop→[h] rule, so it can see the difference between a [p], [k] or [t] that\nlater changes to [h].\nRoca, Iggy, and Wyn Johnson. A Course in Phonology. Blackwell Publishers, 1999.\n(c) Blackwell Publishers. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\n-7-\n9. Syllable structure\nThis is a topic that I presented very briefly, which really deserved a full class or two to\nitself -- mainly because the next topic was writing systems, and I wanted to discuss\nsyllables so we could later discuss syllabaries. Here's what we talked about (and there's\nmore material in the textbook).\n- Phonological segments are not arranged like beads on a string (any more than\nmorphemes within a word are, or words within a sentence) -- but are organized in a\nhierarchical fashion into syllables.\n- Though there is some disagreement among experts (and some interesting recent work\nrevising the model), a standard view holds that segments are grouped as in (20), where\nthe Greek letter σ (a lowercase sigma) indicates \"syllable\".7 Note that in general,\nsonority increases as you move from either syllable-edge towards the nucleus.8\n(20)\n- Both onset and rime are optional, but the nucleus (containing one or more vowels,\nsyllabic liquids or nasals) is obligatory.\nEvidence for the existence of onset and coda as structural units includes:\n- The existence of phonotactic constraints (constraints on co-occurrence) within the\nonset and within the rime, vs. the near-absence of comparable constrants that cross the\ncoda-onset divide.\nFor example, in English trent is a possible (but not an actual) word, but *rtent is an\nimpossible word, since [rt] is not a possible onset (violating the principle of increasing\nsonority). On the other hand, [r] may immediately precede [t] even in English, so long\n7 Linguists' spelling of rime is an homage to Coleridge's poem \"The Rime of the Ancient\nMariner\" (http://www.gutenberg.org/files/151/151-h/151-h.htm -- in case you don't know\nit).\n8 Vowels are more sonorous than consonants; nasals and liquids are more sonorous than\nstops; voiced consonants are more sonorous than voiceless consonants. Cross-\nlinguistically, the behavior of sibilants is interestingly anomolous: a word like [trɪp] obeys\nthe sonority generalization, but the initial consonant of [strɪp] violates it.\nas the [r] can be syllabified into the coda of a preceding syllable. Thus: airtent is a\npossbile word, since it is syllabified [σ ejr][ σ tɛnt].\n- Branching rimes and branching codas attract stress in many languages, while\nbranching onsets generally do not (i.e. there is a generalization that requires reference\nto these constituents within the syllable).\n(continued on next page)\n\nExample: the Latin stress rule\n(21)\nLatin stress: data\nshort penult9\nclosed10 penult\nmi-se-rum\n'poor' (NEU)\na-man-tis\n'loving' (GEN)\ndu-ci-mus\n'we lead'\nre-fec-tus\n'repaired'\nre-fi-cit\n'(s)he repairs'\nim-pe-di-men-ta\n'baggage'\ndo-mi-nus\n'master'\ncon-ser-vat\n'(s)he preserves'\nprin-ci-pi-bus 'chiefs' (ABL)\nlong penult\nstop+liquid\na-ma:-vi:\n'I have loved'\nce-le-bris\n'crowded' (GEN)\na-ma:-bo:\n'I will love'\nvo-lu-cris\n'winged' (GEN)\ndu-ce:-mus\n'we will lead'\nhor-to:-rum\n'gardens' (GEN)\ntwo-syllable words\nte-git\n'covers'\nmo-rem\n'sea' (ACC)\n(Latin spelling: c = [k], v = [w])\nLatin syllabification rules:\nstep 1. Link all vowels to Nucleus, project Rime and Syllable:\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nR\nR R\nR\nR\nR\nR\nR\nN\nN\nN\nN\nN\nN\nN\nN\ni m p e d i m e n t a\nv o l u c r i s\n3.\n9 Penult = second syllable from the end of a word. Antepenult = third syllable from the\nend of the word.\n10 A syllable is closed if it contains material in its coda (e.g. [d\n-8-\nstep 2. Link each consonant that immediately precedes a vowel to Onset. Add as many\nother consonants as possible to Onset (\"maximize Onset\") -- so long as\nphonotactics (sonority sequencing) is not violated.\nR\nR R\nR\nR\nR\nR\nR\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nN\nO N O N O N\nO N\nO N O N O N\ni m p e d i m e n t a\nv o l u c r i s\nThe underlined segments are not added to onsets in step 2 because of\nsonority. [mp] and [nt] are not possible onsets in Latin.\nstep 3. Link remaining (unsyllabified) consonants to Coda\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nR\nR R\nR\nR\nR\nR\nR\nN C O N O N O N C O N\nO N O N O N C\ni m p e d i m e n t a\nv o l u c r i s\nLatin stress rule:\n1. If the penult (second-to-last syllable) has branching structure in its rime (is heavy),\nstress the penult.\na-man-tis\nre-fec-tus\na-ma:-vi:\ndu-ce:-mus\nim-pe-di-men-ta (see syllable structures above)\n2. Otherwise, if the word has 3 or more syllables, stress the antepenult [third syllable\nfrom end]\nprin-ci-pi-bus\ndu-ci-mus\nmi-se-rum\nce-le-bris\nvo-lu-cris\n(see syllable structures above)\n3.\nOtherwise, stress the first syllable\nte-git\nmo-rem\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Notes: Syntax Summary",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/808d2e16f8f26848bb13067ccfc9814c_MIT24_900F12_Syntaxsummary.pdf",
      "content": "24.900 Fall 2012\nSyntax summary updated to 11/19/2012\n1. Syntactic hierarchy and constituency\n- We began by reviewing basic, somewhat crude evidence that sentences are not formed\nby taking words from the lexicon and arranging them like beads on a string ...\n- ...but instead are hierarchically arranged in nested groups called constituents (or\nphrases) that can be represented as a tree (of the sort familiar from the textbook\nchapter).\n- Our initial \"crude evidence\" (repeated from the first class of the semester) involved the\nsubstrings of a sentence that can be repeated as a coherent \"surprise reaction\":\n(1) The \"surprise reaction\" test for constituents\nSpeaker 1: \"Guess what? The quick brown fox will jump over the lazy dog.\"\nSpeaker 2: \"You're kidding!\na. Jump over the lazy dog?\"\nb. *Will jump over the?\"\netc.\n- The structures for sentences revealed by this test and others are built from words by the\nrecursive rule Merge --the same simple rule that built words out of morphemes:\n(2) Merge\nForm a set whose members are two elements α and β, either or both of which may be\na. words from the lexicon, or\nb. a set previously formed by Merge\n- ...So we expect to see Merge applying in three different ways: combining a lexical\nb. Merge a lexical item with a set formed by Merge: the + lazy dog\nThen, once the derivation has built will jump over the lazy dog and separately built\nthe quick brown fox ...\nc. Merge two sets formed by Merge:\nitem with another lexical item; combining a lexical item with a set formed by Merge;\nand combining a set formed by Merge with another set formed by Merge. We do\nindeed find all three:\n(3)\nThe three faces of Merge:\nThe quick brown fox will jump over the lazy dog.\na. Merge two lexical items: lazy + dog\n- We then introduced some terminology useful for discussing syntactic structures. I did\nnot define these terms in class, and I won't do that here -- since in my experience, their\nmeaning is easy to pick up by example. If you have questions about these terms,\nhowever, do not hesitate to ask:\n(4) Terminology for referring to tree structures\nnode, immediately dominates, dominates, mother, daughter, sister, root node, terminal\nnode\n2. Labeling the nodes: the notions head and projection\n- Syntactic structures contain more information than just patterns of sisterhood and\nimmediate domination among nodes. In each constituent, one element is especially\nimportant (and gives the constituent its name). That element is called the head of the\nconstituent.\n- For example, consider what is allowed to be the sister to a preposition. It turns out that\nthe sister to a preposition may contain a wide variety of miscellaneous things -- but it\n\n-2-\nmust contain a noun. The noun does not have to be pronounced adjacent to the\npreposition -- a determiner and any number of adjectives may linearly intervene --\nbut the noun must be there! This can be seen in the contrast between (5a-e) and (5f-h)\nbelow:\n(5)\nThe quick brown fox will jump ...\na. ... over the lazy dog.\nb. ... over the dog.\nc. ... over lazy dogs.\nd. ... over dogs.\ne. ... over the ridiculous lazy green dog.\nf. ... *over the.\ng. ... *over the lazy.\nh.\n... *over of.\n- Because the noun is the indispensable element in the sister that a preposition like over\ntakes, we call it the head of this sister, and we label the phrase NP (\"Noun Phrase\") in\nits honor.\n- Any other nodes that dominate N and are dominated by NP are labeled N' (\"N-bar\"),\nsince N is also the head of these nodes:\n(6)\n- Terminology: We call N' and NP projections of their head N. NP is the maximal\nprojection of its head N, since it is not dominated by any further projections of that N.\n3. Subcategorization as a tool for finding heads\n- The fact about P seen above is more general. When a word W merges with something\nto form a phrase that is a projection of W, it is picky! It cares about what it merges\nwith it. A particular choice of sister may be obligatory, optional or forbidden.\n- For example, most prepositions merge with an NP to form a PP, but prepositions differ\nin whether this NP is obligatory or optional:\n(7) a. Mary walked in the room.\nb. Mary walked in.\nc. Mary walked into the room\nd. *Mary walked into.\n- Verbs offer a particularly rich array of pickiness possibilities. Contrast vanish with\nerase, eat with devour; and throw with put, for example:\n(8) a. Bill has vanished.\nb. *Bill has vanished the blackboard.\nc. *Bill has erased.\nd. Bill has erased the blackboard.\n(9) a. Mary has eaten.\nb. Mary has eaten the pizza.\nc. *Mary has devoured.\nd. Mary has devoured the pizza.\n(10)\na. John will throw.\n[but limited to sports context]\nb. John will throw the ball.\nc. John will throw the ball to Tom.\nd. [?]John will throw to Tom.\n[but limited to sports context\ne. *John will put.\nf. *John will put the book.\ng. John will put the book under the desk.\nh. *John will put under the desk.\n- Adjectives are not quite as rich in differences, but fond (which requires a PP) contrasts\ninstructively with proud (which allows, but does not require one):\n(11)\na. *Mary is fond.\nb. Mary is fond of her friends.\nc. Mary is proud.\nd. Mary is proud of her friends.\n- This information forms part of the lexical entry for the prepositions, verbs and\nadjectives seen above -- and is to a great extent arbitrary (as far as we know). It is\ncalled the subcategorization property of the word (e.g. \"devour subcategorizes for a\nNP\") -- a property we discussed earllier in the section on morphology (when we\nobserved that -ness, for example, must attach to an adjective).\n- See pp.162-167 of the textbook for their presentation of this topic.\nIn a 1965 book called Aspects of the Theory of Syntax, Noam Chomsky suggested that the\nfollowing generalization restricts the type of information that subcategorization makes use\nof:\n\n-3-\n(12)\nChomsky's Generalization concerning subcategorization\n(to be criticized as not quite right -- see below)\nThe lexical entry for a word contains subcategorization information only about its\nsister.\n- Examplifying Chomsky's principle: no verb, for example, requires that its sister be an\nNP that itself contains an adjective, and no verb requirtes that its subject contain a PP.\nSuch a verb might be the imaginary verb glork, for which we would have the\n(imaginary) data in (13):\n(13)\nThe imaginary verb glork that would counterexemplify Chomsky's\nGeneralization\na. The queen of England has glorked a purple chair.\nb. *The queen of Englandhas glorked a chair.\n[no adjective in its sister NP]\nc. *The queen has glorked a chair.\n[no PP in its subject]\nWhat's right about Chomsky's Generalization?\nThe significance of Chomsky's Generalization for language acquisition:\n- If the generalization is just the way language works -- part of Universal Grammar,\nour genetic endowment for language...\n- ...then a child who is acquiring language does not have to pay attention to the entire\nphrase structure tree when learning the subcategorization requirements of a word.\nMakes the task of language acquisition easier, because lots of data may simply be\nignored by the child.\nWhat's wrong about Chomsky's Principle?\nHere's one example: a verb may subcategorize not just for a PP, but for the specific\npreposition in a sister PP:\nEnglish\nvs.\nRussian\ndepend on\nzaviset' ot\nlit. 'depend from'\nspeak to\ngovorit' s\nlit. 'speak with'\nlook at\nsmotret' na\nlit. 'watch on'\nlook for\niskat' knigu\nlit. 'seek'\nEnglish dialect 1\nvs.\nEnglish dialect 2\nwait for 'actively anticipate the arrival of'\nwait on [!] 'actively anticipate the arrival of'\nwait on 'serve, in a restaurant'\nwait on\n'serve food to, in a restaurant'\n- These are facts learned by the child from the linguistic environment. The very fact that\nlanguages differ (apparently arbitrarily) tells us this. Thus, for example, English does\nnot allow *Mary depends from her computer, even though Russian does. But Russian,\nin turn does not allow the equivalent of 'depend on' (*zaviset' na), even though English\ndoes. So the lexical entry for the verb depend must care about more than just the fact\nthat its sister is a PP. It has to be able to look inside its sister.\n- But it still shouldn't be allowed to look anywhere it wants within its sister! There are\nstill no verbs that take an NP but care about the adjective inside it, So we need to\nmodify Chomsky's Principle, not throw it away!\nThe necessary modification of Chomsky's Principle:\n(14)\nChomsky's Principle, Revised\nThe lexical entry for a word contains subcategorization information about the head\nof its sister.\nWe can now use the revised principle (assuming it is correct) to probe for heads of all\nsorts of phrases:\nV subcategorizes for the complementizer of its complement when that complement is\na clause (that vs. for):\n(15)\na. Mary will believe\n[that the brown fox has depended on the lazy dog].\nb. Mary will arrange\n[for the brown fox to depend on the lazy dog].\n(16)\na. *Mary will believe\n[for the brown fox to depend on the lazy dog].\nb. *Mary will arrange\n[that the brown fox has depended on the lazy book].\n- So C is the head of the sister of V in these examples. Embedded clauses are CPs.\n\n-4-\n(21)\nC subcategorizes for the I of its sister (to vs. [±past, ±future]):\n(17)\na. *Mary will believe\n[that the brown fox to depend on the lazy dog].\nb.\nMary will arrange\n[for the brown fox to depend on the lazy dog].\nc.\nMary will believe\n[that the brown fox has depended on the lazy dog].\nd.\n*Mary will arrange\n[for the brown fox has depended on the lazy dog].\n- So I is the head of the sister of C. Sentences are IPs.\n(22)\nI subcategorizes for the V-morphology of its VP complement (tensed vs. bare-stem)\n(18)\na. ... [for the quick brown fox to [depend on the lazy dog].\nb. *...[for the quick brown fox to [depended on the lazy dog].\n(19)\na. ... [that the quick brown fox will [depend on the lazy dog].\nb. *... [that the quick brown fox will [depended on the lazy dog].\n(20)\na. *... [that the quick brown fox has depend on the lazy dog].\nb. ... [that the quick brown fox has depended on the lazy dog].\n- So V is the head of the sister of I. Verbs head VPs.\n...Which of course is why we called them CP, IP and VP in the first place!\n[Terminology: We call the sister of the head of a phrase its complement,]\n\n-5-\n4. Converging evidence for the concept \"head\": head-final vs. head-initial languages\n- Some Japanese sentences:\n(23) John-ga hon-o\nyon da\nJohn-SUBJ book-DO read PAST\n'John has read the book'/'John read the book'\n(24)\nJohn-ga\nMary-ni kono hon-o\nage ta\nJohn-SUBJ Mary to that book-DO give PAST\n'John has given that book to Mary/John gave Mary that book'\n(25)\nMary-ga kono Nihon kara-no kagaku\nno gakusei-o korosi ta\nMary-SUBJ this Japan from chemistry of student-DO kill PAST\n'Mary killed/has killed this student of chemistry from Japan'\n(26)\nMary-ga John-ga\nhon-o\nyon da\nto\nomottei ru\nMary-SUBJ John-SUBJ book-DO read PAST that think\nPRESENT\n'Mary thinks that John is reading the book'\n- Japanese word order is different from English -- but if we run the same kinds of tests\nfor constituency that we run in English, we come up with a structure for a complex\nsentence like (21) that looks like (27a) -- in which C follows (rather than precedes) its\nIP sister, amd I follows (rather than precedes) its VP sister. Compare its English\ncounterpart in (27b):1\n(27) a.\nb.\n- ... and structures for sentences like (24) and (25) with PPs in which P follows, rather\nthan precedes its sister. We call such instances of P postpositions (vs. prepositions):\n(28)\n- The word order of Japanese is actually the same as English, except that the head of\neach phrase precedes its complement in English, and follows it in Japanese. We\nthus call English head-initial and call Japanese head-final.\n- The fact that Japanese and English differ in whether heads precede or follow their\ncomplements tells us that \"head first\" vs. \"head last\" is not innate, and is something\nthat a child acquiring just learns. It is a \"parameter of variation\"among languages, or\nparameter, for short.2\n- Notice that the English/Japanese difference gives us converging evidence for the\nnotion head -- because it is the C of CP, the I of IP, the V of VP (also the P of PP and\nthe N of NP) that switches position as we move between Japanese and English. The\nsubject of the sentence, as well as words like this, do not switch position.\n5. A digression worth reading: for as an English complementizer\nHere is why I am calling 'for' a complementizer in some cases (not discussed in class)\n- I have been calling for a complementizer in English sentences like (14b) -- that is, a C\ntaking an IP as its complement. How do we know that for really is a complementizer?\nHow do we know, for example, that it is not actually a P taking the following NP as its\ncomplement?\n- ...After all, there does exist a for that functions in this way, of course, as in I made the\ncake for Sue -- which means something like \"I made the cake so that Sue would have\nit and benefit from it\". What makes us think that what follows for in the sentence\nMary arranged for Sue to read the book really is an IP, as in (14b)? Here's one good\nargument in favor of that view:\n- There is a special use of the word it when it is the subject of verbs that describe the\nweather. For this reason, it is generally called \"weather it\":\n(29)\na. It was raining today.\nb. It rarely snows in July.\nThis use of it looks like a pronoun, but unlike a normal pronoun, it does not refer to\nanything, and does not require you to know what the speaker has in mind when using\nthe word. For example, if I enter the room and say, out of the blue...\n(30)\nI baked a cake for it.\n...you will be puzzled, since you don't know what the word it referred to. You might\nrespond \"You backed a cake for what?\".\n1 I am using the \"progressive forms\" is thinking and is reading so the position of I is visible in English.\n2 What the book by Baker is all about!.\n\nNow suppose instead I enter the room and say (29a) Would you be puzzled by the\nmeaning of \"it\"? You might wonder why I decided to talk about the weather, but you\nwill not reply by asking \"What was raining today?\" This is because you recognize the\nspecial it of weather sentences for what it is!\nThis it is always used as a subject. We never find it as the object of indisputable\nprepositions. But, lo and behold, it can be used following for in sentences like (31):\n(31)\nMary arranged for it to rain (during the festival).\nThis is a good argument that for has an alternative life as a complementizer, taking\nan IP as its sister, since its complement is a clause (an IP) -- not the NP that\nimmediately follows it, which turns out to be the subject of that clause)\n...and what about the word to in sentences with complementizer for? Why is it being\ncalled an instance of I? Why isn't it just a preposition?\n- Well...it follows the subject and precedes the VP. Also it is in complementary\ndistribution (remember that word?) with finite auxiliary verbs like will, have and must,\nsuggesting that it is just another instance of I, despite its distinct \"look\".\n(32)\n*Mary arranged for Sue to will take the quiz early.\nWhat's with all of these complementizers and instances of I that have \"other lives\" as\nprepositions and other stuff?\n- Across the languages of the world, it is very common for \"function words\"\n(complementizers and I-elements especially) to be made of \"spare parts\", words used\nelsewhere with other, more robust meanings. Thus that is a C, but also a Det used for\nobjects remote from the speaker (as in that book); for is a C, but also a P; and to is an\nI, but also a P.\n- This fact is the result of a common process by which languages change, called\ngrammaticalization. Similar phenomena are very common. In many West African\nlanguages, for example, the word corresponding to the complementizer that is also the\nverb 'say', or can be shown to be historically derived from such a word. It is also very\ncommon for words that mean 'who' or 'what' to be recycled as 'that'. The modern\nRomance languages did that when they developed from Latin (which had no that-\nword).\nEnd of digression (from what we discussed in class).\n-6\n6. A possible universal of syntax: the Final-over-Final Constraint\n- We observed that the relative order of a head and the element that it merges with varies\nsystematically across languages. In particular:\n- English is a uniformly head-first language. The lexical item that heads a phrase always\nprecedes its sister within that phrase.\n- Japanese is a uniformly head-final language. The lexical item that heads a phrase\nalways follows its sister within that phrase.\nBut postulating a uniform \"head-first/head-last\" parameter across entire languages\noversimplifies the picture. Certain kinds of mixed languages do exist:\n(33)\nKinds of languages that exist:\na. head-initial languages:\nIn languages like English, a head of a phrase systematically precedes its sister (the\nelement it merged with):\nhead non-head\n...that Mary will read books\nb. head-final languages:\nIn languages like Japanese, a head of a phrase systematically follows its sister (the\nelement it merged with).\nnon-head head\n...Mary books read will that\nc. mixed languages type 1\nGerman (head-final V and I, head-initial C):\n...that Mary the book read will.\nVP:\nhead-final\n... [VP [NP das Buch ] lesen ]\nthe book\nread\nIP:\nhead-final\n... [IP [VP das Buch lesen ] wird ]\nthe book read\nFUT\nCP:\nhead-initial !!\n... [CP dass [IP Marie das Buch lesen hat ]\nthat\nMarie the book read FUT\n\nd. mixed languages type 2\nSpoken Afrikaans (head-final V, head-initial T and C)\n...that Mary will books read.\n...that she has often Chopin played.3\nVP:\nhead-final\n[VP [NP Chopin] gespeel ]\nChopin played\nIP:\nhead-initial\n!!\n[TP het [VP dikwels [NP Chopin] gespeel ]\nhas often\nChopin played\nCP:\nhead-initial\n!!\n[CP dat [TP sy het dikwels Chopin gespeel]]\nthat\nshe has often\nChopin played\n(Biberauer, Newton, Sheehan 2009)\n- ...but other kinds of mixed languages appear not to exist:\n(34)a. mixed languages type 3\nLiterary Martian (head-initial V and T, head-final C):\n... Mary will read books that.\n(does not exist on Earth!)\nb. mixed languages type 3\nOld High Venusian (head-initial V, head-final T and C)\n... Mary read books will that\n(does not exist on Earth!\n- This is called the Final-over-Final Constraint (FOFC):\n(35)\nThe \"Final-over-Final Constraint\" (FOFC): a linguistic universal\n(Holmberg 2000; Biberauer, Holmberg & Roberts 2010)\na. Within a single clause or noun-phrase, if a phrase is head-initial, the phrase that\nimmediately contains it must also be head-initial...\nb. ...but if a phrase is head-final, the phrase that immediately contains it may\nbe head-final or head-initial.\n- If correct, FOFC is (or is a by-product of) a principle of Universal Grammar -- a\nprinciple that restricts the ways in which languages vary (and restricts the\n\"search space\" for a child acquiring language).\nIs Mandarin Chinese a counterexample?\n- Mandarin Chinese has sentence-final particles that signal that the clause is a question\n-- above a VP and IP that generally look head-initial:\n3 The real-life example I have involves playing Chopin, not reading books. Go figure ...\n-7\n(36)\nNi yao kan zhe-ben shu ma?\n(Mandarin, Aldridge 2009)\nyou want read this-CL book Q\n'Do you want to read this book?'\n- Is Mandarin Chinese \"Literary Martian\" -- i.e. a language that's not supposed to exist\n(but does)?\nAs the team of researchers investigating FOFC note, however, we do not find this kind\nof apparent counterexample to FOFC with complementizers analagous to the English\ncomplementizers that or for (or German dass and Afrikaans dat).\nSo it is possible that elements like ma in (36) are not instances of C, but modifiers of C\nthat are allowed to be found on the right side in an otherwise head-initial CP.\n- Mandarin has other small \"particles\" (the traditional term) that occur CP-finally, and\nraise similar problems. For example, there is a clause-final particle le that can mark\nthe completion of an action (a notion often encoded in I), and has other effects on the\nuse of the sentence in discourse as well. Counterexamples to FOFC? Not really\ninstances of C I don't have a good answer, and it is worth thinking about.\n- Mandarin Chinese is also puzzling because its verbs precede their objects (as we\nexpect in a head-initial language) -- but in NP, relative clauses precede the noun they\nmodify. So it's a language that gives syntacticians lots to worry about ...\n7. Structure and meaning: Principle C\n- Consider the following pair of good English sentences:\n(37)a. Hillary claims that she likes pizza.\nb. She claims that Hillary likes pizza.\nBoth are acceptable, but in the first sentence, Hillary and she may corefer -- i.e. they\nmay pick out the same individual in the world. In the second sentence, however, this is\nimpossible. We can indicate coreference with identity of subscript indices, and present\nthe data as follows:\n(38)a. Hillaryi claims that shei likes pizza.\nb. *Shei claims that Hillaryi likes pizza.\n- The asterisk on (38b) means that the sentence is bad with the interpretation given by\nthe indices. The minute she and Hillary are understood as referring to two different\nindividuals, both sentences are fine -- and we would represent that by using some\nindex other than i on one of these NPs (and leaving out the asterisk).\nNow let's get down to business.\n- An obvious idea about why (38b) is bad:\n\n-8-\n(39)\nA plausible but wrong idea about (38)\nA pronoun may not corefer with a NP that it precedes.\n- Evidence that (39) is wrong comes from examples like the following. In the (b)\nexamples, the pronoun precedes an NP with which it is coreferent.\n(40)\na. This new book about Hillaryi claims that shei likes pizza.\nb. This new book about heri claims that Hillaryi likes pizza.\n(41)\na. Hillary'si enemies claim that shei likes pizza.\nb. Heri enemies claim that Hillaryi likes pizza.\n- It turns out that what distinguishes examples like (38b) from examples like (40b) and\n(41b) is not linear order but structure. Consider the relative positions of the pronoun\nand the NP Hillary in these examples:\n(38b)\nError! Reference source not found.b)\n(41b)\n- In examples like (38b) (and in response to questions, we looked at a bunch of them in\nclass) -- where her and Mary may not corefer -- a very particular relation holds\nbetween the pronoun and the full NP: the node that immediately dominates the\npronoun NP (her) also dominates the full NP (Mary). This relation is called c-\ncommand and turns out to be very important for all sorts of phenomena:\n(42)\nC-command\nA node α c-commands a node β iff:\na. the mother of α dominates β, and\nb. α does not dominate β.\n- C-command relations between pronouns and full NPs constraint the choice of possible\nreferents for the pronoun, i.e. what it may refer to. The constraint in question is called\nPrinciple C:\n(43)\nPrinciple C\nIf an pronoun NP x c-commands a full NP y,\nx and y may not be coreferent.\n- Principle C is one of a group of principles that constrain coreference possibilities\namong NPs. (There is also a Principle A and B, which you can read about in the\ntextbook.) We are learning about Principle C now, as an example of the relation\nbetween syntactic structure and meaning.\n- Syntactic structure is independent of meaning in many ways. For example, we know\nthat Chomsky's famous sentence Colorless green ideas sleep furiously is English, and\nthe same sentence backwards is not (*Furiously sleep ideas green colorless) -- despite\nthe fact that the good sentence is literally meaningless (unless understood\nmetaphorically).\n- At the same time, however, syntactic structure and meaning interact in many ways.\nPrinciple C is just one of them. In the next section, we consider another.\n4 We don't really need clause (b) of this definition for the purposes of this class, but it needs to be part of the\ndefinition of c-command for other reasons (and I can't bring myself to leave it out).\n\n-9-\n8. Meaning and the structure of NP\n- We saw that English and Japanese sentences have very similar structure. Sisterhood,\ndomination relations -- these are all the same in the English and Japanese sentences\nthat we discussed in class. Only word order was different.\n- What aspects of a sentence determine its meaning? Word order, or structure? In fact,\neven above and beyond questions of pronouns and coreference, the meaning of a\nsentence has a lot to do with its structure, and very little to do with word order.\n- We saw this by looking at how the meaning of multiple modifiers is computed.\nConsider NPs like Error! Reference source not found.)-(49), which have two adjectives\non the left side of the NP. The structure for these examples (details omitted) is (46):\n(44) a. a large small shirt\nb. a small large shirt\n(45)\na. a popular wrong answer\nb. a wrong popular answer\n(46)\nNP\nD\nN' #1\nAdj1\nAdj2\nN' #2\nN' #3\nThe meanings of these NPs is computed by first computing the meaning of Adj2 + N', and\nthen adding the meaning of Adj1 to the result. Thus, a large small shirt is a small shirt\nthat is on the large side. A small large shirt is a large shirt that is on the small side. A\ncommon wrong answer is an answer that is common within the set of wrong answers, but a\nwrong common answer is an answer that is common within the set of all answers -- and is\nwrong. Here are some similar pairs you might enjoy thinking about:\n(47)\na. an alleged English baron\nb. an English alleged bsron\n(48)\na. the priceless broken vase\nb. the broken priceless vase\n(49)\na. the recovered stolen property\nb. the stolen recovered property\nAddendum: Right-hand modifiers\nWe didn't spend much time at all on this additional point. (Blame the hurricane.) But it's\nworth paying some atention to.\nWith left-hand modifiers, the further to the right you are, the deeper \"inside\" the NP you\nare. Thus, Adj2 in (46) is deeper inside NP than Adj1 is.\nWith right-hand modifiers, just the opposite is true. The further to the left you are, the\ndeeper \"inside\" you are. Consider, for example, the tree in (50). PP1 is to the left of PP2,\nbut is further \"inside\" the tree than PP2 -- unlike Adj1 in (46), which is higher in the tree\nthan Adj2.\n(50)\nNP\nD\nN'\nN'\nPP2\nN'\nPP1\nConsider (51), for example. A shirt of great value may acquire a hole (due, for example,\nto moths), in which case it is no longer necessarily a shirt of great value. Thus, (51a) is a\nperfectly normal thing to say. A shirt of great value with a hole is not necessarily\nvaluable, just as an alleged English baron is not necessarily English. By contrast, a shirt\nwith a hole of great value is a shirt that has acquired a hole and -- in that state -- is\nvaluable! For example, the hole itself might have raised the value of the shirt, if (for\nexample) it is the shirt Lincoln was wearing when he was shot. In class I suggested that\nLincoln might have bought that shirt for $1 at Walmart, but of course it is now worth\nmillions. That is why (51b) is odd (marked by \"#\", which means \"not ungrammatical, but\nweird for some other reason\"):\n(51)\na. A shirt of great value with a hole is worthless.\nb. #A shirt with a hole of great value is worthless.\nHere are some other cutesy examples of the same sort. In (52a), we are talking about a\nman with an unusual last name, who happens to be from China. Well, Ng (= /ŋ/!) is an\nunusual last name in North America, even if it's common in China, so Mr. Ng qualifies as\nsuch a man. But Mr. Smith does not. In (52b), we are talking about a man from China\nwith an unusual last name. Bur Smith is an uncommon name among men from China, so\nMr. Smith qualifies for this designation. Ng is not an unusual name among men from\nChina, so Mr. Ng does not. Thus, we have the following judgments:\n(52)\na. the man with the unusual last name from China (#Smith, ok Ng)\nb. the man from China with the unusual last name (ok Smith, *Ng)\nThe examples in (53) make a similar point:\n(53)\na. A vehicle with one wheel missing with three wheels used to have four (#three).\nb. A vehicle with four wheels with one wheel missing used to have three (#four).\n\n- We don't want to say that sometimes meaning is computed right-to-left, and sometimes\nit is computed left-to right. Fortunately, we don't have to! It is the structure (as\nrepresented with tree diagrams) that determines how meaning is computed!\n...and that in turn gives us another argument for the reality of syntactic structure\n9. Movement\n- Certain sentences show apparent violations of subcategorization restrictions. In\nparticular, we see a gap where a phrase should be. Such a gap is unacceptable (see\n(54)-(55)) unless the gap is \"filled\" by a \"moved\" version of the missing phrase (see\n(56) and (57)). This phenomenon is called movement.\n(54)\na. The lion will devour this pizza.\nb. *The lion will devour.\n(55)\na. John can depend on Mary.\nb. *John can depend on.\nc. *John can depend.\n- The kind of movement seen in (56) below is called topicalization.\n(56)\nTopicalization (a kind of movement)\na. [This pizza] the lion will devour ___.\nb. [Mary] John can depend on __.\nc. [On Mary] John can certainly depend __!\n- The kind of movement seen in (57) is called wh-movement.\na. I wonder [what\nwhich pizza\nthe lion will devour __ ].\nI wonder [\n] the lion will devour ___ ].\n(57)\nWh-movement\nb. I wonder [who ] John can depend on __.\nc. I wonder [on whom] John can depend __.\n-10\nWh-movement applies to phrases that contain (usually at their left-periphery) a\nquestion-asking word -- which in English spelling usually starts with wh. The term is\nused even when describing other languages as well.\n- Sometimes, it is the I that is missing from its normal position, and appears elsewhere.\nIn these cases, we have I-to-C movement, usually found in \"yes/no\" questions.\nNotice that has in (58b) requires the participle form (written) of the main verb, just as\nif it were occupying its normal position:\n(58)\nI-to-C movement\na. Will the lion __ devour the pizza?\nb. Can John ___ depend on Mary?\nc. Did the children __ go to school?\n- Why think that the I is moving to C? Well, although in colloquial English (for many\nspeakers -- not all) I-to-C movement is possible in embedded clauses, as in (59)\n(where \"%\" indicates dialect variation)...:\n(59)\nI-to-C movement in an embedded clause (colloquial)\n%Bill is wondering [will he __ finish his homework on time]\n...this kind of I-to-C movement never cooccurs with an overt C in the embedded\nclause:\n(60)\na. *Bill is wondering [will that he finish his homework on time].\nb. *Bill is wondering [that will he finish his homework on time].\n- So C has something to do with the movement.\nHypothesis: A null C (evidence: no that) triggers I-to-C movement in English\nquestions.\n\n-11-\n(61)\n10. Specifier of CP\nSpecifiers: Certain heads require that the last merged element of the phrase that they label\nbe something special -- not a modifier, and certainly not a complement (by definition).\nThis is a bit of a mysterious requirement, and has a name, but not an explanation. We say\nthat these heads require a specfier. The main example of a genuine bona fide specifier\nthat we have seen so far is the subject position, specifier of IP.\n- What is the landing site for wh-movement?\nIn a Standard English main clause, wh-movement (of anything except the subject,\nactually) is always accompanied by I-to-C movement.\nI-to-C movement\n(62)\n[Which pizza] will the lion ___ devour ___\nwh-movement\nIf the position of I tells us the location of C, then we can conclude that wh\nmovement targets a position in CP just to the left of C.\nConclusion: Wh-movement forms a specifier of CP.\n(63)\n- Side remark (not discussed in class): In modern standard English, you only see wh\nmovement when C is null (not counting an I that moved to it). Other languages,\nincluding earlier stages of English, are different -- so there is no general ban on seeing\nboth a wh-phrase and a complementizer in the same CP:\n(64)\na.\nSpecifier of CP + overt C in other languages\nIk weet niet wie of Jan gezien heeft.\nI know not who if John seen has\n[Dutch]\nb. Men shal wel knowe who that I am.\n[Middle English]\nc. Je me demande quand que Pierre est parti.\nI wonder\nwhen that Pierre has left\n[colloquial French]\n\n11. A way of thinking about movement: \"internal merge\"\nMerge so far...\n- Ingredients: independent lexical items or independent results of previous\noperations of Merge\nMovement = Merge, where one of the ingredients is a subconstituent of another\nTerminology:\na. External Merge (ingredients are independent, what we've done so far)\nb. Internal Merge (= movement)\nHow phonology interprets movement.\n- The syntax sends an instruction to the phonology (in many cases) to not pronounce the\nphrase in its original position.\nThe original position of the phrase is also known as the trace of movement.\n12. Wh-movement leaves something behind\n- The wh-all construction: Many dialects of English use what all and who all as\noptional plural forms of who and what. For example, if I ask Who all did you invite __\nfor dinner?, I presuppose that you are inviting more than one person. Thus, the word\nall, when used with who and what, is a plural morpheme.\n- The West Ulster version: The wh-all construction of West Ulster English (Northern\nIreland; data from McCloskey 2000) has a special possibility not found in other\ndialects. The all may be pronounced in the position where the wh-phrase \"would have\nbeen found\" if movement had not taken place. Thus, both variants in (65)-(67) are\nacceptable in this dialect of English (though only the first member of each pair is\nacceptable in other dialects):\n(65)\na. What all did you give __ to the kids?\nb. What did you give __ all to the kids?\n(66)\na. Who all did you send __ to the shops?\nb. Who did you send __ all to the shops?\n(67)\na. Tell me what all you got __ for Christmas.\nb. Tell me what you got __ all for Christmas.\n- What might be going on: A different pronunciation pattern. Optionally, part\nof the trace (all) gets pronounced, and the corresponding part \"upstairs\" does\nnot get pronounced:\n-12\n(68)\na. Tell me what all you got what all for Christmas.\nb. Tell me what all you got what all for Christmas.\n- It is important to make sure that the all is not simply free to occur anywhere -- that it\nreally does single out the position of the \"trace\". The following data show this.\n(69) *Who did he tell __ that he was going to resign all.\n(70)\na. What did you do __ all after school the day?\nb. *What did you do __ after school the day all?\nc. *What did you do __ after school all the day.\n13. Verb movement in German: the \"Verb-second\" phenomenon\nSplit pronunciation after movement is not unique to wh-movement. In the next\nsection, we see it in German V-to-C movement. First, some preliminary\ninformation about German:\nFamou facts about German\n- Subordinate clauses: In a normal embedded clause, the verb follows its\ncomplements. German thus looks like Japanese.\n(71)\nV follows its complements in a normal embedded clause\n...dass die Frau\n[gestern\nden Mann\nsah].\n...that the woman-SUBJ\nyesterday the man-OBJ saw\n'...that the woman saw the man yesterday.'\n- Main clauses: The main clause of a German sentence has two particular properties of\nnote:\n1. one phrase is always topicalized; and\n2. the verb is found in a surprising place -- immediately after the topicalized phrase.\nThis yields what is called the Verb-second (V2) property of German. V2 arises from two\ndifferent instances of movement, both of which take place in a German main clause.\nMovement 1: V-to-C\n- V2 is found whenever C is not filled by the word dass. This is true in main clauses,\nbut also in some subordinate clauses as well.\nHypothesis: A null C (evidence: no dass) triggers V-to-C movement in German\nThis gets us Verb-first so far. What about Verb-second?\n\n-13-\nMovement 2: Topicalization to Spec,CP (= \"specifier of CP\")\n- When C is null, it not only requires the verb to move to its head, it also requires a\nspecifier. That is why we always have topicalization as well.\nHypothesis: A null C also triggers movement to Spec,CP in German.\nThis yields Verb-second.\n(72)\nVerb-second in German\nV-to-C movement\na. Die Frau\nsah ___ gestern [ den Mann\nv] .\ntopicalization\nthe woman-SUBJ saw\nyesterday the-OBJ man\n'The woman saw the man yesterday.'\nb. Den Man\nsaw the woman-SUBJ yesterday\nsah die Frau\n[gestern ____ v].\nthe man-OBJ\n'The man the woman saw.'\nc. Gestern sah die Frau\n[___ den Mann\nv] .\nyesterday saw the woman-SUBJ\nthe man-OBJ\n'Yesterday the woman saw the man.'\n- In (72), the topicalized phrase has a dotted underline, the verb is boldfaced, and the VP\nis bracketed. The underline marks where the topicalized phrase came from, and the\nitalic v marks where the verb came from. Here is (72b) in tree form, so you can see\nmore explicitly how this works:\n(73)\nStructure for (72b)\n14. German Verb-second and complex phonology!\n- Prefixed verbs: In German, some verbs with prefixes, when they move, pronounce\nthe only the root in the moved position, and pronounce the prefix in the original\nposition.\n(74)\nAn example like (71), but with a morphologically complex verb root\n...dass die Frau\n[jetz\ndas Licht\nan-macht].\n...that the woman-SUBJ\nnow\nthe light-OBJ on-makes\n'...that the woman is now turning on the light.'\n(75)\nWhat happens to anmacht in a V/2 environment?\na. Die Frau\nmacht ___\n[jetzt\ndas Licht\nan-v] .\nthe woman-SUBJ makes\nnow the light-OBJ on\n'The woman is now turning the light on.'\nb. Das Licht\nmacht die Frau\n[jetzt ___ an-v].\nthe light-OBJ\nmakes the woman-SUBJ\nnow\non\n'The light the woman is now turning on.'\nc. Jetzt macht die Frau\n[___ das Licht an-v].\nnow makes the woman-SUBJ\nthe light-OBJ on\n'Now the woman is turning on the light.'\n\nCP\n\nC'\n\nNP\nC\nIP\n\nsah\n\nNP\n\nI'\n\nN'\n\nN'\n\nVP\n\nI\nDet\nN\nDet N\n\nAdv\nV'\nPast\nden\nMann die\nFrau\n\ngestern NP V\n\nN'\n\nsah\n\nDet\n\nden Mann\n\n-14-\n- The verb \"leaves its prefix behind\" -- just as what in W.Ulster wh-all can\n\"leave all behind\".\n(76)\nDie Frau\nan-macht ___\n[jetzt\ndas Licht\nan-macht] .\nthe woman-SUBJ\nmakes\nnow the light-OBJ on\n'The woman is now turning the light on.'\n\"The Germans have another kind of parenthesis, which they make\nby splitting a verb in two and putting half of it at the beginning of an\nexciting chapter and the other half at the end of it. Can any one\nconceive of anything more confusing than that? These things are\ncalled \"separable verbs.\" The German grammar is blistered all over\nwith separable verbs; and the wider the two portions of one of them\nare spread apart, the better the author of the crime is pleased with\nhis performance. A favorite one is reiste ab -- which means,\ndeparted. Here is an example which I culled from a novel and\nreduced to English:\nThe trunks being now ready, he DE- after kissing his mother and\nsisters, and once more pressing to his bosom his adored Gretchen,\nwho, dressed in simple white muslin, with a single tuberose in the\nample folds of her rich brown hair, had tottered feebly down the\nstairs, still pale from the terror and excitement of the past evening,\nbut longing to lay her poor aching head yet once again upon the\nbreast of him whom she loved more dearly than life itself,\nPARTED.\"\n-Mark Twain, \"The Awful German Language\"\n15. I-to-C in German\n- Actually, the main verb moves to C only when there is no auxiliary verb in I.\n- When there is an auxiliary verb in I, the auxiliary verb moves to C (and the main verb\nis left in VP).\n(77)\na. Die Frau\nhat [gestern\nden Mann gesehen] hat.\nthe woman-SUBJ has yesterday the-OBJ man seen\n'The woman saw the man yesterday.'\nb. Den Man\nhat die Frau\n[gestern\n____ gesehen] hat\nthe man-OBJ\nhas the woman-SUBJ yesterday\nseen\n'The man the woman saw.'\nc. Gestern hat die Frau\n[ ___\nden Mann\ngesehen] hat\nyesterday saw the woman-SUBJ\nthe man-OBJ seen\n'Yesterday the woman saw the man.'\n- What is really happening in V2 is probably not V-to-C but V-to-I and then I-to-C\n(which takes the Verb along).\n16. V/2 on four continents\nEUROPE!\nGerman (Germanic group of the Indo-European family of languages, Western Europe)\nSubordinate clause:\nverb is at the end\nMain clause:\nmain verb follows the first phrase (or comes first),\nunless there's an auxiliary verb, in which case the\nauxiliary verb follows the first phrase and the main verb\nis at the end.\nAFRICA!\nVata (Kru family of languages; Ivory Coast, Africa)\nverb follows the first phrase (or comes first),\nunless there's an auxiliary verb, in which case the\nauxiliary verb follows the first phrase and the main verb\nis at the end.\n[work of Hilda Koopman]\n[like German, except subordinate clauses behave like main clauses]\n\nI\n(78)\nVata verb-second\na. N le bI saka.\neat now rice\nb. n ka yO-O\nsle-e\nmlI saka nyE\nI will child-the house-the in rice give\nc. a la\nsaka li\nwe have rice eat\n'we have eaten rice'\nASIA!\nKashmiri (Indo-Aryan family of languages; Indian subcontinent)\nverb follows the first phrase,\nunless there's an auxiliary verb, in which case the\nauxiliary verb follows the first phrase and the main verb\nis at the end.\n[work of Rakesh Bhatt]\n(79)\nKashmiri verb-second\na. raman\ndits shamas\nkitab.\nram+SUBJ gave sham-IO book\nb. ram\nchu shamas\nkitab divan\nram+SUBJ is\nsham-IO book giving\nc. varI-varI chu ram bat khevan.\nslowly\nis ram rice eating\nSOUTH AMERICA!\nKaritiana (Arikem family of languages, Rondonia state, Brazil)\nSubordinate clause:\nverb is at the end\nMain clause:\nmain verb follows the first phrase (or comes first),\nunless there's an auxiliary verb, in which case the\nauxiliary verb follows the first phrase and the main verb\nis at the end.\n[work of Luciana Storto]\n-15\n17. The Big Picture (and how verb-second is relevant to it)\n(80)\nWhat we find:\nLanguages are not all the same, but the ways in which they differ are highly\nrestricted. The same peculiar bits show up again and again, all over the world.\nWhat's the same is called Universal Grammar (UG)\nWhat's different are settings of parameters within UG.\nAn acquisition perspective on UG and parameter setting:\n- UG reflects our genetic endowment for language\n- Parameter setting reflects our linguistic experience in early childhood.\n- For example, though we don't find verb-second in all the languages of the world, we\ndo find it popping up repeatedly -- as we just saw.\n- On the other hand there are some types of languages that are just as easy to describe in\nwords as the verb-second languages, which we never find:\n(81)\nSome languages that don't exist anywhere (as far as we know):\na. Like German, but patterns of embedded and main clause are reversed.\nb. Main verb must follow the second phrase, third phrase, etc.\nc. Not the main verb, but the direct object must follow the first phrase.\n18. Some other parameters (and how they are set in a few languages)\n[See Baker's book for much more,]\n1. Subject pro-drop\n(82)\nItalian: +\na. Io parlo italiano\n(I) speak Italian\nb. Noi parliamo italiano\n(we) speak Italian\n(83)\nChinese: +\nTa kanjian\n(he) see\n'He saw him'.\nta le.\nhe LE\n(84)\nEnglish:\n*(We) speak English.\n\n-16\n2. Object pro-drop\n(85)\nChinese: +\nTa kanjian ta\nle.\nhe see\n(him) LE\n(86)\nItalian:\n*Gianni lo\nvede.\nGianni (him) sees.\n(Object pronouns generally move to the left of I in Italian.)\n(87)\nEnglish:\n*John saw him.\n(92)\n(93)\n...in English compounding\na. I disapprove of meat eating in here. (i.e. meat getting eaten)\nb. *I disapprove of baby eating in here. (i.e. babies eating dinner)\n...in Mohawk \"incorporation\"\n*Wahawirake' ne o'wahru.\nbaby-ate\nthe meat\n'The baby ate the meat.'\n(compare (89))\n3.\n(88)\n(89)\nPolysynthesis\nEnglish: [+ incorporation into N] (and A), but [- incorporation into V]\na, I disapprove of book-burning\nb. A user-friendly computer is a distant goal.\nc. *The baby meat-ate last night.\nMohawk: [+ incorporation intoV]\nOwira'a waha'-wahrake'.\nbaby\nmeat-ate\n(Baker p. 91)\nMohawk:\npolysynthesis (V):\n+\n(\"incorporation\")\nsubject pro-drop:\n+\nobject pro-drop:\n+\n(90)\na. Wa'eksohare'\n'She dishwashed'\nb. Wa'kenaktahninu'\n'I bed-bought.'\nc. Wahana'tarakwetare'\n'He bread-cut.'\nEnglish:\npolysynthesis (V):\n--\nsubject pro-drop:\n--\nobject pro-drop:\n--\n(91)\nThe verb-object constraint\nThe object of a verb must be the first noun (phrase) to combine with the verb; the\nsubject cannot combine with the verb until after the object does.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Slides: Dialects",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/1038e8418c6adeaacf5704cc1cbcd976_MIT24_900F12_Dialects.pdf",
      "content": "Dialects\nNote: Many of the examples used in this slide presentation were taken from the book\nAfrican American English: A Linguistic Introduction by Lisa J. Green.\nGreen, Lisa J. African American English: A Linguistic Introduction. Cambridge University Press, 2002.\n(c) Cambridge University Press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nArthur the Rat\n\n1.Brooklyn, NY 70-year old white female with college education\n2.Rural community in nME 73-year old white male with high\n\nschool education\n3.Roxbury section of Boston, MA young black female with high\nschool education\n4.Memphis, TN 72-year old black man with college education\n5.Island in eVA middle-aged white male with high school education\n6.Small city in scGA\n\nmiddle-aged white female with college\neducation\n7.Wichita Falls, TX middle-aged white male with (probably) high\nschool education\n8.Village in nwWA 74-year old white male with high school\neducation\n9.Small city in nwWI middle-aged white woman with college\neducation\n\nSource: http://www.courses.fas.harvard.edu:80/~ling80/audio/\nA short tale devised to obtain phonetic representation from through out the\ncountry of all phonemes in American English. See link at bottom of page.\n\nGIRLS' RHYME: BOSTON, 1970s\n\nExtra, extra, read all about it.\nAll the boys are mentally retarded.\n\nA rhyme????\n\nəbawt ət ɹətɑɹdəd\nflapping\nəbawɾ ət ɹətɑɾəd\ndediphtongization əba:ɾ ət ---\nr-drop\n---\nɹəta:ɾəd\n\nGIRLS' RHYME: BOSTON, 1970s\nExtra, extra, read all about it.\nAll the boys are mentally retarded.\nResult:\nəba:ɾ ət ɹəta:ɾəd\n\nSAKS FIFTH AVENUE\nImage courtesy of Kent Manning on Flickr.\nMACY'S\nImage courtesy of Ruben Moreno Montoliu on Flickr.\nKLEIN'S\nImage courtesy of New York Public Library Digital Gallery.\n\nSaks\n\nMacy's\nKleins\n\nall r\n\n24%\n\n22%\n\n6%\n\nsome r\n\n46%\n\n37%\n\n12%\n\nno r\n\n30%\n\n41%\n82%\n\nSaks\n\nground floor\n\nupper floor\n\nall r\n\n23%\n\n34%\n\nsome r\n\n23%\n\n40%\n\nno r\n\n54%\n26%\n\nSaks - Macy's - Klein's (1962)\nupper floor - lower floor\n\nFloorwalkers\n\nSales\n\nStockboys\n\nall r\n\n46%\n\n18%\n\n7%\n\nsome r\n\n8%\n\n35%\n\n14%\n\nno r\n\n46%\n\n47%\n79%\n\nfloorwalker - cashier - stockboys\n\nAfrican American Vernacular English (AAVE)\nIn 1965: Office of Education commissions William Labov to\nconduct a study of linguistic factors that might contribute to\nreading difficulties among African-American school-age children.\nLabov, William. Language in the Inner City: Studies in the Black\nEnglish Vernacular. University of Pennsylvania Press, 1973.\n(c) University of Pennsylvania Press. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nr → ø / ___ {C, #}\n\nrhymes:\nguard\ngod\nnor\ngnaw\ncourt\ncaught\n\n(compare upper-class British)\nAfrican American Vernacular English (AAVE)\nPhonological features of AAVE\nr (and l) deletion\nLabov, William. Language in the Inner City: Studies in the Black English Vernacular. University of Pennsylvania Press, 1973.\n(c) University of Pennsylvania Press. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nr (and l) deletion\n\nl → ø / ___ {C, #}\n\nrhymes:\ntoll toe\nall\nawe\nhelp hep\n\nAfrican American Vernacular English (AAVE)\nPhonological features of AAVE\ncompare proto-Slavic→Polish: Russian [dɑl], Polish [daw] 'gave'\nLabov, William. Language in the Inner City: Studies in the Black English Vernacular. University of Pennsylvania Press, 1973.\n(c) University of Pennsylvania Press. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\nPhonological features of AAVE\n\nsyllable coda cluster reduction ...\n\n[hæn]\n'hand'\n[dɛs]\n'desk'\n[pows] 'post'\n[pæs]\n'passed'\n[mæs]\n\n'mask'\n[gɪf]\n\n'gift'\n[bowl]\n'bold'\n\nAfrican American Vernacular English (AAVE)\nPhonological features of AAVE\n\nsyllable coda cluster reduction\n\nexcept when the coda cluster is of the form\n\n[+voiced] [-voiced]\n\n[hæn] 'hand'\nvs.\n[pænt] 'pant'\n\n[kowl] 'cold'\nvs. [kowlt] 'colt'\n\nExceptions: ain' and don'\n\nAfrican American Vernacular English (AAVE)\nConsequences for perception of past-tense/participial morphology\n\n[pʊʃ]\n'push' or 'pushed'\n[pejdʒ]\n'page' or 'paged'\n[rejz]\n'raise' or 'raised'\n[dʒʌmp]\n'jump' or 'jumped'\n[mɪs]\n'miss' or 'missed' (or 'mist')\n\nfrom Labov (via Green):\n- 'He pick me'\n- 'I've pass my test.'\n- 'Last week I kick Donald in the mouth, so the teacher throwed me\nout the class.'\n\n...with predictable consequences for classroom performance on\nreading/writing tasks involving this suffix (Labov).\nLabov, William. Language in the Inner City: Studies in the Black English Vernacular. University of Pennsylvania Press, 1973.\n(c) University of Pennsylvania Press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\nLexical features of AAVE\n\nZero copula\n\na. He wild.\n\nb. She real nice.\n\nc. He not American.\n\nd. If you good, you going to heaven.\n\nInvariant\n\nbe\na. He be wild.\nb. Sometime she be fighting.\nc. She be nice and happy.\nf. Sue be knowing that song.\ng. Sam's wholesale stores be on the outskirts of town.\n\nIrish:\nIs\n\nfear\ne.\n\nman\nhim\na.\nCOP\n\n'He is a man.'\n\nIs\n\ne.\nfuar\n\nCOP cold(hearted) him\n\n'He is a coldhearted person.'\nTa se ina fhear.\n(anois).\n\nb.\nCOP he in-his man\n(now)\n\n'He is a man (now).', i.e. 'He has become a man.'\n\nTa se fuar\n\nCOP he cold\n\n'He is cold.' (i.e. 'He feels cold.')\n(source: Wikipedia, yes really)\nAfrican American Vernacular English (AAVE)\n\nAfrican American Vernacular English (AAVE)\nSpanish:\n\na.\n\nSoy norteamericano.\nI.am North.American\n\nEstoy cansado.\nI.am tired\n[ser]\n\nb.\n\n[estar]\n\nAAVE Zero copula:\n\nintrinsic property\n\na. He wild.\n\n'He's a wild person'\n\nb. She real nice.\n\n'She's a nice person'\n\nc. He not American.\n\nd. If you good, you going to heaven.\n\nAfrican American Vernacular English (AAVE)\n\nAfrican American Vernacular English (AAVE)\nAAVE Invariant be: situation-dependent property, habitual\n\na. He be wild.\n\n'He's acting wild/shows signs of wildness'\n\nb. Sometime she be fighting.\n\nc. Sometime when they do it, most of the problems always be\nwrong.\n\nd. She be nice and happy.\n\ne. Sue be knowing that song.\n(i.e. when we ask her, it generally turns out that she\nknows the song)\n\nf. Sam's wholesale stores be on the outskirts of town.\n\nAfrican American Vernacular English (AAVE)\n\"The Buys.\" Episode 3 from Season 1 of the series \"The Wire.\" Home Box Office, 2002.\n(c) Home Box Office. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\n\"The Buys.\" Episode 3 from Season 1 of the series \"The Wire.\" Home Box Office, 2002.\n(c) Home Box Office. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\n\"The Buys.\" Episode 3 from Season 1 of the series \"The Wire.\" Home Box Office, 2002.\n(c) Home Box Office. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\n\"The Buys.\" Episode 3 from Season 1 of the series \"The Wire.\" Home Box Office, 2002.\n(c) Home Box Office. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\nThey [ø] like the front line.\n[ø→ser]\nThey [be] out in the field.\n\n[be→estar]\n(lit. \"They are always fighting.\")\n\"The Buys.\" Episode 3 from Season 1 of the series \"The Wire.\" Home Box Office, 2002.\n(c) Home Box Office. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\nPart of a rich tense/aspect system that includes:\n\n1. Present progressive:\n\nHe runnin.\n2. Present habitual progressive: He be runnin. (\"aspectual be\n\")\n3.\n\nPresent intensive hab.prog:\n\nHe be steady runnin.\n4. Present perfect progressive:\nHe bin runnin\n\n'He has been running.'\n5. Present perfect with remote inception:\n\nHe BIN runnin.\n'He has been running for a long time (and still is).'\n\nand more ...\n\nAfrican American Vernacular English (AAVE)\nGreen, Lisa J. African American English: A Linguistic\nIntroduction. Cambridge University Press, 2002.\n(c) Cambridge University Press. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\n\nAspectual be and ø-copula\n\na.\n\nBruce run.\n'Bruce runs on occasions.'\n\nb.\n\nBruce Ø running.\n'Bruce is running now.' or 'Bruce is running these days.'\n(i.e. it's part of who he is)\n\nc. Bruce be running.\n'Bruce is usually running.' or 'Bruce usually runs.'\n\nAfrican American Vernacular English (AAVE)\n\nmore about \"Aspectual be\n\"\na.\n\nShe be telling people she eight.\n'She is always telling people she's eight.'\n\nb. It be knives in here.\n\nIt be ice picks in here.\n\n'There are usually knives in here. There are usually\nicepicks in here.'\n\nb. He doesn't even allow women to wear pants at women's\n\nretreats and he doesn't even be there.\n\n'...and he isn't even usually there'\n\nc. She gotta be there for 9m so they be dɔn gone to school.\n'She has to be there at 9, so they have usually already gone\nto school.'\n\nAfrican American Vernacular English (AAVE)\nSide point: expletive\nit\n\nIt be knives in here.\n\nIt be ice picks in here.\n\n'There are usually knives in here. There are usually\nicepicks in here.'\n\nCompare French expletive il:\n\nIl y a des couteaux ici.\n\nIt is INDEF knives here\n'There are knives here.'\n\nAfrican American Vernacular English (AAVE)\n\nSide point: expletive it\nLH (age 16): You know, like, ah, some people say if you're good an' shit,\nyour spirit goin' to heaven, an' if you good--be bad, your spirit\ngoin' to hell, well bullshit, your spirit goin' to hell anyway, good or\n\nbad.\nKC: Why?\nLH: Why? why? I'll tell you why. 'Cause you see, doesn't nobody really\nknow that it's a God, you know. 'Cause I mean I have seen black\ngods, pink gods, white gods, all color gods, and don't nobody know\nit's really a God, and when they be sayin'' if you good you're goin'\nto heaven, that's bullshit.\nKC: Is that so?\nLH: You ain't goin' to no heaven. 'Cause it ain't no heaven for you to\ngo to.\n\n(W. Labov)\n\nAfrican American Vernacular English (AAVE)\n\"Aspectual be\n\n\": interesting semantic complications\n\na.\n\nSome of them be big and some of them be small.\n\nb.\n\nSam's wholesale stores be on the outskirts of town.\n\nc. Some iMacs be tangerine.\nbut...\nDo Sam's wholesale stores move around?\n\nIsn't color an intrinsic property of an iMac?\n\nAfrican American Vernacular English (AAVE)\n\"Remote past BIN\n\n\": interesting semantic complications\n\"BIN situates an activity or state (or some part thereof) in the\nremote past.\"\n\neffect of stress:\n\nremote past BIN:\nShe BIN running.\n'She has been running for a long time.'\n\npresent perfect\n\nbin:\nShe bin running.\n\n'She has been running'\n\nShe bin had him all day.\n'She has had him all day'\n\nAfrican American Vernacular English (AAVE)\n\"Remote past BIN \"\nI BIN knowing he died.\n'I have known for a long time that he died.'\n\nA: The police going bad.\nB: They ain't going bad. They BIN bad.\n\n'They aren't going bad. They have been bad for a long time.'\n\nHe BIN a preacher there.\n'He has been a preacher for a long time.'\n\nA: Where'd you get that shirt?\nB: I BIN had it.\n\n'I have had it for a long time.'\nA: Hunh\nB:\n\nI BIN got it.\n\n'I got it a long time ago.'\n\nAfrican American Vernacular English (AAVE)\nverbal marker\n\ndɔn\n\"The verbal marker dɔn denotes that an event has ended.\"\n\nI told him you dɔn changed.\n'I told him that you have changed.'\n\nA: You through with Michael Jordan [a magazine] I bought you?\nB: I dɔn already finished that.\n\n'I have already finished that.'\n\nA: Push your seat.\nB: I dɔn pushed it.\n'I already pushed it'\nA: Push it again.\n\nAfrican American Vernacular English (AAVE)\ncompositional semantics\nbe dɔn: habitual resultant state\n\nA: Y'all keep up with the news, hunh?\nB: Yeah, when it come on there, we be dɔn read it in the newspaper.\n'Yeah, by the time the news comes on there (on TV), we have\nusually already read it in the newspaper.'\n\nShe gotta be there for 9, so they be dɔn gone to school.\n'She has to be there at 9, so they have usually already gone to school\nby then'\n\nAnybody who don' have no money and jus' be dɔn got paid, must be\non drugs.\n'It is usually the case that anybody who doesn't have any money but\nhas just gotten paid must be on drugs.'\n\nAfrican American Vernacular English (AAVE)\ncompositional semantics\nBIN dɔn: remote past resultant state\n\nYou should'a BIN dɔn called me down there.\n'You should have called me down there a long time ago,'\n\nHe BIN dɔn put that in there.\n'He put that in there a long time ago.'\n\nAfrican American Vernacular English (AAVE)\nAnd what about ...\n\nbe BIN\n\nBIN be\n\nAfrican American Vernacular English (AAVE)\nAnd what about ...\n\n*be BIN\n\n*Bruce be BIN running.\n'It usually the case that Bruce was running a long time ago.'\n\n*BIN be\n\n*Bruce BIN be running.\n'A long time ago, Bruce was in the habit of running.'\n\nAfrican American Vernacular English (AAVE)\nverbal marker steady\nPrecedes a verb form in the progressive to indicate that \"an activity is\ncarried out in an intense or consistent manner.\"\n\nThey want to do they own thing, and you steady talking to them.\n'They want to do their own thing, and you're continuing to talk to\nthem.'\n\nNow that you got the new life, Satan steady bothering you.\n'Now that you have a new life, Satan is consistently bothering you.'\n\nMay follow habitual\n\nbe\n\nThem students be steady trying to make a buck.\n\nAfrican American Vernacular English (AAVE)\n\nNegative concord in AAVE:\n\nHe don' do nothin'.\n'He does nothing'\n\nNegative concord in Russian:\n\nOn ne delaet nicego.\nhe not does nothing\n'He does nothing.'\n\n*On delaet nicego.\n\nAfrican American Vernacular English (AAVE)\nRESOLUTION OF THE BOARD OF EDUCATION\nOakland, CA (1996)\nContent removed due to copyright restrictions.\nTo view the 1996 Oakland, CA Board of Education resolution on Ebonics, go to: http://linguistlist.org/topics/ebonics/ebonics-res1.html\n\nAfrican American Vernacular English (AAVE)\n\"EBONICS: THE SELF-ESTEEM MOVEMENT GOES OFF\nTHE DEEP END\" Jeff Jacoby, Boston Globe, 1997\nOakland's Board of Education drew nationwide scorn with its\nrecent vote to teach black schoolchildren in ghetto-ese [...]\nThis is the self-esteem movement gone insane. For generations,\ncountless millions of poor English speakers viewed mastery of the\nlanguage as a critical key to success and self-respect. Now come\nthe Ebonics extremists, and proclaim the opposite: Make young\nblack Americans learn proper English and their cultural pride will\nbe shattered.\nIf we degrade their language,'' says one Los Angeles Ebonics\ninstructor, we're degrading their whole home environment, their\nwhole race. That creates a filter; they just tune us out.'' Translation:\nBlack children are too dumb to learn good English. If you're\nlooking for racism, look no further.\"\nJacoby, Jeff. \"The Self-Esteem Movement Goes Off The Deep End,\" Boston Globe, January 23, 1997.\n(c) The Boston Globe. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\n\"Black ghetto dialect is no more immutable than the bungled\nEnglish of those Jewish greenhorns from Eastern Europe. I know\nof one immigrant from Czechoslovakia who couldn't speak a word\nof English when he got off the boat in 1948. Twenty months later,\nrecuperating in Colorado from an illness, he wrote a letter to his\nrelatives in Cleveland:\n\"Where were you that time what you wrote me? Do you get\ntogether after with each other? Rita changed her mind and wrote\nme a letter, but I do not think that I will answer it. How is she with\nyou, did you talk to her and when, not because it interest me just I\nwant to know what did she told you about me.''\nThat young immigrant struggling to write in English was my\nfather. \"\nJacoby, Jeff. \"The Self-Esteem Movement Goes Off The Deep End,\" Boston Globe, January 23, 1997.\n(c) The Boston Globe. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\nActor Bill Cosby\n\nThis image is in the public domain. Source: Wikimedia Commons.\n\nAfrican American Vernacular English (AAVE)\nMay 2004 speech by Bill Cosby to an NAACP ceremony\ncelebrating the 50th anniversary of Brown vs. Board of Education\n\"Brown Versus the Board of Education is no longer the white\nperson's problem. We've got to take the neighborhood back. We've\ngot to go in there. Just forget telling your child to go to the Peace\nCorps. It's right around the corner. It's standing on the corner. It\ncan't speak English. It doesn't want to speak English. I can't even\ntalk the way these people talk. \"Why you ain't where you is go,\nra,\" I don't know who these people are. And I blamed the kid until\nI heard the mother talk. Then I heard the father talk. This is all in\nthe house. You used to talk a certain way on the corner and you\ngot into the house and switched to English. Everybody knows it's\nimportant to speak English except these knuckleheads. You can't\nland a plane with \"why you ain't...\" You can't be a doctor with that\nkind of crap coming out of your mouth. There is no Bible that has\nthat kind of language.\"\n\n(c) Bill Cosby. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\n\nAfrican American Vernacular English (AAVE)\n\nContent removed due to copyright restrictions.\nTo view the Linguistic Society of America's Resolution on the Oakland \"Ebonics\" issue, go to:\nhttp://www.linguisticsociety.org/about/what-we-do/resolutions-statements-guides/lsa-res-ebonics\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Slides: Semantics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/78381a742646641c115842a114a36287_MIT24_900F12_Semantics.pdf",
      "content": "Semantics\nThese slides were produced by Hadas Kotek.\nhttp://web.mit.edu/hkotek/www/\n\nSentence types\nWhat is the meaning of a sentence?\n\nThe lion devoured the pizza.\n\nStatement\n\nSentence types\nWhat is the meaning of a sentence?\n\nWho devoured the pizza?\nDid the lion devour the pizza?\n\nQuestion\n\nSentence types\nWhat is the meaning of a sentence?\n\nDo your homework!\n\nCommand\n\nSentence types\nWhat is the meaning of a sentence?\n\nIt's cold here ....\nDo you know what time it is?\n\nSentences might convey additional non-literal meaning\n\nWhat do sentences mean?\n(1) The capital of Canada is Ottawa\n(2) The capital of Canada is Montreal\n\nWhat do sentences mean?\n(1) The capital of Canada is Ottawa\n(2) The capital of Canada is Montreal\n\nThe meaning of a sentence is related to whether it is\ntrue or false (its truth value).\n\nIn the actual world:\n- (1) is True\n- (2) is False\n\nWhat do sentences mean?\nBUT: This can't be all, since the truth-values of\nsentences can change over time or situations\n\nReese is in room 20\nThe cat is on the mat\n\nWhat do sentences mean?\nWe can grasp the meaning of a sentence without\nknowing whether it's true or false.\n\nThe name of the person sitting closest to the door\nstarts with a \"D.\"\n\nWhat do sentences mean?\nWe can grasp the meaning of sentences we've never\nheard before.\n\nThe furry cat ate the red jellybean\n\nDefinition: Semantics and meaning\nThe semantic competence of a speaker:\nThe ability, when presented with a sentence and a\nsituation, to tell whether the sentence is true or false in\nthe situation.\n\nDefinition: Semantics and meaning\nThe semantic competence of a speaker:\nThe ability, when presented with a sentence and a\nsituation, to tell whether the sentence is true or false in\nthe situation.\n\nTo know the meaning of a sentence is to know its\ntruth conditions.\n- That is, we know what the world would have to look like in\norder for the sentence to be true.\n\nHow can we specify the meanings of infinitely many\nsentences in natural language?\n\nThe scary lion devoured the mushroom pizza\nthat I ordered last night\nBuilding a semantic system\n\nObservation: The interpretation of a sentence depends\non its syntactic structure. Different phrases make\npredictable contributions to the meaning of a sentence.\n\nThe cat chased the rat\nBuilding a semantic system\n\nObservation: The interpretation of a sentence depends\non its syntactic structure. Different phrases make\npredictable contributions to the meaning of a sentence.\n\nThe cat chased the rat\nThe rat chased the cat\nBuilding a semantic system\n\nObservation: The interpretation of a sentence depends\non its syntactic structure. Different phrases make\npredictable contributions to the meaning of a sentence.\n\nThe cat chased the rat\nThe grey cat chased the rat\nThe grey cat with the hat chased the rat\nBuilding a semantic system\n\nObservation: The interpretation of a sentence depends\non its syntactic structure. Different phrases make\npredictable contributions to the meaning of a sentence.\n\nThe cat chased the rat\nThe cat chased the dog\nBuilding a semantic system\n\nObservation: The interpretation of a sentence depends\non its syntactic structure. Different phrases make\npredictable contributions to the meaning of a sentence.\n\nThe cat chased the rat\nThe cat licked the rat\nBuilding a semantic system\n\nObservation: The interpretation of a sentence depends\non its syntactic structure. Different phrases make\npredictable contributions to the meaning of a sentence.\n\nThe cat chased the rat\nA cat chased the rat\nBuilding a semantic system\n\nDefinition: Compositional semantics\nThe principle of compositionality:\nThe meaning of a sentence depends\nonly on the meanings of its parts\nand on the way that they are\nsyntactically combined.\nGottlob Frege\nThis image is in the public domain.\nSource: Wikimedia Commons.\n\nDefinition: Compositional semantics\nThe principle of compositionality:\nThe meaning of a sentence depends\nonly on the meanings of its parts\nand on the way that they are\nsyntactically combined.\n\nThe task of the semantics of a language is to provide\nthe truth-conditions of all the well-formed sentences in\nthat language, and to do so in a compositional way\nThis image is in the public domain.\nSource: Wikimedia Commons.\n\nBasic modeling\nMitzi is gray\nMitzi is a cat\nMitzi purred\n\nWe can define adjectives, nouns and intransitive verbs\nas mathematical sets of individuals.\nIP\nNP\n\nI'\npurred\nis gray\nis a cat\n\nBasic modeling\nMitzi is gray\nMitzi is a cat\nMitzi purred\n\nA set is a collection of objects.\n\nGray is the collection of all gray individuals.\nCat is the collection of all individuals who are cats.\nPurred is the collection of all individuals who purred.\n\nIP\nNP\n\nI'\npurred\nis gray\nis a cat\n\nBasic modeling\nMitzi is gray\nMitzi is a cat\nMitzi purred\n\nMitzi is a member of the\nset of individuals that are gray.\nMitzi Gray\nIP\nNP\n\nI'\npurred\nis gray\nis a cat\n\nBasic modeling\nMitzi is gray\nMitzi is a cat\nMitzi purred\n\nMitzi is a member of the\nset of individuals that are cats.\nMitzi Cat\nIP\nNP\n\nI'\npurred\nis gray\nis a cat\n\nBasic modeling\nMitzi is gray\nMitzi is a cat\nMitzi purred\n\nMitzi is a member of the\nset of individuals that purred.\nMitzi Purred\nIP\nNP\n\nI'\npurred\nis gray\nis a cat\n\nModification\nMitzi [I' is a gray cat ]\n\nMitzi is a member of the set of individuals who are gray\nAND a member of the set of individuals who are cats.\n\nMitzi Gray AND Mitzi Cat\n\nModification\nMitzi [I' is a gray cat ]\n\nSet intersection: The set that results from combining\ntwo other sets\n\nMitzi Gray Cat\n\nCat Gray\n\nModification\nSet intersection can describe other adjectives too:\n\nMitzi is a gray cat\nGianni is an Italian waiter\nT-Rex is a carnivorous dinosaur\nThis is a round ball\n\nThese are called intersective adjectives.\n\nModification\nIntersective adjectives conform to an entailment\npattern.\n\nMitzi is a gray cat\nMitzi is a cat\nMitzi is gray\n\nModification\nIntersective adjectives conform to an entailment\npattern.\n\nMitzi is a gray cat\nMitzi is a cat\nMitzi is gray\n\nA entails B iff whenever A is true, B is true.\n\nModification\nThere are also non-intersective adjectives:\n\nGeorge is a former president\nThis is a fake diamond\n\nModification\nThere are also non-intersective adjectives:\n\nGeorge is a former president\nThis is a fake diamond\n\nThe entailment pattern doesn't hold:\n\nGeorge is a former president\nGeorge is a president [not valid]\n??George is former [not valid]\n\nModification\nThere are also non-intersective adjectives:\n\nGeorge is a former president\nThis is a fake diamond\n\nIn fact:\n\nGeorge is a former president\nGeorge is not a president\nGeorge was a president in the past\n\nConnectives\nMitzi [I' is gray and furry ]\n\nConnectives can be described in set terms.\n\nAND denotes set intersection\nGray Furry\n\nGrey Furry\n\nConnectives\nMitzi [I' is gray or black ]\n\nConnectives can be described in set terms.\n\nOR denotes set union\nGray Black\n\nGray Black\n\nInterim summary\nNouns, intransitive verbs, and adjectives can be\ndescribed using set intersection.\n\nis a cat Cat\nMitzi is gray = Gray\npurred Purred\n\nInterim summary\nAND can also be described using set intersection.\n\nMitzi is gray AND furry = Gray Furry\n\nOR can also be described using set union.\n\nMitzi is gray OR black = Gray Black\n\nMore modeling\nProper names pick out individuals in the world.\nJohn danced\n\nMore modeling\nProper names pick out individuals in the world.\nJohn danced\n\nWhat does some boy refer to?\nSome boy danced\n\nMore modeling\nProper names pick out individuals in the world.\nJohn danced\n\nWhat does some boy refer to?\nSome boy danced\n\nWhat about no boy?\nNo boy danced\n\nDeterminers\nEnglish has several additional determiners:\n\nSome boy danced\nNo boy danced\nThree boys danced\nMore than half of the boys danced\nEvery boy danced\n\nDeterminers\nHow do we model determiners?\n\nSome boy danced\nNo boy danced\nThree boys danced\nMore than half of the boys danced\nEvery boy danced\n\nDeterminers\nHow do we model determiners?\n\nSome boy danced\nNo boy danced\nThree boys danced\nMore than half of the boys danced\nEvery boy danced\n\nNPs with determiners don't refer to individuals.\nRather, determiners denote set relations.\n\nDeterminers\nSome boy danced\n\nThe intersection of the set of boys and the set of\ndancers is not empty\n\nBoy Danced\n\nBoy\nDanced\n\nDeterminers\nSome boy danced\n\nCan there be boys who are not dancers?\nCan there be dancers who are not boys?\n\nBoy\nDanced\n\nDeterminers\nSome boy danced\n\nCan there be boys who are not dancers? Yes.\nCan there be dancers who are not boys? Yes.\n\nBoy\nDanced\n\nDeterminers\nNo boy danced\n\nThe intersection of the set of boys and the set of\ndancers is empty\n\nBoy Danced =\n\nBoy\nDanced\n\nDeterminers\nNo boy danced\n\nCan there be boys who are not dancers?\nCan there be dancers who are not boys?\n\nBoy\nDanced\n\nDeterminers\nNo boy danced\n\nCan there be boys who are not dancers? Yes.\nCan there be dancers who are not boys? Yes.\n\nBoy\nDanced\n\nDeterminers\nThree boys danced\n\nThe intersection of the set of boys and the set of\ndancers contains three elements.\n\n| Boy Danced | = 3\n\nBoy\nDanced\n\nDeterminers\nThree boys danced\n\nCan there be boys who are not dancers?\nCan there be dancers who are not boys?\n\nBoy\nDanced\n\nDeterminers\nThree boys danced\n\nCan there be boys who are not dancers? Yes.\nCan there be dancers who are not boys? Yes.\n\nBoy\nDanced\n\nDeterminers\nMore than half of the boys danced\n\nThe intersection of the set of boys and the set of\ndancers contains more than half of all the boys.\n\n| Boy Danced | > 1⁄2 | Boy |\n\nBoy\nDanced\n\nDeterminers\nMore than half of the boys danced\n\nCan there be boys who are not dancers?\nCan there be dancers who are not boys?\n\nBoy\nDanced\n\nDeterminers\nMore than half of the boys danced\n\nCan there be boys who are not dancers? Yes (but...)\nCan there be dancers who are not boys? Yes.\n\nBoy\nDanced\n\nDeterminers\nEvery boy danced\n\nThe set of boys is a subset of the set of dancers.\n\nBoy Danced\n\nBoy\nDanced\n\nDeterminers\nEvery boy danced\n\nCan there be boys who are not dancers?\nCan there be dancers who are not boys?\n\nBoy\nDanced\n\nDeterminers\nEvery boy danced\n\nCan there be boys who are not dancers? No.\nCan there be dancers who are not boys? Yes.\n\nBoy\nDanced\n\nDeterminers summary\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nSome(Boy)(Danced)\n\nThree(Boy)(Danced)\n\nMore than half(Boy)(Danced)\nNo(Boy)(Danced)\nEvery(Boy)(Danced)\n\nDeterminers summary\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nSome(Boy)(Danced)\nBoy Danced\nThree(Boy)(Danced)\n\nMore than half(Boy)(Danced)\nNo(Boy)(Danced)\nEvery(Boy)(Danced)\n\nDeterminers summary\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nSome(Boy)(Danced)\nBoy Danced\nThree(Boy)(Danced)\n| Boy Danced | = 3\nMore than half(Boy)(Danced)\nNo(Boy)(Danced)\nEvery(Boy)(Danced)\n\nDeterminers summary\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nSome(Boy)(Danced)\nBoy Danced\nThree(Boy)(Danced)\n| Boy Danced | = 3\nMore than half(Boy)(Danced) | Boy Danced | > 1⁄2 | Boy |\nNo(Boy)(Danced)\nEvery(Boy)(Danced)\n\nDeterminers summary\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nSome(Boy)(Danced)\nBoy Danced\nThree(Boy)(Danced)\n| Boy Danced | = 3\nMore than half(Boy)(Danced) | Boy Danced | > 1⁄2 | Boy |\nNo(Boy)(Danced)\nBoy Danced =\nEvery(Boy)(Danced)\n\nDeterminers summary\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nSome(Boy)(Danced)\nBoy Danced\nThree(Boy)(Danced)\n| Boy Danced | = 3\nMore than half(Boy)(Danced) | Boy Danced | > 1⁄2 | Boy |\nNo(Boy)(Danced)\nBoy Danced =\nEvery(Boy)(Danced)\nBoy Danced\n\nProperties of determiners\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nAll the determiners we have seen so far put restrictions\non members of set A, but not on members of set B.\nA\nB\nAB\nnot: AB\n\nProperties of determiners\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nAre there determiners that put restrictions on set B?\nA\nB\nAB\nnot: AB\n\nProperties of determiners\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nFor example, every-non(A)(B)\n\nblarg boy danced\n= every non-boy danced\n\nThat is: A- B\n\nProperties of determiners\nAll the sentences we have seen have the structure:\n\nDet(A)(B)\n\nFor example, Reverse-mth(A)(B)\n\nblick boys danced\n= more than half of the dancers are boys\n\nThat is: | A B | > 1⁄2 | B |\n\nConservativity\nNatural language determiners only \"care\" about\nelements that satisfy their first argument.\n\nDet is conservative if Det(A)(B) Det(A)(AB):\n\nevery(boy)(danced)\n\nconservative\n= every boy danced\n\n= every boy is a boy that danced\n\nevery-non(boy)(danced)\n\nnon-conservative\n= every non-boy danced\n\n= every non-boy is a boy that danced [*]\n\nConservativity\nNatural language determiners only \"care\" about\nelements that satisfy their first argument.\n\nDet is conservative if Det(A)(B) Det(A)(AB):\n\nmore than half(boy)(danced)\nconservative\n= more than half of the boys danced\n= more than half of the boys are boys who danced\n\nReverse-mth(boy)(danced)\n\nnon-conservative\n= more than half of the dancers are boys\n= more than half of the boys who danced are boys [*]\n\nConservativity\nUniversal: All natural language determiners are\nconservative.\n\nTherefore: no language has a simple determiner that means\nevery-non or Reverse-mth\n\nblarg boys danced\n\nDoes not exit!\n= every non-boy danced\n\nblick boys danced\n\nDoes not exit!\n= more than half of the dancers are boys\n\nAn application: Explaining entailment patterns\nJohn sings and John dances\n.⇒ John sings and dances\n\nSome boy sings and some boy dances\n.⇒ Some boy sings and dances\n\nAn application: Explaining entailment patterns\nJohn sings and John dances\n.⇒ John sings and dances\n\nJohn\nS\nD\n\nAn application: Explaining entailment patterns\nSome boy sings and some boy dances\n.⇒ Some boy sings and dances\n\nAn application: Explaining entailment patterns\nSome boy sings and some boy dances\n.⇒ Some boy sings and dances\n\nS\nD\nB\n\nAn application: Explaining entailment patterns\nSome boy sings and some boy dances\n\nS\nD\nB\n\nAn application: Explaining entailment patterns\nSome boy sings and some boy dances\n\nS\nD\nB\n\nAn application: Explaining entailment patterns\nSome boy sings and some boy dances\n\nS\nD\nB\n\nAn application: Explaining entailment patterns\nSome boy sings and dances\n\nS\nD\nB\n\nAn application: Explaining entailment patterns\nSome boy sings and dances\n\nS\nD\nB\n\nAn application: Explaining entailment patterns\nSome boy sings and some boy dances\n.⇒ Some boy sings and dances\n\nA entails B iff whenever A is true, B is true.\n\nWe can find a situation where A is true but B is false.\nHence, A does not entail B\n\nThe definite article\nWhat is the meaning of the definite article?\n\nSome cat purred\nEvery cat purred\nThe cats purred\n\nThe definite article\nWhat is the meaning of the definite article?\n\nSome cat purred\n\nCat Purred =\nEvery cat purred\n\nThe cats purred\n\nThe definite article\nWhat is the meaning of the definite article?\n\nSome cat purred\n\nCat Purred =\nEvery cat purred\n\nCat Purred\nThe cats purred\n\nThe definite article\nWhat is the meaning of the definite article?\n\nSome cat purred\n\nCat Purred =\nEvery cat purred\n\nCat Purred\nThe cats purred\n\n?\n\nThe definite article\nWhat is the meaning of the definite article?\n\nSome cat purred\n\nCat Purred =\nEvery cat purred\n\nCat Purred\nThe cats purred\n\n?\n\nAt first glance, the has a meaning similar to every\n\nThe definite article\nWe might define the as:\n\nThe cats purred\n\nCat Purred\n\nThe definite article\nWe might define the as:\n\nThe cats purred\n\nCat Purred\n\nDoes this work in this context?\n\nThe definite article\nWe might define the as:\n\nThe cats purred\n\nCat Purred\n\nDoes this work in this context?\n\nContext: There are three cats.\n\nEvery cat purred\nThe cats purred\n#The cat purred\n\nThe definite article\nThe cat purred\n\nThe expression the cat presupposes:\n- Existence: there exists a cat\n- Uniqueness: there is exactly one (relevant) cat\n\nThe definite article\nThe cat purred\n\nThe expression the cat presupposes:\n- Existence: there exists a cat\n- Uniqueness: there is exactly one (relevant) cat\n\nWhen there is exactly one relevant individual in NP,\nthe returns that individual.\n\nthe cat defined iff there is one cCat. Returns c.\n\nPresuppositions of the\nThe presuppositions of the definite often spring into\nexistence, even if they weren't known beforehand.\n\nI forgot to feed the cat this morning\n\nPresuppositions of the\nThe presuppositions of the definite often spring into\nexistence, even if they weren't known beforehand.\n\nI forgot to feed the cat this morning\n\nYou will accommodate the fact that I have a cat.\n\nPresuppositions of the\nThe presuppositions of the definite often spring into\nexistence, even if they weren't known beforehand.\n\nI forgot to feed the cat this morning\n\nYou will accommodate the fact that I have a cat.\n\nIf no one objects to what I said, the assumption that I\nhave a cat will be added to the common ground of\nour conversation.\n\nAccommodation\nHow easy it is to accommodate depends on the\nplausibility of what I said.\n\nAccommodation\nHow easy it is to accommodate depends on the\nplausibility of what I said.\n\nContext: We are at my house and you hear some\nscratching noises outside.\n\n(1) The cat is at the door.\n(2) The giraffe is at the door.\n(3) I keep a giraffe here. The giraffe is at the door.\n\nAccommodation\nNormally, we assume that speakers intend to say things\nthat are grammatical, relevant, and - often - true.\n\nIn the closet, you will find the blue coat\n\nAccommodation\nNormally, we assume that speakers intend to say things\nthat are grammatical, relevant, and - often - true.\n\nIn the closet, you will find the blue coat\n\nSuppose that after I said this sentence, you open the\ncloset and find only a black coat.\n\nAccommodation\nNormally, we assume that speakers intend to say things\nthat are grammatical, relevant, and - often - true.\n\nIn the closet, you will find the blue coat\n\nSuppose that after I said this sentence, you open the\ncloset and find only a black coat.\n\nYou may assume I just got the color confused.\n\nAccommodation\nNormally, we assume that speakers intend to say things\nthat are grammatical, relevant, and - often - true.\n\nIn the closet, you will find the blue coat\n\nSuppose that after I said this sentence, you open the\ncloset and find only a black coat.\n\nOr you might assume you got the color confused and\nit's really a dark blue coat.\n\nAccommodation\nWe use a similar process to choose the meaning of\nambiguous sentences.\n\nAccommodation\nWe use a similar process to choose the meaning of\nambiguous sentences.\n\nSuccessful lawyers and linguists are always rich\n\nAccommodation\nWe use a similar process to choose the meaning of\nambiguous sentences.\n\nSuccessful lawyers and linguists are always rich\na. [Successful lawyers] and linguists are always rich\nb. Successful [lawyers and linguists] are always rich\n\nAccommodation\nWe use a similar process to choose the meaning of\nambiguous sentences.\n\nSuccessful lawyers and linguists are always rich\na. [Successful lawyers] and linguists are always rich\nb. Successful [lawyers and linguists] are always rich\n\nSince (a) is obviously false, you'll normally conclude\nthat I meant (b).\n\nAccommodation\nWe use this process to assign implicit parameters in a\nway that would make sentences true.\n\nEverybody in the room is taller than me\n\nAccommodation\nWe use this process to assign implicit parameters in a\nway that would make sentences true.\n\nEverybody in the room is taller than me\n\nContext: There are four people in the room; you, me,\nand two other people who I don't know.\na. You: We are brothers.\nb. You: We are four, so we can play bridge.\n\nAccommodation\nSometimes we can't accommodate a presupposition.\n\nI forgot to feed the cat this morning!\nI forgot to feed the giraffe this morning!\n\nAccommodation\nSometimes we can't accommodate a presupposition.\n\nI forgot to feed the cat this morning!\nI forgot to feed the giraffe this morning!\n\nThe TA is sitting in the front row\nUniqueness is violated!\n\nThe king of France is bald\nExistence is violated!\n\nConclusion\nThe king of France is bald\n\nModeling using sets: We defined intransitive verbs,\nnouns and adjectives as sets of individuals.\n\nIP\nNP\nI'\nis bald\n\nConclusion\nThe king of France is bald\n\nModeling using sets: We defined connectives (and, or)\nand determiners (some, every, no, three, more than half)\nas relations between two sets.\n\nConclusion\nCompositionality: We calculated the meaning of\nsentences from the meaning of their parts and the\nsyntactic structure they were in.\n\nConclusion\nCompositionality: We calculated the meaning of\nsentences from the meaning of their parts and the\nsyntactic structure they were in.\n\nThe meanings we calculated derived the truth\nconditions of the sentences.\n\nConclusion\nCompositionality: We calculated the meaning of\nsentences from the meaning of their parts and the\nsyntactic structure they were in.\n\nThe meanings we calculated derived the truth\nconditions of the sentences.\n\nWhen combined with a context, we yield a truth value\n\nConclusion\nFinally, we discussed the definite article and its\npresuppositions.\n\nThe king of France is bald\nExistence\nUniqueness\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "24.900 Intro to Linguistics Lecture Slides: Writing Systems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/f526196bf53072b093651556de1fd93e_MIT24_900F12_Writing_Sys.pdf",
      "content": "Writing Systems\n\nCREDIT:\nSource for many of the following writing system slides:\na now-gone class website by Prof. Richard Sproat\n(University of Illinois/Champaign-Urbana)\n\n(Possibly) Independent Inventions of Writing\n\nSumerian:\nca. 3,200 BC\n\nEgypt:\n\nca. 3,200 BC\n\nIndus Valley:\nca. 2,500 BC\n\nChina:\n\nca. 1,500 BC\n\nCentral America: ca. 250 BC\n\n(Olmecs, Mayans, Zapotecs)\n\nPICTOGRAMS\nImage removed due to copyright restrictions.\n\nTo view an example of a pictogram from Mesopotamia, circa 3000 BC,\ngo to: http://www.mesopotamia.co.uk/writing/home_set.html.\n\nNon-alphabetic cuneiform:\nAkkadian (S. Mesopotamia) writing system\n1.phonogram: representing a\nconsonant-vowel combination\nlike ka, ak, kak\n2.logogram: representing an\nentire word or concept.\n3.phonetic complement:\nnarrows down logogram\npronunciation, indicate\ngrammatical form.\n4.determinative: indicates that\nan adjacent word is the name\nof a deity, a man, a city, etc.\nNot pronounced.\nThis image is in the public domain. Source: Wikimedia Commons.\n\nALPHABETS\nA sample of Linear B script, 1450 BC\n\nImage courtesy of Sharon Mollerus on Flickr.\nDeciphered by Michael Ventris (1922-1956), an architect and\namateur linguist (assisted by John Chadwick, a classicist), who\ndiscovered that the Linear A texts are ...\n\nALPHABETS\n... Greek! --\n\nwritten in a\n(somewhat imperfect) syllabary.\n\nALPHABETS\n\nALPHABETS\nJAPANESE SYLLABARIES\nHiragana\n\nALPHABETS\nKatakana\n\nALPHABETS\nCherokee syllabary,\ninvented by Sequoyah (1770-1843)\na silversmith\n\nALPHABETS\nThis image is in the public domain. Source: Wikimedia Commons.\n\nALPHABETS\nPhoenician (from ca. 1100 BCE)\n\nhttp://www.ancientscripts.com\n\nALPHABETS\nUgaritic cuneiform alphabet\n(W. Syria, ca.1300-1200 BCE)\n\nALPHABETS\nIn the 9th century AD, two Byzantine missionaries, the brothers\nCyril (827-869) & Methodius (826-885), designed an alphabetic\nwriting system for the Moravian Slavic dialect.\nThis image is in the public domain. Source: Wikimedia Commons.\n\nALPHABETS\n\nAfter Cyril's death, Methodius continued his work.\nThe alphabet that Cyril and Methodius created is to this day\ncalled...\n\nALPHABETS\n... the GLAGOLITIC ALPHABET\n\nALPHABETS\nGlagolitic Greek Cyrillic\nGlagolitic Greek\nCyrillic\n[ɑ] А\nΑ\nА\n[r]\nР\nΡ\nР\n[b] Б\nБ\n[s]\nС\nC (Σ)\nС\n[v] В\nΒ\nВ\n[t]\nТ\nΤ\nТ\n[ɡ] Г\nΓ\nГ\n[u]\nУ\nΥ\nУ\n[d] Д\nΔ\nД\n[f]\nФ\nΦ\nФ\n[e]\nΕ\nЕ\n[x]\nХ\nΧ\nХ\n[ʒ] Ж\nЖ\n[ts]\nЦ\nЦ\n[z] З\nΖ\nЗ\n[tʃ]\nЧ\nЧ\n[i] И\nИ (H) И\n[ʃ]\nШ\nШ\n[j] И\nИ\n[ʃtʃ]\nЩ\nЩ\n[k] К\nΚ\nК\n[ʊ]\nЪ\nЪ\n[l] Л\nΛ\nЛ\n[ɛ]\nЬ\nЬ\n[m] М\nΜ\nМ\n[e]\nЕ\nЭ\n[n] Н\nΝ\nН\n[ju]\nЮ\nЮ\n[o] О\nΟ\nО\n[ja]\nЯ\n[p] П\nΠ\nП\n\nALPHABETS\nHangul: the Korean Alphabet\n\n\"The sounds of our country's language are different from those\nof China and do not correspond to the sounds of Chinese\ncharacters.\n\nTherefore, among the stupid people, there have been many\nwho, having something to put into writing, have in the end been\nunable to express their feelings.\n\nI have been distressed by this and have designed twenty-eight\nnew letters, which I wish to have everyone practice at their ease\nand make convenient for their daily use.\"\n\nKing Sejong (1397-1450)\n\nALPHABETS\nHangul consonants\n\nNasal\nSimple\nAspirated Doubled\n\nᄌ\nᄎ\nᄍ\n\nᄀ [k]\nᄏ[kh]\nᄁ\n\nback of tongue raised to\nthe velum\nᄂ [n]\nᄃ [t]\nᄐ [th]\nᄄ\nᄅ[l]\ntip of the tongue\ntouching alveolar\nridge\nᄆ [m]\nᄇ [p]\nᄑ[ph]\nᄈ\n\ntwo lips\nᄉ [s]\nᄌ [ʨ]\nᄎ [ʨh]\nᄊ\n\nside view of\n\nthe\nteeth\nᄋ [ŋ]\nᅙ [ʔ] (obsolete)\nᄒ h [h]\n\nᅳ [ɯ]\n\"back\"\nᅵ [i]\n\"front\"\nᅮ [u]\nᅥ [ʌ]\nᅦ[e] (ʌ + i)\nᅩ [o]\nᅡ [a]\nᅬ [ø] (o + i)\nALPHABETS\n\nALPHABETS\n\nALPHABETS\nHangul: the Korean Alphabet\n\nThe letters are arranged in blocks that mostly correspond to\nsyllables:\n기 /gi/\n김 /gim/\n\n미 /mi/\n민 /min/\n-- giving the (false) impression that Hangul is a syllabary.\n\nPhonemic vs. phonetic\nThe rule of akan'je in Russian\n\n- In the syllable before the stress, or word-initial in an unstressed\nsyllable, /o/ becomes [a]:\n\n/noga/ becomes [naga]\n'foot'\n/nogi/ stays [nɔgi]\n\n'feet'\n- In other unstressed syllables, /o/ becomes [a] (Belarusian and\nsome Russian dialects) or [ə] (Standard Russian).\n/goroda/ becomes [g ɔrəәdəә] 'of the city' (Standard Russian)\n/goroda/ becomes [g əәrəәda] 'cities'\n\nPhonemic vs. phonetic\n\nRussian\nBelarusian\nsg.\npl.\nsg.\npl.\n\n'foot'\nнога\nноги\nнага\nногi\n'city'\nгород\nгорода\nгорaд\nгарады\n'table'\nстол\nстолы\nстол\nсталы\n'windows' окно\nокна\nакно\nвокны\n\nPhonemic vs. phonetic\nFinal devoicing in Russian\n\nzero form -a form\n\n1. grɔp\ngrɔba\n'coffin'\n6. rɔk\nrɔɡa\n'horn'\n2. lip\nlipa\n'linden tree' 7. rɔk\nrɔka\n'fate'\n3. ʃɔpəәt\nʃɔpəәta\n'whisper'\n8. kəәrəәndaʃ kəәrəәndaʃa 'pencil'\n4. gɔrəәt\ngɔrəәda 'city'\n9. ekipaʃ\nekipaʒa\n'crew'\n5. ruk\nruka\n'hand'\n10. ras\nrasa\n'race'\n11. ras\nraza\n'time'\n\nPhonemic vs. phonetic\nFinal devoicing in Russian spelling\n\nzero form -a form\n\n1. grɔp\ngrɔba\n6. rɔk\nrɔɡa\nГРОБ\nГРОБА\nРОГ\nРОГА\n2. lip\nlipa\n7. rɔk\nrɔka\nЛИП\nЛИПА\nРОК\nРОКА\n3. ʃɔpəәt\nʃɔpəәta\n8. kəәrəәnda\nkəәrəәndaʃa\nШЕПОТ ШЕПОТА\nКАРАНДАШ КАРАНДАША\n4. gɔrəәt\ngɔrəәda\n9. ekipaʃ\nekipaʒa\nГОРОД\nГОРОДА\nЭКИПАЖ\nЭКИПАЖА\n5. ruk\nruka\n10. ras\nrasa\nРУК\nРУКА\nРАС\nРАСА\n11. ras\nraza\nРАБ\nРАЗА\n\n1. 'rope'\n[ip]\n[ipi]\n2. 'louse'\n[bit]\n[biti]\n3. 'reason' [sebep] [sebebi]\n4. 'bunch' [demet] [demeti]\n5. 'Ahmed' [ahmet] [ahmedi]\n6. 'color'\n[renk]\n[rengi]\n7. ʼhonorʼ [ʃeref] [ʃerefi]\n8. 'pilot'\n[pilot]\n[pilotu]\n9. 'wolf'\n[kurt]\n[kurdu]\nPhonemic vs. phonetic\nFinal devoicing in Turkish\n\nPhonemic vs. phonetic\nFinal devoicing in Turkish spelling\n\n1. 'rope'\n[ip] ip\n[ipi] ipi\n2. 'louse'\n[bit] bit\n[biti] biti\n3. 'reason' [sebep] sebep [sebebi] sebebi\n4. 'bunch' [demet] demet [demeti] demeti\n5. 'Ahmed' [ahmet] ahmet [ahmedi] ahmedi\n6. 'color'\n[renk] renk\n[rengi] rengi\n7. ʼhonorʼ [ʃeref] seref\n[ʃerefi] serefi\n8. 'pilot'\n[pilot] pilot\n[pilotu] pilotu\n9. 'wolf'\n[kurt] kurt\n[kurdu] kurdu\n\nPhonemic vs. phonetic\nEnglish trisyllabic laxing\ninsane\nɪnsejn\ninsanity\nɪnsænəәɾij\ngrave\nɡɹejv\ngravity\nɡɹævəәɾij\nserene\nsəәɹijn\nserenity\nsəәɹɛnəәɾij\ndivine\ndəәvajn\ndivinity\ndəәvɪnəәɾij\nfacile\nfæsajl\nfacility\nfæsɪləәɾij\n(fæsəәl)\nvirtuoso\nvɹ tʃuowsow virtuosity\nvɹ tʃuɑsəәɾij\nnot just about -ity:\ncontrite ~ contrition\nmendacious ~ mendacity\nDearest creature in creation,\n\nPhonemic vs. phonetic\nStudy English pronunciation.\nI will teach you in my verse\nSounds like corpse, corps, horse, and worse.\nI will keep you, Suzy, busy,\nMake your head with heat grow dizzy.\nTear in eye, your dress will tear.\nSo shall I! Oh hear my prayer.\n\nPhonemic vs. phonetic\nJust compare heart, beard, and heard,\nDies and diet, lord and word,\nSword and sward, retain and Britain.\n(Mind the latter, how it's written.)\nNow I surely will not plague you\nWith such words as plaque and ague.\nBut be careful how you speak:\nSay break and steak, but bleak and streak;\nCloven, oven, how and low,\nScript, receipt, show, poem, and toe.\n\nPhonemic vs. phonetic\n...blah, blah, blah for umpteen more verses...\n...we get the point! ...\nFinally, which rhymes with enough-\nThough, through, plough, or dough, or cough?\nHiccough has the sound of cup.\nMy advice is to give it up!!!\n--Gerald Nolst Trenite (1870-1946)\n\nPhonemic vs. phonetic\nCan you pronounce these words?\nThe balistanicacious pressure device\nIt was s imply clantific, as she liked to say.\nDr. Harriglon will see you to your room.\nWould you some more gartiletti! I made t hem myself from free-range\nWookies.\n\"And n ow, the tranya.\"\n\n- from the (original series) Star Trek episode\nThe Corbomite Maneuver\n\nPhonemic vs. phonetic\n\nHI, MY NAME IS\nTONY\nHI, MY NAME IS\nTONI\n\nPhonemic vs. phonetic\nHI, MY NAME IS\nANDY\nHI, MY NAME IS\nANDI\n\nPhonemic vs. phonetic\nHI, MY NAME IS\nBOBBY\nFISHER\nHI, MY NAME IS\nBOBBI\nFISHER\n\nReading\nHow fluent reading works.\n\nEyes fixate briefly on each word or pair of adjacent words\n(fixations are called saccades).\n\nReading is routed through phonology: a \"voice in the head\".\nSome evidence:\n- Tongue twisters take longer to read than non-tongue\ntwisters... even in Chinese!\n\n- The ability of deaf speakers to read oral languages such as\nEnglish correlates with their degree of phonological\nknowledge.\n\n- In normal reading in an alphabetic system, every letter is\nscanned and processed, though we do \"error correct\"...\n\nReading\nHow fluent reading works.\nExceptions are flagged and processed in a special way. Some\nconsequences:\n- \"Acquired dyslexia\" after brain damage may impair\n\"decoding\" (reading of regular spellings) but spare exceptions\n-- or vice versa.\nhave vs. cave\n→ deep dyslexia\n/hæv/ vs. \"I don't know\" or guessing\n(also: can't read non-words: stumped by bave)\n→ surface dyslexia\n/hejv/, /kejv/\n(can read non-words, but reads irregulars phonetically)\n\nReading\nHow should we teach children (or adults) to read?\n\nThe \"Whole Language\" movement of the 1990s:\n\n\"English spelling is so full of irregularities, it is very hard to\nteach, especially to young children.\n\n\"Fortunately... we don't have to teach it explicitly!\"\n\nReading\n\"We now know that learning to read and learning to write are a lot like\nlearning to talk. We would think it funny if parents hovered over their\nnewborn's crib, chanting the sounds of language one at a time. Parents\nare not trying t o t each l anguage, but rather trying t o co\n\nmmunicate with\ntheir child. They do not teach children individual sounds, but instead, use\nand sh\n\nare language naturally as\n\na part of everyday ex\n\nperiences. They\nrespect and a ccept their baby's b abblings a s t alk. Although d ifferent from\nthat of grown-ups, the child's language is celebrated and accepted\nwithout criticism. It is through constant interaction with family and\nfriends--through using language and hearing others use it in everyday\nsituations--that children learn to talk. Our research has indicated that the\nsame is true of learning t o r ead an\n\nd w\nrite. It is through co\n\nnstant\ninteraction with family and friends. teachers and classmates-- through\nusing reading and writing and observing others reading and writing in\neveryday si\ntuations--that children can learn to read and write.\"\n(National Council of Teachers o f English, Elementary School\nPractices. 1994 brochure)\n\nReading\nThe \"Whole Language\" movement - part 2:\n\n- English spelling is so full of irregularities, people couldn't\npossibly be attending to all the letters.\n\n- Reading is a \"psycho-linguistic guessing game\".\n\n- So teaching symbol-sound correspondences (in English at\nleast) is a waste of time.\n\nReading\nSuccess of \"Whole Language\" in the 1980s\n\n\"We've begun seriously to affect legislative policy in states like\nMichigan and Kentucky as well as all of the provinces of Canada.\"\n[From a list of achievements of the Whole Language Movement:\nJerome Harste (1993) \"New Questions, Different Inquiries\", in Carl\nB. Smith, ed., Whole Language: The Debate\", Edinfo Press, p. 147]\n\nReading\n\n\"As the information in this table reveals, in seven provinces (British\nColumbia, Manitoba, New Brunswick, Newfoundland/Labrador,\nOntario, Prince Edward Island, Quebec) the only textbooks on the\napproved lists are those that subscribe to a whole-language\nphilosophy... Unfortunately, in many provinces unless special\npermission is granted to do otherwise, schools are only permitted to\npurchase in quantity for classroom use textbooks that appear on the\napproved lists.\"\n\n[Marvin L. Simner, \"Beginning Reading Instruction: A Position Paper on Beginning Reading\nInstruction in Canadian Schools\", Canadian Psychological Association 1993]\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\n\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.900 Intro to Linguistics: Acoustic Phonetics (Speech Perception) Summary",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-900-introduction-to-linguistics-fall-2012/32672c0c9668c2aded8defe2bf1a373a_MIT24_900F12_Acostc_sumary.pdf",
      "content": "24.900 2012\nAcoustic phonetics (speech perception) summary\n(2)\nSpectrograms (x=time y = frequency) of ba - da - ga (spoken by me!)\nNote the rise (not that clear) for b, the shallow fall for d and the sharp fall for g.\n1. Speech Perception\n- We hear speech sounds in such a way that we can generally tell how they were\npronounced. That is what the \"b-ness\" of \"b\" consists in, and the \"g-ness\" of \"g\".\n- What we pay attention to are the frequency bands that are reinforced, not suppressed,\nby the resonating chambers of the vocal tract. These are called formants.\n- Vowel formants (except for diphthongs) are steady-state formants.\nThe higher the vowel, the lower the first formant.\nThe fronter the vowel, the higher the second formant.\n(1)\n- Fact: If a signal sounds like a set of formants that could be created by human speech,\nyour mind perceives the signal as speech, even if other properties of the signal are odd.\nThe duck call web site shows this for vowels. Go to\nhttp://www.exploratorium.edu/exhibits/vocal_vowels/vocal_vowels.html\n- In fact, an extremely reduced formant structure can still be perceived as speech. That\nwas the point of the presentation of sinewave speech. Go to\nhttp://www.haskins.yale.edu/research/sws.html for more.\nA relevant slogan: Speech perception is in your mind, not in your ears.\n2. Categorical perception\n- Many phonetically important distinctions lie along a continuum of acoustic\npossibilities.\nFor example, one can artifically produce (say, using computer software) the\nappropriate formant stucture for the syllable ba, then gradually change the initial\ntransition through da to ga. In principle, one might expect to be able to produce a\nseries of signals that gradually morphs from ba to da then ga,\n- That is not what we perceive, though. Instead of a gradual shift from ba to da, and\nfrom da to ga, we hear a bunch of bas, then a bunch of das, then a bunch of gas. That\nis, each stimulus is assigned to one of the three categories, and we hear nothing as in\nbetween two categories. This phenomenon is called categorical perception.\nIn class, we saw this by looking at and playing the stimuli at\n- Consonant sounds, especially stops, involve rapid changes in formant pitch called\ntransitions -- as you expect given how the vocal tract produces a consonant. The\ntransition is visible in F2 & F3.\n\nhttp://www.haskins.yale.edu/featured/bdg.php?audio=AIFF#\n- To refresh your memory, and because it is very neat -- and because you should\nlearn this! (hint) -- I recommend you go there too. Clicking on each stimulus will\nplay it, and there is also a link to hear the entire series.\nOther phonetic distinctions that show categorical perception include: voicing distinctions\ndue to changes in Voice Onset Time (VOT).\n(3)\n- Innateness: The phenomenon of categorical perception for speech sounds appears to\nbe innate in humans. (I'm not sure I remembered to tell you about this, but it will\ncome up when we discuss the phoneme, and also when we discuss language\nacquisition later in the semester.) In a famous experiment, Eimas et al. (1971) showed\nthat infants 1 month old have categorical perception for VOT\n[http://www.sciencemag.org/cgi/content/abstract/171/3968/303?ck=nck].\nMethod: Infant's sucking on a nipple increases in amplitude and frequency in response\nto novel stimuli, then tapers off as the stimulus becomes \"old\". This allows one to see\nwhat sorts of distinctions are perceived as new and which are not, e.g. when varying\nVOT in an otherwise constant phonetic stimulus.\n- Language acquisition as unlearning: Other work has shown similar categorical\neffect in infants for the l/r distinction. Strikingly, all infants appear to have\ncategorical perception of this distinction, but adult speakers of languages in which l vs.\nr is not phonemic have lost categoricity! In this respect, language acquisition looks\nmore like unlearning than like learning.\n- Unique to humans? Kuhl and Miller (1975): Chinchillas trained to respond to a\nphonetic stimulus spontaneously exhibit a categorical pa/ba distinction.\nMethod: Choose sounds that are equidistant from each other in VOT, e,g. at 15 ms, 45\nms, and 75 ms VOT. Pick two sounds in the pa category and one in the ba category.\nTrain a chinchilla to run to the other side of the cage when it hears the central sound\n(45 ms), heard as /pa/ by English speaking humans. After training, researchers played\nthe two sounds at the extreme ends (15 and 75 ms), which humans hear one sound as\n-2\nba and pa, respectively.\nOutcome: Chinchilla ran when they heard the other English pa, but not when they\nheard English ba. Apparently chinchillas (who know no English) categorize these\nhuman speech sounds in a manner suggestive of human abilities.\n- Possible conclusion: Categorical perception for speech sounds relies on innate\nproperties of the mammalian auditory system not unique to humans. For example,\nthere may be limits to our ability to resolve timing differences that play a role.\nLanguages can capitalize on these properties and use them to distinguish speech\nsounds\n3. McGurk effect\n- Methodology: Show a video image of a person producing ga, with a soundtrack ba --\nso the visual image and the sound contradict each other with respect to the consonant,\nbut are otherwise synchronized.\nOutcome: Most speakers will perceive an acoustic compromise between the video and\nthe audio in the form of da! (I screwed this up when I stated it in class, and was\ncorrected by Gillian.)\n- Watch it at: http://www.youtube.com/watch?v=aFPtc8BVdJk. If that link gives you\ntrouble, you can find the same movie all over the web. Google for \"McGurk effect\"\nand you will find it.\n- The effect was discovered and first presented in:\nMcGurk, Harry; and MacDonald, John (1976); \"Hearing lips and seeing voices,\"\nNature, Vol 264(5588), pp. 746-748\n-- and is most often known as the McGurk Effect.\n- Why is this interesting to us? Well, it is our third demonstration of the very same\nslogan:\nSpeech perception is in your mind, not in your ears.\n- And of course this slogan is a good characterization of almost all of language -- from\nword boundaries to syntactic structures. It is all in your head.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}