{
  "course_name": "Introduction to Environmental History",
  "course_description": "Focusing primarily on the period since 1500, explores the influence of climate, topography, plants, animals, and microorganisms on human history and the reciprocal influence of people on the environment. Topics include the European encounter with the Americas, the impact of modern technology, and the historical roots of the current environmental crisis.",
  "topics": [
    "Humanities",
    "History",
    "Modern History",
    "Science",
    "Biology",
    "Ecology",
    "Earth Science",
    "Climate Studies",
    "Environmental Science",
    "Humanities",
    "History",
    "Modern History",
    "Science",
    "Biology",
    "Ecology",
    "Earth Science",
    "Climate Studies",
    "Environmental Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nSpring 2011, Harriet Ritvo (\nPDF\n)\n\nFall 2008, Harriet Ritvo (\nPDF\n)\n\nSpring 2008, Harriet Ritvo (\nPDF\n)\n\nSpring 2006, Harriet Ritvo (\nPDF\n)\n\nSpring 2005, Harriet Ritvo (\nPDF\n)\n\nSpring 2004, Harriet Ritvo (\nPDF\n)\n\nSubject Description\n\nA historical overview of the interactions between people and their environments. Focusing primarily on the period after Columbus, the subject explores the influence of nature (climate, topography, plants, animals, and microorganisms) on human history and the reciprocal influence of people on nature. Topics include the biological consequences of the European encounter with the Americas, the environmental impact of technology, and the roots of the current environmental crisis.\n\nCI Credo\n\nCommunication intensive subjects in the humanities, arts, and social sciences should require at least 20 pages of writing divided among 3-5 assignments. Of these 3-5 assignments, at least one should be revised and resubmitted. HASS CI subjects should further offer students substantial opportunity for oral expression, through presentations, student-led discussion, or class participation.\n\nWritten Assignments\n\nThere will be three papers (paper 1, paper 2, and paper 3), of at least 5, 5, and 10 pages, respectively. A proposal for paper 3 will be due several weeks before the paper is due. Specific assignment sheets will be handed out later in the term. The last assignment will also include an oral presentation. Either assignment 1 or assignment 2 (your choice) must be revised and resubmitted for a new grade. If you like, you can revise and resubmit both assignment 1 and assignment 2. See calendar for dates.\n\nIn addition, a single page (not hand written) of informal reflections on each reading will be due in class on the day it is scheduled for discussion (normally the second class of each unit).\n\nExam\n\nWeek #9 there will be an in-class exam, on the material covered up to that date in class and in the readings.\n\nThings to Remember\n\nWritten assignments should represent original and individual work. The following link to the MIT Online Writing and Communication Center gives some suggestions about how to recognize plagiarism and how to avoid it.\n\nhttp://web.mit.edu/writing/Citation/plagiarism.html\n\nAll sources used in written assignments must be fully cited. This includes sources of information as well as direct quotations; it includes the assigned readings as well as other materials.\n\nAssignments are to be handed in on time. If an extension becomes necessary it should be requested ahead of the due date. Otherwise, lateness will be penalized.\n\nAttendance is important. Not all the material to be covered in class is included in the readings. Be sure to bring your copy of the readings to discussion classes.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nPaper 1\n\n10%\n\nPaper 2\n\n15%\n\nPaper 3 (includes final oral presentation)\n\n30%\n\nExam\n\n30%\n\nClass participation (includes response papers)\n\n15%\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nWeek 1\n\nIntroduction\n\nWeek 2\n\nThe Columbian Exchange\n\nWeek 3\n\nWilderness and Garden\n\nWeek 4\n\nThe Disease Environment\n\nSession 2: Paper 1 due\n\nWeek 5\n\nScience and Nature\n\nSession 2: Trip to\nMIT Archives\n\nWeek 6\n\nLandscape and Agriculture\n\nWeek 7\n\nIndustry and Demography\n\nSession 2: Paper 2 due\n\nWeek 8\n\nConservation and Preservation\n\nWeek 9\n\nPreparation for research paper\n\nSession 1: Paper 3 proposals due\n\nSession 2: In class exam\n\nWeek 10\n\nPoisoning and Environmentalism\n\nWeek 11\n\nCurrent Events\n\nWeek 12\n\nOral presentation of research papers\n\nSession 2: Paper 3 due, all revisions due",
  "files": [
    {
      "category": "Resource",
      "title": "MIT21H_421S11_byersquabgeo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/0c0c2ef508e5117da1772d2137f06974_MIT21H_421S11_byersquabgeo.pdf",
      "content": "Kelsey Byers\nMarch 15, 2004\n21H.421\nPaper 2\nQuabbin: Sources on a Geologic Time Frame\nOrganizationof the Sources\nThe geology of the Quabbin Reservoir and surrounds seems at first to be an obscure topic, as there appears to little of\ngeologic interest in the region. However, a more in-depth study of this topic reveals a large number of geologically significant\nfeatures, many of which serve as geologic landmarks for the area. Along with this abundance of physical geology comes a\ncorresponding amount of sources and texts dealing with the region's geology. Information covering the geology of the Quabbin\nReservoir tends to fall into three categories: general overviews, guidebooks for specific geologic study, and more specific\nmicrogeologicstudies. Useful sourcesin each category are given below.\nGeneralSourcesandOverviews\nWhen considering research on the topic of geology in the United States, a valuable first reference to turn to is the\n\"Roadside Geology\" series, published by Mountain Press Publishing Company. These books generally give a broad overview\nof the geology of a particular state, with specific road trips through regions of interest. Their main weakness is the lack of off-\nroad information, although can usually be found elsewhere. Roadside Geology of Massachusetts, by James W. Skehan, provides\nan excellent overview of the geology of Massachusetts, including sections relating to the Quabbin region in particular. In\naddition, the text, which has excellent maps and diagrams, is useful as a resource to locate specific geologic features in other\nsources. The book, due to its general nature, mostly coversmacrogeology, but has a healthy appreciation formineralogyas well.\nThe book's lack of jargon makes it accessible to the average reader, again adding to its value as a first reference for the topic.\nOnce this has been consulted for general information, sources that deal with particular regions of interest may be located easily.\nOne of the most commonly studied geologic regions around Quabbin is the Connecticut River Valley, a long, narrow\nfeature stretching the length of the Connecticut River and bisecting the state of Massachusetts. It is located approximately\nfifteen miles to the west of the reservoir. The geology changes greatly across this distance, but the amount of information on the\n\nValley is considerably larger than that on Quabbin alone. George W. Bain'sGuidebook: Geology of Northern Part -\nConnecticut Valleyserves as a general referenceand introduction to this region. This source may be difficult to find, as it was\nnever formally published, but local colleges may have a copy. Like the guidebooks listed below, this contains various field\nexcursions, but is far more general and approachable in its description of the Valley's geology and history. Line drawings and\nmaps of the region (including three-dimensional block diagrams) provide a good visual for the information presented in the text.\nTerminology is used with definitions, and efforts are made to ensure the text is reader-friendly.\nAlthough O. C. Farquhar'sConferenceon EconomicGeology in Massachusettsseems to focus solely on this topic,\nseveral papers presented at the above conference give a more general description of the region's geology. In particular, an article\ntitled \"Progress of Bedrock Geologic Mapping in West Central Massachusetts\" (pages 29-44) covers the geology of the Quabbin\nregion and its northern and southern extensions. This particular article is another source that should be consulted early, as it\nprovides background information that will ease later research. The rest of the text is less useful, although some discussion of the\ngeology of reservoirs and groundwater sources may be useful for more specific study of those topics.\nGuidebooksandExplorations\nGeologic conferences often produce guidebooks of field excursions in the immediate area of the conference, and these\ncan be useful when looking at specific geological features and local regions of interest. Raymond Joesten'sGuidebook for\nFieldtrips in Connecticut and South Central Massachusettsis one such guidebook. Although the trips are sometimes useful, they\nare often too in-depth to be useful for a general overview of the topic. In addition, the text's maps and drawings were difficult to\ninterpret and lacked any reference points to non-geological features such as bodies of water or town centers, which made\nlocating the features on other maps difficult. Most of the sources weren't very accessible to those not familiar with the field,\nalthough \"Stratigraphy and Structure of the Ware-Barre Area, Central Massachusetts\" (pages 341-373) was relatively readable\nand contained some general information that was relevant to the particular region (to the southeast of the reservoir). Other\nguidebooks are perhaps better resources to consult, although this one may be of interest to those studying the southern reaches of\n\nthis region.\nA more specific and readable guidebook, Peter Robinson and John B. Brady'sGuidebook for Field Trips in the\nConnecticut Valley Region of Massachusetts and Adjacent States, contains several useful overviews of the region's geology,\nincluding discussions of local geologic features (such as the Pelham Dome). Several of the papers in this guidebook cover the\ndirect region of interest. \"The Pelham Dome, Central Massachusetts: Stratigraphy, Geochronology, Structure, and\nMetamorphism\" (pages 132-169) covers the local geography in some depth and has very nice maps that may serve as reference\nframesfor other, less readable maps. A paper on hydrology and the geologic features of the reservoir, \"Hydrogeologyand\nWater Resources of the Connecticut Valley and Western Quabbin Reservoir Watershed\" (pages 199-215) is also a good\nresource, although perhaps more specific than might be helpful. Another good overview of the eastern regions of the reservoir\nmay be found in \"Glaciation of the Worcester Plateau, Ware-Barre Area, and Evidence for Succeeding Late Woodfordian\nPreglacial Climate\" (pages 467-487), which discusses the little-encountered topic of how glaciation affected the region's\ngeography far more recently than most other geologic changes.\nA last useful guidebook, also edited by Peter Robinson, isGuidebook for Fieldtrips in the Connecticut Valley of\nMassachusetts. Several field excursions and papers are quite valuable, including \"Gneiss Domes and Recumbent Folds of the\nOrange Area, West Central Massachusetts\" (pages 17-47), which studied the region lying directly under the reservoir and\nincluded several nice diagrams and maps that were relatively easy to follow. The descriptions of rock strata and formations in\nthe region were quite detailed without being difficult to follow. However, the most valuable paper in the text, and one that\nshould be consulted in any research on this topic, is \"Geology of the Quabbin Reservoir Area, Central Massachusetts\" (pages\n114-127). This paper covers the topic in extreme detail, although at times it seems to miss the larger picture of the geology for\nthe smaller focus of mineralogy and rock strata. In addition, those taking part in this trip were allowed to boat on the lake and\nland at points that are generally off-limits to the public, making the information in this paper far more valuable. A detailed map\nof the reservoir's strata and diagrams of specific formations are included. This guidebook is worth searching out for this paper\n\nalone.\nMicrogeology, Mineralogy, andMoreSpecializedInformation\nAs sources that relate to this topic becomemorespecific, they generally turn tomicrogeologyand mineralogy and\naway from macrogeology, which is the general topic of interest. However, these more specific sources often contain broad\nintroductions to the region of interest, which generally deal with macrogeology. Stuart R. Michener'sBedrock Geology of the\nPelham-Shutesbury Syncline, PelhamDome,West-Central Massachusettsis perhaps the most broad and macrogeology-focused\nof these sources. Although most of the text is still devoted to microgeology, a few brief sections (in particular, the\n\"Introduction,\" \"Generalized Structural History of the Pelham Dome,\" \"General Structure of the Pelham-Shutesbury Syncline,\"\nand \"Summary Geologic History of the Pelham-Shutesbury Syncline\") are macrogeology-oriented. In addition, the region of\ninterest lies directly under the western half of the reservoir, making this paper an valuable resource for this topic.\nRichard A. Jasaitis' Geology of Pre-Mesozoic Bedrock of the Amherst Area, West-Central Massachusetts, also\nprovides an in-depth study of this region, although the language is much harder to follow and the text gets quite specific at times.\nThe region covered in this source is due west of the reservoir. The most useful part of the text is the \"Geologic History of the\nAmherst Area,\" which focuses moreonmacrogeologicalaspects of the region, and discussesthe origins of the geologic features\npresent.\nAs the sources becomemorespecific and specialized, they more further into the realmof microgeologyand\nminerology. Petrography, Mineral Chemistry, and Geochemistry of the HardwickTonalite and Associated Igneous Rocks,\nCentral Massachusetts, by Charles Kenneth Shearer, deals mostly with microbiology and is more specific than the two sources\nabove, which are general overviews of more specific topics. The \"Introduction\" and \"Distribution and Correlation of the\nHardwick Pluton and Associated Igneous Rocks\" cover more macrogeological topics than the rest of the source. The source\ncontains several maps of the region with geologic strata distributions, all of which are easy to read and contain a large volume of\ninformation separate from that in the text. The region of interest lies underneath the eastern half of the reservoir, and thus the\n\nsource (like the two above) is valuable due to its location, despite its lack of general information.\nThe most specific source that still contains somemacrogeologicinformation is Margaret A. Roll'sEffects of Acadian\nKyanite-Zone Metamorphismon RelictGranulite-Facies Assemblages, Mount Mineral Formation, PelhamDome,\nMassachusetts. Like other sources, this touches on the Pelham Dome, located to the west of the reservoir and within its\nimmediate geologic area. This text's \"Introduction\" section is quite relevant to the topic, and discusses the location and\nmacrogeology of the region in some detail. However, the rest of the source is relatively useless unless microgeology or\nmineralogy are of interest, as there is no further mention of macrogeology.\nSummaryof the Sources\nMost of these texts are quite specific, and few of them deal directly with the geology of the reservoir itself. In\naddition, several lack much mention of the macrogeology of the region, instead focusing on the microgeology and mineralogy of\nthe strata present. However, we may combine these various small points of information into a well-rounded overview of the\ngeology of the Quabbin reservoir. In addition, other types of documentation (such as glaciation information, rock strata, and\nsurveying) may be added to enrich our knowledge of the topic. By pulling data and information from all of the above sources,\nwe may provide a greater understanding of the Quabbin Reservoir's geology and its geologic history.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_byrsquab_geo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/8a95caac894e87599572d35a25e48aa1_MIT21H_421S11_byrsquab_geo.pdf",
      "content": "Kelsey Byers\nMarch 13, 2004\n21H.421\nPaper 2\nAnnotated Bibliography\nAuthor: Bain, George W., ed.\nTitle: Guidebook: Geology of Northern Part - Connecticut Valley\nPublisher: No publisher.\nDate: No date.\nUseful pages: p. 2-56\nCall Number: QE 124.C4.N532\nPhysical Location: Lindgren Library, 54-200\nReference: found via shelf browsing\nNotes:\nText: Pamphlet from the 49th meeting of the New England Geological Conference. Published under the auspices of\nAmherst College, Mt. Holoyke College, Umass, and Smith College. No date or publisher information given. Gift to MIT\nLibraries in 1967.\nContents: General overview of the region's geology and field trips.\nAdditional notes: General overview is relatively broad and non-location specific. Author uses town names as opposed\nto geological features for orientation, which is helpful to those not familiar with the geology of the region. Some economic\nfeatures discussed, some nice line drawings. Field trips also detailed, with some images. Geography is of the region due west of\nthe reservoir. Provides a good, specific overview of the western geology. Should be one of the earlier books consulted.\nAuthor: Farquhar, O. C., ed.\nTitle: Conference on Economic Geology in Massachusetts\nPublisher: University of Massachusetts Graduate School?; see * at endnotes to this bibliography\nDate: 1967\nUseful Pages: p. 29-44, 295-301, 477-486, 496-497\nCall Number: QE 123.C748 1966\nPhysical Location: Lindgren Library\nReference: found via shelf browsing\nNotes:\nText: From the above-named conference ; see * at endnotes to this bibliography.\nContents: conference information, geology in Massachusetts, industrial rocks, geomechanics, mineral resources,\ngeologic aspects of construction in Massachusetts, geophysics, state geologic programsin NewYork and Massachusetts, ground\nwater and surface water in Massachusetts, the shoreline and the ocean\nAdditional Notes: With the exception of the above pages, the source is relatively useless. Above pages refer several\nconference presentations and papers. \"Progress of Bedrock Geologic Mapping in West Central Massachusetts,\" pages 29-44,\nprovides a good overview of the geology of the Quabbin region and regions immediately north and south of it. This paper\nshould be consulted early on. \"Geology of the Northfield Mountain Pumped-Storage Hydro Project.\" pages 295-301, describes\nan area to the immediate northwest of Quabbin, and is mostly of interest due to its discussion of reservoir geology. \"Ground\nWater in the Connecticut Valley of Massachusetts,\" pages 477-486, describes the geology of the watersheds directly to the west\nof Quabbin from a water-resources perspective, which may be useful. \"The Quabbin Water Supply,\" pages 496-497, gives a\nbrief description of the reservoir construction and statistics, but is otherwise useless.\n\nAuthor: Jasaitis, Richard A., Jr.\nTitle: Geology of Pre-Mesozoic Bedrock of the Amherst Area, West-Central Massachusetts\nPublisher: see * at endnotes to this bibliography\nDate: 1983\nUseful Pages: 1-98\nCall Number: QE 124.A54.J37 1983\nPhysical Location: Lindgren Library\nReference: found via shelf browsing\nNotes:\nText: see * at endnotes to this bibliography ; Master's of Science Thesis\nContents: stratigraphy, intrusive rocks, structural geology, metamorphism, geological history\nAdditional Notes: Provides a more scientific approach (especially with regards to terminology) to the geology of the\nAmherst area, which is due west of the reservoir. More specific and much more difficult to follow for those looking for a\ngeneral overview. Recommended for in-depth study of the topic. The \"Geologic History of the Amherst Area,\" pages 87-88,\nprovides a more accessible discussion of the origins of today's geological features.\nAuthor: Joesten, Raymond, and Sidney S. Quarrier, ed.\nTitle: Guidebook for Fieldtrips in Connecticut and South Central Massachusetts\nPublisher: No publisher given.\nDate: 1982\nUseful Pages: p. 31-48, 89-102, 289-373\nCall Number: QE 78.3.N532 1982\nPhysical Location: Lindgren Library\nReference: found using Barton search for Library of Congress subject header\nGeology -- Massachusetts -- Maps\nNotes:\nText: From 74th meeting of the New England Intercollegiate Geological Conference (no college names given). Also\nGuidebook Number 5 for the State Geological and Natural History Survey of Connecticut, The Natural Resources Center,\nDepartment of Environmental Protection.\nContents: preliminary geological map of Connecticut, Quaternary geology, Mesozoic geology, Paleozoic and\nPrecambriangeology\nAdditional Notes: \"Anatomy of the Chicopee Readvance, Massachusetts,\" pages 31-48, covers the geology of the\nregion to the southwest of Quabbin. Maps are difficult to interpret and have no non-geologic landmarks. A relatively specific\ndiscussion of this single geological feature, of little interest to those seeking a general overview. This feature might be\nmentioned in an overview paper, but information this in-depth may be too specific. \"Sedimentation in a Proglacial Lake:\nGlacial Lake Hitchcock,\" pages 89-102, covers the geology, formation, and remaining evidence of Lake Hitchcock, a glacial\nlake to the west of Quabbin. This topic is covered elsewhere, but this paper provides a nice overview. The road trip is less\ninteresting without knowledge of the region, but provides some specifics. \"High Grade Acadian Regional Metamorphism in\nSouth Central Massachusetts,\" pages 289-339, is less useful; much of the paper is taken up with a microscopic view of geology\nand minerology, rather than a macroscopic view of the region. The vocabulary and syntax is extremely specific and therefore\nconfusing to those without background knowledge of these two fields. More useful is \"Stratigraphy and Structure of the Ware-\nBarre Area, Central Massachusetts,\" pages 341-373. This covers the area to the south (Ware) and east (Barre) of Quabbin in\n\nsome detail, and includes several maps, again lacking any non-geological reference points. However, it is probably the most\nuseful source in the book, and is relatively accessible to non-geologists.\nAuthor: Michener, Stuart R.\nTitle: Bedrock Geology of the Pelham-Shutesbury Syncline, Pelham Dome, West-Central Massachusetts\nPublisher: see * at endnotes to this bibliography\nDate: 1983\nUseful Pages: 1-101\nCall Number: QE 123.M52 1983\nPhysical Location: Lindgren Library\nReference: found using Barton search for Library of Congress subject header\nGeology -- Massachusetts\nNotes:\nText: see * at endnotes to this bibliography ; Master's of Science Thesis\nContents: stratigraphy, intrusive igneous rocks, structural geology, metamorphism\nAdditional Notes: Like other similar documents (the other theses in this bibliography, for example), this is mostly too\nspecific for non-specialized research. However, the \"Introduction,\" \"Generalized Structural History of the Pelham Dome,\"\n\"General Structure of the Pelham-Shutesbury Syncline,\" and \"Summary Geologic History of the Pelham-Shutesbury Syncline\"\nare all worth reading, as they are more general and easier for the general researcher to parse. The region covered in this text is\nthe western part of Quabbin and some additional territory adjacent to the reservoir to the northwest. Recommended due to the\nspecificity of the region and the amount of general information. Maps and figures are well-done.\nAuthor: Robinson, Peter, ed.\nTitle: Guidebook for Fieldtrips in the Connecticut Valley of Massachusetts\nPublisher: No publisher given.\nDate: 1967\nUseful Pages: p. 17-47,105-127, 143-165\nCall Number: QE 78.3.N532\nPhysical Location: Lindgren Library\nReference: found via shelf browsing\nNotes:\nText: From the 59th annual meeting of the New England Intercollegiate Geological Conference (Amherst, Mt.\nHolyoke, Smith, Umass-Amherst). No publication information given.\nContents: overview of region's geology, twelve field trips\nAdditional Notes: \"Gneiss Domes and Recumbent Folds of the Orange Area, West Central Massachusetts,\" pages 17\n47, gives a nice description of the various rock types and formations found in the region, in addition to having several very\nuseful and easy-to-interpret maps. The region covered is directly under the reservoir itself, and is thus very localized to the\ntopic. Road trips with detailed diagrams and maps follow. \"Stratigraphy and Structure of the Monson Area, Massachusetts and\nConnecticut,\" pages 105-113, also has a good description of rock types and structure, although it is far shorter than the above.\nThere are, however, several nice maps. The most relevant paper in the text, however, is \"Geology of the Quabbin Reservoir\nArea, Central Massachusetts,\" which basically sums up the entire topic. A very detailed map and references to stratigraphy and\nstructural geology from other regions (with comparisons) follow. Geology of the islands, which are off-limits to visitors to the\nreservoir, is provided- a rare resource. Although the water trip seems detailed and irrelevant, the location of the trip is such that\n\nall details are important. \"Geology of the Northern Portion of the Belchertown Intrusive Complex,\" pages 143-153, covers the\narea to the southwest of Quabbin, while \"Sedimentary Features of the Triassic Rocks in Norther Massachusetts,\" pages 154-165,\ncovers the northwest region. Neither is particularly specific to the reservoir itself, and the first is quite minerologically scientific,\nwhile the second is almost too broad to be useful.\nAuthor: Robinson, Peter, and John B. Brady, ed.\nTitle: Guidebook for Field Trips in the Connecticut Valley Region of Massachusetts and Adjacent States\nPublisher: see * at endnotes to this bibliography\nDate: 1992\nUseful Pages:\nVolume 1: v-ix, 1-47, 95-119, 132-169, 199-215, 229-255\nVolume 2: 305-331, 358-379, 425-445, 467-487\nCall Number: QE 78.3.G86 1992 v.1 and v.2\nPhysical Location: Lindgren Library\nReference: found via shelf browsing\nNotes:\nText: From 84th annual meeting of the New England Intercollegiate Geological Conference (Amherst College, Smith\nCollege, Mount Holyoke College, Hampshire College, and Umass-Amherst). also see * at endnotes to this bibliography\nContents: overview of region's geology, twenty-three geological field trips\nAdditional Notes: Pages v-ix cover a brief overview of the geology and geologic history of the Connecticut Valley.\nThis overview is worth reading, as (despite its many references to other studies) it gives a good summary of the topic. The\nnumerous field trips, most of which have accompanying papers, described above are located in regions adjacent to or including\nQuabbin. Of particular interest and value are \"The Pelham Dome, Central Massachusetts: Stratigraphy, Geochronology,\nStructure and Metamorphism,\" pages 132-169 (covers the geology directly under Quabbin, as well as the surrounds, including\nnice maps; is relatively readable), \"Hydrogeology and Water Resources of the Connecticut Valley and Western Quabbin\nReservoir Watershed,\" pages 199-215 (although it's less geology and more hydrology, it provides a valuable view of Quabbin,\nincluding a description of important geologic features), and \"Glaciation of the Worcester Plateau, Ware-Barre Area, and\nEvidence for the Succeeding Late Woodfordian Periglacial Climate,\" pages 467-487 (which looks at the geology from the\nglacial perspective and gives evidence for more recent changes).\nAuthor: Roll, Margaret A.\nTitle: Effects of Acadian Kyanite-Zone Metamorphism on Relict Granulite-Facies Assemblages, Mount Mineral Formation,\nPelhamDome,Massachusetts\nPublisher: see * at ennotes to this bibliography\nDate: 1987\nUseful Pages: 1-202\nCall Number: QE 124.B44.R65 1987\nPhysical Location: Lindgren Library\nReference: found via shelf browsing\nNotes:\nText: see *at endnotes to this bibliography\nContents: description of rock types, mineral chemistry, phase relations, modeling, history of metamorphism\nAdditional Notes: Like the other theses, this is extremely specific, but does have some general information under the\n\n\"Introduction\" section. The rest of the paper deals with microgeology and minerology, which is less useful for research on the\ngeology of Quabbin, but the above section gives some information on the Pelham dome (immediately west of Quabbin) and its\nrock strata.\nAuthor: Shearer, Charles Kenneth\nTitle: Petrography, Mineral Chemistry, and Geochemistry of the Hardwick Tonalite and Associated Igneous Rocks, Central\nMassachusetts\nPublisher: see * at endnotes to this bibliography\nDate: 1983\nUseful Pages: 1-210\nCall Number: QE 123.S54 1983\nPhysical Location: Lindgren Library\nReference: found via shelf browsing\nNotes:\nText: see * at endnotes to this bibliography ; Doctor of Philosophy Thesis\nContents: rock distribution, petrography, mineral chemistry, phase relationships, geochemistry\nAdditional Notes: As above, this is quite specific and deals mostly with microgeology. However, the \"Introduction\"\nand \"Distribution and Correlation of the Hardwick Pluton and Associated Igneous Rocks\" contain information on\nmacrogeology. The region studied lies under the eastern half of Quabbin and continues to the east, north, and south. The text\ncontains several nice maps of the region with geologic strata distributions.\nAuthor: Skehan, James W.\nTitle: Roadside Geology of Massachusetts\nPublisher: Mountain Press Publishing Company\nDate: 2001\nUseful Pages: 1-32, 218-233, 238-242, 261-265, 269-281\nCall Number: QE 123.S56 2001\nPhysical Location: Lindgren Library\nReference: found in Minuteman Library Network catalog, then found using Barton title search\nNotes:\nText: Part of a series of \"Roadside Geology of\" books, one per state.\nContents: Geological overview of the state in three sections: Eastern seaboard, Central lowland and Bronson hill\nupland, Berkshires.\nAdditional Notes: An excellent overview of the topic, and one that should be approached as a definite first reference.\nIntended for a general audience, the book is specific enough to satisfy most needs. The \"Introduction\" (pages 1-32) provides a\ngeneral summary of the state's geologic histories, with region-specific information scattered throughout. The other pages given\nabove (in the 218-281 range) cover the geology of Central Massachusetts in depth, with some road trips. Pages 218-233 cover a\nmore specific overview of Central Massachusetts geology, with road trips in the remaining pages. Again, this book's value\ncannot be overstated, and it should definitely appear on any bibliography or citations page covering this topic.\n* Note: all texts with this symbol marked under their Notes: Text information are published under the auspices of the\nDepartment of Geology and Geography, University of Massachusetts Amherst. They are also labeled with contribution\nnumbers, although these aren't strictly useful.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_callahanbib.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/e12347891dc04613dfe81cccd8f0390f_MIT21H_421S11_callahanbib.pdf",
      "content": "Tyler Callahan\nMarch 16, 2004\n21H.421\nAnnotated Bibliography, Quabbin \"News\" topic\n(May 23, 1937). Big reservoir dam begun in bay state. New York Times, p. 37.\nRetrieved from: ProQuest\nThis article actually talks about some of the engineering aspects of the building of the\ndam for the reservoir. It discusses how dirt will be moved around, and how watchtowers\nare being built so that work can be done at night. This article wasn't hugely relevant to a\ndiscussion on the development of the Quabbin Reservoir, but it is one of two articles I\nlocated from the time of its development.\n(Nov 16, 1986). Boston delays water diversion plan. New York Times, p. 56.\nRetrieved from: ProQuest\nThe article talks about how in the year 2020, the Quabbin may not be able to supply\nwater for all of Boston's needs. The choices were to divert more water from other rivers,\nor to try to conserve current resources better. The decision was made for the latter, and\nwill begin by fixing 6400 miles of leaky pipes, which have been estimated at losing\nbetween 7 and 25 percent of their water. Environmentalists were pleased that diverting\nwater was avoided, and argued that it would be very costly and would contaminate the\npure water from the Quabbin Reservoir.\nAllen, Scott. (November 2, 1994). Quabbin didn't sink town memories. Boston Globe.\nRetrieved from: Boston Public Library\nThis article contains the opinions of some former residents of the towns displaced by the\nQuabbin Reservoir. There was a feeling of sadness and nostalgia, in addition to some\nbitterness. The article also mentions a ceremony the night before which gave about a\n\ndozen former Quabbin residents a certificate commemorating their loss, from Secretary\nof State Michael Connolly.\nThere is an added insight to the history of the decision to build the Quabbin Reservoir.\nResidents felt it was done unfairly, with all the decision-making being down in Boston,\nand with people who would benefit from the reservoir making up a third of the\nLegislature.\nTying the Quabbin happening with current developments, Boston was recently looking\nwest to find water again. Many residents, including some people displaced by the\nQuabbin, resisted, and it was found that a lot of water was being lost from the Quabbin\nthrough leaky pipes on its way to Boston. The fact that the pipes have been fixed and\nthat the Quabbin is well taken care of has erased some of the bitterness felt by past\nresidents.\nBullard, F. L. (July 31, 1927). Reservoir to cover 3 bay state towns. New York Times, p.\nE9.\nRetrieved from: ProQuest\nThis is one of two articles I found dating back to the time of the actual Quabbin\ndevelopment. The article first discusses the towns that the reservoir will cover, including\nwhat they're like and what important and well-known things came from them. The next\nsection discusses water shortage, and how the other reservoirs used for the metropolitan\narea were being depleted. It mentions a series of investigations, hearings, and debates\nleading up to the decision to build the Quabbin. Next the cost and general plans are\ndiscussed. Finally, the last part is quite different from what articles today say about the\nsituation. It reads, \"The people of the valley of the Swift accept these facts with some\nresentment, but in the main with resignation and with dignity. And Greater Boston by no\nmeans is indifferent to the tragedy which the need of the city inflicts upon these innocent\nbystanders.\"\nDavis, William A. (September 26, 1998). Quabbin: the state's oasis. Boston Globe.\n\nRetrieved from: Boston Public Library\nThis article describes the Quabbin region as a remote wilderness, rather than as an\nengineering triumph. The main success of the article is to give a feeling of what it might\nbe like to wander around the Quabbin area today. It sticks to the idea that it is a beautiful\nsite, but with a sad history. The article sums up its feeling about the four disbanded\ntowns with this: \"The subject of man books, stories, and legends, the towns over time\nacquired almost mythic status, transmuted from pleasant but ordinary country\ncommunities into symbolic rural Edens sacrificed to satisfy big-city needs for water.\"\nGaines, Judith. (November 29, 1992). Recalling the towns drowned for Boston. Boston\nGlobe.\nRetrieved from: Boston Public Library\nThis article depicts past residents as bitter about Boston just taking whatever it wants, and\nthey're resentful that \"they can never really go home.\" They recall the Enfield Ball in\n1938, and mention that another blow was when 7613 dead were removed from the\nvalley's 34 cemeteries. The people resent the fact that most Bostonians don't even know\nwhere the water comes from, and also mention the grievance that towns near the Quabbin\ncan't access its water.\nLamb, Gregory M. (Dec 1, 1982). Quabbin: the valley where time went backward.\nChristian Science Monitor, p. B26.\nRetrieved from: LexisNexis\nThis is a good article that has several anecdotes about some of the resistance and feelings\nhad by people at the time that the development was going on. Article also discusses a bit\nabout current problems with the reservoir, and the hope that it can maintain its usefulness\nso that four towns won't have been destroyed for nothing. A lot of water is lost and the\nacidity of the water may be changing so that harmful metals are picked up.\n\nSimurda, Stephen. (April 17, 1988). The Quabbin reservoir: then... and now. Boston\nGlobe.\nRetrieved from: Boston Public Library\nThis article has another set of reflections by former residents of the disbanded towns, and\nmentions a ball being held in Amherst, exactly 50 years after the one held on the last\nnight of the towns' existence, at the Enfield Town Hall. In looking back, they mention\nhow they called the workers \"woodpeckers,\" as they were just destroying and pecking\naway at the wood, and didn't really know what they were doing.\nThere is a discussion of how this event (the removal of people from their towns) could\nhave ever happened, and mentions that there wasn't much organized protest. It \"just\nwasn't a popular course,\" and in addition it was difficult for residents to get to Boston to\nspeak against the proposal.\nAgain, the people were frustrated that most people in Boston don't even know where\nthere water comes from, and that if this plan was proposed today it would die quickly.\nTurner, Robert L. (Nov 20, 1988). State problems, rural solutions. Boston Globe, p.\nA27.\nRetrieved from: LexisNexis\nThe article starts by addressing Boston's arrogance, by ruining rural peoples' way of life\nto solve their own problems, producing results that the rural people never benefit from.\nThe article discusses the proposed building of a prison in New Braintree, to help alleviate\nthe state's shortage of prison space, and relates this event to the building of the Quabbin\nReservoir.\nWeiss, Joanna. (August 22, 1999). For 60 years the Quabbin has provided water, refuge,\npride - and resentment. Boston Globe, p. B1.\nRetrieved from: LexisNexis\nThis article contrasts people living in the Quabbin area with those living in Boston. For\nthe people around Quabbin, their use of water changes with the season, and the reservoir\n\nis a preserve for fishing and recreation, anything but a source of water. For Boston the\nQuabbin Reservoir is freely used and largely ignored, as most residents don't know\nwhere their water comes from.\nThe Quabbin development was compared to the current Big Dig, where Boston gets a\nnew road system while in rural areas, roads crumble.\nRecalling the time that the reservoir was built, residents recall that it was good in some\nways. For one, if it hadn't been built people may have started moving west for water, and\nthe people in the rural areas would rather not have that kind of development. Second, it\ncreated jobs. Last, there is resentment that the government didn't compensate very well\nthe people forced to move out of the valley.\nAlso mentioned:\nGreene, J. R. (2002). The Creation of Quabbin Reservoir: the Death of the Swift River\nValley. Athol, Mass.: Transcript Press.\nGreene, J. R. (1985). The Day Four Quabbin Towns Died. Athol, Mass.: Transcript\nPress.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_callahanppr.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/51d9aa000702fef07fdfa20a0565bb01_MIT21H_421S11_callahanppr.pdf",
      "content": "Tyler Callahan\nMarch 16, 2004\n21H.421\nBibliographic Essay, Quabbin \"News\" topic\nThen and now: changing attitudes in news reports concerning the Quabbin Reservoir\nThe news that has been published about the development of the Quabbin Reservoir\nfalls into three general categories. There are writings from the early part of the century\ndiscussing planning and development issues, recent articles looking back with nostalgia and\nsometimes resentment on the events that took place, and others about current water\nconservation or other issues that draw comparison with what happened in the Quabbin valley.\nThe articles from different time periods show a change in the feelings and outspokenness of\nthe displaced residents, moving from a somewhat resigned but accepting attitude in the past\nto one of fond, yet bitter, remembrance today.\nNews from the past\nThere was a fair amount of news published, mostly by newspapers local to the\nQuabbin region, during its planning and construction stages at the beginning of the century.\nKey issues discussed at the time were the water shortage of Boston, the engineering of the\nnew reservoir, and the displacement of the people from the towns of Dana, Enfield, Prescott,\nand Greenwich.\nThe article \"Reservoir to cover 3 bay state towns\" from the New York Times in July,\n1927, appeared a few months after the legislation to build the Quabbin Reservoir was passed.\nThe article gives a bit of information about each of the towns to be covered over by the\nreservoir, and mentions several important and well-known people and ideas that had come\n\nfrom them. It next moves into the issues of Boston's water shortage, and the work that went\ninto choosing the Quabbin area as the best site for reservoir development. The article also\nmentions a series of investigations, hearings, and debates leading up to the decision to build\nthe reservoir. The overall cost and general plans for the reservoir's construction are reported\nas well. The final part of this article offers a glimpse into how people felt about displacing\nthe four towns. It reads, \"The people of the valley of the Swift accept these facts with some\nresentment, but in the main with resignation and with dignity. And Greater Boston by no\nmeans is indifferent to the tragedy which the need of the city inflicts upon these innocent\nbystanders.\" The notion that the valley residents were performing an honored duty, and that\nthe people of Boston were appreciative of their sacrifice, is not one that has carried on into\nrecent history.\nAnother article, \"Big reservoir dam begun in bay state,\" matter-of-factly describes the\nbeginning of the construction of the reservoir in 1937. The four towns to be covered are\nmentioned, but the article focuses mainly on the construction techniques and engineering\nissues involved in the beginning of the project. It also talks about the use of watchtowers\nwith searchlights, to enable work on the reservoir to continue at night. It is interesting that\nthe article fails to note any protest from the townspeople. The feeling of the article is that the\nsituation is simply a government order being carried out, and will continue on as planned.\nMany other pertinent articles from this time period exist today in archival form. J. R.\nGreene's The Day Four Quabbin Towns Died lists several newspapers with useful\ninformation, including the Athol Daily News, Boston Globe, Boston Herald, Boston Post,\nDaily Hampshire Gazette, Orange Enterprise and Journal, Springfield Republican,\nSpringfield Union, Ware River News, and Worcester Telegram and Evening Gazette. In\n\nparticular, Greene mentions the series \"Letters from Quabbin,\" written by Amy Spink and\nMabel Jones, which appeared in the Springfield Union. The Boston Public Library holds\nmicrofilm from this time period for at least the Boston Globe and Springfield Union papers,\nwhich would likely prove useful in further research. A list of particular articles used by\nGreene in his study can be found in the back of his work, The Creation of Quabbin Reservoir:\nthe Death of the Swift River Valley, in Part 1 of the appendix, but unfortunately by the time\nthis was discovered I had no time to investigate.\nNews from recent times\nMany newspaper and magazine articles have been written about the Quabbin\nReservoir more recently. Most seem to offer a very calm and picturesque vision of the\nreservoir, and intertwine this with stories of the towns that were covered forever by its waters.\nThe general theme of many recent articles, paying particular attention to the lost towns, can\nbe summed up by William A. Davis in his 1998 Boston Globe article. He writes: \"The\nsubject of man books, stories, and legends, the towns over time acquired almost mythic status,\ntransmuted from pleasant but ordinary country communities into symbolic rural Edens\nsacrificed to satisfy big-city needs for water.\"\nSome of the articles contain glimpses into the reactions and attitudes of the valley\nresidents. Gregory Lamb, in \"Quabbin: the valley where time went backward\" (1982), says\nthat the people in the four towns were \"essentially good, decent, religious folks.\" They were\nnot prone to put up an organized resistance against what was being done to their homes, and\nLamb describes that the state officials may have even played off the unselfish nature of the\narea residents, convincing them that it would be wrong to deny water to their fellow men.\n\nNobody left their homes happily, and there were a few instances of stubborn resistance, but\nnever were they violent. For instance, one man awoke in the morning and heard workers\ntaking apart the roof of his barn, so he walked outside and took away their ladder.\nOther newspaper descriptions of the time mention the unfairness of the decision to\nbuild the Quabbin. Allen's 1994 Boston Globe article says that residents of the tiny towns\ndidn't have a very strong voice, and in addition, all of the decision-making was done in\nBoston, where the townsfolk could not easily travel. Residents did not openly welcome the\nBoston workers in their towns, calling them \"woodpeckers,\" as they were just destroying and\npecking away at the wood and didn't really know what they were doing.\nMany of the recent articles contain mention of what former residents of the valley\nhave been doing since being displaced from their homes. Several members of this group still\nmeet regularly to reflect on their earlier years in the valley. Allen's article talks about a\nceremony in 1994 which gave about a dozen former Quabbin residents a certificate from\nSecretary of State Michael Connolly commemorating their loss. In addition, the papers\nmention a ball being held in Amherst exactly 50 years after the last one was held in Enfield,\non the last night of the four towns' legal existence.\nThe newspapers are also a good source for determining current feelings about the\nQuabbin Reservoir project. Several mention that one of the last indignities imposed on these\nresidents was the removal of 7613 dead from the valley's 34 cemeteries. It is further brought\nup that the residents were poorly compensated for their homes and property when forced to\nmove. Many are upset that after all that was sacrificed, most Bostonians have no idea where\ntheir water comes from. Judith Gaines' 1992 Boston Globe article describes the worst\nfeeling had by many former valley dwellers, simply that \"they can never really go home.\"\n\nIn contrast to these widespread negative feelings about the experience, some residents\nfound a few good things that came of it. Lamb describes that at the time of the depression,\nthe building of the reservoir would provide a lot of jobs. He explains that this may have\ncontributed to Boston officials' eagerness to get the project passed. Former valley residents\nalso feel that had the reservoir not been built, people may have started moving west for water,\nand rural populations would rather not have that kind of development.\nSeveral newspapers also discussed the idea that what happened to the residents of the\nQuabbin valley would not even be considered today. Lamb writes that the \"growing\nsquabble over the likely effects of acid rain at Quabbin contrasts sharply with the quiet\neviction of the valley people half a century ago,\" showing the change from the little notice\ntaken of the Quabbin people then, to large concern for the people using the water now.\nRelated topics\nAnother subset of articles mentions the Quabbin Reservoir but does not dig deeply\ninto its history. The 1986 New York Times article talks about Boston's concern that by 2020,\nthe Quabbin would not be able to provide enough water to suit its needs. The city began\nlooking west again, investigating ways to divert water from other sources. Environmentalists,\nas well as former Quabbin residents, opposed this idea, and argued that the current resources\ncould be conserved better. The city agreed, and set to work on fixing 6400 miles of leaky\npipes. It was mentioned that because of these ongoing efforts to take care of the reservoir\nand to conserve water, many people from the displaced towns feel less bitterness at their loss.\nTurner's 1988 article, \"State problems, rural solutions,\" from the Boston Globe,\ndraws a comparison between a Boston plan to build a state prison in a rural community and\n\nthe development of the Quabbin Reservoir. It addresses Boston's arrogance, in that the city\nruins rural peoples' way of life to solve their own problems, producing results that the\naffected people never benefit from. Another article mentions the Big Dig, and how similar to\nwhat has happened in the past, Boston will get an entire new system while the rest of the\nstate remains in need.\nThe overall message sent by newspapers has changed drastically over the years. In\nthe early part of the century the Quabbin Reservoir was deemed a necessary solution to\nBoston's water problem, and it was designed to affect a minimal number of people. News\nreports at that time spoke more of the development issues of the project and focused less on\nthe sacrifices made by the residents displaced from their homes. Recent articles tend to\ndescribe more the tragic destruction of the four Massachusetts towns, and emphasize the\nQuabbin story as an example of metropolitan areas' disregard for people living in rural areas.\nDespite having different feelings about the reservoir's development, most news accounts tend\nto agree that the Quabbin Reservoir is a beautiful and valuable resource, with a history that\nmakes it that much more special.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_gilbertbib.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/cdc96d0bd2019385ab696518a40c55d8_MIT21H_421S11_gilbertbib.pdf",
      "content": "21H.421\n\nDanielle\n\nGilbert\n\nAssignment #2: Bibliographic Essay\n\n3/15/04\nAnnotated Bibliography\nBickford, W.E. and U.J. Dymon, eds. 1990. An Atlas of Massachusetts River Systems:\nEnvironmental Designs for the Future. Massachusetts: University of Massachusetts at\nAmherst Press.\nThis short picture book is organized into two sections. It begins with a chapter on\nstatewide trends in river wildlife management. This chapter is subdivided into\necological trends/wildlife history, fisheries laws and management, and then\ninformation on different wildlife groups, including mammals, birds, fish, reptiles\nand amphibians. The chapter is concluded with a short article titled\n\"Socioeconomic Values of River Corridor Protection\". The second chapter of the\nbook provides a summary and map of 23 different river basins in Massachusetts.\nThe book ends with a longer article on the successful management of the Nashua\nRiver basin. The Quabbin Reservoir is in the Chicopee River basin and\ninformation on this basin is found on pages 46 and 47. This source will be very\nuseful for general information on Massachusetts riparian wildlife.\nConuel, T. 1981. Quabbin: The Accidental Wilderness. Massachusetts: the Massachusetts\nAudubon Society.\nThis book, by one of the authors of the Audubon guide The Nature of\nMassachusetts (see Leahy et al. later in this annotated bibliography), contains\nextensive information on the wildlife of the Quabbin Reservoir area. Although it\ndoes not approach the construction and flooding-of-towns issue in-depth, as J.R.\nGreene does in his The Day Four Towns Died, Conuel does provide a nice\nsummary for those new to researching the Quabbin. I expect that this book will be\nvery useful for those researching the following topics: Changes in the Land and\nLandscape, Recreation and Conservation, The Country and the City, and Wildlife.\n\nDizard, J.E. 1999. Going Wild: Hunting, Animal Rights, and the Contested Meaning of\nWilderness. Massachusetts: University of Massachusetts at Amherst Press.\nFrom the title, I assumed this book would be a general review of wilderness\nmanagement. Instead, I found that Dizard concentrated on the Quabbin, especially\nin the management of its deer populations. I skimmed the book and found these\npages that contain information on Quabbin wildlife: 8, 12-14, 35-37, 69-71, 95-\n98, 175-177, 210-211. A list of species is found on page 8, and Dizard introduces\nthe deer problem on page 12. She reports the establishment of bald eagles in the\nQuabbin on pages 13 and 14, and then continues addressing the deer on pp. 35-37.\nDeer management is discussed on pp. 69-71 and hunting on pp. 95-98. Dizard\ngives the results of the first deer hunts on pp. 175-177 and, finally, provides a nice\nsummary of Quabbin wildlife on pp. 210-211.\nGorman, J., \"Bald Eagles Resettling Their Old Neighborhood\". The New York Times.\nJanuary 18, 2002. E.2:50.\nThe reporter, James Gorman, goes on a bird-watching tour near Quabbin\nReservoir to observe the famous bald eagles. In the article, he describes the\nintroduction of eagles to the lake and their current status. As I am planning to use\nthe eagles of Quabbin Reservoir as my topic for the final paper, I expect this\nsource to be very useful. Unfortunately, Gorman does not see any bald eagles on\nhis trip, but the article still covers the subject well.\nGreene, J.R. 1981. The Creation of the Quabbin Reservoir: the death of the Swift River\nValley. Massachusetts: Performance Press.\nThis source chiefly concerns the impact of the creation of the Quabbin on local\nresidents. It covers the destruction of four towns: Prescott, Greenwich, Dana, and\nEnfield. Greene is the author of The Day Four Towns Died, another book on the\nQuabbin. It is likely that much of the information in The Creation of the Quabbin\nReservoir is the same as that in The Day Four Towns Died. As for relevance to\n\nmy topic, wildlife, all pertinent information is on one page, pg. 90. A summary of\nGreene's points:\no Quabbin Reservoir watershed was originally over-planted with pines, but\ncurrent management seeks a more balanced forest. This is beneficial for\nwildlife.\no Fish stocking has been very successful. (I wonder - what about native\nspecies?)\no It was not economical to graze sheep.\no Wild turkey stockings have been partially successful.\no Deer, wildcats, eagles, and geese are found in the region.\nLeahy, C. et al. 1996. The Nature of Massachusetts. Massachusetts: Addison-Wesley\nPublishing Co., Inc.\nThis book was published in celebration of the 100th anniversary of the\nMassachusetts Audubon Society. As is typical of Audubon-type publications, the\ninformation is very detailed and accompanied by exquisite illustrations (done by\nLars Jonsson). Thomas Conuel, the author of Quabbin: The Accidental\nWilderness is the third author of The Nature of Massachusetts. I was immediately\nstruck by the beautiful cover page, which depicts a watercolor of a bald eagle\nflying over Quabbin Reservoir. The book is organized into four sections: The Sea\nand Shore, The Central Peneplain, The Connecticut River Valley, and The\nWestern Highlands. I found information helpful regarding Quabbin wildlife in the\nOak-Conifer Forest and Lakes and Ponds chapters in the Central Peneplain\nsection. The Quabbin itself is mentioned just briefly, on page 134, as a good place\nto visit, with accompanying directions. Quabbin: The Accidental Wilderness is\nlisted in the Further Reading section at the end of the Lakes and Ponds chapter.\n\nMcCann, J.A. et al. 1972. Inventory of the Ponds, Lakes, and Reservoirs of\nMassachusetts - Worchester County. Massachusetts: Community Resource Development\nProgram, University of Massachusetts at Amherst Press.\nThis book is a result of a research project of the Water Resources Research Center\nat UMass Amherst. It contains maps and information on the physical\ncharacteristics on the major ponds and lakes in Worchester County,\nMassachusetts. Seven towns encompass Quabbin Reservoir: New Salem,\nShutesbury, Pelham, Belchertower, Ware, Hardwick, and Petersham. Worchester\nCounty includes Hardwick and Petersham. A full-page map of Quabbin\nReservoir, complete with town lines and water depths, is on pg. 170.\nMichniewicz, J. \"Species counts below average\". Worchester Telegram & Gazette.\nFebruary 25, 2003. D5\nThis article is a general summary of the fish and bird species that are found in the\nQuabbin Reservoir area. The inventory was performed by the U.S. Fish and\nWildlife Service in January 2003. (I did not find a similar inventory for this year.)\nI intend to use this article, along with some of the other sources listed here, to\ncreate a list of the wildlife species found in the Quabbin region. Michniewicz does\nconclude that species counts are below average, but this estimate includes coastal\nspecies that do not inhabit the Quabbin reservoir area.\nVaznis, B. \"Quabbin's whitetails\". The American Hunter 26, 9 (Sept. 1998): 20-21.\nThis article is from a hunting magazine, The American Hunter. It begins with a\nshort anecdote by the author about his \"most memorable encounter with Quabbin\nReservoir\". Vaznis then presents a summary of Quabbin Reservoir history,\nfollowed by an intelligent argument about deer control in the Quabbin area (the\nauthor does, however, use the phrase 'whopper buck'). The article includes a map\nof the area and would be interesting and useful to any student researching the\ntopic of deer management in the Quabbin Reservoir region.\n\n(National Wildlife Federation). \" 'New forestry' aids wildlife, economy in\nMassachusetts\". International Wildlife 28, 6 (Nov/Dec. 1998): 9.\nThis article was submitted by the National Wildlife Federation to the journal\nInternational Wildlife. It discusses how forest management has enhanced the\nwildlife and natural beauty of the Quabbin Reservoir area, which in turn\ncontributes to the state's tourism industry and improves local property values.\nUnlike Going Wild by Dizard (see Dizard citation and accompanying notes), this\narticle takes a positive stance on wildlife management, while Dizard presents both\nsides and generally remains neutral. This article includes the following quote from\nMark Lorezno, a project manager for NWF, \"You only have to walk through this\nforest to see that wildlife and economic activity coexist in harmony... If\ncompanies and government learn from this example, we can start restoring the\nbalance of nature in forests all over America\".\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_mackaybib.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/2a037b361582edfa78dbe0a501e6fd35_MIT21H_421S11_mackaybib.pdf",
      "content": "Joanna MacKay\n3/15/04\nBibliographical Essay\nDigging Below the Water:\nA bibliographical essay on life before the Quabbin\nIn an effort to meet Boston's ever-growing demand for water in the 1930s, the\nstate of Massachusetts bought and flooded the towns and farmlands of the Swift\nRiver Valley, creating the Quabbin Reservoir that we have today. Residents were\nforced to abandon their crops, their towns, and ultimately their entire way of living.\nWith the lands of Greenwich, Enfield, Dana, and Prescott almost completely\nsubmerged and their former inhabitants scattered, the task of recreating life before\nthe Quabbin could be difficult without the consultation of books, maps, and\nphotographs.\nGrasping the general idea of what happened in the Quabbin should be the\nfirst step in tackling any extensive research. For concise and simple summaries, the\nWorld Wide Web is a great tool since most of its pages are targeted at the general\npublic, who would typically have no background knowledge of the subject. By using\na search engine such as Google or Yahoo, one can find dozens of websites relaying\nthe history of the Quabbin in just under a page; some may even have pictures or\nlinks to other resources. A very thorough and well organized website can be found at\nhttp://www.foquabbin.org. Maintained by The Friends of Quabbin, Inc., a non-\nprofit organization aimed at spreading their love and awareness for the area both\npast and present, the site has many useful links including a history of the Swift River\nValley and the four individual towns as well as a timeline dating from 10,000 BC to\nthe present, detailing major events and town populations. Another good source for a\ngeneral overview is Jan E. Dizard's Going Wild: Hunting, Animal Rights, and the\nContested Meaning of Nature (Amherst, MA: University of Massachusetts Press, 1999\npgs 6-7). While Dizard mainly discusses deer hunting in the Quabbin today, he gives\n\na brief, clear history of the area in two pages, detailing the process of choosing the\nsite of the reservoir as well as the need for careful clearing of the land. With at least a\npartial understanding of the issues involved in creating the Quabbin reservoir, one\ncan research the topic in depth more effectively.\nDetailed, factual histories of the Quabbin Reservoir lay out the major events\nchronologically, often serving as primary sources of the brief generalizations found\nonline, for example. A great detailed account is J.R. Greene's Creation of Quabbin\nReservoir: Death of Swift River Valley (Athol, MA: JR Greene, 1987), which covers\neverything from the growth of the town to the construction's aftereffects on\nagriculture. J.R. Greene proves to be one of the main historians of the Quabbin,\nhaving been researching the topic since 1975, publishing books, history calendars,\nand atlases. In this book, he very clearly explains the causes of the growth and\neventual decline of farming in the Swift River Valley in particular and then proceeds\nto detail the politics of obtaining the land needed to build the reservoir as well as the\nresidents' legal struggles against it. A great feature of Greene's chapter on the\n\"exodus\" (pgs 66-73) is his ability to emphasize the slowness of the moving process.\nWhile other historians deal with the issue swiftly, Greene details the long drawn out,\nlast few months of the four towns' existences, in which life seemed to slowly crawl to\na halt as construction of the dams began. Greene also includes various pictures as\nwell as a table in which the decline in population of each of the towns can be\nvisualized.\nAnother good history is Thomas Conuel's Quabbin: The Accidental\nWilderness (Amherst, MA: University of Massachusetts Press, 1990), a sympathetic\nbut factual account of the towns that once existed and the reservoir that inevitably\ntook their place. Conuel provides a good general overview of the history of the\nregion, but also details the wildlife that have made it their home today, focusing not\nonly on the beauty of the past, but also on the beauty of the present. Quabbin: The\nAccidental Wilderness has some great photographs, that most books lack, portraying\nthe process of preparing the lands for flooding, including the moving of houses and\n\nthe destruction of bridges. These books contain the most relevant facts of the\nQuabbin's history in an organized and efficient manner.\nBy giving a fairly objective view resistant to change, maps aid in the\nvisualization and understanding of facts as well as serve as a good basis for\ncomparison across time periods. Often a writer tries to describe what only a map can\ndisplay, such as the spatial arrangements of towns and bodies of water. In the context\nof the Quabbin Reservoir, they give a sense of size to the towns that were lost and the\nreservoir that was made, as well as show the stage of settlement and development in\na certain year by the number of roads and where they intersected. The main source\nfor maps of the pre-reservoir towns is J.R. Greene's An Atlas of the Quabbin Valley and\nWare River Diversion (Athol, MA: J&P Printing Co., 1996). Greene provides a page-\nsize road map for each of the four towns: Greenwich, Enfield, Dana, and Prescott, as\nwell as for other parts of towns like Millington that were also destroyed. Along with\nthe maps, he also includes brief histories for each of the towns, including information\nsuch as population size and date created. Such maps of non-existent towns are hard\nto come by. Another useful map is the \"Plan of Proposed Reservoir on the Swift\nRiver and Its Tributary Watershed\" (Belchertown, MA: Friends of Quabbin Inc., 1922,\nredrawn by D. Chandler, 1986). This large map shows the towns, roads, and\ncemeteries in detail that would soon be replaced by the Quabbin Reservoir.\nWhile obtaining the facts is crucial, gaining a sense or feeling of life in the\nSwift River Valley is also important. The everyday life of the everyday resident is\nnot mentioned in most histories. Such details can be easily overlooked or hidden by\nnumbers and generalizations, but it is these \"useless\" details that can bring the past\nto life. Through his book The Day Four Quabbin Towns Died (Athol, MA: Transcript\nPress, 1985), J. R. Greene is able to recreate the last few days of life in the valley\nthrough documents such as local newspapers. His descriptions are very specific,\nallowing the reader to understand what a day in the life of a resident would be like.\nBy including the names of actual inhabitants in their daily activities as well as dates\nand times, he gives every minor detail importance. Besides the initial introduction\n\nand history, Greene does not offer much opinion or explanation, but instead simply\nnarrates events such as the last day celebrations. At the end he includes a list of\nresidents of the four towns as well as copies of two laws passed regarding the area's\nexistence. Another source for ordinary details of the Swift River Valley often missed,\nthough based on experience and not documents, is Evelina Gustafson's Ghost Towns\n'Neath Quabbin Reservoir (Boston, MA: Amity Press, 1940). A travelogue from her two\ntrips through the valley in 1938 and 1939, Gustafson's book reads like a tour, directed\ntowards the reader. As she drives through each town pointing out buildings and\nimportant roads, Gustafson gives brief histories and anecdotes of each, just as a tour\nguide would. Set after the official closing of the towns, her account is sentimental\ntowards the people who were then forced to pack up and leave. She also focuses on\nan event not covered by most historians: the auctions in which some residents sold\neverything they could not move, while others bid, hoping to save their memories and\nretain a piece of their past. Such memories cannot be described by mere facts and\nfigures.\nVisual imagery provides details that are sometimes lost in words. A good\nsource for all kinds of photographs relating to the Quabbin Reservoir and its history\nis Joseph W. M. Russell's A Quabbin Chronicle: 1900-1988 (Monson, MA: Blatchley's\nPrinters, 1988). Organized chronologically, pictures of buildings, people, newspaper\nclippings, and documents give insight into how the Swift River Valley changed over\nthe years. Russell covers everything from the hurricane of 1936 to the last post office\nmailings of 1938 to the reunions of former residents in the 1980s. He also includes a\nhydrogaph of floods and a chart detailing the readjustment of towns after the\nreservoir's creation.\nA great collection of photos of Greenwich, Enfield, Dana,\nPrescott, and New Salem and their former inhabitants can be found in Elizabeth\nPierce's Images of America: The Lost Towns of the Quabbin Valley (SC: Arcadia\nPublishing, 2003). Separated into chapters by town, black and white photographs of\nresidents, homes, stores, and road signs, when pieced together, give almost a\ncomplete image of the Swift River Valley before the threat of its destruction. For\n\nphotographs of buildings in their original and present locations, Joseph W.M.\nRussell's Vestiges of the Lost Valley: Buildings and Bells from the Quabbin (Monson, MA:\nBlatchley's Printers, 1986) is the perfect source. Before the Swift River Valley was\nfilled with water, its buildings were relocated to nearby towns. Russell compiled\npictures of these houses, churches, and stores both where they were originally built\nand where they reside today. Interestingly, he also includes various church bells that\nwere moved, in particular a bell that was melted down and re-formed into many\nminiature ones.\nSince many of the former residents of the Swift River Valley are alive today,\ntheir memories and sentiments can be important in evaluating the impact the\nQuabbin Reservoir had on their lives. Quabbin Voices is a quarterly publication from\nThe Friends of the Quabbin, Inc., in which former residents can share their stories,\npoetry, and pictures with one another as well as the rest of the world. It is within\nthese pages that they hope to keep the past of the lost towns alive. The newsletter can\nbe found at The Friends of the Quabbin homepage at http://www.foquabbin.org.\nA source for more sources is always helpful when conducting extensive\nresearch. J.R. Greene's A Bibliography of Quabbin Valley History (Athol, MA: Transcript\nPress, 1992) contains a broad list of materials relating to the Quabbin Reservoir and\nthe Swift River Valley. Organizing his resources first into sections such as books,\njournals, government documents, or theses, and then alphabetically by author,\nGreene reduces the workload for future researchers. Under many of the titles, he\neven explains their pros and cons as sources of information.\nThe towns of the Swift River Valley are gone forever, but they have left many\nstories and artifacts behind. Through careful research and investigation, the past can\nbe recreated and perhaps better understood. Buildings and forests were destroyed\nbut as with any destruction, there is also creation. The Quabbin Reservoir has\nbecome a vital source of life not only for the people of Boston, but also for the plants\nand animals that have made the area their home.\n\nAnnotated Bibliography\nChandler, D. 1986 [1992].\"Plan of Proposed Reservoir on the Swift River and\nIts Tributary Watershed\". Belchertown, MA: Friends of Quabbin Inc.\n- It is a very large map of the proposed reservoir detailing Greenwich,\nPrescott, Dana, and Enfield as well as the surrounding towns. It shows the\nlocations of rivers, ponds, cemeteries, and boundary lines and also outlines\nwhere the reservoir will be. Compared to other small maps in books, this map\nis easy to read because of its size.\nConuel, Thomas. 1990. Quabbin: The Accidental Wilderness. Amherst, MA:\nUniversity of Massachusetts Press.\n- This is a good detailed history of the Swift River Valley. Conuel is\nsympathetic for the lost past, but also appreciative of the reservoir and its\nwildlife today. It has great photographs, including ones depicting the moving\nprocess and a clear explanation of the choice to create the reservoir in the first\nplace.\nDizard, Jan E. 1999. Going Wild: Hunting, Animal Rights, and the Contested\nMeaning of Nature. Amherst, MA: University of Massachusetts Press.\n- This book focuses mostly on the issue of deer hunting in the Quabbin park,\nbut in the first few pages it gives a good overview of the Quabbin's history in\na concise and well-organized manner. It is a good resource with which to gain\nsome simple background knowledge on the subject.\nGreene, J. R. 1996. An Atlas of the Quabbin Valley and Ware River Diversion.\nAthol, MA: J&P Printing Co.\n- This atlas contains detailed road maps of the towns in the Swift River Valley\nas well as town histories. These maps are hard to come by since the towns no\nlonger exist.\n- - - 1992. A Bibliography of Quabbin Valley History. Athol, MA: Transcript Press.\n- This is Greene's collection of resources from all of the research that he has\ndone. He lists books, journals, newspapers, magazines, theses and\ngovernment documents that deal with the Quabbin's history. He organizes the\nbibliography first by type of material and then alphabetically by author. For\nthe books he provides notes on what they contain.\n- - - 1987. Creation of Quabbin Reservoir: Death of Swift River Valley. Athol, MA:\nJR Greene.\n- It is a well-explained history of the Quabbin, covering the politics as well as\nthe last days of the towns. Greene does a great job depicting the slowness of\n\nthe moving process. He includes pictures of the towns and the dams, as well\nas a table showing the changes in population.\n- - - 1985. The Day Four Quabbin Towns Died. Athol, MA: Transcript Press.\n- This book gives a general feeling of the towns in their last days as opposed to\njust facts. It reads like a narration, involving the names of residents as well as\nspecific times and dates. Greene includes of lists of residents of the four towns\nand two laws pertaining to the area's existence.\nGustafson, Evelina. 1940. Ghost Towns 'Neath Quabbin Reservoir. Boston, MA:\nAmity Press.\n- This is a travelogue of the author's trips through the Swift River Valley. It\nreads as a tour with the author as the tour guide, pointing out interesting sites\nand giving bits of history. It is very sentimental and gives the reader a vivid\npicture of life before the Quabbin.\nPierce, Elizabeth. 2003. Images of America: The Lost Towns of the Quabbin Valley.\nSC: Arcadia Publishing.\n- This is a great collection of photographs of the people, buildings, and signs\nof the Swift River Valley towns. The pictures are organized by town and\nintroduce the former residents of the area.\nRussell, Joseph W. M. 1988. A Quabbin Chronicle: 1900-1988. Monson, MA:\nBlatchley's Printers.\n- A pictoral record of the Quabbin, this book has everything from photographs\nof the towns to newspaper clippings, and even the last graduation notices. It is\norganized chronologically and covers the area's whole history. This book\nprobably contains the best visual imagery on the subject.\n- - - 1986. Vestiges of the Lost Valley: Buildings and Bells from the Quabbin. Monson, MA:\nBlatchley's Printers.\n- This book contains pictures of many of the buildings that were moved to\nmake way for the reservoir. It shows the original locations of houses, stores,\nand churches beside their current locations in nearby towns. Russell also\nincludes church bells that were relocated.\nhttp://www.foquabbin.org\n-A website run by The Friends of Quabbin, Inc. It has a well-written, but brief\nhistory of the Quabbin area as well as histories of the four towns, making it a\ngood general overview of the topic. Includes a detailed timeline in the section\n\"Chronology\" dating back to 10,000 BC. Provides access to the Quabbin\nVisions newsletter in which former residents share their stories and pictures.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_tiupaper2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/be8cbd403b14d03c6eda32591bcf3826_MIT21H_421S11_tiupaper2.pdf",
      "content": "Michelle Tiu\n\nMarch 16th, 2004\n21H.421 - Introduction to Environmental History\n\nProfessor Ritvo\nNever Forgotten: The Towns of the Swift River Valley\nWhen Boston is in need of more water, Massachusetts looks westward for a solution. In\nthe early twentieth century, it was decided, once again, that Western Massachusetts' natural\nresources would hold the answer to Boston's water problems. During the 1920's, construction\nbegan on the Quabbin Reservoir, a project that would remedy the state's water problems, but\nwould leave much turmoil in its wake. By constructing the Quabbin Reservoir, the Swift River\nValley, as well as the four towns of Dana, Enfield, Greenwich, and Prescott, were overtaken and\ndestroyed.\nThere is a great deal of information available on these four lost towns of Quabbin. J.R.\nGreene, a life-long resident of Athol, Massachusetts and a local expert on the Quabbin Reservoir,\nwrote the comprehensive book, The Day Four Quabbin Towns Died. The entire book is an\nexcellent resource for information on the Quabbin towns, spanning from their past to their\nunfortunate destruction. Greene attempts to \"recreate the Swift River Valley at the time its four\ntowns officially passed out of existence\" (6), by giving detailed descriptions of both local and\nnational concerns of the time. In addition to providing basic facts and histories of the towns,\nGreene also documents the townspeople's reactions to their imminent end. Further, the\nappendices provide a list of Town Records and Disincorporation Laws, as well as a record of\nTown Officials, Residents and Voters.\nMichael Tougias's Quabbin: A History and Explorer's Guide is another valuable resource\non the towns of the Quabbin Reservoir. Tougias takes an all-encompassing look at the four\ntowns, analyzing their past through a myriad of pictures, histories, and first-hand accounts. In\n\n\"The Past: Part 1, Creating the Quabbin\" (2-21), Tougias tells how the Swift River Valley was\ncleared of its property and residents. Of note are the sections entitled \"Cleaning the Valley,\"\n\"Cemeteries: Removing 7500 Dead,\" and \"Negotiating the Sale of Property\" (which includes\ncopies of the actual forms and notices used by the towns). He then takes a more personal\napproach in the next sections, \"The Past: Part 2, The Lost Towns\" (29-70) and \"The Past: Part 3,\nForgotten History of the Region\" (80-85), by telling the stories of the Swift River Valley\nresidents. Through interviews with former town residents, Tougias is able to recount the\nmemories of those who once lived in the lost towns. Additionally, Tougias shares the towns'\nhistories through pictures, letters, anecdotes, and local folklore.\nThere are many other sources that also share the personal histories of the town's\nresidents. Chapter 2 of Thomas Conuel's Quabbin: The Accidental Wilderness relays the history\nof North Dana as seen through the eyes of Warren \"Bun\" Doubleday, a descendant of the town's\noriginal residents. Doubleday speaks of the drastic changes in Dana's landscape, and supports\nhis story with pictures of the demolition of the Swift River Valley. J.R. Greene's Strange Tales\nof Old Quabbin relay \"true stories of unusual lives and incidents in the towns of the old Swift\nRiver Valley.\" It is a collection full of old legends and folklore from the surrounding area.\nFurther, Historic Quabbin Hikes, written by J.R. Greene, not only serves as a \"basic\nguide to several historic sections of the reservation,\" but also divulges information on local\nhistory. Chapter 1, entitled \"About the Lost Towns,\" provides town histories dating back to the\n1700's, and gives an overview of the towns from beginning to end. Pages 67-111 describe\nhiking trails that wind through the former town of Dana. Interspersed between Greene's hiking\nadvice and suggestions is an abundance of information on Dana. While describing the trails, he\nalso tells of the remnants of former Dana, such as cellarholes and waterlines, and relays the\n\nstories behind these artifacts. If one is willing to wade through the surrounding text, this source\nproves to be an extremely valuable resource.\nSeveral other sources tell the stories of the Swift River Valley residents through pictures.\nThough the \"WestfordComp\" website is a personal home page, it has a wealth of information on\nthe Quabbin Reservoir. Containing a multitude of pictures from both the past and present\nQuabbin Reservoir, the site also has individual pages devoted to each of the four lost Quabbin\ntowns. Each page has a brief history of the town, as well as pictures of the towns, landscapes,\nand residents. Further, this page provides an excellent series of time-lapsed photos of the\nQuabbin Reservoir, dating from 1927, 1939, and 1989.\nThe Lost Towns of the Quabbin Valley, a photo documentary by Elizabeth Peirce,\nprovides 128 pages of photographs from the Swift Valley Region. Through her photos, Peirce\nclearly expresses her compassion for the towns and families that suffered from the creation of the\nQuabbin Reservoir. She solicits sympathy from her reader by arranging photographs from every\npossible facet of life. Through distinct chapters devoted to each town, the book shows the\nbuildings, lands, factories, and businesses of the Quabbin Valley. Pictures of shops, parks,\nschoolchildren, and families, among many other subjects, are included in this comprehensive\nphoto documentary.\nFor information on the legislative decisions which led up to the creation of the Quabbin\nReservoir, Fern L. Nesson's Great Waters: A History of Boston's Water Supply should be\nconsulted. Chapter 3 of this book focuses on the Quabbin Reservoir, and pages 46-52\nspecifically discuss the Goodnough proceedings. These pages follow the House and Senate\nWater Supply Committee meetings, the public town hearings in Enfield and Ware, and also\nMassachusetts' legislative decisions.\n\nJ.R. Greene's The Creation of the Quabbin Reservoir: The Death of the Swift River\nValley also touches upon the legislative actions of the state. Pages 79-84 discuss the legislative\nproceedings which forced residents to leave their homes, and specifically focuses on how the\nresidents were asked to move. This book is \"intended as a study of the events that led to the\ncreation of the Quabbin Reservoir,\" but also discusses the four towns in relation to the Quabbin.\nIn \"Part IV: Construction, Chapter 3: Exodus,\" Greene tells of the \"erosions of the old way of\nlife.\" He mentions how, in the towns' final stage, businesses declined, homes were sold, and\ncemeteries were uprooted. Continuing this in \"Part IV: Construction, Chapter 5: Four Towns\nCease to Exist,\" Greene mentions Enfield's last Ball, the slow demise of the towns, and the\nexodus from the Swift River Valley.\nFor further facts and figures on Dana, Enfield, Prescott, and Greenwich, one can consult a\nnumber of different books. Quabbin Facts and Figures, distributed by the Friends of the\nQuabbin, is a booklet of hard facts and figures on the Quabbin Reservoir. Specifically, the\nbooklet gives the population of each of the four towns, the date of the towns' last town meetings\nand legislation passed by town government. Further, it includes a time-lapsed photo of Enfield,\ntracking the town from its beginning to its end.\nSimilarly, An Atlas of the Quabbin Valley: Past and Present, written by J.R. Greene,\nprovides specific information on each town. Pages 6-17 provide the following data for Dana,\nEnfield, Prescott, and Greenwich: history, area of the land, post offices, local geography,\nchurches, industry, war heroes, and population data. Further, two maps of each town are\nincluded, one dating from 1850 and the other from 1900. There are also two relevant maps,\nentitled \"Boundary Changes of the Towns\" and \"What the Reservoir Covered.\" For those more\ntechnologically inclined, the \"Friends of the Quabbin\" website appears to contain the same\n\ninformation. Further, the website provides an extensive chronology, ranging from 1901-1950,\nthat contains pertinent information on the towns.\nMore information on the Quabbin Reservoir is available. An extremely comprehensive\nlist of works can be found in J.R. Greene's A Bibliography of Quabbin Valley History. This\nbooklet is a general bibliography of all works related to the Quabbin Reservoir. Specifically the\nsections entitles \"General Books and Pamphlets,\" \"Relevant Histories of Adjacent Towns,\"\n\"Annual Town Reports,\" and \"Town Records and Genealogical Data\" provide specific\ninformation on the four lost Quabbin towns.\nMoreover, any additional information can be obtained from the Swift River Valley\nHistorical Society, located in Salem, Massachusetts. The society strives to keep \"the memories\nof the towns... alive\" through their collection of historical items.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_varillybib2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/a48b81d27d91f4935d74e017f7c48bcb_MIT21H_421S11_varillybib2.pdf",
      "content": "21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nPaper 2: Bibliographical Essay\nThe Quabbin Reservoir: Pro and Con\nThe Quabbin Reservoir is one of the largest man-made bodies of water in the\nworld, located Western Massachusetts. Its creation can be traced back to 1922, although\nonly until 1927 does the Swift River Act legally establish it. In 1936, after cleanups of\nthe area, legal disputes and the disintegration of the four local towns, Enfield, Greenwich,\nDana and Prescott, construction on the project began. The water of the Swift River first\nbegan to flood the area in late 1939, and by 1946, the reservoir was filled.\nAs a primer on the region, two sources stand out. Thomas Conuel's Quabbin: The\nAccidental Wilderness provides a quick and apparently unbiased account of the water\nbody's creation in the first chapter, as well as a summarized history of the Swift River\nValley in the 19th century in chapter 2. It also features many photographs of the town\nbefore and after the reservoir. Quabbin Facts and Figures by Friends of Quabbin, Inc\nand the Metropolitan District Commission (M.D.C.) includes a concise chronology of the\nevents leading to the creation of the reservoir, and detailed statistics on the cost and\nperformance of the water supply. In also includes a striking three-picture comparison,\nfeaturing the exact same panorama in 1927, 1939 and 1987, which first shows a small\nrural town, then a meticulously razed terrain, then a calm lake vista.\nAs for argumentation material, there are many ways of addressing the issue of pro\nand con. We can trace the history of the exploitation of water resources that eventually\nlead to the inundation of the Quabbin area, and for that purpose, Nesson's Great Waters:\nA History of Boston's Water Supply is essential reading. Firstly, it contains a clear map\nof the water resources Boston and the surrounding areas depend on. The body of the text\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nis concerned with the westward expansion of the water supply. Of particular interest are\nchapters 3 (Quabbin) and 4 (Water and Social Engineering), pgs. 36-86. The first one\nexamines the legal process by which Quabbin was chosen as a reservoir site, as proposed\nby Goodnough, and discusses the alternative proposals by Hazen and Freeman. Nesson's\nessential thesis is that the main factor in selecting Quabbin was opposition for filtration of\nalternative sources. The book also has useful biographies of the main personalities\nbehind the engineering effort. Almost uniquely, this book phrases the Quabbin issue\nexclusively in a political framework, and discusses it mainly from the point of view of\nBoston citizens, paying sporadic homage to the protests of the Quabbin towns.\nJ. R. Greene, in The Creation of Quabbin Reservoir: The Death of the Swift River\nValley, provides a similar exposition, though in more detailed and with less\noversimplification. The important segment of the book is Part III: The Water Fight, pgs\n25--57. In them, Greene works through the proposals that suggested the creation of the\nQuabbin in 1922, and the resulting political unrest. The source is essential for\nunderstanding the popular psyche at the time. It also has background information on the\ncontemporary political arena. One recurring theme in Greene's work is people suing the\nstate for unjust compensation, instances of which are not hard to come by. Relevant\ncourt cases include Albert E. Beaman v. Commonwealth (unfair exclusion in\nindemnification, rejected), Franklin A. Snow Company vs. Commonwealth (contractor\ndefrauded by Commonwealth, damages awarded) and The Arthur A. Johnson\nCorporation vs. Commonwealth (misrepresentation of facts by Commonwealth, rejected).\nGreene has also authored other important works on the Quabbin reservoir. His\ncompilation, A Bibliography of Quabbin Valley History, stands as the definitive guide to\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nthe primary sources.\nConcretely, pages 19--22 list the relevant Massachusetts\nlegislation, from the Goodnough report of January 1922, to the Ware River Act of 1926\nand the Swift River Act of 1927, as well as the intervening legal debates. Pages 29--38\nenumerates a wealth of technical publications on the subject, many by the original\nproponents of the projects; though comprehensive, these sources are hard to obtain due to\ntheir age and, sometimes, obscurity of the journals.\nGreene's The Day Four Quabbin Towns Died is useful in reconstructing the\nemotional sensitivities of the Quabbin community around the time of the oft-mentioned\nEnfield ball of April 27, 1938, but is otherwise of little value when examining the pros\nand cons of Quabbin's construction in a larger context. Nonetheless, Appendix I in pages\n77--83 includes the full text of the disincorporation law that removed Dana, Enfield,\nGreenwich and Prescott from the map.\nHis An Atlas of the Quabbin and Ware River Diversion provides a quick reference\nof useful facts about the local populations (including town sizes, listed every 10 years\nfrom 1810 to 1940). More importantly, though, it clearly demarcates Greene's position\non the issue: he calls the reservoir \"a prime example of the policy of the state government\nto view Western Massachusetts as a place to exploit for the advantage of the Boston\narea.\" It is thus evident Greene is against the creation of the reservoir.\nAn interesting contrast to Greene's people-centric accounts is glimpsed at by\nlooking at a New York Times article, \"Big Reservoir Dam Begun in Bay State,\" 23 May,\n1937. It emphasizes the engineering technicalities of the project, while barely noting the\ndisappearance of the valley's towns. It's symbolic of urban views on Quabbin.\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nThese works are primarily concerned with contemporary views of the reservoir.\nMost other sources focus on its long-term effect, particularly its present important as a\nwilderness sanctuary. Conuel's Quabbin: The Accidental Wilderness is chief among the\nsources outlining this point of view. He describes the Quabbin bald eagle conservation\nproject, the establishment of recreational fishing (both in chapter 3), the presence of rare\nfauna like mountain lions and coyotes, and the forest management projects underway by\nthe M.D.C. (chapter 4). It also has many wildlife photographs by Jack Swedberg, the\nhead of the bald eagle project. The New York Times feature \"Wood, Field and Stream\"\nrepeatedly reports on excellent fishing experiences at Quabbin, emphasizing its\nrecreational use: \"Quabbin\", by Nelson Bryant, 11 Jun 1967 and \"Quabbin a Happy\nHunting, Fishing Area for Massachusetts Sportsmen\" by John W. Randolph, 5 Jun 1956,\nare representative selections. Also in the New York Times, \"Symbol of Wilds' Return\nFlies in Massachusetts,\" by Anne Driscoll, 21 Aug 1988, reports on the bald eagle\nconservation project. \"Reservoir Spills Over Into Recreation Field\", published 11 Jun\n1967, discusses the opening up of Quabbin to hikers, travelers and fishermen; it\nemphasizes the beauty of the wilderness. The Worcester Telegram and Gazette ran\n\"Quabbin Strengths, Problems Outlined\" on 26 Aug 1997, a more extensive review of\nfishing and wildlife preservation at the reservoir. It also talks about opposition to recent\nproposals to expand the use of the reservoir and the filtration of other water sources.\nOther newspaper articles have reflections of former residents. In general, the lack\nof specificity makes these sources less valuable, but they give a general sense of local\nperceptions. \"A Half Century of Nostalgia for 4 Submerged Towns\" in the New York\nTimes of 27 Dec 1987 reports on a ball to be in 1988 to commemorate the 50 years since\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nthe Enfield ball, and local reaction to both events. \"Resident Recalls drowned villages\"\nby Lori Stabile, in The Republican, 27 Oct 2003, and \"Ex-residents recall sacrifice to\nQuabbin\" in the Boston Herald, 16 July 2000, offer more local testimony of the events.\nStill other articles try to refresh the conflict spawned by Quabbin. \"Recalling the\ntowns drowned for Boston\" in the Boston Globe, 29 Nov 1992, is one example. Former\nresidents characterize Quabbin as a symbol of Boston \"taking what it wants\", and the\narticle notes the towns near Quabbin have no access to its water.\nOther sources offer more first-hand accounts. David Howe's Quabbin: The Lost\nValley is regularly cited as an extensive (650+ pages) compilation of local testimonies\nand reactions to the reservoir; however, I was unable to obtain it myself in time for this\nessay (it is available at the Boston Public Library, Boston College Library and Harvard,\namong others). The Friends of Quabbin Inc. website (www.foquabbin.org) features\nmodern-day reflections. The archive of newsletters of the organization, published 2-4\ntimes a year and going back to May 2001, is very useful. It exhibits resentment by many\nof the displaced Quabbin natives and their descendents. For example, the Oct 2003\nnewsletter reads \"The people of the Valley did not give up their homes to provide a\nplayground for pleasure seekers.\" The editorial on Dec 2002 shows bitterness for what is\nlong gone. J. R. Greene appears regularly in the newsletter.\nOverall, arguments for and against Quabbin can be divided into two categories:\nthose dealing with its creation, and the urban-rural conflict that emerged and still lingers\ntoday, and those about its current ecological importance as a wildlife sanctuary. This\nessay has sketched out the sources that would be most useful in pursuing these lines of\nargument further.\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nAnnotated Bibliography\n[1]\nBisbee, Dana, Ex-residents recall sacrifice to Quabbin, Boston Herald, 16 July\n2000, p. 16. Quick overview of Quabbin facts and first-hand account of displaced\nresidents. Describes a former Enfielder returning to the site of his house (still\noverwater), 70 years after he left.\n[2]\nBryant, Nelson, Wood, Field and Stream: Quabbin, New York Times, 11 Jun\n1967, pg. 215. Describes fishing opportunities in Quabbin.\n[3]\nConuel, Thomas, Quabbin: The Accidental Wilderness, U. Mass Press, Amherst,\n1981. Contains a brief historical outline of pre-Quabbin Swift River Valley towns,\nand the creation of the reservoir. Focuses on wildlife enhancement and\npreservation projects (bald eagle, mountain lion, coyote), as well as touristical\ndevelopment of the area (hiking, fishing). Also contains arguments about future\nexpansion of Quabbin and creation of other reservoirs. Includes photographs of\nthe area before and after the reservoir was built, and photos of wildlife.\n[4]\nDriscoll, Anne, Symbol of Wilds' Return Flies in Massachusetts, New York\nTimes, 21 Aug 1988, p.43. Reports on the bald eagle conservation project. A\nformer resident is quoted as deriving satisfaction from this.\n[5]\nFriends of Quabbin Inc. website (www.foquabbin.org), accessed 14 Mar 2004.\nIncludes short historical notes and, most importantly, archive of newsletters of the\norganization, published 2-4 times a year and going back to May 2001.\n[6]\nFriends of Quabbin, Inc and the Metropolitan District Commission, Division of\nWatershed Management, Quabbin Section, Quabbin Facts and Figures, Hamilton\nI. Newell, Inc., Amherst, 1996. Includes chronology of the events in the area,\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\ndetailed statistics on cost and performance of reservoir and engineering\nmeasurements. Includes a three-picture comparison of one selected area before\n(1927), during (1939) and after (1987) the reservoir's construction (this picture\nseries is reproduced elsewhere, including the Friends of Quabbin, Inc. website).\n[7]\nGaines, Judith, Recalling the towns drowned for Boston, Boston Globe, 29 Nov\n1992, p.73. Mentions benefits of beauty and wildlife, but emphasizes bitterness\nof former residents. Resident quoted as characterizing Quabbin as a symbol of\nBoston \"taking what it wants\". Notes none of the neighbouring Quabbin towns\ncan access water. Brief description of 4 submerged towns.\n[8]\nGreene, J. R., An Atlas of the Quabbin and Ware River Diversion, J & P Printing\nCo., Athol, 1996. Contains an introduction to the valley's history, plus a quick\nsurvey of the events 1920-1940. Features single-page overviews of each town\ndestroyed, maps and population statistics (listed every 10 years, 1810-1940).\n[9]\nGreene, J. R., A Bibliography of Quabbin Valley History, Transcript Press, Athol,\n1992. Comprehensive guide to primary and secondary sources on Quabbin, of\nvarying utility. Pages 19--22 list the relevant Massachusetts legislation. Pages\n29--38 technical publications on the subject, many by the original proponents of\nthe projects.\n[10]\nGreene, J. R., The Creation of Quabbin Reservoir: The Death of the Swift River\nValley, Performance Press, Athol, 1981. Provides a chronological account of\nwater resource exploitation of Boston, leading up to creating of Quabbin, and\ndiscusses its effects. Part III: The Water Fight, pgs 25--57, is very useful.\nDescribes political background to the Quabbin legislation and wades through\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\nmany of the legal debates (in particular, contains details on indemnification suits,\nas opposed to Nesson). Contains biographies of political personalities and maps\nof the area.\n[11]\nGreene, J. R., The Day Four Quabbin Towns Died, Transcript Press, Athol, 1985.\nDescribes setting on the days prior and following the Enfield ball of April 27,\n1938 (last social event before the disincorporation of towns). Includes wealth of\ndetails on contemporary events, town meetings and population rosters. Appendix\nI in pages 77--83 includes the full text of the disincorporation law.\n[12]\nMiner, Bradford L., Quabbin Strengths, Problems Outlined, Worcester Telegram\nand Gazette, 26 Aug 1997, p. B6. Reviews fishing and wildlife preservation at the\nreservoir. Mentions tourism as a benefit to the area. Talks about opposition to\nfiltration as a means to expand water resources.\n[13]\nNesson, Fern N., Great Waters: A History of Boston's Water Supply, University\nPress of New England, Hanover & London, 1983. Features a clear map of the\nwater resources feeding the Greater Boston Area. The body of the text is\nconcerned with the westward expansion of the water supply. Relevant sections\ninclude chapter 3 (Quabbin) and 4 (Water and Social Engineering), pgs. 36-86.\nDiscusses legal debates surrounding creation of Quabbin: more succinct than\nGreene, but focuses mostly of Boston side and engineering aspects. Also\ndiscusses suit by Connecticut on Massachusetts for impounding a tributary to the\nConnecticut River. Importantly, Chapter 4 argues why Quabbin was established.\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\n[14]\nRandolph, John W., Wood, Field and Stream: Quabbin a Happy Hunting, Fishing\nArea for Massachusetts Sportsmen, New York Times, 5 Jun 1956, p.42. Details\nQuabbin fishing opportunities.\n[15]\nStabile, Lori, Resident Recalls drowned villages, The Republican, 27 Oct 2003, p.\nB01. Eyewitness testimony, 70 years after the fact.\n[16]\nStaff, A Half Century of Nostalgia for 4 Submerged Towns, New York Times, 27\nDec 1987, p. 43. Reports on a ball held April 27, 1988 to commemorate the 50\nyears since the Enfield ball, and local reaction to both events. Quotes displaced\nresidents remembering old towns.\n[17]\nStaff, Big Reservoir Dam Begun in Bay State, New York Times, 23 May, 1937,\np.37. Emphasizes the engineering technicalities of the project.\n[18]\nStaff, Reservoir Spills Over Into Recreation Field, New York Times, 11 Jun 1967,\np. 450. Discusses the opening up of Quabbin to hikers, travelers and fishermen; it\nemphasizes the beauty of the wilderness. Talks about the economy of the towns\nbefore the reservoir.\n[19]\nSupreme Judicial Court of Massachussets, Albert E. Beaman v. Commonwealth,\nLewis R. Lindsey v. Same (argued 25 Sep and 4 Oct 1939, decided 29 Nov 1939).\n304 Mass. 443; 24 N.E.2d 7; 1939. Mr. Beaman, a carpenter, claims he should be\nproperly remunerated for the loss of all his Quabbin customers, and hence the ruin\nof his business, despite his residence in adjacent Barre. The court rejects the\nappeal, arguing law clearly states businesses must be \"on land\" to be remunerated,\nand Mr. Beaman does not live and doesn't have material possessions in Quabbin.\n-\n\n21H.421 - Intro to Environmental History\nPatrick Varilly\n16 Mar 2004\n[20]\nSupreme Judicial Court of Massachussets, Franklin A. Snow Company v.\nCommonwealth (argued 15 and 16 Nov 1938, decided 7 Jul 1939). 303 Mass.\n511; 22 N.E.2d 599; 1939. The contractor complains that the Commonwealth\noffered it use of a quarry it didn't own, and as a result of having to pursue another\nsource of rocks incurred in $136,000 of additional costs. Court awards damages\nof $7,500.\n[21]\nSupreme Judicial Court of Massachussets, The Arthur A. Johnson Corporation v.\nCommonwealth (argued 13 May 1940, decided 25 Jun 1940). 306 Mass. 347; 28\nN.E.2d 465; 1940. The contractor complains the Commonwealth didn't respect\nan implied warranty on the quality of the soil in hills the corporation was working\non, and seeks damages. Court reject contractor's argument.\n-\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_Carney_Ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/aaabef3186568984c5d7bb6f7c54d44d_MIT21H_421S11_Carney_Ques.pdf",
      "content": "Things to think about:\nJ\n\nudith A. Carney, \"African Ri\n\nce in the Columbian Exchange,\" Journal of African\nHistory 42 (2001): 377-396.\nW\ndo\nh\nme\nat\ns\nw\nti\ne\nc\nr\na\ne\nt\n\ne\ns\ns\no\n,\nme\nacc\nh\no\ni\nr\ns\nd\nt\ni\no\nn\nr\ng\nic\nt\na\no\nl\n\nC\np\na\nre\nrn\ncu\ney\nrs\n?\no\n\nrs to the transatlantic exchange of plant\nWhat is significant about the multiple origins of rice cultivation within West Africa?\nWh\na\nan\ng\nd\nat r\nAfr\no\nic\nle\na\ndi\nricultu\nn\nd p\nral\nf\ns\no\ny\no\ns\nd\nro\nte\ns\nv\ny\ni\ns\ns\nt\ni\ne\no\nms\nnin\nt\ng\no\ns\nt\nla\nh\nv\ne\ne\nN\ns\ne\nh\nw\nips play in bringing African plant\nms in West Africa?\nWorld? What role did they play\nd\nin\no\n\nme\nres\ns\nh\nt\na\nic\np\na\nin\nte\ng\ns\n\nW\nfoo\nh\nd\ny\ns\nd\no\nid\nf\n\nAf\nEu\nr\nr\nic\no\na\np\nn\ne\n\na\no\nn\nri\n\ng\nsl\ni\na\nn\nv\no\ne\nn\nrs\nt\n\nh\nfe\ne\ne\nM\nl i\ni\nt\nd\nw\nd\na\nle\ns\n\nP\nimp\nass\no\na\nr\ng\nt\ne\na\n?\nn\n\nt to feed their human cargoes with\nW\nec\nh\non\nat\no\nr\nmy\nole\ni\n\nn\nd\n\ni\nt\nd\nh\n\ne\nAf\nC\nr\na\nic\nr\na\no\nn\nli\n\nn\nsp\nas\ne\n?\nc\n\nies of rice play in the establishment of the plantation\nH\nCa\no\nrol\nw d\nin\nid\nas?\nAf\nHow\nrican\nwould\ntechno\nyou connect this\nlogies of rice pro\nto McN\nduction\neill's\nresh\nar\nap\nticle about the r\ne the landscape of the\nmosquitoes in the Revolutionary War?\nole of\nW\nAf\nh\nri\ny\nc\n\na\nw\nn\na\ns\ns\np\nr\ne\ni\nc\nc\ni\ne\ne\no\ns?\nf\n\nAsian origin ultimately favored in the plantation economy over\nWhat is the connection between rice, environment and disease in Carney's article?\nW\nlife\nh\nto\nere\nd\n\nay\nca\n?\nn\n\nyou find evidence of the role of African plant domesticates in American\nWh\nto th\nat r\ne N\no\ne\nle\nw Wo\ndid su\nrld\nb\n?\nsist\n\nence farming play in the transfer of African plant domesticates\nW\npla\nh\nn\ny\nt\ni\na\ns\nt\n\ni\ni\no\nt\nn\nimp\neco\no\nn\nrt\no\na\nmi\nnt\ne\nf\ns\no\n\nr\no\n\nf\nC\nt\na\nh\nr\ne\nn\n\ne\nN\ny\ne\nt\nw\no\n\nW\nsh\no\no\nr\nw\nld\nt\no\nh\nr\na\ni\nt\ng\nr\nin\nic\na\ne\nt\n\ne\nte\nd\nc\ni\nh\nn\nn\nAf\nolo\nri\ng\nc\ni\na\ne\n?\ns\n\nemployed in the\nW\nto\nh\nth\nat\ne\n\nk\nN\nin\new\nds\nW\nof\no\ne\nr\nv\nld\nid\nw\nen\ne\nc\nre\ne\n\nAf\ndo\nr\ne\ni\ns\nc\n\na\nC\nn\na\n\nr\nin\nn\n\ne\no\ny\nr\n\ni\nu\ng\ns\nin\ne\n?\nt\n\no argue that the first rice species imported\nHow\nAfric\n\na\ndoes\nn pla\nCa\nnt\nrn\ndo\ney\nme\naccou\nstica\nn\nte\nt\ns\nfor\nand\nthe\nag\nb\nri\nia\ncu\ns\nl\nin\ntu\n\nr\nhist\nal t\norica\nechno\nl schol\nlogies\na\n\nrship\nin the\n\na\nC\ng\no\na\nl\nin\numb\nst t\ni\nhe\nan\nrole of\nExchange?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_CARSON_ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/cd229ffc6ac62d2a45e164b9db798f54_MIT21H_421S11_CARSON_ques.pdf",
      "content": "Things to think about: Silent Spring\nWhat is the function of the brief \"fable\" with which Carson\nbegins?\nWhat does Carson think of the \"goal of the conquest of nature\"\n(85)?\nWhom does Carson mean when she refers to \"the citizen\"? Whom\ndoes she not mean?\nWhat was the role of science in the destructive pesticide\nprograms of the 1950s? Why were different groups of scientists\nat odds with each other over this issue?\nSometimes Carson seems to suggest something like a conspiracy\ntheory. Who were the conspirators and what were their motives?\nIs this theory persuasive?\nHow does Carson explain the official preference for heavy\npesticide use over other methods of insect control?\nWhy does she repeatedly mention the small amount of money\navailable for certain kinds of research?\nWhat alternatives to pesticides does Carson propose for insect\ncontrol? What kind of evidence does she use to support her\narguments that these alternatives are equally or more effective?\nCarson tells many individual pesticide stories that all have the\nsame moral. What is it?\nWhat does Carson suggest about the actual and appropriate role\nof expert advice in governmental policy making?\nWhat explains the behavior of the federal Department of\nAgriculture in many of the episodes Carson describes? Why did\nit persist in insect eradication programs requiring massive\npesticide applications after many such programs had proved\nineffective? Why did it resist that pesticide applications\ncaused widespread poisoning?\nWould you consider Carson's position with respect to pesticide\nuse to be moderate or radical? What arguments can be made for\neach characterization?\nWhat is the effect of Carson's recurrent metaphorical connection\n\nof the effect of pesticides to that of the atomic bomb and other\ninstruments of war?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_cook2_ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/fc93fc21e012a91b5815045d559839fd_MIT21H_421S11_cook2_ques.pdf",
      "content": "Things to think about: The Journals of Captain Cook\nWhy did trade with the various indigenous peoples that Cook encounters seem to happen so\nautormatically? How would you interpret Cook's judgment of the people he encounters as honest\nor dishonest (inclined to steal)? How does he interpret this?\nWhat is the reason for the rules that Cook promulgates on 39-40?\nWhy did Cook give Tahitians names from classical mythology and history (41)? In general how\nwould you characterize his selection of names for places, people, and things--and also his\nselection of items in need of naming?\nHow did Cook deal with the fact that death (accidental or otherwise) was a constant possibility in\ndealings with the peoples he encounters?\nWhat astronomical observation and phenomena did Cook record? Did he treat them in a different\nway than other observations (botanical, zoological,.geological, anthropological)?\nWhy is the loss of the quadrant so serious (49)?\nOn what basis did Cook attempt to derive the theology of Pacific peoples? (see, for example, his\ndiscussion of the treatment of Tahitian corpses on 47 and of the Easter Island statues on 338.)\nWhy did he recount the incident at the bottom of 52/top of 53?\nWhy was Cook concerned about the spread of venereal disease in Tahiti and Hawaii?\nWhat was Cook's attitude to dog-eating (59)? Cannibalism (383)? Eating strange food in general\n(e.g. 378)?\nWhy did Cook make observations about the actual or potential productivity of the land in the\nplaces he visits?\nWhat is the animal referred to on 126, 145, 146, 150, 153, 154 ? What do these repeated\nobservations suggest about the theories and methods of 18th-century naturalists?\nHow did Cook deal with conflicts between his own observations and the theories of learned\n\"philosophers\"? (e.g. 389)\nWhat do the misfortunes of Orton (131-2) suggest about shipboard morale and discipline?\nWhat did Cook mean by \"nature\" with reference to the dress of female Australians (153)?\nHow did Cook characterize the native people of Australia, in comparison with the others he had\nencountered in the Pacific?\nWhat does Cook's identification of Easter Island (335) suggest about the nature of European\n\"discovery\"?\nWhy did Cook think that Pacific islanders were mistaken to view his crews as \"invaders\"? (386)\n\nWhen Cook identified the Tahitians and Hawaiians as belonging to the same nation, what did he\nmean?(530, 537)\nWhat are the implications of the set of gifts mentioned on 535-6?\nWhy were the Nootka people so outstandingly successful in their transactions with Cook and his\nparty?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_crononques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/c47ae8e680654b7153ab180b3ca58db3_MIT21H_421S11_crononques.pdf",
      "content": "Things to think about: William Cronon, Changes in the Land\nWhat does Cronon see as the agendas, sources, and difficulties of environmental history?\nWhat value did Thoreau attach to \"wildness\" in landscape? How did he define\n\"wildness\"? How did his valuation and definition differ from those of the earliest English\nsettlers of New England?\nWhy does Cronon warn against the \"post hoc ergo propter hoc\" fallacy on page 9?\nWhat does Cronon mean by human communities that are \"inside nature\" on page 15?\nWhat were the consequences of the tendency of early English explorers and settlers to\nperceive the New England landscape in terms of marketable commodities?\nIn what sense did the English settlers consider the Indians as beggars living in the rich\nNew England landscape? What were the environmental implication of English and Indian\nnotions of wealth and poverty?\nHow did the Indians of southern and northern New England differ in their relationship to\nthe environment?\nWhat (if any) connection existed between the repeated forest burning of the southern\nNew England Indians and the maintenance of a \"natural\" ecosystem?\nWhy were English fixed settlements incompatible with Indian migratory settlements?\nHow was this concrete incompatibility reflected on the abstract level of legal theory?\nHow did English and Indian ideas about the ownership of land reflect distinctive\nrelationships to the environment?\nWhat was the impact of shifting power relations among New England Indian groups (the\nresult of depopulation following the introduction of European diseases) on wild animal\npopulations?\nHow did the disappearance of the New England beaver population aid English\nagricultural settlement?\nWhat were the ecological and economic effects of the English settlers' profligate clearing\nof the New England forests?\nWhat is the difference between \"deforestation\" and \"the progress of cultivation\" on page\n126? Whose point of view is expressed by each term?\n\nWhat was the relation between livestock husbandry and colonial patterns of land use?\nBetween livestock husbandry and changing distribution frequencies of wild plant\nspecies?\nWhy does Cronon worry about providing an analysis that is too \"unicausal\" on page 161?\nTo what extent were the Indians agents as well as victims of the changes Cronon\ndescribes?\nWhat is the difference between \"yield\" and \"loot\" to which Cronon alludes on the last\npage?\nCronon's study of ecological transformation in New England has several main foci: fur-\nbearing animals, forests, the introduction of domestic and especially grazing animals, and\nthe consequences of European notions of property and commodity. How did each of these\nfigure in this transformation? Can you think of any other foci that Cronon might have\nconsidered?\nIn what ways might an ecological history of New England be extended further?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_defoeques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/0b1c31e012c05442064039c62042f4b6_MIT21H_421S11_defoeques.pdf",
      "content": "Things to thing about: Defoe, Journal of the Plague Year\n(pages refer to Norton Critical Edition)\nHow does a comparison of his description of the epidemic compare with the selections from\nth\nhis sources? The Bills of mortality? The early 17 century orders? (Then the orders\npromulgated in anticipation of a new visitation)\nHow would you compare Journal of the Plague Year with the excerpts of Defoe's newspaper\nreporting on the plague in continental Europe in 1721?\nWhy do you think he chose to present this experience in a first person narrative rather than a\nthird person narrative?\nWhat is the narrator--the \"I\"--like? How do you know?\nTo what extent does the evidentiary value of Defoe's narrative depend on him having been an\neye witness? To what extent does its persuasiveness depend on H.F.'s claim to have been an\neyewitness?\nWhat was it like to experience to London plague of 1665?\nWhat did you think of HF's deliberations about whether to go or to stay? (P. 11 ff.)\nIs it appropriate to make moral judgments about people's responses to a spreading epidemic?\nWhat does HF think about the policy of confining all residents of households in which there\nhad been a single case of plague?\nPeople sneaking away and abandoning dead or dying servants? (45-47)\nDiscussion of core moral issue of duty to community vs. duty to self? (48-9)\n\"Innocent corruption\" of watchmen? (51)\nWhat would it have been like to be one of the watchmen hired to make sure that infected\nfamilies were confined to their houses?\nIf you had been a policy maker during the epidemic that Defoe described, what would you\nhave done? Why would you have enforced a policy that apparently didn't work, and might\neven have led to the spread of the plague?\nWhy does he think that shutting up houses was bound to fail? (61-62)\nWhat do you think of his three practical recommendations in case of future epidemics? (63\n64)\nHow did London society respond to this catastrophe? How did the social fabric hold\ntogether? Were there any signs of social crisis?\nWhat are the implications of comparing the plague to a fire? (see 34-also Hodge 213)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_ENGELS2_ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/6d78608491b4f4a4f43e974af573be23_MIT21H_421S11_ENGELS2_ques.pdf",
      "content": "Things to think about: Engels, Condition of the Working Class\nHow does Engels connect the social conflict evident in London\n(and other great English cities) with the \"marvels of\ncivilisation\" with which it is surrounded (36)? How, if at all,\ndoes Engels' characterization of large cities apply to those you\nare familiar with?\nIn Engels' view, what obligation does society have to each of\nits members? Why and how did English industrial society of the\nmid-19th century fail to fulfill that obligation?\nWhat are the implications of Engels' repeated use of language\nthat ordinarily refers to domesticated or wild animals to\ndescribe members of the urban working classes?\nWhat is the effect of Engels' extremely specific and detailed\ndescriptions? of his constant references to smell as well as\nsight?\nWhy does Engels emphasize the absence of security in the lives\nof industrial workers?\nOn the basis of Engels' account, were homeless people in the\nVictorian period better or worse off than they are now?\nHow does Engels reveal the intensity of his feelings about the\nconditions he describes?\nWhat are the likely public health consequences of slum life as\nEngels describes it? the likely \"moral\" consequences?\nEngels quotes many authoritative surveys of working class life\nin various cities. Do these authorities agree in their\nassessments? What might have motivated so many efforts of this\nkind?\nWhat makes Manchester the \"classic type of a modern\nmanufacturing town\" (54)?\nWhat does Engels mean by a well-planned town? Why does he\nprefer new buildings to old ones?\nIs Engels characterization of the Manchester city plan as\n\"hypocritical\" on p. 59 justified?\nHow and why does Engels emphasize the contact between workers\n\nand animals (or animal products)?\nEngels is obviously sympathetic to the workers whose plight he\ndescribes. Is this consistent with his repeated suggestions\nthat they are not quite civilized?\nHow would you explain Engels' distinction between English and\nIrish workers?\nWhat, according to Engels, are the factors that made working\nclass consciousness and class tensions more acute in the period\nwhen he was writing?\nOn what basis does Engels accuse English society of murdering\nits industrial workers?\nTemperance activism was widespread in 19th-century Britain and\nAmerica. Would activists have agreed with Engels that for slum\nresidents \"drunkenness has ceased to be a vice\"? (114) How does\nthe alcohol abuse that Engels describe compare with modern\nissues of substance abuse?\nAre you persuaded by Engels' assertion on p. 143 that in England\nthe \"social war is already underway\"?\nWhy was the death rate among working class children so high?\nCan you detect Engels' middle-class sensibilities in his\ndescription of the sensibilities of the poor? What difference,\nif any, does it make that he was German?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_jacoby_ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/cb1ab52d81831679b1c081a1008d4107_MIT21H_421S11_jacoby_ques.pdf",
      "content": "Things to think about: Conservation and Preservation\nJacoby\nHow does Jacoby define conservation?\nHow does he use the concept of \"moral ecology\"?\nHow did conservationists at the turn of the twentieth century define their cause? What\nwere they trying to conserve?\nWhat sorts of institutional changes and social responses did the advent of conservation\nlegislation provoke?\nWhat and who has been \"hidden\" in the history of conservation, and who was hiding it\nfrom whom? What do you make of this characterization? What are the difficulties of\nresearching such obscure stories?\nAccording to Jacoby, what ideas about social order were implicit in conservation at the\nturn of the twentieth century?\nWhy did conservationists and park authorities view the people living in areas bordering\nYellowstone and Grand Canyon as a threat to the park?\nHow did local communities resist park regulations? How did locals' sense of justice\ndiffer from that of conservationists and park officials? Were the major conflicts over\ncontrol of territory or resources?\nHow and why did official response differ depending on the race, class, or ethnicity of the\nlocal community?\nWhy and how was it that Indians' \"lives were most remade by the coming of\nconservation\" (p. 151)? How does Jacoby relate this radical change to the historical\nrelationship between Indians and non-Indians (especially between Indians and the federal\ngovernment) in the US West?\nWhat animals, wild and domesticated, were involved in conflicts over conservation?\nHow did different groups of people (hunters, ecologists, park superintendents, local\nofficials, etc.), define the same species in different ways, and how might such differences\nreflect or influence relationships between people?\nWhat parallels does Jacoby suggest in the relationship between reservations for Indians\nand forest and game reserves?\nHow did ranching, industrial agriculture and the creation of national parks disrupt and\nchange customary networks of exchange among Native American tribes?\n\nWere stuffed animal heads and other dead animal parts originating from national parks\nvalued differently by different groups of people?\nHow did ideals of masculinity and \"the strenous life\" figure into debates about\nconservation?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_mancall.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/6e388679ac055f271a59ef1e29af6fa5_MIT21H_421S11_mancall.pdf",
      "content": "Things to think about: Selections in Mancall\nHakluyt\nWhat does he mean by \"planting\"?\nWhat preoccupations does the table of contents (46-49) reveal?\nCan you see any evidence of intentional ecological imperialism?\nWhat use does Hakluyt propose for the indigenous resources of North America?\nWhat kind of relations does he foresee between settlers and indigenous inhabitants?\nWhat connection does he foresee between settlements, trade, and military policy?\nWhat does he think the North American climate is like?\nAnalyze the list of things to be brought along (54-56).\nPercy\nWhat is Percy's impression of the West Indies, their people, and their products?\nWhy did he encounter wild boars and bulls in the Caribbean?\nWhat was his first impression of Virginia? How did he describe its natural resources?\nHow did he explicitly characterize its indigenous inhabitants (through direct description)? How\ndid he implicitly characterize them (through description of their culture)?\nWhat is the implication of the garden imagery that recurs throughout this selection?\nAnonymous\nHow does this description of Virginia compare with Percy's?\nHow would you summarize the argument of this selection?\nWho is the intended audience?\nSmith\nHow was the relation of the New England settlers to their new home similar to that of the\nVirginia settlers? How was it different?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_McNeill_Ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/1eeea041bf931969b4183cbc5349278d_MIT21H_421S11_McNeill_Ques.pdf",
      "content": "Things to think about:\nJ\n\n.R. McNeill, \"Revolutionary Mosquitoes of the A\n\ntlantic World: Malaria and\nIndependence in the United States of America.\"\nWhat does McNeill mean by \"historical dark matter\"? (145)\nW\nde\nh\nte\na\nr\nt\nmi\ndo\nn\ne\ni\ns\ns\n\nm?\n\"mo\n\nsquito determinism\" mean? Is it different from environmental\nCan a disease be partisan? Why or why not? (147)\nWhy was smallpox a less effective as a partisan disease than malaria was?\nH\ndescrib\now co\nes?\nnsc\n\nious were people of the differential disease environments McNeill\nWh\nallo\nat ar\nwed\ne\nmo\nso\ns\nme\nqu\n\ni\no\nto\nf\ne\nth\ns\ne\nt\n\no\nn\n\na\nsh\ntu\na\nr\np\na\ne\nl\n\np\nan\no\nd\nli\n\nt\ns\nic\no\na\nc\nl\ni\n\na\ne\nl\nv\nc\ne\ni\nn\nrc\nts\nu\n?\nms\n(1\nt\na\nn\n)\nc\n\nes that, according to McNeill,\nHow\nthe At\ncl\nla\nosel\nntic\ny\nw\ndid\norl\ndifferen\nd McNei\nt\nl\nia\nl d\nl\ne\nsu\nsc\nscep\nribe\nt\ns\nib\n?\nility to disease overlap with political beliefs in\nWh\nrevo\ny\nl\nd\nu\no\nti\ne\no\ns\nn\nM\ns,\nc\nb\nN\nu\ne\nt\ni\nn\nll\no\na\nt\nr\ni\ng\nn\nu\nS\ne\nu\nt\nr\nh\nin\nat\na\n\nm'\nmo\ns\ns\ns\nq\nl\nu\nav\nit\ne\no\n\n-\nr\nbo\nev\nr\no\nn d\nlts?\nis\n(\ne\nas\ne\n)\ns\n\nwere decisive in colonial\nT\nac\no\nc\nw\nor\nh\nd\na\nin\nt\ng\ne\n\nx\nt\nt\no\ne\nd\nn\ni\nt\nf\nd\nfe\ni\nr\nd\ne\ng\nn\ne\nt\nn\nia\ne\nl\nr\nd\na\ni\nl\ns\ns\ne\no\na\nn\nse\nb\ne\no\nn\nth\nv\n\ni\ns\nr\ni\no\nd\nn\ne\nme\ns o\nn\nf t\nt\nh\ns?\ne\n\nconflict shape their campaigns\nDo\narmy\nyo\n?\nu\n(\nt\nh\ni\nn\n)\nk\n\n\"systematic\" well describes the impact of mosquitoes on Cornwallis's\nHow do\nfa\nco\nct\nnf\nors?\nlicts\nes M\nt\ncNe l\nS\no\no\nf\ni\nci\nh\na\ni\nl\ns\nf\n\na\np\nc\ne\nl\nr\nw\nio\ne\nd\nig\n?\nh\nW\nu\na\np\ns\n\nt\nt\nh\nh\ne\ne\n\ni\ni\nr\nmp\nimp\nac\na\nt\nc\no\nt\nf\n\nmo\nthe\nr\n\ne\nmo\nor\ns\n\nq\nle\nu\ns\ni\ns\nt\n\no\nimp\nin t\no\nh\nr\ne\nta\nr\nn\ne\nt\nv\nt\noluti\ntors? Economic factors? Etc...\nhat p\no\no\nn\nl\na\nit\nr\ni\ny\nc\n\nal\nMcNeill writes that helping to \"a\nt\n\"\nh\nth\nin\ne\nk\no\no\nn\nf\nl\n\ny\no\n\nt\nh\nh\ne\ne\nlp\nr\nful thing mosquito\nd\nes\nv\n\na\nh\nn\ns\ni\na\nc\ncases where mo qu toe\nv\ne\ne\n\nt\ne\nh\nv\ne\ne\nl\nr\no\nd\nft\no\ny\ns have aide\nn\ng\nd\ne\no\n\no\nf\na\no\nl\nr\ns\n\nH\nof\no\nh\nmo\numa\nsa\nn free\nur species?\npiens.\nd\n\"\no\n(\nm\"\nma\n) C\ny\na\n\nn\nb\n\ne\ny\n\nou\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MIT21H_421S11_mcneillsweb.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-421-introduction-to-environmental-history-spring-2011/d52a5d2cd15c94e2cdb37c08bd1822b3_MIT21H_421S11_mcneillsweb.pdf",
      "content": "Things to think about:\nJ. R. McNeill and William McNeill, The Human Web: A Bird's Eye View of World History\npp. 25-40, 75-81, 108-115, 137-154, 158-178, 186-189, 200-223, 230-252, 264-267, 279-288,\n319-327\nWhy is this book subtitled \"a bird's-eye view\"? How does the subtitle relate to the metaphor of\n\"the human web\" in the main title?\nWhat is a human web? How can you tell when one has emerged? How thin to its constituent\nconnections have to become before it ceases to exist?\nWhy does the domestication of plants and animals constitute such a significant historical\nwatershed? How do the McNeill's explain the emergence of domesticated breeds?\nHow can the McNeill's tell that knowledge of plant reproduction \"was surely age old\"? (27)\nWhat motivated people to abandon the life of hunter/gatherers for the more strenuous life of\nfarmers?\nWhat was the relation between climatic change and the beginnings of agriculture? Between the\ndevelopment of agricultural societies and modes of political organization?\nWhy did storable grain have greater historical impact than other agricultural products? (109)\nHow has the expansion, tightening, and loosening of the web influenced outbreaks of contagious\ndisease?\nHow do the McNeill's explain the different historical trajectories of the Eurasian web and other\nwebs?\nWhy did medieval European merchants and bankers have greater freedom than their equivalents\nelsewhere? How do the McNeill's relate this freedom to European agricultural practices such as\nthe moldboard plow? (141)\nIn what ways could development on the Atlantic and Pacific flanks of Eurasia in the 15th century\nbe considered parallel?\nHow did technology enable European expansion? Why was globally derived information so\nuseful to Europeans, even in remote local markets?\nHow was the Atlantic slave trade related to other contemporary developments within the human\nweb?\nWhy was the impact of the Siberian fur trade so similar to that of the fur trade in northern North\nAmerica?\n\nWhat role has trade played in expanding and maintaining webs? What about military activity?\nWhy do the McNeills call Atlantic Europeans \"the Mongols of the sea\"? (178)\nWhy do the McNeills refer to the Scientific Revolution as \"so-called\"? (186) What was its\nrelation to European global outreach?\nWhy do they claim that there wasn't much change between 1450 and 1800?\nHow did sugar production unite and divide societies around the Atlantic basin? (204)\nWhat caused the growth of population between 1450 and 1800? What were the effects of the\nresulting mobility and migration?\nWhat accounted for the post-1800 rise in human numbers and economic productivity?\nWas the globalization that occurred before 1800 the same as current globalization?\nWhat is the role of fossil fuels in the McNeills' story? What were the social and environmental\neffects of plentiful supplies of energy?\nHow do the McNeill's explain British pre-eminence at the beginning of the Industrial\nRevolution? At what point did the Industrial Revolution become global? Were its impacts the\nsame everyplace?\nWhy did imperialism become cheap for European powers in the 19th century?\nWhat accounted for the varying rate of success of other countries who tried to follow the\nEuropean industrial/imperial model?\nWhy are so few individuals mentioned in this book? What effect does this absence have on its\nvision of human history?\nWhy are the McNeills confident that the human population growth of the last two centuries will\nnot be repeated?\nHow is urbanization connected with fertility rates?\nHow do the McNeills approach global warming?\nAt the end of the book each McNeill writes his own conclusion. Are there any differences\nbetween their views of history? Do they use the comparison of human history to biological\nevolution in the same way? Are they equally optimistic or pessimistic?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.421 Introduction to Environmental History\nSpring 2011\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}