{
  "course_name": "Introduction to Environmental Policy and Planning",
  "course_description": "This course focuses on national environmental and energy policy-making; environmental ethics; the techniques of environmental analysis; and strategies for collaborative environmental decision-making. The primary objective of the course is to help students formulate a personal theory of environmental planning practice. The course is taught comparatively, with constant references to examples from around the world. It is required of all graduate students pursuing an environmental policy and planning specialization in the Department of Urban Studies and Planning at MIT.\nThis course is the first subject in the Environmental Policy and Planning sequence. It reviews philosophical debates including growth vs. deep ecology, “command-and-control” vs. market-oriented approaches to regulation, and the importance of expertise vs. indigenous knowledge. Emphasis is placed on environmental planning techniques and strategies. Related topics include the management of sustainability, the politics of ecosystem management, environmental governance and the changing role of civil society, ecological economics, integrated assessment (combining environmental impact assessment (EIA) and risk assessment), joint fact finding in science-intensive policy disputes, environmental justice in poor communities of color, and environmental dispute resolution. Environmental Problem-Solving (Susskind et al., 2017, Anthem Press), a video-enhanced eBook, provides students with full access to all the assigned readings, faculty commentary on the readings, and examples of the best student performance on course assignments in previous years.",
  "topics": [
    "Social Science",
    "Public Administration",
    "Environmental Policy",
    "Urban Studies",
    "Social Science",
    "Public Administration",
    "Environmental Policy",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nTwo lectures/week, 1.5 hours/lecture\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nThis class is required of all\nDUSP\ngraduate students pursuing an environmental policy and planning specialization. It is open to graduate students (and advanced undergraduates) from other MIT and Harvard departments interested in national environmental and energy policy-making, environmental ethics, the techniques of environmental analysis, and strategies for collaborative environmental decision-making. The primary objective of the class is to help each student formulate a personal theory of environmental planning practice.\n\nThe course has four parts:\nFederal Environmental and Energy Policy-Making\n,\nEnvironmental Ethics\n,\nTechniques of Environmental Analysis\n, and\nPublic Participation and Collaborative Decision-Making\n. The first part explores the dynamics of public policy-making in the United States and strategies that interest groups can use to promote changes in policy. The second examines the ethical and philosophical underpinnings of environmental planning. The third looks at the strengths and weaknesses of key techniques of environmental analysis like cost-benefit analysis, environmental impact assessment, modeling and simulation, sustainability analysis, life cycle analysis, and risk assessment. The fourth part of the course explores collaborative decision-making and dispute resolution techniques as they are used in the practice of environmental and energy facility planning.\n\nRecitations are not required, but they are useful. These are sessions, led by the TA, in which students can discuss the written assignments before each is due.\n\nText\n\nEnvironmental Problem-Solving\n(Susskind et. al, 2017, Anthem Press), a video-enhanced eBook, provides students with full access to all the assigned readings, faculty commentary on the readings, and examples of the best student performance on course assignments in previous years.\n\n(Image courtesy of Anthem Press and used with permission.)\n\nSusskind, Larry, Bruno Verdini, et al.\nEnvironmental Problem-Solving: A Video-Enhanced Self Instructional e-Book from MIT\n. Anthem Press, 2017.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nWritten Assignments (4)\n\n40%\n\nOral Presentations (3)\n\n30%\n\nFinal Exam\n\n25%\n\nAttendance, Reflection on Humboldt simulation\n\n5%",
  "files": []
}