{
  "course_name": "Introduction to Asian American Studies: Literature, Culture, and Historical Experience",
  "course_description": "This course provides an overview of Asian American history and its relevance for contemporary issues. It covers the first wave of Asian immigration in the 19th century, the rise of anti-Asian movements, the experiences of Asian Americans during WWII, the emergence of the Asian American movement in the 1960s, and the new wave of post–1965 Asian immigration. The class examines the role these experiences played in the formation of Asian American ethnicity. The course addresses key societal issues such as racial stereotyping, media racism, affirmative action, the glass ceiling, the “model minority” syndrome, and anti-Asian harassment or violence. The course is taught in English.",
  "topics": [
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies",
    "Humanities",
    "History",
    "Asian History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Society",
    "Asian Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSessions: 2 sessions / week, 1.5 hours / session\n\nCourse sessions include lecture and discussion sections, generally on alternating days during the week.\n\nCourse Description\n\nThis subject provides an overview of Asian American history and examines its relevance for contemporary Asian American issues. We will cover the first wave of Asian immigration in the 19\nth\ncentury, the rise of anti-Asian movements, the experiences of Asian Americans during WWII, the emergence of the Asian American movement in the 1960s, and the new wave of post-1965 Asian immigration. The class examines the role these experiences played in the formation of Asian American ethnic identity, and considers key issues such as racial stereotyping, media racism, affirmative action, the glass (or \"bamboo\") ceiling, the model minority stereotype, and anti-Asian harassment or violence.\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nIntended Learning Outcomes\n\nBy the time you complete this course, you should be able to:\n\nDemonstrate a basic understanding of the key historical events that have shaped Asian American communities since the 1850s, and the major factors that led to the production of the \"Asian American identity\" in the 1960s and 1970s.\n\nExplain the impact of labor demand, US immigration policy, and ideas about race and cultural difference on Asian Americans, comparing the \"first\" and \"second\" waves of Asian immigration.\n\nIdentify the shared experiences that link Asian Americans together, as well as the internal diversity (ethnic origin, language, religion, gender, class, generation, etc.) that divides this group.\n\nUse this knowledge to evaluate the validity of the \"model minority\" stereotype, considering in particular the internal diversity of the Asian American population, and the glass or \"bamboo\" ceiling phenomenon.\n\nEffectively communicate a position on a controversial issue through both written and oral communication.\n\nOther Key Activities\n\nA library workshop with an MIT reference librarian designed to improve research skills, with emphasis on historical primary sources and the critical evaluation of online materials.\n\nWriting workshops with our designated writing advisor focusing on use of evidence, thesis construction, and citations.\n\nA Chinatown scavenger hunt designed to promote student awareness of connections between class readings and local community issues.\n\nCommunication intensive subjects in the humanities, arts and social sciences (CI-H)\nrequire at least 6000 words of writing divided among a number of assignments, at least one of which is revised and resubmitted. This class requires three papers, one of which will be revised and resubmitted.\n\nAll paper assignments will be made available to students online. Each student will have a mandatory meeting with the writing advisor to discuss the revision process based on feedback from both the professor and the advisor. Additional meetings with the writing advisor will be arranged as needed throughout the semester in consultation with the writing advisor. You are also encouraged to make use of the Writing Center. In addition, CI-H subjects offer students substantial opportunity for oral expression, through presentations and class participation. This class requires all students to participate in a weekly discussion of the assigned reading. Each student will also make brief oral presentations on designated days and may be asked to lead class discussion once during the semester. To guarantee sufficient attention to student writing and substantial opportunity for oral expression, the number of students in this class is limited to 25. The class will meet twice weekly for an hour and a half each meeting. Lectures will generally be delivered during the first session, with the second reserved for discussions of readings and / or films. Students will also meet individually with the writing advisor to discuss the papers.\n\nThere is no final exam. Occasional [ungraded] quizzes may be given at the discretion of the professor to assess student progress in class.\n\nGrades\n\nAll grading will be done by the professor. The grade for this subject will be broken down as follows:\n\nACTIVITES\n\nPERCENTAGES\n\nClass participation\n\nPaper No. 1\n\nPaper No. 2\n\nPaper No. 3\n\nPaper rewrite\n\nFormal oral presentations\n\nDefinition of Grades\n\nExceptionally good performance, demonstrating a superior understanding of the subject matter, a foundation of extensive knowledge, and a skillful use of concepts and / or materials.\n\nGood performance, demonstrating capacity to use the appropriate concepts, a good understanding of the subject matter, and an ability to handle the problems and materials encountered in the subject.\n\nAdequate performance, demonstrating an adequate understanding of the subject matter, an ability to handle relatively simple problems, and adequate preparation for moving on to more advanced work in the field.\n\nMinimally acceptable performance, demonstrating at least partial familiarity with the subject matter and some capacity to deal with relatively simple problems, but also demonstrating deficiencies serious enough to make it inadvisable to proceed further in the field without additional work.\n\nIn accord with MIT Rules and Regulations of the Faculty section 2.62, I do not grade on a curve. Students are assessed individually, and there is no pre-determined grade spread in any subject.\n\nConsistent with this, after Drop Date, students who remain in a class are not in jeopardy of seeing their grades change due to the change in class composition.\n\nAttendance and Class Participation Attendance is mandatory. ***No class absence, except in cases of illness or family emergency. Please inform me in advance by e‐mail. No extensions on papers except in cases of serious illness or emergency!!! It is also mandatory that you meet with the writing advisor to discuss your paper revision!!!\n\nFive points will be deducted from your revised paper for failing to meet with the advisor, or for failing to provide her with proper notice if you wish to cancel or reschedule your meeting.\n\nOther Useful Information\n\nStudent Support Services\n\nIf you are dealing with a personal or medical issue that is impacting your ability to attend class, complete work, or take an exam, please discuss this with Student Support Services (S3). The deans in S3 will verify your situation, and then discuss with you how to address the missed work. Students will not be excused from coursework without verification from Student Support Services.\n\nAcademic Integrity Policy\n\nI expect all students to be familiar with MIT's policies and guidelines on academic integrity as outlined in the handbook on\nacademic integrity\n.\n\nPlease review all the guidelines in the handbook, including the information on responsible\nparaphrasing\n. You will also be expected to review the guidelines for copyright and fair use, provided by MIT libraries.\n\nPlagiarism and other forms of academic dishonesty are serious offenses and will be dealt with according to MIT policy and procedures.\n\nCollaboration Policy\n\nYou are expected to collaborate with others in this class. In terms of the papers, the Chinatown field trip report, and oral presentation, you may discuss and work together with others. However, my expectation is that the final written product represents your own original writing, and yours alone.\n\nCalendar\n\nSES #\n\nTOPICS / SESSION TYPE\n\nKEY DATES\n\nWeek 1: Intro\n\nIntroduction to the Class\n\nWeek 2: Early Immigrants-The First Wave\n\nIn-class free writing\n\nDiscussion\n\nWeek 3: Chinese Exclusion\n\nLecture\n\nPaper 1 due\n\nDiscussion\n\nWeek 4: Chinatown\n\nLibrary Workshop\n\nChinatown Field Trip\n\nWeek 5: Imperialism in the Philippines and the Migration of Colonials\n\nLecture\n\nMini-workshop with Writing Advisor: Tips on Comparative Analysis\n\nPresentations Group I\n\nWeek 6: World War II and the Japanese-American Internment\n\nLecture\n\nDiscussion\n\nWeek 7: Asian Americans in the Civil Rights Era\n\nLecture\n\nPaper 2 due\n\nWeek 8: The Second Wave: Post-1965 Immigration, Southeast Asian Refugees and Changing Community\n\nLecture\n\nPresentations Group II\n\nWeek 9: Model Minority or Invisible Minority?\n\nReview lecture\n\nDiscussion: I. The Pew Report and Responses\n\nChinatown Field Trip writeup due\n\nWeek 10: Asian Americans in Asia\n\nGuest Lecture: Asian Americans Working in Asia\n\nGuest lecture: Professor\nEdward J. W. Park\n\nWriting Workshop\n\nWeek 11: Second Wave Immigrants-Korean Americans, Small Business, and Inter-Ethnic Relations\n\nGuest Lecture\n\nGuest Lecture: Professor\nMin Song\n\nDiscussion\n\nWeek 12: Second Wave Immigrants-South Asian Americans, Ethnic Identity and the Second-Generation\n\nGuest Lecture\n\nGuest Lecture: Professor\nPawan Dhingra\n\nDiscussion\n\nWeek 13: New Immigrants, New Identities\n\nDiscussion and Thesis Presentation\n\nPresent paper thesis\n\nWeek 14: New Immigrants, New Identities\n\nThesis Presentations\n\nWriting Workshop\n\nWeek 15: Last Day of Class\n\nFinal Revised Paper Due\n\nFinal paper revision due\n\nParty\n\nSubject evaluations",
  "files": []
}