{
  "course_name": "Introduction to Organic Synthesis Laboratory",
  "course_description": "This course, which spans a third of a semester, provides students with experience using techniques employed in synthetic organic chemistry. It also introduces them to the exciting research area of catalytic chiral catalysis.\nThis class is part of the new laboratory curriculum in the MIT Department of Chemistry. Undergraduate Research-Inspired Experimental Chemistry Alternatives (URIECA) introduces students to cutting edge research topics in a modular format.",
  "topics": [
    "Engineering",
    "Chemical Engineering",
    "Science",
    "Chemistry",
    "Organic Chemistry",
    "Engineering",
    "Chemical Engineering",
    "Science",
    "Chemistry",
    "Organic Chemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLecture: 2 sessions over 4 weeks, 1 hour / session\n\nLabs: 2 sessions / week, 4 hours / session\n\nPrerequisites\n\n5.13 Organic Chemistry II\n\nOverview\n\nThis course provides students with a research-inspired laboratory experience in which students carry out a short synthetic sequence including a catalytic asymmetric cycloaddition reaction. The experiment provides students with experience with a variety of advanced techniques for carrying out organic reactions including the use of air-sensitive reagents, distillation, recrystallization, and column chromatography. Analytical techniques include the use of chiral GC for determination of enantiomeric purity.\n\nThe key reaction in the experiment is the asymmetric Diels-Alder reaction of cylcopentadience with methacrolein. In principle four stereoisomeric [4+2] cycloaddition products can result from this reaction, so both diastereoselectivity and enantioselectivity are involved in determining the outcome of the reaction.\n\nCalendar\n\nSES #\n\nACTIVITIES\n\nDry and purify triethylamine by distillation and purify dibenzyl tartrate by trituration and recrystallization.\n\nSet up esterification of dibenzyl tartrate with 2,6-dimethoxybenzoyl chloride which then runs overnight at reflux. The teaching assistants will turn off the heat the following day for you and the reaction will be allowed to proceed at room temperature until the next laboratory period of your group.\n\nWork up the esterification reaction.\n\nPurify the product of the esterification reaction by column chromatography. Analysis of the product by proton NMR spectroscopy (spectrum can be run at the beginning of Day 5 if necessary).\n\nSet up the hydrogenolysis reaction which will then run over the weekend at room temperature. If necessary, the teaching assistants will add more hydrogen to your balloons on the day after you set up the reaction.\n\nFilter and concentrate the hydrogenolysis reaction mixture, and set up overnight drying of the diacid product under vacuum. The measurement of the melting point of the product and NMR analysis can be performed either at the beginning of Day 7 or on an \"off day\" for your group between Days 6 and 7.\n\nGenerate the chiral CAB Lewis acid catalyst in situ and set up the Diels-Alder reaction to run overnight at low temperature. The teaching assistants will add additional dry ice to your cooling bath during the evening to extend the time that the reaction remains below -70 °C.\n\nWork up the Diels-Alder reaction and analyze the crude product by TLC and proton NMRspectroscopy.\n\nPurify the Diels-Alder product by column chromatography and separate the endo and exo cycloadducts.\n\nAnalyze the Diels-Alder product by proton NMR spectroscopy and determine the enantiomeric ratio for the exo isomer by gas chromatography using a chiral GC column. This characterization can be completed on Day 11 if necessary.\n\nExtra time for completion of the experiment and checkout.",
  "files": [
    {
      "category": "Resource",
      "title": "Chiral Gas Chromatography Appendix",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/6b8256d3ae4329bc04d9c8e1637fe3c3_MIT5_37s09_lab01_Chiral_GC.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAppendix 1\nEvaluation of ee by chiral GC\nOriginal :Mircea D. Gheorghiu\nAdapted: Mariusz Twardowski\nA. Chiral GC.\nA cycloaddition of cyclopentadiene to methacrolein, in principle, yields four\nnorbornene adducts: two diastereoisomers, namely exo-CHO-3 and endo-CHO-3, and\ntwo enantiomers, R and S for each diastereomer..\nAn achiral cycloaddition (no catalyst or an achiral Lewis acid) yields more exo\ndiastereoisomer than endo (see the Table at the bottom of Figure 1). Each\ndiastereoisomer is a racemic mixture (50% R+50% S).\nA chiral catalyzed cycloaddition preserves and enhances substantially the amount\nof the exo norbornene derivative, and also favors one enantiomer over the other.\nFigure 1. Cycloaddition of cyclopentadiene to methacrolein under uncatalyzed\nand chiral catalyzed conditions (an example selected randomly from previous years\nundergraduate students results).\nThe chiral GC traces for a crude sample resulted from the uncatalyzed (Figure 2)\nand Lewis acid chiral boron catalyzed cycloaddition of cyclopentadiene to methacrolein\n(Figure 3 and Figure 4) are (traces supplied by Dr Gheorghiu):\nAppendix 1-1\n\nFigure 2. Chiral GC trace of the crude product mixture resulted from cyclopentadiene\ncycloaddition to methacrolein (run on an α-DEX column).\nFigure 3. Chiral GC trace of the crude product mixture resulted from the cyclopentadiene\ncycloaddition to methacrolein in the presence of the chiral boron catalyst synthesized\nfrom the L-tartaric acid precursor (run on an α-DEX column).\nFigure 4. Chiral GC trace of the crude product mixture resulted from the cyclopentadiene\ncycloaddition to methacrolein in the presence of the chiral boron catalyst synthesized\nfrom the D-tartaric acid precursor (run on an α-DEX column).\nThe separation capacity of the chiral capillary Supelco β-DEXTM 225, used in this\nexperiment has been done with the enantiomers of citronellal (Aldrich, (R)-(+)- 90%\npurity and (S)-(-)- 98% purity). The traces are presented in Figure 5 and Figure 6\nAppendix 1-2\n\nrespectively. The ee for (R)-(+)-citronellal is 80.4%, while for (S)-(-)-citronellal is\n91.4%.\nFigure 5. (R)-(+)-citronellal (oven 95°C, detector 220°C, injection 200°C).\nFigure 6. (S)-(-)-citronellal (oven 95°C, detector 220°C, injection 200°C).\nAsymmetric cycloadditions:\nThe enantiomeric excess (ee) is defined as follows:\nIR (or IS) is the intensity (%) of the respective peak in the GC output. The Table\nfrom the bottom of Figure 1, provides the actual ee values calculated for the\ncycloadditions carried out with the chiral boron catalyst resulted from the precursors of\ntartaric acids enantiomers.\nWhen the chiral catalyst precursor is derived from the (2R,3R)-tartaric acid\n(natural), the Diels-Alder adduct exo-CHO-3 has the R configuration. The S enantiomer\nof the exo-CHO-3 is formed when the catalyst is derived from (2S,3S)-tartaric acid.\nAppendix 1-3\n\nChiral chromatography1\nAlthough chiral gas chromatography was invented by Gil-Av2 in 1966, it became\ncommercial after 1978 when Harada3 introduced cyclodextrines as chiral separation\nagent, which nowadays became the most common chiral separating agent.\nCyclodextrin (CD) is the chiral component in the stationary phase of a DEX\ncapillary column. Cyclodextrins are cyclic oligomers obtained by the partial degradation\nof starch followed by enzymatic coupling of the glucose units into homogeneous\nstructures of different molecular sizes. The most widely characterized are three\ncyclodextrines, namely α-, β-, and γ-cyclodextrines containing 6, 7 and 8, respectively,\nunits of glucose. D(+)-glucose is linked through α(1-4) glycosidic bonds.\nThe shape of the oligomer is toroidal with a larger circumference of the top mouth\nthan the base. The size of the torus-shaped cavity of β-CD is 6.0-6.5 A. You will run\nchiral GC on a capillary column4 Supelco β-DEXTM 225. The stationary phase is formed\nfrom heptakis(2,3-di-O-acetyl-6-O-tert-butyldimethylsilyl)-β -cyclodextrin embedded in\nsiloxane matrix SPBTM-20 poly(20% diphenyl / 80% dimethylsiloxane). The column has\n30m x 0.25mm ID, 0.25μm film.\nFor more details consult: Beesley, T. E.; Scott, R. P. W. Chiral Chromatography; Wiley: New York,\n1998.\n2 Gil-Av, D.; Feibush, B.; Charles-Siegies, R. Tetrahedron Lett. 1968, 1009.\n3 Harada, A.; Furue, M.; Nozakura, S. L. J. Polymer. Sci. 1978, 16, 189.\n4 Capillary column is used in more than 80% of GC applications.\nAppendix 1-4\n\nFigure 7. β-DEXTM 225 capillary column in the oven of HP 9890A GC.\nPresently, cyclodextrines are the most effective stationary phase for GC separation of\nstereoisomers. This effective chiral characteristics of β-CD is the result of its 35\nstereogenic centers. More than 30% of the known chiral separations have been carried\nout on β-DEX. Because β-CD is polar, the more polar materials are eluted much later.\nThe oven the column temperatures is constant to ±0.2°C.\nDetector: the GC separation is monitored by the flame ionization detector (FID,\napropos this acronym is not the NMR FID, e.g. the free induction decay) which is used in\nmore than 90% of chiral GC. The FID was invented in 1958 by Harley and Pretorious5\nand independently by McWiliams and Dewer6 and is considered a \"universal\" detector\n(because has diverse and comprehensive response). By burning (oxidation) of the\ncolumn exit organic compound (the solute) ions and electrons are generated by\nthermionic emission from the oxidized fragments. The ionization process produces about\none ion per 5x104 molecules, a highly inefficient process. However, enough (!) to be\ncollected by a potential of 110 or 220 volts applied between the jet and the electrode (see\nFig. XX). These ions are producing a very small current of ca. 1-2 x 10-12 amperes, with\na noise level of 10-14 amperes.\n5 Harley, J.; Nel, W.; Pretoriuos, V. Nature (London) 1958, 181, 177.\n6 McWilliams, G.; Dewer, R.A., Gas Chromatography, Desty, D.H. Ed. Butterworths: London, 1958\nAppendix 1-5\n\nFigure 8. Schematics of the FID.\nWithin the FID detector H2 and air is mixed with the exiting organic compounds from the\ncapillary column carried by He. The burning occurs at a small jet placed very close to a\ncylindrical electrode. The resulting current is amplified and sent to the recorder. FID is\nnot detecting CS2, CO, etc. but detects all the other carbon containing solutes.\nSyringe.\nThe syringe, Pressure Lok(r) mini-injector, that you are going to use for chiral GC\nhas several features; (i) its capacity is 0.01μL, (ii) it has a plunger-within-a-needle, that is\nhas a precisely measurable (0.01μL) groove ring in the wire plunger. Please handle the\nsyringe carefully in order not to bend the plunger or break it.\nAppendix 1-6\n\nHow to operate the GC.\n1. The red NOT READY LIGHT must be off.\nFigure 9. Keyboard of GC HP-5890A.\n2. Verify or ask the TA if the following parameters are set correctly:\n- oven temperature (should be isothermally set at 80°C)\n- injection port temperature (should be set at 200°C)\n- detector temperature (should be set at 250°C)\n- pressure of the He (carrier) 16 psi. Do not touch any valve related to air and\nhydrogen flow.\nFigure 10. Column head pressure gauge (should read 16 psi).\nAppendix 1-7\n\nPreparing sample for the GC injection:\nA. The solvent chosen is CH2Cl2 because of its low boiling point. Make the\nsample in a vial with a concentration of 30-40mg/mL in CH2Cl2 and transfer about 0.5\nmL into a culture tube (6x50mm).\nB. Cleaning the syringe. Before using, the syringe is flushed with\nCH2Cl2, and heated at 370°C in the syringe cleaner (see Figure 12). Insert the syringe\nneedle when the plunger is retracted all the way. After the needle is in the hot chamber\npush the plunger all the way out. Keep for ca 3 minutes and before extracting the needle,\nretract the plunger all the way. Let the syringe cool. Please handle the syringe carefully\nin order not to bend or snap the plunger.\nFigure 11. \"Burning\" the syringe barrel.\nC. Extracting the sample. Insert the syringe needle into the solution of the Diels-Alder\nadduct dissolved in CH2Cl2. Push the plunger all the way out, avoiding hitting the\nbottom of the sample container and then pull it back. Do these movements for 2-3 times\nmore. Retract the plunger, take the needle out of the solution and wipe the exterior of the\nneedle gently with a Kimwipe. Now you are ready to inject.\nInjection. Carefully insert the clean needle into the septum of the injection port ca 90%\nof the length of the needle. Push the plunger down quickly. Hit RUN on the GC\nkeyboard. Pull the plunger back all the way. Extract the needle from the septum\ncarefully.\nAppendix 1-8\n\nFigure 13. Injection of the sample\nFigure 14. Schematics of the split-flow injection port.\n.\nAppendix 1-9"
    },
    {
      "category": "Resource",
      "title": "Grade Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/92bc163dd4bcdafcbb6fe15853764e1d_MIT5_37s09_lab01_GradeSheet.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF CHEMISTRY\nChemistry 5.37\nGRADE SHEET\nModule 7: Introduction to Organic Synthesis\nStudent:\nTeaching Assistant:\nGrading: A - exceptionally good, superior; B - good; C - adequate; D- barely adequate; F- unsatisfactory\nOral Quiz (10%)\nLab Notebook (20%)\nPre-labs (10%), timeliness & completeness (5%),\nclarity and organization (5%)\nComments:\nResults and Technique (30%)\nGeneral technique (5%) General technique, including reaction setups, quality of TLC analyses,\nNMR spectra (e.g., good resolution, no solvent peaks), etc.\nComments:\n\nResults: Purification of dibenzyl tartrate (5%) Amount and quality of purified tartrate\nComments:\nResults: Esterification reaction (5%) Yield and purity (NMR) of product (and success of\ncolumn)\nComments:\nResults: Hydrogenation (5%) Amount and purity of diacid\nComments:\nResults: Diels-Alder reaction (10%) Yield and purity (NMR) of product and enantioselectivity;\nsuccess of column chromatgraphy\nComments:\nAnalysis and Final Report (35%)\nStyle, format, discussion (10%) Organization, presentation, clarity, style for literature\nreferences, general discussion of results\nComments:\n\nExperimental procedures (5%) Content, follows Organic Syntheses style guidelines\nComments:\nSpectroscopic analysis (5%) Presentation of data, assignments and interpretation of spectra\nComments:\nMini-review (15%)\nComments:\nWaste Inventory Sheet (5%)\nFinal Grade for Module 7"
    },
    {
      "category": "Resource",
      "title": "Introduction to Organic Synthesis: Catalytic Asymmetric Cycloadditions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/f1df88a0ecdcbedd2b70cc446a753680_MIT5_37s09_lab01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF CHEMISTRY\nChemistry 5.37\nModule 7: Introduction to Organic Synthesis\nCatalytic Asymmetric Cycloadditions\nVersion 2009.2 Prepared by Professor Rick L. Danheiser, March 2008\nContents\nI.\nIntroduction\nII.\nOverview of the Experiment\nIII.\nReports and Grading\nIV.\nReferences\nV.\nExperimental Procedure\nVI.\nSpecial Safety Considerations\nVII.\nFinal Report\nAppendices\nI.\nWaste Inventory Form\nI.\nIntroduction\nThe goal of Module 7 is to provide you with experience with techniques employed in synthetic\norganic chemistry and to introduce you to the exciting research area of catalytic asymmetric organic\nsynthesis. This research-inspired experiment is based on a useful class of chiral catalysts developed\nby Professor Hisashi Yamamoto of the University of Chicago (the original work was performed at\nNagoya University). The procedures in the experiment are somewhat modified versions of the\nprocedures described in a publication by Professor Yamamoto in Organic Syntheses (Org. Synth.\n1995, 72, 86). This chemistry was originally adapted for the Chemistry 5.32 laboratory course by\nDr. Mircea Gheorghiu and the current version of Module 7 is a modification of that Chemistry 5.32\nexperiment.\nThe key reaction in the experiment is the asymmetric Diels-Alder reaction of cyclopentadiene with\nmethacrolein. As shown below, in principle four stereoisomeric [4 + 2] cycloaddition products can\nresult from this reaction: an endo cycloadduct and an exo cycloadduct, each of which in turn can be\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nCHO\n+\n10 mol% CAB\nCH2Cl2\n-78 °C\nCHO\nCH3\n+\nCH3\nCHO\n+\n+\nCHO\nCH3\nCH3\nCHO\nCAB = chiral acyloxyborane catalyst\nexo 2(R)\nendo 2(S)\nexo 2(S)\nendo 2(R)\nproduced in two enantiomeric forms.\nTwo varieties of stereocontrol thus are involved in\ndetermining the outcome of this reaction: diastereoselectivity and enantioselectivity.\nThe\ndiastereoselectivity of the cycloaddition refers to the ratio of endo and exo products and is\ninfluenced by steric factors and secondary orbital interactions. The enantioselectivity refers to the\nratio of the enantiomeric forms of each diastereomeric product.\nThe factors that control the\nstereochemical outcome of Diels-Alder cycloadditions will be discussed further in 5.37 lectures by\nProfessor Danheiser.\nIn the late 1980s, Hisashi Yamamoto and his coworkers reported that a class of chiral Lewis acid\ncatalysts that was under development in their laboratory has the ability to promote highly\nenantioselective Diels-Alder reactions.\nThe mechanism of this reaction will be discussed by\nProfessor Danheiser in 5.37 lectures.\nIn this URIECA module, we will prepare one of the\nYamamoto \"chiral acyloxyborane (CAB)\" catalysts (4) and employ it for the asymmetric Diels-\nAlder reaction of cyclopentadiene with methacrolein.\nThe CAB catalyst will be generated in situ for the Diels-Alder reaction by addition of borane to a\ntartaric acid derivative, which will itself be synthesized in two steps from dibenzyl tartrate as\noutlined in the scheme below. The synthesis of the catalyst precursor 3 requires the monoacylation\nof one hydroxyl group of tartaric acid with 2,6-dimethoxybenzoyl chloride. To accomplish this, first\nthe carboxylic acid groups of tartaric acid must be protected as esters so that they do not interfere\nwith the acylation reaction. The esters chosen for this protection must subsequently be cleavable in\nthe presence of the newly formed benzoate ester. This rules out the use of standard saponification\nconditions, since under those conditions (e.g., aqueous sodium hydroxide) cleavage of the benzoate\nester would take place as well. However, benzyl esters can be cleaved selectively by the process\nknown as hydrogenolysis, the reductive cleavage of benzylic bonds under the conditions of catalytic\nhydrogenation.\nDibenzyl tartrate (1) will be prepared by the teaching assistants via esterification of tartaric acid with\nbenzyl alcohol and will be provided to you as a \"crude\" product requiring further purification by\ntrituration and recrystallization. Esterification of dibenzyl tartrate to afford 2 will then be carried out\nby heating the diol overnight with 1 equiv of 2,6-dimethoxybenzoyl chloride in the presence of a\ncatalytic amount of 4-dimethylaminopyridine (\"DMAP\"). For a review of the use of DMAP as an\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nacylation catalyst, see Hoefle, G.; Steglich, W.; Vorbrueggen, H. Angew. Chem. Int. Ed. 1978, 17,\n569. The product of the esterification reaction (2) will be purified by column chromatography.\nO\nBH\nO\nO\nHO2C\nO\nO\nMeO\nOMe\nOH\nOCH2Ph\nOH\nO\nPhCH2O\nO\nEt3N, cat. DMAP\nCH2Cl2, reflux\nOMe\nMeO\nO\nCl\nBH3-THF\nCH2Cl2, 0 °C\nYamamoto's\nCAB catalyst\n(generated in situ)\nOH\nOH\nO\nHO2C\nO\nO\nMeO\nOMe\nOH\nOCH2Ph\nO\nO\nO\nMeO\nOMe\nPhCH2O\nO\nH2, Pd/C\nEtOAc, rt\nOH\nOH\nOH\nO\nHO\nO\nPhCH2OH\ncat. TsOH\ntoluene, reflux\nthis step is run by the\nteaching assistants\ntartaric acid\nHydrogenolysis to cleave the benzyl esters will be achieved by hydrogenation using 10% palladium\non carbon as the catalyst in ethyl acetate at room temperature to furnish the desired precursor (3) to\nthe CAB catalyst. This product should be of sufficient purity for use in the next step without further\npurification. For the asymmetric Diels-Alder reaction, the chiral Lewis acid catalyst (4) is generated\nin situ and the cycloaddition is carried out at -78 °C in dichloromethane. The product is purified by\ncolumn chromatography and analyzed by NMR spectroscopy and chiral gas chromatography.\nFurther discussion of strategies for asymmetric synthesis and enantioselective Diels-Alder reactions\nwill be presented by Professor Danheiser in lectures during Module 7.\nII.\nOverview of the Experiment\nThe experimental component of this URIECA module is designed to be completed in nine laboratory\nperiods plus 1-2 additional days for analysis of the products as outlined below. A total of 11 days\nare allocated for the experiment (including check-out) to ensure that you have adequate time to\ncomplete the work. Students will carry out the experiment in groups of two.\nBe sure to read ahead in the experimental procedure to be aware of what is going to be done during\nthe next laboratory period. In some cases it is necessary to place glassware in the drying oven for at\nleast 24 h, and you will need to do that during the lab period prior to the day that the equipment is\nneeded.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDay 1: Dry and purify triethylamine by distillation and purify dibenzyl tartrate by trituration and\nrecrystallization.\nDay 2: Set up esterification of dibenzyl tartrate with 2,6-dimethoxybenzoyl chloride which then\nruns overnight at reflux. The teaching assistants will turn off the heat the following day for you and\nthe reaction will be allowed to proceed at room temperature until the next laboratory period of your\ngroup.\nDay 3: Work up the esterification reaction.\nDay 4: Purify the product of the esterification reaction by column chromatography. Analysis of the\nproduct by proton NMR spectroscopy (spectrum can be run at the beginning of Day 5 if necessary).\nDay 5:\nSet up the hydrogenolysis reaction which will then run over the weekend at room\ntemperature. If necessary, the teaching assistants will add more hydrogen to your balloons on the\nday after you set up the reaction.\nDay 6: Filter and concentrate the hydrogenolysis reaction mixture, and set up overnight drying of\nthe diacid product under vacuum. The measurement of the melting point of the product and NMR\nanalysis can be performed either at the beginning of Day 7 or on an \"off day\" for your group\nbetween Days 6 and 7.\nDay 7: Generate the chiral CAB Lewis acid catalyst in situ and set up the Diels-Alder reaction to\nrun overnight at low temperature. The teaching assistants will add additional dry ice to your cooling\nbath during the evening to extend the time that the reaction remains below -70 °C.\nDay 8: Work up the Diels-Alder reaction and analyze the crude product by TLC and proton NMR\nspectroscopy.\nDay 9: Purify the Diels-Alder product by column chromatography and separate the endo and exo\ncycloadducts.\nDay 10:\nAnalyze the Diels-Alder product by proton NMR spectroscopy and determine the\nenantiomeric ratio for the exo isomer by gas chromatography using a chiral GC column. This\ncharacterization can be completed on Day 11 if necessary.\nDay 11: Extra time for completion of the experiment and checkout.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nIII.\nReports and Grading\nYour grade for this experiment will be based on a total of 100 points assigned as follows.\nOral quiz\n10 points\nLab notebook\n20 points\nExperimental results and technique\n30 points\nWaste inventory sheet\n5 points\nAnalysis, conclusions, and final report\n35 points\nIt is essential for you to carefully study the instructions for the module, complete the reading\nassignment, and to watch the relevant sections of the Digital Techniques Manual prior to beginning\nwork on the experiment. A short oral quiz covering all experimental aspects of the module will be\ngiven to each student by their TA sometime during the first four lab sessions to ensure that you are\nprepared to work on the module. You will not be informed in advance by your TA as to which day\nyour exam will be scheduled. You will be graded A, B, C, or F based on whether your familiarity\nand understanding of the experimental techniques is \"superior\", \"good\", \"acceptable\", or\nunsatisfactory, and this score will contribute 10% toward your final grade for the module. The oral\nquiz will be based on the reading assigned in Mohrig, Hammond, and Schatz on experimental\ntechniques in Chapters 5-11 and 14-17, as well as the information in the assigned videos from the\nDigital Techniques Manual. The quiz will not include questions on asymmetric synthesis and the\nDiels-Alder reaction, but rather will focus on the theory and practice of the experimental techniques\nthat are employed in Module 7.\n\"Prelab writeups\" are required prior to each lab session and will comprise 10 points of the lab\nnotebook portion of the total grade. These writeups should be concise outlines (one page or less)\ndescribing what you propose to carry out in that lab session. The purpose of preparing these outlines\nis to ensure that you mentally think through what you intend to carry out in the lab beforehand. The\ncarbon copy of the prelab outline should be submitted to your TA at the beginning of each lab\nsession. The remainder of the lab notebook portion of the grade (10 points) will be based on the\norganization, completeness, and clarity of your record of your experimental results. Guidelines are\nprovided below in the Experimental Procedure section for recording data in specific sections of the\nmodule.\nExperimental results and technique will comprise 30 points of the total grade. This portion of the\ngrade will be based principally on your experimental results, including the yields you obtain for\nreactions in various sections of the experiment, the success and efficiency of your separations and\npurifications, and the quality of the spectra you obtain for your products.\nStudents must prepare a waste inventory sheet and 5 points of the grade will be awarded based on\nthis. Copies of blank waste inventory sheets can be downloaded from the Experiments page of the\n5.37 website or copied from Appendix I of this writeup.\nThe final 35 points of the grade will be determined by your analysis of results and conclusions\n(i.e., your interpretation of spectra and conclusions) and your final written report, including your\n\"mini-review\" profiling an alternative asymmetric Diels-Alder strategy. More information on the\nwritten report is provided in Section VII below.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nIV.\nReferences\n(1) References on Experimental Methods\nThe Digital Techniques Manual provides detailed instructions concerning most of the experimental\ntechniques employed in this module. The DTM can be accessed via the following url (which is also\nlinked to the 5.37 website):\nhttp://ocw.mit.edu/ans7870/resources/chemvideo/index.htm\nThe specific DTM videos that are relevant to this module are indicated in each section of Part V\n(Experimental Procedure) below. Additional discussion of experimental techniques is contained in\nthe required reading in the following chapters of the course text \"Techniques in Organic\nChemistry\", Second Edition, Jerry R. Mohrig, Christina Noring Hammond, and Paul F. Schatz, W.\nH. Freeman, New York, 2006. Note that you should already be familiar with many of these sections\n(marked with an asterisk) as they were previously assigned in connection with Module 6.\nChapter 5*\nMeasuring Mass and Volume\nChapter 6\nHeating and Cooling Methods\nChapter 7*\nAssembly of Reaction Apparatus and Planning a Chemical Reaction\nChapter 8*\nExtraction and Drying Organic Liquids\nChapter 9\nRecrystallization\nChapter 10\nMelting Points and Melting Ranges\nChapter 11\nBoiling Points and Distillation\nChapter 14\nOptical Activity and Enantiomeric Analysis\nChapter 15*\nThin Layer Chromatography\nChapter 16\nGas-Liquid Chromatography\nChapter 17*\nLiquid Chromatography\nChapter 18*\nInfrared Spectroscopy\nChapter 19*\nNuclear Magnetic Resonance Spectroscopy\nAlso useful in connection with the interpretation of IR and NMR spectra is Spectrometric\nIdentification of Organic Compounds (Seventh Edition) by R. M. Silverstein, F. X. Webster, and D.\nJ. Kiemle (Wiley, 2005) ISBN 0-471-39362-2.\n(2) Background Reading on the Diels-Alder Reaction and Asymmetric Synthesis\nFor general background on the Diels-Alder reaction, including asymmetric variants, please consult\nthe following organic chemistry texts which are on reserve in the Science Library (this reading is\noptional).\n(1) \"Advanced Organic Chemistry, Part A: Structure and Mechanisms\", Fifth Edition, by F. A.\nCarey and R. J. Sundberg, Springer, 2007, Chapter 10 (\"Concerted Pericyclic Reactions\"), pp 833\n873.\n(2) \"Advanced Organic Chemistry, Part B: Reactions and Synthesis\", Fifth Edition, by F. A. Carey\nand R. J. Sundberg, Springer, 2007, Chapter 6 (\"Concerted Cycloadditions, Unimolecular\nRearrangements, and Thermal Eliminations\"), pp 473-526.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\n(3) \"Organic Chemistry\" by J. Clayden, N. Greeves, S. Warren, and P. Wothers, Oxford University\nPress, 2001, Chapter 35 (\"Pericyclic Reactions I: Cycloadditions\"), pp 905-924 and Chapter 45\n(\"Asymmetric Synthesis\"), pp 1217-1232.\nChiral Acyloxyboranes as Catalysts for Asymmetric Diels-Alder Reactions\nPlease read these three papers carefully; this experiment is based on the chemistry described in these\npublications. These articles can be accessed via the MIT Library website.\n(1) Furuta, K.; Gao, Q.-Z.; Yamamoto, H. Org. Synth. 1995, 72, 86.\n(2) Furuta, K.; Shimizu, S.; Miwa, Y.; Yamamoto, H. J. Org. Chem. 1989, 54, 1481.\n(3) Furuta, K.; Miwa, Y.; Iwanaga, K.; Yamamoto, H. J. Am. Chem. Soc. 1988, 110, 6254.\nReview of Yamamoto's Work on Chiral Acid Catalysts\nOptional further reading on Yamamoto's chiral acid catalysts:\n(1) Yamamoto, H.; Futatsugi, K. Angew. Chem. Int. Ed. 2005, 44, 1924.\nV.\nExperimental Procedure\nAs was the case with Module 6, it is important to watch the assigned videos in the Digital\nTechniques Manual and to read the assigned sections of Mohrig, Hammond, & Schatz in advance to\nobtain detailed guidance as to how to carry out the experimental operations referred to in the\nexperimental procedure below. You may wish to view sections of some of the DTM videos several\ntimes to be sure that you fully understand how to carry out these operations. You should also\ncarefully read the relevant assigned sections of the text (Mohrig, Hammond, & Schatz) which\nprovide additional useful instructions on these techniques and which also include background on the\ntheory behind techniques such as extraction and chromatography. The oral quiz which contributes\n10% of your grade on this module will be based on the assigned reading in Mohrig et al. and on the\nDTM videos assigned for the experiment. Although the quizzes will be carried out on Day 1, 2, 3 or\n4 of the module, they will include questions covering all of the reading and the assigned videos for\nthe entire experiment.\nPart VI describes special safety considerations associated with each phase of the experiment. Be\nsure to study the appropriate sections of Part VI carefully before carrying out each operation. If you\nhave any questions concerning safety practices, please consult with a teaching assistant, Professor\nDanheiser, or Dr. Gheorghiu.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDays 1-4 Monoesterification of Dibenzyl Tartrate with\n2,6-Dimethoxybenzoyl Chloride\nOH\nOCH2Ph\nO\nO\nO\nMeO\nOMe\nPhCH2O\nO\nOH\nOCH2Ph\nOH\nO\nPhCH2O\nO\nEt3N, cat. DMAP\nCH2Cl2, reflux\nOMe\nMeO\nO\nCl\nDay 1: Purification of Reactants for the Esterification Reaction\nDigital Techniques Manual: TLC-The Basics and TLC-Advanced, Distillation I,\nRecrystallization, Filtration, Melting Point Determination\nMohrig, Hammond, & Schatz: Chapter 6 (Heating and Cooling Methods), Chapter 11\n(Boiling Points and Distillation), Chapter 15 (Thin-Layer Chromatography), Chapter 5\n(Measuring Mass and Volume), Chapter 9 (Recrystallization), and Chapter 10 (Melting Points\nand Melting Ranges).\nEquipment:\nGlass-backed silica TLC plates, glass capillary TLC spotters, three TLC\nchambers with filter paper, TLC developing stock solutions (ceric ammonium\nmolybdenate, phosphomolybdic acid, and p-anisaldehyde), small vials, disposable\nglass pipettes and pipette bulbs. For distillation: short path distillation head,\ndistillation cow, three 10-mL round-bottomed flasks, 25-mL round-bottomed\nflask, glass stoppers. For trituration: 250-mL Erlenmeyer flask, spatula, glass\nrod, Buchner funnel, 500-mL Erlenmeyer filter flask, 100-mL graduated cylinder.\nFor recrystallization: 250-mL Erlenmeyer flask, 50-mL round bottomed flask,\n500-mL beaker, vials, filter funnel. Chemicals: diethyl ether, ethyl acetate,\nhexanes, triethylamine, and calcium hydride.\nFor optimal results it is necessary to purify the triethylamine that is used as an HCl scavenger in the\nesterification reaction. In particular, if any water is present in the triethylamine, then it can\nhydrolyze the acyl chloride faster than your alcohol reacts, and thus reduce the yield of the desired\nester product. Triethylamine can be dried by stirring it over calcium hydride and then distilling it\ninto a dry flask at atmospheric pressure under nitrogen.\nTransfer 10-15 mL of triethylamine into a 25-mL round-bottomed flask by dispo pipette. Add a\nmagnetic stirbar and ca. 0.5 g of calcium hydride. Attach a short-path distillation head equipped\nwith a thermometer to the distillation flask and equip the still head with an oven-dried cow attached\nto your nitrogen line via a T connector. Be sure to connect the condenser of the still head to your\nwater line. The third branch of the T connector should be linked to an oil bubbler via Tygon tubing.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nThe cow should be equipped with three oven-dried, 10-mL, round-bottomed flasks.\nStir the\ntriethylamine over calcium hydride for at least 1.5 h. Distill the triethylamine at atmospheric\npressure by heating the flask in a sand bath; the boiling point of triethylamine is 89 °C. Collect at\nleast 5 mL of dry triethylamine. Seal the flask containing the distilled triethylamine with a glass\nstopper. Any other triethylamine that you distill over can be returned to the original bottle. The\ncalcium hydride remaining in the distillation flask should be quenched according to the procedure\ndescribed in Part VI.\nPhoto of distillation setup here\nThe following purification of dibenzyl tartrate should be started while the triethylamine is stirring\nover calcium hydride. The sample of dibenzyl tartrate you will be given is the crude product from a\nreaction of benzyl alcohol and tartaric acid that was run by the teaching assistants. The sample of\ndiester is impure and contains a small amount of unreacted benzyl alcohol. Separation of the benzyl\nalcohol impurity from the diester by chromatography would be difficult, and can be accomplished\nmore easily on a large scale by trituration followed by recrystallization according to the procedure\ndescribed below.\nFirst, check the purity of your sample of dibenzyl tartrate by TLC analysis on silica gel using the\ntechniques introduced in Module 6. A sample of benzyl alcohol can be obtained for reference from\nyour teaching assistant. For eluant, begin by trying 25% ethyl acetate-hexane, but you may wish to\nexamine other solvent systems. Visualization should be carried out by UV and PMA.\nThe first step in the purification of the crude dibenzyl tartrate is trituration. Trituration is the process\nin which a solid is treated with a solvent in which it is not soluble but which does dissolve some of\nthe impurities present. You will be given ca. 10 g of crude dibenzyl tartrate in a 250-mL Erlenmeyer\nflask. Trituration of your dibenzyl tartrate (the crude material is a gummy solid) is carried out by\nadding 200 mL of hexane and 10 mL of diethyl ether to the diester in the 250-mL Erlenmeyer. Rub\nand grind the solid material with a glass rod and metal spatula for 5-10 min to break up clumps and\nto thoroughly mix the solid with the solvent. Next, add a magnetic stirbar to the flask and stir the\nmixture for 10 min. Filter the resulting mixture through a filter paper disk on a Buchner funnel into\na 500-mL Erlenmeyer filter flask, washing the solid that you collect with three 15-mL portions of\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\n20:1 hexane-ether. Transfer the solid to a tared 250-mL Erlenmeyer flask and record the weight of\ndibenzyl tartrate (you should have at least 9 g at this stage of the purification).\nRecrystallize your dibenzyl tartrate from a mixture of hexane and ethyl acetate according to the\nfollowing procedure. First, add the minimum amount of ethyl acetate to the solid required to\ndissolve it. Add ethyl acetate in small portions and thoroughly stir the mixture before adding the\nnext portion. A total of approximately 30 mL of ethyl acetate will be needed. Next, add hexane in\nsmall portions (ca. 5-10 mL at a time) until the solution just begins to become cloudy.\nApproximately 50 mL of hexane will be required. Finally, add ethyl acetate again dropwise until the\nmixture just again becomes clear. At this point, cool the Erlenmeyer flask in an ice-water bath.\nDibenzyl tartrate will crystallize and cooling should be continued until no further solid appears (ca.\n20 min). Collect the solid by filtration through a filter paper disk on a Buchner funnel into a 500-mL\nErlenmeyer filter flask, washing the solid that you collect with three 10-mL portions of cold hexane.\nTransfer the solid to a tared 500-mL beaker and record the weight of pure dibenzyl tartrate (you\nshould have 8-9 g). Carry out TLC analysis of the product to confirm that no benzyl alcohol is\npresent. Next, dry the solid by spreading it out on the bottom of the beaker, covering the top of the\nbeaker with a Kimwipe secured with a rubber band (to keep out dust), and allowing it to stand\nexposed to air until your next laboratory period.\nDay 2: Setting Up the Esterification Reaction\nDigital Techniques Manual: Refluxing a Reaction\nMohrig, Hammond, & Schatz: Chapter 5 (Measuring Mass and Volume), and Chapter 7\n(Assembly of Reaction Apparatus and Planning a Chemical Reaction)\nEquipment: Disposable glass pipettes and pipette bulbs, sand bath, 250-mL three-necked\nround-bottomed flask, reflux condenser, three-way stopcock with inlet adapter,\nmagnetic stirbar, oil bubbler, 2 glass stoppers, 100-mL graduated cylinder, 5-mL\nsyringe, heating mantle, dichloromethane, 4-dimethylaminopyridine.\nMeasure the melting point of your dried dibenzyl tartrate (the mp of pure diester is 49-50 °C). You\nwill need 6.1 g for the esterification reaction that you will set up on this day of Module 7.\nThe esterification will be carried out in an oven-dried, 250-mL, three-necked, round-bottomed flask\nequipped with a magnetic stirbar. The center neck of the flask should be fitted with a reflux\ncondenser topped with a inlet adapter connected to a three-way stopcock. One branch of the\nstopcock is connected by tygon tubing to the nitrogen source, and the other branch to an oil bubbler\nto allow for the monitoring of the nitrogen flow rate. The two side necks of the reaction flask are\ncapped with glass stoppers. A photograph of the reaction setup is shown in Figure 1 below.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nFigure 1. Reaction setup for\nthe esterification reaction.\nRemove the flask from the oven and quickly assemble it and begin the flow of nitrogen while it is\nstill hot. The reaction flask is flushed with nitrogen for 5 min by turning the three-way stopcock so\nas to temporarily cut off flow to the bubbler and to direct nitrogen into the flask while a glass\nstopper is removed from one of the side necks. With the flow of nitrogen continuing, the flask is\nthen charged via the open side neck with 6.1 g (18.5 mmol, 1.02 equiv) of dibenzyl tartrate (a solid)\nand then 100 mL of dichloromethane (previously dried over 4A molecular sieves) is added in one\nportion. Triethylamine (4 mL, 28.8 mmol, 1.58 equiv), previously distilled from calcium hydride, is\nthen added with a 5 mL syringe followed by 4-dimethylaminopyridine (0.050 g, 0.4 mmol, 0.02\nequiv). 4-Dimethylaminopyridine is a solid with mp 112-114 °C. The side neck is capped with a\nglass stopper, the three-way stopcock is adjusted so that it is open to the nitrogen source, flask, and\nthe bubbler, and the reaction mixture is cooled in an ice-water bath. Once the reaction mixture has\nreached ca. 0 °C, the first portion of 2,6-dimethoxybenzoyl chloride is added by momentarily\nopening a side neck and adding the acyl chloride. Commerically available 2,6-dimethoxybenzoyl\nchloride is only 80% pure, so a total of 4.65 g of this material must be used in order to have 18.2\nmmol (1.0 equiv) of acyl chloride. Note that 2,6-dimethoxybenzoyl chloride is a solid with mp 64\n66 °C. The acyl chloride is added in five portions at ca. 10-min intervals. After the last portion is\nadded, the ice bath is replaced with a heating mantle and the reaction mixture is heated at a gentle\nreflux (the boiling point of dichloromethane is 40 °C). Place a tag on your flask with your name and\nindicating the time that reflux was begun. A teaching assistant will shut off the heat 24 h after the\ntime you indicate on the tag and the reaction will be allowed to run at room temperature until your\nnext laboratory period.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDay 3: Workup of the Esterification Reaction\nDigital Techniques Manual: Reaction Workup I and II\nMohrig, Hammond, & Schatz: Chapter 8 (Extraction and Drying Organic Liquids.\nEquipment: Disposable glass pipettes and pipette bulbs, 100-mL graduated cylinder, 500-mL\nseparatory funnel, 1-L Erlenmeyer, two 500-mL Erlenmeyers, 250-mL round-\nbottomed flask, 50-mL round-bottomed flask, filter funnel, fluted filter paper,\ndichloromethane, saturated sodium bicarbonate solution, saturated NaCl\nsolution, anhydrous sodium sulfate.\nConfirm that the esterification reaction is complete by performing TLC analysis on a sample of the\nreaction mixture withdrawn from the flask through a side neck with your TLC spotter. If TLC\nindicates that substantial starting material remains, consult with your teaching assistant.\nThe workup outlined below is designed to remove any carboxylic acid impurities; the excess\ntriethylamine (bp 89 °C) will be removed after the workup by rotary evaporation. First, transfer the\nreaction mixture to a 500-mL separatory funnel, rinsing the flask with a small amount of\ndichloromethane and water to ensure complete transfer of the contents of the flask. Extract the\norganic solution with 100 mL of water, and then back-extract the aqueous phase with 50 mL of\ndichloromethane. Extract the combined organic phases with three 75-mL portions of saturated\nsodium bicarbonate solution and then 75 mL of water. Transfer the organic solution to a 500-mL\nErlenmeyer flask and dry it over anhydrous sodium sulfate. Filter the solution into a 250-mL round-\nbottomed flask and concentrate it by rotary evaporation at ca. 20 Torr and 40 °C to remove the\ndichloromethane and triethylamine. Transfer the product to a tared 50-mL round-bottomed flask\nusing a small amount of dichloromethane and again concentrate the solution. Record the weight of\nyour \"crude product\" and check it by TLC analysis using 3:1:5 hexane-diethyl ether\ndichloromethane as eluant. You should obtain ca. 9 g of crude esterification product as a gold or\nbrown-colored viscous liquid.\nDay 4: Purification of the Esterification Product\nDigital Techniques Manual: Column Chromatography\nMohrig, Hammond, & Schatz: Chapter 17 (Liquid Chromatography) and Chapter 19 pp 269\n276 (NMR Instrumentation and Sample Preparation)\nEquipment: Chromatography column (67 cm length, 55 mm width) with adapter and tubing\nfor top of column for applying pressure, funnel, 100-mL graduated cylinder, 230\n400 mesh silica gel 60, sand, 18 x 150-mm test tubes, test tube racks, round-\nbottomed flasks (50 and 500 mL), 1-L beaker, NMR tube, hexanes, diethyl ether,\ndichloromethane, and CDCl3.\nPurify your crude esterification product by flash column chromatography on 200 g of silica gel.\nWeigh out the silica gel in a 1-L beaker (200 g will come to about the 450-mL mark). Prepare the\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\ncolumn using a 3:1:5 mixture of hexanes-diethyl ether-dichloromethane and then elute with the same\nsolvent system. For general guidance, refer to the Digital Techniques Manual, Chapter 17 of Mohrig\net al., and your experience with column chromatography from Module 6. Be sure to save a small\nsample of the crude reaction product to use as a TLC reference sample; this should be spotted in lane\n1 on each plate as you monitor the fractions obtained in your chromatography. Collect 20-mL\nfractions in test tubes and identify the fractions containing your esterification product by TLC\nanalysis (remember that it is usually not necessary to perform TLC analysis of every fraction).\nCombine the desired fractions in a 500-mL round-bottomed flask and concentrate by rotary\nevaporation to remove all of the solvent. Transfer the product to a tared 50-mL round-bottomed\nflask using dichloromethane and again remove all of the solvent by rotary evaporation. Record the\nweight of your purified esterification product and record the results of all TLC analyses and the\ndetails of your chromatographic purification following the same guidelines described in Module 6.\nThe Organic Syntheses procedure reports obtaining 7.1-7.5 g (78-82% yield) of esterification\nproduct; you will need at least 3 g to go on to the next step in the synthesis. Be sure that your\nnotebook record of the chromatographic purification is detailed and complete. Record the amount of\nsilica gel used, and for each fraction collected indicate the volume and the eluant. Draw TLC plates\n(using the format described in Module 6) showing all of the fractions that were monitored by TLC\nanalysis.\nObtain a proton NMR spectrum of a small sample of your purified product in CDCl3. Note that if\nsolvent (e.g., ether, hexanes, or dichloromethane) appears in your spectrum, you will have to\nconcentrate your product further by rotary evaporation, record the new (solvent-free) weight of\nproduct, and run another NMR spectrum to confirm the purity of your material. If necessary, the\nNMR spectrum can be run on an \"off-day\" for your group or at the beginning of Day 5 of the\nmodule. NMR data for dibenzyl mono(2,6-dimethoxybenzoyl)tartrate can be found in the Organic\nSyntheses paper by Yamamoto et al.\nSubmit a copy of the NMR spectrum to your TA who must approve it before you proceed to the next\nphase of the experiment. Also report the weight of your purified product to your TA.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDays 5-6 Deprotection of Benzyl Esters by Hydrogenolysis\nOH\nOH\nO\nHO2C\nO\nO\nMeO\nOMe\nOH\nOCH2Ph\nO\nO\nO\nMeO\nOMe\nPhCH2O\nO\nH2, Pd/C\nEtOAc, rt\nDay 5: Setting Up the Hydrogenation Reaction\nEquipment: Disposable glass pipettes and pipette bulbs, balloons, 250-mL three-necked\nround-bottomed flask, reflux condenser, three-way stopcock with inlet adapter,\nmagnetic stirbar, oil bubbler, 2 glass stoppers, 100-mL graduated cylinder, ethyl\nacetate, palladium on carbon.\nEquip a 250-mL, three-necked, round-bottomed flask with a magnetic stirbar, two glass stoppers in\nthe side necks, and a reflux condenser in the center neck. The condenser simply functions as a\n\"spacer\" and is not connected to a water line. The top of the condenser is fitted with an inlet adapter\nconnected to a three-way stopcock. One branch of the stopcock is connected by tygon tubing to the\nnitrogen line, and the other branch to an oil bubbler to allow for the monitoring of the nitrogen flow\nrate. Flush the reaction flask with nitrogen for 5 min by closing the bubbler off at the three-way\nstopcock and opening one of the side necks of the flask as an outlet for the nitrogen. After 5 min,\ncharge the flask with 10% palladium on carbon (10% by weight to the amount of dibenzyl ester that\nyou will be using). Next, add 90 mL of ethyl acetate carefully, washing any palladium on carbon off\nthe walls of the inside of the flask so that all of the catalyst is under the surface of the solvent.\nFinally, add the dibenzyl ester via dispo pipette, using 10 mL of ethyl acetate to rinse the flask and\npipette used for the transfer. Continue flushing the flask with nitrogen for 3-4 min and then seal the\nside neck with a glass stopper.\nPrepare two \"hydrogen balloons\" by connecting each balloon to a 5-cm length of tygon tubing and\nsecuring the balloon to the tubing using copper wire. Wrap the connection with electrical tape to\nfurther ensure a tight seal. Turn the stopcock on your flask so that it is open to the nitrogen line and\nflask, and closed off from the oil bubbler. Detach from the stopcock the tygon tubing leading to the\nbubbler, and replace it on the stopcock with a balloon filled with hydrogen. Turn the stopcock so as\nto close off the nitrogen line and to open the flask to the hydrogen balloon, simultaneously loosening\na glass stopper on a side neck so as to allow the flask to be flushed with hydrogen. Next, turn the\nstopcock to close off the balloon, remove and refill the balloon with hydrogen, and flush the flask\nwith hydrogen a second time. Close the side neck tightly with the glass stopper, remove and refill\nthe balloon with hydrogen as described above, and replace the freshly filled balloon on the stopcock.\nAttach a a second balloon filled with hydrogen to the other branch of the stopcock in place of the\nnitrogen line. The stopcock should then be turned so that both balloons are open to the flask and the\nreaction mixture is stirring under an atmosphere of hydrogen. A photograph of a typical reaction\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nsetup is shown in Figure 2 below. After 24 h, it will be necessary to refill the balloons with\nhydrogen which may be lost by diffusion. The hydrogenolysis reaction will be allowed to run until\nyour next laboratory period.\nFigure 2. Hydrogenolysis reaction setup.\nDay 6: Workup of the Hydrogenation Reaction\nEquipment: Glass-backed silica TLC plates, glass capillary TLC spotters, TLC chambers with\nfilter paper, TLC developing stock solutions (ceric ammonium molybdenate,\nphosphomolybdic acid, and p-anisaldehyde), small vials, disposable glass\npipettes and pipette bulbs, sand bath, 100-mL graduated cylinder, Buchner\nfunnel, 500-mL Erlenmeyer filter flask, round-bottomed flasks (100 and 250 mL),\ninlet adapter, Celite.\nConfirm that the hydrogenolysis is complete by TLC analysis of a sample of the reaction mixture\nwithdrawn via a side neck with your TLC spotter (close off the balloons before opening the neck!).\nUse 3:1:5 hexane-ether-dichloromethane as eluant for the TLC analysis. Suction filter the reaction\nmixture through a 1.5-cm pad of Celite in a Buchner funnel into a 250-mL Erlenmeyer filter flask.\nBefore filtering your mixture, run some ethyl acetate through the Celite and then pack it down in the\nfunnel using a stopper or the bottom of a small vial. Be sure to wash the solid thoroughly with three\n20-mL portions of ethyl acetate. Do not allow the solid to become dry as it may ignite! Leave the\nsolid damp after the third wash and transfer the material immediately to the special palladium waste\ncontainer as described in Section VI.\nTransfer the filtrate to a tared, 250-mL, round-bottomed flask (using a small amount of\ndichloromethane to rinse the Erlenmeyer) and concentrate the filtrate by rotary evaporation.\nTransfer the resulting material to a 100-mL round-bottomed flask using methanol. Concentrate this\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nsolution and record the weight of your crude product. Equip the flask with an inlet adapter and\nattach it by rubber tubing to a vacuum pump. Dry the crude product for 24-48 h under vacuum (less\nthan 1 Torr) at 80 °C in a sand bath. It is important to thoroughly dry the product as residual organic\nsolvent will result in diminished enantioselectivity in the asymmetric Diels-Alder reaction. Record\nthe weight of the dried product; you should obtain 3.0-3.5 g of the diacid. This can be performed on\nthe \"off day\"for your group between Day 6 and Day 7 of the experiment, or can be postponed until\nthe beginning of Day 7.\nDays 7-11 Catalytic Asymmetric Diels-Alder Reaction\nOH\nOH\nO\nHO2C\nO\nO\nMeO\nOMe\nO\nBH\nO\nO\nHO2C\nO\nO\nMeO\nOMe\nBH3-THF\nCH2Cl2, 0 °C\nCAB catalyst\nCHO\n+\n10 mol% CAB\nCH2Cl2\n-78 °C\nCHO\nCH3\n+\nCH3\nCHO\n+\n+\nCHO\nCH3\nCH3\nCHO\nDay 7: Setting Up the Diels-Alder Reaction\nEquipment: Disposable glass pipettes and pipette bulbs, 125-mL three-necked round-bottomed\nflask, reflux condenser, three-way stopcock with inlet adapter, magnetic stirbar,\noil bubbler, 2 glass stoppers, 5-mL and two 10-mL syringes with needles, 100-mL\ngraduated cylinder, two cooling baths, methacrolein, cyclopentadiene,\ndichloromethane, borane-THF solution, acetone, dry ice.\nBefore carrying out the Diels-Alder reaction you will need to confirm that the hydrogenolysis has\nproceeded successfully. Measure the melting point of the dried product (in the Organic Syntheses\npaper Yamamoto et al. report mp 184-186 °C) and confirm that no starting material remains by TLC\nanalysis. A proton NMR spectrum should also be obtained for the product but this can be run after\nthe Diels-Alder reaction has been started unless there is some concern about the purity of your\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nmaterial. NMR data for the hydrogenolysis product can be found in the Organic Syntheses paper by\nYamamoto et al.\nAn oven-dried, 125-mL, tapered flask with two 14/20 ground glass necks and a thermometer inlet is\nequipped with a magnetic stirbar, a rubber septum in the side neck, a low-temperature thermometer,\nand a reflux condenser in the center neck. The condenser simply functions as a \"spacer\" and is not\nconnected to a water line. The top of the condenser is fitted with an inlet adapter connected to a\nthree-way stopcock. One branch of the stopcock is connected by tygon tubing to the nitrogen line,\nand the other branch to an oil bubbler to allow for the monitoring of the nitrogen flow rate. Flush\nthe reaction flask with nitrogen for 8 min by closing the bubbler off at the three-way stopcock and\nventing the flask with a short syringe needle throught the rubber septum as an outlet for the nitrogen.\nFigure 3 below shows the setup for the generation of the CAB catalyst and Diels-Alder reaction.\nFigure 3. Set up for the in situ generation of the CAB catalyst and Diels-Alder reaction.\nWith a strong flow of nitrogen continuing, temporarily open the side neck of the flask by removing\nthe septum and charge the flask with mono(2,6-dimethoxybenzoyl)tartaric acid (1.57 g, 5.00 mmol,\n0.1 equiv) and 50 mL of dichloromethane (previously dried over 4A molecular sieves). Replace the\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nseptum and cool the reaction flask in an ice-water bath. Once the temperature of the reaction\nmixture has reached 0-5 °C, add borane-THF solution (1.0 M, 5.0 mL, 5.0 mmol, 0.1 equiv)\ndropwise via a 10-mL syringe through the rubber septum over a period of ca. 30 min. Vigorous\nevolution of hydrogen will occur during the addition. The rate of gas evolution can be observed by\ntemporarily turning the stopcock so that the nitrogen source is closed off and the stopcock is open\nonly to the flask and the bubbler. After the addition of borane is complete, continue stirring the\nreaction mixture for 15 min at 0 °C, and then remove the ice-water bath and replace it immediately\nwith a Dewar cooling bath containing a mixture of dry ice-acetone at -78 °C. Once the internal\ntemperature of the reaction mixture has reached -75 to -78 °C, add methacrolein (4.14 mL, 50 mmol,\n1.0 equiv) dropwise via a 5-mL syringe over several min. The methacrolein will have previously\nbeen distilled earlier in the day for you by the teaching assistants. Immediately after adding the\nmethacrolein, add cyclopentadiene (5 mL, 60 mmol, 1.2 equiv) dropwise via a 10-mL syringe over a\nperiod of several min.\nThe Diels-Alder reaction will be allowed to proceed until the next laboratory period. For best\nresults, it is critical that the reaction mixture remain below -70 °C for as long as possible. Before\nleaving the reaction to run overnight, add fresh dry ice to your Dewar cooling bath. The teaching\nassistants will return to the lab later that evening to add additional dry ice to your bath so that the\ntotal time below -70 °C will be at least 5 h.\nDay 8: Workup of the Diels-Alder Reaction\nEquipment: Disposable glass pipettes and pipette bulbs, glass-backed silica TLC plates, glass\ncapillary TLC spotters, TLC chambers with filter paper, TLC developing stock\nsolutions, small vials, 100-mL graduated cylinder, 1000-mL separatory funnel\nwith glass stopper, 1-L Erlenmeyer, two 500-mL Erlenmeyers, 500-mL round-\nbottomed flask, 25-mL round-bottomed flask, filter funnel, fluted filter paper,\nNMR tube, ethyl acetate, hexanes, dichloromethane, saturated sodium\nbicarbonate solution, saturated NaCl solution, anhydrous magnesium sulfate,\nCDCl3.\nConfirm that the Diels-Alder reaction has taken place by performing TLC analysis of a sample of the\nreaction mixture withdrawn via a side neck with your TLC spotter. Use 10% ethyl acetate-hexanes\nfor elution and UV and PMA for visualization. Pour the reaction mixture into a 1-L separatory\nfunnel containing 150 mL of ice-cold saturated sodium bicarbonate solution. Be careful to release\nany gas that builds up during the extraction by venting the funnel after shaking for only a brief\nperiod at a time. Separate the layers and back-extract the aqueous phase with three 100-mL portions\nof hexane. The combined organic phases are then washed with two 200-mL portions of saturated\nsodium chloride solution, dried over anhydrous magnesium sulfate, filtered into a 500-mL round-\nbottomed flask, and concentrated by rotary evaporation at room temperature. Dissolve the residue in\ndichloromethane and transfer the solution to a tared 25-mL round-bottomed flask. Concentrate the\nsolution and record the weight of your crude Diels-Alder product. Obtain a proton NMR spectrum\nof this material in CDCl3. Determine the ratio of endo and exo Diels-Alder adducts by integration of\nthe NMR spectrum. Yamamoto has reported NMR data for the Diels-Alder adducts (prepared using\na different catalyst system) in Ishihara, K.; Kurihara, H.; Matsumoto, M.; Yamamoto, H. J. Am.\nChem. Soc. 1998, 120, 6920:\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nexo-2-Methylbicyclo[2.2.1]hept-5-ene-2-carboxaldehyde: 1H NMR (CDCl3, 300 MHz) δ 0.76 (d, J\n= 12.0 Hz, 1H), 1.01 (s, 3H), 1.38-1.40 (m, 2H), 2.25 (dd, J = 3.8, 12.0 Hz, 1H), 2.82 (br s, 1H), 2.90\n(br s, 1H), 6.11 (dd, J = 3.0, 5.7 Hz, 1H), 6.30 (dd, J = 3.0, 5.7 Hz, 1H), 9.69 (s, 1H).\nendo-2-Methylbicyclo[2.2.1]hept-5-ene-2-carboxaldehyde:\n1H NMR (CDCl3, 300 MHz) formyl\nresonance is observed at 9.40 (s, 1H).\nDay 9: Purification of the Diels-Alder Reaction Product\nEquipment: Glass-backed silica TLC plates, glass capillary TLC spotters, TLC chambers with\nfilter paper, TLC developing stock solutions (ceric ammonium molybdenate,\nphosphomolybdic acid, and p-anisaldehyde), small vials, disposable glass\npipettes and pipette bulbs, chromatography column (xx cm length, xx mm width)\nwith adapter and tubing for top of column for applying pressure, funnel, 100-mL\ngraduated cylinder, 230-400 mesh silica gel 60, sand, 13x100-mm test tubes, test\ntube rack, round-bottomed flasks (25, 100, and 500 mL), NMR tube, hexanes,\nethyl acetate, dichloromethane, and CDCl3.\nA 500-mg sample of your crude product will be purified by column chromatography on silica gel.\nThe main goal of this chromatographic purification is to separate the endo and exo cycloadducts.\nThis is a very challenging separation, but can be achieved by using a high ratio of silica gel to\ncompound. In order to achieve optimal resolution, it is necessary to apply your compound to the\ncolumn deposited on a small amount of silica gel. This technique allows you to begin the column\nwith your compound in a much narrower band of silica gel than would be possible if the compound\nwas applied to the column as a neat liquid or in solution.\nPrepare a column containing 100 g of silica gel using hexanes as solvent and run the solvent level\ndown so that it is just very slightly below the level of the top of the silica gel (do not add sand at the\ntop of the column yet). Make sure that the inside of the glass column above the level of the silica gel\nis dry of solvent. If necessary, dry the glass with a stream of nitrogen introduced via a dispo pipette\nattached to the end of tygon tubing hooked up to your nitrogen line. Meanwhile, weigh out 0.500 g\nof your crude Diels-Alder product in a tared 100-mL flask and dissolve it in 20 mL of\ndichloromethane. Add 1 g of silica gel to the flask and concentrate the mixture at room temperature\non the rotary evaporator. Make sure that the rotary trap is clean before you begin in case the silica\ngel \"bumps\" and you have to recover it from the trap. Evaporation of the dichloromethane in this\nfashion will leave you with silica gel on which your compound has been adsorbed. The silica gel\nshould be dry and free flowing. Add this material to the top of the silica gel column, tapping the\nglass column gently to help dislodge any silica gel that adheres to the glass above the level of the\nsilica gel column. If necessary, wash adhering silica gel off the walls using a minimum amount of\nhexane. Add 10 mL of dichloromethane to the 100-mL round bottomed flask followed by 0.5 g of\nadditional silica gel. Concentrate this mixture and add the resulting dry silica gel to the top of your\ncolumn. This serves as a \"wash\" to ensure that all of the compound originally in the flask is\ndeposited on silica gel and added to the column. Add a thin layer of sand to the top of the silica gel\ncolumn and then carefully add hexanes and begin elution.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nUse a gradient of 1-5% ethyl acetate-hexanes to elute your compounds from the column. Be sure to\nsave a small sample of the crude reaction product to use as a TLC reference sample; this should be\nspotted in lane 1 on each plate as you monitor the fractions obtained in your chromatography.\nCollect 10-mL fractions in test tubes and identify the fractions containing your desired exo product\nby TLC analysis (remember that it is usually not necessary to perform TLC analysis of every\nfraction). Combine the desired fractions in a 500-mL or 1-L flask and concentrate by rotary\nevaporation to remove all of the solvent. Transfer the product to a tared 25-mL round-bottomed\nflask using dichloromethane and again remove all of the solvent by rotary evaporation. Record the\nweight of your purified exo Diels-Alder product and record the results of all TLC analyses and the\ndetails of your chromatographic purification following the guidelines described in Module 6.\nIf \"mixed fractions\" containing your desired product and impurities are obtained, these fractions\nshould be combined, concentrated, weighed, and analyzed by TLC and proton NMR spectroscopy.\nConsult with your teaching assistant to decide whether a second column should be run on this\nmaterial to obtain additional pure compound.\nTo prevent decomposition of the Diels-Alder product, it is necessary to store it in the cold, in\nsolution, and in the absence of air since like most aldehydes, this compound is sensitive to\nautoxidation.\nDissolve your product in dichloromethane and degass the solution by bubbling\nnitrogen through the solution for 5 minutes. The nitrogen should be introduced via a dispo pipette\nattached to rubber tubing from the nitrogen source. Seal the flask and store in the refrigerator.\nDuring the course of analyses try to keep the flask closed whenever possible and minimize the time\nthe \"neat\" compound is exposed to air.\nDays 10-11: Analysis of the Diels-Alder Reaction Product\nMohrig, Hammond, & Schatz: Chapter 16 (Gas-Liquid Chromatography)\nEquipment: NMR tube, CDCl3.\nObtain a proton NMR spectrum of your purified Diels-Alder product, and also an infrared spectrum.\nOptional: if time permits, you may wish to obtain a carbon NMR spectrum of the compound as\nwell. After confirming that your material is pure exo isomer, measure the enantiomeric ratio of\ncycloadducts using gas-liquid chromatography on a chiral GC column. Instructions for the use of\nthe chiral GC will be provided separately prior to Day 10 of the experiment.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nVI.\nSpecial Safety Considerations\nThis section provides some specific safety information for the Module 7 experiment. In particular,\nthis section discusses chemicals that you may not have encountered previously in the undergraduate\nlaboratory. Note that this summary is only intended to supplement the safety training provided at\nthe beginning of the URIECA lab courses and does not replace the general practices described in\nthat training which should be followed at all times. For example, students should practice \"zero\ncontact\" with chemicals by always wearing gloves while working with all organic chemicals so as to\navoid all contact with the skin.\nGeneral: Working with Flammable Solvents\nSeveral solvents employed in Module 7 are highly flammable and care should be taken to avoid\nspills. Diethyl ether (flash point -45 °C), acetone (flash point -18 °C), ethyl acetate (flash point -4\n°C), and hexane (flash point -22 °C) are of particular concern. Be sure that you are aware of the\nlocation of \"solvent pillows\" in the laboratory so that in the event of a spill you are prepared to\nimmediately absorb the spilled solvent before a highly flammable cloud of solvent vapor can form.\nDay 1\nTriethylamine is flammable (flash point -9 °C) and relatively volatile (bp 89 °C). With an LD50\n(oral, rat) of 460 mg/kg it is classified as \"moderately toxic\". Triethylamine should be handled in\nthe hood so as to avoid inhalation of its vapors and all contact with the skin should be avoided by\nwearing impermeable gloves.\nCalcium hydride reacts vigorously with water with the formation of hydrogen gas which is highly\nflammable and in mixture with air can even be explosive. Do not handle calcium hydride in areas\nwhere there is any quantity of water (e.g, spill) present. Avoid all skin contact with calcium hydride\nsince it will react with moisture to form highly basic and corrosive calcium hydroxide. In the event\nof a spill, dilute the calcium hydride with an inert solid such as dry sand and transfer to an empty\nwaste container.\nThe following procedure should be employed for the disposal of the \"pot residue\" left after the\ndistillation of triethylamine. Working in the fume hood, carefully dilute the residual slurry of\ntriethylamine and calcium hydride with acetone until the round-bottomed flask is approximately half\nfull. Add the acetone a few drops at a time at first to be sure that no vigorous reaction occurs. Next,\nadd water dropwise, allowing the mixture to stir (magnetic stirring) until no significant evolution of\nhydrogen is evident. Continue adding water until no further reaction is observed. Pour the contents\nof the flask into a large beaker and add additional water (carefully at first) to confirm that no\n\"active\" calcium hydride remains. Transfer the resulting mixture to the waste container designated\nfor calcium hydride waste.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDay 2\n2,6-Dimethoxybenzoyl chloride will hydrolyze upon exposure to moisture in the air with the\nformation of highly corrosive HCl. Be careful to avoid all skin contact with this acyl chloride and\nhandle it only in a fume hood.\n4-Dimethylaminopyridine is toxic and can cause burns and should therefore be handled in a fume\nhood and all skin contact should be avoided by wearing impermeable gloves.\nDay 4\nSilica gel dust can be irritating to the respiratory tract and any manipulations that have the potential\nto create dust in the air should be carried out in a fume hood.\nDay 5\nHydrogen is not toxic and the main hazard associated with its use is due to its flammability.\nHydrogen is a highly flammable gas which forms explosive mixtures with air over a wide range of\nconcentrations (from 4 to 75% by volume). The ignition energy for hydrogen is very low, about\n1/10 that required for gasoline! Pure hydrogen burns with a nearly invisible bluish flame and the\ntemperature for hydrogen burning in air is extremely high (3713 °F)\nPalladium on carbon presents a fire hazard. The dry catalyst should never be added to an organic\nsolvent in the presence of air; instead, the organic solvent should be carefully added to the catalyst\nwhich must be under an inert atmosphere of argon or nitrogen. Palladium with adsorbed hydrogen is\nparticularly hazardous (see Day 6 for precautions).\nDay 6\nCare must be taken while filtering the finely divided palladium on carbon catalyst at the end of the\nhydrogenolysis reaction since it is saturated with adsorbed hydrogen and readily may ignite on\nexposure to air. Be sure that the solid remains damp while filtering it and do not allow it to become\ndry at any time. Transfer the damp material with the aid of water to the special waste container\ndesignated for palladium catalyst waste.\nDay 7\nBorane-THF solution should be regarded as toxic and should be handled in a fume hood and all\nskin contact should be avoided.\nMethacrolein poses a flammability hazard (flash point -15 °C) and is relatively volatile (bp 68 °C).\nMethacrolein should be handled as if it is highly toxic by analogy to acrolein which has an LD50\n(oral, rat) of only 46 mg/kg. Methacrolein must be handled exclusively in a fume hood. Strict\nprecautions must be taken to avoid all skin contact and inhalation of this compound.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nCyclopentadiene is quite volatile (bp 42 °C) and is flammable. Avoid skin contact and inhalation\nby working in a fume hood and wearing appropriate impermeable gloves.\nVII.\nFinal Report\nA final written report must be submitted by May 15 (the last day of classes). Unfortunately, MIT\nend-of-term regulations require that no assignment can be due later than that day. It should be\npossible for you to complete most of your report prior to the last week to avoid a last-minute crunch.\nThe final report must include the following sections.\nI. Introduction - a concise outline of the aims of the experiment, a description of the reactions (use\nequations), and references to the relevant literature (all references must follow the style of the\nJournal of the American Chemical Society; for instructions, see The ACS Style Guide or refer to\nrecent articles in JACS). This section should be 1-2 pages (single-spaced) in length.\n2. Experimental Procedure - prepare a detailed experimental procedure for your reactions.\nFollow the style guidelines currently used in Organic Syntheses which are described in detail in the\nOrganic Syntheses \"Instructions to Authors\". A pdf file of this document can be downloaded from\nthe \"Info for Authors\" section of the Organic Syntheses website http://www.orgsyn.org/.\n3. Spectroscopic Characterization - present the proton NMR data (and optional carbon, if run),\nand IR data for each of your products in table form. For the NMR data, for each resonance provide\nthe chemical shift, integration, multiplicity, and coupling constant. Show the assignment of all\nresonances in the spectrum.\n4. Discussion - discuss your results including any problems encountered. The Discussion Section\nshould also include a 2-3 page \"mini-review\" of an alternative strategy for asymmetric Diels-Alder\nreactions. Detailed instructions for this part of the report will be provided during a 5.37 lecture.\n5. Appendices - should include your waste inventory sheet and the actual copies of all spectra.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nMassachusetts Institute of Technology\nDepartment of Chemistry\nChemistry 5.37\nModule 7: Introduction to Organic Synthesis\nWaste Inventory Sheet\nDescription (Content)\nApproximate amount\nDisposition\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nSuggestions For Waste Reduction\nName:__________________________________________\nLab Group________\nT.A. Initials:________________"
    },
    {
      "category": "Resource",
      "title": "Lab Manual Part 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/c223e2477cffa28cfebfa43108483ff3_MIT5_37s09_lab01_part1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDays 1-4 Monoesterification of Dibenzyl Tartrate with\n2,6-Dimethoxybenzoyl Chloride\nOH\nOCH2Ph\nO\nO\nO\nMeO\nOMe\nPhCH2O\nO\nOH\nOCH2Ph\nOH\nO\nPhCH2O\nO\nEt3N, cat. DMAP\nCH2Cl2, reflux\nOMe\nMeO\nO\nCl\nDay 1: Purification of Reactants for the Esterification Reaction\nDigital Techniques Manual: TLC-The Basics and TLC-Advanced, Distillation I,\nRecrystallization, Filtration, Melting Point Determination\nMohrig, Hammond, & Schatz: Chapter 6 (Heating and Cooling Methods), Chapter 11\n(Boiling Points and Distillation), Chapter 15 (Thin-Layer Chromatography), Chapter 5\n(Measuring Mass and Volume), Chapter 9 (Recrystallization), and Chapter 10 (Melting Points\nand Melting Ranges).\nEquipment:\nGlass-backed silica TLC plates, glass capillary TLC spotters, three TLC\nchambers with filter paper, TLC developing stock solutions (ceric ammonium\nmolybdenate, phosphomolybdic acid, and p-anisaldehyde), small vials, disposable\nglass pipettes and pipette bulbs. For distillation: short path distillation head,\ndistillation cow, three 10-mL round-bottomed flasks, 25-mL round-bottomed\nflask, glass stoppers. For trituration: 250-mL Erlenmeyer flask, spatula, glass\nrod, Buchner funnel, 500-mL Erlenmeyer filter flask, 100-mL graduated cylinder.\nFor recrystallization: 250-mL Erlenmeyer flask, 50-mL round bottomed flask,\n500-mL beaker, vials, filter funnel. Chemicals: diethyl ether, ethyl acetate,\nhexanes, triethylamine, and calcium hydride.\nFor optimal results it is necessary to purify the triethylamine that is used as an HCl scavenger in the\nesterification reaction. In particular, if any water is present in the triethylamine, then it can\nhydrolyze the acyl chloride faster than your alcohol reacts, and thus reduce the yield of the desired\nester product. Triethylamine can be dried by stirring it over calcium hydride and then distilling it\ninto a dry flask at atmospheric pressure under nitrogen.\nTransfer 10-15 mL of triethylamine into a 25-mL round-bottomed flask by dispo pipette. Add a\nmagnetic stirbar and ca. 0.5 g of calcium hydride. Attach a short-path distillation head equipped\nwith a thermometer to the distillation flask and equip the still head with an oven-dried cow attached\nto your nitrogen line via a T connector. Be sure to connect the condenser of the still head to your\nwater line. The third branch of the T connector should be linked to an oil bubbler via Tygon tubing.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nThe cow should be equipped with three oven-dried, 10-mL, round-bottomed flasks.\nStir the\ntriethylamine over calcium hydride for at least 1.5 h. Distill the triethylamine at atmospheric\npressure by heating the flask in a sand bath; the boiling point of triethylamine is 89 °C. Collect at\nleast 5 mL of dry triethylamine. Seal the flask containing the distilled triethylamine with a glass\nstopper. Any other triethylamine that you distill over can be returned to the original bottle. The\ncalcium hydride remaining in the distillation flask should be quenched according to the procedure\ndescribed in Part VI.\nPhoto of distillation setup here\nThe following purification of dibenzyl tartrate should be started while the triethylamine is stirring\nover calcium hydride. The sample of dibenzyl tartrate you will be given is the crude product from a\nreaction of benzyl alcohol and tartaric acid that was run by the teaching assistants. The sample of\ndiester is impure and contains a small amount of unreacted benzyl alcohol. Separation of the benzyl\nalcohol impurity from the diester by chromatography would be difficult, and can be accomplished\nmore easily on a large scale by trituration followed by recrystallization according to the procedure\ndescribed below.\nFirst, check the purity of your sample of dibenzyl tartrate by TLC analysis on silica gel using the\ntechniques introduced in Module 6. A sample of benzyl alcohol can be obtained for reference from\nyour teaching assistant. For eluant, begin by trying 25% ethyl acetate-hexane, but you may wish to\nexamine other solvent systems. Visualization should be carried out by UV and PMA.\nThe first step in the purification of the crude dibenzyl tartrate is trituration. Trituration is the process\nin which a solid is treated with a solvent in which it is not soluble but which does dissolve some of\nthe impurities present. You will be given ca. 10 g of crude dibenzyl tartrate in a 250-mL Erlenmeyer\nflask. Trituration of your dibenzyl tartrate (the crude material is a gummy solid) is carried out by\nadding 200 mL of hexane and 10 mL of diethyl ether to the diester in the 250-mL Erlenmeyer. Rub\nand grind the solid material with a glass rod and metal spatula for 5-10 min to break up clumps and\nto thoroughly mix the solid with the solvent. Next, add a magnetic stirbar to the flask and stir the\nmixture for 10 min. Filter the resulting mixture through a filter paper disk on a Buchner funnel into\na 500-mL Erlenmeyer filter flask, washing the solid that you collect with three 15-mL portions of\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\n20:1 hexane-ether. Transfer the solid to a tared 250-mL Erlenmeyer flask and record the weight of\ndibenzyl tartrate (you should have at least 9 g at this stage of the purification).\nRecrystallize your dibenzyl tartrate from a mixture of hexane and ethyl acetate according to the\nfollowing procedure. First, add the minimum amount of ethyl acetate to the solid required to\ndissolve it. Add ethyl acetate in small portions and thoroughly stir the mixture before adding the\nnext portion. A total of approximately 30 mL of ethyl acetate will be needed. Next, add hexane in\nsmall portions (ca. 5-10 mL at a time) until the solution just begins to become cloudy.\nApproximately 50 mL of hexane will be required. Finally, add ethyl acetate again dropwise until the\nmixture just again becomes clear. At this point, cool the Erlenmeyer flask in an ice-water bath.\nDibenzyl tartrate will crystallize and cooling should be continued until no further solid appears (ca.\n20 min). Collect the solid by filtration through a filter paper disk on a Buchner funnel into a 500-mL\nErlenmeyer filter flask, washing the solid that you collect with three 10-mL portions of cold hexane.\nTransfer the solid to a tared 500-mL beaker and record the weight of pure dibenzyl tartrate (you\nshould have 8-9 g). Carry out TLC analysis of the product to confirm that no benzyl alcohol is\npresent. Next, dry the solid by spreading it out on the bottom of the beaker, covering the top of the\nbeaker with a Kimwipe secured with a rubber band (to keep out dust), and allowing it to stand\nexposed to air until your next laboratory period.\nDay 2: Setting Up the Esterification Reaction\nDigital Techniques Manual: Refluxing a Reaction\nMohrig, Hammond, & Schatz: Chapter 5 (Measuring Mass and Volume), and Chapter 7\n(Assembly of Reaction Apparatus and Planning a Chemical Reaction)\nEquipment: Disposable glass pipettes and pipette bulbs, sand bath, 250-mL three-necked\nround-bottomed flask, reflux condenser, three-way stopcock with inlet adapter,\nmagnetic stirbar, oil bubbler, 2 glass stoppers, 100-mL graduated cylinder, 5-mL\nsyringe, heating mantle, dichloromethane, 4-dimethylaminopyridine.\nMeasure the melting point of your dried dibenzyl tartrate (the mp of pure diester is 49-50 °C). You\nwill need 6.1 g for the esterification reaction that you will set up on this day of Module 7.\nThe esterification will be carried out in an oven-dried, 250-mL, three-necked, round-bottomed flask\nequipped with a magnetic stirbar. The center neck of the flask should be fitted with a reflux\ncondenser topped with a inlet adapter connected to a three-way stopcock. One branch of the\nstopcock is connected by tygon tubing to the nitrogen source, and the other branch to an oil bubbler\nto allow for the monitoring of the nitrogen flow rate. The two side necks of the reaction flask are\ncapped with glass stoppers. A photograph of the reaction setup is shown in Figure 1 below.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nFigure 1. Reaction setup for\nthe esterification reaction.\nRemove the flask from the oven and quickly assemble it and begin the flow of nitrogen while it is\nstill hot. The reaction flask is flushed with nitrogen for 5 min by turning the three-way stopcock so\nas to temporarily cut off flow to the bubbler and to direct nitrogen into the flask while a glass\nstopper is removed from one of the side necks. With the flow of nitrogen continuing, the flask is\nthen charged via the open side neck with 6.1 g (18.5 mmol, 1.02 equiv) of dibenzyl tartrate (a solid)\nand then 100 mL of dichloromethane (previously dried over 4A molecular sieves) is added in one\nportion. Triethylamine (4 mL, 28.8 mmol, 1.58 equiv), previously distilled from calcium hydride, is\nthen added with a 5 mL syringe followed by 4-dimethylaminopyridine (0.050 g, 0.4 mmol, 0.02\nequiv). 4-Dimethylaminopyridine is a solid with mp 112-114 °C. The side neck is capped with a\nglass stopper, the three-way stopcock is adjusted so that it is open to the nitrogen source, flask, and\nthe bubbler, and the reaction mixture is cooled in an ice-water bath. Once the reaction mixture has\nreached ca. 0 °C, the first portion of 2,6-dimethoxybenzoyl chloride is added by momentarily\nopening a side neck and adding the acyl chloride. Commerically available 2,6-dimethoxybenzoyl\nchloride is only 80% pure, so a total of 4.65 g of this material must be used in order to have 18.2\nmmol (1.0 equiv) of acyl chloride. Note that 2,6-dimethoxybenzoyl chloride is a solid with mp 64\n66 °C. The acyl chloride is added in five portions at ca. 10-min intervals. After the last portion is\nadded, the ice bath is replaced with a heating mantle and the reaction mixture is heated at a gentle\nreflux (the boiling point of dichloromethane is 40 °C). Place a tag on your flask with your name and\nindicating the time that reflux was begun. A teaching assistant will shut off the heat 24 h after the\ntime you indicate on the tag and the reaction will be allowed to run at room temperature until your\nnext laboratory period.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDay 3: Workup of the Esterification Reaction\nDigital Techniques Manual: Reaction Workup I and II\nMohrig, Hammond, & Schatz: Chapter 8 (Extraction and Drying Organic Liquids.\nEquipment: Disposable glass pipettes and pipette bulbs, 100-mL graduated cylinder, 500-mL\nseparatory funnel, 1-L Erlenmeyer, two 500-mL Erlenmeyers, 250-mL round-\nbottomed flask, 50-mL round-bottomed flask, filter funnel, fluted filter paper,\ndichloromethane, saturated sodium bicarbonate solution, saturated NaCl\nsolution, anhydrous sodium sulfate.\nConfirm that the esterification reaction is complete by performing TLC analysis on a sample of the\nreaction mixture withdrawn from the flask through a side neck with your TLC spotter. If TLC\nindicates that substantial starting material remains, consult with your teaching assistant.\nThe workup outlined below is designed to remove any carboxylic acid impurities; the excess\ntriethylamine (bp 89 °C) will be removed after the workup by rotary evaporation. First, transfer the\nreaction mixture to a 500-mL separatory funnel, rinsing the flask with a small amount of\ndichloromethane and water to ensure complete transfer of the contents of the flask. Extract the\norganic solution with 100 mL of water, and then back-extract the aqueous phase with 50 mL of\ndichloromethane. Extract the combined organic phases with three 75-mL portions of saturated\nsodium bicarbonate solution and then 75 mL of water. Transfer the organic solution to a 500-mL\nErlenmeyer flask and dry it over anhydrous sodium sulfate. Filter the solution into a 250-mL round-\nbottomed flask and concentrate it by rotary evaporation at ca. 20 Torr and 40 °C to remove the\ndichloromethane and triethylamine. Transfer the product to a tared 50-mL round-bottomed flask\nusing a small amount of dichloromethane and again concentrate the solution. Record the weight of\nyour \"crude product\" and check it by TLC analysis using 3:1:5 hexane-diethyl ether\ndichloromethane as eluant. You should obtain ca. 9 g of crude esterification product as a gold or\nbrown-colored viscous liquid.\nDay 4: Purification of the Esterification Product\nDigital Techniques Manual: Column Chromatography\nMohrig, Hammond, & Schatz: Chapter 17 (Liquid Chromatography) and Chapter 19 pp 269\n276 (NMR Instrumentation and Sample Preparation)\nEquipment: Chromatography column (67 cm length, 55 mm width) with adapter and tubing\nfor top of column for applying pressure, funnel, 100-mL graduated cylinder, 230\n400 mesh silica gel 60, sand, 18 x 150-mm test tubes, test tube racks, round-\nbottomed flasks (50 and 500 mL), 1-L beaker, NMR tube, hexanes, diethyl ether,\ndichloromethane, and CDCl3.\nPurify your crude esterification product by flash column chromatography on 200 g of silica gel.\nWeigh out the silica gel in a 1-L beaker (200 g will come to about the 450-mL mark). Prepare the\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\ncolumn using a 3:1:5 mixture of hexanes-diethyl ether-dichloromethane and then elute with the same\nsolvent system. For general guidance, refer to the Digital Techniques Manual, Chapter 17 of Mohrig\net al., and your experience with column chromatography from Module 6. Be sure to save a small\nsample of the crude reaction product to use as a TLC reference sample; this should be spotted in lane\n1 on each plate as you monitor the fractions obtained in your chromatography. Collect 20-mL\nfractions in test tubes and identify the fractions containing your esterification product by TLC\nanalysis (remember that it is usually not necessary to perform TLC analysis of every fraction).\nCombine the desired fractions in a 500-mL round-bottomed flask and concentrate by rotary\nevaporation to remove all of the solvent. Transfer the product to a tared 50-mL round-bottomed\nflask using dichloromethane and again remove all of the solvent by rotary evaporation. Record the\nweight of your purified esterification product and record the results of all TLC analyses and the\ndetails of your chromatographic purification following the same guidelines described in Module 6.\nThe Organic Syntheses procedure reports obtaining 7.1-7.5 g (78-82% yield) of esterification\nproduct; you will need at least 3 g to go on to the next step in the synthesis. Be sure that your\nnotebook record of the chromatographic purification is detailed and complete. Record the amount of\nsilica gel used, and for each fraction collected indicate the volume and the eluant. Draw TLC plates\n(using the format described in Module 6) showing all of the fractions that were monitored by TLC\nanalysis.\nObtain a proton NMR spectrum of a small sample of your purified product in CDCl3. Note that if\nsolvent (e.g., ether, hexanes, or dichloromethane) appears in your spectrum, you will have to\nconcentrate your product further by rotary evaporation, record the new (solvent-free) weight of\nproduct, and run another NMR spectrum to confirm the purity of your material. If necessary, the\nNMR spectrum can be run on an \"off-day\" for your group or at the beginning of Day 5 of the\nmodule. NMR data for dibenzyl mono(2,6-dimethoxybenzoyl)tartrate can be found in the Organic\nSyntheses paper by Yamamoto et al.\nSubmit a copy of the NMR spectrum to your TA who must approve it before you proceed to the next\nphase of the experiment. Also report the weight of your purified product to your TA."
    },
    {
      "category": "Resource",
      "title": "Lab Manual Part 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/ac88dc728b39ca2ab487c9f31df2c2c8_MIT5_37s09_lab01_part2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDays 5-6 Deprotection of Benzyl Esters by Hydrogenolysis\nOH\nOH\nO\nHO2C\nO\nO\nMeO\nOMe\nOH\nOCH2Ph\nO\nO\nO\nMeO\nOMe\nPhCH2O\nO\nH2, Pd/C\nEtOAc, rt\nDay 5: Setting Up the Hydrogenation Reaction\nEquipment: Disposable glass pipettes and pipette bulbs, balloons, 250-mL three-necked\nround-bottomed flask, reflux condenser, three-way stopcock with inlet adapter,\nmagnetic stirbar, oil bubbler, 2 glass stoppers, 100-mL graduated cylinder, ethyl\nacetate, palladium on carbon.\nEquip a 250-mL, three-necked, round-bottomed flask with a magnetic stirbar, two glass stoppers in\nthe side necks, and a reflux condenser in the center neck. The condenser simply functions as a\n\"spacer\" and is not connected to a water line. The top of the condenser is fitted with an inlet adapter\nconnected to a three-way stopcock. One branch of the stopcock is connected by tygon tubing to the\nnitrogen line, and the other branch to an oil bubbler to allow for the monitoring of the nitrogen flow\nrate. Flush the reaction flask with nitrogen for 5 min by closing the bubbler off at the three-way\nstopcock and opening one of the side necks of the flask as an outlet for the nitrogen. After 5 min,\ncharge the flask with 10% palladium on carbon (10% by weight to the amount of dibenzyl ester that\nyou will be using). Next, add 90 mL of ethyl acetate carefully, washing any palladium on carbon off\nthe walls of the inside of the flask so that all of the catalyst is under the surface of the solvent.\nFinally, add the dibenzyl ester via dispo pipette, using 10 mL of ethyl acetate to rinse the flask and\npipette used for the transfer. Continue flushing the flask with nitrogen for 3-4 min and then seal the\nside neck with a glass stopper.\nPrepare two \"hydrogen balloons\" by connecting each balloon to a 5-cm length of tygon tubing and\nsecuring the balloon to the tubing using copper wire. Wrap the connection with electrical tape to\nfurther ensure a tight seal. Turn the stopcock on your flask so that it is open to the nitrogen line and\nflask, and closed off from the oil bubbler. Detach from the stopcock the tygon tubing leading to the\nbubbler, and replace it on the stopcock with a balloon filled with hydrogen. Turn the stopcock so as\nto close off the nitrogen line and to open the flask to the hydrogen balloon, simultaneously loosening\na glass stopper on a side neck so as to allow the flask to be flushed with hydrogen. Next, turn the\nstopcock to close off the balloon, remove and refill the balloon with hydrogen, and flush the flask\nwith hydrogen a second time. Close the side neck tightly with the glass stopper, remove and refill\nthe balloon with hydrogen as described above, and replace the freshly filled balloon on the stopcock.\nAttach a a second balloon filled with hydrogen to the other branch of the stopcock in place of the\nnitrogen line. The stopcock should then be turned so that both balloons are open to the flask and the\nreaction mixture is stirring under an atmosphere of hydrogen. A photograph of a typical reaction\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nsetup is shown in Figure 2 below. After 24 h, it will be necessary to refill the balloons with\nhydrogen which may be lost by diffusion. The hydrogenolysis reaction will be allowed to run until\nyour next laboratory period.\nFigure 2. Hydrogenolysis reaction setup.\nDay 6: Workup of the Hydrogenation Reaction\nEquipment: Glass-backed silica TLC plates, glass capillary TLC spotters, TLC chambers with\nfilter paper, TLC developing stock solutions (ceric ammonium molybdenate,\nphosphomolybdic acid, and p-anisaldehyde), small vials, disposable glass\npipettes and pipette bulbs, sand bath, 100-mL graduated cylinder, Buchner\nfunnel, 500-mL Erlenmeyer filter flask, round-bottomed flasks (100 and 250 mL),\ninlet adapter, Celite.\nConfirm that the hydrogenolysis is complete by TLC analysis of a sample of the reaction mixture\nwithdrawn via a side neck with your TLC spotter (close off the balloons before opening the neck!).\nUse 3:1:5 hexane-ether-dichloromethane as eluant for the TLC analysis. Suction filter the reaction\nmixture through a 1.5-cm pad of Celite in a Buchner funnel into a 250-mL Erlenmeyer filter flask.\nBefore filtering your mixture, run some ethyl acetate through the Celite and then pack it down in the\nfunnel using a stopper or the bottom of a small vial. Be sure to wash the solid thoroughly with three\n20-mL portions of ethyl acetate. Do not allow the solid to become dry as it may ignite! Leave the\nsolid damp after the third wash and transfer the material immediately to the special palladium waste\ncontainer as described in Section VI.\nTransfer the filtrate to a tared, 250-mL, round-bottomed flask (using a small amount of\ndichloromethane to rinse the Erlenmeyer) and concentrate the filtrate by rotary evaporation.\nTransfer the resulting material to a 100-mL round-bottomed flask using methanol. Concentrate this\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nsolution and record the weight of your crude product. Equip the flask with an inlet adapter and\nattach it by rubber tubing to a vacuum pump. Dry the crude product for 24-48 h under vacuum (less\nthan 1 Torr) at 80 °C in a sand bath. It is important to thoroughly dry the product as residual organic\nsolvent will result in diminished enantioselectivity in the asymmetric Diels-Alder reaction. Record\nthe weight of the dried product; you should obtain 3.0-3.5 g of the diacid. This can be performed on\nthe \"off day\"for your group between Day 6 and Day 7 of the experiment, or can be postponed until\nthe beginning of Day 7."
    },
    {
      "category": "Resource",
      "title": "Lab Manual Part 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/877eefa4981797c7567ed802f01f0f04_MIT5_37s09_lab01_part3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nDays 7-11 Catalytic Asymmetric Diels-Alder Reaction\nOH\nOH\nO\nHO2C\nO\nO\nMeO\nOMe\nO\nBH\nO\nO\nHO2C\nO\nO\nMeO\nOMe\nBH3-THF\nCH2Cl2, 0 °C\nCAB catalyst\nCHO\n+\n10 mol% CAB\nCH2Cl2\n-78 °C\nCHO\nCH3\n+\nCH3\nCHO\n+\n+\nCHO\nCH3\nCH3\nCHO\nDay 7: Setting Up the Diels-Alder Reaction\nEquipment: Disposable glass pipettes and pipette bulbs, 125-mL three-necked round-bottomed\nflask, reflux condenser, three-way stopcock with inlet adapter, magnetic stirbar,\noil bubbler, 2 glass stoppers, 5-mL and two 10-mL syringes with needles, 100-mL\ngraduated cylinder, two cooling baths, methacrolein, cyclopentadiene,\ndichloromethane, borane-THF solution, acetone, dry ice.\nBefore carrying out the Diels-Alder reaction you will need to confirm that the hydrogenolysis has\nproceeded successfully. Measure the melting point of the dried product (in the Organic Syntheses\npaper Yamamoto et al. report mp 184-186 °C) and confirm that no starting material remains by TLC\nanalysis. A proton NMR spectrum should also be obtained for the product but this can be run after\nthe Diels-Alder reaction has been started unless there is some concern about the purity of your\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nmaterial. NMR data for the hydrogenolysis product can be found in the Organic Syntheses paper by\nYamamoto et al.\nAn oven-dried, 125-mL, tapered flask with two 14/20 ground glass necks and a thermometer inlet is\nequipped with a magnetic stirbar, a rubber septum in the side neck, a low-temperature thermometer,\nand a reflux condenser in the center neck. The condenser simply functions as a \"spacer\" and is not\nconnected to a water line. The top of the condenser is fitted with an inlet adapter connected to a\nthree-way stopcock. One branch of the stopcock is connected by tygon tubing to the nitrogen line,\nand the other branch to an oil bubbler to allow for the monitoring of the nitrogen flow rate. Flush\nthe reaction flask with nitrogen for 8 min by closing the bubbler off at the three-way stopcock and\nventing the flask with a short syringe needle throught the rubber septum as an outlet for the nitrogen.\nFigure 3 below shows the setup for the generation of the CAB catalyst and Diels-Alder reaction.\nFigure 3. Set up for the in situ generation of the CAB catalyst and Diels-Alder reaction.\nWith a strong flow of nitrogen continuing, temporarily open the side neck of the flask by removing\nthe septum and charge the flask with mono(2,6-dimethoxybenzoyl)tartaric acid (1.57 g, 5.00 mmol,\n0.1 equiv) and 50 mL of dichloromethane (previously dried over 4A molecular sieves). Replace the\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nseptum and cool the reaction flask in an ice-water bath. Once the temperature of the reaction\nmixture has reached 0-5 °C, add borane-THF solution (1.0 M, 5.0 mL, 5.0 mmol, 0.1 equiv)\ndropwise via a 10-mL syringe through the rubber septum over a period of ca. 30 min. Vigorous\nevolution of hydrogen will occur during the addition. The rate of gas evolution can be observed by\ntemporarily turning the stopcock so that the nitrogen source is closed off and the stopcock is open\nonly to the flask and the bubbler. After the addition of borane is complete, continue stirring the\nreaction mixture for 15 min at 0 °C, and then remove the ice-water bath and replace it immediately\nwith a Dewar cooling bath containing a mixture of dry ice-acetone at -78 °C. Once the internal\ntemperature of the reaction mixture has reached -75 to -78 °C, add methacrolein (4.14 mL, 50 mmol,\n1.0 equiv) dropwise via a 5-mL syringe over several min. The methacrolein will have previously\nbeen distilled earlier in the day for you by the teaching assistants. Immediately after adding the\nmethacrolein, add cyclopentadiene (5 mL, 60 mmol, 1.2 equiv) dropwise via a 10-mL syringe over a\nperiod of several min.\nThe Diels-Alder reaction will be allowed to proceed until the next laboratory period. For best\nresults, it is critical that the reaction mixture remain below -70 °C for as long as possible. Before\nleaving the reaction to run overnight, add fresh dry ice to your Dewar cooling bath. The teaching\nassistants will return to the lab later that evening to add additional dry ice to your bath so that the\ntotal time below -70 °C will be at least 5 h.\nDay 8: Workup of the Diels-Alder Reaction\nEquipment: Disposable glass pipettes and pipette bulbs, glass-backed silica TLC plates, glass\ncapillary TLC spotters, TLC chambers with filter paper, TLC developing stock\nsolutions, small vials, 100-mL graduated cylinder, 1000-mL separatory funnel\nwith glass stopper, 1-L Erlenmeyer, two 500-mL Erlenmeyers, 500-mL round-\nbottomed flask, 25-mL round-bottomed flask, filter funnel, fluted filter paper,\nNMR tube, ethyl acetate, hexanes, dichloromethane, saturated sodium\nbicarbonate solution, saturated NaCl solution, anhydrous magnesium sulfate,\nCDCl3.\nConfirm that the Diels-Alder reaction has taken place by performing TLC analysis of a sample of the\nreaction mixture withdrawn via a side neck with your TLC spotter. Use 10% ethyl acetate-hexanes\nfor elution and UV and PMA for visualization. Pour the reaction mixture into a 1-L separatory\nfunnel containing 150 mL of ice-cold saturated sodium bicarbonate solution. Be careful to release\nany gas that builds up during the extraction by venting the funnel after shaking for only a brief\nperiod at a time. Separate the layers and back-extract the aqueous phase with three 100-mL portions\nof hexane. The combined organic phases are then washed with two 200-mL portions of saturated\nsodium chloride solution, dried over anhydrous magnesium sulfate, filtered into a 500-mL round-\nbottomed flask, and concentrated by rotary evaporation at room temperature. Dissolve the residue in\ndichloromethane and transfer the solution to a tared 25-mL round-bottomed flask. Concentrate the\nsolution and record the weight of your crude Diels-Alder product. Obtain a proton NMR spectrum\nof this material in CDCl3. Determine the ratio of endo and exo Diels-Alder adducts by integration of\nthe NMR spectrum. Yamamoto has reported NMR data for the Diels-Alder adducts (prepared using\na different catalyst system) in Ishihara, K.; Kurihara, H.; Matsumoto, M.; Yamamoto, H. J. Am.\nChem. Soc. 1998, 120, 6920:\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nexo-2-Methylbicyclo[2.2.1]hept-5-ene-2-carboxaldehyde: 1H NMR (CDCl3, 300 MHz) δ 0.76 (d, J\n= 12.0 Hz, 1H), 1.01 (s, 3H), 1.38-1.40 (m, 2H), 2.25 (dd, J = 3.8, 12.0 Hz, 1H), 2.82 (br s, 1H), 2.90\n(br s, 1H), 6.11 (dd, J = 3.0, 5.7 Hz, 1H), 6.30 (dd, J = 3.0, 5.7 Hz, 1H), 9.69 (s, 1H).\nendo-2-Methylbicyclo[2.2.1]hept-5-ene-2-carboxaldehyde:\n1H NMR (CDCl3, 300 MHz) formyl\nresonance is observed at 9.40 (s, 1H).\nDay 9: Purification of the Diels-Alder Reaction Product\nEquipment: Glass-backed silica TLC plates, glass capillary TLC spotters, TLC chambers with\nfilter paper, TLC developing stock solutions (ceric ammonium molybdenate,\nphosphomolybdic acid, and p-anisaldehyde), small vials, disposable glass\npipettes and pipette bulbs, chromatography column (xx cm length, xx mm width)\nwith adapter and tubing for top of column for applying pressure, funnel, 100-mL\ngraduated cylinder, 230-400 mesh silica gel 60, sand, 13x100-mm test tubes, test\ntube rack, round-bottomed flasks (25, 100, and 500 mL), NMR tube, hexanes,\nethyl acetate, dichloromethane, and CDCl3.\nA 500-mg sample of your crude product will be purified by column chromatography on silica gel.\nThe main goal of this chromatographic purification is to separate the endo and exo cycloadducts.\nThis is a very challenging separation, but can be achieved by using a high ratio of silica gel to\ncompound. In order to achieve optimal resolution, it is necessary to apply your compound to the\ncolumn deposited on a small amount of silica gel. This technique allows you to begin the column\nwith your compound in a much narrower band of silica gel than would be possible if the compound\nwas applied to the column as a neat liquid or in solution.\nPrepare a column containing 100 g of silica gel using hexanes as solvent and run the solvent level\ndown so that it is just very slightly below the level of the top of the silica gel (do not add sand at the\ntop of the column yet). Make sure that the inside of the glass column above the level of the silica gel\nis dry of solvent. If necessary, dry the glass with a stream of nitrogen introduced via a dispo pipette\nattached to the end of tygon tubing hooked up to your nitrogen line. Meanwhile, weigh out 0.500 g\nof your crude Diels-Alder product in a tared 100-mL flask and dissolve it in 20 mL of\ndichloromethane. Add 1 g of silica gel to the flask and concentrate the mixture at room temperature\non the rotary evaporator. Make sure that the rotary trap is clean before you begin in case the silica\ngel \"bumps\" and you have to recover it from the trap. Evaporation of the dichloromethane in this\nfashion will leave you with silica gel on which your compound has been adsorbed. The silica gel\nshould be dry and free flowing. Add this material to the top of the silica gel column, tapping the\nglass column gently to help dislodge any silica gel that adheres to the glass above the level of the\nsilica gel column. If necessary, wash adhering silica gel off the walls using a minimum amount of\nhexane. Add 10 mL of dichloromethane to the 100-mL round bottomed flask followed by 0.5 g of\nadditional silica gel. Concentrate this mixture and add the resulting dry silica gel to the top of your\ncolumn. This serves as a \"wash\" to ensure that all of the compound originally in the flask is\ndeposited on silica gel and added to the column. Add a thin layer of sand to the top of the silica gel\ncolumn and then carefully add hexanes and begin elution.\n\nChemistry 5.37\nURIECA Module 7: Introduction to Organic Synthesis\nUse a gradient of 1-5% ethyl acetate-hexanes to elute your compounds from the column. Be sure to\nsave a small sample of the crude reaction product to use as a TLC reference sample; this should be\nspotted in lane 1 on each plate as you monitor the fractions obtained in your chromatography.\nCollect 10-mL fractions in test tubes and identify the fractions containing your desired exo product\nby TLC analysis (remember that it is usually not necessary to perform TLC analysis of every\nfraction). Combine the desired fractions in a 500-mL or 1-L flask and concentrate by rotary\nevaporation to remove all of the solvent. Transfer the product to a tared 25-mL round-bottomed\nflask using dichloromethane and again remove all of the solvent by rotary evaporation. Record the\nweight of your purified exo Diels-Alder product and record the results of all TLC analyses and the\ndetails of your chromatographic purification following the guidelines described in Module 6.\nIf \"mixed fractions\" containing your desired product and impurities are obtained, these fractions\nshould be combined, concentrated, weighed, and analyzed by TLC and proton NMR spectroscopy.\nConsult with your teaching assistant to decide whether a second column should be run on this\nmaterial to obtain additional pure compound.\nTo prevent decomposition of the Diels-Alder product, it is necessary to store it in the cold, in\nsolution, and in the absence of air since like most aldehydes, this compound is sensitive to\nautoxidation.\nDissolve your product in dichloromethane and degass the solution by bubbling\nnitrogen through the solution for 5 minutes. The nitrogen should be introduced via a dispo pipette\nattached to rubber tubing from the nitrogen source. Seal the flask and store in the refrigerator.\nDuring the course of analyses try to keep the flask closed whenever possible and minimize the time\nthe \"neat\" compound is exposed to air.\nDays 10-11: Analysis of the Diels-Alder Reaction Product\nMohrig, Hammond, & Schatz: Chapter 16 (Gas-Liquid Chromatography)\nEquipment: NMR tube, CDCl3.\nObtain a proton NMR spectrum of your purified Diels-Alder product, and also an infrared spectrum.\nOptional: if time permits, you may wish to obtain a carbon NMR spectrum of the compound as\nwell. After confirming that your material is pure exo isomer, measure the enantiomeric ratio of\ncycloadducts using gas-liquid chromatography on a chiral GC column. Instructions for the use of\nthe chiral GC will be provided separately prior to Day 10 of the experiment."
    },
    {
      "category": "Resource",
      "title": "Module 7: Introduction to Organic Synthesis Catalytic Asymmetric Cycloadditions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/5b1c25de02499ad49922fff55fa4a3ef_MIT5_37s09_lab01_FinalReport.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChemistry 5.37\nModule 7: Introduction to Organic Synthesis\nCatalytic Asymmetric Cycloadditions\nInstructions for Discussion Section of Final Report\nOne of our goals in Module 7 is to become acquainted with current research frontiers in the field of\nsynthetic organic chemistry. Toward that end, a section of the Discussion section of your final report\nshould be devoted to a critical review of a publication describing an approach to asymmetric Diels-\nAlder reactions. This short assignment will give you an opportunity to think in further detail about the\nconcepts we discussed in the series of 5.37 lectures and will also help you to consolidate your\nunderstanding of the principles of asymmetric Diels-Alder reactions introduced in Module 7.\nYour \"mini-review\" need only be 2-3 pages in length and should provide a brief \"profile\" of a specific\nasymmetric Diels-Alder strategy different from the ones we discussed in the 5.37 lectures. You may\nchoose a strategy based on a chiral auxiliary approach, or one based on catalysis. Your mini-review\nshould include a concise description of the specific method (illustrated with one or more ChemDraw\nschemes), specific examples of the method in action (either as ChemDraw schemes or as a Table), and\nsome critical remarks highlighting the strengths and limitations of this particular strategy. If space\npermits and you are interested, you may also wish to comment on the mechanistic basis for the\nstereocontrol associated with the method.\nYour mini-review should be based on a single publication, but in some cases you may need to read\nsome prior papers from the same research group for background. You are free to choose any strategy\nthat interests you, provided that it is not one that we discussed in lecture. Listed below are several\ninteresting papers that you may choose from, or you may select another strategy that you identify from\nliterature searches (such as a Citation search on one of these methods or one of the papers discussed in\nlecture).\nThis assignment is intended for you to work on individually. I prefer that each student choose a\ndifferent paper to base their mini-review on, but in some cases I may permit two students to write\n(separately) on one of the more important papers. To ensure minimal overlap, please inform me of\nwhich paper you would like to write on and receive \"approval\" from me before May 12. Please send\nme an email indicating your first choice and I will let you know if that paper is still available or not\n(first come, first served). If you wish, feel free to send me a list with a second and even third choice as\nbackups in case your first choice is already taken.\nPlease do not hesitate to let me know if you have any questions about the assignment or about\nasymmetric Diels-Alder chemistry. I also welcome your comments and suggestions concerning the\nexperiment, the lectures, and any other aspect of URIECA.\n\nChiral Auxiliary Approaches\nHydroxy Ketones\nMasamune\nTerpene\nOppolzer\nSultam\nOppolzer\nOxazolidiones\nEvans\nPantolactone\nHelmchen\nPantolactone\nArai\nSugar\nGras\nPantolactone\nYamamoto\nSultam\nOppolzer\nDone\nSibi\nJ. Org. Chem. 1983, 48, 4441\nHelv. Chim. Acta. 1985, 68, 2100\nTetrahedron 1986, 42, 4035\nJ. Am. Chem. Soc. 1988, 110, 1238\nTetrahedron Lett. 1989, 30, 5595\nTetrahedron Lett. 1991, 32, 4557\nTetrahedron Lett. 1991, 32, 5529\nSynlett 1993, 638\nTetrahedron Lett. 1994, 35, 3509\nTetrahedron Lett. 1995, 36, 8965\nCatalytic Asymmetric Diels-Alder Strategies\nTADDOL\nOxazaborolidinone\nBINOL\nBINOL\nBis-Oxazolines\nBis-Oxazolines\nBis-Oxazolines\nTADDOL\nOxazaborolidinone\nOxazaborolidinone\nPyBOX\nOxazaborolidinone\nSilacycle\nTriflyl Phosphoramide\nDiamine\nOxazaborolidine\nNarasaka\nCorey\nKobayashi\nKobayashi\nGhosh\nSenanayake\nEvans\nHirama\nCorey\nCorey\nDesimoni\nYamamoto\nLeighton\nYamamoto\nMaruoka\nYamamoto\nJ. Am. Chem. Soc. 1989, 111, 5340\nJ. Am. Chem. Soc. 1991, 113, 8966\nJ. Org. Chem. 1994, 59, 3758\nJ. Org. Chem. 1994, 116, 4083\nTetrahedron: Asymmetry 1998, 9, 3687\nSynthesis 1998, 937\nJ. Am. Chem. Soc. 1999, 121, 7582\nTetrahedron Lett. 2000, 41, 6669\nJ. Am. Chem. Soc. 2002, 124, 3808\nJ. Am. Chem. Soc. 2003, 125, 6388\nJ. Org. Chem. 2003, 681, 7862\nAngew. Chem. Int. Ed. 2005, 44, 1484\nTetrahedron 2006, 62, 11397\nJ. Am. Chem. Soc. 2006, 128, 9626\nOrg. Lett. 2006, 8, 2687\nJ. Am. Chem. Soc. 2007, 129, 9536"
    },
    {
      "category": "Resource",
      "title": "Introduction to Organic Synthesis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/9c05ab8a552c922c75eb3c132cb27d62_MIT5_37s09_lec05_Handout.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMassachusetts Institute of Technology\nOrganic Chemistry 5.37\nMay 12, 2008\nProf. Rick L. Danheiser\nLecture 5\nIntroduction to Organic Synthesis\nPart I. Stereochemical Analysis of the Diels-Alder Products\n+\nCHO\nCH3\n10 mol% CAB\nCHO\nCH2Cl2\nexo 2(R) CH3\nendo 2(S)\nCHO\n+\n-78 °C\nCAB = chiral acyloxyborane catalyst\nCHO +\nCH3\n+\nCH3\nCHO\nexo 2(S)\nendo 2(R)\nChiral GC Analysis\nCycloaddition in the absence of\nCycloaddition in the presence\nthe Yamamoto CAB catalyst\nof the Yamamoto CAB catalyst\nExo\nCycloadducts\nEndo\nEndo\nCycloadducts\nCycloadducts\nCycloadducts\nExo\n\nReferences on Gas-Liquid Chromatography (previously assigned)\n(1) Chapter 16 (\"Gas-Liquid Chromatography\") in Techniques in Organic Chemistry, Second\nEdition, J. R. Mohrig, C. N. Hammond, and P. F. Schatz, W. H. Freeman, New York, 2006.\n(2) \"Evaluation of ee by Chiral GC and By 1H NMR with the Chiral Shift Reagent Eu(hfc)3\" by\nMircea Gheorghiu.\nChiral GC Analysis\nβ-Cyclodextrin\nIn Module 7 we will use a Supelco β-DEX 225 column with a stationary phase\nformed from heptakis(2,3-di-O-acetyl-6-O-tert-butyldimethylsilyl)-β-cyclodextrin\nembedded in siloxane matrix SPB-20 poly(20% diphenyl / 80% dimethylsiloxane\n(30 m x 0.25 mm ID, 0.25 μm film)"
    },
    {
      "category": "Resource",
      "title": "Introduction to Organic Synthesis The Diels-Alder Reaction, Part II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/937c54ac13f468453739d13a69087062_MIT5_37s09_lec02_Handout.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMassachusetts Institute of Technology\nOrganic Chemistry 5.37\nApril 18, 2008\nProf. Rick L. Danheiser\nLecture 2\nIntroduction to Organic Synthesis\nThe Diels-Alder Reaction, Part II\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E R' Z\nR' Z\nRE\nRZ\nR' E\nR1\nR2\nEWG\nOur results will play a role not only in the discussion of\ntheoretically interesting questions . . . . but probably also\nwill yield greater significance in a practical sense. Thus\nit appears to us that the possibility of synthesis of\ncomplex compounds related to or identical with natural\nproducts such as terpenes, sesquiterpenes, perhaps\nalso alkaloids, has been moved to the near prospect.\n. . . . . We explicitly reserve for ourselves the\napplication of the reaction discovered by us to the\nsolution of such problems.\nOtto Diels\nOtto Diels and Kurt Alder Justus Liebigs Annalen der Chemie 460, 98 (1928)\nKurt Alder\nFor Additional Reading . . . .\n(1) \"Advanced Organic Chemistry, Part A: Structure and Mechanisms\", Fifth Edition, by F. A. Carey\nand R. J. Sundberg, Springer, 2007, Chapter 10 (\"Concerted Pericyclic Reactions\"), pp 833-873.\n(2) \"Advanced Organic Chemistry, Part B: Reactions and Synthesis\", Fifth Edition, by F. A. Carey\nand R. J. Sundberg, Springer, 2007, Chapter 6 (\"Concerted Cycloadditions, Unimolecular\nRearrangements, and Thermal Eliminations\"), pp 473-526.\n(3) \"Organic Chemistry\" by J. Clayden, N. Greeves, S. Warren, and P. Wothers, Oxford University\nPress, 2001, Chapter 35 (\"Pericyclic Reactions I: Cycloadditions\"), pp 905-924 and Chapter 45\n(\"Asymmetric Synthesis\"), pp 1219-1232.\n\nRegiochemical Course of the Diels-Alder Reaction: The \"Ortho-Para Rule\"\n+\nnot\nEWG\nR\nR\nR\nEWG\nEWG\n\"ortho\"\n\"meta\"\nEWG\nEWG\nnot\n+\nR\nEWG\nR\nR\n\"para\"\n\"meta\"\nStereochemical Course of the Diels-Alder Reaction\nIntrinsic Stereoselectivity\nSuprafacial with respect to the diene\nSuprafacial with respect to the dienophile\nAlder endo rule\nAsymmetric Induction\nSubstrate control by chiral dienophiles\nSubstrate control by chiral dienes\nStereocontrol via chiral auxiliaries\nCatalytic Asymmetric Cycloadditions\nStereochemical Course of the Diels-Alder Reaction:\nSuprafacial with respect to the diene component\nR\nR\nH\nR\nE\nH\nH\nEWG\nEWG\nH\nH\nEWG\nE\nR\nR\nEWG\nEWG\nEWG\nH\nR\ncis\nR\nR\nH\nR\nE\nH\nEWG\nEWG\nR\nEWG\nZ\nH\nEWG\nEWG\nH\nR\nH\nEWG\nR\nH\ntrans\n\nStereochemical Course of the Diels-Alder Reaction:\nSuprafacial with respect to the Dienophile Component\nH\nEWG\nRE\nRZ\nRZ\nRE\nH\nEWG\nH\nRZ\nEWG\nRE\nStereochemical Course of the Diels-Alder Reaction: The Alder Endo Rule\nRE\nEWG\nRZ\nRE\nRE\nRZ\nEWG\nRZ\nEWG\nH\nH\nH\nRE\nRE\nRE\nRZ\nRZ\nExo\nH\nRZ\nAddition\nH\nEWG\nH\nEWG\nEWG\nThe term \"endo\" originates in the terminology used to\nthis bridge\ndescribe the stereochemistry of substituents on\nbicyclic ring systems. A substituent is said to be endo\nwhen it is trans to the smaller of the two bridges; an\nREXO\nexo substituent is cis to the smaller bridge.\nthis bridge\nhas 2 carbons\nRENDO\nhas 1 carbon\nO\nH\nH\nO\nO\nO\nO\nH\nO\nO\nH\nThis is an endo Diels-Alder adduct\nThis is an exo Diels-Alder adduct\n\nSteric vs. Stereoelectronic Effects in Determining Endo Selectivity\nCHO\n+\nCHO\nCH3\nmajor\nCH3\nminor\nCHO\nIntrinisic Stereoselectivity: Examples\nPredict the major Diels-Alder cycloadduct formed in the following reactions\n+\nMeO\nCH3\nCHO\n+\nCHO\nCH3\nO\n+\nO"
    },
    {
      "category": "Resource",
      "title": "Introduction to Organic Synthesis: The Diels-Alder Reaction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/e8ac36ca55ffdeafa8769e17be2c0efe_MIT5_37s09_lec01_Handout.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMassachusetts Institute of Technology\nOrganic Chemistry 5.37\nApril 16, 2008\nProf. Rick L. Danheiser\nLecture 1\nIntroduction to Organic Synthesis\nThe Diels-Alder Reaction\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E R' Z\nR' Z\nRE\nRZ\nR' E\nR1\nR2\nEWG\nOur results will play a role not only in the discussion of\ntheoretically interesting questions . . . . but probably also\nwill yield greater significance in a practical sense. Thus\nit appears to us that the possibility of synthesis of\ncomplex compounds related to or identical with natural\nproducts such as terpenes, sesquiterpenes, perhaps\nalso alkaloids, has been moved to the near prospect.\n. . . . . We explicitly reserve for ourselves the\napplication of the reaction discovered by us to the\nsolution of such problems.\nOtto Diels\nOtto Diels and Kurt Alder Justus Liebigs Annalen der Chemie 460, 98 (1928)\nKurt Alder\nFor Additional Reading . . . .\n(1) \"Advanced Organic Chemistry, Part A: Structure and Mechanisms\", Fifth Edition, by F. A. Carey\nand R. J. Sundberg, Springer, 2007, Chapter 10 (\"Concerted Pericyclic Reactions\"), pp 833-873.\n(2) \"Advanced Organic Chemistry, Part B: Reactions and Synthesis\", Fifth Edition, by F. A. Carey\nand R. J. Sundberg, Springer, 2007, Chapter 6 (\"Concerted Cycloadditions, Unimolecular\nRearrangements, and Thermal Eliminations\"), pp 473-526.\n(3) \"Organic Chemistry\" by J. Clayden, N. Greeves, S. Warren, and P. Wothers, Oxford University\nPress, 2001, Chapter 35 (\"Pericyclic Reactions I: Cycloadditions\"), pp 905-924 and Chapter 45\n(\"Asymmetric Synthesis\"), pp 1217-1232.\n\nStrategy\nTactics\noverall plan to achieve the\nultimate synthetic target\nintellectual\nretrosynthetic planning\nTRANSFORMS\nmeans by which plan\nis implemented\nexperimental\nsynthetic execution\nREACTIONS\nTarget\nPrecursor\nPrecursor\nTarget\nStrategies for the Assembly of Cyclic Compounds\nCyclization\nAnnulation\nConcerted Cycloadditions\nNon-Concerted \"Single-Operation\" Annulations\nMultistep Annulation Strategies\n\nGeneral Principles of Retrosynthetic Analysis\nThe first principle of retrosynthetic planning:\nconvergent strategies are the most\nefficient strategies for the assembly of\ncomplex molecules\nThe Power of Convergent Synthesis\nMolecular\nComplexity\n(Mwt)\n10 g\n10 g\n10 g\n13.1 g\n17.0 g\n21.9 g\n27.8 g\n34.7 g\n42.6 g\n7.1 g\n7.1 g\n7.1 g\n7.1 g\n50.7 g\n8.5 g\n8.5 g\n57.9 g\n9.7 g\n9.7 g\n62.1 g\n10.4 g\n10.4 g\n5.1 g\n5.1 g\n5.1 g\n5.1 g\n# Steps\nStarting\nMaterials\n62.1 g\n20.8 g\n20.4 g\nSolvent\n@10 mL/g SM for\neach step\n3278 mL\ncalculations based on 70% yield per step\n714 mL\n346 mL\n\nThe \"Discovery\" of the Diels- Alder Reaction\n\"Tragt man in eine Suspension von 1 Mol. Maleinsaure-anhydrid in der 5 fachen Menge von reinem Benzol\nunter Kuhlung allmahlich 1 Mol. Cyclopentadien ein, so reagieren die Komponenten augenblicklich unter\nstarker Warmentwicklung. Das Maleinsaure-anhydrid geht in Losung, und schon wahrend des Prozesses\nscheidet sich das Anhydrid der neuen Saure in schneeweissen, glanzenden Krystallen ab. Die Ausbeute ist\nnahezu quantitativ.\"\nOtto Diels and Kurt Alder Justus Liebigs Annalen der Chemie 460, 98 (1928)\nO\nO\nO\nO\nO\nO\n+\nbenzene, 10 °C\n100%\nR. B. Woodward\n1917-1979\nMIT B.S. 1936\nMIT Ph.D. 1937"
    },
    {
      "category": "Resource",
      "title": "Introduction to Organic Synthesis: The Diels-Alder Reaction, Part III",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/47047939a908f6d4b385dd5baca8c7a5_MIT5_37s09_lec03_Handout.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMassachusetts Institute of Technology\nOrganic Chemistry 5.37\nApril 23, 2008\nProf. Rick L. Danheiser\nLecture 3\nIntroduction to Organic Synthesis\nThe Diels-Alder Reaction, Part III\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E R' Z\nR' Z\nRE\nRZ\nR' E\nR1\nR2\nEWG\nThe Diels-Alder Reaction\nIf one chemical reaction had to be selected from all\nthose in the repertoire of synthetic organic chemists\nas\nthe\nmost\nuseful\nand\npowerful\nsynthetic\nconstruction, it was clear by 1970 that the Diels-Alder\nreaction would be the logical choice. Its application\nnot only leads to a strong increase in molecular\ncomplexity (molecular size, topology, stereochemistry,\nfunctionality, and appendages), but also can result in\nstructures\nthat\nlend\nthemselves\nto\nadditional\namplification of complexity by the use of other\npowerful synthetic reactions.\nE. J. Corey Angew. Chem. Int. Ed. 2002, 41, 1650\n\nIntrinsic Stereoselectivity\nSuprafacial with respect to the diene\nSuprafacial with respect to the dienophile\nAlder endo rule\nAsymmetric Induction\nSubstrate control by chiral dienophiles\nSubstrate control by chiral dienes\nStereocontrol via chiral auxiliaries\nCatalytic Asymmetric Cycloadditions\nHO\nOH\nOH\nCO2H\nProstaglandin F2α\n\nOH\nCO2H\nHO\nHO\nCase Study\nTotal Synthesis of Prostaglandins\nCorey, E. J.; Weinshenker, N. M.; Schaaf, T. K.;\nHuber, W. J. Am. Chem. Soc. 1969, 91, 5675\nProstaglandin F2α\nNaH, THF;\nCH2OMe\nMeOCH2Cl\n-55 °C\nCO2H\nCN\nHO\nOMe\nCl\nMeO\nCl\nH\ncat. Cu(BF4)2\n0 °C\nKey Subtarget\n(5 equiv)\nCN\nNaOH\nH2O\nMeO\nMeO\nKOH\nH\nH\naq DMSO\n1.25 equiv m-CPBA\n30 °C 14 h\nNaHCO3\nCH2Cl2\n80%\nO\nWhat is the mechanism of this hydrolysis?\nO\n95%\nO\nSee C. S. Shiner et al. Tetrahedron Lett.\n1983, 24, 5687"
    },
    {
      "category": "Resource",
      "title": "Introduction to Organic Synthesis: The Diels-Alder Reaction, Part IV",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/ce44c7be7d5b373dbefadac93cb62d92_MIT5_37s09_lec04_Handout.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nMassachusetts Institute of Technology\nOrganic Chemistry 5.37\nApril 25, 2008\nProf. Rick L. Danheiser\nLecture 4\nIntroduction to Organic Synthesis\nThe Diels-Alder Reaction, Part IV\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E R' Z\nR' Z\nRE\nRZ\nR' E\nR1\nR2\nEWG\n\nStereochemical Course of the Diels-Alder Reaction\nSuprafacial with respect to the diene\nSuprafacial with respect to the dienophile\nAlder endo rule\nIntrinsic Stereoselectivity\nAsymmetric Induction\nSubstrate control by chiral dienophiles\nSubstrate control by chiral dienes\nStereocontrol via chiral auxiliaries\nCatalytic Asymmetric Cycloadditions\nCase Study\nTotal Synthesis of Prostaglandins\nCorey, E. J.; Weinshenker, N. M.; Schaaf, T. K.; Huber, W. J. Am. Chem. Soc. 1969, 91, 5675\nOH\nCO2H\nHO\nCO2H\nHO\nOMe\nHO\nKey Subtarget\nProstaglandin F2α\nControlling the Relative Stereochemistry\nIn the previous lecture, we saw how Corey's synthesis of prostaglandin F2α exploits\ntwo of the stereochemical features of the Diels-Alder reaction:\nthe intrinsic stereoselectivity (suprafacial addition with respect to the diene)\nasymmetric induction (substrate control by the diene)\nControlling the Absolute Stereochemistry\nApproach I: Resolution\nCorey, E. J.; Schaaf, T. K.; Huber, W.; Koelliker, U.; Weinshenker, N. M.\nJ. Am. Chem. Soc. 1970, 92, 397\n\nControlling the Absolute Stereochemistry\nApproach II: Chiral Auxiliaries\nCorey, E. J.; Ensley, H. E.\nJ. Am. Chem. Soc. 1975, 97, 6908\nH\nBnO\nH\nBnO\nH\n2.5 equiv\nO\nOCH2Ph\nPh\nH\n+\nCO2R*\nO\nCH2Cl2, -55 °C\nCO2R*\nprepared in 4 steps\n97:3 ratio\nfrom (-)-pulegone\nmajor cycloadduct isolated in 89% yield\nalso obtained 7% exo cycloadducts\n0.7 equiv AlCl3\n1) LDA, O2;\nH\nthen P(OEt)3\nBnO\n2) LiAlH4\n3) NaIO4\nOH\nO\n(-)-Pulegone\n(-)-Menthol\nO\nPeppermint\n\"The Worlds's Oldest Medicine\"\n\nApproach III: Catalytic Asymmetric Diels-Alder Reactions\nExample 1: Corey's \"Stein\" (\"Stilbene Diamine\") Catalyst\nCorey, E. J.; Imwinkelried, R.; Pikul, S.; Xiang, Y. B. J. Am. Chem. Soc. 1989, 111, 5493\nCorey, E. J.; Imai, N.; Pikul, S. Tetrahedron Lett. 1991, 32, 7517\nCorey, E. J.; Sarshar, S.; Bordner, J. J. Am. Chem. Soc. 1992, 114, 7938\n? equiv\nBnO\nH\nH\nO\nN\nBnO\nH\nO\nOCH2Ph\nO\nN\nH\nO\n+\nO\nO\nPh\nPh\nO\nN\n0.1 equiv\nN\nO\nN\nSO2CF3\nO\nF3CO2S\nAl\nMe (prepared in 7 steps)\nCH2Cl2, -78 °C, 18 h\n98:2 ratio (96% ee)\nmajor cycloadduct isolated in 93% yield\nH\nCO2Et\nH\n1) LiOH, aq H2O2\nBnO\n2) MsOH, EtOH\nHC(OEt)3\n\nApproach III: Catalytic Asymmetric Diels-Alder Reactions\nExample 2: Yamamoto's \"CAB\" (\"Chiral Acyloxy Borane\") Catalyst\nIshihara, K.; Gao, Q.; Yamamoto, H. J. Org. Chem. 1993, 58, 6917\nFuruta, K.; Gao, Q.-Z.; Yamamoto, H. Org. Synth. 1995, 72, 86\nFuruta, K.; Shimizu, S.; Miwa, Y.; Yamamoto, H. J. Org. Chem. 1989, 54, 1481\nFuruta, K.; Miwa, Y.; Iwanaga, K.; Yamamoto, H. J. Am. Chem. Soc. 1988, 110, 6254\nO\nBH\nO\nO\nHO2C\nO\nO\nR\n4 equiv\nCHO\nBr\n0.1 equiv CAB\nCHO +\nBr\nBr\nCHO\nCH2Cl2, -78 °C, 10 h\n97.5:2.5 ratio (95% ee)\n100% yield\n94:6 exo/endo cycloadducts\nCorey, E. J.; Loh, T.-P. J. Am. Chem. Soc. 1991, 113, 8966\nBnO\nH\n1) NH2OH-HCl, aq THF, pH 4\nBnO\nH\n2) TsCl, pyr\n3) NaOH, H2O\nCHO\nBr\nO"
    },
    {
      "category": "Resource",
      "title": "The Diels-Alder Reaction",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/87c56840a5b6938d935234521af16119_MIT5_37s09_lec01_Mod7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChemistry 5.37\nThe Diels-Alder Reaction\n(Adapted from 2008 Lecture Given by\nProfessor Rick Danheiser)\nMassachusetts Institute of Technology\nProfessor Timothy M. Swager\nApril 7, 2009!\nStrategies and Tactics in Organic Synthesis!\nStrategy\noverall plan to achieve the\nultimate synthetic target\nintellectual\nretrosynthetic planning\nTRANSFORMS\nTactics\nmeans by which plan\nis implemented\nexperimental\nsynthetic execution\nREACTIONS\nTarget\nPrecursor\nPrecursor\nTarget\n\nEfficiency and Selectivity in Organic Synthesis!\nEfficiency\nSelectivity\n!\" Stereoselectivity!\n!\" Regioselectivity!\n!\" Chemoselectivity!\nStrategic Efficiency!\n!\" Minimum # Steps!\n!\" Convergence!\nTactical Efficiency!\n!\" High Yield!\n!\" Atom Economy!\nEfficiency and Selectivity in Organic Synthesis!\n10 g\n13.1 g\n17.0 g\n21.9 g\n27.8 g\n34.7 g\n42.6 g\n10 g\n7.1 g\n7.1 g\n8.5 g\n8.5 g\n9.7 g\n9.7 g\n10 g\n7.1 g\n7.1 g\n5.1 g\n5.1 g\nMolecular\nComplexity\n(Mwt)\n# Steps\nStarting\nMaterials\nSolvent\n62.1 g\n20.8 g\n20.4 g\n3278 mL\n714 mL\n346 mL\n50.7 g\n57.9 g\n62.1 g\n10.4 g\n10.4 g\n5.1 g\n5.1 g\n@10 mL/g SM for\neach step\ncalculations based on 70% yield per step\nThe Power\"\nof\"\nConvergent\"\nSynthesis!\n\nConcerted Cycloadditions\nNon-Concerted \"Single-Operation\" Annulations\nMultistep Annulation Strategies\nAnnulation\nCyclization\nStrate gie s fo r the Asse mbly o f Cyclic Co mpo unds\nThe first principle of\nretrosynthetic planning:\nconvergent strategies are\nthe most efficient strategies\nfor the assembly of complex\nmolecules\nEfficiency and Selectivity in Organic Synthesis!\nEfficiency\nStrategic Efficiency!\n!\" Minimum # Steps!\n!\" Convergence!\nTactical Efficiency!\n!\" High Yield!\n!\" Atom Economy!\nCycloaddition\nand\nAnnulation\nStrategies\n\nThe Diels-Alder Reaction\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E R'Z\nR'Z\nRE\nRZ\nR'E\nR1\nR2\nEWG\nThe single most powerful ring-forming\nreaction in the arsenal of organic\nThe Diels-Alder Reaction!\nO\nO\nO\nO\nO\nO\n+\nbenzene, 10 °C\n100%\n\"Tragt man in eine Suspension von 1 Mol. Maleinsaure-anhydrid in der 5 fachen\nMenge von reinem Benzol unter Kuhlung allmahlich 1 Mol. Cyclopentadien ein, so\nreagieren die Komponenten augenblicklich unter starker Warmentwicklung. Das\nMaleinsaure-anhydrid geht in Losung, und schon wahrend des Prozesses scheidet\nsich das Anhydrid der neuen Saure in schneeweissen, glanzenden Krystallen ab.\nDie Ausbeute ist nahezu quantitativ.\"!\nOtto Diels and Kurt Alder Justus Liebigs Annalen der Chemie 460, 98 (1928)!\nReaction Conditions\n\nThe Diels-Alder Reaction!\nRegiochemical Course of the Reaction (R= alkyl)\n+\n+\nnot\nnot\n\"ortho\"\n\"para\"\n\"meta\"\n\"meta\"\nEWG\nEWG\nR\nR\nR\nEWG\nEWG\nR\nR\nR\nEWG\nEWG\nThe Diels-Alder Reaction!\nStereochemical Course of the Reaction\nIntrinsic Stereoselectivity!\n! Suprafacial with respect to the diene!\n! Suprafacial with respect to the dienophile!\n! Alder endo rule!\nAsymmetric Induction!\n! Substrate control by chiral dienophiles!\n! Substrate control by chiral dienes!\n! Stereocontrol via chiral auxiliaries!\nCatalytic Asymmetric Cycloadditions!\n\nCHO\n+\n10 mol% CAB\nCH2Cl2\n-78 °C\nCHO\nCH3\n+\nCH3\nCHO\n+\n+\nCHO\nCH3\nCH3\nCHO\nexo 2(R)\nendo 2(S)\nexo 2(S)\nendo 2(R)\nModule 7 Catalytic Asymmetric Diels-Alder Reaction\nO\nBH\nO\nO\nHO2C\nO\nO\nMeO\nOMe\nYamamoto's\nCAB catalyst\nThe Diels-Alder Reaction\nStereochemical Course of the Reaction\nE\nE\nZ\nE\ncis\ntrans\nR\nH\nH\nR\nEWG\nEWG\nEWG\nEWG\nR\nH\nH\nR\nEWG\nEWG\nR\nR\nH\nH\nR\nH\nH\nR\nEWG\nEWG\nR\nH\nR\nH\nEWG\nEWG\nEWG\nEWG\nH\nR\nH\nR\nSuprafacial with respect to the diene component\n\nThe Diels-Alder Reaction\nStereochemical Course of the Reaction\nThe Alder Endo Rule\nRE\nEWG\nRZ\nH\nEWG\nH\nRE\nRZ\nRE\nRZ\nEWG\nH\nRE\nH\nRZ\nEWG\nH\nEWG\nRE\nRZ\nRE\nRZ\nH\nEWG\nExo\nAddition\nThe Diels-Alder Reaction\nStereochemical Course of the Reaction\nThe Alder Endo Rule\nThis is an exo Diels-Alder adduct\nThis is an endo Diels-Alder adduct\nO\nO\nO\nO\nO\nH\nH\nO\nO\nH\nH\nThe term \"endo\" originates in the terminology used to\ndescribe the stereochemistry of substituents on bicyclic\nring systems. A substituent is said to be endo when it is\ntrans to the smaller of the two bridges; an exo substituent\nis cis to the smaller bridge.!\nthis bridge\nhas 1 carbon\nthis bridge\nhas 2 carbons\nREXO\nRENDO\n\nThe Diels-Alder Reaction\nExceptions to the Alder Endo Rule\nCHO\n+\nCHO\nCH3\n+\nCH3\nCHO\nmajor\nminor\nThe Diels-Alder Reaction\nIntrinsic Stereoselectivity\nPredict the products\nof these\nDiels-Alder\ncycloadditions\n+\nMeO\nCH3\nCHO\n+\nCHO\nCH3\n+\nO\nO\n\nThe Diels-Alder Reaction\nIntrinsic Stereoselectivity\n+\nMeO\nCH3\nCHO\n+\nCHO\nCH3\n+\nO\nO\nMeO\nCH3\nCHO\nThe Diels-Alder Reaction\nIntrinsic Stereoselectivity\n+\nMeO\nCH3\nCHO\n+\nCHO\nCH3\n+\nO\nO\nMeO\nCH3\nCHO\nH\nCHO\n\nThe Diels-Alder Reaction\nIntrinsic Stereoselectivity\n+\nMeO\nCH3\nCHO\n+\nCHO\nCH3\n+\nO\nO\nMeO\nCH3\nCHO\nH\nCHO\nO\nO\nCH3 H\nH\nThe Diels-Alder Reaction\nIntrinsic Stereoselectivity\n+\nMeO\nCH3\nCHO\n+\nCHO\nCH3\n+\nO\nO\nMeO\nCH3\nCHO\nH\nCHO\nO\nO\nCH3 H\nH\n\nThe Diels-Alder Reaction\nStereochemical Course of the Reaction\nIntrinsic Stereoselectivity!\n! Suprafacial with respect to the diene!\n! Suprafacial with respect to the dienophile!\n! Alder endo rule!\nAsymmetric Induction!\n! Substrate control by chiral dienophiles!\n! Substrate control by chiral dienes!\n! Stereocontrol via chiral auxiliaries!\nCatalytic Asymmetric Cycloadditions!"
    },
    {
      "category": "Resource",
      "title": "The Invention of Cycloaddition and Annulation Strategies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/a0b04cdcbad03de7695b0e977fb40de9_MIT5_37s09_lec05_PPT.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nChemistry 5.37\nLecture 5\nThe Invention of\nCycloaddition and Annulation Strategies\nMassachusetts Institute of Technology\nProfessor Rick L. Danheiser\nMay 12, 2008\nThe Diels-Alder Reaction\nHistorical Background\n\" . . . . I consider the teaching and study of\nthe historical development of science as\nindispensable . . . . Our textbooks fail in this\nrespect . . . . \"\nRichard Willstatter\n\" . . . . Science is not an abstract thing, but rather,\nas a product of human labor, is tightly bound in its\ndevelopment to the particularity and fate of the\nindividuals who dedicate themselves to it.\"\nEmil Fischer\n\nDiscovery and Invention\nAlternate Paths for the Development of\nNew Synthetic Methods\nDiscovery:\nto find something not\npreviously known\nInvention:\nderiving from a deliberate attempt\nto solve a problem\nThe Diels-Alder Reaction\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E\nR'Z\nR'Z\nRE\nRZ\nR'E\nR1\nR2\nEWG\nThe single most powerful ring-forming\nreaction in the arsenal of organic\nchemistry!\n\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E\nR'Z\nR'Z\nRE\nRZ\nR'E\nR1\nR2\nEWG\nR'Z\nRZ\nRE\nR'E\nY\nRE\nRZ\nY\nR'E\nR'Z\n+\n[4 + 1]\nAnnulation\nStrategy\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E\nR'Z\nR'Z\nRE\nRZ\nR'E\nR1\nR2\nEWG\n[3 + 2]\nAnnulation\nStrategy\nR1\nR2\nEWG\nEWG\nR1\nR2\n\nAnnulation Strategies for the Synthesis of\nCarbocyclic and Heterocyclic Compounds\nAnnulation strategies previously developed in our laboratory\nC\nC\nC\nR2\nR3\nSiMe3\nR1\nRE\nR\nRZ\nW\nR1\nSiMe3\nR\nW\nRZ\nRE\nR2\nR3\nRZ\nRE\nR'Z\nClCH2CH2O\nR'E\nR'Z\nRE\nRZ\nR'E\nRZ\nRE\nR'E\nR'Z\nOH\n+\nLiTMP, Et2O\nClCH2OCH2CH2Cl\nn-BuLi\nTHF-Hexane-HMPT\n0 - 25°\nLewis\nacid\n[4+1] Annulation Strategy\nStereocontrolled synthesis of five-\nmembered carbocycles based on\nanion-accelerated\nvinylcyclopropane\nrearrangements\n[3+2] Annulation Strategy\nStereocontrolled synthesis of five-\nmembered carbocycles and\nheterocyclic compounds based\non allenylsilanes and allylsilanes\nReaction of Carbenes with 1,3-Dienes\nPotential Basis for a [4 + 1] Annulation Strategy\nH\nZ\n+\nZ\n\nReaction of Carbenes with 1,3-Dienes\nPotential Basis for a [4 + 1] Annulation Strategy\nH\nZ\n+\nZ\nH\nZ\n+\nZ\nnot\nobserved\nThe Vinylcyclopropane Rearrangement\nPotential Basis for a [4 + 1] Annulation Strategy\nZ\nZ\nH\nZ\n+\n+\n+\n22%\n10%\n68%\n580 °C\n0.1 mmHg\nH\nO\nH\nO\nO\nO\nvapor phase\npyrolysis\n1,3-sigmatropic\nrearrangement\n\nStereocontrolled [4 + 1] Annulation Strategy\nR'Z\nRZ\nRE\nClCH2CH2O\nR'E\nR'Z\nRZ\nRE\nR'E\nRZ\nRE\nR'E\nR'Z\nOH\nLiTMP, Et2O\nClCH2OCH2CH2Cl\n5 equiv n-BuLi\nTHF-Hexane-HMPT\n0 - 50 °C\n45-82%\nR\nR\nOH\nR\nR\nOH\nOH\nOH\nOH\nH\n> 50 : 1\n> 50 : 1\n> 50 : 1\n> 50 : 1\n> 50 : 1\nR= CH2CH2Ph\nAnion-accelerated Vinylcyclopropane Rearrangement\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nRE\nRZ\nEWG\nR1\nR2\nR'E\nR'Z\nR'Z\nRE\nRZ\nR'E\nR1\nR2\nEWG\n[3 + 2]\nAnnulation\nStrategy\nR1\nR2\nEWG\nEWG\nR1\nR2\n+\n\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nO\nEWG\nO\nEWG\nMet\nAllyl Anions\nAllyl Cations\nOxyallyl Anions\nHomoenolate Anions\nVinylcarbenes\nAllylmetal Compounds\nElectrophilic Cyclopropanes\nTrimethylenemethane\nDiradicals\nTrimethylenemethane\nZwitterions\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nMet\n[3 + 2] Annulation Strategy Based on\nAllylmetal Compounds\n\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nMet\nMet\nElectrophilic addition of alkene to\nnucleophilic allylmetal compound\nCarbocation stabilized\nby the ! effect\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nMet\nMet\nMet\nReversible 1,2-shift\nof metal group\n\nInvention of New Annulation Strategies for\nthe Synthesis of Five-Membered Rings\n+\nMet\nMet\nMet\nMet\nRing closure furnishes\nfive-membered ring\nStereocontrolled [3 + 2] Annulation Strategy\nMe\nO\nSiMe3\nO\nO\nO\nO\nH2C\nC\nC\nSiMe3\nCH3\n1 equiv\n1.2 equiv TiCl4, CH2Cl2\n-78 to 0 °C\nTiCl4, CH2Cl2\n89%\n74%\n11.5 : 1 stereoisomers\nH2C\nC\nC\nSi(Oi-Pr)Me2\nCH3\nthen 30% H2O2, KHCO3\nMeOH-THF\n\nStereocontrolled [3 + 2] Annulation Strategy\nApplication to the Synthesis of Five-Membered\nHeterocycles\nH\nR2\nC\nC\nR1\nC\nSiMe3\nX\nY\nX\nY\nC\nR2\nH\nC\nSiMe3\nR1\nX\nY\nC\nSiMe3\nR2\nH\nR1\nX\nY\nR1\nSiMe3\nR2\nH\nX\nY\nR1\nSiMe3\nR2\n+\nX = O, S, NR\nY = N, CR\nStereocontrolled [3 + 2] Annulation Strategy\nApplication to the Synthesis of Five-Membered\nHeterocycles\nC\nC\nC\nSit-BuMe2\nCH3\nH\nHept\nN\nO\nCH3\nBr\nHept\nO\nCH3\nSit-BuMe2\nEt\nPh\nC C C\nSit-BuMe2\nCH3\nH\nEt\nPh\nCl\nO\n80%\nAlCl3, CH2Cl2, -20 °C 1 h\n72%\n1 eq NOBF4, CH3CN, -30 °C;\nthen add Br2, CCl4"
    },
    {
      "category": "Resource",
      "title": "Theory and \"Swager Centric\" Applications",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-37-introduction-to-organic-synthesis-laboratory-spring-2009/353d95add15de8bbde0289eebb0a8d05_MIT5_37s09_lec02_Mod7.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n5.37 Introduction to Organic Synthesis Laboratory\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nThe Diels-Alder Reaction\nLecture 2: Theory and \"Swager Centric\" Applications\nMassachusetts Institute of Technology\nChemistry 5.37\nProfessor Timothy M. Swager\nApril 7, 2009!\nFirst: A Little Review of Simple Bonding!\nH\nH\nH\nH\nMolecular Hydrogen\nIs Stable: Orbital Overlap\nLeads to a Net Lowering of Energy\nMolecular Helium\nIs Unstable: Orbital Overlap\nLeads to a Net Increase In Energy\n(The !* is higher than shown due to\ne-e repulsion)\n!\"\n!*\"\n!\"\n!*\"\nHe\nHe\nHe\nHe\n\nDimerization of Ethylene\n2+2\nThermally Forbidden\n+\nPhotochemically Allowed\nHigher e-e Repulsion\nDimerization of Ethylene\n2+2\nThermally Forbidden\n+\nPhotochemically Allowed\nHigher e-e Repulsion\nh\n\nExample of a Thermally Allowed 2+2\nH2C\nC\nCH2\nCN\n+\nCN\n2+2\nExample of a Thermally Allowed 2+2\nH2C\nC\nCH2\nCN\n+\nCN\n2+2\nBonding in the\nTranisition State\nCN\nH\nH\nH\nH\nAllene HOMO\nAcrylnitrile LUMO\n\nOrbitals of Butadiene and Ethylene\na\na\ns\nRelative Symmetry\nof Orbitals\na\ns\ns\nOrbitals of the Same Symmetry Can Interact\nButadiene HOMO\na\nEthylene LUMO\na\ns\nInteractions of Filled\nand Empty Orbitals is\nStabilizing\nButadiene LUMO\na\nEthylene HOMO\ns\ns\n\nPurturbation Theory:\nOrbitals Closer in Energy, Interact Stronger\nD\nEWG\nD\nEWG\nD\ne-e Repulsion Raises the Occupied Orbitals\nD\nD\nEWG\nEWG\nD\nPurturbation Theory:\nOrbitals Closer in Energy, Interact Stronger\nStrong Bonding\nD\nD\nEWG\nEWG\nD\ne-e Repulsion Raises the Occupied Orbitals\nD\nEWG\nD\nEWGs Lower the LUMO\nEWGs Lower the LUMO\n\nAlder Endo Rule:\nSecondary Orbital Interactions\nSecondary\nOrbital\nInteractions\n+\nO\nO\nO\nO\nO O\nAlder Endo Rule:\nSecondary Orbital Interactions\nSecondary\nOrbital\nInteractions\n+\nO\nO\nO\nO\nO O\n+\n\nDA Reaction in Materials Chemistry\nFeatures:\nOften a Very Clean Reaction\nIt can be a Reversible Reaction\nForms 2 New Bonds at Once\n\nProduces Structurally Rigid Stuctures\nSelf Healing Polymers\nO\nC\nO\nO\nO\nO\nO\n+\nO\nHeat\nN\nO\nN\nN\nCrosslinked Network\nO\nWudl and coworkers\n+\nScience 2002, 295, 1698\nHeat\n\nRetro-DA to Form an Organic Metal\nDA Rxn\nCF3\nCF3\nCF3\nF3C\nLxM=CHR\nRing Opening Metathesis\nPolymerization (ROMP)\nR\nn\nRetro\nDA Rxn\nR\nn\nWittig like\nEndcapping\nR\nn\nCF3\nO\nCF3\nR'\nR'\nCF3\nR'\nLxM\nCF3\nPolyacetlylene\nCF3\nSoluble Polymer\na Conducting Polymer\nCF3\nJames Feast (Durham U.) Cira 1983\nThrough Space �-Interactions\nEox > 2.4 V\nEox = 1.28 V\nDecreasing oxidation potential\nGrimme, Gleiter et al. Angew Chem. Int. Ed. Engl. 1991, 30, 205-207.\nWhat About Double DA Adducts?\nSynthetic Access to New Monomers\n+ X\nX\nX\nX\n\nMonomer and Polymer Synthesis\nO\nTIPS\nO\nO\nO\nO\nO\nO\nTIPS\nO\nO\nTIPS\nanthracene (40 equiv)\nO\nO\no-xylene\nSyn-Syn\nO\n180 oC\nO\nTIPS\nTIPS\n(76% yield)\nO\nTIPS\nO\nAnti-Anti\nO\nO\nO\n(Not Observed!)\nBu\nEt\nO\nN\nO\nTIPS\nn\n1. NH2CH2CH(Et)(Bu), -H2O\nO\n2. Deprotect TBAF\nO O\n3. CuI, benzoquione\nPdCl2(PPh3)2, Et2N\nTIPS\nO\nO\nO\nN\nO\nO\nAnti-Syn\nBu\nEt\nMn= 17,000\n(Not Observed!)\nA. McNeil\nX-ray Crystallography\nO\nO\nO\nTIPS\n=\nTIPS\nO\nO\nO\n\nH\nH\nN\nO\nO\nBu\nEt\nO\nO\nN\nH\nH\nO\nO\nN\nBu\nEt\nBu\nEt\nH\nH\nN\nH\nH\nO\nO\nn-Hex\nn-Hex\nP1\nP2\nP3\nPhotobleaching Studies: Thin Films\nSeconds\nUV Exposure at max\nWith 20nm Slit Width\nMatched Optical\nDensities\nIncreased Stability by\nDesign:\n1. No Reactive -Protons\n2. Stabilized Cations by\nThrough Space\nInteractions\n3. Arene Faces Blocked\n4. 3-D Non-Aggregating\nStructure\nA. McNeil\nZhihua Chen\nPhD 200\nSynthesis of a\nPoly(iptycene) Ladder\nPolymer\n\nPoly(iptycene)\nC8H17\nC8H17\nO\nO\nC8H17\nC8H17\n*\nO\nOCH3\nO\nOCH3\nC8H17\nH3CO\n*\n*\nC8H17\nH3CO\nn\n(Branching agents)\nWudl, F. et al JACS, 2003, 125, 10190\nThomas S. M. et al JACS, 2005,127, 17976\nA simple approach:\ndiene OR\ndienophile\nO\nOR\nTo improve solubility\nSynthesis of Monomer\nO\nOH\nO\nOH\na\nc\n82%\nb\n85%\n63%\nO\nOH\nO\nOH\nOC6H13\nOC6H13\nOC6H13\nd\nBr\ne\nO\n45%\nBr\n76%\nOC6H13\nOC6H13\nOC6H13\nmonomer\nReagents and conditions: (a) (1) NaBH4, MeOH, rt-reflux; (2) HCl, rt. (b) Na2S2O4, p-dioxane, H2O, rt; (c)\nC6H13Br, K2CO3, KI,18-crown-6, DMF, 85 oC; (d) NBS, DMF, rt; (e) furan, THF, PhLi, 0 oC.\n\nSynthesis of Monomer\nO\nOH\nO\nOH\na\nb\nc\n82%\n85%\n63%\nO\nOH\nO\nOH\nOC6H13\nOC6H13\nOC6H13\nd\nBr\ne\nO\n45%\nBr\n76%\nOC6H13\nOC6H13\nOC6H13\nPhLi\nDA\nOC6H13\nOC6H13\nLi\nO\nBr\nOC6H13\nOC6H13\nHigh Energy \"Alkene\"\nis the Dieneophile\nDifferential Scanning Calorimetry\noC\nHeat Flow (w/g)\nExotherm: Down\nSample after DSC study:\nMn=2.8KDa, PDI =2.8\nSecond heating\nFirst Heating\n35 KJ/mol\n111 KJ/mol\noC\n-1\nTemperature (\noC)\nThermal Neat Polymerization:\nOC6H13\nneat, 170 oC\nO\nOR\nO\n72 h\nn\nOC6H13\nRO\nR = n-C6H13\nLow MW!\nMn = 5~6 KDa\n\nDifferential Scanning Calorimetry\noC\nHeat Flow (w/g)\nExotherm: Down\nSample after DSC study:\nMn=2.8KDa, PDI =2.8\nSecond heating\nFirst Heating\n35 KJ/mol\n111 KJ/mol\noC\nThermal Neat Polymerization:\n-1\nDiels-Alder reactions can be\naccelerated by the application\noC)\nTemperature (\nof high pressure, because the\ntransition state of D-A reaction\nOC6H13\nneat, 170 oC\nO\nOR\nhas a net contraction in\nvolume.\nO\n72 h\nV++ = -RT(lnk/P)T\nn\nOC6H13\nRO\nR = n-C6H13\nLow MW!\nMn = 5~6 KDa\nSynthesis of Poly(iptycene) Dehydration Reaction\nO\nOR\npyridinium\nOR\np-toluenesulfonate\nacetic anhydride,\nRO\nn\n140 oC\nRO\nn\nR = n-C6H13\nR = n-C6H13\nP1\nP2\nSummary of the synthesis of P1 and P2\nP1\nP2\n[M]a\nTemperature\nTime\nPressure\nentry\n(M)\n(oC)\n(h)\n(psi)\nMn\nb\nPDI\nMn\nb\nPDI\n(Da)\n(Da)\n0.50\n128,900\n6,100\n2.2\nn/a\nn/a\n0.88\n139,600\n9,400\n2.7\n10,900\n2.4\n1.01\n145,800\n11,100\n3.3\n12,600\n2.6\n1.50\n145,800\n16,400\n3.6\n16,300\n2.5\na Monomer concentration. b Molecular weights determined by GPC in THF against polystyrene standards.\n\nDimethylene Cyclobutene\n- 3,4-Bismethylenecyclobutene (3,4-BMCB) is an isomer of benzene produced\nby flash vacuum pyrolysis of 1,5-hexadiyne\n- Reactivity and electronic structure largely influenced by energetic cost of\nantiaromatic cyclobutadiene formation\n- For this reason, s-cis diene formed by exocyclic methylene groups is not reactive\nin Diels-Alder chemistry\n0.616 ± 0.002 D\nColler, Aust. J. Chem., 1968, 21, 1807.\nC\nC\n375°C\nLadder Polymers\n- Polymers consisting of cyclic subunits connected by two links that\ndo not merge or cross\n- Molecular weight remains constant when one bond is broken\n- Potential for high-strength materials\n- Difficulty of synthesis and processing prevented first generation\nladder polymers from gaining industrial importance\n- Two main obstacles to ladder polymer synthesis\n- Rigid backbone leads to inherent insolubility\n- Side reactions can lead to cross-linking and defects\nn\nSchluter, A.D. Materials Science and Technology., 1999, 20, 459.\n\n- Used 1,3-diphenylisobenzofuran as diene\n- Reaction with maleic anhydride\nDiels-Alder of 3,4-Bis(methylene)cyclobutene\nO\nPh\nPh\nH\nH\nO\nO\nO\n+\nO\nPh\nPh\nH\nH\nO\nO\nO\nH\nH\nreflux\nPhCH3\n25 (endo)\n:\n1 (exo)\nwhite crystals\nwhite crystals\nO\nPh\nPh\n+\nO\nroom temp.\nPhCH3\nPh\nPh\nH\nH\nO\nPh\nPh\nH\nH\nBecca Parkhurst\nTowards Conjugated Ladder Polymers\n- Using an electron-withdrawing group as \"X\" sould increase\nreactivity towards DA reactions\nX\nX\nX\nX\nR\nR\nR\nR\nX\nX\nR\nR\nX\nX\ninitiation\nn\nX\nX\nR\nR\nX\nX\nn\n-(HX)\nn\nBecca Parkhurst\n\nDiels Alder Reaction\nThe most powerful reaction in organic chemistry\nStereochemistry\nMultiple bonds produced\nProducts with confomational rigidity\nHigh yeild and reversible\nApplications in synthesis, from nature product\nsynthesis to materials science"
    }
  ]
}