{
  "course_name": "Introduction to World Music",
  "course_description": "This course is an introduction to diverse musical traditions of the world. Music from a wide range of geographical areas is studied in terms of structure, performance practice, social use, aesthetics, and cross-cultural contact. Course work includes hands-on music making, live demonstrations by guest artists, and ethnographic research projects.",
  "topics": [
    "Fine Arts",
    "Music",
    "Performance Arts",
    "Dance",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Fine Arts",
    "Music",
    "Performance Arts",
    "Dance",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPlus two required concert outings, outside of class time\n\nCourse Description\n\nThis course introduces selected musical traditions from around the world. We will explore the manner in which these musical traditions are both shaped by and give shape to the cultural settings in which they are performed. Since different musical styles have different structures and meanings, we will need to learn new ways of listening to music. Learning to listen to world music means not just learning to hear \"characteristics of sound,\" but also learning to analyze music from different cultural perspectives.\n\nThis course is organized around familiar cultural themes and scenes, and will feature a selection of major case studies. From a disciplinary standpoint, this course serves as an introduction to ethnomusicology, a discipline that draws upon and interacts with several other fields, including historical musicology, anthropology, sociology, and cultural studies. Overall, this course aims to explore music as a form of human expression and as a meaningful aspect of daily life.\n\nThis course fulfills both\nHumanities, Arts, and Social Sciences--Distribution\n(HASS-D) and\nCommunication Intensive\n(CI-H) requirements for undergraduate degrees. It includes four writing assignments that add up to a minimum of 20 pages (see below for details). Paper 1 will be revised and resubmitted. Students will give two oral presentations during the semester, and significant class time will be devoted to discussion.\n\nThe class size is limited to 25 students.\n\nCourse Requirements\n\nGeneral\n\nStudents are expected to complete weekly listening and reading assignments. Classes will be primarily devoted to in-class listening and discussion, supplemented by guest lecture/demonstrations and performance workshops. These workshops include instruction in Senegalese drumming, Balinese gamelan, and Hindustani music and dance. Please note that lectures and hands-on workshops will cover information beyond the content of your textbook; you are responsible for all information from lectures and workshops, assigned readings and listening, on the exams. Regular attendance of all class meetings is required, as students are expected to actively participate in discussions and other in-class activities. Missing more than three class periods will result in a failing grade for the class. If you miss class due to illness or for personal reasons, please email me to explain your absence. If your illness or other issue is affecting your attendance or performance in class, be sure to contact the counseling deans at Student Support Services.\n\nRequired Listening Materials and Texts\n\nThe required text, packaged with three audio CDs, is:\n\n[Soundscapes] = Shelemay, Kay Kaufman.\nSoundscapes: Exploring Music in a Changing World\n. 2nd ed. W. W. Norton, 2006. ISBN: 9780393167139.\n\nPlease bring your\nSoundscapes\ntextbook to lectures. Some additional required listening and reading materials will also be assigned. You will be responsible for knowing all required listening and reading materials (i.e., on exams).\n\nPapers\n\nFour written assignments are required:\n\na personal musical ethnography\n\na discussion the Ana Moura concert\n\na musical analysis\n\na final essay on a research or ethnographic project\n\nAll papers are to be submitted in hard copy at the beginning of class on the due date. Any work submitted after class will be considered late and may be downgraded for lateness.\n\nOral Presentations\n\nOral presentations are a significant part of the Communication Intensive component of this class. Throughout the semester, students will give short presentations on materials from listening and reading assignments. At the end of the semester, students will give formal oral presentations on their final projects.\n\nTests\n\nTwo exams will be given in class (see dates below); there is no final exam given during finals week. The exams will cover material discussed in class, as well as materials from assigned reading and listening. Occasional quizzes may be given in class throughout the semester.\n\nRequired Outings\n\nStudents are also required to attend two world music concerts that take place outside of class time. If you are unable to make one of the required concert outings, you must contact the professor at least 2 weeks in advance to make alternate arrangements.\n\nGrading\n\nGrades will be calculated as follows:\n\nCOURSEWORKS\n\nPERCENTAGES\n\nPapers 1-3\n\n35%\n\nFinal project (Paper 4 and final presentation)\n\n20%\n\nClass participation and attendance\n\n15%\n\nTwo exams\n\n30%\n\nStudents must receive a passing grade for each component of the course in order to pass the course as a whole. Any student who misses three or more classes will receive a failing grade for attendance, and thus receive a failing grade for the class.\n\nCalendar\n\nSES #\n\nTOPICS\n\nPRIMARY CASE STUDIES\n\nWORKSHOPS And DEMONSTRATIONS\n\nKEY DATES\n\n1-2\n\nIntroduction: What is a Soundscape?\n\nThe concept of soundscapes and its application to the study of world music in North America.\n\nTuvan throat singing (khoomii)\n\n3-4\n\nSound: The Materials of Music\n\nBuilding a cross-cultural musical vocabulary, with attention to quality, pitch, rhythm, and intensity.\n\nPaper 1 due Session 4\n\n5-6\n\nSetting: The study of Local Musics\n\nExploration of a composite \"cityscape,\" the music of greater Boston.\n\nBoston, including musics of ethnic communities; the \"folk music scene\"; the \"early music\" world, and others. Musical instruments and vocal styles.\n\nGuest lecture & demonstration: Cory Pesaturo, accordion\n\n7-9\n\nSignificance: Music's Meaning in Everyday Life (Part I)\n\nThe role of drumming and dance in Senegal, West Africa.\n\nSabar\n\nWorkshop: Senegalese drumming\n\nCatch-up / review\n\nPaper 1 revision due\n\nExam 1\n\nRequired concert: Ana Moura at Berklee Performance Center\n\n13-14\n\nSignificance: Music's Meaning in Everyday Life (Part II)\n\nOccasions of daily life as primary contexts for music making and musical markers of the life cycle.\n\nScottish and Irish Bagpipes\n\nGuest lecture & demonstration: bagpipes\n\n15-17\n\nMusic, Mobility and the Global Marketplace\n\nMaterials, media, and economics of world music. Composing and improvising world music in America. Translocal connections and crossing between soundscapes.\n\nNew music for gamelan\n\nWorkshops: Balinese gamelan and kecak\n\nPaper 2 due Session 15\n\nFinal project proposal due Session 17\n\nRequired concert: MIT Center for Art, Science & Technology\nCAST Marathon\n\nFeatures renowned guest artists Hauschka, Pamela Z., and Dewa Alit performing solo works and with students in MIT's own Gamelan Galak Tika, Glass Lab Orchestra, Lamine Toure and Rambax.\n\nMusic and Dance (Part I)\n\nThe union of music with expressive movement. The dance as rhythm, cultural expression, and popular culture.\n\nPrimary case study: Tango\n\n20-22\n\nMusic and Dance (Part II)\n\nThe union of music with expressive movement. The dance as rhythm, cultural expression, and popular culture.\n\nPrimary case study: Kathak\n\nWorkshops: Hindustani music, Kathak dance\n\nPaper 3 due Session 20\n\nMusic and Politics\n\nMusic in political life, as an instrument of power and symbol of resistance.\n\nPrimary case study: national anthems\n\nExam 2\n\n25-27\n\nFinal presentations\n\nPaper 4 due Session 26\n\nConclusions",
  "files": [
    {
      "category": "Resource",
      "title": "Final project description",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/95bf992626b085ca0fc81afc5531b7ea_MIT21M_030S13_FinalProje.pdf",
      "content": "Intro to World Music\n\n21M030 - Tang\n\nFINAL PROJECT ASSIGNMENT\n\nYour assignment is to work on a final project of your choice (topic to be approved by\nprofessor). Your project will culminate in a group oral presentation (to be given on May\n7, 9, 14), as well as an individual 8-10 page paper (typed, 12-font, double-spaced, single-\nsided, with a title and page numbers) due May 9th.\n\nYour project is open to any topic involving world music, and may be either ethnographic\nin nature, or more research or analysis-based, but will fall under one of the group\ncategories (to be determined in class). The exact length of the oral presentations will\ndepend on the number of people per group.\n\nMETHODOLOGY\n\nAlthough each project will be unique, most will fall under one of two categories (or\nstraddle between the two): ethnographic projects or research papers.\n\nETHNOGRAPHIC PROJECTS\n\nBackground research\nEven if your project is primarily ethnographic in nature, it is always helpful to do some\nbackground research to supplement your ethnographically-acquired data. Use books,\narticles, and recordings available in the Lewis Music Library.\n\nParticipant-observation\nIf you are doing an ethnographic project, you will need to carry out fieldwork by\nattending and observing (and in some cases, participating in) rehearsals and/or\nperformances, taking detailed notes (as you have done for previous assignments.) You\nmay wish to focus primarily on one rehearsal or performance as the central part of your\nproject.\n\nInterviewing\nYou should try to do interviews if at all possible. If you are focusing on a campus/local\ngroup, you may interview friends who participate in that group. Be sure to prepare a list\nof questions before doing an interview. Interviews are best done in person, but\nalternatives include telephone interviews or \"e-mail interviews.\" E-mail interviews\nshould be brief and like a questionnaire.\n\nIntro to World Music\n\n21M030 - Tang\n\nRESEARCH PROJECTS\n\nWritten sources\nYou are required to make use of non-web materials (i.e. books and articles). There are\nmany good resources in the Lewis Music Library (see guide for more detailed\ninformation.)\n\nWeb sources\nYou may refer to sources on the web; however, you should be aware that websites are\nconstantly changing, and that many sources are unreliable.\n\nSound sources\nIf you are doing a research paper on a musical genre or a particular artist, you should\nbecome very familiar with the music through repeated listening. You must have access\nto sound recordings, either through the music library, from the web, or by purchasing a\nrecording. Part of your project must deal with analyzing the sound.\n\nREQUIREMENTS\n\nAll final papers must follow standard format (single-sided, double-spaced, 12-font, Times\nNew Roman, with page numbers and a title). Papers must also cite sources properly,\nwhether books, websites, or interviews. Refer to a style manual (such as the Chicago\nManual of Style or MLA Style Manual) for citation formats.\n\nYour oral presentation is a chance to share your group's work with your classmates. You\nare strongly encouraged to use audio and/or visual samples as part of your presentation,\nor to do a live demonstration, if applicable. You also must make a handout to accompany\nyour presentation, and hand in a hard copy printout of the slides (if you use powerpoint).\nBe SURE to practice your presentation at least SEVERAL times, DAYS before your\npresentation; you will be glad that you did!\n\nThe criteria for evaluation of the oral presentation will be the following:\n\nStructure\n\nLogical organization pattern\n\nPowerful introduction\n\nClear key message\n\nUse of transitions\n\nPowerful conclusion\n\nUse of evidence for support\n\nIntro to World Music\n\n21M030 - Tang\n\nGroup Delivery\n\nTime management\n\nConsistency in Tone\n\nChoreography\n\nTransitions between speakers\n\nUse of Space\n\nVisual Aids\n\nDesign\n\nConsistency\n\nUse\n\nQuestions and Answers\n\nManagement of the process\n\nQuality of the Answers\n\nFINAL PROJECT SCHEDULE\n\nApril 4 - start brainstorming on google doc\n\nApril 9 -- submit preliminary final project proposals [see below]\n\nApril 11 - determine groups in class\n\nMay 7, 9, 14 - FINAL PRESENTATIONS\n\nMay 9 - FINAL PAPER DUE\n\nFINAL PROJECT PROPOSAL\n\nPlease submit a preliminary final project proposal by Tuesday, April 9th. Your proposal\nshould be brief (one page), and will have several components:\n\n1) Project description (a paragraph explaining your specific topic & its scope, as\nwell as how it relates to the larger group.)\n2) Methodology and sources (a paragraph describing how you will go about doing\nyour research, whether by consulting books and CDs, or by attending\nperformances or conducting interviews)\n3) Time line (give a rough estimate of how you will use your time to complete the\nproject - this is especially important for ethnographic projects)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Guide to Participant Observation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/c1263164c6f93b6745f8161d46b6d51a_MIT21M_030S13_paper2Partob.pdf",
      "content": "Guide to Participant Observation\nKeep in mind the following questions as you observe and participate in musical events\nyou wish to document:\n1. What, when and where is the musical performance? Are there markers ofthe\nbeginning and ending of the event? Is there any explicit conceptual framework shaping\nthe performance that is articulated through an announcement or in a printed program?\nAre there implicit concepts or information shared by the performers and listeners? (Be\naware of what you are assuming.)\n2. What are important characteristics of the performance space? (It might be helpful to\ndraw a diagram.) Where were you sitting/standing? How does the musical performance\nrelated to or use this space? How do the performers move about this space?\n3. Who are the performers? Are they amateurs or professionals? What is their age,\ngender, and ethnicity? How are they dressed? What information do they provide about\nthemselves through the program, their speech or their behavior?\n4. Who is present and/or listening to the music? (Does the audience consist ONLY of\nstudents?) Are there any noteworthy aspects oftheir response? Is it possible to tell what\nspecifically pleases or displeases the listeners?\n5. What are the performing forces? Are there musical instruments? Are there singers\nand/or dancers? How are they arranged? Are there any noteworthy physical\ncharacteristics ofthe instruments (or the performers, for that matter)? Are the performers\nusing any noteworthy playing techniques or postures? If a voice or voices are included\nhow does the vocal style compare with others you have heard? How do the performers\ncommunicate with and relate to each other?\n6. What are important aspects of the performance practice? Did the musicians use music\nnotation? Did there seem to be improvisation? Did anybody play a \"leading\" role in the\nperformance, or did the performers play seemingly \"equal\" roles?\n7. Did you speak to anyone during the performance or overhear any comments that\nmight be of interest? Did the performers make formal remarks or spontaneous\ncomments? Can you recall any verbatim remarks?\n8. Was there any particularly notable moment or incident that gave you insight into\naspects ofaesthetics or musical meaning?\n9. Were there moments at which your own background or expectations led you to be\nconfused or surprised? Were there things you expected to observe but did not encounter?\n\nYour observations will necessarily be selective. Keep in mind that there is no one\n\"natural\" or \"correct\" way to write about an event; different, personal descriptions ofthe\nsame event are imminent, and important to our overall understanding ofthe event.\nIfyou take notes discreetly before, during, or after the perfonnance, try to record'\ninformation that will help you remember key aspects ofthe musical event. Jot down\nconcrete details and verbatim quotes. These \"jottings\" will likely be rather sketchy,\ndisjointed and full of abbreviations. Be sure to sit down as soon as possible after the\nperformance and expand upon these sketchy notes, constructing a fuller account.\n.Warning: If you wait more than twenty-four hours, you may forget important details. As\nyou amend and expand the brief notes you made during the performance, try to remember\nthings you saw or heard that you had not written down. (Some ethnographers refer to\nthese remembered observations as \"headnotes.\") Be sure to allow enough time to\ndocument your observations in detail; it can take more time to write up an event than it\ndoes to observe it.\n.\nYour field notes from this performance will become the primary source for your essay.\nHopefully, they will provide a rich source both for helping you develop your thesis and\nfor providing much (ifnot all) ofyour supporting evidence. Thus, it is important that you\ndo as thorough a job as possible in observing and recording what you see, hear and feel\nbefore, during, and after the event.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper #1 description",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/3a4a405f71f1dd779a6ee6035d0aaf67_MIT21M_030S13_paper1.pdf",
      "content": "21M.030\nIntro to World Music\nProf. tang\nFIRST PAPER ASSIGNMENT\nOn page xliii of Soundscapes, Shelemay defines 'musical ethnography' as a description\nand interpretation of a music culture. Taking a cue from the social sciences,\nethnomusicologists have developed tools for musically-oriented \"participant\nobservation,\" a common form of anthropological fieldwork. Typically, a researcher\nspends extensive time living within a community, immersing him/herself in that musical\nculture. Historically, this type of research was done by outsiders, and the 'year in the\nfield' is still a rite of passage for aspiring ethnomusicologists. More recently, however,\nmuch work has been done by 'insiders,' indigenous members of a society, who apply\nacademic tools to their own music.\nWe all thus already have a vast experience as participant/observers: we have all lived\nwithin our own musical culture. Your first paper is to make an attempt at musical\nethnography by giving an account of your own musical life and culture. Using the\nbrief description on page xliii, and keeping in mind the overall rubric of setting, sound,\nand significance, analyze how music was and is used in your life, by you, your family,\nyour community. Talk about the musical traditions in your life, both those that were\nexplicitly construed as such and those which took on this function without being named.\nSome general areas to consider are:\n1) Context - where music was found, how it was used - this can include everything\nfrom organized musical activities to passive, background listening.\n2) Ideas about music - approved and disapproved usage, etc.\n3) Social organization - both of the music itself and what it tells you about the\nculture\nYour paper should be 4-5 pages long, typed, 12 font Times New Roman, single-sided,\nand double-spaced with standard margins (1\" top and bottom - 1.25 left and right). It\nshould also have an original title and page numbers. As with all good papers, your paper\nshould have a clear and interesting THESIS.\nThe paper is due at the beginning of class on THURSDAY, Feb. 14. You must hand in a\nhard copy of your paper. Electronic versions of the paper will only be accepted after\nconsultation with the professor. Late papers will be downgraded accordingly.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper #2 description",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/d8e0217fed15e14c44335d4a7c986734_MIT21M_030S13_paper2.pdf",
      "content": "Intro to World Music\n21M.030 - Tang\nSECOND PAPER ASSIGNMENT\nYour assignment is to write an ethnographic description of the Ana Moura concert on\nSaturday, March 16, at 8:00pm. [See details below.] If you are unable to attend this\nconcert and have not notified the instructor yet, please do so immediately to arrange for\nan alternate event.\nYour paper should be 4-5 pages long, typed, 12 font Times New Roman, single-sided,\nand double-spaced with standard margins (1\" top and bottom - 1.25 left and right). It\nshould also have an original title and page numbers. As with all good papers, your paper\nshould have a clear and interesting THESIS.\nBefore the performance, read the \"Guidelines for Participant Observation\" handout. It\nwill help you to carry out a careful observation. Be sure to take good notes during the\nevent, as these notes will be the primary resource for your paper.\nA word of advice: the sooner you write this paper, the better it will be. Do yourself a\nfavor and write at least a rough draft of the paper within 48 hours of the performance;\nyou will be glad that you did.\nThe paper is due at the beginning of class on Thursday, March 21st. There will be no\nrewrites for this paper. You must hand in a hard copy of your paper. Electronic versions\nof the paper will only be accepted after consultation with the instructor. Late papers will\nbe downgraded accordingly.\nPlease note that the concert is reserved seating; tickets have been purchased through the\ngenerous funding of the Council for the Arts and the Music and Theater Arts Section, and\nwill be handed out in class this week.\n* * * * * * * * *\nAna Moura\nFrom Portugal\nSaturday, March 16, 8:00 PM\nBerklee Performance Center\n136 Massachusetts Ave\nBoston, 02115\nPortuguese vocalist Ana Moura has emerged as a leading voice of traditional fado with her captivating\ninterpretations of her country's soulful answer to the blues. With a luxuriant voice and captivating stage\npresence, Moura has taken the art form in new directions and will be backed by Portuguese guitar, acoustic\nguitar, double bass, keyboards and drums.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Cross-cultural musical vocabulary handout",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/d572c28fc2553ce10948b5fef3e34bc5_MIT21M_030S13_read_vocab.pdf",
      "content": "Building a cross-cultural musical vocabulary\n\nethnomusicology\nfieldwork\nparticipant-observation\nethnography\n\nsoundscape = sound, setting and significance of a musical event\n\n4 characteristics of sound:\nquality (color, timbre)\npitch\nduration\nintensity\ntexture -\npolyphonic\nheterophonic\nmonophonic\nhomophonic\npolyrhythmic\nmelody\nharmony\nconjunct/disjunct motion\nform\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Listening guide",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/8af86ec7c48ba70e22026d9f02a3248c_MIT21M_030S13_listnsabar.pdf",
      "content": "mbeng\n(i.e.\nProf. Tang\nListening Guide: SENEGAL\nDoudou Ndiaye Rose, Djabote, Track 3, \"Rose Rhythm\" (Real World, 1994.)\n.\nBeginning\nSolo improvisation on the gorong yeguel\n0:17\nDrummers start tapping their sticks, keeping time [jek, jek jek jek]\n0:19\nAccompaniment parts join in, playing Kaolack. Listen for the mbeng\ntalmbat (bass drum accompaniment.)\n0:42\nThe rest of the ensemble enters, playing the signature\n(\"Rose\nrhythm\") in unison. [Chaw raw rwan gin, chaw raw rwan gin gin gin gin\ngin gin gin gin gin gin gin\n3:09\nThe\nends, and the ensemble turns to a shorter repeated rhythm\n[gin gin gin]\n3:37\nGorong yeguel solos above the texture created by the rest of the ensemble\n4:12\nAll drummers play in unison for the closing\nAlioune Mbaye Nder, Nder et Ie Setsima Group, Track 3 \"Leneen.\" (CD 998011).\nThis is an example of a typical slow mbalax song. The text is about love (\"love is\nsomething else\"), and the importance of respecting women. Listen for the Kaolack\naccompaniment part\n\"mbalax\") which is played on the sabars throughout the song, as\nwell as a\nthat appears at 2: 15 and 3:44, punctuating the ends of sections.\nmbeng playing Kaolack [te tan pax - gin (gin)] J3 .13 j)\nas well as the\n'\"'\n...... ,,]\n(i.e.\n(i.e.\n\nCheikhTairou Mbaye, Mame Bauna Track 3 \"Farwou Diar - Thie Bou Djeune\"\n(Mame Bouna Productions 2003).\nThis track features the first two dance rythmes played at a sabar. \"Farwou Diar\" means\n\"worthy boyfriend\", and was originally played for couples to encourage courtship, though\nit is now danced by women. The rhythm is characterized by a rolling triplet figure in the\nmbalax part\nwith the emphasis on \"JA\" (just before the bass\ntone). Thieboudjeune is named after Senegal's national dish, literally \"rice and fish,\" and\ncan be characterized by a fast duple meter (GIN, ja-ja)\nwith the emphasis on\nthe bass note. An alternate spelling for thieboudjeune is ceebu jen.·\nBeginning\nFarwou Diar dance rhythm begins after a very brief introduction\n1:14\nA short\ncan be heard, layered within the rhythm\n(rwa ja gin, gin gin ja gin ...)\n2:04\nTransition\nalternates with col (bass drum) solos\n2:24\nThieboudjeune rythme begins; notice the duple meter and faster tempo.\n3:37\nInterlude of call and response with the lead drum (nder)\n3:54\nReturns to the main rhythm\n4:25\nEnds with a unison\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sabar terms",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-030-introduction-to-world-music-spring-2013/4cb3e3e3bb018253f5abf5a88cedbfaa_MIT21M_030S13_readsabarter.pdf",
      "content": "Prof. Tang\n\nSABAR TERMS\n\nsabar - single-headed drum played with one hand and one stick; played by Wolof griot\npercussionists of Senegal. \"Sabar\" refers to the name of the drum, the dance associated with it,\nand also the drum and dance event at which it is played.\n\ngriot - oral historian and/or musician in formerly casted West African societies; the Wolof term\nfor griot is gewel.\n\nWolof - dominant ethnic group in Senegal. Although only 40% of Senegalese consider\nthemselves ethnically Wolof, the Wolof language is spoken and understood by 90% of the\nSenegalese population.\n\nSpecific names of sabar drums (from tallest to shortest):\n\nnder - tallest open-bottom sabar; usually serves as the lead drum in the ensemble.\nmbeng-mbeng ball - second-tallest open-bottom sabar\nmbeng-mbeng - medium-sized open-bottom sabar\ntungune - shortest open-bottom sabar. \"Tungune\" means \"midget\" in Wolof.\ncol - closed-bottom, egg-shaped bass drum; has the lowest sound in the ensemble. Can lead the\nensemble, especially at wrestling matches.\n\nrythme - dance rhythm. Usually a fairly short unit that is played repeatedly.\n\nDance rhythms performed at a sabar (usually in this order):\nArdin\n\nBaar mbaye\nFarwu jar\n\nKaolack (mbalax)\nCeebu jen\n\nLembel\n\nbakk - musical phrase. In general, longer than a rythme. Bakks can be derived from spoken\nword, or created as purely musical compositions.\n\nmbalax - literally means \"accompaniment\"; refers to the accompaniment part played on the\nmbeng-mbeng, which is the most important part. Also now used as an umbrella term for the\nSenegalese popular music genre made famous by Youssou N'Dour. This genre is noted for its\nstrong sabar component, \"marimba\" keyboard style, and highly syncopated guitar riffs.\n\ntalmbat & tulli - two accompaniment parts played on the col.\n\nTexts\n\nMa demoon ba Gambia\n\nI went to the Gambia\nFekke fa auto bu neex\n\nTo find a nice car\nDiko dawal, diko dawal\n\nI drove it, I drove it\nDiko dawal ba Senegal\n\nI drove it to Senegal\n\nAbdou, avec Abdou\n\nAbdou, with Abdou\nJusqu'a la mort\n\nUntil his death\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.030 Introduction to World Music\nSpring 2013\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}