{
  "course_name": "Introduction to Game Design Methods",
  "course_description": "This course is an introduction to the theory and practice of the process of designing games and playful experiences. Students are familiarized with methods, concepts, techniques, and literature used in the design of games. The strategy is process-oriented, focusing on aspects such as: Rapid prototyping, play testing, and design iteration using a player-centered approach.",
  "topics": [
    "Fine Arts",
    "Game Design",
    "Media Studies",
    "Digital Media",
    "Fine Arts",
    "Game Design",
    "Media Studies",
    "Digital Media"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nNone\n\nCourse Overview\n\nThis course is an introduction to the theory and practice of the process of designing games and playful experiences. Students are familiarized with methods, concepts, techniques, and literature used in the design of games. The strategy is process-oriented, focusing on aspects such as: Rapid prototyping, play testing, and design iteration using a player-centered approach. After completing the course the student should:\n\nBe familiar with the emergence of the academic study of design methods and game design.\n\nBe familiar with central concepts within the field.\n\nBe able to select and apply appropriate methods and techniques during different stages of the development cycle.\n\nBe able to structure and conduct a game design project from conceptualization to playable prototype.\n\nBe proficient in contributing to the collaborative learning and development processes.\n\nUnderstand how design can be applied to the academic process of generating new knowledge.\n\nLearning Activities\n\nStudents work in small project groups where they will engage with a series of confined assignments. There is an emphasis on presenting and discussing results with the student group and instructors. The weekly cycle begins with the introduction of an aspect of game design methodology and a related assignment. Students work in groups on the assignments outside of class. The cycle ends with the students presenting their work for feedback from the student group and instructors, here referred to as crit sessions.\n\nRequirements and Grading\n\nThe crit sessions play an important role in student assessment. Fulfillment of the learning objectives will be evaluated throughout the course and aggregated in a summative assessment.\n\nACTIVITIES\n\nPERCENTAGES\n\nPerformance in individual assignments\n\n20%\n\nActive participation in crit sessions and in-class activities\n\n40%\n\nIndividual performance in group projects\n\n40%\n\nStudents who miss more than three crit sessions will fail the active participation component of the class\n\nStudents who do not submit written assignments on time will fail the assignment\n\nReadings and Other Study Materials\n\nRequired readings and other study materials will be distributed through the course website. Project specific study materials such as readings, games and other media may be needed, and it is the responsibility of the students to acquire these materials.",
  "files": [
    {
      "category": "Resource",
      "title": "Board Game Analysis: The Mechanics of Takenoko",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/4fb5a04228b7fd2b2027c9cb9e674de9_MITCMS_301S16_Assigment2.pdf",
      "content": "Board Game Analysis: The Mechanics of Takenoko\nAssignment #2 - CMS.301: Spring 2016\nSummary: This is an exercise in game analysis for design purposes. The task is to identify and\ndescribe the game mechanics of the board game Takenoko.\nLearning Goals: To practice identifying and formulating game mechanics in a way that they are\nabstracted from the particular game context, but specific enough to be useful in the creation of\nfuture designs.\nKey Dates\n●\nSession 4: Exercise presented in class.\n●\nTwo days prior to Session 5: Completed report due. Submit a PDF on the course website.\nOne submission per student. 1-2 pages. Make sure to submit to the correct section!\n●\nOne day prior to Session 5: Solution suggestion posted on the course website.\nAssignment Description\nThis is an individual assignment. Students will learn the rules and play or observer people playing\nthe board game Takenoko. Based on this, they will identify 6-8 game mechanics, i.e. design\nsolutions aimed at affecting the game experience.\nEach mechanic should be described in terms of \"what the player does\" and what experience goal\nwe think this was intended to lead to. It is crucial that the gameplay outcome is described in detail\neven if it is hard to know what the designer's actual intentions were.\nStudents should also try to connect the mechanics to higher abstraction themes such as conflict,\npacing, or balancing when applicable. It is also valued if the student can think of other games that\nmake use of the same mechanic.\nLinks to resources for doing the assignment are available on the course website.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Explorative Game Design Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/88a0f75c6b17e7d57011835c7e0ec236_MITCMS_301S16_Assigment8.pdf",
      "content": "Explorative Game Design Project\nAssignment #8 - CMS.301: Spring 2016\nSummary: The main objectives of this assignment are to explore a design space by creating\ngame prototypes and formulate findings regarding potential play experiences.\nLearning Goals: Practice the fundamentals of explorative game design research.\nKey Dates:\n●\nSession 18: Concepts submitted and presented.\n●\nSession 20: Prototype description and playtest results submitted and presented.\n●\nSession 23: Second iteration prototype description and test results submitted and\npresented.\n●\nSessions 25 & 26: Final presentations.\n●\nSession 26: Final (individual & group) reports due.\nAssignment Description: This is a group assignment for groups of 3-4 students including an\nindividual deliverable.\nAs a part of the \"Recasting Player Two\" project, The MIT Game Lab is currently studying\ndifferent ways of making the gaming hobby more inclusive through exploration of new game\nmechanics and interaction modes. The objective of this project is to explore the design space\nof non-traditional player skills and abilities.\nMany board and card games rely on similar player skills and abilities. The increasing popularity\nof \"modern\" board game design has led to an ever growing list of interesting game mechanics\nsuch as worker placement, deck building, variable player powers, and drafting; just to name a\nfew. But regardless of the mechanics, the games are often some kind of math problem hidden\nbeneath the theme of the game.\nThere are many games that don't fit this description such as dexterity games, trivia games, and\nluck based games, but we believe that there still are other underexplored areas that could offer\ninteresting and inclusive play experiences. What other skills and abilities can be utilized in board\ngame design, and what qualities could game experiences based on these skills and abilities\noffer?\nThese questions can only be answered through design exploration. Your task is to explore the\nalternative skills and abilities design space by creating game prototypes. These prototypes are\nbuilt and tested in order to find and demonstrate interesting applications, and to describe how\nthey can provide meaningful and interesting gaming experiences.\n\nStep 0: Playing games with an analytical eye for mechanics and experience outcomes is the\nroot of good game design. We have scheduled a series of in-class play sessions to explore\ngames that utilize alternative skills and abilities as inspiration for your design explorations.\nStudents form groups (3-4) in advance of the play sessions.\nStep 1: Analysis and concepts. Upload a document (max 2 pages) per group. The document\nshould include short (1 paragraph per game) descriptions of the alternative skills and abilities\nutilized in the different games from the gaming sessions, how they affect the game experience\nand the game's potential audience.\nCome up with three concepts for games utilizing alternative skills and abilities and\ndescribe the three concepts for games using alternative skills and abilities. Note that we are\nlooking for innovative experiences, so be careful to not simply replicate those offered by the\ninspirational games.\nSubmit the document at least one hour before class on Session 18. Students will\npresent and critique the concepts and decide which ones to move forward with.\nStep 2: Build a low fidelity prototype and playtest it on confidants. (Other class members from\nthe same section work well for this.) Upload a playtest report before Session 20. Students show\nand critique the prototypes and present the results of the playtest in class, including design\ndecisions made based on the evaluation of the playtest.\nStep 3: Build a second iteration prototype and playtest it on class mates from the other section\n(in class during Session 22). Upload a playtest report one hour before Session 23. Students\nshow and critique the prototypes, and present the results of the playtest in class, including\ndesign decisions made based on the evaluation of the playtest.\nStep 4: Students present their findings from the project including their final round of playtests\nand final prototypes in class during Sessions 25 & 26. Each group writes a five page report on\nthe project describing the design process, the final prototype and the research findings. Each\nstudent also submits a one page report reflecting on the process and findings of the group\nproject. Both reports are submitted on the last day of classes (Session 26).\nSafe Learning Environment Guidelines:\nSince it is absolutely crucial to us that all students feel safe and included in all learning activities,\nwe have the following guidelines for all class related play sessions:\n1) Any student or playtester may at any time opt out of a playing activity without having to give a\nreason or explanation.\n2) We are dedicated to provide a harassment-free environment. See our anti-harassment policy\nfor details: http://gamelab.mit.edu/harassment-policy/\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "High Level Design Doc Template",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/62d4c0521a42c3893bc389913e15a5fa_MITCMS_301S16_HighLevel.pdf",
      "content": "CMS.301 Spring 2016\nHigh Level Design Doc Template\n\nTeam Members:\nIntended Audience:\nPrior Research Summary (Similar Works):\nCore Concept/Key Actions\nWhat is the key mechanic the player repeats over and over again as part of gameplay? What\nare the key systems (if any) that support that action(s)?\n\nInnovative/Unique Aspect:\nWhat's new and unique about this game, as opposed to its competitors?\nSetting/Narrative\nIf the game has a story, what is it? How does the player encounter it/interact with it/ learn it?\nWhere is the game set, what is its background appearance?\n\n30 Second Gameplay Description:\nDescribe 30 second of active gameplay from the player's point of view. Should include all the\nkey actions / core actions the player is expected to use reliably.\nPitch/Design Highlights:\nSummarize the design highlights of this game in an elevator pitch why would this be a great\ngame to make or to play? Think of this as your advertisement either to the player who wants\nto buy the game, or to the publisher you want to fund its creation.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Scrabbleship: Working With Game Mechanics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/4faebe488c9944a5d272cdc6d036204a_MITCMS_301S16_Assigment3.pdf",
      "content": "Scrabbleship: Working With Game Mechanics\nAssignment #3 - CMS.301: Spring 2016\nSummary: This is an exercise in identifying and working with game mechanics to create a \"mashup\" of two\nexisting board games.\nLearning Goals: Understand how to use game mechanics in the design process, how they interact, and how\nthey relate to experience outcomes.\nKey Dates\n●\nSession 5: Exercise presented in class, teams formed, in--class time for learning the games and\nbeginning the analysis.\n●\nSession 6: Completed playable game prototype due. The prototypes will be peer evaluated through play\nand critique. Submit a PDF on the course website with the name and rules of the scrabbleship and a list of\nthe game mechanics indicating from which parent game the mechanics come from. (One document\nper group.)\nAssignment Description\nThis group assignment (3--4 students) has three phases: an in--class play and analysis session, the creation of a\nplayable board game prototype, and an in--class evaluation through play and criticism.\nFirst, the students learn and play a board game and identify the mechanics that make the game experience work.\nNew groups are formed so that the group collectively has knowledge of two of the games. A new game is then\ncreated using a mix of the mechanics and components from both games.\nThe idea is that anybody who owns the two origin games should be able to play the new game, so no additional\nparts or pieces can be added. (Exceptions can be made for things that can be expected to be available in any\nhome such as pen, paper, dice, and coins.) Since two groups share the two origin games, the groups have to\ndivide all the available pieces between them. Both games must be playable concurrently!\nThe new game must be playable by 3-4 players and should take as long to play as the parent games. The new\ngame should maintain mechanics traceable to both origin games (aim for an even mix), but also feel like a new\nand unique experience. The new game will also have mechanics that don't come from either parent game.\nThe game has to be tested on other people than the designers during the development process. It will most likely\ntake a few iterations of the design before the game is reasonably well balanced, elegant, and fun.\nAfter Session 6, the students and instructors will play the new games and evaluate them with a focus on the\nmechanics. Since one of the designers will stay with each game, no printed rules are necessary.\nA good Scrabbleship is characterized by:\n-\nMeets intended experience goals.\n-\nTraceable and balanced influences from both parent games.\n-\nClear individual identity.\n-\nA name that well represents the new design.\n-\nElegant design solutions.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Takenoko – Game Mechanics Breakdown",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/fd5bc53db2b8568b3245f2a5b1ebdf3a_MITCMS_301S16_Assign2_Sol.pdf",
      "content": "Massachusetts Institute of Technology\nMikael Jakobsson\nResearch Scientist\nCMS/W | MIT Game Lab\n\nTakenoko - Game Mechanics Breakdown\nVa\nIf all players were trying to accomplish the same things, there would be\nevery step of the way. H\nriable Objectives\nidden objectives mitigate direct conflict and add a layer of\ndirect conflict at\ndedu\n-\n-\nction.\nRelated theme: Conflict.\nte\nTug\nDirectly opposing objectives (bamboos of a certain height and eating bamboos) have a\nof\nGame with this mechanic: Risk (modern rules variant).\nndenc\nW\ny\nar\nto\n\nmechanic (e\nc\nspecially if it is zero sum), pacing becomes important.\nreate moments of heightened tension. Whenever a game has a tug of war\nobjectives, escalating scoring opportunities and scoring on the fly a\nIn this\nll helps a\ncas\nvoiding\ne the hidden\nstalemates.\n-\n-\n\nRelated theme: Conflict\nVa\nDifferent objectives have different payoff in terms of victory points. Player\ngreater risks for greater rewards. Allowing for risk taking is a way of increasing excitement\nriable\nG\n\name\nRewa\nwith this mechanic: Arm Wrestling.\nrds\ns can take\nand\n-\n-\nalso a way of avoiding players losing hope of winning when they have fallen behind.\nRelated theme: U\nGame with this mechanic: Machi Koro.\nncertainty of Outcome.\nAc\ntake\nIns\nt\ntead\nio\n, players can choose their own actions. This gives the opportunity to make tact\nn Se\nof\nl\ne.g. r\nectio\noll\nn\n-‐and-‐moveing to a space that determines which action the player can\nIn or\ndecisions,\nder for\nor\nthis\nin ot\nto wor\nher w\nk, the choices\nords interesting choices - a staple experience of good game design.\nical\nobjectives one of the actions, the designer has made sure that players never\nhave to be balanced. By making drawing new\nstuck\n-\n.\nget completely\n-\nRelated theme: Agency\nGame with this mechanic\n.\n: Pandemic.\n\nConstrained Action Selection\nThe choice to let players pick three tiles and use one of them mitigates some of the\nrandomness of the traditional \"draw a card\" mechanic. The players get to make interesting\nchoices, but also have to adapt their strategy to the randomness of the draw.\n- Related theme: Agency.\n- Games with this mechanic: Ticket To Ride.\nPoints of Influence\nBy tieing actions to the characters, players know that even if the state of the board will\nhave changed when their turn comes around, it won't have changed so much that trying to\nstrategize is pointless. When game state changes are too chaotic, players \"check out\"\nbetween turns. The goal is to create an experience that is interesting also to players who\nare waiting for their next turn.\n- Related theme: Predictability.\n- Game with this mechanic: Parcheesi.\nPredictability Jammers\nMechanics of uncertainty can be used to maintain a desired lightness1 in the gaming\nexperience. The weather die, the fact that all players manipulate the same system, and\nhidden information (draw pile and objectives) all work to make it harder to plot out a\ncourse of action too many moves ahead. This can help avoiding a phenomenon known as\nanalysis paralysis (AP) where a player thinks so long about what to do that the other\nplayers get tired of waiting.\n- Related theme: Chance/Mastery.\n- Game with this mechanic: Catan.\nBoard Building\nAs identified by the students in class, modular boards that are constructed differently every\nsession allow for increased replayability. Parallells can be drawn to procedurally generated\ncontent in video games. Building the board as part of playing the game also gives players a\nsense of having co-‐created a unique design. It is common for players to comment on the\naesthetic qualities of the final garden and take pictures of it after the game is over.\n- Related theme: Creativity.\n- Game with this mechanic: Castles of Mad King Ludwig.\nScoring Escalation\nThe growing garden, added irrigation channels, and added improvement tiles - nothing is\never removed - assures that scoring starts out slowly and eventually picks up until it\npushes someone to reach the end condition. The experience goal is to create an\nappropriately bounded event.\n- Related theme: Pacing.\n- Games with this mechanic: Jeopardy.\n\n1 The concept of weight in board games refers to a combination of factors including\ncomplexity and how much of a \"brain burner\" the game is.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The People in My Life Through Games",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/db556bed56adf709002bfe61f9d79c11_MITCMS_301S16_Assigment1.pdf",
      "content": "The People in My Life Through Games\nAssignment #1 - CMS.301: Spring 2016\nSummary: The task is to make a social interaction map of the people in your daily life via games.\nLearning Goals: Practice alternative ways to understand players and their social contexts.\nPractice generating inspirational materials for the design process. This is also an exercise in\npresentation technique.\nKey Dates\n●\nSession 2: Exercise presented in class.\n●\nSession 3: Completed interaction map due one hour before class. Submit a jpeg on the\ncourse website of the interaction map to be displayed using the projector at the crit session.\nOne submission per student. Make sure to submit to the correct section!\nAssignment Description\nThis is an individual assignment. Students draw a map with themselves in the center connecting\nto the people they interact with socially through games. (The interaction can be one-way.) Every\nconnection has to have a game between the people, but it doesn't have to be games you've\nplayed with these people. It can also be games you talk about, watch, read about, etc. Try to\ninclude people close to you, but you can also add people you don't know personally, such as a\ngaming celebrity, or people you don't know who they are, such as a designer. You are allowed to\nuse text, for instance to put names to the different people, but try sticking to drawing as much as\npossible. You are allowed to use aliases or avoiding putting names to some persons. Don't\ninclude sensitive personal information. Use simple figures to represent people and make up\nstylized icons for whatever you need to represent such as computers, board games, consoles etc.\nFigure 1. High-density example of student submission.\n(Courtesy of Stephen Suen. Used with permission.)\nFill the map with as many persons, games, and connections as you can fit in an image without it\ngetting illegible when projected in the classroom and that you can get through in 4 minutes.\n(8-16 connections seems to be the norm.)\nOn Session 3, the instructor will display the jpegs and each student will have four minutes to tell\nus about the people in their life through games. (Rehearse the presentation for timing.)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Assignment #5: Game Design Document & Pitch",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/01127a14d6a848c9377c8bce5c43912a_MITCMS_301S16_Assigment5.pdf",
      "content": "Assignment #5: Game Design Document & Pitch\nCMS.301: Spring 2016\nSummary: Organize an ideation session; evaluate the ideas for a coherent game idea; create\nan elevator pitch and design highlights for the potential game; present the game design & the\nprocess that developed it.\nLearning Goals: Introduction to a 'formal' creative design process: brainstorming, the\nchallenges of group design, utilizing game research, defining and communicating creative\nideas in written and oral format vision statements, pitch, and High Level Design Documents\n(HLDD).\nKey Dates:\n●\nSession 9: Exercise presented in class, teams formed, inclass time for brainstorming.\n●\nSession 10: Completed pitches & High Level Design Documents due; 5 10 minute in\nclass presentation. (Design documents should be turned in on the course website in .pdf\nformat before start of class.)\nAssignment Description: Having completed your User Research assignment, you will start the\nconcept work for a game using the research done in Assignment 4. This group assignment, for\n3 4 people has three phases: a brainstorming session, creation of a high level game design\nand pitch, and a class presentation. Students are encouraged to form new teams for this\nassignment, so that as a group you have multiple user personas and game analysis to choose\nfrom for your game design.\nTeams will be formed in class on Session 9, and ideas generated during the brainwriting /\nbrainstorming workshop in class. Teams then work together to develop a game design, and\nwrite a High Level Design Document to describe and communicate the design. A HLDD\ntemplate can be downloaded from the course website. For Intended Audience and relevant\ngame research, you should reference a user persona and research generated during\nassignment 4.\nThe HLDD needs: the intended audience, prior research summary, a description of the core\nconcept and core gameplay, a setting, a brief description of gameplay, and a callout of the\ngame's innovative and/or unique aspects. Finally, it will also need a pitch, written to convince\neither potential investors or potential players of the game's value. Your pitch should include\ndesign highlights the top three or four things that make this game compelling.\nThe presentation has two distinct parts: first, the description of your game design and its pitch.\nPresent the game, describe its core gameplay and setting, and explain why it is unique &\ninteresting. Convince us this is going to be a great game!\nSecondly, reflect on the overall design process, and what did and did not work well for your\nteam. Did your brainstorming process work? How did you decide on the final idea? Why did\nyour group choose the idea it chose, etc. How would you improve your design process in the\n\nfuture? All group members should have a voice in the presentation. No slides or\nPowerPoint presentations you may show your HLDD while you discuss it if you wish.\nYou will have time to work on this in class on Session 9, but expect to arrange at least one\nmeeting to complete it out of class.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "CMS.301s16 Assignment 4 Research",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/366e98bab86a4f53d0d27857df1ad311_MITCMS_301S16_Assigment4.pdf",
      "content": "Design Research: Creating User Personas, Comparative Analysis\nAssignment #4: CMS.301, Spring 2016\nSummary: T\n\nhis is an exercise in user research: first defining potential users, and then\ninvestigating features common to games they use and play.\nLearning Goals: Practice user research techniques. Define a potential user by\n\nconstructing a\nuser persona. Research games, using comparative analysis to determine features that appeal\nto your user.\nKey Dates:\n●\nSession 7: Research methods introduced and discussed in class; teams formed,\npotential 'user personas' chosen.\n●\nSession 8: Presentation. Introduce and describe your user persona, explaining why\nthey are a good representative use. Then, detail the features common to games your\nuser plays, and explain why those features are important your user.\nDescription: Your team is researching 'free to play' digital games for a client. You need to\nresearch their target user, and the games they play. This group assignment (3 4 students) has\nthree phases: the creation of a user persona, a comparative analysis of existing games, and an in\nclass report describing game features that appeal to your team's persona.\nFirst, your team should choose a picture from this image set. Create a single user protopersona,\ndescribing their characteristics and features. Work with your team to agree on your persona's\nqualities, but please take note: no college students! User personas help development teams\nunderstand people who are not represented in the team.\nKey Facts:\n●\nName, Age, Occupation, Gender\n●\nGaming & computer experience\n●\n'About' Section a brief description of who they are /what they do.\n●\nGame playing patterns: when do they play games, how long, under what conditions?\n●\nGoals: Why do they play games? What experience are they seeking? (Social,\ncompetitive, relaxation, time passing, etc.???)\n●\nActions: What do you imagine them doing as they play games.\nNext, identify 3 4 games (digital, free to play) your persona is likely to play. Analyse the\ngames, identifying each game's primary features, and which features the games have in\ncommon. For each game, what appeals to your persona? Which of the game's features are a\nnegative or a turnoff to your persona? Why? Which features would be good candidates to\ninclude in a game that appeals to your user? Again, why?\n\nAs a group, write a maximum one page summary of the analysis, and upload that and your\nuser persona to the course website by Session 9. You need only submit one copy for the\ngroup, but make sure each team member has their name on the paper.\nPresent your results during crit on Session 8. Introduce and describe your persona's key\ncharacteristics, and present the results from your comparative analysis, particularly which\nfeatures are most important to your user and why. Presentations should be no longer than 10\nminutes long. Expect to have a few minutes of group discussion and questions after your\npresentation.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "CMS.301s16 Assignment 6 Prototyping A Game",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/9b051e4b2b363f44bd2a072be200b09a_MITCMS_301S16_Assigment6.pdf",
      "content": "CMS.301\nSpring 2016\nAssignment 6: Paper Prototyping\nSummary:\n\nUsing paper prototyping tools and technique, design the core co\n\nncept of a\ncompelling game experience.\nLearning Goals: Developing designs; physical prototyping.\n\nKey Dates:\n●\nSession 11: Exercise presented in class; teams formed; in class time for brainstorming /\ninitial game design and prototyping work.\n●\nSession 12: Prototypes are presented & played in class; presentation to follow after\ngroup play of the game. Rules and one page High Level Design Doc, written after the\nprototype is created & tested, to be submitted to the class website by Session 12.\nAssignment Description:\nUsing physical prototyping techniques, create a playable prototype, and then write a one page\nhigh level design doc based on the prototype. The prototype should demonstrate the game's\ncore concept, and be an engaging and entertaining play. Keep it short, with a maximum\nplaytime of five minutes. While prototypes must be physical, teams can choose to design for\neither a digital or a board game.\nAfter forming teams of 3 4 people, teams will do a brainstorming session in class, coming up\nwith interesting verbs, to come up with initial ideas for their game. Materials will be provided in\nclass for initial prototyping work, and teams are expected to start prototyping in class.\nTeams take with them the prototyping supplies they need to continue work over the weekend.\nPrototypes should be worked on, tested, and played with testers outside of the development\ngroup, and then improved based on feedback from playthroughs.\nPrototypes will be presented in sections on Session 12, along with a presentation discussing\nthe game, its design, and its design process. Just as with the HLDD presentation, teams\nshould be ready to discuss how the process of design went, what aspects of designing from a\nprototype worked, which ones didn't, and how the team worked or did not work well together on\nthe project.\nDue on the class website are a copy of the game's rules, a one page High Level Design Doc\ncreated after the game has been prototyped, and if possible, a .pdf of the game board.\nGame/Prototype Constraints:\n●\nShort playtime: try for 5 minutes max.\n●\nShort explanation time: players should be able to be up & running within 5 minutes.\n●\nGame should incorporate your chosen verb in it.\n●\nYou may choose a set number of players, from 1 4 the game does not have to handle\n\na changing number of players.\n●\nIf the game is single player, the team must be able to run it well for their tester, and\nthe uploaded rules must describe how the game would be run.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "CMS.301s16 Assignment 7 Playtest",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/51c8e0a79962c8957bcd32eb9d0619b2_MITCMS_301S16_Assigment7.pdf",
      "content": "A/B Playtest\nAssignment #7 - CMS.301: Spring 2016\nSummary: The task is to modify an existing game and playtest the two versions to decide which\none to keep.\nLearning Goals: Practice the fundamentals of playtesting.\nKey Dates:\n●\nSession 13: Exercise presented in class.\n●\nSession 14: Completed playtest report due before class. Submit as PDF on the class\nwebsite. One submission per student. The playtest is presented in class. Each student\nhas 4 minutes. There is not time for using any presentation aids.\nAssignment Description: This is an individual assignment.\nStudents will perform an A/B playtest where two versions of the same game are compared in\norder to see if a modification is beneficial in relation to desired experience outcomes.\n- Planning and development\nPick an existing game/play activity such as Monopoly, Poker or Hopscotch and choose a way\nthat the game potentially can be improved. For example, Monopoly might be better if it plays\nfaster. Then make a prototype of the modified version of the game.\nCreate a script that will be read to playtesters giving the minimal set of instructions necessary to\nplay a selected section of the game.\nDecide which questions you want the playtest to answer. If your goal is to increase the sense of\ndirect competition by making Hopscotch a two-player game, you can for instance ask in which\nversion the tester felt that there was more at stake and other questions that together will\nproduce the relevant information.\n- Test execution\nInvite at least three people representing the intended audience for the game.\nRead the script to the testers. Observe and record them playing both versions. Since there is no\nseparate facilitator, I strongly recommend making an audio recording for private use. Taking at\nleast two pictures is mandatory. Also take notes.\nInterview each tester separately. Use keywords based on the questions you are trying to answer\nin a semi-structured interview.\nThe whole test execution should not take more than an hour per playtester.\n- Analyze and report\nGo through the collected materials and figure out what the data means in terms of design\ndecisions. Write a two-page (maximum) report summarizing the test. The report should include:\n1. A description of the game modification.\n2. The script used in the test.\n3. First names of playtesters (3-4 people, no more than two of the same gender), with a brief\ndescription of each person including age, occupation, gaming habits (if any), favorite games (if\nany).\n4. A summary of observations and feedback. (Include at least two images.)\n5. Reflections on the results and your design decisions based on this information.\nThe highlights of the report will be presented and critiqued in class.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Design Process I: Understanding the Process, Design Research",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-301-introduction-to-game-design-methods-spring-2016/bc74229809bb044385aab541e02fa19f_MITCMS_301S16_Design.pdf",
      "content": "Design Process I\nUnderstanding the Process,\nDesign Research\n\n7.\nBui:\nMod I\nPrototype,\n8.\nRe\nDesign\nApproach\n(c) NASA. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information see https://ocw.mit.edu/help/faq-fair-use/.\n\nA diagram of\nthe us\ner-c\nentered\ndesig\nn proce\nss demonstrating the workflow: plan, research, design, adapt, and measure.\nImage by MIT OpenCourseWare.\n\n- User Portraits\n- Interviews\n- Direct ObservaCon\n- Internet Review\nLearning as much as you can about the habits of users while disturbing\nthem as li8le as possible.\nUSER RESEARCH (FAST & CHEAP)\n\nExamine games your intended user is currently playing.\nDetermine what they have in common, what it is in these games that\na8racts users.\nAlso look for current features that might detract from users' enjoyment.\nTry to understand *which* features are good, which could use\nimprovement, and *why* the games are doing what they are doing.\nCOMPARATIVE ANALYSIS\n\n(c) Viget Labs. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see https://ocw.mit.edu/help/faq-fair-use/.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nCMS.301 Introduction to Game Design Methods\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}