{
  "course_name": "Introduction to Civil and Environmental Engineering Design I",
  "course_description": "This sophomore-level course is a project-oriented introduction to the principles and practice of engineering design. Design projects and exercises are chosen that relate to the built and natural environments. Emphasis is placed on achieving function and sustainability through choice of materials and processes, compatibility with natural cycles, and the use of active or adaptive systems. The course also encourages development of hands-on skills, teamwork, and communication; exercises and projects engage students in the building, implementation, and testing of their designs.",
  "topics": [
    "Engineering",
    "Civil Engineering",
    "Environmental Engineering",
    "Engineering",
    "Civil Engineering",
    "Environmental Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1 hour / session\n\nLaboratory: 1 session / week, 3 hours / session\n\nAssignments\n\nThe principal assignments of this subject are design tasks, including preparation of both conceptual designs and detailed designs, construction of prototypes, testing, and submission of final reports. Each student will be required to maintain a project notebook, in which notes on conceptual and detailed design, test results, and other relevant information is to be kept. Notebooks will be reviewed regularly by the instructors. Oral reports will be expected at various stages of each design project. Final reports are to be submitted as separate written documents. In addition, short reading or library research assignments may be given. Written submissions (drawings, reports, etc) are to emphasise clarity and legibility. They are to be submitted as hard copy unless otherwise indicated. The use of appropriate software applications is encouraged if such use promotes clarity and legibility.\n\nProject Teams\n\nDesign exercises and projects will be carried out by teams of from 2 to perhaps 6-7 people as assigned by the instruction staff. Team composition will vary from project to project, but in all cases the development of successful communication and task sharing skills should be considered an explicit goal of this subject. This organization also implies that each individual bears a measure of responsibility to the team.\n\nSafety\n\nAttention to safety is absolutely required of all participants. Key elements of shop safety include knowledge of proper machine operation, full attention to the task, and use of protective equipment. Proper shop housekeeping, including maintaining an organized workspace and cleaning up after yourself, is essential. See and comply with the Safety Instructions as well as instructor directions (you will be asked to acknowledge that you have received and read this document). Any person deemed to be working in a manner that presents a hazard to themselves or others may be removed from the subject at the discretion of the instructors.\n\nTools and Supplies\n\nKits of hand tools will be signed out to each team, which will be responsible for their security and their return. Supplies will also be provided for prototyping. Students who wish to use tools and materials other than those supplied should speak with an instructor first.\n\nGrading\n\nGrades will be based both on participation and on final reports. Participation comprises attendance, attitude, and industry in class, as well as the keeping of a clear and accurate project notebook. Overall weighting will be as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nFinal Reports\n\n50%\n\nParticipation -- notebook\n\n30%\n\nParticipation -- attendance, attitude, industry\n\n20%",
  "files": []
}