{
  "course_name": "Introduction to Plasma Physics I",
  "course_description": "The plasma state dominates the visible universe, and is important in fields as diverse as Astrophysics and Controlled Fusion. Plasma is often referred to as “the fourth state of matter.” This course introduces the study of the nature and behavior of plasma. A variety of models to describe plasma behavior are presented.",
  "topics": [
    "Science",
    "Chemistry",
    "Physical Chemistry",
    "Physics",
    "Astrophysics",
    "High Energy Physics",
    "Nuclear Physics",
    "Science",
    "Chemistry",
    "Physical Chemistry",
    "Physics",
    "Astrophysics",
    "High Energy Physics",
    "Nuclear Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course introduces plasma phenomena relevant to energy generation by controlled thermonuclear fusion and to astrophysics. It will cover basic plasma properties and collective behavior, Coulomb collisions and transport processes, motion of charged particles in magnetic fields, plasma confinement schemes, MHD models, simple equilibrium and stability analysis, two-fluid hydrodynamic plasma models, and wave propagation in a magnetic field.\n\nThe course also introduces kinetic theory, the Vlasov plasma model, the relation between kinetic and fluid models, electron plasma waves and Landau damping.\n\nCourse Prerequisites\n\nIn order to register for 22.611J, 8.613J and 6.651J, you should have previously completed 6.014 or 8.07 and 18.04 or 18.075, with a grade of C or higher. Exceptions to this policy will require the permission of Prof. Parker, and will be granted on a case-by-case basis.\n\nTextbook\n\nThere is no required text for this course. There is, however, a list of recommended texts in the\nreadings\nsection.\n\nProblem Sets\n\nThe weekly problem sets are an essential part of the course. Working through these problems is crucial to understanding the material. Problem sets will generally be assigned one week before they are due.\n\nExams\n\nThere will be one in-class (90 minute) mid-term quiz and a (3 hour) final exam. If you did well on the problem sets and exams, you should do well on the final exam.\n\nGrading\n\nThe final grade for the course will be based on the following:\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n25%\n\nMid-term quiz\n\n25%\n\nFinal exam\n\n50%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nPlasmas and their characterization\n\nProblem set 1 out\n\nBasic plasma concepts: Debye shielding, plasma frequency, plasma parameter\n\nCharged particle motion in EM fields I\n\nProblem set 1 due\n\nProblem set 2 out\n\nCharged particle motion in EM fields II\n\nCharged particle motion in EM fields III\n\nProblem set 2 due\n\nCoulomb collisions: Cross-section and frequencies\n\nProblem set 3 out\n\nCharacteristic relaxation times\n\nPlasma fluid descriptions, two-fluid model\n\nProblem set 3 due\n\nProblem set 4 out\n\nPlasma fluid descriptions, MHD model\n\nMHD equilibrium I\n\nProblem set 4 due\n\nProblem set 5 out\n\nMHD equilibrium II\n\nMHD dynamics: Alfven waves\n\nProblem set 5 due\n\nMHD dynamics: Stability\n\nMid-term quiz\n\nTransport I\n\nProblem set 6 out\n\nTransport II\n\nPlasma waves I\n\nProblem set 6 due\n\nPlasma waves II\n\nProblem set 7 out one day after Lec #17\n\nPlasma waves III\n\nPlasma waves IV\n\nProblem set 7 due one day after Lec #19\n\nProblem set 8 out\n\nPlasma kinetic description\n\nRelation of kinetic to fluid description I\n\nProblem set 8 due\n\nProblem set 9 out\n\nRelation of kinetic to fluid description II\n\nLandau damping I\n\nProblem set 9 due one day after Lec #23\n\nLandau damping II\n\nMakeup lecture: Z-function; Ion acoustic waves\n\nFinal exam",
  "files": [
    {
      "category": "Resource",
      "title": "ps1_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/122cf2d2de307520e9f738df41aee51e_ps1_05.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n13 September 2005\n\nDue: 20 September 2005\nProblem Set 1\n\n1. The three-dimensional Maxwellian velocity distribution function is\n\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛-\n=\n3 exp\n)\n(\n)\n(\nt\nt\nm\nv\nv\nv\nn\nv\nf\nπ\nr\n\nwhere n is the particle density and\nm\nkT\nvt\n2 =\n. Determine the following:\n\ni) the average of each velocity component, e.g.,\nxv\n;\nii) the average speed v ;\niii) the rms speed\nv\n;\niv) the average kinetic energy in any one direction, e.g.,\nx\nmv\n; and\nv) the flux crossing a planar surface in one direction.\n\n2. In class we worked out the potential associated with a sheet of charge immersed in a plasma with\nelectron temperature\nand ion temperature\nand obtained the result\neT\niT\n\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛-\n=\nD\nD\nx\nλ\nε\nσλ\nφ\nexp\n\nwhere σ is the charge density, x is the coordinate perpendicular to the charge sheet and\nD\nλ is the\nDebye length. A key assumption in our analysis was\n,\n<<\ni\ne\nkT\neφ\nso that the exponentials appearing in\nPoisson's equation could be well represented by the first two terms in a Taylor series. The purpose of\nthis problem is to remove this restriction for a plasma in which\n.\nT\nT\nT\ni\ne\n=\n=\n\ni) Use the quadrature method discussed in class to solve Poisson's equation (without approximations)\nfor dx\ndφ and then integrate to get\n)\n(φ\nx\nin terms of V , the potential of the charge sheet.\n\nii) What is V in terms of σ ?\n\niii) Let\nbe the distance from the sheet where the potential has fallen to\nSketch\nvs.\nsx\n.\n-\nVe\nsx\nkT\neV .\nHow does it compare with the result of the calculation for the case\n,\n<<\ni\ne\nkT\neφ\n?\n\n3. A spherical ball of plasma consists of cold\n)\n(\n=\n=\ni\ne\nT\nT\nelectrons and singly charged ions with\nuniform density,\n. The sphere of electrons is perturbed a distance\n0n\nn\nn\ni\ne\n=\n=\nδ\nr\nfrom its equilibrium\nposition, i.e., where the electron sphere would coincide with that of the ions. Find the frequency at\nwhich the electron sphere oscillates. (Note: one particular form of a nearly spherical plasma occurs\nnaturally and is known is known as \"ball lightning\".)\n\n4. Consider the parameters of the plasmas listed in the table below, taken from notes for this subject\nprepared by Prof. A. Bers. Complete the table by calculating the Debye length\nD\nλ , the plasma\nparameter\nand the plasma frequency\n. Which plasmas are strongly coupled? Which need a\nquantum mechanical treatment?\nD\nnλ\n=\nΛ\npf\n\nPlasmas\nLog10ne\nLog10Te\nλD(m)\nΛ\nfp(Hz)\nStrongly\ncoupled?\nQM?\nWeakly ionized\n\nIonosphere, D layer 70\nkm\n2.5\n\nGas discharge, weak\ncurrent\n\nGas discharge, strong\ncurrent\n\nMHD energy convertor\n\nStrongly ionized\n\nInterstellar gas\n3.5\n\nSolar wind\n6.5\n\nIonosphere, F2 layer\n250 km\n11.5\n\nSolar corona (RO ~1.5)\n6.5\n\nTokamaks\n\nAlkali plasmas -\nsurface ionization\n\nLaser plasmas\n\nNuclear explosions\n\nMagnetosphere of\npulsars\n\nDense plasmas\n\nElectrons in metals\n2.5\n\nInterior of stars\n7.5\n\nInterior of white\ndwarfs\n\nNote: Te in °K, ne in m-3."
    },
    {
      "category": "Assignment",
      "title": "pset1_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/4e046fbdd0e18a1dcf30fbe38733cd66_pset1_02.pdf",
      "content": "Fall Term 2002\nIntroduction to Plasma Physics I\n22.611J, 6.651J, 8.613J\nProblem Set #I\n1. Distribution functions and averages:\nThe average of a quantity, G(v), over a\ndistribution function, f (v), is defined as,\nJ d3vG(v)f (v)\n(')\n=\nd3v f (v)\nThe Maxwellian distribution, in three dimensions, is,\nNote that the isotropy of this distribution means that all Cartesian coordinates are\nequivalent; there is no preferred direction.\n(a) Prove that the form of f is correctly normalized, i.e. that, J fd3v = n.\nEvaluate averages of the following:\n(b) A specific Cartesian velocity direction: (v,)\n(c) The square velocity: (v2) , and hence the average particle energy, (imv2)\n(d) The average speed, (\n~\n)\n\n2. Basic facts you need to know. Find out, write down, and memorize (to 2 significant\nfigures) the values of the following quantities: (You may use either SI or CGS units,\nbut I will use CGS for lecture, so these are recommended. . .)\n(a) The speed of light\n(b) The charge on the electron\n(c) The mass of the electron, m,c2, in MeV.\n(d) The mass of the proton, m,c2, in MeV.\n(e) The temperature in Kelvins, equal to 1 eV.\n(f) The particle density of the air you breathe\n(g) The density of particles in water.\n\n(h) The ionization potential of the hydrogen atom: calculate, EI = $*\n(i) The relationship between magnetic units of Gauss and Tesla.\n(j) The relationship between particle density in units of\nand m-3.\nHere are two more fundamental physics constants you might find useful:\n(k) Planck's constant in Atomic units: fie\n1970 eV - A = 1.97 x\neV - em\n(1) The fine structure constant:\n= =,\n3. Suppose the degree of ionization of a gas discharge is governed by the Saha equation,\nand the Debye length is small relative to the discharge size. Calculate approximately\nthe temperature at which the gas is 50% ionized if, EI = 13.6 eV, and its total pressure\nis equal to one atmosphere.\n4. Consider a plasma in which both electrons and (singly-charged) ions adopt thermal\ndistributions with Boltzmann factors governed by the respective temperatures, T,,\nand, Ti, which are different, in general. Show that a point charge, q, immersed in this\nplasma gives rise to a potential as a function of distance, r, from the charge:\n$ = Q exp (+/A)\nr\nin the approximation, e$ << Te,Ti. Obtain an expression for A. Does the situation\nof cold ions, Ti << T,, correspond to the idealized case of \"immobile\" ions sometimes\nreferred to in textbooks?\n5. Consider a charged sphere of radius, a, located far from all other objects in a plasma\nthat has immobile ions and mobile electrons of temperature, T,. The electrons can\nbe assumed to adopt a Boltzmann distribution, n = noexp(e$/Te), where, $, is the\nelectrostatic potential and, no, is the background density of the singly charged ions.\n(a) Calculate the potential distribution in the plasma when the potential on the sphere\nis, $,, in the approximation, e$, << T,.\n(b) Sketch the form of, $, as a function of radius, r, in the two cases, AD << a , and,\na << AD\n(c) Calculate the charge on the sphere, and hence its capacitance in the presence of\nthe plasma. ( The charge can be determined from the surface electric field).\n(d) Evaluate the capacitances when, a = 10 em, for the case, T, = 1 KeV, and (i)\nno = 1014cm-3, and (ii) .no = 106cm-3, and compare with the capacitance in\nvacuum."
    },
    {
      "category": "Assignment",
      "title": "pset1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/a16f1778c99291136415241ab0b5f3b3_pset1.pdf",
      "content": "Massachusetts Institute of Technology\nSubject 6.651 5/8.613J/22.611 J\nR. Parker\n12 September 2006\nDue: 19 September 2006\nProblem Set 1\nNote: The Subject Web Site can be found at:\n1. The three-dimensional Maxwellian velocity distribution function is\nn\nf\",\n(3\n=\n(v, .\\/IT)' exp($ j\n2kT\nwhere n is the particle density and v,! = -\n. Determine the following:\nm\ni) the average of each velocity component, e.g., (v,) ;\nii) the average speed (v) ;\niii) the rms speed Jv2)\n;\niv) the average kinetic energy in any one direction, e.g.,\nv) the flux crossing a planar surface in one direction.\n2. Consider the parameters of the plasmas listed in the table given on the last page, taken from notes\nfor this subject prepared by A. Bers. Complete the table by calculating the Debye length 4, the\nplasma parameter A = nAL and the plasma frequency fp . Which plasmas are strongly coupled? Which\nneed a quantum mechanical treatment?\n3. In class we worked out the potential associated with a sheet of charge immersed in a plasma with\nelectron temperature T, and ion temperature\nand obtained the result\nwhere o is the charge density, x is the coordinate perpendicular to the charge sheet and /2, is the\nDebye length. A key assumption in our analysis was elpl\n-\n<< 1 so that the exponentials appearing in\nkc,;\nPoisson's equation could be well represented by the first two terms in a Taylor series. The purpose of\nthis problem is to remove this restriction for a plasma in which\n= T = T.\n\ni) Use the quadrature method described in class to solve Poisson's equation (without approximations)\ndo\nfor -and\nthen integrate to get x(p) in terms of V , the potential of the charge sheet.\ndx\nProblem 3 (Continued)\nii) What is V in terms of o ?\neV\niii) Let xs be the distance from the sheet where the potential has fallen to ~ e - ~ .\nSketch xs vs. -\n.\nkT\nHow does it compare with the result of the calculation for the c a s e M << 1 ?\nkTe,i\n4. A long cylinder of plasma with circular cross-section and radius a consists of cold\n(Te = = 0) electrons and singly charged ions with uniform density, ne = ni = no. The cylinder of\nelectrons is perturbed a distance\nin a direction perpendicular to its axis.\ni) Find the frequency at which the electron cylinder oscillates assuming that the ions are immobile.\n(Hint: Assume 6 << a and that the perturbation produces a surface charge that creates a 2-D dipolar\nfield.)\nii) Repeat i) assuming that the ion mass is M.\n\nLoglone\nLogloTe\nAD@)\nA\nf~(fi)\nStrongly\nQM?\nPlasmas\ncoupled?\nWeakly ionized\nIonosphere, D layer 70 km\n2.5\nGas discharge, weak current\nGas discharge, strong current\n2 1\nMHD energy convertor\nStrongly ionized\nInterstellar gas\n3.5\nSolar wind\n6.5\nIonosphere, Fz layer\nSolar corona (Ro -\n250 km\n11.5\n1.5)\n6.5\nTokarnaks\nAlkali plasmas - surface\nionization\nNote: T, in OK, n, in m-3."
    },
    {
      "category": "Assignment",
      "title": "pset1sol_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/610d5c6eed4d7faeccdbac2674ac1dcb_pset1sol_02.pdf",
      "content": "v2q =,E\n= -?I-.\n(I-\n[\n) 1 e\n5%\neo\n7~"
    },
    {
      "category": "Resource",
      "title": "ps2_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/c1dd467cc7df96d7ea744beed32062ad_ps2_05.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n20 September 2005\n\nDue: 27 September 2005\nProblem Set 2\n\nProblem 1.\n\nd\na\n\nTwo circular coils are shown in cross section in the above figure. Each coil has radius a and carries a\ncurrent I (in the same direction). The radius a is << the separation d. A particle with Larmor radius rL\nand energy W is mirror trapped on the axis of the coil system, in the region midway between the coils.\nThe axial extent of the particle's motion is << d.\n\ni) Calculate the particle's period of oscillation of its axial motion. Assume that the dipole\ncomponent of the field from each coil is sufficient to determine the field felt by the particle as it\nundergoes its oscillatory motion. Hint: The on-axis dipole component of the field from a\ncircular coil of radius a is\n2 r\nm\nB\nπ\nμ\n=\nwhere\nand r is the distance from the coil's axis\nfrom its center.\na\nI\nm\nπ\n=\n\nii) Calculate the minimum value of the ratio\nv\nv /\n⊥\n, defined on the axis at the midpoint\nbetween the two coils, for which a particle will be confined by the coil system. Hint: The field\nat the center of a circular coil is\na\nI\nB\nμ\n=\nwhere a is the coil radius.\n\nProblem 2.\n\nThe earth's dipole magnetic field is given by\n\n(\n)\nθ\nθ\nθ\nˆ\ncos\nˆ\nsin\n+\n-\n=\n-\nr\nr\nR\nx\nB\ne\nr\n\nwhere Re is the radius of the earth, approximately 6400 km. Here θ is the latitude and r is the distance\nfrom the earth's center. The actual field in the vicinity of the earth is more complicated due to\n\ninteraction with the interplanetary magnetic field and solar wind, but this complication will be ignored\nfor the purpose of this problem.\n\ni) The magnetic field lines are found by solving the differential equation\nθ\nθ\nB\nB\nrd\ndr\nr\n=\n. Carry out the\nsolution to this ODE to find the equation of the field lines in the form\n).\n(θ\nr\nr =\n\nii) Let BBe be the value of B on the equator (θ = 0) at some r. Determine B in terms of Be\nB and θ,\nwhere B is the magnitude of B\nr\nthat one would measure as one followed a field line from the\nequator.\n\niii) A particle is injected into the earth's field at some radius R0 at the equator. The particle has\nenergy W0, with\n2W\nW =\n⊥\nand W||\n1W\n=\n. Calculate the latitude\nref\nθ\nat which the particle is\nreflected. Assume\nref\nθ\nis small enough that small argument expansions to lowest non-zero order in\nθ can be used for all trigonometric terms.\n\niv) Using the particle's drift velocity at the equator as characteristic of the particle's drift velocity\nas it undergoes oscillation in latitude, estimate the time required for the particle to circle the earth.\nEvaluate numerically for a proton with W0 = 1 Mev injected at r =2Re. Is rL small enough for our\nderivation of the\nand curvature drifts to be valid?\nB\n∇\n\nProblem 3.\nz\ny\n\nThe figure illustrates a sheared magnetic field given by\n\n⎪\n⎪\n⎭\n⎪⎪\n⎬\n⎫\n⎪\n⎪\n⎩\n⎪⎪\n⎨\n⎧\n>\n-\n<\n<\n-\n-\n<\n=\na\ny\nz\nB\na\ny\na\nz\na\ny\nB\na\ny\nz\nB\nB\nˆ\nˆ\nˆ\nr\n,\n\nwhere ±a defines the sheared region and BB0 is the constant field amplitude outside the sheared region.\nSuch field configurations occur both in laboratory as well as in terrestrial and astrophysical plasmas.\n\ni) Consider first a particle whose guiding center is located at x = 0, y = a/2 at t = 0. Describe its\nmotion assuming rL << a. What constraint does this condition imply for the particle's\n?\n⊥\nW\n\nii) Consider now a particle whose position is located at x = 0, y = 0 with velocity vy = V, vx = 0,\nall at t=0. Derive the differential equations describing its motion.\n\niii) By solving these equations, determine the maximum extent of the particle's orbit in the y-\ndirection. Assume that the parameters are such that the particle does not reach the region of\nuniform field. What condition assures that this will be a valid assumption?"
    },
    {
      "category": "Assignment",
      "title": "pset2_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/0fd3a26cbfa2e59863f338ebaf86a7a0_pset2_02.pdf",
      "content": "Fall Term 2002\nIntroduction to Plasma Physics I\n22.611J, 6.651J, 8.613J\nProblem Set #2\n1. Field Line Topology Paradox\nConsider the magnetic field of a permanent \"C\" magnet, whose field threads an Alu\nminum torus as shown in the drawing below. The torus is then cooled to 1 oK and\nbecomes a superconductor. The problem is to determine what happens to the magnetic\nfield as the torus is pulled away a large distance to the right.\nThere are two arguments one can make that lead to very different pictures for the mag\nnetic lines. First, following from the property that magnetic flux cannot pass through\na perfect conductor, one might conclude that the lines get stretched to the right indef\ninitely and arrive at the picture below.\n\nSecond, one could observe that as the torus is pulled away a large distance the field\nthreading it will be determined predominantly by the current that has been induced\nin the torus. Since the flux through the torus must be held constant this current must\napproach a constant at large distances, and will generate a dipole field. Then the field\nbetween the poles of the magnet will be perturbed only slightly and we arrive at the\nfollowing picture.\nWhich picture is correct? If you endorse case 1 you must explain how the large currents\nin the torus required to modify the permanent magnet field, from such a, distance\nare produced. If you endorse case 2 you must explain how the lines that initially\nthreaded inside torus succeeded in getting outside it without breaking, forming ends,\nand violating 5 · B = 0.\n\n2. Polarization Drift\nSince the E×B drift is perpendicular to the electric field, E⊥, a particle subject to this\ndrift cannot change its energy. However, if the electric field changes slowly in time, the\nenergy associated with the drift motion, 1\n2 mvE, must change. Show that an additional\ndrift must be present if the work done by the electric field on the particle is to account\nfor the energy change, and that for small ∂ ln E/∂t the drift is given by,\nc dE⊥\nvpol = ΩB dt\n3. Fermi Acceleration of Cosmic Rays\nA cosmic ray proton is trapped between two moving mirrors with mirror ratio, R = 5,\nand initially has energy 1 KeV and, v⊥ = vk, at the midplane. The mirrors are sepa\nrated by a distance L and move toward the midplane with a velocity vM = 10 km/sec.\n(a) Using the loss cone formula and the invariance of the magnetic moment, μ, find\nthe energy to which the proton will be accelerated before it escapes.\n(b) How long will it take to reach that energy?\nNotes:\ni. Treat the mirrors as flat pistons and assume the time spent bouncing is neg\nligible compared to the time spent traversing the stationary field between the\nmirrors.\nii. You may assume that the distance, L, changes negligably during the acceler\nation.\niii. Compute the number of bounces and time (to within a factor of two) to\ntraverse L that many times.\n4. Numbers for Drifts\nEvaluate the magnitude of the, E × B, grad-B, and curvature drifts for the ions in a\ntypical tokamak plasma. Write the dimensionless ratio of these quantities relative to\nthe ion thermal velocity. Estimate quantities from the outer midplane of the tokamak\ntaking parameters from the MIT Alcator C-mod experiment:\nR = .66 m\na = .21 m\nB ∼ BT = 4.5 T\nn =\n\n× 1014 cm -3\nT =\n\nKeV\nEr =\n\nKV/cm\nYou may use the low beta assumption in computing magnetic field gradients. Note that\nthe electric field here is radial. Apologia: The units are mixed as is typical in practise,\nso you will have to unravel the units. . . some helpful conversions are: 1StatV olt (cgs)\n= 300 V olts (si), 1 Tesla (si) = 10, 000 Gauss (cgs). Recall that in cgs units the\nelectric and magnetic fields have the same dimensions, so that, 1StatV olt/cm = 1.\n1Gauss"
    },
    {
      "category": "Assignment",
      "title": "pset2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/e4acb92877b5c885b726bf3c779b3eb3_pset2.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n19 September 2006\n\nDue: 26 September 2006\nProblem Set 2\n\nProblem 1.\n\nThe figure shows field lines in a cylindrically symmetric magnetic mirror plasma confinement device.\n\nr\nz\n\nThe field is given by\n\nr\nrz\nB\nz\nz\nB\nB\nˆ\nˆ\n)\n1(\nA\nA\nG\n-\n+\n=\n\na) A particle orbits in the mirror with its guiding center moving along the z-axis. At z=0, it has total\nenergy\nwhere the subscripts\n//\nW\nW\nW\n+\n=\n⊥\n⊥ and // refer to perpendicular and parallel to the field.\nCalculate\n, the motion of the guiding center.\n\n)\n(t\nz\nb) Calculate the grad B and curvature components of the drift velocity of the particle when its guiding\ncenter is located at\n\n/\n,0\nA\n=\n=\nr\nz\n\nc) Find an equation for\n, the turning point of a particle with a guiding center that passes through the\npoint\nwith energy\ntz\n/\n,0\nA\n=\n=\nr\nz\n//\nW\nW\nW\n+\n=\n⊥\n. Do not solve the equation. (Hint: this will require\ncalculation of the equation of the field lines.)\n\nProblem 2.\n\nThe earth's dipole magnetic field is given by\n\n(\n)\nθ\nθ\nθ\nˆ\ncos\nˆ\nsin\n+\n-\n=\n-\nr\nr\nR\nx\nB\ne\nG\n\nwhere Re is the radius of the earth, approximately 6400 km. Here θ is the latitude and r is the distance\nfrom the earth's center. The actual field in the vicinity of the earth is more complicated due to\ninteraction with the interplanetary magnetic field and solar wind, but this complication will be ignored\nfor the purpose of this problem.\n\ni) The magnetic field lines are found by solving the differential equation\nθ\nθ\nB\nB\nrd\ndr\nr\n=\n. Carry out the\nsolution to this ODE to find the equation of the field lines in the form\n).\n(θ\nr\nr =\n\nii) Let Be be the value of B on the equator (θ = 0) at some r. Determine B in terms of Be and θ,\nwhere B is the magnitude of B\nG\nthat one would measure as one followed a field line from the\nequator.\n\niii) A particle is injected into the earth's field at some radius R0 at the equator. The particle has\nenergy W0, with\n2W\nW =\n⊥\nand W||\n1W\n=\n. Calculate the latitude\nref\nθ\nat which the particle is\nreflected. Assume\nref\nθ\nis small enough that small argument expansions to lowest non-zero order in\nθ can be used for all trigonometric terms.\n\niv) Using the particle's drift velocity at the equator as characteristic of the particle's drift velocity\nas it undergoes oscillation in latitude, estimate the time required for the particle to circle the earth.\nEvaluate numerically for a proton with W0 = 1 Mev injected at r =2Re. Is rL small enough for our\nderivation of the\nand curvature drifts to be valid?\nB\n∇\n\nz\nProblem 3.\n\ny\n\nThe figure illustrates a sheared magnetic field given by\n\n⎪\n⎪\n⎭\n⎪⎪\n⎬\n⎫\n⎪\n⎪\n⎩\n⎪⎪\n⎨\n⎧\n>\n-\n<\n<\n-\n-\n<\n=\na\ny\nz\nB\na\ny\na\nz\na\ny\nB\na\ny\nz\nB\nB\nˆ\nˆ\nˆ\nG\n,\n\nwhere ±a defines the sheared region and B0 is the constant field amplitude outside the sheared region.\nSuch field configurations occur both in laboratory as well as in terrestrial and astrophysical plasmas.\n\ni) Consider first a particle whose guiding center is located at x = 0, y = a/2 at t = 0. Describe its\nmotion assuming rL << a. What constraint does this condition imply for the particle's\n?\n⊥\nW\n\nii) Consider now a particle whose position is located at x = 0, y = 0 with velocity vy = V, vx = 0,\nall at t=0. Derive the differential equations describing its motion.\n\niii) By solving these equations, determine the maximum extent of the particle's orbit in the y-\ndirection. Assume that the parameters are such that the particle does not reach the region of\nuniform field. What condition assures that this will be a valid assumption?"
    },
    {
      "category": "Assignment",
      "title": "pset2sol_02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/f298182bb399fc439f48be351387ffcd_pset2sol_02.pdf",
      "content": "Motes :\n+ &37ccfrt&.,\nO\n~\nC\nW\n.\n0 x 9 w/ r&/r t.ivtq+ y\n(yo@ Y/ //\n6 L L k L i f\n*\n/dd )\n+ *flu)/\nh s 7 2 &LC*\n\n2 3 0 i u . p Pap-\n\nb)\nWe've\nt\nm\nYatC\n% &-j~-\ni*c\n9 veleu8tc( p=\nboon-\n:\n/\nl;-\nC\n-\na\n94-\n9-7 bee'-% =s\n- + d-y\n-_f.\n-3;-\n- 4 L\ndT\ni k\nw---&--\n& ~ACL- A-\n;S\nAT,, = 2 - % ~ v m \\ .\nso, + AJ\nb-s,\nU\n'\nv\nc\n\n4)-\n&d+\n, 2 5 x Z d 7 + f s :\nY\n--J\n.--u\nS t ,\n- E k d 3 -\nCE Elr/73T(~+a)\n-\n- /os\n*- -\nS Z\n~ C E * ) ~ 3.w -7'-\n\n7 a p\nV i e w"
    },
    {
      "category": "Resource",
      "title": "ps3_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/b63f201b9b59b84377ada44edce3283d_ps3_05.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n27 September 2005\n\nDue: 4 October 2005\nProblem Set 3\n\nProblem 1.\n\nConsider a collision between an ion or electron and a neutral atom. Assume that the atom is massive\nenough so that its motion during the interaction is negligible.\n\nWhen the charged particle approaches the atom, its electric field E\nr\ninduces a dipole moment in the\natom which we will take to have the form\n\nE\np\nr\nr\nα\n-\n=\n\nwhere α is a constant. The dipole moment in turn creates a dipole electric field\nd\nE\nr\ngiven by\n\n)ˆ\n(ˆ\nr\np\nr\np\nr\nEd\nπε\nr\nr\nr\n-\n-\n=\n\nwhere rr is the radius vector from the center of our coordinate system, located at the atom.\n\ni) The incident charged particle has impact parameter b and initial velocity v0. Using the same\ncoordinate system as used in our treatment of charged particle collisions, determine the appropriate\nexpressions for conservation of angular momentum and energy for the incident particle.\n\nii) Setup an integral expression for the deflection angle of the particle.\n\niii) Evaluate the expression found in ii) in terms of an elliptic integral. Determine the deflection in the\nlimit of weak interaction, i.e., large impact parameter, and compare with the corresponding result for\nthe Coulomb interaction.\n\nProblem 2. To be issued on Thursday, 9/29."
    },
    {
      "category": "Resource",
      "title": "ps3_part2_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/804fe66f391dea82bcee161fd27ba339_ps3_part2_05.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n29 September 2005\n\nDue: 4 October 2005\nProblem Set 3 (continued)\n\nProblem 1 (iii). Hint: You may find integral 3.131-8 in \"Table of Integrals, Series and Products\" by\nGradshteyn and Ryzhik useful (several copies are on reserve in the PSFC library).\n\nProblem 2.\n\nThe problem here is to calculate how a high energy beam of ions slows down by colliding with the\nelectrons and ions in a plasma. Consider a mono-energetic beam of ions with mass\n, charge\n,\nand velocity\n. The beam slows down by means of Coulomb collisions with the plasma in\naccordance with the relation\nb\nm\ne\nZb\nb\nb\nv\nx\nv\nˆ\n=\nr\n\nb\nbi\nbe\nb\nb\nb\nv\nm\ndt\ndv\nm\n)\n(\nν\nν\n+\n-\n=\n\nHere,\nbe\nν\nand\nbi\nν are the 90 ° beam-electron and beam-ion momentum loss collision frequencies\nrespectively. When the beam has lost all of its directed velocity, all of its initial kinetic energy has\nbeen transferred to the plasma.\n\nThe value of\nbi\nν , (with all the correct coefficients) follows from our analysis in class and is given by\n\n/\n)\n/\n(\n.0\nln\nln\n)\n(\nb\nb\nb\nb\nr\ni\nb\nb\nr\ni\nb\nb\nbi\nv\nm\nn\nv\nm\nm\nn\ne\nZ\nv\nm\nm\nn\ne\nZ\nv\n=\nΛ\n≈\nΛ\n=\nε\nπ\nε\nπ\nν\nsec-1\n\nHere we have assumed that the thermal velocity of the plasma ions is much less than the beam\nvelocity. Thus, the relative velocity between beam ions and plasma ions is accurately approximated\nby\n. The numerical value corresponds to 3.5 MeV alpha particles slowing down on 15 keV ions\nin a D-T fusion reactor. Also\nis the density measured in units of\nparticles/m\nbv\nv ≈\nn\n3 and\nis\nmeasured in MeV. The quantity ln\n.\n/\nb\nbv\nm\n.\n=\nΛ\n\nA similar relationship exists for\nbe\nν\nexcept that in this case, because of the small electron mass, the\nelectron thermal velocity is much greater than the beam velocity. Therefore, the average relative\nvelocity between electrons and beam ions is approximately equal to the electron thermal velocity:\n. A careful calculation that gets all the numerical coefficients correct is given by\nTe\nv\nv ≈\n\n/\n/\n/\n/\nln\n)\n(3\n)\n(\ne\ne\nb\ne\ne\nb\nb\nbe\nT\nn\nT\nm\nn\nm\ne\nZ\nv\nv\n=\nΛ\n=\nε\nπ\nsec-1\n\nwhere\nis the plasma temperature measured in keV.\neT\n\na.) Observe that for large values of\nthe electron collision frequency is larger than the ion\ncollision frequency. For small\nthe ions dominate. The critical transition velocity\n\noccurs when\nbv\nbv\ncrit\nv\nbi\nbe\nν\nν\n=\n. Derive an analytic formula for\nand numerically evaluate the ratio\nassuming that\n, corresponding to alpha particles, and\ncrit\nv\ne\ncrit\nb\nT\nv\nm\n/\nproton\nb\nm\nm\n=\nproton\ni\nm\nm\n5.2\n=\n,\ncorresponding to a 50-50 fuel mix. If the alphas start with an energy of 3.5 MeV and the\nelectrons are also at\nkeV, at what beam energy does the transition occur?\n=\neT\n\nb. Solve the differential equation to determine\nassuming that\ncorresponds to 3.5\nMeV. Calculate the time\nfor the beam ions to slow down to the transition value. During\nthis time most of the energy has been transferred to electrons. Calculate how long it takes for\nthe remainder of the beam energy to transfer mainly to the ions:\n)\n(t\nvb\n)\n(\nbv\ncrit\nt\ncrit\nfinal\nt\nt\nt\n-\n=\nΔ\nwith\nthe\ntime where the beam has slowed down to the ion thermal velocity\n. At this time\nthe beam has essentially lost all of its energy. Assume\nfinal\nt\nT\nv\nm\nb\nb\n≈\n/\n20 =\nn\n.\n\nc. The last part of the problem involves calculating what fraction of the total beam energy is\ntransferred to electrons and what fraction to ions. Define the alpha energy as\n.\nConservation of energy then implies that\n/\nb\nb\nb\nv\nm\nU =\n\nb\nbi\ni\nb\nbe\ne\nU\ndt\ndU\nU\ndt\ndU\nν\nν\n=\n=\n\nEvaluate\nand\nby integrating these equations using the solution for\nobtained in\npart (b). Integrate from\nuntil\ne\nU\ni\nU\n)\n(t\nUb\n=\nt\nfinal\nt\nt =\nand evaluate the energy fractions\n\ni\ne\ni\ni\ni\ne\ne\ne\nU\nU\nU\nf\nU\nU\nU\nf\n+\n=\n+\n=\n\nat\n. At\nkeV, what fraction of alpha energy is transferred to electrons and what\nfraction to ions? The integrals can be evaluated numerically, but with a little thought several\naccurate approximations can be made that allow a fully analytic solution.\nfinal\nt\nt =\n=\nT"
    },
    {
      "category": "Exam",
      "title": "finalexam02_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/57ed3a52912955e1f46bbe456e19622f_finalexam02_sol.pdf",
      "content": "6- &S &i-r\n&\n- (v- ts; ]Yve2\n--,G = - -L (I-\n-- e\n3 k=\nbe.\nV'eL\nn ct%2.-. .)\n\nNAP (/cfl ufi\n< ~ u . ~ n t P&\nln, BW 1\n~ * C M & ="
    },
    {
      "category": "Resource",
      "title": "midterm02_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/75a6a369199ccec2b7b48bee7490c683_midterm02_sol.pdf",
      "content": ""
    },
    {
      "category": "Exam",
      "title": "final_exam_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/0ca2f4ae26a6cce85342f802c9b948b1_final_exam_05.pdf",
      "content": "NAME__________________________________\n\nMassachusetts Institute of Technology\nIntroduction to Plasma Physics\n\n6.651J,8.631J,22.611J\n\nR. Parker\n\n20 December 2005\n\nFinal Exam\n\n1:30-4:30 PM\n\nNOTES: There are 8 pages to the exam, plus one formula sheet. Make sure that your copy is complete.\n\nEach problem is worth 20%, although the problems differ somewhat in complexity. It is a good idea to\nlook through all problems before deciding in which order to attack them!\n\nProblem 1.\n\nThe figure shows field lines in a cylindrically symmetric magnetic mirror plasma confinement device.\n\nr\n\nz\n\nThe field is given by\n\nr\nrz\nB\nz\nz\nB\nB\nˆ\nˆ\n)\n1(\nl\nl\nr\n-\n+\n=\n\na) A particle orbits in the mirror with its guiding center moving along the z-axis. At z=0, it has total\nenergy\nwhere the subscripts\n//\nW\nW\nW\n+\n=\n⊥\n⊥ and // refer to perpendicular and parallel to the field.\nCalculate\n, the motion of the guiding center.\n\n)\n(t\nz\nb) Calculate the grad B and curvature components of the drift velocity of the particle when its guiding\ncenter is located at\n\n/\n,0\nl\n=\n=\nr\nz\n\nc) Find an equation for\n, the turning point of a particle with a guiding center that passes through the\npoint\nwith energy\ntz\n//\nW\nW\nW\n+\n=\n⊥\n/\n,0\nl\n=\n=\nr\nz\n. Do not solve the equation. (Hint: this will require\ncalculation of the equation of the field lines.)\n\nProblem 2.\n\nThe ideal MHD equations together with the appropriate form of Maxwell's equations are:\n\nt\nB\nE\ndt\np\nd\nB\nj\nB\np\nB\nj\ndt\nv\nd\nB\nv\nE\nv\nt\n∂\n∂\n-\n=\n×\n∇\n=\n⋅\n∇\n=\n×\n∇\n∇\n-\n×\n=\n=\n×\n+\n=\n⋅\n∇\n+\n∂\n∂\n-\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\n)\n(\n,\nγ\nρ\nμ\nρ\nρ\nρ\n(1)\n\nAs we have seen in class, the linearized version of these equations supports undamped shear and\ncompressional Alfven waves in a homogenous plasma immersed in a uniform magnetic field. For\nexample, with\nˆB\nz\nB =\nr\nE\nr\nthe\n-field in the shear wave can be written\n\n)\ncos(\nˆ\nt\nz\nk\nE\nx\nE\nA\nω\n-\n=\nr\n\nA\nA\nc\nk\n/\nω\n=\nand c\nwhere\nA is the Alfven speed.\n\nIf the conductivity of the plasma is considered to be large but finite, the only modification to the above\nideal equations is in the Ohm's law, which takes the form\n\nj\nB\nv\nE\nr\nr\nr\nr\nη\n=\n×\n+\n\nAs expected, the resistivity leads to damping of the Alfven wave, as you are asked to show in this\nproblem.\n\na) Assume the equilibrium plasma is homogenous, and without current or flow. Specifically assume\n\n)\n,\n(\n)\n,\n(\n)\n,\n(\n)\n,\n(\n)\n,\n(\n)\n,\n(\nt\nr\np\np\np\nt\nr\nj\nj\nt\nr\nE\nE\nt\nr\nB\nB\nB\nt\nr\nv\nv\nt\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\nr\n+\n=\n=\n=\n+\n=\n=\n+\n=\nρ\nρ\nρ\n\nwhere the quantities labeled with a subscript 0 are constants while the quantities labeled with subscript\n1 are small perturbations. Write down a complete linearized set of equations for the perturbed\nquantities.\n\nb) Assume that we are interested in waves with space-time dependence given by\nIn\nthe absence of resistivity, the perturbed magnetic field is given by\n).\nexp(\nt\ni\nr\nki\nω\n-\n⋅r\nr\n\nω\n)\n(\nB\nv\nk\nB\nr\nr\nr\nr\n×\n×\n-\n=\n\nIn the presence of resistivity, the perturbed magnetic field can be written in the form\n\n∗\n×\n×\n-\n=\nω\n)\n(\nB\nv\nk\nB\nr\nr\nr\nr\n\nDetermine\n.\n∗\nω\n\nc) Again in the absence of resistivity, the velocity is determined by solution to the equation\n\n[\n]\nV\nk\nk\nc\nz\nz\nV\nk\nk\nc\nV\nS\nA\nr\nr\nr\nr\nr\nr\nr\n⋅\n+\n×\n×\n×\n×\n=\nˆ\n))\nˆ\n(\n(\nω\n,\n\nwhere we have taken the equilibrium magnetic field to be in the z-direction. In the presence of\nresisitivity, the same equation applies, but with\nand\n. Determine\nand\n.\n∗\n⇒\nA\nA\nc\nc\n∗\nA\nc\n∗\n⇒\nS\nS\nc\nc\n∗\nSc\n\nd) By making the substitution suggested in part c), determine the dispersion relation of the shear\nAlfven mode propagating in the direction of\nB\nr\nB\nV\nr\nr\n⊥\nwith\n, including the effect of resistivity.\n\nω\ne) Assume that\nis real (corresponding to a source of this frequency.) Then, for the wave considered\nin part d),\n)\n(ˆ\ni\nr\nik\nk\nz\nk\n+\n=\nr\n, where k and k\nr\ni are the real and imaginary parts of the wavenumber.\nDetermine kr and k .\ni\n\nProblem 3.\n\nΩ\n=\nr\nV\nθˆ\nr\nConsider an axisymmetric θ-pinch in which the plasma rigidly rotates, i.e.,\nwhere Ω is a\nconstant. The central beta\nis 50%, and the edge speed reaches sonic levels, i.e.,\n)\n/\n/(\nμ\nB\np\ni\nm\nKT\na\n=\nΩ\n, where T0 is the central temperature and a is the plasma radius. Throughout this problem\nassume\nand neglect viscosity.\niT\nTe =\n\nNote: The two parts of this problem are independent.\n\na) Find B(a-), the B-field just inside the edge of the plasma in terms of\n, the field at the center of the\nplasma. Assume that the plasma pressure vanishes at r = a.\nB\n\nb) The plasma temperature as a function of radius is given by\nwhile the density is\ngiven by\nwhere\nis a constant. Determine the confinement time of the plasma defined by\n)\n/\n1(\na\nr\nT\nT\n-\n=\nn\nn =\n0n\n\nP\nW\nE =\nτ\n\nwhere W is the thermal energy stored per unit length and P is the power lost by conduction per unit\nlength. Neglect any spatial variation of\nΛ\nn\nl\n.\n\nL\nρ\nExpress your answer in terms of: a, the plasma radius;\n, a collision time evaluated at r = 0;\nτ\n, the\nLarmor radius of a thermal particle also evaluated at r = 0; and B(a-)/BB0. Be sure to properly identify\nthe collision time and the Larmor radius in terms of type and species.\n\nA page of possibly useful formulas reproduced from the Plasma Formulary is found on the next page.\n\nProblem 4.\n\nConsider 1-D plasma oscillations proportional to\n)\nexp(\nikx\nt\ni\n+\n-ω\nin a hot plasma with a 1-D electron\ndistribution function given by\n\n)\n(\n~\ne\nx\ne\nx\ne\nv\nv\nv\nv\nf\n+\n= π\n.\n\nFor simplicity assume that k is real, but that ω could be complex.\n\na) Determine an algebraic dispersion relation for electron oscillations, assuming that the ions are\nimmobile.\n\nb) Solve the dispersion relation obtained in a) for\n\n).\n(k\nω\n\nc) Now assume that the ions have a distribution function given by\n\n)\n(\n~\ni\nx\ni\nx\ni\nv\nv\nv\nv\nf\n+\n= π\n,\n\nev\nk <<\n/\nω\nwhile the electron distribution function is the same as in part a). Assuming\n, determine\nfor ion acoustic waves.\n)\n(k\nω\n\nPossibly useful integrals:\n\nIm\n)\n(\n)\n(\n)\n(\n>\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n-\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n<\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n+\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n>\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n+\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\nx\nx\ne\nx\nx\nv\ni\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n<\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\nx\nx\ne\nx\nx\nv\ni\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n>\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n-\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n<\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n+\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nProblem 5.\n\nA plane wave is incident on a plasma slab, as indicated schematically in the figure below.\n\ny\n\nn\n∇\nx\nk\nr\n\nz\n\nThe plasma density is uniform an the y- and z-directions, but varies in the x-direction and is given by\n\nl\nx\nn\nn\n=\n\nwhere , the gradient scale length, is long compared to the wavelength. i.e.,\nThere is a\nmagnetic field in the z-direction,\n.1\n>>\nl\nk\nl\nˆB\nz\nB =\nr\nwhere\nis constant. The parameters are such that\nB\n\n.\nce\npe\nn\nn\nω\nω\n=\n=\n)\n(\n\nThroughout this problem, consider only the electron response to the wave field.\n\n/\n=\nl\nx\na) On the left graph below, indicate the region(s) of propagation up to\nfor the ordinary mode.\n\n/\n=\nl\nx\nb) On the right graph below, indicate the region(s) of propagation up to\nfor the extraordinary\nmode.\n\nc) What is the maximum depth of propagation of the extraordinary mode for frequencies less than the\nelectron cyclotron frequency?\n\nω/ωce\nl\n/\nx\n\nω/ωce\nl\n/\nx"
    },
    {
      "category": "Exam",
      "title": "mid_term_quiz_05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/5994438c4b8017dd801f326915359d57_mid_term_quiz_05.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n25 October 2005\n\n1.5 Hours\nMid-Term Quiz\n\nNote: Closed book, one 8.5\"x11\" sheet of notes is permitted.\n\nProblem 1. (35%)\nB lines\nJ\ny\nθ\nx\nr\n\nThe figure depicts a long z-pinch with current density\n)\n(\nˆ\nr\nJ\nz\nJ =\nr\n, magnetic field\n, and\npressure\nThere is no flow and the resistivity is assumed to be zero. Also\n)\n(\nˆ\nr\nB\nB\nθ\n=\nr\n).\n(r\np\np =\ni\ne\ni\ne\np\np\nn\nn\n=\n=\n,\nand\n.1\n=\niZ\n\na) What is the relation between\nand\nrequired to assure MHD equilibrium?\nB\np,\nJ\n\nb) Calculate the current density\nassociated with the electron and ion drifts.\nD\nJ\nr\n\nc) The relation between\nand\nin parts a) and b) is not at all obvious and in fact they are not the\nsame. The missing link is the so-called diamagnetic current which is given by\nJ\nD\nJ\nr\n\nM\nJ M\nr\nr\n×\n-∇\n=\n\nwhere the magnetization is\nb\nB\np\nb\nB\nnw\nM\nˆ\nˆ =\n=\n⊥\nr\n. Compute\nD\nM\nJ\nJ\nr\nr\n+\nand compare with J\nr\nas determined\nin part a).\n\nNote: In cylindrical coordinates:\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n-\n+\n∂\n∂\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n-\n∂\n∂\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n-\n∂\n∂\n=\n×\n∇\nθ\nθ\nθ\nθ\nθ\nθ\nr\nA\nr\nA\nr\nA\nz\nr\nA\nz\nA\nz\nA\nr\nA\nr\nA\nr\nz\nr\nz\nˆ\nˆ\nˆ\nr\n\nProblem 2. (35%)\n\nThe figure below illustrates a collision between two hard spheres of the same radius R. In the case\n\ny\nb\n\nx\n\nshown, the shaded sphere has infinite mass and is therefore stationary during the collision. The final\nvelocity of the moving sphere is then given by\n\nˆ\nˆ\nR\nb\nR\nb\nV\ny\nR\nb\nV\nx\nV f\n-\n+\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n=\nr\nfor\nR\nb\n<\n\nfor\n\nˆV\nx\nV f =\nr\nR\nb\n>\n\nwhere b is the impact parameter and\nis the moving sphere's initial velocity.\nV\n\na) Assume now that in the collision the incident sphere has mass m1 while the initially stationary\nsphere has mass m2. What will be the final velocity of the incident sphere?\n\nb) A beam of such spheres with mass m1 and initial velocity\n0vr is passing through a \"sea\" of spheres\nwith mass m2 and density n(m-3). Calculate the frequency for slowing down\nsd\nν\ndefined by\n\nv\ndt\nv\nd\nsd\nr\nr\nν\n-\n=\n.\n\nProblem 3. (30%)\n\nA cold homogeneous plasma supports oscillations at the plasma frequency\n.\np\nω\nω =\nPerhaps\nsurprisingly, the oscillation occurs at the same frequency regardless of the wavenumber\n.\n/\nλ\nπ\n=\nk\n\nHowever, when pressure is included in the equations describing a plasma oscillation, the situation\nchanges and the frequency of oscillation depends on k. In this problem you are asked to find the\nk\n-\nω\nrelationship for a plasma in which pressure plays a role.\n\na) The electron fluid equations are:\n\n)\n(\nn\nn\ne\nE\nn\np\npn\np\nE\nen\ndt\nv\nd\nn\nm\nv\nn\nt\nn\ne\n-\n-\n=\n-\n∇\n=\n∇\n-\n-\n=\n=\n-\n∇\n+\n∂\n∂\n-\n-\nr\nr\nr\nr\nε\nγ\nγ\n\nLet\n,\n,\np\np\np\nv\nv\nn\nn\nn\n+\n=\n=\n+\n=\nr\nr\nand\nE\nE\nr\nr\n=\nwhere quantities with subscript 0 refer to the spatially\nhomogeneous equilibrium and those with subscript 1 indicate small perturbations. Develop a set of\nlinear equations sufficient to solve for the perturbed variables.\n\nb) Assume that all variables have time-space dependence proportional to\n)\nexp(\nikx\nt\ni\n+\n-ω\n. Determine\nthe relation between ω and k that permits a nontrivial solution to the equations that you found in part\na)."
    },
    {
      "category": "Exam",
      "title": "final_exam_06_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/ff021f10dec6d698bb1fb16d42e98bc6_final_exam_06_3.pdf",
      "content": "NAME__________________________________\n\nMassachusetts Institute of Technology\nIntroduction to Plasma Physics\n\n6.651J,8.631J,22.611J\n\nR. Parker\n19 December 2006\n\nFinal Exam\n\n9:00 - 12:00\n\nNOTES: There are 8 pages to the exam. Make sure that your copy is complete. Each problem is\nworth 25%, although the problems differ somewhat in complexity. It is a good idea to look\nthrough all problems before deciding in which order to attack them!\n\nProblem 1.\n\nAn axisymmetric\n)\n/\n(\n=\n∂\n∂\nφ\ntoroidal confinement system is depicted below. In this problem you will\nbe asked to describe the motion of a particle injected into this configuration with various magnetic\nfields and initial conditions. Throughout the problem the poloidal coordinates, i.e., the coordinates in a\nplane φ = constant, of the center of the particle's Larmor motion are denoted by\nand\nor by\nand\n)\n(t\nx\n)\n(t\ny\n)\n(t\nr\n)\n(t\nθ\n.\n\nx\ny\nr θ\nφ\nR\nR0\n\na) Consider first that the magnetic field is purely toroidal and given by\n\nφˆ\n0 R\nR\nB\nB =\nr\n\nDetermine x(t) and y(t) for a particle whose initial coordinates (of the center of its Larmor motion) are:\n\n)\n(\n,0\n)\n(\n=\n=\n=\n=\nt\ny\nt\nx\n\nProblem 1. (Cont'd)\n\nand whose initial energy is\n//\nmv\nmv\nmv\n+\n⊥\n=\nwhere the subscripts ⊥ and // refer to\nperpendicular and parallel to the magnetic field, respectively. Denote the charge of the particle by q.\n\nb) Now assume that a weak poloidal field is added to the system, for example by adding a current in\nthe φ-direction, so that the total magnetic field is\n\nθ\nθ\nφ\nˆ\nˆ\nR\nr\nB\nR\nR\nB\nB\n+\n=\nr\n\nNeglect the drifts so that the particle follows field lines. What is the maximum value of\nv\nv⊥\nfor\nwhich a particle starting at\n,\n=\n=\nθ\nr\nr\nwill orbit through an angle of π\nin the poloidal plane?\n\nc) Consider now a particle having\n, i.e., one with its velocity parallel to\n=\n⊥\nv\nB\nr\n. Neglecting drifts,\nthe guiding center equations of motion in a poloidal plane of this particle are:\n\ny\ndt\ndx\nx\ndt\ndy\nω\nω\n-\n=\n=\n,\n.\n\nIf the particle's guiding center is at\n,\n=\n=\nθ\nr\nr\nat\n,0\n=\nt\nwhat isω ? What curve is traced out by the\norbit in a poloidal plane?\n\nd) Assume now that the drift is \"turned on\" in part c) and assume further that the poloidal field is weak\nenough so that the particle's drift is well approximated by that due to the toroidal field acting alone.\nContinuing to assume that\n, modify the differential equations in part c) to take into account this\ndrift.\n=\n⊥\nv\n\ne) Assume\nso that\nθ\nB\nB >>\n≈\nω\nconstant. By solving the differential equations in part c), determine\nthe orbit in the poloidal plane in the form\n)\n,\n(\n=\ny\nx\nf\n, assuming the same initial conditions for its\nguiding center, namely\nat\n\nr\nr =\n.0\n=\nt\n\nProblem 2.\n\nIn this problem you will be asked to estimate the thermal diffusivity of a plasma based on formulas for\ncharacteristic collision frequencies, velocities and lengths presented in the table below. Then, given the\nthermal conductivity, you will be asked to calculate the temperature distribution for a plasma heated by\nOhmic (I2R) heating.\n.\n\nQuantity/Particles\nElectrons\nProtons\n\n/\n)]\n(\n[\n)\n(\n.1\n-\n-\n-\n=\ns\nkeV\ne\nT\nm\nn\nx\ne\nv\n\n/\n)]\n(\n[\n)\n(\n5.2\n-\n-\n-\n=\ns\nkeV\niT\nm\nn\nx\niv\n\nCollision Frequency, ν\n\nThermal Velocity,\nm\nKT\ntv =\n\ns\nm\nkeV\ne\nT\nx\nte\nv\n/\n/\n)]\n(\n[\n.1\n=\n\ns\nm\nkeV\niT\nx\nti\nv\n/\n/\n)]\n(\n[\n.3\n=\n\nLarmor radius, thermal\nparticle, ρ\n\nm\nTesla\nB\nkeV\ne\nT\nx\ne\n)\n(\n/\n)]\n(\n[\n.1\n-\n=\nρ\n\nm\nTesla\nB\nkeV\niT\nx\ni\n)\n(\n/\n)]\n(\n[\n.4\n-\n=\nρ\n\nResistivity parallel to B, η\n\nm\nkeV\ne\nT\nx\nΩ\n-\n-\n=\n/\n)]\n(\n[\n5.2\nη\n\nNote:\nhas been assumed to be 15.\nΛ\nln\n\na) Using the values in the above table, estimate the thermal diffusivity ⊥\nχ\nin a direction perpendicular\nto the magnetic field of a plasma with density\n)\n(\nn\nin\ne\nn\nn\n=\n=\n, electron and ion temperatures\nand\nand field\n)\n(keV\ne\nT\n)\n(kev\niT\nB\nr\n.\n\nb) Repeat part a) for the diffusivity\n//\nχ\nparallel to the magnetic field.\n\n(Continued on the next page)\n\nProblem 2. (Cont'd)\n\nThe figure below shows the cross-section of a slab of plasma of width\n. The slab is infinite in extent\nin the x and z directions. The plasma density is n, there is a magnetic field B in the z-direction, and the\nplasma is heated by a current density J parallel to B .The ions and electrons can be assumed to be in\nequilibrium with temperature T. The density, field and current density are all spatially homogenous in\nthe plasma.\nl\n\ny\nx\nl\n=\ny\n\nl\n-\n=\ny\n\nJ\nz\nJ\nB\nz\nB\nˆ\n,\nˆ\n=\n=\nr\nr\n\nc) The equation for plasma's thermal balance is\n\n2 =\n+\n⋅\n∇\n-\nJ\nq\nη\nr\n\nwhere the heat flux is given by\ndy\nkeV\ndT\nkeV\nT\ny\ndy\ndkT\nK\ny\nm\nw\nq\n)\n(\n/\n)]\n(\n[\nˆ\nˆ\n)\n/\n(\n-\n-\n=\n⊥\n-\n=\nα\nr\nwhere α is a\nconstant. Solve the thermal balance equation for\nin terms of\n)\n(y\nT\nα ,\nand\nJ\n,l\nη where 0\nη is the\nresistivity at\n. Assume that\nis symmetric about\nkev\nT\n=\n)\n(y\nT\n=\nx\nand\n.\n)\n(\n=\nl\nT\n\nHint: Recall the method of quadrature for solving a DE of the form\n)\n(\n)\n(\nx\ng\ndy\ndx\nx\nf\ndy\nd\n=\nthat begins by\nmultiplying the equation by\ndy\ndx\nx\nf\n)\n(\n.\n\nProblem 3.\n\nA high frequency electromagnetic wave is launched along the midplane of an Alcator C-Mod plasma,\nas sketched in Figure 3a on the page 7. The field along the midplane (in Tesla) is given by\n\n/\nˆ\nr\nB\n+\n= φ\nr\n\nand the electron density along the midplane is given by\n\n)\n)\n/\n(\n1(\n)\n(\nr\nn\nr\ne\nn\n-\n=\n.\n\nThe wave frequency is f = 210 GHz (2.1x1011 Hz) and throughout this problem it can be assumed\nthat the transverse dimensions of the EM beam are small enough that it can be considered to\npropagate radially along the mid-plane of the plasma as a plane wave. Note ion motion is\ncompletely negligible at this frequency.\n\nThe square of the index of refraction of the wave as a function of distance along the mid-plane radius\nis plotted in Figure 3b. As can be seen, at r = 20 cm, the index of refraction is 1, corresponding to free\nspace, while at r = 12.5 cm the index of refraction is 0 and at r = 7.25 cm it is\n.\ninf\n±\n\na) Determine the central plasma density,\n.\nn\n\nb) Describe the plasma polarization at r = 12.5 cm, specifying whether it is linear, circular or elliptical,\nand if circular or elliptical, what plane E\nr\nis in and its direction of rotation.\n\nc) A model equation that can be used to describe the propagation of the wave is\n\n)\n(\n=\n+\n+\nE\nb\nx\na\ndx\nE\nd\n\nwhere x is distance measured from the resonance and E is the vertical component of E\nr\n. Determine\nvalues for the constants a and b.\n\nd) An analytic solution of the equation given in part iii) is available and can be used to calculate the\nreflection coefficient,\n)\nexp(\nΔ\n-\n-\n=\nΓ\nb\nπ\nwhere Δ is the distance between the cutoff and resonance.\nBased on this result, comment on whether this represents a practical scheme for heating Alcator C-\nMod plasmas.\n\n(See next page for helpful formulas)\n\nNote: The dielectric tensor for a cold plasma in a spatially homogeneous magnetic field is:\n\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n⊥\n-\n⊥\n=\n//\nK\nK\nX\nK\nX\nK\nK\nK\nt\n\nwhere\n\nω\nω\nω\nω\nω\nω\n-\n+\n-\n+\n=\n⊥\nce\npe\nci\npi\nK\n,\n⎟\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎜\n⎝\n⎛\n-\n-\n-\n=\n/\n/\nω\nω\nω\nω\nω\nω\nω\nω\nω\nce\nce\npe\nci\nci\npi\ni\nX\nK\n,\n\n//\nω\nω\nω\nω\npe\npi\nK\n-\n-\n=\n.\n\nThe time-space dependence assume is\n)\nexp(\n~\nr\nki\nt\ni\nr\nr\n⋅\n+\n-ω\nand the magnetic field is in the z-direction\n(which for this problem is the φ-direction.)\n\nThe dispersion relation for\nz\nk\nz\nx\nk\nx\nk\nˆ\nˆ\n+\n=\nr\nis:\n\n//\n=\n-\n-\n⊥\n-\n-\n⊥\nx\nk\nK\nk\nz\nk\nx\nk\nk\nK\nk\nX\nK\nk\nz\nk\nx\nk\nX\nK\nk\nz\nk\nK\nk\n\nr=0 r=20 cm\nk\nr\n\nE\nr\nφ\n\nFigure 3a. Setup for launching the wave\n\nSquare of Index of Refraction\nRadial Distance from Center of Plasma (cm)\n\nFigure 3b. Index of refraction of the wave as a function of distance in the plasma.\n\nProblem 4.\n\nIn this problem, we consider the possibility that unstable waves could exist in a plasma in which the\nelectrons are drifting through the ions. Specifically we model the electron and ion distribution\nfunctions as\n)\n(\n)\n(\ne\nv\nV\nx\nv\ne\nv\nn\nx\nv\nef\n+\n-\n=\nπ\n\n)\n(\niv\nx\nv\niv\nn\nx\nv\nif\n+\n=\nπ\n\nwhere V is the electron drift velocity and\nis the equilibrium density. (The ion charge is assumed to\nbe e so that\n.)\nn\nn\ne\nn\ni\nn\n=\n=\n\nConsider wave motion with the time-space dependence given by\n)\nexp(\nikx\nt\ni\n+\n-ω\n. For simplicity\nassume that k is real, but that ω could be complex.\n\na) Determine an algebraic dispersion relation relating ω and k.\n\nb) Repeat part a) using the quasi-neutrality approximation which is valid for low frequencies, namely,\nwhere\nand\nare respectively the perturbed electron and ion densities.\n,0\n=\n+\ni\nn\ne\nn\ne\nn1\ni\nn1\n\nc) Solve the dispersion relation obtained in b) for\n)\n(k\nω\n.\n\nd) Using the result from part c), for what values of the drift speed will the plasma waves be unstable?\n\nPossibly useful integrals:\n\nIm\n)\n(\n)\n(\n)\n(\n>\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n-\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n<\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n+\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n>\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n+\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\nx\nx\ne\nx\nx\nv\ni\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n<\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nπ\nς\ne\ne\nx\nx\ne\nx\nx\nv\ni\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n>\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n-\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv\n\nIm\n)\n(\n)\n(\n)\n(\n<\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n+\n+\n-\n=\n-\n+\n∫\ninf\ninf\n-\nς\nς\nς\nς\nπ\nς\ne\ne\ne\nx\nx\ne\nx\nx\nv\niv\nv\ndv\nv\nv\nv\nv"
    },
    {
      "category": "Exam",
      "title": "mid_term_quiz_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/c7f405b55a9bd7bf9b824fd9bf550296_mid_term_quiz_06.pdf",
      "content": "Massachusetts Institute of Technology\n\nSubject 6.651J/8.613J/22.611J\n\nR. Parker\n31 October 2006\n\n1.5 Hours\nMid-Term Quiz\nNote: Closed book, one 8.5\"x11\" sheet of notes is permitted.\n\nProblem 1. (35%)\n\nThe figure below shows a charged particle moving in a 2-dimensional dipole magnetic field. The\nparticle's mass is m and its charge is q. The field is given by\n\n)\ncos\nˆ\nsin\nˆ\n(\nθ\nθ\nθ +\n-\n=\nr\nr\nR\nB\nB\nr\n\nr\nx\ny\nθ\nParticle with mass\nm, charge q at\nposition r, θ\n\nwhere R and BB0 are constants and\nθ\n,r\nare the usual cylindrical coordinates. The field is independent of\nthe z-coordinate. Hint: The field lines for this 2-D dipole are circular and are given by r α cosθ .\n\na) At θ = 0, the particle is located at r0, its perpendicular energy is\nand its total energy is W\n⊥\nW\n0.\nDetermine the particle's maximum angular displacement θmax (measured from the x-axis.)\n\nb) Determine the particle's drift velocity as a function only of its θ-coordinate and other fixed parameters.\n\nc) The particle's equation of motion parallel to the field has the form\n)\n(\nθ\nθ\nf\ndt\nd\n=\nwhere\n)\n(θ\nf\nis a\nfunction of θ and the other fixed parameters of the problem, but not of r. Determine\n)\n(θ\nf\n.\n\nNote: In cylindrical coordinates:\n\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n-\n+\n∂\n∂\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n-\n∂\n∂\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n-\n∂\n∂\n=\n×\n∇\nθ\nθ\nθ\nθ\nθ\nθ\nr\nA\nr\nA\nr\nA\nz\nr\nA\nz\nA\nz\nA\nr\nA\nr\nA\nr\nz\nr\nz\nˆ\nˆ\nˆ\nr\n,\nz\nz\nr\nr\nr\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n=\n∇\nφ\nθ\nφ\nθ\nφ\nφ\nˆ\nˆ\nˆ\n\nProblem 2. (35%)\n\nThe figure below illustrates a collision between two particles. In the case shown, the shaded particle\n\nb\nx\ny\nψ\nm1, v0\n\nhas infinite mass and is therefore stationary during the collision. The moving particle has mass m1, speed\nv0 and the impact parameter for the collision is b.\n\nThe force between the two particles is k/r3 where k is a constant and r is the distance of separation. The\nforce is repulsive and acts along a line connecting the particles.\n\na) Determine the distance of closest approach, rmin, i.e., the minimum distance between the particles\nduring the collision event.\n\nb) Calculate the angular deflection ψ of the incident particle and the impact parameter, b90, for a 90o\ncollision. One of the integrals on the next page should be useful to you in answering this part.\n\nAssume now that the particle at the origin has finite mass m2 and is stationary before the collision.\n\nc) Calculate, in terms of ψ, the loss in x-directed momentum suffered by particle 1 as a result of the\ncollision.\n\nd) Consider now a beam of particles with mass m1 and velocity\ninjected into a \"sea\" of initially\nstationary particles with mass m\nxv\nxˆ\n2. (The force of interaction continues to be k/r3.) The initial rate of\nmomentum loss of the beam particles is\nx\np\nv\nm1\nυ\nwhere\n\nx\np\np\nv\nn σ\nυ\n=\n.\n\nand n2 is the density of particles with mass m2.. The cross-section\np\nσ is determined by an integral of the\nform\n\n∫\ninf\n=\n)\n(\ndb\nb\nf\np\nσ\n\nDetermine\n\n).\n(b\nf\n\nIntegrals:\n\n(\n)\nln\na\nx\nx\na\nx\ndx\n-\n+\n=\n-\n∫\n\na\nx\na\nx\nxdx\n-\n=\n-\n∫\n\n)\nln(\na\nx\nx\na\na\nx\nx\na\nx\ndx\nx\n-\n+\n+\n-\n=\n-\n∫\n\n/\n)\n(\na\nx\na\na\nx\na\nx\ndx\nx\n-\n+\n-\n=\n-\n∫\n\nx\na\na\na\nx\nx\ndx\ncos\n-\n=\n-\n∫\n\nx\na\na\nx\na\nx\nx\ndx\n-\n=\n-\n∫\n\na\nx\na\nx\na\na\nx\na\nx\nx\ndx\nsec\n-\n+\n-\n=\n-\n∫\n\nProblem 3. (30%)\n\nThe figure below depicts a long z-pinch with magnetic field\n)\n(\nˆ\nr\nB\nB\nθ\n=\nr\nand pressure\n. The pinch has a\ncircular cross-section radius and the pressure vanishes at the radius a. The mass density ρ is constant, ρ =\nρ\n)\n(r\np\n0. Assume in this problem that the usual MHD equation of state\n=const is not valid for the\nequilibrium, and that the pressure can be determined independent of the density.\nγ\nρ -\np\n\nθ\nx\ny\nr\nJ\nB lines\n\n2a\n\na) The plasma is undergoing rigid-body rotation in the θ-direction, i.e., the plasma velocity is\nΩ\n=\nr\nV\nθˆ\nr\n\nwhere Ω is a constant. What is the relationship among\n,\nand\n)\n(r\nB\n)\n(r\np\nΩ necessary to assure MHD\nequilibrium?\n\nb) The current density in the z-pinch is constant, i.e.,\nˆJ\nz\nJ =\nr\nwhere\nis a constant. Solve the equation\nfound in part a) to determine\nassuming that\nJ\n)\n(r\np\n)\n(\n=\na\np\nwhere a is the outer radius of the z-pinch.\n\nc) Determine the β of the plasma define as\n)\n(\n)\n)\n(\n(\nμ\nβ\nθ a\nB\nrdr\nr\np\na\na\n∫\n=\n.\n\nPossibly useful formula:\n\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n+\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n=\n∇\n-\nz\nb\na\nb\nr\na\nr\nb\na\nz\nr\nb\na\nz\nb\na\nb\nr\na\nr\nb\na\nr\nb\na\nz\nb\na\nb\nr\na\nr\nb\na\nr\nb\na\nz\nz\nz\nz\nr\nr\nz\nr\nr\nz\nr\nr\nr\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nθ\nˆ\nˆ\nˆ\nr\nr"
    },
    {
      "category": "Exam",
      "title": "finalexam2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/67b7deecadf46ae96f86f8bb451ddf68_finalexam2002.pdf",
      "content": "Fall Term 2002\nIntroduction to Plasma Physics I\n22.611J, 6.651J, 8.613J\nFINAL EXAM\n1. Short Answer (18 points)\n(a) Write the formulas for the electron plasma frequency and the ion plasma frequency (be\nsure to include any dependence on ionic charge, Zi). You may use the expression for the\nsquare if so noted.\n(b) Write the formula for the ion cyclotron frequency.\n(c) Write the formulas for the electron Debye length and the ion Debye length.\n(d) True or False. The Vlasov equation describes an incompressible flow in phase space.\n(e) True or False. The Vlasov equation describes the conservation of particles in self con-\nsistent phase space flow.\n(f) TrRue or False. The Vlasov equation describes a fluid whose fluid dynamic flow, V =\nd3vvf , is incompressible, ∇ · V = 0.\nn\nR\n(g) True or False. The Vlasov equation conserves entropy, S = - d3vf ln f .\n(h) True or False. The Vlasov equation is reversible.\n(i) True or False. The Vlasov equation relaxes a (spatially homogeneous) distribution to\nthe Maxwellian velocity dependence for long times, t →inf.\n2. Wave Energy and Dissipation (10 points): The dielectric response function, (k, ω), for\na given problem is an analytic function of frequency, ω. Show how to calculate the real and\nimaginary parts of the frequency, ω = ωr + iγ, assuming that the growth/damping rate, γ, is\nsmall compared to the real frequency, ωr, using only the knowledge of the dielectric function,\n(k, ωr ), for real frequencies. Give a physical interpretation of your result in terms of wave\nenergy and dissipation. Evaluate the (weak) dissipation for the dielectric given in equation\n(1) below.\n3. Electron Beam Instabilities (32 points): Consider an electron ion plasma created by in-\njecting 2 electron beams at energies of Eb1 = 10 KeV and Eb2 = 100 KeV into a Te ' 1 KeV\nplasma (you may consider the ions to be cold and at rest dynamically). Assume that each\nbeam has a \"temperature\" spread in energy about its mean value of, Tb ' 1 KeV , and that\nboth beams have similiar densities that are small compared to the background plasma elec\ntron density. The distribution is shown schematically in the drawing with labels attached to\nvarious features of the distribution function.\n\nEvaluate the labels, ve, vb, Ub1, Ub2 shown on the drawing and indicate which quantities, if\nany, are equal. You may take, vm1 = Ub1 - αvb, and, vm2 = Ub2 - αvb, where the quantity,\nα, can be treated as an order unity constant for the calculations below (and if you have time\nafter the rest of exam is done, you can evaluate, α, to get a perfect score on this portion of\nexam!). You may assume positive wavenumber, k, throughout.\nIndicate any phase velocity range (or ranges) where unstable waves exist. Write down any\ninequalities that characterize these modes (i.e. relations such as, ω/k A vb, although this\nparticular relation may not be relevant). Calculate the (dimensionless) wave energy and\ngrowth rate of the most unstable mode in each band (you may assume weak dissipation).\nLeading order calculations are acceptable in all cases. Recall that the dielectric response\nfunction is given by,\nω2 Z\npe\ndF\n(k, ω)\n=\n1 - k2\nduu - ω/k du\n(1)\nZ\nL\n=\n\ndu F (u)\nWhich mode dominates for long times in the linear regime?\n4. Ion Acoustic Waves (15 points): Start from the collisionless dielectric function for an\nelectron-ion plasma in thermal equilibrium,\n·\nZ\nμ ω\nkve\n¶\nkvi\n¶\n+\n1 ·\nω Z\nμ ω\nω\n(k, ω)\n=\n1 + k2λ2 1 + kvi\nk2λ2 1 + kve\ni\ne\nZ\ne-t2\nZ (ζ) ≡\n√\ndt\nπ\nL\nt - ζ\n\nwhere, λi, λe, vi =\np\n2Ti/mi, ve =\np\n2Te/me, are the usual Debye lengths and thermal\nvelocities, and show that for waves in the range, vi ¿ ω/k ¿ ve, the reactive dielectric\nresponse can be written,\nω2\npi\nR (k, ω) ' 1 + k2λ2 - ω2\ne\nThen show that for long wavelength waves, k2λ2\ne ¿ 1, this leads to the ion acoustic dispersion\nrelation,\nω2 ' k2 cs\nwith, c2\ns = Te/mi. Show that these wave are quasineutral (for, k2λ2 ¿ 1).\ne\n5. Ion-electron collisions (10 points): The energy exchange portion of the electron-ion\ncollision operator can be written, for Maxwellian ions, as,\n·\nCE\nme\n1 ∂\nTi\n∂ 1 ∂\nei (fe) = νei 2mi\nve v2 ∂v + mev2 ∂v v ∂v\n\nfe\n(2)\nR\n2 mev2 , of this operator, for Maxwellian electrons, gives,\nThe energy moment,\nd3v 1\nr\nme\n-νei\nn (Te - Ti)\nmi\nπ\nNow consider the ion-electron collision operator, Cie (fi, fe). Use a fundamental property\nof the collision operator to write down or derive an expression for the energy moment,\nR\n2 miv2 , of the ion-electron collision operator, Cie (fi, fe), assuming Maxwellian distri-\nd3v 1\nbutions for both ions and electrons. State explicitly the collision operator property that you\nused and discuss the physical implications of the result you have derived.\n6. Thermal Equilibrium (15 points):\n(a) (5 points) Show that the Maxwellian velocity distribution is the result of maximizing\nthe entropy,\nZ\nS = -\nd3vf ln f\nR\nsubject to the constraints of fixed particle number, n =\nd3vf , and fixed energy, E =\nR d3v 1\n2 mv2f .\nR\n(b) (5 points) What is the effect on the entropy, S = - d3vf ln f , when the distribution\nevolves according to,\n∂f = C (f, f )\n∂t\nwhere the Coulomb collision operator is given by,\nZ\nC (f, f ) = Γ ∂ ·\nd3 v 0U(v - v 0) ·\nμ ∂ - ∂\n∂\nv0\n¶\nf (v) f\n¡\nv 0¢\n∂v\n∂v\nwith,\nU(v - v 0)\n=\n|v - v0|\nμ\nI - (v - v0) (v - v0) ¶\n|v - v0|2\n2πq4 ln Λ\nΓ =\nm2\n\n(c) (5 points) Show that, with the energy collision operator, CE\nei (fe), given by equation\n(2), the steady state solution to,\n∂fe = CE\n∂t\nei (fe)\nis given uniquely by,\nfe (v) = const. × exp\nμ\n- 1 mev 2/Ti\n¶\nDiscuss in physical terms the two processes described by equation (2) that balance to\ngive this thermal equilibrium state."
    },
    {
      "category": "Resource",
      "title": "midterm_2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/7316c8e9481e9124353c174505fbdf5b_midterm_2002.pdf",
      "content": "Fall Term 2002\nIntroduction to Plasma Physics I\n22.611J, 6.651J, 8.613J\nMID TERM EXAM\n1. Short Answer ( 21 points - 3 each )\n(a) Write the formula for the electron plasma frequency.\n(b) Write the formula for the ion cyclotron frequency.\n(c) Write the formula for the Debye length.\n(d) True or False. Debye shielding makes plasmas quasi-neutral on scale lengths much less\nthan the Debye length.\n(e) True or False. Electron plasma oscillations result in electric fields, and non-neutrality,\non scales much less than the Debye length.\n(f) True or False. The parameter, Λ = nλ3\nDe, is a large number in a well defined plasma.\n(g) Write down the force balance equation for MHD equilibrium.\n2. ( 16 points) A plasma has the dispersion \"constant\" for transverse waves,\nω2\nk2c2\nD = 1 -\npe -\nω2\nω2\n(a) ( 6 points ) Make a plot of the dispersion relation, ω vs. k, for positive frequencies.\n(b) ( 4 points ) Write down the wave energy for these modes.\n(c) ( 6 points ) Calculate the cutoff frequency, and describe what happens to waves driven\nat frequencies below the cutoff frequency.\n3. ( 16 points) Write the formula for the total Coulomb cross section of charged particle,\n1, colliding with charged particle, 2, after the cutoffs at large and small impact parameter\nhave been applied. Estimate the momentum collision frequency for electron-ion collisions in\na plasma with temperature, Te. (if you don't know the Coulomb cross section, just assume\nsome value for the purposes of doing the rest of this problem) Use this result to write down\nthe steady state momentum equation for electrons to determine their drift velocity in the\npresence of an applied electric field. Derive an expression for the electrical conductivity in\nthis plasma.\n\n4. ( 16 points) Consider a plasma inside a toroidal vessel filled with a toroidal magnetic field\nas indicated in the figure below.\nFigure for #4: Toroidal geometry showing vertical current for magnetic field generation and\nvarious unit vector conventions\nThe magnetic field is pure toroidal (pointing out of the plane of the paper). Analyze this\nsystem using guiding center orbits. Show that the sequence of charge separation, followed\nby an electric field gives a resulting flow of the entire plasma that implies a complete lack of\nany kind of confinement. Be sure to indicate all the drifts involved, their magnitudes and\nthe resulting directions for both electron and ion flows. EXTRA CREDIT: if you finish early\nyou might want to actually compute the flow in quantitative terms, including any possible\nPOLARIZATION of the plasma.\n5. ( 15 points) A theta pinch plasma has θ directed currents that produce an axial magnetic\nfield with the radial profile,\n1⁄2\n3⁄4\nr B0 ; r < a\nBz (r) = B0\na\n; r > a\nCompute the radial pressure profile subject to the boundary condition, p (r = a) → 0. How\ndoes the result change if the edge boundary condition becomes, p (r = a) = pe?\n\n6. ( 16 points) Consider a plasma with the ions (protons) drifting in the z-direction with\nrespect to the electrons at speed, V0. Show that the dispersion relation for longitudinal\nwaves, assuming a cold-two fluid model, is,\nω2\nω2\nD = 1 -\npe -\npi\nω2\n(ω - kV0)2\nHint: Try to make a simple argument for this dispersion without going through a lengthy\nalgebraic calculation of the linearized response.\nPlot the dispersion relation for the ion modes assuming the electron response was frozen\n(ωpe → 0), and calculate the wave energy of these modes. Now allow the electrons to respond\nand show that the system will go unstable. Hint #2: Make a simple argument for instability\nfirst and go into more detail with calculations and graphs if time permits. EXTRA CREDIT\nif you can actually calculate the growth rate by taking advantage of, me/mi ¿ 1."
    },
    {
      "category": "Resource",
      "title": "chap1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/e5a91bcd39b84e278b36f9067537fe8c_chap1.pdf",
      "content": "Chapter 1\nIntroduction\n1.1\nWhat is a Plasma?\n1.1.1\nAn ionized gas\nA plasma is a gas in which an important fraction of the atoms is ionized, so that the electrons\nand ions are separately free.\nWhen does this ionization occur? When the temperature is hot enough.\nBalance between collisional ionization and recombination:\nFigure 1.1: Ionization and Recombination\nIonization has a threshold energy. Recombination has not but is much less probable.\nThreshold is ionization energy (13.6eV, H). χi\nIntegral over Maxwellian distribution gives rate coefficients (reaction rates). Because of\nthe tail of the Maxwellian distribution, the ionization rate extends below T = χi. And in\nequilibrium, when\nnions\n< σiv >\n=\n,\n(1.1)\nnneutrals\n< σr v >\n\nFigure 1.2: Ionization and radiative recombination rate coefficients for atomic hydrogen\n>\nthe percentage of ions is large (∼ 100%) if electron temperature: Te ∼ χi/10. e.g. Hydrogen\n>\nis ionized for Te ∼ 1eV (11,600*k). At room temp r ionization is negligible.\nFor dissociation and ionization balance figure see e.g. Delcroix Plasma Physics Wiley (1965)\nfigure 1A.5, page 25.\n1.1.2\nPlasmas are QuasiNeutral\nIf a gas of electrons and ions (singly charged) has unequal numbers, there will be a net charge\ndensity, ρ.\nρ = ne(-e) + ni(+e) = e(ni - ne)\n(1.2)\nThis will give rise to an electric field via\nρ\ne\nr.E =\n=\n(ni - ne)\n(1.3)\nExample: Slab.\ndE\nρ\ndx = 0\n(1.4)\nx\n→ E = ρ 0\n(1.5)\n\nFigure 1.3: Charged slab\nThis results in a force on the charges tending to expel whichever species is in excess. That\nis, if ni > ne, the E field causes ni to decrease, ne to increase tending to reduce the charge.\nThis restoring force is enormous!\nExample\nConsider Te = 1eV , ne = 1019m-3 (a modest plasma; c.f. density of atmosphere nmolecules ∼\n3 × 1025m-3). Suppose there is a small difference in ion and electron densities Δn = (ni - ne)\nso ρ = Δn e\n(1.6)\nThen the force per unit volume at distance x is\nx\nFe = ρE = ρ2 x = (Δn e)2\n(1.7)\nTake Δn/ne = 1% , x = 0.10m.\nFe = (1017 × 1.6 × 10-19)2 0.1/8.8 × 10-12 = 3 × 106N.m-3\n(1.8)\nCompare with this the pressure force per unit volume ∼ p/x : p ∼ neTe(+niTi)\nFp ∼ 1019 × 1.6 × 10-19/0.1 = 16N m-3\n(1.9)\nElectrostatic force >> Kinetic Pressure Force.\nThis is one aspect of the fact that, because of being ionized, plasmas exhibit all sorts of col\nlective behavior, different from neutral gases, mediated by the long distance electromagnetic\nforces E, B.\nAnother example (related) is that of longitudinal waves. In a normal gas, sound waves are\npropagated via the intermolecular action of collisions. In a plasma, waves can propagate\nwhen collisions are negligible because of the coulomb interaction of the particles.\n\n1.2\nPlasma Shielding\n1.2.1\nElementary Derivation of the Boltzmann Distribution\nBasic principle of Statistical Mechanics:\nThermal Equilibrium ↔ Most Probable State i.e. State with large number of possible ar\nrangements of microstates.\nFigure 1.4: Statistical Systems in Thermal Contact\nConsider two weakly coupled systems S1, S2 with energies E1, E2. Let g1, g2 be the number of\nmicroscopic states which give rise to these energies, for each system. Then the total number\nof microstates of the combined system is (assuming states are independent)\ng = g1g2\n(1.10)\nIf the total energy of combined system is fixed E1 + E2 = Et then this can be written as a\nfunction of E1:\nand\ng\ndg\ndE1\n=\n=\ng1(E1)g2(Et - E1)\ndg1\ndE g2 - g1\ndg2\ndE .\n(1.11)\n(1.12)\nThe most probable state is that for which dg\ndE1 = 0 i.e.\ng1\ndg1\ndE = 1\ng2\ndg2\ndE or\nd\ndE ln g1 = d\ndE ln g2\n(1.13)\nThus, in equilibrium, states in thermal contact have equal values of d\ndE ln g.\nOne defines σ ≡ ln g as the Entropy.\nAnd [ d\ndE ln g]-1 = T the Temperature.\nNow suppose that we want to know the relative probability of 2 microstates of system 1 in\nequilibrium. There are, in all, g1 of these states, for each specific E1 but we want to know\nhow many states of the combined system correspond to a single microstate of S1.\nObviously that is just equal to the number of states of system 2. So, denoting the two values\nof the energies of S1 for the two microstates we are comparing by EA, EB the ratio of the\nnumber of combined system states for S1A and S1B is\ng2(Et - EA) = exp[σ(Et - EA) - σ(Et - EB )]\n(1.14)\ng2(Et - EB )\n\n\"\n#\n\"\n#\nNow we suppose that system S2 is large compared with S1 so that EA and EB represent very\nsmall changes in S2's energy, and we can Taylor expand\ndσ\ndσ\ng2(Et - EA)\nexp -EA\n+ EB\n(1.15)\ng2(Et - EA) '\ndE\ndE\nThus we have shown that the ratio of the probability of a system (S1) being in any two\nmicrostates A, B is simply\nexp -(EA - EB )\n,\n(1.16)\nT\nwhen in equilibrium with a (large) thermal \"reservoir\". This is the wellknown \"Boltzmann\nfactor\".\nYou may notice that Boltzmann's constant is absent from this formula. That is because of\nusing natural thermodynamic units for entropy (dimensionless) and temperature (energy).\nBoltzmann's constant is simply a conversion factor between the natural units of temperature\n(energy, e.g. Joules) and (e.g.) degrees Kelvin. Kelvins are based on *C which arbitrarily\nchoose melting and boiling points of water and divide into 100.\nPlasma physics is done almost always using energy units for temperature. Because Joules\nare very large, usually electronvolts (eV) are used.\n1eV = 11600K = 1.6 × 10-19Joules.\n(1.17)\nOne consequence of our Botzmann factor is that a gas of moving particles whose energy is\nmv adopts the MaxwellBoltzmann (Maxwellian) distribution of velocities ∝ exp[- mv ].\n2T\n1.2.2\nPlasma Density in Electrostatic Potential\nWhen there is a varying potential, φ, the densities of electrons (and ions) is affected by it.\nIf electrons are in thermal equilibrium, they will adopt a Boltzmann distribution of density\neφ\nne ∝ exp(\n) .\n(1.18)\nTe\nThis is because each electron, regardless of velocity possesses a potential energy -eφ.\nConsequence is that (fig 1.5) a selfconsistent loop of dependencies occurs.\nThis is one elementary example of the general principle of plasmas requiring a selfconsistent\nsolution of Maxwell's equations of electrodynamics plus the particle dynamics of the plasma.\n1.2.3\nDebye Shielding\nA slightly different approach to discussing quasineutrality leads to the important quantity\ncalled the Debye Length.\nSuppose we put a plane grid into a plasma, held at a certain potential, φg .\n\nFigure 1.5: Selfconsistent loop of dependencies\nFigure 1.6: Shielding of fields from a 1D grid.\nThen, unlike the vacuum case, the perturbation to the potential falls off rather rapidly into\nthe plasma. We can show this as follows. The important equations are:\nd2φ\nPoisson0s Equation\n=\n(ni - ne)\n(1.19)\nr2φ = dx2\n-\ne\nElectron Density\nne = ninf exp(eφ/Te).\n(1.20)\n[This is a Boltzmann factor; it assumes that electrons are in thermal equilibrium. ninf is\ndensity far from the grid (where we take φ = 0).]\nIon Density\nni = ninf .\n(1.21)\n[Applies far from grid by quasineutrality; we just assume, for the sake of this illustrative\ncalculation that ion density is not perturbed by φperturbation.]\nSubstitute:\n\"\n\n!\n#\nd2φ = eninf exp eφ\n.\n(1.22)\ndx2\nTe\n- 1\nThis is a nasty nonlinear equation, but far from the grid |eφ/Te << 1 so we can use a Taylor\nexpression: exp eφ ' 1 + eφ . So\n|\nTe\nTe\nd2φ = eninf e φ = e ninf φ\n(1.23)\ndx2\n0 Te\n0Te\n\nSolutions: φ = φ0 exp(-|x /λD ) where\n|\n0Te\n(1.24)\nλD ≡\ne ninf\nThis is called the Debye Length\nPerturbations to the charge density and potential in a plasma tend to fall off with charac\nteristic length λD .\nIn Fusion plasmas λD is typically small. [e.g. ne = 1020m-3Te = 1keV\nλD = 2 × 10-5m =\n20μm]\nUsually we include as part of the definition of a plasma that λD << the size of plasma. This\nensures that collective effects, quasineutrality etc. are important. Otherwise they probably\naren't.\n1.2.4\nPlasmaSolid Boundaries (Elementary)\nWhen a plasma is in contact with a solid, the solid acts as a \"sink\" draining away the plasma.\nRecombination of electrons and ions occur at surface. Then:\n1. Plasma is normally charged positively with respect to the solid.\nFigure 1.7: PlasmaSolid interface: Sheath\n2. There is a relatively thin region called the \"sheath\", at the boundary of the plasma,\nwhere the main potential variation occurs.\nReason for potential drop:\nDifferent velocities of electrons and ions.\nIf there were no potential variation (E= 0) the electrons and ions would hit the surface at\nthe random rate\n1 nv\nper unit area\n(1.25)\n\nq\nq\nq\n\"\n\n!\n#\n[This equation comes from elementary gaskinetic theory. See problems if not familiar.]\nThe mean speed\n8T\nT .\nv =\nπm ∼\nm\nBecause of mass difference electrons move ∼\nmi faster and hence would drain out of plasma\nme\nfaster. Hence, plasma charges up enough that an electric field opposes electron escape and\nreduces total electric current to zero.\nEstimate of potential:\nIon escape flux\n4 n0\niv i\nElectron escape flux\n4 n0\nevi\nPrime denotes values at solid surface.\nBoltzmann factor applied to electrons:\nn0 = ninf exp[eφs/Te]\n(1.26)\ne\nwhere φs is solid potential relative to distant (inf) plasma.\nSince ions are being dragged out by potential assume n0\ni ∼ ninf (Zi = 1). [This is only\napproximately correct.]\nHence total current density out of plasma is\nj = qi\n4 n0\ni vi + qe\n4 n0\ne ve\n\"\n#\n(1.27)\n= eninf\n4 { vi - exp eφs\nTe\nve}\n(1.28)\nThis must be zero so\nφs =\n=\nTe\ne\nTe\ne\nln | vi\nve\n| = Te\ne\n2 ln\nme\nmi\n\n2 ln\nTi\nTe\nme\nmi\n\n[if Te = Ti.]\n(1.29)\n(1.30)\nFor hydrogen mi\nme = 1800 so 1\n2 ln me\nmi = -3.75.\nThe potential of the surface relative to plasma is approximately -4 Te .\ne\n[Note T\ne\ne is just the electron temp r in electronvolts expressed as a voltage.]\n1.2.5\nThickness of the sheath\nCrude estimates of sheath thickness can be obtained by assuming that ion density is uniform.\nThen equation of potential is, as before,\nd2φ = eninf\nexp eφ\n(1.31)\ndx2\nTe\n- 1\n\nWe know the rough scalelength of solutions of this equation is\n0Te\nλD = e2ninf\nthe Debye Length.\n(1.32)\nActually our previous solution was valid only for |eφ/Te << 1 which is no longer valid.\n|\nWhen -eφ/Te > 1 (as will be the case in the sheath). We can practically ignore the electron\ndensity, in which case the solution will continue only quadratically. One might expect,\ntherefore, that the sheath thickness is roughly given by an electric potential gradient\nT 1\n(1.33)\n- e λD\nextending sufficient distance to reach φS = -4 Te i.e.\ne\ndistance x ∼ 4λD\nThis is correct for the typical sheath thickness but not at all rigorous.\n1.3\nThe 'Plasma Parameter'\nNotice that in our development of Debye shielding we used nee as the charge density and\nsupposed that it could be taken as smooth and continuous. However if the density were so\nlow that there were less than approximately one electron in the Debye shielding region this\napproach would not be valid. Actually we have to address this problem in 3d by defining\nthe 'Plasma Parameter', ND , as\nND = Number of particles in the 'Debye Sphere'.\n⎛\n⎞\nT\n⎝\nπλ3\nD\n⎠ .\n(1.34)\n= n.\n∝\nn\n<\nIf ND ∼ 1 then the individual particles cannot be treated as a smooth continuum. It will be\nseen later that this means that collisions dominate the behaviour: i.e. short range correlation\nis just as important as the long range collective effects.\nOften, therefore we add a further qualification of plasma:\nND >> 1 (Collective effects dominate over collisions)\n(1.35)\n1.4\nSummary\nPlasma is an ionized gas in which collective effects dominate over collisions.\n[λD << size ,\nND >> 1 .]\n(1.36)\n\n1.5\nOccurrence of Plasmas\nGas Discharges:\nFluorescent Lights, Spark gaps, arcs, welding, lighting\nControlled Fusion\nIonosphere:\nIonized belt surrounding earth\nInterplanetary Medium:\nMagnetospheres of planets and starts. Solar Wind.\nStellar Astrophysics:\nStars. Pulsars. Radiationprocesses.\nIon Propulsion:\nAdvanced space drives, etc.\n& Space Technology\nInteraction of Spacecraft with environment\nGas Lasers:\nPlasma discharge pumped lasers: CO2, He, Ne, HCN.\nMaterials Processing:\nSurface treatment for hardening. Crystal Growing.\nSemiconductor Processing: Ion beam doping, plasma etching & sputtering.\nSolid State Plasmas:\nBehavior of semiconductors.\nFor a figure locating different types of plasma in the plane of density versus temperature see\nfor example Goldston and Rutherford Introduction to Plasma Physics IOP Publishing, 1995,\nfigure 1.3 page 9. Another is at http://www.plasmas.org/basics.htm\n1.6\nDifferent Descriptions of Plasma\n1. Single Particle Approach. (Incomplete in itself). Eq. of Motion.\n2. Kinetic Theory. Boltzmann Equation.\n\"\n#\n!\n∂\n∂\n∂\n∂f\n∂t + v. ∂x + a. ∂v f = ∂t\ncol.\n(1.37)\n3. Fluid Description. Moments, Velocity, Pressure, Currents, etc.\nUses of these.\nSingle Particle Solutions → Orbits\n→ Kinetic Theory Solutions → Transport Coefs.\n→ Fluid Theory → Macroscopic Description\nAll descriptions should be consistent. Sometimes they are different ways of looking at the\nsame thing.\n\n1.6.1\nEquations of Plasma Physics\nρ\n.E =\n.B =\nr\nr\n∂B\n1 ∂E\n(1.38)\n=\n= μ0j +\nr ∧E\n- ∂t\nr ∧B\nc2 ∂t\nF = q(E + v ∧B)\n1.6.2\nSelf Consistency\nIn solving plasma problems one usually has a 'circular' system:\nThe problem is solved only when we have a model in which all parts are self consistent. We\nneed a 'bootstrap' procedure.\nGenerally we have to do it in stages:\n- Calculate Plasma Response (to given E,B)\n- Get currents & charge densities\n- Calculate E & B for j, p.\nThen put it all together."
    },
    {
      "category": "Resource",
      "title": "chap2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/e3c1e305c4afea8754681bf9f8bba057_chap2.pdf",
      "content": "|\n{z\n}\nChapter 2\nMotion of Charged Particles in Fields\nPlasmas are complicated because motions of electrons and ions are determined by the electric\nand magnetic fields but also change the fields by the currents they carry.\nFor now we shall ignore the second part of the problem and assume that Fields are Prescribed.\nEven so, calculating the motion of a charged particle can be quite hard.\nEquation of motion:\ndv\nm\n=\nq\n( E\n+\nv\nB )\n(2.1)\ndt\n| {z }\ncharge Efield\nvelocity\n∧\nBfield\nRate of change of momentum\nLorentz Force\nHave to solve this differential equation, to get position r and velocity (v= r ) given E(r, t), B(r, t).\nApproach: Start simple, gradually generalize.\n2.1\nUniform B field, E = 0.\nmv = qv ∧ B\n(2.2)\n2.1.1\nQualitatively\nin the plane perpendicular to B: Accel. is perp to v so particle moves in a circle whose\nradius rL is such as to satisfy\n⊥\nv\nrL\nΩ is the angular (velocity) frequency\nmrLΩ2 = m\n= q v⊥B\n(2.3)\n| |\n1st equality shows Ω2 = v\nL\n2 /r\n⊥\n(rL = v⊥/Ω)\n\nk\n\nFigure 2.1: Circular orbit in uniform magnetic field.\nv\nHence second gives m ⊥Ω2 = q v⊥B\nΩ\n| |\nq B\ni.e. Ω = | |\n.\n(2.4)\nm\nParticle moves in a circular orbit with\nq B\nangular velocity Ω = | |\nthe \"Cyclotron Frequency\"\n(2.5)\nm\nv\nand radius rl =\n⊥\nthe \"Larmor Radius.\n(2.6)\nΩ\n2.1.2\nBy Vector Algebra\n- Particle Energy is constant. proof : take v. Eq. of motion then\nd\nmv.v =\nmv 2\n= qv.(v ∧ B) = 0.\n(2.7)\ndt 2\n- Parallel and Perpendicular motions separate. v = constant because accel (∝ v ∧ B)\nis perpendicular to B.\nPerpendicular Dynamics:\nTake B in ˆz direction and write components\nmv x = qvy B , mv y = -qvxB\n(2.8)\nHence\nqB\nqB 2\nv x =\nv y =\nvx = -Ω2 vx\n(2.9)\nm\n-\nm\nSolution: vx = v⊥ cos Ωt\n(choose zero of time)\nSubstitute back:\nm\nq\nvy =\nv x = -|\nq\n| v⊥ sin Ωt\n(2.10)\nqB\n\nk\nIntegrate:\nv\nx = x0 +\n⊥ sin Ωt\n,\ny = y0 + q v⊥ cos Ωt\n(2.11)\nΩ\n|q| Ω\nFigure 2.2: Gyro center (x0, y0) and orbit\nThis is the equation of a circle with center r0 = (x0, y0) and radius rL = v⊥/Ω: Gyro Radius.\n[Angle is θ = Ωt]\nDirection of rotation is as indicated opposite for opposite sign of charge:\nIons rotate anticlockwise. Electrons clockwise about the magnetic field.\nThe current carried by the plasma always is in such a direction as to reduce the magnetic\nfield.\nThis is the property of a magnetic material which is \"Diagmagnetic\".\nWhen vk is nonzero the total motion is along a helix.\n2.2\nUniform B and nonzero E\nmv = q(E + v ∧ B)\n(2.12)\nParallel motion: Before, when E = 0 this was v = const. Now it is clearly\nqEk\nv =\n(2.13)\nk\nm\nConstant acceleration along the field.\nPerpendicular Motion\nQualitatively:\nSpeed of positive particle is greater at top than bottom so radius of curvature is greater.\nResult is that guiding center moves perpendicular to both E and B. It 'drifts' across the\nfield.\nAlgebraically: It is clear that if we can find a constant velocity vd that satisfies\nE + vd ∧ B = 0\n(2.14)\n\nk\nFigure 2.3: E ∧ B drift orbit\nthen the sum of this drift velocity plus the velocity\nd\nvL =\n[rLe iΩ(t-t0)]\n(2.15)\ndt\nwhich we calculated for the E = 0 gyration will satisfy the equation of motion.\nTake ∧B the above equation:\n0 = E ∧ B + (vd ∧ B) ∧ B = E ∧ B + (vd.B)B - B2 vd\n(2.16)\nso that\nvd = E ∧ B\n(2.17)\nB2\ndoes satisfy it.\nHence the full solution is\nv =\nv\n+\nvd\n+\nvL\n(2.18)\nparallel\ncrossfield drift\nGyration\nwhere\nqEk\nv =\n(2.19)\nk\nm\nand\nvd (eq 2.17) is the \"E × B drift\" of the gyrocenter.\nComments on E × B drift:\n1. It is independent of the properties of the drifting particle (q, m, v, whatever).\n2. Hence it is in the same direction for electrons and ions.\n3. Underlying physics for this is that in the frame moving at the E × B drift E = 0. We\nhave 'transformed away' the electric field.\n4. Formula given above is exact except for the fact that relativistic effects have been\nignored. They would be important if vd ∼ c.\n\n2.2.1\nDrift due to Gravity or other Forces\nSuppose particle is subject to some other force, such as gravity. Write it F so that\nmv = F + q v ∧ B = q( F + v ∧ B)\n(2.20)\nq\nThis is just like the Electric field case except with F/q replacing E.\nThe drift is therefore\nvd = 1 F ∧ B\n(2.21)\nq\nB2\nIn this case, if force on electrons and ions is same, they drift in opposite directions.\nThis general formula can be used to get the drift velocity in some other cases of interest (see\nlater).\n2.3\nNonUniform B Field\nIf Blines are straight but the magnitude of B varies in space we get orbits that look quali\ntatively similar to the E ⊥ B case:\nFigure 2.4: rB drift orbit\nCurvature of orbit is greater where B is greater causing loop to be small on that side. Result\nis a drift perpendicular to both B and rB. Notice, though, that electrons and ions go in\nopposite directions (unlike E ∧ B).\nAlgebra\nWe try to find a decomposition of the velocity as before into v = vd + vL where vd is\nconstant.\nWe shall find that this can be done only approximately. Also we must have a simple expres\nsion for B. This we get by assuming that the Larmor radius is much smaller than the scale\nlength of B variation i.e.,\nrL << B/|rB\n(2.22)\n|\n\n!\n\n| |\n!\nin which case we can express the field approximately as the first two terms in a Taylor\nexpression:\nB ' B0 + (r.r)B\n(2.23)\nThen substituting the decomposed velocity we get:\ndv\nm dt\n= m vL = q(v ∧ B) = q[vL ∧ B0 + vd ∧ B0 + (vL + vd) ∧ (r.r)B]\n(2.24)\nor\n0 = vd ∧ B0 + vL ∧ (r.r)B + vd ∧ (r.r)B\n(2.25)\nNow we shall find that vd/vL is also small, like r|rB /B. Therefore the last term here is\n|\nsecond order but the first two are first order. So we drop the last term.\nNow the awkward part is that vL and rL are periodic. Substitute for r = r0 + rL so\n0 = vd ∧ B0 + vL ∧ (rL.r)B + vL ∧ (r0.r)B\n(2.26)\niΩt\n-\nWe now average over a cyclotron period. The last term is\nso it averages to zero:\n∝ e\n⊥\nΩ\n0 = vd ∧ B + hvL ∧ (rL.r)Bi .\n(2.27)\nTo perform the average use\nv\nq\nsin Ωt,\ncos Ωt\n(2.28)\nrL = (xL, yL) =\nq\ncos Ωt, -q sin Ωt\nvL = ( xL, y L) = v\n(2.29)\n⊥\nq| |\nd\nSo\n[vL ∧ (r.r)B]x = vy y dy B\n(2.30)\nd\n[vL ∧ (r.r)B]y = -vxy dy B\n(2.31)\n(Taking rB to be in the ydirection).\nThen\n⊥\nΩ\n⊥\nΩ\nv\nv\nhcos Ωt cos Ωti\n-hcos Ωt sin Ωti\n= 0\n(2.32)\n=\nhvy yi\n⊥\nΩ\n1 v\nq\nq| |\nq\nq| |\n(2.33)\n=\nhvxyi\n= 2\nSo\n⊥\nB\nr\nΩ\nq 1 v\nhvL ∧ (r.r)Bi =\n(2.34)\n- q\n| |\nSubstitute in:\n0 = vd ∧ B -\n⊥\nB\nr\n2Ω\nq v\nq\n| |\n(2.35)\n\nk\nand solve as before to get\nv\nrB ∧B\n⊥\n2Ω\n-1\nq|\n|\n= q v\nq\n| |\n⊥\n2Ω\nB ∧rB\n(2.36)\nvd =\nB2\nB2\nor equivalently\n1 mv\nq 2B\n⊥B ∧rB\n(2.37)\nvd =\nB2\nThis is called the 'Grad B drift'.\n2.4\nCurvature Drift\nWhen the Bfield lines are curved and the particle has a velocity vk along the field, another\ndrift occurs.\nFigure 2.5: Curvature and Centrifugal Force\nTake |B constant; radius of curvature Re.\n|\nTo 1st order the particle just spirals along the field.\nIn the frame of the guiding center a force appears because the plasma is rotating about the\ncenter of curvature.\nThis centrifugal force is Fcf\nFcf = m\nk\nv\nRc\npointing outward\n(2.38)\nas a vector\nRc\nFcf\n(2.39)\n= mv R2\nc\n[There is also a coriolis force 2m(ω ∧v) but this averages to zero over a gyroperiod.]\nUse the previous formula for a force\nk\nmv\nq\nB2\nqB2\nR2\nc\n1 Fcf ∧B\nRc ∧B\n(2.40)\nvd =\n=\n\nThis is the \"Curvature Drift\".\nIt is often convenient to have this expressed in terms of the field gradients. So we relate Rc\nto rB etc. as follows:\nFigure 2.6: Differential expression of curvature\n(Carets denote unit vectors)\nFrom the diagram\ndb = ˆb2 -ˆb1 = -ˆRcα\n(2.41)\nand\nd` = ∝Rc\n(2.42)\nSo\ndb\ndl = -\nˆRc\nRc\n= - Rc\nR2\nc\n(2.43)\nBut (by definition)\ndb\ndl = ( ˆB.r)ˆb\n(2.44)\nSo the curvature drift can be written\nk\nk B ∧(ˆ\nb\nb.r)ˆ\nRc\nB\nmv\nmv\n(2.45)\nvd =\nR2\nc\n∧\n=\nB2\nq\nB2\nq\n2.4.1\nVacuum Fields\nRelation between rB & Rc drifts\nThe curvature and rB are related because of Maxwell's equations, their relation depends\non the current density j. A particular case of interest is j = 0: vacuum fields.\nFigure 2.7: Local polar coordinates in a vacuum field\nr ∧B = 0\n(static case)\n(2.46)\n\nConsider the zcomponent\n1 ∂\n0 = (r ∧B)z =\n(rBθ ) (Br = 0 by choice).\n(2.47)\nr ∂r\n∂Bθ\nBθ\n=\n+\n(2.48)\n∂r\nr\nor, in other words,\nB\n(rB)r =\n(2.49)\n-Rc\n[Note also 0 = (r ∧B)θ = ∂Bθ /∂z : (rB)z = 0]\nand hence (rB)perp = -B Rc/R2 .\nc\nThus the grad B drift can be written:\nmv2\nmV 2 Rc ∧B\n(2.50)\nvrB =\n⊥ B ∧rB =\n⊥\n2q\nB3\n2q\nR2B2\nc\nand the total drift across a vacuum field becomes\nvR + vrB =\nmv + mv\nRc ∧B .\n(2.51)\nq\nk\n⊥\nR2B2\nc\nNotice the following:\n1. Rc & rB drifts are in the same direction.\n2. They are in opposite directions for opposite charges.\n3. They are proportional to particle energies\n4. Curvature ↔ Parallel Energy (× 2)\n↔ Perpendicular Energy\nrB\n5. As a result one can very quickly calculate the average drift over a thermal distribution\nof particles because\nT\nmv\n=\n(2.52)\nh2\nk i\nmv\n= T\n2 degrees of freedom\n(2.53)\nh2\n⊥i\nTherefore\n⎛\n\n⎞\nˆ\nb\n2T Rc ∧B\n2T B ∧ b.r ˆ\n⎠\n(2.54)\nhvR + vrB i = q\nR2B2 ⎝= q\nB2\nc\n\nk\n\nk\n\nk 6\n2.5\nInterlude: Toroidal Confinement of Single Parti\ncles\nSince particles can move freely along a magnetic field even if not across it, we cannot ob\nviously confine the particles in a straight magnetic field. Obvious idea: bend the field lines\ninto circles so that they have no ends.\nFigure 2.8: Toroidal field geometry\nProblem\nCurvature & rB drifts\nR ∧ B\n⊥\n(2.55)\n+\nvd =\nmv\nmv\nR2B2\nq\n⊥\n(2.56)\n+\n=\nmv\n|vd|\nq\nmv\nBR\nIons drift up. Electrons down. There is no confinement. When there is finite density things\nFigure 2.9: Charge separation due to vertical drift\nare even worse because charge separation occurs → E\nOutward Motion.\n→ E ∧ B →\n2.5.1\nHow to solve this problem?\nConsider a beam of electrons v = 0 v⊥ = 0. Drift is\nk\nmv\nq\nBT R\nvd =\n(2.57)\n\nWhat Bz is required to cancel this?\nAdding Bz gives a compensating vertical velocity\nBz\nv = v\nfor Bz << BT\n(2.58)\nk BT\nWe want total\nBz\nvz = 0 = vk BT\n+\nmvk\nq\n(2.59)\nq\nBT R\nSo Bz = -mvk/Rq is the right amount of field.\nNote that this is such as to make\nmv\nrL(Bz ) = |\nk| = R .\n(2.60)\nqBz |\n|\nBut Bz required depends on vk and q so we can't compensate for all particles simultaneously.\nVertical field along cannot do it.\n2.5.2\nThe Solution: Rotational Transform\nFigure 2.10: Tokamak field lines with rotational transform\nToroidal Coordinate system (r, θ, φ) (minor radius, poloidal angle, toroidal angle), see figure\n2.8.\nSuppose we have a poloidal field Bθ\nField Lines become helical and wind around the torus: figure 2.10.\n\n\"\n#\nk\nk\nk\nIn the poloidal crosssection the field describes a circle as it goes round in φ.\nEquation of motion of a particle exactly following the field is:\ndθ\nBθ\nBθ Bφ\nBθ\nr\n=\nvφ =\nv\n=\nv\n(2.61)\ndt\nBφ\nBφ B\nk\nB\nk\nand\nr = constant.\n(2.62)\nNow add on to this motion the cross field drift in the ˆz direction.\nFigure 2.11: Components of velocity\ndθ\nBθ\nr\n=\nvk + vd cos θ\n(2.63)\ndt\nB\ndr = vd sin θ\n(2.64)\ndt\nTake ratio, to eliminate time:\n1 dr\nud sin θ\n=\n(2.65)\nr dθ\nBθ vk + vd cos θ\nB\nTake Bθ, B, vk, vd to be constants, then we can integrate this orbit equation:\nBθv\n[ln r] = [- ln\nk + vd cos θ|] .\n(2.66)\n| B\nπ\nTake r = r0 when cos θ = 0 (θ = 2 ) then\nBvd\nr = r0/ 1 +\ncos θ\n(2.67)\nbθv\nIf Bvd << 1 this is approximately\nBθ v\nr = r0 - Δ cos θ\n(2.68)\nwhere Δ = Bvd r0\nBθ v\nThis is approximately a circular orbit shifted by a distance Δ:\n\nk\nk\nk\nFigure 2.12: Shifted, approximately circular orbit\nSubstitute for vd\nk +\n⊥)\n(mv\nB 1\nmv\nΔ\n(2.69)\nr0\n'\nBθ\nBφR\nq\nv\nk\n⊥\n+\n1 mv\nmv rp\n(2.70)\n' qBθ\nR\nv\nmv\nr0\nr0\nIf v⊥ = 0\nΔ =\n(2.71)\n,\n= rLθ\nqBθ R\nR\nwhere rLθ is the Larmor Radius in a field Bθ × r/R.\nProvided Δ is small, particles will be confined. Obviously the important thing is the poloidal\nrotation of the field lines: Rotational Transform.\nRotational Transform\nrotational transform\n≡\npoloidal angle\n1 toroidal rotation\n(2.72)\n(transform/2π =) ι ≡ poloidal angle\ntoroidal angle .\n(2.73)\n(Originally, ι was used to denote the transform. Since about 1990 it has been used to denote\nthe transform divided by 2π which is the inverse of the safety factor.)\n'Safety Factor'\ntoroidal angle\ns\n'q\n.\n(2.74)\n=\n=\nι\npoloidal angle\nActually the value of these ratios may vary as one moves around the magnetic field. Definition\nstrictly requires one should take the limit of a large no. of rotations.\nqs is a topological number: number of rotations the long way per rotation the short way.\nCylindrical approx.:\nrBφ\nqs =\n(2.75)\nRBθ\n\nIn terms of safety factor the orbit shift can be written\nr\nBφr\n= rLθ\n= rLφ\n= rLqs\n(2.76)\n|Δ|\nR\nBθ R\n(assuming Bφ >> Bθ ).\n2.6\nThe Mirror Effect of Parallel Field Gradients: E =\n0, rB k B\nFigure 2.13: Basis of parallel mirror force\nIn the above situation there is a net force along B.\nForce is\n< Fk >\nsin α\n=\n=\n-|qv ∧ B|\n-Br\nB\nsin α = -|q|v⊥B sin α\n(2.77)\n(2.78)\nCalculate Br as function of Bz from r.B = 0.\n1 ∂\n∂\nr.B = r ∂r (rBr ) + ∂z Bz = 0 .\n(2.79)\nHence\nrBr = -\nZ\nr ∂Bz\n∂z dr\n(2.80)\nSuppose rL is small enough that ∂Bz\n∂z ' const.\n[rBr ]rL\n0 '\nZ rL\nrdr ∂Bz\n∂z = - 1\n2 r 2\nL\n∂Bz\n∂z\n(2.81)\nSo\nBr (rL) = - 1\n2 rL\n∂Bz\n∂z\n(2.82)\nsin α = - Br\nB = + rL\n∂Bz\n∂z\n(2.83)\n\nk >=\nk\nk\nHence\n⊥ ∂Bz\n∂Bz\nmv\n< F\nv⊥rL\n.\n(2.84)\n-|q|\n= -\n∂z\nB\n∂z\nAs particle enters increasing field region it experiences a net parallel retarding force.\nDefine Magnetic Moment\nmv⊥/B .\n(2.85)\nμ ≡ 2\nNote this is consistent with loop current definition\nq v\nq rLv\n| | ⊥ = | |\n⊥\n2πrL\nμ = AI = πr 2 .\nL\n(2.86)\nForce is F = μ.rkB\nThis is force on a 'magnetic dipole' of moment μ.\nF = μ.rkB\n(2.87)\nOur μ always points along B but in opposite direction.\n2.6.1\nForce on an Elementary Magnetic Moment Circuit\nConsider a plane rectangular circuit carrying current I having elementary area dxdy = dA.\nRegard this as a vector pointing in the z direction dA. The force on this circuit in a field\nB(r) is F such that\n∂Bz\nFx = Idy[Bz (x + dx) - Bz (x)] = Idydx ∂x\n(2.88)\nFy = -Idx[Bz (y + dy) - Bz (y)] = Idydx ∂Bz\n∂y\n(2.89)\nFz = -Idx[By (y + dy) - By (y)] - Idy[Bx(x + dx) - Bx(x)]\n\"\n#\n(2.90)\n= -Idxdy ∂Bx\n∂x + ∂By\n∂y\n= Idydx ∂Bz\n∂z\n(2.91)\n(Using r.B = 0).\nHence, summarizing: F = IdydxrBz . Now define μ = IdA = Idydxˆz and take it constant.\nThen clearly the force can be written\nF = r(B.μ)\n[Strictly = (rB).μ]\n(2.92)\nμ is the (vector) magnetic moment of the circuit.\nThe shape of the circuit does not matter since any circuit can be considered to be composed\nof the sum of many rectangular circuits. So in general\nμ = IdA\n(2.93)\n\nk\nk\nand force is\nF = r(B.μ)\n(μ constant),\n(2.94)\nWe shall show in a moment that |μ| is constant for a circulating particle, regard as an\nelementary circuit. Also, μ for a particle always points in the B direction. [Note that this\nmeans that the effect of particles on the field is to decrease it.] Hence the force may be\nwritten\nF = -μrB\n(2.95)\nThis gives us both:\n- Magnetic Mirror Force:\nF = -μrkB\n(2.96)\nand\nGrad B Drift:\n-\n1 F ∧B\nμ B ∧rB .\n(2.97)\nvrB =\n=\nq\nB2\nq\nB2\n2.6.2\nμ is a constant of the motion\n'Adiabatic Invariant'\nProof from F\nParallel equation of motion\ndv\nm\nk = F = -μdB\n(2.98)\ndt\nk\ndz\nSo\ndB\ndB\nmv dvk = d (1 mvk ) = -μvz\n= -μ\n(2.99)\nk dt\ndt 2\ndz\ndt\nor\nd 1\ndB\n( mvk ) + μ\n= 0 .\n(2.100)\ndt 2\ndt\nConservation of Total KE\nd 1\ndt (2 mv k + 2 mv⊥) = 0\n(2.101)\nd 1\n=\n( mv 2 + μB) = 0\n(2.102)\ndt 2\nk\nCombine\nd\ndB\n(μB) -μ\n= 0\n(2.103)\ndt\ndt\ndμ\n=\n= 0\nAs required\n(2.104)\ndt\n\nAngular Momentum\nof particle about the guiding center is\nmv\n2m 1 mv\nrLmv\n=\n⊥ mv\n=\n⊥\n(2.105)\n⊥\n|q|B\n⊥\nq\nB\n| |\n2m\n=\nμ\n.\n(2.106)\nq| |\nConservation of magnetic moment is basically conservation of angular momentum about the\nguiding center.\nProof direct from Angular Momentum\nConsider angular momentum about G.C. Because θ is ignorable (locally) Canonical angular\nmomentum is conserved.\np = [r ∧(mv + qA)]z\nconserved.\n(2.107)\nHere A is the vector potential such that B = r ∧A\nthe definition of the vector potential means that\n1 ∂(rAθ ))\nBz =\n(2.108)\nr\n∂r\nZ\nrL\nμm\nrL\n⇒rLAθ (rL)\n=\nr.Bz dr = 2 Bz = q\n(2.109)\n| |\nHence\nmμ\np = -qrLv⊥m + q\n(2.110)\nq\nq\n| |\nq\n| |\n=\nmμ.\n(2.111)\n-|q|\nSo p = const ↔ μ = constant.\nConservation of μ is basically conservation of angular momentum of particle about G.C.\n2.6.3\nMirror Trapping\nFk may be enough to reflect particles back. But may not!\nLet's calculate whether it will:\nSuppose reflection occurs.\nAt reflection point vkr = 0.\nEnergy conservation\nm(v⊥0 + vk0) = mv 2\n(2.112)\n⊥r\n\nk\nFigure 2.14: Magnetic Mirror\nμ conservation\nmv\n⊥0 = 2 mv⊥r\n(2.113)\nB0\nBr\nHence\nBr 2\nv⊥0 + vk0 = B0\nv⊥0\n(2.114)\nB0\nv2\n=\n⊥0\n(2.115)\nBr\nv⊥0 + v2\nko\n2.6.4\nPitch Angle\nθ\nv\ntan θ =\n⊥\n(2.116)\nv\nB0\nv2\n=\n⊥0\n= sin2 θ0\n(2.117)\nBr\nv⊥0 + v2\nk0\nSo, given a pitch angle θ0, reflection takes place where B0/Br = sin2 θ0.\nIf θ0 is too small no reflection can occur.\nCritical angle θc is obviously\nθc = sin-1(B0/B1)\n(2.118)\nLoss Cone is all θ < θc.\nImportance of Mirror Ratio: Rm = B1/B0.\n2.6.5\nOther Features of Mirror Motions\nFlux enclosed by gyro orbit is constant.\nπm2v\nΦ\n= πr 2 B =\n⊥ B\n(2.119)\nL\nq2B2\n\nI\nZ\nI\nZ\nFigure 2.15: Critical angle θc divides velocity space into a losscone and a region of mirror\ntrapping\n2πm 1 mv\n=\n⊥\n(2.120)\nq2\nB\n2πm\n=\nq2 μ = constant.\n(2.121)\nNote that if B changes 'suddenly' μ might not be conserved.\nFigure 2.16: Flux tube described by orbit\nBasic requirement\nrL << B/|rB\n(2.122)\n|\nSlow variation of B (relative to rL).\n2.7\nTime Varying B Field\n(E inductive)\nParticle can gain energy from the inductive E field\n∂B\n=\n(2.123)\nr ∧ E\n- ∂t\ndΦ\nor\nE.dl =\nB.ds =\n(2.124)\n-\ns\n\n- dt\nHence work done on particle in 1 revolution is\ndΦ\n\nδw =\nq E.d` = +|q|\ns B.ds = + q\n= |q|Bπr 2\n(2.125)\nL\n-\n| |\n\n| | dt\n\n!\n\n!\nFigure 2.17: Particle orbits round B so as to perform a line integral of the Electric field\n(d` and v⊥q are in opposition directions).\nδ\n2 mv 2\n⊥\n\n= |q| Bπr 2\nL = 2π Bm\n|q|B\n2 mv2\n⊥\nB\n2π B\n(2.126)\n=\n|Ω| μ.\n(2.127)\nHence\nd\ndt\n2 mv 2\n⊥\n\n= |Ω|\n2π δ\n2 mv 2\n⊥\n\n= μ db\ndt\n(2.128)\nbut also\nd\ndt\n2 mv 2\n⊥\n\n= d\ndt (μB) .\n(2.129)\nHence\ndμ = 0.\n(2.130)\ndt\nNotice that since Φ = 2πm μ, this is just another way of saying that the flux through the gyro\nq2\norbit is conserved.\nNotice also energy increase. Method of 'heating'. Adiabatic Compression.\n2.8\nTime Varying Efield\n(E, B uniform)\nRecall the E ∧ B drift:\nvE∧B = E ∧ B\n(2.131)\nB2\nwhen E varies so does vE∧B . Thus the guiding centre experiences an acceleration\nv E∧B = d\nE ∧ B\n(2.132)\ndt\nB2\nIn the frame of the guiding centre which is accelerating, a force is felt.\nFa = -m d\nE ∧ B\n(Pushed back into seat! - ve.)\n(2.133)\ndt\nB2\n\n!\n\nThis force produces another drift\n1 Fa ∧ B\nm d\nE ∧ B\n(2.134)\nvD =\n=\nq\nB2\nqB2 dt\nB2\n∧ B\nm d\n=\n(E.B) B - B2E\n(2.135)\n- qB dt\nm\n=\nE\n(2.136)\nqB2\n⊥\nThis is called the 'polarization drift'.\nm\n\nvD = vE∧B + vp = E ∧ B + qB2 E\n(2.137)\nB2\n⊥\n= E ∧ B + ΩB E⊥\n(2.138)\nB2\nFigure 2.18: Suddenly turning on an electric field causes a shift of the gyrocenter in the\ndirection of force. This is the polarization drift.\nStartup effect: When we 'switch on' an electric field the average position (gyro center) of\nan initially stationary particle shifts over by ∼ 1 the orbit size. The polarization drift is this\npolarization effect on the medium.\nTotal shift due to vp is\nZ\nZ\nΔr\nvpdt = m\nqB2\nˆE⊥dt = m\nqB2 [ΔE⊥]\n.\n(2.139)\n2.8.1\nDirect Derivation of dE effect: 'Polarization Drift'\ndt\nConsider an oscillatory field E = Ee-iωt (⊥ r0B)\ndv\nm\n= q (E + v ∧ B)\n(2.140)\ndt\n= q Ee-iωt + v ∧ B\n(2.141)\nTry for a solution in the form\nv = vD e-iωt + vL\n(2.142)\n\n\"\n#\n\"\n#\n\n!\nwhere, as usual, vL satisfies mv L = qvL ∧B\nThen\n(1)\nm(-iωvD = q (E + vD ∧B)\nx`-iωt\n(2.143)\nSolve for vD :\nTake ∧B this equation:\n(2)\n-miω (vD ∧B) = q E ∧B + B2 .v D B -B2 vD\n(2.144)\n|\nadd miω × (1) to q × (2) to eliminate vD ∧B.\nm 2ω2 vD + q (E ∧B -B2 vD) = miωqE\n(2.145)\nm2ω2\nmiω\nE ∧B\n(2.146)\nor :\nvD\n=\nE +\n1 - q2B2\n-qB2\nB2\nω2\niωq\ni.e.\nvD 1 - Ω2 = -ΩB|q| E + E ∧B\n(2.147)\nB2\nSince -iω\n∂ this is the same formula as we had before: the sum of polarization and\n∂t\nE ∧B drifts\n↔\nexcept for the [1 -ω2Ω2] term.\nThis term comes from the change in vD with time (accel).\nThus our earlier expression was only approximate. A good approx if ω << Ω.\n2.9\nNon Uniform E\n(Finite Larmor Radius)\ndv\nm\n= q (E(r) + v ∧B)\n(2.148)\ndt\nSeek the usual soltuion v = vD + vg.\nThen average out over a gyro orbit\ndvD\nm\n= 0 = hq (E(r) + v ∧B)i\n(2.149)\nh\ndt i\n= q [hE(r)i + vD ∧B]\n(2.150)\nHence drift is obviously\nvD = hE(r)i ∧B\n(2.151)\nB2\nSo we just need to find the average E field experienced.\nExpand E as a Taylor series about the G.C.\ny2 ∂2\nx2∂2\nE(r) = E0 + (r.r) E +\n+ 2! ∂y2\nE + cross terms + .\n(2.152)\n2!∂x2\n\n!\n\nk\n∂2\n(E.g. cross terms are xy ∂x∂y E).\nAverage over a gyro orbit: r = rL(cos θ, sin θ, 0).\nAverage of cross terms = 0.\nThen\nr\nhE(r)i = E + (hrLi.r)E + h Li\n(2.153)\n2! r2E.\nlinear term hrLi = 0. So\n(2.154)\nhE(r)i ' E + r\nL r2E\nHence E ∧B with 1st finiteLarmorradius correction is\nE ∧B\nvE∧B = 1 + rL\n.\n(2.155)\nr r\nB2\n[Note: Grad B drift is a finite Larmor effect already.]\nSecond and Third Adiabatic Invariants\nThere are additional approximately conserved quantities like μ in some geometries.\n2.10\nSummary of Drifts\nvE = E ∧B\nB2\nElectric Field\n(2.156)\nvF\nvE\n=\n=\nq\nF ∧B\nB2\n\n1 + r2\nL\n4 r2\n! E ∧B\nB2\nGeneral Force\nNonuniform E\n(2.157)\n(2.158)\n⊥B ∧rB\nmv\nGradB\n(2.159)\nvrB =\nB3\n2q\nk Rc ∧B\nmv\nCurvature\n(2.160)\nvR =\nq\nR2B2\nc\nRc ∧B\nmv 2\n⊥\nVacuum Fields.\n(2.161)\nvR + v\n+\n=\nmv\nrB\nR2B2\nc\nq\nE ⊥\nq\nq Ω|B\n| | |\nPolarization\n(2.162)\nvp =\nMirror Motion\nmv2\n⊥\nμ ≡ 2B\nis constant\n(2.163)\nForce is F = -μrB."
    },
    {
      "category": "Resource",
      "title": "chap3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/6392c1cde2d7d1921bd0c9fdf78520cb_chap3.pdf",
      "content": "Chapter 3\nCollisions in Plasmas\n3.1 Binary collisions between charged particles\nReduced-mass for binary collisions:\nTwo particles interacting with each other have forces\nF12 force on 1 from 2.\nFZ1 force on 2 from 1.\nBy Newton's 3rd law, F12 = F Z 1 .\nEquations of motion:\nmlrl = F12\n;\nm2r2 = FZ1\nCombine to get\nrl - r2 = F12\n(3.2)\nwhich may be written\nmlm2\nd2\nml +\n(3.3)\nm2 -\n('1\n- r2) =\ndt2\nF12\nIf F l 2 depends only on the difference vector rl - r2, then this equation is identical to the\nequation of a particle of \"Reduced Mass\" m, =\nmoving at position r = rl - r2 with\nrespect to a fixed center of force:\nm,r = F12(r) .\n(3.4)\nThis is the equation we analyse, but actually particle 2 does move. And we need to recognize\nthat when interpreting mathematics.\nIf FZ1 and rl - r2 are always parallel, then a general form of the trajectory can be written\nas an integral. To save time we specialize immediately to the Coulomb force\nSolution of this standard (Newton's) problem:\n\n1: projectile -\n,\n, ,' '\n. . . . . . . . . . . . . . . . . . . . . . . . A\n- - - - - - - - -\nX\n- - - - - - - -\nIb Impact Parameter,\n2: target\nFigure 3.1: Geometry of the collision orbit\nAngular momentum is conserved:\nm,r28 = const. = m,bvl\n(0 clockwise from symmetry)\nSubstitute u = ;\n1 then 8 = 3\n= u2 bv,\nAlso\nThen radial acceleration is\nThis orbit equation has the elementary solution\nThe sin0 term is absent by symmetry. The other constant of integration, C, must be deter-\nmined by initial condition. At initial (far distant) angle, 01, ul\noo\n=\n= 0. So\nThere:\nHence\nsin O1\n1 / C b\nb\ntan& = -=\n--\ncosO1\n--\nV'42-\n/C\nbgo\n4neo rn,(b~~)~\n\nNotice that tan81 = 1 when b = b g ~ . This is when O1 = -45\" and x = 90\". So particle\nemerges at 90\" to initial direction when\nb = bgO\n\"90\" impact parameter\"\n(3.16)\nFinally:\n3.1.1 Frames of Reference\nKey quantity we want is the scattering angle but we need to be careful about reference\nframes.\nMost \"natural\" frame of ref is \"Center-of-Mass\" frame, in which C of M is stationary. C of\nM has position:\nand velocitv (in lab frame)\nNow\nSo motion of either particle in C of M frame is a factor times difference vector, r.\nVelocity in lab frame is obtained by adding V to the C of M velocity, e.g.\n+ V\nAngles of position vectors and velocity dzfferences are same in all frames.\nAngles (i.e. directions) of velocities are not same.\n3.1.2 Scattering Angle\nIn C of M frame is just the final angle of r.\n- 201 -+ x = r\n(81 is negative)\n\nFigure 3.2: Relation between O1 and x\nX\nb\ncot - =\n-\nb90\nx\nb90\ntan-\n=\n-\nb\nBut scattering angle (defined as exit velocity angle relative to initial velocity) in lab frame\nis different.\nFinal velocity in CM frame\nvLM = V ~ C M\n(COS x,, sin xc)\nm2\n=\nvl (cos XC, sin x,)\n(3.27)\nml+ m2\n[ xC -- x and vl is initial relative velocity]. Final velocity in Lab frame\nSo angle is given by\nv+GG\n\"732211 cos Xc\nV ml+m2\ncot XL =\n-\n7n2211.\ncosecx, +\n(3.29)\ncot X,\nm1tm2 sin xz\n~1\nm2\nFor the specific case when m2 is initially a stationary target in lab frame, then\nv\nm1v1\n=\nand hence\nml+ m2\nml\ncot XL = c o s e c x , + cot X,\nm2\nThis is exact.\nSmall angle approximation (cot x i i, cosecx i 1 gives\nX\nX\nSo small angles are proportional, with ratio set by the mass-ratio of particles\n\nCenter-of-Mass Frame /\nyt\nParticle 1\nLaboratory Frame,\nStationary Target\n,I..\n-\n..\nParticle\n- -\n!\n. /\nf\nX,\n.\n> ,.\n'Jo\nParticle 2\nFigure 3.3: Collisions viewed in Center of Mass and Laboratory frame\n3.2 Differential Cross-Section for Scattering by Angle\nRutherford Cross-Section\nBy definition the cross-section, 0, for any specified collision process when a particle is passing\nthrough a density n2 of targets is such that the number of such collisions per unit path length\nis n20.\nSometimes a continuum of types of collision is considered, e.g. we consider collisions at\ndifferent angles (x) to be distinct. In that case we usually discuss differential cross-sections\n(e.g $) defined such that number of collisions in an (angle) element dx per unit path length\nis n2$dx. [Note that 4~ is just notation for a number. Some authors just write ~ ( x ) ,\nbut I\ndx\nfind that less clear.]\nNormally, for scattering-angle discrimination we discuss the differential cross-section per unit\nsolid angle:\ndff\n-\ndfls\nThis is related to scattering angle integrated over all azimuthal directions of scattering by:\n\nFigure 3.4: Scattering angle and solid angle relationship.\ndCl, = 2.rrsinxdx\nSo that since\nwe have\nNow, since x is a function (only) of the impact parameter, b, we just have to determine the\nnumber of collisions per unit length at impact parameter b.\n+\nd\nl\n-\n\n. ..\n. '\nFigure 3.5: Annular volume corresponding to db.\nThink of the projectile as dragging along an annulus of radius b and thickness db for an\nelementary distance along its path, d!.\nIt thereby drags through a volume:\nTherefore in this distance it has encountered a total number of targets\nd!2.rrbdb\n. n2\n\nat impact parameter b(db). By definition this is equal to d!$dbn2.\nHence the differential\ncross-section for scattering (encounter) at impact parameter b is\nAgain by definition, since x is a function of b\n[dbldx is negative but different,ial cross-sect,ions are posit,ive.]\nSubstitute and we get\n[This is a general result for classical collisions.]\nFor Coulomb collisions, in C of M frame,\nb\ncot (:I\n- = -\nb90\n+ db\n,d\nX\n= b\nb90\n90 c o t\n2x\n- = -- cosec - .\ndx\ndx\nHence\ndff\nb90 cot $ b90\n2x\n-\n-\ncosec\ndfl,\nsinx\n-\n- bgo cos $/sin 5\n2 2sin $ cos $ sin2 5\nThis is the Rutherford Cross-Section.\nfor scattering by Coulomb forces through an angle x measured in C of M frame\nNotice that & i i as x i 0.\nThis is because of the long-range nature of the Coulomb force. Distant collisions tend to\ndominate. (X i 0 H b i a).\n\n3.3 Relaxation Processes\nThere are 2 (main) different types of collisional relaxation process we need to discuss for a\ntest particle moving through a background of scatterers:\n1. Energy Loss (or equilibrium)\n2. Momentum Loss (or angular scattering)\nThe distinction may be illustrated by a large angle (90\") scatter from a heavy (stationary)\ntarget\nIf the target is fixed, no energy is transferred to it. So the energy loss is zero (or small if\nscatterer is just 'heavy'). However, the momentum in the x direction is completely 'lost' in\nthis 90\" scatter.\nThis shows that the timescales for Energy loss and momentum loss may be very different.\n3.3.1 Energy Loss\nFor an initially stationary target, the final velocity in lab frame of the projectile is\nSo the final kinetic energy is\n2mlm2\n= -m1v; {1+\n2 sin\n(m1+ m2)\n-\nHence the kinetic energy lost is AK = K - Kt\n4mlm2\n2 XC\n= m1V2\nsin -\n(3.53)\n(m1+ m2)\n4mlm2\nxc\nb\n= m 1 v 1\n[using cot -\n= -1\n(3.54)\n( m l + m2)2 (&)) + 1\nb90\n(exact). For small angles x << 1 i.e. blbgo >> 1 this energy lost in a single collision is\napproximately\n\nIf what we are asking is: how fast does the projectile lose energy? Then we need add up the\neffects of all collisions in an elemental length d! at all relevant impact parameters.\nThe contribution from impact parameter range db at b will equal the number of targets\nencountered times AK:\n-\n4m1m2\nn2d!2rbdb m l v 1\n(F)'\n(ml+ m2)'\nencounters\n.-\nLoss per encounter (AK)\nThis must be integrated over all b to get total energy loss\ndK\nm1m2\n- = K n 2\n8nb;, [In b]::\nd!\n(m1 + m2I2\nWe see there is a problem both limits of the integral (b i 0, b i oo) diverge logarithmically.\nThat is because the formulas we are integrating are approximate.\n1. We are using small-angle approx for AK.\n2. We are assuming the Coulomb force applies but this is a plasma so there is screening.\n3.3.2 Cut-offs Estimates\n1. Small-angle approx breaks down around b = bgO. Just truncate the integral there;\nignore contributions from b < bgO.\n2. Debye Shielding says really the potential varies as\n\"\"P (2)\n4~\ninstead of\nr\nK -\nr\nso approximate this by cutting off integral at b = AD equivalent to\nb,,\n= b 90.\nb,\n= AD\n\nSo Coulomb Logarithm is '1nA'\nBecause these cut-offs are in in term result is not sensitive to their exact values.\nOne commonly uses Collision Frequency. Energy Loss Collision Frequency is\nSubstitute for bgO and m, (in bgO)\nCollision time\nTK TK 1/uK\nEffective (Energy Loss) Cross-section\n[+% = ffKn2]\n3.3.3 Momentum Loss\nLoss of x-momentum in 1 collision is\n(small angle approx). Hence rate of momentum loss can be obtained using an integral\nidentical to the energy loss but with the above parameters:\nNote for the future reference:\n\nTherefore Momentum Loss\nCollision Frequency\nCollision Time\nT, = l/vp\nCross-Section (effective)\n0 = vp/n2vl\nNotice ratio\nEnergy Loss v~\nm l + m2\n2ml\n(3.78)\nThis is\nThird case, e.g. electrons i shows that mostly the angle of velocity scatters. Therefore\nMomentum 'Scattering' time is often called '90\" scattering' time to 'diffuse' through 90\" in\nangle.\n3.3.4 'Random Walk' in angle\nWhen ml << m2 energy loss << momentum loss. Hence v i -. vl. All that matters is the\nscattering angle: X L -. X , -. 2bso/b.\nMean angle of deviation in length L is zero because all directions are equally likely.\nBut:\nMean square angle is\nSpread is 'all round' when Act2 -. 1. This is roughly when a particle has scattered 90\" on\naverage. It requires\nLn2 8.rrb;, in A = 1 .\n(3 34)\n\nSo can think of a kind of 'cross-section' for 'ugO' 90\" scattering as such that\nn2L'ogo' = 1 when Ln2 8~ b:,\n1nA = 1\n(3.85)\ni.e. 'ffgo'\n= 8~ b:,\n1nA (= 2oP)\n(3.86)\nThis is 8 in,\\ larger than cross-section for 90\" scattering in single collision.\nBe Careful! 'gg0' is not a usual type of cross-section because the whole process is really\ndiffusive in angle.\nActually all collisio~l processes due t,o coulomb force are best treated (in a Mathematical\nway) as a diffusion in velocity space\ni Fokker-Plmck equation.\n3.3.5 Summary of different types of collision\nThe Energy Loss collision frequency is to do with slowing down to rest and exchanging\nenergy. It is required for calculating\nEquilibration Times (of Temperatures)\nEnergy Transfer between species.\nThe Momentum Loss frequency is to do with loss of directed velocity. It is required for\ncalculating\nMobility: Conductivity/Resistivity\nViscosity\nParticle Diffusion\nEnergy (Thermal) Diffusion\nUsually we distinguish between electrons and ions because of their very different mass:\nEnergy Loss\n[Stationary Targets]\nMomentum Loss\nSometimes one distinguishes between 'transverse diffusion' of velocity and 'momentum loss'.\nThe ratio of these two is\n\n= 1\nlike particles\nHence\nv.. = Pv..-\nZ Z\n- Kvii (= vii!!) (Like Ions)\n[But note: ions are slowed down by electrons long before being angle scattered.]\n3.4 Thermal Distribution Collisions\nSo far we have calculated collision frequencies with stationary targets and single-velocity\nprojectiles but generally we shall care about thermal (Maxwellian) distributions (or nearly\nthermal) of both species. This is harder to calculate and we shall resort to some heuristic\ncalculations.\nVery rare for thermal ion velocity to be - electron. So ignore ion motion.\nAverage over electron distribution.\nMomentum loss to ions from (assumed) drifting Maxwellian electron distribution:\nEach electron in this distribution is losing momentum to the ions at a rate given by the\ncollision frequency\n424:\n4~ (me\nvp = ni\n+ mi) In A\n(3.98)\n( 4 7 ~ ~ ) ~\nmimzv3\nso total rate of loss of momentum is given by (per unit volume)\nTo evaluate this integral approximately we adopt the following simplifications\n\n1. Ignore variations of 1nA with v and just replace a typical thermal value in A =\nX D / ~ S O ( ~ I ) .\n2. Suppose r\nthat drift velocity vd is small relative '\nto the typical thermal velocity, written\nv, = t,/m, and express f, in terms of u =\nto first order in ud = -:\nZle\nZle\ntaking x-axis along ud and denoting by f, the unshifted Maxwellian\nThen momentum loss rate per unit volume\nTo evaluate this integral, use the spherical symmetry off, to see that:\nThus the Maxwell-averaged momentum-loss frequency is\n(where p = m,vdn, is the momentum per unit volume attributable to drift)\n(substituting for thermal electron velocity, v,, and dropping\norder term), where Ze = qi.\nThis is the standard form of electron collision frequency.\n\nIon momentum loss to electrons can be treated by a simple Galilean transformation of the\ne i i case because it is still the electron thermal motions that matter.\nIons + Electrons\nIons + Electrons\nFigure 3.6: Ion-electron collisions are equivalent to electron-ion collisions in a moving refer-\nence frame.\nRate of momentum transfer, 2, is same in both cases:\n(since drift velocities are the same).\nIon momentum loss to electrons is much lower collision frequency than e i i because ions\npossess so much more momentum for the same velocity.\nIon-ion collisions can be treated somewhat like e i i collisions except that we have to\naccount for moving targets i.e. their thermal motion.\nConsider two different ion species moving relative to each other with drift velocity vd; the\ntargets' thermal motion affects the momentum transfer cross-section.\nUsing our previous expression for momentum transfer, we can write the average rate of\ntransfer per unit volume as: [see 3.74 \"note for future reference\"]\nwhere v, is the relative velocity (vl - v2) and bgO is expressed\n\nand m, is the reduced mass m1tm2\nSince everything in the integral apart from f 1 f 2 depends only on the relative velocity, we\nproceed by transforming the velocity coordinates from vl,v2 to being expressed in terms of\nrelative (v,) and average ( V say)\nTake fl and f2 to be shifted Maxwellians in the overall C of M frame:\nwhere mlvdl + m2Vd2 = 0. Then\nto first order in vd. Convert CM coordinates and find (after algebra)\nwhere M = ml + m2. Note also that (it can be shown) d3vld3v2 = d3v,d3V. Hence\nvrm,v,47r b:, in Anln2\ndt\nM V ~\nmrv,2\nm,\nexp\nexp\n(1 + T ~ d . ~ r )\nd3v.d3v\n(3.115)\nand since\n*\nnothing except the exponential depends\n' (-1\non V , that integral can be done:\n-\n-m,v,2\nm,\ndt = / v r mrvr47r 1nA nln2 (-) m,\n27rT\nexp\n27r\n(1 + ,vd.vr)\nd3vr\n(3.116)\nThis integral is of just the same type as for e - i collisions, i.e\n\nwhere vrt = E,\nbgO(vrt) is the ninety degree impact parameter evaluated at velocity vt,,\nand fo is the normalized Maxwellian.\nThis is the general result for momentum exchange rate between two Maxwellians drifting at\nsmall relative velocity vd.\nTo get a collision frequency is a matter of deciding which species is stationary and so what the\nmomentum density of the moving species is. Suppose we regard 2 as targets then momentum\ndensity is nlmlvd so\nThis expression works immediately for electron-ion collisions substituting m, -. me, recov-\nering previous.\nFor equal-mass ions m,\nm i\n= -\n= ,mi and vrt =\nm i t m i\nmy = p.\nmi\nSubstituting, we get\n47r\nv..\n7%-\n- -\nni (z)\nl n h\n(3.120)\n37rZ\nm? Ti\"\nthat is, 5 times the e - i expression but with ion parameters substituted. [Note, however,\nthat we have considered the ion species to be different.]\nElectron-electron collisions are covered by the same formalism, so\nHowever, the physical case under discussion is not so obvious; since electrons are indistigu-\nishable how do we define two different \"drifting maxwellian\" electron populations? A more\nspecific discussion\n-\nwould be needed to make this rigorous.\nGenerally v,,\nveil& : electron-electron collision frequency - electron-ion (for momentum\nloss)\n3.4.5 Summary of Thermal Collision Frequencies\nFor momentum loss:\n\n-\nv,, \" 1 -\n-\nvei .\n(electron parameters)\n(3.123)\n2/2\nEnergy loss Kv related to the above (pv) by\nTransverse 'dzffuszon'\nof momentum 'v, related to the above by:\n3.5 Applications of Collision Analysis\n3.5.1 Energetic ('Runaway') Electrons\nConsider an energetic (;met$ >> T) electron travelling through a plasma. It is slowed down\n(loses momentum) by collisions with electrons and ions (Z), with collision frequency:\nHence (in the absence of other forces)\nThis is equivalent to saying that the electron experiences an effective 'Frictional' force\n\nNotice\n1. for Z = 1 slowing down is\non electrons\nions\n2. Ff decreases with v increasing.\nSuppose now there is an electric field, E. The electron experiences an accelerating Force\nTotal force\nd\ne4\n8.rrln.h\nF=-( mv) = e\nE\n+ Ff = e\nE\n\n-\n(3.134)\ndt\nTwo Cases (When E is accelerating)\n1. e E < IFf: Electron Slows Down\n2. e E > IFf: Electron Speeds Up!\nOnce the electron energy exceeds a certain value its velocity increases continuously and the\nfriction force becomes less and less effective. The electron is then said to ahve become a\n'runaway '.\n3.5.2 Plasma Resistivity (DC)\nConsider a bulk distribution of electrons in an electric field. They tend to be accelerated by\nE and decelerated by collisions.\nIn this case, considering the electrons as a whole, no loss of total electron momentum by\ne - e collisions. Hence the friction force we need is just that due to Gi.\nIf the electrons have a mean drift velocity vd(<< vthe) then\nHence in steadv state\nThe current is then\nn,e2E\n1 = -n,evd =\n(3.138)\nmevei\nNow generally, for a conducting medium we define the conductivity, 0 , or resistivity, 7, by\n\nTherefore, for a plasma,\nnee2\ng = = -\nmeGi\nSubstitute the value of vei and we get\n- Ze2m2 8~ in A\n-\n(for a single ion species).\n( ~ T C , ) ~\n\nT2\nNotice\n1. Density cancels out because more electrons means (a) more carriers but (b) more\ncollisions.\n2. Main dependence is 7 K T;~/~. High electron temperature implies low resistivity (high\nconductivity).\n3. This expression is only approximate because the current tends to be carried by the\nmore energetic electrons, which have smaller vei; thus if we had done a proper average\nover f (v,) we expect a lower numerical value. Detailed calculations give\nfor Z = 1 (vs. -.\nin our expression). This is 'Spitzer' resistivity. The detailed\ncalculation value is roughly a factor of two smaller than our calculation, which is not\na negligible correction!\n3.5.3 Diffusion\nFor motion parallel to a magnetic field if we take a typical electron, with velocity v -. vt, it\nwill travel a distance approximately\nbefore being pitch-angle scattered enough to have its velocity randomised. [This is an order-\nof-magnitude calculation so we ignore u,,.] !\nis the mean free path.\nRoughly speaking, any electron does a random walk along the field with step size !\nand step\nfrequency vei. Thus the diffusion coefficient of this process is\nSimilarly for ions\n\n(if T, 2 Ti)\nUte\nHence\n!, 2 ti\nMean free paths for electrons and ions are - same.\nThe diffusion coefficients are in the ratio\nDi\n: Ions diffuse slower in parallel direction.\n(3.148)\nDiffusion Perpendicular to Mag. Field is different\nFigure 3.7: Cross-field diffusion by collisions causing a jump in the gyrocenter (GC) position.\nRoughly speaking, if electron direction is changed by -\n-\n90\" the Guiding Centre -\nmoves by\na distance\nr ~ .\nHence we may think of this as a random walk with step size\nr~ and\nfrequency vei. Hence\nDel\nUte -\n2 rZevei 2\n(3.149)\nIon transport is similar but requires a discussion of the effects of like and unlike collisions.\nParticle transport occurs only via unlike collisions. To show this we consider in more detail\nthe change in guiding center position at a collision. Recall mv = qv A B which leads to\nvl = r~\nA B\n(perp. velocity only).\n(3.150)\nm\nThis gives\nB A m v l\nr~ =\n(3.151)\n4B2\nAt a collision the particle position does not change (instantaneously) but the guiding center\nposition (ro) does.\n\nChange in r~ is due to the momentum change caused by the collision:\nThe total momentum conservation means that A(mv) for the two particles colliding is equal\nand opposite. Hence, from our equation, for like particles, Aro is equal and opposite. The\nmean position of guiding centers of two colliding like particles (rol + rO2)/2 does not change.\nNo net cross field particle (guiding center) shift.\nUnlike collisions (between particles of different charge q) do produce net transport of particles\nof either type. And indeed may move rol and ro2 in same direction if they have opposite\ncharge.\nDil\n-\n\n'ti-\nrr rLi Pvie ^.\n(3.155)\nNotice that ri,/ri, -. mi/me\n; Wie/vei ^. %\nmi\nSo Dil/De1 -. 1 (for equal temperatures). Collisional diffusion rates of particles are same\nfor ions and electrons.\nHowever energy transport is different because it can occur by like-like collisins\nThermal Diffusivity:\nrii ~\ni\ni\nmi m2\nxiIxe -\n-\n\n-\n^. - = (3\n' (equal T)\nr~~ Vei\nme ,?\nCollisional Thermal transport by Ions is greater than by electrons [factor - (milme)' ]\n3.5.4 Energy Equilibration\nIf T, # Ti then there is an exchange of enegy between electrons and ions tending to make\nT, =Ti. As we saw earlier\nK,,\nme 1\nez - 2me pYei = - vei\n(3.159)\nmi\nmi\nSo applying this to averages\n\nThermal energy exchange occurs - m,/mi slower than momentum exchange. (Allows T, #\n.\nSo\nFrom this one can obtain the heat exchange rate (per unit volume), Hei, say:\nImportant point:\n'Electrons and Ions equilibrate among themselves much faster than with each other'\n3.6 Some Orders of Magnitude\n1. 1nA is very slowly varying. Typically has value - 12 to 16 for laboratory plasmas\n2. vei -- 6 x 10-\"(ni/m3) / (T,/~V);\n(1nA = 15, Z = 1).\ne.g. = 2 x 105s-' (when n = 1020m-3 and T, = IkeV.) For phenomena which happen\nmuch faster than this, i.e. T << l/vei - 5ps, collisions can be ignored.\nExamples: Electromagnetic Waves with high frequency.\n3. Resistivity. Because most of the energy of a current carrying plasma is in the B field\nnot the K.E. of electrons. Resistive decay of current can be much slower than vei. E.g.\nCoaxial Plasma: (Unit length)\nInductance\nL\nb\n= p, in a\nResistance\nR = 7 l/.rra2\nL/R decay time\nComparison 1 keV temperature plasma has - same (conductivity/) resistivity as a slab\nof copper (- 2 x 10-8flm).\nOhmic Heating Because 7 K T;~/',\nif we try to heat a plasma Ohmically, i.e. by simply\npassing a current through it, this works well at low temperatures but its effectiveness falls\noff rapidly at high temperature.\n\nResult for most Fusion schemes it looks as if Ohmic heating does not quite yet get us to the\nrequired ignition temperature. We need auxilliary heating, e.g. Neutral Beams. (These slow\ndown by collisions.)"
    },
    {
      "category": "Resource",
      "title": "chap4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/c168b1b911621d2299f82eb8c1178b70_chap4.pdf",
      "content": "Chapter 4\nFluid Description of Plasma\nThe single particle approach gets to be horribly complicated, as we have seen.\nBasically we need a more statistical approach because we can't follow each particle separately.\nIf the details of the distribution function in velocity space are important we have to stay\nwith the Boltzmann equation. It is a kind of particle conservation equation.\n4.1\nParticle Conservation (In 3d Space)\nFigure 4.1: Elementary volume for particle conservation\nNumber of particles in box ΔxΔyΔz is the volume, ΔV = ΔxΔyΔz, times the density n.\nRate of change of number is is equal to the number flowing across the boundary per unit\ntime, the flux. (In absence of sources.)\n∂ [ΔxΔyΔz n] = Flow Out across boundary.\n(4.1)\n- ∂t\nTake particle velocity to be v(r) [no random velocity, only flow] and origin at the center of\nthe box refer to flux density as nv = J.\nFlow Out = [Jz (0, 0, Δz/2) - Jz (0, 0, -Δz/2)] ΔxΔy + x + y .\n(4.2)\n\nZ\nZ\nR\nR\nR\nExpand as Taylor series\n∂\nJz (0, 0, η) = Jz (0) +\nJz . η\n(4.3)\n∂z\nSo,\n∂\nflow out\n(nvz )ΔzΔxΔy + x + y\n(4.4)\n' ∂z\n=\nΔV r . (nv).\nHence Particle Conservation\n∂ n = r.(nv)\n(4.5)\n- ∂t\nNotice we have essential proved an elementary form of Gauss's theorem\nr.Ad3 r =\nA.dS.\n(4.6)\nv\n∂γ\nThe expression: 'Fluid Description' refers to any simplified plasma treatment which does\nnot keep track of vdependence of f detail.\n1. Fluid Descriptions are essentially 3d (r).\n2. Deal with quantities averaged over velocity space (e.g. density, mean velocity, ...).\n3. Omit some important physical processes (but describe others).\n4. Provide tractable approaches to many problems.\n5. Will occupy most of the rest of my lectures.\nFluid Equations can be derived mathematically by taking moments1 of the Boltzmann Equa\ntion.\n0th moment\nd3 v\n(4.7)\n1st moment\nvd3 v\n(4.8)\n2nd moment\nvvd3 v\n(4.9)\nThese lead, respectively, to (0) Particle (1) Momentum (2) Energy conservation equations.\nWe shall adopt a more direct 'physical' approach.\n1They are therefore sometimes called 'Moment Equations.'\n\n4.2\nFluid Motion\nThe motion of a fluid is described by a vector velocity field v(r) (which is the mean velocity\nof all the individual particles which make up the fluid at r). Also the particle density\nn(r) is required. We are here discussing the motion of fluid of a single type of particle of\nmass/charge, m/q so the charge and mass density are qn and mn respectively.\nThe particle conservation equation we already know. It is also sometimes called the 'Conti\nnuity Equation'\n∂ n + r.(nv) = 0\n(4.10)\n∂t\nIt is also possible to expand the r. to get:\n∂ n + (v.r)n + nr.v = 0\n(4.11)\n∂t\nThe significance, here, is that the first two terms are the 'convective derivative\" of n\nD\nd\n∂ + v.r\n(4.12)\nDt ≡ dt ≡ ∂t\nso the continuity equation can be written\nD\nDtn = -nr.v\n(4.13)\n4.2.1\nLagrangian & Eulerian Viewpoints\nThere are essentially 2 views.\n1. Lagrangian. Sit on a fluid element and move with it as fluid moves.\nFigure 4.2: Lagrangean Viewpoint\n2. Eulerian. Sit at a fixed point in space and watch fluid move through your volume\nelement: \"identity\" of fluid in volume continually changing\n∂ means rate of change at fixed point (Euler).\n∂t\nD\nd\n∂ + v.r means rate of change at moving point (Lagrange).\nDt ≡ dt ≡ ∂t\ndx ∂ + dy ∂ + dz ∂ : change due to motion.\nv.r = ∂t ∂x\n∂t ∂y\n∂t ∂z\n\n\"\n#\nX\nFigure 4.3: Eulerian Viewpoint\nOur derivation of continuity was Eulerian. From the Lagrangian view\nD\nd ΔN\nΔN d\ndΔV\nDt n = dt ΔV = - ΔV 2 dt ΔV = -n ΔV\ndt\n(4.14)\nsince total number of particles in volume element (ΔN) is constant (we are moving with\nthem). (ΔV = ΔxΔyΔz.)\nd\ndΔx\ndΔy\ndΔz\nNow\nΔV\n=\nΔyΔz +\nΔzΔx +\nΔyΔx\n(4.15)\ndt\ndt\ndt\ndt\n1 dΔx\n1 dΔy\n1 dΔz\n=\nΔV\n+\n+\n(4.16)\nΔx dt\nΔy\ndt\nΔx dt\nd (Δx)\nBut\n= vx (Δx/2) - vx (-Δx/2)\n(4.17)\ndt\n∂vx\nΔx\netc.\n. . . y\n. . . z\n(4.18)\n'\n∂x\nHence\n\"\n#\nd\n∂vx\n∂vy\n∂vz\nΔV = ΔV\n+\n+\n(4.19)\ndt\n∂x\n∂y\n∂z\n= ΔV r.v\nand so\nD\nDt n = -nr.v\n(4.20)\nLagrangian Continuity. Naturally, this is the same equation as Eulerian when one puts\nD\n∂\n=\n+ v.r.\nDt\n∂t\nThe quantity -r.v is the rate of (Volume) compression of element.\n4.2.2\nMomentum (Conservation) Equation\nEach of the particles is acted on by the Lorentz force q[E + ui ∧ B] (ui is individual particle's\nvelocity).\nHence total force on the fluid element due to EM fields is\n(q [E + ui ∧ B]) = ΔN q (E + v ∧ B)\n(4.21)\ni\n\nP\nX\n(Using mean: v =\ni u/ΔN.)\nEM Force density (per unit volume) is:\nFEM = nq(E + v ∧ B).\n(4.22)\nThe total momentum of the element is\nmui = m ΔN v = ΔV mnv\n(4.23)\ni\nso Momentum Density is mnv.\nIf no other forces are acting then clearly the equation of motion requires us to set the time\nderivative of mnv equal to FEM . Because we want to retain the identity of the particles\nunder consideration we want D/Dt i.e. the convective derivative (Lagrangian picture).\nIn general there are additional forces acting.\n(1) Pressure\n(2) Collisional Friction.\n4.2.3\nPressure Force\nIn a gas p(= nT ) is the force per unit area arising from thermal motions. The surrounding\nfluid exerts this force on the element:\nFigure 4.4: Pressure forces on opposite faces of element.\nNet force in x direction is\np (Δx/2) ΔyΔz + p (-Δx/2) ΔyΔz\n(4.24)\n-\n∂p\n∂p\n-ΔxΔyΔz\n= -ΔV\n= -ΔV (rp)x\n(4.25)\n'\n∂x\n∂x\nSo (isotropic) pressure force density (/unit vol)\nFp =\n(4.26)\n-rp\nHow does this arise in our picture above?\nAnswer: Exchange of momentum by particle thermal motion across the element boundary.\nAlthough in Lagrangian picture we move with the element (as defined by mean velocity v)\nindividual particles also have thermal velocity so that the additional velocity they have is\nwi = ui - v\n'peculiar' velocity\n(4.27)\n\n| {z }\nZ\nZ\n\n!\nBecause of this, some cross the element boundary and exchange momentum with outside.\n(Even though there is no net change of number of particles in element.) Rate of exchange\nof momentum due to particles with peculiar velocity w, d3w across a surface element ds is\nf (w)mw d3 w\n|\n{z\n}\n×\nw . ds\n(4.28)\nmomm density at w\nflow rate across ds\nIntegrate over distrib function to obtain the total momentum exchange rate:\nds.\nmwwf (w)d3 w\n(4.29)\nThe thing in the integral is a tensor. Write\np =\nmwwf (w)d3 w\n(Pressure Tensor)\n(4.30)\nThen momentum exchange rate is\np . ds\n(4.31)\nActually, if f (w) is isotropic (e.g. Maxwellian) then\nZ\npxy =\nm wx wy f (w)d3 w = 0\netc.\n(4.32)\nZ\nand pxx =\nmw 2\nx f (w)d3 w ≡nT (= pyy = pzz = 'p')\n(4.33)\nSo then the exchange rate is pds. (Scalar Pressure).\nIntegrate ds over the whole ΔV then x component of momm exchange rate is\np\nΔx\n\nΔyΔz --p\n-Δx\n\nΔyΔz = ΔV (rp)x\n(4.34)\nand so\nTotal momentum loss rate due to exchange across the boundary per unit volume is\nrp\n(= -Fp)\n(4.35)\nIn terms of the momentum equation, either we put rp on the momentum derivative side or\nFp on force side. The result is the same.\nIgnoring Collisions, Momentum Equation is\nD (mnΔV v) = [FEM + Fp] ΔV\n(4.36)\nDt\nD\nRecall that nΔV = ΔN\n;\nDt (ΔN ) = 0; so\nDv\nL.H.S. = mnΔV\n.\n(4.37)\ndt\nThus, substituting for F0s:\nMomentum Equation.\nDv\n∂v\nmn\n= mn\n+ v.rv\n(4.38)\n= qn (E + v ∧B) -rp\nDt\n∂t\n\nZ\nr.{\nZ\n|\n{z\n}\nr.{\nr\n\"\n#\n+ r\n4.2.4\nMomentum Equation: Eulerian Viewpoint\nFixed element in space. Plasma flows through it.\n1. E.M. force on element (per unit vol.)\nFEM = nq(E + v ∧B)\nas before.\n(4.39)\n2. Momentum flux across boundary (per unit vol)\n= r.\nm(v + w)(v + w) f (w) d3 w\n(4.40)\n=\nm(vv +\nvw + wv\n+ww) f (w) d3 w}\n(4.41)\nintegrates to 0\n=\nmnvv + p}\n(4.42)\n= mn(v.r)v + mv [\n.(nv)] + rp\n(4.43)\n(Take isotropic p.)\n3. Rate of change of momentum within element (per unit vol)\n∂\n=\n(mnv)\n(4.44)\n∂t\nHence, total momentum balance:\n∂ (mnv) + mn(v.r)v + mv [\n.(nv)] + rp = FEM\n(4.45)\n∂t\nr\nUse the continuity equation:\n∂n\n.(nv) = 0 ,\n(4.46)\n∂t\nto cancel the third term and part of the 1st:\n∂\n∂n\n∂v\n∂v\n(mnv) + mv (r. (nv)) = mv{\n+ r. (nv)} + mn\n= mn\n(4.47)\n∂t\n∂t\n∂t\n∂t\nThen take rp to RHS to get final form:\nMomentum Equation:\n∂v\nmn\n+ (v.r) v = nq (E + v ∧B) -rp .\n(4.48)\n∂t\nAs before, via Lagrangian formulation. (Collisions have been ignored.)\n\n4.2.5\nEffect of Collisions\nFirst notice that like particle collisions do not change the total momentum (which is averaged\nover all particles of that species).\nCollisions between unlike particles do exchange momentum between the species. Therefore\nonce we realize that any quasineutral plasma consists of at least two different species (elec\ntrons and ions) and hence two different interpenetrating fluids we may need to account for\nanother momentum loss (gain) term.\nThe rate of momentum density loss by species 1 colliding with species 2 is:\nν12n1m1(v1 -v2)\n(4.49)\nHence we can immediately generalize the momentum equation to\n\"\n#\nm1n1\n∂v1\n∂t + (v1.r) v1 = n1q1 (E + v1 ∧B) -rp1 -ν12n1m1 (v1 -v2)\n(4.50)\nWith similar equation for species 2.\n4.3\nThe Key Question for Momentum Equation:\nWhat do we take for p?\nBasically p = nT is determined by energy balance, which will tell how T varies. We could\nwrite an energy equation in the same way as momentum. However, this would then contain\na term for heat flux, which would be unknown. In general, the kth moment equation contains\na term which is a (k + 1)th moment.\nContinuity, 0th equation contains v determined by\nMomentum, 1st\nequation contains p determined by\nEnergy,\n2nd equation contains Q determined by . . .\nIn order to get a sensible result we have to truncate this hierarchy. Do this by some sort of\nassumption about the heat flux. This will lead to an\nEquation of State:\npn-γ = const.\n(4.51)\nThe value of γ to be taken depends on the heat flux assumption and on the isotropy (or\notherwise) of the energy distribution.\nExamples\n1. Isothermal: T = const.:\nγ = 1.\n2. Adiabatic/Isotropic: 3 degrees of freedom γ = 5 .\n3. Adiabatic/1 degree of freedom\nγ = 3.\n\n\"\n#\nr\nr\n+ r\n4. Adiabatic/2 degrees of freedom\nγ = 2.\nIn general, n(`/2)δT = -p(δV/V )\n(Adiabatic ` degrees)\n` δT\n-δV\nδn\n(4.52)\n=\n=\n+\n2 T\nV\nn\nSo\nδp\nδn\nδT\nδn\n=\n+\n=\n1 +\n,\n(4.53)\np\nn\nT\n`\nn\ni.e.\npn-(1+ 2\n` ) = const.\n(4.54)\nIn a normal gas, which 'holds together' by collisions, energy is rapidly shared between 3\nspacedegrees of freedom. Plasmas are often rather collisionless so compression in 1 dimension\noften stays confined to 1degree of freedom. Sometimes heat transport is so rapid that the\nisothermal approach is valid. It depends on the exact situation; so let's leave γ undefined\nfor now.\n4.4\nSummary of TwoFluid Equations\nSpecies j\nPlasma Response\n1. Continuity:\n∂nj\n.(njvj) = 0\n(4.55)\n∂t\n2. Momentum:\n∂vj\nmjnj\n+ (vj.r) vj\nνjknjmj (vj -vk)\n(4.56)\n∂t\n= njqj (E + vj ∧B) -rpj -\n3. Energy/Equation of State:\npjn-γ = const..\n(4.57)\nj\n(j = electrons, ions).\nMaxwell's Equations\n.B =\n.E = ρ/o\n(4.58)\nr ∧B\n1 ∂E\n-∂B\n= μoj + c2 ∂t\nr ∧E = ∂t\n(4.59)\n\nWith\nρ = qene + qini = e (-ne + Zni)\n(4.60)\nj = qeneve + qinivi = e (-neve + Znivi)\n(4.61)\n=\nene (ve -vir)\n(Quasineutral)\n(4.62)\n-\nAccounting\nUnknowns\nEquations\nne, ni\n2 Continuity e, i\nve, vi\n6 Momentum e, i\npe, pi\n2 State e, i\nE, B\n6 Maxwell\nbut 2 of Maxwell (r. equs) are redundant because can be deduced from others: e.g.\n∂\nr. (r ∧E)\nand r. (r ∧B)\n=\n=\n0 = -∂t (r.B)\n0 = μor.j + 1\nc2\n∂\n∂t (r.E) = 1\nc2\n∂\n∂t\n-ρ\no\n+ r.E\n\n(4.63)\n(4.64)\nSo 16 equs for 16 unknowns.\nEquations still very difficult and complicated mostly because it is Nonlinear\nIn some cases can get a tractable problem by 'linearizing'. That means, take some known\nequilibrium solution and suppose the deviation (perturbation) from it is small so we can\nretain only the 1st linear terms and not the others.\n4.5\nTwoFluid Equilibrium: Diamagnetic Current\n∂\n∂\nSlab:\n∂ = 0\n∂y , ∂z = 0.\n∂x 6\nStraight Bfield:\nB = Bˆz.\n∂\nEquilibrium:\n∂t = 0\n(E = -rφ)\nCollisionless:\nν\n0.\n→\nMomentum Equation(s):\nmjnj(vj.r)vj\n(4.65)\n= njqj(E + vj ∧B) -rpj\nDrop j suffix for now. Then take x, y components:\nd\ndp\nmn vx\nvx = nq(Ex + vyB) -\n(4.66)\ndx\ndx\nd\nmn vx\nvy = nq(0 -vxB)\n(4.67)\ndx\n\nP\nP\nEq 4.67 is satisfied by taking vx = 0. Then 4.66 →\ndp\nnq(Ex + vy B) -\n= 0.\n(4.68)\ndx\ni.e.\ndp\nvy = -Ex +\n(4.69)\nB\nnqB dx\nor, in vector form:\nB\nv = E ∧ B\nrp\n(4.70)\nB2\n-\nnq ∧ B2\n|\n{z\n}\n|\n{z\n}\nE∧B drift\nDiamagnetic Drift\nNotice:\n- In magnetic field (⊥) fluid velocity is determined by component of momentum equation\northogonal to it (and to B).\n- Additional drift (diamagnetic) arises in standard F ∧ B form from pressure force.\n- Diagmagnetic drift is opposite for opposite signs of charge (electrons vs. ions).\nNow restore species distinctions and consider electrons plus single ion species i. Quasineu\ntrality says niqi = -neqe. Hence adding solutions\nB\nE ∧ B (niqi + neqe)\n+ pi) ∧\nneqeve + niqivi =\nB2\n|\n{z\n} -r (pe\n(4.71)\nB2\n=0\nHence current density:\nB\nj = -r (pe + pi) ∧\n(4.72)\nB2\nThis is the diamagnetic current. The electric field, E, disappears because of quasineutrality.\n(General case\nj qj nj vj = -r( pj )∧B/B2).\n4.6\nReduction of Fluid Approach to the Single Fluid\nEquations\nSo far we have been using fluid equations which apply to electrons and ions separately.\nThese are called 'Two Fluid' equations because we always have to keep track of both fluids\nseparately.\nA further simplification is possible and useful sometimes by combining the electron and ion\nequations together to obtain equations governing the plasma viewed as a 'Single Fluid'.\n\n!\nX\n\n!\n\n!\n\n!\nRecall 2fluid equations:\n∂nj\nContinuity (Cj)\n+ r.(njvj) = 0.\n(4.73)\n∂t\n∂\nMomentum (Mj)\nmjnj\n+ vj.r vj = njqj (E + vj ∧B) -rpj + Fjk (4.74)\n∂t\n(where we just write Fjk =\nvjknjmj (vj -vk) for short.)\n-\nNow we rearrange these 4 equations (2 × 2 species) by adding and subtracting appropriately\nto get new equations governing the new variables:\nMass Density\nρm = neme + nimi\n(4.75)\nC of M Velocity\nV =\n(nemeve + nimivi) /ρm\n(4.76)\nCharge density\nρq = qene + qini\n(4.77)\nElectric Current Density j = qeneve + qinivi\n(4.78)\n= qene (ve -vi) by quasi neutrality\n(4.79)\nTotal Pressure\np = pe + pi\n(4.80)\n1st equation: take me × Ce + mi × Ci →\n∂ρm\n(1)\n+ r. (ρmV) = 0\nMass Conservation\n(4.81)\n∂t\n2nd take qe × Ce + qI × Ci →\n(2)\n∂ρq + r.j = 0\nCharge Conservation\n(4.82)\n∂t\n3rd take Me + Mi. This is a bit more difficult. RHS becomes:\n= ρqE + j ∧B -r (pe + pi)\n(4.83)\nnjqj (E + vj ∧B) -rpj + Fjk\n(we use the fact that Fei -Fie so no net friction). LHS is\nX\n∂\nmjnj\n+ vj.r vj\n(4.84)\n∂t\nj\nThe difficulty here is that the convective term is nonlinear and so does not easily lend itself\nto reexpression in terms of the new variables. But note that since me << mi the contribution\nfrom electron momentum is usually much less than that from ions. So we ignore it in this\nequation. To the same degree of approximation V ' vi: the CM velocity is the ion velocity.\nThus for the LHS of this momentum equation we take\nX\n∂\n∂\nmini\n+ vj.r vj ' ρm\n+ V.r V\n(4.85)\n∂t\n∂t\nj\n\n\"\n#\n\nX\n\n!\n\n!\n\n!\n\n!\n\n!\nso:\n\n!\n∂\n(3)\nρm\n+ V.r V = ρq\n(4.86)\n∂t\nE + j ∧B -rp\nqe\nFinally we take me Me + qi Mi to get:\nmi\nX\n∂\nX nj q2\nj\nqj\nqj\n+ (vj .r)\n(E + vj ∧B) -\nFjk }\n(4.87)\nrpj +\n{\nnj qj\nvj =\n∂t\nmj\nmj\nmj\nj\nj\nAgain several difficulties arise which it is not very profitable to deal with rigorously. Observe\nthat the LHS can be written (using quasineutrality niqi + neqe = 0) as ρm ∂t\n∂\nj\nprovided\nρm\nwe discard the term in (v.r)v. (Think of this as a linearization of this question.) [The\n(v.r)v convective term is a term which is not satisfactorily dealt with in this approach to\nthe single fluid equations.]\nIn the R.H.S. we use quasineutrality again to write\nj\nmini + mene\nnj q\nqeqi\nE\nE = n\nE = -\nρmE, (4.88)\n+\n= ne q\ne q\ne\ne\nmj\nneme\nnimi\nnemenimi\nmemi\nj\ni\nX nj q\nneq\nniq\nq\ne ve +\nvj =\nvi\nmj\nme\nmi\nqeqi\nneqemi\nniqime\n=\nve +\nvi}\nmemi\n{\nqi\nqe\nqeqi\nmi\nme\n=\nnemeve + nimivi -\n+\n(qeneve + qinivi)}\n-memi\n{\nqi\nqe\nqeqi\nmi\nme\n(4.89)\n= -memi\n{ρmV -\nqi\n+ qe\nj}\nAlso, remembering Fei =\nX\nj\n-νeinemi(ve -vi) = -Fie,\nqj\nmj\nFjk = -νei\n\nneqe -neqi\nme\nmi\n\n(ve -vi)\n\n!\n= -νei 1 - qe\nqi\nme\nmi\nj\n(4.90)\nSo we get\n\n!\n\"\n(\n\n! )\n#\nρm\n∂\n∂t\nj\nρm\n= - qeqi\nmemi\nρmE + ρmV -\n\nmi\nqi\n+\n!\nme\nqe\nj ∧B\n-\nqe\nme\nrpe - qi\nmi\nrpi - 1 - qe\nqi\nme\nmi\nνeij\n(4.91)\nmemi\nRegroup after multiplying by qe qiρm :\nmemi ∂\nj\nmi\nme\nE + V ∧B =\n+\n+\nj ∧B\n(4.92)\n- qeqi\n∂t ρm\nρm\nqi\nqe\nqe\nqi\nmemi\nqe me\nmemi\nrpe\nrpi\nνeij\n- me\n+ mi\nρmqeqi\n- 1 - qi mi\nqeqiρm\n\n!\n\n!\nNotice that this is an equation relating the Electric field in the frame moving with the fluid\n(L.H.S.) to things depending on current j i.e. this is a generalized form of Ohm's Law.\nOne essentially never deals with this full generalized Ohm's law. Make some approximations\nrecognizing the physical significance of the various R.H.S. terms.\nmemi ∂\nj\narises from electron inertia.\nqeqi ∂t ρm\nit will be negligible for low enough frequency.\nmi\nme\n+\nj ∧B is called the Hall Term.\nρm\nqi\nqe\nand arises because current flow in a Bfield tends to be diverted across the magnetic field.\nIt is also often dropped but the justification for doing so is less obvious physically.\nqi\nqe\nrpi term\nrpe for comparable pressures,\nmi\nme\nand the latter is ∼ the Hall term; so ignore qirpi/mi.\nLast term in j has a coefficient, ignoring me/mi c.f. 1 which is\nmemiνei\nmeνei\n=\n= η the resistivity.\n(4.93)\nq2\nqeqi (nimi)\ne ne\nHence dropping electron inertia, Hall term and pressure, the simplified Ohm's law becomes:\nE + V ∧B = ηj\n(4.94)\nFinal equation needed: state:\npen-γe + pin-γi = constant.\ne\ni\nTake quasineutrality ⇒ne ∝ni ∝ρm. Take γe = γi, then\npρ-γ = const.\n(4.95)\nm\n4.6.1\nSummary of Single Fluid Equations: M.H.D.\nMass Conservation :\n∂ρm\n∂t + r (ρmV) = 0\n(4.96)\nCharge Conservation :\n∂ρq\n∂t + r.j = 0\n(4.97)\n\n!\n∂\nMomentum :\nρm\n∂t + V.r V = ρq E + j ∧B -rp\n(4.98)\nOhm0s Law :\nE + V ∧B = ηj\n(4.99)\nEq. of State :\npρ-γ\nm = const.\n(4.100)\n\nr\n\n!\n4.6.2\nHeuristic Derivation/Explanation\nMass Charge: Obvious.\n\n!\n∂\nMomm\nρm\n∂t + V.r V = ρq E\n|{z} +\nj ∧B\n| {z }\n- rp\n|{z}\n(4.101)\n|\n{z\n}\nElectric\nMagnetic Force\nPressure\nrate of change of\nbody force\non current\ntotal momentum density\nOhm's Law\nThe electric field 'seen' by a moving (conducting) fluid is E + V ∧B = EV electric field in\nframe in which fluid is at rest. This is equal to 'resistive' electric field ηj:\nEV = E + V ∧B = ηj\n(4.102)\nThe ρq E term is generally dropped because it is much smaller than the j ∧B term. To see\nthis, take orders of magnitude:\n.E = ρq /0\nso ρq ∼E0/L\n(4.103)\n1 ∂E\n+\nso σE = j ∼B/μ0L\n(4.104)\nr ∧B = μ0j\nc2 ∂t\nTherefore\n\n!2\n\nρq E\nB\nLμ0\nL2/c2\n=\nlight transit time\n!2\n.\n(4.105)\njB ∼ L\nμ0σL\nB2 ∼ (μ0σL2)2\nresistive skin time\nThis is generally a very small number. For example, even for a small cold plasma, say Te = 1\neV (σ ≈2 × 103 mho/m), L = 1 cm, this ratio is about 10-8 .\nConclusion: the ρq E force is much smaller than the j ∧B force for essentially all practical\ncases. Ignore it.\nNormally, also, one uses MHD only for low frequency phenomena, so the Maxwell displace\nment current, ∂E/c2∂t can be ignored.\nAlso we shall not need Poisson's equation because that is taken care of by quasineutrality.\n4.6.3\nMaxwell's Equations for MHD Use\n.B = 0 ;\n-∂B ;\n.\n(4.106)\nr\nr ∧E = ∂t\nr ∧B = μoj\nThe MHD equations find their major use in studying macroscopic magnetic confinement\nproblems. In Fusion we want somehow to confine the plasma pressure away from the walls\nof the chamber, using the magnetic field. In studying such problems MHD is the major tool.\nOn the other hand if we focus on a small section of the plasma as we do when studying\nshortwavelength waves, other techniques: 2fluid or kinetic are needed. Also, plasma is\napprox. uniform.\n\n'Macroscopic' Phenomena MHD\n'Microscopic' Phenomena 2Fluid/Kinetic\n4.7\nMHD Equilibria\nStudy of how plasma can be 'held' by magnetic field. Equilibrium ⇒ V = ∂ = 0. So\n∂t\nequations reduce. Mass and Faraday's law are ∼ automatic. We are left with\n(M om m) →'Force Balance' 0 = j ∧B -rp\n(4.107)\nAmpere\nr ∧B = μoj\n(4.108)\nPlus r.B = 0, r.j = 0.\nNotice that provided we don't ask questions about Ohm's law. E doesn't come into MHD\nequilibrium.\nThese deceptively simple looking equations are the subject of much of Fusion research. The\nhard part is taking into account complicated geometries.\nWe can do some useful calculations on simple geometries.\n4.7.1\nθpinch\nFigure 4.5: θpinch configuration.\nSo called because plasma currents flow in θdirection.\nUse MHD Equations\nTake to be inf length, uniform in zdir.\nBy symmetry B has only z component.\nBy symmetry j has only θ comp.\nBy symmetry rp has only r comp.\n\nSo we only need\nForce\n(j ∧B)r - (rp)r = 0\n(4.109)\nAmpere\n(r ∧B)θ = (μoj)θ\n(4.110)\n∂\ni.e.\njθ Bz - ∂r p = 0\n(4.111)\n∂\n-∂r Bz = μojθ\n(4.112)\nEliminate j :\n- Bz\nμo\n∂Bz\n∂r - ∂p\n∂r = 0\n(4.113)\ni.e.\n∂\n∂r\nB2\nz\n2μo\n+ p\n!\n= 0\n(4.114)\nSolution\nB2\nz\n2μo\n+ p = const.\n(4.115)\nFigure 4.6: Balance of kinetic and magnetic pressure\nB2\nB2\nz\nz ext\n+ p =\n(4.116)\n2μo\n2μo\n[Recall Single Particle Problem]\nThink of these as a pressure equation. Equilibrium says total pressure = const.\nB2\nz\n+\np\n= const.\n(4.117)\n2μo\n|{z}\n|{z}\nkinetic pressure\nmagnetic pressure\n\nRatio of kinetic to magnetic pressure is plasma 'β'.\n2μop\nβ = B2\nz\n(4.118)\nmeasures 'efficiency' of plasma confinement by B. Want large β for fusion but limited by\ninstabilities, etc.\n4.7.2\nZpinch\nFigure 4.7: Zpinch configuration.\nso called because j flows in zdirection. Again take to be inf length and uniform.\nj = jz ez\nB = Bθ ˆ\nˆ\neθ\n(4.119)\n∂p\nForce\n(j ∧B)r -(rp)r = -jz Bθ -\n= 0\n(4.120)\n∂r\n1 ∂\nAmpere\n=\n(rBθ ) -μojz = 0\n(4.121)\n(r ∧B)z -(μoj)z\nr ∂r\nEliminate j:\nBθ ∂\n∂p\n(rBθ ) -\n= 0\n(4.122)\nμor ∂r\n∂r\nor\n\n!\nB2\n∂\nBθ\nθ\n+\n+\np = 0\n(4.123)\nμor\n∂r\n2μo\n|{z}\n|\n{z\n}\nExtra Term\nMagnetic+Kinetic pressure\nExtra term acts like a magnetic tension force. Arises because Bfield lines are curved.\n\nCan integrate equation\nZ b B2\n\"\n#b\ndr\nBθ\nθ\n+\n+ p(r)\n= 0\n(4.124)\na μo r\n2μo\na\nIf we choose b to be edge (p(b) = 0) and set a = r we get\nFigure 4.8: Radii of integration limits.\nBθ\n2 (b)\nBθ\n2 (r)\nZ b Bθ\n2 dr0\np(r) =\n+\n(4.125)\n2μo\n- 2μo\nr μo r0\nForce balance in zpinch is somewhat more complicated because of the tension force. We\ncan't choose p(r) and j(r) independently; they have to be self consistent.\nExample\nj = const.\nr\n∂\n∂r (rBθ) = μojz ⇒ Bθ = μojz\nr\n(4.126)\nHence\np(r) =\n2μo\nμojz\n{b2 - r 2 +\nZ b\nr 2r0dr0}\n(4.127)\n= μoj2\nz\n4 {b2 - r 2}\n(4.128)\nFigure 4.9: Parabolic Pressure Profile.\nAlso note Bθ(b) = μo jz b\nso\np = B2\nθb\n2μo\nb2 {b2 - r 2}\n(4.129)\n\n!\n4.7.3\n'Stabilized Zpinch'\nAlso called 'screw pinch', θ -z pinch or sometimes loosely just 'zpinch'.\nZpinch with some additional Bz as well as Bθ\n∂\n(Force)r\njθ Bz -jz Bθ -\n= 0\n(4.130)\n∂r\n∂\nAmpere :\nBz = μojθ\n(4.131)\n∂r\n1 ∂ (rbθ ) = μojz\n(4.132)\nr ∂r\nEliminate j:\nBz ∂Bz\nBθ ∂\n∂p\n(rBθ ) -\n= 0\n(4.133)\n- μo ∂r - μor ∂r\n∂r\nor\n\n!\nB2\n∂\nB2\nθ\n+\n+\np\n= 0\n(4.134)\nμor\n∂r\n2μo\n|{z}\n|\n{z\n}\nMag Tension\nMag (θ+z)+Kinetic pressure\nθ only\n4.8\nSome General Properties of MHD Equilibria\n4.8.1\nPressure & Tension\nj ∧B -rp = 0\n:\n(4.135)\nr ∧B = μoj\nWe can eliminate j in the general case to get\nrp.\n(4.136)\nμo\n(r ∧B) ∧B =\nExpand the vector triple product:\n(4.137)\nrp = μo\n(B.r) B -\nrB2\n2μo\nB\nput b = |B| so that rB = rBb = Brb + brB. Then\nrp = μo\n{B2 (b.r) b + Bb (b.r) B} - 2μo\nrB2\n(4.138)\nB2\n=\n(r -b (b.r)) B2\n(4.139)\nμo\n(b.r) b - 2μo\nB2\nB2\n= μo\n(b.r) b -r⊥\n2μp\n(4.140)\n\nNow r⊥\nB2\nis the perpendicular (to B) derivative of magnetic pressure and (b.r)b is the\n2μo\ncurvature of the magnetic field line giving tension.\n(b.r)b has value 1 . R: radius of curvature.\nR\n|\n|\n4.8.2\nMagnetic Surfaces\n0 = B. [j ∧B -rp] = -B.rp\n(4.141)\n*Pressure is constant on a field line (in MHD situation).\n(Similarly, 0 = j.[j ∧B -rp] = j.rp.)\nFigure 4.10: Contours of pressure.\nConsider some arbitrary volume in which rp = 0. That is, some plasma of whatever shape.\nDraw contours (surfaces in 3d) on which p = const. At any point on such an isoberic surface\nrp is perp to the surface. But B.rp = 0 implies that B is also perp to rp.\nFigure 4.11: B is perpendicular to rp and so lies in the isobaric surface.\nHence\nB lies in the surface p = const.\nIn equilibrium isobaric surfaces are 'magnetic surfaces'.\n[This argument does not work if p = const. i.e. rp = 0. Then there need be no magnetic\nsurfaces.]\n\nr\nr\n4.8.3\n'Current Surfaces'\nSince j.rp = 0 in equilibrium the same argument applies to current density. That is\nj lies in the surface p = const.\nIsobaric Surfaces are 'Current Surfaces'.\nMoreover it is clear that\n'Magnetic Surfaces' are 'Current Surfaces'.\n(since both coincide with isobaric surfaces.)\n[It is important to note that the existence of magnetic surfaces is guaranteed only in the\nMHD approximation when rp = 0 > Taking account of corrections to MHD we may not\nhave magnetic surfaces even if rp = 0.]\n4.8.4\nLow β equilibria: ForceFree Plasmas\nIn many cases the ratio of kinetic to magnetic pressure is small, β << 1 and we can approx\nimately ignore rp. Such an equilibrium is called 'force free'.\nj ∧B = 0\n(4.142)\nimplies j and B are parallel.\ni.e.\nj = μ(r)B\n(4.143)\nCurrent flows along field lines not across. Take divergence:\n=\n.j =\n. (μ (r) B) = μ (r) r.B + (B.r) μ\n(4.144)\n=\n(B.r) μ.\n(4.145)\nThe ratio j/B = μ is constant along field lines.\nμ is constant on a magnetic surface. If there are no surfaces, μ is constant everywhere.\nExample: ForceFree Cylindrical Equil.\nj ∧B =\n⇔\nj = μ(r)B\n(4.146)\n= μoj = μoμ(r)B\n(4.147)\nr ∧B\nThis is a somewhat more convenient form because it is linear in B (for specified μ(r)).\nConstantμ :\nr ∧B = μoμB\n(4.148)\nleads to a Bessel function solution\n\nBz = BoJo(μoμr)\n(4.149)\nBθ = BoJ1(μoμr)\n(4.150)\nfor μoμr > 1st zero of Jo the toroidal field reverses. There are plasma confinement schemes\nwith μ ' const. 'Reversed Field Pinch'.\n4.9\nToroidal Equilibrium\nBend a zpinch into a torus\nFigure 4.12: Toroidal zpinch\nBθ fields due to current are stronger at small R side ⇒ Pressure (Magnetic) Force outwards.\nHave to balance this by applying a vertical field Bv to push plasma back by jφ ∧ Bv .\nFigure 4.13: The field of a toroidal loop is not an MHD equilibrium. Need to add a vertical\nfield.\nBend a θpinch into a torus: Bφ is stronger at small R side\noutward force.\n⇒\nCannot be balanced by Bv because no jφ. No equilibrium for a toroidally symmetric θpinch.\nUnderlying Single Particle reason:\nToroidal θpinch has Bφ only. As we have seen before, curvature drifts are uncompensated\nin such a configuration and lead to rapid outward motion.\n\nZ\nFigure 4.14: Chargeseparation giving outward drift is equivalent to the lack of MHD toroidal\nforce balance.\nWe know how to solve this: Rotational Transform: get some Bθ . Easiest way: add jφ. From\nMHD viewpoint this allows you to push the plasma back by jφ ∧Bv force. Essentially, this\nis Tokamak.\n4.10\nPlasma Dynamics (MHD)\nWhen we want to analyze nonequilibrium situations we must retain the momentum terms.\nThis will give a dynamic problem. Before doing this, though, let us analyse some purely\nKinematic Effects.\n'Ideal MHD'\nSet eta = 0 in Ohm's Law.\n⇔\nA good approximation for high frequencies, i.e. times shorter than resistive decay time.\nE + V ∧B = 0.\nIdeal Ohm0s Law.\n(4.151)\nAlso\n-∂B\nFaraday0s Law.\n(4.152)\nr ∧E = ∂t\nTogether these two equations imply constraints on how the magnetic field can change with\ntime:\nEliminate E:\n∂B\n+ r ∧(V ∧B) = +\n(4.153)\n∂t\nThis shows that the changes in B are completely determined by the flow, V.\n4.11\nFlux Conservation\nConsider an arbitrary closed contour C and spawning surface S in the fluid.\nFlux linked by C is\nΦ =\nB.ds\n(4.154)\nS\nLet C and S move with fluid:\nTotal rate of change of Φ is given by two terms:\n\nZ\nI\nZ\nI\nFigure 4.15: Motion of contour with fluid gives convective flux derivative term.\n∂B\nΦ\n=\n.ds\n+\nB.(V ∧dl)\n(4.155)\n| C\nS\n|∂t {z\n}\n{z\n}\nDue to changes in B\nDue to motion of C\n=\n(V ∧B).dl\n(4.156)\nS r ∧E.ds -\n-\nI\nC\n=\n(E + V ∧B).dl = 0 by Ideal Ohm0s Law.\n(4.157)\n-\nC\nFlux through any surface moving with fluid is conserved.\n4.12\nField Line Motion\nThink of a field line as the intersection of two surfaces both tangential to the field everywhere:\nFigure 4.16: Field line defined by intersection of two flux surfaces tangential to field.\nLet surfaces move with fluid.\nSince all parts of surfaces had zero flux crossing at start, they also have zero after, (by flux\nconserv.).\nSurfaces are tangent after motion\n\nTheir intersection defines a field line after.\n⇒\nWe think of the new field line as the same line as the old one (only moved).\nThus:\n1. Number of field lines (≡ flux) through any surface is constant. (Flux Cons.)\n2. A line of fluid that starts as a field line remains one.\n4.13\nMHD Stability\nThe fact that one can find an MHD equilibrium (e.g. zpinch) does not guarantee a useful\nconfinement scheme because the equil. might be unstable. Ball on hill analogies:\nFigure 4.17: Potential energy curves\nAn equilibrium is unstable if the curvature of the 'Potential energy surface' is downward\nd2\naway from equil. That is if dx2 {Wpot} < 0.\nIn MHD the potential energy is Magnetic + Kinetic Pressure (usually mostly magnetic).\nIf we can find any type of perturbation which lowers the potential energy then the equil is\nunstable. It will not remain but will rapidly be lost.\nExample Zpinch\nWe know that there is an equilibrium: Is it stable?\nConsider a perturbation thus:\nFigure 4.18: 'Sausage' instability\nSimplify the picture by taking the current all to flow in a skin. We know that the pressure\nB2\nis supported by the combination of B2/2μo pressure and μor tension forces.\n\nFigure 4.19: Skincurrent, sharp boundary pinch.\nAt the place where it pinches in (A)\nBθ and 1 increase → Mag. pressure & tension increase ⇒ inward force no longer balance\nr\nby p ⇒ perturbation grows.\nAt place where it bulges out (B)\nBθ & 1 decrease → Pressure & tension ⇒ perturbation grows.\nr\nConclusion a small perturbation induces a force tending to increase itself. Unstable (≡ δW <\n0).\n4.14\nGeneral Perturbations of Cylindrical Equil.\nLook for things which go like exp[i(kz + mθ)]. [Fourier (Normal Mode) Analysis].\nFigure 4.20: Types of kink perturbation.\nGenerally Helical in form (like a screw thread). Example: m = 1 k = 0\nzpinch\n4.15\nGeneral Principles Governing Instabilities\n(1) They try not to bend field lines. (Because bending takes energy).\nPerturbation\n\nFigure 4.21: Driving force of a kink. Net force tends to increase perturbation. Unstable.\nFigure 4.22: Alignment of perturbation and field line minimizes bending energy.\n(Constant surfaces) lies along magnetic field.\nExample: θpinch type plasma column:\nFigure 4.23: 'Flute' or 'Interchange' modes.\nPreferred Perturbations are 'Flutes' as per Greek columns → 'Flute Instability.' [Better\nname: 'Interchange Instability', arises from idea that plasma and vacuum change places.]\n(2) Occur when a 'heavier' fluid is supported by a 'lighter' (Gravitational analogy).\nWhy does water fall out of an inverted glass? Air pressure could sustain it but does not\nbecause of RayleighTaylor instability.\nSimilar for supporting a plasma by mag field.\n(3) Occur when | B decreases away from the plasma region.\n|\n\nFigure 4.24: Inverted water glass analogy. Rayleigh Taylor instability.\nB\nA\nB\nB\n2μo\n2μo\nPerturbation Grows.\n⇒\n<\n(4.158)\n(4) Occur when field line curvature is towards the plasma (Equivalent to (3) because of\nr ∧B = 0 in a vacuum).\nFigure 4.25: Vertical upward field gradient is unstable.\n\nFigure 4.26: Examples of magnetic configurations with good and bad curvature.\n\nr |\n4.16\nQuick and Simple Analysis of Pinches\nθpinch\nB | = const. outside pinch\n|\n≡ No field line curvature.\nNeutral stability\nzpinch\nB | away from plasma outside\n≡ Bad Curvature (Towards plasma) ⇒ Instability.\nGenerally it is difficult to get the curvature to be good everywhere. Often it is sufficient\nto make it good on average on a field line. This is referred to as 'Average Minimum B'.\nTokamak has this.\nGeneral idea is that if field line is only in bad curvature over part of its length then to perturb\nin that region and not in the good region requires field line bending:\nFigure 4.27: Parallel localization of perturbation requires bending.\nBut bending is not preferred. So this may stabilize.\nPossible way to stabilize configuration with bad curvature: Shear\nShear of Field Lines\nFigure 4.28: Depiction of field shear.\nDirection of B changes. A perturbation along B at z3 is not along B at z2 or z1 so it would\nhave to bend field there → Stabilizing effect.\nGeneral Principle: Field line bending is stabilizing.\nExample: Stabilized zpinch\nPerturbations (e.g. sausage or kink) bend Bz so the tension in Bz acts as a restoring force\nto prevent instability. If wave length very long bending is less. ⇒ Least stable tends to be\nlongest wave length.\nExample: 'Cylindrical Tokamak'\n\nTokamak is in some ways like a periodic cylindrical stabilized pinch. Longest allowable wave\nlength = 1 turn round torus the long way, i.e.\nkR = 1 :\nλ = 2πR.\n(4.159)\nExpress this in terms of a toroidal mode number, n (s.t. perturbation ∝ exp i(nφ + mθ):\nφ = z\nn = kR.\nR\nMost unstable mode tends to be n = 1.\n[Careful! Tokamak has important toroidal effects and some modes can be localized in the\nbad curvature region (n = 1).\nFigure 4.29: Ballooning modes are localized in the outboard, bad curvature region."
    },
    {
      "category": "Resource",
      "title": "chap5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/22-611j-introduction-to-plasma-physics-i-fall-2006/0940abd0f5c16aa3972c8796c8ca52e2_chap5.pdf",
      "content": "Chapter 5\nElectromagnetic Waves in Plasmas\n5.1\nGeneral Treatment of Linear Waves in Anisotropic\nMedium\nStart with general approach to waves in a linear Medium: Maxwell:\n1 ∂E\n∂B\n;\n(5.1)\nr ∧B = μoj + c2 ∂t\nr ∧E = - ∂t\nwe keep all the medium's response explicit in j. Plasma is (infinite and) uniform so we Fourier\nanalyze in space and time. That is we seek a solution in which all variables go like\nexp i(k.x -ωt) [real part of]\n(5.2)\nIt is really the linearised equations which we treat this way; if there is some equilibrium field\nOK but the equations above mean implicitly the perturbations B, E, j, etc.\nFourier analyzed:\nik ∧B = μoj + -iω\nc2 E ;\nik ∧E = iωB\n(5.3)\nEliminate B by taking k∧ second eq. and ω× 1st\niω2\nik ∧(k ∧E) = ωμoj - c2 E\n(5.4)\nSo\nω2\nk ∧(k ∧E) +\nE + iωμoj = 0\n(5.5)\n2c\nNow, in order to get further we must have some relationship between j and E(k, ω). This\nwill have to come from solving the plasma equations but for now we can just write the most\ngeneral linear relationship j and E as\nj = σ.E\n(5.6)\n\n|{z}\nσ is the 'conductivity tensor'. Think of this equation as a matrix e.g.:\n⎛\n⎞\n⎛\n⎞⎛\n⎞\njx\nσxx σxy\n...\nEx\n⎜\n⎟\n⎜\n⎟⎜\n⎟\n⎝ jy ⎠ = ⎝ ...\n...\n... ⎠⎝ Ey ⎠\n(5.7)\njz\n...\n...\nσzz\nEz\nThis is a general form of Ohm's Law. Of course if the plasma (medium) is isotropic (same\nin all directions) all offdiagonal σ0s are zero and one gets j = σE.\nThus\nω2\nk(k.E) -k2E +\nE + iωμoσ.E = 0\n(5.8)\n2c\nRecall that in elementary E&M, dielectric media are discussed in terms of a dielectric con\nstant and a \"polarization\" of the medium, P, caused by modification of atoms. Then\noE =\nD\nP\nand\n.D =\nρext\n(5.9)\n|{z}\n-\n|{z}\nr\n|{z}\nDisplacement\nPolarization\nexternalcharge\nand one writes\nP =\nχ\noE\n(5.10)\nsusceptibility\nOur case is completely analogous, except we have chosen to express the response of the\nmedium in terms of current density, j, rather than \"polarization\" P For such a dielectric\nmedium, Ampere's law would be written:\n∂D\n∂\nr ∧B = jext +\n=\noE,\nif jext = 0 ,\n(5.11)\nμo\n∂t\n∂t\nwhere the dielectric constant would be = 1 + χ.\nThus, the explicit polarization current can be expressed in the form of an equivalent dielectric\nexpression if\n∂E\n∂E\n∂\nj + o\n= σ.E +\n=\no.E\n(5.12)\n∂t\n∂t\n∂t\nor\nσ\n= 1 +\n(5.13)\n-iωo\nNotice the dielectric constant is a tensor because of anisotropy. The last two terms come\nfrom the RHS of Ampere's law:\n∂\nj +\n(oE) .\n(5.14)\n∂t\nIf we were thinking in terms of a dielectric medium with no explicit currents, only implicit (in\n∂\n) we would write this ∂t (oE); the dielectric constant. Our medium is possibly anisotropic\n∂\nso we need ∂t (o.E) dielectric tensor. The obvious thing is therefore to define\niμoc2\n= 1 +\nσ = 1 +\nσ\n(5.15)\n-iωo\nω\n\n|\n{z\n}\n|\n{z\n}\n\n|\n}\n\nThen\nk(k.E) - k2E + ω2\nc2 .E = 0\n(5.16)\nand we may regard (k, ω) as the dielectric tensor.\nWrite the equation as a tensor multiplying E:\nD.E = 0\n(5.17)\nwith\nD = {kk - k21 + ω2\nc2 }\n(5.18)\nAgain this is a matrix equation i.e. 3 simultaneous homogeneous eqs. for E.\n⎞\n⎛\n⎞\n⎛ Dxx Dxy\n...\nEx\n⎜\n⎝\n⎜\n⎝\n⎟\n⎠\n⎟\n⎠= 0\n(5.19)\nD\nE\nyx\n...\n...\ny\n...\n...\nDzz\nEz\nIn order to have a nonzero E solution we must have\ndet D |= 0.\n(5.20)\n|\nThis will give us an equation relating k and ω, which tells us about the possible wavelengths\nand frequencies of waves in our plasma.\n5.1.1\nSimple Case. Isotropic Medium\nσ = σ 1\n(5.21)\n= 1\n(5.22)\nTake k in z direction then write out the Dispersion tensor D.\n⎞\n⎛\n⎞\n⎛\n⎞\n⎛\nω2\nk2\n\nc\n⎜\n⎜\n⎝\n⎟\n⎟\n⎠\n⎜\n⎝\n⎟\n⎠\n⎜\n⎝\n⎟\n⎠\nω2\nc\nk2\nD =\n+\n-\nk2\nω2\n0 kk\n{z\nc\nkk\nk21\nω2\nc\n⎤\n⎡\n-k2 + ω2\nc\n-k2 + ω2\n=\n⎢⎢⎣\n⎥⎥⎦\n(5.23)\n\nc\nω2\nc\nTake determinant:\n!2\nω2\nω2\n-k2 +\n\n2c\ndet\nD\n|\n=\n|\nc = 0.\n(5.24)\nTwo possible types of solution to this dispersion relation:\n\n!\n(A)\nω2\n- k2 +\n= 0.\n(5.25)\n2c\n⎞\n⎛\n⎞\n⎛ 0\nEx\n⎜\n⎝0\n⎜\n⎝\n⎟\n⎠\nE ⎟\n⎠= 0\nEz = 0.\n(5.26)\ny\n⇒\n⇒\nω2\nEz\nc\nElectric field is transverse (E.k = 0)\nPhase velocity of the wave is\nω\nc\n=\n(5.27)\nk\n√\nThis is just like a regular EM wave traveling in a medium with refractive index\nkc\nN ≡\n= √ .\n(5.28)\nω\n(B)\nω2\n= 0\ni.e. = 0\n(5.29)\n2c\n⎞\n⎛\n⎞\n⎛ Dxx\nEx\n⎜\n⎝\nD\nyy\n⎜\n⎝\n⎟\n⎠\nE ⎟\n⎠= 0\nEx = Ey = 0.\n(5.30)\ny\n⇒\n⇒\nEz\nElectric Field is Longitudinal (E ∧ k = 0)\nE k k.\nThis has no obvious counterpart in optics etc. because is not usually zero. In plasmas\n= 0 is a relevant solution. Plasmas can support longitudinal waves.\n5.1.2\nGeneral Case\n(k in zdirection)\n⎤\n⎡ -N 2 + xx\nxy\nxz\nω2\nk2c\n⎢⎣\n⎥⎦\n,\nN 2\n-N 2 +\nD =\n=\n(5.31)\nyx\nyy\nyz\nω2\nc\nzx\nzz\nzy\nWhen we take determinant we shall get a quadratic in N 2 (for given ω) provided is not\nexplicitly dependent on k. So for any ω there are two values of N 2 . Two 'modes'. The\npolarization E of these modes will be in general partly longitudinal and partly transverse.\nThe point: separation into distinct longitudinal and transverse modes is not possible in\nanisotropic media (e.g. plasma with Bo).\nAll we have said applies to general linear medium (crystal, glass, dielectric, plasma). Now\nwe have to get the correct expression for σ and hence by analysis of the plasma (fluid)\nequations.\n\n\"\n#\n\n!\n5.2\nHigh Frequency Plasma Conductivity\nWe want, now, to calculate the current for given (Fourier) electric field E(k, ω), to get the\nconductivity, σ. It won't be the same as the DC conductivity which we calculated before\n(for collisions) because the inertia of the species will be important. In fact, provided\nω ν ei\n(5.32)\nwe can ignore collisions altogether. Do this for simplicity, although this approach can be\ngeneralized.\nAlso, under many circumstances we can ignore the pressure force -rp. In general will\nbe true if ω vte,i We take the plasma equilibrium to be at rest: vo = 0. This gives a\nk\nmanageable problem with wide applicability.\nApproximations:\nCollisionless\nν ei = 0\n'Cold Plasma0\nrp = 0 (e.g. T ' 0)\n(5.33)\nStationary Equil vo = 0\n5.2.1\nZero Bfield case\nTo start with take Bo = 0: Plasma isotropic Momentum equation (for electrons first)\n∂v\nmn\n+ (v.r)v = nqE\n(5.34)\n∂t\nNotice the characteristic of the cold plasma approx. that we can cancel n from this equation\nand on linearizing get essentially the single particle equation.\n∂v1\nm\n= qE\n(Drop the 1 suffix now).\n(5.35)\n∂t\nThis can be solved for given ω as\nq\nv =\nE\n(5.36)\n-iωm\nand the current (due to this species, electrons) is\nnq\nj = nqv =\nE\n(5.37)\n-iωm\nSo the conductivity is\nnq\nσ = i\n(5.38)\nωm\nHence dielectric constant is\ni\nnq2\n= 1 +\nσ = 1 -\n= 1 + χ\n(5.39)\nωo\nmo\nω2\n\n!\n\n!\n\n!\n\n!\nLongitudinal Waves (Bo = 0)\nDispersion relation we know is\nnq\n= 0 = 1 -\n(5.40)\nmo\nω2\n[Strictly, the we want here is the total including both electron and ion contributions to\nthe conductivity. But\nσe\nσi\n' mi\nme\n(for z = 1)\n(5.41)\nso to a first approximation, ignore ion motions.]\nSolution\n\n!\nω2 =\nneq2\ne\n.\n(5.42)\no\nme\nIn this approx. longitudinal oscillations of the electron fluid have a single unique frequency:\nnee\nωp =\n(5.43)\n.\nmeo\nThis is called the 'Plasma Frequency' (more properly ωpe the 'electron' plasma frequency).\nIf we allow for ion motions we get an ion conductivity\niniq2\nσi =\ni\n(5.44)\nωmi\nand hence\ni\ntot = 1 + i (σe + σi) = 1 -\nneqe\n+ niq\n(5.45)\nωo\nome\nomi\nω2\n=\n1 - ω2 + ω2 /ω2\npe\npi\nwhere\nniq\nωpi ≡\ni\n(5.46)\nomi\nis the 'Ion Plasma Frequency'.\nSimple Derivation of Plasma Oscillations\nTake ions stationary; perturb a slab of plasma by shifting electrons a distance x. Charge\nbuilt up is neqx per unit area. Hence electric field generated\nE = - neqex\no\n(5.47)\n\n! 1\nFigure 5.1: Slab derivation of plasma oscillations\nEquation of motion of electrons\ndv\nneq2x\ne\nme\n= -\n;\n(5.48)\ndt\no\ni.e.\n\n!\nd2x\nneq\n+\ne\nx = 0\n(5.49)\ndt2\nome\nSimple harmonic oscillator with frequency\nneq\nωpe =\ne\nPlasma Frequency.\n(5.50)\nome\nThe Characteristic Frequency of Longitudinal Oscillations in a plasma. Notice\n1. ω = ωp for all k in this approx.\n2. Phase velocity ω can have any value.\nk\n3. Group velocity of wave, which is the velocity at which information/energy travel is\ndω\nvg =\n= 0 !!\n(5.51)\ndk\nIn a way, these oscillations can hardly be thought of as a 'proper' wave because they do\nnot transport energy or information. (In Cold Plasma Limit). [Nevertheless they do emerge\nfrom the wave analysis and with less restrictive approxs do have finite vg .]\nTransverse Waves (Bo = 0)\nDispersion relation:\nω2\n- k2 +\n= 0\n(5.52)\nc2\n\nor\n\nk2c\nN 2\n= = 1 - ω2 + ω2 /ω2\npe\npi\n≡\nω2\n1 - ω2\n(5.53)\n'\npe/ω2\nFigure 5.2: Unmagnetized plasma transverse wave.\nFigure 5.3: Alternative dispersion plot.\nAlternative expression:\nω2\nω2\n- k2 +\n= 0\n(5.54)\nc2 - c\np\n\nwhich implies\nω2\n2 2\n= ω2 + k c\n(5.55)\np\n2 2\nω =\nω2 + k c\n.\n(5.56)\np\n5.2.2\nMeaning of Negative N 2: Cut Off\nWhen N 2 < 0 (for ω < ωp) this means N is pure imaginary and hence so is k for real ω.\nThus the wave we have found goes like\nexp{± k\nx - iωt\n(5.57)\n|\n|\n}\ni.e. its space dependence is exponential not oscillatory. Such a wave is said to be 'Evanescent'\nor 'Cut Off'. It does not truly propagate through the medium but just damps exponentially.\nExample:\nFigure 5.4: Wave behaviour at cutoff.\nA wave incident on a plasma with ωp\n2 > ω2 is simply reflected, no energy is transmitted\nthrough the plasma.\n5.3\nCold Plasma Waves\n(Magnetized Plasma)\nObjective: calculate ,D, k(ω), using known plasma equations.\nApproximation: Ignore thermal motion of particles.\nApplicability: Most situations where (1) plasma pressure and (2) absorption are negligible.\nGenerally requires wave phase velocity vthermal.\n\nX\nX\n5.3.1\nDerivation of Dispersion Relation\nCan \"derive\" the cold plasma approx from fluid plasma equations. Simpler just to say that\nall particles (of a specific species) just move together obeying Newton's 2nd law:\n∂v\nm\n= q(E + v ∧B)\n(5.58)\n∂t\nTake the background plasma to have E0 = 0, B = B0 and zero velocity. Then all motion\nis due to the wave and also the wave's magnetic field can be ignored provided the particle\nspeed stays small. (This is a linearization).\n∂v\nm\n= q(E + v ∧B0),\n(5.59)\n∂t\nwhere v, E ∝exp i(k.x -ωt) are wave quantities.\nSubstitute ∂ →-iω and write out equations. Choose axes such that B0 = B0(0, 0, 1).\n∂t\n-iωmvx = q(Ex + vy B0)\n-iωmvy = q(Ey -vxB0)\n(5.60)\n-iωmvz = qEz\nSolve for v in terms of E.\niωEx -ΩEy\nω2\nq\nvx = m\nq\n-Ω2\nΩEx + iωEy\n(5.61)\nvy = m\nω2 -Ω2\nq i Ez\nvz = m ω\nwhere Ω = qB0 is the gyrofrequency but its sign is that of the charge on the particle species\nm\nunder consideration.\nSince the current is j = qvn = σ.E we can identify the conductivity tensor for the species\n(j) as:\n⎡\n⎤\nqj nj\niω\nmj ω2 -Ω2\nmj ω2-Ω2\nj\n-\nqj nj\nΩj\nj\nnj\nΩj\nnj\nqj\nqj\niω\n⎢⎢⎢⎢⎣\n⎥⎥⎥⎥⎦\nσj =\n(5.62)\nmj ω2 -Ω2\nmj ω2-Ω2\nj\nj\niqj\n2 nj\nm ω\nThe total conductivity, due to all species, is the sum of the conductivities for each\nσ =\nσj\n(5.63)\nj\nSo\nq1 nj\niω\nσxx = σyy =\nj\nmj ω2 -Ωj\n(5.64)\n\nX\nX\n=\nX\nX\nX\nX\nX\nyx = -\nqj nj\nΩj\nj\nmj ω2 - Ωj\n(5.65)\nσxy = -σ\nqj nj i\nσzz =\n(5.66)\nmj ω\nj\nSusceptibility χ = -iωo σ.\n⎤\n⎡\n⎤\n⎡ xx xy\nS\n-iD 0\nS\n⎢⎣\n⎥⎦\n⎢⎣\n⎥⎦\n\niD\n(5.67)\n=\nyx\nyy\nzz\nP\nwhere\nω2\npj\nj ω2 - Ωj\nxx = yy = S = 1 -\n(5.68)\nΩj\nω2\npj\nω ω2 - Ω2\nj\nj\nixy = -iyx = D =\n(5.69)\nω2\npj\nzz = P = 1 -\n(5.70)\nω2\nj\nand\nω2\npj ≡ q2\nj nj\nomj\n(5.71)\nis the \"plasma frequency\" for that species.\nS & D stand for \"Sum\" and \"Difference\":\nS = 2 (R + L)\nD = 2 (R - L)\n(5.72)\nwhere R & L stand for \"Righthand\" and \"Lefthand\" and are:\nω2\nω2\npj\n,\nL = 1 -\npj\n(5.73)\nR = 1 -\nω (ω + Ωj )\nj ω (ω - Ωj )\nj\nThe R & L terms arise in a derivation based on expressing the field in terms of rotating\npolarizations (right & left) rather than the direct Cartesian approach.\nWe now have the dielectric tensor from which to obtain the dispersion relation and solve\nit to get k(ω) and the polarization. Notice, first, that is indeed independent of k so the\ndispersion relation (for given ω) is a quadratic in N 2 (or k2).\nChoose convenient axes such that ky = Ny = 0. Let θ be angle between k and B0 so that\nNz = N cos θ ,\nNx = N sin θ .\n(5.74)\nThen\n⎤\n⎡ -N 2 cos2 θ + S\n-iD\nN 2 sin θ cos θ\n+iD\n-N 2 + S\nD = ⎢⎣\n⎥⎦\n(5.75)\nN 2 sin θ cos θ\n-N 2 sin2 θ + P\n\nand\n= AN 4 -BN 2 + C\n(5.76)\nk D k\nwhere\nA ≡ S sin2 θ + P cos 2 θ\n(5.77)\nB ≡ RL sin2 θ + P S(1 + cos 2 θ)\n(5.78)\nC\nP RL\n(5.79)\n≡\nSolutions are\nN 2 = B ± F ,\n(5.80)\n2A\nwhere the discriminant, F , is given by\nF 2 = (RL -P S)2 sin4 θ + 4P 2D2 cos 2 θ\n(5.81)\nafter some algebra. This is often, for historical reasons, written in the equivalent form (called\nthe AppletonHartree dispersion relation)\nN 2 = 1 -2(A -B + C)\n(5.82)\n2A -B ± F\nThe quantity F 2 is generally +ve, so N 2 is real ⇒\"propagating\" or \"evanescent\" no wave\nabsorption for cold plasma.\nSolution can also be written\ntan 2 θ =\nP (N 2 -R) (N 2 -L)\n(5.83)\n-(SN 2 -RL) (N 2 -P )\nThis compact form makes it easy to identify the dispersion relation at θ = 0 & π i.e. parallel\nand perpendicular propagation tan θ = 0, inf.\nParallel:\nP = 0 ,\nN 2 = R\nN 2 = L\nRL\nPerp:\nN 2 = S\nN 2 = P .\nExample: Righthand wave\nN 2 = R. (Single Ion Species).\nω2\nω2\npe\npi\n(5.84)\nN 2 = 1 -ω (ω -Ωe ) -ω (ω + Ωi )\n|\n|\n|\n|\nThis has a wave resonance N 2\nΩe|, only. Righthand wave also has a cutoff at\n→infat ω = |\nR = 0, whose solution proves to be\n⎡\n!2\n⎤1/2\nΩe| + Ωi\nω = ωR = |Ωe| -|Ωi| + ⎣ |\n|\n|\n+ ω2 + ω2 ⎦\n(5.85)\npe\npi\n\n!\n\nv\nu\nu\nt\n\nSince mi me this can be approximated as:\n⎧\n⎨\nω2\npe\n⎫\n⎬\n|Ωe|\nωR '\n1 + 1 + 4\n(5.86)\n⎩\n|Ωe|2\n⎭\nThis is always above |Ωe .|\nFigure 5.5: The form of the dispersion relation for RH wave.\nOne can similarly investigate LH wave and perp propagating waves. The resulting wave\nresonances and cutoffs depend only upon 2 properties (for specified ion mass) (1) Density\nω2\nmi\n↔\npe (2) Magnetic Field ↔ Ωe . [Ion values ωpi,\nare got by me factors.]\n|\n|\n|Ωi|\np\nΩe\nThese resonances and cutoffs are often plotted on a 2D plane |\nω\n| ,\nω (∝ B, n) called the\nω2\nC M A Diagram.\nWe don't have time for it here.\n5.3.2\nHybrid Resonances\nPerpendicular Propagation\nRL\n\"Extraordinary\" wave\nN 2 = S\n(ω + Ωe) (ω + Ωi) -\npe\nω\nω (ω + Ωi) -\npi\nω\nω\npe\nω\nω\n(ω + Ωe)\n(ω - Ωe) (ω - Ωi) -\n(ω - Ωi) ...\nN 2 =\ne ) (ω2 - Ωi\n2) - ω2\npi (ω2 - Ω2\n(ω2 - Ω2\npe (ω2 - Ωi\n2) - ω2\ne )\n(5.87)\nResonance is where denominator = 0. Solve the quadratic in ω2 and one gets\nω2 + Ω2 + ω2\ni\npi + Ω2\npe\ne\nω2 + Ω2\npi - Ωi\npe\ne - ω2\n!2\nω2 =\n±\n+ ω2 ω2\npe\npi\n(5.88)\n\nω2\nme\nNeglecting terms of order mi (e.g.\npi ) one gets solutions\nω2\npe\nω2\nU H = ω2\npe + Ω2\ne\nUpper Hybrid Resonance.\n(5.89)\nω2\nLH =\nΩ2\ne ω2\npi\nΩ2\ne + ω2\npe\nLower Hybrid Resonance..\n(5.90)\nAt very high density, ω2\npe Ω2\ne\nω2\nLH ' |Ωe||Ωi|\n(5.91)\ngeometric mean of cyclotron frequencies.\nAt very low density, ω2\npe Ω2\ne\nω2\nLH ' ω2\npi\n(5.92)\nion plasma frequency\nUsually in tokamaks ω2\npe ∼ Ω2\ne . Intermediate.\nSummary Graph (Ω > ωp)\nFigure 5.6: Summary of magnetized dispersion relation\nCutoffs are where N 2 = 0.\nResonances are where N 2 → inf.\nIntermediate angles of propagation have refractive indices between the θ = 0, π lines, in the\nshaded areas.\n\n!\n\"\n\n#\n\n5.3.3\nWhistlers\n(Ref. R.A. Helliwell, \"Whistlers & Related Ionospheric Phenomena,\" Stanford UP 1965.)\nFor N 2 1 the right hand wave can be written\nN 2\n-ω2\n,\n(N = kc/ω)\n(5.93)\n' ω (ω -\npe\nΩe )\n|\n|\nGroup velocity is\n-1\n-1\ndω\ndk\nd\nN ω\nvg =\n=\n=\n.\n(5.94)\ndk\ndω\ndω\nc\nThen since\nωp\nN\n(5.95)\n=\n,\nω (|Ωe - ω)\n|\nwe have\nThus\n⎧\n⎨\n⎫\n⎬\n1 ω\nd\nd\nωpω\n(N ω)\n= ω\n+\n=\np\n⎩\n⎭\ndω\ndω ( Ωe - ω)\n|\n|\np/2\nω (|Ωe - ω)\n|\n(|Ωe - ω)\n|\nω\nΩe - ω) + ω}\n{(|\n|\n=\n(|Ωe - ω)\n|\nω\nω\nΩe /2\n|\n|\np\n(5.96)\n=\n( Ωe - ω) ω\n|\n|\nc 2 (|Ωe - ω)\n|\nω\n(5.97)\nvg =\nω |Ωe|\np\nGroup Delay is\nL\n(5.98)\ng\n∝\nω\n∝\nv\n(|Ωe - ω)\n|\nω\nΩe\nω\nΩe\n1 -\n|\n|\n|\n|\nFigure 5.7: Whistler delay plot\n\n+ r\n+ r\nPlot with L as xaxis.\nvg\nResulting form explains downward whistle.\nLightning strike ∼δfunction excites all frequencies.\nLower ones arrive later.\nExamples of actual whistler sounds can be obtained from http://wwwistp.gsfc.nasa.\ngov/istp/polar/polar_pwi_sounds.html.\n5.4\nThermal Effects on Plasma Waves\nThe cold plasma approx is only good for high frequency, N 2 ∼1 waves. If ω is low or N 2 1\none may have to consider thermal effects. From the fluid viewpoint, this means pressure.\nWrite down the momentum equation. (We shall go back to B0 = 0) linearized\n∂v1\nmn\n= nqE1 -rp1 ;\n(5.99)\n∂t\nremember these are the perturbations:\np = p0 + p1\n.\n(5.100)\nFourier Analyse (drop 1's)\nmn(-iω)v = nqE -ikp\n(5.101)\nThe key question: how to relate p to v\nAnswer: Equation of state + Continuity\nState\npn-γ = const. ⇒(p0 + p1) (n0 + n1)-γ = p0n-γ\n(5.102)\nUse Taylor Expansion\n\"\n#\n(p0 + p1) (n0 + n1)-γ ' p0n-γ\n1 + p1\np0\n-γ n1\nn0\n(5.103)\nHence\np1\nn1\n= γ\n(5.104)\np0\nn0\nContinuity\n∂n\n. (nv) = 0\n(5.105)\n∂t\nLinearise:\n∂n1\n∂n\n. (n0v1) = 0\n.v = 0\n(5.106)\n∂t\n⇒\n∂t + n0r\nFourier Transform\n-iωn1 + n0ik.v1 = 0\n(5.107)\n\n\"\n#!\ni.e.\nk.v\nn1 = n0\n(5.108)\nω\nCombine State & Continuity\nk.v\np1 = p0γ n1\nn0\n= p0γ n0 ω\nno\n= p0γ k.v\nω\n(5.109)\nHence Momentum becomes\nmn (-iω) v = nqE - ikp0γ\nω k.v\n(5.110)\nNotice Transverse waves have k.v = 0; so they are unaffected by pressure.\nTherefore we need only consider the longitudinal wave. However, for consistency let us\nproceed as before to get the dielectric tensor etc.\nChoose axes such that k = kˆ ez then obviously:\niq\niq\nvx =\nEx\nvy =\nEy\n(5.111)\nωm\nωm\nq\nEz\nvz = m -iω + (ik2γp0/mnω)\n(5.112)\nHence\n⎤\n⎡ 1\ninq2 ⎢⎢⎣\n⎥⎥⎦\nσ\n(5.113)\n= ωm\nk\n2p0γ\n1- mnω2\nω2\np\n⎡\n⎤\n1 -\nω2\n⎢⎢⎢⎣\n⎥⎥⎥⎦\niσ\n0ω\nω2\np\nω2\n1 -\n= 1 +\n(5.114)\n=\nwp\n1 - ω2-k2 p0γ\nmn\n(Taking account only of 1 species, electrons, for now.)\nWe have confirmed the previous comment that the transverse waves (Ex, Ey ) are unaffected.\nThe longitudinal wave is. Notice that now depends on k as well as ω. This is called 'spatial\ndispersion'.\nFor completeness, note that the dielectric tensor can be expressed in general tensor notation\nas\nω2\n=\np\n1 + kk\nk2 p0 γ - 1\n1 - ω2\n1 -\nω\nmn⎞\n⎛\nω2\np ⎝1 + kk\n1 - ω2\n⎠\n(5.115)\n=\nw mn\np0\nThis form shows isotropy with respect to the medium: there is no preferred direction in\nspace for the wave vector k.\nγ - 1\nk2\n\n!\n\n!\nBut once k is chosen, is not isotropic. The direction of k becomes a special direction.\nLongitudinal Waves: dispersion relation is\nzz = 0\n(as before)\n(5.116)\nwhich is\nω2\n1 -\n-\np\nk2p0γ = 0 .\n(5.117)\nω2\nmn\nor\nω2 = ω2 + k2 p0γ\n(5.118)\np\nmn\nRecall p0 = n0T = nT ; so this is usually written:\nγT\nω2 = ω2 + k2\n= ω2 + k2γv 2\n(5.119)\np\np\nt\nm\n[The appropriate value of γ to take is 1 dimensional adiabatic i.e. γ = 3. This seems plausible\nsince the electron motion is 1d (along k) and may be demonstrated more rigorously by kinetic\ntheory.]\nThe above dispersion relation is called the BohmGross formula for electron plasma waves.\nNotice the group velocity:\ndω\n1 dω2\nγkvt\nvg =\n=\n=\n1 = 0.\n(5.120)\ndk\n2ω dk\nω2 + γk2vt\np\nand for kvt > ωp this tends to γ 2 vt. In this limit energy travels at the electron thermal\nspeed.\n5.4.1\nRefractive Index Plot\nBohm Gross electron plasma waves:\nω2\np\nN 2 = c\n1 - ω2\n(5.121)\nγevte\nTransverse electromagnetic waves:\nω2\np\nN 2 =\n1 - ω2\n(5.122)\nThese have just the same shape except the electron plasma waves have much larger vertical\nscale:\nOn the EM wave scale, the plasma wave curve is nearly vertical. In the cold plasma it was\nexactly vertical.\nWe have relaxed the Cold Plasma approximation.\n\nFigure 5.8: Refractive Index Plot. Top plot on the scale of the BohmGross Plasma waves.\nBottom plot, on the scale of the EM transverse waves\n5.4.2\nIncluding the ion response\nAs an example of the different things which can occur when ions are allowed to move include\nlongitudinal ion response:\nω2\nω2\npi\n0 = zz = 1 -\npe\n(5.123)\nmene\nmini\nω2 - k2peγe -\nω2 - k2piγi\nThis is now a quadratic equation for ω2 so there are two solutions possible for a given ω. One\nwill be in the vicinity of the electron plasma wave solution and the inclusion of ω2\npi which is\npe will give a small correction.\nSecond solution will be where the third term is same magnitude as second (both will be\n1). This will be at low frequency. So we may write the dispersion relation approximately\nas:\nω2\nω2\nω2\npi\npi\n= 0\n(5.124)\n-\n- k2peγe -\nω2\nmene\nmini\n- k2piγi\ni.e.\nk2piγi\nω2\nω2\npi k2peγe\n=\n+\nmini\nω2 mene\npe\n\n= k2\nγipi\nγepe\n+\nni\nne\nmi\n= k2 γiTi + γeTe\n(5.125)\nmi\n[In this case the electrons have time to stream through the wave in 1 oscillation so they\ntend to be isothermal: i.e. γe = 1. What to take for γi is less clear, and less important\nbecause kinetic theory shows that these waves we have just found are strongly damped\nunless Ti Te.]\nThese are 'ionacoustic' or 'ionsound' waves\nω2\n= c\n(5.126)\ns\nk2\ncs is the sound speed\nγiTi + Te\nTe\nc =\n(5.127)\ns\nmi\n' mi\nApproximately nondispersive waves with phase velocity cs.\n5.5\nElectrostatic Approximation for (Plasma) Waves\nThe dispersion relation is written generally as\nN ∧ (N ∧ E) + .E = N(N.E) - N 2E + .E = 0\n(5.128)\nConsider E to be expressible as longitudinal and transverse components E`, Et such that\nN ∧ E` = 0, N.Et = 0. Then the dispersion relation can be written\nN (N.E`) - N 2 (E` + Et) + . (E` + Et) = -N 2Et + .Et + .E` = 0\n(5.129)\nor\n\nN 2 - .Et = .E`\n(5.130)\nNow the electric field can always be written as the sum of a curlfree component plus a\ndivergenceless component, e.g. conventionally\nE =\n{z\n+\n| {z }\n(5.131)\nA\n| -rφ }\n\nCurl-f ree\nDivergence-f ree\nElectrostatic\nElectromagnetic\nand these may be termed electrostatic and electromagnetic parts of the field.\nFor a plane wave, these two parts are clearly the same as the longitudinal and transverse\nparts because\n-ikφ is longitudinal\n(5.132)\n- rφ =\n\nand if r.A = 0 (because r.A = 0 (w.l.o.g.)) then k.A = 0 so A is transverse.\n\n'Electrostatic' waves are those that are describable by the electrostatic part of the electric\nfield, which is the longitudinal part: |E`| |Et|.\nIf we simply say Et = 0 then the dispersion relation becomes .E` = 0. This is not the most\ngeneral dispersion relation for electrostatic waves. It is too restrictive. In general, there is\na more significant way in which to get solutions where |E`| |Et|. It is for N 2 to be very\nlarge compared to all the components of : N 2 k k.\nIf this is the case, then the dispersion relation is approximately\nN 2Et = .E` ;\n(5.133)\nEt is small but not zero.\nWe can then annihilate the Et term by taking the N component of this equation; leaving\nN..E` = (N..N) E` = 0\n:\nk..k = 0 .\n(5.134)\nWhen the medium is isotropic there is no relevant difference between the electrostatic dis\npersion relation:\nN..N = 0\n(5.135)\nand the purely longitudinal case .N = 0. If we choose axes such that N is along ˆz, then the\nmedium's isotropy ensures the offdiagonal components of are zero so N..N = 0 requires\nzz = 0 ⇒ .N = 0. However if the medium is not isotropic, then even if\nN..N = N 2zz = 0\n(5.136)\nthere may be offdiagonal terms of that make\n.N = 0\n(5.137)\nIn other words, in an anisotropic medium (for example a magnetized plasma) the electrostatic\napproximation can give waves that have nonzero transverse electric field (of order ||||/N 2\ntimes E`) even though the waves are describable in terms of a scalar potential.\nTo approach this more directly, from Maxwell's equations, applied to a dielectric medium\nof dielectric tensor , the electrostatic part of the electric field is derived from the electric\ndisplacement\nr.D = r. (0.E) = ρ = 0 (no free charges)\n(5.138)\nSo for plane waves 0 = k.D = k..E = ik..kφ.\nThe electric displacement, D, is purely transverse (not zero) but the electric field, E then\ngives rise to an electromagnetic field via r ∧ H = ∂D/∂t. If N 2 k k then this magnetic\n(inductive) component can be considered as a benign passive coupling to the electrostatic\nwave.\nIn summary, the electrostatic dispersion relation is k..k = 0, or in coordinates where k is\nin the zdirection, zz = 0.\n\nh\ni\n\nk\n\n5.6\nSimple Example of MHD Dynamics: Alfven Waves\nIgnore Pressure & Resistance.\nDV\nρ Dt = j ∧ B\n(5.139)\nE + V ∧ B = 0\n(5.140)\nLinearize:\nV = V1,\nB = B0 + B1 (B0 uniform),\nj = j1.\n(5.141)\n∂V\nρ ∂t = j ∧ B0\n(5.142)\nE + V ∧ B0 = 0\n(5.143)\nFourier Transform:\nρ(-iω)V = j ∧ B0\n(5.144)\nE + V ∧ B0 = 0\n(5.145)\nEliminate V by taking 5.144 ∧B0 and substituting from 5.145.\nE + -iωρ (j ∧ B0) ∧ B0 = 0\n(5.146)\nor\nB0\nE =\n(5.147)\n--iωρ{(j.B0) B0 - B0\n2j} = -iωρj⊥\nSo conductivity tensor can be written (z in B direction).\n⎤\n⎡ 1\n-iωρ ⎢⎣\n⎥⎦\nσ =\n(5.148)\nB2\n0 inf\nwhere inf implies that Ek = 0 (because of Ohm's law). Hence Dielectric Tensor\n⎤\n⎡ 1\n⎢⎣\nσ\nρ\n⎥⎦\n= 1 +\n=\n1 +\n(5.149)\n.\n-iω0\n0B2\n0 inf\nDispersion tensor in general is:\nω2\nNN - N 2\nD =\n+\n(5.150)\n2c\nDispersion Relation taking N\n= Nx, Ny = 0\n⊥\n⎡\n⎤\nρ\n-N 2 + 1 +\nN⊥N\n0B2\nk\nρ\n-Nk\n2 - N 2 + 1 + 0B2\n⊥\n⎢⎣\n⎥⎦= 0\n(5.151)\nD\n|\n=\n|\nN⊥Nk\ninf\n\nk\nk\nk\nFigure 5.9: Compressional Alfven Wave. Works by magnetic pressure (primarily).\nMeaning of inf is that the cofactor must be zero i.e.\nρ\nρ\n-N 2 + 1 +\n-N 2 + 1 +\n= 0\n(5.152)\nk\n0B2\n0B2\nThe 1's here come from Maxwell displacement current and are usually negligible (N 2\n⊥ 1).\nSo final waves are\nρ\n1. N 2 =\n⇒ Nondispersive wave with phase and group velocities\n0B2\n\n! 1\n\"\n# 1\nc\nc20B2\nB2\nvp = vg =\n=\n=\n(5.153)\nN\nρ\nμ0ρ\nwhere we call\n\"\n# 1\nB2\nthe 'Alfven Speed'\n(5.154)\nμ0ρ\n≡ vA\nPolarization:\nE = Ez = 0,\nEx = 0.\nEy = 0\n⇒ Vy = 0 Vx = 0 (Vz = 0)\n(5.155)\nParty longitudinal (velocity) wave → Compression \"Compressional Alfven Wave\".\nk2c\nρ\n2.\nN 2 = 0B2 = ω2\nAny ω has unique kk. Wave has unique velocity in k direction: vA.\nPolarization\nEz = Ey = 0 Ex = 0\n⇒ Vx = 0 Vy = 0 (Vz = 0)\n(5.156)\nTransverse velocity: \"Shear Alfven Wave\".\nWorks by field line bending (Tension Force) (no compression).\n\nFigure 5.10: Shear Alfven Wave\n5.7\nNonUniform Plasmas and wave propagation\nPractical plasmas are not infinite & homogeneous. So how does all this plane wave analysis\napply practically?\nIf the spatial variation of the plasma is slow c.f. the wave length of the wave, then coupling\nto other waves will be small (negligible).\nFigure 5.11: Comparison of sudden and gradualy refractive index change.\nFor a given ω, slowly varying plasma means N/dN λ or kN/dN 1. Locally, the plasma\ndx\ndx\nappears uniform.\nEven if the coupling is small, so that locally the wave propagates as if in an infinite uniform\nplasma, we still need a way of calculating how the solution propagates from one place to\nthe other. This is handled by the 'WKB(J)' or 'eikonal' or 'ray optic' or 'geometric optics'\napproximation.\nWKBJ solution\nConsider the model 1d wave equation (for field ω)\nd2E\ndx2 + k2E = 0\n(5.157)\nwith k now a slowly varying function of x. Seek a solution in the form\nE = exp (iφ (x))\n(-iωt implied)\n(5.158)\n\n!\nZ\n\nφ is the wave phase (= kx in uniform plasma).\nDifferentiate twice\n\n!2\nd2E\nd2φ\ndφ\niφ\n=\ne\n(5.159)\ndx2\n{idx2 - dx\n}\nSubstitute into differential equation to obtain\n\n!2\ndφ\nd2φ\n= k2 + i\n(5.160)\ndx\ndx2\nRecognize that in uniform plasma d2φ = 0. So in slightly nonuniform, 1st approx is to\ndx2\nignore this term.\ndφ\n(5.161)\ndx ' ±k(x)\nThen obtain a second approximation by substituting\nd2φ\ndk\n(5.162)\ndx2 ' ± dx\nso\n\n!2\ndφ\ndk\nk2 ± i\n(5.163)\ndx\n'\ndx\ndφ\ni dk\nusing Taylor expansion.\n(5.164)\nk ±\ndx ' ±\n2k dx\nIntegrate:\nx\nkdx + i ln k\nφ ' ±\n(5.165)\nHence E is\n\nZ\n\nx\niφ\nE\nkdx\n(5.166)\n±i\n= e =\n2 exp\nk\nThis is classic WKBJ solution. Originally studied by Green & Liouville (1837), the Green\nof Green's functions, the Liouville of Sturm Liouville theory.\nBasic idea of this approach: (1) solve the local dispersion relation as if in infinite homogeneous\nplasma, to get k(x), (2) form approximate solution for all space as above.\nPhase of wave varies as integral of kdx.\nIn addition, amplitude varies as\n. This is required to make the total energy flow uniform.\nk\nTwo Stream Instability\nAn example of waves becoming unstable in a nonequilibrium plasma. Analysis is possible\nusing Cold Plasma techniques.\nConsider a plasma with two participating cold species but having different average velocities.\n5.8\n\nThese are two \"streams\".\nSpecies1\nSpecies2\n. →\n.\n(5.167)\nM oving. Stationary.\nSpeed v\nWe can look at them in different inertial frames, e.g. species (stream) 2 stationary or 1\nstationary (or neither).\nWe analyse by obtaining the susceptibility for each species and adding together to get total\ndielectric constant (scalar 1d if unmagnetized).\nIn a frame of reference in which it is stationary, a stream j has the (Cold Plasma) suscepti\nbility\n-ω2\nχj = ω2\npj\n.\n(5.168)\nIf the stream is moving with velocity vj (zero order) then its susceptibility is\n-ω2\nχj =\npj\n. (k & vj in same direction)\n(5.169)\n(ω - kvj )\nProof from equation of motion:\nqj\n∂ v\nE =\n+ v.r\nv = -i (ω - kvj )\nv = (-iω + ik.vj )\nv .\n(5.170)\nmj\n∂t\nCurrent density\nj = ρj vj + ρj .\nρvj .\n(5.171)\nv +\nSubstitute in\n∂ρ\nr.j +\n= ik.\nvρ - iωρ = 0\n(5.172)\nvρj + ik.\n∂t\nk. v\nρ j = ρj\n(5.173)\nω - k.vj\nHence substituting for v in terms of E:\nk.E\n- χj 0r.E = ρ j = ρj qj\n2 ,\n(5.174)\nmj -i (ω - k.vj )\nwhich shows the longitudinal susceptibility is\npj\nχj =\nρj qj\n=\n-ω2\n(5.175)\n- mj 0 (ω2 - kvj )\n(ω - kvj )2\nProof by transforming frame of reference:\nConsider Galileean transformation to a frame moving with the stream at velocity vj .\nx = x0 + vj t ;\nt0 = t\n(5.176)\n\nexp i (k.x - ωt) = exp i (k.x0 - (ω - k.vj ) t0)\n(5.177)\nSo in frame of the stream, ω0 = ω - k.vj .\nSubstitute in stationary cold plasma expression:\nω2\nω2\npj\n2 .\n(5.178)\n- ω0\nχj =\npj = - (ω - kvj )\nThus for n streams we have\nX\nX\nω2\npj\n= 1 +\nχj = 1 -\n(ω - kvj )2 .\n(5.179)\nj\nj\nLongitudinal wave dispersion relation is\n= 0.\n(5.180)\nTwo streams\nω2\nω2\np1\nP 2\n(5.181)\n0 = = 1 - (ω - kv1)2 - (ω - kv2)\nFor given real k this is a quartic in ω. It has the form:\nFigure 5.12: Twostream stability analysis.\nIf crosses zero between the wells, then ∃ 4 real solutions for ω. (Case B).\nIf not, then 2 of the solutions are complex: ω = ωr ± iωi (Case A).\nThe time dependence of these complex roots is\nexp (-iωt) = exp (-iωr t ± ωit) .\n(5.182)\n\nThe +ve sign is growing in time: instability.\nIt is straightforward to show that Case A occurs if\n| k(v2 - v1) < ωp1 + ω\n|\np2\n.\n(5.183)\nSmall enough k (long enough wavelength) is always unstable.\nSimple interpretation (ω2\np1, v1 = 0) a tenuous beam in a plasma sees a negative if\np2 ω2\nkv2 <\np1.\n|\n| ∼ ω\nNegative implies charge perturbation causes E that enhances itself: charge (spontaneous)\nbunching.\n5.9\nKinetic Theory of Plasma Waves\nWave damping is due to waveparticle resonance. To treat this we need to keep track of the\nparticle distribution in velocity space → kinetic theory.\n5.9.1\nVlasov Equation\nTreat particles as moving in 6D phase space x position, v velocity. At any instant a particle\noccupies a unique position in phase space (x, v).\nConsider an elemental volume d3xd3v of phase space [dxdydzdvxdvy dvz ], at (x, v). Write\ndown an equation that is conservation of particles for this volume\n∂\n- ∂t f d3 xd3 v\n=\n[vxf (x + dxˆx, v) - vxf (x, v)] dydzd3 v\n+ same for dy, dz\n+\n[axf (x, v + dvx ˆx) - axf (x, v)] d3 xdvy dvz\n+ same for dvy , dvz\n(5.184)\nFigure 5.13: Difference in flow across xsurfaces (+y + z).\na is \"velocity space motion\", i.e. acceleration.\n\nr\nDivide through by d3xd3v and take limit\n∂f\n∂\n∂\n∂\n∂\n∂\n∂\n=\n(vxf) +\n(vy f) +\n(vz f) +\n(axf) +\n(ay f) +\n(az f)\n- ∂t\n∂x\n∂y\n∂z\n∂vx\n∂vy\n∂vz\n=\n. (vf) + rv . (af)\n(5.185)\n∂\n[Notation: Use ∂\n∂\nx ↔r; ∂v\nv ].\n↔r\nTake this simple continuity equation in phase space and expand:\n∂f + (r.v) f + (v.r) f + (rv .a) f + (a.rv ) f = 0.\n(5.186)\n∂t\nRecognize that r means here ∂ etc. keeping v constant so that r.v = 0 by definition. So\n∂x\n∂f\n∂f\n∂f\n+ v.\n+ a.\n= -f (rv .a)\n(5.187)\n∂t\n∂x\n∂v\nNow we want to couple this equation with Maxwell's equations for the fields, and the Lorentz\nforce\nq\na =\n(E + v ∧B)\n(5.188)\nm\nActually we don't want to use the E retaining all the local effects of individual particles. We\nwant a smoothed out field. Ensemble averaged E.\nEvaluate\nq\nq\nv .a =\nv .\n(E + v ∧B) =\nv . (v ∧B)\n(5.189)\nr\nr m\nmr\nq\n=\nB. (rv ∧v) = 0.\n(5.190)\nm\nSo RHS is zero. However in the use of smoothed out E we have ignored local effect of one\nparticle on another due to the graininess. That is collisions.\nBoltzmann Equation:\n\n!\n∂f\n∂f\n∂f\n∂f\n∂t + v. ∂x + a. ∂v =\n∂t\ncollisions\n(5.191)\nVlasov Equation ≡Boltzman Eq without collisions. For electromagnetic forces:\n∂f\n∂t + v. ∂f\n∂x + q\nm (E + v ∧B) ∂f\n∂v = 0.\n(5.192)\nInterpretation:\nDistribution function is constant along particle orbit in phase space: d\ndt f = 0.\nd\n∂f\ndx ∂f\n∂v ∂f\ndt f = ∂t + dt . ∂x + dt . ∂v\n(5.193)\nCoupled to Vlasov equation for each particle species we have Maxwell's equations.\n\nX\nX\nZ\nX\nX\nZ\nVlasovMaxwell Equations\n∂fj\n∂t\n+ v. ∂fj\n∂x + qj\nmj\n(E + v ∧B) . ∂fj\n∂vj\n= 0\n(5.194)\nr ∧E = -∂B\n∂t\n,\nr ∧B = μ0j + 1\nc2\n∂E\n∂t\n(5.195)\nρ\nr.E = 0\n,\nr.B = 0\n(5.196)\nCoupling is completed via charge & current densities.\nρ =\nqjnj =\nqj\nfjd3 v\n(5.197)\nj\nJ\nj =\nqjnjVj =\nqj\nfjvd3 v.\n(5.198)\nj\nj\nDescribe phenomena in which collisions are not important, keeping track of the (statistically\naveraged) particle distribution function.\nPlasma waves are the most important phenomena covered by the VlasovMaxwell equations.\n6dimensional, nonlinear, timedependent, integraldifferential equations!\n5.9.2\nLinearized Wave Solution of Vlasov Equation\nUnmagnetized Plasma\nLinearize the Vlasov Eq by supposing\nf = f0(v) + f1(v) exp i (k.x -ωt) ,\nf1 small.\n(5.199)\nalso E = E1 exp i (k.x -ωt)\nB = B1 exp i (k.x -ωt)\n(5.200)\n∂\nZeroth order f0 equation satisfied by ∂\n∂t , ∂x = 0. First order:\nq\n∂f0\n-iωf1 + v.ikf1 +\n(E1 + v ∧B1) .\n= 0.\n(5.201)\nm\n∂v\n[Note v is not per se of any order, it is an independent variable.]\nSolution:\nq\n∂f0\nf1 =\n(5.202)\ni (ω -k.v) m (E1 + v ∧B1) . ∂v\n∂f0\nFor convenience, assume f0 is isotropic. Then ∂f0 is in direction v so v ∧B1.\n= 0\n∂v\n∂v\nq\n∂f0\nf1 =\nm E1. ∂v\n(5.203)\ni (ω -k.v)\nWe want to calculate the conductivity σ. Do this by simply integrating:\nZ\n2 Z\n∂f0\nv ∂v\nd3\nj =\nqf1vd3 v = q\nv .E1.\n(5.204)\nim\nω -k.v\n\nZ\nHere the electric field has been taken outside the vintegral but its dot product is with\n∂f0/∂v. Hence we have the tensor conductivity,\n2 Z\n∂f0\nq\nv\nσ =\n∂v\nd3 v\n(5.205)\nim\nω - k.v\nFocus on zz component:\nσzz\nZ\n∂f0\n1 + χzz = zz = 1 +\n= 1 + q\nvz ∂vz d3 v\n(5.206)\n-iω0\nωm0\nω - k.v\nSuch an expression applies for the conductivity (susceptibility) of each species, if more than\none needs to be considered.\nIt looks as if we are there! Just do the integral!\nNow the problem becomes evident. The integrand has a zero in the denominator. At least\nwe can do 2 of 3 integrals by defining the 1dimensional distribution function\nfz(vz) ≡\nf(v)dvxdvy\n(k = kˆz)\n(5.207)\nThen\n∂fz\nZ\nq\nvz ∂vz\nχ =\ndvz\n(5.208)\nωm0\nω - kvz\n(drop the z suffix from now on. 1d problem).\nω\nHow do we integrate through the pole at v = k ? Contribution of resonant particles. Crucial\nto get right.\nPath of velocity integration\nFirst, realize that the solution we have found is not complete. In fact a more general solution\ncan be constructed by adding any solution of\n∂f1\n∂f1\n+ v\n= 0\n(5.209)\n∂t\n∂z\n∂f\n[We are dealing with 1d Vlasov equation: ∂t + v ∂f + qE ∂f = 0.] Solution of this is\n∂z\nm ∂v\nf1 = g(vt - z, v)\n(5.210)\nwhere g is an arbitrary function of its arguments. Hence general solution is\nq E ∂f0\nf1 =\nm\n∂v\ni (ω - kv) exp i (kz - ωt) + g (vt - z, v)\n(5.211)\nand g must be determined by initial conditions. In general, if we start up the wave suddenly\nthere will be a transient that makes g nonzero.\n\nI\nX\nSo instead we consider a case of complex ω (real k for simplicity) where ω = ωr + iωi and\nωi > 0.\nThis case corresponds to a growing wave:\nexp(-iωt) = exp(-iωr t + ωit)\n(5.212)\nThen we can take our initial condition to be f1 = 0 at t → -inf. This is satisfied by taking\ng = 0.\nFor ωi > 0 the complementary function, g, is zero.\nPhysically this can be thought of as treating a case where there is a very gradual, smooth\nstart up, so that no transients are generated.\nThus if ωi > 0, the solution is simply the velocity integral, taken along the real axis, with\nno additional terms. For\n∂f\nZ\n∂v\nq\nv\nωi > 0,\nχ =\ndv\n(5.213)\nωmo\nC ω - kv\nwhere there is now no difficulty about the integration because ω is complex.\nFigure 5.14: Contour of integration in complex vplane.\nω\nThe pole of the integrand is at v = k which is above the real axis.\nThe question then arises as to how to do the calculation if ωi ≤ 0. The answer is by \"analytic\ncontinuation\", regarding all quantities as complex.\n\"Analytic Continuation\" of χ is accomplished by allowing ω/k to move (e.g. changing the ωi)\nbut never allowing any poles to cross the integration contour, as things change continuously.\nRemember (Fig 5.15)\nF dz =\nresidues × 2πi\n(5.214)\nc\n(Cauchy's theorem)\nWhere residues = limz→zk [F (z)/(z -zk )] at the poles, zk , of F (z). We can deform the contour\nhow we like, provided no poles cross it. Hence contour (Fig 5.16)\n\nZ\nZ\nZ\n\nZ\n\nFigure 5.15: Cauchy's theorem.\nFigure 5.16: Landau Contour\nWe conclude that the integration contour for ωi < 0 is not just along the real v axis. It\nincludes the pole also.\nTo express our answer in a universal way we use the notation of \"Principal Value\" of a\nsingular integral defined as the average of paths above and below\nF\nF\n℘\ndv =\n+\ndv\n(5.215)\nv - v0\nC1\nC2 v - v0\nFigure 5.17: Two halves of principal value contour.\nThen\n(5.216)\n}\n∂f0\nω ∂f0\nv ∂v\nχ = ωmo\n{℘\ndv - 2πi\nω - kv\nk2 ∂v v= k\nω\nSecond term is half the normal residue term; so it is half of the integral round the pole.\n\nZ\n\nZ\nZ\nFigure 5.18: Contour equivalence.\nOur expression is only shorthand for the (Landau) prescription:\n\"Integrate below the pole\".\n(Nautilus).\nContribution from the pole can be considered to arise from the complementary function\ng(vt- z, v). If g is to be proportional to exp(ikz), then it must be of the form g = exp[ik(z -\nvt)]h(v) where h(v) is an arbitrary function. To get the result previously calculated, the value\nof h(v) must be (for real ω)\n1 ∂f0\nk ∂v\nω\nq\nh(v) = π m\nδ\nv -\n(5.217)\nk\nk\nw\n⎞\n⎛\nω ∂f0\nk2 ∂v\nq\n(so that\nvgdv = ⎝πi\nq\n⎠\nk\nω\n.)\n(5.218)\n-iωo\nωmo\nThis Dirac delta function says that the complementary function is limited to particles with\n\"exactly\" the wave phase speed ω . It is the resonant behaviour of these particles and the\nk\nimaginary term they contribute to χ that is responsible for wave damping.\nWe shall see in a moment, that the standard case will be ωi < 0, so the opposite of the\nprescription ωi > 0 that makes g = 0. Therefore there will generally be a complementary\nfunction, nonzero, describing resonant effects. We don't have to calculate it explicitly\nbecause the Landau prescription takes care of it.\n5.9.3\nLandau's original approach.\n(1946)\nCorrected Vlasov's assumption that the correct result was just the principal value of the inte\ngral. Landau recognized the importance of initial conditions and so used Laplace Transform\napproach to the problem\ninf\nA(p) =\ne-ptA(t)dt\n(5.219)\nThe Laplace Transform inversion formula is\ns+iinf\neptA (p)dp\nA(t) =\n(5.220)\ns large\nA (p)\n2πi s-iinf\nA (p) (i.e.\nwhere the path of integration must be chosen to the right of any poles of\nenough). Such a prescription seems reasonable. If we make <(p) large enough then the\nintegral will presumably exist. The inversion formula can also be proved rigorously so that\ngives confidence that this is the right approach.\n\nR\nZ\n\nZ\n\nZ\n\nZ\n\"\n\n#\nR\nZ\n\nA\niωtA(t)dt, which can be identified as\nIf we identify p →-iω, then the transform is\nthe Fourier transform that would give component\n=\ne\n\nA ∝e-iωt , the wave we are discussing.\nMaking <(p) positive enough to be to the right of all poles is then equivalent to making =(ω)\npositive enough so that the path in ωspace is above all poles, in particular ωi > =(kv). For\nreal velocity, v, this is precisely the condition ωi > 0, we adopted before to justify putting\nthe complementary function zero.\nEither approach gives the same prescription. It is all bound up with satisfying causality.\n5.9.4\nSolution of Dispersion Relation\nWe have the dielectric tensor\n⎧\n⎨\ndv -πi ω ∂f0\nk2 ∂v\n⎫\n⎬\n⎭\nk\nω\n,\n(5.221)\n∂f0\nv\nq\n∂v\n= 1 + χ = 1 +\n℘\n⎩\nωm0\nω -kv\nfor a general isotropic distribution. We also know that the dispersion relation is\n⎤\n⎡\n-N 2 + t\nN 2 + t\n= 0\n(5.222)\n⎢⎣\n⎥⎦\n-N 2 + t\n= -\n\nGiving transverse waves N 2 = t and\nlongitudinal waves = 0.\nNeed to do the integral and hence get .\nPresumably, if we have done this right, we ought to be able to get back the coldplasma\nresult as an approximation in the appropriate limits, plus some corrections. We previously\nargued that coldplasma is valid if ω\nω\nk vt. So regard kv as a small quantity and expand:\n⎡\n⎤\n!2\n∂f0\n∂f0\nkv\nkv\nv dv\n⎣1 +\n⎦ dv\ndv =\nv\n℘\n+\n+ ...\nω\nkv\nω\n∂v\nω\nω\n1 -ω\n⎡\n⎤\n!2\nfo\n2kv\nkv\n-\n⎣1 +\n⎦ dv\n+ 3\n(by parts)\n+ ...\n=\nω\nω\nω\n'\n-1\n3nT k2\nn +\n+ ...\n(5.223)\nω\nm ω2\nHere we have assumed we are in the particles' average rest frame (no bulk velocity) so that\nf0vdv = 0 and also we have used the temperature definition\nnT =\nmv 2f0dv ,\n(5.224)\nappropriate to one degree of freedom (1d problem). Ignoring the higher order terms we get:\n⎧\n⎨\n⎫\n⎬\n⎭\nk\nω\n(5.225)\nω2\np\nT k2\nω2 1 ∂f0\n= 1 -\n1 + 3\n+ πi\nω2 ⎩\nm ω2\nk2 n ∂v\n\n'\n'\n'\n\n!\n\n!\n\n!\n\n!\np\nω\nThis is just what we expected. Cold plasma value was = 1 -\nWe have two corrections\nω2 .\n\nvt\n1. To real part of , correction 3 T k2 = 3 vp\ndue to finite temperature. We could have\nm ω2\ngot this from a fluid treatment with pressure.\n2. Imaginary part →antihermitian part of →dissipation.\nSolve the dispersion relation for longitudinal waves = 0 (again assuming k real ω complex).\nAssume ωi ωr then\nT k2\nω2 1 ∂f0\np {1 + 3\nω2 + 2ωr ωii = ω2\nr\n(ωr + iωi)\n+ πi\n| }\nk\nω\nm ω2\nk2 n ∂v\nT k2\nω2 1 ∂fo\nω2\np {1 + 3\n+ πi r\nm ω2\nk2 n\nr\n(5.226)\n| }\nωr\n∂v\nk\nωr\n2 1 ∂f0\nπ ωr 1 ∂f0\nω2\np\n= ω2\np\nHence ω1\nπi\n(5.227)\n|\n|\nω\nω\nr\nr\nk2\nk2 n ∂v\n2ωr i\n∂v\nk\nk\nn\nFor a Maxwellian distribution\nm\nmv\nf0 =\nexp\nn\n(5.228)\n2πT\n- 2T\n∂f0\n∂v\nm\nmv\nmv\n=\nexp\nn\n(5.229)\n2πT\n- T\n- 2T\nω2\n\nm\nr\n2 m\nmω2\nπ\np\nωi ' -ω2\nr\nexp\n(5.230)\n-2T k2\nk3\n2πT\nT\nThe difference between ωr and ωp may not be important in the outside but ought to be\nretained inside the exponential since\nm\n2T\nω2\np\nk2\n\"\n1 + 3 T\nm\nk2\nω2\np\n#\n= mω2\np\n2T k2 + 3\n(5.231)\n2 ω3\nmω2\nπ\nSo\nωi ' -ωp\np\nexp\n(5.232)\nk3 vt\n-2T k\np\n2 -2\nImaginary part of ω is negative ⇒damping. This is Landau Damping.\nNote that we have been treating a single species (electrons by implication) but if we need\nmore than one we simply add to χ. Solution is then more complex.\n5.9.5\nDirect Calculation of Collisionless Particle Heating\n(Landau Damping without complex variables!)\nWe show by a direct calculation that net energy is transferred to electrons.\n\n\"\n#\nSuppose there exists a longitudinal wave\nE = E cos(kz - ωt)ˆ\n(5.233)\nz\nEquations of motion of a particle\ndv\nq\n=\nE cos(kz - ωt)\n(5.234)\ndt\nm\ndz = v\n(5.235)\ndt\nSolve these assuming E is small by a perturbation expansion v = v0 + v1 + ..., z = z0(t) +\nz1(t) + ... .\nZeroth order:\ndvo = 0 ⇒ v0 = const ,\nz0 = zi + v0t\n(5.236)\ndt\nwhere zi = const is the initial position.\nFirst Order\ndv1\nq\nq\n=\nE cos (kz0 - ωt) =\nE cos (k (zi + v0t) - ωt)\n(5.237)\ndt\nm\nm\ndz1\n= v1\n(5.238)\ndt\nIntegrate:\nqE sin (kzi + kv0 - ωt) + const.\n(5.239)\nv1 = m\nkv0 - ω\ntake initial conditions to be v1, v2 = 0. Then\nqE sin (kzi + Δωt) - sin (kzi)\n(5.240)\nv1 = m\nΔω\nwhere Δω ≡ kv0 - ω, is () the frequency at which the particle feels the wave field.\nqE cos kzi - cos (kzi + Δωt)\nsin kzi\n(5.241)\nz1 = m\nΔω2\n- t Δω\n(using z1(0) = 0).\n2nd Order\n(Needed to get energy right)\ndv2\nqE\n= M {cos (kzi + kv0t - ωt + kz1) - cos (kzi + kv0t - ωt)}\ndt\nqE\n=\nkzi{- sin (kzi + Δωt)}\n(kz1 1)\n(5.242)\nm\nNow the gain in kinetic energy of the particle is\nmv\n1 mv0\n2 = m{(v0 + v1 + v2 + ...)2 - v0 }\n- 2\n= 2 {2v0v1 + v1 + 2v0v2 + higher order}\n(5.243)\n\n!\n*\n\n+\n*\n+\n*\n+\n\n*\n+\n\nand the rate of increase of K.E. is\nd\ndv1\ndv1\ndv2\nmv\n= m\nv0\n+ v1\n+ v0\n(5.244)\ndt 2\ndt\ndt\ndt\nWe need to average this over space, i.e. over zi. This will cancel any component that simply\noscillates with zi.\n+\n*\nd\ndv1\ndv1\ndv2\nmv\n= v0\n+ v1\n+ v0\nm\n(5.245)\ndt 2\ndt\ndt\ndt\ndv1\nv0\n= 0\n(5.246)\ndt\n*\n+\n*\n\"\n#+\ndv1\nq2E2 sin (kzi + Δωt) - sin kzi cos (kzi + Δωt)\nv1\n=\ndt\nm2\nΔω\nq2E2 sin (kzi + Δωt) - sin (kzi + Δωt) cos Δωt + cos (kzi + Δωt) sin Δωt\n=\nm2\nΔω\ncos (kzi + Δωt)\nq2E2 sin Δωt\n=\ncos (kzi + Δωt)\nm2\nΔω\nq2E2 1 sin Δωt\n=\n(5.247)\nm2 2\nΔω\n*\n+\n*\n!\n+\ndv2\n-q2E2\ncos kzi - cos (kzi + Δωt)\nsin kzi\nsin (kzi + Δωt)\nv0\n=\nkv0\ndt\nm2\nΔω2\n- t Δω\nsin Δωt\ncos Δωt\n= -q2E2\nkv0\n\nΔω2\n- t Δω\nsin2 (kzi + Δωt)\nm\nq2E2 kv0\nsin Δωt\ncos Δωt\n=\n+ t\n(5.248)\nm2\n- Δω2\nΔω\nHence\nd 1\nq2E2 sin Δωt\nsin Δωt\ncos Δωt\nmv\n=\n- kv0\n+ kv0t\n(5.249)\ndt 2\n2m\nΔω\nΔω2\nΔω\nωt\n= q2E2 -ω sin Δωt +\ncos Δωt + t cos Δωt\n(5.250)\n2m\nΔω2\nΔω\nThis is the spaceaveraged power into particles of a specific velocity v0. We need to integrate\nover the distribution function. A trick identify helps:\nωt\n∂\nω sin Δωt\n-ω sin Δωt +\ncos Δωt + t cos Δωt =\n+ sin Δωt\n(5.251)\nΔω2\nΔω\n∂Δω\nΔω\n1 ∂\nω sin Δωt\n=\n+ sin Δωt\n(5.252)\nk ∂v0\nΔω\n\nZ *\n+\n\nR\nHence power per unit volume is\nd 1\nP =\nmv 2 f (v0) dv0\ndt 2\nq2E2 Z\n∂\nω sin Δωt\n=\nf (v0)\n+ sin Δωt dv0\n2mk\n∂v0\nΔω\nq2E2 Z\n\nω sin Δωt\n∂f\n=\n+ sin Δωt\ndv0\n(5.253)\n- 2mk\nΔω\n∂v0\nAs t becomes large, sin Δωt = sin(kv0 - ω)t becomes a rapidly oscillating function of v0.\nHence second term of integrand contributes negligibly and the first term,\nω sin Δωt\nsin Δωt\n=\nωt\n(5.254)\n∝\nΔω\nΔωt\nbecomes a highly localized, deltafunctionlike quantity. That enables the rest of the inte\ngrand to be evaluated just where Δω = 0 (i.e. kv0 - ω = 0).\nFigure 5.19: Localized integrand function.\nSo:\nq2E2 ω ∂f\nZ sin x\nP\n-\n|\ndx\n(5.255)\n=\nk\nω\n2mk k ∂v\nx\nx = Δωt = (kv0 - ω)t.\nand\nsin x dz = π so\nx\nπq2ω ∂f0\nP = -E 2mk2\n|\nk\nω\n(5.256)\n∂v\nWe have shown that there is a net transfer of energy to particles at the resonant velocity ω\nk\nfrom the wave. (Positive if ∂f is negative.)\n∂v |\n5.9.6\nPhysical Picture\nΔω is the frequency in the particles' (unperturbed) frame of reference, or equivalently it is\nkv0 where v0 is particle speed in wave frame of reference. The latter is easier to deal with.\nΔωt = kv0t is the phase the particle travels in time t. We found that the energy gain was of\nthe form\nZ sin Δωt d (Δωt) .\n(5.257)\nΔωt\n\nFigure 5.20: Phase distance traveled in time t.\nThis integrand becomes small (and oscillatory) for Δωt 1. Physically, this means that\nif particle moves through many wavelengths its energy gain is small. Dominant contribution\nis from Δωt < π. These are particles that move through less than 1 wavelength during the\nperiod under consideration. These are the resonant particles.\nFigure 5.21: Dominant contribution\nParticles moving slightly faster than wave are slowed down. This is a secondorder effect.\nFigure 5.22: Particles moving slightly faster than the wave.\nSome particles of this v0 group are being accelerated (A) some slowed (B). Because A's are\nthen going faster, they spend less time in the 'down' region. B's are slowed; they spend more\ntime in up region. Net effect: tendency for particle to move its speed toward that of wave.\nParticles moving slightly slower than wave are speeded up. (Same argument). But this is\nonly true for particles that have \"caught the wave\".\nSummary: Resonant particles' velocity is drawn toward the wave phase velocity.\nIs there net energy when we average both slower and faster particles? Depends which type\nhas most.\nOur Complex variables wave treatment and our direct particle energy calculation give con\nsistent answers. To show this we need to show energy conservation. Energy density of\n\n| {z }\n{z }\n|\n{z\n}\n\"\n#\nh\n\nFigure 5.23: Damping or growth depends on distribution slope\nwave:\nW =\n[\n+\nn m v 2| ]\n(5.258)\nE |\n2|\n|\n|\n<sin2> Electrostatic\nP article Kinetic\nMagnetic wave energy zero (negligible) for a longitudinal wave. We showed in Cold Plasma\ntreatment that the velocity due to the wave is =\nqE Hence\nv\n-iωm\nω2\nW ' 1 0E2\n1 +\np\n(again electrons only)\n(5.259)\nω2\nWhen the wave is damped, it has imaginary part of ω, ωi and\ndW\n1 dE2\n= W\n= 2ωiW\n(5.260)\ndt\nE2 dt\nConservation of energy requires that this equal minus the particle energy gain rate, P . Hence\nωp\n+E2 πq2ω ∂f0\n2mk2\n-P =\nπ ω 1 ∂f0\nki\nω|\n∂v\n= ω2\np\nωi =\n(5.261)\n| ω ×\nωp\n2 k2 n ∂v\n0E2\n2W\nk\n1 +\n1 +\nω2\nω2\nSo for waves such that ω ∼ ωp, which is the dispersion relation to lowest order, we get\nωi = ω2 π ωr 1 ∂f0\np\n.\n(5.262)\n2 k2 n ∂v\nωr\nk\nThis exactly agrees with the damping calculated from the complex dispersion relation using\nthe Vlasov equation.\nThis is the Landau damping calculation for longitudinal waves in a (magnetic) fieldfree\nplasma. Strictly, just for electron plasma waves.\nHow does this apply to the general magnetized plasma case with multiple species?\nDoing a complete evaluation of the dielectric tensor using kinetic theory is feasible but very\nheavy algebra. Our direct intuitive calculation gives the correct answer more directly.\n\ni\ni\n5.9.7\nDamping Mechanisms\nCold plasma dielectric tensor is Hermitian. [Complex conjugate*, transposeT = original\nmatrix.] This means no damping (dissipation).\nThe proof of this fact is simple but instructive. Rate of doing work on plasma per unit\nvolume is P = E.j. However we need to observe notation.\nNotation is that E(k, ω) is amplitude of wave which is really <(E(k, ω) exp i(k.x - ωt)) and\nsimilarly for j. Whenever products are taken: must take real part first. So\nP = < (E exp i (k.x - ωt)) .< (j exp i (k.x - ωt))\ni 1 h\ni\n1 h\n=\nEe iφ + E∗e-iφ .\nje iφ + j∗e-iφ\n(φ = k.x - ωt.)\n1 h\n.j∗e-2iφ\n=\nE.je 2iφ + E.j∗ + E∗.j + E∗\n(5.263)\nThe terms e2iφ & e-2iφ are rapidly varying. We usually average over at least a period. These\naverage to zero. Hence\nhP i =\n[E.j∗ + E∗.j] = 2 < (E.j∗)\n(5.264)\nNow recognize that j = σ.E and substitute\n1 [E.σ∗.E∗ + E∗.σ.E]\n(5.265)\nhP i = 4\nBut for arbitrary matrices and vectors:\nA.M.B = B.MT .A;\n(5.266)\n(in our dyadic notation we don't explicitly indicate transposes of vectors). So\nE.σ∗.E∗ = E∗.σ∗T .E\n(5.267)\nhence\nh\nhP i = E∗. σ∗T + σ .E\n(5.268)\nIf = 1 +\n1 σ is hermitian ∗T = , then the conductivity tensor is antihermitian\n-iω0\nσ∗T = -σ (if ω is real). In that case, equation 5.268 shows that < P >= 0. No dissipation.\nAny dissipation of wave energy is associated with an antihermitian part of σ and hence .\nCold Plasma has none.\nCollisions introduce damping. Can be included in equation of motion\ndv\nm\n= q (E + v ∧ B) - mv ν\n(5.269)\ndt\nwhere ν is the collision frequency.\n\n=\nP\nP\nP\nX\nh\ni\nWhole calculation can be followed through replacing m(-iω) with m(ν - iω) everywhere.\nThis introduces complex quantity in S, D, P .\nWe shall not bother with this because in fusion plasmas collisional damping is usually neg\nligible. See this physically by saying that transit time of a wave is\nSize\n1 meter\n3 × 10+8m/s ' 3 × 10-9 seconds.\n(5.270)\nSpeed ∼\n(Collision frequency)-1 ∼ 10μs → 1ms, depending on Te, ne.\nWhen is the conductivity tensor Antihermitian?\nCold Plasma:\nω2\npj\n⎤\n⎡\nwhere\nS = 1 -\nD =\nj\nS\n-iD 0\nS\nj ω2-Ω2\nj\nΩj\nωpj\n⎢⎣\n⎥⎦\niD\n(5.271)\nω ω2-Ω2\nj\nω2\nP\nP = 1 -\npj\nj ω2\nThis is manifestly Hermitian if ω is real, and then σ is antiHermitian.\nThis observation is sufficient to show that if the plasma is driven with a steady wave, there\nis no damping, and k does not acquire a complex part.\nTwo stream Instability\nzz = 1 -\nω2\npj\n(ω - kvj )\nj\n(5.272)\nIn this case, the relevant component is Hermitian (i.e. real) if both ω and k are real.\nBut that just begs the question: If ω and k are real, then there's no damping by definition.\nSo we can't necessarily detect damping or growth just by inspecting the dieletric tensor form\nwhen it depends on both ω and k.\nElectrostatic Waves in general have = 0 which is Hermitian. So really it is not enough to\ndeal with or χ. We need to deal with σ = -iωoχ, which indeed has a Hermitian component\nfor the twostream instability (even though χ is Hermitian) because ω is complex.\n5.9.8\nIon Acoustic Waves and Landau Damping\nWe previously derived ion acoustic waves based on fluid treatment giving\nω2\nω2\npi\nzz = 1 -\npe\n(5.273)\nmene\nmini\nω2 - k2peγe -\nω2 - k2piγi\nγiTi+γeTe\nLeading to ω2 ' k2\n.\nmi\n\nZ\nZ\n\"\n#\nZ\n'\nZ\nZ\nZ\n\nKinetic treatment adds the extra ingredient of Landau Damping. Vlasov plasma, unmagne\ntized:\nω2\npe\n∂foe dv\nω2\npi\n∂foi dv\nzz = 1 - k2\nC v -ω\nk ∂v n - k2\nC v -\n(5.274)\nω ∂v n\nk\nBoth electron and ion damping need to be considered as possibly important.\nBased on our fluid treatment we know these waves will have small phase velocity relative to\nelectron thermal speed. Also cs is somewhat larger than the ion thermal speed.\nFigure 5.24: Distribution functions of ions and electrons near the sound wave speed.\nSo we adopt approximations\nω\nω\nvte k ,\nvti < (<) k\n(5.275)\nand expand in opposite ways.\nIons are in the standard limit, so\nω2\n3Ti k2\nω2 1 ∂foi\npi 1 +\nχi ' - ω2\n+ πi\nw/k\n(5.276)\n|\nm ω2\nk2 ni ∂v\nElectrons: we regard ω as small and write\nk\n∂foe dv\n1 ∂foe dv\nv ∂v n\n∂foe dv\n∂v2\n℘\n℘\nω ∂v\nv -\nn\nk\nn\n=\nme foedv\nfor Maxwellian.\n-2Te\n= n\nme\n=\n(5.277)\n-Te\nWrite F0 = fo/n.\nContribution from the pole is as usual so\n⎤\n⎡\nω2\npe\nme\n∂Foe\n⎣\n⎦\nχe = -\n+ πi\n(5.278)\n-\nk2\nTe\n∂v\nω/k\n\n\"\n#\n#\n\"\n#\n'\nCollecting real and imaginary parts (at real ω)\nω2\nω2\nk2\npi\n3Ti\nεr (ωr ) = 1 +\npe me\n1 +\n(5.279)\nk2\n\" Te\n- ωr\nm ωr\n∂Foi\nεi(ωr )\n= -πk\n2 ω2 ∂Foe |ω/k + ω2\npe ∂v\npi\nω/k\n(5.280)\n∂v |\nThe real part is essentially the same as before. The extra Bohm Gross term in ions appeared\npreviously in the denominator as\nω2\nω2\nk2\npi\npi\n3Ti\nω2 - k2piγi ↔ ω2 1 + mi ω2\n(5.281)\nmi\nSince our kinetic form is based on a rather inaccurate Taylor expansion, it is not clear that\nit is a better approx. We are probably better off using\nω2\npi\n3Tik2 .\n(5.282)\nω2 1 - miω2\nThen the solution of εr (ωr ) = 0 is\nω2\n\nTe + 3Ti\nr =\n(5.283)\nk2\nmi\n1 + k2λ2\nDe\nas before, but we've proved that γe = 1 is the correct choice, and kept the k2λ2 term (1st\nDe\nterm of εr ).\nThe imaginary part of ε gives damping.\nGeneral way to solve for damping when small\nWe want to solve ε(k, ω) = 0 with ω = ωr + iωi , ωi small.\nTaylor expand ε about real ωr :\ndε\nε(ω)\nε(ωr ) + iωi dω |ωr\n(5.284)\n∂\n= ε(ωr ) + iωi\nε(ωr )\n(5.285)\n∂ωr\nLet ωr be the solution of εr (ωr ) = 0; then\n∂\nε(ω) = iεi(ωr ) + iωi\nε(ωr ).\n(5.286)\n∂ωr\nThis is equal to zero when\nεi (ωr ) .\n(5.287)\nωi =\n∂ε(ωr )\n-\n∂ωr\n\n\"\n#\n#\n\"\n\n#\n\nq\n\nh\ni\nh\ni\nq\n\nr\nh\ni\n\"\n\n| {z }\n\n|\n{z\n}\n#\nIf, by presumption, εi εr , or more precisely (in the vicinity of ε = 0), ∂εi/∂ωr ∂εr /∂ωr\nthen this can be written to lowest order:\nεi (ωr )\n(5.288)\nωi =\n∂εr (ωr )\n-\n∂ωr\nApply to ion acoustic waves:\n∂εr (ωr )\nω2\nk2\npi\n4Ti\n=\n2 + 4\n(5.289)\n∂ωr\nωr\nmi ωr\nso\n⎡\n⎤\"\nωi = π ωr\n⎣\n⎦ ω2 ∂Foe\npi\n∂Foi\nω/k\n(5.290)\nk2 ω2\npi 2 + 4 4Ti k2\npe ∂v |ω/k + ω2\n∂v |\nmi ω2\nr\nFor Maxwellian distributions, using our previous value for ωr ,\n∂Foe\n∂v\nme\nmev e- mev\n2Te\nωr\n=\nk\n|\n- 2πTe\nTe\nωr\nv= k\n⎛\n⎞\n1 + 3Ti\nTe\nTe + 3Ti\nme\nme\n⎝\n⎠\n-\n√\n2π\n-\n=\nexp\n1 + k2λ2\nD\nTe\n2mi\nmi\n1 + k2λ2\nD\n1 + 3Ti\nme\nme\nTe\nq\n,\n(5.291)\n= -\n√\n2π\nmi\nTe\n1 + k2λ2\nDe\nwhere the exponent is of order me/mi here, and so the exponential is 1. And\n⎛\n⎞\n1 + 3Ti\nTe\n1 + 3Ti\n∂Foi\nTe\n⎝- Te\nTe\n⎠\n(5.292)\nD\nmi\nωr =\n|\nk\n-√\n2π\nexp\n1 + k2λ2\n∂v\nTi\nTi\n1 + k2λ2\nD\n2Ti\nHence\n⎡\n⎤h\ni\nωi\nπ\nω2\n⎣\n1 + 3\nT\nT\ne\ni\nr\n=\n⎦q\n-\n√\n2π\n×\nk2\nk2\n2 + 4 3Ti\nωr\n1 + k2λ2\nD\nr\nω\nmi\n⎡\n⎛\n⎞⎤\n1 + 3Ti\nTe\n⎝- Te\nTe\n⎠⎦\n(5.293)\nD\nmi\nme\nme\nmi\n⎣\n+\nexp\n1 + k2λ2\nTe\nTi\nTi\n2Ti\nme\nmi\nωi\nπ\n1 + 3\nT\nT\ne\ni\n= -\n3Ti\n×\n[1 + k2λ2\nDe]\nωr\n2 + 4 Te+3Ti\n⎛\n⎞\n1 + 3Ti\nTe\n⎝- Te\nTe\n⎠ .\n(5.294)\nDe\nme\n2 +\nexp\n1 + k2λ2\nTi\n2Ti\nmi\nelectron\nion damping\n\n∂fo\nvj\ndvj =\n∂vj\n-\nfodvj ,\n(5.302)\nq\nq\n\nR\nZ\nZ\n[Note: the coefficient on the first line of equation 5.294 for ωi/ωr reduces to ' - π/8 for\nTi/Te 1 and kλDe 1.]\n∼\nme\nElectron Landau damping of ion acoustic waves is rather small: ωi\n.\nωr\nmi\n∼\nIon Landau damping is large, ∼1 unless the term in the exponent is large. That is\nTe\nunless\nTi\n1 .\n(5.295)\nq\nPhysics is that large Te\nTi pulls the phase velocity of the wave:\nq\nTe+3Ti\nmi\n= cs above the ion\nTi\nthermal velocity vti =\nmi . If cs vti there are few resonant ions to damp the wave.\n[Note. Many texts drop terms of order Ti early in the treatment, but that is not really\nTe\naccurate. We have kept the first order, giving extra coefficient\n3Ti\nTe + 3Ti ' 1 + 3 Ti\n2 Te\n(5.296)\n1 + Te\nTe + 6Ti\nand an extra factor 1 + 3Ti in the exponent. When Ti ∼ Te we ought really to use full\nTe\nsolutions based on the Plasma Dispersion Function.]\n5.9.9\nAlternative expressions of Dielectric Tensor Elements\nThis subsection gives some useful algebraic relationships that enable one to transform to\ndifferent expressions sometimes encountered.\nχzz =\n=\n=\n=\nq2\nωmo\nZ\nC\nv ∂fo\n∂v\nω -kv dv =\nq2\nω2mo\nω\nk\nZ\nC\n\nω\nω -kv -1\n\nq2\nmo\nk2\nZ\nC\nω\nk -v\n∂fo\n∂v dv\nω2\np\nk2\nZ\nC\nω\nk -v\nn\n∂fo\n∂v dv\nω2\np\nk2\n\"\n℘\nZ\nω\nk -v\n∂Fo\n2v dv -πi ∂Fo\n∂v | ω\nk\n#\n∂fo\n∂v dv\n(5.297)\n(5.298)\n(5.299)\n(5.300)\nwhere Fo = fo\nn is the normalized distribution function. Other elements of χ involve integrals\nof the form\nχjl\nωmo\nq2\n=\nZ\nvj\n∂fo\n∂vl\nω -k.v d3 v .\n(5.301)\nWhen k is in zdirection, k.v = kzvz. (Multi dimensional distribution f0).\n∂fo\nIf (e.g., χxy) l = z and j = l then the integral over vl yields\n∂vl dvl = 0. If j = l = z then\n\nR\nZ\nZ\nZ\nZ\nZ\nZ\nR\nR\nR\n=\nZ\nZ\nby parts. So, recalling the definition fz\nf dvxdvy,\n≡\nfoz\ndvz\nq\nχxx = χyy = - ωmo\nω - k.v\nω2\nFoz\n=\ndvz.\n(5.303)\n- ω\np\nω - k.v\nThe fourth type of element is\n∂fo\nvx\nq\n∂vz\nd3\nχxz =\nv .\n(5.304)\nωmo\nω - kzvz\nThis is not zero unless fo is isotropic (= fo(v)).\nIf f is isotropic\n∂fo\n∂vz\n= dfo\ndv\n∂v\n∂vz\n= vz\nv\ndfo\ndv\n(5.305)\nThen\n∂fo\nvxvz\n1 dfo d3 v\nvx ∂vz\nd3 v =\nω - kzvz\nω - kzvz v dv\nvz\n∂fo d3 v = 0\n(5.306)\n=\nω - kzvz ∂vx\n(since the vxintegral of ∂fo/∂vx is zero). Hence for isotropic Fo = f0/n, with k in the\nzdirection,\n⎤\np\n⎡\nω\nFoz dvz\n0+\n- ω\nC ω-kvz\n⎢⎢⎢⎣\n⎥⎥⎥⎦\np\nω\nFoz\nω\nC ω-kvz\nχ =\n0+\n(5.307)\ndvz\n-\np\nω\nk\nC ω-kvz ∂vz\n∂Foz\ndvz\n(and the terms 0+ are the ones that need isotropy to make them zero).\n⎤\n⎡ t\n⎢⎣0 t 0 ⎥⎦\n(5.308)\n0 l\nwhere\nω2\nt =\n1 -\np\nFoz\ndvz\n(5.309)\nω\nC ω - kvz\nω2\np\n∂Foz\nl =\n1 -\ndvz\n(5.310)\nω ∂vz\nk2\nC v - k\nAll integrals are along the Landau contour, passing below the pole.\n\n!\n\"\n#\n\"\n#\n5.9.10\nElectromagnetic Waves in unmagnetized Vlasov Plasma\nFor transverse waves the dispersion relation is\nk2c2\nω2\nZ\n= N 2 = t = 1 -\np 1\nfoz dvz\n(5.311)\nω2\nω n C (ω - kz vz )\nThis has, in principle, a contribution from the pole at ω - kvz = 0. However, for a non\nrelativistic plasma, thermal velocity is c and the EM wave has phase velocity ∼ c. Con\nsequently, for all velocities vz for which foz is nonzero kvz ω. We have seen with the cold\nplasma treatment that the wave phase velocity is actually greater than c. Therefore a proper\nrelativistic distribution function will have no particles at all in resonance with the wave.\nTherefore:\n1. The imaginary part of t from the pole is negligible. And relativisitically zero.\n2.\nω2 1 Z inf\n\nkvz\nk2v\np\nfoz 1 +\n+\n+ ... dvz\nt ' 1 - ω2 n -inf\nω\nω2\nz\nω2\nk2 T\np\n=\n1 - ω2 1 +\n+ ...\nω2 m\nω2\nk2v\n'\np\n1 - ω2\nω2\nt\n1 +\nω2\n'\np\n(5.312)\n1 - ω2\nk2vt\nThermal correction to the refractive index N is small because ω2 1.\nElectromagnetic waves are hardly affected by Kinetic Theory treatment in unmagnetized\nplasma. Cold Plasma treatment is generally good enough."
    }
  ]
}