{
  "course_name": "Introduction to Experimental Chemistry",
  "course_description": "This course is the first part of a modular sequence of increasingly sophisticated (and challenging) laboratory courses required of all Chemistry majors: 5.35 Introduction to Experimental Chemistry, 5.36 Biochemistry and Organic Laboratory, 5.37 Organic and Inorganic Laboratory, and 5.38 Physical Chemistry Laboratory. This course provides students with a survey of spectroscopy, and introduces synthesis of coordination compounds and kinetics.\nThis class is part of the new laboratory curriculum in the MIT Department of Chemistry. Undergraduate Research-Inspired Experimental Chemistry Alternatives (URIECA) introduces students to cutting edge research topics in a modular format.\nAcknowledgements\nProfessor Nelson and Dr. Twardowski would like to acknowledge the contributions of MIT Professor Timothy Swager to the development of this course. Module 3 on Fabrication of a Polymeric Light Emitting Device, taught by Timothy Swager, is not currently available on OCW.",
  "topics": [
    "Science",
    "Chemistry",
    "Analytical Chemistry",
    "Science",
    "Chemistry",
    "Analytical Chemistry"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions over 4 weeks, 1 hour / session\n\nLabs: 2 sessions / week, 4 hours / session\n\nPrerequisites\n\n5.111 Principles of Chemical Science\n,\n5.112 Principles of Chemical Science\nor\n3.091 Introduction to Solid State Chemistry\n\nCourse Description and Format\n\nFor most students, 5.35 will be the first formal laboratory course they will take at MIT It is the first part of a modular sequence of increasingly sophisticated (and challenging) laboratory courses required of all Chemistry majors: 5.35 Introduction to Experimental Chemistry, 5.36 Biochemistry and Organic Laboratory, 5.37 Organic and Inorganic Laboratory, and 5.38 Physical Chemistry Laboratory. The objectives of 5.35 are:\n\nTo illustrate a number of theoretical concepts previously encountered in lecture courses via practical examples in the laboratory;\n\nTo provide experience with a wide range of laboratory techniques and instruments, ranging from simple gravimetric and volumetric measurements to optical and nuclear-spin spectroscopy;\n\nTo develop planning and organizational skills for efficient use of laboratory time;\n\nTo learn to rigorously analyze data, including uncertainties in experimental measurements;\n\nTo meet the standards expected of scientists in acquiring, interpreting, and reporting data;\n\nTo demonstrate the value of teamwork in scientific investigation;\n\nTo develop written and oral communication of scientific results;\n\nTo learn proper safety practices, especially the handling and disposal of toxic chemicals;\n\nTo foster collaborations with Chemistry faculty and learn about current work being done in their research labs as it relates to your lab work;\n\nTo demonstrate that laboratory work can be both exciting and fun.\n\nThis course is part of the\nURIECA Curriculum\nfor Chemistry students at MIT, based on or linked to the current research of faculty in the department. In addition to the lectures and laboratory activities, this course includes laboratory quizzes, pre-lab preparation, and notebooks and reports. The entire curriculum consists of 12 modules, and 5.35 covers the first 3 modules:\n\nModule 1 Fundamentals of Spectroscopy\n\nThis experimental module provides an introduction to the fundamental principles of the most common types of spectroscopy, including UV-visible absorption and fluorescence, infrared, and nuclear magnetic resonance. Emphasis is on the principles of how light interacts with matter, a fundamental and hands-on understanding of how spectrometers work, and what can be learned through spectroscopy about prototype molecules and materials. Spectra of small organic molecules, native and denatured proteins, semiconductor quantum dots, and laser crystals are recorded and analyzed.\n\nBasis of the research of Professor Keith Nelson.\n\nModule 2 Synthesis of Coordination Compounds and Kinetics\n\nThis experiment is an introduction to the synthesis of simple coordination compounds and chemical kinetics. Cobalt coordination chemistry and its transformations are illustrated in the preparation of [Co(NH\n)\n(CO\n)]NO\nand [Co(NH\n)\nCl]Cl\n, followed by the aquation of [Co(NH\n)\nCl]\n2+\nto yield [Co(NH\n)\n(H\nO)]\n3+\n, as detected by visible spectroscopy. Isosbestic points are observed in visible spectra, the rate and rate law is determined, the rate constant is measured at several temperatures, and the activation energy is derived for the aquation reaction.\n\nSimilar to the research of Professor Richard Schrock.\n\nModule 3 Fabrication of a Polymeric Light Emitting Device\n\nNOTE: Module 3 is not available on OCW.\n\nThis experiment involves the polymerization of a monomer to produce a high molecular weight conjugated polymer of the poly(phenylene vinylene) family. This material is fully characterized and then used to fabricate a light emitting device by spin coating and metal evaporation methods in an inert glovebox environment. The optical absorption and photoemission of the polymer device is determined and compared to the electrically induced emission. Students will learn about the theory of electroluminescent and photovoltaic devices including relative energy levels of organic materials and the nature charge carriers in organic polymers.\n\nBased on the research of Professor Tim Swager.\n\nGrading\n\nThis course is composed of three separate lab modules. Each module has similar grading schemes differing principally in the format of the final report (see below). Students will receive a distinct letter grade for each module upon completion of the module and after marks have been tabulated. Once all three modules are completed (not necessarily in the same semester), students will receive an overall letter grade for 5.35 that is based on an equal weighting of the grades for each of the three modules.\n\nACTIVITIES\n\nPOINTS\n\nModule 1--Grading Scheme\n\nLaboratory Quizzes\n\n10 points\n\nPre-lab Preparation\n\n10 points\n\nThe Factual Record (notebook, data, plots)\n\n20 points\n\nTechnique, Safety\n\n10 points\n\nOral Report (incl submitted data analysis)\n\n50 points\n\nTotal\n\n100 points\n\nModule 2--Grading Scheme\n\nLaboratory Quizzes\n\n10 points\n\nPre-lab Preparation\n\n10 points\n\nThe Factual Record (notebook, data, plots)\n\n15 points\n\nTechnique, Safety\n\n10 points\n\nWaste Inventory\n\n5 points\n\nWritten Report + Report Interview\n\n50 points\n\nTotal\n\n100 points\n\nModule 3--Grading Scheme\n\nLaboratory Quizzes\n\n15 points\n\nPre-lab Preparation\n\n10 points\n\nThe Factual Record (notebook, data, plots)\n\n15 points\n\nTechnique, Safety\n\n10 points\n\nWritten Report\n\n50 points\n\nTotal\n\n100 points",
  "files": [
    {
      "category": "Resource",
      "title": "Introduction To Experimental Chemistry",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/f1ae2a81a4b1f154ec39b07c6307054b_MIT5_35F12_GeneralInformat.pdf",
      "content": "INTRODUCTION TO EXPERIMENTAL CHEMISTRY\n5.35\n8th Edition Fall 2012\n\nTABLE OF CONTENTS\n\nSection 1\n1.1 Executive Summary\n1.2 Course Policies and Information\n1.3 The first and the last day in the\nLaboratory\n1.4 Grading\n1.5 Notebooks and Reports\n1.6 Academic Honesty\n1.7 Required Books\nSection 2\n2.1 Introduction\n2.2 Safety Training\n2.3 Laboratory Safety Equipment\n2.4 Safety Rules and Guidelines\n2.5 More On Safety in the MIT\nUndergraduate Laboratories\n2.6 Environmental Consequences of\nLaboratory Operations\n2.7 Procedures for Handling Hazardous\nChemical Wastes\n2.8 Hazardous Materials\n2.9 Responsible environmental practices\nSection 3\n\nExperimental Modules\n\n1.1 EXECUTIVE SUMMARY\nFor most of you, 5.35 will be the first formal laboratory course you will take at M.I.T.\nIt is the first part of a modular sequence of increasingly sophisticated (and challenging)\nlaboratory courses required of all Course V majors: 5.35, 5.36, 5.37 and 5.38. The\nobjectives of 5.35 are:\n\n- To illustrate a number of theoretical concepts previously encountered in\nlecture courses via practical examples in the laboratory;\n- To provide experience with a wide range of laboratory techniques and\ninstruments, ranging from simple gravimetric and volumetric measurementsto\noptical and nuclear-spin spectroscopy;\n- To develop planning and organizational skills for efficient use of laboratory\ntime;\n- To learn to rigorously analyze data, including uncertainties in experimental\nmeasurements;\n- To meet the standards expected of scientists in acquiring, interpreting,\nand reporting data;\n- To demonstrate the value of teamwork in scientific investigation;\n- To develop written and oral communication of scientific results;\n- To learn proper safety practices, especially the handling and disposal of toxic\nchemicals;\n- To foster collaborations with Chemistry faculty and learn about current work\nbeing done in their research labs as it relates to your lab work\n- To demonstrate that laboratory work can be both exciting and fun.\n\n1.2 COURSE POLICIES AND INFORMATION\n\n(1) THE UNDERGRADUATE LABS OPEN AT 1:00 p.m. for Chemistry 5.35\nstudents. Students may NOT arrive earlier and may NOT to do any work until his/her\nTA is in the lab.\n\n(2) THE UNDERGRADUATE LABS CLOSE AT 5:00 p.m. TAs must remain in the\nlab until his/her last student has left for the day.\n\n(3) 5.35 students SCHEDULED for MW Labs CANNOT COME INTO THE TR\nLabs TO WORK AT ANY TIME, AND VICE VERSA.\n\n(4)\nSELECT FRIDAYS from 1:00-4:30 p.m. may be scheduled as \"MAKE UP\nLAB\" days for students who require additional time due to excused absences or\nexperimental misfortune. Students may NOT come in to work ahead of their\nscheduled lab work unless they have the explicit approval of the Director of\nUndergraduate Laboratories.\n\nStudents who need to work on a scheduled Friday afternoon must see the Lab Director\nby 5:00 p.m. on WEDNESDAY AFTERNOON (for MW labs) and on THURSDAY\nAFTERNOON (for TR labs).\n\n(5) ANY absences from lab due to illness or other unforeseen emergencies or\ncircumstances require a note from S^3 sent to the Lab Director. Absences from lab due\nto sports or other extracurricular activities need to be discussed with the Lab Director\nwell ahead of time (1 week MINIMUM). If you have any weekly conflicts with your lab\nschedule, the lab takes priority. No accommodations will be made.\n\n(6)\nAt the end of each laboratory day, glassware and equipment must be cleaned and\nstored in your desk. Although students do not pay a lab fee, a fee will be charged at the\nend of the semester for lost, broken or stolen glassware and equipment.\n\n(7)\nAll requests for an extension of assignment due dates and oral reports in\n5.35 should be directed to the Lab Director. Extensions are only given for excused\nabsences and other crises beyond the reasonable control of students and are solely at\nthe discretion of the Lab Director.\n\n(8)\nPlease make a special effort to take extremely good care of the balances\nand other instrumentation so that they will perform well throughout the semester.\n\n1.3 FIRST AND LAST DAY OF LAB\nA. CHECK-IN PROCEDURE\nYour desk assignment will be determined at check-in. At your desk you will find the\nfollowing items:\n1. Laboratory desk inventory sheets listing the equipment contained in the desk.\n2. EH&S CLEARANCE FORM, which must be signed and returned to your TA\nduring your first work day in the lab.\n3. 5.35 Laboratory Manual. Additional copies of the 5.35 Lab Manual may be\npurchased from the Chemistry Stockroom\nA key for the lock on your assigned desk will be distributed during the afternoon.\nCheck the equipment in your desk against the inventory; the items in your desk may\nnot be arranged as outlined on the sheet. For convenience in checking-in and checking-out,\narrange your desk equipment conform to the organization of the sheet. Immediately report\nany discrepancies to your TA, who will give you a replacement slip to be used in obtaining\nthe missing item from the Laboratory Stockroom . When your equipment is in order,\nsign the check-in sheet and return it to your TA. You will not be registered for the course\nuntil the check-in procedure is completed. Once you have checked into the laboratory, you\nare responsible for the items in your desk, and even if the course is dropped the following\nday, it is your responsibility to check-out of the laboratory.\nB. CHECK-OUT PROCEDURE\nStudents will check out of the lab on the day designated in the course schedule.\nStudents who do not check-out as scheduled, will be checked out by the Laboratory\nStockroom Personnel. For this service, the charge of $50 will be billed to the\nstudent's MIT account. If you DROP the course, you are STILL required to complete\nthe check-out procedure, and you may arrange with your TA to check out at the time\nwhen you are leaving the course.\n\nAll glassware and other equipment must be replaced, if necessary, by purchase from the\nLaboratory Stockroom. Desk items will be checked against the check-in sheet.\nC. LABORATORY EQUIPMENT\nIn addition to the equipment in your desks, other items may be checked out from\n.\n\nthe Laboratory Stockroom on presentation of a withdrawal slip.\nReturnable equipment\nThese may be obtained from the Laboratory Stockroom for a limited period of\ntime. Most items are in short supply and must be returned at the end of EACH laboratory\nperiod. You will be notified if a returnable item may be stored in your desk for the duration\nof an experiment. You will be charged only if the equipment is not returned or is damaged.\nOnly those items issued to you will be accepted for credit. Fill out and submit a return slip\nwith each item returned to the Stockroom.\nNon-returnable Items\nBring the empty container or worn out item (filter paper box, septa, etc.) to the\nLaboratory Stockroom for refill or replacement.\nD. LABORATORY CHARGES\nYou will be charged only for your purchase of \"breakage,\" i.e., all returnable\nitems you fail to return to the Laboratory Stockroom and desk items that are replaced during\nthe semester or while checking out. Do not indiscriminately purchase non-returnable items\nfrom the Laboratory Stockroom without consulting your TA to determine whether you will\nneed them.\n\n1.4 GRADING\nA detailed overview of the URIECA program can be found online from the Dept of\nChemistry's web page.\n5.35 is composed of three separate lab modules. Each module has similar grading schemes\ndiffering principally in the format of the final report (see below). You will receive a distinct\nletter grade for each module upon completion of the module and after marks have been\ntabulated. Once you have completed all three modules (not necessarily in the same\nsemester), you will receive an overall letter grade for 5.35 that is based on an equal\nweighting of your grades for each of the three modules\nModule 1 - Grading Scheme\nLaboratory Quizzes\n\n10 points\nPre-lab Preparation\n\n10 points\nThe Factual Record (notebook, data, plots)\n20 points\nTechnique, Safety\n\n10 points\nOral Report (incl submitted data analysis)\n50 points\n100 Points Total\n\nModule 2 - Grading Scheme\nLaboratory Quizzes\n\n10 points\nPre-lab Preparation\n\n10 points\nThe Factual Record (notebook, data, plots)\n15 points\nTechnique, Safety\n\n10 points\nWaste Inventory\n\n5 points\nWritten Report + Report Interview\n\n50 points\n100 Points Total\n\nModule 3- Grading Scheme\nLaboratory Quizzes\n\n15 points\nPre-lab Preparation\n\n10 points\nThe Factual Record (notebook, data, plots)\n15 points\nTechnique, Safety\n\n10 points\nWritten Report\n\n50 points\n100 Points Total\n\nLaboratory Quizzes: 5 minute quizzes will be conducted at the beginning of most lab\nperiods, as determined by the instructor or TA. These quizzes are solely designed to\ndetermine if you have read the lab manual and have prepared yourself and understand\nthe experiments you will do that day.\nPre-lab Preparation: IT IS ESSENTIAL for students to read through and beprepared\nfor the experimental work expected for each day. You need to outline a \"game plan\"\nprior to each lab session. This outline must be done in the labnotebook before your\nscheduled lab day. The pre-lab is a brief outline of what they hope to accomplish and in\nwhat order. This outline does not need to haveenough detail to replace the lab manual,\nwhich you are allowed to bring to lab. The pre-lab should also include preparing clearly\nlabeled tables for data entry\n(e.g. reagent weights, absorbance values, chemical shifts, etc.) When applicable,\nrelevant equations that will be needed in lab should also appear in theprelab preparation.\nThe Factual Record: Data, procedure signed and dated. It is important to develop good\nhabits in keeping a notebook. Students must submit carbon copies of their notebooks to\ntheir TAs at the end of each lab period.\nTechniques, Safety:\nThe staff will use the following guidelines for assessing each student's\nlaboratory technique, proper waste disposal, safety, etc.\n1. Is the student is able to follow instructions?\n2. Does the student wear goggles/gloves and observe lab safety at all times?\n3. Does the student arrive in laboratory on time and ready to begin work?\n4. Is the student able to complete experimental work and leave the lab on time at\n5:00 p.m?\n5. Does the student come to the laboratory well prepared, having read theexperiment in\nthe lab manual and prepared a proper pre-lab?\n6. Is the student's work in lab well planned and well organized?\n7. Does the student work well with his/her lab partner and cooperate with the othersin\nthe lab?\n8. Is the student able to work independently?\n9. Does the student ask well thought-out and appropriate questions?\n10. Does the student handle balances and other instruments with care?\n11. Does the student clean-up after him/herself?\n\nWaste Inventory Sheets:\nWaste inventory sheets require you to track the chemicals you use in each experiment and\ntheir ultimate destination at the experiment's completion. For labs that include this, you\nmust keep track of your consumption after each lab day. Waste management is an\nimportant aspect of modern chemistry. These will be graded based on the quality of the\ntracking of chemicals and wastereduction ideas. Ideas will be considered for future\nincorporation into 5.35.\nNotebooks and Reports:\nThe TA responsible for the experiment will grade the notebooks and reports(see also\nSection 1.6). Your TA should discuss the comments and evaluations with you. Questions,\nsuggestions, comments, and complaints not being handled by the TA's should be directed\nto the course faculty or laboratory director.\nEach experiment will be graded based on the quality of the laboratory work and the\nwrite-up. All of the categories listed below will be considered in grading, but the relative\nweight will depend on the nature of the experiment (your TA will provide more details and\nadvice). Your final grade for each experiment will be based on:\n\n(1) Results: accuracy, yields, molecular characterization\n(2) Data Analysis: correct manipulation of data, error analysis, sample calculations.\n(3) Interpretation and Discussion of the data\n(4) Technique: efficient use of time, independence, experimental expertise.\n(5) Notebook report: organization, comprehension, completeness, lack of extraneous or\nirrelevant entries.\n\nLaboratory reports and any other written assignments are due on the dates\nannounced in lab . All written reports must be turned in by the report\ndue date to obtain a grade in the course.\n\n-\nReports should be dropped into the URIECA WRITTEN REPORT\nSUBMISSION BOX . Reports must be handed in by 1:10 P.M. on the due\ndate, otherwise they are considered late (for example, a Report turned\nin at 1:11 P.M. is one day late).\n-\nThe late penalty is 3n-1 grade points where n is the number of days late (n\not\ncounting weekend days).\n-\nReports not submitted after 5 weekdays following the due date (plus any\nextensions granted) will receive an irreversible mark of ZERO.\n\n1.5 NOTEBOOKS AND REPORTS\n\n1) Notebook\n\nA. General\n\nSeveral laboratory notebooks are commercially available at a\nvariety of prices. Acceptable notebooks must have numbered\nduplicate pages (i.e., each white page is followed by a colored page,\nperforated for easy removal). Carbonless copy pages are preferable\nto those requiring carbon paper. Most students will require a\nnotebook with 100 duplicate pairs of pages.\n\nB. Submission for Grading\n\nThe colored duplicate copy of the factual record of each dayʼs work must be\nhanded in to your TA after each page has been signed and dated by your TA at\nthe end of each lab day.\n\nC. General Guidelines for Maintaining the Laboratory Notebook\n\n1. Duplicate pages work best with a ball point pen (black or dark blue ink), press\nhard.\n2. Write on one side only.\n3. No erasures or whiteout:\n- If you make a mistake, cross it out neatly so it still can be read.\n- Write the correct entry on top or side.\n- If the entire page is incorrect, cross it out with a single diagonal line and\nstate the reason why it is believed incorrect.\n- Under NO circumstances should any original page be removed from a\nnotebook.\n4. Record all data and results with units and experimental error directly into\nyour notebook:\n- Data may NOT be transferred. Never record anything on scraps of paper,\nyour hand... Plan to have your Notebook with you wherever you will make\na measurement of observation.\n\n- If circumstances force you to record data remote from your notebook;\ndate, sign and tape it into your notebook.\n5. Start a new page for each experiment and each new major section:\n- Write the title of experiment, date, your name and your TAʼs name at the\ntop of each page.\n- Indicate if the page is continued from previous page.\n- NEVER skip a space for later additions. Always record data is a serial\nfashion except when it is appropriate to record it in a table.\n6. Be neat! Do not overcrowd a page:\n- If handwriting is large skip a line.\n- Write legibly. If you canʼt write legibly then PRINT. Illegible notebooks\nmay receive a grade of zero. Other things being equal a neat and well\norganized notebook is far preferable to a messy or poorly organized one,\nalthough neatness and organization are distinctly secondary to legibility,\naccuracy and completeness.\n\nD. The Factual Record: What to Record\n\n1. Title, date, your name and your TAʼs name on each page.\n\n2. Procedure and observations in the laboratory:\n- Keep a running account of ALL procedures carried out and observations\nmade during experimental work (including for intermediates).\n- Record observations: physical appearance, color, odor, physical\nproperties... (\"solution turned blue\"; \"crystals were small and powdery.\")\n- Sketch complex apparatuses; label parts: i.e., vacuum distillation, which\ncan be cited later as \"Laboratory notebook Fig. 1, p. 5.\"\n- In a synthesis, use tabular form to record information about reactants\n(volume and density of liquid; volume and concentration of solution).\n\nReagent name\nFormula\nSource\nGrade\nWeight\nMol. Wt.\n\nRecord all data and results. The crude yields of products or product mixtures\nshould always be recorded. If the product is separated into crude acidic, basic,\nand neutral fractions, the weight of each crude fraction should be recorded. If\nany of the crude fractions is a solid, its crude melting point should be recorded. It\nis extremely important to make every effort to account for all of the reactants in\n\nthe various fractions of crude products. Thus, for a chemist to begin a reaction\nwith 1.0 moles of a reactant and then to describe only the isolation of 0.13 moles\nof a product at the end of the reaction is inexcusable. The fate of the remaining\n0.87 moles of material should be indicated, even if no additional pure substance\ncan be isolated.\n\nFOR EACH PURE PRODUCT, IMPORTANT INTERMEDIATE OR DERIVATIVE\nRECORD THE TOTAL YIELD (BOTH WEIGHT AND PERCENTAGE),\nPHYSICAL APPEARANCE, COLOR ODOR AND PHYSICAL CONSTANTS\n(M.P., B.P., ETC.)\n\n3. Data: use tabular form wherever possible; e.g., weighing:\n\n50 mL beaker & compd.\n30.2684 g\n(indicate ± uncertainties)\n\n50 mL beaker\n\n20.2221 g\n\nweight of compd.\n\n10.0463 g\n\nExample: Synthesis and purification by recrystallization (include recrystallizing\nsolvents used):\n\nwt.\n% yield\nm.p.*\ncolor\nAppearance**\ncrude\nproduct\n\nrecryst. #1\n\nrecryst. #2\n\n* or other physical properties such as refractive index, optical rotation\n** including the crystalline form obtained (e.g., needles, prisms, plates, etc.)\n\nNote: always report both the weight and physical constants for the crude and\npure products.\n\nExample: Absorbance vs. Concentration\n\nsample #\nconcentration\nabsorbance\n\n4. Calculation and graphs.\nIf you need to use data to calculate some quantity:\n- Show formula.\n\n- Show a sample calculation, substituting the number in with appropriate\nunits.\n- If the calculation needs be repeated, it may be shown in tabular form.\nGraphs:\n- Use fine paper graph paper if the rulings in notebook are not sufficient.\n- Provide a reference to the data in tabular form, e.g., STC-I-42A.\n- Attach the graph to the notebook\n- Label axes and title with units.\nSpectra:\n- Attach the spectra to your laboratory notebook.\n- Label axis with units.\n- Provide a reference to the spectra in the procedure section of your\nnotebook, e.g., STC-I-42A.\n5. Data Analysis and Errors.\n- Perform appropriate error analyses\n- Examine and discuss the accuracy and precision of data.\n- Is the precision of your result reasonable based on the uncertainties of the\noriginal measurements?\n- Discuss possible systematic and random errors.\n\n6. Discussion, Interpretation and Conclusions.\n- Summarize the key results.\n- What do you conclude?\n- What difficulties did you have, if any?\n- What results are poor and why?\n- Suggestions for improvement.\n- The lab manual includes questions to guide your thinking.\n- Look at the grading sheet for each experiment for additional guidance.\n\n2) Written Report\n\n(1) Title. The title should be a brief, clear description of the subject of the report.\n\n(2) Abstract. The abstract is a concise statement of the major results obtained\nand should consist of no more than 2 to 4 complete sentences. It should be\nprepared after the rest of the report has been completed.\n\n(3) Introduction. The second page of the report should begin with the\nIntroduction, which is record of the experiment. The Introduction should contain\na brief statement of the experiment to be performed with balanced chemical\nequations where relevant, and a statement about the goal of the experiment. DO\nNOT just regurgitate the laboratory write up.\n\n(4) Procedures and Observations. Refer to the manual for descriptions of\nexperimental procedures, and be sure to record any variation from the suggested\nprocedure. Clearly labeled sketches of experimental setups are preferable to\nlengthy descriptions. When describing a synthesis, use a style that is similar to\nwhat is found in scientific journals (e.g., \"...a solution of 10.0 g of reactant A in 50\nmL of anhydrous ether was added drop-wise and with stirring over a period of 30\nminutes, to...\"). For each reactant the correct name, formula, source, grade or\nstated purity, weight (or volume and density in case of a pure liquid, or volume\nand concentration in case of a solution), should be recorded. Standard data\n(m.p., b.p. etc.) of reagents are not necessary. In addition, the volumes of any\nreaction solvents used should be specified. These data are very important and\nshould be noted in table form.\n\n(5) Summary of results. All data, yields, calculated results, etc. should be\npresented, in tables or graphs if applicable.\n\n(6) Calculations and Graphs. A sample calculation should always precede\nresults of calculations based on a formula. Notebook entries in this category\nshould be done in the laboratory. Experience should soon convince you that\nproblems with quality, internal consistency, and data validity are more quickly and\nrectified if detected immediately. Graphs should always be done separately on\ngood quality paper referenced in your notebook.\n\n(7) Analysis of Data and Errors. ALL ANALYSIS OF DATA MUST BE DONE\nINDIVIDUALLY. The reproducibility and precision of data should be examined\nand the major sources of errors identified. Although detailed statistical analyses\nof error are rarely called for, you should at least attempt to distinguish between\nsystematic and random error.\n\n(8) Discussion, Interpretation. The outcome of each experiment should be\nquantitatively and qualitatively discussed in relation to the goals of the\nexperiment as stated in the introduction. You should:\n\n(a) Briefly summarize the key results.\n\n(b) Explain the significance of your findings.\n\n(c) Explain any unusual difficulties or problems that may have led to poor\nresults.\n\n(d) Offer suggestions for how the experimental procedure or design could be\nimproved.\n\n(e) Answer all questions posed in the laboratory manual as part of the overall\ndiscussion (and not as a series of questions and answers).\n\n(9) Conclusion. A very brief (1-3 sentence) statement based on the data\ncollected and analyzed.\n\n(10) References. Present a numbered list of references to texts, monographs,\njournal article, standard computer programs.\n\n(11) Appendices. Hard copies of computer output (tables, spectra) should be\ninserted into an Appendix. Each Appendix should have a number and a title and\nreferred to in the body of the report.\n\n(12) Leftover unknowns and samples of prepared compounds are turned in to\nyour TA. Solid derivatives should be placed in a small vial and appropriately\nlabeled: Studentʼs name, experiment number, name of compound.\n\n3. ORAL REPORT\n\nAfter completing the last experiment, you will present your results and\nanalysis to your TA in the form of an INFORMAL ORAL REPORT. In this oral\nreport, you should tell your TA briefly:\n\n- What the experiment was all about;\n- Relevant theoretical background;\n- What happened in your experiment;\n- Your results and analysis;\n\nMuch of the preparation for your Oral Report will be the same as for a Written\nReport, described above. In particular, the data analysis, graphing and plotting,\nerror analysis, etc. should be carried through to completion and the results\nshould be presented in an appropriate form (tables, plots, etc.) for efficient\ncommunication.\n\nWHAT TO BRING TO THE ORAL REPORT\n\nA. A 4-6 page written summary of your experimental results. This should\ninclude the key results and conclusions and all appropriate data analysis, error\nanalysis, graphs, and other quantitative materials.\nB. Your lab notebook, raw data, analysis, results, plots (computer-generated or\nhand-written), and any other materials that are appropriate.\nC. Notes, books, and pretty much anything (inanimate) which will help you in\nyour discussion. You are, of course, expected to do your own data analysis\nand calculations. You may use any sources of help, including other students,\nwritten reports from previous years, textbooks, journal articles, etc. to aid your\nunderstanding the analysis as well as other aspects of the experiment. All such\nsources must be appropriately acknowledged in your report.\n\nYOUR PRESENTATION\n\nYou should plan on discussing your experiment for no more than 15-20\nminutes. Be aware that it is impossible to present everything that you know\nabout the experiment. Therefore, you should selectively plan what you have\nchosen to present. Throughout the time, your TA will ask questions pertaining to\nyour experimental work.\n\nThe objectives of the oral are to encourage you to learn as much as possible,\nand to find out how much you know in an efficient manner. In an informal exam\nof this type there is no substitute for knowing the material.\n\nAfter analyzing your data and mastering the material, organize your\npresentation. You will almost surely want to use some notes, especially to guide\nyou through theoretical discussions. You may use a blackboard if you wish. You\nmay also just show your (neatly written) notes to your TA on occasion, rather\nthan transcribe them onto the board. (This is especially convenient if there are\nmany equations.) Do whatever makes you most comfortable, without wasting\ntime. You will surely need to show your TA spectra, plots, etc. As always,\nattention should be paid to the presentation of data and results so that they are\neasily understood. Write neatly, label the axes of plots, indicate units, errors,\netc. Some students find it helpful to use a poster format to avoid shuffling\npapers.\n\nYou should come prepared to \"take the initiative\" and guide the oral exam.\nOtherwise your TA will be forced to take the initiative by asking you question after\nquestion, likely venturing into territory you prefer not to explore. Be prepared to\ngive an informal but well organized presentation. Your presentation should\ninclude the following elements, in sequence:\n\n- Introduction;\n- Background (why you did it);\n- Experimental (what you did);\n- Results (what happened);\n- Discussion;\n- Conclusions;\n\nOrdinarily, you will not turn in your original data. However, you must do so if your\nTA so requests after your oral exam. Your grade will reflect your ability to\nconvince the TA that you understand the most important aspects of the\nexperiment. The experiment grade sheet will be used by your TA as a guideline\nfor determining your grade.\n\nORAL REPORT LOGISTICS\n\nThe schedule for the oral reports will be posted in advance on the course bulletin\nboard. It is your responsibility to check the day, date, time and topic of your oral\nreport.\n\nItʼs that simple! The oral should not be a harrowing experience.\n\n1.6 ACADEMIC HONESTY\n\n\"Cheating, plagiarism, unauthorized collaboration, deliberate interference with the\nintegrity of the work of others, fabrication or falsification of data, and other forms of\nacademic dishonesty are considered serious offenses for which disciplinary penalties can\nbe imposed.\" (http://web.mit.edu/policies/10.2.html).\"\n\nStandards for Academic Honesty:\n\nThe expected behavior in the laboratory courses and the consequences of not following these\nstandards.\n\nIn order for a society to function, it should be based on trust. Decision\nmaking, from seemingly small everyday actions to important political matters,\npresumes a large component of ethical conduct. Unfortunately, the world is full\nof examples in which this trust is violated, making it sometimes hard to tell right\nfrom wrong. Nevertheless, this trust is sustained by the ethical conduct of each\nindividual.\n\nEvery decision has its ethical component. While it may appear that in a\nlaboratory course such as 5.35 it's really not difficult to tell right from wrong, there\nis always the potential for ambiguity or miscommunication on these issues: hence\nthis perhaps overly long statement. The MIT policy on academic misconduct is\nvery strict. \"MIT assumes that all students come to the Institute for a serious\npurpose and expects them to be responsible individuals who demand of\nthemselves high standards of honesty and personal conduct. Cheating,\nplagiarism, unauthorized collaboration, deliberate interference with the integrity of\nthe work of others, fabrication or falsification of data, and other forms of\nacademic dishonesty are considered serious offenses for which disciplinary\npenalties can be imposed.\"1\n\nWhere does ethical conduct come into the picture? Experimental scientific\nwork requires, among other things, background knowledge (why do we want to\ndo the experiment, what do we want to get out of it), experimental skills (how do\nwe do it), scientific ethics (what are we going to do with the information we obtain\nfrom it, what if the experiment fails, etc.), and a large dose of motivation\n(motivation to study, motivation to learn, motivation to discover, or even\nmotivation to obtain a good grade). Lack of motivation is one of the principal\ncauses of failure in experimental work, especially in a laboratory subject. This\n\n1 \"MIT Policies and Procedures\", (http://web.mit.edu/policies)\n2 \"On Being a Scientist. Responsible Conduct in Research\", 2nd. Edition, Committee on Science,\nEngineering, and Public Policy, NAS, NAE, IOM, National Academy Press, Washington, D.C., 1995.\n\nlack of motivation is usually accompanied by weak background preparation, lack\nof experimental techniques and skills, and in several cases, unethical behavior.\nMotivation is very personal and cannot be provided or taught. On the other hand,\nthe background knowledge you need to perform an experiment is mostly built\nduring your lecture subjects. It is in laboratory subjects such as this one where\nyou learn experimental skills as well as the basis of ethical scientific behavior.\n\nUnethical scientific behavior can take several forms. \"Fabrication (making\nup data or results), falsification (changing or misreporting data or results), and\nplagiarism (using the ideas or words of another person without giving appropriate\ncredit), all strike at the heart of the values on which science and society are\nbased.\"2 These different forms of unethical scientific conduct have a broad range\nof consequences depending on the seriousness of the offense. For example,\ncopying a lab report from a classmate or cheating in an exam is usually the\ncause of failing the class. Publishing forged data in a scientific journal can result\nin the loss of reputation or even ruin the career of a scientist. Hiding vital\ninformation can produce large economic damage or even lead to loss of life. (See\n\"www.onlineethics.org\" for more information and some important and very\ninteresting case studies.)\n\nFrustration is not a foreign feeling to a student or a scientist. It is not\nunusual that experiments fail the first time, the second or, sometimes, even third\ntime they are performed3. Occasionally the data collected during an experiment\nare not as easy to interpret as one would expect, or would like; or the compound\nfrom a synthesis doesn't look the way it is supposed to look or doesn't have the\nproperties it is supposed to have. What are the acceptable and unacceptable\nalternatives in cases like these? It certainly seems easier and less time\nconsuming to copy a lab report from previous years instead of spending a whole\nweekend on it. It could be tempting to forge or make up data or even copy it from\na classmate, instead of investing time repeating an experiment that failed or even\nadmitting that the experiment failed. Someone could argue \"It's just a lab report.\"\nEven apparently \"minor\" gestures like the one described above undermine the\nfoundations of the academic system and should be taken very seriously.\n\nGood scientific behavior is built throughout the formation of a scientist, a\ndoctor, an engineer, or a business person. \"The scientific research enterprise...\nis built on a foundation of trust. Scientists trust that the results reported by others\nare valid. Society trusts that the results of research reflect an honest attempt by\nscientists to describe the world accurately and without bias.\"3 The same applies\nto the field of health-care, business, engineering, and every aspect of life.\n\n3 For examples of experiments which failed on multiple occasions, just recall NASA's 1998 Mars Climate\nOrbiter and Mars Polar Lander missions. For details, consult the NRC report at\nwww.nap.edu/catalog/9796.html.\n\nUnlike in the lecture subjects, your actions in a laboratory subject can affect,\nand they usually do affect, the performance of your classmates. Imagine that\nby accident you contaminate a solution of a reagent that your classmates will\nuse after you. Would you inform your TA at the risk of losing your \"technique\"\npoints? Or would you keep silent and let your classmates perform the\nexperiment with a contaminated reagent?\n\nIn some cases unethical behavior seems to be the easy way out, and some\nstudents think they can get away with it. That is certainly not the case, and\nwe will do our best in defending the effort of those students who honestly\nwork toward academic excellence.\nExamples of conduct in 5.35 that would fall in the category of academic\ndishonesty, and would result in severe penalties\n\n-\nCHEATING on a lab quiz, including having your lab manual or notebook open\nduring a closed book quiz, will result in a grade of zero for that experiment.\n\n-\nCOPYING into your lab report any section of another student's lab report\n(from the current or a previous year) will result in a grade of zero for that\nexperiment, could result in a grade of F for the course, and could result in the\ncase being referred to the MIT Committee on Discipline.\n\n-\nMAKING UP and/or ALTERING DATA will result in a grade of zero for that\nexperiment and could result in a grade of F for the course and the case being\nreferred to the MIT Committee on Discipline.\n\n-\nPLAGIARISM (using material from other sources without giving appropriate\ncredit) will result in a grade of zero for that experiment, could result in a grade\nof F for the course and could result in the case being referred to the MIT\nCommittee on Discipline.\n\n- Adding a grade sheet or other materials to the written report after submission\nfor grading will be considered academic dishonesty unless the submission\ndate is adjusted and the late report penalty is taken.\n\n1.7 REQUIRED ITEMS\n\nRequired Items:\n\nA USB Flash Drive will be needed to collect data files. The U Lab is also outfitted\nfor wireless web/e-mail connectivity for your laptops. However, lab computers are\nto be solely used for data collection and are not connected to the network.\n\nA laboratory research notebook with numbered duplicate pages (i.e., each white\npage being followed by a colored page, perforated for easy removal).\nCarbonless copy pages are preferable to those requiring carbon paper. Most\nstudents will require a notebook with 100 duplicate pairs of pages. Notebooks\nwith 50 duplicate pages are available; however, a second notebook may be\nrequired to complete the course.\n\nYou are allowed to bring your lab manuals for use during the lab period.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "IR of Proteins Pre-Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/5088485f6cdac55e647e7a9673dea5da_MIT5_35F12_IR_ofProtPreLa3.pdf",
      "content": "IR of Proteins Pre-Lab\n1. What are the biological functions of the three proteins we will be using (Ribonuclease A,\nLysozyme and Myoglobin)?\n2. What does IR spectroscopy tell us about the proteins besides the fact that proteins are\ncomposed of amides?\n3. What are secondary structures of proteins? How does IR spectroscopy give information\nabout the secondary structure?\n4. Why do we take the IR spectra at different temperatures? What do you expect to be\ndifferent between the spectra at the different temperatures?\n\nEXTRA CREDIT:\nWhat other spectroscopic techniques are used to characterize proteins? List a few examples,\npick one technique and explain the technique in more detail? How does this technique compare\nwith IR spectroscopy? What different information does it give you?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "IR Pre-Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/42f06d2a71517c2a5503a9c416a91310_MIT5_35F12_IR-Prelab2.pdf",
      "content": "IR Pre-Lab\n1. What does an IR spectrum show about a molecule? What are the selection rules for Ir\nspectroscopy?\n2. What is the Isotope Effect? How does it relate to this lab? Please use an equation when\ndescribing this in the context of chloroform.\n3. What information is present in an interferogram? How is the interferogram converted\nfrom a pulse-like signal to the spectra that we know and love?\n4. What factors determine the ω0 of a stretch? What main stretches do you expect to see in\nthe IR spectrum of the essential oils and what are their energies?\n\nEXTRA CREDIT:\nThe IR spectra of gases shows a series of small lines that form a Rotation-Vibrational (ro-\nvibrational) band that shows the rotational features of the molecule. Why is this not visible\nin our IR spectra? Explain the different causes of broadening in a paragraph.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "NMR Pre-Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/fe71e06f472d8a96ea6ca8f473440873_MIT5_35F12_15MHzNMRPreLab4.pdf",
      "content": "NMR Pre-Lab\n1. View the image below (entitled \"Spin 1⁄2 nuclei in magnetic field B0\"), and explain the process\n\nit shows in a few sentences per step.\nhttp://www.chem.wisc.edu/areas/reich/nmr/05-hmr-00-nmr.htm\n\n2. Define the terms π-pulse and π/2 pulse. Explain their significance to the TeachSpin\nexperiment.\n3. What are the three different relaxation pathways measured in this lab?\n4. What does resonance mean in the context of NMR? What does it mean for a signal to be\noff-resonance in qualitative terms?\n\nEXTRA CREDIT:\nWhat causes the spins to precess during the relaxation processes? The model we generally\nlook at is called the Rotating Frame, which shows the spins moving about in a smooth\nessentially linear path for their relaxation (ignoring inhomogeneity), whereas the\nLaboratory Frame describes the spins as precessing about the z-axis as they relax back to\ntheir initial positions. Explain how the Rotating Frame accounts for this precession, and\ndescribe the shortcomings of this model in reality\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Oral Exam Rubric",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/b568b600206a030ec48cddb87a3b37ae_MIT5_35F12_RubrForMod1EXAM.pdf",
      "content": "Rubric for 5.35 Module 1 Oral Examination of\nExam taken on October 1/2 2012 at\n\nKey points:\nExtra Comments:\nPoints:\nExperiment 1\nExplain Interferometry\n- Interference\n\n- Role of sample/reference.\n\n- Fourier Transform\n\n_____/5\nExperiment 2\nBeer-Lambert\n- Demonstrate knowledge\nof Law & utility.\n\n_____/5\nExperiment 3\nAromatic Hydrocarbs\n- Explain PIB\n\n- Lengths of boxes\n\n- How well does the model\nfit the system? What\nimprovements should be\nmade? How is error\nevident in the model?\n\n_____/6\nExperiment 4\nQuantum Dots\n- What are QDots? Explain\nthe expression in the\nProcedure.\n\n- Calculate dot sizes.\n\n- Why is there broadening?\n\n____/6\nExperiment 5\nChloroform IR\n- Compare interferograms.\n\n- Explain isotope effect\n(and show in spectrum,\nincluding calculated\nfrequency shift).\n\n- Assign the major shifted\npeaks in IR spectrum.\n\n_____/5\nExperiment 6\nIR of Essential Oils\n- Assign peaks & explain\nlocation (force constants,\netc.)\n\n- Compare between oils.\n\n- How are the enantiomers\ndifferent?\n\n_____/5\nExperiment 7\nVT-IR of Proteins\n- What are secondary\nstructures in proteins?\n\n- How do secondary\nstructures appear in IR?\n\n- What information about\nsecondary structure can\nyou get from IR?\n\n- Show how the protein\nchanges over ΔT in the\nspectrum and explain the\nassociated molecular\nchanges.\n\n_____/10\nExperiment 8\n15 MHz NMR\n- Find , ,\n, and as\ndescribed in manual (and\noffice hours). Explain these\n\n_____/15\n.\n\nvariables and what\ncontributes to them.\n\n- Explain resonance and\nprecession in the NMR\nexperiment.\n\n- Why only one peak in FT?\n\n- Explain a π and π/2 pulse\n(include for each sample).\nBloch sphere may be\nhelpful.\n\n- Explain pulse sequences.\n\n- Compare 53% and 30%\nglycerol in H2O.\nExperiment 9\n300 MHz NMR\n- Why is 300 MHz better\nresolution?\n\n- What is the basis for\ncoupling?\n\n- Coupling constants,\nintegrations & identify\ncompounds.\n\n- Relative concentrations in\nmixture.\n\n_____/5\nDiscussion of\nLineshape\n\n(should be discussed at\nsome point in\npresentation)\n- Origin of broadness\n\n- Fourier transforms\n\n- Decay (how is it present\nin the spectra and what\ncauses it?)\n\n_____/10\nExplanation of\nAbs./Fluor.\nSpectroscopy\n- Explain difference\nbetween the\nexperiments.\n\n_____/5\nExplanation of NMR\nSpectroscopy\n(Theory)\n- Explain basic NMR\nexperiment.\n\n- Explain FID and FT to\nacquire spectrum.\n\n_____/5\nError Analysis\nDiscuss error in\nmeasurements/models and\nexperiments.\n\n_____/8\nOther (Students May\nChoose to Pick an\nExtra Type of\nSpectroscopy to\nDiscuss Here, or to\nElaborate upon a\nPreviously Discussed\nTechnique)\n\n_____/5\nReferencing\nProblems\nAre all of the relevant new\npieces of data/information\nreferenced appropriately?\n\n____/5\n\n____/100\n\nFor your presentations:\n\nWe will not have time in our 30 minute presentations to address every data point that you collected. In\norder to make sure that we cover everything, we will need to skip over some of the experiments. Some\nexperiments lend themselves to this more than others. Specifically, the more math-heavy experiments\nshould have more self-explanatory slides that allow me to look over your numbers beforehand so that\nwe do not need to dwell on things during the presentations. You will need to discuss all three different\nspectroscopic techniques we discussed during this lab, but I will ask that you choose one type of\nspectroscopy to talk about in more detail than the other two. Please discuss this one topic last in your\npresentation so that we can get through everything else first and will have time to delve into more detail\nat the end. You are of course welcome to go beyond the specific requirements of the course if you\nwould like, and I will only reward you for learning more, but you will not be penalized for only discussing\nthings directly related to these 9 experiments.\nYou will be required to send me a copy of your presentation by the midnight preceding your exam\ndate. This means that if you are presenting on Monday, you must send me the presentation by Sunday\nat midnight (technically 12AM Monday), and if you are presenting on Tuesday you must send me the\npresentation by Monday at midnight (or 12AM Tuesday).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "UV-vis Pre Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/8614ae52132cc8df71cf91033a82efe8_MIT5_35F12_Uv_vis_Prelab1.pdf",
      "content": "UV-vis Pre Lab\n\n1. What is particle in a box? What types of systems in the real world mimic this model and\nwhat assumptions make these systems fit the model (what are the assumptions made for\nthe model)?\n2. What is the Beer Lambert law? Where does it come from and what information does it\ngive us?\n3. When we turn on the spectrometer to take an absorption spectrum, what are we actually\nmeasuring with our spectrometer?\n\nEXTRA CREDIT:\nCalculate the concentration of your aqueous CoCl2 solutions in moles per cubic Smoot.\nExplain the significance of the Smoot in MIT history (including a summary of the famous\nstory!) in a paragraph.\n\nOr...\n\nWhen taking the UV-visible absorption spectrum of CoCl2, you will notice that the peak has\ntwo humps, representing two unique electronic transitions. What transitions do these\ncorrespond to? Hint: Look up the Jahn-Teller effect (cobalt II is a metal with 7 d-electrons,\nwhich is octahedral in water).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Written Report Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/f80e4e7c2ed486b32031dc6900925faa_MIT5_35F12_written_report.pdf",
      "content": "Module 2: Synthesis of Coordination Compounds and Kinetics\nWritten Report Guidelines\nFall 2012\nGeneral tips\nAll the writing should be in 3rd person.\nReports should be double spaced and should be ≃10 pages including figures.\nPlease hand in everything typed including graphs, calculations, and tables.\n3n-1 (n being the weekdays late) points will be deducted from late submissions/missing the oral\nreview.\nInclude full derivations in the reports.\nInclude all results even if they did not lead to the desired product.\nPut all raw spectra in an appendix at the end of your report (does not count as part of the 10\npages).\nPaper Format\n1. Your paper should have the following sections:\na) Abstract. It is about 1 paragraph single spaced summarizing what was done and the principal\nresults.\nb) Introduction. 1 or 2 paragraphs double spaced that establish a context for your research.\nc) Experimental Section. A concise description of what you did in the lab, written such that it\nwould be easy for someone to reproduce your work.\nd) Results and Discussion (may be 1 or 2 independent sections). Presentation of your results\nand some discussion as to their significance. This is the main part of the paper. In this case\nthe presentation of the results is expected to be more substantial than the discussion, though\nsome level of discussion is appropriate.\ne) Conclusion. A paragraph summary of your paper and creative extrapolation, if appropriate.\nNecessary components Your paper must contain the following information (this list does not\nrepresent the order that the information will appear in your paper):\nLinear plots of all the kinetic runs performed (total of 4). Table of experimentally determined rate\nconstants.\nYou should include a kinetics spectrum detailed enough to point out the isosbestic points, but\nyou do not need to include any more spectra than that. You do need a table of the absorbances\nat 550 nm at each sampling point.\nAssignment of peaks in infrared spectra(attach the spectra as an appendix). Tabulate IR data\nincluding the peak value and whether the peak showed a weak (w), medium (m), or sharp (s)\npeak.\n\n- Inclusion of all equations you used to analyze your data.\n- Plot from the determination of ε and the values of ε. (Tabulate abs vs. conc values)\n- Arrhenius plot, activation energy, and the pre-exponential factor A.\n- Identification and significance of isosbestic points. (one plot of spectra showing isosbestic\npoints is fine)\n- Scheme or schemes summarizing the syntheses and other transformations, showing the co-\nrrect structure of the cobalt complexes. (if you handwrite out the structures, include the\nhandwritten schemes as an appendix)\n- All relevant experimental information. (Procedures, amounts used, etc.)\n- Answers addressing each of the questions in the lab manual. These should be incorporated\nsmoothly into the body of the paper, where appropriate. For instance, explanations of some\nquestions may be best placed in the introduction, while others may be better next to plots\nof data in the results and discussion section.\nAdditional Comments\n- Make sure all your figures and schemes are labeled and have captions.\n- Make sure plots have the labeled axes and that all reported values have the appropriate\nnumber of significant figures and the correct units.\n- Use citations where appropriate, in an appropriate format. Definitely cite the lab manual, as\nwell as any other resources you may use to find data or information.\n- Keep in mind that your Experimental section should come before your Results and Discus-\nsion.\n- The lab manual instructions for writing the procedure and introduction are good resources,\nuse them well.\nGrading Scheme.\nPoints\nAbstract\nIncluded appropriate information\nIntroduction\nSuccessfully contextualized the work\nExperimental\nIncluded all required information\nCorrect IR assignments and spectra\nIncluded synthetic schemes with correct molecular structure\nResults\nLambert-Beer Plot and ε value (with tables)\nPlot of spectral changes vs. time, identified isosbestic points.\nPlots of all (4) kinetic runs and rate constants (with tables)\nArrhenius Plot and Activation Energy (with tables)\nDiscussion\nInclusion of equations used to get kinetic parameters\n(Provided answers to lab manual questions)\nOther\nOrganization (proper placement of components in sections) and citations\n100 Total\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Module 1 Expectations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/446fc9f1515154f648df16791a6c573e_MIT5_35F12_Module1Expectat.pdf",
      "content": "Module 1 Expectations\n5.35\nFall, 2012\n\nStudents should come to the laboratory prepared and on-time. This means that you should come to class\nhaving reviewed the relevant lecture notes, read the procedure for the relevant experiments and completed\nthe pre-lab assignment.\nQuizzes\nThere will be a quiz at the beginning of each lab period which will cover material about the labs you will be\ncompleting that day. These quizzes are designed for all of you to do well on, so long as you have read through\nthe lab manual!\nPre-Labs\nThese are designed to prepare you for the labs and to give you a chance to look up any extra details that might\nbe helpful for the experiments. All pre-lab assignments should be typed in a legible, standard font (Arial,\nTimes New Roman, etc).\n\nAll pre-labs will also have an extra credit question, which is completely optional, and will not be accepted if it\nis longer than one page typed (though most extra credit questions should only take a paragraph or two).\nThese extra points will count towards your overall grade in the course in the way that helps you most. Partial\ncredit will be given liberally on these assignments, as they are much more difficult than the required\nassignments for the experiments.\nNotebook Etiquette\nIn addition to your typed pre-labs, you will be expected to keep a notebook that has records of your data from\nthe actual labs. Before coming to lab, you will need to write out the samples/reagents you are using and any\nrelevant safety data about these compounds. The carbon copy of this page must be handed in with your pre-\nlab. When collecting data, you will be expected to keep track of any relevant values and data from the\nexperiments in your lab notebook. The carbon copy of this sheet will be handed in at the end of the lab period.\nOral Exams\nOral exams will be conducted during the week of October 1-2. These will be 30 minute exams I which you\npresent your findings from the lab in a PowerPoint presentation. This is designed to be a presentation and\ndiscussion about your results and the theory of the different experiments we have conducted over the\nsemester; it will NOT be an interrogation! When preparing your presentation, make sure that your data is\norganized in a clear and logical manner that allows me to follow your results easily. Be sure to include\nreferences (following the American Chemical Society standard formatting) on all slides that include\ninformation that is not common knowledge or collected by you! If you learned from the lab manual, you must\nreference that as well.\nIn the oral exams, I will ask you questions about your data analysis and about the theory behind the\nexperiment and the spectrometers. Please be familiar with the different techniques to the extent that you are\n\ncomfortable talking about them. If you prefer using diagrams to discuss theory, I recommend including a few\nextra slides at the end of the presentation with images or schematics that you can talk about if asked.\nYou will be required to email the file to me the evening before your exam (by midnight). Students who do not\ncomply with this will not be allowed to sit the exam.\nNote: Be sure to save your files as images as well as data-sets when you conduct your experiments! This will\nbe much easier to deal with when you begin organizing your oral presentations!\nGrading\nYour grade for Module 1 will be made up of your quiz scores, pre-labs, technique, and your oral exam. The\nbreakdown for the grade is given below.\n10 % Quizzes\n10 % Pre-Lab Assignments\n10 % Technique\n20 % Factual Record (notebook, data analysis)\n50 % Oral Exams\nYour technique grade will reflect your preparedness. This does NOT mean that asking questions will make\nyour grade go down!! It will reflect your ability to know (roughly) what to do, and mostly, it will reflect your\nability to analyze your results effectively. Your results will not be perfect!!!! A person with a high technique\ngrade will be able to explain the experiment, including the unexpected results and will be able to explain the\nsource of error and other unexpected factors in the results.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Module 1 Experimental Procedures",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/b10d5d9d08da81f1e54e34526de5d082_MIT5_35F12_Mod1_Experiment.pdf",
      "content": "Module 1 Experimental Procedures\n\nExperiment 1. What's in the Spectrometer?\n- Identify\nand ident\nelements\nify the pa\nof\nth\nthe\nof t\nspectrometer\nhe light.\nshown in Fig. 9 in the open spectrometer unit\nExperi\n\nment 2. Lambert-‐Beer's Law\n- Prepare\nflasks.\n0.01, 0.02, 0.03, 0.04 and 0.05 M aqueous solutions of CoCl in volumetric\ncalculations.\nhexahydride\nWhen\n(CoCl\nmaking\n6H\nup\nO)\nyour\nand\nsolutions,\nbe sure\nnote that you will be using cobalt\n\n-\n0.01\n0.05 M\n-\nchloride\nand\nYour\n.\nTA will prepare a solu\nto\ntion\nuse\nwit\nthe\nh unk\nproper\nnown\nmolecular\nconcentrat\nmass\nion, b\nin\netw\nyour\neen\nMake sure that the absorbance spectrometer is\ncomputer via USB port--you shoul\nplugged in and connected to the\n-\nKimwipe, and place the cuvette in the holder\nSpectraSuite program. Fill a cuvett\nd\ne w\nbe\nit\nable\nh w\nto\nater, w\nhear\nipe t\nits f\nhe sides of t\nan running--\nhe cuvet\nand ope\nspectrometer\nUnder\n\nte w\nn th\nit\ne\nh a\n\nthe Spectrometer\npicture, expand\nmenu\nmenu\nselect\n[+], and\nRescan\nexpand\nDevices.\nProperties\nFin\n[+]\nd the absorbance\nspectrometer\nserial number\ns\ncorresponds to the spectrometer.\nto check that the\n-\nthe screen, right click the spectrometer picture and choose Show Graph.\nand\nll\nselect Remove Spectrometer. If ther\nRight\ne is no\nclick\ngraph\non\ndis\nany\nplayed\nother\non\nCl\nIntegration\nick the Pause [\n-\nCorrection box. This box should remain checked throughout all experiments.\n►\nTime =\n]\nbutton\nms, Average\nand change\n= 10,\nthe\nand\nparameters\nBoxcar = 10.\nat the\nCheck\ntop\nthe\nof the\nElect\nscreen\nric Dark\nto\n\nCl\nin\nick\nthe\nPla\nspectrum\ny [\n] to\nover\nbegin\ntime,\nthe ac\ncl\nq\nick\nuis\n\niti\non\non\nt\n.\nhe\nWhen\ndark\nyou\nlight\nno\n\nlonger\nbulb [\nsee\n]\nmajor\nreference\n\nto stor\nfluctuations\nspectrum. Check the Strobe/Lamp Enable box and repeat, clicking\ne the\non\nda\nthe\nrk\n-\nyel\nshould be accessible. C\nlow light bulb [\n] t\nlick it to enter absorbance mode\no store reference spectrum. Now\nand\nthe\nthe\nAbsorbance\n-\nRemove\nn click Pause\n[\n.\n] icon\n\nand empty your\nTake\nthen fill with the solution. P\ncuvette.\na spectrum by clicking\nlac\nPlay,\ne in\nWash\nholder.\nwith\n\nyour first sample solution, empty, and\nspectrum. You can change the viewing\nthen clicking\nparameters\nPause\nof\nwhen\nthe graph\nyou feel\nusing\nyou\n[\nhave\n] to\na\nauto\ngood\n-‐\nsca\nparameters\nle, [\n]\n,\nto\nand\nvert\n[\nical\n[\nof the graph using the scrolling wheel on the mouse.\n]to\nly scale the\npan\nspectrum,\nthe spectrum.\n]\n-\ntoggle and\nYou\nto manually\ncan also zoom\nset\nin\nthe\nand\nzoom\nout\nCl\nth\nick\ne File\nthe\nmen\nSave\nu.\n[\nUnder\n] icon\nDesired\nto save\nSpec\nthis\ntrum,\nspectrum.\nyp\nselect\n\nthat the file t\ne is \".OOI\" and the appendage to\nDo\nProcessed\nt\npressing\nthe\nn'\nSave.\nfile\naccess\nname\nSpectrum\nthis\nis \".ProcSpec\"\nfun\nand\nction\nm\nthrough\nake\nbefore\nsure\nwindow first.\nIf the Save button isn't activated, try clicking elsewhere in the Save\n\n- Remove,\nthe new solution,\nempty, and\nacquire\nrinse the\na new\ncuvette\nspectrum,\nwith your\nand save.\nnext sample.\n-\nsolution.\nContinue\nFill\nfor\nthe\nall\ncuvette\nsamples\nwith\nof\nAfter all spectra have been taken, click Overlay Spectral Data [\n] icon and select\none of your saved spectra. Select Processed and\n-\nyour\ngraph.\nprocessed\n\nspectra. This should overlay\nall\nthen\nof\ncl\nyour\nick\nspectra\n. Repeat\nonto the\nfor\nsame\nall of\nC\nwindow\nlick on\nat\nthe\nthe\nspectrum\nbottom\ngraph\nof the\narea,\nscreen\nthen\nand\ntype\nhit e\n\"\nnter.\n\"\nT\ninto\nhe a\nthe\nbsorb\nWavelength\nance val\n(nm) text\n-\nresp\noverlaid\nof\nDo a\nect\nspectra\nues\nive col\nat 510 nm will\nyour\nlinear fit\nors.\nto t\nR\nhe\necord\nfunct\nt\nion\nhese\nA\nval\nappear\nues in you\nto\nr\nthe\nnoteb\nright\nook\nof\n.\nthe text window in their\napproximate\nunknown sample\nuncertainty\nand using\nof the\nthe\n= f(c\nfit\n). Read\nmeasurement?\ncalculate\noff the\nits\nva\nconcentration.\nlue of the absorb\nWh\nance\nat\nfor\nWhat do you think the biggest\nis th\nthe\ne\n\nExperi\nsou\nm\nrces\nent\nof\n3.\nerror\nArom\nare?\nati\n\nc Hydrocarbons\n- Prepare\nand place\na\ni\ncuvet\nn hold\nte\ne\nha\nr.\nl\nSet\nf to\nup\ntwo\nthe\n-‐thi\ninstrument\nrds full of hexane,\n-\nObtain and store the dark spectrum and the reference spectrum of hexane.\nusing the\nwipe\nparameters\nthe sides\nin\nwith\nExperiment\na Kimwipe\n\n2.\nAdd\nScale\na\nthe\ndrop\ngr\nof\naph\nsaturated\nsuch that\nnaphthacene\ndropwise until peaks are\nyou can resolve\nto the\npeaks,\nhexane\nand\ncuvette\ncontinue\nand\nto\nacquir\nadd\ne\nnaphthacene\na spectrum.\n-\nspectrum each time, but be sure to rinse the cuvette with hexane each time.\nprocedure for anthracene and\nvery\nnaphthalene\nprominent.\n. It\nSave\nis not\nthe\nnecessar\nspectrum\ny to take\nand\na\nrepeat\nreferen\nthe\nce\nOpe\nOptions\".\nn your\nUnder\nsaved\nthe\nspectra. Right click on spectrum graph and select \"Graph Layer\n- At\nSelecti\nthe\non w\nbottom\nindow\nright\n. Sel\nPeaks\nect the Show\ntab, select\nPea\nyour\nk Ba\nspectral\nine Layer\nline\nand\nfrom\ncorner of the graph,\nsel\nselect the Peaks\npr\n[\ne\nthe\nss OK\nSpectrum\n.\nSource\n] icon. The Peak\nFin\nPeak\ndin\nFinding\ng toolbar\ntool\nshou\nbar\nld a\nto\npp\nopen\near direct\nthe\nly\nPea\nab\nk\nove.\nPropert\nSelect\nies\nthe\nw\nC\nindow\nonfigur\n.\ne\nSet\n[\nthe\n] icon in the\nabsorbance\nWidth until the\nsomewhat\nnumber\nbelow\nof peaks\nthe\n-\nfound\npeaks of interest and increase the Minimum\nBasel\nPeak\nine\n\nyou see on the graph. Click \"Close\" to exit\nappr\nthe w\noach\nind\nes\now\nthe\n.\nnumber of significant peaks\nUsing\neach of\nthe\n-\nthe\nPrevious and\nin the Peak Finding t\nsignificant\nool\npea\nNex\nks\nt\na\nPeak\nnd\n[\nbar) in your not\nrecord\neb\nthe\n] buttons, position the green cursor on\nUse the wavel\n→\nength of the peak with the\nook\nwavelengths\n.\n(from the Wavelength box\nfor\nestimate\nthe n=1\nthe\nn=2 transition. Using the\nhighest\none-‐dimensional\nwavelength\nlength, l, of each compound. Plot the length as a\nParticle-‐\nas the\nin\nph\n-‐a-‐Box\noton energy\nof coordinated hydrocarbon rings.\nfunction of the number\nmodel,\n\nExperiment 4. Fluorescence of Quantum Dots\n\n-\n-\nTa\ndescrib\nke ab\ned\nsorpt\nearl\nion\nier.\nspectra of three samples of quantum dots using the procedure\nan\nLocate\nelectrical\nthe fluorescence\noutlet, in pulsed\nspectrometer\nflash mode\n. Check\nand\ntha\non.\nt the\nPlac\nXe\ne\nl\n\nig\na\nht\ncuv\nsou\nged\nwindows containing\ndots\nette\nrce\nwi\nis\nth\npl\n\nu\nfou\ng\nquantum\nr cl\nin\near\nto\n-\ndet\nAs\nect\nbefore,\nor shou\nmake\nld be\nsure\nplugged\nthat\nin\nSpectraSuite\nto the\nin\nhol\na\nder\nstand\nat\n-‐\n90°\nalone\nis recognizing\nangl\ncuvet\ne.\nte holder. The source and\n-\nRescan\nspectrometers from the menu.\nDevices, checking that the serial number matches,\nthe\nand\nright\nremoving\ndevice\nany\nby\nother\nusing\nC\nand\nlick\nexpand\nthe spectrometer\nrange of the\n[+].\nwavelengths\nBe sure\npicture\nthat these\nand under\nfluorescence\nthe expanded\nwavelength\nmenu\nparameters\n[+], select Acquisition\nobtained from your absorbance measurements.\nare\nIf\nin\nnot,\nthe\n-\ncontact your TA.\nMake\na 1 second\nsure that the acquisition\nthe Strobe/Lamp Enable box. You should hear an electrical whine from the\nintegration time, 1 scan\nis paused,\nto average,\nand then\nand\nchange\na boxcar\nacquisition\nof 10. Also,\nparameters\n-\ncheck\nlamp.\n[ √\nto\n]\nAcquire\nmaximum peak.\nspectra\nSave each spectrum.\nfor each sample, recording the color and the wavelength of the\n- Use\nquantum\nthe\ndots.\nequation\n1.70\nto estimate\nand\nthe\neffective masses\nFor CdSe, E\n=\neV and\n= 0.13\n=\n\n0.45\nsize a\nar\nof\ne th\nthe\ne\neither\nhole effective\nband do\nmasses,\nin the\nwhich\nconduction\ngap\naccount\nand\napproximately\nm *\nc\nme\nm *\nv\nme\nnot move freely) where m\nv\ne\nalence bands re\nis\nfor the\ns\nan\nfact\npectively el\nthe mass of\nelectron.\nthat the\n(\n\nHow\nelec\nectron\n\ntr\nw\no\nel\nns\nand\nl do\nin\nyour\nsou\nresults\nof discrep\nagree with the\n\nrces\nancy?\nparticle in a box expression? What do you think might be\nExperiment 5. Chloroform\n-\nth\nStudy\na sample\neir func\nthe\nti\nsetup\nons. Be\nand\nsure\nidentify\nto sketch\nthe elements of the homemade interferometer and\n-\nFTIR spectrometer?\nholder and detector be placed\nthe interferometer\nto make the interferometer\nand take notes.\na\n\nfully\nWhe\nfunctional\nre should\nTurn\nyou move\non the\nthe\nlaser source. Can you see the interference p\ninterferometer would\ndelay stage?\nbe varied\nTry\nto\nit\ntake\nout.\nan\nDuring\nFTIR\na\nspectrum?\nscan,\nattern\nwhat\n? What\nelement\nwill happen if\n-\ninterferogram look like with and without a sample?\nWhat would\nof\nthe\nthe\nMove to the Nic\nS\nole\ndow\n-\ncomputer interface. Under the Win\nExp et\nt 380 FT-‐IR and open the OMNIC software program on the\nCl\nIR\nick\nscan\non\n.\n\nt\nUnder\nhe\nthe C\nicon\nollect\nto\nheader,\nopen a dia\nset\nlogue\ntop menu, click on New Window.\nwindow that allows you to configure the\nto Interferogram. Click OK to exit.\nthe number of scans to 16 and \"Final format\"\n\n- Put\nperform\nan empty\na background\nthin cuvette\nscan\nin\nscan of your sample. What\n.\nthe\n\nholder and flush with nitrogen for 60 seconds, and\n-\nWhat do you expect to see in the spectrum?\ncan\nFill\nbe\nthe\nconcluded\ncuvette with\nfrom\nchloroform\nthe observed\nand then\ninterferogram?\nperform a\nSet the spectrometer\n-\nconcl\nand making\nusions.\nthe appropriate\nto the transmission\nchange, and\nmode\nrepe\nvia\nat\nclicking\nthe proc\nthe\nedur\nEx\ne\np\n\nto\nSet\nv\n\ne\nicon\nrify\na\ny\nga\nour\nin\n\nseveral\nWhere do\npeaks\nyou\nfrom\nexpect\nthe\nthe\nCH\npeaks\nCl3 dat\nto\na a\nappear\nnd calcu\nif\nla\nthe\nte w\nsample\nhere the\nis deuterated\ndeuterated\n(C\npea\nDC\nks\nl3)?\nshou\nPick\nld\n\nbe\nWh\n.\nabout μ\n-\nat\nRemember\ndo\nthe\n?\ne\n\ns K represen\nrelation\nt? Would its va\nfrom\nlues b\nour\ne differen\ndiscussion\nt for\nof\nCHCl\nharmonic\n3 and CD\noscillators.\nCl3? What\nRepeat the experiment with deuterated chloroform and compare your results to\nExperi\nprediction. What are some possible sources of any\nment\n\n6. Essential Oils\ndiscrepancies?\n-\n-\nPut\nwith nitrogen for 60 seconds to remove water and C\nan IR card in the card holder in the FTIR instrument,\nO2 vapors\nclose\n.\nthe cover and flush\n-\nRecor\nan IR card, repeat the procedure and take the spectrum of the sample\nd the background spectrum. Put several drops of limonene on\n.\nthe window of\n-\nRepeat the procedure with the carvone sample\nTry\nor internet\nto assign\nsources.\nas many\n\nfunctional groups in the spectrum as possible using literature\n-\nrelatively low? Recal\nWhy\nl the ex\nare\npression\nsome vibrational\nfor the vib\nfrequencies\nrational reson\nrelatively\nance frequ\nhigh\nency\nand\n\nsome\n.\nWhat\ndifferentiate between S and R enantiomers using FTIR ab\nare the differences between the spectra of the two compounds?\nt\nCa\nω\nn\nsorp ion spectroscop\n\ny?\n\nyou\n\nExperiment 7. Protein Secondary Structure Determination\no\n- Before starting, set the temperature on the heating bath to 50 C and turn on the peristaltic\npump. While you are taking room temperature spectra, the bath will heat up.\n- Using D2O as the solvent, make three 100 μL solutions with 20 mg/mL concentrations of\nthe three proteins you'll be studying: one for Lysozyme, one for Myoglobin, and one of\nRibonuclease A.\n- Purge the spectrometer with nitrogen for 4 minutes and collect a background spectrum of\nthe empty spectrometer with 2 cm-1 resolution and 16 scans. Save the spectrum. In\nexperimental setup, set this background as the default background.\n- Clean the CaF2 windows and Teflon spacer with water. Dry windows with lens paper.\nDry Teflon spacer with a kimwipe.\n- Load the CaF2 cell with 30 μL of D2O. Do not use the heating coil. The cell should be\nassembled in this order: tapered metal ring, tapered metal ring (opposite orientation),\nthick flat metal ring, lead gasket, CaF2 window, 50 μm Teflon spacer, CaF2 window, lead\ngasket, thin flat metal ring, threaded sealing cap. To load the cell, carefully slide in cell\n\ncomponents up to and including the Teflon spacer. Drop 30 μL of sample into center of\nwindow. Gently lower remaining stacked components onto sample drop and screw the\nthreaded sealing cap down. Tighten firmly by hand until you encounter resistance.\nVerify that there are no bubbles in your clear aperture.\n- Place the entire cell in the Nicolet spectrometer and purge with nitrogen for 4 minutes.\n- Collect a D2O spectrum with 2 cm-1 resolution and 16 scans. Save spectrum. Collect a\nD2O background spectrum, save, and set it as the default background.\n- Remove cell, dissemble, clean windows with water, and load Lysozyme.\n-\n- Collect a 16 scan, 2cm 1 resolution spectrum of Lysozyme. Save the spectrum.\n- Remove cell, dissemble, clean windows with water, and load Myoglobin.\n- Collect a spectrum after purging.\n- Repeat for RNase A.\n- After collecting a room temperature RNase A FTIR spectrum, unscrew sealing cap and\nslide on heating coil. Retighten. Make sure the heating coil orientation is correct such\nthat it will stick out of the top window of the spectrometer when the cell is loaded.\n- After purging, set the temperature of the bath to 100oC.\n- Collect spectra of RNase A as the temperature rises at ~7oC increments. Save the spectra\nand record the temperature. The maximum temperature should be ~81 oC.\n- Turn off heater and allow to cool. When the cell is cool enough to handle, disassemble\nand clean.\n- Compare Lysozyme, Myoglobin, and RNase A room temperature spectra in the 1600-\n1700 and 1900-1300 cm-1 ranges. Can you distinguish different secondary structures\nfrom the Amide I spectra?\n- Compare the RNase A temperature-dependent spectra over the same ranges. To observe\nchanges, subtract the room temperature spectrum from the others (control, right click\nselects both and then select the subtract button). What changes? What is happening to\nthe protein as you heat it?\n-\nExperiment 8. 15-‐MHz NMR\n\n-\n-\nAppendix\nthis experiment.\nB contains some useful information and photographs to help you through\nFill\nfrom\na\nthe\nsample\nmagnet and insert the sample.\ntop of\nvial\nthe\nabout\nvial, t\n3⁄4\nhen\nfull\npl\nof\nace\net\na\nha\npl\nnol\nast\n.\nic\nPl\nca\na\np\nce\non\nan\nthe\nO-‐ring\ntop,\nabout\nlift the\nhalf\ntop\na\npane\ncentimeter\nl on the\n\n- Turn on the 15 MHz spectrometer and the oscilloscope.\n\non the spectrometer are connected as shown in the figure below.\nVerify that the blue cables\n-\n\nis\nStep\noff.\n1:\nThese\nView pulse.\nswitches\nMake\nlet us\nsure that the\nA pulse switch is on and the B pulse switch\ndisconnect\nconnect A-‐B\nthe\nOUT\nblue\nto C\ncable\nhanne\nfrom\nsend electronic signals (pulses) to the magnet. Next,\nloose. Remember this configuration;\nl 1 on\nthe\nthe\nA-‐B\noscil\nIN\nloscope,\nport on the spectrometer and use it to\npulse generator's input into the magnet)\nevery\nyou\ntime\nl\nyou\netting\nwant\nthe\nto\nMIXER\nview\nOU\nthe\nT cable hang\nwill connect the cables in this\npulse (the\nuntil\nChange\nyou\nthe\nare\nparameters\nable to view\non\nth\nthe\ne puls\noscilloscope\ne. Meas\n(vertical and horizontal zoom and\nfashion.\npan)\nWh\nthe\ny\npuls\nwo\ne\nuld\nus\nwe\ning\nwant to\nthe curs\nus\nors\ne\n\na s\non\nq\nth\nuar\ne o\ne\ns\npuls\ncillos\ne\nco\nur\nfo\npe\ne and record the length, or duration, of\nr th\n. Wh\nis pur\nat\npo\nis th\nse\ne\n?\n\npurpose of the RF pulse?\n\n- Step\nreturn\n2:\nin\nView\ng the\nFI\nca\nD\nbl\n.\nes\nSet\nto\nup\nthe\nthe\norig\noscillo\ninal set\nscop\nup\ne\n(A\nto view\nOUT to the oscilloscope). This is the\n-‐B IN and\nthe\nA\nfree\n-‐B OUT\nindu\n\nct\nre\nion\nconne\ndeca\ncte\ny\nd\n(FI\n, MIXER\nD) by\nreceivin\nexperiment\ng the\nto\np\nobserve\nulse. Adjust\nthe FI\nthe\nD, the\noscilloscope\ntime-‐domain\nconfiguration\nresponse\nyou will\nof\nuse\nthe\nthr\nsample\noughout\nafter\nthe\noscil\nsignifica\nlating\nnce\nsigna\nof this\nl; this\nvalu\nis\ne?\nt\n\nhe\nHow\nFI\n\nD\nis\n.\nt\nMe\nhe\nas\nFI\nur\nD\ne the\nso\nf\nthat\nque\nyou're\nsignal\nr\np\ne\nrodu\nnc\nced?\ny o\nW\nf th\nable\ne F\nto observe an\nsignal?\nhave to mix\nhy\nID\nWhat information does it give us? Why do we\nis\nthe\nit\n.\nan\nWh\noscil\nat i\nl\ns\na\n\nt\nth\ning\ne\n-\nsignal\nWith the\nfrequ\nfrom the sample with a reference signal?\nStep\nthe\ncoming\nfrequency\nency\n3: Tun\nadju\ne\nand\nst\nto\nset\nreson\nwatch\nto coa\nan\nthe\nrse,\nt frequen\noscilloscope.\nturn th\ncy\ne tuni\nan\n\nng\nd optimize\nknob on the\nsample\npulse\n\noscillations in the FID should change as you\nThe\nadjust\nintensity of the FID\ngenera\nheight.\nand\ntor\nnumber\nto adjus\nof\nt\noscil\nyou've\nlations\nfound\nshoul\nthe resonant\nd decrea\n\nse\nfrequency,\nas you get\nyou\ncloser to the\nthe\nreso\ntuning.\nnant fr\nThe\neque\nnumber\nncy. Whe\nof\nn\nint\noscil\nensit\nlations.\ny of\n\nthe\nNow\nFID\na\na\ndjust\ns you\nthe\ndo. Not\nheight\ne the\nof\npea\nthe\nshoul\nsample\nd see\nk that changes\nin\nan\nthe\nexponential\nthe\nmagnet and\ndecay\nmost dramatically\nwatch\nwithout\nthe\n\nremember it--later, when you need to \"reach\nand\n- Con\nsample is at the optimum height and\nFID\",\ncept\nthis\ncheck:\nis the peak you'll be monitoring.\nyou the see t\nAdju\na maximum\nst\nin the intensity of the\nBefore proceeding, check that yo\nhe l\nu und\nargest\nthe ru\nFID.\nbber\n\no-‐ring so that the\nthat cause the FID signal to decay. What are their relative\ner\ntime\nstand\nframes?\nthe thre\nWhat\ne proces\ndoes\nses\nit\n\nmean to have a 90 degree or a 180 degree (π/2\n- Step\nother angles that would achieve the same result?\nrotated?\n4: Create\nWhy does\na π/2\nfinding\npulse.\nthe 90 degree pulse maximize\nor π) puls\nour\ne? What\nsignal?\nexactly\nAre there\nis being\nany\nWatch the scope as you do this.\nT\nW\nur\ne\nn\nk\nthe\nnow\nA\n\n-‐\nt\nWi\nhat\nd\n\nth\nlengt\nkno\nh\nb\nof\nto\nthe\nad\npul\njus\nse\nt th\nis\ne\nπ/2\npuls\nw\ne\nreach\nhen\nlength\nwe\n.\na maximum\nmove\nare several\nthe A-‐\npossible\nin the intensity of the FID (the peak you noticed\nWidth kno\nmaxima--you\nb more than\nshould make sure that the one\nin\nyou\nStep\nuse\n3).\ndoesn't\nThere\n- Step\nobserve\n5: Create\nyour 90\na\ndegree\nπ pulse.\npu\nDou\nlse. M\nbl\nea\ne th\nsu\ne\nre\nhalfway.\nand record\nNext, change instrument\nwidth of puls\nt\ne\nhe\nto\nl\na\nengt\nπ\nh of the pulse.\nsetup to\nth\nmaximum,\ne correspo\nand\nndi\nhow\nng FID\nthe\nloo\ntime\nk like\ndelay\n? Con\nof\nsider\nthe\n\nresponse\nwhether y\nshould\nou expe\npuls\nct\ne\nth\n(1\ne\ns\ni\n)\ngnal\n. What should\nStep 4. Reconnect AB OUT to AB IN and MIXER OUT to Chn 1\ncompare\non the scope\nto the\nto be\nFID\nat\nof\na\nchanging\nwithout\nThe FID shoul\nany\nd\nother\nappea\nsettings.\nto have\nr to be fl\nObserve\nat. If your\nthe\nFID\nFID\nis not\nand\nent\ncompare\nirely fla\nwi\nt, w\nth\nha\nyo\nt\nur\nwoul\npre\nd\nd\nca\nic\nuse\ntions\nit\n.\n\n-\nthe FID signal decays. What is the net magnetization of the sample at this time?\nhaving\nStep\ninstrument.\n6:\nnonzero oscillations in intensity? Explain\nboth\nCreate\n\nA\nSet\nand\ntwo\nthe\nB\nπ/2\ndelay\non will\npulses\ntime\nallow\nto\nusin\nus\ng\nms\nto\ndifferen\nsend\non the\nmore\nt chan\nthe state\npulse\ncomplicated\nn\ngenerator.\nels.\nof the system right after\nTurn\npulse\non the B Channel--\nthe units on the pulse programmer display and especially the\nBe\nwhite\ncar\nsignals\neful to\nto\nno\nthe\ndot that\nte\nrepresents\npulse using\na\nthe\ndecimal\nsame\npoint.\ntechnique\nSwitch\nas before.\nto FID view\nWhat\nand\ndo y\nadjust\nou expe\nB-‐WID\nct th\nT\ne\nH\nc\n\no\nto\nrr\nf\ne\ni\ns\nnd\npo\na\nnd\nπ\ning\n/2\n\n-\nFI\nchannel\nStep\nD to\n7:\nlook\nand one on t\nCreate\nlike?\na\nWhy\nπ/2\nhe B channel\n-π\nis the\nsequen\nFID not\nce.\n?\n\nzero after sending two π/2 pulses, one on the A\necho\nforming\nex\n\nper\na 18\ni\nment.\ndegree pulse with a delay\nAs i\ntime\nn Step 5, double the width of your B pulse,\nTransform, and adjust\nWh\nthe\nat d\nfrequency\no you obs\nof\ner\nthe\nve?\nspectrometer\n\nof\nSet\nup\nms\nthe\n. Th\nscope\nuntil\nis is the\nyou\nto view\nsetup\nobserve\nthe\nfor\nF\na\na\nour\npeak.\nspin\nier\n\nRecord\nmaximum,\nthe location\nthe FID agai\nFWH\nn. Me\nM,\nas\nas\nof\nbest\nthis\nyou\npeak and the peak width (estimate the full width at half\nwould expect to see\nur\nmultiple\ne the fr\ncan)\neque\nand\npeaks\nnc\npoint\n11).\nfor\ny\nnote\no\nthe units. Now set up the scope to view\nafter Expt\nWhy don't we\nethanol\nf the FID\n(if\nand\nyou're\ncompare\nnot sure\nthis\nwhy,\nto the\nrevisi\nFT.\nt\nWe\nhave\nthis\nusing\nexperiment?\nthis instrument\nCalculate\nbetween\nthe energ\ny\npeaks\ndifferen\nwith\nce\na\n(in\nthese\nHz)\nmultiple\nthat we\npeaks\nwould\nin\nexp\na\nect\n2 ppm difference from each\nt\nother.\no\nMH\nsee\nz\n-\nC\nStep\nompare this to\n8: Dephasin\nthe line\nT\ng and\nwi\nLifetime\ndth you o\nin\nbs\nglycerol.\nerve in th\nHere\ne FT.\nw\n\ne will study the dephasing and\nlifetime\nof glycerol in water. We\nT\nwill focus on the rates due to dynamical dephasing\n(\n) due to evolving interactions (e.g. \"collisions\") within or among molecules, the\nlifetime of our nuclear spins (\n1), and inhomogeneous dephasing (Δ) due to static\nvariation in the environments around different glycerol protons. Because solutions\nwith different glycerol concentrations have different environments around the protons,\nthe\nTo\nextent\nsave\nof inhomogeneity and the rates of dynamical dephasing processes may vary\nfrom sample to sample.\n\ntime, each\n\ngroup will conduct this experiment\n\nyiel\nconcent\njust one\nd concent\nration of glycerol, and the data from different groups will\nusing\nbe combined to\nYo\nΔ:\nur\n\nF\nFind the\nration-‐dependent resul\nID will d\npulsewidth\necay approximately\nof pulse A\nts.\nwhich\n\nexponentially.\ncreates a π/2 pulse in your sample.\nresults\nIn gener\nin\nal\na\nth\ndrop\ne decay\nin your\nrate\nFID\nincludes\nintensity\ncontributions\nto 1/e (37%)\nMeasure\nits maximum,\nthe time\nfrom\nof\ninitial\ndelay\ninhomogeneity, dephasing,\nvalue.\nthat\nT\nand lifetime, i.e. Δ, T\n:\n2, and T1\nFind the pulsewidth\n.\nYou are now set up to perform\nof\na\npulse\nspin echo\nB which\nexperiment.\ncreates a\nUse\nπ pulse\na delay\nin\ntime\nyour\nof\nsample.\n2.5\naccurate\ninitially.\nway\nRecord\nto do\nth\nthis\ne int\nis\nensit\nto measure\ny of the\nthe\necho\ndistance\nusing hor\nfrom\nizontal\nthe highest\ncursors. The most\nms\npoints rather than trying\nto the lowest\nthis\nthe baseline. The echo wil\nto\nl always\nmeasure\nappear\nthe distance\nat twice\nbetween\nthe delay\nthe\ntime--\nhighest\nwhy\npoint\n? Repeat\nand\n\nno\npoint.\necho\nprocedure,\ncan be\nincreasing\nmeasured,\nthe\nrecording\ndelay time for each measurement by\nn't decayed by 50 ms, increase the step size to 10 ms.\nthe delay time and the intensity\n2.5\nIf the echo has\nfor\nms until\neach\nT\npuls\n1:\ne\n\n(\"inversion\nSet up your pulsewidths\nrecovery\" measurement).\nsuch that pulse\nTo\nA is\nbegin,\na π pulse\nmeasure\nand pulse\nthe maximum\nB is a π/2\n(initial)\npulse\npulse A\nB.\nand\namplitude\nB\nof the FID following pulse B\nA\nNext, turn on\nAs\nand measure the\nwithout pulse\non.\n\nbefore, start at a\nmaximum\ntime delay\n(initial)\nof 2.5\namplitude\nms, and\nof\ncontinue\nthe FID following\nto make\n\nmeasurements in 2.5 ms steps. If the echo hasn't decayed by 50 ms, increase\nWhat\nstep size to 10 ms.\nthe\nwould\nprocesses\ny\nand\ndelay time\nou\nfor\nexpe\nthe\nct\nspin\nto\nmeasurements\nch\ninve\ngly\ndo Δ\necho\nange\nand\nwith\n\nr\nc\ns\ne\nio\nr\nn\no\n,\nl\nT\nconcent\n2, and T correspond to and which\nvalues of Δ, T2, and T1 were found in your\nr\nexperiments?\necovery\nrat\nat\nion\neach\n?\n\nP\nco\nlo\nnce\nt inte\nntr\nns\nati\ni\no\nty\nn.\nv\n\ne\nWh\nrsus\nat\n\nExperim\nyour ex\nent 9. 3\npect\nat\n0-‐\nions?\nMHz\nE\nN\nxplai\nMR\nn any\n\ndiscrepancies.\nDo your results match\n\nThe detailed operating procedures are presented in Appendix C. It is essential that\nyou read them before conducting experiments, for the safety of the NMR machine\nand for the success of your measurements. Make sure that you have\n\nthoroughly read\nall the NMR material in this manual and the Appendix before beginning.\n\nSamples\nD is a mixture.\nA,\nSpec\nB, and\ntrum I\nTake\nC contain\nspectra\nnterpretation\nacetone,\nof all four\nan\nethanol,\nsamples\nd Chemical Determin\n\n-\nand methanol in\nthree samples and the identity and mole fractions\nto determine\nof the\nthe\nation\nsome\nidentity\n\norder.\nof\n\nthe\nSample\nfirst\n-\nRationalize the line positions, integrals, and splitting patterns that you obs\nmixture in Sample\nerve.\nD.\nFor\noscillation\nthe sample\nfrequency\ncontaining\ndetermined\nmethanol\nin the\ncalculate\nion,\n\n-\nthis\nprevious\nthe chemical shift in ppm from the\nvalue to the spectrum in the frequency domain\nexperimental\nobtained in thi\nsection\ns sect\nand compare\n\nin w\nprotons on adjacent atoms in ethanol using your spectrum.\nthe units are ppm.\nFor\nhich\nthe sample containing ethanol, calculate the J-‐coupling parameter values for\n-\nthe\nObserve\nFID\nthe\nis visible.\nFID: Enter\nFor\nthe\nTime Domain\nsolution\n'acqi' w\n'A'\nindow\nyou\nMeasuremen\n,\nshould\nhit 'FID',\nsee\nand\nts\ntwo\nad\noscillation\njust the ver\nfrequencies.\ntical scale unti\nBy\nl\n-\nmoving\noscil\nExamine\nlation frequencies in Hert\nthe\nthe\ncursor\nlinewidth\nbetween the peaks of the two oscillations; calculate the two\n: Bring t\nz.\nhe\n\ncursor close to a peak. Enter nl dres (nearest line\n-\ndisplay\nexperiment.\nIntegrate\nresolution).\nyour spectrum\nCompare this value to the linewidth from the TeachSpin\nbutton\nto clear\nto\nall\ndefine\nresets\nthose\n(zeroes)\n: Cl\nalready\nick\nregions\n[partial\nin memory.\nintegral]\nClick\nto display th\nand\ne inte\nuse\ngral\nthe\nline\nleft\n. T\nmouse\nype cz\nusing\nused to\nthe\nundo\nmiddle\nmistakes.\nmouse\nThe\nbutton\nparameter\nyou wish to\nset\nintegrate.\ns the inte\n[resets]\nThe\ngrals\nright\nscale\nmouse\nand can\nbutton\nbe ad\ncan\njuste\nbe\nd\ncont\nwill\nrol\nno\n.\nw\nPl\nbe\nace\nto\ngai\nq\nt\nwhile\nis\nin integral mode. Type\nre\nn cursor\n-\nreg\nPrint the spectrum\nions) to get\nue\nhe\nr\ncursor\nied for\nover\nan inte\nthe\ngr\ndesired\nal value\nregion\n. Type\nand\nds\nclick\net\n]\ndpir\nthe\n(displ\nds\n[S\na\ni\ny\nnt\npea\nbutto\npl pscale pap page\nk int\nn.\negra\nYou\nthe integral values displayed underneath the spectrum.\nl\n: Type\ninto the command line.\n\nAppen\nht\ndi\ntp://l\nx A:\nasp.colorado.edu/cassini/education/\nElectromagnetic Spectrum\n\nPlease see: The Electromagnetic Spectrum\n\nAppendix B: Helpful Hints for the 15 MHz\n\nThe picture above shows the three main components of the instrument setup. The pulse\ngenerator is where you will program the pulses that get sent to the magnet: the duration of each\npulse, the frequency, the delay time between pulses, and the pulse patters patterns. The magnet\nconsists of coils of wire which create a magnetic field and a place to put a sample. The\noscilloscope is where you will view both the input of the pulse generator into the magnet and the\noutput of the sample after receiving pulses. Its controls are shown below:\n\nThe five most important knobs are outlined in solid red. In display mode, 1, 2, 4, and 5 control\nthe panning (POSITION) and zooming (VOLTS/DIV or SEC/DIV) of the display. In cursor\nmode, 1 and 3 move the cursors. To change between modes, use the buttons above the vertical\nand horizontal controls. The five buttons in a column left of the vertical and horizontal controls\nallow you to change the options displayed on the right-hand side of the screen. They allow you\nto change between vertical and horizontal cursors when you're in cursor mode, and when you're\nin MATH MENU (in the center of the picture), they will allow you to do to cycle through\noperation options (add, subtract, etc.) until you find \"FT\".\n\nThe pictures below show a pulse, which is what the pulse programmer sends to the magnet.\nWhen you first turn on the oscilloscope, it may take some adjusting to get the view on the left,\nbut just keep fiddling with the zoom and panning until you see a single solid line. Zooming in\neven further (center it before zooming to avoid losing it off screen) will give you the image on\nthe left, which is your pulse. The pulse duration is the width of this square pulse (time is x-axis).\n\nWhen you switch the cables around to view the FID, it will look something like this:\n\nThe flat part to the far left is the baseline before the pulse was applied. The first large spike is\nmostly noise--it contains the pulse you applied, and it overwhelms your signal response until a\nshort time later, when you see the second smaller peak next to it (see arrow). This is the signal\nyou will monitor when trying to maximize the FID. The long oscillation afterwards is the\ndifference between your reference pulse and the natural frequency of the proton precessions, and\nis what you will minimize by adjusting the frequency on the pulse generator. Afterwards your\nsignal should look something like this:\n\nNote that the oscillations after the signal are almost completely gone. Another helpful visual is a\nspin echo:\n\nAt this point in the experiment you will have set up two pulses, which are the first two FIDs you\nsee here. The last signal, which lacks the spike characteristic of a pulse sent to the instrument, is\nyour echo! The echo can be much less pronounced that what you see here, but you will know to\nalways look for it at the same distance from the second pulse that the second pulse is from the\nfirst. If that doesn't seem obvious, review the process that causes the echo.\n\nFinally, this is what a FT of your signal should look like:\n\nNote how broad this peak is (and how poor the signal-to-noise is) in comparison to the nice sharp\npeaks you see in the 300 MHz experiment!\n\nAppendix C:\n\nHow to Obtai\n\nBefore ejecting the\nStep\nprevious\n1: Ge\nsample\nt a lock\nthat\nsig\nhas\nnal\nbeen\nand shim\n\nn a H NMR\n-\nchecking the\nthere\nshould always be a sample in the\nAcquisition Status\nleft into the instrument (\n\nwind\nprobe\now.\n) make sure that the spinner is off by\nMe\n\n- To\nnu butto\neject the\nns\nsample\nwindo\nand\nw and\nto recover\nclick on\nthe\neject\nspinner\n.\n(turbine), click the\n\nAcqi button in the\n\n- Remove\ninto the\nthe\nspinner\nsample\nand\nthat\nclean\nis currently\nthe outside\nin the\nof the\nprobe.\nNMR\nCarefully\ntube with\ninsert\na KimWipe.\nyour\n\nsample\nPosition\ntube\nth\nallow\ne tube\nthe\ni\nsample\nnto the\nthe magnetic homogeneity of the sample.\nto\nspinner\nbe rotated\nwith\nat\nthe\na frequency\ndepth gauge.\nof 20\nThe\nHz inside\npurpose\nthe\nof\nmagnet,\nthe spinner\nincreasing\nis to\n\n- C\nsp\nlimb\ninner\nthe\non\nladder\nthe air\nto\ncu\nin\nreach\nsert\nshion\n.\nthe\n\ntha\ntop\nt fl\nof\now\nthe\ns throu\nmagnet\ngh t\nand\n\ncarefully position the\n-\ncomputer and click\n20 Hz\nLo\nhe\nck\ntop NMR probe. Return\ntub\nt\ne\no\na\nt\nnd\nhe\n-\nSet\nadjusting the bottom parameter.\nthe spinner rate to\nby clicking the\nbutton in the Acqi window and\n-\nIn\nshou\nthe\nld\ncommand\nFrom here,\nset the\nyou\nshim\nline\n-‐coil\nat the\nhave two\ns to r\ntop\nchoices.\neas\nof\nonably\nthe main\nype\n\ngood\nwindow,\nvalues to\nt\nOption 1 will automatically\nstar\n'rts'\ngo\nt wi\nstraight\nth\nand\n.\nenter '\nlock,\nbest'. This\nshim,\nOption 2 allows for manual shimming and locking.\nperform the selected experiment, which means you can\nto\n\nmid-‐Step\nand\n3.\nOption 1: Automatic\n- Cl\nof the monitor. If you do not see the Walkup button, expand the\nick on Walkup tab in the Tcl/dg window, which is present on the bottom left area\n\nwindow.\n\n- Select\ntype of\nthe\nexperiment\nappropriate\nyou\nsolvent\nwould\nfrom\nlike to\nthe\nrun\ndropdown\n(in our case,\nSolvent\n1H).\nmenu,\nnot start automatically, click the Start ACQ button.\nIf the\nthen\nexperiment\nclick on\ndoes\nthe\n\nOption 2: Manual\n- Click on the Acqi Tab and the Acquisition window will appear.\n\n-\n\nCl\n\nick on Lock\n-\nbutton. Check that the LOCK is\nInitially\noff.\nquant\nthe lockpower\nity,\nthe\nwhil\nspinner\ne\n1the\n\nright\nis off\n\n.\nincreases).\nSet\nlockgain\nthe spin\nThe\nto 20 Hz (left-‐clicking a button decreases the\nto 20 and the\nto 2\nspinner\n8.\nshould now be on. Also increase\n\n1 The lock power and lock gain levels depends on the concentration of the deuterated solvent, the number of\ndeuterium atoms in the solvent and the relaxation time of the deuterium in that particular solvent.\n\n-\n\nAdjust the magnetic field frequency Z0 shim (units\ndeu\nThe\nte\ngreater\nrium resonance field.\nthe number of sine waves, the poorer\nare H\nthe\nz), until\nmatch\na sine\nof\nwave\nZ0 wi\nis\nth\nseen.\nthe\n\n- If the lock is near resonance, the wave looks like:\n\n-\nPo\nIf the\nshow\nwav\nw\ne\ner\n\namplitude\nis too low, increase the\n, and, if necessary the\n\nle\nn\nngth\nuntil\nis\nthe\nseen,\nsignal\nand\nis\nt\nbetween\nhen\n50% and\nLock\nain\n,\n100%\nG\n. Continue to adjust\nuntil\nLo\none\nck\nbelow should appear.\nclick the\nh\nck ste\nZ0\nLock on button. T e lo\np function\n-\n\nIf\nthat\nphas\nthe\ne is\nlock\nnot\nsignal\nset proper\nis maximized.\nly, adjust the\ndecrease the Lock Gain.\nIf\nlockphase\n\nthe signal\n\nappears\nin steps of\nto\n-\nbe\n1 or\nsatu\n+1.\nra\nY\nt\nou\ned\nw\n(>=\nill not\n\n100),\nice\n\n2 A too high Lock Power (>40) is saturating the lock signal. Saturation is signaled by the fact that the lock level is\nvery erratic. Large values for Lock Gain give a noisy lock signal. Reduce Lock Power and adjust Lock Gain to\nmaximize the lock level.\n\n- Now,\ncoils\nshim.\nthat\nShimming\nsurround\nadjusts\nthe\nthe current flow\n-\nHere, only the\nthrough\n\"spinning\"\na series of differently\nwill be ad\nsample.\n(e.g. the sample-‐\nval\nshaped\nspinning) shims\nIn\nto\nthe\nZ1 - Z7\nACQUISITION\njusted.\nues of Z1C, Z2C, Z1\n\nwi\n\nand\nnd\n\nSH\nZ2\now\nin order to maximize the lock signal.\nclick on\nIM. Start making small changes to the\n\n-\n\n-\n(or, if\nWhen\nnecessar\nthe lock\ny, the\nsignal\nLo\ngo\nck Po\nes abo\nw\nv\ner\ne\n\nsu,\nin t\nhe\n%\n\n,\nLo\nre\nck\nduc\nup\nwi\ne\nIn the command line\nAcqi\ntype\nwhich sets\nthe\nnd\nthe\no\n\nw)\nlock\nLo\n.\nck\n\nGain in the same window\n\ndisconnects from the\nwindow.\nand shim parameters and\n\nSelect\n,\nSt\n, and\nep\nthe\n3: Acquire spectra\n-\nMain\n\nfor\nnt=\np\nrot\nto\non\nset\nMenu\nappropriate\nand\n. Now, type in\n\nNM\nthe\nR.\nnu\n\nThen\nmber\nSetup\ntyp\nof\ne\ntransients (acquisitions)\nNucleus\nto eight, which\nSolven\nis\nt\nga to acquire and automatically process your spectrum.\na good choice\n\n-\n\nUsual\nAfter\nly,\nthe\nsymmetric\nthe\ntransients are completed, the spectrum\naround\nspectrum\nthe base\nis not\nof a\npr\npeak.\noper\n\nly\nAuto-‐phase\nphased;\nffav.\nth\nthe\ne\nwill\n\nbe\nspectr\nbaseline\ndisplayed\num\ni\nby\nsn't\ntyping\nflat\non\nand\nn't\nthe command window or by using the macro\naph\nscreen.\n\ni\nint\ns\nIf one doesn't work, try the other.\no\n\n-\ndscale\n-\nIf\n\nReference\nthe x-‐axis disappears at any point, type the command\nto retrieve it.\nthat is used\nthe\ncomes\nspectrum\nfrom\neither\nCHCl\nto\n3,\nyour\nwhich\nsolvent\nis in\nor\nsmall\nto TMS.\namounts\nIn this\nin\nexample,\nthe CDC\nthe\nl3 sol\nproton\nvent.\n\nExpand the NMR scale around 7-‐ 8 ppm: click on the Box\nbutton after the arrow is close to 7 ppm. Click with the left button\nbutton. C\naround 8.2 ppm.\nlick on the\n\nright\n\n-\nExpand\nnl\n\nCl\nchloroform\nick on the\npeak, then\nbutton.\ntype the\nWith\ncommand\nthe mouse,\n(st\nbring\nrl(7.\ndisplay\n27p).\ndigital resolution, which for a well shimmed\nands\nthe\nfor\nred\nnea\ncursor\nrest line),\nvery\nbe\nor\nclose\nThis will place the\nprobe should\nless\nnl\nthan\ndr\nto the\nes\nH\nto\nz.\n\n- Click the full\nIf\nbutton to display the full spectrum, or type\nyou decid\nred\ne to us\ncursor\ne the\non\nTMS\ntop\nsigna\nof the\nl, ty\nnearest\npe (rl=0.\nline.\n0p\nf\n).\nType the command\nand press enter.\n-\n\nIntegrate the spectrum\n\ncont\nresets\n: Click\n. The integr\nline will be displayed\nclick\ninuousl\n\ny.\nal\nafter the signal. Re\n. L\nTo\neft\ncut\nclick\nthe\non\nint\nthe\negral\npart\nintegr\nab\nin\nove\nal\ntegral\nslightly\neach peak\nbefor\n, t\ne\nype\nthe\ncz\nsignal\n(clears\nand\nall\nthen\nreset\nslightly\ns) and\n\npeat for each peak.\n\n-\n\n-\nTo display the values of\n\nnecessary make\nsave you\nvp=\nr file\n-\nFinally,\nw\nand\nthe\ntype\nintegrals\nds dpir\nunderneath\nagain.\nthe spectrum type ds dpir. If\nTo\npage\nget\n\n(meaning:\na hard copy\nplot,\nwit\nh\nith\nyour\nthe svf\n1H\n('\nNMR,\nfilenam\nplot\ne') command.\nplot the ppm scale,\nthe\nplot\nspectrum\nthe integral\ntyping\n-\nresets,\npl pscale\nplot\npir pap\n\nex\nacquisition parameters)\nTo\nsome\npand\nsee coupling\nbuttons\npatterns, you can expand\nth\nregions\nthreshold parameter\ndpf\n. In\nby\nord\nclicking\ner to ge\non\nt the\n.\npe\nWith\nak fre\nof spectrum\nthe\nque\nleft\nncy\nmouse,\n, first set\nwith\nth\nthe\nand\nyellow line such as to include all the peaks with significance (avo\nset\ni\nthe\ne pe\nheight\nak\nbox\npi\nof\ncki\nt\nng\nhe\n\n-\nppfh\nYo\nsigna\nu als\nz\nls).\no\n\nTyp\ncan\ne\nprint\nto\nth\nd\ne\ni\n\ns\ne\nplay\nxpand\nthe\ne\npe\nd r\nak f\nd the noise level\nprovides peak position in her\ne\ntz\ngio\nre\nn\nq\nby\nuenc\ntypi\nies\nng\n.\nconstant values.\n, which is very\npl\nus\nppfhz\neful to\npscale\nextract\npage\nthe cou\n. Macr\npling\no\n\nEject\nClick\n,\n,\nWh\n, make\nen you have finished\n-\nacqi lock off\nsample\nspin off\n-\n= 0, make\n\n= 0.\nturbine. Wipe the sample with KimWipe, and\n\n- Substitute your\nwith a sealed\nlockpower\nsample. Insert\nlock gain\ninsert.\nthe sealed sample in the\n-\n\n-\n'autolock' to no and 'autoshim' to no.\nDisable auto-‐locking and auto\nTr\n-‐shimming\noubleshoot\nfeatures:\ning\nHit 'flags and conditions,' toggle\nIf\nprompt\nthe software\nby right-‐\nis\ncl\nnot\nicking\nresponding:\non the desk\nClose\ntop\nand\nback\nopen the program. Open a command\nth\n'terminal'.\nen ente\nEnter 'su acqproc' into the command\nground,\nline to kill\npaging\nthe\nt\ncurrent\no 'tools',\nacquisition,\nand then\n\nresp\nthen tur\nond,\nn i\nt\nr\nu\n's\nrn\nu\n\nac\noff\nq\nthe\nproc\nspectrometer\n' to re-‐initialize\n(white\nthe spectrometer.\nstill\nt bac\nswitch around\nIf\nback),\nthe software\nwait a few\ndoes\nseconds,\nnot\nk on before re-‐opening the software.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Module 1: Fundamentals of Spectroscopy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/3f54ecef6f159a0a11dd60251491e075_MIT5_35F12_Mod1_Background.pdf",
      "content": "Module 1: Fundamentals of Spectroscopy\n\nMod. #1-1\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Chemistry\n5.35 Introduction to Experimental Chemistry\n\nModule 1: FUNDAMENTALS OF SPECTROSCOPY\n\nIt's amazing how much we can learn about molecules and materials by shining light on\nthem! In spectroscopy, we use light to determine a tremendous range of molecular\nproperties, including electronic, vibrational, rotational, and electron and nuclear spin states\nand energies. From this information, we can often deduce a great deal of additional insight,\nincluding:\n-\nMolecular identities - what is the sample composed of? -\nMolecular conformations, geometries, and sizes -\nChemical equilibria -\nEffects of liquid or solid-state surroundings on molecules -\nDynamics, including the rates of chemical reactions, interchange among different\nmolecular conformations, relaxation of molecular excited states, photosynthetic\nenergy transfer, protein folding, etc.\n\nWe also can use light to control, as well as study, some molecular properties and events. In\nphotochemistry, light may be used for generation of new chemical products, sometimes\nwith selectivity or yields that cannot otherwise be achieved. We depend on a wide range of\nphotophysical processes like those in photosynthesis and vision. Modern laser sources\nallow the use of intense light pulses to manipulate materials and molecules in unique ways,\ninducing phase transitions, ablating material, initiating nuclear fusion, and so on. Laser\nmicromachining and CD recording are examples of applications of these processes.\n\nThere are a great many ways in which spectroscopy may be conducted. In some cases, light\nof different wavelengths is shined on a sample and the wavelengths that get absorbed most\nstrongly are measured. In others, you let the sample first absorb light and then measure the\nwavelength of light emitted. In yet others, you shine a pulse (or a sequence of pulses) of\nlight on the sample and measure various time-evolving responses. There are countless\nvariations on these themes, some routine and commercialized, others highly specialized\nand carried out only in scattered research labs around the world. Through an\nunderstanding of the general principles of spectroscopy, you can understand the way most\nspectroscopic measurements work and begin to think creatively about the broad range of\nspectroscopic possibilities.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-2\nPurpose\n\nThis module is designed to introduce the basic concepts of spectroscopy and to provide a\nsurvey of several of the most common types of spectroscopic measurement. You will\nconduct the following measurements.\n-\nUV-VIS (ultraviolet-visible) spectroscopy of electronic states -\nFluorescence spectroscopy of electronic states -\nIR (infrared) vibrational spectroscopy -\nNMR (nuclear magnetic resonance) spectroscopy of nuclear spin states\n\nIn most cases, you will be able to see the insides of the spectrometers and develop an\nunderstanding of how they work. You will use your spectra for chemical identification,\nstudy of electronic properties of organic molecules and semiconductor quantum dots,\nassessment of how electronic energy levels are affected by their surroundings in a solid,\nand other purposes. In the process of conducting the experiments, you will learn methods\nof sample preparation, operation of the spectrometers, and interpretation of the various\ntypes of spectra that you will record.\n\nSafety\n\nChemicals: The chemicals involved in this experiment should be handled with care to\navoid harm to your or your colleagues. These include deuterated solvents such as acetone-\nd6 or chloroform-d3 that are used for NMR spectroscopy so that the signals from protons in\nthe compounds of interest are not obscured by protons of the solvent.\n\nGlass: In preparing NMR samples, you will use glass pipettes and NMR sample tubes. In\nplacing a rubber bulb on the pipette or a plastic cap on the sample tube, the experimenter\nshould hold the tube immediately below the point of attachment to avoid breakage of the\nglass.\n\nMagnetic Fields: The field generated by an NMR magnet can have deleterious effects on\nwatches (battery-powered watches with liquid crystal displays are an exception), magnetic\ncredit cards (VISA, AmEx, etc.), and similar items. When working in the vicinity of an NMR\nspectrometer, leave these items in an alternate location. The magnetic field can also\ninfluence cardiac pacemakers and other medical devices. Discuss any such devices with\nyour instructor and take the necessary precautions.\n\nReading\n\n1. Hore, P. J. Nuclear Magnetic Resonance, Oxford University Press, Oxford, 1998.\n2. Mohrig, J.R.; Hammond, C.N.; Schatz, P.F.; Morrill, T.C. Techniques In Organic\n\nChemistry W.H. Freeman: New York, 2003. Chapter 19.\n3. Pavia, D. l.; Lampman, G. M.; Kriz, G. S. Introduction to Spectroscopy: A Guide for\n\nStudents of Organic Chemistry, Saunders: Fort Worth, 1996. Chapters 3-5.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-3\n\nGeneral Background\nLight and Matter\nWhat happens when a sample is irradiated by light? From introductory chemistry courses,\nyou might have a quantum mechanical picture of light absorption, which emphasizes that\nlight energy comes in quantized units, called photons, and that a molecule's energy also\ncomes in quantized units or \"quanta\", so when a molecule absorbs a photon, it takes up the\nphoton's energy to reach an \"excited state\" of some sort. Your picture of light absorption\nmight look like this.\n\nFigure 1. Optical absorption.\n\nBoth of these depictions get one crucial element correct: conservation of energy. The\nphoton energy does indeed get turned into molecular energy. Also, since molecular energy\nis quantized, there are only molecular excited states at certain discrete energy levels. The\nphoton energy has to be equal to the difference ΔE between some pair of energy levels of\nthe molecule in order for absorption to occur. There are many types of states that these\nenergy levels could correspond to, but in this module you will only consider electronic,\nvibrational, and spin states.\n\nExercise 1. What are the names, values, and units of h and ? How about ν, ω, λ and ? What\nare their values for visible and infrared light and for the MIT radio station frequency?\n\nFigure 1 also contains some grave simplifications. Its biggest problem is that it suggests\nthat the molecule is in a static, or (in quantum mechanical terms) stationary, excited state\nafter irradiation. The accuracy of this description varies, but in your NMR experiments you\nwill see graphic evidence that it is not complete. In those experiments, you will irradiate a\nsample with a pulse of radiation at radio frequencies (RF) and you will measure the time-\ndependent, oscillating state of the proton spins in the sample, long after the RF pulse is\ngone. Similarly, time-dependent molecular vibrations that occur during and after\nirradiation by an IR pulse can be measured, although their time scale is so fast that\nultrashort laser pulses are required to observe the individual vibrational oscillations. Time-\ndependent oscillations in molecular electronic charge distribution due to visible or UV light\nare even faster, but there are ways of measuring them too.\n\nExercise 2. Express the frequency values ν that you found from Exercise 1 in reasonable\nunits, i.e. megahertz (MHz), gigahertz (GHz), or terahertz (THz). Now calculate the time T\nrequired for a single oscillation period in each case, again expressed in appropriate units of\nGround state\nExcited state\nE = h = =\nhc/ = hc\n(b)\nBefore\nMolecule\n(Ground state)\nPhoton\n(a)\nAfter\nMolecule\n(Excited state)\nNo more\nphoton\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-4\nmicroseconds (μs), nanoseconds (ns), picoseconds (ps), or femtoseconds (fs). These are the\nfrequencies and oscillation periods of the RF, IR, and visible radiation and also of the\nrespective spin, vibrational, and electronic responses of molecules that have energy levels\nwhose differences match the radiation frequencies. When molecules are irradiated at a\nfrequency that matches a transition between two energy levels, we say that the radiation is\non resonance with the molecular transition frequency.\n\nThese dynamical, time-dependent responses can be expressed in the most accurate and\ngeneral terms through time-dependent quantum mechanics, which isn't treated in\nundergraduate courses. Fortunately, it can be expressed with excellent accuracy in most\ncases in the framework of classical mechanics. And this is something for which you have a\nlifetime of experience and intuitive understanding.\n\nFigure 2 is an alternate depiction of light absorption. This picture is very different from\nthose in Figure 1! Light is now depicted as a propagating wave, not a particle. The molecule\nis now shown as a classical harmonic oscillator, suggesting\nany possible vibrational amplitude, rather than only a set of\ndiscrete states. Which picture is right?\n\nThe answer is that both pictures are correct, and both can\noffer important insights. Figure 2 correctly suggests that\nlight is a propagating electromagnetic wave. The molecule\ndoes indeed respond to the light much as a harmonic\noscillator would. For example, a polar molecule like HCl\nresponds to an oscillating electric field by alternately stretching and compressing, that is,\nthrough well-defined vibrational oscillations induced at the frequency of the field. The\ninduced oscillation amplitude is proportional to the amplitude of the light field. If the light\nfrequency is on or near the molecular vibrational resonance frequency, the induced\noscillations are larger in amplitude than if the light frequency is far off resonance.\nExperiments can be conducted that permit direct observations of these time-dependent\nvibrational oscillations.\n\nIf we can view the irradiated molecule as a classical oscillator responding to a classical\nforce exerted by a classical electromagnetic field, what about the quantum mechanical\nview? The details of this discussion will have to wait until 5.61 and even beyond, but the\nbasic results can be described here. The molecule does indeed have well defined stationary\nstates with well defined, discrete energies, as depicted in Fig. 1b. Molecular and light\nenergy do come in discrete quanta as that figure suggests. But the fact that the molecule\nhas time-independent, stationary states does not mean that the molecule always must be in\none of those states. The molecule may be in a time-dependent state, which is not one of the\nstationary states but is described mathematically as a linear combination of stationary\nstates. The time-dependent state may be very much like a classical oscillator, and any\n\nEM wave\nvibrating\nmolecule\nFigure 2. Optical absorption.\nExercise 3: Indicate what types of molecular energy level transitions are involved in the\nfollowing spectroscopic techniques: NMR, IR, UV-Vis, Fluorescence.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-5\noscillation amplitude is possible. This may seem to suggest that any vibrational energy is\npossible, in contrast to the laws of quantum mechanics. But it turns out that if you make a\nmeasurement of molecular vibrational energy, you always get one of the discrete energy\nvalues corresponding to one of the stationary states. Similarly, it is accurate to describe the\nlight coming from a lamp or a laser as an oscillating electromagnetic field that can drive\noscillating molecular responses. But if you measure the energy taken up by a molecule\nwhen it absorbs light, you find that the energy comes in indivisible quanta - what we call\nphotons.\n\nThe reconciliation of time-dependent, classical molecular vibration and classical\nelectromagnetic waves with quantized molecular energy levels and photons is a subtle\npoint, but rest assured that the two apparently contrasting views presented in Figures 1\nand 2 are indeed compatible. And that means we should not disregard Figure 2, for which\nlife in the classical world has provided us ample intuition. Infrared light really does drive\nmolecular vibrational oscillations. Visible and UV light drive electron clouds to move in an\noscillatory fashion about their host nuclei. RF radiation drives magnetic dipoles in an\noscillatory fashion, as any oscillating magnetic field drives a bar magnet. Where possible,\nwe will use classical mechanics to explain spectroscopy.\n\nElectromagnetic Radiation and the Electromagnetic Spectrum\nSince light can be described as an electromagnetic wave, we should be able to depict it and\nunderstand parameters like those of Figure 1, applied to individual photons, in terms of\nwave motion. Imagine a wave propagating through space in what we will define as the x\ndirection. We can describe the electric field as follows;\n\n(1)\nLet's look at this equation. First, the field is a vector (bold); it is directional. On the RH\nside, first we see a unit vector that indicates the direction along which the field is pointed.\nHere we've written as time-independent for simplicity. Next we see an amplitude E0,\nwhich we also have chosen to make time-independent. This describes a never-ending wave\nof light with a time-independent amplitude; later we'll describe pulses of light whose\namplitudes are time-dependent. Finally, we have the oscillatory cosine term that indicates\nthat the field is an oscillating function of both position and time. If we pick any position in\nspace (fix the value of x) we see that the field that passes through that point oscillates in\ntime. If we pick a fixed time, we see that the field oscillates in position.\n\nExercise 4. Plot the field as a function of time at a fixed position and vice versa. Indicate the\namplitude E0 and the oscillation period T for the first plot and the wavelength λ for the\nsecond. What are the relationships between T and ω and ν and between λ and k, the\nwavevector?\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-6\nAbsorption of Light\nHow do we describe how light interacts with molecules? Sticking with our classical picture,\nlet's start with F = ma. In this case, the force exerted is the time-dependent, oscillating\nelectromagnetic field. Let's consider the molecular vibrations of a polar, diatomic molecule\nlike HCl. Treating it as a harmonic oscillator, we can write its equation of motion including\nthree force terms: the Hooke's Law restoring force due to the spring, a frictional damping\nterm proportional to the velocity, and the external force applied by the light. The result is\n\n(2)\n\nwhere Q, the vibrational coordinate, is the deviation from the equilibrium length of the\nspring (or the equilibrium bond length), μ is the reduced mass of the molecule, b is a\nfriction coefficient, K is the force constant, and a is a coupling constant that measures how\neffectively the light drives the molecular vibration. We don't need to include propagation of\nthe light or the position of the molecule explicitly in this equation; we can just solve it for\nany position (i.e., x = 0), and assume it will be the same everywhere else. Also note that the\nbigger a is, the larger the amplitude of vibration. We won't go into detail about this\ncoupling constant here, except to mention that it depends on how polar the vibration is.\nThe dipole moment of the molecule has to change as a result of the vibrational motion for\nthe mode to be IR-active, that is, for it to absorb any IR light at all. Therefore, vibrations in\nhomonuclear diatomics like H2 and Br2 do not appear in IR spectra (in our equation of\nmotion, a = 0). The molecules vibrate but there is no change in dipole moment when they\ndo. The result is that an electric field does not exert a force that affects the bond.\n\nExtra Credit Exercise 1. This is your chance to \"do the math.\" It is the fundamental classical\nmechanics of a driven, damped oscillator, which is an important problem that comes up in\nmyriad contexts. It is somewhat time-consuming but straightforward since you are expected\nto use a text or online treatment from which you can follow the derivations and transcribe\nthem directly. However, it is expected that you understand clearly anything you turn in.\nFind a treatment of the classical mechanics of a driven, damped harmonic oscillator.\n1. Show for a mass m that is connected by a spring of force constant K to an infinitely\nmassive, immovable wall, that Newton's Law F = ma along with Hooke's Law F = - KQ\n(where Q measures the stretching of the spring, starting from its length with the mass at\nrest) yield the equation of motion\nwhere the second term,\nwhich you will see describes damping, has simply been added in. Then show that for\ntwo masses, m1 and m2, on the two ends of the spring, the equation of motion has the\nsame form,\n, where the mass m has been replaced by the reduced\nmass μ for which you should derive an expression.\n2. Show that with no friction, i.e. b = 0, the solutions are oscillatory at the resonance\nfrequency\n. If you stretch the oscillator by some amount Q0 and then let go (i.e.\nset initial conditions Q = Q0, dQ/dt = 0), the solution takes the form\n.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-7\n3. Show that for weak friction, the solutions are exponentially damped oscillations:\n, where\nis the damping constant and the oscillation\nfrequency\nis slightly lower than the resonance frequency.\n\nHow does the harmonic oscillator respond to a periodic driving force like that exerted by\nlight? It is possible to use eq. (2) to derive the response of the damped harmonic oscillator\nto an oscillating driving force at the driving frequency ω. The result is\n\n,\n(3)\n\nwith the vibrational amplitude A increasing as the driving frequency approaches the\nresonance frequency ω0. The vibrational amplitude depends on the driving field amplitude\nand on the driving frequency,\n\n.\n(4)\n\nFinally, the amount of power that is absorbed from the driving field by the damped\noscillator is given in classical mechanics by the expression power = force * velocity. Using\nour expressions above and neglecting oscillations that are very rapid in comparison to the\nlength of the measurement (that is, averaging over an oscillation period), we get\n\n(5)\n\nassuming weak damping and a driving frequency that is near resonance. Maximum power\nabsorption occurs on resonance, and the power absorbed far from resonance is negligible.\nIn an absorption spectrum, you measure how much power P(ω) from a light source is\nabsorbed by the sample as a function of the light frequency. The functional form on the RH\nside of eq. (5) is called a Lorentzian function. Its peak is at the resonance frequency ω0 and\nits width is given by the damping constant γ. Thus the basic parameters of the sample can\nbe determined directly from the absorption spectrum. Note that the power absorbed\ndepends on the field amplitude squared, or the light intensity, which, averaged over the\ncycles of the field, is the light power. That is, the amount of power absorbed is proportional\nto the amount of power that hits the sample.\n\nExtra Credit Exercise 2. Plot the time-dependent displacement of the damped harmonic\noscillator Q(t). Plot the frequency-dependent vibrational amplitude and power absorption\nfor the driven oscillator with γ = ω0/10 and ω0/100. Indicate the parameters ω0 and γ on\nthe frequency plots. What changes in these plots as γ changes?\n\nNote that in the treatment above, we wrote that the driving force oscillates as\n\nwhile the driven response oscillates as\n. The frequencies are the same, but the\nvibrational phase may not be. When the vibrational phase factor β is ±π/2,\nand the driving force and the response are in phase. This happens whenever the\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-8\ndriving frequency is far off resonance. On the other hand, when β = 0, the response is 90\nout of phase with the driving force and the driving frequency is exactly on resonance.\nThis is one way of thinking about the power absorbed from the driving force: it is largest\nwhen the frequency is on resonance because the force is always driving the oscillator out of\nphase, and therefore always meeting substantial resistance.\n\nIn the classical damped harmonic oscillator, the time-dependent oscillations and the\nvibrational energy are damped at a rate given by γ. When damping is complete, there are\nno significant further oscillations and the vibrational energy is zero. We say that the well-\ndefined time-dependent oscillations treated above are phase-coherent, because their\ntiming--their vibrational phase, β--is well defined. It turns out that the absorption\nlinewidth γ really measures the loss of vibrational phase-coherence, or dephasing\n(sometimes called \"decoherence\"). In some cases the dephasing rate and the energy decay\nrate are the same, but in many cases dephasing is much faster. This is the case with\nelectronic and spin states as well as vibrations. The absorption linewidths tell us about how\nlong it takes for the coherent oscillations in vibrational displacement, electronic charge\ndistribution, or magnetic moment to decay, but not about how long the vibrational,\nelectronic, or spin energy is retained by the molecule (vibrational, electronic, or spin state\nlifetimes).\n\nWe should not forget entirely the quantum mechanical picture, e.g. Fig. 1b. The resonance\nfrequency ω0 that we associate with classical time-dependent oscillations also gives us the\nenergy difference, ΔE = ω0, between the ground state and an excited state of the molecule.\nThe reason that energy might remain in the molecule long after coherent oscillations are\nfully damped is that the molecule at that point may be left in the excited state - a stationary\nstate. The energy lifetime is just the lifetime of the molecule in that state. Eventually the\nmolecule will return to the ground state by some mechanism - emission of light\n(fluorescence) or a nonradiative mechanism in which the energy is lost to thermal energy\nof the surroundings.\n\nExperiments 1-2: UV-Vis Absorption Spectroscopy\nAbsorbance is measured using a spectrophotometer. The intensity I of the light that is\ntransmitted through the sample of a known thickness l is compared to the \"reference\"\nintensity I0 of light that did not go through the sample. In practical spectroscopy, the power\nabsorption labeled P(ω) in the discussion of fundamentals above is often called the\nabsorbance and labeled A(). The absorption of light in a suitable concentration range can\nbe described by Lambert-Beer's law,\n\n(7)\n\nwhere is the extinction coefficient and c is the sample concentration. In order to get the\ndependence of the absorbance on the wavelength, the sample is irradiated by light\ncomposed of all the wavelengths of interest and the transmitted light is then dispersed\nusing a grating. The separated frequency components are measured in different parts of a\nCCD detector.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-9\n\nExercise 5. Derive Beer's Law--it's easy to find in textbooks and online.\n\nIn one experiment, we will use the relationship between absorbance and concentration to\ndetermine the concentration of an absorbing molecule of interest. One measures the\nabsorbance of a series of solutions of known\nconcentrations to determine the relationship\nbetween the absorbance and concentration\n(that is, to determine the value of ), usually\nthrough a linear fit. Once this is known, then\nfrom measurement of the absorbance of a\nsolution of unknown concentration, the\nconcentration\ncan\nbe\ndetermined.\nThe\nmeasurement error can be minimized by\nadjusting the concentrations and/or sample\nlength such that the absorbance is between\n0.3 and 1, ensuring that the absorption is\nstrong enough to yield a significant difference between I0 and I, but not so strong that there\nis too little transmitted light to measure.\n\nQuantum mechanical particle-in-a-box model of electronic excited state energies\nWe've seen how absorption spectra have peaks at the resonance frequencies ω0 of\nelectronic, vibrational, or spin states of molecules. Can we calculate the values of the\nfrequencies from first principles? The answer is yes - if we can calculate the energies of the\nquantum mechanical electronic, vibrational, and spin states. In general this may require\nsophisticated numerical calculations, but in some cases we can use simple models to get\napproximate values of the energies.\nYou will record UV-Vis absorption spectra of electronic transitions in a series of aromatic\nhydrocarbons illustrated below.\n\nThe pi electrons can move freely throughout the molecules. A very simple model that\ndescribes the electrons is a quantum mechanical \"particle-in-a-box.\" In this model, the\npotential is infinitely high outside the box and zero inside the box. The model is applied to\nthe molecules by assuming that the molecule size is the box size. For a 1-dimensional\nparticle in a box, the energy of the nth level is given by\nFigure 4.\nAromatic hydrocarbons.\nnaphthalene anthracene tetracene (naphthacene)\nImage removed due to copyright restrictions. Please see:\nOcean Optics. USB4000 Fiber Optic Spectrometer Installation\nand Operation Manual. Document Number 211-00000-000\n-02-201201. Appendix C, p. 27.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-10\n\n, n = 1,2,3,... (8)\n\nwhere m is the mass of the particle and l\nis the length of the box. The smaller the\nbox, the larger the spacing between the\nenergy levels. Therefore, a smaller box\nrequires light with a higher photon\nenergy (and higher frequency) to induce\ntransitions between the ground state\n(level 1) and the first excited state (level\n2) as shown in Fig. 5. You should\nobserve a shift in the absorption\nspectral\npeaks\ntoward\nlower\nfrequencies, described approximately by\nEq. (8), as the number of rings increases.\n\nExperiments 4-5: Fluorescence spectra\nA fluorescence measurement is similar to the one described above except that the\nmeasured light is emitted by the sample, rather than transmitted through it. Although\nfluorescence is emitted in all directions, typically we measure the emission at a 90 angle\nrelative to the incoming radiation path in order to minimize the amount of transmitted or\nreflected light that reaches the detector. Since the fluorescence is much weaker than the\nincident light, fluorescence signal is easily overwhelmed by stray incident light.\n\nOnce energy gets absorbed by a molecule, what happens? Clearly\nthe molecule doesn't retain the extra energy forever. The\nmolecule will eventually return to the ground state. One way this\nhappens is for the molecule to emit light at the resonance\nfrequency--to fluoresce, either spontaneously or by stimulation.\n\nSpontaneous Emission\nIn this type of fluorescence, the molecule spontaneously emits a\nphoton and loses the associated energy ΔE. In spontaneous\nemission (indicated by the wavy line), emitted light can go off in\nany direction. There is no driving light field; spontaneous emission is a purely quantum\nmechanical process that leaves the molecule in a stationary state, not a time-dependent\noscillating state. Still, if we analyze the emitted light as a function of frequency, we discover\nthat the maximum of the spectrum occurs on resonance and the spectral width is given by\nthe dephasing rate, just like in the absorption spectrum.\n\nIn our fluorescence experiment we use the particle in a box model to study quantum dots\nfabricated by the Bawendi research group. Quantum dots are semiconductor crystals of\nnanometer sizes over which an excited electron is delocalized. In a bulk semiconductor,\nthere is an energy gap Eg (the \"bandgap\") between the valence band, where the electrons\nFigure 5. Particle in a box energy levels for boxes\nof lengths l and l/2. In the smaller box, the energy\nlevels are separated by larger amounts and\ntransitions require more energy.\nl/2\nn=2\nn=1\nE\nl\nn=1\nn=2\nn=3\nn=4\nE\nFig. 6. Fluorescence.\nGround state\nExcited state\nE = h\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-11\nare in the ground state, and the conduction band. A band state simply means that the\nelectrons are not localized on individual atoms or molecules, but rather are delocalized\nover a large area of the crystal--in the case of quantum dots, the entire dot. Due to the\nfinite size of the dot, allowed energies of the electron are quantized approximately by the\nparticle in a box expression, so the lowest-energy excited state is separated from the\nground state by the gap energy plus the lowest (n = 1) particle-in-a-box energy. Both\nfluorescence and absorption lines should shift as a function of nanoparticle size. In this\nexperiment we will look at fluorescence and absorption from three solutions of quantum\ndots (CdSe with trioctylphosphine ligands in hexane/toluene solvent) and observe the shift\nof the maxima as a function of the size of the dot. From the wavelengths at which the\nmaxima appear, it is possible to estimate the size of the dots using the formula in the\nprevious section.\n\nStimulated Emission\nAlthough emission can occur spontaneously, it also can be stimulated by an incident light\nfield, just like absorption. In stimulated emission, the emitted light has several interesting\nproperties that differentiate it from spontaneous emission: it is exactly the same as the\nincident light in its direction, polarization, frequency, and phase. This is why stimulated\nemission is used in lasers and laser amplifiers. If laser light enters a population of excited\nmolecules, it may stimulate emission and emerge with substantially increased power. In\ngeneral, light that is resonant with a molecular transition frequency may induce absorption\nor stimulated emission. If all the molecules are in the ground state, then only absorption\noccurs. If some molecules are in the excited state, then stimulated emission can also occur,\nand if 50% of the molecules are in each state, then there is no net gain or loss of optical\npower (though many individual molecules may absorb or emit). If more than 50% of the\nmolecules are in the excited state--a population \"inversion\"--then there is more\nstimulated emission than absorption, and more light emerges than entered. A population\ninversion cannot occur in molecules at thermal equilibrium, but there are many ways to\nintroduce energy into selected levels and to maintain a population inversion for long\nenough to extract the energy as stimulated emission.\n\nExercise 6. What does LASER stand for?\n\nFigure 7. Stimulated emission.\nBefore\nMolecule\n(Excited state)\nPhoton\nAfter\nMolecule\n(Ground state)\n2 photons\n(a)\n\nEM wave in\nvibrating molecule\nEM wave out\n(b)\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-12\nFourier Transform Spectroscopy\n\nSpectroscopy in the time domain\nIn UV-Visible spectroscopy, you measured absorption and fluorescence spectra in the\nfrequency domain using spectrometers with diffraction gratings that separated the different\nfrequencies of light that is either absorbed or emitted. The amount of light at each\nfrequency was detected using a CCD detector; the measurement was made directly as a\nfunction of frequency. An alternative to collecting data in the frequency domain is to carry\nout a measurement in the time domain. For example, a short pulse of light can be used to\ninitiate an oscillatory response. After the pulse is gone, the system will continue to oscillate\nuntil dephasing is complete. (See Exercise 5, part 3.) If we can measure the oscillations\ndirectly as a function of time, then we can work out what ω0 and γ are, just as we did in the\nfrequency domain. The time-domain measurement may be advantageous for a number of\nreasons. One key advantage is that a single pulsed measurement yields the information in a\nvery short time, even including the time spent in repeating the measurement and averaging\nto obtain a good signal/noise ratio. A second important reason for making the time-domain\nmeasurement is that it can sometimes yield additional information that cannot be extracted\nfrom a simple frequency-domain absorption measurement.\n\nIt often is convenient and useful to display the results of a time domain measurement as a\nfunction of frequency. One could fit the measured oscillations, extract the values of ω0 and\nγ from the fit, and then plot a Lorentzian function using the extracted values, thereby\nproviding a display of the frequency-domain spectrum. However, there is a much more\ndirect way of going between the time domain and the frequency domain. It's called Fourier\ntransformation, and it yields the Fourier transform F(ω) of a function f(t). The Fourier\ntransformation is executed as follows1:\n\n(6)\n\nWe'll only use the first of these relations, but it's useful to see that one could go either way\nbetween time and frequency domains. Let's imagine that f(t) is our measured time-\ndependent response\n, where we have approximated that the\ndephasing rate is very small. This approximation is not necessary to get the correct result,\nbut it simplifies the discussion. Now imagine trying the top integral above with different\nvalues of the frequency ω. First try ω = ω0. This will give a large positive result because\ncos(ωt) becomes cos(ω0t), and this multiplies the same oscillatory function that is part of\nf(t). When one factor of cos(ω0t) is positive or negative, so is the other one, so the product\nis positive at all times. Therefore the integral over all time yields a large positive result. On\nthe other hand, if ω is substantially different from ω0, then cos(ω0t) and cos(ωt) will\noscillate between being in and out of phase, yielding both positive and negative\n\n1 These formulae work for a cosine function, but if the oscillation phase were different, e.g. sinusoidal, there\nwould be problems. There is a more general version, but it is not necessary for our purposes.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-13\ncontributions which will average out to a neglibily small value with time. Eventually, the\nexponential decay will end any significant contributions to the integral.\n\nNow consider ω ω0. In this case the oscillations will stay in phase for many cycles,\nyielding a large positive result for a substantial portion of the integral. Eventually the\noscillations will go out of phase, and this could yield negative values that might\nsubstantially cancel the positive contribution. But if the exponential decay basically ends\nf(t) before the oscillations of cos(ω0t) and cos(ωt) go out of phase, then these negative\nvalues are insignificant. This is the case as long as |ω0 - ω| << γ. What this tells us is that for\nfrequencies at or near the resonance frequency, we have large values of F(ω), and as the\nfrequency moves farther off resonance in either direction, F(ω) becomes small in value. In\nfact, it's not too hard to show that F(ω) is precisely the Lorentzian function we saw before -\nthe absorption spectrum - with center frequency ω0 and linewidth γ.\n\nOur example above is a Lorentzian function, but in fact the FT relation holds much more\ngenerally, even for spectra that are not Lorentzian. For example, imagine several spectral\nlines that are very close together, so they merge into one very broad line with a width much\ngreater than any of the individual linewidths γ. This spectrum will have an irregular shape,\nthe details of which depend on the relative strengths of the different absorption peaks, how\nfar apart their central frequencies are, and their linewidths. The corresponding time-\ndomain response also will be irregular, since the driving force will start all the oscillators\ngoing and they will get out of phase rather quickly since they will be oscillating at different\nfrequencies. The details of the decay of the oscillations in signal will depend on the relative\namplitudes of the different responses, how far apart their resonant frequencies are, and\ntheir individual decay rates. But the time and frequency domain responses Q(t) and P(ω)\nstill will be related through Fourier transformation.\n\nExtra Credit Exercise 3. Calculate the Fourier transform numerically or analytically (the\ndefinite integrals in this particular case are available in tables) of your damped oscillatory\nfunctions from Extra Credit Exercise 3, with γ = ω0/10 and γ = ω0/100. Then calculate the\nFT of the sum of two or three oscillatory functions, and repeat this with a few different\nchoices of frequency values. Plot both the time-domain and frequency-domain functions.\nTry to develop some intuition for what the Fourier transforms look like for different cases.\n\nWhen you make the measurement in the time domain, you use a short pulse of light and\nmeasure the sample's oscillating response. The pulse is centered at some frequency ωp, and\nit has some duration τ. For example, the pulse might have a Gaussian envelope function, so\nthe field may be given by\n, a bit like the pulse sketched in Fig. 2. In\nthis expression, it appears that the field simply oscillates at the frequency ωp, which would\nrender our experiment ineffective--if there is no light at a certain frequency (all\nfrequencies except ωp), we can't determine how much light at that frequency gets\nabsorbed, regardless of the domain. In fact, the measurement works because the frequency\ncomponents are all contained within the short light pulse. The key to understanding this is to\nrealize that the Gaussian pulse can be written as a sum of many different frequency\ncomponents, with a Gaussian spectrum of frequencies centered at ωp. The width of the\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-14\nfrequency spectrum, δ, is given by the inverse of the pulse duration, τ. Therefore, the\nshorter the pulse duration, the greater range of frequencies it contains! At the center of the\npulse, at time t = 0, the oscillations of all the different frequencies are in phase, so there is a\nlarge total field and a large intensity. At a short time before or after the center of the pulse,\nthe oscillations of the different frequency components are somewhat out of phase with\neach other, so the total field and intensity are lower. At a longer time before or after the\ncenter of the pulse, all the oscillations of the different frequency components are\ncompletely out of phase and the superposition of all the components yields no net field or\nintensity. This is an important concept, and it may be worth your while to sketch out four\nor five different frequencies on graph paper that all have maxima at the origin. Now, in a\ndifferent color, try adding them up. You should get a feeling for how the sum of many\nfrequencies results in a train of pulses; if we sum (actually integrate) over a continuous set\nof frequencies rather than a few discrete frequencies, there is only one pulse.\n\nThe Fourier transform relations between a light pulse and its frequency spectrum are\nsimilar to those that we saw before between a harmonic oscillator response and its\nabsorption spectrum. In both cases, a rapid decay of oscillation amplitude corresponds to a\nbroad frequency range and a slow decay of oscillations corresponds to a narrow frequency\nrange.\n\nRecalling eq. (1) for the light field, the oscillating term cos(kx - ωt) suggests that not only\ncan frequency ω and time t be interchanged through Fourier transformation, but so can\nwavevector k and position x. And since the wavevector is related to the wavelength, i.e. k =\n2π/λ, then just as time-domain data can be Fourier transformed to yield the frequency-\ndependent spectrum, so can position-domain data be Fourier transformed to yield the\nwavelength-dependent spectrum. And of course the spectrum written as a function of\nwavelength or frequency is the same since the two are simply related by the speed of light\nin air.\n\nCan we really record data in the \"position domain\"? What would that mean? It suggests that\nwe could examine a \"snapshot\" of the light field, like the one you generated in Exercise 3,\nand see just how it had been affected by passing through the sample. Is this possible?\n\nThe answer is: almost. We don't have a way of recording a snapshot of a rapidly varying\nfield directly, but as you'll see, in FTIR spectroscopy we measure the superposition of two\nfields and then translate one field spatially relative to the other. Imagine two identical plots\nlike yours from Exercise 3, showing snapshots of the same field. Now imagine adding the\ntwo fields together. If they are exactly in phase, the result will be constructive interference\nand the field amplitude will double and the intensity of the light, which is the square of the\nfield, increases everywhere fourfold. So does the power, which is just the integrated or\ntime-averaged intensity over one or more cycles of the field. This is what is measured. Now\nimagine shifting one of the fields spatially, forward or backward. If you move it by half the\nwavelength, then the two fields are exactly opposites at all times. Their superposition\nyields destructive interference, and there is no light intensity or power at any time. If you\ncontinue to move it by another half-wavelength, the two fields are back in phase and the\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-15\noriginal power is back. So the power oscillates between a maximum value and zero as we\nshift the relative phase of the fields.\n\nA plot of the power vs. relative displacement X between the two interfering fields is called\nan interferogram. It provides \"almost\" a snapshot of the field. For a light field like the one\nwe've been discussing, this function, which we can call g(X), oscillates as\n) and its\nFourier transform is zero for any value of K other than k, the light wavevector. This is the\nidealized limit of a never-ending light wave with a single frequency, except now the\nanalysis is in terms of the wavelength and position-dependence (accounting for how we\nmake the measurement) rather than the frequency and time-dependence. If instead we\nhave many wavevector components, then their oscillations won't stay in phase for long, so\nwhen we shift one field relative to the other, at first they will go in and out of phase like\nbefore, yielding oscillations in the measured power, but after a short displacement they will\nno longer interfere constructively or destructively and we will just measure the average\npower of each separate field (half the maximum power). This situation is closely analogous\nto the time-frequency case we considered above. When the range of wavevector\ncomponents is very narrow, it will take a long distance for them to get out of phase. When\nthe range of wavevector components is very broad, they will get out of phase very quickly.\nThe wavevector and spatial domains have the same relationship that the frequency and\ntime domains have.\n\nExperiments 6-7: Fourier Transform Infrared Spectroscopy\n\nThe technique you will use to measure IR absorption spectra differs from the one described\nabove for UV-VIS spectra. Instead of using a grating to disperse the light, the FTIR\nspectrometer uses an interferometer, as depicted below. The light beam from an IR source\nis split by a 50% reflector (thick dashed line in the figure) into two beams. These are\ndirected toward mirrors that reflect them back to the 50% reflector, at which each of the\nbeams may be partially reflected and partially transmitted, going back toward the IR\nsource or toward the detector. One of the mirrors is mounted on a movable stage so the\npath length traveled by the reflected field can be varied, allowing us to control the phase of\none beam relative to the other. When the beams return to the 50% deflector, one of two\nthings can happen: if the beams are in phase, the light goes back to the source, and if they\nare out of phase, the light goes to the detector. A good way to think of this is through time-\nreversal symmetry: if you draw the wave originally hitting the 50% reflector and the two\nwaves emerging from it, and then reverse the direction of time, the picture should look the\nsame. Of course, if you had put the IR source where the detector is and done the same thing,\nthat picture also should look the same. In practice, the source emits light throughout the IR\nspectrum, covering a wide range of wavelengths, so the interferogram recorded by moving\nthe stage and measuring the power at the detector shows a limited number of oscillation\ncycles and then, at large values of X, no further interference. The Fourier transform of the\ninterferogram yields the IR light intensity at each wavelength. When a sample is placed in\nExercise 7: Explain in your own words the function of a Fourier transform and why\nit is a useful technique for spectroscopy.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-16\nfront of the detector, some wavelengths are absorbed and this changes the interferogram\nand its Fourier transform. The difference\nbetween\nthe\nFourier\ntransforms\nof\ninterferograms recorded with and without the\nsample present gives the sample's absorption\nspectrum. It\nis\nnecessary to\nrecord the\n\"reference\" spectrum with no sample present\neach time the spectrometer is used because both\nwater and CO2 (whose concentrations in the air\nmay vary over time) will absorb strongly in this\nregion, and our spectrum will be corrupted if we\nfail to subtract their contributions.\n\nIR spectra are often used to determine the\nstructure of a molecule, since the frequency of\nmolecular vibrations is dependent on the stiffness of bonds and on the masses of atoms. In\norder to illustrate how we get information about properties of a molecule using FTIR, you\nwill record the interferogram of chloroform and then calculate its Fourier transform, which\nwill give you its vibrational spectrum in the region of 500 - 4000 cm-1. Next, you will use\nFTIR spectroscopy to look at the structures of limonene and carvone, which differ only in\none functional group but nonetheless exhibit IR absorption spectra with differences\nsufficient to enable their identification.\n\nAside from studying and identifying small molecules, FTIR is also important in biophysical\nstudies where the molecular environment can shift vibrational frequencies. For example,\nhydrogen bonding from water molecules can decrease the force constant of carbonyl\nstretches, shiftint the resonance frequency by tens of cm-1. In proteins and DNA, common\nbuilding blocks form biopolymers with repeat structures whose similar environments lead\nto characteristic frequencies. We will investigate the Amide I vibration of proteins\n(primarily C=O stretch, 1600-1700 cm-1), a vibration that is sensitive to secondary\nstructure because structure-specific backbone hydrogen bonds affect the frequencies and\nbecause the vibrating atoms in nearby monomer units move in unison, which also affects\nthe frequency and makes it particularly sensitive to molecular conformation. β-sheets are\ncharacterized by IR peaks at 1620-1635 and 1670-1680 cm-1 while α-helices show peaks at\n~1650 cm-1 and random coils at ~1640 cm-1. To avoid overlapping H2O vibrational peaks,\nwe will dissolve the proteins in D2O, which exchanges with the solvent exposed N-H amino\nacid groups. This exchange results in a slight frequency downshift in Amide I, but a large\nFigure 10.\nLimonene and\ncarvone.\nFigure 9: Interferometer (image from\nNIST, National Institute of Standards\nand Technology). For another example\nof an Interferometer, please see\nhttp://www.physics.mq.edu.au/\n~goldys/optmicroweb/ftir\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-17\n100 cm-1 shift in Amide II (C-N stretch and N-H or N-D bend) from 1550 to 1450 cm-1. We\nwill investigate the Amide I absorption spectrum of myoglobin, ribonuclease A, and\nlysozyme, an α-helical, β-sheet, and mixed protein, respectively. We will also watch the\nAmide I and Amide II regions of the spectrum to monitor the structural changes induced in\nribonuclease A with heating.\n\nExperiments 8-9: Nuclear Magnetic Resonance (NMR)\n\nIn NMR, the transitions are between different spin states of the proton. It turns out that\nevery 1H nucleus (as well as 13C, various other nuclei, and the electron) has an inherent\nspin angular momentum and associated spin magnetic moment. This is a purely quantum\nmechanical effect, although the term \"spin\" is based on the wistful notion that the effect\ncould be connected with the classical spinning of a charged particle. While electron orbital\nangular momentum and magnetic moments can be understood qualitatively in terms of\ncirculating, charged particles, spin has no classical analog. Nonetheless, the response of the\nspin magnetic moment to an applied magnetic field can be understood substantially in\nclassical terms.\n\nUnlike electronic and vibrational levels which have inherently different energies, the two\nspin states of the proton ordinarily have the same energy (they are degenerate). In this case\nthere is no spectroscopy possible, since there is no light frequency of transition between\nthe two levels. However, when a static (dc) magnetic field B is applied, the two levels\nseparate in energy because the spin magnetic moments μ align mostly parallel or mostly\nantiparallel to the direction of the applied field. When the field is applied, say along the z\ndirection (all modern NMR spectrometers have the dc magnetic field aligned along z), the\nspin magnetic moments are not locked along this axis, but measurement of their z-\ncomponents always yields the same magnitude, either positive or negative in sign, indicating\nalignment of the z-component either with the field (\"up\" or +1/2) or against the field\n(\"down\" or -1/2). The positive or negative values are those of the spin z-component\nquantum number, mI = ±1/2, associated with z-components of the spin angular momentum,\nIz = mI, and the spin magnetic moment, μz = mIγp, where the proportionality constant γp =\n26.75 x 107 T-1s-1 (\"T\" is Tesla, a unit of magnetic field) is called the proton gyromagnetic\nratio. The energy in a magnetic field is given by E = -μ∙B = -mIγpB = ±1/2γpB. When the\nmagnetic field is on, transitions between the two spin levels are possible through\nabsorption of radiation. The frequencies of this absorption are generally in the\nradiofrequency (RF) region, roughly on the order of the MIT radio station frequency.\n\nThe NMR spectrum is an RF absorption spectrum.\nThe magnetic field magnitude B is held fixed, but\ninstead of scanning the RF frequency and recording\nhow much RF power at each frequency gets through\nthe sample, like in UV-VIS spectroscopy, the spin\nresponse is measured in the time domain. A short RF\npulse is incident on the sample, inducing coherent\noscillations of the spin magnetic moment which\nB\nE\nE = h =\n= pB\nmI = +1/2\nmI = -1/2\nFigure 11. Proton spin energy levels as\na function of applied magnetic field.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-18\n(c) Journal of Chemical Physics. Source: Arnold, J.T., et al. \"Chemical Effects on Nuclear\nInduction Signals from Organic Compounds.\" Journal of Chemical Physics 19, p. 507,\n1951. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/fairuse.\ncontinue for long after the pulse is gone. The\ndecaying oscillations are recorded in real time with a\nmagnetic coil. Fourier transformation of the time-\ndependent response, called free induction decay\n(FID), yields the NMR spectrum.\n\nExercise 8. Find the joke hidden somewhere in the paragraph that starts with \"Unlike\".\n\nExercise 9. The two NMR spectrometers you will use have RF frequencies of 15 MHz and\n300 MHz. Calculate the magnetic field strength in each instrument using the relationship\nbetween the resonance frequency and magnetic field.\n\nThe dc magnetic field is aligned along the z-axis, as mentioned above. The pulsed magnetic\nfield is polarized along the y-axis, tilting the spin magnetic moments along the y direction.\nTypically, the RF pulse amplitude is adjusted to tilt the magnetic moments by 90, or π/2.\nThus the magnetic moments are forced into the xy-plane, initially along the y-axis and then\nprecessing about the z-axis. The net magnetic moment along the x-axis, which oscillates at\nthe precession frequency (given by hν as illustrated in the figure), is what is measured with\na magnetic coil. Over time, the precessing moments begin to return toward the z-axis under\nthe influence of the dc field in that direction. Thus the measured oscillation amplitude\ndecays with time, yielding a frequency and a dephasing rate.\nInteractions with electrons: Chemical shifts\nThe discussion thus far would suggest that every proton of a molecule in a magnetic field\nshould show the same spin resonance frequency. If this were true, NMR would be of little\nspectroscopic value since every proton would yield the same signal. But the local magnetic\nfield \"Bloc\" that is actually felt by each individual nucleus is not quite equal to the applied\nmagnetic field because the applied field causes circulating currents in the electrons around\nthe nucleus, and these give rise to a small magnetic field of opposite sign to the applied one.\nThe induced field slightly shields the nucleus from the applied field, giving Bloc = (1 - σ)B\nwhere σ is the shielding constant. Although this effect is small, it produces an easily\nmeasurable shift in the proton spin resonance frequency. Since the nature of the electron\ndistribution varies from one part of the molecule to another, so does the magnitude of this\nchemical shift. The chemical shift often is expressed as a relative quantity,\n, so that unlike the resonance frequency ν0, it does not depend on the applied field\nmagnitude. This permits convenient comparison of chemical shifts, irrespective of the NMR\ninstrument that is used to measure them. The reference frequency νref is given by\nFigure\n12.\nThe\nproton\nNMR\nspectrum of ethanol. TMS (the\nmost widely used reference signal)\nstands\nfor\ntetramethylsilane\n(Si(CH3)4). The upper step-like\ncurve is the integrated signal,\nproportional to the number of spins\ncontributing to each set of peaks.\nFrom J.T. Arnold et al, Journal of\nChemical Physics 19, p. 507 (1951).\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-19\n\nconvention by the frequency of the single NMR line in tetramethylsilane (TMS), which\nshows very little chemical shielding. A simple illustration is provided by the NMR spectrum\nof methanol, shown in Fig. 12.\n\nThe spectrum reveals methyl, ethyl, and alcohol proton peaks in well separated regions of\nthe spectrum, though the actual frequencies measured differ only by a few parts per\nmillion. The spectrum also includes a plot of the integrated areas under each set of peaks,\nthereby indicating the relative numbers of protons that contribute to them. Figure 13\nshows commonly measured spectral shifts in NMR spectra of organic molecules.\n\nInteractions between proton spins: J-couplings and splittings\nAn interesting and important feature of the ethanol NMR spectrum has not yet been\nexplained. The CH3 and CH2 spectral features consist of three and four components,\nrespectively. The splitting of NMR lines arises from interactions between the spin magnetic\nmoments on inequivalent, nearby nuclei. Like nearby bar magnets, the spin moments exert\nweak magnetic forces on each other. The result is that the spin energies due to nuclei a and\nb include a spin-spin coupling term Eab = hJabmI(a)mI(b), with the coupling constant J\ntypically only 1-10 Hz. If we examine the energy of a + 1⁄2 spin on nucleus a without an\napplied field and include the interaction due to b, there are now two possible values\ndepending on what spin nucleus b has. Each of these two values is then changed by an\napplied field. The diagram below illustrates the possible spin combinations and allowed\ntransitions; note that only one spin state may change when a photon is absorbed because a\nphoton carries just one quantum of angular momentum.\n\nSo, the effect of one nearby proton is\nto split the NMR absorption line into\ntwo closely spaced lines of equal\nintensity. If we extend this treatment\nto include another proton c that is\nindistinguishable from b (e.g. on an\nethylene group) and that therefore\ninteracts in the same way as b with\nE\nB\nE = pB ± 1/2hJab\nmI(a) = +1/2, mI(b) = +1/2\nmI(a) = +1/2, mI(b) = -1/2\nFigure 14. Proton a spin energy levels as a function of applied\nmagnetic field B, including interaction with nearby proton b.\n\nmI(a) = -1/2, mI(b) = -1/2\nmI(a) = -1/2, mI(b) = +1/2\nFigure 13. The chemical\nshifts expected for various\ntypes of 1H resonances. As\nshown here, a wide range of\nchemical groups may be\ndistinguished through NMR\nspectroscopy.\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-20\nproton a, then it is easy to see that there are three distinct spin energies associated with a\nincluding the spin-spin interactions: one with b and c both spin up, one (including two\ndifferent states) with one spin up and the other down, and one with b and c both spin\ndown. In this case there are three different spin transition frequencies in the intensity ratio\n1:2:1. Similarly, if we consider a third indistinguishable proton d on a methyl group with b\nand c, we discover that there are four distinct spin transition frequencies for proton a in the\nratio 1:3:3:1. These effects are apparent in the ethanol NMR spectrum. The singlet, doublet,\ntriplet, and quartet spectral features are extremely useful for NMR interpretation and\nchemical identification.\n\nInstrumentation\nYou will conduct NMR spectroscopy using two very different instruments. The TeachSpin\n15-MHz NMR instrument is designed to expose the dc magnet and the workings of the\nspectrometer to your view and manipulation, so you can gain a clear understanding of what\nis going on in an NMR measurement. This instrument allows you to record free induction\ndecays (FIDs) and other time-dependent responses in a simple and illustrative manner. In\ncontrast, the Varian 300-MHz NMR spectrometer is a highly automated instrument. You\nstill are able to control many of its functions, in particular the RF pulse sequences that are\nused to induce the sample responses, but the workings of the device are buried more\nremotely alongside the superconducting magnet which is perpetually cooled with liquid\nhelium. Although its performance is more obscured from view, it is also clearly superior.\nThe higher magnetic field results in far greater separation of peaks with different chemical\nshifts, and the better field uniformity across the sample results in linewidths that are not\nbroadened instrumentally by having different parts of the sample subject to different field\nlevels. You will use the 300 MHz instrument for eludication of chemical composition and\nmolecular structure.\n\nIn your NMR measurements, you will mostly use a single pulse, adjusted to be a π/2 pulse,\nto initiate spin precession and free induction decay. As you have seen, the decay rate that\nyou measure does not necessarily give you the dynamical dephasing rate , because in\nsome samples local inhomogeneity leads to a wide range of absorption resonance\nfrequencies. Each resonance might have a narrow linewidth γ, but since all the lines merge\ntogether you only measure a much broader inhomogeneous linewidth Δ. In the time-domain\nNMR measurement, the result is the same as in the frequency domain. A short π/2 pulse\nwill tilt all the spins into the xy-plane and they will all start precessing about the z-axis, but\nafter a few oscillation periods they will start to go out of phase because they precess at\ndifferent frequencies. The higher-frequency spins will start to run ahead of those at the\ncentral frequency, and the lower-frequency spins will lag behind. But a second RF pulse\ncould be applied (after a delay time τ following the first pulse) that is twice as strong as the\nfirst one. It is a \"pi\" pulse, and its effect is to flip all the spins by 180. In this case the spins\nfind themselves precessing about the z axis like before, but in exactly the opposite direction\n- so the higher-frequency spins find themselves lagging behind the average, and the lower-\nfrequency spins find themselves ahead! After a few cycles, the higher-frequency spins will\nbegin to catch up, and the lower-frequency spins will find their lead diminishing. After the\nsame time period τ that separated the first two pulses, all the spins will be precessing in\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-21\nphase again. In our measurement of net magnetization, we will see a maximum - the signal,\ninstead of decaying away, will have built back up! This recurrence of signal is called a \"spin\necho.\" It is very useful because it makes it possible to measure the dynamical dephasing\nrate , even if the sample is inhomogeneous. This is accomplished by varying the time\nperiod and measuring the decay of the echo signal intensity. The π pulse and the spin\necho measurement permit reversal of dephasing that occurs due to inhomogeneous\nvariation in resonance frequencies but not due to dynamical processes, so the echo signal\nlevel decays with rate which can therefore be measured.\n\nRecall that the lifetime, conventionally called T1, or (its inverse) the energy decay rate 1, is\nnot measured in the spin echo measurement, which gives the homogeneous dephasing rate\n, or the free induction decay, which gives the total dephasing rate which we'll call and\nwhich is the sum of homogeneous and inhomogeneous rates, i.e. = + . Some of the\ndynamical processes (interactions or \"collisions\" between molecules) that cause dephasing\nactually cause loss of the spin energy and relaxation back to the lowest-energy spin state,\nthat is, they contribute to the energy decay rate 1. But many of these processes simply give\nthe precessing spin a \"kick\" that changes its precessing phase, leaving the spin energy\nintact. In this case the affected spin no longer precesses in phase with those around it, so\n\"pure\" dephasing occurs without energy relaxation. The pure dephasing time is\nconventionally labeled T2*, and we'll label the pure dephasing rate (its inverse)\n2*. The\nhomogenous dephasing rate is then a sum of two contributions, i.e. = 1 + 2*. The lifetime\nT1, or energy decay rate\n1, can be determined by reversing the order of the and /2\npulses from the spin echo measurement. If the pulse arrives first, it leaves the spins\nexactly flipped from their initial orientations, not precessing but stationary with a net\norientation against the field direction. The /2 pulse then brings them into the xy-plane\nwhere they start precessing, and a free induction decay can be measured. As the time\nbetween the pulses is increased, energy relaxation occurs, and the free induction decay\nsignal level decreases at the rate 1 which can be measured. Thus all the contributions to\nthe total dephasing rate = 1 + 2* + can be determined.\n\nSequence\nVariable Measured\nEquation of Relaxation\nπ/2\nΓ\nM(τ)=M(inf)[exp(-τΓ)]\nπ/2 - τ - π - τ\nγ\nM(τ)=M(inf)[exp(-2τγ)]\nπ - τ - π/2\nγ1\nM(τ)=M(inf)[1-2exp(-τγ1)]\n\nFinally, a note on shimming. The word \"shim\" was used to describe a bell tuner who would\nremove shims of metal from different places on the bell so that the bell produced a single\nsharp tone. Imagine a chemical species with only one proton. If we put a sample of this\ntype in an NMR magnet we would expect one narrow line. But if the applied magnetic field\nis not uniform across the sample, then the resonance frequency will vary across the sample\nand the line will be broadened. This is similar to inhomogeneous broadening described\nabove, except the inhomogeneity is in the applied field rather than the sample. The 15 MHz\nspectrometer has significant field inhomogeneity, but 300 MHz instrument allows us to\nadjust how strong the magnetic field is at different locations within the sample using shim\ncoils. These coils have a small current running through them, which induces a magnetic\n\nModule 1: Fundamentals of Spectroscopy\n\nMod. #1-22\nfield. Each coil is located near the sample such that by changing the current, the magnetic\nfield in the sample can be made homogeneous. A homogeneous magnetic field yields a\nnarrow line, which helps prevent nearby peaks from overlapping and lets us determine the\ntrue dephasing rate.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction to Coordination Chemistry",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/e4c967c831a50ee682b55a85422c1a67_MIT5_35F12_Module_2LS1.pdf",
      "content": "Lecture Overview\n- Review bonding in Co compounds with Crystal Field Theory\n- Describe reactions in the lab\n- Practical aspects of FTIR Spectroscopy\n- Modeling hydration kinetics in Co complexes\n- Resources for researching/writing reports (Erja Kajosalo)\n\nApproaches to Laboratory Learning\nBe wary of the Cookbook Approach\nBe wary of \"He Said, She Said\"\nBe wary of Ego\nLearning \"the hard way\" is sometimes the\nbest way\n\nhttp://www.arjournals.com/ojs/index.php?journal=Chem\n\nIntroduction to Coordination Chemistry\nAlfred Werner - Nobel Prize in 1913\nBioinorganic chemistry - currently hot research area\nCo is a Group 9 element\nAufbau Principle\n1s\n2s 2p\n3s 3p 3d\n4s 4p 4d 4f\nCo : [Ar] 4s2 3d7\nCo2+ has d7\nCo3+ has d6\n\nO\nH\nH\nCobalt Complexes\nCobalt(II) nitrate hexahydrate\n-O\n\nN+\nO\n-O\nOuter\nCoordination\n-O\n2 e-\nSphere\ndonor\nN+\nO\n-O\nHow could you determine if this is correct?\nCo\nOH2\nOH2\nOH2\nH2O\nOH2\nH2O\n2+\nInner\nCoordination\nSphere\n\nd Orbitals in Cobalt Complexes (Crystal Field Theory)\n_ _ _ _ _\n\n1 1\n1 1\nCo3+\n_ _\n_ 1_\n1_ 1_\nd6\n1_ 1_ 1_\n1_ 1_\n1_\n1_\n1_ 1_\nLow\nHigh Spin\nSpin\nd Orbitals in Cobalt Complexes (Crystal Field Theory)\nΔo\n_ _ _ _ _\n_ _\n_ _ _\neg\nt2g\n\nReactivity of Cobalt Complexes\n_ 1_\n_1 1_\nCo2+ d7\n1_ 1_ 1_\n1_ 1_\n1 1\n1 1\n1_\nS= 1/2\nS = 3/2\nCo2+ => more reactive \"labile\"\nCo3+ => less reactive \"non labile\"\nWe take advantage of this in the lab!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Linear and nonlinear spectroscopy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/dc8a375c836cb16e46d254fbc1e06847_MIT5_35F12_Module_1LS3.pdf",
      "content": "5.35 Module 1 Lecture Summary 3\nFall 2012\n\n3.1\nLinear and nonlinear spectroscopy\nWe've seen that we can determine molecular frequencies and dephasing rates (for\nelectronic, vibrational, or spin degrees of freedom) from frequency-domain or time-\ndomain measurements whose results are related through FT. In general:\n\nParameter\nTime Domain S(t)\nFrequency Domain S()\nLarge 0\nFast oscillations\nHigh frequency\nSmall 0\nSlow oscillations\nLow frequency\nLarge\nFast decay\nBroad linewidth\nSmall\nSlow decay\nNarrow linewidth\n\nThe FT relations obtain for the light field itself as well as the material responses to it.\nShort pulses of light have broad spectral widths.\n\nDephasing rate can have very different origins.\n\nDamping - the energy decays back to zero - rate 1, time T1 = 1/1\n\"Pure\" dephasing - energy is retained, oscillation phase is lost - rate 2*, time T2* = 1/2*\n\n(T2* notational convention is from NMR)\nInhomogeneous dephasing - energy is retained, and oscillations stay in phase on any\nindividual molecule, but oscillations on different molecules go out of sync - rate 3, time\nT3 = 1/3. Sometimes inhomogeneous dephasing rate (or inhomogeneous linewidth) is\nlabeled \".\"\nTotal dephasing rate is sum of all three contributions: = 1 + 2* + 3\n\nThis can happen if different local molecular environments cause different local resonance\nfrequencies 0.\n\n5.35 Module 1 Lecture Summary 3\nFall 2012\n\nTime-resolved fluorescence measurement\n\nFluorescence\nPump pulse\nPhotodetector\nSample\n\n3.2\nHow can we distinguish the different contributions??\nIn \"linear\" spectroscopy - where the sample response is linearly proportional to the EM\nfield - we cannot!\nBut there are many \"nonlinear\" spectroscopies that make it possible.\nNonlinear spectroscopy: sample response is a nonlinear function of the driving field\n\nTime-resolved \"pump-probe\" measurements - measure 1\nAn excitation or \"pump\" light pulse makes excited states. They may dephase quickly, but\nthe energy is still there in excited molecules that are not oscillating coherently anymore.\nA variably delayed \"probe\" pulse can be used to monitor the excited-state population and\nits decay to the ground state.\n\nProbe delay time\nA\nProbe\npulse\nPump\nPhotodetector\nSample\n\nThis can be done on femtosecond, picosecond, nanosecond,..., many-second time scales.\nThe probe pulse absorption is changed by the pump pulse because the excited states and\nground states absorb differently.\n\nTime-resolved fluorescence\nSometimes the excited molecules return to the ground state by fluorescence - they emit\na photon. Unlike absorption, which can be described classically or quantum mechanically,\nfluorescence is purely quantum mechanical! That's because the excited molecule just\nspontaneously emits the photon - there's no driving force acting on it.\n\nFluorescence\n\nPhoton\n(a)\nAfter\nMolecule\n(Ground state)\nBefore\nMolecule\n(Excited state)\nGround\nstate\nExcited\nstate\nE = h = =\nhc/ = hc\n\n(b)\npulse\nTime\n\n5.35 Module 1 Lecture Summary 3\nFall 2012\n\n3.3\nFluorescence emerges in all directions. Some reaches the photodetector, producing a\nsignal whose time-dependence is measured. As the excited molecules return to the\nground state, the amount of fluorescence decreases.\n\nYou'll make measurements of fluorescence, but not time-resolved. The fluorescence\nspectrum reveals excited-state energy levels, similar to the absorption spectrum.\n\nIn many cases, molecules or materials lose their energy non-radiatively, heating up their\nsurroundings. Either way, the time for relaxation back to the ground state is T1. It\nmeasures how long it takes for energy to leave the molecules.\n\nOther contributions to total dephasing rate:\nNMR \"spin echo\" measurements can determine the amount of inhomogeneous dephasing.\nInhomogeneous dephasing is due to variation (inhomogeneity) in the surroundings of\ndifferent molecules that lead to slight shifts in their resonant frequencies.\n\nFirst an RF pulse flips the spins by 90 degrees (a \"\" pulse), aligning them along the x\naxis. Then they start to precess - but not all at exactly the same frequency! So some run\nahead of the pack, and some behind.\n\nThen another RF pulse comes a certain time, , later, and flips the spins 180 degrees (a\n\"\" pulse), keeping them in the xy plane but reversing their directions - so the fast ones\nfind themselves trailing the pack and the slow ones find themselves leading! And after\nanother time period they are all re-phased! This produces a signal, just like before they\nwent out of phase. And this is measured. So the inhomogeneous dephasing is removed!\n\nSpin echo measurement\n\nIf the time interval is increased, the signal still decays due to lifetime (T1), which in the\nspin case means the spins lose their net alignments in the xy-plane. The signal also decays\ndue to \"pure\" dephasing: the molecules still have their excited-state energy (i.e. the spins\nare still aligned in the xy-plane) but they no longer oscillate phase-coherently - not just\n\ntime\nRF\nsignal\npulse\necho\n/2 pulse\n\nEcho signal\n\n5.35 Module 1 Lecture Summary 3\nFall 2012\n\n3.4\nout of sync with each other, but no longer coherent relative to their own oscillations at\nthe beginning.\n\nIf the lifetime also is determined in a pump-probe measurement, then the \"pure\"\ndephasing can also be determined.\n\n\"Photon echo\" measurements can be used to determine vibrational or electronic\ninhomogeneous dephasing rates.\n\nA similar measurement can be made except with the pulse first, then /2. The first\npulse delicately places the system in the higher spin level, without any coherent spin\noscillations, by exactly reversing the initial magnetization. The second pulse takes the\nsystem from there to the xy plane, where precession leads to oscillating signal. After the\nfirst pulse, the system can relax back down to the ground state (the initial spin level) -\nthis is energy relaxation, at the rate 1 given by the lifetime T1. So if you delay the\nsecond pulse, the oscillating signal strength decreases at that rate, which can be\nmeasured!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Practical aspects of FTIR Spectroscopy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/0d4976568e220050e36f86dfa7f648ed_MIT5_35F12_Module_2LS2.pdf",
      "content": "Sample Preparation Considerations and Issues\nChoice of Sampling Technique\n- State of analyte\n- Material compatibility\n- IR absorbance of cell materials\n- Path length\nSample Preparation Caveats\n- IR signal scatter - dirt, scratches, cracks\n- Too concentrated/dilute\n- Opaque pellets\n- Too thick\n- Too thin (fragile)\n- Wet KBr\n- Wet sample\n- Reproducible preparation\n- Sample is not what you think it is\nWarning Signs for Poor Samples\n- Big/wide water signal\n- No features or only Nujol/PE/etc\n- Broad and non-distinct signals\n- Sloping base line\n- Misaligned positioning\nWarning Signs of Instrument Failure\n- Unresponsive (hardware/software)\n- Error messages\n- No instrument/computer/printer comm\n- Laser weak or dead\n- CCD or photodetector is dead\n- Bad settings from previous user(s)\n\n(c) W.H. Freeman. Source: Mohrig, J. R., C. N. Hammond, and P. F. Schatz. Techniques in Organic\nChemistry, Third Edition. 2010. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/fairuse.\nIR Spectroscopy - Spectra Interpretation\n\nIR Spectroscopy - Spectra Interpretation\nChallenges\n- Ambiguous peaks\n- Misinterpreting overtone, combination vibrations\n- Misinterpreting impurities\n- Poor reproducibility of sample preparation - artifacts\nImportant Tools / Strategies\n- knowledge of chemistry, reactants, solvents\n- systematic peak assignment (e.g. Mohrig)\n- complementary characterization (NMR, UV-Vis, EA)\n- peak shape/intensity, shoulders\n- computerized databases\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Spectroscopy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/47af5087555520732f868526283bc036_MIT5_35F12_Module_1LS1.pdf",
      "content": "5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.1\nSPECTROSCOPY\n5.35 Module #1\nIntroduction to spectroscopy\nSpectroscopy permits measurement of a tremendous amount of information, often in a\nvery simple way.\nModule consists of UV-VIS, fluorescence, IR, and NMR spectroscopy experiments\nYou'll use spectroscopy to probe:\nElectronic orbitals of molecules & quantum dots (UV-VIS, fluorescence)\nVibrations of molecules (IR)\nSpin states of protons in small molecules & proteins (NMR)\nAnd you'll learn how spectroscopy works! Seek an understanding that permits creative use\nof spectroscopy to measure the information that you need, in whatever way allows it to\nbe determined.\nLight absorption\nAbsorption spectra reveal the frequencies at which light absorption occurs. These reveal\nmolecular resonances and energy levels, structure and dynamics.\nThe y-axis is absorptivity\nThe x-axis is frequency or wavelength, measured in units that are reasonable for the part\nof the spectrum you're in.\nWhy is light absorbed at some frequencies and not others?\n5.111 & 5.112 picture of light absorption: purely quantum mechanical\nLight represented as photons, molecule represented as quantized energy levels\nCorrectly conveys conservation of energy\nPhoton energy = difference between quantum state energies\nA\n(nm) or (Hz)\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.2\nImportant information is not conveyed in this picture. Molecule does not generally end up\nin a stationary state!\nClassical mechanics: complementary picture of light absorption.\n\nLight represented as a classical electromagnetic wave.\nMolecule represented as a classical harmonic oscillator, driven by the EM field\nBoth pictures convey important information!\nWe'll rely on the classical picture mostly, since your physical intuition is classical.\nTo understand spectroscopy, it's essential to understand three things.\nWhat is light?\nWhat is matter?\nHow do they interact?\nThe electromagnetic (EM) field: What it is and how it can be measured\nWe'll examine the electric field first, the magnetic field later for NMR\nBefore\nMolecule\n(Ground state)\nPhoton\nAfter\nMolecule\n(Excited state)\n(No more\nphoton)\n(a)\nGround\nstate\nExcited\nstate\nE = h = =\nhc/ = hc\n%\n\n(b)\n\nEM wave\nMolecule\n(Not vibrating)\nBefore\n\nAfter\nMolecule\n(Vibrating)\nEM wave\n(Attenuated)\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.3\n-1\n-0.5\n0.5\nE(t)\nor\nE(x)\nTime or Position\nFor a single frequency:\n\nˆ\n,\ncos\nx t\nE\nkx\nt\n\nE\n\n(1)\nNote the various features;\nPolarization unit vector ˆ (assumed time-independent)\nAmplitude E0 (assumed time-independent)\nOscillating part. A propagating wave oscillates in time and space.\nTemporal oscillation period T = 2/. Frequency in units of rad/s or s-1.\nAlternate frequency variable = 1/T = 2, units cycles/sec or Hz.\nSpatial oscillation period = wavelength = = 2/k.\nk wavevector, in units of m-1.\nSometimes we use \"wave number\" variable % = 1/, in units of cycles/m or cm-1\nPhase (assumed time-independent)\nLight speed in vacuum c = 3 x 108 m/s = /T = /k.\nSimplified scalar expression for the field at one position:\n(neglecting polarization & phase)\n\n0 cos\nE t\nE\nt\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.4\nPlease see: The Electromagnetic Spectrum\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.5\nAbsorption spectroscopy\nTo record an absorption spectrum, we need lots of frequency components.\n\ncos\ncos\ncos\ncos\nE t\nE\nt\nE\nt\nE\nt\nd\nE\nt\n\nL\n(Note we've neglected polarization & phase)\nUsually the distribution of frequencies E0() is smoothly varying. How to measure it,\nbefore and after a sample?\nAbsorption spectrometer\nUV-VIS spectrometer schematic illustration\nOcean Optics UV/VIS Spectrometer (from instruction manual). 1 optical fiber connection, 2 slit, 3 filter, 4\ncollimating mirror, 5 grating, 6 focusing mirror, 7 collector lens, 8 detector.\nDiffraction grating separates the frequency components\nIntensity of each is measured at a CCD\nIntensity\nc\nI\nE\n\n(units of Watt/m2 = Joule/s/m2)\nChange in light intensity dI() at any frequency due to sample absorption: Proportional to\n- incident intensity I0()\nImage removed due to copyright restrictions. Please see:\nOcean Optics. USB4000 Fiber Optic Spectrometer Installation and Operation\nManual. Document Number 211-00000-000-02-201201. Appendix C, p. 27.\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n1.6\n- concentration c of the absorbing species\n- absorptivity () of the sample, discussed much further later\n- for an infinitesimal sample, the thickness dL\ndI() = -() c dL I0() ≈ -() c dL I() where I() is intensity after the sample\ndI()/I() = -() c dL can be integrated to derive Beer's Law (do the derivation!)\nResult for macroscopic (thick) sample:\n\nlog\n( )\nI I\nc L\nA\n\nA() is typically displayed in an absorption spectrometer. If concentration c is in units of\nmolecules/cm3, then () is in units of cm2. If concentration is in moles/liter, then () is\nusually written as (), the extinction coefficient, in units of liter/mole-cm.\nWe'll treat () or A() below by deriving the power absorbed by a classical oscillator\nwhen it's driven by a periodic force of frequency .\nFourier transform spectroscopy (FTIR)\nInstead of separating frequency components, could measure the time-dependent field\nSimple example: Gaussian distribution of frequencies, peaked at p with bandwidth .\n\ncos\ncos\np\nt\np\nE t\nd\nE e\nt\ne\nt\n\nwith = 1/(2).\nLight field temporal profile is a pulse with a Gaussian time dependence and a duration, ,\nthat is given by the inverse of the spectral bandwidth. Let's look at such a pulse.\nPulse is short because many frequency components go out of phase and cancel at long\ntimes. Broader frequency range shorter pulse duration\nE(t)\nt\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n1.7\nIntegral above is a Fourier integral. In general, f(t) and F(w) are Fourier transforms of\neach other if they are related through the following integrals.\n\ncos\ncos\nF\nf t\nt dt\nf t\nF\nt d\n\nGeneral result: We can measure the time-dependence of the field - whatever it is,\nGaussian or otherwise - and determine the frequency-dependence taking the inverse\nFourier transform as shown above.\nThe field can be fully characterized through measurement, and mathematical description,\nin the frequency domain (measure the amplitude of each frequency component, and if\nneeded the phase also) or in the time domain (measure the time-dependent profile of the\nfield).\nHow can we determine the time-dependent profile of a light field? It oscillates too fast\nto measure electronically.\nCan measure the field optically with an interferometer.\nBeamsplitter (dashed line) transmits and reflects equal parts of the light which return to\nthe beamsplitter after reflection off the mirrors. Depending on mirror positions, they\ninterfere constructively or destructively. Detector measures oscillating intensity as\nfunction of mirror position!\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.8\n\n0 1 cos\nI t\nI\nt\n\nwhere t ' is the temporal delay between the two fields. In terms of the spatial delay x'\n\n0 1 cos\nI x\nI\nkx\n\n\"Position\" domain measurement of the field\nFourier transform of\n\ncos\n\nI k\ndx I x\nkx\ngives output as a function of wavelength through relation = 2/k\nor as a function of frequency through relation /k = c\nAs before, make measurement with & without sample in place, and compare results to\ndetermine absorption spectrum.\nWorks the same way in FTIR even with an incoherent (or partially coherent) light source\nThe sample response to light\nClassical equation of motion\n\ncos\nd Q\ndQ\nb\nKQ\naE\nt\ndt\ndt\n\nQ is the vibrational coordinate\nb is a friction coefficient\nK is the force constant\na is a coupling constant between the electric field of the light & the molecular vibration\nNote: Like the classical equations of motion generally, this is a differential equation\nTechniques for solving differential equations are taught in a math course on differential\nequations!\nWe are going to look at solutions of this equation, and you should plug them in to verify\nthat they solve it, but you are never going to have to solve a differential equation on your\nown in this module!!\nYou do not need math beyond basic calculus for any aspect of this module\n\n5.35 Module 1 Lecture Summary 1\nFall 2012\n\n1.9\nSimplest case: No driving force, no damping\nInitial condition: Stretch the spring to some initial displacement Q0, and let go\n\nSolution:\n\ncos\nQ t\nQ\nt\n\nwith resonance frequency\nK\n\n.\n\nNext simplest case: No driving force, but damping included\nInitial condition: Stretch the spring to some initial displacement Q0, and let go\n\nSolution:\n\ncos\nt\nQ t\nQ e\nt\n\n= b/2 is the damping constant\noscillation frequency\n\nFull treatment: Driving force included, damping included\nAssume steady state - driving force is on forever\nSolution:\n\nsin\nQ t\nt\n\nA\n\n1 2\naE\n\nA\n\nVibrational amplitude A() increases as the driving frequency approaches the resonance\nfrequency 0. The vibrational amplitude depends linearly on the driving field amplitude.\nPower absorbed: force x velocity. We're interested in the power averaged over a cycle of\nthe light.\n\naE\naE\nP\n\n(5)\nLorentzian function for the absorption spectrum, with width given by the damping\nconstant .\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Spectroscopy in frequency and time domains",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/5-35-introduction-to-experimental-chemistry-fall-2012/18a908091e0258ba553794ac1cd0a517_MIT5_35F12_Module_1LS2.pdf",
      "content": "5.35 Module 1 Lecture Summary 2\nFall 2012\n\n2.1\nSpectroscopy in frequency and time domains\n\nLast time we introduced spectroscopy and spectroscopic measurement.\nI. Emphasized that both quantum and classical views of spectroscopy are important\n\nQuantum mechanical - light is photons (quanta of energy), molecule is discrete states\nwith quantized energy levels\n\nClassical mechanical - light is classical EM wave, molecule is classical oscillator with\ncontinuous vibrational amplitudes\n\nIn both cases, power absorbed is highest when the light frequency is on resonance.\n\nThe two pictures are compatible because amplitude is NOT equivalent to energy in QM.\nThe system could be in a stationary state of high energy or it could be oscillating but an\nenergy measurement has some probability of yielding zero excess vibrational energy.\n\nII. We looked at the EM wave\n\nˆ\n,\ncos\nx t\nE\nkx\nt\n\nE\n\nSimpler form for molecules at fixed location (x = 0) and neglecting polarization & phase\n\n0 cos\nE t\nE\nt\n\nIII. We looked at how a conventional spectrometer works and what it measures\nIncident and transmitted light intensities at various frequencies are compared to\ndetermine the absorption spectrum of the sample\n\nBefore\nMolecule\n(Ground state)\nPhoton\nAfter\nMolecule\n(Excited state)\n(No more\nphoton)\n(a)\nGround\nstate\nExcited\nstate\nE = h = =\nhc/ = hc\n\n(b)\n\nEM wave\nMolecule\n(Not vibrating)\nBefore\n\nAfter\nMolecule\n(Vibrating)\nEM wave\n(Attenuated)\n\n5.35 Module 1 Lecture Summary 2\nFall 2012\n\n2.2\n\nBeer's law:\n\nlog\n( )\nI I\nc L\nA\n\nIV. We looked at FTIR, our first example of Fourier transform spectroscopy\n\nInterferometer measures the interference between two replicas of the field as oone\nmirror is variably delayed, revealing the EM oscillation cycles in the \"position\" domain.\n\nThe frequency content of the field can be determined through Fourier transformation.\n\ncos\ncos\nF\nf t\nt dt\nf t\nF\nt d\n\nor really FT between x and k\n\ncos\ncos\nF k\nf x\nkx dx\nf x\nF k\nkx dk\n\nNow we'll address how light interacts with the sample.\n\nImage removed due to copyright restrictions. Please see:\nOcean Optics. USB4000 Fiber Optic Spectrometer Installation and Operation\nManual. Document Number 211-00000-000-02-201201. Appendix C, p. 27.\n\n5.35 Module 1 Lecture Summary 2\nFall 2012\n\n2.3\nThe sample response to light\nWhat happens to the sample when light hits it? How does light interact with matter?\nWe'll consider IR light and molecular vibrations - similar for UV-VIS and NMR\n\nClassical equation of motion\n\ncos\nd Q t\ndQ t\nb\nKQ t\naE\nt\ndt\ndt\n\nQ(t) is the time-dependent vibrational displacement\nis the reduced mass\nb is a friction coefficient\nK is the force constant\na is a coupling constant between the electric field of the light & the molecular vibration\n\nNote: We will plug solutions for Q(t) into the equation of motion to see that they work,\nbut you will not need to find solutions for Q(t) on your own.\nYou do not need math beyond basic calculus for any aspect of this module\n\nSimplest case: No driving force, no damping\nSolution:\n\ncos\nQ t\nQ\nt\n\nwith resonance frequency\nK\n\n.\n\nWith damping:\n\ncos\nt\nQ t\nQ e\nt\n\n= b/2 is the damping constant\noscillation frequency\n\nWith the driving force:\nSolution:\n\nsin\nQ t\nt\n\nA\n\n1 2\naE\n\nA\n\nVibrational amplitude A() increases as the driving frequency approaches the resonance\nfrequency 0. The vibrational amplitude depends linearly on the driving field amplitude.\n\nThe vibrational oscillations are in phase with the driving force ( = /2) when driven far\noff resonance, out of phase ( = 0) when driven on resonance.\n\n5.35 Module 1 Lecture Summary 2\nFall 2012\n\n2.4\nPower absorbed: force x velocity. Averaged over one or many cycles:\n\naE\naE\nP\n\n(5)\n\nLorentzian function for the absorption spectrum, with width given by the damping\nconstant .\n\nThis is what is measured in an absorption spectrum: how much power gets absorbed from\nthe incident light at each frequency\n\nNote that is really a dephasing rate, which may be due to ordinary damping (loss of\nvibrational energy) but may be loss of vibrational phase coherence even when energy is\nretained. More on this later.\n\nMeasurements in the time domain\nNMR: measure\n\ncos\nt\nQ t\nQ e\nt\n\ndirectly\nRF pulse induces net magnetization vector M to precess about z axis (permanent applied\nmagnetic field direction). The component of M along x or y undergoes damped oscillations.\n\nVibrational & electronic oscillations also can be measured on ultrafast (femtosecond) time\nscales.\n\nz\ny\nx\nM\nAfter\nz\ny\nx\nM\nBefore\n\n5.35 Module 1 Lecture Summary 2\nFall 2012\n\n2.5\nIn NMR, the frequency depends on the applied magnetic field in the z direction. The\nmagnetic field strength dictates how big is the restoring force for spins to align in that\ndirection.\n\nQM picture: two spin energy levels given by z-component magnetic moment quantum\nnumber mI = 1⁄2:\n\ncos\nt\nQ t\nQ e\nt\n\ngives Lorentzian absorption spectrum through FT.\n\nA\n\nCompare generally the time domain and frequency domain signals:\n\nParameter\nTime Domain S(t)\nFrequency Domain S()\nLarge 0\nFast oscillations\nHigh frequency\nSmall 0\nSlow oscillations\nLow frequency\nLarge\nFast decay\nBroad linewidth\nSmall\nSlow decay\nNarrow linewidth\n\nE\nB\nE = h = =\nmI = +1/2\nmI = -1/2\nProton spin energy levels as a\nfunction of applied magnetic field B.\nThe proportionality constant p (no\nrelation to any damping rate) is\ncalled the gyromagnetic ratio.\n\n5.35 Module 1 Lecture Summary 2\nFall 2012\n\n2.6\nFT relation applies to any type of spectroscopy and to any time or frequency dependence!\nReproduces multiple peaks, complex lineshapes, etc.\n\nDephasing rate has several contributions:\nDamping - the energy decays back to zero\nThis happens because the vibrating molecule interacts (\"collides\") with other molecules and\ngradually stops vibrating. The vibrational energy goes into other degrees of freedom -\nother vibrational modes of the same molecule or of other molecules, or molecular\nrotational or translational motion\n\"Pure\" dephasing - the energy stays the same but the coherence decays away\nThis happens because the vibrating molecule interacts (\"collides\") with other molecules and\nthe vibrational phase gets shifted\nInhomogeneous dephasing - the energy stays the same, and the coherence remains for\nany individual molecule, but the collective coherence decays\nThis happens because different molecules might have slightly different vibrational\nfrequencies due to somewhat different environments. After awhile the oscillations at\ndifferent frequencies go out of phase\n\nAll these effects lead to decay of net (superposed) oscillation amplitude in the time\ndomain and to broadening of the absorption line in the frequency domain\n\nThe time and frequency domain signals are always related through Fourier\ntransformation, regardless of the cause of dephasing\n\nAll these dephasing contributions can occur with magnetic spins, molecular vibrations, and\nelectronic transitions\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n5.35 / 5.35U Introduction to Experimental Chemistry\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}