{
  "course_name": "Introduction to Integrated Design",
  "course_description": "During this course, we will be exploring basic questions of architecture through several short design exercises. Working with many different media, students will discover the interrelationship of architecture and its related disciplines, such as structures, sustainability, architectural history and the visual arts. Each problem will focus on one of these disciplines and one exploration and presentation technique.",
  "topics": [
    "Fine Arts",
    "Architecture",
    "Architectural Design",
    "Fine Arts",
    "Architecture",
    "Architectural Design"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 3 hours / session\n\nCourse Overview\n\nWhat goes into the design of a building? Is beauty skin deep? Does it matter which way is North? Why do buildings look different from region to region? Who will use this building? Why is drawing not only fun, but important?\n\nDuring this course, we will be exploring these questions through several short design exercises. Working with many different media, students will discover the interrelationship of Architecture and its related Disciplines, such as Structures, Sustainability, Architectural History and the Visual Arts. Each problem will focus on one of these disciplines and one exploration and presentation technique.\n\nWe will create additions to modernist structures, guest houses that operate off the grid in remote locations, places to experience art, and finally a project that will combine aspects of these projects into a community project in the Boston Seaport Area.",
  "files": [
    {
      "category": "Resource",
      "title": "assn1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/b6e2e50a87b155d8c09799efe35d5eec_assn1.pdf",
      "content": "Introduction to Integrated Design\n4.191\nFall 2006\n\nLecturer:\nAngela Watson\n\nA Pedestrian Bridge\nAssignment #1\n\nThe bridge will cross Memorial Drive to the Pierce Boathouse, touching down in the\nmiddle on the green strip in Memorial Drive. The bridge needs to be tall enough for\ntrucks and fire trucks to pass below it, and should provide an accessible path via ramps.\nAccess to the bridge should leave passage along the existing sidewalk intact.\n\nWhile there is no specific program for the bridge, you can incorporate a place/destination\nat the ends or in the middle green. Think about who will be using the bridge, how they\nwill use it, and the kind of place you would like it to be. Also consider important site\nconditions such as the proximity of the river and the volume of traffic that passes along\nMemorial Drive.\n\nPart 1\nCreate a sketch model at 1/32'=1'0\" that illustrates your approach to the design problem.\nWe will distribute a base drawing that you may use. You should attach it to cardboard or\nfoam core to give it some stiffness and create a base. Feel free to modify the base-map\nas long as you retain its scale as well as the area and orientation on the map\n\nYou should think about use of materials that reflect your intent for light and heavy\nstructure, transparency and opacity, and connections to the boathouse, the green area\nand the MIT Campus. We will review this model during desk crits on Wednesday,\nSeptember 13. You will use this exploration as a starting point for your final model.\n\nPart 2\nFor our review on Wednesday, September 20, you will focus on one section of the\nbridge that will include one end and the middle section on the green. The chosen area\nshould best represent your idea for the whole project. The model should be at 1/8\" = 1'-\n0\" and should be as detailed as possible."
    },
    {
      "category": "Resource",
      "title": "assn2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/09060c4cab857cca422829a3953d118d_assn2.pdf",
      "content": "Introduction to Integrated Design\n4.191\nFall 2006\nLecturer:\nAngela Watson\nGuest Pavilion for Ash Street House\nAssignment #2\nThe owners of Ash Street House are both professors. Through their work at the\nUniversity, they welcome international scholars into their home and need to add a\npavilion to the existing house that could accommodate one person for a very short stay.\nVisitors will use the space to sleep and work, but will share meals with their hosts. They\nwill be able to use the common bathroom inside the main house.\nThe space should include a space to sleep as well as a small sitting area with a desk\nthat the visitors could work on their laptop or on a paper. The pavilion can be\nfreestanding or attached to the existing structure. It needs to remain within the property\nand may not exceed 15' in height. Assume a floor area of 100 sf.\nPart 1\nBy Monday, October 2nd, be prepared to discuss initial design ideas with either a sketch\nmodel at 1⁄4\"=1'-0\" or a SketchUp model.\nYou should think about siting of the structure on the property and its relationship to the\nexisting house and the surrounding neighborhood. Visit the site to get a sense of the\nstreet and the houses surrounding it. (You will not be able to enter the house or the\ncourtyard or to look over the fence) Consider use of materials that complement or\ncontrast the existing structure. Finally, consider how to provide connection and privacy to\nand from the main house and its inhabitants. You will use this exploration as a starting\npoint for your final model.\nPart 2\nBy Wednesday, October 4th, you should have a draft of the following drawings:\n-\nplan at 1/4\"=1'-0\", showing the existing house with the addition\n-\ndetail plan at 1⁄2\"=1'-0\"\n-\na section and an elevation at 1⁄2\"=1'-0\"\nPart 3\nFor the final review on Wednesday, October 11th you should be prepared to present the\nfollowing:\n-\nfinal plan at 1/4\"=1'-0\", showing the existing house with the addition\n-\nfinal detail plan at 1⁄2\"=1'-0\"\n-\nfinal section at 1⁄2\"=1'-0\"\n-\ntwo final elevation at 1⁄2\"=1'-0\"\n-\neither the sketch model or the SketchUp model from Part 1 of the assignment."
    },
    {
      "category": "Resource",
      "title": "assn3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/d9b5b4043ddd94af9199a06f06e0503f_assn3.pdf",
      "content": "Introduction to Integrated Design\n4.191\nFall 2006\n\nLecturer:\nAngela Watson\n\nVisitor Pavilion for Gay Head Light\nAssignment #3\n\nThroughout its history, Gay Head Light has been an attraction to the public. It has been\nreconstructed many times and while it stands alone on top of the Gay Head Cliffs, it\nused to be attached to a Lighthouse keeper house. Today, it attracts tourists and\nwedding parties. Currently there are no services or facilities available on site and the\nhistory of the lighthouse is displayed at the Welcome to the Martha's Vineyard Museum\nin Edgartown.\n\nA new pavilion will provide services and amenities to visitors, including bathrooms, an\nexhibit area and an information desk for volunteers. The following program elements\nshould be incorporated:\n\nExhibit Area:\n300 sf\nInformation Desk:\n60 sf\nVisitor Toilet:\n60 sf\n\nThe pavilion will be used seasonally and will be closed for the November through March.\nIt should respond to the site and climate by responding to local conditions and\nminimizing energy consumption. The pavilion will use sustainable design strategies such\nas solar cells and a compositing toilet.\n\nPart 1\nBy Wednesday, October 18th, be prepared to discuss initial design ideas with a sketch\nmodel at 1/16\"=1'-0\". You should also\n\nThe pavilion should be located within the area designated on the site plan. Consider the\nfollowing:\n\n-\nSustainable design strategies\n-\npossibilities for views\n-\nrelationship to the lighthouse\n-\nthe approach to the lighthouse by visitors\n-\nprevailing winds and sun orientation\n-\nhistory of the lighthouse and its site\n\nPart 2\nTranslate the sketch model into a SketchUp model to discuss by Wednesday, October\n23rd. Use the model to explore views and approaches from land and water and to test\nsun angles. You should also develop a story for the exhibit area and link it to its\nrelationship to the lighthouse and surrounding site.\n\nPart 3\nFor the final review on Wednesday, October 25th you should be prepared to present the\nfollowing:\n-\nSupporting information on your sustainable design strategies.\n-\nA narrative of the exhibit area.\n-\nPrints of model views including a site plan, plan, entry sequence, and any other\nviews that describe the project.\n-\nA photomontage of the model in one of the images of the site.\n-\nThe 1/16\"=1'-0\" sketch model."
    },
    {
      "category": "Resource",
      "title": "assn4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/bd559a0e74b6de857082e5fd87281aa6_assn4.pdf",
      "content": "Introduction to Integrated Design\n4.191\nFall 2006\nLecturer:\nAngela Watson\nMaking a Place for Art\nAssignment #4\nFor this assignment, you will be curators. You will pick a painting, a sculpture or another\npiece of art to display on the MIT campus. You are also charged with creating a place to\ndisplay this piece. Depending on the medium to be displayed, this place can take on\nmany forms. A place for a photograph will be different from a place for a small sculpture,\nwhile a place for a large sculpture may not require a cover at all.\nThe environment the piece is displayed in can direct the viewers experience by only\nallowing for specific view angles, or it might dictate a path of movement along or around\na piece. It may not direct the viewer at all and allow for a completely independent and\nself directed experience. In any case, the place you create is highly dependent on the\nobject you are to display as well as your thought about how it is to be viewed or\nexperienced.\nEach of you will be given a site near Kresge Auditorium, which will be the location where\nyou will place your chosen object. As you develop the site, keep in mind the impact the\nother buildings near the site will have on the \"feel\" of the space.\nPart 1\nBy Wednesday, November 1, be prepared to discuss three things:\n-\nYour choice of art to be displayed. You should have images about the particular\npiece you are going to design for supported by information about its material and\nsize, its environmental needs (inside/outside), the artist.\n-\nA site \"clue\". This can be something that strikes you about the site. Bring an image,\ntext or photo, to explain your impressions.\n-\nInitial design ideas in sketch form or in sketch model.\nPart 2\nBy Monday, November 6, bring at least three freehand sketches in pen or pencil that\nshow the structure in its site. The sketches should be taken from different viewpoints at\neye level and should include surrounding buildings, trees and scale figures (people,\ncars, bicycles, dogs)\nPart 3\nFor the final review on Wednesday, November 8, you should be prepared to pin-up and\npresent the following:\n-\nThe information you complied about the object you are displaying.\n-\nInitial sketches or sketch models\n-\nA site plan (include scale, north arrows, surrounding buildings)\n-\nAt least three freehand sketches from Part 2, rendered to include shading and color."
    },
    {
      "category": "Resource",
      "title": "assn5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/da351a7aefd72ffb96fb41361503abaf_assn5.pdf",
      "content": "Introduction to Integrated Design\n4.191\nFall 2006\n\nLecturer:\nAngela Watson\n\nStudio for a Visiting Artist\nAssignment #5\n\nImagine that the Institute of Contemporary Art/Boston (ICA) will sponsor a program for\nvisiting artists. Imagine that they have been given the opportunity to develop a\nwork/exhibit space for a visiting artist on a nearby site in the Seaport area. Artist will be\ninvited to occupy the space for a year and will develop an exhibit for the ICA at the end\nof their stay. Part of their space will be an exhibit area, where they can exhibit current\nwork. They may work with different media such as performance art, sculpture, painting\nand photography.\n\nHalf of the site will be occupied by a housing development that can not exceed 55' in\nheight. The remaining half will be maintained as publicly accessible open space. The\nwork/exhibit structure will be a part of this open space, allowing for a 12' wide public\npassageway along the waterfront perimeter of the site.\n\nAssume the following program\n(You can combine different functions to create larger spaces):\n\nexhibit area\n\nexhibit\n400 sf\n\nstorage\n50 sf\n\ninformation desk\n50 sf\nstudio\n\nstudio area\n800 sf\n\nliving/sleeping area\n400 sf\n\nkitchen\n60 sf\n\nbathroom\n60 sf\ntotal\n1820 sf\n\nPart 1\nBy Wednesday, November 15, be prepared to discuss a site collage:\n-\nAt our site visit, spend some time thinking about how the site feels. Get a sense of its\nsize, its relationship to the city, its relationship to the ICA and the future development\nplanned for the adjacent parcel.\n-\nBring back first impressions from the site and create a 12\"x12\" board that describes\nyour thoughts. You can use a variety of media such as found objects, photos and\nother images, copies, magazine clippings, materials and sketches.\n\nPart 2\nBy Monday, November 20, build 3 or more sketch models at 1/32\"=1'-0\". The model\nshould address the studio/exhibit space, as well as the open space around it.\n-\nConsider the relationship of the studio and exhibit space with the adjacent\ncondominium building and the surrounding structures.\n-\nConsider the view from the open area and from the street and the views from the\ntaller buildings around you.\n\nPart 3\nFor our intermediate review on Wednesday, November 22, be prepared to discuss and\npresent a final sketch model, together with the 12\" x 12\" collage.\n\nPart 4\nNow that you have made the model transition to 1/16\"=1'-0\", you are ready to move up\nto plan sketches at 1/16\"=1'-0\". As part of the model, you have been thinking about\narrangement of spaces as well as building enclosure. For Wednesday, November 29,\ndevelop plan sketches for both levels and include the entire site in the ground level plan.\n\nPart 5\nDevelop a 1/8\"=1-0\" model for review December 6\n\nFor class on December 11, be prepared to discuss a cartoon layout for your presentation\nthat shows number and type of drawings, and the organization on the wall or sheet.\nThink about which section you will be cutting, how large your drawing sheets need to be,\nand which elevation you will draw. You should \"block\" out these drawings to help you\nunderstand their size and complexity. As you progress with your model, you can start to\nfill in the details.\n\nPart 7\nFor the final review on December 22, be prepared to present the following:\n\n1. Presentation Model .................................. 1/8\"=1'-0\"\n2. Site Plan with surrounding buildings ......... 1/32\"=1'-0\"\n3. Floor Plans including immediate site ........ 1/8\"=1'-0\"\n4. 1 Elevation................................................. 1/8\"=1'-0\"\n5. 1 Section ................................................... 1/8\"=1'-0\"\n6. Choice of two of the following:\na. Photomontage\nb. SketchUp model\nc. Perspective Sketches"
    },
    {
      "category": "Lecture Notes",
      "title": "lect1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/38017f1b674efd9997e0c9c7675f0962_lect1.pdf",
      "content": "Introduction to Integrated Design\n\nBridges lecture\n\nLinking London: The Millenium Bridge\n\n- MILLENNIUM BRIDGE FACTFILE:\n\nDesigned by: Architect Sir Norman Foster with sculptor Sir Anthony Caro and\nengineers Arup\n\nOpened: 10th June 2000 | Closed: 12th June 2000\n\nReopened: 27th February 2002\n\nLength: 330m / Width: 4m / Height above river at high tide: 10.8m / Handrail\nheight: 1.2m\n\nPiers: Concrete and steel / Cables: 120mm locked coil / Decking: Aluminium /\nHandrail: Bead blast stainless steel\n\nBasic Bridge Types\n\n- Girder. Span 30'-600'.\n- Arch. Span 120'-450'.\n- Truss. Span 120'-1500'.\n- Cable stayed. Span 330'-1400'.\n- Rigid frame. Span varies.\n- Suspension. Span 210'-3000'+.\n\nBridges Within Context\n\n- Spider web\n- Natural stone bridge\n- Log bridge\n- Stairs and paths on hillsides\n- Wooden bridges for walking\n- Rope bridges\n- Suspension bridges - Capilano Suspension Bridge: George Grant Mackay, the Scottish\ncivil engineer who built the original suspension bridge in 1889.\n- Canal bridge: A channel-bridge over the River Elbe joins the former East and West\nGermany, as part of the unification project. It is located in the city of Magdeburg, near\nBerlin.\n- Roman bridges.\n- Iron bridges.\n- Bridge of Truth, Germany.\n- Rialto Bridge, Venice. Antonio da Ponte.\n- Santa Monica Pier.\n- Cable stayed bridges.\n- Golden Gate Bridge, Strauss and Ellis, San Francisco.\n- Blackfriars Railway Bridge, London.\n\n- Amsterdam: bridges over canals.\n- Ponte Vecchio, Florence, 1345.\n- Wooden truss and arch bridges.\n- Covered bridges.\n- Kapellbrucke: A 204 m (670 ft) long bridge crossing the Reuss River in the city of\nLucerne in Switzerland. The covered bridge, constructed in 1333, was designed to help\nprotect the city of Lucerne from attacks.\n- Dancing bridge: Roayl Ballet School and the Opera House. Wilkinson Eyre.\n- Mur Island, Vito Acconci.\n- Zubizuri (White Bridge), Santiago Calatrava, Bilbao Spain.\n- Logan International Airport Elevated Walkways.\n\nAssignment Background\n\nA Pedestrian Bridge over Memorial Drive\n- site and precedent"
    },
    {
      "category": "Lecture Notes",
      "title": "lect2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/cda7c84b18911751f7a6288819f96b1b_lect2.pdf",
      "content": "Introduction to Integrated Design\nA Guest Space for Ash Street House lecture\n- Context: Modern Architecture 1920-1945\nJoost Schmidt\nBauhaus\nMarcel Breuer\nWalter Gropius\nMarianne Brandt\nWilhelm Wagenfeld\nMies van der Rohe\nOskar Schlemmer\n- Farnsworth House, Mies van der Rohe\n- Breuer House, Marcel Breuer\n- Villa Savoie, Le Corbusier\n- Gropius House, Walter Gropius\n- Barcelona Pavilion, Mies van der Rohe\nGerman Pavilion for the International Exposition in Barcelona, 1929\n- Chamberlain Cottage and addition, Marcel Breuer with Walter Gropius\nAssignment background\n- \"Machine Art\" installation, Philip Johnson, 1936 Museum of Modern Art\n- Glass House, Philip Johnson\n- Ash Street house, Philip Johnson 1942"
    },
    {
      "category": "Lecture Notes",
      "title": "lect2extra.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/10d77b1b76309ca00b3299a220f4cbea_lect2extra.pdf",
      "content": "Modern Architecture 1900-1960\n1900s\n1909 - Frank Lloyd Wright completes the Robie House near Chicago.\n1908 - Adolf Loos publishes his essay \"Ornament and Crime\".\n1907 - Gaudi completes the Casa Batllo in Barcelona.\n1906 - Lucien Weissenburger completes his own house, a striking example of the Art Nouveau style in Nancy, France.\n1905 - Wright designs Unity Temple in Oak Park, Illinois.\n1904 - Otto Wagner completes his Post Office Savings Bank Building in Vienna.\n1903 - Josef Hoffmann finishes the Moser House in Vienna.\n1902 - Otto Wagner's Viennese Stadtbahn railway system is completed.\n1901 - Peter Behrens completes his house at the Art Nouveau colony at Darmstadt, Germany.\n1900 - The Gare d'Orsay, now the famous Musee d'Orsay, is built in Paris by Victor Laloux.\n1910s1910s\n-1919 - Walter Gropius founds the Bauhaus in Weimar, Germany.\n-1918 - Birth of Jørn Utzon, designer of the Sydney Opera House.\n-1917 - Georges Biet's Art Nouveau house and apartment building in Nancy, France is severely damaged by combat shells,\nbut will be rebuilt nearly exactly as before in 1922.\n-1916 - De Stijl movement founded in the Netherlands.\n-1915 - Le Corbusier completes studies for his Dom-ino Houses.\n-1914 - Walter Gropius designs his Fagus Shoe Factory.\n-1913 - Cass Gilbert completes the Woolworth Building in New York.\n-1912 - Frank Lloyd Wright begins work on Taliesin in Spring Green, Wisconsin.\n-1911 - Josef Hoffmann completes the Palais Stoclet in Brussels.\n-1910 - Gaudi finishes the Casa Mila in Barcelona.\n\n1920s\n-1929 - Barcelona Pavilion designed by Ludwig Mies van der Rohe.\n-1928 - Hector Guimard builds his last house in Paris.\n-1927 - The Weissenhof Estate, an exhibition of apartment houses designed by leading modern architects, held at Stuttgart,\nGermany.\n-1926 - Antoni Gaudi and Louis Majorelle die.\n-1925 - Bauhaus at Dessau designed by Walter Gropius.\n-1924 - Gerrit Rietveld completes the Schroder House in Utrecht.\n-1923 - Le Corbusier publishes Vers une architecture (English title: Towards A New Architecture), a summary of his ideas.\n-1922 - Monument to the Third International designed by Vladimir Tatlin (unbuilt).\n-1921 - Frank Lloyd Wright completes his Hollyhock House for Aline Barnsdall in Los Angeles, begun in 1917.\n-1920 - The Einstein Tower in Potsdam, designed by Erich Mendelsohn, is completed.\n1930s\n-1939 - The 1939 World's Fair in New York includes the Finnish Pavilion by Alvar Aalto and the Brazilian Pavilion by Lucio\nCosta and Oscar Niemeyer.\n-1938 - Frank Lloyd Wright purchases 800 acres of land 26 miles away from Phoenix, and begins to build Taliesin West, his\nwinter home, in Scottsdale, Arizona, USA\n-1937 - Wright completes his house Fallingwater, at Bear Run, Pennsylvania.\n-1936 - Frank Lloyd Wright designs his monumental inward-looking Johnson Wax Headquarters in Racine, Wisconsin, USA.\n-1935 - Cass Gilbert's United States Supreme Court Building is posthumously finished.\n-1934 - Frank Lloyd Wright draws up plans for his Broadacre City, a decentralized urban metropolis.\n-1933 - The Bauhaus closes under Nazi pressure.\n-1932 - The Museum of Modern Art (MoMA) in New York holds its exhibition on modern architecture, coining the term\n\"International Style.\"\n-1931 - The Empire State Building, designed by Shreve, Lamb and Harmon, becomes the tallest building in the world.\n-1930 - William Van Alen completes the Chrysler Building, an Art Deco skyscraper in New York, USA.\n\n1940s\n1949 - Charles and Ray Eames build the Eames House, also known as Case Study House #8, in Pacific Palisades, CA,\nUSA.\n1948 - Pietro Belluschi completes the Equitable Building in Portland, Oregon.\n1947 - Alvar Aalto builds his Baker House at MIT.\n1946 - Le Corbusier draws up plans for La Rochelle-La Pallice, while his efforts to redesign Saint-Die-des-Vosges (both cities\nin France) are foiled.\n1945 - John Entenza launches the Case Study Houses Program through his post as editor of Arts and Architecture\nmagazine.\n1944 - Frank Lloyd Wright builds the research tower for his Johnson Wax Headquarters in Racine, Wisconsin.\n1943 - Oscar Niemeyer completes his Pampulha project in Brazil.\n1942 - Vichy rejects Le Corbusier's Obus E plan for Algiers.\n1941 - Le Corbusier offers his services to the Vichy regime.\n1940 - Peter Behrens dies.\n1950s\n1959 - Frank Lloyd Wright's Guggenheim Museum in New York is finished after 16 years of work on the project.\n1958 - The Seagram Building in New York designed by Ludwig Mies van der Rohe and Philip Johnson is completed.\n1957 - The Interbau 57 exposition of apartment blocks in Berlin features structures by Alvar Aalto, Walter Gropius and his\nThe Architects' Collaborative (TAC), and an unite by Le Corbusier.\n1956 - Crown Hall at the IIT, Chicago, designed by Mies van der Rohe, finished.\n1955 - Completion of Le Corbusier's Notre-Dame-du-Haut chapel at Ronchamp, France.\n1954 - Louis Kahn finishes his Yale University Art Center in New Haven, CT, USA.\n1953 - Completion of the United Nations Headquarters in New York by a design team headed by Wallace Harrison and Max\nAbramowitz.\n1952 - Le Corbusier completes his Unite d'Habitation in Marseilles.\n1951 - Mies van der Rohe's Lake Shore Drive Apartments completed in Chicago.\n1950 - Farnsworth House by Mies van der Rohe finished.\n\nMarcel Breuer\n-\nKnown as Lajko, Breuer studied and taught at the Bauhaus in the 1920s,\nstressing the combination of art and technology, and eventually became the\nhead of the carpentry shop there. He later practiced in Berlin, designing\nhouses and commercial spaces, as well as a number of tubular metal\nfurniture pieces, replicas of which are still in production today.\n-\nBreuer may be best known for his design of the Wassily Chair, the first\ntubular bent-steel chair, designed in 1925 for Wassily Kandinsky and inspired\nin part by bicycle handlebars. Still in production, the chair can be assembled\nand disassembled most easily with bicycle tools.\n-\nIn the 1930's, due to the rise of the Nazi party in Germany, Breuer relocated\nto London. While in London, Breuer was employed by Jack Pritchard at the\nIsokon company; one of the earliest introducers of modern design to the\nUnited Kingdom. Breuer designed his Long Chair as well as experimenting\nwith bent and formed plywood. Breuer eventually ended up in the United\nStates. He taught at Harvard's architecture school, working with students\nsuch as Philip Johnson and Paul Rudolph who later became well-known U.S.\narchitects. At the same time, Breuer worked with old friend and Bauhaus\ncolleague Walter Gropius, also at Harvard, on the design of several houses in\nthe Boston area"
    },
    {
      "category": "Lecture Notes",
      "title": "lect3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/d6baee6752968d10949e2a36bc32f6d6_lect3.pdf",
      "content": "Introduction to Integrated Design\nVisitor Pavilion for Gay Head Light House lecture\nEnvironmental Design\n- Zion National Park Visitor Center: trombe wall, PV cells, clerestory windows, cooling towers\n- MA Audubon Society, Wellfleet Visitor Center\n- Direct gain heating\n- Thermal mass\n- Heat pump\n- Graywater, composting\n- Wind and solar power\nGay Head\n- Southeastern MA\n- Gay Head sailing and fishing history\n- Rocky shoals\n- History of the lighthouse as a farm\n- Then as a restaurant, tourist attraction\n- Examples of lighthouses\n- Description of the site and surroundings"
    },
    {
      "category": "Lecture Notes",
      "title": "lect3les.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/510b461062501b9e6bc0f2b91cb54452_lect3les.pdf",
      "content": "Gay Head Lighthouse Visitor's\nCenter - Environmental\nOpportunities\nLes Norford\nJanuary 16, 2007\n\nBeautiful site but what about\nutilities?\n- Avoid the approach of the affluent\n- Somebody has to pay, for energy and\nenvironmental degradation\n- Water may be scarce (as it is on Cape\nCod)\n- Please do not compartmentalize BT and\nDesign\n\nThings to think about\n1.\nWarmth in spring and autumn\n2.\nComfortable indoor environment in summer\n3.\nHuman waste disposal without sewer or septic system\n4.\nWater conservation\na.\ngreywater recycling for irrigation\nb.\nrainwater capture\n5.\nLittle or no need for off-site fuels\na.\nConservation\nb.\nOn-site electricity and hot-water production using renewable\nsource (maybe)\n6.\nResponsible choice of materials\n\n1. Warmth in cool weather\n- Key factors\n- Insulation\n- Windows for solar energy\n- Heat-absorbing mass to regulate indoor\ntemperature\n\nPassive solar heating\n- Direct gain\n- Sunspace\n- Trombe wall\n\nA Simple Direct Gain SystemDirect gain solar heating through windows.\nDirect gain solar\nh\neating through windows.\nFigure by MIT OCW.\n\nClerestory - another form of direct-gain\nsystem\nDirect gain solar heating throu\ngh a clerestory.\nFigure by MIT OCW.\n\nSunspace with mass wall added\nHea\nting\nusing a sun\nspace and m\nass wall.\nFigure by MIT OCW.\n\nTrombe Wall Diagram\nDiagram of a trombe wall.\nFigure by MIT OCW.\n\nTrombe Wall with VentsDiagram of a trombe wall with vents.\nDiagr\nam of a t\nrombe wall w\nith vent\ns.\n\nPassive Solar Heating\n\nTaking advantage of free heating\nfor \"elfhouse\"\n-10\n00:13.0\n45:13.0\n30:13.0\n15:13.0\n00:13.0\n45:13.0\n30:13.0\n15:13.0\n00:13.0\n45:13.0\n30:13.0\n15:13.0\n00:13.0\n45:13.0\n30:13.0\n15:13.0\n00:13.0\n45:13.0\n30:13.0\n15:13.0\n00:13.0\n45:13.0\n30:13.0\n15:13.0\n00:13.0\nTime (hours)\nTemperature (degrees C)\nAverage Temperature First Week = 16.9 deg C\nAverage Temperature Second Week = 17.3 deg C\n\nInsulation, glass and mass for a full-\nsize house\n- Walden, made of 15 cm extruded polystyrene (no\nopenings, no airflow):~1,000 W of heat needed at 0 oF.\n- Henry David needs fresh air, which requires another\n500 W to heat.\n\nWalden with south-facing, double-pane\nglazing and water for thermal storage\nIndoor and outdoor temperatures\n-30\n-20\n-10\n91 100 109 118 127 136 145 154 163\ntime (hour)\ntemperature (oC)\nTout\nTin,n\n5 m2 glazing, 1000 kg water\n\nPassive solar design guidelines\n- South glass - within 30o of due south\n- Glass area ~12% of floor area\n- Mass area ~ 6x glass area\n- Rules from\nhttp://www.wbdg.org/design/psheating.php\n\nTry these guidelines - they look\npretty good!\nIndoor and Outdoor Temperatures\n-10.0\n-5.0\n0.0\n5.0\n10.0\n15.0\n20.0\n25.0\n30.0\n35.0\n105 118 131 144 157\ntime, hours\ntemperature, oC\nTout\nTin,n\n\n2. Keeping cool in the summer\n- Shade the windows\n- Control internal heat sources\n- Use natural ventilation to keep indoor\ntemperatures close to outdoor values\n- Wind-driven\n- Buoyancy-driven\n- Use thermal mass and restrict airflow\nduring the day when daytime temperatures\nare hot\n\nWind-driven flows for Gay Head\n- Better choice than buoyancy-driven flows\n- Open site\n- Low building\n- Need cross ventilation path\n- A few m2 on both the windward and leeward\nsides should be enough\n- Need exposed thermal mass for night\ncooling (but it's necessary for passive\nheating in winter)\n\n3. Waste disposal\nClivus Multrum\ncomposting toilets\nNote: need electricity (AC\nor DC) and small amounts\nof water (1-3 gal/day for\ncomposter, 3 oz. per flush\nfor foam-flush toilet)\n\n4. Water conservation\na. Graywater systems\n- Reduces use of potable water for irrigation\n- Good for plants\n- Reduces energy and chemicals associated with\npotable water systems\n- Recharges groundwater\n- Reduces strain on existing sewage and septic\nsystems (if available)\n- Reclaims otherwise wasted nitrogen and\nphosphorus\n- Information source:\nhttp://greenbuilding.typepad.com/naturecenter/\n\nWellfleet system\n- Toilet water is added to\ngreywater stream\n- System includes filters\n- Plants in bog garden take\nup nitrogen\n- Run-off is desirable for\nsurrounding area\n- State and local codes must\nbe followed\n- Greywater central for\ninformation:\nhttp://www.oasisdesign.net/\ngreywater/index.htm\n\n5.a. Energy conservation\n- Lights - no incandescents\n- Fans\n- Computers - flat-panel displays, shut\ndown when not in use\n- Refrigeration\n- Hot water - low-flow, low standby losses\n\nOn-site photovoltaic system\nNOT economical for houses - consider fuel switch\nfor fridge and hot-water\n5.b. Renewable electricity\nE\nner\ngy sa\nvings\nvs.\ncost\ng\nr\na\np\nh.\nFigure by MIT OCW.\n\nPV Basics\n-\nAbout 1000 W/m2 from the sun, maximum\n-\nPV cells are 12-20% efficient in converting solar irradiance to\nelectricity\n-\nA 1 m2 panel will produce about 150 Watts of DC electricity, under\npeak sun conditions\n-\nFor New England, sizing rules are based on 4.5 hours/day of peak-\nequivalent sun\n-\nA 1 m2 panel will therefore produce about 675 Whr of electricity\n-\nAdd up all electrical loads and include 20-40% sizing margin for\nsystem losses (inverter, storage)\n-\nExample: 10 kWh/day (my house) would require ~ 15 m2 of PV\npanels before storage loss adder, 20 m2 with losses\n-\nAn array of 20 m2 produces 3 kW peak (remember for comparison\nwith wind)\n-\nInstall on roof or on ground\n\nWind turbine basics\n- Freshman physics: power = force x\nvelocity\n- Force is pressure x area\n- Wind pressure = 1⁄2 ρ v2\n- Wind power = 1⁄2 ρ v2 π r2 v = 1⁄2 ρ π r2 v3\n- For r = 1 m and v = 1m/s, P ≅2 W\n- r = 1.5 m and v = 6 m/s, P ≅0.91 kW\n\nWind turbine basics\n- Efficiency http://en.wikipedia.org/wiki/Wind_power\n- 59% theoretical maximum\n- 30% theoretical maximum for propeller-type\nturbines\n- 35% achievable for vertical axis \"egg beaters\"\n- 10-20% achievable for propellers\n\nWind turbine examples\n- US DOE example\n(http://www.eere.energy.gov/consumer/your_home/electricity/index.cfm/myt\nopic=11010)\n- 1.5 kW turbine will provide 300 kWh/month\n(10 kWh/day) in an area with an average wind\nspeed of 14 mph (6.3 m/s)\n- Bergey (wikipedia example)\n- 1.5 kW turbine: 1.5 m radius blades, 21 m\ntower\n\n6. Material selection\n- Recycled tire\nflooring at\nWellfleet\n- Anti-slip\n- Durable\n- Easy to maintain"
    },
    {
      "category": "Lecture Notes",
      "title": "lect4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/4-191-introduction-to-integrated-design-fall-2006/2c59f36d3e4a920f6b7b36078b8f6c94_lect4.pdf",
      "content": "Introduction to Integrated Design\nA Place for Art lecture\nAssignment background\n- Site and precedent\n- Example works\nBrancusi\nRauschenberg\nAdams\nKirchner\nCezanne\nVan Gogh"
    }
  ]
}