{
  "course_name": "Introduction to Contemporary Hispanic Literature",
  "course_description": "This course studies representative twentieth and twenty-first-century texts and films from Hispanic America and Spain. Emphasis is on developing strategies for analyzing the genres of the novel, the short story, the poem, the fictional film, and the theatrical script. The novels read this semester are Magali García Ramis’s Felices días, Tío Sergio (1986, Puerto Rico) and Javier Cercas’s Soldados de Salamina (2001, Spain). We will study Lorca’s play “La casa de Bernarda Alba” (1936, Spain), films from Spain, México, and Cuba, poems by Darío (Nicaragua), Machado (Spain), Lorca (Spain), Hernández (Spain), Vallejo (Perú), Cernuda (Spain), and Luis Palés Matos (Puerto Rico), and short stories from México (by an exiled Spanish writer), Chile, Argentina, and Cuba. Thematic emphasis is on the Spanish Civil War, changing attitudes toward gender, the Spanish-speaking Caribbean, and the history of race in the Americas.",
  "topics": [
    "Humanities",
    "Language",
    "Spanish",
    "Literature",
    "International Literature",
    "Humanities",
    "Language",
    "Spanish",
    "Literature",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nDiscussions: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course studies representative twentieth and twenty-first-century texts and films from Hispanic America and Spain. Emphasis is on developing strategies for analyzing the genres of the novel, the short story, the poem, the fictional film, and the theatrical script. The novels read this semester are Magali Garcia Ramis's\nFelices dias, Tio Sergio\n(1986, Puerto Rico) and Javier Cercas's\nSoldados de Salamina\n(2001, Spain). We will study Lorca's play \"La casa de Bernarda Alba\" (1936, Spain), films from Spain, Mexico, and Cuba, poems by Dario (Nicaragua), Machado (Spain), Lorca (Spain), Hernandez (Spain), Vallejo (Peru), Cernuda (Spain), and Luis Pales Matos (Puerto Rico), and short stories from Mexico (by an exiled Spanish writer), Chile, Argentina, and Cuba. Thematic emphasis is on the Spanish Civil War, changing attitudes toward gender, the Spanish-speaking Caribbean, and the history of race in the Americas. This is a HASS-D subject.\n\nPrerequisites\n\nThe prerequisite is one intermediate subject in Spanish or permission of the instructor.\n\nTexts\n\nYou will need to purchase two books. Please make sure to purchase only the editions I have requested for the class. We all need to be on the same page. The texts are:\n\nRamis, Magali Garcia.\nFelices dias, Tio Sergio\n. 13a ed. San Juan, P.R.: Editorial Cultural, 2005. ISBN: 9781567580051.\n\nCercas, Javier.\nSoldados de Salamina\n. Madrid, Spain: Tusquets-Andanzas, 2001. ISBN: 9788483101612.\n\nBooks on Reserve and Photocopies\n\nI will submit a long list of books to be placed on reserve for this subject. At the beginning of the semester, the Library may still have only a few titles on its Web page. Be patient. I will ask the librarians to start placing titles that you may wish to consult during the first five weeks of class, and it may take them up to a week to put these on. There will also be a certain number of photocopies that will be distributed in class. You will be charged for these at the end of the semester.\n\nFilms\n\nWe will be seeing and discussing four films this semester. The Humanities Film Office will schedule public screenings of these films, which will be at 7:00 in the evening. The dates are indicated in the syllabus. Unless you have a valid excuse or conflict, it is obligatory that you attend these showings. Attendance will be taken. Every student is expected to have seen the films before we discuss them in class.\n\nAll films can also be viewed in the Language Learning and Resource Center (LLARC): Our films will have scheduled viewing times in the LLARC. You can see the film on the ODD hour anytime the LLARC is open. So if you look at the LLARC's schedule on its webpage, this means that Monday - Thursday, our films will show at 9 and 11 a.m., and 1, 3, 5, 7, and 9 p.m. Friday, the last showing is at 1 pm (because the LLARC closes at 3), and Sunday, the first showing is at 3 p.m. (when the LLARC opens). This way you will know exactly when you can expect to pick up the movie to begin viewing it in one of the LLARC's studios. If you want to start viewing the film before the scheduled times, and no one is watching it, you can start when you want, but if someone comes to watch the film at the ODD hour, you will have to start the film over again, in a studio, at that time. The studios accommodate up to ten students at any one time. You might like to arrange to see the film with other classmates and discuss it with them afterwards.\n\nPlagiarism\n\nAccording to Webster's New Collegiate Dictionary, to plagiarize is \"to steal and pass off (the ideas or words of another) as one's own: use (a created production) without crediting the source; to commit literary theft: present as new and original an idea or product derived from an existing source.\"\n\nThis includes copying something out of a book, newspaper, journal or any other printed source, as well as electronic resources such as the World Wide Web without the appropriate acknowledgement. According to this definition, plagiarism would also include the following:\n\nusing material created by another student at your school or anywhere else and passing it off as your own (with or without their consent).\n\nusing a paper-writing \"service\" which offers to sell written papers for a fee.\n\ntranslations (with or without translation software) of texts from other languages and submitting them as your own work.\n\nPlagiarism is an extremely serious academic offence. Students should be aware that they will be severely penalized if caught engaging in any form of plagiarism. If you have any questions or doubts about how to document the sources of your ideas, please consult your instructor. For further information you can consult the MIT Libraries:\nWhat is plagiarism and how to avoid it\n.\n\nGrading\n\nOver the weekend of the first week, students will inform professor of which of the following three options they prefer. The instructor will announce the option she has chosen after reading the student feedback. [Note: the instructor chose Option #1, although with varying numbers of pages per paper, for the Fall 2007 semester.]\n\nI. Option #1\n\nACTIVITIES\n\nPERCENTAGES\n\nSeven 3-page papers\n\n60%\n\n3-hour final exam\n\n15%\n\nClass performance\n\n25%\n\n1. Papers. Note: This is a HASS-D subject and therefore requires a minimum of 20 pages of student writing distributed throughout the semester. There will be seven (7) scheduled paper assignments with a total of 21 pages. Only twenty (20) of these pages, however, will count for your semester grade. One informal one-page paper will count as a rough draft in preparation for a three-page paper that will be a rewrite and expansion of the one-page informal paper.\n\nEach written page will count for up to three (3) percentage points. Therefore, each paper is worth the maximum number of possible pages X 3.\n\n7 papers, with a total of 21 pages (minus 1 page = the paper counted as a rough draft) = (a total of 20 pages) X 3 = 60 points, or 60% of the final grade.\n\n2. Final exam = 15 points or 15% of the final grade.\n\n3. Class performance (including attendance, quality and quantity of class participation, and oral reports) = 25 points or 25% of final grade.\n\nII. Option #2\n\nACTIVITIES\n\nPERCENTAGES\n\nFive 4-page papers\n\n60%\n\n3-hour final exam\n\n15%\n\nClass performance\n\n25%\n\nIII. Option #3\n\nACTIVITIES\n\nPERCENTAGES\n\nSix short essays of variable length\n\n60%\n\n3-hour final exam\n\n15%\n\nClass performance\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "El pan nuestro",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/73462dbf81dbd89e9d89e8486864b919_MIT21G_716F07_ColomVallejo.pdf",
      "content": "Colom 1\nFormatted: Font: 16 pt\nJessica Colom=1689 pals.\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nProf. E. Garrels\n21G.716\n28 de septiembre 2007\n\"Un hombre pasa con un pan al hombro\" y \"El pan nuestro:\"\nDieciocho anos para Vallejo\nA traves del analisis y comparacion entre \"El pan nuestro\" y\n\"Un hombre pasa con un pan al hombro\" de Cesar Vallejo, salen a\nla luz los cambios en la vida del poeta en el transcurso de los casi\nveinte anos que separan a los dos ejemplares. En el primero,\nescrito [publicado] en 1919, Vallejo se muestra mas dramatico y\nromantico al escribir sobre la pena y la pobreza de la gente. En el\nsegundo, escrito en 1937 a menos de un ano de su muerte, Vallejo\nintercala mecanicamente preguntas introspectivas con imagenes\nmundanas --y hasta penosas y miseras-- de lo que pasa a su\nalrededor. En ambos, se refleja cierto sentimiento de culpa por no\nser menos egoista y mas dado a otros, lo cual se ve menos marcado\nen el segundo poema, con el que Vallejo mas bien da a entender su\nFormatted: Font: 16 pt\n\nColom 2\ndesprecio por el egocentrismo y las banalidades personales ante un\nmundo tan sufrido. Para entender mejor las diferencias y\nsimilitudes entre los dos poemas y asi interpretar los estados de\nanimo de Vallejo, cabe valerse del analisis de los recursos literarios\nempleados, como la composicion de las estrofas, la rima, el\nlenguaje figurado y la persona gramatical.\nEn \"El pan nuestro,\" Vallejo trata el tema de la injusticia\nsocial, pero se adentra en una relacion mas personal con los\noprimidos que en el segundo poema, y hasta alude a la religion.\nEmpezando por el titulo, \"El pan nuestro\" parece ser un rezo, una\nsuplica que trae a la mente \"El padre nuestro,\" donde Vallejo ha\nsustituido \"padre\" por \"pan.\" [Hace esta sustitucion en el titulo,\npero el verso \"¡El pan nuestro de cada dia danoslo,\" viene, con\nretoques, de la oracion del \"Padre nuestro.\"*]Aunque Vallejo\nDeleted: s\nFormatted: Font: 16 pt\nDeleted: s\nmenciona a Jesu risto y al \"Senor,\" esta sustitucion parece indicar\nDeleted: C\nc\nque el poeta ya no cree (o quizas nunca creyo) que la fe sea\nsuficiente para sustentar el animo de los pobres, por lo cual cambia\nel \"padre,\" lo etereo, por el \"pan,\" lo practico y material que a la\nFormatted: Font: 16 pt\n\nColom 3\nmisma vez se convierte en un simbolo de regocijo. [Por lo menos\nse siente lo suficientemente distanciado de la autoridad de la\nreligion de sus padres para poder tomar libertades con la\nrepresentacion de los ritos sagrados de la iglesia, cosa que algunos\npodrian llamar una falta de respeto.] Esta alusion a la religion,\ninexistente en el segundo poema [Bien], indica que en ese entonces\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nDeleted: inculcarle\naun era vigente la influencia de su familia, quien trato de preparar\na Vallejo para el sacerdocio.1 Tambien vale notar que en este\npoema el pan juega un papel central, mientras que en \"Un hombre\npasa con un pan al hombro\" el pan es simplemente parte de una de\nlas imagenes que Vallejo plasma. [Bien]\nLa tecnica y retorica que caraterizan al poema revelan que\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nDeleted: e\neste es de indole mas personal que el segundo. Los versos son\nendecasilabos en su mayoria, con algunas excepciones de arte\nmenor y rima consonante esporadicamente, lo cual lo hace mas\nromantico [Creo que efectivamente es mas romantico pero no por\nlas razones que has dado arriba; creo mas bien que lo romantico se\ninsinua por los signos de exclamacion y en general por el tono\nFormatted: Font: 16 pt\n\nColom 4\nemocional subido y el enfasis en el yo del poeta.]que el segundo.\nVallejo usa signos de exclamacion con frecuencia, como en los\nversos \"¡El pan nuestro de cada dia danolos/ Senor...!,\" dando un\ntono mas dramatico e indicando una fuerte emocion. [Si, de\nacuerdo] Vallejo utiliza tambien la personificacion cuando escribe,\npor ejemplo, \"Pestana matinal, no os levanteis!,\" y \"(...) la tierra/\ntrasciende a polvo humano y es tan triste, \" y metaforas como\n\"(...)una carreta que arrastrar parece/ una emocion de ayuno\nencadenada!\" y \"(...)en el horno de mi corazon...!\" Este estilo\ndifiere significantemente con el del segundo poema, en el cual no\nse aprecia el lenguaje figurado y se nota un tono mas pragmatico,\nconversacional, .\nEn \"El pan nuestro,\" la culpa que siente Vallejo se ve mas\nacentuada que en \"Un hombre pasa con un pan al hombro.\" Ello se\nevidencia en la cuarta estrofa del poema en frases como \"Todos\nmis huesos son ajenos; /yo talvez los robe!,\" \"(...) pienso que, si\nno hubiera nacido, /otro pobre tomara este cafe!\" y \"(...) A donde\nire!\" Con la primera frase el poeta comunica su impresion de que\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\n\nColom 5\ntodo aquello en que se apoya podria pertenecerle a otro, y con la\nsegunda da a conocer cuan extremadamente culpable se siente,\ncontemplando el no haber nacido por darle a \"otro pobre\" lo que a\nel le ha tocado. La tercera frase sugiere que Vallejo se pregunta si\nira al cielo o al infierno, lo cual revela una vez mas su cargo de\nconciencia. [interesante]\nOtro aspecto que separa a los dos poemas es la persona\ngramatical empleada por Vallejo en cada uno. En \"Un hombre pasa\ncon un pan al hombro,\" Vallejo habla siempre [no, solo 2 veces]en\nprimera persona, mientras que en \"El pan nuestro\" utiliza varias.\nIntroduce primero una voz impersonal o general, en frases como\n\"Se bebe el desayuno (...)\" y \"Se quisiera tocar todas las puertas,\"\ny luego habla en primera persona: \"quisiera yo tocar todas las\npuertas.\" Se puede arguir que, a diferencia del segundo poema,\nVallejo adopta esta voz general, ademas de hablar en primera\npersona, como una forma de permitir al lector, a todos, tomar su\nposicion y sentir como el siente por los sufridos. [tambien tal vez\ncomo un mecanismo de defensa, al principio negando o\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\n\nColom 6\ndistanciandose de la responsabilidad personal pero despues\naceptandola]\nHasta este punto, se puede especular que Vallejo escribe \"El\npan nuestro,\" como muchos otros poemas de la epoca, bajo el\nefecto de sus vivencias en las minas de Quiruvilca y la hacienda\nazucarera Roma, donde trabajo en 1911 al suspender sus estudios\nen Trujillo por dificultades monetarias.2 Segun la biografia escrita\npor su esposa, Georgette de Vallejo, aunque su esposo gozaba de\nuna buena posicion y salario, fue muy afectado por el maltrato y\nsufrimiento del obrero comun en estos lugares.3 Es decir, los datos\nbiograficos de esta epoca en la vida de Vallejo ayudan a explicar\n[Es peligroso atribuir el interes en estos temas tan complejos a una\nsola causa autobiografica. Esto se llama, en el discurso critico,\nsobredeterminar, o sea, dar un valor excesivo a una sola\ndeterminacion.] el tema social del poema, su conexion un tanto\npersonal con la injusticia y su sentimiento de culpa debido a su\nestatus economicosocial relativamente superior al de las masas\nobreras.\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nDeleted: explican\n\nColom 7\nSin embargo, volviendo a la frase \"y pienso que, si no\nhubiera nacido, /otro pobre tomara este cafe!,\" a pesar de que\nVallejo no era, en ese tiempo, pobre en extremo, es interesante\nnotar que escribe \"otro pobre,\" lo cual sugiere que el tambien es\npobre. Lo mismo da a entender cuando dice \"y hacerle pedacitos\nde pan fresco/ aqui, en el horno de mi corazon...!,\" queriendo decir\nque no tiene mas nada que dar a otros pobres sino consuelo. [Bien]\n\"Un hombre pasa con un pan al hombro\" esta compuesto de\ntrece estrofas, cada una de dos versos de arte mayor, sin computo\nsilabico constante y sin rima, donde el primero es siempre una\nafirmacion narrativa-descriptiva y el segundo es una pregunta.\nEstas caracteristicas le dan poca fluidez al poema, es decir, el ritmo\nes mecanico, las imagenes pareciesen ser presentadas en un\nproyector de filme viejo y Vallejo cambia de escena\nmetodicamente, entre estas imagenes del mundo exterior y su\nconciencia. Es como si el poeta imitase la aturdidora forma en que\nsu mente procesa lo que ve, [una hipotesis muy interesante]con lo\ncual da a entender cuanto le afecta la pobreza, la ignorancia y el\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\n\nColom 8\nsufrimiento de la gente en general. Alude a su perturbacion\ndirectamente cuando pregunta \"¿Como hablar del no-yo sin dar un\ngrito?,\" donde el \"no-yo\" es todo aquello que lo rodea y describe\nen el poema. [Interesante interpretacion del \"no-yo\"]\nEl poema carece de lenguaje figurado a excepcion de un\nverso. La falta de metaforas, similes, personificacion, etc., emulan\nel escenario que Vallejo describe: real, tangible y crudo. Sin\nembargo, es interesante que incluye el verso \"Otro ha entrado a mi\npecho con un palo en la mano,\" que podria ser interpretado\nliteralmente: alguien con un palo en la mano lo asalta, o quizas\nsimplemente alguien que va con un palo se tropieza con el, dandole\nen el pecho. Por otro lado, Vallejo escogio las palabras \"entrar\" y\n\"pecho\" especificamente, revelando quizas un significado mas\nsutil: la imagen o accion de una persona \"ha entrado a su pecho\" (a\nsu corazon), \"con un palo en la mano\" (para herirlo.) De esta\nforma, y una vez mas, comunicaria el sufrimiento que le causa la\ninjusticia en la que vive la clase baja. [Muy bien]\nVallejo expresa su interes por la filosofia al mencionar a\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\n\nColom 9\nSocrates y Andre Breton, principal fundador del surrealismo.4\nTambien por otros temas de erudicion como el infinito, la cuarta\ndimension, \"el Yo,\" \"el tropo y la metafora,\" Picasso, y el \"mas\nalla.\" Escribe, sin embargo, \"¿con que valor hablar [de ellos?],\"\ncon lo que comunica explicitamente cuan injusto es pensar en el\nenriquecimiento de su intelecto mientras que otros a duras penas\nsubsisten.\nEn general, el primer poema deja al descubierto a un joven\nVallejo, mas sensible, mas calido. El segundo presenta a otro\nVallejo, esta vez mas calculador, mas sobrio, quizas hasta\ndesesperanzado. ¿Que podria explicar este cambio? En el\ntranscurso de los dieciocho anos entre cada escrito, Vallejo paso\npor situaciones muy dificiles. Comenzando por su apresamiento en\n1920, el cual el siempre alego ser injusto, y siguiendo con la\nmuerte de su madre ese mismo ano, su autodestierro a Paris en\n1923, su extrema pobreza mientras alli recidio, la muerte de su\npadre en 1924 y su destierro del territorio frances al ser\ndeclarado\"indeseable\" por sus ligas con la Union Sovietica en\n\nColom 10\n1930, 5 para cuando escribe \"Un hombre pasa con un pan al\nhombro,\" Vallejo ha sufrido el dolor y la injusticia, esta vez en\ncarne propia. Estos datos biograficos pudiesen explicar [muy bien\nque hayas empleado el subjuntivo aqui, para volver tu observacion\nmas tentativa, como lo debe ser]el sentimiento de culpa mas leve y\ntono mas pragmatico de un Vallejo endurecido por los anos de\ndificultad y suma pobreza.\nEn sintesis, ambos poemas desarrollan el tema de la injusticia\nsocial, el segundo de forma menos personal que el primero, en el\nque Vallejo se siente mas afectado por la injusticia para con los\npobres y reprimidos y por lo tanto se muestra mas sensible y\nferviente.\nBibliografia\n1, 2 http://es.wikipedia.org/wiki/C%C3%A9sar_Vallejo\nVallejo, Cesar. Poesia Completa. Edicion, prologo y notas de\nRicardo Silva-Santisteban. Lima: Pontificia Universidad Catolica\ndel Peru. 1997.\nVerani, Hugo. Las vanguardias literarias en Hispanoamerica.\nManifiestos, proclamas y otros escritos. Roma: Bulzoni Editore.\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\n\nColom 11\nFavorables Paris Poema. n° 1. Julio, 1926.\nFavorables Paris Poema. n° 2. Agosto, 1926.\n3, 5 http://www.marxists.org/espanol/vallejo/biogr.htm\nBiografia de Cesar Vallejo escrita por Georgette de Vallejo\n4 http://en.wikipedia.org/wiki/Andr%C3%A9_Breton\nAndre Breton: Surrealism and Painting - edited and with an\nintroduction by Mark Polizzotti.\nManifestoes of Surrealism by Andre Breton, translated by Richard\nSeaver and Helen R. Lane. ISBN 0472061828\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt\nFormatted: Font: 16 pt,\nItalian (Italy)\nFormatted: Font: 16 pt\n*\"Padre Nuestro\"\nPadre nuestro, que estas en el cielo,\nsantificado sea tu Nombre;\nvenga a nosotros tu reino;\nhagase tu voluntad en la tierra como en el cielo.\nDanos hoy nuestro pan de cada dia;\nperdona nuestras ofensas,\ncomo tambien nosotros perdonamos a los que nos ofenden;\nno nos dejes caer en la tentacion,\ny libranos del mal.\nsingle\nFormatted: Font: 16 pt\nFormatted: Line spacing:\n\nColom 12\nfuente:\n<http://www.churchforum.org/info/Manual_de_Oraciones/Pa\ndre_Nuestro.htm>\n15 oct. 2007\nEl verso que incluye Vallejo puede representar la traduccion\nFormatted: Line spacing:\nsingle\nde la oracion que el conocia. Asi que lo de los retoques es relativo\na la traduccion referida.\nFormatted: Font: 16 pt\n¡Excelente trabajo! A\nFormatted: Font: 16 pt\nSi tu m e d as p ermiso, m e gusta ria colo car es te ensay o, co n mis\nFormatted: Line spacing:\nsingle\nFormatted: Font: 16 pt\ncomentarios, en nuestra pagina Stellar para que los estudiantes puedan ver\nun e jemplo de lo que co\nnsidero un e xcelente e nsayo para este nivel de\nestudios lite rarios y dentro de los\nparametros que e stableci pa ra este\nejercicio. Tambien, lo considero muy util p or perm itirme com entar, co n\nprovecho, creo, sobre el cuidado que se debe tener al utilizar la biografia de\nun autor p ara exp licar el co ntenido de u na o bra fi cticia s uya. Lo pu edo\ncolocar con tu nombre o sin tu nombre. Depende de lo que quieras.\nApreciaria tener una respuesta lo mas pronto posible.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "El poeta peruano César Vallejo en sus poemas “El pan nuestro” y “Un hombre pasa con un pan al hombre…”",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/ba0f3ffb14d70ede4565b7aa33f6df9c_MIT21G_716F07_CrespVallejo.pdf",
      "content": "Formatted: Font: 16 pt\nMonica Crespo - 1141 pals. = A\nProf. Garrels\nUn trabajo ejemplar. ¡Felicitaciones!\n21G.716\n28 de septiembre de 2007\n\"Dos poemas, una sola voz\"\nLos poemas \"El pan nuestro\" y \"Un hombre pasa con un pan al hombro\" del\npoeta peruano Cesar Vallejo parecen compartir el m ismo motivo de e xistir: en el\nmundo reina la injusticia y aquellos que podrian hace r algo optan por ignorarla.\nUtilizando elementos poeticos diferentes nos hacen llegar el mensaje de la falta de\nsolidaridad de la humanidad, de la siempre presente injusticia y pobreza y la falta\nde respuesta de nuestra parte. Mientras \"El pan nuestro\" usa un tono mas personal,\ncuestionando a la sociedad y a su vez asumiendo responsabilidad por la injusticia,\n\"Un hombre pasa con un pan al hombro\" usa un tono cl aramente ironico y hasta\nsarcastico en al\ngunos\nmomentos,\nridiculizando asi las\ncontrariedades\n[¿contradicciones?] que presenta nuestra sociedad.\nCesar Vallejo publico \"El pan nuestro\" en 1919 y \"Un hombre pasa con un\npan al hombro\" en 1937 [No lo publico en 1937; lo escribio en esta fecha.], ambos\nparte de c olecciones que incluian otros poemas. La sepa racion cronol ogica de\nambos poe mas puede explicar su\ndiferencia estilistica, en adicion a la actitud\ngeneral del poeta que lo conduce a presentar un mismo problema de dos maneras\ndistintas. Mien tras que el joven Vall ejo habla de l a pobreza con pena y d olor,\n\nutilizando al mismo tiempo un tono de recla mo y de responsabi lidad, veinte anos\ndespues enfatiza en l o i ronico de la si tuacion, casi burl andose de la f alta de\nsignificado y contenido de las obras de las personas.\nEl poema \"El pan nuestro\" esta compuesto por cinco estrofas con un numero\nde vers os irregular.\nLa metrica, al igu al que la rima, no sigue ning un p atron\nregular, siendo asi un poema de verso libre. El poema comienza describiendonos\nun lugar en donde aparenta reinar la m iseria, la pobreza y el dolor. Este lugar\ntriste y\nabandonado po dria ser un o de t\nantos p ueblos lat inoamericanos,\nprobablemente de la tierra natal de Vallejo, Peru, donde hasta la carretera \"arrastrar\nparece/ una em ocion de ayuno enc andenada!\". [Excelente. Creo que en concreto\nse refiere a Lima, donde durante el i nvierno el sol puede no sali r en tres meses y\npor lo tanto, donde hace un frio constante y muy humedo.]\nEl poema continua expresando el deseo de pedir auxilio y ayuda aun sin\nsaber a q uien ac udir en su desesperacion, diciendo: \" se quisiera tocar todas la s\npuertas,/ y preguntar por no se quien\". Dice ademas querer \"dar pedacitos de pan\nfresco a todos\", identificando asi el problema de la pobreza y el hambre existente\ny reconociendo desear poder resolverlo. Interesantemente luego habla de \"saquear\na los ricos sus vinedos/ con las dos manos santas/ que [...]/ volaron desclavadas de\nla Cruz!\", como diciendo que si la gracia divina interviniera, Jesucristo mismo se\nencargaria de hace r una nueva\ny m as ju sta distribucion d e bienes; no habri a\n\nnecesidad de que algunos pasaran hambre mientras unos pocos fueran duenos de\nvinedos e nteros. E sta ul tima idea ha s ido compartida por ot ros, l levando a l a\ncreacion de la muy conocida historia de Robin Hood y heroes similares que roban\na los ricos para repartirlo mas justamente entre los pobres.\nVallejo procede asumiendo responsabilidad por la pobreza y el hambre de\notros, pero lo hace en una m anera muy pa rticular. No dice ser responsable del\nhambre por su manera egoista de actuar ni sugiere en ning un momento ser injusto\no haber abusado de los demas; solo nos dice que cuando el come, alguien mas deja\nde comer. A modo de an alisis introspectivo e i ntentando encontrar la causa del\nsufrimiento de los pobres se le ocurre pensar que \"si no hubiera nacido,/ otro pobre\ntomara este cafe!/ Yo soy un mal ladron... A donde ire!\". De esta manera, Vallejo\ncuestiona cuan duenos de nuestras pertenencias verdaderamente somos, ademas de\nrecalcar la manera arbitraria que se han repartido los bienes, donde la posibilidad\nde comer y de tene r ciertas comodidades no van a la par con el esfuerzo y el\ntrabajo de cada cual, sino que depende en gran parte de factores que estan fuera del\ncontrol del individuo, como lo son nacer en la pobreza, el lugar de nacimiento, etc.\nLa ultim a estrofa del poem a prese nta un paralelismo con la seg unda,\nvolviendo a decir quer er suplicar y pedir ayud a, a un no sa biendo a quien. En\ncontraste con la primera vez que se dicen estas palabras [excelente observacion; tu\nobservacion resultaria aun mas impactante si i ncluyeras aqui, entre parentesis, la\nDeleted: u\n\ncita de la estructura contrastada, \"Se quisiera tocar.\"], en esta ultima estrofa queda\nclaro que es el poeta m ismo quien quiere pedir ayuda: \"quisiera yo tocar todas las\npuertas,/ y suplicar a no se quien, perdon,/ y hacerle pedacitos de pan fresco/ aqui,\nen el horno de mi corazon...!\". La ayuda solicitada en esta estrofa parece no ser la\nmisma que al principio del po ema; y a n o se trata simplemente de buscar como\nalimentar a los pobres ni de buscar justicia de los ricos y poderosos, sino de pedir\nperdon por ser el mismo responsable del hambre de otros. Las ultimas palabras de\neste poema no solo buscan conseguir el perdon, sino tambien ofrecer de lo suyo; el\nquiere tener algo pa ra ofrecerles a los ne cesitados y se lo quiere dar desde l o mas\nprofundo de su ser. [Tu comentario de \"El pan nuestro\" es sobresaliente; se destaca\npor su atencion a las palabras mismas del poema y por su responsabilidad al no\npermitirse avent urar si gnificados pa ra los cuales no\nhay f undamento con creto\ndentro del poema.]\nEn el poema \"Un hombre pasa con un pan al hombro\" Vallejo presenta ideas\nsimilares a las del poema anterior. Nos habla de un mundo injusto, triste e ilogico.\nNos des cribe com o el dia a dia cont radice l o que el pe nsamiento y el analisi s\npudiera desear. El poema presenta situaciones, pareandolas con ideas que parecen\nno tener nada que ver. La tecnica ut ilizada a traves d el poem a hace que se a\nbastante d ificil de ent ender, pues en ocasiones p areciera que al gunas estrofas\npresentan desordenadamente ideas que ni siquiera aparentan estar relacionadas.\n\nResulta claro en este poema el uso de su estructura pa ra llevar un mensaje.\nLas estrofas consisten de sol o dos verso s: uno ase vera y el sigu iente cuest iona.\nEsta repeticion invariable, aun a pesar de la variabilidad del numero de silabas a\ntraves de l os versos, enfatiza en l a importancia del contraste presentado en cada\nestrofa, contraste que es el tema principal del poema. [Excelente]\n\"Un hombre pasa con el pan al hombro\" resume la marcada diferencia entre\nla reali dad y el ambito intelectual y artistico. Mientras la vi da diaria m uestra\nsituaciones terribles de injusticia, hambre, pobreza, sufrimiento y dolor, la ciencia\ny el arte tratan de hallar explicaciones a problemas superficiales; intentan describir\nun mundo que cada vez se al eja mas del que el los representan: un pobre infeliz\n\"busca en el fango huesos, cascaras\", y mientras el intelectual piensa en \"escribir\n[...] del infinito\".\nLa ironia que caracteriza a nuestra sociedad es presentada en cada una de las\nestrofas de este poema que nos pr esenta la falta de consciencia de las sit uaciones\nque les toca vivir a lo s demas: \"Un comerciante roba un gramo en el peso a un\ncliente/ ¿Hablar, despues, de cuarta dimension?\". Mient ras algunos abusan de su\npoder y hacen trampa, nos atrevemos a habl ar de ciencia; mientras una per sona\nrechazada por los demas sufre, nos atreve mos a hablar de arte. Por estas razones\nVallejo ent iende que algo a nda mal en esta socieda d, d onde las vanidades y\nvaciedades valen mas que la esencia y dignidad de los seres humanos.\n\nSi tu me das permiso, me gustaria colocar este ensayo, con mis comentarios,\nen nuestra pagina Stellar para que los estudiantes puedan ver un ejemplo de lo que\nconsidero un excelente ensayo para este nivel de estudios literarios y dentro de los\nparametros que estableci para este ejercicio. Lo puedo colocar con tu nombre o sin\ntu nombre. Depende de lo que quieras.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Fechas para Felices días, Tío Sergio",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/68a1b7830f8e4fceaf47179d2fab4a02_MIT21G_716F07_Felices.pdf",
      "content": "Fechas para Felices dias, Tio Sergio\nde Magali Garcia Ramis\n(cronologia preparada por E. Garrels con la ayuda de Efrain Barradas)\n\n1896 - Llega el abuelo, Papa Fernando, de Espana.\n1897 - Espana reconoce a Puerto Rico como un estado\nautonomo bajo un gobernador espanol.\n1898 - Las fuerzas armadas de EE.UU. invaden a Puerto Rico\nen la bajia de Guanica, en el sur de la isla. Puerto\nRico deja de ser colonia de Espana y se convierte en\nposesion de EE.UU. La ocupacion de Puerto Rico por\nEE.UU. pone punto final a la Guerra Hispanoamericano\n\n(Spanish-American War).\n1900 - Ley Foraker (gobernador civil nombrado por el\npresidente de EE.UU.). Poblacion de P.R. excede un\nmillon.\n1917 - Ley Jones (La ciudadania estadounidense se extiende\n\na los puertorriquenos. Por primera vez en 19 anos\n\nlos puertorriquenos tienen pasaporte y pueden viajar\n\nal exterior.)\n1925 - Pedro Albizu Campo (1891-1965) por gira\nlatinoamericana: Cuba, Sto. Domingo, Haiti, Mexico,\nPeru\n1926 - Fundacion del Partido Nacionalista Puertorriqueno\n(PNP), de Albizu Campos (PAC)\n1930 - Asamblea general de Partido Nacionalista bajo PAC\n1930-36 - Actividad de PAC dentro del sistema politico; en\n\n1936 el partido de PAC pierde las elecciones\nlegislativas.\n1936 - Asesinato del coronel Riggs, un militar estado-\n\nunidense y jefe de la policia puertorriquena.\n1937 - El domingo de ramos, estudiantes independentistas\nse enfrentan a la policia, y se produce la Masacre de Ponce, en la que\nmueren 19 personas.\n1938 - El liberal Luis Munoz Marin (1898-1980) funda el\nPartido Popular Democratico (PPD).\n1940-44 - Gobernacion de Rexford Guy Tugwell (impacto del\n\nNew Deal/Nuevo Trato); elecciones legislativas en P.R.\n1943 - Munoz Marin y el President Roosevelt trazan la Ope-\n\nracion Manos a la Obra (Operation Bootstrap) para\n\nindustrializar a Puerto Rico.\n1944 - Victoria electoral del PPD en las elecciones\nlegislativas. Entre 1944 y 1964 Luis Munoz Marin\n\ndomina la politica puertorriquena.\n1946 - Fundacion del Partido Independentista\nPuertorriqueno (PIP). El Presidente Truman nombra al\nprimer puertorriqueno gobernador de la isla (Jesus\nT. Pinero).\n1947 - Con la aprobacion del Congreso de EE.UU., P.R.\n\nescribe su propia Constitucion, y llama a elecciones\n\npopulares para elegir por primera vez a su propio\n\ngobernador. Pedro Albizu Campos regresa a la isla,\n\ndespues de haber pasado 10 anos en la carcel en EE.UU.\n1948 - Luis Munoz Marin electo gobernador. Se funda la\n\nDivision de Emigracion del Departamento de Trabajo\n\n(PR) en Nueva York. (Ha habido un impresionante\naumento de la poblacion en P.R. por las mejoras de\nla salud publica introducidas por EE.UU. Estas crean\nun \"exceso\" de poblacion, que resulta en la politicas\nde emigracion y la esterilizacion masiva de muchas\nmujeres puertorriquenas. Tambien se lleva a cabo\nla experimentacion \"clinica\" de la pildora anti-\nconceptiva con la poblacion femenina de P.R.).\nHuelga estudiantil en la Universidad de Puerto\nRico; paro de 24 horas, el 14 de abril.\n1949 - Se proclama la Republica Popular de China, bajo\n\nMao Tse-tung. Por fin se reconoce el espanol como\n\nlengua oficial en las escuelas de P.R. El apartheid\n\nestablecido en Africa del Sur (1950-52).\n1950 - El Senador Joseph McCarthy le dice al Presidente\n\nTruman que el Depto. de Estado esta lleno de\n\ncomunistas y sus adictos. Corea del Norte invade a la\n\nCorea del Sur, y comienza la Guerra Coreana (1950-53).\n\nEl Congreso de EE.UU promulga el McCarren Act, que\n\nimpone severas restricciones a los comunistas y a los\n\nsospechosos de haber sido comunistas. Dos\nnacionalistas puertorriquenos intentan asesinar al Pres. Truman. En\n1950 hay un millon y medio de televisores en EE.UU; en este ano se\nintroduce la television en Mexico.\n\nEn P.R. miembros del nuevo Partido Independentista\n\nPuertorriqueno atacan la mansion del gobernador;\n\nmueren 27 personas. Entre 1950 y 1960 mas de un\n\nmillon de puertorriquenos emigran a EE.UU.,\n\nprincipalmente a N.Y.\n1951 - Ya hay 15 millones de televisores en EE.UU. Se\n\nintroduce en EE.UU. la television de colores. Los\n\nRosenberg sentenciados a muerte en EE.UU. por\n\nespionaje.\n1952 - Se aprueba la Constitucion del Estado Libre Asociado\n\n(ELA) en P.R. Estado de emergencia en Kenya (Africa),\npor disturbios de los Mau Mau; la revuelta de los Mau\nMau (1952-56) duramente reprimida. Muere Evita Peron\nen la Argentina, a la edad de 33 anos.\n1953 - Las Naciones Unidas (ONU) acepta el ELA como\nexpresion de libre determinacion. Los Rosenberg\nejecutados. Fin de la Guerra de Corea. El 26 de\njulio Fidel Castro dirige el asalto al cuartel la\nMoncada en Santiago de Cuba (la segunda guarnicion\nmilitar del pais). El asalto fracasa, pero le hizo\nganar reconocimiento a Castro como lider de la\noposicion en contra del dictador Fulgencio Batista.\n1954 - Cuatro nacionalistas puertorriquenos atacan la Camara\n\nde Representantes en EE.UU. En EE.UU. se televisan las\n\ninvestigaciones llevadas a cabo por el Senador Joseph\n\nMcCarthy para probar la infiltracion en el Ejercito\n\nde EE.UU. de comunistas. El Senado termina censurando\n\nformalmente a McCarthy, y termina su \"caza de brujas.\"\n\nEntre 1954 y 1962, transcurre la guerra de liberacion\n\nde Argelia en Africa.\n1955 - Fundacion en Puerto Rico del Instituto de Cultura\n\nPuertorriquena (un intento de disminuir la\namericanizacion de la cultura de la isla). Peron\ndimite en la Argentina. En EE.UU., en Montgomery,\nAlabama, negros boicotean los buses publicos.\n1956 - Martin Luther King emerge como lider de la\ndesegregacion en EE.UU. Fidel Castro desembarca\nen Cuba (habiendo partido de Mexico) en el barco\nGranma. Rusia invade a Hungria.\n1957 - Se estrena en N.Y. \"West Side Story\" de Leonard\n\nBernstein. Crisis de desegregacion en Little Rock,\n\nArkansas; el Presidente Eisenhower manda tropas.\n1958 - Richard Nixon, en gira por America Latina, encuentra\n\nhostilidad en Caracas, Venezuela. El gobernador\n\nde Arkansas cierra las escuelas publicas en Little\n\nRock y las vuelve a abrir como privadas. Muere el Papa\nPio XII.\n1959 - Batista huye de Cuba y entra Fidel Castro en La\n\nHabana; triunfo de la Revolucion Cubana. Fundacion\n\ndel Movimiento Pro Independencia en P.R. (Partido\nSocialista Puertorriqueno a partir de 1971).\n1960 - EE.UU. protesta las expropiaciones de tierras y\n\ncompanias en Cuba. Kennedy electo presidente en\nEE.UU. Se establece el Comite de Descolonizacion\nde la ONU. Comienzan a llegar cubanos exilados a\nP.R. En la decada de los '60, surge el turismo en\n\nla economia de Puerto Rico para reemplazar a Cuba\ncomo destino de turistas de EE.UU.\n\"Sit-ins\" de estudiantes en los restaurantes\nsolo para blancos, en Greensboro, North Carolina.\n1961 - EE.UU. rompe relaciones con Cuba. Invasion de la\n\nBahia de los Cochinos (abril). La Revolucion Cubana\n\nse declara socialista. Asesinado Rafael Trujillo,\n\ndictador de la Republica Dominicana. EE.UU. inicia la\nAlianza para el Progreso en America Latina.\n1962 - Cuba expulsada de la OEA (Organizacion de Estados\n\nAmericanos). Crisis de misiles sovieticos en Cuba\n(octubre). Entre 1962 y 1965, se celebra el Segundo\nConcilio Vaticano, en que la Iglesia Catolica se\ncompromete a trabajar por los derechos humanos, la\njusticia y la libertad.\n1963 - 2 noviembre: asesinado el Pres. Kennedy.\n1964 - Luis Munoz Marin se jubila de la politica activa.\n\nRoberto Sanchez Vilella electo gobernador (PPD).\n1967 - En Puerto Rico se lleva a cabo el primer plebiscito\npara ver si la poblacion desea que la isla se convierta en un estado de\nEE.UU.\n1968 - Los obispos de America Latina se reunen en Medellin,\nColombia, y se acepta que es deber del catolico identificarse con los\npobres y consagrarse a la causa\nde la justicia social.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Introduction to Hispanic Literatures",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/b680007d4f8405cf4723d708910fe39e_MIT21G_716F07_PrgntsRamis.pdf",
      "content": "21G.716 Introduction to Hispanic Literatures\n\nEn busca de la identidad: Felices dias, Tio Sergio (Editorial Cultural)\n\nPreguntas:\n\n1. La novela es un Bildungsroman (Novela de educacion). ¿Quien o quienes\nson a tu juicio los principales educadores de Lidia y en que aspectos influyen\nen su vida?\n\n2. ¿Que papel tiene la literatura en la formacion del personaje principal?\n\n3. En la novela hay una proliferacion de datos historicos. ¿Cual crees tu que\nes su funcion?\n\n4. ¿Que importancia tiene para la formacion de Lidia la ausencia de hombres\nadultos?\n\n5. ¿Cual es el rol de la \"gente prohibida\" en la novela?\n\n6. ¿Que otras \"prohibiciones\" importantes influyen en la educacion de los\nninos en la novela?\n\n7. Comenta la importancia de los diferentes tipos de musica en la novela.\n\n8. Comenta el papel de la television en la novela.\n\n9. ¿Que sugiere la presencia en la novela del texto 'los cementerios flotantes'?\n\n10. ¿Crees que la \"claustrofobia\" es un sentimiento constante en la novela?\n\n11. ¿Que opiniones circulan en la novela sobre los nacionalistas\npuertorriquenos?\n\n12. Comenta las relaciones raciales en la novela.\n\n13. ¿Crees que la novela promueve la nostalgia o la revision critica del\npasado?\n\n14. ¿Cual es la representacion del comunismo en la novela?\n\n15. Hay un proceso de industrializacion durante el periodo historico en el\nque Luis Munoz Marin fue gobernador que se describe de manera critica\ncomo \"desarrollismo.\" ¿Cual es la representacion y la percepcion en la novela\nde este proceso? ¿Que importancia puede tener\nel que tio Roberto se identifique plenamente con este proceso?\n\n16. ¿Cual es el papel del sotano de Villa Aurora en la vida de tio Sergio y de\nLidia (p. 134, etc.)? Esto es un tema muy importante y tiene que ver con el\n\nuso frecuente de metaforas arquitectonicas para hablar tanto de procesos\nhistorico-sociales como de procesos y dinanicas psicologicos del individuo.\nPiensa en la casa de Bernarda Alba; es interesante que alli no se referia a la\nexistencia de ningun sotano, aunque metaforicamente, esa familia los tenia\nde sobra.\n\n17. Comenta el noveno parrafo del primer capitulo, que comienza, \"Asi mas o\nmenos es como recuerdo la vispera de su llegada;....\" ¿Donde estaria\nRiverside? ¿Que contribuye todo este trozo al desarrollo del tema de la\nhistoria en el libro? ¿Que sentido dan a la referencia a \"su amante\" y a las\npalabras \"sabiendose incompleto\"? ¿Que significado se puede sacar del\nhecho de que la ultima frase de este parrafo comience hablando de la\n\"coleccion de Biografias de Hombres Ilustres\" y que termine hablando de \"un\npoemario de Miguel Hernandez\"?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Preguntas de lectura sobre \"El remate\" de Max Aub",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/e54630940aa6e69d7d02085a919f6f1d_MIT21G_716F07_Prgnts_el.pdf",
      "content": "Preguntas de lectura sobre \"El remate\" de Max Aub, preparadas por\nElizabeth Garrels\n\nEl texto de Uds. es de Max Aub, Historias de mala muerte (Mexico:\nJoaquin Mortiz, 1965).\n\n1. ¿Quien es Jorge Guillen, la persona a quien va dedicado el cuento? (Es\nuna figura historica que se encontraba en Sevilla cuando estallo la guerra\ncivil en julio de 1936.)\n\n2. Sobre el epigrafe del cuento: Esquilo (Aeschylus en ingles, 525-456\nantes de la era de Cristo) cultivo la tragedia, y entre sus muchas obras\nescribio la trilogia la Orestiada (458 adC). \"Agamenon\" es la primera de\nlas tres de esta serie. El epigrafe en nuestra copia de \"El remate\" esta mal\nreproducido. Dentro de \"Agamenon,\" Egisto dice, \"Ya se que los\ndesterrados se alimentan de esperanzas, \" y el Coro dice, \"¡Hinchate\nhollando la justicia, puesto que puedes!\"\n\n¿Que significado puede tener aqui el uso como epigrafe de esta cita\nde una tragedia griega?\n\n3. ¿Que significa el titulo del cuento?\n\n4. ¿Cual fue, en los anos '30, y sigue siendo, en 1961, la definicion politica\nde Remigio Morales? ¿Hay una relacion entre la manera en que Remigio\ninterpreta la historia y la politica y su drama personal, su sentido de\nfrustracion y desilusion?\n\n5. Reflexionen sobre Remigio como padre y el tema de las diferentes\ngeneraciones.\n\n6. ¿Como es la actitud del narrador hacia su viejo amigo Remigio? ¿En\nque coinciden? ¿En que estan en desacuerdo?\n\n7. ¿Como es el lenguaje del articulo del periodico ABC que se cita en las\npaginas 323-324? ¿Que saben Uds. del periodico ABC? ¿Como se\ndistingue el lenguaje del articulo del lenguaje, o de los lenguajes, del\nresto del cuento? ¿Como es el lenguaje (el tono, etc.) del narrador? Ver\n#10.\n\n8. Reflexionen sobre las declaraciones del narrador de que \"[n]o tengo por\nque meterme en la vida privada de nadie\" y luego en la misma pagina\n(315), \"Soy asi.\" ¿Carecen de resonancia en el resto del cuento, o vuelven a\nser invocadas, aunque sea implicitamente, despues?\n\n(cont. preguntas \"El remate\")\n\n9. Dentro de la ficcion del cuento, el narrador escribe el mismo texto que\nnosotros leemos fuera de la ficcion del cuento, o sea, en la realidad.\n¿Como debemos interpretar frases como, \"Escribir es morir un poco...\" y\n\"Escribo para olvidar\" (343)? ¿Debemos relacionar esta ultima frase con el\ntema general del olvido y del recuerdo?\n\n10. Reflexionen sobre la naturaleza polifonica del cuento, el uso del\ndialogo, de citas textuales. Relacionen esto con la dimension etica del\ncuento, la manera en que el texto reflexiona sobre dificiles cuestiones\nexistenciales, cuestiones de responsabilidad individual (personal) y\npolitica, de justicia e injusticia, etc.\n\n11. Analicen la estructura del cuento, desde su comienzo hasta su final.\nRecuerden que al recibir estas preguntas, no han recibido el final del\ncuento todavia. El final consta de apenas una pagina. Pueden analizar la\nestructura del cuento hasta la cita de Jorge Guillen. Cuando reciban el\nfinal, podran analizar la estructura de todo el cuento.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Tema: La historia prohibida de Puerto Rico",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/45e0cfa3b6f6b05f7d7f003a5cace961_MIT21G_716F07_historia_ramis.pdf",
      "content": "21G.716\n\nTema: La historia prohibida de Puerto Rico\n\n-y la no tan prohibida-\n\nen Felices dias, Tio Sergio\n\nde Magali Garcia Ramis\n(Edicion Editoria Cultural)\n\nCosas a aclarar. Se recomiendan los siguientes sitios en la red:\nhttp://emt.web.prw.net/ [WWW-VL History: Puerto Rico]\nhttp://lanic.utexas.edu/la/cb/other/pr/#general\nhttp://home.coqui.net/ciales15/index.htm\n\n1. Luis Munoz Marin (1898-1980; funda el Partido Popular Democratico [PPD]\nen 1938; domina la politica puertorriquena entre 1944 [victoria electoral del\nPPD, ¿en las camaras? ACLAREN] y 1964; reforma de la Ley Jones [la que dio la\nciudadania estadounidense a los puertorriquenos en 1917] en 1947, la cual\npermite la eleccion directa y popular [??? ACLAREN] del gobernador de Puerto\nRico; en 1948 Munoz [LMM]=primer gobernador electo de la isla. ACLARAR: su\nprograma de \"fomento,\" \"modernizacion,\" \"operacion Manos a la Obra\"\n(Operation Bootstrap).\n\n2. Segundo Ruiz Belvis, el abolicionista mencionado en la novela en la pag. 64.\nVer: http://www.zonai.com/promociones/biografias/0501/segundo.asp\n\n3. ¿En cual guerra creen que murio el papa de Lidia y Andres? ¿La Segunda\nGuerra Mundial o la de Corea (Re. la participacion de puertorriquenos en la\nGuerra de Corea, ver Silen, p. 82)? (Ver pags. 52, 54 y 105 de la novela.) La\ninvasion rusa de Hungria fue en 1956. Si su padre murio en la Guerra de Corea,\n¿es cierto que Lidia no podria tener mas de 6 o 7(?) anos en 1956. ¿Por que?\n\n4. \"No es bueno que uno visite las casas de los nacionalistas. En la revuelta del\n50 ellos quisieron derrocar al Gobierno\" (p. 58, novela).\n\nA. ACLARAR \"la revuelta del 50\" (Ver, entre otros, Johnson, pp. 36-\n39, Silen, pp. 75-77, Maldonado-Denis, pp. 189-198.)\n\nB. ACLARAR \"los nacionalistas\" (El Partido Nacionalista\nPuertorriqueno fue fundado en 1928 por Pedro Albizu Campos.\n(Ver, entre otros, Johnson, pp. 20-22, Silen, pp. 60-66.) (Sobre\n\nAlbizu Campos, ver ensayo introductorio de Manuel Mandonado-\nDenis, \"Albizu Campos y el desarrollo de la conciencia nacional\npuertorriquena en el siglo XX,\" en Pedro Albizu Campos, La\nconciencia nacional puertorriquena, pp. 9-36.)\n\n5. ACLARAR \"la alcadesa, Dona Fela\" del Partido Popular (p. 74, novela)\n\n6. ¿Por que podria ser peligroso para Tio Sergio volver a Nueva York (en la pag.\n81)? ¿Hay algo en la historia que nos pudiera permitir especular?\n\n7. Sobre el Tio Sergio: \"el no termino la universidad....--Tu sabes que no lo\ncogerian de maestro...--Ni en el Gobierno tampoco, por ahora no\" (p. 82, novela).\n¿Podria tener que ver con la huelga estudiantil en la Universidad de Puerto Rico\nen 1948?\n\n8. Los poetas favoritos del Tio Sergio: los espanoles Miguel Hernandez y\nGabriel Celaya, y el puertorriqueno Luis Pales Matos (pp. 10, 144). ACLARAR\nun poco sobre por que estos poetas podrian no haber caido bien en la casa\nSolis.\n\n9. ACLARAR lo que puede significar \"neomaltusiano.\" Ver, por ejemplo,\nMaldonado Denis, pp. 315-17.\n\nBibliografia\n\n1. Campos, Pedro Albizu. La conciencia nacional puertorriquena. San Juan,\nPuerto Rico: Compromiso, 1984.\n\n2. Maldonado-Denis, Manuel. Puerto Rico: A Socio-Historic Interpretation. New\nYork, NY: Random House, 1972. ISBN: 9780394473475.\n\n3. Silen, Juan Angel. We, the Puerto Rican People: A Story of Oppression and\nResistance. New York, NY: Monthly Review Press, 1971.\n\n4. Johnson, Roberta Ann. Puerto Rico: Commonwealth or Colony? New York, NY:\nPraeger, 1980. ISBN: 9780275914943.\n\n5. Carr, Raymond. Puerto Rico: A Colonial Experiment. New York, NY: New York\nUniversity Press, 1984. ISBN: 9780814713891.\n\n6. Carrion, Arturo Morales, and Maria Teresa Babin. Puerto Rico: A Political and\nCultural History. New York, NY: W. W. Norton, 1983. ISBN: 9780393017403.\n\n7. Lewis, Gordon K. Puerto Rico: Freedom and Power in the Caribbean. New\nYork, NY: Monthly Review Press, 1963.\n\n8. Negron-Muntaner, Frances, and Ramon Grosfoquel, eds. Puerto Rican Jam:\nRethinking Colonialism and Nationalism. Minneapolis, MN: University of\nMinnesota Press, 1997. ISBN: 9780816628490.\n\n9. Fernandez, Ronald. The Disenchanted Island: Puerto Rico and The United\nStates in the Twentieth Century. New York, NY: Praeger, 1992. ISBN:\n9780275940966.\n\n10. Pantojas-Garcia, Emilio. \"End-of-The-Century Studies of Puerto Rico's\nEconomy, Politics, and Culture: What Lies Ahead?\" Latin American Research\nReview 35, no. 3 (2000): 227-240.\n\n11. Pico, Fernando. Historia general de Puerto Rico. 3rd ed. San Juan, Puerto\nRico: Ediciones Huracan, 2006. ISBN: 9781932913200.\n\n(Pico, Fernando. Historia general de Puerto Rico. Rio Piedras, Puerto Rico:\nEdiciones Huracan, 1986. ISBN: 9780940238862.)\n\n12. Medina, Eduardo Rivera, and Rafael L. Ramirez, eds. Del canaveral a la\nfabrica: cambio social en Puerto Rico. Rio Piedras, Puerto Rico: Ediciones\nHuracan-Academia, 1985. ISBN: 9780940238787.\n\n13. Ortiz, Hermenegildo. \"Descripcion y analisis del modelo de desarrollo\npuertorriqueno.\" In Cambio y desarrollo en Puerto Rico: la transformacion del\nPartido Popular Democratico, edited by Gerardo Navas Davila. Rio Piedras,\nPuerto Rico: Editorial Universitaria, Universidad de Puerto Rico, 1985. ISBN:\n9780847724352. (sobre los programas de fomento de LMM)\n\n14. Dietz, James L. Economic History of Puerto Rico: Institutional Change and\nCapitalist Development. Princeton, NJ: Princeton University Press, 1986. ISBN:\n9780691022482.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Discussion Questions - 27 sept",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/d052e6bcf3a526022af166d942f72d21_MIT21G_716F07_PrgntsBernar.pdf",
      "content": "Discussion Questions - 27 sept. 2007\n\nGrupo I - \"La casa de Bernarda Alba\" - Actos I y II\n\n1. Cuando Dali y Bunuel colaboraron en el guion de \"Un perro andaluz\"\nen 1928/29, decidieron no admitir ninguna escena que pudiera prestarse\na una explicacion racional. Practicaron la escritura automatica, con el\ndeseo de que el proceso permitiera salir las imagenes y las ideas de su\nsubconsciencia, aquella parte de los procesos mentales humanos que,\nsegun Freud, normalmente esta censurada, negada, por el individuo. En\nsu obra \"La casa de Bernarda Alba,\" Lorca obviamente no nos presenta el\nproducto de la escritura automatica, sin intervencion posterior de la\nlogica y de la racionalidad. Sin embargo, ¿Uds. detectan un interes de su\nparte en la subconciencia, la censura y la represion de los impulsos\nirracionales y anarquicos? Si responden afirmativamente, ¿como se ve\neste interes en la obra de Lorca? ¿Como se representa en el escenario?\n\n2. ¿Que comenzamos a sospechar respecto a Adela en el segundo acto?\n¿Que sospechan Poncia y Martirio? Al final del acto, Adela reacciona de\nmanera diferente a la noticia de la desgracia de la hija de la Librada. ¿Por\nque creen Uds. que es asi?\n\nGrupo II - \"La casa de Bernarda Alba\" - Actos I y II\n\n1. ¿Cuando aparece Bernarda en el escenario en el segundo acto? ¿Que\nefecto tiene esto? ¿Quienes estan en la escena antes que ella? y ¿de que\nhablan?\n\n2. En el segundo acto, ¿en cual estacion del ano estamos? ¿Que tiempo\nhace? ¿Esta epoca del ano trae cambios al pueblo y a su poblacion?\nDescriban.\n\n3. En contraste con \"Bodas de sangre\" y \"Yerma,\" casi no hay ni musica ni\npoesia en esta obra. ¿Cuando aparecen, sin embargo? y ¿que es el\ncontexto? ¿Cual tema de la obra ayudan a desarrollar?\n\n4. ¿Cuantas veces en los dos primeros actos ha golpeado a una de sus\nhijas Bernarda? Discriban estos momentos. ¿Que puede representar el\nbaston de Bernarda?\n\nGrupo III - \"La casa de Bernarda Alba\" - Actos I y II\n\n1. En La interpretacion de los suenos, escrito por Sigmund Freud in 1900\ny traducido al espanol en los anos veinte, Freud habla de como el folclor,\nlos chistes, los suenos y las fantasias de los neuroticos a menudo\nemplean la casa u otras estructuras arquitectonicas como simbolos del\ncuerpo humano. En el capitulo VI, \"El trabajo de los suenos\" (\"The\nDream-Work\"), Parte E, escribe, \"Boxes, cases, chests, cupboards and\novens represent the uterus..., and also hollow objects, ships, and vessels\nof all kinds.--Rooms in dreams are usually women...; if the various ways\nin and out of them are represented, this interpretation is scarcely open to\ndoubt.\" (Avon. ed., p. 389). Al igual que Bunuel y Dali, se puede suponer\nque Lorca conocia el texto de Freud. (Era una lectura favorita entre los\nestudiantes en el dormitorio universatario donde los tres vivian en\nMadrid a principios de los anos 20.) Reflexionen sobre las posibles\nconnotaciones del titulo y del escenario de la obra (por lo menos en los\nprimeros dos actos). ¿Creen que el nombre de Bernarda Alba en el titulo\nes importante?\n\n2. Comparen las conclusiones del primer acto y del segundo. ¿Tienen\nalgo en comun?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Rosario Ferré, “El collar de camándulas,” Papeles de Pandora, 1976",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-716-introduction-to-contemporary-hispanic-literature-fall-2007/4b163f3628dec641e08f3e26f8159d63_MIT21G_716F07_PrgntsCollar.pdf",
      "content": "Rosario Ferre, \"El collar de camandulas,\" Papeles de Pandora, 1976. (El\ncuento se publico por primera vez en la revista literaria Zona de Carga y\nDescarga, en 1975.)\n\nI. En este cuento no se usa la puntuacion, y las letras mayusculas solo se\nusan para los nombres propios. Asi que faltan los signos tradicionales\npara marcar el comienzo y el final de una oracion gramatical completa.\nLo que si se retiene en el texto es la division en parrafos. Para facilitar la\ninterpretacion y comentario del texto, recomiendo que Uds. numeren los\nparrafos. Hay un total de treinta y tres en el texto. ¿Cual es el efecto\nestilistico de esta supresion de las convenciones graficas para marcar el\ncomienzo y el final de las oraciones?\n\nII. Los personajes:\n\nLas mujeres: 1. La senora = la madre de Antonio, Miguel y Arcadio, la\nesposa del padre de Antonio y Miguel, la amante temporal del cantante y\nguitarrista callejero, una senora de la clase alta y adinerada\npuertorriquena (\"una senora bien\"); se queda permanentemente muda\ncuando su amante la abandona y desaparece de su vida, al final del\nparrafo #7, p. 125 (\"pero no volvio a hablar jamas\").\n\n2. Armantina = la sirvienta de 20 anos que nacio en la\ncasa de sus patrones, la familia de la senora; muda (no se sabe por\ncuanto tiempo; tal vez haya nacido asi); muchos la consideran \"retardada\nmental\" (par. #30, p. 132), pero puede ser que no lo sea y que se la crea\nasi por su mudez; se casa con Arcadio, el hijo menor de la senora; se\nqueda embarazada de Arcadio, pero probablemente aborta durante su\nprenez cuando es golpeada y pateada repetidamente por Antonio, Miguel\ny el padre de estos, el viudo de la senora.\n\nLos hombres: 1. El marido de la senora = despues de retirarse de su\ntrabajo en un banco, se dedica a la politica islena, presentandose como\ncandidato electoral; es padre biologico de Antonio y Miguel y padre\nadoptivo de Arcadio.\n\n2. El guitarrista callejero = se menciona por primera\nvez en el par. #3, p. 123; padre biologico de Arcadio y amante temporal\nde la senora; no se sabe de donde viene ni a donde se va; de el viene el\ncollar de camandulas y de matos; al irse, deja el collar como un regalo y\nun recuerdo a la senora.\n\n3. Arcadio = hijo de la senora y del guitarrista,\naceptado al nacer por el esposo de la senora, quien probablemente cree\nque es hijo suyo; es el hijo menor de esta familia; es caracterizado como\n\"bala perdida\" y \"oveja negra\" en el par, #11, p. 126; se casa con\n\nArmentina, y, despues de la muerte de su madre, se va a Nueva York,\ndejando a Armentina como sirvienta en casa de su familia; le promete\nmandarle un pasaje para que se reuna con el en N.Y. en cuanto encuentre\ntrabajo (par. #13, p. 127), pero nunca lo hace. Encuentra una muerte\nviolenta en N.Y., acribillado en la cara por muchas balas. Se manda su\ncadaver de regreso a Puerto Rico para ser enterrado alla.\n\n4 y 5. Antonio y Miguel = los dos medio hermanos de\nArcadio.\n\nIII. Vocabulario\n\n-ponque = (Cuba y Venezuela) torta de harina, manteca y huevos\n\n-leche de tamaima = No se ha podido encontrar ninguna definicion,\naunque la palabra \"tamaima\" aparece como nombre en Tenerife de las\nIslas Canarias, Puerto Rico y Florida; tambien aparece en la lengua vasca.\n\n-camandula = 1. Rosario de uno o tres dieces (diez = cuenta mas gruesa o\ndiferente de las otras y mas separada de ellas que estas entre si, con que\nseparan los dieces del rosario); 2. Fig. e informal. Hipocresia o astucia\n(camandulear = 1. [Salamanca, Esp.] callejear, ir de casa en casa, 2.\n[Aragon, Salamanca, Esp.] curioser o ir enterandose de lo que pasa\n[tambien, ostentar falsa devocion])\n\n-mato = ramilla o trozo arrancado de una mata\n\n-juey = (Puerto Rico) cangrejo de tierra\n\n-grajear = 1. V. intr. Dicho de un grajo o de un cuervo: cantar o chillar 2.\nV. intr. Dicho de un nino que aun no habla: formar sonidos guterales\n\n-albaceazgo = power of executor (albacea = executor)\n\n-alfenique = a sugar paste made of sweet almonds\n\n-valla = fence, barrier\n\n-achantarse = fam. Ocultarse mientras dura un peligro\n\n-ganga = gang\n\n-tascar = 1. Dicho de una persona = quebrantar con los dientes algun\nalimento duro, como una galleta 2. Dicho de una bestia: quebrantar con\nruido la hierba o el verde cuando pace\n\n-serreta - semicirculo de hierro que se coloca sobre la nariz de los\ncaballos para guiarlos\n\nIV. Curiosidades de la sintaxis. Fijarse en:\n\n-\nlos cambios de los pronombres\n-\nlos cambios de los tiempos verbales\n-\nla frecuencia de la estructura \"como si + subjuntivo pasado del\nverbo\"\n\nV. Temas\n\nA. Las cosas que pasan de una persona a otra: la receta del ponque (que\npasa de la madre de la senora a la senora a Armantina), y el collar de\ncamandulas y matos (que pasa del cantante callejero a la senora a\nArcadio a Armantina). En los dos casos, ¿que pueden significar estas\nlineas de transmision?\n\nB. La mudez, condicion sufrida por la senora y por Armantina. ¿Que\npuede sugerir esta condicion compartida por las dos mujeres del cuento,\nmujeres que pertenecen a diferentes clases sociales?\n\nC. Los transgresores, los rebeldes: la senora, Arcadio y Armantina. ¿Se\nsabe si es rebelde el primer guitarrista callejero? Dado lo poco que se\naprende de el, ¿como nos es legitimo caracterizarlo? ¿Que forma asume\nla rebeldia en cada uno de los tres personajes claramente transgresores?\n¿Estas rebeldias asumen formas positivas, negativas, destructoras, auto-\ndestructoras, violentas, agresivas, pasivas?\n\nD. La violencia. ¿Quien o quienes ejercen la violencia en el cuento? ¿Que\nformas asume?\n\nE. La repeticion del motivo del \"pasar al otro lado\": \"por la curva de otro\ncielo\" (final del par. #3, p. 123), \"como si caminara con el por el camino\nde otro mundo que se gastaba muy lejos del pueblo\" (final del par. #5, p.\n124), \"ya era demasiado tarde ya ella habia saltado la valla\" (final del par.\n#15, p. 128), \"ahora puedo irme tranquila cantando caminando gastando\nel camino del otro mundo que se pierde alla lejos\" (final del par. #33, p.\n133). ¿Que puede significar este motivo?\n\nVI. La narracion\n\nA. ¿Hay una sola voz narrativa o varias? Identifiquen la voz o las voces\nnarrativas?\n\nB. ¿Como se organiza el tiempo en la narracion?\n\nC. ¿Cuales son los espacios fisicos en que parece ocurrir la narracion?\n¿Hay una distincion entre estos espacios narrativos y espacios aludidos\nen la narracion, es decir, espacios a que se refiere la narracion pero\ndonde no ocurre el acto de narracion?\n\nVII. Preguntas comparativas con otros textos\n\nA. Tematicamente, ¿hay puntos de contacto entre este cuento y la novela\nFelices dias, Tio Sergio?\n\nB. Para los que hayan leido el cuento de la escritora mexicana Elena\nGarro, \"La culpa es de los tlaxcaltecas,\" de 1964, ¿encuentran algunos\npuntos de contacto entre el cuento de Rosario Ferre y el de Elena Garro?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.716 Introduction to Contemporary Hispanic Literature\nFall 2007\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}