{
  "course_name": "Introduction to Oscillations and Waves",
  "course_description": "Introduction to Oscillations and Waves covers the basic mathematics and physics of oscillatory and wave phenomena. By the end of the course, students should be able to explain why oscillations appear in many near equilibrium systems, the various mathematical properties of those oscillations in various contexts, how oscillations and waves are related, and the basic mathematical description and properties of a wave.\nThis course was offered as part of MITES Summer, a six-week, residential STEM experience for rising high school seniors. MIT Introduction to Technology, Engineering, and Science (MITES) provides transformative experiences that bolster confidence, create lifelong community, and build an exciting, challenging foundation in STEM for highly motivated 7th–12th grade students from diverse and underrepresented backgrounds.",
  "topics": [
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Classical Mechanics",
    "Electromagnetism",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Classical Mechanics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1 hour / session. Attending recitation is mandatory.\n\nAbout this Course\n\nThis course was offered as part of\nMITES Summer\n, a six-week, residential STEM experience for rising high school seniors.\nMIT Introduction to Technology, Engineering, and Science (MITES)\nprovides transformative experiences that bolster confidence, create lifelong community, and build an exciting, challenging foundation in STEM for highly motivated 7th-12th grade students from diverse and underrepresented backgrounds.\n\nPrerequisites\n\nWith regard to mathematics, students should be proficient in algebra, matrix addition/multiplication, trigonometry, analytic geometry, and basic differentiation/integration. With regard to physics, students should have had prior exposure to and practice with Newton's laws of motion, 1D kinematics, 2D projectile motion, and conservation of energy/momentum.\n\nDescription\n\nThis course will cover the basic mathematics and physics of oscillatory and wave phenomena. Content-wise, by the end of the course, students should be able to explain why oscillations appear in many near equilibrium systems, the various mathematical properties of those oscillations in various contexts, how oscillations and waves are related, and the basic mathematical description and properties of a wave. Skill-wise, students should become adept at translating conceptual understanding into mathematical explanations, writing short programs to solve analytical systems, and developing clear questions about physical systems.\n\nTopic Outline\n\nSimple Harmonic Oscillator\n: equation of motion, solutions to equation of motion, classical pendulum\n\nDamped Oscillator\n: underdamped, overdamped, and critically damped oscillator\n\nForced Oscillator and Resonance\n: pushing friend on a swing, resonance, beating, amplitude and phase\n\nCoupled Oscillations and Normal Modes\n: two masses connected by springs, eigenvalues and eigenvectors, three masses connected by springs, N masses connected by springs\n\nWave Equation and Standing Waves\n: N → inf limit of coupled oscillators, transverse and longitudinal waves, boundary conditions, Fourier series\n\nTraveling Waves\n: traveling wave solutions, relationship between traveling wave and standing waves, reflection and transmission of a wave, wave through a medium\n\nElectromagnetic Waves\n: electromagnetic phenomena, Maxwell's equations, wave equation, speed of light, properties of electromagnetic waves\n\nLinear Systems\n: one-dimensional linear systems, fixed points, stability, bifurcations\n\nPhase Space\n: two-dimensional linear systems, stability, graphical characterization of two-dimensional linear systems\n\nLimit Cycles\n: self-oscillations, alone on a swing\n\nLecture Notes and Online Resources\n\nThere are\nlecture notes\nfor the course. We will not have a formal textbook, however, many useful references can be found online.\n\nThe Physics of Vibrations and Waves\nby Pain: Comprehensive overview of oscillatory and wave phenomena. This course overlaps with chapters 1-6.\n\nThe Physics of Waves\nby Georgi: Similar to Pain in its scope and mathematical level. This course overlaps with the chapters 1-3 and 5-6.\n\nWaves notes\nby Morin: Chapters of a book in progress from David Morin. Contains many examples of concepts and very solid explanations. This course overlaps with chapters 1-5 and chapter 8.\n\nAssignments\n\nMost of the knowledge and skills you gain from this course will come from the problems you solve in assignments. Consequently, how much you learn will grow in direct proportion to how much effort you put into these assignments.\n\nBut you should see these well-defined problems of the assignments as bare-minimum requirements for your learning; If you want to obtain any actionable familiarity with the material, you will certainly have to work through these problems (or others like them), but in order to develop a deeper proficiency you will have to look beyond the assigned work and develop your own ways to interpret the world through the material you're learning. To this end, the assignments will include opportunities for you to ask and answer your own questions about physical systems.\n\nIn completing these assignments, you can use online resources and your peers for help, but plagiarism (passing off someone else's work or explanation as your own) is not acceptable and will result in a zero for the assignment.\n\nNote on Collaboration\n: To prevent any mistakes in this direction, at the end of your assignment, list the people you collaborated with and the online resources you referenced. This list does not mean you can copy derivations from your friends as long as you cite them. Any work you submit must follow from your own reasoning.\n\nFinally, in writing up your work, it is important to not only write out derivations but to include an explanation of your mathematical derivations. In short, you need both words and equations in your solution. The lecture supplement (\nSupplementary Notes 1\n) will review the proper format for writing up your solutions.\n\nDue Dates\n: Except for the last assignment, problem sets will be due on Wednesday the morning before the start of class. The last assignment will be due on the day before the final exam.\n\nExams\n\nThere will be a midterm and a final exam.\n\nEvaluation\n\nThere are no formal grades in\nMITES\n, but you will receive numerical grades on your assignments and exams so that you (and I) can track your progress. Overall don't stress too much about the absolute value of these grades over the course of the program. What is more important is consistently showing up in class, recitation, and office hours, and working to complete all assignments.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "RES.8-009 (Summer 2017), Lecture 8: Traveling Waves and Boundary Interactions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/res-8-009-introduction-to-oscillations-and-waves-summer-2017/mitres_8_009su17_lec8n.pdf",
      "content": "Massachusetts Institute of Technology\nMITES 2017-Physics III\nLecture 08: Traveling Waves and Boundary Interactions\nIn these notes, we solve the wave equation for traveling wave solutions and calculate the transmission and\nreflection coeycients characterizing how waves propagate across boundaries. We also discuss waves trav\neling through media and the energy dissipation that can result. We end with a short discussion of sound\nwaves.\n1 Waves en route\nIn the previous notes, we successfully derived the wave equation describing how strings underwent both\nlongitudinal and transverse1 oscillations. For transverse oscillations defined by a vertical displacement\ny(x, t), we found the wave equation was given by\n∂2\n∂2\ny(x, t) = v\ny(x, t),\n(1)\n∂t2\n∂x2\np\nwhere v (which is\nT/μ for the string) was a quantity with units of velocity that we had yet to interpret. In\nderiving this equation, we considered the string to reside within a specific domain of space and considered\nthe wave motion propagating within this domain. Such an assumption was a convenient starting point in\nanalyzing waves, but not all waves exist bounded in fixed domains. For example, light and sound waves\n(both of which are described by wave equations) travel from one place to another interacting with the various\nmedia they come in contact with.\nWith regard to light, we are able to see because light waves are reflected o various objects in our envi\nronment and travel to the rod and cone cells in our eyes. During travel, the intensity of the light can decrease\nif it has to propagate through fog, or it might vanish entirely if it was incident on an opaque object.\nWith regard to sound, if you can hear cars driving outside or your neighbors sitting rooms away, it is\nbecause sound waves are traveling through the air, being transmitted through walls and boundaries sepa\nrating and finally hitting your ear drums. Not all of the sound waves emitted by their respective sources\nreach you. Some of these waves are reflected back toward their source and others decay away quickly.\nFigure 1: We can hear and see objects around us due to traveling sound and light waves. How do we\nmathematically describe such waves?\nWe would like to be able to describe such propagation. Since we have only so far considered bounded\n1As a useful mnemonic to di erentiate the two, remember that longitudinal waves travel \"along\" the axis of propagation\n\n2 TRAVELING WAVE SOLUTIONS\nM. WILLIAMS\nwaves, we would need to expand our conception of solutions to the wave equation in order to describe\ntraveling waves. To this end, the framing question for this lesson is\nFraming Question\nHow do we model the ways waves travel through space and are reflected, transmitted, and\ndispersed through boundaries?\n2 Traveling wave solutions\nFigure 2: The two terms in the general solution Eq.(4) define wave propagation at the same speed but in\ndi erent directions.\nOur goal is to solve Eq.(1) such that our solutions describe traveling waves. Our method of solution will\nparallel our previous solution methods (namely guess and check), but before we make the attempt, let us\ndiscuss some properties we want these traveling wave solutions to have.\nUnlike our standing wave solutions (which were defined only within the domain [0, L]) we want our\ntraveling waves to be defined for a much larger space of x values. For simplicity, we will take this larger\nspace of x values to be the entire real line2, i.e., we want our wave to be defined for x = +inf and x = -inf.\nAlso, we will take our waves to be propagating with a finite velocity v. Concerning v, we would want\nour waves to propagate such that if we translate them by a distance Δx in the opposite direction of the\npropagating wave front, then this would be tantamount to not moving at all and instead waiting a time\nΔt = Δx/v for the wave to advance by the position Δx.\nTo satisfy this property, our wave y(x, t) must be a function of x - vt. We can see this by noting that if\nwe take x → x - Δx (i.e., move by Δx in the opposite direction of +v), then the function f1(x - vt) becomes\nf1(x - Δx - vt) = f1(x - v(t + Δt))\n(2)\nwhich is equivalent to taking t → t + Δt if Δt = Δx/v. Therefore, as our guess for a solution to Eq.(1), we\ntake y(x, t) = f1(x - vt) where f1 is any suyciently well-behaved3 function. Checking this solution we have\n∂2\n∂2\ny(x, t) = v\ny(x, t)\n∂t2\n∂x2\n∂2\n∂2\nf1(x - vt) = v\nf1(x - vt)\n∂t2\n∂x2\n(-v)2f1(x - vt) = v 2f1(x - vt)\n2In reality waves always interact with something (either the source of the wave or its target) at some point during their propagation\nso their domain is actually constricted.\n3By \"well-behaved\" we mean there are no singularities.\n\n2 TRAVELING WAVE SOLUTIONS\nM. WILLIAMS\nf1(x - vt) = f1(x - vt).\n(3)\nThus any function which is a function of the quantity x - vt is a solution to the wave equation. Through a\nsimilar calculation, we can show that the solution y = f2(x + vt) (where f2 is not necessarily equivalent to\nf1) is also a solution to Eq.(1). These two solutions f1(x - vt) and f2(x + vt) represent wave propagation in\ntwo di erent directions: The solution f2(x + vt) represents a wave propagating to the left, as opposed to the\nrightward propagation of f1(x - vt). Now, given that the general solution to a linear di erential equation is\na linear combination of the possible solutions, we find that the general solution to Eq.(1) is\ny(x, t) = f1(x - vt) + f2(x + vt)\n(4)\nwhere the coeycients of the linear combination were absorbed into redefinitions of f1 and f2. Although, it\ndoes not look like it, Eq.(4) includes the standing wave solutions we found through separation of variables\nin the previous notes. Thus, Eq.(4) is indeed the most general (although not always the most useful) form\nof the solutions to Eq.(1).\n2.1 The Connection between Standing and Traveling Waves\nWe stated that Eq.(4) is the true general solution for a wave equation. What relationship does it have with\nthe previous solution we found for standing waves?\nTo understand the relationship, we consider Eq.(4) with two sinusoidal waves of equal phase and am\nplitude but traveling in opposite directions. We define this wave amplitude as u(x, t):\nu(x, t) = 1 [A cos (k(x - vt)) - A cos (k(x + vt))] ,\n(5)\nwhere k is an as of yet unspecified wave number. Using the sum of angles formula for cosine functions, we\nfind that Eq.(5) becomes\nu(x, t) = A sin(kx) sin(ωt),\n(6)\nwhere we used the definition of angular frequency to replace kv with ω. From here, er vsn extend this result\nby presuming that instead of having two waves traveling on the string, we have infinitely many waves all of\nthe form Eq.(5) except each wave's wavenumber k depends on an index n = 1, 2, . . . such that kn = nπ/L\n(where L is some length of interest). The coeycient A is then reasonably expected to depend on n, so we\nwould replace A with An. The total wave displacement would then be\ninf\nX\ny(x, t) =\nun(x, t)\nn=1\ninf\nX An\n=\n[cos (kn(x - vt)) - cos (kn(x + vt))]\nn=1\ninf\nX\n=\nA sin(knx) sin(ωnt),\n(7)\nn=1\nwhich is the solution we found for the waves on a string bounded within x = 0 and x = L. Eq.(7) is\nsomewhat less general than the Fourier series solution found before in that it satisfies y(x, 0) = 0, and thus\nan initial condition has (implicitly) already been imposed. To find the more general solution, we would have\nneeded to begin with a more general combination of sines and cosines in Eq.(5). In either case, we see that\nstanding waves can be represented by linear combinations of traveling waves moving in opposite directions.\n\n2 TRAVELING WAVE SOLUTIONS\nM. WILLIAMS\n2.2 Fourier Integrals and Periodic Motion\nGiven that our focus is on periodic motion, it is natural to first explore sinusoidal solutions in Eq.(4). So we\nwill take our function f1 and f2 to be a linear combination of sinusoids:\nThus the solution Eq.(4) becomes\ny(x, t) = A cos [k(x - vt)] + B sin [k(x - vt)] + C cos [k(x + vt)] + D sin [k(x + vt)]\n(8)\nwhere A, B, C, and D are real quantities. For the purposes of calculation, it will prove easier to deal with a\nmore general form of these sinusoidal solutions. We define the complex variable z(x, t) such that y(x, t) is\nthe real part of z(x, t):\ny(x, t) = Re [z(x, t)],\n(9)\nWe will take z(x, t) to satisfy the same wave equation as y(x, t),\n∂2\n∂2\nz(x, t) = v\nz(x, t),\n(10)\n∂t2\n∂x2\nwith the same form of the general solution\ne\nz(x, t) = f1(x - vt) + fe 2(x + vt)\n(11)\nThe fact that z(x, t) is complex allows us to consider sinusoidal solutions written as complex exponentials.\nNamely, the complex analog of Eq.(8) is\nik(x-vt)\n-ik(x-vt)\nik(x+vt)\n-ik(x+vt)\nz(x, t) = A+e\n+ B+e\n+ A-e\n+ B-e\n,\n(12)\niku\n-iku\nwhere A± and B± are complex quantities. We include both e\nand e\ntype of functions in Eq.(12)\nbecause complex exponentials with opposite arguments are independent of one another. We can obtain\nEq.(8) by applying Eq.(9) and taking Re[A+] = A, Im[A+] = -B, and so on. The way we will use Eq.(12),\nis that we will take its real part before we physically interpret any result computed from it. Recalling our\nprevious nomenclature, for the forward moving wave solution |A+| is the amplitude of the wave, k is the\nwave number, and kv = ω is the frequency.\nIn the previous lesson, we noted that solutions to the wave equation defined by a single wave number\nk only represent one solution to the wave equation. For example, we found that one solution to the wave\nequation in a bounded domain was\nAn sin (knvt) sin (knx) .\n(13)\nIn order to find the general solution, we needed to sum this solution over all possible values of kn. Given\nthat each solution is associated with a specific coeycient, the general solution was then\ninf\nX\ny(x, t) =\nAn sin (knvt) sin (knx)\n(14)\nn=1\nSimilarly, to find the most general form of Eq.(12) we need to sum over all possible values of k. Here, k is a\ncontinuous (rather than discrete) variable so this summation will take the form of an integral. Moreover, the\ncontinuous analog of the An in Eq.(14) is A+(k) and A-(k). Thus, the most general form of the sinusoidal\nsolution Eq.(12) is\nZ inf\nh\ni\nik(x-vt)\nik(x+vt)\nz(x, t) =\ndk A+(k)e\n+ A-(k)e\n,\n(15)\n-inf\nWe do not need to include the B coeycients from Eq.(12); since our integral is running from -inf to +inf, the\ne-ik(x-vt) and e-ik(x+vt) solutions are automatically included in the negative domain of k. In the subsequent\nanalysis, we will mostly be considering solutions of the form Eq.(11). However, Eq.(15) is important because\n\n3 WAVES CHANGING MEDIA\nM. WILLIAMS\nit is related to field of mathematics called Fourier analysis which is built around the following theorem.\nFourier's Theorem: The two forms of the general solution to Eq.(10) (i.e., Eq.(11) and Eq.(15)) are\nactually equivalent. By a mathematical result called Fourier's Theorem, a general function f(x) can\nbe represented as\nf(x) =\nZ inf\n-inf\ndk φ(k)e ikx ,\n(16)\nwhere the function φ(k) is in turn given by\nφ(k) = 1\n2π\nZ inf\n-inf\ndx f(x)e -ikx .\n(17)\nUsing Fourier's theorem we can express the arbitrary functions ef1 and ef2 used in Eq.(11) as\nf1(s) =\nZ inf\n-inf\ndk A+(k)e iks\nand\nf2(s) =\nZ inf\n-inf\ndk A+(k)e iks ,\n(18)\nwhere A+ and A- are defined by equations similar to Eq.(17). With Eq.(16), we thus find\nz(x, t) = ef1(x - vt) + ef2(x + vt) =\nZ inf\n-inf\ndk\nh\nA+(k)e ik(x-vt) + A-(k)e ik(x+vt) i\n,\n(19)\nwhich establishes the equivalence between Eq.(11) and Eq.(15).\n3 Waves changing media\nWith Eq.(15), we have at last found a general mathematical description of waves traveling in free space,\nbut as mentioned in the introduction, waves rarely travel unimpeded. Rather, waves often interact with\ntheir surrounding by changing media or reflecting o of surfaces. For example, mirrors work by reflecting\nlight directly back at its source, and we can see through to the bottom of pools because light is propagating\nfrom the bottom of the pool through the water and then through the air to our eyes. Whenever the medium\nthrough which a wave is propagating changes, its properties change. In this section, we study these changes\nusing a simple model of a propagating string.\n3.1 Reflection and Transmission\nFigure 3: Two strings of di erent mass densities joined at x = 0. Figure from [1]\n(c) AIP Publishing LLC. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use.\n\n3 WAVES CHANGING MEDIA\nM. WILLIAMS\nFor the string system that we have been considering the \"medium\" through which the wave is propagat\ning is the string itself. The defining quality of the string which defines the properties of propagation is its\nmass density μ. Thus to study how the properties of waves change as they cross media, we have to consider\nhow waves change as they transition between strings with di erent mass densities4.\nWe begin with the system shown in Fig. 3 where a string of mass density μ1 for x < 0 is connected at\nthe point x = 0 to a string of mass density μ2 for x > 0. We assume that for all time, we have a continuos\nwave f0(x - vt) coming in from the left (and we know it is coming in from the left because f0 is a function\nof x - vt and not x + vt). We want to know what happens to the wave after it reaches the origin.\nWe presume two things can happen: part of the wave will be transmitted to the string of mass density μ2\nand part of the wave will be reflected back at its source. Namely, if we were to write the equation representing\nthe total wave for x < 0 and x > 0 we would have\n(\nf0(x - v1t) + fR(x + v1t) for x < 0\ny(x, t) =\n(20)\nfT (x - v2t)\nfor x > 0\nwhere R stands for the reflected wave and T stands for transmitted wave. We use di erent velocities for\np\nx < 0 and x > 0 because the velocity of a wave on a string is defined by v =\nT/μ and the sections of the\nstring on either side of x = 0 have di erent densities. We note that the transmitted wave is traveling to the\nright because it is a function of x - vt, but the reflected wave is traveling to the left because it is a function\nof x + vt.\n3.2 Continuity and Zero Net-Transverse Force\nWe will determine a relationship between f0, fR, and fT by using physical properties of the string. First,\nthe string is continuous, so the total wave amplitude at x = 0 must be the same on both sides of the point\nconnecting the two parts of the string. This means we must have\ny(0+, t) = y(0-, t),\n[Continuity condition]\n(21)\nwhere 0+ defines x = 0 found by approaching the point from the right and 0- defines x = 0 found by\napproaching the point from the left. In terms of our general solution for , this continuity condition becomes\nf0(-v1t) + fR(v1t) = fT (-v2t).\n(22)\nNext, any point on the string is essentially massless, so the total force exerted on that point must be zero.\nThis must be true of the point joining the x < 0 and x > 0 regions of the string as well. For the string with\ntransverse oscillations, the force arises from the tension T and the slope of the string. We can define this\nslope by the angle θ the string makes with the horizontal. We will assume θ is small which is true for low\namplitude waves. When a section of string is at an angle θ with the horizontal, the force which is being\nexerted on it to produce this angle has horizontal and vertical components. For a string of tension T , the\nhorizontal component of the force at the point x = 0 coming from left part of the string is\nFx(x = 0) = -T cos θ ' -T.\n(23)\nWe use a negative sign because the tension from the left part of the string is pulling the point at the origin\ntoward the x < 0 direction. Similarly, the vertical component of the force coming from the left part of the\nstring is\n\n∂y\nFy(x = 0) = -T sin θ ' Tθ ' T tan θ = -T\n,\n(24)\n∂x\n4More generally, we could also consider di erent tensions, but for simplicity we will take the tensions to be equal on both sides of\nthe string.\n\n3 WAVES CHANGING MEDIA\nM. WILLIAMS\nwhere we used the small-angle approximation of sin θ and tan θ. Here, the negative sign arises because if\nthe slope of the string at the origin is positive then the left part of the string must be pulling down on the\npoint at the origin. The requirement that the net-force on the part of the string at x = 0 is zero, amounts\nto requiring that the sum of F for x < 0 and F for x > 0 at x = 0 is zero. Given Eq.(23), this condition is\nautomatically satisfied for the horizontal forces acting within the string. Namely we have\nFnet,x(x = 0) = lim Fx + lim Fx ' -T + T = 0.\n(25)\nx→0+\nx→0-\nwhere we use the notation x → 0+ or x → 0- to signify approaching x = 0 from the right or left, respectively.\nConversely, we also require that the net-force in the y-direction is zero, and so we have\n\n∂y\n∂y\nFnet,y (x = 0) = lim Fy + lim Fy ' - lim T\n+ lim T\n= 0.\n(26)\nx→0+\nx→0-\nx→0+\n∂x\nx→0-\n∂x\nTherefore, for our string of constant tension, this condition of zero net-force in turn implies\n\n∂y\n∂y\nT\n= T\n.\n[Zero net-transverse force condition]\n(27)\n∂x\n∂x\n0+\n0-\nGiven that the string tension is the same on both sides of the boundary, written in terms of the general\nsolution Eq.(3.1), this result becomes\nf0\n0 (-v1t) + fR\n0 (v1t) = fT\n0 (-v2t)\n(28)\nIn summary, the two conditions that the string displacement at an interface (placed at x = 0) must satisfy\nare\n1. Continuity: The string must be continuous across the interface (Eq.(21)). This means the displacement\ny(x, t) when approaching the interface from the left must be the same as that when approaching the\ninterface from the right.\n2. Zero net-transverse force: The net-vertical force at the interface must be zero (Eq.(27)). This is to\nensure there is no net-force applied to the infinitesimal mass at the interface; such a net force would\nyield an infinite acceleration.\n3.3 Reflection and Transmission Coeycients\nEq.(22) and Eq.(28) are convenient starting points for deriving properties relating the incident wavefront f0\nto the reflected and transmitted wavefronts fR and fT . We can go even further by positing a standard form\nfor these waves. For simplicity, we will return to the complex exponential form of the general sinusoidal\nsolution 5. Our traveling wave solutions are then\nik1u+ +B0e -ik1u+\nik1 u- +BRe -ik1u-\nik2 u+ +AT e -ik2u+\nfe 0(u+) = A0e\n,\nfe R(u-) = ARe\n,\nfe T (u+) = AT e\n,\n(29)\nwhere u+ = x - vt and u- = x + vt and where we use k1 and k2 to refer to the wave numbers of the μ1 string\nand μ2 string, respectively. Given the complex exponential analog of Eq.(29), we find that the total wave for\nx < 0 is\nik1(x-v1t)\n-ik1 (x-v1t)\nik1(x+v1t)\nik1(x+v1t)\nz(x, t) = A0e\n+ B0e\n+ ARe\n+ BRe\n[For x < 0]\n(30)\n5To be more precise we should have performed this analysis with the function z(x, t), but this measure of sloppiness does not a ect\nthe final results. If we find any complex quantities in a final result, we will simply take the real part and assume we implemented the\nprocedure correctly from the beginning.\n\n3 WAVES CHANGING MEDIA\nM. WILLIAMS\nand the total wave for x > 0 is\nik2(x+v2t)\nik2(x+v2t)\nz(x, t) = AT e\n+ BT e\n[For x > 0].\n(31)\nWe note that because string 1 and 2 di er in their density, the parameters in the system which are dependent\non length scale are di erent for the two sections of the strings. Namely, any quantity which includes units\nof distance is di erent when it is defined on the leftside versus on the rightside of Fig. 3. However, any\nquantity with out any units of distance is the same across the string. This means that although k and v (with\nunits of m-1 and m/s, respectively) are not the same across the two sections of the string, ω = kv (with\nunits of rad/sec) is the same. Therefore, Eq.(30) and Eq.(31) becomes\ni(k1x-ωt)\n-i(k1x-ωt)\ni(k1x+ωt)\n-i(k1x+ωt)\nz(x, t) = A0e\n+ B0e\n+ ARe\n+ BRe\n[For x < 0]\n(32)\nor\ni(k2x-ωt)\n-i(k2x-ωt)\nz(x, t) = AT e\n+ BT e\n[For x > 0].\n(33)\nNow, imposing Eq.(21) on these forms of z(x, t), we find\n-iωt\niωt\n-iωt\niωt\niωt\n-iωt\nAT e\n+ BT e\n= A0e\n+ B0e\n+ ARe\n+ BRe\niωt\n= (A0 + BR)e -iωt + (B0 + AR)e\n,\n(34)\nwhich given the linear independence of eiωt and e-iωt, leads to the two equations\nAT = A0 + BR,\nBT = B0 + AR.\n(35)\nSimilarly, imposing Eq.(27) on these forms, gives us\n-iωt - ik2BT e -iωt\n-iωt - ik1B0e iωt\niωt - ik1BRe -iωt\nik2AT e\n= ik1A0e\n+ ik1ARe\niωt\n0 = (k1A0 - k1BR)e iωt + (-k1B0 + k1AR)e\n,\n(36)\nwhich then yields the other two equations\nk2AT = k1(A0 - BR),\n-k2BT = k1(-B0 + AR).\n(37)\nTogether Eq.(35) and Eq.(37) give four equations which can be broken up into two systems of two equations.\nThe unknowns in the equations are the amplitudes of the reflected and transmitted waves. Solving these\nsystems is a matter of basic algebra and their solutions mirror one another. So we will write the solutions\nfor a single system and ignore the other under the assumption that it can be easily found through a similar\nprocedure. Presuming we know the initial wave amplitude A0, the amplitude of the the reflected wave and\nthe transmitted wave are (from solving the system given by the left equations in Eq.(35) and Eq.(37))\n2k1\nk1 - k2\nAT =\nA0,\nBR =\nA0.\n(38)\nk1 + k2\nk1 + k2\nIt will prove more useful to write this result in terms of the mass density μ of each string. Dividing Eq.(38)\nby ω (which is the same on both sides of the string), and using k/ω = v-1, we find\n-1\n-1\n-1\nv\nv\n- v\nAT =\nA0,\nBR =\nA0,\n(39)\n-1\n-1\n-1\n-1\nv\n+ v\nv\n+ v\n\n3 WAVES CHANGING MEDIA\nM. WILLIAMS\nFigure 4: μ2 = μ1\nFigure 5: μ2 →inf\nFigure 6: μ2 → 0\np\nand then using the definition of velocity as v =\nT/μ (with μ di erent on both sides of the string, but T\nthe same by imposition) we find\n√\n√\n√\n2 μ1\nμ1 -\nμ2\nAT = √\n√\nA0,\nBR = √\n√\nA0.\n(40)\nμ1 +\nμ2\nμ1 +\nμ2\nThese are the final expressions relating the initial wave amplitude A0 to the reflected amplitude BR and the\ntransmitted amplitude AT . We would find identical expressions relating B0, AR and BT if we solved the\nsystem given by the right equations in Eq.(35) and Eq.(37). Most often, we define the coeycients of Eq.(40)\nas reflection and transmission coeycients\n√\n√\n√\n2 μ1\nμ1 -\nμ2\nT = √\n√\n,\nR = √\n√\n(41)\nμ1 +\nμ2\nμ1 +\nμ2\nBecause these coeycients are real, they apply equally well when defining the relationships between the\ninitial, reflected, or transmitted amplitude for the real traveling waves of the form Eq.(8). What properties do\nthese equations lend to real traveling waves? We can best understand this through limiting cases concerning\nhow the mass density of the string changes across the origin.\n- μ2 = μ1 (Uniform String): If we have a uniform string across the origin, then we expect no wave to\nbe reflected back and that all of the initial wave is transmitted from the left to the right. With Eq.(40)\nwe find exactly this, for with μ1 = μ2, Eq.(41) gives us T = 1 and R = 0, indicating no wave is reflected\nand the transmission amplitude matches the initial amplitude. (Fig. 4)\n- μ2 →inf (Infinitely heavy on right): If we have an infinitely heavy string on the right, then this is\ntantamount to having the string fixed at x = 0. Eq.(41) then tells us that no wave is transmitted and\nthe wave which is reflected has negative the amplitude of the initial wave. (Fig. 5)\nMore generally, we see that whenever μ2 > μ1, the amplitude of the reflected wave BR always has a\nnegative sign relative to the incident wave A0. This means that if A0 is positive, BR would be negative\nand vice versa; Summarily, whenever μ2 > μ1 the incident wave experiences a phase change of π upon\niπ\nreflection (because e\n= -1). Moreover, for μ2 > μ1, we |R| > |T | meaning that when transitioning\nto a denser string, the amplitude of the reflected wave is greater than the amplitude of the transmitted\nwave. This makes sense seeing as it would be harder for a wave to propagate through a heavier string.\n- μ2 → 0 (Infinitely light on right): If we have an infinitely light string on the right, then this is tan\ntamount to having no string after x = 0. Eq.(41) tells us the transmitted amplitude is twice that of\nthe initial amplitude, but this is fictitious because if μ2 = 0 then there is no string through which this\namplitude can propagate. Thus all of the (real) wave returns to its source and we have R = 1. (Fig. 6)\n\n3 WAVES CHANGING MEDIA\nM. WILLIAMS\nMore generally, for μ2 < μ1, we find |R| < |T | indicating that when transitioning to a less dense string,\nthe amplitude of the transmitted wave is greater than the amplitude of the reflected wave. This makes\nsense seeing as it would be easier for a wave to propagate through a lighter string.\n3.4 Wave Attenuation\nIn our derivation of the wave equation, we analyzed the properties of coupled oscillators under the assump\ntion that each oscillator experienced the energy-conserving spring force definitive of Hooke's law. This was\nalso our basic assumption when we analyzed simple harmonic motion, but to bring our models closer to\nreality, we later incorporated the e ects of air drag given the knowledge that mechanical energy is rarely\nconserved in actual systems. Similarly, to describe real waves we would need to incorporate such energy-\ndissipating e ects into our derivation of the wave equation.\nFor the case of coupled masses oscillating in the transverse direction (i.e., a direction perpendicular to\nthe axis which defined their couplings), our previous equation of motion for the mass in the jth position\nwas\nmy j = k(yj+1 - yj ) - k(yj - yj-1).\n[Energy-conserving system].\n(42)\nIf we were to incorporate air-drag into this equation, we would need to include the velocity dependent drag\nforce -by j . Doing so, gives us the equation of motion\nmy j = -by j + k(yj+1 - yj ) - k(yj - yj-1).\n(43)\nMirroring our previous derivation of the wave equation, we can take our lattice spacing a to 0 and define\nmacroscopic quantities like the linear mass density μ = lima→0 m/a and the average string tension T =\nlima→0 ka. We would also have to define a drag coeycient for the string itself as\nβ ≡ lim b .\n(44)\na→0 a\nThe resulting wave equation would be\n∂2y\n∂y\n∂2y\n+ 2λ\n= v\n,\n(45)\n∂t2\n∂t\n∂x2\np\nwhere v =\nT/μ and 2λ = β/μ. To solve this wave equation, we can use the fact that the di erential\nequation is \"linear and homogeneous with constant coeycients\" to apply methods similar to those used to\nsolve the other equations of motion with similar properties. First we rewrite this equation in terms of the\ncomplex variable z(x, t) (where y(x, t) = Re[z(x, t)]).\n∂2z\n∂z\n2 ∂2z\n+ 2λ\n= v\n,\n(46)\n∂t2\n∂t\n∂x2\nGiven its properties, we can assume that the solution to this equation is an exponential (representing a wave\ntraveling to the right) of the form\nz(x, t) = Aei(kx-ωt),\n(47)\nwhere the relationship between k and ω has yet to be determined. Inserting this solution into Eq.(46), we\nfind\n- ω2 - i2λω = -v 2k2 ,\n(48)\nwhich is the desired relationship between k and ω. Given Eq.(48), there can be various types of dissipative\nbehaviors in our system and these behaviors are determined by our system's boundary conditions.\nAs a specific example, we follow the case outlined at the end of http://www.people.fas.harvard.edu/ dj\nmorin/waves/transverse.pdf. Imagine that at x = 0, the string is oscillating with a wave amplitude Ae-iωt\nwhich persists for all time. Since there is no decay in the amplitude we know ω must be exclusively real and\n\n4 SOUND WAVES\nM. WILLIAMS\nFigure 7:\nWave amplitude decreasing after entering a dissipative medium.\nFigure from\nhttp://www.phy.pmf.unizg.hr/ mpozek/research.html Courtesy of Miroslav Pozek. Used with permission.\nthus Eq.(48) must define a wave number k which is complex. Solving for this wave number we find\nr ω 2\nk =\n-2iλ ≡ k0 + iK,\n(49)\nv\nwhere we used the fact that\n√\na + ib is a complex number to replace it with a real part k0 and an imaginary\npart K6. We thus find that Eq.(47) becomes\ni(k0x-ωt)\nz(x, t) = Ae-Kx e\n.\n(50)\nThis is a single solution, the other solution could be found through a similar procedure by beginning with\ny(x, t) = Be-i(kx-ωt). We would then find the general solution is\ni(k0x-ωt)\n-i(k0 -ωt)\nz(x, t) = Ae-Kx e\n+ Be-Kx e\n.\n(51)\nComputing the real part of this quantity gives us the physical solution for this situation:\ny(x, t) = Re[z(x, t)] = A0e -Kx cos(k0x - ωt - φ),\n(52)\nwhere A0 and φ are phases set by the initial conditions of this system. Given what we know about how\nexponentials change the amplitude of waves, we should easily be able to visualize Eq.(52). It would consist\nof a wave decaying exponentially as a function of distance from the origin (See Fig. 7).\nCompared to our previous traveling wave solutions, Eq.(52) better represents how real waves propagate\nbecause such waves are usually moving through media which dissipate the wave's initial energy.\n4 Sound Waves\nWe have so far been discussing the properties of waves rather generally using the waves on a string as an\nexample. What about the descriptions of the sound and light waves which served as the introduction to this\nchapter? In this final section, we will briefly discuss sound waves, leaving light (or electromagnetic waves)\nto the next lesson.\nSound waves (like waves on a string and unlike electromagnetic waves) comprise propagation of a dis\nturbance through a medium. For sound waves the medium consists of a gas, liquid, or a solid, and the\ndisturbances are longitudinal oscillations (i.e., oscillations along the direction of wave propagation) in the\npositions of the molecules which define the medium. We present the wave equation for sound waves, with\n√\n6To solve for it explicitly we could use the identity\na + ib = ρ(cosh η + i sinh η) where ρ2 = a and 2η = sinh-1(b/2a2).\n\nREFERENCES\nM. WILLIAMS\nout derivation to highlight its similarity to the wave equations we've studied so far (derivations can be found\nin most of the references on the website). We will only consider (again for simplicity) sound waves propa\ngating in a single direction.\nSay we have a region of space consisting of a gas of molecules of mass density ρ. If the total pressure\nin that region of space is Ptot, we can separate Ptot into a base pressure P0 and a pressure fluctuation p, the\nlatter of which leads to what we experience as a sound wave:\nPtot = P0 + p.\n(53)\nThen considering the properties of the longitudinal oscillation and some results from thermal physics, we\nfind that the wave equation for p is\n∂2p\nγP0 ∂2p\n=\n,\n(54)\n∂t2\nρ ∂x2\nwhere γ is a quantity which depends on the atomic composition of a molecule of the gas; for diatomic gases\n(like N2 and O2 which constitute much of air), γ = 7/5. Given our previous wave equation, we can infer\nthat the speed of the wave propagation for pressure waves is\ns\nc =\nγP0 .\n(55)\nρ\nGiven that, for air, γ ≈ 7/5, ρ = 1.275 kg/cm3, and P0 = 1 atm, we find that the numerical value of the\nspeed of the pressure wave is\nc ≈ 330 m/s,\n(56)\nwhich is indeed the speed of sound.\nReferences\n[1] H. Georgi and A. P. French, \"The physics of waves,\" 1993.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\nResource: Introduction to Oscillations and Waves\nMobolaji Williams\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}