{
  "course_name": "Introduction to Aerospace Engineering and Design",
  "course_description": "The fundamental concepts, and approaches of aerospace engineering, are highlighted through lectures on aeronautics, astronautics, and design. Active learning aerospace modules make use of information technology. Student teams are immersed in a hands-on, lighter-than-air (LTA) vehicle design project, where they design, build, and fly radio-controlled LTA vehicles. The connections between theory and practice are realized in the design exercises. Required design reviews precede the LTA race competition. The performance, weight, and principal characteristics of the LTA vehicles are estimated and illustrated using physics, mathematics, and chemistry known to freshmen, the emphasis being on the application of this knowledge to aerospace engineering and design rather than on exposure to new science and mathematics.",
  "topics": [
    "Engineering",
    "Aerospace Engineering",
    "Engineering",
    "Aerospace Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\n8.01 and 18.01\n\nCourse Requirements\n\nTextbook\n\nDava Newman.\nInteractive Aerospace Engineering and Design.\nMcGraw-Hill, 2002.\n\nClass Participation\n\nYour questions and comments are extremely valuable. Since the lecture material is available ahead of time from the textbook and on the Web, there will be more time in lecture to discuss (in seminar style) the material rather than spending the entire 90 minutes copying the lecture notes from a blackboard. Discussions during class time are highly encouraged to fill gaps in the lecture material, to guide the pace of the class, and for you to enquire about the meaning, relevance, and importance of lecture material.\n\nPortfolio\n\nStudents are required to compile a portfolio containing notes, brainstorming ideas, concepts, sketches and final designs. This comprehensive notebook, or Personal Design Portfolio (PDP), is due toward the end of the term (See syllabus). A recommended template is provided for developing your PDP (See CD-ROM). The intent is to promote good note taking habits as an aid to understanding the material, to put your creativity down on paper and the computer, to help me assess what you are picking up in the lectures, and to grade your individual contributions to your design teams. In sum, the PDP presents a concise snapshot of what you learn throughout the entire semester and emphasizes your individual contributions.\n\nProblem Sets\n\nAll assignments are given on the syllabus homepage. Homework assignments include traditional problems, thought problems, design problems and Web-based presentations (Preliminary Design Review (PDR), and Critical Design Review (CDR).\n\nLighter-than-Air (LTA) Vehicle Design Project\n\nTeams of 5-6 students each would design, build, and race a remote controlled, lighter-than-air vehicle. The teams compete in their ability to carry the largest payload around a specified course in the minimum amount of time. The designs are judged on their equivalent mass/time. LTA vehicles are also judged in the categories of most reliable and most aesthetic designs. All designs are constrained to have a gross mass of less than 1.75 kg. A project kit is provided consisting of radio control equipment, batteries, balloons, electric motors, and construction materials.\n\nGrading\n\nPerformance will be evaluated on the basis of class participation, reading summaries, problem sets, personal design portfolio submissions, and the LTA vehicle design project. There will be no tests or final exam. The final grade for the course will be calculated approximately as follows:\n\nProblem Sets and Reading Summaries 30%\n\nStudent Personal Design Portfolio 15%\n\nLTA Design Project 45% (including PDR, CDR, Trials and Race)\n\nAttendance, Participation, General Evaluation 10%\n\nProblem Set Solutions\n\nSolutions will be posted one week after problem sets are due.\n\nHandouts\n\nThere will be occasional handouts in lectures. It is expected that regular attendance in lecture will offer the opportunity to pick up these handouts.\n\nA Note on Submission of Work\n\nThe manner in which you present your work can be just as important (and in some cases more so) than the final answer. Be sure to delineate each step along the way. Show a clear and logical approach to your solution. That makes your problem sets a better reference to you and easier for us to give you partial credit (if so deserving).",
  "files": [
    {
      "category": "Resource",
      "title": "Aircraft Performance Flight Simulation Lab",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/07c93f87e9b064896209c702e48d8468_PS3_2003.pdf",
      "content": "16.00 Introduction to Aerospace and Design\nProblem Set #3\nAIRCRAFT PERFORMANCE FLIGHT SIMULATION LAB\nNote: You may work with one partner while actually flying the flight simulator and collecting\ndata. Your write-up must be done individually. You can do this problem set at home or using one\nof the simulator computers. There are only a few simulator computers in the lab area, so not leave\nthis problem to the last minute. To save time, please read through this handout completely before\ncoming to the lab to fly the simulator.\nObjectives\nAt the end of this problem set, you should be able to:\n- Take off and fly basic maneuvers using the flight simulator, and describe the relationships\nbetween the control yoke and the control surface movements on the aircraft.\n- Describe pitch - airspeed - vertical speed relationships in gliding performance.\n- Explain the difference between indicated and true airspeed.\n- Record and plot airspeed and vertical speed data from steady-state flight conditions.\n- Derive lift and drag coefficients based on empirical aircraft performance data.\nDiscussion\nIn this lab exercise, you will use Microsoft Flight Simulator 2000/2002 to become more familiar\nwith aircraft control and performance. Also, you will use the flight simulator to collect aircraft\nperformance data just as it is done for a real aircraft. From your data you will be able to deduce\nperformance parameters such as the parasite drag coefficient and L/D ratio.\nAircraft performance depends on the interplay of several variables: airspeed, power setting from\nthe engine, pitch angle, vertical speed, angle of attack, and flight path angle. Roughly speaking,\nthe elevator control on an aircraft controls the angle of attack of the aircraft. The resulting pitch\nangle, airspeed, and vertical speed then depend on the power setting from the engine.\n1. Introduction and Use of the Flight Simulator\nSpend time using Microsoft Flight Simulator 2000/2002 to learn to take off and fly an aircraft.\nWe suggest that you use a simple single engine aircraft model (i.e., Cessna 182) since they are\nsimpler and more stable than some of the other aircraft. Use the on-line tutorial as needed to\nhelp you learn what the basic controls and instruments are, and how to operate the aircraft in a\nstable way. At a minimum, you should be able to start the simulation, and control power, pitch,\nand roll angle to take off, fly on a straight heading, make shallow turns, climb, descend, and fly\nat a level altitude.\n1 of 5\n\nIn addition to the on-line help in the flight simulator, we in the A/A department have set up a\nweb page to help you get introduced to the flight simulator:\nhttp://web.mit.edu/aeroastro/flightsimlab/Introduction.htm\n2. Airspeed and Vertical Speed Performance in a Steady Glide\nWe will focus on collecting performance data from an aircraft in a steady glide. We will use a\nSchweizer 2-32 glider rather than a powered aircraft, which simplifies some of the calculations.\nYou will put the glider into a series of steady flight conditions and record speed and vertical\nspeed (descent rate). Using these data, you will build a plot that describes how these parameters\nare related, and then you will be able to compute some of the critical aerodynamic performance\nparameters, such as parasite drag coefficient and L/D ratio. These data would be very important\nto a prospective buyer, for example. The methods you will use are similar to what might be done\nwhen evaluating an actual aircraft.\nFirst, you can measure some of the characteristics of the Schweizer 2-32 sailplane before you\ntake off:\nWeight (W):\n850 lb\nWing span (b):\n57 ft\nMean wing chord (c): 3.15 ft\nAspect Ratio (AR):\n18.05\nWing area (S):\n180 ft2\n(a) Set up the flight simulator for a Schweizer 2-32 sailplane. Go to your favorite airport to fly.\nThe simulator will start on the ground, so we'll need to simulate a tow to altitude using the slew\nfeature. Press 'y' to enter slew mode, and then the F4 key to gain altitude rapidly. F3 will gain\naltitude at a slower rate, and F2 will hold the altitude. F1 decreases altitude. Using the slew\nfeature, climb to 10,000 ft.\n(b) Press 'y' again to enter normal flying mode. Keep the glider flying straight and pitch the\nnose to hold a steady attitude. If you hold that attitude by moving the control yoke as necessary,\nthe aircraft will eventually reach an equilibrium airspeed and descent rate. You can also make\nfine adjustments to the elevator position by using the trim button on the yoke, or the 1 and 7 keys\non the number pad of the keyboard if you don't have a yoke. Note that this aircraft's instruments\nshow airspeed in miles per hour, and vertical speed is given in feet per minute. The airspeed\nreadout is called indicated airspeed.\n(c) Once the aircraft is stabilized, re-renter slew mode and climb back up to a little more than\n10,000 ft. Restart normal flight, and continue to hold the steady attitude until you descend at\nleast to 9,500 ft.\n(d) After passing through 9,500 ft, start the Flight Analysis Tool (from the Options menu - if the\nmenu bar is not showing, press the <Alt> key). In the Flight Analysis tool, you can get a readout\nof the aircraft's speed (NOTE: in knots), the current altitude (in feet), and the current time\n(hours:minutes:seconds). Record the speed, altitude, and time on a sheet of paper. Using the\nslider bar at the bottom of the Flight Analysis window, back-up time until it is at the point where\nthe aircraft was back at approximately 10,000 ft. Record the exact altitude and time. From the\ndata at these two times, you can compute the vertical speed more accurately than you can by\n2 of 5\n\nviewing the cockpit instruments while trying to hold the nose steady. Compute and record the\nvertical speed for the given airspeed you flew by taking the change in altitude over the change in\ntime.\n(e) Repeat steps (b) - (d) to generate data for at least five different airspeeds. Try to take data\ndown to approximately 50 MPH (or 43 knots) and up to approximately 140 MPH (120 knots).\nTo hold the low speeds, the nose will be pitched up enough that you cannot see the horizon from\nthe forward view. In this case, you may find it easier to use the yoke to hold a constant airspeed\nrather than a constant pitch attitude. Pull back to slow down, push forward to speed up (this only\nworks if the aircraft is not stalled). You may also find it easier to use number pad 1 and 7 to\nslowly set the elevator position in small increments. At low speeds close to stall, the dynamic\nmodel is not very accurate and the glider may begin oscillating with increasing magnitude in\npitch. Try to maintain constant pitch or increase your airspeed slightly by pitching down to\navoid operating right at stall. The more data points you collect, and the more accurately you\ncollect them, the better your solution will be in the next steps. It is important to collect the data\nat similar altitudes, however, so be sure to re-slew each time back to 10,000 ft.\nAirspeed measurement\nWe need to be careful now in how we treat airspeed measurements. The airspeed indicator (and\nthe Flight Analysis tool) show what is termed indicated airspeed. Indicated airspeed is measured\nfrom a pitot tube that computes the difference between the stagnation pressure (P0) that is\nmeasured at the tip of the pitot probe, and the static pressure (P) that is measured on the side of\nthe pitot probe [see Eqn. 3.16, p. 44 in Interactive Aerospace and Design]. From Bernoulli's\nequation, the airspeed can then be computed:\nAlthough the airspeed indicator can measure the pressure terms in the above equation, it cannot\nmeasure the air density. So, the airspeed indicator in the cockpit has been calibrated such that at\nstandard sea level conditions (i.e., when ρ = 1.2 kg/m3) the speed shown on the dial equals the\ntrue speed of the aircraft through the air. In a sense, you can think of the airspeed indicator as a\ndynamic pressure gauge (because dynamic pressure = P0-P) that has been calibrated to show the\nactual airspeed for that dynamic pressure if the aircraft is at sea level in standard conditions. So,\nan indicated airspeed reading of 100 MPH means that the dynamic pressure is such that were the\naircraft at sea level, it would be traveling at a true speed of 100 MPH through the air.\nAt high altitudes, however, a given indicated airspeed based on the pressure difference (P0-P)\nactually means that the aircraft is moving more quickly through the air because the air density is\nless than at sea level. At 10,000 ft, air density is about 0.75 its value at sea level. So, an aircraft\nat 10,000 ft with an indicated airspeed of 100 MPH means that its dynamic pressure is the same\nas it would be if it were at sea level going 100 MPH. Equating these two values of dynamic\npressure:\n2 ρ SL v SL = 2 ρ10000v10000\n3 of 5\n\nwhere vSL is the true airspeed at sea level, v10000\nor\nis the true airspeed at 10,000 ft, etc.\nρ SL\nv10000 =\nv SL\nρ10000\nor,\nv10000 = 1.154vSL\nSo, the true airspeed of an aircraft at 10,000 ft is approximately 15% larger than its indicated\nairspeed. An indicated airspeed of 100 MPH then is actually a true airspeed of 115 MPH.\nAgain, this is because the air is less dense so the aircraft must actually move at a higher velocity\nto generate the same dynamic pressure. All of the aerodynamic coefficients are defined with\nrespect to true airspeed, so we need to convert the indicated airspeeds to true airspeeds.\n(f) Using the above relation for true airspeed at 10,000 ft and the attached sheet on longitudinal-\nplane dynamics, construct a table that contains the following information for each flight\ncondition (watch your units!):\nindicated airspeed (ft/s)\ntrue airspeed (ft/s)\nvertical speed (ft/s)\nflight path angle (deg)\nLift force (lb)\nL/D Ratio\nCL\nCD\n(g) Plot vertical speed vs. true airspeed. What speed should this glider fly at to maximize its time\naloft? (Hint: maximum time aloft for a glider occurs at the minimum descent rate)\n(h) Plot L/D ratio vs. true airspeed. What speed should this glider fly at to maximize its gliding\nrange?\n(i) Plot CD vs. CL. From your plot, estimate CD0 and the wing efficiency factor e.\n(j) From aircraft performance theory, the maximum L/D ratio and the speed at which the best\nL/D ratio occurs are:\nand\ncompare the maximum L/D and speed for best L/D you found in part (h) against the theoretical\npredictions from the above two equations.\n4 of 5\n\nAircraft Longitudinal-Plane Dynamics\nReplace Figure 4.3 in the book with this figure and the following definitions.\nT,\nγ\nα\nθ\nγ\nmg\nD\nL\nh ·\nv\nDefinitions\nPitch angle (θ): angle from horizon to aircraft x-body axis (line passing through the plane's nose)\nFlight path angle (γ): angle from the horizon to the aircraft's velocity vector\nAngle of attack (α): angle from the aircraft's x-body axis to the velocity vector\nTrue airspeed (v)\nLift (L): defined perpendicular to the velocity vector\nDrag (D): defined parallel and opposite to the velocity vector\nThrust (T): defined along the velocity vector (simplification) [though in our case, T = 0 anyway]\nWeight (W): directed downwards\nh&\nVertical speed ( h& ): h& = v sin(γ ) , so γ = sin -1\n\nForce Balance in Steady Flight\nForces perpendicular to the flight path:\nForces tangential to the flight path:\nIn a glide, T = 0, and\nOther information\n1 knot (kt) = 1 nautical mile per hour\n1 MPH = 1 statute mile per hour\n1 nautical mile = 6080 ft\n1 statute mile = 5280 ft\nAir density at\n0 ft:\n0.00237 slug/ft3\n9,500 ft:\n0.00178 slug/ft3\n10,000 ft:\n0.00175 slug/ft3\nv\nL = W cos(γ)\nT = D + W sin(γ)\nL/D = cot(γ)\n5 of 5"
    },
    {
      "category": "Resource",
      "title": "Aircraft Performance Flight Simulation Lab Solution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/df11b6a94110322b4ba0b5e5862cd440_PS3sol.pdf",
      "content": "16.00 Introduction to Aerospace and Design\nProblem Set #3\nAIRCRAFT PERFORMANCE FLIGHT SIMULATION LAB\nSolution\nI collected flight data at 10 different conditions, and also flew from 10,000 ft to 9,000 ft to get\nmore time to fly stably and more accurately measure vertical speed.\nData are shown in the table below.\nIndicated airspeed computed directly from the airspeed indicator and converted to ft/s\nTrue airspeed = 1.154 x (indicated airspeed) as per Problem Set #3 handout\nVertical speed computed from the Flight Analysis tool, converted to ft/s\nh&\nFlight path angle computed from γ = sin -1\nv\nLift computed from L = W cos(γ)\nL/D computed from L/D = cot(γ)\nL\nCL computed from CL =\n1 ρv 2 S\nD\nCD computed from CD = CL L\nFlight\nindicated\ntrue\nvertical\nflight path\nCondition airspeed (ft/s) airspeed (ft/s) speed (ft/s)\nangle (deg)\nLift (N)\nL/D\nCl\nCd\n72.62\n83.81\n2.31\n1.58\n849.68\n36.30\n0.76\n0.02\n79.38\n91.60\n2.45\n1.53\n849.70\n37.34\n0.63\n0.02\n87.82\n101.35\n2.78\n1.57\n849.68\n36.48\n0.52\n0.01\n96.27\n111.09\n3.19\n1.65\n849.65\n34.76\n0.43\n0.01\n103.02\n118.89\n3.73\n1.80\n849.58\n31.89\n0.38\n0.01\n113.16\n130.58\n4.61\n2.02\n849.47\n28.29\n0.31\n0.01\n131.73\n152.02\n6.54\n2.47\n849.21\n23.21\n0.23\n0.01\n148.62\n171.51\n9.35\n3.12\n848.74\n18.32\n0.18\n0.01\n172.27\n198.80\n14.17\n4.09\n847.84\n14.00\n0.13\n0.01\n209.42\n241.67\n25.24\n6.00\n845.35\n9.52\n0.09\n0.01\n1 of 3\n\nTrue airspeed (ft/s)\nFrom the data above, the aircraft should fly at approximately 84 ft/s true airspeed (or 43 kt\nindicated) to maximize time aloft (minimum sink rate).\nTrue airspeed (ft/s)\nThe maximum L/D occurs at a true airspeed of 92 ft/s (47 kt indicated).\nL/D\nvertical speed (ft/s)\n2 of 3\n\n0.025\n0.02\n0.015\nCd\n0.01\n0.005\n0.2\n0.4\n0.6\n0.8\nCL\nThe plot above shows the data from the flight test, along with a parabolic curve fit with\n= 0.009 and efficiency e = 0.88.\nCD0\nTheory predicts\n= 37.2,\nObserved maximum L/D = 37.3\nTheory predicts\n= 88.9 ft/s,\nObserved vmax L/D = 92 ft/s\nErrors between theory and observation are due to:\n- inaccurate dynamic model in the flight simulator, especially close to stall\n- inaccurate data recording or non-steady flight during the flight test\n- inaccuracies in the curve fit in the CD vs. CL drag polar to predict CD0 and e.\n3 of 3"
    },
    {
      "category": "Assignment",
      "title": "Problem Set #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/18de3af160e63fdcbb0c1eb34194e0c4_HW1_03.pdf",
      "content": "Homework for 16.00\nIntroduction to Aerospace Engineering and Design\nProblem Set #1\n.\nProblems 1 and 2. Answer any two questions from Problems 1.1, 1.2, 1.3, or 1.4 with a one\nparagraph or less answer. (10 points each)\n1.1 In a few sentences describe the Montgolfiers' contribution to flight.\n1.2 In a few sentences discuss the advent of dirigibles and the responsible inventors. Speculate on\nwhy we don't see blimps that carry hundreds of people flying today?\n1.3 What was the critical aerodynamic contribution that the Wright Brothers implemented in order\nto achieve the first heavier-than-air flight?\n1.4 List two women pioneers of aviation and their accomplishments.\nProblem 2.4 (16 points) From the employer's desired attributes checklist, select and explain two\ncategories for which you feel your education will best prepare you. Also select and explain two\ncategories for which you feel your education will least prepare you and which might require some\nself-study.\nProblem 2.6 (14 points) Select your favorite aerospace-related cartoon and turn it in with this\nproblem. In a few sentences, describe any technological validity of the cartoon and/or any techni-\ncal misconceptions. Describe the social implications for the aerospace field as well as aerospace\nengineers briefly.\n\nProblem 12.1 (50 points, 10 points possible extra credit) Arthur Ganson's designs\nWe read objects in motion on both the objective and subjective levels. A machine may be about\nfabric or grease, but it may also be about thick liquid and sensuous movement. A bit deeper, it may\nbe about meditation or the sense of release. And taken yet another step, it may be about pure\ninvention and the joyfulness in the heart of its creator. (Arthur Ganson).\nSculptor/inventor Arthur Ganson's whimsical mechanical sculptures can be seen in person at the\nMIT museum and embody the qualities least associated with machines. Self-described as \"a cross\nbetween an engineer and a choreographer\", Ganson creates contraptions composed of a range of\nmaterials from delicate wire to welded steel and concrete. Most are viewer-activated or driven by\nelectric motors. All are driven by a wary sense of humor or a probing philosophical concept.\n\"When making a sculpture,\" Ganson says, \"it's always a challenge to say enough but not say too\nmuch, to coax with some kind of recognizable bait, then leave the viewer to draw his or her own\nconclusions and thereby find personal meaning.\"\nWatch the video of Arthur Ganson's design and sculpture (Ganson.mov) on this textbook's\naccompanying CD-ROM. In no more than two pages, critique one of Ganson's sculptural engi-\nneering designs that fascinated you. Sketches are most welcome. Provide the following in your\ncritique:\n(a) An introduction to the specific design you have chosen.\n(b) A discussion of how you think it works, mechanically or electrically.\n(c) A discussion of what you think of the aesthetics of the design.\n(d) Recommendations you have to change or enhance your chosen design.\n(e) A summary statement about how Arthur Ganson's designs will affect your own engineering\ndesigns.\nExtra Credit: Walk to the MIT Museum and view Ganson's sculptures in person and answer the\nabove questions for a design that is at the museum, but not included in the Ganson.mov file."
    },
    {
      "category": "Assignment",
      "title": "Problem Set #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/af7faabbeb4e07ce2cb9a0412330b528_HW2_03.pdf",
      "content": "Homework for 16.00\nIntroduction to Aerospace Engineering and Design\nProblem Set #2\n.\n1. (20 points) Problem 3.1 Compare and contrast the aerodynamic design of the Voyager to the Boeing\n747. Explain the advantages and disadvantages of each design.\n2. (20 points) Consider the wind tunnel shown below (approximate size: 20m x 6 m) with air\nentering from the left at 1 m/s at a static pressure of 1.013x105 Pa. Make plots of air velocity vs.\nx, static pressure vs. x, dynamic pressure vs. x, and total pressure vs. x. The wind tunnel has a\nrectangular cross section, and is 1m deep (into the page).\nv = 1 m/s\n20m\n10m\np = 1.013x105 N/m\n0m\nx\n0m\n1m\n2m\n3m\n4m\n5m\n6m\n3. (20 points) Aerodynamically, would it be easier to make a model glider fly on Earth or on\nMars?\n4. (40 points) Problem 3.11 Paper Airplane Design using FoilSim\nDesign and build a paper airplane that has the longest time aloft and travels the greatest distance.\n(a) Use unlined paper for your construction. Determine the wing area by breaking areas of the\nwings down into triangles and rectangles. Measure and calculate.\n(b) Using the same launch angle and velocity, fly your airplane through five trials. Measure the wing\nsurface area, distance traveled, and angle of inclination for the wings in each trial. Make a data\n\ntable and record your results. Repeat the trial flights for time aloft. Again, record the wing sur\nface area, time aloft, and angle of inclination for the wings in each trial. Graph the area/time or\narea/distance data for each set of trials. The trial flights must be completed indoors to eliminate\nwind effects. Write a summary of your results.\n(c) Cut one inch off the trailing edge of the wings. Place the cut off pieces within the folds of the air-\nplane so the mass remains constant. Repeat the trial flights, data collection, graphing, and writ-\nten summary as above.\n(d) Bring your paper airplanes to class for an in-class 'fly-off' competition."
    },
    {
      "category": "Resource",
      "title": "Beginning-of-term Questionnaire Spring 2003",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/cff49f64fbd9b1bba30ad565f53a3cbc_Questionnaire_2003.pdf",
      "content": "16.00 Introduction to Aerospace Engineering & Design\nBEGINNING-OF-TERM\nQUESTIONNAIRE SPRING 2003\nName:\nGender: 0 = Female, 1 = Male\nDeclared / Expected Major:\nClass Year: 1 = Freshman, 2 = Sophomore, 3 = Junior, 4 = Senior\nHow would you rate your skill in or comfort level with the following activities?\n(Rate on a scale of 1 to 5 where 1=not comfortable and 5=very comfortable)\n1. I am comfortable working on technical problems with no clear answer.\nN/A\n2. I am concise and methodical in setting up and solving technical problems.\nN/A\n3. I love to build things.\nN/A\n4. If I would been given a box of mechanical thing and told to build\na pump or such, I have a strong grasp of how I would set up\nthe problem to design & build it.\nN/A\n5. I am good at seeing how abstract technical concepts can be used\nto design things.\nN/A\n6. I am good at grasping abstract technical concepts without concrete examples.\nN/A\nPage 1 of 2\n\n7. I would consider myself a creative thinker.\nN/A\n8. I would consider myself an effective team member.\nN/A\n9. I would consider myself a capable team leader.\nN/A\n10. I am comfortable with different computer platforms.\nN/A\n11. I often use the Web to find information and I am comfortable with its use.\nN/A\n12. I have taken one or more classes in which all subject material was on the Web.\nN/A\n13. I would be just as comfortable taking subjects in which all subject material\nwas to be found on the Web.\nN/A\n14. Please indicate how many classes you have taken so far where all the subject material was on the Web.\n15. If my team was having problems working together, I would ignore it and see it the team could work despite\nthe problem.\nYes\nNo\n16. If my team was having problems working together, I would discuss it with other team members.\nYes\nNo\n17. If my team was having problems working together, I would discuss it with the instructor.\nYes\nNo\nPage 2 of 2"
    },
    {
      "category": "Resource",
      "title": "Delta Design Game",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/1df35514eb381e717f9e1cf25036d55e_intro.pdf",
      "content": "Delta Design Game\n(c) Prof. Larry Bucciarelli\nIntroduction\nDelta Design is a team exercise developed at M.I.T. by Prof. Louis Bucciarelli for\nengineering education at any level - undergraduate, graduate, or professional. Players are\nassigned one of four roles and form teams to design a new residence suitable for\ninhabitants of the imaginary Deltoid plane. The design is assembled on a game board by\nplacing triangular red- and blue- colored tiles on a diamond-shaped grid. Each role has its\nown requirements for the number and placement of tiles, so that the team must make\ntradeoffs in order to achieve individual and group performance goals within the three or\nfour hours required for learning and playing the game. A brief description of the game\nand the four roles is presented below.\nLife on DeltaP\nLife on DeltaP, residential and otherwise, is quite different from what you have grown\naccustomed to here on Earth. First off, DeltaP is a place, not a planet, so your team will\nbe designing in two-dimensional rather than three-dimensional space. If your design\n\"meets spec\" and is considered attractive and functional by your Deltan clients, one view\non a single sheet of paper will convey to those responsible for constructing it all the\ninformation they need to do so.\nThe view on this single sheet may not be quite what you expect, however, because in\naddition to lacking a z-axis, Deltoid space has unfamiliar relations between the x- and y-\naxes as well. What we think of as \"perpendicular\" is hopelessly skewed to a Deltan, and\nvice versa. In our units, a right angle on DeltaP measures 60 degrees or pi/3 radians. Thus\nall sides of an equilateral triangle form lines considered perpendicular to all others. If\nthere were such a thing as a \"circle\" on DeltaP, it would be composed of only 4*pi/3\nradians.\nBut there is no such thing as a \"circle\" on DeltaP, nor even the concept of continuity\nembodied therein. In this flat though angular world, residents construct their artifacts\nstrictly with discrete triangular forms. Of these, the equilateral triangle -- with its three\nperpendicular sides (!) -- is considered the most pleasing. Accordingly, your team will\ndesign the residence by assembling into a cluster the most prized building materials on\nDeltaP, equilateral components called \"deltas.\" Deltas come in red and blue versions and\nalways measure 2 lyns per side. Four \"quarter-deltas,\" QDs, triangular units of area\nmeasure with sides of 1 lyn, fit within a delta.\n\nLyns? QDs? Believe it or not, the Deltan unit of currency is the Zwig, represented by the!\nsymbol. Not surprisingly, Deltan systems of measurement are as unfamiliar as that for\nspatial coordinates. All of DeltaP's units of measure share the divisibility and\nextensibility conventions of the metric system; in the measure of time, for example, there\nare both microwex and megawex. In relation to the attention- and life-spans of Deltans,\nthese units are roughly equivalent to seconds and years, respectively, here on Earth.\nAs building components, deltas have functional and aesthetic characteristics that are more\ncomplex than their simple form and even dimensions would suggest. Especially when\nassembled into a cluster, as you will be doing, they behave in interesting ways. Deltas\nconduct hear among themselves, radiate heat to outer space, melt if too hot, and grow if\ntoo cool. Red deltas produce heat. All deltas are subject to DeltaP's two-dimensional\ngravity (which is itself subject to axial shifts during DeltaP's not-infrequent gravity\nwaves). Three different kinds of cement are needed to join them together, and joint\nalignment with respect to gravity affects ease of production as well as structural integrity.\nDifferent colors and different quantities of deltas cost different amounts of money per\ndelta, and can be assembled in clusters that are either exceedingly ugly or very attractive\nto the Deltans. Your task will be to create a design that meets prescribed goals for all\nthese characteristics.\nDesign Team Roles and Responsibilities\nYour design team is organized such that each of you will be responsible for a subset of\nthe design goals. Specific instructions for each role will be handed out prior to the game.\nOne of you will be Project Manager. Your main concerns will be with cost and\nschedule, the interpretation and reconciliation of performance specifications, and\nnegotiations with the contractor and client. You want to keep costs and time-to-build at a\nminimum, but not at the expense of quality. When your team submits its final design, the\nproject manager must report the estimated cost (in zwigs) and the time (in wex) that it\nwill take to build.\nAnother of you will be the Structural Engineer. Your main concern will be to see that\nthe design \"holds together\" as a physical structure under prescribed loading conditions.\nYou must see to it that the two points at which your structure is tied to ground are\nappropriately chosen and that continuity of the structure is maintained. When your team\nsubmits its final design, the structural engineer must attest to its integrity by identifying\nthe strongest and weakest joints, and estimating the average load on all of the joints\nexpressed as a percentage of the failure load.\nAnother of you will be the Thermal Engineer. You will want to insure that the design\nmeets the \"comfort-zone\" conditions specified in terms of an average temperature. You\nmust also ensure that the temperature of all individual deltas stays within certain bounds.\nWhen your team submits its final design, the thermal engineer must estimate internal\ntemperature and identify the hottest and coldest deltas.\n\nFinally, one of you will be the Architect. Your concern is with both the form of the\ndesign in and of itself and how it stands in its setting. You must see to it that the interior\nof the residence takes an appropriate form and that the progress is convenient. You\nshould also develop a design with character. When your team submits its final design, the\narchitect should be prepared to present a sketch and discuss generally how and why the\nDeltans will find the residence attractive and functional. The architect will also be asked\nto estimate a few more quantitative measures of architectural performance.\nThe Design Task\nYour Deltan clients have cleared the space shown on the site map and comes to your\nteam with their need for the design of a new residential cluster. The cluster itself must\nmeet the following specifications.\nThe client wants the cluster to provide a minimum interior area of 100 QDs. The shape of\nthis space, which can of course, exceed the minimum, is a matter of design. The client\nhas expressed enthusiasm for the newer mode of segmenting interior space, a mode that\nbreaks with the two-equal-zone tradition and values the suggested privacy of nooks and\ncrannies. Still the space must be connected, i.e., no interior walls can cut the space into\ncompletely separate spaces. There must be one and only one entrance/exit.\nThe client is known to be color sensitive blue; too much blue brings on the blues, so to\nspeak. No more than 60% blue ought to be allowed; certainly blue deltas are no to exceed\n70% of the cluster.\nThe residence, as all clusters, must be anchored at two points and two points only. There\nis a limit to the amount of force each anchor can support, as well as to the amount of\ninternal moment each joint can withstand. Exceeding either limit would cause\ncatastrophic failure and send the unwary residents tumbling into the void. The cluster\nshould be designed for a life of thirty megawex. Gravity waves, rare by always possible,\nshould be considered.\nThe average interior temperature must be kept within the Deltan comfort zone, which lies\nbetween 55 and 65 degrees Nin. The temperature of the elements themselves must be\nkept above the growth point of 20 and below the melt-down point of 85. Delta\ntemperatures outside of this range will result in catastrophic structural failure with little\nmore warning than excessive load.\nAll of this -- design, fabrication, and construction -- must be done under a fixed budget\nand within given time period. At your team meeting you are to develop a conceptual\ndesign that meets or exceeds all design goals. When each team submits their design,\nindividual members will be asked to report design performance on parameters for which\nthey are responsible."
    },
    {
      "category": "Resource",
      "title": "Lighter Than Air Design Competition",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/16-00-introduction-to-aerospace-engineering-and-design-spring-2003/c892ab336d895c8b8e5444d2fd2c187a_LTA2003.pdf",
      "content": "16.00 Lighter Than Air Design Competition\nSpring 2003\n\nObjective\n- As a team:\nDesign & construct a lighter-than-air (LTA) vehicle that is\n- Stable\n- Controllable\n- Reliable\n- Able to carry a payload\n- Fast\n- Aesthetically pleasing and an elegant design\n\nRace Course\nTotal race distance\n87.8 m\n28.7 m\nstart\nfinish\n15.2 m\n\nJudging Criteria\n- Payload\n- Score = payload mass / time to complete race\n- Reliability\n- Most successful course completions (trials + race day)\n- Aesthetics\n- Most creative and elegant design\n\nConstraints\n- Maximum vehicle mass = 1.75 kg\n- includes structure + payload mass (not balloon mass)\n- vehicles will be weighed on trial day and race day\n- payload must be able to be detached from structure\n- Maximum of 5 balloons\n- Use supplied materials\n- exceptions via special request\n-\nNo one can touch blimp or apply force on safety string\nduring official run\n\nStandard Materials\n- Balsa wood\n- Large, and small motor sizes\n- Propellers\n- Radio control electronics\n- Servos\n- String\n- Epoxy, glue, tape, other adhesives\n- Weather balloons (1 m diameter)\n- Helium gas\n- Details in book and on CD-ROM, additional details\navailable later\n\nSpiral Design Process\nstart\nPDR\nCDR\ntrials\nrace\nbrainstorming\ndesign selection\nprototypes\nmodifications\nfinal detailed design\nfinal build\nfixes\n\nInitial Steps\n-\nGet acquainted, set ground rules, meeting times, choose team name\n-\nIdentify the key design parameters\n- Balloon layout\n- Number of motors\n- etc.\n-\nBrainstorm and sketch concepts\n- No filtering or critiquing of designs at this point!\n-\nIdentify strengths and weaknesses\n-\nDownselect to several likely contenders\n-\nReview +/-'s in more detail and formally select final design\n\nProduct Design Matrix\nTotals\nNoise Level\nWeight\nSpeed\nD\nC\nB\nA\nImportance\nRequirement\nDesign Solutions\n\nKey Dates\nStart\n\nPreliminary Design Review (PDR)\nCompleted Design Review (CDR)\nDesign Portfolios Due\nTrials in the gym\n\nDesign Portfolios Due for Re-Grade\nRace Day in the gym\nMandatory class attendance, LTA Vehicle Awards\n\nObjectives of the\nPreliminary Design Review\n- Describe the design process to arrive at proposed vehicle layout\n- Provide justification for the selected design\n-\nPreliminary analysis of selected design's performance\n- Roadmap to arrive at finished product\n- Bottom line: Convey technical ability and confidence that you\nwill get the job done\n- e.g., to justify funding from a supporter\n\nPreliminary Design Review Elements\n- Introduction, Team name, Team members\n- Discussion and analysis of proposed designs\n- Selection of proposed design\n- Schematic of selected design\n- approximate layout, balloons, propulsion, attitude control\n- Analysis\n- He volume, mass estimates, drag & thrust estimates\n- Number and placement of motors & propellers\n- Number, size, and placement of batteries and electronics\n- Method of attitude control and maneuvering\n- Expected vehicle velocity and endurance\n- Request and justification for additional materials (if necessary)\n- Timeline for construction and testing\n\nExample Gantt Chart\n\nPresentation Logistics\n- 10 teams, 80 minutes of class = 8 minutes / team\n- 5 minutes presentation, 2 minutes Q&A, 1 minute changeover\n-\nOverhead transparency, Powerpoint, or Web-based\n- Powerpoint files must be emailed,\n- Web URLs must be finalized.\n- See book and 16.00 web site schedule for links to html templates\n-\nEach team member expected to participate in one presentation\n- PDR or CDR\n-\nStaff will use standard scoring sheets, with comments\n\nPersonal Design Portfolios\n- Compilation of all your personal effort / learning in the class throughout the\nsemester\n- Briefly discuss, explain, and synthesize what you learned in lecture\nand Problem Sets (likes and dislikes are acceptable)\n- How does your synthesis above relate to your preparation for the LTA\nvehicle project?\n- Notes, team meeting minutes, ideas, observations (dated!)\n- Sketches, brainstorming concepts, schematics, drawings\n- Analyses (aerodynamics, structures, control,...)\n- Prototype elements and tests\n- Final engineering drawings to scale\n- Photos of prototypes and the finished vehicle\n- Discussion of the entire design process and race day results\n- Portfolio must be in some form of notebook or submitted electronically\n(provide Powerpoint presentation or URL)\n-\nStart your portfolio immediately\n\nObjectives of the\nCompleted Design Review\n- Describe the detailed design of the vehicle\n- Layout and analysis\n- Major modifications since PDR\n- Present & discuss at least one built prototype component or subsystem\n- Bottom line: Convey that you can overcome any issues that remain and\nwill have a working vehicle on trial day\n\nCompleted Design Review Elements\n- Introduction, team name, team members + roles in project\n- Introduction of the final design\n- Scale drawing of final design (at least a dimensioned 3-view)\n- Control system details\n- Aerodynamic analysis\n- Other analysis (structural, construction, major concerns, etc.)\n- Timeline for construction and test\n- Conclusion\n\nTeamwork Issues\n- Effective teams do not just happen -- they take work\n- Open lines of communication are critical\n- Methods for arriving at decisions should be clear and acceptable\n- Strive for consensus\n- Everyone should have clear responsibilities\n- and follow through on them\n- Note your contributions in your Personal Design Portfolio\n\nSelf / Peer Reviews\n- There will be periodically hand out and collect self / peer review\nforms\n- Intellectual contribution (ideas, discussions, analyses)\n- Hands-on contribution (drawing, construction, testing)\n- Opportunity for you to assess your own effort relative to your peers\n- Confidential\n- Note significant team problems\n- uneven participation\n- unproductive team meetings\n- team member personality issues\n\nLTA Design Hints\n1. It is easy to make a blimp that floats\n2. It is not easy to make a blimp go where you want it to\nStability:\nAble to maintain altitude and attitude without control inputs\nControllability:\nAble to dictate direction of movement and rotation\n\nX-29: Unstable but Controllable\n(not something to emulate for LTA race)\n\nCoefficient of Drag vs. Reynolds Number for a sphere\nRe = ρ v D / μ\n\nTeam 1\nTeam 2\nTeam 3\nTeam 4\nTeam 5\nTeam 6\n\nTeam 7\nTeam 8\nTeam 9\nTeam 10"
    }
  ]
}