{
  "course_name": "Introduction to Heat Transfer",
  "course_description": "This course is an introduction to the principal concepts and methods of heat transfer. The objectives of this integrated subject are to develop the fundamental principles and laws of heat transfer and to explore the implications of these principles for system behavior; to formulate the models necessary to study, analyze and design heat transfer systems through the application of these principles; to develop the problem-solving skills essential to good engineering practice of heat transfer in real-world applications.",
  "topics": [
    "Science",
    "Physics",
    "Thermodynamics",
    "Science",
    "Physics",
    "Thermodynamics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week; 1.5 hours / session\n\nRecitations: 1 session / week; 1 hour / session\n\nNote: This is a half-semester course that takes place during the second half of the term.\n\nPrerequisites\n\n2.05 Thermodynamics\n\nDescription\n\nThis course is an introduction to the principal concepts and methods of heat transfer. The specific objectives of this integrated subject are as follows:\n\nTo develop the fundamental principles and laws of heat transfer and to explore the implications of these principles for system behavior.\n\nTo formulate the models necessary to study, analyze and design heat transfer systems through the application of these principles.\n\nTo develop the problem-solving skills essential to good engineering practice of heat transfer in real-world applications.\n\nTopics covered in the course:\n\nFourier's law\n\nConduction processes\n\nThermal resistance\n\nFins\n\nHeat equation and lumped capacitance\n\nElementary convection, including laminar and turbulent boundary layers\n\nThermal radiation, including Stefan-Boltzmann law\n\nBasic concepts of heat exchangers.\n\nStudents will have the opportunity to demonstrate a familiarity and ability to work on heat transfer. These outcomes will be demonstrated through an assessment of homework assignments, two quizzes.\n\nTextbooks\n\nRequired\n\nBergman, Theodore L., Adrienne S. Lavine, Frank P. Incropera, et al.\nIntroduction to Heat Transfer\n. Wiley, 2011. ISBN: 9780470501962. [Preview with\nGoogle Books\n]\n\nSupplementary\n\nLienhard, John H., and John H. Lienhard.\nA Heat Transfer Textbook\n. Dover Publications, 2011. ISBN: 9780486479316. [Preview with\nGoogle Books\n] A version of the textbook is\navailable online\n, for free.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework Assignments\n\n20%\n\nQuiz 1\n\n40%\n\nQuiz 2\n\n40%\n\nHomework Policy\n\nProblem sets for this course are not available on MIT OpenCourseWare. The homework policy is provided for your information.\n\nAll homework grading will be based mostly on effort. The reasons are several. First, effort is something over which you have full control, whereas numerical correctness is much harder to control. We therefore want to remove any anxiety based on thoughts such as \"Did I get the right numerical answer or not?\" Second, we hope that this will discourage you from copying the work of others. The effort-based grading scale is P / D / F, with the following meanings and numerical conversions:\n\nP (worth 2 points) Good effort: Problem essentially completed.\n\nD (worth 1 points) Minimal effort: Problem partially done.\n\nF (worth 0 point) No effort: Problem set not done, or essentially not done.\n\nEach problem (or part of longer problems) in the homework assignment will be graded according to this scale. Your problem set score will be the sum of all the grades on the individual problems (or parts of problems) in that set. Note that we define 'Good Effort' as completing all sections of a problem and employing sound physical principles. Assignments that are incomplete or demonstrate an inadequate physical understanding will not receive a 'P'. Further, if we suspect your work has been plagiarized, we reserve the right to assign an 'F' (0 points) to the entire problem set.\n\nQuiz Policy\n\nThere are two quizzes, which will each be administered on campus and will last for two hours.\n\nA scientific calculator and writing instrument will be required. Crib sheets, other written matter or pre-programmed calculators will not be allowed. We will provide an equation sheet during the quiz, and it will be available for review prior to the quiz.\n\nStudents are strongly encouraged to take the quizzes at the specified times. In case a student has a major conflict (e.g., medical emergency) the instructors will likely administer an oral make-up quiz.\n\nAcademic Honesty\n\nYou have joined a community of scholars at MIT. In joining that community, you have inherently assented to embracing the values of that community. Among those values is a commitment to honesty with yourself, your peers and your faculty. We believe that most of our students are academically honest; and as a consequence, the faculty will assume that the class is abiding by this covenant. If evidence comes to light that an individual or group of individuals are not, in addition to direct sanctions within the course structure, the case will be referred to the Committee on Discipline.\n\nYou should not underestimate how important this covenant is held by the faculty and by the Institute. In the past, there are cases where students that have breached this covenant and were referred to the Committee on Discipline ended up being required to leave MIT.\n\nA short non-exhaustive list of examples that constitute a breach of academic honesty:\n\nCarrying prohibited crib sheets or calculator programs into a quiz.\n\nSubmitting homework in whole or in part that is not generated by you. (Copied from another source.)\n\nSubmitting another student's work as your own.\n\nReferring to prohibited reference material during a quiz.\n\nPromulgate or willingly receive information on a quiz prior to its general dissemination to the class by the faculty.\n\nEngaging in any behavior to reduce the grade or performance of another student.\n\nEngaging in behavior to illegitimately obtain course materials before they are issued to the class by the faculty.\n\nFurther discussion and links on these issues can be found on the\nMechanical Engineering Department's Ethics and Integrity webpage\n.",
  "files": [
    {
      "category": "Exam",
      "title": "Quiz 1 – Review Problems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-051-introduction-to-heat-transfer-fall-2015/43c5e44c07b471d21ee32c7ffe8e2880_MIT2_051F15_Quiz1_RvwProb.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\n2.051 Introduction to Heat Transfer\n\nQuiz 1 - Review Problems\n\nProblem 1 :\n\nA composite cylindrical wall is composed of two materials of thermal conductivity kA and kB,\nand are separated by a very thin, electric resistance heater at radius r2. The resistance of the\nheater and the interfacial contact resistances between the heater and materials A and B are\nnegligible. Liquid at temperature T!,! is pumped through the tube and provides a convection\ncoefficient hi at the inner surface (radius r1) of the composite. The outer surface (radius\n! T\nT\nr3) has an\nemissivity of εA and is maintained at temperature Ts. The temperature of the air is\n, , which is\nof the same order of magnitude as\ns , and the convective heat transfer coefficient between the\nouter surface and ambient air is ho. Under steady-state conditions, a uniform heat flux per unit\nlength of the cylinder of qh′ (W/m) is dissipated by the heater.\nGiven parameters: kA, kB , hi , ho , εA , Ts ,\na) Draw the thermal resistance network for the heat transfer from the liquid to ambient air.\nT!,!, qh′ , r1, r2 , r3\nIdentify all the resistance elements and write down their expressions in terms of the\nparameters of the problem\nb) (8 points) In terms of the given variables, determine the liquid temperature, Tinf, i\n\nProblem 2: Solar Power at Sea\nBonzo is designing new at-sea power systems involving a combination of solar, wind and wave\npower. In this problem, we study the solar component only and analyze two independent designs.\nFor each design, we consider only the base system and steady operating conditions. The net solar\nradiation heat flux is assumed uniform in all incident directions, on average at qrad = 400 W/m2.\nThe outside air is at temperature Tinf = 295 K and its total heat transfer coefficient with solid\naluminum is hinf = 5 W/m2-K. The sea water is at temperature Tw = 280 K and its total heat\ntransfer coefficient with solid PVC plastic is hw = 50 W/m2-K. The thermal conductivity of\naluminum is kal = 235 W/m-K and of PVC plastic kpvc = 0.35 W/m-K.\n\nIts base system (Fig. 1) consists of a half spherical shell\nmade of aluminum (inner and outer radii: ri = 19 m and\nro = 21 m), fixed on top of a hollow cylinder made of\nspecial PVC plastic (horizontal thickness tpvc = 0.1 m).\nBoth the half spherical shell and hollow cylinder are\nfilled with air (total heat transfer coefficient hi = 3\nW/m2-K). The system is dimensioned such that the\nspherical shell is above the waterline. You can neglect\nthe heat transfer between the shell and cylinder where\nthey are in direct contact, at the edges of the shell (see\nFig. 1: this is because of contact resistances and of the small\nrelative area of this contact).\n\na) To model this design I, draw the relevant heat transfer resistance diagram and determine the\nvalues of the resistances needed to determine the external temperature To of the half spherical\nshell (Hint: a half spherical shell has a radial resistance equal to half that of a full spherical\nshell).\nb) What is this external temperature To?\nc) What is the heat transfer rate Q\nw from the air inside of the half spherical shell to the sea\nwater?\nd) What is the temperature Tai of the air inside the half spherical shell? (Note: the difference\nbetween this Tai and the water temperature Tw could be used by a power-generating cycle).\n\nTinf, hinf\nTi\nTo\nqrad\nro\nri\nTw, hw\nHalf spherical\nshell (Al)\nwater\nPVC\nh\naiT ,\ni\nair\nair\nhi\nair\nt\nContact\nresistance\ntpvc\npvc\nFig 1: Cross-section in base system of design I (half\nspherical shell on top of hollow cylinder), not to scale.\n\nProblem 3\nThe fuel for a certain nuclear power station consists of cylindrical pellets of 0.48-cm radius,\nmade of slightly enriched uranium dioxide (UO2). Heat is \"generated\" by nuclear fission within\nthese pellets at a uniform rate, qCgen = 24 W/g and is conducted out to the reactor coolant.\na) Calculate the radial distribution of the temperature within the pellet. The outer surface\nof the pellet is at 400°C. The axial and azimuthal dependence of the temperature can be\nneglected. Assume steady-state operation.\nb) What is the maximum temperature within the pellet?\nThe thermal conductivity of UO2 is 3 W/m-K. The density of UO2 is 10.4 g/cm3. The radial part\n1 d ⎡ dT ⎤\nof the Laplace operator in cylindrical coordinates is ∇ T =\nr\n⎢\n⎥\nr dr ⎣ dr ⎦\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.051 Introduction to Heat Transfer\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 1 Equation Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-051-introduction-to-heat-transfer-fall-2015/2013cba86d06ea09582d9e4d7558f514_MIT2_051F15_EqnSheet_Q1.pdf",
      "content": "Equation Sheet (Quiz 1)\n\nPage 1 of 1\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\n2.051 Introduction to Heat Transfer\n\nEquation Sheet (Fall 2015)\n\nMode of Heat Transfer\nEquation\nConduction\nq\nk T\n\nFourier's Law\nConvection\n\nNewton's law of cooling\nRadiation\nwhere\nW/(m\nemissivity\n5.67 10\nK\nof obj\n)\ne\nct (1)\n\nRadiation heat transfer from a small\ngrey object (1) to a large isothermal\nenvironment (2)\n\nSTEADY HEAT TRANSFER:\nMode of Heat Transfer\nResistance [K/W]\nConduction\nSlab\nRcond = L/ (kA)\nCylindrical (radial direction)\nln(\n/\n)\nout\nin\ncond\nr\nr\nR\nkL\n\nSpherical (radial direction)\n\nin\nout\ncond\nr\nr\nR\nk\n\nConvection\nRconv =1/ (hA)\nRadiation\nRrad =1/(hrA) where\nr\navg\nh\nT\n\nwhen\nT\nT\n\nSteady state heat equation with energy generation:\nPlanar coordinate\ngen\nT\nT\nT\nk\nk\nk\nq\nx\nx\ny\ny\nz\nz\n\nCylindrical coordinate\ngen\nT\nT\nT\nkr\nk\nk\nq\nr\nr\nr\nr\nz\nz\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.051 Introduction to Heat Transfer\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 2 Equation Sheet",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-051-introduction-to-heat-transfer-fall-2015/e32f70f7e00f34953447b606cea0421f_MIT2_051F15_EqnSheet_Q2_v3.pdf",
      "content": "Equation Sheet\n\nPage 1 of 2\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\n2.051 Introduction to Heat Transfer\nEquation Sheet (Fall 2015)\n\nSTEADY HEAT TRANSFER:\nMode of Heat Transfer\nEquation\nFourier's Law\nConduction\nqk\n\nT\n\nNewton's law of cooling\nConvection\n\n5.6710\n8 W/(m\n2K\n4)\nRadiation heat transfer from a small\nwhere\n\nRadiation\nemissivity of object (1)\ngrey object (1) to a large isothermal\nenvironment (2)\n\nTHERMAL RESISTANCE:\nMode of Heat Transfer\nResistance [K/W]\nSlab\nRcond L / (kA)\nln(rout / r )\nConduction\nCylindrical (radial direction)\nR\nin\ncond\n\n2kL\nSpherical (radial direction)\nR\n\ncond\nr\nin\nrout 4k\n\nConvection\nRconv 1/ (hA)\nRadiation\nRrad 1/ (hr A) where hr 4\n\n1Tavg when T1 T2\n\nSteady state heat equation with energy generation:\n\nT\n\nT\n\nT\nPlanar coordinate:\nk\n\nk\n\nk\nq\nx\nx\ny\ny\nz\nz\ngen\n\nT\nT\n\nT\n\nCylindrical coordinate:\nkr\n\nk\n\nk\nq\nr r\nr\nr\n\nz\ngen\n\nz\n\nFIN EQUATIONS\n\nFin Equation with convection alone.\nd 2\n2 m (x) 0\nGeneral solution: (x) Aemx Bemx\ndx\n\nTemperature distribution\nFin heat transfer rate\nFin Resistance\nTip condition\n(x=L)\n/b\n\nR fin\nConvection heat\n\nh\ncosh m L x\nsinh mL x\nsinh\nfe\nm\nh\nh\ntrans\nr:\nL\ncoshmL\ncoshmL\nsinhmL\nmk\nk\nm\n\nm\nk\nM\n\nd\nh\nh\nh\nh\nhPkA\n(L) k\n\ncoshmL\nsinhmL\ncoshmL\nsinhmL\nc sinhmL\no\nx\n\nc sh\nd\nmL\nx L\nmk\nmk\nmk\n\nAdiabatic:\ncosh mL x\n\nd\n\nM tanh\nk\nco\nmL\nhP Ac tanhmL\nsh mL\ndx\n\nxL\nPrescribed\n\nL\n\nsinhmx\n\nm\nsinh mL\nsinh\nL x\nL\n\ncoshmL\n\ntemperature:\n\nhPkAc\n\nb\n\nb\n\nL\ncosh mL\n\n(L)\n\nL\nsinhmL\nM\n\nsinhmL\n\nb\nInfinite fin\nx\nL\nem\n\nM\n(L) 0\n\n:\n\nhPkAc\nT T; b (0) Tb T; m2 hP / kAc ; M b\nhPkAc\n\nEquation Sheet\n\nPage 2 of 2\nHYPERBOLIC OPERATORS:\n\nd\nFunction: f(x)\nDefinition\nDerivative:\nf (x)\ndx\nsinh(x)\nex ex/ 2\ncosh(x)\ncosh(x)\nex ex/ 2\nsinh(x)\nex ex\ntanh(x)\n\n1ta\nex e x\nnh (x)\n\nUNSTEADY HEAT TRANSFER\n\nHeat diffusion equation:\nడ\nଶ\n\nwhere a k /rc and\nis\nడ\nth\ne\n=\nhe\nߙ\na\nߘ\nt ge\n\nne\n+\nrat\nఘ\nio\n\nn rate per\n\nunit volume [W/m3]\n\nDT\nBiot number: Bi\ninternal\nR\n\ninternal\nhL\n\nc where, possibly, Lc V / A\nDT\nrnal\nk\n\nexte\nR\ns\n\nexternal\nat\nFourier number: Fo L\n\nLumped Parameter Model (for Bi<<1):\nGeneral lumped equation:\n\nrVc\nSolution:\nwhere t\n\nhA\n\nSemi-Infinite Solid:\n\nBoundary Condition\nTemperature distribution\nHeat Flux at\nSurface\nConstant Surface Temperature:\nT x 0,tTs\n(\n\nݔ\n, ݐ\n-\n) -\n\n= erfc ൬\n√4\nݔ\nߙݐ\n൰\nk T\n\nq x0\ns Ti\nat\nConstant Surface Heat Flux:\nqx 0q0\n(ݔ, ݐ) -= ݍ\n\nߨ\nߙݐ൰\nଵ⁄ଶ\nି௫మ⁄(ସఈ௧) -ݔ∙erfc ൬\n√4\nݔ\nߙݐ\n൰\n\nSu\n-\nrf\n\na\n\nݔ\nce\nฬ\nCon\n=\nve\nh\nct\ni\n\non:\n(ݔ, ݐ) -= erfc ൬\n௫ୀ\nஶ-(ݔ= 0, ݐ)൯\nஶ-\n-ex\n√\np\nݔ\nߙݐ\n൰\nቆh\n\nݔ+ h\n\nଶߙ\nଶ\nݐ\n\nቇerfc ቆ\n√4\nݔ\nߙݐ\n+\n\nh√\n\nߙݐቇ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.051 Introduction to Heat Transfer\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 2 Review Problems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-051-introduction-to-heat-transfer-fall-2015/d7dbc839111f2f197a722b90e6d3748a_MIT2_051F15_Q2_Review_v3.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\n2.051 Introduction to Heat Transfer, Fall Term 2015\n\nQuiz 2 Review Problems\n\nProblem 1 (43 points)\nThe figure below illustrates a proposed mechanism to provide cooling for a nuclear fuel rod. The fuel rod, which has a\nradius Ri and thermal conductivity k1, is surrounded by a highly conductive, metallic casing (cladding) whose outer\nradius is Ro and whose thermal conductivity is k2. Attached to the cladding are three slender, metallic sheets of thick-\nness t and length L. The thermal conductivity of these sheets is k3. The device is immersed in a water bath maintained\nat a constant temperature Tinf. The heat transfer coefficient between the water and the fuel rod device is h. The fuel rod\nhas a length W. Both ends of the device at z= 0 and z= W are perfectly insulated. The total heat generation rate is\nQgen Watts. For the following questions, assume k3 (hL)\n⁄\n= 100, tL\n⁄\n= 0.02, and the system is at steady state. Ex-\npress your answer in terms of the quantities illustrated in the figure.\n\na) (5 points) Describe all relevant modes of heat transfer between from the center of the fuel rod to the surrounding\nfluid.\nb) (3 points) What is the total heat transfer to the water?\nc) (14 points) Construct a thermal circuit that models the heat transfer from the inner surface of the cladding (r=\nRi) to the surrounding fluid. Identify all the resistance elements and write down their expressions in terms of the\nparameters of the problem\nd) (7 points) What is the temperature, T(Ro), at the outer surface of the cladding?\ne) (6 points) What is the temperature, T(Ri), at the boundary between the fuel rod and the cladding?\nf) (8 points) If the specific heat generation rate in the fuel rod is qgen [W/m3], and the thermal diffusivity and specif-\nic heat of the fuel rod are and c, what is the temperature T(0), at the center of the fuel rod?\n\nQuiz 2 Review Problems\n2 of 3\n\nProblem 2: Terminator (25 points)\nIn the science fiction classic Terminator 2 - Judgment Day, the Evil Terminator is made of a malleable metal (ρ= 2700\nkg/m3, c= 900 J/kg-K, and k= 240 W/m-K), which can recombine when molten, thus allowing the Terminator to re-\ncover from any mutilation or impact with bullets. In the final scene, the Terminator is shattered into small pieces after be-\ning exposed to liquid nitrogen. It seems over, but unfortunately these small pieces land on the concrete floor next to a\nglowing-hot steel melt. The situation is illustrated in the figure below.\n\nYou are to analyze the heat transfer between the Terminator pieces and the air and steel melt. You may assume the fol-\nlowing:\n-\nThe Terminator pieces have irregular shape, with a surface area A= 24 cm2 and volume V= 8 cm3.\n-\nThe initial temperature of the Terminator pieces is equal to the temperature of liquid nitrogen (Ti= 77 K).\n-\nThe air surrounding the pieces is at Tair= 310 K and its convective heat transfer coefficient is hair= 5 W/m2-K.\n-\nThe steel melt is at TM= 1600 K and the effective heat transfer coefficient for radiation from the steel melt to the\npieces ishrad= 6 W/m2-K.\n-\nNeglect heat conduction between the pieces and the floor, as concrete has a very low thermal conductivity.\ni) (5 Points) Calculate two Biot numbers for the Terminator pieces. One for convection with air and one for radiation\nwith the melt.\nii) (3 Points) Determine the direction of the heat transfer between the Terminator pieces and the air at (a) t=0, and (b)\nthe time the Terminator pieces have reached their melting point (800 K).\niii) (12 Points) Calculate the time it takes for the Terminator pieces to reach their melting point. Hint: the general solu-\ntion of the differential equation\ndT\ndt= -\nT\nτ+ γ is T(t) = c1e-tτ\n⁄ + γt, where c1 is a constant of integration.\niv) (5 Points) Calculate the entropy transfer rate for the Terminator pieces at t= 0. Also, what is the entropy generation\nrate for the Terminator pieces at t= 0?\n\nQuiz 2 Review Problems\n3 of 3\n\nProblem 3\nAsphalt pavement may achieve temperatures as high as 50oC on a hot summer day. Assume that such a temperature exists\nthroughout the pavement, when suddenly a rainstorm reduces the surface temperature to 20oC. Calculate the total amount\nof energy (J/m2) that will be transferred from the asphalt over a 30-min period in which the surface is maintained at 20oC.\n\nProblem 4\nA tile-iron consists of a massive plate maintained at 150oC by an embedded electrical heater. The iron is placed in contact\nwith a tile to soften the adhesive, allowing the tile to be easily lifted from the subflooring. The adhesive will soften suffi-\nciently if heated above 50oC for at least 2 min, but its temperature should not exceed 120oC to avoid deteriorate of the ad-\nhesive. Assume the tile and subfloor to have an initial temperature of 25oC and to have equivalent thermophysical proper-\nties of k = 0.15 W/m-K and ρcp = 1.5 × 106 J/m2-K.\n(a) How long will it take a worker using the tile-iron to lift a tile? Will the adhesive temperature exceed 120oC?\n(b) If the tile-iron has a square surface area 254 mm to the side, how much energy has been removed from it during\nthe time it has taken to lift the tile?\n\nTile, 4-mm thickness\n\nSubflooring\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n2.051 Introduction to Heat Transfer\nFall 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}