{
  "course_name": "Introduction to Observational Physical Oceanography",
  "course_description": "No description found.",
  "topics": [
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Geophysics",
    "Oceanography",
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Geophysics",
    "Oceanography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nInstructors\n\nProf. Raffaele Ferrari\n\nDr. Terrence Joyce\n\nCourse Description\n\nThis course covers topics like: Observational physical oceanography, physical description of the sea, physical properties of seawater, methods and measurements, wind-driven ocean circulation, abyssal ocean circulation, boundary processes, and wave motions.\n\nThe mathematics and physics required for admission to the graduate curriculum in the WHOI/MIT Joint Program or consent of the instructor. The physical oceanography curriculum includes core courses (of which 12.808 is a part), mathematics courses, and electives. Each student formulates a program of studies with the assistance of academic advisors drawn from both MIT and WHOI.\n\nStudents are expected to attend research seminars and to complete widespread independent reading of the literature. The core curriculum is intended to provide the minimum, essential foundation in dynamics for students pursuing research in physical oceanography.\n\nCourse Organization\n\nHomework: 5 homework assignments = 30% of grade\n\nPresentations: Researching one type of measurement system used in physical oceanography = 30% of grade\n\nExam: Final exam at the end of class = 30% of grade",
  "files": [
    {
      "category": "Resource",
      "title": "readme.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-808-introduction-to-observational-physical-oceanography-fall-2004/67018f865fbbd18f3151b530846dbb62_readme.pdf",
      "content": "Problem Set 2, problem 2\nThere are 3 types of files that you will need, file names and contents are as follows:\nstation.loc: station number,date, time, latitude, longitude, and depth.\n(nb. W and S are negative)\nstation##.ctd: pressure(dbars),temperature(ITS-90), salinity(PSS-78),\noxygen(umol/kg), #obs and quality. The data have been\nsorted into 2dbar bins. The temperature will need to be\nconverted to IPTS-68 before using any UNESCO routine\n(physical properties of seawater...phyprop).\nt68=t90*1.0024\nsta##.lad: depth(meters),u(cm/s),v(cm/s). The ladcp data are averaged\ninto 10 meter bins.\nGeopotential anomaly can be calculated using the phyprop toolbox\nwhich is in the lecture notes section of this course. You will need to use the m-file\nsw_gpan. If this toolbox is in your Matlab Path, type help [file]\nto get information about the file [sw_gpan]. For pairs of stations, geostrophic\nvelocity requires that the distance between stations be calculated. The geostrophic\nvelocity is normal to line joining the two station pairs. You will need to use this\nwhen comparing geostrophic velocity to the measured east and north velcity components.\nI suggest you use the m-file [sw_dist] (also in phyprop toolbox).\nYou can also use the routine sw_gvel (in phyprop) to calculate geostrophic\nvelocity directly, but you are responbsible for understanding how it is done\n(and for the correct answer!).\nNote that the CTD files are different lengths as both the start and final\npressures can vary from station to station. Finally, be aware that the geostrophic\nvelocity is in m/s vs. pressure but the LADCP velocities are in cm/s and depth.\nPressure can be converted to depth using a standard ocean density following\nSaunders. This m-file is in the phyprop directory and is called sw_dpth(pres,lat).\nMatlab routine sw_pres(depth,lat) converts depth to pressure."
    },
    {
      "category": "Resource",
      "title": "problem_set_1a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-808-introduction-to-observational-physical-oceanography-fall-2004/314f2ce7275d5045b36b48997c426406_problem_set_1a.pdf",
      "content": "12.808, Problem 1, problem set #1\nΩ\nConsider a spherical earth of radius R=6.37*106\nmeters, rotating at a rate of Ω=7.29*10-5 s-1.\nStarting from rest at point 1 on the surface of the\nearth (latitude of 15oN), a particle is moved to point\n2 near the equator (5oN). It is then moved upward a\ndistance ∆R=10 km to point 3, then to point 4 at a\nlatitude of 25oN, then downward to the surface to\npoint 5. In all moves, total angular momentum, ω is\nconserved. For each point, what is the zonal\nvelocity, u , relative to the rotating earth? Do you\nfind reasonable values for the easterly trades or the\nwesterly 'jetstream' ? If not, what might be wrong?\nR\nθ\nRcosθ\n∆R\nω= mr (u+Ωr), where m is the mass of\nthe particle, u is the zonal velocity\nrelative to the earth, θ is the latitude, & r\nthe distance from the earth's rotation\naxis: r = Rcosθ.\nNote, this is not drawn to\nscale: radial distances are\nhighly exaggerated\n\n12.808, Problem 2, problem set #1\n-5\nT, oC\nρ, kgm\ndensity (Pr=0) of seawater\nS=40\nS=30\nS=20\nS=10\nOne aspect of the density of seawater we\nwant to explore here is how density varies\nwith different temperatures and salinities\n(at zero or atmospheric pressure). This is\nshown in the upper panel. Note that the\ntemperature of maximum density for each\nsalinity curve, Tm , decreases with\nincreasing salinity. This is shown in the\nlower panel (see red x's). Also plotted is\nthe decrease in the freezing point of\nseawater with increasing salinity (blue\no's). Note that the two different curves\ncross over at a point (T,S) = (-1.33,\n24.695).\nProblem: Consider a freshwater (S=0)\npond and a saltwater (S=35) pond of\nequal depths, say 50m. In winter under\ncold, calm conditions, which pond will\nform ice first? Why? When both ponds\nbegin to form ice, what is the bottom\ntemperature in each? (Hint: you might\nhave to consider both curves in the lower\npanel for the correct answer.)\n-6\n-5\n-4\n-3\n-2\n-1\nSalinity\nT, oC\nTm(max ρ) & Tf(freeze) vs. Salinity\nTm\nTf\n\n12.808, Problem 3, problem set #1\nConsider the problem illustrated by the Matlab program Pucks_on_ice. In order to get this m-\nfile,you should download both the main program pucks_on_ice.m as well as the files\ndraw_fig2.m and deriv.m.\nTry running the program. In the explanation box describing the figures (Figure(6), there are\nsome suggestions. Try the following, in each case showing plots of the results and your\ninterpretation of why trajectories may be different from the initial example:\n1.\nChange the bump to a dimple, making h0=-.05 (meters) in pucks_on_ice.m, line 128\n2.\nFor the bump, change the latitude (line 129) to the north pole (lat=90)\n3.\nFor the bump, change the latitude to the equator (lat=0)\n4.\nFor the bump, change the latitude of the bump to -30 (southern hemisphere)\n5.\nFor PO students (others optional), consider the equations with no body or topography\nforces. Derive expressions for the evolution of the oscillation for small friction and\ndetermine frequency of the oscillation. What are the equations representing the\ngeostrophic balance and why do the particles rotating around the bump slowly spiral out?\nThis is related to an example of another type of ekman layer: due drag of a moving particle\nby a solid surface (e.g. the ocean bottom)."
    },
    {
      "category": "Resource",
      "title": "problem_set_2b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-808-introduction-to-observational-physical-oceanography-fall-2004/d9ad9170f2192a9149c5526c463b71d0_problem_set_2b.pdf",
      "content": "12.808, Problem 1, problem set #2\nThis is a 3 part question dealing with the wind-driven circulation. At\n26oN in the N. Atlantic, the average wind stress across the interior of\nthe basin from the eastern boundary to the Bahamas is: ( τx ,τy ) =\n(-.034,-.01) Nt/m2. The average vertical component of the wind\nstress curl across this latitude is estimated to be -7.26x10-8 Nt/m3.\nThe values have come from a climatology for the period 1991-1997\ndeveloped by NCEP. Using these values, 1) estimate the values of\nthe total (zonally integrated) meridional Ekman and Sverdrup\ntransports at this latitude. The Florida Current flows through the\nFlorida Straits to the west of the Bahamas. 2) What transport would\none expect to observe if the Sverdrup balance was perfect for the\ninterior? What is observed? If one were interested in estimating the\nmeridional geostrophic transport in the interior across this latitude\nusing only hydrography, 3) how might one use the above information\nto estimate a \"reference level\" for the geostrophic calculation using\ndensity or dynamic height?\n\n12.808, Problem 2, problem set #2\nIn this problem you are asked to use MATLAB\nto analyze real data from the Gulf Stream.\nSix CTD stations were collected crossing\nthe Gulf Stream 2003 [& so TJ missed\nsome 12.808 lectures]. In addition, a\nlowered ADCP (LADCP) measured\nhorizontal currents at each station. These\nfiles can be found in the assignment\npage. You are asked to:\n1.\nPlot the temperature/salinity data from the\n6 stations in a T/S diagram & briefly\ndiscuss where there are large differences\namong the stations (see right for example\nof a T/S diagram for sta. 67)\n2.\nCalculate the geostrophic velocity for the\nwater column for each station pair\nassuming a level of no motion at 2000\ndbar.\n\n12.808, Problem 2 (cont.), problem set #2\n3. Consider how to use the LADCP\nmeasurements to adjust the assumed\nlevel of no motion at 2000 dbar (e.g.\none could take the mean of each\nstation pair and use it to shift the\ngeostrophic velocity at 2000 dbar).\nThis was done at the right yet the two\ndon't agree everywhere..\n4. Extra Credit! Use the result from 3)\nto estimate the total geostrophic\nvolume transport in the upper 4000m\nfor the 6 stations.\nThis problem requires some familiarity with\nMATLAB. Please read the README file for\nproblem set #2 for guidance. Remember, that to\ncompare geostrophic with measured velocities,\none has to look at velocity normal to the line\nbetween each station pair! [Hint: use \"sw_dist.m\"\nto get bearing between station pairs.]\n\n12.808, Problem 3, problem set #2\n)\n(\n)\n(\n]\n[\nF\nD\nD\nr\nF\nF\nD\nD\nr\nD\nf\ndt\nd\nh\nx\ny\ny\nx\nr\n×\n∇\n+\n-\n=\n-\n+\n-\n=\n+\nρ\nζ\nρ\nζ\nζ z\nThis problem is for PO students: it is optional for others. Using the\nbarotropic momentum and continuity equations for a variable\ndepth ocean of constant density presented in the class notes, derive\nthe conservation statement (below) for potential vorticity in the\npresences of body forces and friction for a spatially variable\nCoriolis parameter. Recall that this was stated as a result in class:\nyou are now asked to show how this equation can be obtained.\nRecall that D=H+h, where z = -H is the depth of the undisturbed\nfluid and z = h is the free surface."
    },
    {
      "category": "Resource",
      "title": "problemset_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-808-introduction-to-observational-physical-oceanography-fall-2004/6d8f9798de3dcd9728e0c157d17fd1ac_problemset_3.pdf",
      "content": "Problem set 3, 12.808\nThree problems are asked: all requiring use of the WHP/SAC global\nhydrographic atlas. The atlas provides a climatology with 1 degree of\nlatitude/longitude resolution as provided as part of the class material on the\nwebsite. The climatology was produced using the WOCE Hydrographic\nProgramme data as a guide to quality control all previously available data for\nthe world ocean. Data are optimally mapped on density surfaces. Further\ndetails can be found in the following report:\nGouretski, V. V., and K. P. Koltermann, WOCE Global Hydrographic\nClimatology, a technical report. Berichte des BSH, Nr. 35/2004, 52pp, 2004,\n<www.bsh.de>.\n\nProblem A: T. Joyce\nIn our Ocean Circulation reference, according to the class notes, the\nglobal figure of dynamic height relative to 1500 dbar shown\n[fig 3.21, p. 62] is incorrect. You are requested to\n1.\nplot and contour the dynamic height [geopotential anomaly/10]\nover the world ocean using the atlas. What regions have the\nlargest values and which the smallest?\n2.\nDiscuss the differences between the northern Pacific &\nAtlantic oceans in terms of dynamic sea level differences.\n[hint: use the program atlas.m on the website as a guide for this\nproblem]\n\nProblem B: T. Joyce\nIn the tropical Pacific, there is a slight assymetry between the north and\nsouth Pacific in terms of temperature and zonal velocity [fig. 5.5, p.\n149 in Ocean Circulation]. Use the Atlas to\n1.\ncontour a salinity, temperature and neutral density section between\n10 N/S in the central Pacific; discuss the salinity contrast between\nthe upper waters of the North & South Pacific.\n2.\nSelect a density surface that goes through the core of the equatorial\nundercurrent and plot a horizontal, plan view map of the tropical\nPacific & Indian Oceans with salinity & pressure variations on this\ndensity surface\n3.\nBased on your results, discuss whether North or South Pacific Water\nenters the Indian Ocean between Indonesia & Australia.\n[hint: for making sections and for interpolation onto neutral density\nsurfaces, look at the examples in the script \"atlas.m\" on the website]\n\nProblem C: R. Ferrari\n1.\nTake the whole Atlas data set and compute the potential temperature Theta. You will need\nthe MATLAB seawater libraries for this calculation (you must use the function\nsw_ptmp). You will also need the seawater libraries to run the routine TSvolumetric.\n2.\nUse the routine TSvolumetric to compute the Theta-S volumetric\ndiagram for the global oceans. The parameters you must pass to the routine are: potential\ntemperature, salinity, neutral density, longitude, latitude, pressure, range of neutral\ndensity surfaces, potential temperature bins, salinity bins. The parameter gammarange is a\n2 element vector with the minimum and maximum neutral density surface you want to\nconsider in your calculation, say gammarange=[27.8,28.2]. The Theta-S volumetric\ndiagram is calculated on a Theta-S grid given by the 1D vectors thetarange and saltrange,\nfor example thetarange=[-1:0.1:4] and saltrange=[34.4:.01:35]. The routine returns the\nvalues at which the Theta-S diagram has been evaluated (T and S) and the ocean volume\noccupied by each Theta-S point (TSvol). The routine makes the approximation that 1\ndecibar = 1 meter, and takes into account that a 1x1 degree area changes with latitude.\n3.\nPlot the Theta-S volumetric diagram for the Theta-S ranges given in Fig. 6-46a , p. 254 of\nOcean Circulation. Can you identify the neutral density ranges that identify the Antarctic\nBottom Water and the Common Deep Water shown in Fig. 6-47? Draw the Theta-\nS volumetric diagram for these two water masses and estimate the fraction of ocean\nvolume that these two water masses occupy."
    },
    {
      "category": "Resource",
      "title": "gbl_hgpc_atlas.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-808-introduction-to-observational-physical-oceanography-fall-2004/c24ae0594fb5a634554d9284631f8384_gbl_hgpc_atlas.pdf",
      "content": "WOCE hydrographic Atlas, 1\nAs a result of the World Ocean Circulation Experiment (WOCE), a\nhydrographic survey of the world oceans occurred from 1990-1998.\nThese data were unprecedented in terms of the global coverage and\nquality. They were subsequently used by a group in Hamburg (Goruretski\n& Koltermann, BSH Tech. Ret. 35/2005) to regionally 'correct' previous\ncruise data, and produce a Global Hydrographic Climatology [GHC] of\ngridded hydrographic data [half degree of lat/lon] at 45 standard depth\nlevels for the world oceans. Spatial averaging ranged from 50 to 700 km\nscales, with smaller scales near boundaries and where available data\ndensity allowed. While nutrients and oxygen we included in the gridded\nAtlas, we will be using just temperature, salinity, and neutral density\n(Jackett & MacDougall, JPO 1996). And since we want a tool for global\ncalculations, we will subsample the half degree climatology to every\nwhole degree of lat/lon [reduction of file sizes by a factor of 4].\n\nWOCE hydrographic Atlas, 2\nBecause we want a tool for calculations, the original depth levels were\nresampled or interpolated onto pressure levels (in decibars) so that\nstandard calculations for potenetial temperature, potential density,\ngeopotential anomaly [dynamic height] could be easily made with our\nMATLAB routines. Each of the gridded data arrays are padded with NaNs\nwhere no data are available [over land or below the local ocean water\ndepth/pressure]. Each array is three dimensional with latitude, longitude\nand pressure the three independent variables. Thus salinity,\n(dataS_pr(171x360x45) has 171 latitudes [-80:90], 360 longitudes [0:359]\nand pressures [variable 1:45]. Local bathymetry is provided by the\nMATLAB \"topo\" one degree file. The MATLAB script \"atlas_test.m\"\nwas used to create all of the following figures. It, as well as the data file\n[GHC_pr] can be found in the course notes under \"GHC Files\".\n\nWOCE hydrographic Atlas, fig. 1\nTo begin with, we select\nthe temperature (upper)\nand salinity (lower) values\nat the ocean surface and\nplot their global\ndistribution. White values\nare generally over 'land'\nbut in other figures at\ngreater pressures, they\nwill be where the pressure\nlevel does not exist in the\ndata file. Bathymetry\ncontours (black lines) are\nplotted at 1, 3, and 5 km\ndepth.\n\nWOCE hydrographic Atlas, fig. 2\nAt the right, I have plotted\nthe temperature and salinity\nat a pressure of 1000 dbar.\nNote the large salinities in\nthe North Atlantic and NW\nIndian Oceans: these are\ndue to outflows from the\nMediterranean and Red\nSeas, respectively. The\nArctic Ocean appears to be\ncut off from the rest of the\nocean because 1000 dbar is\nbelow the sill depths for the\nBering Straight and the\nIceland/Faroe Ridges.\n\nWOCE hydrographic Atlas, fig. 3\nIt is often common to\nplot properties on density\nsurfaces, in order to see\nwater mass structure. We\nhave used neutral density\nsurfaces for this exercise.\nNeutral surfaces will vary\nfor a fixed pressure\nbecause of geostrophic\nflow in the ocean. At the\nright are plotted neutral\ndensity at the surface and\nat 1000 dbar.\n\nWOCE hydrographic Atlas, fig. 4\nAt the right salinity has been\nplotted following the neutral\ndensity surface 27.95. This\nsurface is one which can\ncharacterize the 'classical'\nLabrador Sea Water. One\ncan see this level to be\nshallow in the Lab Sea and to\nhave its lowest salinities\nlocally there. The layer\nobviously comes near or to\nthe surface in the Southern\nOcean, where low salinities\nare also imprinted.\n\nWOCE hydrographic Atlas, fig. 5\nAt the right, we have plotted\npressure (top) and salinity\n(bottom) on the neutral density\nof 27.3. This density is one\nwhich rises to the surface\n(outcrops) in the Southern\nOcean and is a good level for\ntracing properties of Antarctic\nIntermediate Water (AAIW).\nWe can also see effects of the\nRed Sea and Med Outflows.\nNote how this display shows a\nmuch broader salty Med\n'tongue' than on the 1000 dbar\npressure level.\n\nWOCE hydrographic Atlas, fig. 7\nOther neutral layers are plotted\nwith the atlas_test program. For\nnow, we move on to a different\ndisplay. Here we select a particular\nlongitude (190 or 170W) and plot a\nvertical 'section' from south to\nnorth across the central Pacific\nOcean. We have calculated\npotential temperature and plotted it\n(bottom) and salinity (upper). Note\nthe outcropping of cold water in\nthe Southern Ocean and the\nappearance of intermediate waters\nof low salinity in both the Southern\nOcean (AAIW) and North Pacific\n(North Pacific Intermediate\nWater: NPIW).\n\nWOCE hydrographic Atlas, fig. 8\nFinally, we plot a\nθ/S diagram for\ndata along the\n170W section\nfrom the previous\nfigure. We have\ncoded the points to\ncontrast those in\nthe polar regions\nfrom the 'central'\nPacific. In the\nformer, one can\nsee near surface\nwaters at or very\nclose to the\nfreezing point."
    },
    {
      "category": "Resource",
      "title": "course_notes_1b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-808-introduction-to-observational-physical-oceanography-fall-2004/3d5df3d5d07359119919979b0b01f6d0_course_notes_1b.pdf",
      "content": "12.808: Some Physical Properties of Sea Water or, More than you ever\nwanted to know about the basic state variables of the ocean...\n\nSalinity\n\nVarious salt constituents in 1 m3 of seawater having (t, S) = (20, 35). Taken\nfrom Neumann and Pierson, Principles of Physical Oceanography, 1966,\nPrentice-Hall.\n\nConstituent\nMass, kg\nRunning Total, kg\nNaCl\n28.014\n28.014\nMgCl2\n3.812\n31.826\nMgSO4\n1.752\n33.578\nCaSO4\n1.283\n34.861\nK2SO4\n0.816\n35.677\nCaCO3\n0.122\n35.799\nKBr\n0.101\n35.900\nSrSO4\n0.028\n35.928\nH2BO3\n0.028\n35.956\n\nNow, based on the equation of state (EOS-1980) for seawater, the density of\nseawater having this (t,S) value should be 1024.8 kg/m3. So the mass of salts\ndivided by the mass of the water is:\n\n(35.956/1024.8) = 35.1, which should be 35 but seems a bit off!\n\nSalinity used to be based on chlorinity (Cl) since it was found that many of the\nabove salt constituents had a constant ratio with Cl in seawater under a variety\nof values and locations (based on the Challenger Expedition samples). After\nlater finding out that this was not universally true, a different, more accurate\nsalinity scale was developed based on the electrical conductance of seawater\ncompared to a \"standard\" solution of KCl at 15 oC. A practical salinity scale\nwas agreed upon in 1978 (PSS1978). Standards based on KCl are available for\npurchase and are made in \"batches\" every year and distributed to the\noceanographic community. See Fofonoff (JGR, 90, 3332-3342, 1985) for a\ndiscussion of PSS78 (and EOS1980, below). Salinity used to be reported as\nparts per thousand or o/oo (or grams per kg of seawater), but now has no formal\nunits under the new salinity scale.\n\nTemperature\n\nTemperature is measured in an absolute scale (degrees Kelvin, oK) from\nabsolute zero, a temperature of zero molecular motion. Other benchmarks have\nbeen picked somewhat arbitrarily based on properties of various substances,\nwhich are readily available and have some rather stable properties. The\ntemperature scale used on oceanography is the Celcius scale (degrees C) such\nthat:\n\nT = t + 273.15, where T is in oK and t is in oC.\n\nTemperature scales have changed over the years (in 1948, 1968 and most\nrecently in 1990) as various benchmark values have been changed. For the\noceanographic temperature range (-2 to 35 oC), temperature is now based on\nelectrical resistance measurements of a pure platinum wire relative to the\nresistance at the triple point of water, which is a temperature value at which\nsolid, liquid and vapor phases are in equilibrium at a standard atmosphere.\nOther benchmarks and the resistance ratios are given below:\n\nTemperature oC\nWr\nTriple point, mercury\n-38.8344\n0.84414211\nTriple point, water\n0.01\n1.00000000\nMelting point, Gallium\n29.7646\n1.11813889\nFreezing point, Indium\n156.5985\n1.60980185\n\nWr=R(t90)/R(273.16 oK) is the resistance ratio of pure platinum for the t90\ntemperature scale relative to the triple point of pure water. For the\noceanographic range,\n\nt90 = 0.010015 + 250.7140(Wr-1) + 9.71421(Wr-1) 2\n\nThe difference between the 'old' (1968) temperature scale (t68) and the 'new'\n(t90) is small, basically showing that water now boils at 99.97 oC not at 100! It\ncan be written as\n\nt90=0.99976*t68\n\nMost formulae for water properties (e.g. EOS1980, PSS1978) were distributed\nbefore this temperature change occurred and to be formally correct, they should\nhave their t90 temperatures changed to the t68 scale before using them.\n\nIn this course, we will usually use the symbol T to represent t90, unless units\nare specifically given as oK.\n\nSome representative profiles of temperature and salinity vs. depth are given\nbelow. The region of rapid temperature change with depth due to seasonal\nheating is called the \"seasonal thermocline\". It lies above a permanent\nthermocline, which divides the upper and deep parts of the ocean.\nImages removed due to copyright concerns.\n\nPressure\n\nPressure is force/unit area acting on a surface. It has several units, with\nconventional units different in meteorology and oceanography. The Standard\nInternational (SI) units are based on the MKS (meter-kilogram-second) and is\nthe Pascal.\n\n1 Pascal = 1 newton/m2, where\n1 Newton = 1 kg m / s2, making\n1 Pascal = 1 kg / m s2 .\n\nOther units commonly uses are based on the Bar, where\n\n1 Bar = 105 Pascal\n1 mbar 10-3 bar = 102 pascal = 1 hectopascal,\n1 dbar = 10-1 bar = 104 pascal.\n\nPressure at the bottom of the atmosphere is 1.013 bar or 1013 mbar.\nMeteorologists commonly use millibars as pressure units and oceanographers\nuse decibars because the additional pressure under a layer of water that is 1\nmeter high is approximately 1 dbar. We generally use gauge pressure, or the\ndeparture of pressure from atmospheric values at sea level. Just to make things\nmore complicated, pressure is often quoted in terms of cm or inches of mercury\nin a manometer, where a standard atmosphere (1013 mbar) will raise a column\nof mercury a height 76 cm. Pressure measuring instruments can generally be\ncalibrated by adding fixed masses that depress a fluid column a known amount,\ngiven that one can independently measure or determine the local acceleration of\ngravity!\n\nρ\nh\nShort digression on pressure:\n\nConsider the diagram at the right:\n\nA column of water of density ρ and height h is resting.\nThe column has a cross-sectional area A. The pressure\nat the top of the column is Pt and at the bottom, Pb. The\nPressure at the bottom can be expressed as the total force\nper unit area on the bottom surface or\n\n(p1) Pb = (ρAh)g/A + Pt = ρgh + Pt ,\n\nwhere (ρAh) is the mass of fluid & g is the acceleration of gravity. For small\nchanges in depth, h = -δz, and Pb - Pt = δP, the above equation can be written in\ndifferential form as:\n\n(p2) δP/δz = -ρg ,\n\nwhere we have inserted the sign convention that z is positive upward. This is\nknown as the hydrostatic balance & is one of the most important relations in the\nocean, where for most low frequency changes, it is a reasonable approximation\nof the force balance in the vertical.\n\nFor a column of saltwater with a density of 1025 kg/m3 that is 10 m high with a\ngravity of 9.81 m/s2, using (p1) we get:\n\nδP = (1025)(9.81)(10) ~ 105 Pa,\n\nwhich is the pressure at the bottom of the atmosphere. Thus, the weight of the\nentire atmosphere is equivalent to 10 m of seawater! Mercury, which has a\nspecific gravity of 13.6, or a density of 13.6 times that of pure water, would\nproduce the same pressure at the bottom of a column that is:\n\nsealed\nh = 105 Pa / (13600 kg/m3) / (9.81 m/s2 ) = 0.754 m.\nopen\n0.76m\n\nWith a sea level pressure of 1.01 Bar, this would give 0.76m. A\nmercury-filled tube, sealed at one end and evacuated of air on that\nend, open to the atmosphere at the other is called a manometer and\nis one of the easiest ways of routinely and accurately measuring\natmospheric pressure.\n\nAdiabatic Lapse Rate & Potential Temperature\n\nIf a layer of fluid is completely mixed, then when 2 parcels of fluid from\nanywhere in the layer are brought together at the same pressure, their properties\nare indistinguishable. The parcels must all have constant entropy per unit mass,\nη. This is expressed thermodynamically as follows:\n\n(\n)\nT\nv\np\nT\nT\nC\nwhere\nC\nT\nv\nT\ndp\ndT\nor\ndp\np\ndT\nT\nd\np\np\n∂\n∂\n-\n≡\n∂\n∂\n∂\n∂\n≡\nΓ\n=\n∂\n∂\n=\n=\n\n∂\n∂\n+\n\n∂\n∂\n=\nη\nη\nη\nη\nη\n,\n,\n,0\n\nwhere T is temperature (oK), ∂v/∂T is the change in specific volume (inverse of\ndensity) with respect to temperature, Cp is heat capacity at constant pressure,\nand Γ is the adiabatic lapse rate, or rate at which temperature will change in\nthe vertical in an otherwise vertically mixed layer of fluid. It is often explained\nin terms of the compressiblility of air or seawater, but as you can see from the\nabove, it does not directly come from the compressibility (∂v/∂p), but from the\nchange in volume with temperature.\n\nAt the surface of the earth in the lower atmosphere and in the deep ocean, the\nfollowing are approximate values for Γ:\n\nLower atmosphere:\n-10oC / 1000m increase in height\n\nDeep Ocean:\n\n-0.1 oC / 1000m decrease in depth\n\nThis is most common to those living near mountains who can move upward to\ncooler temperatures by ascending the mountain even in a well-mixed lower\natmosphere. In the ocean it is most evident in the gradual increase in\ntemperature with increasing depth in the deep ocean. Because of the non-\nconservative aspect of temperature, we often use potential temperature, which\nis the temperature of a fluid parcel that is moved adiabatically from an initial\npressure of pi to a reference pressure pr. It is expressed as follows:\n\n∫Γ\n+\n=\nr\np\np\ni\ndp\nt\nθ\n, where Γ is the lapse rate and ti is the initial temperature.\n\nThe diagram at the right is\ntaken from Pickard &\nEmery (who took it from\nelsewhere) and shows the\n'classic' picture of the\ndifference between\ntemperature and potential\ntemperature over a deep\ntrench (Mindanao). On t\nleft, temperature incre\nwith depth and density\nanomaloy (using in situ\ntemperature) decreas\nwith increasing depth and\nsuggest a 'tongue' of\ncooler water flowing to\nthe left, over the sill at th\nright. Potential\ntemperature and potential\ndensity anomaly (right\npanels) correctly show\ncooler deep water flowing over the sill and into the abyss with stable\nstratification above.\nhe\nases\nes\n\ne\n\nDensity\n\nVarious different ways are used to describe the density of seawater and its\nrelation to the basic field variables of temperature, salinity and pressure.\n\nσ = ρ - 1000 kg/m3 = σ(s,t,p)\ndensity anomaly\n\nv = 1/ ρ = v(s,t,p)\n\nspecific volume\n\nδ = v(s,t,p) - v(35,0,p)\n\nspecific volume anomaly\n\nσθ = σ(s,θ ,p,pr)\n\npotential density [σ2= σ(s,θ ,p,2000)]\n\nUsually density is plotted/examined at fixed pressures so that σθ is much more\ncommonly than σ. The internationally used equation of state of seawater was\nImage removed due to copyright\nconcerns.\n\nsuggested by Millero and accepted in 1980 (EOS80). The density of air at\natmospheric pressure is approximately 1.2 kg/m3, nearly a thousand times less\nthan seawater.\n\nSound Speed\n\nThe speed of sound, c, in a fluid is defined as:\n\nc-2 = (∂ρ /∂p)η, where the usual notation above applies and the change of\ndensity with pressure (related to the inverse of the compressibility) is\ndetermined at constant entropy.\n\nValues of sound speed (t=15 oC, p = sea level) in air (340 m/s) and water (1500\nm/s) are quite different and c has the property that it increases with both t and p.\nIn the ocean, because p increases with depth and t decreases with depth, one\noften sees a sound velocity minimum in the water column as sketched below:\n\n1550 m/s\ndepth\n1000m\n2000m\n\nSound velocity minimum or\nsound channel: whales use it for\nlong distance communication!\n\nIn the following figure (taken from Pickard & Emery) an example of a sound\nvelocity profile is given for a North Pacific location in which (upper panel)\ntemperature and salinity variations are plotted vs. depth (left), the sound\nvelocity dependence due to temperature and pressure (center) and the resultant\nsound speed profile (right) are indicated. In the lower panel(s), near surface and\ndeeper effects of sound speed variation on propagation of rays of sound are\nshown. Note how, in the lowest plot, sound tends to be \"channeled\" in a region\ndefined by the sound velocity minimum. This sound channel enables long-\ndistance communication by whales, and has been exploited by oceanographers\n[and the military] for some time.\n\nDynamic Height or Geopotential Anomaly\n\nUnder action of gravity, a geopotential Φ, can be defined as the work done per\nunit mass to move a particle a distance dz, where -z is the direction of gravity.\n\n∫\n+\nΦ\n=\nΦ\n=\nΦ\nz\ndz\ng\nz\ndz\ng\nd\n)\n(\n,\n\nRecalling the hydrostatic balance (from the discussion of pressure),\n\n∫\n∫\n∫\n∫\n≡\n-\n-\nΦ\n=\n-\n-\nΦ\n=\nΦ\nΦ\n=\n=\n-\n-\n=\nP\nP\nP\nP\ndp\np\nD\nwhere\np\nD\ndp\ndp\ndp\nP\nthus\nd\ngdz\nvdp\ngdz\ndp\n)\n(\n),\n(\n)\n(\n)\n(\n)\n(\n,\n;\nδ\nα\nδ\nα\nρ\n\nD(p) is \"dynamic height\" or geopotential anomaly and it contains all of the\nhorizontal and vertical variations of density in the fluid. The term proportional\nto α0 is of little dynamic consequence and the term at the ocean surface, Φ0, is a\ndepth independent part of the geopotential or dynamic height that will need to\nbe evaluated based on considerations other than density (or specific volume\nanomaly). The MKS units for geopotential anomaly or dynamic height are\nm2/s2, but common usage gives values of dynamic height in \"dynamic meters\",\nwhich is equivalent to 10 m2/s2.\n\nHeat Capacity\n\nThe amount of heat needed to raise the temperature per unit mass of a substance\na temperature ∆T = 1 oK at constant pressure is heat capacity, Cp. Some typical\nvalues are as follows:\n\nOcean water:\nCp= 4.2 x 103 joules/kg/ oK\nρCp=4.2 x 106 joules/m3/ oK\nAir\n\nCp= 103 joules/kg/ oK\n\nρCp=1.2 x 103 joules/ m3/ oK\nGranite\n\nCp= 0.84 x 103 joules/kg/ oK\nρCp=2.3 x 106 joules/m3/ oK\n\nIf one multiplies the heat capacity times the density of each of the above ρCp,\none gets the third column, which is a measure of the heat capacity of one m3 of\nthe substance.\n\nReference: Fofonoff, in The Sea, Vol. 1: Physical Properties of Seawater."
    }
  ]
}