{
  "course_name": "Introduction to Literary Theory",
  "course_description": "This subject examines the ways in which we read. It introduces some important strategies for engaging with literary texts developed in the twentieth century, paying special attention to poststructuralist theories and their legacy. The course is organized around specific theoretical paradigms. In general, we will: (1) work through the selected readings in order to see how they construe what literary interpretation is; (2) locate the limits of each particular approach; and (3) trace the emergence of subsequent theoretical paradigms as responses to what came before.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "Philosophy",
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "Philosophy"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThis subject examines the ways in which we read. It introduces some important strategies for engaging with literary texts developed in the twentieth century, paying special attention to poststructuralist theories and their legacy. The course is organized around specific theoretical paradigms. In general, we will: (1) work through the selected readings in order to see how they construe what literary interpretation is; (2) locate the limits of each particular approach; and (3) trace the emergence of subsequent theoretical paradigms as responses to what came before. The literary texts and films accompanying the theoretical material will serve as concrete cases that allow us to see theory in action. For the most part, each week will pair a text or film with a particular interpretative approach, using the former to explore the latter. Rather than attempting a definitive or full analysis of the literary or filmic work, we will exploit it (unashamedly--and indeed sometimes reductively) to understand better the theoretical reading it accompanies.\n\nPrerequisites\n\nThis course has no prerequisites.\n\nCourse Requirements\n\nTexts\n\nSophocles.\nOedipus Rex\n. CreateSpace Independent Publishing Platform, 2014. ISBN: 9781500376765.\n\nBronte, Charlotte.\nJane Eyre\n. Tribeca Books, 2013. ISBN: 9781936594191. [Preview with\nGoogle Books\n]\n\nFreud, Sigmund.\nThe Interpretation of Dreams\n. CreateSpace Independent Publishing Platform, 2015. ISBN: 9781506138855. [Preview with\nGoogle Books\n]\n\nFoucault, Michel.\nThe History of Sexuality, Vol. 1: An Introduction\n. Vintage, 1990. ISBN: 9780679724698.\n\nAssignments\n\nResponse Paper\n: A brief response to modes of reading covered in the first three weeks (about 3 pages).\n\nOral Presentations\n: 15-20 minute presentation of assigned readings and shorter presentations / questions throughout term.\n\nTake-Home Midterm\n: Short essays responding to questions handed out (8-10 pages).\n\nFinal Paper\n: Longer essay either theoretically-oriented or a careful reading of a text of your choice, drawing on what you have read over the term (6-8 pages).\n\nGrading\n\nThe class will require regular participation and attendance. Your engagement with the material will determine how well the course works.\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation and Attendance\n\n10%\n\nOral Presentations\n\n15%\n\nResponse Paper\n\n15%\n\nTake-Home Midterm\n\n30%\n\nFinal Essay\n\n30%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nNew Criticism and American Reader Response Criticism\n\nStructuralism\n\nStructuralism (cont.)\n\nResponse Paper due 3 days after Ses 4\n\nDeconstruction\n\nDeconstruction (cont.)\n\nPsychoanalysis: Freud\n\nPsychoanalysis and Lacan\n\nPsychoanalysis and Lacan (cont.)\n\nTake-Home Midterm due 10 days after Ses 9\n\nMichel Foucault\n\nMichel Foucault (cont.)\n\nContinuation of earlier material\n\nLatour and Kittler\n\nFinal Essay due 3 days after Ses 13",
  "files": [
    {
      "category": "Resource",
      "title": "21L.451 F14 Final Paper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/bdf915ae83af7424ee9f245947b6c2e1_MIT21L_451F14_Final_Paper.pdf",
      "content": "21L.451 Introduction to Literary Theory\n\nFinal Paper\n\nThis final essay is an open topic one that requires you to compose a 6-8 page essay\non a text/film/cultural artefact of your choice. In essence, your task is to analyse\nyour chosen object of study using one or more of the poststructuralist theoretical\nparadigms we have engaged with this semester. You are free to draw on the basic\ntheories with which we began (New Criticism, Reader Response, and Structuralism),\nbut the essay does need to show sustained engagement with the subsequent\ntheoretical approaches.\n\nYou are welcome to write on any of the primary texts we have already looked at in\nclass, or to work with any of the midterm texts that you didn't already analyse. Or\nyou can choose something entirely different: a novel, a film, a poem, a painting, an\ninteresting object - with one caveat: please clear it with me before beginning, since I\nneed to have some familiarity with whatever you choose in order to assess your\nessay fairly.\n\nSo, the basic requirements are:\nLength 6-8 pages, 12pt Times Roman or equivalent font, 1\" margins.\nRemember to title your essay and to number the pages.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 F14 Midterm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/0604d52f4c32ddda227f2f42905df9ae_MIT21L_451F14_Midterm.pdf",
      "content": "21L.451 Introduction to Literary Theory\n\nQuestions for a take-home exam:\n\nPART ONE\n\nChoose any ONE of the questions below and write a 4-5 page paper that responds to\nthe chosen question. Narrow the question down to a coherent and manageable set of\nissues. I would encourage you to try and make your responses as specific as\npossible, using examples from the literary texts we have read thus far to illustrate\nyour argument. I don't, of course, expect definitive \"solutions\" to the problems\nraised by the question -- the questions are broad and thus speculation is\nencouraged. However, I do wish you to take positions, to try to articulate and to\ndefend your point of view.\n\n1. Osip Brik, an important figure in the Russian formalist movement, once remarked\nthat Pushkin's Eugene Onegin would have been written even if Pushkin had not\nlived. What do you understand by this assertion? Defend or critique it by drawing on\nsome of the theoretical positions we have examined this term. Use examples as and\nwhen appropriate.\n\n2. An often-quoted phrase of Derrida's is: Il n'y a pas de hors-texte. The sentence is\nhard to translate. Literally, it reads, \"there is no outside-text\" or even more clumsily\n\"there is not of the outside-text.\" In what sorts of ways might this be interpreted?\nWhat do you think Derrida might mean? Discuss, using examples as appropriate.\n\n3. What is the relationship between structuralism and post-structuralism? Another\nway of asking this question is: how should we make sense of the \"post\" in \"post-\nstructuralism\"? Since this is a broad question, you might want to try and specify it\nfurther. For example, you might want to compare the ways in which the idea of the\ntext and of intertextuality is construed (either implicitly or explicitly) in\nstructuralist and poststructuralist theories. Or you might want to begin by\nconsidering the different ways in which the prefix \"post\" functions, and develop this\ninto an analysis of the \"post\" in post-strucuralism. Or you could take a different\ntactic. Be specific and try and use examples to illustrate your points. Think about the\ndifferent post-structuralist theories we have read, and how the term applies to each\nof them - you are not required to address all the theories (pick and choose as you\nsee fit).\n\n4. The Unconscious, Lacan writes, is the discourse of the Other. What do you think\nhe means by this? Drawing on your understanding of Freud, Lacan and Zizek, pursue\nthe implications of this statement. Again, be specific and use textual/filmic examples\nas and when appropriate. (Here, too, you will need to decide how to focus your\npaper. You could, for example, examine the question of the subject, that is, of the\nspeaking voice or intending self in its relation to the structures that surround it. Or,\n\nyou could focus on Lacan's sense of how language works. Or figure out a different\nemphasis.)\n\nPART TWO\n\nWrite a 4-5 page essay -- 12pt Times Roman or equivalent, one inch margins -- on\none of the following. Your essay should make use of one or a combination of the\ntheoretical methods we have examined thus far. Be specific; make sure you have\nclear and cogent argument, avoid lists and unnecessary plot summary.\n\nAdrienne Rich, \"Diving Into the Wreck\"\nRoman Polanski, Chinatown or Alfred Hitchcock, Marnie\nJorge Luis Borges, \"Pierre Menard, Author of the Quixote\"\nJohn Keats, \"This Living Hand\"\nE. T. A. Hoffman, \"The Sandman\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 F14 Oral Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/98d43f1703b737e3c27619dc2115f0ef_MIT21L_451F14_Oral_Prese.pdf",
      "content": "21L.451 Introduction to Literary Theory\n\nOral Presentation Guidelines\n\nThe oral reports are a crucial component of the class. In general, these should be 2-\n3 pages long (i.e., of a length such that it takes about 10-12 minutes to read out).\nAfter the reports have been read, discussion will begin. There is some flexibility to\nthe format of the reports. The important point is that they are meant to incite,\nprovoke, trigger discussion of the texts we are reading. To this end, you may decide\na brief summary of the main arguments, followed by questions for discussion is the\nway to go. Or you might want to provide the outlines of a reading of the literary text\nfor the week using the tools the critical reading provides, in order to bring into view\nthe strengths and limits of that critical approach. Or you might wish to choose\nanother (short) text of your own accord, through a discussion of which the\ntheoretical approach is examined. Or you might have some other way of\ncommunicating what you want to. Fine, as long as you bear in mind that you have a\n10-12 minute frame within which to carry out your plan. Remember, the questions\nraised by the report in particular (and by the group in general) are directed to\neverybody and not just to me. You are all expected to think independently and\nrespond to the questions raised by reports and discussions. The success of the\ncourse depends finally on you and your engagement with the material.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 F14 Response Paper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/30b545637595851bff6ff324e8fed647_MIT21L_451F14_Response_Pap.pdf",
      "content": "21L.451 Introduction to Literary Theory\n\nResponse Paper\nLength: 2-3 pages, double-spaced, 12 pt font, Times Roman or equivalent\nThis short essay gauges your engagement with issues raised by the three critical\nparadigms studied thus far, to wit, New Criticism, Reader Response, and\nStructuralism. I would like you to develop a coherent response to one or more of\nthese interpretive approaches, by focusing on an aspect that intrigued you in the\nreading(s) you select. I don't expect an extended summary of one or all of these\nmethods; rather, I want you to select a moment or an extended quotation or a\nconceptual turn or something dissonant in whichever reading(s) you choose, and\nspend a few pages developing a coherent response to that element. Be specific, cite\nyour texts judiciously, and let your mind play with ideas raised by the readings.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 Elementary Structures Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/c0bec4f1916c786ae1e4770d5f2c83a6_MIT21L_451F14_Notes_5.pdf",
      "content": "Basic Question:\n\nHow to rescue the nature/culture distinction in view of the fact that \"it is impossible to\nrefer without contradiction to any phase\" in mankind's evolution where cultural activities\nwere present without \"any social organisation whatsoever.\"? That is, given that\nhistorically (de facto) nature and culture seem always intertwined, can one preserve that\ndistinction de jure (or logically).\n\nThe answer will be to argue that despite the fact that there is no de facto (historical) line\nto be drawn, the distinction does \"contain a logic, fully justifying its use...as a\nmethodological tool\" (3).\n\nPosing the problem:\n\nClearly the general distinction can be made in certain cases (papillary reflex versus the\nposition of riders hand on reins, for example), but in most cases this distinction between\nnatural and cultural causes is difficult to establish, and even the causes themselves\nrepresent an integration of biological and social.\n\nOne method of analysing the general distinction might be to see if there is a level of\nnature \"below\" the level of culture, so that the cultural can be seen as being grafted upon\nand integrated with behaviour that is biological in nature. This fails, not only because it is\nimpossible to isolate and maintain a human organism in its purely \"natural\" state\n(newborn), but because man has no natural \"species behaviour\" to which he can be said\nto revert when the constraints of culture are lifted.\n\nAlternatively, one might seek to see if there is level of culture \"above\" the level of nature\nby looking at \"superior levels of animals\" to see if they exhibit attitudes that indicate the\n\"outline of culture\" (5). One cannot look at organised insects (such as ants), since here the\nnatural dominates to the extent that all group behaviour is in a fundamental sense\nbiological, designed to ensure survival of both individual and species. So, need to turn to\nsuperior mammals to see if there is any indication of the beginnings of a universal\ncultural model (language, tools, social institutions, aesthetic, moral and religious values).\nHere research (1) indicates that despite the presence of certain basic components of a\ncultural model, what is truly striking is the discontinuity between rudimentary outline and\na truly universal cultural model: impossibility of developing the rudiments beyond the\nrudimentary (2) shows, moreover the impossibility of drawing general conclusions from\nexperiments since their social life \"does not lend itself to the formulation of any norm\"\n(6).\n\nThe \"solution\":\n\nThe discussion of superior mammals does, however, yield another possible criterion,\nalbeit a negative one: that the absence of rules is the surest criterion for distinguishing a\nnatural from a cultural process. Now, one cannot move from natural regularities and\nconsistency (the domain of biological heredity) to that of cultural regularity (external\n\ntradition). But, there does seem one way out: to posit as the most valid criterion of social\nattitudes \"the presence or absence of rules in patterns of behaviour removed from\ninstinctive determination\" (8). Thus, while the mark of the cultural can be seen in the\npresence of rules, the mark of the natural can be identified by universality which exceeds\nthe scope of customs. Thus, this double criterion of norm and universality is what allows\none to distinguish natural from social. \"Let us suppose then that everything universal in\nman relates to the natural order and is characterized by spontaneity, and that everything\nsubject to a norm is cultural and is both relative and particular\" (8).\n\nThe Scandal:\n\nThe prohibition of incest \"presents, without the slightest ambiguity, and inseparably\ncombines the two characteristics in which we recognise the conflicting features of two\nmutually exclusive orders\" (8). The prohibition of incest \"doubles the spontaneous action\nof natural forces\" through the contrasting rules of social prohibition. It has the aura of\nbeing natural, and indeed, the magical fear associated in many cultures with natural\nphenomena, and yet it is through and through cultural. Not simply (like language) that\none can hypothesise a universal natural component and a specific cultural manifestation,\nbut that it is through and through natural (universal) to the point that one cannot but see\nits transgression as \"a monstrum\", and simultaneously through and through cultural in the\nutter variability of its limits from society to society. \"This rule is at once social, in that is\na rule, and pre-social, in its universality and the type of relationships upon which it\nimposes its norm\" (12)---that is it is everywhere and it regulates sex, the natural\nbehaviour par excellence, while at the same time being the one [?!] instinct requiring the\nstimulation of another person.\n\nLevi-Strauss therefore proposes a \"dynamic synthesis\", insisting that the incest taboo is in\nits origin neither purely cultural or purely natural, nor does it simply mix elements from\nnature and culture. Instead, \"it is the fundamental step because of which, by which, but\nabove all in which, the transition from nature to culture is accomplished\" (24).\n\nUniverse of Rules:\n\n(1) \"Even if the incest prohibition has its roots in nature it is only in the way it affects us\nas a social rule that it can be fully grasped\" (29).\n\nThe crucial point here will be the distinction between the fact of the incest prohibition\nand the particular form or content of that prohibition. In its form or content the\nprohibition is less concerned with consanguinity per se, than the social phenomena by\nwhich two unrelated individuals are classed as 'brothers', 'sisters', 'parents', or\n'children.' The second important point has to do with the difference/relation between the\nincest prohibition (ban on marrying inward) and the rule of exogamy (pressure to marry\noutward). Thus, even if natural, incest taboo (a) can be grasped only as a social rule and\n(b) is less concerned with biological consanguinity than \"social\" consanguinity (what a\nparticular society considers, for example, to be brotherhood or sisterhood). [The complex\nconfiguration of incest taboo (the prohibition on certain relationships) and exogamy (the\n\nencouraging of certain relationships)]. In this sense, the transition marked in the incest\ntaboo concerns the movement from the \"natural fact of consanguinity\" to \"the cultural\nfact of alliance\" (30).\n\n(2) Both Culture and Nature are characterised by a double rhythm of receiving and\ngiving, but these are not displayed in the same way in both these spheres. L-S's formula is\nthat in nature the individual can only give what it has received (heredity), whereas culture\nmeans that individual \"always receives more that he gives [education], and gives more\nthan he receives [invention]\" (30).\n\nNatural movement of giving and receiving (descent and marriage): one, biological kinship\nwhereby the child receives heredity (genetic) from parents---here, culture plays no part.\nWhatever the parents are, such will be the child. Receiving qua biological kinship) is\noutside the cultural domain and culture thus has a minimal effect upon it. Two: In the\ncase of marriage, however, that is, sexual relations, nature assigns to each individual\ndeterminants transmitted by its parents, but says nothing about who these parents should\nbe. Nature requires the fact of marriage (you have to marry) but does not specify its\nparticular determination (who is to marry whom).Thus, while heredity is doubly\nnecessary from the point of view of nature---as law, there have to be two parents of\ndifferent sex; and as specification of law, one will be like one's parents---in the case of\nmarriage, nature simply affirms the law without specifying its contents (who should\nmarry whom). Nature thus has a single principle of indetermination: the arbitrariness\n(conventionality) of marriage.\n\n(3) \"Considered from the most general viewpoint, the incest prohibition expresses the\ntransition from the natural fact of consanginuity to the cultural fact of alliance\" (30)\n\nIf nature is historically anterior to culture, \"it can only be through the possibilities left\nopen by nature that culture can place its stamp upon nature and introduce its own\nrequirements without any discontinuity\" (31). \"Culture, although it is powerless before\ndescent, becomes aware of its rights, and of itself, with the completely different\nphenomenon of marriage, in which nature for once has not already had the last word.\nThere only, but there finally, culture can and must, under pain of not existing, firmly\ndeclare \"Me first,\" and tell nature, \"You can go no further\" (31).\n\nThe aversion towards incest is cannot be a purely natural phenomenon (since it would\nthen have to be either anterior or independent of culture, and unaffected by it). \"This\nproblem [of articulating the two orders of nature and culture] becomes clear when\nnature's indifference to the modality of relations between sexes is acknowledged,...for it\nis precisely alliance that is the hinge, or more exactly the notch where the hinge might be\nfixed. Nature imposes alliance without determining it, and culture no sooner receives it\nthan it defines its modalities. The apparent contradiction between the regulatory character\nof the prohibition is thus resolved. The universality merely expresses the fact that culture\nhas at all times and all places filled this empty form, as a bubbling spring first fills the\ndepressions surrounding its source\" (31-32).\n\n(4) The incest taboo is important as a fact independent of its modalities: \"The fact of\nbeing a rule, completely independent of its modalities is the very essence of the incest\nprohibition...The prime role of culture is to ensure the group's existence qua group, and\nconsequently, in this domain as in all others, to replace chance by organisation. The\nprohibition of incest is a certain form, and even highly varied forms, of intervention. But\nit is intervention over and above anything else; even more exactly, it is the intervention\"\n(32)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 F14 Saussere Structuralism Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/fc75f093be3f1c68e8183b416488dbef_MIT21L_451F14_Notes_4.pdf",
      "content": "Saussure:\nBegins with the distinction between events in the physical world and social events:\nfor the latter, their meaning is crucially part of what they are. If one sees an action as\nimpolite, then this is a social fact which concerns one and cannot be ignored. So, to\nanalyse human behaviour one must be concerned less with events themselves than\nwith events that have meaning.\nHowever, rather than tracing the historical causes of individual events, we must\nfocus on the functions events have with a general social framework, treating social\nfacts as part of a system of conventions and values. Will return to these key terms.\nSaussure thus focuses on an underlying system rather than individual causes. In so\ndoing he questions the very foundation of linguistics. If you make a noise and at\nsome other time I make a noise, under what conditions would we be justified in\nsaying that we had uttered the same words? How do we know the utterances are the\nsame? [they sound different, don't they?]\nLanguage as a system of signs: for noises to communicate ideas they must be part of\na system of conventions which relate sounds to ideas. Otherwise they are just noise.\nIt is this union of sound and idea (or as Saussure says, sound image and concept)\nthat is called a sign, re-naming them\nsignifier-signified = sign\nWhile we speak of these as separate, they exist only as components of the sign,\nwhich is therefore the central fact of language. So, what is a sign? What are the\ncharacteristics of the sign? What is its nature?\nArbitrary nature of sign\nRelationship between signifier and signified is an arbitrary one: there is\nno intrinsic connection. So far, not very interesting. But, as Saussure puts it, \"it is\noften easier to discover a truth than to assign it its rightful place\". (965) So what is\nthe rightful place? [Possible exceptions: onomatopoeia and compound words]\n(a) Language is not a nomenclature (contrast: biblical naming) for universal\nconcepts. If this were so, translation would be easy. Each language articulates its\nconceptual universe differently.\n(light and dark blue in Russian, connaitre and savoir in French) They\ndo not simply name existing categories but articulate their own.\n(b) Concepts evolve just as much as signifiers do: if language were a set of\nnames applied to independently existing concepts, then in the historical evolution of\na language, the concepts should remain stable, even if signifiers evolved. But this isn't\nso: Cattle property in general-four footed property -- domesticated bovines.\nSillyhappyblessedpious\"silly\" in our sense.\n\nImplies there is no core of meaning a signified must retain in order to\ncount as the proper signified for a particular signifier. Both signifier and\nsignified are arbitrary, both can change, and there is no intrinsic reason why\none particular signifier attaches to one particular signified. But, then what\ndefines a signifier or a signified?\nSo what defines a signifier or signified? Answer: Because they are arbitrary\ntherefore they are both purely relational or differential entities.\nBecause they are arbitrary they are relational. This is a crucial and tricky idea.\n(a) Language sets up an arbitrary relationship between signifiers of its own\nchoosing and signifieds of its own choosing: each language cuts up the conceptual\nplane differently. For example, we all need ways of talking about flowing bodies of\nwater, but how we divide up that universe can be radically different.\n(River/stream in English depend upon size, but the French words fleuve and riviere\ndepend not only on size but on direction of flow, the former flows into the sea, the\nlatter does not).\n(b) Since these are arbitrary divisions of a continuum, they are not\nautonomous identities that have some kind of essence: Rather, they are part of a\nsystem and defined in relation to other members of the system (stream, river,\nrivulet, tributary etc.) (Colour terms: Brown: can't just show someone brown objects,\nbut need to show him reds, yellows etc)\n\"in all cases then we discover not ideas given in advance but values emanating\nfrom the system. When we say that these values correspond to concepts, it is\nunderstood that these concepts are purely differential and not positively\ndefined by their content, but negatively defined by their relations with other\nterms of the system. Their most precise characteristic is that they are what\nothers are not.\" (p. 970)\nTwo related elements here: 1/ differential relations 2/value\nRelationality: Sounds vary (how I say bed isn't how you say bed) How far\ncan it vary? Quite a bit, so long as it doesn't get confused with bud, bid, bod,\nbode, bread, blead, dead, fed, head, bet, bell etc. The distinctions are what are\nimportant: linguistic units have a purely relational identity (8:25 Geneva to\nParis express).\nNormally, when we think of differences, we think of two terms that differ, but\nSaussure is arguing that signifiers and signifieds are not things in this sense,\nthe actual material sounds that make up signifiers don't define them, rather\ntheir relation to other signifiers is what matters (if I were systematically to\nexchange bed for pet throughout the language, the language would clearly be\nexpressed differently, but it wouldn't change: thus a difference between\nlanguage system and the actual realisation, to which I shall return)\n\nAnother example, The 10:25 Paris to Geneva express (its identity is its place\nin the timetable)\nNow, this means that we are distinguishing between the units of the linguistic\nsystem and their actual physical manifestations or realisations. This leads to\nthe notion of value and the crucial distinction between Langue and Parole.\nValues: The distinction between system and realisation is crystallised in the notion of\nvalue, which is something like \"Systemic meaning\", a property not of actual\nutterance, but of elements of an underlying linguistic system. The distinction\nSaussure employs is between value and signification: Linguistic units have a value\nwithin the system, a meaning which is a result of the oppositions that define them;\nbut when these units are used in an utterance, they have a signification, a contextual\nrealisation of or manifestation of meaning.\n-J'ai vu un mouton/I saw a sheep: same signification, but different\nvalues,since sheep is animal as opposed to mutton (meat), while French has\nno such distinction. In other words, two kinds of meaning: meaning as the\nproperty of an utterance (signification), and meaning as property of relations\nwithin linguistic system (value).\n-Pronouns: I am tired (refers to me), but reference is not part of meaning of\nsentence qua system, since someone else can use it to refer to him/herself\nIn other words, there is a kind of relational meaning based on system and another\nbased on actual use----> leads to Langue vs Parole\nSystem of Language versus actual speech\nlangue as set of forms which speaker internalises, parole as actualisation\nlangue as institution, parole as event (selection and combination---a problem here of\nwhere to locate syntax: forms/combination ~= linguistic faculty/exercise of faculty).\nBut importantly, isolates the object of linguistic study: La Langue.\nDistinction between Phonetics and Phonology, one studies the sounds, the other the\nunderlying system of oppositions that \"bear\" meaning, that is, functional differences.\nSynchrony vs Diachrony\nStudy of language at a particular time/ Historical evolution. Saussure has been\naccused of forgetting that language is contingent and temporal, but this doesn't quite\nget at his radical historicity: he argues that facts about linguistic system and facts\nabout linguistic evolution are categorically different, belong to two different orders of\nevidence, which must be separated analytically from one another.\nIf some essential connection between signifier and signified, then we could identify\nsome unchanging essence and oppose it to the accidental features that change. But\nthere is no such core: arbitrariness means that the sign is totally exposed to history,\n\nthe combination of signifier and signifed at any point is a contingent historical result.\nBut because there is no core that persists, it has to be defined through its relations to\nother elements. And the relevant relations are those that obtain at a particular time\n\"System of pure values which are determined by nothing except the momentary\narrangement of its terms\". Historical tracing of elements, therefore, are irrelevant to\nlangue ((object) you, ye (subject), thee (object) thou (subject but pl)--this is irrelevant\nto understanding place of you in current system.) Not a matter of elements changing\nover time, rather a matter of systems changing. Historic filiations are thus derived\nfrom synchronic, not the other way around. Diachrony: facts and therefore change\noccur outside system of langue (in parole) and then trigger systemic changes within.\n(see plurals example):\n+/- i = Functional opposition that bears a systemic meaning of \"plural/singular\"\n+/-i and o/e: shift from o to e wherever i followed a stressed syllable (even in verbs,\nfor example), which just happened to affect certain plural forms creating a\n\"redundancy\" (two oppositions instead of the earlier one)\nDropping of the i: again, not limited to plurals creates the situation in which the\nfunctional opposition bearing the plural/singular meaning shifts.\nThere are no positive self-defined elements with which to start. To identify two\ninstances of the same unit, we have to first contruct a formal and relational entity by\ndistinguishing differences that are functional and those that are not functional. Once\nwe have defined the relations delimiting signifiers, on the one hand, and signifieds,\non the other, we have things we can speak of as positive identities (signs), but they\nare entities that emerge from and depend upon a network of differences which\nconstitute the linguistic system at any given time.\nSyntagmatic/Paradigmatic.\nLinguist is thus concerned with relations: identities and differences. Leads to two\nsorts of relationships: (a) those oppositions that produce distinct and alternative\nterms (such as bet/pet, foot/feet) and (b) those relations that combine sequentially\n(cannot substitute for one another, as it were).\nOn the one hand, then, oppositions which produce distinct and alternative terms\n(associative or paradigmatic) (foot vs feet) and relations between units, on the other\nwhich combine to form sequences (syntagmatic). Elements are defined both in\nrelation to what can take its place and what can follow or precede it: And this takes\nplace at each level of the structure.\nPhonetic level: p + et (met, bet, net, set) or pl, pr, or sp.\nMorphology: noun partly defined by suffix and prefix relations (syntagmatic)\nfriendless, friendly, unfriendly, befriend, friendship, but not disfriend, defriend\netc.(syntagmatic), while paradigmatic contrast between the morphemes that\ncan replace one another (some at end, some at beginning). ---ship\n(friend/lecturer etc)\nSyntax, he frightened can only be followed by certain types of structures, which are\nparadigmatically related.\n\nStructuralist view of language:\nLanguage is a system of elements defined through their relation to one another\nwithin the system\nLinguistic system consists of different levels of structure, at each of which we can\nfind contrastive relations and combinatory relations between elements, allowing\nhigher level units, but the principles of structure at each level are the same.\nLanguage as social: social relations precede individuals. One must first grant that\nthere is a social reality and that man lives among objects and actions that have\nmeaning, and these meanings are not just subjective perceptions. What makes\nindividual experience possible? What enables them to cooperate with meangful\nobjects? To communicate and act meaningfully? Inversion: individual behaviour\nmade possible by internalised social systems. So what you study are the underlying\nsystems of norms (structural rather than causal explanations: why a particular\naction has significance by relating it to the underlying functions, categories, and\nnorms which make that action possible).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 Notes on Zizek's Graphs",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/8c726e1f0e457503404c1cff4dfe0775_MIT21L_451F14_Notes_9.pdf",
      "content": "Notes on Lacan/Zizek\n\nQuilting point (point de capiton):\n\nThe Lacanian notion of quilting fundamentally concerns the problem of the\n\"subjectivisation\" of reality, that is, how does the historical and social reality one inhabits\nbecome internalised and experienced? In what way does social world in which I am\nbecome something comprehensible to me, something that has an identity or unity for me,\nas an individual experiencing the world in which I am. And here the Lacanian answer is\nthe reverse of the \"commonsensical.\" One's first response might be to say that socio-\nhistorical reality takes on unity and identity because of something \"in\" that reality,\nbecause of \"meanings\" already there, which one then integrates into an already existing\n\"I\", thereby creating a connection between self and world. The Lacanian answer,\naccording to Zizek, is differently directed: socio-historical reality is this formless morass\n(the \"real\" as it were), there is no there there, nothing in it that has a coherent essence or\nform, it's a bit like the child before he sees his image in the mirror and becomes through\nthe image, an ego. In order for self and a reasonably coherent world for the self to\nemerge, the \"signifier\" has to act on \"reality\" for the subject, has to reach into reality to\nrecreate as something meaningful for the experiencing subject (who, too, comes into\nexistence as a particular kind of subject through that operation). This operation is\n\"quilting.\"\n\nThus, we can conceive of the ideological space of society as being made up of non\nbound, non tied elements, floating signifiers that are over determined---that is, are\ndetermined or delimited in different autonomous ways depending on which \"chains\" they\nparticipate in--- by articulation in a chain with other elements. Their \"meaning\" is\nundefined because defined through different kinds of differential relationships. In\nSaussure's terms, these signifiers have a \"value\" but no immediate signification or\nmeaning in themselves. Through quilting this free floating is halted and fixed: the\ndifferent terms become parts of a structured network of meaning, and thereby each\naccrues its own \"signification,\" a signified corresponding to the signifier drops out.\n\nExamples: democracy, freedom, feminism, ecologism, peace movement as floating\nsignifiers. Quilt through the \"master signifier\" Communism (=class struggle) and each of\nthese takes on a precise signification:\ndemocracy becomes the demand for a \"real\" democracy (as opposed to the\ncapitalist- bourgeois formal democracy); feminism becomes exploitation of\nwomen from class conditioned division of labour; ecologism points to the\ndestruction of natural resources through capitalist exploitation of nature; war\ncomes to stand for a result of adventuristic imperialism and so on.\n\nThe quilting point is thus the nodal element that retroactively confers meaning on the\n\"subject\" once he/she gets \"sewn\" to it. This does not necessarily mean consciously\n\"choosing\" to be sewn to it. No doubt, one could choose in a sense---for example, if\nChristianity is consciously \"chosen,\" God/Christ becomes the master signifier that quilts\n\nin order to create a consistent universe for the subject. However, the main point is that\nsuch a quilting exceeds consciousness, for the quilting operation marks the way in which\nsubjective experience itself is structured, takes on consistency and shape. That is, beyond\nthe conscious choice of \"God,\" one has to reach the moment of faith or belief that\nexceeds the conscious choice: it is that moment of interior transformation, so to speak,\nthat quilting speaks to.\n\nCrucially, for Lacan/Zizek, this quilting occurs through a pure signifier (indeed,\nultimately a master signifier, though for the human subject specific local signifiers\nmediate the route to the ultimate signifier which gives the field of location its unity). As\n\"a word, on the level of the signifier itself which unifies a given field, constitutes its\nidentity: it is the word to which \"things\" themselves refer in order to recognise\nthemselves in their unity.\" Mass media symbols are Zizek's examples:\n\nThus (1) Think of the Marlboro ad: connotes a certain image of America---wide\nopen spaces, cowboys on horse back, freedom etc. This is the \"content\" it projects. But\nquilting occurs when \"real\" americans start identifying themselves (in their ideological\nself-experience) with the image, that is to say, they internalise the image as what America\nis, and by so doing they create \"America\" as Marlboro country, and themselves as\n\"Americans\" whose desire is what the Marlboro country now seems to embody.\n\n(2) Similarly Coke connotes a certain vision of America through its\n\"content\" (the freshness, cold taste etc.), but point is that at the moment of quilting, it is\nrather that a vision of America itself achieves its identity by identifying with the signifier\n\"Coke\". Coke itself is in this sense, utterly empty, it has no content, but through Coke,\nAmerica becomes America. Hence, to the question What is coke?, we can answer with\nCoke's own slogan: Coke is \"it\"! This undefinable \"it\" points to that \"undefinable,\" that\n\"surplus\" that Coke is meant to have, it is directed at, to quote Zizek, \"what is in the\nobject more than object.\" the pure material signifier. In City Lights, the tramp is nothing,\nan outcast, lacking a social position (\"a symbolic mandate\"), and yet through the empty\nsignifier of the car door slamming, he becomes for the girl associated with a position in\nher fantasy space (of the Prince Charming), and it is towards this imagined object that her\nblind gaze is directed---it is what is in the tramp more than tramp, and \"it\" needs the\nsupport of material signifiers, bits of the real that are themselves empty, slamming car\ndoors, food, wool etc.\n\nThus, the experience of a given historical reality (an approximation to the \"real\") can\nachieve unity (become something) only through the agency of the signifier. It is not the\nreal object that guarantees as point of reference the unity of a certain ideological\nexperience, but the pure signifier that gives identity to our experience of historical reality.\nAnd this unity is supported by some pure, meaningless signifier, without a signified. This\nhalts the metonymic sliding of the field of the signified by \"representing, within the field\nof the signified, the agency of the signifier.\" It's signification coincides with its own act\nof enunciation: it is a signifier without a signified. So, now to the graphs\n\nRetroactivity of Meaning (Graph 1)\n\nThis graph essentially replaces the Saussurean image of the relationship between\nsignifiers and signifieds, that Saussure envisaged as an articulation, a cutting and jointing,\nacross two parallel internally undifferentiated levels, those of \"sounds\" and \"meanings,\"\nthereby creating two differential systems without positive terms that were mapped on to\none another. Lacan reads the emergence of the signifier-signified relationship differently,\nfrom the point of view of the signifier, one might say, for signifieds emerge in this graph\nthrough the agency of, as the effects of, the signifier. What we have, on the one hand, is a\nrealm of floating signifiers, the S---S' curve, a system of differential relations without\npositive terms (the symbolic order); on the other hand, we have that undifferentiated\nmorass of instincts, proto-meanings, \"pre-symbolic intentions\" that make up the human\nbeing. To communicate these to someone else, the human being has to enter into\nlanguage, the system of signifiers (S---S') that exists outside it, and this entry, crucial for\n\"meaning\" and \"communication\" entails a transformation of those pre-symbolic\nintentions, and in a manner that has consequences for the human being attempting to\nexternalise those intentions. For meaning to emerge, it must be a meaning for a subject,\nthat is, there must be a process of subjectivisation through which subject and the meaning\nfor that subject come into being: and this is the process of quilting. So:\n\n1. A \"pre-symbolic intention quilts the signifier's chain: the product of the\nquilting is the \"barred subject\" and the empty or effaced signifier in the signifier's\nnetwork.\nExample: Althusser's notion of interpellation. Some individual \"X\" who must be\ninterpellated into a Subject via a signifier. When that individual responds to the\ncall (\"Uncle Sam wants you!\"), when he takes up the position of addressee, he\nchanges from an individual into someone who has a particular place in an\nintersubjective network. The pre-symbolic X becomes a \"you.\" But this moment\nis also a moment of a splitting of the subject, because he identifies himself or is\nidentified through the agency of the signifier (the \"you\" that Uncle Sam wants)\nwith a positional location that he can never be quite identical with, even if he sees\nhimself from this point on as a \"being\" who is the \"you.\" Thus he is a split or\nbarred subject, and the \"empty or effaced signifier\" \"you\" takes on the special\nstatus of being the signifier through which he has been quilted into the symbolic\norder. The point de capiton is that point through which the subject is \"sewn to the\nsignifier, and at the same time the point at which the individual is interpellated\ninto subject by addressing it with the call of a certain master signifier (God,\nCommunism, America).\"\n\n2. Quilting is a retroactive operation, hence the direction of quilting is backwards.\nThat is, the signified \"stays behind\" with respect to, comes after, the signifier. Thus,\nsignifiers are floating, unfixed, and at some point \"intention\" pierces that chain, and only\nafter it does, do we have a signified, or meaning.\nFor example, in City Light's, the flower girl's call asking whether he wants to buy\na flower, which Chaplin hears and responds to, is a moment through which\nChaplin's \"meaning\" as a subject for her (and for him) is constituted. Prompted\n\nby an arbitrary signifier (the car door slamming), her call demands his response,\nand by responding he sews himself to that signifier, and by so doing becomes for\nher what the signifier claims he is, a rich man stepping out of a car. Had he not\nresponded, the signifier would just return to itself, a noise among other noises, but\nhis response pierces that chain of noises, halts its sliding by attaching him\n(herself) to the signifier, and out of that halting he is precipitated out retroactively\nas the signified (the rich man, soon to become the Prince Charming of her\nfantasy)\n\n3. The Quilting operation (Capitonnage) hides its traces (or the transferential\nillusion). This final step marks the shift from this first graph to the next one. The\ntransferential illusion is the fact of the subject's misrecognising the process whereby he\ncame to be a subject, his not seeing that he only became who he now is through the\noperation of the signifier to which he got quilted. Instead, the subject believes that this\nretroactively created \"being\" was what he has been all along, that it is his immutable\nessence, in other words, he misrecognises the split in himself, covers it up to believe that\nhe is whole, and wholly present to his intentions. It is thus the illusion that the meaning of\nan element, which was fixed by the intervention of the master signifier (the sound of the\ncar, the money Chaplin gives the girl for the flowers), was present from the very\nbeginning as an immanent essence: thus Chaplin takes on as his symbolic mandate the\nidentity conferred upon him by this moment (that of the Prince Charming, the object of\nthe girl's desire, the rich benefactor) as if this were in reality his hidden essence.\nOutwardly I may look like a tramp, he seems to say, but on the inside, in my essence, I\nam pure gold, the man who will save you and become thereby in reality what you want in\nyour fantasy. [The split subject that results is thematised in the film by being projected\nonto the millionaire, who ironically \"recognises\" Chaplin when he, the millionaire, is not\nhimself (i.e., drunk), but fails to recognise Chaplin when he is sober. Or, to put it another\nway, misrecognises Chaplin as like him, as his friend when drunk, but recognises him as\ntramp when sober.] This misrecognition of the self and how it came to be is the\ntransferential illusion. It is the way in which America becomes for some American's\nMarlboro country, whereby the ideological experience of America created by the ad is\nmisrecognised as the pre-existing reality which the advertisement copies or points to.\n\nRetroversion (Graph 2):\n\nBefore moving to this graph, I should perhaps add another analogy that might\nhelp you understand the logic of the first graph. It seems to me that one can grasp the\nlogic by seeing a parallel between the process described in the graph and the imaginary\nformation of the ego. Let us, in the mirror stage, equate (1) the child who is simply a\nloose conglomeration of impulses and needs---unformed as yet as an 'I'---with 'delta,'\nthe pre-symbolic intention, and (2) the image in the mirror as the empty signifier to which\nthe child gets \"sewn.\" Then, we have the retroactive emergence of the child's \"meaning,\"\nthe \"I\" of the child. via an identification with the image (the empty and effaced signifier)\nthat promises to him his future unity and identity as a being (its ideal-ego). What emerges\nthereby is the child's \"meaning\" (the child's 'I') and the child itself as a split or barred\nsubject in the moment of its constitution. The transferential illusion would be the moment\n\nof misrecognition wherein the child sees its unity and identity has having been its essence\nall along, so that the image becomes simply the inessential copy of what had always been\nthere (rather than that essential signifier through whose agency alone the child achieved\nits experiential unity or identity). [This analogy is somewhat loose, because strictly\nspeaking the Lacanian graph is focused on the operations of symbolic insertion rather\nthan imaginary insertion, but it may be useful in understanding the logic of the Lacanian\ndiagram, and indeed to some degree explains the shift from delta to S-bar, below]\n\nWhat Lacan (according to Zizek) adds in this second and more developed graph is\nthe (a) the specification of the two points at which \"intention\" cuts the chain: O and s(O),\nthe Big Other and the Signified as its function; and (b) the lower parallel line of the\nimaginary process, spanned by i(o) and e(o), that supports the insertion into the symbolic\norder represented by the Big Other and the Signified. That is, we have here, the process\nof subjectivisation, the emergence of the subject, specified through the registers of the\nSymbolic and the Imaginary.\n\nIn this rendition, the Point de Capiton represents or holds the place of the Big\nOther, it stands for the synchonous code of the symbolic order in the diachronous\nsignifier's chain. It suggests that the Big Other is embodied in a singular element, a\nsignifier, whereas meaning (the subject's being) retroactively emerges as a function of\nthe Big Other, drops out after the fact, retroactively, as s(O). This is basically just\nrestating in more specific terms the description of Graph 1. So what else is added here?\nWhat else is changed in this graph with respect to the prior, more primitive version?\n\n(1) Delta becomes S-bar, the split or barred subject: This change incorporates\nwhat Zizek terms the transferential illusion: so that rather than a pre-symbolic\nintention, we have the subject itself (who thinks of its essence as something it\nalways had) as that which pierces the signifying chain. By so doing it experiences\nsomething that happens to it and that changes it, as what was there all along. The\nproduct of this quilting is now what Lacan calls the symbolic identification: I(O),\nwhich is the identification of the subject with some trait (I) in the big Other. The\ntrait (I) is what represents the subject for another signifier, the name or mandate\nthat the subject takes upon himself or that is bestowed upon him (as in the tramp\nwanting to be the millionaire, the prince of her dreams, the one who will bring her\nto see and to love him). More on symbolic identification below.\n\n(2) The term Voice added to the signifier's chain: This is not particularly crucial\nfor our purposes, but I'll cite Zizek's rationale all the same. Voice here is not seen\n(as Derrida might see it) as representing presence, as a bearer of plenitude and\nfullness of being. Rather, voice stands for a meaningless object that remains after\nthe operation of quilting or signification, it is the left over objectal remnant of the\nsignifying operation, an inert meaningless drone. City Lights actually provides an\nalmost literal instance of this in the opening scene, when the symbolic order\ngathers to unveil the symbol of the city's prosperity, the statue. That signifying\noperation (which will be interrupted by the stain of the tramp, whose very\npresence gives a lie to the symbolic claim of the unveiling) has as its leftover the\n\ndrone of voices: the mechanical, incomprehensible gibberish that the mayor and\ndignitaries spout before the raise the curtain on the statue. That drone interrupts\nthe \"silent film,\" functioning as a grotesque staging of \"sound,\" reminding us of\nthe emptiness of the symbolic order itself, the leftover of its creation of meaning\nthrough symbols.\n\n(3) The distinction between i(o) and I(O), imaginary and symbolic identification:\nThe lower level of imaginary identification specifies the way in which meaning is made\ninto meaning for the individual subject, that is, signification requires a point of view, a\nconsciousness (if you will) for whom meaning becomes present as its meaning, an\nexperiencing ego. In this sense, the symbolic operation of signification has to be\nsupported by the level of the imaginary, which is the only way by which meaning can be\npresent to someone, so that s/he is the one for whom that meaning exists. That process is\nexemplified by the mirror stage, the imaginary identification connecting the ego to its\nimaginary other; it is the process whereby we constitute ourselves through the image\nreflected back to us from someone else. Now, crucially, this imaginary relationship to the\nideal ego---suggesting a subject already born of a split---is mediated by the symbolic\nrelationship to ego ideal, that is, the symbolic identification determines the structure of\nthe space within which imaginary identification occurs, and in this sense it shapes the\n\"imaginary.\" This is in part the point of Lacan's reading of \"The Purloined Letter\": that\nthe subject in his very being, in the imaginary relationships through which he experiences\nhis place in the world, is fundamentally shaped by the symbolic order, represented by the\nletter, the allegory for the phallus, itself the signifier which stands in for the Big Other.\nAt the same time, this imaginary level supports the structure: it marks the illusion\nof the self as an autonomous agent present to itself from the very beginning, and one who\nat the same time in its imaginary self-experience misrecognises (or is blind to) its radical\ndependence on the Big Other. In a sense, this is what Chaplin plays out throughout the\nfilm in the very failure of his various attempts to gain money: attempting to fill out the\nsymbolic space of the rich man, to be adequate to that role, he can only do it by acquiring\nthe money (the master signifier) he needs to be a benefactor to the girl. And to do this, he\ntries to earn money in different ways, but repeatedly fails, each failure underscoring the\ngap between the symbolic mandate and the level of self-experience: you identify with the\nrich man, but it turns out that all you really are is a sweeper of dung, a boxer, and indeed\nyou fail at all those, so really you are nothing at all, unsupported by the symbolic order,\nsimply a tramp (as he is at the film's end).\n\nSo, what is the difference between symbolic and imaginary identification? Zizek\ndescribes this as the distinction between \"constituted\" and \"constitutive\" identification:\n\"Imaginary identification is the image in which we appear likeable to ourselves, that is\nthe image representing what we want to be, whereas symbolic identification is the\nidentification with the place from where we are being observed, the place from where we\nlook at ourselves so that we appear to ourselves likeable, worthy of love.\" To specify\nfurther: Imaginary identification is always the identification on behalf of a certain gaze in\nthe other, so that with every imaginary imitation of a model image (pop singers, teachers,\nwhatever) one indentifies oneself (postively or negatively) with an ideal that one wants to\n\nbe. But the additional question to be asked is \"for whom is the subject enacting this\nrole?\" \"Which gaze is being considered when the subject identifies himself with a certain\nimage?\" And the answer is often something quite different from the explicit point of\nidentification. Thus, take, for example, the classic \"hysteric female,\" whose theatrical\noutbursts might be said to show that she is offering herself to the Other as the object of its\ndesire. But who, which specific subject, embodies for her this other? As it turns out,\nbehind the female imaginary figure of identification (the ideal ego), lies the symbolic\npoint of the paternal gaze: fragile femininity turns out to be symbolic identification with\nthe father, in the sense of fashioning oneself in order to be the object of his desire.\n\nAnother example: Chaplin's sadistic attitude towards children: teased, mocked, laughed\nat etc (often, as in The Kid, Modern Times etc.). This would be the level of \"imaginary\nrepresentation\": the tramp identifies as victim with the children who are being teased,\nmocked at, and so on. But through whose gaze must we look at children in order to see\nthem as objects to be teased and mocked rather than as beings needing protection. Zizek\nclaims that it is indeed from the gaze of the children themselves (for only children treat\neach other in this way, only children act without apprehending the others as full human\nbeings, only children tear wings of dragon flies). The sadistic distance from children that\nthe social world of Chaplin's films repeatedly emphasise implies, consequently, a\nsymbolic identification with the gaze of the children themselves. Indeed, City Lights\nbrings out the sadism of the child through the figure of the two boys selling newspapers,\nwho mercilessly pick on Chaplin over the course of the film.\n\nThe Forename as point of ego-identification versus the last name or patronymic as\nsymbolic identification, marking the name of the father: i(o) always subordinated to the\nI(O), so that the symbolic identification dominates and determines the image, the\nimaginary form in which we appear to ourselves as likeable, it creates the space within\nwhich imaginary identication functions. To put it another way, imaginary identification is\nimitation at the level of resemblance, while symbolic identification with the other occurs\nat the point at which he eludes resemblance, at which he is inimitable. [Woody Allen's\nPlay it again sam is Zizek's example her: as long as the protagonist, played by Woody\nAllen, is weak, he neads the ideal ego, and thus identifies with the Bogart in Casablanca--\n- but not thereafter. But the film carries out a distinctive subversion: for becoming an\nautonomous person is true identification with Bogart, that is, a symbolic identification\nrather than an imaginary one. So that he ends up identifying with Bogart not as model,\nbut as symbolic mandate: by identifying with Bogart's role in Casablance (sacrificing a\nwoman for a friend, and so on, that is, by living in real life what the character played by\nBogart lives through in the film). This symbolic identification 'dissolves' the imaginary\nidentification, restructures it: consequently, rather than aiming to be the filmic hero that is\nBogart (cool and with it), he can now identify imaginarily precisely through the ugliness,\nthe smallness, etc.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21L.451 Structure, Sign and Play Notes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-451-introduction-to-literary-theory-fall-2014/714d1a9ff2b3de108b295739f3774b9e_MIT21L_451F14_Notes_6.pdf",
      "content": "Derrida, \"Structure, Sign and Play in the Discourse of the Human Sciences\"\n\nDerrida's essay divides into two parts:\n\n1. \"The structurality of structure\": An examination of the shifting relationships between\nstructure and centre, and their implications. The results of this examination is roughly the\nfollowing:\nwhereas traditionally, a structure was conceived of as grounded and stabilised by a moment of\npresence called the centre, we are now at a time when that centring has been called into question.\nAnd to call the centre into question is to open up a can of worms, destabilising and calling inot\nquestion the most basic building blocks of thought (Idea, origin, God, man etc.).\n\n2. An analysis of Levi-Straussian structuralism as an instantiation of the problems of\nthinking through the relationship between structure and centre. The basic point here comes at the\nend of the essay, and can be stated in one sentence Whereas Levi-Straussian structuralism posits\nitself as a decentring, it re-creates the centre in a particular way: as the loss of a centre. In other\nwords, how one decentres matters; and there is, above all, a crucial difference between conceiving a\nstructure as simply being acentric (of just not having a centre) and between conceiving of a\nstructure as being acentric because it has lost a centre it once had. It is precisely these two forms of\ndecentering that are in perpetual tension in Levi-Strauss' work. And, in the final analysis, his\n\"centres\" itself upon the very loss of the centre it aims at: absence becomes a mode of presence.\n\nSo, let me go through each of these parts in some more detail.\n\nPart One, or When is a centre not a centre?\n\n1. Ante-structuralism:\n\n(a) \"structure...has always been neutralised or reduced, and this by a process of giving it a\ncentre or referring it to a point of presence, a fixed origin\" (495): all structures or systems oriented\nthemselves through a centre, a moment at which the substitution of elements ceased, something that\nfixed or held the structure in place. For example, God in the medieval feudal hierarchy, the king on\na chess board, the anterior mental image which the word represents . The centre was conceived as\nproviding in a sense the raison d'etre of the structure, that which legitimised it, that to which\neverything could ultimately be referred, that which lent the system its closure. And, further, this\ncentre was associated with the fullness of presence, of being, of positivity, of essence, of being\nsomething.\n\n(b) Yet, there was always something of a paradox here: since the centre needed to be both in\nthe structure (part of it), and yet outside (somehow exceptional, something that did not quite obey\nthe rules that all other elements of the structure were subject to). The history of the concept of\nstructure can be read as a series of substitutions of centre for centre, of a chain of determinations of\nthe centre (in terms of being/presence/fullness/postivity)---Plato's ideas, Aristotle's telos,\nDescartes' ego, Kant' transcendental 'I', Hegel's absolute spirit; these would all exemplify\ndifferent ways of describing or determining the centre through which the philosophical structure\ngained its coherence.\n\nA moment of direct relevance to us in this regard will be Foucault's essay \"What is an\nAuthor?\". What Foucault does there is to shift the problem of what an author is, to the question of\nthe cultural anxiety that is implied by the desire to be able to fix the author. For what \"authorial\nintention\" provides is precisely a centre, a point of origin, a presence to which the question \"what\ndoes it mean?\" can be referred. And thus far we have seen a relay of such centerings: against the\nbackground that \"authorial intention\" allows us to fix meaning, New Criticism insisted that the\n\"closure of the text\" fixes meaning; against both these, Fish initially argues that the \"reader\" fixes\nmeaning. In each case the structure of meaning grounds itself upon a centre that is seen as being a\npoint of presence, of being, of essence: \"author\", \"text,\" \"reader.\" And from another angle,\nFoucault's essay does what Derrida's does: decentres the centre.\n\n2. Then there was structuralism (and its own antecedents/co-cedents, Freud/Nietzsche):\n\nStructuralism would seem to be the antithesis of these earlier, essentialist, present-ist ways\nof thinking, in that it insists that elements of a structure have no positive essence, no being, but are\nsimply the effects of sets of differential relationships (cf. Saussure's notion that there are no\npositivities, only differential relationships out of which what look like positive entities emerge).\nOne consequence of this is that Structuralism re-construes the centre not as something that precedes\nthe structure, not as that which is somehow anterior to and the basis of the structure; rather,\nstructuralism basically rethinks the centre as an effect of the structure. The centre was not simply\nthere, and thus should not be thought of on the basis of presence. This moment is what Derrida\ncalls the decentering ,which occurs when one thinks through the structurality of the structure,\nthinks through what makes a structure a structure. Levi-Strauss' notion of myth is a good example:\nthe \"core\" of myth, that is, the set of oppositions constituting that deep structure doesn't really exist\nin the world---it is simply the retroactive point of reference constituted by the differential\nrelationships among the different verisons. These are different \"versions\" of the myth not because\nthere was some basic mythic structure out of which they all grew, but because, through the\ndevelopment of the individual, related stories, a virtual object emerged (like extending backwards\nthe rays reflected from a mirror to construct the virtual image---not a brilliant analogy but along the\nright lines).\n\n3. Structuralism and its discontents:\n\nSo, structuralism advocates acentricity, refuses the positivity of the centre that had so long\nbeen thought essential to the very idea of a structure. But does it succeed, or is it another one of\nthose \"series of substitutions of center for center,\" another in the line, for example, of \"authorial\nintention,\" \"text,\" \"reader,\" and so on. The answer is going to be yes and no---it succeeds partway\nbut doesn't ultimately come to grips with the radical implications of decentering, and thereby ends\nup being another substitution for the centre it claimed to be doing away with.\nFor, Derrida argues, even the most radical attempts to think through the absence of the\ncentre, to decentre the centre, remain trapped in a circle (497), which takes the form \"of the\nrelationship between the history of metaphysics and the destruction of the history of metaphysics.\"\nThat is, in order to attack centred structures, one has to make use of concepts that come from them,\nand in so doing one resurrects these, gives them validity, at the very moment at which one makes\nuse of them.\nAnd this is inescapable. There is ultimately no outside where we can stand, where we can\ncentre ourselves to critique metaphysics; because its conceptual assumptions run so deep we are\nalways caught in them, always part of the game. The most basic concepts we use to try and topple\n\nthe structures come from these very structures, and thus we give them back their power at the very\nmoment we are striving to deprive them of it. Now, there are always kinds of questions that need\nnot confront the problem of what underpins them (large areas of physics, e.g., can simply take\nnature as given, objects as occupying a defined spatial and temporal place), but this simply means\nthat the metaphysical centres have been assumed in the very demarcation of the field (thus, the field\nof Newtonian physics, e.g. builds into its frame the very assumptions that quantum mechanics later\nrenders unstable---and the theological dimension of this was manifest in Newton, who insisted, for\nexample, on absolute space rather than relative space on essentially theological grounds).\nBut there are nonetheless different ways of being \"caught in the game\" and these are not the\nsame, and do not have the same consequences. And through the exemplary case of Levi-Strauss,\nDerrida (1) addresses this problem of decentering existing conceptual and ideational frameworks\nwhile having to rely on the ideas and concepts that constitute them, and (2) examines specifically\nthe implications of how one decenters them, what difference the way in which one enters the circle\nmakes.\n\nPart Two:\n\nRather than to try and follow through this section step by step, I think it will become clearer\nif we abandon that attempt and reverse course, starting from near the end of the essay. Specifically,\nthe paragraph on page 509, which I quote extracts from:\n\"As a turning toward the presence, lost or impossible, of the absent origin, this structuralist\nthematic of broken immediateness is thus the sad, negative, nostalgic, guilty Rousseauistic\nfacet of thinking the free play of which the Nietzschean affirmation...would be the other\nside. This affirmation then determines the non-center otherwise than as loss of centre.\"\nIf there is a thesis that Derrida proposes regarding Levi-Strauss, this is about as close as you are\ngoing to get. The basic point is that there are two opposed ways of approaching structures without\ncentres: as acentric or non-centered or as something that once had a centre, but no longer does. And\nin the case of the latter, that moment of anterior presence, of fullness (that is now absent) haunts the\ndecentered structure, and thus remains present as it were, precisely in the form of an absence . This\npresent absence re-centres the structure at the very moment at which it is claimed that the structure\nhas no centre.\nThis basic critique also underpins Derrida's remarks on the structuralist \"neutralisation of\ntime and history\" (508-9). On the one hand, by \"reducing\" history, by bracketing it off, Levi-\nStrauss (rightly) undermines the link between history and the metaphysics of presence (exposes\nfutility of a search for the historical origin, for example).\n\nLet me set aside the question of what \"affirmation\" of acentricity and free play would look\nlike (Derrida doesn't himself answer this question, except to acknowledge the problem that such an\naffirmation could itself be seen as constituting yet another centre). Instead, we need to see that\nDerrida's reading of Levi-Strauss repeatedly emphasises the basic tension/contradiction between\nthe claim towards acentricity or non-centricity, on the one hand, and the \"supplementary\" move\nwhereby acentricity will be re-thought as the loss of a centre. And this unresolved problem\nconstitutes the thread that connects the series of binary oppositions raised in Levi-Strauss:\nNature/Culture; Truth/Method; Engineer/Bricoleur etc.\n\nNature/Culture:\n\nLet us, for example, consider the Nature/Culture opposition. Levi-Strauss begins his own\ndiscussion by telling us that despite attempts to repudiate this distinction, it has been impossible to\navoid it (Elementary Structures, 3). And he goes on to give this opposition \"a more valid\ninterpretation\" (4-8) in terms of norm and universality. But no sooner has he done so, he encounters\nthe \"fact\" which is \"not far removed from a scandal\": the incest prohibition, which inextricably\nmixes up the two poles of nature (universality) and culture (society-specific rules or norms). His\nsolution to this problem will be, as we have seen, to claim that the incest prohibition needs to\nthought as the \"join\" between nature and culture for it is through and in the prohibition that culture\nemerges as different from but linked to nature (24-25).\n\nDerrida points out, first, that incest is only scandalous if one is already working with the\nnature/culture opposition (that is, in the interior of the system). That is, only when one treats the\nnature/culture difference as in some sense self-evident, can the \"fact\" of incest prohibition appear to\nbe that which blurs or obliterates the difference. Otherwise, it is not scandalous at all: simply\nsomething that escapes that conceptual distinction, which that particular distinction is not capable\nof dealing with (and in this sense it points to something unthinkable within a particular conceptual\nsystem, suggesting even that such unthinkability is not merely accidental but constitutive of the\nsystem itself).\n\nRather than using this \"fact\" to question in depth the history of the nature/culture\nopposition, L-S takes a different tack: of radically separating method from truth. He holds on to the\nold concepts in the field of empirical discovery, while exposing there limits here and there, uses\nthem as instruments even as he criticises their truth value. This approach is \"bricolage\" and he\nproffers himself as bricoleur, constrained by the empirical world to operate in a way that is opposed\nto the mode of an engineer (who can define his terms right down to their very essence). Consider,\nthen, the problem of the bricoleur versus the engineer, or of method versus truth. On the one hand,\nthe bricoleur represents for Levi-Strauss \"the discourse of the method,\" that is, he is the one who\ntakes up whatever concepts are at hand (nature and culture, for example). without worrying about\ntheir truth, and uses them to build and dismantle systems. Bricolage exemplifies for Levi-Strauss a\ndiscourse about structure that abandons all reference to a grounding centre. Derrida argues that the\nnotion of the bricoleur depends for its force on what it opposes itself to: the engineer (and the\nnotion of truth he embodies). But once we recognise that there is no engineer, that every finite\ndiscourse depends on bricolage, then the very notion of a bricoleur is \"menaced\".\n\nThere is a further consequence of Levi-Strauss' approach that comes from the entanglement\nof his own critical discourse with the object it studies. This comes out most clearly in his discussion\nof myth. For one, his empirical approach to myth embodies powerfully the idea of bricolage: there\nis no \"central\" mythic structure or origin upon which his analysis depends. It claims to be acentric,\noperating by trial and error. Thus, the reference myth he uses is not privileged, but in a sense\narbitrarily chosen (he could have picked another one). Likewise, there is no single, absolute source\nfor the myth. And for this reason, Levi-Strauss goes onto say that discourse on myth (that is, his\nown book) must follow the form of myth itself; it cannot---like the engineer---make his theory of\nmyth as relational into the \"truth\"; rather, the structuralist analysis must acknowledge and reflect\nmirage-like quality, the acentricity, of its object (myth). [To cite Levi-Strauss: \"unlike\nphilosophical reflection, which claims to go all the way back to its source...my enterprise...has had\nto yield to [the] demands [of myth].... Thus is this book, on myths itself and in its own way, a\n\nmyth\" (503).] This insistence on the acentricity of myth (\"the stated abandonment of all reference\nto a centre\") and the claim that structuralist reading of myth is also myth-like in not having a centre\nis what Derrida reconstructs on pp. 502-503\nBut the consequence of this is also that it provides no way of distinguishing between the\ndifferent (structuralist) readings of myth, since all them become somehow equivalent. It sidesteps\nthe question of the standpoint from which one would be able to compare the \"truth values\" of\ndifferent discourses on myth. Hence a peculiar tension in L-S's work between a critique of\nempiricism (structuralism claims to go beyond the manifest diversity to modes of underlying\nregularity) and the fact that his work always claims to be empirical (dependent on new\ninformation). So that structures underwrite experience (are \"prior\" to experience) and yet are\nalways dependent upon experience: you never reach the structure in a sense. Hence too the\nambiguity of his response to the demand for \"totalisation\": it is a meaningless requirement because\nit is impossible (because the empirical field is too vast) and because it is unnecessary (you don't\nneed to enumerate all instances to elaborate the structure).\nHowever, another way of conceiving totalisation would not be based upon thinking of it in\nterms of an empirical impossibility but because of a \"structural\" feature of the discourse itself:\nbecause of a lack that allows for an infinite circulation within a closed structure.\nAnd by the same token, the idea of \"truth\" (the discourse of the engineer) turns out itself to\nbe simply a lost ideal, an historical illusion, which we can never have, but which is necessary for\nthis notion of \"acentricity\" to take hold. What Levi-Strauss' theory of bricolage and method evokes\nin seeing these as exemplifying \"acentricity\" is an ideal image of a discourse of pure truth and self-\nsufficiency, that of the engineer or scientist who would \"be the one to construct the totality of his\nlanguage, syntax and lexicon,\" who would represent the purity of a meaning present to itself. It\nevokes this ideal image as something lost, something that no longer exists, and precisely through\nthis loss the discourse of method/bricolage stabilises itself. There is, in other words, a buried,\nunacknowledged tension in Levi-Strauss' own descriptions between the upholding of an acentric\nstructure of differences (exemplified by bricolage) and the hankering after an idealised, mythic lost\npresence (the engineer, epistemic discourse) whose absence is what leads to acentricity. It is in the\nshadow of loss that the bricoleur operates, elevating thereby that loss itself to the level of the\ncentre.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.451 Introduction to Literary Theory\nFall 2014\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}