{
  "course_name": "Investments",
  "course_description": "The focus of this course is on financial theory and empirical evidence for making investment decisions. Topics include: portfolio theory; equilibrium models of security prices (including the capital asset pricing model and the arbitrage pricing theory); the empirical behavior of security prices; market efficiency; performance evaluation; and behavioral finance.",
  "topics": [
    "Business",
    "Finance",
    "Social Science",
    "Economics",
    "Financial Economics",
    "Business",
    "Finance",
    "Social Science",
    "Economics",
    "Financial Economics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThe focus of this course is on the financial theory and empirical evidence that are useful for investment decisions. The topics covered in this course can be broadly categorized into five groups:\n\nFinancial Theories\n\nThis includes portfolio theory, the capital asset pricing model and the arbitrage pricing theory, all of which have become an integrated part of the decision-making in investments.\n\nEmpirical Evidence in the Equity and Equity Options Markets\n\nThis includes patterns in cross-sections of stock returns, the time-series behavior of stock returns time-varying expected returns and stochastic volatility, and further empirical evidence from the equity options market.\n\nIntroduction to Fixed-Income and Credit Sensitive Instruments\n\nThis includes default-free as well as defaultable bonds, yield curve analysis, the effect of Fed target rates, fixed-income derivatives such as swaps, caps, floors, and swaptions, models of default and ratings transitions, and more recent development of credit derivatives.\n\nMarket Efficiency and \"Active\" Investments\n\nWe start with the efficient market hypothesis, which is a useful framework for modeling financial markets. Like any model, the efficient market hypothesis is not a perfect description of reality: some prices are almost certainly \"wrong\". Hence there are reasons to believe that active management can have effective results. Topics in active investments include security analysis, active portfolio management, hedge funds, and risk management issues.\n\nBrief Introduction to Behavioral Finance\n\nWhile traditional finance assumes investors act rationally to maximize a well-defined utility function, behavioral finance tries to use other theories of behavior, from psychology, sociology, and anthropology, to explain financial markets. This topic will be covered by just one lecture, the main purpose of which is to get you exposed to this active and fast growing field in Finance.\n\nCourse Objectives\n\nA sound investment decision requires in-depth knowledge of the financial markets, rigorous analytical thinking and precise mathematical derivation. The main objective of this class is to teach you these three elements:\n\nAnalytical Tools\n\nAmong others, an important analytical skill you should acquire from taking this class is the ability to transform a real life investment problem into an analytically tractable model. This modeling skill is an important aspect of this class, and will be emphasized throughout the course.\n\nQuantitative Skills\n\nModern finance has its quantitative aspect. Powerful mathematical techniques such as optimization, dynamic programming, probability theory and statistical analysis pave the way for many complex investment problems.\n\nIn this class, you will be exposed to this quantitative aspect. You are not expected to be fluent in mathematics, but I hope to teach you the fundamentals, which are portable from one situation to another. Moreover, through 5 group assignments, you will have hands-on experiences with optimization, data analysis, Monte-Carlo simulation, etc.\n\nEmpirical Knowledge\n\nEssential to any investment decision is the knowledge of the investment environment. Broadly speaking, the financial instruments can be categorized into equity, debt, and derivatives. Important empirical evidence from all three types of financial markets will be examined in this class. Although I will emphasize concepts and the big picture a lot, please realize that 15.433 involves a fair bit of algebra, notation, and basic mathematics. So if you are uncomfortable with the above three notions, please talk to the course instructor about it.\n\nCourse Materials\n\nRequired Reading\n\nBodie, Zvi, Alex Kane, and Alan J. Marcus (\"BKM\").\nInvestments.\n5th Edition_._ McGraw-Hill/Irwin, 2002.\n\nRecommended Reading\n\nP. Bernstein.\nCapital Ideas: The Improbable Origins of Modern Wall Street.\nNew York: Free Press, 1992.\n\nTA's and Review Sessions\n\nThe TA's for the course will hold weekly office hours, review sessions are announced in the class.\n\nGrading\n\nREQUIREMENTS\n\nPERCENTAGE\n\nRegular attendance and class participation\n\n10%\n\nFive group assignments\n\n20%\n\nMid-term examination\n\n30%\n\nFinal examination\n\n40%\n\nClass Preparation and Participation\n\nBoth class preparation and participation are important. The classroom is a great place to test and enhance your understanding of the material by asking and answering questions. It will be hard to contribute to the discussions if you are unprepared. I strongly encourage you to prepare for class in study groups. For details, see Course Schedule and Reading List.\n\nClass participation, from clarifying questions to creative and insightful comments, is greatly encouraged. Your active participation will transform this class into a great learning experience for everyone, including myself.\n\nGroup Assignments\n\nThere are five group assignments. Each is worth between 3 to 5 points toward your final grade. Group assignments are due at the beginning of class on the due date.\n\nPlease work in a group of three to five students when preparing these assignments. Each group should hand in only one set of answers. Each group member will receive the same grade on an exercise, and each is expected to make a significant contribution to the solution of every problem.\n\nLEC #\n\nASSIGNMENTS\n\nPOINTS\n\nCapital Market Theory\n\nSecurity Analysis\n\nFutures Problem\n\nSimulation Based Option Problem\n\nPerformance Attribution\n\nTotal\n\nExams\n\nBoth mid-term and final exams are in-class, closed-book and closed-notes. The mid-term will be given after lecture 11, and the final will be given during the scheduled final examination date (after lecture 24).\n\nUnlike the group assignments, you may not work on the exams in groups. If you have to miss the exams due to medical reasons, please contact me before the exams.",
  "files": [
    {
      "category": "Assignment",
      "title": "15433_assignment_1_solution.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/c0264e3fd383834dc1c84a53caf35a17_15433_assignment_1_solution.PDF",
      "content": "Assignment 1: Securities, Markets & Capital Market Theory\nEach question is worth 0.2 points, the max points is 3 points\n1. The interest rate charged by banks with excess reserves at a Federal Reserve Bank to\nbanks needing overnight loans to meet reserve requirements is called the_________.\nA) prime rate\nB) discount rate\nC) federal funds rate\nD) call money rate\nE) money market rate\nAns:\nC\n2. Which of the following statements is (are) true regarding municipal bonds?\nI) A municipal bond is a debt obligation issued by state or local governments.\nII) A municipal bond is a debt obligation issued by the federal government.\nIII) The interest income from a municipal bond is exempt from federal income taxation.\nIV) The interest income from a municipal bond is exempt from state and local taxation\nin the issuing state.\nA) I and II only\nB) I and III only\nC) I, II, and III only\nD) I, III, and IV only\nE) I and IV only\nAns:\nD\n3. A form of short-term borrowing by dealers in government securities is\nA) reserve requirements.\nB) repurchase agreements\nC) banker's acceptances.\nD) commercial paper.\nE) brokers' calls.\nAns:\nB\n4. Restrictions on trading involving insider information apply to the following except\nA) corporate officers and directors.\nB) relatives of corporate directors and officers.\n15.433 Investments\n\nC) major stockholders.\nD) All of the above are subject to insider trading restrictions.\nE) None of the above is subject to insider trading restrictions.\nAns:\nD\n5. Discuss margin buying of common stocks. Include in your discussion the advantages\nand disadvantages, the types of margin requirements, how these requirements are met,\nand who determines these requirements.\nAns:\nBuying stock on margin means buying stock with partially borrowed funds.\nThese funds are borrowed from your broker, who has borrowed the funds from a\ncommercial bank. The initial margin requirement is the percent of the funds that must\nbe your own. The current initial margin requirement is 50% and is set by the Federal\nReserve System. Margin is simply equity as a percent of the value of your account.\nSubsequent to opening the account, stock prices change and thus the margin of your\naccount changes. The maintenance margin is the relevant margin after you open your\naccount. A 25% maintenance margin is required for NYSE listed stocks; however,\nmost brokers will require a maintenance margin above that amount. If the margin of\nyour account falls below the maintenance margin requirement, you will receive a\nmargin call. You can either send your broker more cash to reduce the amount of the\noriginal loan to get your account back to the required maintenance margin, or your\nbroker can sell some of the shares for you, using the proceeds to reduce the amount of\nyour original loan, thus getting your account back to the margin requirement.\nIf the price of the stock increases, your account will become overmargined and you can\neither pyramid (buy more shares without using any of your own cash) or you can\nwithdraw cash from the account (increasing the amount of the loan). If you execute\neither of these actions, you must not let your account fall below the initial margin\nrequirement (increasing the number of shares or the amount of the loan requires the\naccount to be treated as a new account).\nThe advantage of margin is that of leverage. If the price of stock increases you own\nmore shares than had you used only your own funds and your returns will be greater.\nThe disadvantage of margin is that if the price of the stock declines you will own more\nshares and your losses will be greater than had you used only your own funds.\n6. Security A has a beta of 1.0 and an expected return of 12%. Security B has a beta of\n0.75 and an expected return of 11%. The risk-free rate is 6%. Explain the arbitrage\nopportunity that exists; explain how an investor can take advantage of it. Give specific\ndetails about how to form the portfolio, what to buy and what to sell (we assume that\nthe company-specific risk can be neglected).\n15.433 Investments\n\nAns:\nAn arbitrage opportunity exists because it is possible to form a portfolio of\nsecurity A and the risk-free asset that has a beta of 0.75 and a different expected return\nthan security B. The investor can accomplish this by choosing .75 as the weight in A\nand .25 in the risk-free asset. This portfolio would have E(rp) = 0.75(12%) + 0.25(6%)\n= 10.5%, which is less than B's 11% expected return. The investor should buy B and\nfinance the purchase by short selling A and borrowing at the risk-free asset.\n7. In the APT model, what is the nonsystematic standard deviation of an equally-weighted\nportfolio that has an average value of s(ei) equal to 25% and 50 securities?\nA) 12.5%\nB) 625%\nC) 0.5%\nD) 3.54%\nE) 14.59%\nAns:\nD\n8. Consider a well-diversified portfolio, A, in a two-factor economy. The risk-free rate is\n6%, the risk premium on the first factor portfolio is 4% and the risk premium on the\nsecond factor portfolio is 3%. If portfolio A has a beta of 1.2 on the first factor and .8\non the second factor, what is its expected return?\nA) 7.0%\nB) 8.0%\nC) 9.2%\nD) 13.0%\nE) 13.2%\nAns:\nE\n9. The index model for stock B has been estimated with the following result:\nRB = 0.01 + 1.1RM + eB\nIf sM = 0.20 and R2\nB = 0.50, the standard deviation of the return on stock B is\n_________.\nA) 0.1111\nB) 0.2111\nC) 0.3111\nD) 0.4111\nE) none of the above\n15.433 Investments\nAns:\nC\n\n10. Discuss the advantages of the single-index model over the Markowitz model in terms of\nnumbers of variable estimates required and in terms of understanding risk relationships.\nAns:\nFor a 50 security portfolio, the Markowitz model requires the following\nparameter estimates:\nn = 50 estimates of expected returns;\nn = 50 estimates of variances;\n(n2 - n)/2 = 1,225 estimates of covariances; (n2-n)/2+2n=1'325 estimates.\nFor a 50 security portfolio, the single-index model requires the following\nparameter estimates:\nn = 50 estimates of expected excess returns, E(R);\nn = 50 estimates of sensitivity coefficients, bi;\nn = 50 estimates of the firm-specific variances, s2(ei);\n1 estimate for the variance of the common macroeconomic factor, s2\nM;\nor (3n + 1)=151 estimates.\nIn addition, the single-index model provides further insight by recognizing that different\nfirms have different sensitivities to macroeconomic events. The model also summarizes\nthe distinction between macroeconomic and firm-specific risk factors.\n11. Draw graphs that represent each of the following situations:\no Investors face an efficient frontier of risky assets. There is no borrowing or lending\nallowed at a risk-free rate. Using indifference curves, show an example of the\noptimal portfolio choice for Investor A, who has a strong aversion to risk, and one\nfor Investor B, who is much less risk-averse. Label points A and B clearly.\no Investors face an efficient frontier of risky assets. Borrowing and lending at a risk-\nfree rate are allowed. Using indifference curves, show an example of Investor C,\nwho chooses to put 100% of his investment in the optimal risky portfolio. Show an\nexample of Investor D, who chooses to put 75% of her investment in the optimal\nrisky portfolio. Label points C and D clearly.\no Investors face an efficient frontier of risky assets. Lending at a risk-free rate is\nallowed, and investors can borrow at a slightly higher rate. Using an indifference\ncurve, show an example of Investor E, who chooses to borrow. Label this point E.\nOn the same graph show where the investor's indifference curve wo uld be if she\ncould borrow at the lending rate. Label this point F.\nAns:\nThe graph of investors A and B should resemble Figure 8-15 on page 237.\nThe graph of investors C and D should look like Figure 8-8 on page 222, with C lying\nto the left of P and point D to the right of P. The graph with points E and F is similar to\nFigure 8-16 on page 237.\n15.433 Investments\n\n12. Given an optimal risky portfolio with expected return of 14% and standard deviation of\n22% and a risk free rate of 6%, what is the slope of the best feasible CAL?\nA) 0.64\nB) 0.14\nC) 0.08\nD) 0.33\nE) 0.36\nAns:\nE\n13. Security X has expected return of 12% and standard deviation of 20%. Security Y has\nexpected return of 15% and standard deviation of 27%. If the two securities have a\ncorrelation coefficient of 0.7, what is their covariance?\nA) 0.038\nB) 0.070\nC) 0.018\nD) 0.013\nE) 0.054\nAns:\nA\n14. What is an Exchange-traded fund? Give two examples of specific ETFs. What are\nsome advantages they have over ordinary open-end mutual funds? What are some\ndisadvantages?\nAns:\nETFs allow investors to trade index portfolios. Some examples are spiders\n(SPDR), which track the S&P500 index, diamonds (DIA), which track the Dow Jones\nIndustrial Average, and qubes (QQQ), which track the Nasdaq 100 index. Other\nexamples are listed in Table 4-3, page 117. (It is anticipated that there may soon be\nETFs that track actively managed funds as well as the current ones that track indexes.)\nAdvantages -\n1. ETFs may be bought and sold during the trading day at prices that reflect the current\nvalue of the underlying index. This is different from ordinary open-end mutual funds,\nwhich are bought or sold only at the end of the day NAV (Net Asset Value).\n2. ETFs can be sold short.\n3. ETFs can be purchased on margin.\n4. ETFs may have tax advantages. Managers are not forced to sell securities from a\nportfolio to meet redemption demands, as they would be with open-end funds. Small\ninvestors simply sell their ETF shares to other traders without affecting the composition\n15.433 Investments\n\nof the underlying portfolio. Institutional investors who want to sell their shares receive\nshares of stock in the underlying portfolio.\n5. ETFs may be cheaper to buy than mutual funds because they are purchased from\nbrokers. The fund doesn't have to incur the costs of marketing itself, so the investor\nincurs lower management fees.\nDisadvantages -\n1. ETF prices can differ from NAV by small amounts because of the way they trade.\nThis can lead to arbitrage opportunities for large traders.\n2. ETFs must be purchased from brokers for a fee. This makes them more expensive\nthan mutual funds that can be purchased at NAV.\n15. Of the items listed, which have the new SEC regulations designated as required\ndisclosures?\nI) tax-adjusted returns over the last 10 years\nII) the fund's best and worst quarterly returns during the last 10 years\nIII) the managers' ownership in the fund\nIV) the specific assets held by the fund\nA) I and II\nB) I and III\nC) III and IV\nD) I, III, and IV\nE) none of the above - the reporting of each of these items will be voluntary\nAns:\nA and E are considered correct answers. The book contains on two places\nconflicting answers on the same topic.\n15.433 Investments"
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_1.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/0e6f4a2b7d58acf01f88c602bc6f28e0_15433_assignment_1.PDF",
      "content": "15.433 Investments\nAssignment 1: Securities, Markets & Capital Market Theory\nEach question is worth 0.2 points, the max points is 3 points\n1. The interest rate charged by banks with excess reserves at a Federal Reserve Bank to\nbanks needing overnight loans to meet reserve requirements is called the_________.\nA) prime rate\nB) discount rate\nC) federal funds rate\nD) call money rate\nE) money market rate\nAns:\n2. Which of the following statements is (are) true regarding municipal bonds?\nI) A municipal bond is a debt obligation issued by state or local governments.\nII) A municipal bond is a debt obligation issued by the federal government.\nIII) The interest income from a municipal bond is exempt from federal income taxation.\nIV) The interest income from a municipal bond is exempt from state and local taxation\nin the issuing state.\nA) I and II only\nB) I and III only\nC) I, II, and III only\nD) I, III, and IV only\nE) I and IV only\nAns:\n3. A form of short-term borrowing by dealers in government securities is\nA) reserve requirements.\nB) repurchase agreements\nC) banker's acceptances.\nD) commercial paper.\nE) brokers' calls.\nAns:\n4. Restrictions on trading involving insider information apply to the following except\nA) corporate officers and directors.\nB) relatives of corporate directors and officers.\n\n15.433 Investments\nC) major stockholders.\nD) All of the above are subject to insider trading restrictions.\nE) None of the above is subject to insider trading restrictions.\nAns:\n5. Discuss margin buying of common stocks. Include in your discussion the advantages\nand disadvantages, the types of margin requirements, how these requirements are met,\nand who determines these requirements.\nAns:\n6. Security A has a beta of 1.0 and an expected return of 12%. Security B has a beta of\n0.75 and an expected return of 11%. The risk-free rate is 6%. Explain the arbitrage\nopportunity that exists; explain how an investor can take advantage of it. Give specific\ndetails about how to form the portfo lio, what to buy and what to sell (we assume that\nthe company-specific risk can be neglected).\nAns:\n7. In the APT model, what is the nonsystematic standard deviation of an equally-weighted\nportfolio that has an average value of s(ei) equal to 25% and 50 securities?\nA) 12.5%\nB) 625%\nC) 0.5%\nD) 3.54%\nE) 14.59%\nAns:\n8. Consider a well-diversified portfolio, A, in a two-factor economy. The risk-free rate is\n6%, the risk premium on the first factor portfolio is 4% and the risk premium on the\nsecond factor portfolio is 3%. If portfolio A has a beta of 1.2 on the first factor and .8\non the second factor, what is its expected return?\nA) 7.0%\nB) 8.0%\nC) 9.2%\nD) 13.0%\nE) 13.2%\nAns:\n\n9. The index model for stock B has been estimated with the following result:\nRB = 0.01 + 1.1RM + eB\nIf sM = 0.20 and R2\nB = 0.50, the standard deviation of the return on stock B is\n_________.\nA) 0.1111\nB) 0.2111\nC) 0.3111\nD) 0.4111\nE) none of the above\nAns:\n10. Discuss the advantages of the single-index model over the Markowitz model in terms of\nnumbers of variable estimates required and in terms of understanding risk relationships.\nAns:\n11. Draw graphs that represent each of the following situations:\no Investors face an efficient frontier of risky assets. There is no borrowing or lending\nallowed at a risk-free rate. Using indifference curves, show an example of the\noptimal portfolio choice for Investor A, who has a strong aversion to risk, and one\nfor Investor B, who is much less risk-averse. Label points A and B clearly.\no Investors face an efficient frontier of risky assets. Borrowing and lending at a risk-\nfree rate are allowed. Using indifference curves, show an example of Investor C,\nwho chooses to put 100% of his investment in the optimal risky portfolio. Show an\nexample of Investor D, who chooses to put 75% of her investment in the optimal\nrisky portfolio. Label points C and D clearly.\no Investors face an efficient frontier of risky assets. Lending at a risk-free rate is\nallowed, and investors can borrow at a slightly higher rate. Using an indifference\ncurve, show an example of Investor E, who chooses to borrow. Label this point E.\nOn the same graph show where the investor's indifference curve would be if she\ncould borrow at the lending rate. Label this point F.\nAns:\n12. Given an optimal risky portfolio with expected return of 14% and standard deviation of\n22% and a risk free rate of 6%, what is the slope of the best feasible CAL?\n15.433 Investments\n\nA) 0.64\nB) 0.14\nC) 0.08\nD) 0.33\nE) 0.36\nAns:\n13. Security X has expected return of 12% and standard deviation of 20%. Security Y has\nexpected return of 15% and standard deviation of 27%. If the two securities have a\ncorrelation coefficient of 0.7, what is their covariance?\nA) 0.038\nB) 0.070\nC) 0.018\nD) 0.013\nE) 0.054\nAns:\n14. What is an Exchange-traded fund? Give two examples of specific ETFs. What are\nsome advantages they have over ordinary open-end mutual funds? What are some\ndisadvantages?\nAns:\n15. Of the items listed, which have the new SEC regulations designated as required\ndisclosures?\nI) tax-adjusted returns over the last 10 years\nII) the fund's best and worst quarterly returns during the last 10 years\nIII) the managers' ownership in the fund\nIV) the specific assets held by the fund\nA) I and II\nB) I and III\nC) III and IV\nD) I, III, and IV\nE) none of the above - the reporting of each of these items will be voluntary\nAns:\n15.433 Investments"
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_2.PDF",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/a3dacf12a5f078d7acc44d622a8ac68f_15433_assignment_2.PDF",
      "content": "15.433 Investments\nAssignment 2: Security Analysis\nYou are now in the position of a research analyst. You are covering the prestigious indus\ntry sector \"Asset Management / Custody Business\". The portfolio managers expect from\nyou:\n- to estimate the fair value of Northern Trust.\nOn purpose you will receive a lot of information. A research analyst gets swamped every\nday with press releases, research reports from broker companies, etc. One of your objec\ntives will be to figure out what information is \"need to know\", and what information is\n\"nice to know\". Attached you find the annual reports of Northern Trust and several re-\nsearch papers. The information required for the assignment is not limited to the informa\ntion package. I encourage you to research more information. It is my full intention to give\nyou a lot of information.\nOn the web you find a template for the valuation. It is already filled with live data and\nyou are encouraged to enhance / modify the information from your research. Ho wever, I\nencourage you to develop / enhance your own valuation model.\nI expect from you:\n- the estimated fair value;\n- a transparent valuation process;\n- a description of your key consideration for the valuation; and\n- should you move away from the result of the quantitative model approach, I want\na description why you think the model does not represent the fair value.\nWrite your assignment in a way that the TA's can read it, disclose the sources of the in-\nformation following academic standards.\nInvestments - 15.433\n\n15.433 Investments\nDefining Fair Value\nWe all like bargains but few investors attempt to estimate a company's worth before buy\ning its stock. Investing requires the same discipline one exerts when purchasing a house,\na car or even groceries. Most capital losses in the stock market arise when investors buy\nsecurities at inflated levels and do not anticipate the amount of risk they are taking when\npurchasing stocks that trade at high premiums to the fair value of the business.\nWhat is fair value?\nFrom a purely static point of view, the fair value of an equity share is a point of indiffer\nence. A price level, below which you would buy the stock. Or a price level, above which\nyou would sell the stock. However, real life is more dynamic and as a stock investor you\nare dealing with moving targets. Here stock prices fluctuate madly, as much as eight or\n12 per cent every day.\nThankfully, the fair value of a company does not fluctuate with its price. It is important to\nunderstand this before you proceed with your equity investments. Forces of dema nd and\nsupply in a stock market generate price. Fair value, on the other hand, is an output of a\nvaluation process.\nHow to determine fair value?\nA simple method is to use the price-to-earning multiple, where the price of a company's\nstock is divided by the earnings per share of a company. Which makes sense since growth\nin earnings is a proxy for how well a company is performing within a given market op\nportunity. However, as long-term investors we are interested in absolute value, irrespec\ntive of how the stock market is currently pricing the company. Here, the P/E loses rele\nvance since it is will be continuously influenced by the demand or supply for a company's\nstock on the numerator side.\nEarnings per share, which represents the denominator side of the P/E, also may not help.\nSince all earnings do not equal free cash flows. Most of it is ploughed back into the com\npany via capital expenditures. And as investors we are interested in the surplus cash\n(though this term has many variations, it is loosely defined as the cash after providing for\nrecurring capital expenditures plus depreciation, the later being a non-cash charge),\nwhich can be returned to equity shareholders.\nThis dictum is codified in the discounted cash flow model. Which says, that the value of a\nstock is equal only of the free cash flows it produces in the future, discounted back to the\npresent.\nWhen you discount future income, you essentially adjust for the fact that a rupee in hand\ntoday is more valuable than a rupee to be received in the future because today's rupee can\nbe invested elsewhere to generate a return. The DCF allows you to discount incoming\nInvestments - 15.433\n\n15.433 Investments\ncash flows by a rate, which you believe equates the level of risk you are assuming. This\nrisk-adjusted value then is compared with the prevailing stock price to check a company's\ninvestment worthiness.\nIf a stock is said to be trading at fair value, it simply means that the market is pricing it\naccording to the value it represents. Otherwise, it could either be bought or sold. With\nminor modifications, the DCF can be used to value a range of companies, from those\ngrowing faster than the economy to those growing slower, or matching the pace of the\neconomy.\nLimitations\nHowever, like all other valuation models, the DCF too has its limitations. For decades it\nserved analysts and investors well until faced with the prospect of valuing companies in\nthe so-called new economy businesses.\nNot that the basic premises of the DCF are under question, but how does one account for\ncompanies where revenues are growing at a rate, which have a high element of surprise.\nAnd small changes in the amount of information available can bring about large changes\nin stock prices. How does one come up with an appropriate discount rate, which reflects\nthe high level of technological risk for many such companies? How does the DCF model\nbuild in for a boost in valuation that comes when a company is taken over by another?\nThe inability to predict the fair value for these companies also causes their stock prices to\nfluctuate wildly. To state it more correctly and in the words of John Burr Williams, who\npioneered the concept of DCF: \"They (the stock market) had high hopes for the business,\nbut no logical evaluation of these hopes in terms of stock prices. The very fact that the\ncompany was one of the hardest of all stocks to appraise was the reason it sold at ex\ntravagant prices, for speculation ever feeds on mystery, as we have seen before.\"\nHence distinguish between \"price\" and \"value\"\nIn the end, instead of grasping on the appropriate valuation for these companies, investors\ncan caution themselves by thinking more carefully in terms of 'price' versus 'value'.\nPrice is not value. Price is what you pay. Value is what you get in return for owning a\npiece of a company. When you shop for a consumer durable, you don't pay the list price\nwithout being sure of the quality of the good and consistency of its performance. Issues\nlike this define value.\nIn case of equity stocks, thinking about the return you will need to compensate for the\ninvestment risk is probably a good place to start. If you cannot see a company providing\nsuch a return over a longer term, do not invest. Academicians and analysts can offer a\npotpourri of valuation tools, but ultimately the investor has to decide the price he or she is\ncomfortable paying for a stock.\nInvestments - 15.433"
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_3_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/f0cb625ea08fbb1935426ed53dc6f228_15433_assignment_3_solution.pdf",
      "content": "15.433 INVESTMENTS\nAssignment 3: Futures\nReto R. Gallati\nMIT Sloan School of Management\n\n1. A futures contract is available on a company that pays an annual dividend of $5 and whose stock\nis currently priced at $200. Each futures contract calls for delivery of 1,000 shares of stock in\none year, daily marking to market, an initial margin of 10% and a maintenance margin of 5%.\nThe current Treasury bill rate is 8%. (4 points)\n(a) Given the above information, what should the price of one futures contract be? (0.5 points)\n(b) If the company stock decreases by 7%, what will be, if any, the change in the futures price?\n(0.5 points)\n(c) As a result of the company stock decrease, will an investor that has a long position in one\nfutures contract of this company realize a gain or a loss? Why? What will be the amount\nof this gain or loss? (1 point)\n(d) What must the initial balance in the margin account be? Following the stock decrease,\nwhat will be, if any, the change in the margin account? Will the investor need to top up\nthe margin account? If yes, by how much and why? (1 point)\n(e) Given the company stock decrease, what is the percentage return on the investor's position?\nIs it higher, equal or lower than the 7% company stock decrease? Why? (1 point)\nAnswers:\n(a) F=200*(1+ 0.08-(5/200))=$211\n(b) F=200*(1-0.07)*(1+0.08-(5/200))=$196.23\n(c) An investor with a long position in one futures contract agrees to buy 1,000 stocks of the\ncompany in one year at $211. Therefore this investor will benefit only if the futures price\nincreases. In this case, the futures price has decreased and the investor will therefore realize\na loss of:\n(196.23 - 211) ∗ 1, 000 = -$14, 770\n(1)\n(d) The change in the margin account will be minus $14,770. The initial required margin was\n1,000*$211*10%=$21,100 so now the balance will be $20,000-$14,770=$6,330. This balance\n($6,330/$211,000=3%) is below the required 5% ($10,550/$211,000=5%) maintenance mar\ngin. The investor will need to top up the margin account by at least $10,550-$6,330=$4,220,\nelse, the broker will close out enough of the investor's long position to meet the required\nmaintenance margin.\n(e) The percentage return on the investor's position will be -$14,770/$21,100=-70% which is\n10 times higher than the actual decrease in the stock price. The 10-to-1 ratio of percentage\nchanges reflects the leverage inherent in the futures contract position.\n15.433\nMIT Sloan\n\n2. You have recently been appointed CFO of a large multinational corporation based in Frank\nfurt. The CEO has asked you to raise 8,000,000 Euros one year from now to fund a strategic\ninvestment. The company has to raise the capital either through a U.K. (in £) or a Germany\n(in Euros) based bank. The annual interest rates on U.K. and German bills are 8% and 6%\nrespectively. The current exchange rate is 1.5 Euro per 1 £and the futures price for delivery one\nyear from now is 1.46 Euros per 1 £. (4 points)\n(a) Where would you lend and where would you borrow? (0.5 points)\n(b) You realize that given the above data, you can benefit from an arbitrage opportunity that\nwould allow you to raise the necessary capital at no cost for the company. Describe in\na table like the one below the necessary actions (and associated cash flows in Euros) you\nneed to take now and in one year in order earn 8,000,000 Euros in one year at no cost. (2\npoints)\nAction Now\nCash Flow in Eu\nros\nAction in 1 Year\nCash Flow in Eu\nros*\nTotal\nTotal\n(c) Assuming the interest rates and the current exchange rate given above are correct. What\nshould the futures price of 1 be in Euros according to the interest rate parity theorem? (0.5\npoints)\n(d) Discuss why wouldn't all investors decide to invest their money in the U.K., even though\nthe interest rate in the U.K. (8%) is higher than in Germany (6%.) (1 point)\nAnswers:\n(a) Given the interest rates the best approach would be to borrow the capital in Germany,\nwhere the interest rate is lower and lend it in the U.K. where the interest rate is higher.\n(b) This is possible by simultaneously lending and borrowing. We can come up with an in\nvestment structure that requires an initial outlay of 0 Euros and yet will a benefit of\napproximately 8,000,000 Euros in the future.\n15.433\nMIT Sloan\n\nAction Now\nCash Flow in Eu\nros\nAction in 1 Year\nCash Flow in Eu\nros*\nYou lend XM in\nthe U.K.\n-X*1.5M\nThe amount you\nlent is repaid to\nyou and you ex\nchange it into\n1.08*(XM)*E1\nYou\nborrow\nX*1.5M Euros in\nGermany\n+X*1.5M\nYou\nrepay\nthe\namount\nyou\nborrowed\n-1.06*(X*1.5M)\nYou sell forward\n1.08*XM in Eu\nros\nUnwind\n1,08*XM*(1.46\nE1)\nTotal\nTotal\n8.0 Euros\n1.08*(XM)*E1-1.06*(X*1.5M)+ 1,08*XM*(1.46-E1)=8.0M\n-1.06*(X*1.5M)+ 1,08*XM*1.46=8.0M\n-1.06*(X*1.5M)+ 1,08*XM*1.46=8.0M\nX=£606,061 @£606.1M\n* Where E1 is the exchange rate between Euros and in 1 year.\nThe transaction would be as follows:\nAction Now\nCash Flow in Eu\nros\nAction in 1 Year\n7Cash Flow in\nEuros *\nYou\nlend\n£606.1M\nin\nthe U.K.\n-909.15M\nThe amount you\nlent is repaid to\nyou and you ex\nchange it into\n1.08*(606.61M)*E1\nYou\nborrow\n909.15M Euros in\nGermany\n+909.15M\nYou\nrepay\nthe\namount\nyou\nborrowed\n-1.06*(909.15M)\nYou sell forward\n1.08*£606.1M in\nEuros\nUnwind\n1,08*£476.2M*(1.4\nE1)\nTotal\nTotal\n8.0M\n15.433\nMIT Sloan\n\n(c) The futures price would be:\nF0 = E0 ∗[(1+rGERMANY )/(1+rU.K.)]T = 3Euros/1£∗[(1.06)/(1.08)]1 = 2.94DM/1 (2)\n(d) They may not because the Euros may be appreciating relative to the . It is true that\ninvestments in Germany will grow less than investments in the U.K. but it is also through\nthat as time passes 1DM is worth more . This appreciation of the Euros with respect to the\ncan be seen by the fact that E0 is 1.5 Euros/1 £while F0 is 1.47 Euros /1 £. The future\nappreciation of the Euros with respect to the compensates for the difference in interest\nrates between the two countries.\n3. You are required to make a payment of 1,000,000 euros in each of the next four years. Your\nrevenues are in dollars and the current dollar-euro exchange rate is $.90 per euro. You believe\nthat the dollar will depreciate and would like to lock in the four payments of 1,000,000 euros\neach at today's exchange rate. In order to do so you decide to enter into a swap agreement.\nAssume that the U.S. and euro yield curves are flat at 6% and 8% respectively. (2 points)\n(a) What will be the swap rate on this agreement to exchange currency over a four-year period?\n(2 points)\nNote: Remember that a swap can be viewed as a portfolio of forward transactions, but instead\nof each transaction being priced independently, one unique forward price is applied to all trans\nactions.\nAnswer:\n(a) Solve the following equation:\nS/(1.06)1 + S/(1.06)2 + S/(1.06)3 + S/(1.06)4\n=\n[.9 ∗ (1.06/1.08)1]/(1.06)1 +\n[.9 ∗ (1.06/1.08)2]/(1.06)2 +\n[.9 ∗ (1.06/1.08)3]/(1.06)3 +\n[.9 ∗ (1.06/1.08)4]/(1.06)4\n(3)\nS/(1.06)1 + S/(1.06)2 + +S/(1.06)3 + S/(1.06)4\n=\n2.9809\n(4)\n3.4651 ∗ S\n=\n2.9809\n(5)\nS\n=\n$.8602 per euro\n(6)\n15.433\nMIT Sloan\n\nIn each of the following 4 years you will pay a fixed amount of $860,266 in exchange for 1,000,000\neuros.\n15.433\nMIT Sloan"
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/c18221d4b592f362e753038089a6171e_15433_assignment_3.pdf",
      "content": "15.433 INVESTMENTS\nAssignment 3: Futures\nSpring 2003\n\n1. A futures contract is available on a company that pays an annual dividend of $5 and whose stock\nis currently priced at $200. Each futures contract calls for delivery of 1,000 shares of stock in\none year, daily marking to market, an initial margin of 10% and a maintenance margin of 5%.\nThe current Treasury bill rate is 8%. (4 points)\n(a) Given the above information, what should the price of one futures contract be? (0.5 points)\n(b) If the company stock decreases by 7%, what will be, if any, the change in the futures price?\n(0.5 points)\n(c) As a result of the company stock decrease, will an investor that has a long position in one\nfutures contract of this company realize a gain or a loss? Why? What will be the amount\nof this gain or loss? (1 point)\n(d) What must the initial balance in the margin account be? Following the stock decrease,\nwhat will be, if any, the change in the margin account? Will the investor need to top up\nthe margin account? If yes, by how much and why? (1 point)\n(e) Given the company stock decrease, what is the percentage return on the investor's position?\nIs it higher, equal or lower than the 7% company stock decrease? Why? (1 point)\n2. You have recently been appointed CFO of a large multinational corporation based in Frank\nfurt. The CEO has asked you to raise 8,000,000 Euros one year from now to fund a strategic\ninvestment. The company has to raise the capital either through a U.K. (in £) or a Germany\n(in Euros) based bank. The annual interest rates on U.K. and German bills are 8% and 6%\nrespectively. The current exchange rate is 1.5 Euro per 1 £and the futures price for delivery one\nyear from now is 1.46 Euros per 1 £. (4 points)\n(a) Where would you lend and where would you borrow? (0.5 points)\n(b) You realize that given the above data, you can benefit from an arbitrage opportunity that\nwould allow you to raise the necessary capital at no cost for the company. Describe in\na table like the one below the necessary actions (and associated cash flows in Euros) you\nneed to take now and in one year in order earn 8,000,000 Euros in one year at no cost. (2\npoints)\n\nAction Now\nCash Flow in Eu\nros\nAction in 1 Year\nCash Flow in Eu\nros*\nTotal\nTotal\n(c) Assuming the interest rates and the current exchange rate given above are correct. What\nshould the futures price of 1 be in Euros according to the interest rate parity theorem? (0.5\npoints)\n(d) Discuss why wouldn't all investors decide to invest their money in the U.K., even though\nthe interest rate in the U.K. (8%) is higher than in Germany (6%.) (1 point)\n(e) They may not because the Euros may be appreciating relative to the £. It is true that\ninvestments in Germany will grow less than investments in the U.K. but it is also through\nthat as time passes 1DM is worth more . This appreciation of the Euros with respect to the\ncan be seen by the fact that E0 is 1.5 Euros/1 £while F0 is 1.47 Euros /1 £. The future\nappreciation of the Euros with respect to the compensates for the difference in interest\nrates between the two countries.\n3. You are required to make a payment of 1,000,000 euros in each of the next four years. Your\nrevenues are in dollars and the current dollar-euro exchange rate is $.90 per euro. You believe\nthat the dollar will depreciate and would like to lock in the four payments of 1,000,000 euros\neach at today's exchange rate. In order to do so you decide to enter into a swap agreement.\nAssume that the U.S. and euro yield curves are flat at 6% and 8% respectively. (2 points)\n(a) What will be the swap rate on this agreement to exchange currency over a four-year period?\n(2 points)\nNote: Remember that a swap can be viewed as a portfolio of forward transactions, but instead\nof each transaction being priced independently, one unique forward price is applied to all trans-\nactions."
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/8a8bd6fa0d1261b937b2e3032b0816fb_15433_assignment_4.pdf",
      "content": "15.433 INVESTMENTS\nAssignment 4: Option Simulation\nSpring 2003\n\nThe current spot exchange for British Pounds (£)is 0.620£/US$. This rate follows a normal distribu\ntion with daily mean zero and daily standard deviation 2.5 basis points. There are 252 business days\nin the coming year.\nPrice the following OTC options:\n1. binary option: pays $100mm if the rate is below 0.600£/US$ exactly one year from now.\n2. barrier option: pays $100mm if the rate crosses below 0.600£/US$ at any point before one year.\n3. step option: pays $100mm if the rate ends between 0.590-0.600£/US$, $200mm if the rate ends\n0.575-0.590£/US$, and $5mm if the rate ends below 0.550£/US$.\nHint: these questions are not easily solved analytically. Therefore, do a Monte-Carlo simulation\n(with minimum 10,000 iterations) to simulate the path of the exchange rate. BIG HINT: explore\nthe norminv() and rand() functions in Microsoft Excel, though feel free to use other program\nming languages.\nSince we cannot look your program code, make sure briefly summarize your program method\nology and problem-solving methodology to get partial credit in case your numerical solution is\nwrong.\nThe following questions address possible errors in our model of exchange rates. Use short an\nswers (no calculations necessary):\n4. Price estimation\n(a) What will happen to our price estimates if the true mean change in exchange rates is\nactually positive? Negative?\n(b) What will happen to our price estimates if the true standard deviation is higher than we\nmodel? Lower?\n5. Distribution\n(a) What if the true distribution of exchange rate changes is positively skewed? Negatively\nskewed?\n(b) What if the kurtosis is greater than that of normal distribution?\nBONUS (Not graded) Another more difficult but realistic spin is the following. Create a histogram of\nthe daily changes in the exchange rate for the past 3 years. Apply this empirical distribution to price\nthe series of options again using simulations. Although possible in Excel, this would be considerably\nmore difficult to do and calls for more advanced programming skills."
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_5_solution.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/95954b9066d5b16515ea2cfddd33158b_15433_assignment_5_solution.pdf",
      "content": "15.433 INVESTMENTS\nAssignment 5: Performance Attribution\nMIT Sloan School of Management\nSpring 2003\n\nExample with Currency Components\nAll returns are calculated back into the domestic currency. The foreign\nexchange exposures of the different asset classes are not perfectly hedged\nback into the domestic portfolio currency. The upper part of the table\ncontains the normal weights and normal returns required to calculate\nthe passive strategy of the individual asset categories.\nIn the second part of the table are the effective weights and the current\nreturns of the individual asset categories in the specific quarters.\nThe current weights and returns are adjusted from quarter to quarter\nto reflect the restructuring of the tactical asset allocation and the stock\npicking and result in the active over/-underweights.\nIn the lower part of the table are the individual performance compo\nnents resulting in the individual quarters (empty). Applying the same\napproach as in the class notes enables you to calculate the performance\ncomponents.\n\nx0/3\nx0/4\nx1/1\nx1/2\nx1/3\nx1/4\nx2/1\nentire period\nFI $\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\nFI Euro\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\nEq $\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\nEq Euro\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\nnormal\nweights\nFx\n10.00\n10.00\n10.00\n10.00\n10.00\n10.00\n10.00\nFI $\n-0.75\n1.26\n4.53\n2.09\n0.46\n0.91\n3.26\nFI Euro\n1.74\n5.20\n1.77\n1.52\n5.86\n5.22\n-2.54\nEq $\n-28.62\n1.39\n16.02\n0.85\n-1.12\n-2.18\n7.79\nEq Euro\n-14.46\n8.81\n13.78\n-0.21\n5.27\n8.41\n-2.39\nnormal returns\nFx\n-8.55\n-1.75\n12.36\n7.54\n-7.27\n-6.23\n9.82\nFI $\n57.50\n53.70\n55.70\n52.30\n54.50\n53.80\n52.40\nFI Euro\n12.50\n16.50\n15.80\n16.10\n15.90\n15.70\n16.50\nEq $\n22.50\n22.10\n22.30\n23.60\n23.50\n23.10\n23.20\nEq Euro\n7.50\n7.70\n6.20\n8.00\n6.10\n7.40\n7.90\ncurrent\nweights\nFx\n10.00\n14.00\n0.00\n5.00\n12.00\n8.00\n15.00\nFI $\n-0.32\n0.81\n4.22\n2.12\n1.15\n0.78\n2.32\nFI Euro\n1.03\n5.45\n1.20\n0.95\n6.02\n4.25\n-1.39\nEq $\n-26.19\n1.99\n16.69\n0.97\n0.16\n-3.89\n10.09\ncurrent\nreturns\nEq Euro\n-13.46\n7.44\n15.82\n0.00\n4.80\n7.32\n-0.53\nstrategy\nmarkets\ncurrency\nselectivity\ninteraction\ntotal realized\nreturn from active management\nTable 1: Example for performance components with currency exposure\nProblem-statement: Calculate the performance components.\n\nSolution:\nx0/3\nx0/4\nx1/1\nx1/2\nx1/3\nx1/4\nx2/1\nentire period\nFI $\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\nFI Euro\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\nEq $\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\nEq Euro\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\nnormal\nweights\nFx\n10.00\n10.00\n10.00\n10.00\n10.00\n10.00\n10.00\nFI $\n-0.75\n1.26\n4.53\n2.09\n0.46\n0.91\n3.26\nFI Euro\n1.74\n5.20\n1.77\n1.52\n5.86\n5.22\n-2.54\nEq $\n-28.62\n1.39\n16.02\n0.85\n-1.12\n-2.18\n7.79\nEq Euro\n-14.46\n8.81\n13.78\n-0.21\n5.27\n8.41\n-2.39\nnormal returns\nFx\n-8.55\n-1.75\n12.36\n7.54\n-7.27\n-6.23\n9.82\nFI $\n57.50\n53.70\n55.70\n52.30\n54.50\n53.80\n52.40\nFI Euro\n12.50\n16.50\n15.80\n16.10\n15.90\n15.70\n16.50\nEq $\n22.50\n22.10\n22.30\n23.60\n23.50\n23.10\n23.20\nEq Euro\n7.50\n7.70\n6.20\n8.00\n6.10\n7.40\n7.90\ncurrent\nweights\nFx\n10.00\n14.00\n0.00\n5.00\n12.00\n8.00\n15.00\nFI $\n-0.32\n0.81\n4.22\n2.12\n1.15\n0.78\n2.32\nFI Euro\n1.03\n5.45\n1.20\n0.95\n6.02\n4.25\n-1.39\nEq $\n-26.19\n1.99\n16.69\n0.97\n0.16\n-3.89\n10.09\ncurrent\nreturns\nEq Euro\n-13.46\n7.44\n15.82\n0.00\n4.80\n7.32\n-0.53\nstrategy\n-8.59\n2.17\n8.70\n2.32\n0.41\n0.69\n4.11\n9.82\nmarkets\n0.00\n0.17\n-0.23\n-0.05\n0.10\n0.11\n-0.22\n-0.12\ncurrency\n0.00\n-0.07\n-1.24\n-0.38\n-0.15\n0.12\n0.49\n-1.21\nselectivity\n0.78\n-0.20\n0.05\n-0.01\n0.67\n-0.66\n0.26\n0.90\ninteraction\n0.00\n0.02\n-0.04\n-0.02\n0.00\n-0.04\n0.12\n0.05\ntotal realized\n-7.81\n2.10\n7.24\n1.87\n1.04\n0.23\n4.76\n9.43\nreturn from active management\n0.78\n-0.14\n-2.69\n-0.83\n0.48\n-0.34\n1.14\n-0.39\nTable 2: Example for performance components with currency exposure\nOver the entire time period, the deviation from the strategic currency\nexposure reduced the performance by -1.21%. The loss has been partially\ncompensated through stock selection.\nIn the third quarter, the active performance of 0.48% is calculated as\nfollowing:\n1. strategy: (0.575*0.46%)+(0.125*5.86%)+(0.225*-1.12%)+\n(0.075*5.27%)+(0.01*-7.27%)=0.41%\n2. markets:\n(0.545-0.575)*0.46%+(0.159-0.125)*5.86%+(0.235-0.225)*-1.12%+\n\n(0.061-0.075)*5.27%=0.10%\n3. selectivity:\n(0.12-0.10)*-7.27%=-0.15\n4. total realized:\n(0.545*1.15%)+(0.159*6.02%)+(0.235*0.16%)*(0.061*4.8%)+\n(0.12*-7.27%)=1.04%"
    },
    {
      "category": "Assignment",
      "title": "15433_assignment_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/c496be88922f9dc7329c61cfa83ec3f7_15433_assignment_5.pdf",
      "content": "15.433 INVESTMENTS\nAssignment 5: Performance Attribution\nSpring 2003\n\nExample with Currency Components\nAll returns are calculated back into the domestic currency. The foreign\nexchange exposures of the different asset classes are not perfectly hedged\nback into the domestic portfolio currency. The upper part of the table\ncontains the normal weights and normal returns required to calculate\nthe passive strategy of the individual asset categories.\nIn the second part of the table are the effective weights and the current\nreturns of the individual asset categories in the specific quarters.\nThe current weights and returns are adjusted from quarter to quarter\nto reflect the restructuring of the tactical asset allocation and the stock\npicking and result in the active over/-underweights.\nIn the lower part of the table are the individual performance compo\nnents resulting in the individual quarters (empty). Applying the same\napproach as in the class notes enables you to calculate the performance\ncomponents.\n\nx0/3\nx0/4\nx1/1\nx1/2\nx1/3\nx1/4\nx2/1\nentire period\nFI $\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\nFI Euro\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\nEq $\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\nEq Euro\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\nnormal\nweights\nFx\n10.00\n10.00\n10.00\n10.00\n10.00\n10.00\n10.00\nFI $\n-0.75\n1.26\n4.53\n2.09\n0.46\n0.91\n3.26\nFI Euro\n1.74\n5.20\n1.77\n1.52\n5.86\n5.22\n-2.54\nEq $\n-28.62\n1.39\n16.02\n0.85\n-1.12\n-2.18\n7.79\nEq Euro\n-14.46\n8.81\n13.78\n-0.21\n5.27\n8.41\n-2.39\nnormal returns\nFx\n-8.55\n-1.75\n12.36\n7.54\n-7.27\n-6.23\n9.82\nFI $\n57.50\n53.70\n55.70\n52.30\n54.50\n53.80\n52.40\nFI Euro\n12.50\n16.50\n15.80\n16.10\n15.90\n15.70\n16.50\nEq $\n22.50\n22.10\n22.30\n23.60\n23.50\n23.10\n23.20\nEq Euro\n7.50\n7.70\n6.20\n8.00\n6.10\n7.40\n7.90\ncurrent\nweights\nFx\n10.00\n14.00\n0.00\n5.00\n12.00\n8.00\n15.00\nFI $\n-0.32\n0.81\n4.22\n2.12\n1.15\n0.78\n2.32\nFI Euro\n1.03\n5.45\n1.20\n0.95\n6.02\n4.25\n-1.39\nEq $\n-26.19\n1.99\n16.69\n0.97\n0.16\n-3.89\n10.09\ncurrent\nreturns\nEq Euro\n-13.46\n7.44\n15.82\n0.00\n4.80\n7.32\n-0.53\nstrategy\nmarkets\ncurrency\nselectivity\ninteraction\ntotal realized\nreturn from active management\nTable 1: Example for performance components with currency exposure\nProblem-statement: Calculate the performance components."
    },
    {
      "category": "Exam",
      "title": "quizapril_1_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/5db22828d7c8ffbe14795b277207b091_quizapril_1_solutions.pdf",
      "content": "Quiz For Lecture # 13\nHedge a Swiss watches transaction\nUse the following information below to answer questions a through g: 1\nAn American importer places an order with a Swiss watch manufacturer. The order, to be\ndelivered in August, is value at 2`000`000 Swiss Francs. The cash price for the franc is $\n.5975 and September futures are trading at $ .5715.\n(Reminder: Showing the essential steps along the way will enhance your chances of\npartial credit in case you make an error.)\n1a.\n(3 pts) The total value of the order on the day it is pace is:\na\n$ 2`000`000\n\nb\n$ 1`195`000\n\nc\n$ 1`143`000\n\nd\nnon of the above\n1b.\n(3 pts) The most effective hedge for the importer would be:\na\nBuy Swiss francs in the cash market and sell Swiss franc futures.\nb\nSell Swiss francs in the cash market and buy Swiss franc futures.\nc\nBuy Swiss franc futures.\nd\nSell Swiss franc futures.\n1c.\n(3 pts) If the importer were to take a position in the futures market, and the Swiss\nfranc contract size is 125`000, he would take a position of\na\n4 contracts\nb\n6 contracts\nc\n8 contracts\nd\n16 contracts\n1d.\n(3 pts) On the day the watches are delivered, the cash market price of the Swiss\nfranc is $ .6135 and September futures are $ .5855. If the importer did not take\nany action in the futures market when he place the order, it would now cost him:\na\n$ 2`000`000\nb\n$ 1`227`000\nc\n$ 1`195`000\nd\n$ 1`169`000\nThis question is taken from a former final exam. It was worth 25% of the entire final exam.\n\n1e.\n(3 pts) If the importer did not take any action in the cash or futures market on the\nday he placed the order, his cost would be:\na\nthe same\nb\nincreased by $ 32`000\nc\ndecreased by $ 32`000\nd\nnon of the above\n1f.\n(3 pts) If the importer hedged his position, his net result on the hedge would be:\na\na profit of .016\nb\na loss of .016\nc\na profit of .002\nd\na loss of .002\n1g.\n(3 pts) If the importer had hedged when he placed the order, his net cost would\nhave:\na\nincreased by $ 9`000\nb\ndecreased by $ 17`000\nc\nincreased by $ 4`000\nd\ndecreased by $ 4`000\n1h.\n(4 pts) As a result of the change in the cash and futures prices, how was the\nimporter's hedge affected?\na.\na favorable change from 0.026 under to 0.028 under\nb.\na favorable change from 0.026 over to 0.028 over\nc.\nan adverse change from 0.026 under to 0.028 under\nd.\nan adverse change from 0.026 over to 0.028 over\nHedge a Swiss watches transaction\n1a.\nThe correct answer is (b). on the day the order is placed, the spot price for the\nSwiss franc is $.5975 (59.75 cents). In order f or the importer to buy 2,000,000 Swiss\nfrancs, he would require $1,195,000 (2,000,000 times .5975).\n1b.\nThe correct answer is (c). The importer is short the Swiss franc (short the basis).\nHe is concerned with a rise in the price of the Swiss franc. If the price rises, he will have\nto pay more dollars to acquire the same number of francs. Therefore, he will buy Swiss\nfranc futures.\n\n1c.\nThe correct answer is (d). The importer needs 2,000,000 francs. The contract size\nis 125,000 francs. Therefore, he will buy 16 contracts (2,000,000 divided by 125,000).\n1d.\nThe correct answer is (b). The importer must buy 2,000,000 francs in order to\nmake payment to the Swiss exporter. The current price for the franc in the cash market is\n$.6135 (61.35 cents). It would cost him $1,227,000 to purchase 2,000,000 francs.\n1e.\nThe correct answer is (b). If the importer did not hedge his position, he would\nhave to absorb the full amount of the increase in the value of the franc. At the time\npayment is due, the dollar value is $1,227,000 (.6135 times 2,000,000). The initial cost\nwhen the order was placed was $1,195,000 (.5975 times 2,000,000). The importer would\nhave an increased cost of $32,000 if he did not hedge.\n1f.\nThe correct answer is (d). When the importer first placed the order, he was short\nthe Swiss franc (short the basis) and placed a buying hedge. He would close out his\nposition by buying the franc in the cash market and selling his futures. His position would\nappear as follows:\nCash\nFutures\nShort\n0.5975\nBuy\n0.5715\nBuy\n0.6135\nSell\n0.5855\nLoss\n0.016\nProfit\n0.014\nThe loss on the cash position is .016 (1.6 cents) on each franc. The profit on futures is\n.014 (1.4 cents) on each franc. Therefore, the net loss on each franc is .002 (2/10th of I\ncent).\n1g.\nThe correct answer is (c). Referring to the preceding question, the importer has a\nloss of $.002 (2/10th of 1 cent) on each franc4 As the order totaled 2,000,000 francs, the\ntotal loss would be $4,000 (2,000,000 times .002). Note that if the importer had not\nhedged, his added cost would have been $32,000. As a result of having hedged, he\nlimited his increased cost to $4,000.\n1h.\nThe correct answer is (a). When the importer placed the order, the basis was 0.026\n(2.6 cents) under. Cash was 2.6 cents higher than futures (0.5715 minus 0.5975). When\nthe hedge was lifted, the basis changed to 0.028 (2.8 cents) under. Cash was 2.8 cents\nhigher than futures (0.5855 minus 0.6135). As we have already seen, the hedger had a\nprofit of .002 (2/10th of 1 cent) on his hedge. Therefore, the basis change was favorable."
    },
    {
      "category": "Exam",
      "title": "quizapril_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/1f210543139c17cb407eeab8b8b8d24b_quizapril_1.pdf",
      "content": "Quiz For Lecture # 13\nHedge a Swiss watches transaction\nUse the following information below to answer questions a through g: 1\nAn American importer places an order with a Swiss watch manufacturer. The order, to be\ndelivered in August, is value at 2`000`000 Swiss Francs. The cash price for the franc is $\n.5975 and September futures are trading at $ .5715.\n(Reminder: Showing the essential steps along the way will enhance your chances of\npartial credit in case you make an error.)\n1a.\n(3 pts) The total value of the order on the day it is pace is:\na\n$ 2`000`000\n\nb\n$ 1`195`000\n\nc\n$ 1`143`000\n\nd\nnon of the above\n1b.\n(3 pts) The most effective hedge for the importer would be:\na\nBuy Swiss francs in the cash market and sell Swiss franc futures.\nb\nSell Swiss francs in the cash market and buy Swiss franc futures.\nc\nBuy Swiss franc futures.\nd\nSell Swiss franc futures.\n1c.\n(3 pts) If the importer were to take a position in the futures market, and the Swiss\nfranc contract size is 125`000, he would take a position of\na\n4 contracts\nb\n6 contracts\nc\n8 contracts\nd\n16 contracts\n1d.\n(3 pts) On the day the watches are delivered, the cash market price of the Swiss\nfranc is $ .6135 and September futures are $ .5855. If the importer did not take\nany action in the futures market when he place the order, it would now cost him:\na\n$ 2`000`000\nb\n$ 1`227`000\nc\n$ 1`195`000\nd\n$ 1`169`000\nThis question is taken from a former final exam. It was worth 25% of the entire final exam.\n\n1e.\n(3 pts) If the importer did not take any action in the cash or futures market on the\nday he placed the order, his cost would be:\na\nthe same\nb\nincreased by $ 32`000\nc\ndecreased by $ 32`000\nd\nnon of the above\n1f.\n(3 pts) If the importer hedged his position, his net result on the hedge would be:\na\na profit of .016\nb\na loss of .016\nc\na profit of .002\nd\na loss of .002\n1g.\n(3 pts) If the importer had hedged when he placed the order, his net cost would\nhave:\na\nincreased by $ 9`000\nb\ndecreased by $ 17`000\nc\nincreased by $ 4`000\nd\ndecreased by $ 4`000\n1h.\n(4 pts) As a result of the change in the cash and futures prices, how was the\nimporter's hedge affected?\na.\na favorable change from 0.026 under to 0.028 under\nb.\na favorable change from 0.026 over to 0.028 over\nc.\nan adverse change from 0.026 under to 0.028 under\nd.\nan adverse change from 0.026 over to 0.028 over"
    },
    {
      "category": "Exam",
      "title": "QuizMarch_5_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/eb76754f443cda7d0d0400b75351ab2d_QuizMarch_5_solutions.pdf",
      "content": "Quiz On The Day After Lecture # 9\nSingle-Index and Multifactor Models\nConsider the following two regression lines for stocks A and B in the following figure.\nrA - rf\nrB - rf\nrM - rf\nrM - rf\nFigure 1: Regressions of Stock A and B vs. Market\nwhich stock has higher firm-specific risk?\nWhich stock has greater systematic (market) risk\nWhich stock has higher R2\nwhich stock has higher alpha?\nwhich stock has higher correlation with the market?\nProblem-statement: Discuss the questions, no analytical solution required.\n\nSolution:\nBKM ch. 3, p. 314 # 3\nThe two figures depict the stocks security characteristic lines (SCL) Stock A has a higher\nfirm-specific risk because the deviations from the SCL are larger for A than for B.\nDeviations are measured by the vertical distance of each observation from the SCL.\nBeta is the slope of the SCL, which is the measure of systematic risk. Stock B's SCL is\nsteeper, hence stock B's systematic risk is greater.\nThe R2 (or squared correlation coefficient) of the SCL is the ratio of the explained\nvariance of the stock's return to total variance, and the total variance is the sum of the\nexplained variance plus the unexplained variance (the stock's residual variance).\ni\nR2 =\nβ σ M\nβi\n2σ 2 +σ εi\nM\nSince stock B's explained variance is higher (its explained variance is βBσ M , which is\ngreater since its beta is higher, and its residual variance βB\n2σ 2 is smaller, its R2 is higher\nεB\nthan stock A's.\nAlpha is the intercept of the SCL with the expected return axis. Stock A has a small\npositive alpha whereas stock B has a negative alpha, hence stock a's Alpha is larger.\nThe correlation coefficient is simply the square root of R2, sto stock's B correlation with\nthe market is higher.\nρi M =\nR =\n,\ni\ni\ni\nε\nβ σ\nβ σ\n+\nM\nM\nσ\nTry to solve the following questions 4,5 and 6 analytically."
    },
    {
      "category": "Exam",
      "title": "QuizMarch_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/be4cb7911e712a57f140e0d52fda5869_QuizMarch_5.pdf",
      "content": "Quiz On The Day Before Lecture # 9\nSingle-Index and Multifactor Models\nConsider the following two regression lines for stocks A and B in the following figure.\nrA - rf\nrB - rf\nrM - rf\nrM - rf\nFigure 1: Regressions of Stock A and B vs. Market\nwhich stock has higher firm-specific risk?\nWhich stock has greater systematic (market) risk\nWhich stock has higher R2\nwhich stock has higher alpha?\nwhich stock has higher correlation with the market?\nProblem-statement: Discuss the questions, no analytical solution required."
    },
    {
      "category": "Exam",
      "title": "QuizMarch_7_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/20138a5b83e98f92fe6755e8cba05460_QuizMarch_7_solutions.pdf",
      "content": "Quiz On The Day Before Lecture # 9\nArbitrage Pricing Theory\nSuppose that there are two independent economic factors F1 and F2. The risk-free rate is\n6%, and all stocks have independent firm-specific components with a standard deviation\nof 45%. The following are well-diversified portfolios:\nPortfolio\nBeta on F1\nBeta on F2\nExpected Return\nA\n1.5\n2.0\n\nB\n2.2\n-0.2\n\nTable 1: Scenarios for 2 stocks with 2 Factors\nWhat is the expected return-beta relationship in this economy?\nSolution\nBKM ch. 11, p. 335 # 2\nE (rp ) =\n+ β1, p E ( r1 ) - rf + β2, p E ( r2 ) - rf\nrf\nWe need to find the risk premium [rp] for each of the two factors:\nrp1 = [E(r1)-rf] and\nrp2 = [E(r2)-rf]\nTo do so, the following system of two equations with to unknowns must be solved:\n21 = 6 + 1.5 x rp1 + 2.0 x rp2\n27 = 6 + 2.2 x rp1 + (-0.2) x rp2\nThe solution to this set of equation is\nrp1 = 10% and rp2 = 5%\nThus, the expected return-beta relationship is:\n( p ) = 6% + β1, p ⋅10% + β2, p ⋅ 5%\nE r"
    },
    {
      "category": "Exam",
      "title": "QuizMarch_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/a6e0be5985b9baf8fa62fb67a98d4448_QuizMarch_7.pdf",
      "content": "Quiz On The Day After Lecture # 9\nArbitrage Pricing Theory\nSuppose that there are two independent economic factors F1 and F2. The risk-free rate is\n6%, and all stocks have independent firm-specific components with a standard deviation\nof 45%. The following are well-diversified portfolios:\nPortfolio\nBeta on F1\nBeta on F2\nExpected Return\nA\n1.5\n2.0\nB\n2.2\n-0.2\nTable 1: Scenarios for 2 stocks with 2 Factors\nWhat is the expected return-beta relationship in this economy?"
    },
    {
      "category": "Exam",
      "title": "quizmarch_11_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/14a08a085c3c6bff9da612135847861b_quizmarch_11_solutions.pdf",
      "content": "Quiz For Lecture # 10\nQuestion 1)\nConsider the regression equation:\nri - rf = g0 + g1bi + g2σ e\ni + eit\nwhere:\nri - rt = the average difference between the monthly return on stock i and the monthly\nrisk-free rate\nbi = the beta of stock i\nσ2\nei = a measure of the nonsystematic variance of the stock i.\nIf you estimated this regression equation and the CAPM was valid, you would expect the\nestimated coefficient, g2 to be\nA)\n\nB)\n\nC)\nequal to the risk-free rate of return\nD)\nequal to the average difference between the monthly return on the market portfolio\nand the monthly risk-free rate\nE)\nnone of the above\nAns: A\nQuestion 2)\nConsider a well-diversified portfolio, A, in a two-factor economy. The risk-free rate is\n6%, the risk premium on the first factor portfolio is 4% and the risk premium on the\nsecond factor portfolio is 3%. If portfolio A has a beta of 1.2 on the first factor and .8 on\nthe second factor, what is its expected return?\nA)\n7.0%\n\nB)\n8.0%\n\nC)\n9.2%\nD)\n13.0%\nE)\n13.2%\n\nAns: E\nQuestion 3)\nSecurity A has a beta of 1.0 and an expected return of 12%. Security B has a beta of 0.75\nand an expected return of 11%. The risk-free rate is 6%. Explain the arbitrage opportunity\nthat exists; explain how an investor can take advantage of it. Give specific details about\nhow to form the portfolio, what to buy and what to sell.\nAns:\nAn arbitrage opportunity exists because it is possible to form a portfolio of\nsecurity A and the risk-free asset that has a beta of 0.75 and a different expected return\nthan security B. The investor can accomplish this by choosing .75 as the weight in A and\n.25 in the risk-free asset. This portfolio would have E(rp) = 0.75(12%) + 0.25(6%) =\n10.5%, which is less than B's 11% expected return. The investor should buy B and\nfinance the purchase by short selling A and borrowing at the risk-free asset."
    },
    {
      "category": "Exam",
      "title": "quizmarch_11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/3f23dec58b291f1cc282638408dc6350_quizmarch_11.pdf",
      "content": "Quiz For Lecture # 10\nQuestion 1)\nConsider the regression equation:\nri - rf = g0 + g1bi + g2σ e\ni + eit\nwhere:\nri - rt = the average difference between the monthly return on stock i and the monthly\nrisk-free rate\nbi = the beta of stock i\nσ2\nei = a measure of the nonsystematic variance of the stock i.\nIf you estimated this regression equation and the CAPM was valid, you would expect the\nestimated coefficient, g2 to be\nA)\n\nB)\n\nC)\nequal to the risk-free rate of return\nD)\nequal to the average difference between the monthly return on the market portfolio\nand the monthly risk-free rate\nE)\nnone of the above\nAns:\nQuestion 2)\nConsider a well-diversified portfolio, A, in a two-factor economy. The risk-free rate is\n6%, the risk premium on the first factor portfolio is 4% and the risk premium on the\nsecond factor portfolio is 3%. If portfolio A has a beta of 1.2 on the first factor and .8 on\nthe second factor, what is its expected return?\nA)\n7.0%\n\nB)\n8.0%\n\nC)\n9.2%\nD)\n13.0%\nE)\n13.2%\n\nAns:\nQuestion 3)\nSecurity A has a beta of 1.0 and an expected return of 12%. Security B has a beta of 0.75\nand an expected return of 11%. The risk-free rate is 6%. Explain the arbitrage opportunity\nthat exists; explain how an investor can take advantage of it. Give specific details about\nhow to form the portfolio, what to buy and what to sell.\nAns:"
    },
    {
      "category": "Exam",
      "title": "quizMarch_13_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/dc60ce27586275729f2755a2d7e6a885_quizMarch_13_solutions.pdf",
      "content": "Quiz For Lecture # 11\nEuropean Call Option using Black-Scholes/Merton\nConsider a European call option on a stock when there are ex-dividend dates in two\nmonths and five months. The dividend on each ex-dividend date is expected to be $ 0.50.\nThe current share price is $50 and the strike price is $50. The stock price volatility is 20%\nper annum and the risk free rate is 8.329% per annum, the volatility is continuously\ncompounded, the interest rate is a simple interest rate, the time to maturity is six months.\nCalculate the call option's price and delta using Black-Scholes/Merton.\n(Reminder: Showing the essential steps along the way will enhance your chances of\npartial credit in case you make an error.)1\nr = n ⋅ ln 1 + r1\n0.08=1 · ln (1+0.08329/1)\n\nn\n-0.08 ⋅\n-0.08 ⋅\nd = 0.5 ⋅ e\n12 + 0.5 ⋅ e\n12 = 0.9770\ny\n- r T\n(\n(\nc0 = (S0-dy) ⋅ N d1) - Ke\nf N d2)\nwhere\nln\n\nS0 - d y\n+\nrf + σ 2\nT\nd1 =\n\nK\nT\nσ\n\nand\nd 2 = d1 -σ T\nS0 = 50, K = 50, rf= 0.08, σ = 0.2, T = 0.5.\nWe can use the discounted dividend of 0.977 and deduct it from the spot price of the\nstock. Using the B-S/M formula on a dividend-paying stock,\n50 - 0.977\n\n0.22 6\nd1 =\n.0\n⋅\nln\n\n+\n0.08 +\n\n⋅ 12\n= 0.2140\nand\nd2 = d1 - 0.2√0.5 =\n0.0.0726\nThis question is taken from a former midterm exam. It was worth 25% of the entire midterm.\n\nThis implies that:\nN(d1) = 0.58, N(d2) = 0.53\nso that the call price c0 from the B-S/M formula is:\nc0 = (50-0.977) · 0.58 - 50 · 0.53 · e-0.08 x 0.5 = 3.26."
    },
    {
      "category": "Exam",
      "title": "quizMarch_13.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/baac721e3420718909155750806a990b_quizMarch_13.pdf",
      "content": "Quiz For Lecture # 11\nEuropean Call Option using Black-Scholes/Merton\nConsider a European call option on a stock when there are ex-dividend dates in two\nmonths and five months. The dividend on each ex-dividend date is expected to be 0.$ 50.\nThe current share price is $50 and the strike price is $50. The stock price volatility is 20%\nper annum and the risk free rate is 8.329% per annum, the volatility is continuously\ncompounded, the interest rate is a simple interest rate, the time to maturity is six months.\nCalculate the call option's price and delta using Black-Scholes/Merton.\n(Reminder: Showing the essential steps along the way will enhance your chances of\npartial credit in case you make an error.)1\nThis question is taken from a former midterm exam. It was worth 25% of the entire midterm."
    },
    {
      "category": "Resource",
      "title": "15433_20a_active_management.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/85f4eff20857d0e5e7ff0b5cc80d522f_15433_20a_active_management.pdf",
      "content": "15.433 INVESTMENTS\nClass 20: Active Portfolio Management\nSpring 2003\n\nFinancial instruments are increasing in\nnumber and complexity\nSupranationals\nInterest rate-options\nCross-currency hedges\nCurrency-\nCurrency-\nforwards\noptions\nAgencies\n\nProxy hedges\nComplex domestic markets\nGovernment\nFutures\n\nIndex-linked bonds\nSemigovernments\nSwaps\n\nVolatility options\nAgencies\n\nInflation protected\nSupranationals\nSupranationals\ngovernment bonds\nSwaptions\nCDO / MBA\nExotic currency options\n\nKey question for every investor\nWhat is the goal for the total portfolio?\nWhat is the time frame for achieving that goal?\nWhat is the tolerance for loss/uncertainty within a shorter term (one-,\nthree-, six-month) period?\nWhich kinds of risk are acceptable/unacceptable?\nWhat are you willing to pay for active risk management? (e.g. cur\nrency hedges)\nHow do you monitor/evaluate your risk management?\n\nThe risk-versus-return compass\nIncreasing compensated risks can increase returns\nTwo major types of compensated risk:\n- Credit\n- Market\nAre these areas of \"skill\" ?\nOptimize the risk exposure\nInsufficient evidence of \"skill\" ?\nIgnore, hedge or transfer the risk?\nSame Risk\nMore Return\nLess Risk\nStarting\nPortfolio\nStarting\nPortfolio\nMore Risk\nSame Return\nSame Return\nSame Risk\nLess Return\n\nHigher Moments of Asset\nAsset -→ Return -→ Risk\n∂(asset)\n∂∆\n= return\nchange in value of asset\n∂(return) = risk\nspeed of change\n∂∆\n∂(risk) = higher moments of risk profile of speed\n∂∆\n\nActive vs. Passive management\nActive management means allocation of resources based on an active\nstrategy. Usually active management is performed against a benchmark,\nrequiring intended over-/ underweights of positions.\nPassive management means following an index, benchmark or another\nportfolio using quantitative techniques, such as principal component\nanalysis to replicate an index.\nThe discussion of active vs passive management is linked to the effi\ncient market discussion: Can information add value (performance).\nStrategic Asset\nAllocation\nTactical Asset\nAllocation\nStock Picking\nTop-Down\nBottom-Up\nFigure 3: Bottom-up vs. top down approach\n\nFrom Where does Superior Performance\nCome?\nFrom Where does Superior Performance Come? Superior performance\narises from active investment decisions which differentiate the portfolio\nfrom a \"passive\" benchmark These decisions include:\n- Market Timing: Altering market risk exposure through time to\nmake advantage of market fluctuations;\n- Sectoral emphasis: Weighting the portfolio towards (or away from)\ncompany attributes, such as size, leverage, book/price, and yield,\nand towards (or away from) industries;\n- Stock selection: Marking bets in the portfolio based on informa\ntion idiosyncractic to individual securities;\n- Trading: large funds can earn incremental reward by accommodat\ning hurried buyers and sellers.\n\nSome Definitions\nActive management: The pursuit of transactions with the objective of\nprofiting from competitive information - that is, information that would\nlose its value if it were in the hands of all market participants Active man\nagement is characterized by a process of continued research to generate\nsuperior judgment, which is then reflected in the portfolio by transac\ntions that are held in order to profit from the judgment and that are\nliquidated when the profit has been earned.\nAlpha: The \"risk adjusted expected return\" or the return in excess of\nwhat would be expected from a diversified portfolio with the same sys\ntematic risk When applied to stocks, alpha is essentially synonymous\nwith misvaluation: a stock with a positive alpha is viewed as under\nvalued relative to other stocks with the same systematic risk, and a\nstock with a negative alpha is viewed as overvalued relative to other\nstocks with the same systematic risk When applied to portfolios, alpha\nis a description of extraordinary reward obtainable through the portfolio\nstrategy. Here it is synonymous with good active management: a bet\nter active manager will have a more positive alpha at a given level of risk.\nAlpha, historical: The difference between the historical performance and\nwhat would have been earned with a diversified market portfolio at the\nsame level of systematic risk over that period. Under the simplest proce\ndures, historical alpha is estimated as the constant term in a time series\nregression of the asset or portfolio return upon the market return.\n\nAlpha, judgmental: The final output of a research process, embody\ning in a single quantitative measure the degree of under or overvaluation\nof the stocks Judgmental alpha is a product of investment research and\nunique to the individual or organization that produces it is derived from\na \"forecast\" of extraordinary return, but it has been adjusted to be the\nexpected value of subsequent extraordinary return. For example, among\nthose stocks that are assigned judgmental alphas of 2 percent, the aver\nage performance (when compared to other stocks of the same systematic\nrisk with alphas of zero) should be 2 percent per annum. Thus, average\nexperienced performance for any category of judgmental alpha should\nequal the alpha itself. A judgmental alpha is a prediction, not retro\nspective experience.\nAlpha, required: The risk adjusted expected return required to cause\nthe portfolio holding to be optimal, in view of the risk/reward tradeoff.\nThe required alpha is found by solving for the contribution of the hold\ning to portfolio risk and by applying a risk/reward tradeoff to find the\ncorresponding alpha. It can be viewed as a translation of portfolio risk\nexposure into the judgment which warrants that exposure.\n\nCAPM\nExpected\nReturn\nBeta (β)\nSecurity Market Line\nM\n(rf)\nβ = 1\n(rM)\nExpected\nRisk\nPremium\ndefensive\naggressive\nRisk free Investment\nInvestment in Market\nFigure: CAPM and market-aggressivity\nE (ri) - rf\nβi =\n(1)\nE (rM ) - rf\ncov (ri, rM )\nβi =\nσ2\n(2)\nM\n\nAPT\nAPT says:\n- Expected excess return for any asset is a weighted combination of\nthe asset's exposure to factors.\nAPT does not say:\n- What the factors are or what the weights are.\nSo what?\n- CAPM forecasts can be used for performance measurement, i.e. beat\nthe index;\n- APT forecasts are difficult to use for performance - remember they\nare arbitrary;\n- A good APT forecast can help you to outperform the index;\n- APT is an active management tool based on a multifactor model.\n\nFactor Models\nR2 = 1 - var (εi)\n(3)\nvar (ri)\nri = [bi,1F1 + bi,2F2 + · · · + bi,nFn]\n(4)\nA factor models tries to explain the variation of return, which is a trans\nformation of the original level: asset behavior.\nSome techniques help to understand what moves the assets and thus\ndetermines return and risk. The principal component analysis is fre\nquently used, but . . . first hand interpretation is maybe not intuitive.\n\n\"Shall I go long principal component 2 and short principal component 4\n?\"\nLe Penseur, Rodin 1880\n\nThe Treynor-Black Model\nMix Security Analysis with Portfolio Theory\nSuppose that you find several securities appear to be mispriced relative\nto the pricing model of your choice, say the CAPM.\nAccording to the CAPM, the expected return of any security with βk\nis:\nCAPM\nμ\n= rf + βk · (E (rM ) - rf)\n(5)\nk\nLet A be subset with \"mis-priced\" securities. For any security k ∈ A,\nyou find that\nCAPM\nrk = αk + μk\n+ εk\n(6)\nwhere αk is the perceived abnormal return.\nYou would like to exploit the \"mis-pricing\" in the subset A. For this,\nyour form a portfolio A, consisting of the \"mis-priced\" securities. At the\nsame time, you believe that the rest of the universe is fairly priced.\nThe rest of the portfolio allocation problem then becomes a standard\none:\n- The objective is that of a mean-variance investor.\n- The choice of assets:\n1. The market portfolio with μM and σM\n2. The portfolio of \"mis-priced\" securities A,\n3. with μA and σA\n\n4. The riskfree asset.\n- The solution: same as the one we considered in Class 5.\n\nThe Black-Litterman Model\nMix Beliefs with Portfolio Theory\nThe Black-Litterman asset allocation model, developed when both au\nthors were working for Goldman Sachs, is a significant modification of\nthe traditional mean-variance approach. In the mean-variance approach\nof Markowitz, the user inputs a complete set of expected returns and the\nvariance-covariance matrix, and the portfolio optimizer generates the op\ntimal portfolio weights. Due to the complex mapping between expected\nreturns and portfolio weights, users of the standard portfolio optimizers\noften find that their specification of expected returns produces output\nportfolio weights which may not make sense. These unreasonable results\nstem from two well recognized problems:\n1. Expected returns are very difficult to estimate. Investors typically\nhave knowledgeable views about absolute or relative returns in only\na few markets. A standard optimization model, however, requires\nthem to provide expected returns for all assets.\n2. The optimal portfolio weights of standard asset allocation models\nare extremely sensitive to the return assumptions used.\nThese two problem compound each other; the standard model has no\nway to distinguish strongly held views from auxiliary assumptions, and\nthe optimal portfolio it generates, given its sensitivity to the expected\nreturns, often appears to bear little or no relation to the views the in\nvestor wishes to express.\n\nIn practice, therefore, despite the obvious attractions of a quantitative\napproach, few global investment managers regularly allow quantitative\nmodels to play a major role in their asset allocation decision. In the\nBlack-Litterman model, the user inputs any number of views or state\nments about the expected returns of arbitrary portfolios, and the model\ncombines the views with equilibrium, producing both the set of expected\nreturns of assets as well as the optimal portfolio weights. Since publi\ncation of 1990, the Black-Litterman asset allocation model has gained\nwide application in many financial institutions.\n\nHow relevant are factors in relation to\ndifferent styles?\n100%\n90%\n80%\n70%\n60%\n50%\n40%\n30%\n20%\n10%\n0%\n100%\n90%\n80%\n70%\n60%\n50%\n40%\n30%\n20%\n10%\n0%\nPC 1\nPC 2\nPC 3\nPC 4\nPC 5\nPC 6\nPC 7\nPC 9 PC 10\nPC 1\nPC 2\nPC 3\nPC 4\nPC 5\nPC 6\nPC 7\nPC 9 PC 10\nFactors for \"Value\" portfolio\nFactors for \"Growth\" portfolio\nDepending on the nature of the investments, the influencing factors are\ndifferent. Thus, the principal components, reflecting the \"explanatory\npower\" of existing, but \"unknown\" factors are different in structure and\ndimension. What makes a \"good\" factor?\n- Interpretable: It is based on fundamental and market-related char\nacteristics commonly used in security analysis\n- Incisive: It divides the market into well defined slices\n- Interesting: It contributes significantly to risk, or it has persistent\nor cyclical positive or negative exceptional return\nWhy Factors?\n- Change in behavior (company restructuring, new business strategy\netc),\n\n- reflected in sensitivities to factors; Screening of universe for \"ade\nquate\" investments, depending on investment objective;\n- Handling of information-overflow\nSome examples of Style-definitions:\n- Large Cap Value: Stocks in Standard & Poor's 500 index with high\nbook-to-price ratios\n- Large Cap Growth: Stocks in Standard & Poor's 500 index with low\nbook-to-price ratios\n- Small Cap Stocks: Stocks in the bottom 20\n- Each styles reacts different and thus fits different clients in different\nways\n\nFactor Definitions:\nSize: Captures differences in stock returns due to differences in the mar\nket capitalization of companies This index continues to be a significant\ndeterminant of performance as well as risk.\nSuccess: Identifies recently successful stocks using price behavior in the\nmarket as measured by relative strength. The relative strength of a stock\nis significant in explaining its volatility.\nValue: Captures the extent to which a stock is priced inexpensively\nin the market. The descriptors are as follows:\n- Forecast Earnings to Price;\n- Actual Earnings to Price;\n- Actual Earnings to Price;\n- Yield.\nVariability in Markets (VIM): Predicts a stock's volatility, net of the\nmarket, based on its historical behavior. Unlike beta, this index mea\nsures the stock's overall volatility.\nGrowth: Uses historical growth and profitability measures to predict\nfuture earnings growth. The descriptors are as follows:\n- Dividend payout ratio over five years Computed using the last five\nyears of data on dividends and earnings;\n- Variability in capital structure;\n\n- Growth rate in total assets;\n- Earnings growth rate over last five years;\n- Analyst-predicted earnings growth;\n- Recent earnings change Measure of recent earnings growth.\n\nReturn Decomposition\nTotal\nReturn\nActive\nNormal\nRisk-Free\nTotal\nExcess\nActive\nSpecific\nActive\nSystematic\nFigure: Return decomposition\nRisk Decomposition\nCommon Risk\n21 x 21 = 441\nSpecific Risk\n4.5 x 4.5 = 20.25\nTotal Risk\n21.48 x 21.48 = 461.25\nFigure: Risk decomposition,\n\nReturn and Risk, A Two Factor Linear\nModel\nReturn:\nrp = ap + bp,1F1 + bp,2F2 + εp\nrBM = aBM + bBM,1F1 + bBM,2F2 + εBM\n(7)\nExcess Return:\nrp - rBM = ap + (bp,1 - bBM,1 )F1 + (bp,2 - bBM,2) F2\n+ (ap + εp - aBM - εBM )\n(8)\nVariance of Excess Return :\nvar (rp - rBM ) = (bp,1 - bBM,1) var (F1) + (bp,2 - bBM,2) (F2)\n+ 2 · (bp,1 - bBM,1) (bp,2 - bBM,2) · cov (F1, F2)\n+ var (εp) + var (εBM ) - 2 · cov (εp, εBM )\n(9)\n\nTracking Error:\n\n(bp,1 - bBM,1) var (F1) + (bp,2 - bBM,2) (F2)\nTE =\nvarp - rBM = +2· (bp,1 - bBM,1) (bp,2 - bBM,2) · cov (F1, F2) (10)\n+var(εp) + var (εBM ) - 2 · cov (εp, εBM )\nMIT Sloan\n15.433\n\nTracking Error\nThe tracking error is defined as: \"the standard deviation of active re\nturn\".\nσA = std [rAP ] = σ [rP ] - σ [rBM ]\n= σAP = σP - σBM\n(11)\nThe tracking error measures the deviation from the benchmark, as the\nrp is the sum of the weighted returns of all positions in the portfolio and\nrBM is the sum of the weighted returns of all positions in the benchmarks.\nPortfolio and benchmark do not always contain the same positions!\nTracking error is called as well active risk.\n\nInformation Ratio\nInformation Ratio: A measure of a portfolio manager's ability to deliver,\nrelating the relative return to the benchmark and the relative risk to the\nbenchmark:\n- Expected Active Return (alpha)\n- Active Risk\nexpected active return\nα\nIR =\n=\n(12)\nactive risk\nT E\nImplied alpha: Alpha backed-out through reverse engineering; how much\nhas my expected return to be to justify all other parameters ceteris\nparibus\n\nForecasts\nSome examples:\n- MCAR: How much does active risk increase if I increase the holding\nx by 1 % and reduce cash by 1 %\n- MCTCFR: How much does common factor risk increase if I increase\nthe holding x by 1 % and reduce cash by 1 %\n- MCASR: How much does specific active risk increase if I increase\nthe holding x by 1 % and reduce cash by 1 %\n\nPerformance Attribution\nThe identification of individual return components can be performed\nquite easily, subject to the history of the restructuring of the portfolio.\nThe straight forward approach is based on the definition of a passive\nbenchmark portfolio, which reflects the long-term investment strategy.\nIn the context of the investment strategy (or the strategic asset alloca\ntion) the investment management decides which asset categories (equi\nties, fixed income, currencies, etc.) are over-/underweighted relative to\nthe benchmark (strategy). The weights of specific asset categories - as\ndetermined in the investment strategy - are called normal weights.\nFor each asset category of the portfolio exists a corresponding asset cat\negory of the benchmark (index), relative to which the performance is\ncalculated. The return of these indices are called normal returns. It is\nobvious, that the the normal return is a return of a passive investment\nin the corresponding asset category of the benchmark.\nFor equities, fixed income and for currencies exist different indices, re\nflecting different needs.\nThe normal weight of the asset category i (ws,i) multiplied with the nor\nmal return (rs,i) is the return of this intended asset category. Summed\nup over all returns from the different asset categories, the portfolio has\nthe following strategy/-benchmark return:\nN\nrstrategy =\ni=1 ws,i · rs,i\n\nAgainst this benchmark-portfolio we want to know the realized return\nof the actively managed portfolio. We have a positive excess-return, if\nthe effectively realized portfolio return (rportf olio) exceeds the strategy\nreturn (rstratey):\nrexcess return = rstrategy - rportf olio\nThe current portfolio return (rportf olio) is calculated from the effective\nbreakdown of the portfolio in the different asset categories (wp,i) as well\nas the effectively realized returns (rs,i) of the individual asset categories:\nN\nrportf olio =\ni=1 wp,i · rp,i\nThe difference between the strategy return and the realized portfolio\nreturn results from the fact, that the portfolio manager restructures the\nportfolio through market timing strategies based on the on the assump\ntion of predicting the direction of the performance. Overperformance\nby timing the market can be achieved by adjusting the overall market\nexposure of the portfolio. Various techniques exist to time the market:\n- tactical over- and underweights of categories and thus deviates from\nthe normal weights thourghchanges in the asset class mix (especially\nstock and cash positions), also called rotation (sector rotation, asset\nclass rotation)\n- timing within an asset class: changing the security mix by shifting\nthe proportions of conservative (low beta) and dynamic (high beta)\nsecurities.\n\n- derivatives instruments: especially index futures and the use of op\ntions.\nSecurity selection is the identification of over/-under priced securities.\nSo a superior valuation process is needed to compare the true value for\na security with the current market value.\nOverall, the return of a portfolio can be decomposed in four return com\nponents, which summed up again result in (rportf olio):\nN\n- rstrategy =\ni=1 ws,i · rs,i\nN\n- rtiming =\ni=1 rs,i · (wp,i - ws,i)\nN\n- rselectivity =\ni=1 ws,i · (rp,i - rs,i)\nN\n- rcumulative ef f ect =\ni=1 (wp,i - ws,i) · (rp,i - rs,i)\nFigure 1 highlights the decomposition of the portfolio return in the in\ndividual components and their relationship to a active respectively pas\nsive portfolio management. Quadrant (1) is put together from passive\nselectivity and passive timing. It represents the long-term investment\nstrategy and serves as the benchmark return for the observation period\nin examination. If the portfolio management performs a passive market\ntiming, we receive the return in quadrant (2). It represents the return\nfrom timing and strategy. We understand timing as the deviation in the\nweight of the individual asset category from the normal weight. Within\nthe individual asset categories we invest in a passive index portfolio.\nThrough subtraction of the strategy return from quadrant (1) we re\nceive the net result from timing.\n\nQuadrant 3 reflects the returns from selectivity and strategy. Selectivity\nis the active choice of individual securities within an asset strategy. The\nnormal weights are kept equal. The return from selectivity is received\nthrough subtraction of the strategy return in quadrant (1) from quadrant\n(3). In quadrant (4) we finally find the realized return of the portfolio\nover the observation period in examniation, calculated as the product of\nthe current weights of the individual asset categories with the current\nreturns within the asset categories. Not obvious from the figure is the\nfourth component, the cumulative effect (also called interaction effect),\nwhich is based on cross product of return- and weight differences. The\nresidual term can be derived from the interaction between timing and\nselectivity. It is based on the fact that the portfolio manager puts more\nweight on the asset categories with a higher return than in the bench\nmark index (selectivity).\nselectivity\nmarket\ntiming\nactive\npassive\nactive\n(4)\nrealized return\nN\ni=1 wp,i · rp,i\n(3)\nselectivity & strategy\nN\ni=1 ws,i · rp,i\npassive\n(2)\ntiming & strategy\nN\ni=1 wp,i · rs,i\n(1)\nstrategy\nN\ni=1 ws,i · rs,i\n\nTiming = (2)-(1)\nSelectivity = (3) - (1)\nResidual = (4)-(3)-(2)+(1)\nFigure 1: Performance components in an active portfolio\n\nExample without Currency Components\nAll returns are calculated in the domestic currency. All foreign exposures\nare perfectly hedged back into the domestic portfolio currency. The up\nper part of the table contains the normal weights and normal returns\nrequired to calculate the passive strategy of the individual asset cate\ngories.\nIn the second part of the table are the effective weights and the current\nreturns of the individual asset categories in the specific quarters.\nThe current weights and returns are adjusted from quarter to quarter\nto reflect the restructuring of the tactical asset allocation and the stock\npicking and result in the active over/-underweights.\nIn the lower part of the table are the individual performance compo\nnents resulting in the individual quarters. They are calculated using the\nequations in the previous equations.\nFrom the results in Table 1 it is obvious that the return from active\nmanagement varies substantially from quarter to quarter and reflects no\nconstant pattern. The timing-return varies between -0.15% in the 4th\nquarter x1 and max 0.28% in the 1st quarter x1. Selectivity has even\nmore variation: min is -0.18% in and 1.48% in the 1st quarter. The\nresidual terms have a surprising big impact, with 0.18% of the portfolio\nreturn in 1st quarter and 2n quarter and reducing the portfolio return\nwith -0.39%!.\n\nx0/3\nx0/4\nx1/1\nx1/2\nx1/3\nx1/4\nx2/1\nentire period\nFI $\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\n57.50\nFI Euro\nnormal\nweights\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\n12.50\nEq $\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\n22.50\nEq Euro\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\n7.50\nFI $\n-0.75\n1.26\n4.53\n2.09\n0.46\n0.91\n3.26\nFI Euro\nnormal\n-19.37\n2.50\n14.52\n3.31\n-0.99\n-3.16\n7.07\nEq $\nreturns\n-28.62\n1.39\n16.02\n0.85\n-1.12\n-2.18\n7.79\nEq Euro\n-1.94\n4.37\n6.71\n4.48\n2.15\n2.18\n5.71\nFI $\n57.50\n53.70\n55.70\n52.30\n54.50\n53.80\n52.40\nFI Euro\nweights\n12.50\n16.50\n15.80\n16.10\n15.90\n15.70\n16.50\nEq $\ncurrent\n22.50\n22.10\n22.30\n23.60\n23.50\n23.10\n23.20\nEq Euro\n7.50\n7.70\n6.20\n8.00\n6.10\n7.40\n7.90\nFI $\n-0.32\n0.81\n4.22\n2.12\n1.15\n0.78\n2.32\nFI Euro\n-2.06\n4.15\n7.05\n4.68\n1.74\n2.33\n5.93\nEq $\ncurrent\nreturns\n-26.19\n1.99\n16.69\n0.97\n0.16\n-3.89\n10.09\nEq Euro\n-21.61\n2.37\n17.75\n4.89\n-2.97\n-3.24\n7.08\nstrategy\n-9.44\n1.68\n8.53\n2.14\n0.05\n-0.20\n4.94\n7.70\ntiming\n0.00\n0.06\n0.28\n0.04\n-0.09\n-0.15\n0.19\n0.33\nselectivity\n1.48\n-0.07\n-0.13\n0.25\n0.64\n-0.18\n-0.06\n1.93\ninteraction\n0.00\n0.08\n-0.39\n0.05\n0.16\n0.18\n0.02\n0.10\nrealized\n-7.96\n1.74\n8.29\n2.48\n0.76\n-0.35\n5.09\n10.06\nreturn from active manage\n1.48\n0.06\n-0.24\n0.34\n0.71\n-0.15\n0.16\n2.36\nTable 1: Example for performance components without currency expo\nsure\nThe active management contributed in 5 out of 7 quarters positively\nto the overall return. Over the time period of 7 quarters the active\nmanagement added 2.36%, with contribution from timing of 0.33%, se\nlectivity contributed 1.93% and the residual term 0.10%. Looking at the\nrealized return of the portfolio (10.06%), the contribution from active\nmanagement with 2.36% is substantial!\nEven more important is the contribution from the strategy, which added\n7.70% to the portfolio return, and thus is the most important component.\nThis example shows quite nicely, that the most important contribution\nto the return is from the strategic asset allocation. The substantial part\nof the achieved investment performance is based on the strategy and not\nfrom the active management through the portfolio manager.\n\nstrategy\ntiming\nselectivity\nresidual\nBrinson/Hood/Beebower (1986)\nBrinson/Singer/Beebower (1991)\nreturn components\n(%)\nvariance\ncomponents (%)\nreturn components\n(%)\nvariance\ncomponents (%)\n10.11\n-0.66\n-0.36\n-0.07\n93.6\n1.7\n4.2\n0.5\n13.49\n-0.26\n0.26\n-0.07\n91.5\n1.8\n4.6\n2.1\ntotal\n9.01\n13.41\ncomments\n91 pension funds, USA 1974-1983,\nn=43\n82 pension funds, USA 1977-1987,\nn=45\nTable 2: Performance components for US pension funds\nTable 2 the study has be carried out over a time period of 10 years.\nIn the first analysis the pension funds realized a return of 9.01%. This\nis 1.10% below the strategy return of 10.11. The active management\ndestroyed value worth 1.10% (0.66% timing, 0.36%). For the second\nanalysis the results look not better. The selectivity added in average\n0.26% to the annual return, however the active return does not look bet\nter, active management lowered the returns by 8 basis points in average.\nA comparison between the dimension of strategy return and the \"added\nvalue\" of active management shows in both studies that the active com\nponent is only a small fraction of the total return.\n\nPerformance Attribution with a currency\ncomponent\nWe know from previous classes and from own experience that diversi\nfication can improve the performance of the portfolio. Diversification\ncan be generated through investments in e.g. different asset categories\nor individual sectors, industries etc. Especially the diversification across\nthe border lines is important, adding additional low correlations to the\nportfolio. Looking at the performance attribution of international diver\nsified portfolios, we want to know the impacts of strategy, timing and\nselectivity and as well the contribution from fx-components from the\nportfolio allocation. Exposure to foreign currencies can be generated\nthrough direct investments in fx (buy, sell), or through investments in\nforeign securities, without completely hedging the fx exposures. The\nportfolio return is increases through the fx-return by carrying the fx\nexposures during the observation period.\nWe define with fs,j the strategic component in currency j and fp,j the\neffectively held exposure to currency j. The return of an internationally\ndiversified portfolio including fx-exposures can be calculated as following:\nN\nN\nrportf olio =\ni=1 wp,i · rp,i +\ni=1 fp,i · rfx,j\nwp,i is again the current portfolio weight for asset category i. The cur\nrent return of an actively managed portfolio yields rp,i is no longer ex\nclusively in the domestic currency (1 to 1), but in the local currency\nof the particular investment. Thus, the first sum of previous equation\nincludes the weighted return of the investments in different securities,\n\nmeasured in the local currency of the corresponding market. For invest\nments in American securities it reflects e.g. the local equity return in\nUS$. With the second term in the previous equation we add an addi\ntional return components coming from the fx-return for the exposure\nheld in the particular currency. The currency return rfx,j is weighted\nwith the corresponding fx-component in the portfolio. In the example,\nwhere e.g. 20% of the equity portfolio are invested in Euro-denominated\nsecurities (without hedging the portfolio against the Euro-exposure), we\nhave to add to the local US-equity return a 20%-investment (exposure)\nin Euro-currency. For a portfolio, which is exclusively invested in the\ndomestic portfolio currency, the second terms is dropped.\nThe strategy return is calculated analogous to the portfolio return us\ning the passive strategy weights and normal returns in the local currency:\nN\nN\nrstrategy =\ni=1 ws,i · rs,i +\ni=1 fs,i · rfx,j\nAgain, here as well we add a fx-component. The different fx-returns\nare weighted according their corresponding strategic fx-weights fs,j .\nThe decision, to vary the proportions of individual currency exposures in\nthe portfolio is considered part of the tactical asset allocation. Through\nconscious deviations from strategic currency weights the active portfolio\nmanager can add (loose) an additional return component to the domes\ntic portfolio return.\nIndependent from the previous statement is the decision to invest in\nlocal markets and asset categories to benefit from the local performance.\n\nAccordingly, the timing-component of an international diversified port\nfolio is split into two parts: one in a market-component, which reflects\nthe investment decisions regarding the specific market and asset cate\ngories, and a second part which reflects the currency component from\nthe allocation decision in different currency exposures:\nN\nrmarkets =\ni=1 rs,i · (wp,i - ws,i)\nN\nrcurrency =\ni=1 rfx,j · (fp,j - fs,j )\nThe market component is calculated through multiplication of the pas\nsive normal returns rs,j , measured in the specific local currency of the\ninvestment position, with deviation of the portfolio weights from normal\nweights. The return, coming from the deviation from the strategic cur\nrency allocation, is reflected in the fx-component.\nThe return component from selectivity is defined as:\nN\nrselectivity =\ni=1 ws,i · (rp,i - rs,i)\nThe portfolio return, rp,i, and as well the normal return, rs,i, are mea\nsured in the local portfolio currency. The performance component from\nselectivity decisions is thus not be affected from the currency of specific\ninvestments, but is calculated exclusively through the choice of specific\nsecurities within a market or an asset category.\n\nLegend:\nws,i strategy weight (normal weight) for asset class i\nrs,i strategy return (normal return) for asset class i\nwp,i portfolio weight (effective weight) for asset class i\nrp,i portfolio return (effective return) for asset class i\nSimilar terms:\n- Timing: Allocation\n- Cumulative effect: Interaction effect\n\nPerformance Measure\nCapital Market oriented View\nSharpe's measure:\nrp - rf\nSharpe =\n(13)\nσp\nDivides average portfolio excess return over the sample period by the\nstandard deviation of returns over that period. It measures the reward\nto (total) volatility trade-off?\nTreynor's measure:\nTreynor s = rp - rf\n(14)\nβp\nGives excess return per unit of risk over the sample period by the stan\ndard deviation of returns over that period. It uses systemic risk instead\nof total risk.\nJensen's measure:\nJensen s α = rp - [rf + βp (rM - rf )]\n(15)\nIt is the average return on the portfolio over and above that perdicted by\nthe CAPM, given the portfolioo's beta and the average market return.\nJensen's measure is the portfolios alpha value.\nAppraisal ratio:\n\nαp\nAppriasal Ratio =\n(16)\nσεp\nIt divides the alpha of the portfolio by the nonsystematic risk of the\nportfolio. It measures abnormal return per unit of risk that in principle\ncould be diversified away by holding a market index portfolio.\n\nSummary\nThe (simple) performance attribution allows to figure out where the\nportfolio manager manager added value and where he destroyed value.\nIt is key to learn from past errors and not to repeat them. Perfor\nmance attribution is an essential element in investment to ensure that\nexposures are rewarded with the appropriate risk premium.\nThe capital market oriented performance attribution is another approach\nto analyze the performance. It allows to calculate the riskpremiums for\nthe factors / styles to which the portfolio is exposed.\nFocus:\nBKM Chapter 26\n- p. 874-883, 890-897 (learn general definitions and assumptions)\ntype of potential questions: Concept check questions, p. 899 ff. question\n2,3,4,5\nBKM Chapter 27\n- p. 917-933 (objectives of active portfolios, market timing, security\nselection, portfolio construction, multifactor models and portfolio\nmanagement, quality of forecasts)\ntype of potential questions: Concept check questions, p. 899 ff. question\n2,3,4,5\n\n- Thomas (2000), p. 26 f. information ratio Strongin, Petsch and\nSharenow (2000), p. 18 dealing with stock-specific benchmark, p.\n23 f. portfolio manager patterns\n\nPreparation for Next Class\nPlease read:\n- Kritzman (1994a),\n- Kritzman (1994b),\n- Ross (1999), and\n- Perrold (1999).\nVideo (Optional):\n\"Trillion Dollar Bet\", (a PBS Documentary). I have just one copy of the\nvideo tape. It is to be distributed by Joon Chae (jchae@mit.edu) on a\nfirst come first serve basis. If there is excess demand, some alternative\nmeans of distribution will be worked out. Please contact Joon directly."
    },
    {
      "category": "Resource",
      "title": "15433_21a_hedge_funds.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/2c65cd619fc2e15bc0789bbecf0f7370_15433_21a_hedge_funds.pdf",
      "content": "15.433 INVESTMENTS\nClass 21: Hedge Funds\nSpring 2003\n\nThe Beginning of Hedge Funds\nIn 1949, Alfred Jones established the first hedge fund in the U.S.\nAt its beginning, the defining characteristic of a hedge fund was that\nit hedged against the likelihood of a declining market.\nTwo speculative tools were merged into a conservative form of investing:\n1. leverage was used to obtain higher profits. 2. short selling was em\nployed to hedge against the downside risk.\nBy combining long and short positions, Jones exploited the relative pric\ning of stocks, while minimizing his exposure to the overall market.\nTo align the manager/investor incentives, Jones employed performance\nbased fee compensation. He also kept all of his own money in the fund.\n\nA Little History of Hedge Funds\nWhile mutual funds were the darlings of Wall Street in the 60's, Jones'\nhedge fund was outperforming the best mutual funds even after the 20%\nincentive fee deduction. The news of Jones' performance created excite\nment, and by 1968, approximately 200 hedge funds were in existence.\nDuring the 60s bull market, many of the new hedge fund man-agers\nstopped hedging the downside risk, and went into the bear market of\nthe early 70s with long, leveraged positions. Many were put out of busi\nness.\nDuring the next decade, only a modest number of hedge funds were\nestablished.\nOver the past 10 years, however, the number of funds has increased\nat an average rate of 25 74% per year.\n\nInvestment Flexibility\nHedge funds are largely unregulated. This lack of regulation permitted\na hedge fund manager to employ leverage, to sell short, and to charge\nperformance based fees, practices that normally were not available to\nregulated investors such as mutual funds.\nA second differentiating characteristic was the amount of leverage em\nployed. Hedge fund managers were able to leverage their portfolios\nthrough the use of futures, options, and repurchase agreements, as well\nas through more traditional sources of financing such as banks and bro\nkerage firms.\nWhile hedge funds came in all shapes and sizes, they tended to have\none common trait: low correlation with the U.S. equity market.\n\nSome Structural Details\nThe majority of the funds are organized as limited partnerships, allowing\nonly 99 investors. General partners usually have a significant investment\nin the partnership.\nPerformance based compensation. Typically, 20% of net profits in ad\ndition to 1% management fee. Most performance fees are subject to a\n\"high watermark,\" and some require a \"hurdle rate.\"\nRestricted withdrawals. Typically, limited partners are allowed to with\ndraw only annually, and some had a \"lock up\" period as long as three\nyears.\nA culture of secrecy. Rarely are limited partners given a list of portfolio\nholdings.\n\nSize and Location\nAccording to a report by Tremont & TASS in 1999, there are 5,000\nfunds in the whole industry. However, over 90% of the $325 billion\nunder management in the industry is managed by some 2,600 funds.\nFigure 3: Growth in Hedge Funds, Source: www.tassresearch.com\n\nLocation of hedge funds:\nUSA\n33.9%\nCayman Islands\n18.9%\nBritish Virgin Islands 16.5%\nBermuda\n11%\nBahamas\n7.2%\nOthers\n12.5%\nSource: Tremont TASS (June 1999)\nDomicile of Fund Managers\nIn U.S.: 91%\nOutside U.S.: 9%\nSource: Tremont TASS (June 1999)\n\nA Taxonomy of Hedge Fund Strategies\nDirectional Trading: based on speculation of market direction in mul\ntiple asset classes. Both model based systems and subjective judgment\nare used to make trading decisions.\nRelative Value: focus on spread relationships between pricing compo\nnents of financial assets. Market risk is kept to a mini-mum. Many\nmanagers use leverage to enhance returns.\nSpecialist Credit: based on credit sensitive securities. Funds in this\nstrategy conduct a high level of due diligence in order to identify rela\ntively inexpensive securities.\nStock Selection: combine long and short positions, primary in equities,\nin order to exploit under and overvalued securities. Market exposure can\nvary substantially.\n\nLow Correlation Among Hedge Fund\nHedge fund mangers exhibit much lower correlation with one another\nthan traditional active managers:\n- Between 1990 and 2000, the average correlation among Lipper (mu\ntual funds) managers has been on the order of 90%,\n- while hedge fund managers resemble S&P 500 stocks have an average\ncorrelation on the order of 10%.\n- for the universe of stocks, the average correlation is about 20%. The\nlow average correlation among hedge fund managers suggests that\npooling funds into portfolios or indices can significantly reduce their\ntotal risk, providing distinct advantages relative to traditional active\nstrategies.\n\nEffects of Age\nBetween 1990 and June 2000\nFund Age Annualized Annualized Sharpe\n(year)\nReturn\nVolatility\nRatio\n≤ 1\n27.2%\n6.1%\n3.7\n1 ≥ x ≤ 2\n23.5%\n5.9%\n3.2\n2 ≥ x ≤ 3\n18.7%\n5.5%\n2.5\n3 ≥ x ≤ 5\n18.1%\n5.2%\n2.5\nx ≥ 5\n14.7%\n5.9%\n1.6\nSource: Morgan Stanley Dean Witter\n\nThe Rise of LTCM\nThe fund that LTCM managed had commenced operations with $1 bil\nlion of capital in early 1994, and had subsequently raised an additional\n$2 billion.\nIn September 1997, after three and half years of investment returns that\nfar exceeded even the principals' expectations, the Fund's net capital\nstood at $6.7 billion.\nSince inception, the Fund's returns after fees had been 19.9% from Febru\nary 24 through December 31, 19941 42.8% in 1995, 40.8% in 1996, and\n11.1% in 1997 through August.\nThese returns were achieved without exposure to the stock market. In\nmany of its trades, the firm was in effect a seller of liquidity, diversified\nacross many markets.\n\nSome LTCM Trades\nConvergence Trades on Swap Spreads\nYield Curve Relative Value Trades Butterfly Trades\nSelling Equity Volatility\nRisk Arbitrage\nEquity Relative Value Trades on Royal Dutch/Shell\nFixed Rate Residential Mortgages\nJapanese Government Bond Swap Spread\n\nThe Fall of LTCM\nFollowing a successful 1997, LTCM began the year with about $4.8 bil\nlion in capital, having just returned $2.7 billion to out-side investors.\nIn May and June the Fund experienced its two worst months ever, with\ngross returns of 6.7% and 10.1% respectively. The losses were distributed\nacross many positions, with no single trade experiencing a large loss. In\nresponse to the losses, LTCM reduced the risk of the portfolio. By July\n21, the fund was up 7.5% on the month. But the month of August was\na continuation of adverse movements, and by mid August, overall posi\ntions had been cut by an additional 5%.\nOn Monday, August 17, 1998, in an event that stunned the world, Rus\nsia defaulted on its government debt. LTCM had only a small exposure\nto Russian government credit, and the Fund suffered a correspondingly\nsmall loss in these positions.\nFriday, August 21, was the worst day in the Fund's history, as many of\nthe Fund's trades moved adversely and substantially:\n1. During the morning, the U.S. swap spread widened by 19 bps, com\npared with a typical daily move of less than a basis point. The U.K.\ngilt swap spread also widened dramatically that day. The Fund had\nlarge short positions in both of these swap spreads.\n2. LTCM suffered a significant loss in a risk arbitrage position related\nto the planned acquisition of telephone equipment maker Ciena Corp\nby Tellabs, Inc.\nLTCM estimated that the combination of the risk arb loss and the un\nprecedented widening of the U.S. and U.K. swap spreads and other\nspreads had resulted in a one day loss of about $553 million - 15% of its\n\ncapital.\nThe Fund was now down to $2.95 billion, with a dangerously high lever\nage ratio of 42.\nTo reduce their risk, the partners would have to sell something. But\nwhat? Investors wanted only the safest bonds, which LTCM didn't have.\nAugust was the worst month ever recorded in credit spreads. Unlike the\nthe ballooning spreads traditionally linked with an economic collapse,\nthis one was caused by a panic on Wall Street.\nIn August, three quarters of all hedge funds lost money, and LTCM lost\nthe most: $1.9 billion, which was 45% of its capital.\n\nFocus:\n- Ross (1999) and Perrold (1999)\n\nPreparation for Next Class\nPlease read for next class:\n- BKM Chapter 27,\n- Chow and Kritzman (2001),\n- Bernstein (1995), and\n- Lewent and Kearney (1990)."
    },
    {
      "category": "Resource",
      "title": "154331introduction.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/d1b7a985cdbeaa9cca0cc5580ba5cf3e_154331introduction.pdf",
      "content": "15.433 INVESTMENTS\nClass 1: Introduction\nSpring 2003\n\nOutline\n- Course Overview\n- Market Overview\n- Introduction to the Financial System\n- Overviews of Equity, Fixed Income, Currencies and Derivatives\n- Financial Innovations\n- Summary\n- Questions for Next Class\n\nCourse Mechanics\nCourse Grade:\nClass participation\n10%\n5 group assignments 20%\nMid-tern exam\n30%\nFinal exam\n40%\nCourse Materials:\n- Lecture Notes\n- Textbook: Bodie, Kane and Marcus\n- Articles in course reading packet\n- Additional reading materials and handouts\n\nCourse Overview\nBroadly speaking, this course will cover the following give themes:\n- Financial theories: Portfolio theory, the CAPM and the APT\n- Equity and equity options, and empirical evidence\n- Fixed income instruments and fixed income derivatives, credit mar\nket and credit derivatives\n- Market efficiency and active investments\n- A brief introduction to behavioral finance\n\nCourse Objectives\nThrough this class I want to help you build the following skills:\n- Analytical ability: modeling skills that are important in making\ninvestment decisions,\n- Quantitative skills: developing problem solving skills, data analysis,\nprobability evaluation of uncertain events.\n- Empirical knowledge of the financial markets: equity, fixed income\n(default-free and defaultable) and their respective derivatives.\n\nThe Financial System\nThe financial system can be viewed from two different angles:\n- Institutional perspective: the financial system encompasses the mar\nkets, intermediaries, instruments, clients etc.; and\n- Functional perspective: the financial system facilitates the allocation\nand deployment of economic resources, across time and space and in\nuncertain environment.\nWhile its institutional composition changes over time and space (dif\nferent places on the globe), the basic functions of a financial system are\nessentially the same in all economies. The institutional dimension results\nfrom the functional needs.\n\nFunctional Perspective\nThe financial system provides six functions:\n- Transferring economic resources across time (e.g. student loans, re\ntirement funds) and space (global financial market, e.g. institutional\ninvestments)\n- Clearing and settling payments to facilitate trades: money, check,\nATM cards, mortgages and mortgage interest payments, etc.\n- Pooling of resources to undertake large-scale indivisible enterprise\n(equities, money market funds, mutual funds etc.)\n- Information to coordinate decision-making, facilitating information\nflow, \"price discovery\", the normal indices for equities, fixed income\nrates, volatilities etc.\n- Dealing with agency problems, mitigate moral hazard, adverse selec\ntion and principal-agent based problems that are caused by asym\nmetry information or incentive mis-matches (collateralization, CEO\nincentive for company performance etc.).\n- Managing risks, bundling, packaging, pooling and tranching of risk\n(insurance companies, CMO, CDO, exotic derivatives etc.)\n\nInstitutional Perspective\nThe institutional compositions of the financial system includes:\n- Financial markets: equity, fixed income (debt), credits and deriva\ntives\n- Financial intermediaries: banks, insurance companies, pension funds,\nmutual funds, investment banks, venture capital firms, asset man\nagement firms and information providers etc.\n- Financial infrastructure and regulation: trading rules, contract en\nforcement, account system, capital requirements etc.\n- Governmental and quasi-governmental organizations: SEC, central\nbanks (Federal Reserve System), the Bank for International Set\ntlement (BIS), the International Monetary Fund (IMF), the World\nBank, etc.\nInternational markets differ in many ways:\n- The US market is currently the only market offering Financial Fu\ntures on individual stocks;\n- Germany closed the \"Neue Markt\", eliminating a platform for not\nvery liquid stocks, regarding stock exchanges inexperienced compa\nnies, thus rising capital is getting more difficult for young companies;\n\n- Investment attitudes and awareness are subject to national regu\nlations, e.g. pension fund regulation - defined benefit vs. defined\ncontribution plans.\n\nStocks\nCommon stocks, also known as Equities, represent ownership shares of\na corporation.\n- Two important characteristics: residual claim and limited liability;\n- Sources of returns: dividends and capital gains;\n- Calculating returns: buy at time 0 and pay P0, sell at time T and\nreceive PT and dividend DT :\n- The percentage return is calculated as:\nPT + DT - P0\nrT =\n(1)\nPO\n- The log-return is calculated as:\nPT + DT\nrT = ln\n(2)\nPO\nFor small rT , the log-return and percentage return are close.\nQuestion: Why in some situations should we prefer to use log-\nreturns?\n- Some determinants of stock returns:\n- Firm-specific condition: management, productivity, earnings, growth-\npotential, market-liquidity,\n\n- Market condition: market indices (volatility, volume etc.), e.g.\nNasdaq, SP500, DAX, FTSE etc.\n- Economic condition: macro-economic variables, e.g. GDP-growth,\ninflation, employment rate, business cycles, liquidity, interest\nrates etc.\n- Some important empirical evidence:\n- Patterns in the cross-section of stock return: value (value vs.\ngrowth), size (small vs. large), momentum (low vs. high);\n- Time-series behavior of stock returns: time-varying expected re\nturns, predictability, stochastic volatility etc.\n\nStocks and Bonds\nSPX\n-12%\n-7%\n-2%\n3%\n8%\n9/6/1993\n11/6/1993\n1/6/1994\n3/6/1994\n5/6/1994\n7/6/1994\n9/6/1994\n11/6/1994\n1/6/1995\n3/6/1995\n5/6/1995\n7/6/1995\n9/6/1995\n11/6/1995\n1/6/1996\n3/6/1996\n5/6/1996\n7/6/1996\n9/6/1996\n11/6/1996\n1/6/1997\n3/6/1997\n5/6/1997\n7/6/1997\n9/6/1997\n11/6/1997\n1/6/1998\n3/6/1998\n5/6/1998\n7/6/1998\n9/6/1998\n11/6/1998\n1/6/1999\n3/6/1999\n5/6/1999\n7/6/1999\n9/6/1999\n11/6/1999\n1/6/2000\n3/6/2000\n5/6/2000\n7/6/2000\n9/6/2000\n11/6/2000\n1/6/2001\n3/6/2001\n5/6/2001\n7/6/2001\n9/6/2001\nSPX\nCCMP\n-12%\n-7%\n-2%\n3%\n8%\n9/6/1993\n11/6/1993\n1/6/1994\n3/6/1994\n5/6/1994\n7/6/1994\n9/6/1994\n11/6/1994\n1/6/1995\n3/6/1995\n5/6/1995\n7/6/1995\n9/6/1995\n11/6/1995\n1/6/1996\n3/6/1996\n5/6/1996\n7/6/1996\n9/6/1996\n11/6/1996\n1/6/1997\n3/6/1997\n5/6/1997\n7/6/1997\n9/6/1997\n11/6/1997\n1/6/1998\n3/6/1998\n5/6/1998\n7/6/1998\n9/6/1998\n11/6/1998\n1/6/1999\n3/6/1999\n5/6/1999\n7/6/1999\n9/6/1999\n11/6/1999\n1/6/2000\n3/6/2000\n5/6/2000\n7/6/2000\n9/6/2000\n11/6/2000\n1/6/2001\n3/6/2001\n5/6/2001\n7/6/2001\n9/6/2001\nCCMP\nSBTSY10\n-12%\n-7%\n-2%\n3%\n8%\n1/12/1995\n3/12/1995\n5/12/1995\n7/12/1995\n9/12/1995\n11/12/1995\n1/12/1996\n3/12/1996\n5/12/1996\n7/12/1996\n9/12/1996\n11/12/1996\n1/12/1997\n3/12/1997\n5/12/1997\n7/12/1997\n9/12/1997\n11/12/1997\n1/12/1998\n3/12/1998\n5/12/1998\n7/12/1998\n9/12/1998\n11/12/1998\n1/12/1999\n3/12/1999\n5/12/1999\n7/12/1999\n9/12/1999\n11/12/1999\n1/12/2000\n3/12/2000\n5/12/2000\n7/12/2000\n9/12/2000\n11/12/2000\n1/12/2001\n3/12/2001\n5/12/2001\n7/12/2001\n9/12/2001\nSBTSY10\nFigure 1: Daily returns of SP 500-index, Nasdaq-index and T-Bonds 10 years\n\n30%\n30%\n25%\n25%\n20%\n20%\n5%\n5%\n0%\n0%\n-5%\n-5%\n-0.080\n-0.060\n-0.040\n-0.020\n-\n0.020\n0.040\n0.060\n0.080\n-0.080\n-0.060\n-0.040\n-0.020\n-\n0.020\n0.040\n0.060\n0.080\nDaily Returns\nDaily Returns\nCurrent Distribution\nNormal-Distribution\nCurrent Distribution\nNormal-Distribution\nFigure 2: Return distribution of US 10 Year Bond\nFigure 3: Return distribution of S&P 500 Index\nData source for Figures 1, 2, and 3: Bloomberg Professional.\nProbability\n15%\nProbability\n15%\n10%\n10%\n\nFixed Income\nFixed income, also known as debt-instruments, promise to pay fixed,\npre-determined stream of cash flows in the future: Coupon payments,\nPrincipal amount (denominations), Time to maturity, Sinking fund obli\ngations, etc.\nFigure 4: Cash Flows, Source: RiskM etricsT M , Technical Document, p. 109\nFigure 5: Discounted Cash Flows, Source: RiskM etricsT M , Technical Document, p. 109\nTreasury bills, notes and bonds vary in maturity. T-bonds may also be\ncallable during a given period.\nThe value of a bond can be reported in terms of price or yield to matu\nrity. Yield go and price go.\n\nMarket Performance\nMonthly returns 1926/7 to 2000/12\nEquity Portfolio∗ Treasury Bills\nMean\n0.99%\n0.31%\nStandard Deviation\n5.50%\n0.26%\nTotal Return\n$1'828\n$16.27\n* Value-Weighted\n\nThe Term-Structure of Interest Rates\n(Yield-Curve)\nYield Curves for US Treasury\n3 Mo 6 Mo\n1 Yr\n2 Yr\n3 Yr\n4 Yr\n5 Yr\n6 Yr\n7 Yr\n8 Yr\n9 Yr\n10 Yr 15 Yr 20 Yr 30 Yr\n1.1.1995\n1.1.1996\n1.1.1997\n1.1.1998\n1.1.1999\n1.1.2000\n1.1.2001\n1.1.2002\n1.1.2003\nFigure 6: Treasury Yield Curve, Source: Bloomberg Professional.\nHow do we describe the term-structure:\n- Shift\n- Twist\n- Butterfly\n\nThe Federal Funds Target Rates (set by FOMC) and the Discount Rates:\n8.00\n7.00\n6.00\n5.00\n4.00\n3.00\n2.00\n1.00\n0.00\n1/1/1991\n7/1/1991\n1/1/1992\n7/1/1992\n1/1/1993\n7/1/1993\n1/1/1994\n7/1/1994\n1/1/1995\n7/1/1995\n1/1/1996\n7/1/1996\n1/1/1997\n7/1/1997\n1/1/1998\n7/1/1998\n1/1/1999\n7/1/1999\n1/1/2000\n7/1/2000\n1/1/2001\n7/1/2001\n1/1/2002\n7/1/2002\n1/1/2003\nFOMC\n3 Month LIBOR\nFigure 7: Short Term Interest Rates FED, Discount rates over the last 4 years, Source Bloomberg Professional.\n\nCorporate Bonds\nCorporate bonds are similar in structure to Treasury issues, with one\nimportant difference: default risk.\n- Because of the default risk, corporate bonds are cheaper (than their\nrespective Treasury counterparts), paying higher yields.\n- The difference in yields is referred to as credit spread.\n- The probability of default varies across firms of different credit qual\nities (e.g. countries, industries, guarantees etc.)\n- The probability of default varies over time!\nFigure 8: Standard & Poor's one year transition matrix, Source: RiskM etricsT M - T echnical Document, p.\n69.\n\nDerivatives\nOverview of Derivatives by Structure:\n- Forward and Futures;\n- Options;\n- Futures;\n- Path dependent (e.g. look-back), etc.\nOverview of Derivatives by Underlying:\n- Equity Derivatives: stock options, index futures, futures options etc.;\n- Fixed-Income Derivatives: caps/floors, swaps, swaptions, etc.;\n- Credit Derivatives: credit swap, collateralized loan obligations, etc.;\n- Other derivatives: FX, weather, \"exotics\", etc.\n\nCurrencies\nCurrencies are the most liquid financial instrument.\nCurrency instruments have generally spoken the same type of parame\nters, however with different characteristics, e.g. currency return volatil\nity, which is not shaped in the same form as the equity return volatility.\nCurrency positions usually have a much shorter maturity proprietary\ntraders on Wall Street take positions up to half an hour!\n\nFinancial Innovation\nDoes financial innovation add value? If taken to excess, any virtue can\nreadily become a vice: The market has seen examples of failed financial\nproducts, erroneous assumption and strategies, abusive usage of deriva\ntives, distressed hedge funds etc. Empirical evidence supports the state\nment, that financial innovation does provide social wealth:\n- It caters to the investment diversity desired by the investors;\n- It improves the opportunities for investors to receive efficient risk-\nreturn trade-offs;\n- It provides risk management tools for all market participants; and\n- It promotes broad distribution and liquidity to economic resources.\n\nSecuritization\nFigure 9: Securitization of \"stand-alone\" mortgages in liquid standardized mortgage-backed securities.\nSecuritization of the mortgage market: The national mortgage market\nand mortgage-backed securities transform the residential house finance\nfrom fragmented, local-based sources to a free-flowing, international base\nof capital with depth and usually a higher credit rating.\nOther examples: collateralized debt (loan or bond) obligations, asset\nbacked debt, etc.\n\nCredit Enhancement\nFleetBoston plays \"Good Bank/Bad Bank,\" unloading $1.35 Billion in\ntroubled Loans Patriarch Partners LLC, a NY fund management bou\ntique, created a CLO to raise about $1 billion to acquire the loans.\nSee the following figure how FleetBoston's problem loans made their way\nfrom Fleet's books to a special collateralized-loan obligation, funded by\ninvestors.\n$ 925 million in triple-A rated bonds\n$ 275 million (face value)\n$ 75.75 million in single-A rated bonds\nin Ark subordinated securities\n$ 35.5 million of equity\nFleetBoston\nPatriarch\nPatriarch\nmillion c\n$ 7\nash\nPartner's\nArk CLO\nPartner's\nArk CLO\n$ 1.35 billion in funded loans plus\n$ 1.036 billion cash\n$ 150 million in unfunded loans\nFigure 10: Setting-up a special purpose vehicle.\n\nSummary\nWhat to learn in this course? Analytical modeling skills, quantitative\ntools, and empirical knowledge about the financial market and the fi\nnancial instruments.\nHow to think about the financial system?\n- Functional perspectives: across time and space;\n- Institutional compositions: results from the functional needs.\n- Does financial innovation add value?\n- Sometimes abusive usage of financial innovation causes disruptions.\nOverall, however, financial innovation provides diversified in-vestment\nopportunities for investors, risk management tools and techniques for\nmarket participants and liquidity to the overall market.\nFocus:\nBKM Chapters 1 & 2;\n- p.16/17 (market structure);\n- p.19 (securitization);\n- p.28-46 (know the different instruments, e.g. CD, CP, Bankers Ac\nceptances etc.);\n\n- p.48-54 (know the most important market indexes, what kind of\ndifferent weighting-schema exist etc.);\nReader: Sharpe (1995);\nType of potential questions: p. 60ff. questions 1, 5, 11, 17, 23\n\nPreparation for Next Class\nPlease read:\n- BKM Chapters 3 & 5,\n- Fama (1995), and\n- Kritzman (1993).\nQuestions:\n- What is a normal distribution?\n- How do we model uncertainty?\n- Is variance the only measure of uncertainty?\n- What is the average daily return?\n- What about the average variability?\n- What assumptions did you have to make in order to obtain the\nestimates?\n- How accurate are your estimates?\n- If given more observations (a large N), can you improve the precision\nof your estimates?"
    },
    {
      "category": "Resource",
      "title": "154332random_walk.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/c5845cd981c2e63f7ff303c92c7d41be_154332random_walk.pdf",
      "content": "15.433 INVESTMENTS\nClass 2:\nSecurities, Random Walk on Wall Street\nReto R. Gallati\nMIT Sloan School of Management\nSpring 2003\nFebruary 5th 2003\n\nOutline\nProbability Theory\n- A brief review of probability distributions\n- Evaluating random events with normals.\n- Large surprises and normal distributions.\nStatistical Data Analysis\n- Empirical distributions. Sample statistics.\n- The precision of sample statistics.\nSummary\nQuestions for Next Class\n15.433\nMIT Sloan\n\nWhat makes an event random\n- Flipping a Coin:\n- Forecasting tomorrow's temperature\n15.433\nMIT Sloan\n\nProbability Distributions\nMathematical tools for random events. It has two components: outcomes and their\nlikelihood.\nExamples:\n- Binomial Distribution\n\nX =\n\nwith probability p\nwith probability 1-p\n- Standard Normal Distribution\nFigure 1: Normal distribution, Source: RiskMetricsT M - Technical Document, p. 69.\n1 standard deviation\n68.26% probability\n2 standard deviations 95.54% probability\n3 standard deviations 99.74% probability\n15.433\nMIT Sloan\n\nFigure 2: Normal distribution, Source:\nFigure 3: Normal distribution, Source:\nCreditMetricsT M-Technical Document, p. 70.\nCreditMetricsT M-Technical Document, p. 37.\n15.433\nMIT Sloan\n\nA Digression to History\nIn his 1900 dissertation on \"The Theory of Speculation,\" Louis Bachelier searched for\n\"a formula which expresses the likelihood of a market fluctuation. \" He ended up with\na mathematical formula that describes the Brownian Motion.\nIn the finance world, Brownian Motion came to be called the random walk, once\ndescribed as the path a drunk might follow at night in the light of a lamp post.\nUsing the geometric Brownian motion to describe the random fluctuations in stock\nprices, Fisher Black, Myron Scholes, and Bob Merton worked out the Black Scholes\noption pricing formula.\nThis work was done in the spring of 1970, when both Merton and Scholes were at\nMIT Sloan!\n15.433\nMIT Sloan\n\nModel of the Behavior of Stock Prices\nWiener Processes\nThe change ∆z during a small period of time ∆t is:\n∆z = ε\n√\n∆t\n(1)\nwhere ε is a random drawing from a standardized normal distribution N(0,1). The\nvalues of ∆z for any two different short intervals of time ∆t are independent.\nIt follows from the first property that ∆z itself has a normal distribution with:\nmean of ∆z\n=\n(2)\nstandard deviation of ∆z\n=\n√\n∆t\n(3)\nvariance of ∆z\n=\n∆t\n(4)\nThe second property implies that z follows a Markov process.1\nConsider the increase in the value of z during a relatively long period of time T. This\ncan be denoted by z(T) -z(0). It can be regarded as the sum of the increases in z in\nN small time intervals of length ∆t, where\nN = T\n∆t\n(5)\nThus\nz(T) -z(0) =\nN\n\ni=1\nεi\n√\n∆t\n(6)\nwhere the εi (1, 2, . . . , N) are random drawing from N(0,1).\n1A Markov process is a particular type of stochastic process where only the present value for a\nvariable is relevant for predicting the future. The past history of the variable and the way that the\npresent has emerged from the past are irrelevant. Stock prices are usually assumed to follow a Markov\nprocess. Suppose that the price of IBM stock is $ 100 now. If the stock price follows a Markov process,\nour predictions should be unaffected by the price one week ago, one month ago, or one year ago. The\nonly relevant piece of information is that the price is now $ 100.\nPredictions for the future are uncertain and must be expressed in terms of probability distributions.\nThe Markov property implies that the probability distribution of the price at any particular future\ntime is not dependent on the particular path followed by the price in the past.\nThe Markov property of stock prices is consistent with the weak form of market efficiency. This sates\nthat the present price of a stock impounds all the information contained in a record of past prices. If\nthe weak form of market efficiency were not true, technical analysts could make above-average returns\nby interpreting charts of the past history of stock prices. There is very little evidence that they are,\nin fact, able to do this.\nStatistical properties of the stock price history of IBM may be useful in determining the characteristics\nof the stochastic process followed by the stock price (e.g. its volatility). The point being made here\nis that the particular path followed by the stock in the past is irrelevant.\n15.433\nMIT Sloan\n\nrelatively large value of delta t\nvalue of delta t\nz\nrelatively large value of delta t\nFigure 3: Relatively large value of ∆t\nsmall value of delta t\nvalue of delta t\nz\nsmall value of delta t\nFigure 4: Small value of ∆t\ntrue process\nvalue of delta t\nz\ntrue process\nFigure 5: The true process obtained as ∆t →0\n15.433\nMIT Sloan\n\nFrom the second property of Wiener processes, the εi's are independent of each other,\nif follows from equation 6 that z(T) -z(0) is normally distributed with\nmean of [z(T) -z(0)]\n=\n(7)\nstandard deviation of [z(T) -z(0)]\n=\n√\n∆t\n(8)\nvariance of [z(T) -z(0)]\n=\n∆t\n(9)\nThis is consistent with the discussion earlier in this section.\nGeneralized Wiener Process\nThe basic Wiener process, dz, that has been developed so far has a drift rate of zero\nand a variance rate of 1.0. The drift rate of zero means that the expected value of z\nat any future time is equal to its current value. the variance rate of 1.0 means that\nthe variance of the change in z in a time interval of length T equals T. A generalized\nWiener process for a variable x can be defined in terms of dz as follows\ndx = a dt + b dz\n(10)\nwhere a and b are constants.\nTo understand equation 10, it is useful to consider the two components on the right-\nhand side separately. The a dt term implies that x has an expected drift rate of a per\nunit of time. With the b dz term, the equation is\ndx = a dt\n(11)\nwhich implies that\ndx\ndt = a\n(12)\nor\nx = x0 + a t\n(13)\nwhere x0 is the value of x at time zero. In a period of time of length T, x increases by\nan amount a T. The b dz term on the right-handed side of euqation 10 can be regarded\nas adding noses or variability to the parth followed by x. The amount of this noise or\nvariability is b times a Wiener process. A Wiener process has a standard deviation of\n1.0. It follows that b times a Wiener proces has a standard deviation of b. In a small\ntime interval ∆t, the change in value of x, ∆x, is from equation 1 and 10, given by\n∆x = a∆t + ε\n√\n∆t\n(14)\n15.433\nMIT Sloan\n\nwhere, as before, ε is a random drawing from a standardized normal distribution. Thus\n∆x has a normal distribution with\nmean of ∆x\n=\na∆t\n(15)\nstandard deviation of ∆x\n=\nb\n√\n∆t\n(16)\nvariance of ∆x\n=\nb2∆t\n(17)\nSimilar arguments to those given for a Wiener process how that the change in the value\nof x in any time interval T is normally distributed with\nmean of ∆x\n=\naT\n(18)\nstandard deviation of ∆x\n=\nb\n√\nT\n(19)\nvariance of ∆x\n=\nb2T\n(20)\ntime\nvalue of variable, x\nWiener process: dz\ngeneralized Wiener process: dx = a dt+ b dz\ndx = a dt\nFigure 6: Wiener processes\nThus, the generalize Wiener process given in equation 10 has an expected rift rate\n(i.e. average rift per unit of time) of a and a variance rate (i.e., variance per unit of\ntime) of b2. It is illustrated in Figure (6).\nProcess for Stock Prices\n15.433\nMIT Sloan\n\nIt is tempting to suggest that a stock price follows a generalized Wiener process; that\nis, that it has a constant expected rift rate and a constant variance rate, However,\nthis model fails to capture a key aspect of stock prices. This is that the expected per-\ncentage return required by investors from a stock is independent of the stock price. If\ninvestors require a 14% per annum expected return when the stock price is $ 10, then\nceteris paribus, they will also require a 14% per annum expected return when it is $\n50. Clearly, the constant expected rift-rate assumption is inappropriate and needs to\nbe replaced by the assumption that the expected return (that is, expected rift divided\nby the stock price) is constant. If S is the stock price at time t, the expected drift rate\nin S should be assumed to be μS for some constant parameter, μ. This means that in\na short interval of time, ∆t, the expected increase in S is μS∆t. The parameter, μ, is\nthe expected rate of return on the stock, expressed in decimal form.\nIf the volatility of the stock price is always zero, this model implies that\n∆S = μS∆t\n(21)\nin the limit as ∆t →0\ndS = μSdt\n(22)\nor\ndS\nS = μdt\n(23)\nso that\nST = S0eμT\n(24)\nwhere S0 and ST are the stock price at time zero and time T. Equation 24 shows that\nwhen the variance rate is zero, the stock price grows at a continuously compounded\nrate of μ per unit of time.\nIn practice, of course, a stock price does exhibit volatility. A reasonable assumption\nis that the variability of the percentage return in a short period of time, ∆t, is the\nsame regardless of the stock price. In other word, an investor is just as uncertain of the\npercentage return when the stock price is $ 50 as when it is $ 10. This suggests that the\nstandard deviation of the change in a short period of time ∆t should be proportional\nto the stock price and leads to the model\ndS = μSdt + σSdz\n(25)\nor\ndSS = μdt + σdz.\n(26)\n15.433\nMIT Sloan\n\nEquation 26 is the most widely used model of stock price behavior. The variable σ is\nthe volatility of the stock price. the variable μ is its expected rate of return.\nThe discrete-time version of the model is\n∆S\nS\n= μ∆t + σε\n√\n∆t\n(27)\n∆S = μS∆t + σSε\n√\n∆t\n(28)\nThe variable ∆S is the change on the stock price, S, in a small interval of time, ∆t,\nand ε is a random drawing from a standardized normal distribution (i.e.g, normal\ndistribution with a mean of zero and standard deviation of 1.0). The parameter, μ, is\nthe expected rate of return per unit of time from the stock and the parameter, σ, is\nthe volatility of the stock price. Both of these parameters are assumed constant.\nThe left-hand side of equation 27 is the return provided by the stock in a short period\nof time, ∆t. The term μ∆t is the expected value of this return, and the term σε\n√\n∆t\nis the stochastic component of the return. The variance of the stochastic component\n(and therefore, of the whole return) is σ2∆t. This is consistent with the definition of\nthe volatility, σ. That is, σ is such that σ\n√\n∆t is the standard deviation of the return\nin a short time period, ∆t.\nEquation 27 shows that ∆S/S is normally distributed with mean μ∆t and standard\ndeviation σ\n√\n∆t. In other words,\n∆S\nS\n≈N\n\nμ∆t, σ\n√\n∆t\n\n(29)\n15.433\nMIT Sloan\n\nWhy Normals?\nModel the random fluctuation of stock prices using geometric Brownian motion. Im-\nplication for stock returns: normal distribution (for continuously compounded returns).\nThe annualized stock return is normal with mean (μ) and standard deviation (σ) .\nFor the S&P 500 index returns, μ is roughly 12%, and σ is roughly 15%. The latter is\nalso called volatility.\nFix a time horizon, say ∆t. The stock return over ∆is normally distributed with\nmean μ∆t and standard deviation σ\n√\n∆t. What is the distribution of daily returns?\n15.433\nMIT Sloan\n\nEvents that are not Normal\nA negative surprise: on October 19, 1987, the S&P 500 index dropped more than 23%\non one day.\nA positive surprise: on January 3, 2001, the Nasdaq composite index gained more\nthan 14% on one day.\nSuppose we use normal distribution to characterize daily stock returns.\nWhat are\nthe probabilities of such surprises?\nA Positive Surprise\nCCMP / Nasdaq-Index\n12/1/2000\n12/6/2000\n12/11/2000\n12/16/2000\n12/21/2000\n12/26/2000\n12/31/2000\n1/5/2001\n1/10/2001\n1/15/2001\nIndex-Level\nCCMP\nFigure 4: Nasdaq Dec 1 to Jan 18 2001, jumps on January 2nd and 3rd\n15.433\nMIT Sloan\n\nThe Probability of a Crash\nLet r denote the daily return, which is:\n- normally distributed with\n- mean 0.12/252 = 0.00048,\n- standard deviation 0.15 ·\n√\n252 = 0.0094\nWhat is the probability of an '87 crash? Prob (r < 0.23) =?\n- First, convert r to a standard normal\nX = r -0.00048\n0.0094\n(30)\n- Second, convert the critical value for r to that for X:\n-0.23 -0.00048\n0.0094\n≈-23\n(31)\n- Finally, knowing that X is a standard normal,\nProb(X < -23) = N(-23) = 10-127!\n(32)\n15.433\nMIT Sloan\n\nWhat Normal Fails to Capture...\nThere are large movements (both up and down) in stock prices that cannot be captured\nat all by the normal distribution.\nIn mathematical terms, the tail distribution of a normal random variable is too thin.\nHistorical stock returns exhibit fat tails.\nIf we make financial decisions based on normal distribution, we will miss out on the\nlarge movements. The consequences are catastrophic!\nThis is especially important for leveraged investments over a short time horizon.\nTail fatness is also an important issue in risk management.\n15.433\nMIT Sloan\n\nData Analysis\n-\n1,000\n2,000\n3,000\n4,000\n5,000\n6,000\n6/14/1985\n6/14/1986\n6/14/1987\n6/14/1988\n6/14/1989\n6/14/1990\n6/14/1991\n6/14/1992\n6/14/1993\n6/14/1994\n6/14/1995\n6/14/1996\n6/14/1997\n6/14/1998\n6/14/1999\n6/14/2000\n6/14/2001\nIndex Level\nSPX\nCCMP\nFigure 7: SP 500 and Nasdaq Index, index points, source: Bloomberg Professional.\nSPX\n-40%\n-30%\n-20%\n-10%\n0%\n10%\n20%\n30%\n40%\n6/21/1985\n10/21/1985\n2/21/1986\n6/21/1986\n10/21/1986\n2/21/1987\n6/21/1987\n10/21/1987\n2/21/1988\n6/21/1988\n10/21/1988\n2/21/1989\n6/21/1989\n10/21/1989\n2/21/1990\n6/21/1990\n10/21/1990\n2/21/1991\n6/21/1991\n10/21/1991\n2/21/1992\n6/21/1992\n10/21/1992\n2/21/1993\n6/21/1993\n10/21/1993\n2/21/1994\n6/21/1994\n10/21/1994\n2/21/1995\n6/21/1995\n10/21/1995\n2/21/1996\n6/21/1996\n10/21/1996\n2/21/1997\n6/21/1997\n10/21/1997\n2/21/1998\n6/21/1998\n10/21/1998\n2/21/1999\n6/21/1999\n10/21/1999\n2/21/2000\n6/21/2000\n10/21/2000\n2/21/2001\n6/21/2001\n10/21/2001\nWeekly Returns (ln)\nSPX\nFigure 8: SP 500 daily returns, source: Bloomberg Professional\n15.433\nMIT Sloan\n\n-5%\n0%\n5%\n10%\n15%\n20%\n25%\n30%\n-0.080\n-0.060\n-0.040\n-0.020\n-\n0.020\n0.040\n0.060\n0.080\nDaily Returns\nProbability\nCurrent Distribution\nNormal-Distribution\n\nPreliminaries for Data Analysis\nWhen given the \"raw data,\" first look for trends. If there are any, the first step is\nalways to de-trend the data.\nWhy?\nThe i.i.d. assumption for r1, r2, . . . , rN: returns are independent and identically\ndistributed.\nThe longer we observe, the more we know about the probability distribution . . . but do\nnot forget structural changes!\n15.433\nMIT Sloan\n\nEmpirical Distribution\n1. Sort the outcomes r1, r2, . . . , rN\n2. Denote the minimum by x and the maximum by x. Divide [x, x] evenly into K\nbins:\nbin 1: [x, x + ∆x]\nbin 2: [x + ∆x, x + 2∆]\n. . .\nbin 3: [x -x] , x\nwhere ∆x = (x + x) /K\n3. Fixing a number K, count the number Nk of the ri's that fall to the k-th bin.\n4. Repeat this for k = 1, 2, ..., K, we get a list of bins and their respective \"likelihood\"\nNk.\n5. Finally, we need to renormalize the likelihood so that the probability of ri falling\ninto [x, x] is one.\n-5%\n0%\n5%\n10%\n15%\n20%\n25%\n30%\n-0.080\n-0.060\n-0.040\n-0.020\n-\n0.020\n0.040\n0.060\n0.080\nDaily Returns\nProbability\nCurrent Distribution\nNormal-Distribution\nFigure 10: Daily return distribution of S&P 500 index.\n15.433\nMIT Sloan\nsource: Bloomberg Professional\n\nFat Tails\n-1%\n0%\n1%\n2%\n3%\n4%\n5%\n-0.080\n-0.070\n-0.060\n-0.050\n-0.040\n-0.030\n-0.020\n-0.010\n-\n0.010\nDaily Returns\nProbability\nCurrent Distribution\nNormal-Distribution\nFigure 11: Left fat tail of daily Return distribution of S&P 500 index, 5% on left hand side.\n-1%\n0%\n1%\n2%\n3%\n4%\n5%\n-0.010\n-\n0.010\n0.020\n0.030\n0.040\n0.050\n0.060\n0.070\n0.080\nDaily Returns\nProbability\nCurrent Distribution\nNormal-Distribution\nFigure 12: Right fat tail of daily Return distribution of S&P 500 index, 5% on right hand side\n15.433\nMIT Sloan\n\nSample Statistics\nmean\nμ = 1\nN\nN\n\ni=1\nri\n(33)\nvariance:\nσ2 = 1\nN\nN\n\ni=1\n(ri -μ)2\n(34)\nskewness (lack of symmetry):\nskew =\nN\nN\ni=1 (ri -μ)3\n√\nσ3\n(35)\nkurtosis (peakedness):\nkurt =\nN\nN\ni=1 (ri -μ)4\nσ2\n(36)\n15.433\nMIT Sloan\n\nStandard Errors\nTake the sample mean μ as an example:\nmean: μ = 1\nN\nN\ni=1 ri\nWe know that ri's are random draws from a stationary (and ergodic2) distribution.\nIn fact, to simplify our analysis, we assumed that they are i.i.d.\nThis implies that the sample mean μ is itself a random variable.\n- What is its mean?\n- What is its standard deviation?\nStandard errors: measure the precision of the estimators.\n2ergodic: Of, pertaining to, or possessing the property that in the limit all points in a space are covered with equal\nfrequency, or that each sufficiently large selection of points is equally representative of the whole.\n[Oxford English\nDictionary]\n15.433\nMIT Sloan\n\nConditional Version\nSo far, we assumed that the distribution of stock returns stays the same throughout\nhistory. We calculate the sample statistics as if history repeats itself with the same\nprobability law.\nBut we know that this cannot be true. How do we use the data when we have reasons\nto believe that the probability law changes over time?\nFor example, suppose we believe that the daily returns within each month t are nor-\nmally distributed with mean μtand standard deviation σt , which vary over time t.\nThe simplest way to take the conditional information into account is to calculate the\nsample mean and standard deviation month by month.\n15.433\nMIT Sloan\n\nTime Series Patterns\nWhile the unconditional version of sample statistics gives us a static picture of daily\nstock returns, the conditional version provides more dynamic information. For example,\n- The conditional expected returns are time varying, but there is not much persis-\ntence.\n- The conditional volatilities are also time varying.\nMoreover, they seem to be\nhighly persistent.\n- There is a negative relationship between returns and volatility: when the market\ngoes down, the volatility goes up.\nWe will revisit these issues in more detail in Class 9.\n15.433\nMIT Sloan\n\nSummary\nWe use probability distributions to characterize and evaluate random events.\nThere is a long tradition of using normal distributions to characterize the fluctua-\ntions in stock prices.\nThe normal distributions, however, are not adequate to capture large surprises.\nThe empirical distribution and sample moments are useful statistical tools to extract\ninformation from the data. Stationarity is one important assumption.\nThe precision of the sample moments can be measured by their standard errors.\nThe sample statistics can be used in both unconditional and conditional versions. The\nconditional version provides more dynamic information about the data.\nFocus:\nBKM Chapters 3 & 5 (Chapter 3: This is all general stuff, you need to now the basic\nthings like IPO, private placements, secondary market etc.);\n- p. 137 (probability distribution, standard deviation);\n- p. 141 (figure 5.4);\n- p.149 bottom and 150 (continuous compounding);\nReader: Fama (1995).\nType of potential questions: chapter 3 concept check question 2 3, p. 98 ff. question\n2, 5, 11, 17, 22 chapter 5, p. 146 ff. question 10, 12, 15\n15.433\nMIT Sloan\n\nQuestions for Next Class\nPlease read:\n- BKM Chapters 6 and 7,\n- Elton and Gruber (2000), and\n- Kritzman (1992)\nThink about the following questions:\n- Two important components in making an investment decision: the investment\nopportunity and the investor.\n- Admittedly, one investor may differ from another. And the investment opportu-\nnity does not stay constant across space or time.\n- If you were asked to build a model of investments for a generic investor on a\ngeneric market environment, what are the basic features you would include in\nyour model?\n15.433\nMIT Sloan"
    },
    {
      "category": "Resource",
      "title": "154333portfolio1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/aaabe0fbbdfa71e72fe46853b289a34d_154333portfolio1.pdf",
      "content": "15.433 INVESTMENTS\nClass 3: Portfolio Theory\nPart 1: Setting up the Problem\nSpring 2003\n\nA Little History\nIn March 1952, Harry Markowitz, a 25 year old graduate student from the University\nof Chicago, published \"Portfolio Selection\" in the Journal of Finance.\nThe paper opens with: \"The process of selecting a portfolio may be divided into two\nstages. The first stage starts with observation and experience and ends with beliefs\nabout the future performances of available securities. The second stage starts with the\nrelevant beliefs about future performances and ends with the choice of portfolio\".\nThirty eight years later, this paper would earn him a Nobel Prize in economic sci\nences.\n\nIntroduction\nTwo basic elements of investments:\n- the investment opportunity;\n- the investor.\nOur task for this class:\n- a model for financial assets;\n- a model for investors;\n- optimal portfolio selection.\n\nModelling Financial Returns\nVirtually all real assets are risky. Financial assets, claims on real assets, bear such risk:\n- some are designed to minimize risk\n- some are designed to capture risk\n25%\n20%\n15%\n10%\nProbability\nDaily returns (ln)\n5%\n0%\n-5%\n-10%\n-15%\n-20%\n1/4/1993\n4/4/1993\n7/4/1993\n10/4/1993\n1/4/1994\n4/4/1994\n7/4/1994\n10/4/1994\n1/4/1995\n4/4/1995\n7/4/1995\n10/4/1995\n1/4/1996\n4/4/1996\n7/4/1996\n10/4/1996\nFigure 1: Return of Mexican Peso, Source: Bloomberg Professional.\n30%\n25%\n20%\n15%\n10%\n5%\n0%\n-5%\n-0.080\n-0.060\n-0.040\n-0.020\n-\n0.020\n0.040\n0.060\n0.080\nDaily Returns\nCurrent Distribution\nNormal-Distribution\nFigure 2: Return of S & P 500 Index,\nSource: Bloomberg Professional.\n30%\n25%\n20%\n15%\n10%\n5%\n0%\n-5%\n-0.080\n-0.060\n-0.040\n-0.020\n-\n0.020\n0.040\n0.060\n0.080\nDaily Returns\nCurrent Distribution\nNormal-Distribution\nFigure 3: Return of 10 Year Treasury Bills,\nSource: Bloomberg Professional.\nProbability\n\nModelling Investors\nOverall, investors are risk averse, although some are more so than the others. \"We next\nconsider the rule that the investor does (or should) consider expected return a desirable\nthing and variance of return an undesirable thing\". - Markowitz (1952).\nHeterogeneity of investors:\n- individual investors vs. corporations\n- investors with different marginal tax rates\n- informed vs. uninformed\n- young vs. old\n- Behavior issues: loss aversion, mental accounting, over confidence, over reaction,\nunder reaction, etc.\n\nn\n(\nn\n(\n(\n(\nChoose A or B\nA :\n$2400000 with probability 100%\n$100000000 with probability 25%\nB :\n$0\nwith probability 75%\nChoose C or D\nC :\n-$7500000 with probability 100%\n$0\nwith probability 25%\nD :\n-$100000000 with probability 75%\nEquivalent Choices:\n$2400000 with probability 25%\nA + D :\n-$7600000 with probability 75%\n$2500000 with probability 25%\nB + C :\n-$7500000 with probability 75%\n\nSetting up the Problem\nWhat do we need . . . a recipe and some ingredients.\nThe investment opportunity:\n- riskfree rf = 7%\n- risky rp : E (rp) = 15%, std (rp) = 22%.\nBKM,\np.\nA mean-variance investor:1\n157 ff.\nU (r) = E(r) - 0.005 · A · var (r)\n(1)\nThe optimal portfolio selection:\n- invest a portion y of the total wealth in the risky asset, leaving the rest in the\nriskfree account\n- possible portfolios: ry = (1 - y) · rf + y · rp\n- the optimal portfolio?\nmax U (ry )\ny ∈ R\nwhere R stands for the space of real numbers.\n1The coefficient 0.005 is in the literature as well written as 1\n2 . It is a calibration coefficient to\ncalibrate the subjective risk aversion coefficient A.\n\nq\nPortfolio Construction\nThe opportunity set is fixed: rf and rp\nOur only choice variable: y [how much to invest in risk portfolio]\nThe end product:\nry =\nE (ry ) =\n=\n=\nvar (ry )\n=\n=\n=\nstd (ry )\n=\n(1 - y) · rf + y · rp\nE ((1 - y) · rf ) + E (y · rp)\n(1 - y) · 0.07 + y · 0.15\n0.07 + 0.08 · y\nvar ((1 - y) · rf ) + var (y · rp)\n+2 · cov ((1 - y) · rf , y · rp)\n0 + y · 0.222 + 0\n0.222 · y\nvar (ry ) = 0.22|y|\n(2)\n(3)\n(4)\n(5)\n(6)\n(7)\n(8)\n(9)\n\nThe Risk Return Combinations\nEvery choice of y gives rise to one pair of return E and risk std.\n- For y > 0, we have:\nE (ry ) - 0.07\nstd (ry )\ny =\n=\n(10)\n0.08\n0.22\n- More generally, we have, for any y ¿ 0:\ny = E (ry ) - rf\nE (rp) - rf\n= std (ry )\n(11)\nstd (rp)\ny may vary over the entire positive real line, but this relation holds regardless.\nA linear relation between E and std:\nE (ry ) - rf = E (ry ) - rf std (ry )\n(12)\nstd (rp)\n\nThe Capital Allocation Line\nCollecting all y ∈ R,we get all of the risk-return (μ, σ) combinations available to in\nvestors.\nE(r)\nE(rP)\nrf\nS\nE(rp)\nrf\nP\nCAL (Capital Allocation Line)\nσ\nσP\nFigure 4: Capital Allocation Line\nweight y\nrf\nσP\nσ\nP\nCAL (Capital Allocation Line)\nE(rP)\ny\nw\nFigure 5: Capital Allocation Line, a different view.\n\nThe Sharpe Ratio\nOne measure of the attractiveness of a portfolio r is its Sharpe Ratio (S):\nIntuitively, S measures extra return per extra risk.\nE (r) - rf\nS =\n(13)\nstd (r)\nRecall that the CAL can be re-written as:\nE (ry ) - rf = E (ry ) - rf std (ry )\n(14)\nstd (rp)\nFor the extra risk std (ry ) chosen (through y), the extra reward is: Sp · std(ry ).\nMoreover, the Sharp Ratio Sy of any portfolio thus constructed from rf and rp is\nthe same:\nSy = Sp = E (ry ) - rf\n(15)\nstd (rp)\nfor any y > 0. Does that make sense to you?\n\nForming the Optimization Problem\nWe are now ready to \"feed\" our portfolio to the optimization machine:\nmax U (ry )\n(16)\ny ∈ R\nwhere\nU (r) = E(r) - 0.005 · A · var (r)\n(17)\nFrom our earlier derivation, we know that:\nE(ry ) = 0.07 + 0.08 · y; var(ry ) = 0.222 · y 2\n(18)\nOur optimization problem therefore becomes max f (y):\nmax\ny ∈ R\nU (ry )\n(19)\nf (y) = 0.07 + 0.08 · y - 0.0005 · A · y2\n\nThe Optimization Machine\nThree components of an optimization problem:\n- the objective function f (y);\n- the variable y; and\n- the search space R\nThree ways to solve an optimization problem:\n- analytical;\n- numerical; and\n- graphical.\nThe mathematical foundation:\n- let y* be the solution of f 0(y) = 0;\n- if f 00(y∗) < 0, then y* is truly the optimal solution.\n\nA Pictorial Solution\nf (y)\nf ' (y)\noptimal\nportfolio weight\ny*\ny\ny\noptimal\nportfolio weight\ny*\nFigure 6: Optimal portfolio weight\n\nAn Analytical Solution\nThe risk aversion coefficient is set at A = 4 and the optimal weight is y*=0.41.\nLet's take some derivatives:\nf 0 (y) = ∂f (y) = 0.08 - 0.222 · A · y\n(20)\n∂y\nf 00 (y) = ∂f 0 (y)\n∂y\n= -0.222 · A\n(21)\n1. look for y∗ that satisfies f 0(y∗) = 0:\ny∗ =\n0.08\n(22)\n0.222 · A\n2. check the optimality of y∗: f \"(y∗) < 0?\n\nDeterminants of Portfolio Weights\nMore generally, the optimal solution can be expressed as\ny∗ = E (rp - rf )\n(23)\nvar (rp) · A\nA more risk-averse investor (with a larger risk-aversion coefficient A) will invest less in\nthe risky asset.\nleast risk aversion\nUtility\nmedium risk aversion\nmost risk aversion\ny\nportfolio weight y\nFigure 7: Utility-function.\nIf the risk premium, E (rp) - rf , of the original risky asset decreases, a risk-averse\ninvestor will reduce his holdings in the risky asset accordingly.\nIf the original asset is risky (with var(rp) > 0), but pays zero risk premium, then\nno risk-averse investor will hold the risky asset. If the risk premium is negative, a\nrisk-averse investor will start shorting the asset.\nWhat is the optimal portfolio weight y* of an investor with the following utility func\ntion?\nHINT: This investor cares only about the Sharpe Ratio.\n\nGoing Beyond\nOur setup assumes the following:\n1. A mean variance investor;\n2. Investment horizon is fixed to one year;\n3. No dynamic rebalancing in between.\nOf course, this setup is a very rough characterization of the real investment problem.\nNevertheless, this example is valuable:\n- First, it provides a framework for us to think about the portfolio optimization\nproblem.\n- Second, although simple, it provides rich intuition.\nNow we can go beyond to the next step.\n\nThree Extensions\n1. The Skewness Extension: allow skewed asset returns and add preference for posi\ntive skewness and aversion to negative skewness.\n2. The Horizon Extension: allow investment horizon to vary.\n3. The Dynamic Extension: allow for dynamic rebalancing.\n\nLeisure Readings\n\"Fourteen Pages to Fame,\" Chapter 2 of Capital Ideas by Peter Bernstein.\nFocus:\nChapters 6 & 7:\n- p.157 (eq. 6.1)\n- p. 161\n- p. 163 to 166\n- p. 188\n- p. 191 to 195 (utility function, utility curves, CAL)\nReader: Kritzman (1992)\ntype of potential questions: Chapter 6 concept check question 3 & 4, p. 168 ff. ques\ntions 2, 9, 10 chapter 7 concept check question 2, 3, 4 & 5, p. 200 ff. questions 4, 8,\n13.\n\nQuestions for the Next Class\nPlease read BKM Appendix A, B of Chapter 6, Black (1995) and Kritzman (1992).\nWhat about market crashes? Can event risks small probability but high impact events\never be ignored in making an investment decision?\nWhat do you think of BKM's defense of mean variance analysis? What is the ma\njor assumption in Paul Samuelson's proof? Is this assumption realistic?"
    },
    {
      "category": "Resource",
      "title": "154334portfolio2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/64364800d3b15fcdb618e844e9ba25b7_154334portfolio2.pdf",
      "content": "15.433 INVESTMENTS\nClass 4: Portfolio Theory\nPart 2: Extensions\nSpring 2003\n\nIntroduction\n- Should someone with longer investment horizon put more in the stock market?\n- Is there value in dynamic re-balancing?\n- How do market crashes affect investment behavior above and beyond their impact\non mean and variance?\n\nOne Day in LTCM\nOn Aug. 17, 1998, Russia defaulted on its local debt. Friday August 21 at LTCM,\nGreenwich, CT:\n\"When he saw the quotation for U.S. swap spreads, he stared at his screen in dis\nbelief. On an active day, U. S.' swap spreads might change by as much as a point. But\non this morning, swap spreads were wildly oscillating over a range of 20 points. \"That\nFriday, Long? Term lost money wherever it looked. Credit spreads simply exploded. ?\nThough these moves may seem small in absolute terms, the effect on Long? Term was\nmagnified by the fund's potent level of leverage and its immense position size.\" \"Long-\nTerm, which had calculated with such mathematical certainty that it was unlikely to\nlose more than $35 million on any single day, had just dropped $553 million on that\none Friday in August.\"\n\"When Genius Failed\" by Roger Lowenstein\n\nFat Tails\n5%\n4%\n3%\n2%\n1%\n0%\n-1%\n-0.080\n-0.070\n-0.060\n-0.050\n-0.040\n-0.030\n-0.020\n-0.010\n-\n0.010\nDaily Returns\nCurrent Distribution\nNormal-Distribution\nFigure 1: Left fat tail of daily return distribution of S&P 500 index.\n5%\n4%\n3%\n2%\n1%\n0%\n-1%\n-0.010\n-\n0.010\n0.020\n0.030\n0.040\n0.050\n0.060\n0.070\n0.080\nDaily Returns\nCurrent Distribution\nNormal-Distribution\nProbability\nProbability\nFigure 2: Right fat tail of daily return distribution of S&P 500 index.\nn\n\nx\n-5\n-4\n-3\n-2\n-1\n-0.5\n-0.3\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n-5\n-4\n-3\n-2\n-1\n-0.5\n-0.3\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\nQuantify Fat Tails Skewness\nSkewness\nE (x - E (x))3\nskew (x) =\nstd (x)3\n(1)\nKurtosis\nE (x - E (x))4\nkurto (x) =\nstd (x)4\n(2)\nWhat is the skewness of a standard normal?\nSkewness / Normal\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n-0.5\n-0.3\n-5\n-4\n-3\n-2\n-1\nx\nFigure 3: Skewness of a standard normal distribution, splus.\nWhat is the kurtosis of standard normal?\nCaution: skewness and kurtosis might not exist for some random variables.\n\n(\nA Model with Event Risk\nDaily Return r:\nr = x + y\nx is the \"normal\" component:\ny is the \"jump\" component:\ny =\nJ with probability p\n0 with probability 1-p\nx and y and are independent.\n\nMoments of the Crash Model\nmean\nE (r) = μ + J · p\n(3)\nvariance:\nvar (r) = σ2 + J 2 · p · (1 - p)\n(4)\nskewness:\nJ 3 · p · (1 - p) · (1 - 2p)\nskew (r) =\np\n(5)\nvar (r2)\n\nThe Skewness of the Crash Model\nModel\nP\nJ\nskew\nonce a month\n1/12\n-2%\n-1.0\nonce a year\n1/365\n-10%\n-5.6\nonce a lifetime 1/365/100 -50%\n-7.1\nEach jump model is calibrated so that the annualized expected return is 12%, and the\nannualized volatility is 15%.\nThat is, the returns from the three models are equally attractive to a mean-variance\ninvestor!\n\nSkewness Preference\nA utility function that captures the risk attitude of an investor in three ways:\nU (r) = E (r) - 1 · A · var (r) +\n1 · B · E (r - E (r))3\n(6)\n1. the expected return is desirable;\n2. the variance of return is undesirable (A > 0);\n3. positive skewness is desirable, negative skewness is not (B > 0).\nIf we set B = 0, we are back to a mean-variance investor.\n\nModifying the Original Problem\nTwo modifications of our original problem:\n1. Investor has a preference for skewness;\nU (r) = E (r) - 1 · A · var (r) +\n1 · B · E (r - E (r))3\n(7)\n2. The risky asset rP is negatively skewed:\nskew = -2\nThe optimization problem:\nmax U (ry )\n(8)\ny ∈ R\nJust as before, rP is the portfolio return:\nry = (1 - y) · rf + y · rp\n(9)\n\nFormalizing the Problem\nAs before, we calculate the utility U (ry ) of an investor who invests a fraction y of his\nwealth in the risky asset rp, leaving the rest in the riskfree account rf :\nry = rf + y · (rp - rf )\n(10)\nTwo old pieces of U (ry ):\nE (ry ) = 0.07 + 0.08 · y; var (ry ) = 0.222 · y 2\n(11)\nThe new piece of U (ry ):\nE (ry - E (ry ))3 = y 3 · Ep - E((rp)3\n(12)\nRecall that by definition\nE (x - E (x))3 = skew (x) · std (x)3\n(13)\nwe therefore have:\nE (ry - E (ry ))3 = 0.223 · (-2) · (y)3\n(14)\n\nThe Optimization Machine\nArmed with all three pieces of U (ry ), we write our optimization problem in mathemat\nical terms:\nmax U (ry )\n(15)\ny ∈ R\nf (y) = 0.07 + 0.08 · y - 1\n· A · 0.222 + 6\n· B · 0.223 · (-2) · y\n(16)\nIn our original problem, f (y) is a linear-quadratic function of y.\nWhat about now?\n\nOptimization: Analytical Method\nThe mathematical foundation:\n- let y∗ be the solution of f 0(y) = 0\n- let f 00(y∗) < 0, then y* is truly the optimal solution.\nLet's take some derivatives:\nf 0 (y) = 0.08 - 0.222 · A · y +\n· 0.223 · (-2) · B · y 2\n(17)\nf 00 (y) = -0.222 · A +\n· 0.223 · (-2) · B · y\n(18)\nWhat do you think? How do we look for the optimal y*? Does it even exist?\n15.433\nMIT Sloan\n\nOptimization: A Pictorial Solution\nf(y)\nportfolio weight y\nf ' (y)\nportfolio weight y\n?\nf '' (y)\nportfolio weight y\n?\nFigure 4: Risk aversion and optimal weight.\n15.433\nMIT Sloan\n\nThe variance aversion coefficient is set at A = 4, and the skew preference is set at B = 5.\nThe optimal portfolio weight is y* = 0.37.\nRecall that, given the same choice set (rp and rf ), a mean-variance investor with\nA = 4 will invest y* = 0.41.\n15.433\nMIT Sloan\n\nDeterminants of Optimal Allocation\nWhat we already know:\n∗\n1. a more variance-averse investor tends to invest less in the risky asset: A ↑⇒ y ↓\n2. given a higher risk premium, a risk-averse investor will invest more in the risky\n∗\nasset: (E(rp) - rf ) ↑\n⇒ y ↑\n3. given the same risk premium, if the risky asset becomes more volatile, a risk-averse\n∗\ninvestor will reduce his holdings in it: std(rp) ↑\n⇒ y ↓\nNew Results\nAn investor who is more averse to negative skewness tends to invest less in a negatively\n∗\nskewed risky asset: B ↑\n⇒ y ↓\nGiven the same risk premium and volatility, if a risky asset becomes more negatively\n∗\nskewed, an investor with skewness preference will reduce his holdings: skew(rp) ↓⇒ y ↓\n15.433\nMIT Sloan\n\nThe Horizon Effect\nTo study the horizon effect, we need to understand how stock returns aggregate over\ntime.\nLet's start with the simplest model.\nr1 = μ + σ · ε1\nr2 = μ + σ · ε2\nr3 = μ + σ · ε3\n. . .\nThe daily shocks t are independent and standard normally distributed.\n15.433\nMIT Sloan\n\nFocus:\nBKM Appendix A, B of Chapter\n- 6 p. 172 to 177 middle (probability, distribution, skewness [no equation], normal\ndistribution)\n- p. 178 middle to 181 middle (utility, utility function)\nReader: Black (1995)\ntype of potential questions: -\n15.433\nMIT Sloan\n\nQuestions for Next\nPlease read:\n- BKM Chapter 8,\n- Kritzman (1994), and\n- Kritzman (1991)\nThink about the following questions:\n- What do we mean by diversification?\n- When does diversification work, when doesn't it?\n- Can you think of other real life examples (non?financial) when the principle of\ndiversification is used?\n15.433\nMIT Sloan"
    },
    {
      "category": "Resource",
      "title": "154335portfolio3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/d87bfc38cba412a4187bb892a70fe372_154335portfolio3.pdf",
      "content": "15.433 INVESTMENTS\nClass 5: Portfolio Theory\nPart 3: Optimal Risky Portfolio\nSpring 2003\n\nIntroduction\n- Having determined the appropriate exposure to risk, the investor's next task is to\nbuild his risky portfolio rp.\n- This selection will be made from the whole universe of risky assets that are avail\nable for investment.\n\n⃝\nHow Big is the Universe of Risky Assets?\nWe live in an exciting time, with an expansive investment environment. Here is a list\nof the plain-vanilla instruments reported by RiskMetrics c , source : RiskM etricsTM -\nT echnical Document\nEquity Indices: 31 countries.\nForeign Exchange Rates: 31 currencies.\nMoney Markets around the world: 111.\nSwaps around the world: 121.\nGov't Bonds around the world: 153.\nCommodities: 33.\nOver 400 different instruments!\nThis does not include individual equities, mutual funds, venture capital funds, futures, options, and\nother derivatives ... .\n\nTwo Risky Assets\n1. r1\nμ1 = 13%, σ1 = 20%\n2. r1\nμ2 = 8%, σ2 = 12%\n3. correlated returns : ρ = corr (r1, r2) = 30%.\nMixing the Risky Assets\n- a fraction of w in equity\n- a fraction of 1 - w in debt\n- the risky portfolio rp = w · r1 + (1 - w) · r2\nw\nwi\ny\nrf\nσP\nσ\nP\nE(rP)\nFigure 4: Efficient frontier.\n\nThe Risky Portfolios\nLet's first calculate the mean and variance of the risky portfolio:\nμP\n= w · μ1 + (1 - w) · μ2\n(1)\nσ2 = w · σ1 + (1 - w)2 · σ2 + 2 · w · (1 - w) · cov (r1, r2)\n(2)\n\np\n= w · σ1 + (1 - w)2 · σ2 + 2 · w · (1 - w) · σ1σ2ρ1,2\n(3)\nSpanning the mean-std space:\nμi\no\no\nμ1\nμ2\nσ2\nσ1\nrisky P2\nrisky P1\nmean μ (%)\nσi\nstd σ (%)\nFigure 5: Efficient frontier.\n\nThe Optimal Portfolio Problem\nthe investment opportunity\n- one riskfree rf\n- two risky assets r1 and r2\na mean-variance investor\nU (r) = E (r) - 1 · A · var (r) + · B · E (r - E (r))3\n(4)\ninvestment decisions:\n1. choose the overall exposure to risk:\ny in the risky portfolio rp and 1 - y in rf .\n2. choose the right risky portfolio rp:\nw in r1, and 1 - w in r2.\npossible portfolios:\nry,w = (1 - y) · rf + y · (w · r1 + (1 - w) · r2)\n(5)\n\nthe optimal portfolio:\nmax\nU (ry,w)\n(6)\ny ∈ R, w ∈ R\n\nThe Separation Principle\nIn addition to the choice variable y, which controls the investor's overall exposure to\nrisk, our current problem also involves the choice variable w, which controls the right\nmix of the risky assets.\nThe Complication: Need to solve y and w simultaneously in the optimization problem:\nmax\nU (ry,w)\n(7)\ny ∈ R, w ∈ R\nSolution: The Separation Principle (James Tobin 1958):\n- the choice y of the overall risk exposure is investor specific, depending on his\ndegree of risk aversion;\n- the choice w of the optimal risky portfolio is the same for all investors.\n\nA Brief Review of CAL\nμi\nstd σ (%)\nσi\no\nrf\nmean μ (%)\nFigure 6: Efficient frontier.\nPick any risky portfolio rp, invest a fraction y in it, leaving the rest in the riskfree\naccount rf .\nWhat are the possible (E-Std) combinations?\nE (ry ) - rf\nE (ry ) - rf =\nstd (ry )\n(8)\nstd (rp)\n\nA Brief Review of the Sharpe Ratio\nμi\nmean μ (%)\nμ1\nrisky P1\no\nr\no\nf\nrisky P2\no\nσi\nstd σ (%)\nFigure 7: Efficient frontier.\nOne measure of the attractiveness of a portfolio r is its Sharpe Ratio:\nE (r) - rf\nS =\n(9)\nstd (r)\nWhat is its graphical interpretation?\n\nThe Optimal Risky Portfolio\nμi\nmean μ (%)\nrf o\no\no\nμ1\nμ2\nσ2\nσ1\nrisky P2\nrisky P1\nσi\nstd σ (%)\nFigure 8: Efficient frontier.\nEach CAL is uniquely identified by its slope.\nThe best CAL is the one with the steepest slope, or the highest Sharpe Ratio.\nThe Optimal Risky Portfolio is the Tangency Portfolio: the unique portfolio with\nthe highest Sharpe-Ratio.\nConceptually, it is very important to notice that the definition of the Optimal Risky\nPortfolio does not involve the degree of risk aversion of any individual investor.\nIn such an ideal world, every investor, regardless of his level of risk aversion, will\nagree on the best CAL, and allocate his wealth between rf and the optimal risky port\nfolio.\nThe portion y invested in the optimal risky portfolio, however, will depend on each\ninvestor's degree of risk aversion, as discussed in Class 3.\nIn practice, however, different investors might have very different ideas about their\nOptimal Risky Portfolio. Why?\n\nMultiple Risky Assets\nThe opportunity set generated by the two risky assets is relatively simple. As we gen\neralize to the case of multiple risky assets, the opportunity set becomes considerably\nmore complicated. Suppose that we have n securities, whose random returns are de\nnoted by r1, r2, . . . , rn\nAs usual, we construct portfolios by mixing these n securities:\nrp = w1 · r1 + w2 · r2 + · · · + wn · rn\n(10)\nwhere the w's are the portfolio weights, adding up to 1.\nEach chosen w gives rise to an investment opportunity with\nn\n\nE (rp)\n=\n\nwi · E (ri)\n(11)\ni=1\nn\nn\n\nvar (rp)\n=\n\nwi · wj · cov (ri, rj )\n(12)\ni=1 j=1\n\nn 1\ncovi,j =\nn (ri -r i) · (rj -r j )\nequal weighted\n(13)\ni=1\nn\n\ncovi,j =\npt · (ri -r i) · (rj -r j )\nprobability weighted\n(14)\ni=1\nThis results in an enormous degree of freedom, and a very rich opportunity set. Of\ncourse, not all portfolios in the opportunity set are good deals.\nConstructing the mean?variance frontier: an efficient set of portfolios that achieve\nthe lowest possible risk for any given target rate of return.\n\nThe Optimal Portfolio in Practice\nImplication of the Separation Principle: A portfolio manager will offer the same risky\nportfolio to all clients.\nIn practice, different managers focus on different subsets of the whole universe of finan\ncial assets, derive different efficient frontiers, and offer different \"optimal\" portfolios to\ntheir clients.Why?\nThe theory of portfolio selection builds on many simplifying assumptions:\n- No Market Frictions (tax, transactions costs, limited divisibility of financial assets,\nmarket segmentation).\n- No Heterogeneity in Investors (e.g. rich vs. poor, informed vs. uninformed, young\nvs. old).\n- Static expected returns and variance - no forecastability in returns or volatility\n(e.g. financial analysts, accounting information, macro?economic variables do not\nplay any role in making an investment decision).\nOur next step toward reality (in Classes 19-20): link the following two bodies of ideas,\n- Security Analysis: subjective, judgmental\n- Portfolio Selection: objective, statistical.\nSome important questions to think about:\n- Can security analysis improve portfolio performance?\n- How do analysts' opinions enter in security selection?\n\nA Digression to Diversification\nDiversification is a universal concept. Put in simple terms, one should not put all eggs\nin one basket.\nIn investments, diversifying means holding similar amounts of many risky assets in\nstead of concentrating all of your investment in only one.\nIn social science, it is believed that individuals are of \"bounded rationality\". One way\nto mitigate such a problem is through decision-making by multiple agents.\nFor example, in gymnastics or figure skating competitions, the score is averaged over\nmultiple judges, after taking away extremes on either end.\nThe mathematical foundation of diversification - the strong law of large numbers!\nBKM,\np.\nn 2\n299 f.\n\n1 σε\n=\nσε\ni =\n(15)\nσε\np\nn\nn\ni=1\nn\nβp =\n·βi\n(16)\nn i=1\nn\nαp =\n·αi\n(17)\nn i=1\nn\nεp =\n·εi\n(18)\nn i=1\nσ2 = β2σ2\np\np\nM + σε\np\n(19)\n\nLeisure Readings\n\"The Interior Decorator Fallacy\" Chapter 3 of Capital Ideas by Peter Bernstein.\nFocus:\nBKM Chapter 8\n- p. 210-213 (eq. 8.2, eq. 8.4, table 8.2)\n- p. 217 middle to 229 (Markowitz, efficient frontier, mean variance)\n- p. 234-239 (separation property, CAL)\nReader: Kritzman (1994)\ntype of potential questions: concept check question 1, 2, 3, p. 286 ff. questions 5,\n11, 18\n\nQuestions for the Next Class\nPlease read BKM Chapters 9-11, Roll and Ross (1995) and Kritzman (1991), and think\nabout the following questions:\nThe separation principle implies that every investor, regardless of his degree of risk\naversion, will hold the same optimal risky portfolio. What implication does this result\nhave on the entire market? Suppose there are I investors in the market. Each investor i\nhas? a risk aversion coefficient Aj , with optimal exposure to the optimal risky portfolio.\n∗\nE (rp) - rf\ny =\n(20)\ni\nvar (rp) · Ai\n∗\nIn equilibrium, adding yi across all investors, what do we get?, (Hint: In equilibrium,\nsupply equals demand, e.g., the amount of borrowing equals that of lending.)"
    },
    {
      "category": "Resource",
      "title": "154336capm1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/df52f7f91f5a13fbfa988a0becb6334a_154336capm1.pdf",
      "content": "15.433 INVESTMENTS\nClasses 6: The CAPM and APT\nPart 1: Theory\nSpring 2003\n\nIntroduction\nSo far, we took the expected return of risky asset as given. But where does expected\nreturn come from?\nUsing the intuition that investors are risk averse, one explanation is that the risk\npremium - expected return in excess of the riskfree rate - is a reward for bearing risk.\nDoes this make sense?\nThe Capital Asset Pricing Model (CAPM) provides a simple, yet elegant framework\nfor us to think about the question of reward and risk.\n\n\"The CAPM \"\nIn market equilibrium, investors are only rewarded for bearing systematic risk - the\ntype of risk that cannot be diversified away.\nThey should not be rewarded for bearing idiosyncratic risk, since this uncertainty\ncan be mitigated through appropriate diversification.\nSharpe on CAPM\nBill Sharpe, one of the originators of the CAPM, in an interview with the Dow Jones\nAsset Manager:\n\"But the fundamental idea remains that there's no reason to expect re-\nward just for bearing risk. Otherwise, you'd make a lot of money in Las\nVegas. If there's reward for risk, it's got to be special. There's got to be\nsome economics behind it or else the world is a very crazy place. I don't\nthink differently about those basic ideas at all\".\n- Sharpe (1998)\n\nAssumptions\n1. Perfect Markets\n- Perfect competition - each investor assumes he has no effect on security prices\n- No taxes\n- No transactions costs\n- All assets publicly traded, perfectly divisible\n- No short-sale constraints\n- Same riskfree rate for borrowing and lending\n2. Identical Investors\n- Myopic1\n- Same holding period\n- Normality or Mean-Variance Utility\n- Homogeneous expectations\n1 myopic: adj. Of, pertaining to, or affected with myopia; short-sighted, near-sighted\n\nThe Equilibrium Market Portfolio\nRecall that every investor holds some combination of the riskless asset and the tan\ngency portfolio.\nμi\nmean μ (%)\nrf\nCML\no\no\nμΜ\nσΜ\nMarket\nσi\nstd σ (%)\nFigure 1: Equilibrium market portfolio and efficient frontier.\nWhen we aggregate the portfolios of all individual investors, lending and borrowing\nwill cancel out, and the value of the aggregated risky portfolio will equate the en-\ntire wealth of the economy. The tangent portfolio has become the equilibrium market\nportfolio.\n\nThe Market Price of Risk\nThere are N mean-variance investors in the economy, each with $1.\nInvestor Risk Aversion Portfolio Weight\nA1\nμM -rf\nσ2\nM A1\nA1\nμM -rf\nσ2\nM A2\nA1\nμM -rf\nσ2\nM A3\n. . .\n. . .\n. . .\nN\nAN\nμM -rf\nσ2\nM AN\nAggregating over all Investors, the total wealth invested in the market portfolio is:\nμM - rf\n$1 ·\nσM\nA1\n+ 1\nA2\n+ . . . + 1\nAN\n(1)\nIn equilibrium, the total wealth invested in the market portfolio must be:\n$1 · N\n(2)\nThis implies:\nμM - rf = σ2\nM A\n(3)\nwhere is an overall measure of the risk aversion among the market participants:\nA = 1\nN ·\nA1\n+ 1\nA2\n+ . . . + 1\nAN\n(4)\n\nPricing the Individual Risky Assets\nThe market portfolio is made of individual risky assets:\nrM = w1r1 + w2r2 + . . . + wN rN\n(5)\nwhere wi is the fraction of total market wealth invested in asset i.\nHow are the individual risky assets priced in equilibrium?\nTo answer this question, we deviate the equilibrium holding wi of asset i slightly away\nfrom its optimal level, and see how such a deviation affect our investor's maximized\nutility.\nLet's focus on a representative investor with the average risk aversion .\nU (r) = E (r) -\nA var (r)\n(6)\nHis portfolio holding:\n∗\nr = y ∗ (w1 r1 + w ∗\n2 r2 + . . . + w ∗\nN rN ) + (1 - y ∗) rf\n(7)\n∗\nWhat is his y ?\n∗\nIn equilibrium, wi is the optimal solution for this investor. This means:\n∂U (r) = 0\n(8)\n∂wi\nKeeping everything else fixed, what if we change wi a little?\n∂E (r) = E (ri) - rf\n(9)\n∂wi\n∂var (r) = 2 · cov (rM , ri)\n(10)\n∂wi\n\nSo it must be that:\n\nE (ri) - rf = A cov (rM , ri)\n(11)\nRecall that:\n\nE (rM ) - rf = A var (rM )\n(12)\nThis takes us to:\nE (ri) - rf = βi (E (rM ) - rf )\n(13)\nwhere\ncov (rM , ri)\nβi =\n(14)\nvar (rM )\nOur derivation uses the quadratic utility function. In general, the proof goes through\nfor any utility function with a preference for mean, and aversion to variance.\n\nRisk and Reward in the CAPM\nFor a risky asset ri, the right measure of the rewardable risk is not its variance var (ri),\nbut its covariance cov (ri, rM ) with the market.\nThe exposure to the market risk can be best quantified by:\ncov (rM , ri)\nβi =\n(15)\nvar (rM )\nFor one unit exposure to the market risk, the reward is the same as the market:\nE(rM ) - rf\n(16)\nFor β unit of exposure to the market, the reward is:\nβi · (E (rM ) - rf )\n(17)\nFor zero exposure to the market risk, the reward is zero, no matter how risky the asset\nis. In summary, the risk and reward relation in the CAPM is a linear relation.\nSystematic vs. Idiosyncratic\nEach investment carries two distinct risks:\n- Systematic risk is market-wide and pervasively influences virtually all security\nprices.\nExamples are interest rates and the business cycle.\n- Idiosyncratic risk involves unexpected events peculiar to a single security or a\nlimited number of securities.\nExamples are the loss of a key contract or a change in government policy toward\na specific industry.\n\nThe Security Market Line\nExpected\nBeta (β)\nSecurity Market Line\nM\nβ = 1\n(μM)\nExpected\nRisk\nPremium\ndefensive\naggressive\nAlpha (α)\nβ\nReturn\n(\ni\nμi)\n(rf)\nRisk free Investment\nInvestment in Market\nFigure 2: Equilibrium market portfolio and efficient frontier.\n\nSystematic vs. Idiosyncratic\nEach investment carries two distinct risks:\n- Systematic risk is market-wide and pervasively influences virtually all security\nprices.\nExamples are interest rates and the business cycle.\n- Idiosyncratic risk involves unexpected events peculiar to a single security or a\nlimited number of securities.\nExamples are the loss of a key contract or a change in government policy toward\na specific industry.\n\nA Linear Factor Model\nA simple model to capture these two types of risks is the linear factor model:\nri = E (ri) + βi · F + εi\n(18)\nwhich carries two risky components:\n- systematic F : common to all securities.\n- idiosyncratic εi: specific only to security i.\nBoth the common factor F and the idiosyncratic component are zero mean random\nvariables.\n\nThe Arbitrage Pricing Theory\nA SINGLE-FACTOR VERSION\nAssume a frictionless market with no taxes or transaction costs. Assets are perfectly\ndivisible. There is no short-sale constraint.\nAssume a one-factor linear model:\n- βi asset i's sensitivity to the common factor.\n- F common factor, with E(F ) = 0.\n- εi firm-specific return, with zero mean, and independent of the common factor or\nother firms' idiosyncratic component.\nPossible common factor: unexpected changes in inflation, industrial production, etc.\nThe Arbitrage Pricing Theory:\nE (ri - rf )\nE (rj - rf )\n=\n(19)\nβi\nβj\nThe expected return of any asset is determined by its exposure to the common factor,\nand has nothing to do with its idiosyncratic component.\nIn deriving APT, one need not make any assumption about investors' preferences,\nor assume any specific distribution for the asset returns.\nThe APT is not an equilibrium concept. It does not rely on the existence of a market\nportfolio. It is based purely on no-arbitrage conditions.\n\nSummary\nIn equilibrium, the tangency portfolio becomes the market portfolio. The expected\nreturn of the market portfolio depends on the average risk aversion in the market.\nThe intuition of the CAPM: expected return of any risky asset depends linearly on\nits exposure to the market risk, measured by β.\nDiversification is an important concept in finance. It builds on a power mathemat\nical machine called Strong Law of Large Number.\nLike the CAPM, the basic concept of the APT is that differences in expected return\nmust be driven by differences in non-diversifiable risk.\nThe APT is based purely on no-arbitrage condition. It is not an equilibrium con\ncept, and does not depend on having a market portfolio.\nFocus:\nBKM Chapters 9-11\n- p. 263 bottom to 284, (CAPM, assumptions, beta, liquidity, covariance, expecta\ntions, SML, zero-beta model, alpha)\n- p. 287, eq. 10.5, eq.10.6 & eq.10.7\n- p. 300 to 308\n- p. 308 to 313 middle (eq. 10.15, eq. 10.16)\n- p. 324 to 334 middle (diversification, eq. 11.2, APT and CAPM, Multifactor\nAPT, eq. 11.5, eq. 11.6)\nReader: Roll and Ross (1995).\ntype of potential questions: chapter 9 concept check question 1, 2, 3 & 4, p. 286\nff. questions 1, 4, 17, 22, 23, 25 chapter 10 concept check question 1, 2, 3 & 4, p. 314\nff. questions 4, 5, 6, 7, 18, 19 chapter 11 concept check question 2, 3, 4 & 5, p. 335 ff.\nquestions 3, 5, 7, 10, 16\n\nQuestions for Next Class\nPlease read:\n- BKM Chapter 13,\n- Jagannathan and McGrattan (1995),\n- Kritzman (1993), and\n- Kritzman (1994)\nThink about the following questions:\n- What are the predictions of the CAPM?\n- Are they testable?\n- What is a regression?\n- What is t-test?\n\nTECHNICAL NOTES: The Mathematical\nFoundation of Diversification\nBehind the concept of diversification, there is deep, elegant, and powerful mathemati\ncal machinery.\nSTRONG LAW OF LARGE NUMBERS: Let x1, x2, . . . , be a sequence of identically\ndistributed and independent random variables with mean μ. We have:\nlim\nN →inf\n1 xi = μ\n(20)\nN\nalmost surely.\n\nA Simulation Based \"Proof\"\nSTEP 1: We start with X1, assume that it is standard normal, and simulate it 10,000\ntimes. Using the 10,000 scenarios, we plot its \"empirical\" probability distribution,\nwhich is basically the histogram of the 10,000 scenarios normalized so that the total\nprobability is one. For notational purpose, we write y1 = xi.\nLikelihood\nn = 10\n-4\n-2\nFig\nure 3: Likelihood and simulation outcome for y1 at n=1.\nSTEP 2: We repeat STEP 1 ten times, each time with a new seed in our random\nnumber generator, so that xi, x2, ..., x10 are indeed independent. We add them up,\nscenario by scenario, and re scale the sum by 10. That is, we have 10,000 scenarios of\n=\ny10\n10 (x1 + x2 + · · · + x10)\n(21)\nWe then plot the \"empirical\" probability distribution of y10. Chart:\n\nLikelihood\nn = 10\n-4\n-2\nOutcome of Simulation\nFigure 4: Likelihood and simulation outcome for y1 at n=10.\nSTEP 3: Finally, we repeat STEP 1 one hundred times, obtaining 10,000 scenarios\nof:\n=\ny100\n100 (x1 + x2 + · · · + x100)\n(22)\n\nX\nX\nLikelihood\nn = 100\n-4\n-2\nOutcome of Simulation\nFigure 5: Likelihood and simulation outcome for y1 at n=100.\nAccording to Law of Large Number, as N grows infinitely large,\nyN = 1\nN\nN\ni-1\nxi\n(23)\napproaches zero with probability one.\nFor xi normally distributed, it is actually easy to see that yN = 1\nN\nPN\ni-1 xi will ap\nproach zero with probability one. Since:\nvar (yN ) = 1\nN 2\nN\ni-1\nvar (xi) = 1\n(24)\nN\n\nLikelihood\nn = 10\nn = 100\nn = 10\n-4\n-2\nOutcome of Simulation\nFigure 6: Likelihood and simulation outcome for y1 at n= 1 / 10 / 100."
    },
    {
      "category": "Resource",
      "title": "154337capm2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/0a57bf96038c4500fad61ab5afa41b00_154337capm2.pdf",
      "content": "15.433 INVESTMENTS Class 7:\nThe CAPM and APT Part 2:\nApplications and Tests\nSpring 2003\n\nPredictions and Applications\n- Predictions:\n- CAPM: In market equilibrium, investors are only rewarded for\nbearing the market risk.\n- APT: In the absence of arbitrage, investors are only rewarded\nfor bearing the factor risk.\n- Applications:\n- professional portfolio managers: evaluating security returns and\nfund performance.\n- regulatory commissions: cost of capital for regulated firms.\n- court rulings: evaluating claims of lost future income.\n- corporate manager: capital budgeting decisions.\n\nTestability of CAPM and APT\nThe wide acceptance of the CAPM and APT makes it all the more im\nportant to test their predictions empirically.\nRecall from Class 6, both theories build on assumptions that are un\nrealistic at times.\nHow does a product of abstract reasoning hold in reality?\nUnfortunately, the predictions of the CAMP and APT are hard to test\nempirically:\n- Neither the market portfolio in CAPM nor the risk factor in APT is\nobservable.\n- Expected returns are unobservable, and could be time varying.\n- Volatility is not directly observable, and is time varying.\n\nAn Ideal Test of the CAPM\nIn an ideal situation, we have the following inputs:\n1. Riskfree borrowing/ lending rate rf\n2. Expected returns on the market E(rM ) and on the risky asset E(ri).\n3. The exposure to market risk\ncov (rM , ri)\nβi =\n(1)\nvar (rM )\nThese inputs allow us to examine the relation between reward (E(rf ) -\nrf ) and risk βi\n1. More risk, more reward?\n2. Do they line up?\n3. What is the reward for a risk exposure of 1?\n4. Zero risk, zero reward?\n\nA Linear Relation between Risk and\nReward\nE(r)\nβM\nBeta (βι)\nFigure 1: Beta with and without risk-free interest rate.\nrf\nE(rM)-rf\nα\n\nc\nc\nd\nd\nSome Practical Compromises\nthe market portfolio rM is unobservable: use a proxy, e.g., the S&P 500\nindex.\nexpected returns E(rM ) and E(rf ) are unobservable: use sample av\nerage\nT\nT\n1 X\n1 X\nμM = N\nrM,t\nμi = N\nri,t\n(2)\nt\nunobservable risk exposure\nβi =\nuse sample estimates:\nβi =\nwhere\nt\ncov (rM , ri)\n(3)\nvar (ri)\ncov (rM , ri)\n(4)\nvar (ri)\nT\n1 X\nvar (ri) = N\n(rt,M - μM )\n(5)\nt\nT\n1 X\ncov (rM , ri) = N\n(rt,M - μM ) (rt,i - μi)\n(6)\nt\n\nTesting the Linear Relation\npick a proxy for the market portfolio rM , and record N monthly returns:\nrt,M : i = 1, . . . , N\n(7)\nfor the same sample period, collect a sample of I firms, each with N\nmonthly returns:\nrt,1 : i = 1, . . . , I\nand t = 1, . . . , N\n(8)\nconstruct the sample mean for rM .\nfor the i-th firm, construct the sample mean μi , and the sample es\ntimate βi.\nfor i = 1,. . . ,I test the linear relation:\nμi - rf = γ0 + γ1βi\n(9)\n\nImplications of the CAPM\nγ0 = 0: zero exposure → zero reward.\nγ1 = μM - rf : one unit of exposure same reward as the market.\nSML\n-0.3\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nAA\nFDC\nNT\nVRTS\nQCOM\nAOL\nAMGN\nHD\nCAH\nMO\nWMI\nUN\nBAC\nPFE\nHistorical Return\nForecasted Return\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n2.4\n2.6\nBeta\nFigure 2: Betas for top 100 market weighted stocks from SP 500 against SP 500.\n\nRegression: The Basic Setup\nTwo variables x and y, N pairs of outcomes:\n(xi, yj ), i = 1, 2, . . . , N.\n(10)\nWe have reasons to believe that y and x are related. In particular, we\nwould like to use x to explain y:\nyi = a + bxj + ε.\n(11)\ny: the dependent variable.\nx: the independent (explanatory) variable.\nεi: a random disturbance with zero mean.\ncoefficients: intercept a, slope b.\n\nRegression: Motivation\nSome motivating examples:\n1. On day i, xi is the temperature at Orlando, yi is the price of the\nfutures contract on frozen concentrated orange juice.\n2. For firm i, xi is its leverage ratio, yi is its probability of default.\n3. On day i, xi is the Fed fund target rate, yi is the 3 month T bill rate.\n4. At the i-th second, xi is the number of packets sent by rgallati@mit.edu\nto jcox@mit.edu, yi is the number of packets received by the latter.\nIn each case, the outcome of x might contribute to the outcome of y:\nyi = a + b · xi + εi\n(12)\nbut there might be other random factors, captured by εi, that have noth\ning to do with x. The slope coefficient b is of particular interest as it\nmeasures the sensitivity of y to x.\n\nX\nThe Regression Coefficients\nThe objective: find a and b that best capture the linear relation between\ny and x. How: find a and b that minimize the squared differences:\nmin\na∈R,b∈R\nN\ni=1\n(yi - a - b · xi)2\n(13)\nE(μi)-rf\no\no\no\no\nb\no\no\no\n/ β i\nX / βi\nBeta (β)\nFigure 3: Regression.\n\nb\nb\nb\nb\nb\nb\nb\nb\nb\nX\nX\nRegression: The Solution\nSolving for the optimization problem, we get:\n- an estimate bb for the slope coefficient b:\nb =\nPN\ni=1 (yi - μy) (xi - μx)\nPN\ni=1 (xi - μx)\n(14)\n- an estimate a for the intercept a: a = μy - bbμx\nNotice the familiar notation for sample means:\nμx = 1\nN\nT\nt\nxi\nμy = 1\nN\nT\nt\nyi\n(15)\nWhy do we call our solutions estimates? Why put hats on b and a?\nDo we always get bb that is close to the real b, a hat is close to the\nreal a?\nIn the large sample (large N), we are pretty confident that they do,\nwhy?\n\nb\nb\nb\nThe Standard Error\nIn Order to guess the real values of b and a, we use the data to help us.\nGiven N pairs of observations (yi, xi), our regression solutions bb and\na are the best guesses. But we can never be 100% sure.\nHow to quantify our uncertainty about bb and a.\nWe think of b\nb, we can\nb and a as random variables. For any estimate, say b\nget an estimate of its standard deviation, which is usually referred to as\nthe Standard Error. The standard error of an estimate is one measure\nof its precision.\n\nb\nb\nb\nb\nb\nInterpreting the Regression Result\nFor the purpose of this class, you will use a \"canned\" regression package\n(e.g., Excel):\nInput: (yi, xi), i = 1, . . . , N Output:\n- the estimates bb and a and\n- their standard errors: sbb and sa\nb\nb/sb\n- their t statistics: tb = b\nb and ta = a/sa\n- the R squared\nThe standard errors and the t stat's provide measures of precision of\nyour estimates.\nThe R squared tells you how much of the randomness in the depen\ndent variable y is explained by the explanatory variable x.\n\nb\nb\nb\nc\nc\nb\nd\nX\nX\nd\nMore on the Slope Estimate\nRecall that our estimate for the slope coefficient b:\nPN\ni=1 (yi - μy) (xi - μx)\nPN\ni=1 (xi - μx)\nb =\n(16)\nSome familiar notation:\nvar (ri) =\nT\nt\nN\n(rt,M - μM )\n(17)\nT\nt\nN\ncov (rM , ri) =\n(rt,M - μM ) (rt,i - μi)\n(18)\nWe have\ncov (rM , ri)\n(19)\nvar (ri)\nβi =\nIntuitively, b is a measure of the covariance cov(x,y) between x and\ny, scaled by the variance var(x) of x.\n\nb\nBack to testing the CAPM\nThe implication of the CAPM:\nμi - rf = γ0 + γ1βi\n(20)\nOur data (b β) on the 43 industrial portfolios tell us that this relation\nμ, b\ndoes not hold exactly.\nOne possibility: our measures of the expected returns are contaminated\nby noises that are unrelated to the β's.\nWhat we still like to know:\n- On average, is reward related to risk at all? γ1 = 0 or not ?\n- On average, does zero risk result in zero reward? γ0 = 0 or not?\n- On average, does one unit of risk exposure pay the market return?\nγ1 = μM - rf = 5.9% or not?\n(21)\n\nb\nb\nRegression in Action\nSet up a regression:\n- The dependent variable: yi = μi - rf\n- The independent variable: xi = βb i\n- Add noise εi that is unrelated to βi.\nFeed the data to the regression package:\nestimate standard error t-stat\nγ0\n6%\n1.8%\n3.5\nγ1\n0.17%\n1.7%\n0,1\nR squared = 2%\nRecall the implications of the CAPM:\n1. The intercept γ0 = 0\n2. The slope γ1 = μM - rf = rf\n\nSML\n-0.3\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nDOW\nAA\nIP\nQCOM\nVRTS\nSUNW\nAOL\nAMGN\nNT\nORCL\nEMC\nCMCSK\nHD\nSWY\nUN\nMO\nLMT\nWMI\nBAC\nONE\nWB\nBK\nHistorical Return\nForecasted Return\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n2.4\n2.6\nBeta\nFigure 4: Betas (without rf ) for top 100 market weighted stocks from S&P 500 against S&P 500.\n\n-30%\n-20%\n-10%\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n0.00\n0.50\n1.00\n1.50\n2.00\n2.50\n3.00\nBeta\nHistorical Return\nForecasted Return\nFigure 5: Betas (with and without rf) for top 100 market weighted stocks from S&P 500 against S&P 500.\n\nb\nb\nA Rule of Thumb with t-Stat\nTo get a sense of how an estimate, say bb, differs significantly from zero,\nits t-stat btb is the most telling statistics.\nA Rule of Thumb: think of btb as standard normal (not a bad assumption\nfor a large sample). The larger the magnitude (absolute value) of b, the\nmore likely it is significantly different from zero.\nHypothesis Testing: The null: b\nb 6= 0.\nb = 0, the alternative: b\n1. A t-stat of 1.960 rejects the null with significance level 5%;\n2. A t-stat of 2.576 rejects the null with significance level 1%;\nFor example,btγ1 = 0.1, what can we say about γ1? What about γ1?\n\nb\nb\nb\nb\nA Summary of the CAPM Tests\nIn general, the test results depend on the sample data, sample peri\nods, statistical approaches, proxy for the market portfolio, etc. But the\nfollowing findings remain robust:\n- The relation between risk and reward is much flatter than that pre\ndicted by the CAPM γ1 = μi - rf .\n- The risk measure β cannot even begin to explain the cross sectional\nvariation in the expected returns. (γ1 is statistically insignificant, R\nsquared is close to zero.)\n- Contrary to the prediction of the CAPM, the intercept γ0 is signifi\ncantly different from zero.\n\nb\nb\nb\nb\nb\nb\nSome Possible Explanations\n1. Is the stock market index a good proxy for the market portfolio?\n- only 1/3 non governmental tangible assets are owned by the corpo\nrate sector.\n- among the corporate assets, only 1/3 is financed by equity\n- what about intangible assets, like human capital?\n- what about international markets?\n2. Measurement error in β:\n- Except for the market portfolio, we never observe the true β.\n- To test the CAPM, we use estimates for β, which are measured with\nerrors.\n- The measurement error in β will cause a downward biased estimate\nfor the slope coefficient, and an upward biased estimate for the in\ntercept.\n3. Measurement error in expected returns\n- we use sample means μM and μi as proxies for the real, unob-servable\nexpected returns\n- it is known that means are hard to estimate, and there are noises in\nour estimates μM and μi and\n- if the noises in μM and μi are correlated, then we have a statistical\nproblem (errors in variables)\n4. Borrowing restrictions\n\n- This class covers only one version of the CAPM, assuming unre\nstricted borrowing.\n- In practice, borrowing restrictions are realistic. It includes margin\nrules, bankruptcy laws that limit lender access to a borrower's future\nincome, etc.\n- Fisher Black showed that borrowing restrictions might cause low-β\nstocks to have higher expected returns than the CAPM predicts.\n\nGoing Beyond the CAPM\nIs β a good measure of risk exposure? What about the risk associated\nwith negative skewness?\nCould there be other risk factors?\nTime varying volatility, time varying expected returns,\ntime varying risk aversion, and time varying β?\nFocus:\nBKM Chapter 13\n- p. 383 (13.1)\n- p. 386 to 392 (beta, CAPM, SML, market index, concept check\nquestion 3 & 4),\n- p. 391 to 393 top (13.2)\n- p. 399 bottom (13.4 to 13.6)\nReader: Kritzman (1993) and Kritzman (1994).\ntype of potential questions: concept check question 1, 2, 3 & 4\n\nPreparation for Next Class\nPlease read:\n- Fama and French (1992) and\n- Jegadeesh and Titman (1993)."
    },
    {
      "category": "Resource",
      "title": "154337capm2A.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-433-investments-spring-2003/a89925f93f77bcd2dce3ab34846e4b09_154337capm2A.pdf",
      "content": "15.433 INVESTMENTS\nClass 7: The CAPM and APT\nPart 2: Applications and Tests\nSpring 2003\n\nPredictions and Applications\n- Predictions:\n- CAPM: In market equilibrium, investors are only rewarded for\nbearing the market risk.\n- APT: In the absence of arbitrage, investors are only rewarded\nfor bearing the factor risk.\n- Applications:\n- professional portfolio managers: evaluating security returns and\nfund performance.\n- regulatory commissions: cost of capital for regulated firms.\n- court rulings: evaluating claims of lost future income.\n- corporate manager: capital budgeting decisions.\n\nTestability of CAPM and APT\nThe wide acceptance of the CAPM and APT makes it all the more im\nportant to test their predictions empirically.\nRecall from Class 6, both theories build on assumptions that are un\nrealistic at times.\nHow does a product of abstract reasoning hold in reality?\nUnfortunately, the predictions of the CAMP and APT are hard to test\nempirically:\n- Neither the market portfolio in CAPM nor the risk factor in APT is\nobservable.\n- Expected returns are unobservable, and could be time varying.\n- Volatility is not directly observable, and is time varying.\n\nAn Ideal Test of the CAPM\nIn an ideal situation, we have the following inputs:\n1. Riskfree borrowing/ lending rate rf\n2. Expected returns on the market E(rM ) and on the risky asset E(ri).\n3. The exposure to market risk\ncov (rM , ri)\nβi =\n(1)\nvar (rM )\nThese inputs allow us to examine the relation between reward (E(rf ) -\nrf ) and risk βi\n1. More risk, more reward?\n2. Do they line up?\n3. What is the reward for a risk exposure of 1?\n4. Zero risk, zero reward?\n\nA Linear Relation between Risk and\nReward\nE(r)\nβM\nBeta (βι)\nFigure 1: Beta with and without risk-free interest rate.\nrf\nE(rM)-rf\nα\n\nc\nc\nd\nd\nSome Practical Compromises\nthe market portfolio rM is unobservable: use a proxy, e.g., the S&P 500\nindex.\nexpected returns E(rM ) and E(rf ) are unobservable: use sample av\nerage\nT\nT\n1 X\n1 X\nμM = N\nrM,t\nμi = N\nri,t\n(2)\nt\nunobservable risk exposure\nβi =\nuse sample estimates:\nβi =\nwhere\nt\ncov (rM , ri)\n(3)\nvar (ri)\ncov (rM , ri)\n(4)\nvar (ri)\nT\n1 X\nvar (ri) = N\n(rt,M - μM )\n(5)\nt\nT\n1 X\ncov (rM , ri) = N\n(rt,M - μM ) (rt,i - μi)\n(6)\nt\n\nTesting the Linear Relation\npick a proxy for the market portfolio rM , and record N monthly returns:\nrt,M : i = 1, . . . , N\n(7)\nfor the same sample period, collect a sample of I firms, each with N\nmonthly returns:\nrt,1 : i = 1, . . . , I\nand t = 1, . . . , N\n(8)\nconstruct the sample mean for rM .\nfor the i-th firm, construct the sample mean μi , and the sample es\ntimate βi.\nfor i = 1,. . . ,I test the linear relation:\nμi - rf = γ0 + γ1βi\n(9)\n\nImplications of the CAPM\nγ0 = 0: zero exposure → zero reward.\nγ1 = μM - rf : one unit of exposure same reward as the market.\nSML\n-0.3\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nAA\nFDC\nNT\nVRTS\nQCOM\nAOL\nAMGN\nHD\nCAH\nMO\nWMI\nUN\nBAC\nPFE\nHistorical Return\nForecasted Return\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n2.4\n2.6\nBeta\nFigure 2: Betas for top 100 market weighted stocks from SP 500 against SP 500.\n\nRegression: The Basic Setup\nTwo variables x and y, N pairs of outcomes:\n(xi, yj ), i = 1, 2, . . . , N.\n(10)\nWe have reasons to believe that y and x are related. In particular, we\nwould like to use x to explain y:\nyi = a + bxj + ε.\n(11)\ny: the dependent variable.\nx: the independent (explanatory) variable.\nεi: a random disturbance with zero mean.\ncoefficients: intercept a, slope b.\n\nRegression: Motivation\nSome motivating examples:\n1. On day i, xi is the temperature at Orlando, yi is the price of the\nfutures contract on frozen concentrated orange juice.\n2. For firm i, xi is its leverage ratio, yi is its probability of default.\n3. On day i, xi is the Fed fund target rate, yi is the 3 month T bill rate.\n4. At the i-th second, xi is the number of packets sent by rgallati@mit.edu\nto jcox@mit.edu, yi is the number of packets received by the latter.\nIn each case, the outcome of x might contribute to the outcome of y:\nyi = a + b · xi + εi\n(12)\nbut there might be other random factors, captured by εi, that have noth\ning to do with x. The slope coefficient b is of particular interest as it\nmeasures the sensitivity of y to x.\n\nX\nThe Regression Coefficients\nThe objective: find a and b that best capture the linear relation between\ny and x. How: find a and b that minimize the squared differences:\nmin\na∈R,b∈R\nN\ni=1\n(yi - a - b · xi)2\n(13)\nE(μi)-rf\no\no\no\no\nb\no\no\no\n/ β i\nX / βi\nBeta (β)\nFigure 3: Regression.\n\nb\nb\nb\nb\nb\nb\nb\nb\nb\nX\nX\nRegression: The Solution\nSolving for the optimization problem, we get:\n- an estimate bb for the slope coefficient b:\nb =\nPN\ni=1 (yi - μy) (xi - μx)\nPN\ni=1 (xi - μx)\n(14)\n- an estimate a for the intercept a: a = μy - bbμx\nNotice the familiar notation for sample means:\nμx = 1\nN\nT\nt\nxi\nμy = 1\nN\nT\nt\nyi\n(15)\nWhy do we call our solutions estimates? Why put hats on b and a?\nDo we always get bb that is close to the real b, a hat is close to the\nreal a?\nIn the large sample (large N), we are pretty confident that they do,\nwhy?\n\nb\nb\nb\nThe Standard Error\nIn Order to guess the real values of b and a, we use the data to help us.\nGiven N pairs of observations (yi, xi), our regression solutions bb and\na are the best guesses. But we can never be 100% sure.\nHow to quantify our uncertainty about bb and a.\nWe think of b\nb, we can\nb and a as random variables. For any estimate, say b\nget an estimate of its standard deviation, which is usually referred to as\nthe Standard Error. The standard error of an estimate is one measure\nof its precision.\n\nb\nb\nb\nb\nb\nInterpreting the Regression Result\nFor the purpose of this class, you will use a \"canned\" regression package\n(e.g., Excel):\nInput: (yi, xi), i = 1, . . . , N Output:\n- the estimates bb and a and\n- their standard errors: sbb and sa\nb\nb/sb\n- their t statistics: tb = b\nb and ta = a/sa\n- the R squared\nThe standard errors and the t stat's provide measures of precision of\nyour estimates.\nThe R squared tells you how much of the randomness in the depen\ndent variable y is explained by the explanatory variable x.\n\nb\nb\nb\nc\nc\nb\nd\nX\nX\nd\nMore on the Slope Estimate\nRecall that our estimate for the slope coefficient b:\nPN\ni=1 (yi - μy) (xi - μx)\nPN\ni=1 (xi - μx)\nb =\n(16)\nSome familiar notation:\nvar (ri) =\nT\nt\nN\n(rt,M - μM )\n(17)\nT\nt\nN\ncov (rM , ri) =\n(rt,M - μM ) (rt,i - μi)\n(18)\nWe have\ncov (rM , ri)\n(19)\nvar (ri)\nβi =\nIntuitively, b is a measure of the covariance cov(x,y) between x and\ny, scaled by the variance var(x) of x.\n\nb\nBack to testing the CAPM\nThe implication of the CAPM:\nμi - rf = γ0 + γ1βi\n(20)\nOur data (b β) on the 43 industrial portfolios tell us that this relation\nμ, b\ndoes not hold exactly.\nOne possibility: our measures of the expected returns are contaminated\nby noises that are unrelated to the β's.\nWhat we still like to know:\n- On average, is reward related to risk at all? γ1 = 0 or not ?\n- On average, does zero risk result in zero reward? γ0 = 0 or not?\n- On average, does one unit of risk exposure pay the market return?\nγ1 = μM - rf = 5.9% or not?\n(21)\n\nb\nb\nRegression in Action\nSet up a regression:\n- The dependent variable: yi = μi - rf\n- The independent variable: xi = βb i\n- Add noise εi that is unrelated to βi.\nFeed the data to the regression package:\nestimate standard error t-stat\nγ0\n6%\n1.8%\n3.5\nγ1\n0.17%\n1.7%\n0,1\nR squared = 2%\nRecall the implications of the CAPM:\n1. The intercept γ0 = 0\n2. The slope γ1 = μM - rf = rf\n\nSML\n-0.3\n-0.1\n0.0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nDOW\nAA\nIP\nQCOM\nVRTS\nSUNW\nAOL\nAMGN\nNT\nORCL\nEMC\nCMCSK\nHD\nSWY\nUN\nMO\nLMT\nWMI\nBAC\nONE\nWB\nBK\nHistorical Return\nForecasted Return\n0.0\n0.2\n0.4\n0.6\n0.8\n1.0\n1.2\n1.4\n1.6\n1.8\n2.0\n2.2\n2.4\n2.6\nBeta\nFigure 4: Betas (without rf ) for top 100 market weighted stocks from S&P 500 against S&P 500.\n\n-30%\n-20%\n-10%\n0%\n10%\n20%\n30%\n40%\n50%\n60%\n70%\n0.00\n0.50\n1.00\n1.50\n2.00\n2.50\n3.00\nBeta\nHistorical Return\nForecasted Return\nFigure 5: Betas (with and without rf) for top 100 market weighted stocks from S&P 500 against S&P 500.\n\nb\nb\nA Rule of Thumb with t-Stat\nTo get a sense of how an estimate, say bb, differs significantly from zero,\nits t-stat btb is the most telling statistics.\nA Rule of Thumb: think of btb as standard normal (not a bad assumption\nfor a large sample). The larger the magnitude (absolute value) of b, the\nmore likely it is significantly different from zero.\nHypothesis Testing: The null: b\nb 6= 0.\nb = 0, the alternative: b\n1. A t-stat of 1.960 rejects the null with significance level 5%;\n2. A t-stat of 2.576 rejects the null with significance level 1%;\nFor example,btγ1 = 0.1, what can we say about γ1? What about γ1?\n\nb\nb\nb\nb\nA Summary of the CAPM Tests\nIn general, the test results depend on the sample data, sample peri\nods, statistical approaches, proxy for the market portfolio, etc. But the\nfollowing findings remain robust:\n- The relation between risk and reward is much flatter than that pre\ndicted by the CAPM γ1 = μi - rf .\n- The risk measure β cannot even begin to explain the cross sectional\nvariation in the expected returns. (γ1 is statistically insignificant, R\nsquared is close to zero.)\n- Contrary to the prediction of the CAPM, the intercept γ0 is signifi\ncantly different from zero.\n\nb\nb\nb\nb\nb\nb\nSome Possible Explanations\n1. Is the stock market index a good proxy for the market portfolio?\n- only 1/3 non governmental tangible assets are owned by the corpo\nrate sector.\n- among the corporate assets, only 1/3 is financed by equity\n- what about intangible assets, like human capital?\n- what about international markets?\n2. Measurement error in β:\n- Except for the market portfolio, we never observe the true β.\n- To test the CAPM, we use estimates for β, which are measured with\nerrors.\n- The measurement error in β will cause a downward biased estimate\nfor the slope coefficient, and an upward biased estimate for the in\ntercept.\n3. Measurement error in expected returns\n- we use sample means μM and μi as proxies for the real, unob-servable\nexpected returns\n- it is known that means are hard to estimate, and there are noises in\nour estimates μM and μi and\n- if the noises in μM and μi are correlated, then we have a statistical\nproblem (errors in variables)\n4. Borrowing restrictions\n\n- This class covers only one version of the CAPM, assuming unre\nstricted borrowing.\n- In practice, borrowing restrictions are realistic. It includes margin\nrules, bankruptcy laws that limit lender access to a borrower's future\nincome, etc.\n- Fisher Black showed that borrowing restrictions might cause low-β\nstocks to have higher expected returns than the CAPM predicts.\n\nGoing Beyond the CAPM\nIs β a good measure of risk exposure? What about the risk associated\nwith negative skewness?\nCould there be other risk factors?\nTime varying volatility, time varying expected returns,\ntime varying risk aversion, and time varying β?\nFocus:\nBKM Chapter 13\n- p. 383 (13.1)\n- p. 386 to 392 (beta, CAPM, SML, market index, concept check\nquestion 3 & 4),\n- p. 391 to 393 top (13.2)\n- p. 399 bottom (13.4 to 13.6)\nReader: Kritzman (1993) and Kritzman (1994).\ntype of potential questions: concept check question 1, 2, 3 & 4\n\nPreparation for Next Class\nPlease read:\n- Fama and French (1992) and\n- Jegadeesh and Titman (1993)."
    }
  ]
}