{
  "course_name": "Islam/Media",
  "course_description": "This course is an introduction to Islam from the perspective of media and sound studies, intended for advanced undergraduates and graduate students. From the time of the Prophet Muhammad, Islam in its various manifestations has had a complex relationship with media. While much contemporary writing focuses on Islam in the media, this course explores how many aspects of Islamic practice and thinking might be understood as media technologies that facilitate the inscription, storage and transmission of knowledge. Central questions include: How do Islam and media technologies relate? What kinds of practices of inscription and transmission characterize Islam in all its varieties across time and place? How might Islamic thought and practice be understood in light of databases, networks, and audiovisual sensation? Given the rich diversity in Islam historically and geographically, emphasis will be placed on these interconnected but divergent practices from the earliest revelations of the Qur’an to contemporary Islamist political movements, with geographies spanning from Indonesia to the Middle East and North Africa, as well as in Europe and North America. In addition to exploring these themes through reading and writing, students will be encouraged to complete course assignments and projects in media, using audiovisual documentary or composition as a means of responding to the course themes.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Music",
    "Music History",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Religion",
    "Society",
    "Middle Eastern Studies",
    "Fine Arts",
    "Media Studies",
    "Music",
    "Music History",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Religion",
    "Society",
    "Middle Eastern Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nIntroduction\n\nThis course is an introduction to Islam from the perspective of media and sound studies, intended for advanced undergraduates and graduate students. From the time of the Prophet Muhammad, Islam in its various manifestations has had a complex relationship with media. While much contemporary writing focuses on Islam\nin\nthe media, this course explores how many aspects of Islamic practice and thinking might be understood as media technologies that facilitate the inscription, storage and transmission of knowledge.\n\nCentral questions include: How do Islam and media technologies relate? What kinds of practices of inscription and transmission characterize Islam in all its varieties across time and place? How might Islamic thought and practice be understood in light of databases, networks, and audiovisual sensation? Examples range from the transmission of the Qur'an and\nhadith\nas sound inscription to the algorithmic designs of mosques, from Islamic law as a media practice to virtual\nhajj\npilgrimages and online communities. Particular attention will be paid to the cultural acoustics of Islamic practices (e.g.,\ntajwid\nrecitation,\nsama'\n,\ndhikr\n) and the ethics they entail. Finally, given the rich diversity in Islam historically and geographically, emphasis will be placed on these interconnected but divergent practices from the earliest revelations of the Qur'an to contemporary Islamist political movements, with geographies spanning from Indonesia to the Middle East and North Africa, as well as in Europe and North America.\n\nIn addition to exploring these themes of Islam and media through reading and writing, students will be encouraged to complete course assignments / projects\nin\nmedia, using audiovisual documentary or composition as a means of responding to the course themes.\n\nPrerequisites\n\nNo previous knowledge of Islam or media studies is necessary. The course is intended for advanced undergraduates and graduate students.\n\nProject Assignments and Quizzes\n\nStudents will hand in four main project assignments over the course of the semester. These are described in detail on the\nProjects\npage.\n\nProject 1: Response to the Qur'an and\nhadith\n\nProject 2: Response to a piece of Islamic art\n\nFinal project proposal\n\nFinal project\n\nWhether composing an audiovisual piece or writing, responses and the final project should engage with the primary and secondary literature we read (and see) in the class.\n\nAll students are expected to meet with the professor in Week 10 to discuss ideas for the final project. Ideally this project will build on some of the themes or media approaches students have developed in the two response projects. Both writing and media projects will be graded on clarity and rigor of ideas, critical response to themes of the course, and polish in editing (regardless of medium!).\n\nThere will also be two short quizzes (10 min.) on foundational terms and key ideas in Islam and in media / sound studies. These are more for diagnostics to assess how well key ideas have been understood than for determining grades, but they will be graded.\n\nFinally, I will ask you to submit responses to at least one of the films viewed in class, and to the self-guided visit to the Museum of Fine Arts. These will not be graded, however.\n\nClass Schedule, Reading and Media\n\nThis class emphasizes both theory and practice. Readings and discussion will be focused primarily on Mondays, with Wednesday sessions geared toward other activities: Guest presenters, film screenings, media workshops and group critiques of student projects. Monday sessions will be seminar-style discussions, while Wednesdays will vary depending on the format. Students are expected to be prepared to engage with both kinds of work (reading / discussing, critically viewing / making), but again, no previous knowledge or experience is required.\n\nWEEK #\n\nTOPICS AND EVENTS\n\nKEY DATES\n\nIntroduction: A Media Archaeology of Islam\n\nPart I: First Media\n\nThe Qur'an: Message and Medium, I\n\nGuest\n: Laura Marks\n\nThe Qur'an: Message and Medium, II\n\nMessage and Messenger\n\nWorkshop on Audio / Video Production\n\nMemory Transmission: Sunnah and Hadith\n\nDue: Project 1\n\nPart II: Sensory Islam as Audiovision\n\nVisual Islam: Writing\n\nQuiz 1, on Foundational Ideas and Terms of Islam\n\nVisual Islam: Art and Architecture\n\nGuest\n: Azra Aksamija\n\nVisit to Islamic Society of Boston Cultural Center\n\nVisual Islam: Museums, Archives\n\nNo Class Meetings; Self-guided Visit to Museum of Fine Arts\n\nAural Islam: Poetry and Soundscapes\n\nDue: MFA Response Questions\n\nDue: Project 2, Response to Islamic Art\n\nPart III: Networked Islams\n\nPilgrimage, Travel, and Gender\n\nOne-on-one Meeting to Discuss Final Project\n\nJihadist Circulations\n\nGuest\n: Rich Nielsen\n\nDue: Abstract of Final Project\n\nMuslim Media I: Protest\n\nQuiz 2 on Key Terms in Sound / Media Studies\n\nMuslim Media II: Islam in the Media\n\nConclusion: Islam as Discourse Network?\n\nFinal Projects Open House & Exhibition\n\nFinal Project Due\n\nGrading\n\nCOURSE WORKS\n\nPERCENTAGES\n\nAttendance, Participation and Preparation\n\n10%\n\nTwo Response Paper / Media Projects\n\n25% (combined)\n\nTwo Short Quizzes\n\n5%\n\nFinal Project Proposal\n\n10%\n\nFinal Project\n\n50%\n\nCollaboration and Academic Integrity\n\nYou are encouraged to discuss course materials with classmates. Collaboration is not allowed on written / media work without prior consent from the professor. For some students working on a final project that includes substantial media production, collaboration may be essential (e.g., filming with off-camera sound recording). If you wish to collaborate on a final media project, please come to office hours as early in the semester as possible to discuss your ideas.\n\nTextbooks\n\nRequired Texts\n\n[Qur'an] = Haleem, M. A. S.\nThe Qur'an\n. Translated by M. A. S. Abdel Haleem. Oxford University Press, 2010. ISBN: 9780199570713.\n\n[\nNote\n: The 2005 edition can be viewed and download from\nInternet Archive\n. Other translations are also acceptable, such as\nquran.com\n; but if you use one of these, you must indicate the number of individual verses in sura.]\n\n[Hirschkind] = Hirschkind, Charles.\nThe Ethical Soundscape: Cassette Sermons and Islamic Counterpublics\n. Columbia University Press, 2006. [Preview with\nGoogle Books\n]\n\n[Marks] =\nMarks, Laura.\nEnfoldment and Infinity: An Islamic Genealogy of New Media Art\n. MIT Press, 2010. ISBN: 9780262014212.\n\n[Messick] = Messick, Brinkley.\nThe Calligraphic State: Textual Domination and History in a Muslim Society\n. University of California Press, 1996. ISBN: 9780520205154.\n\nRecommended Texts\n\nSaid, Edward.\nCovering Islam: How the Media and the Experts Determine How We See the Rest of the World\n. 2nd ed. Vintage Books, 1996. ISBN: 9780099595014. [Preview with\nGoogle Books\n]\n\nRumi.\nThe Masnavi, Book One\n. Translated by Jawid Mojaddedi. Oxford University Press, 2008. ISBN: 9780199552313.\n\n(A different translation by E. H. Whinfield (1898) is\navailable online\n, and is a usable alternative.)\n\nEither one of the following hadith collections:\n\nArabi, Ibn.\nDivine Sayings: 101 Hadith Qudsi - The Mishkat Al-Anwar of Ibn 'Arabi\n. Translated by Stephen Hirtenstein and Martin Nocutt. Anqa Publishing, 2008. ISBN: 9781905937035. [Preview with\nGoogle Books\n]\n\nAn-Nawawi.\nThe Complete Forty Hadith\n. 3rd ed. Translated by Abdassamad Clarke. Ta-Ha Publishers Limited, 2009. ISBN: 9781842001158.",
  "files": [
    {
      "category": "Assignment",
      "title": "Final Project Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/165679a596c4be4039b804b8a9c1ba4a_MIT21M_289S15_proj_final.pdf",
      "content": "Islam/Media, 21M.289\nFinal Project\nDUE Thursday May 14, 2015, 11:59 pm\n\nFinal Projects\n\nComponents and timeline:\n- Meet/discuss with Peter (week of Apr. 13)\n- Submit proposal by email (DUE Apr. 29 before class)\n- Present work-in-progress (7-8 min per person, in class, Mon. May 4)\n- Final presentations (15-min per person, in class, Wed. May 13)\n- Submit final project by email to Peter (Thur. May 14, 11:59 pm)\n\nNote on grading: As noted in the original syllabus, the project proposal is worth 10% of your\noverall grade. The final project overall is worth 50% of the grade, and will reflect both the final\nsubmission and the in-class presentations (May 4, May 13).\n\nOverview:\n\nOver the course of the semester, we have encountered a variety of themes, media\nforms, networks, texts, media objects (museum objects, films, etc.), and so on. For the final\nproject, you will explore some aspect of the course that interests you in greater depth. The topic\nshould be chosen in consultation with the professor (during office hours or other meeting time\nthe week of April 13). As with previous projects, in order to encourage creative media work,\nmedia-based projects will be given an automatic bonus of 10% on the overall project grade.\nHowever, written work is welcome. The scope of the project should be substantial: if writing, the\npaper should be around 20-25 pp. If you opt for some other media form, be sure to consult with\nthe professor on the exact scope, but the project should be complete (i.e., fully functional for\nsoftware, a \"final cut\" or equivalent for composed media), edited/revised (i.e., copy-edited,\ndebugged, sound-mixed), and comprehensible as a stand-alone piece of media (though you\nmay choose to include supplemental documentation to make it fully stand-alone). Although we\nwill be doing class presentations on this material, it must be something a reader/viewer/user can\naccess independently of your presence as author.\n\nTopics may build on earlier class projects (Response 1, on the Qur'an and hadith\ntraditions, or Response 2, on Islamic art). They may also take up themes from the latter part of\nthe course on networks, pilgrimage, jihad, revolution (Iran, the Arab Spring), Islam in \"the\nmedia,\" and so on. They may include critical responses to or remixes of media we watched/\nlistened to in class.\n\nAs always, the critical question is how ideas of Islam and media--with both concepts\nbeing understood broadly--might illuminate one another. Your project should demonstrate a\ngrasp of the major topics and discussions of the course, familiarity with readings/screenings,\nand your own critical/creative energies in responding to, analyzing, and asking further questions\non these topics. If you have questions about the project, please ask them early on in the\nprocess. We will devote considerable time in class to look at work-in-progress to avoid any\nconfusion about projects, requirements, deadlines, etc.\n\nProposal: DUE by email Apr. 29, 12:30 pm\nMedia project: 1-2 pp. written proposal, including some preliminary media (e.g., 3-5 still images,\n1-2 short sound or video recordings, a flowchart or sample of code).\n\nWriting: 3-4 pp. written proposal, highlighting the themes and central questions you plan to\nexplore, noting what class readings are relevant for your topic, and suggest 2-3 more sources\nyou will be consulting for your final piece.\n\nPresentation 1 (Work-in-Progress), Mon. May 4\n\nPrepare a 7-8 minute presentation of your project to show/audition in class. The presentation\nshould be an expansion of what is submitted in the project proposal. If the project is a media\npiece, the presentation should include substantial examples of the media to be used. Plan\nahead to be able to share your work (either by projecting material or otherwise). We will discuss\nprojects as a group to brainstorm next steps with the project.\n\nPresentation 2 (Final presentations), Wed. May 13\n\nPrepare a 15-minute presentation to show/audition in class. At this point, your project should be\nessentially completed. Again, please include ample media to show what your project does and/\nor what kinds of questions it engages with.\n\nFinal project DUE, Thur. May 14, 11:59 pm\n\nSubmit your project with all accompanying materials electronically to me. If you foresee this\ndeadline being a problem, please contact me well in advance. If your materials include\nhardware or other objects that need to be handed in in person, please let me know by Monday,\nMay 11 at the latest.\n\nGrading:\n\nYou will be graded on clarity and rigor of ideas, critical response to themes of the course,\nand again, polish in editing (regardless of medium!). The project proposal is worth 10% of your\ngrade, the project itself 50%, including in-class presentations. Late projects will be penalized 5%\nper day up until May 20th, after which point they will not be accepted. Media projects will be\ngiven a 10% bonus on the overall grade.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MFA Visit Response Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/7a4548cbcc8a6f8c98969b71c86011f6_MIT21M_289S15_assn_MFA.pdf",
      "content": "Islam/Media, 21M.289\nSelf-Guided MFA Visit\n*** Email answers by noon on Monday April 6 ***\nIn lieu of class on March 30 and April 1, please visit the Islamic Art gallery at the\nBoston Museum of Fine Art (465 Huntington Ave., free admission with MIT ID). The\nmain exhibition space for Islamic Art is Level 1, Gallery 175. (You can see this on a free\ngallery map, available at the front desk.) Visit the gallery with enough time to really look\nat objects and generate some questions about them--give yourself at least an hour. If\nyou're not used to going to museums, try spending at least two minutes at each object.\nPhotography with a handheld device (with no flash) is allowed and may be useful if\nyou'd think you might want to write about one of these objects for your Response #2.\nHere are a few guiding questions, please email me brief answers by noon, April 6, 2015.\n1. What kinds of different relationships can be seen in this collection between writing and\nimage? And between image and object? Give an example of an object that you find\nengages with these tensions in interesting ways.\n2. How Islamic are these objects? Pick two objects with differing qualities/degrees of\n\"Islamic-ness\" and briefly compare/contrast them.\n3. Along the wall opposite the cases of objects are a series of illuminated manuscripts and\nobjects from medieval scientists like al-Jazari. What kinds of relationships between\ntechnology and arts is visible? Pick two objects that make use of/explore technology in\ndifferent ways and briefly compare/contrast them.\n4. Walk through at least one other gallery in the museum. What do you observe about the\ncuration of the Islamic Art gallery in contrast to others at the museum?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Project 1 Assignment: Response to the Qur'an and Sunnah Traditions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/b3ccd4adb52c9b5e5b462d013d30721e_MIT21M_289S15_proj1.pdf",
      "content": "Islam/Media, 21M.289\nProject 1\nDUE Friday March 6, 11:59 pm\nResponse to the Qur'an and Sunnah Traditions\nProject Overview\nOver the course of the first five weeks of \"Islam/Media,\" we will have read the entirety of the\nQur'an and explored the foundational texts of the sunnah, or accounts of the life and deeds of the\nProphet Muhammad (in hadith and sirah traditions). These two media objects (the Qur'an, the\nsunnah) will in turn serve as the foundation for shari'ah, the heart of Islamic law. For this\nproject, create a critical response to the Qur'an and/or sunnah materials we have covered in class\nusing any medium or technological means. The default assignment is a 5-7 pp., double-spaced\npaper. However, alternative forms of response using other media besides writing are strongly\nencouraged. Possible formats might include:\n-\na written paper\n-\na short video piece (fiction or non-fiction)\n-\nan audio piece (sound composition, podcast, experimental radio piece)\n-\na set of images (photographs, drawing, calligraphy)\n-\nmemorizing some part of the Qur'an and documenting (in writing, video, or sound) your\nexperience with that process\n-\na computer program (database, standalone program, simple website, app)\n-\ncomputer-based art/design (visualized/sonified data, etc.)\nIf you choose to create a media piece in a non-written format, you are encouraged to include\ncaptioning, other textual supplements to clarify your materials, and a brief piece of writing to\nclarify your aims with the project. If you program something, please include your code.\nThematically, your response should engage with questions of Islam and media critically--that is,\nposing questions of how and why (not just what), including a thesis/central argument, and\njustifying your opinions with supporting material. Some of our key themes thus far that may be\nof interest would include:\n-\nthe Qur'an's self-referentiality\n-\naudiovisual references in the Qur'an\n-\nQur'an/sunnah as writing and/or as sound\n-\nrevelation (as process, as book, etc.) in the Qur'an and sunnah\n-\nritual as process in Qur'an/sunnah\n-\nreckoning, calculating, enumerating in Qur'an/sunnah\n-\n\"message\" and \"messenger\"\n-\nstorage and transmission of the Qur'an/sunnah\nIf you have materials in-progress for class on Monday, March 2, we will work through a quick\ngroup-critique of them. All materials should be submitted electronically by 11:59 pm on Friday,\nMarch 6.\n\nGrading criteria\nThis project should draw on the readings (and where applicable, the film screenings) from\nthe course. If you have stayed on top of readings to this point, the project should take roughly 10\n15 hours. (This is a ballpark figure--it may take more, depending on your project!) Projects will\nbe graded according to the following criteria:\n-\nCritical engagement with themes of Islam and media\n20%\n-\nMastery of subject matter\n20%\n-\nCreativity/self-reflexivity in approach\n15%\n-\nClarity (whether thesis in writing, or aims in other media forms)\n15%\n-\nFactual accuracy, citation\n10%\n-\nRevisions/proofreading/debugging\n10%\n-\nPunctuality (i.e., handing in on-time)\n10%\nWorkshopping projects in class is not necessary but (like all forms of revision) tends to make\nmaterials stronger. If you have concerns about whether your intended project fits the scope of the\nproject requirements, please be in touch as soon as possible (email or office hours).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Project 1 sample: Review of Omar The Epic Series and Selective Comparison to The Message",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/1c0e9d3ce2fd2cffcc4b8cfbd8d74224_MIT21M_289S15_proj1_ex1.pdf",
      "content": "Anonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nThe objective of this paper is to undertake a review of Omar The Epic series from a\nmedia perspective as well as from a Quran/ Hadith learnings perspective. The paper\nwould also mirror certain themes that were derived from the class discussions on the\nmovie The Message. The scope of this review covers Episode 1 to Episode 7 out of the 30\nseries production. As a reference point, Episode 10 is when the Hijra took place and this is\ncomparable to the first half viewing of The Message in class.\nBy way of background, Omar the Series was co-produced by MBC1 and Qatar TV\nand directed by Hatem Ali1. It was released to the public in 2012 which is 36 years after the\nscreening of The Message in 1976. There are two clear distinctions underlying these two\nproduction:\n- Focus of character: The Message is focused on specifically the life of the Prophet\nS.A.W whereas Omar The Epic series is focused on Omar Al-Khattab R.A., the 2nd\nCaliph Al Rashidin.\n- Duration: The Message spans just a little under three hours whereas Omar The Epic\nSeries goes for 45 minutes per episode over 30 episodes.\nIt can be reasonably expected that Omar The Epic series would have included a more refined\nand rich storyline and content. Listed below are the relevant themes that I have found to be\nworthy of a mention.\n1. Contrasting the level of authority governing the two pictures - at the start of The\nMessage, the movie showed the following message right at the centre of the screen \"The\nscholars and historians of Islam - The University of Al-Azhar in Cairo and the High\nIslamic Congress of the Shiat in Lebanon have approved the accuracy and fidelity of this\n\n1 http://www.imdb.com/title/tt2063241/synopsis?ref_=ttt_ov_pl\n\nAnonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nfilm\". It can be seen that this statement is required at the get go as a manner to enlist\ncredibility and verify its authenticity. This is my view was a definite requirement\nespecially given that the film had quite a number of foreign to Arabia and non-Muslim\nelements to it. Omar The Epic series, on the other hand, not only did not have such a\ndisclaimer within the film but it also did not seek for the approval from the said\nauthority bodies. In view of that, it is to no surprise that the Series actually drew a lot of\ncriticism. In the same year of the launch of the Series, a representative from Al-Azhar had\nquickly stated that the series had not been referred to them for approval. Mohamad\nOthman, a member of the Al-Azhar Islamic Research Academy further commented that if\nthey had come for approval, the series would have been prohibited because it depicted the\nfour caliphs and the ten companions of the Prophet S.A.W. who had been promised\nparadise2. This was their firm stand and we can see this stand being upheld in the\nMessage.\n\n2. How the Prophet S.A.W. was depicted in the movie - in The Message, the Prophet\nS.A.W.'s presence in a scene is accompanied by a soft high pitched sound in the\nbackground. The Prophet S.A.W. will also be the camera view i.e. when people address\nhim, they will speak to the camera. In Omar the Series, the camera view approach is the\nsame but I noticed some enhanced variation:\n- A scene with the Prophet is typically played in front of the Prophet S.A.W.'s\nhome\n- Within the home, the Prophet S.A.W would be in the room and there will be a\ncurtain slightly covering a small portion of the view. The Prophet S.A.W. would\n\n2 \"Omar ibn Al-Khattab TV series raises controversy\", Al-Masry Al-Youm,\nhttp://www.egyptindependent.com/news/omar-ibn-al-khattab-tv-series-raises-controversy\n\nAnonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nthen typically walk out towards the speaker. The camera view is kept at the eye\nlevel and is sort of intentionally allowed to sway a bit i.e. unsteady.\nIn my view, it was quite apparent that the production's ability to depict the four caliph's and\nthe companions had given them more opportunity to have scenes with interaction with the\nProphet S.A.W. Credit must be given to The Message for managing to convey the message\nwith such limited resources.\n\n3. How different characters and language used impacted the two productions - if I\nremember correctly, The Message had to make do with only some of the companions\nsuch as Bilal, Zayd, Ammar and the Prophet S.A.W.'s enemies to bring the picture to life.\nOmar The Epic series on the other hand had the luxury of almost all the key characters.\nThis certainly helps convey additional messages from a media perspective to the viewers\nwhich to me The Message did not:\n- The characteristics and the socio political dynamics of the Arabs at the time -\nthe earlier episodes of Omar the Series focused solely on the traditions of the\nArabs such as their privilege position of the Quraish within the Arabian peninsula\ndue to their role as custodians to the Kaaba, their strong sense of tribalism (this\nwas the real mafia in my view as it does put The Godfather to shame) and how\n\"hard\" the Arabs were as a society. The scene of all the Arab leaders congregating\nin an open hall just outside the Kaaba to discuss their daily affairs spanning from\ntrade strategy, the threat to society brought by the Prophet S.A.W. the standing of\nthe slaves.\n- Love for poetry and the beauty of the Arabic communication exchange - the\nscript and screenplay of Omar the Series had successfully portrayed the beauty of\nthe Arabic language and their strong appreciation for poetry. In a way, this is a\n\nAnonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nvery critical background required to understand how Islam spread, which was\nverbally. The Arab poetry and had beautiful and witty exchanges in conversation.\nThis is why when the Quran came down, they were unable to resist the sweetness\nof the Quran that they actually had to resort to launching a propaganda campaign\nagainst the Prophet S.A.W.\n- The Arabic language and dialogue discourse (as oppose to in English) helped\nin setting the stage for instances when some ayah's came down - One example\nof this was when Abu Lahab had an angry exchange with Abu Talib as he was\nunloading filth in front of the Prophet S.A.W.'s. The scene happened just after\nSura Al Massad came down when Allah sent down verses regarding Abu Lahab.\nAbu Lahab was an uncle to Prophet S.A.W. and given their strong society focus\non lineage and family ties, Abu Talib said \"Abdul Mutallib (their father) would\nhave been heartbroken to see this. People usually say you can have a brother from\nanother mother. But they have never said that you can have an enemy born by\nyour mother.\"\n- Lost in translation - there was one very strong incident in the movie which I felt\nwas lost in The Message due to the use of the English language. This was the\nscene when Bilal was being tortured and a huge stone was placed on his chest. In\nThe Message, he called out \"God is One\". In Omar the Epic Series, he says it is\nArabic which is \"Ahadun Ahad\". This phrase, \"Ahadun Ahad\" would go on to\nalso become the battle cry when the Muslim's went out to the epic wars such as\nBattle of Badr and Battle of Uhud.\n\n4. How revelation and the Quran was depicted - there are strong similarities in both\nproductions here. The revelation which came down from angel Gabriel was done by a\n\nAnonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nstrong, deep and booming voice. The scene for the first revelation was almost identical in\nthe sense that it involved Ali R.A. and Waraqah ibn Naufal speaking to the Prophet\nS.A.W. Sura Iqra and Sura Mudatthir was recited in the background. One thing to note\nthat in Omar The Epic Series, given that the movie is in Arabic, the quranic verses were\ndistinguished by them starting the verses with \"Bismillah...\" and ending it with\n\"Saddaqallah....\". Both films had documented the verses in the forms of nasyeed and also\nparchments. This was seen in the scene when Omar found Islam - he caught his sister in\nher home reciting the quranic verses and had taken the parchments and read it himself. It\nwas Sura Taha. There was also a scene when the Abu Sufyan caught the Muslim's in\nsajdah praying outside of Makkah.\n\n5. How the message was spread - This was one of my biggest take away from Omar the\nEpic series. I could see from a media perspective in terms of how the Quranic verses were\nspread amongst the Arabs. They had linked the coming down of specific verses to\npinpoint occasion as to why the said Sura came down or was used. Following are some of\nthe examples from the series that I've noted:\n- Surah Mudatthir [11-3 to 11-26] - this Sura came down in relation to Al-Walid\nibn Al Mughirah, the most eloquent of the Arab leaders. The Quraish tribe had\nsent Al Walid to the Prophet S.A.W. to make sense of the beautiful and piercing\nversus that had entered the hearts of all those who have heard it. While he was\nconvinced himself, the Sura describes how he plotted and resorted to calling the\nProphet a Sorcerer.\n- Surah Ar-Rahman [55-1 to 55-20] - in this scene, Abdullah ibn Masood R.A.,\none of the companions wanted to do his part in spreading the message. This\noccurred approximately a year before the Hijra. He went to the Kaaba, in front of\n\nAnonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nthe defying Quraish and recited loudly Sura Ar-Rahman. I've always wondered as\nto why Sura Ar- Rahman repeated the following verse thirty one times out of the\n78 ayahs.\n\"Then which of the Blessings of your Lord will you both (jinns and men)\ndeny?\" [English translation by Mohsin Khan, iQuran III v3.3]\nThe context is clear now, the Prophet S.A.W. had been preaching for close to 10\nyears now as we are approximately a year before the Hijra. It has been a long,\npainful and challenging time for the Muslims in spreading Islam as they faced\nnon-stop persecution from the Quraish. This sura from a media perspective almost\nhas a cheeky 'what more do you want' of a tone to it. True enough, Abdullah Ibn\nMasood was immediately beaten and taken down by the non-believers.\nThis had given a different level of understanding pertaining to the importance in\nunderstanding context, i.e. the when, the why and the how surrounding a quranic text or a\nsunnah.\n\n6. Other matters: It has to be noted that Omar The Epic Series had benefitted from CGI\ntechnology. They are able to place a bit more geographical into the minds of the viewer's\nwhen they depicted Makkah at the time and the surrounding powers i.e. the Persians and\nEgypt. I have to say that the music score coupled with the CGI elements makes it similar\nto the opening introduction of Games of Thrones. Amazing effort.\n\nConclusion - I believe Omar The Epic Series is an amazing series. I believe despite not\nhaving the supposedly expected regulatory body approval, they have managed to incorporate\nand present a fairly detailed account of the events surrounding the Prophet S.A.W. and the\nbeautiful message. The Message, on the other hand, did achieve its goal by ensuring its\n\nAnonymous MIT student\n\n21M.289 - Islam/Media\nProject 1: Review of Omar The Epic series and Selective Comparison to The Message\n\nefforts were recognised and was able to see the light of day. One thing is for sure, the public\nhas become more open and willing to explore and accept new ways to understanding Islam.\nThe enhancement in media technology and creative perspective from a content delivery angle\ndefinitely has a role to play in spreading the message.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 1 sample: Understanding the Temporal Contexts of Islam through the Qur'an and Hadiths",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/2700fab7fd5b7038bbb92d3103d2b328_MIT21M_289S15_proj1_ex2.pdf",
      "content": "Anonymous MIT student\nProfessor Peter McMurray\n21M.289\n7 March 2015\nProject 1: Understanding the Temporal Contexts of Islam through the Qur'an and Hadiths\n\nHaving very little exposure to Islam previous to reading the Qur'an and the collections of\nhadiths by Sahih al-Bukhari and Ibn 'Arabi, the exploration of Islam and media together is as\nmuch a history class as a critical analysis of how information flows. Timing is critical to\nunderstanding the value these documents add to the Islamic faith and to logical thought.\nDifferent time periods are characterized by different contexts. There was a time before\nMuhammad's revelations which was without Islam, a time during which he and his followers\nwere pronouncing their faith and establishing Islam, and present day, where the value of the\nQur'an as a text is more weighted and also more personal.\nA book is silent. It does not voice its contents; yet for the Qur'an and the hadiths, the\ncontents were first voiced and then put into writing. For the qur'an to then be received present\nday, the transmission of the qur'an passes through many nodes of reception. Starting with\nMuhammad reading the Qur'an as instructed by Gabriel in surah 96 (The Quran 468), the qur'an\nis then passed to his followers, after which it enters into a book format in Arabic, which is then\ntranslated into English and written in a new book. As part of standard signal processing theory,\neach node in the path from transmitter to receiver is an opportunity for noise to be introduced\nand for part of the signal to be lost. The information which Muhammad intended for his\nfollowers to receive is received best by someone who can interact with Muhammad directly -\n\nhearing the qur'an from Muhammad himself, observing Muhammad's behavior and instruction\nfirst-hand, and being able to ask questions and receive answers. Understanding information is a\nprocess. A book is silent, and it cannot assist in completing one's understanding of the message\nby answering questions.\nEven though the Qur'an and hadiths require interacting with a far removed version of the\nqur'an, the act of writing down what was being recited and said by Muhammad was necessary\nfor the message to carry on through periods of turmoil and transformation. If technology\nallowed for Muhammad to recite directly across temporal boundaries, the information would be\nconveyed through its ideal form. Because all men share in human mortality, there is no way to\nhave minimized the transfer pathway to a one on one interaction with Muhammad. The creation\nof the book form of the Qur'an was motivated by the temporality of the people who could recite\nits message. If every person who had memorized the Qur'an and could recite it died (all hafiz),\nwould Islam be lost to time? Putting the Qur'an and the things said by Muhammad into writing\ncan be likened to hitting the save button on a Word document.\nA Word document is a virtual form of a paper. A paper is the concatenation of ideas into\na complete argument or record, and papers have utility in the way they can be used to\ncommunicate many ideas through a single unit of media. All of the wisdom contained in the\nmessage and the work that goes into communicating the message is as temporal as the medium\nwithin which it is stored. If this Word document were not saved after two more pages were\ntyped hereafter, there would be no means of communicating the ideas in those two pages without\ntyping them again (or presenting them in some other format). The Qur'an and the hadiths are\nsignificant because they secure immortality for the message revealed to Muhammad, at least to a\nreasonable extent (i.e. under the assumption there is no realistic way for someone to destroy\n\nevery copy of these texts, both paper and digital). The Qur'an is thus valuable as a storage\ndevice for accessing Muhammad's revelations in the present.\nTo understand the significance of the act of writing the Qur'an, it is important to note\nwhen it was written. The Qur'an was not the first book written by a prophet claiming to be under\nthe authority of God (i.e. the Holy Bible), nor the last (the Book of Mormon). It is interesting the\nTorah and the Bible were established before the Qur'an, as it means the Qur'an is written in a\ntime when it can respond to the other faiths and present itself as the true (almost as if \"the\ncorrected\") record of the people and miracles which are foundational to the Abrahamic faiths.\nSeveral surahs in the Qur'an share characters and stories with the Torah and the Bible,\nsuch as the creation story in surah 7:11-27 and the story of Noah in surah 71. Many people at\nthat time were conscious of Judaism and Christianity and could recognize parts of the Qur'an\nbecause of an awareness of the texts of the other faiths. The presence of something familiar in\nMuhammad's qur'an grounded it by giving something to which many people could relate. Also,\nby having two other monotheistic religions to reference, the Qur'an can make comparisons. It is\na strong means of crafting an argument to have an example of right - for Muslims, anything read\nin the Qur'an or said by the Prophet - and wrong, which is how the Qur'an characterizes many\naspects of the Jewish and Christian faiths.\n\nHadith 7 in Book 1 of Sahih al-Bukhari's hadith collection demonstrates the value of\nbeing able to ask questions of the source of the message and having the other Abrahamic faiths\nfor comparison. Heraclius uses questions posed to Abu Sufyan to gain a complete understanding\nof who Muhammad is and what he proclaims about Islam. As part of Heraclius's deductive\nreasoning, he draws on the lives of other prophets which he could not have done if Muhammad\nand his revelations had come before the other Abrahamic faiths. During the lifetimes of\n\nMuhammad and his companions, people could understand Islam through these kinds of\ninteractions. Today, these interactions are still valuable to those seeking to understand Islam.\nMuhammad and the works of his time can be understood through the hadiths.\n\nIt is worth noting some hadiths are recognized as more credible or more sound accounts\nof the sayings of Muhammad and his followers than others. This lends insight into the context of\nthe hadiths both in time and as media. A written text has no credibility of its own. Only the\nperson writing the text has credibility. In the case of the hadiths, credibility is an idea spanning\nevery generation between present day and Muhammad's lifetime. The two periods are bridged\nby a chain of transmission, and the diligence of Muslims to recite and eventually write down\nMuhammad's speech is what allows people today to follow Muhammad's example. Even\nbetween well-known hadith collections such as Sahih al-Bukhari and The Complete Forty Hadith\ncollected by Imam an-Nawawi, there is disparity in the soundness of the hadiths. The construct\nof having hadith classified as Sahih (sound), Hasan (good), Da`if (weak) or Maudu` (fabricated,\nforged) as explained on the Islamic Awareness website is a result of having information pass\nover multiple lifespans with the intent of retaining the accuracy of the original message. There\nwould be no question of the credibility of the things Muhammad said if they were heard first-\nhand. The more sound a hadith in its transmission, the stronger it stands as a device for\ninstructing Muslims in practicing Islam.\n\nFocusing lastly on the present day, even though the Qur'an and the hadiths give a vitality\nto the message revealed to Muhammad, the Arabic version of the Qur'an has little to no value to\nEnglish speakers. If the message was kept in Arabic and restrained from being translated into\nother languages, it would be no less temporal than the recitation by hafiz. If all those capable of\nreading and speaking Arabic died, would Islam be lost to time? For the message to continue\n\nonwards, either the Arabic language has to be preserved as the final medium through which the\nmessage can be transmitted, or the message itself must be preserved in modern languages, thus\nmoving through another node in its transmission. Value itself becomes contextual. The English\nversion of the Qur'an may have value to an individual while the Arabic version does not. From\nthis idea sprouts the question of what new media will be valuable in the future for storing and\nconveying the information revealed to Muhammad so that the medium does not lose relevance.\nIf direct recitation from Muhammad to the receiver is the most succinct means for\ntransferring information, why must this be a temporally dependent solution? There is an\ninteresting friction between what is necessary for the message to last and what is preferential in\norder to maximize quality. The practice of Islam is currently dependent on the Qur'an and the\nhadiths. There are opportunities for the message to be received through recitation, yet even so,\nthe recitation is almost certainly a transmission coming after the Qur'an, with the reciter's\nunderstanding of Islam taken from the Qur'an and the hadiths. With so many nodes in the\ntransmission pathway, there is expansive room for noise in Islam, yet the diligence of believers\nand scholars to preserve the message as accurately as possible slows the degradation of the\nsignal. It is reasonable to believe Muhammad's qur'an has not lost its value.\n\nWorks Cited\n\"The Classification Of Hadith: According To The Reliability And Memory Of Reporters.\"\nIslamic Awarness. 2015. Web. 8 March. 2015\nAn-Nawawi, Imam. The Complete Forty Hadith. 3rd ed. London: Ta-Ha Publishers, Ltd., 2004.\nPrint.\nThe Quran. New Delhi: Goodword Books, 2010. Print.\n\"Sahih al-Bukhari.\" Sunnah.com. Web. 7 March. 2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sample Student Response #1 to MFA Visit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/48331402b07cc909eceff5d4faab2d70_MIT21M_289S15_assnMFA_ex1.pdf",
      "content": "21M.289 - MFA Visit\nby anonymous MIT student\n\n1. What kinds of different relationships can be seen in this collection between writing and\nimage? And between image and object? Give an example of an object that you find\nengages with these tensions in interesting ways.\n- Most of the writing on the objects are written in Kufic - tension exists here as Kufa\nused to be a centre of knowledge and writing as we understand it are typically used\nto convey a message. Kufic as a form of writing is purposely made more difficult to\nread. It is expected that one would know what the meaning of a particular script in\nadvance rather than having to try and decipher it from the object itself. As such on\none hand, while writing is typically aimed at conveying message, Kufic on the other\nhand does not focus too much on that, rather it allows for the writer to focus more\non its stylistic design, infusing designs such as knots and flowers. Noticed at times\nthere were also use of animals i.e. birds. (Fig 1- candle stick)\n\n- On image and object, at times the infusion of writing seem to go against the function\nof a particular object - one example was the mirror on display. It had Kufic scripts\nwhich invoked good fortune all over it but I am pretty sure this would get in the way\nof providing maximum/ efficient reflection as far as its function as a mirror is\nconcerned. One would expect perhaps writings can be staged in a smaller form\nmaybe around the plate rather than all over it (Fig 2 - Mirror)\n\n2. How Islamic are these objects? Pick two objects with differing qualities/degrees of\n\"Islamic-ness\" and briefly compare/contrast them.\n- Referring the Fig 1 i.e. the candlestick, it offers wishes of wealth, good fortune and\npower to the owner in Kufic writing, but yet it includes design of classical Greek gods\ni.e. Zeus.\n- Star and Cross tiles (Fig 3) - These tiles were used in mausoleums of key Islamic\nfigures and the ones which includes designs which portrayed human beings were\ntypically used in places where more secular activities took place. It is interesting to\nnote that there were some tiles were shaped in a form of a cross which is central to\nChristianity.\n\n3. Along the wall opposite the cases of objects are a series of illuminated manuscripts and\nobjects from medieval scientists like al-Jazari. What kinds of relationships between\ntechnology and arts is visible? Pick two objects that make use of/explore technology in\ndifferent ways and briefly compare/contrast them.\n- The Al Jazari collection turned out to be the single most important book which\ndocumented Islamic technology. Art was being used in this case to preserve and\nrecord achievements on the technological front. Having said that, the art depiction I\nbelieve had more to it - I could see certain patterns of single Arabic letters in specific\ncolours which are labelled at certain places. In fact, I feel a bit frustrated of not being\nable to understand why.\n\n- Device for raising water - this one depicted the use of animal strength (presumably a\ndonkey) walking around a pole and the rotation of the pole works a pump which\nwould pump water up.\n\n- Device for dispensing water - or in this case, it did look like alcoholic beverages as\nthe two individuals down below do look like they are having a bit of fun as they have\ntheir arms interlocked, as if encouraging each other to go on.\n\n4. Walk through at least one other gallery in the museum. What do you observe about the\ncuration of the Islamic Art gallery in contrast to others at the museum?\n- The positioning of the Islamic gallery was a bit stretched or in between. As you came\ndown the corridor of Chinese painting, you would end up right smack in the middle\nof the Islamic gallery, which in my view is inefficient. It would not serve well if a\nvisitors aim is actually the exhibition at the end of the corridor - you get a bit of a\ndiscontinuity. And it is very interesting that at the end of the corridor was an\nexhibition which had a fair share nude art.\n- One thing I felt was also less satisfying was the fact that the objects were exhibited\nbacked to a wall - I noticed some of the galleries on the 2nd floor where they\n\nshowcase the vase and pots in a clear glass cabinet which allows the visitor to get a\n360 degree view of the object.\n- I was hoping there were more museum helpers covering the section but there was\nreally no one whom I could engage in throughout my 45 minute stay there.\n- Having said that, I have visited the Topkapi Palace in Istanbul before - I do belief\nMFA has quite a nice job I presenting what they have. Topkapi Palace can surely\nbenefit from some of the lighting work and object commentaries on display.\n\nAll in all, I enjoyed the trip immensely. I was also very surprised to see a really good\ncollection of Islamic art review books at the gift shop at the end.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Project 2 Assignment: Response to Islamic Art",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/64111dbe30960212880683da2a5c6085_MIT21M_289S15_proj2.pdf",
      "content": "Islam/Media, Project 2\nResponse to Islamic art\nOur second unit in this course focuses on visual and aural culture in Islam, including\nwriting, visual arts, architecture, poetry, cityscapes and soundscapes, as well as many of\nthe \"original media\" of our first weeks (the Qur'an, recitation, prayers, the adhan, etc.).\nFor project #2, choose a piece of Islamic art or other audiovisual object and create a\nresponse to it. As usual, what constitutes \"Islamic art\" will be left up to you--and indeed,\nyour choice of an object may necessitate your explaining why you consider it Islamic, art,\nor audiovisual. (That being said, creative interpretations of the terms are encouraged!)\nSome objects/collections/resources you might consider would include:\n-\nthe Islamic Art gallery of the Museum of Fine Arts or another museum\n-\narchitecture, or some object within an architectural space (ideally something\nyou've seen in person)\n-\nan object from the bookstore of the Boston mosque\n-\na copy of the Qur'an (possibly drawing on the MFA's online database)\n-\na sound recording, video, or other piece of media you encounter online (note:\nif you pick something something of this sort, be sure that you carefully check\nsources/citations)\n-\na piece of poetry, traditional or contemporary (Sufi, hip-hop, nasheed, etc.)\n-\na particular reciter/recitation (of the Qur'an, of poetry, etc.)\n-\nimages from MIT's Aga Khan collection (archive of architectural images; new\ncollection of materials from contemporary Iraq)\n-\nbooks depicting (sometimes imaginary) speculative technologies (e.g., al\nJazari's The Book of Knowledge of Ingenious Mechanical Devices)\n-\na website or other piece of computer-generated art\n-\nfilms depicting Islam (including those screened in class)\n-\nor some other sensory object/practice you find intriguing!\nThe starting point to consider here is that of audiovisual (or other sensory!) experience:\nWhat kind of sensory engagement does your object entail? How does its material\nqualities (e.g., what it's made of, how it's preserved) interact with and shape its\nmeanings? How/when (if at all) does it circulate? How does the object balance aesthetics\nwith information?\nAs with the first project, responses may take the form of a 5-6 pp. paper or\nalternative/media formats--or something in between. (Note: musicology and art history\npapers often incorporate media examples within the papers themselves.) Written work\nmay be more speculative or imaginative, but it should critically engage with the themes\nof the course. Once again, projects in alternative formats are especially encouraged,\nincluding those that use aural or visual means to engage with your audiovisual objects.\nTo further foster creative thinking along those lines, alternative format projects will start\nwith a bonus 10% in grading. Possible formats might include:\n\n-\na written paper\n-\na short video piece (fiction or non-fiction)\n-\nan audio piece (sound composition, podcast, experimental radio piece)\n-\na set of images (photographs, drawing, calligraphy)\n-\nmemorizing some part of the Qur'an and documenting (in writing, video, or\nsound) your experience with that process\n-\na computer program (database, standalone program, simple website, app)\n-\ncomputer-based art/design (visualized/sonified data, etc.)\nIf you choose to create a media piece in a non-written format, you are encouraged to\ninclude captioning, other textual supplements to clarify your materials, and a brief piece\nof writing to clarify your aims with the project. If you program something, please include\nyour code.\nAs you are brainstorming ideas, please don't hesitate to be in touch by email, before/after\nclass, or in office hours. If you have materials in-progress for class on Monday, April 6th,\nwe will work through a quick group-critique of them. All materials should be submitted\nby 11:59 pm on Friday, April 10th.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Project 2 sample: Expanding Beyond the Text",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/3bbe81cf1faebc5e0b03c65d4797e3ed_MIT21M_289S15_proj2_ex2.pdf",
      "content": "MIT Student\nProfessor Peter McMurray\n21M.289\n15 April 2015\n\nFigure 1.\nBy Hamid al-Amidi (1891-1982), Republic of Turkey, 1959 - 1960 AD\nInk, gouache and gold on paper.\n21 3/ 26 in\nHamburg, private collection (via islamicart.com)\n(c) Hamid al-Amidi. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nProject 2: Expanding Beyond the Text\n\"[The Quran's] verses were written in the Arabic script, first by the Prophet's associates\nand later by professional scribes who tried to give reverent physical form to the immutable\nbeauty of God's word\" (Bloom).\nFigure 1 is an image of a composition created by Hamid al-Amidi in the 20th century. The\ntranslation of the Arabic text in Figure 1 is as follows:\n\"In the name of God, The Compassionate, The Merciful; Praise be to God; the Cherisher\nand Sustainer of the Worlds; The Compassionate, The Merciful; Master of the Day of\nJudgment. Thee do we worship, and thine aid do we seek. Show us the straight way; The\nway of those on whom Thou hast bestowed Thy Grace, Those whose portion is not wrath,\nAnd who go not astray\" (islamicart.com)\n\nThis is the opening Surah of the Qur'an and one of the most familiar surahs for Muslims\n(islamicart.com). The opening Surah is essential for daily prayers and will be memorized early\non in a Muslim's spiritual journey. Since the Surah serves a vital function in the Islamic world,\nthe artistic piece (Figure 1) at a rudimentary level captures the significance of the Quran's\nmessage enfolded in the text. The information can be adequately enfolded into plain calligraphy\nof the form of one color of ink on a blank piece of paper. This type of information storage can\nbe found throughout Islam civilizations as the writings of students learning the Quran or\ncalligraphy on buildings to communicate their function as holy spaces. Yet when Hamid al-\nAmidi created his composition (Figure 1), he chose to go beyond the rudimentary and the result\nis an image which attracts the eye and is sensually appealing. Perhaps the most fundamental\nexplanation for why he would choose to make this piece is to engage emotion as the observer\n\ninternalizes the opening Surah. Emotion intensifies as the piece progresses further away from its\nroots in the plain calligraphy.\nThere are many attributes of the overall piece which can be explored, including the\nposition of different segments, the addition of decorative shapes, and the incorporation of\nsupplementary text. The enhancements to the ancient Quranic text in Figure 1 are comparable to\nthe artistic approach of modern day graffiti artists whose art is to enhance the enfolded\ninformation within a word or message by means of additions to the basic text. As the artistic\nfeatures of this piece are elaborated on, it becomes clear artists of different styles and generations\nemploy similar ideas in order to elaborate on a core idea artistically.\n\nIn Figure 1, the calligraphy is centered and spaced neatly into rectangles. Because the\nrectangles containing text seem to fit neatly into the spaces between the dominantly blue\nrectangles and the gold decoration goes around the rest of the image as a border, the process for\ncreating this piece seems to have begun with the spaces containing writing and expanded\noutward, with other elements being added sequentially. This is representative of the fact the\npiece gains it's significance from the message enfolded in the Arabic calligraphy. The rest of the\npiece is developed from the calligraphy. When Hamid al-Amidi felt the piece was complete in\nits intended purpose having reached sufficient development of the core idea, he concluded his\nartistic work (islamicart.com). Just as al-Amidi used background color to accentuate different\nparts of the message, graffiti art will often feature a background of clouds or bubble shapes to\ndifferentiate the letters forming the graffiti piece from the canvas on which it is created (a wall or\na piece of paper). The background makes the letters stand out, as if elevating it out of the 2D\nplane on which it exists in order to allow the observer to experience it in a more intimate way.\n\nFigure 2.\nFrom http://boksmati.blogspot.com/2008/03/arabic-graffiti-urban-arabic.html\nThis intimacy within the art is relatable for Muslims and graffiti artists alike. Islamic\nfaith is intensely intimate because of the nature of getting closer to God through faith, and for the\nart to reflect this intimacy only enhances the experience of engaging with a passage of the Quran.\nSimilarly, the more time spent with a particular graffiti artist's work, and the more immersed the\nobserver becomes in the name, symbol, character, or even style the artist consistently chooses to\nemploy in his/her work, the more intimately acquainted the observer becomes with the individual\nbehind the art. The identity of the artist is reflected in his/her work since the name he/she uses,\nthe choice of colors and characters, the location in which the artist does the graffiti will shed\n(c) Boksmati. All rights reserved. This content is excluded from our Creative Commons\nlicense. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nlight on their personality, the media they engage in (someone might add Sponge Bob to a graffiti\npiece showing they are playful and enjoy cartoons), and the way the artist identifies\nhimself/herself geographically. Reading graffiti and appreciating its artistic elements forms an\nintimacy between the observer and the artist. In addition to provoking intimacy and emotion, the\nartist reveals an intention to share the piece with a larger audience through further artistic\nexpansion.\nThe images surrounding the calligraphy in al-Amidi's work and the complexity of graffiti\npieces make it clear they are intended for display where they can be appreciated by multitudes.\nThe amount of time which is necessary to create either artistic composition is significant, and the\nartist must have a motivation for adding decorative elements to the core text. Works focusing on\nQuranic passages such as Figure 1 may differ from graffiti in that the key motivation may be the\nglorification of God. By adding floral and geometric imagery, al-Amidi enhances the\ncalligraphy in a way which is pleasant and complimentary to the writing and yet the writing is\nundisturbed. Intuition would suggest the Quranic verse is meant to be read based on its\nlegibility. A wide audience would be able to appreciate the message and find beauty in the piece\nas a whole. On the other hand, graffiti pieces utilize decoration in a different manner.\nThe key intention of decorative elements in graffiti is not to immerse the observe deeper\nin the experience of wrestling with the message. A majority of graffiti pieces professionally\ncrafted and labor-intensive abstract the text so much the original letters fade into the background\nas subsidiary to the aesthetic of the decorations. Whereas every aspect of al-Amidi's piece,\nwhile elegantly decorated, lends itself to draw the observer back to the text - and in the text the\ninformation enfolding the expansive realm which is faith - graffiti pieces often encourage the\n\nviewer to look elsewhere, seeking meaning and purpose in the background imagery, characters,\narrows, three-dimensional enhancements, and more.\n\nFigure 3. (by Mr. Wiggles)\nFigure 3 identifies many of the decorations which can be used to expand on the basic text\nat the core of graffiti.\n(c) TrainWriters.com. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nFigure 4. (Mr. Wiggles)\n\nFigure 4 shows how the artistic approach to writing graffiti often starts with the text and\nexpands outward into a complex piece. In both traditional Islamic art and contemporary graffiti,\nthe text is essential to the compositions and acts as the foundation of artistic expression.\n\nIdentity comes back into the discussion when considering the addition of the name found\non al-Amidi's piece and the \"signatures\" which often accompany graffiti pieces. The signing of\n(c) TrainWriters.com. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see http://ocw.mit.edu/help/faq-fair-use/.\n\nan artistic piece by the artist should not be overlooked in Islamic art or graffiti. In modern days,\nthe signature is universally practiced. It is iconic for intentionally or unintentionally conveying\nthe artist's deliberate decision to make this piece as a piece of art for display. Graffiti artists do\nnot sign pieces they have only half finished. Painters do not sign paintings until they have\ncompleted the painting. Dating further back than al-Amidi's days all the way to book binders\nilluminating manuscripts in the Middle Ages, signing a piece has established two concepts. The\nfirst is exposed in the following passage:\n\"With the gradual rise in status from artisan to artist, more illuminators in the late Middle\nAges began to sign their work, and often also included a small pictorial representation of\nthemselves somewhere in the work\"\nBy signing the work, the artist is claiming their status as an artist. An artistic work\nshould be inspected with the understanding the elements were chosen intentionally to form the\nwhole. It is reasonable to argue the elements of Hamid's text were included for a purpose and\nneither the calligraphy or the geometric patterns or the boarder are sufficient in defining the\nartistic work as a whole. The analog to this in graffiti is once a piece has been made which\nincorporates letters, a cartoon character, and several arrows pointing out from the letters, no\nsingle element is capable of representing the intention of the artist's work when he/she crafted\nthe whole.\nThe second established idea is the way a signature signifies the finishing of the piece.\nThe universal practice of signing pieces of art is the unspoken declaration the piece is finished,\nand it should be inspected as a finished piece rather than a something in progress. The finishing\nof the piece is important because only upon completion does the observer acquire a transparent\nwindow into the logic and emotions to characterize the piece as the artist intended.\n\nThe artistic expansion on calligraphy in Figure 1 takes the significance of the opening\nSurah deeper into a rich expanse of emotion, identity, and completeness. The methods by which\nal-Amidi achieves this fantastic work of Islamic art can be compared with the methods by which\ncontemporary graffiti artists are expanding upon text to create works of art. The Quran is a\nreference point for beauty with its poetic writing style and message of good news for believers.\nArt engages the mind and the heart both in large proportions, and art can be a meaningful way to\ninternalize important ideas of faith and identity. The potential impact of expanding on text\nseems to be limited only by the creativity of the artist.\n\nWorks Cited\n\"Arabic Calligraphy.\" Islamic Arts and Architecture Organization. Web. 15 April. 2015.\n\"Arabic Calligraphy of The Holy Quran.\" Islam101.com. Web. 15 Apr. 2015.\nBloom, Jonathan, and Sheila Blair. \"What Is Islamic Art?\" Islamic Arts and Architecture. Web.\n15 Apr. 2015.\nBoksmati. \"Boksmati Graphix.\" Blogspot. Web. 15 Apr. 2015.\n\"Graffiti Letters.\" Trainwriters.com. Web. 15 Apr. 2015.\n\"History.\" The Illuminated Page. Web. 15 Apr. 2015\n\nFurther Research was conducted through the following sources. In order to develop on the ideas\ndiscussed here, I started by spending a couple of hours reading about the Arabic alphabet and\npractices in writing calligraphy. I also watched videos from a lesson series on learning the\nArabic alphabet in order to become familiar with the letters, vowel usage, and connecting letters\ntogether to form words. Further elaboration on the topics in this paper could involve the\ndiscussion of artistic abstraction of the calligraphic text. Kufic script has a great deal of variety\nand demonstrates the power of being familiar with words and ideas by presenting text which is\nabstracted but still understandable.\n\nFurther sources not used for paper:\nArabic Alphabet:\nhttp://www.islam101.com/quran/letters.html\n\nAbout Arabic Calligraphy:\nhttp://islamicart.com/main/calligraphy/intro.html\nSource for Learning Alphabet by Video:\nhttps://www.youtube.com/playlist?list=PL40BF34CE84F8BAC5\n\nCalligraphic Styles:\nhttps://www.claremontmckenna.edu/ml/The_Art_of_Arabic_Calligraphy.php\nhttp://www.moroccancalligrapher.com/styles/\nNaskh Script:\nhttp://static1.squarespace.com/static/522d09abe4b0673919befd5e/522ff03fe4b08c58ebe7f199/52\n2ff5d6e4b0c5d6fd6320e5/1378931985061/tammim%2B%2B.jpg\n(Taken from Moroccan calligraphy site)\nQuran Calligraphy:\nhttps://www.google.com/search?q=quran+calligraphy&rlz=1C1LENN_enUS441US441&espv=2\n&biw=1366&bih=667&source=lnms&tbm=isch&sa=X&ei=KtQqVZ2jMqfnsATNi4GA\nCQ&ved=0CAYQ_AUoAQ\nAllah Examples:\nhttps://www.google.com/search?q=Gulzar&rlz=1C1LENN_enUS441US441&es_sm=93&source\n=lnms&tbm=isch&sa=X&ei=FsYqVf3fJPWHsQSakYGIBg&ved=0CAkQ_AUoAw&bi\nw=1366&bih=667#tbm=isch&q=allah+calligraphy\n\nKufic:\nKufic Shapes:\nhttp://islamicart.com/main/calligraphy/styles/kufi.html\nKufic Quran page:\nhttp://www.sothebys.com/en/auctions/ecatalogue/2012/arts-of-the-islamic-world/lot.401.html\nKufic Script \"Bismillah\":\nhttps://www.google.com/search?q=kufic+script+bismillah&rlz=1C1LENN_enUS441US441&es\npv=2&biw=1366&bih=667&source=lnms&tbm=isch&sa=X&ei=Ft0qVZSIAZCRsQSrtI\nGYBQ&ved=0CAYQ_AUoAQ\nGraffiti:\nArabic Graffiti, Lebanese Artist:\nhttp://boksmati.blogspot.com/\nGraffiti and Calligraphy in Tunisia:\nhttp://www.bbc.com/news/world-africa-26515754#\nArticle about types of graffiti from tags to Pieces:\nhttp://weburbanist.com/2009/10/01/graffiti-lettering-9-cool-characters-alphabets-fonts/\nThe way a word can be understood when the meaning is already known:\nGall, Frederik. \"Easy To Read 1.\" Behance. Web. 15 Apr. 2015.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sample Student Response #2 to MFA Visit",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21m-289-islam-media-spring-2015/2d256cbec2474239cffffd54116a17b1_MIT21M_289S15_assnMFA_ex2.pdf",
      "content": "Anonymous MIT student\nProfessor Peter McMurray\n21M.289\n\n6 April 2015\nResponse to MFA Visit\n1. What kinds of different relationships can be seen in this collection between writing and\nimage? And between image and object? Give an example of an object that you find\nengages with these tensions in interesting ways.\nWriting is used on the objects to give the objects attributes of blessings or to wish the bearer\nwealth and power. The writing seen on many of the objects is elongated, decorated, and\ncontorted to be appealing to the eye in an aesthetic way. It is interesting how sometimes the\nimage is bound by the object's shape and edges, while sometimes it is not. Wasmaa Chorbachi's\n\"Plate: Bismillah, 2007\" is an example of an object where the writing is unbounded by the limits\nof the object. The writing extends past the rim of the plate as if connecting with the world\naround it. Additionally, the writing/image coats the object following its contours. It is both a\npart of the object and part of the written tradition of Islam.\n2. How Islamic are these objects? Pick two objects with differing qualities/degrees of\n\"Islamic-ness\" and briefly compare/contrast them.\nThe intensity of the Islamic influence varies. The Belt Ornaments are metal and lacking of most\ndecorative elements other than Arabic text which states a verse from the Quran. Many of the\nobjects have verses or blessings/Islamic messages on them, but not all. This is very Islamic, as it\nkeeps the objects pure and directs all attention to the message of the Quran. The Iranian plate\nwhich comes from the same time period as the belt ornament features no text and instead seems\nmuch more rooted in Asian art forms than Islamic due to its glaze, blue coloring, and decorative\nimages of nature and wildlife.\n3. Along the wall opposite the cases of objects are a series of illuminated manuscripts and\nobjects from medieval scientists like al-Jazari. What kinds of relationships between\ntechnology and arts is visible? Pick two objects that make use of/explore technology in\ndifferent ways and briefly compare/contrast them.\n-Similar materials are used in both the manuscripts and objects: gold and red paints\n-Some manuscripts have decoration on the objects drawn on them. This technology is drawn\nwith the primary purpose of conveying knowledge, yet the decorations such as the calligraphy on\nthe dome of the building in \"Device for display at a drinking party\" tie the manuscripts to a\nsecondary purpose of demonstrating the appreciate of the arts within Islamic society.\nTwo objects to compare are the bloodletting manuscript and the astrolabe. The bloodletting\nmanuscript is symbolic and thus easy to decipher how it works. The objects drawn have\n\nmechanical functions that can be reasoned out through examination. The astrolabe is intricately\ncrafted with decorations on the different layers, making it hard to know how it works just from\nlooking at it. It's function is hidden beneath the craftsmanship.\n4. Walk through at least one other gallery in the museum. What do you observe about the\ncuration of the Islamic Art gallery in contrast to others at the museum?\nThe windows in the Islamic art gallery are covered by geometric decorations. The materials used\nto construct the displays and the room are various woods and fibrous cloths. There is a lot of\nlight in the hallway and illuminating all of the objects, and the light makes the ceramics and gold\nshine. In the Benin Kingdom gallery, the objects' surroundings lack any decorative qualities\nwhatsoever, with the walls, pedestals, and cases all looking barren and purely functional. The\nlighting in the room is dark in order to enhance the effect of spotlights shining on the objects.\nThe room is not meant to feel bright or warm as is the Islamic art gallery. The contrast between\ngalleries makes me think about and appreciate how connected Islamic architecture is to Islamic\nart.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21M.289 Islam/Media\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}