{
  "course_name": "Japanese III",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Language",
    "Japanese",
    "Humanities",
    "Language",
    "Japanese"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week , 1 hour / session\n\nPrerequisites\n\n21G.502 Japanese II\n\nCourse Objectives and Procedures\n\nThis course covers Lessons 13 through 18 of\nGenki:\n\nAn Integrated Course in Elementary Japanese II\n. The main objective of this course is to build up four basic skills in Japanese: listening, speaking, reading and writing. At the completion of this course, you will have a good foundation of basic Japanese structures and be able to carry out conversations on familiar topics with native speakers of Japanese.\n\nThere are two types of class: (i) Grammar Session and (ii) Drill Session. Please refer the daily schedule on calendar and prepare for each class according to the instruction(s).\n\nThroughout the course, we encourage you to do the following:\n\nBe an active learner!\n\nBe a good collaborator and help each other!\n\nEnjoy the class!\n\nTexts (Required)\n\nBanno, Eri.\nGenki: An Integrated Course in Elementary Japanese II.\n2nd ed. Japan Times/Tsai Fong Books, 2011. ISBN: 9784789014434.\n\nBanno, Eri, Yoko Ikeda, et al.\nGenki: An Integrated Course in Elementary Japanese, Workbook 2\n. 2nd ed. Japan Times/Tsai Fong Books, 2011. ISBN: 9784789014441.\n\nEvaluation\n\nDaily Grade:\n\nYou will be given a daily score in Drill Session based on your performance:\n\n10 = Excellent/Near-perfect performance, clearly well-prepared\n\n9 = Strong performance with minor mistakes\n\n8 = Fair performance but need more improvement\n\n7 = Weak performance with mistakes in major areas\n\n6 = Unsatisfactory performance, unprepared\n\n0 = Absent\n\nIn order to receive the credit, you have to attend the section you are registered in unless you have made official arrangements with the instructors in advance. If you have to attend a section other than your regular section on a particular day, you must notify the instructor\nat least one day in advance\n.\nThere will be no make-up for missed quizzes or daily grades unless you have academic reasons (e.g., attending seminar/special lectures, etc.) or sickness.\n\nExams and Quizzes:\n\nThere are two Interview Tests, five Lesson Quizzes (20-25 minutes long) and one in-class Hourly Exam. Many Vocabulary, Dictation, and Kanji Quizzes are given throughout the semester.\n\nEvaluation Method:\n\nACTIVITIES\n\nPERCENTAGES\n\nDaily Grade\n\n10%*\n\nFive Lesson Quizzes (LQ)\n\n25%**\n\nTwo Interview Tests\n\n10%\n\nOne-Hour Exam\n\n10%\n\nVocabulary, Dictation, Kanji Quizzes\n\n25%***\n\nHomework\n\n15%****\n\nTwo Projects\n\n5%\n\n*Three lowest daily scores will be dropped during the term.\n\n**One lowest LQ score will be dropped at the end of the term.\n\n***Four lowest scores will be dropped at the end of the term.\n\n****Two lowest scores will be dropped at the end of the term.\n\nNote: In principle, no make-up policy applies to all the quizzes. If you want to make up quizzes, provide a doctor's note. If you didn't have time to see a doctor, explain your conditions to your instructor. We may / may not let you make up quizzes depending on your situations.\n\nAttendance Policy:\n\n1. It is essential that you attend all sessions and keep up with the course work on a daily basis. Keep in mind success in a language course is a cumulative process. If you feel you are falling behind, contact the instructor immediately.\n2. If you have an unavoidable reason for your absence, please email the instructors before class.\n3. Attend the class section you are registered in unless you have made official arrangements with the instructor at the beginning of the semester, or your grade will not be credited.\n4.\nBe punctual\n. Coming in late not only results in missed performances and quizzes that may not be made up for, but also distracts other students. Showing up late may affect your daily grade negatively.\n5. No eating or text messaging will be allowed during class.\n\nHomework Policy:\n\nSubmit all assignments at the beginning of the class. Your homework will be graded by letter grades (such as \"A\", \"B+\", etc.). Late submission can be accepted with deduction in grades. Assignments turned in after three days will not receive any credits, however.",
  "files": []
}