{
  "course_name": "Japanese II",
  "course_description": "This course covers Genki I Lessons 7 through 12 that will enhance the basic skills for conversation, reading, and writing in Japenese. The program emphasizes active command of the language rather than passive knowledge. By the end of the semester, you will be able to carry on a conversation in Japanese. You will also learn approximately 90 kanji characters.",
  "topics": [
    "Humanities",
    "Language",
    "Japanese",
    "Humanities",
    "Language",
    "Japanese"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week , 1 hour / session\n\nPrerequisites\n\n21G.501 Japanese I\n\nCourse Objectives and Procedures\n\nThis course covers\nGenki I\nLessons 7 through 12, enhancing the basic skills for conversation, reading, and writing. The program emphasizes active command of Japanese, not passive knowledge. Your goal is not simply to study the grammar and vocabulary, but to acquire skills necessary to use them in a linguistically and culturally appropriate way. By the end of the semester, you will be able to carry on a daily conversation with Japanese people. You will also learn approximately 90 Kanji characters in this course.\n\nIn this course there are two types of class sessions, grammar sessions and drill sessions. In grammar sessions, information necessary for using the language, such as grammar, vocabulary, and socio-cultural information, will be provided primarily in English.\n\nDrill sessions are conducted almost entirely in Japanese. Sessions will concentrate on speaking activities that require you to use the language actively. You can achieve good daily performance scores when you have learned and practiced the assigned drills before coming to class.\n\nThe class size is limited to 16 students for pedagogical purposes.\n\nTextbooks (Required)\n\nBanno, Eri, Yoko Ikeda, et al.\nGenki I: An Integrated Course in Elementary Japanese I.\n2nd ed. Japan Times/Tsai Fong Books, 2011. ISBN: 9784789014403.\n\nBanno, Eri, Yoko Ikeda, et al.\nGenki I: An Integrated Course in Elementary Japanese, Workbook 1\n. 2nd ed. Japan Times/Tsai Fong Books, 2011. ISBN: 9784789014410.\n\nEvaluation\n\nEvaluation Criteria\n\nACTIVITIES\n\nPERCENTAGES\n\nDaily Grade*\n\n25%\n\nFive Lesson Quizzes**\n\n25%\n\nTwo Interview Tests\n\n12%\n\nOne-Hour Exam\n\n12%\n\nVocabulary, Grammar, Kanji Quizzes***\n\n10%\n\nWorkbook Homework\n\n10%\n\nProjects\n\n6%\n\n*Three lowest daily scores will be dropped at the end of the term.\n\n**One lowest score will be dropped at the end of the term.\n\n***Two lowest scores will be dropped at the end of the term.\n\nGrading Scale\n\nA=94% and above\n\nA-=93.99-90%\n\nB+=89.99-87%\n\nB=86.99-84%\n\nB-=83.99-80%\n\nC+=79.99-77%\n\nC=76.99-74%\n\nC-=73.99-70%\n\nD+=69.99-67%\n\nD=66.99-64%\n\nD-=63.99-60%\n\nF=below 60%\n\nDaily Grade\n\nIn the drill sessions, students will receive a daily grade based on the performance evaluated with the following criteria:\n\nGrade\n\nPERFORMANCE\n\nPREPARATION\n\nPARTICIPATION/CONTRIBUTION\n\nExcellent/near perfect\n\nExcellent\n\nVery active/excellent\n\nStrong/minor errors\n\nGood\n\nConsistent\n\nFair but needs improvement\n\nAdequate\n\nAdequate but needs improvement\n\nWeak/with mistakes in major areas\n\nSome\n\nSporadic\n\nUnsatisfactory\n\nInadequate\n\nInfrequent\n\nPresent but very poor\n\nNone\n\nSeldom\n\nAbsent\n\nAttendance Policy\n\n1. Attend all sessions. Because of the cumulative nature of language learning, it is essential that you attend all sessions and keep up with the course work on a daily basis. Please follow the online daily schedule and come to class well-prepared.\n2.\nBe punctual\n. Coming in late not only results in missed performances and quizzes that may not be made up for, but also distracts other students. Showing up late may affect your daily grade negatively.\n\nThere are two oral interview tests, five lesson quizzes and a one-hour exam. Vocabulary, Kanji and conjugation quizzes are given throughout the semester.\n\nHomework Policy\n\nSubmit all assignments at the beginning of the class.\nLate submission will result in a 5% deduction in grade each day\n. No credit will be given after three days. Any assignment you submit must be\nyour own work\n.",
  "files": []
}