{
  "course_name": "Japanese I",
  "course_description": "This course is designed for students with no previous knowledge of the language, providing opportunities to acquire basic skills for conversation, reading, and writing in Japanese. The program emphasizes active command of Japanese, not passive knowledge. Your goal is not simply to study the grammar and vocabulary, but to gain skills necessary to use them in a linguistically and culturally appropriate way.",
  "topics": [
    "Humanities",
    "Language",
    "Japanese",
    "Humanities",
    "Language",
    "Japanese"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week, 1 hour / session\n\nPrerequisites\n\nNone\n\nCourse Objectives and Procedures\n\nThis course is designed for students with no previous knowledge of the language, providing opportunities to acquire basic skills for conversation, reading, and writing in Japanese. The program emphasizes active command of Japanese, not passive knowledge. Your goal is not simply to study the grammar and vocabulary, but to gain skills necessary to use them in a linguistically and culturally appropriate way.\n\nIn this course, there are two types of class sessions: grammar and drills. In grammar sessions, information necessary for using the language, such as grammar and socio-cultural information, will be provided primarily in English. Drill Sessions are conducted almost entirely in Japanese, concentrating on speaking activities that require you to use the language actively.\n\nThis course covers the first six lessons of the\nGenki I\ntextbook. By the end of the semester, you will be able to:\n\nread and write hiragana, katakana, and 58 kanji characters;\n\ntalk about yourself/family/others, things, time, events, and activities--in the present, future, and past tense;\n\nshop at stores and order food at restaurants;\n\nmake requests and ask for permission;\n\ntalk about Dos and Don'ts; and\n\nask for and give directions.\n\nTextbooks (Required)\n\nBanno, Eri, Yoko Ikeda, et al.\nGenki I: An Integrated Course in Elementary Japanese.\n2nd ed. Japan Times/Tsai Fong Books, 2011. ISBN: 9784789014403.\n\nBanno, Eri, Yoko Ikeda, et al.\nGenki I: An Integrated Course in Elementary Japanese, Workbook 1\n. 2nd ed. Japan Times/Tsai Fong Books, 2011. ISBN: 9784789014410.\n\nEvaluation\n\nEvaluation Criteria\n\nACTIVITIES\n\nPERCENTAGES\n\nDaily Grade\n\n25%*\n\nFive Lesson Quizzes (LQ)\n\n25%**\n\nTwo Interview Tests\n\n15%\n\nOne-Hour Exam\n\n15%\n\nVocabulary, Dictation, Kanji Quizzes\n\n10%***\n\nHomework\n\n10%\n\n*The student's three lowest daily scores will be dropped at the end of the term.\n\n**The student's lowest score will be dropped at the end of the term.\n\n***The student's two lowest scores will be dropped at the end of the term.\n\nDaily Grade\n\nIn the drill sessions, students will receive a daily grade based on the performance evaluated with the following criteria:\n\nGrade\n\nPERFORMANCE\n\nPREPARATION\n\nPARTICIPATION/CONTRIBUTION\n\nExcellent\n\nExcellent\n\nVery active/excellent\n\nStrong/minor errors\n\nGood\n\nConsistent\n\nFair but needs improvement\n\nAdequate\n\nAdequate but needs improvement\n\nWeak/with mistakes in major areas\n\nSome\n\nSporadic\n\nUnsatisfactory\n\nInadequate\n\nInfrequent\n\nPresent but very poor\n\nNone\n\nSeldom\n\nAbsent\n\nAttendance Policy\n\nAttend all sessions. Because of the cumulative nature of language learning, it is essential that you attend all sessions and keep up with the course work on a daily basis. Please follow the online daily schedule and come to class well-prepared.\n\nIf you have an unavoidable reason for your absence, please email the instructors before class.\n\nBe punctual\n. Coming in late not only results in missed performances and quizzes that may not be made up for, but also distracts other students. Showing up late may affect your daily grade negatively.\n\nUse of laptops/tablets\nis strictly prohibited in class, except for note-taking during the grammar session.\n\nExams and Quizzes\n\nThere are two oral interview tests, five lesson quizzes (20-25 minutes long), and a one-hour exam. Vocabulary, Hiragana, Katakana, and Kanji quizzes are given throughout the semester.\n\nHomework Policy\n\nSubmit all assignments at the beginning of the class.\nLate submission will result in a 5% deduction in grade each day\n. No credit will be given after three days. Any assignment you submit must be\nyour own work\n.",
  "files": []
}