{
  "course_name": "Japanese Literature and Cinema",
  "course_description": "This course surveys both cinematic and literary representations of diverse eras and aspects of Japanese culture such as the classical era, the samurai age, wartime Japan and the atomic bombings, social change in the postwar period, and the appropriation of foreign cultural themes, with an emphasis on the modern period. Directors include Akira Kurosawa and Hiroshi Teshigahara. Authors include Kobo Abe and Yukio Mishima. Films shown have subtitles in English. Taught in English.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Fine Arts",
    "Visual Arts",
    "Film and Video",
    "Humanities",
    "Literature",
    "International Literature",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 Lectures / week, 1.5 hours / lecture\n\nFilms: 1 Film Screening / week, time variable\n\nDescription\n\nThis course examines the literature and cinema of Japan, including major written works from the 7\nth\ncentury to the present though emphasizing modern fiction, and major films from the postwar period. Literature in the form of historical fiction, novels, short stories and poetry will be coordinated with a range of feature films to explore issues of narrative style, the production of meaning in diverse cultural and historical contexts, and the shifting ground of Japanese aesthetics and culture. One of the themes we will consider is cross-cultural adaptations, as images and ideas move from the West to Japan, and from Japan to the West.\n\nAs a communication intensive course, the class requires substantial writing, individual student presentations, and class discussion, and therefore class attendance and participation are mandatory. Films will be screened outside of normal class meeting times, and, whenever possible, a DVD copy will be available from the Film Office for students who cannot attend the screening.\n\nPrerequisites\n\nNone.\n\nWriting and Speaking Assignments as a Communication Intensive Course\n\nCommunication intensive subjects in the humanities, arts, and social sciences require at least 20 pages of writing divided among a number of assignments, at least one of which is revised and resubmitted. This class requires four (4) papers that total at least 21 pages in length (double-spaced). The second essay must be revised and expanded upon before submitting to me. This resubmission will receive a grade separate from the grade on the first draft and will be based on the extent and quality of the revision (e.g., a B paper that is poorly revised may receive a C for the resubmission). A schedule of due dates is given below.\n\nHASS-CI subjects also offer students substantial opportunity for oral expression, through class discussion and student presentations. This class requires all students to participate in a weekly discussion of the assigned reading and films. In addition, each student will make one formal, roughly 10 minute presentation that will be graded by the instructor.\n\nTo guarantee sufficient attention to student writing and substantial opportunity for oral expression, the number of students in this class is limited to 18.\n\nAssignments and Grading\n\nAssignments will be distributed at least 2 weeks prior to due date\n\nACTIVITIES\n\nPERCENTAGES\n\nMicrothemes\n\nEssay 1\n\nEssay 2\n\nEssay 2 Revision\n\nEssay 3: Final Paper\n\nWeekly class participation\n\nIndividual presentations\n\nCalendar\n\nThe course is divided into three parts.\n\nPart I: Weeks 1-4\n\nForm & Content in Storytelling: Live Action Film, Anime, Rakugo\n\nHow do different forms of media relate to the stories being told, in other words, how can understand the links between form and content? What can an understanding of \"Japanese aesthetics\" provide? For interpretation, should we look \"into\" the text or \"out\" to society for understanding? How can we use ideas of \"cultural patterns\" and \"social context\" as a means to better understand media? How does live verbal performance compare with the written word and filmic visuals?\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nParadoxes of Perspective:\nRashomon in Prose and Film\n\nFilm:\nRashomon\n(Dir. Akira Kurosawa)\n\nFilm Studies: Collaborative Creativity, Transmedia, and the Social\n\nFilm:\nSummer Wars\n(Dir. Mamoru Hosoda)\n\nRakugo: The Art of Storytelling\n\nSpecial Performance: Rakugo in English by Sunshine Katsura\n\nDiscuss Readings and Films\n\nFilm:\nGo\n(Dir. Isao Yukisada)\n\nDue: Essay 1\n\nPart II: Weeks 5-8\n\nSocial Pressures and Social Rewards -- Modern Day\n\nJapan is renowned for its conformist social pressure: \"The nail that sticks up gets hammered down.\" Why, then, is there such emphasis in popular culture for the renegade who stands out, doesn't listen or chooses her or his own path? What is \"social pressure\" and how does it work? What are the good sides of relationships? This section of the course examines varieties of social pressure and rewards. How are they portrayed? How do they relate to our own experiences? What can we learn from these portrayals and our interpretations of them?\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nSmall Group Projects\n\nMuseum Visit to Boston\n\nMuseum of Fine Arts\n\nSmall Group Projects and Film Viewing\n\nFilm:\nKamikaze Girls\n(Dir. Tetsuya Nakashima)\n\nOut\n\nFilm:\nThe Kirishima Thing\n\nDiscuss Readings and Films\n\nFilm:\nGhost Dog: The Way of the Samurai\n\nDue: Essay 2\n\nSpecial Event: Nathaniel Spith Lecture\nDoubling Down on the Negative: Anti-Anti Nukes, the Anti-Anti Foreign, and Rightist Positivity in Post-3.11 Japan\n\nPart III: Weeks 9-11\n\nSocial Pressures and Social Rewards -- Other Examples\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nDiscuss Readings and Films\n\nFilm:\nDouble Suicide\n(Dir. Masahiro Shinoda)\n\nDiscuss Readings and Films\n\nFilm:\nThe Face of Another\n(Dir. Teshigahara)\n\nDue: Essay 2 Revision\n\nDiscuss Readings and Films\n\nSpecial Event: Lecture\nTokyo: City of Screens\n\nMeet with Professor Condry to discuss Essay 2 revisions\n\nOral Presentations\n\nOral Presentations\n\nDue: Paper 3",
  "files": []
}