{
  "course_name": "Jewish History from Biblical to Modern Times",
  "course_description": "This course explores how our views of Jewish history have been formed and how this history can explain the survival of the Jews as an ethnic/religious group into the present day. Special attention is given to the partial and fragmentary nature of our information about the past, and the difficulties inherent in decoding statements about the past that were written with a religious agenda in mind. It also considers complex events in Jewish history – from early history as portrayed in the Bible to recent history, including the Holocaust.",
  "topics": [
    "Humanities",
    "History",
    "Jewish History",
    "Religion",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Humanities",
    "History",
    "Jewish History",
    "Religion",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Ethnography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nFall 2010, Peter Temin (\nPDF\n)\n\nFall 2009, Peter Temin (\nPDF\n)\n\nFall 2008, Peter Temin (\nPDF\n)\n\nFall 2007, Peter Temin (\nPDF\n)\n\nCourse Description\n\nThis subject provides a comprehensive overview of Jewish history from Biblical times to today. The discussion will focus on two questions. First, how do we \"know\" what we think we know of Jewish history? This of course is a central question of all history. Since the subject ranges over a wide range of times and places, it is not surprising that the readings are based on a wide range of evidence. Second, how have Jews survived as a continuous ethnic/religious group? They are unique in the length of time they have existed with a continuous history. We will seek to discover what is durable about the Jewish experience that has led to this longevity.\n\nThe subject uses recent scholarship in English to suggest answers to these questions. Only English is required for this subject, but there is a lot of reading and writing. Readings should be done before the relevant class to make the class discussion relevant to the comprehension of the reading and the readings relevant to the class discussion. The dates on the syllabus show when the assigned readings will be discussed; they should be read completely by those dates.\n\nThis subject is funded by a gift from the Dennis W. and Jane B. Carlton Foundation.\n\nCourse Requirements\n\nThe subject requires two types of written exercises: papers and exams. Credit will be given for papers, class participation, and exams in that order.\n\nPapers\n\nThis course requires two essays of about eight to ten pages each, due on Week #4 and Week #11. The first essay will be methodological, about the methods and sources of history. It is appropriate to write this paper early in the subject because the readings on the early years reveal the most varied historical evidence. The second paper will be an attempt for each student to answer the second question of the course: Why have Jews survived as a group? The paper should also discuss each student's relationship to a religion (whatever it may be), with attention to the long-term attractiveness of this religion as well as its current appeal. For more detailed instructions for the papers, please see\nassignments\n.\n\nExams\n\nThere will be two exams on the readings in class time as shown on the syllabus.\n\nGrading Criteria\n\nREQUIREMENTS\n\nPERCENTAGES\n\nTwo papers (30% each)\n\n60%\n\nTwo exams (20% each)\n\n40%\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nThe Torah\n\nThe bible as history\n\nLife in biblical Israel\n\nJewish revolts\n\nPaper 1 due\n\nReligoius change in Roman times\n\nThe first millennium and Maimonides\n\nExam on readings\n\nExam 1\n\nMedieval Jews\n\nEarly modern Jewry\n\nJews in interwar Europe\n\nThe Holocaust\n\nPaper 2 due\n\nThe Mandate and Israel\n\nJews in the United States\n\nExam on readings\n\nExam 2\n\nReview, summary, and discussion",
  "files": [
    {
      "category": "Resource",
      "title": "questions1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/7dfb5cc3126c89f0e2f184d07663d6f3_questions1.pdf",
      "content": "Questions, week 1\n1.\nWhat is the function of a creation story? What makes the opening of Genesis\na Jewish creation story?\n2.\nWhat is the creation story of the US and what function does it serve?\n3.\nWhat is the creation story of the Jews (in Exodus) and what function does it\nserve?\n4.\nHow important is it for these creation stories to be true?\n5.\nWhy did God tell Abraham to sacrifice his only son?\n6.\nWhat was the covenant between God and Jacob (Israel)?\n7.\nWhat is the meaning of the story of the ten plagues?\n8.\nWhat is the role of the story of the golden calf in the narrative?\n9.\nWhy did the Israelites wander in the desert for 40 years?\n10.\nWhy couldn't Moses enter the promised land?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/3d18a3612cbf8e9d322a7b308c3bd609_questions2.pdf",
      "content": "Questions, week 2\n1.\nWhat is Finkelstein's point in this book?\n2.\nWhat kind of evidence does he use to prove this point?\n3.\nWhat kind of evidence is opposed to his conclusions?\n4.\nWhy does it matter which version is \"true\"?\n5.\nWhat are the arguments for and against the Exodus in 1440 BCE?\n6.\nDid Joshua conquer the Land of Israel?\n7.\nWho were the ancient Israelites; how do we identify them?\n8.\nWas there a golden age under Kings David and Solomon?\n9.\nWhat is the importance of the stables at Meggido?\n10.\nHow can we decide between the \"short\" and \"long\" histories of the Jews?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/1be7db7e13cf1b0ac07f24aafce9fbf5_questions3.pdf",
      "content": "Questions, week 3\n1.\nWhat are the primary questions King and Stager try to answer?\n2.\nWhat sources do they use?\n3.\nDo they follow the Bible or Finkelstein?\n4.\nHow was time divided (calendar, times within days)?\n5.\nHow were families organized? Who belonged to a household?\n6.\nHow old is circumcision?\n7.\nWhat were the main economic (productive) activities?\n8.\nWhat metals were used? How were they mined and purified?\n9.\nHow were goods and people transported over land and water?\n10.\nWhat did people use for money?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/1d0a4f685017ec8dbb66fc2ddf222544_questions4.pdf",
      "content": "Questions, week 4 (Goodman, pp. 1-133)\n1.\nWho was Josephus? Why is he important?\n2.\nHow did Goodman use Josephus' writings?\n3.\nWhy was Herod (ruler of Judaea, 37-6 BCE) important?\n4.\nWhat were the strengths and weaknesses of the rulers Rome appointed after 6\nBCE?\n5.\nHow did Jerusalem grow and prosper in the first century, CE?\n6.\nWas wealth holding becoming more unequal? What is the evidence? What is\nthe argument (by Goodman)?\n7.\nWho were the Sadducees, Essenes, and Pharisees? What were their roles in\nprovoking a revolt?\n8.\nHow did Jews keep themselves separate from others? (Why did they do so?)\n9.\nHow did Jewish understanding of illness differ from Greek? How does this\ndifference relate to the revolt?\n10.\nHow did Roman and Jewish concepts of government come into conflict?\n(NB: parallel with The Peloponnesian War.)\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/788a543b9f2226f1103333fd5ed1d6c6_questions5.pdf",
      "content": "Questions, week 5 (Hopkins, Chapters 2, 8, and Goodman, 2004)\n1.\nWhat are the Dead Sea Scrolls? Why are they important to Jewish history?\n2.\nWhat are the similarities and differences between the Qumran sect and\nChristianity?\n3.\nWhat can we learn from the three versions of the TV show?\n4.\nWas Hopkins trying to reconstruct a historical Jesus in Chapter 8?\n5.\nHopkins stated (p. 330), \"The variety of early Jesuses was amazing.\" What\ndid he mean? What are the implications for understanding history?\n6.\nWhat is the role of miracles in Christianity (and Judaism)?\n7.\nDid Hopkins make a good case for the success of Christianity?\n8.\nHow does this book help us to understand Jewish history?\n9.\nGoodman (2004): Why was the Temple destroyed?\n10.\nGoodman (2004): How is the succession of Roman emperors relevant to\nJewish history? (Vespasian, 69-79; Titus; Domitian,81-96; Nerva; Trajan, 98\n117; Hadrian, 117-38)\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/9f19bcce4fc302de74bd95ca34142c20_questions6.pdf",
      "content": "Questions 6 (Botticini/Eckstein and Arbel)\n1.\nWhat is the thesis of the paper by Botticini and Eckstein?\n2.\nWhat proportion of Jews were urban in the early Roman Empire?\n3.\nWhen did a majority of Jews move to urban settings?\n4.\nWhy were there so many Jews in the early Roman Empire? What happened to\ntheir number over the next millennium?\n5.\nWhat were \"Jewish occupations\" in the early Roman Empire? Around 1,000?\n6.\nWhat explains the long delay between 70 CE and Jewish urbanization?\n7.\nWhy did Maimonides move so frequently?\n8.\nWhy did Maimonides become a doctor?\n9.\nHow unusual was Maimonides' life?\n10.\nWhy did Maimonides write so much theology?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/235d984fe85307e64865b6e447633edb_questions8.pdf",
      "content": "Questions, week 7 (Cohen)\n1. Why were Medieval Christians so anti-Semitic?\n2. Why were Medieval Moslems less anti-Semitic?\n3. Who were \"dhimmi\"? How were they treated?\n4. Who paid a poll tax? Did payers of a poll tax get something in return?\n5. Were Jews subject to Medieval usury laws?\n6. Why did Jews fare better in Medieval towns?\n7. In light of Botticini and Eckstein's paper, does the answer to question 6 affect\nyour view of Cohen's book?\n8. How much socializing of other people with Medieval Jews actually went on?\n9. How important were Medieval anti-Semitic polemics?\n10. Why is there so little discussion of Medieval Jewish migration (like that of\nMaimonides) in Cohen's book?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/43bd5f537fa679d2a08cf6161b29ce6b_questions9.pdf",
      "content": "Questions, week 8 (Elon, to p. 295; Frieden)\n1.\nExplain Elon's book's title.\n2.\nHow could Moses Mendelssohn move from one world to another by walking\n100 miles (p. 1)?\n3.\nWhat are the similarities and differences between Mendelssohn and\nMaimonides?\n4.\nExplain the following sentence (p. 100), \"Rahel [Levin] and her like-minded\nfriends must have wondered how the emancipation of 1812 would have fared\nif it had been enacted a generation or two earlier, in the heyday of the\nEnlightenment, as it had in America.\"\n5.\nElon refers often to rich and poor Jews. How did this difference originate?\nHow was it continued? Were there Jews in the middle?\n6.\nHow did the events of 1848 and 1870 affect German Jews?\n7.\nExplain the following sentence (p. 233), \"In Rathenau's opinion, Jews would\nsurvive as Jews, paradoxically, through assimilation.\"\n8.\nWas it accidental that Theodor Herzl (the father of modern Zionism) was\nGerman? Or was Zionism \"Germany's gift to the Jews (p. 291)\"?\n9.\nWhat is a Shtraymel? Why was it important?\n10.\nWhat do we learn about Jewish society in Russia from \"If Not Higher\"?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/d431bfc876a53bbbd3a58b877479c306_questions10.pdf",
      "content": "Questions, week 9 (Elon, Chaps. 9, 10, and Stille)\n1. (Elon, Chap. 9) Do you agree with Einstein that Jews supported World War One\n\"because they had no contact with life in the raw but only with life on the printed\npage (p. 328)\"?\n2. (Elon, Chap. 10) Were Eisner and Rathenau assassinated because they were Jews\nor because they favored the Allies?\n3. (Stille) How could the Ovazza family \"jump right from the ghetto to the\nburgeoning middle class (p. 24)\"?\n4. When should Ettore Ovazza have abandoned fascism? 1934? 1937? 1938?\n5. Why did so many Jews join GL that it became known as a Jewish anti-fascist\ngroup (pp. 99-100)?\n6. Why did Jews in Rome have to wait until 1870 for emancipation?\n7. What determined which Di Vertolis survived the German occupation?\n8. In Genoa, why didn't people act quickly in response to Teglio's warnings? Why\ndid Teglio keep track of the first deporting rain from Genoa to Auschwitz?\n9. Given the Catholic Church's long hostility to Jews, why did the Genoese Catholic\nChurch help Jews escape the Nazis?\n10. How could the Schonheits still be living at home on November 15, 1943?\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    },
    {
      "category": "Resource",
      "title": "questions11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-914-jewish-history-from-biblical-to-modern-times-fall-2007/b651bdc6a093e8b1b9bbda08d8380f81_questions11.pdf",
      "content": "Questions, week 10 (Primo Levi)\n1. Why is the title of Levi's book anomalous? What is the form of the poem used as\nan introduction?\n2. Why was it Levi's \"good fortune to be deported to Auschwitz ... in 1944\"? (p. 9)\n3. Who was Levi working for when captured?\n4. What were the German aims in the arrivals of Jews at Auschwitz? Why did Levi\ninclude the anecdote about the guard in the truck? (p. 21)\n5. Why are all belongings subject to immediate theft if left alone?\n6. What was Steinlauf's message? (p. 41)\n7. Why and how could markets emerge in the Lager? What was the currency?\n8. What determined who survived for long in the Lager? (Some examples, Chap. 9)\n9. (Dawidowicz) What makes the Holocaust unique?\n10. (Dawidowicz) Why does Dawidowicz argue it is wrong \"that Auschwitz would\nbecome a metaphor and a paradigm for evil\"? (p. 15)\nCite as: Peter Teimn. Course materials for 21H.914: Jews from Biblical to Modern Times, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu/), Massachusetts Institute of Technology. Downloaded on [DD Month\nYYYY]."
    }
  ]
}