{
  "course_name": "Justice",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Political Science",
    "Sociology",
    "Social Justice",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Political Science",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nNone\n\nCourse Description\n\nThis course explores the ideal of social justice. What we want to know is what makes a society just. Must a society protect individual liberties in order to be just? Which ones? Must a society ensure equality in order to be just? What kind? Can a society ensure both liberty and equality? We will approach these questions by studying three opposing theories of justice--utilitarianism, libertarianism, and egalitarian liberalism--each foundational to contemporary political thought and discourse.\n\nCourse Requirements\n\nPapers\n\nThis course is a HASS-D/H and Communication Intensive (CI) subject; you must write three papers of 6-7 (double-spaced) pages each. You must also revise and resubmit at least one paper. The procedure for rewriting a paper is as follows. Once your first paper has been graded, it will be returned to you with comments. You may then decide whether you wish to rewrite the first paper. If you choose to do so, you must ensure that your rewrite is responsive to the comments on the first version. The grade on the rewrite will depend on how well you have addressed the comments. The grade on the rewrite may be lower than the original grade if the rewrite is not responsive to the comments.\n\nYou are not required to rewrite the first paper. You may rewrite the second paper instead. Or you may rewrite both the first paper and the second paper. However, there are no rewrites on the third paper. When you submit a rewrite, you must also include the original version with the grader's comments.\n\nThe final grade for papers that are rewritten will be a weighted combination of the grade on the first version and the rewrite, with the rewrite counting twice as much as the first version. The paper topics will be given out ahead of time. If you wish to write on a topic of your own design, please submit a short proposal for approval. Papers on unapproved topics will not be accepted.\n\nQuizzes\n\nThere will be three quizzes. The questions are designed to help you prepare for writing your papers. For each quiz, you must submit a response of no more than 1-2 (double-spaced) pages.\n\nParticipation\n\nThe remainder of your grade will be based on your oral participation--the oral communications part of the class. To pass this requirement, you must regularly attend lecture and recitation. To do well, you must participate thoughtfully in class discussions, in lecture and in recitation. The best way to prepare yourself to make informed and thoughtful contributions is to devote time to careful study of the assigned texts. You will need time and effort to understand and be able to evaluate the claims and arguments in them. To help you, there are questions listed after each reading assignment. Think about these questions as you are reading.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nFirst paper\n\n15%\n\nSecond paper\n\n20%\n\nThird paper\n\n25%\n\nQuizzes (3)\n\n15%\n\nOral participation\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "Paper 1 Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/a056c8c3b20dc19a4b38197c891285a9_MIT24_04JS12_paper1.pdf",
      "content": "Paper 1\n1. \"If all mankind minus one, were of one opinion, and only one person were of the\ncontrary opinion, mankind would be no more justified in silencing that one person\nthan he, if he had the power, would be justified in silencing mankind\"\n(Mill, On Liberty, ch. 2).\nReconstruct and critically evaluate Mill's argument for this claim.\n2. Mill claims that no adult of sound mind should ever be coerced merely for his or\nher own good.\nReconstruct and critically evaluate Mill's argument for this claim.\n\nMill, John Stuart. On Liberty. This work is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 1 Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/7d4bd5dc2c27860b22b71ef77315bc42_MIT24_04JS12_quiz1.pdf",
      "content": "Quiz 1\n\nAnswer ONE of the following questions:\n\n1. \"If all mankind minus one, were of one opinion, and only one person\nwere of the contrary opinion, mankind would be no more justified in\nsilencing that one person than he, if had the power, would be justified in\nsilencing mankind\" (On Liberty, ch. 2).\n\nWhat is Mill's argument for this claim?\n\n2. \"Acts of whatever kind, which, without justifiable cause, do harm to\nothers, may be, and in the more important cases absolutely require to\nbe, controlled by the unfavorable sentiments, and, when needful, by the\nactive interference of mankind. The liberty of the individual must be\nthus far limited; he must not make himself a nuisance to other people.\nBut if he refrains from molesting others in what concerns them, and\nmerely acts according to his own inclination and judgment in things\nwhich concern himself, ... he should be allowed, without molestation, to\ncarry his opinions into practice at his own cost\" (On Liberty, ch. 3).\n\nWhat is Mill's argument for this claim?\n\nMill, John Stuart. On Liberty. This work is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper 2 Topic",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/4385c66715f3d06a676680b7260f040a_MIT24_04JS12_paper2.pdf",
      "content": "Paper 2\n\n\"The minimal state is the most extensive state that can be justified. Any state\nmore extensive violates people's rights\"\n(Nozick, Anarchy, State, and Utopia, p. 149).\nMany people believe that redistributive taxation is a requirement of justice.\nThey think that the state should tax and redistribute property to ensure that\nno one lives in desperate poverty, to ensure that everyone has equally good\nopportunities in life, and so on.\nRobert Nozick, by contrast, thinks that this view is simply mistaken. According\nto Nozick, the state may justly confiscate and return stolen goods--but any\nfurther redistribution of property is unjust.\nNozick argues for his conclusion in two ways. First, he tries to undermine the\nargument for more extensive redistribution. He does this by challenging all\nprinciples of justice that require a \"pattern,\" whether a pattern of income, or\nof well-being, or of opportunity, etc. Second, he argues for a historical\nconception of justice, according to which \"[w]hatever happens from a just\nsituation by just steps is itself just,\" no matter what the resulting pattern of\nproperty, opportunity, well-being, etc.\nDoes Nozick succeed in showing that all redistribution, other than to return\nstolen goods, is unjust? Defend your answer by reconstructing and critically\nevaluating his two-part argument.\nNozick, Robert. Anarchy, State, and Utopia. Basic Books, 1977. All rights reserved. This content is\nexcluded from our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 2 Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/e120fda66710289805dd38016f59302c_MIT24_04JS12_quiz2.pdf",
      "content": "Quiz 2\n\n\"The minimal state is the most extensive state that can be justified. Any state\nmore extensive violates people's rights\"\n(Nozick, Anarchy, State, and Utopia, p. 149).\nMany people believe that redistributive taxation is a requirement of justice.\nThey think that the state should tax and redistribute property to ensure that\nno one lives in desperate poverty, to ensure that everyone has equally good\nopportunities in life, and so on.\nRobert Nozick, by contrast, thinks that this view is simply mistaken. According\nto Nozick, the state may justly confiscate and return stolen goods--but any\nfurther redistribution of property is unjust.\nNozick argues for his conclusion in two ways.\nFirst, he tries to undermine the argument for more extensive redistribution.\nHe does this by challenging all principles of justice that require a \"pattern,\"\nwhether a pattern of income, or of well-being, or of opportunity, etc.\nSecond, he argues for a historical conception of justice, according to which\n\"[w]hatever happens from a just situation by just steps is itself just,\" no matter\nwhat the resulting pattern of property, opportunity, well-being, etc.\nIn your own words, reconstruct Nozick's argument against principles of\njustice that require a \"pattern.\"\nNozick, Robert. Anarchy, State, and Utopia. Basic Books, 1977. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more infor\n\nmation, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Paper 3 Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/e051116e206a6e7145abd3775e879b57_MIT24_04JS12_paper3.pdf",
      "content": "Paper 3\n\n1. \"It may be expedient but it is not just that some should have less in order that\nothers may prosper. ... [T]he division of advantages should be such as to draw\nforth the willing cooperation of everyone taking part in it, including those less\nwell situated. The two principles ... seem to be a fair basis on which those better\nendowed, or more fortunate in their social position, neither of which we can be\nsaid to deserve, could expect the willing cooperation of others when some\nworkable scheme is a necessary condition of the well-being of all\"\n(Rawls, A Theory of Justice, ยง3).\nReconstruct and critically evaluate Rawls' argument for this claim. In your\nreconstruction, be sure to explain both (i) why Rawls thinks that the two principles\nare a fair basis for social cooperation (i.e., the \"veil of ignorance\" argument), and\n(ii) why he thinks that the better endowed cannot claim to deserve even greater\nrewards than the second principle would allow.\n\n2. G. A. Cohen claims that \"the justice of a society is not exclusively a function of its\nlegislative structure, of its legally imperative rules, but also of the choices\npeople make within those rules\"\n(Rescuing Justice and Equality, p. 123).\n\nReconstruct and critically evaluate G. A. Cohen's argument for this claim.\n3. \"[M]ost U.S. citizens think that everyone, including the poor, should obey the\nlaw and that all able-bodied, working-age citizens ... should support themselves\nthrough legitimate work, even if that work is hard, low-paying, and unsatisfying.\nThus, when the ghetto poor engage in criminal activity or refuse to work\nlegitimate jobs, this is widely regarded as a failure of reciprocity on their part.\nThis would be the wrong conclusion to draw, however. ... [W]hen the ghetto\npoor in the United States refuse to accept menial jobs or to respect the authority\nof the law qua law, they do not thereby violate the principle of reciprocity or\nshirk valid civic obligations\"\n(Shelby, \"Justice, Deviance, and the Dark Ghetto,\" pp. 146, 151).\n\nReconstruct and critically evaluate Shelby's argument for this claim.\nRawls, John. A Theory of Justice: Original Edition. Belknap Press of Harvard University Press, 2005. All rights reserved.\nCohen, G. A. Rescuing Justice and Equality. Harvard University Press, 2008. All rights reserved.\nShelby. Tommie. \"Justice, Deviance, and the Dark Ghetto.\" Philosophy and Public Affairs 35, no. 2 (2007): 126-60.\nAll rights reserved.\n\nThis content is excluded from our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Quiz 3 Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/4fe02941b424cf581985d8049283bcc8_MIT24_04JS12_quiz3.pdf",
      "content": "Quiz 3\n\n\"It may be expedient but it is not just that some should have less in order that\nothers may prosper. ... [T]he division of advantages should be such as to draw\nforth the willing cooperation of everyone taking part in it, including those less\nwell situated. The two principles ... seem to be a fair basis on which those\nbetter endowed, or more fortunate in their social position, neither of which\nwe can be said to deserve, could expect the willing cooperation of others when\nsome workable scheme is a necessary condition of the well-being of all\"\n(Rawls, A Theory of Justice, ยง3).\nAnswer ONE of the following questions:\n1. Why does Rawls think that the two principles are a fair basis for social\ncooperation?\nTo answer this question, you must (i) clearly state the precise meaning\nof Rawls' two principles and (ii) reconstruct the \"veil of ignorance\"\nargument for the two principles over the principle of utility.\n\n2. Why does Rawls think that the better endowed cannot claim to deserve\neven greater rewards than the second principle would allow?\n\nTo answer this question, you must (i) clearly state the precise meaning\nof Rawls' second principle and (ii) explain why Rawls thinks it is a\nmistake to suppose that \"income and wealth ... should be distributed\naccording to moral desert\" (ยง48).\nRawls, John. A Theory of Justice. Belknap Press of Harvard University Press, 2005. All rights reserved. This\ncontent is excluded from our Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 2 Notes: Classical Utilitarianism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/0948c72302f867a9fb9a28499c01c388_MIT24_04JS12_lec02.pdf",
      "content": "JUSTICE\nLecture 2 - Classical Utilitarianism\n1. The Pinto Affair\n\n2. Cost/Benefit Analysis in law and public policy\n\n3. Two distinctions:\n\na. Empirical vs. normative claims\n\nb. Theory of society and politics vs. theory of social and political morality\n\n4. Utilitarianism as a comprehensive theory of morality\n\n5. The Principle of Utility, or the Greatest Happiness Principle\n\n6. The argument for the Principle of Utility\n\na. \"Consequentialist\" view of right action (rightness is a function of consequences)\n\nb. \"Hedonist\" theory of value (what matters intrinsically is happiness, understood as\npleasure and the absence of pain)\n\nc. Impartiality (everyone's happiness counts equally)\n\nd. Sum-maximization (what is to be maximized is the sum of happiness)\n\n7. Implications of the Principle of Utility\n\na. Perfect altruism?\n\nb. Enforcement of majority likes and dislikes?\n\nc. Domain of civil liberties (where punishment \"unprofitable\")\n\nd. Meaning of rights\n\n8. A note on Bentham\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 3 Notes: Communal Norms",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/0a125c3e48e3147db5e51d9234c79119_MIT24_04JS12_lec03.pdf",
      "content": "JUSTICE\nLecture 3 - Communal norms\n1. Last time:\n\na. The parts of the Principle of Utility and the case for them\n\nb. Implications of the Principle of Utility\n\ni. A comprehensive (personal and political) morality\n\nii. Legal protection for unpopular behavior where punishment \"unprofitable\"\n\niii. Rights understood as means to maximizing happiness\n\n2. Civil liberties: will they be secure if we accept utilitiarianism?\n\n3. Bowers v. Hardwick\n\na. Due Process Clauses guarantee a fundamental right to privacy, but\n\nb. Right to privacy does not extend to protection for homosexual conduct, because\n\ni. Argument A: \"no connection\" with family/marriage/procreation\n\nii. Argument B: majority's conviction is a \"rational basis\" for criminalization\n\n4. Lawrence v. Texas\n\na. Right to privacy extends to protection for matters of sexual intimacy, because\n\ni. Argument A: the argument from \"autonomy\"\n\nii. Argument B: majority's conviction insufficient basis for criminalization\n\n5. How to weigh the majority's antipathy towards unpopular private conduct?\n\na. View 1: there are no fundamental rights, and antipathy always counts for something\n\nb. View 2: majority's antipathy counts only where no fundamental right at stake\n\nc. View 3: majority's antipathy never counts, even when no fundamental right at stake\n\n6. Benthamite utilitarianism and civil liberties\n\na. Does Bentham's view lead to the right result?\n\nb. For the right reason?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 4 Notes: Revisionist Utilitarianism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/d7fa63daa53786cbf55d2f7473347c37_MIT24_04JS12_lec04.pdf",
      "content": "JUSTICE\nLecture 4 - Revisionist Utilitarianism\n1. Last time\n\na. How to weigh majority's antipathy towards unpopular private conduct?\n\nb. Supreme Court: majority's antipathy doesn't count where fundamental rights at stake\n\nc. Bentham: no fundamental rights + majority's antipathy always counts for something\n\nd. Does utilitarianism support civil liberties? For the right reason?\n\n2. Mill's revisionist utilitarianism\n\na. Measure of a just law/action is (still) its consequences, how much good it produces\n\nb. Pleasure is (still) the only thing that is good in itself, but\n\nc. Some pleasures are of higher quality, can't be outweighed by lower pleasures\n\nd. Civil liberties are required to maximize the higher pleasures\n\n3. Mill's distinction between higher and lower pleasures\n\na. A life is better--happier--when it contains higher pleasures, even if less satisfaction\n\nb. Higher pleasures are the ones preferred by (all or almost all) competent judges\n\nc. Competent judges \"decidedly prefer\" pleasures that come from exercise of intellect\n\n4. Why are intellectual pleasures better/higher for everyone?\n\na. Some people prefer other pleasures. Why should they defer to \"competent judges\"?\n\nb. Is Mill's argument elitist?\n\n5. Why are intellectual pleasures better/higher?\n\na. Use of our intellectual faculties awakens a sense of our own dignity\n\nb. Sense of our own dignity produces a desire to develop & exercise our higher faculties\n\nc. Once we have this desire, we can't be happy without engaging our higher faculties\n\n6. Is the development/exercise of our faculties valuable only because it brings us pleasure?\n\na. Is it intrinsically valuable to develop and exercise your faculties?\n\nb. To be a certain kind of person? Actually to experience certain things?\n\n7. Mill's distinct view of the special importance of liberties:\n\na. Bentham:\n\ni. All pleasures/pains equal; none contributes more to happiness than any other\n\nii. Civil liberties founded on general value of avoiding pain (e.g. from punishment)\n\niii. Civil liberties not founded on anything of special value\n\nb. Mill:\n\ni. Pleasures derived from developing & using our distinctive faculties are better\n\nii. Civil liberties are necessary for developing & exercising our distinctive faculties\n\niii. Civil liberties founded on special, higher value of developing & using our faculties\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 5 Notes: The Harm Principle",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/072deb3bd9f058dcf675c692b81d5577_MIT24_04JS12_lec05.pdf",
      "content": "JUSTICE\nLecture 5 - The Harm Principle\n1. The fundamental question in Mill's On Liberty\n\na. The scope of \"social and civil liberty\", or\n\nb. The limits of society's legitimate authority over the individual\n\n2. Stages of progress in the \"struggle between Liberty and Authority\"\n\na. Before advent of popular government: subjects against oppressive rulers\n\nb. After advent of popular government: individual against society\n\n3. \"Tyranny of the majority\" by way law and custom, and the need for a limit on interference\n\n4. The Harm Principle\n\na. A filter for reasons we might invoke to justify coercion\n\nb. Harm to others is the only reason that can justify coercion\n\nc. Other reasons can never justify coercion, e.g.:\n\ni. Paternalistic reasons\n\nii. Moralistic reasons and reasons of propriety\n\niii. Perfectionist reasons\n\n5. Implications of the Harm Principle\n\na. Freedom of all thought and conduct not harmful to others\n\n6. Mill's utilitarian justification of the Harm Principle\n\na. Even when they don't harm others, people can sometimes act in ways that are\nharmful to themselves or distressing to others\n\nb. But we should not coerce them in these cases, because\n\nc. Consequences for human happiness will be better if we use persuasion, not coercion\n\nd. Why? Because coercion stunts the development and exercise of our distinctive\nhuman faculties--our \"individuality\"--and this weighs much more heavily\n(contributes much more to happiness) than any benefits gained from restricting\nconduct that is not harmful to others\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 6 Notes: The Utility of Speech",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/836a417a49e2d408168ac57273618b33_MIT24_04JS12_lec06.pdf",
      "content": "JUSTICE\nLecture 6 - The Utility of Speech\n1. Mill's project in On Liberty\n\na. Mill's concern: the existence/threat of social tyranny, by way of law and custom\n\nb. Mill's question: when does society have the moral right to coerce the individual?\n\nc. Mill's answer: only when it's necessary to prevent harm to others (Harm Principle)\n\n2. The Harm Principle:\n\na. A filter for reasons we might invoke to justify coercion\n\nb. Permits coercion only to prevent harm to others\n\nc. Forbids coercion for any other reason (e.g., paternalistic, moralistic, perfectionist)\n\nd. Demands freedom of all speech & conduct-not-harmful-to-others\n\n3. Mill's argument for the Harm Principle:\n\na. We should always do what will maximize happiness\n\nb. Allowing freedom of all speech & conduct-not-harmful-to-others will maximize happiness\n\n4. Why does freedom of speech maximize happiness? Why not censor unpopular or false doctrines?\n\na. Because censorship of unpopular doctrines can deprive everyone of the benefits of truth (in\nscience, politics, morals)\n\nb. Because censorship of false doctrines deprives everyone of the benefit of (being confronted\nwith) falsehood: being \"intellectually active\"\n\n5. Why does freedom of conduct-not-harmful-to-others maximize happiness? Why not more coercion?\n\na. Because the best--happiest--ways of living will be discovered only if there is room for\n\"experiments in living\" and \"variety of characters\"\n\nb. Because freedom of conduct-not-harmful-to-others is necessary for \"individuality\"--\"one of\nthe principal ingredients in human happiness\"--whereas coercion stunts \"individuality\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 7 Notes: The Utility of Liberty",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/abeb141f7bece3d13fb3faf66cdd026a_MIT24_04JS12_lec07.pdf",
      "content": "JUSTICE\nLecture 7 - The Utility of Liberty\n1. According to Mill:\n\na. We should never coerce anyone except to prevent harm to others (the Harm Principle)\n\nb. Not because everyone has an abstract right to do as he pleases so long as he doesn't harm others\n\nc. But because this will maximize human happiness in the long-run (Utilitarian justification)\n\n2. Why does freedom of expression maximize happiness? Why not censorship of unpopular doctrines?\n\na. Not because the pains and frustrations of those who are silenced always outweigh the\npains and frustrations of the offended majority\n\nb. But because the most important costs of censorship fall on the audience: the entire community\n\n3. What are the costs to everyone of censoring unpopular beliefs and doctrines?\n\na. Being fallible, censors will sometimes hamper progress by mistakenly censoring true,\nhappiness-promoting beliefs and doctrines\n\nb. Censorship of false doctrines deprives everyone of the benefit of (being confronted with)\nfalsehood: being \"intellectually active,\" examining and appreciating the reasons for their\nown beliefs\n\n4. Why does freedom of tastes and pursuits maximize happiness? Why not enforce conventional\nnorms and prevailing customs?\n\na. Not because the pains of those who are forced to conform always outweigh the pains of the\nmajority distressed by seeing unconventional conduct\n\nb. Because the most important costs of \"the despotism of custom\" fall on the entire community\n\n5. What are the costs to everyone when conventional norms and prevailing practices are enforced?\n\na. Prevailing customs may be based on misunderstanding of what makes people happy; to\ndiscover the best customs/ways of living, there must be room for \"experiments in living\"\n\nb. Not every good custom is suited to every character or every person; if (most) persons are to\nbe happy, there must be great \"variety of characters,\" each with their own supporting customs\n\nc. Accepting even a good, suitable character or custom merely \"as custom\" does not deploy or\ndevelop a human being's distinctive faculties\n\nd. Developing one's own character, and living a life that is the product of one's own reasoned,\nchoices--i.e., \"individuality\"--requires having the freedom to depart from prevailing\ncustom; and \"individuality\" is \"one of the principal ingredients in human happiness\"\n\n6. Two potential objections to Mill's argument:\n\na. Are all restrictions on offensive or hateful speech impermissible? Are they impermissible\nbecause they pose a threat to a people being \"intellectually active\"?\n\nb. Are all paternalist restrictions on conduct impermissible? Are they impermissible because\nthey pose a threat to \"individuality\"?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 8 Notes: The Utility of Democracy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/9d8ed2366d486d19fd1e892b80f3b1eb_MIT24_04JS12_lec08.pdf",
      "content": "JUSTICE\nLecture 8 - The Utility of Democracy\n1. So far:\n\na. We have considered the Principle of Utility as the ultimate principle of justice\n\nb. We have explored some of its implications for the content of laws and social practices\n\nc. But the Principle of Utility also has implications for the form of government\n\n2. Utilitarianism as a theory of democracy\n\na. Everyone should have rights of political participation, including the right to vote\n\nb. Not because there is an \"inalienable\" right to participate in collective decision-making\n\nc. But because popular government has \"the greatest amount of beneficial consequences\"\n\n3. Why does representative government have better results than non-representative government?\n\na. Influence on the content of laws: participation provides better protection against oppression\n\nb. Influence on the character of the governed: participation has important educative effects\n\n4. Mill on the beneficial educative effects of participation\n\na. Having the vote gives people the sense that the laws to which they are subject are\nchangeable by them, not merely \"visitations of Nature\" or unchangeable obstacles\n\nb. Political discussion expands people's thoughts beyond their daily tasks and wants; they are\nled to form opinions on larger matters of common concern\n\nc. Participation in the exercise of public functions (voting, serving on a jury, holding a public\noffice) develops the ability and desire to act impartially and to pursue the common good\n\n5. Government should be organized so as to enhance these beneficial educative effects, through e.g.:\n\na. Opportunities for ordinary citizens to participate in the exercise of public functions\n\nb. Norms of open, public discussion by government officials and elected representatives\n\nc. The Single Transferable Vote\n\n6. But mass participation can also have bad consequences, since at present the majority has\n\na. Low \"technical competence\"\n\nb. Low \"moral competence\"\n\n7. These \"dangers of incompetence\" must somehow be addressed if popular government is to be\njustified by appealing to its results\n\n8. Mill's proposal\n\na. No group should be permanently excluded from political participation: this would forgo\nthe beneficial educative consequences of participation\n\nb. But, a basic literacy and numeracy test should be required of all persons who wish to vote\n\nc. And, multiple votes should be given to persons of greater mental competence\n\n9. A potential objection to the utilitarian justification of democracy\n\na. It be wrong to give educated persons more votes even if doing so would have the best results\n\nb. Therefore, the utilitarian justification of democracy is defective\n\nc. And, the Principle of Utility itself must be mistaken\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 9 Notes: Rights as side-constraints",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/a26644412ef35f3e447619f3829e8fda_MIT24_04JS12_lec09.pdf",
      "content": "JUSTICE\nLecture 9 - Rights as side-constraints\n\n1. Utilitarianism as a consequentialist theory of morality\n\n2. Some problem cases for consequentialist theories\n\na. The trolley problem\n\nb. The survival lottery\n\n3. Distinguish two different objections to utilitarianism\n\na. Utilitarianism misunderstands what is intrinsically valuable\n\nb. Utilitarianism treats all rights as derivative, but some rights are fundamental\n\n4. Distinguish two ways of taking fundamental rights into account\n\na. Non-violation of rights is taken to be a goal of action\n\nb. Non-violation of rights is taken to be a side-constraint on action\n\n5. Consequentialist theories must treat non-violation of rights as a goal of action\n\na. What if punishing the innocent leads to fewer rights violation?\n\nb. What if killing civilians in war leads to fewer rights violations?\n\n6. Non-consequentialist theories treat non-violation of rights as a side-constraint on action\n\n7. Nozick's fundamental libertarian side-constraint against aggression\n\n8. Consequences of Nozick's libertarian side-constraint\n\na. Economic redistribution is unjust\n\nb. The only kind of state that can be justified is a minimal state\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 10 Notes: Against Redistribution",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/84882844b401ae08fe56be887f199575_MIT24_04JS12_lec10.pdf",
      "content": "JUSTICE\nLecture 10 - Against Redistribution\n1. Last time:\n\na. The rejection of utilitarianism as a consequentialist theory of morality, justice and rights\n\nb. The non-utilitarian account of rights: rights as constraints on the pursuit of worthy goals\n\nc. The fundamental right not to be subjected to force and aggression (e.g. to benefit others)\n\n2. Context for today's discussion\n\na. Large and growing economic inequalities in America and other countries\n\nb. Disputes about the justice of economic inequalities\n\n3. Utilitarianism supports redistributive taxation in the direction of more equality\n\na. Because of the declining marginal utility of wealth\n\nb. So long as redistributive taxation does not reduce aggregate economic output/growth\n\n4. Nozick's two central claims in Anarchy, State and Utopia\n\na. The minimal state is the most extensive state that can be justified\n\nb. Any state more extensive than the minimal state violates people's rights\n\n5. Nozick's argument against a more extensive, redistributive state\n\na. Arguments in favor of a redistributive state typically invoke some \"patterned\" principle\n\nb. But all such principles have unacceptable implications (they require violating people's rights)\n\n6. Nozick's two main arguments for why all patterned principles are unacceptable\n\na. Maintaining a pattern requires continual interference with people's liberty to do what they\nplease with what they own\n\nb. Maintaining a pattern requires redistributive taxation of income from labor, but taxation\nincome from labor is on a par with forced labor: it gives others a property right in you,\nyour actions, and your labor\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture 11 Notes: The Entitlement Theory",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/62cf443dee760249ce31f7ea1b87ce6a_MIT24_04JS12_lec11.pdf",
      "content": "JUSTICE\nLecture 11 - The Entitlement Theory\n1. Nozick's two central claims in Anarchy, State and Utopia\n\na. The minimal state is the most extensive state that can be justified\n\nb. Any state more extensive than the minimal state violates people's rights\n\n2. Nozick's argument against a more extensive, redistributive state\n\na. The typical justification for a redistributive state rests on some patterned principle\n\nb. But, patterned principles should be rejected, because\n\ni. \"liberty upsets patterns\"\n\nii. \"taxation of income from labor is on a par with forced labor\"\n\n3. Nozick's Entitlement Theory of distributive justice:\n\na. Nozick's Entitlement Theory is not patterned, but \"historical\": the justice of people's\nholdings - i.e., whether what people have, they have justly - \"depends upon what has\nactually happened\"\n\nb. The theory consists of three principles\n\ni. First principle specifies how unowned things can come to be owned justly\n\nii. Second principle specifies how (justly owned) things can be transferred justly\n\niii. Third principle says what to do about unjust acquisitions & unjust transfers\n\nc. According to the theory:\n\ni. A thing is owned justly if it was originally acquired justly & always transferred justly\n\nii. A person is \"entitled\" to the resources he or she possesses if and only if he or she\nacquired these resources through\n\n1. a just original acquisition (as specified by the first principle) OR\n\n2. a just transfer (as specified by the second principle) OR\n\n3. as compensation for previous injustice (as specified by the third principle)\n\niii. A given \"distribution\" of resources is just if everyone is entitled to the resources\nthey possess under the distribution\n\n4. Nozick on the (first) principle of just original acquisition:\n\na. How can one justly come to own a previously unowned thing?\n\ni. By \"mixing one's labor\" with it?\n\nii. By leaving \"enough and as good\" for others?\n\niii. By not making others worse off through one's act of appropriation\n\n5. Nozick on the (second) principle of just transfers:\n\na. A transfer of resources involving force or fraud is unjust\n\nb. Why? Because such a transfer violates a person's ownership of himself and his goods,\ninsofar as he no longer decides what he will do, or what will happen to his goods\n\n6. The (third) principle of rectification of injustice:\n\na. Applies to cases of unjust original acquisitions and cases of unjust transfers\n\nb. Asks what would have happened if the unjust acquisition/transfer had not occurred\n\nc. Calls for measures (e.g., restitution, compensation) that return the victim to the\ncondition in which he or she would have been if the injustice had not occurred\n\nd. But does not allow compensatory measures that would violate rights of unconnected\nthird-parties\n\n7. What are the implications of the Entitlement Theory for contemporary societies?\n\na. According to the Entitlement Theory, is the current distribution of property just?\n\nb. Does the current distribution reflect historical injustices that haven't yet been rectified?\n\ni. Who are the present-day victims of historical injustice? Who are its beneficiaries?\n\nii. Are the victims worse off than they would have been had the injustice not occurred?\n\nc. If there are as-yet uncompensated victims of historical injustice, what measures would\nbe sufficient to compensate them?\n\nd. Of these measures, which ones may the state use without violating the ownership rights\nof third parties (people who neither committed nor benefited from the injustice)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 1 - Procedural Stuff / Utilitarianism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/1353a3d6382af1d3e188b88ec7f4d6a9_MIT24_04JS12_Week1.pdf",
      "content": "Justice\nTA: Sophie Horowitz\n2/17/2012\n\nProcedural Stuff\n\nTo pass the class:\n\n-Come to lecture. Do the reading beforehand.\n\n-Do all of the writing assignments.\n\n-Come to section. Attendance and participation matter.\n\n-Absence policy: If you miss section, email me! I'll harass you if you don't.\n-Miss more than once and you'll have to make it up (probably by writing a short\nresponse; we'll work it out as it comes up.)\n\n-Your section grade is 25% of the final.\n\n-5% will be a short (5 mins, max) p resentation in section.\nYou will have the questions beforehand.\nAt the beginning of section everyone will have time to think/review.\nen I'll call on someone to present.\n-5% will be a writing workshop, which we will hold before the first paper is due. If\nyou participate, you will automatically get the 5%.\n-e other 15% will depend on attendance and participation.\n\nTo do well and enjoy the class:\n\n-Come to section ready to discuss the readings.\n\n-Come see me if you're confused or need help.\n-Start your papers early! I am always happy to meet with you to discuss drafts.\n\nUtilitarianism\n\n1. State Bentham's Principle of Utility:\n\n2. Four important aspects of Utilitarianism:\n\nConsequentialism\n\nHedonism\n\nImpartiality\n\nSum-maximization\n\n3. How would a Utilitarian explain why...\n\n-You should help a little old lady across the street, even if it makes you late for class?\n\n-You shouldn't kick puppies, even if it's fun?\n\n-You should kick puppies, if it's really fun?\n\n3. Rights: distinguish between the legal sense and the moral sense.\n\nExamples of moral rights:\n\nExamples of legal rights:\n\n4. What does Utilitarianism say about rights?\n\nA. Moral rights - do they exist?\n\nB. Legal rights - when should they exist?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 2 - Assessing and Reconstructing Arguments",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/f22d6263f11f3ad47e68efa2d02427be_MIT24_04JS12_Week2.pdf",
      "content": "Justice\nTA: Sophie Horowitz\n2/24/2012\n\n1. Assessing arguments\n\nLook at these arguments with the person next to you. Are they good arguments? If not,\nwhat's wrong with them?\n\nA.\nP1. All dogs go to heaven.\n\nP2. Charlie is a dog.\n\nC. Charlie will go to heaven.\n\nB.\nP1. If the moon is made of green cheese, then cows jump over it.\n\nP2. e moon is made of green cheese.\n\nC. Cows jump over the moon.\n\nC.\nP1. If it's raining, then the streets are wet.\n\nP2. e streets are wet.\n\nC. It's raining.\n\nD.\nP1. All apples are fruits.\n\nP2. Some fruits are red.\n\nC. Some apples are red.\n\nE.\nP1. If today is Friday, tomorrow will be Saturday.\n\nC. Tomorrow will be Saturday.\n\nF.\nP1. If Utilitarianism is right, we should always act so as to maximize happiness.\n\nP2. Sometimes we should not act so as to maximize happiness.\n\nC. Utilitarianism is wrong.\n\nNow that we've looked at some arguments, we can introduce some terminology:\n\nAn argument is valid iff it's impossible for the premises to be true and the conclusion false.\n-Validity is a property of the argument's form.\n-It doesn't matter whether the premises or conclusion are true.\n\nAn argument is sound iff (a) i t's valid, and (b) t he premises are true.\n\n-It doesn't matter whether you know if the premises are true.\n\nAn argument can also be convincing (for a person S) i f it's valid, and before understanding\nthe argument, S believes the premises but not the conclusion.\n\nAre arguments 1-5 valid? Are they sound?\n2. Reconstructing arguments\n\nYou will have to reconstruct arguments as part of your quizzes and papers for this class.\nSometimes you have to fill in missing premises in order to make a valid argument.\nA. Put these informal arguments in premise/conclusion form. Are they valid? Sound?\n\n\"Anyone who goes to Harvard is a total jerk. I know because I met my roommate's brother,\nwho goes to Harvard, and he is a total jerk.\"\n\n\"You shouldn't feed chocolate to the dog. Chocolate makes him sick.\"\nB. Another partner exercise:\n\nNozick writes, \"We learn that something matters to us in addition to experience by\nimagining an experience machine and then realizing that we would not use it.\"\n\nConstruct an argument in premise/conclusion form using the experience machine as an\nargument against hedonic utilitarianism.\nNozick, Robert. Anarchy, State, and Utopia. Basic Books, 1977. All rights reserved.\nThis content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 3 - Final Paper Tips",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/25d85c1091d56520951cfaf0a3147963_MIT24_04JS12_Week3.pdf",
      "content": "Justice\n3/2/2012\nTA: Sophie Horowitz\n\nI. What your final paper should look like\n\n1. Start off by setting out the question. In the first paragraph, raise the question you are\ngoing to answer. Get right to the point.\n\n2. Tell your reader where you're going. Somewhere near the beginning of the paper - in the\nfirst or second paragraph - lay out a map for the paper. For example:\n\"In this paper, I will argue that ____. I will start by considering X's claim that\n____, and then raise two objections to it. I will conclude that _____.\"\nYour paper should have a thesis. Write it out in one clear, succinct sentence.\n\n3. In the body of the paper:\nFirst explain Mill's view (like you did on the quiz).\nen consider one or two objections, and think about how Mill would reply.\n4. Provide a roadmap along the way. In each section, remind the reader what you're\naccomplishing in that section. Hit the reader over the head with it!\n\n5. Sum it all up at the end. In your conclusion, say exactly what you have argued for. (Don't\nworry about making connections to topics outside of philosophy.)\n\n6. Cite your sources.\n\nII. What we look for when grading\n\n1. Clarity: write in a clear and understandable way. (Don't worry about flowery language.)\n\n2. Accuracy: show that you understand the position you are discussing; consider relevant\nobjections.\n\n3. Original thought: engage with the material in a thoughtful, original way.\n-Try to push an argument farther than we did in lecture. How could someone\nrespond to Mill? What might be the next step in the debate?\n-is is hard to aim for; usually, good original thoughts will not occur to you unless\nyou have clearly understood the topic and worked hard to articulate it in your paper.\nA-range papers tend to accomplish (1), (2), and (3) w\nell.\nB-range papers tend to accomplish (1) a nd (2) w\nell, but with some minor problems; they\nmay make some minor errors or have some unclear points.\nC-range papers tend to have serious problems with (1) o r (2) - they are very unclear, or\nmisstate the views that they are discussing.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 4 - Nozick's Objection To Utilitarianism / Nozick's Positive View",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/4be2dfa32a312d36e2fba0a03a5a2418_MIT24_04JS12_Week4.pdf",
      "content": "Justice\n\nTA: Sophie Horowitz\n3/8/2012\n\nI. Nozick's objection to Utilitarianism\n\nSetup: Consider a case where we chop up Ryan to give his organs to five people. (We can\nimagine that this is part of an efficiently-run Survival Lottery, to make it cleaner.)\nUtilitarianism says we should chop him up. But intuitively, this seems bad; it seems like\nRyan's rights are being violated.\n\nNozick considers two objections to Utilitarianism:\n\nObjection 1: Keep consequentialism, reject hedonism. Be a \"Utilitarian of rights\".\n\nNew proposal: \"Act so as to minimize rights violations\".\nWhat's wrong with this new proposal?\n\nObjection 2: Get rid of consequentialism, view rights as side-constraints.\nAccording to Nozick, why does consequentialism gets the wrong answer about chopping\nup Ryan?\n\nII. Nozick's positive view\nNozick's view is that rights are side-constraints. What does that mean?\n\nIn particular, Nozick thinks there is a fundamental side-constraint against aggression. What\ndoes he mean? To help think about this, compare the following two cases:\n\n1. Chopping U\np Ryan (again)\n\n2. Volcanic Islands\nRyan has healthy organs; five other people need\nAll of the TAs and Prof. Stancyzk are shipwrecked and\ntransplants. You're the surgeon.\nwash up on two separate islands. ere are active volcanoes\n\non both islands, about to erupt. You are in a plane. You\nYour options:\nhave enough gas to fly to just one island and save whoever's\n1. Chop up Ryan. Ryan dies; the five live.\nwashed up there; whoever's on the other island will suffer a\n2. Don't chop up Ryan. Ryan lives; the five die.\npainful, fiery death.\n\nYour options:\n1. Fly to the big island. Prof. Stanczyk dies; TAs live.1\n2: Fly to the small island. Prof. Stanczyk lives; TAs die.\n\nWhat does Utilitarianism say about these two cases?\n\nNozick will make a distinction between the two. How could we spell out that distinction?\n\nChoose wisely\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 5 - Nozick on Redistribution and Just Holdings",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/546b02d99988108287506607676ce9f7_MIT24_04JS12_Week5.pdf",
      "content": "Justice\n\n3/16/2012\n\nTA: Sophie Horowitz\n\nNozick on Redistribution and Just Holdings\n\nQuestion 1: Explain Nozick's argument argument against patterned principles of justice.\n\nWhat does he mean by a \"patterned\" principle?\n\nDescribe Nozick's two arguments:\n\ne Wilt Chamberlain example:\n\ne argument that redistribution violates your right of self-ownership (that\nis, it makes you other people's property):\n\nQuestion 2: Explain Nozick's positive view of just holdings.\n\nJustice in original acquisition:\n\nHow can something be acquired justly?\n\nWhat must we consider when originally acquiring something?\n\nJustice in transfer:\n\nHow can holdings be transferred justly from one person to another?\n\nJustice in rectification:\nHow should we correct for unjust acquisitions or transfers in the past?\n(Nozick's answer here is less clear than the others, so don't worry as much\nabout this one.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 6 - Nozick's Negative and Positive Arguments",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/90bcb7f9eb6800fed8e4d602c251856d_MIT24_04JS12_Week6.pdf",
      "content": "Justice\nTA: Sophie Horowitz\n3/23/2012\n\n1. Nozick's negative argument against extensive redistribution\n\nWILT CHAMBERLAIN: At t1, property is distributed according to a patterned\nprinciple, D1. en, a million people pay 25 cents each to watch Wilt Chamberlain\nplay basketball. At t2, Wilt is very rich; the distribution of property is D2.\n\nNozick argues that because D2 resulted from D1 plus a series of permissible transfers, D2\nis just. But since D2 is not D1, D1 must not be the only just distribution of holdings.\n\n2. Nozick's positive argument\n\nWILT CHAMBERLAIN is an example of (intuitively) j ust actions that \"patterned\" principles\ncan't account for. Nozick says that t he right theory of just holdings must recognize\nindividuals' rights to do what they want with what they (justly) o wn.\n\nA transfer is in accordance with the principle only if the parties enter the transaction\nvoluntarily, and there is no fraud or theft.\n\nNozick argues that any distribution of holdings is just, as long as the distribution comes\nabout from just original acquisition and a series of just transfers.\n\n3. Possible Objections (these are just a few ideas... use any or none of them in your paper!)\n\nObjection 1. Nozick says that his principle of Justice in Transfer is the right explanation of\nwhy WILT CHAMBERLAIN is just. Is his principle right?\n\n-Nozick says that a transfer is just if and only if the two parties act freely. But\nCohen argues that you can be forced to do something and do it freely.\n\n[Presentation question: explain why. What's an example of a transfer that is undertaken\nfreely, but is unjust?]\n\n-If that's right, we should replace Nozick's principle with something more\nrestricted.\n\n-Further question: what would be a better principle of just transfer? (We want one\nthat allows Wilt Chamberlain, but rules out the counterexample.)\n\nJUSTICE IN TRANSFER: \"A person who acquires a holding in accordance with the\nprinciple of justice in transfer, from someone else entitled to the holding, is entitled\nto the holding.\" (p. 151)\n\nObjection 2. Nozick says that the transfers in WILT CHAMBERLAIN are just because\neveryone owns their 25 cents, and so should have exclusive rights over it. Is that right?\n\n-Cohen argues that if everything is jointly owned, we never have exclusive rights\nover anything -\nwe always have some say over what others do with their property.\n\n-If Cohen is right, Nozick's Justice in Transfer principle will never apply; so it can't\nexplain what's going on in WILT CHAMBERLAIN.\n\nObjection 3. Nozick says that in WILT CHAMBERLAIN, D2 is just. Is it really?\n\n-Suppose everyone in the town where Wilt plays works in a mine. Wilt gets so rich\nthat he can afford to buy the mine. He does so, and fires all the workers. He then\noffers to hire them back for a much lower wage than before. Would that be just?\n\n-Further questions: Is there a difference between a case where Wilt gets very rich\nand a case where Wilt gets only slightly richer? What is the difference? When does\nit become unjust, if it ever does?\n\nObjection 4. Nozick says that in WILT CHAMBERLAIN, D2 breaks the pattern. Could we\nrelax our characterization of a \"pattern\", and come up with one that D2 doesn't violate?\n\n-Consider some distribution schemes that might still be in place after everyone\ngives Wilt a quarter. For example:\n\nNO STARVATION: If people are starving, redistribute holdings so that they\nare not starving. Otherwise, don't redistribute.\n\nNO MONOPOLIES: If a monopoly develops, redistribute to eliminate the\nmonopoly. Otherwise, don't redistribute.\n\nNO RACISM: If a distribution leaves a certain racial group significantly\npoorer than other groups, redistribute. Otherwise, don't redistribute.\n\n...etc.\n\n-ese principles say that we should only redistribute under certain conditions. So\nthey (probably) w\non't say that we should redistribute in Wilt's case.\n\n-If one of these schemes is the right \"patterned principle\", patterned principles could\naccount for individuals' rights to do what they want with what they own - at least in\nmost cases. ey will just place restriction on what end states are allowed.\n\n-Further question: what would Nozick say about these patterned principles? Is he\nright?\nNozick, Robert. Anarchy, State, and Utopia. Basic Books, 1977. All rights reserved.\nThis content is excluded from our Creative Commons license. For more information,\nsee http://ocw.mit.edu/fairuse.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 7 - Motivations for Egalitarian Liberalism / Rawls' Principles / Veil of Ignorance",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/a9a9ee8d944262bb36e42220ba20c946_MIT24_04JS12_Week7.pdf",
      "content": "Justice\n\nTA: Sophie Horowitz\n4/6/2012\n\nSome motivations for Egalitarian Liberalism:\n1. A purely consequentialist conception of justice won't work; people's basic rights and liberties\nshould be protected.\n(Remember the Survival Lottery, or chopping up Ryan to redistribute his organs.)\n\n2. A purely historical conception of justice won't work; we need some constraints on the end state.\n-Resources shouldn't be distributed on the basis of arbitrary, morally irrelevant factors like\nrace, gender, sex, etc. - or even on the basis of natural talents or aptitudes. It should be fair.\n(Remember the sexist shopkeeper who only hires men.)\n\nRawls' two principles:\n\n1. Each person is to have an equal right to the most extensive scheme of equal\nbasic liberties compatible with a similar scheme for all.\n\n2. \"Social and economic inequalities\" are to be arranged so that they are:\n(a) attached to positions open to all under conditions of \"fair equality of\nopportunity\"\nand\n(b) to the greatest possible benefit of the least advantaged members of\nsociety (the \"Difference Principle\")\n\n-(1) g uarantees that we won't have survival lottery cases.\n-But (1) b y itself would allow discriminatory practices that systematically disadvantage certain\ngroups; (2a) p revents that.\n-And even with (1) a nd (2a), naturally talented people could still end up with a huge advantage,\nwhich Rawls thinks is unfair. (2b) p revents that.\n\nNote: e first principle takes \"lexical priority\" over the second. at means that the first principle\nmust be satisfied before we even worry about satisfying the second principle; there can't be\ntradeoffs between them. No inequalities are justified if the first principle is not satisfied.\n\ne Original Position and the Veil of Ignorance:\nIn addition to thinking his two principles are independently plausible, Rawls also gives another\nargument for them: he argues that these principles would be the result of a particular process that\nguarantees a just outcome.\n\nRawls' method:\nImagine that we are all rational agents in the \"original position\", behind the \"veil of\nignorance\". is means that we don't know what many things about ourselves: for\nexample, age, race, sex, physical abilities, mental abilities, religious values, and \"conception\nof the Good\". How would we agree to structure our society? Whatever principles we agree\non are the right principles of justice.\n\ne original position thought experiment is designed to do two things:\n\n(a) Ensure that the principles are ones that rational agents would all accept.\n(Rawls' view is a social contract theory; for him, society is something we enter into\nfor mutual benefit and it should be structured in a way that we can all agree to.)\n\n(b) Ensure that irrelevant factors don't influence the distribution.\n\nAccording to Rawls, his two principles are what we'd agree on from the original position.\n\nRawls thinks that the fact that this method yields plausible outcomes provides support for the\nmethod; the fact that a plausible method yields Rawls' principles provides support for Rawls'\nprinciples. e process of balancing the method and its outcomes against one another, and revising\neach in light of the other, is called \"reflective equilibrium\".\n\nQuestions to think about:\n1. Do Rawls' principles seem plausible on their own?\n\n2. Is Rawls' thought experiment a good way to determine the right principles?\n\n-Does the original position abstract away from the right features?\n-Does it abstract away from too much? How can we agree on anything when we know so\nlittle about ourselves?\n\n3. Would rational agents behind the veil of ignorance actually agree to Rawls' principles?\n\n-Why wouldn't they agree to maximize expected utility, for example?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 8 - Equality of Opportunity / Rawls' Difference Principle",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/e8e5d2a9b96a06776a5803dc4dc8bc3e_MIT24_04JS12_Week8.pdf",
      "content": "Justice\nTA: Sophie Horowitz\n4/13/2012\n\nEquality of Opportunity\n\nIn your papers, many of you thought that Nozick's theory should be amended to prevent\ncertain kinds of discrimination. We have also seen, in Rawls' theory, arguments for the\nclaim that certain arbitrary factors like race, sex, etc. shouldn't influence the distribution of\nholdings in society. is general thought s eems to be explained by:\n\nEQUAL OPPORTUNITY:\n\nHow well off we are shouldn't depend on factors outside our control.\n\nHere is another plausible idea: we should be held responsible for our decisions. Good\nchoices should be rewarded; bad choices should be punished. If you work hard, you deserve\nto prosper. If you commit a crime, you deserve to go to jail. is seems to be explained by:\n\nMORAL DESERT:\n\nHow well off we are should depend on how good our choices have been.\n\nQuestions:\n1. Are EQUAL OPPORTUNITY and MORAL DESERT mutually exclusive? What are some\nreasons to think that they can't both be true?\n\n2) If the two principles are incompatible, which one should we give up? Could we amend\none of them instead of giving it up entirely?\n\nRawls' Difference Principle\n\nRawls thinks that EQUAL OPPORTUNITY is not enough; if we just had EQUAL\nOPPORTUNITY, some members of society might still be very badly off. We also need:\n\nDIFFERENCE:\nInequalities in holdings are only just if they benefit the worst off.\n\nImagine two societies, X and Y. In both communities there is a job, engineering, that's\ndifficult and unpleasant to do, but rewards the whole community - and only the people\nwho work hard and succeed at school can do it. e engineers X are good-natured, and will\nwork hard at their jobs for an average salary. e engineers in Y are self-centered and will\nonly work hard at their jobs if they have a very high salary.\n\nAccording to DIFFERENCE, the engineers in X should receive an average salary while the\nengineers in Y should receive a very high salary.\n\nQuestions:\n1. Does this seem fair to you? Should the engineers in X get paid less just because they are\ngood-natured?\n\n2. Who deserves more money: the engineers in X, or those in Y? Or, as Rawls thinks, does\n\"desert\" have nothing to do with how much they should be paid?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 9 - Justice and Private Life",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/b16332fe40e3b201b81b35868c54a6ee_MIT24_04JS12_Week9.pdf",
      "content": "Justice\n\nTA: Sophie Horowitz\n4/20/2012\n\nJustice and Private Life\n\nRawls presented his principles of justice as a theory meant to apply to the \"basic structures\"\nin society, rather than individuals' choices or private family life. But sometimes practices in\nprivate life can systematically make some group of people worse off than another group. So\nif we really care about fairness, arguably we should care about those practices just as we care\nabout the basic structures of society.\n\nExample from Okin: Women are systematically underrepresented in positions of\nwealth and power. Okin says this is caused by our current family structure - the\ndifferent roles mothers and fathers play; the different ways daughters and sons are\nraised, etc.\n\n1. Suppose Okin is right that the underrepresentation of women is caused by our current\n(typical) f amily structure. What should we do about it?\nA. Introduce stronger anti-discrimination laws, better parental leave policies, etc.?\n\nB. Suppose A doesn't work (remember Sweden - men and women get equal\nparental leave, but women tend to take it much more than men). Should the\ngovernment try to change the culture, through education, advertising, etc?\n\nC. Suppose B doesn't work. Should the government ban certain kinds of family\nstructures?\n\n2. Suppose that we know some strategy like B or C above would be effective. Should the\ngovernment have the right to interfere with culture and private life in this case?\n\n3. ink of a few more examples of social practices, expectations, etc. that systematically\ndisadvantage certain groups of people. What should we do about those? Should the\ngovernment intervene?\n\n4. inking about your answers to 2 and 3: under what circumstances should the\ngovernment be allowed to interfere with social practices in private life?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Week 10 - Free Speech",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-04j-justice-spring-2012/85632ccf0e06b2b014d8544b7299cc7c_MIT24_04JS12_Week10.pdf",
      "content": "Justice\n4/27/2012\nTA: Sophie Horowitz\n\nIn Citizens United, the Supreme Court decided that corporations spending money counts\nas a form of free speech that falls under the protection of the first amendment.\n\nIn the minority opinion, Justice Stevens wrote: \"Take away the ability to use general\ntreasury funds for some of those ads, and no one's autonomy, dignity, or political equality\nhas been impinged upon in the least.\"\n\ne argument seems to be: free speech is valuable because it protects individuals'\nautomony, dignity, and political equality; corporations spending money doesn't promote\nthose goals. So, corporations spending money shouldn't be protected. Is he right?\n\n1. Why is freedom of speech valuable? Is Justice Stevens right?\n\n2. Two speakers are at a town meeting. A has to shout, while B has a megaphone. e\ntown officials tell B that she can't use her megaphone.\n\nOne position: e town officials have restricted B's right to free speech!\nAnother position: e town officials were protecting A's right to free speech.\nat's because B's using a megaphone devalued A's right to speech.\n\nWith that analogy in mind: Does spending money count as a form of speech? If so, is it\njust to restrict how much money people can spend?\n\n3. Does a corporation's spending money count as a form of speech? If so, is that a form of\nspeech that should be protected? (Does it promote what's valuable about free speech?)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.04J / 17.01J Justice\n\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}