{
  "course_name": "Labor Economics I",
  "course_description": "This course aims to acquaint students with traditional and contemporary topics in labor economics and to encourage the development of independent research interests. The class provides a systematic development of the theory of labor supply, labor demand, and human capital. Topics covered include wage and employment determination, immigration, unemployment, equalizing differences, among many others. There is a particular emphasis on the interaction between theoretical and empirical modeling.",
  "topics": [
    "Social Science",
    "Economics",
    "Labor Economics",
    "Social Science",
    "Economics",
    "Labor Economics"
  ],
  "syllabus_content": "Class Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nPrerequisites\n\nThe prerequisites for this course are\n14.04 Intermediate Microeconomic Theory\nand\n14.32 Econometrics\n.\n\nCourse Format\n\nThe course was divided into two halves. Prof. Josh Angrist taught the first part, and Prof. Daron Acemoglu taught the second part.\n\nClass Requirements\n\nGrades are based on four problem sets, an emperical project involving replication and extension of published work, and a three-hour final during exam week. In addition, there are two ungraded problem sets, one at the beginning and one at the end of the course.\n\nACTIVITY\n\nPOINTS\n\nFour problem sets\n\nEmpirical project\n\nFinal exam\n\nBooks\n\nO.Ashenfelter and R. Layard.\nThe Handbook of Labor Economics. Vol. 1\n. North-Holland, 1987. ISBN: 9780444878564.\n\nJ. Angrist and Jorn-Steffen Pischke.\nMostly Harmless Econometrics: An Empiricist's Companion\n. Princeton University Press, 2008. ISBN: 9780691120355.\n\n-- -- --.\nMastering 'Metrics: The Path from Cause to Effect\n. Princeton University, 2014. ISBN: 9780691152844.\n\nP. Cahuch, Stephane Carcillo, and Andre Zylberberg.\nLabor Economics, Second Edition\n. MIT Press, 2014. ISBN: 9780262027700.",
  "files": [
    {
      "category": "Assignment",
      "title": "14.661 F17 Problem Set 0",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/3451195530412eb1edb55bdc883b1824_MIT14_661F17_pset0.pdf",
      "content": "Graduate Labor Economics Review Exercise\nLabor Economics\nAcemoglu, Angrist, Montenegro\nFall 2017\nDue in first recitation\n1. A consumer chooses between two goods, x1 and x2, with prices p1 and p2, given income y, so as to\nmaximize utility.\n(a) Graph the consumer's problem in x1 and x2 space. Show the consumer's optimal choice.\n(b) Give a graphical decomposition of the income and substitution effects from a change in p1 on the\ndemand for x1.\n2. Assume the consumer's utility function is given by:\nu (x1, x2) = α ln (x1 - γ1) + (1 - α) ln (x2 - γ2) ,\nwhere: 0 ≤ α ≤ 1, x1 > γ1 ≥ 0, x2 > γ2 ≥ 0.\n(This is called a Stone-Geary utility function. The parameters γ1 and γ2 are sometimes thought of as\n\"subsistence\" levels of consumption, below which utility is not defined.)\n(a) What is the marginal rate of substitution (MRS) for this utility function?\n(b) Derive the first-order conditions for the optimal choices of x1 and x2 as a single equation involving\nthe MRS. What is the graphical interpretation of this condition?\n(c) Derive the uncompensated (\"Marshallian\") demand function for x1 for this consumer. Use Roy's\nidentity to confirm this.\n(d) Show that the consumer's expenditure on x1 is a linear function of p1 and y. For example, for\ngood x1, we have\np1x1 = p1γ1 + α (y - p1γ1 - p2γ2) .\nFor this reason, the Stone-Geary utility function is sometimes called the \"Linear Expenditure\nSystem.\" Interpret this equation.\n(e) What is the cost function for this problem?\n(f) Derive the compensated (\"Hicksian\") demand function for x1 for this consumer using Shephard's\nlemma. What is the graphical interpretation of a compensated price response? What is the\nSlutsky equation for this problem?\n(g) Show the Slutsky equation holds for Stone-Geary preferences.\n3. Empirical researchers often work with the Cobb-Douglas production function:\nQ = γLαKβ ;\nα > 0,\nβ > 0,\nγ > 0,\nwhere L is labor, K is capital, and Q is the quantity of output.\n(a) What must be true for this production function to exhibit constant returns to scale?\n(b) Assuming you have the necessary data, describe at least two ways to construct a statistical test\nfor constant returns to scale in production.\n(c) Suppose you have data on a panel of firms. Explain how to use this data to control for an\nunobserved but time-invariant variable that captures managerial efficiency.\n4. What is the present value of x dollars/year for t years with interest compounded annually? Derive\nthe equivalent rate under continuous compounding. Suppose a fixed cost of C paid up front yields a\nstream of benefits B starting in 10 years. Define the internal rate of return for this project and explain\nhow to use this rate to make investment decisions.\n\n5. Suppose that students' demand for cellular data service is a linear function of the price of GBs trans\nferred and the annual income of college students. Make up some notation for a demand equation that\nreflects this assumption. Use this equation to compute the price-elasticity of demand for data service\nas a function of demand parameters and price, income, and quantity sold.\n6. Regression basics\n(a) Regression anatomy: Explain how to calculate a multivariate regression coefficient using a two-\nstep procedure where the second step is a bivariate regression.\n(b) The omitted variables bias formula: What is the relationship between the regression coefficient\nfrom a bivariate regression of wages on schooling (a \"short regression\") and the coefficient on\nschooling when the equation also includes test scores (a \"long regression\")? Generalize this to the\ncase where both the short and long models include other covariates.\n7. Two-stage least squares: Show that 2SLS is an IV estimator. What is the instrument?\n8. Grouping and IV: show that an equation estimated using group averages (e.g., average hours worked\nby city on average hourly earnings by city) is the same as 2SLS. What are the instruments?\n9. Suppose the probability a woman works is modeled using a latent-index model such that\nyi = 1 (Xi\n0β > εi) ,\n\nwhere yi is employment status, Xi is a vector of personal characteristics, and εi is N 0, σ2\nand\nindependent of Xi. Write down the likelihood function and derive the FOCs. What is identified?\nPropose a weighted least squares procedure that is asymptotically equivalent to the MLE.\n10. Derive the formula for the standard error of a difference in means. Show that if the outcome variable is\nhomoskedastic, the optimal experimental design for estimating a difference in means has the proportion\ntreated equal to 1/2.\n11. Consider two random variables, Y and X. Show that the variance of Y can be written as the variance\nof the conditional mean function, E[Y |X], plus the average variance of Y conditional on X. This is\ncalled the analysis of variance (ANOVA) identity. Prove that ANOVA holds for samples as well and\ninterpret the pieces.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "14.661 F17 Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/606e1f614feb49397c4187f90bad5091_MIT14_661F17_pset1.pdf",
      "content": "MIT 14.661\nAcemoglu, Angrist, Montenegro\nFall 2017\nDue: October 5, 2017\nLabor Economics Problem Set 1\n1. You're interested in studying the evolution of a particular subgroup unemployment rate, ut, for 1960\n2015, but the series you're interested in is somewhat specialized and starts only in 1980. You have\ncovariates, xt, for the entire period. Explain how to use the covariate series to impute the missing\ndata. Explain why the variance of the imputed series is unlikely to exceed the variance of the target\nseries. Reconcile this fact about regression imputation with the Romer (1986) finding that the variance\nof Lebergott's (1964) prewar imputed unemployment series is too high.\n2. Draw the EITC+NIT budget set for two scenarios, one where NIT payments are reduced by a fraction\n0 < ⌧ < 1 for every dollar of earnings, ignoring the EITC and one where NIT payments are reduced\nfor every dollar of earnings including EITC payments.\n(a) How does implicit taxation of the EITC by an NIT a↵ect the EITC's (theoretical) labor supply\nconsequences?\n(b) Rothstein (2010) doesn't much like the EITC - what's his beef? Explain his argument using\nsupply and demand style graphs of a covered and uncovered sector. Is there evidence in support\nof his concern?\n3. This problem asks you to extend the standard one person static labor supply problem to a two-earner\nfamily. Consider Mr. and Mrs. Unitary, who act to maximize following family utility function:\nU = U (c1 + c2, l1, l2) .\n(1)\nThe Unitary family's utility is a function of the sum of goods consumed by both partners and each\npartners' leisure. Partners have a time endowment Ti and faces a wage wi where i = 1, 2. The family\nalso has non-labor income y and faces a price p for consumption goods, under a common budget\nconstraint.\n(a) What does (1) imply about the MRS between the two partners's consumption? Is this a romantic\nconceit or misleading impossibility? Propose an objective function that loosens this restriction.\n(b) Suppose family members must each satisfy an individual budget constraint. Explain without too\nmuch math why this makes the family worse o↵ with or without a unitary utility function of the\nform described by (1).\n(c) Returning to a common family budget constraint and the Unitary family's preferences, write down\nthe uncompensated labor supply responses to a change in own and partner wage rates in terms\nof substitution and income e↵ects. Call the substitution e↵ects Sij for worker i's response to a\nchange in j's wage. How does consumer theory restrict the substitution matrix?\n(d) Totally di↵erentiate the labor supply functions, assuming dp = 0. Substitute your results from\n(c) to obtain\ndhi = Si1dw1 + Si2dw2 + Bi [h1dw1 + h2dw2 + dy] ,\nwhere Bi = @hi/@y. Use this equation and what you know about the Slutsky matrix to show that\nthe introduction of a negative income tax must reduce family earnings, though it need not reduce\nboth partners' earnings.\n(e) Suppose the partners in question are same-sex instead of a traditional husband and wife. How\nmight the family problem change in this case?\n\nλ\n4. Life-cycle labor supply\n(a) Derive the\n-constant labor supply and commodity demand functions for the Heckman and\nMaCurdy (1980) utility function. Assume the interest rate is fixed.\ni. What's the intertemporal substitution elasticity in this model? Why is this parameter sure\nto be positive (as a matter of theory)? How do wages a↵ect consumption? Why?\nii. Use the model to sign and compare behavioral responses to the following sources of variation\nin wages: Cross-sectional variation associated with permanent di↵erences in human capital;\nWage increases generated by changes in labor market experience; Transitory shocks caused\nby changes in the macro economy; Changes in after-tax wages caused by a temporary NIT\nprogram; Anticipated retirement at age 50; Unexpected job loss at age 50.\n(b) Construct a PSID extract similar to the one used by Angrist (1991). PSID data are available\nfrom the ISR:\nhttp : //simba.isr.umich.edu/Zips/ZipMain.aspx\n(use the Wave I cross-year individual file).\ni. Calculate the grouped-data, Analysis of Covariance (fixed-e↵ects), and OLS estimates of\nMaCurdy's (1981) specification reported by Angrist (1991, Table 3).\nii. How does Angrist (1991) explain di↵erences in results across methods?\niii. Why does Card (1994) take a skeptical view of the large positive intertemporal substitution\nelasticities generated by the grouped-data estimator in PSID data? Does evidence on the\nlabor supply responses of bicycle messengers, cab drivers, and lobstermen address Card's\nconcerns?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "14.661 F17 Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/bf07a3fd4676165d4b8f872a04317b6b_MIT14_661F17_pset2.pdf",
      "content": "-\nσ\nMIT 14.661\nAcemoglu, Angrist, Montenegro\nFall 2017\nDue: October 27 (recitation)\nLabor Economics Problem Set 2\nA. Home economics\n1. Children are often said to complicate their parents' labor supply decisions.\n(a) Use a model of labor supply with home production to show how single mothers' labor supply\ndecisions might be affected by child care costs.\n(b) Compare and contrast the likely labor supply consequences of these policies:\ni. A lump-sum child allowance that's independent of earnings\nii. A child care tax credit that cuts out at the poverty line\niii. Making child care expenses tax deductible\nYour analyses should consider: effects on participation, effects on hours for women likely to work\nanyway, variation in effects as a function of wage rates.\n(c) Identify channels through which state-subsidized out-of-home care (through programs like Head\nStart) might affect children. What does the evidence suggest?\nB. CES production\nConsider the constant elasticity of substitution (CES) production function\n⇢\nF (K, L) = (↵K⇢ + (1 ↵)L⇢)\nwith ⇢ 2 ( -1, 1] and ↵ 2 (0, 1).\n1. Derive the conditional factor demands (Kc and Lc) as well as the cost function for CES production.\n2. The elasticity of substitution is defined as\n@ log (Lc/Kc)\n⌘- @ log (w/r)\nDerive the elasticity of substitution for CES production.\n3. CES production nests important special cases\n(a) What happens to CES production when ⇢ = 1? What's this called?\n(b) Derive the limit of the CES production function as ⇢ ! 0. What do we call this?\n(c) Derive the limit of the CES production function as ⇢ !-1. What do we call this?\nC. Fast-food labor demand\nSuppose that N small fast food establishments produce according to f(L) = log L, with fixed capital. The\nproduct price is fixed at 1. Aggregate labor supply is given by w✏ for positive ✏.\n1. Assume firms are price-takers in the factor market (in other words, the labor market is competitive).\nDerive an individual firm's demand curve. Use this to derive the aggregate demand curve.\n2. Derive the competitive equilibrium wage, wc, and aggregate employment level, N · Lc, as a function of\nthe labor supply elasticity and the number of firms.\n3. Now, suppose that the ghost of Ray Kroc (\"that's Kroc with a K!\") buys these N establishments and\noperates them as one firm. Assume that the retail fast food market remains competitive. However,\nmonopsonist Kroc has market power in his factor market - in fact he is the sole employer of this type\nof labor. Derive the new equilibrium wage, wm, and the aggregate employment level, N · Lm, and\ncompare these to wages and employment under competition.\n\n-\n-\n-\n-\n4. Now suppose Larry Summers gives up his K-School river view and returns to Washington. Explain how\na wise and beneficent policy-maker can use the minimum wage to generate the competitive employment\nlevel as an equilibrium outcome in spite of Kroc's market power. What must Larry know to accomplish\nthis feat?\nD. Theoretical immigration effects\nIn recent years, many skilled immigrants have come to Silicon Valley to work as code warriors in the software\nindustry. Assume there are two types of programmers: natives (Type 1) and immigrants (Type 2). Initially,\nassume there are n1 native programmers in the labor force and no immigrants. Assume also that the aggregate\nlabor supply function of native programmers is n1S1(w1), where S1(w1) is the labor supply function of an\nindividual programmer. The demand function for native labor is D(w), with D0(w) < 0.\n1. Suppose that immigrant programmers have labor supply functions identical to natives' supply functions\nand that employers treat immigrant and native programmers as perfect substitutes. Use graphs to\nshow the effect of an influx of n2 immigrants on native programmers. Compare this with the effect of\nimmigration if immigrant labor supply is perfectly inelastic.\n2. By totally differentiating equilibrium conditions, derive comparative statics formulas for the effect of\ndn2 on native employment in the second two scenarios from part 1. Which effect is larger? More\ngenerally, what economic parameters are likely to govern immigration effects on native employment?\nE. Empirical immigration effects\n1. Try to replicate the results in Table III of Borjas (2003).\n2. Explore the robustness of these findings to the possible presence of group-specific trends.\nF. Human capital\n1. Suppose that potential log earnings for a worker with syears of schooling are given by\ngi(s) = ↵ + ⇢1s\n⇢2s\nand that potential schooling values [S0i, S1i] indexed against a Bernoulli instrument, Zi, determine\nactual schooling according to\nSi = S0i + (S1i\nS0i)Zi\nShow that under these assumptions, the Wald estimand using Zi to instrument Si equals the average\nderivative E {!igi(Si\n⇤)} where\nS0i + S1i\nS⇤ =\ni\nS1i\nS0i\n!i = E [S1i\nS0i]\nIn other words, IV captures a weighted average return to schooling over a range of schooling values\nand for a set of workers determined by the normalized first stage, !i.\n2. This weighted averaging property of IV is sometimes said to explain why IV estimates tend to exceed\nthe corresponding OLS estimates. This is what Lang (1993) dubbed a \"discount rate bias\" explanation\nfor relatively high IV estimates. Why is this reasonably called a sort of \"bias\"? After all, OLS is also a\nweighted average with weights that tend to peak at median schooling (for details, see Appendix A in\nAngrist and Krueger, 1999).\n3. Use the AK-91 data set to test the discount rate bias hypothesis by comparing IV estimates using\ndifferent instruments or computing IV estimates for different groups.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "14.661 F17 Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/cfce9aa2f2b89f0c5b6d4f5f38a4c82f_MIT14_661F17_pset3.pdf",
      "content": "Labor Economics, 14.661, Second Part, Problem Set 3\nPlease hand in questions 1, 4 and 5. This problem set is due on or before the recitation\non Friday, November 10.\nExercise 1 Consider an economy that consists of a large number n of workers and the same number\nof firms. The economy lasts for two periods. In the first period, workers choose the level of their human\ncapital, h incurring a cost c(h) where c(.) is differentiable, strictly convex and increasing and firms\nchoose their capital stock at cost r. There is no discounting in this economy. In the second period,\nfirms and workers are randomly matched 1-to-1 and switching is not allowed so if there is disagreement\nnothing is produced and both parties obtain zero return. If they agree to produce, output is equal to\nF (h, k), where F is concave and k and h are complements in the production.\n1. Assume that wages are determined by an asymmetric Nash bargain where the worker's bargain\ning power is β. Determine the equilibrium of this economy. Show that all firms will choose\nthe same level of physical capital investment, all workers will choose the same level of human\ncapital investment, and there will be underinvestment compared to the social optimum in both\ndimensions.\n2. Now suppose that a fraction λ of firms have their cost of capital reduced to r < r. Show that\nthis creates \"positive externalities\" both on workers and other firms. Explain the intuition for\nthis result.\n3. Suppose F (h, k) = Ahαk1-α . At which value of β is output maximized. Explain.\n4. Suppose there are many countries that differ in their labor market institutions thus have different\nβ's. Show that there will be an inverse U-shaped relationship between factor shares of capital and\nthe level of income.\n5. Show that a multiplicity of equilibria is possible with general technology F (h, k) (Hint: a dia\ngrammatic answer is suffi cient).\n6. Now consider the human capital levels of the workers fixed, with a fraction θ of the workers having\na human capital level h1 and the rest with human capital level h2 > h1. First show that under\nthe same assumption we have made so far that there is no switching partners, the equilibrium\nalways involves all firms choosing the same level of physical capital.\nNext assume that following the first random match between firms and workers, if either party\ndoes not want to form an employment relationship with their match partner, both parties will\nincur a cost c, but can then rematch with one of the workers that are still unmatched in the\nsecond period. In the first period, wages are given by Nash bargaining taking the second period\nvalues as the threat point. The worker's bargaining power β is common to both periods. Show\nthat the above-characterized equilibrium is still an equilibrium, but for c suffi ciently small, there\nalso exists an equilibrium in which all firms no longer choose the same level of physical capital\ninvestment. Characterize this equilibrium.\n[For bonus points] Show that for fixed c, as the gap between h2 and h1 increases, we can switch\nfrom an equilibrium in which firms all choose the same level of physical capital investment, to\none in which they do not. In this extended model, are there positive or negative human capital\nexternalities?\nExercise 2 In this problem, you are asked to work through a model that combines signaling with\nproductive aspects of schooling. There are two types of agents: \"high\" and \"low\" ability. Education\n(e) is continuous and observed, but individual ability (and output) is not. The labor productivity for\nthe \"low\" type is yl(e) = α0 and the cost of education is cl(e) = 3e2/2. For the \"high\" type, output\nand education costs are yh(e) = α1 + α2e and ch(e) = e2, respectively. Let α1 = α0 for now.\n\n1. Define Perfect Bayesian Equilibria (PBE) of this game (Hint: be specific about the actions of\nworkers of different types and the actions of firms- which are wage offers as functions of publicly\nobservable objects- at different points in time).\n2. Solve for the PBE corresponding to the \"Riley Equilibrium\"(most effi cient separating equilibrium)\nof this game. In particular, show that high type workers do not have an incentive to deviate from\nyour proposed equilibrium strategies. Does the high types'investment in education differ from\nwhat would have obtained in the perfect-information case? Why or why not?\n3. Suppose again that cl(e) = 3e2/2 and furthermore suppose that there is a compulsory schooling\nrequirement of e, where 0 < e < α2/4. Characterize the Riley Equilibrium. Does the high type\ninvest in education more or less in this case than in (2)? Explain why.\n4. Compute the observed return to schooling in part (1).\n5. How does the observed return to schooling change if α1 - α0 increases (starting from zero)?\nExplain the intuition for both the forces that tend to increase and decrease observed returns to\nschooling in this case.\nExercise 3 The economy lasts two periods. In period 1, an individual (parent) works, consumes c,\nsaves s (to be left as bequest), decides how much education e to purchase on behalf of their offspring, and\nthen dies at the end of the period. Utility of household i is given U(ci, cˆi), where cˆi is the consumption\nof the offspring, and U is increasing in both of its arguments and jointly concave. There is heterogeneity\namong children, so the cost of education, θiei, varies across i. In the second period, individuals receive\na wage w(e), where w > 0 and w\n< 0 as usual.\n1. Consider the case in which credit markets are perfect: households can borrow and lend at the\nsame interest rate r. Characterize the household's decision problem. Show that the choice of\neducation is independent of the form of the utility function.\n2. Now assume a credit-market friction: households can lend at r, but cannot borrow going from\nperiod 1 to period 2. Write down the household's decision problem, including this new constraint.\nShow how the education and consumption decisions are no longer separable.\n3. One of your colleagues just ran the following regression:\nlog(Children's Income)i = 0.35 × log(Parents'Income)i + εi\nwhere i denotes a household \"dynasty.\"\nInterpret this regression. Provide at least two theories that might explain this relationship and\nrelate them to the model in part 1 above. Discuss how you might go about discriminating among\nthese competing theories.\n4. Upon including a variety of covariates (such as parents'education) in the regression, your colleague\nfinds that the effect of parents'income drops by more than half. He claims that this constitutes\nevidence against the idea that poor parents cannot finance human capital investment due to\ncredit-market imperfections. Outline an argument in support of this view. Then discuss problems\nwith his conclusion.\nExercise 4 Consider the Galor-Zeira model of growth with imperfect credit markets in Lectures 3 and\n4 with the following two modifications. First, the utility function is now\n-(1-δ) δ-δ 1-δbδ\n(1 - δ)\nc\nand second, unskilled agents receive a wage of wu + ε where ε is a mean-zero random shock.\n\n1. Suppose that ε is distributed with support [-ψ, ψ], and show that if ψ is suffi ciently close to 0,\nthen as in the baseline model there are multiple steady states (that is, depending on their initial\nconditions some dynasties become high skilled and others become low skilled).\n2. Why was it convenient to change the utility function from the log form used in the lecture to the\none here?\n3. Now suppose that ε is distributed with support [-ψ, inf), where ψ ≤ wu. Show that in this case\nthere is a unique stationary distribution of wealth and no poverty trap. Explain why the results\nhere are different from those in part 1? How rapid do you think converges to this stationary\ndistribution will be?\n4. How would the results be different if, in addition, the skilled wage is equal to ws + υ, where υ is\nanother mean-zero random shock? [Simply sketch the analysis and the structure of the equilibrium\nwithout repeating the full analysis of part 3].\nExercise 5 Consider a society S consisting of M × N students, and M schools, each of size N. Each\nstudent has a pre-schooling human capital ei.The post-schooling human capital of a student i with\npre-schooling human capital ei attending school j is\nhi = G (ei, e-i,j )\nwhere e-i,j is a vector of pre-schooling human capital of students other than i attending school j.\n1. Show that if G is supermodular in its arguments, then to maximize the sum of post-schooling\nP\nhuman capitals in society,\nhi, the N students with the highest pre-schooling human capital\ni∈S\nshould be allocated to one school, then the next N students with the highest pre-schooling human\ncapital should be allocated to another school and so on.\n2. Show that if parents maximize wh - p, where p is their cost of schooling, then the allocation that\nmaximizes the sum of post-schooling human capitals can be decentralized by each school choosing\nsome cost of attendance (tuition) pj and accepting all students who want to attend at this price.\nWhat could go wrong with this decentralization scheme?\n3. How is the allocation that maximizes the sum of post-schooling human capitals affected when G\nis submodular? Can this allocation be decentralized in the same manner as in part 2? If not, why\nnot?\n4. A researcher tries to determine whether G is supermodular or not by running a regression of GPAs\nof college students on SATs of classmates. What might go wrong with this empirical approach?\n(Hint: you may want to discuss separately the issues of identification, the diffi culty of determining\nwho the peers are, and the diffi culty of mapping GPAs into \"human capital\").\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "14.661 F17 Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/76f97b5aba03ce5d5048f54dab4bd71e_MIT14_661F17_pset4.pdf",
      "content": "Labor Economics, 14.661, Second Part, Problem Set 4\nPlease answer questions 1, 2, 4 and 6. This problem set is due on or before December 1.\nExercise 1 Consider the following career concerns model. The world lasts two periods. All firms and\nworkers are risk neutral and there is no discounting. Workers are high or low ability, with ability denoted\n\nby η ∈ ηH , ηL , with ηH > ηL . The fraction of high ability workers in the population is p ∈ (0, 1).\nWorker ability is observed neither by the worker nor by the firms in the market. Each worker chooses\nan effort a ∈ R+ at each date, and with probability q (η, a) ∈ (0, 1), he generates high output Y h > 0\nand with the complementary probability, he generates low output Y l which we normalize to Y l = 0.\nAssume that q (η, a) is continuous, increasing and differentiable in a and increasing in η. The output\nlevel of each worker is publicly observed, but his effort level is not observed by potential employers.\nAfter the first period output level Y1 is realized, a large number of firms compete a la Bertrand to hire\nthe workers. Finally, assume that workers have a continuous, differentiable, and convex cost of effort,\nc (a).\n1. Define a Perfect Bayesian Equilibrium for this game.\n2. Show that in period 2, a worker will be paid\n\nw2 (Y1) = π (Y1) q ηH , 0 Y h + (1 - π (Y1)) q ηL , 0 Y h ,\nwhere π (Y1) is the probability that the market assigns to the worker being high ability after\n\nobserving his output level Y1 ∈ Y h, Y l = 0 in the first period.\n3. Suppose that all workers choose effort a in the first period and derive π (Y1) from Bayes's rule.\n4. Given w2 (Y1) and π (Y1), derive the best response first period effort a of workers. Show that in\nequilibrium this effort must satisfy a = a.\n5. Provide conditions such that a symmetric pure strategy equilibrium exists. Can there be multiple\nequilibria? Provide an economic intuition.\n6. Suppose that a unique symmetric pure strategy equilibrium exists. What is the impact of an\nincrease in Y h on equilibrium effort level? How does this effort depend on the form of the\nfunction q (η, a)? Can you relate this to any real-world labor market facts?\n7. Define the \"first-best\"effort level. Can the equilibrium level of effort be greater than the first-best\neffort?\n8. What is the difference of this model from the Holmstrom's baseline career concerns model? What\nare the advantages and disadvantages of this model?\nExercise 2 Consider the Shapiro-Stiglitz model where workers and firms are infinitely lived and risk-\nneutral, both with discount rate r. Effort costs e, and without effort there is no output produced.\nThere are N firms each with production function AF (L) which is increasing and strictly concave where\nL is the number of workers employed by the firm who exert effort. There is an exogenous separation\nrate equal to b, and unemployed workers get disutility of leisure (and benefits) equal to z. Unemployed\nworkers are randomly allocated to new job openings (which are due to separations). Firms decide what\nwage to offer to their workers. Workers who shirk (do not exert effort) are caught with probability q.\nThe difference from the standard model is that q is chosen by the firm. It costs C (q) per worker (thus\na total of C (q) L) to choose a level of monitoring equal to q.\n1. First write the Bellman equations for given q and derive the incentive compatibility condition (or\nthe no shirking constraint).\n\n2. Now find a first-order condition to determine the optimal level of q for a firm (Hint: be careful\nhere; a common mistake is not to distinguish between the \"q\"of the firm in question, say qi, and\nthe \"q\"of all other firms which enters through V U and which is obviously not controlled by the\nfirm).\n3. Show that an increase in A, which reduces unemployment, leaves q unchanged. Explain this result.\nIs it counter-intuitive?\n4. How would you modify the model so that changes in A have an impact on q? Outline, if you can,\npossible ways of and generating the prediction that dq/dA > 0 and that dq/dA < 0.\n5. Informally discuss whether C (q) L as the cost of monitoring is plausible. In particular, would\nC (q) be better? What would change in the model if instead of \"q\" we had workers supervising\nother workers (Hint: think of wages as costs)?\nExercise 3 The effi ciency wage models we analyzed in the lecture were of the moral hazard variety\n(or effort-elicitation models). Another strand of the effi ciency wage literature relies on adverse selection\n(type-elicitation).\nSuppose that there are N workers. φN of the workers are low type and have 1 effi ciency unit of\nlabor. (1 - φ) N of the workers are high type and they have α > 1 effi ciency units of labor. The type of\nthe worker is his private information and never observed by any other agent. High type workers have a\nreservation return uh and low type workers have a reservation return ul < uh. There are M firms each\nwith a decreasing returns to scale production function F (H) where H is the effi ciency units of labor.\n1. Draw the supply and demand curves for labor.\n2. Assume that these two curves intersect at w < uh. Show mathematically that it may be profitable\nfor a firm to offer a wage w = uh. Explain the intuition. Characterize diagrammatically the\nequilibrium in which all firms offer w = uh. Find the unemployment rate of this economy. Is all\nof this \"involuntary\"? Why don't the employers cut wages?\n3. The implicit assumption that you have used so far is that workers can apply to as many firms\nas they like. Now assume that each worker can only apply to one firm and choose which firm\nto apply after seeing the whole distribution of wage offers by firms. Show that starting from the\nallocation characterized in part (2) where w = uh for all firms, there is a profitable deviation for\na firm.\n4. Can you guess the form of the equilibrium in this case where each worker can only apply to one\nfirm?\nExercise 4 Consider the following economy. At t = 0, the firm decides how much to invest in its\nemployee's general skills. The cost of an investment τ is c(τ), which is incurred by the firm. A worker\nwith general skills τ produces 1+τ output in period t = 1. At this point, he can also move to a different\nfirm where his wage will be 1 + τ - θ where θ is the cost of moving to a different firm. θ is a random\nvariable, drawn from a uniform distribution [0, 1], and is the private information of the worker (i.e., the\nfirm does not observe it). The exact sequence of events is as follows: at t = 0, the firm chooses τ and\nmakes a wage offer (w) to the worker; next, the worker, knowing her own θ, decides whether to quit or\nto stay.\n1. Characterize the firm's wage offer as a function of τ. In particular, is w0(τ ) positive, negative,\nzero, or ambiguously determined? Why?\n2. Solve for the firm's level of training and wage offer that maximize expected profit. Explain why\nthe firm is not investing in τ?\n\n3. Suppose now that the worker can finance his own training investment. Solve for the worker's\nchoice of training and the firm's wage offer.\n4. Suppose again that the worker cannot finance her training, but that her wage, if she quits the\nfirm, is given by 1+ τ(1 - θ). Explain why the mobility cost might take this form. Solve for τ and\nw. Why is the firm investing in training in this case? Contrast these results with those obtained\nin part 2.\n5. Contrast these results with the Becker view of training (in particular, contrast how the costs of\ntraining are shared between firms and workers in the two different views).\nExercise 5 This question asks you to think about a three-period training model. Consider the following\ntimeline:\n- In period 1, firm-specific investments in human capital are made by the worker.\n- In period 2, investment in general human capital is made by the firm.\n- In period 3, the firm makes a wage offer.\nAssume that the production function has the following form:\nf(τ, s) = (1 + τ)(1 + s)\nin which τ is general human capital and s is specific human capital. The production function outside\nthe firm is\ng(τ, s) = 1 + τ\nFinally, the cost of general human capital, incurred by the firm in period 2 is τ 2, and the cost of specific\nhuman capital is s2 and is incurred by the worker in period 2.\n1. What is the wage offer the firm will make to the worker in period 3? Explain.\n2. Assume that the firm cannot invest in any general human capital in period 2 (or ever). Solve for\ns and w. Interpret.\n3. Assume instead that the worker cannot invest in specific human capital. Solve for τ and w.\nInterpret.\n4. Now, assume that both parties can the make investments as described above. What incentive\ndoes the firm have to invest in general human capital? What incentive does the worker have to\ninvest in specific human capital? (Hint: use backward induction.)\n5. Explain how and why your answer would change if f(τ, s) = 1 + τ + s. Why is this the case?\nExercise 6 Consider a firm with two ex ante identical employees, i = 1, 2. At time t = 0 each employee\ndecides whether to invest in his firm-specific skills at private cost c. If worker i makes this investment,\nwe denote it by si = 1 and otherwise by si = 0. At the beginning of time t = 1, the firm decides\nthe allocation of the two workers to tasks. There are two tasks, production and management. If both\nworkers are assigned to the production task, then total output of the firm is\ny P (s1) + y P (s2) ,\nwhere yP (1) > yP (0). If worker 1 is assigned to management and worker 2 to production, then the\ntotal output of the firm is\ny M (s1) + y P (s2) ,\n\nwhere\ny M (1) ≥ y P (1) y P (0) ≥ y M (0) .\nBoth workers cannot be assigned to management. Suppose that firm-specific skills and investments are\nobservable (by the firm) but not contractible (i.e., neither task assignments nor wages can be conditioned\nM\non firm-specific skills), but the firm can commit to different wages for different tasks (w\nfor workers\nP\nemployed in management and w\nfor workers employed in production; thus can commit to a \"wage\n\nP\nM\nstructure\" w , w\n). A worker can quit at any point and receive an outside option normalized to 0.\n1. Define a subgame perfect equilibrium. [Hint: this should include an assignment function g for\nthe firm that determines as a function of (s1, s2) which worker, if any, will be assigned to the\nmanagement task].\n2. Determine the equilibrium assignment of the firm as a function of (s1, s2) and the wage structure\n\nP\nM\nw , w\n.\n\nP\nM\n3. Show that if yM (1) = yP (1), then there exists no wage structure w , w\nthat will induce\neither employee to undertake investments in firm specific skills in any subgame perfect equilibrium.\nProvide an intuition for this result. [Hint: distinguish it from the \"holdup problem\"discussed in\nthe lecture].\n4. Now suppose that\ny P (1) + 2c > yM (1) > yP (1) + c.\n\nP\nM\nShow that there exists a wage structure w , w\nsuch that given this wage structure, one of\nthe workers invests in firm-specific skills and the other one does not. At t = 1, the firm promotes\nthe worker who has invested in firm-specific skills to the managerial position. [Hint: show that\nboth workers do not want to invest in skills]. Provide an intuition for why this wage structure is\nproviding incentives for firm-specific skills investment.\n5. Now suppose that\ny M (1) > yP (1) + 2c.\n\nP\nM\nShow that the firm can choose a wage structure w , w\nthat encourages both workers to invest\nin firm-specific skills (and then promote one of two workers who have invested in firm-specific\nskills and management if both of them have done so). Determine the wage structure to achieves\nthis.2\n6. Do you find the possibility that the firm can manipulate the organizational structure to encourage\nfirm-specific investments plausible? How else could the firm encourage firm-specific investments\nin this model?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "14.661 F17 Problem Set 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/790a8a16c274b5dc96f54572070763c9_MIT14_661F17_pset5.pdf",
      "content": "Labor Economics, 14.661, Second Part, Problem Set 5\nThis problem set this for practice. It's not to be handed in.\nExercise 1 Consider an economy consisting of a large number of workers and firms. Each worker is\ninfinitely lived in discrete time and maximizes the expected discounted value of income, with a discount\nfactor β < 1. There is no ex ante heterogeneity among the workers, but the quality of the match between\na worker and its employer is random, and is not directly observed by either. Suppose that the worker\nis a good match to its employer with probability μ0 ∈ (0, 1) (and this does not change over time for a\ngiven worker-firm match). A worker who is a good match to its employer produces a stochastic output\ny drawn from a distribution Fh, while a worker who is not a good match produces a stochastic output\ny drawn from a distribution Fl. Suppose that workers are paid a constant fraction of their expected\nmarginal product (with expectation taken with respect to all information available up to then). At\nany point in time, the worker can decide to quit. If he does so, he becomes unemployed. Unemployed\nR\nworkers receive an income of b <\nydFl (y) and find a new match with probability q < 1.\n1. What conditions do we need to impose on Fh and Fl such that workers who produce more are\npaid more?\n2. Suppose that we have imposed this restriction on Fh and Fl. Is it also the case that workers who\nproduce more are more likely to have a longer tenure with their firm?\n3. Provide the explanation/intuition for why, conditional on staying with the firm, a worker has, on\naverage, an upward sloping wage profile. Is this profile likely to be linear? Convex? Can you say\nabout the variability of the wages of the worker who has longer tenure?\n4. Provide conditions on Fh and Fl such that workers that are a good match (and only workers that\nare good match) can have infinite tenure (with some positive probability). What happens to the\nwages of workers that are in this \"infinite tenure\" range? What happens if these conditions are\nnot satisfied?\n5. Show that the wage that a worker receives just before quitting the firm is necessarily lower than\nthe wage he will receive just after getting a new job. Is this also true when q = 1?\n6. What are some additional facts that the model of this sort can account for, and what are some\nfacts that it will have diffi culty explaining?\nExercise 2 Consider the McCall search model with a mass 1 of risk neutral individuals with discount\nfactor equal to β and an exogenously given stationary distribution of wages F (w). Assume that there\nis no unemployment benefit, so unemployed workers receive zero wage. Once a worker finds and accepts\na job, he will be employed in this job until the job is destroyed exogenously, which happens with\nindependent probability equal to s in every period. Once the job is destroyed, the individual returns to\nthe unemployment pool. Suppose that at t = 0 all workers start out as unemployed.\n1. Show that, provided that the worker never quits, the value of a worker who accepts a job at the\nwage w is given by\nv a (w) = w + β [(1 - s) v a (w) + sv] ,\nwhere v is the value of an unemployed (searching) worker. Explain the intuition for this equation.\nWill the worker ever quit a job (unless there is an exogenous separation)?\n2. Write down the dynamic programming recursion that characterizes the optimal behavior of an\nunemployed worker. Be specific about he assumptions you are making in writing this recursion\n(and justify these assumptions). Derive an expression for the value of an unemployed worker, v.\n\n3. Find the reservation wage of the individual. Explain intuitively why this is constant over time.\n(Hint: use the fact that at the reservation wage R, the worker is indifferent between accepting the\njob and continuing to search, and combine this with the expression for v obtained in 2).\n4. Find the the law of motion of unemployment. Why is unemployment not necessarily constant?\nWhere does it converge to? Provide an interpretation of the limiting value unemployment in terms\nof separations and job creation.\n5. What happens to reservation wages and the unemployment process when s increases?\n6. Define the notion of \"second-order stochastic dominance\". What happens when F (w) shifts to a\nnew distribution F (w) that has the same expected wage but second-order stochastically dominates\nF ? Provide an intuition for this result.\nExercise 3 Consider a standard search model in continuous time where all workers have the same level\nof productivity, y. Workers and firms get together via a constant returns to scale matching function\nM(U, V ) where U is the number of unemployed workers and V is the number of vacancies. The flow cost\nof holding an open vacancy is γ, and unemployed workers get utility of leisure equal to z. Potential or\nexisting firms open vacancies until a marginal vacancy makes zero-profits. Worker-firm matches come\nto an end at the flow rate s and all agents are risk-neutral and discount the future at the rate r. Wages\nare determined by Nash Bargaining where the bargaining power of the worker is β.\n1. Write the Bellman equations, define an equilibrium and characterize it.\n2. Suppose a utilitarian Social Planner (that means, the planner's objective is a simple average of the\nutility of all agents) can choose job creation and acceptance decisions. Characterize her choice,\ni.e., \"the second-best allocation\" (in deriving this result you can set r = 0).\n3. Now, suppose the planner can only choose β of the wage determination rule. Show that there is a\nβ ∗ such that if β = β ∗, then the equilibrium achieves the best allocation from the planner's point\nof view.\n4. Now suppose that z is unemployment benefit financed by lump-sum taxation. Suppose that the\nplanner cannot directly choose job creation and acceptance decisions, and has to take β is given.\nShe can only control z, and has to take the equilibrium as given conditional on a value of z. What\nis the value of z that the planner would like to choose (call this z ∗)?\n5. Now, suppose the planner chooses β and z. Determine the value of z, z, that she would like\nˆ\n∗\nto choose. Explain why zˆ is different than z . Explain why the results regarding the choice of\nzˆ are special, and discuss how you would modify this model to reach more realistic normative\nconclusions.\n6. Show that as β → 1, the unemployment rate, u, also tends to 1. Now consider the following\ncritique of the model\n\"The case of β → 1 emphasizes that this is not a good model. β captures the division of output\nafter the match. If β is too high, then the worker must be able to make an upfront payment, b,\nand get employed. By ruling out such payments, this model is ruling out the price mechanism.\"\nDiscuss this claim. You might first want to show that in the logic of the model such payments are\nnot possible, and then discuss how one could introduce such payments in this model, and whether\nor not they should be there for a realistic analysis of labor markets. Add any other angle that\nyou see appropriate.\nExercise 4 Consider the following search model. Time is continuous, and all agents are risk-neutral\nand discount the future at the rate r. There is a mass 1 of workers, and a mass n of firms. Each firm\ncan employ only one worker. Workers and firms come together according to constant returns to scale\n\nmatching technology, M(U, V ) where U is unemployment, and V is the mass of unfilled vacancies (i.e.,\n1 - U = n - V ). Once together, pairs separate at the flow rate s. Output of a pair is equal to f(h)\nwhere h is the skill level of the worker. Wages are determined by Nash Bargaining where the worker's\nbargaining power is β.\n1. Find the steady state equilibrium assuming that h = 0 for all workers (but f(0) > 0).\n2. Now consider an economy in steady state at t = 0, and assume that for once firms can invest in\nthe human capital, h, of their workers (training). Assume that workers can not pay firms for this\ninvestment, nor can they commit to a wage cut. A higher h for a worker increases his productivity\nnot only in this relation but in all future relations (thus h is general human capital). Suppose\nthat the cost of investment is c(h) such that c(0) = c0(0) = 0, and c is strictly convex. Show that\nas long as M(U, V ) < inf, firms invest a positive amount in h.\n3. Now take the limit as M(U, V ) →inf (that is, if the probability of a match for a worker is p and\nthat for a firm is q, then we have p, q →inf). Show that in this limit point, firms do not invest in\nh. Discuss and interpret.\n4. Informally discuss what would happen if n, the number of firms, was endogenized via a zero-profit\ncondition (for example, entering costs some amount F ). Could multiple equilibria arise? Why?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F 17 Lecture Note: MaC-Metrics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/da4bfb92b78ddca1a3e0a48185463b79_MIT14_661F17_lec_MacMet.pdf",
      "content": "δ\n-\nδ\nδ\nδ -\nδ\n-\nMaC-metrics\nJosh Angrist\nMIT 14.661 (FALL 2017)\nA\nLife's Identification Challenges\n- The iconic empirical life-cycle labor supply function looks like this:\nln hit = μi + (⇢\nr)t + ln wit + uit\n(1)\nwhere\n=\n1 and uit is a \"tacked-on\" error\n- We're after , the ISE, but it's not easily captured\n- Estimation of (1) isn't shovel-ready: the control variable μi isn't\nfound in the CPS. A function of the marginal utility of wealth, this\nvariable is negatively correlated with wages, wit\n- We have limited data on hourly wages; instead, we work with average\nhourly earnings, AHEit ⌘ yit . So we're naively regressing hours\nhit\nworked on (hours worked)\n; The results might not be pretty; rather,\nthey're pretty negative!\nB\nProblems and Solutions\n- Analysis of covariance (deviations from means) or di↵erencing kills the\nunobserved fixed e↵ect (whew!)\n- These transformations also aggravate the bias from our poorly measured\nwage variable. The bias here is worse than classical attenuation bias: the\nfact that mismeasured hours appears on both sides of the equation of\ninterest induces a powerful negative term known as \"division bias\"\n- We might instead try grouping strategies, as in Angrist (1990, 1991). This\napproach potentially kills the measurement error as well as the fixed e↵ect.\nI like that a lot!\n\nδ\nυ\nυ\nυ\n-\n-\n-\n-\nδ\nδ\nδ\n-\nδ\nσ\n-\nδ σ\nσ\nσ\nσ\n∆\n∆δ\n∆\n∆\n∆\n-∆\nC\nDivision\n\nBias\n\nDetails\n\nSuppose the labor supply equation of our heart's desire is\n⇤\nln h⇤ = ↵ + ln w\n(2)\nit\nit + uit\nFor the purposes of this discussion, we'll start by assuming we'd be happy to\nestimate (2) by OLS.\nThe empirical supply function uses AHE with well-measured hours\n⇤\nyit\nw =\n,\nit\nh⇤\nit\nwhere yit is annual earnings. This is the hourly wage for those who are paid\nhourly, and its a notional time price for others. Either way, we assume this\ncorrectly-measured AHE is what consumers use to make work decisions.\nIn practice, however, hours are poorly measured:\n= h⇤\nhit\nit\nit,\nwhere\nit is proportional classical measurement error. Then\nln hit = ln h⇤\n(3)\nit + ⌘it,\nwhere ⌘it = ln it. This implies that\n⇤\nln wit = ln yit\nln hit = ln yit\nln h⇤\n⌘it = ln w\n(4)\nit\nit\n⌘it\nSubstituting on both sides of (2), we now have\nln hit = ↵ + (ln wit + ⌘it) + uit + ⌘it = ↵ + ln wit + {uit + (1 + )⌘it} (5)\nWithout worrying about the fixed e↵ect, the OVB in OLS estimates of (5) is\nCov(ln w⇤\n⌘it, (1 + )⌘it)\n(1 + ) ⌘\nit\nOV B =\n=\nln w\nln w\nwhich is big-time bad, even compared to the usual m.e. attenuation bias. (Note\nthat\n⌘\nis one minus the signal-to-noise ratio for log wages.)\nln w\nAnalysis of covariance aggravates division bias\nTo kill the fixed e↵ect, you might di↵erence or deviate from means. Suppose\nyou have a two-period panel, so (2) with fixed e↵ects becomes OLS on first di↵s:\n⇤\nln h⇤ =\nln w\nuit,\nit\nit +\nwhile the noisy wage becomes\n⇤\nln wit = ln wit\n⌘it.\n\n∆\nσ\n∆\n-∆\n-\nδ\nσ\nσ\n-\nδ\nAssuming m.e. is serially uncorrelated, the variance of\n⌘it is 2\n⌘.\nWages, by contrast, are highly persistent. Suppose, w⇤ = wi\n⇤. Then\nit\nln wit =\n⌘it.\nIn other words, the change in wages is pure noise. Then we have\n⌘\n(1 +\n)2\n⌘\nOV B =\n=\n(1 + )\nso di↵erencing here makes matters substantially worse. Research on measure\nment error in hours and wages bears this out: measured wage changes are noisy\nindeed (see, e.g., Bound and Krueger, 1991).\nSee MaCurdy, Thomas E. \"An Empirical Model of Labor Supply in a Life-Cycle Setting.\" Journal of Political\nEconomy 89, no. 6 (1981): 1076-1078.\nSee Angrist, Joshua D. \"Grouped-data estimation and testing in simple labor-supply models.\" Journal of\nEconometrics 47, no 2-3 (1991): 256-259.\nSee Card, David. \"Intertemporal Labour Supply: An Assessment.\" In Advances in Econometrics: Sixth World\nCongress, Vol II. Cambridge University Press, 1996. pp. 59-60.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F 17 Lecture Note: Negative Income Taxes",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/eaa210e7fa82b6c43341caa59b249659_MIT14_661F17_lec_income.pdf",
      "content": "Negative Income Taxes\nJosh Angrist\nMIT 14.661 (FALL 2017)\nNotation\nThe negative income tax (NIT) gives us a general framework for taxes and\ntransfers.\nKey ingredients:\n- The guarantee level, G\n- An implicit tax rate, t\n- The net payment or subsidy, S\n- Program breakeven,\nG\nB = t\nProgram rules\n- Someone with no earnings receives G, but payments are reduced by t for\nevery dollar earned (unearned income is usually untaxed)\n- The program pays\nS\n= G - twh; S > 0\nS\n= 0; otherwise\n- Note that this means that\nG\nwh < B = t\nfor anyone receiving a payment\n\nGeneralizations\n- t can be negative (like in the EITC)\n- t can vary with income (often increasing)\n- t can be (often is) 100% or even e↵ectively infinite\n- assets might be taxed, but this isn't typical\n- G may require a work requirement\n- Beneficiaries may face lifetime caps or time limits\nBudget set bonanaza!\nSee figures 1-6 and Tables 1-3 in Moffitt (2002).\nSee figure 4 in Moffitt (2003).\nSee figures 1, 4, 5 in Blundell-MaCurdy (1999).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Acemoglu Lecture 1&2: Labor Market Externalities",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/782dbba2df578dc1969aad26263b0fe2_MIT14_661F17_lec1_2.pdf",
      "content": "Labor Economics, 14.661. Lectures 1 and 2: Labor\nMarket Externalities\nDaron Acemoglu\nMIT\nOctober 26 and 31, 2017\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n1 / 62\n\nLabor Market Externalities\nIntroduction\nIntroduction\nGeneral interest over the recent two decades or so on the modeling\nand estimation of various aspects of labor market externalities.\nTwo different aspects of externalities:\nExternalities in (local) labor markets due to production, matching or\nother market interactions.\nExternalities in social environments, including schools, friendships,\nneighborhoods, and networks as well as their implications for social\nmobility, inequality\nBoth types of externalities may be important in practice and have\nmajor welfare consequences.\nBoth types of externalities present a range of challenges in estimation.\nThese two lectures on labor market externalities, and then we will\nturn to social mobility and peer effects.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n2 / 62\n\nLabor Market Externalities\nIntroduction\nLabor Market Externalities\nWhat happens to my wages/earnings if other workers in the same\nlabor market/economy increase their schooling by one year?\nThe Becker-Mincer-Ben Porath framework silent on this (it answers\nthe question of how much my earnings increased when I increase my\nschooling by one year).\nUseful to distinguish between non-pecuniary externalities (where the\neffect of others'education on me as \"technological\") vs. pecuniary\nexternalities (where the effect of others'education on me works\nthrough changes in equilibrium prices).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n3 / 62\n\nLabor Market Externalities\nIntroduction\nWhat Is an Externality?\nImagine your coworkers'human capital makes you more productive\ne.g., academics would like to be together with other high-quality\nacademics\nImagine your production function is\ny = f (h, H)\nwhere H is the average human capital of your coworkers.\nThis is a technological spillover of productivity.\nIs it an externality?\n\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n4 / 62\n\nLabor Market Externalities\nIntroduction\nWhat Is an Externality? (continued)\nNot necessarily.\nIf all of the spillover is within the firm, the firm will internalize it in its\nhiring decisions and in its compensation of different workers with\ndifferent amounts of human capital.\nIn that case, there is a technological spillover, but no labor market\nexternality.\nExternalities require\neither that productivity spillovers are beyond firm boundaries\nor that firms are unable to compensate workers appropriately for their\ncontribution to their coworkers'productivity (why would this be the\ncase?)\nLet us now focus on externalities.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n5 / 62\n\nLabor Market Externalities\nNonpecuniary Externalities\nNonpecuniary Externalities\nNonpecuniary externalities≈ technological spillovers of productivity\nthat are not internalized by prices.\nCanonical example due to Jane Jacobs The Economy of Cities:\nmanagers from different companies exchange ideas.\nVery popular in economics (e.g., Lucas's famous 1986 endogenous\ngrowth model)\nWhat other contexts would this be important in?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n6 / 62\n\nLabor Market Externalities\nNonpecuniary Externalities\nNonpecuniary Positive Externalities\nA simple model of nonpecuniary externalities:\nSuppose that the output (or marginal product) of a worker, i, is\nyi = Ahi\nν ,\nwhere hi is the human capital (schooling) of the worker, and A is\naggregate productivity.\nAssume that labor markets are competitive. So individual earnings are\nWi = Ahi\nν .\nKey idea: the exchange of ideas among workers raises productivity.\nThis can be modeled by allowing A to depend on aggregate human\ncapital. In particular, suppose that\nδ\nA = BHδ ≡ E [hi ] ,\n(1)\nwhere H is a measure of aggregate human capital, E is the\nexpectation operator, B is a constant, and δ > 0 (the case where < 0\nwould have negative externalities).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n7 / 62\n\nLabor Market Externalities\nNonpecuniary Externalities\nNonpecuniary Positive Externalities (continued)\nIndividual earnings can then be written as\n= Ahν = BHδhv .\nWi\ni\ni\nTaking logs:\nln Wi = ln B + δ ln H + ν ln hi .\n(2)\nIf external effects are stronger within a geographical area, as seems\nlikely in a world where human interaction and the exchange of ideas\nare the main forces behind the externalities, then equation (2) should\nbe estimated using measures of H at the local level.\nThis is a theory of non-pecuniary externalities, since the external\nreturns arise from the technological nature of equation (1).\nNonpecuniary externalities unattractive for a number of reasons:\nVery reduced form.\n2 Do we really expect workers in chemical factories to have a direct\nproductivity effect on retail workers?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n8 / 62\n\nLabor Market Externalities\nNonpecuniary Externalities\nNonpecuniary Positive Externalities (continued)\nInstead, more compelling (at least from one perspective) sources of\nspillovers:\nInteractions in the labor market mediated by prices, but externalities\nmight still be at present; pecuniary externalities.\nInteractions in the product market; when computer users become more\nproductive, they can supply cheaper computers to retail companies,\nagain pecuniary externalities.\nInteractions via R&D and innovation; the semiconductor or the\ncombustion engine have increased the productivity of many workers in\nmany different sectors of the economy.\nThe last one may or may not be a pecuniary externality.\nHowever, except those working in the labor market, the remaining\nexternalities would be economy-wide (sometimes even world-wide),\nthus diffi cult to estimate with cross-sectional or panel data variation.\nThus, let us focus on labor market interactions.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n9 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nPecuniary Externalities\nDo pecuniary externalities matter?\nNot in Arrow-Debreu.\nWhy not?\nCould they matter in other environments?\nThe answer is \"perpaps yes\"- if we are away from the complete\nmarkets benchmark.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n10 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nPecuniary Positive Externalities\nFirst suggested in Alfred Marshall's Principles of Economics in the\ncontext of benefits of geographic concentration of industry.\nA complementary story with labor market imperfections, innovation\ninvestment by firms and training by workers developed in Acemoglu\n(1997).\nFirms find it profitable to invest in new technologies only when there is\na suffi cient supply of trained workers to replace employees who quit.\nThis is a pecuniary externality, since it is not built in in the form of\ntechnological spillovers, but works through market interactions and\nresults from the fact that prices at which labor is transacted is not\nequal to its marginal product.\nA related model developed in Acemoglu (1996). Here is simplified\nversion of this model.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n11 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nA Search Model of Pecuniary Externalities\nConsider an economy lasting two periods, with production only in the\nsecond period, and a continuum of workers normalized to 1.\nTake human capital of each worker i, hi , as given.\nA continuum of risk-neutral firms.\nIn period 1, firms make an irreversible investment decision, k, at cost\nRk.\nWorkers and firms come together in the second period.\nThe labor market is not competitive; instead, firms and workers are\nmatched randomly, and each firm meets a worker.\nThe only decision workers and firms make after matching is whether\nto produce together or not to produce at all (since there are no\nfurther periods).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n12 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nPecuniary Externalities (continued)\nIf firm f and worker i produce together, their output is\nkf\nαhi\nν ,\n(3)\nwhere α < 1, ν ≤ 1 - α.\nSince it is costly for the worker-firm pair to separate and find new\npartners in this economy, employment relationships generate\nquasi-rents.\nWages will therefore be determined by rent-sharing. Here, simply\nassume that the worker receives a share β of this output as a result of\nbargaining, while the firm receives the remaining 1 - β share (a\nsimplified version of Nash bargaining).\nAn equilibrium in this economy is a set of schooling choices for\nworkers and a set of physical capital investments for firms.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n13 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nPecuniary Externalities (continued)\nFirm f maximizes the following expected profit function:\n(1 - β)kf\nαE[hi\nν] - Rkf ,\n(4)\nwith respect to kf .\nSince firms do not know which worker they will be matched with,\ntheir expected profit is an average of profits from different skill levels.\nThe function (4) is strictly concave, so all firms choose the same level\nof capital investment, kf = k, given by\n\n1/(1-α)\n(1 - β)αH\nk =\n,\n(5)\nR\nwhere\nH ≡ E[hi\nν]\nis the measure of aggregate human capital.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n14 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nPecuniary Externalities (continued)\nNow the equilibrium is straightforward to characterize.\nSubstituting (5) into (3), and using the fact that wages are equal to a\nfraction β of output, the wage income of individual i is given by\nα/(1-α) R-α/(1-α)(hi )ν\nWi = β ((1 - β)αH)\n.\nTaking logs, this is:\nα\nln Wi = c +\nln H + ν ln hi ,\n(6)\n1 - α\nwhere c is a constant and α/ (1 - α) and ν are positive coeffi cients.\nThe presence of ln H on the right hand side corresponds to positive\npecuniary externalities (in the local labor market).\nWhat about education choices? This actually is a trickier issue and I\nwill return to it later.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n15 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nPecuniary Externalities (continued)\nFor now the important thing is that human capital externalities arise\nhere because firms choose their physical capital in anticipation of the\naverage human capital of the workers they will employ in the future.\nSince physical and human capital are complements in this setup, a\nmore educated labor force encourages greater investment in physical\ncapital and to higher wages.\nIn the absence of the need for search and matching, firms would\nimmediately hire workers with skills appropriate to their investments,\nand there would be no human capital externalities.\nNonpecuniary and pecuniary theories of human capital externalities\nlead to similar empirical relationships since equation (6) is identical to\nequation (2), with c = ln B and δ = α/ (1 - α).\nAgain presuming that these interactions exist in local labor markets,\nwe can estimate a version of (2) using differences in schooling across\nlabor markets (cities, states, or even countries).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n16 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nAn Aside on Pecuniary Externalities\nHere is a slightly more formal discussion. Consider an exchange\neconomy with N + 1 agents with quasi-linear utility given by\nyi + ui (xi ),\nwhere yi is money and xi is the focal good. The price of this good is\ndetermined from market clearing:\nN\n∑ xi = 0,\ni =0\nsince this is an exchange economy (some agents are sellers and some\nare buyers). Market clearing determines the price as\np = p(x0, . . . , xN ).\nSuppose all of these functions are differentiable.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n17 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nAn Aside on Pecuniary Externalities (continued)\nNow suppose that we change the behavior of agent 0 and consider\nthe welfare impact of this on all agents.\nThis is given by:\nN dui (xi |p) ∂p\nU = ∑\ni =0\ndp\n∂x0\nwhere ui (xi |p) is the \"reduced-form\" utility function of agent i\n(meaning that after we substitute in the budget constraint).\nWe also have\ndui (xi |p)\n∂ui (xi |p)\n∂ui (xi |p) dxi\n=\n+\ndp\n∂p\n∂xi\ndp\nFirst suppose that all agents are optimizing. Then the second term in\nthis expression is equal to zero because ∂ui (xi |p) = 0 by the envelope\n∂xi\ntheorem, and the first term is equal to\n∂ui (xi |p) = -xi .\n∂p\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n18 / 62\n\nLabor Market Externalities\nPecuniary Externalities\nAn Aside on Pecuniary Externalities (continued)\nThus\nN\nU = -∑xi = 0,\ni =0\nwhere the last equality follows from market clearing.\nThus there is no first-order welfare effect from the change in the\naction of agent 0- no first-order pecuniary externalities.\nNow if instead we have that for a subset of the agents ∂ui (xi |p) > 0\n∂xi\n(and equal to zero for the rest), then we would have a first-order\nnegative welfare effect from the increase in price, reducing overall\nwelfare. In other words,\nN\nN\n=0\n∑\ni\n∂ui (xi |p) dxi ∂p\n∂xi\n∑\nU\nxi < 0\n-\n=\ndp ∂x0\ni =0\nbecause dxi < 0 and ∂p > 0- thus now there are first-order\ndp\n∂x0\npecuniary externalities.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n19 / 62\n\nLabor Market Externalities\nSignaling\nRanking and Negative Externalities\nThe above models focused on positive externalities to education.\nIn contrast, in a world where education plays a \"ranking\" role, we\nmight also expect negative externalities.\nSuppose that there are different types of jobs with different\nquality/attributes and higher-quality jobs pay higher wages (this may\nbe due to bargaining reasons).\nSuppose also that higher education workers get the higher quality jobs\n(a sort of assignment rule).\nWhat will happen if all of the other workers in my labor market\nbecome more educated?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n20 / 62\n\nLabor Market Externalities\nSignaling\nSignaling and Negative Externalities\nConsider now signaling. Take the most extreme world in which\neducation is only a signal- it does not have any productive role.\nWhat happens if all of the other workers in my labor market become\nmore educated?\nPerhaps the same thing as ranking?\nTo answer this question, let us consider a simple signaling model (and\nthe evidence for signaling in the labor market.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n21 / 62\n\nLabor Market Externalities\nSignaling\nBaseline Signaling Model\nConsider the following simple model to illustrate the issues.\nThere are two types of workers, high ability and low ability.\nThe fraction of high ability workers in the population is λ.\nWorkers know their own ability, but employers do not observe this\ndirectly. They only observe schooling.\nHigh ability workers always produce yH , low ability workers produce\nyL. (No productive role of schooling for simplicity now).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n22 / 62\n\nLabor Market Externalities\nSignaling\nBaseline Signaling Model (continued)\nWorkers can invest in education, e ∈{0, 1}.\nThe cost of obtaining education is cH for high ability workers and cL\nfor low ability workers.\nCrucial assumption (\"single crossing\")\ncL > cH\nThat is, education is more costly for low ability workers. This is often\nreferred to as the \"single-crossing\" assumption, since it makes sure\nthat in the space of education and wages, the indifference curves of\nhigh and low types intersect only once. For future reference, I denote\nthe decision to obtain education by e = 1.\nTo start with, suppose that education does not increase the\nproductivity of either type of worker.\nOnce workers obtain their education, there is competition among a\nlarge number of risk-neutral firms, so workers will be paid their\nexpected productivity.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n23 / 62\n\nLabor Market Externalities\nSignaling\nBaseline Signaling Model (continued)\nGame of incomplete information → Perfect Bayesian Equilibrium\nTwo (extreme) types of equilibria in this game.\nSeparating, where high and low ability workers choose different levels\nof schooling.\nPooling, where high and low ability workers choose the same level of\neducation.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n24 / 62\n\nLabor Market Externalities\nSignaling\nSeparating Equilibrium\nSuppose that we have\nyH - cH > yL > yH - cL\n(7)\nThis is clearly possible since cH < cL.\nThen the following is an equilibrium: all high ability workers obtain\neducation, and all low ability workers choose no education.\nWages (conditional on education) are:\nw (e = 1) = yH and w (e = 0) = yL\nNotice that these wages are conditioned on education, and not\ndirectly on ability, since ability is not observed by employers.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n25 / 62\n\nLabor Market Externalities\nSignaling\nSeparating Equilibrium (continued)\nLet us now check that all parties are playing best responses.\nGiven the strategies of workers, a worker with education has\nproductivity yH while a worker with no education has productivity yL.\nSo no firm can change its behavior and increase its profits.\nWhat about workers?\nIf a high ability worker deviates to no education, he will obtain\nw (e = 0) = yL, but\nw (e = 1) - cH = yH - cH > yL.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n26 / 62\n\nLabor Market Externalities\nSignaling\nSeparating Equilibrium (continued)\nIf a low ability worker deviates to obtaining education, the market will\nperceive him as a high ability worker, and pay him the higher wage\nw (e = 1) = yH . But from (7), we have that\nyH - cL < yL.\nTherefore, we have indeed an equilibrium.\nIn this equilibrium, education is valued simply because it is a signal\nabout ability.\nIs \"single crossing important\"?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n27 / 62\n\nLabor Market Externalities\nSignaling\nPooling Equilibrium\nThe separating equilibrium is not the only one.\nConsider the following allocation: both low and high ability workers\ndo not obtain education, and the wage structure is\nw (e = 1) = (1 - λ) yL + λyH and w (e = 0) = (1 - λ) yL + λyH\n(Does this wage structure make sense?)\nAgain no incentive to deviate by either workers or firms.\nIs this Perfect Bayesian Equilibrium reasonable?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n28 / 62\n\nLabor Market Externalities\nSignaling\nPooling Equilibrium (continued)\nProvided that\nyH - cH > (1 - λ) yL + λyH ,\n(8)\nThe answer is no.\nThis equilibrium is being supported by the belief that the worker who\ngets education is no better than a worker who doesn't.\nBut education is more costly for low ability workers, so they should be\nless likely to deviate to obtaining education.\nThis can be ruled out by various different refinements of equilibria.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n29 / 62\n\nLabor Market Externalities\nSignaling\nPooling Equilibrium (continued)\nSimplest refinement: Intuitive Criterion by Cho and Kreps.\nThe underlying idea: if there exists a type who will never benefit from\ntaking a particular deviation, then the uninformed parties (here the\nfirms) should deduce that this deviation is very unlikely to come from\nthis type.\nThis falls within the category of \"forward induction\" where rather\nthan solving the game simply backwards, we think about what type of\ninferences will others derive from a deviation.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n30 / 62\n\nLabor Market Externalities\nSignaling\nPooling Equilibrium (continued)\nTake the pooling equilibrium above. Consider a deviation to e = 1.\nThere is no circumstance under which the low type would benefit\nfrom this deviation, since\nyL > yH - cL,\nand the low ability worker is now getting\n(1 - λ) yL + λyH .\nTherefore, firms can deduce that the deviation to e = 1 must be\ncoming from the high type, and offer him a wage of yH .\nThen (8) ensures that this deviation is profitable for the high types,\nbreaking the pooling equilibrium.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n31 / 62\n\nLabor Market Externalities\nSignaling\nPooling Equilibrium (continued)\nThe reason why this refinement is called The Intuitive Criterion is\nthat it can be supported by a relatively intuitive \"speech\" by the\ndeviator along the following lines:\nyou have to deduce that I must be the high type deviating to\ne = 1, since low types would never ever consider such a\ndeviation, whereas I would find it profitable if I could convince\nyou that I am indeed the high type). Of course, this is only very\nloose, since such speeches are not part of the game, but it gives\nthe basic idea.\nThe overall conclusion: separating equilibria, where education is a\nvaluable signal, may be more likely than pooling equilibria.\nWhen would this not be the case?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n32 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations\nSuppose education is continuous e ∈ [0, inf).\nCost functions for the high and low types are cH (e) and cL (e), which\nare both strictly increasing and convex, with cH (0) = cL (0) = 0.\nThe single crossing property is that\ncH (e) < cL (e) for all e ∈ [0, inf),\nthat is, the marginal cost of investing in a given unit of education is\nalways higher for the low type (why is this the right condition?).\nSuppose that the output of the two types as a function of their\neducations are yH (e) and yL (e), with\nyH (e) > yL (e) for all e.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n33 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations (continued)\nThe single crossing property:\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n34 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations (continued)\nAgain there are many Perfect Bayesian Equilibria, some separating,\nsome pooling and some semi-separating.\nBut applying a stronger form of the Intuitive Criterion reasoning, we\nwill pick the Riley equilibrium of this game, which is a particular\nseparating equilibrium.\nRiley equilibrium: first find the most preferred (first-best) education level\nfor the low type in the perfect information case\n∗\n∗\nyL (el ) = cL (el ) .\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n35 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations (continued)\nFirst best diagrammatically:\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n36 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations (continued)\nThen we can write the incentive compatibility constraint for the low\ntype, such that when the market expects low types to obtain\neducation el , the low type does not try to mimic the high type.\n∗\n∗\nyL (el ) - cL (el ) ≥ w (e) - cL (e) for all e,\n(9)\nLet eh be the level of education for high type such that this constraint\nholds as an equality:\n∗\n∗\nyL (el ) - cL (el ) = yH (eh ) - cL (eh ) .\nQuestion: why did we write w (eh ) = yH (eh )?\nThen the Riley equilibrium is such that low types choose el and\nobtain the wage\n∗\n∗\nw (el ) = yL (el ) ,\nand high types choose eh and obtain the wage\nw (eh ) = yH (eh ) .\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n37 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations (continued)\nRiley equilibrium diagrammatically:\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n38 / 62\n\nLabor Market Externalities\nGeneralizations\nGeneralizations (continued)\nWhy are high types are happy to do this? From the single-crossing\nproperty:\nyH (eh ) - cH (eh )\n= yH (eh ) - cL (eh ) - (cH (eh ) - cL (eh ))\n∗\n∗\n> yH (eh ) - cL (eh ) - (cH (el ) - cL (el ))\n∗\n∗\n∗\n∗\n= yL (el ) - cL (el ) - (cH (el ) - cL (el ))\n∗\n∗\n= yL (el ) - cH (el ) ,\nHigh ability workers investing in schooling more than they would have\ndone in the perfect information case, in the sense that eh\ncharacterized here is greater than the education level that high ability\nindividuals chosen with perfect information, given by\n∗\n∗\nyH (eh ) = cH (eh ).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n39 / 62\n\nLabor Market Externalities\nGeneralizations\nEvidence on Labor Market Signaling\nFor different types of evidence:\nDo degrees matter?\nDo compulsory schooling laws affect schooling levels for higher grades?\nReturns to GED?\nInvestigation of negative externalities\nWhy are these informative about signaling?\nWhich ones are more convincing?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n40 / 62\n\nLabor Market Externalities\nGeneralizations\nEquilibrium Responses in Signaling Models\nThe second approach was pioneered by Lang and Kropp (1986), who\nobserved that in the presence of signaling, binding compulsory\nschooling laws should increase the education investments of those not\ndirectly affected- as an equilibrium response to the behavior of others\nwhose education is being increased by the laws because they want to\nsignal themselves apart.\nE.g., you could send a signal distinguishing yourself from certain\nworkers by graduating from high school, but now everybody is forced to\ngraduate from high school, so you have to go to college.\nA related idea is tested in Bedard (2001): the introduction of access\nto university should lead to an increase in high school dropout rate.\nWhy?\nBedard tests this by comparing high school dropout rates in labor\nmarkets with and without two-year or four-year colleges\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n41 / 62\n\nLabor Market Externalities\nGeneralizations\nEvidence of Equilibrium Responses?\n(c) The University of Chicago Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n42 / 62\n\nLabor Market Externalities\nGeneralizations\nDirect Signals\nThird approach: Tyler, Murnane and Willett.\nPassing grades in the Graduate Equivalent Degree (GED) differ by\nstate.\nSo an individual with the same grade in the GED exam will get a\nGED in one state, but not in another.\nIf the score in the exam is an unbiased measure of human capital, and\nthere is no signaling, these two individuals should get the same wages.\nIf the GED is a signal, and employers do not know where the\nindividual took the GED exam, these two individuals should get\ndifferent wages.\nUsing this methodology, the authors estimate that there is a 10-19\npercent return to a GED signal.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n43 / 62\n\nLabor Market Externalities\nGeneralizations\nDirect Signals (continued)\n(c) Oxford University Press. All rights reserved. This content is excluded from our Creative\nCommons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\nExperiment 3 an 3*:\ntreatment only Texas,\nMississippi, Louisiana and\nNebraska; Experiment\n4:only New York as\ncontrol\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n44 / 62\n\nLabor Market Externalities\nGeneralizations\nDirect Signals (continued)\nAn interesting result we can see from the above table is that there are\nno GED returns to minorities.\nThis is also consistent with the signaling view, since it turns out that\nmany minorities prepare for and take the GED exam in prison.\nTherefore, GED would be not only a positive signal, but also likely a\nsignal that the individual was at some point incarcerated. Hence not\na good signal at all.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n45 / 62\n\nLabor Market Externalities\nGeneralizations\nBut Potential Problem\nEndogeneity of test taking behavior (from Heckman et al., 2010)\nfrom the state of Missouri:\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n46 / 62\nCourtesy of Peter Mueser, Kenneth Troske, Christopher Jepsen. Used with permission.\n\nLabor Market Externalities\nGeneralizations\nBack to Negative Externalities\nNow suppose there is signaling, and suppose there are no direct\nproductivity benefits from education.\nContrast two situations: in the first, all individuals have 12 years of\nschooling and in the second all individuals have 16 years of schooling.\nSince education has no productive role, and all individuals have the\nsame level of schooling, in both allocations they will earn exactly the\nsame wage (equal to average productivity).\nTherefore, here the increase in aggregate schooling does not translate\ninto aggregate increases in wages.\nBut in the same world, if one individual obtains more education than\nthe rest, there will be a private return to him, because he would signal\nthat he is of higher ability.\nIs this a pecuniary or a nonpecuniary externality?\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n47 / 62\n\nLabor Market Externalities\nGeneralizations\nBack to Negative Externalities (continued)\nNow returning to regression models, in a world where signaling or\nranking is important, we might also want to estimate an equation of\nthe form (2), but when signaling issues are important, we would\nexpect δ to be negative.\nWhen others invest more in their education, a given individual's rank\nin the distribution declines, hence others are creating a negative\nexternality on this individual via their human capital investment.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n48 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nEvidence on Labor Market Externalities\nOrdinary Least Squares (OLS) estimation of equations like (2) using\ncity or state-level data yield very significant and positive estimates of\nδ, indicating substantial positive human capital externalities; e.g., Jim\nRauch's paper in the Journal of Urban Economics 1993.\nSimilar results later found in many other papers.\nThe next table shows it for US states.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n49 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nOLS Evidence\n(c) The University of Chicago Press. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n50 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nInterpretation\nThere are at least two problems with this type OLS estimates.\nFirst problem: high-wage cities or states may attract a large number\nof high education workers or give strong support to education.\nRauch uses a cross-section of cities.\nIncluding city or state fixed affects ameliorates this problem, but does\nnot solve it, since states'attitudes towards education and the demand\nfor labor may comove. The ideal approach would be to find a source of\nquasi-exogenous variation in average schooling across labor markets.\nAcemoglu and Angrist (2000): exploit exogenous sources of variation\ndue to cross-state differences in compulsory schooling laws. The\nadvantage is that these laws not only affect individual schooling but\naverage schooling in a given area.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n51 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nInterpretation (continued)\nSecond problem: even if we have an instrument for average\nschooling in the aggregate, estimates of labor market externalities\nmight be spurious.\nIn particular, if individual schooling is measured with error (or for\nsome other reason OLS returns to individual schooling are not the\ncausal effect), some of this discrepancy between the OLS returns and\nthe causal return may load on average schooling, even when average\nschooling is instrumented.\nThis suggests that we may need to instrument for individual schooling\nas well (so as to get to the correct return to individual schooling).\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n52 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nA Little Bit of Econometrics\nTo elaborate on the second problem, let Yijt be the log weekly wage,\nthan the estimating equation is\nYijt = Xi\n0 μ + δj + δt + γ1Sjt + γ2i si + ujt + εi ,\n(10)\nTo illustrate the main issues, ignore time dependence, and consider\nthe population regression of Yijt on si :\nYijt = μ0 + δj + δt + ρ0si + ε0it ; where E[ε0it si ] ≡ 0.\n(11)\nNext consider the IV population regression using a full set of state\ndummies. This is equivalent to\nYijt = μ1 + δj + δt + ρ1Sj + ε1it ; where E[ε1it Sj ] ≡ 0,\n(12)\nsince the projection of individual schooling on a set of state dummies\nis simply average schooling in each state.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n53 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nA Little Bit of Econometrics (continued)\nNow consider the estimation of the empirical analogue of equation\n(2):\n∗\nYijt = μ + δj + δt + π0si + π1Sj + ξit ; where E[ξit si ] = E[ξit Sj ] ≡ 0.\n(13)\nThen, we have\nπ0 = ρ1 + φ(ρ0 - ρ1 )\n(14)\nπ1 = φ(ρ1 - ρ0)\nwhere\nφ = 1/(1 - R2) > 1,\nand R2 is the first-stage R-squared for the 2SLS estimates in (12).\nTherefore, when ρ1 > ρ0, for example because there is measurement\nerror in individual schooling, we may find positive external returns\neven when there are none.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n54 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nWhat Can Be Done?\nInstrument for both individual and average schooling, we would solve\nthis problem.\nBut what type of instrument?\nConsider the relationship of interest, and for simplicity ignore the time\ndimension:\nYij = μ + γ1Sj + γ2isi + uj + εi ,\n(15)\nwhich could be estimated by OLS or instrumental variables, to obtain\nan estimate of γ1 as well as an average estimate of γ2i , say γ2\n∗ .\nAn alternative way of expressing this relationship is to adjust for the\neffect of individual schooling by directly rewriting (15):\ne\nYij - γ2\n∗ si\n≡ Yij\n(16)\n= μ + γ1Sj + [uj + εi + (γ2i - γ2\n∗ )si ].\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n55 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nInterpretation\nIn this case, instrumental variables estimate of external returns is\nequivalent to the Wald formula\nγIV\nE[Yeij |zi = 1] - E[Yeij |zi = 0]\n=\nE[Sj |zi = 1] - E[Sj |zi = 0]\n\nE[γ2isi |zi = 1] - E[γ2isi |zi = 0]\n= γ1 +\n-γ ∗\nE[si |zi = 1] - E[si |zi = 0]\n\nE[si |zi = 1] - E[si |zi = 0]\n×\n.\nE[Sj |zi = 1] - E[Sj |zi = 0]\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n56 / 62\n\nLabor Market Externalities\nEconometric Issues and Evidence\nInterpretation (continued)\nThis shows that to obtain consistent estimates of external returns to\nschooling we should set\nE[γ2i si |zi = 1] - E[γ2isi |zi = 0]\nγ ∗ =\n(17)\nE[si |zi = 1] - E[si |zi = 0]\nE[(Yij - γ1Sj )|zi = 1] - E[(Yij - γ1Sj )|zi = 0]\n=\nE[si |zi = 1] - E[si |zi = 0]\nThis is typically not the OLS estimator of the private return, and we\nshould be using some instrument to simultaneously estimate the\nprivate return to schooling. The ideal instrument would be one\naffecting exactly the same people as the compulsory schooling laws.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n57 / 62\n\nLabor Market Externalities\nEstimates\nA Feasible Strategy?\nQuarter of birth instruments might come close to this.\nSince quarter of birth instruments are likely to affect the same people\nas compulsory schooling laws, adjusting with the quarter of birth\nestimate, or using quarter of birth dummies as instrument for\nindividual schooling, is the right strategy.\nSo the strategy is to estimate an equation similar to (2) or (13) using\ncompulsory schooling laws for average schooling and quarter of birth\ndummies for individual schooling.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n58 / 62\n\nLabor Market Externalities\nEstimates\nEvidence on Child Labor Laws\n(c) The University of Chicago Press. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n59 / 62\n\nLabor Market Externalities\nEstimates\nEvidence on Compulsory Schooling Laws\n(c) The University of Chicago Press. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n60 / 62\n\nLabor Market Externalities\nEstimates\nEstimates\n(c) The University of Chicago Press. All rights reserved. This content is excluded from our Creative Commons license. For more\ninformation, see https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n61 / 62\n\nLabor Market Externalities\nEstimates\nDiscussion\nThe estimation results from using this strategy in Acemoglu and\nAngrist (2000) suggest that there are no significant external returns.\nThe estimates are typically around 1 percent or less, and statistically\nnot different from zero.\nThey also suggest that in the aggregate signaling considerations are\nunlikely to be very important (at the very least, they do not dominate\npositive externalities).\nBut caveat: the fweaker significantly weaker is a full set of state times\nlinear trends are included.\nDaron Acemoglu (MIT)\nExternalities\nOctober 26 and 31, 2017\n62 / 62\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Acemoglu Lectures 3&4: Social Mobility, Peer Effects and Human Capital",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/91572155ccbd8f15bc7103cf6d7f41c1_MIT14_661F17_lec3_4.pdf",
      "content": "Labor Economics, 14.661. Lectures 3 and 4: Social\nMobility, Peer Effects and Human Capital\nDaron Acemoglu\nMIT\nNovember 2 and 7, 2017.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n1 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nEvidence on Intergenerational Linkages\nLet us now turn to social mobility.\nDoes parental income have an effect on schooling?\nA simple regression\nschooling=controls + α · log parental income\nResult: often positive estimates of α.\nBut what does positive α mean?\nCredit constraints: rich parents invest more in schooling (why is this\nassociated with credit constraints?)\nChildren's education may also be a consumption good, so rich parents\nwill \"consume\" more of this good as well as other goods.\nThe distribution of costs and benefits of education differ across\nfamilies, and are likely to be correlated with income.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n2 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nEvidence (continued)\nInclude other characteristics to proxy for the costs and benefits of\neducation or for attitudes toward education.\nWhen parents'education is also included in the regression, the role of\nincome is substantially reduced.\nConclusion?\nTwo considerations:\n1 First, parents'income may affect more the quality of education,\nespecially through the choice of the neighborhood in which the family\nlives.\n2 Parental income is often measured with error, and has a significant\ntransitory component, so parental education may be a much better\nproxy for permanent income than income observations in these data\nsets.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n3 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nSocial Mobility More Directly\nThis motivates a simpler and at some level more interesting approach:\nmeasure intergenerational mobility and earnings.\nThe typical regression here is\nlog child income=controls + α · log parental income\n(1)\nRegressions of this sort were first investigated by Becker and Tomes.\nThey found relatively small coeffi cients, typically in the neighborhood\nof 0.2.\nThis would be particularly striking since there is a significant amount\nof inheritability of various income-earning characteristics (including\nIQ). For example, the literature finds a correlation of IQ between\nparents and offspring between 0.42 and 0.72. (There is also similar\nevidence from twin studies.)\nThough some of this is because of better education and resources\nleading to higher IQ of the offspring, it suggests a significant\n\"genetic\" inheritance.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n4 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nSocial Mobility Evidence\nNow returning to the above equation, estimates of α around 0.2 mean\nthat if your parents are twice as rich as my parents, you will typically\nbe about 20 percent as rich as me. Your children will be only 4\npercent richer than my children!\nWith this degree of intergenerational dependence, differences in initial\nconditions will soon disappear→ converges to a relatively\n\"egalitarian\" society (does this mean inequality will disappear?)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n5 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nInterpreting the Evidence\nTo elaborate on this, consider the following simple model:\nln yit = μ + α ln yit-1 + εit ,\nyit is the income of t-th generation of dynasty i, and εit is serially\nindependent disturbance term with variance σ2\nε .\nThen the long-term (stationary distribution) variance of log income is:\nσ2\nε\nσ2 =\n(2)\ny\n1 - α2\n(To derive this, set σ2\ny ,t-1 = σy\n,t ; why is that the right thing to do?)\nUsing the estimate of 0.2 for α, equation (2) implies that the\nlong-term variance of log income will be only about 4 percent higher\nthan σ2\nε .\nTherefore, the long-run income distribution will largely reflect\ntransitory shocks to dynasties'incomes and skills - not inherited\ndifferences. (But inequality could be very large if σ2 is large.)\nε\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n6 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nInterpretation\nWhat does this say about credit market problems?\nPersistence of about 0.3 is not very different from what we might\nexpect to result simply from the inheritance of IQ between parents\nand children, or from the children's adoption of cultural values\nfavoring education from their parents.\nTherefore, relatively small effect of parents income on children's\nhuman capital.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n7 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nInterpretation (continued)\nHowever, econometric problems biasing α toward zero.\nFirst, measurement error.\nSecond, in typical panel data sets (most often the PSID), we observe\nchildren at an early stage of their life cycles, where differences in\nearnings may be less than at later stages.\nThird, income mobility may be very nonlinear, with a lot of mobility\namong middle income families, but very little at the tails.\nSolon and Zimmerman: dealing with the first two problems increases\nα to about 0.45 or even 0.55.\nIf α = 0.55, then σ2\ny ≈ 1.45 · σ2\nε instead of σ2\ny ≈ 1.04 · σ2\nε with the\ncoeffi cient of 0.2- substantial difference.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n8 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nIntergenerational Linkages\nLimitations\nOne limitations about the functional forms. The linearity (or log\nlinearity) rules out the possibility of \"mobility traps\" in some part of\nthe distribution.\nCooper, Durlauf and Johnson find that there are important\nheterogeneities.\nIn particular, using the PSID, they find that while mobility estimate\nfor the entire sample is 0.34, focusing on families living the poorest\n33%, this coeffi cient increases to 0.46.\nBut perhaps the most important limitation of the earlier work was\ndata quality.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n9 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nSome Recent Evidence\nRecent work by Chetty, Hendren, Klein and Saez uses matched Social\nSecurity records and tax data to have a better picture of social\nmobility for cohorts born since the 1970s.\nThey report on the log-log correlation coeffi cient, but also two other\nmeasures:\n1 Estimates of the parameter α0 from the regression\nrankit = μ + α0 × rankit-1 + εit\nwhere rankit is the rank of family i the income distribution of cohort t\nAbsolute mobility at the 25th percentile, y25, computed as the\nexpected rank of children from families at or below the 25th percentile\nof the distribution.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n10 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nSome Recent Evidence (continued)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n11 / 92\nCourtesy of Raj Chetty, Nathanial Hendren, Patrick Kline, Emmanual Saez, and Nicholas Turner. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nSome Recent Evidence (continued)\nIn fact, little change in mobility:\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n12 / 92\nCourtesy of Raj Chetty, Nathanial Hendren, Patrick Kline, Emmanual Saez, and Nicholas Turner. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nSome Recent Evidence (continued)\nAllowing for nonlinearities\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n13 / 92\nCourtesy of Raj Chetty, Nathanial Hendren, Patrick Kline, Emmanual Saez, and Nicholas Turner. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nDeterminants of Social Mobility\nWhat could determine social mobility?\nCredit market constraints and inequality, the \"Great Gatsby curve\" (as\nwe will see next).\nPeer effects and residential/social sorting (as we will also see next).\nInequality and rewards to success (as we will also discuss later).\nPolicy.\nSociological factors.\nBefore studying the theories, let's look at some of the data\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n14 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nPatterns of Social Mobility\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n15 / 92\nCourtesy of Raj Chetty, Nathaniel Hendren, Patrick Kline, and Emmanuel Saez. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nDeterminants of Social Mobility: The Great Gatsby Curve\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n16 / 92\nCourtesy of Raj Chetty, Nathaniel Hendren, Patrick Kline, and Emmanuel Saez. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nRecent Evidence\nDeterminants of Social Mobility: Segregation\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n17 / 92\nCourtesy of Raj Chetty, Nathaniel Hendren, Patrick Kline, and Emmanuel Saez. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nModeling Social Mobility\nModeling Social Mobility\nLet us next turn to modeling social mobility.\nI will present three sets of models emphasizing different aspects:\nThe role of credit constraints and inequality in social mobility.\nThe role of rewards to success in social mobility.\n3 The role of community structure/segregation/school structure in social\nmobility.\nThe last topic will then act as a segue into the discussion of peer\neffects more generally.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n18 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets and Mobility\nSimplified version Galor and Zeira, 1993.\nEach individual still lives for two periods.\nIn youth, he can either work or acquire education.\nUtility function of each individual is\n(1 - δ) log ci (t) + δ log bi (t) ,\nBudget constraint is\nci (t) + bi (t) ≤ yi (t) ,\nPreferences of the \"warm glow\" form, depending on monetary\nbequest rather than level of education expenditures.\nLogarithmic formulation ensures a constant saving rate δ.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n19 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets (continued)\nEducation: binary outcome, and educated (skilled) workers earn wage\nws while uneducated workers earn wu .\nExpenditure to become skilled is h, and not earn the unskilled wage\nwu during the first period.\nBinary education: introduces a nonconvexity.\nImperfect capital markets: some amount of monitoring required for\nloans to be paid back.\nCost of monitoring: wedge between the borrowing and the lending\nrates.\nLinear savings technology, which fixes lending rate at some constant\nr, but borrowing rate is i > r.\nAlso assume investment in skills is socially effi cient:\nws - (1 + r ) h > wu (2 + r )\n(3)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n20 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets (continued)\nImplies investment in human capital is profitable when financed at the\nlending rate r.\nConsider an individual with wealth x.\nIf x ≥ h, assumption (3) implies that individual will invest in education.\nIf x < h, then whether it is profitable to invest in education will depend\non wealth of individual and borrowing interest rate, i.\nUtility of this agent (with x < h), when he invests in education:\n1-δ\nUs (x)\n= log (ws + (1 + i) (x - h)) + log (1 - δ)\nδδ\nbs (x)\n= δ (ws + (1 + i) (x - h)) ,\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n21 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets (continued)\nWhen he chooses not to invest:\n1-δ δδ\nUu (x)\n= log ((1 + r ) (wu + x) + wu ) + log (1 - δ)\nbu (x)\n= δ ((1 + r ) (wu + x) + wu ) .\nIndividual likes to invest in education if and only if:\n(2 + r ) wu + (1 + i) h - ws\nx ≥ f ≡\ni - r\nEquilibrium correspondence describing equilibrium dynamics is\n⎧\n⎨ bu = δ ((1 + r ) (wu + x (t)) + wu )\nif x (t) < f\nx (t + 1) =\nbs = δ (ws + (1 + i) (x (t) - h))\nif h > x (t) ≥ f\n⎩ bn = δ (ws + (1 + r ) (x (t) - h))\nif x (t) ≥ h\n(4)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n22 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets (continued)\nEquilibrium dynamics: (4) describes both the behavior of the wealth\nof each individual and the behavior of the wealth distribution in the\neconomy (\"Markovian\").\n∗\nDefine x as the intersection of the equilibrium curve (4) with the 45\ndegree line, when the equilibrium correspondence is steeper than the\n45 degree line.\nSuch an intersection will exist when the borrowing interest rate, i, is\nlarge enough.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n23 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets (continued)\n45o\nx(t+1)\nx(t)\nx*\nxS\nxU\nh\nf\nbn\nbs\nbu\nFigure: Multiple steady-state equilibria in the Galor and Zeira model.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n24 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nImperfect Credit Markets (continued)\n∗\nAll individuals with x (t) < x converge to the wealth level x U , while\n∗\nall those with x (t) > x converge to the greater wealth level x S .\n\"Poverty trap,\" attracts agents with low initial wealth.\nDistribution of income again has a potentially first-order effect, but it\nis straightforward to construct examples where an increase inequality\ncan lead to either worse or better outcomes.\nImplications of financial development: i smaller given r.\nMore agents will escape the poverty trap, and poverty trap may not\nexist\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n25 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nShortcomings of the Model\nNo social mobility in the long run.\nDoes inequality lead to lower or greater social mobility?\nThe answer is unclear: if by increasing inequality, you push more people\nabove the threshold f , then you increase mobility (and effi ciency), but if\nyou push more people below the threshold, then the opposite happens.\nTheoretically, this is a partial equilibrium model:\nModels in which prices determined in general equilibrium affect wealth\n(income) dynamics may be more relevant (and also may have some\nadditional robust features as we describe next).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n26 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nShortcomings of the Model (continued)\nMultiple steady states here may not be robust to addition of noise in\nincome dynamics- long-run equilibrium then corresponds to a\nstationary distribution of human capital levels.\nIn particular, suppose ε is a random variable, and change the law of\nmotion of wealth to:\n⎧\n⎨ bu = δ ((1 + r ) (wu + x (t)) + wu ) + ε\nif x (t) < f\nx (t + 1) =\nbs = δ (ws + (1 + i) (x (t) - h)) + ε\nif h > x (t) ≥ f\n⎩ bn = δ (ws + (1 + r ) (x (t) - h)) + ε\nif x (t) ≥ h\nWhat does the long-run (stationary) distribution of wealth and human\ncapital look like in this case?\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n27 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nCredit Constraints and Inequality\nGeneralizations\nNow suppose that with probability q, an individual does not have the\nability to acquire skills (which we denote by σ(t) = 0).\nThen the equilibrium correspondence becomes a stochastic\ncorrespondence, taking the form\n⎧\nδ (wu + (1 + r ) (wu + x (t)))\nif x (t) < f\n⎪\n⎨\nδ(wu + (1 + i) x (t))\nif h > x (t) ≥ f & σ(t) = 0\nx (t + 1) =\nδ (ws + (1 + i) (x (t) - h))\nif h > x (t) ≥ f & σ(t) = 1\nδ (wu + (1 + r ) (x (t) + wu ))\nif x (t) ≥ h & σ(t) = 0\n⎪\n⎩ δ (ws + (1 + r ) (x (t) - h))\nif x (t) ≥ h & σ(t) = 1\nWhat does the limiting distribution look like in this case? Does it\ngenerate social mobility? Is that the right type of social mobility?\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n28 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality\nMore general (Benabou (1996)): study dynamics of inequality and its\ncosts for effi ciency of production resulting from its effect on human\ncapital.\nAggregate output in the economy at time t:\nY (t) = H (t) ,\nH (t) is an aggregate of the human capital of all the individuals in the\nsociety.\nNormalizing total population to 1 and denoting the distribution of\nhuman capital at time t by μt (h):\nσ\nZ inf\nσ-1\nσ-1\nH (t) ≡\nh σ dμt (h)\n,\n(5)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n29 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nσ=degree of complementarity or substitutability in the human capital\nof different individuals.\nσ → inf: perfect substitutes and H (t) is simply equal to the mean of\nthe distribution.\nσ ∈ (0, inf): complementarity between the human capital levels of\ndifferent individuals.\nEffect of heterogeneity of human capital on aggregate productivity,\nfor given mean level, is most severe when σ is close to 0.\nBut formulation is general enough to allow for the case in which\ngreater inequality is productivity-enhancing.\nDefined for σ < 0 as well: in this case, greater inequality for a given\nmean level increases H (t) and productivity.\nExtreme case σ →-inf, H (t) = maxi {hi (t)} .\nFocus on potential costs of inequality on human capital: σ ≥ 0.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n30 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nThen, mean preserving spread of the human capital distribution μ will\nlead to a lower level of H (t)\nHuman capital of an individual from dynasty i at time t + 1:\nα\nβ\nγ\nhi (t + 1) = ξi (t) B (hi (t)) (Ni (t)) (H (t)) ,\n(6)\nB is a positive constant, hi (t) human capital of parent, ξi (t) random\nshock, and Ni (t) \"average\" human capital in the neighborhood.\nAssume neighborhood human capital is also a constant elasticity of\nsubstitution aggregator,with an elasticity ε:\nZ inf\nε\nε-1\nε-1\nNi (t) ≡\nh ε dμ i (h)\n,\nt\nμi (h) denotes the distribution of human capital in the neighborhood\nt\nof individual i at time t.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n31 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nε ∈ (0, inf): mean preserving spread of neighborhood human capital\nwill reduce the human capital of all the offsprings.\nPlausible if presence of some low human capital children will slow\ndown learning by those with higher potential (one \"bad apple\" will\nspoil the pack)- We will discuss this in greater detail next.\nThis suggests segregation of high and low human capital parents\nmight be beneficial for human capital accumulation- though we will\nsee why this may not follow.\nMultiplicative structure in (6): tractable evolution of human capital if\ninitial distribution of human capital and the ξ (t)s are log normal.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n32 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nAssume:\n\nln hi (0) ∼\nN m0, Δ2\n(7)\n\nω2\nln ξi (t) ∼\nN\n-\n, ω2\n,\nwhere N denotes the normal distribution.\nThe draws of ξi (t) are independent across time and across\nindividuals.\nDistribution of ln ξ is assumed to have mean -ω2/2 so that ξ has a\nmean equal to 1 (that is independent of its variance).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n33 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nThus distribution of human capital within every generation will\nremain log normal:\nln hi (t) ∼N\n\nmt , Δ2\n,\n(8)\nt\nfor some endogenous mean mt and variance Δt , which will depend on\nparameters and the organization of society.\nAnalysis of output and inequality dynamics boils down to\ncharacterizing the law of motion of mt and Δt .\nTwo alternative organizations: full segregation and full mixing.\nFull segregation: each parent is in a neighborhood with identical\nparents.\nBecause the neighborhood human capital is the same as the parent's\nhuman capital, (6) becomes\nα+β\nγ\nhi (t + 1) = ξi (t) B (hi (t))\n(H (t)) ,\n(9)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n34 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nHeterogeneity, Stratification and the Dynamics of\nInequality VII\nFull mixing: each neighborhood is a mirror image of the entire society.\nR inf\nε\nThus for all neighborhoods Ni (t) = N (t) ≡\nε-1\nh ε dμt (h)\nε-1 ,\nwhere μt refers to the aggregate distribution.\nAccumulation equation:\nγ\nhi (t + 1) = ξi (t) B (hi (t))α N (t)β H (t) .\n(10)\nIntuition above: segregation might be preferable.\nBut this may not be entirely accurate:\nlack of segregation may reduce long-run inequality leading to better\neconomic outcomes.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n35 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nWith full segregation:\n\nω2\nσ - 1\nΔ2\nt\nmt+1 = ln B -\n+ (α + β + γ) mt + γ\n(11)\nσ\n2 Δ2\nΔ2\n=\n(α + β)\nt + ω2\nt+1\nWith full integration:\n\nω2\nσ-1\nΔˆ 2\nt\nmˆ t+1 = ln B -\n+ (α + β + γ) mˆ t +\nγ σ\n(12)\nε-1\n+β\nε\nΔˆ 2\n= α2Δˆ 2\nt + ω2 ,\nt+1\nmˆ t and Δˆ 2 refer to the values of the mean and the variance of the\nt\ndistribution under full integration.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n36 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nNote there will be persistence in the distribution of human capital\n(autoregressive nature of the behavior of mt ):\nhuman capital of offsprings reflects that of parents (either through\ndirect effect or through neighborhood and aggregate spillovers).\nDispersion of the parents'human capital affects the mean of the\ndistribution.\nwhen σ < 1 or when ε < 1, so degree of complementarity in the\naggregate or the neighborhood spillovers is high, greater dispersion\nreduces the mean of the distribution of human capital.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n37 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nBehavior of the variance of the distribution:\nWith full segregation, costs of heterogeneity resulting from\nneighborhood spillovers are avoided.\nBut variance of log human capital is more persistent than under full\nintegration.\nIn paticular, when ε < 1, starting with the same mt and Δt :\nmˆ t+1 < mt+1 and Δˆ t\n+1 < Δ2\nt+1,\nThus human capital in the next period is higher under segregation.\nBut inequality is also higher and from (5) inequality has effi ciency costs.\nTo determine which effect dominates, first find the long-run level of\ninequality under segregation and integration.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n38 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nEquations (11) and (12) imply these variances are given by:\nω2\nω2\nΔ2 =\n> Δˆ 2 =\ninf\ninf\n1 - α2 ,\n1 - (α + β)\ni.e., greater inequality of human capital and income with segregation\nof neighborhoods.\nMean of the two distributions will also be different: suppose\nα + β + γ < 1, so steady state distribution exists under both full\nsegregation and full integration.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n39 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nThen:\n⎡\n⎤\n\nω2\nσ - 1\nω2\nminf =\n⎣ln B -\n+ γ\n\n⎦ ,\n1 - (α + β + γ)\nσ\n2 1 - (α + β)\nand\n\"\n#\nln B - s\nmˆ inf =\n\n.\nσ-1\nε-1\ns\n1 - (α + β + γ)\n+ γ\n+ β\nσ\nε\n2(1-α2 )\nMean level of human capital in the long run may be higher or lower\nunder full integration or full segregation.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n40 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nUsing the production function, taking logs on both sides of (5) and\nusing log normality:\n\nσ - 1\nΔ2\nt\nln Y (t) = ln H (t) = mt +\n,\nσ\nThus long-run income levels under full segregation and full integration\nare:\nσ - 1 Δ2\ninf\nln Y (inf)\n= minf +\nσ\n\nˆ\nσ - 1\nΔ2\ninf\nln Yˆ (inf)\n= mˆ inf +\n.\nσ\nDepending on parameters long-run income levels may be higher or\nlower under full segregation and full integration.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n41 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nSocial Stratification and Social Mobility\nStratification, Human Capital and Inequality (continued)\nThis framework highlights various different costs arising from income\ninequality.\nBut somewhat \"reduced form\": what are the micro interactions\nleading to segregation and also costs of inequality?\nI will not discuss costs of inequality given our focus, but these could\nbe better micro-founded, though at the end we do not have great\nevidence that there are indeed productivity costs from greater\ninequality of human capital in the economy as a whole (as opposed to\nwithin a given firm etc.).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n42 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nPeer Effects\nHow segregation of families by socioeconomic status (and\norganization of schools) affects human capital accumulation is related\nto the literature on peer effects.\nThere may be \"technological\" human capital externalities in the\nclassroom (e.g., learning from peers, teamwork).\nThere may also be other, more \"sociological\" effects: children\ngrowing up in different areas and with different peers may choose\ndifferent role models.\nBut important theoretical and empirical challenges in understanding\nand estimating peer effects.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n43 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing\nLet us return to the same question posed above: from the viewpoint\nof \"human capital production effi ciency\" is it better to have\nsegregation or mixing of students by different\nabilities/achievements/social economic backgrounds?\nThe basic issue here is equivalent to an assignment problem.\nThe general principle in assignment problems, such as Becker's\nfamous model of marriage, is that if inputs from the two parties are\n\"complementary,\" there should be assortative matching, that is the\nhighest quality individuals should be matched together.\nIn the context of schooling, assortative matching implies that children\nwith better characteristics will be segregated in their own schools, and\nchildren with worse characteristics should go to separate schools.\nThis practically means segregation along income lines, since often\nchildren with \"better characteristics\" are those from better parental\nbackgrounds, while children with worse characteristics are often from\nlower socioeconomic backgrounds\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n44 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nThough exceptions exist, it is natural to assume that there are\npositive externalities in this context: higher human capital pupils\ncreate positive learning/teamwork/role model externalities on their\nclassmates.\nAlso, richer individuals live in more expensive neighborhoods,\ngenerating greater tax revenue and thus schools in such\nneighborhoods tend to have access to greater resources.\nBut this does not answer the question of whether these inputs are\ncomplements or substitutes.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n45 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nA potential confusion in the literature (especially in the applied\nliterature): deducing complementarity from the fact that in\nequilibrium we do observe segregation;\ne.g., rich parents sending their children to private schools with other\nchildren from rich parents, or living in suburbs and sending their\nchildren to suburban schools, while poor parents live in ghettos and\nchildren from disadvantaged backgrounds go to school with other\ndisadvantaged children in inner cities.\nThis reasoning is often used in discussions of Tiebout competition,\ntogether with the argument that allowing parents with different\ncharacteristics/tastes to sort into different neighborhoods will often\nbe effi cient.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n46 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nThe underlying idea can be illustrated using the following simple\nmodel.\nSuppose that schools consist of two kids, and denote the parental\nbackground (e.g., home education or parental expenditure on\nnon-school inputs) of kids by e, and the resulting human capitals by h.\nSuppose\nhi = f (ei , e-i ),\n(13)\nAnd this implies of course\nh1 = f (e1, e2) and h2 = f (e2, e1 ).\nThroughout, we will assume positive externalities:\n∂h1/∂e2 = ∂f (e1, e2 )/∂e2 > 0 and ∂h2/∂e1 = ∂f (e2, e1)/∂e1 > 0.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n47 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nMore important than the positive first derivatives are the cross-partial\nderivatives- or whether the education production function exhibits\nsupermodularity.\nSuppose first that cross-partial derivatives are positive: i.e.,\n∂2f (e1, e2) > 0.\n∂e1∂e2\nExample\nα 1-α\nh1 = f (e1, e2 ) = e1 e2\n1-α α\nh2 = f (e2, e1 ) = e\ne\nwhere α > 1/2 so that own characteristic matters more than a year's\ncharacteristic.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n48 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nThis type of supermodularity implies that parental backgrounds are\ncomplementary, and each kid's human capital will depend mostly on\nhis own parent's background, but also on that of the other kid in the\nschool.\nFor example, it may be easier to learn or be motivated when other\nchildren in the class are also motivated.\nWe can think of this as the \"bad apple\" theory of classroom: one bad\nkid in the classroom brings down everybody (Lazear).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n49 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nDigression\nNotice an important feature of the way we wrote (13) linking the\noutcome variables, h1 and h2, to predetermined characteristics of\nchildren e1 and e2, which creates a direct analogy with the human\ncapital externalities discussed above.\nHowever, this may simply be the reduced form of that somewhat\ndifferent model, for example,\nh1 = H1 (e1, h2)\n(14)\nh2 = H2 (e2, h1)\nwhereby each individual's human capital depends on his own\nbackground and the human capital choice of the other individual.\nAlthough in reduced form (13) and (14) are very similar, they provide\ndifferent interpretations of peer group effects, and econometrically\nthey pose different challenges, which we will discuss below.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n50 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nThe complementarity in the human capital production function has two\nimplications:\n1 It is socially effi cient, in the sense of maximizing the sum of human\ncapitals, to have parents with good backgrounds to send their\nchildren to school with other parents with good backgrounds.\nThis follows simply from the definition of complementarity, positive\ncross-partial derivative, which is clearly verified by the production\nfunctions in (13).\n2 It will also be an equilibrium outcome that parents will do so.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n51 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nTo see that segregation is an equilibrium, suppose that we have a\nsituation in which there are two sets of parents with background el\nand eh > el .\nSuppose that there is mixing.\nNow the marginal willingness to pay of a parent with the high\nbackground to be in the same school with the child of another\nhigh-background parent, rather than a low-background student, is\nf (eh, eh ) - f (eh , el ).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n52 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nInstead, the marginal willingness to pay of a low-background parent\nto stay in the school with the high-background parents is\nf (el , eh ) - f (el , el ).\nThe definition of supermodularity is that\nf (eh, eh ) + f (el , el ) > f (eh, el ) + f (el , eh ),\nand this immediately follows from positive cross-partial derivatives,\n∂2f (e1, e2)/∂e1∂e2 > 0.\nThus the willingness to pay of high-background parents always\nexceeds that of low-background parents.\nTherefore, the high-background parent can always outbid the\nlow-background parent for the privilege of sending his children to\nschool with other high-background parents.\nThus with profit maximizing schools, segregation will arise as the\noutcome.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n53 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nThe results are very different when the human capital production\nfunction features negative cross-partial derivatives,\n∂2f (e1, e2)/∂e1∂e2 < 0 or exhibits submodularity.\nFor example, we might have\n1/2 1/2\n=\ne\nh1\nφe1 + e2 - λe1\n1/2 1/2\n= e1 + φe2 - λe\ne\nh2\nwhere φ > 1 and λ > 0 but small, so that human capital is increasing\nin parental background.\nIn this case, background characteristics or resources are \"substitutes\".\nThis can be thought as corresponding to the \"good apple\" theory of\nthe classroom, where the kids with the best characteristics and\nattitudes bring the rest of the class up.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n54 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nIn this case, because the cross-partial derivative is negative, the\nmarginal willingness to pay of low-background parents to have their\nkid together with high-background parents is higher than that of\nhigh-background parents.\nWith perfect markets, we will observe mixing, and in equilibrium\nschools will consist of a mixture of children from high- and\nlow-background parents.\nNow combining the outcomes of these two models, many people jump\nto the conclusion that since we do observe segregation of schooling in\npractice, parental backgrounds must be complementary, so\nsegregation is in fact effi cient, and that Tiebout competition and\nparental sorting will increase effi ciency.\nHowever, this conclusion is not correct; even if the correct production\nfunction does have the substitute property, segregation would arise in\nthe presence of credit market problems or under reasonable limitations\non prices.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n55 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nThe way that mixing is supposed to occur with substitutes is that\nlow-background parents make a payment to high-background parents\nso that the latter send their children to a mixed school.\nTo see why such payments are necessary, recall that we always have\nthat the first derivatives are positive, that is\n∂h1\n∂h2\n> 0 and\n> 0.\n∂e2\n∂e1\nThis means that everything else being equal all children benefit from\nbeing in the same class with other children with good backgrounds.\nHowever, children from better backgrounds benefit less than children\nfrom less good backgrounds. This implies that there has to be\npayments from parents of less good backgrounds to high-background\nparents.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n56 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nPeer Effects in Human Capital\nSegregation and Mixing (continued)\nPayments from poor backgrounds families to better off families to\nensure mixing are both diffi cult to implement in practice, and\npractically impossible taking into account the credit market problems\nfacing parents from poor socioeconomic status.\nTherefore, if the true production function exhibits the substitute\nproperty (submodularity), but there are credit market problems, we\nwill observe segregation in equilibrium, and the segregation will be\nineffi cient.\nThis implies that we cannot simply appeal to Tiebout competition, or\ndeduce effi ciency from the equilibrium patterns of sorting.\nAnother implication of this analysis is that in the absence of credit\nmarket problems (and with complete markets), cross-partials\ndetermine the allocation of students to schools.\nWith credit market problems, first there of it has become important.\nThis is a general result, with a range of implications for empirical\nwork.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n57 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City\nWe have seen how ineffi cient segregation can occur in the presence of\nsubmodularity or substitute property.\nA very interesting paper by Benabou shows that even with\nsupermodularity ineffi cient segregation can occur because of other\n\"missing markets\".\nHis model has competitive labor markets, and local externalities\n(externalities in schooling in the local area).\nAll agents are assumed to be ex ante homogeneous, and will\nultimately end up either low skill or high skill.\nUtility of agent i is assumed to be\nUi\ni - ci - ri\n= w\nwhere w is the wage, c is the cost of education, which is necessary to\nbecome both low skill or high skill, and r is rent.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n58 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nThe cost of education is assumed to depend on the fraction of the\nagents in the neighborhood, denoted by x, who become high skill. In\nparticular, we have cH (x) and cL (x) as the costs of becoming high\nskill and low skill.\nBoth costs are decreasing in x, meaning that when there are more\nindividuals acquiring high skill, becoming high skill is cheaper\n(positive peer group effects).\nIn addition,\ncH (x) > cL (x)\nso that becoming high skill is always more expensive.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n59 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nMore importantly, the effect of increase in the fraction of high skill\nindividuals in the neighborhood is bigger on the cost of becoming\nhigh skill, i.e., cH (x) < cL (x). Or\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n60 / 92\nCourtesy of Roland Benabou. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nSince all agents are ex ante identical, in equilibrium we must have\nU (L) = U (H)\nthat is, the utility of becoming high skill and low skill must be the\nsame.\nAssume that the labor market in the economy is global, and takes the\nconstant returns to scale form F (H, L).\nThe important implication here is that irrespective of where the\nworker obtains his education, he will receive the same wage as a\nfunction of his skill level.\nAlso assume that there are two neighborhoods of fixed size, and\nindividuals will compete in the housing market to locate in one\nneighborhood or the other.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n61 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nThere can be two types of equilibria:\n1 Integrated city equilibrium, where in both neighborhoods there is a\nfraction xˆ of individual obtaining high education.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n62 / 92\nCourtesy of Roland Benabou. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\n2. Segregated city equilibrium, where one of the neighborhoods is\nhomogeneous. For example, we could have a situation where one\nneighborhood has x = 1 and the other has x < 1, or one\nneighborhood has x = 0 and the other has x > 0.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n63 / 92\nCourtesy of Roland Benabou. Used with permission.\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nThe important observation here is that only segregated city equilibria\nare \"stable\".\nTo see this consider an integrated city equilibrium, and imagine\nrelocating a fraction ε of the high-skill individuals (that is individuals\ngetting high skills) from neighborhood 1 to neighborhood 2.\nThis will reduce the cost of education in neighborhood 2, both for\nhigh and low skill individuals.\nBut by assumption, it reduces it more for high skill individuals, so all\nhigh skill individuals now will pay higher rents to be in that city, and\nthey will outbid low-skill individuals, taking the economy toward the\nsegregated city equilibrium.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n64 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nIn contrast, the segregated city equilibrium is always stable.\nThus segregation arises as the equilibrium (stable equilibrium)\noutcome, because of \"complementarities\".\nAs in the previous model with spillovers between students within the\nschool, high-skill individuals can outbid the low-skill individuals\nbecause they benefit more from the peer group effects of high skill\nindividuals.\nBut crucially there are again missing markets in this economy.\nIn particular, rather than paying high skill individuals for the positive\nexternalities that they create, as would be the case in complete\nmarkets, agents transact simply through the housing market.\nIn the housing market, there is only one rent level, which both high\nand low skill individuals pay.\nIn contrast, with complete markets, housing prices would be such that\nhigh skill individuals pay a lower rent (to be compensated for the\npositive externality that they are creating on the other individuals).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n65 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nThis discussion implies that there are missing markets, and effi ciency\nis not guaranteed.\nIs the allocation with segregation effi cient?\nIt turns out that it may or may not.\nTo see this consider the problem of a utilitarian social planner\nmaximizing total output minus costs of education for workers.\nThis implies that the social planner will maximize\nF (H, L) - H1cH (x1 ) - H2cH (x2) - L1cL (x1) - L2cL (x2 )\nwhere\nH1\nH2\nx1 =\nand x2 =\nL1 + H1\nL2 + H2\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n66 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nThis problem can be broken into two parts:\nthe planner will choose the aggregate amount of skilled individuals, and\nthen she will choose how to actually allocate them between the two\nneighborhoods.\nthen, there is simple cost minimization, and the solution depends on\nwhether\nΦ (x) = xcH (x) + (1 - x) cL (x)\nis concave or convex.\nThis function is simply the cost of giving high skills to a fraction x of\nthe population.\nWhen it is convex, it means that it is best to choose the same level of\nx in both neighborhoods, and when it is concave, the social planner\nminimizes costs by choosing two extreme values of x in the two\nneighborhoods.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n67 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nWorkings of the City\nWorkings of the City (continued)\nIt turns out that this function can be convex, i.e. Φ00 (x) > 0. More\nspecifically, we have:\n\nΦ00 (x) = 2\ncH (x) - cL (x) + x cH (x) - cL (x) + cL (x)\nWe can have Φ00 (x) > 0 when the second and third terms are large.\nIntuitively, this can happen because although a high skill individual\nbenefits more from being together with other high skill individuals, he\nis also creating a positive externality on low skill individuals when he\nmixes with them.\nThis externality is not internalized, potentially leading to ineffi ciency.\nThis model gives another example of why equilibrium segregation\ndoes not imply effi cient segregation.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n68 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEvidence\nEvidence\nWhat does the evidence say?\nA lot of uncertainty (for reasons we will discuss in the next lecture).\nPositive externalities are probably present in several different settings.\nSchool quality seems to matter, but in several instances, selective\nschools do not seem to have a positive effect on (marginally-admitted)\nstudents- either evidence that in this instance quality does not matter\nor strong supermodularity.\nFew papers look at the issue of supermodularity vs. submodularity,\nand the answer is like you to depend on the specific context also.\nLet us start with a discussion of the estimation of peer effects.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n69 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEvidence\nEvidence (continued)\nOne thing is fairly clear: parents are willing to pay for their children\nto be together with high human capital peers (and with peers from\ngood social economic background and in schools with various\ndimensions of higher quality).\nOne nice illustration of this comes from Sandra Black's work focusing\non parents'willingness to pay for housing is a function of school\nquality.\nShe focuses on variation within school districts across hous es lying\non different sides of attendance district boundaries, which determine\nwhich limit entry school child will go to.\nThese households are subject to the same taxes and have the same\naccess to other non-elementary school amenities (safety, public\nservices etc.).\nBut parents are willing to pay 2.5% more for houses for a 5% increase\nin test scores.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n70 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEvidence\nEvidence (continued)\n(c) Oxford University Press. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n71 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEvidence\nEvidence: Magnitudes\n(c) Oxford University Press. All rights reserved. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n72 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEvidence\nEvidence: Interpretation\nVery clean result.\nBut should she have stopped here?\nWhat other implications should one have checked?\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n73 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nEconometric Framework for Peer Effects\nThe simplest econometric model for estimating peer effects would be\nXj + εij\n\nyij = βownxij + βspillover\n(15)\nwhere X is average characteristic (e.g., average schooling) and yij is\nthe outcome of the ith individual in group j.\nThis is the model we discussed in the context of human capital\nexternalities.\nManski (1993) calls this type of influences contextual effects - they\ncome from the context in which the individual is situated.\nAs we have already discussed, identification here will require some\n\nstructural assumptions or preferably exogenous variation in both xij\nand X .\n\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n74 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application to Job Placement Assistance\nIn some contexts, contextual effects are natural. In such contexts, if\nwe can also find (or design) random assignment, then credible\nestimates can be obtained.\nA nice example is provided by recent work by Crepon et al. (2014).\nA randomized job placement assistance offers across young, educated\njob-seekers in France, using both randomization across individuals\nwithin a labor market and also across labor markets.\nThis enables them to estimate both the own effect of job placement\nassistance and the spillover effect of other workers in the labor market\nreceiving such assistance.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n75 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application: The Reduced Form\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n76 / 92\n(c) Bruno Crepon, Esther Duflo, Marc Gurgand, Roland Rathelot, Philippe Zamora.. All rights reserved. This content is excluded from\nour Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application: Structura/Causal Estimates\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n77 / 92\nWhy are the reduced-form and structural estimates different?\n(c) Bruno Crepon, Esther Duflo, Marc Gurgand, Roland Rathelot, Philippe Zamora.. All rights reserved. This content is excluded\nfrom our Creative Commons license. For more information, see https://ocw.mit.edu/help/faq-fair-use/\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nEconometric Issues\nThe alternative is what Manski refers to as endogenous effects -\nbecause they are created by endogenous variables.\nThe simplest form would be\n\nyij = β\nxij + αspillover Yj + εij\n(16)\nown\n\nwhere Y is the average of the outcomes.\nThe identification of such endogenous effects is even more diffi cult\n(though this hasn't stopped people estimating such models).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n78 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nExample: Ethnic Effects\nThe correlation between the outcomes of people from the same ethnic\ngroup is well known, and is often interpreted in various different ways.\nBorjas (1994, 1995) suggested that these are related to the effect of\n\"ethnic capital\" - meaning that if in a group has low human capital,\nthen the next generation will be at a disadvantage in human capital\nacquisition.\nWhat could be wrong with such models?\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n79 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nEconometric Issues (continued)\nYj does not vary by individual,\nYj on itself at the group level.\n\nAn obvious problem is that because\nthis regression amounts to one of\nThis is a serious econometric problem.\nOne imperfect way to solve this problem is to replace\n\nYj on the right\nY -i which is the average excluding individual i. (Why\nj\nhand side by\ndoesn't is solved the problem?)\nAnother approach is to impose some timing structure.\nFor example:\nyijt = β\nxijt + αspillover\nown\nThere are still some serious problems irrespective of the approach\ntaken;\nthe timing structure is arbitrary, and\nthere is no way of distinguishing peer group effects from \"common\nshocks\".\nYj,t-1 + εijt\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n80 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application\nAs a concrete example of the estimation of an important set of peer\neffects, and also illustrating these problems, consider the paper by\nSacerdote (2001), which uses random assignment of roommates in\nDartmouth.\nHe finds that the GPAs of randomly assigned roommates are\ncorrelated, and interprets this as evidence for peer group effects.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n81 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application (continued)\n(c) Oxford University Press. This content is excluded from our Creative Commons license. For more information, see\nhttps://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n82 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application (continued)\nDespite the very nice nature of the experiment, the conclusion is\nproblematic, because Sacerdote attempts to identify (16) rather than\n(15).\nFor example, to the extent that there are common shocks to both\nroommates;\ne.g., they are in a noisier dorm), this may not reflect peer group effects.\nThis identification problem would not have arisen if the right-hand\nside regressor was some predetermined characteristic of the roommate\nin this case, we would be estimating something similar to (15) rather\nthan (16).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n83 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application (continued)\nA paper using random assignment of cadets to companies\n(approximately consisting of 38 cadets) at West Point, David Lyle\n(2007) can look specifically into this issue.\nHe finds that results similar to Sacerdote's are more likely to be due\nto common shocks than pure peer effects.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n84 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Application (continued)\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n85 / 92\nDavid S Lyle, 'Estimating and Interpreting Peer and Role Model Effects from Randomly Assigned Social Groups at\nWest Point', The Review of Economics and Statistics, 89:2 (May, 2007), pp. 289-299. (c) 2007 by the President and\nFellows of Harvard College and the Massachusetts Institute of Technology, published by the MIT Press.\nhttps://www.mitpressjournals.org/doi/abs/10.1162/rest.89.2.289/\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Example of Submodularity\nCarrell, Sacerdote and West (2011) and an earlier paper by Carrell,\nFullerton and West (2009) exploits the random assignment of cadets\nto different squadrons in the U.S. Air Force Academy, they have\nconvinced U.S. Air Force to change the composition of squadrons.\nThe results in the earlier study, using random assignment resulting\nfrom the existing policy of the U.S. Air Force, show that \"low ability\"\ncadets (students) benefit most from high ability peers in their\nsquadron.\nWe will discuss this paper more in the next lecture, but for now it\nprovides one piece of evidence of the substitute/submodularity effects.\nIn particular, a large positive effects are on those at the bottom of the\npredicted GPA distribution (in terms of their pre-treatment\ncovariates).\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n86 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEstimating Peer Effects\nAn Example of Submodularity (continued)\n(c) The Econometric Society. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n87 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEndogenous Network Formation\nEndogenous Networks\nA large literature studies the endogenous formation of (social)\nnetworks- e.g., Jackson and Wolinsky (JET, 1996), Bala and Goyal\n(Econometrica, 2000).\nEndogeneity of networks makes externalities and peer effects more\ninteresting but also more complicated conceptually and more diffi cult\nto estimate.\nLet us return to Carrell, Sacerdote, and West (Econometrica, 2013).\nRecall that the peer effects they are estimating from the cadets within\nsquadrons using random assignment from the U.S. Air Force\nAcademy are non-linear.\nLow (baseline) ability students appear to benefit significantly from\nbeing in the same squadron has high-ability students with\nlimitednegative effect on high-ability students from such mixin.\nThis suggests that optimally manipulating the composition of\nsquadrons can lead to significant gains.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n88 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEndogenous Network Formation\nEndogenous Networks: Intervention Gone Wrong\nThe authors convinced the U.S. Air Force Academy to allow such\nmanipulation, and constructed \"optimally designed\" squadrons- in\nwhich the exposure of low-ability cadets to high-ability ones was\nmaximized by creating \"bimodal\" squadrons.\nHowever, instead of the hypothesized gains, there were losses among\nlow-ability cadets. Why?\nThe authors hypothesize, and provides some evidence in favor of, the\nfollowing story:\nThe real peer groups- the friendship networks- probably changed as a\nresult of the intervention: low-ability and high-ability cadets may have\nstopped working and being friends together in the bimodal squadrons.\nAs a result, the peer effects from high-ability to low-ability cadets\nweakened or disappeared, leading to negative results.\nA cautionary tale on the endogeneity of social networks with respect\nto interventions.\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n89 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEndogenous Network Formation\nEndogenous Networks: Bimodal Treatment\n(c) The Econometric Society. All rights reserved.\nThis content is excluded from our\nCreative Commons license. For more\ninformation,\nsee https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n90 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEndogenous Network Formation\nEndogenous Networks: Prediction Vs. Realization\n(c) The Econometric Society. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n91 / 92\n\nSocial Mobility, Peer Effects and Human Capital\nEndogenous Network Formation\nEndogenous Networks: A Possible Explanation?\n(c) The Econometric Society. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nSocial Mobility and Peer Effects\nNovember 2 and 7, 2017.\n92 / 92\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Additional Lectures in Search, Matching and Unemployment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/8bbd9f9c5b5ef776939067c0597e9ef9_MIT14_661F17_add_lec.pdf",
      "content": "Labor Economics, 14.661. Additional Lectures in Search,\nMatching and Unemployment\nDaron Acemoglu\nMIT\nDecember 2016\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n1 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction\nLet us now return to frictional matching.\nSo far we treated the rate at which jobs get destroyed as a constant,\ns, giving us the simple flow equation\nu = s(1 - u) - θq (θ) u\nBut in practice firms decide when to expand and contract, so it's a\nnatural next step to endogenize s.\nSuppose that each firm consists of a single job (so we are now taking\na position on for size).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n2 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nAlso assume that the productivity of each firm consists of two\ncomponents, a common productivity and a firm-specific productivity.\nproductivity for firm i =\np\n+ σ × εi\n|{z}\n| {z }\ncommon productivity\nfirm-specific\nwhere\nεi ∼ F (·)\nover support ε and ε , and σ is a parameter capturing the importance of\nfirm-specific shocks.\nMoreover, suppose that each new job starts at ε = ε , but does not\nnecessarily stay there.\nIn particular, there is a new draw from F (·) arriving at the flow the\nrate λ.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n3 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nTo further simplify the discussion, let us ignore wage determination\nand set\nw = b\nThis then gives the following value function (written in steady state)\nfor a an active job with productivity shock ε (though this job may\ndecide not to be active):\nZ\n\nε\nrJF (ε) = p + σε - b + λ\nmax{JF (x) , JV }dF (x) - JF (ε)\nε\nwhere JV is the value of a vacant job, which is what the firm\nbecomes if it decides to destroy.\nThe max operator takes care of the fact that the firm has a choice\nafter the realization of the new shock, x, whether to destroy or to\ncontinue.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n4 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nSince with free entry JV = 0, we have\nh\ni\nrJF (ε) = p + σε - b + λ E (JF ) - JF (ε)\n(1)\nwhere JF (ε) is the value of employing a worker for a firm as a\nfunction of firm-specific productivity.\nAlso\nZ\nn\no\nε\nE (JF ) =\nmax JF (x) , 0 dF (x)\n(2)\nε\nis the expected value of a job after a draw from the distribution F (ε).\nGiven the Markov structure, the value conditional on a draw does not\ndepend on history.\nIntuition?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n5 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nDifferentiation of (1) immediately gives\ndJF (ε)\nσ\n=\n> 0\n(3)\ndε\nr + λ\nGreater productivity gives greater values the firm.\nWhen will job destruction take place?\nSince (3) establishes that JF is monotonic in ε, job destruction will be\ncharacterized by a cut-off rule, i.e.,\n∃ εd : ε < εd -→ destroy\nClearly, this cutoff threshold will be defined by\nrJF (εd ) = 0\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n6 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nBut we also have\nh\ni\nrJF (εd ) = p + σεd - b + λ E (JF ) - JF (εd ) ,\nwhich yields an equation for the value of a job after a new draw:\np + σεd - b\nE (JF ) = -\n> 0\nλ\nE\n\nJF > 0 implies that the expected value of continuation is positive\n(remember equation (2)).\nTherefore, the flow profits of the marginal job, p + σεd - b, must be\nnegative.\nInterpretation?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n7 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nFurthermore, we have a tractable equation for JF (ε):\nσ\nJF (ε) =\n(ε - εd )\nr + λ\nTo characterize E (JF ), note that\nZ ε\nE (JF ) =\nJF (x)dF (x)\nεd\nIntegration by parts\nZ ε\nE (JF )\n=\nJF (x)dF (x) = JF (x)F (x)\nZ\n\ndJF (x)\nε\nε\nF (x)\ndx\n-\ndx\nεd\nεd\nεd\nZ ε\nσ\nJF (ε ) -\nF (x)dx\n=\nλ + r\nεd\nε\nZ\nσ\n= λ + r\nεd\n[1 - F (x)] dx\nwhere the last line use the fact that JF (ε) =\nσ (ε - εd ).\nλ+r\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n8 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nNext, we have that\nZ ε\nλσ\np + σεd - b\n= -\n[1 - F (x)] dx\n|\n{z\n}\nr + λ εd\nprofit flow from marginal job\n< 0 due to option value\nAgain \"hoarding\".\nMore importantly, we have\n\n-1\ndεd\np - b\nr + λF (εd )\n=\nσ(\n)\n> 0.\ndσ\nσ\nr + λ\nTherefore, when there is more dispersion of firm-specific shocks, there\nwill be more job destruction\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n9 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nThe job creation part of this economy is similar to before.\nIn particular, since firms enter at the productivity ε , we have\nq (θ) JF (ε )\n=\nγ0\nγ0(r + λ)\n=⇒\n= q(θ)\nσ(ε - εd )\nRecall that as in the basic search model, job creation is \"sluggish\", in\nthe sense that it is dictated by the matching function; it cannot jump\nit can only increase by investing more resources in matching.\nOn the other hand, job destruction is a jump variable so it has the\npotential to adjust much more rapidly (but of course the relative\nimportance of job creation and job destruction in practice is an\nempirical matter)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n10 / 83\n\nJob Destruction\nEndogenous Job Destruction\nEndogenous Job Destruction (continued)\nThe Beveridge curve is also different now.\nFlow into unemployment is also endogenous, so in steady-state we\nneed to have\nλF (εd )(1 - u)\n= q(θ)θu\nIn other words:\nλF (εd )\nu =\n,\nλF (εd ) + q(θ)θ\nwhich is very similar to our Beveridge curve above, except that\nλF (εd ) replaces s.\nThe most important implication of this is that shocks (for example to\nproductivity) now also shift the Beveridge curve shifts.\nE.g., an increase in p will cause an inward shift of the Beveridge\ncurve; so at a given level of creation, unemployment will be lower.\nHow does endogenous job destruction affects effi ciency?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n11 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nA Two-Sector Search Model\nNow consider a two-sector version of the search model, where there\nare skilled and unskilled workers.\nSuppose that the labor force consists of L1 and L2 workers, i.e.\nL1 : unskilled worker\nL2 : skilled worker\nFirms decide whether to open a skilled vacancy or an unskilled\nvacancy.\n\nM1 = x(U1, V1)\nthe same matching function in both sectors.\nM2 = x(U2, V2)\nOpening vacancies is costly in both markets with\nγ1 : cost of vacancy for unskilled worker\nγ2 : cost of vacancy for skilled worker.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n12 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nA Two-Sector Search Model (continued)\nAs before, shocks arrive at some rate, here assumed to be exogenous\nand potentially different between the two types of jobs\ns1, s2 : separation rates\nFinally, we allow for population growth of both skilled unskilled\nworkers to be able to discuss changes in the composition of the labor\nforce.\nIn particular, let the rate of population growth of L1 and L2 be n1 and\nn2 respectively.\nn1, n2 : population growth rates\nThis structure immediately implies that there will be two separate\nBeveridge curves for unskilled and skilled workers, given by\ns1 + n1\ns2 + n2\nu1 =\nu2 =\n.\ns1 + n1 + θ1q(θ1)\ns2 + n2 + θ2q(θ2)\nIntuition?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n13 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nA Two-Sector Search Model (continued)\nImplication: different unemployment rates are due to three observable\nfeatures,\nseparation rates,\npopulation growth\njob creation rates.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n14 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nA Two-Sector Search Model (continued)\nThe production side is largely the same as before\noutput Af (K , N)\nwhere N is the effective units of labor, consisting of skilled and unskilled\nworkers.\nWe assume that each unskilled worker has one unit of effective labor,\nwhile each skilled worker has η > 1 units of effective labor.\nFinally, the interest rate is still r and the capital depreciation rate is δ.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n15 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nBellman Equations\nParallel to before.\nFor filled jobs\nrJF\n= Af (k) - (r + δ)k - w1 - s1JF\nrJF\n= Af (k)η - (r + δ)kη - w2 - s2JF\nFor vacancies\nrJ1\nV\n= -γ1 + q(θ1)(J1\nF - J1\nV )\nrJ2\nV\n= -γ2 + q(θ2)(J2\nF - J2\nV )\nFree entry:\nJ1\nV = J2\nV = 0\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n16 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nEquilibrium\nUsing this, we have the value of filled jobs in the two sectors\nγ1\nγ2\nJ1\nF =\nand J2\nF =\nq(θ1)\nq(θ2)\nThe worker side is also identical, especially since workers don't have a\nchoice affecting their status. In particular,\nrJ1\nU\n= z + θ1q(θ1)(J1\nE - J1\nU )\nrJU\n= z + θ2q(θ2)(JE - J2\nU )\nwhere we have assumed the unemployment benefit is equal for both\ngroups (is this reasonable? Important?).\nFinally, the value of being employed for the two types of workers are\nrJE = wi - s(JE - JU )\ni\ni\ni\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n17 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nEquilibrium (continued)\nThe structure of the equilibrium is similar to before, in particular the\nmodified golden rule and the two wage equations are:\nAf 0(k)\n= r + δ\nM.G.R.\nw1 =\n(1 - β)z + β [Af (k) - (r + δ)k + θ1γ1]\nw2 =\n(1 - β)z + δ [Af (k)η - (r + δ)kη + θ2γ2]\nThe most important result here is that wage differences between\nskilled unskilled workers are compressed.\nTo illustrate this, let us take a simple case and suppose first that\nγ1 = γ2, n1 = n2, s1 = s2, z = 0.\nThus there are no differences in costs of creating vacancies,\nseparation rates, unemployment benefits, and population growth rates\nbetween skilled and unskilled workers.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n18 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nUnemployment Differences\nIn this special case, we have\nu2 > u1\nWhy?\nγ\nγ\nJ1\nF\n=\nand\nJ2\nF =\nq(θ1)\nq(θ2 )\nJF\n> JF =⇒ θ1 < θ2 =⇒ u1 > u2.\nHigh skill jobs yield higher rents, so everything else equal firms will be\nkeener to create these types of jobs, and the only thing that will\nequate their marginal profits is a slower rate of finding skilled workers,\ni.e., a lower rate of unemployment for skilled than unskilled workers\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n19 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nUnemployment Differences More Generally\nThere are also other reasons for higher unemployment for unskilled\nworkers.\nAlso, s1 > s2 but lately n1 < n2 so the recent fall in n1 and increase\nin n2 should have helped unskilled unemployment.\nBut z ↑ has more impact on unskilled wages.\nη ↑ =⇒ \"skill-biased\" technological change.\n=⇒ u1 = cst, w1 = cst\nu2 ↓, w2 ↑\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n20 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nDoes the Cost of Capital Matter?\nA set of interesting effects happen when r are endogenous.\nSuppose we have η ↑, this implies that demand for capital goes up,\nand this will increase the interest rate, i.e., r ↑\nThe increase in the interest rate will cause\nu1 ↑, w1 ↓ .\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n21 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nLabor Force Participation\nCan this model explain non-participation?\nSuppose that workers have outside opportunities distributed in the\npopulation, and they decide to take these outside opportunities if the\nmarket is not attractive enough.\nSuppose that there are N1 and N2 unskilled and skilled workers in the\npopulation.\nEach unskilled worker has an outside option drawn from a distribution\nG1 (v ), while the same distribution is G2(v ) for skilled workers.\nIn summary:\nG1 (v ) N1 : unskilled\nG2 (v ) N2 : skilled\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n22 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nLabor Force Participation (continued)\nGiven v; the worker has a choice between JU and v.\ni\nClearly, only those unskilled workers with\nJ1\nU ≥ v\nwill participate and only skilled workers with\nJ2\nU ≥ v\n(why are we using the values of unemployed workers and not\nemployed workers?)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n23 / 83\n\nA Two-Sector Search Model\nA Two-Sector Search Model\nLabor Force Participation (continued)\nSince L1 and L2 are irrelevant to steady-state labor market\nequilibrium above (because of constant returns to scale), the\nequilibrium equations are unchanged. Then,\nZ JU\nL1 = N1\ndG1 (v )\nZ JU\nL2 = N2\ndG2 (v ).\nη ↑, r ↑ =⇒ u1 ↑, w1 ↓ JU ↓\n=⇒ unskilled participation falls (consistent with the broad facts).\nBut this mechanism requires an interest rate response (is this\nreasonable?)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n24 / 83\n\nQuantitative Evaluation\nEquilibrium in the Search Model\nRecall that the steady state equilibrium involves\nr + δ + βθq(θ)\n(1 - β) [Af (k) - (r + δ)k - z] -\nγ0 = 0\nq(θ)\nIn fact, this condition holds at all points in time not just in steady\nstate\nbecause θ is a \"jump\" variable and can thus immediately take the\nvalue consistent with this equation, and all other variables are either\nconstant or parameters;\nslow dynamics are only in the unemployment rate\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n25 / 83\n\nQuantitative Evaluation\nCan the Model Generate Significant Employment\nFluctuations?\nThe answer is no.\nShimer (AER 2005) for example has shown that the model generates\nsignificant movements in unemployment only when shocks are\nimplausibly large.\nIn other words, to generate movements in u and θ similar to those in\nthe data, we need much bigger changes in Af (k) - (r + δ)k, A or p\n(labor productivity or TFP) than is in the data.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n26 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\nWhen A increases, so do the net present discounted value of wages,\nand this leaves less profits, and therefore there is less of a response\nfrom vacancies.\nTo see this point in greater detail, let us combine data and the basicc\nsearch model developed above.\nIn particular, note that in the data the standard deviation of ln p (log\nproductivity) is about 0.02, while the standard deviation of ln θ is\nabout 0.38.\nTherefore, to matched abroad facts with productivity-driven shocks,\none needs an elasticity d ln θ/d ln p of approximately 20.\nCan the model generate this?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n27 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\n(continued)\nTo investigate this, consider the equilibrium condition\nr + s + βθq(θ)\n(1 - β) [Af (k) - (r + δ)k - z] -\nγ0 = 0.\nq(θ)\nRewrite this as\nr + s + βθq(θ) γ0 = (1 - β) p\n(4)\nq(θ)\nwhere p is \"net productivity\", p = Af (k) - (r + δ)k - z, the net\nprofits that the firm makes over and above the outside option of the\nworker. This is not exactly the same as labor productivity, but as long\nas z is small, it is going to be very similar to labor productivity.\nThe quantitative predictions of the model will therefore depend on\nwhether the elasticity implied by (4) comes close to a number like 20\nor not.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n28 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\n(continued)\nTo see this, let us differentiate (4) totally with respect to θ and p.\nWe obtain:\n(r + s)\n-\nγ0q0 (θ) dθ + βγ0dθ = (1 - β) dp\nq(θ)\nNow dividing the left-hand side by θ and the right hand side by p,\nand using the definition of the elasticity of the matching function\nη (θ) ≡-θq0 (θ) /q (θ) and the value of p from (4), we have\ndθ\ndθ\ndp r + s + βθq(θ)\n(r + s) γ0η (θ)\n+ βγ0θ\n= (1 - β)\nγ0,\nθ\nθ\np (1 - β) q(θ)\nand since dx/x = d ln x, we have the elasticity of the vacancy to\nunemployment ratio with respect to p as\nd ln θ =\nr + s + βθq(θ)\n.\nd ln p\n(r + s) η (θ) + βθq(θ)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n29 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\n(continued)\nTherefore, this crucial elasticity depends on the interest rate, the\nseparation rate, the bargaining power of workers, the elasticity of the\nmatching function (η (θ)), and the job finding rate of workers\n(θq(θ)).\nLet us take one period to correspond to a month. Then the numbers\nShimer estimates imply that θq(θ) ' 0.45, s ' 0.034 and r ' 0.004.\nThese numbers imply that the monthly interest rate is about 0.4%,\nan unemployed worker finds a job with a probability of about 0.45\nwithin a month and an employed worker transits into unemployment\nwith probability 0.034. Moreover, like other papers in the literature,\nShimer estimates a constant returns to scale Cobb-Douglas matching\nfunction,\n0.72\n0.28\nm (u, v ) ∝ u\nv\n.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n30 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\n(continued)\nAs a first benchmark, suppose that we have effi ciency, so that the\nHosios condition holds. In this case, we would have β = η (θ) = 0.72.\nIn that case, we have\nd ln θ\n0.034 + 0.004 + 0.72 × 0.45\n'\nd ln p\n(0.034 + 0.004) × 0.72 + 0.72 × 0.45\n' 1.03,\nwhich is substantially smaller than the 20-fold number that seems to\nbe necessary.\nOne way to increase this elasticities to reduce the bargaining power of\nworkers below the Hosios level. But this does not help that much.\nThe upper bound on the elasticity is reached when β = 0 is\nd ln θ\n0.034 + 0.004\n'\nd ln p\n(0.034 + 0.004) × 0.72\n' 1.39,\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n31 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\n(continued)\nYet another way would be to make p more variable than labor\nproductivity, which is possible because p includes z, but it's unlikely\nthat this will go very far.\nIn fact, what's happening is related to the cyclicality of wages. Recall\nthat in the steady-state equilibrium,\nw = (1 - β)z + β [Af (k) - (r + δ)k + θγ0 ] .\nTherefore, the elasticity of the wage with respect to p is in fact\ngreater than 1 (since it comes both from the direct affect and from\nthe changes in θ); much of the productivity fluctuations are absorbed\nby the wage.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n32 / 83\n\nQuantitative Evaluation\nUnderstanding Fluctuations in the Search Model\n(continued)\nNaturally, in matching the data we may not want to limit our focus to\njust productivity shocks, especially since the correlation between\nproductivity shocks and vacancy-unemployment rate is not that high\n(roughly about 0.4). So there must be other shocks, but what could\nthose be?\nOne possibility is shocks to separation rates, for example because of\nplant closings. Hall (REStat 2005) also further argues that there is no\nway to resolve this puzzle by looking at the side of worker inflows into\nunemployment. He suggests that most of the action is in job creation.\nTo a first approximation, job destruction or worker inflows into\nunemployment can be ignored. There is debate on this point, those\nlike Steve Davis working on job destruction rates disagreeing, but it's\nan interesting perspective.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n33 / 83\n\nWage Rigidity\nReal Wage Rigidity\nWage Rigidity\nAnother possibility is to assume that wages are \"rigid\".\nThis is the avenue pursued by Hall (AER 2005).\nHe argues that any distribution of the quasi-rent created by search\nfrictions can be an equilibrium, and the exact level of wages is\ndetermined by \"social norms,\" and take this to be constant.\nIf wages are constant, changes in p will translate into bigger changes\nin JF , and thus consequently to bigger changes in θ.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n34 / 83\n\nWage Rigidity\nReal Wage Rigidity\nReal Wage Rigidity\nThe type of wager rigidity that Hall has in mind is \"real wage\nrigidity,\" meaning that real wages are rigid.\nThis may result from fairness type considerations found in the data by\nBewley.\nIt may also result from other bargaining protocols as emphasized by\nHall.\nFor example, can firms pay different wages to workers doing the same\ntasks? Can they create a very unequal wage distribution within a\nfirm?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n35 / 83\n\nWage Rigidity\nReal Wage Rigidity\nQuantitative Effects of Real Wage Rigidity\nHow large can the impact of wage rigidity be?\nIf all other assumptions of search and matching model are\nmaintained, then this is bounded by the labor demand elasticity.\nConsistent with the results that the search model does not generate\nmuch fluctuations when β = 0, the extent of labor market\nfluctuations will be quite limited in this case also.\nMost estimates of the labor demand elasticity (with respect to wage)\nare less than 1 (see, e.g., Hamermesh, 1993).\nIn general equilibrium, this follows because labor and capital are often\nestimated to be complements, which implies demand elasticities less\nthan 1 for both.\nBut it's also true when industry-level demand curves are estimated\nHow can we measure the extent of real wage rigidity?\nDiffi cult, since how wages would move without \"rigidity\" is unclear.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n36 / 83\n\nWage Rigidity\nReal Wage Rigidity\nNominal Wage Rigidity\nAnother possibility is downward nominal wage rigidity.\nThis was popular in the early Keynesian models, but was then\ndismissed based on the argument that it would imply countercyclical\nreal wages\nit would only do so if there are no other shocks than\nproductivity/demand shocks changing labor demand and downward\nnominal wage rigidity is complete.\nOne advantage of this is that its empirical extent can be assessed in a\nmore careful manner.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n37 / 83\n\nWage Rigidity\nReal Wage Rigidity\nNominal Wage Rigidity (continued)\nThere is continuing debate on the extent of nominal wage rigidity.\nMany economists are biased against it because it is diffi cult to\nunderstand why workers should be so averse to nominal wage cuts\nwhen they are not as averse to real wage cuts.\nWhat does the evidence say?\nLittle doubt that there is nominal wage rigidity but there is no\nconsensus on its quantitative importance.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n38 / 83\n\nWage Rigidity\nReal Wage Rigidity\nNominal Wage Rigidity (continued)\nTwo kinds of studies:\n1 Studies using panel data on individual wages, e.g., McLaughlin, 1994,\nKahn, 1997, Card and Hyslop, 1997, Nickell and Quintini, 2003:\nall find evidence for nominal wage rigidity except McLaughlin;\nbut quantitative magnitude probably diffi cult to ascertain because of\nendemic measurement error- with measurement error, downward rigid\nwages will lead to the impression of wages that are being increased or\ndecreased nominally.\n2 Few studies using administrative data, e.g., Baker, Gibbs and\nHolmstrom, 1994, Lebow, Saks and Wilson, 2003, Fehr and Goette,\n2005:\nfind much clearer evidence of nominal wage rigidities;\nbut still conceptual issues in estimating the at date of importance of\nnominal rigidities.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n39 / 83\n\nWage Rigidity\nReal Wage Rigidity\nNominal Wage Rigidity (continued)\nThe picture from the PSID (Kahn, 1997)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n40 / 83\nKahn, Shulamit. \"Evidence of Nominal Wage Stickiness from Microdata.\" The American Economic Review 87, no. 5 (1997). Copyright\nAmerican Economic Association; reproduced with permission of the American Economic Review.\n\nWage Rigidity\nReal Wage Rigidity\nNominal Wage Rigidity (continued)\nThe picture from administrative data (Fehr and Goette, 2005)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n41 / 83\nCourtesy of Elsevier, Inc., https://www.sciencedirect.com. Used with permission.\n\nWage Rigidity\nReal Wage Rigidity\nNominal Wage Rigidity (continued)\nConceptual issues:\nBut in fact, the impact of nominal wage rigidity can be much greater\nif firms also try to maintain relative wage changes in line with some\nnotional distribution.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n42 / 83\n(c) John Wiley & Sons, Inc. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\n\nComposition of Jobs\nComposition of Jobs\nComposition of Jobs\nSearch models can also be useful for studying the endogenous\n(quality) composition of jobs and whether this is suffi cient or not.\nI will now sketch two related models of endogenous job composition.\nA model in which identical workers in equilibrium accept jobs of\ndifferent qualities, and quality differences arise endogenously from two\ntypes of jobs that differ in terms of their capital intensity.\nA model in which heterogeneous workers look for heterogeneous jobs\nand the distribution of worker types determines the distribution of job\ntypes.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n43 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nGood Jobs Versus Bad Jobs: Model\nSuppose that there is is a continuum of identical workers with\nmeasure normalized to 1.\nAll workers are infinitely lived and risk-neutral with discount rate r.\nThe technology of production for the final good is:\n1/ρ\nY = αYb\nρ + (1 - α)Yg\nρ\n(5)\nwhere Yg is the aggregate production of the first input, and Yb is the\naggregate production of the second input, and ρ < 1. The elasticity\nof substitution between Yg and Yb is 1/(1 - ρ).\nThe two intermediate goods are sold in competitive markets, so\nαY ρ-1Y 1-ρ\npb\n=\nb\npg\n=\n(1 - α)Yg\nρ-1Y 1-ρ\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n44 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nGood Jobs Versus Bad Jobs (continued)\nThe technology of production for the inputs is Leontieff.\nWhen matched with a firm with the necessary equipment (capital kb\nor kg ), a worker produces 1 unit of the respective good.\nThe equipment required to produce the first input costs kg while the\ncost of equipment for the second input is kb < kg . In equilibrium,\ncapital-intensive jobs will pay higher wages (thus correspond to\n\"good\" jobs).\nFirms can choose either one of two types of vacancies: (i) a vacancy\nfor a intermediate good 1 - a good job; (ii) a vacancy for an\nintermediate good 2 - a bad job.\nSearch is undirected between the two types of jobs (in the single labor\nmarket).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n45 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nBellman Equations\nDenoting the proportion of bad job vacancies among all vacancies by\nφ and focusing on steady state, we have\nh\ni\nrJU = z + θq(θ) φJb\nE + (1 - φ)Jg\nE - JU\n(6)\nThe steady state discounted present value of employment for two\ntypes of jobs can be written as:\nrJE = wi + s(JU - JE )\n(7)\ni\ni\nfor i = b, g .\nSimilarly, when matched, both vacancies produce 1 unit of their\ngoods, so:\n\nrJF = pi - wi + s JV -JF\n(8)\ni\ni\ni\n\nrJV = q(θ) JF -JV\n(9)\ni\ni\ni\nfor i = b, g.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n46 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nWage Bargaining\nSince workers and firms are risk-neutral and have the same discount\nrate, Nash Bargaining implies that wb and wg will be chosen so that:\n(1 - β)(JE - JU )\n= β(JF - Jb\nV )\n(10)\nb\nb\n(1 - β)(JE - JU )\n= β(JF -JV )\ng\ng\ng\nImportant feature: workers cannot pay to be employed in high wage\njobs.\nFree entry:\nJV\ni = ki .\n(11)\nFinally, the steady state unemployment rate is as usual\nu =\ns\n.\ns + θq(θ)\n(12)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n47 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nSteady-State Equilibrium\nLet φ be the fraction of good job vacancies.\nThen Yb = (1 - u)φ and Yg = (1 - u)(1 - φ), and thus\nρ\npg\n=\n(1 - α)(1 - φ)ρ-1 [αφρ + (1 - α)(1 - φ)ρ]\n1-ρ\n(13)\nρ\npb\n= αφρ-1 [αφρ + (1 - α)(1 - φ)ρ]\n1-ρ\n.\nWages can then be determined as\nwi = β (pi - rki ) + (1 - β)rJU .\n(14)\nZero profit conditions can be written as\nq(θ)(1 - β)\n\npb - rJU\n= rkb\n(15)\nr + s + (1 - β)q(θ)\n\nq(θ)(1 - β) pg - rJU\n= rkg .\n(16)\nr + s + (1 - β)q(θ)\nIntuition?\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n48 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nSteady-State Equilibrium (continued)\nNow combining (14), (15) and (16), we get :\n(r + s)(rkg - rkb )\nwg - wb =\n> 0\n(17)\nq(θ)\nTherefore, wage differences are related to the differences in capital\ncosts and also to the average duration of a vacancy. In particular,\nwhen q(θ) → inf, the equilibrium converges to the Walrasian limit\npoint, and both wg and wb converge to rJU , so wage differences\ndisappear. (Why?)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n49 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nSteady-State Equilibrium (continued)\nLet us first start with the case in which ρ ≤ 0, so that good and bad\njobs are gross complements.\nIn this case:\nProposition\nSuppose that ρ ≤ 0. Then, a steady state equilibrium with φ ∈ (0, 1)\nalways exists and is characterized by (13), (14), (15), (16) and (??). In\nequilibrium, for all kg > kb, we have pg > pb and wg > wb.\nWhen ρ > 0, an equilibrium continues to exist, but does not need to\nbe interior, so one of (15) and (16) may not hold. A particular\nexample of this is discussed in the next subsection.\nThere can also be multiple equilibria.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n50 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nWelfare\nConsider utilitarian welfare:\nTS = (1 - u) [φ(pb - rkb ) + (1 - φ)(pg - rkg )] - θu (φrkb + (1 - φ)rk\n(18)\nIntuitively, this is equal to total flow of net output, which consists of\nthe number of workers in good jobs ((1 - φ)(1 - u)) times their net\noutput (pg minus the flow cost of capital rkg ), plus the number of\nworkers in bad jobs (φ(1 - u)) times their net product (pb - rkb ),\nminus the flow costs of job creation for good and bad vacancies\n(respectively, θu(1 - φ)rkg and θuφrkb ).\nConstrained optimal allocations would be given by solutions to the\nmaximization of (18) subject to (12), and we have one source of\nsome optimality due to the failure of Hosios conditions.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n51 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nWelfare (continued)\nBut more interesting is distortions in the composition of jobs.\nConsider:\n\ndTS\nd(φpb + (1 - φ)pg )\n= (1 - u) ·\n- (1 - u + uθ) · {rkb - rkg } .\ndφ\ndφ\nUsing (12), (13), (15) and (16) to substitute out u, and ki , we obtain\ndTS\ndφ\n\nθq(θ)\n(s + q(θ))(1 - β)\n=\n· 1 +\n· (pb - pg ) < 0.\ns + θq(θ)\ndec. eq.\nr + s + (1 - β)q(θ)\nThis expression is always negative, irrespective of the value of θ, so\nstarting from laissez-faire equilibrium, a reduction in φ will increase\nsocial surplus. Therefore:\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n52 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nWelfare (continued)\nProposition\nLet φs (θ) be the value of φ that the social planner would choose at labor\nmarket tightness θ, and φ ∗(θ) be the laissez-faire equilibrium with z = 0,\nthen φ ∗(θ) > φs (θ) for all θ. That is, in the laissez-faire equilibrium, the\nproportion of bad jobs is too high.\nThe intuition is in terms of pecuniary externalities.\nIn equilibrium, good jobs always create greater positive pecuniary\nexternalities workers (why?).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n53 / 83\n\nComposition of Jobs\nGood Jobs Versus Bad Jobs\nMinimum Wages and Unemployment Benefit\nProposition\nBoth the introduction of a minimum wage w and an increase in\nunemployment benefit z decrease θ and φ. Therefore, they improve the\ncomposition of jobs and average labor productivity, but increase\nunemployment. The impact on overall surplus is ambiguous.\nIntuition.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n54 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nHeterogeneity and Composition of Jobs\nA different and richer set of issues arise when there is heterogeneity\namong workers.\nSuch models are more complicated, so I will present a simplified static\nversion with two types of workers (and endogenous distribution of job\nqualities).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n55 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nStatic Model\nThere is a mass 1 of risk-neutral workers and a mass 1 of risk-neutral\nand profit-maximizing firms. The economy lasts for one period, and\ncontains workers in two education groups, high and low (e.g. high\nschool and college graduates).\nLet the fraction of skilled workers by φ, and normalize the human\ncapital of unskilled workers to h = 1 and the human capital of skilled\nworkers to h = η > 1.\nProduction takes place in one firm-one worker pairs. A worker with\nhuman capital h and a firm with capacity k produce:\ny (h, k) = k1-αhα .\n(19)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n56 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nTiming of Events\nThe timing of events is as follows.\nFirst, each firm has to choose its capacity (\"physical capital\"), k,\nirreversibly. This choice captures the type of job the firm has designed\nand the line of business it has chosen, and is assumed to be costless.\nAt this point, the firm does not know the type of the worker it will\nrecruit.\nNext, the firm matches with a worker, finds out his type, and decides\nwhether to shut down or continue. If it continues, it installs the\nrequired equipment and incurs a cost ck.\nFinally, wages are determined.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n57 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nFrictional Equilibrium\nSuppose that there is random matching with one firm meeting one\nworker, and once they meet, the worker-firm pair have to decide\nwhether to produce together, with zero earnings if they separate.\nAs usual, bargaining implies the following wages\nwH (k) = βk1-αηα and wL (k) = βk1-α .\nTo simplify the algebra, let us normalize c ≡ (1 - β).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n58 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nFrictional Equilibrium (continued)\nThe expected value of a firm choosing capacity k can be written as:\n\nH\nk1-αηα - k\nk1-α - k\nV (k, x , xL ) = φxH (1 - β)\n+ (1 - φ)xL (1 - β)\n(20)\nwhere xj is the equilibrium probability that the firm produces with a\nworker of type j = L or H, conditional on matching with this worker.\nSince a fraction φ of workers are skilled and there is random\nmatching, the firm produces with a skilled worker with probability\nφxH , and obtains (1 - β)y (η, k) - ck = (1 - β)\n\nk1-αηα - k\n\n. The\nsecond part of (20) is explained similarly.\nNote that when the firm decides not to produce with the worker, i.e.\nx = 0, it does not incur the cost of capital, ck.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n59 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nFrictional Equilibrium (continued)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n60 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nFrictional Equilibrium (continued)\nProposition\nIf\n\n1/α\n1 - φ\nη <\n(21)\nφα - φ\nthen, there is a unique equilibrium which is pooling. All firms choose\nkP = a [φηα + (1 - φ)]1/α , and xH (kP ) = xL (kP ) = 1.\nIf η > [(1 - φ) / (φα - φ)]1/α, there is a unique equilibrium which is\nseparating. All firms choose capacity kH = aη, xH (k) = 1 and xL (k) = 0.\nIn the dynamic version, in the separating equilibrium there will also be\nsome fraction of firms that create low physical capital jobs paying low\nwages directed at low skill workers.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n61 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nDynamic Equilibrium in a Picture\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n62 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nImplications\nAn increase in η (corresponding to skill-biased technological change\nor changing human capital of skilled workers or globalization) will\nincrease inequality, but this effect will be muted inside region 1\nbecause search frictions create pooling.\nBut an increase in η or in φ (increasing the fraction of skilled\nworkers) can switch the economy from region wanted region 2, i.e., to\nthe separating equilibrium. This will create a discrete jump in\ninequality as well as in the equilibrium composition of jobs.\nIt is particularly interesting that an increase in the supply of skilled\nworkers can change the equilibrium in their favor (we see here a flavor\nof induced skill biased technological change and directed technological\nchange models).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n63 / 83\n\nComposition of Jobs\nHeterogeneity and Composition of Jobs\nEvidence\nAcemoglu (1999) presented several different types of evidence\nconsistent with this:\n1 A hollowing of the wage and occupation distributions (shown in greater\ndetail later in Autor, Levy and Murnane, 2003, Acemoglu and Autor,\n2011).\nAn increase in the heterogeneity of jobs in terms of physical capital to\nlabor ratios.\nA different pattern of mismatch between firms and workers (from\nPSID).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n64 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nThe Burdett-Mortensen Model\nA simple variant of search models can also generate endogenous wage\ndispersion. Consider the following model due to Burdett and\nMortensen.\nThere is a continuum 1 of workers, who can be employed or\nunemployed.\nThink of the workers as in the McCall sequential search world,\nobserving wages from a given distribution (except that, imagine we\nare in continuous time, so workers see a wage at some flow rate).\nMoreover assume that both employed and unemployed workers receive\nwage offers at the flow rate p.\nAn employed worker who receives an offer can leave his job and\nimmediately start at the new job if he so wishes. The important\nassumption is that the future distribution of job offers and rate of job\noffers is unaffected by whether the worker is employed or not (this is\nnot an assumption in the original Burdett-Mortensen model, but it\nsimplifies life).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n65 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nThe Burdett-Mortensen Model (continued)\nThere is a continuum m < 1 of firms.\nThey post wages and their wage offers are seen by a worker at the\nflow rate q. Thus p and q are exactly as in our standard search model,\nexcept that they are not what \"matching\" probabilities but flow rates\nof a worker seeing a wage, and a wage being seen by a worker.\nFor simplicity, let us take p and q as exogenous.\nUnemployed workers receive a benefit of b < 1. Employed workers\nproduce output equal to 1, and there is no disutility of work.\nThere is exogenous separation at the rate s, and also potentially\nendogenous separation if workers receive a better wage offer.\nBoth workers and firms are risk-neutral and discount the future at the\nrate r.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n66 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nThe Burdett-Mortensen Model (continued)\nWage posting corresponds to a promise by the firm to employ a worker\nat some prespecified wage untill the job is destroyed exogenously.\nWorkers observe promised wages before making their decisions.\nLet us denote the offered wage distribution by F (w ), and let us\nrestrict attention to steady states, assuming that this distribution is\nstationary.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n67 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium\nFirst let's look at the search behavior of an unemployed worker.\nAs usual, the worker is solving a straightforward dynamic\nprogramming problem, and his search behavior will be characterized\nby a reservation wage.\nMoreover, in this case the reservation wage is easy to pin down.\nSince there is no disutility and accepting a job does not reduce the\nfuture opportunities, an unemployed worker will accept all wages\nw ≥ b\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n68 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nLet's now look at the behavior of an employed worker, currently\nworking at the wage w0.\nBy the same reasoning, this worker will take any job that offers\nw ≥ w0\nTherefore, firms get workers from other firms that have lower wages\nand lose workers to exogenous separation and to firms that offer\nhigher wages.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n69 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nNow with this structure, we can show that there will exist a\nnon-degenerate continuous connected wage distribution over some\nw ].\n\nrange [b,\nWhy? (Proceeding informally).\nw ≤ 1. If\n\nw > 1, the firm would make\nnegative profits. This implies that employing a (one more) worker is\n\nalways profitable.\nSuppose that the wage distribution is not continuous, meaning that\nthere is an atom at some point w . Then it is a more profitable to\noffer a wage of w 0 + ε than w 0 for ε suffi ciently small, since with\npositive probability a worker will end up with two wages of w 0, thus\naccepting each with probability 1/2. A wage of w 0 + ε wins the\nworker for sure in this case.\nFirst, it is easy to check that\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n70 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nSuppose that the wage distribution is not connected, so that there is\n00).\nzero mass in some range (w , w\nThen all firms offering w 00 can cut\ntheir wages to w 0 + ε, and receive the same number of workers.\nThe lower support has to be w = b. Suppose not, i.e., suppose\nw > b. Then firms offering w can cut their wages without losing any\nworkers.\nLet's now look at the differential equations determining the number\nof workers employed in each firm and workers in unemployment.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n71 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nUnemployment dynamics are given by\nu = s (1 - u) - pu\nsince workers receive wage offers at the rate p, and all of them take\ntheir offers.\nTherefore, steady state unemployment is fixed by technology as\ns\nu = s + p\nHowever, employment rate of firms is endogenous. Imagine that the\nequilibrium wage distribution is given by G (w ) and the offered wage\ndistribution is F (w ).\nLet us continue to restrict attention to steady states, where both of\nthose are stationary. It is important that these two are not the same\n(why?).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n72 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nThen the level of employment of a firm offering wage w (now and\nforever) follows the law of motion\nN (w ) = q (u + (1 - u) G (w )) - (s + p (1 - F (w ))) N (w )\nwhere the explanation is intuitive; the offer of this firm is seen by a\nworker at the flow rate q, and if he is unemployed, which has\nprobability u, he takes it, and otherwise he is employed at some wage\ndistribution G. His wage is lower than the offered wage with\nprobability G (w ), in which case he takes the job.\nThe outflow is explained similarly, bearing in mind that now what is\nrelevant is not the actual wage distribution but the offered wage\ndistribution F (w ).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n73 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nTo find the steady state, we need to set N (w ) = 0, which implies\nq (u + (1 - u) G (w ))\nN (w ) =\n(22)\n(s + p (1 - F (w )))\nMoreover, we have a similar law of motion for the distribution\nfunction G (w ). In particular, the total fraction of workers employed\nand getting paid the wage of less than or equal to w is\n(1 - u) G (w )\nThe outflow of workers from this group is equal to\n[s + p (1 - F (w ))] (1 - u) G (w )\nby the same reasoning as above.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n74 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nThe inflow of workers into the status of employed and being paid a\nwage less than w only come from unemployment (when a worker\n00 ∈ (w 0\nupgrades from the wage w 0 to w\n, w ], this does not change\nG (w ).\nHence the inflow is\npF (w ) u,\nwhich is the measure of unemployed workers receiving an offer, pu,\ntimes the probability that this offer is less than w.\nEquating the outflow and the inflow, we obtain the cumulative density\nfunction of actual wages as\npF (w ) u\nG (w ) = [s + p (1 - F (w ))] (1 - u)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n75 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nNow using the steady-state unemployment rate:\npsF (w )\nG (w ) =\n(23)\np [s + p (1 - F (w ))]\nThe important thing to note is that\nG (w ) < F (w ) ,\nmeaning that the fraction of jobs in the equilibrium wage distribution\nbelow wage w is always lower than the fraction of offers below w, so\nthat F first-order stochastically dominates G.\nStated differently, this means that low wages have a lower probability\nof being accepted and, once accepted, a lower probability of surviving.\nThus equilibrium wages are positively selected from offered wages.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n76 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nNow combining (23) this with (22), we obtain\n\ns\np\npsF (w )\nq\n+\ns+p\ns+p p[s +p(1-F (w ))]\nN (w )\n=\n(s + p (1 - F (w )))\npsq\n=\n(s + p (1 - F (w )))2\nThus we now have to solve for F (w ) only, or for G (w ) only.\nIn equilibrium, all firms have to make equal profits, which means\nequal discounted profits. This is a complicated problem, since a new\nfirm accumulates workers slowly. Rather than solve this problem, let\nus look at the limit where r → 0. This basically means that we can\nsimply focus on state state, and equal discounted profits is equivalent\nto equal profits in the steady state.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n77 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nThe profits of a firm offering wage w (when the offer wage\ndistribution is given by F ), is\nπ (w ) = (1 - w ) N (w )\nIn other words, an equilibrium satisfies\nπ (w ) = π for all w ∈ suppF ,\nwhere π is also determined as part of the equilibrium.\nNow solving these equations:\npsq\nπ (w ) = (1 - w )\n= π\n(s + p (1 - F (w )))2\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n78 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nInverting this:\ns\n(1 - w ) sq\ns\nF (w ) = 1 -\n+\npπ\np\nover the support of F .\nMoreover, we know that w = b is in the support of F , and F (b) = 0,\nand this implies\ns\n0 = 1 -\n(1 - b) sq\np π\n+ s\np\nor\nπ = (1 - b) psq\n(p + s)\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n79 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nEquilibrium (continued)\nNow substituting, we have\ns\n(1 - w ) (p + s)2\ns\nF (w ) = 1 -\n+ ,\n(1 - b) p2\np\nwhich is a well-behaved distribution function that is increasing\neverywhere.\nMoreover, since F (w ) = 1, we also obtain that\n\n<\nw\n,\n\nso even the highest wages less than the full marginal product of the\nworker.\nFrom here, observed wage distribution is quite easy to calculate.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n80 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nDiscussion\nWhy is there wage dispersion? The answer is similar to the models we\nhave already seen.\nThe Burdett-Mortensen model is sometimes interpreted as a model of\n\"monopsony\".\nThe reasoning is that firms do not face a flat labor supply curve, but\ncan increase their \"labor supply\" by increasing their wages (they\nattract more workers and avoid losing workers).\nThe reason why wages are lower than full marginal product is argued\nto be this monopsony power. This is in fact quite misleading. In the\nbaseline search model, there is both monopoly power and monopsony\npower (there is bilateral monopoly, that's why there is bargaining!).\nIn fact, we saw that in the Diamond's Paradox, even though in\nequilibrium firms do not face an upward-sloping labor supply, they\nhave full monopsony power, and can hold workers down to their\nreservation utility (unemployment benefit or zero).\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n81 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nDiscussion (continued)\nThe nice thing about the Burdett-Mortensen model is that it\ngenerates a wage dispersion together with employer-size dispersion,\nand it matches a very well-known stylized fact that larger employers\npay higher wages.\nThe typical interpretation for this is that larger employers attract\nhigher-quality workers or somehow workers have greater bargaining\npower against such employers.\nBurdett-Mortensen turn this on its head; they argued that it is not\nthat larger employers pay higher wages, it is that employers that pay\nhigher wages become larger in equilibrium!\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n82 / 83\n\nEquilibrium Wage Dispersion\nEquilibrium Wage Dispersion\nDiscussion (continued)\nNevertheless, there are theoretical objections to the\nBurdett-Mortensen model. The most important is that it is not\noptimal for firms to post wages. Instead they should post \"contracts\"\nthat make workers pay upfront and receive their full marginal\nproducts. If this is not possible (because negative wages or bonding\ncontracts are not allowed), they can make workers receive a low-wage\nearly on, and increase their wages later. Why is this?\nFinally, note that even though there is wage posting here, there isn't\ndirected search. In the next lecture, we will see that directed search is\nthe essence. The previous model of wage dispersion in fact may have\nmimicked directed search, for reasons we are going to see more clearly\nsoon.\nDaron Acemoglu (MIT)\nSearch, Matching, Unemployment\nDecember 2016\n83 / 83\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Labor Ecomomics Lecture Notes: Comparative Static on Immigration",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/0ece5ff389af11b58cfd121ee744e8ee_MIT14_661F17_lec_immig.pdf",
      "content": "Comparative Statics for Immigration\n(Johnson 1980)\nJosh Angrist\nMIT 14.661 (FALL 2017)\nElasticities\nIn the p-comp price-taking world, market-level supply and demand elasticities\ndrive comparative statics.\nSuppose there's there's one type of labor; demand for it is D(w), with deriva\ntive D0(w) and that homogeneous labor is supplied by natives according to\nS1(w).\n- The elasticity of demand is\ndL w\nD0(w)w\n⌘ =\n=\n< 0\ndw L\nL\n- We similarly define the elasticity of (native) labor supply\nS1\n0 (L)w\n\" =\n> 0\nL\nRecall that these describe movements along supply and demand curves.\nMarket structure\nJohnson (1980) assumes that wages and employment of low-skill natives are\ndetermined by equilibrium in a perfectly competitive factor market.\n- n1 identical (low-skilled) natives supply this much labor:\nL1 ⌘ S1(w) = n1h(w),\n(1)\nwhere h(w) is per-capita hours worked (normalized to vary from 0 to 1)\n- Firms demand D(w) low-skill workers\n- Without immigration, equilibrium wages (w⇤) and employment (L⇤) in\nthe low-skill labor market satisfy:\nL⇤ = n1h(w ⇤) = D(w ⇤)\n\n\"\n\"\n\"\n-φ\nφ\nφ\nShocking Immigration\nLook out! 40,000 Canadian economists with H1Bs are a comin' down I-93 . . .\n- These n2 immigrant economists supply labor inelastically (just happy to\nbe here, mon ami! will run regressions for food)\n- New equilibrium\nn1h(w ⇤) + n2 = D(w ⇤)\n(2)\n- what's the key economic assumption here (besides p-comp)?\n- We now ask:\n1. What's the diff between the with-immigrants equilibrium and the\nno-immigrant equilibrium?\n2. What parameters does the effect of immigration on equilibrium out\ncomes depend on?\n- Comparative Statics is how we find answers: Totally differentiate the equi\nlibrium conditions, and solve for the change in equilibrium outcomes with\nrespect to a change in the exogenous variable of interest. In this case, we\nwant to know\ndw⇤\n=\n?\n(3)\ndn2\ndL⇤\n=\n?\n(4)\ndn2\n- Write the solution as a function of things that look good in Greek\nDetails\nTotally differentiate (2) to find\nD0(w)dw = n1h0(w)dw + h(w)dn1 + dn2\nAssume dn1 = 0, so\nD0(w)dw = n1h0(w)dw + dn2\nw\nn2\nDivide by D(w), multiply by ,\n, as needed to get:\nw\nn2\nD0(w)w ✓ dw ◆\nn1h0(w)w\n=\nS1(w) ✓ dw ◆\n✓dn2\n◆✓\n+\nn2\n◆\nD(w)\nw\nS1(w)\nD(w)\nw\nn2\nD(w)\n|\n{z\n}| {z }\n|\n{z\n}|\n{z\n}\n| {z }|\n{z\n}\n⌘\nd ln w\n\"\nd ln n2\nwhere\n⌘\nn2 , the immigrant share\nD(w)\n\nφ\n-\n-φ\n\"\n-\n-φ\n-φ\nφ\n-φ\n-\n-φ\nThis produces the first comparative statics result:\nd ln w =\n< 0\n(5)\nd ln n2\n⌘\n\"(1\n)\nTo get the employment effect, we differentiate (1):\ndL1 = S1\n0 (w)dw\nor, in elasticity terms\ndL1\nS1\n0 (w)w ✓ dw ◆\n=\nL1\nS1(w)\nw\n|\n{z\n}\n\"\nUsing (5), we get the second comparative statics result\nd ln L1\n\"φ\n=\n< 0\nd ln n2\n⌘\n\"(1\n)\nHere, however, its useful to work in levels instead of logs:\ndL1\nd ln L1\n\"✓L1\n◆\n\"(1\n)\n=\n=\n(6)\ndn2\nd ln n2\nn2\n⌘\n\"(1\n)\n| {z }\n(1\n)/\nThis bodies-to-bodies equation answers the question: When 100 immigrants\narrive, how many natives lose their jobs?\n- Jobs are lost indeed, but less than 1:1 (see Johnson 1980, Table 1)\nDiscussion questions\n1. What do wage declines depend on?\n2. What do job losses depend on?\n3. When are job losses at the extremes?\nKey Assumptions\n- Immigrants and natives are perfect substitutes\n- Immigrant labor supply is inelastic\n- Immigrants have no capital\n- Immigrants don't buy or make anything that matters for native labor\ndemand\nWhat can we say about a more realistic world, where immigration raises em\nployment for some natives? DRAW THIS!\n\n(c) Sage Publications, Inc. All rights reserved. This content is excluded from our Creative Commons license. For more information, see http://\nocw.mit.edu/help/faq-fair-use/\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Lecture 5 and 6: Career Concerns and Multitasking",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/8f068f4d3fe7b2fcd6380e252b6ddd61_MIT14_661F17_lec5_6a.pdf",
      "content": "Labor Economics, 14.661. Lectures 5 and 6: Career\nConcerns and Multitasking\nDaron Acemoglu\nMIT\nNovember 9 and 14, 2017.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n1 / 63\n\nIntroduction\nIntroduction\nIntroduction\nLabor economics typically dealing with supply, demand and\nallocations in the market.\nMuch of labor is transacted within firms.\nPotential new frontier of labor economics: understand what is\nhappening within firms.\nTwo aspects:\nIncentives within firms\nAllocation of workers to firms\nWe start with incentives within firms.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n2 / 63\n\nIntroduction\nMoral Hazard\nRecap: Basic Moral Hazard\nImagine a single worker (agent) is contracting with a single employer\n(principal).\nThe agent's utility function is\nH(w, a) = U(w ) - c(a)\nw =wage,\na ∈ R+ = action/effort,\nU (·) = concave utility function\nc (·) =convex cost of effort/action.\nH = outside option of the agent.\nx = output/performance.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n3 / 63\n\nIntroduction\nMoral Hazard\nBasic Moral Hazard Framework (continued)\nOutput a function of effort a and random variable θ ∈ R\nx (a, θ) .\nGreater effort→higher output, so\n∂x\nxa ≡\n> 0\n∂a\nTypically, x is publicly observed, but a and θ private information of\nthe worker.\nThe principal cares about output minus costs:\nV (x - w )\nV typically increasing concave utility function.\nSpecial case: V linear (risk neutral principal).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n4 / 63\n\nIntroduction\nMoral Hazard\nContracts\nLet Ω be the set of observable and contractible events, so when only\nx is observable, Ω = R.\nwhat is the difference between observable in contractible events?\nWhen any two of x, a, and θ are observable, then Ω = R+ × R (why\nonly two?).\nA contract is a mapping\ns : Ω → R\nspecifying how much the agent will be paid as a function of\ncontractible variables.\nWhen there is limited liability, then\ns : Ω → R+\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n5 / 63\n\nIntroduction\nMoral Hazard\nTiming of Events\nThis is a dynamic game of asymmetric or incomplete information\n(though incompleteness of information not so important here, why?)\nTiming:\nThe principal offers a contract s : Ω → R to the agent.\nThe agent accepts or rejects the contract. If he rejects the contract,\nhe receives his outside utility H.\nIf the agent accepts the contract s : Ω → R, then he chooses effort a.\nNature draws θ, determining x(a, θ).\nAgent receives the payment specified by contract s.\nLook for a Perfect Bayesian Equilibrium.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n6 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nIncentives-Insurance Tradeoff\nThe problem is\nmax E [V (x - s(x)]\ns(x ),a\ns.t. E [H(s(x), a)] ≥ H\nParticipation Constraint (PC)\nand a ∈ arg max E [H(s(x), a0)] Incentive Constraint (IC)\na0\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n7 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nIncentives-Insurance (continued)\nSuppressing θ, we work directly with F (x | a).\nNatural assumption:\nFa (x | a) < 0,\n(implied by xa > 0)\n→an increase in a leads to a first-order stochastic-dominant shift in F .\nRecall that F first-order stochastically dominates another G , if\nF (z) ≤ G (z)\nfor all z.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n8 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nBasic Moral Hazard Problem\nCanonical problem:\nZ\nmax\nV (x - s(x))dF (x | a)\ns(x ),a\nZ\ns.t.\n[U(s(x) - c(a))] dF (x | a) ≥ H\nZ\na ∈ arg max\n[U(s(x)) - c(a0)] dF (x | a0)\na0\nConsiderably more diffi cult, because the incentive compatibility, IC,\nconstraint is no longer an inequality constraint, but an abstract\nconstraint requiring the value of a function,\nZ\n0)\n\n0),\nU(s(x)) - c(a\ndF (x | a\nto be highest when evaluated at a = a.\nDiffi cult to make progress on this unless we take some shortcuts.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n9 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nThe First-Order Approach\nThe standard shortcut is the \"first-order approach,\".\nIt involves replacing the IC constraint with the first-order conditions\nof the agent, that is, with\nZ\nU(s(x))fa (x | a)dx = c0(a).\nWhy is this a big assumption?\nIncorrect argument: suppose that\nZ\n\nmax\nU(s(x)) - c(a0) dF (x | a0)\na0\nis strictly concave\nWhy is this argument in correct?\nThe first-order approach is a very strong assumption and often invalid.\nSpecial care necessary.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n10 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nSolution to the Basic Moral Hazard Problem\nNow using the first-order approach the principal's problem becomes\nZ\n\nmin max L =\n{V (x - s(x)) + λ U(s(x)) - c(a) - H\n+\nλ,μ s (x ),a\n\nfa (x | a)\nμ U(s(x))\n- c0(a)\nf (x | a)dx\nf (x | a)\nNow carrying out \"point-wise maximization\" with respect to s(x):\n∂L\n0 = ∂s (x)\nfa (x | a)\n= -V 0(x - s(x)) + λU0(s(x)) + μU0(s(x))\nfor all x\nf (x | a)\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n11 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nSolution to the Basic Moral Hazard Problem (continued)\nTherefore:\nV 0(x - s(x))\nfa(x | a)\n= λ + μ\n.\n(1)\nU0(s(x))\nf (x | a)\nWhat happens when μ = 0?\nAlso, we must have λ > 0. Why?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n12 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nIncentive-Insurance Tradeoff Again\nCan we have perfect risk sharing?\nThis would require\nV 0(x - s(x))/U0(s(x)) = constant.\nSince V 0 is constant, this is only possible if U0 is constant.\nSince the agent is risk-averse, so that U is strictly concave, this is\nonly possible if s (x) is constant.\nBut if s (x) is constant and effort is costly, the incentive compatibility\nconstraint will be violated (unless the optimal contract asks for\na = 0).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n13 / 63\n\nIntroduction\nIncentives-Insurance Tradeoff\nBack to the Optimal Contract\nLet the level of effort that the principal wants to implement be a .\nThen the optimal contract solves:\nV 0(x - s(x))\nfa(x | a )\n= λ + μ\n.\nU0(s(x))\nf (x | a )\nIf a (x) > a , then\nfa (x | a )/f (x | a ) > 0\nso V 0/U0 has to be greater, which means that U0 has to be lower.\nTherefore s (x) must be increasing in x.\nIntuitively, when the realization of output is good news relative to\nwhat was expected, the agent is rewarded, when it is bad news, he is\npunished.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n14 / 63\n\nLinear Contracts\nRobustness\nRobustness of Contracts\nBasic moral hazard problem captures some nice intuitions about\ninsurance-incentive trade-offs.\nBut little prediction about the form of equilibrium contracts, and\nwhat's worse is that an even very simple problems, the form of\ncontracts is very complex and highly nonlinear.\nIs this a good prediction? Perhaps not because these contracts are\nnot \"robust\"?\nWhat does \"robust\" mean?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n15 / 63\n\nLinear Contracts\nRobustness\nRobustness (continued)\nHolmstrom and Milgrom: no manipulation in dynamic principal-agent\nproblems\nConsider a model in continuous time.\nThe interaction between the principal and the agent take place over\nan interval normalized to [0, 1].\nThe agent chooses an effort level at ∈ A at each instant after\nobserving the relaxation of output up to that instant.\nThe output process is given by the continuous time random walk,\nthat is, the following Brownian motion process:\ndxt = atdt + σdWt\nwhere W is a standard Brownian motion (Wiener process).\nThis implies that its increments are independent and normally\ndistributed, that is, Wt+τ - Wt for any t and τ is distributed\nnormally with variance equal to τ.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n16 / 63\n\nLinear Contracts\nRobustness\nRobustness (continued)\nLet\nX t = (xτ; 0 ≤ τ < t)\nbe the entire history of the realization of the increments of output x\nup until time t (or alternatively a \"sample path\" of the random\nvariable x).\nEffort choice\nat : X t → A.\nSimilarly, the principal also observes the realizations of the increments\n(though obviously not the effort levels and the realizations of Wt ).\nTherefore, contract\nst : X t → R.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n17 / 63\n\nLinear Contracts\nRobustness\nRobustness (continued)\nHolmstrom and Milgrom assume that utility of the agent is\n\nZ 1\nu\nC1 -\nc(at )dt\nC1 is consumption at time t = 1, while c(·) is a strictly convex cost\nfunction.\nTwo special assumptions:\nthe individual only derives utility from consumption at the end (at time\nt = 1) and\nthe concave utility function applies to consumption minus the total\ncost of effort between 0 and 1.\nA further special assumption constant absolute risk aversion (CARA)\nutility:\nu (z) = - exp (-rz)\n(2)\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n18 / 63\n\nLinear Contracts\nRobustness\nRobustness: Key Result\nIn this case, optimal contracts are only a function of (cumulative)\noutput x1 and are linear.\nIndependent of the exact sample path leading to the cumulative\noutput.\nMoreover, in response to this contract the optimal behavior of the\nagent is to choose a constant level of effort, which is also independent\nof the history of past realizations of the stochastic shock.\nLoose intuition: with any nonlinear contract there will exist an event,\ni.e., a sample path, after which the incentives of the agent will be\ndistorted, whereas the linear contract achieves a degree of\n\"robustness\".\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n19 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts\nMotivated by this result, many applied papers look at the following\nstatic problem:\nThe principal chooses a linear contract, of the form s = α + βx.\nThe agents chooses a ∈ A ≡ [0, inf].\nx = a + ε where ε ∼N\n\n0, σ2\nThe principal is risk neutral\nThe utility function of the agent is\nU (s, a) = - exp (-r (s - c (a)))\nwith\nc (a) = ca2 /2\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n20 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts (continued)\nLoose argument: a linear contract is approximately optimal here.\nIs this true?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n21 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts (continued)\nEven if linear contracts are not optimal in the static model, they are\nattractive for their simplicity and can be justified as thinking of the\ndynamic model.\nThey are also easy to characterize.\nThe first-order approach works in this case.\nThe maximization problem of the agent is\nmax E {- exp (-r (s (a) - c (a)))}\na\n\nr\n= max - exp -rEs (a) +\nVar (s (a)) - rc (a)\na\nWhere is the second line coming from?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n22 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts (continued)\nTherefore, the agent's problem is\nn\no\nr\nc\nmax Es (a) - Var (s (a)) - a2\na\nSubstituting for the contract:\nc\nr\nmax βa - a2 - β2σ2\na\nThe first-order condition for the agent's optimal effort choice is:\nβ\na = c\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n23 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts (continued)\nThe principal will then maximize\nmax E ((1 - β) (a + ε) - α)\na,α,β\nsubject to\nβ\na =\n\nc\nβ2\nα +\n1 - r σ2\n≥\nh\nc\n\nFirst equation is the incentive compatibility constraint in the second is\nh = - ln (-H)).\nthe participation constraint (with\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n24 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts: Solution\nSolution:\nβ ∗ =\n1 + rcσ2\n(3)\nand\nα ∗ = h -\n1 - rcσ2\n2 ,\n2c2 (1 + rcσ2)\nBecause negative salaries are allowed, the participation constraint is\nbinding.\nThe equilibrium level of effort is\n∗\na = c (1 + rcσ2 )\nAlways lower than the first-best level of effort which is afb = 1/c.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n25 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts: Comparative Statics\nIncentives are lower powered- i.e., β ∗ is lower, when\nthe agent is more risk-averse is the agent, i.e., the greater is r,\neffort is more costly, i.e., the greater is c,\nthere is greater uncertainty, i.e., the greater is σ2.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n26 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts: Suffi cient Statistics\nSuppose that there is another signal of the effort\nz = a + η,\n\nη is N 0, σ2\nand is independent of ε.\nη\nLet us restrict attention to linear contracts of the form\ns = α + β x + β z.\nx\nz\nNote that this contract can also be interpreted alternatively as\ns = α + μw\nwhere\nw = w1x + w2z\nis a suffi cient statistic derived from the two random variables x and z.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n27 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts: Suffi cient Statistics (continued)\nNow with this type of contract, the first-order condition of the agent\nis\nβ + β\nx\nz\na =\nc\nTherefore, the optimal contract gives:\nσ2\nη\nβ =\n\nx\nσ2 + σ2 η + rc σ2σ2 η\nand\nσ2\nβ =\n\nz\nσ2 + σ2 η + rc σ2σ2 η\nThese expressions show that generally x is not a suffi cient statistic for\n(x, z), and the principal will use information about z as well to\ndetermine the compensation of the agent.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n28 / 63\n\nLinear Contracts\nRobustness\nLinear Contracts: Suffi cient Statistics (continued)\nThe exception is when σ2\nη → inf so that there is almost no information\nin z regarding the effort chosen by the agent.\nIn this case, β → 0 and β → β ∗ as given by (3), so in this case x\nz\nx\nbecomes a suffi cient statistic.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n29 / 63\n\nEvidence\nEvidence\nEvidence\nThe evidence on the basic principal-agent model is mixed.\nEvidence in favor of the view that incentives matter.\nLazear: data from a large auto glass installer, high incentives lead to\nmore effort.\nFor example, Lazear's evidence shows that when this particular\ncompany went from fixed salaries to piece rates productivity rose by\n35% because of greater effort by the employees (the increase in average\nwages was 12%), but part of this response might be due to selection,\nas the composition of employees might have changed.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n30 / 63\n\nEvidence\nEvidence\nEvidence (continued)\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n31 / 63\nLazear, Edward P. \"Performance Pay and Productivity.\" The American Economic Review 90, no. 5 (2000). Copyright American Economic\nAssociation; reproduced with permission of the American Economic Review.\n\nEvidence\nEvidence\nEvidence (continued)\nSimilar evidence is reported in other papers.\nFor example, Kahn and Sherer, using the personnel files of a large\ncompany, show that employees (white-collar offi ce workers) whose pay\ndepends more on the subjective evaluations obtain better evaluations\nand are more productive.\nIncentives also matter in extreme situations.\nJohn McMillan on the responsibility system in Chinese agriculture\nTed Groves similar effects from the Chinese industry.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n32 / 63\n\nEvidence\nEvidence\nEvidence (continued)\nBut various pieces of evidence that high-powered incentives might\nbackfire.\nErnst Fehr and Simon Gachter: that incentive contracts might destroy\nvoluntary cooperation.\nMore standard examples are situations in which high-powered\nincentives lead to distortions that were not anticipated by the\nprincipals.\ne.g., consequences of Soviet incentive schemes specifying\n\"performance\" by number of nails or the weight of the materials used,\nleading to totally unusable products.\nLess standard but more consequential examples: Acemoglu et al.\n(2016)- high-powered incentives for Colombian military led to murder\nof civilians dressed up as guerrilla.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n33 / 63\n\nEvidence\nEvidence\nEvidence (continued)\nCloser to labor economics- Pascal Courty and Gerard Marschke: Job\ntraining centers, whose payments are based on performance\nincentives, manipulating the reporting of the time of training\ntermination.\nIf the outcome is good, report immediately, and if not, report late\n(hoping for an improvement in outcome in the meantime).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n34 / 63\nCourty, Pascal and Gerald Marschke. \"Measuring Goverment Performance: Lessons from a Federal Job-Training Program.\" The\nAmerican Economic Review 87, no. 2, Papers and Proceedings of the Hundred and Fourth Annual Meeting of the American\nEconomic Association (1997). Copyright American Economic Association; reproduced with permission of the American\nEconomic Review.\n\nEvidence\nEvidence\nEvidence (continued)\nPaul Oyer: Managers increasing effort or shifting sales to their last\nfiscal quarter to improve their bonuses:\n(c) Oxford University Press. All rights reserved. This content is excluded from our Creative Commons license. For more information,\nsee https://ocw.mit.edu/help/faq-fair-use/\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n35 / 63\n\nEvidence\nEvidence\nEvidence (continued)\nThe most negative evidence against the standard moral hazard\nmodels is that they do not predict the form of performance contracts.\nPrendergast: there is little association between riskiness and noisiness\nof tasks and the types of contracts when we look at a cross section of\njobs.\nIn many professions performance contracts are largely absent.\nWhy could this be?\nAgain robustness.\nMultitask issues.\nCareer concerns.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n36 / 63\n\nMultitasking\nMultitasking\nMultitask Models\nLet us now modify the above linear model so that there are two\nefforts that the individual chooses, a1 and a2, with a cost function\nc (a1, a2 )\nwhich is increasing and convex as usual.\nThese efforts lead to two outcomes:\nx1 = a1 + ε1\nand\nx2 = a2 + ε2,\nwhere ε1 and ε2 could be correlated.\nThe principal cares about both of these inputs with potentially\ndifferent weights, so her return is\nφ1x1 + φ2x2 - s\nwhere s is the salary paid to the agent.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n37 / 63\n\nMultitasking\nMultitasking\nMultitask Models (continued)\nMain difference: only x1 is observed, while x2 is unobserved.\nExample: the agent is a home contractor where x1 is an inverse\nmeasure of how long it takes to finish the contracted work, while x2 is\nthe quality of the job, which is not observed until much later, and\nconsequently, payments cannot be conditioned on this.\nAnother example: the behavior of employees in the public sector,\nwhere quality of the service provided to citizens is often diffi cult to\ncontract on.\nHigh-powered incentives may distort the composition of effort.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n38 / 63\n\nMultitasking\nMultitasking\nMultitask Models: Solution\nLet us focus on linear contracts of the form\ns (x1) = α + βx1\nsince x1 is the only observable output.\nThe first-order condition of the agent now gives:\n∂c (a1, a2)\n> 0\nβ =\n∂a1\n(4)\n0 ≤ ∂c (a1, a2)\n∂c (a1, a2)\nand\n× a2 = 0.\n∂a2\n∂a2\nSo if\n∂c (a1, a2)\n∂a2\nwhenever a2 > 0, then the agent will choose a2 = 0, and there is no\nway of inducing him to choose a2 > 0.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n39 / 63\n\nMultitasking\nMultitasking\nMultitask Models: Solution (continued)\nHowever, suppose that\n∂c (a1, a2 = 0) < 0.\n∂a2\nThen, without \"incentives\" the agent will exert some positive effort in\nthe second task.\nNow providing stronger incentives in task 1 can undermine the\nincentives in task 2;\nthis will be the case when the two efforts are substitutes, i.e.,\n∂2c (a1, a2) /∂a1∂a2 > 0.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n40 / 63\n\nMultitasking\nMultitasking\nMultitask Models: Solution (continued)\nMore formally, imagine that the first-order conditions in (4) have an\ninterior solution (why is an interior solution important?).\nThen differentiate these two first-order conditions with respect to β.\nUsing the fact that these two first-order conditions correspond to a\nmaximum (i.e., the second order conditions are satisfied), we obtain\n∂a1 > 0.\n∂β\nThis has the natural interpretation that high-powered incentives lead\nto stronger incentives as the evidence discussed above suggests.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n41 / 63\n\nMultitasking\nMultitasking\nMultitask Models: Solution (continued)\nHowever, in addition provided that ∂2c (a1, a2) /∂a1∂a2 > 0, we also\nhave\n∂a2 < 0,\n∂β\nTherefore, high-powered incentives in one task adversely affect the\nother task.\nWhat are the implications for interpreting empirical evidence?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n42 / 63\n\nMultitasking\nMultitasking\nMultitask Models: Solution (continued)\nWhat about the optimal contract?\nIf the second task is suffi ciently important for the principal, then she\nwill \"shy away\" from high-powered incentives; if you are afraid that\nthe contractor will sacrifice quality for speed, you are unlikely to offer\na contract that puts a high reward on speed.\nIn particular, the optimal contract will have a slope coeffi cient of\n\n∂2\n∂2\nφ1 - φ2\nc (a1, a2 ) /∂a1 ∂a2 /\nc (a1, a2 ) /∂a\nβ ∗∗\n= 1 + r σ2\n1 (∂2c (a1, a2) /∂a1\n2 - (∂2c (a1, a2) /∂a1 ∂a2)2 /∂2c (a1, a2 )\nAs expected β ∗∗ is declining in φ2 (the importance of the second\ntask) and in -∂2c (a1, a2) /∂a1∂a2 (degree of substitutability between\nthe efforts of the two tasks).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n43 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns\n\"Career concerns\"≈reasons to exert effort unrelated to current\ncompensation.\nThese could be social effects.\nOr more standard: anticipation of future compensation\nQuestion: is competition in market for managers suffi cient to give\nthem suffi cient incentives without agency contracts?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n44 / 63\n\nCareer Concerns\nCareer Concerns\nThe Basic Model of Career Concerns\nBasic model due to Holmstrom.\nThe original Holmstrom model is infinite horizon, but useful to start\nwith a 2-period model.\nOutput produced is equal to\nxt\n=\nη\n+\nat\n+\nεt\nt = 1, 2\n|{z}\n|{z}\n|{z}\nability\neffort\nnoise\nSince the purpose is to understand the role of career concerns, let us\ngo to the extreme case where there are no performance contracts.\nAs before at ∈ [0, inf).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n45 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns (continued)\nAlso assume that\nεt\n∼\nN (0, 1/hε)\nwhere h is referred to as \"precision\" (inverse of the variance)\nAlso, the prior on η has a normal distribution with mean m0, i.e.,\nη ∼\nN (m0, 1/h0 )\nand η, ε1, ε2 are independent.\nWhat does it mean for the prior to have distribution?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n46 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns (continued)\nDifferently from the basic moral hazard model this is an equilibrium\nmodel, in the sense that there are other firms out there who can hire\nthis agent. This is the source of the career concerns.\nLoosely speaking, a higher perception of the market about the ability\nof the agent, η, will translate into higher wages.\nThis class of models are also referred to as \"signal jamming\" models,\nsince the agent might have an interest in working harder in order to\nimprove the perception of the market about his ability.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n47 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Timing and Information Structure\nInformation structure:\nthe firm, the worker, and the market all share prior belief about η (thus\nthere is no asymmetric information and adverse selection; is this\nimportant?).\nthey all observe xt each period.\nonly worker sees at (moral hazard/hidden action).\nIn equilibrium firm and market correctly conjecture at (Why?)\n→along-the-equilibrium path despite the fact that there is hidden\naction, information will stay symmetric.\nThe labor market is competitive, and all workers are paid their\nexpected output.\nRecall: no contracts contingent on output (and wages are paid at the\nbeginning of each period).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n48 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Wage Structure\nCompetition in the labor market→ the wage of the worker at a time t\nis equal to the mathematical expectation of the output he will\nproduce given the history of its outputs\nwt (xt-1) = E(xt | xt-1)\nt-1\nwhere x\n= {x1, ..., xt-1} is the history of his output realizations.\nAlternatively,\nwt (xt-1 )\n= E(xt | xt-1)\n= E(η | xt-1) + at (xt-1 )\nwhere at (xt-1) is the effort that the agent will exert given history\nt-1\nx\nImportant: at (xt-1) is perfectly anticipated by the market along the\nequilibrium path.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n49 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Preferences\nInstantaneous utility function of the agent is\nu(wt , at )\n= wt - c(at )\nWith horizon equal to T , preferences are\nT\nU(w, a)\n=\n∑ βt -1 [wt - c(at )]\nt=1\nFor now T = 2.\nFinally,\n00 (·) > 0\nc0 (·) > 0, c\nc0(0) = 0\nFirst best level of effort afb again solves\nc0(afb ) = 1.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n50 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Summary\nRecall that all players, including the agent himself, have prior on\nη ∼N (m0, 1/h0 )\nSo the world can be summarized as:\nperiod 1:\n⎧\n⎨\n⎩\nwage w1\neffort a1 chosen by the agent (unobserved)\noutput is realized x1 = η + a1 + ε1\nperiod 2:\n⎧\n⎨\n⎩\nwage w2 (x1)\neffort a2 chosen\noutput is realized x2 = η + a2 + ε2\nAppropriate equilibrium concept: Perfect Bayesian Equilibrium.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n51 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Equilibrium\nBackward induction immediately implies\n∗\na = 0\nWhy?\nTherefore:\nw2 (x1 )\n= E(η | x1) + a2(x1 )\n= E(η | x1)\nThe problem of the market is the estimation of η given information\nx1 = η + a1 + ε1.\nThe only diffi culty is that x1 depends on first period effort.\nIn equilibrium, the market will anticipate the correct level of effort a1.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n52 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Equilibrium (continued)\nLet the conjecture of the market be a 1.\nDefine\nz1 ≡ x1 - a 1 = η + ε1\nas the deviation of observed output from this conjecture.\nOnce we have z1, standard normal updating formula implies that\n\nh0m0 + hεz1\nη | z1 ∼N\n,\nh0 + hε\nh0 + hε\nInterpretation: we start with prior m0, and update η according to the\ninformation contained in z1. How much weight we give to this new\ninformation depends on its precision relative to the precision of the\nprior. The greater its hε relative to h0, the more the new information\nmatters.\nAlso important: the variance of this posterior will be less than the\nvariance of both the prior and the new information (Why?).\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n53 / 63\n\nCareer Concerns\nCareer Concerns\nThe Basic Model of Career Concerns: Equilibrium\n(continued)\nCombining these observations\nh0m0 + hεz1\nE(η | z1) =\nh0 + hε\nOr equivalently:\nh0m0 + hε(x1 - a1)\nh0 + hε\nE(η | x1) =\nTherefore, equilibrium wages satisfy\n\na1 )\nTo complete the characterization of equilibrium we have to find the\na1, and make\na1, that is, this will ensure a fixed\nh0m0 + hε(x1 -\nh0 + hε\nw2(x1 ) =\nlevel of a1 that the agent will choose as a function of\nsure that this is indeed equal to\npoint.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n54 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Equilibrium (continued)\nLet us first write the optimization problem of the agent:\nmax [w1 - c(a1)] + β[E{w2(x1) |\na1\n\nwhere we have used the fact that a2 = 0.\nSubstituting from above and dropping\n:\nw1\na1) a1\n}]\na1\n\nh0m0 + hε(x1 -\nh0 + hε\nmax β E\n- c(a1)\na1\nImportant: both η and ε1 are uncertain to the agent as well as to the\nmarket.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n55 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Equilibrium (continued)\nTherefore\na1)\n\na1\n- c(a1 )\nh0m0 + hε(η + ε1 + a1 -\nh0 + hε\nmax βE\na1\nAnd since a1 is not stochastic (the agent is choosing it), we have\n\na1)\n\nhε\nh0m0 + hε(η + ε1 -\nh0 + hε\nmax β\na1 - c(a1 ) + β E\nh0 + hε\na1\nThe first-order condition is:\nhε\n∗\nc0(a1 ) = β\n< 1 = c0(afb )\nh0 + hε\nThis does not depend on\na1\n, so the fixed point problem is solved\na1\nimmediately by setting\n∗\n= a1.\nFirst result: equilibrium effort is always less than first this.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n56 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Equilibrium (continued)\nWhy?: because there are two \"leakages\" (increases in output that the\nagent does not capture): the payoff from higher effort only occurs\nnext period, therefore its value is discounted to β, and the agent only\ngets credit for a fraction hε/(h0 + hε) of her effort, the part that is\nattributed to ability.\nThe characterization of the equilibrium is completed by imposing\na 1 = a ∗\nThis was not necessary for computing a\nthe equilibrium wage w1.\nRecall that\n∗, but is needed for computing\nw1 = E(y1 | prior)\n= E(η) + a 1\n∗\n= m0 + a1\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n57 / 63\n\nCareer Concerns\nCareer Concerns\nCareer Concerns: Comparative Statics\nWe immediately obtain:\n∂a ∗\n∂β > 0\n∗\n∂a1 > 0\n∂hε\n∗\n∂a1 < 0\n∂h0\nGreater β means that the agent discounts the future less, so exerts\nmore effort because the first source of leakage is reduced.\nGreater hε implies that there is less variability in the random\ncomponent of performance. This, from the normal updating formula,\nimplies that any given increase in performance is more likely to be\nattributed to ability, so the agent is more tempted to jam the signal\nby exerting more effort.\nThe intuition for the negative effect of h0 is similar.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n58 / 63\n\nCareer Concerns\nMultiperiod Career Concerns\nMultiperiod Career Concerns\nConsidered the same model with three periods.\nThis model can be summarized by the following matrix\n∗\nw1\na1 ∗\nw2(x1 )\na2 ∗\nw3(x1, x2) a3\nWith similar analysis to before, the first-order conditions for the agent\nare\nhε\nhε\n+ β2\nc0(a ∗\n1 ) = β h0 + hε\nh0 + 2hε\nhε\nc0(a ∗\n2 ) = β\n.\nh0 + 2hε\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n59 / 63\n\nCareer Concerns\nMultiperiod Career Concerns\nMultiperiod Career Concerns (continued)\nFirst result:\n∗\n∗\n∗\na1 > a2 > a = 0.\nWhy?\nMore generally, in the T period model, the relevant first-order\ncondition is\nT -1\n∗\nβτ-t+1\nhε\nc0(at ) = ∑\n.\nh0 + τhε\nτ=t\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n60 / 63\n\nCareer Concerns\nMultiperiod Career Concerns\nMultiperiod Career Concerns: Overeffort\nWith T suffi ciently large, it can be shown that there exists a period τ\nsuch that\n∗\n∗\nat<τ ≥ afb ≥ at>τ.\nIn other words, workers work too hard when young and not hard\nenough when old-\ncompare assistant professors to tenured faculty.\nimportant: these effort levels depend on the horizon (time periods), but\nnot on past realizations.\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n61 / 63\n\nCareer Concerns\nMultiperiod Career Concerns\nMultiperiod Career Concerns: Generalizations\nSimilar results hold when ability is not constant, but evolves over time\n(as long as it follows a normal process).\nFor example, we could have\nη = ηt-1 + δt\nt\nwith\nη0 ∼\nN (m0, 1/h0 )\nδt\n∼\nN (0, 1/hδ) ∀ t\nIn this case, it can be shown that the updating process is stable, so\nthat the process and therefore the effort level converge, and in\nparticular as t → inf, we have\nat → a\nbut as long as β < 1, a < afb .\nAlso, the same results apply when the agent knows his ability.\nWhy is this? In what ways it special?\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n62 / 63\n\nCareer Concerns\nMultiperiod Career Concerns\nEvidence\nChevalier and Ellison look at the behavior of fund managers in the\nearly 1990s, and find that the possibility of termination (as a function\nof their performance) creates career concerns for these managers. In\nparticular, the prevailing termination policies make the probability of\ntermination a convex function of performance for young managers.\nHighlighting that the setting matters for that form of career concerns\n(in this case driven by convexity of termination), their results suggest\nthat younger fund managers avoid (unsystematic) risk and hold more\nconventional portfolios\nDaron Acemoglu (MIT)\nMoral Hazard\nNovember 9 and 14, 2017.\n63 / 63\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Lecture 7: Efficiency Wages",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/b3e576df2a35d28219c37f7d1917415d_MIT14_661F17_lec7.pdf",
      "content": "Labor Economics, 14.661. Lecture 7: Effi ciency Wages\nDaron Acemoglu\nMIT\nNovember 16, 2017.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n1 / 26\n\nIntroduction\nIntroduction\nIntroduction\nFirst attempt to incorporate the internal organization of the firm with\nlabor market equilibria: effi ciency wage models.\nVery simple models of incentive problems (moral hazard or adverse\nselection) on the firm side combined with a simple model of the labor\nmarket.\nCanonical example: the Shapiro-Stiglitz model of effi ciency wages due\nto moral hazard.\nImplications:\nLabor demand reduced because of incentive problems→unemployment.\nInteractions between incentives and markets (\"unemployment as a\ndiscipline device\").\nPotential ineffi ciencies (but care is necessary...).\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n2 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEnvironment\nModel in continuous time and all agents are risk neutral and infinitely\nlived.\nWorkers have to choose between two levels of effort, and are only\nproductive if they exert effort.\n-→effort\n-→0\n~cost = 0, not productive\n-→1\n~cost = e, productive\nWithout any informational problems firms would write contracts to\npay workers only if they exert effort.\nThe problem arises because firms cannot observe whether a worker\nhas exerted effort or not, and cannot deduce it from output, since\noutput is a function of all workers'efforts.\nThis introduces the moral hazard problem.\nIn addition, workers cannot be punished for low output.\nThis introduces the limited liability problem.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n3 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEnvironment (continued)\nContinuous time→flow rates instead of probabilities.\nIf a worker \"shirks\", there is effort = 0, then there is a flow rate q of\ngetting detected and fired.\nWhat does this mean mathematically?\nFormally, this corresponds to a Poisson process in continuous time,\nmeaning that in the interval of length Δt, the probability of a shirking\nworker being caught is q · Δt + o(Δt), where o(Δt) designates terms\no(Δt)\nthat are second-order in Δt, i.e., limΔt→0\nΔt\n= 0.\nWhat does it mean economically?\nSuppose that the worker's actions affect the probability distribution of\nsome observable signal on the basis of which the firm compensates him\nor besides to fire him.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n4 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEnvironment (continued)\nLet\nb = exogenous separation rate\na = job finding rate, which will be determined in equilibrium\nr =interest rate/discount factor\nw = wage rate (not conditioned on past outcomes)\nAll of these are flow rates also.\nSolution, using simple dynamic programming arguments.\nLet us simplify the analysis by focusing on steady states.\nConsider the present discounted values (PDV) of workers as a\nfunction of their \"strategy\" of shirking or working hard.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n5 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nDynamic Programming Equations\nDenote the PDV of employed-shirker by VE\nS . Then\nrV S - V S = w + (b + q)(VU - VE\nS ).\nE\nE\nInterpretation in terms of asset values:\nthe worker always receives his wage w (a \"dividend\" on his asset)\nat the flow rate b, he separates from the firm exogenously, and at the\nflow rate q, he gets caught for shirking, and in both cases he becomes\nunemployed, receiving VU and losing VE\nS . In continuous time, the\nprobability that both events happen at the given instant is zero (or the\nprobability that both events happen in a small interval is very very\nsmall). Thus at the flow rate b + q, the current asset is swapped with\nanother assets with the value VU .\nfinally, there is an appreciation of the asset, captured by the term V E\nS .\nIn steady state: V S = 0, so\nE\nrV S = w + (b + q)(VU - VE\nS ).\n(1)\nE\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n6 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nDynamic Programming Equations (continued)\nSimilarly, let the PDV of employed-nonshirker be V N . We have\nE\nrV N - V N = w - e + b(VU - VE\nN ).\nE\nE\nOr in steady state\nrV N = w - e + b(VU - VE\nN ).\n(2)\nE\nDifferent from the PDV of shirkers, (1), because the worker incurs the\ncost e, but loses his job at the slower rate b.\nPDV of unemployed workers VU is\nrVU = z + a(VE - VU ),\n(3)\nwhere z is the utility of leisure + unemployment benefit, and\nn\no\nVE = max VE\nS , V N\n.\nE\n(Why?).\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n7 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nDynamic Programming Equations (continued)\nKey object: incentive compatibility constraint for workers so that they\nprefer to exert effort rather than shirk.\nNon-shirking condition:\nVE\nN ≥ VE\nS .\n(4)\nWhat is the interpretation?\nThe firm will offer a wage to the worker, but must ensure that the\nworker finds exerting effort (rather than shirking) incentive compatible.\nWill the firm ever offer a wage such that V N > V S\nE\nE ?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n8 / 26\n\nthe w\nwhen r and b are\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nDynamic Programming Equations (continued)\nLet us first focus on steady state.\nSuppose that a shirking worker always shirks and worker who exerts\neffort always does so also (is this necessary?). Then we can write (2)\nas\nw - e + bVU\nV N =\n,\nE\nr + b\nand (1) as\nw + (b + q)VU\nrV S =\n.\nE\nr + b + q\nCombining those, we can reexpress (4) as\ne\nw ≥ rVU + e + (r + b)\n[non-shirking condition].\nq\nIntuitively, the greater is the unemployment benefit and the greater is\nthe cost of effort, the greater should the wage be.\nMore importantly, the more likely the worker is to be caught when he\nshirks, the lower is the wage.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n9 / 26\nAlso,\nages higher\nhigher (Why?).\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEquilibrium\nSteady state requires that =⇒\nflow into unemployment = flow out of unemployment\nIn equilibrium, no one shirks because the non-shirking condition holds\n(similar to the agents doing the right thing in the agency models).\nTherefore,\nbL = aU\nwhere L is employment, and U unemployment.\nThis implies\nbL\nbL\na =\n=\n.\nU\nN - L\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n10 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEquilibrium (continued)\nLet us now eliminate all endogenous variables from the non-shirking\ncondition.\nIn particular, let us now combine (2) and (3) to eliminate VU .\nMaking use of the \"one step ahead deviation principle\", this can be\ndone as\nw - e - z\nrV N - VU =\n.\nE\nr + b + a\nThen combining this with (4), we can reexpress this condition as\n\nbN\ne\nNon-Shirking Condition : w ≥ z+e + r + N - L\nq\nA higher level of\nN , which corresponds to lower unemployment,\nN -L\nnecessitate a higher wage to satisfy the non-shirking condition.\nThis is the sense in which unemployment is a worker-discipline device.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n11 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEquilibrium: Interpretation\nHigher unemployment makes losing the job more costly, hence\nencourages workers not to shirk.\nSource of the idea that unemployment is a worker discipline device\n(what happens if unemployment is equal to 0?)\nNow in this light, let us revisit the implicit assumption that a firm\nalways fires a worker who is caught shirking. What happens if the\nfirm does not fire but pays a lower wage to such a worker? What\nhappens if the firm fires such a worker only with some probability, α?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n12 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEquilibrium (continued)\nNon-shirking condition≈labor supply (why?)\nFor equilibrium, we also need to consider labor demand.\nSuppose that the aggregate demand for labor is given from the\nproduction side represented by the aggregate production function\nAF (L).\nLet us make the standard assumptions on F , in particular, it is\nincreasing and strictly concave, i.e. F 00 < 0.\nNo adjustment costs are dynamics, so firms maximize static profits.\nTherefore, aggregate labor demand is given by\nAF 0 (L) = w.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n13 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEquilibrium (continued)\nEquilibrium in a picture.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n14 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nEquilibrium (continued)\nMathematically, the equilibrium is given by\n\nz + e + r + bN\ne = AF 0(L)\nN - L\nq\nLoosely speaking, labor demand is equal to quasi-labor supply.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n15 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nComparative Statics\nStraightforward comparative statics\nA ↓=⇒ L ↓: lower prod. =⇒ high unemployment\nz ↑=⇒ L ↓: high reservation wages =⇒ high unemployment\nq ↓=⇒ L ↓: bad monitoring =⇒ high unemployment\nr ↑=⇒ L ↓: high interest rates =⇒high unemployment\nb ↑=⇒ L ↓: high turnover =⇒ high unemployment\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n16 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nNon-Steady-State Dynamics\nAre there interesting non-steady-state dynamics?\nIn search models, which are also characterized by a \"flow in = flow\nout\" type equation, there will be dynamics.\nSo let's first think about this equation. Instead of steady state, if we\nlook at it more generally, we can write it as\nU = workers losing their jobs - hires.\nCould there be slow dynamics coming from this equation?\nSuppose that unemployment is above its equilibrium value, U∗ ,\ndetermined previously. What would happen?\nAnswer: there will immediately be a huge increase in hires until\nunemployment reaches immediately U∗ . Why?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n17 / 26\n\nShapiro-Stiglitz\nShapiro-Stiglitz Model of Effi ciency Wages\nNon-Steady-State Dynamics (continued)\nCould there be non-steady-state dynamics coming from the\nnon-shirking condition?\nNot really. With the argument given above, we have V N = V S at all\nE\nE\npoints in time, and thus\nV E\nN = V E\nS .\nBut this implies that even without imposing steady state, the exact\nsame non-shirking condition is obtained.\nIntuitively, the non-shirking condition has to hold at all points in time\nthis, which removes the possibility of higher wages in the future\nincentivizing workers. (Or vice versa).\nBut note a very important assumption here: no wage \"discrimination\"\nacross workers. What would happen if firms could offer (and commit\nto) different wages for different workers, and in particular as a\nfunction of their tenure in the firm?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n18 / 26\n\nShapiro-Stiglitz\nEffi ciency of Equilibrium\nEffi ciency\nSince there is unemployment, rents and information problems here, it\nis also natural to ask the welfare question: is the level of\nunemployment too high?\nAnswer: depends on what notion of welfare we are using and whether\nfirms are owned by nonworkers.\nIncorrect answer: the equilibrium is Pareto suboptimal.\nWhy is this incorrect?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n19 / 26\n\nShapiro-Stiglitz\nEffi ciency of Equilibrium\nEffi ciency (continued)\nConsider the equilibrium diagram with average revenue also included.\nThis shows that employment and output can be increased.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n20 / 26\n\nShapiro-Stiglitz\nEffi ciency of Equilibrium\nEffi ciency (continued)\nWhy is this?\nWhat are the externalities?\nBy hiring one more worker, the firm is reducing unemployment, and\nforcing other firms to pay higher wages→unemployment is too low.\nBy hiring one more worker, the firm is increasing the worker's utility\nat the margin, since each worker is receiving a rent (wage >\nopportunity cost)→unemployment is too high.\nThe diagram shows that the second effect always dominates (now\nconsider the average product line).\nThe unemployment is too high from the viewpoint of maximizing\ntotal output or net surplus.\nMaximum output when w =average productive labor. Why?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n21 / 26\n\nShapiro-Stiglitz\nEffi ciency of Equilibrium\nWhy Not Pareto Improvements?\nA subsidy on wages financed by a tax on profits will increase output.\nBut this is not a Pareto improvement.\nWho owns the firms?\nIf firms are owned by capitalists, the above policy will increase output,\nbut will not constitute a Pareto improvement.\nIf firms are owned by workers, the above policy will constitute a\nPareto improvement.\nBut in this case workers have enough income.\nWhy do they not already enter into \"bonding\" contracts or at least\nwrite better contracts as in our moral hazard models?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n22 / 26\n\nShapiro-Stiglitz\nOther Solutions to Incentive Problems\nOther Solutions to Incentive Problems\nThe discussion so far already suggests that constant wages are not\noptimal.\nWhat will optimal wage schedules look like?\nIf workers are not credit constraint and no limited liability, bonding\ncontracts.\nIf limited liability, then backloaded compensation\nWhat is the problem with backloading?\nPerhaps firm-side moral hazard- firms may claim workers have shirked\nand fire them either to reduce labor costs when the worker's wage has\nincreased enough (above the opportunity cost), or to collect the bond\npayments.\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n23 / 26\n\nShapiro-Stiglitz\nEvidence on Effi ciency Wages\nEvidence on Effi ciency Wages\nTwo types of evidence offered in the literature in support of effi ciency\nwages.\nFirst: presence of substantial inter-industry wage differences (e.g.,\nKrueger and Summers, 1989).\nSuch wage differentials are consistent with effi ciency wage theories\nsince the monitoring problem (q in terms of the model above) is\nnaturally more serious in some industries than others. But they are also\nconsistent with lots of other models.\nMoreover, the exact extent of \"true\" inter-industry wage differentials is\nquite debatable (e.g., Abowd, Kramartz and Margolis, 1999).\nFor example, these differentials may reflect compensating wages (since\nsome jobs may be less pleasant than others) or premia for unobserved\ncharacteristics of workers, which differ systematically across industries\nbecause workers select into industries based on their abilities.\nEven if there were such differentials across firms industries, this could\nbe rent-sharing (e.g., Van Reenen, 1996, Hildreth and Oswald, 1997).\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n24 / 26\n\nShapiro-Stiglitz\nEvidence on Effi ciency Wages\nEvidence on Effi ciency Wages (continued)\nHow can we control for compensating wage differentials?\nLook at wage changes for workers who change industries (Krueger and\nSummers; Gibbons and Katz, 1992). What is wrong with this exercise?\nDo workers vote with their feet? Quitting behavior (Krueger and\nSummers) and queuing behavior (Holzer, Katz, and Krueger, 1991).\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n25 / 26\n\nShapiro-Stiglitz\nEvidence on Effi ciency Wages\nEvidence on Effi ciency Wages (continued)\nSecond: look for direct evidence for effi ciency wage considerations.\nKrueger (1991) compares wages and tenure premia in franchised and\ncompany-owned fast food restaurants. Idea: less monitoring of\nworkers in a company-owned restaurant. Why? He finds higher wages\nand steeper tenure-which profiles in company-owned restaurants.\n2 Cappelli and Chauvin (1991): look at the number of disciplinary\ndismissals, as a measure of shirking, in the different plants located in\ndifferent areas, but all by the same automobile manufacturer (and\ncovered by the same union). The firm pays the same nominal wage\neverywhere (because of union legislation), which translates into\ngreater wage premia in some areas because outside wages differ.\nResult: when wage premia are greater, there are fewer disciplinary\ndismissals. Is this suffi cient evidence?\n3 Bewley (1999) and Campbell and Kamlani (1997) present survey\nevidence. Firms often unwilling to cut wages because this will reduce\nworker effort and increase shirking. Alternative explanations?\nDaron Acemoglu (MIT)\nEffi ciency Wages\nNovember 16, 2017.\n26 / 26\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Lecture Note: Life Cycle Labor Supply",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/7b8fec591cf1f707802b9cd31c4cf228_MIT14_661F17_lec_supply.pdf",
      "content": "-\nLife Cycle Labor Supply (Revised 9-26-17)\nJosh Angrist\nMIT 14.661 (FALL 2017)\nA\nThe LCLS Setup\nLive long and prosper\nUtility is a function of the lifetime stream of consumption (ci0,..., ciT ) and\nleisure (li0,..., liT ), where hit = ⌧\nlit is hours worked in a period.\n- At the beginning of adult life, we make a plan to max\nU(ci0, ci1,..., ciT ; li0, li1, ..., liT )\nassuming known paths for wages and prices\n- This is intractable; try this instead:\nT\nU(ci0, ci1,..., ciT ; li0, li1, ..., liT ) =\nX\nUt(cit, lit),\nt=0\na restriction called \"intertemporal additivity\"\n- Further simplification buys us stronger implications. It's customary to\nmodel within-period utilities as the same but for discounting:\nT ✓ 1 ◆t\nU(ci0, ci1,..., ciT ; li0, li1, ..., liT ) =\nX\nU(cit, lit)\n(1)\n1 + ⇢\nt=0\nThis implies that at fixed consumption and leisure choices, the MRS across\nadjacent periods is 1+⇢\n- We often simplify yet further, invoking \"within-period additivity\":\nU(cit, lit) = u(cit) + v(lit)\nGo out as you came in\nThe lifetime budget constraint is\n\n-\n-\n-\nλ\nλ\nλ\nλ\nT ✓ 1 ◆t\nX\n[ptcit\nwit(⌧\nlit)] = 0\n(2)\n1 + r\nt=0\nYou speak of chance, grasshopper ...\n- We don't know future wages and prices\n- Here's the formal structure: In each period, we max expected utility look\ning forward, confident we'll do the right thing down the road\nT\n◆s-t\n✓ 1\nmax Et\nX\nU(cis, lis)\n(3)\n1 + ⇢\ns=t\ns.t. Ait+1 =\n(1 +\n\nr)Ait + (1 + r)(withit\nptcit)\nAiT = 0\n- Formal modeling of uncertainty changes the lessons of LCLS theory re\nmarkably little: to understand the consequences of uncertainty, we can\nsolve the certainty model and consider consequences of shocks to the\nmarginal utility of wealth (later)\n... as if such a thing were sure to exist\nLet's solve for the certainty plan, initially under intertemporal additivity with\nout restricting preferences further.\nUnder certainty, we max the RHS of (1), while constrained to die with a\nclean slate, as described by (3).\n- Recall the LCH/PIH : what's the key insight? Keep your eyes peeled for\nsomething similar\n- Note that the Lagrange multiplier we require here has an i on it. FOCs\nfor period t choices go like this:\n◆t\n✓ 1\nUc(cit, lit)\n=\n1 + ⇢\n◆t\n✓ 1\nUl(cit, lit)\n=\n1 + ⇢\n◆t\n✓ 1\n1 + r\n◆t\n✓ 1\n1 + r\nipt\niwit\n(4)\n(5)\n- Rewriting these as\nUc(cit, lit)\n=\n\n◆t\n✓ 1 + ⇢\n1 + r\nipt\n(6)\nUl(cit, lit)\n=\n\n◆t\n✓ 1 + ⇢\n1 + r\niwit\n(7)\n\nλ\nλ\nλ\nλ\nλ\nλ\n%\nNote that there's a third (unwritten) FOC that pins down the multiplier\nas well (where does that come from?)\n- We've gone far enough to learn something useful:\n[cit, hit] = f(r, ⇢, i, pt, wit)\n- We also have\ni = f(r; ⇢, ; p0, ..., pT ; wi0, ..., wiT )\n- This reminds us of the PIH for consumption: how does consumption\nbehave in the benchmark case? (Be sure you can show this in a\nsimple model)\n- This suggests an interesting prediction: holding MU(wealth) =\nfixed, raising wit increases hit\n- Higher wit on RHS of (8) means we must raise MU of leisure; we\ncan do that by deceasing leisure and we do that by increasing hours\nworked\n- This is a hand-waving argument since we know that utility functions\nneed only be quasi-concave while here I'm using old-fashioned con\ncavity, and, implicitly, within-period additivity\n- Browning, Deaton, and Irish (1985) give an elegant duality-type ar-\n@hit\ngument for the result that with MU(wealth) fixed, @wit > 0; this is\ndiscussed briefly below\nOptimizing in an uncertain world\n- Maximizing (4) instead of (1), leaves us with the same FOCs, except the\nMU(wealth) is now time-varying, so we write\nit\n- Time-varying MU(wealth) is a random variable; we don't know today\nwhat tomorrow will bring, and how this news a↵ects our lifetime\nbudget. Even so, we predict this, without bias:\n\nit+1\nit = Et\n,\n(8)\n1 + r\nwhere Et denotes expectation conditional on all thats known at time\nt (see Browning, Deaton, and Irish, 1985; Altonji, 1986, for details)\nDual roads to a full life\nRecall that expenditure minimization is the dual to utility maximization in a\nstatic model. Browning, Deaton, and Irish (1985) show that that LCLS dual is\nprofit maximization: imagine yourself as a \"utility factory,\" producing output\nvalued at the price at which you implicitly buy it. What should this price be?\ni\n\nλ\nλ\nffi\nffi\n-\n-\n-\n'\nλ\nλ\nλ-\nλ\nλ\nSince\ni is the marginal utility of a dollar of wealth, wealth required to buy\nu0 utils (a dollar value) is qi ⌘ (1/ i)u0. Profit is defined as the di↵erence\nbetween the value of the utility we produce and the amount spent (on leisure\nand consumption) to get it.\n- Under additive separability, profit over all periods is maximized by solving\nwithin-period profit-maximization problems: your utility factory produces\ne ciently when it's e cient every period\n- Under certainty (using my notation above), profit is maximized by solving\n⇢\nu\nwit(T\nhit) + ptcit\nmax\nqi\n; U(cit, T\nhit) = u\n(9)\nu,cit,hit\n(1 + ⇢)t\n(1 + r)t\nfor each t. This has FOCs again given by (5) and (6), but here the marginal\n-1\nutility of wealth, qi =\n, is a parameter\ni\n- Solving the profit max problem directly yields the Frisch labor supply\nfunction, h(wit, pt, i), also known in the vernacular as \"\nconstant\"\nlabor supply\n- A duality-type type argument shows that the derivative of Frisch\nhours worked with respect to wages must be positive\n1. Define the profit function to be the maximized maximand associated\nwith (10); write this as ⇡(qi, wit, pt). A Shephard's-Lemma-type re\nlation implies that\n@⇡(qi, wit, pt) = h(wit, pt, i)\n@wit\n2. As in conventional producer theory, the consumer/worker profit func\ntion is convex in prices, so\n@2⇡(qi, wit, pt)\n@h(wit, pt, i)\n=\n> 0\n@wit\n@wit\n(We think of wages as the price of market labor; you sell this plus\nutility to cover the cost of consumption inputs)\n- The LCLS hours equation makes the utility price into a parameter, instead\nof unearned or full income (as in the Marshallian problem) or a reference\n(lifetime) utility level (as for Hicks)\n- The Frisch labor supply elasticity, also called the intertemporal sub\nstitution elasticity (ISE), exceeds Hicks', unless income e↵ects are\nzero; the di↵erence between them (Hicks minus Frisch) is propor\ntional to the product of the relevant income e↵ect (a negative num\nber for hours) and Frisch's \"income flexibility,\" @ ln q/@ ln AT , where\nAT is unearned income (set to zero in my version, but generally a\nparameter). This derivative is positive, since MU(wealth) declines as\nwealth increases (see BDI, p. 509 for the general formula)\n\nγ\nδ -γ\nδ\nγ δ\nδ\nλ\nλ -\nγ\n-\nδ\nδ -\n%\nδ -\nδ -\nδ\n-\nδ\nδ\nδ\nδ\nδ\nλ\n- In an uncertain world, MU is time-varying, so we add (9) as before; the\nsolution is otherwise unchanged\nB\nEmpirical LCLS\n- Following Heckman and MaCurdy (1980), MaCurdy (1981) assumes within-\nperiod additivity of the form:\nU(cit, hit) = 1icit\n2ihit\nwhere we switch to utility in terms of hours worked\n- In addition to providing parametric specificity, this generates an important\nsimplification of (7) and (8). From the FOC for hours, we get\n✓ 1 + ⇢ ◆t\n2h 2 -1\n2i\nit\n=\niwit\n1 + r\nFutzing and putzing, this yields a linear-in-logs labor supply function:\nln i\nln 2i\nln 2\nt\n✓1 + ⇢ ◆\nln hit =\n+\nln\n+\nln wit\n1 + r\n- Approximating this gives us Heck-MaC labor supply as usually written:\nln hit = μi + (⇢\nr)t + ln wit + uit\n(10)\nwhere\n=\nis the Heck-Mac ISE and uit is a \"tacked-on\" error (Note\n-1\nthat 2 > 1 [why?])\nUnderstanding the ISE\nThe parameter , the Heck-Mac ISE, interests us greatly\n- In general, the ISE (Frisch elasticity) is positive and (weakly) larger than\na traditional Hicksian substitution elasticity, which of course, exceeds the\nMarshallian uncompensated elasticity\n- The ISE describes labor supply responses that hold the marginal utility\nof wealth fixed\n- Recall that\ni is a function of the entire path of wages and prices (obtained\nby substituting solutions like (11) back into the budget set). What sort\nof \"experiments\" generate such wealth-constant e↵ects?\n- Consider my lifetime work plan: My wage profile is known; my\nmarginal utility of wealth is fixed. But I work harder at age 30\nthan 25. How come and how much? The ISE answer this question;\nit describes how I allocate my hours over my lifetime to best exploit\nthe low-hanging fruit on o↵er when wages are high, binge-watching\nGoT and riding single track when my time is cheap\n\nλ\n∆\n∆\nδ\nδ\nλ\nλ\nλ\n- Cab drivers who anticipate trip demand over days of the week and\nhours of the day make the same calculation: evolutionary wage changes\nneed not play out in \"evolutionary time\"\n- Well, we don't all drive cabs (not yet, anyway). The ISE also approx\nimates the response to any short-run or small change that changes\nchanges lifetime wealth little. The ISE therefore looms large in\nmacro: cyclical variation that is either anticipated or modest enough\nto leave\ni unchanged generates an ISE-mediated supply response\n(Lucas and Rapping's (in)famous explanation of cyclical unemploy\nment: leisure!)\n- The ISE doesn't explain the response to changes in (lifetime) wealth. The\nHeck-MaC model produces a simplified version of that idea. Labor supply\nresponds to a shock of amount\nt by:\n@hit\nd ln wit\nd ln i\n=\n+\n@\nt\nd ln 4t\nd ln 4t\nA shift in the entire life-cycle wage profile, for example, reduces\nand has\na dominating negative wealth e↵ect on hours.\n- Proof that higher wages lower\n...\n⇤ I gave a hand-waving argument in the previous section. For rig\norous proof we can solve the comparative statics problem that\nasks how all endogenous variables, including the marginal utility\nof wealth, change as a function of changes in prices. This can\nbe done by brute force by di↵erentiating first order conditions,\nincluding the budget line, and solving the relevant comparative\nstatics problem using Cramer's Rule as in Varian 1978, Sections\n3.9 and 1.14). Quasi-concavity of the utility function - which\nsigns the determinant of the bordered Hessian and principal mi\nnors involved in this - implies the result.\n- The ISE concept isn't tied to Heck-MaC preferences; any LCLS model\nhas one. Labor economists tend to see the ISE through the lens of the\nHeck-Mac model since it provides powerful simplification, and we like to\nthink of the ISE as a parameter (hence, we label it in Greek). In practice,\nof course, individuals react di↵erently to changes in wages. Our empirical\nmodels implicitly target an average ISE or an economy-wide e↵ect\n- More important than the ISE parameter generated by particular prefer\nences is the ISH (for hypothesis): make hay while the sun shines!\nA sense of smoothness\n- The LCLS framework presumes perfect credit: workers borrow and lend\nfreely at parametric interest rates, frictionlessly exploiting the fact that\n\nto everything there is a season and a time to every purpose under heaven\n... when wages are high, it's time to work!\n- Workers who can't take advantage of seasonal advantage are said to be\nliquidity constrained\n- Liquidity constraints and simple myopia look similar: both generate strong\nwithin-period wealth e↵ects (as we'll soon discuss further)\n- How relevant is the ISE? Well, how big are your wealth e↵ects? On this,\nreasonable labor economists can disagree (See, e.g., Card, 1994)\nMaCurdy Metrics (up next)\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n14.661 Labor Economics I\nFall 2017\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "14.661 F17 Lecture Note: Market Structure and the Min",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/14-661-labor-economics-i-fall-2017/c186e680c574a1dae5497c6fd357fcc5_MIT14_661F17_lec_market.pdf",
      "content": "-\n-\n-\n-\n-\n-\nMarket Structure and the Min\nJosh Angrist\nMIT 14.661 (FALL 2017)\nA\nOne factor competitive benchmark (reprise)\n- As before, the one-factor setup is derived from two:\nq = F (K, L)\nf(L) ⌘ F ( K, L); f 0(L) > 0; f 00(L) < 0\n- When firms are price-takers in goods and factor markets, we have:\n⇡(L) = pf(L)\nwL\nwith ⇡\nmax f.o.c.'s:\npf 0(L)\n=\nw\nMR = MC\nP-comp ... on Not\n- Perfect competition means firms are everywhere price-takers, that is: prices\nare parametric in product and factor markets\n- Classic deviations: (a) prices not parametric in product markets (monopoly);\n(b) prices not parametric in factor markets (monopsony)\nB\nWho's Got the Power?\nPower in the product market\n- Market power means the employer faces downward sloping demand instead\nof perfectly elastic, so p(q) = D 1(q) is what individual firms react to\n- The monopolist's ⇡\nmax problem:\n⇡(L) = D 1[f(L)]f(L)\nwL\n\n-\n-\n\"\n-\n-\n-\n-\n-\n-\n- f.o.c.\npf 0(L) + p 0(q)f 0(L)f(L)\nw = 0\nThe derivative of D 1(q) is 1/D0(p), so we have\npf 0(L) +\nq\nf 0(L) = w\nD0(p)\n- Simplify\n\nw\nf 0(L) 1 +\n=\n,\n⌘\np\nD0 (p)p\nwhere ⌘ =\n. This is an MR=MC type relation. We say: the monop-\nq\nolist sets MR equal to the wage (DRAW THIS)\n- Implications:\n1. No self-respecting (i.e., profit-maximizing) monopolist will be found\nwhere where |⌘| < 1 [Why?], so demand must be at least unit elastic.\nTherefore,\n0 < 1 + < 1\n⌘\nThus, the monopolist recognizes that MR is attenuated by the need to\nlower prices to sell the extra output produced by additional workers,\nbut high prices don't kill all his demand (DRAW THIS).\n2. We get p-comp as a special case when\n⌘ = -1\n- This model seems to miss something fundamental about product market\npower. Would Alitalia and El Al really employ more pilots and crew if\nmarkets for flights from Logan to FCO and TLV were competitive?\nPower in the factor market\n- Market power means the employer faces upward sloping instead of per\nfectly elastic supply, so w(L) = S 1(L)\n- The monopsonist's ⇡\nmax problem:\n⇡(L) = pf(L)\nS 1(L)L\n- f.o.c.s\npf 0(L)\n⇥\nS 1(L) + Lw0(L)\n⇤\n= 0\n\n-\n\"\n\"\n- Re-arrange:\n\nL\npf 0(L)\nw +\n= 0\nS0(w)\n\npf 0(L) = w 1 +\n> w\n✏\nagain, an MR=MC type relation. Here the marginal factor cost (MFC)\nexceeds the wage because of the need to raise wages to hire more work\ners (we pay inframarginals this higher wage too). [Is that bad for the\nmonopsonist?] We say: the monopsonist sets MR equal to MFC (DRAW\nTHIS)\n- Implications:\n1. A monopsonist exploits the opportunity to decrease wages as employ\nment falls (in fact, he exploits his workers - how come?)\n2. We get p-comp as a special case when\n✏ = 1\n3. The exploitative monopsonist makes money yet never sleeps easy\nhe'd always like to hire more workers at current wages. Monopolists\ncan be heard bellyaching about \"labor shortages.\" [DRAW THIS]\n- Classical monopsony is rare. But it's enough for an employer to have some\nmarket power for monopsony-related policy implications to go through\n(see, e.g. CK's M&M or Manning, 2003). Speak truth to monopsonistic\npower, baby: it's just a matter of upward-sloping supply!\nC\nMonopsony and the Min\n- Minimum wage effects are often taken as a litmus test for whether the\nlabor market is competitive\n- Some say: most employers are small, so must pay the going wage. Others\nnote the pervasive presence of recruiting bonuses and the like; this is the\nRed Badge of Market Power\n- If the labor market is competitive, the min moves us back along downward\nsloping demand; if not, all bets are off (DRAW THIS)\n- The evidence we have on the min comes from a mixture of time series and\ndiffs-in-diffs style analyses; we'll look briefly at a classic study\n- The debate continues: see recent contributions by Dube, Meer and West,\nNeumark and Wascher, among others. Much of this is around the appro\npriate control group, the fundamental econometric concern in this context\n\nQccAngrist, Joshua D.,_lbH+QNgqafic,KmqrjwF_pkjcqqCamlmkcrpgaq8?lCkngpgagqrUqAmkn_lgml,\nNpglacrmlSlgtcpqgrwNpcqq*0..6,Af_nrcp3,\nSee Card, David and Alan B. Krueger. \"Minimum Wages and Employment: A Case Study of the\nFast-Food Industry in New Jersey and Pennsylvania. The American Economic Review 84, no. 4\n(1994).\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n\n14.661 Labor Economics I\nFall 2017\n\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}