{
  "course_name": "Laboratory Fundamentals in Biological Engineering",
  "course_description": "This course introduces experimental biochemical and molecular techniques from a quantitative engineering perspective. Experimental design, rigorous data analysis, and scientific communication form the underpinnings of this subject. Three discovery-based experimental modules focus on genome engineering, expression engineering, and biomaterial engineering.\nThis OCW site is based on the source OpenWetWare class Wiki, found at 20.109(F07): Laboratory Fundamentals of Biological Engineering.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Systems Engineering",
    "Science",
    "Biology",
    "Genetics",
    "Engineering",
    "Biological Engineering",
    "Systems Engineering",
    "Science",
    "Biology",
    "Genetics"
  ],
  "syllabus_content": "For many of you this will be the first time in a research lab and for others it will not, but it is our goal to make this class a useful and fun introduction to experiments and techniques in biological engineering. There is not time enough to show you everything you'll need to know if you go on to do research, but after taking this class you should feel confident and familiar with some fundamental experimental approaches and lab protocols. You will develop good habits at the bench, ones that will increase the likelihood of success in your work and ensure the health and safety of you and those around you. By the end of the semester, you should also be aware of good scientific practice, having had some experience with report writing, notebook keeping and publicly presenting your data. All of us involved in teaching 20.109 hope you will find it a satisfying challenge and an exciting experience that has lasting value.\n\nCourse Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nLabs: 2 sessions / week, 4 hours / session\n\nHow 20.109 Varies from Term to Term\n\n20.109 is offered twice per year in the fall and spring semesters, with rotating instructor responsibilities. Reflecting the instructors' specific expertise and the evolving biological engineering field, the topics covered will change over time. The fall term focus, led by Natalie Kuldell, reflects her molecular genetics, microbiology, and synthetic biology expertise. The\nspring term\nfocus reflects Agi Stachowiak's biomaterial and tissue engineering background.\n\nLayout of the Class: Labs and Assignments\n\nYou will perform three series of experiments (called 'modules') over the course of the semester. The modules differ in length and in the ways you will be assessed. The experiments and major assignments are:\n\nMODULE #\n\nTOPICS\n\nMAJOR ASSIGNMENTS\n\nGenome engineering\n\nPortfolio\n\nExpression engineering\n\nWritten report\n\nBiomaterials engineering\n\nOral presentation plus written text\n\nYou will be working as pairs throughout the semester, but you will submit individual lab reports and give individual oral presentations.\n\nIn addition to the module assignments listed above, there are several other forms of required coursework.\n\nJournal Club\n\nEach student will give an oral presentation on a paper associated with either Module 1 or Module 2.\n\nDaily Lab Quizzes\n\nThese are intended to refresh your memory about the experiment you are performing. They will not be hard and should take no more than 5 minutes at the beginning of lab. [\nThese quizzes are not provided in this OCW site\n.]\n\nHomework Assignments\n\nThese will vary considerably in content and points associated with each assignment. You may be asked to perform a calculation, draw a conclusion, and/or make a figure using the data you have collected. The homeworks can be found in the \"for next time\" section of each lab day. You can work with your lab partner, friends and teaching assistants on these assignments but you will hand in individual assignments.\n\nLaboratory Notebooks\n\nYou will record your data on the white pages of a bound notebook. The yellow, duplicate pages will be collected and evaluated by the teaching assistants. Be sure you follow the\nguidelines for lab notebooks\n.\nLate work will be penalized 1/3 of a letter grade for each day late and will not be accepted after a week.\n\nOpenWetWare Wiki\n\nSince 20.109 is a lab class, we think the students, TAs and instructors would benefit from having a shared space in which to discuss experimental protocols and results. By putting all course materials on the\n20.109 (Fall 2007) OpenWetWare Wiki\n, they can be updated and improved instantly by everyone (not just the instructors).\n\nMore about OpenWetWare use in 20.109\n\nLab Attendance\n\nLab attendance is mandatory and there are no make-up labs. A family crisis or severe illness requiring attention from the infirmary and prohibiting you from all your coursework are acceptable reasons for missing lab and every effort will be made to accommodate you in these exceptional circumstances.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nGenome engineering assignment\n\n25%\n\nExpression engineering assignment\n\n25%\n\nBiomaterial engineering assignment\n\n20%\n\nJournal club oral presentation\n\n10%\n\nDaily lab quizzes\n\n5%\n\nHomework\n\n10%\n\nLaboratory notebooks\n\n5%\n\nCalendar\n\nEach class session in the following calendar actually consists of a 1 hour lecture and a 4 hour lab.\n\nSES #\n\nMODULE DAY\n\nTOPICS\n\nKEY DATES\n\nOrientation\n\nModule 1: Genome engineering\n\nStart-up genome engineering\n\nAgarose gel electrophoresis\n\nDNA ligation and bacterial transformation\n\nExamine candidate clones\n\nM13.1\n\nLecture on oral presentations\n\nWestern analysis\n\nProbe western\n\nLecture on environmental health and safety\n\nFirst draft of genome engineering portfolio parts 1, 2, and 4 only is due before you arrive in lab\n\nOral presentations\n\nFirst draft of genome engineering portfolio part 3 only is due before you arrive in lab\n\nModule 2: Expression engineering\n\nsiRNA design and start-up in cell culture\n\nTransfection\n\nLuciferase assays and RNA prep\n\nJournal article discussion\n\nLecture on written reports and scientific writing\n\ncDNA synthesis and microarray\n\nMicroarray data analysis\n\nLecture on high throughput technologies; no lab\n\nFirst draft of expression engineering report is due by 5 PM on the day you meet for lab\n\nOral presentations\n\nModule 3: Biomaterials engineering\n\nGrowth of phage materials\n\nPhage nanowires\n\nTEM\n\nPhage by design, part 1\n\nPhage by design, part 2\n\nECD assembly\n\nOral presentations\n\nEnd of term celebration",
  "files": [
    {
      "category": "Resource",
      "title": "lerner_revie_tip.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/641905a4ecb827a1accc8611c94dd6d9_lerner_revie_tip.pdf",
      "content": "Techniques for Responding to a Peer's Writing*\nNeal Lerner\nMIT\nWhy respond? Responding to writing is a vital activity (after all, we all need readers), but not\nnecessarily an easy one. Response can take several forms: You might respond as a way of\nstarting a discussion with your peer about his or her paper content. You might respond as a way\nof building a relationship with the writer. You might respond to share your reactions as a reader.\nYou might respond in the role of \"expert\" to provide specific knowledge and feedback about the\nwriter's approach. However, whatever your specific purpose, the bigger picture to keep in mind\nis that your response should enable the writer to learn, whether that learning will show up in\nsubsequent drafts or future papers.\nBelow are several strategies for both summary response (commentary that sums up your\nfeedback to a writer's draft) and in-text comments (the feedback that you place throughout the\ndraft):\nSummary Response--Make it personal: It might seem simple enough, try to start your\noverall response to your peer by addressing him or her by name. This \"personal\" touch\nhas meaning for the writer as it conveys sincerity and acknowledgement of the student as\na writer. And who of us doesn't pay more attending to what we reads when it starts with\naddressing us by name?\nSummary Response--Start with the positive: No matter how much of a mess your peer's\npaper might be, it is important to begin your response with anything he or she did well. If\na goal is to have writers learn from your comments, an initial focus on what works allows\nfor a smoother transition to what needs work. Leading with what writers did well,\nwhether it be a strong sense of purpose, a vivid detail, or a focused controlling sentence,\nallows messages of concern to be more readily accepted and translated into improvement.\nSummary & In-Text Response--Stop at Three: You don't have to ask very many writers\n(and perhaps you were one of them as we were) to find someone who's had the\nexperience of getting back a draft that was \"bleeding\" in red ink. Some instructor's\nimperative to be comprehensive in their response often can end up overwhelming and\nintimidating writers. Three is a useful number to keep in mind: Focus on three areas of\nconcern in the writer's paper or three specific suggestions for revision. More than that\nwon't necessarily be productive.\nSummary Response--Think Big to Little: When offering summary response, start with\nhigher-order concerns first and then to move to later-order concerns or, in other words,\ntalk about general issues first and then focus on specifics in the text. Keep in mind that\nyou are responding to both sets of issues here, but that you want to foreground this \"big\"\nconcerns of focus, detail, evidence, and structure, before you get to respond to how the\nsentences were put together.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nThe Allyn & Bacon Guide to Peer Tutoring, 2nd ed.\nTechniques for Responding to Student Writing\nIn-Text Response--Respond as a reader: It is awfully easy to read anyone's writing with\na pen or cursor ready to mark, correcting those grammar errors, cutting out those excess\nwords, or offering alternatives. This act of editing can be effective in small doses (for\ninstance, one or two paragraphs) as a way of modeling one way to rewrite the someone's\nwords, but in large doses it is largely ineffective if you want your peer to learn to improve\nhis or her writing (and it largely leaves student writers dispirited and unmotivated).\nInstead, respond to the writer's draft as a reader, and that means primarily asking\nquestions or indicating something that works well or some things that need clarification:\n\"I don't know what you mean here.\" \"I expected you to tell me your focus at this point.\"\n\"Great detail!\" \"What do you mean by this?\" \"What happened next?\" \"I needed a\ntransition between these two ideas.\"\nAdditional Resources for Responding\nPeer-Review Guidelines from M. Maner The Research Process, 2nd ed. (McGraw Hill, 2001):\nhttp://www.mhhe.com/mayfieldpub/maner/resources/peerreview.htm\n*Adapted from Gillespie, Paula, and Neal Lerner. The Allyn & Bacon Guide to Peer Tutoring, 2nd ed.\nBoston: Allyn & Bacon, 2003.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "sci_writing_guid.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/001eb8f8328b250cf037dce1af6c2c0d_sci_writing_guid.pdf",
      "content": "A Guide to Scientific Writing\nNeal Lerner\nMarilee Ogren-Balkama\nMassachusetts Institute of Technology\nIntroductions\nWhat's an Introduction?\n-\nAn introduction is a method to familiarize and orient your readers.\n-\nThe content of an introduction depends on its purpose and the audience.\n-\nAll models share a direct approach. Don't hide your main point or save it until the end of\nthe paper.\nWhat's the Purpose of an Introduction in Scientific Writing?\n-\nProvide the context of your work (create your research space, define gap in knowledge, set\nup the direction you'll take in your discussion section).\n-\nState your focus (hypothesis, question).\n-\nProvide justification for your work (how your work can answer the question).\nWhat are Some Common Pitfalls of an Introduction Section?\n-\nIncluding unnecessary background or being repetitive.\n-\nExaggerating (or understating) the importance of your work.\n-\nUsing lackluster openers and weak follow-through in the body of your introduction.\n-\nNot grounding the work in a context that will be important to your reader.\n-\nNot focusing on a clear and compelling research question or hypothesis.\nGuidelines for Introductions from Two Scientific Organizations\nFrom the International Committee of Medical Journal Editors:\nState the purpose of the article and summarize the rationale for the study or observation. Give\nonly strictly pertinent references and do not include data or conclusions from the work being\nreported.\nFrom the American Society for Microbiology:\nThe introduction should supply sufficient background information to allow the reader to\nunderstand and evaluate the results of the present study without referring to previous\npublications on the topic. The introduction should also provide the hypothesis that was addressed\nor the rationale for the present study. Use only those references required to provide the most\nsalient background rather than an exhaustive review of the topic.\nMethods\nWhat are Some Goals of a Methods Section?\n-\nPresent the experimental design.\n-\nProvide enough detail to allow readers to interpret your results.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLerner & Ogren, A Guide to Scientific Writing\np. 2\n-\nGive enough detail for readers to replicate your work.\n\"The key to a successful Methods section is to include the right amount of detail--too\nmuch, and it begins to sound like a laboratory manual; too little, and no one can repeat\nwhat was done.\"\nSuccessful Scientific Writing, 2nd ed.\nWhat are Some Pitfalls of a Methods Section?\n-\nProviding too little or too much information.\n-\nReiterating published methods rather than citing them.\n-\nWriting strictly in chronological order (alternatives: most important first, most fundamental\nfirst, etc.).\n-\nMethods and results don't correspond (you have to provide methods for all the experiments\nyou report).\n-\nForgetting to use visual organizers that direct readers to specific aspects of the methods\nsection, e.g., subheads.\n-\nUsing a \"dangling modifier\" because of an over-reliance on passive voice:\n\"After scraping the desired plate in four swipes, the bacteria were placed in 8ml of media\nwith no antibodies.\"\n-\nFailing to provide a context for the methods themselves:\n\"In order to . . . , we . . . \" ⇐ context for the particular method is provided.\n-\nWriting a Protocol rather than a Methods section.\nA Protocol is . . .\nA series of steps to be carried out.\nWritten in sequential or temporal order.\nIntended for the reader to achieve a final result.\nA Methods Section is . .\nA series of steps already completed and is written in past tense.\nWritten in logical order.\nIntended for the reader to replicate the experiment.\nResults\nWhat is the Purpose of the Results Section?\n-\nObjectivity: Make the data, just the data, easy to find.\nSome readers want to interpret your data themselves rather than accepting the\ninterpretation presented in the discussion.\n-\nDescription: Describe the data presented in figures and tables.\nWhat Differentiates Results from the Methods?\n-\nMethods = How the data were accumulated.\n-\nResults = What data were accumulated.\nWhat Differentiates Results from the Discussion?\n-\nResults = Data presentation (\"Experiments showed that . . . .\")\n-\nDiscussion = Data interpretation (\"Experiments suggest that . . . .\")\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLerner & Ogren, A Guide to Scientific Writing\np. 3\nWhat are the Contents of a Results Section?\n-\nA brief description of the experiment or rationale at the beginning of each subsection (\"In\norder to . . . . As a result, we found that . . . .).\n-\nThe data (in past tense).\n-\nDescriptive text for FEW determinations.\n-\nTables or graphs for REPETITIVE determinations.\n-\nThe data that your methods indicated you would produce (and answering the questions you\nestablished in your introduction).\nWhat are Some Qualities of a Well-Written Results Section?\n-\nMethods and Results Correspond.\ni.e., no experimental results for which there are no methods, and vice versa.\n-\nResults are presented in a logical order.\ne.g., most important first, most fundamental first, etc.\n-\nResults focus on the question(s) or hypothesis introduced earlier in the paper.\nWhat are Some Pitfalls of a Results Section?\n-\nOverstating the results (e.g., \"Figure 1 clearly shows...\")\n-\nReporting irrelevant results: Although it is sometimes useful to report experiments that\ndidn't work.\n-\nOmitting visual organizers, such as subheads.\n-\nIncluding inappropriate illustrations.\n-\nIncluding methods and/or discussion: Overlap is acceptable in some circumstances.\nIllustrations\nWhat's the Purpose of Illustrations?\n-\nCondense large amounts of information\n-\nConvince readers of your findings (by showing data quality).\n-\nFocus attention on certain findings (e.g., relationship between values).\n-\nSimplify complex findings.\n-\nPromote thinking and discussion.\nIllustration Caveat: The most beautiful illustration cannot hide lousy content--content is key.\nWhat are Some Pitfalls of Figures and Titles/Captions?\nFigures\n-\nNot mentioned in text.\n-\nTextual data inconsistent with figures.\n-\nMislabeling.\n-\nSymbols, data points, unreadable or cluttered.\n-\nUgliness (failure to get help from graphic designer).\nCaptions\n-\nReiterate results section\n-\nWritten in shorthand, abbreviated form rather than whole sentences.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLerner & Ogren, A Guide to Scientific Writing\np. 4\nChoose the Most Effective Type of Illustration for a Given Goal\n(from Successful Scientific Writing, 2nd ed.)\nTo accomplish this:\nChoose one of these:\nTo present exact values, raw data, or data\nwhich do not fit into any simple pattern.\nTable, list\nTo summarize trends, show interactions\nbetween two or more variables, relate data\nto constants, or emphasize an overall\npattern rather than specific measurements.\nLine graph\nTo dramatize differences or draw\ncomparisons.\nBar graph\nTo illustrate complex relationships, spatial\nconfigurations, pathways, processes, or\ninteractions.\nDiagram\nTo compare or contrast.\nPictograph, pie chart, bar graph\nChoose the Most Effective Type of Illustration (cont.)\nTo accomplish this:\nChoose one of these:\nTo show sequential processes\n⇐---------⇒\nFlowchart\nTo classify information\n⇐---------⇒\nTable, list, pictograph\nTo describe parts or circuits.\n⇐---------⇒\nSchematic\nTo describe a process, organization, or model.\nPictograph, flowchart, block diagram\nTo describe a change of state.\n⇐---------⇒\nLine graph, bar graph\nTo describe proportions.\n⇐---------⇒\nPie chart, bar graph\nTo describe relationships.\n⇐---------⇒\nTable, line graph, block diagram\nTo describe causation.\n⇐---------⇒\nFlowchart, pictograph\nTo describe an entire object.\n⇐---------⇒\nSchematic, drawing, photograph\nTo show the vertical or horizontal ⇐---------⇒\nFlowchart, drawing tree, block diagram.\nhierarchy within an object, idea, or\norganization.\nProvide Textual Context for Your Illustrations\nIn the body of your article:\n-\nRefer explicitly to the illustration (e.g., \"see Table 1,\" \"refer to Figure 3.\")\nTell the reader:\n-\nHow the graphic advances, supports, clarifies, or summarizes your discussion.\n-\nWhy it is important.\n-\nWhat it means.\n-\nHow it supports your argument.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLerner & Ogren, A Guide to Scientific Writing\np. 5\nExamples of Effective Titles/Legends\nFigure 1. Initial velocity vs. ONPG substrate concentration for His461. ONPG was added to\nβ-galactosidase extracted from E. coli His461. The initial rates were measured using\nspectrophotometer A420 readings.\nTable 1. Increase of Initial Velocity with Increase of Enzyme Concentration. As the\nconcentration of the enzymes His461 and CSH36 are increased, the rate of A420 reading\nincreases, as does the initial velocity (in nmol ONP/ml/min).\nFigure 1. Optical density readings at 595nm at four known concentrations. The best-fit line\nis drawn to determine the protein concentration of samples with known optical densities.\nDiscussion/Conclusion\nWhat is the Purpose of a Discussion Section?\n-\nSummarize findings presented in the results section\n-\nCite supporting literature.\n-\nExplain discrepancies between your findings and previous reports.\n-\nPoint out shortcomings of your work and define unsettled points.\n-\nDiscuss theoretical and practical implications of your work.\n-\nEnd with a short summary or conclusion about the work's importance.\nQuestions You Will Address in a Discussion Section\n-\nWhat did you expect to find, and why?\n-\nHow did your results compare with those expected?\n-\nHow might you explain any unexpected results?\n-\nHow might you test these potential explanations?\nTips for Writing a Discussion Section\n\"This is the place to interpret your results against a background of existing knowledge. Explain\nwhat is new in your work, and why it matters. Discuss both the limitations and the implications\nof your results, and relate observations to other relevant studies. State new hypotheses when\nwarranted, clearly labeled as such. Include recommendations, when appropriate.\"\nEight Common Components of a Discussion Section (Swales)\n-\nBackground information\n-\nStatement of results\n-\n(Un)expected outcome\n-\nReference to previous research\n-\nExplanation\n-\nExemplification\n-\nDeduction and Hypothesis\n-\nRecommendation\nWhat is the Purpose of a Conclusion?\n\"Besides presenting an analysis of the key results in the conclusion sections, you also give a\nfuture perspective on the work. In some documents that future perspective might be\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLerner & Ogren, A Guide to Scientific Writing\np. 6\nrecommendations. In other documents that future perspective might be a nod to the direction in\nwhich your research will head. A third kind of future perspective is to mirror the scope and\nlimitations that you presented in the beginning of the document.\"\nWhat are the Pitfalls of a Discussion/Conclusion Section?\n-\nIncluding too much information (wordy arguments, not focused, meandering, etc.).\n-\nFailure to follow arguments set up in the introduction.\n-\nFailure to focus on the current results.\n-\nSpeculating too much or not enough.\n-\nImproper tense (Discussion largely in present tense).\n-\nHedging excessively.\nExcessive Hedging\n\"The cause of the degenerative changes is unknown but possibly one cause may be infection by a\npresumed parasite.\"\nRule of thumb: One hedge word per sentence!\nTitles/Abstracts\nWhat is the purpose of an abstract?\n-\nA stand alone, mini-version of the paper (250 words or less).\n-\nSummarizes the main sections of the paper.\n-\nStates the purpose, findings, and impact of the work.\nAbstracts: The Goal is an Economy of Words\n-\nProvide an abstracted version of your paper in as few words as possible.\n-\nChoose each word carefully. Make them clear and significant.\n-\nProvide only the key points.\nLanguage: Needless Words in parentheses\n(already) existing\nMix (together\nAt (the) present (time)\nNever (before)\n(basic) fundamentals\nNone (at all)\n(completely) eliminate\nNow (at this time)\n(continue to) remain\nPeriod (of time)\n(currently) being\n(private) industry\n(currently) underway\n(separate) entities\n(empty) space\nStart (out)\nHad done (previously)\nWrite (out)\nIntroduced (a new)\n(still) persists\nWhat are Some Pitfalls of Abstracts?\n-\nContains extraneous detail or information or conclusions not stated in the paper.\n-\nContains abbreviations, chemical formulas, jargon or references to the literature, tables, or\nfigures.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLerner & Ogren, A Guide to Scientific Writing\np. 7\n-\nFailure to state the purpose of the work at the outset.\n-\nFailure to state the importance of the work and where it leads at the end.\nWhat is the Purpose of a Title?\n-\nIndicate the subject of your research.\n-\nDistinguish your research from others of its kind.\n-\nShow continuity with preceding papers.\n-\nProvide key words for indexing.\nThe Importance of Titles\n\"The title is the single most important phrase of a scientific document. The title tells readers\nwhat the document is. If your title is inexact or unclear, many people for whom you wrote the\ndocument will never read it.\"\nWhat are Some Pitfalls of Titles?\n-\nToo general or too specific.\n-\nToo long or too short.\n-\nIncomprehensible (sometimes from the use of jargon).\n-\nInaccurate (often a syntax problem).\n-\nContains abbreviations, chemical formulas, jargon.\nSome Bad Titles (from Science of Scientific Writing, 2nd ed.)\n-\nPlantar's Wart Removal: Report of a Case of Recurrence of Verruca after Curative Excision\n-\nCharacteristics of Columbine Flowers are Correlated with Their Pollinators\n-\nPanda Mating Fails: Veterinarian Takes Over\n-\nGleanings on the Bionomics and Behavior of the East Asiatic Nonsocial Wasps. III. The\nSubfamily Crabroninae with a Key to the Species of the tribe Crabronini Occurring in\nFormosa and the Ryukyus, Contributions to the Knowledge of the Behavior of Crabronine\nFauna, and Changes in the Taxonomic Position of Three Species of Crabronini Occurring in\nJapan\n-\nReport of New Health Data Results from the 1999 National ASAP-FYI-ERGO Health Study:\nLung Cancer in Women Mushrooms\nSome Good Titles\n-\nEffect of Husband's Education on the Fatness of Wives\n-\nRetrotransposons as Engines of Human Bodily Transformation\n-\nEnhanced Recovery of Bitumen by Steam with Chemical Additives\n-\nAdaptive Nulling in the Hyperthermia Treatment of Cancer\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nCourtesy of Marilee Ogren-Balkama. Used with permission."
    },
    {
      "category": "Resource",
      "title": "mod2_knan_tntri.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/dcdc65a507be6c0af5ac64f928842526_mod2_knan_tntri.pdf",
      "content": "Experimental siRNA Targeting the 469-624bp Region of Renilla Luciferase is\nIneffective in Reducing Expression in Mouse Embryonic Stem Cells\nJessica Keenan and Augusto Tentori\nAbstract\ndsRNA is an increasingly well studied and widely used tool for the regulation of\ngene expression at the post-transcriptional level. In this experiment, we designed an\nsiRNA intended to specifically target the Renilla reniformis luciferase gene in order to\nreduce the amount of luciferase produced by the gene. However, Luciferase assays of the\nlysates from mouse embryonic stem cells transfected with this siRNA and a plasmid\ncontaining the Renilla luciferase gene suggest that the designed siRNA is not able to\nreduce Renilla luciferase expression. Moreover, microarray analysis suggests that the\nsiRNA has widespread off-target effects. Over 8,000 genes were differentially expressed\nbetween cells transfected with the luciferase-containing plasmid only, and those\ntransfected with the experimental siRNA and the plasmid. There is no clear pattern\nbetween the genes that showed the greatest differential expression between the two\nsamples. Thus, we have determined the experimental siRNA is not able to specifically\nreduce Renilla luciferase expression, and instead has many off-target effects. To make\nRNAi a more useful tool than traditional techniques like homologous recombination,\nfurther research must be done to improve siRNA design algorithms.\nIntroduction\nIn order to perform their specified functions, cells must constantly regulate the\namount and types of proteins they produce. When a cell is no longer able to properly\nregulate protein production, cell death or defects in the tissue or organism often result.\nFor example, cancer is often caused by decreased production of proteins that inhibit cell\ngrowth, or by over production of proteins that cause the cell to continuously divide.\nHealthy cells, however, are able to regulate their protein expression at many levels,\nincluding transcription, translation, and after transcription and translation.\nOne way in which cells regulate protein expression at the post-transcriptional\nlevel is by preventing the translation of the mRNA transcript in a process called RNA\ninterference (RNAi). RNAi, which occurs in organisms as diverse as C. elegans (Fire\n1998), planarians (Sanchez-Alvarado 1999), and humans (Elbashir 2001), uses a double-\nstranded piece of RNA (dsRNA) to prevent the translation of a target mRNA transcript.\nOne strand of the dsRNA is complementary to a region of the target mRNA. This strand\nis incorporated into the RNA-induced silencing complex (RISC) by a process that is not\nwell understood, but is believed to involve the Argonaute family of proteins (Song 2003).\nThe RISC then binds to the complementary sequence on the mRNA target and cuts the\nmRNA transcript. The cleaved mRNA is degraded completely, and thus will not be\ntranslated into protein.\nUnderstanding how the RNAi pathway works is beneficial not only because it\nexplains a natural means of protein expression regulation, but also because the induction\nof this pathway in the laboratory provides a means of artificially regulating protein\nexpression. siRNAs can be designed to target a specific mRNA transcript with the intent\nof reducing the amount of protein translated from the transcript. However, there are\nmany ambiguities associated with the design of effective and specific siRNAs. For\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 2\nexample, it is unclear if targeting a specific region in the mRNA transcript results in\nstronger RNAi. Thus, it is a common practice to design several different siRNAs to target\ndifferent regions of the mRNA transcript with the hope that at least one of them will be\neffective. Similarly, there is no single set of siRNA properties that guarantees the\nconstruct's success. Several different properties, including G/C content, melting\ntemperature, and free energy, have been found to influence specificity and efficacy of the\nsiRNA (Ambion Design URL), but there is no algorithm that can consistently produce an\nsiRNA that is highly specific and effective for a given target. As a result, siRNA design is\noften hit-or-miss.\nThe addition of siRNA into a cell may also have more wide-reaching effects than\nregulating the translation of the target mRNA. siRNA can alter the translation levels of\noff-target mRNAs, often because of similarities in sequences between the mRNA\ntranscripts. Moreover, the presence of dsRNA in a cell may be interpreted as a viral\ninfection, and as a result, the anti-viral interferon pathway may be triggered upon\ntreatment with siRNA. Thus, siRNA treatment can result in the altered regulation of\nmany genes besides the intended target.\nIn order to validate and explore the effects of RNAi on the regulation of protein\nexpression, DNA microarrays are particularly useful because they can assess the relative\nexpression levels of tens of thousands of genes at one time. In this technique, a slide or\nother surface is coated with DNA from the genes of interest. RNA is then isolated from\nthe sample cells, reverse transcribed, and labeled. The resulting cDNA is hybridized to\nthe array, allowing labeled sample DNA to bind to complementary sequences on the\narray. Relative gene expression can then be determined by looking at the relative amount\nof label on each spot.\nAssays based on the functions of the protein encoded by a target gene can also be\nuseful for measuring gene expression levels. One protein that has readily-measured\nexpression levels is Renilla reniformis luciferase. Renilla reniformis is a soft coral that\nhas the ability to bioluminesce by producing a luciferase protein. This enzyme oxidizes\nthe small molecule luciferin, which results in the emission of blue light (20.109\nTransfection URL). By measuring the light emitted by different samples expressing this\ngene, relative expression levels may be determined, as cell extracts that emit more light\nexpress more luciferase than those that emit lower levels of light.\nThe purpose of this experiment was to design an siRNA with the ability to reduce\nthe production of the Renilla luciferase protein in mouse embryonic stem cells that\nproduce Renilla luciferase. We used a plasmid containing Renilla luciferase to transfect\nmouse embryonic stem cells, enabling them to bioluminesce. Mouse cells were used\nbecause they do not naturally bioluminesce, so any bioluminescence must be due to the\ntransfected luciferase plasmid. Moreover, they do not contain mechanisms for regulating\nluciferase production, so any changes in bioluminescence must be due to our treatment of\nthe cells. The transfected cells were also treated with an siRNA that was designed to\nbind to the Renilla luciferase mRNA transcript, resulting in its cleavage and decreased\nproduction of the luciferase protein. Luciferase expression was first quantified by\nmeasuring the amount of light emitted by the extracts of transfected cells. The cells were\nalso visually monitored to assess if the siRNA had any off-target effects that inhibited\ngrowth. To further assess off-target effects, we ran a microarray with cDNA reverse\ntranscribed from mRNA isolated from the samples. By designing and testing this siRNA\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 3\nwe were able to determine how effective it was, which indicates the effectiveness of the\ntechniques we used to design it.\nMaterials and Methods\nAll protocols are taken from the 20.109 Fall 2007 class wiki:\nhttp://openwetware.org/wiki/20.109(F07)\nDNA and RNA\nThe psiCHECK2 plasmid (GenBank accession number AY535007), which contains the\nRenilla luciferase and Firefly luciferase genes was used to enable the mouse embryonic\nstem cells to express the luciferase genes. Its sequence was obtained from Promega.com\nto allow us to identify a target sequence to which a dsRNA could specifically bind.\nAmbion's siRNA Target Finder (Ambion Target Finder URL) was then used to find\ntargets in the 469-624bp range of the Renilla Luciferase gene, using the options \"ends\nwith TT,\" \"all G/C contents,\" and \"avoid four or more C/Gs in a row.\" This program\nalso provided the G/C content for each target sequence, and candidates with a G/C\ncontent higher than 50% or lower than 30% were not taken into further consideration.\nIntegrated DNA Technology's Oligo Analyzer (IDT URL) was then used to obtain the\nmelting temperature of each of the remaining candidate sequences, and OligoCalc\n(OligoCalc URL) was used to determine the candidate's free energy. Low Tm and free\nenergy values are favorable, because they suggest the sequence will not have significant\nsecondary structure that could interfere with binding. Finally, each candidate was\nBLASTed against the mus musculus genome to find other sequences that the siRNA\nmight target. Only one candidate had a relatively low melting temperature (compared to\nthe other candidates), a relatively low free energy, and only a few matching sequences in\nthe mouse genome. Thus, this candidate was chosen for use in the siRNA experiment.\nMouse Embryonic Cell Culture and Transfection\nThe mouse embryonic stem cells were maintained in JI growth media, consisting of\nDMEM (high glucose), 10% Fetal Bovine Serum, 100U/ml Pen/Strep, 0.3mg/ml\nglutamine, and 50ul/L LIF. The cells were maintained in a humidified incubator at 37oC\nwith five percent CO2. Samples of cells were transfected with the psiCHECK2 plasmid\nonly, a validated siRNA sequence only, both the plasmid and the validated siRNA, both\nthe plasmid and a scrambled version of the siRNA with no homology to the mouse\ngenome, and both the plasmid and the experimental siRNA, in order to allow them to\nexpress the luciferase genes, and to allow the siRNA to regulate the expression of those\ngenes. The pisCHECK2 plasmid was transfected at a concentration of 10ug\nplasmid/100ul transfection, and the siRNA at a concentration of 5pmol RNA/100ul\ntransfection. The carrier for the lipofection was prepared by diluting Lipofectamine 2000\n3:50 in OptiMEM. It was then allowed to sit, undisturbed, at room temperature for about\n15min. The DNA and RNA were prepared for transfection by diluting the plasmid\n1:2500 in OptiMEM and/or diluting the siRNA 1:5x106 in OptiMEM. Equal volumes of\nthe carrier and DNA/RNA mixtures were combined and allowed to incubate for 20 min at\nroom temperature. The cells were washed with PBS before the growth media was\nreplaced with pre-transformation media, composed of the growth media without\nantibiotics. Enough of the appropriate DNA/RNA/lipofectamine mixtures were added to\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 4\neach well of cells to make the media a 9.5% lipofection mixture. The media was changed\nto growth media after 24 hours and lysates were prepared from the cells after 48 hours to\nanalyze luciferase activity.\nLuciferase Assays\nIn order to measure the levels of luciferase expression in the samples, the light emitted\nfrom cell lysates was measured. Each well of cells growing in a six-well plate was\nwashed two times with 2ml PBS. To induce lysis, 500ul of Promega's PLB reagent was\nadded and the cells were then placed on an orbital rocker at 150rpm for 15min at room\ntemperature. Then, 10ul of the cell lysate was added to 50ul of LARII from Promega's\ndual-luciferase assay kit, which contains beetle luciferin. After pipet mixing, the Firefly\nluciferase activity was immediately measured with the Turner Luminometer 20/20 for 10\nseconds. Then, 50ul of \"Stop and Glo\" from Promega's dual-luciferase assay kit was\nadded to mixture, and the Renilla luciferase activity was measured immediately after\npipet mixing.\nMouse Whole Genome Microarray\nTotal RNA Isolation\nRNA was isolated from the cells using Qiagen's RN-easy kit according to the\nmanufacturer's instructions. This process was done to provide a template for the reverse\ntranscription reaction that would produce the cDNA needed to hybridize to the\nmicroarray. The concentrations of the RNA samples were then determined by taking\nspectrophotometer readings at 260nm.\nReverse Transcription\nThe RNA from the cell lysates was reverse transcribed to allow it to hybridize to the\nmicroarray. The largest amount of RNA that could be taken from the most dilute sample\nwithout exceeding 10ul was 2.56ug, so this amount was reverse transcribed from each\nsample. The volume of the remaining sample was brought to 10ul with RNase-free\nwater. Then, 1ul of primer/Capture Sequence I (red) was added to the sample that had\nbeen transfected with only plasmid, and 1ul of primer/Capture Sequence II (blue) was\nadded to the sample that had been transfected with plasmid and the experimental siRNA.\nThe primers were annealed to the RNA by heating these mixtures at 80oC for 10 minutes,\nand then placing them on ice for two minutes. Then, 1ul of Genisphere's Superase\nRNase inhibitor was added to the reactions and 8ul of Gensiphere's cDNA synthesis\ncocktail, containing Superscript First Strand Buffer, DTT, dNTPs, and the Superscript II\nenzyme was added to each sample. After gentle pipet mixing, the cDNA synthesis\nreaction was incubated at 42oC for 90 minutes. Finally, 3.5ul of .5M NaOH/.5M EDTA\nwas then added to each tube to stop the reaction. The tubes were heated at 65oC for 10\nminutes to degrade the RNA template and 5ul of 1M Tris at pH seven was added to each\ntube.\nMicroarray Hybridization\nAgilent's Mouse Whole Genome Microarray was used to screen gene expression of the\ntwo samples. To hybridize the samples to the array, the cDNA samples were pooled and\nan equal volume of Agilent's 2x Hybridization Buffer was added to them. These\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 5\nhybridization solutions were then heated to 80oC for 10 minutes. The microarray cover\nwas placed in the hybridization chamber, and after the solutions cooled to room\ntemperature, 110ul of the solution was pipetted onto the cover. The microarray was then\nplaced face down on top of the samples, and the hybridization chamber was closed. The\narray was left at 60oC in a hybridization oven overnight. The next day, the unbound\ncDNA was washed off of the array with 0.005% Triton X-100 and 6xSSC, containing\n2.4M NaCl and .24M NaCitrate, at 42° for 10 minutes. The array was washed again with\n0.2X SSC/0.00016% Triton X-100 at room temperature for five minutes. The slides were\nthen dried and rehybridized with Genisphere's Cy3 and Cy5 dendrimers for four hours at\n65oC. Unbound Cy3 and Cy5 were then washed off with 2X SSC/0.0016% Triton X-100\nat room temperature for five minutes and 0.2X SSC/0.00016% Triton X-100 at room\ntemperature for 10 minutes. The slide was then dried quickly with nitrogen gas and\nscanned with an Agilent scanner.\nResults\nTable 1. Validated, scrambled, and experimental siRNA sequences\nsiRNA\nSequence\nValidated siRNA\nGGCCUUUCACUACUCCUACdTdT\ndTdTCCGGAAAGUGAUGAGGAUGA\nScrambled siRNA\nUAAGGCUAUGAAGAGAUACdTdT\ndTdTAUUCCGAUACUUCUCUAUGA\nExperimental siRNA 1\nUUCCAAUGUUCUGUCCAAAUUdTdT\ndTdTAAGGUUACAAGACAGGUUUAA\nExperimental siRNA 2\nUAACUUCUUCGUCGAGACCdTdT\ndTdTAUUGAAGAAGCAGCUCUGG\nThe validated siRNA sequence is from Promega and has been demonstrated to reduce\nRenilla luciferase expression. The scrambled siRNA is from Dharmacon (siCONTROL\nNon-Targeting siRNA #2) and contains the same nucleotides as the validated siRNA\nsequence but has at least four mismatches to any mouse gene. The first experimental\nsiRNA was designed by our lab group, but was not available in the laboratory. Instead,\nthe second experimental siRNA sequence was used in the experiment.\nThe Renilla luciferase gene was divided into six sections, with a different group each\ndesigning an siRNA for one section in the hope that at least one of the siRNAs would be\neffective. Our group designed the siRNA construct labeled Experimental siRNA 1 (see\nTable 1), which was intended to specifically target the 469-624bp region of the mRNA\ntranscript of the Renilla Luciferase gene for degradation by the RNAi pathway. This\nparticular siRNA design was chosen because several of its properties suggested that it\nwas likely to specifically bind to the luciferase mRNA. This sequence has a low melting\ntemperature and free energy, suggesting that it is not likely to form secondary structure\nthat could interfere with binding. Moreover, of all candidate targets, this one had the\nfewest homologous sequences in the mouse genome, which suggested it would bind most\nspecifically to the target. Due to time restrictions, the staff designed and pre-ordered an\nexperimental siRNA (Experimental siRNA 2, shown in Table 1). This siRNA was\ndesigned using the same criteria as Experimental siRNA 1, though it had a different\ntarget. Because this sequence had been pre-ordered, it was used throughout the rest of\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 6\nthe experiment. A validated siRNA (shown in Table 1), which is known to decrease\nRenilla luciferase expression, was used so that efficacy of the experimental siRNA could\nbe compared against a functional siRNA. To ensure that differences in expression were\nnot simply due to the presence of any siRNA in the cell, an siRNA with a scrambled\nversion of the validated siRNA sequence that has no homology to the mouse genome was\nalso used.\nFigure 1. Experimental siRNA does not decrease light emission in cells transfected with\nRenilla luciferase\nNo Plasmid No RNA\nPlasmid Only\nValidated siRNA Only\nPlasmid + Validated siRNA\nPlasmid + Scrambled siRNA\nPlasmid + New siRNA Design\nAverage Light Emitted (ALU/ul)\nFirefly Luciferase\nRenilla Luciferase\nMouse embryonic stem cells were transfected with the Renilla and firefly luciferase-\ncontaining psiCHECK2 plasmid only, the validated siRNA only, the plasmid and the\nvalidated siRNA, the plasmid and the scrambled siRNA, and the plasmid with the\nexperimental siRNA. Two days after transfection, light emission from the cell lysates\nwas measured. This experiment was performed with two replicates of each cell type, and\nthe average light emitted by the two replicates is shown here. Error bars indicate 1\nstandard deviation above and below the mean value.\nIn order to determine the effect of the experimental siRNA on Renilla luciferase\nexpression, we transfected cells with the Renilla and firefly luciferase-containing\npsiCHECK2 plasmid only, the validated siRNA only, the plasmid and the validated\nsiRNA, the plasmid and the scrambled siRNA with no homology to the mouse genome,\nand the plasmid with the experimental siRNA. We then measured the light emitted by\nfirefly and Renilla luciferases in the lysates from the transfected cells. Because the light\nemitted by firefly luciferase is approximately constant between all samples that contained\na plasmid, it is reasonable to make general comparisons between the samples. The two\ntypes of cells that did not contain the psiCHECK2 plasmid that encoded the light-\nemitting Renilla and firefly luciferase genes - one of these cell types also contains the\nvalidated siRNA and the other contains no additional siRNA - are negative controls, and\nas seen in Figure 1, showed practically no light emission. The positive control cells,\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 7\nwhich contained only the luciferase-encoding plasmid, had much higher light emission\nvalues. Likewise, the cells containing the plasmid and scrambled siRNA also had high\nemission values (see Figure 1). The experimental siRNA lysates emitted more light than\nthe lysates from the cells that did not contain a plasmid, and than the lysates from the\ncells that contained the validated siRNA only. However, the error bars of the light\nemitted by the lysates from the cells that were treated with the experimental siRNA and\nthe plasmid fall within the range of the error bars of the light emitted by the lysates from\ncells that were treated with the plasmid only, and within the error bars of the light emitted\nby the lysates from the cells that were treated with the plasmid and the scrambled siRNA,\nas seen in Figure 1.\nFigure 2. The transfection of siRNA or psiCHECK2 plasmid into mouse embryonic stem\ncells leads to minor growth inhibition.\nPlasmid Only\nNo Plasmid, No siRNA\nValidated siRNA Only\nPlasmid + Validated siRNA\nPlasmid + Scrambled siRNA\nPlasmid + Experimental siRNA\nCells transfected with either siRNA, plasmids, or both appear to exhibit less dense\ngrowth compared to cells that were not transfected with nucleic acids. These images\nwere taken 48 hours after transfection at 10x magnification.\nThe transfected cells were visually monitored to determine how siRNA transfection\naffected growth. All samples contained cells that were healthy and growing, though the\ncells that were transfected appeared to be slightly less dense than those that did not\ncontain plasmid or siRNA, as seen in Figure 2, suggesting that the transfections led to\ndecreased cell growth.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 8\nTable 2. The experimental siRNA alters the expression of off-target genes\nObservation\nPossible Explanation\n4,389 genes are differentially expressed 2x\nhigher in cells containing the psiCHECK2\nplasmid and the experimental siRNA\n4,382 genes are differentially expressed 2x\nhigher in cells containing the only the plasmid\nIt could be that experimental siRNA actually\nresults in differential expression of the genes\nbetween the two samples, or slight differences\nin the cell's environment could produce these\neffects\n35,229 genes show non-differential expression\npattern\nmRNA expression levels are largely the same\nin the samples transfected with only the\npsiCHECK2 plasmid, and those transfected\nwith the plasmid and the experimental\nsiRNA\n0 genes with which the experimental siRNA\nhas homology show differential expression\npatterns\nThe siRNA does not specifically bind to off-\ntarget mRNA transcripts\n106/133 interferon genes show no differential\nexpression pattern\nIt is unlikely that the interference pathway is\nresponsible for the differential expression\npatterns\nmRNA isolated from mouse embryonic stem cells transfected with only the luciferase-\ncontaining psiCHECK2 plasmid, and mRNA isolated from cells transfected with the\nplasmid and the experimental luciferase-targeting siRNA were compared on a\nmicroarray. Of the ~44,000 genes on the array, about 8,600 were differentially\nexpressed between the two samples. No genes with which the experimental siRNA has\nhomology were differentially expressed, and 106 of 133 interferon genes showed no\ndifferential expression between the two samples.\nIn order to look for off-target effects caused by the siRNA, we ran a microarray using\ncDNA reverse transcribed from mRNA from cell lysates that had been transfected with\nonly the plasmid, and from cell lysates that had been treated with the plasmid and the\nexperimental siRNA. This microarray shows that about 8,600 genes were differentially\nexpressed between these two samples, as shown in Table 2. It is possible that these\neffects were due to mRNA degradation in the RNAi pathway, or that slight differences in\nthe cells' environment led to these differential expression patterns. The siRNA was\nBLASTed against the mouse genome, and none of the genes to which it has the greatest\nhomology showed differential expression between these two samples. Thus, any effects\ndue to the siRNA were probably not due to specific binding. It is also possible that the\naddition of the siRNA activated the anti-viral interferon pathway, which would result in\ndifferential expression between the two samples. However, of the 133 interferon genes\npresent in the microarray, 106 showed no differential expression (see table 2). The\nremaining 27 interferon genes that showed differential expression do not appear to be\ndirectly related. Thus, it appears that the experimental siRNA did result in some off-\ntarget gene regulation.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 9\nTable 3. mRNA that show the greatest differential expression between samples\ntransfected with plasmid only and samples transfected with plasmid and experimental\nsiRNA are unrelated\nGene Name\nSystematic\nName\nDescription\nLog2(adjusted\nplasmid only signal\n/adjusted plasmid &\nsiRNA signal)\nAK081157\nAK081157\nUnknown\n-24.65\nFzd2\nAK048420\nFrizzled precursor\n-24.50\nPtdsr\nAK122317\nmKIAA0585 protein\n-24.34\nEgfr\nNM_207655\nEpidermal growth factor receptor\n-24.30\nPick1\nAK090155\nProtein that interacts with C kinase 1\n-24.20\nD030020J04Rik\nAK142335\nUnknown\n-23.92\nL1Md-Tf30\nAK035064\nUnknown\n-23.82\n2610028E06Rik\nAK083757\nUnknown\n-23.64\nCasp3\nNM_009810\nCaspase 3\n-23.48\nTC1658472\nTC1658472\nLysin precursor\n-23.39\nAtp2a2\nNM_009722\nATPase, Ca++ transporting\n20.38\nTC1657759\nTC1657759\nAp3b1 protein\n20.46\nEn2\nNM_010134\nEngrailed 2\n20.48\nMrpl27\nAK080324\nUnknown\n20.51\nTmed7\nXM_128959\nEmp24 protein transport domain\n20.52\nCcdc117\nNM_134033\nCoiled-coil domain\n20.92\nAK035842\nAK035842\nSimilar to histidine kinase dhkm\n21.03\nSlc5a2\nNM_133254\nSodium/glucose cotransporter\n21.04\nStambpl1\nNM_029682\nStam binding protein\n21.38\n4932432K03Rik\nNM_144535\nUnknown\n21.38\nThe 10 mRNA transcripts that showed the greatest difference in expression in the cells\ntransfected with the plasmid only compared to the cells transfected with the plasmid and\nthe experimental siRNA, and the 10 mRNA transcripts that showed the greatest\ndifference in expression in the cells transfected with the plasmid and the experimental\nsiRNA compared to those transfected with the experimental siRNA only are shown here.\nThere does not appear to be any relationship between the proteins these mRNA\ntranscripts produce.\nIn order to analyze the data collected from the microarray, we first accounted for\nbackground by subtracting the average of all median background signals over all genes\nfrom the signal measured from each gene. We chose to use the median background\nsignal in order to avoid strong outlier signals that would skew the mean. For each gene,\nwe then divided the signal values from the plasmid only sample by the signal values for\nthe sample that had been treated with the plasmid and the experimental siRNA in order to\nobtain the fold change between their expression levels. To view these data more easily,\nwe took the log2 of the fold change for each gene (see table 3). Thus, genes that are\nexpressed more than two-fold higher in the samples that were treated with the plasmid\nonly compared to the samples treated with the plasmid and the siRNA will have positive\nlog2 values, and genes that are expressed more than two times higher in the samples that\nwere treated with the plasmid and the siRNA compared to the samples treated only with\nthe plasmid will have negative log2 values. As can be seen in Table 3, there is no obvious\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 10\nconnection between the 20 genes that showed the greatest differential expression between\nthe two samples; it does not appear that the experimental siRNA affected any specific\noff-target pathway. Moreover, none of these 20 genes are known to be involved in the\ninterferon pathway, further suggesting that this pathway was not activated.\nDiscussion\nsiRNA is often used to alter gene expression at the post-translational level. In this\nexperiment, we designed an siRNA to specifically target the Renilla luciferase gene.\nHowever, the variation of the light emitted by the lysate from cells transfected with both\nthe experimental siRNA and the psiCHECK2 plasmid, which contains Renilla and firefly\nluciferase genes, was within the error bar of the light emitted by the lysates from cells\ntransfected with the plasmid only and by the lysates from the cells transfected with the\nplasmid and the scrambled siRNA, suggesting the experimental siRNA is not able to\nreduce Renilla luciferase expression. Because of the difficulty of predicting the efficacy\nof siRNA designs this result seems reasonable; although we took many aspects of siRNA\ndesign into consideration, siRNA design is still not well understood, and thus there is a\ncertain amount of randomness in the process.\nEkaterina Pak and Matthew Loper performed the same experiment and reported\ndata showing the same luciferase expression trends (20.109 Luciferase URL); the error\nbars of the light emitted by the lysates of cells transfected with the experimental siRNA\nand the plasmid are within the error bars for the light emitted by the lysates from the cells\ntransfected with the plasmid only and the cells transfected with the plasmid only and the\nscrambled siRNA. Though the two data sets follow the same trend, the Pak and Loper\ndata show much lower emission from Renilla luciferase in all samples compared to our\ndata, though the firefly values are similar in both data sets. This discrepancy could be\ndue to a difference with the luciferin added to the samples to measure Renilla luciferase\nlight emission. If the luciferin Pak and Loper used was more dilute or partially degraded,\nRenilla luciferase levels would be consistently decreased, as we see here.\nThe experimental siRNA's ineffectiveness in reducing Renilla luciferase levels\ncould also be due to off-target effects that resulted in decreased regulation of the target\nmRNA. If the siRNA was used to induce RNAi of other transcripts, there would not be\nas much available to target the Renilla luciferase transcript. The microarray showed that\nabout 8,600 mRNA transcripts were differentially expressed between the cells that were\ntransfected with the plasmid only and those that were transfected with the plasmid and\nthe experimental siRNA. However, the cells transfected with only the plasmid and those\ntransfected with both the plasmid and the experimental siRNA showed the same level of\nexpression for all mRNA transcripts to which the siRNA has the greatest homology.\nThus, it is unlikely that the differential mRNA expression is due to specific siRNA\nbinding. Additionally, we looked at the expression patterns of interferon genes, which\nthe cell uses to defend against viral invasion, since the siRNA could be perceived as viral\ngenetic material by the cell. While a few interferon genes are differentially expressed\nbetween the two samples, it is unclear that this pathway is activated. Thus, it seems\nlikely that the siRNA affects the regulation of off-target genes.\nHowever, it appears that the experimental siRNA's off-target effects did not\nsignificantly affect the growth of the cells into which it was transfected. After\ntransfection, the cells were visually examined with a light microscope. Cells that had\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 11\nbeen transfected with nucleic acids showed decreased growth compared to the cells that\nhad been treated using the lipofection protocol, but to which no nucleic acids had been\nadded. This decrease in growth was not more noticeable in cells transfected with the\nexperimental siRNA than in any of the other transfected cells. Thus, it seems that the\nexperimental siRNA itself had no effect on cell growth.\nWhile this experiment has provided a wealth of information about the efficacy\nand effects of our experimental siRNA, there were also several limitations to this\nexperiment that suggest future experiments to further elucidate the effects of the\nexperimental siRNA. Foremost, the microarray we used contained the entire mouse\ngenome, and thus was useful for looking at off-target effects, but it did not contain the\nluciferase gene that had been transfected into the mouse cells. As a result, it yielded no\nfurther information about the efficacy of the experimental siRNA. In the future, it would\nbe valuable to include the Renilla and firefly luciferase genes in the microarray in order\nto obtain a second set of quantitative data describing the effect of the siRNA on its\nintended target. Moreover, it would be interesting to transfect cells with the plasmid and\nboth the experimental and validated siRNAs to see if a combination of both siRNAs leads\nto greater Renilla luciferase depletion than either of the siRNAs by themselves.\nThis experiment illustrates the difficulty of using RNAi to regulate protein\nexpression in the laboratory. Though we carefully considered the properties that are\nthought to be most important in designing an siRNA when we created the experimental\nsiRNA, this siRNA cannot be considered effective and also has many off-target effects.\nThis demonstrates that even our best understanding of siRNA design is not enough to\nconsistently produce effective and specific siRNA. Unless significant strides are made in\nsiRNA design, it may be more useful to implement traditional gene knockdown methods,\nlike homologous recombination. Thus, while RNAi is a very useful technique in theory,\nmore research must be done to increase its usefulness in practice.\nReferences\n20.109 F'07 Lab Wiki: Luciferase Assay\nhttp://openwetware.org/wiki/Talk:20.109%28F07%29:_Luciferase_assays_and_RNA_pr\nep Accessed October 31, 2007\n20.109 F'07 Lab Wiki: Transfection\nhttp://openwetware.org/wiki/20.109%28F07%29:_Transfection Accessed October 13,\nAmbion's siRNA Design Criteria http://www.ambion.com/techlib/tb/tb_506.html\nAccessed October 11, 2007\nAmbion's siRNA Target Finder http://www.ambion.com/techlib/misc/siRNA_finder.html\nAccessed October 11, 2007\nElbashir SM, Harborth J, Lendeckel W, Yalcin A, Weber K, Tuschl T. Duplexes of 21\nnucleotide RNAs mediate RNA interference in cultured mammalian cells. Nature\n2001:411; 494-488\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY].\n\nKeenan 12\nFire A, Xu SQ, Montgomery MK, Kostas SA, Driver SE, Mello CC. Potent and specific\ngenetic interference by double-stranded RNA in Caenorhabditis elegans. Nature 1998;\n391:806-811\nIntegrated DNA Technology's Oligo Analyzer\nhttp://www.idtdna.com/analyzer/Applications/OligoAnalyzer/Default.aspx Accessed\nOctober 11, 2007\nOligoCalc http://www.basic.northwestern.edu/biotools/oligocalc.html Accessed October\n11, 2007\nSanchez-Alvarado A, Newmark PA. Double-stranded RNA specifically disrupts gene\nexpression during planarian regeneration. Proceedings of the National Academy of\nSciences of the USA 1999; 96:5049-5054\nSong JJ, Liu J, Tolia NH, Schneiderman J, Smith SK, Martienssen RA, Hannon GJ,\nJoshua-Tor L. The crystal structure of the Argonaute 2 PAZ domain reveals an RNA\nbinding motif in RNAi effector. Nature 2003:10; 1026-1032\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts\nInstitute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec3_2_atissa.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/bdc33fd6d77885c0255e20b43322af56_lec3_2_atissa.pdf",
      "content": "Creating your Research Proposal\nPresentation\nAtissa Banuazizi\nLecturer, Writing Across the Curriculum\n13 November 2007\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nOverview\n- Goals and components of the Module 3\nPresentation\n- Dividing up the presentation\n- Delivering the presentation with your partner\n- Questions to ask yourselves: organization, slide\ndesign, delivery\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGoals for your presentation\nHow can you make your proposal compelling?\n- Convince audience that project is worth doing\n- Convince audience that you can do it\n- Assume that your audience comprises:\n- experts in your topic\n- intelligent non-experts with exposure to your\nfield\nUseful tips on creating funding proposals at\nhttp://www.wwu.edu/depts/rsp/insideview.pdf\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nComponents of the presentation\n- brief project overview\n- sufficient background information for everyone to\nunderstand your proposal\n- statement of the research problem and goals\n- project details and methods\n- predicted outcomes if everything goes according to\nplan and if nothing does\n- needed resources to complete the work\n- societal impact if all goes well\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nDividing up the presentation:\ngeneral principles\n- Each partner should speak roughly the same\namount of time\n- Audiences will assume change in speakers\ncorresponds to change in topic -- don't confuse them\n- Changing speakers can distract audience/slow the\ntalk down -- keep shifts to a minimum\n- How you choose to divide the talk depends on the\nshape of your presentation -- many different options!\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nDividing up the presentation:\nOption 1 (Down the Middle)\nSpeaker 1:\n- brief project overview\n- sufficient background\ninformation for everyone\nto understand your\nproposal\n- statement of the research\nproblem and goals\ndivision assumes that Part I\nis roughly as long as Part II\nSpeaker 2:\n- project details and\nmethods\n- predicted outcomes if\neverything goes according\nto plan and if nothing\ndoes\n- needed resources to\ncomplete the work\n- societal impact if all goes\nwell\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nDividing up the presentation:\nOption 2 (The Sandwich)\nSpeaker 1:\n- brief project overview\n- sufficient background\ninformation for everyone to\nunderstand your proposal\ncontext=bread\nSpeaker 2:\n- statement of the research\nproblem and goals\n- project details and\nmethod\n- predicted outcomes if\neverything goes\n-needed resources to complete\naccording to plan and if\nthe work\nnothing does\n-societal impact if all goes well\nexperiment nuts & bolts =\nfilling\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nDividing up the presentation:\nOption 3 (Back and Forth)\nSpeaker 1:\n- brief project overview\neach partner speaks long\nenough to establish flow\n- project details and\nmethods\n- predicted outcomes if\neverything goes according\nto plan and if nothing\nSpeaker 2:\n- sufficient background\ninformation for everyone to\nunderstand your proposal\n- statement of the research\nproblem and goals\n- needed resources to\ncomplete the work\n- societal impact if all goes\nwell\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMore options (for specific kinds\nof projects)\n- Two discrete research questions OR\n- Two discrete methods\n- each partner follows one strand\n- introductory and concluding material each\npresented by a single partner\n- Other possibilities, depending on the particulars of\nyour material\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHelp focus the audience's\nattention on the right speaker\n- During overview, identify who will speak on what\ntopic\n- Review/Preview as you proceed through the talk\n- Articulate transitions explictly -- \"hand off\"\n- Only one partner \"onstage\" at a time\n- If you're not speaking, don't hover nearby\n- Do not interrupt each other\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nRehearse as a team\n- Note timing of each section and of talk as a whole\n- Practice moving into speaking position at transition\npoints\n- Will you advance each other's\nslides?\n- Aim for similar speaking styles\nPhoto removed due to copyright restrictions.\n- don't imitate each other, but\nmatch your formality levels\n- Familiarize yourself with partner's\nmaterial\n- Practice Q&A\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nQuestions to ask yourselves\nabout organization\n- Does our talk fit together as a coherent whole?\n- Are all sections of the talk adequately developed?\n- Do we have a focused, well-defined hypothesis?\n- Is it clear what is going to be done and how?\n- Have we realistically articulated the scope of the\nwork?\n- Have we omitted extraneous material?\n- Will our project fire up an audience's interest?\n- What might make this proposal more convincing to a\nfunding body?\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nQuestions to ask yourselves\nabout slide design\n- Is everything on the slide readable?\n- Are our slides a good balance of text and figures?\n- Have we chosen clear, specific titles that express\nthe main point of each slide?\n- Is the design/format of our slides consistent, or were\nthey obviously designed by different people?\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nQuestions to ask yourselves\nabout delivery\n- Can we get through our whole presentation in 10\nminutes?\n- Do we know where to position ourselves, and how to\ncoordinate our shifts smoothly?\n- Do our speaking styles work well together?\n- Are we making the transitions between topics and\nspeakers clear to the audience?\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nQuestions to ask us?\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "mod3_blue.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/3b85b7469ebf73ddf8d0a17fcb1d9d95_mod3_blue.pdf",
      "content": "KAT PAK AND MATTHEW LOPER\n20.109 FINAL PRESENTATION\nDECEMBER 7, 2007\nExpression of dsRNA in Spirogyna\nalgae to inhibit development of\nMalaria carrying mosquitoes\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMalaria\ny Caused by Plasmodium protozoan parasites\n{ Once a host is infected, the parasite remains indefinitely\ny Infects 515 mil people a year and kills between 1 and\n3 million including South America, Africa, India,\nAsia, and the Middle East\nMap\n\nfrom Wikiped\ni\na, using 2003 data from U.S. CDC.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMalaria\ny Associated with poverty and possible huge hindrance\nto economies\ny Estimated $12B malaria economic costs in\nAfrica per year\n1. Sachs J, Malaney P (2002). \"The economic and social burden of malaria\". Nature 415:\n680-5.\nImage courtesy of \"dosh dosh.\"\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nAnopheles mosquitoes: A deadly vector\ny Female Anopheles mosquitoes primary Plasmodium carrier\ny Larvae hatch and feed\non Spirogyna algae2\ny Grow and develop to\ninto pupa and become\nadults\n2. Rejmankova, E. H. et al. 1993 Environmental and regional determinants of Anopheles\n(Diptera: Culicidae) larval distribution in Belize, Central America. Environ. Entomol. 22,\n978-992.\nCourtesy of US CDC.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMalaria: Current Treatments\ny No effective, approved vaccine\n{ Huge amount of research being done to discover effective vaccines\n{ Current drugs not affordable or practical for chronic use in malaria\nregions\n{ Recently, a group at Cal used Synthetic Biology to developed yeast to\nproduce artemisinin2 much cheaper than current synthesis methods\n2. Keasling, Jay D et al. Production of the antimalarial drug precursor\nartemisinic acid in engineered yeast. Nature [Nature]. Vol. 440, no. 7086,\npp. 940-943. 14 Apr 2006.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMalaria: Prevention and Vector Control\ny Widespread use of insecticides\ny Domestic spraying of fungus Beauveria bassiana3\ny Drainage and filling of ponds/rivers\n{ Huge economic and environmental costs4\ny Clearing of algae from ponds5\ny Biological (predator and microbe)\nlarvicidal controls\n3. Simon Blanford, et al. Fungal Pathogen Reduces Potential for Malaria Transmission. (10 June 2005)\nScience 308 (5728), 1638.\n4. Collins, F. H. & Paskewitz, S. M. 1995. Malaria: current and future prospects for control. A. Rev.\nEntomol. 40, 195-219.\n5. WALKER, K. (2007) Contributions of Anopheles larval control to malaria suppression in tropical\nAfrica: review of achievements and potential. Medical and Veterinary Entomology 21(1)\nPhoto removed due to\ncopyright restrictions.\nPeople working in a river.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nResearch Problem & Goals\nGoal:\nReduce the Anopheles mosquito population by\ntargeting key larvae genes with dsRNA expressed\nin transgenic algae\nBenefits:\ny Minimize harm to ecosystem\ny Directly-targeted approach\ny Reduce maintenance\nPhoto removed due to\ncopyright restrictions.\nPerson spraying for\nmosquitos.\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nResearch Outline\n1)\nDetermine larvae key developmental genes\n2)\nCreate transgenic algae expressing dsRNA\n3)\nTest if larvae fed on transgenic algae have\nincreased mortality\n1. artificial diet assays\n2. transgenic algae\n3. growth assays\n\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n1) Construct cDNA library\nof A. pseudopunctipennis\nlarvae\nLarva\nDNA\n2) Prepare\ndsRNAs\ndsRNA\n3) Apply varied\ndoses of dsRNA\nto larvae diet\n4) Confirm triggering of\nRNAi response\nDetermine Key Developmental Genes of Larvae\nNorthern\nBlot\nArtificial diet assay\n\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nTest Mortality of Larvae Fed on Transgenic Algae\nStrong\nPromoter\ndsRNA\nselectable marker\nAlgae\n1. Assemble transformation\nexpression cassette\n2. Ensure no off-target\neffect on algae\n3. Perform growth\nchamber assays\nmicroarray\ngrowth chamber\n\nOutcomes\nIf all goes to plan:\ny Test compatibility of transgenic algae with\nenvironment\ny Introduce transgenic algae to natural habitat\ny Test prevalence of transgenic algae over time after\nintroduction\ny Determine if technique can be applied to different\nfood sources, mosquito species, and locations\nIf nothing goes to plan:\ny Test other dsRNA sequences\ny Target a food source of the mosquito\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nNeeded Resources\ny 400 A. pseudopunctipennis mosquitoes of the G3\nstrain\ny Collected algae\ny CD1 mice\ny Growth Chambers\ny dsRNA - order\ny Plasmid constructs for Transformation\ny Microarrays with larvae DNA\ny General Lab materials & Machines (e.g. for\nmicroarrays, RT-PCR)\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nStudy Implications\nIf successful:\ny Create a form of Malaria vector control that is less\nenvironmentally harmful than current practices\ny A cheaper alternative to current practices\ny When combined with vaccine/cheaper drug\ndevelopment, significantly improve the quality\nof life in an impoverished area\ny Creates a profitable product\n\nQuestions?\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nReferences\nSachs J, Malaney P \"The economic and social burden of malaria\". Nature 415: 680-5.\nKeasling, Jay D et al. Production of the antimalarial drug precursor artemisinic acid in engineered yeast.\nNature Vol. 440, no. 7086, pp. 940-943. 14 Apr 2006.\nSimon Blanford, et al. Fungal Pathogen Reduces Potential for Malaria Transmission. Science 2005; 308\n(5728), 1638.\nCollins, F. H. & Paskewitz, S. M. Malaria: current and future prospects for control. A. Rev. Entomol. 1995;\n40, 195-219.\nWalker, K. Contributions of Anopheles larval control to malaria suppression in tropical Africa: review of\nachievements and potential. Medical and Veterinary Entomology 2007; 21(1)\nBrown, A., Crisanti, A., Catteruccia, F. Comparative analysis of DNA\nvectors at mediating RNAi in *Anopheles* mosquito cells and larvae. The\nJournal of Experimental Biology 2003; 206: 1817-1823\nHolt et al. The Genome Sequence of the Malaria Mosquito *Anopheles\ngambiae. *Science 2002; 298: 129- 149\nBaum, J., Bogaert, T., Clinton, W., Heck, G., Feldmann, P., Ilagan, O.,\nJohnson, S., Plaetinck, G., Munvikwa, T., Pleu, M., Vaughn, T.,\nRoberts, J. Control of coleopteran insect pests through RNA interference. Nature Biotechnology\n2007; 11: 1322-1326\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory Fundamentals in Biological\nEngineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Resource",
      "title": "orientation.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/1d8d13d742247016ec6204a3fdeb6150_orientation.pdf",
      "content": "Welcome to 20.109\nLaboratory Fundamentals of\nBiological Engineering\nOrientation Lecture\nFall 2007\n20.109 Laboratory Fundamentals\nof Biological Engineering\nCourse Mission\n- To prepare students to be the\nfuture of Biological Engineering\n- To teach cutting edge research skill and\ntechnology through an authentic research\nexperience\n- To inspire rigorous data analysis and\nits thoughtful communication\nModule 1\nGenome Engineering\nModule 2\nExpression Engineering\nModule 3\nBiomaterials Engineering\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGenome Engineering: M13 redesign\n. http://www.sciencedirect.com. Used with permssion.\nExpression Engineering: siRNA\nBiomaterial Engineering: phage nanowires\nLab skills\nExperiments\nBuild prototype electrochromic device\nPhage material production\n- Grow iridium nanowires on phage surface\nTEM\n- Pattern indium tin oxide slide\nFabrication of bio-based\ndevice\n- Electrodeposit phage nanowires\nDesign and variation of\n- Overlay solid polymer electrolytes\nexperimental conditions\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nLeft: Firefly photo courtesy of Eloise Mason. Used with permission.\nCenter: Plasmid map courtesy of Promega Corporation. Used with permission.\nRight: \"Sea pansy\" (Renilla reniformis) courtesy of NOAA. Used with permission.\nExperiments\nLab skills\nSilence expression of a gene using\nGenetic and physical manipulations\nRNAi\nof mouse ES cells\n- siRNA design\n- transfection\nLuciferase measurements\n- RNA and protein measurements\nsiRNA design\nAssess intended and unintended\nMicroarray analysis\nconsequences\nCourtesy of Elsevier, Inc\nSource: Specthrie, L., et al. \"Construction of a Microphage Variant of Filamentous Bacteriophage.\"\nJ Mol Biol 228, no. 3 (December 5, 1992): 720-4.\nExperiments\nLab skills\nDNA manipulations\nModify existing genome to tag one coat protein\n- digests\nRefactor genome, order its synthesis and test\n- transformation\n- electrophoresis\nCompare infection of minimal and robust E.\ncoli genome\nWestern analysis\nCell & phage culture\n\nState-of-the-Art Laboratory Classroom\nSpace for 12 students - Demonstration Area - 20 Computer Drops\n- Gas/Vacuum/Air/Water - Modern Equipment -\nCell and Tissue Culture Facility\nHEPA Filtered Air - 3 Sterile Hoods - 6 incubators - 2 inverted\nmicroscopes - Modern Culture Equipment\nSupport Room\nAutoclave - Dishwasher - Ice Machine\n- CO2 Source -Vacuum Source\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCourse Details\nLecture\nTuesdays and Thursdays 11-12\nLab\nTuesdays and Thursdays 1-5\nWednesdays and Fridays 1-5\nThere are no \"make-up\" labs\nWork must be turned in on time\nlab reports, homework: at beginning of lab\nlab notebook pages: at end of lab\nYou will perform experiments in pairs\nAssignments can be worked on\ntogether but submitted individually\nGrading\n50% Written Work\nModules 1 and 2\n30% Oral Presentations\nModules (1 or 2) and 3\n10% Homework Assignments\n5% Daily Lab Quizzes\n5% Lab Notebooks\nFoundations/Skills\n- Basic Laboratory Skills\nfollowing and designing protocols\nfirst-hand experience with equipment and procedures\nhow to keep a lab notebook\n- Robust Quantitative Analysis of Data\nstatistical analysis when appropriate\nrepetition of protocols to assess quality of findings\neffect of experimental perturbations on outcome\n- Verbal and Written Communication\ntwo oral presentations\ntwo written reports\n- Critical Thinking\nAnalysis and discussion of primary scientific literature\nCite as: Angela Belcher, Drew Endy, Natalie Kuldell and Agi Stachowiak. Course materials for 20.109 Laboratory\nFundamentals in Biological Engineering, Fall 2007. MIT OpenCourseWare (http://ocw.mit.edu),\nMassachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/e614ffdae15ab84643c5c3e7044ad94a_lec1_1.pdf",
      "content": "MIT 20.109 Module 1 Class 1 notes (DRAFT)\n11 September 2007\nGenome Engineering\nDrew Endy (http://mit.edu/endy/)\nQuestions for Today\nA. What can we infer about the design of a genome by considering the physical\nproblems that a biological system solves?\nB. How is genetic \"real estate\" divvied up?\nC. What makes a good genetic \"part\"? What makes a good genome design?\n1. Lets check out a time-lapse movie of bacteriophage lambda induction (all the movies\nin todays class were taken by Francois St-Pierre, a biology graduate student). Note\nwhat the bacterial cells are doing. Reproducing and dividing. I.e., they are reproducing\nmachines. This is no small feat. Imagine building a machine that is only one micron\nlong and that can copy itself!!!\n2. [Note that sometime this semester, I expect that a research paper should be pub\nlished that will show for the first time that it is possible to construct a copy of a natural\nbacterial genome from scratch, and place this newly constructed into an empty cell,\ncausing the cell to start growing and dividing. Thus, while we are considering the de\nsign of a bacteriophage genome this in 20.109 this Fall, you should expect to be able to\napply the concepts you learn here to design microbial and eukaryotic genomes soon\nenough].\n3. OK, now note that the cells lyse (i.e., are destroyed). In this case, a virus that was\nlatent inside the bacterial cell became active, and destroyed the cells while in the proc\ness of making more copies of itself. What are the various functions that are required\nto destroy a cell while making progeny phage particles?\n4. Lets check out a second movie. In this case the lambda virus is not yet inside the\ncell. The virus particles appear green because a protein (green fluorescent protein) has\nbeen fused to one of the shell (i.e., capsid) proteins of the lambda particle. As a result,\nall the particles glow green. A few cells become infected by the phage and eventually\nproduce more green particles, and in the process are destroyed. What else can we\nnow infer about these \"strange\" green particles? What new functions must be\npresent?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 1 notes (DRAFT)\n11 September 2007\n5. OK. So, lets take a look at M13, a different phage, the one that well be focusing our\nattention on this term. M13 usually does not destroy its host cell. Instead it maintains\nsome sort of stable existence with E. coli. That is, an E. coli cell infected with phage\nM13 will continue to grow and divide, but will secrete M13 phage into to the extracellular\nenvironment. Is such a lifestyle more or less sophisticated than what phage\nlambda does? For example, would you expect that M13 requires more or less\nfunctions to infect E.coli, producing more phage but not killing it?\n6. [Note that we do not have a movie of M13 infection. Perhaps somebody would\nlike to make a GFP fusion to an M13 coat protein. We could then make a movie of\nM13 infection and load it up on YouTube].\n7. From the above, make a list of the sorts of biochemical functions (activities, com\nmands, etc) that we expect M13 must have. I.e., the list of things you would expect to\nsee if you \"lifted the lid\" or \"looked under the hood\" of a M13 particle. For example:\n\n- particle protein (i.e., coat protein)\n\n- landing gear protein (i.e., tail protein)\n\n- constructing protein (i.e., assembly protein)\n\n- secretory protein (i.e., something to get outside the cell)\n\n- infection protein (i.e., something to inside a new cell)\n\n- copy protein (i.e., something replicate the phage DNA)\n8. Could we also infer that there must some information storage mechanism? I.e.,\na genome that encodes all these functions? [Note that this question seems strange\nbecause we know that there is an M13 genome, but your grandparents would not have\nknow this yet].\n9. OK, lets get down to business. How are these functions encoded on the ge\nnome? [Sketch of boxes of different genes arrayed across a genome]. Different func\ntions are encoded as sequences of DNA. For example, a protein will be encoded as a\n\"coding sequence\" (aka CDS).\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 1 notes (DRAFT)\n11 September 2007\n10. Now, are these functions sufficient by themselves? Stated differently, how do we go\nfrom a CDS to a biochemical activity? I.e., how are the DNA encoded functions read\nout inside the cell? [Transcription, translation, and so on]. The key point here is that, in\naddition to coding sequences specifying different biochemical activities, we also need to\nthink about controlling sequences that determine when and how much of different activi\nties are produced. In designing a system, control can be as important, or more\nimportant than the functions themselves (e.g., think of an furnace with no ther\nmostat, or a plane without any rudder or wing flaps).\n11. So, we can infer that there must be elements for turning ON and OFF transcription,\nand for turning ON and OFF translation, and DNA replication.\n12. Lets take a look at a few key types of bacterial genetic elements:\n12a. The Promoter, champion of transcription initiation. Standard promoters that oper\nate inside E.coli will have whats called a -35 region, and a -10 region. These are the\nregions that interact with RNA polymerase, the enzyme that carries out transcription (by\npolymerizing an RNA molecule, copying the underlying DNA template). The numbers\n-35 and -10 refer to the position on the DNA that the RNA polymerase binds prior to ini\ntiating transcription at the +1 site. I.e., for such a promoter, the E.coli RNA polymerase\nbinds upstream of where transcription starts (i.e., the transcription start site). The exact\nsequence of a promote can vary, and as a result will act as a stronger or weaker pro\nmoter (i.e., initiate more or less messenger RNA synthesis). A typical E.coli promoter will\nlook like:\n\n-- TTGACA -- (15-19 base pairs) --- TATAAT -- (a few more base pairs) -- START\n\n(-35)\n\n(-10)\n12b. The Ribosome Binding Site (RBS), master of translation initiation. Standard RBSs\nthat operate inside E.coli will be about 7 base pairs long and will be positioned about 6\nbase pairs upstream of the start of a CDS encoding a protein. The exact sequence of\nan RNA can vary (as w/ promoters, sequence differences will produce different rates of\nprotein synthesis initiation). For example, a very strong RBS might have the sequence\nAGGAGG(nnnnnnn)ATG, where the underlined sequence in the RBS, and the seven ns\nare any space sequence separating the RBS from the ATG start codon (whats an ATG\nstart codon? hang on). Note that you do not always need a \"formal\" RBS to start pro\ntein synthesis. There are natural examples of proteins that are synthesized from mRNA\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 1 notes (DRAFT)\n11 September 2007\nthat do not appear to contain any RBSs!!! [see the RBS \"sequence logo\" depiction be\nlow for a depiction of sequence variation at E.coli RBSs].\n[above image c/o T. Schneider via http://www.lecb.ncifcrf.gov/~toms/gallery/ribo.logo.gif ]\n12c. The Coding Sequence (CDS), encoder of proteins! Coding sequences will be\nmade up of codons, triplets of DNA that define the genetic code for a particular organ\nism. 64 codons can be defined from the 4 bases. Some codons specify what amino\nacid should be incorporated into a protein next. Other codons define START and STOP\nsequences that control protein synthesis (i.e., translation). For example, ATG and GTG\nare two \"allowable\" start codons in E. coli. And, UAA, UAG, and UGA are three \"allow\nable\" stop codons. A start codon will direct the initiation of protein synthesis (usually in\npartnership w/ a RBS). A stop codon will halt protein synthesis. A CDS is defined\nas the sequence of DNA between a start and stop codon.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 1 notes (DRAFT)\n11 September 2007\n12c-bonus. But, note that the start and stop codons need to be \"in frame\" in order to\nfunction as a pair. In frame refers to the fact that codons are three base pairs long, so\nany strain of DNA contains three distinct reading frames, depending on which base you\ndecide to start reading from. And, if you consider the complementary strand of double\nstranded DNA, a sequence of DNA contains up to six (!!!) reading frames. Stay tuned.\n13 . Enough. Lets take a look at an example DNA sequence. What can you find?\ngc[atgcgcaaagggaggcgac{ATGgcaggttacggcgctaa]aggaatccgaaatTGA}aaa\n14. What parts can you find in the above sequence?\n15. What can you say about the architecture of genetic elements?\n16. Why might this particular architecture be good or bad?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/b703dd882eefd8825186ec61f18ea1fa_lec1_2.pdf",
      "content": "MIT 20.109 Module 1 Class 2 notes (DRAFT)\n13 September 2007\nGenome Engineering\nDrew Endy (http://mit.edu/endy/)\nQuestions Introduced Last Time\nA. What can we infer about the design of a genome by considering the physical\nproblems that a biological systems solves?\nB. How is genetic \"real estate\" divvied up?\nC. What makes a good genetic \"part\"? What makes a good genome design?\nQuestions for Today\nD. What is a standard biological part?\nE. What is reliable physical composition? And, reliable functional composition?\nF. How does synthetic biology relate to genetic engineering?\nANNOUNCEMENT\n\"A framework for programming integrated RNA devices\"\nChristina Smolke, Small Western Trade School\n4-5p today in 32-141\n17. Last time we ended up considering the following sequence of DNA, the basic bio\nlogical functions encoded on the DNA, and whether or not this particular genetic archi\ntecture might be \"good\" or \"bad.\"\n\ngc[atgcgcaaagggaggcgac{ATGgcaggttacggcgctaa]aggaatccgaaatTGA}aaa\n18. Its hard for us to answer the question of good/bad architecture because we do not\nknow (and perhaps, cannot know) the absolute purpose of this particular piece of DNA.\nWhat is the objective that nature has evolved this sequence to perform? If effi\nciency of encoding more or less important than modularity? Is a greater sensitiv\nity to mutations in the overlapping coding sequences good or bad?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 2 notes (DRAFT)\n13 September 2007\n19. Because the living world we inhabit is encoded by natural sequences of DNA (in\ncluding ourselves), it is a hugely important to improve our understanding of the architec\nture of genetic systems.\nToo bad natural DNA code doesn t come with documentation!\n20. What is the purpose of a natural sequence of DNA? What defines whether or\nnot its architecture is good or bad?\n21. Now, sometimes you can learn about how something works by building new things.\nWhen you take a car about, and scatter apart the parts across your lawn, thats one sort\nof understanding of a car. But, an entirely different level of understanding would be re\nalized if you could take the parts and put them back together to make a car (one that\nruns, of course).\n22. When we looked at DNA sequence before, we were starting with a system (e.g., a\nbacteriophage) and then \"drilling down\" to get to the primary DNA sequence. What if\nlooked at things differently. What if we started with DNA sequences and began to build\nup higher order systems. Maybe we would look at the design and purpose of genetic\nparts differently.\n23. To get started we are going to make something up. A computer scientist would call\nwhat we are about to make up an \"abstraction hierarchy.\" Thats a fine label so lets\nkeep it. The purpose of an abstraction hierarchy is to organize functions and operations\nacross levels, so that the more primitive components and functions are grouped to\ngether, and evermore sophisticated functions are built on top of the more basic func\ntions. However, one key point in an abstraction hierarchy is to hide, or at least manage\ncomplexity. We cant be considering really sophisticated functions while, at the same\ntime, pay attention to every low level detail. This will be more clear once we get spe\ncific.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 2 notes (DRAFT)\n13 September 2007\n24. So, lets consider an abstraction hierarchy that supports the design and construction\nof DNA-based systems.\nThe lowest level in our hierarchy might be DNA:\n\n- DNA is a string of dinucleotides encoding genetic information.\nNote that this is an information layer, that is itself an abstraction of a physical layer be\nlow, which is defined by the physics an chemistry of DNA itself.\n25. However, we dont want to stop here. Otherwise we would have to memorize se\nquences of DNA. For example:\n\nTAATACGACTCACTATAGGGAGA\nWhats this sequence do? It turns out to be a consensus promoter for a T7 RNA po\nlymerase. It would be a lot of work to memorize the sequence of every DNA mole\ncule that you might want to engineer with. Theres too much complexity (al\nthough, if you do need to memorize DNA sequences, using them as the root\npassword for your computer is a handy learning device).\n26. So, the next level in our hierarchy might be Parts (Im using \"might\" because you\nmight choose to invent a different hierarchy). Now, we need to define parts:\n\n- Parts are basic biological functions that can be encoded as DNA\nExamples of types of parts might include promoters, RBSs, operators, CDSs, docking\nsites, phosphorylation motifs, and so on, and so on.\nYou can imagine that we are going to have a lot of parts, more than we want to\nmemorize.\n27. So, the next level in our hierarchy might be Devices:\n\n- Devices are combinations of one or more parts that encode a human-defined\nfunction\nExamples of types of devices might be protein generators, senders, receivers, banana\nsmell generating, wintergreen smell generating, swim, invade, make spider silk protein,\nand so on, and so on.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 2 notes (DRAFT)\n13 September 2007\n25. OK. Lets stop here (although the current hierarchy goes up one more level to sys\ntems, which you could guess because we are going to have lots of Devices). Looking\nat the Parts and Devices levels, what can we say about Parts? That is, what are\nwe going to want to do with Parts?\n\nWe are going to want to put Parts together to make Devices\n\n(and, we would like our Devices to work!)\n26. Ah ha! Now that we know what we want to be able to do with Parts, we can evalu\nate the designs of parts. What makes a good or a bad part?\n27. Within our invented framework... A good part is a part that can be easily com\nbined with other parts. A good part is a part that, when combined with other\nparts, behaves as expected.\n28. Lets take a look at a historical example (nuts and bolts demo):\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 2 notes (DRAFT)\n13 September 2007\n29. The significance of the Sellers screw thread standard is that each of us can\ngo to a hardware store today, purchase nuts and bolts, and put them together.\nWe dont need to take a Fundamentals of Mechanical Engineering Laboratory to\nput nuts and bolts together. It just works.\n30. Nuts and bolts go together w/o requiring further experimentation because\nthey are designed to support reliable physical and functional composition.\n31. Do natural genetic parts support reliable physical and functional composi\ntion?\n32. Can we engineer synthetic genetic parts that more readily support reliable\nphysical and functional composition?\n33. How does our M13 work related to making synthetic parts? Well, maybe we\ncan redesign the parts of M13 to make them easier for us to work with them, to\nenable more reliable physical and functional composition.\n34. If time, relate synthetic biology to genetic engineering\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/86478dba77dc8356703bc3bc76fdbc1e_lec1_3.pdf",
      "content": "MIT 20.109 Module 1 Class 3 notes (DRAFT)\n18 September 2007\nGenome Engineering\nDrew Endy (http://mit.edu/endy/)\nQuestions Introduced Last Time\nD. What is a standard biological part?\nE. What is reliable physical composition? And, reliable functional composition?\nF. How does synthetic biology relate to genetic engineering?\nDiscussion for Today\nF. How does synthetic biology relate to genetic engineering?\nG. Can we implement reliable physical and functional composition via standard\nbiological parts?\nANNOUNCEMENT\n\"Genetic control of the synthesis and assembly of materials for electronics and energy\"\nAngela Belcher, Mass Tech\n4-5p today in 32-123 (food at 3:40p outside room)\n34. How does synthetic biology relate to genetic engineering?\nPeople have long been interested in using biology to solve problems, from food and\nshelter, to drug production and biofuels, and now a wider number of applications, includ\ning building electronics, environmental monitoring and remediation, and perhaps even\ngrowing large-scale structures, like houses. About 30 years ago researchers discov\nered restriction endonucleases and invented recombinant DNA technology (rDNA).\nrDNA allows people to intentionally cut and paste pre-existing fragments of genetic ma\nterial (so long as the restriction sites are in the right places!). This marked the begin\nning of \"genetic engineering.\" (What does it mean to be an engineer?)\n35. About the same time the rDNA technology got invented, polymerase chain reaction\n(PCR) was figured out, with some of the foundational work being done here at MIT and\nthen fully invented in the 1980s at Cetus, Inc. As important, by 1977, DNA sequencing\nwas figured out by Fred Sanger at Harvard.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 3 notes (DRAFT)\n18 September 2007\n36. Taken together, rDNA, PCR, and DNA sequencing form a core set of underlying\ntechnologies that allow for the editing and reading out of genetic material. Since bio\nlogical systems are encoded via genetic material, these are important technologies both\nbiological science (e.g., change things and see what happens) and biological engineer\ning (e.g., make something that does what you want, hopefully). For whatever reasons,\nthese three technologies form the basis of what has been called \"genetic engi\nneering.\" It doesnt really matter what you call it, so long as you appreciate what\nthe technologies can do, and how to use them for constructive purposes.\n37. One important lesson across all of engineering is that, so much as it is possi\nble, it is critically important to improve the tools that we use to solve problems.\nBuilding 32 was designed with computers, using computer aided design (CAD) software\nadapted from plane manufacture. For that matter, the Boeing 777 was designed entirely\non computer (so I am told). Microprocessors can only be designed using CAD tools de\nveloped back in the 1970s. And, lets not forget the American System of Manufacturing,\ndeveloped in Western Mass. and other places back in the early to mid 1800s (for pro\nducing guns). So, as a question, could we get better at reading DNA (i.e., sequenc\ning). And, could we get better at writing DNA (i.e., synthesis or construction)?\n38. The answer to this question is obviously yes. So, today, there are three new\ntechnologies being developed that aid in the process of engineering biological\nsystems. These three technologies are (a) automated DNA construction, (b)\nphysical and functional composition (and other) standards, and (c) abstraction.\nAutomated DNA construction, based on DNA synthesis, lets us make DNA from scratch,\nin place of bashing DNA together in the lab w/ rDNA and PCR. Standards and abstrac\ntion help us manage the information going into the DNA synthesizers. Taken together,\nthese three new technologies extend and improve the underlying foundations of both\nbiological science and engineering. For whatever reasons, these three new technolo\ngies form the basis of what is now being called \"synthetic biology.\" Again, it doesnt\nreally matter (to me) what you call it, so long as you know what is going on and why.\nAnd, as a final comment, just like DNA sequencing (and PCR and rDNA) technology\nwas fairly primitive in 1977 compared to today, many aspects of these three new foun\ndational technologies are immature. We have to go make them happen if we want\nmake biology easier to engineer.\nfunctional and physical composition.\n39. As one example of functional composition,\n(b/c of 20.109 lab), heres a quick link to the paper:\nhttp://www.pnas.org/cgi/content/abstract/104/36/14283\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 3 notes (DRAFT)\n18 September 2007\nBasically, a riboswitch is made from three parts. A ribozyme, an aptamer, and a com\nmunication domain. A ribozyme is an RNA structure that has an enzymatic activity -- it\ncan cut RNA (usually itself). An aptamer is an RNA structure that can interact with an\nother chemical (e.g., a small molecule like caffeine). A communication domain links the\nribozyme and the aptamer together, so that when the ligand and present, the ribozyme\nis either activated or inactivated.\n40. The key advance in this engineered riboswitch work appears to be that the authors\nhave figured out how to combine any aptamer with a ribozyme, in order to control ribo\nzyme activity (although they have only shown that two different aptamers work -- what\ncould be some of the problems that might come up). Theyve also figure out how to in\ntegrate their riboswitches into transcripts in order to control gene expression, and claim\nto be able to control the level of most any mRNA. So, this work is an example of reli\nable functional composition. Because functional composition appears to be\nworking, you could be switches against most anything you can find an aptamer\nfor. Question. Do these authors present any results on reliable physical compo\nsition? (Not that I can see).\n41. Now, as an example of physical composition, Lets take a look at the parts in the\nRegistry of Standard Biological Parts (note that it is not called the Registry of Biological\nParts, so there must be something different about Standard Biological Parts, right?). It\nturns out that the parts currently in the Registry are called BioBrick parts (one \"brand\" of\nstandard biological parts, although there are not yet any competing brands of standard\nbiological parts). The BioBrick parts follow a particular scheme (invented by Tom\nKnight here at MIT) that supports physical composition. How does this scheme\nwork?\n42. Each BioBrick part is bracketed by the same four restriction endonuclease sites:\n\nEcoRI-XbaI [PART] SpeI-PstI\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMIT 20.109 Module 1 Class 3 notes (DRAFT)\n18 September 2007\n43. As a result of bracketing each part with these four sites, you can put any two parts\ntogether, and the resulting composite part is bracketed with the same four sites (i.e., you\nhave a new part!).\n44. So, the BioBricks standard assembly scheme is an example of reliable physical\ncomposition. But, note, this says nothing about functional composition, per se.\nQuestions\nWhich would you rather have, reliable physical composition, or functional composition?\nWhat sort of functional composition issues can we begin to think about with the parts\nthat make up phage M13?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/8fcb4a3da92d660643e63e920de9ffd5_lec1_4.pdf",
      "content": "Unknown\nOur Lord's Candle (Yucca whipplei), Lakeview Mountains, 22 Apr 2006\nCourtesy of \"Takwish.\" http://takwish.smugmug.com/.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nImage removed due to copyright restrictions.\nPostcard: \"Granite Quarry, St. Cloud MN\"\n\nhttp://www.rootsweb.com/~usgenweb/mn/stearns/postcards/quarry.jpg\n\nStone Bridge over Bull Run\nhttp://www.virginiaplaces.org/vagupnova/mnbp.html\nCopyright (c) 1998-2007 Charles A. Grymes. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCourtesy of Tor Lillqvist.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nMillau Viaduct, France\n\nAmazon jungle, Peru. Courtesy of Nathan Snider.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nFAB TREE HAB\nCourtesy of Mitchell Joachim. Used with permission.\nSee http://www.archinode.com/bienal.html.\n2003 installation by Patrick Dougherty at Common Ground,\nNew Harmony, IN. (http://www.stickwork.net).\nPhoto (c) Doyle Dean. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nAutomated\nConstruction\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nBioAutomation MerMade 384 Well DNA/RNA Synthesizer.Photo courtesy of BioAutomation Corp. Used with permission.\n(http://www.bioautomation.com/Synthesizers-MerMade%20384.html)\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCarlson, Pace & Proliferation of Biological Technologies, Biosec. & Bioterror. 1(3):1 (2003)\nCourtesy of Mary Ann Liebert, Inc. Publishers.\nUsed with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHow exactly does\nDNA synthesis work?\nCoupling efficiency?\nHow do you build genes?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_5_atissa.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/65998a665a958582f6c6e4aa3c46b54a_lec1_5_atissa.pdf",
      "content": "Creating Your 20.109 Presentation\nAtissa Banuazizi\n\n25-26 September 2007\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPresentation Basics\nAccording to The Book of Lists,\npublic speaking is the Number One human fear.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nOutline\n- Before you begin ...\n- Structuring the presentation\n- Principles of effective visual support\n- Delivering the presentation\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nBefore you begin...\nOral vs. written communication\n- Challenge for the presenter:\n- Time constraint on information presented\n- Challenge for the audience:\n- Can't control rate of presentation to match their\ncomprehension\n- Can't re-read sections\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nBefore you begin...\nAsk yourself:\n- What is the main point I want to make to my\naudience?\n- Why is this interesting or important?\n- How do the data support my main point?\n- What part of my story can I tell with the data\nin the allotted amount of time?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nBefore you begin...\nContent is the Key!\n- If there is no content, there is no presentation\nKnow your material and its message\n- Collect more information than you will use\n- Review the experiment\n- Review graphs and charts\n- Anticipate problem areas\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nTell a story\n- Narrative Structure\n- Beginning: introduction\n- Middle: data\n- End: summary\n- Show how each section relates to and builds\nupon the one before it\n- Engage the audience's interest as they\nfollow the narrative\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nIntroduction\n- Introduce yourself\n- Give the title (and author) of your talk\n- In one sentence, introduce the central question\nor problem of the experiment\n- State significance of experiment; why should we\ncare?\n- Briefly explain necessary background\n- Give audience a preview of approach to problem\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nData\n- Forms bulk of presentation\n- Drawn from Methods, Results and Discussion of\npaper\n- keep explanation of methods to a minimum -\nonly as much as needed to understand results\n- integrate discussion as you go\n- Data are only worth presenting insofar as they\nrelate to your central question\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nSummary\n- What do you want your audience to remember\nabout your talk?\n- Remind your audience of primary findings\n- Explain what these findings contribute to the field\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nQ & A\n- Anticipate questions not covered in the\npresentation\n- OK to bring extra slides\n- OK to acknowledge gaps in expertise\n- Explain what you do know\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nArrange ideas in a logical sequence\n- Most important point first\n- Emphasize key points as you make them\n- Provide explicit transitions between points\nGuide your audience through the logic\nof the scientific process!\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStructuring the Presentation\nPreview and Review\n- Map out goals of the talk in advance\n- Use topic sentences in body of the talk\n- Summarize\n- at end of each section\n- at end of your talk\nAudience Attention Span\nTime\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPrinciples of Visual Support\nOr: Why use slides at all?\nDisadvantages:\nAdvantages:\n- disruptive -- pull\n- can convey a point quickly\naudience's attention away\nfrom the speaker and onto\n- add variety and interest\nthe screen\n- audience recall increases\ndramatically when the\nspeaker uses effective slides\nAsk yourself: What specific message are you trying to\nconvey with your visual?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nDirect the audience's focus\nTitle all slides\n- Headings should clarify the main\npoint of each slide\nUse graphics liberally, keep\nthem simple\n- Average attention span\nper slide is 8 seconds\nUse clear, explanatory\nlabels for charts and\ndiagrams\n- Make sure to label axes! Drawing of binoculars.\nFigure by MIT OpenCourseWare.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLess is More\nLimit number of slides\nSay more than you show\n- show primary points on slide; flesh out secondary points verbally\nMinimize text\n- Don't crowd your slides with a lot of text. Especially, avoid using\ncomplete sentences -- or worse, complete paragraphs. Either the\naudience will become engrossed in trying to read the text, and will\nstop paying attention to you, or else they'll wonder why you didn't\njust give them a handout already and save yourself the trouble of\nreading to them.\nAvoid potentially annoying animation\n- Really.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMore Design Principles\nColor\n-Be easy on the eyes; don't distract from content\n-Avoid low-contrast combinations\nType\n-Sans serif headings\n-Serif bullets\n(serif \"feet\" make lines for\nArial\n- Times\n\nVerdanda\n- Bookman\nease of reading)\n-Type at least 20-24 pt\n-Limit upper-case type\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nUsing graphics in a presentation\nWhat story does this\npicture tell?\n\"As shown in Fig. 2, the\nloss of neuraminidase\nactivity from the super\nnatant coincides with\nthe disappearance of\nthis 66-kDa protein.\nThis indicates that\nneuraminidase activity is\nprecipitated via the 66\nkDa protein.\"\nFig 2 in van der Horst GT, N. J. Galjart, A. d'Azzo, H. Galjaard, and F. W. Verheijen.\n\"Identification and in Vitro Reconstitution of Lysosomal Neuraminidase from Human\nPlacenta.\" J Biol Chem 264, no. 2 (January 15, 1989): 1317-1322.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nGraph removed due to copyright restrictions.\n\nNeuraminidase activity is\nprecipitated via 66-kDa\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nGraph removed due to copyright restrictions.\nFig 2 in van der Horst GT, N. J. Galjart, A. d'Azzo, H. Galjaard, and F. W. Verheijen.\n\"Identification and in Vitro Reconstitution of Lysosomal Neuraminidase from Human\nPlacenta.\" J Biol Chem 264, no. 2 (January 15, 1989): 1317-1322.\n\nDelivering the Presentation\nRehearse!\n- Practice at least 3 times\n- Practice with a colleague for feedback\n- Is your content clear?\n- Do you rock, squirm, gesture too much?\n- Is there room for improvements/adjustments?\n- Time yourself\n- What 3 questions will your audience likely ask?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nDelivering the Presentation\nOn Presentation Day...\n- Arrive early\n- Check equipment and voice projection\n- Bring a backup of your presentation\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHow to Connect with the Audience\nPut yourself in the audience's place\n- Use everyday language and terms\n- Explain novel ideas/terms or references\nEngage the audience\n- Establish eye contact; look at people\n- Convey enthusiasm; if you aren't excited about your subject,\nyour audience won't be either\nA presentation is two-way communication\n- Pay attention to audience reaction; modify your talk as needed\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nStanding\n- Don't block the screen!\n- Stand at a 45-degree angle\nto the audience\n- Keep weight evenly\ndispersed on both feet\nPhoto removed due to copyright restrictions.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGesture and Movement\n- Make non-verbal behavior deliberate; avoid extraneous\nmotion\n- Some walking adds variety; too much is distracting\n- Use gestures that complement your speech's content and are\nnatural for you\n- Know what your body language says\nPhoto removed due to copyright restrictions.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nVocal Issues\nVolume\n- Project to back of room:\nsupport voice from diaphragm\nRate\n- Speak at appropriate rate for audience comprehension\n- Slow down for especially complex or important\ncontent\nPitch\n- Keep pitch of your voice at a natural level\n- Avoid \"uptalk\"\nPhoto of \"The Three Tenors\" singing\nremoved due to copyright restrictions.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nHandling Anxiety\n- Practice and prepare\n- Focus and center yourself\n- Breathe\n- Have a conversation\nImage removed due to copyright restrictions.\nEdvard Munch's \"The Scream.\"\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nNow What?\n- Get acquainted with the research\n- Design your slides\n- Practice your talk\n- Deliver your talk\n- Meet to review video and slides\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nSources\nPurpose, Movement, Color: A Strategy for Effective\nPresentations\n- Tom Mucciolo and Rich Mucciolo, MediaNet, Inc., 1994\nThe Craft of Scientific Presentations\n- Michael Alley, Springer, 2005\nThe Quick and Easy Way to Effective Speaking\n- Dale Carnegie, Dale Carnegie Associates, Inc., 1962\nThe Visual Display of Quantitative Information\n- Edward R. Tufte, Graphics Press, 1983\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/b8fbfd94ada736ad06b14aa73c578941_lec1_5.pdf",
      "content": "How exactly does\nDNA synthesis work?\nCoupling efficiency?\nHow do you build genes?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nImage removed due to copyright restrictions.\nExcerpts from: Compton, K. T., and J. W. M. Bunker (MIT). \"The Genesis of a Curriculum in Biological Engineering.\" The Scientific Monthly (January 1939).\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nTo build section alpha, we first cloned parts 5, 6, 7, 8, 12, 13, 14, 15, 16, 18, 20, 22, and 24 into pSB104. We\ncloned part 11 into pSB2K3. We cloned each part with its part-specific bracketing restriction sites\nsurrounded by additional BioBrick restriction sites. We used site-directed mutagenesis on parts 6, 7, 14, and\n\n20 to introduce the sites U1, U2, U3, and U4, respectively. Our site-directed mutagenesis of part 20\nfailed.We used site-directed mutagenesis to remove a single Eco0109I restriction site from the vector\npUB119BHB carrying the scaffold Fragment 4. We cloned part 15 into this modified vector. We then cloned\n\nscaffold Fragment 4 into pREB and used serial cloning to add the following parts: 7, 8, 12, 13, 14, 16, 18, 20,\n22, and 23. We digested the now-populated scaffold Fragment 4 with NheI and BclI and purified the\nresulting DNA.Next, we cloned parts 5 and 6 into pUB119BHB carrying scaffold Fragment 3. We used the\nresulting DNA for in vitro assembly of a construct spanning from the left end of T7 to part 7. To do this,\nwe cut wild-type T7 genomic DNA with AseI, isolated the 388 bp left-end fragment, and ligated this DNA\nto scaffold Fragment 2. We selected the correct ligation product by PCR. We fixed the mutation in part 3\n(A1) via a two-step process. First, PCR primers with the corrected sequence for part 3 were used to\namplify the two halves of the construct to the left and right ends of part 3. Second, a PCR ligation joined\nthe two constructs. We added scaffold Fragment 3 to the above left-end construct once again by PCR\nligation as described above. We repaired the mutation in part 4 (A2, A3, and R0.3) following the same\nprocedure as with part 3. We used a right-end primer containing an MluI site to amplify the entire\nconstruct, and used the MluI site to add part 7. We used PCR to select the ligation product, digested the\nproduct with NheI, and purified the resulting DNA.We isolated the right arm of a BclI digestion of wild-\ntype T7 genomic DNA and used ligation to add the populated left-end construct and the populated\nScaffold Fragment 4. We transfected the three-way ligation product into IJ1127. We purified DNA from\nliquid culture lysates inoculated from single plaques. We used restriction enzymes to digest the DNA and\nisolate the correct clones.Next, we added part 11 via three-way ligation and transfection. Because the\nrestriction sites that bracket part 9 (RsrII) also cut wild-type T7 DNA, we needed to use in vitro assembly\nto add this part to a subsection of section alpha. To do this, we used PCR to amplify the region spanning\nparts 5-12 from the refactored genome. We cut the PCR product with RsrII and ligated part 9. We used\nPCR to select the correct ligation product; this PCR reaction also added a SacII site to the fragment. We\ndigested the PCR product with SacI and SacII and cloned onto the otherwise wild-type phage. Lastly, we\nused the SacII site to clone part 10 onto the phage.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGet me this DNA!\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nQuestions about T7.1?\nDesign?\nConstruction?\nOther?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nPart 2 of your portfolio:\n1. Choose a section (site-site)\n2. Design DNA for your section (must\ninclude terminal RE sites)\n3.Annotate sequence (follow scheme)\n4.Write summary paragraph (include $\nestimate and GO/NO-GO)\n5. 4-8 week fab time, f(L, complexity)\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/bec00643b3f142dfb26df27486750136_lec1_6.pdf",
      "content": "Part 2 of your portfolio:\n1. Choose a section (site-site)\n2. Design DNA for your section (must\ninclude terminal RE sites)\n3.Annotate sequence (follow scheme)\n4.Write summary paragraph (include $\nestimate and GO/NO-GO)\n5. 4-8 week fab time, f(L, complexity)\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nIdea #1 -- Get rid of protein X\nWork between the MluI and Bsu36I sites\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMlu I\n[ACGCG T]TATTTGAAG TCTTTCGGGC TTCCTCTTAA TCTTTTTGAT GCAATCCGCT\nTTGCTTCTGA CTATAATAGT CAGGGTAAAG ACCTGATTTT TGATTTATGG\nTCATTCTCGT TTTCTGAACT GTTTAAAGCA TTTGAGGGGG ATTCAATGAA\nTATTTATGAC GATTCCGCAG TATTGGACGC TATCCAGTCT AAACATTTTA\n\nBsu36 I\nCTATTACCC[C CTCAGG]\nFind some parts. We know that gX\nshould be somewhere around here,\nand maybe an RBS.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMlu I\n[ACGCG T]TATTTGAAG TCTTTCGGGC TTCCTCTTAA TCTTTTTGAT GCAATCCGCT\nTTGCTTCTGA CTATAATAGT CAGGGTAAAG ACCTGATTTT TGATTTATGG\npX RBS\npX start\nTCATTCTCGT TTTCTGAACT GTTTAAAGCA TTTGAGGGGG ATTCAATGAA\nTATTTATGAC GATTCCGCAG TATTGGACGC TATCCAGTCT AAACATTTTA\n\nBsu36 I\nCTATTACCC[C CTCAGG]\nOption 1. Eliminate start codon\nIssue: Remember pII, does it need a met?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nWhat would be a neutral substitution for methionine?\nDo a web search on \"methionine substitution neutral\"\n[image of Google search result removed due to copyright restrictions.]\nLet's check this out...\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLots of choices for leucine...\nPick a reasonable codon...\nTable of the st\nandar\nd geneti\nc code.\nFigure by MIT OpenCourseWare.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nGiven that we could use one of six codons for leucine,\nwhich should we choose?\nSince DNA will be used in E. coli, choose a codon\nthat E. coli likes.\nWeb search on \"codon usage coli\"\n[image of Google results page removed due to copyright restrictions]\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLet's go with CUG\nMlu I\n[ACGCG T]TATTTGAAG TCTTTCGGGC TTCCTCTTAA TCTTTTTGAT GCAATCCGCT\nTTGCTTCTGA CTATAATAGT CAGGGTAAAG ACCTGATTTT TGATTTATGG\npX RBS\npX start\nTCATTCTCGT TTTCTGAACT GTTTAAAGCA TTTGAGGGGG ATTCACTGAA\nTATTTATGAC GATTCCGCAG TATTGGACGC TATCCAGTCT AAACATTTTA\n\nBsu36 I\nCTATTACCC[C CTCAGG]\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nMlu I\n[ACGCG T]TATTTGAAG TCTTTCGGGC TTCCTCTTAA TCTTTTTGAT GCAATCCGCT\nTTGCTTCTGA CTATAATAGT CAGGGTAAAG ACCTGATTTT TGATTTATGG\npX RBS\npX start\nTCATTCTCGT TTTCTGAACT GTTTAAAGCA TTTGAGGGGG ATTCAATGAA\nTATTTATGAC GATTCCGCAG TATTGGACGC TATCCAGTCT AAACATTTTA\n\nBsu36 I\nCTATTACCC[C CTCAGG]\nOption 2.Trash the RBS...\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/20-109-laboratory-fundamentals-in-biological-engineering-fall-2007/998985685d28fc5895eaaf761aa172d3_lec1_7.pdf",
      "content": "Cite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nBiosafety Level 1 practices, safety equipment, and facility design and construction are appropriate for undergraduate\nand secondary educational training and teaching laboratories, and for other laboratories in which work is done with\ndefined and characterized strains of viable microorganisms not known to consistently cause disease in healthy adult\nhumans. Biosafety Level 1 represents a basic level of containment that relies on standard microbiological practices with\nno special primary or secondary barriers recommended, other than a sink for handwashing.\nBiosafety Level 2 practices, equipment, and facility design and construction are applicable to clinical, diagnostic,\nteaching, and other laboratories in which work is done with the broad spectrum of indigenous moderate-risk agents that\nare present in the community and associated with human disease of varying severity. With good microbiological\ntechniques, these agents can be used safely in activities conducted on the open bench, provided the potential for\nproducing splashes or aerosols is low. Hepatitis B virus, HIV, the salmonellae, and Toxoplasma spp. are representative of\nmicroorganisms assigned to this containment level.\nBiosafety Level 3 practices, safety equipment, and facility design and construction are applicable to clinical, diagnostic,\nteaching, research, or production facilities in which work is done with indigenous or exotic agents with a potential for\nrespiratory transmission, and which may cause serious and potentially lethal infection. Mycobacterium tuberculosis, St.\nLouis encephalitis virus, and Coxiella burnetii are representative of the microorganisms assigned to this level. Primary\nhazards to personnel working with these agents relate to autoinoculation, ingestion, and exposure to infectious aerosols.\nAt Biosafety Level 3, more emphasis is placed on primary and secondary barriers to protect personnel in contiguous\nareas, the community, and the environment from exposure to potentially infectious aerosols.\nBiosafety Level 4 practices, safety equipment, and facility design and construction are applicable for work with\ndangerous and exotic agents that pose a high individual risk of life-threatening disease, which may be transmitted via the\naerosol route and for which there is no available vaccine or therapy. Agents with a close or identical antigenic\nrelationship to Biosafety Level 4 agents also should be handled at this level. When sufficient data are obtained, work with\nthese agents may continue at this level or at a lower level. Viruses such as Marburg or Congo-Crimean hemorrhagic\nfever are manipulated at Biosafety Level 4. The primary hazards to personnel working with Biosafety Level 4 agents are\nrespiratory exposure to infectious aerosols, mucous membrane or broken skin exposure to infectious droplets, and\nautoinoculation. All manipulations of potentially infectious diagnostic materials, isolates, and naturally or experimentally\ninfected animals, pose a high risk of exposure and infection to laboratory personnel, the community, and the\nenvironment.\nhttp://www.cdc.gov/od/ohs/biosfty/bmbl4/bmbl4toc.htm\n\nPhoto removed due to copyright restrictions.\nAttendees at the International Conference on\nRecombinant DNA Molecules, February 1975 in Asilomar, CA\n(Phil Sharp, David Baltimore and others)\nSee http://libraries.mit.edu/archives/exhibits/asilomar/index.html\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nNIH\nMIT CAB\nhttp://mit.edu/cab/\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\nText content removed due to copyright restrictions.\n\nAbstract and final \"Safety Precautions\" section from Denwannieux, M., et al. \"Identification of an Infectious Progenitor for the\nMultiple-copy HERV-K Human Endogenous Retroelements.\" Genome Research 16 (2006): 1548-1556.\n\nWhat's changed since the 70s?\nhttp://en.wikipedia.org/wiki/Phillip_Allen_Sharp\nPhillip Sharp with President George W. Bush, at the National Medal of Science awards in 2006.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nWhat's changed since the 70s?\n1. Databases populated with sequence information.\n2.The internet.\n3. Early returns on pilot investments in DNA\nconstruction technology.\n4. Overnight shipping.\n5. Expanded concern re: active misapplication of\nbiotech.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCourtesy of Make Magazine. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCourtesy of Make Magazine. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCourtesy of Make Magazine. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nImages removed due to copyright restrictions.\n\n3 scans from 2600: The Hacker Quarterly, Winter 2003-2004 issue. Cover, Table of Contents and pg. 6 \"Hacking the Genome.\"\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nImages removed due to copyright restrictions.\nPhoto of Fort Detrick entrance.\nWikipedia page on NBACC:\n(http://en.wikipedia.org/wiki/National_Biodefense_Analysis_and_Countermeasures_Center).\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nWhat's the difference\nbetween safety & security?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nLocked-up\nUnknown\nreservoir\nDon't exist\nSource: http://www.ncbi.nlm.nih.gov/PubMed/\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCarlson, Pace & Proliferation of BiologicalTechnologies, Biosec. & Bioterr . 1(3):1 (2003)\nCourtesy of Mary Ann Liebert, Inc. Publishers. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nInformation (DNA Sequence)\nSequencing\nSynthesis\nMaterial (Physical DNA)\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nImage removed due to copyright restrictions.\neBay sale page for \"ABI Applied Biosystems 3948 DNA Synthesizer.\"\nBuyItNow price = $4,999.99.\nShips to: Worldwide.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCourtesy of Rob Carlson. Used with permission.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nShould the DNA sequence\nencoding human pathogens be\nfreely available online?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nImage removed due to copyright restrictions.\nText of Sharp, P.A. \"1918 Flu and Responsible Science.\" Science 310, no. 5745 (2005): 17.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nImage removed due to copyright restrictions.\nKurzweil, R., and B. Joy. \"Recipe for Destruction.\" New York Times, 17 October 2005.\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nSolution frameworks should be adaptive.\nSolution frameworks should be adaptive.\nShould there be top-secret BL-4 labs?\nShould teenagers practice genetic engineering?\nShould BioBrick par ts be patented or freely shared?\nW ill biohackers be good or bad?\nIs garage biotechnology inevitable?\nShould genetic engineers be licensed?\nShould genetic engineers sign their work?\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY].\n\nCite as: Drew Endy. Course materials for 20.109 Laboratory Fundamentals in Biological Engineering, Fall 2007. MIT\nOpenCourseWare (http://ocw.mit.edu), Massachusetts Institute of Technology. Downloaded on [DD Month YYYY]."
    }
  ]
}