{
  "course_name": "Language and its Structure III: Semantics and Pragmatics",
  "course_description": "This course gives an introduction to the science of linguistic meaning. There are two branches to this discipline: semantics, the study of conventional, “compositional meaning”, and pragmatics, the study of interactional meaning. There are other contributaries: philosophy, logic, syntax, and psychology. We will try to give you an understanding of the concepts of semantics and pragmatics and of some of the technical tools that we use.",
  "topics": [
    "Humanities",
    "Linguistics",
    "Semantics",
    "Philosophy",
    "Philosophy of Language",
    "Humanities",
    "Linguistics",
    "Semantics",
    "Philosophy",
    "Philosophy of Language"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nCourse Description\n\nThis course gives an introduction to the science of linguistic meaning. There are two branches to this discipline: semantics, the study of conventional, \"compositional meaning\", and pragmatics, the study of interactional meaning. There are other contributories: philosophy, logic, syntax, and psychology.\n\nWe will try to give you an understanding of the concepts of semantics and pragmatics and of some of the technical tools that we use. Woven through the entire semester, we will conduct an investigation into the meaning of \"if\", as a case study of what semantics and pragmatics try to achieve.\n\n24.933 is the graduate version of this course, offering graduate students from outside the Department of Linguistics and Philosophy an overview of semantics and pragmatics. In practical terms, students registered for 24.933 will do exactly the same work as students registered for 24.903, except for an extra question here and there on the problem sets and higher expectations for the squib.\n\nRequirements\n\nPrerequisite\n\nIntroduction to Linguistics (\n24.900\n)\n\nReadings and Attendance\n\nWe will be using two textbooks for this class:\n\nPortner, Paul H.\nWhat is Meaning? Fundamentals of Formal Semantics\n. Malden, MA: Blackwell, 2005. ISBN: 1405109181. (Paperback)\n\nvon Fintel, Kai.\n\"If\" - Semantics, Pragmatics, and One Little Word\n. Draft, MIT. (In progress) (Note: Not available to OCW users)\n\nThe von Fintel book does not exist yet, in any strict sense of \"exist\". We'll be using notes and material from it. You'll be something between guinea pigs and co-authors of this book.\n\nMost of the work in this course will occur in class, through lectures, Q&A, and discussion. Therefore, attendance and participation in all classes is obligatory. I cannot emphasize this enough. You must come to class and you must participate. If you have a habit of working all night and sleeping all day, or if you believe that it's nobler to skip classes than to attend them, do not take 24.903!\n\nIf you cannot make it to a class meeting, courtesy requires that you give prior notification (email or phone would be fine) and tell me what is going on. There are of course acceptable excuses such as illness or family emergencies. Hangovers, disorganization, bad time management are not acceptable reasons to miss a class meeting. If there's a pattern of missing class, we will need to address the problem.\n\nClass Participation\n\nYou are expected to participate vigorously in class discussions. When I lecture, I expect you to listen for understanding, ask questions, raise problems, answer questions, etc. When another student asks a question or raises a problem or answers a question, you should listen for understanding and be engaged in the ensuing conversation.\n\nProblem Sets\n\nThere will be 8 graded problem sets during the semester. The difficulty of these problems will vary. Some will be mechanical - even trivial - but others will be more challenging, requiring imagination and thought.\n\nProblem sets will be handed out on Wednesday, and are due on the following Wednesday. In general, late problem sets will not be accepted except by e-mailed instructor requested before the due date. Permission will normally be granted only for illness and similar emergencies.\n\nYou are encouraged to discuss the class with your classmates, and general discussion of the problem sets is fine - even encouraged. But make sure you arrive at the solution yourself. I know it may sometimes be unclear where to draw the line between \"general discussion\" and actually doing the problem together. If you are in any doubt, please tell me in a note on the problem set who you worked with. Needless to say, your written answers should be yours alone.\n\nYou are encouraged to discuss the class with your classmates, including the problem sets. You must however write up your assignments individually and you must be able to individually justify the analyses you turn in. Any suspected case of plagiarism on homeworks (i.e. any case where two or more students turn in what appear to be assignments copied from a single source) will be investigated. If you are in any doubt, please tell me in a note on the problem set who you worked with. We encourage the students to seek help from the instructor and the TA, whenever necessary and in timely fashion.\n\nSquib\n\nYou will also write a short paper (5-10 p.) on a topic in semantics and/or pragmatics. We will be most happy if the paper is what linguists call a squib. A squib is a pattern of facts that you find interesting along with an exploration of their possible significance. You might discover these facts yourself, as you sit in class, talk with friends, or read the newspaper - or you might read them in a reference grammar or linguistics book. The paper should contain an organized description of the phenomenon, explain its interest and significance, and suggest how you might analyze it.\n\nYour squib will not necessarily take more time to write than one of the longer problem sets. Please discuss your topic with me in advance of the due date.\n\nFinal Exam\n\nThere will be a three hour, open book final exam during the Final Exam Period. The material covered will include the entire semester's worth of work we've done.\n\nGrade Computation\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance\n\n10%\n\nParticipation\n\n10%\n\nProblem Sets\n\n40%\n\nSquib\n\n15%\n\nFinal\n\n25%",
  "files": [
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/5d507f0d62bcae449aa8ac1275272e2e_ps1.pdf",
      "content": "24.903 Problem Set #1\nExpected length: No more than 2 pages\nThe Assignment\n- Collect four random naturally occurring utterances during your day tomorrow\n(for example, whatever you last said or wrote at 11:30am, 1:30pm, 3:30pm, and\n5:30pm).\n- For each of the utterances,\n1. describe the context in which it occurred;\n2. describe the purpose it was meant to serve;\n3. describe what background knowledge your addressee needed to under\nstand your utterance."
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/e67a5a65d01dcb1fb8e81e8eab11843f_ps2.pdf",
      "content": "24.903/933 Problem Set #2\nExpected length: No more than 2 pages\nThe Assignments\n1. Beyond TruthConditions\nGo back to your answers on the first problem set. For each of the four utter\nances you described, discuss whether a truthconditional analysis is sufficient\n(presumably that would be because the purpose of the utterance was simply\nto inform the addressee that the truthconditions of the sentence are satisfied)\nand if not, describe what else might be going on.\nFor help with this assignment, reread some relevant passages in the textbook:\n(i) the first paragraph in the box on p. 22, (ii) Section 1.3.2 on pp. 2223\nabout nondeclarative sentence types, and (iii) Section 1.3.3 on pp. 2324 about\nspeaker meaning.\n2. A Puzzle About Exclusive Disjunction\nIt is often said that English disjunction is ambiguous between an \"inclusive\"\nreading and an \"exclusive\" reading, which differ in whether p or q is true when\nboth p and q are true.\nExclusive disjunction (let's use the symbol ⊕) has or would have the following\ntruthtable:\np\nT\nq\nT\np ⊕ q\nF\nT\nF\nT\nF\nT\nT\nF\nF\nF\nIn other words, p ⊕ q is true just in case one but not the other of p and q is\ntrue.\nIn this exercise, you will find out what a sequence of two exclusive disjunction\noperators would mean. We might be dealing with sentences like We will invite\nPeter or we will invite Paul or we will invite John.\n\nKai von Fintel: 24.903/933 Problem Set #2\nYour assignment is to fill out the last column of the truthtable below:\np\nT\nq\nT\nr\nT\np ⊕ q\nF\n(p ⊕ q) ⊕ r\nT\nT\nF\nF\nT\nF\nT\nT\nT\nF\nF\nT\nF\nT\nT\nT\nF\nT\nF\nT\nF\nF\nT\nF\nF\nF\nF\nF\nNow, describe what meaning this predicts for sentences with two disjunctions\n(like the one we just gave). Do you think that English sentences with two\ndisjunctions ever have the meaning predicted here? If not, what does this say\nabout the claim that English or has an exclusive reading?"
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/a7d21583d3be38da6ce35c4f51e2d61b_ps3.pdf",
      "content": "Problem Set #3\nThe third problem set is due next Wednesday 3/2 at 12 noon.\nThese are simple exercises in propositional logic from the book: Partee, Barbara H., Alice ter\nMeulen, and Robert E. Wall, Mathematical Methods on Linguistics, Boston, MA: Kluwer, 1987, ISBN:\n9027722447, chapters on propositional logic.\n-\nExercise 1 on p. 128-9 of Partee et.al.\n-\nExercise 4 on p. 130 of Partee et.al."
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/f1389fc7178404fd326a4345a5b7c303_ps4.pdf",
      "content": "Problem Set #4\nThe fourth problem set is due next Wednesday March 9th at 12 noon.\nI. [adapted from a textbook by McCawley]\n\nGive an account in terms of Gricean conversational implicature of why the slogan \"We\nare serving Metro-Boston at over twenty locations\" conveys that the company in question\nhas fewer than 30 locations in the Metro-Boston area.\n\nII. [from a textbook by Chierchia & McConnell-Ginet]\n\nIn each of the pairs below, sentence (a) conversationally implicates sentence (b). For each\npair, provide a reason for thinking that the implication is not a truth-conditional\nentailment [consult Portner Section 11.1, pp. 203-205, and you class notes], and calculate\nthe implicature as best you can, indicating where contextually specific premises need to\nbe supplied.\n\n(1) a. Joan swung at the ball.\nb. Joan missed the ball.\n\n(2) a. I wonder what time it is.\nb. The speaker wants to be told what time it is by the addressee.\n\n(3) a. Jill and Greg went to the movies.\nb. Jill and Greg went to the movies together."
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/9ed2599f0e791bee53c05866454a6840_ps5.pdf",
      "content": "Problem Set #5\nThe fifth problem set is due next Wednesday March 16th at 12 noon.\n-\nRead the article on disjunction by R.E. Jennings in the Stanford Encyclopedia of Philosophy.\n-\nRead especially carefully the section on:\n\"The Myth of Vel and Aut\". (http://plato.stanford.edu/entries/disjunction/#7)\n-\nReport in your own words the central argument that Jennings makes against the claim that\nLatin aut unambiguously conveyed exclusive disjunction.\n-\nAssess whether Jennings' argument could be used to make the same point about English\nor.\nExpected length: about one page."
    },
    {
      "category": "Resource",
      "title": "ps6_system.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/93110352b3e7bd602f10d54cacfd104c_ps6_system.pdf",
      "content": "Problem Set #6\nPROBLEM SET #6\nRead the two page handout giving an overview of the system\nUsing the sample calculations as a model, calculate the truth-conditions (starting with an arbitrary\nfiller a and an arbitrary world w) for the following sentence:\nh\nw She by.\nHannibal is a dog w o t sa\nl\nFor each step of your calculation, give an annotation of what justifies the step (lexicon entry, the\nFA, PA, PM principles, the definition of the λ-notation).\n\nJ\nK\nJ\nJ\nJ\nK\nJ\nJ\nJ\nK\nJ\nJ\nHandout\n24.903 Our System So Far\n[Based on material from Heim & Kratzer 1998]\n1. The Lambda Notation for Functions\n(1)\nRead \"[λ α . β]\" as either (i) or (ii), whichever makes sense.\n(i)\n\"the function which maps every α to β\"\n(ii) \"the function which maps every α to 1, if β, and to 0 otherwise\"\n2. Lexicon\nSome words:\n(2)\nFor any world w and (filler) individual a,\na.\nShelby w,a = Shelby.\nb.\nHannibalKw,a = Hannibal.\nc.\nbarksKw,a = λx.x barks in w.\nd.\ndog w,a = λx.x is a dog in w.\ne.\nsmartKw,a = λx.x is smart in w.\nf.\nJ\nsawKw,a = λx. λy. y saw x in w.\nThe special rule for traces:\n(3)\nFor any world w and (filler) individual a,\nJtKw,a = a.\n3. Functional Application\n(4)\nFunctional Application (FA)\nFor any world w and (filler) individual a, if α is a branching node, {β, γ} the\nKw,a\nset of α's daughters, and βKw,a is a function whose domain contains Jγ\n,\nthen αKw,a = JβKw,a(Jγ w,a).\n4. Predicate Abstraction\n(5)\nPredicate Abstraction (PA)\nFor any world w and (filler) individual a, if α is a branching node whose\ndaughters are a relative pronoun and β, then αKw,a = λx. βKw,x .\n\nJ\nJ\nJ\nK\nK\nK\nJ\nK\nK\nK\nK\nJ\nK\nK\nKai von Fintel: 24.903 Our System\n5. Predicate Modification\n(6)\nPredicate Modification (PM)\nFor any world w and (filler) individual a, if α is a branching node, {β, γ} the\nset of α's daughters, and if βKw,a and γKw,a are both functions from indi\nviduals to truthvalues (oneplace predicates), then JαKw,a = λx. βKw,a(x) =\nw,a(x) = 1.\nJγ\n6. Two Sample Calculations\nPick an arbitrary filler, say a and an arbitrary world w.\nw,a\n(7)\nJHannibal is a smart dog\n= JHannibal (smart dog)\nK\nw,a\n= smart dog w,a( HannibalKw,a)\n=\nJ\nJsmart dog\nK\nw,a\nJ\n(Hannibal)\n= [λx. Jsmart\nK\nw,a(x) = JdogKw,a (x) = 1] (Hannibal)\n= 1 iff Jsmart\nK\nw,a (Hannibal) = dog w,a (Hannibal) = 1\niff [λx.x is smart in w] (Hannibal) = [λx.x is a dog in w] (Hannibal) = 1\niff Hannibal is smart in w and Hannibal is a dog in w.\nKw,a\n(8)\nJHannibal is who Shelby saw t\n= who Shelby saw t w,a(JHannibalKw,a)\n=\nJ\nJwho Shelby saw t\nK\nw,a (Hannibal)\n= λx.JShelby saw t w\nK\n,x (Hannibal)\n= JShelby saw t w,Hannibal\n= [Jsaw w,Hannibal(Jt w,Hannibal)]( Shelby w,Hannibal)\n= [Jsaw\nK\nw,Hannibal (Hannibal)] (Shelby)\n= [(λx. λy. y saw x in w) (Hannibal)] (Shelby)\n= [λy. y saw Hannibal in w] (Shelby)\n= 1 iff Shelby saw Hannibal in w.\n7. Problem Set #6\nUsing the sample calculations as a model, calculate the truthconditions (starting\nwith an arbitrary filler a and an arbitrary world w) for the following sentence:\nHannibal is a dog who t saw Shelby.\nFor each step of your calculation, give an annotation of what justifies the step (lexicon\nentry, the FA, PA, PM principles, the definition of the λnotation)."
    },
    {
      "category": "Resource",
      "title": "ps6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/7fdf9b83beaf5a4e030e177f9020e26f_ps6.pdf",
      "content": "Problem Set #6\nPROBLEM SET #6\nRead the two page handout (system.pdf) giving an overview of the system\nUsing the sample calculations as a model, calculate the truth-conditions (starting with an arbitrary\nfiller a and an arbitrary world w) for the following sentence:\nHannibal is a dog who t saw Shelby.\nFor each step of your calculation, give an annotation of what justifies the step (lexicon entry, the\nFA, PA, PM principles, the definition of the λ notation)."
    },
    {
      "category": "Resource",
      "title": "ps7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/b2b9d5d8069b4e8c45808a86ee4c5eba_ps7.pdf",
      "content": "Problem Set #7\n\nWed, 6 Apr 2005: Problem Set #7, due next Wednesday at noon.\n\nConsider an example with one definite description embedded in another:\n\nThe killer of the black cat escaped.\n\n1. Draw the syntactic structure of this sentence. Make sure that you\ndraw a structure that is interpretable in our system.\n\n2. Describe three possible states of affairs:\n\n- one where the sentence is false;\n- another one where the sentence has no truth-value because \"the\nblack cat\" does not refer to anything;\n- a third one where the sentence has no truth-value, but this time\nbecause \"the killer of the black cat\" does not refer to anything\neven though \"the black cat\" does\n\n3. Give a lexical entry for \"killer\", which will work in this sentence\n(for this, you will have to think about the semantic composition of\nthe sentence, but you don't have to hand in the entire calculation\n-- just give the meaning for \"killer\")"
    },
    {
      "category": "Resource",
      "title": "ps8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/927e785ea2a5b779b6c8d57b74e63f68_ps8.pdf",
      "content": "Problem Set #8\n\nThe eighth and final problem set, due next Wednesday (4/20) at noon:\n\nFor each of the quantifiers\n\n\"two\", \"several\", \"a few\", \"between three and six\", \"most\", \"exactly three\", \"at most five\",\n\ndetermine\n\n(i) what their monotonicity properties are (most importantly, are they downward\nmonotone with respect to one or both of their argument predicates),\n\n(ii) whether they license NPIs in one or both of their argument predicates, and\n\n(iii) whether any of the facts you establish constitute a problem for the Fauconnier-\nLadusaw Hypothesis (that NPIs are licensed in downward monotone positions).\n\nAnswers to (i) and (ii) could be given in a table.\nAnswers to (iii) should be in a succinct paragraph or two."
    },
    {
      "category": "Resource",
      "title": "grice_cheatsheet.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/0a1afef152e2bab1ef822683df935a53_grice_cheatsheet.pdf",
      "content": "24.903 Grice Cheatsheet\nThe following is meant to replace the calculation on p. 201-202 of Portner's book.\n[Changes are highlighted with italics.]\n\"It's possible that there's life on Mars\"\nSpeaker's meaning: It's not certain that there's life on Mars.\ni S uttered \"It's possible that there's life on Mars\" to H.\nii S is not acting in a play, under the influence of drugs, or the like; S knows that\nH speaks English, is attending to what he says, etc.; S knows that H knows all of\nthis. And so S is apparently speaking with the intention to mean something by\nthe utterance.\niii By the cooperative principle, H can assume that S is behaving rationally and\ncooperatively.\niv One aspect of behaving rationally and cooperatively is conformity with the maxim\nof quality.\nv The semantic meaning of S's utterance is that it is possible (perhaps certain) that\nthere's life on Mars.\nvi There is no reason to believe that S is flouting quality by speaking ironically or\nthe like.\nvii Therefore, H can conclude that S intends to communicate that it is possible\n(perhaps certain) that there's life on Mars.\nviii Another aspect of behaving rationally and cooperatively is conformity with quan\ntity maxim (a).\nix So H can assume that S intends to provide as much information as is required for\nthe purposes of the exchange.\nx S and H are discussing whether there is life on Mars. For these purposes, it is\ncooperative (by quantity (a)) for S to give all information pertaining to how likely\nit is that there is life on Mars.\nxi If S is convinced that it is certain that there is life on Mars, this is relevant.\nxii Therefore, if S was convinced that it was certain that there is life on Mars, he\nwould have said \"It is certain that there is life on Mars\", or the equivalent.\nxiii S did not say \"It is certain that there is life on Mars\", or the equivalent.\nxiv Therefore, H can conclude that S is not convinced that it is certain that there is\nlife on Mars.\nxv (The following only applies in a context where S can be assumed to be maximally\nopinionated about the topic under discussion) H assumes that S is maximally opin\n\nKai von Fintel: 24.903 Grice Cheatsheet\nionated on the topic. That is, either S is convinced that it is certain that there is life\non Mars or S is convinced that it is not certain that there is life on Mars.\nxvi Since by xiv S is not convinced that that it is certain that there is life on Mars, H can\nconclude that S is convinced that it is not certain that there is life on Mars.\nxvii All of this reasoning is pretty easy, and so H can assume that S expects for H to\ngo through this reasoning.\nxviii Therefore H can conclude that S intends to communicate that it is not certain\nthat there is life on Mars.\nxix Steps vii and xviii together allow H to conclude finally that S intends to commu\nnicate that it's possible, and not certain, that there's life on Mars.\nxx Whether or not H will believe that S is right and conclude that in fact it is possible\nbut not certain that there's life on Mars, depends on whether H trusts that S's opinions\nare accurate."
    },
    {
      "category": "Resource",
      "title": "grice_maxims.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/254775f37d06343157e0be2ba01266ba_grice_maxims.pdf",
      "content": "Grice's System\nThe Cooperative Principle\nMake your conversational contribution such as is required, at the stage at which\nit occurs, by the accepted purpose or direction of the talk exchange in which\nyou are engaged.\nThe Maxims\nQuantity:\n1. Make your contribution as informative as is required.\n2. Do not make your contribution more informative than is required.\nQuality:\n1. Do not say what you believe to be false.\n2. Do not say that for which you lack adequate evidence.\nRelation:\nBe relevant.\nManner:\n1. Avoid obscurity of expression.\n2. Avoid ambiguity.\n3. Be brief.\n4. Be orderly.\nWorking out an implicature\nHe has said that p, there is no reason to suppose that he is not observing the\nmaxims, or at least the Cooperative Principle; he could not be doing this unless\nhe thought that q; he knows (and knows that I know that he knows) that I can\nsee that the supposition that he thinks that q is required; he has done nothing\nto stop me thinking that q; he intends me to think, or is at least willing to allow\nme to think, that q; and so he has implicated that q."
    }
  ]
}