{
  "course_name": "Law, Social Movements, and Public Policy: Comparative and International Experience",
  "course_description": "This course studies the interaction between law, courts, and social movements in shaping domestic and global public policy. Examines how groups mobilize to use law to affect change and why they succeed and fail. The class uses case studies to explore the interplay between law, social movements, and public policy in current areas such as gender, race, labor, trade, environment, and human rights. Finally, it introduces the theories of public policy, social movements, law and society, and transnational studies.",
  "topics": [
    "Social Science",
    "Economics",
    "Labor Economics",
    "Political Economy",
    "Legal Studies",
    "Political Science",
    "Comparative Politics",
    "Sociology",
    "Social Justice",
    "Society",
    "Gender Studies",
    "The Developing World",
    "Social Science",
    "Economics",
    "Labor Economics",
    "Political Economy",
    "Legal Studies",
    "Political Science",
    "Comparative Politics",
    "Sociology",
    "Social Justice",
    "Society",
    "Gender Studies",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nMIT students must obtain the permission of the instructor. (OCW users do not need permission to use the materials.)\n\nCourse Description\n\n2011 has been a year of protests, from the Arab spring to Occupy Wall Street. Indeed, the past three decades have witnessed a proliferation of social movements, organized around a range of interests, identities and issues, within several countries as well as across state boundaries, globally. This intensification of mass action has thrown received paradigms of public policy into crisis, partly because these paradigms were mostly intended to operate in controlled or elite-driven policy environments. Many of these social movements have increasingly, if not always consistently, resorted to law and legal institutions, in their attempt to influence public policy at the local, national and global levels, while many other movements have confronted the State and law and tried to force change outside or against law. Why do some movements resort to the law, and what impact does it have on movements' goals, strategies and effectiveness? Why do some movements avoid law or even confront them and even when they do so, are they ever free of the shadow of law? Why do some movements resort to the law more and why do some succeed using the law while others don't?\n\nThis course will explore the relationship between law, social movements and public policy by asking several questions including: how is public policy generally believed to be made? What is the role of law and legal institutions such as courts and government agencies in that process? Does the formal existence of legal rights matter? How is public policy made and what is the role of social movements in that process? Is social change generated and sustained by law primarily or by social movements? How important is the role of social movements for the generation and implementation of public policy? By asking these and other questions, this course attempts to provide a contextual perspective on how laws and legal institutions can be more effectively used by social movements to influence public policy and thereby address issues of social justice, and how law and legal institutions need to be reworked sometimes to achieve movements' goals.\n\nAfter an introduction to theoretical frameworks on social movements, law and public policy, the first half of the course will be devoted to an in-depth examination of the experience of law and legal institutions in two large democracies with active judiciaries and a history of social movement culture: the US and India. We will look at how social movements organized around issues such as the labor, environment, human rights, gender and poverty/welfare/social justice tried to influence public policy through the law. Do these movements function mostly in a domestic legal terrain? The second half of the course will examine emerging global public policy in several areas including human rights, trade, development and environment and the increasing contestation between social movements and global economic institutions such as the World Trade Organization, the World Bank and the International Monetary Fund, and the role of law in this process. Do these movements engage mostly with international law?\n\nThe purpose of this course is to examine the 'ground' conditions under which law and legal institutions contribute to social change through their impact on public policy. Through this approach, the course aims to provide students a critical understanding of the range of legal tools and methods used in a variety of public policy settings, and the circumstances under which they sometimes fail or succeed.\n\nCourse Requirements and Grading\n\nThis course will be structured around lectures/presentations by the instructor and a few visitors. There will be a field-based class project, focusing on Occupy Wall Street and its relationship to law and legal institutions. This course requires active student participation in discussions and therefore the students are expected to read all the assigned readings carefully and prepare to be called upon in class. Late submissions will not be graded.\n\nAttendance is required in all classes and absences without prior notification to the instructor will affect grading since class participation is a critical component of grading. 3 such absences without prior notification will result in an automatic 'fail' grade.\n\nUndergraduates\n\nACTIVITIES\n\nPERCENTAGES\n\n2 short papers\n\n50%\n\nField based class project\n\n30%\n\nClass participation\n\n20%\n\nGraduate Students\n\nGraduate students who take this course need to write a final paper on a research topic that they identify in consultation with the instructor. This topic should relate to a social movement and its relationship to law and legal institutions in a country (India and US can be chosen but need to focus on a movement not covered in class), or at the global level, and must be based on independent research. Late submissions will result in a fail grade.\n\nACTIVITIES\n\nPERCENTAGES\n\nFinal paper\n\n50%\n\nField based class project\n\n30%\n\nClass participation\n\n20%\n\nRequired Books\n\nRosenberg, Gerald.\nThe Hollow Hope: Can Courts Bring About Social Change?\nUniversity of Chicago Press, 2008. ISBN: 9780226726717.\n\nO'Brien, Robert, Anne Marie Goetz, et al.\nContesting Global Governance: Multilateral Economic Institutions and Global Social Movements.\nCambridge University Press, 2000. ISBN: 9780521774406. [Preview with\nGoogle Books\n]",
  "files": [
    {
      "category": "Resource",
      "title": "The seed is mine… Only the land is theirs.",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-166-law-social-movements-and-public-policy-comparative-and-international-experience-spring-2012/5589242df5b368dcaa59e877262f4748_MIT11_166S12_studentpaper.pdf",
      "content": "\"The seed is mine... Only the land is theirs.\"\nSocial movements, law, and public policy for land and housing in South Africa\n\n11.496 Law, Social Movements, and Public Policy\n20 May 2012\n\nIntroduction: A search for values\n\nKas Maine was a sharecropper in the Transvaal region of South Africa who lived\nfrom 1894-1985. He lived much of his life as a relatively successful farmer, building\nrelationships with other black farmers, as well as poor and rich white farmers,\nbusinessmen, and bureaucrats. Often such alliances were of a collective nature. For\nexample, in the mid-1960s, Maine was part of a group of black farmers resisting a\ngovernment ordered relocation. The faction called itself Sofasonke, which means, \"we all\ndie together.\"1 More broadly speaking, these relationships, characterized by a mix of\ncollaboration and conflict, action inside and outside of the strictures of the law, were\nnecessary to navigate the complex ways in which Apartheid limited his social and\neconomic life. In 2002, when contemporary social historian Charles Van Onselen wrote\nhis exhaustive account of Maine's life, he prefaced his story as follows:\nGerman historian Meinecke warned us more than half a century ago, that \"behind the\nsearch for causalities there always lies, directly or indirectly, the search for values.\"\nContemporary South African values evoke hope and despair in equal measure. Perhaps\nthere could be no other way for we are in the adolescence of our nationhood.2\n\nThe \"search\" -- indeed, the struggle -- for values was at the forefront of the\ntransition to democracy heralded by the country's first democratic elections in 1994. The\nConstitution produced through negotiations between a range of political parties in the\nthree years leading up to the election has been heralded around the world as a model for\n\n1 Charles Van Onselen, The Seed Is Mine: The Life of a South African Sharecropper, 1894-1985,\n(Johannesburg, South Africa: Jonathan Ball Publishers, 2005), 463.\n2 Ibid, vii.\n\nforegrounding civil and socio-economic rights as the basis of South Africa's democratic\ndispensation. 3 Given the foundational history of dispossession from land that\ncharacterized the experience of non-whites under colonial and then Afrikaner nationalist\nrule4, the significance of rights to land and housing were lost on very few. The \"new\"\nSouth Africa would be characterized by a fundamental shift in social values.\n\nThese rights held and, for many, continue to hold great promise. The campaign\nslogan of the ruling African National Congress (ANC) -- \"a better life for all\" -- seems\nto sum up this hope. Have these hopes been fulfilled? Formal unemployment is\napproximately 24%, and the rate of youth unemployment is double this figure.5 Half the\npopulation lives below the poverty line.6 13.4% of South African households live in\ninformal settlements, on land that they do not officially own.7 In short, socio-economic\nopportunity has not yet become available to all, or even the majority of South Africans in\nthe country's rights-based democratic era.\n\nWith respect to the particular issues of access to land and housing, the numbers\nspeak volumes. In 1994, there were approximately 300 informal settlements. In 2009,\nthere were approximately 2,600. These settlements are home to somewhere between 1.1\n\n3 Tshepo Madlingozi, \"Post-Apartheid Social Movements and the Quest for the Elusive 'New' South\nAfrica,\" Journal of Law and Society, Vol. 34, No. 1 (2007): 77-8.\n4 This has been documented in many volumes of history and politics over the past century, but perhaps the\nfirst and still most powerful evocation of this experience was published a year after the passage of the\nNative Lands Act of 1913: Sol Plaatje, Native Life in South Africa, (Athens, OH: Ohio University Press,\n1996), first published in 1914.\n5 Abebe Aemro Selassie, \"South Africa's Unemployment Puzzle,\" iMFDirect Blog, April 4, 2011,\nhttp://blog-imfdirect.imf.org/2011/04/04/south-african-unemployment/\n6 Madlingozi, \"Post-Apartheid Social Movements and the Quest for the Elusive 'New' South Africa,\" 78.\n7 Kate Tissington and Lauren Royston, \"Urban Reform,\" Business Day, November 15, 2010.\n\nand 1.4 million households.8 This is despite the fact that since 1994, the South African\ngovernment has built approximately 2.7 million houses.9\n\nAmidst -- and sometimes because of -- these challenges of delivery, a range of\ninteractions between social movements, government institutions, and the courts, have\nproduced profound changes. These are changes in law, public policy, and implementation\nof arrangements to provide access to land and housing. This paper examines the types of\nmovements, and the strategies that they have utilized to achieve these changes. In the first\npart of the paper, I employ two particular theoretical frames to understand how this has\noccurred. The first is the \"political opportunity structures\" that have a) catalyzed and\nlimited the actions of social movements, and b) been generated by the actions of social\nmovements.10 The second is the extent to which social movements' actions in this arena\nhave reinforced or countered the \"hegemonic\" presence of the state vis-a-vis ordinary\ncitizens, understood through a Foucauldian notion of the state as an agent of\n\"governmentality\" that extends beyond the state itself.11\n\nSocial movements have used a range of strategies to counter and restructure\ndominant modes and effects of governance in the arena of land and housing. In the\nsecond part of the paper, I examine the basic institutional arrangements for delivery of\nlow-income housing. They are notable for top-down decision making, which supports\n\n8 South African National Upgrading Support Program (NUSP) Background document, 2010,\nhttp://upgradingsupport.org/background.html\n9 South African Government Information Service, \"Housing,\" 2012,\nhttp://www.info.gov.za/aboutsa/housing.htm\n10 Sidney Tarrow, \"States and opportunities: The political structuring of social movements,\" in\nComparative Perspectives on Social Movements : Political Opportunities, Mobilizing Structures, and\nCultural Framings , ed. Douglas McAdam, et al. (New York: Cambridge University Press, 1996), 42-5.\n11 Diana Mitlin, \"With and beyond the state -- co-production as a route to political influence, power and\ntransformation for grassroots organizations,\" Environment and Urbanization, 20 (2008), 356.\n\nprivate sector contractors to build fully serviced, \"top-structure\" houses. These are\nlocated overwhelmingly on the peripheries of cities, reinforcing Apartheid spatial divides.\nThe strategies that social movements use can be characterized broadly into two\ncategories: contestation of the state and collaboration with the state. In the third part of\nthe paper, I review the primary approaches that social movements in this arena have\nemployed. There is probably no social movement that can be said to fall solely into one\ncamp. Tactics that have been used in the category of contestation include illegal\n\"invasions\" of land to access land outside institutional avenues, legal challenges in the\ncourts to change policy, and protests on the street to deman implementation of existing\npolicy. Collaborative tactics include co-production of housing, land tenure, and basic\nservices between community groups and government institutions, as well as self-help.\nThese tactics have also been geared towards a mix of more effective implementation of\nexisting policy, and changing policy.\nFor the range of social movements, both contestation and collaboration have\nyielded important successes, but also presented significant pitfalls. In the final part of the\npaper, I assess how these different strategies of movement action have interacted within\nthe theoretical frameworks of political opportunity structures and hegemony/counter-\nhegemony. Strategies of contestation, especially in the courts, have put limits on the\nstate's policy possibilities, which, to a degree, have limited hegemonic overreach. At the\nsame time, these strategies have done little to challenge a political opportunity structure\nthat is still highly state-centered. Strategies of collaboration, especially through co-\nproductive arrangements have introduced significant dangers of co-option and further\nlayering of existing state hegemony. However, these strategies have also presented\n\npossibilities for deep institutional change that re-orients the state away from its most\nhegemonic tendencies. In turn, this enables the further flourishing of social movement\nactivity as a source of policy change, as well as an institutional mechanism for deeper\ndemocratic practice in South Africa.\n\n1. Political opportunities for hegemony and counter-hegemony\n\nEach state has its own particular dimensions and history that delimit political\nopportunity structures and define the boundaries of hegemony and counter-hegemony. In\nthe case of South Africa, it is instructive to view the current democratic state as very\nmuch rooted in a social movement history that precedes its current formal structure: the\nUnited Democratic Front (UDF). The UDF was made up of civic organisations, trade\nunions, and other citizen associations as a broad front against the Apartheid regime.\nHistorian Jeremy Seekings asks whether the UDF was an \"organization or a movement.\"\nGiven that it was not membership-based, and that linked organizations operated with a\nhigh degree of autonomy, he ultimately suggests that in its earlier formation from its\ninaugural conference in 1983 to 1986 was very much like that of a social movement:\nThe UDF was not a party, did not have branches, and never allowed for\nindividual or personal membership... Having the form of a front facilitated\neffective activity over agreed, specific and discrete issues, whilst preserving the\nformal autonomy of affiliates. Organisations could affiliate even though they\ndisagreed with other affiliates over broad ideals or even over the strategies they\nused in their individual activities. This loose form represented a choice on the\npart of the UDF's founders, an acknowledgment of the fragmentation,\nvulnerability and diversity of South Africa's extra-state opposition.12\n\nYet by 1990, when the National Party-led government unbanned the ANC and began\nnegotiations to end Apartheid, the UDF was subsumed. Most structures of the UDF\n\n12 Jeremy Seekings, The UDF: A History of the United Democratic Front in South Africa, 1983-1991,\n(Cape Town, South Africa: David Philip Publishers, 2000), 15-6.\n\nquickly fell apart despite the argument from some quarters in the leadership that \"whilst\nthe ANC would assume 'national political leadership,' especially in negotiations with the\ngovernment, the UDF should continue to coordinate socio-economic struggles, help to\nbuild the ANC, and pull the political 'middle ground' into support for the ANC.\"13 As\nTshepo Madlingozi has argued, \"the hegemony of the ANC and its allies over the\nnational liberation struggle had devastating consequences for ideological and\norganizational diversity represented by grassroots organizations affiliated to the UDF.\"14\nSignificant features of this relationship of the ruling party to social movements and\norganizations have carried through to the democratic era.\n\nIt is therefore useful to preface a discussion of political opportunity structures and\nthe very nature of hegemony with the particularities of what we can now think of as\nprologue. This is despite the fact that movements like the UDF were so central to the\nstory of the anti-Apartheid struggle. Political opportunity structures is a theoretical\nstructure that suggests that policy, institutions and social organizations are involved\nrelationships bound by signals that emerge from their very interactions. Public policy is\ntherefore a key framing device for understanding the nature of these structures, and the\nconcept falls more or less in the purview of political science. Sidney Tarrow suggests\nfour different types of opportunity structures that fall within two broad categories:\n\"proximate opportunity structures\" and \"state-centered opportunity structures.\" The\nformer category focuses on \"signals that groups receive from their immediate policy\nenvironment or from changes in their resources or capacities.\" Within this category there\nare \"policy-specific opportunities\" in which public policy telescopes the political\n\n13 Ibid, 21.\n14 Madlingozi, Post-Apartheid Social Movements and the Quest for the Elusive 'New' South Africa, 85.\n\npriorities of collective action, and \"group-specific opportunities\" in which public policy\nenables or disables specific strategies of collective action. The latter category focuses on\nthe kinds of state forms that catalyze certain kinds of social movement action. Within this\ncategory, Tarrow suggests a view of \"cross-sectional statism\" in which different state\nforms enable different degrees of collective action within formal institutions. He also puts\nforth a view of \"dynamic statism\" in which \"entire political systems undergo changes\nwhich modify the environment of social actors sufficiently to influence the initiation,\nforms, and outcomes of collective action.15\n\nTaken together, these four categories offer a reasonably comprehensive view of\nthe kinds of interactions that have taken place between social movements for land and\nhousing and the government in South Africa's post-Apartheid period. The history of the\nUDF and the ANC is relevant here insofar as the conditions for especially the \"state-\ncentered opportunity structures\" that exist now emerged from an earlier time. The formal\npolitical party that would become the rulers of the state -- the ANC -- essentially\ndelimited the nature of \"cross-sectional statism\" in South Africa. Social movements --\nembodied and contained within the broad banner of the UDF -- could affect policy only\ninsofar as they marshaled support for the formal structures of the state in waiting: the\nANC itself. However, the story of land and housing in South Africa also suggests great\nsignificance of the \"dynamic statist\" view. State policies have changed in interaction with\nsocial movements, which has, in turn, caused changes in the form and function of both\nthe state and social movements.\n\nWe therefore turn to the theoretical notion of hegemony and counter-hegemony to\ngive a frame for understanding exactly what these forms and functions mean. In large\n\n15 Tarrow, \"States and opportunities: The political structuring of social movements,\" 42-5.\n\npart, this notion is rooted in alternative ideas about the relationship between the state and\ncivil society, which has drawn special attention in the field of anthropology. As Aradhana\nSharma and Akhil Gupta argue, \"Anthropology's focus on particular branches and levels\nof state institutions enables a disaggregated view of 'the state' that shows the\nmultilayered, pluri-centered, and fluid nature of this ensemble that congeals different\ncontradictions. The anthropological project attempts to understand the conditions in\nwhich the state successfully represents itself as coherent and singular.\"16 Though political\nscientists have often constructed the state as distinctly separate from other elements of\nsociety, the alternative view suggests the discursive foundations of such a sense of\ncoherence. \"Once we see that the boundary between the state and civil society is itself an\neffect of power, then we can begin to conceptualize 'the state' within (and not\nautomatically distinct from) other institutional forms through which social relations are\nlived, such as the family, civil society, and the economy.\"17\n\nOne potential effect of social movements, then, is to challenge the extent to which\nthe state gains domain in these other \"institutional forms.\" This paper will not make an\nexhaustive definition of all social movements. As the second part will demonstrate, there\nare a range of movements with different social roots and activist strategies. Still, such\ncollective groupings and the activities that they pursue do expose -- if not always\nchallenge -- the notion of \"the state as the ultimate seat of power.\" In this sense, they are\na practical social force that highlight the theories first elucidated by Michel Foucault\nabout the \"etatisation of society.\" As Sharma and Gupta put it, this view \"enables us to\n\n16 Aradhana Sharma and Akhil Gupta, \"Introduction: Rethinking Theories of the State in an Age of\nGlobalization,\" in eds. Sharma and Gupta, The Anthropology of the State: A Reader, (Malden, MA:\nBlackwell Publishing, 2006), 9-10.\n17 Ibid, 9.\n\nexamine the dispersed institutional and social networks through which rule is coordinated\nand consolidated, and the roles that 'non-state' institutions, communities, and individuals\nplay in the mundane processes of governance.\"18\n\nThough somewhat simplified, this is what I mean by the concepts of hegemony\nand counter-hegemony. As Rajni Kothari has put it, \"The state in the Third World,\ndespite some valiant efforts by dedicated leaders in a few countries, has degenerated into\na technocratic machine serving a narrow power group that is kept in power by hordes of\nsecurity men at the top and a regime of repression and terror at the bottom.\"19 One need\nnot subscribe to extremities of this dystopian view to get a sense of the ramifications of\n\"etatisation.\" Rather, it allows us to get a sense of the kind of power structures that social\nmovements engage, to varying degrees. They also engage these structures to varying\ndegrees of contestation both as a matter of tactics and as a matter of desired outcome. The\nlatter type of contestation is what I mean by counter-hegemony. That is, counter-\nhegemonic struggle is aimed at the furthering of what Kothari calls \"grassroots politics\"\nwhich are a vision of a \"just society\": \"A decentralized order through which the masses\nare empowered, not decentralization in the sense of some territorial scheme of devolution\nof functions and resources to lower levels but decentralization in which the people are the\ncenter.\"20\n\nTaken together, the concepts of a political opportunity structure and hegemony\nsuggest that we can analyze social movements through lenses that require us to:\n\n18 Ibid.\n19 Rajni Kothari, \"Masses, Classes and the State,\" in ed. Ponna Wignaraja, New Social Movements in the\nSouth: Empowering the People, (New Delhi, India: Sage Publications, 1993), 64\n20 Ibid, 74.\n\na) consider the effect of strategies and tactics on further possibilities of social\nmovement activity,\nb) consider the ways in which social movements alter the \"mundane\nprocesses of governance\" that, in fact, constitute the phenomenon of\n\"etatisation,\"\nc) consider the extent to which these first two factors amount to a counter-\nhegemonic process that brings both resources and decisions about these\nresources much closer to a people-centered order.\nThe case of South African social movements for land and housing are instructive along\nthese three analytical questions precisely because they do not provide clear-cut answers\nto any of them.\n\n2. \"A Better Life For All\": The Limits of the State\n\nWe first turn to the formal institutional components of the state with respect to\nland and housing that delimit the political opportunity structures in which social\nmovements operate. These components help us to understand the particular nature of\nhegemony in this arena, and the ways in which social movements engage in counter-\nhegemonic practice. South Africa's state institutions for land and housing exemplify quite\nwell Foucault's notion of \"etatisation.\" Land and housing are both communal and\nindividual in nature, closely tied to families, and fundamental social ties. In South Africa,\nthe dominant institutions for delivery of housing for the poor, and methods of providing\nland to the poor are wrapped up in a neoliberal policy formula first introduced in 1996\ncalled Growth Employment and Redistribution (GEAR). Sebastiana Etzo argues that\n\nGEAR exemplified the market-oriented underbelly of the redistributional oratory of the\nruling ANC: \"While the rhetoric of 'a better life for all' reverberates in the ANC's\npolitical discourse, GEAR expresses a market-driven vision of development that values\nefficiency and relies on growth as its driving force. Development is essentially\nunderstood as 'delivering,' while local government is the instrument employed to\ndeliver.\"21\nIn fact, in the housing sector, we perceive the contours of dominant market-\noriented institutional relations promoted throughout much of the developing world:\ndecentralization of formal institutional responsibility, private-sector outsourcing of\nservice provision, and diffuse lines of accountability. There are three main aspects of\nthese arrangements that are relevant for the purposes of this discussion: (1) the top-down,\nprivate-contractor delivery of fully-serviced top-structure houses, (2) provision of land on\nperipheries of cities, and (3) mixed responsibility for implementation between provincial\ngovernment (houses) and local government (basic services).22\nThere are many other characteristics of the institutional arrangements for housing\ndelivery, and that critics of South Africa's housing policy have enumerated. But these\nthree characteristics are particularly notable for their relationship to the political\nopportunity structures that shape social movement action. The top-down delivery\napproach, whereby the state conceives and manages projects, and procures private\ncontractors, is tied to a broader paradigm for service delivery in the country. The\n\"poverty alleviation\" discourse is tied closely to this approach. It is this rhetoric that\n\n21 Sebastiana Etzo, \"The unfinished business of democratization: struggles for services and accountability\nin South African cities,\" Democratization, Vol. 17, No. 3 (2010), 565.\n22 Mary R. Tomlinson, \"From 'quantity' to 'quality': Restructuring South Africa's housing policy ten years\nafter,\" International Development Planning Review, Vol. 28, No. 1 (2006), 91\n\ncomprises one angle of the opportunity structure, as such language seems to discount the\nrole of social movements. As AJ Bebbington, et al. have argued, \"most social movements\nsay little, directly about poverty, and very few social movements emerge on the basis of a\npoverty discourse.\"23\nSuch policies make up what Tarrow has called the \"proximate opportunity\nstructure,\" whereby social movements organize with respect to signals that their\nconstituencies \"receive from their immediate policy environment.\" 24 The poverty\ndiscourse characterizes this environment: a view that individuals will receive houses\nthrough the individual housing subsidy, first articulated in policy in Reconstruction and\nDevelopment Program (RDP), and that land title will be similarly individualized. Social\nmovement action is inherently collective, but is interacting with an individualized view of\npoverty in the land and housing sector: \"Notwitshanding the fact that labour market\ndynamics continue to be the primary source of poverty and inequality in South Africa,\nthese areas of collective consumption have drawn most movement activism.\"25\nThe wrinkle here is that not only are movements responding to the policy\nenvironment, but also the bureaucratic structures that implement policy. The dominant\npolicy intervention -- fully-serviced top-structure housing delivery -- inhibits\ncommunity-based collective action. The subsidies are administered through provincial\ngovernment structures, with housing departments that plan housing developments\nthrough ward councilors that have little democratic accountability to their purported\nconstituents. Local government is responsible for providing basic services for housing\n\n23 A.J. Bebbington, D. Mitlin, J. Mogaladi, M. Scurrah, C. Bielich, \"Decentring Poverty, Reworking\nGovernment: Social Movements and States in the Government of Poverty,\" Journal of Development\nStudies, Vol. 46, No. 7 (Aug. 2010), 1304.\n24 Tarrow, \"States and Opportunities,\" 42.\n25 Bebbing, et al. \"Decentring Poverty, Reworking Government,\" 1305.\n\nprojects, but do not manage housing projects themselves. This is mixed bureaucratic\nmanagement strategy of formal decentralization to the local level, but with significant\ncompetencies located at higher levels that reduce the potential for influential project\nplanning at the city level, let alone the community level. The clientelist, and, in many\ncases, overtly corrupt relationships that emerge between ward councilors, local\ngovernment and provincial government are, in part, a result of the lack of devolution of\nreal decision making power to accountable community structures.26\nFurther, the most recognized civic movement in formal circles, the South African\nNational Civics Organization (SANCO), itself an outgrowth of UDF structures, is largely\nperceived to be largely unaccountable to communities. SANCO branches exist in a vast\nnumber of informal settlement communities and often validate the actions of ward\ncouncilors and higher up local officials. But Richard Pithouse, amongst others, has\nargued that SANCO's historic relationship to state structures, and especially the ANC,\nmake it an agent of top-down delivery rather than grassroots pressure: \"When the ANC\nopened their offices in Johannesburg after they were unbanned in 1990, a huge banner in\nthe foyer declared, 'Occupy the Cities!' ANC aligned settlement committees were\nexpected to affiliate themselves to the SANCO and were thus brought under direct part\ncontrol.\"27\n\n26 Benjamin Bradlow, Joel Bolnick, and Clifford Shearing, \"Housing, Institutions, Money: The Failure and\nPromise of Human Settlements Policy and Practice in South Africa,\" Environment and Urbanization, Vol.\n23, No. 1 (2011), 271-2.\n27 Richard Pithouse, \"A Politics of the Poor: Shack Dwellers' Struggles in Durban,\" Journal of Asian and\nAfrican Studies, Vol. 43, No. 1 (2008), 70.\n\nFinally, the provision of land on the peripheries of cities reinforces structural\nexclusion of the poor through spatial divides.28 This means that not only are the poor\noften being moved from reasonably well-located land where they do not have title, do\nmuch less economically viable locations where they do have title. The logic of \"banking\nthe unbanked\" or \"titling the untitled\" trumps a logic that would suggest a more holistic\nsense of inclusion in economic opportunities.\n\nTake together, these three features of the housing delivery apparatus -- top-down,\nindividualized delivery, peripheral land, and stratified relationships between scales of\ngovernment -- suggest the contours of the second type of Tarrow's political opportunity\nstructures: \"state-centered opportunity structures.\" Social movements have struggled to\nfind space within formal institutions to access their claims, which we can ascribe to the\nspecific brand of \"cross-sectional statism\" in the South African context.29 But what of the\nhegemonic \"etatisation\" of society? It is difficult to elucidate this phenomenon without\nunderstanding the extent to which social movements have acted within a context of\n\"dynamic statism,\" in which specific political opportunities arise precisely because of the\ninteraction between social movements and the state. We have seen the broad contours of\nstate policy and bureaucratic directions and discourses. But the extent of hegemonic\ninfluence of Foucauldian \"governmentality\"30 of land and housing in South Africa is, in\nmany ways, best understood through the character, strategies and tactics of social\nmovements acting in this arena.\n\n28 Marie Huchzermeyer, \"The struggle for in situ upgrading of informal settlements: a reflection on cases in\nGauteng,\" Development Southern Africa, Vol. 26, No. 1 (2009), 64.\n29 Tarrow, \"States and opportunities,\" 43-4.\n30 Diana Mitlin and David Satterthwaite, \"Strategies for grassroots control of international aid,\"\nEnvironment and Urbanization, Vol. 19, No. 2 (2007), 489.\n\n3. \"The dog doesn't bite while it's chewing\": social movement strategies and tactics\n\nA saying of one social movement for land and housing in South Africa, known\nsimply as the Informal Settlement Network (ISN), is an isiZulu phrase: \"ayilumi ma\nihlafuna.\" This translates into a strange but instructive euphemism: \"the dog doesn't bite\nwhile it's chewing.\" The slogan is meant to suggest to those participating in the ISN that\npoliticians and officials do not have their proverbial \"eye on the ball\" and are susceptible\nto change if the movement is prepared for action.31 In a sense, the phrase encapsulates the\nnotion of social movements acting within and to alter political opportunity structures. But\nfor many movements, the ways in which to catch the government in an alternative,\ncounter-hegemonic logic, manifests in both the strategies and the claims that movements\nmake. This paper focuses on two broad categories of strategies: contestation and\ncollaboration. The claims that movements make are much less easily categorized, as they\nare caught up in the mix of strategies that nearly all movements employ. This mix of\nstrategies itself echoes characteristics of a state that is anything but monolithic or even\ncoherent. As Bebbington, et al. put it, \"South African movement organizations have to\nrespond to multiple ideological and pragmatic faces of a state which, within and between\ndifferent program areas, can be simultaneously neo-liberal and pro-market,\ndevelopmentalist and redistributive, bureaucratic and regulatory, clientelist and self-\ninterested.\" 32Significantly, both types of strategies appear to exhibit tendencies that\nsometimes reinforce hegemonic etatisation of society and otherwise advance alternative\ncounter-hegemonic social frameworks.\n\n31 uTshani Buyakhuluma, Issue 1, February 2011.\n32 Bebbington, et al, \"Decentring Poverty, Reworking Government,\" 1313.\n\nNearly all social movements in this arena engage in some strategies of\ncontestation. There are three main tactics that are involved in this strategy: street protests,\nland invasions, and battles in the courts. Street protests, often described in the popular\npress as \"service delivery protests,\" are increasingly common in South Africa. These are\ngenerally at the community level, sometimes through more widely-coordinated social\nmovements and sometimes not. They often manifest through violent or spectacular\ndisplays of anger such as burning of tyres, blocking roads, and sometimes destruction of\nproperty. According to Municipal IQ, a municipal government monitoring think tank, the\npace has been on the rise since approximately 2004, when President Thabo Mbeki was\nelected to his second and final term. There were 35 such protests in 2005, but by July\n2009, months after the election of current President Jacob Zuma, the number that year\nhad already reach 21.33 The explanations for these protests have actually been rather\ndiffuse, with some arguing that they are tied to localized political considerations,\nespecially leading up to the local elections in 2010.\nBut the steady beat of street protest suggests that a deeper social spirit has\nemerged amongst the urban poor. The demands that surface are generally claim-making\non an existing order: ending corruption in housing subsidy allocation, and wider demands\nthat existing programs for delivering houses, services, and land perform better. This\ncomplicates a simple view of all protest as counter-hegemonic, for, the stated claims\nseem to uphold existing paradigms of \"governmentality.\" But the act of protest as a force\nfor showing discontent with the state also has its own logic and power. As Sebastiana\nEtzo argues,\n\n33 Fienie Gobler, \"Service delivery protests a 'warning sign' for government,\" Mail & Guardian\nnewspaper, 20 July 2009, accessed 19 May 2012, http://mg.co.za/article/2009-07-20-servicedelivery-\nprotests-a-warning-sign-for-govt\n\nThe growing popular discontent manifested in the past decade, which reached its peak a\nfew months after Jacob Zuma was elected president of the country in 2009, is framed\nwithin the context of a country that successfully transitioned to democracy and built solid\ndemocratic institutions. However, the consolidation process is undermined by the\ntensions and contradictions of a neoliberal strategy that, while favouring the emergence\nof a black middle class, does not respond adequately to the increasing social and\neconomic inequalities.34\n\nThe move to the streets over the past decade is full of mixed messages, many of which\nappear to uphold the basic logic of existing government programs. But the discontent is a\nbroader challenge. With demands framed firmly within the existing \"policy-specific\nopportunities\" of the \"proximate opportunity structure\" that Tarrow describes, the\ncommunities in the streets may indeed be creating a space that generates much more\nfundamental contests over both power and resources.\n\nLand invasions are a relatively more organized, though often underground form of\nprotest, which are often tied to social movement organization, at least in the post-\nApartheid context. Four of the largest and most well-known movements of the last two\ndecades have engaged notably with this strategy: the Landless People's Movement\n(LPM), Abahlali baseMjondolo (AbM), the Western Cape Anti-Eviction Campaign\n(AEC), and the South African Homeless People's Federation (SAHPF), which is now\nknown as the Federation of the Urban Poor (FEDUP).\nWe can characterize this tactic in a number of ways, and I want to focus on two,\nwhich are relatively complementary. First is what Marie Huchzermeyer has called\n\"human needs-led development.\"35 Of course, almost all informal settlements have a\nhistory rooted in some kind of land invasion, given that the land on which these\nsettlements lie is not formally titled to the occupants. Land invasion in this frame is a key\naspect of how the poor shift relationships that characterize city development. As Richard\n\n34 Etzo, \"The unfinished business of democratization,\" Vol. 17, No. 3, 565.\n35 Huchzermeyer, \"The struggle for in situ upgrading of informal settlements,\" 62.\n\nPithouse has described the work of AbM in the context of Durban, \"Urban planning has\nalways emerged from the balance of power between city authorities and popular\nforces.\"36 The notion of human-needs led development is therefore a response to the\nstructural inequality that excludes the poor from formalized land and housing.37 Such\naction is often part of a larger repertoire of direct actions undertaken by social\nmovements, such as reconnecting cut-off water and electricity connections, and the street\nprotests discussed above.38 These are actions that have been undertaken by al This is a\n\"state-centered opportunity structure,\" driven by the lack of legitimation by the state of\nthe land occupancy of the poor.\n\nAnother way to view land invasion is as a way to drive institutional change\nthrough subsequent engagement with authorities. SAHPF/FEDUP has used the tactic of\nland invasion towards such ends to a large degree. In October 2000, People's Dialogue, a\nNGO that worked closely with the FEDUP network, compiled a list of known land\ninvasions undertaken by groups linked to the network. They had occurred in 21\nsettlements throughout the country, including, in their initial phases (meaning prior to\n\"formalization\"), 8,045 families.39 No similar compilation of data on invasions exists for\nother movements, so it is worth examining the way in which it has occurred, as well as its\npotential for impacts on both law and policy.\n\nThe practice of extralegal invasion of land has been both an outside and inside\ngame. By keeping open the option of invasion, like other social movements, the FEDUP\n\n36 Pithouse, \"A Politics of the Poor,\" 72.\n37 Huchzermeyer, \"The struggle for in situ upgrading of informal settlements,\" 62.\n38 Bebbington, et al, \"Decentring Poverty, Reworking Government,\" 1313.\n39 Ted Baumann, Joel Bolnick and Diana Mitlin, \"The age of cities and organizations of the urban poor: the\nwork of the South African Homeless People's Federation and the People's Dialogue on Land and Shelter,\"\nInternational Institute for Environment and Development Working Paper 2 on Poverty Reduction in Urban\nAreas, 2001, 12.\n\nnetwork uses its methods of organization and housing development to challenge\nfundamental notions of ownership and property that the state has been unwilling to\nconfront. Negotiation with state authorities on the one hand -- a much more dominant\nstrategy for this network -- has both counterbalanced and been enabled by extralegal\ninvasion. The oral account of Agrinette Hills, an informal settlement leader in Gauteng\nprovince, illuminates the experience of invasion:\n\"We started to plan to invade. On the 19th of March (1997), we had a meeting. I\nspoke to the people. By then there were 516 members. I asked them if we should wait.\nAll the members said no, we should not wait. I asked the Federation leaders and People's\nDialogue. Mama asked me if I was scared. I said I was only scared of God. Then they\nsaid I should do it.\n\nSo on the night of the 20th (March) I moved onto the land. My boyfriend said\nthat he should stay behind with the children. So it was just me and the plastic. I put up a\nplastic. This first night, there were three women and four children. Just us alone. The next\nday some others came. There were maybe 20 of us. The others, they were scared that the\npolice would come with guns and dogs. Although there were many members they waited\nto see what would happen.\nThe council came to see us. They said we should get our things and go to\nEverton where they have sites. We said that we would not go there because the houses\nthey are too small. Then I told them that I would not go back to a shack. My mother had\ndied in a shack. There was a fire. All the shacks were burnt. I lost my family. Then they\nwere silent. They had nothing to say.\"40\n\nThe story is instructive because it suggests the personal and communal anguish of\nordinary people that accompanies this kind of action. Further, it suggests a complex\nrelationship with formal authorities, in this case, at the local level. Negotiation and\ninvasion are in constant interaction as a matter of tactics. Notably, the community did\neventually gain tenure to the land and access formal subsidies to build houses.\nEngagements between the FEDUP network, People's Dialogue and the national\nDepartment of Land Affairs in the mid to late-1990s were an attempt to reform the\nfundamental institutions that governed land tenure, so as to make land ownership more\nflexible for -- and accessible to -- the poor. The network developed an internal 24-point\n\n40 Baumann et al, \"The age of cities and organizations of the urban poor,\" 11-2.\n\nstrategic plan for accessing land, which included various legal and extralegal strategies.\nLand invasion was considered an option of last resort. This locates a tactic of contestation\nas part of a broader array of tactics that test the binary of contestation and collaboration,\nand indeed of hegemony and counter-hegemony.\nFurther, the Federation began to work with the Department of Land Affairs to test\nout alternative institutional mechanisms for coping with the lack of availability of tenured\nland for the poor. Between the years of 1996 and 1997, the FEDUP network and the\nDepartment of Land Affairs agreed to use 11 sites to test whether the existing\nbureaucratic mechanisms for obtaining land title were sufficient for the urban poor\ncommunities linked the FEDUP network to actually access tenure. This partnership did\nnot yield many results, which Baumann et al, have described as being due to the\npersistent inaccessibility of the relevant institutional bureaucracies.41\nDespite these shortcomings of individual actions by communities and social\nmovements in the realm of land invasions, there have been significant policy changes that\nreflect the kinds of pressure these strategies have brought to bear. The most significant is\nthe \"Breaking new Ground\" policy released by the Department of Housing in 2004. This\npolicy was the first indication that formal institutions might be ready to shift from the\ndominant paradigms of housing delivery enumerated above -- namely, fully-serviced\ntop-structure houses built by private contractors often on peripheral land. Instead, a more\nincremental, \"in situ\" approach to providing land and shelter would be the order of the\nday.42\n\n41 Ibid, 11.\n42 Tomlinson, \"From 'quantity' to 'quality',\" 85-7.\n\nBut until very recently there has been very little institutional support for\nimplementing this policy. In fact, Huchzermeyer's case study of municipalities in\nGauteng province suggests that municipalities have often actively avoided proper\nimplementation of the key Upgrading of Informal Settlements Program (UISP). She\nattributes this to the pervasiveness of the hegemonic logic of state craft, even and perhaps\nespecially at the local level:\n[Municipal officials] deal with informal settlements in the conventional project-linked\nsubsidy approach (based on subsidy eligibility of individual households), resulting in\nrelocation or at best disruptive 'shack shifting' or rollover upgrading, mostly with the\ndisplacement of non-qualifiers of the housing subsidy. Thus city officials consciously or\nunwittingly act as servants of orderly development, global competitiveness and the\nmarket, rather than as implementers of the transformative aspects of the Constitution and\nof progressive policy and legislation that has been developed to ensure the realisation of\nconstitutional rights.43\n\nIt is significant that scholars such as Huchzermeyer have cast policy changes like\nBreaking New Ground in the rights-based framework, not only because the changes have\nquite clearly occurred in a country with a prevalent rights-based dispensation. It is also\nsignificant because the difficulties of implementation suggest limitations of the rights-\nbased framework for counter-hegemonic struggle.\n\nWe therefore turn to the most clearly articulated site of rights-based struggle. The\nthird contestation-oriented strategy that social movements for land and housing have used\nis the pursuit of legal challenges in the courts. South Africa's rights-based constitution\nhas provided great opportunity to social movements to bring cases that might challenge\nthe type of policies that exist and the ways in which the policies get implemented. The\nfirst major challenge in the arena of land and housing is a Constitutional Court case from\nthe year 2000 called Government of the Republic of South Africa vs. Grootboom, which\nis commonly known simply as \"Grootboom.\" This case was brought by Irene Grootboom\n\n43 Huchzermeyer, \"The struggle for in situ upgrading of informal settlements,\" 65.\n\nand about 900 other members of the Wallacedence informal settlement in Cape Town to\nchallenge the municipality for access to land and housing. The case was premised on the\nkey socio-economic rights provision in this arena: Chapter 2. It states the following:\n(1) Everyone has the right to have access to adequate housing.\n(2) The state must take reasonable legislative and other measures within its available\nresources, to achieve the progressive realisation of this right.\n(3) No one may be evicted from their home, or have their home demolished, without an order\nof court made after considering all the relevant circumstances. No legislation may permit\narbitrary evictions.\n\nIn the case, the Constitutional Court ruled that the municipality should provide temporary\nhousing to the residents. It was hailed as a great victory for organized communities that\nwere able to bring their grievances to the court. However, as Huchzermeyer notes, the\nnotion of \"progressive realization\" of the right to housing -- that the state must commit\nthe financial and institutional resources to achieve the articulated socio-economic rights\nover time -- is hampered by the inadequacy of related rights: \"The realisation of the right\nto housing, in particular the location of such housing, is inextricably tied to fight to land,\nand is hampered by the constitutional protection of the extremely skewed existing\nproperty rights to land.\" In the case of Grootboom, the reality of victory was rather\nlimited. Grootboom herself died without a house. 44\n\nSo if the right to housing is often hamstrung by land management policies, what\nof rights more obviously related to land? A key legal provision that has been used by\nmany communities and social movements to prevent eviction from land whose\noccupation is not formally recognized is the Prevention of Illegal Eviction Act of 1998.\nThis act is often used to bring municipal governments to court for the routine relocations\nthat characterize a significant aspect of the vulnerability of the urban poor in South\n\n44 Marie Huchzermeyer, \"Housing rights in South Africa: invasions, evictions, the media and the courts in\nthe cases of Grootboom, Alexandra and Bredell,\" Urban Forum, Vol. 14, No. 1 (2003), 82-4.\n\nAfrica. In cases known as Alexandra and Bredell, both regarding informal settlement\ncommunities in Gauteng province, municipal justification for eviction was on grounds of\nhealth and safety. The so-called PIE act enabled communities to challenge the order on\nthe basis that municipalities did not follow proper consultative procedures. The former\ncase was settled out of court and the latter did not support the community's claim.45\nHowever, later judgments have supported similar claims. A key case is the\ncommunity of Harry Gwala settlement v. Ekurhuleni municipality. The settlement was\nlinked to social movements such as the Landless People's Movement and the Informal\nSettlement Network, and the case gained great publicity. This time the case was not about\neviction per se, but linked eviction with informal settlement upgrading. The settlement\nwas due to be removed because of geotechnical issues involved with the land that led it to\nbe deemed unfit for human habitation. However, provisions for alternative\naccommodation were not nearby -- an element of the PIE act -- and the Constitutional\nCourt ruled that in the meantime, the municipality would have to begin upgrading the\nsettlement, first with provision of toilets.46\nIn most legal cases, individual communities or people have been the primary\nplaintiff. A more recent case pitted a social movement directly against a provincial\ngovernment: Abahlali baseMjondolo v. Premier of KwaZulu-Natal in 2009. This case\nchallenged a 2007 law passed in the province of KwaZulu-Natal, which would have made\nit much easier for authorities to evict informal settlement dwellers. The law was struck\ndown by the Constitutional Court on the grounds of both the PIE act and the right to\n\n45 Ibid, 84-5.\n46 Huchzermeyer, \"The struggle for in situ upgrading of informal settlements,\" 66-9.\n\nhousing, which includes a provision against eviction.47 Perhaps the greatest significance\nof this case is the fact that a social movement, and not just a community, was able to\nbring a case to challenge policy in such a direct manner. The Constitutional Court's\nresounding decision in favor of AbM further validated the approach.\nThe challenge of forced eviction, however, remains an everyday reality for\ninformal settlement dwellers. The legal approach has primarily been used to mitigate the\nmost extreme uses of policy to extend the hegemonic, market-based logic of the state in\nmanagement of land and housing in cities. However, it has not changed the basic\nequation that continues to exclude the poor and subject them to oppressive and\nexclusionary rule, which manifests itself most violently in the form of evictions, which\ncontinue to take place. Contestation-based approaches have therefore provided important\nlimits to state action, and defined the countours of etatisation and hegemonic rule. But\nthe prospects of existing tactics in this strategic category do not, on their own, seem to\nexhibit the potential to counter this hegemony.\nWe therefore examine the experience of collaboration as a social movement\nstrategy to change law and policy in such an alternative direction. We can describe\ncollaborative tactics as primarily relationships with authorities to \"co-produce\" access to\nland, housing, and services, or what we might regard as \"self-help\" activities. The kinds\nof institutional changes that have occurred are the result of lengthy engagements and\nlearning that are not easily understood through snapshots in time. This is very much like\nthe way in which legal victories rarely have a one-to-one translation to transformative\npolicy outcomes.\n\n47 Niren Tolsi, \"Pooh-slinging Slums Act showdown at Con Court,\" http://www.mg.co.za/article/2009-05-\n16-poohslinging-slums-act-showdown-at-con-court, 16 May 2009, accessed 19 May 2012.\n\nThe FEDUP network is comprised of primarily women-led savings schemes in\nevery province in the country. At its height in the mid-200s, it incuded approximately\n80,000 active saving members. It now counts about 20,000 active members. Despite its\nsmaller size, its public policy accomplishments and institutional relationships continue to\nmake this a highly relevant movement in the study of social movements for land and\nhousing in South Africa. This network is linked to a wider global network of slum\ndweller \"federations\" that also define membership through such savings schemes, called\nShack/Slum Dwellers International (SDI), which is active in 33 countries in Africa, Asia\nand Latin America. The preponderance of emphasis for savings in the South African\ncontext has long been on housing, precisely because of the political salience of the right\nto housing in the specific opportunity structure of this country. Treasurers are elected\nfrom within the community to collect and manage money. The savings are collected\ndaily, weekly, monthly, and at intervals in between. Each scheme opens its own bank\naccount, with multiple signatories from within each scheme.\nIf we consider that three pillars of exclusion of the poor in cities lie in their\ninability to access financial power, planning and project implementation influence, and\npolitical voice, then we should evaluate the extent to which savings has been a tactic to\nchange this equation. Such a \"bootstraps\" method is not merely self-help, even though it\nmay appear as such. In fact, it is the pillar of a redistributional and sometimes counter-\nhegemonic strategy. In 1994, not two months after the country's first democratic election,\nHousing Minister Joe Slovo met with the FEDUP network and its NGO supporter called\nPeople's Dialogue at a national conference on housing finance. At the meeting, he\ncommitted to provide R10 million to initiate a revolving fund to be managed by the\n\nFederation to develop scalable mechanisms for providing affordable housing finance to\nthe poorest of the poor. This mechanism, known as the uTshani Fund was initially\nmanaged by staff of People's Dialogue on a daily basis, but with all executive decision-\nmaking authority vested in a board made up of a majority of shack dwellers in the\nFederation. The principles of the uTshani Fund were described in internal documents as\nfollows: \"Finance should be made available directly to housing savings schemes and the\nground work for the Fund should be undertaken at community level. According, uTshani\nFund develops systems which fit with the systems evolved by the savings schemes and\nnot the other way around.\"48\nThough Slovo had made a firm and flexible commitment, bureaucratic delays held\nup the initial flow of money from the government to the uTshani Fund until January\n1996. By this point, Slovo had passed away, and the top-down, contractor-driven\nmechanisms for \"service delivery\" had taken hold. Despite the delays, the Federation\npressured uTshani Fund to begin dispersing the funds in order to begin building houses.\nThis had been a major selling point of the Federation's mobilization strategy in much of\nthe country. But many pledged subsidy funds were not forthcoming. Of the R22,199,779\nthat had been repaid in loans to uTshani Fund in the year 200, only 51% had been\naccessed through government subsidy payments.49\nSo the challenges of achieving redistribtional change through the FEDUP network\nwas significant, but remains a mixed picture. At the level of policy, the network's\napproach of \"self-build\" housing delivery was one of the key initiatives that produced the\nPeople's Housing Process (PHP). This is a program within the Ministry of Housing (now\n\n48 Joel Bolnick, \"uTshani Buyakhuluma (The grass speaks): People's Dialogue and the South African\nHomeless People's Federation (1994-6),\" Environment and Urbanization, Vol. 8, No. 1 (1996), 164-5.\n49 Baumann, et al. \"The age of cities and organizations of the urban poor,\" 9-11.\n\nMinistry of Human Settlements) to funnel subsidy funds to community-based\norganizations like the Federation for building houses. This has been the only program to\ndate in a formal institutional setting that has challenged the dominant private contractor-\ndriven approach to housing delivery. To date, the Federation has built over 15,000 houses\nthrough such arrangements, which is the largest civil society initiative for house building\nin the country.50\nStill, bureaucratic challenges to mainstreaming PHP have persisted to this day.\nThe nature of the specific etatist regime in the housing sector is, in fact, elucidated in an\nearly internal government document from 1997. It describes the challenges to\nmainstreaming PHP in five main areas: 1) \"inability of the existing subsidy scheme\nprocedures to disburse subsidies to beneficiaries in a simple and accountable mmaner,\" 2)\n\"lack of appropriate capacity (understanding, recognition, skills, and confidence) at both\nprovincial and local government levels,\" 3) \"resistance by vested interst groups to\nsupporting people's housing processes,\" 4) \"insufficient support for skills acquisition and\nbuilding of organizational capacity within community-based groups,\" and 5) \"general and\nwidespread absence of trust and confidence by stakeholders in the ability of people to\nmeet their housing needs.\"51\n\nIn order to move beyond the narrow strictures of a housing subsidy system that\nwas clearly insufficient to meet the demands for both redistribution and political voice,\nthe FEDUP network, beginning in 2008, worked to initiate a broader-based movement\n\n50 Mark Swilling, \"Beyond Cooption and Protest: Reflections on the FEDUP Alternative,\" Mirjam Van\nDonk, Mark Swilling, Edgar Pieterse, Susan Parnell, eds. Consolidating Developmental Local Government:\nLessons From The South African Experience (Cape Town, South Africa: University of Cape Town Press,\n2008), 506.\n51 As quoted in Firoz Khan and Edgar Pieterse, \"The Homeless People's Alliance: Purposive Creation and\nAmbiguated Realities,\" Case Study for University of KwaZulu-Natal project entitled: Globalisation,\nMarginalization and New Social Movements in post-Apartheid South Africa (2004), 20.\n\ncalled the Informal Settlement Network (ISN). The ISN had a more open architecture\nthan the membership-based FEDUP savings schemes, and included community\nleadership from informal settlements that came together at city level. Instead of subsidy-\nbased housing development, the ISN worked with communities to put teeth in dormant\npolicy documents like Breaking New Ground, which prioritized incremental, in situ\ndevelopment of informal settlements. In Cape Town, the ISN began a set of 20 pilot\nprojects in partnership with the municipality to test such arrangements.52\n\nSuch a community-centered approach, which is central to the kinds of\nnegotiations that the ISN pursues in partnership with local government authorities, is\ninherently collaborative. Significantly, as the Federation and its partners deepen their\ncollaborations with government authorities, especially at the local level, they expose\nthemselves to the ever-present dangers of co-optation and exclusion of other actors that\nrepresent the urban poor. At the same time, they may yet hold the potential to open up\nspace for a more inclusionary order that can fundamentally alter the institutions that\nenable the exclusion that characterizes city development and planning in South Africa\ntoday.\n\n4. Finding and transgressing the lines of hegemony and counter-hegemony\nCollaborative tactics are sometimes overlooked in studies of counter-hegemonic\nsocial movements because they are seen as only reinforcing existing stratifications that\nexist within an etatist opportunity structure. It is worth considering contestation-based\nstrategies in tandem with collaborative strategies in order to get a broader sense of the\n\n52 Joel Bolnick and Benjamin Bradlow, \"Rather a Better Shack now than Wait Twenty Years for a Formal\nHouse\" - Shack Dwellers International and Informal Settlement Upgrading in South Africa,\" Trialog, Vol.\n104, No. 1 (2011), 39.\n\nways in which impacts on law and public policy actually occur through the full range of\nactions that social movements undertake. The strategic approaches discussed in this paper\nboth yield a mixed picture.\nLegal strategies have placed limits on the extent of hegemonic statecraft, by\nchallenging state agencies to enforce existing policy. The opportunity structures of\npolicy, and especially the socio-economic rights contained within the Constitution have\nbecome important levers that social movements have used to both access political voice,\nand achieve outcomes that limit the more oppressive elements of heterogeneously\nhegemonic state. But still, the fundamental relationships of the state and citizen that\ncharacterize this hegemony have not come under sustained challenge through legal\nstrategies. The demand is fundamentally about implementation of existing policy, not\nreorganization of relationships of government that concern access to land and housing.\nThis is all the more so with respect to the street protests that have increased in scale over\nthe last decade, with the caveate that the use of public space and articulation of\ngrievances may yet hold the potential for a more transformative agenda.\nThe demands for delivery have not changed the basic equation that the state\nmanages delivery from on high to a supplicant, waiting poor. This therefore calls into\nquestion the suggestion by Boaventura de Sousa Santos and Cesar Rodriguez-Garavito\nthat the \"victim's perspective\" is so central to \"subaltern cosmopolitan politics and\nlegality.\" Taking on the challenges of poverty and structural exclusion in the courts\narticulates communities and social movements as victims seeking redress from a system\nthat from the outset does not include them. Sousa Santos and Rodriguez Garavito's\n\narticulation of the inadequacy of \"participatory exercises in institutional imagination\"\nseems equally applicable in the legal sphere:\nBy default or design, those doing the imagining are the elites or members of the middle-\nclass with the economic and cultural capital to count as 'stakeholders.\" Either way, the\nprocess is a top-down one in which those at the bottom are either incorporated only once\nthe institutional blueprint has been fully laid out or are not incorporated at all.53\n\nThe courts have, in fact, been sites where the poor -- as individuals, as part of\ncommunities, and as part of social movements -- have been stakeholders, able to\nchallenge existing policy but not promote fundamental transformation. Indeed, the\nprovisions of the Constitution, on their face, seem to provide a transformative tool. But\nthe rights-absed framework promotes access to the human need of housing, not the\nalternative political reality of self-determination in the way that a counter-hegemonic,\nnon-etatist view conceives it. In turn, we can even argue that as social movements engage\nin legal battles they experience the same kind of incorporation against which Sousa\nSantos and Rodriguez Garavito warn. The \"victim's perspective,\" at least as articulated in\nthe courts, is therefore insufficient to build the exact kind of \"subaltern cosmopolitan\nlegality\" to which a counter-hegemonic process aspires.\n\nWhat appears to hold great potential -- and it is little wonder then that all major\nsocial movements in this arena have utilized this tactic -- is land invasion. Given that\nland ownership is such a prevailing mode of etatist control in South Africa's democratic\ndispensation, this tactic challenges the basic market logic of statecraft and\n\"governmentality.\" This is just an activist claim, but one with specific policy\nimplications. As Huchzermeyer has argued, what we can just as well call \"people-driven\nland acquisition\" is a method of bringing bureaucratic action much closer to the policies\n\n53 Boaventura de Sousa Santos and Cesar Rodriguez Garavito, \"Law, Politics and the Subaltern in Counter-\nHegemonic Globalization,\" Sousa Santos and Rodriguez Garavito, eds. Law and Globalization from Below:\nTowards a Cosmopolitan Legality (Cambridge, UK: Cambridge University Press, 2005), 8-9.\n\nthat may yet hold out a more people-centered promise: incremental, in situ informal\nsettlement upgrading. For Huchzermeyer, this tactic illuminates both the possibilities and\nchallenges of implementing the alternative approaches to delivering land and housing\ncontained within the government's own Breaking New Ground policy.54\n\nThough land invasion may appear a relatively extreme tactic, especially if we\nrecall the fear and sacrifice that characterized Agrinette Hills' experience of the tactic, it\nhas much in common with the seemingly more moderate tactics associated with\ncollaboration. For in both cases, the need to demonstrate alternative solutions is a first\nprinciple for social movements to utilize their position vis-a-vis the state, law, and public\npolicy to change the nature of all three of these social forces. The \"self-help\" strategies of\nthe FEDUP network have achieved new policies such as PHP, and appear to present the\npossibility for further realizing incremental upgrading policies at the local government\nlevel. However, the impact has not been fundamentally transformative, at least not yet. At\nthe same time, this network has exposed itself to great dangers of co-optation even in\npursuit of a transformative project.\nThe skeptical view of Sousa Santo and Rodriguez Garavito towards\n\"bootstrapping\" casts such activities as \"pragmatist\" and in the limited mold of\n\"participation.\" Yet their own articulation of \"counter-hegemonic globalization\" suggests\nthat \"bootstrapping,\" at least in the institutiuonally-engaged mold of the FEDUP network\nmay yet hold great potential. As they argue, \"The challenge of institutional imagination,\ntherefore, cannot be met but by privileging the excluded as actors and beneficiaries of\n\n54 Huchzermeyer, \"The struggle for in situ upgrading of informal settlements,\" 69-70.\n\nnew forms of global politics and legality.\" 55 It is not difficult to see the self-help\nactivities of savings and self-building of houses as precisely such a model, given the\nsmall but significant policy outcomes that such a strategy has already achieved.\nThis paper has argued that social movements for land and housing in South Africa\nhave played a large role in channeling popular aspirations for more inclusive access to\ncities. The strategies of contestation and collaboration have been utilized to varying\ndegrees by different social movements, and have had impacts that are not simply defined\nthrough linear \"a-to-b\" progressions. Rather it is the constant interaction between social\nmovements, law, and public policy that has produced ever-changing political opportunity\nstructures, as well as broader possibilities for a more \"people-centered,\" counter-\nhegemonic order. For precisely this reason, it is particularly necessary to not take a\nsnapshot of a social movement action and proclaim on its success or failure. The\nsimultaneous and interlinked processes of state-craft, popular resistance, and generative\npopular alternatives belie such simple judgment. Experiences of success utilizing law to\ncraft the limits of existing policy also have held the seeds of new policies. Forms of\ninstitutional engagement outside of the courts have also had similar impacts. Yet, in both\ntypes of experiences, the challenges of limited impact and dangers of co-optation have\nbeen equally apparent.\nWe therefore return to an earlier time, personality and process: that of Kas Maine,\nthe ordinary sharecropper who navigated the Apartheid state that permeated his life in\nways both profound and mundane. As Van Onselen has put it, his life and struggle for\ndignity in a land from which he was persistently disposessed, in its own small way\n\n55 Sousa Santos and Rodriguez Garavito, \"Law, Politics, and the Subaltern in Counter-Hegemonic\nGlobalization,\" 9.\n\nilluminates a struggle over values that permeates South Africa's history. In fact, it is this\nhistory of dispossession from land that continues to drive the organized social struggles\nof the poor to change the face of government and of city development. This paper has\nshown how social movements have been engaged in an ongoing process of discovering\ntheir own tools to enact their power to achieve a new order for accessing land and\nhousing. Though he was a farmer and not an urban dweller, Maine's understanding of his\npower vis-a-vis the powerful forces of an etatist order is telling for a new generation of\n\"subaltern\" poor who now live in South Africa's rights-based constitutional order, still\nstruggling for dignity, land, and a place to call home: \"The seed is mine. The\nploughshares are mine. The span of oxen is mine. Everything is mine. Only the land is\ntheirs.\"56\n\n56 Van Onselen, The Seed Is Mine, xvii.\n\nWorks cited\n1. Baumann, Ted, Bolnick, Joel and Mitlin, Diana. \"The age of cities and\norganizations of the urban poor: the work of the South African Homeless People's\nFederation and the People's Dialogue on Land and Shelter,\" International Institute\nfor Environment and Development Working Paper 2 on Poverty Reduction in\nUrban Areas, 2001.\n2. Bebbington, A.J. Mitlin, D. Mogaladi, J. Scurrah, M. Bielich, C. \"Decentring\nPoverty, Reworking Government: Social Movements and States in the\nGovernment of Poverty,\" Journal of Development Studies, Vol. 46, No. 7 (Aug.\n2010).\n3. Bolnick, Joel. \"uTshani Buyakhuluma (The grass speaks): People's Dialogue and\nthe South African Homeless People's Federation (1994-6),\" Environment and\nUrbanization, Vol. 8, No. 1 (1996).\n4. Bolnick, Joel and Bradlow, Benjamin. \"Rather a Better Shack now than Wait\nTwenty Years for a Formal House\" - Shack Dwellers International and Informal\nSettlement Upgrading in South Africa,\" Trialog, Vol. 104, No. 1 (2011).\n5. Bradlow, Benjamin, Bolnick, Joel, and Shearing, Clifford. \"Housing, Institutions,\nMoney: The Failure and Promise of Human Settlements Policy and Practice in\nSouth Africa,\" Environment and Urbanization, Vol. 23, No. 1 (2011).\n6. Etzo, Sebastiana. \"The unfinished business of democratization: struggles for\nservices and accountability in South African cities,\" Democratization, Vol. 17,\nNo. 3 (2010).\n7. Gobler, Fienie. \"Service delivery protests a 'warning sign' for government,\" Mail\n& Guardian newspaper, 20 July 2009, accessed 19 May 2012,\nhttp://mg.co.za/article/2009-07-20-servicedelivery-protests-a-warning-sign-for-\ngovt\n8. Huchzermeyer, Marie. \"Housing rights in South Africa: invasions, evictions, the\nmedia and the courts in the cases of Grootboom, Alexandra and Bredell,\" Urban\nForum, Vol. 14, No. 1 (2003).\n9. Huchzermeyer, Marie. \"The struggle for in situ upgrading of informal settlements:\na reflection on cases in Gauteng,\" Development Southern Africa, Vol. 26, No. 1\n(2009).\n10. Khan, Firoz and Pieterse, Edgar. \"The Homeless People's Alliance: Purposive\nCreation and Ambiguated Realities,\" Case Study for University of KwaZulu-Natal\nproject entitled: Globalisation, Marginalization and New Social Movements in\npost-Apartheid South Africa (2004).\n11. Kothari, Rajni. \"Masses, Classes and the State,\" in ed. Ponna Wignaraja, New\nSocial Movements in the South: Empowering the People, (New Delhi, India: Sage\nPublications, 1993).\n12. Madlingozi, Tshepo. \"Post-Apartheid Social Movements and the Quest for the\nElusive 'New' South Africa,\" Journal of Law and Society, Vol. 34, No. 1 (2007)\n13. Mitlin, Diana and Satterthwaite, David. \"Strategies for grassroots control of\ninternational aid,\" Environment and Urbanization, Vol. 19, No. 2 (2007).\n\n14. Mitlin, Diana. \"With and beyond the state -- co-production as a route to political\ninfluence, power and transformation for grassroots organizations,\" Environment\nand Urbanization, 20 (2008).\n15. Pithouse, Richard. \"A Politics of the Poor: Shack Dwellers' Struggles in Durban,\"\nJournal of Asian and African Studies, Vol. 43, No. 1 (2008).\n16. Plaatje, Sol. Native Life in South Africa, (Athens, OH: Ohio University Press,\n1996), first published in 1914\n17. Seekings, Jeremy. The UDF: A History of the United Democratic Front in South\nAfrica, 1983-1991, (Cape Town, South Africa: David Philip Publishers, 2000).\n18. Selassie, Abebe Aemro. \"South Africa's Unemployment Puzzle,\" iMFDirect\nBlog, April 4, 2011, http://blog-imfdirect.imf.org/2011/04/04/south-african-\nunemployment/\n19. Sharma, Aradhana and Gupta, Akhi. \"Introduction: Rethinking Theories of the\nState in an Age of Globalization,\" in eds. Sharma and Gupta, The Anthropology of\nthe State: A Reader, (Malden, MA: Blackwell Publishing, 2006).\n20. de Sousa Santos, Boaventura and Rodriguez Garavito, Cesar. \"Law, Politics and\nthe Subaltern in Counter-Hegemonic Globalization,\" Sousa Santos and Rodriguez\nGaravito, eds. Law and Globalization from Below: Towards a Cosmopolitan\nLegality (Cambridge, UK: Cambridge University Press, 2005).\n21. South African National Upgrading Support Program (NUSP) Background\ndocument, 2010, http://upgradingsupport.org/background.html\n22. South African Government Information Service, \"Housing,\" 2012,\nhttp://www.info.gov.za/aboutsa/housing.htm\n23. Swilling, Mark. \"Beyond Cooption and Protest: Reflections on the FEDUP\nAlternative,\" Mirjam Van Donk, Mark Swilling, Edgar Pieterse, Susan Parnell,\neds. Consolidating Developmental Local Government: Lessons From The South\nAfrican Experience (Cape Town, South Africa: University of Cape Town Press,\n2008).\n24. Tarrow, Sidney. \"States and opportunities: The political structuring of social\nmovements,\" in Comparative Perspectives on Social Movements : Political\nOpportunities, Mobilizing Structures, and Cultural Framings , ed. Douglas\nMcAdam, et al. (New York: Cambridge University Press, 1996)\n25. Kate Tissington and Lauren Royston, \"Urban Reform,\" Business Day, November\n15, 2010\n26. Tolsi, Niren. \"Pooh-slinging Slums Act showdown at Con Court,\"\nhttp://www.mg.co.za/article/2009-05-16-poohslinging-slums-act-showdown-at-\ncon-court, 16 May 2009, accessed 19 May 2012.\n27. Tomlinson, Mary R. \"From 'quantity' to 'quality': Restructuring South Africa's\nhousing policy ten years after,\" International Development Planning Review, Vol.\n28, No. 1 (2006).\n28. Van Onselen, Charles. The Seed Is Mine: The Life of a South African\nSharecropper, 1894-1985, (Johannesburg, South Africa: Jonathan Ball Publishers,\n2005).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.166 Law, Social Movements, and Public Policy: Comparative and International Experience\nSpring 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}