{
  "course_name": "Law and Society in US History",
  "course_description": "As events of the last few years have shown, the Supreme Court has played a crucial role in American political life. There is practically no issue of social significance in the American past that did not at some point end up in the nation’s courtrooms, yet much of the workings of the constitution remain obscure. This subject is designed to introduce students to the main themes and events of American constitutional law since 1787. It introduces terms and concepts of law and legal history, focusing on three recurring themes in American public life: liberty, equality, and property. Readings consist mostly of original court cases, especially from the U.S. Supreme Court, but the focus of the class is on the historical connections between those cases and broader social, political, and cultural trends.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Legal Studies",
    "Humanities",
    "History",
    "American History",
    "Philosophy",
    "Political Philosophy",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Legal Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSyllabus Archive\n\nThe following syllabi come from a variety of different terms. They illustrate the evolution of this course over time, and are intended to provide alternate views into the instruction of this course.\n\nSpring 2003, Christopher Capozzola (\nPDF\n)\n\nCourse Description\n\nAs events of the last few years have shown, the Supreme Court has played a crucial role in American political life. There is practically no issue of social significance in the American past that did not at some point end up in the nation's courtrooms, yet much of the workings of the constitution remain obscure. This subject is designed to introduce students to the main themes and events of American constitutional law since 1787. It introduces terms and concepts of law and legal history, focusing on three recurring themes in American public life: liberty, equality, and property. Readings consist mostly of original court cases, especially from the U.S. Supreme Court, but the focus of the class is on the historical connections between those cases and broader social, political, and cultural trends.\n\nRequirements\n\nThe success of this class depends on the active participation of all students. Classroom participation (15%) represents a substantial portion of the grade, and will be evaluated in terms of preparation, participation in large and small group discussion, active listening, collaboration, and overall contributions to the class experience during the term. Needless to say, if you do not attend a class it is impossible for you to contribute to it. Students are expected to keep up with the readings and attend class regularly, as classroom discussions and readings do not always overlap.\n\nWriting assignments are frequent, but short. All students will submit a case brief on one of the assigned cases (10%). All students will submit position papers (5-6 pp.) on two of the three class themes (25% each), and take the final examination (25%). Writing assignments are generally due on paper in person at the beginning of the class in which they are due. If the due date is set for a Friday, papers may be submitted by attachment, on the condition that you keep a backup paper copy of the paper in case there is difficulty reading the attachment. Extensions will be granted only for good reasons explained well in advance; computer malfunctions are never an acceptable excuse for a late submission. Adherence to standards of academic honesty is required; if you have any questions about how to go about your writing or cite your sources, don't hesitate to ask.\n\nBooks\n\nCopies of all required books have been placed on reserve in the Humanities Library. Most of the cases listed are included in Hall et al., eds.,\nAmerican Legal History\n. Recent cases can be found online at\nhttp://www.findlaw.com\n. Readings should be completed by the beginning of the class under which they appear, unless otherwise stated.\n\nHall, Kermit, et al., eds.\nAmerican Legal History: Cases and Materials\n. 2nd ed. New York: Oxford University Press, 1996.\n\nGarraty, John A., ed.\nQuarrels That Have Shaped the Constitution\n. 2nd ed. New York: Perennial Library, 1987.\n\nHorwitz, Morton J.\nThe Warren Court and the Pursuit of Justice\n. New York: Hill and Wang, 1998.\n\nGreenberg, Ellen.\nThe Supreme Court Explained\n. New York: W.W. Norton, 1997.",
  "files": [
    {
      "category": "Assignment",
      "title": "First Writing Assignment: Property Regulation in the Early Republic",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-224-law-and-society-in-us-history-spring-2003/7100713a65fa25d05d7048cc194f7086_lawandsocfiragnment203.pdf",
      "content": "Law and Society in US History\n21H.224 Spring 2003\nFirst Writing Assignment\nProperty Regulation in the Early Republic\nChoose one of the following two assignments. Your paper is due in class 8. You may submit the\npaper in class the previous day by email attachment. If you send the paper by attachment, you\nmust keep a backup paper copy and be ready to submit that if there are any computer difficulties.\nExtensions will be granted only for good reasons explained well in advance; computer\nmalfunctions are never an acceptable excuse for a late submission. Adherence to standards of\nacademic honesty is required. You may use any citation system that you wish (MLA\nparenthetical reference style, Chicago Manual of Style, legal citation), as long as your references\nare clear and complete.\nOption One: Case Brief. Write a brief and analysis on one of the four cases that we studied for\nclass 5. You should write this as a 2-3 pp. narrative summary of the case, but you will want\nto use the case brief handout as a way to guide your thinking and writing. Your brief should\naddress the facts of the case, the legal and constitutional issues at stake, the Court's holding, and\nits rationale. In addition, you should include your own argument as to why you believe that the\ncase you are writing about was rightly or wrongly decided. You may use strictly constitutional\nreasons for your point, or you may place the case in the context of broader social and historical\ndevelopments of the early republic.\nOption Two: Response Paper. Do the four cases that we have studied for class 5 offer a\ncoherent vision of the role of the state in protecting and regulating property rights? What is that\nvision? If you choose to answer this question, you should write a 2-3 pp. response paper that\nfocuses on explaining what holds the cases together (or not), drawing from the cases selectively\nrather than summarizing all four of them. You may use strictly constitutional reasons for your\nessay, or you may place the cases in the context of broader social and historical developments of\nthe early republic."
    },
    {
      "category": "Assignment",
      "title": "Fourth Writing Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-224-law-and-society-in-us-history-spring-2003/b4956eb1e82551175d63bdd1f7554c2f_lawandsocfouagnment503.pdf",
      "content": "Law and Society in US History\n21H.224 Spring 2003\nFourth Writing Assignment\nChoose one of the following three assignments. Your paper (5-6 pages) is due in Class 28. You\nmay submit the paper in class the previous day or by email attachment. If you send the paper\nby attachment, you must keep a backup paper copy and be ready to submit that if there are\nany computer difficulties. Extensions will be granted only for good reasons explained well\nin advance; computer malfunctions are never an acceptable excuse for a late submission.\nAdherence to standards of academic honesty is required; please exercise special care with\nsources found on the worldwide web. You may use any citation system that you wish (MLA\nparenthetical reference style, Chicago Manual of Style, legal citation), as long as your references\nare clear and complete.\n1. Suspect Classifications. Much of the law surrounding equality (including the Fourteenth\nAmendment itself) was conceptualized around the idea of race. Has the application of concepts\nlike heightened scrutiny and suspect classifications to gender and/or sexual orientation been\nsuccessful? Or are gender and/or sexual orientation social categories that are fundamentally\ndifferent from race? You can write about either gender, sexual orientation, or both. Choose two\nor three cases to explore your argument, focusing primarily on the period after World War II\n(although you might choose to contrast an earlier case with a later one).\n2. Men Behaving Badly. If Mr. Jones taunts Mr. Smith in a way that makes a hostile work\nenvironment for Mr. Smith, is this a form of discrimination \"on the basis of sex\" actionable\nunder Title VII of the Civil Rights Act of 1964? To write this essay, you will want to read the\nMargaret Talbot essay, as well as some of the related cases that she cites. You may choose one of\nher cases as the focus of your essay, or you may stick to the purely hypothetical. (You may also\ndecide for yourself whether Mr. Jones and Mr. Smith are heterosexual or not, and whether that\nmakes any difference to your argument.)\n3. Design Your Own Topic. As before, if you would like to write a paper that involves more in-\ndepth historical research into one of the cases that we have studied in the last two or three weeks,\nyou can do that as well, as long as you consult with me in advance. Examples could include\naffirmative action, sexual harassment, gay rights--or topics that we will cover next week, like\nnew federalism or post-September 11th civil liberties issues."
    },
    {
      "category": "Assignment",
      "title": "Second Writing Assignment: The Strange Career of the Fourteenth Amendment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-224-law-and-society-in-us-history-spring-2003/57a1613bc1f586eb965a512e3b719091_lawandsocsecagnment303.pdf",
      "content": "Law and Society in US History\n21H.224 Spring 2003\nSecond Writing Assignment\nThe Strange Career of the Fourteenth Amendment\nChoose one of the following three assignments. Your paper should be five to six pages long\n(with standard font and margins) and is due one day after Class 15. You may submit the paper\nin class a day before the due date, or by email attachment. If you send the paper by attachment,\nyou must keep a backup paper copy and be ready to submit that if there are any computer\ndifficulties. Extensions will be granted only for good reasons explained well in advance;\ncomputer malfunctions are never an acceptable excuse for a late submission. Adherence to\nstandards of academic honesty is required. You may use any citation system that you\nwish (MLA parenthetical reference style, Chicago Manual of Style, legal citation), as long as your\nreferences are clear and complete.\nOption One: Did the Supreme Court misinterpret the Fourteenth Amendment in the cases from\nSlaughterhouse to the turn of the century? Why or why not? You may construct a historical\nargument that draws on the history of the Fourteenth Amendment, Reconstruction, and postwar\nAmerican history, or you may choose to focus on the cases themselves.\nOption Two: Was Muller v. Oregon (1908) a victory for women? Why or why not?\nOption Three: If you would like to write a paper that involves more in-depth historical research\ninto one of the cases that we have studied in the last two or three weeks, you can do that as well,\nas long as you consult with me in advance. Examples could include the history of\nslaughterhouses in New Orleans in the 1870s; laws regulating railroad travel in the 1890s; court\ndecisions about Chinese immigrants, and so on."
    },
    {
      "category": "Assignment",
      "title": "Third Writing Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-224-law-and-society-in-us-history-spring-2003/e46f9ff938a9ad7657d2efcf2739adc4_lawandsocthiagnment403.pdf",
      "content": "Law and Society in US History\nChoose one of the following three assignments. Your paper is due in Class 23. You may submit\nthe paper in class one day before the due date or by email attachment. If you send the paper by\nattachment, you must keep a backup paper copy and be ready to submit that if there are any\ncomputer difficulties. Extensions will be granted only for good reasons explained well\nin advance; computer malfunctions are never an acceptable excuse for a late submission.\nAdherence to standards of academic honesty is required; please exercise special care with sources\nfound on the worldwide web. You may use any citation system that you wish (MLA\nparenthetical reference style , Chicago Manual of Style, legal citation), as long as your references\n21H.224 Spring 2003\nThird Writing Assignment\n1. Rewriting Brown. In a recent book entitled What Brown v. Board of Education Should Have\nSaid (2001), leading law professors shared their versions of the Brown decision. Now it's your\nchance. If you were a Justice in 1954, what would your decision say? You should address the\nissues presented by the Fourteenth Amendment and Plessy v. Ferguson (1896). Among the\nquestions to consider: will you overturn Plessy or merely state that it does not apply in this case?\nWas Plessy wrongly decided in 1896 or have changing times made it no longer applicable? What\ndifference does the history of the Fourteenth Amendment (and the intentions of its framers) make\nfor your decision? What will you say about enforcement of the decision? Note: if you choose this\npaper, you should read the full text of Brown (available on the class website or at 347 U.S. 483\n(1954) and you may use any additional authorities (especially Kelly and Horwitz) that you wish.\nYou may also need to go back to the readings about Plessy to write your decision.\n2. Amicus Brief. On May 7, the Ninth Circuit United States Court of Appeals will hear oral\nargument in the case of Oregon v. Ashcroft, which considers a challenge to Oregon's Death with\nDignity Act. Write a brief as amicus curiæ (a friend of the Court) in which you advise the Court\non the law's constitutionality. You may wish to draw on broad historical trends as well as\nspecific constitutional claims in your argument. Note: if you choose this paper, check out the\nclass website, which has links to materials surrounding Oregon v. Ashcroft.\n3. Design Your Own Topic. As before, if you would like to write a paper that involves more in-\ndepth historical research into one of the cases that we have studied in the last two or three weeks,\nyou can do that as well, as long as you consult with me in advance. Examples could include the\nfree-speech rights of Nazis or Klansmen, the experience of Jehovah's Witnesses or other\nreligious minorities in the courts, tensions between the rights of the accused and victims' rights,\nor broad issues raised by the work of the Warren Court.\nare clear and complete."
    },
    {
      "category": "Resource",
      "title": "Writing a Case Brief: One Approach",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-224-law-and-society-in-us-history-spring-2003/92321952ea7a0497d3014d7975e83002_lawandsocbriamplate203.pdf",
      "content": "Writing a Case Brief: One Approach\nFull Citation of Case:\nFacts of the Case [brief explanation of what happened]:\nRelevant Historical Background and Context:\nIssues of the Case [what the Court must decide]:\nRelevant Precedents [what parts of the Constitution, and what previous cases, must the Justices\nconsider]:\n\nCourt's Decision [include vote as well as any mandated action]:\nCourt's Reasoning [how do they justify their ruling]:\nNotable Concurrent or Dissenting Opinions [if there are any]:"
    }
  ]
}