{
  "course_name": "Learning by Comparison: First World/Third World Cities",
  "course_description": "The primary purpose of this seminar is to enable students to craft approaches to so-called “First World”/ “Third World” city comparisons that are theoretically sophisticated, methodologically rigorous, contextually grounded, and significantly beneficial. Since there exists very little literature and very few projects which compare “First World” and “Third World” cities in a sophisticated and genuinely useful manner, the seminar is structured around a series of readings, case studies, and discussions to assist students in becoming mindful of the potential and pitfalls of comparative analysis, the types of data, the methods of analysis, and the urban issues or sectors which may benefit the most from such approaches. The course is designed to be interdisciplinary and interactive, and is geared towards masters and doctoral students.",
  "topics": [
    "Business",
    "Globalization",
    "Social Science",
    "Sociology",
    "Urban Studies",
    "Society",
    "Global Poverty",
    "The Developing World",
    "Business",
    "Globalization",
    "Social Science",
    "Sociology",
    "Urban Studies",
    "Society",
    "Global Poverty",
    "The Developing World"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nStudents must have the permission of the instructor to take this class. (Note: This does not apply to OCW users.)\n\nIntroduction\n\nWe make implicit comparisons regularly, as we make decisions based on comparisons amongst choices, for example, amongst courses of actions. Most scholarly analysis also involves comparisons. Statistics aims to predict comparative value of particular variables based on empirically ascertained or simulated relationships, while theory seeks to explain observed or presumed outcomes by reference to comparative contributions of causative processes.\n\nThus, to compare is a common way of thinking. Nothing is more natural than to consider people, ideas, or institutions in relation to other people, ideas, or institutions. We gain knowledge through references. By enlarging the field of observation, the comparativist searches for rules and tries to bring to light the general causes of social phenomena. In general, it seems more sensible to concentrate on similar rather than totally dissimilar phenomena or processes. The principal reason for making a comparison is to shed light on how some common process produces different kinds of results in different places, or to examine why different processes produce similar results: looking first at what the two case studies have in common, then at the major differences among them, and finally, at the common processes (applied in variable degrees) which have led to the wide and very real differences which we now find.\n\nThe terms \"First World\" and \"Third World\" require clarification before we make any comparisons between cities in the two contexts. Several terms, usually in pairs, are utilized to illustrate this dichotomy. The starkest distinction is \"backward\" and \"advanced\" economies, and between 'traditional' and 'modern' cultures. A geographic dichotomy is between the North ('First World') and the South ('Third World'), referring to the countries of the northern and southern parts of the globe. The more common classifications place all countries on a continuum based on their degree of industrial and economic development: 'developed'/'underdeveloped', 'more'/'less' developed, or to recognize ongoing change, 'developed'/'developing' countries.\n\nAll these dichotomies are overly simplistic and engage in stereotypes, especially pejorative ones in the contemporary use of the term \"Third World.\" However, in this seminar, we will utilize the terms \"First World\" and \"Third World\", as short hand and as categories of convenience, because no system of classification can capture all the dimensions of a country within a consistent framework. The First World has been historically associated with the countries of North America, Western Europe, the Australian subcontinent, and more recently, Japan. The Second World has referred to the former Soviet Union and the formerly communist countries of Eastern Europe. The Third World refers to the economically developing countries of Asia, Africa, and Latin America.\n\nObjectives\n\nThe primary purpose of this seminar is to enable students to craft approaches to First World / Third World city comparisons that are theoretically sophisticated, methodologically rigorous, contextually grounded, and significantly beneficial.\n\nInternational comparisons require articulated conceptual frameworks. Comparisons are significant if we want to find out whether urban issues in a particular political-economic or cultural context are unique or common to other societies, and to determine the validity of sweeping generalizations. Such comparisons involve a number of tasks: identifying underlying patterns and explanations, specifying particular similarities and differences, and understanding the effect of the underlying institutional framework.\n\nComparisons also help us to better understand particular urban issues, for example in the United States, and to determine if those issues are more or less serious than in other societies. The policy relevance of comparison emerges from a study of the effects of different urban policies on different contexts, that is, to understand what works under what conditions. This might involve similar problems but different approaches, for example to the limited availability of housing finance, the reduction in affordable rental housing stock, or housing reconstruction after natural disasters.\n\nOver and above the policy relevance of comparative analysis, familiarity with different contexts is important in an increasingly interconnected and interdependent world. Globalization has become a central theme of the late 20th and early 21st centuries. It is a concept that was borne out of the seemingly global expansion of market capitalism. One aspect of this urban discourse is the recognition of globally competitive cities and regions such as New York, Mumbai, London, Mexico City, and Los Angeles, which nourish innovative, entrepreneurial, and cultural activities across national boundaries.\n\nA number of eminent development scholars and practitioners have identified problems in Third World countries and used them to better understand conditions and possibilities in First World countries. The economist Albert Hirschman first formulated the theory of unbalanced growth during professional work in Colombia and later found the same principles to be applicable in the United States. Hirschman characterized this process as a kind of dialectical movement that \"first comes upon looking at outside groups, the astonished finding of otherness, and then follows the even more startling discovery that our own group is not at all that different.\" Similarly, the community builder John Turner came to understand the notion of autonomy of building users through his years of work in Peru, and later applied the same principles in advocating alternatives to American public housing policies. The architect N.J. Habraken has argued that incremental home building in Third World countries provides an alternative architectural tradition to replace some of the obsolete models of Western Europe.\n\nIn the literature on comparative research, the critical question is how we compare rather than what we compare. A number of principles; for example, the notion of functional equivalence, and the articulation and aggregation of interests thus guide comparative analysis. Functional equivalence implies that one should not be mislead by superficial data and labels, and suggests that one ask questions such as: Who articulates demands in a particular urban or political-economic context? By what institutional structures are particular types of planning policies transmitted? How much autonomy is enjoyed by the public sector planning institutions? Such questions warn us of situations in which the same role may be played by different institutions in various countries. For example, in Mexico, urban planning decisions and policies are largely influenced by political actors and considerations, while in the United States urban planning decisions are largely influenced by private sector actors and considerations.\n\nAmong the functions that are ubiquitous and fundamental to various urban and political-economic contexts, two in particular attract attention in any analysis that touches upon the political systems of Third World and First World countries. One is the articulation of interests, which consists of the translation of diffuse interests into explicit demands such as claims, petitions, proposals, and amendments made through protests, the mass media or direct contact with those in power. The second is the aggregation of interests, which consists of converting these demands into coherent alternatives such as party programs, congressional platforms, or parliamentary majorities made through political parties, labor unions or business associations. These are the kinds of issues and approaches to be examined in this seminar.\n\nSeminar Outline and Readings\n\nSince there exists very little literature and very few projects which compare First World and Third World cities in a sophisticated and genuinely useful manner, the seminar is structured around a series of readings, case studies, and discussions to assist students in becoming mindful of the potential and pitfalls of comparative analysis, the types of data, the methods of analysis, and the urban issues or sectors which may benefit the most from such approaches. Students are expected to utilize the readings to carefully critique other approaches, and to craft their own comparative approach over the course of the semester.\n\nEach student is expected to lead at least two discussions, based on the reading assigned for that particular session. The discussion leader will (a) summarize the reading according their own understanding of it, (b) illustrate and clarify the reading with examples, case studies, personal experiences, or from other literature on the topic, and (c) prepare a series of provocative questions to generate a discussion. The purpose of the discussion leader is for him or her to contribute their own informed perspective on the topic, assist the rest of the group in understanding the arguments made in each reading, and to foster an active discussion on the topic.\n\nRequirements\n\nAttendance and Contribution\n\nThe seminar requires attendance to all sessions and the contribution of all students in order to nurture learning through an active exchange of ideas, knowledge, and experiences. Students are thus expected to come prepared--with notes and questions--to discuss the readings, to lead some of the discussions, and to draw upon other literature and examples. Regular attendance and active contribution to the seminar is crucial, and thus constitutes 25% of the final grade, and includes the quality of preparation for the student-discussions.",
  "files": [
    {
      "category": "Assignment",
      "title": "Assignment #1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/fcc4a6c2821fdb4e5c830eb577c42e26_MIT11_941f08_assn01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment #1\nThe 2-page (approximately) research proposal should contain the following elements: a)\ntopic or title of research, b) a brief description of the issue and the two cities you will be\nanalyzing, c) a brief statement regarding why the issue and the cities were selected (e.g.\nuniqueness, significance), and d) at least three different sources of information that you\nhave already identified and examined for this research. The 2-page research proposal\nconstitutes 5% of the final grade, and is due on September 17 in class."
    },
    {
      "category": "Assignment",
      "title": "Assignment #2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/b700d75e93bae7031dee6d4d53935fa5_MIT11_941f08_assn02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment #2\nThe 5-page (approximately) outline and summary should contain the following elements\nin an outline format complemented by a 1-sentence description under each heading and\nsub-heading: a) title, b) introduction, including overview of issue and cities, c) the\nissue's and cities' significance (e.g. in terms of policy, history, innovation, challenges), d)\nthe theoretical framework and proposed methodology for comparison, e) proposed\ninsights to be gained from such research, and f) at least five references consulted thus far.\nThe 5-page outline and summary constitutes 10% of the final grade and is due on October\n15 in class."
    },
    {
      "category": "Assignment",
      "title": "Assignment #3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/ef67890ab10cfe583329911d5a33d978_MIT11_941f08_assn03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment #3\nThe 15-minute (maximum) audio-visual presentation will be based on further\ndevelopment of the 5-page outline and summary, complemented by the use of overhead\ntransparencies, slides, photographs, video, or computer graphics. The presentation\nshould be of the highest caliber, and thus be prepared and practiced well in advance of\nthe seminar session. The 15-minute audio-visual presentation constitutes 20% of the\nfinal grade and will be due on November 19 through December 1."
    },
    {
      "category": "Assignment",
      "title": "Assignment #4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/5fe399e22b05d386301ef9f34069d133_MIT11_941f08_assn04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAssignment #4\nThe 25-page (approximately) final paper will be a research project of the highest\nquality: thoroughly researched, extremely well conceived and organized, and\npresented in a convincing manner. Please pay attention to the overall flow of the\nargument (e.g. via proper organization and in some cases, the use of sub-headings),\nand integrate graphics--such as plans, photographs, diagrams, or graphs--into the\nmain text of the paper. The 25-page final paper constitutes 40% of the final grade,\nand must fulfill the following criteria:\n-\nThe purpose and argument of the research paper should be stated clearly.\n-\nThe contribution of the comparative analysis should be evident.\n-\nThe methodology must be explicit, sound, and appropriate to the analysis.\n-\nThe writing should be direct, clear, and communicate the author's ideas.\nStudents are encouraged to deconstruct the seminar readings as a way of learning\ntechniques of conducting exemplary research and effective writing."
    },
    {
      "category": "Resource",
      "title": "Humanizing the City: A Comparative Analysis of Festival and the Adaptation of Public Space",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/52ab13d63dbcf84c0c38bd165a105f39_MIT11_941f08_proj01_15_minute_presentation.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nHUMANIZING THE CITY:\nA COMPARATIVE ANALYSIS OF FESTIVAL IN MANHATTAN AND MUMBAI\nJOSHUA C. FIALA\n11.941 LEARNING BY COMPARISON: FIRST WORLD/THIRD WORLD CITIES\nPROFESSOR ASEEM INAM | FALL 2008 | PRESENTATION | 11/19/2008\n\nFESTIVALS AS A HUMANIZING EVENT IN THE CITY\nA TEMPORAL MOMENT WHEN HUMANITY DOMINATES ALL OTHER FORCES ACTING IN THE CITY\nHOW DO YOU HUMANIZE THE CITY?\nFESTIVALS ARE UNIQUELY HUMAN MOMENTS IN THE CITY\nHOW DOES A FESTIVAL CHANGE THE USE OF SPACE?\nCAN THIS ADAPTATION PROVDE LESSONS TO HUMANIZE THE CITY?\nDOES THE FESTIVAL ITSELF CREATE MORE HUMAN PLACES?\n\nCITIES OF FESTIVAL\nMANHATTAN | MUMBAI\n| NEW YORK CITY (MANHATTAN), NEW YORK, USA |\n| MUMBAI, MAHARASHTRA, INDIA |\norigin |\n16th century\norigin |\n16th century\nland area |\n789.4 sq km\nland area |\n437.7 sq km\npopulation |\n8.3 million (2007 census)\npopulation |\n11.9 million (2001 census)\npopulation density |\n10,481 people/sq mi (2007 census)\npopulation density |\n27,209 people/sq km (2001 census)\nmode share |\nPublic Transportation (54.6%)\nmode share |\nWalk (55.5%)\nCar (29.7%)\nPublic Transportation (36.3%)\nWalk (9%)\nOther (5.8%)\nOther (5.7%)\nCar (1.6%)\nCycle (1%)\nCycle (.8%)\n(5) famous events |\nSt. Patrick's Day Parade\n(5) famous events |\nElephanta Festival\nJuly Fourth Festival\nMaharashtra Day\nFestival of the Americas\nGanesh Chahurthi\nMacy's Thanksgiving Day Parade\nNavaratri\nNew Year's Eve Festival\nKala Ghoda Festival\n\nFESTIVAL TYPOLOGIES | PLACE TYPOLOGIES\nFESTIVALS AND PLACES THEY OCCUR IN CITIES CAN BE CLASSIFIED INTO A FEW TYPES\nFESTIVAL TYPOLOGIES\nPROCESSION\nCENTRAL POINT\nDECENTRAL NETWORK\nPLACE TYPOLOGIES\nMAJOR STREET/ARTERY\nPARK\nPLAZA\nMACY'S THANKSGIVING DAY PARADE\nGANESH CHATURTHI\nMACY'S THANKSGIVING DAY PARADE\nGANESH CHATURTHI\n\nFESTIVAL COMPARATIVE STUDY\nMACY'S THANKSGIVING DAY PARADE\nMACY'S THANKSGIVING DAY PARADE | MANHATTAN, NEW YORK, USA\ndescription |\nA Parade of Elaborate Floats, Bands, Clowns, Celebrities and Giant Helium Filled Balloons\ntime of year / day |\nFourth Thursday of November / 9AM to Noon (3 Hours)\norigin date |\norigin idea |\nMacy's Employees Celebrating the Christmas Season with a European Style Parade\nroute |\nCentral Park W. South to Broadway cont. South to 34th St.\nsize (attendance) |\n10,000 Parade Participants, 2-3.5 Million Spectators\nsize (area of city) |\n43 Blocks (2.5 Miles)\ngeneral effect |\nCrowded Route, Congests Midtown\nspectacle |\nPop Culture Icon Helium Balloons\ncosts |\nEvent Clean Up, Police and Security Details\nhidden costs |\nIrritation, Blocked Traffic, Interrupted Deliveries, Loss of Business, Noise\nplanning |\nFloats and Balloons Begin Prep Up to 1 YR in Advance\nfinal preparation |\nPrepare/Secure Route, Inflate Balloons, Assemble Floats\naftermath |\nBalloons Deflated,Trash Removal\n\nFESTIVAL COMPARATIVE STUDY\nGANESH CHATURTHI\nGANESH CHATURTHI | MUMBAI, MAHARASHTRA, INDIA\ndescription |\n10-Day Event Worshipping Ganesh, Processions to the Sea for Immersion of Idols\ntime of year / day |\nEnd of August/Beginning of September / All Day (Over a 10-Day Period)\norigin date |\n1893 +/\norigin idea |\nLokmanya Tilak installed public images of Ganesh for worship as British protest\nroute |\nOrganic\nsize (attendance) |\nDifficult to Measure (11,200 Ganesh Mandals in 2008)\nsize (area of city) |\nDifficult to Measure\ngeneral effect |\nCrowded Routes, Congests City\nspectacle |\nGanesh Idols and Statues Worshipped and Paraded Through the Streets to the Sea\ncosts |\nPolice and Crowd Control Measures\nhidden costs |\nBlocked Traffic, Noise\nplanning |\nIdols Crafted up to 3 Months in Advance, Queuing Planning\nfinal preparation |\nClose Popular Routes to Traffic\naftermath |\nIdols Immersed in the Sea, Pollution of Sea Water\n\nCOMPARATIVE CASE STUDY\nMACY'S THANKSGIVING DAY PARADE SPATIAL ANALYSIS\nLOCATIONS OF FESTIVAL AT CITY AND NEIGHBORHOOD SCALES\nAerial photo removed due to copyright restrictions\n\nCOMPARATIVE CASE STUDY\nGANESH CHATURTHI SPATIAL ANALYSIS\nLOCATIONS OF FESTIVAL AT CITY AND NEIGHBORHOOD SCALES\nAerial photo removed due to copyright restrictions\n\nANALYTICAL FRAMEWORK\nMACY'S THANKSGIVING DAY PARADE | GANESH CHATURTHI\nFESTIVALS AS HUMANIZING EVENT\nMacy's Thanksgiving Day Parade\nGanesh Chaturthi\nManhattan, New York, U.S.A.\nMumbai, Maharashtra, India\nTerritory / Use\nIntimacy / Connection\nGranularity / Activity\nMovement\nTriangularity\nHow does the condition of connection and density of people change b/w\nordinary & festival?\nDoes the grain and mix of activity change b/w ordinary & festival?\nHow does freedom of movement change b/w ordinary & festival?\nWhat is the center of focus in ordinary & festival?\n* Principles for effective event places adapted from Dennis Frenchman's Event Places\nHow do people occupy & use the city differently b/w ordinary & festival?\nHow do people occupy & use the city differently b/w ordinary & festival?\nADAPTATION OF CITY\nVitality\nFit\nAccess\nHow do the above adaptations benefit or negate city vitality?\nHow do the above adaptations benefit or negate city vitality?\nHUMANIZATION OF CITY\nHow do the above adaptations benefit or negate human fit in the city?\nHow do the above adaptations benefit or negate human access in the city?\n* Principles for good city from adapted from Kevin Lynch's Good City Form\n\nCOMPARATIVE CASE STUDY\n\nMACY'S THANKSGIVING DAY PARADE FRAMEWORK ANALYSIS DIAGRAMS\nFESTIVALS AS HUMANIZING EVENT\nMACY'S THANKSGIVING DAY PARADE\nTERRITORY / USE\nINTIMACY / CONNECTION\nGRANULARITY / ACTIVITY\nMOVEMENT\n\nCOMPARATIVE CASE STUDY\n\nGANESH CHATURTHI FRAMEWORK ANALYSIS DIAGRAMS\nFESTIVALS AS HUMANIZING EVENT\nGANESH CHATURTHI\nTERRITORY / USE\nINTIMACY / CONNECTION\nGRANULARITY / ACTIVITY\nMOVEMENT\n\nCOMPARATIVE ANALYSIS\nMACY'S THANKSGIVING DAY PARADE AND GANESH CHATURTHI\nManhattan, New York, U.S.A.\nTerritory / Use\nIntimacy / Connection\nGranularity / Activity\nMovement\nTriangularity\nIncreased (+)\nNot Changed (.)\nRestricted (-)\nIncreased (Except Times Square) (+)\n* Principles for effective event places adapted from Dennis Frenchman's Event Places\nFESTIVALS AS HUMANIZING EVENT\nMacy's Thanksgiving Day Parade\nGanesh Chaturthi\nNot Changed (.)\nNot Changed ( )\nADAPTATION OF CITY\nIncreased (+)\nMumbai, Maharashtra, India\nIncreased (+)\nIncreased (+)\nIncreased (+)\nIncreased (+)\nOnly Benefited Itimacy/Connection (+)\nOnly Benefited Itimacy/Connection (+)\nHUMANIZATION OF CITY\nGreat Benefit (++)\nVitality\nFit\nAccess\nNo Effect (.)\nBenefit (+)\nNegated Human Access (-)\nBenefit (+)\n* Principles for good city from adapted from Kevin Lynch's Good City Form\n\nTENTATIVE CONCLUSIONS\nFESTIVALS HUMANIZE THE CITY\nADAPTATION OF THE CITY THROUGH FESTIVAL DOES HUMANIZE THE CITY\nTHE MORE INFORMAL AND ORGANICALLY ORGANIZED SPECTACLE OF THE MUMBAI FESTIVALS\nPROVIDE A MORE DRAMATIC ADAPTATION OF THE CITY AND A MORE UNINHIBITED ASSERTION\nOF HUMANITY\nFOCUS ON ORDER AND SECURITY IMPEDE HUMANIZATION\nMANHATTAN'S HUMANITY IS ORGANIZED, SYSTEMATIC AND BUILT-IN FROM THE TOP-DOWN ORDER\nOF THE CITY GRID AND ITS PEDESTRIAN SCALE CREATE A VERY LIVABLE CITY\nMUMBAI'S HUMANITY IS NOT RELATED TO THE ORGANIZATION OF THE CITY, THE SHEAR WILL OF THE\nRESIDENTS OF THE CITY OVERWHELM LACKING INFRASTRUCTURE AND FORMAL ORDER IN THE\nCITY, PROVIDING THE RESIDENTS WITH A BOTTOM UP WILL OF THE PEOPLE TO CREATE A\nVIBRANT AND LIVABLE PLACE\nA VIBRANT, LIVABLE AND HUMANIZED CITY AS FESTIVALS WOULD INDICATE IS MOST SUCCESSFUL\nWHEN LESS STRUCTURED AND ORGANIZED. THE MOST EXTREME AND LIBERATING EXAMPLES\nOF ADAPTATION OF SPACE FOR FESTIVAL ALLOW COMPLETE FREEDOM OF MOVEMENT, ACCESS\nAND OCCUPATION OF SPACE BY PEOPLE. THE RESTRICTIONS OF THE ORDINARY USE AND\nORDER OF THE CITY ARE SUBVERTED TO PLACE HUMANS FIRST."
    },
    {
      "category": "Resource",
      "title": "Humanizing the City: A Comparative Analysis of Festival and the Adaptation of Public Space",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/960f795e3557fd8c18f5c97e4a40597d_MIT11_941f08_proj02_final_paper.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nHUMANIZING THE CITY:\nA COMPARATIVE ANALYSIS OF\nFESTIVAL AND THE ADAPTATION OF PUBLIC SPACE\nJOSHUA C. FIALA\n11.941: Learning by Comparison:\nFirst World / Third World Cities\nProfessor Aseem Inam\nDecember 12, 2008\n\nHUMANIZING THE CITY:\nA COMPARATIVE ANALYSIS OF\nFESTIVAL AND THE ADAPTATION OF PUBLIC SPACE\n1.0\nABSTRACT\nHumanizing the city is a worthwhile endeavor because it is a process by which\nplaces can be developed in such a way to give priority to humans. Prioritizing the\nhuman in this study focuses on the city as a setting for social interaction, therefore\nhumanizing the city endeavors to improve the sociability of public space. Festivals pro\nvide a unique opportunity to study the social nature of city space as they are temporal\nmoments when the culture and socialization of humans is exaggerated, potentially of\nfering lessons for improving the social nature of space.\nIn this comparative analysis of the Macy's Thanksgiving Day Parade in Manhattan\nand the Ganesh Chaturthi festival in Mumbai, the two festivals were examined for ele\nments to improve the sociability of the city, thus humanizing it. The analysis examined\nthe elements of these festivals that were permissive of different and more social behav\nior in public space including enhancing connections, improving freedom of movement\nand accessibility, tolerating a varied use of space and the increasing vitality and grain\nof activity. Both festivals analyzed improve socialization of their respective cities across\nthese metrics. However, due to the varied nature of each event and their respective\ncontexts and cultures, each festival emphasizes some of the above elements more than\nothers.\nThe analysis discovers that festivals are a humanizing force in the city and do offer\nlessons as to how a city could be humanized by enhancing the social nature of space.\nThe analysis also uncovers the nuanced nature of the festival as a dynamic humanizing\nevent that adjusts to its surroundings to socialize space as needed. The comparison also\nhighlights weaknesses of each festival's sociability, a passive audience and rigid event\nstructure in Manhattan and a potentially anti-social religious exclusivity in Mumbai.\nHowever, the strengths of each provide generalizable and arguably universal insights\nas to humanizing the city: focusing the grain of activity and movement on the human\nscale, providing civic moments in which common experiences can be shared by strang\ners, and creating the environment necessary to support a truly diverse and micro-scaled\nmix of activity and function in public spaces.\n\n2.0\nARGUMENT FRAMING THE ANALYSIS\n2.1\nHUMAN\nTo be human is to be many things. However, beyond the genetic,\nphysiological and philosophical definitions, humanity is primarily\nreflected in our nature as social creatures. In Maslow's Hierarchy of\nhuman needs, the social needs of humans are third after basic shelter\nand health, and then security and safety. The dominant construct for\nhumans to engage as social creatures and to operate in and define\nvast hierarchies of social structures is the city. The city allows social\nexchange between individuals and groups, allows social norms to be\nformed, common interests and identities to be forged and human\nvalues to be formulated and tested.\n2.2\nA HUMAN CITY\nWhat makes a city human? Or, what makes one city more or less\nhuman than another? Those elements of a city that may contribute\nto its greatness or efficient operation do not ensure that it is fit for\nhuman inhabitation and sociability. A discussion of the design and\ndevelopment of any city may be necessarily simplistic since many\nforces are at work in a city. Even identifying or understanding a\ndominant or explicit force is a difficult task. However, attempting\nto understand why so many of the cities created by humans are\noften difficult places for humans to inhabit is a valid cause for some\nsimplification.\nMany forces act upon the design and development of cities;\nthese forces include value systems in the city including efficiency,\nprofit, aesthetics and sociability (humanity). For instance, the city\nmoves goods and people efficiently and quickly through its systems\n\nof mobility. The city provides an economic and trading center\ncapitalizing on its centrality and focus within a region. The city is able\nto capture the imagination of its inhabitants with great buildings and\nboulevards. However, to be human is not to be mobile, profitable,\nor aesthetic. To be human is to be social, so the city must align its\npriorities to provide for humans as social beings. A human value\nsystem in the city is one that prioritizes design and development\nthat enhances socialization and human connection in the city. A\nhuman city does not limit human contact and connectedness -- many\nmodern cities do not pass this simple test.\n2.3\nHUMANIZING FESTIVAL\nThere are moments in a city that create a setting for more social\ninteraction between humans. The temporal event of a festival is\none of these moments when the force of humanity in the form of\nhuman social interaction and cultural expression overwhelm all other\nvalue systems in the city. This festive moment provides a unique\nopportunity to study a human value system prioritizing sociability\nand human connectivity acting in and upon the city.\nExamining the effect of festivals on public space and understanding\nhow the city adapts to accommodate an event that is focused on the\nhuman can lead us to a better understanding of how to design and\ndevelop cities for the explicit use of humans. Interestingly, festivals\nas human events themselves can enhance sociability in the city;\nhowever the interest in this study is not the actual event or spectacle\nof celebration. In this analysis, the festival is seen as an experimental\nmoment in the city, one that may inform our perceptions of the city to\nbetter understand what could possibly contribute to making a place\nmore human.\n\nFIGURE 1:\nss of\nat forms\nGanesh\nfestival.\nsh Fiala.\n\nThe ma\nhumanity th\nduring the\nChaturthi\nImage courtesy of Jo\n3.0\nCOMPARATIVE ANALYSIS\n3.1\nCASE STUDY SELECTION\nIn the selection of cities for this analysis, it would have been\nobvious to choose a city that could be considered very human and\ncompare that to a city that is considered less human and then make\nthe normative judgment of one over the other. However, this type\nof comparison would not result in a robust set of conclusions or\nindications as to what entails making a city more human. As such, the\ntwo case study cities selected, Manhattan and Mumbai, could both be\nconsidered very human places, both are a thriving metropolis with an\nactive and vital populace. Both cities are social, cultural and festival\ncenters of their respective regions, if not national foci for cultural\nevents. However, the two cities contribute most to the comparative\nanalysis not in these similarities, but in their differences.\nOne city is an established global center of finance, culture\n\nand politics with a formal urban organization and regimented\ndeployment of the festivals over the cultural year. The other city\nis an ambitious regional center of finance, culture and politics still\nstruggling with the provision of certain urban infrastructure and\npublic amenity elements, it has a strong informal organization to\nfill in the gaps of formal provisions and has a rich and varied annual\nsurvey of festivals. In this analysis, these cities were chosen for their\ndifferences in the hope that they lend a credible and universal nature\nto the common conclusions drawn from their comparison. These\ntwo cities are Manhattan and Mumbai, respectively and the festivals\nselected in each city are Manhattan's Macy's Thanksgiving Day Parade\nand Mumbai's Ganesh Chaturthi.\n3.2\nRESEARCH QUESTION\nHow do festivals humanize the city or highlight strategies by\nwhich to humanize the city?\nFIGURE 2:\nAn illustration of the intended unit of analysis:\nA typical space in the city with its adaptation from normal use to festival use.\nImage removed due to copyright restrictions.\n\n3.3\nUNIT OF ANALYSIS\nThe comparative analysis will examine elements of the festival\nthat can uncover methods to humanize the city. The unit of analysis\nfor this study will be an individual festival event that occurs in the city.\nFor the purpose of this study, a festival is considered to be any cultural\nevent that is temporary, that attracts a large crowd, has an impact\non the city, has a national or international reputation, is primarily\na human-based event and occurs annually and has an extended\nhistory since its origin. More specifically, the festival will be studied\nin one typical space in the city and will be examined for changes in\nuse of space between the normal condition and festival condition.\nExamining the two case studies at this level allows the adaptation of\nspace in the festival condition to be compared and analyzed across\ncontexts and for generalizations to be drawn.\nAccordingly the unit of analysis for the Macy's Thanksgiving Day\nParade is a typical block along the route in Midtown Manhattan\nexamining how the festival condition differs from the typical\nconditions on that block.\nSimilarly, the analysis for Ganesh Chaturthi is a typical block along\nthe processions near Chowpatty Beach in South Mumbai examining\nhow the festival condition differs from the typical conditions on that\nblock.\n3.4\nHYPOTHESIS | INITIAL FINDINGS\nFestivals humanize the city by adapting public spaces to enable\nmore sociability and human connectivity through a combination of\na greater freedom of movement and accessibility, enhancement of\nthe connections between humans, and allowing a more tolerant and\n\nunpredictable use of space. This ultimately leads to a more vital and\nsocial city, a more human city. In this analytical study, the festival\nshould in fact prove a humanizing force in both case studies.\nIn Manhattan, the Macy's Thanksgiving Day Parade allows\nfor greater connectivity between parade goers, improved human\naccessibility and freedom of movement and increased tolerance of\nunique public uses of space. However, the context of the parade\n(meaning the origin and design of the parade itself ) and its location\nin Manhattan constrain the event's impact as truly humanizing force\nin the city. Manhattan has such a rigid urban structure and formal\norganization that a more humanizing event could have a more\ndefined break from these patterns. However, many of the more\ndominant value systems in the city, efficiency and security among\nthem, continue to dominate humanity even during the festival\nevent.\nIn Mumbai, the Ganesh Chaturthi celebration improves\nconnectivity between celebrants, increases freedom of human\nmovement and accessibility and tolerable use of space in the city\nand provides a truly liberating, if only temporarily, event in the\nhumanization of the city. The adaptation of space and the dominance\nof humanity in Mumbai during this festival is perhaps a more striking\ndifference from the normal condition and operation of the city than\nthe Macy's Parade exhibits. In that sense, the Ganesh festival is a\nmore successful humanizing event, however as will be elaborated,\nthere are other aspects of the event and its origins that may confound\nits ability to be a truly universal social connector.\nThe festival case studies provide interesting lessons to\n\nhumanize space in the city and the comparative analysis highlights\nthe fact that all cities have a different level of baseline humanity and\nthat an event designed to humanize and adapt space for human\nconnection and sociability would take a different form in each\ncontext, this will be discussed in greater detail in the conclusions of\nthe analysis.\n3.5\nMETHODOLOGY\nAn observational collection of data and facts was assembled\nregarding each festival case study to provide a basis for comparison.\nA mapping of the location of the festival in their respective city\ncontexts examined the amount of the city affected by the festival and\nits general effect on the city (road closures, crowd gatherings, the\nprocession route, adaptation of the city and streets, etc.).\nThe analysis of the adaptation of space is built upon an\nexamination of photographs, videos and other accounts of the\nfestival event focusing on the behavior and interactions of festival\nparticipants, the use of city space and the change of use or pattern\nfrom baseline normal use in the typical block as defined in the unit of\nanalysis above in each festival case study. The baseline of normal use\nof space was also established using photographs, videos and written\naccounts of the city and its operation under normal circumstances.\nThis information was then analyzed based upon the analytical\nframework of this comparative analysis as described below. The\nstrength of the conclusions that come out of this analysis and\nframework are due to its comparative nature. It is hoped that even\nwithin two varied contexts, some universal elements of humanization\nwill be apparent.\n\n3.6\nANALYTICAL FRAMEWORK\nThe analytical framework of this comparison establishes a method\nto compare and analyze the two festivals in question. If the primary\ngoal of the study of festival is to discover methods to humanize the\ncity by enhancing the social nature of spaces, then the analytical\nframework should examine how the use of space differs from normal\nconditions to festival conditions. These primary adaptations of space\nare thought to lead to a more social and ultimately more human city.\nThe primary humanizing adaptations of space for this analysis are\nthe following:\n1. Enhancing Social Connectivity\n2. Improving Freedom of Movement and Accessibility of\nSpace by Humans\n3. Tolerance of Varied Use of Space\n4. Vitality and Grain of Activity\nResulting in a determination of:\n5. Overall Sociability and Humanity\nEnhancing social connectivity is an adaptation resulting in greater\nopportunity for social interaction and connections between strangers\nin the city. Freedom of movement and degree of accessibility of\nspace by humans is measured by focusing on the movement patterns\nof people in the city. Tolerance and varied use of space refers to the\npermissive nature of occupying space in a different manner and\nwhat is considered socially or legally acceptable behavior in public\nspace. Vitality and grain of activity refers to how finely a mix of uses\nis in the city and public spaces and to what scale is the mix occuring;\npreferably this mix is occuring at the human scale. Finally, the overall\n\nsociability and humanity is measured by looking at the net effect of\nall of the above measures and determining whether or not the festival\nevent is leading to a net gain of sociability and humanity. Through\nthis comparative analysis, each element's strength in creating a\nmore social place can be examined and more universal principles of\nhumanizing the city can be derived.\nFESTIVALS AS HUMANIZING EVENT\nMacy's Thanksgiving Day Parade\nGanesh Chaturthi\nManhattan, New York, U.S.A.\nMumbai, Maharashtra, India\nADAPTATION OF CITY\nHUMANIZATION OF CITY\nCONNECTIVITY\nMOVEMENT/\nACCESS\nTOLERANCE\nVITALITY/\nACTIVITY\nSOCIABILITY/\nHUMANITY\nHow does the condition of connection and density of people change b/w\nordinary & festival?\nHow does freedom of movement change b/w ordinary & festival?\nHow do people occupy & use the city differently b/w ordinary & festival?\nDoes the grain and mix of activity change b/w ordinary & festival?\nHow do the above adaptations benefit or negate city\nsociability, human connection and interaction?\nFIGURE 3: Analytical Framework Matrix\n\n4.0\nINTRODUCTION TO FESTIVAL CASE STUDIES\n4.1\nMACY'S THANKSGIVING DAY PARADE\n4.1.1 EVENT DESCRIPTION\nThe Macy's Thanksgiving Day Parade is a spectacle that has\nbecome a pop culture tradition associated with Thanksgiving and\nthe beginning of the Christmas holiday in the United States, or more\nnotably with the beginning of the shopping season for the Christmas\nholiday. The event is sponsored by the Macy's department store and\nhas evolved from a European-styled parade that originated in 1924.\nThe parade event is a linear procession that primarily features large\nhelium-filled balloons of pop culture characters and icons. The parade\nalso includes elaborate floats, marching bands, celebrity singers and\nperformances. The parade route is secured by hundreds of police\nofficers along the parade route and street closings. The parade\nattracts attendees to the Manhattan route and many onlookers camp\nout in one location along the route, while others come and go and\nmove along the parade route and throughout the surrounding area\nof the city.\nFIGURE 4: Use of space and general atmosphere at the Macy's Thanksgiving Day Parade in Manhattan.\nImage courtesy of Josh Fiala.\n\n4.2\nGANESH CHATURTHI\n4.2.1 EVENT DESCRIPTION\nThe Ganesh Chaturthi spectacle is a Hindu festival that has\nbecome one of Mumbai's most famous and well-known cultural\nevents. The event is a celebration of the Hindu Lord Ganesh's birthday\nand the actual procession of large Ganesh idol's through the streets of\nMumbai to the city's waterfront is the culminating event of a 10-day\ncelebration of the Hindu god. The idols themselves are either small\npersonal idols celebrated by families or large idols that are publicly\nworshipped. These larger idols number about 11,000 throughout\nthe city, most located in the Mill Lands, and result in a procession to\nthe nearby Chowpatty Beach and public promenade of Marine Drive.\nThe main event is a procession of the idols to the sea where they are\nthen immersed. The most popular procession routes are either fully\nclosed to traffic or partially controlled by Mumbai Police to ensure the\nsmooth flow toward the Western coast and to minimize disruption of\ntraffic flow in the city. However, the movement and flow of people\nand of the idols throughout the city is quite free and unrestricted.\nFIGURE 5: Use of space and general atmosphere at Ganesh Chaturthi in Mumbai.\nImage courtesy of Josh Fiala.\n\nFIGURE 6: Locus map for Macy's Thanksgiving Day Parade in Manhattan and aerial photo of the route.\n4.1\nMACY'S THANKSGIVING DAY PARADE\n4.1.2 EVENT LOCATION\nThe parade takes place in Manhattan, New York on a defined\nparade route from Central Park West at about 87th Street Southward\nto Broadway at Columbus Circle, continuing South on Broadway until\nthe Macy's store at Herald Square turning onto 34th Street and ending\nthe procession on 7th Avenue at about 40th Street. The parade affects\na surprisingly limited amount of the city, but does greatly reduce\ncross-town connections in Midtown. All cross streets are closed at\nthe avenue adjacent to the parade route, converting at least a 3-block\narea, the length of the parade route, to pedestrian-only activity and\nadaptation of space.\nAerial photo removed due to copyright restrictions\n\nFIGURE 7: Locus map for Ganesh Chaturthi in Mumbai and aerial photo of the focus area affected.\n4.2\nGANESH CHATURTHI\n4.2.3 EVENT LOCATION\nThe festival takes place in Mumbai, Maharashtra, primarily in\nthe Mill Lands of South Mumbai; however there is no defined route\nof the processions and the activity of the festival could take place\nin any part of the city and quite often affects much of the Western\ncoast with activity. The main streets with the most activity and\npolice attention to traffic control are those surrounding Chowpatty\nBeach. Juhu beach, further North along the Western coast is another\npopular immersion location and receives a fair amount of attention.\nThe event in its peak will affect much of the city as many of the streets\nwill become overburdened with revelers and the procession of idols.\nAerial photo removed due to copyright restrictions.\n\n4.1\nMACY'S THANKSGIVING DAY PARADE\n4.1.3\nBRIEF EVENT LOGISTICS\nThe parade takes place on morning of the Thursday of Thanksgiving\nevery year, since it first began in 1924. The event lasts some four to\nfive hours with preparation time before and after affecting the city\nas well. The parade procession officially begins at 9am and finishes\nat approximately 2pm, the city begins to fill with parade onlookers\naround the route by about 7am and the crowds will not clear the area\nof the parade until about 3 or 4pm.\nThe parade is allowed to take place in Manhattan for several\nreasons. One, it is a large draw of tourists and an economic generator\nfor the weekend in Manhattan. Two, the event has successfully\nestablished itself as a cultural tradition and is anticipated each year as\na tradition marking the beginning of the holiday season.\nThe event itself is a highly controlled and choreographed event\nthat has deliberately and painstakingly eliminated any potential\nunexpected occurrences. The parade route is prepared by the city\nfor a week in advance, removing obstructions, preparing sidewalks,\nmarking streets and building seating along Central Park West, at\nColumbus Circle and at Herald Square. The pedestrians are only\ncontrolled immediately at the parade route and freedom of pedestrian\nmovement is enhanced just off of the actual route, where automobile\ntraffic is restricted. Other than some restricted movement at the\nparade route, the police officers are very tolerant and permissive of\nmost behavior along the parade route.\n\n4.2\nGANESH CHATURTHI\n4.2.3 BRIEF EVENT LOGISTICS\nThe festival takes place in late August or early September for 10\ndays. It first began in 1893. The actual immersion procession takes\nplace at the end of the 10-day worship period and the procession\nlasts all day from morning until night, with crowds celebrating in the\nstreet and at the waterfront well into the night.\nThe procession festival is not so much allowed to take place in\nthe city, as the city has little choice in resisting the shear number of\nparticipants in this event. The large number of Ganesh worshippers\noverwhelms the city and controls all normal function of Mumbai\nfor that day. The event is not necessarily highly controlled, but is\na well choreographed citywide maneuver of flows of crowds and\nnormal flows of traffic and adjustment and accommodation of\neach dynamically in time. The city prepares for the event along the\nprimary procession routes, and in general has an awareness of the\nevent and its date. The city restrains its normal activity during that\nday, as normal city operation is in many ways impossible for that\nperiod. Pedestrian movement is not controlled in any way during the\nevent and freedom of pedestrian movement is enhanced wherever\nthere is a crowd in the city. Generally, the crowds allow many types of\nbehavior that wouldn't otherwise be permitted to occur mostly due\nto the anonymity of crowd behavior.\n\n5.0\nANALYSIS OF FESTIVAL CASE STUDIES\n5.1\nMACY'S THANKSGIVING DAY PARADE\n5.1.1 ENHANCING SOCIAL CONNECTIVITY\nThe festival event enhances social connectivity in a number of\nways. The primary method of enhancing connectivity is by providing a\ncenter of focus and occurrence to observe for all event attendees. The\nMacy's Thanksgiving Day Parade provides the actual spectacle of the\nparade, large helium balloons, floats, marching bands and celebrities\nin a moving procession that can be the focus of the crowds of people\nin close proximity and provide a focus for people's attention and a\nframe by which to have a shared public experience. It is this shared\npublic experience that is providing a means for social connectivity\nand enhancing the sociability of public space in the city. The event\nitself is simplifying the activity in the city to the extent that nearly\neveryone observing the parade will have a shared reaction and can\nbond complete strangers in the common experience of perception.\nThis is very different than the normal operation of the city, in which\nmany different activities are in action and any number of the events\nthat occur in public space could be interpreted differently. The\nparade removes the nuance of everyday city life and replaces it with\nan event that everyone can easily observe and understand together.\nFIGURE 8: Manhattan diagrams of normal (left) and festival (right) conditions of Density of People.\n\n5.2\nGANESH CHATURTHI\n5.2.1 ENHANCING SOCIAL CONNECTIVITY\nThe event again provides a center of focus and occurrence for all\nevent attendees to focus. However, in this case the event is not as\nobjective and universal as pop culture characters or the commercial\nmarketing of a shopping holiday. This is a religious event, which\nincludes all of the religious imagery and devout worship that is\nassociated with a religious holiday. This is especially significant in\na city where religious tensions can be high at these times of public\ndisplay of devotion. Nonetheless, the crowds that draw to the street\nto carry and escort the Ganesh idols to the sea provide a center of\nfocus for everyone in that public space. The large Ganesh idols with\nlarge crowds of worshippers chanting, praying and playing musical\ninstruments create a spectacle due to the shear size of their numbers.\nIn spite of all of the intricacies of religion and culture, the event\nseems to draw large crowds together in the act of occupying space\ndifferently than under normal conditions as they move Westward\ntoward the sea. As compared to the Macy's Thanksgiving Parade,\nmuch of the complexity and nuance of city life is maintained and\ncelebrated during the Ganesh event.\nFIGURE 9: Mumbai diagrams of normal (left) and festival (right) conditions of Density of People.\n\n5.1\nMACY'S THANKSGIVING DAY PARADE\n5.1.2 FREEDOM OF MOVEMENT AND ACCESSIBILITY\nThe Macy's Thanksgiving Day Parade does not completely improve\nfreedom of movement and degree of accessibility of city spaces, but\nprobably does marginally improve human movement and access. At\nthe parade route itself, freedom of movement and access is the most\nlimited. The street, which is the center of the route, is controlled with\nbarricades and police barriers to allow only the movement of parade\nparticipants, severely limiting the free movement and accessibility of\nparade observers. In fact, the parade limits movement from East to\nWest across a large portion of Midtown Manhattan since you cannot\nactually cross the parade route, but for at one point along its 33 block\nlength at a cross traffic break at 42nd Street. However, due to these\neast-west street closings a block in either direction of the parade\nroute, pedestrian access and freedom of movement just adjacent to\nthe parade route itself is greatly enhanced from everyday use. For\nthe entire parade route for at least a 1 block offset of the route itself,\nvehicular traffic is not allowed and people get to flow freely, use\nthe street as a public space, and generally inhabit those blocks in a\nmanner much more free and unpredictably than during normal city\noperation.\nFIGURE 10: Manhattan diagrams of normal (left) and festival (right) conditions of Movement of People.\n\n5.2\nGANESH CHATURTHI\n5.2.2 FREEDOM OF MOVEMENT AND ACCESSIBILITY\nGanesh Chaturthi does greatly enhance the human freedom\nof movement and level of accessibility of the city during the\nprocessions. The streets of Mumbai are regularly frenetic, highly\ntrafficked and dangerous places for pedestrian movement, but for\nthe time of the Ganesh idols procession through the streets it is\nas though the crowds of humanity overwhelm the traffic flow and\nthe vehicles finally succumb to the shear will of the revelers and\nGanesh devotees. Certain primary route roads are controlled by the\npolice and given over to the Ganesh crowds. The mass of humanity\ncontrols the city spaces and streets in such a way that they would not\nnormally have the power. In this way, the movement of the crowds\nduring the Ganesh festival is greatly enhanced as compared to the\nMacy's Festival, any observer could become a part of the event itself,\nintentionally or accidentally, depending upon their location and\npositioning within the crowd. No barrier is placed between event\nparticipant and observer in the course of this spectacle. The crowd\nitself may become an occasional barrier to free movement. Moving\nin the opposite direction of the crowd of humanity can be a difficult\nor impossible endeavor at times.\nFIGURE 11: Mumbai diagrams of normal (left) and festival (right) conditions of Movement of People.\n\n5.1\nMACY'S THANKSGIVING DAY PARADE\n5.1.3 TOLERANCE AND VARIED USE OF SPACE\nAs mentioned briefly already, the tolerance and varied use of\nspace is increased during the parade event. Although the police force\ndoes enforce the boundary at the parade route, for the most part the\nvigilance ends there and the police are very permissive to other forms\nof occupation of space. Interestingly, private property owners and\noperators have reacted to this permissive environment of the use of\nspace by enforcing their own restrictions on use: boarding up around\ntrees, taping off stairs, boarding sides of buildings, taping railings, etc.\nHowever, wherever the specific building owner has not tried to limit\nthe occupation of space, the crowds will optimize the surroundings,\nopportunistically occupying space to afford better views of the\nspectacle. People will stand in the streets on ladders, balance on\nconcrete barricades, stand on elevated plazas, climb up lampposts,\netc. In this way, the city becomes more tolerant of certain uses of city\nspace and varies the use of those spaces at the same time. However,\nit should be stated that most of this behavior does still show a certain\namount of restraint and civic behavior. The environment becomes\nless tolerant and permissive if anyone attending the event began to\nbehave in a manner that is unacceptable or threatening to all of the\nchildren in attendance.\nFIGURE 12: Manhattan diagrams of normal (left) and festival (right) conditions of Space Occupied by People.\n\n5.2\nGANESH CHATURTHI\n5.2.3 TOLERANCE AND VARIED USE OF SPACE\nThe tolerance and varied use of space during Ganesh Chaturthi is\nenhanced. During the event in the city spaces in which it occurs, the\ncrowds allow a varied use of space and tolerate behaviors that do not\nnormally occur in the streets. The crowds are walking through the\nstreets, playing musical instruments in the streets, dancing, chanting,\npraying and otherwise creating a vibrant and active use of spaces that\nare normally the domain of vehicular traffic only and are not cultural\nsites of adulation. However, this use of space by the crowds may have\na limit to its tolerance. It is difficult to imagine that the crowd would\nbe permissive of any behaviors too different than their own. For\ninstance, as mentioned above, if one desires to move in a direction\nopposing the crowd or if a Muslim crowd had different intentions for\nthe use of the street in front of their Mosque, the tolerance of use of\nvaried use of space would dramatically diminish and the crowd of\nthe event itself could act as a limiting force on the variety of use of\nspace in the city. In this way, the Ganesh festival is quite a delicate\nbalance between humanizing space (by biasing the city toward use\nand activity of people) and ensuring that different cultural viewpoints\nare not put in to conflict by this adaptation of space.\nFIGURE 13: Mumbai diagrams of normal (left) and festival (right) conditions of Space Occupied by People.\n\n5.1\nMACY'S THANKSGIVING DAY PARADE\n5.1.4 VITALITY AND GRAIN OF ACTIVITY\nThe Macy's Thanksgiving Parade also creates a vitality and grain\nof activity that is not at first obvious. The spectacle of the event itself\ncould certainly be seen to be vital in itself, but that is really not a lesson\nfor urbanism. Although a major activity of the street is removed by\nbarring vehicular traffic and the sidewalk venders normally seen on\nManhattan sidewalks, the grain of activity does seem to still exist and\nperhaps be enhanced by the event. The parade route involves a few\nlevels of observers and participants, the static observer that camps\nout in one spot from early in the morning through the duration of\nthe event, usually directly on the parade route, the dynamic observer\nthat is interested in the event, but prefers to move from place to\nplace along the route affording different vantage points and the\nevent attendee that is as much interested in strolling and using the\nspaces created by the event and the general atmosphere of the city at\nthat moment as they are in the event itself. Another form of parade\nactivity is the vendor selling helium balloons of the large characters\nseen in the parade. Each of these elements of the event create a\nvitality along the length of the route that is probably not more fine\ngrained and active than a normal Manhattan street scene, but does\nbias that activity to the human and pedestrian oriented scale.\nFIGURE 14: Manhattan diagrams of normal (left) and festival (right) conditions of Grain of Activity.\n\n5.2\nGANESH CHATURTHI\n5.2.4 VITALITY AND GRAIN OF ACTIVITY\nThe vitality of the street is certainly enhanced by the large crowds\nof people, the cultural spectacle, the exuberance and the colorful\nGanesh idols. However, the spectacle itself does not translate directly\nto better or desirable vitality in urbanism. The vitality of the street and\npublic spaces of the city are improved over the norm of these spaces\nbeing occupied completely by vehicular traffic. The public space of\nthe city, which is in high demand is certainly expanded as humanity\nexpands the public realm. The grain of activity of the city is again\nbiased toward the human in the instance of the event.\nHowever,\nthe overall grain of the city and mix of activity may be diminished\nagain by the overwhelming force of the crowds. Just as the crowds\noverwhelm all forms of the other more dominant systems of the city,\nthe crowd may also hinder other varied and micro-scaled activities\nthat are normally occurring on the sidewalks and at the edges of\nstreets. The dominant force of the crowd either eliminates the ability\nof these functions through lack of space or in some cases a lack of\nsafety. Thus, the overall vitality and grain of activity while adjusted\ntoward the benefiting the human, actually is somewhat diminished\nby the overwhelming force of the crowd and crowd behavior of the\nevent.\nFIGURE 15: Mumbai diagrams of normal (left) and festival (right) conditions of Grain of Activity.\n\n5.1\nMACY'S THANKSGIVING DAY PARADE\n5.1.5 OVERALL SOCIABILITY AND HUMANITY\nAlong all of the measures mentioned and illustrated above the\noverall effect of the Macy's Thanksgiving Day Parade is to improve\nsociability, thus humanizing Manhattan. The event allows for a\nconnectivity to occur between large crowds of strangers bonding\nover a common shared experience. It marginally enhances the ability\nof large amounts of people to move freely and have access to space\nin the city (the street) that is otherwise considered dangerous or not\ntolerated. However, due to the restricted access and formal barriers\nalong the parade route, overall movement and freedom in the city\nis restricted. The tolerance for different uses of space is enhanced,\nbut the formality and overt police presence does limit the perceived\ntolerance of behavior for the event. The grain of activity and vitality\nin the city is maintained at about the same level as normally seen,\nbut for an adaptation and biasing of that activity to the scale and\nscope of the human, thus increasing the vitality of the city in regard\nto people.\nThe Macy's Thanksgiving Day Parade adapts space in Midtown\nManhattan allowing people to inhabit the city differently along the\nparade route. The effect of the automobile on the city is minimized in\nthis area and the ability to accommodate large crowds, the ability to\ntolerate less personal space and to interact favorably with strangers\nare all improved by the event. Overall, the Macy's Thanksgiving Day\nParade has a humanizing effect on Manhattan.\n\n5.2\nGANESH CHATURTHI\n5.2.5 OVERALL SOCIABILITY AND HUMANITY\nAlong all of the measures mentioned and illustrated above and in\ncomparison to the Macy's Thanksgiving Day Parade the overall effect\nof Ganesh Chaturthi is to greatly enhance sociability in Mumbai. The\nevent increases social connectivity of strangers joined in a common\nshared experience. The shear mass of humanity enhances the ability\nof large amounts of people to move freely and have access to space in\nthe city that is otherwise not possible. The grain of activity and vitality\nin the city is somewhat diminished from that normally seen, but the\nintense activity of people in the city during the event balances this\ndetriment. The Ganesh Chaturthi adapts space in Mumbai allowing\npeople to inhabit the city differently along the procession routes,\nthe effect of the automobile on the city is minimized in this area\nand the ability to accommodate large crowds and to have people\nenjoy themselves in large crowds and to interact with strangers are\nall enhanced by the event. Additionally, although the event may\nat times heighten tensions between different cultural and religious\ngroups in the city, it is hoped that this public display and use of space\ncould provide figurative space for disparate groups to come together\nand if not to share in some common experiences, than at least to\nbecome more tolerable and understanding of the traditions and\ncultures of other groups in the city.\nAs seen in the following summary figure of the analytical\nframework, the net effect of Ganesh Chaturthi as a humanizing event\nin the city must be greater than that of the Macy's Thanksgiving Day\nParade. All of the factors discussed contribute to this conclusion.\n\nFESTIVALS AS HUMANIZING EVENT\nMacy's Thanksgiving Day Parade\nGanesh Chaturthi\nManhattan, New York, U.S.A.\nMumbai, Maharashtra, India\nCONNECTIVITY\nMOVEMENT/\nACCESS\nTOLERANCE\nVITALITY/\nACTIVITY\nSOCIABILITY/\nHUMANITY\nIMPROVED /\nGREATLY IMPROVED /\nHUMANIZING EFFECT\nHUMANIZING EFFECT\nFIGURE 16: Analytical Framework Summary and Conclusions\n6.0\nCONCLUSIONS\n6.1\nDISCOVERIES OF CITY CONTEXT\nA truly human city is found unpredictably in the everyday\ndrama of human encounter. In many ways, our cities today severely\nlimit these chance encounters and opportunities for social connection.\nIn this comparative analysis, festivals have been examined to discover\nADAPTATION OF CITY\nINCREASED (+)\nINCREASED (+)\nRESTRICTED (-)\nINCREASED (+)\nMARGINALLY INCREASED (+)\nINCREASED (+)\nMARGINALLY INCREASED (+)\nINCREASED (+)\nHUMANIZATION OF CITY\n\nelements of these social events that could lead to the development\nof more social cities. Interestingly, it would seem that in terms of\nbeing a human and social place, each city has different a unique\ncontext and different issues to address when humanizing the city.\nThis comparative analysis allows these differences to be discerned\nmore easily. For instance, the order and discipline of Manhattan\nseems to also infultrate the organization of festival, diminshing the\nevent's potential to humanize the city. The more fluid organization,\ndynamic participation and real-time, human-scaled decision making\nof Mumbai's Ganesh festival becomes a more effective event for\nempowering humans to interact with the city in a different way. In\nmany ways it is the subversion of norms and order that provides the\nmost dramatic adjustments of the festival events.\n6.2\nHUMAN CITIES: MANHATTAN AND MUMBAI\nIn general, Manhattan and Mumbai are both doing reasonably\nwell when considered as human cities, but in different ways. This\nis surprising, in a certain respect, given all their differences, but\npredictable given the extreme differences in city context. It would\nseem that both cities exhibit varying degrees of the humanizing\nelements of festivals studied. Manhattan connects people on the\nstreet with its vibrant mixing of uses, tolerant social climate and\nenhanced movement of people with a pedestrian orientation.\nMumbai connects people with its micro-scaled mix of activity, density\nof use, vitality on the street, tolerance of one's proximity and personal\nspace, and a similar orientation toward walkability. Regardless of\nfestival, both cities already do exhibit those elements of a humanized\nplace.\n\n6.3\nTRANSFERABLE CONCLUSIONS\nThe true value of this study lies in discovering in comparison\nof one city to the other, how those human elements already present\nin the city could be enhanced by others that are overshadowed or\nnonexistent. Manhattan could learn from Mumbai the abiliity to\ntemporarily subvert its systems of order and static observation and\ncreate human-centered events and spaces that are fluid, dynamic\nand actively involve the observer in the creation of the spectacle.\nMumbai could learn from Manhattan the lesson in urbanism that\ntemporal events could perhaps bring the city together in shared\nexperience when they are not focused on only one group's traditions\nor celebrations.\n6.4\nUNIVERSAL CONCLUSIONS\nThe variety and difference in occupation and adaptation\nof space and varied forms of spectacle between the two settings\nuncovers a few universal and transcendent traits that could lead to a\nmore human city. First and foremost, those elements of the city that\ncurrently exist as humanizing forces operating in the city should be\nidentified, the temporal event or design of space can then address\nthose elements that are deficient and call attention to them. Making\nconnections in unpredictable ways and currently synergies between\npeople, parts of the city and different functions requires overlapping\nand varied types of use, accessibility and freedom of movement\nbetween those uses, and a fine human-scaled grain of activity and\nuse.\nMore specifically, all city spaces and arrangements of buildings\nand functions should be designed and developed in such a way to:\n\n1. Improve social connections and shared common\nexperience between residents of the city.\n2. Break down large single uses providing muliple and varied\nuses instead.\n3. Enhance movement and accessibilty of people and allow\nother modes of transportation to adapt to this priority.\n4. Assemble uses, spaces, buildings, and all other\nelements of a city to ensure vital and active spaces at all\ntimes of the day and year and create moments that\nhighlight the spectacle of daily life.\n\n7.0\nREFERENCES\n7.1\nBIBLIOGRAPHY\nBonnemaison, Sarah and Macy, Christine. Festival Architecture. Lon\ndon: Routledge, 2007.\n\"Discovering Ganesh: Ganesh Festival Footage\"\nwww.discoveringganesh.com\n\"Ganesh Festival\"\nwww.ganeshfestival.com\nGrippo, Robert and Hoskins, Christopher. Macy's Thanksgiving Day\nParade. Dover: Arcadia Publishing, 2004.\nKostof, Spiro. The City Shaped: Urban Patterns and Meanings Through\nHistory. London: Thames and Hudson Ltd., 1991.\nLynch, Kevin. Good City Form. Cambridge: The MIT Press, 1981.\n\"Macy's Thanksgiving Day Parade Website\"\nwww.macys.com/campaign/parade/parade.jsp\n\"NYC Tourist Website: Macy's Thanksgiving Day Parade History\"\nwww.nyctourist.com/macys_history1.htm\nRohatgi, Pauline. Bombay to Mumbai: Changing Perspectives.\nMumbai: Marg Publications, 1997.\nSabate, Joaquim, Frenchman, Dennis and Schuster, Mark. Event\nPlaces. Barcelona: Universitat Politecnica de Catalunya, 2004.\n\"Urban Age: A Worldwide Investigation Into the Future of Cities\"\nwww.urban-age.net\n7.2\nFIGURES\nFIGURE 1: The mass of humanity that forms during the Ganesh Chaturthi festival in\nMumbai, India, here at Chowpatty Beach. SOURCE: www.gusrubens.com\nFIGURE 2: An illustration of the intended unit of analysis: A typical space in the city\nwith its adaptation from normal use to festival use. SOURCE: AUTHOR\n\n7.2\nFIGURES (CONTINUED)\nFIGURE 3: Analytical Framework Matrix. SOURCE: AUTHOR\nFIGURE 4: Use of space and general atmosphere at the Macy's Thanksgiving\nDay Parade in Manhattan. SOURCE: www.commercialappeal.com (left image),\nwww.wirednewyork.com (center image), www.abcnews.com (right image)\nFIGURE 5: Use of space and general atmosphere at Ganesh Chaturthi in Mumbai.\nSOURCE: www.abcnews.com (left image), www.danharlow.com (center image),\nwww.danharlow.com (right image)\nFIGURE 6: Locus map for Macy's Thanksgiving Day Parade in Manhattan and aerial\nphoto of the route. SOURCE: AUTHOR, Google Earth Aerial\nFIGURE 7: Locus map for Ganesh Chaturthi in Mumbai and aerial photo of the\nfocus area affected. SOURCE: AUTHOR, Google Earth Aerial\nFIGURE 8: Manhattan diagrams of normal (left) and festival (right) conditions of\nDensity of People. SOURCE: AUTHOR\nFIGURE 9: Mumbai diagrams of normal (left) and festival (right) conditions of Den\nsity of People. SOURCE: AUTHOR\nFIGURE 10: Manhattan diagrams of normal (left) and festival (right) conditions of\nMovement of People. SOURCE: AUTHOR\nFIGURE 11: Mumbai diagrams of normal (left) and festival (right) conditions of\nMovement of People. SOURCE: AUTHOR\nFIGURE 12: Manhattan diagrams of normal (left) and festival (right) conditions of\nSpace Occupied by People. SOURCE: AUTHOR\nFIGURE 13: Mumbai diagrams of normal (left) and festival (right) conditions of\nSpace Occupied by People. SOURCE: AUTHOR\nFIGURE 14: Manhattan diagrams of normal (left) and festival (right) conditions of\nGrain of Activity. SOURCE: AUTHOR\nFIGURE 15: Mumbai diagrams of normal (left) and festival (right) conditions of\nGrain of Activity. SOURCE: AUTHOR\nFIGURE 16: Analytical Framework Summary and Conclusions.\nSOURCE: AUTHOR"
    },
    {
      "category": "Resource",
      "title": "The Impact of Urban Design Elements on the Successes and Failures of Modern Multi-family Housing: A Comparative Study of Robert Taylor Homes, Chicago, and HanGang Apart Complex, Seoul.",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-941-learning-by-comparison-first-world-third-world-cities-fall-2008/11a043e00f4fb7e6c3ab3a5e33761156_MIT11_941f08_proj03_G09_17739UrbnDsgn_final.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n11.941 Learning by Comparison: First World/Third World Cities\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nwww.design-journal.com\nDESIGN\nPrinciples & Practices:\nAn International Journal\nVolume 3, Number 4\nThe Impact of Urban Design Elements on the\nSuccesses and Failures of Modern Multi-family\nHousing: A Comparative Study of Robert Taylor\nHomes, Chicago and HanGang Apart Complex,\nSeoul\nJae Seung Lee\n\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\nhttp://www.DesignJournal.com\nFirst published in 2009 in Melbourne, Australia by Common Ground Publishing Pty Ltd\nwww.CommonGroundPublishing.com.\n(c) 2009 (individual papers), the author(s)\n(c) 2009 (selection and editorial matter) Common Ground\nAuthors are responsible for the accuracy of citations, quotations, diagrams, tables and\nmaps.\nAll rights reserved. Apart from fair use for the purposes of study, research, criticism or\nreview as permitted under the Copyright Act (Australia), no part of this work may be\nreproduced without written permission from the publisher. For permissions and other\ninquiries, please contact\n<cgsupport@commongroundpublishing.com>.\nISSN: 18331874\nPublisher Site: http://www.DesignJournal.com\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL is peer\nreviewed, supported by rigorous processes of criterionreferenced article ranking and\nqualitative commentary, ensuring that only intellectual work of the greatest substance\nand highest significance is published.\nTypeset in Common Ground Markup Language using CGCreator multichannel\ntypesetting system\nhttp://www.commongroundpublishing.com/software/\n\nThe Impact of Urban Design Elements on the Successes\nand Failures of Modern Multi-family Housing: A\nComparative Study of Robert Taylor Homes, Chicago\nand HanGang Apart Complex, Seoul\nJae Seung Lee, Massachusetts Institute of Technology,\nMassachusetts, USA\nAbstract: This study explores the role of urban design in the successes and failures of modern multi-\nfamily housing developments. Similar housing developments, which are high-rise multi-family apart-\nments laid out in super-blocks, have been implemented around the world. However, their results have\nbeen polarized despite their similar urban design elements. To shed light on the contribution of design\nelements to successful housing developments, this study compares two housing projects: one is Robert\nTaylor Homes, Chicago, built in 1962, which was a miserable failure that ended up with its demolition\nin 2005. The other is HanGang Apart Complex in Seoul, which has been successful since its completion\nin 1971 and catalyzed massive developments of \"Apart,\" which is an abbreviation for \"apartment,\"\nin Seoul. The different outcomes of the two similar projects raise the following questions: What are\nthe design elements that contributed to the successes and failures of modern multi-family housing? In\nwhat ways did these design elements influence the two housing projects? The goal of this study is to\ngain insight into better urban design strategies for housing development in two cities, Chicago and\nSeoul. To offer recommendations for urban designers and planners, the urban design theories are\napplied and modified to the findings drawn from the comparative analysis of the two projects. The\nstudy argues the following: spatial distinction and sequence, through a series of territory, promote\nthe sense of neighborhood and ownership; linear retail strips invite not only residents but also strangers,\nwhich creates a vibrant public space and encourages more social activities; strategically enclosed\nneighborhood public spaces under natural surveillance provide amenities and promote social activities;\ndiverse unit sizes and types invite various people in terms of income levels or occupations, thus sup-\nporting mixed-income neighborhoods.\nKeywords: Urban Design, Modern Multi-Family Housing, Chicago, Seoul, Comparative Study, Ter-\nritoriality, Linear Retail Strip, Neighborhood Public Space, Diverse Housing Choices\nOverview\nT\nHIS PAPER EXPLORES the role of urban design in the successes and failures of\nmodern multi-family housing developments. Similar housing developments, which\nare high-rise multi-family apartments laid out in super-blocks, have been implemented\naround the world. However, their results have been polarized. Through an analytical\nframework, this study investigates two housing projects: one is Robert Taylor Homes,\nChicago, built in 1962, which was a miserable failure that ended up with its demolition in\n2005. The other is HanGang Apart Complex in Seoul, which has been successful since its\ncompletion in 1971. The different outcomes of two similar projects raise the following\nDesign Principles and Practices: An International Journal\nVolume 3, Number 4, 2009, http://www.Design-Journal.com, ISSN 1833-1874\n(c) Common Ground, Jae Seung Lee, All Rights Reserved, Permissions:\ncg-support@commongroundpublishing.com\n\nquestions: What are the design elements that contributed to the successes and failures of\nmodern multi-family housing? In what ways did these design elements influence the two\nhousing projects?\nThe goal of this study is to gain insight into better urban design strategies for housing\ndevelopment in two cities, Chicago and Seoul. To offer recommendations for urban designers\nand planners, the urban design theories are applied and modified to the findings drawn from\nthe comparative analysis of the two projects. The study argues the following: spatial distinc-\ntion and sequence through the sense of territory promote the sense of neighborhood and\nownership, and keep neighborhoods defensible; linear retail strips invite not only residents\nbut also strangers, which creates a vibrant public space; strategically enclosed neighborhood\npublic spaces under natural surveillance provide amenities and promote social activities;\navailable choices of housing accommodate the diversity of communities by meeting needs\nand preferences of the residents.\nFigure 0 Left: The Aerial View of Robert Taylor Homes, (Source: http://www.angelfire.com),\nRight: The Aerial View of Hangang Apart Comple\nBackground\nHow can urban design contribute to successful housing developments? This is a study of\nurban design's role in the successes and failures of modern multi-family housing. The\nmodern multi-family housing development derived from Le Corbusier's vision of modern\ncities, \"Tower in the Park,\" which proposed cities that consist of high-rise buildings in\nlandscapes such as parks. Another master of modern architecture, Ludwig Mies van der\nRohe, influenced the architectural typology of modern high-rise multi-family housing by\nproposing utilitarian high-rise apartments made of exposed concrete frames, glass, and steel.\nThis modern model was favored by architects and planners because high-rise buildings oc-\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\ncupied less land and provided more sunlight and unobstructed views. The other advantage\nof modern housing, probably the most important one, was that high-rise housing can be\nstandardized so as to be constructed quickly and inexpensively (Rybczynski, 1993). Thus,\nhigh-rise apartment towers were accepted as the most efficient solution for providing public\nhousing during the 1950's and 1960's, in many cities in first world and third world as well.\nWith this new vision, the Chicago Housing Authority (CHA) implemented urban renewal\nprojects around the city. One Chicago urban renewal project, Robert Taylor Homes, was\nplanned to provide decent affordable housing. In Seoul, modern high-rise housing, called\n\"new town development\" first emerged in the 1950's, in order to accommodate an increasing\nurban population. This new type of housing was called the \"Apart,\" which is an abbreviation\nfor \"apartment.\" HanGang Apart Complex, completed in 1971, was a precursor of later\nmassive new town developments in Seoul. I selected these two projects for comparative\nanalysis because they are similar in architectural typology, urban design, and the size of de-\nvelopment (see Figure 1). Also, there are physical differences in detail between the two de-\nvelopments. Most importantly, both projects marked the turning points of the housing devel-\nopment trends in Chicago and Seoul. The similarities and differences of the two contrasting\ncases reveal the urban design mechanism that works in a specific socio-economic context.\nThe two projects demonstrate how the physical designs interpreted the housing policies of\nthe two cities, and how the results of these interpretations influenced the residents' behavior\nand perceptions. Thus, by tracing these dynamics, the study of the two projects will shed\nlight on the contribution of these projects' physical environment to the successes and failures.\nFigure 1 Left: Robert Taylor Homes, Right: HanGang Apart Complex\nAnalytical Framework\nI have conducted this study through the analysis of urban design theory, urban planning lit-\nerature, and empirical evidence. The theoretical frame of this paper is the environment-be-\nhavior study that is a field of relationships between the built environment and people. Envir-\nonment-behavior studies argue that certain forms of the physical environment cause or en-\ncourage specific human behavior in response to the built environment. Thus, by understanding\nhow people use and behave in given environments, it may possible to build an environment\nthat promotes positive behavior (Moudon, 1992). I have proposed to apply the theories to\nthe two cases in order to test whether these theories are still valid within specific contexts\nthat are different from the contexts of the theories. This test will lead to lessons for urban\nJAE SEUNG LEE\n\ndesigners by modifying and adopting the insight from previous studies into modern multi-\nfamily housing in the two cities.\nNormative theories, in the field of environment-behavior studies, that emphasize the \"what\nshould be\" provide the basis for deliberately designing urban form. Alexander et al. (1977)\nproposed the norms and values of city forms in many different scales. He developed patterns\nthat define healthy towns or communities. Lynch & Hack (1984) summarized site design\nstrategies for designers. They proposed specific techniques for designing urban development\nprojects according to a site design process. Newman (1973) investigated the possibility of\nthe physical environment that may be able to prevent crimes. He argued that careful building\nconfigurations can reduce crime rates by controlling activity patterns.\nNew Urbanism is another significant movement because the post Robert Taylor Homes\ndevelopment is based on the idea of New Urbanists. New Urbanism supposes that more\ndense and mixed-use neighborhood developments can promote more walking and local\nactivities. New Urbanists seek to build walkable and transit-oriented neighborhoods for vi-\ntalizing urban areas, preserving countryside by compact developments, and minimizing de-\nvelopments' negative impact on the local and regional environments (Calthorpe & Fulton,\n2001).\nUrban planning literature, particularly the works of Sudhir Alladi Venkatesh and Valerie\nGelezeau has been explored to understand how people have lived and perceived housing\nprojects and how socio-economic factors have influenced the successes and failures. Gelezeau\n(2004) investigated Korean Aparts in diverse ways, for example conducting in-depth inter-\nviews with residents, collecting historic photos and maps, reviewing literatures, and analyzing\nthe Korean government's housing policy. She concluded that the connection between major\nprivate contractors and the Korean government supported the success of Korean Apart de-\nvelopments, and people favored Aparts because the investment in Aparts became the most\nprofitable model. Venkatesh's ethnographic study of Robert Taylor Homes demonstrates\nthe social structure of the poor and segregated community. He argued that Robert Taylor\nHomes could have sustained a viable and healthy community, although the residents are\nassociated with illegal sales (guns and drugs) and street gangs (Venkatesh, 2000).\nWhile demonstrating insightful arguments regarding the successes and failures, this liter-\nature explored the social and economic factors of the two projects. The impact of their\nphysical environment has been rarely discussed. I have developed an analytical framework\nto focus on the physical aspect of the two communities. This study compares Robert Taylor\nHomes in Chicago and HanGang Apart Complex in Seoul in order to address the following\nquestions: What are the design elements that contributed to the successes and failures of\nmodern multi-family housing? In what ways did these design elements influence the two\nhousing projects? By comparing the two projects, this study aims to provide urban design\nlessons for successful housing developments in Chicago and Seoul.\nThe comparison is conducted through two stages of an analytical framework: (1) identifying\nsuccessful and unsuccessful outcomes of the two developments and (2) analyzing design\nelements that contributed to the successes and failures. First, the outcomes of the two projects\nwill be evaluated based on three measures: (1) the demographics (income level, employment\nstatus, and crime rate) of the residents, (2) social integration and empowerment, and (3) the\nreplicability of the development patterns. Second, I will explore the built environment of\nthe two projects to identify significant design elements in terms of: (1) the accessibility of\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nlocations, (2) the diversity of land uses, (3) the spatial distinction by building configuration,\n(4) the vibrancy of public spaces, and (5) the variance of housing units.\nThe Successes and Failures of Modern Multi-Family Housing\nThis section evaluates the successes and failures of the two projects. The success can be\nmeasured by basic demographics, such as income level and employment status of residents.\nThe higher income level and the more stable job status the residents retain, the more successful\nthe projects are. However, the demographics should be carefully treated, because the differ-\nences in demographics can be not only the outcome but also the cause of the success or\nfailure of developments. Also, social integration and empowerment can be a strong indicator\nof successful developments. Well integrated residents tend to be satisfied with and attached\nto their society, so they try to sustain their own neighborhood. Social integration and em-\npowerment can be operationalized through indicating the presence of neighborhood associ-\nations and their regulations. Replicability is the last indicator that presents how the projects\nwere evaluated by later planners. Successful projects tend to be replicated in other places.\nIn contrast, once a certain model fails, another model tends to substitute for the failure. By\nevaluating the two projects with these measures, the study concluded that Robert Taylor\nHomes was an obvious failure, whereas HanGang Apart Complex has been a success (see\nFigure 2).\nFigure 2 Left: The Demolition of Robert Taylor Homes, Right: Massive Apart Developments\nin Seoul (Kang, 1999)\nThe Modern Ghetto: Robert Taylor Homes, Chicago\nRobert Taylor Homes is regarded as one of the most miserable failures of the United States'\npublic housing development. This failure was the symbol of the end of urban renewal in\nChicago. Although the modern ghetto ended up being demolished, the legacy of this failure\nstill remains. The superblocks of Robert Taylor Homes remain empty. The Chicago Housing\nAuthority plans to redevelop this site with different strategies, aiming at building a mixed-\nincome neighborhood. However, can the CHA's new urban design achieve this goal?\nDemographics of Residents\nInitially, the demographic characteristics of Robert Taylor Homes were a mixture of equal\nproportions of middle-class, working-class, and poor tenants. In the late 1960s, however,\nChicago's economic and market forces caused the socioeconomic decline of Robert Taylor\nJAE SEUNG LEE\n\nHomes' tenants. First, job opportunities for the African American population in Chicago\ndiminished in the early 1970s. Second, the CHA's budget problems created maintenance\nshortfalls such as plumbing and elevator maintenance, which threatened the quality of life,\nparticularly in the high-rise public housing. Third, the housing shortage in the 1950s and\nearly 1960s had eased in Chicago, which provided housing options to the working-class.\nSoon, working-class, two-parent families left Robert Taylor Homes, and non-working, female-\nheaded families filled the vacancy. The population dropped and became homogeneous, which\nintensified poverty concentration and racial segregation (Hunt, 2001). Finally, these homo-\ngeneous demographic characteristics ended up as a miserable failure.\nSocial Integration and Empowerment\nDespite Robert Taylor Homes' image as a place of drugs, crime, and violence, there were\ncertain types of social integrations in the community. Its social groups were highly, albeit\ninformally, organized by community members. Many young males, although members of\nstreet gangs, had jobs and went to schools. They were also members of their families as\nfathers or sons (Hammett, 2003). The street gangs functioned as a peer group for the young\nmales. During the 1960s and 1970s, \"the Mamas Mafia,\" that was an informal group of\nwomen emerged as community leaders. The women watched over their children and confron-\nted street gangs in the public spaces (Venkatesh, 2000). However, these social activities\nwere either associated with crime or, although positive, not strong enough to keep their\nneighborhood healthy.\nReplicability of the Development Pattern\nSince the demolition, Robert Taylor Homes' development pattern has never been replicated\nin Chicago. Instead, New Urbanism emerged as an alternative and HOPE VI program with\nlow-scale, neo-traditional buildings was planned to replace urban renewal projects. HOPE\nVI's building typology can be characterized as a low-rise, walk-up apartment, which was a\nprevailing housing type before World War II. The dream of modern high-rise housing was\ndispersed in Chicago and may not be repeated again in the future.\nThe Republic of Apart: HanGang Apart Complex, Seoul\nHanGang Apart Complex was successful in changing negative perceptions about modern\nmulti-family housing, Apart. Its success had enormous impact on the housing development\npattern in Seoul. Although Seoul has been the capital of Korea for 600 years, massive Apart\ndevelopments reshaped a remarkable portion of this old city's contemporary urban form.\nDemographics of Residents\nHanGang Apart Complex has been one of the most affluent communities in Seoul. The\nKorean government deliberately tried to attract wealthy people to Apart by advertising Apart\nas a convenient, clean, and even luxurious housing type. As a consequence, the upper-middle\nclass, public officials, and foreigners became the majority of its residents. Once wealthier\npeople occupied it, HanGang Apart Complex began to be perceived as an affluent community\nand the real estate price significantly increased. The positive perceptions and the increasing\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nreal estate price kept attracting wealthier people and preventing poor people from moving\nto the community. HanGang Apart Complex has been able to retain wealthier people. In this\nsense, it may be appropriate to consider HanGang Apart Complex as a successful housing\ndevelopment (Gelezeau, 2004).\nSocial Integration and Empowerment\nThe majority of social activities in HanGang Apart Complex have taken place through wo-\nmen's organizations. While most male residents stay at their working places during the day,\nhousewives organized formal and informal social groups. The official neighborhood organ-\nization was also run by women. They regulated certain activities such as motorcycling or\nsoliciting. Also, wealthy housewives maintained the environment to keep their community\nclean and safe, as well as the price increasing. This social integration demonstrates that the\nhousing development successfully established an active community.\nReplicability of the Development Pattern\nHanGang Apart Complex triggered massive Apart development in Seoul. The Apart became\na financially and socially successful model and HanGang Apart Complex's typology has\nbeen repeatedly replicated. Seoul was rapidly filled with Apart complexes since the success\nof HanGang Apart Complex. This radical transition of urban form fundamentally changed\nthe traditional structure of Seoul as well as the lifestyle of citizens. Seoul has become the\nRepublic of Apart. In spite of the negative aspect of monotonous Apart developments, the\nsuccess of HanGang Apart Complex is undeniable.\nWhat are the factors that contributed to these contrasting successes and failures of similar\nprojects? These results are the outcomes of complex dynamics among various factors, such\nas the housing policy of the two governments, real estate mechanisms of the two cities, and\nthe built environment of the two projects. However, although it is important to understand\nthe dynamics between the factors, I will focus on the urban design elements that contributed\nto the results, in order to explore the role of urban design in housing development.\nSignificant Design Elements: Robert Taylor Homes and HanGang Apart\nComplex\nIn this section, I will discuss significant design elements that contributed to the successes\nand failures of two housing projects. In general, Robert Taylor Homes and Hangang Apart\nComplex are similar with regard to their architectural typologies and sizes. Both projects\nare composed of monotonous concrete-freestanding buildings in superblocks. When completed\non 80-acre sites in Bronzeville of the South Side of Chicago, in 1962, Robert Taylor Homes\nwas the largest housing project in the United States. It consisted of 28 freestanding 16-story\nbuildings with 4,321 apartment units (Wright, 2002). HanGang Apart Complex was composed\nof a series of Apart developments which included Public Official's Apart, HanGang Mansion\nApart, HanGang Foreigner's Apart, and HanGang Private Apart. These Aparts were built\nover time on 74-acre sites with 3,260 apartment units (Kang, 1999) (see Figure 3).\nJAE SEUNG LEE\n\nFigure 3 Left: The Historic Aerial Photos of Robert Taylor Homes, Right: The Stages of\nHanGang Apart Complex development (Kang, 1999)\nDespite these similarities, the two projects demonstrate different design elements with regard\nto locations, land uses, building configurations, public spaces, and housing units. These\ndifferences may provide clues to understand the inconsistent results between the two housing\ndevelopments. Therefore, by comparing these elements, I will explore how these elements\nwork in the specific socio-economic contexts.\nThe Accessibility of Locations\nThe locations of both projects were isolated from major activity centers such as central\nbusiness districts, although road systems and public transit provide access to the communities.\nRobert Taylor Homes was close to the Dan Ryan Expressway that is a major highway of the\nChicago metropolitan area. The Red line \"L\" that runs along the Dan Ryan Expressway and\nelevated green line \"L\" had stops around Robert Taylor Homes. Thus, the residents of Robert\nTaylor Homes seemed to have enough public transportation options. In HanGang Apart\nComplex, the arterial road that runs through the middle of the complex provided the\nvehicular access and bus system to the community. Seoul's subway system could not cover\nthe community (see Figure 4).\nFigure 4 Left: the Location of Robert Taylor Homes, Right: the Location of HanGang Apart\nComplex\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nRegardless of the public transit and the expressway, Robert Taylor Homes was socially se-\ngregated. It was located within Chicago's South Side \"black belt\" ghetto where African\nAmericans were confined by racial segregation. This location was selected as a result of the\nsocial and racial conflicts. The Chicago Housing Authority proposed to build public housing\non a vacant land in a white area. The city's aldermen and racists refused racial integration\nby opposing the CHA's site selection. Instead, the current site in the South Side black belt\nwas approved to make second ghetto on the top of the first one (Hunt, 2001).\nAlong with the policy for the segregation, the physical environment around Robert Taylor\nHomes was also deliberately planned to confine the African American community within a\nboundary. The Dan Ryan Expressway was not planned to connect Robert Taylor Homes to\ndowntown Chicago but to separate the public housing from the white neighborhood of\nBridgeport. The elevated railroad track on the east site of the site also blocked the neighbor-\nhood from the surrounding areas with the Expressway. Consequently, Robert Taylor Homes\nwas bounded by the Expressway, the railroad, the existing ghetto, and another public housing\nproject south of Illinois Institute of Technology (Wright, 2002).\nHangGang Apart Complex was spatially separated from Seoul's activity centers. The site\nwas located on the reclaimed land on the north edge of the Han River (Kang, 1999). On the\nnorth of HanGang Apart Complex, the U.S. military base separated the community from the\ninner city of Seoul at that time. The only access was an arterial road which is the main street\nof the complex. While subway services were not provided, the only public transportation\nwas a bus service. These physical elements limited the accessibility to the HanGang Apart\nComplex.\nThe accessibility to the two projects does not seem to be a critical factors of the success\nand failures. Robert Taylor Homes had better public transportation options than HanGang\nApart Complex, but this advantage did not contribute to the success of Robert Taylor Homes.\nRather, the demographic aspects had a strong impact on the accessibility, for example, most\nrich residents of HanGang Apart Complex owned their own automobiles.\nThe Diversity of Land Uses\nBoth projects had neighborhood facilities (playgrounds, social rooms, and schools). However,\nRobert Taylor Homes' neighborhood facilities were not sufficient in size or quality consid-\nering its population (27,000 residents and 2,000 children); HanGang Apart Complex's facil-\nities have been sufficient and well utilized. The retail strip of HanGang Mansion Apart that\nfaces the main arterial road is the most distinctive difference (see Figure 5).\nJAE SEUNG LEE\n\nFigure 5 Left: Other Uses around Robert Taylor Homes, Right: Retail and Neighborhood\nFacilities at HanGang Apart Complex (Red: Retail, Yellow: Neighborhood Facility)\nIn an effort to provide social services, the CHA leased apartments to social agencies, but the\nneighborhood facilities proved woefully insufficient to satisfy the residents' needs. In 1964,\nthe CHA reported that \"children lined up seven and eight deep just waiting to use a piece of\nplay equipment [and] . . . upwards of 2,000 children may be cramped into one or two relatively\nsmall play areas.\" When the Chicago Public Library opened a reading room in one Taylor\napartment in 1969, this reading room was quickly overcrowded by residents, but only one\nadditional reading room was added to meet the demand. Although an ambitious pre-school\nprogram for 425 children was launched by a neighborhood settlement organization, several\nthousand children were living in Robert Taylor Homes (Hunt, 2001).\nThe insufficiency derived from a deliberate underestimation of the residents' demographics.\nThe Chicago School Board intentionally underestimated the number of children, resulting\nin immediately insufficient educational facilities. In 1960, the CHA expected 10,583 element-\nary school children at Robert Taylor Homes to be added to the area. The School Board\nplanned three new schools that could accommodate only 7,765 students. The insufficient\nneighborhood facilities derived not from planners' incapability or mistakes, but rather from\nintentional disregard. Additionally, since Robert Taylor Homes was planned as a single-use\nresidential neighborhood, no retail was included.\nIn contrast, HanGang Apart Complex included sufficient public facilities, including\nschools, retail, and other social spaces. This idea was rooted in Clarence Perry's idea, the\nneighborhood unit. By proposing the neighborhood unit formula, Perry argued that the\nplanning process should take into consideration not only dwellings but surrounding environ-\nments embracing public facilities, such as an elementary school, retail stores, and public re-\ncreational facilities. The formula was designed to promote accessibility to an elementary\nschool, provide sufficient common open space as well as retail shops, and reduce the risk\nof automobile accidents. Essentially, the formula consisted of six values called Neighborhood\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nUnit Principles: the size of a residential unit should accommodate population for which one\nelementary school is required; boundaries wide enough to facilitate by-passing traffic should\nsurround the unit; open spaces should be provided to accommodate communal activities;\ninstitution sites including the school or church should be grouped at a central point or com-\nmons; local shops should be sufficiently provided along the perimeter of the unit; the internal\nstreet system should be designed to facilitate circulation and discourage its use by through\ntraffic. The principles were for professional planners to use in the process of a development\nplan (Perry, 1939).\nIn Korea, Perry's idea had been introduced by the mid 1950s. HanGang Apart Complex\nwas the first example in Korea of a housing project based on the Neighborhood Unit. This\nproject consisted of a series of 'Apart' developments. Although each development was built\nover time, they formed one neighborhood complex centered around public facilities including\nschools, retail, and markets. The public school and retail faced the four-lane main street\nrunning through the middle of the housing complex (Kang, 1999).\nAlthough HanGang Apart Complex had three schools with large playgrounds, as with\nRobert Taylor Homes, the school facilities were not physically sufficient. There were many\nstudents, around 60 students per class. However, large classes with 60 students were a normal\nsize in Korea in the 1970's and 1980's. While there were general concerns regarding insuf-\nficient schools in Korea, the insufficiency regarding HanGang Apart Complex's schools\nwas not more serious than in other communities in Korea. Moreover, despite overcrowded\nclasses, the schools seemed to function well to educate students. Three Apart buildings that\nface the main street have retail and community spaces on the first and second floors,\nproviding sufficient social rooms and a linear retail strip. Other units on the top of the retail\nare residential units, but these residential units along the main street were not favored because\nresidents did not like the noise from the main street.\nThe Spatial Distinction by Building Configuration\nIn HanGang Apart Complex, despite the boring repetition of identical buildings, there is a\nspatial sequence from public territory (a retail strip), to neighborhood territory (Apart clusters),\nand then to private territory (Apart buildings). In Robert Taylor Homes, the spatial distinction\nwas not clear in spite of the intention of clustering apartment buildings (see Figure 6).\nJAE SEUNG LEE\n\nFigure 6 Left: The Site Plan and Photos of Robert Taylor Homes (Miller, 1992), Right: The\nSite Plan and Photos of HanGang Apart Complex (Kang, 1999) (Red: a retail Strip , Yellow:\nApart Clusters)\nRobert Taylor Homes' 28 identical high-rise buildings created a monotonous and oppressive\nenvironment. Buildings were grouped in U-shapes to surround green open spaces. However,\neach building seems to stand alone rather than creating a territory defined by the buildings.\nAs a result, the open spaces were just vacant space without a sense of place. The courtyards,\nplaygrounds, and green spaces were not distinguished as public or neighborhood territory.\nThe building configurations of HanGang Apart Complex were even more monotonous\nand dull. Simple I-shaped buildings were repeated without variation. Fortunately, since\nHanGang Apart Complex was composed of four different Apart clusters, each cluster acquired\nits own neighborhood territory that was distinguished from other clusters. The area along\nthe main street was a public territory that was spatially defined by Apart buildings and retail\nshops on the ground level. The activities in the public territory were different from those of\nneighborhood territory. On the main street, many strangers as well as the residents appeared\ndue to the shops, but these activities did not encroach on the neighborhood territory. This\nspatial distinction and sequence allowed the residents to stay close to the vibrant street but,\nat the same time, maintain a distance to protect their neighborhood from the commotion of\nthe main street.\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nThe Vibrancy of Public Spaces\nRobert Taylor Homes' open spaces were designed as neighborhood public spaces such as\nplaygrounds and courtyards. But these spaces were not safe or vibrant. Instead, open-air\ncorridors at the edge of the buildings were the playgrounds of children who had lost their\nplaygrounds outside. Neighborhood public spaces in HanGang Apart Complex, in compar-\nison, were well used by residents. Even though most open spaces between buildings were\nturned into parking lots, children enjoyed the playgrounds between buildings and many\nresidents as well as strangers were walking through the main street in the middle of the Apart\ncomplex (see Figure 7).\nFigure 7 Left: The Open Corridor and the Courtyard of Robert Taylor Homes (Kuo, Sullivan,\nColey, & Brunson, 1998), Right: The Playground and the Retail Strip of HanGang Apart\nComplex (Kang, 1999)\nIn Robert Taylor Homes, the relationship between buildings and open spaces did not give a\nsense of enclosure, which is important for creating positive quality of open space (Alexander,\nIshikawa, & Silverstein, 1977). Although surrounded by the set of three buildings grouped\nin a U-shape, the courtyards were not well defined because the buildings were not close\nenough to tightly enclose the open space and one side of the courtyard was wide open to\nstreet. Moreover, the open-air circulation corridors were facing the courtyards instead of the\nwindows of housing units. This configuration decreased the visual connection between res-\nidents in their housing and the courtyards, which might resulted in a lack of natural surveil-\nlance on the open spaces (Jacobs, 1961). The poor landscaping of the open spaces was an-\nother problem. Carefully planted trees and other landscape elements could have relieved the\nsterile atmosphere. However, architectural and landscape elements of Robert Taylor Homes\nwere inappropriately designed to create vibrant open spaces.\nJAE SEUNG LEE\n\nIn HanGang Apart Complex, although I-shaped apartment buildings were monotonously\nrepeated, the distances between buildings were relatively shorter, compared to the Robert\nTaylor Homes, and consequently the open spaces were more tightly enclosed. The multiple\nrows of buildings also contributed to the higher degree of enclosure. Most housing units\nwere facing the open spaces and the retail shops of the main street were also facing the\nsidewalks. These elements contributed to the vibrancy of the HanGang Apart Complex's\nopen public spaces, regardless of the dull and boring architecture. Many children played in\nthe playgrounds and their parents could watch them from their homes. Although the spaces\nbetween buildings that were supposed to be parks were mostly turned into parking lots,\ndangerous behavior and crime were very rare in the open spaces. The main street area was\nalso well occupied and there was no concern about safety and security, despite complaints\nabout the noise.\nThe Variety of Housing Units\nRobert Taylor Homes had similar units, whereas HanGang Apart Complex has diverse unit\nsizes and unit layouts (see Figure 8). This contrast derived from the different planning pro-\ncesses and goals between the two cities.\nFigure 8 Left: The Floor Plan of Robert Taylor Homes (Miller, 1992) and The Unit Plans\nof Ogden Courts (SOM, 1950), Right: The Housing Units of Hangang Apart Complex (Kang,\n1999)\nThe housing units of Robert Taylor Homes were poorly designed and monotonous, albeit\nrelatively large. This design problem has been blamed on architects and planners who adhered\nto \"modern\" architecture theory. However, the federal government's obsession with low\ncost was mainly responsible for the poor design. The Chicago Housing Authority officials\nrecognized the problems of high-rise public housing and proposed low-rise designs. But\nfederal officials rejected CHA's scheme because its cost was higher than high-rise housing.\nThe total cost per unit was limited to $17,000 including land cost, which was considerably\nlower than that of private housing developments. Moreover, 79% of the units at Robert\nTaylor Homes had three or more bedrooms because the target population, low-income black\nfamilies, tended to have many children and prefer larger units with many rooms. The larger\nunits decreased the available budget per square foot (Hunt, 2001). Due to the limited budget,\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nno private balconies or terraces were provided, and kitchens and bathrooms were poorly\nequipped. As a result, most housing units of Robert Taylor Homes were large but poorly\nequipped and maintained.\nIn contrast, the diversity of housing units of HanGang Apart Complex was not the result\nof intentional and coherent design, but the consequence of a series of experimental projects\nof the Korean government to test the possibility of Apart. The four Apart clusters (Public\nOfficials Apart, HanGang Mansion Apart, HanGang Foreigners Apart, and HanGang Private\nApart) of the complex were built from 1966 to 1971 without a consistent master plan. The\nKorean government tried to dilute the Apart's negative image at that time and provide Aparts\nnot only to a lower-class but also to a middle-class and upper-middle-class population because\nApart was the most cost-effective housing model for solving the housing shortage in Korea.\nThe first residents were government officials. They might have been the easiest group for\nthe government to recruit. After completion of Public Officials Apart, the government tried\nto attract the upper-middle class to Apart by building HanGang Mansion Apart. As \"Mansion\"\nconnotes, HanGang Mansion Apart aimed to be luxurious housing. It had larger units than\nPublic Officials Apart, and provided equipment, such as a gas heating system, a larger kitchen,\nand balconies, which were revolutionary conveniences at that period in Seoul. HanGang\nForeigners Apart was also developed to provide better housing to foreigners in Seoul. Finally,\nprivate developers joined this project and developed HanGang Private Apart, which targeted\nthe middle-class with smaller units than HanGang Mansion Apart's units (Gelezeau, 2004).\nThrough this process, several different unit types that targeted different demographic\ngroups had been provided, which resulted in a mixed-income community whose residents\nare upper-middle class, middle class, government officials, and foreigners. Therefore, Han-\nGang Apart Complex could succeed in satisfying three different demographic groups because\nof the variety of its housing units in size and layout and household conveniences (Gelezeau,\n2004).\nFindings and Recommendations\nThis paper has discussed the successes and failures, as well as significantly similar and dif-\nferent design elements, of the two housing projects, through the analytical framework. The\nfindings from this exploration will be reflected through urban design theories to gain insight\ninto the role of physical environments in city development processes, and to seek lessons\nfor better urban designs in specific contexts. Below, I will recommend several urban design\nstrategies, mostly for high-rise, superblock housing developments. These suggestions may\nbe more valid for Seoul than Chicago because Chicago has abandoned the modern multi-\nfamily housing project after the end of urban renewal, whereas this housing type is still\npopular in Seoul and other developing countries in Asia. However, since these lessons are\nderived from the experience of Chicago and Seoul, they may be worthwhile to consider for\nChicago's housing developments.\nTerritoriality\nSpatial distinction and sequence, through a series of territories, promote the sense of neigh-\nborhood and ownership. Alexander suggested to lay out spaces of a building so as to create\na spatial sequence which begins with the entrance, the most public parts of the building, and\nJAE SEUNG LEE\n\nthen leads into the more private areas and finally to the most private areas (Alexander et al.,\n1977). This architectural level of intimacy gradient can be applied to the spatial sequence\nof territories at the community scale. A private territory at the neighborhood scale is identified\nby clustering houses. People tend to feel comfortable in their house when the buildings are\nclustered (Alexander et al., 1977). The residential territories enhance the residents' sense of\nresponsibility and ownership, influencing them to care for their own environment and control\nthe penetration of strangers (Newman, 1973). Retail shops and neighborhood facilities\ngrouped as a cluster form a semi-private territory. The sequence through these neighborhood\nterritories corresponds to the degrees of privateness, similar to the intimacy gradient on an\narchitecture scale.\nThe U-shaped building configuration of Robert Taylor Homes tried to cluster buildings\nand create a certain degree of territory. But it failed to provide an intermediate territory that\nwould mediate the relationships between Robert Taylor Homes and the surrounding ghetto.\nHanGang Apart Complex was composed of four clusters of Aparts in which, despite the dull\nrepetition of identical buildings, each cluster had its own boundary and entrances. The en-\ntrances were not gated but defined the boundary for controlling strangers. The main street\nfunctioned as a semi-public territory. Through these territories, HanGang Apart Complex\ncreated a perceptible spatial sequence, which is likely to have heightened the sense of re-\nsponsibility of residents. Thus, territoriality may contribute to more neighborly community\nin modern multi-family housing.\nLinear Retail Strip\nA linear retail strip that is mixed with housing invites not only residents but also strangers,\nwhich creates a vibrant public space and encourages more social activities. There are many\nadvantages of linear retail strips over scattered retail. Strips with restaurants, clinics, libraries,\nand meeting rooms serve both a distant and a nearby market. Each shop on a strip has equal\nopportunities, which allows incremental commercial developments. A strip is flexible, allow-\ning additions and changes. Also, a retail strip is more pedestrian friendly (Lynch & Hack,\n1984). Alexander also explained that \"shopping centers depend on access: they need locations\nnear major traffic arteries. However, the shoppers themselves don't benefit from traffic: they\nneed quiet, comfort, convenience, and access from the pedestrian paths in the surrounding\narea.\" Therefore, he argued that local shopping centers should be encouraged to grow in the\nform of pedestrian streets (Alexander et al., 1977). New Urbanism also seeks to build mixed-\nuse neighborhoods. Their developments are often associated with the building typology that\nhas retail on the ground floor and residential above. These theories posit that a linear retail\nstrip mixed with housing may be effective for creating vibrant streets. But it is necessary to\nexplore whether this model is still valid for modern multi-family housing in a superblock,\nbecause the theories have been tested in different contexts.\nKorean Aparts offer empirical evidence that a linear retail strip is effective with modern\nmulti-family housing. In HanGang Apart Complex, the linear retail strip in modern multi-\nfamily housing first appeared in Korea. A few later Apart developments also included linear\nretail strips. These retail strips encouraged street activities and created neighborhood activity\nzones between the housing and the surrounding areas. As a consequence, they relived the\nproblem of dead streets without activities around the superblocks, which can be observed at\nmany other superblock housing developments. However, despite this positive impact, the\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nmajority of Aparts have not included linear retail strips. Many planners and designers con-\nsidered retail as a way to promote of Apart sales, disregarding the strips' possibility to me-\ndiate the relationship between superblocks and surrounding cities (Kang, 1999). When retail\nis not important for financial feasibility, most Aparts have been developed as single-use\nresidential areas. The edges of these Aparts complexes become inactive zones. Thus, a linear\nretail strip will be an appropriate strategy to create a neighborhood semi-public space as a\ntransitional space from urban public activities to neighborhoods social activities.\nNeighborhood Public Space under Natural Surveillance\nEnclosed neighborhood public spaces under natural surveillance accommodate healthy\nneighborhood activities. Every healthy neighborhood requires public outdoor rooms where\npeople can comfortably spend time (Alexander et al., 1977). Outdoor rooms are defined by\nbuildings, trees, and other topographic elements. Although open spaces are partially enclosed,\nthe shape of space and elements can define a \"readable\" open space with an imaginary\nboundary. Once readable space is created, it has strong emotional effects: the intimacy of a\nsmall space and the exhilaration of an opening in the enclosed space (Lynch & Hack, 1984).\nWithout proper enclosure, open rooms are merely \"left out\" space (Alexander et al., 1977).\nThe activities in these open spaces should be visible for natural surveillance. Places that\nconceal human activities are \"cold.\" To observe and stay close to human activities is enter-\ntaining and provokes more activities (Lynch & Hack, 1984). Moreover, natural surveillance,\nwhich is an ability to observe public areas and to feel that one is under observation in public\nareas, has an impact on securing the environment for healthy activities by reducing irrational\nfears and anxieties (Newman, 1973).\nRobert Taylor Homes' open spaces were neither appropriately enclosed nor visible from\nresidential units. Street gangs occupied the open spaces and children were kept in the open\ncorridors, which implies that, to a certain degree, the lack of the sense of enclosure and nat-\nural surveillance might contribute to the open spaces becoming dangerous. HanGang Apart\nComplex also has small open spaces. In an effort to increase the density, the buildings were\nlaid out as close as possible to each other, which created the well enclosed, intimate size of\nthe open spaces. These open spaces were either actively occupied, or at least, did not cause\nfears or anxieties. Thus, proper building configuration, considering proper building heights,\nthe distance between buildings, the building layout that can enclose open spaces, the visual\nconnection between open rooms and houses, may create vibrant neighborhood open spaces.\nDiverse Housing Choices\nDiverse unit sizes and types invite various people in terms of income levels or occupations,\nthus supporting mixed-income neighborhoods. Alexander has discussed the importance of\nindefinable neighborhoods and household mix. He argued that \"people need an identifiable\nspatial unit to belong to.\" He also mentioned the importance of household mix that supports\npeople who have reached different stages in the life cycle. He argued that \"no one in the life\ncycle is self-sufficient.\" Similarly, no demographic group in the society is self-sufficient. In\nmany cases, a tendency to be separated among social groups can be identified. But the se-\ngregation tends to cause many social problems. If the mixed community is beneficial to the\nJAE SEUNG LEE\n\nresidents and society, how can urban design contribute to identifiable and mixed neighbor-\nhoods?\nAlexander et al. (1977) advocate keeping neighborhoods small enough to give the residents\nsome degree of autonomy. However, in large cities like Seoul, it may not be realistic to\nachieve identifiable neighborhoods through controlling the size and population. Rather, it\nmay be more realistic to achieve the identity by differentiating the built environment on\nseveral scales, such as housing units and clusters. The differentiated housing types may attract\ndiverse social groups who may have different needs and preferences. Discussing degrees of\npublicness, Alexander also insisted on making a clear distinction between three kinds of\nhomes: those in quiet areas, those on busy streets, and those that are in between, because\npeople are different and want different kinds of houses.\nSeoul's housing policy has aimed at providing housing rapidly and inexpensively to deal\nwith housing shortage. Private developers also prefer uniform units and layouts to minimize\ncost and maximize their benefit. Although there are different units at HanGang Apart Com-\nplex, this diversity is a result of four experimental projects. Most Apart developments after\nHanGang Apart Complex have only a few unit types due to the government's housing policy\nand the projects' profitability. The private developers have objected to the Korean govern-\nment's policy that mandates private housing developments to include small units for the\nlow-income population, because the small units make housing projects less profitable in the\nKorean housing market. Recently, the housing supply in Seoul has become sufficient and\nthe quality of living environments began to emerge an public interest rather than the quantity\nof housing supply. Mixed and indefinable neighborhoods may be one way of achieving an\nimproved quality of life.\nThe HOPE VI program in Chicago needs to consider its physical diversity. The low-rise,\nneo-traditional buildings of HOPE VI are supported by New Urbanism. However, the\nbuilding typology is similar to the buildings of the ghetto that Robert Taylor Homes replaced.\nWithout careful consideration, to reintroduce a traditional typology may cause another\nproblem. HOPE VI aims at a mixed-income neighborhood. Can uniform low-rise, neo-tradi-\ntional buildings achieve this goal?\nIt may be obvious that such diversity of housing units alone cannot achieve mixed and\nindefinable neighborhoods. The favorable neighborhoods can only be developed as a result\nof the various factors' long-term interaction. However, no matter how other factors, such as\nhousing policy or real estate economics, support mixed neighborhoods, it is difficult to ac-\ncommodate various people without diverse and identifiable housing. Diverse housing that\nprovides choices can satisfy various needs and compensate for improper policies, if any, to\nmaintain the mixed neighborhood. Strategic design and layout of housing units, derived from\nsensitive analysis of the residents' needs and preferences, is essential for better housing de-\nvelopments.\nLimitations and Further Research\nThere are inevitable limitations in this study. The two cases of Robert Taylor Homes in\nChicago and HanGang Apart Complex in Seoul are extreme cases in the specific political\nand socio-economic contexts of the two cities. Therefore, the generalizability of this study\nis limited within those specific contexts. Additional studies of other cases in different contexts\nmay enhance its generalizability, as well as internal validity. Also, there are many factors\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nsuch as housing policy and local economics that impact the successes and failures of housing\ndevelopments. Among these various factors, what is the role of the physical design? A\nquestion-how does the built environment interact with other factors?-remains unanswered.\nDespite these limitations, this study offers the understanding of the contribution of design\nelements to successful housing developments.\nReferences\nAlexander, C., Ishikawa, S., & Silverstein, M. (1977). A pattern language : towns, buildings, construc-\ntion. New York: Oxford University Press.\nCalthorpe, P., & Fulton, W. (2001). The regional city : planning for the end of sprawl. Washington,\nDC: Island Press.\nGelezeau, V. (2004). Ville geante, cites radieuses\nHammett, K. (2003). The other side of the ghetto. Urban land, 62(1), 52-54.\nHunt, D. B. (2001). What went wrong with public housing in Chicago? A history of the Robert Taylor\nhome. Journal of the Illinois State Historical Society 94(1), 96-122.\nJacobs, J. (1961). The death and life of great American cities. New York: Random House.\nKang, B. (1999). The History of the Multi-Family Housing Planning in Korea.\nKuo, F. E., Sullivan, W. C., Coley, R. L., & Brunson, L. (1998). Fertile Ground for Community: Inner-\nCity Neighborhood Common Spaces. American Journal of Community Psychology, 26(6),\n823-851.\nLynch, K., & Hack, G. (1984). Site planning. Cambrige, Mass.: MIT Press.\nMiller, R. (1992). Housing rehabilitation: poor architecture: a cautionary tale, Robert Taylor Homes,\nChicago. Progressive Architecture, 73(8), 72-73.\nMoudon, A. V. (1992). A Catholic Approach to Organizing What Urban Designers Should Know.\nJournal of Planning Literature, 6(331).\nNewman, O. (1973). Defensible space; crime prevention through urban design. New York: Collier\nBooks.\nPerry, C. A. (1939). Housing for the machine age (Vol. Russell Saga Foundation). New York\nRybczynski, W. (1993). Bauhaus Blunders. Public Interest, 113, 82-90.\nSOM. (1950). Open Corridor Design. Architectural Forum, 84-85.\nVenkatesh, S. A. (2000). American project : the rise and fall of a modern ghetto. Cambridge, Mass.:\nHarvard University Press.\nWright, G. (2002). End of the experiment [Robert Taylor Homes, Chicago]. Architecture, 91(3), 29-\n33.\nAbout the Author\nJae Seung Lee\nJae Seung Lee is an architectural and urban designer and researcher whose practice and re-\nsearch have engaged the global cities of New York, Chicago, and Seoul. His research focuses\non the relationships between the built environment and human behavior. Particularly, he\nexplores the impact of the housing developments' built environment on the residents' social\nactivities and travel patterns. He believes that in order to improve our urban environment,\nprofessionals should actively communicate with the general public, which led him to write\na book about the urbanism of New York in 2008. This book, New York Streets that Aged\nwith Time, published in Korea, is an introduction to urban history and theory related to sig-\nnificant places in Manhattan not only for architects but also for non-professionals. As a\nJAE SEUNG LEE\n\nsenior architect, he worked for Wondoshi Architects Group in Seoul for five years, workingon\nvarious architectural projects, such as offices, schools, and memorials. He received his\nBachelor of Art and Engineering degrees from the Seoul National University and his Master\nof Architecture and urban design degrees from the University of Michigan.\nDESIGN PRINCIPLES AND PRACTICES: AN INTERNATIONAL JOURNAL\n\nEDITORS\nBill Cope, University of Illinois, UrbanaChampaign, USA.\nMary Kalantzis, University of Illinois, UrbanaChampaign, USA\nEDITORIAL ADVISORY BOARD\nGenevieve Bell, Intel Corporation, Santa Clara, USA.\nMichael Biggs, University of Hertfordshire, Hertfordshire, UK.\nThomas Binder, Royal Danish Academy of Fine Arts, Copenhagen, Denmark.\nJeanette Blomberg, IBM Almaden Research Center, San Jose, USA.\nEva Brandt, Danmark Designskole, Copenhagen, Denmark.\nPeter Burrows, RMIT University, Melbourne, Australia.\nMonika Buscher, Lancaster University, Lancaster, UK.\nPatrick Dillon, Exeter University, Exeter, UK.\nKees Dorst, TUe, The Netherlands; UTS, Australia.\nKen Friedman, Swinburne University of Technology, Melbourne, Australia;\nDenmark's Design School, Copenhagen, Denmark.\nMichael Gibson, University of North Texas, Denton, USA.\nJudith Gregory, IIT Institute of Design, Chicago, USA; University of Oslo,\nOslo, Norway.\nClive Holtham, City of London University, London, UK.\nHiroshi Ishii, MIT Media Lab, Cambridge, USA.\nGianni Jacucci, University of Trento, Trento, Italy.\nKlaus Krippendorff, University of Pennsylvania, Philadelphia, USA.\nTerence Love, Curtin University, Perth, Australia.\nBill Lucas, MAYA Fellow, MAYA Design, Inc., Pittsburgh, USA.\nEzio Manzini, Politecnico of Milano, Milan, Italy.\nJulian Orr, Work Practice & Technology Associates, Pescadero, USA.\nMahendra Patel, Leaf Design, Mumbai, India.\nToni Robertson, University of Technology Sydney, Sydney, Australia.\nTerry Rosenberg, Goldsmiths, University of London, London, UK.\nKeith Russell, University of Newcastle, Callaghan, Australia.\nLiz Sanders, Make Tools, USA.\nMaria Cecilia Loschiavo dos Santos, University of Sao Paulo,\nSao Paulo, Brazil.\nLucy Suchman, Lancaster University, Lancaster, UK.\nIna Wagner, Technical University of Vienna, Vienna, Austria.\nPlease visit the Journal website at http://www.DesignJournal.com\nfor further information about the Journal or to subscribe."
    }
  ]
}