{
  "course_name": "Listening to the Customer",
  "course_description": "The 15.821 and 15.822 Sequence\nMarketing research may be divided into methods that emphasize understanding “the customer” and methods that emphasize understanding “the market.” This course (15.821) deals with the customer and emphasizes qualitative methods (interviews, focus groups, Voice of the Customer, composing questions for a survey). The companion course (15.822) deals with the market and emphasizes quantitative methods (sampling, survey execution, quantitative data interpretation, conjoint analysis, factor analysis).\nThe methods covered in 15.821 are often used in the “front-end” of market research project, whose second-stage is a quantitative survey. The quality of information gathered in the second-stage is greatly enhanced in this way.\n15.821 is designed for the nonspecialist, e.g., someone planning a career in general management, product or project management, R&D, advertising, or entrepreneurship. 15.822 teaches analytical techniques that are standard in consulting or marketing research, and is ideally suited for students planning careers in those fields.",
  "topics": [
    "Business",
    "Marketing",
    "Social Science",
    "Business",
    "Marketing",
    "Social Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nObjectives of 15.821\n\nThis course has three complementary objectives, namely, to:\n\nprovide a concise \"user's guide\" to the most valuable and common qualitative customer research methods (focus groups, customer visits, interviews)\n\nteach key skills for \"do-it-yourself\" customer research (preparing & conducting interviews, group discussions, surveys, and site visits)\n\nthrough a full-course project, teach all the basic steps of a Voice of the Customer exercise\n\nRequirements\n\nYou will need a tape recoder for your interviews.\n\nGroup Project (3-4 students per project)\n\nThis material is tough to learn from a textbook. Therefore, a major element of the course is a survey-based group project. It breaks down into seven tasks, which roughly coordinated with the seven weeks of the course:\n\nSelecting a topic and formulating a research plan\n\nPreparing for customer interviews\n\nConducting and taping interviews\n\nTranscribing the interviews and identify customer statements or \"voices\"\n\nInterpreting or \"scrubbing\" the voices, and organizing into a hierarchy\n\nProposing a new concept or solution based on the voices\n\nWriting the research report\n\nA typical problem involves understanding the customers' perspective in a new market. You will have a lot of freedom in choosing the problem, as long as it allows application of all of the steps.\n\nGrading\n\nGroup Project: 50%\n\nClass Participation: 50%\n\nProject reports are due in class.",
  "files": [
    {
      "category": "Resource",
      "title": "Overview of the Voice of the Customer Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/346426e053117e9fc9112e0bde4a6d9c_assignment_12.pdf",
      "content": "Overview of the Voice of the Customer Project\nThe project will teach you how to conduct a Voice of the Customer, and how to incorporate\nthe information that you collect into a professional survey.\nThere are three deliverables:\n-\nInterview discussion guide\n-\nInterview transcripts\n-\nFinal report\nHere are the steps in the project.\nStep 1 Pick team\nFor the project you will need to create teams of 3-5 persons (teams of 4 are\nrecommended). You can look over samples from previous projects in the course\npacket.\nStep 2 Pick topic and prepare interview guide\nPick the project objective.\n*** Express the objective using one or more of the five key verbs\n(forming the GUIDE acronym):\nGenerate (...customer needs in connection with a product or service).\nUnderstand (...the customer's point of view about an issue or problem).\nIdentify (...areas where current product performance falls short).\nDescribe (... the decision process of a certain type of customer)\nExplore (... the customer's perceptions of a company, or product).\nYou don't want an objective that is narrow or quantitative (e.g., forecasting market\nshare for a new product, sizing a market, etc..).\nAfter you have selected the topic, you should then recruit several customers (at\nleast one per team member) and give them their \"homework assignment.\" This\nassignment is an adaptation of the key steps used in ZMET (see readings for Feb 22\nclass). You will ask each customer to collect 6-12 images that are in some way\nrelated to the topic. The images can come from any source (preferably, they are\nphotos, e.g., by iPhone, taken just for the exercise, but they can also be clips from\nmagazine). The images should be brought to the interview. Give the customers at\nleast 3-4 days to collect the pictures. Tell them not to do the collecting just before\nthe interview.\n\nWhile the customers are collecting their images, you should schedule a meeting to\nwork out the interview guide. Follow the guidelines in Voices Into Choices, Step 4.\nYou can also look at the examples in the Consumer Behavior Exercise (distributed on\nFeb 7). The guide should be short, fitting on one page. It is due in class on Feb 14 -\ndo not conduct your interview until we have checked your interview guide.\nStep 3 Conduct customer interviews\nThe interview itself should have two parts. In the first part of the interview, ask the\ncustomer to describe how each particular image they brought to the interview is\nrelated to the topic. In the second part, continue the interview with questions from\nyour previously prepared interview guide. Throughout the interview, do be satisfied\nwith easy answers, but probe for hidden meanings. Follow the interview guidelines in\nVoices into Choices (Steps 10 or 12), or in Customer Visits (Chapter 4).\nYou should tape the interview.\nStep 4 Transcribe customer interviews and identify voices\nWorking from the tapes, create a transcript of the interview, and make two copies.\nDistribute the copies among the team members. The goal is to have two team\nmembers separately read each transcript. For example, if your team has three\nmembers, and you interview four individuals, then the \"reading assignments\" should\nlook like this:\nCustomer 1\nCustomer 2\nCustomer 3\nCustomer 4\nTeam member 1\nx\nx\nx\nTeam member 2\nx\nx\nx\nTeam member 3\nx\nx\nEach team member should sit down alone with their transcripts and identify a set of\ncustomer statements. Follow the guidelines for identification from Voices into\nChoices (Step R15 or T15).\nA crucial part of this process is capturing the customer's own voice, with a minimum\nof interpretation. You may want to begin by simply highlighting key statements from\nthe interview transcripts. We call these statements voices. They could be needs,\nconcerns, images, experiences, feelings, problems, solutions, or anything else that\nhelps us understand the customer's point of view.\nNext, write out the voices on the self-stick notes, only editing where necessary to\nimprove understanding or eliminate irrelevant details. Number each voice and\nidentify your own notes by writing your initials in one corner. These voices on self-\nstick notes will be used during the in-class exercise to help your group create a\nmental image of the entire customer's voice. The voices collected from a single\ncustomer interview are likely to vary widely. In Step 4, the goal is simply to\ndocument the voices identified by the interview and not to analyze the relationships\namong them.\n\nStep 5A Interpretation or 'scrubbing' of the voices (class exercise)\nThe scrubbing process is described in Voices into Choices (Step R16), and we will\nreview it briefly in class. The output is a list of 25 of fewer nonredundant and\nsemantically 'scrubbed' customer needs or requirements.\nThe goals of step 5A are to combine the voices identified by each of the team\nmembers on self-stick notes into a set of voices agreed upon by the team, and to\ntranslate these voices into customer needs or requirements. The output of this\nprocess will be a set of 25 or fewer key customer requirements.\nNOTE: Translating voices into requirements is appropriate if the objective of your\nproject is to understand customer needs or likes/dislikes in a given domain. Typically,\nthis would then lead to the development of new concepts - for products, services, ad\ncampaigns, and so on. If your project has a very different objective, then it may be\nmore appropriate to translate the voices into some other format (not 'requirements'\nper se).\nTime breakdown for the class exercise:\n(30 min) Each team member brings their set of voices from Step 4 to the exercise.\nOne team member begins placing his or her voices on a sheet of flip chart paper, and\nreads each voice aloud to the team as it is placed on the chart. If other team\nmembers have identified the same or a very similar voice, they stack their notes on\ntop of the original note, completely covering it. (As a general rule, similarity among\nvoices is indicated by placing them closer together on the chart.) After the first\nteam member has finished reading his or her voices, the next team member reads\nany of his or her remaining voices. The process continues until all voices are placed\non the chart.\n(15 min) The next step is to select the most essential voices (not more than 25)\nwhich represent the customer's perspectives, opinions, or feelings (see Step R15, p.\n251 in Voices into Choices). If several voices reflect the same thoughts, pick the\nvoices that best describe a need rather than a similar statement that is more\nnarrowly solution-focused. Focus on the concrete, first-hand experiences of your\ncustomer rather than generalizations. As you select voices, move them to a second\nsheet of flip chart paper. Once you have consolidated similar voices, if you are still\nleft with more than 25, agree on the most essential voices as a team. Discard the\nothers from the chart.\n(45 min) The final step is to construct Requirement Statements. The goal of this\nstep is to create a set of action-oriented statements identifying functions that are\ncritical to the customer. First, transfer the self-stick note documenting each of the\ncore 25 voices to the top section of the requirement worksheet. Next, identify 1-3\nkey ideas being conveyed by the voice. Finally, write an action-oriented statement\nthat translates the voice into a requirement following the guidelines outlined below.\nKeep in mind that one voice might translate into two or more requirements, each of\nwhich may reflect a different key item.\n\nStep R16 in Voices into Choices gives guidelines about translating customer voices\ninto requirements. Here are some examples in the context of student evaluation of\ncafeteria service:\n\nAvoid statements in the negative form: use \"open during peak student\ndemand\" rather than \"doesn't close early.\"\n\nUse multi-valued attributes rather than two-valued (yes/no) attributes:\nuse \"minimize time spent getting and paying for food\" rather than \"no\nwaiting in line\".\n\nAvoid abstract words. Be specific about the customer's needs.\n\nAvoid statements of a specific solution, e.g., \"they should have more\ncashiers at lunchtime.\"\n\nAvoid premature details, e.g., \"stays open until 6:00 PM\".\n\nUse the concrete terms of the customer's own experience rather than\nintangible concepts: use \"offers several brands of juices\" rather than\n\"offers a good selection.\"\nFor example:\nVoice:\n\n\"I don't have much time [so] I get really irritated standing in a long line.\"\nKey items:\n\ncustomer is time-constrained\n\ncustomers may become irritated if the process of getting food takes a\nlong time.\nRequirement:\n\n\"Minimize time spent getting and paying for food\"\nTo save time you can divide voices among the team members for an initial\ntranslation. Afterwards, the team checks each other's work, discussing potential\nchanges.\nStep 5B\nDiagram the requirements\nSchedule a group meeting. Follow the instructions for making an \"affinity diagram\" as\ndescribed in Step R17 of Voices into Choices.\nStep 6 Brainstorm for the best solution to the problem.\nYou should attempt to identify a possible solution to the motivating problem for the\nproject, e.g.,\n\na new product concept, meeting the a key customer need identified in the\nVOC\n\na statement of the most significant deficiency or problem with a product\nor organization\n\na definition of the actual and desired brand or company image\nThis solution should make sense given the evidence collected in the Voice of the\nCustomer, but you don't have to defend it with any quantitative evidence. Just use\nyour group judgment (e.g., brainstorm and discuss). You can use Steps 18 and 19 in\nVoices into Choices as a guide for brainstorming ideas, and picking the best solution.\nStep 7 Prepare report and presentation\nThe Report\nThe report should be about 15 pages long, and cover the following:\nStatement of objective\nDescription of methodology\nQualitative interpretation of the interviews\nAffinity diagram\nWhat has been learned - proposed solution & future research\nAppendix - Pictures collected from the customers\nYou can make adjustments to this sequence of topics, but check with me first.\nThe most important part of the report is Section 3 on \"qualitative interpretation.\"\nYou might want to use as a model the readings: \"To save or to spend,\" which is a\nprofessional summary of a daylong focus group in which I participated. Note the use\nof direct quotes, headings, and paragraph-length summaries."
    },
    {
      "category": "Assignment",
      "title": "Problem Set",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/5b2c2c0eaad2bffeda50ac6c3eeba342_problem20set2002.pdf",
      "content": "Problem Set\n15.822 Strategic Market Measurement\nDue:\nIn class, November\nProblem 1 (adapted from a student project)\nJamie Austen is using a conjoint estimation approach to evaluate marriage proposals, and\nhas identified three key attributes:\nAttribute 1 - \"Income\" which takes on three levels,\n- Plus $50K, which is $50,000 more than Jamie's salary\n- Matching, which is about the same as Jamie's salary\n- Minus $50K, which is $50,000 less than Jamie's salary\nAttribute 1 - \"Education\" which takes on three levels,\n- High School\n- College BA\n- PhD\nAttribute 3 - \"Personality\" which also takes on three levels,\n- Fantastic (funny, charming, nice)\n- Nice (nice)\n- So-so (a little embarrassing in company, but basically OK)\nAfter some soul-searching, Jamie ranked these nine potential proposers as follows:\nIncome\nEducation\n\"Personality\" Rank\nAcceptable?\nPlus $50K\nHigh School Fantastic\nPlus $50K\nCollege\nNice\nPlus $50K\nPhD\nSo-so\nMinus $50K High School So-so\nMinus $50K College\nFantastic\nMinus $50K PhD\nNice\nMatching\nHigh School Nice\nMatching\nCollege\nSo-so\nMatching\nPhD\nFantastic\nYes\nYes\nYes\nNo\nYes\nNo\nNo\nNo\nYes\n(a)\nPlease estimate Jamie's utility function for the attribute levels.\n(b)\nWhich attribute is most important, and which one is least important?\n(c)\nSuppose Jamie meets two persons:\nPat, who has a Matching salary, College education and a Nice personality\nDana, who makes $25,000 more than Jamie, has a PhD, and a So-so\npersonality.\nWhich person is more attractive marriage partner, according to Jamie's utility\nfunction. Is either person acceptable?\n\nProblem 2\nLook at the following market share distribution for three airconditioners (this is generated\nwith the airsim Excel sheet,). The actual product descriptions are given in the table\nbelow the graph. The most popular product is Airtech, followed by Breeze, followed by\nAirtech*. However, if you look at the average utilities of the three products (average for\neveryone in the market, i.e., who filled out a survey), it appears the ordering of products\nby average utility is exactly reversed! The highest average utility is for the Airtech*\nproduct, followed by Breeze, followed by Airtech.\nPlease explain why the ordering of products by average utility does not have to match the\nordering by market share. Be short but specific.\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n0.2\n0.4\n0.6\n0.8\nNoise %\nAirtech\nAirtech*\nBreeze\nAirtech\nAirtech*\nBreeze\nNoise level\nVery low\nLow\nModerate\nCooling cap\n7000 Btu\nReliability\n0.06\n0.11\n0.15\nPrice\nPrice\n$\n450.00\n$\n680.00\n$\n660.00\nM. Share\n47%\n22%\n31%\naverage\nutility\n4.88\n5.48\n5.02"
    },
    {
      "category": "Assignment",
      "title": "Assignment 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/ba07a5c96b751f98f72d5f9a4b563f2b_assignment2.pdf",
      "content": "ASSIGNMENT 2\nRead Boston Beer Case; take a careful look at the ZMET transcripts at the\nend of the case.\nPrepare for class discussion:\n- What should Boston Beer do with the Lightship brand?\n- How useful was the market research? Are you confident in their\ninterpretations?\n- Is \"Lightship\" a good name? How would you find out?\nFinally, a 'deep' question:\n- Why is there no \"Diet Bud\" or \"Pepsi Lite\"?\nThe case illustrates use of Zaltman's metaphor elicitation method. We will\ndiscuss the method in class. These 2 articles in Fortune and Fast\nCompany are good introductions to the method:\nSTORYTELLING: A NEW WAY TO GET CLOSE TO YOUR CUSTOMER,\nFortune Magazine, February 3, 1997, available at:\nwww.hbs.edu/mml/fortune.html\nMetaphor Marketing, Fast Company, April 1998, available at:\nwww.fastcompany.com/online/14/zaltman.html\nFor more technical information, check out Prof. Zaltman's website,\nwww.olsonzaltman.com, and the articles \"Metaphorically Speaking\" and\n\"Rethinking Market Research: Putting People Back In.\"\nYou can also check out the Slate article that includes a taste-test of Sam Adams\nbeer, among others: http://slate.msn.com/Shopping/99-08-30/Shopping.asp."
    },
    {
      "category": "Resource",
      "title": "Ethnographic observation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/0e5fb90b160875ba3f95a2f7c5b3fd6f_observation.pdf",
      "content": "Ethnographic observation\n- Requires trained observers, extended videotaping,\nsophisticated coding & editing\n- Especially helpful in:\n- Tracing complex consumer activities and processes\n(using equipment, software, purchase process)\n- Understanding 'low involvement' activities, where\nconsumers' awareness is limited (routine shopping)\n- Detecting new fashions or trends\n\nWhat to look for...\n-\nNonstandard uses\n(Cheerios = snack)\n-\nInteractions with environment\n(shaking the blender)\n-\nCustomization\n(no desktop)\n-\nIntangible attributes\n(Pull-on diapers = 'growing')\n-\nUnarticulated needs\n(Gillette Lady Sensor)\n\nLearning by observing: 3 examples\n- \"The Deep Dive\" Nightline show on IDEO\n\"Innovation begins with an 'eye'\"\n- \"Why We Buy,\" ABC video about Paco Underhill\n- \"Growing a Business\" - Stew Leonard's\nsupermarket success story.\n\nFurther readings\n- Article on Diesel Store from NYT\n-\nSpark innovation through empathic design\n(course packet)\n- \"Why we buy\" by Paco Underhill"
    },
    {
      "category": "Resource",
      "title": "First Class",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/bb1a8a612d881591abcd766212efc248_15_821_02_20first_20class.pdf",
      "content": "15.821 Listening to the customer\n- Learn how to get quick customer input, skipping the\nmarket research middleman\n- Apply qualitative methods (focus groups,\ninterviews)\n- Do a Voice of the Customer project\n- For everyone (marketing, product development,\nconsulting..)\n\n15.822 Strategic Market Measurement\n- Learn how to create, interpret and analyze a\nmarket research survey\n- Emphasis on market structure and segmentation\n- Hands-on conjoint and cluster analysis\n- For consulting, market research careers\n\nUnderstanding the customer requires...\na complete inventory of needs/benefits\na sense of overall structure and organization\n15.821 Listening to the Customer\na sense of what's general to the market and what's special to\nsome segments\na sense of relative importance\n15.822 Strategic Market Measurement\n\nVoice of the Customer Assumptions\n- Customers live in a different world, speak a\ndifferent language....\n- Customers can express needs, not solutions\n- The 'pool' of needs is finite\n- Needs can be grouped into strategic 'bundles'\nwhich drive competition\n\nIndividual\nInterviews\nAudio or Video\nAudio & Video Recording\nTranscription\nThe VOCALYST(r) Process\n~100\nCards\nEditing\n1000's of phrases\npcEXPRESS\n&\nSPSS\nCard Sorts\nData Analysis\nStructure of customer\nneeds\n\nVoice of the Customer Class Project\n- Pick group (3-5)\n- Select topic and objective\n- Prepare interview discussion guide, starting with a\ndiscussion of photos and images (like ZMAT)\n- Conduct, tape and transcribe interviews\n- Highlight \"voices\" = opinions, reasons, solutions\n- Infer underlying needs, benefits and requirements\n- Structure needs into a hierarchy (\"affinity diagram\")\n- Develop a concept that meets some of the key\nneeds\n- Write the report\n\nWhat's a good topic?\n==> fits the GUIDE acronym!\n- Generate (... customer needs in connection with a\nproduct or service)\n- Understand (.. the customer's point of view about\nan issue or problem)\n- Identify (...areas where current product\nperformance falls short)\n- Describe (... the decision process of a certain type\nof customer)\n-\nExplore (... the customer's perceptions of a\ncompany, or product)\n\nSchedule & Project tasks\nCase Boston Beer\nVocalyst, Bob\nKlein\nMr. Big (Jim\nFerry)\nChristina Hepner\nBrodie\nIdea Generation\nInterviews CBE\nExercise\nFocus G BFD\nCase\nObserva-tional\nmethods\nScrubbing\nExercise\nPsychol. of\nPricing\nSelect topic\ndiscussion guide\nConduct interviews\nTranscribe int.\nSelect \"voices\"\nScrub voices create\naffinity d.\nGenerate concept\nNo class\nPresentations\nWrite report"
    },
    {
      "category": "Resource",
      "title": "Interviewing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/b6e9fb5197bb68767198000bc35dda02_prep20for20scrubbing20class.pdf",
      "content": "For Thursday:\nCoding the interview transcript\n- Highlight statements (\"voices\") that identify\n- Issues\n- Needs\n- Problems\n- Concerns\n- Images\n- Solutions\n- Copy each voice on a Post It in block letters\n- In a corner, code each Post It for Transcript and\npage\n\nIdeally each interview is read\n& coded 2 times\nTeam member 1\nTeam member 2\nTeam member 3\nCustomer 1\nx\nx\nCustomer 2\nx\nx\nCustomer 3\nx\nx\nCustomer 4\nx\nx\n\nThusday's in-class scrubbing exercise\nArrive with...\n-\nPackets of Post-It Notes, with\ncustomer voices\n-\nInterview transcripts\n(for reference)\n(\"voice\" = \"direct quote\")\nLeave with:\n-\n20-30 scrubbed statements\n(customer requirements)\n-\nDeeper group understanding\nof the customer's thought\nworld"
    },
    {
      "category": "Resource",
      "title": "Scrubbing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/8b5953a619df7b41085ba4994e6be1fd_scrubbing20class20slides.pdf",
      "content": "Step 1- Identifying key voices (<25)\n-\nTeam member 1 reads a\nvoice and puts it on the\nflipchart\n-\nIf someone else has a similar\nvoice, they stack it on top of\nthe first one\n-\nWhen TM 1 has finished their\npile, TM 2 begins with their\nvoice\n-\nWhen everyone else is done,\nselect 20-30 key voices\n\nStep 2 - Voices into needs or benefits\n-\nPlace each key voice on top of requirement sheet\n-\nQuickly jot down 1-3 key ideas in the voice\n-\nWrite a need or \"requirement\" statement in the bottom of\nthe sheet\n- Identify a need that motivates the original voice\n- Avoid solutions\n- Be concrete and specific\n- Use multi-valued language\n- Use positive, action-oriented language\n\nExample (tourism)\n-\nVoice: \"I don't like organized tours - you are stuck in a\nbus with other tourists, and herded from place to\nplace...\"\n-\nPossible need statements\n\"Allow for people to leave and rejoin the bus tour if they\nwant.\"\n(solution)\n\"Don't burden the schedule with too many events.\"\n(negative, solution)\n\"Enhance contact and appreciation of the local people and\nenvironment.\"\n(good)\n\"Directly and spontaneously experience a new culture.\"\n(better - multi-valued, more specific benefit)\n\nStep 3 - Create an affinity diagram\n-\nSchedule a group meeting\n-\nRead section R17 in Voices into Choices\n-\nBring flipchart and requirement sheets to meeting\n-\nReview need statements and finish\n-\nCopy needs onto Post-It notes\n-\nFollowing the guidelines in R17, organize the 20 or so\nrequirements into 5-10 Level 1 categories\n-\nLabel the Level 1 categories with titles\n-\nRepeat to produce 2-4 Level 2 categories\n\nStep 4 - Develop a new solution or concept\n-\nRead section R18 in Voices into Choices\n-\nRun a short brainstorm for each of the Level 2 categories\nin the affinity diagram (5-10)\n-\nSift (vote), improve, and combine ideas into an integrated\nconcept or solution\n\nThe Report\n1 Statement of objective (< 1 page)\n2 Short description of methodology (< 1 page)\n3 Qualitative interpretation of the interviews\n4 Affinity diagram\n5 New Concept or solution & future research\nAppendix I - Pictures\nLength: < 15 pages, adjust for topic, team size\n\nQualitative interpretation\n- Main part of the report\n- Look at \"To Save or to Spend\" as a model\n- Organize main sections around main topics in the\naffinity diagram\n- Summarize the customer's voices in your own\nwords, using direct quotes as support\n\nWhat has been learned\n& future research\n- Attempt to identify a possible solution to the\nmotivating problem for the project, such as:\n- a new product concept\n- statement of the most significant deficiency or problem\n- a definition of desired brand or company image\n- Indicate briefly key uncertainties about your\nconcept/solution\n\nPresentation\n- 5 minutes per group\n- 1 or 2 presenters\n- Suggested sequence (but you can modify):\n- State objective\n- Highlight key parts of affinity diagram\n- A sample picture\n- Tell us what was surprising or unexpected"
    },
    {
      "category": "Resource",
      "title": "The pains and pleasures of pricing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/5cc52570803b6e1bbea64585acdce779_redblack20copy.pdf",
      "content": "The pains and pleasures of pricing\n\nConsider two dinner scenarios\nA ... excellent food, wonderful company,..\n... but you have never in your life paid so much for a dinner\nB ... like A, but dinner is 'free' (expense account)\n\nThe Moral Tax on Consumption\n... if free\npleasure\ndinner\ntime\n... if not free\nGAP = moral tax\n\nResearch Agenda\n1 Understand how payments diminish the enjoyment of products\nand services\n2 Adjust economic model to incorporate (1)\n3 Interpret some existing practices in light of (1)\n4 Establish pricing principles that can recover lost satisfaction,\nwithout endangering accountability and consumer self-control\n\nPreference for prepayment\n- Imagine that you are planning a one week vacation to the Caribbean, 6\nmonths from now. The vacation will cost $1,200.\nYou have two options for financing the vacation:\n- Six monthly payments of $200 before the vacation\n63%\n- Six monthly payments of $200 after you return\n37%\n- Same problem, but now you are buying a washer-dryer:\n- Six monthly payments of $200 before the WD arri\n24%\n- Six monthly payments of $200 after the WD arrives\n76%\n\nEase the pain with 'buffer currencies'\n- Token payment mechanisms\n$$$ ==>\ntokens, coupons, beads, miles, chips.. ==> consumption\n- Two stage mental budgeting\n$$$ ==>\nbudget for entertainment ==> entertainment choices\n$$$ ==>\nprix fixe menu\n==> menu choices\n\nFlat, one-time prices eliminate marginal costs\n- Fixed-fee, \"all you can eat\" arrangements\n$$$ ===>\nfixed fee for health club\n==> 'free' usage\n- Owning rather than renting\n$$$ ===>\nyour tuxedo\n==> 'free' usage\n\nWhat, then, do we want\nfrom payment arrangements?\n- to enjoy products and services as if they were free\n- to justify all payments with salient benefits\n- to preserve accountability and self-control\n\nAlways leave home without it\n(Prelec and Simester, 2001)\n-\nSecond price sealed-bid auction\n-\nPrize = one pair of Celtics tickets\n-\nSloan School Masters' Students\n1/2 think payment is in cash (within 24hrs)\n1/2 think payment is by credit card\n\nResults...\nAverage bid = $29 for cash, $61 for Credit Card\n(p<.01, by t-test or MWU-test)\nTop 20% bids average $53 for cash, $142 for Credit Card\nIs this \"irrational?\"\n- Can the same person have a $53 in cash-value and $142\ncredit card value?\n- Would such a person buy $53 cash for a $142 charge?\n\nPrize = dinner for 4 at Legal's\n(up to $160)\nIdentification method\nPayment method\nAny 4 characters\nCredit card digits\nCash mean\nCredit card mean\nCredit card premium\nt-test\nCash median\nCredit card median\nWilcoxson rank-sum\n$77.08\n(N=43, st. err=5.9)\n$67.12\n(N=46, st. err=5.7)\n- 13%\nt=1.21, ns\n$80.00\n$62.5\nz=1.42, ns\n$52.80\n(N=45, st. err=4.8)\n$71.78\n(N=34, st. err=5.6)\n+ 36%\nt=2.58, p<.05\n$50.00\n$69.00\nz=2.45, p<.05"
    },
    {
      "category": "Resource",
      "title": "The ZMET Interview",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-821-listening-to-the-customer-fall-2002/9502fc6d74949fde6cd2cbb30b67a11f_bostonbeer.pdf",
      "content": "The ZMET Interview\nA\nThe \"homework assignment\" (7-10 days to do)\ncollect at least 12 photos or pictures relevant to topic, e.g.,\nthoughts about a brand\npurchase setting or buying process\nuse of a product or service\nB\nThe interview (2-3 hrs, $90)\nStorytelling about the images; Probing interviews\npairs of pictures - how similar? how different?\nImage Involvement\ndeeper exploration\nNon-visual Sensory Metaphors\ntaste? color? smell? touch? sound? emotion?\nVignette; Digital Imaging\nThe deliverable\nWritten report\nConsensus map (example in \"Metaphorically Speaking\")\nCD\nC\n\nSummary\n- The key goal of qualitative research is to identify all\npotentially relevant issues.\n- Direct questioning is of limited value because people may\nnot be aware of the real reasons for their feelings or choices,\nand resort to obvious or conventional explanations.\n- \"Projective\" questions and tasks have no obvious answer, so\nthe customer must be creative and self-revealing\n- ZMET combines a projective method with a \"depth\ninterview\"\n- Your project will do the same."
    }
  ]
}