{
  "course_name": "Literature, Ethics and Authority",
  "course_description": "Our subject is the ethics of leadership, an examination of the principles appealed to by executive authority when questions arise about its sources and its legitimacy. Most treatments of this subject resort to case-studies in order to illustrate the application of ethical principles to business situations, but our primary emphasis will be upon classic works of imaginative literature, which convey more directly than case-studies the ethical pressures of decision-making. Readings will include works by Shakespeare, Sophocles, Shaw, E.M. Forster, Joseph Conrad, George Orwell, Fyodor Dostoyevsky, and Henrik Ibsen, among others. Topics to be discussed include the sources of authority, the management of consensus, the ideal of vocation, the ethics of deception, the morality of expediency, the requirements of hierarchy, the virtues and vices of loyalty, the relevance of ethical principles in extreme situations.",
  "topics": [
    "Business",
    "Leadership",
    "Humanities",
    "Literature",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Social Anthropology",
    "Business",
    "Leadership",
    "Humanities",
    "Literature",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Anthropology",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nCourse Description\n\nWe will supplement our readings in imaginative literature with brief excerpts from important works in the tradition of philosophical ethics (by Plato, Aristotle, Machiavelli, Thomas Hobbes, Immanuel Kant). These texts are also of classic stature, parts of the repertoire of educated argument about the sources and legitimate aims of executive authority and valuable points of reference in conversations about ethics in professional life. The readings also include excerpts from texts concerned with the nature of corporate leadership and brief case studies reflecting the ways in which common ethical dilemmas typically arise in the course of corporate management.\n\nThe aim of the course is not to strengthen the student's ethical character or to provide a set of handy decision-procedures for ethical conduct but rather to develop familiarity with the ins and outs of a fair range of ethical concepts, to whose use in judgment, it is assumed, everyone is already committed. The governing view behind the selection of materials to be read and discussed is that our characters are already ethical to the core, but that our arguments with ourselves about rival courses of action are perplexed by the unsystematic nature of the ethical principles to which all of us in large measure subscribe. Our course of study takes as its assumption that ethical principles are unsystematic by nature. This goes to explain why decision-procedures for ethical conduct are unavailing. In brief, since our ethical commitments do not \"add up\", the need to honor one principle (or set of principles) in our conduct frequently entails betraying another. The readings and discussion aim at exploring the extent to which this condition can be made tractable, drawing largely upon the two main traditions of philosophic ethics in Western culture-the one that deals with ethical values, the other with duties and the satisfaction of obligations.\n\nCourse Format\n\nThe subject meets once a week for two hours. Each session begins with a lecture of varying length, but usually running for twenty-minutes to half an hour, although the lectures of the first two meetings will be somewhat longer. The rest of the session is devoted to class-discussion of the materials assigned for the session. There are no break-out sessions, but groups of students will be appointed from time to time to present a view of some of the materials during the last twenty minutes of the session. Participation in discussion is essential to the life of the class and the force and cogency of students' remarks will have a marked influence on grades. Much of the grade will also depend upon the quality of the two written assignments required by the course: a mid-term paper (running from five to seven pages) and a final paper (running from ten to twelve pages). The papers will each deal with some aspect of the readings and discussion; topics may be invented by the students but an extensive list of suggested topics will be circulated two weeks in advance of each paper's due date for those students who require it.\n\nReadings\n\nOur meetings will follow the course outlined but each week's meeting will determine how much of the unit under discussion will be completed during its session and how much carried forward into the next meeting. It is assumed, in other words, that some units will take more than one session (although never so much as two) and some will take less. Indented authors and titles indicate materials subsidiary to the main readings. The readings will average 60 pages per week.",
  "files": [
    {
      "category": "Lecture Notes",
      "title": "Lecture Eight",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/ca3901c95d29295484d0091683faa071_lecture8.pdf",
      "content": "Materials to Guide Reading\nLECTURE EIGHT\nThe Use of Force:\nWhat is the source of the doctor's authority? How does it differ from the authority of the\nparents and why do they surrender to it? Why do the parents begin by keeping information from\nthe doctor? The parents become despicable in the doctor's eyes-why? In the end, the doctor's\ndescription of the child's resistance seems to validate it, in some sense. \"She had fought valiantly\nto keep me from knowing her secret.\" Why is the secret valuable to the child? Why is her\nresistance admired by the doctor? The child has knowledge, which it will be to the child's benefit\nto reveal and to the community's as well. How does this benefit enter into the doctor's motives?\nIs the doctor a good doctor? Is his behavior professional?\nShooting an Elephant:\nWhat governed the narrator's choice of profession? What is his attitude towards it?\ntowards those in his charge? Is his conduct unprofessional? What difference does it make that the\nanimal destroyed is an elephant? Could the story work just as well if it had been called Shooting a\nCriminal or Shooting a Chipmunk? Was the narrator right to shoot the elephant? Clearly, the story\nis not just about elephants but about the nature of delegated authority-in this sense, anyone in\ncharge is likely to confront the dilemma faced by the narrator. Can you think of any instances of\n\"shooting an elephant\" in your business experience?\nThe Secret Sharer:\nHow would you describe the managerial strengths and weaknesses of the narrator's\npromotion, and of Leggatt's? Is it meant to be typical of appointment to authority? What is the\nsignificance of the \"alone-ness\" of the narrator at the outset of the story? Is the condition good,\nbad, indifferent? The narrator distinguishes himself from his crew in that they \"had simply to be\nequal to their tasks\", whereas he had to measure up to \"that ideal conception of one's own\npersonality that every man sets up for himself secretly.\" Can this view of the distinction between\nthe adminstrator and administered be justified? Do you believe that you hold a position for which\nmere competence is enough? Do you believe that there are others under your supervision for\nwhom mere competence is enough? Where would you draw this line and what is the meaning of\nit? Why did the second mate withhold the knowledge of the Sephora until the end of the meal?\nHow would you evaluate the narrator's initial moves as captain? Why did Leggatt go overboard?\nHe makes a distinction between swimming till he sinks and committing suicide; is this distinction\njustified? He also distinguishes between swimming 'round and 'round and swimming straight\nforward (again, until he sinks). Why is this difference important? Both Archbold (if that is his\nname) and Leggatt claim to have given the order that saved the ship. Who is telling the truth? Is\none of them lying? Leggatt kills one man while saving ship and crew. The narrator risks ship and\ncrew to save one man. Is this recklessness? The narrator says that this was \"a matter of\nconscience\". What does he mean by this? One might say that the narrator has created a crisis on\nthe ship. Is it ever managerial wisdom to create a crisis? The narrator speaks of \"the chapter of\naccidents which counts for so much in the book of success.\" Is the phrase valid in speaking of\nmanagerial careers?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Five",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/9062c3f3fe66a7d5bb6bc09d3d2df5f1_lecture5.pdf",
      "content": "Materials to Guide Reading\nLECTURE FIVE\nMajor Barbara:\nThe idea of opposing Money and Religion as rival allegiances is taken by Shaw from the\nSermon on the Mount, particularly from the notion that \"You cannot serve both God and\nMammon [the god of wealth: the phrase is often translated \"You cannot serve both God and\nMoney\".] But Shaw's play, surprisingly, opts for Money. What justifies this hard-and-fast\nopposition? Is money a form of service? Undershaft, when asked about his religion, answers, \"I\nam a millionaire. That is my religion.\" What have money and religion in common? Barbara\nlabors ceaselessly to extract donations from the poor, in order to fund the work of the Salvation\nArmy, but she rejects Bill Walker's pound note and the huge benefaction of Bodger, the whiskey-\ndistiller. What does she want from Bill? Why reject Bodger's benefaction? Is money ever dirty\nmoney? What (exactly) is wrong with working for an arms manufacturer? A distiller? A\nnarcotics dealer? A manufacturer of toothpaste? Does the product really matter? If not, why not?\nIf so, why does it make a difference? Is there a point in Shaw's making his representative of the\nGospel of Money a munitions-manufacturer? If so, what is it? Could the play have equally well\nmade Undershaft a distiller? a manufacturer or dental floss, of tobacco products? How would you\njustify (or excuse) your managerial role in such case, or would you draw the line at some of these\nemployments?\nLady Britomart advises Stephen to accept his inheritance and then hire a manager to run\nit. Is this foolish advice? How would you go about hiring such a manager? What is the issue\nabout succession in the play? Why is it necessary to choose a foundling-i.e., a bastard-to be CEO.\nHow do you hire a CEO?\nConsider Lady Britomart's view that it is all right to manufacture and market munitions,\nprovided that you sell them only to \"the right sort of people\". We have something of the same\nopinion today, in the insistence of our government that only certain sorts of nations have a right to\nnuclear weapons. In contrast, Undershaft will sell armaments to anyone who wishes to buy and\nwill arrange for generous loans for those who cannot afford it. What view of the world underlies\nhis practice? Perhaps we should think of Undershaft's munitions as the symbolic equivalent of\npower-power to do good or harm, power of aggression and of defense. In this light, we might\nconsider the role of Sloan professors, who sell managerial knowledge and arrange loans for those\nwho cannot afford to buy. What would Lady Britomart think of this practice? Is the knowledge\nthat Sloan sells a form of power? Should it be available only to the right sort of people?\nFrom the Sermon on the Mount: \"Lead us not into temptation . . .\", which may also be\ntranslated as \"Please do not test us . . . \" and is frequently so translated. Is it a good thing to pray\nnot to be tested? The passage comes from what has come to be known as \"The Lord's Prayer\",\nwhich also instructs us to pray for forgiveness, so that we may be forgiven in turn. What is the\npower of forgiveness? Is there any other motive for doing it? Can the world use more\nforgiveness? Cusins, in the play, rejects forgiveness. \"Forgiveness is the beggar's refuge. We\nmust pay our debts.\" Our watchword for this term is \"accountability\". Note in this connection that\nBarbara gives Bill Walker a hard time, refusing to let him pay off his offense against Jenny Hill\nby getting his own face bashed in. What does she want of him? Explain. Is the power to forgive,\nforget, and start anew always \"a beggar's refuge\"?\n\nHobbes:\nHobbes put certain ideas at the forefront of attention in ethical philosophy. He was not\nthe first to entertain these ideas, but he was the first to express them as elements in a systematic\nview of the world.\nAs a result, even though some of his contemporaries and successors thought them disreputable,\nnevertheless it became increasingly difficult to think of them as unworthy of important\nconsideration. The basic idea was to take a materialistic view of human nature. In this view, each\nhuman being is an array of appetites and aversions, continuously stimulated into existence by\nsensory events, and continually changing in character, so that there is no overall aim for human\naction over the course of a lifetime - no such thing as a summum bonum or \"highest good\", no\ncondition of being that mankind tries to achieve in order to suit its nature. The value of anything\nis determined just by what we happen to want at one moment or another, and the idea of a\npermanent goal or an enduring satisfaction is just an illusion. Appetites and aversions, moreover,\nare not simple qualities but composites. At any given moment, they are the overall resolution of\ninnumerable differing responses to stimuli, in which so much of each response is traded off\nagainst so much of every other to produce the collective result - an impulse to motion.\nThe feature of Hobbes's thinking that most concerns us here is that appetite and aversion\nmust be understood as changing vectors, temporary compromises between differences in the\nstrength and direction of initial responses to stimuli. Since value in human life is determined by\nthe relative strength of appetites and aversion, and these are the composite vectors of multiple\nforces, it follows that every value is the result of a trade-off between measurable quantities. The\nvalue of any resulting composite, however desirable at any given moment to some human beings\nand undesirable to others, is nonetheless representable in principle as equivalent in value to some\nquantity of any other. Appetite and aversion are, so to speak, the universal currency of mankind.\nAlthough Hobbes lived before the advent of a fully-fledged market economy, he captured\nhere the notion that underlies it-namely, that the value of any one thing can measured in terms of\nthe value of any other, provided they are either things to be acquired or avoided. Some things\nmay be very dear and others cheap, but all have a price-a value in terms of each other. Bill\nWalker would approve of Hobbes, could he have read him. \"I don't want Jenny Hill's\nforgiveness. What I done, I'll pay for.\"\nIt is all very well to put a value upon apples in terms of oranges, or of goods in terms of\nservices, or even of a surgically-transplanted kidney (and therefore of a human life) in terms of so\nmany television sets, but what about our more fundamental human obligations? Our obligation to\nour parents, for instance: they want more than you care to give, you want more than they care to\ngive. But according to Hobbes, all these \"wants\" are themselves the result of trade-offs among\nimpulses, not independent sources of value, and so the working result, in free market conditions,\nis due measure. Parents and children can settle up between themselves, each \"buying out\" the\nobligation to the other, which can be determined by bargaining, as in a divorce settlement.\nHobbes, of course, doesn't go this far, but the notion of buy-out is implicit in his argument. We\nhave earlier discussed (in considering the Antigone) an uncompromising doctor and two\nuncompromising Christian-Science parents. Is it the case that when we deal with balking at\ncompromise, we are dealing with ignorance or bad thinking?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Four",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/7e379566b4dfab2a7568c4245ddf73d5_lecture4.pdf",
      "content": "Materials to Guide Reading\nLECTURE FOUR\nJulius Caesar:\nMuch of the play's dialogue concerns the sense of honor-most famously, in Mark\nAntony's funeral oration. How do you understand honor? It seems to go with the unChristian\nvirtue of pride-a sense of one's worth derived from your membership in a group (a family, a\nmilitary unit, a nation), which has given you something to live up to, a sense of the value of your\nsocial identity and of the obligations that come with it. Can one be proud of being oneself? Are\nyou proud of your ancestry? Of your parents? Of the business corporation to which you belong?\nHave they given you a sense of identity and of the obligations accruing to it that you try to live up\nto? When membership in a group is not lifetime membership but a transitory thing, can it invest\none with a sense of honor?\nJulius Caesar is a study of four distinct styles of leadership, represented by Caesar,\nBrutus, Cassius and Antony. How would you describe the leadership style of each? By way of a\nbenchmark, I cite some words from a Harvard Business School case-study, \"The Parable of the\nSadhu\". The sentiment about leadership that they embody can be found in virtually every book on\nbusiness leadership that I have read in the last twelve years.\nEffective managers are action-oriented people who resolve conflict, are tolerant\nof ambiguity [this means that they are not indecisive even when choices are not\nclear], stress, and change, and have a strong sense of purpose for themselves and\ntheir organizations. . . . People who are in touch with their own core beliefs and\nthe beliefs of others and are sustained by them can be more comfortable living on\nthe cutting edge. At times, taking a tough line or a decisive stand in a muddle of\nambiguity is the only ethical thing to do. If a manager is indecisive and spends\ntime trying to figure out the \"good\" thing to do, the enterprise may be lost.\nIn this connection, consider as well that Julius Caesar is very much concerned with the\nways in which people's sense of self-regard makes them liable to manipulation by others. How\nimportant is living up to an image of yourself? How important is it for a corporation to live up to\nthe image of itself that it fosters or promulgates about itself-the stuff of \"vision statements\", in\nother words? Anthony is the man without an image of himself. He is faithful to the image of\nCaesar; otherwise he is a player, a manipulator of images. How good a leader is he? How\nimportant is the image that other people have of you? In the first exchange with Cassius, Brutus\nseems to reject the notion of living by the estimation that others have of you. Does this make him\npeculiarly independent of baser motives like ambition or peculiarly insensitive to their place in\nthe minds of others?\nIn a book entitled Credibility, two distinguished business consultants argue that\ncredibility is the most important characteristic of a senior executive - outweighing, both in their\nview and in the view of those managers consulted in a survey that they conducted, such traits as\nintelligence and competence. Reading the book, one discovers that \"credibility\" is less about\nbeing believed than about being trusted: managers don't want to believe the statements of the\nCEO so much as they want to believe in the CEO. Consider in this light the characters of Caesar\nand of Brutus. Do they embody \"credibility\"? If so, surely they do not embody credibility in the\nsame way. In this connection, the play deliberately contrasts Caesar's genial favoritism in private\nlife - his courtesy towards his friends in private - with his unshakable resolve as public authority\n(Note his reply to a suitor: \"What touches Caesar most shall be considered last\", or his speech\ncomparing his constancy with the constancy of the north star.) If Caesar is on an ego-trip, it is not\na mean-spirited ego that he is serving. \"What touches Caesar most shall be considered last\",\n\nexpresses a resolve that is far from Thrasymachus's tyrant, whose justice serves only his own\ninterests. How necessary is it for one in authority to cultivate and try to live up to an extreme\nimage of him/herself?\nThere are other views of management. Consider a maxim attributed to Sun-Tzu, which\ngoes, roughly: \"The poor leader is hated; the good leader is worshiped; the great leader is not\nnoticed.\" Is there a value in this maxim? Or perhaps we should try to distinguish between\n\"leadership\" and \"management\". How would you distinguish between embodiment and\nparticipation in managerial style? Offer a few examples of individuals from business or\ngovernment who seem to embody their enterprises. Do they make good leaders? Do they make\ngood managers? For his part, Brutus heads a conspiracy. Is conspiracy sometimes justified? In\nwhat sense is a conspiracy like a corporation? In what sense not?\nMachiavelli:\nThe reading by Machiavelli concerns the distinction between the motives of an executive\nand the image that he or she must sustain. How could Brutus or Caesar have profited from this\nlesson? At one point in his text, Machiavelli says that unlike other writers addressing themselves\nto princes and talking of government, he will speak about the real world, not an imaginary or\nideal one. Yet what he speaks of is largely the need to maintain illusions. Indeed, you might sum\nup Machiavelli's teaching as follows: \"Never mind reality, the image is everything\".\nMachiavelli says that people will trust someone who breaks his or her word because (a)\none can always give good reasons for breaking one's word; (b) people are \"so ready to obey\npresent necessities\" that they allow themselves to be deceived. What is meant by \"present\nnecessities\"? Is the notion of \"allowing yourself to be deceived\" a coherent notion? \"Il Principe\"\n(Numero Uno) is presumably clear-eyed about deception and does not allow himself to be\ndeceived, not even by himself. Does anyone in Julius Caesar fulfill this characteristic of\nleadership?\nMachiavelli reserves special praise for Hannibal, whose \"inhuman cruelty, together with\nhis infinite other virtues, made him always venerated and terrible in the sight of his soldiers.\" No\ndoubt in Hannibal's day, and perhaps in Machiavelli's too, the nature of armies made fear of swift\nand terrible punishment an emotion that a commander-in-chief had to cultivate. It may seem that\nHannibal, the army commander, is not a fit model for top-level business management. But\nMachiavelli's advice was intended for rulers in times of peace as well as war and concerned the\nnature of command, which has always to deal with the image that the ruler must project if he (or\nshe--but that possibility never occurred to him) is to be effective both within the state and\nwithout. A contemporary correlative to Hannibal's image would be something like \"decisiveness\nto the point of ruthlessness\"--a lack of hesitation, a readiness to make quick decisions adversely\naffecting, perhaps to the point of total dislocation, the lives of people both without and within the\ncorporation. Is it wrongheaded to advise CEO's to adopt this model?\nMachiavelli was frequently chastised (after his death, of course) for articulating the\nmaxim that \"the ends justify the means\". What else can justify them? Is the maxim \"the ends\njustify the means\" only a cover for the notion that the real end and aim of the means is simply the\nmeans themselves - that is to say, the exercise of power? Or we might put the criticism the other\nway about. Machiavelli's adage, \"The ends justify the means,\" is justly famous, yet Machiavelli\ndoes not say simply that the means that are instrumental to a good end are just - on the contrary,\nhe says that they are often unjust, that a wise administrator \"must learn how not to be good\" Is\nthis a coherent notion? If something is justified by the good that it produces, why not speak of it\nas good?\nMachiavelli advises the ruler to be both beast and human being. Is this like wearing two\nhats, one for the office and another for home? Can you put on and take off the hat of a beast at\nwill? Machiavelli indicates pretty clearly that you must never seem to take off the religious hat--\n\ni.e. that the religious necessity is uncompromising and therefore you must always secretly wear\nyour princely hat under the religious one. If there is some compromise possible, for us, which will\nbe subordinate to which?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Nine",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/c2c7b898fc7c729c73ab600312ff0428_lecture9.pdf",
      "content": "Materials to Guide Reading\nLECTURE NINE\nWhat does it mean to respect the capacity for impartial reason? For some, reason is\nmerely instrumental; it does not tell us what we should try to achieve but only tells us how to go\nabout it. A group of Nazis planning to execute some Jews are planning rationally. Should we\nhonor their capacity for reason? But Kant thought that reason was more than instrumental; it also\nprovided a decision-procedure for checking on the ethical validity of any course of action. By\nvirtue of reason, Kant argued, human beings do not simply act upon random impulses or fixed\ninstincts but rather lay down rules of behavior governing their conduct; abiding by the maxims\nand rules implicit in one's conduct is what \"being accountable\" means. It follows that the way to\nhonor the rational capacity of others was to act oneself according to those rules that could be\nadopted as rules of conduct by all human beings, regardless of the partiality built into their social\nidentities and their psychological make-ups. The essential question about any proposed course\naction, therefore, was not, \"How can I best go about this?\" but rather \"Is it possible for this to be\nadopted as a rule of conduct by every rational being?\" - the Kantian equivalent of the more\nfamiliar \"But suppose everybody behaved this way?\" The underlying Kantian notion is that many\nrules of conduct seem reasonable in the light of one's circumstances and given the biases of one's\ncharacter, but they become illogical when we try to think of them as being followed universally.\nHow good is Kant's argument? How forceful are its conclusions? Are rule-making and logical\nconsistency the hallmarks of ethical conduct? Is radical impartiality the primary virtue? Take the\ncase that telling the truth about a patient's condition will act as a depressant-a recovery is barely\npossible but the odds are heavily against it. Should a patient be told the truth about his or her\nchances in such a case? Again, in the case that Kant examines, is it not open to argue that the\nwould-be assassin has put himself or herself beyond the pale of moral consideration?\nSwift's horses were conceived as a literary joke more than half a century before Kant\nwrote his essay but they appear to be exemplifications of the kind of rationality that he is urging.\nThey are perfectly impartial in their regard for the interests of any members of their kind. How\nsuccessfully has Swift drawn the image of the perfectly ethical being? Why did he choose horses\nas the embodiments of impartial reason? How successful is Gulliver in explaining to the horses\nthe ways of humanity? How would you go about explaining them to anyone-from Mars, let us\nsay-who did not understand them? What is the line between explaining and justifying a mode of\nbehavior, a course of action, a way of life?\nSwift's horses would make poor consumers of the goods advertised by Levitt's\nadvertising campaigns, but the Yahoos might line up to buy. How good is Levitt's argument that\nadvertising sells the dream, not the product-the packaging, not what is inside the package? Take\nthe advertising for Profile Bread (minimally thinner slice yielding minimally less calories--\njustifying the true but deceptive claim that each slice contains \"fewer calories than ordinary\nbread\"). Or the claim that Bayer is superior to chemically-identical generic brands. Or that two\nExcedrins give the same relief as twice the number of ordinary aspirin tablets (true, because each\nExcedrin tablet contains twice the amount of aspirin contained by ordinary asperin capsules). Are\ncustomers aware of these deceptions? Do they want to be deceived in this way? How would\nLevitt answer these questions? (You may be sure that he would not be flummoxed by them.) Is\nthe customer a client of the advertising agency or of the company that markets the product? How\nresponsible should one be to what are \"indirect\" clients at best? Finally, how useful would it be to\nextend Levitt's case to political campaigning, where the direct client is the candidate or the\ncandidate's party and the indirect client is the voting public?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture One",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/41a1f42e0b881f04762672a46926e2d6_lecture1.pdf",
      "content": "Materials to Guide Reading\nLECTURE ONE\nPlato:\nConsider three models of excellence:\n1. Thrasymachus follow the Vince Lombari model, the zero-sum game. \"Winning isn't\neverything, it's the only thing.\" One derives one's sense of self by measuring its success against\nthe failure of others. No \"value-added\" here--there's only so much of the good stuff to go around,\nand its distribution in your favor is what counts. Even better, getting more also yields the pleasure\nof knowing that you're a superior sort of person. Success is not enough; friends must fail.\nRalph Waldo Emerson wrote: \"Every child of the Saxon race is educated to wish\nto be first. It is our system; and a man comes to measure his greatness by the\nregrets, envies and hatreds of his competitors.\"\n2. Plato (and Aristotle) follow the Sam Snead model. \"Forget your opponents; always play\nagainst par.\" A mere reaction against others cannot lead to pro-activism. Can't you do better than\njust exceeding the standard set by your adversaries? Never mind the competition; there are\nreasonable standards set by every task, even the task of living justly. The standards may not be\neasily known-this is especially true in the case of living justly-but they are objective, and\nmeasuring up to them completely is what \"excellence\" means. (\"Excellence\" comes down,\ntherefore, to a kind of perfect competence; in this sense, however unlikely, it is possible that\neveryone can be excellent.)\n3. The Nietzschean alternative. You don't try to do better than the competition, because it may\nbe unworthy, and you don't try to meet the reasonable standards set by the task. You take notice\nof worthy opponents, those who will call out in you energies that you did not possess until you\nengaged in struggle with them. The aim is not to meet an objective standard but to exceed\nyourself or become worthless in the attempt.\nJack Welch made it a practice even in good times to have his senior executives fire ten\npercent of their subordinates once every three years, and those at lower levels to do the same:\n\"It's all about performance. Some think that its cruel or brutal to remove the bottom 10 percent of\nour people. It isn't. It's just the opposite. What I think is brutal and false kindness' is keeping\npeople around who aren't going to grow and prosper.\" What would Thrasymachus makes of Jack\nWelch? What would Plato?\nUnderlying much of the Platonic dialogues is the notion that the different virtues\n(areteia-the word \"arete\" means \"excellence\") are good for the possessor. Three virtues in\nparticular concern Socrates throughout the dialogues, piety, courage, and justice. The last two are\nproblematic because it isn't clear that being courageous tends to one's benefit, and this hold even\nmore sharply in the case of justice, which may be good for others but is often exercised to the\ndetriment of the person acting justly. Hence the questions surrounding justice in Plato are the\nnearest stand-ins for our questions about the relationship between ethical values and personal\nfulfillment.\nThe idea that virtue or excellence (arete) is good for the possessor raises the possibility\nthat justice is not a virtue. This is ultimately Thrasymachus's position. He starts, however, with a\ndefinition: \" Justice is the interest of the stronger.\" Technically, then, both the weak and the\nstrong can be just (both acting in the interest of the stronger), but what Thrasymachus means is\nthat justice should be forsaken by anyone capable of excellence-that justice is simply the name\nthat the weaker give to the stupid or cowardly surrender of their own interests to the interests of\nthe stronger. As it stands, Thrasymachus's \"justice\" is a relational term, designating one sort of\n\naction in the case of the weak (surrender of one's interests) and another sort of action in the case\nof the strong (exploiting others). There is a built-in instability in this use of \"justice\", so long as\nmeans, as Thrasymachus argues it means \"whatever the strong just happen to take as their interest\nat the moment\".\nThe Grand Inquisitor:\nAre the three temptations in St Matthew rightly exposited by the Grand Inquisitor? Why\nis it terrible to be free? With reference to the second temptation, the Inquisitor seems to equate \"a\nstable conception of the object of life\" with \"deciding for oneself what is good and what is evil.\"\nIs the nature of good and evil a matter for decision? The Inquisitor claims to be more merciful\nthat Jesus. How does this claim square with the auto-da-fe, that is, the burning of one hundred\nheretics in the public square? What is the meaning of Jesus's silence? Of Jesus's kiss? What does\nit mean to call the Inquisitor a Secret Atheist--a disbeliever in God?\nForeign Assignment:\nConsider the case of the unhappily named Sara Strong. Is there a victim here? If not, why\nnot? How important is it on the job to get earned credit from clients for a job well done, in\naddition to your salary? Or is praise from an immediate supervisor alone enough to keep you\ngoing? Is there anything deeply wrong with mandated gender differences expressed through dress\ncodes? Don't we have these codes anyway? Distinguish between authority and power along the\nlines laid out by Rosabeth Kantor. Doesn't the case made by her supervisor (Vitam) to Sara come\ndown to this: that she has all the authority that goes with her job but will have no opportunities to\nacquire power? Does the locale of the story (Mexico) have anything to do with the way that you\nanswer these questions? One way to deal with case studies is to imagine yourself in roles other\nthan the major one. In this case we might ask how you would advise Sara if you were Fried and\nSara had come to you with her problems."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Seven",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/d251c6bd3e3f80f4ad6e87067f61b476_lecture7.pdf",
      "content": "Materials to Guide Reading\nLECTURE SEVEN\nThe Machine Stops, Corporate Virtual Workplace, The Challenger Incident:\n1. The Machine Stops depends upon a difference in the relation between people where\nbody-language and nuances of expression carry important weight and relations-such as\nconference-calls like the one that preceded the Challenger disaster-that are managed via the\noperations of machinery. The former is referred to as \"direct experience\" and the inhabitants of\nthe Machine have a horror of it. How valid is this opposition? Do we ever encounter each other\ndirectly? Our social identities have many aspects, and these aspects, more often than not, are tied\nto the considerable variety in kinds of social situations; explicit and inexplicit codes and\nconventions find expression in speech and behavior and mediate our experience of one another.\nWhy should talking down a telephone, say, be any less immediate than the ritual gestures and\nspeech of a conversation in a board room or during a presentation at presidential mansion?\n2. Hackers and nerds who frequent internet \"chat-rooms\" experience a novel freedom\nfrom their everyday social identities and often claim to have developed a series of new ones, to\nwhich they give mysterious, misleading, or comic names. Can media be a vehicle for the\nexpression of an alternate social identity? Consider the difference between tools and machines.\nTools, we know, can become extensions of one's body. (The blind often claim that they feel what\ntheir canes are touching, not the cane that their fingers are touching.) Learning, Senge-wise:\n(think of your arm as. . .) or Machiavelli-wise: learning how not to be good, to switch between the\nbeast and the human being. Is a bicycle a tool or a machine? Can't automobiles become an\nextension of your body? How about the hacker and his computer?\n3. What does it mean to live inside a machine? Is the machinery simply a metaphor, a\nstand-in for features of human relationships that Forster judged adversely? Or is the story actually\nabout machinery and what happens to human relationships when human relationships become\ndependent upon machines, particularly in the way of communication? Or can these questions both\nbe answered affirmatively - by raising the possibility that the story is about something in human\nnature (of which Forster does not approve) which does not depend upon the existence of\nmachinery but which is encouraged by an increasing reliance of human beings to manage their\nrelationships with one another by means of machines?\n4. Can people be part of a machine (or a machine-like process)? Would you regard the\nworkers on the assembly-line at Ford's plant in Highland Park as serving the conveyor belt,\nwhich embodies an idea of consecutive assembly that the workers do not have to grasp to perform\ntheir function? Can one regard the factory itself as a machine in which the workers are\nfunctioning parts?\n5. Workers might be elements of a machine-system but how about staff and\nmanagement? Any corporate entity (e.g., a government or a business) with a table of organization\nregards each element as performing a distinct function within the system of the whole, as the\nsystem turns input into output. Is it necessary to understand how the system works at every stage\nto operate efficiently as a subordinate element within it? MIT's Peter Senge (in his book, The\nFifth Discipline) talks of systems having a mind of their own, as if a system could function in\nsome aspect without anyone knowing how it works. Is this a valid way of thinking about\nsystems? Does your experience provide any example to back up an affirmative reply?\n6. Some specific questions, among others about The Machine Stops: Vashti agrees to\n\"isolate\" herself to talk to Kuno. Is she in the presence of \"several thousand people\" when she\nhasn't \"isolated\" herself? Why does she feel that she is \"wasting time\" when she agrees to talk to\nonly one person? What does Kuno mean when he says that mankind is the measure of all things?\n\nThe Book of the Machine is a set of instructions for operating the cell inhabited by each of the\npeople of the Machine plus a set of timetables for various public facilities. Vashti holds it\n\"reverently\", kisses it, and feels \"the delirium of acquiescence.\" What is she \"acquiescing\" to?\nRegard for the Machine is presented in the text as a kind of misplaced form of religious worship,\nand yet there is much talk that the present age has successfully banished superstition. Is this a\ncontradiction? How about the notion that each year (p. 263.) the machine is served more\nefficiently and less intelligently?\n7. The world in The Machine Stops has rejected intimacy and bodily expressiveness in\ncommunication; the world in \"Corporate Virtual Workplace\" presumably captures such things,\nbut shows them entirely satisfied by virtual experiences of diagrams, charts and business\npresentations. Would you want your managerial life to be spent in this way? How closely does\nthe text actually capture aspects of contemporary managerial experience, even though the kind of\nvirtual reality described does not yet exist? Would you like to borrow Johann's \"concept canon\"?\nDoes Johann's idea of \"concept\" here echo the notion of \"ideas\" held by the inhabitants of\nForster's Machine? Johann is doubtful of diagrams whose symbols \"have little correlation with\ntheir physical counterparts\"; doesn't this set his concepts apart from Vashti's \"ideas\"? How well\ndoes Austin understand the corporation for whom he is working at the moment? The essay\nproposes that he knows all he needs to know. Why would he want to know more?\n8. \"Whereas non-software objects in the real' world play out roles prescribed by nature's\nrules, software objects will act out roles in compliance with rules enforced by their hosting\ncyberspace.\" (p. 398.) What is the implication of this comparison? What is the point of the scare-\nquotes surrounding the word real?\n9. The article on the Challenger disaster comes with its own interpretation of the\nincident's implications for business ethics. This section was added after the rest of the article had\nbeen published. In your view is the interpretation provided adequate to the case? Have the writers\ncaught its essential message?\n10. Imagine Roger Boisjoly arguing against the Challenger launch in the world of\nCorporate Virtual Workplace. (Recall that his efforts during the final telecommunications\nconference relied on shuffling diagrams, charts, and illustrations.) Imagine as well that\nmanagement had the same resources to communicate to each other the extent of the disaster for\nMorton-Thiokol should the launch be canceled and the contract currently under renegotiation not\nrenewed. Would the outcome have been different if both possibilities-launch disaster, financial\ndisaster-had been presented with the graphic immediacy that the Pruitt and Barrett article\nproposes for all business encounters? Do management and engineers live in different \"virtual\nrealities\"?\n11. Suppose that Morton-Thiakol successfully dodged this bullet-that the launch went off\nwithout a hitch. What credit would Boisjoly gain from trying to prevent it? How much credit can\ncorporations ever award for preventing accidents that did not happen?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Six",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/02499d1a3ae8a430cbb42acf74068e7c_lecture6.pdf",
      "content": "Materials to Guide Reading\nLECTURE SIX\nSorrow-Acre:\nSorrow-Acre takes place in a world different from that of its intended audience, but it is\nsupposed to have lessons for them. The scene of action is in a backwater of Europe - Denmark, in\nthe late eighteenth-century, just before the American and French revolutions were to initiate\nchanges in the nature of authority in the Western world and make some of the values by which\nthe characters in the story live things of the past. The story is written from the modern standpoint,\nhowever, and our values, which are just making their way into the world of the story, are\nrepresented by the young man, Adam, who has lived in England (unlike Denmark, a major\npower) and is thinking of going off to America. The outcome of the story seems to endorse the\nvalues represented by Adam's uncle, the \"Old Lord\", but the text allows Adam to be troubled by\nmisgivings as he surrenders to the rightness of the older man's position.\nYou should understand at least three of the text's references. (1) The allusion to the Book\nof Genesis (the lord's estate looks like the Garden of Eden \"from every tree of which, thou, my\nAdam, may freely eat\") has reference to the fall of mankind; the old lord omits the rest of God's\nspeech, which forbids the first Adam to eat of one fruit - the original \"forbidden fruit\", the fruit of\nthe tree of knowledge. The forbidden fruit here is the old lord's young wife and the story carries a\ndecided hint that Adam's duty to his heritage will be fulfilled, paradoxically, by becoming the\nfather of the child who will be recognized as the old lord's legitimate heir. (2) The Biblical text\ncited by the phrase \"in the beginning was the word\" refers to the belief that God created the world\nby speaking that is, by issuing edicts; the old lord implies that for executive authority to take back\nan edict or a decision would be equivalent to God's taking back the word that created the world,\nthat is, to disavow the world and thereby destroy it. (3) Finally, the image of a single figure\nreaping in a field is a conventional image in the Western tradition for death.\n1. The long opening passage describing the land speaks of the value of \"continuance, a\nworldly immortality\" and describes how the lives of the lords of manors were focused on their\nbeing \"the incarnation\" or embodiment of that value. Yet we are expected to know that the world\nspoken of and the value embodied have passed away, were not immortal, after all. Does this make\na difference to the way in which we think of the old lord's action?\n2. Adam, at the outset of the story, feels (p. 195) that as long as someone \"of his blood\nand name\" should be lord of the manor, he himself \"would still have a home and would carry\nweight in the world.\" How would you paraphrase this feeling? Does it still make sense in the\nmodern world?\n3. The old lord has a problem in executive management. How would you describe it?\nWhat is at stake for him in the problem, which leads him not to render a decision but to pass\nresponsibility along to a subordinate who must take a fearful risk to resolve it? Why is Adam's\nuncle unwilling to act upon his beliefs or his sympathies?\n4. What are the stakes for the subordinate figure-the woman, Anne-Marie Piil? How do\nyou resolve the contradiction between her allegedly bad character (\"they tell as a girl she had a\nchild and did away with it\") and her willingness to sacrifice her life for her sons liberty?\n5. One way of looking at the old lord's action is to see it as passing the buck - a failure of\ndecisiveness and accountability. At least part of this view is founded on a sense that the risk\nimposed on Anne-Marie is somehow disproportionate to the risk (if any) that would be incurred\nby the old lord if he simply instructed the judge to free the boy on grounds of insufficient\nevidence. Does the old lord incur any risk in transferring responsibility to Anne-Marie? What\n\nanswer can be made to a proponent of this view? Adam, of course, takes the view that the old lord\nis failing himself and his responsibilities by making the wager with Anne-Marie. In part, Adam's\nview is determined by his opinion of the folk for whom the old lord is responsible. What is this\nview? Does it suit executive authority?\n6. An alternative is to see what the old lord does as an act of empowerment. In this\nconnection, what is the difference between empowerment and delegation of authority in\nmanagement? How would you describe the old lord's managerial style? The bailiff observes (p.\n205.) that if everyone worked as hard as Anne-Marie the manor might show a profit. The old lord\nreplies in such a way as to suggest that \"showing a profit\" is not the real justification of the\nmanor's existence. Is profit the bottom line for corporations or is their existence to be justified in\nterms of something else? Is there any managerial lesson to be learned from taking the old lord's\nview seriously?\n7. Does power stand in the way of virtue? asks Adam. No, says his uncle, power is in\nitself the supreme virtue. What does he mean? Is he right?\n8. In dealing with the importance of not taking back his word, the old Lord alludes to the\nopening verse of The Gospel according to John, and says that we do not know anything about the\nmeaning of God's word. \"It may,\" he says, \"have been uttered as a whim, in jest.\" What is the\nrelevance of this remark to the old lord's situation? How would this relevance translate to the\nresponsibilities of management?\n9. Do the answers of any of the foregoing questions help to explain why Isaak Dinesen\nwrote this story for her countrymen during the period of its Nazi occupation?\n10. Consider the case of a worker accepting a job with a high risk of danger (to health, to\nlife or limb), because it carries a higher wage than a job with similar duties without such risk.\nHow does the case of this worker compare with that of Anne-Marie, in Sorrow-Acre, who\nwillingly undertook a risk because of the benefit that it would yield? How does the Old Lord\ncompare with the companies that offer such jobs or with the stockholders who invest in them? If\nthe old lord was wrong, in your view, and should be debarred from making his offer to Anne-\nMarie, does it follow that companies are wrong in offering employment at risk, no matter how\nstrong the market-demand for their product, and should some executive authority debar them\nfrom making the offer?\nMilton Friedman:\n1. Friedman's essay concerns fiduciary responsibility - the sort of responsibility incurred\nwhen a client delegates the management of one aspect of his or her interests to an agent, who\nengages to pursue it within the limits prescribed by law and professional ethics. The issue here is\nmanagement of a business corporation. But the essay seems to have a larger import than merely\nto argue that the fiduciary agent must not betray the client's trust even when good reasons tempt\nhim or her to do so. It seems to adopt the notion that no good reasons can possibly exist to do the\ntempting. How does the argument manage to turn in this direction?\n2. Is Friedman's essay badly named? After all, it isn't entitled \"The Business of Business\nis Profits\"? Isn't this a piece of hypocrisy of the sort he complained about? What is the difference\nbetween saying \"Profits are Ethical\" and Ethics are Profitable\"? Would Friedman subscribe to\nboth sentiments?\n3. Friedman's paradox: You have an ethical obligation to give \"bad\" reasons for good\nactions - namely, nakedly, and unashamedly. Recall that Undershaft's conduct was described in\njust this way by Lady Britomart, and it was what annoyed her about him. (You may also recall\nthat Undershaft's motto was: \"Unashamed\"). Is the similarity here real or just a play on words?\n\n4. Undershaft says that he is not one of those people who put there moral and their\nbusiness into separate, water-tight compartments - the recommendation of Albert Carr, we recall,\nwas to do just that. Does Friedman stand with Carr or with Undershaft here?\n5. Friedman's way of dealing with disvalue-let us say, the occurrence of accidents in a\nparticular factory---is to let the general rate of profits determine the \"right\" number of accidents,\nwhich is the number where it would be more expensive in terms of opportunity costs to pay for\nimproved vehicular safety than to pay indemnity to the victim (or the victim's survivors, but\nFriedman steers clear of raising the implication of fatality). Applying the lesson of his other\npaper, one might say that it would be a breach of fiduciary responsibility (and therefore it would\nbe unethical) to make improvements and lessen physical risk beyond this point. Is the ethical\nimplication correct? (I want to suggest that not taking the issue here seriously would be a mistake,\nbecause one way or another you will be involved in decisions of this kind.) How valid is this\nargument? To what extent is it related to \"administering the woe of the universe\"? If Friedman is\nright, what sense did it make for Macnamara to invite various stakeholders at Tacoma to\nspeculate about what counts as \"acceptable risk\" in the case of lead pollution?\n6. What's the difference between saying it's ethical to be profitable and it's profitable to\nbe ethical? Would Undershaft approve of Friedman's essay?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Ten",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/df2a0ad488191e4098fb1be2a43ed507_lecture10.pdf",
      "content": "Materials to Guide Reading\nLECTURE TEN\nIbsen's A Doll's House does have a variety of implications but the text itself is not\nproblematic and so I have appended only two questions. The first six questions concern Simone\nde Beauvoir's introduction to her book, \"The Second Sex\":\n1. De Beauvoir says that the terms \"masculine\" and \"feminine\" are not symmetrical.\n\"Man\" represents mankind, whole and entire, whereas \"woman\" represents some limited,\nparticular feature of mankind. \"The fact of being a man is no peculiarity.\" The masculine body is\nthought of by a man, she says, as natural in its connection to the world, whereas a man regards the\nbody of a woman as a hindrance, lacking a normative relation to sensible experience. True?\n2. De Beauvoir gives an exposition of \"the Other\" as an essential element of any group's\nconsciousness of itself. She says that a group can only think of itself, can define itself, by setting\nup \"an Other\", a representative idea of what is not a member of itself. True? Does each group\nhave its own \"Other\"? Can you identify the notion of \"the Other\" against which management\ndefines itself?\n3. Each \"Other\", as de Beauvoir defines the term, is an actual group, not just a vague,\nundifferentiated \"everyone-but-us\". And each \"Other\", she adds, can also think of itself as \"We\".\nBut women, she argues, cannot think of themselves as \"We\". Are her reasons supporting this\nopinion valid? If women have no ethnic identity, should they try to create one?\n4. An implication not drawn by de Beauvoir, but suggested by her essay: if women are to\nbe able to say \"we\", they must be able to acquire a sense of a common and unique political\nidentity. Hence, the validity of calling for so-called \"redressive\" legislation and \"redressive\"\npractices. The community that kept women from the labor-force and from the professions must\nnow make amends for its prejudicial treatment of the group thought of as \"Other\" by slackening\nits announced ideal of fairness and give members of that group an edge in claiming the goods\nadministered by that community. In particular, it should license preferential hiring of women at\nthe expense of fairness to men--at least, for a time. What do you see as the pro's and con's of this\nposition?\n5. How accurately does de Beauvoir's analysis of the category of \"the Other\" apply to the\nsituation of Nora and Torvald in Ibsen's \"A Doll's House\". Is the relationship of Otherness\nreciprocal or one-sided--Nora is Torvald's Other but not vice-versa?\n6. Nora says that her father and her husband have done her a terrible wrong. What is the\nnature of that wrong? Can it be generalised to apply to the position of other subordinate groups in\nour society? Nora responds to Torvald's outburst about her unfitness to raise children not by\njustifying her actions (they were necessary to save his life, etc.) but by accepting the judgment\nand making it a reason for abandoning her family. Many have held that this gesture proves\nTorvald's case: however bad Torvald's outburst, it does not justify her abandoning her duties to\nher husband and children. This was a sticking-point with Ibsen, who held all his life that duties to\noneself took precedence over other important values."
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Three",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/db87dc103e3612eaf340604d442567c0_lecture3.pdf",
      "content": "Materials to Guide Reading\nLECTURE THREE\nAntigone:\nThe subject of this play is represented in the text by the Greek word philia, whose root\nappears in such words as \"philosophy\" and \"Philadelphia\". Most texts translate it as \"love\", and\nso \"love\" figures prominently in your translation of the Antigone. (Thus \"philosophy\" is supposed\nto mean \"love of wisdom\", since \"sophia\" means wisdom; and Philadelphia was named in honor\nof \"brotherly love\".) But \"philia\" does not have a direct English equivalent; it means the deepest\nand most important bonds that tie you to another person or group of persons. The English word\n\"loyal\" derives from the Latin \"ligare\", which meant \"to bond, to tie down\", and Creon is talking\nabout \"philien\" when he talks about loyalty (or allegiance).\nWhat is Creon's position at the outset of the play? In answering, bear in mind (a) that it is\nthe very next day after an unsuccessful attempt to conquer his city; (b) the usual attempts at\nconquests always tried to enlist the aid of any group within the city who were disaffected or at\nodds with the leadership and normally secured this aid before any campaign was launched\n(modern equivalents are called \"fifth columnists\" and \"traitors within\"), so that Creon's fears\nabout traitors within are not entirely unreasonable; (c) the person whose burial he forbids\n(Polynices) is his own nephew, who has turned against his family, and the duty to bury such a\nperson would normally fall upon him.\nWhat is Antigone's position at the outset of the play? Granted that the ritual burial of kin\nis a sacred obligation, but only a ritual (it need only be a token sprinkling, which is all that\nAntigone can supply), why is it so important to her? Is Ismene (caught-in-the-middle Ismene) an\nethical weakling, a mere fence-sitter, or does she represent a reasonable position? Is it ever a good\nidea to say about someone that they are either a part of the solution or a part of the problem?\nAntigone represents \"family values\" but at the same time something \"deeper\" (if not\nhigher), connected with religion-the unwritten dateless laws. Why unwritten? Why dateless?\nExplore the connection between family values and \"greater\", other-than-general values-for\nexample, the way in which Albert Carr insistently draws a connection between the kind of\nobjection to business practices made from an ethical standpoint and religion. Take a modern case\nof the quarrel between the duties of office and the imperatives of religion: a doctor is devoted to\nreducing pain and preserving life but Christian Science parents refuse permission to let the doctor\ngive a necessary bone-marrow transplant; in their view, faith alone does the healing and what is\nmore, permitting the treatment would endanger the child's life because it would issue from lack of\nfaith. (A case of this sort was in the papers about three years ago. In this case, the child died and\nthe parents were tried by the law for criminal neglect.) Is the doctor being stubborn, or betraying\nweakness, or is he just being a doctor? How about the other side? One wants to follow the\nprecepts of \"getting to yes\" by giving each side their due, but to compromise here by giving half a\ntransplant would defeat both sides and accomplish nothing.\nConsider three kinds of loyalty: (1) To an absolute or transcendent obligation. Abraham\nwas instructed by God to sacrifice Isaac, his son, as a test of faith, and Abraham proceeded to do\nit. Did he do well? Compare his response to Antigone's (2) To a group and (perhaps) to the\nvalues that it stands for. Would you die for America? Democracy? Free Trade? The English\nwriter John Ruskin offered the notion of a \"due occasion of death\" attendant upon any vocation.\nThe doctor, the soldier, the minister had each a due occasion of death-a moment when they might\nbe called upon to sacrifice their lives for the health of their fellow human beings, the safety of the\nnation, the spiritual well-being of the congregation. What, he asked, was the due occasion of\n\ndeath of the business person? (Poor Ruskin) (3) And finally: To one's history. How important is it\nto defend the values of our ethnic origins?\nCrito:\nCrito urges Socrates to escape from prison and not abide an unjust sentence of death\nleveled by the Athenian assembly. What are his specific arguments? Does Socrates answer them?\nTwo of them are: \"You are choosing the easy way out and not the way of a good and brave man\"\nand \"You are playing into the hands of your enemies, giving them exactly what they want\". How\neffective are these arguments? What is their general character? Socrates urges a discussion of\nfundamental points, arguing that it will be harder to cope with an anxiety that has no rational\nbasis. What assumptions lie behind this point of view. He also insists that it is the gravest of\nerrors to consider the opinions of those who are not experts in ethics. How reliant should we be\non expert opinion in making decisions about ethical conduct? Socrates also says that the\nimportant thing is not living but living well. His abiding the decision of the assembly might be\nviewed as a form of suicide; just as a life in a pain-wracked body is not worth living (and in the\nancient world, it was considered noble to end one's life under such a circumstance and rather\nignoble to carry on), so it is still more true where the health of the soul is concerned. What do you\nthink of this view? Does the analogy hold up? Finally, there is the Socratic view, which serves as\nthe turning-point in Socrates's argument. \"Never act unjustly--therefore, never repay injustice\nwith injustice\". (Or \"never repay harm with harm\". The maxim is susceptible of alternative\ninterpretations.) One might counter with the view that one is morally obliged not only to resist\nevil but also to extirpate it-the \"sword of the righteous\" argument. Consider the issues involved\nhere. Is Socrates urging a Christian view here-the meek shall inherit the earth, turn the other\ncheek?"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture Two",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-269b-literature-ethics-and-authority-fall-2002/120b231ca2173773922398ada65e0b46_lecture2.pdf",
      "content": "Materials to Guide Reading\nLECTURE TWO\nThe Housebreaker of Shady Hill:\nDoes Johnny Hake have a good family life? Is it a source of ethical awareness? Should it\nbe? Consider his relation to his wife, who is a source of \"clear emotion\" for him and who must be\nkept from financial awareness; compare this with his mother, who never made a cheese sandwich\nwithout grousing. Is the mother's opposition to the marriage explicable in this context? Why does\nthe story make you figure this out for yourself? We are expected to be smarter than Hake--his\nacceptance of life is earned but potentially foolhardy (he ends whistling in the dark), yet he shares\nthe sense of his own absurdity. Would you want to work in parablendeum? Is the company a\npatriarchy? Why is Hake fired? Should he have been fired? Was it wrong of the \"old man\" to\nsend Hake to do the firing? Who fired Hake, the old man or Gil, the henchman, the great\ncondescender, who \"garnished every deal with humanity\"? Why does the story make Johnny\nHake decide to steal? (This is different from asking why he decides to steal-his fantasies about\nhaving cancer and leaving his wife and children penniless.) Of course, there wouldn't be any story\nif he didn't decide to steal; hence the question is prompting a consideration of the point of the\nstory as a whole. Is the ending appropriate? Suppose, instead of getting his job back, Johnny\nHake was filled with resolve and continued in his efforts to maintain his present style of life by\nsuccessful brokering or lowered his standards and got a job with a smaller salary. Would this be a\nbetter ending?\nIs Business Bluffing Ethical?\nCarr's essay offers a compendium of cases in miniature-the lying candidate, the candidate\nwho doctors his C.V., the aging, less-energetic executive who is fired so that the company can\nsave on his pension (but what would that do to company morale?), the accountant who\ninadvertently has the company take a false tax deduction and doesn't want to call the matter to the\npresident's attention, the executive who owns stock in a nephew's name and shoves business in\nthat company's way, etc.\nWe add a case of our own: Consider the plight of a consultant at Mercer Corporation,\nwho works up a viability scheme for the buy-out of company x by conglomerate A, then gets an\nidentical request from conglomerate B, which had hitherto given no sign that it was interested in\nthe acquisition. Since the consultant does not want to signal that another conglomerate may be\ninterested, and the work for A (which will do for B as well) was considerable, she charges B as\nmuch as for A, even though she had much less to do, for to charge less might give B's game\naway. Both A and B congratulate her (independently) for her work, but on the morning after she\nreads that company x has declined all offers, she gets a request from B for a breakdown of her\ncharge for services. The hourly rate in top consulting firms for such work is not standard, but the\ngeneral parameters are well known. What course should she follow in replying?\nItalian Tax Mores:\nThis reading was selected in order to raise two questions in connection with the readings\nfrom John Cheever and Albert Carr. How valid is Johnny Hake's perception that success at home\nrequires something akin to theft in the world in which bread is earned to put on the table? How\nvalid is Carr's argument that business morality is different from everyday morality and shouldn't\nbe judged by its standards? We here touch upon problems in holding fast to a difference between\n\nbusiness morality and morality, when it may seem that there might be overarching principles that\ncover both. Here are some further remarks:\nThe issue raised by the case seems trivial. Why is the new branch manager so upset about\na business practice which has the collusion of a legal authority and which doesn't seem to harm\nanyone in particular? Is there a case to be made that he behaved foolishly? (One should note that\nwhen the going assumption is that no honest or firm offer will be put on the table, there are\npenalties to being truthful. The system described in this case is a version of the Prisoner's\nDilemma and is not so easily challenged as one might suppose.) This discussion should prompt a\nnumber of questions. Does the collusion of legal authority make a difference to the ethical\ncharacter of an action and if so, in what way? How important is the notion of harm to judging the\nethical quality of a practice? Are there unethical practices without victims? Sometimes the effects\nof a practice is evident, the victims visible, the harm severe, but more often the effects are so\ndistributed or parceled out that the harm seems trivial in any particular instance and/or the victims\nare invisible or far away. (This is the case in matters concerning pollution; everyone does it and\nthe law colludes at much of it, and so you have no immediate ethical pressure to meet standards\nthat will reduce earnings.)\nIn this case, the harm is difficult to track. One might start considering the manager's\nresponse by trying to track it; a system of bribery is at work and at it is likely that someone,\nsomewhere, at distance from the crime is paying the cost of this by bearing an unfair burden of\ntaxes as a result. (The bribe, moreover, counts as a deductible business expense.) Then, too, there\nis the fact that \"everyone does it\", a situation which usually carries the implication that if you\ndon't do it, someone else will. Does this relieve you of an ethical responsibility?\nThese questions are not meant rhetorically but as requesting reasoned answers. One\nsometimes gets somewhere in discussing such questions by changing the content but keeping the\nsame structure-that is, by raising the ante, so to speak. Without actually presenting the case (I\nhave in mind a problem in aircraft design akin to that recently fought out between Breakstone\nTires and the Ford Motor company about who bears the cost of design-failure), just accept that\nthe Federal Aviation Authority draws its inspectors from engineers currently employed by aircraft\nproduction firms. (This is true.) And now suppose that there is a powerful motive to wink at\npotential design flaws even when the inspector involved does not work for any of the companies\nconcerned with manufacturing the plane that he or she inspects, simply because it is an industry\npractice to do so. Why pull a design off line-harming a competitor company and therefore giving\nthe boat a considerable rock--when the evidence is not conclusive? Does the notion of possible\nfatality somewhere and sometime in the future alter the ethical case?\nFinally, we might alter the way the bribery works: You have performed a competent piece of\nconsulting work (no more than competent) for Joyful Industries and the CEO, O. B. Joyful,\ninvites you to his company's Christmas party, where he hands you an envelope marked \"Happy\nChristmas\" and murmurs, \"To be opened at Christmas. Just a small token of appreciation\". You\nget back to your office and open the envelope: inside are ten crisp, new five hundred dollar bills.\nYour office mate, an old hand at the game, says: \"Keep it. A few companies do it around here.\nHe'll ask you for some information from time to time about other companies that use our\nservices-nothing like industrial espionage, you understand, just a general sense of how things are\ngoing with rivals, what's most on their minds, that sort of thing. It's not as if you're going to be\nasked to reveal patented secrets or the contents of files marked confidential.\" Do you keep the\nmoney? Or do you risk offending a client valued by your company by returning the money? Does\nthe fact that the bribe is direct-not negotiated by agent to whom you pay a sum of money for the\nservice-make a difference and if so, how?"
    }
  ]
}