{
  "course_name": "Literary Interpretation: Literature and Urban Experience",
  "course_description": "Alienation, overcrowding, sensory overload, homelessness, criminality, violence, loneliness, sprawl, blight. How have the realities of city living influenced literature’s formal and thematic techniques? How useful is it to think of literature as its own kind of “map” of urban space? Are cities too grand, heterogeneous, and shifting to be captured by writers? In this seminar we will seek answers to these questions in key city literature, and in theoretical works that endeavor to understand the culture of cities.",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Philosophy",
    "Social Science",
    "Urban Studies",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Philosophy",
    "Social Science",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nTwo courses in Literature\n\nRequired Books\n\nEliot, T. S.\nThe Waste Land and Other Writings\n. New York, NY: The Modern Library, 2002. ISBN: 9780375759345. [\nDownload\nfrom Project Gutenberg]\n\nWoolf, Virgina.\nMrs. Dalloway\n. New York, NY: Penguin USA, 1996. ISBN: 9780140622218. [\nPreview\nin Google Books]\n\nCarson, Ciaran.\nBelfast Confetti\n. Winston-Salem, NC: Wake Forest University Press, 1989. ISBN: 9780916390402.\n\nWilson, Robert McLiam.\nRipley Bogle\n. New York, NY: Ballantine Books, 2000. ISBN: 9780345430946. [\nPreview\nin Google Books]\n\nSelvon, Sam.\nThe Lonely Londoners\n. New York, NY: Longman, 1989. ISBN: 9780582642645.\n\nEffective Participation\n\nCome to class having read the assigned material carefully, and prepared to listen to your classmates and engage in conversation and respectful debate with them. You will not be expected to have a brilliant insight at every moment, but do expect to voice your thoughts and interpretations, however new or unformed. We will welcome them.\n\nAdditional Expectations\n\nAttendance is mandatory. If you are going to be absent you must alert me in advance. Each student will be allowed two absences, after which he or she will lose 1% (of the course total 100%) for each incident. Being late is a form of absence, and I will decide what number of late arrivals adds up to one day of absence.\n\nPlagiarism will be heavily penalized. The Literature Faculty policy states: \"students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work.\" Visit\nWriting and Humanistic Studies\n.\n\nGrades\n\nACTIVITIES\n\nPERCENTAGES\n\n5-7 page essay and revision\n\n35%\n\n12-20 page essay\n\n35%\n\nDiscussion leadership and participation\n\n30%",
  "files": [
    {
      "category": "Resource",
      "title": "Discussion Leadership Pointers",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-literature-and-urban-experience-spring-2009/fcf5415e3408bcfc8957b812e2d9da6e_MIT21L_701S09_Disc_Lead.pdf",
      "content": "Professor Brouillette's\nDiscussion Leadership Pointers\n\nIn general, effective discussion leadership involves identifying a key issue, technique, or\npassage in the text, sharing your own insights into / interpretations of the thing(s)\nyou've identified, and engaging your peers in conversation.\n\nVariety is the spice of life, and your options are endless: you can have us do some kind of\nexercise or activity (whether in groups or on our own), have us analyze passages, have us\nconsider some through line or overarching theme, tell us about some context that you\nthink might be relevant or interesting, show us images or web sites or articles, etcetera.\n\nThe challenge is to find ways to apply your individual analysis and knowledge to the\nexperience we've all shared: namely, reading the text in question.\nAn easy way to engage your peers is to solicit responses to questions. What I call 'True\nQuestions' - that is, questions to which you don't have a ready answer, or questions that\nmay not have just one answer - tend to work well.\nFormulating effective questions isn't easy, of course. Here is some advice you may find\nhelpful (few questions will satisfy all these points!):\n1. Avoid questions that test knowledge of content\n2. Avoid questions that are answered by \"yes\" or \"no\"\n3. Ask questions that start with \"How, Why, or What\"\n4. Ask questions that lead to analysis, synthesis, and comparisons about the work,\nthemes, issues, etcetera\n5. Ask questions that are open-ended and allow for expression of the diversity of\nyour peers' interpretations and perspectives\n6. Ask questions that can't be answered without close reading of the text (for\ninstance you might refer to particular scenes or passages and ask us to examine them\nclosely)\n7. Ask questions that are useful, helping us clarify complex passages or issues\n8. Ask questions that connect the text to other works and wider themes.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 Literary Interpretation: Literature and Urban Experience\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Final essay assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-literature-and-urban-experience-spring-2009/d04fcc37801edca6d46c82dc9db91740_MIT21L_701S09_Final_essay.pdf",
      "content": "21L.701 Literary Interpretation\n(Literature and Urban Experience)\nProfessor Sarah Brouillette\n\nFinal Essay Prompts\n\nChoose a prompt and write a concise, persuasive, compelling essay that features a strong thesis\nstatement and evidence of close reading, analytical rigor, and thought about form.\n\nDo not just \"answer\" the prompt; take a position that arises from careful thought\nabout how best to respond to it.\n\n1. Discuss how iterant characters and/or itinerancy inform two or more of our texts.\n\n2. Discuss how notions of the city as \"fortress\" inform two or more or our texts.\n\n3. Discuss how notions of the city as \"labyrinth\" inform two or more or our texts.\n\n4. Discuss how confluence of cultures in urban space is treated in two or more or our texts.\n\n5. Through detailed interpretation of two or more of our texts, discuss the relationship\nbetween postmodernism and urbanization.\n\n6. What does the shift from modernism to postmodernism have to do with urbanization?\nAnswer with reference to two or more of our texts.\n\n7. Compare how two or more of our writers treat the ethics of looking at the strangers who\nsurround us in urban settings.\n\n8. David Harvey contends that \"Postmodernism swims, even wallows, in the fragmentary\nand chaotic currents of change as if that is all there is\" (44). Assess this argument\nthrough attention to two or more of our texts.\n\n9. Discuss the city as a space of \"calculability\" (this is Simmel's word) in two or more or our\ntexts.\n\n10. Through a detailed reading of at least one of our texts, critique any of our suggested\nreadings.\n\nNB\n\n-\nYour paper must be 10-12 double-spaced pages, in a 12 pt. font.\n-\nThe citation system is MLA.\n-\nLate papers lose 1% of the course total per day\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 Literary Interpretation: Literature and Urban Experience\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Notes on essay revision",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-literature-and-urban-experience-spring-2009/7b6e02bc247b9072d1bbcecce06cb852_MIT21L_701S09_Notes_Essay.pdf",
      "content": "21L.701\nSarah Brouillette\n\nNotes on the Revision Process\n\n1. Read through the essay and any feedback on it (mine, your own, your classmate's,\nyour peers'). Take seriously the opinions of others, but also consider your own\nthoughts about the paper as it stands. Indicate which parts you like and don't\nlike, which parts you no longer understand or don't think are well supported, and\nwhich parts you think deserve more attention and development.\n\n2. Slow down and pay attention to the paper's opening. If you wrote in a more loose\nstyle originally, can you now introduce a more focused argument? If your paper\nalready has a thesis, is it an effective one? Underline what you take to be your\nargument and think about it for a moment. Is it clearly expressed? Does it get at\nwhat you really consider the strengths of your paper? Is more proof required to\nmake your point? How can you clarify or expand your original argument so that\nyou are more happy with it?\n\n3. While thinking about your paper's strengths and its argument, consider making\nthe following changes: pay more attention to details and to the literary techniques\nof the text; incorporate other evidence from the text or incorporate more\nreference to the larger themes of the text; identify counterarguments; pay more\nattention to potential tensions/problems/ironies in your argument that you could\nsay more about.\n\n4. As you adjust your focus, you will also need to change the subsequent\nargumentation that develops it. Does your paper now have enough material to\nsupport your new argument? Do you need to take some things out and add\nothers? Don't be afraid of the rewriting process. The idea is to be dissatisfied with\nwhat you've done, come to some better understanding of why you feel that way,\nand set about alleviating that feeling. You can't change your ideas without\nchanging the structure you've made for their expression.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 Literary Interpretation: Literature and Urban Experience\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Essay 1 prompts",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-literature-and-urban-experience-spring-2009/bf54166dbf13e2112e22540b46cff499_MIT21L_701S09_Essay1_edit.pdf",
      "content": "21L.701 Literary Interpretation\n(Literature and Urban Experience)\nProfessor Sarah Brouillette\n\nEssay #1 Prompts\n\nChoose a prompt and write a concise, persuasive, compelling essay that features a strong thesis\nstatement and evidence of close reading, analytical rigor, and thought about form.\n\nDo not just \"answer\" the prompt; take a position that arises from careful thought\nabout how best to respond to it.\n\n1. Relate Georg Simmel's theory of the blase attitude to TS Eliot's poetry, and/or to Virginia\nWoolf's novel.\n\n2. Raymond Williams states that the \"key cultural factor of the modernist shift is the\ncharacter of the metropolis\" and that the \"most important general element of the\ninnovations in form is the fact of immigration to the metropolis\" (45). Discuss these\nclaims in relation to one or more of the works we've studied.\n\n3. What is Raymond Williams critiquing in the selections we read?\n\n4. Discuss the dichotomy between the city and the country, and/or the breakdown of that\ndichotomy, in work by one, two, or three of our writers.\n\n5. Discuss how the act of walking through city streets informs writing by one or two of the\nfollowing: Virginia Woolf, William Wordsworth, Walter Benjamin, and/or TS Eliot.\n\n6. How do Walter Benjamin and Friedrich Engels position themselves in relation to the\nurban geographies that are their subject matter?\n\n7. Discuss the city as a space for the circulation of commodities in work by Virginia Woolf,\nTS Eliot, and/or Walter Benjamin.\n\n8. Discuss what reference to the specific geography of London does for TS Eliot's The Waste\nLand and/or Virginia Woolf's Mrs. Dalloway. This will likely require research.\n\n9. Why is work by TS Eliot and/or Virginia Woolf difficult to read at first?\n\nNB\n\n-\nGuidelines outlining best practices for literature papers are available on our website.\n-\nYour paper must be 5-7 double-spaced pages, in a 12 pt. font.\n-\nThe citation system is MLA.\n-\nLate papers lose 1% of the course total per day\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 Literary Interpretation: Literature and Urban Experience\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}