{
  "course_name": "Literature and Ethical Values",
  "course_description": "The aim of this subject is to acquaint the student with some important works of systematic ethical philosophy and to bring to bear the viewpoint of those works on the study of classic works of literature. This subject will trace the history of ethical speculation in systematic philosophy by identifying four major positions: two from the ancient world and the two most important traditions of ethical philosophy since the renaissance. The two ancient positions will be represented by Plato and Aristotle, the two modern positions by Immanuel Kant and John Stuart Mill. We will try to understand these four positions as engaged in a rivalry with one another, and we will also engage with the philosophy of Thomas Hobbes, which offers a bridge between ancient and modern conceptions and provides a source for the rivalry between the viewpoints of Kant and Mill. Further, we will be mindful that the modern positions are subject to criticism today by new currents of philosophical speculation, some of which argue for a return to the positions of Plato and Aristotle.",
  "topics": [
    "Humanities",
    "Literature",
    "Classics",
    "Comparative Literature",
    "Philosophy",
    "Ethics",
    "Humanities",
    "Literature",
    "Classics",
    "Comparative Literature",
    "Philosophy",
    "Ethics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nThe aim of this subject is to acquaint the student with some important works of systematic ethical philosophy and to bring to bear the viewpoint of those works on the study of classic works of literature.\n\nThe subject-matters of ethics and literature are closely related. Most ethical arguments arise out of stories that we tell ourselves about who we are and what we are doing; at the same time, there is scarcely a work of literature that does not carry a weight of moral urgency or exemplify an ethical position. This subject will trace the history of ethical speculation in systematic philosophy by identifying four major positions: two from the ancient world and the two most important traditions of ethical philosophy since the renaissance. The two ancient positions will be represented by Plato and Aristotle, the two modern positions by Immanuel Kant and John Stuart Mill. We will try to understand these four positions as engaged in a rivalry with one another, and we will also engage with the philosophy of Thomas Hobbes, which offers a bridge between ancient and modern conceptions and provides a source for the rivalry between the viewpoints of Kant and Mill. Further, we will be mindful that the modern positions are subject to criticism today by new currents of philosophical speculation, some of which argue for a return to the positions of Plato and Aristotle.\n\nOur attention to ethical philosophy, however, will be always in service to close reading and discussion of a number of important works of literature. Authors will include Sophocles, Dante, Shakespeare, Herman Melville, Fyodor Dostoyevsky, Joseph Conrad, George Bernard Shaw, and Flannery O. Connor. Topics covered will include: the rights of individuals to resist legal authority, the responsibilities of leadership, the need for power in an unjust world, the ethics of manipulation, the values of truthfulness and deception. In reading these texts, we will not only pay attention to the ethical commitments of the characters but also to the commitments of the texts. It will be an open question whether we accept or not the \"poetic justice\" of the outcome of a story, the way in which it distributes fortune to the characters involved in the plot.\n\nTime will also be devoted to discussion of Biblical materials, excerpts from the Book of Genesis and The Gospel according to St. Matthew.\n\nCourse Format\n\nThe subject meets twice a week for two ninety-minute sessions. Each session begins with a lecture of varying length, but usually running for twenty-minutes to half an hour, although the lectures of the first two meetings will be somewhat longer. The rest of the session is devoted to class-discussion of the materials assigned for the session. Groups of students will be appointed from time to time to present a view of some of the materials during the last twenty minutes of the session. Participation in discussion is essential to the life of the class and the force and cogency of students' remarks will have a marked influence on grades. Much of the grade will also depend upon the quality of the three written assignments required by the course: an early paper (running from five to seven pages) a mid-term paper (running from seven to nine pages) and a final paper (running from ten to twelve pages). The papers will each deal with some aspect of the readings and discussion; topics may be invented by the students but an extensive list of suggested topics will be circulated two weeks in advance of each paper's due date for those students who require it. There is no final examination for this subject.\n\nRequired Texts\n\nCoursepack: containing\nAntigone\n,\nGospel according to St Matthew\n, Shakespeare,\nJulius Caesar\n, Melville,\nBilly Budd\n, Shaw,\nMajor Barbara\n, Flannery O. Connor, \"The Displaced Person.\"\n\nPlato.\nRepublic.\nTranslated by Desmond Lee. Penguin.\n\nDante.\nInferno.\nTranslated by Allen Mandelbaum. Bantam.\n\nDostoyevsky.\nCrime and Punishment.\nTranslated by Pevear and Volokhonsky. Random House.\n\nConrad. \"The Secret Sharer.\"\n\nAlso, the following materials will be made available in excerpt: Aristotle,\nNichomachean Ethics\n, Machiavelli,\nThe Prince\n, Thomas Hobbes,\nLeviathan\n, Kant,\nMetaphysics of Morals\n, Mill,\nUtilitarianism\n.",
  "files": [
    {
      "category": "Assignment",
      "title": "paperassignment1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/244a75a92f897940f641ca4f4e1c74c3_paperassignment1.pdf",
      "content": "PAPER ASSIGMENTS\n21L450 LITERATURE AND ETHICAL VALUES\nFIRST PAPER ASSIGNMENT\nDue by Lecture #10\nPapers should be 5-6 pages in length, double-spaced, or the equivalent. (Figure 350 words/page.)\nYou may write on any subject that occurs to you concerning the texts read so far this term. The following\nlist is offered by way of sample topics; you may choose one of them but need not do so.\nSUGGESTED TOPICS\nCreon and Antigone articulate different views of the authority that they invoke to justify their positions.\nOne of these concerns allegiance, another human nature, a third the nature of the gods. What is Creon's\nview of these things? What is Antigone's? Does the outcome of the play reinforce one of these views or\nthe other, or does it suggest that both parties to the quarrel are wrong?\nWhat is Creon's position at the outset of the play? What ideals does he stand for or come to stand for\nduring the course of the play? What is Antigone's position at the outset of the play? Granted that the\nritual burial of kin is a sacred obligation, but only a ritual (it need only be a token sprinkling, which is all\nthat Antigone can supply), why is it so important to her? Is Ismene (caught-in-the-middle Ismene) an\nethical weakling, a mere fence-sitter, or does she represent a reasonable position? Is it ever a good idea to\nsay about someone that they are either a part of the solution or a part of the problem?\nArgue for one of the following four views: (a) Antigone is a play without a hero (or heroine). (b)\nAntigone is a play where one sort of right collides with another. It has two central characters, two tragic\nfigures.\n(c) Creon is the tragic center of the play. (d) Antigone is the tragic center of the play.\nN.B. In your answers, offer arguments but make no mention whatsoever of \"how the dictionary defines\ntragic heroes\" or \"how Aristotle defines tragic heroes\".\nMartin Luther King associates himself with Antigone at one point. Is he right to do so? Offer reasons on\none side or the other and then argue your position.\nDiscuss the implications of the story of the Garden of Eden in Genesis in any way that seems relevant to\nethical issues.\nComment in any way on a comparison between Socrates's faithfulness to the laws of Athens (in the Crito)\nand the faithfulness of Abraham in the story of the sacrifice of Isaac.\nGive a careful account of the dialogue between Socrates and Polemarchus and/or Thrasymachus at the\noutset of the Republic, highlighting the ways in which the course of the argument lays the groundwork for\nthe conclusions that Socrates will ultimately defend and remark in any fashion that you see fit on the\nadequacy of the argument.\nDiscuss the theory of Thrasymachus about justice at the outset of the Republic. How does it differ and\nhow does it resemble the theory of Glaucon (who is only reporting on \"what people say\")? How good is\nThrasymachus's case? How well does Socrates refute it? At the end of this part of the dialogue, Socrates\nsays that he has got the better of Thrasymachus's arguments but still doesn't know what justice is. Is he\nright? How well or badly is the rest of the argument of The Republic foreshadowed in this part of the\nbook?\nElucidate any major element of the ensuing text (e.g., Glaucon's myth of Gyges, the validity of the\n\nanalogy between the individual and the polis (that is, the state, as our translation puts it), the divided line\nand its connection to the parable of the Cave, the ultimate definitions of the four cardinal virtues [laid out\nat 433c-d], the issues surrounding the notion that we must have composite selves if the notion \"master of\noneself\" is to have meaning, and so forth), giving a careful account of its presentation in the book and\nconnecting it to what you think is the overall point of view that Plato is pushing.\nHow do you square the fact that there are two orders of society (Guardians and People), three faculties in\nthe mind, and four virtues? What does this match-up imply, in your way of thinking about any of the\nfollowing: the book's conception of virtue? the analogy between the state and the individual? the\nrelation between \"justice\" and \"temperance\" or \"self-control\", both of which seem to apply to the state as\na whole, rather than belonging to a particular group within it?\nIs Socrates right in his judgment upon the Sophists (493b-d)? Does this judgement rightly apply to\npoliticians today or to those who teach the \"arts of success\" in any competitive or adversarial branch of\nhuman endeavor, such as business or law?\nElucidate the Parable of the Cave in Plato's Republic. How apt are the various details to the argument of\nthe book as a whole? Are the three parts of the soul represented in the story? Why would those in the\ncave wish to kill anyone who's been out looking at the sun? After all, his/her eyes aren't used to darkness,\nand so he/she must seem a bumbling, ineffectual sort of person. What is the point in the parable of being\nable to look at the sun? Can we ever \"gaze upon\" the sun?\"\nOf course, none of us would want to live in Plato's Republic. Plato would have Socrates say that this is a\ngood test of whether we are right-minded or one of the corrupt types described at the end of the book.\nHow wrong is he?\nThe following topics relate to Aristotle's Nichomachean Ethics:\n1. Explain how well Aristotle=s view that Ayou never deliberate about ends@ (insisted on at\nvarious points, particularly in (III, 3) suits his view that \"practical wisdom [phron'sis] deliberates well\nabout what sorts of thing conduce to the good life generally, not just particular things\" (i.e., the account of\npractical wisdom in Bk VI).\n2. If practical wisdom isn't an art, it isn't of any use in making us good; if it is, we needn't know\nit but can hire a trainer. How does Aristotle's answer to this paradox (raised at the end of Bk VI) jibe with\nhis general position about virtue?\n3. Explain the analogy that Aristotle draws between the way in which cleverness or Asmarts@\nrelates to practical wisdom and the way in which natural virtue relates to virtue or excellence in the true\nsense. (VI, 13.) How is this illustrative of Aristotle's whole conception of the place of virtue or\nexcellence in human life?\n4. Both Aristotle and Plato make reference to the existence of something called Atechn'@,which is\nvariously translated as \"art\" or \"craft\" (as in the phrase \"arts and crafts\"--boat-building, woodworking,\nand such like). Discuss briefly the place of this term in the argument of either or compare the use in both.\nOr: Aristotle at one point (I, 7) argues that if musicians or shoemakers have an \"ergon\" (a direction of\ntheir activity towards an end that defines the activity as that of a musician or a shoemaker), so human\nbeings must have an \"ergon\" as well, a direction of their activity that defines it as human activity. How\ngood is this analogy?\n5. Try to explain the difference between the views of Aristotle and Plato upon any really\nimportant point in their conception of the ethical life and how it relates to their overall conceptions. For\nexample: Aristotle has a notion of the value of learning about ethics that is very different from Plato=s.\n\n6. The aim of life is happiness, says Aristotle. There are many who would regard this as\nuntrue, others as perhaps true but something to be regretted, for this aim is incompatible with true\nmorality, still others who regard this as a diminution of the seriousness of life. (Certain\nphilosophers have condemned Jefferson's Alife, liberty and the pursuit of happiness@ as a\ntrivialization of the aims of political union.) Comment.\n7. Being virtuous (excellent) or acting virtuously (or excellently or noblyBit all depends\non the translation) must give oneself pleasureBbe good for oneself in the sense that it affords\npleasure. Someone who acts virtuously but doesn't take pleasure in the activity is not a fully\nrealized human being. Elucidate as simply as possible some of the grounds for this view of\nAristotle's.\n8. Some think that the purpose of ethical inquiry and argument is to persuade those who\naren't ethical to start becoming ethical. Aristotle says that ethical inquiry is extremely important\n(throughout Book I) and that it's about how to become good (Bk II, ch 2). At the same time, he\ndoesn't think that people who aren't already good (like young men, who don't know enough about\nlife) can understand what he has to say or profit from it. And he says the same of those whose\ncharacter has been already be formed by experience and don't have the right views of life. The\nparadox involved here occurs in one version in III, 6, where Aristotle examines the view that\neither people see the good properly because they've been lucky enough to get the right ideas into\ntheir heads or they don't, because they haven't been that lucky, and so you can't praise one and\nblame the other, since both are doing what they think is good, as they see it. How would Aristotle\ndeal with any aspect of this?\n9. Explain what Aristotle might mean by saying that Aman has a function@, even as a\ncarpenter and a tanner has."
    },
    {
      "category": "Assignment",
      "title": "paperassignment2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/592ba4e47708a47584da5d9b952700b1_paperassignment2.pdf",
      "content": "PAPER ASSIGNMENTS\n21L450 LITERATURE AND ETHICAL VALUES\nSECOND PAPER ASSIGNMENT\nDue by Lecture #18\nPapers are due by Lecture #18 (not by Lecture #17, as the syllabus originally announced) and\nshould consist of six pages (figure 320 words/page). Please number the pages of your essay; it will help\nme in writing comments. The questions and topics listed below are not meant to be addressed directly\n(although, of course, you may address them directly if you choose). They are meant to be suggestive, to\nget you thinking about the materials. If you wish to modify them or invent a topic of your own, you may\ndo so. However, it remains the case that the subject of papers should be one (or more) of the texts read\nand discussed during the second third of this term, covering the readings from Aristotle through\nImmanuel Kant.\nPlease remember that you are writing an essay, not a book-report. An interpretative essay\naddresses itself to readers who have read the work under discussion and do not require an account of its\ncontents (although they may not recall the work in detail). What an essay (as opposed to a book-report)\ndoes supply is some reminder of those contents in the context of an argument about them; the reminder is\noffered in the course of explaining how one should understand or interpret the work in question. Any\ngood, short, coherent essay will be arguing something. It will help you to write an essay if you have in\nmind some point that you are trying to make. Such a point should not be self-evident; you should be able\nto state an opposing point (the one that you are denying) which is not so obviously silly that no one would\nbe able to argue in its favor.\nSUGGESTED TOPICS\nDante places virtuous pagans in Hell. He places the prodigal higher than the spendthrift, murderers\nhigher than the noble Ulysses, and counterfeiters right next to the bottom, wherein are placed the worst of\nthe lot. Clearly a schematic arrangement, but one puzzling from our modern point of view. Comment.\nDante's afterlife is peopled with three sorts: those of antiquity, in respect of which Dante does not\nproperly distinguish between historical figures and those of imaginative literature, those (very few indeed)\nfrom biblical literature, and those from fairly recent history--say, the last 80 or so years, some of whom he\nknew and almost all from Italy. Comment.\nThe gate over hell says (among other things) that it was made by divine power (or authority), highest\nwisdom, and primal (or first) love, that justice moved its creator, and that those who enter must abandon\nevery hope. Comment on what Dante finds in Hell in the light of this inscription. Alternatively: Virgil\nsays that those in Hell have \"lost the good of the intellect\". What does the phrase mean in the light of the\npoem?\nThe notion that the punishment fits the crime is supposed to be omnipresent in Dante. Indeed, it has been\nsaid that in Hell, the punishment is the crime--that the characters are condemned to be eternally what they\nwere (or had become) in life as that \"what they were\" is understood in the light of (1.) their desires or\nloves and (2.) their deeds, which enacted those desires. Comment and discuss with reference to several\nexamples in the poem.\nIf, as we just said, the characters are condemned to be eternally what they were or had become in life as\nthat \"what they were\" is understood in the light of their desires or loves and their deeds, which enacted\nthose desires, then\n(a) the characters in Hell may be understood as an instance of Aristotle's maxim that character is\ndefined and determined by action quite as much as the reverse, and that after a time, it is too late to\n\nchange--one has become what one is for good. (Cf Nic. Ethics, Bk III, ch. v.) Perhaps in Dante's view\nAristotle, who lived before the redemptive acts of Jesus, gave an account of the representation of what\nthings are like when the possibility of radical change and salvation was not understood or did not yet\nexist.\n(b) perhaps Dante, passing among the damned, sometimes responds to them in ways that shows\nthe possibility that he might share their fate. Dante's interaction with the dead is most evident in Cantos\nV, X, XIII, XV, XVI, XXXII, and XXXIII.\nComment on either (a) or (b)\nThe Inferno suffers from an excess of beginnings. There is the prologue, there is the Ante-Inferno, there\nis Limbo, there is Dante's encounter with Francesca (who most clearly represents amore or love gone\nastray), there is the drama of the entry into the city of Dis, or Hell proper, when the journey moves from\nsins of incontinence to those of violence and fraud. Comment.\nWe have noted that the three main divisions in HellCthe incontinent, the violent, the fraudulent follows\nAristotle=s division (to some extent at least) between incontinence, viciousness, and bestiality, as outlined\nin the Ethics, VII, i. How do the punishments differ in these sections? What is the significance of the\nWall of Dis, which divides Hell proper from the realm of the incontinent and the suburbs of Those who\nStood for Nothing and the virtuous pagans?\nTake any three passages and discuss the nature of the eternal condition or punishment of those there,\ncommenting on the presentation in any way appropriate. Choices to consider: the virtuous pagans,\nFrancesca and Paolo (the adulterers), Farrinate and Cavalcante (the heretics), Ser Brunetto Latini (Dante=s\nold teacher), Ulysses and Diomedes (the false counselors), Ugolino (who was walled up with his sons and\nstarved to death).\nAs the protagonist of a comedy, which always grants special dispensation from harm and evil, Dante\ncannot be hurt by what he sees. Or can he? Anyway, he has Virgil to protect him. Or does he actually\nhave to protect himself? And he is changed by what he sees--at the end of the poem, he participates fully\nin the judgement of the wicked (Ugolino), even though the tale told by the sinner is worthy of more pity\nthan any other we have heard (and we hear nothing else about this sinner except his terrible suffering at\nthe end of his life). Comment.\nIn a passage in St Matthew (referred to in class but not in our readings), Jesus says to a young man who is\nwealthy: AIt is harder for a rich man to enter heaven than for a camel to pass through they eye of a needle.\nAfter hearing Jesus say this, the disciplines ask, \"Who then can be saved (if not the rich)?\" What is the\npoint of this response? Fidel Castro, while visiting the USA a few years ago (he was admitted in order to\ngive an address at the United Nations) referred to Jesus as a \"revolutionary\". How revolutionary are the\nteachings of Jesus in St. Matthew? Compare the view of mankind implied by the Sermon on the Mount\nand what is demanded of it (\"Be ye perfect . . . \") with the view of Plato or of Hobbes.\nMachiavelli has often been accused of inconsistency. For example, he says (ch. XV) that a prince\nshouldn't worry if he incurs a bad reputation for those vices--breaches of faith, miserliness, etc--without\nwhich he might lose the state and yet he insists that the prince must always strive to appear to possess\ncertain virtues, above all that of being religiously minded. Is there a contradiction here?\nMachiavelli says that people will believe someone who is known often to break his word because (a) you\ncan always give good reasons for breaking your word; (b) people are \"so ready to obey present\nnecessities\" that they allow themselves to be deceived. What is meant by \"present necessities\"? (Don't\njust say; give reasons for your interpretation, in the light of your understanding of the text.) Is the notion\nof \"allowing yourself to be deceived\" a coherent notion? Explain, and in doing so, elucidate what\nMachiavelli had in mind in the light of his whole argument.\n\nWhy do people need the illusion, if not the reality, of the five qualities the appearance of which\nMachiavelli says that the prince must cultivate: mercy, sincerity (keeping your word), humanity\n(compassionate), forthrightness (without a hidden agenda), religiosity? (NB: the qualities differ slightly,\ndepending upon what translation you read.) Machiavelli does not give reasons but he comments often\nupon \"what most people are like\". Do any of these comments explain the matter? Machiavelli did not\npublish this text but circulated it in a semi-public way, and there is ample indication that he meant it for\npublication. If the prince is supposed to cultivate the illusion of possessing these qualities, doesn't\nblabbing the need for this rather give the game away?\nMachiavelli's adage, \"The ends justify the means,\" is justly famous, although he evidently did not say this\n(or its Italian equivalent) precisely. What he did say was rather that the actions of all men, and especially\nthe actions of princes, are judged by results. He didn't, in other words, say that when actions are judged\nto be good or bad by their results that the judgement is ethically valid. But why not? If means are both\ninstrumental and necessary for a good end aren't they, therefore, good?\nWhat does it mean to advise a chief executive that he must \"learn how not to be good\"? In what way is\n\"learning\" involved? Machiavelli advises the ruler to be both beast and human being. Is this like wearing\ntwo hats, one for the office and another for home? Can you put on and take off the hat of a beast at will?\nCompare the character of Brutus, Julius Caesar, with that of the ideal prince in Machiavelli.\nWhat does it mean to advise a chief executive that he must \"learn how not to be good\"? In what way is\n\"learning\" involved? Machiavelli advises the ruler to be both beast and human being. Is this like wearing\ntwo hats, one for the office and another for home? Can you put on and take off the hat of a beast at will?\nCompare the character of Brutus, Julius Caesar, with that of the ideal prince in Machiavelli.\nAntony says of the conspirator that they are all \"honorable men\"? What is honor in this play? To what\nsource of authority do the conspirators appeal? Is the conspiracy justified? In what respect are Brutus\nand Cassius similar? What are the major differences between them? Which of the two is more dangerous\nto established authority?\nIn one sense, three of the people involved--Brutus, Cassius, and Caesar--are forever living up to an ideal\nof themselves. Antony, in contrast, seems to throw ideals to the winds in his passion for revenge. What\nideals of themselves have Cassius and Caesar? Does the play endorse the notion of \"living up to an ideal\nof yourself\"? Is someone who lives up to an ideal of oneself simply a person who has swallowed his or\nher own public relations brochure?\nWhat advice would Machiavelli give to any of the four major characters in Julius Caesar? What do you\nthink that he would take of the conspiracy as Shakespeare presents it?\nSuppose Hobbes were to read Julius Caesar. (He might have done--I just don't know.) What view do\nyou think he would have taken of Brutus? Of Caesar? Suppose that Brutus or Caesar could have read\nHobbes. (Rather unlikely.) What would they have thought of his view of human nature. (Don't give\noversimple, obvious answers--e.g., Caesar was in favor of absolute sovereignty and therefore would have\nliked Hobbes--unless you can imagine how someone would object to the way in which you support your\nanswer.)\n\nApply Lord Acton's famous dictum--\"All power tends to corrupt and absolute power tends to\ncorrupt absolutely\"--in any fashion that you please to Julius Caesar.\nHobbes says that perhaps \"there never was such a time\" as the time that mankind lived in a state\nof nature (although \"savage people in many places of America\" come close) but that (1) we can\nsee what kind of life this would be in civil war and also (2) in conflicts between nations. The\n\"state of nature,\" then, isn't a historical concept; it does not refer to a historical time, in Hobbes\nview. What sort of concept is it? Hobbes writes of the natural condition of mankind (p. 715.)\nthat it is a state war of \"of every man against every man\" in which \"nothing can be unjust. The\nnotions of right and wrong, justice and injustice have there no place\". Is Hobbes correct about the\nabsence of right and wrong in war? If the state of nature has no historical location, where is\n\"there\" in the sentence just quoted?\n\"Of all voluntary acts, the object is to every man his own good,\" writes Hobbes (Chapter 15, in\nthe paragraph on gratitude, and also where he says that charity and benevolence has as its end\nsimply a relief from the uneasiness at witnesses the sufferings of others), and this holds for the\nexercise of all the virtues, that are possible only in the civilized state (which Hobbes calls the\n\"civic state). The difference between the natural condition and the civilized condition makes no\ndifference to the essentially self-interested nature of all human activity, in Hobbes's view. How is\nthis view central to Hobbes's argument?\nHobbes believes that all injustice is absurd--a form of self-contradiction, like affirming and\ndenying the same proposition. How central is this belief to his view, as you understand it?\nGlaucon, near the outset of Plato=s Republic, presents an argument (just before he talks about the\nring of Gyges) which sounds much like Hobbes=s argument. Socrates ultimately disagrees with\nGlaucon=s position. Compare Hobbes with either Glaucon=s notion or with Socrates=s in any way\nthat seems useful for understanding Hobbes.\nCompare and/or Hobbes with Aristotle in any way that seems interesting."
    },
    {
      "category": "Assignment",
      "title": "paperassignment3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/5c6138ae3f16d5d830c98f8e1dca9273_paperassignment3.pdf",
      "content": "PAPER ASSIGNMENTS\nLITERATURE AND ETHICAL VALUES\nTHIRD PAPER ASSIGNMENT\nDue by Lecture #26\nPapers should be TEN pages in length, double-spaced, or the equivalent. (Figure 350\nwords/page.) You may write on any subject that occurs to you concerning the texts read during the LAST\nthird of the term (from Ibsen onwards), although you may also write about materials drawn from our\nearlier readings, as well; the point is that at least half your attention should be directed towards the latter\nmaterials. The following list is offered by way of sample topics; you may choose one of them but need\nnot do so.\nSUGGESTED TOPICS\nJustify or condemn Captain Vere in his treatment of Billy. Why does he convene a court-martial\ninstead of holding Billy for judgement ashore or pronouncing judgement himself? And having convened\nthe court-martial, why does he intervene? Depending on your view of Vere, and given Billy=s dog-like\ndevotion to him, his apparent insistence on making Billy (in the post-trial interview about which the\nnarrator refuses to supply details) complicit in his own execution may look like an act of utter barbarity--a\nway of trying to ensure that Billy will not say anything during the ceremony of execution that might stir\nup trouble with the crew. Compare Vere with the narrator of AThe Secret Sharer@, who also has what\nmight look like a murderer on his hands. Do the stories each embody a very different viewpoint from the\nother or are they compatible in their viewpoints, given the difference in circumstances.\nBilly Budd has often been likened to Antigone as a representation of the fallibility of authority.\nDiscuss in any way that seems useful to a comparison of the two texts. Again, the narrative compares\nVere to Abraham and Billy to Isaac. Is the comparison justified?\nSuppose that it is wrong for anyone in a position of authority within an organization to damage an\ninnocent person in order to prevent a severe risk to the many careers and fortunes that depend upon it.\n(This, abstractly put, is one way of condemning Captain Vere.) In a utilitarian ethic, this supposition\nwould give more weight to the damage of an innocent person than to the potential for damage to the\norganization as a whole. Should one be ethically required, then, to act upon this weighting and risk\ndamage to an organization upon which many lives and fortunes depend in order to prevent damage to an\ninnocent person? (This is a puzzle that arises when one wants to condemn Vere and also condemn the\nnameless narrator of \"The Secret Sharer\", whose final action is to risk the ship and its company \"as a\nmatter of conscience\" to save what he believes is an innocent man.)\nThose in authority seek to justify their actions by appeal to principles; what looks like an\nunethical or immoral action is justified by looking at \"the larger picture\". But Vere argues for a\nresponsibility set against the claims of natural conscience, religious scruple, and the feelings of pity and\nsympathy--all of which must be put aside. He does not justifyBrather, he insists upon involving the\nmembers of the court-martial in knowing complicity in a guilty deed, leaving the ultimate decision to\nthem. (The text is ambiguous on how far his subordinates go along with his point of view, suggesting that\nthey act rather out of a sense of fear or expediency.) In the text, it is Claggart who acts self-righteously,\nsquaring what he does with principle out of the worst motives in the world, whereas Vere seems to know\nthat what he is urging the court-martial to do is wrong but necessary. Discuss.\nThe narrative offers three consecutive endings to the story, chapters 28, 29 and 30, any one of\nwhich could have concluded the story by itself. What is the point of this device?\nCompare the narrative=s view of Nelson with its implied view of Vere. Which is the better\nleader? At the end of chapter 21, the narrative draws a distinction between the viewpoint of those in\n\nauthority during emergencies and those under authority or protected by it. What are the ethical\nimplications of this distinction? Are they legitimate considerations in judging those in authority?\nIt could be said that Hobbes and Kant see ethics in similar terms, since each thinks in terms of\nlaws that people can agree are reasonable. Describe the two theories and indicate the extent to which you\nthink that they agree and disagree about the nature of morality.\nKant would not have recognized Aristotelian ethics as a system of morality, because Aristotle\nbelieved that human life was ethically fulfilled by the pursuit of happiness or well-being. Kant severed\nthe tie between morality and the pursuit of happiness because he believed that we all desire different\nthings and morality could not be binding on an agent by virtue of what makes him or her different from\nother agents, namely, the desires that he or she just happens to have. The agent might have lacked those\ndesires and had quite different ones, and, Kant argued, it is intolerable that an agent should be bound to\nmorality by something contingent. Morality should bind an agent solely insofar as he or she is rational;\nthus morality, for Kant, should be constituted by the formal laws of rationality alone. Elaborate the\ncontrast between Aristotle and Kant in this connection.\nOne way (there are many) to describe Kant=s view is to say that he does not think that you can\njustify an ethical maxim, for example, ANever tell a lie@, but you can show that you cannot consistently\nwill its contrary, ALie whenever it suits you.@ The justification depends upon accepting the premise that\nmaxims of ethical conduct are universalBthat is, they are addressed not to whoever you happen to be by\nvirtue of natural advantages, social position, lineage, or the appetites and aversions that you happen to\npossess, but simply to you in your capacity as a rational agent, which is to say that they apply to just\nanybody. Discuss.\nKant offers two different formulations of the Categorical ImperativeCone that tests whether it\nmakes sense to to express the maxim upon which the agent will act as a universal law, the other that\nenjoins an agent to treat other rational beings never just as a means but always also as an end. Explain\nthese two formulations and say something about the connection between them. Some philosophers have\ntried to discredit the first formulation by pointing out that it justifies trivialities (AEveryone must always\nwrite with a felt-tipped pen@) or immoralities (AAlways persecute those who hold religious beliefs\ndifferent from your own@) or numerical qualifications (ANever tell more than twelve lies a year@).\nComment.\nCompare the different ways that Aristotle and Mill understand human happiness or well-being in\na way that illuminates either or both.\nThe happiness principle as Mill expounds it at the opening of chapter 2 in Utilitarianism relies on\nthe idea that end (or aim) of all action are either an increase in pleasure or a decrease in pain, both of\nwhich Mill chooses to regard as an increase in pleasure. Is this as obvious a point as it looks? If you\nmake the aim of every action pleasure, then pleasure loses its content as a characterization of the aim of\nactionCto say that one is acting for the sake of pleasure comes to mean that one is actingCperiod. The\nidea is, of course, to characterize the aim by quantity, rather than quality. One then tends to lose sight of\nqualitative differences in the motives, say, of the honest tradesman who believes in an ethic of business\nand the honest tradesman who believes in the utility of a reputation for honesty. (Kant=s example.) What\nis gained and what is lost by reducing all deliberate action to action done for the sake of pleasure?\nCompare Kant and Mill in any way that illuminates the character of each. You might refer here\nto Mill=s criticism of Kant (near the end of Chapter 5), in which he argues that Kant=s categorical\nimperative is either a misleading form of utilitarianism or else it Auses words without a meaning.@ Is his\nview correct here? In this context, too, you might want to consider Mill=s concluding remarks about\njustice (next to last paragraph of the essay), where he allows that you might have good reason to kidnap a\ndoctor and force the doctor=s attendance on a patient. (Would he say the same about an unwilling kidney-\n\ndonor?) Because the rules of justice are so important, he argues, it is a good idea to think of them as\nAindefeasible@Bi.e., never being modified by virtue of the fact that extraordinary circumstances sometimes\nforce us to violate themBand so it is a good idea to speak of kidnapping in such circumstances as just,\nrather than as exceptions to the rules of justice. Suppose we applied what Mill calls this Auseful\naccommodation of language@ to the Kantian false promise and say that it isn=t really failing to keep your\nword when it turns out that keeping your word will produce more harm than good. How would Kant\nregard such a proposition?\nIn comparing Kant and Mill, consider that Kant offers a Adecision procedure@, a way of\ndetermining whether any proposed course of action is right or wrong, whereas Mill offer a Aresolution\nprocedure@, a way of deciding between alternative courses of action when there seems to be good reasons\nsupporting both of them.\nAnd, of course, there is the major point of comparison. One recalls the passage in St Matthew,\nwhen the rich man came to Jesus, who advised him to give all he had to the poor, because it was harder\nfor a rich man to enter heaven than for a camel to pass through the eye of a needle. The disciples were\nscandalized by this and said: AWho then can be saved?@ because they thought that money represented\npower and power had to be exerted for good if one was to be saved. The issue is reflected in the\ncontrasting attitudes of Mill and Kant. Mill holds that being ethical means making the world a better\nplace, increasing its available supply of happiness, whereas Kant begins (the third through the sixth\nparagraphs of our readings) with a denial that making the world happier has anything to do with ethics.\nComment.\nMill argues that Ahappiness is a good, that each person=s happiness is a good to that person, and\nthe general happiness, therefore, a good to the aggregate of all persons@. (Opening paragraph of ch. 4.)\nThe aim of ethical conduct in his view is to promote the aggregate good, sometimes at the expense of\none=s own good but never vice-versa. How does he answer the question posed by an imaginary reader\n(Opening paragraph of ch. 3.): AIf my own happiness lies in something else [i.e., something other than the\ngeneral good], why may I not give that the preference?@\nAt one point in his exposition (near the outset of ch. 2), Mill tries to rescue utilitarianism from the\ncharge that it offers a degrading view of both humanity and ethics by taking the aim of ethical behavior to\nbe nothing more than trying to maximize pleasure or happiness. In the course of this he insists upon the\nexistence of different kinds of pleasure or happiness and different sorts of people that go with them.\nABetter to be a human being than a pig satisfied; better to be Socrates dissatisfied than a fool satisfied.@\nHow does this view agree with his later insistence on taking an impartial view when it comes to\nconsidering whose happiness is in question or, even more strikingly, (fourth paragraph from the end of the\nexcerpts) with his putting as the central principle of utilitarianism that Aequal amounts of happiness are\nequally desirable, whether felt by the same or by different persons@?\nExplain how Mill accounts for the fact that people value and desire virtue for its own sake, and\nnot for the sake of increasing the world=s complement of happiness. At one point, Mill observes that\npeople often have a strong regard for particular virtues or certain principles (mostly of the form AThou\nshalt not . . .), whether or not they produce happiness, and that it might diminish the hold that these\nvirtues or principles have on them to argue that their regard for virtue really derives from some larger,\nabstract principle, like maximizing the world=s happiness. Why resort to a general principle then? Again:\nMill thinks that the mind is not in Aa right state@ if it doesn=t value and desire virtue (or living by virtuous\nprinciples) for itself, that is, even if virtue doesn=t produce desirable consequences now and again, and yet\nhe also thinks that Athere is in reality nothing desired except happiness@, even though it appears otherwise\nto many people. Is he contradicting himself here?\nContinuing in this vein: The idea of a general progress of mankind is appropriated by Mill to his\nposition; he sees the advance of knowledge and the increase of democratic institutions making it steadily\n\nless necessary to sacrifice individual happiness for the happiness of others. At the same time, he is very\nconcerned to leave space for the notion that even in a perfect world, Aparadoxical as the assertion may be,\nthe conscious ability to do without happiness gives the best prospect of realizing such happiness as is\nattainable [not just for the aggregate of all humanity but for the individual who is sacrificing some of his\nor her interests for the sake of others].@ (P. 3) In other words, you are always better equipped for\nhappiness if you can do without happiness, because this enables you to face up to the accidents of life\n(including the misfortune of being mortal). Is there a contradiction here? What does the argument do to\nthe notion that progress is a good thing and worth working for?\nMany characters in Crime and Punishment hold views that are not dissimilar to Mill=s. They\nbelieve that actions can be justified by social utility, that most peopleBmost ordinary peopleBhold to\nmoral principles just by way of Aprejudice@ (akin to Mill=s Ahabit@, which conditions ethical response) and\ndo not see clearly the way in which so-called moral principles have to be ignored in order to produce a\nbetter world. What would Mill have to say about Luzhin=s theories about the virtues of self-interest?\nWhat would he think of Raskolnikov=s inspiration for murder?\nDiscuss the dreams in Crime and Punishment. (There are five of them, but you needn't discuss all\nfive.) How do they relate to the central themes of the book?\nAnalyze any three passages from Crime and Punishment, showing how they are symptomatic of\nthe concerns of the text as a whole. (The paper length should calculate without including the space\noccupied by extensive quotation of passages from the novel.) For example, the long initial speech of\nMarmaladov, the encounter between Raskolnikov and a prostitute, in which he speaks of \"a square yard\nof space\", and the account that Svigdrigailov gives of his relationship with a young girl, whom he is\nthinking of making his fiancee.\nIn his interview with Sonia in the latter part of the book, Raskolnikov offers several notions of the\nreasons that he had for killing the pawnbroker. Do they add up? What are his motives for Raskolnikov's\ncrime? How clear is Raskolnikov about his reasons for committing the deed?\nRaskolnikov identifies Sonia with himself as someone who has committed a crime for no reason.\nExplain. Svigdrigailov identifies Raskolnikov with himself, although he doesn't explain why. How\nsimilar are they?\nAt the outset of the story, the hero/narrator (he has no name) of The Secret Sharer is, for the first\ntime in his life, in Aa position of the fullest responsibility@. How should one understand that phrase in the\ncontext of the story? He draws a distinction between himself and the crew: Athey had simply to be equal\nto their tasks, but I wondered how far I should turn out faithful to that ideal conception of one=s own\npersonality every man sets up for himself secretly.@ Is there a contradiction here? The others do not have\nto measure up to an ideal, and yet we are told that everyone (ignore the sexism of Aman@) sets up a secret\nideal self. Further: does Leggatt represent an ideal self? After all, he has killed someone under his\ncommand, a person whom he describes as one of the sort of Amiserable devils who have no business to\nlive at all.\nThe captain of the Sephora, whose name is Archbold, speaks of himself as Arepresenting the Law@\nand wants to turn Leggatt over to the Law for judgment. The narrator does not think of himself as\nArepresenting the Law@ and does not wish to turn Leggatt over to the authorities. He harbors a fugitive\nand in the end risks his ship and the lives of his crew in order to give Leggatt his best chance at reaching\nshore without drowning. This, he says, Awas a matter of conscience.@ Conscience, then, is above the\nLaw? Comment.\nLeggatt says that neither a parson (his father) nor a man in a wig and twelve tradesmen would be\ncapable of judging his actions. The assumption is that only someone with similar responsibilities of\noffice is capable of understanding his situation. The reader, however, is not a ship's officer and is more\n\nthan likely to be either someone in business (i.e., a tradesman) or else someone who would think\nthatCpersonal insufficiencies to one sideCa religious vocation ought to enable one to understand guilt and\nexoneration. What is implied by Leggatt's claim? Why are we supposed to understand, as the narrator is\nexpected to understand, what others are allegedly not capable of understanding? Is Leggatt seeking\nexoneration? Why does the narrator regard it as a weakness that he is at first unwilling to let Leggatt\nswim for shore since the swim and the subsequent marooning (if he survives the swim) will put Leggatt in\nperil of his life?\nThe major critical issue haunting this story derives from the fact that Leggatt, although not\nresembling the narrator much, is nevertheless looked upon by him as a second self, so that his attention is\ndivided; the narrator seems to himself as if he is in two places at onceBabove deck in charge of the crew\nand confined to his cabin and dressed in a Asleeping suit@Ci.e., pyjamas. In consequence, some critics\nhave argued that Leggatt represents an unconscious or latent element in the narrator=s character, and\nopinion is divided as to whether Leggatt represents an ideal side (as the remark about an ideal self might\nindicate) or a violent, daimonic self, which the narrator must exorcize if he is to be able to assume\ncommand of the ship. Why does the story emphasize the \"doubleness\" of the narrator and Leggatt? If\nLeggatt, in addition to being a seaman, is also a symbolic figure, does he stand for something higher or\nnobler than the morality of Archbold or something \"lower\", as his association with dream, sleeping-suit,\nprison garb, and the unconscious would imply?\nExamine any details of the narrative and show their relevance to the underlying theme of the\nstory: e.g., the long opening paragraph of description, the import of the floating hat at the end, the sense\nof Leggatt that he is like Cain, the notion that Leggatt at the end is Aa free man@, the distinction that\nLeggatt draws between drowning himself (i.e., committing suicide deliberately) and just swimming into\nthe imensity of the Gulf until he drops from exhaustion.\nDiscuss the main themes of Major Barbara as you see them. Undershaft says that religion is the\nonly interesting subject for intelligent people. Lady Britomart says that it is not a proper subject for\ndiscussion. What does each mean by this? What does Undershaft mean when he says that his religion is\nbeing a millionaire? Or, to put it another way, both Undershaft and Barbara believe in the need for\nsalvation, but each has a different notion about what one has to be saved from.\nUndershaft says that each person has his own true morality--that one person's meat is another's\nperson's poison morally as well as physically. Lomax simply agrees, as if everyone knows this, but\nStephen objects--there is, he says, only one true morality and anyone who believes otherwise is a\nscoundrel. Who is right, in the view of the play? How does this issue reflect the concerns of the play as a\nwhole?\nUndershaft rejects the values of Christianity--poverty, humility, and turning the other cheek. A\nparticular Christian value, dramatized in the figure of Bill Walker, is \"forgiveness\"; Bill Walker is quite\nclear that he does not want to be forgiven for bashing little Jennie Hill. AWhat I done, I=ll pay for,@ he\nsays. Undershaft calls forgiveness \"the beggar's refuge.\" Elucidate the play's view of forgiveness. What\ndoes Barbara want from Bill Walker? What do you think of the notion that forgiveness is a major value?\nUndershaft makes armaments--weapons. This catches a metaphor that runs deep in the Western\ntradition, as when we say that truth is our best weapon. Why do we need weapons? That is to ask, what\njustifies the metaphor? Shaw wrote this play before it became clear that weapons of mass destruction\nwould be normally used in warfare against civilian personnel; he still believed that they would be used\nagainst other military forces, who were also armed to the teeth and prepared to use their weapons. This\nfact apart, why is it appropriate to the play's concerns that he is a manufacturer of weapons? Why not a\nmanufacturer of tooth paste? Or (like Bodger) a manufacturer of something else that might be regarded\nas evil, like whiskey or tobacco? Would that do as well?\n\nCusins nicknames Undershaft \"Machiavelli\". Why? Lady Britomart says that she couldn't bear\nthe fact that he practiced morality while preaching immorality. What she means is also put by saying that\nhe always gives a bad reason for doing something good--as when he insists that his charitable\ncontribution to the Salvation Army remain anonymous. Practicing morality while preaching immorality\nsounds the dead opposite of Machiavelli's advice to the Prince. Discuss.\nDiscuss the community of the Shortley farm in Flannery O=Connor=s AThe Displaced Person@.\nWhy do they conspire at the death of Mr Guizac. Do they actually kill him or just let it happen? What is\nthe nature of this difference? How does the story illustrate the Parable of the Cave in Plato=s Republic?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/939f129ae69def526fcf56be41667052_lec2.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture #2 - Sophocles, Antigone\nAncient Greek drama took for its materials stories of a sacred character whose overall outline and\noutcome was already familiar to the audience. Each play, however, offered a version, inventing\ndetails of character and plot. The play was originally performed to music as part of an annual\nreligious festival sacred to the worship of the god Dionysus. In this connection, we should note a\nfeature that results from the conventions of representation and performance. The chorus sings\nand dances; the intervening moments of action in play consists of dialogue sung in recitativo,\nrather like grand opera today. Accordingly, set speeches have something of the character of arias\nin grand opera: we should not look to them for the realistic exchange that characterizes actual\nconversation but rather for the kind of exchange that characterizes performance of a ritualBthe\nsort of speech, for example, that is exchanged when recipients for medals of honor are presented\nto the dignitary who has been authorized to award them. To take a representative instance: mid-\nway in the Oedipus Rex, Oedipus turns to his wife Jocasta and tells her about the details of his\nhistory relevant to the present situation. (AMy father was the king of Corinth . . .@) We should\nnot suppose that it is important to worry why he has never told her these things during all their\nyears of marriage. The speech is, of course, addressed to his wife, but its real target is the\naudience, who is completely familiar with the myth and knows how the story will come out\noverall, but needs to be informed about the play=s Atake@ on the events preceding the actionBthe\nway in which the play understands the predicament of the hero and the details of the history\nleading up to it.\nThe subject of this play is represented in the text by the Greek word philia, whose root appears in\nsuch words as \"philosophy\" and \"Philadelphia\". Most texts translate it as \"love\", and so \"love\"\nfigures prominently in your translation of the Antigone. (Thus \"philosophy\" is supposed to mean\n\"love of wisdom\", since \"sophia\" means wisdom; and Philadelphia was named in honor of\n\"brotherly love\".) But \"philia\" does not have a direct English equivalent; it means the deepest\nand most important bonds that tie you to another person or group of persons. The English word\n\"loyal\" derives from the Latin \"ligare\", which meant \"to bond, to tie down\", and Creon is talking\nabout \"philien\" when he talks about loyalty (or allegiance).\nThe background of the play is this: Some time after Oedipus was banished from Thebes, his two\nsons, Eteocles and Polyneices, quarreled over the rightful succession. The kingship went to\nEteocles, rightfully; Polyneices fled to Argos, the traditional enemy of Thebes, and returned with\nseven armies, each of which attacked Thebes at one of its seven gates. The battle took place in\ndarkness; the play begins with dawn, when it is discovered that at six gates, the enemy was\ndefeated and the enemy general killed. At the seventh gate the enemy general, Polyneices, was\nalso killed, but so was the Theban general, Eteocles. As the nearest male kin, their uncle, Creon,\nis now king of victorious Thebes."
    },
    {
      "category": "Lecture Notes",
      "title": "lec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/716de6ad833349344c36332a7319a346_lec3.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture #3 - Plato, The Republic\nPlato's dialogue, The Republic, dates from his middle years and was probably written about 365\nBC. It is a lengthy work, of striking originality and awesomely rich in themes. Its central\ninterlocutor and narrator is Socrates, Plato's mentor, who was executed by the Athenian citizenry\nin 399 BC, ostensibly for impiety but actually for practicing a free and open inquiry among his\npeers and stirring the youth of his day to doubt the virtues of traditional thinking. The participants\nof the dialogue include two of Plato's brothers and other leading citizens known to Plato's\naudience, most of whom, in one way or another, had subsequently come to untimely ends, often\nat each other's hands during the course of civil conflict. The subject of the dialogue is\nDikaiosyne, a word usually translated as \"justice\", but its meaning is less legal than ethical and\nrefers to what is proper and fitting in dealing with one's fellow human beings--what you owe\nthem if you wish to act ethically. The word is sometimes translated as \"righteousness\"."
    },
    {
      "category": "Lecture Notes",
      "title": "lec11machiavelli.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/84b5866e93b4f073fe0d4bfd637a49b0_lec11machiavelli.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture #11 - Machiavelli, excerpt from The Prince; Shakespeare, Julius Caesar\nMachiavelli, excerpt from The Prince\nThe reading by Machiavelli concerns the distinction between the motives of an executive\nand the image that he or she must sustain. How could Brutus or Caesar have profited from this\nlesson? At one point in his text, Machiavelli says that unlike other writers addressing themselves\nto princes and talking of government, he will speak about the real world, not an imaginary or\nideal one. Yet what he speaks of is largely the need to maintain illusions. Indeed, you might sum\nup Machiavelli's teaching as follows: \"Never mind reality, the image is everything\".\nMachiavelli says that people will trust someone who breaks his or her word because (a)\none can always give good reasons for breaking one's word; (b) people are \"so ready to obey\npresent necessities\" that they allow themselves to be deceived. What is meant by \"present\nnecessities\"? Is the notion of \"allowing yourself to be deceived\" a coherent notion? \"Il Principe\"\n(Numero Uno) is presumably clear-eyed about deception and does not allow himself to be\ndeceived, not even by himself. Does anyone in Julius Caesar fulfill this characteristic of\nleadership?\nMachiavelli reserves special praise for Hannibal, whose \"inhuman cruelty, together with\nhis infinite other virtues, made him always venerated and terrible in the sight of his soldiers.\" No\ndoubt in Hannibal's day, and perhaps in Machiavelli's too, the nature of armies made fear of swift\nand terrible punishment an emotion that a commander-in-chief had to cultivate. It may seem that\nHannibal, the army commander, is not a fit model for top-level business management. But\nMachiavelli's advice was intended for rulers in times of peace as well as war and concerned the\nnature of command, which has always to deal with the image that the ruler must project if he (or\nshe--but that possibility never occurred to him) is to be effective both within the state and\nwithout. A contemporary correlative to Hannibal's image would be something like \"decisiveness\nto the point of ruthlessness\"--a lack of hesitation, a readiness to make quick decisions adversely\naffecting, perhaps to the point of total dislocation, the lives of people both without and within the\ncorporation. Is it wrongheaded to advise CEO's to adopt this model?\nMachiavelli was frequently chastised (after his death, of course) for articulating the\nmaxim that \"the ends justify the means\". What else can justify them? Is the maxim \"the ends\njustify the means\" only a cover for the notion that the real end and aim of the means is simply the\nmeans themselves, that is to say, the exercise of power? Or we might put the criticism the other\nway about. Machiavelli's adage, \"The ends justify the means,\" is justly famous, yet Machiavelli\ndoes not say simply that the means that are instrumental to a good end are just, on the contrary,\nhe says that they are often unjust, that a wise administrator \"must learn how not to be good\" Is\nthis a coherent notion? If something is justified by the good that it produces, why not speak of it\nas good?\nMachiavelli advises the ruler to be both beast and human being. Is this like wearing two\nhats, one for the office and another for home? Can you put on and take off the hat of a beast at\nwill? Machiavelli indicates pretty clearly that you must never seem to take off the religious hat--\ni.e. that the religious necessity is uncompromising and therefore you must always secretly wear\nyour princely hat under the religious one. If there is some compromise possible, for us, which\n\nwill be subordinate to which?\nWilliam Shakespeare, Julius Caesar\nMuch of the play's dialogue concerns the sense of honor, most famously, in Mark Antony's\nfuneral oration. How do you understand honor? It seems to go with the unChristian virtue of\npride - a sense of one's worth derived from your membership in a group (a family, a military unit,\na nation), which has given you something to live up to, a sense of the value of your social identity\nand of the obligations that come with it. Can one be proud of being oneself? Are you proud of\nyour ancestry? Of your parents? Of the business corporation to which you belong? Have they\ngiven you a sense of identity and of the obligations accruing to it that you try to live up to? When\nmembership in a group is not lifetime membership but a transitory thing, can it invest one with a\nsense of honor?\nJulius Caesar is a study of four distinct styles of leadership, represented by Caesar, Brutus,\nCassius and Antony. How would you describe the leadership style of each? In this connection,\nconsider as well that Julius Caesar is very much concerned with the ways in which people's sense\nof self-regard makes them liable to manipulation by others. How important is living up to an\nimage of yourself? Anthony is the man without an image of himself. He is faithful to the image\nof Caesar; otherwise he is a player, a manipulator of images. How good a leader is he? How\nimportant is the image that other people have of you? In the first exchange with Cassius, Brutus\nseems to reject the notion of living by the estimation that others have of you. Does this make him\npeculiarly independent of baser motives like ambition or peculiarly insensitive to their place in\nthe minds of others?\nThe play deliberately contrasts Caesar's genial favoritism in private life, his courtesy towards his\nfriends in private, with his unshakable resolve as public authority (Note his reply to a suitor:\n\"What touches Caesar most shall be considered last\", or his speech comparing his constancy\nwith the constancy of the north star.) If Caesar is on an ego-trip, it is not a mean-spirited ego that\nhe is serving. \"What touches Caesar most shall be considered last\", expresses a resolve that is far\nfrom Thrasymachus's tyrant, whose justice serves only his own interests. How necessary is it for\none in authority to cultivate and try to live up to an extreme image of him/herself? For his part,\nBrutus heads a conspiracy. Is conspiracy sometimes justified? In what sense not? Brutus's\nconcern is with his sense of family honorBwhat befits a Brutus. Cassius plays upon this in the\nscene in which he attempts to win Brutus over to the cause of assassination, and Mark Anthony\nmakes much of honor in his speech inciting the crowd against the conspirators. What is honor?\nHow does it work? Does it make Brutus more or less apt to lead his side to victory?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/24bed9826c4e89be0d200f41f4a5d645_lec17.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture # 17 - Immanuel Kant, The Metaphysical Foundation of Morals\nWhat does it mean to respect the capacity for impartial reason? For some, reason is\nmerely instrumental; it does not tell us what we should try to achieve but only tells us how to go\nabout it. A group of Nazis planning to execute some Jews are planning rationally. Should we\nhonor their capacity for reason? But Kant thought that reason was more than instrumental; it also\nprovided a decision-procedure for checking on the ethical validity of any course of action. By\nvirtue of reason, Kant argued, human beings do not simply act upon random impulses or fixed\ninstincts but rather lay down rules of behavior governing their conduct; abiding by the maxims\nand rules implicit in one's conduct is what \"being accountable\" means. It follows that the way to\nhonor the rational capacity of others was to act oneself according to those rules that could be\nadopted as rules of conduct by all human beings, regardless of the partiality built into their social\nidentities and their psychological make-ups. The essential question about any proposed course\naction, therefore, was not, \"How can I best go about this?\" but rather \"Is it possible for this to be\nadopted as a rule of conduct by every rational being?\" - the Kantian equivalent of the more\nfamiliar \"But suppose everybody behaved this way?\" The underlying Kantian notion is that\nmany rules of conduct seem reasonable in the light of one's circumstances and given the biases of\none's character, but they become illogical when we try to think of them as being followed\nuniversally. How good is Kant's argument? How forceful are its conclusions? Are rule-making\nand logical consistency the hallmarks of ethical conduct? Is radical impartiality the primary\nvirtue? Take the case that telling the truth about a patient's condition will act as a depressant, a\nrecovery is barely possible but the odds are heavily against it. Should a patient be told the truth\nabout his or her chances in such a case? Again, in the case that Kant examines, is it not open to\nargue that the would-be assassin has put himself or herself beyond the pale of moral\nconsideration?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec23.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/c6388e68a8aa83d551733de1312926d3_lec23.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture #17 - George Bernard Shaw, Major Barbara\nThe idea of opposing Money and Religion as rival allegiances is taken by Shaw from the\nSermon on the Mount, particularly from the notion that \"You cannot serve both God and\nMammon [the god of wealth: the phrase is often translated \"You cannot serve both God and\nMoney\".] But Shaw's play, surprisingly, opts for Money. What justifies this hard-and-fast\nopposition? Is money a form of service? Undershaft, when asked about his religion, answers, \"I\nam a millionaire. That is my religion.\" What have money and religion in common? Barbara\nlabors ceaselessly to extract donations from the poor, in order to fund the work of the Salvation\nArmy, but she rejects Bill Walker's pound note and the huge benefaction of Bodger, the whiskey-\ndistiller. What does she want from Bill? Why reject Bodger's benefaction? Is money ever dirty\nmoney? What (exactly) is wrong with working for an arms manufacturer? A distiller? A narcotics\ndealer? A manufacturer of toothpaste? Does the product really matter? If not, why not? If so, why\ndoes it make a difference? Is there a point in Shaw's making his representative of the Gospel of\nMoney a munitions-manufacturer? If so, what is it? Could the play have equally well made\nUndershaft a distiller? a manufacturer or dental floss, of tobacco products? How would you\njustify (or excuse) your managerial role in such case, or would you draw the line at some of these\nemployments?\nLady Britomart advises Stephen to accept his inheritance and then hire a manager to run it. Is this\nfoolish advice? How would you go about hiring such a manager? What is the issue about\nsuccession in the play? Why is it necessary to choose a foundlingBi.e., a bastard, to be CEO.\nHow do you hire a CEO?\nConsider Lady Britomart's view that it is all right to manufacture and market munitions, provided\nthat you sell them only to \"the right sort of people\". We have something of the same opinion\ntoday, in the insistence of our government that only certain sorts of nations have a right to nuclear\nweapons. In contrast, Undershaft will sell armaments to anyone who wishes to buy and will\narrange for generous loans for those who cannot afford it. What view of the world underlies his\npractice? Perhaps we should think of Undershaft's munitions as the symbolic equivalent of\npower, power to do good or harm, power of aggression and of defense. In this light, we might\nconsider the role of Sloan professors, who sell managerial knowledge and arrange loans for those\nwho cannot afford to buy. What would Lady Britomart think of this practice? Is the knowledge\nthat Sloan sells a form of power? Should it be available only to the right sort of people?\nFrom the Sermon on the Mount: \"Lead us not into temptation . . .\", which may also be translated\nas \"Please do not test us . . . \" and is frequently so translated. Is it a good thing to pray not to be\ntested? The passage comes from what has come to be known as \"The Lord's Prayer\", which\nalso instructs us to pray for forgiveness, so that we may be forgiven in turn. What is the power of\nforgiveness? Is there any other motive for doing it? Can the world use more forgiveness?\nCusins, in the play, rejects forgiveness. \"Forgiveness is the beggar's refuge. We must pay our\ndebts.\" Our watchword for this term is \"accountability\". Note in this connection that Barbara\ngives Bill Walker a hard time, refusing to let him pay off his offense against Jenny Hill by getting\nhis own face bashed in. What does she want of him? Explain. Is the power to forgive, forget, and\nstart anew always \"a beggar's refuge\"?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec24.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/dc246daa349a65a955971e855f2a89bc_lec24.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture #24 - George Bernard Shaw, Major Barbara\nThe idea of opposing Money and Religion as rival allegiances is taken by Shaw from the\nSermon on the Mount, particularly from the notion that \"You cannot serve both God and\nMammon [the god of wealth: the phrase is often translated \"You cannot serve both God and\nMoney\".] But Shaw's play, surprisingly, opts for Money. What justifies this hard-and-fast\nopposition? Is money a form of service? Undershaft, when asked about his religion, answers, \"I\nam a millionaire. That is my religion.\" What have money and religion in common? Barbara\nlabors ceaselessly to extract donations from the poor, in order to fund the work of the Salvation\nArmy, but she rejects Bill Walker's pound note and the huge benefaction of Bodger, the whiskey-\ndistiller. What does she want from Bill? Why reject Bodger's benefaction? Is money ever dirty\nmoney? What (exactly) is wrong with working for an arms manufacturer? A distiller? A narcotics\ndealer? A manufacturer of toothpaste? Does the product really matter? If not, why not? If so, why\ndoes it make a difference? Is there a point in Shaw's making his representative of the Gospel of\nMoney a munitions-manufacturer? If so, what is it? Could the play have equally well made\nUndershaft a distiller? a manufacturer or dental floss, of tobacco products? How would you\njustify (or excuse) your managerial role in such case, or would you draw the line at some of these\nemployments?\nLady Britomart advises Stephen to accept his inheritance and then hire a manager to run it. Is this\nfoolish advice? How would you go about hiring such a manager? What is the issue about\nsuccession in the play? Why is it necessary to choose a foundlingBi.e., a bastard, to be CEO.\nHow do you hire a CEO?\nConsider Lady Britomart's view that it is all right to manufacture and market munitions, provided\nthat you sell them only to \"the right sort of people\". We have something of the same opinion\ntoday, in the insistence of our government that only certain sorts of nations have a right to nuclear\nweapons. In contrast, Undershaft will sell armaments to anyone who wishes to buy and will\narrange for generous loans for those who cannot afford it. What view of the world underlies his\npractice? Perhaps we should think of Undershaft's munitions as the symbolic equivalent of\npower, power to do good or harm, power of aggression and of defense. In this light, we might\nconsider the role of Sloan professors, who sell managerial knowledge and arrange loans for those\nwho cannot afford to buy. What would Lady Britomart think of this practice? Is the knowledge\nthat Sloan sells a form of power? Should it be available only to the right sort of people?\nFrom the Sermon on the Mount: \"Lead us not into temptation . . .\", which may also be translated\nas \"Please do not test us . . . \" and is frequently so translated. Is it a good thing to pray not to be\ntested? The passage comes from what has come to be known as \"The Lord's Prayer\", which\nalso instructs us to pray for forgiveness, so that we may be forgiven in turn. What is the power of\nforgiveness? Is there any other motive for doing it? Can the world use more forgiveness?\nCusins, in the play, rejects forgiveness. \"Forgiveness is the beggar's refuge. We must pay our\ndebts.\" Our watchword for this term is \"accountability\". Note in this connection that Barbara\ngives Bill Walker a hard time, refusing to let him pay off his offense against Jenny Hill by getting\nhis own face bashed in. What does she want of him? Explain. Is the power to forgive, forget, and\nstart anew always \"a beggar's refuge\"?"
    },
    {
      "category": "Lecture Notes",
      "title": "lec26.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-450-literature-and-ethical-values-fall-2002/13a881fd64fb49de841aab13dca8c860_lec26.pdf",
      "content": "LITERATURE AND ETHICAL VALUES: 21L.450\nFall, 2002\nLecture # 26 - Flannery O.Connor, The Displaced Person\n\"The Displaced Person\" is about the worst sort of \"Otherness\", the kind that led to\n\"ethnic cleansing\" and to the programmatic murder of millions by the Nazi government during\nthe middle of the twentieth century. Mr Guizac, the Pole, is their symbol, an archetypal Other, but\nthe Otherness of Mr Guizac does not alone explain what is done to him, because the characters in\nthe story are united as a group not just by their fear and hatred of an outsider (Mr Guizac) but also\nby their contempt for each other.\nFlannery O'Connor was a writer with a religious agenda, and her story pointedly associates the\nfigure of Mr Guizac with the Christian figure of Jesus of Nazareth, who came to redeem mankind\nand was rejected. To many Christians, Mr Guizac will seem an unlikely image of a Savior, but\nO'Connor subscribed to an interpretation of the Jesus-story in which Jesus did not come to relieve\nmisery out of pity or kindness for the downtrodden; rather he came to shake all relationships up,\noffering a radical spiritual challenge to both the weak and the powerful."
    }
  ]
}