{
  "course_name": "Literary Interpretation: Virginia Woolf's Shakespeare",
  "course_description": "How does one writer use another writer’s work? Does it matter if one author has been dead 300 years? What difference does it make if she’s a groundbreaking twentieth-century feminist and the writer she values has come to epitomize the English literary tradition? How can a novelist borrow from plays and poems? By reading Virginia Woolf’s major novels and essays in juxtaposition with some of the Shakespeare plays that (depending on one’s interpretation) haunt, enrich, and/or shape her writing, we will try to answer these questions and raise others. Readings in literary criticism, women’s studies, and other literary texts will complement our focus on the relationship–across time, media, and gender–between Shakespeare and Woolf. As a seminar, we will work to become more astute readers of literature within its historical, artistic, and political contexts, and consider how literature both reflects and contributes to these societal frameworks. Central texts will include Shakespeare’s Othello, Antony and Cleopatra, Cymbeline, and The Winter’s Tale, and Woolf’s A Room of One’s Own, Mrs. Dalloway, Orlando, To the Lighthouse, The Waves, and Between the Acts. This subject is an advanced seminar in both the Literature and the Women’s Studies Program.",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Drama",
    "Fiction",
    "Society",
    "Women's Studies",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Drama",
    "Fiction",
    "Society",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nComplete Syllabus Handout (\nPDF\n)\n\nRequirements\n\nThis seminar will rely on lively interchange; therefore attendance and full participation are required. This means having read the novels, plays, and critical selections carefully and on time, having some specific responses to them that you can share, and being sufficiently alert to join in an animated conversation. I will ask you to give a brief (five-minute) report on a literary text pertinent to Woolf's work. You will also report on one of the critical essays, summarizing the argument and evaluating its applicability to the literary work we are studying. After I lead the discussion of\nMrs. Dalloway\n, you will help lead the discussion of one of the remaining novels; this will include preparing a list of questions to be handed out to each member of the class.\n\nA variety of written assignments will allow you to respond to our topic in different ways. Four short (2-pp.) response essays allow you to focus on a specific aspect of the works under discussion in a thoughtful way. Because they are designed to prompt substantial conversation in class, their effectiveness diminishes if they are not ready\nbefore\nwe talk. Therefore, except in very special circumstances (arranged with me), response papers will not be accepted after the assigned date. A 5-page essay will provide an opportunity for you to focus in greater depth upon a particular text and Woolf's representation of it in\nA Room of One's Own\n. A longer essay (15 pages) will allow you to reflect upon a topic of particular interest to you during the semester. All written work should be typed and double-spaced, with standard margins.\n\nI will consider each of the requirements in determining your grade. If you cannot be in class or meet a deadline because of an emergency, please speak with me (in advance, if possible); otherwise, absences and late papers will adversely affect your grade.\n\nApproximate Grading\n\nActivities\n\nPercentages\n\nClass participation\n\n25%\n\nTwo reports on an outside text and a critical essay\n\n20%\n\nClass leadership, with handout (list of discussion questions)\n\n10%\n\nFour response papers\n\n10%\n\nFive-page essay\n\n10%\n\nLonger essay (15 pages)\n\n25%\n\nI reserve the right to alter the weighting somewhat in exceptional circumstances; usually this works to your advantage. If written work is incomplete or attendance is infrequent, you will not pass the course.\n\nIn addition to welcoming your participation in class, I encourage you to discuss your ideas and your writing with me during office hours, or at other times convenient for us both.",
  "files": [
    {
      "category": "Resource",
      "title": "A and C Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-virginia-woolfs-shakespeare-spring-2001/94f5f1ca6d378a88718b4f8a22573ae9_MIT21L_701S01_aandcques.pdf",
      "content": "1) How do the Romans conceive of femininity and masculinity? What do they admire in\nmen and women?\n2) How do the Egyptians conceive of femininity and masculinity? What do they admire in\nmen and women?\n3) Do the events of the play complicate these definitions, over time? Are there contradictions\nwithin the play's language and representations which are resolved?\n4) What, if anything, can you extrapolate from the play about Shakespeare's attitudes? What\ndoes he admire in female characters? In male characters? To what extent is his judgment of\ncharacters gendered? To what extent do other factors (social status, profession, ethnicity,\nhistorical context) complicate such judgment? How do we decide?\n5) At the end of chapter three of A Room of One's Own, Woolf's narrator writes:\nthe mind of an artist, in order to achieve the prodigious effort of freeing whole and\nentire the work that is in him, must be incandescent, like Shakespeare's mind, I\nconjectured, looking at the book which lay open at Antony and Cleopatra. There\nmust be no obstacle in it, no foreign matter unconsumed.\nFor though we say that we know nothing about Shakespeare's state of mind,\neven as we say that, we are saying something about Shakespeare's state of mind....his\ngrudges and spites and antipathies are hidden from us. We are not held up by some\n'revelation' which reminds us of the writer. All desire to protest, to preach, to\nproclaim an injury, to pay off a score, to make the world the witness of some hardship\nor grievance was fired out of him and consumed. Therefore his poetry flows from\nhim free and unimpeded. If ever a human being got his work expressed completely, it\nwas Shakespeare. If ever a mind was incandescent, unimpeded....it was\nShakespeare's mind.\n(56-7)\nEarlier, she remarks, \"What was Shakespeare's state of mind, for instance, when he wrote\nLear and Antony and Cleopatra? It was certainly the state of mind most favourable to poetry\nthat there has ever existed\"(51).\nWhy do you think Woolf chooses to mention Antony and Cleopatra specifically? Now that\nyou have read the play, do you better understand the concepts here? Do you agree with her\nappraisal?\n6) In chapter five, Woolf writes\nChloe liked Olivia perhaps for the first time in literature. Cleopatra did not like\nOctavia. And how completely Antony and Cleopatra would have been altered had\nshe done so!...the whole thing is simplified, conventionalised, if one dared say it,\nabsurdly. Cleopatra's only feeling about Octavia is one of jealousy. Is she taller than\nI am? How does she do her hair? The play, perhaps, required no more. But how\n\ninteresting it would have been if the relationship between the two women had been\nmore complicated. All these relationships between women, I thought, rapidly\nrecalling the splendid gallery of fictitious women, are too simple. So much has been\nleft out, unattempted. (82)\nHow does this modify her earlier comments, and what do you think of these?\nWhen you read Mrs. Dalloway, reflect back on Woolf's comments about and use of the play\nhere (written later).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 / WGS.510J Literary Interpretation: Virginia Woolf's Shakespeare\nSpring 2001\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Checklist for Editing your Partner's Paper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-virginia-woolfs-shakespeare-spring-2001/8eef180041d9c79f754f30e7259f7f85_MIT21L_701S01_editing.pdf",
      "content": "Checklist for editing your partner's paper\nFirst, read through the paper to get a sense of its main points and arguments. Do not line-\nedit at this point.\nBegin your response by recording what you perceive to be the paper's thesis. Also state\nthe essay's two strongest arguments, insights, or uses of evidence. Finally, state the two\nparticular ways in which the paper could be revised so that it is more compelling (be they\nmatters of argument, style, or clarity). You can do this on the back, or on a separate sheet.\nQuestions to consider:\nDoes the paper have a clear focus?\nDo the particular arguments make sense?\nIs their textual evidence cited to support these arguments?\nDo the specific passages cited match the claims made?\nDo the paragraphs help organize the paper by introducing new ideas or new aspects to\nprevious arguments?\nAre ideas and paragraphs sufficiently developed and clear?\nAre the ideas presented in a logical order? Do paragraphs follow one another clearly?\nAre transitions adequate?\nIf you disagree at any point, why?\nIf you are unsure you follow or agree at any point, try to say why.\nGo back through the paper and edit it carefully, making marginal comments and circling\nor underlining particular problems of expression. Use the abbreviations I include on the\nstyle sheet (linked to the syllabus online) if you wish.\nConclude your response by giving your overall appraisal of the essay, as well any other\nspecific suggestions you think might help the author in revising it.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 / WGS.510J Literary Interpretation: Virginia Woolf's Shakespeare\nSpring 2001\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Discussion Questions for \"A Room of One's Own,\"",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-virginia-woolfs-shakespeare-spring-2001/8d534a55b098b354862a1f078045cd02_MIT21L_701S01_quest.pdf",
      "content": "DISCUSSION QUESTIONS for \"A Room of One's Own,\" chapters 1-3\n1) How does Woolf use physical spaces, and her narrator's movement through them, to\nadvance her \"argument\"?\n2) Can you describe Woolf's style of sentence writing? How do the poetic techniques of\nimagery and metaphor contribute to her essay?\n3) What is the significance of World War I in this essay?\n4) How does Woolf account for women's poverty? For the absence of women's history?\n5) What does Woolf mean by \"patriarchy\"?\n6) What is Woolf's attitude toward anger? How does this relate to her own writing style?\n7) In the questions above, I have referred to Woolf? Who is the \"I\" in her essay?\n8) What does the fictional professor add? What does the story of Judith Shakespeare add?\n9) What does she mean by \"genius\"? Why has there been no woman Shakespeare?\n10) What lines made you laugh?\n11) With which statements did you agree? Disagree? How does your own historical situation\naffect your responses?\n12) What are the fundamental changes that have taken place between Shakespeare's time and\nWoolf's? Between Woolf's and ours?\n13) Does Woolf want to be an \"insider\"? Does she want women to be \"insiders\"?\n14) How does she illustrate the connection between material conditions, sensations, and the\npsyche or subjectivity? Where does she locate the soul?\n15) What corrodes an artist's confidence? How is this gendered?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 / WGS.510J Literary Interpretation: Virginia Woolf's Shakespeare\nSpring 2001\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Mrs. Dalloway Discussion Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-virginia-woolfs-shakespeare-spring-2001/2feb9f0008dc64333cb63ed3900123ce_MIT21L_701S01_mrsd.pdf",
      "content": "Mrs. Dalloway Discussion Questions\n1) Maureen Howard asserts that \"If ever there was a work conceived in response to the state\nof the novel, a consciously 'modern' novel, it is Mrs. Dalloway...The novel, [Woolf] knew,\nhad only to be re-imagined, an enormous task, but what a grand and immediate occasion\"\n(viii). How exactly is this novel \"modern\"--consciously or unconsciously?\n2) How does Mrs. Dalloway connect--if at all--to Woolf's description of a modern woman's\nnovel in Chapter Five of A Room of One's Own? Does your experience reading it resemble\nWoolf's description of reading Mary Carmichael's Life's Adventure? What seems\ncomparable, and what differs?\n3) The Foreward cites Woolf's essay in The Common Reader: \"In the vast catastrophe of the\nEuropean war our emotions had to be broken up for us, and put at an angle from us, before\nwe could allow ourselves to feel them in poetry or fiction\" (xiii). In discussing the loss of\nromance in A Room of One's Own, Woolf asks \"Shall we lay the blame on the war?...But\nwhy say 'blame'? Why, if it was an illusion, not praise the catastrophe, whatever it was, that\ndestroyed illusion and put truth in its place?\" (15). How does World War I function in Mrs.\nDalloway? Is it a catastrophe to be blamed? Has it destroyed illusions?\n4) What is Shakespeare's role in this novel? Which plays are cited, and how? How do\ndifferent characters \"use\" Shakespeare, and what does this tell us about them?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 / WGS.510J Literary Interpretation: Virginia Woolf's Shakespeare\nSpring 2001\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Orlando",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-701-literary-interpretation-virginia-woolfs-shakespeare-spring-2001/93970ed3880af3fffaefa9b37e78a7ea_MIT21L_701S01_orlando.pdf",
      "content": "Orlando\nChapter One: Tudor: Elizabethan (1558-1603) and Stuart: Jacobean (James I: 1603-1625)\nChristopher Marlowe (1564-1593)\nWilliam Shakespeare (1564-1616)\nBen Jonson (1572-1637)\nJohn Donne (1572-1631)\nChapter Two: Stuart: Jacobean and Caroline (Charles I: 1625-1649)\nThe Commonwealth: rule by Parliament and Cromwell (1649-1660)\nStuart: The Restoration (Charles II: 1660-1685)\nSir Thomas Browne (1605-1682)\nJohn Milton (1608-1674)\nChapter Three: Stuart: The Restoration and James II (1685-88)\nGlorious Revolution (1688)\nStuart/Orange: William III (of Orange) and Mary II (1688-1701)\nJohn Dryden (1631-1700)\nChapter Four: Stuart: Mary II and Anne (1702-1714)\nHanover: George I (1714-1727), II (1727-1760), III (1760-1820)\nJoseph Addison (1672-1719)\nAlexander Pope (1688-1744)\nJonathan Swift (1667-1745)\nDr. (Samuel) Johnson (1709-1784)\nJames Boswell (1740-1795)\n\nChapter Five: Hanover: Regency and reign (1820-1830) of George IV\nKing William IV (1830-1837)\nVictoria (1837-1901)\nPercy Byshe Shelley (1792-1822)\nCharlotte Bronte (1816-1855)\nChapter Six: Hanover: Victoria (continued).\nSaxe-Coburg and Gotha/ Edwardian: Edward VII (1901-1910)\nWindsor/ Georgian: George V (1910-1936)\n\nThomas Carlyle (1795-1881)\nAlfred, Lord Tennyson (1809-1892)\nRobert Browning (1812-1889)\nChristina Rossetti (1830-1894)\nSome topics to consider further:\nAnonymity and creativity:\nLink with Room\nWomen together: 218-220\nLink with Room\nSex v. gender: 187-190, 215ff., 221, 233-6, 244-5, 310ff.\nClothes/identity\nSociety (18th-c.): 192-202\nLink with Mrs. Dalloway's party\nLink with Pope's The Rape of the Lock\nFemale veneration of men, and of artists: 206 ff., 213-14, 279\nLink with A Room of One's Own (Milton's bogey, women as mirrors)\nLiterature as a Victorian institution\nWriting as a style and sensibility: 209ff., 266-9, 312ff.\nLink with Room, the shape of a sentence\nWomen's style\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.701 / WGS.510J Literary Interpretation: Virginia Woolf's Shakespeare\nSpring 2001\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}