{
  "course_name": "MADM with Applications in Material Selection and Optimal Design",
  "course_description": "This course begins with a comparative review of conventional and advanced multiple attribute decision making (MADM) models in engineering practice. Next, a new application of particular MADM models in reliable material selection of sensitive structural components as well as a multi-criteria Taguchi optimization method is discussed. Other specific topics include dealing with uncertainties in material properties, incommensurability in decision-makers opinions for the same design, objective ways of weighting performance indices, rank stability analysis, compensations and non-compensations.\nThis course is offered during the Independent Activities Period (IAP), which is a special 4-week term at MIT that runs from the first week of January until the end of the month.",
  "topics": [
    "Business",
    "Operations Management",
    "Engineering",
    "Materials Science and Engineering",
    "Systems Engineering",
    "Systems Optimization",
    "Business",
    "Operations Management",
    "Engineering",
    "Materials Science and Engineering",
    "Systems Engineering",
    "Systems Optimization"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 4 sessions / week, 3 hours / session\n\nCourse Summary\n\nThis course begins with a comparative review of conventional and advanced multiple attribute decision making (MADM) models in engineering practice. Next, a new application of particular MADM models in reliable material selection of sensitive structural components as well as a multi-criteria Taguchi optimization method is discussed. Other specific topics include dealing with uncertainties in material properties, incommensurability in decision-makers opinions for the same design, objective ways of weighting performance indices, rank stability analysis, compensations and non-compensations.\n\nThis IAP course is open to all graduate students and researchers for registration or audition. Those who register, however, will be recognized for two credits after passing a take-home exam and conducting a project at the end of the course. The course readings are selected to strengthen students' awareness of both the theory and practice of the related areas.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nTake-home Exam\n\n60%\n\nProject\n\n40%\n\nCourse Calendar\n\nLEC #\n\nTOPICS\n\nCourse Introduction, Definitions, Multiple Attribute Decision Making (MADM) vs. Multiple Objective Decision Making/Optimization, Different Mathematical and Hierarchical Classification of MADM and MODM Models, Beam Multiobjective Optimization Examples (Pareto frontier)\n\nExamples of Weighting Techniques: Direct Assignment/Weighting from Ranks, Entropy, Eigenvector/Ratio Weighting\n\nExamples of Compensatory MADM Models: Weighted Sum Model, Weighted Product Model, Additive Utility Theory, TOPSIS\n\nExamples of Methods for Qualitative Data: Median Ranking Method, Analytical Hierarchy Process (AHP), Revised AHP, Analytical Network Processes (ANP)\n\nExamples of Non-Compensatory MADM Models: Dominance, Satisfying Methods (Subjunctive and Disjunctive), Lexicographic, Elimination by Aspects, Modified Maximin-Maximax\n\nOutranking Approach (ELECTRE I), ELECTRE III (Pseudo-Fuzzy), PROMETHEE I & II\n\nMultiple Criteria Material Selection Procedure for Multi-Materials (e.g., Composites)\n\nRecent Compensatory Approaches in Material Selection: A Novel Non-Linear Normalization and a Modified Digital Logic Method; Using Graph Theory and Matrix Approach\n\nA Revised Simos Procedure as Weighting Tool for Designers: Group Decision Making\n\nA Nonaggregative MADM Approach in Material Selection (for Ranking and Classification); Different Forms of Uncertainties; Performance Index Derivation; Rank Stability Analysis\n\nAn Application in Taguchi Design of Experiments Method: Case Study in an FEM-Based Multi-Criteria Design Optimization of a Forming Process",
  "files": [
    {
      "category": "Exam",
      "title": "Take-home exam",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-994-madm-with-applications-in-material-selection-and-optimal-design-january-iap-2007/0e1576ca3ef06fb567ce52cb9513a532_exam.pdf",
      "content": "2.994 MADM with Applications in Material Selection and Optimal Design\nIAP 2007 Graduate Course- Special Topics in Mechanical Engineering\nGrading Scheme: Take-home exam (60%), Project (40%)\nMech Eng\nTake-home exam (due Feb. 1st, 2007, 11am )\nQuestion 1 (5%): What is the fundamental difference between a comparison matrix and a\ndecision matrix in MADM? Do you think both can be useful in material selection practice?\nJustify your latter answer in a few lines.\nQuestion 2 (5%): Which similarities and differences do you notice (in general) between the\nTOPSIS and ELECTRE methods? Try to point out at least two similarities and two differences.\nQuestion 3 (10%): Briefly explain the concept of (mutual) interactions among clusters in the\nANP method. Are such interactions allowed in the AHP method? Think of a simple example in\nmechanical design with two clusters (each with one or two criteria) where you believe such\ninteractions should be accounted for in the optimization path. Present the network of your\nexample graphically (do not solve it).\nQuestion 4 (5%): Which type of rank abnormality can occur in the original AHP method? What\nrevision has been suggested in the literature to deal with this abnormality? Does the revision\ncompletely solve the problem?\nQuestion 5 (10%): In the new Ashby-based multi-criteria material selection of multi-materials,\ndoes a chosen exchange rate constant represent the actual marginal rate of substitution (slope)\nbetween the respective criteria on the Pareto frontier? Show your reasoning in a schematic\nbiobjective response space.\nQuestion 6 (25%): Consider a material selection problem for a complex 3D part which needs to\nbe designed for operation in a high-temperature oxygen-rich environment, under extreme bending\nfatigue loads. The design is not intended for mass production. The decision maker (analyst)\nconsiders 6 alternative materials and 4 factors with the data shown below1. The quantification of\nthe corrosion resistance data has been previously done using an 11-point scale. Table evaluating materials selection for 6 alternative materials and 4 factors.\n(a) Find the most suitable material using the non-compensatory MaxiMin and MaxiMax methods.\n(b) Estimate a set of weighting factors from ranks (order of importance of criteria) based on your\nown judgment; Use one of the methods suggested by Stillwell, Seaver and Edwards.\n(c) Apply the weights from the previous section and solve the problem using the compensatory\nTOPSIS method.\nAdapted from R. Venkata Rao, Materials Science and Engineering A 431 (2006) 248-255.\nTable ev\naluating materials selecti\non for 6 alte\nrnative materials and 4\nfactors.\nFigure by MIT OCW."
    }
  ]
}