{
  "course_name": "Magic, Witchcraft, and the Spirit World",
  "course_description": "Spiritual, magical, and “occult” aspects of human behavior in anthropological and historical perspective: magic, ritual curing, trance, spirit possession, sorcery, and accusations of witchcraft. Material drawn from traditional nonwestern societies, medieval and early modern Europe, and colonial and contemporary North America.",
  "topics": [
    "Humanities",
    "History",
    "Historical Methods",
    "Religion",
    "Social Science",
    "Anthropology",
    "Humanities",
    "History",
    "Historical Methods",
    "Religion",
    "Social Science",
    "Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 3 hours / session\n\nOverview\n\nThis class is concerned with the boundaries between everyday life and another order of reality, the world of spirits, powers, and mystical dangers, and with what happens when those barriers ease or break apart. Examples are drawn primarily from Europe and North America, in part to counter the assumption that belief in witchcraft and spirits is particularly associated with the non-western world. Throughout, our goal will be, not to promote or debunk belief and practice, but rather to understand them using approaches from anthropology and history, seeing them in social and political context and considering their place in people's lives.\n\nRoughly half the semester will be devoted to spirit possession and visitation, trance, and altered states of consciousness, in particular to: snake handling and trance in Appalachia; spiritualism and mediumship in 19th century America; visitations by the Virgin Mary during 1931 in northern Spain; claims of abduction by space aliens in late 20th century America.\n\nThe other half of the semester will be devoted to fears that other people are causing harm through hidden or mystical means, and the consequences of such fears, especially moral panics. The primary examples will be great European witch hunt of the 15th-17th centuries; the Salem Village witchcraft trials of 1692; fears of satanic abuse and the daycare trials of the late 20th century, we will also look much more briefly at the practice of magic.\n\nHistorical and anthropological research on these topics has grown rapidly in recent decades, changing understandings of witchcraft and spirit possession. We will be concerned not so much with coming to absolute conclusions as with learning how to analyze belief and practice; appreciating the complexity and ambiguity of the historical record; and with weighing alternative interpretations.\n\nThere is no final exam. Students will write several essays and small research assignments over the course of the semester. We will see a number of films, as a way to consider the difficulties of dramatizing and analyzing historical events on film, as well as a source of information. There will be one afternoon field trip to the town of Danvers, the original Salem Village.",
  "files": [
    {
      "category": "Resource",
      "title": "918.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-211-magic-witchcraft-and-the-spirit-world-fall-2003/6f64483185b27d70c09a4af89d5140fe_918.pdf",
      "content": "21A.211\nFirst Writing Assignment\n\nDue in class September 18\n\nWrite a short essay of two pages length (normal font and margins, double-spaced, no\nextra spaces between paragraphs) on some aspect or aspects of the snake-handling\nPentacostalist churches as we have been exposed to them in \"The Holy Ghost People\"\nand Salvation on Sand Mountain. Within the very limited space available, try to make\nyour paper a coherent essay on your chosen topic, rather than a book report. Consider\nyour sources critically. For possible topics, consult the study questions on the book and\nthe film.\n\nBe specific in your references. To cite Sand Mountain, use the following form, with\nauthor's last name, date of publication, colon, and pages, all within parenthesis:\n(Covington 1995:73-84)."
    },
    {
      "category": "Resource",
      "title": "1021.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-211-magic-witchcraft-and-the-spirit-world-fall-2003/e99f4aa861509f3e6ae94fd17ad437a3_1021.pdf",
      "content": "21A.211\n\nEssay on Spirit Possession and Visitation\n\nDue in class October 21\n\nWrite an essay about altered states and contact with the spirit world, using as your\nprimary examples the Pentacostalists from \"The Holy Ghost people\" and Salvation on\nSand Mountain; the 19th century spiritualists; and the Spanish case from Visionaries.\nYou may also use, as appropriate, the articles by Ong and Slyomovics and late 20th\ncentury channeling. You may consider some or all of the following, and/or other issues\nthat seem important.\n\n-How do the examples of spirit contact reflect or bear on the social position\n\nand circumstances of participants? What rewards or benefits do they offer\nparticipants? How, if at all, do/did they change or affect those positions and\ncircumstances?\n\n-How are possessing spirits or visitations related to the individual identities of\nparticipants?\n\n-In what ways are they concerned with issues and problems in society such as\ngender relations, marriage, morality, social class, urban/rural tensions, race, and\nclass? In what ways, overtly or covertly, do they comment on, deal with, or\nattempt to modify those problems or issues?\n\n-What does the ritual do for participants? What messages does it send? How\n\ndoes the frame of spirit contact and communication by invisible beings affect the\nmessage and its reception? How do others shape the experience and meaning of\nspirit contact? How do believers deal with opposition or skepticism?\n\nWrite 5-6 pages, typed, double-spaced (ordinary sized type, no extra spaces between\nparagraphs). Strive for a good balance between fact and interpretation. Support your\nclaims with citations from our authors. The preferred citation form is the one used in\nsocial science, in parenthesis at the end of a sentence, as in the following example: (Jones\n1923: 37-45).\n\nExtensions of a day or two possible, but they must be negotiated ahead of time."
    },
    {
      "category": "Resource",
      "title": "1104.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-211-magic-witchcraft-and-the-spirit-world-fall-2003/b632ab6333fea758af0678449f698beb_1104.pdf",
      "content": "21.211\n\nWriting Assignment\nTheories of Witch Hunts\n\nA great many theories have been advanced to explain the witch hunts in Europe and\ncolonial New England. In addition, dramatic and literary presentations of the crazes\noften suggest implicit theories, For this assignment most students will take one theory or\naccount, usually one that emphasizes a single cause or slant on the subject.\n\nSee the list of books on reserve in the course syllabus for some topics. For other topics,\nthe books you want will be on the shelves in the Humanities Library. If you can't find an\nimportant source, I may have a copy you can consult, but only as a last resort.\n\nA few students will instead take one topic and contrast two or more theories or\napproaches to that topic (see below, page four).\n\nDiscuss the theory or presentation chosen. How does it explain the witch hunt in\nquestion? What features of the craze does it play up or play down? How adequate is the\nexplanation? Be sure you communicate the main features of the explanation without\ngetting mired down in excess detail. The theories in question vary from plausible and\nsophisticated to simplistic and silly, but in all cases discuss them critically. Make\nabsolutely sure that you consider the theory in the light of the required reading for the\ncourse, especially Levack. It will be disastrous to ignore a discussion in the required\nreading relevant to your topic.\n\nTry to go to the heart of the theory, its implications, and its strengths and weakness. Do\nnot get bogged down in details, especially not in your class presentation.\n\nWrite a paper of at least three double-spaced pages. In addition, be prepared to\ngive a concise summary and critique of the theory in class.\n\nWritten assignment due November 4.\n\nFor class presentations on Europe, you must be ready by October 17\n\nFor class presentations on Salem, you must be ready by November 13\n\nFOR EUROPE\n\n1.WITCHES AS PAGAN WORSHIPPERS. Margaret Murray, The God of the\nWitches, The Witch Cult in Western Europe (paperback copies published by Oxford U.\nPress widely available) See also older editions of the Encyclopedia Britannica. See\nCohn, Europe's Inner Demons, for criticism.\n\n2. LAWYERS AS WITCH HUNTERS. Elliot Currie, \"Crimes without Criminals,\"\nLaw & Society Review 3:1, 1968, reprinted in: B. Levack, ed., Witchcraft, Magic, and\nDemonology, vol.3.\n\n3. WITCHES AS COMMUNAL CLOTH WEAVERS. Jane Schneider,\n\"Rumpelstiltskin's Bargain, \" in A.Weiner & J. Schneider eds., Cloth and Human\nExperience, chap.6 (also intro. to volume)\n\n4. WITCHES AS HALLUCINOGEN USERS. Michael Harner, Hallucinogens and\nShamanism, chap.8. See critique in Robin Briggs, Neighbors and Witches.\n\n5. WITCHCRAFT SCARES AS AN ELITE PLOT. Marvin Harris, Cows, Pigs,\nWars, and Witches, pp.207-240. Cf. H.C. Erik Midelfort, Witch hunting in southwestern\nGermany, 1562-1684\n\n6. WITCHES AS PERSECUTED HOMOSEXUALS. Arthur Evans, Witchcraft and\nthe Gay Counterculture. (I have a copy to loan.)\n\n7. WITCHES AS MIDWIVES AND CURERS. Barbara Ehrenreich & Deirdre\nEnglish, \"Witches, Midwives, and Nurses\" (Humanities Library may have copy.) Mary\nNelson, \"Why Witches were Women,\" in Women, a Feminist Perspective, Jo Freeman,\neditor. Anne Llewellyn Barstow, Witchcraze, chap. 6, \"from Healers into Witches.\" Be\nsure to see criticisms in Deborah Willis, Malevolent Nurture, p.5. See also Briggs in\nrequired reading.\n\n8. REAL SATANIC WITCHES WERE REALLY HURTING PEOPLE. The\n(supposed) Reverend Montagu Summers, any of his works. See Cohn, Europe's Inner\nDemons, for commentary.\n\n9. WITCHCRAFT, INTELLECTUALS, AND MOUNTAINS. Hugh Trevor-Roper,\nThe European Witch Craze. A classic statement on the subject. Consider especially the\nrole of intellectuals, parallels with recent events, and environmental and racial\ndeterminism. See Cohn, Europe's Inner Demons on the issue of early alpine witchcraft.\n\n10. WITCHES AS REBELS. J. Russell, Witchcraft in the Middle Ages\n\n11. WITCHES AS LOONIES, ACCUSERS AS HYSTERICS. Johann Weyer, On\nWitchcraft, esp. pp.96ff, 270-278, 289ff. Nicholas Spanos, \"Witchcraft in Histories of\nPsychiatry\"; George Rosen, \"Psychopathology in the Social process\"; R.E.Hemphill,\n\"Historical Witchcraft & Psychiatric Illness\" all reprinted in: B. Levack, ed., Witchcraft,\nMagic, and Demonology, vol. 3.\n\n12. A NOVEL OF WITCHCRAFT. Michael Kunze, Highroad to the Stake\n\n13. THE REALITY OF WITCH CULTS. Carlo Ginzburg, Ecstasies: Deciphering the\nWitches' Sabbath\n\n14. WITCHES, PAST AND PRESENT. Starhawk, The Spiral Dance, Margot Adler,\nDrawing down the Moon, and other works\n\n15. ANIMALS AS WITCHES. E.P. Evans, The Criminal Prosecution and Capital\nPunishment of Animals (I have a copy).\n\nFOR NEW ENGLAND\n\n1. WITCHCRAFT WAS REALLY BEING PRACTICED. Chadwick Hansen,\nWitchcraft at Salem. Barrett Wendell, 1892, \"Were the Salem Witches Guiltless?\"\nreprinted in: B. Levack, ed., Witchcraft, Magic, and Demonology, vol. 8, pp.267-285. See\nalso H.C.Erik Midelfort, \"Were there really witches?\" reprinted in: B. Levack, ed.,\nWitchcraft, Magic, and Demonology,vol.3.\nSee esp. Rosenthal's commentary in Salem Story.\n\n2. HALLUCINOGENIC POISONING. Linda Caporae, Science, 4/02/76, p.26; N.P.\nSpano and J. Gottlieb, Science, 12/24/76, p.1390. Mary Kilbourne Matossian, Poisons of\nthe Past\n\n3. AN EPIDEMIC OF ENCEPHALITIS. Laurie Winn Carlson, A Fever in Salem.\n\n4. EVIL GIRLS & MARTYRED CHRISTIAN WOMEN. Charles W. Upham, Salem\nWitchcraft (1867), See commentary in Rosenthal.\n\n5. THE AFFLICTED GIRLS AS HYSTERICS. Ernest Caulfield, \"Pediatric Aspects\nof the Salem Witch Tragedy\" American Journal of the Diseases of Children 65:788-802,\nreprinted in: Marc Mappen, Witches and Historians, Compare Bernard Rosenthal, Salem\nStory.\n\n6. \"WITCH HUNTS\" & McCARTHYISM. Arthur Miller, The Crucible. See also the\nvolumes of critical essays on this play.\n\n7. WITCHCRAFT AND PSYCHOANALYSIS. John Demos. Entertaining Satan,\npp.153-210.\n\n8. WITCHCRAFT AND THE LAW. David T. Konig, Law and Society in Puritan\nMassachusetts, chap.7; Peter Charles Hoffer, The Salem Witchcraft Trials: a Legal\nHistory; Rosenthal, Salem Story. (also required readings in Levack and B&N)\n\nCONTRASTING THEORIES\n\nFor the few of you who will take this option: Discuss the differences and similarities\namong the competing theories or interpretations of a single topic. Where possible,\ndiscuss the kinds of evidence the different authors consider and the ways they interpret it.\nAs with other topics, concentrate on the main points and do not get lost in the detail.\n\n1. CONFESSION IN NEW ENGLAND WITCH TRIALS. Contrast the positions of\nBoyer and Nissenbaum (pp.214-216); Bernard Rosenthal, Salem Story, pp.42-43,151-\n152, Richard Godbeer, The Devil's Dominion, pp.204-211, and Elizabeth Reis, Damned\nWomen, chap. 4.\n\n2. GENDER IN WITCH TRIALS IN ENGLAND AND NEW ENGLAND. Contrast\nthe positions of several (not all) of the following: Carol Karlsen, The Devil in the Shape\nof a Woman; John Demos, Entertaining Satan, pp.60-70, 153-165, 197-206, Briggs\n(required reading), Willis (required reading), Lyle Koehler, A Search for Power, and the\narticles in Levack, New Perspectives, v.4\n\n3. WITCHES AND SEXUALITY. Contrast the positions of Anne Llewellyn Barstow,\nWitchcraze, pp.129-145, Briggs, Witches and Neighbors (see index), Levack (see index)\n\n4. TITUBA, HER IDENTITY AND ROLE IN THE SALEM CRISIS: Maryse\nConde, Tituba, Black Witch of Salem. Rosenthal, Salem Story, pp.10-31. Chadwick\nHansen, 1974, \"The Metamorphosis of Tituba, or Why American Intellectuals Can't Tell\nan Indian Witch from a Negro,\" New England Quarterly 47(1): 3-2. Elaine Breslaw,\n1992, \"The Salem Witch from Barbados: In Search of Tituba's Roots,\" Essex Institute\nHistorical Collections v.128, pp.217-238."
    },
    {
      "category": "Resource",
      "title": "1125.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-211-magic-witchcraft-and-the-spirit-world-fall-2003/8c273333b29e9f91f4107ae4b67bdfb0_1125.pdf",
      "content": "21A.211\nEssay assignment: The Great Witch Hunt\n\nDue in Class November 25\n\nWrite an essay of not less than five double-spaced typed pages that discusses the witch\nhunt in Europe and Salem Village, bringing out some of the key issues and problems in\nour understanding. Consider similarities and differences between Salem and Europe.\nYou may also consider what we do not yet know, and how the available evidence and\ndifferent approaches affect our understanding.\n\nWrite on not less than three or more than five of the following points. You must write on\nnumbers 1 and 2.\n\n1. social conflicts and value conflicts concerned with economic change, social mobility,\ncharity, and dependence\n\n2. gender roles and accusations against women. (Do not base your answer solely on\nLevack's weak discussion of this topic.)\n\n3. images of witchcraft in learned demonology, their evolution, differences from the\nwitch fears of ordinary people and consequences in witch hunting. How demonology\nwas developed and interpreted by scholars, lawyers, and religious leaders.\n\n4. the nature of evidence and legal procedures and political controls or lack thereof over\nwitch trials\n\n5. how witchcraft fears expressed or were influenced by tensions and changes in the\nworld of the accusers\n\n6. the cycles or processes or stages that witch-hunting went through, the kinds of events\nthat set them off, and the place of resistance and skepticism\n\n7. the relative importance of elites and ordinary people, in terms of witchcraft beliefs,\npressure to prosecute witches, and the actual carrying out of witch trials\n\nIn lectures and class discussions I introduced material not found in the readings and\nwhich in a number of instances contradicts or qualifies the readings. You are responsible\nfor this class material, at least for the most important points, though not all the detail.\n\nIn your essay, precision and specificity about ideas and facts matter. Better to go back to\nyour sources (readings, class notes) than to be vague or sloppy. Cite your sources\nspecifically. You do not have to accept everything your sources say (even lectures). The\nmore you can discuss the material critically, showing original thought, the better."
    },
    {
      "category": "Resource",
      "title": "1209.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-211-magic-witchcraft-and-the-spirit-world-fall-2003/f4935241657969f4a15ab54cc8982bbe_1209.pdf",
      "content": "21.211\nFinal Writing Assignment\n\nDue in class, December 9\n\nWrite an essay of six pages length (double-spaced, normal margins and font) that\ncompares the phenomena discussed in the last section of term (recovered memory,\nmultiple personality, and fears of space alien abductions and satanic conspiracies etc.)\nwith the witch hunts in Europe and New England and the examples of spirit contact\ndiscussed in the first section of the subject. In your essay, consider no less than three and\nno more than five significant points of similarity or difference. These may include,\namong others:\n\n-the procedures by which abductions and abuse or witchcraft are discovered,\nincluding the place of special methods to discover hidden truths\n\n-the non-ordinary physical and psychological states experienced by some\nparticipants (abductees, victims, mediums, trancers, afflicted girls) in these\nevents; the way in which others involved influence and shape their experiences\nand accounts of those experiences\n\n-how claims about spirit possession do or do not resemble claims about multiple\npersonality and satanic control in terms of ideas about personal identity and\nresponsibility\n\n-the nature and role of the non-human beings, if any, with whom participants\ncome in contact\n\n-the place of gender\n\n-the role of privileged experts, both in influencing particular cases and in shaping\nthe public's understanding of what might be going on. The relationship between\nthe ideas of elites and ordinary people.\n\n-the way in which shared images, fears, hopes and scenarios originate, are shaped\nand changed, and consolidate into a relatively consistent understanding of what is\ngoing on; the role of printed books, pamphlets, sermons, magazines, newspapers\nand other mass media in shaping and developing those images and fears\n\n-the way in which individual cases are handled and the role, if any, of legal\nprocedures\n\n-the ways in which claims about dangerous conspiracies, closeness of contact with\nthe spirits world etc. indirectly express fears and preoccupations widely shared in\nsociety\n\nThis assignment lets you show incisive and creative thought about course material as well\nas your knowledge of the material itself. Favor analysis over factual exposition, and\nespecially avoid spending much space in your essay rehashing the details of the witch\ncraze or snake-handling.\n\nYou do not have to decide that the material covered in the last section of the course is\nvery like the witch craze or spirit possession---you may argue for difference rather than\nsimilarity, or a mixture of both. Some points of similarity and difference may apply more\nto one or two cases than to others. But you must argue your point cogently and back it up\nwith citations of readings and material from class."
    }
  ]
}