{
  "course_name": "Magnetic Materials",
  "course_description": "This course will cover the following topics:\n\n\nMagnetostatics\n\n\nOrigin of magnetism in materials\n\n\nMagnetic domains and domain walls\n\n\nMagnetic anisotropy\n\n\nReversible and irreversible magnetization processes\n\n\nHard and soft magnetic materials\n\n\nMagnetic recording\n\n\nSpecial topics include magnetism of thin films, surfaces and fine particles; transport in ferromagnets, magnetoresistive sensors, and amorphous magnetic materials.",
  "topics": [
    "Engineering",
    "Materials Science and Engineering",
    "Science",
    "Physics",
    "Electromagnetism",
    "Engineering",
    "Materials Science and Engineering",
    "Science",
    "Physics",
    "Electromagnetism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course is a graduate level course in magnetic materials. The level of treatment presumes familiarity with differential calculus as well as introductory atomic physics and quantum mechanics of solids. The course moves from observation to understanding of magnetic phenomena at increasing levels of sophistication. The characteristics of magnetic materials are treated in the context of related effects in other materials. For example, magnetic and electric polarization and susceptibility are treated in parallel; ferromagnetism is compared to ferroelectricity; the reasons for ferromagnetic spin alignment are contrasted with superconducting spin pairing; magnetic anisotropy and magnetostriction are compared with anisotropic electric polarization, electrostriction and piezoelectricity.\n\nReadings\n\nThe text for the course is:\n\nO'Handley, R. C.\nModern Magnetic Materials, Principles and Applications.\nNew York: John Wiley and Sons, 1999. ISBN: 9780471155669.\n\nUseful backup texts (in increasing level or treatment) include:\n\nJiles, D. C.\nIntroduction to Magnetism and Magnetic Materials\n. New York: Chapman and Hall, 1991. ISBN: 9780412386305.\n\nCullity, B.\nIntroduction to Magnetic Materials\n. Boston: Addison-Wesley, 1972. ISBN: 9780201012187.\n\nChikazumi, S.\nPhysics of Ferromagnetism\n. New York: Oxford University Press, 1997. ISBN: 9780198517764.\n\nGrades\n\nThere will be one one-hour exam about half way through the term. There is no written final examination. A written report and its oral presentation, on an appropriate topic chosen by the student, will be due at the end of the term. The grades will be determined as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nExam\n\n20%\n\nHomework Assignments\n\n20%\n\nWritten Assignment\n\n40%\n\nOral Presentation\n\n20%",
  "files": [
    {
      "category": "Resource",
      "title": "probs_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/f19e2c79482f9b12e25baa7c02f2dda2_probs_1.pdf",
      "content": "CHAPTER 1 PROBLEMS\n1.1 What is the field in the middle and at the end of a 20 cm long solenoid (2 cm in\ndiameter) uniformly wound with 200 turns of wire carrying 0.5 amperes. Give fields B\nand H in SI and cgs/emu units.\n1.2 Consider the magnetic field inside a toroid of circular cross section with inner radius\nr1 = 3 cm and outer radius r2 = 4 cm wound uniformly with 100 turns of wire\ncarrying a current of 1.0 Ampere. Calculate the field at r = 3.5 cm and plot the field\nas a function of r for 3.1 ≤ r ≤ 3.9 cm.\n1.3\n1.3 For what values of Dr = r2 - r1 and rave = (r1 + r2)/2 is the variation of the field less\nthan 10% across the inside of a toroid?\n1.4 Carry out the steps described after Fig. 1.9 to estimate the magnetic moment of a\nhydrogenic orbit in the Bohr model.\n1.5 Use Eq. 1.14 to sketch the vector components of the magnetic field along the axis,\n45o off the axis and on the plane of a current loop at a distance of twice the radius of the\nloop."
    },
    {
      "category": "Resource",
      "title": "sols_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/a0fff8ef9d088d86dad2599a07f02b52_sols_1.pdf",
      "content": "CHAPTER 1 SOLUTIONS\n1.1 B = mo NI/l\n= mo 200 x 0.5/0.2\nB = 6.3 x 10-4 T in middle. [H = 500 A/m or 6.3 Oe (cgs)]\nFor the field at the end, remove all the turns to the left of the center of the Ampere\ncircuit so that it is now centered on the end of the solenoid:\nBend = mo(N/2) I/l\nBend = 3.15 x 10-4 T. H = 250 A/m (3.15 Oe) .\nField at end = (1/2) Field at center.\n1.2 Use-- x B = moJ in the form ∫ B . dl = mo 100 I and integrate B over a circular\npath inside the toroid.\nB = 100mo/2πr for r = 3.1 cm\nB3.1 = 6.45 ¥ 10-4 T [H = 514 A/m = 6.45 Oe (cgs)]\nB3.8 = 5.13 ¥ 10-4 T. [H = 408 A/m = 5.1 Oe]\nB3.5 = 5.7 ¥ 10-4 T, etc.\n\nPlot shows B or H inside the toroid goes as r-1\nB(r) depends only on r\nand is independent of the values chosen for r1 and r2.\nNI\ndB = - m 2 p r 2 dr .\nRequire\ndB\n< 0 . 1\no\n= - r\nB\nthat is, Dr = r2- r1 should be less than 10% of rave = (r1 + r2)/2.\nE m ˆ dl ¥ r\no\nEA 4p I\n.\nr\na) From the figure at right,\nr\nr =\n+ r , dl ¥ r\nr\nc\n123 = dl\nB = p\nwith q = p/2 for dl ¥ r. The field is then given by\nm I\n2 + R\nm I\n2pR\no\no\ndl =\nB(a) = 4p\n2 + R\n2 )\n4p (a\n2 + R\n2 ) .\nThe term inside the integral is independent of l giving:\nm I\nR\no\nBz\n=\nR\n+ a\n2 .\n. Note that\n1.3 Differentiate Eq. 1.12.\ndr\n1.5 The Biot-Savart law isdB =\n3/ 2\n(a)\na\na\nU (a\n\nNote that the horizontal components of dB from around the current loop average to zero,\nwhile all the axial components add. The resultant is B = B .\nz\nb) For q = 45o, the components of dB from\n\"near\" side (smaller r) are larger. See\nfigure at right which shows a cross section\nthrough the current loop.\nb) For q = 90o, the components of dB from near side (r1) are larger than those from the\nfar side. All contributions to dB are vertical. See cross-sectional figure below."
    },
    {
      "category": "Resource",
      "title": "probs_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/da3a475aadc2d81cf17cc59ab2b3c575_probs_2.pdf",
      "content": "03/01/04\n(c)R.C. O'Handley 02/2004\n2. MAGNETOSTATICS\nProblems\n2.1 Assume that an interface, similar to that sketched in Fig. 2.7 b but with m /10 =\nm = m , is carrying a current (0, 0, J(y)) = 2J0 (y/h + 1/2) and h is not necessarily small.\na) Sketch the dependence of the current density on y. b) What are the boundary\nconditions on an H field (H (y), Hy(y), 0) across the interface. c) Sketch your result and\nx\njustify it in terms of the field generated by the current distribution. Make sure your result\nbehaves properly as h approaches zero.\n2.2. You need to make an electromagnet that produces a field of 0.6 T in a 1 cm\ngap. You use a rectangular core design (20 cm ¥ 10 cm with the gap on one of the 20 cm\nlegs). You make the core out of soft iron with μr ≈ 100. The yoke has cross sectional\narea = 10 cm .\na) If you are able to conveniently wind 600 turns of copper wire on the 20 cm leg,\nhow much current will you need to achieve B = 0.6 T in the gap. (Neglect edge effects).\nb) What is the flux density in the iron core at this current?\n2.3 Consider a permanent dipole magnet with its north pole a distance h away from\na sheet of copper. Calculate the magnetic field in the copper and sketch the field in and\nnear the copper sheet when it carries no current and when it carries a uniform current I 0\nout of the plane of the figure as sketched below.\n2.4 Describe the energy required to move a demagnetized ferromagnetic sample\nfrom negative infinity toward a permanent magnetic dipole at the origin having its north\npole pointed toward the ferromagnet. Include the effects of magnetization of the sample\nand its energy in the dipole field. Then, assuming you can hold the magnetization fixed,\nremove the magnetized sample back to negative infinity considering only its energy in\n\n03/01/04\nthe dipole field is changing. What is the energy change in this second process? How do\nthese energies relate to A1 and A ?\n2.5 Derive Eq. 2.30 by eliminating Hi from the two expressions that led to Eq. 2.16.\n2.6 Verify that Eq. 2.45 satisfies Laplace's Eq., 2.48.\n2.7 You formulate a new soft ferrite composition and want to test its low-field\nmagnetic properties. You sinter a toroid and a rod from your new proprietary\ncomposition. The figures below depict the B-H loops you observe on each.\na) What is the remanent induction in each case?\nb) What is the coercivity in each case?\nc) Approximate the effective permeability in each case for a drive field of 2 Oe.\nd) Assume B = H + 4p M ≈ 4p M and use M = c H with Eq. 2.29 to estimate the\ndemagnetization factor, N, for the rod.\ne) Use Table 2.1 to estimate the demagnetization factor of the rod-shaped sample\nwhich you measure to have an aspect ratio of 10:1.\n2.8 You need to calculate the magnetic field parallel to and outside a strip of a\npermanent magnet of length l. Assume that M is uniform inside the magnet. The strip is\nl/5 wide (perpendicular to the plane of the figure below) and l/200 thick (in the y-\ndirection, below) and you need to know the field at heights of 0.05l and 0.3l for 0 < x < l.\n\n03/01/04\nUse a three-dimensional formula (Eq. 2.45) for the field assuming that the width is\nsmall relative to the length (i.e., the strip acts like a rod) and also use Eq. 2.3 for a two-\ndimensional approximation (ignoring the field spread perpendicular to the plane of the\npaper). The form of the x dependence of H(x) is as important as the magnitude of the\nfield."
    },
    {
      "category": "Resource",
      "title": "sols_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/3447dfcf73e05e9b7ab88b2267de228b_sols_2.pdf",
      "content": "03/01/04\nSolutions. Chapter 2\n2.1 a)\nb) For the normal component of H , it is still possible to use the boundary condition\nderived for normal induction. It does not depend on surface current but only on\npermeability:\ny\ny\ny\ny\n(B2 - B1).n = 0, H1 m = H2 m2,\nH2 H1 = m1 m2 = 10 :\nFrom Eq. 2.4, boundary conditions may be derived for H :\n∫ H . dl = ∫∫ J . dA\nx\nSetting up these integrals gives (the length of the path is l, its height, h):\nH1sinq1 - H 2sinq2 = J0 h 2\nwhere, for the LHS, the one goes counterclockwise about the path of integration.\nHow does H vary through the surface layer? It is necessary only to take different\nx\nlimits on the y integrations, enclosing less of the sheet current to see that H varies\nx\nlinearly from its value at -h/2 to that at h/2.\nH on the other hand is discontinuous at y = 0\ny\nc) The x component of H1 exceeds the x component of H2 by the amount of J0 h/2.\nCombining this with the above condition on the y component gives:\n\n03/01/04\nThe decrease in H in medium 2 is consistent with the direction of the magnetic field\nx\nproduced by the surface current as shown above, center. That field augments H in\nx\nmedium 1 and tends to cancel H in medium 2. The variation of H through the current\nx\nx\nsheet is shown at right.\n2.2 Want B = f /A = 0.6 T in the gap of the circuit.\na) How much current is required in the N = 600 turns on the 20 cm leg?\nAssume the area over through which the flux passes in each leg of the circuit is the same.\nIt is also sufficient to assume that the 600 turns act over the entire length of the circuit.\nThen\nB E 0.59\nNI = f A R = f A\nli\n= m 0 E 100 + 0.01 ˆ = 0.61. 59 ¥ 10\n-2\nm\nm\nm\nm iAi\nm 0\nIn the first term of the sum m = 100. The second term is for the length of the circuit in\nr\nthe gap, μr = 1. Here it is assumed the area over which the flux spreads in the gap, Ag, is\nthe same as Ai = 10-3 m . Thus the required current is\nI = 12.7 A\nNotice that the larger term in the sum is that due to the gap. (If the magnetic circuit were\n10 cm long rather than 60, the gap would make up 90% of the reluctance and for a 0.6 T\ngap field, NI = (0.011)*0.6/m . In this case, I = 8 A.)\no\nb) The flux density in the iron core is given by solving the above NI equation for (f /A)Fe.\nBecause we have assumed the same area throughout the circuit, the flux density in the\niron would also be 0.6 T. If we were to account for the fact that in the gap the flux\nspreads out over a larger area, then the flux density in the iron would have to be greater\nthan 0.6T to maintain 0.6 T in the gap. Alternatively if you calculated the H field created\nby the coil H = NI/l = 12.9 kA/m. The demagnetizing factor reduces the effective\npermeability to about 60 (from 100). Then inside the iron B = m¢m H = 0.97I . This large\nr\nvalue reflects the fact that to get 0.6 T in the gap, B in the iron must be higher due to flux\nspreading in the gap.\n2)\n1/2\n2.3 From Eq. 2.51 and using cosq = h/r = h/(h + x\n2)\n1/2, sinq = x/r = x/(h + x\n, where x\nis the distance along the copper sheet, it follows\n\n03/01/04\nm m\nH = (h\n2 + x\n2 )\n2 [2 her + xe q ]\nThe field lines shear to the right above and below the Cu sheet as you get closer to it.\nThis is caused by the addition of the field due to the current and the field due to the\ndipole. The tension in these flux lines produces a force on the sheet to the left.\n2.4 Start with a sample of soft ferromagnetic material at z = -inf and a permanent magnet\nat the origin (see Fig. below). Bring the soft magnet toward the origin (step 1 in figure)\nand two things happen as it moves into the dipole field given by Eq. 2.51: first the sample\nresponds to the field it sees by an induced magnetization proportional to the field M =\nc H (the field does work in magnetizing the sample) and second the sample experiences\nan attractive force due to its moment in the field gradient. The sum of these two energies\nis negative, but not as negative as it would be had the material already been magnetized.\nThe force per unit volume experienced by the sample of volume V during this process is\ngiven by\nf = F V = M ∂( B ∂x)\nwhere M is the varying magnetization response of the sample to the dipole field. The\nwork per unit volume done by this force in moving the sample to x is given by\nx l\n∂B\nB1\nA2 = U M ∂xdx = U MdB\n-\nwhich is the expression given earlier for A . Note that A includes the effect of\nmagnetizing the sample.\nThe magnetized sample in the field has energy -M.B.\nOnce this magnetization process is completed, if the magnitude of M is fixed at\nM1 and the material is removed from the field (process 2, Fig. above), work must be done\non the sample to remove it from the field:\nW = U M1dB = -M1B1 = A3\nB1\nThus A3 measures the energy of a fixed magnetization density in a field. The minus sign\nimplies work is done on the sample in removing it from the field. We now have a\nsaturated sample at z = -inf. The difference in energy between these two processes is the\nenergy needed to magnetize the sample, A1 = |A3| - A2. That is, the difference between\nbringing an unmagnetized sample from B = 0 to B = B , so that it has magnetization M1,\nand then holding M1 fixed versus removing the sample to B = 0, is simply the energy\nneeded to assemble the randomly oriented atomic moments (M = 0) in the configuration\nthat has M = M 1, regardless of the field. This energy density A1 includes magnetic\nanisotropy and shape energy densities. A1 is the energy of most importance to us. It is\nthe energy needed to magnetize a sample, the anisotropy energy.\n\n03/01/04\nFig.\nGedanken experiment in which a demagnetized sample is first brought from\nnegative infinity into the field of a permanent magnet at the origin. During this process\nthe sample becomes magnetized and its energy is lowered by its attractive interaction\nwith the dipole field. During this first process the sample's energy decreases by A2. In the\nsecond process, the magnetization is held fixed and the sample is removed from the field.\nDuring this process it gains energy M.B. The difference between these two processes is\nthe energy needed to magnetize the sample A1 = M.B - |A2|.\n2.7 a) The remanent inductions are about 2 kG and 0.5 kG for the toroid and rod,\nrespectively.\nb) The coercivity is about 1.0 Oe in each case.\nc) The effective permeability for a drive field of 2 Oe is about 2400/2 = 1200 for the\nμ\ntoroid and 1000/2 or 500 for the rod. [If you convert B and H to T and A/m for MKS, then\nr= B/(μ0H)]\nd) The permeability is related to the susceptibility by m = 1 + 4pc, so c = 96 and\nfrom part c) c = 40 for the rod. The demagnetization factor, N, for the rod is given from\neff\nEq. 2.29 as N = 1/c - 1/c = 0.015.\neff\ne) Table 2.1 gives N = 0.017 in fair agreement with the calculated value in d).\n\n03/01/04\n2.8 solution, and then some. Field from surface poles (second part of Eq. 2.45) is given\nby the 3-D equation:\nr - r'\nH(r ) = 4p UU M ⋅n r - r'\n3 d\n2 r' .\nThe problem asks for the x component of H. In that case, |r- r'|x = (x + L/2) from the left\nsurface where r1 = [(x + L/2)2 + (y - y')2 + (z - z')2]1/2, and , |r- r'|x = (x - L/2) from the\nright surface where r2 = [(x - L/2)2 + (y -y')2 + (z - z')2 ]1/2, and M . n = -M. Thus:\nH (x, y) =\nx\nM\nt / 2\nw / 2\nI\nx + L / 2\nx - L / 2\ndy'\ndz' I\n3 /2\n4p U\nU\nO[(x + L / 2 )\n2 + (y - y' )\n2 + (z - z' )\n2 ]\n3/ 2 - [(x - L / 2)\n2 + (y - y' )\n2 + (z - z' )\n2 ]\n\n-t /2\n-w / 2\nThe minus sign on the second term above comes from the negative value of M. n at x =\nL/2. Note that the contributions to the field from both surfaces are positive because x -\nL/2 ≤ 0.\nTo do the d z' integral, let x = z - z', dx = -d z', so the limits of integration, z' =\nw/2 and z' = -w/2 become x = z - w/2 and x = z + w/2, respectively, giving:\nM\nt / 2\nz+ w/ 2 I\n\nO x + L / 2\nx - L / 2 O\n3-D\nH ( x, y) =\ndy'\ndx I\n3 -\n3 .\nx\nU\nU\n4p -t / 2\nz- w/ 2 O\n2)2\nO\nO(a2 + x\n(b2 + x 2)2\nHere, for brevity, we have temporarily set a2 = (x + L/2)2 + (y - y')2 and b2 = (x - L/2 )2 +\n(y - y' )2. (Note the change of -dx to dx and reversal of the limits of integration over dx.)\ndx\nx\nUse the integral\n3 =\nto get:\nU\n2)2\na\na + x\nM\n( a2 + x\nt / 2\nx(x -1 / 2)\n3-D\nH ( x, y) =\nU dy' I\nEx (x + L / 2) -\nb2\nz+ w / 2\nx\nb2\na\na + x\n+ x\n4p -t / 2\nI\nz- w / 2\nI\nw\nL\n\n= M\nt\nU\n/ 2\ndy' I\n(z + 2 )( x + 2 )\n(z - w)(x + L )\n(z + w)(x - L )\n(z - w )(x - L ) O\nO\n-\n-\n+\n\nw\nb\nw\n4p -t / 2\nOa\n2 a + (z + w )\na\n2 a\n2 + (z -\n)\nb\n2 b\n2 + (z + w )\nb\n+ (z -\n)\n2 O\nO\n\n03/01/04\nAlong symmetry plane z = 0 (for comparison with 2-D solution, which by definition is\nindependent of z) this becomes:\nM\nt / 2\nI\n\n3-D\nH ( x, y) =\nU dy'I\nw(x + L / 2) -\nw(x - L / 2) .\nx\na2 + (w / 2)\nb2 b2 + (w / 2)2\n4p -t / 2 O a2\n\nWe will come back to this integral below, but for now we go to the 2-D limit by letting w\napproach infinity compared to x and y variables and limits. Thus, for fields that vary only\nin 2-D, (x and y) we have:\nM\nt / 2\nI\n(x + L / 2 )\n(x - L / 2)\n\n2-D:\nH (x, y) =\ndy'I\n-\n.\nx\n2p -U\nt / 2 O(x + L / 2)\n2 +( y - y')\n(x - L / 2)\n2 + (y - y' )\nMake the substitution y - y' Æ x so dy' Æ -dx. The limits of integration, y' = ±t/2 are\nnow: x - t/2 and x + t/2, respectively. As before, exchange integration limits and let\n- dx Æ dx to give:\nt\nM\ny + 2 E\nx + L / 2\nx - L / 2\n\n2-D:\nHx ( x, y) = 2p U\nt II(x + L / 2)\n2 + x\n2 - ( x - L / 2 )\n2 + x\ndx .\ny 2\nx\nTo do the integration, use\ndx = arctan( )\ngiving:\nU a + x\na\na\ny + t / 2\nx\n)\n\nH (x, y) = M E\nIarctan(\nx\n) - arctan(\nx - L / 2 y - t / 2\n2-D\nx\n2p I\nx + L / 2\nM E\n-1 E y + t / 2 ˆ\n-1 E y - t / 2 ˆ\n-1 E y + t / 2 ˆ\n-1 E y - t / 2 ˆ\n= 2p II\ntan\n- tan\n\nE x + L / 2 - tan E x + L / 2\nE x - L / 2 + tan E x - L / 2\nThese four arctangents define four angles, fi, between the horizontal and the vector to the\nupper and lower limits of the linear charge distributions at x = ± L/2.\n\n03/01/04\nThe angles fi convert to angles relative to the vertical, q = p -fi so\ni\nf1 -f2 = p -q -(p -q2) =q2 -q1 . Taking account of the fact that x - L/2 ≤ 0, we have:\n2p\nleft +q2\nright\nright\nH (x,y) = M (q2\nleft -q\n-q\n).\nx\n1 243\n1 24\nleft:+poles\nright :- poles\nThe differences in these q define the angles subtended by the charge distribution from\ns\nthe observation point.\nSo finally\nM\n2-D\nH (x,y) =\n(qleft +qright),\nx\n2p\nwhich is Eq. 2.3 for two surfaces having the polarity shown here. We now apply this\nequation to problem 2.8, where t/2 = L/400.\n\n03/01/04\nThe results are displayed on an arbitrary vertical scale because obviously the 3D fields\ndrop off much more strongly with y. The important point to get is that near the center of\nthe magnet, and close to its surface, the field is very weak. This fact was used to\ncalculate the field inside a solenoid (Ch. 1).\nLet us now return to the last 3-D equation above,\nM\nt / 2\n\nI\nw( x + L / 2 )\nw(x - L / 2)\nH ( x, y) =\ndy'I\n-\n\n3-D\nx\n4p -t / 2 O a2\nU\na + (w / 2)2\nb2 b2 + (w / 2 )2 ,\nand consider the limit in which the strip is not very wide compared to x and L/2. For\nsmall w (to contrast wit the purely 2-D case) this becomes:\nMw\nt / 2\nI x + L / 2 - x - L / 2\n3-D\nH (x, y) =\ndy' I\n\nx\nb\n\n4p -U\nt / 2 O\na\nwhere, as before, a2 = (x2 + L/2)2 + (y - y1)2 and b2 = (x - L/2)2 + (y - y')2. Setting y - y' =\nx as before gives:\nt\ny +\n\nO\n3-D\nMw\nI\nx + L / 2\nx - L / 2\nO.\nH (x, y) =\ndx I\n3 -\nx\nU\nO\nO\n4p\ny - t\nO[(x + L / 2)2 + x 2]2\n[( x - L / 2 )2 + x 2]2\nThis form of integral was solved above, and now gives\n3-D\nH (x, y) = Mw E\nx (x + L / 2 )\nx (x - L / 2)\ny + t / 2\n.\n-\nx\n4p II( x + L / 2 )2 (x + L / 2)2 + x\n(x - L / 2)\n2 + x y - t / 2\nMw{\ny + t / 2\ny - t / 2\n=\n-\n4p\n(x + L / 2 ) ( x + L / 2 )2 + (y + t / 2)2\n(x + L / 2 ) ( x + L / 2 )2 + (y - t / 2)2\ny + t / 2\ny - t / 2\n}\n-\n+\n(x - L / 2) (x - L / 2 )2 + (y + t / 2)2\n(x - L / 2) ( x - L / 2)2 + (y - t / 2 )2\nThese four terms define tangents as shown below.\n\n03/01/04\nThus, for 3-D\nI\nleft\ntanq1\nleft\ntanq2\nright\ntanqright\nMw O tanq 2\nO\nH\nI\n\nx ( x, y) = 4p O\nr2\nleft\n-\nleft\n-\nright\n+ r1\nright O\nO\nr1\nr2\n\nwhere r1\nleft = [(x+L/2)2+(y+t/2)2]1/2 etc. That is, the 3-D field (narrow w) along z = 0 is\nsimilar to the 2-D form but with angles replaced by angle tangents and there is an extra\nfactor of w/2r in 3-D; the fields drop off faster. The 3-D form is plotted over the 2-D\nresult for the two specified values of y.\nIn cylindrical coordinates, for the charged end faces of radius r , the field in 3-D is\no\n\nE\nH (r,x) = Mro I\n+\nI\nx\nx\nx2 + r\n(l - x)\n2x + r\nwhich again scales like the ratio of the charge dimension over the distance to the\nobservation point, r0 / r."
    },
    {
      "category": "Resource",
      "title": "probs_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/9686ccc05a81b64647ec7bd5fe4110ca_probs_3.pdf",
      "content": "03/02/04\nPROBLEMS Chapter 3.\n3.1) Use the Lorentz force to describe how the angular frequency w changes for a\ncircular electron orbit (e.g. a classical Bohr orbit) in the xy plane when a magnetic field is\napplied along the z axis.\n3.2) Derive the expressions for total energy En and radius of circular electron orbits of\nradius rn in Bohr's model. Evaluate the constants E1 and r1 in SI units.\n3.3) Calculate the classical angular momentum and the magnetic moment for a uniform\nshell of charge -|e| and radius r = e\n2 ( 4pe0mc ) rotating with angular velocity w. What is the\ngyromagnetic ratio for this particle? What is the surface velocity? (This problem was\nconsidered by Max Abraham in 1903, more than 20 years before Uhlenbeck and Goudsmit\nhypothesized that electrons spin with a gyromagnetic ratio twice that for orbital motion).\n3.4) Compare essential characteristics of Lenz's Law (macroscopic) and\ndiamagnetism. How are they similar and how different?\n3.5)\nCalculate the dimension at which diamagnetism crosses over to\nparamagnetism for a metal with s = ne t/m = (ne2/m) l/<v> = 107 (Ωm)-1. (t =\nrelaxation time, l = mean free path, <v> = mean drift velocity of change carriers.\n3.6) a) Evaluate the ratio of integrals in the classical expression in the notes for\n<cosq>\np\nˆ\nm\nU exp E\nAm H cosq cosq sinqdq\nE kT\n\np\nˆ\nm\nU exp\nE\nAm H cosq sinqdq\nE kT\n\n03/02/04\nb) Show that L(s) = coth (x)-1/s goes to x/3 in the limit that x approaches zero.\nDiscuss.\nc) Show that L(x) Æ 1 for x = inf; discuss.\n3.7) Show that the units of c = N m0m / kT and c = N m0e\n2 /6m\nr\nA\n2 are m3 ¥ N\nv\nm\nv\nso that if N\nis number of atoms per unit volume, c is dimensionless. However, if N is\nv\nAvogadro's number. (in which case c is the molar susceptibility c\n) it must be\nmol\nmultiplied\nby\n106 cm3/m3\nto\ncompare\nw ith\n4pc\n= 4pNm\n2 /kT , or\nmol\nm\n4pNe\n2 /6mc Ar\n2 calculated in cgs units.\n3.8) Calculate the paramagnetic susceptibility of diatomic oxygen at room\ntemperature and compare it with the experimental, room temperature (cgs) value c\n=\nmol\n3.4 ¥ 10-3.\n3.9) Calculate the diamagnetic susceptibility of atomic He assuming r2 ≈ a0\n2 and\ncompare with the room temperature cgs value c\n= -1.88 ¥ 10-6.\nmol\n3.10) Derive a classical expression for the diamagnetic susceptibility of an\nelectron in circular orbit by considering the change in its angular momentum due to the\nelectric field induced as a B field is slowly turned on normal to the orbit plane in time dt.\n3.11) Analyze the condition for which the paramagnetic and diamagnetic\nsusceptibilities are equal and opposite for a classical Bohr atom with orbital but not spin\nmagnetic moment. Discuss.\nv\n\n03/02/04\n3.12) Calculate the orbital magnetic moment of an electron in a circular Bohr\n)\nUse w = E h =1.36eV/h and then use\n1 2\norbit.\nw = v r = (2E m\nr0 and compare the\nresults. Which one is correct? Why?\n3.13) A very thin film (t < mean free path) may exhibit diamagnetism in an\nexternal field perpendicular to the film plane. Explain how application of the field in the\nplane of the film could change the sign of this effect.\n3.14) Write the electronic configuration (e.g. 3d4), the spectroscopic notation\n(2s+1LJ e.g. 3D5/2) and effective magneton number neff = g [J(J+1)]1/2 where g = 1 +\n[J(J+1) + S(S+1) - L(L+1)]/2J(J+1) for Cr3+, Fe3+ and Co2+.\n3.15) a) Show that Bj(x) reduces to the Langevin function L(x) , with x = mmB/kT,\nin the limit J approaches infinity.\nb) Show that B1/2(x) = tanh (x)\nc) Show that for x <<1, Bj(x) becomes\nx < <1\nJ(J + 1)\nBJ (x) æææÆ\n3J\nx\nand thus in this limit\nNvg m B\n2 J(J + 1)\nc = m o\n3kT\nd) Show that as x approaches infinity, Bj(x) approaches 1, i.e. M = Nvg mB mJ .\nDescribe the physical significance of each case.\n3.16) The Lande g factor is used to account for the fact that mJ = mL+ mS is not\ncollinear with J = L + S because mL= mB ml = (eh /2m)ml whereas ms = 2 mBms. Derive\nthe expression for g in terms of the quantum numbers l, s and j. Make use of the facts\n\n03/02/04\nthat because L and S precess around J, then mL, mS and mJ also precess around J and it is\nthe projection of mJ on J that is measured.\n3.17) What type(s) of magnetism would you expect to find and why in a) NaCl b)\nMnSO4.4H2O c) Fe3O4 d) H2O (or Ne) e) metallic Cu?"
    },
    {
      "category": "Resource",
      "title": "sols_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/659f3040251e2ab4d56e32f17cd1a1c4_sols_3.pdf",
      "content": "03/02/04\nSOLUTIONS\n3.1) I have two solutions to this problem. Which do you prefer?\nFIRST: 3.1) The Lorentz force, F = q(v ¥ B), is everywhere directed along the\nradius vector. The torque on the orbital motion, T = dL/dt, is given by r ¥ F, which is\nzero. Hence, the Lorentz force cannot change the angular momentum or the angular\nfrequency (L = Iw). Alternatively, the circular orbit generates an angular momentum and\norbital magnetic moment that are directed parallel or antiparallel to the applied field. The\ntorque due to the B field acting on this moment, m ¥ B is also zero.\nm\nHowever, the presence of the magnetic field does add a new potential energy to\nthe problem that should change something other than w. If the electron is described\nclassically (which is the limit of our treatment so far), it can assume an orbit of a different\nradius as B is applied. (If it is treated quantum mechanically, it may not incrementally\nchange its radius, but can only do so in quantized steps that correspond to discrete energy\ndifferences.) So the energy of the system may be written:\nZe2\nE = 1 mw\n2 r\n2 -\n± m B\nm\nm]\n4peor\n1/2\nand m = IA = ewpr\n2 where w and r are the Bohr frequency (w = [2EK/\n/r = 4.2 x 1016\nm\ns-1) and radius (ro = 0.52 A) respectively. Thus,\nZe2\nr = 4pe o[(mw\n2 /2) m pewB],\nHow significant is the magnetic field term in the denominator?\n2peB\n-5 B\na 2.6 ¥ 10\nmw\nEven classically, the change in orbit radius is insignificant. These contradicting\nresults underscore the limitations of the classical Bohr model.\n\n03/02/04\nSECOND: The Lorentz force, F = q(v ¥ B), is everywhere directed along the\nradius vector. A circular orbit would result from a central force -Ze2/(4peor2); its total\nenergy, E = T + V = (1/2) mv2 - Ze2/(4peor), is conserved with application of B. If the\nelectron is described classically (which is the limit of our treatment so far), it can assume\nan orbit of a different radius as B is applied. (If it is treated quantum mechanically, it\nmay not incrementally change its radius, but can only do so in quantized steps that\ncorrespond to discrete energy differences.)\nThe force balance describing the classical, field-induced change in the electron\norbit is\nmv2\nr -\nZe2\n4pe or\n2 - euB = 0\nTo see how the angular frequency w varies with B we write the force balance as\nZe2\nmw r = 4pe or\n2 + mwwLr.\nwhere wL = eB/m which is of order 1011B s- 1 (B in T). At B = 0 , this equation suggests\nthe definition:\nZe\nw =\no\nm4pe or 3 ,\no\nwhich is the frequency of the Bohr orbit if ro = 0.52 A, the Bohr radius. The magnitude\nof w is about 1017 s- 1, optical frequency, as expected. Thus wL is very small compared to\no\nw . At B = 0 we therefore have\no\nE r ˆ\n2 A\no\nw - ww L - w 0 A = 0\nE r\nIf we assume the radius is unchanged with application of B, then this equation is\nquadratic in w, and has the solution\nw L\nw =\n( 1± 1+ 4w /w L )\no\n\n03/02/04\nor, considering the smallness of w /w ≈10-6,\nL\no\nw = wL ±w 0\n1+w L /4w0 a w L ±w0 (1+ wL /8w0 ).\nAt B = 0 this reduced to w = ±w .\nFor\n\no\nincreasing B, w increases or decreases as\nshown at right and asymptotically\napproaches the straight line w = w = e\nL\nB/m for very large B. For experimentally\nachievable values of B, w = wo.\nIf we do not assume r = ro, then we must solve the equation of motion for r. We\nassume r = ro(1+d), giving:\nw0\nw - ww L - (1+ d )\n3 a w\n2 - ww L -\nw0\n(1+ 3d + 3d\n2...) = 0 ,\nw\nwhich, if we take w = w0, gives:\nL\nd =\n.\n3w\nThus, application of a field increases or decreases the radius of the orbit depending on the\nsign of the B field.\n-1 xesxdx\nU\n3.6) a)\ncosq = 1\n-1\nwhere x = cos q and s = m B/kBT. Use table of\nm\ne\nsxdx\nU1\n-1\nintegrals or the following more elegant derivation. If we let f (s) =\ne\nsxdx , then it is\nU1\n' f (s)\nd\nclear that\ncosq =\n=\nln[ f ( s)]. Evaluating the integral in\nf(s) gives\nf (s)\nds\n2 sinh(s)\nd\ncosh(s)\nf (s) =\nso cosq =\nln[ f (s)] =\n-\n= L(s) . Q.E.D.\ns\nds\nsinh(s)\ns\n\n03/02/04\nb) Use coth(s ) = 1/x + s/3 +.... The result is the classical Curie law for\nmagnetization at weak fields/high temperatures: <m > = m <cos q> = m\n2B/(3kBT).\nm\nm\nm.\nc) Both sinh and cosh appraoch infinity for infinite argument, so coth(s Æ inf) = 1.\nThis describes saturation, at which point the thermally averaged moment in the field\ndirection is equal to the magnitude of the moment: <m > = m <cos q> = m\nm\nm\nm.\n3.7) Nvμoμm2/kBT has units m-3(H/m) (J/T)2/J, but since the unit T = W/m2 =\nHA/m2 and A2 = J/(sW) and H/m = Ws (considering that L∂\n2 q ∂t\n2 has the same units as\nR∂q/∂t), the MKS unit N m3 results. Cgs form of c gives units N(erg/Oe)2/erg (here N\nv\nmay be either the number per unit volume, Nv, or Avogadro's number, NA) but since Oe2\n= erg/cm3, the unit Ncm results. Thus c (MKS) = 4pc(cgs) but 106cmol (MKS) =\n4pc(cgs).\nFor diamagnetic susceptibility, c has units Nμoeo .Jm m 2/kg since e2/(4pe0r) is in\n-\njoules. But m0e0 = c\n2 so our units on\nc are N.Jm3/(kg m 2/s2) = N.m3 as for the\nparamagnetic case. In Cgs units e2 is in erg cm so c has units N erg cm3/g (cm/s)2 =\nNcm3.\n-3\n3.8)\nDensity = 1.4¥\n10 g/cm3.\nSpin of molecule is 2/2 so\n(\nm = g\n2 s s + 1)m = 8m\n2 giving for cmol = Nm0mm kBT a value 1.29 ¥ 10 -7 (using NA =\nm\nm\nm\n6.025 ¥ 1023 at/mol). But units of ccgs are cm3, so our c\n= 1.3 ¥ 10-7 should be\nmol\ncompared to 4pc\n¥ 10-6 m3/cm3 = 4.3 ¥ 10-8 which is 1/3 of our value.\nmol\n3.9) Density of He = 1.78 ¥ 10-4 g/cm3. c = [e μ0 /(6m)]S<r2> and two electrons\nin an orbit of radius ao gives -3.54 ¥ 10-9 S <r2> = 1.98 ¥ 10-11. The cgs value should be\nconverted by 4p ¥ 10-6 c = 2.36 ¥ 10-11.\nm\n3.10) -- ¥ E = -dB/dt . Using Stokes' theorem gives\n\n03/02/04\n2 dB\nU E ⋅ dl = - df = -pr\ndt\ndt\n2pr E = pr2(dB/dt), E = - (r/2)(dB/dt). This field produces a torque T = r ¥ F = rEe\n(where e < 0) so T = dL/dt = +(|e|r2/2)(dB/dt) giving ∆L = +(|e|r2/2)B\nBut m = g L L = eL (2m) , so the field-induced moment is given by\nm\nμm = -(e r2/4m) and c = Nvμm/H\nc = -(Nvμoe2/4m)r\nbut here r\n2 = x + y = (2 3) r\n2 . So finally\ncd = -(Nvm0e /6m) r\n3.11) cp + cd = 0 implies\n3kBT - [e /6m]r ) = 0\nNm0(mm\nThe larger the paramagnetic moment squared, the larger the area of the diamagnetic orbit\nmust be to cancel it out at a given T.\nGoing further, for a classical orbit, μm = gL = ( e/2m) mvr = evr /2, so the condition\nbecomes\nv 12kBT = e\n2 6m, (1/2) mv 2 = kBT\nThis says that the higher the kinetic energy of the classical orbit, the higher the\nT at\nwhich c\n= 0. This is because higher EK requires a smaller orbit which has smaller area\ntot\nand smaller diamagnetism; the small diamagnetism is only canceled out by the\nparamagnetism when the temperature is large enough to suppress the Curie\nparamagnetism. At lower temperatures, the paramagnetism dominates.\n3.12) μm = IA = ewr2/2. For w = E h , μm= 4.6 ¥ 10-24 Am2 . However, using w =\nv/r0, μm = 9.27 ¥ 10-24 Am2 = mB. They differ by a factor of 2. The latter is correct,\nclassically. The former is wrong because it makes use of the Einstein relation for the\nenergy of a photon. This then gives w = 1/2 w which is wrong as is the first estimate.\n\n03/02/04\n3.13) The diamagnetic contribution of free electrons in metals (between scattering\nevents) is small. But for thin films or wires, the presence of narrow boundaries changes\ndiamagnetism to paramagnetism for B perpendicular to the thin dimension. This effect is\nillustrated below.\n1.\nB\nFig. Above, diamagnetic orbit of electron in\nfield. Below, illustration of change of\ndiamagnetism to paramagnetism in a thin film.\n3.14 Cr3+ = 3d3. l = 3, s = 3/2, j = l - s = 3/2, thus 4F3/2 g = 0.4, neff = 3.87\nFe3+ = 3d5. l = 0, s = 5/2, j = 5/2, thus: 6S5/2 g = 2 (l = 0) and neff = 5.92\nCo2+ = 3d7. (3 holes whereas Cr3+ has 3e's)l = 3, s = 3/2, j = 9/2, thus: 4F9/2 g\n= 1.33, neff = 6.63\n3.16) Experiment measures the projection of mJ on the direction J about which it\nprecesses:\nmj = ml cos(LJ) + ms cos (SJ) and from the law of cosines : C2 = A2 + B2 - 2AB\ncosC applied to the vector triangle L + S = J gives (writing √l(l+1) as L for\nconvenience):\ncos(LJ) = [L2 + J2 - S2]/[2L J]\ncos (SJ) = [S2 + J2 - L2]/[2S J]\nmj = mB [(L2 + J2 - S2) + 2(S2 + J2 - 2L)]/2J\nmJ = mB (3J2 - L2 + S2)/2J = mB J(2J2 + J 2+ S2 - L2)/2J2\nmJ = mB J[1 + (J2 + S2 - L2)/2J2]\n\n03/02/04\nRestoring the proper quantum mechanical lengths for the vectors, leads to\nmj= mB√j(j+1) {1 - [j(j+1) +s(s+1) - l (l +1)]/2j(j+1)}\nmj = g mB√j(j+1)\n3.17) a) NaCl: diamagnetic (temperature independent) because this ionic crystal\nsatisfies complete octets in each component. No paramagnetism.\nb) MnSO4.4H2O: Mn is in state Mn ++ 3d5. It will not order ferromagnetically.\nSuperexchange giving antiferromagnetism is a possibility, but it is not observed, probably\nbecause oxygen bonds primarily with the sulfur and so it is not available for mediating\nexchange between Mn ions. So this is a paramagnetic salt with some diamagnetism\nsupplied by H20. c ~1/T and M vs. H/T follows B5/2 (x).\nc) Fe 304: this is a classic antiferromagnetically coupled two sublattice system:\nFe3+ is on one site (A) and Fe3+ and Fe2+ on the other (B). mA = -5μB and mB = +9μB so\nnet moment is 4 mB.\nd) Ne is diamagnetic as is H 20. Former has complete octet l = s = 0, latter has\ncovalent bonds with paired spins. In both cases c < 0 and temperature independent.\ne) Cu is a Pauli paramagnet c = [moNmm2/kBT] (kBT/EF) which is temperature\nindependent, c > 0."
    },
    {
      "category": "Resource",
      "title": "probs_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/624e2cbac037eef7dcde99718c8b3501_probs_4.pdf",
      "content": "March 2004\nChapter 4. PROBLEMS\n4.1. Magnetic moments in ferrites.\na) Give the outer electron configurations and magnetic moments for the\nfollowing ions: Fe2+, Fe3+, Mn2+, and Zn2+\nb) Using the site selection shown in Fig. 4.15, determine the preferred site\noccupations for Mn and Fe in MnFe2O4 (assume Mn2+) and give its magnetic moment\nper formula unit.\nc) Describe what happens to the site occupation and net moment as Zn2+ is first\nsubstituted for Mn2+.\n4.2. Explain what happens as Zn substitutes for Ni in nickel ferrite, NiFe2O4. Again,\ndescribe the valence electronic structure of the ions and magnetic moment\nvariation per formula unit. Be quantitative where possible.\n4.3 Use the data for paramagnetic Ni in Fig. 3.5 to calculate the molecular field\ncoefficient l in Heff = lM in the following two ways:\na) Calculate the Curie constant from Eq. 4.21 using a lattice constant of 3.6A for\nfcc Ni.\nb) Determine the Curie constant then l from two data points on c(T) Fig. 4.8."
    },
    {
      "category": "Resource",
      "title": "sols_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/a474a9401dc32d4875286e72dfcf7ada_sols_4.pdf",
      "content": "March 2004\n4. SOLUTIONS\n4.1. a) Fe2+ 3d6, 4mB,\nFe3+ 3d5, 5mB,\nMn2+ 3d5, 5mB, and Zn2+ 3d10, 0mB\nb) Mn2+ prefers the A sites even more than Fe3+ does, so unlike the other\ntransition metal ferrites, Mn occupies A site and 2Fe3+ occupy B sites. However, this\nmakes no difference to the moment per FU because Mn2+ and Fe3+ have the same\nmoment. Net moment is 5mB per FU.\nc) As Zn replaces Mn, there is no change in iron B-site occupation but the\nreduction of the moment on the A sublattice, Mn1-x + Znx, allows the net moment to\nincrease linearly because a smaller A-site moment is subtracted from the 10 Bohr\nmagnetons on the B sublattice. At some value of x, the weaker moment on the A sites\nwill allow the antiferromagnetic interaction between the two moments on B sites to take\nprecedence. Beyond this Zn concentration, the net moment decreases as the moment on\nthe B sites decreases rapidly from 10 Bohr magnetons.\n4.2 Substitution of Zn for Ni in Fe2NiO4. Ni2+ has less tetrahedral (A) preference\nthan Fe3+ so site distribution is as indicated in table. But Zn2+ has stronger A preference\nthan Fe3+ so while it substitutes for Ni, it displaces Fe3+ from A sites to B sites.\nA\nB\nFe2NiO4\nFe3+\nFe3+ Ni2+\nFe2Ni1-xZnxO4\n(1-x)Fe3+ x Zn2+\n(1+x)Fe3+ (1-x)Ni2+\nMoment\n-(1-x)5 - 0x\n+(1+x)5 + (1-x)2\nmm = [2 + 8x] mB\nThis is the initial linear increase shown in Fig.4.15.\n4.3 a) There are two Ni atoms per unit cell so C = Nvmomm2/kB ≈ 0.48. Hence,\nfor TC = 630K, l =\nTC/C = 1300.\nb) Use c = C/(T - TC) . For T = 730 and 930K, c ≈ 3.3 ¥ 10-3 and 1.1 ¥ 10-3,\nrespectively. Thus, C = 0.99 and 0.11 respectively and l = 5730 and 636, respectively."
    },
    {
      "category": "Resource",
      "title": "probs_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/2c98177bd04cc6ff35316a32216e3118_probs_5.pdf",
      "content": "March 2004\nPROBLEMS\n5.1 Calculate the electron density needed to produce the first crossover in Fig. 5.21.\nWhat would the charge density have to be for the first crossover to occur between the\nsecond and third nearest neighbors of iron (aFe = 2.86A).\n5.2 Describe and contrast the valence electronic structure and magnetic characteristics of\ni) free iron atoms\nii) atoms in metallic iron\niii) iron ions in magnetic Fe3O4\n5.3 Explain what happens as copper is alloyed with nickel, Ni1-xCux. Describe the\nvalence electronic structure and the magnetic moment in terms of a simple band model.\nBe quantitative where possible.\n5.4 Calculate the effect on the total energy of an alloy as states in a flat d-band are filled.\n5.5 Verify Eqs. 5.7 and 5.9.\n5.6 a) Explain why ferromagnetism is observed in nickel (4s 3d)10 but not in titanium (4s\n3d)4.\nb) Explain why ferromagnetism is observed in the metals of the 3d transition\nseries and not in the metals of the 3p series (e.g. Al).\n5.7\nYou are running a billion dollar a year specialty steel operation. You want to\nimprove the corrosion resistance of a magnetic iron alloy but do not want the saturation\nmagnetization to decrease too much. While talking in your office to an old classmate you\nreceive a phone call that you can buy several tons of either Mg or Ti at a bargain price.\nAll you know is that Mg has a positive heat of formation with iron (+20 kJ/mole) and Ti\nhas a negative heat of formation (-26 kJ/mole).\na) If both are equally effective in improving corrosion resistance, which would\nyou buy?\nb) If you can justify your choice to your colleague, perhaps even impressing him\nwith your knowledge of the Pauli exclusion principle, he may nominate you to be a\nfellow of the American Physical Society. What do you tell him?\n5.8 a) Use your understanding of the electronic structure of metals to explain the general\nparabolic trend and the magnetic exceptions to that trend shown in Figs. 5.20 a and b.\nWhile answering this question be sure to\n- sketch representative electronic state densities,\n- explain the relation between atomic volume and bulk modulus,\n- discuss the relation between electron kinetic energy and atomic volume,\n\nMarch 2004\nb) Estimate the fractional volume change in Fe due to its magnetic moment and\ngive a numerical value for the pressure needed to cause such a volume change. Discuss\nthe possible relation of this effect to the structure Fe assumes at room temperature.\n5.9 a) Calculate the dipole energy of a spin 1/2 particle in the field of another spin 1/2\nparticle 2 Angstroms away. Assuming they are free to rotate, what relative alignment\nwill they assume?\nb) Calculate the coulomb energy of two point electrons 2 Angstroms apart.\nc) Estimate the magnitude of the Coulomb integral\n*\ne 2\n*\nC\n= + Uf a ( 1 ) f ( 2 ) 4 pe o rij\nf a ( 1 )f ( 2 ) dt\nij\nb\nb\n= + U\nra( 1 ) r ( 2 )\nb\ndt\n4 pe o rij\nand the Exchange integral\n*\ne 2\n*\nJ\n= ± Ufa ( 1 )f ( 2 ) 4 pe o r ij\nf a ( 2 ) f ( 1 ) dt\nij\nb\nb\nCompare these with the magnitude of the dipole interaction energy in a) and the\nelectrostatic energy in b).\n5.10. Ferromagnetic metals.\na) Explain why ferromagnetism is observed in nickel and not in aluminum.\nb) Explain why ferromagnetism is observed in the second half of the 3d transition\nseries and not in the first half."
    },
    {
      "category": "Resource",
      "title": "sols_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/48c2aa9c5a189ac6aaf1401a766561c1_sols_5.pdf",
      "content": "March 2004\nSOLUTIONS\n5.2 i)Free iron atoms 3d6 4s2, energy of 3d > 4s. Hund's rule applied to 3d6 results in l =\n2, s = 4/2 and j = 4 so the moment is 4 mB/Fe. These moments are independent and so\nbehave as a paramagnet with susceptibility c = Nvmm2mo/kT.\nii) 3 d and 4 s states broaden into overlapping bands with 3 d74s1, approximately, with\nspin up and down 3d states shifted relative to each other. d states are broad in energy and\nwhile more spin up states are filled, some spin down states are also filled. Moment is 2.2\nmB/Fe. Sketch band DOS.\niii) Fe3+ is 3d5 m m= 5 mB\nF2+ is 3d6 m m= 4 mB\nd states are narrow as fully spin split, fully spin, i.e. all spin up fill before any\nspin down 3d.\n5.3 Add\nCu,\nnv = 11,\nto Ni, nv = 10.\nNo. of s electrons\nns = 1.0\nns = 0.6\nd electrons\nnd = 10\nnd = 9.4\nd spin up\nnd+ = 5\nnd - = 5\nd spin down\nnd+ = 5.0\nnd - = 4.4.\nnd+ - nd -\n0.6\nalloy moment\n0x\n+\n0.6(1 - x)\nNi has 0.6 holes in minority spin band. As Cu is added, the holes fill at a rate of 1\nelectron per Cu, so the holes are gone, moment = 0, when 60% of alloy is Cu.\n5.4 The contribution of the d-band electrons to the stability of an alloy can be expressed\nE F\nE\n=\nU EZ(E )dE\nd\n- D / 2\n\nMarch 2004\nwhich gives\nE\n2 / 2]\nE\n-\nF\nD\n= (E\n2 - D ) / 2\n/ 2\nF\nwhich is parabolic in the value of the Fermi energy (Fig. 5.12).\n5.6 a) Early transition metals have broader d bands (lower density of states) than do later\ntransition metals because the sparsely-filled d orbitals of the early transition metals see a\nweaker core potential than the electrons of the later transition metals. This in itself favors\nmoment formation in the later transition metals based on the Stoner criterion which states\nthat the product of the density of states times an exchange integral (that is related to the\nenergy favoring parallel spins) be greater than unity. In addition, in Ni the Fermi energy\nis near the top of the d band where the states are of antibonding character; this further\nenhances the density of states near EF for Ni. In Ti on the other hand, the Fermi energy is\nin the lower half of the d band which is more bonding in character and thus has an even\nlower density of states.\nb) p orbitals are more involved in bonding (l = 1) than are d orbitals (l = 2). Thus\nthey are less localized and form more free-electron-like states than do d electrons. The\nStoner criterion then favors moment formation in the d series considerably more than in\nthe p series.\n5.8 a) The band structure of the transition metals is approximately as sketched below.\nThe center of the d band is well below the electronic energy of the free-atom d states\n(otherwise the condensed state would not be stable). Half the d-band states are below and\nhalf above the center of the d band. The states near the bottom of the d band (bonding in\nnature) fill first and account for the dramatic increase in stability (depth of interatomic\npotential) and stiffness (related to the curvature of the interatomic potential) and\nconcomitant decrease in interatomic volume in the first half of the series. The occupation\nof higher-energy, antibonding states in the second half of the series cancels the energy\nstabilization gained in the first half and the trends reverse.\nMagnetic moments are known to form on atoms in the 3d series metals Cr, Mn,\nFe, Co, Ni. [In the first two, these moments order antiferromagnetically, i.e. Smm = 0\n\nMarch 2004\nover a unit cell, and in the latter three, the moments order ferromagnetically]. The\nexchange energy drives the establishment of an unequal spin population in the two sub-\nbands; electrons below the Fermi energy in one band must move to empty states above EF\nin the other. Kinetic energy is measured from the bottom of the band. Hence, a net\nkinetic energy increase for the d electrons results from satisfying Hund's rule (even\npartially) because more electrons now find themselves in states farther from the bottom\nof the spin-up band.\nEF\nEKZ (E) f ( E)dE\nEK = U\nHere EK is the kinetic energy of the d electrons and Z(E) and f(E) are the density of states\nand the Fermi function, respectively. Just as increased kinetic energy in a gas causes\nexpansion, so too, in metals, moment formation increases the kinetic energy of the d\nelectrons causing an increase in atomic volume.\nb) This moment formation leads to a giant internal pressure. From Fig. 5.20, a\nvolume change is seen for Fe to be of order 1 part in 7 (14%) corresponding to a linear\nstrain of more than 4%. The change in bulk modulus of Fe due to its magnetic moment\nappears from Fig. 5.20 to be of order 1.0 ¥ 104 kg/mm\n2 (100 GPa or 1.5 megabar)!\nAlternatively, using a nominal value of 1.7 ¥ 10\nN/m for the bulk modulus of Fe, the\nmagnetic stress is of order 14% ¥ 1.7 ¥ 10\n= 24 GPa or 0.24 megabars.\nNow it should be clearer why Fe finds itself in the BCC structure rather than in a\nclose-packed structure expected for a metal at room temperature. It needs the extra\natomic volume of the more open BCC structure to accommodate this giant internal\npressure.\n5.9.\na) If the second spin is located along the axis of the first spin, its moment will\nalign parallel to that of the first. If the second spin is located in the plane perpendicular to\nthe first, its moment will be antiparallel to that of the first electron. In Ch. 4, we had\nestimated the B field seen by an electron due to its relative motion about the nucleus (a0 =\n0.52A) to be of order 1 T (this is the field associated with the spin-orbit interaction). For\ntwo spin 1/2 electrons 2A apart, the B field should be smaller than 1 T. We cannot use\nthe dipole field formula for the field of one spin at the position of the other because that\nequation is for the far field of a dipole; closer to a dipole the field does not vary as r-3.\n\nMarch 2004\nInstead we use the Biot-Savart law, Eq. 1.14, and calculate the field at z = 2 A along the\naxis of symmetry as shown in the figure below.\nU\ndl ¥ r\nm 0\nr0 + a\nm 0\nev\n=\nB = m 0 I\nz\n3/ 2 cosq =\n4p\nr\n4p ev (r0 + a\n2)\n4p r0 + a\nHere a0 = 0.52 A is the Bohr radius, q is the angle between\nr and the plane of the orbit, and we have used I = ew/2p.\nTaking v = (2E/m)1/2 = 2.2 ¥ 106 m/s2, with E = 13.6 eV, we\nget I = 1.07 mA and B = 0.826 T directed along the z axis.\nThe energy of a spin-one-half particle (one Bohr\n-24\nmagneton) in this dipole field is -mBB = 7.66 ¥\nJ =\n0.05 meV.\nb) The strength of the Coulomb interaction of two electrons separated by 2 A is\ne2/(4pe0r) = 1.15 ¥ 10-18 J = 7 eV.\nc) The Coulomb integral is expected to be of the same order of magnitude as the\nclassical Coulomb interaction, 7 eV. The probability densities, | y 1y 1*| and | y 2y 2*|, of\nthe two electrons drop off as exp[-2r/a0] and exp[-2(r-2A)/a0]. Their integration over all\nspace represents the net electrostatic interaction of the distributed electronic charge of the\ntwo electrons. The Coulomb exchange integral can be estimated from the value of the\nabove Coulomb interaction times a factor that accounts for the fact that the two electrons,\nnow having parallel spins, stay on average farther from each other; their wave functions\ncombine in a spatially antisymmetric way, and hence their probability density has a nodal\nplane between their centers. This could be approximated by replacing the 2A above with\na slightly larger number or by using an asymmetric wave function on each site as\nillustrated below, right.\n| y 1y 1*|\ny 1\nCoulomb integral\nExchange integral\nIn any case, this exchange integral is much stronger than the dipole interaction but\nit is due to an entirely different mechanism, and it is not as strong as the pure Coulomb\ninteraction.\n5.10. a) p orbitals or p bands in Al are too delocalized (essentially free electrons), to\nsupport any moment formation which must arise from a highly localized electronic wave\nfunction. The nearly atomic like (high density of states) 3d wave functions of Ni allow\nintra-atomic exchange (Hund's rule) to establish a moment. Interatomic exchange allows\nthe moment to order over long range.\nb) The early transition metals have bonding valence states that are more\ndelocalized than those of the late transition metals which are antibonding. The result is\nthat the late transition metal valence states are more highly localized and so a moment\ncan form. They overlap enough so that long range order can be sustained."
    },
    {
      "category": "Exam",
      "title": "sample_exam_2000.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/0bc5d5f8f671c53d35e13c35c6b1b3e1_sample_exam_2000.pdf",
      "content": "3.45\nEXAM Solutions\nApril 5, 2000\n1.\nm\n(25 points) A long permanent magnet has a remanent induction of\n0Mr = 0.64T in the\ny direction. Its cross section in the x-y plane is square\nmeasuring a ¥ a and its length is very large in the z direction.\na) Sketch the H vector fields near the top and bottom\nsurfaces. (10)\nb) Calculate the y component of the field m Hy at the\no\nmidpoint just outside the top surface.\nShow your equations and get a numerical result (the numbers were chosen so a calculator would not be\nnecessary). (15)\nAns. 1 a) field emanates from + (N) poles and terminates on - (S) poles as sketched.\nm s\n0.64\no\nb) From top surface (s > 0) where q = p: m Hy = 2p q = 2p p = 0.32T\no\nFrom bottom surface (s < 0), q/2 = arctan(0.5), q = 53o = 0.93 rad, m Hy = -0.94 T.\no\nTotal field just outside center of top surface is m Hy = +0.23 T.\no\n2. (25) Consider the data below.\na) Explain why the magnetic moment per formula unit (FU) increases when small amounts of\nZnO are substituted for MnO in the ferrite MnO-Fe2O3. (10)\nb) Why does the moment per FU then start decreasing when the Zn concentration exceeds about\n50 %? (10)\n\nYour answers should include one sentence about each of the following: cation site types, moment\nper transition metal ion, site selection, the nature of the exchange coupling in this system, and the\nnature of the exchange couple between magnetic species on different or similar sites.\nc) Speculate about why the peak in moment per FU occurs in Ni-Zn-ferrite at a smaller Zn\nconcentration than it does in Mn-Zn-ferrite. (Ans. not in text) (5)\nAns. 2 a) There are two cation sites in the spinel structure, tetrahedral (A) and octahedral\n(B). One cation per FU occupies an A site and two occupy B sites. The different transition\nmetal ions prefer these sites as indicated in the figure. The moments on the ions of interest\nare Fe2+ = 4, Fe3+ = 5, Mn2+ = 5, Zn2+ = 0 and Ni2+ = 2 Bohr magnetons. The exchange\ninteractions are of the antiferromagnetic (AF) superexchange type, i.e. cation moments\ncoupled through the p orbitals of an intervening anion, in this case, oxygen. The exchange\ninteractions, in order of decreasing strength, are A-B, B-B, A-A no interaction.\nMn\nIn MnOFe2O3:\nA\nB\n2+\n2Fe3\n-5\n+10 mB\nnet moment is +5.\nIntroduction of Zn2+ displaces Mn2= from A site to B site, increasing the net\nmoment.\nb) At some Zn concentration, the A-B AF exchange interaction, proportional to\nSB becomes weaker than the B-B AF exchange interaction because of the smallness of\nJA-BSA\nSA. At that point, the B-site moment decreases and the net moment begins to decrease.\nc) In Ni ferrite, the Ni ion occupies the B site with one of the Fe3+ ions; the other Fe3+ is on\nthe A site. The A-B exchange interaction energy is weaker than that in Mn-ferrite because\nof the smaller Ni moment. Thus, it gives way to the antiferromagnetic A-A interaction at a\nlower Zn concentration.\n3. (25) You make some HCP cobalt and some HCP cobalt-rich magnetic alloys. You measure their\nanisotropy constants to be as follows:\nCo:\nKu1 = 4.1 ¥ 105 J/m3, K u2 = 1.5 ¥ 105 J/m3.\nCo-rich alloy A:\nKu1 = -5.0 ¥ 105 J/m3, Ku2 = +5 ¥ 105 J/m3.\nYou data were analyzed using the form fa = K0 + Ku1 sin2q + Ku2 sin4q +....\na) What is the stable direction (in H = 0) of magnetization in the Co? (5)\nb) What is the stable direction (in H = 0) of magnetization in Co-rich alloy A? (show your work)\n(10)\nc)\nIn alloy A, you measure l0001 = +100 ¥ 10-6. Give an expression and a numerical result for\nthe stress along the c axis that is just sufficient to bring M into the base plane (q = 90o).\nIdentify the stress as tensile or compressive. Use (3/2) ls form not Beaa...) (10)\nAns. 3 a) M is stable at q = 0, p,... for Co from the minima in f .\na\nb) For alloy A, see sketch below, right.\n\ndf\nb) In the case of alloy A,\n= 0 = 2Ku1 cosq sinq + 4Ku 2 cosq sin\n3 q . You can\ndq\ndivide by sinqcosq because it is obvious from the figure that it is not zero near\nthe energy minimum. Thus, sin2 q = -Ku1/2Ku2 = 0.5, q = 45o.\nc) Putting q = 45o into fa gives for the depth of the energy well in alloy A fa(45) -\nf (0) = -1.25 ¥ 105 J/m3. Given the positive magnetostriction, it should be clear\na\nthat a compressive stress along the c axis will tend to stabilize M in the base\nplane. The stress energy stabilizing M at q = 90o is (3/2)sl which could be\nc\nequated to fa(45) - fa(0). Thus, s = -1.25 ¥ 105 /(1.5 ¥ 10-4), s = 0.83 ¥ 109\nNm2 =0.83 GPa.\nMore accurately, we should minimize the anisotropy plus magnetoelastic energies\nand get the full solution. We express the angular dependence of the ME energy as\n-(3/2)ls sin2 q because a compressive stress stabilizes q = 90o. Energy\nminimization gives\nE\ncosq\nII sin\n2 q - 3ls - 2Ku1 = 0 .\n4 Ku2\n\nEquating the square bracket term to zero\nshows that the stress dependence of the in-\nplane component of magnetization, namely\nm = sinq, has a zero-stress value of 0.707 as\nwe expect from its 45o equilibrium\norientation. Upon increasing the stress, sinq\nincreases like the square root of s, reaching\nunity (saturation) at\ns = (4Ku2+2Ku1)/(3l) = 3.3 GPa.\n4) (25) On your answer sheet, sketch (as a solid line) the Bloch domain wall profile below which applies for\na material with fa = Ku1 sin2q.\na) Use your knowledge of the equilibrium torque balance at every point in a domain wall to sketch (as a\ndashed line) what happens to the domain wall profile if Ku1 = 0 and Ku2 > 0. Explain in one or two\nsentences. (10).\n\nb) Use order-of magnitude estimates and scaling arguments to determine which defect would have a\ngreater pinning effect on a domain wall in cobalt and why (you'll need to calculate the domain wall\nwidth in Co - use A = 10-11 J/m - and look up a constant in Ch. 7):\ni)\nan interstitial impurity that produces a strain field dropping from e = 1% and extending for\nabout 60 nm about its site,\nor an Fe substitutional defect that has a magnetic moment 30% greater than that of the Co\natom it replaced? (10)\nii) A region about 60 nm in diameter in which the stacking faults changed the cobalt structure to\nFCC (and thereby reduces the magnetocrystalline anisotropy by an order of magnitude in that\nregion) or the stress field above in i). (5)\n∂f\n∂ 2 q\na\nAns. 4. a) The zero torque condition is ∂q = A ∂z\n2 . The second order anisotropy function\nis flatter (smaller slope) at small angles and steeper near 700 than is the first order\nanisotropy function. Therefore, the curvature of the second-order function is greater\nbetween these limits. The shape of the second order anisotropy Bloch wall is suggested by\nthe bold dots on part of the figure above.\nb)Wall width is ddw = p(1¥ 10-11/4.1 ¥ 105)0.5 = 1.5 ¥ 10-8 m.\ni)\nStrain field produces a magnetoelastic defect of approximate strength B1e =\n6 ¥ 106 ¥ 0.01 J/m3 with a range of order 60 nm. In this large fuzzy defect case H\nis proportional to (ddw/D)(DK /K )Ha = (1.5 ¥ 10-8 /6 ¥ 10-8)(6 ¥ 104/4 ¥ 105) =\ns\nu\n0.04H . Fe substitutional defect is smaller than the wall width so H is proportional\na\nc\nto (D/d)(DM/M )Ha = (6 /1.5)(1.3/1)H = 5.3Ha. Fe defect is more potent.\na\nii) Large stacking fault presents an abrupt or sharp defect. The coercivity scales\nwith (DK/K)H and is independent of defect size (Paul model). H is proportional to\na\nc\n(DK/K)H = 0.9Ha, giving a much larger factor than either defect in part i). This is\na\nthe most potent defect.\nSuppl. 2c. The dominant antiferromagnetic A-B exchange goes as JABS A\n.S B. For Mn ferrite and Ni\nferrite, the magnetitude of the sublattice spins go as SA = 5(1-x) in both cases and SB .= 5(2+x) and 5(1+x)\n+ 2(1-x), respectively. We compare the products of the sublattice magnetizations in the two cases and find\nthat after a common term they vary as 25(1-x) for Mn ferrite and 10(1-2x) for Ni ferrite. Clearly, the latter\nis weaker and drops off faster with increasing x than the former. Hence, in Ni-ferrite the AF B-B exchange\nsets in at smaller x than it does in Mn ferrite.\nc"
    },
    {
      "category": "Exam",
      "title": "sample_exam_2002.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/734f489e3cc784aa66e1a021c18bafba_sample_exam_2002.pdf",
      "content": "3.45 Mid-term quiz, 4/11/02\nProblem 1\n1. You want to make an magnetic actuator, that is, a magnetic material\nthat will strain and do work when a magnetic field is applied.\nYou decide to use a rectangular prism of polycrystalline Ni, ls ≈ -34 x 10-6 .\nThe prism measures 2 x 10 x 100 mm; assume a modulus, E = 1011 N/m2.\na) What direction will you apply the field along to get\nthe greatest extension?\nb) What is the shape anisotropy and demagnetizing field\nfor magnetization in that direction?\nc) How does that compare with the anisotropy for\nsingle crystal Ni (K1 ≈ -6 x 103 J/m3?\nd) What field would you design for; how many turns,\nhow much current to achieve this?\ne) Write the expression for the free energy including\nexternal field, anisotropy, magnetostriction\nand an external stress of 100 MPa opposing the\nNi extension. Compare the magnitude of the terms.\nf) Calculate and plot the field dependence of magnetization.\ng) Calculate and plot the field dependence of the strain.\n2 mm.\n10 mm.\n100 mm.\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nProblem 2\n2. You have a process for making nanoscale magnetic particles with typical aspect ratios of 5:1.\nYou want to make some very small but thermally stable particles.\na)\nDescribe quantitatively your considerations in choosing between Fe0.6Co0.4 and Co\nassuming you could make either of these compositions with [001] crystal direction\nalong the long particle axis. Consider the following:\ni) Crystal structure, ii) magnetocrystalline anisotropy, iii) shape (magnetostatic) anisotropy,\niv) single domain particle size, and v) superparamagnetic limit at lab time scales (1 sec).\nb) If the particles were superparamagnetic, compare the susceptibility of particles of the two\ncompositions having the same shape and volume.\nFe0.6Co0.4 or Co\n≈10 nm\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 1\na) What direction will you apply the field along to get\nthe greatest extension?\nH\nLargest extension will be in longest direction.The easiest\ndirection to magnetize in to achieve this is the next longest direction,\ny = 10 mm. The free elongation in y is l x 100 mm = -3.4 microns,\nwhile x and z dimensions extend out by 1.7 microns each.\nb) What is the demagnetizing field and shape anisotropy\nfor magnetization in that direction?\nEqs. 2.22 and 2.23 indicate Ny ≈2t/(p x 10) = 0.13 and\nN ≈2t/(p x 100) = 0.013. The demagnetizing field is\nz\nHdemag ≈-Ny Ms = 61 kA/m (less than 760 Oe). The shape anisotropy is,\ntherefore Kshape ≈-m0 Ms(H - Hz)demag/2 = m0(N - Nz)M 2 /2 = 17 kJ/m3\ny\ny\ns\ne\ny\nz\n(using m0Ms = 0.6 T for Ni).\nx\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 1\nc) How does that compare with the anisotropy for single crystal Ni, K1 ≈ -6 x 103 J/m3?\nThe shape anisotropy, 1.7 x 104 J/m3, is greater than the crystal anisotropy\n(which in turn is greater than the anisotropy of the polycrystallne Ni). So shape dominates\nthe magnetization process.\nd) What field would you design for; how many turns,\nhow much current to achieve this?\nH\ne\nI would design for at least 1 kOe (80 kA/m) applied along y.\nTwo air coils of rectangular shape as pictured right,\ncould suffice if heating is not a problem. Otherwise you\nwill need a soft iron core, fewer turns at the cost of more weight.\nA first guess at the Ampere-turns needed to generate the field\nwould be from the field at the center of a circular loop\nhaving the same circumference as the loops at right.\nThis gives H ≈ NI/0.2. Thus, to get 80 kA/m would require 16 Amps\nthrough about 1000 turns. A more careful calculation would involve piecewise consideration of field\nfrom the different legs of the rectangular loop.\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 1\ne) Write the expression for the free energy including\nexternal field, anisotropy, magnetostriction\nM\nand an external stress of 100 MPa opposing the\nq\nNi extension. Compare the magnitude of the terms.\nH\nz\nf\n= -m0 M H cosq + 1 m0 DNM cos\n2 q + B1(e a + cycl)\nmag\ns\nx\nx\ns\ny\nx\nAssume the magnetization has no component along x the ME term is\ne\n\nB1(e a\n2 + cycl) = - 3 l\nE E\nI(e + u |s |)cos\n2 q + (-ey - |s |)(1- cos\n2 q) = - 3 l E 3E\ne + |s | cos\n2 q\nx\nx\ns\ny\ny\n\n1+u I\nE\nE\n\nsII2(1+u)\n\n3E\nfmag = -m0 M H cosq + [ m0DNM\n2 - 3 ls{2(1 +u) e + | s |}]cos\n2 q\ns\ny\ns\nCheck that each of these terms makes the energy change in proper direction as field and stress change.\nThe shape anisotropy was calculated to be 17 kJ/m3, the magnetostrictive anisotropy is about\n-(34 x 10-6)2 x 1011 ≈ 0.12 kJ/m3 and the external stress anisotropy is of order\n1.5 x 34 x 10-6 x 108 ≈5 kJ/m3. The shape and external stress anisotropies govern M(H).\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 1\nf) Calculate and plot the field dependence of magnetization.\nWe know the solution to\n3E\nf\n= -m0 M H cosq + K cos\n2 q = -m M H cosq + [1 m0DNM\n2 -\nl {2(1 +u) ey + |s |}]cos\n2 q\nmag\ns\ns\ns\ns\nis cosq = m = h but now K , the term in [ ], is influenced by the shape and external stress.\n2K\nE\n3E\n\nMs\nHa = m0 M = 2\nIIm0 DNMs\n2 - 2\n3 ls{2(1+ u) ey + |s |}\n/(m0 Ms )\nM = H a\nH\nM\ns\nMs\nWith l < 0, increased stress makes it harder to saturate.\ns\ng) Calculate and plot the field dependence of the strain.\nHa\nH\nTo calculate the actual strain, you need to add an elastic energy term, (1/2)Eey\n2, to f.\nThe total energy density can be simplified using cosq = h = H/H = m M H/2K so m M H = 2Kh:\na\no\ns\no\ns\n3E\nf\n= -m0 M H cosq + [2 m0DNMs\n2 - 3 l {\ney + |s |}]cos\n2 q\nmag\ns\ns 2(1 +u)\nfmag+ elast = -Kh\n2 + 1 Ee\ny\n-2Kh\nh\n+K\nh2\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 1\nWhen taking derivative of f with respect to strain, keep in mind that h = H/H is also a function of strain.\na\nm0 M H 9 l E\ns\ns\n∂h\n\n+ u\nm 0M 9 l E H\n9l E\nh\ns\ns\ns\n=\n2 =\n=\n\n+u K\n4(1 +u) K\n∂ey\nII\nEm 0DNMs\n2 - 3 l {\n3E\ney + | s |}\ns 2(1 +u)\n\nSo\n∂f\n∂h\n= 0 = -2Kh\n+ Ee\n∂e\n∂e\ny\ny\ny\ney (10-6)\ns = 100 MPa\ns = 500 MPa\nH\n(kA/m)\n2 Kh ∂h\n9ls\nh\ne =\n=\ny\nE ∂e\n2(1+ u)\ny\ne = - e y = -\n9ls\nh\n2 > 0\nz\n4(1 +u)\n2(1+ u)ey\nPlot\nH = H (ey )\na\n9ls\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 2\n2. You have a process for making nanoscale magnetic particles with typical aspect ratios of 5:1.\nYou want to make some very small but thermally stable particles.\na)\nDescribe quantitatively your considerations in choosing between Fe0.7\nand Co\nCo0.3\nassuming you could make either of these compositions with [001] crystal direction\nalong the long particle axis:\ni) Crystal structure\nFe-Co alloys have BCC structure up to abut 90% Co. Co is hexagonal except when impure or\nprocessed by non-equilibrium methods, in which case it is usually FCC.\nFe0.6Co0.4 or Co\nii) magnetocrystalline anisotropy: 70% Fe-Co has K1 = +3.5 x 104 J/m3 (easy <100>) whereas\nCo has K = +4.1 x 105 J/m3 with an easy c axis. Based on magnetocrystalline anisotropy,\nu\nHCP Co would be more thermally stable, (as also would be FCC Co, K1 = -1.2 x 105 J/m3).\niii) shape (magnetostatic) anisotropy: 70% Fe-Co has m0M ≈ 2.4 T, m0M 2 = 4.6 x 106 kJ/m3,\ns\ns\nwhereas Co has m0Ms = 1.7 T, m0M 2 = 2.3 x 106 kJ/m3. Based on magnetostatic energy in a\ns\nlow-symmetry particle, Fe-Co would be more thermally stable.\nA prolate ellipsoid with a 5:1 aspect ratio has demagnetizing factors given by Eqs. 2.17 and 18\nN|| ≈ 0.056 and N\n≈ 0.50 so m0(Nperp - N||)Ms\n2 /2 = 1.02 and 0.51 MJ/m3 for Fe-Co and Co,\nperp\nrespectively. The net of crystal and shape anisotropies are 1.06, 0.92 and 0.63 MJ/m3 for Fe-Co,\nHCP and FCC Co, respectively. Slight advantage for Fe-Co in net anisotropy.\n(One might want to consider the strong tendency of iron to oxidize, weakening its magnetostatic energy,\nand the tendency of Co to oxidize to an antiferromagnetic layer that actually promotes anisotropy.)\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 2\niv) single-domain particle size,\nAssuming A = 10-11 J/m for both of these high TC materials, the superparamagnetic limit for a\nlow-anisotropy, spherical particle is:\n9A E E 2rc ˆ\nThis gives for Fe-Co and Co particles,\nr =\nm0 M\n2 Iln\n-1\nc\ns I E a\n\nrespectively rc = 4.4 and 6.2 nm ignoring the ln term (iteration shows very slow convergence).\nFig. 8.24 on the other hand gives rc = 22 and 31 nm, respectively. These values are more accurate.\nBut does Eq. 8.32 apply to prolate ellipsoids? No! Consider how it is derived.\nWhat exchange energy is weighed against what magnetostatic energy in a sphere?\n3A E E 2R ˆ\n\nf\n=\nIlnA\n-1\nex\nR\n2 I E a\n\nm0 NzM 2 /2 = (1/6)m0M\ns\ns\nBut for a prolate ellipsoid, the magnetostatic energy driving domain formation\nis reduced by the much smaller demag factor, N|| = 0.056. The exchange energy\ncost for magnetization curling around the small waist (b = a/5) is much larger.\nSo the single-domain particle size (volume) for a prolate ellipsoid is much larger\nthan that for a sphere. In fact the ellipsoid may demagnetize by the \"domino\"\nmechanism shown at right (smaller number of atoms at high exchange energy).\nSpring term, 2002\nMagnetic Materials 3.45\n\n3.45 Mid-term quiz, 4/11/02\nSolution 2\n1s a\nEA6 kBT ˆ\n1/ 3\nv) superparamagnetic limit at lab time scales (1 sec).\nr0\n\na 3 nm\nE K\nu\nMore exactly, 2.9, 3.0, and 3.4 nm for FeCo, HCP Co and FCC Co, respectively. To make stable\nparticles you would want an ellipsoidal volume at least equal to that of a sphere of radius 4 nm.\nThat corresponds to particles having semi-minor and semi-major axes of about 2.7 and 13 nm,\nrespectively.\nb) If the particles were superparamagnetic, compare the susceptibility of particles of the two\ncompositions having the same shape and volume.\nThe magnetization vs. temperature in superparamagnetic particles is described by the Langevin\n(classical) form of paramagnetism because the moment of the particle is so large, the energy states\nare close together. The susceptibility is proportional to the square of the particle moment:\nm 2 N m0\n(Nmm )2 Nvm0\nm\nv\ncclassical = 2\n=\nc\nFe-Co\n3kBT\n3kBT\nHere N is the number of moments per particle (assumed\nM\nCo\nthe same in particles of either composition), but the moment\nfor FeCo is greater than that for Co by the ratio 2.4/1.7 so\nthe former has about twice the susceptibility of the latter.\nH\nSpring term, 2002\nMagnetic Materials 3.45"
    },
    {
      "category": "Resource",
      "title": "2004_withsoln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/a3c1fbb21a19195534626ffce2fdcc36_2004_withsoln.pdf",
      "content": "3.45 Quiz, Spring 2004\nApril 8, 2004\n3.45 Quiz, Spring 2004\nNAME\nI. M. Magnetician\nApril 8, 2004\n(Answer questions on this sheet of paper)\n1. a) Draw in briefly (1phrase) describe the direction of the magnetic field about the\ninfinitely long, current- carrying wire below.\nb) What is the magnitude (and units) of the H field at a distance of 1 cm from the\nwire if I = 6.3 Ampere.\nANS:\n\nH\nI\nR\nH\n=\n=\n×\n=\n6 3\n6 28\n0 01\n1 25\nπ\n.\n.\n.\n( .\n)\nA\nm\nA\nm\nOe\nor\nB\nI\nr\nB\n=\n=\n×\n×\n×\n=\n×\n-\n-\nμ\nπ\n1 25 10\n6 3\n1 25 10\n.\n.\n.\nA\n6.28\n0.01m\nT (1.25Oe)\n2. Given the permanently magnetized sample shown below left, with no external field,\nsketch at right the form of the H field inside and outside the sample.\nANS:\n3. You measure the susceptibility vs. temperature in an unknown sample, getting the\nresults shown below. Describe the type(s) of magnetism responsible for this data and\nindicate where they contribute to the data.\nI\nM\nANS: H or B field circular in right-hand\nsense about I .\nor Field is counterclockwise when current\nflows toward viewers.\n\n3.45 Quiz, Spring 2004\nApril 8, 2004\nANS:\n4. a) What is the mathematical form for the potential energy of a\nmagnetic moment in a uniform magnetic field shown at right?\nb) If the moment is free to rotate, would its first motion (in\npicoseconds) be into or out of the plane of the paper?\nANS:\na) u\nH\nH\nm\nm\n= -\n⋅\n= -\nr\nr\nμ\nμ\nθ\ncos\nb) rωL\ne\nm B\n= + 2\n; right hand rule says moment rotates into the plane first.\n5. a) What would you expect the magnitude of the magnetic moment to be on the A\n(tetragonal) and B (octahedral) sites in FeO⋅Fe2O3 (atomic No. of Fe is 26) (an\ninverse spinel).\nANS:\nA (tet)\nB (oct)\nFe3+ 3d5 ⇒ μ\nμ\nm\nB\n= 5\nFe3+\nFe3+, Fe2+\nFe2+ 3d6 ⇒ μ\nμ\nm\nB\n= 4\nμ\nμ\nm\nB\n= 5\n↓\n5, 4μB ↑\nb) What is the magnitude of the net moment per formula unit?\nB\nA\nFormula unit\nB\nB\nB\n(\n)\n/\n+\n-\n=\nμ\nμ\nμ\n6. Sketch the molecular orbitals and describe briefly how the magnetic moments on two\ntransition metal ion sites couple magnetically if they are separated by an oxygen ion\nbetween them.\nχ\n+10-5\n-10-5\nμm\nH\nParamagnetism χ = C\nT\nplus\nDiamagnetism χ\nμ\n= -\n∑\nne\nr\nm\n\n3.45 Quiz, Spring 2004\nApril 8, 2004\nANS:\nOxygen -2 p orbital has 2 opposite-spin electrons,\none near each Mn2+ ion. These electrons occasionally\njump to empty states on the closest Mn2+ ion,\ninsuring that the net spin on one Mn2+ (3d5) is\nopposite that of the other Mn2+\n7. What would you expect to happen to the strength and form of the magnetic anisotropy\nof hexagonal cobalt metal if it were processed to solidify in the face-centered cubic\nphase?\nANS: Strength would decrease because crystal symmetry of FCC is higher than that\nof HCP .\nForm of symmetry changes from uniaxial to cubic.\n8. Given the magnetic anisotropy data for FCC Ni-Fe alloys shown below, and\nassuming the same defect distribution in two polycrystalline alloys having\ncompositions Fe60Ni40 and Fe40Ni60,\na) Which of them would be easier to\nsaturate with an applied field?\nb) Which one would you expect to show a\nlower coercivity?\nANS:\na) Fe40Ni60 has lower K1\n∴ lower Ha, easier to saturate.\nb) lower Ha puts a lower upper-limit on\nH\nH D\nx\nx\nC\na\n∝\nδ (\n...)\n∆\nso Fe40Ni60 should have lower HC\n9. Both of the alloys in question 8 have positive magnetostriction, will it be easier or\nharder to saturate them if a tensile stress is applied to the sample parallel to the field\ndirection?\nO 2-\nMn2+\nMn2+\n\n3.45 Quiz, Spring 2004\nApril 8, 2004\nANS: λ > 0 implies M tends to align with tensile direction.\n\nTherefore, stress helps field, easier to saturate.\n10. Is it easier to saturate the uniaxial anisotropy sample shown below with a field\napplied in direction (1) or (2)?\nANS: Stoner Wohlfarth curves show for case (1) saturation occurs\nat H =Ha but for case (2) (θ < 90) you can never truly saturate.\nEasier to saturate in case (1)\n11. Describe what is going on in the data below for a group of small magnetic particles\n(label each solid line of the data).\nANS:\nFor T > T0 , the material is either paramagnetic\nor super-paramagnetic. The data for T < T0\nindicate that it must be super-paramagnetic for\nT > T0 because spin freezing or blocking\noccurs below T\nKV\nkB\n∝\n. Zero-field cooled\n(ZFC) particles freeze with random spins, decreasing susceptibility with T; field\ncooled (FC) particles freeze with spins along the easy axes most parallel to H.\n12. Which material would probably have a narrower 180° domain wall thickness, hcp Co\n(Ku ≈ 5 × 105 J/m3,) or Fe (Ku ≈ 4 × 104 J/m3,)?\nANS:\nδ ∝\nA\nKu\nso cobalt has narrower domain wall. (even through Fe is cubic its domain\nwall is still governed by same eq.)\n13. a) Given a uniaxial magnetic material Ku ≈ 104 J/m3, μ0 Ms ≈ 1T, derive the equation\nfor magnetization in a field applied perpendicular to the easy axis. (Define θ as the\nangle between H and M.)\nANS:\nE.A.\nH\n(1)\nH\n(2)\nT\nχ\nT0\nsuper-\nparamagnetic\nZFC\nFC\n\n3.45 Quiz, Spring 2004\nApril 8, 2004\nANS: Fig. same as in problem 10, H(1)\n\ng\nM H\nK\ng\nM H\nK\nM\nM\nM\nK\nH\ns\nu\ns\nu\ns\ns\nu\n= -\n+\n′ =\n=\n-\n=\n=\nμ\nθ\nθ\nμ\nθ\nθ\nθ\nθ\nμ\ncos\ncos\nsin\nsin cos\ncos (\n)\n(÷sinθ)\nwritten as M\nM\nH\nH\ns\na\n=\nwith H\nK\nM\na\nu\ns\n= 2\n/μ\nor as m = h\nb) At what field value would you expect M to be saturated?\n\nANS:\nM saturates at H\nH\nK\nM\na\nu\ns\n=\n=\n=\n×\n=\n×\n2 10\n2 10\nμ\nA\nm\nOe\n(\n)"
    },
    {
      "category": "Resource",
      "title": "diego_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/185873b9aeeeb97ef06ad68c837e742d_diego_slides.pdf",
      "content": "The Fe-Pt system for\nThe Fe-Pt system for\nperpendicular magnetic\nperpendicular magnetic\nrecording.\nrecording.\nDiego\nDiego A.\nA. M\nMeendez de la Luz\nndez de la Luz\nMay 11, 2004\nMay 11, 2004\nMagnetic\nMagnetic Recording\nRecording\nGrowth\nGrowth rate\nrate 40%\n40%/year\n/year\nContinuous\nContinuous\ndonwscaling\ndonwscaling\nPrice\nPrice per\nper megabyte\nmegabyte\n$200 in 1980\n$200 in 1980\n$0.02 in 2004\n$0.02 in 2004\nToday:\nToday:\n70 Gbit/in\n70 Gbit/in22 in market\nin market\n150 Gbit/in\n150 Gbit/in22 in lab\nin lab\nNeed for high density\nNeed for high density\n\nThe Goal: 1Tbit/in\nThe Goal: 1Tbit/in22\nIndustry\nIndustry''s goal:\ns goal:\nKeep on improving areal density with\nKeep on improving areal density with\nminimum changes in technology\nminimum changes in technology\nPossible in theory\nPossible in theory\nProblems:\nProblems:\nSignal to Noise Ratio (SNR)\nSignal to Noise Ratio (SNR)\nSuperparamagnetic Limit\nSuperparamagnetic Limit\nChallenges\nChallenges\nSignal to Noise Ratio\nSignal to Noise Ratio\nInherent to polycrystalline\nInherent to polycrystalline\nmedia\nmedia\nReduction of recording bit\nReduction of recording bit\nneeds to be accompanied\nneeds to be accompanied\nby reduction in particles\nby reduction in particles\nsize (grains)\nsize (grains)\nReduction in grain size\nReduction in grain size\n\n= reduction in volume\n= reduction in volume\n\nChallenges\nChallenges\nSuperparamagnetic Limit\nSuperparamagnetic Limit\nThermally activated\nThermally activated\nEnergy barrier:\nEnergy barrier: KKuuVV\n((\"\"Magnetic Hardness\nMagnetic Hardness\"\"))\nReduction in\nReduction in VV needs\nneeds\nincrease in\nincrease in KKuu\n~10 nm on today\n~10 nm on today''s media\ns media\n\n⋅\n=\nkT\nV\nKu\ne\nf\nP\nWhy FePt?\nWhy FePt?\n3.5\n4.5 x 107\nNd2Fe14B\n7 x 107\nFePt\n4.9\n1.7 x 107\nCoPt\n7.5\n4.6 x 106\nCo\nDp\n[nm]\nTc\n[K]\nMs\n[emu/cm3]\nKu\n[erg/cm3]\nMaterial\nMagnetically significant parameters for different alloy systems\nFePt: large K\nFePt: large Kuu\nTTcc can allow for Heat Assisted Magnetic Recording\ncan allow for Heat Assisted Magnetic Recording\nSmall superparamagnetic particle size (\nSmall superparamagnetic particle size (DDpp))\nCorrosion Resistant\nCorrosion Resistant\n\nFe-Pt\nFe-Pt\nPhases\nPhases\n__11, L1\n, L122 Fe3Pt\nFe3Pt\n__33, L1\n, L122 FePt3\nFePt3\n__22, L1\n, L100 FePt\nFePt\nFace Centered\nFace Centered\nTetragonal\nTetragonal\nL1\nL100 FePt\nFePt\nLayered structure\nLayered structure\nUniaxial anisotropy\nUniaxial anisotropy\nFePt\nFePt\n(BH)\n(BH)MAX\nMAX product\nproduct\n__22, L1\n, L100 FePt: 24kJ/m\nFePt: 24kJ/m33\n__11, L1\n, L122 Fe3Pt: 160 kJ/m\nFe3Pt: 160 kJ/m33\nDifficult to achieve ordering\nDifficult to achieve ordering\nOrdering parameter S\nOrdering parameter S\n____: Fraction of Fe atoms in\n: Fraction of Fe atoms in __ sites\nsites\n__Fe\nFe:: Concentration of Fe\nConcentration of Fe\n____: Fraction of Fe atoms in\n: Fraction of Fe atoms in __ sites\nsites\n__Pt\nPt: Concentration of Pt\n: Concentration of Pt\n)\n(\n)\n(\nPt\nFe\nS\nχ\nγ\nχ\nγ\nβ\nα\n-\n=\n-\n=\n\nFePt MBE Deposition\nFePt MBE Deposition\nMolecular Beam Epitaxy\nMolecular Beam Epitaxy\n\nAchieve (001) growth:\nAchieve (001) growth:\nMgO\nMgO or Al\nor Al22O\nO33 + Pt buffer layer\n+ Pt buffer layer\n\nMonoatomic layer deposition\nMonoatomic layer deposition\n\nHeated substrate\nHeated substrate\n\nLong deposition time\nLong deposition time\nFePt Electrodeposition\nFePt Electrodeposition\nElectrodeposition\nElectrodeposition\n\nSimultaneous: Fe + Pt\nSimultaneous: Fe + Pt\n\nExcellent surface finish*\nExcellent surface finish*\n\nHHcc: 10% of normal value\n: 10% of normal value\n\nKKuu: almost non-existing\n: almost non-existing\n\nFePt Magnetron Sputtering\nFePt Magnetron Sputtering\nMagnetron Sputtering\nMagnetron Sputtering\n\nMonoatomic layer deposition\nMonoatomic layer deposition\n\nLow substrate temperatures\nLow substrate temperatures\n\nRequires post-deposition ordering\nRequires post-deposition ordering\nFePt High Pressure Sputtering\nFePt High Pressure Sputtering\nHigh Pressure Sputtering\nHigh Pressure Sputtering\nAr\nAr pressure controls incident atom energy\npressure controls incident atom energy\nAr\nAr inclusions promote ordering\ninclusions promote ordering\nAr\nAr inclusions increase\ninclusions increase cc\nAr\nAr atoms pin domain wall motion and increase\natoms pin domain wall motion and increase HHcc\n3.722\n3.722\n1.9 x 10\n1.9 x 107\n0.5\n0.5\n3.727\n3.727\n1.9 x 10\n1.9 x 107\n0.6\n0.6\n5.1\n5.1\n3.744\n3.744\n5.6 x 10\n5.6 x 106\n0.3\n0.3\n1.3\n1.3\n3.712\n3.712\n7 x 10\n7 x 107\n(bulk)\n(bulk)\ncc\n[nm]\n[nm]\nHc\nHc_\n[[Oe\nOe]]\nKu\nKu\n[erg/cm3]\n[erg/cm3]\nSS\nPPAr\nAr\n[[Torr\nTorr]]\nMagnetic properties and structural parameter of L1\nMagnetic properties and structural parameter of L10 ordered [Fe(1ML)/Pt(1ML)] films Ts=300\nordered [Fe(1ML)/Pt(1ML)] films Ts=300°°C.\nC.\n\nFePt Co-sputtering\nFePt Co-sputtering\nFe & Pt co-sputtering\nFe & Pt co-sputtering\n\nFurther simplified process\nFurther simplified process\n\nKKuu ~ 1 x 10\n~ 1 x 1077 erg/cm\nerg/cm33\n\nNot ordered\nNot ordered\n\nRequires heated substrate\nRequires heated substrate\nFePt +\nFePt + dopant\ndopant co-sputtering\nco-sputtering\nDopant\nDopant: Usually Cu, C, Al\n: Usually Cu, C, Al\nAgglomeration at grain boundaries\nAgglomeration at grain boundaries\nPrevents grain growth\nPrevents grain growth\nInhibits exchange between grains\nInhibits exchange between grains\nCan make ordering more difficult\nCan make ordering more difficult\n\nPost-deposition processing\nPost-deposition processing\nFrom Phase diagram:\nFrom Phase diagram:\nFePt is FCT at room temperature\nFePt is FCT at room temperature\nTransformation temperature is ~1300\nTransformation temperature is ~1300 °°CC\nBUT:\nBUT:\nslow cooling can lead to large grain size\nslow cooling can lead to large grain size\nSO:\nSO:\nDeposition has to occur at low temperatures\nDeposition has to occur at low temperatures\nLow-temperature post-processing is required\nLow-temperature post-processing is required\nFePt annealing\nFePt annealing\nPossible at ~350\nPossible at ~350 °°CC\nLong time required\nLong time required\nLarge grains\nLarge grains\nFaster at ~550\nFaster at ~550 °°CC\n5-600 s required\n5-600 s required\nSmall grains ~8-10nm\nSmall grains ~8-10nm\nMost effective in\nMost effective in\nMultilayer Films\nMultilayer Films\nCan get bad results\nCan get bad results\n\nFePt Ion Irradiation\nFePt Ion Irradiation\nIncreased diffusivity\nIncreased diffusivity\nExcess point defects\nExcess point defects\nintroduced\nintroduced\nLocal heating\nLocal heating\nEffective ordering at\nEffective ordering at\nonly ~230\nonly ~230 °°CC\nMagnetic patterning\nMagnetic patterning\npossible\npossible\nSummary\nSummary\nDeposition\nDeposition\nMBE:\nMBE:\n\nExcellent results\nExcellent results\n\nHigh temperature\nHigh temperature\nElectrodeposition\nElectrodeposition\n\nSimple\nSimple\n\nBad results\nBad results\nSputtering\nSputtering\n\nGood results\nGood results\n\nLow temperature\nLow temperature\n\nRequires post-\nRequires post-\nprocessing\nprocessing\nPost-processing\nPost-processing\nAnnealing\nAnnealing\n\nGood Results\nGood Results\n\nHigh temperature\nHigh temperature\nIon Irradiation\nIon Irradiation\n\nGood results\nGood results\n\nLow temperature\nLow temperature"
    },
    {
      "category": "Resource",
      "title": "lirong_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/ca16657d97addbcc1e181b7e91b2179c_lirong_paper.pdf",
      "content": "3.45 Term Paper\nHow to Measure Degree of Spin Polarization\nBy Lirong Zeng\n\nIntroduction\n\n1.1 Significance of spin polarization measurement\n\nSpintronics is an emerging field of research combining two traditional branches of\nphysics: magnetism and electronics. It is based on the ability of ferromagnetic materials\nto conduct spin-polarized currents. The effectiveness of spintronics depends on the extent\nto which a current is spin-polarized [1], which in turn depends on the spin polarization of\nthe ferromagnetic materials. All device designs improve their performance as the spin\npolarization P approaches 100%. High degree of spin polarization P is especially\nimportant for spin injection experiments where one wants to inject spin polarized current\nfrom a ferromagnetic material to a nonmagnetic metal or semiconductor. The P of the\nsource material sets an upper limit to the injection efficiency. Therefore, for both\nscientific and technological reasons, it is important to be able to measure the degree of\nspin polarization of a candidate material easily and accurately. This paper introduces four\nimportant techniques to measure P, namely spin-resolved photoemission spectroscopy,\nspin-polarized tunneling in a ferromagnet /insulator/superconductor (FM/I/S) tunnel\njunction (the Tedrow-Meservy method), measuring tunneling magnetoresistance in a\nferromagnet 1/insulator/ferromagnet 2 (FM1/I/FM2) junction, and then calculating P\nthrough Julliere's model, and finally, Andreev reflection in a superconducting point\ncontact,. For each method, its principle, experimental setup, relative advantages and\ndisadvantages are discussed.\n\n1.2 Different definitions of spin polarization\n\nGiven the growing number of experiments probing P, it becomes increasingly important\nto calculate P within the framework of the conventional band theory (and eventually\nbeyond it). Spin polarization can be defined in several different ways [2], including, but\nnot limited to, \"N\"-definition, \"Nv2\"-definition and \"Nv\"-definition. In order to compare\ncalculations with the experimental data, it is crucial to make sure that a proper definition\nof P is used.\n\nThe most natural and popular definition is\n\n↓\n↑\n↓\n↑\n+\n-\n=\nN\nN\nN\nN\nP\n(1)\nwhere\nis the density of electronic states (DOS) at the Fermi level, defined as (h/2π is\ntaken as 1)\n↓\n↑,\nN\n\n∑∫\n∑∫\n=\n=\nα\nα\nα\nα\nπ\nδ\nπ\ni\nK\nF\ni\nK\ni\nv\ndS\nk\nd\nE\nN\n)\n(\n)\n(\n)\n(\n(2)\n\nand\nis the energy (velocity) of an electron in the band\ni\nK\nv\nE\nα\n)\n(\nα with spin i (\n) and\nthe wave vector K. This definition of P may be called the \"N\"-definition. A typical\nexperiment that can probe PN is spin-polarized photoemission. For transport\nmeasurements, however, the usefulness of PN is limited by the fact that usually the\ntransport phenomena are not defined by the DOS alone. This is especially true for\nmaterials that have both heavy d-electrons and light s-electrons at the Fermi level (e.g.\nNi). In such materials, while the DOS is mostly defined by the heavy d-electrons, the\nelectric transport is primarily due to the fast s-electrons.\n↓\n↑or\n\nClassical Bloch-Boltzmann transport theory can separate the currents of the spin-up\nelectrons and spin-down electrons, and define P via the current densities\n. Since\n∝\n)\n(↓\n↑\nJ\n)\n(↓\n↑\nJ\n)\n(\n)\n(\n↓\n↑\n↓\n↑\nτ\nNv\n, assuming the same relaxation time τ for both spins, we arrive in\nthe \"Nv2\"-definition:\n\n↓\n↑\n↓\n↑\n↓\n↑\n↓\n↑\n+\n-\n=\n+\n-\n=\nNv\nNv\nNv\nNv\nJ\nJ\nJ\nJ\nPNv\n(3)\nWhere\n)\n(\n↓\n↑\nNv\nis defined as\n∑∫\n∑∫\n=\n=\nα\nα\nα\nα\nα\nπ\nδ\nπ\nF\ni\nK\ni\nK\ni\nK\ni\ndS\nv\nk\nd\nE\nv\nNv\n)\n(\n)\n(\n)\n(\n(4)\n\nUnfortunately, it is hardly possibly to measure\nand\nseparately. A typical\nexperiment involves spin-polarized tunneling between a FM and another material. Spin-\npolarized tunneling is an imbalance in the electric current carried by up- and down-spin\nelectrons tunneling from a ferromagnet through an insulating barrier. Particularly, one\ncan measure tunneling currents separately for both spin polarizations for a\nferromagnet/superconductor contact.\n↑\nJ\n↓\nJ\n\nAnother definition similar to PNv\n2 is the ballistic definition PNv, which is applicable to low\nresistance ballistic contacts. Note that the Nv2-definition is actually the same as the\ndefinition for the spin polarization of a current\n\n↓\n↑\n↓\n↑\n↓\n↑\n↓\n↑\n+\n-\n=\n+\n-\n=\nI\nI\nI\nI\nG\nG\nG\nG\np\n(5)\n\n1.3 What determines P\n\nIt is obvious that for the most popular N-definition, the electronic structure at the Fermi\nlevel determines P. A typical transition metal has two components to its electronic\nstructure: narrow d bands that may be fully or partially spin-polarized because of the on-\nsite exchange energy, and broad s bands with a lesser degree of spin polarization due to s-\nd hybridization. Specifically P is controlled by the extent to which these s and d bands\ncross the Fermi surface [1]. If the orbital character of at the Fermi surface is mainly d-like,\nthen P will be high. On the other hand, if the orbital character is s-like or s-d-hybridized,\nthen P can be low or high depending on the details of the electronic structure. For\n\ndifferent materials, not only the magnitude of P can vary greatly, the sign of P can be\npositive or negative.\n\nMethods to measure degree of spin polarization\n\nMeasuring P requires a spectroscopic technique that can discriminate between the spin-up\nand spin-down electrons near EF. Four methods to measure P are discussed below, among\nwhich the Tedrow-Meservy method is reviewed in most detail because of its wide use\nand high energy resolution.\n\n2.1 Spin-resolved photoelectron spectroscopy\n\nSpin-resolved photoelectron spectroscopy is technically capable of providing the most\ndirect measurement of P. The first photoemission experiment to observe spin-polarized\nelectrons was conducted on Gd by Busch et al in 1969 [3]. However, in addition to very\ncomplicated experimental setup, its energy resolution is hundreds of milli-eV, which is\nfar less than the necessary energy resolution (~1meV) [1].\n\n2.1.1 Principle\n\nAlthough sometimes ambiguously called spin-resolved photoemission, no photons are\nemitted in this technique, rather, the \"photoemission\" actually means photon-induced\nelectron emission. Photoemission may be viewed as a scattering phenomenon by a\nsurface system [4] with (monochromatic) electromagnetic radiation (i.e. photons of\nenergy hν , momentum (h/2π)\n, and a polarization described by the electric field vector\n→\nq\n→\nE ) in the input channel and electrons (of energy E <hν , momentum (h/2π)k and the\nspin polarization vector\n→\nP ) in the output channel. Fig. 1 depicts the basic mechanism\n\"inside\" the system. The photon imparts its energy hν to an electron of energy E1<EF,\nexciting it into a previously empty state of energy E2>Evac. The current associated with\nthe extension of the state E2 into the vacuum region is then detected as the \"photo-\ncurrent\". When the energy of the incident photon is close to the work function of the\nferromagnetic metal, only the electrons near the Fermi energy can overcome the vacuum\nbarrier, and they have also to travel perpendicular to the surface in order to escape into\nthe vaccum. Thus with photon energy close to the photothreshold, the initial\nphotoemission state is well-defined.\n\nThe dependence of the photoelectron current on the energy, direction and polarization of\nthe incident electro-magnetic radiation, and on the energy and direction of the emitted\nelectrons provides most extensive information on the electronic structure both of the\n\"bulk\" solid and of the surface region. Furthermore, by analyzing the spin orientation of\nthe emitted electrons, further and unique insights into the electronic structure of solids\nand into the photoemission process can be obtained. Spin-polarized photoelectrons can\nbe associated with initial states which have a preferential spin orientation, i.e. the ground\nstate of the system exhibits long-range magnetic order, or associated with spin-orbit\n\ninteraction in the initial or the final state (without requiring a direct coupling of the\nelectron spin to the radiation field).\n\nFig. 2 Schematic of an apparatus for spin-\nresolved photoemission\n\nFig. 1 Schematic representation of the (valance\nband) photoemission process (involving the\nfilled vertical line) and its inverse (involving\nthe empty vertical line) in an energy level\ndiagram in the surface region. Vor is the real\npart of the effective potential, and the hatched\narea indicates the occupied levels (below EF).\n\n2.1.2 Experimental technique\n\n2.1.2.1 Sample preparation\n\nFerromagnetic samples can be used in their remanent state. To obtain high remanence,\nthe samples have to be shaped suitably with a small demagnetization factor, e.g. thin\nplates or evaporated films. This kind of samples can be magnetically saturated by\napplying a short magnetic field pulse of about 200 Oe from a small unsupported coil of a\nfew windings.\n\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\n\nBecause of the surface sensitivity, the samples have to be atomically clean during the\nphotoemission experiment. Therefore, the apparatus has to be equipped with a surface\npreparation stage that consists generally of an ion-etching facility and a LEED-Auger\nsystem for examining the surface conditions.\n\n2.1.2.2 Light source\n\nUltraviolet resonance lamps and monochromatized synchrotron radiation in the energy\nrange of 20 to 70 eV or higher can be used as light sources. Due to the tunability and\ncleanliness (the light emerges from ultrahigh vacuum system), synchrotron radiation is\nbest suited for studying the band dispersions of the highly reactive transition metal\nsurfaces. Energy resolutions of several hundred eV and angle resolution of about\nare\nachieved.\nο3\n±\n\n2.1.2.3 Detector\n\nA conventional photoelectron spectrometer can be used for energy and angle analysis.\nSpin analysis can be done in different ways. For photoemission from ferromagnetic\nmaterials, the Mott detector has been employed. It requires to accelerate the electrons to\nabout 100 keV before scattering on a thin gold foil. Due to spin-orbit coupling, a left-\nright-asymmetry occurs when the electron beam is spin-polarized perpendicular to the\nscattering plane.\n\nThe left and right count rates NL and NR in the Mott detector are accumulated as a\nfunction of binding energy, and the spin polarization P(E) can be calculated as\n\nR\nL\nR\nL\neff\neff\nN\nN\nN\nN\nS\nE\nq\nE\nq\nS\nE\nP\n+\n-\n=\n+\n-\n=\n)\n(\n)\n(\n)\n(\n(6)\nwhere q= NL/NR. NL and NR have to be corrected for the so-called apparatus-asymmetry\nif NL=NR for unpolarized electrons. Seff is the Sherman factor, which can be calculated\nfrom scattering theory and corrected for film thickness.\n\nDisplaying spin-resolved intensity-energy distribution curves\nand\nallows\nbetter correlation with the calculated band structures. They are related to the spin\npolarization P(E) and the spin-averaged intensity I(E) through\n)\n(E\nI ↑\n)\n(E\nI ↓\n\n(7)\n))\n(\n)(\n(\n5.0\n)\n(\nE\nP\nE\nI\nE\nI\n+\n=\n↑\n\n(8)\n))\n(\n)(\n(\n5.0\n)\n(\nE\nP\nE\nI\nE\nI\n-\n=\n↓\n\n2.1.2.4 Experimental setup\n\nFig. 2 shows a schematic of the experimental setup which utilizes the well-focused light\nspot as available with synchrotron radiation. The apparatus is similar when using a high-\nefficient laboratory resonance lamp.\n\n2.1.3 Advantages and disadvantages\n\nSpin-polarized photoelectron spectroscopy provides the most direct measurement of P as\ncan be seen from the discussion above. Fig. 3 shows the spin-resolved photoemission\nspectra for a Fe3O4 film on a MgO (100) substrate taken with 450 eV photons [4].\nHowever, besides low energy resolution (hundreds of meV), it necessitates complicated\napparatus such as synchrotron radiation, and very stringent surface preparation. This\nmakes it not applicable for routine analysis of spin polarization.\n\nFig. 3 Spin-resolved photoemission spectra of\nFe3O4/MgO(100) taken with 450 eV photons [5]\n\n2.2 Spin-polarized tunneling in a FM/I/S tunnel junction-the Tedrow-Meservey\nmethod\n\nThe pioneering experiments by Tedrow and Meservey [6,7] founded the field of spin-\npolarized tunneling[8]. They used ferromagnet/insulator/superconductor (FM/I/S) tunnel\njunctions to measure the spin polarization of the tunneling current originating from\nvarious ferromagnetic metals across an Al2O3 barrier to a superconducting Al film that\nacts as a spin analyzer.\n\n2.2.1. Principle\n\n2.2.1.1 General theory of electron tunneling\n\nElectron tunneling is a quantum mechanical phenomenon in which electric current can\npass from one electrode through a thin insulating barrier layer into a second electrode.\nThis three-layer system-electrode, barrier, and counterelectrode-is called a tunnel\njunction. For technical reasons, these junctions have usually been fabricated using a thin\nmetal film (generally Al) as the first electrode, with an oxide providing the barrier. The\nquantity typically measured in a tunneling experiment is the current or its derivative as a\nfunction of applied voltage. With no voltage applied, the Fermi levels of the two\nelectrodes must be equal. An applied voltage will give rise to a difference between the\n\nImage removed due to\ncopyright considerations.\n\ntwo Fermi levels. Fermi's golden rule determines the current [7]: the number of electrons\ntunneling is given by the product of the density of filled states at a given energy in one\nelectrode and the density of empty states in the other electrode at the same energy\nmultiplied by the square of a matrix element describing the probability of tunneling.\nUsually this matrix element is taken to be independent of energy. Taking the difference\nbetween current of tunneling electrons at energy E from electrode 1 to electrode 2 and\ncurrent from electrode 2 to electrode 1, then integrating over all energies, we get the\ntunneling current\n∫\n+inf\ninf\n-\n-\n-\n-\n=\ndE\nE\nf\neV\nE\nf\nE\nN\neV\nE\nN\nM\nV\nI\n)]\n(\n)\n(\n)[\n(\n)\n(\n)\n(\n(9)\nwhere N1 and N2 are the densities of states (DOS) of the first and second electrodes,\nis\nthe Fermi function, V is the voltage on the first electrode with respect to the second, M is\nthe matrix element, and the energy E is measured from the Fermi energy.\nf\n\nThe tunneling case that is relevant for the Tedrow-Meservey method of measuring spin-\npolarization is when one electrode is superconducting and the other is normal. The BCS\nsuperconducting density of states has a gap in the excitation spectrum of ∆on each side\nof the Fermi level and characteristic singularities in Ns(E) for E=\nThe BCS\nsuperconducting DOS has the form\n.\n∆\n±\n\n⎩\n⎨\n⎧\n∆\n<\n∆\n≥\n∆\n-\n=\nE\nE\nE\nE\nE\nN\nE\nN\nn\ns\n)\n/(\n)\n)\n(\n(\n)\n(\n/\n(10)\nwhere Nn is the DOS of the metal in the normal state. For simplicity, the normal state\nDOS is assumed to be independent of energy and can be removed from the integral in Eq.\n(9). Thus we arrive at\n\n(11)\n∫\n+inf\ninf\n-\n-\n+\ndE\nE\nf\neV\nE\nf\nE\nN\nN\nI\ns\nn\n)]\n(\n)\n(\n)[\n(\n~\nLittle current can flow when\n∆\n<\neV\nsince there are only a few thermally filled states on\none electrode facing a similar number of empty states in the other. When eV exceeds the\ngap energy, the current increases rapidly. At higher voltages, the current approaches a\nlinear dependence on V. Taking the derivative of I with respect to V in Eq. (11) leads to\n\n∫\n+inf\ninf\n-\n+\ndE\neV\nE\nK\nE\nN\nV\ndV\ndI\ns\n)\n(\n)\n(\n~\n)\n(\n(12)\nTherefore, dI/dV is the convolution of the superconducting DOS Ns(E) and K(E-eV), the\nderivative of the Fermi function with respect to V,\n\n{\n}\n)]\n(\nexp[\n/\n)]\n(\nexp[\neV\nE\neV\nE\nK\n+\n+\n+\n=\nβ\nβ\nβ\n(13)\n\nHere\nKT\n/\n=\nβ\n. The function K peaks at E=eV and approaches a δ -function as the\ntemperature T\nThus, in the limit of low temperature, the conductance dI/dV(V)\n.0\n→\n\napproaches Ns(eV) and a measurement of tunneling conductance closely reflects the\ndensity of the excited states of the superconductor. Actually, by a deconvolution, the\nDOS can (at least in theory) be reconstructed from the conductance data. Fig. 4 manifests\nthe directness and power of this kind of measurement.\n\n2.2.1.2\nZeeman splitting of the density of states of a superconductor\n\nZeeman splitting of the DOS of a superconductor makes it useful as a spin detector.\n\nGenerally, in a tunneling experiment in a magnetic field, the orbital deparing parameter\nof the superconductor dominates and the measured conductance simply reflects a\nbroadening of the DOS with increasing field. However, when a thin superconducting film\n(a few nanometers or less) is placed in a magnetic field applied parallel to the film plane,\nthe orbital response is largely suppressed, so the effect of the spin interaction with the\nfield can be observed. In this case, the quasiparticle DOS of a superconductor split due to\nthe Zeeman interaction of the magnetic field with the electron spin magnetic moment.\nThe explanation goes as follows: the paired quasiparticles must be in time-reversed states.\nhen the filed is applied, they keep their k\nand -k\nparing, but now the spin-up and\npin-down members of the pair have different ene\nFig. 4 Superconductor-normal metal tunneling.\n(a) BCS density of states of a superconductor\nas a function of voltage. (b) Temperature\ndependent kernel in the integral expression for\nthe conductance. (c) Theoretical normalized\nconductance dI/dV. Voltage is measured from\nthe Fermi energy of the superconductor. Note\nthat electron energy decreases as the voltage\nincreases.\nFig. 5 (a) Magnetic field splitting of the\nquasiparticle states into spin-up (dashed) and\nspin-down (dotted) densities. (b) Spin- and\ntemperature-dependent kernel in tunneling\nconductance integral. (c) Spin-up conductance\n(dashed), spin-down conductance (dotted), and\ntotal conductance (solid line).\nW\n↑\n↓\nrgies, one being raised by\nH\nB\nμ\n, and the\ns\n\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\n\nother lowered by\nH\nB\nμ\n, with\nB\nμ the Bohr magneton. The excited states remain separated\nom the paired state by\n, so that in a tunneling experiment, the peaks of the BCS DOS\nppear at different voltages for quasiparticles of different spin. As a result, the DOS of\ne superconductor is the superposition of the spin-up and spin-down contributions\narated by energy of\nfr\n∆\na\nth\nsep\n\nH\nB\nμ\n(see Fig. 5(a)). This Zeeman splitting of the sharply peaked\nfrom the up- and\nof\nsupercondoctor DOS makes it possible to separate the contributions\ndown-spin electrons in the tunneling current, since at an energy\n\nH\nB\nμ\n-\n∆\n, the\nd at\nelectrons in the tunnel current will be almost entirely of one spin orientation, an\nH\nB\nμ\n+\n∆\nalmost entirely of the opposite spin direction. So the superconductor in a\nsuperconductor/normal metal junction (S/I/N) can be used as a spin analyzer.\n\nIn the absence of spin-orbit scattering and orbit deparing, the measured conductance is\nthe sum of that for each spin in the form of Eq. (12):\n\n∫\n∫\n+inf\ninf\n-\n+inf\ninf\n-\n+\n-\n+\n+\n+\ndE\neV\nE\nK\nH\nE\nN\ndE\neV\nE\nK\nH\nE\nN\nV\ndV\ndI\ns\ns\n)\n(\n)\n(\n)\n(\n)\n(\n~\n)\n(\nμ\nμ\n(14)\n\nFig. 5 demonstrates how the two-peaked structure develops from spin DOS in a way very\nsimilar to that described in Fig. 4.\n\n2.2.1.3 Conductance asymmetry of a S/I/FM junction\n\nLet us proceed to see what will happen when a ferromagnet is used as the\ncounterelectrode to the s\nonducting electrode.\n\nIn a ferromagnet, the electronic DOS is exchange split, leading to unequal DOS at the\nFermi energy,\n↑\nN =\n↓\nN . Since\n↑\nN and\n↓\nN determine the number of electrons that can\nthin each spin channel, the spin conductance is weighted with the respective\nspin DOS. Neglecting spin-orbit scattering and assuming that spin does not change\nduring the tunneling process, i.e. the total conductance is the sum over the s\nuperc\ntunnel wi\npin-up and\nspin-down channels, using essentially the same form as Eq. (14), we obtain\n\n∫\n∫\n+inf\n+inf\ninf\n-\ninf\n-\n+\n-\n-\n+\n+\n+\n=\ndE\neV\nE\nK\nH\nE\nN\na\ndE\neV\nE\nK\nH\nE\naN\nV\nV\ndV\nd\ns\ns\n)\n(\n)\n(\n)\n1(\n)\n(\n)\n(\n~\n)\n(\n)\n(\nμ\nμ\nσ\n(15)\n\nHere a is the fraction of electrons with magnetic moment in the direction of the applied\n\nI\nmagnetic field. The spin polarization P of the ferromagnet is then defined as\n\n)\n1(\n-\n=\n-\n-\n=\n-\nN\nNa\nn\nn\n+\n↓\n↑\nN\nn\nn\n≡\n↓\n↑\na\na\nP\n(16)\nwhere N is the total number of electrons in the ferromagnet at the Fermi energy, and\n↑\nn and\n↓\nn are the number of electrons whose magnetic moments are parallel and\nantiparallel to the field, respectively.\n\nEq. (15) gives an asymmetric conductance curve as shown in Fig. 6. The dashed curve in\nergy by\nFig. 6(a) shows the spin-up DOS; the dotted curve shows the spin-down one, identical but\ndisplaced in en\nH\nB\nμ\n. In Fig. 6(b), derivatives of the two spin DOS in the\nferromagnet near the Fermi energy are shown with a larger amplitude for spin-up\n\nelectrons than for spin-down. The phenomenological theory states that the convolution\nof one spin function in Fig. 6(a) with the corresponding spin function in Fig. 6(b) gives\nthe conductance at the voltage V shown in Fig. 6(c). The total conductance is given by\nthe sum of the two spin contributions. In this figure, the voltage is measured from the\nFermi energy of the ferromagnetic film. The fact that the inner peak at positive voltage\nis larger than the peak at the corresponding negative voltage indicates that electrons\nwith their magnetic moments in the field direction (spin-up) predominate in the\ntunneling current.\n\nWe can do a quantitative analysis of the conductance curve to acquire the spin DOS of\nthe superconducting film and\ne tunneling current based o\nthe previous two assumptions le\nunsplit conductance function, we assume that ag(V-h) is the conductance contributed\nby the spin-up electrons shifted in voltage by the Zeeman splitting\nthe spin polarization of th\nn\nading to Eq. (15). Referring to Fig. 6(c), if g(V) is the\ne\nH\nh\nB\n/\nμ\n=\n, and the\nFig. 6 Superconductor-fe\nnetic metal\ntunneling. (a) BCS density of states of a\nsuperconductor as a function of voltage in\nrromag\na magnetic field. (b) Temperature\ndependent kernels for each spin direction\nin the integral expressions for conductance.\n(c) Theoretical normalized conductance for\neach spin direction (dotted and dashed\ncurves) and the total conductance (solid\nline).\nFig. 7 Cross section of an Al/Al2O3/Ag\ntunnel junction and plan view o\nthree junctions with contact pad\nf a set of\ns.\n\nImage removed due to\ncopyright considerations.\nImage removed due to\ncopyright considerations.\n\nspin-down electrons have a contribution of (1-a)g(V+h). Here a is the fraction of spin-\nup electrons in the tunnel current. Th\nalue of V, four equations for the tota\ne total measur\nsum of the two spin contributions as is shown in Fig\nv\nl measured con\ned conductance G(V) is then the\n. 6(c) by the solid curve. For any\nuctance\nd\nσ at points -V-h, -V+h,\nV\nunction g(x) can be written as\n\nh\n-h and V+h in terms of the unsplit f\n(\n)\n1(\n)\n(\n)\n(\nV\ng\na\nV\nag\nh\nV\nG\n)\n-\n-\n+\n-\n=\n-\n-\n=\nσ\n-\n(17.1)\nV\ng\na\n)\n(\n)\n1(\n)\n(\n)\n(\nh\nV\nag\nh\nV\nG\n-\n-\n+\n+\n-\n=\n+\n-\n=\nσ\n(17.2)\nh\nV\ng\na\nV\nag\nh\nV\n(\nG\n(17.3)\n)\n(\n)\n1(\n)\n(\n)\n=\nσ\n-\n-\n+\n=\n-\n)\n(\n)\n1(\n)\n(\n)\n(\nV\ng\na\nh\nV\nag\nh\nV\nG\n-\n+\n+\n=\n+\n=\nσ\n(17.4)\n\nssuming as in the microscopic theory that g(V)=g(-V) for the unsplit function, we\ntain from Eqs. (17) the spin polarization P as a function of the measured conductances\nA\nob\nσ ,\nσ ,\nσ , and\nσ :\n\n)\n(\n)\n(\n)\n(\n)\n(\nσ\nσ\nσ\nσ\nσ\nσ\nσ\nσ\n-\n+\n-\n-\n-\n-\n=\n-\n= a\nP\n(18)\nFr\nva\n\nom Eqs. (17.1) and (17.4), we can obtain the conductance of one spin orientation at any\nlue of V in term of the quantity a and the measured total conductances G(V) and G(-V).\n\n)1\n/(\n)]\n(\n)\n1(\n)\n(\n[\n)\n(\n-\n-\n-\n-\n=\n-\na\nV\nG\na\nV\naG\nh\nV\ng\n(19)\n\nappears from Eqs. (17) that any arbitrary value of voltage V and magnetic field could\nselected to obtain P from Eqs. (17) and (18). In practice, how to choose the values of\nand H are important as they determine the accuracy of the resu t. For very low values\nH, the fringing field of the incompletely saturated magnetic\nIt\nbe\nV\nof\nfilm depairs the\nsuperconducting film and the small amount of splitting decreases the accuracy. On the\nother hand, for relatively large field H tha\ncritical field of the\nsuperconducting film, the depairing of the superconductor broadens the DOS curves and\neventually obscures the effect of the magne\nalues of V should be\nchosen so that\nl\nt is close to the\ntic field splitting. V\nσ ,\nσ ,\nσ , and\nσ are close\nconductance curves or\nat least in regions where the absolute value\n. This way the results\nwill become much less sensitive to random experimental errors.\n\nThere are two essential requirements for making the tunnel junctions: first, the barrier\nmust be uniform and free from holes and is not too thick to allow tunneling. The\ntunneling thickness required is of the order\nsurface quality of the\nsuperconductor must be good enough so that any undesirable surface conditions must\nto the maxima of the\ns of the slope is small\n\n2.2.2\nExperimental technique\nof 1-2nm. Second, the\nextend much less than a coherence length into the superconductor.\n\nThese two problems can be solved most eas\nd electrode forms an\noxide layer with a thickness suitable for tunneling. Al has been the most useful and\nily if the first-deposite\nreliable material because in addition to being uniform and pinhole-free, the oxide layer is\nchemically self-limiting in the tunneling thickness range. Sn, In and lead are also useful,\nalthough more difficult than Al. Compounds and alloys are more challenging because of\ntheir often short coherence lengths (≤ 10nm), which impose severe demands on surface\npreparation.\n\nTypical junction fabrication involves the following four steps [7]: first, an Al film is\ndeposited through a shadow mask to form a long, narrow strip about 0.2mm wide. Next,\nthe Al film is subject to an oxygen plasma to form a tunnel barrier. Then a counter-\nelectrode material is evaporated through a mask to form a series of cross strips, making a\nnumber of junctions. The final step is to evaporate some material such as In solder or Au\nto form contact pads for attaching wires for electrical measurements. In many\nme\ndeposited on a substrate cooled to liquid-nitrogen\natu\nntinuous 4 nm-thick films. Fig. 7 is a schematic of a\ng a lock-in detector.\ne of measured P for some typical ferromagnets due to improvements in the\nexperi\nnts, the Al film must be\nte\nre to make uniform and co\nmper\ntunnel junction.\n\nMany tunneling results have been obtained with circuits measuring the derivative of I\nwith respect to V, i.e. dI/dV as a function of V. The junction is biased with a voltage\nsource that consists of a slow ramp and a small constant amplitude, audio frequency\nmodulation. The AC current through the junction is measured usin\nThe output of the detector is then proportional to dI/dV.\n\n2.2.3 Advantages and disadvantages\n\nSpin-polarized tunneling from a ferromagnetic metal to a superconducting thin film\nprovides a direct and powerful way to measure P of the FM. However, to get accurate\nresults, the barrier and interface quality requirements are severe. Table 1 shows the\nin reased valu\nc\njunction structural quality.\n\nTable 1 Tunnelling spin polarization obtained in experiments on FM/Al2O3/Al tunnel junctions [8]\n\nFM\nNi\nCo\nFe\nNi80Fe20\nNi40Fe60\nCo50Fe50\nCo84Fe16\nP(%),\nold\nvalues[7]\n_\n_\n_\nP(%), new\nvalues[9,10]\n\njunction (MTJ).\n\n2.3 Tunneling in a FM/I/FM junction-Julliere's model\n\nJulliere's model [11] allows the calculation of spin polarization of a ferromagnet from the\ntunneling magnetoresistance (TMR) of a magnetic tunnel\n\n2.3.1 Principle\n\ned a magnetic tunnel junction (MTJ). The most important\nroperty of an MTJ is that the tunneling current depends on the relative magnetization\n\ntunneling current will be larger when the m gnetization of the two metals are parallel\ntha\nen they\nantipa\nl. This\nnom\nll\nin\nr\nre\ns of a simple mo\nbased o\no assum\nons [8]\nst,\nis assumed that spin of electrons is conserved in the tunneling process. It follows, then,\nat tunneling of up- and down-spin electrons are two independent processes, so the\nonductance occurs in the two independent spin channels. According to this assumption,\nagnetic film are accepted by\nwo ferromagnetic films are\n\nPARALLEL ALLIGNM ANTIPARALLEL ALLIGNMENT\nA logical extension of the tunneling between ferromagnetic metals and superconductors\nis the tunneling between two ferromagnetic metals. It was reasoned that instead of using\nmagnetic-field induced spin-split states of a superconductor as a spin detector, it is\npossible to use exchange-split states of another ferromagnet [8]. Such a structure, i.e. an\nFM1/I/FM2 junction is call\np\norientation of the two electrodes, which can be changed by an applied magnetic field. The\na\nn wh\nare\nralle\nphe\nenon is ca ed tunnel g magneto esistance\n(TMR).\n\nJulliere interp ted TMR in term\ndel\nn tw\npti\n. Fir\nit\nth\nc\nelectrons originating from one spin state of the first ferrom\nunfilled states of the same spin of the second film. If the t\nmagnetized parallel, the minority spins tunnel to the minority states and the majority\nspins tunnel to the majority states. If, however, the two films are magnetized\n\nFig. 8 Schematic DOS diagram showing Julliere's assumption of spin conservation during tunneling\n\nantiparallel, the majority spins of the first film tunnel to the minority states in the second\nfilm and vice versa as shown in Fig. 8.\n\necond, Julliere assumed that the conductance for a particular spin or\nS\np\nientation is\nroportional to the product of the effective (tunneling) density of states (DOS) of the two\nferromagnetic electrodes. According to these two assumptions, and following the analysis\nin much the same way as with tunneling between a ferromagnet and a superconductor,\nFM1\nFM2\nFM1\nFM2\nI\nI\n\nImage removed due to\ncopyright considerations.\n\nthe conductance for\nP, can be written as\nfollows:\n\n∝\n∝ a1a2+(1-a1)(1-a2) (20)\nGAP ∝\n∝ a1(1-a2)+(1-a1)a2 (21)\nwhere\nand\nare the tunneling DOS of the ferromagnetic electrodes (denoted by\ni=1,2) for the majority and minority spin electrons; a1 and a2 are the fractions of majority\nspin electrons in the DOS of the two ferromagnets. The subscripts P and AP indicate\nparallel and antiparallel magnetization. The TMR is defined as the conductance\ndifference between parallel and antiparallel magnetizations, normalized by the\nantiparallel conductance:\n\nthe parallel and antiparallel alignment, G and GA\nP\nP\nG\n↓\n↓\n↑\n↑\n+\nN\nN\nN\nN\n\n↑\n↓\n↓\n↑\n+\nN\nN\nN\nN\n↑\ni\nN\n↓\ni\nN\nP\nP\nAP\nAP\nAP\nP\nR\nR\nR\nG\nG\nG\nTMR\n-\n=\n-\n≡\n(22)\n\nUsing equations (20) and (21), we get Julliere's formula:\n\n2 P\nP\nTMR =\n(23)\n\nwhich expresses TMR in terms of the eff\nP\nP\n-\nective P of the two FM electrodes:\n\n↓\n↑\n↓\n↑\n+\n-\n=\ni\ni\ni\ni\ni\nN\nN\nN\nN\nP\n(24)\nwhere i=1,2. Reformulating Eq. (24), we get\n\nTMR\nTMR\nP\nP\n+\n= 2\n(25)\n\nIf the P of one electrode, say, P1, is known beforehand (e.g. through Tedrow-Meservey\nmeasuring TM\nq. (25).\nery thin Al layer (a few nm thick) is deposited at the liquid\nture, followed by oxygen gl\nrge to form the high quality tunnel\nother ferromagnetic materi\norated through a mask to from a\nries of cross strips, resulting in a number of junctions. A difference between the S/I/FM\nting barrier material covers the\nrip as in the former.\nMeasuring TMR is simple: when a voltage is applied between contacts 3 and 4 in Fig. 9,\ncurrent can be measured between contacts 1 and 2. Meanwhile, a magnetic field parallel\ns of orsteds,\ndepending on the coercivity of the electrodes. Fig. 10 shows the experimental setup for\nmeasurement), by\nR, P2 can be calculated from E\n\n2.3.2 Experimental technique\n\nFig. 9 is a schematic of two MTJs fabricated in our lab. We prepare MTJs in much the\nsame way as the fabrication of an S/I/FM junction introduced in section 2.2.2. First, a\nlong vertical bottom electrode such as Co is deposited using e-beam evaporation through\na shadow mask. Then a v\nnitrogen tempera\now discha\nbarrier. Next, an\nal is evap\nse\nand FM1/I/FM2 fabrication is that in the latter, the insula\nwhole area of the substrate, and is not defined as a long st\n\na\nto the film plane is swept from positive to negative values, maybe hundred\n\n1 I+\n3 V+\n2 I-\n\n).\n2.3.3 Advantages and disadvantages\n\nJulliere's simple quantitative model ha\n\nmagnitude of TMR in MTJs from the known values of the spin polarization of\nferromagnets obtained in experiments on F\nd to\nrough\nbased o TMR values. E.g. Hu and Suzuki estimated the\n3].\nof\n\nnd the interface between the insulating layer and the FM layer\nan enhance the measured value of TMR. Experiments also show that TMR also depends\non the choice of the tunneling barrier.\n\nthe measurement. Rs is a series resistor whose resistance is 1/5 to 5 times that of the\ntunneling junction. The TMR can be calculated per Eq. (22). If we know the P of one\nelectrode beforehand, the P of the other electrode can be obtained from Eq. (25). Fig. 12\nshows the first observation of reproducible, large magnetoresistance at room temperature\nby Moodera et al [12].\n\nFig. 9 Schematic of a MTJ\n4 V-\nRs\nMTJ\nH\nFig. 10 Experimental setup to measure TMR\n\nFig. 12 The magnetoresistance in a\nCoFe/Al2O3/Co MTJ.\nThe arrows indicate the relative\nmagnetization orientation\nin the CoFe and Co layers (after [12]\n\ns been used by many researchers to estimate the\nM/I/S tunnel junctions. It was also use\nly estimate the P of a FM\nn\nnegative P of Fe3O4 from the TMR values of Fe3O4/CoCr2O4/La0.7Sr0.3MnO3 MTJs [1\nBut this model is too simple to describe all the experimental data. It assumes that the P\na tunneling current is solely determined by the P of the total electronic DOS of the\nferromagnetic layers at the Fermi level. However, experimental results show that TMR\nstrongly depends on the structural quality of the MTJ: improvements in the quality of the\nunneling barrier layer a\nt\nc\n\nImage removed due to\ncopyright considerations.\n\ne\nand a ferromagnet metallic\npoint contact has been attracting interest as a new technique to measure the spin\npolarization on ferromagnets because of its simpli\n\n2.4.1 Principle\n\n2.4.1.1 Andreev reflection\n\nThe conversion of a normal current to supercurrent at a metallic interface is called\nAndreev reflection, which is a well-known phenom\n\nshows the interface between a metal with P=0 and a superconductor. When an electron\nard the interface, for the electron to enter the\ned as part of the supercurrent, another electron\n2.4 Andreev reflection in a superconducting point contact\n\nAndreev reflection at the interface between a sup rconductor\ncity [1].\nenon in superconductivity. Fig. 13(A)\nfrom the normal metal propagates tow\nuperconducting condensate and proce\ns\nfrom the metal is required to form a pair, thus leaving behind a hole at the interface. This\nhole has the opposite momentum of the incident electron and propagates away from the\ninterface. The Andreev reflected holes act as a parallel conducting channel to the initial\nelectron current, thereby doubling the normal-state conductance Gn (G=dI/dV) of the\npoint contact for applied voltages eV<∆, with ∆ being half the superconducting gap at\nthe interface. In an I-V measurement, the supercurrent conversion appears as an excess\ncurrent added to the ohmic response at the interface. Fig. 13(B) illustrates the effect\nexperimentally for a superconducting niobium point pressed into a Cu foil at a\ntemperature of 1.6K. As can be seen, at low voltage, the normalized conductance is\nindeed twice that of the normal state and an excess current about 0.2mA is present.\n\nFig. 13 Supercurrent conversion at the superconductor-metal interface for spin polarizations of P=\n0 and P→100%.\nImage removed due to\ncopyright considerations.\n\n(A) Schematic of the process for P=0 when the Andreev reflection is unhindered by a spin minority\npopulation at EF. The solid circles denote electrons and open circles denote holes.\n(B) Experimental measurement of the I-V and differential conductance dI/dV at T=1.6 K via a\nsuperconducting Nb point contact on Cu. The vertical lines denote the bulk gap of Nb: ∆(T=0)\n=1.5 meV. The dashed line is the normal state I-V for a conductance of Gn= 0.194 ohm-1.\n(C) Schematic of process for P=100% when there is no supercurrent conversion at the interface.\n(D) Experimental I-V and dI/dV at T =1.6 K via the Nb point contact on CrO2. The dashed line is\nthe normal state I-V for a conductance of Gn=0.417 ohm-1.\n\n2.4.1.2 Effect of spin polarization on Andreev reflection\n\nTracking the spin during Andreev reflection shows that the process is a coherent\ninterspin-subband transfer that is sensitive to the relative electronic spin DOS or P of the\nnormal metal at EF. Let us look at Fig. 13(A) again. Because a superconducting pair\nconsists of a spin-up and a spin-down electron, an incident spin-up electron in the metal\nrequires a spin-down electron to be removed from the metal as well for conversion to\nsupercurrent. The removal of the spin-down electron leaves a spin-up hole that is\nAndreev reflectd back into the metal. Since the spin-up hole is the absence of a spin-\ndown electron, by convention, it is in the spin-down DOS as shown in Fig. 13(A).\nWhether and to what extent Andreev reflection is allowed depends on P. When P=0,\nAndreev reflection is not hindered by a lack of minority spin carriers for the formation of\ncooper pairs to enter supercurrent. However, in the case of P=100% near EF as depicted\nin Fig. 13(C), there are no spin-down states in the normal metal to provide the other\nmember of the superconducting pair for Andreev reflection. Supercurrent conversion via\nAndreev reflection is effectively blocked. As a result, only single particle excitation is\nallowed to contribute to the conductance. Because of the energy gap in the\nsuperconductor, for voltages eV<∆, the single-particle states conductance is suppressed.\nFig. 13(D) shows the result when a superconducting Nb point contact is placed on an\nF.\nd, because\nectron\ninkham-\ncase for\nthe current into two parts: an\nunpolarized current I\nthat carries no net P and obeys the conventional BTK theory and\nly a quasiparticle current. In the\ncase of a ballistic point con\nwith no interfacial scattering (Z\nepitaxial film of CrO2, which is suggested to be a half-metal FM and have P=100% at E\nfirms the 100% P because nearly all of the Andreev\nThe conductance curve directly con\nreflection has been suppressed, implying almost full spin polarization.\n\nFor intermediate spin polarizations, the Andreev reflection is partially blocke\nfor an incident up-spin electron near E , there may or may not be a down pin el\nF\n-s\navailable for cooper pair formation. Soulen et al [1] adapted the Blonder-T\nKlapwijk (BTK) theory for conventional Andreev reflection where P=0 to the\nspin-polarized materials (P =0) by decomposing\nunpol\na polarized current Ipol that carries all of P and thus entire\ntact\n≈0), for eV<< ∆ and\nKBT<< ∆, they arrived at the following equation which allows for easy determination of\nP from the conductance curve.\n\n)\n1(\n)\n,\n;0\n,0\n(\nP\nZ\nP\nT\neV\ndV\ndI\nGn\n-\n=\n=\n→\n→\n(26)\n\nWhen Z =0 and T is finite, a numerical fitting procedure over the entire voltage range\nwith their modified BTK model can be used to obtain P.\n\nFig. 14 shows a series of samples that have varying degrees of P, demonstrating the\napplicability of the superconducting point contact technique.\n\nFig. 14 The differential conductance for several spin-polarized metals showing the suppression of An reev\nreflection with increasing P. The vertical lines denote the bulk gap of Nb:\n\nd\n∆(T=0)=1.5 meV.\n\nSoulen pointed out [1] that the P measured by the Andreev reflect\ndifferently from th Tedrow-Meservey results P , which is more acc\nion (Pc) is defined\n\ne\nT\nurately a tunneling\n\npolarization:\n\n↓\n↑\n↓\n↑\n↓\n↓\n↑\n↑\n↓\n↓\n↑\n↑\n+\n-\n=\n+\n=\nI\nI\nv\nE\nN\nv\nE\nN\nP\nF\nF\nF\nF\nF\nF\nF\nF\nC\n)\n(\n)\n(\n(27)\n-\nI\nI\nv\nE\nN\nv\nE\nN\n)\n(\n)\n(\n\n)\n(\n)\n(\n↓\n↓\n↑\n↑\n-\n=\nT\nE\nN\nT\nE\nN\nP\nF\nF\nT\n\n)\n(\n)\n(\n↓\n↓\n↑\n↑\n+\nT\nE\nN\nT\nE\nN\nF\nF\n(28)\nwhere\nand\nare spin dependent tunneling matrix elements. These matrix elements\nare determined by wave function overlap at the interface, and should therefore be\ndifferent for the spin-up and spin-down bands. These different definitions may explain\nthe discrepancy of P obtained by the two techniques.\n\n2.4.2 Experimental technique\n\nThe probes for this technique were fabricated by mechanically polishing rods of\nsuperconducting material (Nb and Ta) to a cone-shaped sharp point of radius around 100\nμm with progressively fine sand paper. The extreme portion of the tips was studded with\nseveral protrusions that were 1 μm or smaller which likely formed the actual point\ncontact.\n↑\nT\n↓\nT\n\ne\nterial. The\nour-terminal transport measurements were made with the point contact and\nmple immersed in a liquid He bath at either 4.2 or 1.6 K. The dI/dV data were obtained\nac lock-in techniques at a frequency of 2 kHz.\n.4.3 Advantages and disadvantages\n\nflection is a relatively new\nolarization. The\nrt that [1] the advantage of\nplicity. Unlike\neasure a few compounds such as\niMnSb, LaSrMnO and CrO2 that had not been examined by the tunnel junction\nto impurities and the di\nrent definitions of P.\n\nConclusion\nhe four most commonly used\nm thods for determining the degree of spin polarization in a ferromagnet. Through the\nexperimental technique has its own advantages\nand disadvantages. Because of the rather complicated equipment, spin-resolved\nPositioning and adjustment of the point contact was achieved by mechanical means: the\ntip was attached to a drive shaft vertically positioned abov the sample ma\nshaft was driven by a micrometer mechanism capable of moving the point linearly by 100\nμm per revolution.\n\nonventional f\nC\nsa\nby standard\n\nAndreev re\ntechnique to measure spin p\nauthors asse\nAndreev reflection is its sim\nTedrow-Meservey method which has stringent requirement for an ultra thin uniform\noxide layer, and thus may make the study of some interesting materials difficult, the\nsuperconducting point contact method requires no magnetic field and has no special\nconstraints on a sample. Thin films, single crystals and foils of several metals have been\nsuccessfully studied. Soulen et al were also able to m\nN\ntechnique.\n\nAlthough there seems to be some rough correspondence between the results of Andreev\nreflection measurements and spin-polarized tunneling of the Tedrow-Meservy method,\nfor some materials the discrepancy is huge. For example, Soulen et al measured a P of\n37% for Ni, while the Tedrow-Meservy method gave a P=25%. Soulen et al attributed the\ndifference\nffe\n\nTsymbal et al [8] claimed that the relevance of Andreev reflection for MTJs and TMR\nvalues are questionable at best, and the rough correspondence between spin dependent\ntunneling across Al2O3 and Andreev reflection measurements are most probably spurious.\n\nMeasuring spin polarization of ferromagnetic materials easily and accurately is important\nfor the advancement of spintronics. This paper reviews t\ne\ndiscussions above, we have seen that each\nphotoemission is not often used to determine P. The Tedrow-Meservey method is a good\nalternative. Julliere model allows rough P estimation at high temperatures. Andreev\nreflection seems promising due to its not so severe requirement on sample preparation.\nBesides these four methods, there are still other techniques such as field emission that has\nnot been pursued further since about 1980, electron capture spectroscopy, secondary\nelectron emission, spin-polarized metastable-atom de-excitation spectroscopy, and\nMossbauer spectroscopy, etc [4,6].\n\nOne should be careful when comparing P values measured using different techniques,\nnd try to discern which kind of spin polarization they are measuring, PN or PNv, etc.;\n] R. Feder, ed. Polarized Electrons in Surface Physics, World Scientific,\n\n.\n[5] D. J. Huang, C. F. Chang, J. Chen, et al, J. Magn. Magn. Matt., 239, 261(2002).\na\nwhether they sample the localized electrons or highly itinerant states. Getting a definite\nanswer can be challenging and sometimes requires demanding theoretical work and\nadvanced experimental techniques.\n\nReferences\n\n[1] R. J. Soulen Jr., J. M. Byers, M.S. Osofsky, et al., Science, 282, 85 (1998).\n[2] I.I. Mazin, Phys. Rev. Lett. 83, 1427(1999).\n[3] G. Busch, M. Campagna, P. Cotti, et al, Phys. Rev. Lett. 22, 597 (1969).\n[4\n\nSingapore, 1985\n[6] P. M. Tedrow, R. Meservey and P. Fulde, Phys. Rev. Lett. 25, 1270 (1970).\n[7] R. Meservey and P. M. Tedrow, Phys. Rep. 238, 173 (1994).\n[8] E. Y. Tsymbal, O. N. Mryasov, and P. R. LeClair, J. Phys: Condens. Matter, 15,\nR109-R142 (2003).\n[9]J. S. Moodera, J. Nassar, and G. Mathon, Annual Rev. Mater. Sci. 29, 381(1999).\n[10]D. J. Monsma, and S.S. P. Parkin, Appl. Phys. Lett. 77, 720(2000).\n[11] M. Julliere, Physics Letters, 54A, 225 (1975).\n[12] J. S. Moodera, L.R. Kinder, T. M. Wong and R. Meservey, Phys. Rev. Lett. 74,\n3273(1995).\n[13] G. Hu and Y. Suzuki, Phys. Rev. Lett. 89, 276601(2002)."
    },
    {
      "category": "Resource",
      "title": "mccluskey_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/67e38b64d1fd6f7eb9547d7f6060c773_mccluskey_paper.pdf",
      "content": "Variant/Phase Distribution Model for FePd\n\nPatrick McCluskey\nMagnetic Materials\n5/6/2004\n\nIntroduction\n\nFerromagnetic shape memory alloys (FSMAs) have received attention recently\nbecause of their ability to produce large strains in the presence of an external magnetic\nfield. These strains can be an order of magnitude larger than those produced by alloys\nwith a strong magnetostrictive coupling. Terfenol-D has produced strains as large as\n0.24% while the FSMA Ni-Mn-Ga has demonstrated strains of 6%.[1] This order of\nmagnitude difference in strain results from the operation of dissimilar mechanisms, the\nfirst is produced by typical magnetostriction and the second results from the reorientation\nof martensite twins.\n\nFSMAs that produce large field induced strains have a twinned martensite\nstructure with high magnetocrystalline anisotropy. When subjected to a magnetic field,\nthe Zeeman energy causes a material to align its magnetic moment in the direction of the\nfield. The magnetocrystalline anisotropy wants to align the field in a certain\ncrystallographic direction. In FSMAs the path with the lowest energy barrier to\nequilibrate these driving forces is twin boundary motion. The boundary moves into the\nunfavorably oriented twin and away from the favorably oriented twin (Figure 1).\n\nAs the twin boundary moves the shape anisotropy of the crystal lattice causes\ndeformation of the material. The axis of easy magnetization lies along a particular\ndirection(s) in the martensite. This direction corresponds to a different lattice parameter\nthan the hard magnetization direction(s). So as the twin boundary moves to align the\nmagnetic moment with the field it is also aligning the lattice parameter that corresponds\nto the easy direction. This strains the material by the difference in the lattice parameters.\n\nAnother possible mechanism for producing large strains in FSMAs is the field-\ninduced austenite to martensite phase transformation. This phase transition is another\ntypical characteristic of FSMAs, although it is usually activated thermally or\nmechanically. The high crystal symmetry austenite phase has a different lattice\nparameter than the martensite phase. So phase boundary motion will also strain the\nmaterial (Figure 2). This paper presents a simple phenomenological model that\ndemonstrates magnetic field induced twin boundary motion and austenite-martensite\nphase transformation, resulting in large recoverable strains.\nImage removed due to copyright considerations. See reference [2].\n\nFigure 2: Field induced phase boundary motion\n\nThis paper investigates the specific case: unconstrained deformation of single\ncrystal multiphase iron palladium (FePd) when subjected to a magnetic field. First a\ndescription of the austenite and martensite phases is presented, then an overview of the\ngoverning energetics and finally an analytical quantitative analysis of the strain as a\nfunction of external magnetic field.\n\nAustenite and Martensite Phase In FePd\n\nFePd is a promising FSMA for device applications. FePd has high\nmagnetocrystalline anisotropy, which facilitates twin boundary motion. Also FePd is\nductile in both phases. This improves reliability for actuator type devices over brittle Ni-\nMn-Ga.\nThe root cause of the shape memory effect (SME) in FePd is an austenite to\nmartensite solid state phase transformation. In the austenite phase FePd has a face\ncentered cubic (FCC) crystal structure and in the martensite phase, a face centered\ntetragonal structure (FCT) (Figure 3).\n\nImage removed due to copyright considerations. See reference [5].\n\nReferring to figure 3, it can be seen that the martensite phase is elongated on two sides\nand shortened on one side when compared to the austenite phase. This microscopic\nchange of shape causes macroscopic deformations as the entire sample switches phase. It\nis also important to note the easy axes of magnetization. The martensite phase of FePd\ndemonstrates high magnetic anisotropy, favoring to magnetize in the elongated\ndirections, indicated with arrows [a 0 0]. Conversely austenite has low magnetic\nanisotropy with hard directions along [ao 0 0], again indicated with arrows.\n\nThe martensite phase creates internal stresses as it nucleates and grows within the\naustenite phase. The stresses become large enough to necessitate compensation. This\ncan be accomplished by twinning or slip (Figure 4).\n\nBoth methods of compensation have energy barriers and equilibrium conditions. The\nenergy barrier to twin is smaller than the energy required to slip. This can be shown\nanalytically and is experimentally observable.[3,4] Fortunately FePd prefers to twin\nrather than slip because it is precisely this that allows for large strains in the martensite\nphase.\n\nFePd can also produce large strains through an austenite-martensite phase\ntransformation. Here it is phase boundary motion that consumes the unfavorable phase.\nThe energetics of this transformation are detailed in the following sections.\n\nGoverning Energetics\n\nWhen considering the preferred state of a system, energy equilibrium is the place\nto start. The current system has 3 main types of governing energy; magnetic, mechanical,\nand latent heat. Each type of energy is now discussed in detail.\n\nMagnetic Energy\n\nThe possible contributors to magnetic energy in a system of this type are;\nexchange, domain wall, magnetostatic, magnetoelastic, magnetocrystalline anisotropy\nand Zeeman energy. As alluded to previously, the most important energies of this\nspecific system are magnetocrystalline anisotropy and Zeeman. What follows is\njustification for this assumption and quantitative representations of these energies.\nImage removed due to copyright considerations. See reference [2].\n\nExchange energy represents the energy cost of adjacent magnetic moments\npointing in different directions. For this model it is assumed that the martensite twins and\naustenite are single domain, therefore there will be no exchange energy contribution from\nwithin each variant/phase. However domains do exist between twins and between\nphases. It has been shown that the exchange energy is significant when compared to\nother energies of this system. In fact the exchange energy is large enough so that creating\na single variant/single phase sample is rarely possible. So this energy will be a constant\nin the system. For this reason the change in energy of twin/phase boundary motion will\nnot be a function of the exchange energy and can be omitted.[2]\nDomain wall energy is a combination of exchange energy and magnetocrystalline\nanisotropy or magnetostatic energy. The domain wall reduces the magnetocrystalline\nenergy by rotating the magnetic moment gradually over the thickness of the wall. This\ncomes at a cost of orienting the magnetic moment in an energetically undesirable\ncrystallographic orientation or by creating free poles at wall boundaries. The energy\ncontribution from domain walls can be neglected for the same reason as neglecting\nexchange energy given above.\nMagnetostatic energy arises from poles at an interface. Here it is assumed that the\nnormal component of magnetization is continuous across the twin/phase boundary\ninterface. This has been proved for the twin boundary case.[4] Therefore magnetostatic\nenergy contribution is nil.\nMagnetocrystalline anisotropy arises from the magnetization in a material having\na preferred crystallographic direction. As the magnetization moves away from this\ndirection, by an off axis field, the material becomes harder to magnetize. So for a given\nmagnetization the energy is lowest in the easy direction and highest in the hard direction.\nThe magnetocrystalline anisotropy energy per unit volume is quantified to leading order\nas\n\n(1)\nua = Ku Sin2@θD ... uniaxial\n\n(2)\nua = K1 Iα12 α22 + α22 α32 + α12 α32M ... cubic\n\nMagnetoelastic energy is magnetocrystalline anisotropy that is proportional to the strain\nof the lattice. Because the strain from twin/phase boundary motion is much larger than\nthe lattice strain this energy can be neglected.\nThe Zeeman energy is the potential energy of a magnetic moment in a magnetic\nfield. This is the energy that tends to align the magnetic moment with the applied field.\nWritten as energy per unit volume, the Zeeman energy is quantified as\n\n(3)\nuz = -Ms.H\n\nMechanical Energy\n\nThe mechanical energy associated with this system is the well know continuum\nmechanics strain energy. This energy opposes the motion of twin/phase boundaries. It is\nquantified as\n\n(4)\nUe = 1\n2 Ceff eij2\n\nLatent Heat\n\nLatent heat is the energy associated with the phase change in a material. The\naustenite to martensite transformation is exothermic. The energy per unit volume is\nsimply\n\n(5)\nuL = 10.79 J erg\ncm3 N\n[5]\n\nAnalysis\n\nFor the purposes of this paper further assumptions can be made to simplify the\nenergetics. First a 2D simulation reduces the number of variants for the analytical\nanalysis. The analysis presented is, in general, valid in full 3D form however it is\ncumbersome to deal with all variants in the analytical calculations. This assumptions\nlead to the following arrangement (Figure 5).\n\nFigure 5: 2D FePd martensite variants (f1, f2) and austenite phase (fa)\n\nTo further simplify the calculation the applied field (H) is along the direction of easy\nmagnetization of variant 1, and the twinning angle between variants is 90o. Here f1, f2\nand fa are the respective volume fractions. With these simplifications the total Zeeman\nenergy for the system becomes\n\n(6)\nUz = -Msa H fa -Msm.H f1\n\nHere the subscripts \"a\" and \"m\" refer to austenite and martensite respectively. It is\nassumed that the anisotropy of the martensite phase is strong enough to keep the\nmagnetic moment of variant 2 orthogonal to the field, therefore it does not contribute to\nthe Zeeman energy.\n\nThe simplifications lead to a magnetocrystalline anisotropy energy of\n\n(7)\nUa = Ku i\nk\nMsm H\n2 Ku\ny\n{\nf2 + K1 i\nk\nMsa H\n2 K1\ny\n{\nfa\n\nHere the cosine of the angle between the field and magnetization is written as a ratio of\nthe Zeeman and magnetocrystalline anisotropy energies. Martensite variant 1 is\nmagnetized along its easy direction and therefore does not contribute to the anisotropy\nenergy.\n\nWith the reduced dimensions, a good approximation to the strain energy is\n\n(8)\nUe = 1\n2 Ceff Iex2 +ey2M\n\nwhere,\n\nex = HHf1a + f2c + faaoL -Hf1oa+ f2oc + faoaoLL\nHf1oa+ f2oc + faoaoL\n\ney = HHf1c+ f2 a + faaoL -Hf1oc+ f2oa + faoaoLL\nHf1oa + f2oc +faoaoL\n\nHere \"Ceff\" is the effective material modulus (Ceff = 100*109 Pa), \"fxo\" denotes an\ninitial volume fraction (fxo = 1/3), \"c\" is the shortened martensite lattice parameter (c =\n3.630*10-10 m), \"a\" is the elongated lattice parameter (a = 3.822*10-10 m), and \"ao\" is the\naustenite lattice parameter (ao = 3.756*10-10 m).[5]\n\nThe final energy contribution, the latent heat, is written as\n\n(9)\nUL = uL Hfa-faoL\n\nCombining equations 6-9 gives the total energy of the system.\n\n(10)\nU = -Msa H fa -Msm H f1 + Ku i\nk\nMsm H\n2 Ku\ny\n{\nf2 + K1 i\nk\nMsa H\n2 K1\ny\n{\nfa+ 1\n2 Ceff Iex2 + ey2M + uL Hfa -faoL\n\nThe minimum of equation 10 subject to the constraint\n\n(11)\nf1+ f2 + fa = 1\n\ngives the variant/phase distribution of the material as a function of the applied field.\nOnce this is known, useful information like average magnetization and strain is easily\nextracted. This problem is solved using the Lagrangian multiplier method. The full\nsolution is given in Appendix A, results are given in the following section.\n\nApplying the Lagrangian multiplier method to equations 10 &11 results in three\nequations of 5 variables\n\n(12)\n\n-1.99465× 1012 + 1.99063× 1012 f1 + 1.98799× 1012 f2 + 2.00532× 1012 fa -1220. H == 2 f1 lam,\n-1.99465× 1012 + 1.98799× 1012 f1 + 1.99063× 1012 f2 + 2.00532× 1012 fa + 1.0912 H2 == 2 f2 lam,\n-2.0106× 1012 + 2.00532× 1012 f1 + 2.00532× 1012 f2 + 2.02147× 1012 fa -1080. H -58.32 H2 == 2 fa lam\n\nA plausible value for lambda can be found by remembering the initial condition (Ho = 0,\nf1o = f2o = fao = 1/3). Then with the value of lambda known, the volume fractions can\nbe solved for as a function of the field.\n\nResults\n\nFor low magnetic fields (H ~ 1 kOe) the volume fraction distribution is shown in\nfigure 6.\n\nFigure 6: Martensite variant and austenite volume fraction in the low field regime\n\nThis figure shows that low magnetic fields have a large effect on the martensite variant\ndistribution and little effect on the phase distribution. The f2 variant is completely\nconsumed (This is a good approximation with the qualification that exchange energy\nprohibits complete consumption) by the f1 variant, while the fa fraction remains\nessentially constant. It is obvious that the volume fraction of f2 cannot be negative\ntherefore a second high field solution was generated where the initial volume fractions\nare f1o = 2/3 and fao = 1/3. The solution to this high field situation is given in appendix\nB. The high magnetic field (H ~ 1000 kOe) volume fraction distribution is shown in\nfigure 7.\n\nFigure 7: Martensite variant and austenite volume fraction in the high field regime\n\nThis figure shows that a high magnetic field can produce a phase transformation. The\naustenite phase is completely consumed (This is a good approximation with the\nqualification that exchange energy prohibits complete consumption) by the single variant\nmartensite phase.\nWith the variant fractions known, the strain can be calculated using the definition\nprovided for equation 8. The low field strain is shown in figure 8.\n\nFigure 8: Strain in the low magnetic field regime\n\nThis figure shows the expected positive strain in the direction of applied field and\nnegative strain in the orthogonal direction. Also it can be seen that the strain is nearly\nlinear with the applied field in the low field regime. The high field strain is shown in\nfigure 9.\n\nFigure 9: Strain in the high magnetic field regime\n\nThis figure shows a continued positive strain in the field direction and contraction\northogonal to the field. In the high field regime the material has a nonlinear strain\nresponse to the applied field. The total strain for the given initial conditions is ~ 3%.\n\nDiscussion\n\nAs seen in figures 8 and 9, FePd has 2 distinct strain response regimes for an\napplied magnetic field. This is the result of 2 different mechanisms. In the low field\nregime the strain is a result of twin boundary motion and in the high field regime the\nstrain is a result of phase boundary motion. This is determined from the fact that the\naustenite volume fraction remain approximately unchanged in the low field regime and in\nthe high field regime there is only one variant of martensite so the only mechanism to\ncreate strain is phase boundary motion. With this consideration, the fa terms can be\nremoved from equation 10 to simplify the energetics of the low field regime. This\nmodification clarifies the energetics to\n\n(13)\nU = -f1 Msm H + f2 H2 Msm\n4 Ku\n+ 1\n2 Ceff Iex\n2 + ey\n2M\n\nThe Zeeman energy of the f1 variant and the magnetocrystalline anisotropy energy of the\nf2 variant drive the twin boundary while the elastic energy opposes the motion.\nSimilarly, removing the f2 terms from equation 10 clarifies the energetics of the high\nfield regime.\n\n(14)\nU = -f1 H Msm + fa H2 Msa\n4 K1\n+ Hfa -faoL uL -fa H Msa + 1\n2 Ceff Iex\n2 + ey\n2M\n\nThe Zeeman energy of the f1 variant, and magnetocrystalline anisotropy energy and the\nlatent heat of fa drive the phase boundary while the Zeeman energy of fa and elastic\nenergy oppose the motion. Equations 13 and 14 quantify the energetics of the two\nmechanisms that drive the magnetically induced strain in FePd.\n\nConclusion\n\nA simple model has been presented to describe the field induced strain in FSMA\nFePd. The model demonstrates two regimes of strain response. The active mechanism in\nthe low field regime is twin boundary motion while the mechanism in the high field\nregime is phase boundary motion.\nFor evenly dispersed initial volume fractions the material strained ~3% while\napproximately fully transforming into the favorably oriented martensite variant. The\namount of strain induced in the low and high magnetic field regimes is ~1.5%. The low\nfield regime is 3 orders of magnitude more efficient at producing strain when compared\nto the high field regime (by comparing the applied fields). However the high field\nresponse is still valuable because it can be used to fully transform the material into the\nmartensite phase, which is not always possible using typical metallurgical techniques.\nAlso this allows the material to realize its full strain capabilities.\n\nReferences\n\n[1] S.J. Murray, M. Marioni, S.M. Allen, R.C. O'Handley, App. Phys. Let., Vol. 77,\nNo.6, 2000\n[2] R. C. O'Handley, J. of App. Phys., Vol. 83, No. 6, 1998.\n[3] H. Kato et. al., Mat. Sci. & Eng., A322, 2002\n[4] R. D. James and M. Wuttig, Phil. Mag. A, Vol. 77, No. 5, 1998.\n[5] J. Cui, T.W. Shield, R.D. James, Acta Materialia, Vol. 52, 2004\n[6] R.C. O'Handley, Modern Magnetic Materials, Wiley-Interscience, 1999\n\nAppendix A\nVolume Distribution Solution - Low Magnetic Field\nu Programming Options\nNeeds@\"OptimizationToolbox`QuadraticProgramming`\"D;\nOff@General::\"spell1\"D\nOff@General::\"spell\"D\n<< Calculus`VectorAnalysis`\nu Energies\nZeeman energy\nUz1 = -Hf1L Msm H ;\nUz2 = 0;\nUza = -HfaL Msa H;\nUz = Uz1 + Uz2 + Uza;\nAnisotropy energy\nUa1 = 0;\nUa2 = Hf2L Ku HMsm H e 2 e KuL^2;\nUaa = HfaL K1 HMsa H e 2 e K1L^2;\nUa = Ua1 + Ua2 + Uaa;\nStrain energy relative to initial condition\nex = HHf1 a + f2 c + fa aoL -Hf1o a + f2o c + fao aoLL e Hf1o a + f2o c + fao aoL;\ney = HHf1 c + f2 a + fa aoL -Hf1o c + f2o a + fao aoLL e Hf1o c + f2o a + fao aoL;\nUe = 10 ∗Ceff Hex^2 + ey^2L e 2;\nLatent Heat\nUl = Hfa -faoL L;\nTotal energy\nAppendix A.nb\n\nU = Simplify@Uz + Ua + Ue + UlD\n5 Ceff\ni\nk\njjj Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL2\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+ Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL2\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccc\nHa f1o + c f2o + ao faoL2\ny\n{\nzzz +\nHfa -faoL L -fa H Msa + fa H2 Msa2\ncccccccccccccccccccccccccc\n4 K1\n-f1 H Msm + f2 H2 Msm2\ncccccccccccccccccccccccccc\n4 Ku\nu Langrangian Multiplier Method\nEquating the gradient of the extreme value function to the gradient of the constraining function multiplied by lambda\nGradient of the energy equation with respect to the variant fractions\nGradU = Grad@U, Cartesian@f1, f2, faDD\n95 Ceff J 2 c Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+\n2 a Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN -H Msm,\n5 Ceff J 2 a Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+\n2 c Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN + H2 Msm2\nccccccccccccccccccc\n4 Ku\n,\n5 Ceff J 2 ao Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+\n2 ao Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN + L -H Msa + H2 Msa2\nccccccccccccccccccc\n4 K1\n=\nGradient of the constraint equation\nGradF = Grad@lam ∗Hf12 + f22 + fa2 -1L, Cartesian@f1, f2, faDD\n82 f1 lam, 2 f2 lam, 2 fa lam<\nEquating the gradient of the extreme value function to the gradient of the constraining function\neqns = 8GradU@@1DD m GradF@@1DD, GradU@@2DD m GradF@@2DD, GradU@@3DD m GradF@@3DD<\n95 Ceff J 2 c Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+\n2 a Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN -H Msm == 2 f1 lam,\n5 Ceff J 2 a Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+\n2 c Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN + H2 Msm2\nccccccccccccccccccc\n4 Ku\n== 2 f2 lam,\n5 Ceff J 2 ao Hc Hf1 -f1oL + a Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+\n2 ao Ha Hf1 -f1oL + c Hf2 -f2oL + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN + L -H Msa + H2 Msa2\nccccccccccccccccccc\n4 K1\n== 2 fa lam=\nAppendix A.nb\n\nu Numerical Parameters [5]\nLattice parameters\nao = 3.756 ∗10-10 H∗m∗L;\na = 3.822 ∗10-10 H∗m∗L;\nc = 3.630 ∗10-10 H∗m∗L;\nSaturation magnetization relative to each variant\nMsm = 1220H∗emuecm3∗L;\nMsa = 1080H∗emuecm3∗L;\nAnisotropy constants\nKu = 3.41 ∗105 H∗ergecm3∗L;\nK1 = -5 ∗103H∗ergecm3∗L;\nEffective modulus\nCeff = 100 ∗10^9 H∗Pa∗L;\nLatent heat fcc-fct\nL = 10.79 ∗107H∗ergecm3∗L;\nInitial volume fraction\nf1o = 1 e 3;\nf2o = 1 e 3;\nfao = 1 e 3;\nu Solving for Volume Fraction\nsimpeqns@H_D = Simplify@eqnsD\n8-1.99465× 1012 + 1.99063× 1012 f1 + 1.98799× 1012 f2 + 2.00532 × 1012 fa -1220. H == 2 f1 lam,\n-1.99465× 1012 + 1.98799× 1012 f1 + 1.99063× 1012 f2 + 2.00532 × 1012 fa + 1.0912 H2 == 2 f2 lam,\n-2.0106 × 1012 + 2.00532 × 1012 f1 + 2.00532 × 1012 f2 +\n2.02147× 1012 fa -1080. H -58.32 H2 == 2 fa lam<\nSolving for the variant fractions that minimize the energy as a function of applied field\nAppendix A.nb\n\nfsol = Solve@simpeqns@HD, 8f1, f2, fa<D;\nf1@H_, lam_D = f1 e. fsol@@1, 1DD\nf2@H_, lam_D = f2 e. fsol@@1, 2DD\nfa@H_, lam_D = fa e. fsol@@1, 3DD\n-4.98672× 10-13 H-2.0106 × 1012 -1080. H -58.32 H2L +\nH4.98672× 10-13 H-1. H-1.98799 × 1012 H-2.0106 × 1012 -1080. H -58.32 H2L +\n2.00532 × 1012 H-1.99465 × 1012 + 1.0912 H2LL\nH3.98656× 1024 -2.00532 × 1012 H1.99063 × 1012 -2. lamLL +\nH2.00532 × 1012 H-1.99465× 1012 -1220. HL -1. H-2.0106 × 1012 -1080. H -58.32 H2L\nH1.99063× 1012 -2. lamLL H5.29631 × 1021 -4.01065 × 1012 lamLL\nH2.02147× 1012 -2. lamLL e H-5.6871 × 1030 + 6.35566 × 1034 lam -\n4.81497 × 1025 lam2 + 1.60426 × 1013 lam3L +\n1. HH-1.98799× 1012 H-2.0106 × 1012 -1080. H -58.32 H2L +\n2.00532 × 1012 H-1.99465× 1012 + 1.0912 H2LL e H5.29631 × 1021 -4.01065 × 1012 lamL -\nH1. H-1. H-1.98799 × 1012 H-2.0106 × 1012 -1080. H -58.32 H2L +\n2.00532 × 1012 H-1.99465 × 1012 + 1.0912 H2LL\nH3.98656× 1024 -2.00532× 1012 H1.99063 × 1012 -2. lamLL +\nH2.00532 × 1012 H-1.99465× 1012 -1220. HL -1. H-2.0106 × 1012 -1080. H -58.32 H2L\nH1.99063× 1012 -2. lamLL H5.29631 × 1021 -4.01065 × 1012 lamLL\nH4.02133× 1024 -1.98799 × 1012 H2.02147 × 1012 -2. lamLLL e\nHH5.29631 × 1021 -4.01065 × 1012 lamL\nH-5.6871 × 1030 + 6.35566× 1034 lam -4.81497 × 1025 lam2 + 1.60426 × 1013 lam3LLL\n-H1. H-1.98799 × 1012 H-2.0106 × 1012 -1080. H -58.32 H2L +\n2.00532 × 1012 H-1.99465× 1012 + 1.0912 H2LLL e H5.29631× 1021 -4.01065× 1012 lamL +\nHH-1. H-1.98799× 1012 H-2.0106 × 1012 -1080. H -58.32 H2L + 2.00532× 1012 H-1.99465 × 1012 +\n1.0912 H2LL H3.98656 × 1024 -2.00532 × 1012 H1.99063× 1012 -2. lamLL +\nH2.00532 × 1012 H-1.99465× 1012 -1220. HL -1. H-2.0106 × 1012 -1080. H -58.32 H2L\nH1.99063× 1012 -2. lamLL H5.29631 × 1021 -4.01065 × 1012 lamLL\nH4.02133× 1024 -1.98799 × 1012 H2.02147× 1012 -2. lamLLL e\nHH5.29631 × 1021 -4.01065 × 1012 lamL\nH-5.6871 × 1030 + 6.35566× 1034 lam -4.81497 × 1025 lam2 + 1.60426× 1013 lam3LL\n-H1. H-1. H-1.98799 × 1012 H-2.0106 × 1012 -1080. H -58.32 H2L +\n2.00532 × 1012 H-1.99465 × 1012 + 1.0912 H2LL\nH3.98656× 1024 -2.00532 × 1012 H1.99063 × 1012 -2. lamLL +\nH2.00532 × 1012 H-1.99465× 1012 -1220. HL -1. H-2.0106 × 1012 -1080. H -58.32 H2L\nH1.99063× 1012 -2. lamLL H5.29631 × 1021 -4.01065 × 1012 lamLLL e\nH-5.6871 × 1030 + 6.35566 × 1034 lam -4.81497 × 1025 lam2 + 1.60426 × 1013 lam3L\nSolving for lambda\nAppendix A.nb\n\nsol1 = Solve@f1@0, lamD m 1 e 3, lamD\nsol2 = Solve@f2@0, lamD m 1 e 3, lamD\nsola = Solve@fa@0, lamD m 1 e 3, lamD\nlambda = lam e. sol1@@2DD\n88lam →-9.32668× 109<, 8lam →1.32056× 109<, 8lam →1.32056 × 109<, 8lam →1.73996 × 1010<<\n88lam →-9.32668× 109<, 8lam →1.32056× 109 -789.133 C<,\n8lam →1.32056 × 109 + 789.133 C<, 8lam →1.73996 × 1010<<\n88lam →-7.92756× 109 -1.60973 × 1010 C<, 8lam →-7.92756× 109 + 1.60973 × 1010 C<<\n1.32056× 109\nChecking the initial volume fraction distribution\nf1@0, lambdaD\nf2@0, lambdaD\nfa@0, lambdaD\n0.301865\n0.335981\n0.362344\nVolume fraction distribution vs. applied field\nAppendix A.nb\n\nPlot@8f1@H, lambdaD, f2@H, lambdaD, fa@H, lambdaD<,\n8H, 0, 1<, AxesOrigin →80, 0<, AxesLabel →8\"H HkOeL\", \"f\"<D\n0.2\n0.4\n0.6\n0.8\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\nf\nh Graphics h\nStrain vs. applied field\nAppendix A.nb\n\nexh@H_D = HHf1@H, lambdaD a + f2@H, lambdaD c + fa@H, lambdaD aoL -Hf1o a + f2o c + fao aoLL e\nHf1o a + f2o c + fao aoL;\neyh@H_D = HHf1@H, lambdaD c + f2@H, lambdaD a + fa@H, lambdaD aoL -Hf1o c + f2o a + fao aoLL e\nHf1o c + f2o a + fao aoL;\nPlot@8exh@HD, eyh@HD<, 8H, 0, .85<D\n0.2\n0.4\n0.6\n0.\n-0.015\n-0.01\n-0.005\n0.005\n0.01\n0.015\nh Graphics h\nAppendix A.nb\n\nAppendix B\nVolume Distribution Solution - High Magnetic Field\nu Programming Options\nNeeds@\"OptimizationToolbox`QuadraticProgramming`\"D;\nOff@General::\"spell1\"D\nOff@General::\"spell\"D\n<< Calculus`VectorAnalysis`\nu Energies\nZeeman energy\nUz1 = -Hf1L Msm H ;\nUz2 = 0;\nUza = -HfaL Msa H;\nUz = Uz1 + Uz2 + Uza;\nAnisotropy energy\nUa1 = 0;\nUa2 = 0;\nUaa = HfaL K1 HMsa H e 2 e K1L^2;\nUa = Ua1 + Ua2 + Uaa;\nStrain energy relative to initial condition\nex = HHf1 a + fa aoL -Hf1o a + f2o c + fao aoLL e Hf1o a + f2o c + fao aoL;\ney = HHf1 c + fa aoL -Hf1o c + f2o a + fao aoLL e Hf1o c + f2o a + fao aoL;\nUe = 10 ∗Ceff Hex^2 + ey^2L e 2;\nLatent Heat\nUl = Hfa -faoL L;\nTotal energy\nAppendix B.nb\n\nU = Simplify@Uz + Ua + Ue + UlD\n5 Ceff i\nk\njjj Hc Hf1 -f1oL -a f2o + ao Hfa -faoLL2\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+ Ha Hf1 -f1oL -c f2o + ao Hfa -faoLL2\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\ny\n{\nzzz +\nHfa -faoL L -fa H Msa + fa H2 Msa2\ncccccccccccccccccccccccccc\n4 K1\n-f1 H Msm\nu Langrangian Multiplier Method\nHere the equation to be minimized is the energy equation and the constraining equation is the volume fractions\nGradient of the energy equation with respect to the variant fractions\nGradU = Grad@U, Cartesian@f1, fa, zDD\n95 Ceff J 2 c Hc Hf1 -f1oL -a f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+ 2 a Ha Hf1 -f1oL -c f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN -\nH Msm,\n5 Ceff J 2 ao Hc Hf1 -f1oL -a f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+ 2 ao Ha Hf1 -f1oL -c f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN +\nL -H Msa + H2 Msa2\nccccccccccccccccccc\n4 K1\n, 0=\nGradient of the constraint equation\nGradF = Grad@lam ∗Hf12 + fa2 -1L, Cartesian@f1, fa, zDD\n82 f1 lam, 2 fa lam, 0<\nEquating the gradient of the extreme value function to the gradient of the constraining function multiplied by lambda\neqns = 8GradU@@1DD m GradF@@1DD, GradU@@2DD m GradF@@2DD<\n95 Ceff J 2 c Hc Hf1 -f1oL -a f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+ 2 a Ha Hf1 -f1oL -c f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN -\nH Msm == 2 f1 lam,\n5 Ceff J 2 ao Hc Hf1 -f1oL -a f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccccccccccccccccccc\nHc f1o + a f2o + ao faoL2\n+ 2 ao Ha Hf1 -f1oL -c f2o + ao Hfa -faoLL\ncccccccccccccccccccccccccccccccc\ncccccccccccccccccccccccccccccccc\nccccccccccccccccccccccccccccccccccccccc\nHa f1o + c f2o + ao faoL2\nN +\nL -H Msa + H2 Msa2\nccccccccccccccccccc\n4 K1\n== 2 fa lam=\nu Numerical Parameters [5]\nLattice parameters\nao = 3.756 ∗10-10 H∗m∗L;\na = 3.822 ∗10-10 H∗m∗L;\nc = 3.630 ∗10-10 H∗m∗L;\nSaturation magnetization relative to each variant\nAppendix B.nb\n\nMsm = 1220H∗emuecm3∗L;\nMsa = 1080H∗emuecm3∗L;\nAnisotropy constants\nKu = 3.41 ∗105 H∗ergecm3∗L;\nK1 = -5 ∗103H∗ergecm3∗L;\nEffective modulus\nCeff = 100 ∗10^9 H∗Pa∗L;\nLatent heat fcc-fct\nL = 10.79 ∗107H∗ergecm3∗L;\nInitial volume fraction\nf1o = 1 e 3;\nf2o = 1 e 3;\nfao = 1 e 3;\nu Solving for Volume Fraction\nsimpeqns@H_D = Simplify@eqnsD\n8-1.99465× 1012 + 1.99063× 1012 f1 + 2.00532× 1012 fa -1220. H == 2 f1 lam,\n-2.0106 × 1012 + 2.00532 × 1012 f1 + 2.02147 × 1012 fa -1080. H -58.32 H2 == 2 fa lam<\nSolving for the variant fractions that minimize the energy as a function of applied field\nfsol = Solve@simpeqns@HD, 8f1, fa<D;\nf1@H_, lam_D = f1 e. fsol@@1, 1DD\nfa@H_, lam_D = fa e. fsol@@1, 2DD\n-4.98672× 10-13 H-2.0106 × 1012 -1080. H -58.32 H2L +\nH4.98672× 10-13 H2.00532 × 1012 H-1.99465× 1012 -1220. HL -\n1. H-2.0106 × 1012 -1080. H -58.32 H2L H1.99063× 1012 -2. lamLL\nH2.02147× 1012 -2. lamLL e H-2.66948× 1021 + 8.0242 × 1012 lam -4. lam2L\n-H1. H2.00532 × 1012 H-1.99465× 1012 -1220. HL -\n1. H-2.0106 × 1012 -1080. H -58.32 H2L H1.99063× 1012 -2. lamLLL e\nH-2.66948× 1021 + 8.0242 × 1012 lam -4. lam2L\nSolving for lambda\nAppendix B.nb\n\nsol1 = Solve@f1@0, lamD m 2 e 3, lamD\nsola = Solve@fa@0, lamD m 1 e 3, lamD\nlambda = lam e. sola@@2DD\n88lam →1.15192 × 109<, 8lam →5.08912× 1011<<\n88lam →-1.011 × 1012<, 8lam →1.15033 × 109<<\n1.15033× 109\nChecking the initial volume fraction distribution\nf1@0, lambdaD\nfa@0, lambdaD\n0.666995\n0.333333\nVolume fraction distribution vs. applied field\nPlot@8f1@H, lambdaD, fa@H, lambdaD<, 8H, 1, 5000<,\nAxesOrigin →80, 0<, AxesLabel →8\"H HkOeL\", \"f\"<D\n0.2\n0.4\n0.6\n0.8\nh Graphics h\nStrain vs. applied field\nAppendix B.nb\n\nexh@H_D =\nHHf1@H, lambdaD a + fa@H, lambdaD aoL -Hf1o a + f2o c + fao aoLL e Hf1o a + f2o c + fao aoL;\neyh@H_D = HHf1@H, lambdaD c + fa@H, lambdaD aoL -Hf1o c + f2o a + fao aoLL e\nHf1o c + f2o a + fao aoL;\nPlot@8exh@HD, eyh@HD<, 8H, 1, 5000<, AxesOrigin →80, 0<D\n-0.02\n-0.01\n0.01\n0.02\n0.03\nh Graphics h\nAppendix B.nb"
    },
    {
      "category": "Resource",
      "title": "mccluskey_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/214e8f529f4b30b9447b0bf02a6967fb_mccluskey_slides.pdf",
      "content": "Magnetic Strain In FePd\nMagnetically Induced Strain In FePd\nPatrick McCluskey\nMagnetic Materials 3.45\nInstructor: Bob O'Handley\n\nMagnetic Strain In FePd\nFormat\n-\nShape memory effect in FePd\n- Shape memory phenomenon\n- Austenite / martensite phases\n- Twinning\n-\nEnergetics\n- Magnetic\n- Mechanic\n- Latent Heat\n-\nAnalysis\n- 2D simplification\n- Lagrangian multiplier method\n-\nResults\n-\nConclusion\n\nMagnetic Strain In FePd\nShape Memory Effect (SME)\n- Parent phase -\naustenite (FCC)\n- Cool to form\nmartensite (FCT)\n- Twinned structure is\nenergetically favorable\n- Stress/magnetic field\nmoves twin/phase\nboundaries\n- Heat to recover strain\nImage removed due to copyright considerations.\n\nMagnetic Strain In FePd\nFePd Phases\n- Austenite (FCC)\n- Martensite (FCT)\nRef. [5]\n\nMagnetic Strain In FePd\nTwinning\n- Minimizing strain\nenergy\n- Slip\n- Breaks more bonds\n- Twinning\n- Breaks less bonds\nImage removed due to copyright considerations. See reference [2].\n\nMagnetic Strain In FePd\nMagnetic Field Induced SME\n- Magnetic field can move twin and phase\nboundaries\nImage removed due to copyright considerations. See reference [2].\n\nMagnetic Strain In FePd\nEnergetics\n-\nExchange: Neglect\n-\nMagnetic anisotropy:\n-\nUniaxial (FCT):\n-\nCubic (FCC):\n-\nMagnetoelastic: Insignificant\n-\nZeeman:\n-\nElastic strain:\n-\nLatent Heat:\nua = Ku Sin2@θD\nua = K1 Iα12 α22 + α22 α32 + α12 α32M\nuz = -Ms.H\nUe = 1\n2 Ceff eij2\nuL = 10.79 J erg\ncm3 N\n\nMagnetic Strain In FePd\nVariants for FePd\n- 6 martensitic variants, 3 Austenite\n- Quadratic programming problem of 9 variables\nRef. [4]\nImage removed due to copyright considerations. See reference [5].\n\nMagnetic Strain In FePd\n2D Simplification\n-\nMagnetic anisotropy:\n-\nZeeman:\n-\nElastic strain:\n-\nLatent Heat:\n-\nTotal:\nUz = -Msa H fa -Msm.H f1\nUa = Ku i\nk\nMsm H\n2 Ku\ny\n{\nf2 + K1 i\nk\nMsa H\n2 K1\ny\n{\nfa\nUe = 1\n2 Ceff Iex2 +ey2M\nUL = uL Hfa-faoL\nU = Ua + Uz + Ue + UL\n\nMagnetic Strain In FePd\nResults\n- Volume Fraction vs. Magnetic Field (Low Field)\nU = -f1 Msm H + f2 H2 Msm\n4 Ku\n+ 1\n2 Ceff Iex\n2 + ey\n2M\n\nMagnetic Strain In FePd\nResults\n- Volume Fraction vs. Magnetic Field (High Field)\nU = -f1 H Msm + fa H2 Msa\n4 K1\n+ Hfa -faoL uL -fa H Msa + 1\n2 Ceff Iex\n2 + ey\n2M\n\nMagnetic Strain In FePd\nResults\n- Strain vs. Magnetic Field (Low Field)\n\nMagnetic Strain In FePd\nResults\n- Strain vs. Magnetic Field (High Field)\n\nMagnetic Strain In FePd\nConclusion\n- Low field (H ~ 1 kOe)\n- Twin boundary motion\n- Linear strain response (e ~ 1.5%)\n- Negligible phase transformation\n- High Field (H ~ 1000 kOe)\n- Phase boundary motion\n- Nonlinear strain response (e ~ 3.0%)\n- Full phase transformation\n\nMagnetic Strain In FePd\nReferences\n-\n[1] S.J. Murray, M. Marioni, S.M. Allen, R.C. O'Handley, App. Phys.\nLet., Vol. 77, No.6, 2000\n-\n[2] R. C. O'Handley, J. of App. Phys., Vol. 83, No. 6, 1998.\n-\n[3] H. Kato et. al., Mat. Sci. & Eng., A322, 2002\n-\n[4] R. D. James and M. Wuttig, Phil. Mag. A, Vol. 77, No. 5, 1998.\n-\n[5] J. Cui, T.W. Shield, R.D. James, Acta Materialia, Vol. 52, 2004\n-\n[6] R.C. O'Handley, Modern Magnetic Materials, Wiley-Interscience,"
    },
    {
      "category": "Resource",
      "title": "neltner_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/f014aa8cde10027174349efd0f90fadd_neltner_paper.pdf",
      "content": "3.45 Paper, Tunneling Magnetoresistance\nBrian Neltner\nMay 14, 2004\nIntroduction\nIn the past few decades, there have been great strides in the area of magneto-\nresistance- the effect of magnetic state on the resistance of a material. The\nmagnetization dependence of resistance is of great interest due to the applica-\ntions to magnetic recording media where the state of a magnetic material needs\nto be read at high speeds.\nBefore Magnetoresistance was utilized, the best way to read a magnetic state\nwas to move over the magnetic surface with a coil of wire. This method had\ntwo major flaws- the inductance of the circuit inevitably causes a time constant\ndelay in your reading and the currents induced are relatively small and difficult\nto detect. Magnetoresistance, then, solves both of these problems- there is no\ninductor, so there is no inherent electronic restriction on reading speed, and\nbecause the Magnetoresistive effect frequently causes a change in resistance on\nthe order of at least a few percent, it is easily detectable.\nFollowing Robert O'Handley's textbook[2], by magnetizing a ferromagnet\nalong a particular direction, commonly done by using an anti-ferromagnet to\npin the magnetization direction at 45*to the direction of the magnetic field being\ndetected (a magnetic field would either move the ferromagnet's magnetization\nmore parallel or more perpendicular to a current flowing through the device). If\nthe magnetization moves perpendicular to the current it reduces the resistance,\nand moving parallel to the current increases the resistance.\nAnisotropic Magnetoresistance\nThe first notable magneto-resistive effect discovered in ferromagnets was called\nAnisotropic Magnetoresistance (AMR), and results in a resistance change on\nthe order of several percent. AMR was first discovered by William Thomson\nin 1857, but was regarded mainly as a curiosity until the advent of magnetic\nrecording technology.[1]\nAMR occurs because spin-orbit interactions cause a mixing of the majority\nand minority spin carriers. By considering a Hamiltonian containing the crystal\nfield splitting, exchange splitting, and spin-orbit coupling, the AMR effect can\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nbe calculated as[1]\nρ∥-ρ⊥\n3ρ∥+ 2\n3ρ⊥\n= -3\n\"\nA2\n(Eex -∆CF )2 -\nA2\n∆2\nCF\n#\n.\n(1)\nGiant Magnetoresistance\nIn 1998, Baibich discovered Giant Magnetoresistance (GMR). Giant Magnetore-\nsistance resulted in resistance changes on the order of 50%, a huge increase over\nstandard AMR. The GMR effect is seen in layered materials where the spin\nflips from layer to layer, and is a function only of the relative magnetizations of\nadjacent layers. It has been observed to obey\n∆ρ (θ)\nρ\n=\nμ∆ρ\nρ\n¶\nGMR\n[1 -cos ψ]\n(2)\nwith ψ as the angle between magnetizations of adjacent layers and\n∆ρ\nρ\n\nGMR\nas the GMR ratio. By changing the H applied perpendicular to M, you can\nshift ψ, causing large changes in ∆ρ.\nThe primary mechanism of GMR lies in the two currents (one for spin up\nand one for spin down electrons) having different scattering probabilities de-\npending upon the magnetization of the layer they are travelling through. In the\ncase where two adjacent layers have opposite magnetizations, spin up electrons\nwill, for example, have a high scattering through the first and a low scattering\nthrough the second, giving a total resistance R↑. The spin down electrons will\nhave an equivalently low scattering through the first layer and an equivalently\nhigh scattering through the second layer, resulting in a resistance R↓equal to\nR↑.\nHowever, in the case where the two layers are magnetized in the same di-\nrection, you have for the spin up electrons two sequential low scattering layers\nto go through, with a total resistance much lower than R↑. Alternatively, the\nresistance of the spin down electrons will be much higher than R↓as they are\ngoing through two sequential high scattering layers.\nAdding the two resistances of the ferromagnetically coupled layers together\nin parallel will always result in a lower resistance than the anti-ferromagnetically\ncoupled layers; thus, if you were to keep one layer fixed and rotate the other,\nyou can get very large changes in resistance- the GMR effect.\nGeneral Theory of TMR\nFollowing now M. Ziese's review of Magnetoresistance[1], if a tunneling barrier\nis placed between the two ferromagnetic layers, you have tunneling Magnetore-\nsistance (TMR). If you assume that spin is conserved upon tunneling through\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nthe barrier, there are some interesting effects caused by the two-current model.\nThe crux of the problem is that the tunneling probability is governed by the\ndensity of states at the Fermi level not only for an electron, but for an electron of\nthe appropriate spin. Thus, you end up with a conductance that is proportional\nto the density of states for each spin on either side. (Figure 1)\nThis gives you a conductance proportional to the products of the densities\nof states[1]\nG↑↑∝(1 + P) (1 + P ′) + (1 -P) (1 -P ′)\n(3)\nG↑↓∝(1 + P) (1 -P ′) + (1 -P) (1 + P ′)\n(4)\nwith P and P ′ as the spin-polarizations of the ferromagnetic electrodes (where\nthe spin-polarization is defined as P ≡(N↑-N↓)\n(N↑+N↓)).\nUsing equations 3 and 4, we find we can write\n∆G\nG\n≡G↑↑-G↑↓\nG↑↑\n=\n2PP ′\n1 + PP ′\n(5)\n∆R\nR\n=\n2PP ′\n1 -PP ′ ,\n(6)\nwhere ∆R\nR is the Tunneling Magnetoresistance (TMR) ratio.\nIn 1989, Slonczewski used the free electron model with the Landauer-B uttiker\nformula to find that the conductance was of the form\nG ∝\n£\n1 + P 2\nfb cos(Θ)\n¤\n(7)\nwhere Θ is the total angle that the exchange fields in the ferromagnets span and\nPfb is an effective polarization dependant on the field splitting, such that for a\nImage removed due to copyright considerations. See reference [1].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nsingle band, Pfb = 1, which gives you\nG ∝[1 + cos(Θ)] ,\n(8)\nthe conductance relation for a simple spin valve; however, with two bands he\ncalculated the effective polarization as\nPfb =\n·(k↑-k↓)\n(k↑+ k↓)\n\n·\n\"¡\nκ2 -k↑k↓\n¢\n(κ2 + k↑k↓)\n#\n≡PAfb,\n(9)\nwhere k↑and k↓are the wavevectors of the electrons and κ is the decay length\nof the wavefunction (κ =\np\n2 (U0 -EF ) with U0 the barrier height and EF the\nFermi energy).\nLater on, A.M. Bratkovsky derived a slightly altered equation more rigorously.[3]\nHe directly solved the Schr odinger equation for a single-particle Hamiltonian\nwith an exchange energy\nH = -\nμ ħ2\n2μα\n¶\n+ Uα -h · ˆσ\n(10)\nwith α representing either the left terminal, barrier, or right terminal and μα\nrepresenting the reduced mass in the α region.\nBratkovsky directly calculated the tunneling coefficients for the barrier and\nused them to calculate\nG = e2\nπħ\nκ0\nπw\n\nκ0 (κ↑+ κ↓)\n¡\nκ2\n0 + μ2\nbarrierκ↑κ↓\n¢\nκ2\n0 + μ2\nbarrierκ2\n↑\nκ2\n0 + μ2\nbarrierκ2\n↓\n\ne-2κ0w\n(11)\nwith κ0 = [2μbarrier(U0-E)/ħ2]1/2, assuming the effective mass of an electron in\neach electrode is the same (same material), and w is the barrier width. Clearly,\nby choosing carefully the material in our barrier, we can significantly affect the\ntunneling conductance.\nThis new form for conductance leads to the altered form of the effective\npolarization,\nPfb =\n·(k↑-k↓)\n(k↑+ k↓)\n\n·\n\"¡\nκ2\n0 -μbarrierk↑k↓\n¢\n(κ2\n0 + μbarrierk↑k↓)\n#\n(≡PAfb)\n(12)\nEither of these equations allow us to use the free electron model to replace\nP = (n↑-n↓)\n(n↑+ n↓),\n(13)\nthe standard definition of the spin-polarization. Afb is a function of interface\nproperties (which affect κ primarily) and the effective mass. It ranges from -1\nto 1. In addition, it is interesting that as κ2 becomes larger or smaller than the\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nproduct μk↑k↓, Afb switches signs. In experiments, Slonczewski's expression\nfor the TMR ratio was a good approximation for wide, low barriers. In 1997,\nMacLaren solved the TMR problem taking into account the band structure of\nthe electrodes. This also found a dependence on the barrier height and thickness.\nAs with any tunneling problem, there is a dependence of conductance on\nthe applied voltage. Guinea found a functional dependence for the conductivity\nthat goes as\nG(V ) ∝\n1⁄2\n(V/JAF )2\nV ≪J (a/d)\n(a/d)2\nV ≫J (a/d)\n(14)\nwith a the lattice constant of the crystal, V the applied bias, d the thickness of\nthe barrier, and JAF the interface exchange constant.\nHalf-metallic tunneling junctions\nA very interesting aspect of the tunneling conductance can be seen by looking\nat the case where the magnetic electrodes are anti-parallel and are both totally\npolarized. This case is known as half-metallic because the Fermi energy is in\nthe conduction band for one spin, but above it for the other spin- thus, the\nmaterial is conductive for one spin, but insulating for the other. Two materials\nwith this property are CrO2 and Fe3O4. (Figure 2)\nIn this case, the two polarization terms, P and P ′ are 1 and -1. Clearly,\nfrom equation 5, in this case, the TMR goes to infinity.\nBratkovsky solves numerically the Hamiltonian for these half-metallic sys-\ntems with the inclusion of image forces and finds a TMR of 3000%(!!!), compared\nto 20% for an Iron-based junction, even with the electrodes at a 20*angle from\none another (taking into account the idealization of perfectly aligned spins).\n(Figure 3)\nTaking into account impurities in the barrier which allow sequential tunnel-\ning in a resonance, we find that the conductance increases sharply when the\nimpurity density of states\nν ≳\n3κ0\nπ\nε-1\ni\nexp(-κ0w)\nwith εi = ħ2κ2\n0/(2μbarrier).\nFor standard ferromagnetic electrodes, the conductance increases, but the\nTMR is reduced. In the case of half-metallics, however, the TMR is still only\nlimited by spin-flip processes in the interfaces or spin misalignments in the two\nelectrodes. Unfortunately, creating a resonant tunnel diode structure will also\nincrease the spin-flip rate, so having too large a concentration of defects in the\nbarrier will decrease the TMR. Regardless, it is possible to reach both high con-\nductivities and very large magnetoresistance in these half-metallic materials.\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nCoherent electron transport in the junction\nIt is also possible to create coherent electron transport by making the charac-\nteristic length scale of the system less than the phase coherence length. In the\nKondo and Fano regimes of resonance, it has been shown that the difference\nbetween the resistance for the parallel and antiparallel cases can be very large\ndue to the large change in number of conducting channels when magnetization\nchanges direction.[8]\nB.R. Bulka attempts to calculate the coherent electronic transport between\nferromagnetic electrodes separated by a nonmagnetic nanoparticle.[9] By using\nvarious methods, he finds the currents and magnetoresistances of a model system\nwith identical electrodes. Figure 4 uses a slave-boson method within the mean-\nfield approximation, while Figure 5 uses an equation of motion method.\nAs can clearly be seen, the method of calculation drastically effects the\nresults found, but in the Kondo and empty state regimes, they both give the\nsame results. Bulka predicts a large magnetoresistance in the mixed valence\nregime with a strong temperature dependance.\nImage removed due to copyright considerations. See reference [3].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nExperimental Results for TMR\nMoodera has reported a TMR (non-SET) of 20.2% at room temperature in a\nCo/Al2O3/Ni80Fe20 system, and measured the voltage dependance. (Figure 6\nand when using a superconduction counter-electrode, it was found that Co/NiFe\ngives a TMR of 27.2%. Shang also measured the TMR of several tunneling\njunctions, and found good agreement with the theoretical variation given in M.\nZiese's review.[1]\nFerromagnetic double junctions (fSETs)\nTunneling Magnetoresistance is a pretty cool effect in itself, but, naturally, any\nnanoscientist would want to combine it with other effects. One interesting thing\nto do is to take the fairly well understood single electron transistor system and\nmake the materials involved magnets.\nA standard non-magnetic single electron transistor consists of a drain and\nsource electrode with either a metallic island or a quantum dot between them.\nThis creates a double tunneling junction, once from the source to the island, and\nImage removed due to copyright considerations. See reference [3].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nanother from the island to the drain. When the capacitative charging energy\n(EC = e2/2C) of the island is larger than the thermal energy, it is found that\ncharge must build up in quantized chunks. This essentially forces the current\nthrough the double junction to increase in 2 electron steps every time the Fermi\nenergy of the electrons in the source electrode gets high enough to allow electrons\nto tunnel through the barrier to the island.\nThe situation becomes much more interesting with the introduction of fer-\nromagnetic materials- spin is assumed conserved in the tunneling event, but\nonce on the island, it can flip to tunnel to the anti-ferromagnetic drain (which\nmerely requires a relaxation time), continue on it's merry way if the drain is\nalso ferromagnetic, or, in the Kondo limit, you can even have coherent electron\ntransport going on. In addition, if your island itself is ferromagnetic, you have\nthe possibility of the spin of an electron which has tunneled from the source\nto the island now affecting the magnetization of the island, resulting in second\norder effects in the system.\nImage removed due to copyright considerations. See reference [9].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nQuantum Dot or Single-electron Islands\nW. Rudzi nski found theoretically[6] that for a system of ferromagnetic electrodes\nwith a nonmagnetic quantum dot or single atom as an island, the TMR was\nstrongly related to the factor Ω, defined by\nΩ=\nγ0τS\n,\nwhere γ0 is a parameter for a material related to the ratio of the spin-flip and\ntunneling rates. Ω=0 corresponds to no spin relaxation, Ω≫1 corresponds to\nfast spin relaxation (Figure 7) It can be clearly seen that using a material in\nwhich spins have a long spin relaxation time have a much larger TMR ratio.\nThis is particularly interesting because this model not only applies to an island,\nbut also to any other form of impurity between the two tunneling electrodes.\nLater, Ping Zhang included spin-orbit coupling while an electron is on the\nquantum dot in conjunction with prior results for the spin-flip mechanisms in\nImage removed due to copyright considerations. See reference [9].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nGaAs quantum dots to calculate resistances. The general gist of the derivation\nis that the electrons are being forced into a superposition of spin up and spin\ndown states relative to the electrodes as the quantization axes are fixed by the\ninternal magnetization. That coherence needed to be taken into account to solve\nmore exactly the resistance of the system.\nThis method eventually found that the Kondo resonance for spin up elec-\ntrons is suppressed while the resonance for spin down electrons is enhanced.\nIn addition, when there is a large spin-flip transition, the Kondo resonance is\nactually split into three energies for parallel electrodes, while splitting into only\ntwo energies when the electrodes are antiparallel.(Figure 8)\nImage removed due to copyright considerations. See reference [1].\nImage removed due to copyright considerations. See reference [6].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nZhang ends up calculating that when the dot level is higher than the chemical\npotential at the electrodes, the TMR is enhanced up to 160%.\nSpin Accumulation on a Ferromagnetic Is-\nland\nAnother interesting case is where you allow the island to be ferromagnetic as\nwell. By including spin accumulation on the island (the spin relaxation time\nis long on the island), J. Barnas found that you can enhance TMR, generate\nTMR when the central electrode is naturally non-magnetic, cause a negative\ndifferential resistance, or even reverse the sign of the tunnel Magnetoresistance.\n[5]\nThe key difference between having a non-magnetic and ferromagnetic island\nis that with a ferromagnetic island, the electron energy levels are no longer\ndegenerate (spin up and spin down electrons are split in energies).\nFollowing the Barnas derivation, there are a source and drain, both ferro-\nmagnetic, and either parallel or anti-parallel in magnetization, with the island\nferromagnetic and parallel to the source in magnetization. There is also a gate\nelectrode (sufficiently far away as to avoid tunneling) which controls the energy\nof the electrons on the island through a gate voltage applied capacitively.\nYou then assume that spin is conserved upon tunneling, and that the resis-\ntances for each spin through the tunneling junctions are greater than 2RQ, the\nquantum resistance.\nThe single-electron energy levels are then calculated for the island taking\ninto account all the magnetic energy contributions except for the Zeeman energy\nwhich is assumed to be small. Barnas then assumes that the energy spectrum\nof the electrons is shifted rigidly when the gate voltage is changed. This allows\nthem to calculate the tunneling rate of electrons from the drain to the level i of\nthe electrode as\nΓl(r)\niσ\n= 2π\nħ|M l(r)\niσ |2Dl(r)\nσ\n.\n(15)\nwith M l(r)\niσ\nas the average matrix element for transitions from the drain electrode\nImage removed due to copyright considerations. See reference [7].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nto the iσ level in the island and Dl(r)\nσ\nis the spin-dependent density of states in\nthe drain.\nThe magnetic moment on the island is M = N↑-N↓and the excess mag-\nnetic moment is M ∗= M -M0, with M0 the equilibrium magnetization of\nthe island. Then, the probability P is determined by minimizing ∂P ({n})\n∂t\n= 0,\nwhich includes all possible tunneling contributions to the distribution growth or\ndecays along with internal relaxation processes on the island and the influence\nof the gate voltage.\nIf you then restrict to a short electronic relaxation time while maintaining a\nmuch longer spin relaxation time, you find that the electrons are thermalized.\nThis gives you a formula for electric current as a function of P(N↑, N↓), the\nprobability that the island has N↑spin up electrons and N↓spin down electrons-\nI = e\nX\nN↑,N↓\nX\nσ\nX\niσ\nP(N↑, N↓)\n×\n(c)\n[1 -F(Eiσ|N↑, N↓)] Γr\niσf(Eiσ + Er-\nN∗-EF )-\n-F(Eiσ|N↑, N↓)Γr\niσ\n£\n1 -f(Eiσ + Er-\nN∗-EF )\n¤a\n.\n(16)\nwhere\nF(Eiσ|N↑, N↓) =\n1⁄2\n1 + exp\n·Eiσ -(1/2)(E1σ + E2σ)\n(1/2)kBT\n3⁄4-1\n.\n(17)\nThis gives a probability in the state space as shown in Figure 9, as well as a\ncurrent and TMR as shown in Figure 10.\nIn Figure 10, there are two interesting features, best seen on the graph of the\nderivative of the current with respect to voltage. The first is the large peaks,\nwhich are from the coulomb blockade behaviour. The second is the small peaks\nbetween the large peaks- these represent the opening of a tunneling channel with\na new value of excess spin on the island. This predicted behaviour is similar to\nwhat is seem in experiments with Al particles or C60 molecules. In addition, it\ncan be seen from the plot of TMR versus V that the TMR oscillates with the\nbias voltage, and decreases overall as V increases.\nIf it is assumed that the island to drain junction is more resistive than the\nsource to drain junction, it is found that electrons (and thus spin) accumulate\non the island. For overall charge accumulation, the parallel and antiparallel\nconfigurations are nearly identical, but the antiparallel configuration has a far\ngreater spin accumulation than the parallel configuration. (Figure 11)\nAs temperature increased, the small peaks disappeared quickly, followed by\nthe coulomb charging peaks at around 60 K for this theoretical system.\nVery small barriers\nIn 1999, X.H. Wang did an analysis of fSETs in the regime where the tunnel\nresistance is smaller than the quantum resistance h/e2. Following his work[4],\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nwe attempt to solve the tunneling Hamiltonian in a nonperturbative manner by\nusing path integrals. By using the standard single-electron tunneling Hamilto-\nnian with a spin-dependent density of states, we find that the high-temperature\nTMR ratio is simply\nγclassical =\n2PP ′\n1 -PP ′ ,\n(18)\nthe same equation we had calculated before for a simple ferromagnetic tunneling\njunction.\nTaking the coulomb charging effects into account as we lower the tempera-\nture, we find that the action of our system is given by\nSη[φ] =\nZ β\ndτ\nφ2(τ)\n4EC\n-αcl\nη\nZ β\ndτ\nZ β\ndτ ′χ(τ -τ ′) × cos[φ(τ) -φ(τ ′)].\n(19)\nImage removed due to copyright considerations. See reference [5].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nwhere η represents either the parallel or antiparallel state of the two leads,\nαcl\nη represents the normalized classical conductance, and φ represents the angle\nof the magnetism at a particular τ. The boundary condition is that φ(β) =\nφ(0) + 2πk.\nWang uses a Monte Carlo simulation to solve this path integral, finding that\nwhen the tunnel resistance is close to the quantum resistance, the result is the\nsame as for the cotunneling solution for a SET. He then chose to use Ni leads\nwith a spin polarization of P=0.23 and a Co island where P=0.35, along with\na typical value of αcl\nη =10, as this was one of the few setups that had been\nexperimentally observed at the time.\nThey found that the TMR is a strong function of temperature and reaches\nthe cotunneling limit when EC/kBT ≈15. Including higher order terms give\nan enhancement of 90%(!!!) to the TMR when EC/kBT ≈40. Fitting their\nImage removed due to copyright considerations. See reference [5].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nnumerical results to a second order function in EF /kBT gives\nγSE = γcl + μSE ¡\n1 + γcl¢ μ EC\nkBT\n¶2\n,\n(20)\nwith\nμSE = 0.04αM\n·\n1 + PP ′\n(1 + P)(1 + P ′)\n\n.\nClearly, this allows for a great deal of control over the TMR through vary-\ning the materials the leads are made of- by simply choosing an alloy with a\ndifferent spin-polarization or α, you can drastically change the TMR in the low\ntemperature limit.\nExperimental Results\nIt was found by L.F. Schelp [11] that in a fSET formed from Co electrodes\nwith an Al2O3 barrier containing a layer of small, disconnected Co clusters\n(Figure 12), coulomb blockade effects were induced by tunneling through the\nclusters. They found that the TMR did not change as temperature was varied\nfrom 50K to room temperature. They did, however, find that if they applied a\nstrong external field (which saturated the electrodes and islands), the resistance\nImage removed due to copyright considerations. See reference [5].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nwent down drastically. (Figure 13). In addition, they found a dependance on\nthe applied voltage. (Figure 14)\nConclusions\nMagnetoresistance is of great interest to modern nanoscience as it offers unique\nabilities in reading magnetic memory, storing magnetic bits in MRAM, and\nspintronics. Originally, Magnetoresistance was seen as a curiosity of magnetic\nmaterials which caused a fluctuation of a few percent in resistance as a material\nbecame magnetized. Recently, the discovery of Anisotropic Magnetoresistance,\nGiant Magnetoresistance, and Tunneling Magnetoresistance have all made this\nproperty much more practical for use in our daily lives. Anisotropic Magnetore-\nsistance gave us resistance fluctuations which were dependant upon the direction\nof magnetization, allowing us to read the direction of magnetic bits on magnetic\nrecording material. Then, Giant Magnetoresistance gave us a mechanism to\nagain read bits stored in magnetic orientation, but with a much greater change\nImage removed due to copyright considerations. See reference [11].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nin resistance. Much more recently, Tunneling Magnetoresistance has produced\nsystems where rotating the magnetic field of one electrode can result in a change\nin resistance of 20% easily, and with the potential of a several thousand percent\nchange in resistance in the case of half-metallic electrodes.\nAs our ability to manipulate materials on a nanoscale improves, we will\nundoubtably be able to produce tunneling magnetic junctions and even ferro-\nmagnetic single-electron transistors with extremely high changes in resistance\nthat operate at room temperature. As this technology becomes available, the\ndensity of magnetic material will become even greater, and as costs come down,\nGiant Magnetoresistance and even Tunneling Magnetoresistance will be used\nImage removed due to copyright considerations. See reference [11].\nImage removed due to copyright considerations. See reference [11].\n\n3.45, Tunneling Magnetoresistance and fSETs\nBrian Neltner\nin Magnetic RAM, a non-volitile replacement for traditional RAM which uses\nmagnetic instead of capacitative storage- conveniently alse removing the time\nconstant limitation inherant in all LRC circuits.\nAll in all, the various forms of Magnetoresistance are one of the most useful\nareas of research in magnetic materials today.\nReferences\n[1] M. Ziese, Rep. Prog. Phys. 65: 143-249 (2002)\n[2] Robert C. O'Handley, John Wiley & Sons, Inc., Modern Magnetic Materials\n(2000)\n[3] A.M. Bratkovsky, Phys. Rev. B 56: 2344-2347 (1997)\n[4] X.H. Wang, Arne Brataas, Phys. Rev. Lett. 83: 5138-5149 (1999)\n[5] J. Barn as, J. Martinek, G. Michalek, B.R. Bulka, A. Fert, Phys. Rev. B 62:\n12363-12373 (2000)\n[6] W. Rudzi nski, J. Barna s, Phys. Rev. B 64: 085318 (2001)\n[7] Ping Zhang, Qi-Kun Xue, Yupeng Wang, X.C. Xie, Phys. Rev. Lett. 89:\n286803 (2002)\n[8] N. Garcia, M. Munoz, Y.W. Zhao, Phys. Rev. Lett. 82: 2923 (1999)\n[9] Bogdan R. Bulka, Stanislaw Libi nskim Phys. Rev. B 67: 024404 (2003)\n[10] Rosa L opez, David S anchez, Phys. Rev. Lett. 90: 116602 (2002)\n[11] L.F. Schelp, A. Fert, F. Fettar, P. Holody, S.F. Lee, J.L. Maurice, F. Petroff,\nA. Vaur`es, Phys. Rev. B 56: R5747-R5750 (1997)"
    },
    {
      "category": "Resource",
      "title": "vikram_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/7a92e25eca16526878ad5656b62940fd_vikram_slides.pdf",
      "content": "FERROMAGNETIC\nSEMICONDUCTORS FOR\nSPINTRONIC AND\nMAGNETOELECTRONIC DEVICES\nVikram Sivakumar\n\nIntroduction and Overview\n- Moore's Law of microelectronics\n- Reaching the scale-down limit\n- Suggestions for future:\n- Bottom-up approach to fabrication\n- Integration of function in devices\n- Change in characteristics of information carrier\n- Bioelectronics, polymer electronics, molecular\nelectronics, spintronics\n\nWhat is spintronics?\n-\nCurrently: Processing by charge, storage by\nspin, coding and transmission using photons\n-\nSpintronics Information Storage + Processing\n-\nSpin: additional degree of freedom\n-\nMott: Spin-polarized currents in ferromagnetic\nmetals\n-\n10X difference between majority and minority-\nspin carrier currents in Fe and Co, because:\n-\nSplitting into majority and minority spin bands\n-\nSpin-dependent cross-section of impurities\n-\nFerromagnetic proximity effect\n\nSpintronic devices\n- First spintronic device: spin valve based on GMR\n(1988)\n- Requirements for spintronics:\n- Efficient electrical injection of spin-polarized carriers\n- Efficient transmission during transport of carriers\nthrough semiconductor\n- Capability to detect or collect spin-polarized carriers\n- Control and manipulation of transport via external\nmeans (e.g. biasing of a gate contact on a transistor)\n\nMaterials with a spin!\n- Ferromagnetic semiconductors\n- Combined semiconducting and magnetic properties for\nmultiple functionalities\n- Easy growth of ferromagnet-semiconductor\nnanostructures\n- Easy spin injection: e.g. spin transistor\n- Half-metallic ferromagnets: 100% spin\npolarization\n- Two spin channels: one metallic, other with gap at\nfermi level\n- Examples: Extreme substitution of V, Cr and Mn into\nGaAs, InAs, GaSb, InSb, GaP and InP\n\nIntroduction to ferromagnetic\nsemiconductors\n- 1970s: Eu and Cr chalcogenides\n- Rock salt type EuO and EuS\n- Spinel type CdCr2S4 and CdCr2Se4\n- Diluted magnetic semiconductors\n- Spins from 3d or 4f e-s of transition metal\n- Examples: Cd1-xCo Se, Ga1-xMn As and Si:Er\nx\nx\n- II-VI compounds: tough to get a good number of\nmobile carriers by doping\n- GaMnAs: canonical DMS; Tc = 30-170 K\n- InMnAs: T =35 K\nc\n- Theoretical prediction of Tc>R.T. realized in Mn-\ndoped ZnO and GaN, and in Co-doped TiO2 and ZnO\n- Manganites & Mn-doped IV semiconductors\n\nTheory of Magnetism in\nferromagnetic semiconductors\n- Zener model for ferromagnetism\n- Ferromagnetic metals: Parallel coupling between\nlocalized spins (Heisenberg Exchange)\n- Quantum-mechanical treatment (RKKY):\n- Sign of interaction depends on distance between localized\nspins\n- Indirect exchange mechanism via charge carriers\n- DMS: Holes mediate between ferromagnetically\ncoupled spins\n- Mn-doped III-V compounds: holes due to Mn\n- Mn-diluted II-VI compounds: doped with N\n\nApplicability of the Zener\nModel\n- Apply to wide-band gap semiconductors:\n- Short bond lengths => strong coupling between holes\n(anions) & spins (cations) => Large spontaneous\nmoment\n- Many: Tc> R.T. but much lower moment than predicted\n- Fails when substitution exceeds solubility\nlimit:\n- Ferrimagnetic or ferromagnetic precipitates =>\nunaccounted magnetism !\n\nProcessing of ferromagnetic\nsemiconductors\n- 1970s: II-VI by variant of Bridgeman\n=>spin disorder or AF coupling\n- Non-equilibrium processing\n- MBE for low-T growth of Mn-doped III-V\n(For single phase material at high Mn-doping, which\nis not possible at equilibrium)\n- PLD for oxides (doped ZnO, SnO, TiO2)\n\nCharacterization Techniques:\nSpin Manipulation\n- GaMnAs: holes contribute to magnetism; so\nprocesses that change carrier concentration can be\nused for spin manipulation\n- Femtosecond laser pulses\nSpin alignment in polarized light; but precession leads\nto breakup; however fast laser pulses can maintain\nspin coherence\n- Electrical spin injection\nQuantum well structure with P-type ferromagnetic\nsemiconductor on non-magnetic semiconductor: holes\ninjected are spin-polarized => polarized light\n\n(Contd.)\n- Magneto-transport of charge carriers\n-\nAnomalous Hall effect due to spin-orbit coupling; electrical\nmeans of establishing weak magnetism in magnetic\nsemiconductors\n- Magnetoresistance\nΔρ/ρ\nρ)2\nρ)2\nΔρ(H)/ ρav = Δρ/ρav (cos2θ-1/3)\nCharacterization Techniques\nHall Effect\nAdditional term in Kohlers rule from spontaneous MR (AMR):\n= a (H/\n+ b (M/\nFunctional dependence of AMR:\n\nmeasurement\nCoxO\nδ\nBack\nImage removed due to copyright considerations. See reference below.\nExample of a Hall effect\nHall Resistivity versus applied field for Ti1-x\n2- (The captions\nrepresent electron densities) [H. Toyosaki, T. Fukumura, et.al.,\nNature Materials Vol. 3 (2004) ]\n\nPotential Applications\n\nApplications: Magnetic field sensors, read heads, galvanic isolators and magnetic random access memory\n[S.A. Wolf, D.D.Awschalom, et. al. Science, Vol. 294., 1488 (2001)]\nImage removed due to copyright considerations. See reference below.\nSpin valves and GMR devices\n\nImage removed due to copyright considerations. See reference below.\nNon-volatile memory applications, instant turn-on computers\n[S.A. Wolf, D.D.Awschalom, et. al. Science, Vol. 294., 1488 (2001)]\nImage removed due to copyright considerations. See reference below.\nMagnetic Tunnel Junctions\n\n- Spin LEDs\n- Spin polarized charge carriers Polarized light\n- No need for polarizing filters Increase of efficiency\n- Spin FETs\n- Source and drain from ferromagnetic metals\n- Channel from semiconducting material\n- Additional gating action via magnetic field\n- Non-volatile memory due to spin polarization\n- Conductivity mismatch minimized by use of\nferromagnetic semiconductor\n\nTHANK YOU !"
    },
    {
      "category": "Resource",
      "title": "wells_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-45-magnetic-materials-spring-2004/2f4929ca36e8094340193b9a91ebe69e_wells_paper.pdf",
      "content": "Magnetic Refrigeration\nA Chilling Attraction\nAn Evaluation of Recent Materials\nand Technological Developments\nDr. Robert O'Handley\n3.45\nMagnetic Materials\nSpring 2004\nDepartment of Materials Science & Engineering\nMassachusetts Institute of Technology\n04.29.04\nBrendan Wells\n\nOn a summer day, one may reach for a glass of cool water from one's refrigerator\nwhile sitting down inside one's cool home. While this setting seems simple enough to\nthe common consumer, the engineer sees specifically engineered cooling systems\nallowing such climate control. A cooling system consists of a device or devices used to\nlower the temperature of a defined region in space through some cooling process.\nCurrently, the most popular commercial cooling agent is the refrigerant. A refrigerant in\nits general sense is what makes a refrigerator cool foods, and it also makes air\nconditioners and other appliances perform their respective duties. A typical consumer-\nbased refrigerator lowers temperatures by modulating a gas compression-expansion\ncycle, to cool a refrigerant fluid which has been warmed by the contents of the\nrefrigerator (i.e. the food inside). Typical refrigerants used in refrigerators from the late\n1800's through 1929 included ammonia, methyl chloride, and sulfur dioxide, all of which\nare toxic. To mitigate the risks associated with toxic refrigerants, a collaboration by\nFrigidaire, General Motors, and DuPont netted the development of Freon (or R12), a\nchlorofluorocarbon. Freon is a non-flammable and non-toxic, but ozone-depleting gas1.\nBecause of the damaging effects of Freon to the ozone layer, there has been much interest\nin targeting other refrigerants. The popular refrigerant R134a (called Suva by DuPont) is\ncurrently used in most refrigerators, but American and international laws are beginning to\nphase out this refrigerant as well. The future seems ripe for new refrigeration technology.\nThere has been much research done as of late by the group of Karl Gschneidner\nJr., Vitalij Pecharsky, and David Jiles at Ames Laboratory, run by the Department of\nEnergy, working in collaboration with the Astronautics Corporation of America. Their\nresearch has focused on the materials suitable for a magnetic refrigeration process and the\n\ndesign of a suitable prototype. However with a drop off in funding from the Department\nof Energy, such efforts have been prolonged and have taken greater amounts of time than\nwere initially expected.\nThere are two attractive reasons why magnetic refrigeration research continues.\nWhile a magnetic refrigerator would cost more than today's refrigerator at purchase, it\ncould conserve over and above 20% more energy than current expansion-compression\nrefrigerators, drastically reducing operating costs.10 The other attraction to magnetic\nrefrigeration is the ecological impact a magnetic refrigerator would bring should it\nsupplant current technologies. Not only would ozone-depleting refrigerant concerns be\ncalmed, but the energy savings itself would lessen the strain our household appliances put\non our environment.\nThe primary vehicle for magnetic refrigeration is the magnetocaloric effect\n(MCE), discovered by Warburg in 1881. Specifically, the MCE is \"the response of a\nmagnetic solid to a changing magnetic field which is evident as a change in its\ntemperature\" (Gschneidner)2. When a magnetic field is applied to a magnetic material,\nthe unpaired spins partially comprising the material's magnetic moment are aligned\nparallel to the magnetic field. This spin ordering lowers the entropy of the system since\ndisorder has decreased. To compensate for the aligned spins, the atoms of the material\nbegin to vibrate, perhaps in an attempt to randomize the spins and lower the entropy of\nthe system again. In doing so, the temperature of the material increases. Conversely,\noutside the presence of a file, the spins can return to their more chaotic, higher entropy\nstates, and one then observes a decrease in the material's temperature. The warming and\n\ncooling process can be likened to a standard refrigerator which implements compressing\nand expanding gases for variations in heat exchange and surrounding temperature.\nBohigas quantifies the MCE through a definition of the entropy in a system as a\nfunction of temperature and magnetic field:\nS\n,\n(Eq. 1)\nIn Equation 1, B is the magnetic field, T is the temperature and M is the\nmagnetization of the material in a given thermodynamic system. Bohigas notes, \"This\nchange in entropy is associated with the alignment of the spins on the system parallel to\nthe magnetic field\"3. One can derive this equation from the differential Helmholtz free\nenergy of a system, which is to be minimized.\naF\nS aT p aV+m0 H V aM\n(Eq. 2)\nSince there is no outside work (i.e. no volume change), pdV = 0. One can\nsubstitute the applied B field for u*H. To find the change in entropy when the B field is\nchanged (i.e. when a sample is rotated into the field of magnitude B and then out to B =\n0), integrate over the B field to get Equation 1.\nMagnetic refrigeration therefore operates by a changing magnetic field. As one is\ncreated, a warming effect is seen, and as one is dissipated, a cooling effect happens. The\n\nMCE works only in the vicinity of a material's transition temperature. It reaches a\nmaximum value at a material's Curie temperature, the temperature above which a\nferromagnetic material becomes paramagnetic due to the noise generated by atomic\nvibrations. The range of temperatures about which a material experiences a substantial\nMCE and adiabatic temperature drop is typically +/- 20 C around the Curie temperature.\nGadolinium has a Curie temperature of 20 C, near room temperature making it an\nexcellent candidate for research in the area. Thus, Gd is a suitable magnetic material for\nrefrigeration (though not for freezing) since it has a substantial MCE for temperature\nranges roughly between 0 C and 40 C.4\nThe magnetic refrigeration process has been around for over seventy years to\nachieve near 0 K temperatures in small volumes by a process known most specifically as\nadiabatic demagnetization refrigeration. Magnetic refrigeration has long been considered\none of the simplest ways to retrieve such low temperatures. However the application of\nfocus in current research has shifted from cooling near 0 K to more practical uses,\nincluding consumer-based refrigerators. In the 1950's, several magnetic refrigerators\noperated at temperatures between 1 and 30 K. However, these were too inefficient to be\nused commercially and could only run for a couple of days5.\nBy 1976, a team of engineers had already built a refrigerator with working-\ntemperature capability that spanned 80 C around room temperature, using Gd rotating\nplates and a 7 T magnetic field (description of full unit below) to \"regenerate a column of\na water-alcohol mixture\" (Gschneidner)2. This work allowed two scientists in 1982 to\n\nfind that a magnetic refrigerator could also be used as a regenerator, which greatly helped\nthe innovation process along. This led to the development by Gschneidner et al. in the\nmid 1990s of the Active Magnetic Regenerator (AMR) magnetic refrigerator based on the\napplication and removal of a magnetic field and on regeneration of a fluid in warm and\ncool states. In 1997, two key developments enhanced the feasibility for producing a\nmagnetic refrigerator for commercial or industrial use. First, it was observed that the\nmagnetic refrigerator could be a viable technology with the invention of the vapor cycle\nrefrigeration unit. A vapor cycle unit is a refrigeration device which consists of a rotating\ntable, (so-called Ericcson style rotation named after its inventor) which rotates the\nmagnetic material in and out of a strong field to take advantage of the MCE. The\nAstronautics Corporation of America and Ames Laboratory built a unit using the\nEriccson cycle system that had lasted 1500 hours as of mid 1998, and had run\nmaintenance free.\nSecondly, the discovery of the so-called \"giant\" MCE made previously considered\nimplausible advancements possible. Some materials were observed to have unusually\nlarge magnetocaloric effects, and this discovery made it much more feasible to develop a\nmachine at lower costs. It was observed first in Gd alloys, most notably Gd5(Si2Ge2),\n\"due to a simultaneous magnetic and crystallographic first order transition. The adiabatic\ntemperature rise for the material was 30% higher than that of just Gd and 200-600%\nhigher than the previous refrigerant materials, DyAl2, GdAl2, and Gd0.73Dy0.27. \"\n(Gschneidner)2. The magnetic entropy change approached a 100% increase over Gd. It\n\nwas, thus, discovered that Gd5(Si2Ge2) fared much better as a magnetic material for\nmagnetic refrigeration than the previously considered materials. There was new-found\nhope for an efficient refrigerator using this technology.\nThere are several types of magnetocaloric effects as seen graphically in Figure1.\nEach type is differentiated by how strongly the effect exists performs at varying\ntemperatures. One can note that (Dy0.5Er0.5 )Al2 experiences a second order paramagnetic\nto ferromagnetic transition at 40 K where the largest peak occurs. It is at this transition\ntemperature that its highest MCE is observed. A second variety of MCE is shown by the\nenormous peak in Gd5(Si0.33Ge3.67), due to its first order ferromagnetic to ferromagnetic\ntransitions. This is an example of the giant MCE. Notice how much higher a value is\nobtained, albeit at a higher temperature. However, it is, overall, more energy efficient at\nImage removed due to copyright considerations. See reference [2].\n\nthe higher temperature since the MCE is much greater compared to the temperature.\nFinally, the plateau shaped MCE effect in (Gd0.54Er0.46)NiAl is due to three magnetic\ntransitions in the material, and is suitable in some refrigerators. The best choice for an\nEriccson cycle refrigerant would be a material with a good entropy profile and thus a\nsuitable MCE profile. Since an ideal material's maximum MCE is useful for about +/- 20\nC, a materials with table like MCE is an optimum choice for magnetic refrigeration.\nThe ultimate shape of the MCE peak is important in designing a thermodynamic\ncycle for a magnetic refrigeration system. \"In an Ericcson cycle (where a plate rotates\ninside the magnetic field), the entropy change must be constant over the desired\ntemperature range and one would choose a material which exhibits a table like MCE\"\n(Gschneidner)2. For an AMR's cycle, the optimal MCE would have a constant slope as\ntemperature is increased. This is not represented in any of the plots and consequently,\nthere are no present day alloys to satisfy this constraint. Gschneidner et al. are working\non the materials science to solve this problem. One idea is to layer several different\nmaterials on top of each other with differing critical transition temperatures, forming a\ncomposite alloy, which could create a linear temperature rise as each material reaches its\ncritical temperature. \"In an attempt to circumvent the problem, several composite or\nmultilayer systems have been studied, where ferromagnetic materials with varying Curie\ntemperatures are layered according to their transition temperatures, thereby spanning a\nfull temperature range\" (Korte, Pecharsky)6. There is a way to predict what mass ratio of\ncomponents is necessary to produce a constant magnetic entropy, based on the\n\nexperimentally determined entropy of each constituent. This technique allows one to find\na suitable material composition which has a constant slope on a MCE vs. temperature\nplot.\nIn order for a working machine to be developed, materials had to be chosen that\nhad good magnetocaloric effect and could withstand the process of cooling. Some\nmaterials used for refrigerants are taken from the gadolinium silicon germanium ternary\nsystem (Gd-Si-Ge), with stoichiometry Gd5(SixGe1-x)4. The Si rich alloys (0.5<x<1.0),\nare ferromagnets. The intermediate ternary solid solution phase Gd5(SixGe1-x)4 extends\nfrom 0.24<x<0.5 and has a monoclinically distorted lattice, closely resembling samarium\ngermanium (Sm5Ge4). The alloys in this phase region have two interesting features. By\nlowering the temperature they undergo a transition from one ferromagnet phase to a\ndifferent ferromagnet phase. The bulk of the magnetic entropy is associated with this\nlower temperature phase transition which brings about a magnetocaloric effect, and can\nalso be expressed in terms of the magnetic entropy change, Smag, exceeding that of other\nlanthanide metals and alloys by up to seven times as much. The Gd5(Si2Ge2) alloy\nrepresents the most suited composition displaying the highest MCE and is durable\nenough to be used in a refrigerator.\nTransition temperatures of the alloys formed by Gd, Tb, Dy, Ho, Er, Tm, and Lu\nshow large MCE associated with transitions above 180 K. When decreasing transition\ntemperatures prevail, the MCE rapidly falls apart7. Other materials being researched for\nuse in magnetic refrigerators include amorphous alloys. The atomic structure of\n\namorphous alloys has some properties, such as higher resistivity and improved corrosion\nresistance, which aid the process of magnetic refrigeration. Some scientists feel that\namorphous alloys may be able to fill the gaps between 100 and 200 K transition\ntemperature applications. Amorphous materials such as Re70Fe30 (Re = Dy, Er, Ho, Tb,\nGd) have a eutectic composition and provide a high concentration of rare-earth metal,\nwhich is necessary for the material to have a large MCE.\nFor low temperature applications between 1.5 and 20 K, paramagnetic salts like\nGd3Ga5O12 and Dy3Al5O12 were tested at the outset of magnetic refrigeration research,\nbut more recently ceramic perovskites have been found to be well-suited too. Such\nmaterials as La0.65Ca0.35Ti1-xMnxO3-z and La0.5+x+yLi0.5-3yTi1-3xMn3xO3-z (x < 0.16 and 0.2\n< y < 0.33) have been shown to have good MCEs. The transition temperatures of these\nsalts vary over great temperature ranges, some having the necessary MCE to be\nconsidered for use in magnetic refrigeration while others do not.3\nA plot of adiabatic temperature rise as a function of operating temperature for\n(Gd1-xErx)NiAl of varying compositions is shown in Figure 2. Note the peaks resulting\nfrom this relationship which determine the MCE, thus determining the refrigeration\nability of a system with each material. It appears that (Gd0.2Er0.8)NiAl has the largest\ngiant MCE, but the most table-top like plot (similar to Figure 1) is (Gd0.54Er0.46)NiAl\npointing to the fact that this material is a good selection for magnetic refrigeration. Note\ntoo that as x decreases (Gd composition increases) the peaks level off with a table top\neffect, but the adiabatic temperature change decreases. Ideally, a high peak and a table\n\ntop effect would be best, but realistically, one takes the best of both, and this is why\n(Gd0.54Er0.46)NiAl is currently being implemented in Ericcson cycle refrigerators.\nIt is an important fact that the Gd materials used in the Ericcson style units must\nbe of very high purity. However, by 1997, purifying such a material from commercial\nGd had not yielded the same purity as Gd formed in research laboratories. In fact, the\ngiant MCE had been reduced through processing procedures. It was found that the MCE\nwas 2.5 times lower when commercial material was used to form the necessary magnetic\nmaterial composition. The major impurities that are in commercial substances are\ncarbon, nitrogen and oxygen.8 It is not yet known which impurity has the largest effect on\nthe giant MCE.9 As we shall see later, recent developments at Ames Laboratory have\nafforded increased Gd purity processed from commercial sources.\nThe two most important features to materials used in magnetic refrigerators are\nthe Curie temperature (or the magnetic transition that yields the largest MCE) and the\nmagnetic entropy. The Curie temperatures of various lanthanide elements and their\nalloys have yielded MCEs across a broad range of temperatures between ~0 - 300 K.\nImage removed due to copyright considerations.\n\nThere are still some gaps in this spectrum, meaning that cooling from room temperature\nto liquid helium temperatures will still requires materials research. Additionally,\nmagnetic heating (the inverse process of magnetic refrigeration) would require\ninvestigating materials with transition temperatures above 300 K. Pure lanthanides\nwould no longer be suitable, and iron alloys would be investigated. To this point, there\nhas been little to no research in the area of magnetic heating.\nMagnetic entropy of a material can be computed as follows (with units in\nparentheses)4:\nSmag R ln H2 J+1\n(Eq. 3)\nThe lanthanides Gd, Tb, Dy, Ho, Er, and Tm have very high magnetic entropies\n(roughly 2 - 3 times as large as iron), and when these materials are considered along with\ntheir proper transition temperatures (Gd is the only element with a Curie temperature near\nroom temperature) as well as cost/material (Ho is prohibitively expensive for a\nrefrigerator), one finds that Gd and its alloys are good fits for magnetic refrigerators.\nThe process by which the Ames Laboratory/Astronautics Corporation of America\nmagnetic refrigerator works is relatively simple. The refrigerant is of course solid in\nmagnetic refrigerators, as opposed to liquid in commercial refrigerators, thus water, anti-\nfreeze, and even some gases can provide heat transfer between the contents of the\nrefrigerator and the refrigerant itself. The refrigerant chosen depends on the temperature\n\nat which the machine is to be used. All other refrigerator components remain unchanged\nfrom current refrigeration technology.\nA schematic of the unit built by Ames Laboratory and the Astronautics\nCorporation of America is shown in Figure 3.\nThe magnetic field is generated by a solenoid made of niobium titanium (NbTi), a\nsuperconductor, which is placed in liquid helium. Gd is used as the cooling agent. There\nare two regenerator beds made of Gd that are alternately inserted into the field. Thus the\nrelative movement of the refrigerant out of the field causes the lowering of the\ntemperature. Each bed rotates through the magnetic field in one second. The first\nImage removed due to copyright considerations. See reference [2].\n\nregenerator bed inside the magnetic field experiences an increase in temperature as the\none outside feels a decreasing temperature as it is outside the field. It will again be\nwarmed by entering into the field. The heat is dissipated into passing water which\ncarries the heat to a heat exchanger. This serves two purposes. The water cools the Gd\nso it can begin lowering its temperature quicker and it aids in the eventual cooling by the\nchanging magnetic field. The whole process takes about 2 seconds. Another issue in the\ndesign of a magnetic refrigerator is efficiency. The Carnot efficiency compares the net\nwork of a machine and the net heat it generates. For the lowest change in magnetic fields\nstudied, from 0 to 1.5 Teslas, the efficiency was between 20% and 30%. Between 0 and\n5 Teslas, the efficiency increased to 50%-60%, a substantial increase. In the Ames\nLaboratory experiments, the seals used for the refrigerator to insulate it were standard\nprocessed seals. With higher quality seals Gschneidner notes, better results would have\nbeen obtainable. The cooling power of the machine ranges between 200W and 600W,\nwhich at this point is a great beginning for building a refrigerator that will eventually\nhave much better cooling power than refrigerators of today.\nAnother big advantage of magnetic refrigeration is the environmental impact it\nhas. There are no toxic fluids involved in the current units under development. There is\nalso less wasted energy and greater efficiency. All of this comes at a higher cost,\nhowever, but with continued research, magnetic refrigeration could become the next big\nadvance in refrigeration technology.\n\nSince the first prototype in Figure 3. was introduced, Gschneidner et al. have\ndeveloped a rotary-designed magnetic refrigerator. It was even presented at the G-8\nworld conference in 2001. Its design is similar to the initial prototype in Figure 3, with\nthe main difference in structure being the use of a rotary head to circulate the Gd metal\ninto and out of a small gap in a Nd2Fe14B permanent magnet. The new model had a\nrefrigerator and freezer component to resemble current consumer refrigerators. The\nrotary element rotates material into and out of the field at a rate of 0.25\nrevolutions/second under a field of 15 kOe. Table 1 summarizes the performance of the\nnew refrigerator.\nTable 1: Model results for rotary magnetic refrigerator/freezer.11\nStage/Property\nFreezer\nRefrigerator\nTotal\nCold side temp., C (F)\n-12 (10)\n-1 (30)\n-12 (10)\nHot side temp., C (F)\n-1 (30)\n32 (90)\n32 (90)\nFluid\nEthylene Glycol 40%\nWater\nN/A\nPump work rate, Watt\n1.3\n6.4\n7.7\nCooling power, Watt\n40.0\n127.0\n120.0\nHeat rejection, Watt\n47.0\n160.0\n160.0\nElectric power required, Watt\n6.7\n32.7\n39.4\nCOP\n6.0\n3.85\n3.0\nEfficiency, % Carnot\n51.4\n49.0\nN/A\nThe refrigerator has a measured coefficient of performance (COP) of 3.85 while\nthe freezer was 6.0 and the overall COP was 3.0. These numbers compare favorably with\ncurrent refrigerators.\nThere has been work in improving the rotary refrigerator, specifically in\ngenerating larger magnetic fields. The technique is geometrical in nature, by\nmanipulating the arrangement of an array of eight Nd2Fe14B magnets such that the flux\n\ndensity is extremely high in the air gap through which the rotary's plate rotates.\nAdditionally, Gschneidner et al. have recently discovered a technique for adequately\npurifying the refrigerant Gd5(SixGe1-x)4 from commercial grade sources. Not only does\nthis lower the cost of materials production, but it allows a larger amount of material to be\nused in the refrigerator due to a greater ease of fabrication. Currently, research has been\ncentered on fabricating small spheres (on the order of 150-300 microns) of Gd5(SixGe1-\nx)4. Once this has been studied, it appears that magnetic refrigeration will be much closer\nto its introduction into the real world.11\nWhile Gschneidner et al. have had a large footprint in magnetic refrigeration\nresearch, they are by no means alone. Two Japanese companies, Chubu Electric Power\nand Toshiba Corporation, have invested money into research into this area. Additionally,\na Chinese firm has become the first to use Gd5(SixGe1-x)4, patented by Ames Laboratory,\nin a refrigerator. It has thus far proven to be a successful material in the application. A\nFrench team at the Laboratoire d'Electrotechnique de Grenoble have been doing similar\nwork in magnetic refrigeration using rotary technology. Their material of choice has\nbeen Gd. A list of all known groups working in magnetic refrigeration is listed in\nAppendix A.\nThe future in magnetic refrigeration appears bright. Much research is being done\nin the field of the magetocaloric effect in an attempt to find a suitable way to make an\nefficient machine. It is clear that more research is needed before a finished product\nappears for sale commercially. Materials such as Gd alloys and ceramic perovskites are\n\nbeing used in much of the research and some have shown large MCEs. Relationships\nbetween magnetic entropy and temperature have been derived and studied to increase\nMCEs in some materials. The Ericcson style magnetic refrigerator was the first proof-of-\nprinciple prototype that showed magnetic refrigeration was plausible. The latest rotary\nmodel seems to have a future in research and potentially in commercialization.\nThough the first prototype costs more and is less efficient than current\nrefrigerators, the discovery of the giant MCE has further opened the prospects of the\nmagnetic refrigerator as a viable device. As more research is done on the MCE and\nmagnetic refrigerators, the future possibilities of efficient cooling will be limitless.\n\nWorks Cited\n1. About.com. \"Refrigeration\". http://inventors.about.com/library/inventors/blfreon.htm\n2. Gschneidner K., Pecharsky. \"Magnetic Refrigeration Materials\". \"Journal of Applied\nPhysics\". vol.85, no.8,15. April 1999. pp.5365-5368.\n3. Bohigas X. \"Tunable Magnetocaloric Effect in Ceramic Perovskites\". \"Applied\nPhysics Letters\". vol. 73. no. 3,20. July 1998. pp.390-392.\n4. Gschneidner Jr., Karl. \"Magnetic Refrigeration\". Rare Earths: Science, Technology\nand Application III. The Minerals, Metals & Materials Society. 1997.\n5. \"Journal of Magnetism and Magnetic Materials\". \"Composition Dependence of\nmagnetic Properties in Amorphous Rare-Earth Metal-Based Alloys\". vol. 174. no.\n3. October 1999, pp.295-308.\n6. Korte B. \"The Correlation of the Magnetic Properties and the Magnetocaloric Effect\nin Gd, Er NiAl Alloys\". \"Journal of Applied Physics\". vol. 84, no.10,15. Nov.\n1998, pp. 5677-5685.\n7. Wada H. \"Magnetocaloric Effect of ErCo2\". \"Journal of Magnetism and Magnetic\nMaterials\". May 1999. pp.689-700.\n8. Bisio G, Department of Energy. Intersociety Energy Conversion Engineering\nConference. \"Thermodynamics of Magnetic Systems and Some Applications\".\n1999.\n9. Materials Technology. \"New Materials for Magnetic Refrigeration Promise Cost\nEffective, Environmentally Sound Air Conditioners, Refrigerators/Freezers, and\nGas Liquefiers\". September, 1999.\n10. Bisio G, Rubbatto G. \"Magnetic Systems Depending on 3 or 2 variables;\nThermodynamic Analysis and Some Exciting and Possible Applications\".\n\"Energy Conversion and Management\". vol. 40, no. 12. August 1999.\npp.1267-1286.\n11. Gschneidner Jr., Karl et al. Proceedings Domotechnica Appliance Engineering\nConference. \"Magnetic Refrigerators/Freezers and Air Conditioners\". P. 170 -\n182. 2001.\n12. Gschneidner Jr., Karl et al. Personal Correspondence. \"Status of Magnetic\nRefrigeration - April 23, 2003\".\n\nOther works\nBowman, Mark. Inquiry Online Magazine. \"The Big Chill\".\nhttp://www.external.ameslab.gov/News/Inquiry/fall97/bigchill.html. 1997.\nKimura H. \"Single Crystals of Dy, Gd, V, O for Magnetic Applications\". \"Journal of\nMaterials\". vol.33, no.9,1. May 1998. pp. 2379-2383.\nKimura H. \"Single Crystal of RALO3 (R: Dy, Ho, Er) for Use in MagneticRefrigeration\nBetween 4.2 and 20 K\". \"Journal of Materials\". vol.32 no.21. November.\npp.5743-5749."
    }
  ]
}