{
  "course_name": "Magnetic Resonance Analytic, Biochemical, and Imaging Techniques",
  "course_description": "This course is an introduction to basic NMR theory. Examples of biochemical data obtained using NMR are summarized along with other related experiments. Students participate in detailed study of NMR imaging techniques, including discussions of basic cross-sectional image reconstruction, image contrast, flow and real-time imaging, and hardware design considerations. Exposure to laboratory NMR spectroscopic and imaging equipment is included.",
  "topics": [
    "Health and Medicine",
    "Biomedical Instrumentation",
    "Biomedical Signal and Image Processing",
    "Medical Imaging",
    "Spectroscopy",
    "Science",
    "Biology",
    "Biochemistry",
    "Health and Medicine",
    "Biomedical Instrumentation",
    "Biomedical Signal and Image Processing",
    "Medical Imaging",
    "Spectroscopy",
    "Science",
    "Biology",
    "Biochemistry"
  ],
  "syllabus_content": "This spring term course is designed for graduate (or advanced undergraduate) students and research scientists with an interest in how nuclear magnetic resonance (NMR) techniques can be used to provide information of value to biological scientists and physicians. The course will introduce basic NMR theory, including spectroscopic and relaxation phenomena. Examples of biochemical data obtained using NMR will be summarized, along with other, related experiments. The course will then focus on imaging with NMR, and include discussions of basic cross sectional image reconstruction, image contrast, flow and real time imaging, and microscopy.\n\nCourse Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Requirements\n\nACTIVITIES\n\nPERCENTAGES\n\nMidterm Quiz\n\n30%\n\nWeekly Problem Sets\n\n60%\n\nClass Presentation\n\n10%\n\nReading\n\nLecture notes, journal articles and book chapters will be handed out in class to supplement the class lectures.",
  "files": [
    {
      "category": "Assignment",
      "title": "assignment1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/cb7a107eb64866835ec8ca2afd25a96f_assignment1.pdf",
      "content": "HST.584 / 22.561 - Problem Set 1\nDue: Feb. 22 / 2006 in class\n\n1. a) In typical proton NMR imaging experiments, RF pulse lengths (φtip =\n90°) are 1000 μsec. How big is B1? How does this compare to typical\nvalues for B0?\nb) For a 4 turn solenoid of radius 20cm, what current would need to be\napplied to generate this field? Estimate the power needed to apply this\ncurrent.\nc) If B0 = 1.5T, and the RF pulse is applied 5 kHz off resonance at the\nstrength given in part (a), what is Beff? Where would the magnetization\nvector point after the 1000 μsec '90°' RF pulse? Is this a true 90°\npulse?\n\n2. a) If you were to perform an equivalent of the basic NMR experiment on a\nfree electron (a.k.a. an ESR or electron spin resonance experiment),\nwhat would be the resonance frequency at 1.5T? Is this a practical\nexperiment? What limitations might there be for doing this in humans?\nb) What field strength would you need to produce the same electron\nresonance frequency as you get from a proton NMR experiment?\nc) What B1 field strength would you need to apply to obtain a 90° RF\npulse in 10 μsec?\n\n3. a) The Martinos Center has built and now operates a human-sized 7.0T\nMR imaging system. If B0 = 7.0T and the nuclei of interest are protons,\nwhat is the ratio of parallel to anti-parallel spins at room temperature?\nHow does this compare to our current 1.5T and 3.0T imaging systems?\nHow do these values change if the nuclei of interest are carbon-13\ninstead?\nb) Not convinced that this is enough of a difference in the spin states, you\nset out to explore two possibilities for improving the net magnetization\navailable. You have two options: temperature or a further increase in\nfield strength.\ni) For protons, at what temperature can you get a 2-1 ratio of low\nto high energy spins at this field strength? For 13C?\nii) For protons, what field strength would you need to achieve this\ndifferential at room temperature? For 13C?\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "solutions1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/7eb51b5270d60717b91e5f484409d31b_solutions1.pdf",
      "content": "HST.584 / 22.561 Problem Set #1 Solutions\n\nMarking Scheme: Question 1 - 3.5 points, Question 2 - 3 points, Question 3 - 3.5 points\nGeneral Comments: Watch out for radians! Angles should be expressed in radians and γ\nadjusted between linear and angular units accordingly (i.e. Hz vs rad / s)\n1-a)\nT\nx\nB\nT\nB\n.5\n-\n=\n=\nγ\nθ\nfor θ = π /2, T = 1 ms, γ = 2π * 43 x 106 rad/s/T\n\nThis is 6 orders of magnitude smaller than a typical BO.\n\n1-b)\nr\nNI\nB\nO\nμ\n=\nfor a short solenoid.\nRearranging, we can calculate I = 0.462 A to produce our desired field. To estimate\npower, we need to estimate resistance (only a resistive element causes power loss - can't\ndissipate power through an inductance). Let's pick copper (ρ = 1.56 x 10-8 Ωm) with a\ncircular cross-section of 2 mm (maybe a little small for the current we're pushing, but\ngood enough for an order of magnitude estimate).\n\nΩ\n=\n=\n.0\nR\nA\nL\nR\nρ\nwhere L is the total length of wire (4 turns * circumference = 5.03m)\n\nmW\nR\nI\nP\n.5\n=\n=\nfor an estimate\n\n1-c) Beff is the vector sum of B1 and our off-resonance contribution.\nOff resonance\nmT\nB\nrot\nO\n.0\n=\n-\n=\nγ\nω\n.\nSo Beff = 0.1163\n+ 5.81x10-3\nmT = 0.116 mT at 2.9° tilt off the z-axis.\nzˆ\nxˆ\nrad\nT\nBeff\n3.\n=\n= γ\nθ\n= 5 rotations around Beff = NOT A 90° pulse!\n\n2-a) γe = 2.8 x 1010 Hz / T. At 1.5 T, ν = 42.0 GHz. Is this practical? On chemical\nsamples yes - ESR is a common technique. However, this frequency is in the microwave\nrange, so this is not practical for humans Æ will potentially have a great deal of energy\ndeposition in your subject (this is BAD!)\n\n2-b) In 1.5 T NMR experiment, our Larmor frequency is 64.5 MHz. To generate 64.5\nMHz in an ESR experiment, we need a 2.3 mT field (\nγ\nυ\n=\nB\n).\n\n2-c) Using our expression from 1-a, we can calculate that we would a B1 = 8.93 x 10-7 T\nto generate the desired RF pulse.\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\n3-a)\n)\nexp(\nT\nK\nBh\nn\nn\nB\nγ\n-\n=\n↑\n↓\nis the expression for the difference in spin population levels b\non a Boltzmann distribution (again, watch your units for γ and h - if you use one in\nangular form, they both must in angular form).\nased\n\nField Strength (T)\nRatio for 1H\nRatio for 13C\n7.0\n0.99995\n0.99999\n3.0\n0.99998\n0.999995\n1.5\n0.99999\n0.999997\n\nSo net magnetization increases with field strength, but we are still dealing with incredibly\nsmall signals!\n\n3-b) If we re-arrange our initial expression, to get 1:2 ratio of spins, we need\ntemperatures of 20.6 mK for 1H and 5.2 mK for 13C.\n\n3-c) For 1H, we'd need a field of 9.84 x 104 T to attain a 1:2 ratio of spins. For 13C, we'd\nneed a field of 3.95 x 105 T. Clearly, these are not attainable fields in a laboratory\nsetting."
    },
    {
      "category": "Assignment",
      "title": "assignment2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/03504906df2a0f994a2d20b65ed9ee0e_assignment2.pdf",
      "content": "HST.584 / 22.561 - Problem Set 2\nDue: Mar. 1 / 2006 in class\n\n1) Perform the following experiment: A 90o pulse with B1 along the x' axis rotates M\nto the y' axis (rotating frame here!). As soon as the pulse is completed, change the phase\nof the RF by 90o so that B1 now lies along the y' axis also. Since B1 and M are collinear,\nno torque is exerted on M, and it remains along the y' axis. In the absence of B1 we\nknow that M would decay due to both T2 and inhomogeneities in Bo (∆Bo). If we set B1\n>> ∆Bo, the effective field Beff ≅ B1, and the effects of inhomogeneities are eliminated.\nThis experiment (called \"spin locking\") does not eliminate decay of M entirely.\nBecause in the rotating frame, B1 plays the role of the fixed field, relaxation of M in the\ndirection of B1 (along y') is analogous in some ways to spin-lattice (T1) relaxation. For\nthis reason the kind of relaxation is called T1r.\n(a) Design a simple experiment to measure T1r.\n(b) In the limit of small B1, what would T1r approach? (In fact, the spin locking\nexperiment is a good way of measuring this quantity in some circumstances).\n\n2) In class we plotted T1 versus correlation time τC. Given that T2 relaxation depends\non molecular motions at near zero spectral frequency, as well as motions at the resonance\nfrequency, and given that the area of the spectral density curves is a constant, sketch a\nplot of T2 versus correlation time τC.\nWhat does this look like for\n<<\nω\nC\nT\n? For\n>>\nω\nC\nT\n?\nWhat does this imply about the T1 and T2\n\n3) Several different pulse sequences have been proposed to measure T2 relaxation\ntimes, each with certain advantages and disadvantages. Two such sequences are as\nfollows:\n\nCP\n90x - t - 180y - 2t - 180-y - 2t... (aka Carr-Purcell)\nCPMG 90x - t - 180y - 2t - 180y - 2t... (aka Carr-Purcell-Meiboom-Gill)\n\nNote that n spin echos occur at regular intervals separated in time by 2t.\n(a) If the radio frequency pulses are perfect, will there be any differences in the\necho signal as a function of time between these two pulse sequences?\n(b) Assume that the RF pulses are imperfectly \"tuned\", such that the 180o pulses\napplied above are in fact actually only 170o B1 pulses. For the CP pulse\nsequence, how will errors in the RF pulse angle propagate into a determination\nof T2 (i.e. will the measured T2 decay be higher or lower than the 'true' T2)?\n(c) How will the CPMG pulse sequence differ from the CP pulse sequence in its\nsensitivity to pulse angle errors such as discussed above (watch the B1 phase in\nthe rotating frame!)? Will even numbered echoes (2nd, 4th, etc) behave the same\nas odd echoes? Will errors be additive from one echo to the next? Why?\n(d) How should one properly use CPMG data to calculate T2 from spin echo\namplitudes?\n\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "solutions2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/30c18d18d6fe68a8a842de1ea2d104d3_solutions2.pdf",
      "content": "HST.584 / 22.561 Problem Set #2 Solutions\n\nMarking Scheme: Question 1 - 3 points, Question 2 - 3 points, Question 3 - 4 points\nGeneral comments: T1r actually should be T1ρ (sorry)\n\n1-a) Note that the decay due to T1ρ depends on τ, our spin\nlock interval; as soon as we release the spin lock, we get\nan FID as following a typical π/2 pulse. One possible way\nto measure T1ρ is to perform a series of spin lock\nexperiments for various values of τ. If we measure th\nmaximum amplitude resulting from the FID as a function\nof different τ, we can fit a curve of the form exp(-τ/ T\ne\nD\nld is active).\n1ρ)\nand determine T1ρ (the correct way to do this would be to\ntack a spin echo onto the end of the spin lock so that we are not trying to measure the FI\namplitude so close to when the B1 fie\nt\nB1 for τ\nπ/2x\n\n1-b) In the limit of small B1, T1ρ approaches T2\n*. As B1 Æ 0, the effects of field\ninhomogeneities become apparent and eventually dominant; this manifests as T2\n*\nrelaxation.\n\n2) In class, Bruce actually drew both T1 and T2 as a function of τc, the correlation time.\n\nFor T2 relaxation, the J(0) term is dominant (and unique to T2, unlike the higher ω and 2ω\ncontributions which appear in both T1 and T2). This is term responsible for dephasing,\nCorrelation\nTime\nRelaxation Time\n;\n<<\n∝\nc\nc\nT\nωτ\nτ\n\n;\n>>\n∝\nc\nc\nT\nωτ\nτ\n;\n>>\n∝\nc\nc\nT\nωτ\nτ\n\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nand does not cause the spins to lose (or gain energy). Comparing liquids and solids, our\nspins in a liquid have a great deal more molecular motion (rotation, translation, vibration)\nand hence short correlation times. This case corresponds to the left side of our graph, so\nwe see that for liquids T1 and T2 are of the same order of magnitude (which is exactly\nwhat we see in practice). In solids, molecular motion is much more constrained and\nhence the correlation time longer. This case is the right side of our figure, and hence in\nsolids T1 is large and T2 very short. Another way to think of this is the idea of a random\nwalk process, during which a spin samples the local magnetic field variations as it moves.\nIn a liquid, the spin takes many steps and samples many different local fields (some likely\nto increase its phase, some likely to decrease its phase). Thus, on average the spin is\nmore likely to remain close to its initial phase value, dephasing is thus delayed and T2 is\nrelatively large. In a solid, a spin does not move very much and so only samples a very\nfew local fields that will either increase or decrease its phase. Dephasing is thus\nenhanced on average and T2 is relatively short.\n\n3-a) (Note: I'm not going to draw the vector diagrams to show this - a real pain in Word.\nIf you want me to show you, come talk to me in class or office hour.) If we have perfect\nrefocusing pulses, there is no difference between our CP and CPMG echo trains. We\nshould detect exactly the same signal.\n\n3-b) In the CP sequence, if we have imperfect refocusing pulses, we find that our\napparent T2 decay will be enhanced (i.e. our T2 time constant will be shorter than its\nactual value). This enhancement is due to the fact that the error will accumulate with\neach new refocusing pulse (i.e. our net magnetization vector lies further and further away\nfrom the transverse plane). This additive effect thus decreases our signal, which\nmanifests as enhanced T2 decay.\n\n3-c) The CPMG sequence differs in that refocusing pulse errors will not accumulate. If\nour first pulse is off by 10° (say 170° instead of the desired 180°), our magnetization will\nlie off the transverse plane after the first pulse, but will be returned to the transverse plane\nfollowing the second pulse. Thus our odd and even echo trains will appear to be\nconstrained by different envelopes.\n\n3-d) To get the most accurate measure of T2, use a CPMG sequence and fit your T2 decay\nenvelope only to the even echoes."
    },
    {
      "category": "Assignment",
      "title": "assignment3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/f5360bac14779e4289aca252f8f7cfa7_assignment3.pdf",
      "content": "HST.584 / 22.561 - Problem Set 3\nDue: Mar. 22 / 2006 in class\n\n1) Consider the pulse sequence at right:\nThe sequence begins with a π pulse,\nfollowed by a delay of TI, followed by a π /2\npulse and another delay TR-TI, such that the\ntotal repetition time for the sequence is TR.\nWith respect to the longitudinal\nmagnetization present before the π pulse,\nand assuming a homogenous T1 and T2 for\nthe system under investigation, what are the longitudinal and transverse components of\nmagnetization at points a+, b, b+ and c? At what point after the π/2 pulse will the signal\nbe maximized? If the pulse sequence is repeated, what will be the steady state signal\namplitude (i.e. transverse magnetization at the start of the FID) be, as a proportion of the\nequilibrium magnetization of the system Mtot?\nπ\nπ/2\nTI\na\na+\nb\nb+\nc\nTR - TI\nn\n\n2) Consider the following pulse sequence in which an RF excitation pulse of tip angle θ1\nis followed by a θ2 pulse a fixed time, TR later. Assume the following throughout:\n\n- the object is homogenous with a single value of T1 and T2\n\n- the magnetization is initially at equilibrium (M0)\nTR\nθ1\nθ2\n\n- TR is much longer than T2 (TR>>T2)\n\n- T1 = 5TR\na) If θ1 = θ2 = 60°, what are the relative signal amplitudes\n(immediately after the excitation) for the two FIDs?\nb) Determine θ1 such that the FID amplitude from the\nsecond excitation is always zero.\nc) Determine θ2 if θ1 = 25°, to produce equal signal amplitudes for the two FIDs.\nd) Determine the θ1 and θ2 combination that produces the maximum possible signal\namplitudes (they must still be equal and ignore T1 effects).\n\n3) Compare a conventional 90°x - τ - 180°x spin-echo\ngenerating sequence with a 90°x - τ - 90°x sequence as\nshown below. Ignore T1 and T2 relaxation.\n90°x\nτ\nτ\n90°x\na) Given an off-resonance spin that precesses (in the rotating\nframe) by angle φ during the interval τ, what is its resultant\nmagnetization at time 2τ?\nb) If a uniform object contains an ensemble of off-resonance spins such that the\nprecession angle φ (after an interval of τ) is uniformly distributed from 0 to 2π radians,\ndetermine the relative sizes of the net transverse magnetizations at time 2τ produced by\nthe two sequences. The net transverse magnetization is based on the integration of the\ntransverse component over the entire ensemble.\nc) Repeat part (b) by comparing the net transverse magnetization at time 2τ of a 90°x - τ\n- 180°x sequence with that of a θx - τ - θ°x sequence.\nNote: Using rotation matrices in this question may be useful.\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "solutions3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/5eb3591ad739bf6e2a673694464a8af1_solutions3.pdf",
      "content": "HST.584 / 22.561 Problem Set #3 Solutions\n\nMarking Scheme: Question 1 - 3 points, Question 2 - 3 points, Question 3 - 4 points\n\n1) The easiest approach is to start from equilibrium and then figure out the magnetization\ncomponents at the different time points. Tracking through the pulse sequence, we find\nthe following components:\n\nEvent\nMlongitudinal\nMtransverse\nStart at equilibrium\nM0\nApply π pulse\n-M0\nTI Interval\nM0 + (Mz(0) - M0)e-TI/T1\n= M0(1 - 2e-TI/T1)\nApply π/2 pulse\nM0(1 - 2e-TI/T1)\nTR - TI interval\nM0(1 - e-(TR-TI)/T1)\nM0(1-2e-TI/T1)e-(TR-TI)/T2\n= ~0\nApply π pulse\n-M0(1 - e-(TR-TI)/T1)\nTI Interval\nM0 + (-M0(1 - e-(TR-TI)/T1) - M0)e-TI/T1\n= M0(1 - 2e-TI/T1 + e-TR/T1)\nApply π/2 pulse\nEtc.\nEtc.\n\nSo, in terms of the labels given in the question and assuming we have reached a steady-\nstate:\nTime\nMlongitudinal\nMtransverse\na\nM0(1 - e-(TR-TI)/T1)\na+\n-M0(1 - e-(TR-TI)/T1)\nb\nM0(1 - 2e-TI/T1 + e-TR/T1)\nb+\nM0(1 - 2e-TI/T1 + e-TR/T1)\nc\nM0(1 - e-(TR-TI)/T1)\n\nThe signal is maximized immediately after the π/2 pulse (i.e. there are no echoes; our\ntransverse magnetization simply decays away). The steady-state signal amplitude is thus\nM0(1 - 2e-TI/T1 + e-TR/T1)\n\n2-a) Signal amplitude is determined by our transverse component.\nAfter θ1: Mz = M0cos60 = M0/2, Mxy = M0sin60 =\nM\n\nPrior to θ2: Mz(TR-) = Mz(0)e-1/5 + M0(1 - e-1/5) = 0.591M0, Mxy = 0\nAfter θ2: Mz = Mz(TR-) cos60 = 0.295 M0, Mxy = Mz(TR-) sin60 = 0.512 M0\n\n2-b) For the 2nd FID to have zero amplitude, we require Mz(TR-) = 0.\n\nMz(TR-) = M0 cosθ1 e-TR/T1 + M0(1 - e-TR/T1) = 0\n\nθ1 = 102.8°\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\n2-c) We now require Mxy(0+) = Mxy(TR+). For q1 = 25°, Mxy(0+) = 0.423 M0.\n\nTherefore, Mz(TR-) = M0 cos25 e-1/5 + M0 (1 - e-1/5) = 0.923 M0.\n\nMxy(TR+) = Mz(TR-) sinθ2 = Mxy(0+).\n\nθ2 = 27.3°\n\n2-d) Ignoring T1 effects, we find that Mxy(0+) = sinθ1, Mxy(TR+) = cosθ1 sinθ2. We wish\nto equate these and also maximize them. Clearly, the simplest solution for this is when θ1\n= 45°, θ2 = 90°.\n\n3) Rotation matrices can be used to track pulses and also phase evolutions. The rotation\nmatrices are defined as:\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\nθ\nθ\nθ\nθ\nθ\ncos\nsin\nsin\ncos\n)\n(\nx\nR\n,\n,\n.\nAll that remains is to write our pulse sequence in terms of these operations (and make\nsure we have the correct order, as the matrices DO NOT commute with each other).\nAccumulation of phase φ can be written as a rotation about the z-axis of angle φ.\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\nθ\nθ\nθ\nθ\nθ\ncos\nsin\nsin\ncos\n)\n(\ny\nR\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\ncos\nsin\nsin\ncos\n)\n(\nθ\nθ\nθ\nθ\nθ\nz\nR\n\na)\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n-\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n=\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\n)\n(\n)\n(\n)\n(\n)\n(\nM\nM\nM\nR\nR\nR\nR\nM\nx\nz\nx\nz\nnet\n\nb) First, let's determine the effects of the 90°x - τ - 180°x sequence:\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n=\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\n)\n(\n)\n(\n)\n(\n)\n(\nM\nM\nM\nR\nR\nR\nR\nM\nx\nz\nx\nz\nnet\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\nφ\n\nWe see that we have all our transverse magnetization rephased after 2τ - this is just a\nstandard spin-echo sequence. In part a, we found the two transverse components in terms\nof the angle φ; now we can just integrate those components across the uniform\ndistribution stated in the question.\n\n∫\n=\n=\nπ\nφ\nφ\nφ\nπ\ncos\nsin\nd\nM\nM x\n\n∫\n-\n=\n-\n=\nπ\nφ\nφ\nπ\nsin\nM\nd\nM\nM y\n\nc) Note: There is a typo in the question. The general sequence should have read θx - τ -\n2θ°x, not θx - τ - θ°x. I marked either answer correct however.\n\nFirst, the correct sequence:\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n+\n-\n+\n+\n-\n+\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n=\n)\ncos\n1(\ncos\nsin\ncos\n)\ncos\ncos\n(\ncos\nsin\nsin\ncos\nsin\n)\nsin\n(sin\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\n)\n(\n)\n(\n)\n(\n)\n(\nφ\nθ\nθ\nθ\nφ\nφ\nθ\nθ\nθ\nθ\nθ\nφ\nφ\nθ\nθ\nθ\nθ\nφ\nφ\nφ\nφ\nθ\nθ\nθ\nθ\nφ\nφ\nφ\nφ\nθ\nφ\nθ\nφ\nM\nM\nM\nR\nR\nR\nR\nM\nx\nz\nx\nz\nnet\n\nPerforming the same integration:\nθ\nφ\nφ\nφ\nθ\nθ\nθ\nπ\nφ\nθ\nθ\nφ\nφ\nπ\nπ\nπ\nsin\n)\ncos\ncos\n(\ncos\nsin\nsin\ncos\nsin\n)\nsin\n(sin\nM\nd\nM\nM\nd\nM\nM\nynet\nxnet\n-\n=\n+\n+\n-\n=\n=\n+\n=\n∫\n∫\n\nNow, with the typo sequence given in the question:\n\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n+\n-\n+\n+\n-\n+\n+\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n=\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n=\n)\ncos\n1(\nsin\n)\ncos\n(cos\nsin\nsin\nsin\nsin\nsin\n)\nsin\n(sin\nsin\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\ncos\nsin\nsin\ncos\n)\n(\n)\n(\n)\n(\n)\n(\nφ\nθ\nφ\nφ\nθ\nθ\nφ\nθ\nφ\nθ\nθ\nφ\nθ\nθ\nθ\nθ\nφ\nφ\nφ\nφ\nθ\nθ\nθ\nθ\nφ\nφ\nφ\nφ\nθ\nφ\nθ\nφ\nM\nM\nM\nR\nR\nR\nR\nM\nx\nz\nx\nz\nnet\n\nPerforming the same integration:\n)\nsin\n(sin\n)]\ncos\n(cos\nsin\nsin\nsin\n[\n]\nsin\nsin\n)\nsin\n(sin\nsin\n[\nθ\nθ\nφ\nφ\nφ\nθ\nθ\nφ\nπ\nφ\nθ\nφ\nθ\nθ\nφ\nπ\nπ\nπ\n-\n=\n+\n+\n-\n=\n=\n+\n+\n=\n∫\n∫\nM\nd\nM\nM\nd\nM\nM\nynet\nxnet"
    },
    {
      "category": "Assignment",
      "title": "assignment4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/7284db94e3840345c7e347ebb2a7a147_assignment4.pdf",
      "content": "HST.584 / 22.561 - Problem Set 4\nDue: Apr. 26 / 2006 in class\n\n1) One scheme for producing more rapid NMR images produces the following data\ncollection pattern or trajectory in k-space:\n\nky\nkx\n\na) What does the pulse sequence which produces this pattern look like? If a 128 x\n128 image matrix is desired, how many samples need to be collected per spin\necho?\nb) How many pulse repetitions are needed and how does this compare to\nconventional imaging?\n\n2) Prove any three of the Fourier Transform theorems discussed in class.\n\n3) In spin-warp (2D-FT) imaging, the evolution of the signal with time (i.e. S(t)) provides\nx-axis spatial information following a Fourier transformation (Gx is on during signal\nreadout), while over multiple experiments the evolution of S with successive phase\nencoding gradient (Gy) steps can be Fourier transformed to provide y-axis spatial\ninformation.\na) What is the effect of magnetic field inhomogeneities on each of these two forms\nof spatial encoding?\nb) If you were to image a bottle of Miracle Whip (fat & water), write an expression\n(as a function of your digital sampling, gradient strengths and / or duration, field\nstrength, etc.) for the displacement of the fat and water images (the 'chemical\nshift' artifact) along the x & y axes.\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "solutions4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/71dccd0dffa09a2c1ea05423c4e92564_solutions4.pdf",
      "content": "HST.584 / 22.561 Problem Set #4 Solutions\n\nFigure & Fourier Transform proofs courtesy Mark Khachaturian\n\nMarking Scheme: Question 1 - 4 points, Question 2 - 3 points, Question 3 - 3 points\n\n1-a) The question alludes to a spin echo sequence. One possible implementation is:\n\n180o\n90°\n\nRF\n\nGz\n\nGx\n\nGy\n\nIf we examine the given k-space trajectory closely, we see that the sampling pattern\nrepeats after every 4 samples (i.e. we return to the same value of ky every 4th sample). To\ngenerate 128 points in the frequency encode direction, we therefore must collect 4 x 128\n= 512 points in each spin echo.\n\nb) Each acquisition simultaneously acquires 4 different ky lines in k-space, so we would\nneed 128/4 = 32 repetitions of this basic pattern to generate our 128 phase encode steps.\nA standard 2DFT imaging sequence would require 128 steps so we have accelerated our\nsequence by a factor of 4. What we have done in general here is decreased the number of\nphase encode steps (phase encode steps are costly in terms of imaging time) by increasing\nthe number of samples in the frequency encoding direction.\n\n2) You are asked to prove any three of the Fourier transform theorems that Larry covered\nin class. Note that\nis used here as the Fourier transform operator.\n{ }\nF\n\nLinearity: {\n}\n{ }\n{ }\nh\nF\ng\nF\nh\ng\nF\nβ\nα\nβ\nα\n+\n=\n+\n\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\n{\n}\n(\n)\n(\n)\n[\n]\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n( )\n( )\nh\nF\ng\nF\ndxdy\ne\ny\nx\nh\ndxdy\ne\ny\nx\ng\ndxdy\ne\ny\nx\nh\ny\nx\ng\nh\ng\nF\ny\nk\nx\nk\ni\ny\nk\nx\nk\ni\ny\nk\nx\nk\ni\ny\nx\ny\nx\ny\nx\nβ\nα\nβ\nα\nβ\nα\nβ\nα\nπ\nπ\nπ\n+\n=\n+\n=\n+\n=\n+\n∫∫\n∫∫\n∫∫\n+\n-\n+\n-\n+\n-\n,\n,\n,\n,\n\n(\n)\n{\n}\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\nb\nk\na\nk\nG\nb\na\nby\nax\ng\nF\ny\nx ,\n,\nSimilarity:\n\n(\n)\n{\n}\n(\n)\n(\n)\n∫∫\n+\n-\n=\ndxdy\ne\nby\nax\ng\nby\nax\ng\nF\ny\nk\nx\nk\ni\ny\nx\nπ\n,\n,\n\nSubstituting\ny\nb\nv\nx\na\nu\n=\n=\n\ngives\n\n(\n)\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\n=\n∫∫\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\nb\nk\na\nk\nG\nb\na\ndudv\ne\nv\nu\ng\nb\na\ny\nx\nb\nv\nk\na\nu\nk\ni\ny\nx\n,\n,\n2π\n\nShift Theorem:\n(\n)\n{\n}\n(\n)\n(\n)\nb\nk\na\nk\ni\ny\nx\ny\nx\ne\nk\nk\nG\nb\ny\na\nx\ng\nF\n+\n-\n=\n-\n-\nπ\n,\n,\n\n(\n)\n{\n}\n(\n)\n(\n)\n∫∫\n+\n-\n-\n-\n=\ndxdy\ne\nb\ny\na\nx\ng\nby\nax\ng\nF\ny\nk\nx\nk\ni\ny\nx\nπ\n,\n,\n\nSubstituting\nb\ny\nv\na\nx\nu\n-\n=\n-\n=\n\ngives\n\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\nb\nk\na\nk\ni\ny\nx\nb\nk\na\nk\ni\nv\nk\nu\nk\ni\ny\nx\ny\nx\ny\nx\ne\nk\nk\nG\ndudv\ne\ne\nv\nu\ng\nab\n+\n-\n+\n-\n+\n-\n=\n=\n∫∫\nπ\nπ\nπ\n,\n,\n\nParseval's Theorem:\n(\n)\n(\n)\n∫∫\n∫∫\n=\ny\nx\ny\nx\ndk\ndk\nk\nk\nG\ndxdy\ny\nx\ng\n,\n,\n\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n{\n}\n(\n)\n(\n)\n(\n)\n{\n}\n(\n)\n∫∫\n∫∫\n∫∫\n∫∫\n∫∫\n∫∫\n∫∫\n=\n=\n=\n=\n+\n-\n+\n-\ny\nx\ny\nx\ny\nx\ny\nk\nx\nk\ni\ny\nx\ny\nx\ny\nk\nx\nk\ni\ny\nx\ndk\ndk\nk\nk\nG\ndk\ndk\ndxdy\ne\ny\nx\ng\nk\nk\nG\ndxdy\ndk\ndk\ne\nk\nk\nG\ny\nx\ng\ndxdy\ny\nx\ng\ny\nx\ng\ndxdy\ny\nx\ng\ny\nx\ny\nx\n*\n*\n*\n,\n,\n,\n,\n,\n,\n,\n,\nπ\nπ\n\nConvolution Theorem:\n(\n) (\n)\n{\n}\n(\n) (\n)\ny\nx\ny\nx\ny\nx\nk\nk\nH\nk\nk\nG\ndadb\nb\ny\na\nx\nh\nb\na\ng\nF\n,\n,\n,\n,\n,\n=\n-\n-\n∫∫\n\n(\n) (\n)\n{\n}\n(\n) (\n)\n{\n}\n(\n)\n(\n)\n(\n)\n(\n)\n{\n}\n∫∫\n∫∫\n∫∫∫∫\n∫∫\n+\n-\n+\n-\n-\n-\n=\n-\n-\n=\n-\n-\ndadb\ndxdy\ne\nb\ny\na\nx\nh\nb\na\ng\ndxdy\ne\ndadb\nb\ny\na\nx\nh\nb\na\ng\ndadb\nb\ny\na\nx\nh\nb\na\ng\nF\ny\nk\nx\nk\ni\ny\nk\nx\nk\ni\ny\nx\ny\nx\nπ\nπ\n,\n,\n,\n,\n,\n,\n\nUsing the shift theorem\n\n(\n) (\n)\n(\n)\n(\n) (\n)\n(\n) (\n)\n{\n}\n(\n) (\n)\ny\nx\ny\nx\ny\nx\ny\nx\nb\nk\na\nk\ni\ny\nx\nk\nk\nH\nk\nk\nG\ny\nx\nh\ny\nx\ng\nF\nk\nk\nH\nk\nk\nG\ndadb\ne\nk\nk\nH\nb\na\ng\ny\nx\n,\n,\n,\n,\n,\n,\n,\n,\n=\n⇒\n=\n= ∫∫\n+\n-π\n\nFourier Integral Theorem:\n(\n)\n{\n}\n(\n)\n{\n}\n(\n)\ny\nx\ng\ny\nx\ng\nF\nF\ny\nx\ng\nFF\n,\n,\n,\n=\n=\n-\n-\n\n(\n)\n{\n}\n(\n)\n(\n)\n{\n}\n(\n)\n(\n)\n(\n)\n{\n}\n(\n)\n(\n)\n{\n}\n(\n)\n(\n)\n(\n)\ny\nx\ng\ndk\ndk\ne\nk\nk\nG\ny\nx\ng\nF\nF\ndk\ndk\ne\ndxdy\ne\ny\nx\ng\ndxdy\ne\ndk\ndk\ne\ny\nx\ng\ny\nx\ng\nFF\ny\nx\ny\nk\nx\nk\ni\ny\nx\ny\nx\ny\nk\nx\nk\ni\ny\nk\nx\nk\ni\ny\nk\nx\nk\ni\ny\nx\ny\nk\nx\nk\ni\ny\nx\ny\nx\ny\nx\ny\nx\ny\nx\n,\n,\n,\n,\n,\n,\n=\n=\n=\n=\n=\n∫∫\n∫∫∫∫\n∫∫∫∫\n+\n-\n+\n+\n-\n+\n-\n+\n-\nπ\nπ\nπ\nπ\nπ\n\n3-a) In general, possible sources of inhomogeneities include main field inhomogeneities,\nsusceptibility-induced variations and chemical shift effects to name a few. T2* decay is a\nconsequence of inhomogeneity (enhanced dephasing of spins within a given voxel) - this\ndecay can both darken and blur an image. In the frequency encode direction,\ninhomogeneities can cause shifts in the image domain. In the phase encode direction, our\nimage can acquire phase (although we can eliminate this by taking the magnitude of our\nimage). We see this by writing our signal equation:\n∫∫\n-\n+\n-\n=\ndxdy\nt\ny\nx\ni\ny\nt\nk\nx\nt\nk\ni\ny\nx\nm\nt\ns\nE\ny\nx\n)\n)\n,\n(\nexp(\n])\n)\n(\n)\n(\n[\nexp(\n)\n,\n(\n)\n(\nω\nπ\n\nwhere ωE represents the spatially dependent frequency effects due to any inhomogeneity.\nIf we take m(x,y) to be a point object, we can track these effects more readily. Also,\nrecall that in 2DFT we apply gradient Gy for some fixed interval ty for phase encoding\nand Gx for a continuous time t during frequency encoding. Therefore:\n\n)\nexp(\n)\n)\n,\n(\nexp(\n)\nexp(\n)\nexp(\n)\n(\nφ\nγ\nγ\nγ\ni\nt\ny\nx\nE\ni\nt\ny\nG\ni\nt\nx\nG\ni\nt\ns\ny\ny\nx\n-\n-\n-\n-\n=\n\nwhere (x0,y0) is the location of our delta function object,\nγ\nωE\ny\nx\nE\n=\n)\n,\n(\n, and φ0 is any\nextra phase accrued during the phase encode interval due to the inhomogeneity (note that\nit is not a function of time).\n)\nexp(\n)\nexp(\n)\n]\n)\n,\n(\n[\nexp(\n)\nexp(\n)\nexp(\n)\n)]\n,\n(\n[\nexp(\n)\n(\nφ\nγ\nγ\nφ\nγ\nγ\ni\nt\ny\nG\ni\nt\nG\ny\nx\nE\nx\nG\ni\ni\nt\ny\nG\ni\nt\ny\nx\nE\nx\nG\ni\nt\ns\ny\ny\nx\nx\ny\ny\nx\n-\n-\n+\n-\n=\n-\n-\n+\n-\n=\n\nSo, our object positioned at (x0,y0) will instead be mapped to (x0 + E(x0,y0)/Gx,y0) with\nsome extra phase factor added on to the image.\n\nb) For the chemical shift, E(x0,y0) = ωCS = σB0. Therefore, our image will appear at (x0 +\nσB0 / Gx, y0); in other words, for this type of imaging, the chemical shift will affect only\nthe x-position and not the y-position. From the expression, we can see that we could\nreduced the chemical shift effect by increasing our gradient amplitude."
    },
    {
      "category": "Assignment",
      "title": "assignment5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/9597f662c09a8a2c3e1f851ca0a49cee_assignment5.pdf",
      "content": "HST.584 / 22.561 - Problem Set 5\nDue: May 10 / 2006 in class\n\n1) For an inversion recovery (IR) pulse sequence, what TI gives the maximum contrast /\nnoise (assume TR >> T1) for a T1-weighted image?\n\n2) For an inversion recovery pulse sequence, if the TI is set to be less that 0.69T1, then\nthe longitudinal magnetization ML will be negative before the 'read' 90 pulse, and thus\nthe signal will be opposite in phase to that obtained with longer TI's. However, most of\nthe images displayed for clinical use are 'absolute magnitude' images. In such an image,\nthe intensity is proportional to the magnitude of transverse magnetization, independent of\nits phase. An absolute magnitude image will give the same (+) signal whether ML was\nabove or below the x-y plane before the 'read' 90° pulse.\na) Sketch the signal as a function of TI for an 'absolute magnitude' IR image.\nb) For white & grey matter, (use T1 = 800 ms & 1000 ms respectively), at what TI\nwill you get the same signal for each? How does this compare to the TI of\nmaximum contrast as derived in Problem 1? Is this a problem and if so, how is it\nsolved and at what cost?\nc) If our sequence uses a spin echo to read the signal, how will using TI's < 0.69 T1\neffect the contribution (+ or -) of the resultant T2 weighting seen with spin echo\nacquisitions to the net or overall image contrast (assume our pathology has\nelevations in both T1 and T2)? What are the potential advantages and\ndisadvantages of such a pulse sequence, called a STIR or 'Short TI Inversion\nRecovery'.\n\n3) One method proposed to calculate T1 from signal intensity measurements is through\nthe use of a compound pulse sequence of the form shown below\n\na) Write an expression for the signal intensity of each spin echo (S1 and S2) as a\nfunction of T1, T2, TI, TE, a, b (assume that TI, a, and b are >> T2, but not T1).\n90 180 S1 180 90 180 S2\n0 1 2 3 4 5 6 7 8 9 10 11\nTE TI TE\na b\nb) Since this expression has T2 terms, how can you use signal intensities of the first\nand second echo to calculate T1?\n\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\n4)\na) Given a rapid train of α degree RF pulses separated in time by TR, and a tissue\nT1, derive the equilibrium expression for the signal intensity of an FID as a\nfunction of α (assume no residual transverse magnetization before the next pulse).\nDerive an expression for the flip angle needed to maximize this signal for\narbitrary TR/T1 (this is the Ernst Angle).\nb) For a tissue with a T1 of 800 msec, and a TR of 100 msec, how much\nimprovement in signal intensity is achieved by using the Ernst angle relative to\nusing a 90 degree tip? How much is this improved over using a spin echo pulse\nsequence (90 - 180 - echo) with TE = 20 ms (assume a T2 of 50 ms)? Why is the\nspin echo less than the 90 - TR - 90 sequence?"
    },
    {
      "category": "Resource",
      "title": "solutions5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/bf571b06d0e4047972e6890929217dbb_solutions5.pdf",
      "content": "HST.584 / 22.561 Problem Set #5 Solutions\n\nFigures courtesy Mark Khachaturian\n\nMarking Scheme: Question 1 - 2 points, Question 2 - 3 points, Question 3 - 3 points,\nQuestion 4 - 2 points\n\n1) For the standard IR sequence, we can write\n. Given that TR\n>> T1, we can assume that we return to equilibrium for each pulse. The easiest way to\ndo this derivation is with a differential signal approach (if you try and use two different\nmaterials represented by T1a and T1b, you will obtain an expression that cannot be solved\nexactly). First, we determine the differential signal with respect to T1:\n)\n1(\n/\nT\nTI\nT\ne\nM\nM\n-\n-\n∝\n/\nT\nTI\ne\nM\ndT\ndM\nT\nTI\nT\n-\n-\n∝\n. Now, we wish to maximize this expression with respect to TI.\nWe take the derivative,\n)\n1(\n/\nT\nTI\ne\nT\nM\ndT\ndM\ndTI\nd\nT\nTI\nT\n-\n-\n∝\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n, set equal to 0 and solve to\nfind that TI = T1. Really, this has provided us with the TI that maximizes contrast, but\nwe'll use it as a first approximation to maximizing CNR.\n\n2-a) Here we sketch two different signal evolutions as a function of TI for two different\nvalues of T1. The effect of taking the magnitude of the signal means we flip the negative\nsignal portions up to same polarity as our later signal\n\nb) We wish to determine the point in the above figure where the red and blue lines cross.\nUsing the notation T1w = 800 ms for white matter and T1g = 1000 ms for grey matter, we\nfind\nLong T1\nShort T1\nTI\nSI\nMo\nG\nw\nG\nw\nT\nTI\nT\nTI\nT\nTI\nT\nTI\ne\ne\ne\ne\n)\n1(\n)\n1(\n-\n-\n-\n-\n=\n-\n-\n-\n=\n-\n\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nSolving this numerically, we find TI = 618.0 ms. This is less than the TI we determined\nin the first question (TI for maximum contrast), and is definitely problematic because\ngrey and white matter will produce the same signal (i.e. no contrast!). We have two\nchoices to avoid this problem - we could lengthen TI (although then we have long\nimaging times) or shorten TI (although we will again lose CNR if we shorten it too\nmuch). In either case, we should be mindful of the zero-crossing points of our tissues -\nthese TI would generate no signal.\n\nc) Using TI < 0.69 for a spin echo acquisition (MT α e-TE/T2) will have the net effect of\nincreasing the overall image contrast, assuming our pathology has elevated both T1 and\nT2. This is most easily seen by picking two time points (one before and one after the\ncusps) and drawing T2 decay curves for the signal available. Prior to the cusp, an\nelevation in T2 shifts the signal curves away (increased contrast); after the cusp the signal\ndecay curves shift towards each other and perhaps even cross (less contrast). The\nadvantages of this sequence include good contrast and an ability to null the fat signal.\nDisadvantages include the extra acquisition time due to the use of the spin echo.\n\n3-a)\nWe will track the longitudinal and transverse magnetization at each point in the sequence\nas if were running this sequence for the first time. I gave full credit for answers such as\nthat because we did not explicitly ask for the steady-state solution (i.e. many repetitions\nof the same sequence). I will provide that derivation here as well:\n\nTime\nPoint\nMZ\nMT\nM0\nM0\nM0 (1 - e-TE / (2 T1))\nM0 e-TE / (2 T2)\n-M0 (1 - e-TE / (2 T1))\nM0 e-TE / (2 T2)\nM0 (1 - 2 e-TE/(2 T1) + e-TE/T1)\nM0 e-TE / T2\nM0 (1 - 2 e- (a - TE/2) / T1 + e- a / T1)\n-M0 (1 - 2 e- (a - TE/2) / T1 + e- a / T1)\nM0 + (Mz(6) - M0) e- TI / T1\nM0 + (Mz(6) - M0) e- TI / T1\nM0 (1 - e-TE / (2 T1))\n[M0 + (Mz(6) - M0) e- TI / T1]e-TE / (2 T2)\n-M0 (1 - e-TE / (2 T1))\n[M0 + (Mz(6) - M0) e- TI / T1]e-TE / (2 T2)\nM0 (1 - 2 e-TE/(2 T1) + e-TE/T1)\n[M0 + (Mz(6) - M0) e- TI / T1]e-TE / T2\n\nSo:\nS1 = M0 e-TE / T2\nS2 = [M0 + (Mz(6) - M0) e- TI / T1]e-TE / T2\n= M0 [1 - 2 e-TI/T1 + 2 e- (a + TI - TE / 2) / T1 - e-(a + TI) / T1] e-TE / T2\n\nFollowing this into the steady-state case (multiple repetitions of the same sequence):\nTime\nPoint\nMZ\nMT\n\nM0 (1 - 2 e-TE/(2 T1) + e-TE/T1)\n[M0 + (Mz(6) - M0) e- TI / T1]e-TE / T2\nEnd / 0\nM0(1 -2e-(b - TI - TE / 2) / T1 + e-(b - TI) / T1)\nM0(1 -2e-(b - TI - TE / 2) / T1 + e-(b - TI) / T1)\nAs above\nM0 e-TE/T2 [1 -2e-(b-TI-TE / 2) / T1 + e-(b -\nTI) / T1]\nAll the\nrest\nAs above\nAs above\n\nNow:\nS1 = M0 e-TE / T2 [1 -2e-(b-TI-TE / 2) / T1 + e-(b - TI) / T1]\nS2 = [M0 + (Mz(6) - M0) e- TI / T1]e-TE / T2\n= M0 [1 - 2 e-TI/T1 + 2 e- (a + TI - TE / 2) / T1 - e-(a + TI) / T1] e-TE / T2\n\nb) Taking the ratio the two expressions will eliminate the e-TE/T2 factor. We will then be\nleft with an expression in terms of the measured amplitudes S1 and S2 and all the timing\nparameters which we have set (a, b, TI, TE). We can rearrange this expression then to\nisolate T1 (or more likely solve for it numerically, because that expression is going to be\nunpleasant.\n\n4-a) We have the following basic picture:\n\nAs Larry showed earlier in the term, the easiest way to derive the Ernst angles expression\nis to assume we have reached a steady-state (i.e. many repetitions of this sequence),\nwhich allows us to conclude that Mz(0) = Mz(2) = Mz(4) etc.\n2 3\n0 1\n\nα\nα\nTR\nTR\n4 5\nα\n\nTime Point\nMz\nMT\nMz(0)\nMz(0) cosα\nMz(0) sinα\nMZ(2) = M0 + (Mz(0) cosα - M0)e-TR/T1\n= MZ(0)\n\nRearranging this last expression, we get a value for the equilibrium magnetization before\nthe pulse:\n)\ncos\n1(\n)\n1(\n)\n(\nα\nT\nTR\nT\nTR\nZ\ne\nM\ne\nM\nM\n-\n-\n-\n-\n=\n\nThe signal intensity is then given by MZ(0) sin α. We wish to maximize the signal with\nrespect to α, so we take the derivative with respect to α, set it equal to 0 and solve. The\nanswer is then\n.\n)\narccos(\n/T\nTR\ne-\n=\nα\n\nb) Subbing in the values given, we get\n.2\n)\n(\n)\n(\n=\nT\nT\nM\nM\nα\n. In other words, we have more\nthan doubled our signal by using the Ernst angle with respect to a more standard 90°\npulse. To compare to the spin echo sequence, we dive back into the notes and find that\n)\n1(\n)\n(\n/\n/\nT\nTR\nT\nTE\nT\ne\ne\nSE\nM\n-\n-\n-\n∝\n. Using this expression, we find\n.3\n)\n(\n)\n(\n=\nSE\nM\nM\nT\nT α\nand\n.1\n)\n(\n)\n(\n=\nSE\nM\nM\nT\nT\n. The reason for this is T2 decay. With the Ernst\nangle and 90° sequences, we begin acquiring signal right after the transverse\nmagnetization is created. In the spin echo sequence, we wait time TE before acquisition,\nduring which T2 effects reduce the net transverse amplitude."
    },
    {
      "category": "Exam",
      "title": "quiz_solutions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/055872ab92e7de2910c480539cbe8efe_quiz_solutions.pdf",
      "content": "HST.584 / 22.561 Exam Solutions\n\nMarking Scheme: a, b, c, d, e, f, h, i, j, k, l, m - 5 marks; g - 20 marks; Total = 70 marks\nas students could omit 2 questions.\n\na) As stated, we assume all magnetization is completely relaxed (i.e. along the z-\naxis) at the start of the pulse sequence. Following a right-handed rotation of 45°\nabout the -y axis, we have\n)1,0,1\n(\n0 -\n= M\nM\nr\n.\nb) Given the constraints, after 99 ms any transverse components will have\nexperienced T2\n* dephasing of the form\n*\nT\nt\ne-\n. Therefore,\n)\n,0,\n.0\n(\n)1,0,\n(\n-\n=\n-\n=\n-\nM\ne\nM\nM\nr\n.\nc) We desire the same signal amplitude after our second pulse as we had after our\nfirst pulse. This means we require the same transverse component (transverse\ncomponent determines signal amplitude) i.e. Mx(97ms) = Mx(2ms). If T1 >> 101\nms (i.e. no longitudinal relaxation has occurred), just prior to the second pulse we\nwill assume that all existing transverse magnetization has been dephased (T2\n*\ndecay) and our longitudinal component is the same as after our initial pulse.\nTherefore, to generate the same Mx component following our second pulse, we\nneed a 90° pulse. In other words:\ni.\n\n)1,0,1\n(\n)\n(\n0 -\n= M\nms\nM\nr\n\nii.\n)1,0,0\n(\n)\n(\nM\nms\nM\n=\nr\n\niii.\n)\n0,0,1\n(\n)\n(\n0 -\n= M\nms\nM\nr\nfollowing 90° pulse about -y axis\nd) If we account for T1 recovery of the longitudinal magnetization, Mz(99ms) will\nbe larger than Mz(2ms) and thus we will require a smaller flip angle than in the\nprevious question.\n)\n)\n(\n(\n)\n(\nT\nt\nz\nz\ne\nM\nM\nM\nt\nM\n-\n-\n+\n=\n\n.0\n)\n(\n)\n(\nM\ne\nM\nM\nM\nms\nM z\n=\n-\n+\n=\n-\n\nWe require Mx(101ms) = Mz(99ms)sinθ2 = 0.889M0 sinθ2 = Mx(2ms) =\nM\n-\n.\n\nTherefore, θ2 = 52.3° about the -y axis.\n\ne) Our bandwidth determines the slice thickness; our frequency offset from the\nLarmor frequency determines the slice position along the z-axis.\ni.\nBandwidth:\n\nHz\nGcm\ns\nG\ncm\nG\nz\nZ\n)\n)(\n(\n1.0\n=\n=\n∆\n-\n-\n-\nγ\nii.\nOffset:\n\nHz\nGcm\ns\nG\ncm\nG\nz\nZ\noff\n)\n)(\n(\n=\n=\n-\n-\n-\nγ\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nf) This is simply a Fourier relationship. Sinc RF pulses produce rectangular\nexcitation profiles. Gaussian RF pulses produce Gaussian excitation profiles,\nwith an inverse relationship (i.e. A wide Gaussian in time will excite a narrow\nGaussian slice, a narrow Gaussian in time will produce a wide Gaussian slice). I\nam not going to attempt to draw Gaussians in Word - see me if you'd like an\nexample.\ng) The basic formula for determining k-space position is\n. Our unit\nof δk corresponds to\n. To\ndetermine our trajectory, we simply integrate our gradient waveforms.\n∫\n=\nt\nd\nG\nt\nk\n)\n(\n)\n(\nτ\nτ\nγ\n)\n5.0\n)(\n1(\n-\n-\n-\n-\n-\n=\n=\n=\ncm\ns\nx\nGcm\ns\nG\nGt\nk\nγ\nδ\n\nFig. 1 - k-space trajectory for the gradient waveforms between t = 0 ms and t = 100\nms. The numbers on the actual trajectory corresponds to times in ms.\n\nh) If we read off the trajectory we traced out in the previous question, we produce\nthe following ordered pairs (in units of δk):\nTime (ms)\n(kx, ky) (Units of δk)\n(0, 0)\n(-5, 15)\n(-5, 15)\n(-5, 31)\n(-5, 31)\n(15, -5)\n\ni) This large Gy pulse is a spoiler or crusher gradient meant to dephase the residual\ntransverse magnetization.\nj) No, we did not use a rectilinear approach to cover k-space (constant spacing along\nk-space lines Æ think EPI or 2D-FT imaging approach).\nk) After the second series of gradient manipulations, we have traced out two zig-zag\npatterns about the +ky axis and +kx axis. While we can use Fourier symmetry\nrelations to reduce the k-space coverage for a real object (and most objects are\nreal), we have not covered enough of k-space yet to employ one of the relations.\nAt minimum, we need to cover 1⁄2 of k-space to reconstruct a real object (and in\npractice slightly more, such as 9/16 or 5/8, in order to make appropriate phase\ncorrections - for more detail on this take HST.587 with Dr. Elfar Adelsteinsson)\nl) Resolution = 1 / kmax in both dimensions.\nTaking kxmax = 15 δk = 30 cm-1. Therefore, resx = 1/30 cm\nTaking kymax = 15 δk = 30 cm-1. Therefore, resy = 1/30 cm\nm) kx is sampled most densely near the origin (between 3 & 4 ms) & least densely on\nthe final leg of the trajectory (between 10 & 11 ms).\nFOVx = 1 / ∆kx, FOVy = 1 / ∆ky\nIf our FOV is based on the least densely sampled region, we cover 9 δk in 16\nsamples. Therefore, ∆kx = 9 (2 cm-1) / 16 = 9/8 cm-1. Thus FOVx = 8/9 cm.\nSimilarly, ∆ky = 9 (2 cm-1) / 16 = 9/8 cm-1. Thus FOVy = 8/9 cm."
    },
    {
      "category": "Exam",
      "title": "quiz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/7dcf2042f0a29a0123ae13d6051d719e_quiz.pdf",
      "content": "HST.584 / 22.561J Quiz - Mar. 22 / 06\n\nOf the following 13 questions, you are asked to answer any 11 that you'd like (i.e. you\nmay omit any two, EXCEPT FOR PART G AND PART H - you must answer both of\nthese).\n\nConsider the pulse sequence in Figure 1. Sketch the following aspects of the\nmagnetization and k-space trajectory as a function of time. Assume that the RF pulses\nare on resonance, consist of B1 fields along the negative y-axis and rotate the\nmagnetization according to the right hand rule. Assume that γ is 2π * 4000 radians per\nsecond per Gauss (2π * 4000 s-1 G-1) or 4000 cycles per second per Gauss (4000 s-1 G-1).\n\na) Ignore the gradients for now. Assuming the spins are fully relaxed at time t = 0,\nwhat are the x, y and z components of the magnetization in the rotating frame at\ntime t = 2ms assuming T1, T2 and T2* are >> 2 ms?\nb) What are the x, y and z components of the magnetization in the rotating frame at\ntime t = 99 ms, assuming T2* = 50 ms, and T1 and T2 are >> 99 ms?\nc) What flip angle θ should be chosen for the second RF pulse to provide the same\nsignal amplitude at time t = 101 ms as at time t = 2 ms? Assume T1 >> 101 ms.\nd) What flip angle should be chosen if T1 = 100 ms?\n\nNow consider the Gz gradient only.\ne) If Gz = 1 G/cm during the RF pulses, what bandwidth and frequency offset (∆ω\nfrom Larmor freq.) should be chosen to provide a 1 mm thick slice with offset of\n1 cm along the z axis?\nf) If the RF pulses were Gaussian envelopes in time as opposed to the more\nconventional sinc pulses shown in Figure 1, roughly sketch the approximate shape\nof the slice profile along the z-axis.\n\nNow add in the Gx and Gy gradients. Assume that the slew rate is very fast where it is\ndrawn as such. Consider sampling of the NMR signal regularly in time for 8 ms starting\nat time t = 3 ms. Remember, you must answer parts G and H.\ng) Using the graph paper provided, draw the trajectory in the kx, ky plane from time t\n= 0 to time t = 100 ms. Notate the location in the kx, ky plane every ms for the\nimportant time periods. Draw the tick marks on the kx & ky axes in units of δk,\nwhere δk corresponds to the k increment from a gradient of strength 1 G/cm on\nfor 0.5 ms.\nh) What is the (kx, ky) coordinate at time t = 0 ms, 11 ms, 14 ms, 16 ms, 99 ms and\n110 ms?\ni) What is the likely purpose of the Gy pulse starting at t = 14 ms?\nj) Did we cover k-space in a rectilinear fashion?\nk) Did we cover enough k-space to form an image of a real object? (briefly explain)\nl) What would the resolution of the image be in x and y?\nm) If the sampling rate is 16 samples per ms, where is k-space sampled the most\ndensely in kx? the least densely? Defining the FOV in x based on the least\ndensely sampled region, what would the FOV in x be? What is the FOV in y?\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "jinzhoupresent.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/345c42698da9f1eb0534fab53891b449_jinzhoupresent.pdf",
      "content": "22.561 Final Project\n19F Magnetic resonance imaging of\nperfluorooctanoic acid encapsulated in\nliposome for biodistribution measurement\nMagnetic Resonance Imaging\nJin Zhou\nMay 17, 2006\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nMotivation and Challenges\nVisualization of the tissue distribution of perfluorooctanoic acid\n(PFOA, C7F15COOH) by 19F-MRI for pharmacological studies of similar\ncompounds (many applications; toxicity)\nWide-range distribution of chemical shifts of 19F-containing\nmetabolites Æ molecular imaging and tissue function evaluations\n19F-MRI for image contrast enhancement\n-\nNo background Æ 19F signal is the contrast for 1H-MR image (anatomy)\n-\n19F has the next highest MR sensitivity (83% of 1H)\nChallenges intrinsic to 19F-MRI\n-\n19F has Long T1 Æ long acquisition time; Short T2 Æ signal attenuation\n-\nChemical shifts of 19F NMR Æ chemical shift image artifacts (although\npreferred to trace the metabolism)\n-\nSignal can only be obtained from the agents retained in tissue Æ SNR\nis the major concern for 19F-MRI\n\nSolution - Chemical Shift Selected Fast Spin-Echo\nChemical shift artifacts\nÆ chemical shift selected\nRF pulse\nShort T2\nÆ Spin Echo (SE) to\npreserve the signal\nLong T1 Æ Fast Spin Echo (FSE) to shorten acquisition time\nMultiple phase-encoding steps with a single excitation (90° RF) and\nmultiple echoes (180° RF), # of echoes per TR = echo train length (ETL)\nAcquisition time reduced proportional to ETL\nEffective echo time (TE) = maximum TE / ETL\nCourtesy of www.MR-TIP.com. Used with permission\n\nChemical Shift Selection\n9.4T (376.2 MHz)\nTR = 0.2 s, 128 scans\nThe 19F NMR spectra in\nthe female mouse\nstomach and liver were\nmeasured 0.4 and 2.7 h\nafter the administration\nof the PFOA-liposome\nsolution, respectively.\nFigure removed for copyright reasons.\nSee Kimura, A., M. Narazaki, Y. Kanazawa, and H. Fujiwara.\n\"19F Magnetic resonance imaging of perfluorooctanoic\nacid encapsulated in liposome for biodistribution measurement.\"\nMagnetic Resonance Imaging 22 (2004): 855-860.\n-\nChemical shift between -CF3 group and other -CF2 groups > 35 ppm\n(10 times that of fat and water 1H) Æ frequency difference ~14 kHz\n-\nChemical shift selection was able to eliminate chemical shift artifacts.\n-\nOnly -CF3 signal was excited Æ no the signal intensity modulation by\nJ-coupling caused by adjacent 19F atoms\n\n19F Relaxation Times\nStandard deviations\nin parentheses\n-\nT1 by Inversion Recovery Æ double dynamic range\n-\nT2 by Carr-Purcell-Meiboom-Gill (CPMG) Æ refocusing pulse error\ncorrected at even echoes\n-\nT2 of water 1H ~ several tens to hundreds of ms; T2 of -CF3 group of\nPFOA < 10 ms in vivo\nShort T2 in liposome probably due to high solution viscosity\n-\nBoth T1 and T2 of -CF3 of PFOA were shortened in vivo\nMolecular motion of PFOA restricted, especially the -CF3 group\n\nIn Vitro 19F-MRI of PFOA-Liposome Solution\n- Parameter Optimization for In Vivo 19F-MRI\nETL = 2 in (b) more effective than ETL = 4 in (c)\n-\n[PFOA] = 5.4 mM; Effective TE = 1 ms\n-\nFor ETL = 4, last two echoes at 3, 4 ms\n-\nT2 of -CF3 of PFOA in solution = 2.3 ms\nMaximum TE value constrained by T2,\nincrease ETL to reduce effective TE\n-\nMore 180° RF pulses per TR\n-\nRequires strong and rapidly\nswitching gradients\n-\nUnder instrumental constraints,\nETL = 2 was used as the optimal\nvalue for in vivo 19F-MRI.\nImages removed for copyright reasons.\nSee Kimura, A., M. Narazaki, Y. Kanazawa, and H. Fujiwara.\n\"19F Magnetic resonance imaging of perfluorooctanoic acid\nencapsulated in liposome for biodistribution measurement.\"\nMagnetic Resonance Imaging 22 (2004): 855-860.\n\nIn Vivo 19F-MRI\nImages removed for copyright reasons.\nSee Kimura, A., M. Narazaki, Y. Kanazawa, and H. Fujiwara.\n\"19F Magnetic resonance imaging of perfluorooctanoic acid\nencapsulated in liposome for biodistribution measurement.\"\nMagnetic Resonance Imaging 22 (2004): 855-860.\n1 mL PFOA-liposome\nsolution orally\nadministered to mice\nwith fasting for 4 hr\n9.4T (376.2 MHz); Chemical shift selection: Gaussian pulse, 9kHz band width; TR = 0.15 s;\nEffective TE = 1 ms; ETL = 2; 64 x 16 data points; FOV = 8cm x 4cm; No slice selection;\nAcquisition time = 12min\nPFOA initially in the mouse stomach Æ at 1 hr, began to distribute\ninto the liver Æ at 2.7 hr, PFOA mostly transferred to the liver\n\nPFOA Tissue Distribution Quantification by 19F-NMR\nThe lowest concentration of PFOA that 19F-MRI was able to visualize was\nestimated from the images Æ ~ 1 μmol PFOA / g tissue\nAssume tissue density = 1g/mL Æ ~1 mM of PFOA << ~100M of water 1H\nMice were sacrificed after 19F-MRI\nand the organs were excised and\ncut into pieces for 19F-NMR.\n19F-NMR signal intensity of -CF3 of\nPFOA from different organs was\nmeasured and calibrated by signal\nfrom benzene solution of\ntrifluoroactamide (CF3CONH2) for\nquantification.\n\nConclusions\n- Tissue distribution of PFOA was successfully traced by\n1H and 19F -MRI, the latter of which used chemical shift\nselected fast spin-echo method.\n- It was necessary to administer PFOA at high\nconcentration of 100 mg (0.19 mmol)/kg body weight,\ncorresponding to 20 times the dose using radiolabel\nmethod. Æ major challenge for 19F-MRI is SNR\n- Contrast agents that elongate T2 and shorten T1 are\ndesirable.\n\nQuestions?\n-\nWould you use ETL = 3 or 4 for in vivo 19F-MRI\nsince T2 = 6.3ms instead of 2.3ms?\n-\nIf the acquisition time is 12 min (0.2 hr) and\nPFOA is moving, what actual states do the\nimages at 0.4, 0.6, 1.0 hr ... represent?\n-\nIs FSE is the optimal sequence for 19F-MRI?\n-\nHow to make use of all the 19F nuclei in PFOA\ninstead of -CF3 only since the concentration of\nPFOA is the limiting factor?"
    },
    {
      "category": "Resource",
      "title": "jinzhousummary.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/053f9a3692afad971ef36329c6b72ded_jinzhousummary.pdf",
      "content": "Kimura et. al.,\n19F Magnetic resonance imaging of perfluorooctanoic acid encapsulated in liposome for\nbiodistribution measurement, Magnetic Resonance Imaging 22: 855-860, 2004\nExecutive Summary\nThe motivation of this paper is to visualize of the tissue distribution of perfluorooctanoic acid\n(PFOA, C7F15COOH) by 19F-MRI for pharmacological studies of similar compounds since they have\nbeen used for blood substitute and exhibited in vivo toxicity to industrial workers despite of their\nnumerous applications. In general, the wide-range distribution of chemical shifts of 19F-containing\nmetabolites can be used for molecular imaging and tissue function evaluations. Furthermore, 19F-MRI\nusing 19F-containing compounds has the potential for image contrast enhancement because (1) there\nis no background of 19F signal in biological systems (19F signal is the contrast for 1H-MR image that\nprovides anatomy information); (2) 19F has the next highest MR sensitivity (83% of 1H); and (3)\ncurrent 1H-MRI scanners can be used for 19F-MRI without expensive hardware adjustment. The\nchallenges intrinsic to 19F-MRI are (1) 19F has Long T1 (resulting in long acquisition time) and short T2\n(causing signal attenuation); (2) chemical shifts of 19F-NMR cause chemical shift image artifacts\n(although preferred to trace the metabolism); and (3) signal can only be obtained from the agents\nretained in tissue (SNR is the major concern for 19F-MRI though one perfluorocarbon molecule\ncontains many 19F nuclei).\n\nTo face these challenges, the authors exploited the chemical shift selected fast spin-echo (FSE)\nmethod to successfully trace the tissue distribution of PFOA by 19F-MRI and 1H-MRI. Chemical shift\nselected RF pulse to excite only the -CF3 group of PFOA\nwas made possible because of the large chemical shift\nbetween -CF3 and the other -CF2 groups, which\nexceeded 35 ppm (10 times that of fat and water 1H). AT\n9.4 T (376.3 MHz), this gives a frequency difference of\nabout 14 kHz. Chemical shift selection not only\neliminated chemical shift artifacts but also rid of the\nsignal intensity modulation caused by J-coupling from\nadjacent 19F atoms. To preserve 19F MR signal, spin echo\nwas used due to the short T2 of -CF3 of PFOA in vivo\nbecause gradient echo would cause severe T2* effect and\nthe 19F MR signal would be lost even faster. To shorten the acquisition time of 19F-MRI with long T1\nof 19F, fast spin echo (FSE) sequence was utilized. Figure 1 illustrates the timing of FES sequence. The\n# of echoes (or # of 180° RF pulses) per repetition is called the echo train length (ETL). The acquisition\ntime was shortened because multiple phase-encoding steps with a single excitation (90° RF) followed\nby multiple echoes (180° RF) were carried out so that the acquisition time is reduced proportional to\nETL. Effective echo time (TE) = last (maximum) echo time/ETL.\nFigure 1. FSE pulse sequence timing diagram\n\nThe in vivo relaxation times, T1 and T2, of -CF3 of PFOA were measured by inversion recovery\n(IR) and Carr-Purcell-Meiboom-Gill (CPMG) methods respectively. As discussed in class, IR doubles\nthe dynamic range for more accurate T1 measurement. In HW#2-P3, we learned that the CPMG\nmethod corrects the refocusing pulse error if any at even echoes to ensure the accurate measure of T2.\nIt was determined that both T1 and T2 were shortened in vivo due to molecular motion restriction of\nPFOA molecules, especially the -CF3 groups. T2 of water 1H ranges from several tens to hundreds of\nms; while T2 of -CF3 group of PFOA is less than 10 ms (6.3 ms) in vivo. Short T2 (2.3 ms) observed in\nJin Zhou\n22.561 Final Project\nCourtesy of www.MR-TIP.com. Used with permission.\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nKimura et. al.,\n19F Magnetic resonance imaging of perfluorooctanoic acid encapsulated in liposome for\nbiodistribution measurement, Magnetic Resonance Imaging 22: 855-860, 2004\nPFOA-liposome solution was probably due to high solution viscosity. Fortunately, short in vivo T1 of\nPFOA enabled the shortening of acquisition time so that image quality was improved by data\naveraging. The in vivo 19F-MR image was obtained in 12 min.\n\nTo optimize in vivo 19F-MRI parameters, in vitro 19F-MRI was done on PFOA-liposome solution\nin an NMR tube (9.4 T, effective TE = 1ms). Both the images obtained and k-space data confirmed that\nETL = 2 is more effective than ETL = 4. The image of ETL = 4 gives better edge definition of the NMR\ntube than that of ETL = 2. Correspondingly, in k-space, the signal amplitude with ETL = 2 is clearer in\nthe high spatial frequency domain, which contains high-solution information of the image, than that\nof ETL = 4. Given that T2 of -CF3 of PFOA in liposome solution is 2.3 ms and effective TE is 1 ms, for\nETL = 4, the last two echoes were collected at 3 and 4 ms when the transverse magnetization\namplitude of 19F should have been very small. Thus, these data collection would not contribute much\nto the signal but rather cause noise accumulation, which could be the reason why ETL = 4 turned out\nto be less effective than ETL = 2. To effectively collect data and shorten the image acquisition time, it\nis necessary to use strong and rapidly switching gradients given that the maximum TE is less than 10\nms, which was difficult to implement under instrumental limitations. Thus, ETL = 2 was used as the\noptimal value for in vivo 19F-MRI.\n\nAfter 1 mL of PFOA-liposome solution was orally administered to mice (fasted for 4 hr), 1H-\nMR image and a series of 19F-MR images were collected at 0.4, 0.6, 1.0, 1.3, 1.6, 1.8, 2.4, and 2.7 hr.\nTypical 19F-MRI conditions are: 9.4T (376.2 MHz); chemical shift selection - Gaussian pulse with\n9kHz band width; TR = 0.15 s; effective TE = 1 ms; ETL = 2; 64 x 16 data points; FOV = 8cm x 4cm; no\nslice selection; acquisition time = 12min. 1H and 19F -MR coronal images were combined and it was\nobserved that PFOA that initially existed in the mouse stomach began to distribute into the liver 1\nhour after the administration of PFOA; after 2.7 hr, PFOA was transferred mostly from the stomach\nto the liver. After 19F-MRI, mice were sacrificed and the organs were excised and cut into pieces for\n19F-NMR, in which the signal intensity of -CF3 of PFOA from different organs was measured and\ncalibrated by signal from benzene solution of trifluoroactamide (CF3CONH2) for quantification. With\nthis quantification, the lowest concentration of PFOA that 19F-MRI was able to visualize was\nestimated from the images to be about 1 μmol PFOA / g tissue. If we assume a tissue density of\n1g/mL, this concentration is about 1 mM of PFOA in tissue, which is 5 orders of magnitude less that\nof water 1H concentration (~100M).\n\nIn conclusion, tissue distribution of PFOA was successfully traced by 1H and 19F -MRI, the\nlatter of which used chemical shift selected fast spin-echo method. It was necessary to administer\nPFOA at high concentration of 100 mg (0.19 mmol)/kg body weight, corresponding to 20 times the\ndose using radiolabel method, confirming that the major challenge for 19F-MRI is SNR. Contrast\nagents that elongate T2 and shorten T1 are desirable.\n\nBased upon this study, the following questions are of interest to me. (1) Would you use ETL =\n3 or 4 for in vivo 19F-MRI since T2 = 6.3ms instead of 2.3ms? (2) If the acquisition time is 12 min (0.2\nhr) and PFOA is moving, what actual states do the images at 0.4, 0.6, 1.0 hr ... represent? (3) Is FSE is\nthe optimal sequence for 19F-MRI? (4) How to make use of all the 19F nuclei in PFOA instead of -CF3\nonly since the concentration of PFOA is the major limiting factor?\n\nFinally, I very much enjoyed this course. Grateful thanks to you all!\nJin\nMay 17, 2006\nJin Zhou\n22.561 Final Project"
    },
    {
      "category": "Resource",
      "title": "proj_description.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/9fdabde72f8fa5ac7a846d93fab3a36c_proj_description.pdf",
      "content": "HST.584 / 22.561 - Final Class Project\nDue: Presentations will be given May 17 / 2006 in class\n\nRationale: One of the stated goals of this course is to equip students with enough\nfamiliarity with the basics of MRI and its many applications that they can read and\nunderstand current papers published from across the field. The goal of this final project\nis to demonstrate such competency.\n\nAssignment: You are asked to select a recent paper that somehow involves MRI or\none of its applications and give a well-formulated and thoughtful presentation of this\npaper to the class. This description of the topic is intended to be vague to give you a\nwide degree of freedom in choosing a paper that interests you. The possible range could\ninclude papers of technical interest (i.e. coil or sequence development, reconstruction\nalgorithms, contrast agent development / use), MRI applications (i.e. an fMRI study, a\ndiffusion-weighted imaging study of some physiological or neural feature, MRI\nspectroscopic imaging) or clinical relevance (i.e. a study of the brain / heart / lungs / liver\n/ some other organ system or tissue). Be creative in your selection of topic, but where at\nall possible try to relate the paper back to the concepts learned in class to demonstrate\nyour mastery of the material. Journal suggestions include Science, Nature (and the rest of\nthe Nature family), Magnetic Resonance in Medicine, Journal of Magnetic Resonance,\nJournal of Magnetic Resonance Imaging, Magnetic Resonance Imaging, Journal of\nNeuroscience, Neuroimage and Neuron, although this list is only a sampling.\n\nOutcome: In the final class of the term, you will give a 15 minute presentation on the\npaper you selected. You will be graded on your ability to clearly explain the paper using\nthe concepts developed over the semester in the lectures, including any relevant\nbackground theory, the hypothesis or rationale for the study, the results obtained and the\nsignificance of said results. Additionally, you will submit a one-page written Executive\nSummary of the paper summarizing these same ideas. It is strongly recommended that\nall students run their selected paper past one of the instructors or the TA prior to\nembarking on any substantial amount of work. Please bring copies of the paper to share\nwith the other students in\n\nclass.\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "ryan_lan_present.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/e318cb4004eecf5070ec6179e9ae1e00_ryan_lan_present.pdf",
      "content": "Magnetic Particle Imaging*\nA Parallel to MRI?\nRyan Lanning\nHST.584 Final Project\nMay 16, 2006\n*Gleich, B. and Weizenecker, J. Tomographic imaging using the\nnonlinear response of magnetic particles. Nature. 435: 1214-1217\n(2005).\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nWhat is Magnetic Particle Imaging (MPI)?\nIn the simplest terms - Imaging the magnetization\nof magnetic nanoparticles (MNPs)\n- Spatially Resolved Magnetorelaxometry\n- Utilizes a SQUID gradiometer sensitive to 1st\nor 2nd spatial derivative of magnetic field\n-\nRomanus, E. et al. Magnetic nanoparticle relaxation measurement as a novel tool for in vivo\ndiagnostics. J. Magn. Magn. Mat. 252: 387-9 (2002).\n- Imaging magnetization of MNPs using\ntheir nonlinear response to a modulated\nfield\n- Spatial selection possible by taking advantage\nof saturation effects\n\nNonlinear Response of MNPs\nDiagram removed for copyright reasons. See Young, H. D. University Physics. 8th ed. Addison-Wesley, Sec 29-8 (1992).\n- Applies to ferromagnetic\nmaterials\n- Nonlinear response occurs\nfrom zero-field values\n\nNonlinear Response to Modulated\nExternal Field\n- Oscillating magnetic field\napplied to MNPs\n- Produces a time varying\nresponse in magnetization\n[M(t)]\n- M(t) is composed of a\nnumber of higher harmonics\n- Addition of a time-invariant\nfield produces constant M(t)\nand minimized harmonics\nGraphs removed for copyright reasons.\nSee Figure 1 (page 1214) from Gleich, B., and J. Weizenecker.\n\"Tomographic Imaging using the Nonlinear Response of Magnetic Particles.\"\nNature 435 (2005): 1214-1217.\n\n- Time-independent\nspatially varying field\napplied\n- Most of object has\nmagnetization\nsaturated\n- Regions around zero\nfield strength respond\nnonlinearly\n- Modulated signal [M(t)]\nin response to\noscillating field occurs\nonly in region of\nnonlinearity\nMPI Spatial Selection\nField-Free Point (FFP)\nDiagram removed for copyright reasons.\nSee Figure 1 (page 1173) from Trabesinger, A.\n\"Particular Magnetic Insights.\" Nature 435 (2005): 1173-4.\n\nMagnetic Contrast Agents in MPI vs MRI\n- Liver-specific contrast\nagent\n- Magnetic susceptibility\naffects on protons\n- Decreases T1, T2, T2\n*\n- Diminished signal\nintensity in T2 and T2\n* -\nweighted images\nResovist - carboxydextran-coated superparamagnetic iron oxide (SPIO) particles (ferucarbotran)\n- Directly image the\nmagnetization\n- Only areas with contrast\nagent highlighted\n- No biological signal\n- Improved SNR\nMRI\nMPI\nMRI images removed for copyright reasons.\n\"Hepatic lesion detection at MR imaging: a comparative study with four sequences.\"\nRadiology 203 (1997): 759-65.\nSee Blakeborough et al.\n\nMethods of MPI Image Acquisition\nTwo Fundamental Ways to Spatially Encode\nMechanical Movement\n-\nObject physically moved around the\nFFP\n-\nLow amplitude oscillating field\n-\nSlow Scanning Speed\n-\nLow SNR\n- Apply 3 homogenous fields (drive\nfields) orthogonal to object\n- FFP moved by adjusting drive\nfields\n- High amplitude oscillating fields\n- Fast encoding and high SNR\nField-Induced Movement\nDiagram removed for copyright reasons.\nSee Figure 2 (page 1215) from Gleich, B., and J. Weizenecker.\n\"Tomographic Imaging using the Nonlinear Response of Magnetic Particles.\"\nNature 435 (2005): 1214-1217.\n\nCompare MPI and MRI Spatial Encoding\n\"Because the interaction may be regarded as a coupling of the two fields by the object, I propose\nthat image formation by this technique be known as zeugmatography, from the Greek ζευγμα,\n'that which is used for joining.\"*\nMRI\nMPI (Theoretical)\n-\nStatic magnetic field for\nproton resonance\n-\n3 gradient fields for spatial\nencoding:\n- 1 axial (Z) slice selection\n- 2 transverse (XY) encoding\n-\nOscillating current applied to\ngradient field coils\n- At proton resonance\n-\nGradient coils detect signal\n-\nPhased arrays possible\n-\nLarge apparatus\n-\nStatic magnetic field for\nselecting nonlinear region\n(selection field)\n-\n3 gradient fields for spatial\nencoding (drive fields)\n-\nOscillating current applied to\ngradient field coils\n- Independent frequency\nselection\n-\nSeparate recording coil(s)\n-\nSingle side application\n-\nSmall apparatus\n*Lauterbur, P.C. Image formation by induced local interactions: examples employing nuclear magnetic resonance. Nature.\n242: 190-1 (1973).\n\nMPI - Proof of Principle\nDiagram of Maxwell coils and magnetic field\nlines removed for copyright reasons.\nImages removed for copyright reasons.\nSee Figure 3 (page 1215) from Gleich, B., and J. Weizenecker.\"Tomographic Imaging using the Nonlinear Response of Magnetic Particles.\"\nNature 435 (2005): 1214-1217.\n\nImaging Resolution in MPI vs MRI\nEncompasses Spatial Resolution and SNR\n-\nPhysically limited by movement of\nH2O\n-\nPractically limited by gradient\nslewing, measurement time and\nnoise from instrumentation\n-\nDetermined by FOV and sampling\nfrequency in transverse plane\n-\nDetermined by gradient slice\nselection in axial plane\ns\nx f\nG\npixels\nFOV\npixel\nγ\n#\n=\n=\nMRI\nMPI (Theoretical)\nz\nG\nz\nγ\nω\n∆\n=\n∆\n-\nLimited by field strength at which\nMNPs produce significant\nharmonics\n-\nAlso, determined by gradient\nchanges and measurement time\n(∝drive frequency)\n-\nSNR is large: field intensity from\nMNPs\ns\nk\nG\nB\nR\n=\nGraph removed for copyright reasons.\nSee Figure 4 (page 1216) from Gleich, B., and J. Weizenecker.\n\"Tomographic Imaging using the Nonlinear Response of Magnetic Particles.\"\nNature 435 (2005): 1214-1217\n.\n\nMPI Image Reconstruction\nDrive field leads to contribution of neighboring points\nNeed to find the MNP response for each harmonic detected\n∫\n=\nx\nd\nx\nC\nr\nG\ny\nV\nn\nn\nˆ\n)ˆ\n(\n)ˆ(\n)ˆ\n(\n)ˆ\n(\n)ˆ\n(\n)ˆ\n(\nk\nc\nk\ng\nk\nv\nn\nn\n=\nFT\nSolve for gn(k) by imaging known reference sample and\ndividing out c(k). Then perform FT to obtain response\nfunction.\n\nHow to Apply MPI to Medical\nImaging\n- Need to image larger volume ( > 6mm X 6mm)\n- Determined by the FFP shift:\n- Need faster encoding time ( <<18 min)\n- Determined by voxel volume (N3) and drive field\nfrequency (~ 25 kHz):\n- Therefore, need larger drive fields and potentially\nhigher frequencies\n- Drive field amplitudes ~20mT and frequencies ~\n100kHz can be safely used in humans\ns\nG\nA\nF\n=\n2 f\nN\nT =\n\nMRI & MPI Head to Head\nMRI\nMPI\n-\nDetects signal from\nadministered agents\n-\nWill only image MNPs\n-\nHigh contrast with\nbackground\n-\nHigh Sensitivity and\nResolution\n-\nLong RF wavelength\n(~1km) allows significant\ntissue penetration\n-\nPotentially Cheaper\nEquipment\n-\nDetectors can be much\nlarger than the imaging\nvolume\n-\nDetects native signal from\ntissue\n-\nMany multiple imaging\ntechniques\n-\nCan also utilize\nadministered contrast\nagents\n-\nSNR ∝B0\n-\nBody and instrument noise\neffects sensitivity\n-\nEquipment $$$$\n-\nDetectors small to prevent\nspin cross-talk\n-\nEver growing field"
    },
    {
      "category": "Resource",
      "title": "ryan_lannsumary.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/b00bcab6a531da03252c93bc1baa2f1c_ryan_lannsumary.pdf",
      "content": "Ryan Lanning\n\nMay 17, 2006\nExecutive Summary: Magnetic Particle Imaging - A parallel to MRI\nGleich, B. and Weizenecker, J. Tomographic imaging using the nonlinear response of magnetic particles.\nNature. 435: 1214-1217 (2005).\n\nIn a Letter to the journal Nature, Gleich and Weizenecker propose a novel method for imaging magnetic\nnanoparticles (MNPs) with a high degree of spatial sensitivity. They hypothesized that the nonlinear response\nof certain ferromagnetic materials and their saturation at specific field strengths can form the basis of a\ntomographic imaging modality. In a manner analogous to nuclear magnetic resonance imaging, they proposed\nthat selective saturation of a collection of MNPs in combination with an applied oscillating field allows\ndiscrimination of the MNPs through their time varying magnetization. In an elegant \"proof of principle\"\nexperiment, the authors demonstrated an ability to image a commonly used magnetic tracer (Resovist) in a\nphantom with a high degree of spatial resolution. In their conclusion, they also proposed future directions for\nthe technology to grow into a biomedical imaging technique.\nMagnetic contrast agents have been used with great efficacy in MRI to enhance imaging capabilities.\nHowever, MRI is only sensitive to the intrinsic magnetic signal of tissue (usually protons) and magnetic\ncontrast agents only modify this signal. Techniques have been used to measure the magnetic field intensity of\nMNPs after application of an external applied field. For example, Romanus et al employed\nmagnetorelaxometry to measure and spatially resolve the relaxation of MNPs after application of an applied\nfield. However, this technique lacks appropriate resolution needed in biomedical imaging. Direct measurement\nof the magnetic field of MNPs is possible, but no method to date has been able to demonstrate spatially\nsensitive detection.\nGleich and Weizenecker have overcome this issue by developing a method for spatially selective\nmeasurements of the magnetic field. Ferromagnetic materials have long been known to display hysteresis in\ntheir ensemble magnetization when an external field is applied. Such materials do exhibit a nonlinear response\nwhen magnetized from a zero field value. By applying a time-invariant spatially varying gradient magnetic\nfield of appropriate amplitude to an object containing MNPs, most of the sample is saturated, while a limited\nportion around the zero field point (termed field-free point (FFP) by the authors) is not. These regions respond\nnonlinearly to an applied oscillating magnetic field. This produces a time varying magnetization signal that can\nbe decomposed into higher harmonics of the applied field frequency. By filtering out the base frequency, the\nMNPs can be directly imaged at that point by averaging the remaining harmonics to obtain a signal.\nThere are two fundamental ways for spatial encoding during MPI image acquisition proposed by the\nauthors. The first is that the object can be mechanically moved around the FFP and spatially registered signal\ncollected at each point. The second demonstrates analogy to MRI by proposing that, in addition to the static\nfield, the use of three driving fields that are oscillating at different frequencies allows the FFP to be moved\nthroughout the sample by the fields. In the proof-of-principle experiment, the authors perform two techniques\nby (i.) manually moving the sample with a robot and (ii.) mechanically moving the sample in the horizontal\ndirection while attempting vertical selection by modulating the drive field. The former technique provided a\nhigher resolution, but took longer (18 minutes). The latter was faster (~1 minute), but because of the increased\nmeasurement speed had decreases signal to noise (SNR) and thus lower resolution.\nAccording to the authors' theoretical calculations, the resolution of MPI is directly proportional to the\nratio of the field strength at which MNPs produce significant harmonics and spatial derivative of the gradient\nfield. For this study, the resolution was about 0.3 to 0.5 millimeters as determined by the fields applied. The\nfield of view (FOV) for MPI measurements follows a similar relationship with the minimal field strength\nrequired for nonlinear response replaced by the actual amplitude of the driving field used. Further enhancing\nthe resolution is the large signal of MPI in relation to the background noise. This differs from MRI, where there\nis significant background noise and signal is improved by increasing the static magnetic field strength.\nMPI may prove to be another excellent biomedical imaging technique. It does not measure intrinsic\nsignal e.g. MRI, but it does measure the signal of an applied agent that would permit superb contrast in an in\nvivo imaging setting due to the lack of other confounding signals. Additionally, it uses longer radio frequency\nwavelengths that may permit deeper imaging in tissue. The future is certainly expansive for MPI and it will be\ninteresting to see whether it someday proves an equal to MRI.\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald"
    },
    {
      "category": "Resource",
      "title": "coursenotes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/924c7ccc55e459eccbe0f43d3ebc1a8f_coursenotes.pdf",
      "content": "Magnetic Resonance\n\nHST.584J / 22.561\n\nCompiled and Written By:\nFaith Van Nice 1992, Mark Haig Khachaturian 2002\n\nInstructors: Bruce Rosen M.D., Ph.D.\nLarry Wald Ph.D.\n\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nTABLE OF CONTENTS\n\nAcronyms & Symbols .\n.\n.\n.\n.\n.\n.\n.\nChapter 1: Introduction .\n.\n.\n.\n.\n.\n.\n.\nChapter 2: Basic NMR .\n.\n.\n.\n.\n.\n.\n.\nChapter 3: Relaxation .\n.\n.\n.\n.\n.\n.\n.\nChapter 4: Liquid Spectroscopy .\n.\n.\n.\n.\n.\n.\nChapter 5: Fourier Transform Theorems .\n.\n.\n.\n.\n.\nChapter 6: Introduction to Imaging\n.\n.\n.\n.\n.\n.\nChapter 7: NMR Imaging\n.\n.\n.\n.\n.\n.\n.\nChapter 8: Chemical Shift Imaging\n.\n.\n.\n.\n.\n.\nChapter 9: Flow Imaging\n.\n.\n.\n.\n.\n.\n.\nChapter 10: Microscopic Motions\n.\n.\n.\n.\n.\n.\nChapter 11: Rapid Imaging\n.\n.\n.\n.\n.\n.\n.\n\nACRONYMS & SYMBOLS\n\nNMR - Nuclear Magnetic Resonance\nMRI - Magnetic Resonance Imaging\nμ - Magnetic Dipole Moment\nF{} - Fourier Transform\nTR - Repetition Time\nTE - Echo Time\nTI - Inversion Time\nSTIR - Short TI Inversion Recovery\n\nCHAPTER 1: INTRODUCTION\n\nSubstances respond to magnetic fields in varying degrees. For instance, if we measure the force on a\nmaterial in a magnetic field B, we get the following (B = 1.8 T):\n\nWater\n\n-22 dynes\n\nCu\n\n-2.6 dynes\n\nCuCl2\n\n+280 dynes\n\nInO2\n\n+7500 dynes\n\nFe\n\n+4x105 dynes\n\nMagnetic fields interact with one another, but they also induce magnetism in matter. Force on a magnetic\ndipole\n\ndz\ndB\nF\nμ\n=\n\nμ = magnetic dipole moment (for a current loop,\n; I = current, r = radius of loop).\nI\nr 2\nπ\nμ =\n\nThis helps understand the table above. It implies that in a magnetic field, for most materials,\n\nB\n±\n∝\nμ\n.\n\nThus, as B decreases, dz\ndB decreases, μ decreases, and the force decreases by both terms.\n\nAn applied magnetic field, B, induces a magnetic moment in material, but the direction of the magnetic\nmoment depends on the type of material. For instance, a diamagnetic material (e.g. water) is repelled in\na magnetic field, implying that the direction of μ is opposite that of B. Magnetic fields cause the orbital\nelectrons to speed up or slow down depending on the orientation, or direction of the electron spins. This\ninduces a current (Lenz's Law) such that the magnetic field of the induced current is opposite that of the\napplied field. The resulting magnetic moment, μ, opposes B\n\nμ\nc\nm\nr\nne\ne\nB\n=\n\nwhere n = number of electrons per gram, e is the elementary charge, and me is the mass of the electron.\n(Note: assume cancellation of the average orbital angular momentum).\n\nParamagnetic materials, on the other hand, are attracted to a stronger magnetic field. The magnetic\nmoment aligns with the applied magnetic field (as a compass needle does). Examples of paramagnetic\nmaterials includes atoms or molecules that posses an odd number of electrons so that the total spin of the\nsystem is not zero (e.g. organic free radicals, or nitric oxide, NO). Transition elements such as\nmanganese and gadolinium, and some metals are also paramagnetic.\n\nThe net magnetization, M, (\n)\n∑\n=\nμ\nM\nis a function of the magnetic susceptibility, χ, which is defined\nas\n\nB\nM\n=\nχ\n.\n\nA diamagnetic material has a negative χ, while a paramagnetic material has a positive magnetic\nsusceptibility.\n\nFerromagnetism refers to materials with a spontaneous magnetic moment, such as iron. This suggests\nthat even in zero magnetic field, the electron spins and magnetic moments are arranged in some regular\npattern. We will limit our discussion to diamagnetic and paramagnetic materials in this course.\n\nCHAPTER 2: BASIC NMR\n\nWe will refer to three different magnetic fields in this course:\n\n(1) Bo - large, static field (> 1 Telsa typically; 1 T = 10,000 Gauss)\n(2) B1 - oscillating radio frequency (rf) field (1-100 Gauss)\n(3) μ - magnetic moment of a nucleus (few Gauss)\n\nNuclei with nonzero nuclear spin quantum numbers (e.g. if the nucleus possesses an odd number of\nprotons or neutrons) have angular momentum. Examples are 1H, 13C, 19F, and 31P. The concept of\nnuclear spin is a result of quantum mechanics. We need not worry about the details of this theory, but it\nis helpful to highlight some of the important physical features of a nuclear spin. Since the nucleus is\ncharged and is spinning (or rotating due to angular momentum), it creates a small magnetic field which\nwe call the nuclear magnetic moment. It can be thought of as a tiny bar magnet with north an south\npoles. The ratio of the magnetic moment to the angular momentum, J, is called the gyromagnetic ratio, γ\n(or sometimes the magnetogyric ratio). Each type of nucleus has a unique γ.\n\nI\nJ\nh\nγ\nγ\n=\n=\nμ\nμ\n\nwhere I is the dimensionless angular momentum operator with eigenvalues of the z-component being m =\nI, I - 1, ..., -I.\n\nIf you put some nuclei in a magnetic field, Bo, the interaction energy is\n\nB\n⋅\n= μ\nE\n\nWe define Bo to be along the z-axis and the energy is\n\no\nm\nE\nB\nh\nγ\n=\n\nwhere m is defined above.\n\nProtons have spin quantum number I = 1⁄2 so that energy levels available to the spin system are\no\nB\nE\nh\nγ\n±\n=\nand the energy level difference (or frequently called the resonance frequency) is (allowed\ntransitions are ∆m = ±1)\n\no\nB\nE\nh\nγ\n=\n∆\n.\n\nA sketch of the energy level dependence is show in Figure 1.\n\nNote: slope proportional to γ\nBo\n∆E\n\nE\nn\ne\nr\ng\ny\n\nFigure 1 - Energy Level Dependence of Energy Split vs. Bo\n\nThus, the energy level difference is related to the gyromagnetic ratio and the applied static magnetic field.\nSome gyromagnetic ratios are given below\n\nAtom\nγ (MHz/T)\nγ (rad.MHz/T);\nγ\nπ\nγ\n=\n\n1H (I = 1⁄2)\n42.6\n267.7\n13C (I = 1⁄2)\n10.7\n67.2\n19F (I = 1⁄2)\n40.1\n31P (I = 1⁄2)\n17.2\n\nThe resonance frequency is referred to as the Lamor frequency, ωL (since\nω\nh\n=\n∆E\n)\n\no\nL\nB\nγ\nω =\n.\n\nThis is important because if we want to study the spin system we must use energy at the Lamor frequency\nof the allowed energy transition. For example, in a 1.5 T field, the resonance frequency for protons is\nabout 63 MHz. If we put in energy at 100 MHz, nothing will happen to the system, since photons can\nneither be absorbed nor emitted at this frequency. (A note about frequencies, i.e. in Hz, because it is\neasier to say, and write, than radians/second).\n\nNow, when a spin system (or ensemble of protons) is not in the presence of a large magnetic field, there is\nno preferred orientation of the individual magnetic moments and consequently no net magnetization is\ngenerated. The reason for this is that the magnitude of the magnetic moments and the earth's magnetic\nfield are two small to do any work on the system. On the other hand, when we apply a strong field, we\ncause the magnetic moments to align with or against the direction of the field (parallel or anti-parallel), in\nthe case of protons. The magnetic field is strong enough to put torque on the spins to do the alignment.\nThe spins (or magnetic moments) do not have equal populations in the two states and the result is a net\nmacroscopic magnetization in the direction of the field since it is the lower energy state (Boltzmann's\nlaw). We commonly use arrows to depict a nuclear magnetic moment, since then we can see the\nmagnitude and direction of the moment.\n\n+I\n-I\nSpin = 1⁄2\nBo\n\nE\n\nFigure 2 - Energy Level Splitting in a Magnetic Field\n\nWe can explain the NMR experiment easily using classical mechanics. We begin with the classical\nequation of motion that says that the rate of change of angular momentum of a nuclear dipole depends\nupon the torque exerted on the dipole by the applied magnetic field.\n\nJ\nB\nJ\nγ\n=\n×\n=\n=\nμ\n;\nμ\ndt\nd\nTorque\n\nTaking\nand manipulating the equations above we have that:\n∑\n=\nμ\nM\n\nB\nM\nM\n×\n= γ\ndt\nd\n\nwhere we call M the net macroscopic magnetization for an ensemble.\n\nA cross-product in mathematics is equivalent to a rotation in the physical world. Thus, what is happening\nhere is that the large static magnetic field puts a torque on the magnetic moments and moments process,\nor rotate, around the applied magnetic field (Figure 3). For simplicity, only one magnetic moment is\nshown in 3a. It follows that an ensemble of spins would inscribe a cone as shown in 3b since there would\nbe no phase coherence between individual magnetic moments. A way to think about this process is to\nenvision a gyroscope. You wind up the gyroscope and set it on the floor and it precesses while it spins. It\nis that motion that we are dealing with here.\n\n(a)\ny\nz\nBo\nBo\n(b)\nz\nx\nx\n\ny\n\nFigure 3 - (a) Procession of a Single Magnetic Moment about the z-axis Due to a Static Magnetic Field\nand (b) Procession of a Number of Magnetic Moments Along the z-axis Due to a Static Magnetic Field\n\nWe can expand the cross-product into matrix form. Remember that\nz\ny\nx\nkM\njM\niM\n+\n+\n=\nM\nand same\nfor B.\n\n(\n)\n(\n)\n(\n)\nx\ny\ny\nx\nz\nx\nx\nz\ny\nz\nz\ny\nz\ny\nx\nz\ny\nx\nB\nM\nB\nM\nk\nB\nM\nB\nM\nj\nB\nM\nB\nM\ni\ndt\nd\nB\nB\nB\nM\nM\nM\nk\nj\ni\ndt\nd\n-\n+\n-\n+\n-\n=\n⎟\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎜\n⎝\n⎛\n=\n×\n=\nM\nB\nM\nM\ndet\nγ\nγ\n\nThis an equivalent form of\n\ndt\ndM\nk\ndt\ndM\nj\ndt\ndM\ni\ndt\nd\nz\ny\nx\n+\n+\n=\nM\n\nWe can break the equation into its pieces and show the time dependence of the motion for each\ncomponent of M. First define the components of the magnetic field, B.\n\nB\nB\nB\n+\n=\no\n= static + oscillating\n\nWe can create a B1 field (oscillating rf field that produces a small magnetic field in a specified direction)\nthat rotates in the x-y plane at a frequency ω. Then\n\n(\n)\n(\n)\no\nz\ny\nx\nB\nB\nt\nB\nB\nt\nB\nB\n=\n=\n=\nω\nω\nsin\ncos\n\nSubstitute these into the components of dM/dt and see that:\n\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n) (\n)\ncos\nsin\ncos\nsin\nT\nM\nM\nt\nB\nM\nt\nB\nM\ndt\ndM\nT\nM\nB\nM\nt\nB\nM\ndt\ndM\nT\nM\nt\nB\nM\nB\nM\ndt\ndM\no\nz\ny\nx\nz\ny\no\nx\nz\ny\nx\nz\no\ny\nx\n-\n-\n+\n-\n=\n-\n-\n=\n-\n+\n=\nω\nω\nγ\nω\nγ\nω\nγ\n\nNote that I have added in the relaxation terms from a phenomenological standpoint. The x and y\ncomponents of M must go to zero and I have arbitrarily given the time constant for that process T2. On\nthe other hand, Mz must return to the equilibrium magnetization which we call Mo or Meq and I have that\nthat time the constant value T1. Note that at equilibrium, Mz = Mo. These equations are formally called\nthe Bloch equations after Felix Bloch.\n\nUp to this point we have described the system in the laboratory frame of reference. As we will see\nlater, it is much easier conceptually to work in a different reference frame called the rotating frame. It is\nquite simple. Imagine grabbing hold of the z-axis of the system in Figure 3b and spinning the x-y plane at\nthe Larmor frequency of the system. Think of it like this: the laboratory frame is like watching a record\nturn on a turntable, while the rotating frame is like standing on the record itself and rotating with it - now\nyou are able to read the songs on the label without getting dizzy! If we do this to our ensemble of nuclei,\nwe can add up the vector components of the magnetic moment and see that the x and y components\ncancel each other, while the z-components add (Figure 4).\n\nLaboratory\n\nRotating\nBo\nx\nz\n(b)\ny\nBo\nMz\n(a)\nz\nx\n\ny\n\nFigure 4- Illustration of the Magnetic Moments in the (a) Laboratory and (b) Rotating Frame\n\nNow we must derive the equations of motion for the components of M in the rotating frame. The total\ntime derivative of M is given by\n\nt\nk\nM\nt\nj\nM\nt\ni\nM\ndt\ndM\nk\ndt\ndM\nj\ndt\ndM\ni\ndt\nd\nz\ny\nx\nz\ny\nx\n∂\n∂\n+\n∂\n∂\n+\n∂\n∂\n+\n+\n+\n=\nM\n\nThe unit vectors i, j, k rotate in the rotating frame, but cannot change length. As we have seen before, a\nrotation is a cross-product in mathematics. Thus,\n\nk\nt\nk\nj\nt\nj\ni\nt\ni\n×\n=\n∂\n∂\n×\n=\n∂\n∂\n×\n=\n∂\n∂\nω\nω\nω\n\nIf we substitute this into the total time derivative, we get\n\n(\n)\nM\nM\nM\nM\n×\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\n=\n+\n+\n×\n+\n∂\n∂\n=\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\nω\nω\nrotating\nz\ny\nx\nfixed\nt\nk\nM\nj\nM\ni\nM\nt\ndt\nd\n\nWe know that the left hand side is equal to\nB\nM ×\nγ\n. Rearranging and substituting\n\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n×\n=\n×\n-\n×\n=\n×\n-\n×\n=\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\nγ\nω\nγ\nγ\nω\nγ\nγ\nω\nγ\nB\nM\nM\nB\nM\nM\nB\nM\nM\nrotating\nt\n\nWe call B + ω/γ the effective magnetic field, or Beff. It is apparent then that the magnetization precesses\naround the effective field in the rotating frame just as the magnetic moments precess around the applied\nmagnetic field in the laboratory frame.\n\nLet's look at the limiting case and see if the total time derivative makes sense with our situation in the\nrotating frame. If the frequency of the rotating frame equals the frequency of precession\n(\no\nprecession\nrotating\nB\nγ\nω\nω\n-\n=\n=\n), then\n\n=\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\nrotating\nt\nM\n\nThus, if the frame of reference rotates at the Larmor frequency, the magnetization is static in the rotating\nframe, which is what we see in Figure 4b. This simplifies the problem immensely as we try to envision\nthe NMR experiment. For those of you who are still uncomfortable with the idea of the rotating frame,\nremember that we live in a rotating frame. The earth spins on its axis and precesses around the sun. If\nyou throw a ball in the air, it is a simple problem to describe its trajectory while on earth, but it would be\nquite a difficult proposition to describe it if you were in outer space.\n\nIf we want information about the characteristics of any physical system, we must perturb the system from\nequilibrium and then measure the energy that is emitted from the system as it returns to equilibrium. In\nour case, we want to study the magnetization generated by the nuclear spin system in a large static\nmagnetic field. We must figure out a way to perturb the net magnetization away from equilibrium, or the\nz-axis. We can do this by using another magnetic field, B1. Define\n\n(\n)\n(\n)\n)\n(\nsin\ncos\no\no\nrot\no\nlab\nat\nrotating\ni\nk\nj\nt\ni\nt\nω\nω\nω\nB\nB\nB\nB\nB\nB\nB\n+\n=\n-\n+\n=\n\nwhere we choose only one of the rotating components of the B1 field (along the x-axis). This gives\n\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n×\n=\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\nB\nB\nM\nM\nγ\nω\nγ\no\nrotating\nt\n\nIf B1 is rotating at the Larmor frequency, or\no\nB\nγ\n-\n(in the opposite direction), then\n\nB\nM\nM\n×\n=\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n∂\n∂\nγ\nrotating\nt\n\nThis shows that if we apply an oscillating field, B1, at the Larmor frequency, the magnetization will rotate\nabout the x-axis at\nB\nγ\nω =\n. (Note: it turns out to be in the clockwise direction about the x-axis. Use the\nleft hand rule and let your thumb be the x-axis). This action tilts the magnetization off the z-axis, i.e.\naway from equilibrium. Figure 5 summarizes the basic process. We generate a B1 field using a radio\nfrequency transmitter and a tuned resonant circuit (Figure 6) where the power is delivered to a solenoid\ncoil (where the sample resides) in a pulse fashion. The amount of precession, θ, of the magnetization\nabout B1 depends on the magnitude (power) of the applied field and the duration of the pulse, t.\n\nt\nB\nγ\nθ =\n\nB1\ny\n(a)\nz\nBo\nz\nRF Pulse\nω = ωL\n(b)\nMy\nMz\nBo\nx\nx\n\ny\n\nFigure 5 - Motion of the Net Magnetization After a 90o RF Pulse\n\nRF Pulse From\nTransmitter\nSolenoid Coil\nfor Sample\n\nFigure 6 - Common NRM Probe Circuit\n\nBefore going on, let us explore the other avenue of applying a B1 field that off resonance, i.e. if\no\nrf\nB\n=\nγ\nω\n. Then\n\no\nrf\nrf\no\neff\ni\nk\nB\nB\nB\nB\nB\n-\n+\n=\n+\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n=\nγ\nω\nγ\nω\n\nFigure 7 shows the magnetization precessing around the effective magnetic field as opposed to precessing\nin the y-z plane when we are on resonance (Figure 5). When ωrf is well below resonance, the effective\nfield is parallel to Bo. As ωrf approaches resonance, the effective field is perpendicular to Bo and finally,\nwhen ωrf continues above resonance, the Beff is anti-parallel to Bo.\n\nAn interesting note: In the \"old\" days of NMR before Fourier transforms and pulse spectroscopy, the\nexperiment was done in \"cw\" of continuous wave mode. This was done by either varying the frequency\nof the transmitter, or by varying Bo. The latter turned out to be technically easier at the time. In the\nadiabatic slow passage experiment, the magnetization follows the effective field (i.e. continues to align\nwith it) as long as the change in ωrf is much less than the Larmor frequency. That is what is meant by\nslow passage. In this way one could manipulate the magnetization and study the chemical environment of\nthe spin system. These days virtually all NMR spectroscopy is done using the pulse technique followed\nby a Fourier transform, but it is important to understand the effective field concept because it is a\ncommon to conduct pulse experiments off resonance. This complicates where the magnetization ends up\nafter a pulse and one cannot assume perfect 90o or 180o rotations of the magnetization. This is true the\nfarther off resonance the transmitter frequency is (for small differences in frequency, the effect is\nnegligible).\n\nFigure 7 - Precession About the Effective Field\nB1\nM\ny\nBeff\nBo\nz\nBeff\ny\nBo\nBo - ω/γ\nz\n\nNow we are ready to examine what happens after the radio frequency (rf) pulse is applied and we have\nrotated the magnetization to the y-axis shown in Figure 5 (assuming resonance conditions). We know\n\nfrom Thermodynamics that the system will return to thermal equilibrium. The spin system does this\nthrough two types of relaxation processes: longitudinal and transverse relaxation. The time constants\ncharacterizing these processes are T1 and T2, respectively. Longitudinal relaxation is the return of the z-\ncomponent of the magnetization to the equilibrium value, Mo (Figure 8). Following the rf pulse, the z-\ncomponent of M is zero. As time elapses, Mz increases exponentially until the equilibrium value is\nrestored.\n\n( )\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n-\nT\nt\no\nz\ne\nM\nt\nM\n\nTransverse relaxation involves the dephasing of the magnetization in the x-y plane (Figure 9). The reason\nfor this type of dephasing is that the absolute magnitude of the magnetic field is not identical at each\nnucleus, causing each nucleus to precess at a slightly different frequency than its neighbor. We actually\ndifferentiate between the causes of this net loss of coherence into two groups. The time constant T2 is\nused when describing the transverse relaxation due to processes intrinsic to the sample, for example, the\ndipolar interaction among magnetic moments (discussed in detail later). On the other hand, there are\ncauses of transverse relaxation that are the result of experimental error, such as the impossible task of\ncreating a Bo field that is absolutely perfect at each point in the sample. This type of relaxation due to\ninhomogeneities in the experimental environment is given the time constant T2\n*. At any rate, the\ndephasing of the x-y components of M cause the generation of tiny current in the sample coil (refer to\nFigure 6) and the result is a free induction decay (FID). The FID is detected with an oscilloscope as a\nfluctuating voltage (Figure 10). This means that after the rf pulse, Mx and My will have the same\namplitude as Mo and then decay exponentially to zero with time constant T2*.\n\n( )\n*\n,\nT\nt\no\ny\nx\ne\nM\nt\nM\n-\n=\n\n(Note: the FID shown in Figure 10 is a damped cosine wave which means that the transmitter frequency\nwas slightly off resonance - the oscillations (or beats) are the protons going in and out of phase with the\ncarrier frequency. If the transmitter were exactly on resonance, we would get a smooth exponential\nwithout oscillations).\n\nBo\nBo\nz\ny\nz\ny\nMy\nτ\n\n2τ\n\nz\nz\n\nBo\ny\n3τ\ny\nMz\nBo\n\nFigure 8 - Longitudinal Relaxation (τ is a time interval)\n\nBo\ny\nz\n5T2\nBo\nz\ny\nx\nMy\nMx = My = 0\nx\n\nFigure 9 - Transverse Relaxation\n\nSignal\nAmplitude\n(Voltage)\nMo\nTime\n\nFigure 10 - Signal FID with Decay Envelop\n\nIn order to visualize the traverse and longitudinal relaxation, the Bloch equations were solved and Figure\n10b shows the path of the net magnetic moment, M, position as a function of time.\n\n-1\n-1\n-0.5\n0.5\n1.1\n1.2\n1.3\n1.4\n-1\n-1\n-0.5\n0.5\n\nFigure 10b - Path of Net Magnetization Under Both Transverse and Longitudinal Relaxation\n\nLet us estimate the approximate signal amplitude for a 1 cm3 sample of water in a solenoid consisting of\nN = 10 turns and surface area (A) of 1 cm2. The magnetic flux caused by the relaxing nuclei in a 1 T field\nis on the order of 4x10-10 T (remember (M = χB). The voltage induced in the coil is given by\n\n(\n)t\nNAM\nemf\nω\nωsin\n=\n\nwhich gives an answer on the order of 1 mV. We can see that the signal voltage is proportional to ω2 (the\nother ω comes from M). Noise is trickier to evaluate. The amplitude of noise goes anywhere from the\nfourth root of ω for small samples to ω for large samples. Thus the signal to noise ratio is proportional to\nω in the range of ω to ω7/4. The important point here is that the signal in NMR spectroscopy at room\ntemperature is quite small.\n\nWe are now at the point where we have collected the FID, which is a time domain signal. It is difficult to\nextract information about the system in the time domain and we are often more interested in the frequency\ncomponents of the signal. We use the Fourier transform (FT) to give us this information\n\n( )\n( )\n( )\n( )\n∫\n∫\ninf\ninf\n-\n-\ninf\ninf\n-\n=\n=\ndt\ne\nt\nA\nA\nand\nd\ne\nA\nt\nA\nt\ni\nt\ni\nω\nω\nπ\nω\nω\nω\nπ\n\nwhere A(t) is the signal function and A(ω). Conversely, A(t) is the inverse FT (or FT-1) of A(ω). Figure\n11 shows the FT of an FID obtained from a pure water sample. The FT of an exponential is a Lorentzian\nlineshape. Note that one peak is the result as all the protons in water are essentially equal. Also, the peak\nis shifted slightly (∆ω) since the transmitter frequency was off resonance (thus giving beats in the FID).\nThe width of the peak at half height approximates 1/T2\n*. Later we will see that NMR and the Fourier\ntransformed spectrum does an excellent job at distinguishing between different types of protons contained\nwithin a molecule.\n\nTime\nSignal\nAmplitude\n(Voltage)\nFT\nM\n1/T2\n*\nω\nω + ∆ω\n\nCHAPTER 3: RELAXATION\n\nIt is helpful to examine the longitudinal and transverse relaxation in more detail and understand some of\nthe fundamental processes that give rise to relaxation. In NMR spectroscopy, relaxation back to thermal\nequilibrium is caused by fluctuating local magnetic fields. The term \"local\" refers to the immediate\nenvironment of a nucleus. Since nuclear spins are essentially tiny bar magnets, there exist certain\ninteractions between them. We have all played with bar magnets and felt the forces when two are brought\ntogether - this is analogous to the dipolar interaction between magnetic moments, or dipoles. Molecules\nare continually moving (i.e. translating, rotating, and vibrating) and these motions modulate the\ninteractions among the nuclei. In other words, the molecular motions cause the local magnetic fields to\nfluctuate and allow the nuclear spins to relax via some well known interaction, like the dipolar interaction,\nwhich is most important in spin = 1⁄2 systems. Other interactions can be the basis for relaxation such as\nthe electric quadropole, chemical shift anisotropy, scalar coupling, and spin-rotation interactions. The\neffectiveness of the relaxation as measured by the relaxation time depends on the magnitude of the\ninteraction, i.e. for large interactions, the relaxation is generally faster.\n\nConsider a water molecule with protons 1 and 2 in a static magnetic field Bo (Figure 12). The total\nmagnetic field at proton 1 is due not only to the static field, but also the local field created by the presence\nof proton 2. The local field due to the dipolar interaction is\n\n(\n)\ncos\nr\nbloc\n-\n=\nθ\nμ\n\nwhere r12 is the distance between the two spins, θ is the angle between r12 and the direction of the static\nfield, Bo, μ2 is the magnetic moment of proton 2. We can see that certain variables change when the\nwater molecules moves, thus causing the local field to fluctuate. The angle θ changes when the molecule\nrotates or translates, while r12 varies as the molecule vibrates.\n\nθ\nBo\n\nFigure 12 - The dipolar interaction and the local magnetic field.\n\nIn order to understand the dynamics of the relaxation process due to local field fluctuations, we must\nreturn to the original equation of motion for magnetization in a magnetic field. Instead of looking at the\neffect of the Bo and B1 fields, let us define the components of the local magnetic field as bx, by, and bz.\nWe get\n\n(\n)\n(\n)\n(\n)\nx\ny\ny\nx\nz\nz\nx\nx\nz\ny\ny\nz\nz\ny\nx\nb\nM\nb\nM\ndt\nd\nb\nM\nb\nM\ndt\nd\nb\nM\nb\nM\ndt\nd\ndt\nd\n-\n=\n-\n=\n-\n=\n×\n=\nγ\nγ\nγ\nγ\nM\nM\nM\nb\nM\nM\n\nThese equations tell use something very important. First, the change in the z-component of the\nmagnetization is unaffected by the z-component of the local field bz. This means that bz has no effect on\nT1 since T1 relaxation is described by dt\nd\nz\nM\n. Similarly, we can see that all three components of the local\nfield affect the change in Mx and My, or the transverse relaxation. Go back to the laboratory and rotating\nreference frames and compare the components of the local field. Remember that in the rotating frame, the\nstatic components are rotating at the Larmor frequency. The z-component of the local field is stationary\nin both frames, since in the rotating frame, we are rotating about the z-axis, and in the lab frame, the\nsystem precesses about the z-axis. One the other hand, we know that bx and by are stationary in the\nrotating frame, which means they must be rotating at the Larmor frequency in the lab frame. All this is\nsaying is that bx and by signify fast dynamic processes, while bz, being stationary, signifies slow dynamic\nprocesses. Since T1 depends only on bx and by, it is affected only by fast molecular motions, while T2 is\naffected by both fast and slow molecular motions. This is an important difference between T1 and T2,\ncausing T2 always to be equal to or shorter than T1. You should be able to convince yourself of this last\nfact simply by using a vector diagram. Later, when we learn about spectral density functions and\nmolecular correlation times, it will hopefully become more clear.\n\nWe have seen that when we put a spin system (I = 1⁄2) in a static magnetic field, the magnetic moments go\nfrom a state of random orientation with no net magnetization, to a more ordered state where there are two\ndistinct energy levels, parallel and anti-parallel to the direction of the static field. In order for this thermal\nequilibrium to be established, energy must be transferred from the spin system to the surrounding, or\nlattice. In the jargon of NMR, we say that a common temperature is established. A universal condition\nfor energy difference for the spin system is\no\nB\nh\nγ\n. In the lattice, many energy levels are available and\nbecause there are so many degrees of freedom, we assume a proper energy level exists for energy transfer.\nFurthermore, since the surroundings at room temperature have essentially infinite heat capacity, we\nassume that the temperature remains constant. This means that the spin system \"cools\" to the lattice\ntemperature and a population difference between the spin energy levels is established, thus generating a\nmacroscopic net magnetization. Figure 13 summarizes the energy transfer process. It shows a spin\nenergy level | 1 > \"flipping\" down to energy level | 2 >, while the lattice accepts the quantum of energy\nand goes from energy level | b > to | a >. This is the only allowed transition.\n\n∆Espins\n∆Elattice\nSpins Lattice\n| 1 >\n\n| a >\n| b >\n\n| 2 >\n\nFigure 13 - Spin-Lattice Energy Transfer\n\nRequiring the energy levels to match is synonymous ith saying that the frequencies must be equal. It\non, a\net us describe an entire system soaking in a static magnetic field. Define the four populations: the spin\n\nw\nfollows, then, that some molecular motion on the time scale of the Larmor frequency must exist for\nrelaxation, or the establishment or thermal equilibrium, to occur. Thermal equilibrium is, by definiti\nstate whereby dynamic processes are happening (i.e. \"spin-flips\"), but the net energy change is always\nzero.\n\nL\nsystem will have populations n1 and n2, while the lattice will be Na and Nb. The number of transitions per\nsecond is\n\na\nb\nbW\nN\nn\ns\nTransition\nsec\n/\n→\n=\n\nhere W1bÆ2a is the rate of transition from states | 1 > and | b > to states | 2 > and | a >, as shown in Figure\nw\n13. Define the spin system populations as\n\n.\nn\nn\nN\nPop\nTotal\nn\nn\nn\ndifference\nPop\n+\n=\n=\n-\n=\n=\n\nand the corresponding transition rates (\"up\" and \"dow\nce to the spin system with the\n\nThe change is the spin population difference, n, is the number of transitions per second minus those up, or\nn\" are with referen\nassumption that the lattice does the opposite) are\n\na\nb\nb\nb\na\na\nW\nN\nW\nDown\nRate\nW\nN\nW\nUp\nRate\n→\n→\n↓=\n=\n↑=\n=\n\n↑\n-\n↓\n=\nW\nn\nW\nn\ndt\ndn\n\nNote that dn/dt is zero at thermal equilibrium. Substitute\n\n(\n)\nN\nn\nn\n+\n= 2\nand\n(\n)\nn\nN\nn\n-\n= 2\n\nto obtain\n\n(\n)\n(\n)\n↑\n+\n↓\n-\n↑\n-\n↓\n=\nW\nW\nn\nW\nW\nN\ndt\ndn\n\nWe define the equilibrium population difference, no, as\n\n⎥⎦\n⎤\n⎢⎣\n⎡\n↓\nW\n↑\n+\n↓\n↑\n-\n=\nW\nW\nW\nN\nno\n\nand substitute this into dn/dt to arrive at the equation for the rate of change of the population difference\n\n1T\nn\nn\ndn\no\ndt\n-\n=\n\nwhere we define the rate =\n↑\n+\n↓\n=\n=\nW\nW\nT\nR\n. The solution for the above differential equation is the\n\nfamiliar result\n( )\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n-\nT\nt\no\ne\nn\nt\nn\n\nas we have seen this for the relaxation of the z-component of the net magnetization, or T1 relaxation.\n\nllowing a Boltzman distribution\nAt thermal equilibrium, the rate up equals the rate down and we get a ratio of the two spin populations\nfo\n\nkT\nkT\nE\no\ne\ne\nn\nn\nB\nh\nγ\n-\n∆\n-\n=\n=\n\nFrom the Boltzman distribution, we can see that it is possible to alter the ratio of the spin populations.\nThe ratio decreases (n2 increases) as Bo increases, or the temperature decreases. This allows for a greater\nn\n\norrelation function and its corresponding correlation time. The correlation function describes the\ncan be\nnet magnetization and hence, better signal to noise. This is why the field of NMR spectroscopy has see\nthe development of very high magnetic fields (10 to 15 T can be standard) and the systems that can cool\nthe sample to the millikelvin region (obviously not suitable when the sample is a human being!).\n\nThe next item to study in more detail is molecular motions. We need to introduce the concept of a\nc\naverage behavior of a molecular motion in a system. Most correlation functions (for our purposes)\napproximated by an exponential function\n\n( )\nC\nAe\nG\nτ\nτ\nτ\n-\n=\n\nand thus have a characteristic time scale defined by the correlation time τc. Go back to Figure 12 and\nthink about the rotating and vibrating water molecule. The molecule rotates at some frequency, but not at\n\nthe same frequency all the time because it is also busy vibrating, translating and colliding with other\nmolecules. What we mean by the correlation time for the rotational motion, is that time necessary for the\nmolecule to rotate in order to change the angle θ, appreciably. Similarly for the vibrational correlatio\ntime - it is the time interval in which r\nn\notion, we are\noking for the frequency range. It is no surprise that the rate is equal to the Fourier transform of the\nf\n12 will change appreciable due to the vibrations.\n\nThe correlation function is a time domain function and if we wish to know that rate of m\nlo\ncorrelation function. We call the resulting function the spectral density function, J(ω). It is the range o\nfrequencies at which the motion exists.\n\n( )\n( )\n( )\n( )\n∫\n∫\ninf\ninf\n-\n-\ninf\ninf\n-\n-\n=\n=\nω\nω\nπ\nτ\nτ\nτ\nω\nωτ\nωτ\nd\ne\nJ\nG\nd\ne\nG\nJ\ni\ni\n\nLet us assume we have a random step function with amplitude, A (Figure 14)\n\nFigure 14 - A Random Step Function Process With Amplitude A.\n\nτ\n\nTime\nA\n\nWe can assume that\ntten as\n\nthe correlation function for the motion is an exponential and is wri\n( )\nc\ne\nA\nG\nτ\nτ\n-\nτ =\n\nSolve for the spectral density function\n\n( )\nc\nc\ni\nA\nd\ne\ne\nA\nJ\nc\nτ\nω\nτ\nτ\nω\nωτ\nτ\nτ\n+\n∝\n= ∫\ninf\ninf\n-\n-\n-\n\nThe spectral density function tells us that for a motion described by an exponential, the spectral density\nmaximum occurs when\nω\nτ\n=\nc\n. This is yet another way of stating that efficient relaxation in NMR\noccurs when a motion has frequency components at the Larmor frequency.\n\nWe can experimentally vary the correlation times that give rise to relaxation. An approach to increase th\ncorrelation time (i.e. slow\nystem) is to increase the viscosity of a solution by lowering the\ntemperature. Conversely\ned up the system (lower the correlation time), we can increase the\ntemperature. This obviously causes the molecules to move faster. It is impo\nltering the temperature of the system, we only alter the frequency distributi\ne\ndown the s\n, to spe\nrtant to realize that up\non of the motions, not the\nFigure 15 - Correlation and Spectral Density Functions\na\ntotal power available for molecular motions. This means that the area under the spectral density curve\nremains constant (Figure 15).\n\nτ\nω\nG(τ)\nJ(ω)\n\ns was mentioned previously, many interactions exist that the molecular motions could modulate and\nause T1 and T2 relaxation. The primary interaction responsible for relaxation in proton systems is t\nipolar interaction. The dipolar Hamiltonian gives us an idea as to the magnitude of the interaction. We\nave seen part of it befor\n\nA\nc\nhe\nd\nh\ne, but here is the entire equation\n(\n)\nF\nE\nD\nC\nB\nA\nr\nh\nH dipolar\n+\n+\n+\n+\n+\n=\nˆ\nγ\nγ\n\nhere the letter are mostly orientationally dependent term\nw\nU\ns like we have seen before (i.e.\n).\nsing the dipolar interaction, we can derive expressions for the relaxation rates (the particulars here are\nnot important, just the result)\n\ncos\n-\nθ\n(\n)\n(\n)\n[\n]\n( )\n(\n)\n(\n)\n[\n]\no\no\no\no\nJ\nJ\nr\nT\nR\nω\nω\n+\n∝\n=\n\nJ\nJ\nJ\nr\nT\nR\nω\nω\nγ\nγ\n+\n+\n∝\n=\n\nwhere the spectral density functions indicate the magnitude of the frequency component at the specified\nfrequency. This shows that T1 relaxation depends on frequency components at the Larmor frequency and\ntwice the Larmor frequency (a higher order term that is much smaller than the first one), or fast dynamic\nprocesses. T2 relaxation has the same terms with the addition of a zero frequency term, corresponding to\nthe slow dynamic processes. The addition of this term automatically makes T2 equal to or less than T1.\nfaster\nslower\nfaster (short τc)\nslower (long τc)\nc\nτ\nω\n=\n\nThis relates back to the Bloch equations where we sa that T relaxation depended on all three\nthus\nchanges more than T2 if we\nary B (unless we stay in the flat part of the curve). Later on we will see that T and T govern the\ns\ns.\nw\ncomponents of the local field, while T1 relaxation depended on bx and by.\n\nWe can look at the spectral density function in Figure 15 and anticipate the effect of changing the static\nmagnetic field on the relaxation rates. On the middle curve, a point where the relaxation rate is most\nefficient is shown. If we have a static magnetic field such that the Larmor frequency is at that point, we\nwill have the fastest relaxation. If we go to the right of that point, the spectral density falls off ,\nmaking the relaxation slower. If we continue this exercise, we find that T1\nv\no\ncontrast obtained in an NMR image. It is important to realize that images obtained on different machine\nwill look the same only if the magnetic fields are identical.\n\nFor completeness, a rough idea of the magnitude of the other interactions among spins is given.\nParamagnetic interactions become important when molecules have unpaired electrons. The dominating\nfactor in the relaxation rate is the γ for an electron which his 1000 times greater than that for a nucleu\n\n6r\nrate ∝\n\nc\n\n2's and T1's. The chemical shift anisotropy interaction arises when the Larmor frequency changes\nwith the orientation of the molecule relative to Bo. The next interaction is scalar relaxation which occurs\nin systems with different nuclei, such as 1H and 13C. In these systems, each type of spin has its own\nenergy levels and relaxation mechanisms, but one re\ncausing a local field\nT2.\ne can\nhe\nthe experiment, a 90 and a 180 . Figure 16 shows that after the 90 pulse, the spins are\nllowed to diphase in the x-y plane. They diphase because each spin precesses at a slightly different\n\nd.\nnce\nse\nelectron\nnucleusγ\nγ\n\nThe quadrupolar interaction is important for nuclei with spin > 1⁄2. It is an interaction between the electri\nields generated at the nucleus due to nuclear anisotropies. It is a quite large interaction resulting in very\nf\nfast T\nlaxing can affect the other by\nfluctuation. As you can imagine, this is an extremely small effect. The final interaction is the spin-\nrotation interaction where the rotation of the molecule and the electronic distribution couple to cause a\nfluctuating local field at the nucleus. In summary, relaxation occurs by any of the above possible\nmechanisms, but we tend to simplify the problem and concentrate on the dominate process, the dipolar\ninteraction.\n\nThe last part of this section deals with the measurement of the relaxation times. We will begin with\nWe saw that the FID decayed with the time constant T2* because of inhomogeneities in the magnetic\nfields. We can minimize this effect by shimming the static field and causing T2* to approach T2. W\nalso do a tricky experiment called the spin echo that capitalizes on the static inhomogeneities. We use t\ntwo pulses in\no\no\no\na\nfrequency due to magnetic field inhomogeneities (static) and local field fluctuations (dynamic) intrinsic to\nthe spins. Thus, some spins go faster than the Larmor frequency, while others go slower and get behin\nWe let the spins diphase for some time τ and then apply a 180o pulse. At τ seconds after the 180o pulse,\nthe spin system refocuses along the -y axis. The effect of the 180o pulse is to put the slow spins ahead of\nthe fast ones and then the fast ones and then the fast ones catch up and the magnetization refocuses. Si\nthere is nothing to keep the spins in phase, they dephase again. This rephrasing and dephasing gives ri\nto what is called an echo - it is essentially a back to back FID. An analogy to this process goes as\nfollows. You are a runner in a road race and everyone is lining up at the starting line. The gun goes off\nand the race begins. Now, there are fast people and slow people, and pretty soon runners are distributed\nalong the race course. Let the race proceed for one minute, freeze the runners, and then flip them 180o so\nthat the fast ones are behind the slow ones. Now start the race again and after one minute everyone is at\nthe starting line. The runners keep going and again become distributed along the course.\n\nFigure 16 - The Spin Echo Experiment\n\no\nho\nthat the echo is formed on the y axis. Re\nThe way we write a pulse sequence like the spin ech is shown in Figure 17, along with the resulting\nsignal echo. Note that the polarity of the FID and ec\nsignals depends on the phases of the 90o and 180o\npulses (which direction B1 field points) and the type of receiver in the spectrometer. In the above\nexample, the echo rephrases along the -y axis and would give us an upside down echo. In Figure 17, I\nhave phase shifted 180o pulse so\nmember, the magnetization\nrotates around the axis of the rf field according to the left hand rule.\nn Echo Sequence. Note phase of 180\n\nFigure 17 - Spi\no\n\nx\ny\nz\nBo\nB1\nMo\n90x\nMy\nτ\nfast\nslow\n180x\nfast\nslow\nτ\n-My\n90x 180y\nFID\nEcho\nτ\nτ\n\nYou can see in Figure 17 that the amplitude of the echo is less than that of the FID. If we did a series of\nxperiments where we increased τ each time, we would see a gradual decline in the echo amplitude. In\nct it decays as an exponential, with a time constant T . This is exactly how we measure the intrinsic T2\nrelaxation time. In the sp\ninhomogeneities is\nrefocused, thereby leaving the dephasing done by dynamic inhomogeneities. Instead of doing several\n\ne\nfa\nin echo experiment, only the dephasing due to the static\nexperiments where we vary τ, we can do the entire experiment in one shot. All we do is to keep repeating\nthe 180o pulse (90x - τ - 180x - τ - 180x - τ ...). Figure 18 shows the resulting echo train. If we plot the\nabsolute values of the echo amplitudes, we could extract T2 by the equation\n\n( )\n,\nT\nt\no\ny\nx\ne\nM\nt\nM\n-\n=\n\nFigure 18 - Spin Echo Train\nMo\nSignal\n2τ 4τ 6τ 8τ 10τ 12τ 14τ 16τ\n\nhere are two basic experiments for measuring T1. One is called saturation recovery and the other is\nversion recovery. The\no pulses which\nliminates all components of\nwith time\nconstant T1. We can do a series of exp\ne system, wait τ seconds, and then\napply a 90o pulse and collect the FID. As τ gets long r, the amplitude of the FID begins to approach Mo.\nd\noint\nT\nin\nfirst involves saturating the spin system with a series of 90\nM. The magnetization then returns to its equilibrium value\ne\neriments where we saturate th\ne\nRefer back to Figure 8 for a vector diagram of the process. We have seen relaxation equation before an\nFigure 19 shows the plot of signal amplitudes (by plotting the signal amplitudes we mean the initial p\nof the FID).\n\n( )\n(\n)\n/\nT\nt\no\nz\ne\nM\nt\nM\n-\n-\n=\n\nMo\nFID\nAmplitude\nt\nτ 2τ 3τ 4τ 5τ\n\nFigure 19 - Saturation Recovery\n\nhe inversion recover pulse sequence contains a 180o pulse, a wait of some time τ, followed by a 90o\nulse. The phase of the rf pulses is not important in this experiment. Since we begin with an inversion of\ne magnetization we measure the recovery from -M to M , thus doubling the dynamic range which\nreduces experimental error (Figure 2\n\nT\np\nth\no\no\n0). The relaxation equation is\n( )\n(\n)\n/\nT\nt\no\nz\ne\nM\nt\nM\n-\n-\n=\n\nMo\n\nFID\nAmplitude\nt\nτ 2τ 3τ 4τ 5τ\n\nCHAPTER 4: LIQUID SPECTROSCOPY\n\nThe most important application of NMR spectroscopy is in the field of organic chemistry. It is one of the\nmost powerful tools used in molecular structure determination and has allowed the field to advance at\nlightening speed. The reason for this is that NMR is exquisitely sensitive to the atomic environment in a\nmolecule in the liquid state, or a compound dissolved in some solvent. The resonances in a spectrum\nreflect subtle differences (i.e. a few hertz) in the environment of the protons in a molecule. Using a few\nrules, we can come to a basic understanding of how these spectra are interpreted, and explore other types\nof experiments that are useful in liquid spectroscopy.\n\nFirst let us begin with the information contained in a resonance line. Remember the line is obtained\nthrough a FT of the FID. The resonance line reflects whatever relaxation mechanism is used by the\nsystem to cause T2 relaxation. In solids, the dominant process involves the dipolar interaction which goes\nas\nr\nγ\n, and thus can give us information about the distance between interacting dipoles. Another\nimportant relaxation mechanism in solids and less mobile molecules is the chemical shift anisotropy.\nThese interactions cause the width of the line to be quite large - on the order of several kilohertz. Any\nsmaller interactions are \"covered up\" and consequently lost. Liquids, on the other hand, contain mobile\nmolecules which cause an averaging of any orientationally dependent interactions and a remarkable\nnarrowing of the resonance lines. This is formally called motional narrowing.\n\nLet us compare the NMR spectrum of ice and water. A typical line width for a sample of ice can be\nestimated at\n\n(\n)\nsec\n/\nradians\nT\no\n≈\n∝\n∆ω\n\nT2 can be defined as the time in which an individual spin dephases by one radian due to a perturbation, Bi\nor synonymously,\n(\n)o\ni\nω\nγ\n∆\n≈\nB\nis the local frequency deviation due to the perturbation, Bi. Assume the\nperturbation, Bi is due to the dipolar interaction. If the molecules are moving rapidly (short τc), then Bi\nseen by a given spin fluctuates rapidly in time. In time τ, the spin will precess an extra phase angle, ∆φ\nrelative to steady precession in Bo. Note this is no different than applying a B1 field and having the\nmagnetization precess around it.\n\n(\n)o\ni\nω\nτ\nγ\nφ\n∆\n=\n±\n=\n∆\nB\n\nIf τ is short such that\n<<\n∆φ\n, then motional narrowing occurs. We can see this using the simple\nrandom walk theory of diffusion. The mean square displacement due to diffusion of a molecule is\n\nnL\nr\n=\n\nwhere L is the average length of a single step and n is the number of steps taken. In our example, the\nmean square dephasing angle after n intervals of duration τ in Bo is\n\n(\n)\nτ\nγ\nφ\nφ\ni\nn\nn\nB\n=\n∆\n=\n\nThe average number of steps required to dephase one radian is\n\nτ\nγ\ni\nn\nB\n=\n\nBy definition\n\nτ\nγ\nτ\ni\nT\nn\nB\n=\n=\n\nNow, the line width for water (since the criterion of ∆φ << 1 is met with τ ≈ 10-10 seconds in water) is\n\n(\n)\n(\n) τ\nω\nτ\nγ\nω\no\ni\nliquid\nT\n∆\n=\n=\n=\n∆\nB\n\nwhich gives a line width on the order of one radian per second as compared to 105 radians per second for\nice. Thus, the T2 for solids is quite short, while that for liquids is long. T1 is about the same as T2 for\nliquids, while in solids T1 can be short or long.\n\nIn liquid spectroscopy, the Larmor frequency of an individual nucleus is determined by the electronic\ndistribution in the chemical bonds. Different electronic distributions give rise to different chemical shifts\nand J coupling, the two main interactions that are not averaged out by the molecular motion. The\nchemical shift in liquids is an isotropic phenomenon. Because the line widths in liquids are very small,\nthe static magnetic field must be extremely homogeneous. Shimming the magnetic field provides\nhomogeneities on the order of 1ppm or less. In addition to this, the liquid sample is put into a long\ncylindrical tube and is spun inside the static field to further average our inhomogeneities.\n\nThe chemical shift of a particular proton, or group of equivalent protons, is determined by the shielding\nconstant, σ, where\n\n(\n)\nH\nH\n∆\n+\n=\no\nγ\nω\n\nand\n\no\nH\nH\nσ\n-\n=\n∆\n\n∆H is referred to the chemical shift relative to some standard chemical shift that is accepted as zero. The\nmost common \"zero\" is the resonance arising from the 12 equivalent protons of tetramethyl silane. The\nreasons that this compound is used as a standard is that it is one of the most shielded, is essentially inert,\nand is easy to insert and remove from samples. Shielding means that much of the electron density exists\nin the vicinity of the protons, corresponding to a large σ. Before going into this detail, let us go over the\nrules of liquid NMR spectrum (Figure 21). The units for reporting resonances are in ppm, where\n\n(\n)\n(\n)\nMHz\nfrequency\ner\nSpectromet\nHz\nreference\nfrom\nppm\nν\n∆\n=\n\nThe reason for this scale is that it eliminates the field dependence of the resonance as the magnetic fields\non no two spectrometers are exactly identical. We use the symbol δ to report chemical shifts in ppm.\n\n\"Upfield\"\n\"Shielded\"\n\"Downfield\"\n\"Deshielded\"\nB\n\nppm\nν\n10 5 0\nFigure 21 - Spectrum Basics\n\nFigure 21 shows what seems to be an error: the frequency and magnetic field are going in opposite\ndirections. You are also wondering why the spectrum goes from 0 to 10 from right to left. Tradition is at\nplay here. We must go back and examine the way spectra were taken when NMR jumped on the scene.\nIn CW NMR, the field, Bsweep. The Larmor frequency can be written\n\n(\n)\nsweep\no\nL\nB\nB\nB\n+\n∆\n+\n= γ\nω\n\nA resonance occurs when ∆B and Bsweep cancel. A large shielding constant requires a larger sweep field\nand we say that the resonance appears \"upfield\" and that the nucleus is \"shielded\". Shielded nuclei, then,\nresonate at lower Larmor frequencies since frequency increases going left. This is a confusing\nconvention, but over time, it will make sense.\n\nChemical bonds are responsible determining the electronic distribution within a molecule. The shielding\nconstant is a result of the character of the bond. Begin with a hydrogen atom (Figure 22). For\ndiamagnetic materials, Lenz's Law states that in a magnetic field, an induced current will flow in the\nelectron field such that a local magnetic field will arise at the nucleus in a direction opposite that of the\napplied field (use the right hand rule here). Therefore, the total field seen at the nucleus is always less\nthan the applied field. The hydrogen atom has the largest shielding constant, given by\n\n( )\n∫\ninf\n=\ndr\nr\nr\nm\ne\ne\no\nρ\nμ\nσ\n\nwhere μ is the permittivity of free space, e is the elementary charge, me is the mass of an electron, and\nρ(r) is the electron distribution.\n\nElectron Cloud\nBo\nBlocal\nInduced\ncurrent\n\nFigure 22 - Schematic of the Hydrogen Atom\n\nWe speak of the hydrogen atom as being purely diamagnetic. Its resonance is the farthest upfield.\nAdding atoms to a molecule causes a reduction in the \"pure\" diamagnetic effect and the resonances are\nshifted downfield. For molecules, the shielding constant is the sum of different electronic effects\n\n'\nσ\nσ\nσ\n+\n=\nhydrogen\nmolecule\n\nwhere σ' is the shielding effect due to other atoms in the molecule. The determining factors of σ' are the\ntype of atom in the vicinity, the character of the chemical bond (i.e. single, double, or triple bonds), the\nelectron circulates within the substituents which can cause secondary field effects, van der Walls effects,\nand the effects of the surrounding medium (i.e. hydrogen bonding, etc.).\n\nThe hydrogen halides, HF, HCl, HBr, and HI, can be used as an example of the inductive effect of the\nelectronegativity of the halides to reduce the pure diamagnetic shielding constant. The most\nelectronegativity element, fluorine, has the largest effect and essentially sucks away the electron density\nfrom the hydrogen nucleus to deshield it. Chlorine follows, then bromine, and finally iodine, so that the\nhydrogen nucleus in HI is the most shielded series.\n\nMore important in organic chemistry are hydrogen atoms attached to carbon skeletons. The electron\ndensity at the carbon atom usually defines the effects on the hydrogen nucleus and its Larmor frequency.\nThe effects of halide substituents on a carbon skeleton parallel the effects in the hydrogen halide series -\nit follows electronegativity. Figure 23 summarizes the effect of a halide in small alkanes. The arrows\nabove the protons on the right identify which protons are targeted in the plot. In series' A and B, a purely\ninductive effect is seen. In B, an added effect of another carbon is seen. In series C, the effect is more\ncomplicated due to secondary magnetic fields generated because of the large size of the electron clouds\n(or, in other words, the increased polarizability). This effect is called magnetic anisotropy.\n\nB\nC\nA\nA) CH3 X\n\nB) CH3CH2 X\n\nC) CH3CH2 X\nElectronegativity -->\nX = I Br Cl F\n\nProton δ\nrelative to\nmethane\n(0.13 ppm)\n\nFigure 23 - Effect of Halides on the Protons in a Carbon Skeleton\n\nThe effect of an -NO2 group is seen in Figure 24. This is purely an inductive effect that decreases with\ndistance as can be seen in the ∆δ column.\n\n1 2 3 1 2 3\n\nCH3CH2CH3\n\nO2NCH2CH2CH3 ∆δ\n\nδCH3\n0.91 ppm\n\nδCH2\n4.36 ppm\n3.45\n\nδCH2\n1.33 ppm\n\nδCH2\n2.05 ppm\n0.72\n\nδCH3\n0.91 ppm\n\nδCH3\n1.03 ppm\n0.12\n\nFigure 24 - Effect of a Nitro Group on Proton Chemical Shift\n\nCarbon cations and anions can cause a loss or gain of electron density around the neighboring protons. It\nis easy to see this effect. One way to clarify where the electron density is in a molecule is to draw the\nresonance structures. This is especially true in molecules that have multiple bonds in them. It becomes\nmore difficult to predict the chemical shifts in carbon skeletons with double and triple bonds. For\ninstance, the chemical shift values for the protons in three examples, ethane, ethylene, and ethyne, are\nshown below. We must actually look at the geometry of the electron density to account for these values.\n\n3.2\n0.5\n9.0\n=\n=\n=\n≡\n=\n-\nδ\nδ\nδ\nCH\nHC\nCH\nCH\nCH\nCH\n\nVinyl protons actually sit in the plane of the molecule (Figure 25) where the electron density is at a\nminimum since the π-electrons of the double bond hover above and below the plane. This causes the\ndeshielding effect and accounts for the chemical shift of 5.0.\n\nπ - electrons\nC\nC\nnodal region\nH\nH\nH\nH\n\nFigure 25 - Vinyl protons deshielding in the plane of the molecule\n\nA similar effect is seen in a carbonyl group where the C-O bond forms the plane of the molecule with π-\nelectrons above and below. Any protons in the plane are deshielded. A molecule with a double bond can\nhave a geometry so that a proton from another part of the molecule hangs near the π-electron density and\ncan be actually be shielded.\n\nA triple bond must also be examined geometrically. Here the π-bond electrons are perpendicular to each\nother, forming a cylinder of electron density about the axis of the molecule. Within this cylinder these\nelectrons can circulate, generating a current, and thus a local field in the opposite direction to the applied\nfield (Figure 26). This causes a shielding effect on the protons.\n\nC\nC\nelectron\ncurrent\nBlocal\nH\nH\n\nBo\n\nFigure 26 - Shielding Effect in Ethyne\n\nThe last major effect for our purposes is the generation of ring currents in cyclic conjugated systems\n(those with 4n + 2 π - electrons). The chemical shift for the protons in benzene is 6.9 ppm. We ask why\nthis is farther down field than the vinyl protons. The reason is that a diamagnetic ring current is generated\nin the benzene ring (Figure 27), which results in a local field opposing the applied field in the center of\nthe ring.\n\nIf we follow the field lines out and around to the protons on the outer part of the ring, we see that the\ndirection of the local field is in the same direction as the applied field. This is a deshielding effect and the\nresonance is downfield.\n\nH\nH\nH\nH\nBo\nLocal\nField\nLines\nRing Currents\n\nFigure 27 - Ring Currents and Local Field in Benzene\n\nWe have examined some of the effects of chemical shift in basic organic molecules. The following is a\nshort summary of approximate chemical shifts:\n\nAlkanes: δ = 0.9 - 1.5\n\nCycloalkanes: δ = 1.0 - 1.8\n\nAlkenes: δ = 4.5 - 6.0\n\nAlcohols: δ = 3.4 - 4.0 (-OH proton can be anywhere)\n\nEthers: δ = 3.3 - 4.0\n\nKetones and Aldehydes: δ = 2.0 - 2.7\n\nCarboxylic Acids: δ = 2.0 - 2.7\n\nAmines: δ = 2.0 - 2.8 (-NH protons wide δ = 1.0 - 5.0)\n\nAromatic Compounds: δ = 6.0 - 8.5 (aromatic protons)\n\nδ = 2.3 - 3.0 (attached alkyl groups)\n\nAnother aspect of the NMR spectrum is helpful in determining molecule structure. The area under each\nresonance peak is proportional to the number of protons that gave rise to the peak. Next we will see that a\nresonance may not only be a single peak, but may also have multiplicity.\n\nMultiplicity arises because of another interaction left in liquid NMR spectroscopy J-coupling. This is a\nsmall scalar effect and leads to hyperfine splitting of a single peak. It is a consequence of the orientation\nof the nuclear spins on the electronic wavefunction. The only reason we see it is that the motion in\nliquids eliminates everything else. It is the smallest isotropic effect.\n\nJ-coupling is a magnetic interaction not transmitted through space, but rather by bonding electrons\nthrough which the protons are indirectly coupled. We will only consider first order effects - the distance\nof transmission is through 3 bonds.\n\nConsider the ethanol molecule, CH3CH2OH. If you are the -CH3 group, you see 3 different possible spin\nstates (a triplet) for the CH2 group next door (Figure 28). The frequency shift of the states is ± J, the spin\ncoupling constant.\n\nFigure 28 - Possible Spin States for -CH2\n\nLikewise if you are the -CH2 group looking at the -CH3 (Figure 29) and the result is a quartet instead of a\nsinglet.\n\n3 3\n\nFigure 29 - Multiplet from -CH3\n\nThe intensity distribution within a multiplet is related to the relative probabilities of the different spin\ncombinations, or\n\n+\n=\nnI\nty\nMultiplici\n\nwhere I = 1⁄2 for protons and n is the number of neighboring protons. Multiplicity for protons is n + 1.\nThe relative intensity of each peak in the multiplet goes as the coefficient of the binomial expansion\n(Pascal's Triangle) (Figure 30).\n(\nn\nb\na + )\n\nn = 0\n\nn = 1\n\nn = 2\n\nn = 3\n\nn = 4\n\nFigure 30 - Pascal's Triangle\n\nA few examples follow. The protons on the second carbon in n-butane (CH3CH2CH2CH3) will give a\nmultiplet with 6 peaks since there are a total of 5 protons on the two adjacent neighboring carbon atoms.\nRemember, we are only concerned with a distance of 3 bonds. In t-butane ((CH3)3CH), the tertiary\ncarbon has one proton that will give rise to a multiplet of 10 peaks due to the nine protons on adjacent\ncarbons. The methyl protons are considered chemically and magnetically equivalent and will give rise to\na simple doublet since there is only one neighboring proton. We will do many examples in class -\npractice is the only way to master these principles.\n\nIn π-bond systems, there are higher order, longer range effects and the expected multipet may have yet\nfiner splittings. This is due to the ability of π-electrons to \"transmit\" magnetic information more\neffectively and coupling occurs farther than the 3 bonds as in saturated systems.\n\nAnother useful aspect of liquid spectroscopy is that it can given us information about molecular kinetics.\nFor instance, N, N-dimethylformamide is shown in Figure 31 as two resonance structures.\n\nCH3\nA)\n\nB)\nCH3\nC\nH\nO\nN\nC\nH\nO-\nN+\nCH3\nCH3\n\nFigure 31 - Resonance Structures of N, N-dimethylformamide\n\nThe structure on the right tells use that the N-C bond has some double bond character which causes a\nrather high barrier to rotation at room temperature. This barrier to rotation then causes the protons on the\nmethyl groups (labeled A and B) to have different chemical shifts, since the chemical environments are\ndifferent. The protons on A, see carbonyl oxygen across the way, while those on B see a lone proton.\nThus, at lower temperatures, two singlets result - one from A and one from B. Consider the two states, A\nand B, which exchange with the corresponding rate constants, k and k-1\n\nB\nA\nk\nk 1\n-↔\n\nand protons A and B give rise to peaks at ωA and ωB. The separation between the peaks is then\nω\nω\nω\n∆\n=\n-\nB\nA\n. Now, if the correlation time for the rotational process is such that\n>>\n∆ω\nτ\n, then we\nsee two peaks. As τ∆ω approaches 1, the two peaks begin to coalesce to form one peak. We can do this\nby increasing the temperature which makes the correlation time decrease (the molecules are moving\nfaster). We can increase the temperature farther and the one peak now becomes sharper. What is\nhappening is that we are seeing the time average of the two different environments when the molecule is\nrotating faster than the \"NMR time scale\", or τ∆ω << 1. In other words, in order for the protons to give\noff two separate peaks, they must remain in one environment long enough to satisfy τ∆ω > 1.\n\nOne final aspect of liquid spectroscopy to discuss is the use of decoupling experiments. If you are an\norganic chemist and you build a new molecule, but the NMR spectrum is complicated and you are unsure\nof the peak assignments, you do a decoupling experiment to identify adjacent protons. This requires the\nuse of a separate transmitter set at a frequency to saturate and give rise to no peak. Also, the multiplets\n\nfrom protons on neighboring carbon atoms would collapse into singlets. Thus, you can walk you way\nthrough a molecule and determine neighboring protons. Decoupling may also be used to eliminate\nunwanted peaks. For example, if a large water peak is covering up information about other molecules, it\nis possible to saturate the water protons so that the water peak disappears and leaves the information\ndesired underneath it. This is especially useful in biological systems where water is everywhere.\n\nThis chapter has been a brief explanation of liquid spectroscopy, hopefully enough to understand the basic\nprinciples. It is important as the field of MRI advances since spatially localized spectroscopy is becoming\na fascinating way to look at biochemical processes in the body. We will see more of this later.\n\nCHAPTER 5: FOURIER TRANSFORM THEOREMS\n\nImage processing involves several of the FT theorems. Here we list and describe the important ones for\nour purposes. The FT in two dimensions yields spatial frequencies. We define the FT and FT-1 in two\ndimensions\n\n(\n)\n(\n)\n(\n)\n(\n)\n∫∫\n∫∫\n+\n-\n+\n-\n=\n=\n≡\ny\nx\ny\nk\nx\nk\ni\ny\nx\ny\nk\nx\nk\ni\ny\nx\ndk\ndk\ne\nk\nk\nG\nG\nF\ndxdy\ne\ny\nx\ng\ng\nF\nk\nk\nG\ny\nx\ny\nx\nπ\nπ\n,\n)\n(\n)\n,\n(\n)\n(\n,\n\nThe FT theorems are listed below:\n\n(1)\nLinearity:\n)\n(\n)\n(\n)\n(\nG\nF\ng\nF\nh\ng\nF\nβ\nα\nβ\nα\n+\n=\n+\n\n(2)\nSimilarity: if\n(\n)\n(\n)\n(\n)\ny\nx k\nk\nG\ny\nx\ng\nF\n,\n,\n≡\n, then\n(\n)\n{\n}\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\nb\nk\na\nk\nG\nab\nby\nax\ng\nF\ny\nx ,\n,\n. Stretching space is\n\nequivalent to contraction in frequency.\n\n(3)\nShift Theorem: if\n(\n)\n(\n)\n(\n)\ny\nx k\nk\nG\ny\nx\ng\nF\n,\n,\n≡\n, then\n(\n)\n{\n}\n(\n)\n(\n)\nb\nk\na\nk\ni\ny\nx\ny\nx\ne\nk\nk\nG\nb\ny\na\nx\ng\nF\n+\n-\n=\n-\n-\nπ\n,\n,\n.\n\nTranslation in space is equivalent to a linear phase shift in frequency.\n\n(4)\nParseval's Theorem:\n(\n)\n(\n)\n∫∫\n∫∫\n=\ny\nx\ny\nx\ndk\ndk\nk\nk\nG\ndxdy\ny\nx\ng\n,\n,\n.\n\n(5)\nConvolution Theorem:\n(\n) (\n)\n{\n}\n(\n) (\n)\ny\nx\ny\nx\nk\nk\nH\nk\nk\nG\ndadb\nb\ny\na\nx\nh\nb\na\ng\nF\n,\n,\n,\n,\n=\n-\n-\n∫∫\nwhere G = F\n\nand H = F(h).\n\n(6)\nAutocorrelation Function: if\n(g)\n(\n)\n(\n)\n(\n)\ny\nx k\nk\nG\ny\nx\ng\nF\n,\n,\n≡\n, then\n\n(\n)\n(\n)\n{\n}\n(\n)\n*\n,\n,\n,\ny\nx k\nk\nG\ndadb\ny\nb\nx\na\ng\nb\na\ng\nF\n=\n-\n-\n∫∫\n. Similarly,\n\n(\n)\n{\n}\n(\n)\n(\n)\n∫∫\n-\n-\n=\ndadb\nk\nb\nk\na\nG\nb\na\nG\nb\na\ng\nF\ny\nx,\n,\n,\n*\n.\n\n(7)\nFourier Integral Theorem:\n(\n)\n{\n}\n(\n)\n{\n}\n(\n)\ny\nx\ng\ny\nx\ng\nF\nF\ny\nx\ng\nFF\n,\n,\n,\n=\n=\n-\n-\n\nCommonly Used FT's:\n\n(1)\nRectangle:\n( )\n⎪⎩\n⎪⎨\n⎧\n<\n=\nelsewhere\nx\nx\nrect\n|\n|\n. The FT is\n\n( )\n( )\n{\n}\n(\n)\n( )\ny\nx\nk\nc\nk\nc\ny\nrect\nx\nrect\nF\nsin\nsin\n,\n=\n, where\n( )\n(\n)\nx\nx\nx\nc\nπ\nπ\nsin\nsin\n=\n.\n\n(2)\nTriangle:\n( )\n⎩\n⎨\n⎧\n≤\n-\n=\nelsewhere\nx\nx\nx\ntri\n|\n|\n. The FT is\n( )\n( )\n{\n}\n(\n)\n( )\ny\nx\nk\nc\nk\nc\ny\ntri\nx\ntri\nF\nsin\nsin\n,\n=\n.\n\nNote that\n, a convolution.\n\n(3)\nDelta Function:\n( )\n( )\n( )\nx\nrect\nx\nrect\nx\ntri\n=\n( )\n(\n)\nx\nN\nN\nNe\nx\nπ\nδ\nlim\n-\ninf\n→\n=\n. The FT is\n(\n)\n{\n}\n,\n=\ny\nx\nF δ\n. The FT is constant overall\n\nfrequencies.\n\n(4)\nComb Function:\n. The FT is\n\n( )\n(\n)\n∑\ninf\n-inf\n=\n-\n=\nn\nn\nx\nx\ncomb\nδ\n( )\n( )\n{\n}\n(\n)\n( )\ny\nx\nk\ncomb\nk\ncomb\ny\ncomb\nx\ncomb\nF\n=\n,\n. The similarity theorem applied here is\n\n(\n)\n(\n)\n{\n}\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n=\nb\nk\ncomb\na\nk\ncomb\nab\nby\ncomb\nax\ncomb\nF\ny\nx\n,\n.\n\nCHAPTER 6: INTRODUCTION TO IMAGING\n\nWe are interested in the relation between the physical properties of an object and the image and its\nproperties. The object is usually something in three dimensions, while the image has been compressed\ninto two. The properties reflected in an object are listed below.\n\nConventional x-ray Æ μ, the mapping attenuation\n\nCT scan Æ μ, and atomic number\n\nDigital subtraction angiography Æ μ (iodine)\n\nNuclear scanning, PET, SPECT Æ Concentration of emitting nuclei\n\nUltrasound Æ interfaces, velocity\n\nNMR Æ Spin density, T1, T2, chemical shift (σ)\n\nThe relationship between object and image can be linear or have spatial invariance. A space invariant, or\nstationary process is where the object is moved and the image is shifted without change. A linear process\nmeans\n\n(\n)\n(\n)\n[\n]\n(\n)\n(\n)\n,\n,\n,\n,\ny\nx\nbSt\ny\nx\naSs\ny\nx\nbt\ny\nx\nas\nS\n+\n=\n+\n\nwhere s and t are the input functions and S is the operator function.\n\nThe image is usually intensity, or optical density, reflecting spatial frequencies. The noise in the image\ncan be continuous or digital. The resolution of an image is important and defined to be the ability of an\nimaging system to reproduce spatial variation of the object in the image plane. It should be stressed that\nresolution is not the smallest object that you see. Use the point spread function (PSF), or impulse\nresponse function\n\n(\n)\n(\n)\n{\n}\nb\ny\na\nx\nS\nb\na\ny\nx\nh\n-\n-\n=\n,\n,\n,\n,\nδ\n\nwhich is the output response at (x2, y2) of δ at (a,b). This tells how well the points get transferred from\nobject to image. Think of an input function\n\n(\n)\n(\n) (\n)\n∫∫\n-\n-\n=\ndadb\nb\ny\na\nx\nb\na\ng\ny\nx\ng\n,\n,\n,\nδ\n\nwhere\nis essentially a weighting factor for the elementary δ's. The output function reflects the\n\"sifting\" property of the delta functions\n(\nb\na\ng\n,\n)\n\n(\n)\n(\n) (\n)\n{\n}\n(\n)\n(\n)\n[\n]\n(\n) (\n)\n∫∫\n∫∫\n∫∫\n=\n-\n-\n=\n-\n-\n=\ndadb\nb\na\ny\nx\nh\nb\na\ng\ndadb\nb\ny\na\nx\nS\nb\na\ng\ndadb\nb\ny\na\nx\nb\na\ng\nS\ny\nx\ng\n,\n,\n,\n,\n,\n,\n,\n,\n,\nδ\nδ\n\nIf the system is space invariant, then\n\n(\n)\n(\n)\nb\ny\na\nx\nh\nb\na\ny\nx\nh\n-\n-\n=\n,\n,\n,\n,\n\nand only the distances x2 - a and y2 - b contribute causing h to change in location and not form. Thus,\n\n(\n)\n(\n) (\n)\n∫∫\n-\n-\n=\ndadb\nb\ny\na\nx\nh\nb\na\ng\ny\nx\ng\n,\n,\n,\n\n(\n)\nh\ng\ny\nx\ng\n*\n,\n=\n\nwhere * denotes a convolution. In other words, the output function is convolution of the input function\nand the PSF (go back to review of FT theorems). The response to a unit impulse is characterized by the\nfull width at half height (FWHH) of the PSF. If the system has many sources of spread in the PSF, then,\nin general\n\n..\n+\n+\n+\n=\nμ\nμ\nμ\nμtotal\n\nby the Central Limit Theorem.\n\nAnother important function to describe the resolution of an image is the modulation transfer function\n(MTF). It is the ratio of the output modulation to the input modulation (Figure 32).\n\n( )\n( )\n( )\nν\nν\nν\nInput\nOutput\nMTF\n=\n\nInput\nOutput\nSignal\n\nSpatial Frequency\n\nFigure 32 - Frequency Modulation\n\nThe MTF is normalized such that MTF (0) = 1. Thus, MTF(ν) ≤ MTF(0). Digital imaging involves\ndiscrete sampling of an object, for example, in a CT scan, the signal detectors are aligned in discrete\nbanks. If the signal is digitized, we must determine how rapidly to sample the data in order to get an\naccurate reflection of the analogue signal. The Nyquist theorem states that we must sample at twice the\nhighest frequency to accurately reconstruct a sinusoidal signal, i.e. we must sample at least twice per\ncycle (or we will have aliasing).\n\nFor a certain class of object function, it is possible to reconstruct the sample data exactly. The objects\nmust be band limited, i.e. their Fourier Transform must be non-zero over a finite region of frequency\nspace. This is known as the Whittaker-Shannon sampling theorem. Consider a rectangle lattice of\nsamples of g:\n\n(\n)\n(\n)\ny\nx\ng\nY\ny\ncomb\nX\nx\ncomb\ny\nx\ng s\n,\n,\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n=\n\nwhere gs(x,y) is the sampled object g(x,y) is the object itself,\nand X and Y are\nsample spacing. The object is therefore sampled on a grid which is separated by X and Y. By the\nconvolution theorem,\n( )\n(\n)\n∑\ninf\n-inf\n=\n-\n=\nn\nn\nx\nx\ncomb\nδ\n\n(\n)\n(\n)\ny\nx\ny\nx\ns\nk\nk\nG\nY\ny\ncomb\nX\nx\ncomb\nFT\nk\nk\nG\n,\n*\n,\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n=\n\nwhere\n\n(\n)\n(\n)\n∑∑\ninf\n-inf\n=\ninf\n-inf\n=\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n-\n=\n=\n⎭\n⎬\n⎫\n⎩\n⎨\n⎧\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\nm\nn\ny\nx\ny\nx\nY\nm\nk\nX\nn\nk\nYk\ncomb\nXk\nXYcomb\nY\ny\ncomb\nX\nx\ncomb\nFT\n,\nδ\n\ntherefore,\n\n(\n) ∑∑\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n-\n=\nm\nn\ny\nx\ny\nx\ns\nY\nm\nk\nX\nn\nk\nG\nk\nk\nG\n,\n,\n\ni.e. Gs is just G = FT{g} about each point n/X and m/Y in the kx - ky plane.\n\nSince we assume g(x,y) to be band limited, G is finite over a region T (see Figure 33). If X and Y are\nsufficiently small, then 1/X and 1/Y are large enough to avoid any overlap. It is therefore possible to\nobtain G from Gs by passing gs through a filter that only transmits the n = 0 and m = 0 term. By\nexcluding all the other terms, the output of this filter is exactly g(x,y), the desired object.\n\nFigure 33 - Representation of G(kx,ky)\n(\n)\ny\nx k\nk\nG\n,\n\nR\n2By\n2Bx\n(\n)\ny\nx k\nk\nG\n,\n1/Y\n1/X\n\nTo determine the maximum allowable separation between the samples, let 2Bx and 2By be the widths in kx\nand ky of the smallest rectangle enclosing the region R. Then,\n\ny\nx\nB\nY\nB\nX\n,\n≤\n≤\n\nTo retrieve g(x,y) from gs(x,y), we must pass gs through a filter of a transfer function. One of the possible\nchoices for this transfer function H is:\n\n(\n)\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\ny\ny\nx\nx\ny\nx\nB\nk\nrect\nB\nk\nrect\nk\nk\nH\n,\n\nwhere\n\n( )\n⎪⎩\n⎪⎨\n⎧\n≤\n=\nelsewhere\nx\nx\nrect\n,0\n|\n|\n,1\n\ntherefore,\n\n(\n) (\n)\n(\n)\ny\nx\ny\nx\ny\nx\ns\nk\nk\nG\nk\nk\nH\nk\nk\nG\n,\n,\n,\n=\n\nIn the spatial domain, this becomes a convolution of gs(x,y) and h(x,y). In the spatial domain, h(x,y) is:\n\n(\n)\n(\n)\n(\n)\ny\nB\nc\nx\nB\nc\nB\nB\ny\nx\nh\ny\nx\ny\nx\nsin\nsin\n,\n=\n\nBy working through the convolution given that gs(x,y) is a comb function, we can obtain the final solution\nfor g(x,y) for this given set of conditions:\n\n(\n) ∑∑\n⎥\n⎦\n⎤\n⎢\n⎣\n⎡\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n⎥\n⎦\n⎤\n⎢\n⎣\n⎡\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\nm\nn\nx\ny\nx\nx\ny\nx\nB\nm\ny\nB\nc\nB\nn\nx\nB\nc\nB\nm\nB\nn\ng\ny\nx\ng\nsin\nsin\n,\n,\n\nCross-sectional reconstruction\n\nProjection Reconstruction\n\nGiven any object g(x,y) in spatial coordinates, it is often easier to find its Fourier transform G(kx,ky) from\nmost imaging techniques, including CT and MRI. However, since these techniques take projections of\nmulti-dimensional objects, there must be a way of reconstructing the image from the data obtained.\n\n(\n)\n(\n)\n(\n)\n∫∫\n+\n-\n=\ndxdy\ne\ny\nx\ng\nk\nk\nG\ny\nk\nx\nk\ni\ny\nx\ny\nx\nπ\n,\n,\n\nsource\nx\ny\ns\nr\ndetector\n\nFigure 34 - Projection of a 2-D object onto axis r\n\nThe projection of g(x,y) along any axis can be found by evaluating the following integral, for example,\nalong the x-axis:\n. For any arbitrary angle φ,\n( )\n(\n)\n∫\ninf\ninf\n-\n=\ndy\ny\nx\ng\nx\nP\n,\n(\n)\n(\n∫∫\n=\nφ\nφ\n,\n,\n,\nr\nds\ny\nx\ng\nr\nP\n)\n. The\nFourier transform of this projection corresponds to a line through G(kx,ky) (i.e. FT{P(x)} = G(kx,0)). To\nsee this, rewrite G(kx,ky) in terms of an integral over the axes r and s.\n\n(\n)\n(\n)\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\n+\n=\n=\n-\n-\n∫∫\ny\nx\ny\nx\nikr\ns\ny\nx\nk\nk\nk\nk\nk\ndrds\ne\ny\nx\ng\nk\nk\nG\ntan\n,\n,\nφ\nπ\n\nBut as seen above, the integral of g(x,y) over s is simple the projection onto P(r,φ). Therefore,\n\n(\n)\n(\n)\n(\n)\nφ\nφ\nπ\n,\n,\n,\nk\nG\ndr\ne\nr\nP\nk\nk\nG\nikr\ny\nx\n=\n= ∫\n-\n\nThe Fourier transform of each projection therefore defines a ray at angle φ in G(kx,ky). This is known as\nthe Central Slice Theorem. If enough projections are taken, it is reasonable to assume that we can\nconstruct g(x,y), by taking the inverse Fourier Transform of the projections.\n\nThis requires that the projection be linear, such that each element along the path contributes equally.\n\nCT - takes logs\n\nPET - use directly\n\nSPECT - doesn't work\n\nx\nFourier\nTransform\nky\nkx\ny\n\nFigure 35 - Central Slice Theorem\n\nBack projections\n\nInstead of building the k-space picture by overlaying the projections through the origin, what if the\nprojections where backprojected throughout the entire k-space domain along their respective angles (see\nFigure 36). In this fashion, the point response is a star, or equivalently, PSF α 1/r.\n\nFigure 36 - Backprojection of a Point\n\nThe points at low spatial frequencies are oversampled. To obtain a properly weighted image, multiply the\nbackprojected image by a ramp filter W(k) = |k|. In real space, this can be achieved by convoluting the\nprojections with the Fourier Transform of W(k).\n\nkmax\nk\nW(k)\n\nFigure 37 - Convolution Function Used in Backprojection\n\nIn practice, the exact convolution will vary and lead to trade-offs in resolution since we don't have a\nsmooth roll-off in frequency to avoid ringing in space.\n\nCHAPTER 7: NMR IMAGING\n\nNow that we have seen how to reconstruct images from their projections, how do we obtain projections\nusing NMR? We can't collimate the RF pulses like we can collimate x-rays because their wavelength is\nmuch too long. However, we can apply a linear magnetic field in the desired direction, i.e.:\n\n( )\n(\n)\n( )\n( )\n(\n)\nx\no\nx\no\nx\no\nz\nz\nz\nxG\nB\nx\nB\nx\nz\nxG\nB\nx\nB\ndx\ndB\nG\nω\nω\nγ\nγ\nω\n+\n=\n+\n=\n=\n+\n=\n=\nˆ\n\nx\nGx\nBo\nFigure 37 - Linear Gradient in the Magnetic Field\n\nThe spins distributed in the object will be precessing at different resonance frequencies which are dictated\nby the strength of the linear gradient. By examining the spatial distribution of the frequencies, we get a\nprojection of the object along the x direction. The signal can be written as follows:\nwhere ρ(x,y) is the object in question. Then the signal as a function of time\ncan be written as:\n( )\n( )\n(\n)\n∫\n=\n∝\ndy\ny\nx\nx\nP\nS\n,\nρ\nω\n\n( )\n(\n)\n( )\n∫\n∫\n=\n=\ndx\ne\nx\nP\nG\nd\ne\nP\nt\nS\nt\nG\ni\nx\nt\ni\nx\nx\nx\nγ\nω\nγ\nω\nω\n\nNow by setting\nt\nG\nk\nx\nx\nγ\n=\nwe can see that S(t) is simply the inverse Fourier transform of P(x). This can\nbe generalized to any line in the object by changing the linear gradient. If a combination of gradients in\nthe x and y direction is applied, the projection through the object will be at an angle\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n=\n-\nx\ny\nG\nG\ntan\nθ\n.\n\nOnce the projections have been obtained, the image can be reconstructed by any of the techniques\nmentioned in the previous chapter.\n\nS(t)\nGy\nGx\nRF\n\nFigure 38 - Example of Pulse Sequence\n\nThese techniques can also be applied to reconstruct 3D images, simply by applying a third gradient in the\nz direction. (References: Lai & Lauterber, J. Phys, E. 13, 747 (1980); Shepp, JCAT, 4, 94 (1980))\n\nDetails of Projection\n\n(1) Signal to Noise\n\nIn one dimension,\nN\nx\nSNR\n∆\n∝\n, where ∆x is the pixel size and N is the number of times the\nexperiment is repeated. In three dimensions,\nN\nV\nSNR\n∆\n∝\n; therefore, to reduce the size of the voxel\nand maintain the same SNR, we must increase the number of experiments by quite a lot. For example, to\nreduce the voxel size by 2, the number of experiments must increase by 64!\n\n(2) Gradient Size\n\nThe size of the gradient must be large enough to overcome the inhomogeneities in the magnetic field, i.e.:\n\nwidth\nline\nogeneities\nin\ngradient\n+\n∆\n>\n∆\nhom\nω\nω\n\nHowever, if the gradient is too big, then noise will be introduced since the signal is too spread out. We\nneed to have a large signal to over a small ∆ω to overcome the noise.\n\n(3) Sampling Rate\n\nSI = sampling interval.\nx\nG\nbandwidth\nSI\nx∆\n=\n=\n∆\n=\nγ\nω\n\nwhere ∆x is the size of the region of interest being imaged, or in other words, the field of view (FOV).\n\n(4) Resolution\n\nThe number of pixels in an image is determined by the number of points that are sampled during one FID.\nIf there are 256 sampled points, then there are 256 pixels in one dimension. The size of the pixels is\ndetermined by the FOV and the # of pixels:\n\n(\n)\n(\n)\ntime\nn\nacquisitio\ntotal\nG\ns\npo\nsampled\nof\nSI\nG\npixels\nof\nFOV\nsize\npixel\nx\nx\nγ\nγ\nint\n#\n#\n=\n⋅\n=\n=\n\nFor an image containing n x n pixels, each acquisition gives us n samples. We therefore require n\nacquisitions. Similarly, in 3D, we require n2 acquisitions.\n\nSlice Selection\n\nTo define a plane in the z direction of an object, we can apply a gradient in the z direction and use an RF\npulse with a well defined frequency range.\n\nB(z)\n∆B\n∆z\nz\n∆z\nz\n\nz\nG\nB\nz∆\n=\n∆\nimplies that\nz\nG\nz\nγ\nω\n∆\n=\n∆\n, where ∆ω = RF bandwidth.\n\nTo obtain a perfectly rectangular pulse of width, ∆ω, the pulse must have sinc shape in the time domain.\nIt is impractical however to have a pure sinc function since it cannot be applied from t = -inf to t = inf. It is\nnecessary to truncate the sinc function, and it is usually limited to one lobe. This truncation causes\n\"ringing\" in the RF pulse as seen in the frequency domain.\n\nIdeal RF\nPulse\n\nt\nω\nIdeal RF\nPulse\n∆ω\nω\nReal RF\nPulse\n∆ω\nringing\nt\nReal RF\nPulse\nFigure 39 - Ideal and Realistic RF Pulse Shapes\n\nIf the gradient is simply applied at the same time as the RF pulse, there will be no signal detected. This is\ndue to the fact that some spins will reach the transverse plane before the RF pulse is turned off. Since the\ngradient is still on, the spins will be dephased by an amount equal to\nτ\nγ\nz\nGz∆\n=\n∆Φ\n, where τ is the time\nthat the gradient is on and the magnetization vector is in the transverse plane. τ is actually equal to half\nthe total time that the gradient is on. To compensate for this, apply the reverse gradient for a time τ in the\nz direction to rephase the spins by the amount ∆Φ. This is called compensatory gradient.\n\nThis will give a gradient echo, i.e. when the spins are refocused from the effects of the previous gradients\n(this will not correct for magnetic inhomogeneities like 180o pulse).\n\nRF\n\nGz\n\nFigure 40 - RF Pulse and Compensatory Gradient\n\nA different gradient Gz could be applied, as long as the angle ∆Φ is the same (i.e. a smaller gradient could\nbe applied for a longer time or a stronger gradient could be applied for a shorter time).\n\nGradient Echo Pulse Sequence\n\nSo far we have discussed slice selection and projection formation. Putting all of this together, the\nfollowing pulse sequence will give us a gradient echo signal for various projections. Once the projections\nhave been obtained, the reconstruction algorithms may be applied.\n\nFigure 41 - Gradient Echo Pulse Sequence\nRF\nGz\nGx\nS(t)\nvary\nvary\nGy\n\nSpin Echo Pulse Sequence\n\nTo create a spin echo, apply a 180o pulse at time t = TE/2. At time TE, the spins will refocus and an echo\nwill be formed. The pulse sequence would look something like this:\n\nRF\nGz\nGx\n180o\nGy\n\nFigure 42a - Incorrect spin echo pulse sequence\n\nThis sequence will not produce a signal for the same reason that a compensatory gradient needed to be\nadded to Gz. The first half of the gradients in x and y will dephase the spins as they are attempting to\nrephase and create the spin echo. To correct for this effect, we must apply a compensatory gradient. This\ncan be done by either applying reverse gradients just before the read-out gradients or we could apply the\nsame gradients before 180o pulse since the 180o pulse will reverse their effect.\n\nRF\nGz\nGx\nS(t)\n180o\nGy\n\nFigure 42b - Correct spin echo pulse sequence\n\nRF\nGz\nGx\nS(t)\n180o\nGy\n\nFigure 43 - Correct Spin Echo Pulse Sequence\n\nPhase Encoding\n\nCan we use the gradient dephasing for something useful? If we apply a gradient in the y direction without\nrefocusing the spins, we will obtain information about the frequency distribution of the object in that\ndirection. If the gradient is applied for a constant time τ, then the spins will be dephased by an amount:\n\nτ\nγ\ny\nG y\ny =\n∆Φ\n\nThe signal can then be represented by:\n\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n∫∫\n∫∫\n+\n+\n=\n=\ndxdy\ne\ny\nx\ndxdy\ne\ny\nx\nt\nS\ny\nk\nx\nk\ni\ny\nG\nxt\nG\ni\ny\nx\ny\nx\n,\n,\n,\nρ\nρ\nτ\nτ\nγ\nγ\n\nwhere\n\nτ\nγ\nγ\ny\ny\nx\nx\nG\nk\nt\nG\nk\n=\n=\n;\n\nThis looks parallel in x and y, but τ is a constant, while t evolves, thus giving us spatial encoding by\ntaking the Fourier Transform. This puts a phase twist in y. One way of looking at this is for each x, we\nare measuring a single Fourier component of the data along y. To get the whole object, we must sample\nmultiple Fourier components in ky and then take the inverse Fourier transform. To change ky, we can\neither change Gy τ. Each point sampled from the FID gives us one point in kx at a constant ky. The entire\nk-space can be rastered through in a rectilinear fashion by changing the value of ky and repeating the\nexperiment. Each value of ky is called a phase encoding step.\n\nky\n\nkx\n\nFigure 44 - Digitization of k-space\n\nTo obtain an n x n image, we acquire n points in the FID and then repeat the experiment n times, each\ntime with a different value of ky. To reconstruct the image, simply inverse Fourier transform the acquired\ndata. This experiment is called spin warp.\n\nRF\nGz\nGx\nS(t)\n180o\nGy\n\nFigure 45 -Spin Warp Pulse Sequence\n\nThis method can be applied to 3D imaging as well. Simply add Gz gradient in the same manner that a Gy\ngradient is applied. If a slice selective Gz is applied as well, we will obtain multiple finer slices within the\nselected slice.\n\ne.g. If we want 1 mm slices\n\ncm\nGauss\ncm\nG\nHz\nx\nHz\nz\nGz\n5.7\n1.0\n=\n⋅\n=\n∆\n∆\n= γ\nω\n\nwhich is a very large gradient. Instead, we can obtain a 15 mm slice (with Gz = 0.5 Gauss/cm) and use 16\nphase encoding steps in z. This is a good way of getting thin slices, but it can be a lengthy experiment.\n\nRF\nGz\nGx\nS(t)\n180o\nGy\n\nFigure 46 - 3D Spin Warp Pulse Sequence\n\nMultiplanar Imaging\n\nThere are long delays in viewing a large 3D objects because each slice must have time to relax before the\nexperiment may be repeated. For example, if we want to obtain a 256x128 image with Nave = 4, then if\nTR = 300 ms, it takes 4.3 minutes to acquire one slice. If 10 slices are to be acquired, the total\nexperiment requires 3 hours. Is there a way of obtaining stack images faster? Since T2 ~ 0.1 T1, there is a\nlot of dead time since TR is on the order of T1. We can image other slices during this time by either\nshimming Bo or by changing the center frequency of the 90o RF pulse.\n\nRF\nGz\nGx\nBo\n180o\n180o\nGy\nFigure 47 - Incorrect Fast Spin-Echo Pulse Sequence\n\nThe 180o pulses are \"hard\" pulses (i.e. they tip every spin in the sample). To avoid perturbing spins that\nare not involved in the slice, we must make the 180o pulse a \"soft\" pulse. It will look like the 90o pulse,\nwill be centered around the same frequency and a slice selective Gz must be applied at the same time.\nThe number of slices which can be obtained from this sequence is now dependent on TE and the total data\ncollection time. The former is determined by the contrast that is desired in the image (as will be shown\nlater) while the latter is dependent on gradient strengths, etc.\n\nThe total number of slices collected can be determined from\n\n(\n)\nF\ntime\ncollection\ndata\nTE\nTR\nslices\nof\n+\n+\n=\n*\n\nwhere F represents any additional time needed for gradients, etc\n\nExample: If data collection time = 15 ms and TE = 30 ms, then the time between slices is ~ 40 ms.\n\nIf TR = 500 ms Æ 12 slices can be collected\n\nIf TR = 2000 ms Æ 50 slices can be collected\n\nIs this more efficient? It all depends on the number of averages (Nave) which are needed to get adequate\nSNR. If Nave < # of slices needed, 2D is more efficient than the 3D method. However, the 2D multiscale\napproach may be less efficient if the total number of slices scanned does not cover the region of interest\n(small TR) and many slice averages are required. In general, the 2D technique is used. Only when very\nthin slices are needed or TR is very short is the 3D technique used.\n\nRF\nGz\nGx\nGy\nFigure 48 - Correct Fast Spin-Echo Pulse Sequence\n\nImage Contrast\n\nNow that we know how to obtain an image, we need to understand what kind of information these images\nare providing us. The image is not simply a measure of the proton density of the tissue. The relaxation\ntimes will influence the image contrast depending on the TE and TR chosen. To understand these\nconcepts, let's examine the Bloch equations:\n\n( )\n( )\n( )\nT\nt\nM\ndt\ndM\nT\nt\nM\ndt\ndM\nT\nt\nM\nM\ndt\ndM\ny\ny\nx\nx\nz\no\nz\n-\n=\n-\n=\n-\n=\n\nSolving these equations in the rotating frame on resonance gives\n\n( )\n( )\n( )\n( )\nT\nt\nz\nT\nt\no\nz\nT\nt\nx\nx\ne\nM\ne\nM\nt\nM\ne\nM\nt\nM\n-\n-\n-\n+\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n\nT1 Weighted Images\n\nSince different tissues have different relaxation times, can we use this behavior to our advantage?\n\n5 6\n2 3\n0 1\n\nassume TR >> T2\n\nMeasure Mx and Mz as a function of TR:\nTR\n\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n;0\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n=\n=\n=\n=\n-\n-\n-\n-\nz\nT\nTR\no\nz\nx\nT\nTR\no\nz\nx\nz\nT\nTR\no\nz\nx\nT\nTR\no\nz\nx\nz\no\nx\no\nz\nx\nM\ne\nM\nM\nM\ne\nM\nM\nM\nM\ne\nM\nM\nM\ne\nM\nM\nM\nM\nM\nM\nM\nM\nM\n\ni.e. equilibrium has been reached after 1 pulse.\n\nSignal Intensity\nC = contrast\nbetween tissues\nC\nlong T1\nshort T1\nTR\n\nFigure 49 - Signal Intensity as a Function of TR\n\nTherefore,\nshort T1 ⇒ large Mx ⇒ bright image\n\nlong T1 ⇒ small Mx ⇒ dark image\n\nTo ensure maximum contrast between tissues, it is necessary to optimize TR. If we assume a small\ndifference in tissue T1 where the largest signal intensity difference?\n\n(\n)\n( )\nT\nT\nd\ne\nTR\nM\nSI\nd\nT\nTR\no\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n⋅\n=\n-\n\nNow maximize with respect to TR:\n\n(\n)\n(\n)\n( )\nT\nTR\nT\nTR\nT\ne\nT\nd\nT\ne\nTR\nT\ne\nM\nTR\nd\nSI\nd\nT\nTR\nT\nTR\nT\nTR\no\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛-\n=\n⎟\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎜\n⎝\n⎛\n⋅\n-\n=\n=\n-\n-\n-\n\nTherefore, when TR = T1, we obtain a maximum contrast between two tissues with small differences in\nT1. Is contrast what we really want to maximize however? It may be best, depending on other imaging\nconstraints (i.e. # of slices) to maximize the contrast to noise ratio (or SNR).\n\nNote: This derives from Roses's (1957) concept of features of dots in a background of dots. Using\nPoisson statistics, he showed that to \"see\" a feature the difference in the number of dots in the feature and\nthe background must be greater than some factor (he suggested 5) times the expected variation of the\nnumber of dots in the feature.\n\n(\n)\ns\nn\nk\ns\nn\nn\n≥\n-\n\nwhere: n1 = dots in background/area\n\nn2 = dots in feature/area\n\ns = area\n\nk = constant (≅5)\n\nTherefore,\n\n(\n)\n>\n-\n=\ns\nn\ns\nn\nn\nN\nC\n\nIf we reduce TR, we will be able to perform more averages (which reduces the noise) in the same imaging\ntime. However, the decrease in TR will decrease the contrast between the tissues. It is necessary to\noptimize these two conflicting parameters:\n\nGive:\nTR\nN\nN\nSNR\n;\n∝\n∝\nthen\n\n(\n)\n( )\n( )\nT\nd\nT\ne\nTR\nT\nd\nT\ne\nTR\nTR\nSNR\nd\nTR\nSNR\nT\nTR\nT\nTR\n-\n-\n=\n⋅\n=\n⇒\n∝\n\nNow maximize with respect to TR:\n\n(\n)\n)\n(\nT\nTR\nT\ne\nTR\nT\nTR\ne\nTR\nd\nSNR\nd\nT\nTR\nT\nTR\n=\n⇒\n=\n-\n=\n-\n-\n\nTherefore, to maximize the signal to noise, choose TR = T1/2. For example, for gray-white matter in the\nbrain, choose TR ~ 800 ms, since T1(gray) ~ 1700 ms and T1(white) ~ 1500 ms.\n\nIf we want to measure T1, we should measure multiple points in order to get an appropriate fit. We can\nobtain a nice linear equation to fit T1 to:\n\n(\n)\n( )\n( )\n(\n)\n( )\n( )\n(\n)\n[\n]\n( )\n[\n]\nln\nln\nT\nTR\nSI\nTR\nSI\nSI\ne\nSI\nTR\nSI\nSI\ne\nSI\nTR\nSI\nT\nTR\nT\nTR\n-\ninf\n=\n-\ninf\ninf\n=\n-\ninf\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\ninf\n=\n-\n-\n\nThere remains one question: How do we measure T1 most efficiently? i.e. for a given total image time,\nhow many points would you measure with how many Nave? It all depends on the total imaging time, T1\n(sample) and T1 (range of samples).\n\nInversion Recovery\n\n3 4\n1 2\n7 8\n5 6\n\nTI\nTR\n\nFigure 50 - Inversion Recovery Pulse Sequence\n\nAssume that TR >> T1\n\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n( )\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n+\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n-\n=\n=\n=\n-\n-\n-\n-\nT\nTI\no\nx\nz\nT\nTI\no\nx\nT\nTI\nz\nT\nTI\no\nz\nx\no\nz\nx\no\nz\ne\nM\nM\nM\ne\nM\nM\ne\nM\ne\nM\nM\nM\nM\nM\nM\nM\nM\n\nSince TR >> T1, Mx(8) = Mx(4) i.e. equilibrium is immediately reached. This is much like the SR\nequation, however the dynamic range is increased by 2.\n\nSignal Intensity\nC = contrast\nbetween tissues\nC\nlong T1\nshort T1\nTI\n\nFigure 51 - Signal Intensity as a Function of TI\n\nAgain, optimum contrast can be defined. If TR is not >> T1, things become tricky. Nevertheless, we can\nuse SI(TI) to measure T1 as in SR. This is traditionally done when total time is not at a premium, as in\nspectroscopic measurements. We can also make images which reflect T1 or T1 rate (1/T1).\n\nT2 Weighted Images:\n\nTo reflect T2 differences in tissue, do a spin echo experiment\n\n3 4\n1 2\nTE\n7 8\n5 6\n\nTR\n\nFigure 52 - Spin Echo Pulse Sequence\n\nIf TR >> T1, then\n\nT\nTE\noe\nkM\nSI\n-\n=\n\nWhat is TR is not >> T1?\n\n2 3\n0 1\n\n4 5\nTR - 1/2TE\nTE\n\nFigure 53 - Spin Echo Pulse Sequence\n\nAs before, compute Mz and look at the signal intensity proportional to Mxy after the 90o pulse.\n\n( )\n( )\n( )\n( )\n(\n)\n( )\n(\n)\n(\n)\n(\n)\n/\n/\n/\nT\nTR\nT\nTE\nTR\no\nT\nTE\nTR\nz\nT\nTE\nTR\no\nz\nT\nTE\no\nz\nz\nT\nTE\no\nz\ne\ne\nM\ne\nM\ne\nM\nM\ne\nM\nM\nM\ne\nM\nM\n-\n-\n-\n-\n-\n-\n-\n-\n-\n+\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n+\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n-\n=\n-\n=\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n\nNow compute Mxy\n\n( )\n( )\n( )\n( )\nT\nTE\nxy\nxy\nz\nxy\ne\nM\nM\nM\nM\n-\n=\n=\n\nIf TE << TR, then\n\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n∝\n-\n-\nT\nTR\no\nT\nTE\ne\nM\ne\nSI\n\nSignal Intensity\n\nC = contrast\nbetween tissues\nC\nlong T2\nshort T2\nTE\n\nFigure 54 - Signal Intensity as a Function of TE\n\nTherefore,\nlong T2 ⇒ bright image\n\nshort T2 ⇒ dark image\n\nWhere is the maximum contrast point?\n\n(\n)\n(\n)\n(\n)\nT\nTE\ndT\nT\nTE\nT\ne\nTE\nd\nSI\nd\ndT\nT\nTEe\nM\nSI\nd\ne\nM\nSI\nT\nTE\nT\nTE\no\nT\nTE\no\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛-\n=\n=\n∝\n-\n-\n-\n\nFor maximum contrast, choose TE = T2.\n\nWhat if TR ≈ T1? Remember that long T1 ⇒ dark image and a long T2 ⇒ bright image. These are\ncompeting contrasts. Often, tissues with long T2 have long T1.\n\nSignal Intensity\n\nlong T2 & T1\nshort T2 & T1\nTE\n\nFigure 55 - Signal Intensity for Both Long and Short T1 and T2\n\nSo for long TE, T2 will dominate, but for short TE, T1 will dominate.\n\nExample\n\nT1 = 500 ms\nT2 = 50 ms\nSet TR = T1 (maximum T1 contrast)\n\nIf TE = 30 ms (typical value), then ∆SI ≈ 0\n\nSignal Intensity\n\nlong T2 & T1\nshort T2 & T1\nTE\n\nFigure 56 - An Example of Poor Parameter Choices\n\nThus the maximum contrast T1 weighted image is in fact a very poor choice if TEmin = 30 ms. To get\nmaximum T1 contrast from SE images, you need to set TEmin as small as possible.\n\nTime Parameter\nT1 Weighted\nT2 Weighted\nρ Weighted\nTR\nT1/2\n>> 3T1\n>> 3T1\nTE\nTEmin\nT2\nTEmin\n\nSmall Tip Angle\n\nWhat if the tip angles are not exactly 90o or 180o?\n\n2 3\n0 1\ngradient echo\n4 5\nα\nα\nα\n\nTR\nTR\n\nFigure 57 - Small Tip Angle Pulse Sequence\n\n( )\n( )\n( )\n( )\n( )\n( )\nα\nα\nsin\ncos\nz\nx\nz\nz\nx\no\nz\nM\nM\nM\nM\nM\nM\nM\n=\n=\n=\n=\n\nNow assume that all transverse magnetization (Mx) is lost in TR.\n\n( )\n( )\n( )\n( )\n( )\n( )\n( )\nα\nα\nsin\ncos\nz\nx\nz\nz\nx\nT\nTR\nz\nT\nTR\no\nz\nM\nM\nM\nM\nM\ne\nM\ne\nM\nM\n=\n=\n=\n+\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n-\n-\n\nWe could march down to 4 and 5, but that would get messy. A better way of looking at this problem is by\nassuming that there have already been many pulses prior to 0 and that the system has reached equilibrium.\nIn this situation, Mz(2) = Mz(0).\n\n( )\n( )\n( )\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n+\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n-\n-\n-\n-\nα\nα\ncos\ncos\nT\nTR\nT\nTR\no\nz\nT\nTR\nz\nT\nTR\no\nz\ne\ne\nM\nM\ne\nM\ne\nM\nM\n\nIf α = 90o, then we recover\n(\n)\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n-\nT\nTR\no\nz\ne\nM\nequil\nM\n. The signal intensity is then given by:\n\n(\n)\nα\nα\nα\ncos\nsin\nsin\nT\nTR\nT\nTR\no\nz\nx\ne\ne\nM\nSI\nequil\nM\nM\nSI\n-\n-\n-\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n=\n=\n∝\n\nWe can maximize this expression with respect to α to obtain an expression for α which maximizes Mx for\na give TR. This angle is known as the Ernst angle. However, the Ernst angle may not give the maximum\nT1 contrast-to-noise ratio. The T1 contrast is large for large α and is small for small α (SNR drops for\nboth cases).\n\nFor a real gradient echo experiment, there is also a T2\n* decay term. The signal intensity is therefore:\n\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n∝\n-\n-\n-\nα\nα\ncos\nsin\n*\nT\nTR\nT\nTR\no\nT\nTE\ne\ne\nM\ne\nSI\n\nThis also assumes that T2 < TR. If this is not the case, \"steady state\" can occur and new expressions are\nneeded.\n\nCHAPTER 8: CHEMICAL SHIFT IMAGING\n\nHow can we combine spectral and spatial information? In conventional NMR imaging, there have\nhistorically been three models:\n\n(1) Point methods (e.g. TMR to define a point and then move the point or the object)\n(2) Sensitive lines\n(3) Sensitive planes and volumes\n\nHow can we spatially encode without disrupting the chemical shift information? Typically, imaging\ngradients are on the order of 0.1 - 1.0 G/cm or 1.0 - 10.0 ppm/point, as expected since we need ∆ωgradient\n> ∆ωlinewidth / pixel. If chemical shifts are greater than the line widths, then we have:\n\nlinewidth\npixel\ngradient\nshift\nω\nω\nω\nω\n∆\n>\n∆\n>\n∆\n>\n∆\n\nTwo spectral lines\n*\nω\n\nFigure 58 - Convolution of an Object With Two Spectral Lines\n\nWe get two separate images, one for each peak. Obviously though, this places severe constraints on\nhomogeneity and requires large chemical shifts and narrow line widths. This is a good technique for an\nelement like Fluorine. For protons, which have a chemical shift of ~ 5 ppm, this is impossible.\n\nWhy not then simply deconvolve the spectra with the projection acquired using a larger (relative)\ngradient?\n\nFigure 59 - Chemical Shift Artifact\n*\na b c\n\nThis can be done, but this supposes that we know (a) in Figure 59 everywhere and of course it is what we\nare hoping to measure, since it varies across the object. The image (c) which results is exactly what is\nseen with the chemical shift artifact. The shift can be quantified as follows:\n\nIn cm\nIn Pixels\n\n(\n)\nx\no\nppm\nG\nx\nγ\nω\nω\nδ\nω\n∆\n=\n∆\n=\n∆\n\nTDCT\npo\nHz\n⋅\n∆\n=\n∆\nω\nω\nint\n/\n\nThe problem would get very complex for more complex lines shapes as well.\n\n3-D Chemical Shift Imaging\n\nWhat we would really like to do is read our signal without the presence of a gradient.\n\n( )\n(\n)\n( )\n(\n)\ny\nx\nS\nd\ne\ny\nx\nt\nS\nt\ni\n,\n,\n,\n,\nω\nρ\nω\nω\nω\nρ\nω\n=\n= ∫\n\nHow can we spatially encode? Why not use phase encoding:\n\n(\n)\n(\n)\n[\n]\n(\n)\n[\n]\n(\n)\n(\n)\ny\nx\ny\nx\nS\nm\nn\nt\nS\nFT\ndxdyd\ne\ny\nx\nm\nn\nt\nS\nm\nG\nn\nG\nt\ni\ny\nx\n,\n,\n,\n,\n,\n,\n,\n,\n,\n,\nω\nρ\nω\nω\nω\nρ\nτ\nγ\nτ\nγ\nω\n=\n=\n= ∫∫∫\n+\n+\n\nThis becomes a 3-D object with two spatial dimensions and one frequency dimension. It is possible to\nperform a 4-D chemical shift image if we also phase encode in the third dimension. The frequency axis in\nFigure 61 includes both δ and Bo inhomogeneities; therefore, the lines are actually curved. If δ is kept\nconstant (i.e. a vial of water), the inhomogeneities in Bo can be mapped using this technique. It should be\nnoted that this technique is very efficient at low concentrations.\n\nFigure 60 - 3-D Chemical Shift Pulse Sequence\nRF\nGz\nGx\nS(t)\n180o\nGy\n\nω\ny\n∆ω\n\nx\n\nFigure 61 - 3-D Chemical Shift Image\n\nPhase Contrast Imaging\n\nAt higher concentrations, it is possible to phase encode the chemical shift instead of the position. This is\ndone by off-setting the spin echo and the gradient echo in a typical spin echo pulse sequence. This can be\ndone by moving the 180o pulse by τ/2. The echo still occurs at t = TE since the gradient echo dominates\nthe inhomogeneities. The spin echo will occur at TE - τ. Since the spin echo refocuses the chemical\nshifts in an object, different chemical species will pick up different phase shifts during the time τ between\nthe spin echo and the gradient echo.\n\n180o\nRF\nGz\nGx\nS(t)\nSE τ GE\nτ/2\nGy\n\nFigure 62 - Phase Encoding Chemical Shift (SHUFFLEBUTT sequence)\n\n(\n)\nHz\nτδ\nω\nτ\n=\n∆\n=\n∆Φ\n\nTherefore,\n\n(\n)\n(\n)\n(\n)\n∫\n+\n+\n=\nδ\nδ\nρ\nτ\nδ\nγ\nγ\ndxdyd\ne\ny\nx\nn\nt\nS\nt\nyn\nG\nxt\nG\ni\ny\nx\n,\n,\n,\n,\n\nBy sampling a range of τ values, we can raster through k space. By sampling m different τ steps, we can\nobtain an m-point frequency spectrum.\n\nThis technique gives great spatial resolution but less spectral resolution. This is a valuable when the\nspectrum is simple (fat and water) since you can keep one \"higher resolution\" spatial axis. For example,\nproton imaging is mostly dominated by lipids and water which are 3.5 ppm apart and are present in molar\nconcentrations. In this case, we can further simplify the SHUFFLEBUTT sequence.\n\nDixon Method\n\nSet\n(\n)\nHz\nδ\nτ\n=\n. This is designed to make lipid and water 180o out of phase: therefore, the image will be\na difference of water and fat (W-F). By taking a conventional \"in phase\" image where the spin echo and\ngradient echo occur at the same time, you obtain an image of W+F. Adding these two images will give a\npure water image and subtracting the two will give a pure fat image.\n\nWater + Fat\n\nIn phase\n\nWater - Fat\n\nOut of Phase (OOPS)\n\nAdd\n\n2 Water\nA pure water image\n\nSubtract\n2 Fat\nA pure fat image\n\nThis technique will work if there are only two spectral lines. We are also assuming that we are looking at\nthe \"real\" data and not just its magnitude.\n\nSelective Saturation/Excitation\n\nIf you spectra is simple, and we have good homogeneity, we could produce a water image by only\nexciting the water line. This can be done by tuning the FR pulse to the water frequency. Equivalently,\nwe could presaturate the fat line by applying an RF pulse tuned to the fat frequency prior to the\nexperiment. This will cause the fat spins to lie in the transverse plane and as such, when the first slice\nselective 90o pulse is applied, only the water spins will provide a signal. Inhomogeneities in the magnet\nwill cause the water and fat spectral line to broaden. Due to this line broadening, the pre-saturation pulse\nmay not saturate all of the fat spins but may saturate some of the water spins. To avoid this, the Bo\ninhomogeneities must be made as small as possible by shimming the magnet.\n\nThis type of chemical shift imaging is important when dealing with very low concentrations, i.e. lactate.\nIn-vivo lactate has a concentration on the order of mM while water has a concentration on the order of\n80M. By performing a water suppression pulse, it might be possible to see the lactate. Unfortunately, the\nchemical shift of lactate is identical to the chemical shift of fat. The lactate line is therefore buried in the\n100 M line of fat. We can suppress the lipid line base on the J-coupling.\n\nBinomial Excitation\n\nδ = frequency difference\nbetween the wanted and\nunwanted peaks\nδ\nτ\n/\n=\n45 45\n\nFigure 63 - Binomial Excitation Pulse Sequence\nτ\n\nWhat do we see?\n\nM1\nM2\n⇒\nM1\nM1\nM2\n⇒\nM2\nτ\n⇒\n\nM1 M2\n\nFigure 64 - Schematic of Spins Undergoing Binomial Excitation\n\nIf we made the second 45o pulse negative, we obtain a signal from M1 as opposed to M2. We can only\nsee one peak IF we can clearly separate each peak over the whole object (i.e. small inhomogeneities).\nThis kind of water suppression is needed to do in-vivo proton CSI (3-D). We can also perform higher\norder binomial excitations (1:2:1, 1:3:3:1, etc.), to give more precise excitations.\n\nSTIR - Short TI Inversion Recovery\n\nSignal\nIntensity\nfat\nwater\n\nTI\n\nFigure 65 - Null Point TI\n\nBy performing an inversion recovery sequence, we can choose TI such that the fat signal is passing\nthrough its null point. This method is very dependent on the values of T1.\n\nCHAPTER 9: FLOW IMAGING\n\n(1) Time of Flight (TOF) or Flow Related Enhancement (FRE)\n\nTR\nV\n∆x\nstat\nflow\nd\nV\nstat\n\n∆x = V (TR)\n\nd\n\nFigure 66 - Imaging Spins Flowing With Speed V\n\nWhat is the signal for stationary and flowing spins? (assume a 90o - 90o pulse sequence)\n\n(a) stationary:\nd\ne\nSI\nstat\nT\nTR\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n∝\n-\n-\nρ\n\n(b) moving:\n(\n)\n⎪⎪\n⎩\n⎪⎪\n⎨\n⎧\n>\n⋅\n⋅\n<\n⋅\n⋅\n⋅\n+\n⋅\n-\n⎟\n⎟\n⎠\n⎞\n⎜\n⎜\n⎝\n⎛\n-\n∝\n-\n-\nd\nTR\nV\nd\nd\nTR\nV\nTR\nV\nTR\nV\nd\ne\nSI\nflow\nT\nTR\nρ\nρ\nρ\n\nThe signal will actually fall off at high V leading to \"flow void\": absent signal within fast moving blood\nvessels (Figure 67). This is due to the fact that during a spin echo, the spins will move out of the slice\nduring TE/2: V > 2d/TE.\n\n(2) Phase Velocity Imaging\n\nIf we turn on a gradient during the experiment, the spins will accumulate some phase. If the gradient is\nturned on immediately after the 90o pulse for a time t, then the phase that is accumulated is:\n. In a constant gradient, if two spins are located at x = 0, one is stationary and one is\nmoving at velocity V, then ∆B = G\n∫∆\n=\n∆\nBdt\nγ\nφ\nx x.\n\nFigure 67 - Signal Intensity as a Function of Velocity\nActual SE\nParadoxical\nenhancement\nGE\ntheoretical\nSI\nV\n\nGVt\nGVtdt\nGxdt\nB\nB\nt\nt\nmoving\nstationary\nγ\nγ\nγ\n=\n=\n=\n∆\n=\n∆\n∫\n∫\n\nFor a spin echo experiment, the phase accumulated before the 180o pulse is reversed and the phase\naccumulated after the 180o pulse is additive:\n\n90 180\n\nG\n\nFigure 68 - Spin Echo With Gradient\n\n(\n)\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎣\n⎡\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n+\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n-\n=\n+\n-\n=\n∆\n∫\n∫\n/\n/\nTE\nTE\nTE\nGV\nGVtdt\nGVtdt\nTE\nTE\nTE\nTE\nSE\nγ\nγ\nγ\nφ\n\n(\n)\n1 GVt\nTE\nSE\nγ\nφ\n=\n∆\n\nFor a multi-echo experiment,\n\n90 180\n90 180\nS2\nS1\nG\n\nFigure 69 - Multi-echo Experiment\n\nWe know what the phase accumulation is for S1. What about for S2?\n\n(1) Phase accumulated before the first 180o pulse is positive since it is \"flipped\" twice.\n(2) Phase accumulated between the 180o pulses is reversed.\n(3) Phase accumulated after the second 180o pulse is positive again.\n\n(\n)\n/\n/\n/\n/\n=\n⎥⎦\n⎤\n⎢⎣\n⎡\n+\n-\n=\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎣\n⎡\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎣\n⎡\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n+\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎣\n⎡\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n=\n+\n-\n=\n∆\n∫\n∫\n∫\nTE\nTE\nTE\nGV\nTE\nTE\nTE\nTE\nTE\nGV\nGVtdt\nGVtdt\nGVtdt\nTE\nTE\nTE\nTE\nTE\nγ\nγ\nγ\nγ\nγ\nφ\n\nThere is no net phase accumulation on the second echo (assuming constant V). This is actually true for\nall even echoes. Moving spins show no phase shift on even echoes. We still have a net phase shift on all\nodd echoes.\n\nIs it useful? Look at a geometric interpretation of even echo rephrasing.\n\nTE/2 TE TE/2\nEqual areas on top on bottom\n\nφ = area of ∫Gxdt\nγ\n\n= (\n)t\nGVt\nγ\n\nt\nVt\n\nFigure 70 - Geometric Interpretation of Even Echo Rephasing\n\nHow can we use this? Lot of ways!\nGV\nTE ⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n=\n1 γ\nφ\n\n(1) Phase encode\n\nNote that (again!) we have a phase term proportional to a gradient and a quantity of interest\n(velocity) ... why not phase encode! (Figure 71)\n\n(\n)\n(\n)\n∫\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n+\n+\n=\ndxdydV\ne\nV\ny\nx\nm\nn\nt\nS\nmV\nG\nyn\nG\nxt\nG\ni\nVE\ny\nx\n,\n,\n,\n,\nτ\nγ\nγ\nγ\nρ\n\nThis gives us a 3-D object with the third dimension being the z-axis velocity.\n\n(2) Zebra Imaging\n\n2-D FT imaging gives a phase-velocity relationship:\n, where k depends on the\nduration and amplitude of G\nTE\nkVx\n∝\n∆φ\nx. Other gradients (Gz and Gy) affect the signal to a lesser extent\nsince they are on less long. If the flow is laminar, then the phase shift is proportional to velocity.\n\nIn a magnitude image, we are insensitive to phase. We can display the \"imaginary\" component of\nthe signal to get:\n\n( )\nφ\nsin\n∝\nSI\n\n(a) for a small φ,\nV\nSI\n∝\n∝φ\n\n(b) for a large φ, we get redundancy\n\nHow can we clear this ambiguity?\n\n1. Put on a \"first order\" phase shift mX, such that φ = kx. We can do this by displacing\nthe echo in the data collection period - a translation in t = phase shift in w. If we\nhave moving spins, their phase shift is additive with the stationary phase shift, such\nthat\nV\nk\nkx\n'\n+\n=\nφ\n(Figure 72). We can now see large phase shifts and if there are\nslower flow rates, there is no ambiguity. If we know k, we can measure V.\n\nRF\nGz\nGx\nS(t)\nphase encode\nfrequency encoding\nSlice select and\nbipolar velocity\nencoding\nvelocity encoding gradient\nGy\nFigure 71 - Velocity Encoding Pulse Sequence\n\nZebra Strips ∆φ α kV\n\nFigure 72 - Zebra Imaging\n\n(3) Projective Imaging\n\nVessels do not lie in a plane often. In order to see them, we need to take projections, either in acquisition\nor post-processing.\n\nFigure 73 - Projection Image Along z\n\nTo do this with MR, simply turn off the slice selective gradient and use hard pulses. It is also possible to\nacquire a 3-D data set and project in post-processing. How can we \"pick out\" the blood vessels? In\nconventional x-ray angiography, inject a lot of x-ray dye with iodine to absorb x-rays. In Digital\nSubtraction Angiography (DSA), use less x-ray dye but subtract a background image. All that is left is\nwhat change which will be the blood vessels (without dye in background image and with dye in second\nimage). In MR, we use the concept of phase contrast.\n\n1. If we take an \"imaginary\" image (\n)\nφ\nsin\n∝\nSI\n, then\n=\nstationary\nSI\nand\nfor\nsmall V (or k). If we took an \"imaginary\" projective image, we would have a flow projective\nimage (an MR arterio/venogram). However, this assumes a good phase stability across the\nwhole object which is hard to get at high field strengths.\nV\nSI moving ∝\n2. How about a subtraction? If k or V is large, we get large phase twists across the vessel.\n\nstat moving\nstat moving\n+\n=\n+\n=\n(a) (b)\n\nFigure 74 - Fast vs. Slow Moving Spins\n\nSubtract a from b = Flow image.\n\n1. large vs. small V - diastolic/systolic gating\n2. large vs. small k - change the gradient waveform\n\n(4) Flow Compensation Gradients\n\nLet's start with a 2 echo experiment. We know that the second echo is rephrased (i.e. k = 0). Now play\nsome games!\n\nStep 1\n90 180\nTE/2\nTE/2\nTE/2\nTE\n90 90\nStep 2\nG.E.\n\nTE/2\n90 90 180\nTE/2\nS.E.\nStep 2\nFigure 75 - Gradient Moment Nulling\n\nA bipolar readout gradient will have k = 0 for a S.E. A binomial 1:2:1 readout will have k = 0 for a G.E.\nIf the gradients are not exactly so balanced, then k = 0. Higher order binomial gradient pulses null ∆φ for\nhigher order motions (e.g. acceleration is nulled with a 1:3:3:1 sequence). Therefore, another way of\ndoing subtraction angiography is to interleave sequences with different k, (k = 0 and k = 0). Subtracting\none image from the other will provide flow information.\n\nCHAPTER 10: MICROSCOPIC MOTIONS\n\nIs it possible to measure the diffusion of water with MR? Assume a random walk model. In this\nsituation, there is no average displacement, i.e. <x> = 0. But, <x2> = 2Dt, where D = diffusion\ncoefficient. In 3-D, <x2> = 6Dt, (D = cm2/s). Thus,\nt\nx\n∝\n. How does this affect the MR signal?\nWhat is the phase accumulation of one spin?\n\n( ) ( )\n( )\n!0\n=\n=\n=\n=\n∫\n∫\nδ\nγ\nγ\nγ\nφ\nδ\nδ\nx\ng\ndt\nt\nx\ng\ndt\nt\nx\nt\nG\n\nThere is no net phase accumulation because the average is zero. However, if we look at higher order\nterms:\n\nD\ng\nD\ng\nx\ng\nδ\nγ\nδ\nδ\nγ\nδ\nγ\nφ\n=\n=\n=\n\nFor random walk, we get a Gaussian distribution of displacements (x), leading to a Gaussian distribution\nof phases. Therefore,\n\nD\ng\no\no\ne\nS\ne\nS\nS\nδ\nγ\nφ\n-\n-\n=\n=\n\nWe can obtain a measure for D now:\nln\nδ\nγ g\nS\nS\nD\no ⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n-\n=\n. Diffusion effects vary as 1/t3. This is different\nfrom T2 effects which vary as 1/t. It is therefore possible to separate T2 effects from diffusion effects.\n\nFor a typical spin echo experiment, the 180o pulse does not completely refocus diffusion effects, because\nthe inhomogeneities aren't static. For a spin echo with constant gradient g,\n\nD\nTE\ng\nS\nS\no\nln\nγ\n-\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n\nHow does this predict Hahn vs. CPMG?\n\nHahn\n\n90o\n\n180o\nCPMG\n90o\n180o\n180o\n180o\nτ\nD\nTE\ng\nS\nS\no\n⋅\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\nln\nτ\nγ\nTE\nTE\nFigure 76 - Hahn vs. CPMG Pulse Sequence\n\nFor a multiecho sequence, # of echoes\nτ\nTE\nn =\n. Therefore:\n\nln\nn\nTE\nD\ng\nS\nS\nCPMG\no\n⋅\n-\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\nγ\n\nand the attenuation goes down as n increases. So for large n:\nln\nT\nTE\nS\nS\no\n-\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\nand for n = 1:\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\n+\n-\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\nD\nTE\ng\nT\nTE\nS\nS\no\nln\nγ\n. We can separate D from T2 by subtraction.\n\nIt is also possible to change the gradient strength or the duration of the gradient. Look at pulsed\nsequence:\n\nFigure 77 - Stejskal-Tanner Sequence\nt t\nT\n90o\n\n180o\n\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n-\n-\n=\n⎟⎟\n⎠\n⎞\n⎜⎜\n⎝\n⎛\nln\nt\nT\nt\ng\nD\nS\nS\no\nγ\n\nThis is known as the Stejskal-Tanner equation. It can be used in imaging if the read gradient is small or if\nit is explicitly corrected for.\n\nWhat happens if <x2> = 2Dt? This could happen if barriers prevented free diffusion. This is observed in\ntissue and is labeled restricted diffusion. In vivo, we may actually get retarded diffusion.\n\nFigure 78 -Restricted Diffusion\nt\n\nT\n\nrestricted\ndiffusion\n<x2>\n\nD\n\nCHAPTER 11: RAPID IMAGING\n\nImaging time =\nave\nN\nexcitation\nPES\nPES\nTR\n/\nwhere PES = Phase Encoding Steps. To reduce this time, we\nmust reduce one of the factors.\n\n(1) To reduce Nave (NEX) implies high SNR, an increased Bo and decreased resolution.\n(2) \"Half Fourier\" or \"half NEX\": Since the object is a real function, its Fourier Transform shows\nconjugate symmetry:\n\nB\n\nA\n\nA*\n\nB*\nkx\nky\n\nFigure 79 - Conjugate Symmetry of k-space\n\nSo in principle, half of k-space is conjugate.\n\n(a) half in time ⇒ short TE's\n\n(b) half in pseudo time ⇒ lower imaging time (labeling half NEX)\n\n3a) Reduce TR - FLASH/GRASS -\n\n- Implies gradient echoes to avoid ML inversion\n\n- Small tip angles\n\n- Steady state or \"spoiled\"\n\n3b) \"Turbo\" FLASH - Very short TR/TE (but this leads to little T1/T2 contrast) - To improve the contrast,\nperform magnetization preparation:\n\nFigure 80 - IR Turbo Flash\n\n(4) Increase # of PES/RF excitation\n\n(a) RARE or \"Fast Spin Echo\" - Do a CPMG with addition of PES during each echo\n\nFigure 81 - Fast Spin Echo Sequence\n\nCurrently, there are 8-32 180o pulses per excitation. The advantage is that this is 8-32 times faster than\nconventional T1 and T2 contrast images. The disadvantage is that lots of 180o pulses produce RF heating\nover a long acquisition.\n\n(b) Spiral Scan:\nky\nkx\n90 180 180 180 180\nBuild up phase\ntwist\nGx\nGy\nTI\nT1\n90x\n180y 90-x\nα\nα\n\nT2\n\nFigure 82 - Spiral Scan Through k-Space\n\nCurrently, interleave 8 such scans to cover k-space.\n\n(c)\n\nkx\nky\n\nFigure 83 - EPI Scan Through k-space"
    },
    {
      "category": "Resource",
      "title": "imageencoding.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-584j-magnetic-resonance-analytic-biochemical-and-imaging-techniques-spring-2006/48c03af16122e89ee22fa7a4a8820056_imageencoding.pdf",
      "content": "MR Image Encoding L. Wald MGH-NMR Center\nMR Image Encoding\n\nIntroduction\n\nMuch of the success and flexibility of MRI is derived by its peculiar methodology; a set\nof techniques which has proved to be very flexible and informative for probing the properties of\ncomplex materials (such as the brain). MR imaging is fundamentally different from other types\nof imaging. Conventionally, when physicists refer to \"imaging\" they refer to a scattering\nexperiment. Since our eyes \"see\" a rock by forming a 2 dimensional array of light intensity\namplitudes being scattered off the rock, the instrumental equivalent of this has come to be\nsynonymous with imaging. In the canonical scattering experiment, \"rays\" are aimed at an object\nand then detected as they either scatter off of the object or penetrate through it. The rays can be\ndeflected, lose or gain energy, deflect and then interfere with one another or even be converted\nfrom one type of ray to another. The \"rays\" in question are usually electromagnetic radiation\n(radio waves, microwaves infra red light, visible light, ultraviolet light, x-rays, or gamma rays)\nbut can, of course, be almost anything including sound waves, water waves, or matter waves\n(particles). The particles used could be electrons (as in electron microscopy), or any of the\nzillions of other subatomic particles, or clumps of particles such as nuclei, atoms, molecules, or\npieces of dirt.\n\nA fundamental limitation of scattering experiments is that the resolution of the image\ncannot exceed the wavelength of the wave (electromagnetic or matter wave) used to probe the\nobject. This is fundamentally derived from the uncertainty principle but has long been\nunderstood in classical optics. Physicists are fond of making such general statements, but,\nwhile true for scattering experiments, this imaging \"law\" does not hold for MRI. In MR, we use\nradio waves with a wavelength of several meters to image at a sub-millimeter resolution. Thus\nwe exceed this \"fundamental\" imaging law by several orders of magnitude. How? The short\nanswer is that we don't determine the distribution of the body's protons by bouncing stuff off of\nthem; we determine it by asking them to report to us where they are. We query the body's spins\nusing a burst of radio waves (the excitation RF), and they report back some milliseconds later\nwith a faint radio signal of their own. They declare their location and other even more valuable\ninformation encoded in the frequency and phase of the burst of RF energy they emit in response\n(the MR signal or echo).\n\nMR Image Encoding\n\nReview of the basic NMR experiment\nThe previous lectures reviewed the basic equations\nof motions of the proton spin placed in a static, uniform magnetic field. The state of a given\nspin is either parallel or anti-parallel to the static field. Since the parallel state is slightly\nenergetically more favorable, a slim majority are found in this state. When the vector sum of all\nof the spins is considered, there is almost a complete cancellation between the aligned and anti-\naligned spins; the net magnetization consists of the only the slight excess aligned with the\nmagnetic field. Since the other spins always have a canceling partner, we do not detect them\nand only the small (~0.01%) excess aligned magnetization, Mo, will be considered. Although\nquantum mechanics tells us that a measurement of the energy of a single spin system will result\nin only 2 answers (the energy of the aligned or anti-aligned state.) We know that the spin's\nwavefunction can exist in a time dependent superposition state of these two energy eigen states.\nThe spin's state can also have a projection along the x or y axis. The ensemble average of these\nHarvard-MIT Division of Health Sciences and Technology\nHST.584J: Magnetic Resonance Analytic, Biochemical, and Imaging Techniques, Spring 2006\nCourse Directors: Dr. Bruce Rosen and Dr. Lawrence Wald\n\nMR Image Encoding L. Wald MGH-NMR Center\nsuperposition states approximates the classical gyroscopic precession equation described when\na suitably large group of non-interacting spins is considered.\n\nEncoding basics\nThe information about how this magnetization is distributed in the body is derived by\nthe frequency and phase of its precession during the detection phase of the experiment. After\nexcitation, the detected MR signal processes with a frequency given by:\n\nω = γ B(t,x,y,z).\n\nwhere γ = 2π (42.577 MHz/Tesla) for protons\n(1.1)\n\nHere B(t,x,y,z) is the total value of the magnetic field at location (x,y,z) at time t. The\nphase picked up in time τ after its initial excitation is given by:\nφ(τ) =\nω(t)dt\nτ∫\n= γ\nB(t,x,y,z)dt\nτ∫\n\n(1.2)\nIf B is uniform through the sample, then\nr\nB (x,y,z) = Bo and no interesting spatial\ninformation is learned from observing the frequency or phase of the spins precession. Since we\ncan experimentally control B(x,y,z), we can introduce a spatial dependence to phase and\nfrequency by making B vary across the object. The easiest way to do this is to apply a gradient\nto the static magnetic field.\nˆ z\n\nField gradients\n\nA linear gradient is the simplest form of variation of the static field; it is a linear increase\nin the static z field as a function of position. Since the static field is produced by current\nrunning through a large coil of wire (the magnet) and the gradient field is added to the uniform\nfield by injecting current into an additional winding, we can easily switch between a uniform\nmagnetic field and the gradient field. When an \"x gradient\" is applied the field as a function of\nposition is:\n\nr\nB (x, y,z) = B0ˆ z + Gx xˆ z where Gx is defined as: Gx = ∂Bz/∂x\n\n(1.3)\n\nFig. 1.1\n\nUniform static field\n+\ngradient field\n\n=\ntotal field\n\nThen ω(x,y,z) = γ Bo + γ Gx x\n\nSince the constant γBo part is uninteresting for image encoding, we often just consider the frequency\noffset from the reference frequency at the center of the magnet (isocenter):\n\n∆ω = γ Gx x\n\n(1.4)\n\nMR Image Encoding L. Wald MGH-NMR Center\nThe applied gradient strength and is commonly measured in Gauss/cm (CGS units) or mTesla/m\n(MKS units); 1G/cm = 10mT/m. State of the art body gradient coils can produce gradient strengths of\n40mT/m. Thus, when such a gradient is on in a 1.500T magnet, the total field at x = +10cm is 1.504T,\nonly a small perturbation to the main static field.\n\nThe magnetic field gradient can be generalized to a vector: G = (∂Bz/∂x, ∂Bz/∂y, ∂Bz/∂z ) (1.5)\n\nTherefore, in general the frequency and phase of the detected MR signal is:\n\n∆\n\n(1.6)\nω = γ G\n→\n(t)⋅r\n→\n\n∆φ(τ) =\n∆ω(t)dt\nτ\n∫\n= γ\nG\n→\n(t)⋅r\n→\ndt\nτ\n∫\n\n(1.7)\n\nHere we have considered the important case where the gradient might be changing with time\nand have therefore written G(t). Typically we think of the frequency as being determined by\nwhatever B field and thus gradient is present at that the time of the measurement. Of course, it\ntakes multiple samples of the signal to calculate a frequency, so the gradient could be varying\nduring the time of the frequency measurement. But, the simplest and most common MR\nimaging strategies do not very the applied gradient during the measurement period. In\ncontrast, the phase shift is the result of a time evolution of the signal during the entire time\nperiod between the excitation of the magnetization and the time of the measurement. Even the\nsimplest MRI methods have considerable alteration of the gradients during this period, so we\nexplicitly include the time dependence of the applied gradient in the equation for phase.\n\nSlice selective excitation of a single plane through the body\n\nIn order to take 2 dimensional images which \"cut\" through the body, it is useful to excite\nonly a 2D plane of spins. Then the signal arises only from this slice. The image is formed by\nencoding the two in-plane directions. The slice selection process is achieved by applying the RF\npulse to tip the spins at the same time as a gradient. To excite a slice of spins in the xy plane, a\ngradient Gz in the z direction is used.\n\nGradient\nFig. 1.2\nB\n∆B\n∆z\nGz = ∂Bz /∂z\n\nBo\n\nz\n\nAs before the resonance frequency of the spins during the z gradient is:\n\nω(z) = γ Bo + γ Gz z\n\nNote that at z=0 (isocenter) the frequency ω = γ Bo = ωo If the frequency of the excitation RF\npulse is ω = ωo + ω', then the z location of the excited spins (and thus the slice plane) will be:\n\nMR Image Encoding L. Wald MGH-NMR Center\n\nz = ω'/ γGz\n\nIf the excitation pulse contains a range of frequencies ∆ω, then the slice will be centered at the\nabove z position but also excite spins included in the slab z ± Gz ∆z/2, where ∆z = ∆ω/γGz .\nRecall from the time-bandwidth theorem of the FT that it is impossible to form a pulse of finite\ntime duration that does not include a range of frequencies.\nThe exact nature of the range of frequencies incorporated in the RF pulse is important\nfor determining the shape of the slice profile. We control the frequencies present in the RF pulse\nby intelligently choosing the shape of the RF pulse envelope (its amplitude as a function of\ntime). Since a clean \"square\" slice profile is desired, we seek a time shape with a square\nfrequency spectrum. Recall:\n\nFig. 1.3\n\nω\nF\n∆t\nt\nF(t)\nA(ω)\n∆ω\n\nThus a sinc function with lots of side lobes provides a well defined slice profile. The amplitude\nis chosen so that the desired flip angle is achieved: θ = γ\nB1(t) dt\ninf∫\n\nFig. 1.4\n\nRF excitation pulse (sinc envelope)\n\nPhysical picture of what a gradient pulse does to the spins\n\nIn general the analysis of the pulse shape using\nthe\nFourier\ntransform\nis\nonly\na\ngood\napproximation for small flip angles. Thus, a more\ncomplicated analysis is needed for larger flip\nangles, especially slice selective inversion pulses\n(180o) (see Pauly et al.).\nAn additional complication is that during\nexcitation in the presence of a gradient, the spins\nare processing with a frequency which depends\non their location in the slice profile. Since the\nexcitation process takes a non-zero amount of\ntime (usually between 1 and 5ms), the spins will\nend up with a phase shift which is a function of\nposition in the slice direction. If this phase is\nallowed to remain, the experiment will start of\nwith the signal partially dephased. The loss due\nto the partial cancellation can be recovered by\nsimply reversing the sign of the gradient after the\nexcitation pulse for just the right amount of time\nto undo the dephasing of the excitation gradient.\n\nMR Image Encoding L. Wald MGH-NMR Center\nSince the frequency of the spins procession in the presence of a gradient field is a linear function of\nequency and thus a linear function of position, its easy to imaging that we can learn where a given\nroup of spins is located (in one direction at least) by measuring their frequency. All we need to do is\nof a gradient field) into a histogram of the\nequencies present in the signal (the spectrum). We do this by taking the Fourier transform of the\nSimilar infor\nained\nthe phase of the signal. The phase of the MR signal from a voxel\nll of spins depends on their position and the entire history of the gradients applied from excitation\nefinition of zero phase) to measurement. Although less intuitively obvious how to utilize the phase\nformation, several\nnt aspects of MR image encoding are best understood by examining\npatial pattern in phase after application of a gradient. Consider the what happens after a y gradient\n\nτ\nConsider the effect\na helix of magnetization by briefly turning on a gradient\nulse. At first glance it appears that if the object (a bottle of water for example) extends over\nagnetization vectors and no observed signal. For every voxel in a position such that the\nfr\ng\ndeconstruct the time domain NMR signal (in the presence\nfr\nobserved signal. For obvious reasons, this method is called frequency encoding. The particular use of\na gradient during acquisition of the signal is called the \"readout gradient\" and the direction of the\ngradient (and thus the encoded direction) is called the \"readout direction\". A diagram of the\nexperiment might look like:\n\nFig. 1.5\n\nR\nS(t)\nt\nGz\nGx\n\"slice\n\"readout\n\nmation is cont\nin\nfu\n(d\nin\nimporta\ns\n(Gy) is turned on for a brief period τ prior to sampling the MR signal. The MR signal is sampled after\nthe gradient is turned off, so during the sampling there is no spread of frequencies due to the gradient;\nall the spins in the head are precessing at ωo = γB o. During the gradient pulse itself, spins at different y\nlocations precess at different frequencies and over the time period τ a spin at location y will gain a\nphase shift of ∆φ = τ ∆ω(y) = (γ τ ) compared to the reference spins at y=0. The relative phase\nshift is linear with y. If you represent the magnetization vectors in space they will form a helix along\nthe y axis. The larger the gradient Gy or the longer it is left on (τ), the tighter the helix of magnetization\nwill be wound. After the gradient is turned off, the helix remains since the spins return to an identical\nprecession frequency.\n\nFig. 1.6\n\nSmall τ\nlarger τ\nlarge\n\nof winding\np\nmore than one cycle of the helix, then there would be complete cancellation of the\nm\nall y locs\nprocess at\nall y locs\nprocess at\nsame freq.\nsame freq.\nFreq. α\ny loc.\nGy\nt\nple\nSam\ny\nGy y\n\nMR Image Encoding L. Wald MGH-NMR Center\nmagnetization had a phase of φ, one can find a voxel at a different location with a phase of -φ.\nl\nnother way of looking at it is that applying a gradient pulse before measurement provides a\neasurement of a single spatial frequency component. In the case above, the gradient\nmplitude and duration are set to select the signal from anatomy with a 1cm periodicity. With a\nsingle t\nch the 1cm-1\npatial frequency of the object contributes to the whole. If you desire an image with 1mm spatial\nficient if you leave it on. Thus\none readout period we typically sample 256 points all with different helicities and thus 256\nout direction. In conventional MR\nmpling. So a large negative gradient winds a helix of the\negative sense, then reverse the direction of the gradient and start sampling the signal. The\ninitial samples still have the large negatively wound helix which the positive gradient unwinds\nThis is in fact the case for a uniform sample. It becomes more interesting if the sample has some\nwell-defined spatial periodicity. If the gradient strength and timing are chosen so that the helix\nhas the same periodicity as the sample (1cm is the example below), then there is no cancellation\nof the magnetization vectors and the MR signal is as large as it would be if no gradient pulse\nwere applied.\n\nFig. 1.7\n\n1 cm\nU\nN\nI\nF\nO\nR\n\nUniform sample produces no signa\nPeriodic sample produces full signal\n\nA\nm\na\nime-point measurement, we have determined the amplitude and phase whi\ns\nresolution, then you must acquire spatial frequencies up to 1mm-1. Clearly with enough\nmeasurements of different spatial frequency components in the 2 orthogonal directions, we\ncould reconstruct the object with a Fourier transform from spatial frequency space to object\nspace. Blipping on a gradient to wind a helix and then sample the MR signal for a measure of\na spatial frequency component is referred to as phase encoding.\n\nSpin warp imaging (the bread and butter MR encoding method)\nReconsidering frequency encoding it is clear that a similar helix is wound, the only\ndifference is that you continuously sample the spatial frequencies as the helix gets tighter and\ntighter. There is no real need to turn the gradient off; its more ef\nin\nspatial frequency components of the object in the read\nimaging, one readout measurement (of 256 or 512 kspace samples) is taken per excitation. Thus\nin a single excitation, the spatial frequencies of the readout direction are fully sampled. Again, if\nyou want an image with 1mm spatial resolution, you must make sure Gx t, is large enough so\nthat the maximum spatial frequency sampled is at least 1mm-1. Of course there are two ways to\nachieve this, Gx can be big or the sampling t can extend for a long time. As we will discuss, there\nare reasons not to sample too long.\n\nGradient echo In practice frequency encoding is sufficiently efficient that it is useful to\nacquire some redundant information in by sampling both a negatively wound helix and a\npositively wound helix. The negative sense is obtained by simply applying a negative gradient\nfor some period of time prior to sa\nn\n\nMR Image Encoding L. Wald MGH-NMR Center\nover time. When the helix is completely unwound you are sampling the zero spatial frequency\ncomponent of the sample. For a large, uniform phantom, this is the only point in kspace which\nhas significant signal. Since MR physicists spend so much time imaging bottles of water (and\nsince the head is to first approximation like a bottle of water), the time when the kx = 0 point is\nsampled is given the special name of the \"TE\" (time to echo) of the acquisition. In most objects\nthe signal is quite small when sampling the high spatial frequencies, builds up to a maximum at\nt = TE, and then gets smaller again for the opposite signed high spatial frequencies. Thus this\nbasic experiment is referred to as a \"gradient echo\". Note that the gradient echo occurs when\nthe area (Gx t) of the positive lobe equals the area of the negative \"prewind\" lobe. The\nexperiment (pulse sequence) for frequency encoding can thus be diagramed as follows:\n\nFig. 1.8\n\nk\n\nAll th\nft to do is add in encoding for the y direction.\n\nample\nbi\nns of the objects x and y spatial frequencies. The simplest (and\nommonest) way to do this is simply repeat the above frequency encoding experiment once for\nvery offset in ky. This means winding a helix in the y direction and then performing the\neadout procedure of winding and unwinding the x helix. The y helix can be quickly wound\nnd then left in place for the duration of the readout procedure by turning on a brief Gy\nat is le\nTo reconstruct an image we need to\ns\nall com\nnatio\nc\ne\nr\na\ngradient after excitation but before initiating the readout. Thus we use a different phase encode\ngradient before each readout experiment. If we desire a 128 x 256 image matrix, we would\ntypically perform 128 excitations each with a different area of the phase encode blip gradient of\narea Gy τ. Since it is inconvenient to change the timing from excitation to excitation and only\nthe area of the blip matters, typically the amplitude of the phase encode gradient is stepped\nfrom negative to positive values. Thus the diagram for one excitation looks like:\ny\nkx\n\"slice\n\"freq. enc\"\n(read-out)\nRF\nt\nGz\nGx\na\na\nSignal\nTE\n(t)\nS\n\nMR Image Encoding L. Wald MGH-NMR Center\n\nFig. 1.9\nRF\nt\nGz\nGy\nGx\nS(t)\na\nTE\na\nky\n\n\"slice select\"\n\n\"phase enc\"\n\nkx\n\n\"freq. enc\"\n(read-out)\n\nSignal\n\nThe NMR Imaging Equation (mathematical picture of what happens to the spins).\nThe goal of the 2D MR imaging experiment is to determine the distribution of the proton\nspins in the plane of the excited slice. The desired spin density function which we hope to\ndisplay as a grayscale image is defined to be ρ(x,y). Following excitation, the magnetization is\nprocessing at its characteristic frequency ωo = γBo. We then proceed to encode the x and y\ndirections as in Figure 1.9 above.\nFrequency + phase encoding\nTo encode the x direction we will use frequency encoding, we\napply an x gradient and then record the signal as a function of time, S(t) while the gradient is\non. Thus we are recording the frequency and phase evolutions that occur as a function of x\nduring the presence of a constant \"readout\" gradient field. The phase encode gradient consists\nof a y gradient turned on for a brief period of time τ.\nThe MR signal comes from the RF detector which surrounds the entire head. Thus the\ndetected signal is just the summation of the signals from all the spins within the head. Thanks\nto the gradients of Fig. 1.9, the phase of the signal of a given spin depends, on its location. If the\nsignal is sampled at time t after turning the x gradient on, the phase induced on the spins at\nlocation x by the readout gradient alone will be φ(t) = ωot + γGx x t. The phase induced on spins\nat location y by the phase encode blip alone will be φ(t) = ωot + γGy y τ. Thus the total phase\nshift for a voxel at location (x,y) is:\n\n∆φ(t) =ω0t + γGx xt+ γGyyτ\n\nSince the signal emitted by a small voxel at location x,y is proportional to the number of spins at\nthat location, and it will have the phase given above, the signal S(x,y,t) from a voxel at (x,y) is\npropotional to ρ(x,y) exp(iωot + iγGx x t). The RF coil equally sums contributions from all\nlocations, so the signal detected by the coil is the sum of this over the head:\n\nS(t) =\nρ(x, y)e\niωot+ iγGxxt+iγGyyτ\nobject∫∫\ndxdy\n\nMR Image Encoding L. Wald MGH-NMR Center\nThe phase factor exp(iωot) is a simple modulation factor representing the Larmor precession of\nthe spins. This carrier frequency can be moved outside the integral and is, in fact, simply\nthrown away in the detection hardware and we are left with:\n\nS(t) =\nρ(x, y)e\niγGxxt+iγG yyτ\nobject∫∫\ndxdy\n\nSince the integral is over only the spatial dimensions, it is useful to define kx = (-γGx t) and ky =\n(-γGy τ) so that:\n\nS(t) =\nρ(x, y)e\n-ikxx-ikyy\nobject∫∫\ndxdy\n\nIf you consider x and kx as the Fourier conjugate variables (instead of ω and t as before) this of\ncourse looks a lot like a 2D Fourier integral. Therefore, to solve for ρ(x) all we need to do is take\nan inverse FT of the detected signal.\n\nρ(x,y) = FT\n-1 S(kx,ky)\n[\n]=\nS(kx,ky)e\nikxx+ ikyy\nkspace∫∫\ndkxdky\nThe innocuous change of variables to k is so useful that we have already worked out an\nentire physical intuition about \"k\". The value of kxy directly determines the tightness of the\nhelix of magnetization wound and thus to the spatial periodicity of the sample that contributes\nto that time-point of the signal. This is consistent with the standard interpretation of the FT\nwhere k refers to a spatial frequency. Similar to referring to the time signal as \"time domain\"\nand the FT of the time signal as \"frequency domain\" (or spectrum), we will refer to the normal\nspatial dimensions spanned by (x,y) as \"real space\" (or image space) and the FT conjugate space\nspanned by (kx, ky)as \"k-space\" or \"spatial frequency space\". The units of k are cm-1. Note also\nthat while we are sampling the signal at different time-points (during the readout gradient) the\nchange of variables (k = γG t) forces us to think of each sample as being a sample at a different k\npoint in kspace; exactly the same conclusion that our intuitive picture with the helix lead us to.\nSo from now on we will think of sampling the signal not as a function of time, but as a function\nof k (the only difference between k and t is the scale factor γG). In MRI we measure the\napplitude and phases of the points in the kspace matrix and then calculate the image with the\nFT.\nIn the phase encode direction where ky = γGy τ, the pulse sequence of Figure 1.9 shows\nthat we only get one measurement of the signal at a given y spatial frequency per excitation.\nTherefore, in conventional imaging we must fill in the kspace matrix S(kx, ky) one row at a time.\nA typical image matrix is 128 points in the phase encode direction by 256 in the readout\ndirection. In the timing diagram of Fig. XX, the readout length is typically ~5ms long. For some\ntypes of image contrast we can repeat the excitation as fast as every 10ms. In this case the a\nsingle image is encoded in 1.28 seconds. For many applications it is desirable to wait ~1 s\nbetween excitations. In this case the image takes 128 seconds to encode.\n\nSome kspace facts.\nEach point in kspace that we sample is represented by a complex number (magnitude\nand phase of the signal for that sample point.) If we want a 256x256 matrix image with 1mm\nspatial resolution we typically sample a 256x256 kspace matrix of k values from kmin = -1/1mm\nto kmax = 1/1mm. Thus the resolution sets the maximum k value to be sampled. As property of\nthe FT is that if the object is real (good assumption!) then half the information in the kspace\n\nMR Image Encoding L. Wald MGH-NMR Center\nmatrix is redundant; it is related by the complex conjugate: S(k) = S(-k)*. So, if we desire we can\nonly sample half of the full kspace matrix.\nThe resolution of the image is the single most important image parameter since that tells\nus the maximum value of k that must be sampled. Since k = γ G t, the resolution determines the\nmaximum gradient that must be used and the maximum amount of time that it must be left on.\nThese are two very important practical considerations. The image matrix is also important since\nit tells us the number of samples we must take. The image Field of View (FOV) is trivially\nrelated to the two: FOV = resolution x matrix. In kspace, the ∆k between the samples is 1/FOV.\n\nEchoplanar Imaging\n\nIn the conventional spin warp imaging sequence of Fig. 1.9 above, a single line of points\nin kspace is collected with each excitation. This has the advantage that the phase of the signal is\nreset prior to collecting each line of kspace by the excitation process (which always starts with\nthe equilibrium magnetization pointing along the z axis). This is of enormous benefit since\nthere are several practical problems which cause us to lose control over the phase of the signal.\nOf course, phase errors tend to build up over time so periodically \"resetting\" the phase can be a\nbig help. The principle drawback of conventional imaging is one of speed. Even if the\nexcitations are placed very close together (say 100ms) the total time to encode 64 lines of kspace\nis over half a second. At this rate, virtually nothing has a chance to return to equilibrium. And,\nwhile this sounds pretty fast, it would take us almost 20 seconds to cover the head with 30\nslices. This is longer than the hemodynamic changes accompanying neuronal activation. Even\nworse, any motion that occurs during the ~1s it takes to encode an individual images will cause\nartifacts that are bigger than the activation related changes we are seeking.\nBy simply repeating the gradient echo part of the conventional spin warp sequence, and\nthus not waiting for the next excitation we can considerably speed things up. The result is the\ntechnique named \"echoplanar imaging \" (EPI) diagramed in Fig. 1.10. EPI requires state of the\nart imaging hardware since the sequence requires the sign of the readout gradient to be quickly\nchanged. The EPI sequence can be played out in 40ms. Thus we can get a full 64x64 image of\nthe head (with 3mm resolution) in well under a tenth of a second. Imaging the entire head\n(with 30 slices) then takes less than 3 seconds, just less than the hemodynamic response time.\nFinally, it is truly a \"snapshot\" image since no motion occurs during the 40ms of encoding.\n\nFig. 1.10\nRF\n\nky\nt\n\nGz\n\nS(t)\n(no grads)\nGy\nGx\netc..\n\nkx\n\nT2*\n\nMR Image Encoding L. Wald MGH-NMR Center\n\nImage artifacts\n\nMany common MR image artifacts have a simple origin in the kspace data. Here, a few of\nthe simplest are discussed.\n\nOriginal artifact free magnitude image\noriginal artifact free kspace (magnitude)\n\nSymmetric N/2 Nyquist ghost\nThe symmetric ghost artifact consists of the desired image\nsuperimposed on a fainter copy shifted by half of the\nimage field of view in the phase encode direction. Recall\nthat by the Fourier shift theorem, modulating every other\nline in kspace by 180 degrees results in a shift in image\nspace by half of the FOV. Modulating every other line by\nless than 180o produces a fainter version of the image\nshifted by 1/2 the FOV. Thus the symmetric N/2 ghost\narises when every other line of the kspace data is\nmodulated by a fixed phase factor. To generate the data\nbelow, the even phase encode lines where multiplied by a\n+12 degree phase factor and the odd numbered lines by -\n12 degrees.\nThe phase shift in echoplanar images is usually eddy\ncurrent induced. The addition of a Bo eddy current field\nadds a phase shift to the data. The even lines (taken with a\npositive readout gradient) get the opposite phase shift of\nthe negative lines (taken with a negative readout gradient)\nsince the sign of the Bo eddy current field is a function of\nthe sign of the gradient field which produced it.\n\nMR Image Encoding L. Wald MGH-NMR Center\n\nMotion artifact.\n\nIn a typical motion event in conventional (not single\nshot) MRI, the subject lies in one position for some\nfaction of the image encoding period and then\nmoves to another location for the rest. By the FT\nshift theorem, the kspace data of the shifted image is\nthat of the original multiplied by a phase factor\nwhich gets linearly larger for each line in kspace.\nFor the image below, the kspace data of the original\nimage was grafted onto the kspace data of the same\nimage shifted by 2 pixels. The graft occurs in line\n147 of the kspace data.\n\n\"Spike\" in the kspace data\n\nkspace with spike in lower left\nreconstructed image with \"spike\" pattern\n\nIn this case, the kspace data is identical to the artifact free case except for one bright dot in the\nlower left hand corner of the kspace data. Usually, the bright kspace pixel is caused by an\nelectrical spark ocuring in the MR scanner room. An electric arc is accompanied by a very brief\ndischarge of broadband EM waves (including light and radio waves). The RF detection coil\nthus picks up extra intensity if this happens while sampling a given point in kspace.\n\nReferences:\n\n1) Waldo, Hinshaw and Lent, \"an introduction to NMR imaging from the block equation to the\nimaging equation.\" Proceedings of the IEEE Vol 71 no. 3, March 1983, p.338-350.\n2) Pauly, LeRoux Nishimura and Macovski, \"Parameter relations for the Shinnar-LeRoux\nselective excitation pulse design algrorithm. IEEE Transactions on Med. Imaging. Vo 10. No. 1,\nMarch 1991, p 53-65.\n3) Kimmich R. \"NMR Tomography Diffusometry Relaxometry\", Springer-Verlag, Berlin, 1997.\n4) Haacke EM, Brown RW, Thompson MR, Venkatesan R, \"Magnetic Resonance Imaging,\nPhysical Principles and Sequence Design.\" Wiley-liss, New York, 1999."
    }
  ]
}