{
  "course_name": "Major Authors: Melville and Morrison",
  "course_description": "This seminar provides intensive study of texts by two American authors (Herman Melville, 1819-1891, and Toni Morrison, 1931-) who, using lyrical, radically innovative prose, explore in different ways epic notions of American identity. Focusing on Melville’s Typee (1846), Moby-Dick (1851), and The Confidence-Man (1857) and Morrison’s Sula (1973), Beloved (1987), Jazz (1992), and Paradise (1998), the class will address their common concerns with issues of gender, race, language, and nationhood. Be prepared to read deeply (i.e. a small number of texts with considerable care), to draw on a variety of sources in different media, and to employ them in creative research, writing, and multimedia projects.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "American Literature",
    "Criticism",
    "Fiction",
    "Society",
    "Women's Studies",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "American Literature",
    "Criticism",
    "Fiction",
    "Society",
    "Women's Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis seminar provides intensive study of texts by two American authors (Herman Melville, 1819-1891, and Toni Morrison, 1931-) who, using lyrical, radically innovative prose, explore in different ways epic notions of American identity. Focusing on Melville's\nTypee\n(1846),\nMoby-Dick\n(1851), and\nThe Confidence-Man\n(1857) and Morrison's\nSula\n(1973),\nBeloved\n(1987),\nJazz\n(1992), and\nParadise\n(1998), the class will address their common concerns with issues of gender, race, language, and nationhood. Be prepared to read deeply (i.e. a small number of texts with considerable care), to draw on a variety of sources in different media, and to employ them in creative research, writing, and multimedia projects.\n\nWomen's Studies / Literature\n\nThis course is cross-listed in the Program in Women's Studies and the Department of Literature. Hence, readings, class discussion, and essays will give students opportunities to explore issues of difference, especially those of gender, race, and culture, in the works of these two authors. Supplementary materials in print, electronic media, and films bring these issues into focus throughout the term, and scheduled conferences will guide students toward research in these areas. The main burden of weekly reading assignments and classroom discussion will be the texts themselves, with supplementary reading and research serving as the basis for in-class presentations and essays.\n\nUses of Multimedia\n\nThis course has been planned in conjunction with the\nMetaMedia Project at MIT\nto develop uses of electronic media in the humanities. We will be exploring online texts, visual arts, film, and music in relation to the texts studied in class and will work with a database of materials that will support research, writing, and in-class presentations. No technical experience is necessary.\n\nRequired Texts\n\nMelville, Herman.\nTypee.\nPenguin.\n\n------.\nMoby-Dick.\nPenguin.\n\n------.\nTales, Poems, and Other Writings.\nEdited by John Bryant. Modern Library.\n\n------.\nThe Confidence-Man.\nOxford.\n\nMorrison, Toni.\nSula.\nDutton, Signet.\n\n------.\nBeloved.\nPenguin.\n\n------.\nJazz.\nPlume.\n\n------.\nParadise.\nPlume.\n\n------.\nPlaying in the Dark.\nKnopf.\n\nStatement on Plagiarism\n\nPlagiarism attacks the freedom and integrity of thought. Especially in a class that will depend to some extent on online research, you must know what constitutes plagiarism and avoid it. The Literature Department has formulated this statement and policy for all plagiarism cases\n\nPlagiarism\n\nUse of another's intellectual work without acknowledgement- is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance see the\nMIT Web site on plagiarism\n.",
  "files": []
}