{
  "course_name": "Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy",
  "course_description": "What does the Genesis story of creation and temptation tell us about gender, about heterosexuality, and about the origins of evil? What is the nature of God, and how can we account for that nature in a cosmos where evil exists? When is rebellion justified, and when is authority legitimate? These are some of the key questions that engaged the poet John Milton, and that continue to engage readers of his work.",
  "topics": [
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Fiction",
    "Humanities",
    "Literature",
    "Comparative Literature",
    "Criticism",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nWhat does the Genesis story of creation and temptation tell us about gender, about heterosexuality, and about the origins of evil? What is the nature of God, and how can we account for that nature in a cosmos where evil exists? When is rebellion justified, and when is authority legitimate? These are some of the key questions that engaged the poet John Milton, and that continue to engage readers of his work.\n\nIn 1667, Milton published what he intended both as the crowning achievement of a poetic career and a justification of God's ways to man: an epic poem which retold and reimagined the Biblical story of creation, temptation, and original sin. Even in a hostile political climate,\nParadise Lost\nwas almost immediately recognized as a classic, and one fate of a classic is to be rewritten, both by admirers and by antagonists. Modern readers have continued to contend with both Milton's text and its sources.\n\nIn this class, we will read\nParadise Lost\nalongside works of 20th century fantasy and science fiction which rethink both Milton's text and its source:\nPerelandra\nand\nThe Lion, the Witch and the Wardrobe\n(C. S. Lewis) and the trilogy\nHis Dark Materials\n(Philip Pullman). As well as glancing at selections from Milton's own writings on divorce and freedom of the press, we will also engage with a variety of modern critical perspectives on Milton (C.S. Lewis, Stanley Fish, Patricia Parker, William Kerrigan, and others) and on\nGenesis\n(Elaine Pagels, Mary Nyquist).\n\nCourse Structure\n\nSummary\n\nA brief quiz on\nParadise Lost\nin Week 3 - you should have finished reading the entire poem once through by this time\n\nOne class report on the criticism\n\nOpening discussion (once or twice, depending on class size)\n\nOne short paper\n\nProposals for long seminar paper, including bibliography\n\nPreliminary rough draft\n\nPapers presented orally\n\nSeminar paper (16-20 pp.)\n\nWeekly journals\n\nJournals\n\nTen\nare assigned - you can skip\ntwo\nwithout penalty. These journals should be informal but thoughtful - don't summarize (unless you find it useful for yourself) but do include questions of any kind, responses of any kind, and requests for things you would like to have clarified or more generally discussed in class. Consider the journals a way to keep track of your thinking as well as to try out ideas for the two more formal essays. I\nwill\nrespond to them but generally with comments rather than with evaluation.\n\nWriting\n\nThe first essay, although it can have larger ambitions, will in essence be a close reading of a passage from\nParadise Lost\n. Working through a short piece of the poem more intensively is meant to help everyone get comfortable with the language\nbefore\nthe longer paper; naturally to provide practice in close reading and also to give me a chance to get a look at your writing and give you a sense of my expectations. (These essays can be revised if you are not happy with the first version).\n\nThe longer essay, due at the end of term and counting for half your final grade, can be on any of the texts we have read and will be built in several stages. Completion of each of these will comprise some part of the final grade. Part of the exercise will be to read and use secondary sources, including preparation of a critical bibliography and we will discuss how to do this earlier in the semester. (Improper use of sources, of course, may constitute plagiarism - see the section's policy below). Work on the seminar papers will include multiple opportunities to get feedback and ideas from both your colleagues and from me before submitting the final version for a grade. Most importantly, we'll spend the penultimate week of the semester discussing your work and I will also provide comments on the individual drafts.\n\nAttendance and Participation\n\nAs is usual in seminar settings, you are required to attend all class meetings and are expected to take an active and informed part in discussions. As well as occasionally leading off discussions, I will assign each of you a piece of Milton criticism to present to the rest of the class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nJournals\n\n10%\n\nReport\n\n10%\n\nShort essay\n\n20%\n\nLong essay\n\n50%\n\nParticipation\n\n10%\n\nMIT Literature Statement on Plagiarism\n\nPlagiarism--use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available at the\nWriting and Communication Center\nand the\nMIT Web site on Plagiarism\n.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroductions: first 100 lines of\nParadise Lost\n\nMilton.\nParadise Lost\n, Book I\n\nLewis.\nPreface to Paradise Lost\n, chapters 7-8\n\nParadise Lost\n, Book II\n\nLewis.\nPreface to Paradise Lost\n, chapters 9-11\n\nJournals due\n\nLewis.\nThe Lion, the Witch, and the Wardrobe\n\nParadise Lost\n, Book III,\n\nEmpson. \"Heaven\"\n\nJournals due\n\nParadise Lost\n, Book IV\n\nNyquist. \"Gynesis, Genesis, Exegesis,\" Parts I-IV\n\nJournals due\n\nLewis.\nPerelandra\n\nParadise Lost\n, Book IV (cont.)\n\nNyquist. Parts V-VII\n\nJournals due\n\nLewis.\nPerelandra\n(cont.)\n\nParadise Lost\n, Book V\n\nFish. \"The Milk of the Pure Word\"\n\nJournals due\n\nPhilip Pullman.\nGolden Compass\n\nParadise Lost\n, Book VI\n\nKerrigan. \"'One First Matter All': Spirit as Energy\"\n\nPullman.\nGolden Compass\n\nShort essay due\n\nParadise Lost\n, Book VII\n\nRumrich 1. \"Uninventing Milton\"\n\n------. \"Radical Heterodoxy\"\n\nJournals on Milton or Pullma due\n\nPullman.\nSubtle Knife\n\nJournals due\n\nParadise Lost\n, Book VIII\n\nFlesch. \"The Majesty of Darkness\"\n\nJournals due\n\nPullman.\nSubtle Knife\n(cont.)\n\nProposal and bibliography due\n\nJournals due\n\nParadise Lost\n, Book IX\n\nGross. \"Satan and Romantic Satan\"\n\nPullman.\nAmber Spyglass\n\nPullman.\nAmber Spyglass\n(cont.)\n\nJournals due\n\nParadise Lost\n, Book X\n\nParker. \"Eve, Evening, and the Labor of Reading\" in\nParadise Lost\n\nLast Journals due\n\nField trip to Boston public library\n\nIn-class presentations\n\nRough draft due\n\nIn-class presentations (cont.)\n\nParadise Lost\n, Book XI\n\nGrossman. \"Milton's Dialectic Vision\"\n\nParadise Lost\n, Book XII\n\nSeminar paper due",
  "files": [
    {
      "category": "Resource",
      "title": "Guidelines for the Short Essay",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/d837adff2c956eaeb8a9b4727f8c7962_MIT21L_705S09_assn01.pdf",
      "content": "Guidelines for the short essay.\nLength: 3-5 pp. or 2000-3500 words.\nDue: SES#13\nFormat: See \"How to format your essay\" for details.\nThis essay should be a close analysis of a brief passage of your choosing, taken from any part of\nParadise Lost. By \"brief,\" I mean 50 lines or less; if your passage falls towards the longer end\nof the spectrum, you should expect a/ to write a paper on the longer side and b/ to focus more\nclosely on some shorter segment of that passage, using the rest as context.\nBeginning: You should begin by concisely setting up the context of the passage: who is\nspeaking and, if a character, to whom; what is the setting; and what is happening at this point in\nthe text.\nDoing the analysis: Close analysis of the passage might begin with general or subjective\nimpressions, but these should then be grounded in (and perhaps tested against) objective details:\nword choice, syntax, tone, and rhythm, as well as very careful attention to what is said and how.\nUnder \"how,\" you'll also want to consider Milton's use of metaphors, similes, figurative\nlanguage (e.g., the \"debt\" constituted by gratitude), as well as allusions (e.g., the figure of the\nscales at the end of Book IV as inherited from classical epic) and the use of sources, if any. I\ndon't expect you necessarily to look up the original source for allusions to Homer, Virgil, Ovid,\nor other classical writers, although it's certainly worth doing if you have the curiosity and the\nenergy. I would expect you to look at some version of the original text for any allusion to the\nBible, and to consider both the surrounding context for the quotation or allusion AND how\nMilton may have changed, added to, or interpreted his source. Your notes should alert you to the\npresence of Biblical references, and the online texts linked to this site are good resources for\nlooking them up. You are then the judge of how much of what you find out will be relevant,\ninteresting, or important for analysis of Milton's text.\nConcluding: Once you've generated a good bit of material, and sorted it for importance, you'll\nwant to think about how it adds up. If you've begun either your thinking or the essay with an\noverall impression or question, what difference has your analysis made to that initial starting\npoint? (It's fine to discover that you've changed your mind). Finally, you might also want to\nindicate how the details of this passage relate to larger questions and issues in the text as a whole\n- that is, why it matters and what we can take from this analysis into our reading of the rest of\nthe poem.\nNote on Milton's syntax: it is both difficult and very important to make sure that you\nunderstand Milton's sentences, which are often structured in tricky and unexpected ways; I will\nbe looking for this kind of clarity when I read the essays. Don't be shy to start at a very basic\nlevel: what is the main verb of this sentence? Who or what is the subject/doer of that action?\nWho or what is the object/recipient of the action? How do the other clauses and elements of the\n\nsentence relate, formally, to its core structure of subject/verb/[object]? Please see also: \"How to\nformat your essay\" (under General on this site) for details about how to quote the text correctly.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "How to Format your Paper",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/7f3ca022886a646c90f7b9a6f4927893_MIT21L_705S09_assn04.pdf",
      "content": "How to format your paper:\nTyped/printed, double-spaced, 1\" margins. Change them in \"Page Setup\" on the \"File\" menu).\nParagraphs indented 5 spaces at left; do not separate paragraphs by extra blank lines. Quotations\nof 10 words or less should be integrated into the text; longer quotations should be indented 5\nspaces at left and right margins, single spaced, and set off from the text of the essay by a blank\nline before and after the quotation. (Please see examples below).\nHow to title your paper:\nYour essay should have a fairly specific title - one which will suggest what is most interesting or\nimportant about what you have to say. It's worth taking a little thought over the title, not only\nbecause it creates the first impression of your essay (that, too); coming up with a phrase which\nencapsulates your argument can help in focusing that argument. One popular strategy, and not a\nbad one, is to use a key phrase from the text followed by another phrase of clarification. (For\none example, see the article by Kerrigan). The title is not massively important for your first\npaper, but will matter more for the longer second paper.\nHow to quote:\nQuotation is important in essays on literature, not only to provide evidence for what you're\narguing, but also to provide the reader with enough detail to follow along. Think about how\ndifferent it would be if, in example 1 below, I wrote: \"When reading lines 860-61 in Book V, we\nmay respond to the force of the rhetoric while reserving the right to doubt the truth of what is\nsaid.\" Judicious use of quotation clues the reader in, and produces prose that is more interesting\nto read than a sentence like the previous one.\nShort Quotation (2 kinds)\n1/\nWhen Satan claims that the rebels \"know none before us, self-begot, self-raised by our\nown quickening power\" (V 860-61), we may respond to the force of his rhetoric while reserving\nthe right to doubt the truth of what he says.\nNOTE 1: when the quotation is integrated into your own sentence, as here -- your words\n\"the rebels \" are the subject of Milton's verb \"know\" -- make sure the grammar works.\nTo check whether it does, remove the quotation marks and see if the sentence looks right.\nNOTE 2: please cite Paradise Lost by book number and line number (which are the\nsame in all editions), not by page number (which differs between editions). The format\nused in example 1 above is perfectly adequate for current purposes, but more formally the\nfirst reference to the text should be footnoted so that you can provide information on the\nedition used. I tell you this for your information, since I don't need to know the edition;\nyou can do it or not.\n2/\nSatan, unlike Adam and Eve, claims not to recall the moment of his creation: \"we know\nno time when we were not as now \" (Paradise Lost V, 859).\n\nLong Quotation\nHere I am, writing along in my essay, along and along and along. Here comes a long\nquotation from Mary Nyquist's article on Milton and the interpretation of Genesis, beginning\nnow. (Please notice also the brief citation format; see above for a parenthetical citation of\nParadise Lost by book number and line numbers. I'll give further information as we go on how\nto footnote secondary sources when they are first cited).\nJust as, in the divorce tracts, Milton joins Adam's words to those of the paternal\nmaker... [imagine more quotation here] Not only the placement of Adam's\nnarrative after Raphael's but also its most salient formal features can thus be seen\nto be motivated ideologically, and illustrate the causes joining the divorce tracts\nand Paradise Lost (Nyquist, \"Gynesis\", 191).\nOkay, quotation's over. Back to the essay now, with double-spacing and regular margins again.\nOne other thing: anytime you include a long chunk of text, be sure to talk about its details and\nwhat, specifically, we should understand from reading it. If there is not enough to say, the\nquotation should probably be shorter.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Last Paper Edits",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/87b1e8a8447cc045a0cb29aa7b9a7fba_MIT21L_705S09_assn03.pdf",
      "content": "Summary: 16-20 pp., due SES#26.\nThis last paper should be 16-20 pages, and is due on the last day of class. We'll devote the week of 5/5\n7 to presentations of your topics and work in progress, with a view to problem-solving and providing\nuseful feedback. The overall grade for the seminar paper (out of 100) will include 10 points each for\ntimely completion of a substantive proposal and a rough draft.\nSuggestions for how to proceed:\n1. Begin by 1/ deciding which parts of which text(s) appeal to you most, and then find a topic\nor question to pursue; or 2/ formulating a question which interests you, and then decide\nwhich texts would best serve to pose and answer it. In either case, you should end up with\nsome idea of a question and some idea of which (e.g.) poems, scenes, characters, plot\nthreads or passages you'll be examining. I'd expect you to get about this far in your\nproposal, which should also include at least 3 secondary sources you plan to consult.\n2. Next, you might either 1/ do some close readings of your passages, and think about the\nkinds of topics or questions which are emerging, the patterns being formed by the\ninterpretations you're generating; or 2/ think about how to pursue your topic or question, and\ndevelop a provisional hypothesis about what you think may turn out to be the case, before\ngoing on to some readings of particular parts of the text or texts.\n3. Think about how your close readings connect with a framing question, and how they can be\norganized to bring out an argument or exposition; recalibrate your hypothesis, perhaps even\nyour question, in the light of the closer readings you've now done of your texts. At this\nstage, I strongly recommend writing an outline of your existing draft, summing up the point\nof each paragraph in a phrase or sentence; doing this will help you a/ to make sure you are\nmaking points; b/ to eliminate repetition; more importantly, c/ to see the skeletal shape of the\nargument, and consider whether that shape can be made clearer, whether it would benefit\nfrom putting your materials in a different order, and whether there are materials you need to\nadd or subtract. For an example of a short essay with adjacent outline, see \"Knowing Lucy\"\n(the Lucy in question is from a Wordsworth poem, not from the Narnia books).\n4. In your conclusion, recall the original question and the stages by which you've asked and\nanswered it; don't have recourse to generalities, but remind the reader of the most interesting\nthings you've discovered and argued - brief quotations (e.g., phrases rather than ten-line\nchunks)aren't out of place here to recall the flavor of the works you're talking about. This\nlast piece of the paper would also be the place to include other ideas, conclusions or even\nquestions you've come up with that don't quite fit into your topic, or which you didn't\nanticipate - even if you don't have time to explore them fully.\n5. You can win or lose a reader in the last few sentences of your paper. Here are three\nrhetorically effective things to do at the very end: 1/ restate your main point first with some\ndetail and complexity, and then in the most succinct and lapidary prose (see example A\nbelow for what I mean by the second); 2/ suggest another question which arises from the\nwork you've done in the paper, and would form the subject of a hypothetical companion\n\nessay (see example B); 3/ introduce a quote from one of the works which can now, in the\nlight of your essay, be seen as perfectly exemplifying the points you've made (see example\nC).\nHere are examples of the three strategies for conclusion described above (taken from another\nRenaissance poetry seminar):\nExample A: \"Has there ever been a gay Shakespeare? Yes - and his name is Shakespeare\"\n(Eve Sedgwick).\nExample B: \"What I've said about Shakespeare's Sonnets suggests that we would best\nunderstand his poems to the young man by reading them not only in the context of Petrarchan\nlove poetry, but also against other poems written by men to men - for instance, the many elegies\non the death of Philip Sidney which praised him as an ideal. But that would be the subject of\nanother essay.\"\nExample C: [Your argument here] [two lines from the Sonnets here].\n6. Finally, make sure you've allowed time to proofread your essay and take care of any\nleftover formatting. For reference format, please see \"Sample Bibliography\"; for other\nquestions, please see \"How to Format Your Paper.\"\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Sample Bibliography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/a14f5ce4ba5d0a49afc655e59f424c4c_MIT21L_705S09_assn05.pdf",
      "content": "Sample Bibliography.\nARTICLE: Abbass, D. Katherine. \"Horses and heroes: the myth of the importance of the\nhorse to the conquest of the Indies.\" Terrae Incognitae 18 (1986).\nBOOK CHAPTER IN EDITED VOLUME: Adamson, J.S.A. \"Chivalry and Political\nCulture in Caroline England.\" In Culture and Politics in Early Stuart England.\nEdited by Kevin Sharpe and Peter Lake. London, 1994.\nMULTI-VOLUME WORK: Alden, John, and Dennis C. Landis, eds. European\nAmericana : a chronological guide to works printed in Europe relating to the\nAmericas, 1493-1776. 6 vols. New York, 1980-1998.\nBOOK: Axtell, James. After Columbus: Essays in the Ethnohistory of Colonial North\nAmerica. Oxford, 1988.\nANOTHER WORK BY SAME AUTHOR: __________. \"The Exploration of\nNorumbega.\" In American Beginnings: Exploration, Culture, and Cartography\nin the Land of Norumbega. Edited by Emerson W. Baker et. al. Lincoln:\nUniversity of Nebraska Press, 1994.\nReferences in text: (Abbass 197) or (Axtell 1994, 17) or (Alden I: 209).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Seminar Paper Proposal",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/c95c52555ed84d05f05833a0082c46d5_MIT21L_705S09_assn06.pdf",
      "content": "Seminar Paper Proposal\nIn his Divine Comedy, Dante describes the geography of creation in a physically\nrecognizable and immediately understandable manner. In his poem, Hell is fixed in the center of\nEarth, Purgatory is a mountain on Earth's surface, and Heaven lies directly above Purgatory. In\nParadise Lost, however, Milton places Hell across an immeasurably wide chaotic void from\nParadise. Many regard Dante's Ptolemaic organization as an acceptance of the cursed nature of\nman at the time of the poem's action, likewise considering the remoteness of Milton's Hell as a\nnecessity in a not-yet-flawed world. Thus, the construction of the bridge between Hell and Earth\nby Sin and Death accomplishes what is seen in Dante's world.\nNevertheless, the location of Milton's Hell is certainly different from that of his\npredecessor. It can be argued that Milton's view of creation is simply consistent with the\ncreation of Earth after Satan's fall, but theologians such as Martin Luther and even Origen\nsupported the widely-held belief that Hell was not a physical place but rather the complete\nabsence of God from within a person. In that case, Milton's Hell can easily be seen as one of\nmany physical explanations for non-physical existences that mortal man cannot comprehend in\nParadise Lost (such as the war in heaven). Strong evidence for this lies in one of Satan's most\nfamous quotes: \"myself am Hell.\"\nIf Hell is indeed a state of mind, then Milton's Satan never \"reign[s] in Hell\" as he claims\nto do. While he turns on God and seeks revenge, he admits that he feels intense pain and longs\nfor Paradise when he first sees it. At this time, Satan has not become the entirely mechanical\nLucifer of the Divine Comedy who thrives in the underworld. Instead, he still longs for the love\nof God, as Hell seems unbearable torment to him.\nThis paper will analyze the consequences of Milton's geographic representation of\ncreation from a physical and mental perspective. This will consider the relative locations of\nHeaven, Earth, and Hell and the connections between them (the golden chain and the bridge) in\nterms of Man's relationship to God and Satan. Satan's actions and motivations will be discussed\nfrom the standpoint that Satan's ultimate and unachievable goal, albeit unknown to him, is the\ncomplete disconnection of himself from God.\nI have not read enough critical analysis and spent enough time thinking to present a\nunifying thesis here yet, but I feel that I have a fair amount of material to work with so far. As I\ncome up with more ideas and something closer to a thesis, I'll let you know in my journals.\nBibliography [I will give more information in due course, but note that this is the correct format for a\nbibliography]:\nBroadbent, J. B. Some Graver Subject. Chatto and Windus: London, 1960.\nCurry, Walter Clyde. \"The Genesis of Milton's World\" and \"Some Travels of Satan and the\nRoad to Hell.\" Milton's Ontology, Cosmogony, and Physics. University of Kentucky Press:\nKentucky, 1957. p. 92-113, 144-157.\n\nGardner, Helen. \"The Universe of Paradise Lost.\" A Reading of Paradise Lost. Oxford\nUniversity Press: London, 1965. p.29-50.\nHunt, Winifred. \"On Even Ground: A Note on the Extramundane Location of Hell in Paradise\nLost.\" Modern Language Quarterly, 1962. p.17-19.\nLoewenstein, David. \"Hell: geographical place and internal state.\" Milton: Paradise Lost.\nCambridge University Press: Cambridge, England, 1993. p.70-75.\nMartin, Catherine Gimelli. \"From the Allegorical Kosmos to Miltonic Space.\" The Ruins of\nAllegory. Duke University Press: Durham, 1998. p. 121-161.\nSamuel, Irene. Dante and Milton: The Commedia and Paradise Lost. Cornell University Press:\nIthaca, 1966.\n\nProposal for long seminar paper\nFor my long seminar paper I want to write about Satan as a protagonist figure. Specifically I\nwant to address Milton's portrayal of Satan as a character struggling against the oppressive\npower of God and the effect of that portrayal on the reader. The question or problem here is that\nSatan is by all accounts an \"evil\" character; he is the ultimate antagonist. Yet Milton portrays\nSatan in such a way that he can be construed as an epic hero or simply a protagonist, most\nnotably in the first few books. How does Milton accomplish this effect on the reader, what is the\nrelevance and meaning of Satan as a protagonist, and why does Milton portray Satan in this way?\nAlso, is Satan the \"epic hero\" of Milton's epic poem, and if so what does that entail? I will briefly\ndiscuss some relevant passages of Paradise Lost and why they are important in addressing these\nissues.\nThe first mention of Satan is in book I line 40 or so, and the description of Satan and his deeds is\nunattractive. The very first impression of Satan is therefore negative, so Milton does not\nimmediately set off to portray Satan as a hero.\nSatan's first speech in book I is eloquent; it is just as noble as the later speeches of God and some\nof the angels. We therefore see Satan as a rational and even noble creature, even though he is\nchained to a lake of fire at the time. This is followed by a speech from Beelzebub, who praises\nSatan as a prince and fearless leader. Satan is then described as a hopelessly evil character who\ncannot fight the power of heaven. Does this make him a tragic hero for struggling against an\nindomitable power, simply because of what he believes in? Or does it make the reader see Satan\nas a despicable evil wretch? I think there is some of both. The power of heaven also shows two\nsides: goodness and oppression. The issue here is that one expects to see heaven as an all-\npowerful goodness while Satan and the rebel angels are pure evil and despicable. But Milton\nshows that heaven has an oppresive rule and the rebels are virtuous in their own way, fighting for\na cause that they believe in. The reader can then sympathize with the oppressed rebel leader as\nwith an epic hero. One possible reason for Satan to be presented as an amicable character is so\nthat the reader understands the appeal of Satan's temptation - we can appreciate how Eve can be\ntempted. A wretched and evil Satan would not be so effective at tempting Eve or the reader.\nSatan's first moment of glory among the rebels is in the consultation in book II. After throwing\nout the ideas of war and complacency the rebels agree to seek out earth and tempt its creatures to\nrebel against God. Satan accepts this mission when no others will, like a brave epic hero. He is\ntreated as such by the host of rebels, and again we see Satan as a character with respectable\nqualities (most notably courage in this case).\nAt the end of book II, Satan appeals to Chaos to guide him to heaven. I am not sure whether to\ndiscuss this passage at length. The relevant idea is that the realm of Chaos is encroached upon by\nGod's creations of heaven, hell, and earth. God is seen as an oppressive power. However, the\nreader feels little or no attachment to Chaos, so the resentment towards God here has little effect.\nHowever, Chaos is the original state of the universe - the \"roots\" of all creation. That these roots\nresent the creator of worlds is significant. God's creations are created to be subservient, or at least\n\nunder his control (as with hell). Therefore this passage shows God as a cosmic oppressor and\ntherefore an antagonist figure, who Satan is righteously rebelling against.\nThe confrontation between Satan and Gabriel in book IV shows that Satan retains some nobility\ndespite his fall from grace. They argue, and while Gabriel considers himself righteous, Satan\nappears more noble. Satan argues that he has endured more pain and suffering for his cause, is\nmore courageous in battle, and is more of a \"faithful leader\" than Gabriel. After this exchange\nthe reader is compelled to favor Satan. Even when Satan flees he is not seen as cowardly, for his\nstrength is limited by God (who is again seen as an oppressor).\nIn book VI Satan faces Abdiel and is defeated. We see Satan as a rebel who has been defeated by\na virtuous angel. In this case Satan is not seen as a protagonist. Why not? This should be\naddressed.\nAlso in book VI Satan faces Michael and is defeated. Here Satan shows great courage; Michael\nis a worthy combatant. In this case Satan is fighting a great foe to end his oppression. Satan can\nbe seen as an epic hero character here. Contrast this with Satan's encounter with Abdiel.\nI think that covers the passages from Paradise Lost. Another relevant question that I came across\nis more biographical. Milton was a political rebel, and Satan is a rebel hero. Is Satan perhaps an\nalter-ego of Milton's? Milton probably felt oppressed and righteous, and other people probably\nthought of him as \"evil.\" Could this be motivation to create a character, usually considered evil,\nwho turns out to have amicable properties?\nHere is a list of references which I think will be useful:\nJohn Milton, \"Paradise Lost\" (obviously)\nStanley Fish, \"Surprised by Sin\" (not the part we read for class though)\nPossibly some passages from the bible, perhaps out of Genesis, Isaiah, or Revelations to\nshow the more \"typical\" view of Satan/Lucifer as an antagonist.\nJohn Shawcross, \"An Early View of Satan as Hero of Paradise Lost\"\nPercy Shelly, \"A Defense of Poetry\" or some other essay that addresses Satan\nPossibly other Romantic criticisms describing Satan as a hero (Coleridge?)\nJohn King, \"Milton and Religious Controversy\"\nRoland Frye, \"God, Man, and Satan\"\nJohn Knott, \"Milton's Pastoral Vision\"\n\nCharles Martindale, \"John Milton and the Transformation of Ancient Epic\" (especially on\n\"some Homeric echoes\")\nWilliam Riggs, \"The Christian Poet in Paradise Lost\"\nJohn Rumrich, \"Matter of Glory\"\nPerez Zagorin, \"Milton: Aristocrat and Rebel\"\n\nPerspectives on Technology and Science in\nParadise Lost and His Dark Materials\nI plan to focus my seminar paper on the role of science and technology in Paradise Lost and in\nPullman's His Dark Materials. I separate science and technology as two words, and those are the\ntwo focuses of my paper. There is an immense di(r)erence between the scienti c explorations of\nyoung Lyra and the technological monstrosities constructed by Mary Malone. They need each\nother to succeed and are inherently linked, but neither is the same as the other.\nMy hope is to address how both of these exist in the works of literature on a few levels. At the\nfirst level, I will address how science and technology of the day in°uenced the writing of Milton\nand Pullman. In Milton's day, the advent of the telescope gave him a fascinating perspective on\nthe universe{the astronomy of the day was an inspiration for his work. As for Pullman, the\nmodern day contrivances of technology seem to in°uence exactly what he leaves out of Lyra's\nworld, which in many ways is his ideal \\back in my day\" home.\nAt a second level, I will talk about technology as metaphors in the books. Why does God send\nhis son on a chariot in the great battle for heaven? Why a metaphor from that age? What\nheroism does it represent? (and if heroes like Achilles are sons of the pagan gods, is that really\nthe right symbol for the son? ...). Why do the scholars of Jordan keep electrical power out of the\nretiring room? Why does Lyra's world have Zeppelins, but no telephones? These decisions of\nwhich technology to include in the books seem to be signi cant in some sense.\nAt a third level, I will go back to science, and discuss the perspective on science that characters\nin both books o(r)er. In Lyra's world, \\experimental theology\" is conducted at the behest, and at\nthe discretion of the Church. This leads to a convoluting of the scienti c method{only science\nthe Church deems appropriate is discussed. Milton's Adam and Eve awake curious about the\nworld{Adam satis es his curiosity through revelation, through conversation with the angels of\nheaven. Eve's curiosity, not taken care of by divine revelation is left to her own methods. In\nmany ways, Eve is a scientist of heaven, and yet, it is that very curiosity that led to the fall.\nWhat is the message in all this? Is science itself evil? Milton seems to portray Eve as evil for her\nactions according to a scienti c method{for unallowed curiosity. Pullman paints a somewhat\ndi(r)erent picture{science may not be evil in and of itself, but it can be manipulated for evil.\nTechnology, on the other hand, seems to be altogether bad. It is the devils who attempt more\nmodern weapons only to be beaten by the son in God's chariot{a symbol of ancient times, not of\nmodern technology. Pullman casts the subtle knife as the most of evil of technologies{allowing\ngreat triumphs at rst, but with tremendous \\pollution\" of the worlds in the form of sceptars and\nholes into the abyss.\nI will weave these two into a conclusion about the books' perspectives on science and technology\nand what that teaches us about the world today{hopefully answering these two questions: should\nwe accept restrictions on science{are there questions we should not ask? Is technology\ninherently evil, or is that just a manifestation of its inappropriate use?\n\nReferences\n[1] John Milton. Areopagitica: A speech for the liberty of unlicensed printing. Order of the Long\nParliament for the Regulating of Printing, June 1643.\n[2] Marjorie Nicolson. Milton and the telescope. ELH, 2(1):1{32, April 1935.\n[3] Joanna Picciotto. Reforming the garden: The experimentalist eden and paradise lost.\nELH, 72:23{78, 2005.\n[4] Naomi Wood. Paradise lost and found: Obedience, disobedience, and storytelling in c. s.\nlewis and philip pullman. Children's Literature in Education, 32(4):237{259, 2001.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Summary: 2-3 pp., Short Bibliography, Ses 17",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/6aa73f82a5e478d01ea1cc52ec327a16_MIT21L_705S09_assn02.pdf",
      "content": "Summary: 2-3 pp., short bibliography, SES#17.\nYour proposal should discuss the topic (or, better, question) you plan to investigate, and in which\nprimary texts; how or why it arises as a topic; what parts of the text you plan to look at closely; and\nanything else you think is relevant to the proposal. It should also list at least 3 and preferably several\nmore secondary sources (i.e., criticism) you plan to consult, with a brief indication of how they are\nrelevant. These should not all be essays we've read for class; Wikipedia does not count, nor do basic\nreferences such as the OED, Encyclopedia Britannica, and so on. The proposal should be 2-3 pages, and\nwill count for 10% of the total paper grade. You will also be able to read and comment on other\nsubmissions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "C. S. Lewis, Preface to Paradise Lost",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/6cf063134d43d4fd70c61dca2ef7965d_MIT21L_705S09_read02.pdf",
      "content": "C. S. Lewis, Preface to Paradise Lost,\nchapters 7-8.\nAs will be the case for other critical reading this semester, these chapters come out of a particular\ncontext. Lewis's book originated as a series of undergraduate lectures given at Oxford, and was\noriginally published in 1942. To some extent, we're hearing only one side of a dialogue; Lewis\nis presenting a set of arguments about Milton and his poem, but these are often responses both to\na particular historical setting, and to trends in poetry and criticism germane to that time.\nLewis is writing during the second world war, a time when it would have been normal to feel\nthat a lot of things were in crisis; London was being bombed, for instance. (The war figures\nperipherally but significantly in both of his novels). In terms of literary history, the preceding\ndecades were ones in which Milton's reputation had suffered quite grievously. During the 19th\ncentury, as I mentioned, Milton (not Shakespeare) was generally felt to be the greatest English\npoet of all time. After the turn of the 20th century, tastes began to change; critics and readers\nrediscovered other 17th century poets who had been neglected (John Donne, most notably),\nmodernism displaced Victorian conventions in writing, while TS Eliot famously described\nMilton as a \"bad influence\" on other poets. (If you know Eliot's poetry, you may have noticed\nLewis smacking down the \"Love Song of J. Alfred Prufrock\" in Chapter 8; if you don't know it,\ngoogle that title and read it -- you'll have an immediate understanding of what Lewis is fighting\nagainst, aesthetically and morally).\nSo Milton's style had been attacked -- as pompous, as artificial, as ineffective -- and had to be\ndefended. Lewis makes the case that there is a place for a style that is elevated above the level of\nordinary speech, that feels \"important.\" (We don't have so much difficulty with that idea today, I\nthink; what do you think?). He is also making the case for poetry that is less about shockingly\nnew ideas and images (the evening as a patient etherized upon a table, Donne's flea as \"marriage\nbed\" because it has bitten two lovers and mingled their blood) than about old ones, ones that he\nattributes to a kind of race memory. Milton, in other words, is evoking familiar responses to\nfamiliar images rather than new responses to new images. I think this is in some ways quite\nwrong, although interesting.\nIn the next chapter, Lewis takes up a second \"problem\" -- the perception of Milton's poetry as\ncalculated (\"rhetorical\") rather than sincere, naturally expressive, etc.. He does so, rather\ncharmingly, by defending calculation and manipulation as one of poetry's proper jobs. Along\nwith many earlier (e.g., Renaissance) thinkers about poetry, he sees it as concerned with moral\neducation, giving us pleasure so that it can teach us how to be. A moment's reflection on the\nhistory of the 20th century at this particular point in time may shed some light on why Lewis\nfeared that modern human beings might, in fact, be in danger of losing their humanity. This fear\ndidn't speak only to the worries we all may have about how changes we see in our life time will\nchange us, and our descendents; it is also shaped by Lewis's position in a country at war, and his\nbelief as a Christian convert that what he saw outside him manifested a spiritual struggle for the\nsouls of mankind. So he sees at work not just the forces of change and chance, but aggression by\nHitler and Satan that might well succeed and triumph over the forces of (as he saw them) good.\n\nNaomi asked a question about Lewis's idea of \"the stock response.\" So, his comments on \"the\nStock response to Pride\" are thinking back to the poetry of Byron, for instance. Byron was\nfamous for making arguably criminal figures into immensely attractive heroes, and I think Lewis\nblames him (among others, like Blake) for a changed response among Milton's readers to such\ncharacters. In other words, we (modern readers) are inclined to find Satan attractive, while a pre-\nromantic reader in say, 1750 would have found him repellent -- I think that's the argument.\nWhat's the problem with that changed response? Check out what Lewis says just below about\nresponses to treachery. \"Lord Haw Haw\" is the pseudonym for a famous English fascist who\nbroadcast Nazi propaganda to England during the war. Lewis finds it shocking that \"a\nrespectable working man\" takes this kind of activity in stride, rather than perceiving it as part of\na direct threat to his life and liberty. Such a tepid or passive response, he feels, is actually\ndangerous. To give a contemporary analogy, I find it fascinating that many people respond to\nthe character of Hannibal Lecter (Silence of the Lambs, etc.) enormously appealing and\nattractive. Thomas Harris actually wrote a follow-up in which his heroic female detective has an\naffair with Lecter, I think as a kind of shameless pandering to this large segment of his audience.\nLewis's response would be, what will happen to us if, as a result of reading your responsibly\nwritten novels like this one, we all start liking sociopathic, cannibal serial killers instead of\ntreating them as an aberration and a menace to society? This would not be a survival-positive\nresponse!\nLewis has some great perceptions about Milton, and he also makes some arguments that I would\nabsolutely reject. So as with all the criticism we'll read, you should be judicious readers. These\nare all learned scholars who know more than we do about many things, but it is not necessary to\nagree with everything they say for that reason. Use what is useful, and leave the rest!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Nyquist's Essays",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/99688a475dc5cb1e0ac0250d00855e90_MIT21L_705S09_read04.pdf",
      "content": "Rough translation of the citation from Pierre de la Ramee (\"Ramus\") on Fish, page 63:\nMETHOD is the disposition [i.e., placement of things] by which, given several matters,\nthe first which is to be known is put in the first place, the second in the second place, the\nthird in the third place and...\nThe NATURAL METHOD is that by which the matter which is, both in absolute terms\nand relative to other matters, most evident and most well-known is assigned to the first\nplace, which Aristotle calls in his Demonstration sometimes that which is by nature most\nwell-known, and sometimes that which by nature comes first; moreover that matter which\nis naturally most evident must come first in the order and declaration of doctrine, as\ncauses precede their effects and consequences, and [?] also their symbols, and also as the\ngeneral and universal take precedence of the special and particular.\nAnd the more general [or universal] each matter proves to be, the more it must precede\nthe others. And the most general will be the first in rank and order because it surpasses\nthe others in its clarity and evidence. Matters subordinated to it will follow, as they are\nnext in clarity. And of these the most evident will go first, the less evident will follow.\nAnd finally the examples which are the most specific and particular will be placed last.\nThis method is singular and unique to well-established doctrines for in these, alone, those\nmatters antecedent to all others and absolutely clearer and better-known, illuminate and\nillustrates subsequent matters which are obscure and less known.\nRough translation of the citation from Ramus on Fish, page 69:\nIn which the matters which come first are not those which are best understood, either\nabsolutely or relative to other matters, but rather those are which nonetheless more\nappropriate to those who are to be taught.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Some Help with Kerrigan",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/3b1a835dc6ccb169df0fa8aed196730e_MIT21L_705S09_read05.pdf",
      "content": "Some help with Kerrigan: \"`One First\nMatter All': Spirit As Energy\"\nThese notes (supplemented by the adjacent vocabulary list) are intended to help walk you\nthrough a long and fairly challenging but (in my opinion) very rich argument by William\nKerrigan. In them, I've picked out some of the denser passages for summary so that, if you wish,\nyou can skip over them; these are mostly passages that refer extensively to other texts or other\nbodies of knowledge, probably unfamiliar to many of you.\n91-96 (skip or skim): in these opening pages of the essay, through an extended comparison with\nEdmund Spenser (author of The Faerie Queene, 1590), Kerrigan argues that Milton's poem\ndiffers from Spenser's long and rambling romance because in it, certain especially \"privileged\" or\n\"authoritative\" passages -- he refers to them as \"the enfolded sublime\" -- give us \"axioms\" or\n\"authoritative instructions\" for how to understand the larger work that contains them. As he\ncomments on 94, readers will of course disagree about which passages should be taken to\ndetermine the interpretation of the whole. His key passage, for the purposes of this essay, is\nRaphael's speech in book 5 beginning \"O Adam, one almighty is.\" Have a look at that speech,\nand then begin reading roughly at the top of page 96.\n96-98 \"poetry continues at a higher echelon\" what the \"inner alchemist\", digestion, does for food\n-- refining, heightening, and making sublime the materials of our experience. When Raphael\ntells Adam that he will narrate the war in Heaven by \"likening spiritual to corporal forms\", these\nlines should be understood with reference to the prior discussion about food, a corporeal thing\nthat we \"refine\" into something more spiritual every day. When he suggests that things on earth\nmay be \"the shadow of heaven,\" this must be meant in a particular way: not that things on earth\nare less real than things in heaven, as shadows are less real than the objects that cast them (that is\nthe Platonic or Neoplatonic view of objects as being merely shadows of a transcendental\nreality) -- but instead that things on earth are precursors to things in heaven, as Christians have\nbelieved that persons and events in the Hebrew Bible were \"types\" of persons and events in the\nNew Testament. (For instance, that passages in Psalms about the king of the Israelites are also a\nveiled prophecy about Jesus). A type has its own concrete, historical reality, but also \"points to\"\nsomething beyond itself. Throughout the essay, the terms \"Platonic\" or \"Neoplatonic\" can be\nunderstood as pointing to systems of belief in which, broadly speaking, bodies are different\nfrom, inferior to, and less real than souls, ideas, or meanings. On Kerrigan's argument, Milton\nholds the opposite view (below).\n99: Milton's exegesis (interpretation) of the Bible in Christian Doctrine led him to the \"monist\nheresy\" that the universe is not made up of two kinds of things (bodies and spirits, carnality and\nspirituality) -- that would be dualism -- but of a single kind of thing that exists in various\ngradations. Body and spirit are on a continuum, and matter is to some extent spiritual. You don't\nneed to pay attention to the material on Hobbes and Descartes, but he's making the point that this\nbelief about the nature of being (ontology) has consequences for metaphor. We often create\n\nmetaphors using things we can see and touch as ways of describing and thinking about things we\ncan't see and touch; Kerrigan argues that in Milton's poem, the materiality of spirit and the\nspirituality of matter makes such metaphors not imperfect ways of talking about a whole other\ndimension, but revealing windows into the fundamental connections between these levels of\nexperience.\n105-7 (skip or skim): here begins another somewhat difficult passage, as Kerrigan begins the\nmore psychoanalytic part of his argument. Here are the basic points: we had observed that\nMilton sometimes seems like a kid who is still very interested in secrets about how things work,\nand in \"the categories of familiar experience\" -- thus you get all these questions like, how do\nAngels fight, how do Angels have sex, do Angels poo, etc.. In fact, (he argues), the sources of\nthis poem are not only in Milton's announced, conscious, adult desire -- a perfectly rational and\ngeneral one -- \"to justify the ways of God to man\", but also come from childhood and the\nunconscious: \"reason does not initiate the desire for meaning.\"\nWhat are those pre-rational sources of a desire to find meaning, to understand something?\nKerrigan argues that Milton's blindness felt like being punished by God the father for something\nhe had not done, but only wanted to do; in other words, that he understood his blindness, at some\ndeep level, in a way that reiterated the experience of early childhood. The \"oedipal child\"\ndiscovers that he can't feel pleasure all the time (Freud associates that kind of pleasure with the\nexperience of being an infant sucking at the mother's breast, and unaware of being separate from\nthe source of pleasure); he interprets these new limits as being imposed by the father, and\nunderstands them as a punishment for his desire to have pleasure from the mother. (This\npunitive experience of being cut off from what you thought was a pleasurable part of your own\nbody characteristically is represented in dreams, fantasies, or myths as castration, or blinding).\nThe adult relationship to God recapitulates the infant's relationship to the father at another level,\nand just as the infant submits to the father's law (because the father is stronger, but also because\nhe loves him), so the adult accepts the justice of God's punishment but with \"the positive\nexpectation of regaining in the future\" some version of what he's given up. We may restrain our\ndesires in this life with the hope of having them satisfied in heaven if we are good -- Kerrigan\nargues that Milton must have hoped that if he accepted the justice of his loss, God would\nsomehow restore to him the world of visible objects that his blindness had taken away.\n107-11: you may find this part cool if you're interested in physiology -- otherwise, skip or skim it\nand just read the summary.\nMilton's time had inherited from the ancient Greeks certain ideas about the body, what made it\nalive, and how it related to the soul. One system of thinking, derived from the Greek physician\nGalen, imagined that the body was animated by three \"medical spirits\" (these are distinct from\nthe soul, and relate only to the body): the liver generated \"natural spirits\" that cause you to be\nalive; the heart generated \"vital spirits\" that cause the various emotions and passions; the brain\ngenerated \"animal spirits\" that cause thought. These spirits operate very much like blood or\nother fluids circulating within the body. In the passage from book 5 quoted on 110, Kerrigan\nnotices that Milton has added a fourth, \"intellectual\" spirit -- in this framework, the animal spirits\ntake care of reasoning while the intellectual spirits (before the fall) cause intuitive knowledge.\nAngels characteristically know things intuitively, while Adam and Eve made more use of\n\nreasoning. The fall, however, especially impaired man's intellectual spirits. Beginning with\n\"Satan twice attacks the spirits of Man\", Kerrigan begins looking at evidence suggesting that\namong other things, the Fall inaugurated a disease process (it was \"pathogenic\") affecting the\nentire human system and all its components. Due to this disease process, man will no longer\nhave the possibility gradually to refine himself so as, for instance, to be able to eat angelic food,\ninhabit angelic realms and know intuitively as angels do. (That was \"the Pelagian program of\nRenaissance hermeticism\" (112), an esoteric belief that original sin was not transmittable, and\nthus human beings were capable of perfecting themselves). Instead, he will be dragged down\ninto the physical body, towards \"brute matter\".\n115-17: this part of the essay seems especially critical to me. What Kerrigan calls\n\"voluntarism\" is an idea that God's commands are arbitrary expressions of his absolute power\nand will (Latin: voluntas) unconstrained by any need to make sense. The idea that some people\nare pre-destined for salvation or damnation long before they are born would be an example. The\ncommandment not to eat from the tree of knowledge may or may not be an example, and that's\nthe question being discussed here.\n118: Marvell's poem (it was part of the prefatory material for Paradise Lost) compares Milton to\nthe character of Samson in one of Milton's other works, who pulled a temple down to ruins in\norder to revenge his blinding. He wonders whether Milton might not feel a similar aggressive\nimpulse towards God. Kerrigan: in writing Paradise Lost Milton engaged in a \"purgative\ndenial\" of his possible anger against God -- he thinks through the meaning of his blindness by\nmaking it into a version of what has happened to all of us as a consequence of Adam's\nexperience, so that Adam (who works through things and accepts his punishment as just)\nbecomes a surrogate in the poem for Milton as a historical individual rather than as a generic\nhuman being.\n119-24: Kerrigan thinks about what vision and blindness mean in the poem, and why it was\ncritical for Milton to imagine heaven as (in however refined a way) a material place. I find this\npart of the essay useful in thinking about what inspiration, intuition, creativity meant to Milton.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Unusual Vocabulary in Grossman",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/baf3f44068c26f28b0b6ba213622c889_MIT21L_705S09_read07.pdf",
      "content": "Unusual vocabulary in Grossman (from the OED).\nEschatology: The department of theological science concerned with 'the four last things: death,\njudgement, heaven, and hell'; thinking about ends.\nPredicate: 1. Logic. That which is predicated or said of the subject in a proposition; the second\nterm of a proposition, which is affirmed or denied of the first term by means of the copula, as in\n'this man is my father', 'Peter is a man', 'all men are mortal', 'the sun is rising'.\nProlepsis: 1. The representation or taking of something future as already done or existing;\nanticipation;\nSynecdoche: A figure by which a more comprehensive term is used for a less comprehensive or\nvice versa ; as whole for part or part for whole, genus for species or species for genus, etc.\nSublation: lifting up/taking away.\nTropological: Metaphorical, figurative (of tropes, or figures of speech).\nDialectical: 1. a. Of, pertaining to, or of the nature of logical disputation; argumentative,\nlogical.\nDialectic: 2. In modern Philosophy: Specifically applied by Kant to the criticism which shows\nthe mutually contradictory character of the principles of science, when they are employed to\ndetermine objects beyond the limits of experience (i.e. the soul, the world, God); by Hegel (who\ndenies that such contradictions are ultimately irreconcilable) the term is applied (a) to the process\nof thought by which such contradictions are seen to merge themselves in a higher truth that\ncomprehends them; and (b) to the world-process, which, being in his view but the thought-\nprocess on its objective side, develops similarly by a continuous unification of opposites.\nApocalyptic:\n2. Of the nature of a revelation or disclosure; revelatory, prophetic.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Unusual Vocabulary in Kerrigan",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/d02f50298ddf1c6549722af256f56ee7_MIT21L_705S09_read06.pdf",
      "content": "Unusual vocabulary in Kerrigan\nAll definitions of English words are taken from the OED online, unless otherwise noted..\n91 pneumatology: The science, doctrine, or theory of spirits or spiritual beings\n92 Hermeneutic circle: hermeneutics is the theory of interpretation, of how we interpret. The\nhermeneutic circle is a phenomenon by which \"our understanding of the parts hinges on\nour understanding of a larger whole, which, again, can only be understood on the basis of\nthe parts\" (Stanford Encyclopedia of Philosophy).\n95 \"when, for example, the Lady is left paralyzed after successfully repelling her tempter\": the\n\"Lady\" here refers to a character in Milton's early drama, Comus, not to Paradise Lost.\n98 typology: The study of symbolic representation, esp. of the origin and meaning of Scriptural\ntypes; a type is that by which something is symbolized or figured; anything having a\nsymbolical signification; a symbol, emblem; spec. in [Christian] Theol. a person, object,\nor event of Old Testament history, [believed to be] prefiguring some person or thing\nrevealed in the new dispensation.\nontological: pertaining to the nature or essence of being or existence.\n100 res: thing.\nsemantics: (the study or analysis of) relationships between linguistic symbols and their\nmeanings.\n102 scatological: excremental.\n103 monism: Any theory, or system of thought or belief, that assumes a single ultimate\nprinciple, being, force, etc., rather than more than one.\n104 polysemy: The fact of having several meanings; the possession of multiple meanings,\nsenses, or connotations.\n105 Oedipus complex: see the related article in Encyclopedia Brittanica\npsychogenesis: The origin or development of the soul, mind, character, etc.; the psychological\norigin or cause to which a given behaviour, condition, etc., may be attributed.\n112 Pelagian: relating to beliefs that original sin is not transmissible, that human will is capable\nof good independent of divine grace.\n113 apodictic: established on incontrovertible (absolutely certain) evidence.\n\n117 voluntarism: a doctrine which regards will as the fundamental principle or dominant factor\neither in the individual or the universe. (Here, the idea that God gives the commandment\nwhich forbids eating the fruit purely as an expression of his will, arbitrarily choosing that\nparticular act to forbid rather than forbidding it because of the nature of the act that is\nforbidden).\n119 gutta serena: a medical term for Milton's particular form of blindness, the \"drop serene.\"\n124 mentality: i.e., a purely intellectual or mental (vs. corporeal) existence.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "What Happens in Paradise Lost",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/618fdba12e177ee02df6ef606e61abeb_MIT21L_705S09_read01.pdf",
      "content": "What happens in Paradise Lost\nNote: square brackets indicate that events are narrated retrospectively in this book although\nthey have happened at some other time.\nBook\nChronology of Events\n[V]\n1. God announces that the Son will be head of all the Angels.\n[V]\n2. Satan leads his angels into rebellion.\n[VI]\n3. War in Heaven; the rebel angels are cast down into hell.\n[VII,\nVIII, IV]\n4. God creates the world, Adam, and Eve; humans are intended\neventually to replace the lost Angels.\nI-II\n5. The rebel angels plot their next move; Satan leaves hell.\nIII\n6. God sees Satan, and foretells that he will successfully tempt Adam\nand Eve; the Son offers to save humanity.\nIV\n7. Satan reconnoiters Eden; Eve tells Adam about her creation (4); Satan\ntempts Eve in a dream.\nV\n8. Eve tells her dream to Adam; Raphael is sent by God to warn Adam\nand Eve, and relates the events of 1 and 2.\nVI\nRaphael relates the events of 3.\nVII\nRaphael relates the creation of the world in 4.\nVIII\nRaphael and Adam discuss planetary motion and marriage; Adam\ndescribes his own creation (4).\nIX\n9. Satan enters the body of a serpent and tempts Eve; first she, then\nAdam succumb.\nX\n10. The effects of original sin become evident; Adam and Eve wonder\nwhat to do.\nXI-XII\n11. Michael gives Adam and Eve a preview of history before leading\nthem out of Eden.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "What Happens in Paradise Lost",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-705-major-authors-rewriting-genesis-paradise-lost-and-twentieth-century-fantasy-spring-2009/e934fed011bcfb5b42019e61577c0a25_MIT21L_705S09_read03.pdf",
      "content": "In the concluding sections of her essay, Nyquist alludes to some earlier texts that you may or may not\nalready know: Aeschylus' set of three plays on the House of Agamemnon (the Oresteia) and Midsummer\nNight's Dream. She is drawing a contrast between what happens in Milton's poem and in these other two\ntexts, and it goes something like this.\nThe Oresteia begins at the conclusion of the Trojan war, when the Greek commander Agamemnon\nreturns home. In his absence, his wife Clytemnestra has ruled the country cruelly, has also taken as a\nlover a man whose father was grievously injured by Agamemnon's father -- so grievously that he had\ncursed Agamemnon's house before dying. She has not forgiven Agamemnon for killing their daughter as\na sacrifice to ensure favorable winds for the Greek fleet. When Agamemnon returns with a Trojan\nprincess and his concubine, Clytemnestra slaughters them. In the second play, the children of\nAgamemnon and Clytemnestra (Electra and Orestes) avenge their father's death: Orestes kills both his\nmother and her lover, but then is pursued by the Furies, female spirits of vengeance particularly\nconcerned with the murder of kindred. In the final play, Orestes seeks to have his guilt adjudicated by a\ntrial, presided over by the goddess Athena -- Athena decides in his favor, and conciliates the Furies by\nwelcoming them to Athens as beneficent powers.\nWhat Nyquist is interested in here is the forms of resistance to masculine rule enacted by Clytemnestra\n(because of her love for her daughter) and then by the Furies, on the half of Clytemnestra as Orestes's\nmother. In this text, as she points out, female bonding is associated with murder, adultery, and the\ninsatiable pursuit of vengeance -- so obviously it must be suppressed (notably, by Athena, a goddess who\n-- like Sin -- was born from her father's head without the participation of a mother).\nMidsummer Night's Dream not only has actual Amazons, who were fighting against Athens until its king,\nTheseus, managed to woo their queen; it also has a pissed off fairy queen, who refuses to give her\nhusband something he wants, a little boy who is the child of a woman she loved -- as a consequence of\ntheir quarrel, crops are failing, the weather is strange, and all of nature is in disorder. Finally, the play\nfollows four young Athenian lovers whose affections are mismatched, and further shuffled by a\ntroublemaking fairy. In the process, one young woman believes herself mocked by the other, and begs\nher to remember that time (prior to falling in love with the young men) when their friendship was all in all\nto them, and they were one heart in two bodies.\nIn both these texts, Nyquist points out that the existing or remembered bonds between women present an\nobstacle to kings, fathers, and so on, and these bonds are represented in very prejudicial terms:\nClytemnestra's loyalty to her daughter gets conflated with adultery and murder. Obviously, the Amazons\nmust be prevented from conquering Athens, and Clytemnestra must be brought to justice. In Paradise\nLost, by contrast, there is no other woman -- much less a mother -- for Eve to form a bond with; Adam has\nno real rival. If Eve initially resists \"yielding\" to him, it is in favor of a kind of experience rather than an\nactual alternate bond with another person.\nNyquist also invokes Freud. I don't want to get too deeply into this topic, but -- broadly speaking -- she is\nmaking a large argument that psychologies are shaped by the conditions of childhood and families, and\nthese in turn change over time as social and economic structures change. Freud's understanding of the\nmind and his tools for analyzing that mind are thus not valid in a transhistorical way, but rather for\nparticular historical conditions -- especially those relating to the idea of the home as a private, domestic\nsphere, versus the public culture of politics, work, and trade. (I've already mentioned that medieval\npeople seem to have had little resembling modern ideas of privacy, and the home would typically have\nbeen a place of production rather than the place where you went to rest from producing. There are many\nother changes in the nature of the family that would go along with these and other observed\ndevelopments). Nyquist argues that Milton's text not only reflects the emergence of those conditions, but\nparticipates in creating them.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21L.705 Major Authors: Rewriting Genesis: \"Paradise Lost\" and Twentieth-Century Fantasy\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}