{
  "course_name": "Major Media Texts",
  "course_description": "This class does intensive close study and analysis of historically significant media “texts” that have been considered landmarks or have sustained extensive critical and scholarly discussion. Such texts may include oral epic, story cycles, plays, novels, films, opera, television drama and digital works. The course emphasizes close reading from a variety of contextual and aesthetic perspectives. The syllabus varies each year, and may be organized around works that have launched new modes and genres, works that reflect upon their own media practices, or on stories that migrate from one medium to another. At least one of the assigned texts is collaboratively taught, and visiting lectures and discussions are a regular feature of the subject.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Criticism",
    "Fine Arts",
    "Media Studies",
    "Humanities",
    "Literature",
    "Criticism"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nThis subject involves intensive close study and analysis of historically significant media texts that have been considered landmarks or have sustained extensive critical and scholarly discussion.\n\nGoals\n\nTo provide sufficient exposure to various media and ways of interpreting them so that you feel comfortable analyzing, comparing, and appreciating their distinctive features (kinetic, visual, textual, and aural).\n\nTo reflect in some depth upon questions of translation, adaptation, thematic analogies and functionalities across media.\n\nTo explore the political, spiritual, philosophical and cultural layers in representation and performance as well as their expressive, communal and escapist functions.\n\nTo recognize the importance of historical and cultural conditions in the creation and interpretation of media texts, and to consider why and how certain works remain influential across time and space.\n\nTo develop a specific, shared vocabulary to help in the work of analysis.\n\nTo expand your horizons of pleasure and knowledge.\n\nTo pursue research and practice oral and written communication that will crystallize and convey your understanding.\n\nRequirements/Grading\n\nThis seminar will rely on lively interchange; therefore attendance and full participation are required. This means having read/viewed the assigned texts carefully and on time, having some questions and specific responses to them that you can share, and being sufficiently alert to join in an animated, probing conversation. A variety of written assignments will allow you to respond to our topics in different ways.\n\nI will consider each of the requirements in determining your grade. If you cannot be in class or meet a deadline because of an emergency, please speak with me (in advance, if possible); otherwise, absences and late papers will adversely affect your grade.\n\nApproximate Weighting\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Discussions, Attendance at Events, Preparation and Active Participation\n\n20%\n\nOral Presentations and Reports\n\n20%\n\nComparative 10-page Essay\n\n20%\n\nOther Written Work\n\n20%\n\nFinal Project, Including Presentation and Research\n\n20%\n\nI reserve the right to alter the weighting somewhat in exceptional circumstances; usually this works to your advantage. If written work is incomplete or attendance is infrequent, you will not pass the course.\n\nPlagiarism\n\nPlagiarism - the use of another's intellectual work without acknowledgement - is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution consult the style guides available in the MIT Writing and Communication Center and the\nMIT Web site on Plagiarism\n.\n\nIn addition to welcoming your participation in class, I encourage you to discuss your ideas and your writing with me during office hours, or at other times convenient for us both. I also encourage you to share thoughts with the group via email.",
  "files": [
    {
      "category": "Resource",
      "title": "finkelberg1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/7818c21723579568faf36d2630b6608a_finkelberg1.pdf",
      "content": "Photograph (\"Finland 2\" by Spencer Tunick, 2002) removed due to copyright restrictions.\n\nThe link between theater and politics may be obfuscated by the\nunderstanding that one is real and the other is mimesis. Perhaps this isw\nmakes theater such an effective medium for communicating dissent\nS \"\norganization helps to elucidate its absurdities and injustices in a setting 6w + q c\nhi.-\nthat is almost real. The political function is reasonably clear for actors who spe\nbut may not be asclear when the character is not written into the play as an\nbbwq'\nembodied character but asan offstage presence that &ects the actors in vario\nmanners.\nvA\n~ ~ y : ~ ~ h ~\n;dd7\nA\nfunctions in three distinct ways1\nI\nI\nor figurative\ndirectly in the text, either as a character with a spoken part or a character defined\n.@e;\n-\n\\\\ \\* $7by the other characters. This body is rich with authorial intent, it is the body\nc 5\nC\nIS\"'\" \"/*\n#'\ncreated by the playwright to convey meaning. Secondly there isthe performance\n\\d\"\nbody through which the character is activated, filtered, and adapted. Although a\n/reader can imagine the performing bodyLgination can not embody the\nc$'\n+/,bjective\nidentity in the way a real\nThis embodiment produces a\nrelationship between performance and audience that is distinct from the\nC,lL2\n'\"'.rw>Ar \\bodies in the written play and in our imaginations. Finally there is an ideological\nd*\nbody, the political body. This body exists within both textual and performance\nbodies and is the outgrowth of body theory, omp&ed of its individual\nF\nG-\nsubjective la\\The political body, as I am choosing to call it, is the sigruficance\nof certain qualities of identity (e-g. race, gender, etc.) within its social context. It is\n\nthis body that gives Ganing to both the textual and the performance body.\nR\nThese three categories provide a framework for examining onstage and offstage\nbodies.\nIt may be useful here to clarrfy what is meant by \"body theory\". Early\nphilosophic explorations into the body as a concept introduced questions of\nveracity. Is the corporeal body real and how can we know that? Descartes is\ncredited with initiating the mind-body split, when \"I think therefore I am\"\n2 kita&' + c v w W W'\nbecame the credence for understanding the relationship between corporeal and\n/-\n' E.\n~ d *\n:\nAd\n1,\ncognitive. Descartes posited that he was a brain in a jar imagining the body of a\n...-\ne -\n/\n.\nr557 -\nLA\nman.This crucial turn literally sublimated the body as a social receptor; if it is\nIv\n~\nj\n\nnot even really there, how can it be a valuable consideration for social theory? In\ntheir introduction to \"The Body: A ReaderJ' M. Fraser and M. Greco quote\n' 'G\nThomas Osborne's claim that disregarding the body in entirety is as \"misguided\"\nA\nas disregarding cognition. He provides a valuable framework for what body\nstudy may produce:\n[not] a representation of what the body is (of providing a theory of the\nbody, or of asserting its irreducibility) but [to log] the ways in which the\nbody is a problem; and a problem in the positive sense- not just as an\n'obstacle', but as a vehicle for thought and action.1\nCurrent social construction theories do not view the body as a biological\ngiven but as constituted in the intersection of discourse, social institutions, and\nFraser, Mariam and Monica Greco. The Bodv: A Reader. London and New York: Routledge 2005\nP-3\n\n\" 7\nthe corporeality of the body.2 Also termed subjectivity, this view de-centers the\nindividual in the Cartesian sense (that identity and being are mutually\ninterdependent) and reframes \"human nature with concepts of history, society\nand culture as determining factors which determine individual identity and\ndestabilize the coherence of that identity by making it an eflect rather thansimply\nan origin of linguistic practice.\"3 Social analysis has expanded from studying the\nbody as an object of social control and discipline \"in order to legitimate different\nregimes of domination\" 4 to perceiving it as a subject that creates meaning and\nperforms social action.5\nThe body has become a necessary critical layer in gender and ethnicity\nstudies because although we may all be merely brains in jars, some of us have\n- 1\nce/ . imagined more empowered bodies for ourselves than others. And if we are\n!c\\\\\ncorporeal and real, the body is a necessary filter for everything the brain\nexperiences; the two can not be separated or conveniently reduced. Therefore,\nexamining the body in text may uncover a substantial layer of subtext and\nmeaning.\nHow an author chooses to create bodies from words is often more explicit\nthanthe words themselves. In the cases of Antigone and The Island, the invisible\nSasson-Levy, Orna and Tamar Rappoport. \"Body, Gender, and Knowledge in Protest\n~overnents~he\nIsraeli case\". Gender and Society Vol. 17, No. 3. June2003 p. 381\n3 %id. 381\nFoucault, Michel. Discipline & Punish:The Birth of the Prison. New York: Vintage, 1995. pp. 75-\nSasson-Levy, Orna and Tamar Rappoport. \"Body, Gender, and Knowledge in Protest\nMovements: The Israeli case\". Gender and Society Vol. 17, No. 3. June2003 p. 381\n\nbodies and offstage characters (Polynices in Antigone and Hodoshe in The Island)\nfunction as complex political symbols of power and powerlessness. In that they\nare both created for a performance medium, theater, an additional physical layer\nJ is added as the characters are literally embodied or markedly not embodied.\nA reader reading a written version of a play must create \"bodies\" from the\ntext to act out the parts in her imagination. A viewer in the audience at a\nperformance of the same play may think of the bodies she is seeing as\n\"characters\" and thus experience the bifurcation of textual body from\nperformance body. This separation becomes more sigruficant when the material\ninvolves torture or pain because\nlayer is removed in the\nprocess of embodying that may allow a viewer a voyeuristic, pleasurable\nsensation in lieu of (or simultaneous to) a feeling of disgust or revulsion. The\n&di%7\n( ! Y \\ ~ ~ % A\npoliticized body\nctions in complex ways; it not simply corporeality, a\nI\\,\nn\n\"docile body\", yet is it not liberated from the means of corporal control. Both of\n-I\nw K f i d m , q M - + ?\nx\nL.these aspects figure into the tension that compr&<s the\nA\nprisoner-p\nf l initial dissent that brings about incarceration and the process of retaining or\n'b'e /\nbe qJ,~%eiinquishingthat dissent beyond torture. It is the aim of this essay to explore\n\\PI\nthis tension between textual and performance body of Antigone and The Island\nexamining the body's relationship to torture and subjugation in each text and\nconside&&\nembodiment through performance may or may not affect tlus\nrelationship.\n\\\"\n\nThe story of Antigone, a young girl who defies the law of her uncle,\nCreon, to bury her fallen rebel brother Polyniceswas not new when Sophocles\nY\nappropriated it in 5th century B.C. Greece. The story came out of an oral tradition\nthat was by 441 B.C. already a familiar medium to the hundreds of thousands of\ntheater goers now regaled by costumes, masks, and dramatic performance. Inhis\nintroduction to the play, Bernard Knox explains that while the stories were\n\"preserved and created images of universal signrficance.. . [they] also had the\nauthority of religion; these stories are the sacred tales of religious cult and recall\n(or rather create) a time when men and gods were closer than they have been\never since.\" 6 The origmal relationship of these myths to Gods and religious life is\nsigruficant as it frames theater in\ninteresting analytic\nquestions about how these\nSophocles' play\nunburied on the battlefield, just outside the city of Thebes. To remain unburied\nand unrnourned is the greatest of allpossible degradations to an ancient Greek.\nUnburied bodies can not make the voyage to the afterlife. While Polynices is not\nvisibly onstage in this play, the presence of his rotting\nof Antigone and her sister Ismene's argument over what to do about the burial.\nAntigone cries, \"He's to be left unwept, unburied, a lovely treasure for birds that\n6 Sophocles, Robert Fagels, Bernard Knox.\nOedipus at Colonus. New York: Penguin Classics 1982p. 23\n\nscan the field and feast to their heart's content.\"7 The image of the fallen warrior\nI\neaten by birds invokes Polynice\na degraded body punished by law.\nHegel found the power distribution between Antigone and Creon not a\ntension between right and wrong but a tragic conflict of two equal sides, each\npossessing some good; \"a collision between the two highest moral powers.\"s\nEvidence for the claim that Sophocles found Creon sympathetic was drawn from\nhis opening speech. Creon asserts that it ishis duty to protect the city, \"Zeus as\nmy witness ...I could never stand by silent, watching destruction march against\nour city.\"9 Here\nrighteous leader who is acting on behalf of the gods to\nprotect his\ndegenerates into sadistic and vindictive language\nas he calls for Polynices to be \"left unburied, his corpse carrion for the birds and\ndogs to tear, an obscenity for the citizens to behold.\"lo It does seem that this is the\nP&\npoint where Sophocles ceases to even1 distribute sympath . Creon appears to be\nacting not as a benevolent or\npunish. He declares: \"Never at my handswill the traitor be honored above the\nPolynices' body is further degraded as the Sentry explains that it hasbeen\nsprinkled with dust and given proper rights but \"not a sign in sight that dogs or\n7 Ibid. p.60\n8 Ibid. p. 23\n9Ibid. p. 68\n' 0 Ibid. p. 68\n\" Ibid. p. 68\n\nwould beasts had worried the body, even tom the skin.\"* Thisline does not\nseem to have a narrative function other than to illicit the vulnerability of a dead\nexposed body, to underscore the humiliation bestowed upon Polynices for the\n/J\naudience and recall Creon's declaration that thisis exactly what should happen\nto the enemy's body.\nT\nAlthough not visible onstage, Polynic\ndy provides two discrete\nlends the motivation his sister Antigone needs to actively defy\nit establishes the tone and shape of the State by giving Creon\na reason to declare a law, establish his authority as a lawmaker, and have\nsomething to enforce. In Discipline Gz Punish, Michel Foucault explores d\nnot only\nthe history of the modern prison\ntechnique\" that in part\nA\ndefines the State by ensuring that thei-e will alwaysbe an opposing tension, an\nenemy of State, to urufyagainst, punish, and control. \"The correlative of penal\njustice may well be the offender, but the correlative of the penitentiary apparatus\nis someone other; this is the delinquent, a biographical unity, a kernel of danger\nrepresenting a type of anomaly.\"l3 Recall Creon's categories \"traitor\" and\n\"patriot\". By establishing Polynices as a traitor, Creon has drawn a boundary for\n/J\"\ne State. This distinction is at the root of State power and human organization\ncould not function withoufan-)mderstanding of what is collective good and what\n12 Ibid. p. 73\nl3Foucault,Michel. Jkcipline & Punish:The Birth of thePrison.New York:Vintage Books,1995\nP, a% , , \\ \\ \" l : \"';\n\nThe fallen and debased body of Polynices sets in action the events that\nwill ultimately complete the tragic end to three people and undermine the\nauthority of the State. It is this invisible body that primarily motivates the choices\nof all of the other characters and ultimately actors.\nThe Island by Athol Fugard, John Kani and Winston Ntshona opens with a\nscene of physical torture. Two prisoners perform the futile and exhausting task\nof digging a hole in the beach; as one digs, the other fills. When they are\nexhausted, they are then forced to run while tied together and simultaneously\nbeaten brutally. The scene has no dialogue and is written in the text as a stage\ndirection. The two prisoners, John and Winston, enact torture that is being\ninflicted upon them yet there are no other actors onstage. Like Polynices in\nAntigone, it is an unseen body in this play that sets the narrative in motion. /\nThe body of Hodoshe, the prison warden in this scene, remains unseen\nthroughout The Island and is shaped only by the words of John and Winston. The\nfirst spoken word of the play is Winston calling \"Hodoshe!\" a meaningless\nsound for anyone unfamiliar with the Afrikaanslanguage (the majority of the\nf>\nw\nplay's ori@\naudience was foreign). A reader may look up the word's meaning,\ndiscover the relationship to carrion flies which feed on the dead, and surnrnaril Y\n/\nmake the connection to e Creon's desire that Polynices' flesh be eaten by\ncarrion. In this way, Hodoshe becomes not only the violent, invisible, warden of\nthe State but also the parasite that sustains itself on its ward. This connection is\nJ\nmade on a textual level but must also translate elegantly to the stage. One can\n\n'2\nimagine how the scene of two men being beaten by an invisible force would\nvisibly invoke the confines of oppression.\nMarla Carlson suggests that \"by] rendering the warden and the guards\ninvisible, The Island depersonalizes the entire South African social system and\nfocuses id the effects of oppression on the bodies of the two pris0ners.'4~' Perhaps\nI\nit would be impossible for one actor to embody the complexity of the South\nAfrican apartheid system or the human cruelty necessary to violently beat\npolitical prisoners. Hodoshe is missing from the stage, in body, but he is present\n, (ti'\nin all of the empty space around the men we see.\nL\nCarlson continues, \"Aristotle pbmted out, theater represents pain in order\nto create pleasure; and secondly, it \"tends to establish [a] (false) complicity\nbetween the victimizer and the victim\" because the actor who plays the victim\n\"isactually onstage by choice; the real victim is not\"J5 The separation of the\nphysical body of the actor from the physical body of the character he or she is\nembodying enables viewers to experience violent and troubling acts at a safe\ndistance. This distance is amplified when we consider the effect that skill and\ncelebrity have on the performing body. Carlson finds The Island \"foreground(s)\nthe actor's skill and athletic exertion in representing the victim's pain [so] the\nspectator is likely to respond not only to the martyr but also to the actor, who is\nl4 Marla Carlson, \"Antigone's Bodies: Performing Torhue\". Modern Drama Vol. 46, No. 3. Fall,\n2003 p. 390\n15 Ibid. p. 382\n\nempowered by his or her creative contribution to the theatrical event.\" l6The\nprocess of embodying pain or torture inherently removes it several degrees from\nits unthinkable reality. On one hand this exposes audiences to situations and\nfeelings they might not otherwise experience. On the pfher are the yarning signs //\nd\nof the numbing effect Susan Sontag cautioned against \"the risk of making the\ni\"\naudience passive, reinforcing witless stereotypes, confirming distance and\ncreating fascination\" 17.\nnfi$l 64\nI believe the form& override4 the later, that \"performing torture\" can have\na greater effect than reading about torture. Clearly a theatrical mimesis will not\nYtJl b\ns\npossess the intensity of the torture itself but more rntensity than the text alone,\nA\nbecause it is embodied. If, as Carlson suggests, the actor's body offers a distance\nfrom the torture, surely the reader's imagination must offer a similar protection\nrendering it an almost moot point. Unless it is the godto likral&beat a message\n.\ninto our audience, we may be content with a degree of removal. However, I do\nfind that complex political messages performed into a void do tend to evoke a\nsense of complacent satisfaction, as Carlson also indicates. A 1986audience could\nexperience The Island, feel bad and go back home feeling satisfied that they had\nfor a moment truly understood the violence and absurdity of apartheid but not\nbe moved to do anything. Perhaps a progressive solution that addresses\nSontag's valid concern but still utilizes the evocative nature of theatre would\n16 Ibid. p. 384\nl7 Ibid. p. 382\n\n- -\nintegrate some form of action into the performance. I am thinking of the \"What\ncan I do now?\" handout that accompanied Michael Moore's \"Fahrenheit 9-11''\nwhich gave emotionally charged audiences\nconcrete suggestions for how\nto enact change. Without thiskind of inclusion, protest theater runsthe risk of\nminimizing both the problem and the solution; rendering what could be a deeply\ndisturbingissue as superficial pith- )'$-I,$\nI f\n/Mdh-\nf\nBody theory provides an interesting filter through which theater is both\ncomplicated and clarified. By examining only two of the bodies of these complex 9dh,\nGILL dl&\nplays, we can begin to see how much meaning is embedded in the body's\n' ULJ)m4\nconstruction, how it affects characters and situations and how it is performed (or r n k\nnot performed). A deeper understanding of thisconstruct can only improve the &&J,@-ji\nway we think about performing bodies and their relationship to politics. Aqf-m,&&\nbody and performance and their relationship to some class materials. I have not\nmentioned the converse, and equally interesting, relationship of protest as\nthe work I've dedicated to subjdvity and body theory in thispaper will be\n-\n&,/\n\nBibliography:\nFoucault, Michel. Discipline & Punish: The Birth of the Prison. 2nd ed. New\n-\nYsrk: Vintage Books, 1995.\nAnderson, Patrick. \"To Lie Down to Death for Days: The Turkish hunger strike,\n2000-2003\" Cultural Studies Vol, 18, No, 6 November 2004, gg, 815-846\nCarlson, Marla. \"Antigone's Bodies: Performing Torture\". Modern Drama Vol.\n46, No. 3. Fall, 2003 pp. 381-403\nDurbach, Errol. \"Sophocles In South Africa: Athol Fugard's The Island\".\nComparative Drama Vol, 18, No. 3. Fall, 1984 pp. 252-254\nFugard, Athol, John Kani, Winston Ntshona. Statements. New York: Theater\nCommunications Group, Inc. 1986\nFraser, Mariam and Monica Greco. The Body: A Reader. London and New York:\nRoutledge2095\nSasson-Levy, Oma and Tamar Rappoport. \"Body, Gender, and Knowledge in\nProtest Movements: The Israeli case\". Gender and Ssciety Vol. 17, No. 3. June\n2003 pp. 379-403\nSophocles, Robert Fagels, Bernard Knox. The Three Theban Plays: Antigone,\nOedipus the Kina Oedipus at Colonus. New York: Penguin Classics 1982"
    },
    {
      "category": "Resource",
      "title": "ford1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/be11e74563a8329466ca4d1ce4cbc89a_ford1.pdf",
      "content": "Sam Ford\nTwo Worlds: Aspects of Shelley's Frankenstein in Miller's Capote\nSome works act as master narratives for our culture, evolving and being appropriated by\neach successive generation to take on new meanings; shed old ones; and to mirror, challenge,\nand/or critique the contemporary culture. Mary Shelley's Frankenstein has become one of these\nstories. While the book remains in wide circulation through numerous editions, Frankenstein's\ngreatest triumph may be its role in shaping numerous tales that follow it. One such work is\nBennett Miller's film Capote (2005).\nThe similarities between Frankenstein and Capote are not as apparent on the surface as\nFrankenstein's own connections to Prometheus, Faust, or Paradise Lost. Most initial reviews of\nCapote compare it only to the book it is about--Truman Capote's In Cold Blood, which details\nthe death of the Clutter family in Holcomb, Kansas, a husband and wife and two children who\nwere murdered by Perry Smith and Dick Hickock. Nevertheless, the narrative structure of\nCapote and the depiction of its Truman Capote character not only parallel but borrow from\nseveral of the themes and narrative structures of Shelley's Frankenstein.\nThis essay illuminates these points of similarity between Capote and Frankenstein to\nillustrate the ways in which Shelley's work remains an inspiration for contemporary American\nnarrative. I focus on the ways in which Capote has transformed essential themes into another\ngenre and time. By comparing the similarities in narrative structure between Frankenstein and\nCapote, I create a series of intersections through which the two works can be compared--the\npreparation for creation, the ambivalence of creation and abandonment, the two narrative worlds,\nand the final reconciliation/destruction. While the makers of Capote likely did not actively\nappropriate these themes from Frankenstein, the parallels between the two texts demonstrates\n\nhow the Frankenstein story has become so wholly incorporated into our collective narrative\nconsciousness. First, however, I will briefly discuss at the metanarratives of both works to\nhighlight the ways in which Capote both draws from and departs from Shelley's work.\nMETANARRATIVE\nIn \"The Ambiguous Heritage of Frankenstein,\" George Levine points out that many\nscholars bemoan the replacement of Shelley's Creature with James Whale's Universal horror\nfilm version of the Monster, played by Boris Karloff (1931). However, Levine argues instead\nthat Shelley's Frankenstein remains alive, not just as a classic book or required reading on\ncollege campuses, but also as \"a metaphor for our own culture crises\" (25). He outlines several\nways in which the Frankenstein story frames the discussion of issues that continue to be debated\nin subsequent periods, one of which I will return to. Capote continues in this tradition, as many\nof the binaries in Shelley's tale of creator against creature remain useful in examining Miller's\nfilm. These structural and thematic connections imply that many of the issues and struggles\nraised by Frankenstein have become imbedded in the storytelling traditions of the Western\nworld.\nOn the other hand, I do not want to reach too far in claiming similarities between the two\nworks, lest I be willing to make an error of overstepping my bounds like Victor Frankenstein did\n(though I hope that, even if the reader finds my claims to be a stretch, the error won't have as\ndangerous of consequences as Victor's). The dissimilarities between the two texts are glaring.\nOne of the most notable caveats is that Capote is a film and, thus, many of its narrative structures\nfollow a rich filmic history. The ways in which Miller tells the story differ from the nineteenth\ncentury writing conventions used in Frankenstein. Features such as the use of black-and-white\nand the generic construction of a biopic in Capote build on established filmic conventions that\n\nhelp set a particular mood and mode of storytelling. In Frankenstein, Shelley draws on many of\nthe autobiographical conventions of novels and travelogues from her time period to construct\nVictor Frankenstein's tale. The narrative comes in the tradition of the Gothic novel and the style\nof the Romantic period. Many features of Shelley's writing are most feasible in the novel, for\ninstance the use of letters to further the plot and explicit psychological drama through first-\nperson explanations of frame-of-mind. Capote can also depict psychological characteristics and\nutilize varied storytelling devices. However, Miller must do so through the conventions of filmic\nlanguage, where editing devices, facial expressions, lighting, and myriad other methods are used\nto convey the psychological motivations of characters.\nPerhaps even more important than the difference in medium are the divergent inspirations\nof the two narratives. For Shelley, Frankenstein builds on the work of John Milton and Johann\nWolfgang von Goethe and the narratives behind their work, as well as the myth of Prometheus.\nConversely, Bennett Miller recreates the life of a famed historical figure in Truman Capote and\ndepicts the writing process of a book based on facts, as Capote plays a mixture of novelist and\njournalist. This \"real\"/fictional distinction is important to keep in mind, as it places important\nrestrictions on the ways in which Capote can be read in the tradition of Frankenstein. Because\nCapote tells the story of the life of a fairly recent historical figure, Miller must contend with\nissues of fidelity and the inevitable comparisons to biographical details of Capote which viewers\nand critics can trace through various other sources. On the other hand, Shelley's tale is an\noriginal fictional creation, even as it builds on familiar myths of Western civilization.\nDespite the limitations of this study, there are ways in which, even structurally, Capote is\nreminiscent of Frankenstein. One such similarity is in the complexity of the mediation of each\nstory's telling. In Frankenstein, Shelley uses Captain Walton as a framing device. Walton\n\nrecounts Victor Frankenstein's story throughout the novel. Furthermore, his impressions of the\nCreature are Walton's version of Frankenstein's story, aside from the final encounter Walton has\nwith the Creature directly. Therefore, the version of the Creature we meet appears via the\nmediations of Frankenstein and Walton, as well as the author Shelley.\nCapote focuses on the ways in which Truman Capote gathered information for the\nwriting of In Cold Blood and specifically his relationship with Perry Smith. Thus, Perry Smith's\n\"story\" and what happened to the Clutter family that night are narrated by Smith through Capote,\nthen through Gerald Clark's novel and Dan Futterman's screenplay, to become Miller's film.\nThe differences between these remediations of the Creature's and Perry's story are glaring, since\nall of the framing tales in Shelley's story are fictional, while many of these frames around Perry\nSmith's story are not only based on \"reality\" but are actual remediations (from Capote's diary to\nbiography novel to screenplay to film) and not framing tales inside the actual story.\nNevertheless, the multiple layers of framing and retelling are important to note because both\nFrankenstein and Capote, aside from their narrative content, are stories about the telling of\nstories, the reliability and subjectivity of conveying a narrative, and the motivations behind\ncharacters' framing of stories. For Shelley, all of these remediations take place directly in the\ntext. In Capote, the many remediations of Perry Smith's story to reach the version of the film\nexist both preceding and within the work: Miller's telling of Futterman's telling of Clark's telling\nof Capote's telling of Perry Smith's telling of what happened. Both narratives raise questions\nabout the authenticity of the objective voice, narrator motivations (especially those of Victor\nFrankenstein and Truman Capote), and other issues of remediation inherent in all storytelling\nforms.\n\nPREPARATION FOR CREATION\nThe actual content of both stories follow a sometimes-similar trajectory, despite the great\ndisparity of the actual events depicted. Both stories begin with a foreshadowing. This first\nsegment in Frankenstein is much lengthier than in Capote. Miller's Capote supposes prior\naudience knowledge of who Truman Capote is and his authorship of In Cold Blood, one of the\ncanonical American books of the twentieth century. In Frankenstein, we get an indication of the\nstory's ending at the beginning, as Captain Walton views the Creature from afar and later finds\nDr. Frankenstein, who then tells his story. Shelley then gives us voluminous information about\nVictor Frankenstein's life previous to his creation of the Creature through Victor himself, who\ngives a chronological account of his upbringing and education.\nThis form of starting in medias res works differently in Capote. The work begins with\nthe first lines of In Cold Blood, whose publication will be the endpoint of the film. Miller then\nintroduces Capote at a point in his life before the tragedy in Holcomb has even happened. He\nhas just published Breakfast at Tiffany's and is now at the height of his arrogance, telling stories\nabout literary rival Jimmy Baldwin. Only in one of the next scenes, while Truman looks through\na copy of the New York Times and chances on a small blurb about the murder of the Clutter\nfamily, does the story of his relationship with Holcomb, and later Perry Smith, begin.\nAlthough through very different tactics, the beginnings of both stories juxtapose\ndrastically different points in each character's life to produce similar foreshadowing effects. The\nopening segments--the discovery of Dr. Frankenstein near death and the first few lines of In\nCold Blood depicting the discovery of the Clutter family's bodies--serve as a chilling\nforeshadowing which remains in the reader's/viewer's mind throughout the proceeding \"happy\"\nscenes. The arrogance of both Victor Frankenstein and Truman Capote depicted in these stories\n\nclash with our subsequent memory of what will happen in both of their lives: Capote's\ninvolvement in investigating a brutal story that will drag him far from the New York City\npenthouses of the intelligentsia who laughs at his jokes, and Frankenstein's current state of\nterrible health and his traveling through the arctic. Both characters demonstrate an overriding\narrogance, Victor through his studies and his growing feeling of power through the knowledge of\nscience and Truman through his finally being at the center of attention and captivating and\ncontrolling a crowd.\nCapote quickly launches into Truman's discovery of Holcomb and his decision to write a\npiece for The New Yorker. While Frankenstein may take a little longer to exit the expository\nphase, Victor leaves his innocence and his happiness behind for good when he begins to obsess\nover constructing and giving life to the Creature, barely writing to his father and Elizabeth.\nThrough first-person narrative, Victor demonstrates his frame-of-mind and his growing\nobsession with the creation, studying and robbing graves for body parts, \"pursu(ing) nature to her\nhiding places\" (32), all in preparation for constructing a being who would make him forever\nknown, whose creation would give him the ultimate power at the pinnacle of scientific\nachievement.\nAlthough the objective of Frankenstein and Capote is quite different, the path Capote\ntravels is, in many ways, very similar. He quickly becomes fixated on the story that will become\nIn Cold Blood. He sees it as his pinnacle of literary achievement, the work that would make him\nforever known. He declares it, \"The book I was always meant to write.\" Soon, just as Victor\ndid, Truman turns away from everyone, including his partner Jack and friend and early ally in\nHolcomb, Harper Lee. Jack calls him repeatedly, urging him to come home or to go to Spain on\n\na retreat. Instead, just as Victor becomes estranged from his former life, Truman refuses contact\nand completely immerses himself in the Holcomb story.\nTHE AMBIVALENCE OF CREATION AND ABANDONMENT\nTruman soon meets Perry Smith, and his understanding of the Holcomb story changes\nforever. He becomes fascinated with him, a relationship which leads Truman to tell not only the\nClutters' story and the police's story but also capture the perspective of Perry and Dick. Truman\nis simultaneously drawn to and repulsed by his relationship with Perry, feeling a connection to\nhim but also seeing himself in another class. At one point, after he and Perry have compared\ntheir childhoods in detail in one of their prison interviews, Truman says, \"It's as if Perry and I\ngrew up in the same house. And one day he went out the back door, and I went out the front.\"\nThis identification closely resembles Victor's feeling of identification with the Creature, even as\nhe is repulsed by his creation's actions.\nWhile Truman didn't \"create\" Perry Smith, he does create the Perry Smith character in In\nCold Blood and the public's perception of the man and his involvement in the murders of the\nClutter family. So, the Perry Smith discussed in contemporary society is almost as much\nTruman Capote's creation as the Creature is Frankenstein's. And it is fitting, then, that the\nambivalence of creation plays an important role in Capote, as it does in Shelley's Frankenstein.\nThe Creature repulses Victor:\"I had desired it with an ardour that far exceeded moderation; but\nnow that I had finished, the beauty of the dream vanished, and breathless horror and disgust\nfilled my heart\" (35). Yet, despite (and through) Victor's repulsion, many critics have seen how\nclearly the Creature acts as a double for Victor, and how Victor may, in some ways, see the\nCreature's violent actions as a lashing out against societal forces (Levine 33). Truman Capote\n\nexplicitly states through the quote mentioned above that Perry has become a doppelganger for\nhim, an example of what would have happened if he had \"gone out the back door.\"\nFurthermore, the ambivalence of Victor toward his creation leads to repeated\nabandonment. First, he abandons him at the point of creation. Later, when the Creature does\nfind him and Victor agrees to make a mate for him, he backs out of his promise and again leaves\nthe Creature. This pattern exists throughout Capote as well, as Truman initially helps Perry and\nDick find representation for an appeal but later rejects helping them further, sinking into a\nmelancholy very similar in many ways to Victor's mood after the deaths of William and Justine,\nwhen \"remorse extinguished every hope\" (60). Likewise, Truman is ambivalent toward his\ninvolvement with Perry and finds refuge in sinking back into himself and into his former life,\nignoring his role in shaping the events to come and in giving Perry hope through their\ninteraction. Truman begins ignoring Perry's correspondence and sinks into the writing of the\nbook, waiting while Perry's execution nears.\nTWO WORLDS\nIf the Creature and Dr. Frankenstein are two halves of one man, as scholars like Levine\nsuggest, the two halves are often in opposition, as the doppelganger model would suggest. Dr.\nFrankenstein is a respected and reputed man in Swiss society, the member of an upstanding\nfamily and an accomplished student. On the other hand, the Creature's physical deformity leaves\nhim shunned by society, unable to participate even though he initially feels a great desire to love\nand be loved by others, as is demonstrated through his relationship with the De Lacy family.\nThe Creature, when trying to persuade Dr. Frankenstein to create him a mate, draws several\ntimes on his being cut off from society. \"I am alone, and miserable; man will not associate with\n\nme\" (97), he says, in an attempt to convince Dr. Frankenstein to create a bride for him, later\nadding, \"It is true, we shall be monsters, cut off from all the world\" (99).\nThis imagery echoes in Capote's claim of Perry and he growing up in the same house but\ntaking different paths. In Capote, Perry has experienced the world from a completely different\nperspective than Capote. While both had similar disadvantages in childhood, Capote went on to\nbecome a heralded writer and a New York socialite, whereas Perry is on death row. Yet Truman\nreminds Perry, \"We're not as different as you might think.\" Indeed, part of the horror of both\nstories is that both Dr. Frankenstein and Capote see themselves in their creation. The\nunemotional logic of the Creature appalls Frankenstein, although it echoes his own extreme logic\nin creating the Creature in the first place, when he dedicated himself to the \"one secret which\n(he) alone possessed\" (32).\nAt one point in Capote, Truman tells a reporter, \"Two worlds exist in this country: the\nquiet conservative life and the lives of these two men--the underbelly, the criminally violent.\nThose worlds converged that bloody night.\" Yet, Truman's inability to cope with the story\ncomes not from \"that bloody night\" but rather from the similarities he sees in himself and Perry,\nthat he is \"not that different\" from the one he declares \"the underbelly.\" As with Frankenstein,\nCapote becomes consumed with issues of his own culpability, both in the plight of men like\nPerry and the motivations which drive them to violent action. Capote's ethical accountability for\ncreating this depiction of Perry after the murder certainly pales in comparison to Victor\nFrankenstein's responsibility for literally giving life to his creature. Nevertheless, both works\nshare an underlying theme--that the \"two worlds\" these doppelganger characters inhabit are not\nactually separate but drastically different experiences of the same place, the creator's clearly\nprivileged over the creation's.\n\nFINAL RECONCILIATION/DESTRUCTION\nThe fates of all four characters described here--Victor and The Creature in Frankenstein\nand Truman and Perry in Capote--end in tragedy. The Creature and Victor destroy each other.\nSimilarly, Perry's execution, in some ways, leads to Truman's death as a writer, as the final text\nof the film informs us he never completed another book, implying that it was the emotional\nimpact of the project and his involvement with Perry and Perry's subsequent execution which led\nto the death of his career.\n\nThe ending of Capote raises an interesting question that serves to sum up this comparison\nbetween Capote and Frankenstein: Who is really monstrous? The ambiguity of Frankenstein\nallows for not only both Creature and Victor, two halves of the same man, to be the monster but\neven society itself, since the Creature's exile is caused by society's inability to cope with his\ndeformities. Similarly, not only are both Truman and Perry monsters but also the intelligentsia\nwho praises Truman for his stories which use \"the underbelly\" to feed its art and entertainment.\nCapote tells Perry, \"If I leave here without understanding you, the world will see you as a\nmonster. Always. And I don't want that.\" Yet, he gets Perry's story to create a book entitled In\nCold Blood, blatantly lying to Perry about the tone of his work, which is not as sympathetic to\nPerry's side as the prisoner had been led to believe. And he only thinly veils his thinking Perry\nand Dick's hanging would make the perfect ending to the book, which leads, in part, to his\nrefusal to help them in their final stage of appeal of their execution.\nCONCLUSION\nThe ambiguity in both works, then, and the tradition that extends from Frankenstein to\ncurrent works such as Capote, is the question of where the \"monstrous\" really lies. Who is really\nculpable for these creations? In Frankenstein, society and Victor Frankenstein's lack of\n\nresponsibility are as much to blame as the Creature. In Capote, the truly monstrous creation is\nnot as much Perry's character but In Cold Blood itself. Although a canonical novel that spawned\na new genre, the book creates an obsession in Truman which leads to his abandonment of Perry's\ncase in order to get the ending that he wants and subsequently leads to the end of his writing\ncareer--and, as the film indicates, possibly to Truman Capote's life as well, as he drinks himself\nto his death in the proceeding years.\n\nWhile the Frankenstein story may be eclipsed by Whale's Frankenstein in popular\nculture, the narrative remains a direct influence on works that, at first glance, would seem far\nfrom derivative of Shelley's novel. Capote is a biopic, a different genre in a different medium\nwith vastly different conventions than the Frankenstein novel. Yet, much of the language and\nthe structure of Capote, the various layers of mediation, and issues of the monstrous and the\ndoppelganger relationship (not to mention the homosexual aspect of the doppelganger many have\nread into Shelley's Frankenstein which are much less hidden in Capote) bear the influence of the\nFrankenstein story and its many descendants in Western culture since the printing of Shelley's\nwork. Because many of its themes continue to be adapted to current issues, Shelley's novel\nremains a useful lens through which to examine and contrast contemporary works, as this\nexamination of Capote demonstrates.\n\nWORKS CITED\nLevine, George. \"The Ambiguous Heritage of Frankenstein.\" Critical Essays on Mary\nWollstonecraft Shelley. Ed. Mary Lowe-Evans. New York: G.K. Hall, 1998, 25-38.\nReprinted from Endurance of Frankenstein, 1979.\nMiller, Bennett. Capote. United Artists/Sony Pictures Classics, 2005. Theatrical release.\nShelley, Mary. Frankenstein: A Norton Critical Edition. Ed. J. Paul Hunter. New York:\nNorton, 2005."
    },
    {
      "category": "Resource",
      "title": "grigsby1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/025b8f96f3e289587da9f27b966f4247_grigsby1.pdf",
      "content": "Between Enlightenment and Self-Destruction:\nThe Sublime Landscape in Frankenstein and Moby Dick\nby Neal Grigsby\nNovember 14, 2005\nWhat can we make of the careful landscape descriptions in Mary Shelley's\nFrankenstein?\nA desire for tidy interpretations tempts one to do away with them\nthoroughly, rationalize their exclusion from the set of meaningful aspects in the novel.\nPerhaps Shelley included them as a simple travelogue of her journeys across Europe, an\noffering of vicarious mobility to her readers. Some dismiss the passages as superficial\nliterary experiment, Shelley answering husband Percy with something like a prose version\nof his poem \"Mont Blanc.\" \"This section of the novel is a prose version of Percy Shelley's\npoem 'Mont Blanc',\" explains the Cliff's Notes Study Guide. Lazy high school students\neverywhere breath a sigh of relief. Would we so callously neglect descriptions of the sea\nin Moby Dick, in which Melville scholars cherish every detail as potentially rich with\nsymbolic importance? And consider the elements common to both novels: fateful sea\nvoyages into the unknown, obsessed madmen, supernatural monsters, lengthy pursuits\nending in death and destruction. Major shared influences partially account for these (the\nBible, Milton, Faust, and, yes, Percy Shelley), but a close comparison reveals subtle\ndistinctions that yield further insight into both novels. How can we understand the\nrelationship between the novels? What can we gain through a symbolic reinterpretation\nof Mary Shelley's use of the sublime landscape? And can consideration of Frankenstein\nas an influence on Moby Dick improve our understanding of that work, and the era of\nAmerican literature in which Melville wrote?\nTo generate a comparative analysis of\nFrankenstein and Moby Dick would\n\npresent some significant problems for one who wished to closely relate the works\nutilizing references to era, author biography, or literary genre. The first would require an\naccounting for the 33 years that separate their publication, the second a trans-Atlantic\ncollapsing of space and a rationalization of some gross anatomical disparity, and the third,\nwell, that one's a bit more elusive. Genre as a concept takes as its very function the\nreconciliation of empirical differences between works by labeling shared themes, settings,\nstyles, or plot elements as \"genre conventions.\"\nGenre assignment is always an\ninterpretive task, making it a handy technique for wrangling truly disparate texts together,\nand indeed many past analyses referencing the two works utilized this strategy. But that\nsame flexible quality of genrefication, what makes it such a useful rhetorical tool, also\nleaves pure genre analyses vulnerable to challenge. In considering these two works, I'm\nwilling to concede a case can be made for Frankenstein as a Gothic novel, indeed the\ncritical consensus points to such an interpretation (if we accept multiple encyclopedia\nentries as roughly approximating a consensus), but what is Moby Dick?\nCan we\naccurately describe that work as Gothic, or even literary Romance?\nThose aforementioned Cliff's Notes summary-reading high school students might\nnot acknowledge a problem, uniting the two within the genre of \"those old books they\nforce us to read for school,\" i.e., \"The Great Books.\" Thus we see the Frankensteinian\ntragedy of the rampant confusion of axiology and taxonomy gone unchecked. A more\ncomplicated, but no less problematic argument for Moby Dick as Romance attributes a\nkind of generic atavism to American literature.\nThis view casts Melville, and\ncontemporaries like Hawthorne, as a generation behind English literature, adherents to\nliterary trends already a few decades old. Though not necessarily popular in current\n\nliterary theory (Rogin), this idea of an American Renaissance or American Romanticism\nderived whole-cloth from European influence seems implicit in much of the scholarship\naddressing both works. For example, in his otherwise illuminating history of the Gothic\nnovel from 1964, Robert Hume temporally brackets the genre \"between 1764 and 1820,\"\nonly to later appropriate Moby Dick as \"perhaps the greatest of Gothic novels, and an\nalmost perfect example of the form.\" Never mind the publication of that work in 1851\nputs it a good 30 years out of the Gothic canon by Hume's own reckoning. A more recent\nattempt to incorporate Moby Dick and other Post-Revolutionary American works into the\nRomantic category explicitly references this fallacy, though with qualifications: \"This\n'literary narrative,' I argue, can be understood as an American version of what had been\ndone several generations earlier in England and Germany, and thus is, broadly,\n'romantic.'\" (Arac, 43).\nThe problem of genre happens to be especially acute with Moby Dick. The text\nsuperficially encourages genrefication; one can find plenty of textual evidence to classify\nthe novel as memoir, literary Romance, epic, Gothic, or any number of others. But this\nvery excess of evidence makes simple categorization difficult. Even by addressing only\nthose segments of the novel concerned with the voyage of the Pequod, the fiery language\nof Ahab, and the chase of the white whale--those aspects that we might call essentially\nnovelistic--we're already privileging a type of reading inconsistent with the holistic\nexperience of the book, which I would describe as textual eclecticism. Melville self\nconsciously interrupts the core narrative of the novel with segments like the extracts and\netymology, chapters on cetology, theatrical blocks of pure dialogue, aesthetic evaluations\nof paintings, quantitative comparison of whale carcasses, even a lengthy treatise on\n\nwhale cuisine--just try to find traces of the Romantic in Ishmael's recipe for whale\nbrains. No, genre seems a problematic grounds on which to base a comparison of the two\nnovels.\nStill more strategies to justify comparison prove unsatisfactory. Much cited is the\nfact that Melville owned a copy of Frankenstein and many works of European\nRomanticism (Sealts). Certainly, had the contrapositive been true--if we knew for a fact\nthat Melville hadn't read Frankenstein--any direct comparison would be strained. Still,\nhow much rhetorical mileage can we really get out of this one? And why even appeal to\nextra-textual historical research when Melville gives us a kind of bibliography within the\nnovel itself? Shakespeare, Goethe, and Edmund Burke are right there in the \"Extracts\"\nsection, as are Darwin, Hobbes, and Thomas Jefferson. Our knowing that Melville\nconsulted the former group no more proves Moby Dick followed directly the Romantics\nthan the latter group makes it a study of naturalism, a treatise on philosophy, or the\nDeclaration of Independence. I question these strategies to balance my own tendency to\noverdetermine the relationship between Frankenstein and Moby Dick. I want to avoid\ncreating a teleology that would explain Melville's work as the natural evolution of Mary\nShelley's, or that would make the latter author only understandable as a literary genius\n\"ahead of her time.\" Having called out these tendencies, I hope to rebuild a new space for\nunderstanding the relationship, to layer close textual analysis, a consideration of their\nshared literary influences, and an attempt to parse out any direct influence of\nFrankenstein on Melville's novel.\nI've already denied (somewhat facetiously) any formal equivalence of Mary\nShelley's landscape descriptions and Percy's poetry, but Frankenstein certainly invites a\n\ncomparison. For the Romantic, the sublime landscape confronted the observer with\nscenery of such immensity and grandeur to strain comprehension and reason, but would\nultimately prove subordinate to human creativity and imagination, and therapeutic for the\nsoul. Mary Shelley explicitly voices this perspective through Victor Frankenstein, who\nascends Montanvert to elevate his spirits: \"I remembered the effect that the view of the\ntremendous and ever-moving glacier had produced upon my mind when I first saw it. It\nhad then filled me with a sublime ecstacy that gave wings to the soul, and allowed it to\nsoar from the obscure world to light and joy\" (100). But Shelley's narrative does not stop\nwith a simple affirmation of the Romantic relationship between humanity and nature, in\nfact the passages which follow severely complicates that view. Victor's subsequent\ndescription reveals the mortal danger inherent in the setting: \"the slightest sound, such as\neven speaking in a loud voice, produces a concussion of air sufficient to draw destruction\nupon the head of the speaker\" (101). This self-destructive effect of human agency in the\nrealm of the sublime recurs in the passages which follow. Though observation of the\n\"awful majesty\" of Mont Blanc initially calms Victor--\"My heart, which was before\nsorrowful, now swelled with something like joy\" (102)--a verbal address to the heavens\ntriggers an immediate and terrible answer, not by falling rocks, but by the appearance of\nVictor Frankenstein's wretched creation, the seed of his own destruction.\nWhy stage Victor's first encounter with the mature fiend in the sublime landscape?\nOne interpretation attributes to Shelley an intention to \"feminize\" Romanticism by\nsubverting the Romantic ideal of solitude in favor of the civilizing power of society.\nThose vast landscapes, then, \"provide a fitting home for essential, uncivilized human\nnature--for the monster\" (Poovey, 336). But the social institutions depicted by the novel\n\nbeing equally problematic, Shelley's distrust of the contemporary legal machinery\nespecially obvious, I prefer to read the encounter as a symbolic repetition of Victor's\noriginal error. The lone ascent into the mountains recalls his isolated experiments, his\nprobing of nature's highest secrets. The mortal danger threatened by the the rocky path\nechoes the moral danger of scientific hubris. Finally, Victor's verbal challenge to the\nAlpine peaks, an assertion of individuality in the face of terrible nature, refigures his\ntransgressive creation of life.\nThis analogy serves to critique a conception of the sublime as merely an aesthetic\ncategory. It challenges the Romantic view of mortality as a negotiable limit of human\ncomprehension and agency; a border to be overcome by transcendental creative power.\nShelley neglects this lofty idealism, first, by an awareness of the human being as a\nphysical body. Her \"version\" of Percy's Mont Blanc adds a layer of irony, as the hero\nseeking spiritual elevation in the natural environment finds himself physically threatened\nby the very object of enlightenment. Even more pointedly, she calls into question the\nends of the Romantic desire to engineer the transcendent, which inevitably results in\nabomination and destruction of the human. For the novel, the sublime functions as a kind\nof secular metaphysical, the hard, non-negotiable boundary of the human beyond which\npassive observation may be beneficial, but exercise of human agency brings about self-\ndestruction. In short, to be a true Romantic hero is to invite obliteration.\nMelville makes explicit from the first paragraph of Moby Dick Ishmael's\nexpectations for the therapeutic in human interactions with nature: \"Whenever I find\nmyself growing grim about the mouth; whenever it is a damp, drizzly November in my\nsoul... I account it high time to get to sea as soon as I can.\" A celebration of nature very\n\nmuch in the Romantic mode, here, already, we have evidence of Melville working\nthrough a discourse similar to Shelley's. But does he subvert the Romantics, as Shelley,\nor merely confirm their world view? Merrill D. Whitburn extrapolates from Melville's\nmany overt references to the Romantic sublime in Moby Dick an intention by the author\nto create the sublime quest narrative par excellence, and to simultaneously evoke in the\nreader the necessary awe and wonder to provide a sublime experience. \"Writers may\nencourage readers to experience a world as sublime, but few writers succeed in actually\nevoking sublimity. Melville is one of these few\" (Whitburn, 38). Yet even within that\nopening paragraph, Ishmael reveals an awareness of the darker side of the sublime, an\nassociation of the sublime quest with a kind of death wish. \"This is my substitute for\npistol and ball. With a philosophical flourish Cato throws himself upon his sword; I\nquietly take to the ship.\" (Melville, 3). At what cost the sublime? Is Ishmael's whaling\nvoyage therapy, or suicide?\nSome proponents of the \"American Romanticism\" theory have distinguished the\nAmerican strain, at least as expressed through its use of the sublime landscape, by exactly\nthat emphasis on the perils of nature. \"Most authors used the sublime just for romantic\nscene setting; but Hawthorne and Thoreau were more interested in the symbolic aspects,\nthough they were sensitive to the danger of overidealizing the wilderness and not\nrecognizing its inherent perils. Melville, of course, clearly perceived this paradox\"\n(Hovanec, 44). As we have seen, though, the Americans were not the first to recognize\nthe physical perils of the sublime, nor to exploit its symbolic aspects. It seems likely,\nthen, that Melville and his contemporaries did not so much innovate this modulation of\nthe Romantic sensibility as work within a post-Frankensteinian discourse already\n\nskeptical of idealism. Whether Hawthorne and Thoreau were cognizant of this fact, or\nwhether they developed their response to the Romantics independent of Shelley, it is\nneither possible to determine, nor particularly important to this analysis. I do find it\nlikely that Melville recognized the kinship between the American literary movement and\nthis female novelist from an earlier generation, both of whom strove to distinguish\nthemselves against the powerful hegemony of European male voices. In his book on the\nlegacy of Frankenstein in 19th Century literature, Chis Baldick even creates space for a\nfeminist interpretation of Moby Dick, noting how \"Melville's men appear to be redeemed\nto the extent that they are feminized\" (Baldick, 80).\nMary and Herman don't live together happily ever after, however, for once again\nthe later author adds his own points of subtle articulation to make relevant the earlier\ndiscourse. Here Baldick's analysis is indispensable to showing how, though lacking the\novert science-fiction aspects of Frankenstein, the world of Moby Dick exhibits the kind of\ntechnological dystopia Shelley's novel warned against.\nBaldick recalls the averted\ncatastrophe of Walton's voyage, the one positive outcome in Frankenstein, in his reading\nof Moby Dick as \"a study of what happens when the crew fails to mutiny against\nFrankensteinian leadership\" (Baldick, 77).\nHe describes further how Ahab makes\nmonsters of both himself and his crew in the \"American urge to subdue Nature by\nmechanical efficiency\" (Baldick, 81).\nShelley's novel, however mythological in intention, and however generalizable\nVictor's story may be to humanity at large, remains a story of human exceptionalism.\nThough she challenges both the outcomes of heroic action, and the practice of solitude,\nMary Shelley's Frankenstein retains the individual agency of the classical hero. He labors\n\nin an alchemical tradition opposed to the scientific trends of the day. His accumulation of\nknowledge exceeds his peers at a disproportionate rate. Though to his own detriment, he\ndoes actually discover and command the elemental forces of nature. Though we may read\nthe novel as a cautionary tale about any human endeavor, the consequences are only\nproportional to the stakes. If Victor loses big, it's only because he plays big. We may be\ntempted to attribute a similar exceptionalism to Melville's Ahab.\nCertainly an\nextraordinary character, his quest for vengeance against the white whale drives the story.\nBut as Jonathan Arac shows, Melville carefully complicates that agency. \"In its broadest\nstructure, the plot is a satire on human impotence: St. George comes up to the dragon, and\nit does him in; there's really no contest\" (Arac, 45). Furthermore, Ahab does not proceed\nin his task unaided, but relies on a crew to carry out his deeds. This crew, though\nostensibly diverse and expressive of dissent, also suffer from lack of agency. Melville\ndescribes Ahab and his crew as a functional singularity. In the microcosm of society that\nis the Pequod, all force of righteousness, wickedness, or indifference only provide ballast\nfor the status quo:\n\"Here, then, was this grey-headed, ungodly old man, chasing with curses a\nJob's whale round the world, at the head of a crew, too, chiefly made up of\nmongrel renegades, and castaways, and cannibals--morally enfeebled\nalso, by the incompetence of mere unaided virtue or right-mindedness in\nStarbuck, the invulnerable jollity of indifference and recklessness in\nStubb, and the pervading mediocrity in Flask. Such a crew, so officered,\nseemed specially picked and packed by some infernal fatality to help him\nto his monomaniac revenge\" (186-87).\n\nSo the society plunges towards it fate, provoked by everyone from the dissenters to those\njust doing their jobs. By transferring the blame for transgression from one exceptional\nindividual to society, Melville emphasizes how much more \"fallen\" he considers his\nworld, how mechanistic the technological world-view renders those who labor within it.\nBaldick's analysis reveals a world in which the dangers implied by Shelley's novel\nhave escalated to a frightening degree. I would argue that the shift between novels is\neven more profound, and, again, the change is exemplified in Melville's use of the\nsublime landscape. If Frankenstein complicates human agency and cautions against a\ncreative imperative beyond human limits, Moby Dick challenges even the desire to know\nand experience the sublime; its project is epistemological rather than practical. Ishmael\nrecognizes that the therapeutic aspect of the sublime landscape flows from its very\ninhospitableness to the human, that true enlightenment represents a kind of self-\ndestruction. In addition to the fiery Promethean myth that drives Frankenstein, that of a\nman tempted by god-like power over his environment, Ishmael cites the watery myth of\nNarcissus to describe the appeal of the sea, that of a man who \"could not grasp the\ntormenting, mild image he saw in the fountain, plunged into it and was drowned\" (5).\nHis temptation, the temptation of the sublime landscape, is not for physical power or\nsome external secret of nature, but for an impossible understanding of himself.\nThe fate of Pip provides an instructive illustration of Melville's ontology of the\nsublime and the danger of knowledge.\nAccidentally cast away from the ship and\ntemporarily abandoned by the harpoon boats, Pip finds himself alone in the open ocean,\nand has an unfiltered experience of the sublime that would be the envy of any good\nRomantic. He is \"carried down alive to wondrous depths, where strange shapes of the\n\nunwarped primal world glided to and fro before his passive eyes; and the miser-merman,\nWisdom, revealed his hoarded heaps.\" The transcendent moment did not elevate his\nspirit, however, but \"drowned the infinite of his soul.\"\nThe cost of metaphysical\nknowledge is exactly Pip's humanity: \"He saw God's foot upon the treadle of the loom,\nand spoke it; and therefore his shipmates called him mad. So man's insanity is heaven's\nsense\" (414).\nPlease indulge me a fanciful visual metaphor for the relationship between these\ntwo novels.\nShelley's Frankenstein calls up a vast field devoid of color--Alpine\nmountaintops, glaciers, Arctic ice floes--in which the dark, hideous creature lives and\nthrives, and against which he gains definition, a minuscule black blot on a white\nlandscape. Melville's Moby Dick plays out against a landscape of deep, inscrutable seas,\nan almost infinite darkness surrounding the unconquerable white whale. Together they\ncompose an ideogram balanced in its very difference: a yin-yang, a symbol even more\nappropriate for its absence from the Western approach to defining humanity's relationship\nto nature. Taken together, the two novels provide an almost complete challenge to\nEnlightenment philosophy and the concept of a knowable external truth.\n\nWorks Cited\nArac, Jonathan. \"'A Romantic Book': Moby Dick and Novel Agency.\" boundary 17.2\n(Summer, 1990): 40-59.\nArvin, Newton. \"Melville and the Gothic Novel.\" The New England Quarterly 22.1\n(March, 1949): 33-48.\nBaldick, Chris. In Frankenstein's Shadow: Myth, Monstrosity, and Nineteenth-century\nWriting. New York, New York: Oxford University Press, 1987.\nCliff's Notes Online. \"Frankenstein: Summaries and Commentaries, Chapter 9.\" 13 Nov.\n2005. <http://www.cliffsnotes.com/WileyCDA/LitNote/id-112,pageNum\n39.html>\nGlenn, Barbara. \"Melville and the Sublime in Moby Dick.\" American Literature 48.2\n(May, 1976): 165-182.\nHovanec, Carol P. \"Melville as Artist of the Sublime: Design in 'The Tartarus of Maids.'\"\nMid-Hudson Language Studies 8 (1985): 41-55.\nHume, Robert D. \"Gothic versus Romantic: A Revaluation of the Gothic Novel.\" PMLA\n84.2 (March, 1969): 282-290.\nMelville, Herman. Moby Dick. Evanston, Illinois: Northwestern University Press, 2001.\nRogin, Michael. \"Recolonizing America.\" American Literary History 2.1 (Spring, 1990):\n144-149.\nSealts, Merton M. Melville's Reading: A Check-list of Books Owned and Borrowed.\n\nMadison, Wisconsin: University of Wisconsin Press, 1966.\nShelly, Mary Wollstonecraft. Frankenstein: Or, the Modern Prometheus. Berkeley,\nCalifornia: University of California Press, 1994.\nWhitburn, Merrill D. \"Moby Dick and the Sublime.\" Comparatist: Journal of the\nSouthern Comparative Literature Association 3 (1979): 32-39."
    },
    {
      "category": "Resource",
      "title": "verschooren1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/f872952c4575e7f443b87ace7e428b4f_verschooren1.pdf",
      "content": "William Kentridge: Complexity and intimacy\nRedefining political art in the South African late- and post-apartheid context\n\nKaren Verschooren\n11/14/'05\n\n'Rather than saying, like Lenin, 'What is to be done?', my engagement is\npolitically concerned, but distanced.' - William Kentridge1\n\n'I have never tried to make illustrations of apartheid, but the drawings are\ncertainly spawned by and feed off the brutalized society left in its wake. I am\ninterested in a political art, that is to say an art of ambiguity, contradiction,\nuncompleted gestures and uncertain things. An art (and a politics) in which my\noptimism is kept in check and my nihilism at bay.' - William Kentridge 2\n\nThe term 'political art' has generally been reserved for artwork conveying overt political\nmessages. The most familiar category is probably agitprop3 or propaganda4 art, art\nproduced and directed by a certain government or political organization. David Elliot\nclaims in his essay Babel in South Africa that these forms 'put art in the direct service of\npolitics (...). In such circumstances art easily becomes illustration not example,\nindividual autonomy is willingly sacrificed for what is perceived as the general good.'5\nBut artists who are not linked to any party in particular, have also overtly expressed\npolitical opinions in their work. Directed or merely influenced by political organizations,\nthe message conveyed in both categories is a clear and unambiguous political one, be it a\ncommentary, a call for action or a cry for help.\nBut what are we to do with art whose denotation6 is not overtly political? And what are\nwe to do when their connotations7 - those layers of interpretation put on top of a sign's\nliteral meaning - do carry political elements. Should we call these works political art as\n\nwell? Artists creating these kinds of works generally do not consider their work as\nbelonging to the category of political art, but should we accept an artists' refusal to self-\ncategorization? Duchamp did not consider himself to be a Dadaist either....\nBased on the artwork of William Kentridge, this essay will argue for a broader\nunderstanding of the concept of political art within the visual arts. Although Kentridge\nhas created some works that directly refer to the political situation of his home country\nduring the late- and post apartheid era8, the core of his artwork features a more complex\nframework for human thought and behaviors on an intimate level, rarely found in the\nwork of his colleagues.\n\nNote that this essay does not include an evaluative standpoint. To argue for a broader\nunderstanding of the concept of political art is not to say that art incorporating a\ncomplexity of meanings - among them a multitude of political ones - is better than art that\nexpresses an explicit and unambiguous political message. Considering the posters of\nSouth African artist group imvaba for political organizations and trade unions such as the\nNational Union of Metalworkers of South Africa (NUMSA) and the Food and Allied\nWorkers' Union (FAWU)9 (cf. color plates 1-3) and the artwork of Paul Stopforth (cf.\ncolor plate 4) and Gavin Younge10, to name just a few, it is clear that one cannot\ndenounce the direct approach in art, addressing topical political issues, as completely\ninvalid. Such work has an important place in the spectrum of cultural expression.\n\nColor plates\n\n1.\n\n1. Imvaba artists' Group\nNUMSA Mural [detail], 1989\nPainted for NUMSA 1989 National\nCongress held at Gosforth Park,\nJohannesburg, May 198911\n\n2. Imvaba artists' Group\nJune 16 Mural, 1989\nFirst mural painted for June 16 Rally\nand later exposed at the COSATU\nCultural Weekend in\nJohannesburg12\n\n2.\n\n3. Imvaba artists' Group\nFAWU Mural, 1989\nPainted for FAWU Special\nNationally Rally held at Dan Qeqe\nStadium, Port Elizabeth, July 198913\n\n3.\n\n4.\n\n4. The interrogators. By Paul Stopforth, 1979\nThe triptych is a portrait of the three security\npolicemen who 'interrogated' (Stopforth's quotes)\nSteve Biko, the founder of the Black Consciousness\nMovement. Steve Biko died in detention, after days\nof interrogation and torture.14\n\n5.\n\n6.\n\n5. Drawing from\nohannesburg, 2nd Greatest City\nfter Paris (1989)15\n. Drawing from\nohannesburg, 2nd Greatest City\nfter Paris16\n. Drawing from Monument (1990)17\n. Drawing from Mine (1991)18\n7.\n. Drawing from\nobriety, Obesity and Growing Old (1991) 19\n0. Drawing from\nobriety, Obesity and Growing Old (1991) 20\n\n8.\nJ\na\n\nJ\na\n\nS\n\nS\n\n.\n\n10.\n\n9.\n\n11.\n\n12.\n\n11. Drawing from\nFelix in Exile (1994)21\n\n12. Drawing from\nHistory of the Main\nComplaint (1996)22\n\n13. Drawing from\nWeighing and Wanting\n(1997-1998)23\n\n13.\n\n14. Drawing from\nWeighing and Wanting (1997-1998)24\n15. Drawing from\nWeighing and Wanting (1997-1998)25\n\n.\n\n15.\n14.\n\n16. Drawing from\nStereoscope (1999)26\n\n17. Drawing from\nStereoscope (1999)27\n\n16.\n\n17.\n\nCOMPLEXITY\nKentridge's avoidance of one great story, one belief, one perspective - and thus his\ntendency towards complexity - has its origins and roots in his childhood and youth.\nGrowing up as a white South African in a family of most distinguished anti-apartheid\nlawyers, Kentridge soon realized the political abnormality and ambiguity of the situation\nhe was living in. Although politics and art - the latter in the 1970s and 1980s widely\nconsidered as a weapon for struggle - conveyed simple, black and white perceptions of\nthe apartheid issue, Kentridge argued from the very start that politics and art needed to\nincorporate the ambiguity and contradiction inherent in South African reality. This\nrelative perspective, he claims, does not stop the individual from recognizing and\ncondemning evil, but it might stop one from being so utterly convinced of the certainty of\none's own solutions. In his own words: 'There needs to be a strong understanding of\nfallibility and how the very act of certainty or authoritativeness can bring disasters.'28\nThis belief has characterized Kentridge's entire career, from his artistic influences and his\nexpansions into different artistic media to his layering of complexities and ambiguities\nwithin different works.\nThroughout his work one can identify a variety of artistic influences, both from the\nAfrican as well as the European continent. On the African side, iconic South-African\nartist, Dumile Feni was Kentridge's greatest influence. The two artists met at the\nJohannesburg Art Foundation, a private art school founded by Bill Ainslie.\n\n'Dumile made remarkably strong, demonic drawings, either in ballpoint on a small scale, or\nin charcoal on a large scale. That was the first time that I understood the power of\nfigurative, large-scale charcoal drawings - that they could be so striking.... He had the\n\ncapacity to express things on a scale that I thought drawings could not achieve. He is the\nkey local artist who influenced me.' 29\nhip with the European and American art legacy was an ambiguous\nne. The conceptual and minimal European and American art of the 1960s and 1970s and\nspecially the paintings of the New York School with which Kentridge was familiar,\ntely apolitical and self-indulgent. Also the abstract expressionism of\nat era appeared to be stuck in abstractionist silence. Kentridge thus went back into art\nistory and found inspiration in the early 20th century German expressionist work of Max\neckmann, Otto Dix, Kathe Kollwitz, Ernst Ludwig Kirchner and Georg Grosz, the early\n20th century French art and the Soviet filmmakers and designers of propaganda posters.\nNever residing in one artistic influence, Kentridge not only translated modern art and\nulture to South Africa, but also encapsulated his feelings concerning his troubled\nhomeland under apartheid and his decidedly mixed feelings about political art.\nIndecisive about the choice between film, theatre and drawing, Kentridge worked\nin all areas. It took quite some time for him to realize that this was the only way he could\npossibly work and he considers the cross-fertilization of the media an important part of\nthe success he has had internationally since the late 1990s.\nOf course, Kentridge's urge towards complexity and ambiguity is not only\napparent in his indecisiveness of medium choice or his resistance in relying upon one\ngenre of influences, it also deeply characterizes the content of his works. Kentridge's\ncomplex network of meanings is displayed to the fullest in his animated drawing series,\ncreated between 1989 and 1998: Johannesburg, 2nd Greatest City after Paris (1989),\nument (1990), Mine (1991), Sobriety, Obesity and Growing Old (1991), Felix in\n\nKentridge's relations\no\ne\nstruck him as comple\nth\nh\nB\nc\nMon\n\nExile (1994), History of the Main Complaint (1996), Weighing and Wanting (1997-1998)\nof this age is that] political art is of clarity of purpose of thought and program. I think, that\nhave been saying or try to say in a way; this open endedness which is part of the films does\ninduces feelings of personal as well as social guilt. With the fifth\nepiso\ns layer upon\nyer of (political) meaning. In addition, the framework in itself allows for a number of\nconno\nks not\nonly as an attractive feature for the audience, but immediately allows a symbolic\nand Stereoscope (1999) (cf. color plates 5-17). The relation between the films and\npolitical art is lucidly explained in a 1999 video recording of Kentridge working on\nStereoscope:\n\n'There is a kind of polemic in the films, which is a kind of formal polemic. It has to do with\nsaying it should be possible to make a political art, an art that captures within the kind of\nironies, ambiguities and contradictions that are in the political world. [One of the thoughts\nclarity of program and thought and purpose is often absent in the real world and that behind\nthe clarity of the rhetoric is often a very confusion of goals, aims and agenda's and the films\nalso reflect the kind of open endedness outside of it.'30\n\nOver the course of the seven films, based on the animation of charcoal drawings,\nKentridge tells the story of Soho Eckstein, Mrs. Eckstein and Felix Teitlebaum. The early\nfilms focus on Soho's expansion of his mining empire on the outskirts of Johannesburg\nand his struggle with Felix Teitlebaum over his wife. In Sobriety, Obesity & Growing\nOld, the loss of his wife\nde focusing on Felix entirely, the latter three turn back towards Soho and his\nstruggle for forgiveness. Finally, in Stereoscope, Soho's industrial success is undone by\nviolent uprisings in the street, but he has regained the love of his wife. This brief synopsis\nof the films merely describes the framework, upon which Kentridge create\nla\ntations referencing the political situation.\nTelling the story starting from the trivial daily life of the three characters wor\n\ninterp\nion is\ndicative of the tunnel vision of a South Africa under international siege at the end of the\n'By the time this film [Johannesburg, 2 Greatest City after Paris (1989)] was made,\nan important point about the peculiar form of t nnel vision characteristic of societies under\nis what makes their self-absorption tragic (and the crisis worse).'\nruth and\nReconc\npossible of the nature, causes\nand ex\nretation when considering the protagonists as 'pars pro toto'; their tunnel vis\nin\n1980s. Or, as curator and art critic Dan Cameron formulates it:\n\nnd\nworldwide pressure on South Africa to abolish the apartheid system had reached perhaps its\ngreatest intensity, with any number of cultural and economic boycotts in place to isolate the\nnation as much as possible until it did so. By creating a film in which the main characters\nare caught up in seemingly pointless brooding about their personal affairs, Kentridge makes\nu\nsiege. For the three protagonists to be so absorbed in their private lives at a time of evident\ncrisis suggests that their collective refusal to take the prospect of social upheaval seriously\n\nA second political connotation inherent in the synopsis of the film series can be found in\nthe fact that the last three films explicitly tackle issues of memory and guilt. This story\nline cannot be interpreted without regarding the establishment of the T\niliation Committee, set up in the National Unity and Reconciliation Act of 1995.\nThe Commission was established to provide a public forum for the victims of state racism\nto confront their perpetrators and to have the brutality of apartheid publicly exposed and\nadmitted. The goal was to provide 'as complete a picture as\ntent of gross human rights violations committed between March 1 1960 and\nDecember 5 1993.'32 Without explicitly referencing the activities of the committee, it is\nclear that the story line of Kentridge's film cycle has been consistently - be it consciously\nor subconsciously - influenced by its existence.\nWhile every film, as a separate entity, allows for a number of connotations, one\ncan distinguish the most significant layers of (political) meaning in the themes recurring\n\nover the course of the seven films, the principal ones being the landscape and the body.\nThroughout the films, the bereft, plundered and ravaged landscape does more than just\nprovide the characters with a setting to act in and upon. Indeed, the relationship of the\ncharacters to the landscape is a key element in the film series. Whereas the miners are\nepicted in close relationship to the landscape, Soho is spending most of his time in self-\nabsorption in his office, ignoring the plight\nstand\nfrom\nrealit\nn and\napart\nbarely\nperce\nich all future efforts at a meaningful\nconciliation will also be absorbed. ' 33 The depiction of the landscape and its relation to\nis theme, Kentridge again refers to the\npoliti\nd\nof his wife, his employees and what they\nfor. His alienation from nature corresponds with the divorce of the landscape\ny: the South African landscape has known centuries of slavery, colonizatio\nheid, but 'the traces left by [these forms of] past oppression form a\nptible part of the current landscape, into wh\nre\nthe characters in this way facilitates a political connotation for those who are willing to\nseek it.\nWith regard to the body, Kentridge focuses on the multiplicity of personalities within the\nindividual. Whereas the film series start off with three main characters, the viewer\ngradually realizes that there are just two; Soho and Felix depict two sides of the same\ncoin, that coin referring at certain points rather explicitly towards William Kentridge (cf.\ninfra). Starting from History of the Main Complaint, and more clearly in both Weighing...\nand Wanting and Stereoscope, the main question asked is how to maintain a sense of both\ncontradictory and complementary parallel parts of oneself. What is the cost and pain\nengendered by self-multiplicity? The films mark a feeling of doubt about the positive\nvalue of dispersed, multiple identities. With th\ncal realm of the post apartheid era: 'It's a particularly South African phenomenon of\n\nthe late 1980s and 1990s to have contradictory thoughts running in tandem. These\ncontradictions work at an internal level in terms of the different views one has of oneself\nfrom one moment to the next.'34\n\nThe paragraphs above illum\nfilm s\nreated\nin. T\nlitical\nunder\nype of\npoliti\nINTIMACY\nKentridge's allowance for a complex moral framework for human thought and behaviors\nunderstanding art as an instrument of propaganda, writers such as Njabulo Ndebele and\nKani and Ari Sitas, who had advocated the 'liberation of the arts' for over a decade\nreceived the political voice they needed, when Albie Sachs presented his paper,\nseminar. In an environment that had always favored a Leninist view on art, Sachs\nproposed: 'our m\nstruggle. I would suggest a period of, say, five years'35. He explains: '... the power of art\ninated the way in which both form and content of Kentridge's\neries allow for a number of references to the political realm the work was c\nhe viewer is confronted with the choice to regard or disregard these po\nstandings, but their presence within the artwork characterizes a more subtle t\ncal art.\n\nDiscussing the theme of complexity, the previous paragraphs revealed a possible\nextension of the understanding of the category of political art. However, it is not\nthat distinguishes his art from that of his colleagues. Indeed, in 1989, after two decades of\nChris van Wyk, painters such as Dumile and theatre actors and directors such as John\nPreparing ourselves for Freedom, during an African National Congress (ANC) in-house\nembers should be banned from saying that culture is a weapon of\n\nlies precisely in its capacity to expose contradictions and reveal hidden tensions - hence\nthe danger of viewing it as if it were just another kind of missile-firing apparatus.'36\nDuring the 1990s more South-African artists indeed understood the need to convey\npolitical complexity. But, what distinguishes Kentridge from others is rather the way in\nwhich he approaches and obtains this complexity. The individual is taken as the starting\npoint, around which Kentridge weaves the complexity of South African life during\napartheid and post-apartheid into the narrative. In addition, this individual refers more\nthan once to Kentridge himself, introducing an autobiographical element in his artwork.\nThe intimate level is to one extend the result of Kentridge's approach to drawing.\nFor Kentridge, drawing is a testing of ideas and a way of making a representation of the\nconstruction of thought. He claims his starting point is always the desire to draw; 'the\npleasure of putting charcoal marks on paper.'37 He does not start from a certain theme or\nidea, but once in the process of drawing, the work can become a self-centered reflection\n\napparent in the content of his work. Indeed, many of Kentridge's choices of subject\nof whatever is around that interests him. Indeed, drawing for Kentridge means also the\nphysical activity of making the work that both clarifies its idea, but also in the end,\nconstitutes who the artist is.38\n\n'The activity of drawing is a way of trying to understand who we are or how we operate in\nthe world. It is in the strangeness of the activity itself that can be detected judgment, ethics\nand morality.'39\nThe intimacy in Kentridge's work is not limited to his drawing method; it is essentially\nmatter can be accounted for by the artist's own palpable feeling of ambivalence towards\n\nthe privileges and comforts of the class in which he was born.40 The Soho/Eckstein drawn\nanimation film series is probably the most exquisite example of this.\n\n'If one correctly recognizes Soho and Felix as alter egos, they may also be considered\nsurrogates for the artist himself. Throughout his work Kentridge has repeatedly imbued\nmemory (...).'41\ne facial expressions as William Kentridge. While Felix was depicted from\ne very start as based on Kentridge, Soho takes a little bit more time to incorporate\nes and thus to become identifiable with the creator himself. Kentridge has\nactions as well. So this became an element, not necessarily of autobiography, but of\n\neach character with fragments of himself - references to his family, his body, and his\n\nThe physical features for both characters were drawn from the artist himself. Frequently\nusing the mirror as a tool while drawing, the characters have the same posture and at\ntimes the sam\nth\nFelix's featur\nnever denied the presence of autobiographical elements in the film series:\n\n'I needed Felix to be a second consistent character throughout the film. So who could he\nbe? The easiest thing was to work in a mirror. So it was by chance that he looked like me.\nBut once he started to look like me, I understood that I had to take responsibility for his\nworking within the realm of who Felix was. The film functions more like a diary than an\nautobiography.' 42\nFelix's similarities with Kentridge go beyond the physical: the character is created as an\nartist, in particular, a draughtsman. For example, in Johannesburg, 2nd Greatest City after\nParis, Felix dreams of Soho's wife. He does so using a notebook of drawings that he\nholds, and that evolve through correction and erasure in the same way as Kentridge's\ndrawings for projection. The same idea resurfaces in Felix in Exile, when Felix sits in an\nenclosed room examining and reconsidering his drawings.43\n\nIt is through these connections with the character that Kentridge is able to incorporate his\nown relationship with Johannesburg and his experiences of living during the late- and\npost-apartheid era in South Africa.\nIn discussing the sources of Felix in Exile, the artist explains:\n\n'One photo came from the massacre outside Sharpeville. At the time, I was six years old\nand my father was one of the lawyers for the families of the people who had been killed. I\nremember coming once into his study and seeing on his desk a large, flat, yellow Kodak\nwoman with her back blown off, someone with only half her head visible. The impact of\nbox, and lifting the lid off of it - it looked like a chocolate box. Inside were images of a\nextraordinary.... So I would say that although when I was drawing the bodies for Felix in\nCONCLUSION\nThe case study of William Kentridge's film series has shown that one can broaden the\ncategory of political art. Indeed, through his technique resembling the ecriture\nautomatique, a complex layering of personal, aesthetic and ultimately political memory\ninfor\n- of a\nvarie\nts. To\not consider this form of art - whose denotation might not be political at all, but that is\nseeing these images for the first time - when I was six years old - the shock was\nExile I did not have the Sharpeville massacre in mind - this was only a connection I made\nsome months or years later - I'm sure that, in a sense, it was trying to tame that horror of\nseeing those images.' 44\n\nms his animated drawings. Kentridge is just one - albeit an important one\nty of artists creating such artwork within the visual and/or the performing ar\nn\nnevertheless drenched in the political climate it is made and reflects upon -a part of the\ncategory of political art, would be a mistake.\n\nNotes\n\nof Modern Art,\nFerris P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Art,\nford. London: Thames & Hudson, p.52.\n3 The t\nDepar\nf the\nHCom\nof\nagitati\n4 Wiki\nnotion of propaganda as a specific type of HmessageH presentation aimed at\nservin\ni root, the denotation of propaganda is 'to propagate (actively spread) a philosophy\nr point of view'. The most common use of the term (historically) is in HpoliticalH contexts; in particular to\nFerris P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Art,\nIn semiotics, the word 'denotation' is used to indicate the specific/particular image/idea/concept that a\nor suggests. It involves emotional overtones, subjective interpretation, socio-cultural values, and\nExamples are: Art in a State of Grace, Art in a state of Hope, art in a state of siege (1988), Casspires full\nst artists in\nSouth Africa, their use of this form dating from the late 1960s.\neke, G. (1999). TRC: Commissioning the past: [Re] forming the Past: South African Art bound to\naparth\n11 Ferr\nt,\nOxford\n12 Ferr\nt,\nOxford\n13 Ferr\n,\nOxfor\n14 Her\n:\nSnoec\n15 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nress Limited. p. 52.\nChristov-Bakargiev, C. (1998). William Kentridge. Catalogue. Belgium: Societe des Expositions du\n20 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nvan het Paleis voor Schone\n1 Ferris P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum\nOxford. London: Thames & Hudson, p.9.\nOx\nerm agitprop is short for отдел агитации и пропаганды (otdel agitatsii i propagandy), i.e.,\ntment for Agitation and Propaganda, which was part of the Central and regional committees o\nmunist Party of the Soviet UnionH. Most people today however, see agitprop as a contraction\nonal propaganda. - Hhttp://en.wikipedia.org/wiki/AgitpropH\npedia describes the\ng an agenda. At ts\no\nrefer to certain efforts sponsored by governments or political groups. -\nhttp://en.wikipedia.org/wiki/Propaganda\nOxford. London: Thames & Hudson, p. 7 (own cursive marking)\nsign refers to.\n7 In semiotics, the word 'connotation' is used to indicate the cultural HassumptionsH that the image implies\nideological assumptions.\nof love (1989) and Ubu tells the Truth (1997) / Ubu and the Truth commission\n9 Ferris P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Art,\nOxford. London: Thames & Hudson, pp. 81-82\n10 Paul Stopforth and Gavin Young are generally recognized as being among the first prote\nN\neid.\nis P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Ar\n. London: Thames & Hudson, p. 82\nis P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Ar\n. London: Thames & Hudson, p. 82\nis P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Art\nd. London: Thames & Hudson, p. 82\nreman, F. (1999). Liberated Voices. Contemporary Art from South Africa. Catalogue. Belgium\nk-Ducaju & Zoon.\nP\n16 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nPress Limited. p. 55.\nCameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nPress Limited. p. 35\nPalais des Beaux-Arts de Bruxelles / Vereniging voor Tentoonstellingen van het Paleis voor Schone\nKunsten Brussel. p. 65.\nCameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nPress Limited. p. 64.\nPress Limited. p. 62.\n21 Christov-Bakargiev, C. (1998). William Kentridge. Catalogue. Belgium: Societe des Expositions du\nPalais des Beaux-Arts de Bruxelles / Vereniging voor Tentoonstellingen\nKunsten Brussel. p. 96.\n\nPalais des Beaux-Arts de Bruxelles / Vereniging voor Tentoonstellingen van het Paleis voor Schone\nKunsten Brussel. p. 112.\nCameron, D., Christov-Bakargiev, C. & C\nPress Limited. p. 72.\nChristov-Bakargiev, C. (1998). William Kentridge. Catalogue. Belgium: Societe des Expositions du\noetzee, J.M. (1999). William Kentridge. London: Phaidon\n24 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nentridge. London: Phaidon\nress Limited. p. 72.\nCameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nPress L\n27 Cam\non\nPress L\n28 Cam\non\nPress Li\n29 Sitte\n30 Tap\nWestde\n31 Cam\nn\nPress L\n32 Dubow\ng\nof pos\n33 Cam\non\nPress Li\n34 Cam\nk rgiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nress Limited. p. 30.\nFerris P. & Moore, J. (1990) Art from South Africa. Exhibition catalogue - Museum of Modern Art,\nxford. London: Thames & Hudson, p. 10\n(1990) Art from South Africa. Exhibition catalogue - Museum of Modern Art,\nes & Hudson, pp. 10-11.\nWilliam Kentridge\nAutomatic writing - William Kentridge [DVD]. IN Point of View: an anthology of the moving image\nPress Limited. p.56.\n\nPress Limited. p. 72.\n25 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William K\nP\nimited. p. 30.\neron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaid\nimited. p. 30.\neron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaid\nmited. p. 34.\nnfeld, M. (2001). William Kentridge. Catalogue. Belgium: Snoeck-Ducaju & Zoon., p. 12.\npeiner, M.A. & Wulf, R, (1999). William Kentridge: drawing the passing. [video recording]\nutscher Rundfunk.\neron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaido\nimited. p. 53.\n, J. & Rosengarten, R. (2004). History as the main complaint: William Kentridge and the makin\nt-apartheid South-Africa. IN Art History. Vol 27, nr. 4, p. 679.\neron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaid\nmited. p. 56.\neron, D., Christov-Ba a\nP\nO\n36 Ferris P. & Moore, J.\nOxford. London: Tham\nCameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999).\n. London: Phaidon\nPress Limited. p. 35\n(2003). Bick Productions & New Museum of Contemporary Art.\n39 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\nPress Limited. p. 35\n40 Cameron, D., Christov-Bakargiev, C. & Coetzee, J.M. (1999). William Kentridge. London: Phaidon\n41 Sittenfeld, M. (2001). William Kentridge. Catalogue. Belgium: Snoeck-Ducaju & Zoon., p. 26.\n42 Sittenfeld, M. (2001). William Kentridge. Catalogue. Belgium: Snoeck-Ducaju & Zoon., p. 20.\n43 Sittenfeld, M. (2001). William Kentridge. Catalogue. Belgium: Snoeck-Ducaju & Zoon., p. 20.\n44 Sittenfeld, M. (2001). William Kentridge. Catalogue. Belgium: Snoeck-Ducaju & Zoon., p. 22."
    },
    {
      "category": "Resource",
      "title": "wendel1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/8a22b40f9013bd8817def4e3b0a4dfe8_wendel1.pdf",
      "content": "Evan L. Wendel\n9-20-06\nCMS.796: Major Media Texts\nClose Analysis\nImages of Womanhood in Shakespeare's Othello: Emilia as Feminist\nWomen during the Elizabethan era, aside from those of high nobility, are often assumed\nto have lived their lives entirely in the service of men--prearranged marriages, child-rearing, and\ntheir role as sexual objects are understood by many, both then and now, to be normative aspects\nof female life for the time period. However, such oversimplification ignores the socio-cultural\ndynamisms which exist in every historical period. Shakespeare recognized this, and his\nsignificance as a playwright is due in large part to his unceasing efforts to complicate and even\nundo preconceptions of the reader/audience, as opposed to merely echoing stereotypes. Emilia,\nDesdemona's female attendant in Othello, represents an attempt by Shakespeare to explore\nnotions of femininity that problematize widespread understandings of what it meant to be a\nwoman during this era. One passage in particular, which highlights some of the complexities\nsurrounding notions of womanhood during an altogether repressive and sexist historical\nbackdrop, is Emilia's speech in which she both addresses and attacks the double standards\npresent in male-female (sexual) relations (4.3.83-102). From this passage, among others, Emilia\ncan be read as an early feminist character.\nBy the time we reach the beginning of Emilia's visceral speech, Othello, in his \"peevish\njealousies,\" has openly accused Desdemona of being an \"impudent strumpet\" and \"that cunning\nwhore of Venice\" (4.2.82, 4.2.91)--he has even employed physical force against her (4.1.239).\nExpectedly then, Desdemona, in her complete innocence and youthful naivety,1 is bewildered,\nand wonders whether \"there be women do abuse their husbands / In such gross kind?\" (4.3.61-2).\nDesdemona is in utter disbelief that women would commit adultery, even for vast personal gain,\n1Shakespeare, William, Othello. Honigmann, E.A.J., ed. (London: Thomson Learning, 1999): 41-42.\n\nmade explicit when she asks: \"Wouldst thou do such a deed for all the world?\" (4.3.67), to which\nEmilia responds: \"The world's a huge thing: it is a great price / For a small vice\" (4.3.68-9).\nSuch logic illuminates a distinct contrast to masculine perceptions in which women who commit\nadultery were thought to be motivated exclusively by fickle lust and sexual appetite; here we\nwitness Emilia carefully calculating the risks/rewards of such a scenario--she approaches the\nsituation with reasoning more in line with the stratagems of kings and generals (i.e., maleness).\nDesdemona, perhaps in a last ditch effort to remind herself that she has in fact remained\nfaithful to Othello, says, \"I do not think there is any such woman\" (4.3.82), despite the fact that\nthroughout the scene Emilia's responses indicate she is talking to such a woman. Emilia\nfunctions here not as a passive woman whose purpose is to do the bidding of men, but rather\nrepresents an active, free-spirited and strong symbol of womanhood. In terms of the number of\nwomen who would abuse their husbands, she states there are \"a dozen, and as many to th'\nvantage as would / store the world they played for.\" Emilia begins with a blatantly sarcastic\nunderstatement, perhaps because she grows anxious over Desdemona's naivety, but then quickly\nsuggests that all women at some point would consider being unfaithful to their husbands if the\ncircumstances were ideal. In the final scene of the play, she even goes so far as to disobey Iago's\ncall to \"hold [her] peace!\" claiming that she will \"speak as liberally as the north\"2 in revealing\nher husband's villainous plot (5.2.216, 5.2.218). Returning to Emilia's speech we find that she\nrelocates blame for infidelity in male-female sexual relations upon the male, saying, \"But I do\nthink it is their husbands' faults / If wives do fall,\" and that it is \"that they slack their duties /\nAnd pour our treasures into foreign laps.\" Her language is nuanced and expresses a great deal of\nfeminist intent, especially with respect to her use of the word \"our,\" which implies ownership.\n2Emphasis added. My claim that Emilia is free-spirited and unconstrained by men is bolstered by word choice.\n\nMuch in the same way that men frequently speak of women as objects of possession, Emilia\ncomplicates matters by suggesting that the reverse must also be true--men, and specifically their\n\"treasures\" (i.e, seed, or semen) are the possession of women. Moreover, she views women who\nengage in extramarital affairs as doing so reactively, that is, only when their husbands have not\nfulfilled their obligatory sexual duties. Emilia perceives men to be both deprave and base,\nincluding her own husband, Iago, having earlier stated: \"'Tis not a year or two shows us a man. /\nThey are all but stomachs, and we all but food\" (3.4.104-5). Men see women as consumable\nsexual objects, to be used when desired, and ignored when other matters arise. Emilia inverts\nthese sexist sentiments in order to break them down, whereby she can be read as a symbol of\ndefiance who consciously casts aside the one-sided nature of male dominated culture.\nShakespeare goes even further, carefully exposing the emotional range and depth of\nwomen that parallels, and perhaps even transcends that of men. Emilia elaborates: \"Let\nhusbands know / Their wives have sense like them,\" thereby positing that women exhibit a\nsensorial and emotional consciousness3 that at the very least matches that of men. Women\ncannot be defined by \"grace,\" gentleness, and other similar stereotypes of femininity alone;\nShakespeare understands that they too \"have galls,\" or resentments, and are by extension capable\nof \"some revenge\" themselves. Emilia reiterates these complexities in posing a series of\nrhetorical questions which expose the ridiculous nature of double standards in male-female\n(sexual) relations: \"And have not we affections? / Desires for sport? and fraility, as men have?\"\nIn other words, she offers the reader/audience a more thoroughly humanized version of\nwomanhood, in which the emotional complexities, desires and hardships of women are\nequivalent to those of men. Shakespeare is directly questioning dominant views in which\n3Shakespeare, William, Othello. Honigmann, E.A.J., ed. (London: Thomson Learning, 1999): 295, see footnote 93.\n\nwomen are seen as the inferior and subservient, and calling attention to gender issues as a sites of\ncultural transformation. Emilia recognizes and plays on notions of male \"use\" of the female as\nobject, inverting and poking fun at the double standards women faced during the Elizabethan era.\nIf men espouse ownership of women and their bodies, then Shakespeare's Emilia--an early\nembodiment of feminism--gives us fair warning that they do so at their own peril."
    },
    {
      "category": "Resource",
      "title": "yusuf1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/8103030605cba2804ab6f91605c6e993_yusuf1.pdf",
      "content": "CMS 796: Major Media Texts\nHuma Yusuf\nThe Last Laugh:\nComedy and Gender in Howard Hawks' His Girl Friday\nThe character Earl Williams may have his death sentence reprieved at the\nconclusion of Howard Hawks' His Girl Friday (1940), but the jury is still out on whether\nHildy Johnson, a spunky journalist played by Rosalind Russell, can be considered a\nfeminist icon. Critics such as Marylin Fabe are enamored by Russell's Hildy, and have\nbeen prompted to exclaim: \"Hawks has pulled off a brilliant coup in His Girl Friday. He\nhas created a strong, smart, talented, beautiful, and powerful woman, thus subverting the\nusual gender stereotypes in classical Hollywood films\" (Fabe, 77). Others remain more\nskeptical about the extent to which Hildy subverts the power dynamic established\nbetween her and Cary Grant's inimitable editor Walter Burns. After all, the resolution of\nthe film seemingly necessitates a return to traditional gender dynamics with Walter and\nHildy - man and woman, husband and wife, editor and reporter - leaving for their\nhoneymoon. In Romantic vs. Screwball Comedy: Charting the Difference, for example,\nWes D. Gehring argues that His Girl Friday is one of few \"screwball comedies in which\nthe male apparently is in a more commanding position\", making the film \"an unusual\nouting\" in that the \"heroine does not rule\" (Gehring, 52/107). An attempt to reconcile\nthese diametrically opposed readings of Hawks' film could be made by examining the\nway in which comedy is used to construct gender in both His Girl Friday and its\npredecessor, Lewis Milestone's The Front Page (1931).\n\nIt would be tempting to say that Hawks' provocative decision to reconfigure Ben\nHecht and Charles Macarthur's originally male character Hildebrand Johnson as a\nwoman is evidence enough of his feminist agenda. But merely seeing a woman cast as a\nsuccessful reporter on the silver screen in 1940 would not have been deemed a \"brilliant\ncoup\" given that the number of female front-page journalists in the US quadrupled\nbetween 1920 and 1950 (Cairns, xvi). Indeed, female empowerment has to be manifest\nthrough action and articulation, rather than presence alone. For that reason, it is useful to\nconsider Milestone's film in relation to His Girl Friday to see how, if at all, the comedic\nagency bestowed on female characters evolves during the 1930s.\nMeanwhile, the decision to use comedy as the mode through which to deconstruct\ngender dynamics in Milestone and Hawks' films stems from the fact that \"comedies\nprovide a means of envisioning potentially liberating forms of transgression\" (Beach, 10).\nIn Class, Language, and American Film Comedy, Christopher Beach explains that\n\"because of the nature of comedy as a genre that is perceived as \"lighter\" and thus as less\nthreatening to society, the kinds of transgression permitted ... tend to be greater than in\nother genres. As Steve Neale and Frank Krutnik suggest, comedy is often allowed a\nconsiderable latitude, since \"subversion\" and \"transgression\" are to at least some degree\n\"institutionalized generic requirements\" of comedy\" (Beach, 10). In other words, comedy\nenables female characters to disrupt patriarchal norms and critique social structures\nwithin the safety afforded to them by the expectations of the genre. Referring specifically\nto the use of comedy by women as a form of empowerment, Beach invokes Russian\nformalist Mikhail Bakhtin's idea of the carnivalesque, which \"suggests a way of reading\nfilm as a subversive and democratizing form that can incorporate marginalized or\n\nrepressed elements of society ... The carnivalesque mode of social discourse as it\noperates in either film or literature uses language to liberate the characters from the\nrestraints imposed by good taste and etiquette, from all that represents the official\nculture\" (Beach, 13). Given the liberating potential of comedy, critics would be hard-\npressed to define as feminist a work that did not render its female characters as comic\nagents. Unfortunately, it is exactly in the location of comedic agency that Milestone and\nHawks fail to empower women, albeit to varying degrees.\nIn The Front Page, none of the female characters can be considered comic agents;\nthey do not initiate humorous scenarios, indulge in wordplay, deliver one-liners, retort\nsarcastically, or in any way transgress social boundaries or challenge the status quo. In\nfact, in a misogynist twist, women only participate in the film's comedic elements when\njokes are made at their expense. Female characters and indeed all things deemed feminine\nare laughed at - rather than with - by male characters within the world of the film as well\nas by the audience at large. This comedic territorialism is evident in the newsroom, which\nis established as a space of male jocularity where women are not allowed to trespass. In\nan early scene, for instance, Hildy Johnson as played by Pat O'Brien pulls a negligee out\nof his desk drawer. As the male reporters gathered around a central table laugh, they\nhighlight the incongruity of anything feminine in this distinctly male workspace.\nMoreover, at subsequent intervals throughout The Front Page, female characters\nare physically removed or laughed out of the newsroom. Molly Malloy's first entrance\ninto the space best encapsulates how humor is reserved for the male characters. As the\nreporters joke about convict Earl Williams' last meal and gauchely misspell words, the\ncamera cuts to the stairwell outside the newsroom where we see Molly silently skulking\n\nnear a pillar, eavesdropping on the men's jokes, cringing at their laughter, obviously\nhesitant to approach them. When she does enter the newsroom, most of the reporters\nmock her while one journalist gets up to pinch her cheek and harass her. Acknowledging\nthat she can never 'get' the joke because she is the joke, Molly calls the reporters \"wise\nguys\", helplessly invites them to continue laughing at her, and derides them for making\n\"a fool out of [her]\" before bursting into tears and rushing out of the newsroom.\nInterestingly, all the female characters in the film enact similar exits: Hildy's\nfiance Peggy Grant's mother is carried and chased out on two occasions while Jenny - an\nelderly cleaning lady who is tangential to the main plot - is toyed with until she manages\nto escape the newsroom. In fact, it is Hildy who rushes up to Jenny, kisses her against her\nwill, prevents her from doing her work, and instead forces her to dance with him - with\nher broom tucked awkwardly under one arm - while other reporters laugh at the clumsy,\nslapstick performance. In this moment, women are literally reduced to playthings\npresented for the amusement of men.\nAt other points in the film, jokes about women become more insulting and\nmalicious than playful. For example, one reporter - while on the telephone, presumably\nwith his editor or a news source - makes wisecracks about angry wives who beat their\nhusbands, a comical expression of disdain for dominant women. Another reporter named\nMac McCue is later shown interviewing a woman on the telephone. \"Is it true that you\ntook the part of Lady Godiva for charity seven years ago? Hello? She cut off!\" he\nexclaims. In a flash, yet another reporter retorts, \"What? Her hair? Tell her I'll be right\nover.\" While bawdy humor and conversations that occur at cross-purposes are bound to\nmake an audience laugh, such quips depend on a symbolic stripping and humiliation of\n\nwomen. Humor in this vain that sexualizes women without their consent becomes more\nuncomfortable in light of the actual physical harassment enacted by the reporters on\nMolly, Jenny, and Mrs. Grant. It also does not help that the women who become the butt\nof the reporters' jokes are not given an opportunity to respond to those who mock them;\nthey remain voiceless, faceless ghosts - convenient constructs at the other end of a\ntelephone line who never make it into the frame.\nElsewhere, Adolphe Menjou's Walter Burns jokes about how his mother's death\nwould not prevent him from working. He later makes amusing jibes at the mayor, saying\nthat the politician would hang his own mother if it would help him win the upcoming\nelection. While these statements are meant to be amusing exaggerations that are certainly\nenjoyed by the circle of reporters - Walter's proxy audience within the film - they enact\nincreasingly sinister instances of verbal violence against women.\nOf course, the removal of women from the comedic realm of The Front Page\noccurs most explicitly in the scene during which Hildy calls Peggy from the newsroom.\nHildy ask his fiance, \"Hey, darling, what's the matter?\", and in a comic interjection\nmeant to undermine Hildy and Peggy's loving relationship, a reporter responds to the\nquestion and complains, \"I distinctly said gluten,\" in reference to a botched sandwich\norder. Once again, the woman remains unrepresented on the wrong end of a telephone\nconversation. And while the conflation of parallel conversations is amusing, the\nimplications in this moment for gender dynamics are no laughing matter. After all, the\nreporter's mindless quip silences and in fact overrides Peggy's complaint about Hildy's\nunloving and distracted behavior. Moreover, the nature of his mock complaint, mapped\nas it is onto the conversation between a man and his wife-to-be, relegates women to the\n\ndomestic realm by implying that the only thing worth discussing with them is the\npreparation of lunch. Finally, by cutting Peggy off to deliver his banal punch line, the\nreporter overtly privileges male buffoonery over female participation.\nIt is also worth noting that in the rare instances when the wisecracking reporters\nunleash their wit against other men, the male character being mocked is inevitably\nfeminized. For example, after Williams' escape from prison, the reporters collectively\nmock Sheriff Hartman. In response, he throws an exaggerated temper tantrum before\nsniveling and simpering before the mayor and reminding him that he regards the mayor's\nwife Betty much like a sister. Through his invocation of the domestic and familial sphere\nas a way out of a scrape, Sheriff Hartman is cast as effeminate and is thus subject to\nfurther mockery. Later, when Williams receives his reprieve, the mayor instructs Sheriff\nHartman to organize some celebratory parties, another task normally affiliated with\nwomen. Through these implicit gender role reversals, comedy as constructed by The\nFront Page is maintained as a masculine attribute that is expressed at the expense of\nwomen without offering them a language of recourse.\nNo doubt, casting Russell as Hildy in His Girl Friday complicates the location of\ncomic agency and problematizes the binary that presents men as the makers of humor and\nwomen as the butt of all jokes. That said, Hildy is the only female character in Hawks'\nfilm that is allowed to participate in the comic realm. For their part, Helen Mack's Molly\nand Hildy's fiance Bruce Baldwin's mother play much the same role as their counterparts\nin The Front Page. Molly is a melodramatic presence who is mocked by the reporters in\nthe press room of the Criminal Courts Building while Mrs. Baldwin is reductively\n\npresented as a comic device required to facilitate Grant-as-Walter's amusing\nshenanigans.\nFurthermore, in another throwback to The Front Page, the male characters that\nbecome humorous subjects are first emasculated. Bruce, for instance, does not initiate\ncomedy - he is not a wisecracking, punning prankster - but provides the audience with\nmany laughs as he is repeatedly duped by Walter. Of course, Bruce's vulnerability to\nmockery stems from the fact that he allows women - both his mother and Hildy - to\ndominate him, control his actions, and put words in his mouth. In this regard, Bruce\nresembles the incorruptible governor's clerk Joe Pettibone, another male character who\nthe audience laughs at, not with. Pettibone as played by Billy Gilbert is demasculinized:\nhe is overweight and clumsy - one of few slapstick routines in the film revolves around\nhim struggling with his umbrella in a doorway - incapable of reading between the lines,\nprone to expressing wide-eyed wonder and speaking in a high-pitched, sing-song manner\nthat, as the mayor points out, makes him sound \"like a child\". Through repetitive\ndialogue in which Pettibone refers to his wife as the main authority in his life, the film\nseems to argue that the character's bumbling behavior can be attributed to the fact that he\nis subservient to a woman. Along the same lines, the reporter Roy V. Bensinger - who\nprovides a comic interlude when he is subjected to Walter's manipulative charms - is\nreconfigured as effeminate before the audience is permitted to laugh at him. Not only\ndoes Bensinger write and recite sentimental poetry about Williams, but he is also quick to\nassume a secondary position in relation to Walter by referring to him as \"mon capitaine\".\nAs such, the comedic routines of His Girl Friday maintain a more traditional gender\n\ndynamic in which the men make merry while the women - or those men who defer to or\nin any way resemble them - are mocked.\nIn this context, Hildy initially stands out as a comic heroine, a wielder of\ninnumerable one-liners who is capable of making the audience laugh with her, at, for the\nmost part, Walter. From one of her earliest lines in the film, in which she sarcastically\nrefers to Burns as \"the lord of the universe\", Hildy incites laughter. During their first on-\nscreen conversation, Hildy does not hesitate to mock Walter and not only imitates the\nway in which he says \"anytime, anyplace, anywhere\" but also babbles incoherently to\nparody the speed at which he speaks. Later, in a series of sarcastic asides, Hildy jokes\nthat Walter seems charming because \"his grandfather was a snake\" and ridicules his\nphysique when instructing Bruce to prepare an insurance policy for him:\nHildy Johnson [to Bruce Baldwin]: \"Get him examined, that old carcass.\"\nWalter Burns: \"I'm better than I ever was.\"\nHildy Johnson: \"That's nothing to brag about.\"\nAs if not content with merely deflating Walter's masculine ego, Hildy goes on to critique\nthe inconsiderate manner in which her former husband treats women. \"He'll make some\ngirl quite happy,\" she seemingly concedes, before muttering a poignant punch line to\nherself - \"slap happy\".\nAt other moments in the film, Hildy provokes laughter that is not directed at her\nby performing verbal slapstick, which Alan Dale defines as \"dialogue performed at a\nbreakneck clip\" (Dale, 5). Soon after she realizes that Walter has orchestrated the arrest\nof her fiance, Hildy calls him from the press room to berate him: \"Now get this, you\ndouble-crossing chimpanzee ... If I ever lay my two eyes on you again, I'm gonna walk\nright up to you and hammer on that monkeyed skull of yours 'til it rings like a Chinese\n\ngong!\"1 Dale argues that such verbal acrobatics are funny because they \"adopt the pace\nwe'd converse at if we all thought of our brightest remarks in time.\" He adds that comedy\ncan \"be achieved just by having [characters] trample each other's lines - they don't have\nto be listening to each other, or even to be intelligible, for us to respond to the humor\"\n(Dale, 6).\nThat said, it would be premature to declare Hildy a comic heroine who is liberated\nthrough her use of language to subvert the dominant social structure. On closer\nexamination, it becomes apparent that Hildy is only given comic agency in relation to\nWalter - her jokes are about him, are responses to comments he makes, and are often\ndirected towards him. Without Walter, in other words, Hildy would not be very funny. By\nmaking her subversive power as it is encapsulated in spoken language indirectly\ndependent on Walter, Hawks undermines Hildy's comedic agency and puts his own\nfeminist project in peril.\nThe fact that Hildy's comic license is thus constrained becomes explicit when we\nrealize that she cannot participate in the jocular environment of the press room in the\nCriminal Courts Building, a space primarily inhabited by male reporters. Unlike The\nFront Page, where women are entirely excluded from this realm, Hildy is welcome to\nwork in the shared space. But as soon as the reporters engage in witty banter, Hildy is\nsidelined and visually constructed by Hawks as a diegetic yet passive audience member\n1 In an interesting reversal of phone conversations from The Front Page, the audience of His Girl\nFriday is allowed to see and hear Hildy at this moment while Walter remains a silent presence at the other\nend of the telephone line. Of course, unlike the women who are telephoned in Milestone's film, Walter\nlater enters Hawks' frame and is allowed to respond to Hildy's jibes.\n\nwho can appreciate the humor of the male reporters but not respond to or complement it.\nFor example, soon after Williams' escape, all the reporters gathered in the newsroom call\ntheir editors and coin absurd scenarios describing police efforts to recapture Williams in\nan attempt to highlight official incompetence and inefficiency. While one reporter is\nshown fabricating a story about a police official who examined the body of a\n\"pickaninny\" to determine whether or not it was Williams, the camera cuts to a shot of\nHildy standing by her desk and laughing, but not engaging in a similar practice.\nHildy's status as a detached, inactive observer is further articulated when the\nreporters crowd around the mayor and sheriff at the doorway to the press room and\nrelentlessly mock them for letting Williams escape. In this instance, Hawks crams six\nwisecracking men into his shot, leaving no space for Hildy's participation. Instead, he\ncuts to a shot of two more male reporters who seem to be at the fringe of the initial circle\nof mockery. Hildy is only visible in the background of this shot, standing akimbo, hand\non hip, with a wry smile on her face, obviously appreciating her colleagues' witty\nhumiliation of the authority figures. Through such framing, Hawks overtly marginalizes\nHildy even after giving her access to the male, comedic space.\nInterestingly, Hildy is also prevented from engaging in any political humor, even\nthough the male reporters in His Girl Friday are encouraged to \"take Hitler and stick him\non the funny pages.\" When harassing the mayor, one reporter asks him, \"Is it true you\nsleep in red underwear?\" Before the mayor can dismiss this query, another reporter jumps\nin to question whether the mayor is \"on Stalin's payroll\". To enhance the comic value of\nthis politically subversive banter, the reporter mispronounces Stalin's name. Indeed,\nthrowaway one-liners about Red armies lining up in Moscow are peppered throughout the\n\nfilm, but at no stage does Hildy make a humorous comment about world politics. Her\ndeliberate exclusion from this particular realm of comedy seems to imply that Hildy can\nonly use comedy as a mode of subversion in the context of a heterosexual relationship,\nand not in the arena of geopolitics.\nTo Hildy's credit, though, there are moments when she employs humor beyond\nthe confines of her interactions with Walter. Unfortunately, the mode of comedy\nemployed in these instances is mimicry, a device that reaffirms Hildy's inferior status as\none who can imitate, but never initiate. In one slapstick scenario, Hildy is composing her\nscoop on Williams' escape on a typewriter while Bruce tries to make it clear to her that\nhe plans to leave for Albany on the nine o'clock train. As she's typing, Hildy distractedly\nrepeats what Bruce is saying and ends up including the words \"nine o'clock train\" in her\nstory. The humor in this instance may seem benign, but it implies that when working,\nHildy assumes a professional backseat and writes whatever someone tells her to. Given\nthat Walter has just incited Hildy to stay on the job and write the Williams story, the joke\nhere becomes an explicit comment on the power dynamic that exists between Hildy and\nWalter and strips her of all agency, comedic or otherwise.\nA similar dynamic is established when Hildy first tries to participate in the\npolitical arena from which she has, until now, been excluded. When the reporters begin to\nsuspect that Hildy knows where Williams is hiding, they crowd around her and threaten\nto harass her in much the same way that they previously cornered the mayor and sheriff.\nWhen Sheriff Hartwell questions Hildy about Williams' whereabouts, she chooses to use\ncomedy as a way to embolden herself and mock his authority:\nSheriff Hartwell: \"Are you going to talk or aren't you?\"\nHildy Johnson: \"Well, what do you want me to say?\"\n\nSheriff Hartwell: \"What do you know about Williams?\"\nHildy Johnson: \"What do you know about Williams.\"\nThrough this literal reading of the sheriff's question, Hildy once again sets herself up as\none who can mimic, but not mock. Comedic agency, then, remains in the masculine\nrealm.\nIndeed, Hawks takes great pains to construct comedy as a masculine attribute in\nHis Girl Friday. In a final intriguing move, he blurs the traditional power dynamic\nbetween genders by having Hildy behave much like the men of The Front Page by\nmaking women the subject of her humorous asides. For example, Hildy overtly\nundermines the occupation of most women through comedic exaggeration. In an ironic\nmoment, the script has Hildy mocking wives and mothers, posts that she has declared to\nbe \"respectable\" and \"halfway normal\". According to Hildy, \"being a woman\" involves\n\"[having] babies and [watching] their teeth grow.\" Through this humorous comment,\nHildy lambastes feminine occupations as futile. At another point, Hildy seemingly\nconspires with Walter to sexualize and mock women without their consent:\nHildy Johnson: \"Walter!\"\nWalter Burns: \"What?\"\nHildy Johnson: \"The mayor's first wife, what was her name?\"\nWalter Burns: \"You mean the one with the wart on her?\"\nHildy Johnson: \"Right.\"\nWalter Burns: \"Fanny!\"\nSince this raunchy joke is bound to get laughs from the audience, it seems as if Hildy has\ncomic agency. But the fact that she has to adopt a masculine, misogynist stance and quite\nliterally make a woman the butt of her joke to be considered funny maintains a more\ntraditional gender dynamic in the world of His Girl Friday.\n\nAs such, Hawks does not fully exploit the carnivalesque space created within\nscrewball comedies through speech acts. His female characters are not liberated to the\nextent that they can disrupt traditional gender dynamics as Hawks erects comedic\nboundaries and controls the way in which women navigate humorous spaces. By\ndetermining how women laugh, whether they are laughed at or laughed with, Hawks\nprevents His Girl Friday from being the \"brilliant\" feminist coup that Fabe wants it to be.\nWorks Cited\n1) Beach, Christopher. Class, Language, and American Film Comedy. Cambridge\nUniversity Press. Cambridge, 2002.\n2) Cairns, Kathleen. Front-Page Women Journalists, 1920-1950. University of\nNebraska Press. Lincoln, 2003.\n3) Dale, Alan. Comedy is a Man in Trouble. University of Minnesota Press.\nMinneapolis, 2000.\n4) Gehring, Wes D. Romantic vs. Screwball Comedy: Charting the Difference.\nScarecrow Press Inc. Oxford, 2002.\n5) Fabe, Marylin. Closely Watched Films: An Introduction to the Art of Narrative\nFilm Technique. University of California Press. Los Angeles, 2004."
    },
    {
      "category": "Resource",
      "title": "ford2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/a0659e9d5adc665eeae950b917c42905_ford2.pdf",
      "content": "Sam Ford\nA Meditation on Mediation: A Close Reading of Olivier's Cough\nThe 1944 film version of Shakespeare's Henry V, directed by Sir Laurence Olivier,\nprovides the material for a rich study of a narrative's transference across multiple media forms.\nThe story has been transferred from the written play text (where the film's narrative was inspired\nfrom) to the Elizabethan stage (where much of the action is set in the film) to the film version the\naudience is watching. The film's opening sequence grounds the audience's experience by\nmaking the viewer aware of these forms, by presenting the beginning of Shakespeare's text\nverbatim, by framing the film in its opening through a wide high angle shot of Elizabethan era\nLondon from a bird's eye view, and by focusing the opening sequence on the various levels of\nsociety in the Elizabethan crowd.\nThe film cannot recreate the experience of attending a live theatrical production of Henry\nV, although the filmmakers attempt to capture this dynamic as actively as possible in a series of\nshot/reverse shots between the actors and the audience in Act I, Scene 1, with the two bishops.\nHowever, the following sequence demonstrates best what the filmic representation of the staging\nof Henry V can accomplish and perhaps acts as the film's very thesis. The camera follows the\nactors backstage--an example of \"restricted access\" for the film viewer, in that audience\nmembers at a play are not allowed to see behind the curtain.\nHere, Olivier and his team actively state their goal for the film, not only to recreate and\nreshape the story of Henry V but to study the process that makes this repurposing possible. The\nscene builds in dramatic tension as the camera surveys the process of staging a play and climaxes\nwith the first appearance of the film's star and director, a moment that both celebrates--and\ncommentates--on the feature film's reliance on a star image and the changes the narrative\n\nundergoes in these distinct storytelling forms. That moment--the nervous cough--contains the\ncrux of the film's meaning. A close reading of this short sequence, only 1:15 in duration, reveals\nthe ways in which the film handles these issues of adaptation and mediation across multiple\nmedia forms.\nWhen the initial scene between the two bishops concludes, both actors exit through the\nbalcony curtain. The film shifts to a shot underneath the backstage stairs to the balcony, with the\ntwo actors filmed coming down. In this backstage area, the film's viewers become aware that\nthese men are no longer the bishops but are now the stage actors who play these roles, as they\nbegin changing costumes. Here, the suspension of disbelief accomplished for the spectator of the\nstage is lost. Thus, first seeing the bishops on-stage and then immediately seeing the actors who\nplay those roles backstage, engulfed by a sea of other actors changing their costumes, focuses the\nviewer's attention not on the narrative of Shakespeare's work but on both the \"magic\" and the\nlimitations of a stage representation.\nThe camera shifts its focus from the two actors playing the bishops to two boys who are\npreparing to play female roles. Here, the film focuses again on the differences between the\nexperience of \"reading\" Henry V, which Olivier and his team probably figures a significant\nportion of the audience has done prior to watching the film, and the experience of the\nElizabethan stage. One boy contemplates whether to stuff his chest with fruit to appear to have a\nlarger bust line, while the other boy, already dressed in women's costuming, shaves. The\nlimitations of a stage production--as opposed to a reader's imagination earlier invoked in the\nverbal introduction--may be most visually apparent in this moment.\nThe third major camera shift focuses on several \"layers\" of actors preparing to step onto\nthe stage, as their characters signal the imminent arrival of the king. Here, the film switches\n\nfrom being aware of the artifice of the stage to becoming most aware of the artifices of the\ncinema. While the music and characters signal the arrival of the king on stage, the film viewer is\nanticipating the arrival of its marquee star and director. As each successive row of actors steps\ninto the left side of the frame to head onto the stage, it encourages the viewer to study their faces,\nsearching for Olivier. Finally, Olivier \"unassumingly\" steps into the shot. He quietly walks into\nthe left side of the frame, giving the audience the gratification of the star image. Unlike the\nprevious score of \"non-stars,\" Olivier does not share the scene. Yet, at the moment he fulfills the\naudience's desire of the star image, he complicates its fulfillment with a nervous cough.\nIn the germs of that cough arrives the film's thesis. For, in that moment, Olivier makes\nseveral statements simultaneously--commentary on the film that follows, a filmic representation\nof the journey from text to stage to film. In relation to the stage, we see a private moment with\nthe actor who plays Henry V, the nervous cough distinguishing him from the eloquent king he is\nabout to play. In relation to the film, we see Olivier deny the gloriousness of the star image\nwhile also giving viewers what they may perceive as a private moment, possibly a hint at who\nthe \"real\" Olivier is. Furthermore, since Olivier is both star and filmmaker, we get the statement\nthat the production, this filmic representation, is going to bear his stamp. Finally, the cough--as\nif it were Olivier caught unawares--promotes the type of gracious humility that Olivier's star\nimage exudes even as it conflicts with the air of supremacy which sets Henry aside from the\nother, unnaturally comic actors.\nOlivier steps out onto the screen, where he becomes Henry V, both for the audience in the\nfilm and for the film's audience. But, at the moment of the cough, he simultaneously projects no\nless than five separate identities--Olivier the filmmaker, Olivier the star, Olivier the private\nhuman being, the unnamed stage actor Olivier is playing, and the representation of Henry that is\n\nto come. It is this one moment, Oliver's cough, which embodies these divisions and highlights\nthe film's ability to examine these various layers of mediation simultaneously."
    },
    {
      "category": "Resource",
      "title": "grigsby2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/65a9ff517ab5f09c5c9c4ea1138974ec_grigsby2.pdf",
      "content": "Neal Grigsby\nFeudal kings appealed to a divine right to justify their rule. In Britain, the Archbishop of\nCanterbury bestows this right through a ceremonial anointment of the mon arch. The Canterbury\nof Shakespeare's Henry V references and explicates this concept of a natural political order when\nhe compares the kingdom to a hive of bees (1.2.183-204). His model predicts harmony only\nwhen the social agents, king included, know their place in the hierarchy. However, even within\nCanterbury's argument, and throughout the ensuing text, Shakespeare complicates the equation\nof monarchical rule and domestic peace. In fact, the text supports an interpretation of the\n\"natural\" role of king as not the keeper of the peace, but its chief disturber. In the final act,\nBurgundy recasts the nature metaphor, providing an alternative to Canterbury's theological\ndeterminism, and, arguably, a subtle criticism of monarchical authority.\nCanterbury advises King Henry to fulfill his duty by example of the honeybees, which \"in\nnature teach/the act of order to a peopled kingdom.\" He creates a dichotomy between nature, in\nwhich order is achieved spontaneously, and humanity, who must discern God's will through\nactive interpretation. In the passages which follow, the reader is primed to look for Canterbury's\ninterpretation of a king's God-given role in state affairs. We might predict a multifaceted purpose\nfor Henry, sitting, as he does, at the keystone position in the hierarchy. Instead, Canterbury\nassigns all duties vital to the operation of the kingdom to his officers : magistrates, merchants,\nand soldiers. This leaves Harry to more literally sit at the top, in his \"tent-royal,\" and accept the\n\"pillage\" of his military. The conspicuous lack of active language associated with the king lends\na comical aspect to a description of him as so \"busied in his majesty\" that he can only passively\nsurvey the domestic realm.\nCanterbury's model limits the duties of the king, what few there are, to those of a military\ncharacter. In arguing the crown's leave to make war on foreign soil, he necessarily casts the king\n\nNeal Grigsby\nas superfluous at home. Shakespeare replicates this characterization of a king's occupation\nelsewhere in the drama. Exeter echoes Canterbury's deterministic sentiments with his own\nhawkish rhetoric: \"Your brother kings and monarchs of the earth/do all expect that you should\nrouse yourself\" ( 1.2.122-123), as if Henry's contemporaries considered military conquest a fait\naccompli for a sitting king. Lest we think the king responsible for dispensation of justice, as\nHenry's action seem to suggest with his executive order to release \"the man committed\nyesterday/That railed against our person\" ( 2.2.40-41), he reveals this merciful act as merely a\nsnare to incriminate conspirators against his military campaign.\nThe king's own language reveals an understanding of the exclusively military character of\nhis rule. Spurred by the Dauphin's insults, Henry pledges to \"keep my state,/Be like a king, and\nshow my sail of greatness\" ( 1.2.273-274). To \"be like a king,\" he must attack his foreign\nenemies. To rouse soldiers for the invasion at Harfleur, he associates vicious animal behavior\nwith military skill -- \"when the blast of war blows in our ears/Then imitate the action of the\ntiger\" ( 3.1.5-6) -- and military skill with nobility -- \"Be copy now to men of grosser blood/And\nteach them how to war\" (3.1.23-24). This inverts conventional characterizations of nobility as\nlofty and pure, and peasantry as earthy and savage. Henry recapitulates these relationships in the\nSt. Crispian's Day speech, promising that each solider, \"be he never so vile,/This day will gentle\nhis condition\" ( 4.3.62-63). The dual meaning of the word \"gentle\" gives the line its ironic effect.\nIt promises to elevate the peasant to gentility, but only through bloody deeds that are anything\nbut gentle. Finally, Henry makes the direct link between king and military explicit in his wooing\nof Katherine. \"Take me,\" he implores, \"and take me, take a soldier; take a soldier, take a king\"\n( 5.2.170-171).\nIn the final act, Burgundy's appeal to peace rebukes Canterbury's laissez-faire\n\nNeal Grigsby\ninterpretation of royal duty. Echoing an earlier observation by the Chorus, which saw how honor\nbade the men of England \"sell the pasture now, to buy the horse\" ( 2.Cho.5), he shows that war\ndoes, indeed, have an opportunity cost. Again, Shakespeare creates a metaphor of order in nature\nto describe the kingdom, but one that contrasts sharply with the earlier model. Instead of a\nbeehive, Burgundy casts France as the \"best garden of the world\" ( 5.2.36). Instead of a hierarchy\non auto-pilot, he describes how royal neglect makes peaceful work \"lie on heaps,/Corrupting in it\nown fertility\" (5.2.39-40). In short, he bases his metaphor on agriculture rather than wilderness;\nthe work of man, not the work of God. Burgundy asserts that, by waging war, Henry has not\npreserved the kingdom, he has actively imperiled it. As Canterbury himself conceded: \"miracles\nare ceased\" ( 1.1.67). Peace does not arise spontaneously, it must be achieved through active\nwork.\nThe metaphor yields further implications when we consider not just its tenor part, but the\nconnotations of its vehicle. The tenor calls for a reconsideration of royal priorities, the vehicle\nfor a privileging of agricultural values. I believe this to be significant. One must only assign\nmodern democratic values to a pre-modern text carefully, but Henry V seems ripe for application\nof populist heuristics. Evidence from the text shows the motivations for war as corrupt, its\napplication detrimental to the domestic sphere, and royalty implicated in the cycle of violence.\nBy contrast, Shakespeare elevates the work of the people -- the farmers -- to a political ideal.\nThis wordplay suggests that kings and queens do no justice to the powers given them. For who\nbetter to effect a political model based on agriculture than the farmer?"
    },
    {
      "category": "Resource",
      "title": "verschooren2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/907a2c6429f7067e4df85ba449b7a22f_verschooren2.pdf",
      "content": "Gallery Talk: Christian Jankowski - Everything fell together\nKaren Verschooren\n12/09/'05\nConcept:\nMy final project for this Major Media Text class consists of a gallery talk on the work of\nChristian Jankowski, currently on display at the List Visual Arts Center.\nThe outline of the talk is the following:\nIntroduction\nWho is Christian Jankowski?\nHow to characterize his work?\nA walk through the gallery\nBrief explanation of every piece with built-in references to issues of authorship (~\npostmodern artist-entrepreneur), conceptual and postmodern conceptual art, community-\nrelations, transformational possibilities of art and a small elaboration on the issue of art,\nritual and belief systems.\nConclusion\nQuestions\nMotivation and goals:\nJust before finishing my paper on William Kentridge, I decided that my next project for\nthis class should be on a topic I felt equally passionate about. What had to be different\nthough, was the presentation form. After five years of non-stop university education, I\nvery much feel the need to have my work result in something else than 'just' another\npaper, read by 'just' a couple of people. I thus decided to go for the spoken word, instead\nof the written one.\nIntrigued by my first walk through the List gallery showing Christian Jankowski's work,\nI went to the lecture Jankowski presented mid October and subsequently to almost every\nevent related to his work. It thus felt natural to choose for a gallery talk on Christian\nJankowski's work, which not only allowed me to do more in-debt-research on his work,\nbut also conveniently locate the project outside of the classroom.\nI consider this project as a valuable exercise in conducting research as well as in guiding\na group through an interpretation-rich environment. I do not feel the gallery talk should\nbe considered as a presentation in the strict sense of the word, since a lot of attention will\nbe paid to interactivity and discussion amongst the participants.\nI hope to succeed in conveying my enthusiasm for Jankowski's art, as well as, in\nproviding a critical viewpoint on his working method, his art and the reoccurring themes.\n\nEvaluation\nWriting this paragraph, just an hour after finishing the gallery talk, I am still riding the\nenergy wave it gave me. I am extremely grateful for the effort everyone did to come out\nin a snowstorm to join me in walking through Christian Jankowski's retrospective. My\noverall feeling is one of contentment, relieve and excitement. I feel content, because I had\nthe impression people were getting something out of it - maybe just a pleasant feeling, a\ngood laugh, an hour of not thinking about thesis presentations, and I hope more... . I feel\nrelieve, because the talk was given as a final project and thus concludes the work related\nto this class. I feel excitement, because I loved giving the talk and can't wait to do it\nagain.\nSince a critical assessment is useful to improve my future endeavors, I have also been\nthinking about what I felt went wrong and why or how the gallery talk could be treated\ndifferently. If I would do the talk again, I would pay more attention to not rushing into\nquestioning participants for interpretations. Whereas, I have seen the work a couple of\ntimes before and I have had the opportunity to spend time looking for meaning, most of\nthe participants have never seen or thought about the artwork before. I believe I made that\nmistake when discussing the first two pieces; The Hunt and Shamebox, and tried to\nchange that approach afterwards. Maybe I would also decide not to talk about every\nartwork in the gallery, but to select a smaller amount of art pieces for the group to\ncontemplate about. It would allow the participant to give the artwork the time it demands\nand to think about it, before going into discussion. Since I chose the first approach, I had\nto calculate how much time we could spend on every piece in the gallery and I must\nadmit that my initial calculations weren't realistic. During the talk, I noticed that we\ncould never keep up with the timing I had imagined, so I decided to end the talk with The\nDay we Met (the karaoke box) and not to push the group forward to see the last two\npieces. This decision made the group miss out on two great works - especially Matrix\nEffect is wonderful - but I feel everyone received enough information to be able to 'get'\nthose piece by themselves and there are still gallery brochures to turn to for some\nminimal explanation.\n\nSources\nBenjamin, W. (1936). The work of art in the age of mechanical reproduction. Retrieved\nSeptember 10, 2005 from\nhttp://www.press.jhu.edu/libproxy.mit.edu/books/hopkins_guide_to_literary_theory\n/entries/walter_benjamin.html\nChristian Jankowski: Everything fell together. Exhibition catalogue. (2005). Iowa: Des\nMoines Art Center.\nCorke, R. (03/08/'02). And for my next trick .... - visual art. The Times.\nDaniel, J. (11/03/'02). Jankowski adds some spirit to his theater of the absurd.\nWashington: St. Louis Post.\nGallery Talk (10/16/'05). Christian Jankowski: Everything fell together. Massachusetts:\nList Visual Arts Center.\nJankowksi C. (10/15/'05). Everything fell together: Lecture Massachusetts: MIT.\nJankowski C. (12/07/'05). Christian Jankowski: Everything fell together. Gallery Talk.\nMassachusetts: List Visual Arts Center.\nKantor, J. (02/01/'02). Christian Jankowski: Swiss Institute. Artforum, 40 (6).\nKikuchi, H. (11/20/'05). Christian Jankowski: Everything fell together. Gallery Talk.\nMassachusetts: List Visual Arts Center.\nKlosterfelde: http://www.klosterfelde.de/sites/artists/jankow/ar_f.html\nReust, H.R. (03/01/'04). Christian Jankowski: Museum fur Gegenwartkunst. Artforum\nInternational, 42 (7).\nSmolik, N. (02/01/'00). Christian Jankowski. Artforum, 38 (6).\nSouth China Morning Post. (10/23/'05). Lights, camera, action: but who needs film when\nyou're an artist? Christian Jankowski loves making movies. But, as he tells Jade\nLee-Buffy, the drama is all in the shooting. Hong Kong: South China Morning Post\nPublishers.\nSouth China Morning Post. (10/06/'05). Para/Site Art Space. Hong Kong: South China\nMorning Post Publishers."
    },
    {
      "category": "Resource",
      "title": "wendel2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/cms-796-major-media-texts-fall-2006/1bcc22985ff63684ec26a1b87768bf76_wendel2.pdf",
      "content": "Evan L. Wendel\n11-20-06\nCMS.796: Major Media Texts\n\nComparative Analysis\nWorldspace in Mary Shelley's Frankenstein and Ridley Scott's Blade Runner:\nFrom Romantic Nature to Artificiality\nThe language and style of Mary Shelley's Frankenstein are both deeply rooted in\nthe literary traditions of the Romantic period, and yet Victor Frankenstein's scientific\nexperimentation, and eventual success in creating life from inanimate matter, certainly\nmakes Frankenstein an early forbearer of the science fiction genre. However, it is\nimportant to point out that Mary Shelley's novel is primarily concerned with critiquing\nthe science of the early 19th century, whereby the worldspace of Frankenstein, that is to\nsay, the physical surround the characters of the text inhabit, remains highly structured\naround Nature, which is used to elucidate their lived experiences. Blade Runner (Ridley\nScott, 1982; rev. 1992), in stark contrast, positions the viewer from the very opening\nsequence of the film within a hauntingly mechanized and non-natural future--the hellish\nworldspace of Los Angeles in the year 2019. The aim of this essay will be to explore\nparallels between Frankenstein and Blade Runner in order to illuminate key differences\nbetween their respective worldspaces, and examine how character experiences, regardless\nof their humanness, are articulated through language, imagery and visuals within these\nspaces.\nThe parallels between the Creature in Frankenstein, and Roy Batty (Rutger\nHauer), the poetic leader of the fugitive replicants in Blade Runner, are obvious. Both\nare living creations of unchecked scientific endeavors, thereby raising many of the same\nphilosophical, moral and ethical concerns. Similarly, both are regarded as Other, that is,\ndistinct from humans, though the distinction is blurred more in the case of replicants, as\n\nthey are genetically engineered to simulate humans in everything but emotional response.\nBy comparing Roy's lived experiences with those of both Frankenstein and his Creature,\nwhile keeping in mind the imagery and visuals which define the spaces they respectively\ninhabit, it becomes clear that they exist within two diametrically opposed worldspaces.\nJay Clayton has argued that Blade Runner draws on an undercurrent in the Frankenstein\nmyth, namely, sympathy for the Creature, and he very successfully maps how the film\nsimilarly elicits our sympathy for the replicants (88-91)--like Frankenstein's Creature,\nRoy possesses an eloquence which is undeniably compelling. Even so, Clayton tends\ntowards examining these characters in isolation, paying scant attention to the spaces they\noccupy. Despite all of the sympathy conjured up for the replicants, the parallels drawn\nbetween humans and replicants, and Clayton's contention that the \"artificial creatures end\nup seeming more 'human' than the people who stalk them,\" there seems to be a decidedly\ndifferent message stemming from the surrounding worldspace, and the ways in which the\nreplicants relate to it (85). While we may at once feel sympathy for the replicants (made\neasier by the fact that they visually appear human-like, unlike Frankenstein's Creature),\nwe simultaneously recoil from the world presented to us.\nBy closely analyzing two scenes in Blade Runner that exhibit striking similarities\nto moments in Frankenstein, it becomes clear that, regardless of sympathy for the\nreplicants, this non-natural, mechanical, and by extension, non-living world, is a space\nrepresentative of a grim future which has its origins in the very same all-penetrating and\nmonomaniacal scientific hubris Mary Shelley indicted almost two centuries ago. The\nhaunting futurity of Blade Runner, inscribed by the total absence of Nature, makes the\nwarning against science run amok exponentially more profound.\n\nThe Tyrell Corporation, residence and business place of Eldon Tyrell, the God\nlike scientific \"genius\" behind the creation of the replicants, occupies a space central to\nBlade Runner's narrative as well as this analysis. From the very outset of the film, in\nwhich we see an extreme long shot overlooking the futuristic cityscape of Los Angeles--\ndefined by massive techno-towers and near perpetual twilight, interrupted only by violent\nlightening strikes and fiery explosions resulting in stunning plumes of flame--the camera\nvisually guides us towards the grandiose Mayan-style pyramid structures that are the\nheadquarters of the Tyrell Corporation. The slow-moving journey over the cityscape is\nnever comfortable, and the ominous non-diegetic music makes matters all the more\ndisconcerting. Throughout the movement, there are several cuts to an extreme close up\nof an eye, in which we see the fireballs of this horrific worldspace vividly reflected in the\niris. The flames become the sensorial experience through which the eye relates to its\nphysical environment, and because the eye is never associated with a specific character, it\neasily becomes our eye. Experience becomes something which must be negotiated via a\nnon-natural, technologically overdetermined worldspace, whereby we are alienated by\nthe extreme lack of anything familiar. The characters in Frankenstein are able to\narticulate their experience through the spatial surround of Nature, whereas Blade Runner\nis completely devoid of Nature.\nLater in the film we return to the Tyrell Corporation, this time in the scene where\nJ.F. Sebastian, a Tyrell employed genetic designer, escorts Roy to meet his \"maker.\" Just\nas the Creature confronts his maker, Victor Frankenstein, to demand a companion, here\nRoy seeks to demand that Eldon extend his life; as a \"fail-safe\" measure replicants are\nprogrammed to live only four years. This scene is particularly illustrative of the\n\ndifferences between the worldspaces of Frankenstein and Blade Runner. The scene\nbegins with an extreme long shot to establish the location as the exterior of the massive,\nmountainous Tyrell Corporation (see Fig. 1). The mountain metaphor is purposeful, as\nthe gigantic pyramid-like structure we are confronted with draws a clear parallel with\nFigure 1: Blade Runner's Mont Blanc, the Tyrell Corporation (Ridley Scott, 1982; rev. 1992)\nMont Blanc, below which the Creature and Victor Frankenstein meet for the first time\nsince their initial post-creation encounters in Ingolstadt (Shelley, 92-93). A cut to a\ncloser though still distant exterior shot, relocates us from daytime to nighttime, and again\nwe hear foreboding non-diegetic music; the coupling of the darkness and the music\nmagnifies not only the suspense we feel with respect to the pending confrontation\nbetween Roy and Eldon, but also our alienation from the unfamiliar worldspace. In the\ncase of Frankenstein, we are alienated only by the abhorrent visage of the Creature, not\nthe surround itself. Returning to the scene, we find the camera tracking a transportation\nelevator moving upwards along the outside of the building towards the summit. Cutting\nto the interior of the elevator we see a close up of J.F. Sebastian, followed by a cut to a\nclose up of Roy. Although, the roles are somewhat reversed in Blade Runner--as it is\n\nRoy who is ascending to confront his creator, whereas in Frankenstein it is Victor who\nmakes his way up the mountain only to be confronted by the Creature--the similarities\nbetween the two are unavoidable.\nWhat is especially interesting here are the noticeable differences between the two\nmountains, that is, Mont Blanc and the Tyrell Corporation. In Frankenstein, Victor\nreaches the village of Chamounix and later wanders the valley below Mont Blanc, and\nstates that these \"sublime and magnificent scenes afforded me the greatest consolation\nthat I was capable of receiving.\" He elaborates further, saying: \"They congregated round\nme; the unstained snowy mountain-top, the glittering pinnacle, the pine woods, and\nragged bare ravine; the eagle soaring amidst the clouds--they all gathered round me, and\nbade me be at peace\" (Shelley, 91-92). Any such peace, articulated through Romantic\nlanguage evoking Nature is simply not possible in Blade Runner. Unlike Mont Blanc,\nand the valley below it, the Tyrell Corporation does not exhibit the illusive, indefinable\nbeauty of sublime Nature, but rather embodies a synthetic artificiality--it is a structure\nwhich is both mathematically and mechanically defined because it is, like almost\neverything else in Blade Runner, a manmade creation.\nThe transport elevator eventually comes to an abrupt stop, as Tyrell's inner\nsanctum is only accessible with permission. The camera cuts next not to Tyrell, but first\nto an owl, which we encountered earlier in the film when Rick Deckard (Harrison Ford),\nthe blade runner responsible for hunting down the fugitive replicants, and Rachael (Sean\nYoung), Tyrell's latest and most advanced Nexus 6 replicant, first met. Rachael had\nasked Deckard, \"Do you like our owl?\" to which Deckard quickly responded with his\nown question: \"Is it artificial?\" Rachael then states rather nonchalantly: \"Of course it is,\"\n\nimplying that Deckard should have known the answer to such a question--after all,\nalmost everything else Deckard comes across in the film, though appearing real at first,\nends up being artificial. (The final scene of the film suggests, rather unequivocally, that\nDeckard himself is a replicant.) By cutting to the artificial owl, rather than Eldon, we are\nreminded that the business of the Tyrell Corporation is \"commerce,\" and the replicants,\nincluding Roy, are equally entrenched within this commercial system. Everything in this\nworldspace is commodified, including biological life through genetic manipulation. The\nmountains and owls of Blade Runner, unlike Frankenstein's snowy mountain-top and\nsoaring eagle, are manmade objects, no longer understood as sublime and capable of\noffering conciliatory peace, but rather they have been transformed into commodified\nNature, produced through programmatic and manipulative scientific endeavor.\nAnother scene in Blade Runner which directly parallels Frankenstein are Roy's\nfinal moments before his death at the close of his violent confrontation with Deckard.\nThroughout the film, the replicants, especially Roy, employ poetic and philosophical\nlanguage to elicit our understanding of their plight. Earlier Roy references, with only\nminor changes, two lines from William Blake's America: A Prophecy, saying: \"Fiery the\nangels fell. Deep thunder rolled around their shores, burning with the fires of Orc.\"1 In\nsimilar fashion, Roy's partner Pris (Daryl Hannah) calls forth Rene Descartes, telling J.F.\nSebastian, \"I think, Sebastian; therefore, I am.\" In each instance well-known and\ncanonized poetry/philosophy is used to elicit our sympathy for the replicants and their\ncause to obtain longer life spans--Roy is comparing himself and the other replicants to\nangels after all, fallen to this fiery world. At the same time however, the language,\n1 The actual text from Blake reads: \"Fiery the Angels rose, & as they rose deep thunder roll'd / Around\ntheir shores; indignant burning with the fires of Orc\" (Martin, 108).\n\nparticularly in the case of the Blake, problematizes the sympathy we may feel for the\nreplicants in terms of how the language relates to the worldspace. Romantic language,\nsuch as Blake's, seems to have great difficulty grounding itself in the mechanized milieu\nof Blade Runner. Unlike Frankenstein's worldspace, which is full of rich metaphorical\nlanguage articulating lived experience through the spatial surround of Nature, here we\nfind ourselves in an environment which effectively resists notions of the irrational and\nspiritual.\nThis particular scene begins with an upward looking close up of Roy's face from\nDeckard's point of view; Deckard is hanging precariously from a steal beam after a less\nthan successful attempt to escape Roy by jumping from the roof of one building to\nanother. One of the key differences in the close up of Roy here is that he no longer\nappears \"perfect,\"2 as he did throughout much of the film. Prior to this moment, his\nvisual verisimilitude of humanness made it more difficult for the viewer to think of him\nas Other, where as in Frankenstein, the Creature is readily identifiable as outwardly\ndistinct from humans. Walton, upon seeing the Creature over the deceased Frankenstein,\nrelates: \"Never did I behold a vision so horrible as his face, of such loathsome yet\nappalling hideousness\" (Shelley, 186). The Creature's appearance is monstrous, Roy's is\nnot, at least until the film's denouement. Roy's face is now scarred, bloodied, and he is\nmissing most of his right ear. Despite his unflattering appearance, we still muster\nsympathy for him, as we become aware that he approaching the end of his four year\nlifespan. After he lifts Deckard to safety, the camera cuts from upward looking, to what\nat first appears to be an eye-level shot wherein Deckard, on the ground, occupies the\n2 At various points of the film, whether through Deckard, Tyrell, or J.F. Sebastian, Roy's \"perfect,\" or even\nangelic-like appearance is touched upon; here his physical appearace has changed rather dramatically.\n\nforeground, Roy occupies the mid-ground, and a large, bright neon sign advertising TDK\n(an actual electronics brand) takes up much of the background, thereby making it the\ndominant element of the shot. What is subtle, and may go unnoticed at first glance, is\nthat Roy's head is outside of the frame in this shot. In removing his face, and allowing us\nto only see his body, which carries no emotional information with it, we begin to\nunderstand the equivalency between the TDK brand of electronics and the Tyrell brand of\nNexus 6 replicants. We are compelled to reject this technological space where everything\nhas become commodity, including life.\nElsewhere in the film numerous signs of commerce dominate, including brands\nsuch as Coca-Cola, RCA, Pan Am and Atari, among others, implying that the dominance\nof the TDK sign in this scene is not accidental. The futuristic worldspace of Blade\nRunner, is defined by an electronic, technological commerce, displayed on highly\ninvasive, hovering and talking billboards. As Roy sits down, with his energy to sustain\nlife waning, we notice that in the next shot his head strikingly overlays the negative space\nsubtended by the outline of letter D of the sign (see Fig. 2). This visual equivalency\nFigure 2: Roy Batty, living being as sign of commerce (Ridley Scott, 1982; rev. 1992)\n\nbetween the literal sign and the replicant, condenses Roy into a similar sign\nrepresentational of this commerce. While we feel sympathy for the exploitation of the\nreplicants, we also identify them, and their world, as products of a manufacturing\nprocess, that is, distinct from a natural process. This is not to say that sympathy is\nunfounded, just that it may be a different kind of sympathy, or more precisely, pity.\nThese replicants, and the non-natural, and by extension, non-living worldspace they\ninhabit should never have been pursued as an endpoint in the first place. The\ntechnological commodification of virtually everything, living and non-living alike,\nvisually presented in Blade Runner's worldspace, is a hypothetical future worth avoiding\nat all costs.\nThe Frankenstein myth is again touched upon when Roy eloquently utters his\nfinal words. Despite similarities between the tremendous sense of loss felt by both the\nCreature and Roy--the Creature's maker has perished and his miseries of loneliness,\nisolation, as well as memories of his horrific deeds will haunt him for the rest of his days,\nand Roy, who is soon to reach the end of his brief preprogrammed days, finds himself\nunable to experience a long life, unenslaved and unhunted--our ability to relate to Roy's\nexperiences is complicated by the unfamiliarity of the world he resides within. He\nattempts to articulate his emotions through Romantic-like language which evokes his\nworldspace and his experiences within it, resounding: \"I've seen things you people\nwouldn't believe. Attack ships on fire off the shoulder of Orion. I watched c-beams\nglitter in the dark near the Tannhauser Gate. All those moments will be lost in time like\ntears in the rain. Time to die.\" Ironically, Deckard himself is a replicant, whereby any\nnotion of \"you people,\" that is, actual humans, seems largely irrelevant in a world where\n\nthe push seems to be towards a complete mechanization and commodification of life.\nRegardless of any compassion we have for Roy and his circumstances, we likewise find\nourselves compelled to reject the semantics of his elegiac speech because Romanticism is\nultimately incapable of making the transition to this brutal new future--Romanticism and\nNature are inseparable. The worldspace of Roy, Deckard, and others (whether human or\nnot), is not at all one of sublime Nature, like that through which even the Creature once\nfound peace, but a technological non-Nature defined by violent imagery of attack ships\non fire, c-beams and space gates. At the conclusion of Frankenstein, the Creature\nsimilarly articulates his experiences, but because his world is still defined by a living,\nbreathing Nature, and not artificiality, it becomes all the more poignant when he\njuxtaposes his pleasant memories with his feelings of misery and remorse. We\nunderstand what has been lost for the Creature. Gone is any hope of regaining that initial\nnatural paradise, wherein he \"felt the cheering warmth of summer, and the rustling of the\nleaves and the warbling of birds...\" (Shelley 186). Lost too is the company he once\nshared with the cottagers--Felix, Agatha, the old man and Safie--albeit at a distance,\nwhich he deeply loved and cherished. Finally, with the death of his father/creator Victor\nFrankenstein, any hope of companionship and love has similarly passed away. As for\nRoy, there was no paradise to lose, and thus we have trouble understanding his\nexperiences as anything more than a mirror which reflects the hostility of his worldspace.\nMuch more problematic here is what is lost for humanity as a whole through the\ndisappearance of Nature and the dominance of the artificial in Blade Runner's future.\nConcerns over humanness, humanity, or simply put, what it means to be human,\nhave been avoided in this analysis, as it is both an argument based in perceptions, as well\n\nas one which has been treated at length by various critics and scholars (McNamara, 1997;\nMartin, 2005). The central focus of this paper has instead been to look at interrelations\nbetween characters and their respective worldspaces, and moreover to consider how we\ncome to understand both the characters and the spaces they inhabit on the basis of these\nrelationships. By closely examining parallel moments in Frankenstein and Blade\nRunner, it becomes clear that the two worldspaces are drastically different from one\nanother, as are the ways in which characters are perceived within these spaces. Grounded\nin a realm where processes, whether biological or not, occur naturally, Frankenstein\noperates in conjunction with an irrational, spiritual and sublime Nature--the only non\nnatural processes of the novel occur in Victor's laboratory, and this of course is where\nShelley fronts her assault on unchecked science. Noticeably dissimilar is Blade Runner's\nworldspace, which is structured around a grossly expanded version of the God-like\nscientific hubris espoused first by Victor Frankenstein, and then taken to the extreme by\nEldon Tyrell. The visuals and articulation of experiences associated with the replicant\nRoy, show us a future given over to the scientific manipulation of everything, both living\nand non-living, so that it might be algorithmically understood, perfected, and ultimately\ncommodified. Unlike the physical surround of Mary Shelley's novel, which is based in\nRomantic conceptions of Nature, we cannot help but turn away in horror from Blade\nRunner's dystopian worldspace of branded artificiality.\n\nReferences\nBlade Runner: The Director's Cut (Warner Bros.; Ridley Scott, 1982; rev. 1992).\nScene 1: 01:20:09\nScene 2: 01:45:00\nClayton, Jay. \"Frankenstein's Futurity: Replicants and Robots,\" in The Cambridge\nCompanion to Mary Shelley. Esther Schor, ed. New York: Cambridge University\nPress, 2003.\nGravett, Sharon L. \"The Sacred and the Profane: Examining the Religious Subtext of\nRidley Scott's Blade Runner,\" in Literature/Film Quarterly. 1998, Volume: 26,\nIssue: 1, pg. 38-45.\nMartin, Michael. \"Meditations on Blade Runner,\" in Journal of Interdisciplinary Studies.\nSanta Monica. 2005, Volume: 17, Issue: 1/2, pg. 105-122.\nMcNamara, Kevin R. \"Blade Runner's Post-Individual Worldspace,\" in Contemporary\nLiterature. Madison. Fall 1997, Volume: 38, Issue: 3, pg. 422-446.\nShelley, Mary. Frankenstein. Johanna M. Smith, ed. Boston: Bedford/St. Martin's, 2000\n(1831)."
    }
  ]
}