{
  "course_name": "Making the Modern World: The Industrial Revolution in Global Perspective",
  "course_description": "This class is a global survey of the great transformation in history known as the “Industrial Revolution.” Topics include origins of mechanized production, the factory system, steam propulsion, electrification, mass communications, mass production and automation. Emphasis on the transfer of technology and its many adaptations around the world. Countries treated include Great Britain, France, Germany, the US, Sweden, Russia, Japan, China, and India. Includes brief reflection papers and a final paper.",
  "topics": [
    "Business",
    "Globalization",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Modern History",
    "World History",
    "Business",
    "Globalization",
    "Humanities",
    "History",
    "History of Science and Technology",
    "Modern History",
    "World History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLecture/Discussion: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course adopts a global perspective in surveying the great transformation in history known as the \"Industrial Revolution.\" Briefly defined, the Industrial Revolution represented a new way of organizing work and making things. The British commentator, Sir Thomas Carlyle, appropriately called it \"a mechanical age\" because the invention and use of self-acting machinery became one of its most striking characteristics. It was a time when hand tools and craft methods began to give way to water and steam-powered factories, canals, steamboats, and railroads. It also witnessed a \"communications revolution\" (led by high speed printing presses and telegraphy) that touched the lives not only of industrial workers but entire populations. This class seeks to place these themes in a broad global perspective by examining various outcroppings of industrialization in Great Britain, France, the United States, Germany, Scandinavia, Russia, Japan, China, India, and South America from the mid-18\nth\ncentury to the mid-20\nth\ncentury. Among other things, we will examine contrasting processes of invention and technological development, the role of the private entrepreneur as well as the state in these developments, and how the deployment of the new mechanical technologies of the Industrial Revolution impacted working people around the globe.\n\nTextbooks and Readings\n\nHorn, Jeff, Leonard N. Rosenband, and Merritt Roe Smith, eds.\nReconceptualizing the Industrial Revolution\n. Cambridge MA: MIT Press, 2010. ISBN: 9780262515627.\n\nWeber, Max.\nThe Protestant Ethic and the Spirit of Capitalism\n. Original German publication 1904; English translation by Talcott Parsons first published in 1930. New York, NY: Routledge, 2001. ISBN: 9780415254069. [Download a public domain copy in various formats from the\nInternet Archive\n]\n\nRostow, Walt W.\nThe Stages of Economic Growth\n. Original publication 1960. 3rd ed. New York, NY: Cambridge University Press, 1991. ISBN: 9780521409285. [Preview in\nGoogle Books\n]\n\nSelections from these books are supplemented by additional\nreadings\nfor many class sessions.\n\nWriting Assignments\n\nStudents will complete three types of writing assignments during the term.\n\nWeekly reflection papers on each week's readings\n\nA formal book review plus a brief in-class presentation of the review\n\nA longer final reflection paper\n\nSee the\nassignments\npage for more details.\n\nGrading\n\nThe quality of the writing assignments will determine one's final grade in the class.\n\nNo final examination will be given.\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nReading period (no class)\n\nThe cultural background of the Industrial revolution in Western Europe\n\nCultural background (cont.)\n\nThe Industrial Revolution as a concept\n\nReading period (no class)\n\nThe Industrial Revolution in Great Britain and the onset of the \"mechanical age\"\n\nContrasting interpretations of the British experience\n\nThe French experience\n\nReading period (no class)\n\nThe American experience\n\nThe American experience (cont.)\n\nThe German experience\n\nThe Scandinavian and Spanish experiences\n\nRussia's experience\n\nJapan's experience\n\n17-20\n\nReading period (no class)\n\nIndia's experience\n\nIndia's experience (cont.)\n\nChina's experience\n\nBrazil's experience; wrap up\n\nFinal reflection paper due\n\nBook review paper due",
  "files": []
}