{
  "course_name": "Making Books: The Renaissance and Today",
  "course_description": "This course explores the impact of new technology on the recording and distribution of words and images at three different times: The invention of the printing press ca. 1450; the adaptation of electricity to communication technology in the 19th century (telegraph, telephone, phonograph); and the emergence of digital media today. Assignments include essays and online projects. Students also participate in the design and construction of a hand-set printing press.\nThis course is also part of the Concourse program at MIT.",
  "topics": [
    "Humanities",
    "History",
    "European History",
    "History of Science and Technology",
    "Literature",
    "International Literature",
    "Humanities",
    "History",
    "European History",
    "History of Science and Technology",
    "Literature",
    "International Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nDescription\n\nWe will devote our time this term to three activities. First, we will study the history of the book in Europe from Gutenberg (ca. 1450) to the French Revolution (ca. 1800). Second, we will examine in detail books and prints in the collections of the MIT Libraries and the MIT Museum made from 1450 to 1800 in Europe. Third, we will build a functioning, durable printing press based on Early Modern European designs. The printing press will eventually reside in the\nBeaver Press Print Shop\n. These three activities are designed to provide a holistic view of print and its impact from roughly 1450 to 1800. Along the way, we will also pause periodically to consider the parallels between the world of print in the Early Modern period and the rapidly changing media landscape today. Was there a \"printing revolution\" in the Renaissance? Are we living through another media revolution today?\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nAttendance and active participation in all class meetings\n\n20%\n\nFour forum postings reflecting comparatively on books in the Early Modern period and today\n\n20%\n\nTwo five-page papers\n\nTopics may include the political, cultural, and economic effects of printing in the Early Modern world; detailed bibliographical and content analysis of holdings in MIT's\nRare Books Collection\n; reports on progress made towards building a printing press.\n\n30%\n\nClass project to design and build a handset printing press, with appropriate guidance from the Director of the MIT Hobby Shop\n\n30%\n\nRequired Readings\n\nDel Col, Andrea, ed.\nDomenico Scandella Known as Menocchio: His Trials Before the Inquisition (1583-1599)\n. Translated by John and Anne C. Tedeschi. Mrts, 1996. ISBN: 9780866981484.\n\nGinzburg, Carlo.\nThe Cheese and the Worms: The Cosmos of a Sixteenth-Century Miller\n. Translated by John and Anne C. Tedeschi. John Hopkins University Press, 2013. ISBN: 9781421409887. [Preview with\nGoogle Books\n]\n\nFor more on the history of print, you may wish to consult the\nHistory of Information\nweb site, or the following books:\n\nFebvre, Lucien, and Henri-Jean Martin.\nThe Coming of the Book: The Impact of Printing, 1450-1800\n. Translated by David Gerard. Seagull Books, 1976. ISBN: 9788170462668. [Preview with\nGoogle Books\n]\n\nPettegree, Andrew.\nThe Book in the Renaissance\n. Yale University Press, 2011. ISBN: 9780300178210.\n\nAll other readings can be found in the table in the\nReadings and Videos\nsection.\n\nPrinting Press Construction\n\nOur goal is to complete construction of our printing press by the end of Week 11, leaving us three weeks to learn how to be handset printers.",
  "files": [
    {
      "category": "Resource",
      "title": "21H.343J/CC.120J Making Books - First Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/f5c00f5c927586535a453a8c499831c2_MIT21H_343JS16_Paper1.pdf",
      "content": "21H.343J / CC.120J\nSpring 2016\nFirst Paper: Topics\nRequirements\n1) Write an essay in response to ONE of the topics below. Your paper must be 1250 words\n(around five pages) long, using 12-point font and one inch margins. All students should submit\nthe paper online on the class site, in pdf or word format, by Session 14.\n2) Your paper must be computer-processed. Please give your paper a title, and write your name on\nthe back of the last page. Do not write your name elsewhere on the paper. All pages should be\nnumbered. Refer to the editing handout or Strunk and White's The Elements of Style, posted on the\nclass web site, for further editing suggestions. You may also consult with tutors at the Writing\nCenter or with Professors Ravel or McCants about your paper.\n3) Citations to texts read in this course should be made in parentheses in your paper. For example,\nif you refer to a passage on page 13 of Pettegree's The Book in the Renaissance, indicate this in the\nfollowing manner at the end of your sentence, after the period: (Pettegree, 13). Full citations to any\nwork not assigned in class should be made in footnote or endnote form, but for this paper you do not\nneed to consult any outside readings.\nTopics\n1) \"The advent of movable type printing in Europe in the middle of the fifteenth century\ndemocratized communication. The printing press was the decisive factor for change in the\npolitical and religious hierarchies of the fifteenth and sixteenth centuries in Europe.\" Write\nan essay in which you agree or disagree with this statement. Draw broadly on our readings,\nclass discussions, and examinations of holdings in MIT's Rare Book Collection. Be sure to\ncite specific examples from our readings, discussions, and rare book examinations to bolster\nyour argument.\n2) The year is 1520. Imagine you are one of the following: the Pope, the Habsburg Holy\nRoman Emperor Charles V, the owner of a printing business specializing in religious\npublishing in the Holy Roman Empire, a Catholic theologian, a Protestant theologian, or a\nliterate peasant. Write a journal entry, a letter to a friend or associate, or in the case of the\nprinter a business plan in which you comment on the way that print has amplified the impact\nof contemporary Catholic and Protestant reform movements and impacted you. Be sure to\nrefer to specific ideas and events in your discussion.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "21H.343J/CC.120J Making Books - Second Paper Topics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/0b313df893a5f0d57df31a378c83d834_MIT21H_343JS16_Paper2.pdf",
      "content": "21H.343J / CC.120J\nSpring 2016\nSecond Paper: Topics\nRequirements\n1) Write an essay in response to ONE of the topics below. Your paper must be 1250 words\n(around five pages) long, using 12-point font and one inch margins. All students should submit\nthe paper online on the class site, in pdf or word format, by Session 26.\n2) Your paper must be computer-processed. Please give your paper a title, and write your name on\nthe back of the last page. Do not write your name elsewhere on the paper. All pages should be\nnumbered. Refer to the editing handout or Strunk and White's The Elements of Style, posted on the\nclass web site, for further editing suggestions. You may also consult with tutors at\n\nthe Writing\nCenter or with Professors Ravel or McCants about your paper.\n3) Citations to texts read in this course should be made in parentheses in your paper. For example,\nif you refer to a passage on page 13 of Pettegree's The Book in the Renaissance, indicate this in the\nfollowing manner at the end of your sentence, after the period: (Pettegree, 13). Full citations to any\nwork not assigned in class should be made in footnote or endnote form, but for this paper you do not\nneed to consult any outside readings.\nTopics\n1) What role did reading play in shaping the views that Menocchio expressed during his two trials\nbefore the Inquisition in 1584 and 1599? In your paper, analyze two or three of the positions he\ntook in these trials on theological matters and/or social hierarchy in Friulia. To what extent did his\nthinking on these questions derive from the list of books he read provided by Carlo Ginzburg in\nChapter 12 of The Cheese and the Worms?\n2) The year is 1600. Imagine that you are a male or female parishioner in Montereale, or have\notherwise known Domenico Scandella (Menocchio) for many years. You have just received the\nnews of Scandella's execution by the Inquisition for heresy. Write a journal entry, or a letter to a\nfriend, in which you reflect on the trial and execution. Are you in agreement with the verdict\nreached by the inquisitors? (Hint: you may want to adopt the persona of one of the people who\ntestified before the Inquisition in 1584 or 1599, as recorded in the trial documents. You may also\nmake up an imaginary contemporary of Menocchio, in which case you should explain who you are,\nand what you do in Montereale. Either way, your response should discuss specific views held by\nMenocchio, and specific interactions he may have had with your character.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21H.343J/CC.120J Making Books - Student Example 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/fab51a2280240d4177deec4ce2c11ffd_MIT21H_343JS16_Scandella.pdf",
      "content": "An Educated Man's Journal Entry Commenting on the Execution of Domenico Scandella\n\nJune, 1600\nMontereale, a small village in Friuli\n\nThese past two weeks, I have been in the town of Montereale, a small village\nbetween Venice and the Alps in the Friuli. I know it is a very strange place for me to\nhave visited, but just recently, one of the men of this village was executed as a relapsed\nheresiarch. While I was in Venice, I had heard that this man had been known for saying\nthe most fantastical, heretical things, so I endeavored to spend a small amount of time\nin this little village to learn more about the things he said. It took me most of these two\nweeks, but I finally realized that the man, Domenico Scandella was the same as a man\nMenocchio who I had seen occasionally in my bookshop over the past fifty years.\nMenocchio was always a strange man. He did once buy one of my cheapest\nbooks, but usually, when he visited every few years, he would examine my books\nwithout purchasing any. He was clearly a peasant, although he was certainly better off\nas a miller than he would have been as a farmer. It always surprised me that a poor\nmiller such as Menocchio might think to visit a bookshop during his short visits to\nVenice. He was also far more educated than I would normally expect for a peasant, so\nperhaps he felt that his limited education meant he ought to read whenever possible.\n\nHe certainly seemed to feel that even though his education was quite limited, it was\nsufficient to allow him to speak on many topics that even someone as educated as I am\nought not to speak about. Questions of the Church should only be answered by the\nChurch; believers are supposed to believe. To be honest, it always bothered me that a\npeasant such as Menocchio might dare to question the Church and might dare to think\nhimself capable to discuss difficult theological questions. He seemed to think himself to\nbe incredibly smart and insightful, but he was always entirely unaware of the events\nhappening to the north. He seemed to think the Lutherans would support his strange\nopinions without realizing how unusual his thoughts were or how problematic they\nwould be to the Church.\nI remember once, it must have been twenty years ago at least, Menocchio came\nto my bookshop and began to speak about how he had determined that Christ is only a\nman. I told him that such heresies were not welcome in my bookshop. He told me then\nthat if I had the Rosario della gloriosa Vergine Maria, he could show me proof. I did not\nhave that book and I did not think it would prove his point, even if I did have it. I regret\nthat I could not take that chance to help Menocchio recover from his heresies.\nRemembering this, I suppose I should not be entirely surprised that he was eventually\nconvicted of heresy. He ought to have known to stay in his place or at least to have\nknown not to speak to anyone about his strange beliefs.\nOnce I began to speak to the peasants in Montereale, I discovered that they were\n\nvery willing to speak with me about Domenico Scandella and his heresies. I began to\nunderstand that most of the peasants quite liked and respected him as he was one of\nthe few educated men in the village and was reasonably friendly, as any miller must be.\nOne peasant named Bartolomeo explained to me, \"except for the opinions that he has,\nhe is a respectable person\" (Del Col, 14). Even though most of the peasants liked and\nrespected Scandella, they all seemed to agree that he had always been a heretic, even\nafter his first trial, when he claimed to repent. A few of the peasants told me that they\nhad long feared that he would get the whole village into trouble with the Church or that\nhe might mention them in his trial. Since everyone in the village had heard about\nScandella's opinions at some point in time and no one had been able to stop him\nspeaking about his ideas, they feared that the Church might believe that they, too, were\nheretics.\nShortly after I arrived in Montereale, I spoke with Domenico Melchiori, a cobbler\nin the village. This Domenico told me that he had heard many of Scandella's heresies\ndirectly, while on journeys to other villages. He said that once, Scandella said to him\nthat Christ \"was born from St. Joseph and that he is merely a man like us\" (Del Col, 16).\nNot only, then, did Scandella not believe in the virginity of the Madonna, but he also did\nnot believe in the divinity of Christ. Even though the cobbler had tried to avoid\nconversations about Scandella's unusual beliefs, he was not able to stop Scandella from\nsharing his ideas. Furthermore, Domenico told me that Scandella \"believe[d] in neither\n\nprelates nor the Church\" (Del Col, 16). The idea of a peasant not respecting the\nauthority of the Church is incredibly shocking and disturbing. Of course the Church\nwould need to punish a peasant who did not respect its authority; otherwise, the other\npeasants might attempt to alter the order of nature.\nA few days later, I was speaking with Ser Giulio. Ser Giulio explained that\nScandella had claimed that \"to blaspheme is not a sin\" and further that his calling in life\nwas \"to blaspheme\" (Del Col, 12-13). Ser Giulio clearly despised Scandella's willingness\nto disrespect the Church. He even explained that while he had loved Scandella,\nScandella's discussion of religion had caused them to have a falling out. If Scandella had\nnot believed that he could blaspheme against the Church without censure, he would not\nhave spoken so much about his ideas. Perhaps then he would have been spared his\nmost tragic execution and even lived a better, more Catholic life.\nAnother peasant, Ser Giovanni Povoledo, shared that Scandella also believed in\nthe strangest, most fantastical story of creation of the world. He claimed that Scandella\nbelieved that the world began as nothing and from that nothing, it \"coagulated like a\ncheese\" (Del Col, 9). Then, \"a great number of worms,\" which were the angels, appeared\nin the cheese, but God was only \"the most powerful and wise\" one of these worms (Del\nCol, 9). Scandella was a peasant, yet he thought such a strange idea from his own mind\nmight describe the true state of the world. It does not surprise me that the Inquisitors\nfound Scandella's heresies to be far too unusual.\n\nAs I spoke to the villagers, I heard many other crazy ideas of his as well. Villagers\ntold me that Scandella believed that all men would be saved, whether they are Catholics,\nLutherans, or Turks. Such an idea must have allowed him to feel secure in his own\nwrong beliefs. Other villagers explained that he had always believed that the Church\nwas not a good authority. Since he believed that the Bible was designed by men, it was\na flawed source of authority. Furthermore, they told me that he claimed that a\nconfession made to trees or plants is as valuable as confession made to a priest. If this\nwere true, then there would be no reason to have the Church at all.\nI suppose it is unsurprising that Menocchio was executed. The Church has feared\nthat the Lutherans or other heretics might infect the minds of the Catholics and\nespecially the weak-minded peasants. Even though he was not a true Lutheran,\nMenocchio was far too powerful and respected within his community to not pose a risk\nto the minds of the villagers.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21H.343J/CC.120J Making Books - Student Example 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/15fe95958becf5143337cfb3e47d41a9_MIT21H_343JS16_Thinker.pdf",
      "content": "The Thinker\n\nMenocchio was a not-so-everyday miller with a few books and an impressive propensity\nfor critical thinking. Although he had a limited library, he did not accept his books' teachings\nblindly. He instead thought deeply about the ideas presented and developed his own. Three of\nMenocchio's ideas illustrated this well: he cast the scriptures as texts meant to deceive people, he\nbelieved all humans, no matter what religion, were imbued with God's Holy Spirit, and he\nthought the Church was not holy but instead a business out for profit.\nOn the witness stand, Menocchio boldly agreed that \"the Holy Scripture was devised to\ndeceive men.\" \"As for the things in the Gospels, I believe that some are true and some the\nevangelists made up out of their own heads,\" he said (Del Col, 44), pointing out the\ndiscrepancies in the Gospels' Passion narratives. This suggested to me that he read the Gospels\ncarefully enough to pick out contradictions in their testimonies, and perhaps went to the priest\nabout them but was unable to have them deciphered, so he just rejected the Gospels outright.\nThis sort of comparative reading is very similar to the type of reading historians do today,\npicking out the differences between the books and trying to identify a common body of truth.\nBecause of certain differences and similarities in the Gospels, many historians now think there is\nan unidentified common source that some (but not all) of the authors shared, and that other\nGospels were based on each other. But Menocchio did not have the training to pick out these\ncommon threads; his decision to throw out the Gospels was fairly reasonable.\nMenocchio was surprisingly egalitarian for his day. He believed that \"the majesty of God\nhas given the Holy Spirit to all, to Christians, to heretics, to Turks, and to Jews; and he considers\nthem all dear, and they are all saved in the same manner\" (Ginzberg, 9-10). In comparing\nChristians, Turks, and Jews, Menocchio admitted that \"every person considers his faith to be\n\nright, and we do not know which is the right one\" (Ginzberg, 49). It was certainly not a mindset\nheld by the Catholic Church, and I wondered how Menocchio had come up with that idea.\nMenocchio himself said he had gotten some ideas from Il cavalier Zuanne de\nMandavilla, which related the adventures of Mandeville. He noted, \"since out of many different\nkinds of nations, some believe in one way and some in another,\" the soul must die when the body\ndoes (Del Col, 33). I did not quite understand his argument--what pushed him to accept that idea\nabout the soul and the body if different nations conflicted over it? It was also surprising to see\nhim accepts all of these different cultures as being as legitimate as the orthodox Catholicism\nbeing taught by his parish priest.\nIl cavalier Zuanne de Mandavilla itself is a bit suspect: would a book purportedly written\nby a knight about his adventures actually know well the deep beliefs of other cultures? (It seems\nlike Mandeville provided a reasonable survey of the Orthodox, Samaritans, Jacobians, etc., but\nhe wasn't exactly a trained theologian.) And why did Menocchio believe the author?\nMandeville's travels were akin to Marco Polo's travels in the printing era. The book was very\npopular and introduced everyday millers and farmers to the exotic lands of India and Cathay\n(Ginzberg, 42). Evidently, people enjoyed the book, and at least Menocchio believed in its\ncontents, since he quoted it extensively while on trial. Many of the accounts, especially those of\nthe journey to the Orient, were more fantastical than real. Did people take this kind of writing at\nface value? Mandeville probably heard stories from others, at best, and then published them as a\ntrue-to-life account, so readers accepted the sense of authority and took the writing at face value.\n(There wasn't exactly fact checking in publishing back in the 1500s.) This situation reminds me\nof Ambroise Pare's Collected Works, which sought to catalogue all animals (including mythical\nones), and presented them as real creatures. It's possible that people were more likely to believe\n\nprinted accounts of unicorns because others had told them stories about unicorns before, but it\nalso seems like there was a lot of (possibly unfounded) trust in the veracity of printed material in\nMenocchio's time.\nMenocchio was exposed to many more peoples and cultures via books than he ever\nwould have as the Montereale town miller. If he had had only a copy of the scriptures and\nnothing else, I doubt that Menocchio would have questioned so much of his local priest's\nteachings. Instead, Mandeville's fantastical descriptions gave Menocchio's imagination a boost.\nMaybe Menocchio's ideas about the Holy Spirit led him to this conclusion about all\nhumans sharing God's forgiveness. He had an interesting idea about the spirit coming \"from\nGod, and is that thing that when we have to act on some matter, inspires us to do it or not to do\nit\" (Del Col, 33) versus the soul being something that died when the body died. He seemed to\nhave created the spirit as something separate from the body and based wholly on faith. Maybe\nthis idea of a separate spirit was what allowed him to apply it to different peoples, since in the\nend he saw us all as containers for the Holy Spirit. During his first trial, Menocchio said that \"as\nsoon as we are born, God sends us this angel\" (Del Col, 36), which is presumably the Holy Spirit\nthat he thinks all men are endowed with. This would explain why he believed all humans are\ncherished and saved by God. If a human received the Holy Spirit upon being born, what followed\nafterwards did not matter so much. After all, religion was an expression of a person's faith\nduring that person's lifetime.\nMenocchio did not attribute this idea to any particular book, but it did seem to fit closely\nwith his other philosophies regarding the Catholic Church. He denounced confirmation as\nunnecessary and believed that anybody who had studied a bit of scripture and could interpret it\ncould be a priest, no consecration or ordination needed (Del Col, 43). If people were already\n\nendowed with the Holy Spirit from birth, anybody could be a priest; the customs and rituals of\nthe Catholic Church were just manmade constructs. His animosity with his local priest probably\nhelped fuel his opinions on the Church. He did not seem to have gotten this dissatisfaction with\nthe Church from any of his readings, none of which directly criticized the Church (Ginzberg, 29).\nRather, he probably drew this conclusion after solidifying his ideas on the Holy Spirit.\nMenocchio does seem to have carefully read and cogitated on his books. He was able to\npull out very relevant examples from his reading from time-to-time, and did so with an\ninsistence, as he did when comparing the legend of the three rings to the viewpoints of\nChristians, Turks, and Jews (Ginzberg, 49-50). I thought it was an excellent analogy to the issue\nof which faith was correct, much better than some of the non sequiturs we encountered earlier in\nthe trial--for example, his brief excursion into Simon Magus and lawsuits (Del Col, 41). He was\nclearly doing some critical thinking and wanted to share it: he began his statement with \"I beg\nyou, sir, listen to me\" (Ginzberg, 49). I think he spent a lot of time with several books that did\nnot give him answers directly to the questions he was pursuing, and slowly developed his\n\"crazy\" ideas on his own. His books \"presented him with the facts,\" and he drew his own\nconclusions, attributing them to his own \"artful mind\" (Ginzberg, 28).\nHowever, as Ginzberg pointed out, Menocchio often distorted or mixed up the content\nfrom the books he had read (Ginzberg, 47). His inability to reliably cite sources is a problem:\nalthough he almost definitely read his small library several times through, he did not seem\nfamiliar enough with them to sort out the facts. Maybe he was reading several books\nsimultaneously--trying to draw together facts related to a particular issue, he might read one\nchunk of one book and one of another, moving back and forth. He did not seem to be very\nmeticulous about his sources and brashly attributed stories to sources that said nothing about\n\nthem, like that of Simon Magus (Del Col, 41). I think he had a practical outlook and cared more\nabout the content of the books rather than attributing them perfectly.\nMenocchio's opinions on the scriptures, the Holy Spirit, and the Church showed that\nalthough he was not reading overtly subversive texts, he read them carefully and came up with\nhis own ideas that countered the orthodoxy's teachings. He was not very precise about his\ncitations, but Menocchio was very interested in the ideas and concepts in his books and presented\nthem eagerly to his judges and interrogators. As Menocchio himself says, \"whatever ideas I had\ncame out of my own head\" (Del Col, 34). He was a miller who owned a few books and made a\nlot more out of them through the merit of his own reading, imagination, and intensive thinking.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "21H.343J/CC.120J Making Books - Student Example 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/b3aa3b4ca0e157de1f78d7c7c95e72a7_MIT21H_343JS16_Truth.pdf",
      "content": "Truth in Text\nVenice,\nJune 16, 1600\nDietrich,\n\nI pray this letter reaches you before you embark on your return trip to Venice. During my\ntime in the area, I have learned of certain developments that have a bearing on your activities in\nMainz. Concerned with the spread of heresy in recent years, the venerable fathers of the most\nsacred Church are becoming increasingly proactive in combating it. The Congregation for the\nDoctrine of the Faith is absolutely determined to root out the epidemic of false and unholy\nnotions that are spreading throughout Christendom. To that end, the list of books the Church\nconsiders unsuitable for the lay public has been growing as of late. I will attach to this letter the\nmost recent list of banned books I have been able to acquire. I trust that you will refer to it\njudiciously as you go about procuring more books for our trade and will exercise all due caution\nto ensure that our wares are appropriate for a decent reading public and will bring us no trouble.\nThe need for such care will be made plain once I recount to you some of the events that\nunderscored to me the danger of the present situation.\n\nYou may recall a miller in Montereale or some such place called Menocchio. We used to\ndo business with him whenever we were in Friuli and our paths happened to cross. He was held\nin high regard within his community, and we certainly never had any cause for complaint in our\nbusiness dealings with him. Menocchio was literate and always interested in getting his hands on\nmore books; his mind was active and inventive, so every book we provided him with planted\nseeds in his head which quickly grew into strange new ideas that erupted from his mouth with\n\nsome abandon. By now you will have remembered that, while fair in his dealings, Menocchio\nwas extremely opinionated and readily argumentative. Our dealings with him were brought to an\nabrupt halt some time ago when he was convicted by the Inquisition and put under house arrest.\nHowever, I had heard that Menocchio was able to reclaim his liberty and thought to try and\nreestablish our mutually beneficial relation. Upon seeking him out, I learned that his quick mind\nand quicker mouth had landed him in more, this time permanent, trouble. Menocchio found\nhimself before the Inquisition a second time; rather than send him home with his yellow crosses\nagain, this time the Inquisition sent him to a fiery death at the stake.\n\nIn light of Menocchio's fate, I urge you to keep the Church's teachings in mind when\nselecting printed materials to bring with you to Venice. I trust you to employ your judgment in\nthis matter. Think back to the discussions we once had with Menocchio. Recall how shocked we\nwere when we heard his incredible belief that the world was made from cheese and angels were\nonce worms. Avoid any books that contain such obvious blasphemy. Recall how our discussions\nwith Menocchio would often devolve into heated debate when he propounded upon his more\nprofane beliefs. Our faith could not countenance some of Menocchio's radical pronouncements;\nwe could not swallow the fruits of Menocchio's fecund mind. He denied the divinity of Christ.\nHe claimed that Jesus of Nazareth was a man and could not have been born of a virgin.\nAccording to Menocchio, it was because Jesus was a man and not the Son of God, consubstantial\nwith the Father, that he did not take himself down from the cross but died upon it.\nDecency and piety of course dictated that we correct such errors for the sake of\nMenocchio's immortal soul. In our many discussions, we did not just listen to him, but dutifully\nattempted to dissuade him of his erroneous opinions. Since we are not theologians, we could\npresent no argument sufficient to return him to the true faith. He even denied that his soul would\n\npersist after the death of his body. There was no way for us to persuade him to concern himself\nwith the eternity that awaited his soul since he did not think it was immortal. Ready as he always\nwas with a retort, Menocchio was not an easy man to argue with. What he read he remembered,\nand once he had acquired a Bible in the vernacular, against the express policy of the Church, he\ncould almost persuade those who listened to him that he spoke the Gospel truth as the priests do.\nYou and I can only speculate from whence he got such a book, but we certainly will not deal in\nsuch unwholesome wares. Despite the failure of our rhetoric, we never failed in faith. Although\nwe could never persuade Menocchio he was wrong, we always knew when he was wrong. Keep\nthat same pure faith when selecting books. Menocchio's case demonstrates the dangers of\nexposing the laity to the wrong texts.\nGiven this danger, it is fortunate that our learned Church fathers examined Menocchio\nand his ideas. Clearly, they are better equipped to combat heresy. The Inquisition could correct\nMenocchio's errors although we had been unable to. From the accounts I have heard, it seemed\nfor a time the Inquisition had succeeded. First, he was a model prisoner and was allowed to\nreturn to Montereale under certain conditions. Once back at Montereale, Menocchio was a\ntrusted member of the parish. It appeared for a time that the Holy Spirit, through the work of the\nChurch, had reentered Menocchio's soul and all was well. The Church had acted expediently and\nmercifully in its actions to preserve the Faith and bring Menocchio back into its flock. It is not an\neasy task, however, to persuade a man to abandon ideas which he has himself conceived, or\nthinks he has conceived. Ultimately, Menocchio proved as slow to change his opinions as he had\npreviously been quick to speak his mind. He clearly left the Church no choice but to respond as it\ndid. If only we had had the opportunity to provide him with more salubrious reading materials,\n\nthen maybe he would have persuaded himself of the Truth. Then he would have held to that as\nstubbornly as he did to his heresies.\nAlthough the higher church authorities were justified in eliminating heresy wherever they\nfound it and taking extreme measures whenever the heretic proved intractable, it is unsurprising\nthat someone would fall prey to such mistaken notions as Menocchio did. You will certainly\nrecall that womanizing priest who only ever concerned himself with others' activities and faith,\nnever with his own. It is egregious that such an unholy actor, however saintly a preacher, should\nbe entrusted with the souls of an entire parish. I have even heard it said that after Menocchio's\nfirst conviction, Father Odorico developed the custom of keeping a dagger underneath his cloak,\nclaiming it was a joke when clearly it was evidence of a disturbed conscience. With this\nhypocritical outsider forcing himself upon the parish, it is no surprise that his more immediate,\nimmoral example would better impress itself upon the minds of parishioners than the sacred\nexample set in the life and works of Christ. Much that we heard Menocchio utter in criticism of\nthe Church hierarchy was similar in many ways to what we have been hearing from all others\nwith whom we have conversed throughout our travels in Rudolf's empire. It seems Father\nOdorico was not the only priest with an inappropriate interest in women, and Menocchio was not\nthe only one who thought the Church more interested in business than in salvation.\nOur involvement in the present religious conversation taking place across Europe must be\nbeyond reproach. Nobody expected this Inquisition, but we will react to it accordingly. Our\nbusiness cannot afford to be associated with the spread of heresy and dissent. As faithful\nCatholics, we would never consider dealing in texts disapproved of by the Roman Church.\nAlthough we never purchased books there, it is now more important than ever that we avoid\nHamburg, Berlin, and especially Leipzig. The Church will have no cause for complaint with us\n\non account of our business in books; we desire nothing but that the many learn the Truth. I urge\nyou once again to select books with a diligent eye towards achieving our ends. Recall our friend\nMenocchio and consider the power books can have. With that in mind, remember: we must tread\ncarefully; we must tread responsibly. We must not run afoul of morality; we must not run afoul\nof the Inquisition.\n\nYours Faithfully,\nIppolito Ippocrito\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Bible In Print",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/542dd841f35e2fc2e8e4a9bd5345259d_MIT21H_343JS16_Bible.pdf",
      "content": "THE BIBLE IN PRINT,\n1453-1700\n21H.343J / CC.120J\nSPRING 2016\n\nIlluminated Page\nfrom Gutenberg\nBible, 1453\nThis image is in the public domain.\n\nErasmus, Novum Instrumentum, 1516 edition, first and last pages.\nThese images are in the public domain.\n\nComplutense Polyglot Bible, 1522\nThis image is in the public domain.\n\nLondon Polyglot Bible, 1657\nThis image is in the public domain.\n\nNicholas Visscher, Old and New Testament.\nAmsterdam, 1700. MIT Museum Copy.\nThese images are in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Book of Hours",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/9618163e7d9ac491a63b9c63e266b72c_MIT21H_343JS16_Book.pdf",
      "content": "Images from Book of Hours\nUse of Paris, ca. 1450\nMIT Rare Books\nand Special Collections\nThis image is in the public domain.\n21H.343J / CC.120J\nSpring 2016\n\nFirst page with text.\nThis image is in the public domain.\n\nFirst page listing saints days.\nThis image is in the public domain.\n\nText page.\nThis image is in the public domain.\n\nTransitional scribe page.\nThis image is in the public domain.\n\nAnnunciation?\nThis image is in the public domain.\n\nJesus, Mary, and Joseph\nin the manger.\nThis image is in the public domain.\n\nThe Three Magi\nThis image is in the public domain.\n\nCrucifixion of Christ\nThis image is in the public domain.\n\nThe Holy Spirit\nThis image is in the public domain.\n\nFinal Judgement\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Natural Philosophy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/4880a66e64435dd8050f3e882be4652f_MIT21H_343JS16_Philo.pdf",
      "content": "Natural Philosophy in the Sixteenth\nand Seventeenth Centuries:\nCelestial and Earthly Bodies\n21H.343J / CC.120J\nSpring 2016\n\nNatural & Moral\nPhilosophy, ca. 1680\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nLimbourg Brothers, Tres\nriches heures\ndu Duc de Berry, month\nof July.\nca. 1412-1416.\nThis image is in the public domain.\n\nBartolomeu Velho, Figura dos corpos celestes, 1568\nThis image is in the public domain.\n\nNicholas Copernicus, On The Revolutions of the Heavenly Spheres, 1543\n\"The book nobody read.\"\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nFrontispiece, 1666 Version of the Rudolphine Tables, MIT Special Collections\nThis image is in the public domain.\n\nThese images are in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nFrontispiece, Andreas Vesalius,\nDe humani corporis fabrica, 1543\nThis image is in the public domain.\nThis image is in the public domain.\n\nAndreas Vesalius, De humani corporis fabrica, 1543\nThis image is in the public domain.\nThis image is in the public domain.\n\nAndreas Vesalius,\nDe humani corporis fabrica,\nThis image is in the public domain.\n\nConrad Gessner, Iconoes Animalium, 1553\nThis image is in the public domain.\nThis image is in the public domain.\nThis image is in the public domain.\nThis image is in the public domain.\n\nA\n...and imagined\nAmbroise Pare, Oeuvres, 1580\nMIT Museum Copy\nThese images are in the public domain.\n\nA. Pare,\nAnimal\nMonstrosities\nThese images are in the public domain.\n\nA. Pare, Human Monstrosities\nThis image is in the public domain.\nThis image is in the public domain.\nThis image is in the public domain.\n\nEngravings from Ambroise Pare, Les Oeuvres (MIT Museum copy, 1580s)\nThis image is in the public domain.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Nuremberg I",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/15f88545fa7573c7acf1c7bffddf77c9_MIT21H_343JS16_NuremI.pdf",
      "content": "Images from The Nuremberg Chronicle, 1493,\nPart I.\nThis image is in the\npublic domain.\nThis image is in the\npublic domain.\n21H.343J / CC.120J\nSpring 2016\n\nThe Seven Ages of the World, as presented in the Nuremberg Chronicle:\n\nFirst age: from creation to the Deluge\nSecond age: up to the birth of Abraham\nThird age: up to King David\nFourth age: up to the Babylonian captivity\nFifth age: up to the birth of Jesus Christ\nSixth age: up to the present time (the largest part)\nSeventh age: outlook on the end of the world and the Last Judgement\n\n\"Title page\", with inscriptions\nfrom previous owners\nThis image is in the public domain.\n\nFirst page of table of contents\nThis image is in the public domain.\n\nIntroductory page\nwith missing rubrication\nThis image is in the public domain.\n\nOne of two colored illustrations\nin the MIT copy.\nThis image is in the public domain.\n\n\"In the beginning, God\ncreated the heavens\nand the earth.\"\nThis image is in the public domain.\n\n\"On the seventh day, God rested.\"\nThis image is in the public domain.\n\nNotations on a page discussing\ncosmology and history. Note the\n\"nota bene\"annotation in the middle\nMargin, and the pointing finger\nbelow it. The notations in the right\nmargin count the ages of the world.\nThis image is in the public domain.\n\nGod creates Eve from Adam's rib\nin the first age of the world.\nThis image is in the public domain.\n\nAdam and his progeny,\nfirst age of the world.\nThis image is in the public domain.\n\nNoah's Ark, and\nthe Rainbow Covenant.\nSecond age of the world.\nThis image is in the public domain.\n\nHumans and monsters,\nSecond age of the world.\nThis image is in the public domain.\n\nWorld map, 1493.\nThis image is in the public domain.\n\nAges of man, beginning with Noah. Second age of the World.\nThis image is in the public domain.\n\nJerusalem.\nSecond Age of the World.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Nuremberg II",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/341d27c0e389fd266ddeec24adcbd354_MIT21H_343JS16_NuremII.pdf",
      "content": "Images from The Nuremberg Chronicle, 1493,\nPart II.\nThis image is in the\npublic domain.\nThis image is in the\npublic domain.\n21H.343J / CC.120J\nSpring 2016\n\nTroy & kings of the Trojan War.\nThird Age of the World.\nThis image is in the public domain.\n\nBabylonian kings\n& the fall of Babylon.\nFifth Age of the World.\nThis image is in the public domain.\n\nJohn baptising Christ,\nlower left corner.\nBeginning of the\nSixth Age of the World\nThis image is in the public domain.\n\nRome\nThis image is in the public domain.\n\nConstantinople\nThis image is in the public domain.\n\nNuremberg\nThis image is in the public domain.\n\nColored image of Nuremberg from The Nuremberg Chronicle, Wikipedia Commons.\n\nThis image is in the public domain.\nSource: Wikimedia Commons.\n\nWoodblock image repetition\nThese images are in the public domain.\n\nBurning of heretics, 1300s.\nThis image is in the public domain.\n\nIllustration of so-called Jewish \"blood libel.\"\nThis image is in the public domain.\n\nApocalypse.\nSeventh Age of the World\nThis image is in the public domain.\n\nDance of Death. Seventh Age of the World.\nThis image is in the public domain.\n\nFinal Judgement.\nThis image is in the public domain.\n\nPope and Holy Roman Emperor meet.\nThis image is in the public domain.\n\nMap of Europe, ca. 1493\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Paper Making",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/d474feda01066bb6300f0c1e560b69b5_MIT21H_343JS16_Paper.pdf",
      "content": "Paper-Making in Eighteenth-Century\nFrance and Twenty-First Century Nepal\n21H.343J / CC.120J\nSpring 2016\nThis image is in the public domain.\nImage courtesy of Cyril Gros on flickr. License CC BY-NC-SA.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nThis image is in the public domain.\n\nImage courtesy of Kasia Trapszo on flickr. License CC BY-NC-SA.\n\nImage courtesy of Nikolai Sindorf on flickr. License CC BY-NC-SA.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Printing Presses",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/d3cb0413e1514d610a5780a1d4df9281_MIT21H_343JS16_Print.pdf",
      "content": "21H.343J / CC.120J, Spring 2016\nPre-1800 Books, Paper,\nand Printing Presses\nThis image is in the public domain.\n\nWriting Media\nCuneiform Tablet\nAnatolia, ca. 1875-1840 BC\nLA County Museum\nKhipu, Inkan Date Recording System\nin use before 1500.\nImage courtesy of Ashley Van Haeften on flickr. License CC BY.\nImage courtesy of Jack Zalium on flickr. License CC BY-NC.\n\nChronique du monde\ndepuis la creation.\n\n1461 French Manuscript\nin scroll format.\n\nUp to the present\n(i.e., 1461)\n\nThis image is in the public domain.\n\nChronique du monde depuis\nla creation. 1461 French Manuscript\nin scroll format.\"Creation of the world.\"\nC'est la bible hystoriale en francais\n1373 French manuscript in codex format\nf. 3v, \"God measuring the world\"\n\nThis image is in the public domain.\nThis image is in the public domain.\n\nPaper - not what it used to\nbe\nFrom fiber (linen/hemp and\neventually cotton) to wood\n\nWeight loss in flax processing\nplant to paper\nCondition of the Material\nKilograms\nRaw picked flax\n100.00\nDry flax\n25.00\nRippled flax\n17.50\nRetted flax\n4.40\nCombed flax\n4.18\nSpun thread\n3.55\nLinen cloth\n2.84\nWhite linen\n2.41\nPapermaking\n1.69\n\nKey dates of the British Industrial\nRevolution\n- 1733 - Flying shuttle\n1764 - Spinning jenny\n1769 - Steam engine\n1784 - Spinning mule\n1785 - Power loom\n1793 - Cotton gin\n- 1780-85 doubling of cotton imports\n- 1785-89 tripling of cotton imports\n\nRettery - for fermentation of\nrags\nFrom the Encyclopedie of Diderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nCutting rags & removing buttons\n\nFrom the Encyclopedie of Diderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nPaper stampers\nFrom the Encyclopedie of Diderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nMould,\ndeckle, and\nmould\nsurface\nFrom the Encyclopedie of\nDiderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nDrying Loft\nFrom the Encyclopedie of Diderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nSetting type in an eighteenth-century print shop.\nFrom the Encyclopedie of Diderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nPressmen in action in an eighteenth-century print shop.\nFrom the Encyclopedie of Diderot and d'Alembert, ca. 1760\nThis image is in the public domain.\n\nThe Thomas Printing Press\nAmerican Antiquarian Society, Worcester MA\n\nThe Thomas Printing\nPress, Detail\n\nThe Thomas Printing Press, Detail\n\nThe Thomas Printing Press, Details\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Reformation Images",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/9ee1c08650f8af398a71c827a0e08b19_MIT21H_343JS16_Ref.pdf",
      "content": "REFORMATION IMAGES\n21H.343J / CC.120J\nSpring 2016\n\nHans Holbein the Younger,\nErasmus, 1523\nAlbrecht Durer, Erasmus, 1526\nThis image is in the public domain.\nThis image is in the public domain.\n\nErasmus, Novum Instrumentum, 1516 edition, first and last pages.\nThese images are in the public domain.\n\nComplutense Polyglot Bible, 1522\nThis image is in the public domain.\n\nRaphael, Pope Julius II, 1511-12\nRaphael, Pope Julius II, 1511-12\nJulius Exclusis, 1513 engraving\nThis image is in the public domain.\nThis image is in the public domain.\n\nThe sale of indulgences\nThis image is in the public domain.\n\nSatire on the\nsale of indulgences\nThis image is in the public domain.\n\nPassions of the Christ\nand Anti-Christ\nThese images are in the public domain.\n\nReversible\ncardinal/fool\nThis image is in the public domain.\nThis image is in the public domain.\n\nThe Papacy and Luther as seven-headed\nmonsters, From the Book of Revelations.\nThis image is in the public domain.\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "21H.343J/CC.120J Making Books - Lecture Slides: Renaissance Religion",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21h-343j-making-books-the-renaissance-and-today-spring-2016/4729c351184eef0fd6f174fa1884d9a0_MIT21H_343JS16_Carto.pdf",
      "content": "Renaissance Religion and Cartography:\nExploring The Role of Print\n21H.343J / CC.120J\nSpring 2016\n\nErasmus, Novum Instrumentum, 1516 edition, first and last pages.\nThe Role of Print in an Age of Religious Reformation\nThese images are in the public domain.\n\nLondon Polyglot Bible, 1657\nThis image is in the public domain.\n\n1507 Paris Edition of\nthe Decrees of Pope Gregory\nThis image is in the public domain.\nThis image is in the public domain.\n\nThomas Coverdale's\nBook of Martyrs (1564 )\nThis image is in the public domain.\n\n1572 German Book of Sermons\n(Roman Catholic)\nThis image is in the public domain.\nThis image is in the public domain.\n\n1693 Lutheran Bible\nThe Old Testament\nThe New Testament\nThis image is in the public domain.\nThis image is in the public domain.\n\n1700 Visscher\nAmsterdam Bible\nThis image is in the public domain.\nThis image is in the public domain.\n\nAmsterdam, The Names of the Winds in Six Languages, 1698\nThis image is in the public domain.\n\nJan Vermeer,\nThe Geographer,\nConceptualizing\nSpace\nThrough\nPrint\nThis image is in the public domain.\n\nNavigational Map of Harwich, Woodbridge, and Handfordwater, 1684\nThis image is in the public domain.\n\nHeinrich Bunting, Itinerarium Sacrae Scripturae 1581\nThese images are in the public domain.\n\nJ. Jansson, 1660, Amsterdam. Map of Ancient World, with seventeenth-century projection\nThis image is in the public domain.\n\nW. Blaeu, New World Map, ca. 1630\nThis image is in the public domain.\n\nDetail, Blaeu,\nNew World Map,\nca. 1630\nThis image is in the public domain.\n\nDetail, Blaeu,\nNew World Map,\nca. 1630\nThis image is in the public domain.\n\nW. Blaeu, Europe, ca. 1640\nThis image is in the public domain.\n\nDetail, W. Blaeu, Europe, ca. 1640\nThis image is in the public domain.\n\nEnglish, The Kingdome of China, 1626\nThis image is in the public domain.\n\nDetail, English,\nThe Kingdome of\nChina, 1626\nThis image is in the public domain.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21H.343J / CC.120J Making Books: The Renaissance and Today\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}