{
  "course_name": "Management Communication for Undergraduates",
  "course_description": "The goal of this course is to help students learn to communicate strategically within a professional setting. Students are asked to analyze their intended audience, the purpose of their communication, and the context in which they are operating before developing the message. The course focuses specifically on improving students’ ability to write, speak, work in a team, and communicate across cultures in their roles as future managers.",
  "topics": [
    "Business",
    "Leadership",
    "Management",
    "Business",
    "Leadership",
    "Management"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nManagement Communication is intended to help you think strategically about communication and aid you in improving your writing, presentation, and interpersonal communication skills as a future manager. We will look at a set of \"best practices\" or guidelines that have been derived from both research and experience, give you the opportunity to put those guidelines into practice, and provide you with feedback on your work to help you strengthen your abilities. More often than not, we will be using a workshop format that will rely heavily on discussion and in-class exercises.\n\nObjectives\n\nGood communication is one of the keys to a successful career no matter what field you choose, and many different skills contribute to a professional's capacity to communicate well. By the time you complete this course, you should be able to:\n\nFormulate an effective communication strategy for any message, in any medium, and in any situation\n\nWrite clearly, concisely, and convincingly\n\nCreate impressive presentations that are delivered with confidence and poise\n\nGive and receive feedback that will improve yours and others' communication\n\nListen for understanding\n\nWork effectively with others in small groups or teams\n\nIdentify and negotiate the difference in communication between yourself and people who are not from your culture\n\nImproving communication is a continuous process of learning, doing, critiquing, evaluating, and doing again. It is a process that we hope will continue for you even after you complete this course.\n\nExpectations\n\nBecause so much of the class will be \"hands-on\" and because feedback (ours, the TAs, and the feedback you give each other) is so important to improving writing and speaking, our expectations about our work together this semester are:\n\nYou are committed to improving your professional effectiveness as a communicator.\n\nYou are willing to share your opinions and ideas on topics presented in class.\n\nYou will provide each other with clear, honest, concrete, and sensitive feedback on work that is done.\n\nAny concept that is unclear or confusing will be challenged and examined.\n\nThere are no stupid questions or comments.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nBaseline Self-Evaluation Memo\n\n5%\n\nPresentation with Q&A\n\n10%\n\nProblem Sets 1-5\n\n10%\n\nMeeting Maker Case Memo\n\n10%\n\nCover Letter\n\n5%\n\nInteractive Presentation\n\n10%\n\nTeam Report\n\n20%\n\nTeam Report Presentation\n\n15%\n\nFinal Self-Evaluation Memo\n\n5%\n\nIn-Class Exercises and Class Participation\n\n10%",
  "files": [
    {
      "category": "Resource",
      "title": "Baseline Self-Evaluation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/fb76e47c875d0c31d4da7942f06c577e_MIT15_279F12_eval_baseline.pdf",
      "content": "Baseline Self-Evaluation Memo\n\nWe would like for all of us (you, your instructor, and your TA) to have a sense of your\ncommunication strengths and weaknesses as we begin the semester. We would also like to know\nthe goals you would like to accomplish in this class. This assignment will help you benchmark\nyour communication skills in order to help us assess your progress throughout the course. It will\nallow you to measure how well you are moving towards your objectives, so that you can gauge\nhow much effort you must devote to strengthening those skills you have identified as needing\nimprovement.\n\nIn answering the following five questions, provide enough examples and specific details (e.g.,\nkinds of communication, audiences addressed, purpose of the message) to give your instructor\nand TA a clear picture of you as a communicator. To the extent that you have had experience in a\n\"professional\" setting (e.g., a club, a job, an internship, volunteer work), focus on those\nexperiences. In evaluating your strengths and weaknesses, consider feedback from others\n(professors, employers, club advisors, fellow students) as well as your own opinion of your\nproficiency.\n\nFinally, in setting goals for yourself, state what writing, speaking, and interpersonal\ncommunication skills you specifically want to improve. The more specific you can be, the better\nyour chance of reaching your objectives.\n\nAnswer these five questions:\n\n1. What are your strengths and weaknesses as a writer? What part(s) of the writing process do\nyou find easy? What part(s) do you find difficult?\n\n2. What are your strengths and weaknesses as a speaker? What part(s) of creating and giving\npresentations do you find easy? What part(s) do you find difficult?\n\n3. What are your strengths and weaknesses as a member of a team or a group? What part(s) of\nteamwork do you find easy? What part(s) do you find difficult?\n\n4. What are your three or four specific goals for improving your communication in 15.279 this\nsemester?\n\n5. How do you intend to reach those goals? How can your instructor and TA best help your\nmeet your goals?\n\nCRITERIA\nContent: Is there enough detail (including examples and illustrations) to\nFOR GRADING\ngive readers a complete picture of you as a professional communicator?\nHave you included feedback from others as part of your analysis? Are your\ngoals specific, clear, and attainable?\n\nStyle: Are paragraphs coherent and sentences concise?\n\nMechanics: Is the memo free from spelling, punctuation, and grammatical\nmistakes?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Cover Letter",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/55ba8500eea91a15dc41d65ae8c1ca2f_MIT15_279F12_cover_letter.pdf",
      "content": "Cover Letter\n\nFind an advertisement online for a position in which you have some interest. (As a last resort,\nyou may write your own ad if you can't find an appropriate one, but it must be realistic.) Write a\ncover letter applying for that position. Be sure that your assertions about yourself are true, are\nbacked up by adequate concrete evidence, and are clearly linked to attributes required for the job.\nSince correct spelling, punctuation, and grammar are crucial to projecting a credible image of\nyourself, pay special attention to those aspects of the letter. Non-native English speakers are\nparticularly encouraged to get help if they need it. (There will be a peer editing session for the\ncover letters.)\n\nNOTE: Please submit the ad with the final draft of the cover letter. If you have a resume, give us\nthat as well--it will help us judge if you have overlooked anything that might be a good selling\npoint.\n\nCRITERIA\nStrategy: Is the letter appropriate for the job described?\nFOR GRADING\n\nContent: Does the introduction provide an overview of the contents of\nthe letter? Have you provided concrete evidence to back up claims you\nmake? Have you stressed what you can do for the company rather than\nwhat the company can do for you? Does your last paragraph outline \"next\nsteps\" as appropriate?\n\nStyle and tone: Are the paragraphs coherent and the sentences concise?\nIs the tone appropriate--confident, polite, businesslike?\n\nMechanics: Is the letter free from spelling, punctuation, and grammatical\nmistakes?\n\nFormat and design: Have you used the correct business letter format?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Final Self-Evaluation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/6dd0fd0dc606c575b4e0578a08550bf2_MIT15_279F12_eval_final.pdf",
      "content": "Final Self-Evaluation Memo\n\nWrite a one- to two-page memo describing and evaluating the progress you have made in your\nwriting, presentation, and teamwork skills in 15.279 during the semester. In preparation for\nwriting the memo, review your baseline self-assessment, your other written assignments, and the\nrecordings of your presentations.\n\nYour memo should provide a balanced and concrete evaluation that includes (but is not\nnecessarily limited to) the following:\n\n- Your improvements over the semester\n\n- Your current strengths and weaknesses\n\n- Some ways in which you can continue to improve your communication skills\n\nSupport your observations with specific details and examples.\n\nCRITERIA\nStrategy: Have you organized the memo according to the readers'\ninterests and needs?\n\nContent: Does the introduction provide an overview for the rest of the\nmemo? Is there enough evidence drawn from your experiences in 15.279\nto justify the comments you have made? Have you included feedback from\nothers as part of your analysis? Does the conclusion wrap up the memo?\n\nStyle: Are paragraphs coherent and sentences concise?\n\nMechanics: Is the memo free from spelling, punctuation, and grammatical\nmistakes?\n\nFormat and design: Have you used the correct format? Do formatting\ndevices make the memo easy for the audience to read?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Interactive Presentation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/55e6e64884cca4222dcc767bba0d9140_MIT15_279F12_pres_intrctve.pdf",
      "content": "Interactive Presentation\n\nGive a 7- to 8-minute interactive talk with visual aids to a managerial audience. You must not\nonly allow but encourage questions during the presentation (but within the 7- to 8-minute total\nlength). NOTE: You are responsible controlling the pace of the presentation so that you can\nmanage to cover key points. Interruptions take more time than you expect, so plan accordingly.\n\nChoose a specific business audience and context requiring you to persuade someone to do\nsomething. You may base the presentation on material in one of your other courses, on a paper or\nresearch project you have done, or on your own experience. (Some examples are given below.)\nBecause you will want other students in your lab session to ask appropriate questions, choose a\ntopic they are likely to be familiar with or can understand easily. If you have any doubts about\nyour topic, discuss it with your instructor or TA before you develop the talk.\n\nAt the time of your presentation, give your instructor or TA in writing a brief description of your\nsituation (including the subject, the audience, the context, and your credibility). Also, bring a\npaper copy of your slides. They can be in handout mode (no more than 6 slides/page, please) and\ndo not have to be in color.\n\nYou will also describe the audience and context orally before you begin your presentation.\n\nSample Topics\n\nHere are some sample topics to give you ideas:\n\n- Your company wants to expand internationally and is debating between entering one\nof two countries. Argue for one country or the other.\n- You have been asked to do recruiting for your company. Create a presentation that\nyou could bring to a business school to entice seniors to interview with you.\n- Management is debating dropping one of the product lines your company\nmanufactures. Argue for or against this strategy.\n- Management is debating merging with another company. You have researched the\ncompany that is the target of the potential merger. Describe that organization's\n\"company culture,\" and why it is or is not compatible with your own.\n- There is a position open in your division. There are two candidates for the position.\nMake an argument for one of them.\n\nRevision of This Presentation\n\nRevision of this presentation is optional. If you do chose to revise, the grade you receive on your\nrevision will be averaged with your original grade to determine your final grade.\n\nCRITERIA\nStrategy: Was your strategy appropriate for the goals, the audience, and\nFOR GRADING\nthe context as you've defined them? Did you achieve the goals you set out\nfor this presentation?\n\nStructure: Was your structure (relatively direct/relatively indirect)\nappropriate? Was the presentation organized in a manner that the audience\ncould easily follow? Did you use transitions effectively to move from point to\npoint and to move from questions back to your talk?\n\nContent: Have you provided enough detail for the audience to understand\nyour main points? Did your introduction generate audience interest and\npreview the presentation? Did your conclusion wrap up the talk?\n\nDelivery: Was your delivery relatively smooth? Did you demonstrate\nenthusiasm and an interest in the audience's needs? Did you use gestures\nin a way that was comfortable for you and not distracting to the audience?\nDid you make eye contact with all members of the audience?\n\nVisual Aids: Did your visual aids enhance your presentation? Did they\nfollow the principles of good design? Did you use the visuals effectively?\n\nQ&A: Did you invite questions at the beginning of your talk? Were you\nable to handle interruptions, questions, and comments professionally? Did\nthe content of your answers satisfy the audience? Did you keep your\npresentation on track?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Meeting Maker Case",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/15cb80f219c90efa86f32e852d9fdd2e_MIT15_279F12_case_mtg_makr.pdf",
      "content": "Meeting Maker Makes News\n\nBackground\n\nYou are one of six senior analysts in the Research and Economic Analysis Unit at the New York\nheadquarters of Sloan Corporation, a large, diversified financial services company. You report to\nChris Dowd, vice president of the unit, which also includes twenty analysts and a support staff of\nnine.\n\nAs a staff department, Research and Economic Analysis provides routine forecasts and analyses\nto various departments of Sloan Corporation, as well as to the company's six regional offices. Its\nproducts range from a weekly economic forecast, issued after a forecast meeting that occurs\nevery Monday morning, to analyses of a specific company involved in merger and acquisition\nactivities, produced at the request of the Corporate Finance Department.\n\nYou have just come from a meeting of the company-wide Technology Committee, where you\nlearned that in two weeks a new policy will be put into effect requiring all employees below the\nlevel of VP to use Meeting Maker to keep their calendars. (VPs and senior management may\nchoose to use Meeting Maker or not depending on their own preferences.) While Meeting Maker\nhas been available in the suite of software the company gives each employee, it has not been\nmandatory to use it or any other scheduling software. This, then, is a shift in policy.\n\nInformation about Meeting Maker\n\nMeeting Maker, according to its developers, is a \"group scheduling tool.\" It allows users to keep\ntheir calendars in an electronic format, and it makes accessible the times they are and aren't\navailable to other Meeting Maker users who are networked together. This second feature is\nespecially helpful in scheduling meetings without having to exchange endless e-mails or phone\nmessages. In addition to these functions, Meeting Maker allows users to put items from a \"to do\"\nlist on their calendars, lets people have access to one another's calendars, and permits them to\nassemble lists of contacts. Users have the option of viewing one through fourteen days of their\ncalendars on one screen or seeing an entire month at once. Colored labels can be applied to\nhighlight important meetings, deadlines, regularly scheduled events, etc. The calendar navigator\nfunction permits viewers to go to any day of the year to see what is scheduled for that day.\n\nMeetings can be arranged as follows: From the file menu, select \"Propose Meeting\" (Ctrl +M). A\nscreen will appear with boxes labeled: \"Proposal,\" \"Title,\" \"Location,\" \"Guest,\" \"Schedule,\"\n\"Agenda,\" \"Options.\" First, enter the title of the meeting and its location. Then identify who is to\nbe invited by selecting the \"Guest\" box. The list of all people who are on Meeting Maker\nappears. Chose those people who are either \"required\" to be at the meeting or are \"optional.\" A\ndate and time for the meeting can be identified under \"Schedule.\" An \"Auto-pick\" option (also\nunder \"Schedule\") asks the program to canvass the calendars of each person invited to the\nmeeting in order to find the first day and time everyone is available. \"Agenda,\" as its name\nimplies, allows the person calling the meeting to list the topics to be covered. \"Options\" permits\nusers to ask Meeting Maker to remind them when the meeting is to take place, as well as to\ndecide whether this meeting is to be \"private\" (i.e., other people will know a particular time slot\nis taken, but they will not know what activity is taking place during that time); \"publishable\"; or\n\"flexible\" (i.e., the time slot is taken, but it could potentially be used for another meeting).\n\nPeople who use Meeting Maker can designate anyone else as their \"proxy,\" that is, someone who\nhas access to their calendars. According to the Meeting Maker help page (by the way, Tech\nSupport tells you that Meeting Maker help pages are very easy to understand), \"Proxies can keep\ntrack of meetings and activities, and can print your calendar for you.\" Proxies can be designated\nas \"Read/Write\" or \"Read Only.\" \"Read/Write\" proxies can change the user's calendar; \"Read\nOnly\" proxies can only view the calendar. It is possible to label certain activities and to-do items\nas private to keep proxies from viewing them. Select proxies by going to the \"Edit\" menu and\nchoosing \"Proxy List.\"\n\nThe Technology Committee has asked the IT department to offer a set of one-hour tutorials to\nhelp staff learn to use Meeting Maker.\n\nYour Task\n\nYou need to write two memos about this impending change.\n\nThe first is to Chris Dowd. While not a technophobe, Dowd tends not to like to take the time to\nlearn how to use new technology (either hardware or software). And since she has an\nadministrative assistant who keeps her calendar, it is not likely she will use Meeting Maker\nherself except perhaps to check her calendar. You also know that Dowd likes to have information\ndistilled down for her--she doesn't like to have to wade through the details of every project. By\nnow you know the best strategy for dealing with her is to get to the point, and you try to keep all\nmemos to her to less than a page.\n\nThe second memo is to your peers and subordinates in the Research and Economic Analyses\nUnit. You can imagine that some of them may already be using Meeting Maker, some of them\nwill be glad to adopt it, and some of them may be resentful that they are being forced to move\nfrom a paper-based calendar to an electronic one. Therefore, this memo has to be both\npersuasive, stressing the advantages of the software, and informative, explaining at least the\nrudiments of how to use it.\n\nAdapted 2002 by Lori Breslow.\nThis case is based on \"Prof(it)s\"\n(c) 1988, 1992 JoAnne Yates\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Presentation with Q&A",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/418c58809c6a256aecdca3e5d3a6cb9f_MIT15_279F12_pres_qa.pdf",
      "content": "Presentation with Q&A\n\nGive a five-minute presentation on a business subject to a specific business audience with a need\nfor that information. You may base the presentation on material in one of your other courses, on\na paper or research project you have done, or on your own experience. (Some examples are given\nbelow.) After the presentation, be ready to answer questions from the audience.\n\nAt the time of your presentation, give your instructor or TA in writing a brief description of your\nsituation (including the subject, the audience, the context, and your credibility). Also, bring a\npaper copy of your slides. They can be in handout mode (no more than 6 slides/page, please) and\ndo not have to be in color.\n\nYou will also describe the audience and context orally before you begin your presentation.\n\nSample Topics\n\nHere are some sample topics and situations to give you ideas:\n\n- You are the CFO of a diversified electronic components corporation. Explain to the\nannual shareholders meeting how the various divisions of your firm performed during\nthe preceding fiscal year.\n\n- Assume you have been appointed special assistant to the CEO of a company of your\nchoice. Your first assignment is to research the company's major competitor and\npresent a profile of that corporation to the CEO and top management.\n\n- You are in the marketing department of your company. You want to introduce a new\nproduct to the market (e.g., one 15.279 student hypothetically worked for Ben &\nJerry's and came up with a new ice cream flavor).\n\n- You are in the IT division of your company. You have been asked to recommend a\nparticular kind of software to do some task (e.g., billing). Describe the capabilities\nand features of the software.\n\n- You are the HR manager for your company. You are leading an orientation for new\nemployees, explaining various company benefits.\n\nRevision of the Presentation\n\nThis part of the assignment offers you a chance to improve your presentation (and to raise your\ngrade) on the basis of the feedback you received on the original presentation. Depending on your\noriginal grade, a revision of your presentation is required, optional, or not recommended as\nfollows:\n\nOriginal Grade\n\nRevised Presentation\n\n<7.5\n\nrequired revision\n\n8-8.5\n\noptional revision\n\n9-10\n\nno revision, unless want to\n\nThe grade you receive on your revision will be averaged with your original grade to determine\nyour final grade. If you are required to do a revision and do not do one, you will receive a \"0\" for\nthe revision round, and that grade will be averaged with your original score.\n\nCRITERIA\nStrategy: Was your strategy appropriate for the goals, the audience, and\nFOR GRADING\nthe context as you've defined them? Did you achieve the goals you set out\nfor this presentation?\n\nStructure: Was your structure (relatively direct/relatively indirect)\nappropriate? Was the presentation organized in a manner that the audience\ncould easily follow? Did you use transitions effectively to move from\npoint to point?\n\nContent: Have you provided enough detail for the audience to understand\nyour main points? Did your introduction generate audience interest and\npreview the presentation? Did your conclusion wrap up the talk?\n\nDelivery: Was your delivery relatively smooth? Did you demonstrate\nenthusiasm and an interest in the audience's needs? Did you use gestures\nin a way that was comfortable for you and not distracting to the audience?\nDid you make eye contact with all members of the audience?\n\nVisual Aids: Did your visual aids enhance your presentation? Did they\nfollow the principles of good design? Did you use them effectively?\n\nQ&A: Did you handle the process of answering questions easily? Did the\ncontent of your answers satisfy the audience?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Team Report",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/1daee4a3449969a67a0790f5110bd096_MIT15_279F12_team_report.pdf",
      "content": "Team Report\n\nThe major assignment for this class is a team report and presentation on a management-related\ntopic. You may write on any topic, venture, or question that intrigues the team. The paper could\nbe on research team members are pursuing in another class or in a UROP, or something team\nmembers have come into contact with on a job or volunteer activity but want to know more\nabout. The key criterion is that you envision and write the report for a real world audience--\npeople who need information, or who have to be convinced about something.\n\nThe report might:\n\n- describe the results of a new marketing or feasibility study\n- present an economic, financial, or strategic analysis\n- recommend a new product\n- evaluate the pros and cons of a company entering a new market\n\nYour team could consider such projects as:\n\n- requesting funding from an outside agency for a MIT project\n- analyzing an industry for potential investors interested in buying stock\n- recommending the purchase of a particular stock\n- consulting with a small organization\n- working with an MIT student organization to develop a marketing strategy\n\nThink about what you can reasonably do given the resources you have to work with. For\nexample, if you want to do a strategic analysis, don't analyze Microsoft; instead choose a local\nsoftware company or a retail distributor. Every report must present factual findings and reach\nsome conclusion or make a specific recommendation\n\nThe report should be at least 10 pages (typed, single spaced), including front matter (transmittal\nmemo and Executive Summary), tables and graphs, and appendices. At least six consecutive\npages must be your narrative and analysis (i.e., the body of the report). Please include, as well,\nfootnotes and a bibliography.\n\nTHE WRITING PROCESS\n\nThe process of writing this report will take place over a significant portion of the semester.\nIt will begin with a discussion of teamwork in class on followed by an opportunity to brainstorm\nwith your team members on potential topics.\n\nThe following are the deliverables in the project:\n\nProposal I (due October 16)\nWrite a one-page memo in which you describe concisely:\n\n- the topic or question you will investigate\n- the real world audience that the report will inform or persuade\n- possible research sources (including interviews, published materials, and research in\nprogress)\n\nAddress all memos to your instructor and TA and assume they have no prior experience with or\nknowledge of the subject of your proposal.\n\nProposal II (due October 23)\nResubmit your original proposal based on feedback you were given. Add research sources that\nyou have found in the interim.\n\nReport Draft (due November 13)\nThe draft of the report that you submit should be as close to completion as possible. The more\npolished this draft is, the better feedback we can give you. We reserve the right to return any draft\nwe don't feel is far enough along to warrant our reading it.\n\nOutline of Team Presentation (due November 15)\nSubmit a one-page outline that lists the major topics that will be covered during your\npresentation, subtopics, and the presenter for each topic.\n\nPresentations (In class the last two weeks of the semester)\nGive a 20-minute presentation based upon your research report. If your report is primarily\ninformative, the presentation should describe your most innovative, interesting, or unique finding\nand use evidence to further our understanding of that point. If your report is primarily persuasive,\nyou should use direct structure, presenting your recommendation first and then supporting it with\nsub arguments and evidence. Use appropriate visual aids.\n\nAt the time of the presentation, give your instructor and TA the following information, in\nwriting:\n\n- a brief description of your situation (including the subject, the audience, the context, and\nyour credibility)\n- two (2) hard copies of your overheads\n\nYou will also describe the audience and context orally before you begin the presentation.\n\nAllow time for questions and discussion at the end of the presentation.\n\nFinal Report (due December 4)\nThis is the finished product complete with transmittal memo, executive summary, list of\nfootnotes, and bibliography.\n\nGRADING\n\nThe entire report is worth 20 points with the first draft worth 8 and the final draft worth 12. The\noral presentation is worth 15 points with 10 points awarded on the performance of the team, and\n5 points awarded on the performance of each individual team member.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 1: Clear, Concise Writing in E-Mail",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/cd99f9f6b9d48e794208cc092d2c3fe8_MIT15_279F12_pset1.pdf",
      "content": "Problem Set #1\n\nClear, Concise Writing in E-Mail\n\nThe e-mails below are not written as clearly or concisely as they could be. In addition, they may\nhave problems in organization, tone, or mechanical errors. Rewrite each so they are appropriate\nfor the audience and their purpose. Correct mechanical errors. Finally, add a subject line to\neach.\n\nExample #1\n\nTo:\nEmployees of Widget International\nFrom: CEO of Widget International\nSubject:\n\nStop bringing bottled water to work. Its a huge environment problem and the company is\nordering a lot of water filters. People don't realize how much wasted energy goes into shipping\nall that water around, and the cost of plastic bottles is immense, and the plastic never\ndisintegrates, it just sits in landfills. Some water comes from other countries like Fiji and we are\ntaking there water and they wont have enough. Fancy water is a ripoff. New water filters are\ncoming into the company so the water from here will taste better anyway.\n\nExample #2\n\nTo:\nMIT Alumnus\nFrom: Current MIT Sloan MBA Student\nSubject:\n\nWonderful meeting today, didn't you think? I really, really enjoyed learning about the data\nmanagement business. After seven years, you seem to really know alot. I particularly enjoyed\ntalking about the acquisition of a data management solution provider. The thing is I don't think\nthat our interview was the best showcase of my problem solving skills and so I would really\nappreciate your comments about my responses as we went through the case. That being said, my\nexperience in business attacking these kinds of problems, thinking about them, working the\nnumbers, and solving them through the analytical rigor Sloan students are well known for has\nprepared me well to succeed in challenges I would face as a member of the data management\nindustry.\n\nSo if you could send me your thoughts, comments, and suggestion for how I could do better in\ncase base interviews in the future, I would really appreciate it. I have interviews set up\nthroughout next week, and I know I could improve how my performence if I had your feedback.\nIn fact, you could reach me at 617-555-1212 any time this afternoon or over the week-end.\nThanks very much.\n\nExample #3\n\nTo:\nStaff Working on the Diet Drink Account\nFrom: Supervisor\nSubject:\n\nI spent all of last night reading through the report you have written regarding how our Diet Drink\nclient can do a better job of publicizing their product. There was a fair amount of information in\nthe report, but was all of it needed? But before I go into that, be sure you check your formatting\nbecause it lacks coherency especially in the way you formatted the tables, but not only that. You\nshould also be on the lookout for inconsistencies in subheads, etc.\n\nO.K. back to the organization of the report. Why go into all that detail about who the Diet Drink\ndrinker is and why they drink the diet drinks they drink? And do we really need to know how\ncheap Diet Drinks competitors' pricing is? And I didn't follow how that profit potential analysis\nwas performed.\n\nWhat are our recommendations for Diet Drink? And what data backs up those recommendations?\nThats what I want to know.\n\nExample #4\n\nTo:\nAll Employees\nFrom: Management\nSubject:\n\nOur Committee to Improve Inter-Office Communication has decided that there needs to be an\nupdate and revision of our policy on emailing messages to and from those who work with us as\nemployees of this company. The following are the results of the committee's decisions, and\nconstitute recommendations for the improvement of every aspect of email communication.\n\n1. Too much wordiness means people have to read the same thing over and over repeatedly,\ntime after time. Eliminating unnecessary words, emails can be made to be shorter and\nmore to the point, making them concise and taking less time to read.\n\n2. What can make things wordy is having a situation in which nouns are often substituted\nfor verbs. Verbs are a good way of describing an action and don't need to be turned into a\nnoun instead of just being themselves--verbs! Acting on this is regarded as an important\nactivity to be undertaken by all of us as soon as possible.\n\n3. Based on a standardized informational sample taken of randomly selected emails, we\nhave found that using stacked nouns makes the reading process time factor much greater,\nand also makes the clear understanding quotient much lower.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2: Should MacGregor Dining Be Re-Opened?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/eabcef1cfcacb8ae0696448c352c0e2c_MIT15_279F12_pset2.pdf",
      "content": "Problem Set #2\n\nShould MacGregor Dining Be Re-Opened?\n\nYou are a member of the \"Students for Better Dining at MIT\" committee. You have been asked\nby President Hockfield and Director of Campus Dining, Richard Berlin, to make a\nrecommendation as to whether or not the MacGregor Dining Hall should be re-opened. An\nexperiment took place in spring semester '08 to offer students a dinner buffet at MacGregor, and\nbased on that experiment, a decision will be made whether or not to open the dining hall\npermanently.\n\nYou and your committee have studied the data gathered from the experiment,* as well as other\ndata Campus Dining has provided you about MIT students' eating habits.+ These data are\nincluded as tables on the next two pages.\n\nYour Task\n\nWrite a short memo (not more than two paragraphs) to President Hockfield and Richard Berlin\nwith your recommendation for MacGregor dining. Base your recommendation on the data! In\nother words, look closely at attached tables to determine whether MacGregor should be\nreopened, should not be reopened, the experiment should be extended, etc. Include with the text\ntwo charts illustrating the data that best support your recommendation.\n\n*Thanks to 15.279 fall '07 student team for some of the data related to MacGregor dining.\n\n+ Some data created expressly for this exercise.\n\nData Related to MacGregor Dining\n\nA. Students' Rating of the Buffet\n\n5 = Excellent 0 = Terrible\nScore\n# of Responses\n\nB. How Often Which Foods Were Eaten on the Buffet During One Dinner\n\nFood\nTimes Taken\nMeat\nCarbs\nVegetables\nSalads\nDesserts\n\nC: Whether Residents Would Eat Regularly at MacGregor Dining: Segmented by Gender\n\nGender\nYes\nNo\nMale\nFemale\n\nD: Number of Students Eating at MacGregor Dining During the Week\n\nDay\nNumber\nSunday\nMonday\nTuesday\nWednesday\nThursday\nFriday\nSaturday\n\nE: Number of Customers at Each MIT Dining Hall per Week\n\nDining Hall Average # of\nCustomers per Week\nMcCormick\nBaker\nMacGregor\nNext\nSimmons\n\nn = 41\n\nF. How Much MIT Students Spend on Food Each Week (Outside of the Meal Plan)\nSegmented by Year and Gender\n\nYear/Gender\nAmount\nSenior\n\nMale\n$32\nFemale\n$30\nJunior\n\nMale\n$28\nFemale\n$22\nSophomore\n\nMale\n$29\nFemale\n$30\nFreshman\n\nMale\n$30\nFemale\n$25\n\nG. Average Length of Time Spent Eating in the Dining Hall\n\nDay\nTime\nSunday\n20 minutes\nMonday\n21 minutes\nTuesday\n19 minutes\nWednesday\n20 minutes\nThursday\n17 minutes\nFriday\n15 minutes\nSaturday\n15 minutes\n\nH. Number of People Sitting at Each Table (Low-High Range)\n\nDay\nNumber\nSunday\n3-8\nMonday\n5-8\nTuesday\n4-10\nWednesday\n2-10\nThursday\n7-12\nFriday\n5-10\nSaturday\n6-8\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3: Mid-Semester Self-Evaluation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/4dff8e3f2e57f0e669a8f570dc717e4e_MIT15_279F12_pset3.pdf",
      "content": "Problem Set #3\n\nMid-Semester Self-Evaluation\n\nThis self-evaluation should focus specifically on your class participation. Making comments\nduring class allows you to improve your ability to speak extemporaneously, which is exactly\nwhat you will have to do in all kinds of business situations (e.g., meetings, asking questions at\npresentations, one-on-one conversations). Thus, we would like you to write a short memo (two or\nthree paragraphs) in which you describe the frequency with which you make comments in class,\nthe nature of those comments, and what is easy and difficult for you when it comes to speaking\nup in class.\n\nIf you have made few (or no) comments during class, this is a time for us to come up with a plan\nto help you overcome your shyness. Should we cold call you? Warm call you? Give you an\nimpromptu to-do? Our experience is that as soon as a person talks in front of a group once or\ntwice, it becomes much easier--so we need to come up with a way to help you break the ice.\n\nFinally, if you have done an impromptu, please comment on what you see as the strengths and\nweaknesses of that presentation.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Teaching Note: Active Listening and Reflective Responses",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/bb37efe9da25702d1a9a4a43b73d7fa3_MIT15_279F12_actveListng.pdf",
      "content": "MIT Sloan Communication Program Teaching Note JoAnne Yates\nActive Listening and Reflective Responses\nOne of the basic building blocks of communication--and one of the most difficult skills\nto learn and practice--is effective listening. We all spend much of our time hearing\nother people speak, but not necessarily listening to what they are really saying.\nInstead, for example, we daydream, start formulating responses before hearing the\nwhole point, and interrupt to make a tangential comment. Meanwhile, we have failed to\nunderstand the speaker's real point and the thoughts or feelings underlying that point.\nAs a consultant or manager, you will be called on to listen in many different contexts\n.\nand for many purposes. You will need to gather data about a problem in order to help\nsolve it. You will need to listen to a subordinate's career problems in order to help hm\ndevelop. You will need to understand the point of view of another person in order to\ncarry on effective negotiations for somethng you want from her. You will need to\ninterview candidates for positions in your group. Before you can communicate\neffectively as managers you need to learn some useful approaches and techniques for\neffective listening. This teachng note describes active listening, a comprehensive\napproach to the task of listening It also describes reflective responses, a particular\nresponding technique that is based upon Western concepts of the role of feelings in\ninterpersonal relationships. Reflective responses can be especially useful in certain\ntypes of listening situations.\nActive Listening\nActive listening is a term often used to describe a general approach to listening that\nhelps you gain more information, improve your understanding of other points of view,\nand work cooperatively with superiors, subordinates, and peers. This approach\nrequires not just that you learn and remember more of what the other party has said, but\nalso that you communicate your interest and involvement to that party, as well. Active\nlistening requires effective use of verbal and nonverbal communication, as well as\nmental and emotional discipline.\nAn active listener:\nLooks and sounds interested in the speaker. By conveying your interest,\nyou can encourage the speaker to communicate more extensively and to clarify\nand expand on thoughts and feelings. Communicate your interest by\nmaintaining good eye contact. (In American culture and many Western\ncultures, this means looking into the other person's eyes much, though not all,\nof the time. Too much eye contact may make the speaker feel self-conscious,\nbut too little will make him feel\n\nignored). Maintain a body position and facial\nexpression that indicate attentiveness, not boredom. Nod encouragingly to\nshow understanding and interest. Avoid drawing, playing with your pen, or\nother distracting behaviors. (Conversely, try not to be distracted by the\nspeaker's mannerisms.) Use vocalizations such as \"uh-huh\" and \"yes\" to\nencourage him to continue.\nAdopts the speaker's point of view. You will understand and remember\nthe speaker's points most effectively if you try to see things from her point of\nview, at least initially. Try to listen, not to interrupt, finish sentences, or rush\nthe speaker. Most of all, try to suppress your initial reactions and to hear and\nunderstand the speaker's perspective. Try to listen and respond from the\n\nspeaker's frame of reference, not your own. Listen for her feelings, not just her\nwords. Try to empathize with her position. Depending on the context and\npurpose of your communication, you may later shft modes into a discussion in\nwhich you also present your own point of view, but to be a good active listener,\nyou shouldn't do that until you thoroughly understand the speaker's point of\nview.\nClarifies the speaker's thoughts and feelings. You will listen better if\nyou are not talking too much yourself. When you are in active listening mode,\nlimit your talking to things that\n\nwill contribute to getting the fullest informational\nand emotional content from the speaker. Avoid inserting your own marginally\nrelated experiences and minimize interruptions. When the speaker pauses, ask\nopen-ended questions (e.g., \"How do you feel about X?\" \"Tell me about X.\"\n\"What concerns you about X?\") rather than questions that can be answered in a\nsingle word or phrase (\"Are you satisfied with X?\" \"Is X on schedule?').\nUse\nreflective response techniques (described in more detail below) to check the\naccuracy of your understanding of the speaker's ideas and especial1y feelings\n(e.g., \"So you are frustrated at your inability to progress on X?\").\nYou may adapt active listening techniques to different types of listening, with your role\nranging from minimal intervention to more active solicitation and even into giving\nadvice, depending on your needs.\nReflective Responses\nReflection, or reflective response technique, borrowed from certain types of counseling\ntechniques, is designed to elicit as full a sense as possible of the speaker's thoughts and\nespecially feelings. It is a way of helping someone explore her own personal\nmeanings. This technique involves reflecting back to the speaker what you believe she\nhas said in order to verify (or clarify) your understanding and to encourage the speaker\nto continue elaborating on her point of view.* An active listener is already using\naspects of this technique, but reflection requires taking even greater care in the\nfollowing areas:\nReflect the speaker's thoughts and feelings. Restate what you believe\nthe speaker has said to check for the accuracy of your understanding (e.g., \"So\nyou couldn't finish the assignment on time.\" \"Then you think the time allotted\nwas inadequate?\"). Even more importantly, reflect back the speaker's feelings\nas you have heard or inferred them (e.g., \"You seem to feel anxious because\nyou couldn't finish the assignment on time.\"). This interpretation of feelings is,\nof course, more tricky in that it often requires you to read between the lines, to\ninfer feelings underlying what has been said (e.g., \"You seem angry about the\nreorganization,\" rather than \"So the department was reorganized.\"). Thus you\nmay want to use wording or voice tone make your inferences into questions,\nrather than statements (e.g., \"So you feel anxious because you couldn't finish\nthe assignment on time?\" \"Do you feel anxious because you couldn't finish the\nassignment on time?\").\nRespond rather than lead the conversation. Let the speaker's thoughts'\nand feelings be your guide in the conversation. Don't guide the conversation by\nasking questions or interjecting ideas or suggestions that take the speaker into\n*This description of the technique is based on Chapters 9 and 10 of Interpersonal Behavior:\nCommunication and Understanding in Relationships, by Anthony G. Athos and John J. Gabarro\n(Prentice Hall).\n\nnew areas of interest to you (e.g., \"Have you thought about X?\" \"Maybe you\nshould ask about Y .\"). Instead, respond to and reflect back what he actually\nsaid or what you sense is implied by what he said (e.g., \"So you feel trapped\nby this project?\"). Try to stay within the\n\nspeaker's frame of reference, rather\nthan asking questions or making suggestions that come from your own frame of\nreference. Even asking \"Why?\" may distract the speaker from one line of\nthoughts or feelings into defending and justifying feelings or actions.\nRespond to feelings, rather than content. As suggested earlier, feelings\nare generally a better indication of personal meanings than content is. Thus you\nwill help the speaker's self-exploration more by responding to her feelings\n(e.g., \"So you resent Susan's frequent absences?\") than to the content (e.g.,\n\"How often was Susan out of the office?\") There is a corollary to this\nguideline: You can get at a person's feelings better by responding to the more\npersonal aspects\n\nof what she says. Whenever possible, choose the specific,\npersonal points (e.g., \"So your subordinate, John, tends to challenge you in\nfront of others.\") rather than the abstract generalizations (e.g., \"So the firm's\nhierarchy is weak \") to respond to and reflect back at the speaker. This\nencourages her to explore those personal feelings more thoroughly and to make\nclear her own assumptions.\nReflective vs. Directive Responses\nObviously, this reflective technique is not always appropriate to the circumstances and\nto your needs or purposes. At times you may want to be more directive and less\nrefective in your interactions. You may want to argue, advise, or confront. Thus once\nyou have learned to use the reflective mode of listening, you need to consider when to\nuse it, when to shift from that mode to a more directive mode, and when not to be\nreflective at all. Here are some reasons and times for using this reflective technique:\nWhen you need or want to understand the other person's feelings more\ncompletely\nWhen you sense that the other person has not yet revealed his thoughts and\nfeelings about the situation\nWhen you sense that the other person is not sure of his true feelings\nThus active listening with reflective responses is often the first stage of an interaction.\nThen, once you feel you really understand the person's perspective, you can switch to a\nmore directive or confrontational or persuasive stance. Here, you can lead as well as\nrespond and speak from your own frame of reference as well as the other person's.\nConclusion\nListening is a critical communication skill for managers and consultants, as well as for\nall of us in our personal lives. Advising someone well on a career, personal, or\norganizational issue requires that you understand that person's point of view. You\ncan't negotiate effectively until you understand what the other person wants. Effective\npersuasion depends on a clear understanding of the other person's perspective. In all\nof these situations, active listening, often beginning with reflective responses, is crucial\nto achieving your ultimate communication objectives.\nActive listening is a skill that, like other communication skills, must be developed. It\ndoes not come naturally to most of us. Practicing active listening and particularly\nreflective responses can feel artificial when these skills are isolated from a real\ncommunication need. Still, only by practicing can you develop these skills and then\nintegrate them with your other communication skills.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Clear and Concise Writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/491ea0a5c1160febd38c89c03ed78f0c_MIT15_279F12_clrCncsWrtng.pdf",
      "content": "Sloan Communication Program___________________________ Teaching Note\n\nCLEAR AND CONCISE WRITING\n\nYou should:\n\n1.\nIdentify characters.\n\nSentences should be about someone or something. Characters can be concepts,\n\ntheories, institutions, etc., as long as your readers can identify a \"who\" in the\n\nsentence.\n\nNOT: Decisions in regard to the launch of the new product rests with\n\nsenior management.\n\nBUT: Senior management must decide whether or not to launch a new product.\n\n2.\nUse verbs to name actions.\n\nActions can be physical movements, mental processes, feelings, relationships\n\nas long as the sentence tells a story about someone doing something.\n\nNOT: Our lack of knowledge about the condition in the factory precluded a\n\ndetermination of committee action effectiveness in fund allocation to those areas\n\nin greatest need of assistance.\n\nBUT: Because we knew nothing about the condition of the factory, we\n\ncouldn't determine how effectively the committee had allocated funds to areas\n\nthat most needed assistance.\n\n3.\nStructure your prose according to readers' expectations.\n\nA. Have subjects followed by their verbs as soon as possible.\nB. Every unit of discourse (e.g., phrase, clause, sentence, paragraph) should\nserve a single function or make a single point.\nC. Use the \"topic position\" (i.e., at the beginning of the sentence) to give the\nreader perspective, linkage, and context.\nD. Place in the \"stress position\" (i.e., material that arrives at the end of the\nsentence) new information you want the reader to emphasize.\nE. In general, provide context before asking the reader to process any new\nmaterial.*\n\n-\nAdapted from: George D. Gopen and Judith A. Swan, \"The Science of Scientific Writing,\" American\nScientist, Volume 78, pp.550-558.\n\nYou should try to avoid:\n\n1.\nNominalizations\n\nNominalizations are verbs that have been turned into nouns. For example:\n\ndiscover\n\ninto\n\ndiscovery\n\nmove\n\ninto\n\nmovement\n\nfail\n\ninto\n\nfailure\n\nNOT: A review was done of the records of the personnel department.\n\nBUT: We reviewed the personnel department records\n\n2.\nStacked Nouns\n\nStacked nouns occur when two or more nouns are used in a row unnecessarily\n\nNOT: Based on an extensive training needs assessment review.\n\nBUT: After we extensively reviewed our training needs . . . .\n\n3.\nPassive Voice\n\nIn the passive voice, the subject expresses the goal of the action. Use the passive\n\nvoice if the subject is unknown, or if you want to de-emphasize the subject.\n\nEXAMPLE: I made a mistake.\n\nA mistake was made by me.\n\nA mistake was made.\n\n4.\nRedundancies\n\nRedundancies come in all shapes and sizes.\n\nOften words are doubled in English.\n\nEXAMPLE: full and complete; true and accurate\n\nSometimes modifiers can be redundant.\n\nEXAMPLE: personal beliefs; terrible tragedy\n\nOr categories can be redundant:\n\nEXAMPLE: We decided to make the office walls blue in color.\n\n5.\nNegative Constructions\n\nThe affirmative usually states things more directly and concisely.\n\nNOT: Don't write in the negative.\n\nBUT: Write in the affirmative.\n\n6.\nMisplaced Modifiers\n\nMisplaced modifiers are \"misplaced\" because they literally have no place in the\n\nsentence. Watch out for words and phrases such as: kind of, really, basically,\n\nactually, generally, for all intents and purposes.\n\n7.\nNeedless Words\n\nRemember Strunk and White's famous dictum: Make every word tell.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Conceptual Parallelsim",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/2ec7d900380134cc10fad5ecb2910ac3_MIT15_279F12_cncptPrllelsm.pdf",
      "content": "Sloan Communication Program\n\nTeaching Note\nConceptual Parallelism\nVisually, a list implies to a reader that its items are comparable. To make your verbal\nand visual messages match, construct lists so that the items are conceptually and\ngrammatically parallel. In other words, the items should be discrete or non-overlapping,\nand they should all have the same relationship to the title of the list. The list in the\nfollowing passage, for example, is conceptually parallel:\nClosed-used groups will be charged for usage of the system on an annual basis.\nThis fee will depend on three factors:\n- How much the group's members access the system\n- How much the group's external database is accessed by other users\n- How much the group uses INET's consulting services.\nThe following list, however, is not conceptually parallel.\nThese are the results of our investigation:\n- All the steps of the process of production were observed.\n- The incoming material control showed that 10% of the raw\nmaterial received is defective; it is recommended to have less than\n2% defective in raw material.\n- The incoming raw material was kept separated at Receiving.\n- Sampling techniques ascertained that some suppliers were\nfurnishing bad lots with more than 20% defective components.\nThe first and third items of this list describe how the investigation was carried out, while\nthe second and fourth items present the investigation's results. The second item also\npresents the standard against which one result should be evaluated. Thus the items relate\ndifferently to the subheading that precedes them.\nThe following list also violates conceptual parallelism.\nThis is an important study for several reasons:\na) The drought is over so far as rainfall is concerned, but groundwater\nlevels in the NE, SE, and Western regions are still well below normal,\naccording to the DEQE.\nb) Water superintendents in these regions are begging for help before the\nnext drought in persuading their industrial users that water\nconservation is cost effective.\nc) The proposed study can serve as a persuasive tool by demonstrating\nsaving in a cross section of industries, and will be most effective while\nthe memory of the last drought is still fresh.\n\nEvery item in this list is not a reason why this study is important. Instead, the items form\nan interlocking logical chain that culminates in the final item. Thus the list format is\nmisleading, and the argument would be better presented in paragraph form.\nAre these lists grammatically and conceptually parallel?\nExample 1\nIn its study, the task force discovered that excessive breakage occurs when packers fail\nto:\n- Use styrofoam between each layer of test tubes\n- Pad the tubes adequately\n- Seal the cartons securely\n- Meet standards because of inadequate training\nExample 2\nThe report made several recommendations for increasing production at the satellite\nfacilities:\n- Create a more expertly trained workforce\n- An early retirement policy should be put into effect\n- Implementation of an improved information delivery system\n- Further studies will be done to gauge worker satisfaction\nExample 3\nWe should discontinue working with our supplier:\n- He is late with shipments\n- We must shut down the assembly line while waiting for needed parts\n- Delays cause missed deadlines\n- The cost to the company is in hundreds of thousands of dollars\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Constructing a Logical Argument",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/f9750ef62a5a3d984a4f40f6d48dbce4_MIT15_279F12_cnstrctArgmnt.pdf",
      "content": "Sloan Communication Program___________________________ Teaching Note\n\nCONSTRUCTING A LOGICAL ARGUMENT\n\nThe purpose of most business writing is to recommend some course of action (\"we\nshould open a branch office in Duluth\"; \"management should institute a policy of\nreimbursing employees for overtime\"; \"we should purchase laptops for the marketing\ndepartment\"). As a person making the recommendation, it is your job to back it up with a\nwell-constructed, well-supported argument. As a person making a decision about\nwhether or not to follow a recommendation, it is your job to determine whether or not the\nargument is logical.\n\nRational arguments are built upon evidence that leads to a conclusion through an\naccepted pattern of reasoning. (These patterns are sometimes called \"warrants.\") The\nvalidity of the argument should be tested by evaluating both the data cited and the\nreasoning process used to connect the evidence to the conclusion.\n\nKeys to a Convincing Argument\n\nArguments are weakened when their authors obscure the main point of the argument,\nneglect to include crucial evidence, oversimplify or complicate the issue, or don't\nanticipate counter arguments. To make your arguments as convincing as possible,\ninclude the following:\n\nA clear and delimited statement of the subject. Make sure the audience\nunderstands exactly what you are arguing for or against, or what you are\nrecommending. Don't confuse the issue by trying to argue for two or more things\nwithin the same communication. (If you are trying to convince your superior to\nallow you to hire additional staff, it is probably not the time to argue for\nadditional equipment as well.)\n\nA definition of all terms used in the argument. This includes both words that\nmay be unfamiliar to the audience as well as those at high levels of abstraction.\n(\"In order for the plan to be successful, we will need the cooperation of every\nstaff member.\" What constitutes \"success\"? How are staff members being asked\nto \"cooperate\"?)\n\nAdequate evidence. See below.\n\nA clear and logical reasoning pattern. See below.\n\nAnswers to contradictory arguments and evidence. Any argument contains\ncontradictory points of view. In most cases, it is better to recognize the opposing\nevidence and/or arguments and refute them. If you cannot refute a point, concede\nit rather than ignore it.\n\nEvidence\n\nThe evidence you use to support your argument should be reliable: that is, it should be\naccurate, relevant, representative and sufficient.\n\nBe careful to distinguish a fact, something that is verifiable; from an inference, a\nconclusion based on available evidence; from an opinion, a belief not based upon\nabsolute certainty or knowledge, but which nonetheless seems valid to the individual.\n\nFACT: George is driving a Mercedes 250SL.\n\nINFERENCE: George is doing well financially.\n\n[In reality, George could have borrowed the Mercedes,\n\nbe taking it for a test drive or stolen it.]\n\nOPINION: George is a great guy because he is\n\ndriving a Mercedes.\n\nThree commonly used sources of evidence in business writing are: statistics; examples\n(i.e., specific instances of the general point being made); and the testimonies of experts.\n\nPatterns of Reasoning\n\nFacts alone rarely, if ever, convince. In order to make a persuasive argument, facts need\nto be related to one another in a logical manner. A logical statement is a conclusion\nbased on reasoning. Logical statements depend on inferences drawn from facts, but are\nnot necessarily facts themselves. If the conclusion (or recommendation) is to be valid,\nthe reasoning pattern must follow certain commonly accepted rules.\n\nIn Western thought, there are two basic reasoning patterns, inductive and deductive:\n\nInductive reasoning: In inductive reasoning, individual cases or examples lead to\na general conclusion. Inductive reasoning is used both to generalize from\nobservations and to identify the cause of a set of phenomenon.\n\nSuppose, for example, that after taking a training seminar with \"Write Well,\nInternational,\" participants reduce the amount of time it takes them to write\nmemos. That observation might lead you to hypothesize that taking a \"Write\nWell\" seminar increases writing efficiency. One example of this would not\nnecessarily validate the conclusion, but if the same phenomenon occurred four,\nfive or a dozen times, the conclusion would be strengthened. Inductive reasoning,\nthen, only leads to the probability of a conclusion. Every possible instance would\nhave to be examined if the conclusion were to be judged valid beyond any doubt.\nObviously, the larger the sample, the more confident the writer/speaker can be\nthat the conclusion is correct.\n\nDeductive reasoning: Deductive reasoning moves from the general principle to\nthe specific case. For example, you could draw the following conclusion by\nreasoning deductively:\n\nMajor Premise: Staff members who have participated in\nthe \"Write Well, International\" seminar write more efficiently.\n\nMinor Premise: Sam Jones is a seminar participant.\n\nConclusion: Sam Jones will write more efficiently.\n\nTogether, the above three sentences constitute a syllogism, the classic pattern used in\ndeductive reasoning. Deductive reasoning leads to the inevitability of a conclusion,\nassuming that the major premise and the minor premise are true. However, using\ndeductive reasoning can be tricky since in reality we can examine only a few instances in\nany given situation, and, therefore, it is usually difficult to make a generalization that\napplies to all cases.\n\nWays to Evaluate an Argument\n\nIn evaluating an argument, you need to test both the data and the warrants.\n\nWhen looking at the data, ask: What is the source? Is this a fact, or an inference or\nopinion masquerading as a fact? Is the evidence accurate? Is it current? Is it relevant to\nthe argument at hand? Have the statistics been evaluated properly? Is the authority cited\nreally an authority on the subject? Is the evidence biased in anyway? Is there enough of\nit?\n\nThe following questions should be asked in order to test the reasoning process:\n\nInductive: Are enough examples cited to produce a valid conclusion? Are the\ninstances typical? Are negative instances accounted for? If you are attempting to\nidentify the cause of a phenomenon through the use of inductive reasoning, ask if\nthe data alone is sufficient to bring about the effect, or if some other\ncircumstances or events are the cause.\n\nDeductive: Are the major and minor premises true? Is the conclusion based on\nthe premises?\n\nCommon Reasoning Fallacies\n\nIf you examine many arguments closely, you will often find that their authors have used\ntechniques which make those arguments shaky and thus their conclusions weak. The\nfollowing are some examples of the errors in reasoning that can produce faulty\narguments:\n\nEvading the issue occurs when the real argument is ignored, and something that\nis irrelevant to the main argument is attacked instead.\n\nAn ad hominem argument attacks the person making the argument rather than the\nissues involved.\n\nA non sequitur results when the evidence does not justify the conclusion.\n\nA circular argument occurs when a debatable point is advanced as true. (This is\nalso called begging the question.)\n\nA false dilemma sets up the premise that there are only two alternatives when, in\nfact, several may exist.\n\nThe error of post hoc, ergo propter hoc (\"after this, therefore, because of this\")\noccurs when the case is made that one thing causes something else when, in\nreality, the fact that one thing followed another is simply a coincidence.\n\nA hasty generalization results when too little evidence is offered or the evidence\nis not representative.\n\nA false analogy is produced when things are alike in some ways but are\ndissimilar in more fundamental ways, making a valid comparison impossible.\n(Note: the use of analogy, in which two different things are compared, can be a\nuseful tool in argumentation. As implied above, however, you need to be careful\nthat the dissimilarities between the two things being compared don't negate the\nvalidity of the comparison.)\n\nEmotional Appeals\n\nEmotional appeals can be a powerful means of persuasion. If you study examples of\npropaganda, for instance, you will see that propagandists make liberal use of emotional\nappeals. Common techniques used by communicators who want their audience to\nrespond emotionally rather than critically include: making a connection to an authority\nfigure (notice how American politicians love to refer to Thomas Jefferson, Franklin\nRoosevelt or John F. Kennedy); calling for people to support an idea or course of action\nbecause everyone else is doing it (called \"band-wagoning\"); or using stereotypes\n(especially if one group of people are labeled as the source of common trouble).\n\nIssues that you deal with may have an emotional side to them, and it might be quite\nproper to identify that emotional component. (\"The west wing of the factory should not\nbe razed because it housed the earliest experiments in widget production, and thus is an\nimportant part of our company history.\") But you have a responsibility to combine\nemotional appeals with concrete pieces of data that are woven together in a logical,\nrational manner. This will create the strongest argument possible, and one which will be\nable to withstand an equally well-reasoned critique.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Difficult Conversations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/9070e88bf8c54f66d3b19895668e7998_MIT15_279F12_difficultConv.pdf",
      "content": "Sloan Communication Program\n\nTeaching Note\nDifficult Conversations\n\nExercises to help you practice difficult conversations\n\nA) Reread the Dashman case from Mr. Larson's perspective. Suppose he really\nwanted to help Ms. Post. Or suppose that his continued employment hinges upon\nher success, and the positive relationship between them. What might he have\ndone differently? Might have prepared a \"background\" memo she could have read\nprior to committing to her decision. Might he have talked to her about his\nwillingness to help her in any way, particularly in terms of \"company culture.\"\nMight he have offered to introduce her around a bit? In general, he might have\ndone more to convince her he would be part of the team, and inform her in ways\nthat were helpful and NOT challenging\n\nB) Reread the Sacramento case from Hausman's point of view, with the\nassumption that the protagonist is the son of the president of the company. What\nmight Hausman have done to forestall the problem now on his hands?? Might\nhave gone over his assignment with the protagonist, making sure he understood\nthe new expectations? Might have talked with him about his experience with\nCompton, and use that opportunity to highlight differences in managerial style?\nIn general, might he have spent more time preventing a flap from happening,\nthereby saving the HUGE amount of time that will be spent explaining himself to\nthe president?\n\nGuidelines for Managing Difficult Conversations\n\nThese situations are difficult because they involve a direct threat to the person's career.\nThe same type of threat is involved in, for example, seeking a raise or a promotion,\nresolving a conflict with another employee, or arguing against a company strategy or\npolicy. \"Going along\" is sometimes good advice, but not always; there are times when\nyou can and must stand your ground. Different situations will require different\napproaches, but there are some general rules to keep in mind.\n\n1. BE STRATEGIC--Who is your audience? When is the best time to talk to this\nperson? What is his/her attitude toward you? What is the best way to frame your\nargument for this audience? Who are you? What do you want to achieve? What is\nthe context in which this request is being made? Example: If the company is\nreporting a loss for the quarter, budgets are being slashed, and your performance is\nway below last year's, there is no strategy other than dumb luck that will work in\ngetting you a raise. But that might be a good time to bring up the cost-savings ideas\nthat got no attention last year.\n\n2. PICK YOUR GROUND--Never let yourself be pushed into a confrontation. Taking\non an issue demands a strategy, and a good strategy involves a good time and a good\nplace. Picking your ground also means only going to the wall for things that really\nmatter. Remember the saying \"Act in haste, repent at leisure\"? It's true.\n\n3. KEEP IT PRIVATE--Never have it out with a superior in public; you will not win.\nNo matter how right you are, your superior will be thinking about how he/she looks in\nfront of the other employees rather than about what you are saying. Keeping it\nprivate also means not trying to use others as leverage. Saying, \"The other managers\nagree with me on this\" sounds good to you, but sounds like mutiny to your superior.\nThe better plan is to talk with the other managers about the issue to get an idea of\nwhere they stand, and then volunteer to \"find out\" what they think if your superior\ndemands that you do so.\n\n4. MAKE IT PART OF SOMETHING GOOD--It's not your brilliance or someone\nelse's stupidity you want to talk about; rather, it's how you implement the company's\nplan, follow the CEO's lead, build teamwork, meet the demands of the marketplace,\nanswer the needs of the customer, etc. Example: \"I'm sorry Doug sees it that way.\nFrom my standpoint, I am just doing everything I can to make last year's record\nperformance by my group even better this year.\"\n\n5. BE ANTI-CONFRONTATIONAL--By this we mean AVOID confrontation by\npracticing good communication. It takes time, but it works. And it doesn't take\nanywhere near as much time, effort, worry and stress as confrontation does. If you\ndeserve a pay increase or a promotion, and you don't get one, maybe nobody knows\nthe reasons you deserve it. If you have disputes with another employee, maybe it's in\nyour interest to resolve them together rather than have a superior come in and do it.\nNote that in the two cases we read, it is the ANTICIPATION of a problem that leads\nto some possible solutions; waiting for the problem to arrive means it IS a problem.\n\n6. BE A TEAM PLAYER--You did everything right, you got the chance to deliver\nyour well-thought-out message and...nothing. Still no sale. OK, accept the decision,\nthank the person for his/her time, and SEEK ADVICE. If it's salary or promotion, ask\nwhat you would have had to do to qualify. If it's a dispute, ask the person how he/she\nwould have handled it.\n\nThese situations are always challenging, but they always hold within them some kind of\nopportunity. Go into such situations as few times as possible, but get something out of\nevery one. Remember, these are stressful for your audience as well. If you are\nsuccessful in getting what you sought, make sure you also have the resources/\nauthorization or whatever else you need to get it done BEFORE you leave. You really\ndon't want to go back for at least a little while! If you don't get what you want, seek\nadvice on how to get it the next time. Remember, this lets you \"make it part of\nsomething good\"--the boss's sound advice! Finally, be aware that right after the boss\n\nsays \"No\" to one of your requests, he/she may be looking to say yes to something else,\nparticularly if it's small relative to what you originally asked for. WWII bombers always\nhad secondary targets in case they couldn't get the primary ones, and so should you. No\nraise?-- How about an early salary review? No changes in the marketing plan?--How\nabout including you in the early planning stages next time?\n\nIn the end, though, nothing works as well as NOT having to get into confrontations.\nWith the right strategy, you can succeed, but there are always risks. Using good\ncommunication skills allows you to anticipate many confrontations, and defuse them\nbefore they can develop into real threats.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Intercultural Communication",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/5510174a6f9820d4cfd53c1e17dbb1ac_MIT15_279F12_intcltrlComm.pdf",
      "content": "Sloan Communication Program*\n\nTeaching\n\nNote\n\nINTERCULTURAL COMMUNICATION\nAs the U.S. economy becomes increasingly international, and the global economy\nincreasingly competitive, U.S. businesspeople must be able to communicate effectively\nwith people from other cultures. The costs of cultural miscommunication--lost\nopportunities and profits, embarrassment, and major mistakes--are too large and too\nfrequent to allow us to ignore critical cultural differences or to dismiss other cultures as\nquaint, illogical, or wrong.\nEffective cross-cultural communication requires that we understand what a culture is, and\nthe ways in which it affects every aspect of life. Today, a growing number of companies\nare investing resources toward training employees in intercultural communication\nutilizing either in-house programs or consultants.\nCulture has been defined as the \"collective mental programming of the people in an\nenvironment\"; the values and perspectives shared by people who are \"conditioned by\nsimilar education and life experience.\"1 In this sense, culture is difficult to change,\nbecause it is not only shared by a large number of people but \"crystallized\" in such\nstructures as the family, religious organizations, forms of government, work\norganizations, law, and literature. Because it is crystallized in every layer of society,\nculture is like a hidden mass of an iceberg, whose tip is a society's visible customs and\nstyles. The mass may be invisible, but if you fail to navigate around it, you can be\nshipwrecked.\nGeneral Guidelines\nTo avoid shipwreck, as people doing business in and/or with other cultures, we should:\n- Learn that differences in behavior or style reflect much deeper cultural values,\nsuch as how individuals view time and space, how collective or individualistic\na culture is, or how success is defined.\n- Try to identify the assumptions and values of our own society, so we know\nwhat (often unconscious) biases govern us.\n- Try to avoid ethnocentrism, the belief that our culture is superior to others,\nwhich is often so deep-seated that it is not consciously felt.\n* This note was authored by Lori Breslow, Sloan Communication Program, Sloan School of Management,\nMIT.\n1 Geert Hofstede, \"Motivation, Leadership, and Organization: Do American Theories Apply Abroad?\"\nOrganizational Dynamics (Summer 1980), 43.\n2 Ibid.\n\n- Become aware of and anticipate the differences in norms, values, and behaviors\nof people from different cultures, and learn to respect and accommodate those\ndifferences.\nPerceptions/Values that Differentiate Cultures\nFollowing are some issues to consider when thinking about cultural differences. They are not\nmeant to be all-inclusive.\nIndividualism versus collectivism: Some cultures value individual initiative and\nindependence; the individual seeks his/her own identity, makes decisions based upon his/her\nown beliefs, and is responsible only for him/herself and his/her immediate family.\nIn other cultures, identity is conferred by one's group; the extended family, clan, and/or\norganization provide the individual with security, protection, and values, and often make\nimportant life-defining decisions for him/her. Individualism focuses on individual freedom;\ncollectivism on group stability and consensus.\nHigh-context versus low-context cultures:3 How explicit individuals must be when\nthey are communicating with one another, that is, how directly they must state what they\nwant each other to know, can be expressed as a function of whether they live in a high-\ncontext or low-context culture. When the culture is relatively homogeneous and provides\nthose living within it with a high degree of common knowledge, the culture is defined as\nhigh context, and less information must be explicitly stated. When individuals living in the\nsame culture have relatively less in common, the culture is said to be low context, and\npeople must be more explicit in their communication.\nPerception of space: People from different cultures vary in how much space they perceive\nis needed between themselves and others. For example, individuals from Middle Eastern\nand Mediterranean cultures tend to be comfortable with less personal space than is generally\ndesired by North Americans and northern Europeans. Thus, if a person from a Middle\nEastern culture stands as close to a North American as his/her culture dictates is acceptable,\nthe North American is likely to feel uncomfortable because his/her space has been\n\"invaded.\" The way in which organizations designate space (who sits where and how much\nroom they are given) also reveals a great deal about status and values in an organizational\nculture.\nPerception of time: There are also distinct differences between the way in which cultures\nobserve and value time. Some cultures are time-oriented to a high degree (as evidenced by\ntheir numerous phrases about \"saving time,\" \"buying time,\" \"investing time,\" and \"wasting\ntime\"), while others are less preoccupied with \"merely time.\" There are also cultural\ndifferences in time-orientation, that is, in attitudes about the past versus the future. Some\ncultures revere the traditions and customs of the past, and look for past precedent to justify\nThe term \"contexting,\" as we are using it here, was first coined by the anthropologist Edward Hall,\nwho has done much to advance our understanding of the more subtle variables that create culture.\nAmong Hall's most important books are The Silent Language (1959), The Hidden Dimension (1966),\nBeyond Culture (1976), and The Dance of Life: The Other Dimensions of Time (1983).\n\ninnovation and change. Other cultures are less concerned with past precedent, and use\nprojected future benefits to justify innovation and change.\nImportance of hierarchies: Some cultures particularly value formal roles and structured\nhierarchies, and place great importance on the respect and deference that must be paid to\none in a higher position. Other cultures put greater emphasis upon open, informal\nrelationships. All cultures and organizations have hierarchies of some kind; differences are\ndemonstrated by what hierarchies are based on, and how important and constraining they\nare.\nOther issues or concerns that might be useful in thinking about cultural diversity include:\n- The nature of change (is it viewed as positive or negative?)\n- Importance and rigidity of gender roles\n- Criteria/definitions of success\n- The nature of authority\n- The nature of humor (what is humorous?)\nCommunication Practices that Differentiate Cultures\nJust as values and perceptions vary from culture to culture, so do specific communication\npractices. Thus to conduct business with those from different cultures, you must understand the\ncommunication practices of that culture. Below are a few of the areas in which you may expect\nto find differences between cultures:\nEmphasis on task versus relationship-building: People from the U.S. often pride\nthemselves on getting down to business quickly and efficiently. In many other cultures,\nincluding most Asian and Latin American countries, such an immediate focus on task might\nseem inappropriate. Instead, these cultures put a premium on first developing relationships\nbased on such non-business factors as common schools, family connections, and similar\ninterests.\nRole of written communication: In large and established U.S. firms, written\ncommunication plays an important role in informing and persuading people, as well as in\ndocumenting information, positions, and decisions. Written communication is viewed\ndifferently in other cultures. In Japanese firms, for example, it usually plays a more\nceremonial and documentary role. Oral agreement for a proposed action is generally\nachieved before anything is written down. Then the written memorandum with the proposal\nis circulated to gain official approval from all involved. Thus you wouldn't want to propose\nsomething initially in writing when working in that culture.\nRole of meetings: In U.S. business, meetings are often conducted so that people\ncan come together to discuss a project, an issue, or an initiative. Sometimes, meeting\nparticipants \"brainstorm\" with one another, proposing ideas and then discussing their pros\nand cons. In other cultures, as Japan for example, decisions are forged behind the scenes, so\nthat by the time a meeting is held, consensus has already been reached.\n\nPatterns of reasoning and argumentation: The ways in which people from different\ncultures structure an argument and reach conclusions can vary considerably. U.S. business,\nfor example, tends to favor \"direct structure,\" in which the main point or recommendation\nappears first followed by subarguments and evidence. In other cultures, the use of direct\nstructure may seem brusque or even rude; in these cultures, the main point may be\ndeliberately ambiguous, buried, or never even stated. In the West, arguments are to be\nsupported by objective, neutral, often quantifiable \"facts.\" Individuals in other cultures\nbelieve information cannot be separated from the speaker or writer, and, therefore, they tend\nto rely more on intuition or emotion to substantiate ideas.\nLevel of formality in interpersonal communication: In the U.S., interpersonal relations\nbetween business acquaintances tends to be very informal, with first names often used after\none telephone call or meeting. Not all cultures are so informal in their business interactions.\nThe British, for example, may find American familiarity a bit pushy, and the Japanese are\nlikely to find it highly inappropriate, especially when the two people are of different ages\nand at different organizational levels.\nOral presentation style: In most U.S. firms, a relatively lively and informal presentation\nstyle is favored. The use of extensive gesture and movement should also work well in\nFrance and Italy, for example, but might seem excessive in Finland or Japan.\nNonverbal communication behaviors: Nonverbal cues and behaviors vary from\none culture to another. For example, people from the U.S. are taught to use direct eye\ncontact when talking with one another; in many Asian cultures, it is considered improper or\nrude to look directly at another person throughout a discussion. There are also norms\nconcerning touching behavior (who may touch whom and where) and for the use of silence\n(is silence considered valuable or detrimental to communication?). When conducting\nbusiness with a person who does not speak the same language, nonverbal behaviors may be\nuseful in helping to clarify meaning. For example, pauses may provide opportunities for\npeople to digest information or ask questions.\nQualities Required for Successful Cross-Cultural Communication\nSuccessful cross-cultural communication requires not only knowledge and preparation, but the\nfollowing critical qualities:\nPatience--a willingness to accept ambiguity, confusion, frustration.\nTolerance--a fair and impartial attitude toward differing values and those who hold them.\nObjectivity--an ability to elicit all necessary information and weigh it from the\nperspective of both sides before making a judgment.\nEmpathy--an ability to put yourself in another's position and to anticipate another's\nreaction to a situation.\n\nRespect--a willingness to esteem and learn from the culture of others, no matter how\ndifferent from you own.4\nAlthough we tend to emphasize the differences among cultures, it's also important to note that\nthere are differences within cultures. There are distinctions between regions (for example,\nnorthern and southern Italy), between ethnic groups within a culture, between organizations\n(IBM and Apple), and, of course, between individuals. Thus, we have to be careful about\nmaking sweeping cultural generalizations and about applying those generalizations to the people\nwith whom we are doing business. To avoid that danger, cultivate the five qualities above.\nAnticipating and understanding differences will increase the effectiveness of your intracultural\nand intercultural communication.\nWhen dealing with other cultures, the ultimate goal is not only to respect differences, but to\nvalue them.\n(c) 1997 Lori Breslow Sloan Communication Program\n4 Teaching Methodology and Concepts Committee, \"How to Teach Intercultural Concepts in a Basic\nCommunication Class,\" The Bulletin (September 1988), 3.\n\nBibliography of Intercultural Communications\nBooks\nAdler, Nancy J. International Dimensions of Organizational Behavior, 3rd ed. Belmont, CA:\nWadsworth Publishing, 1996.\nBennett, Milton J., ed. Basic Concepts of Intercultural Communication. Yarmouth, ME:\nIntercultural Press, 1998.\nBrake, Terence, Danielle Medina Walker, and Thomas Walker. Doing Business Internationally\n(text and workbook). Princeton, NJ: Training Management Corporation, 1995.\nCondon, John C. and Yousef, Fathi. An Introduction to Intercultural Communication.\nIndianapolis, IN: Bobbs-Merrill Educational Publishing.\nMead, Richard. Cross-Cultural Management Communication. New York: John Wiley & Sons,\n1990.\nRuben, Brent, D. Human Communications Handbook--Simulations & Games, Vols. 1 & II.\nRochelle, NJ: Hayden Book Co.\nSamoven, Larry A. and Richard E. Porter. Intercultural Communication: A Reader, 6th ed.\nBelmont, CA: Wadsworth Publishing, 1991.\nVictor, David A. International Business Communication. New York: Harper Collins, 1992.\nFilm Sources\nBig World Inc.\nIntercultural Training Resources, Inc.\n1350 Pine St. suite 5\n1750 Buchanan St.\nBoulder, CO 80302\nSan Francisco, CA 94115\n(800) 682-1261\n\n(415) 749-2920\nEToll@aol.com\nOther Resources/Organizations\nIntercultural Press, Inc.\nP.O. Box 700\nYarmouth, ME 04096\n(800) 370-2665\nThe International Society for Intercultural Education, Training, and Research (SIETAR)\n808 17th St., NW, suite 200\nWashington, DC 20006\n(202) 466-7883\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Media Relations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/67f637872f5b82314714c78bfcdbc003_MIT15_279F12_mediaRltions.pdf",
      "content": "Sloan Communication Program\nTeaching Note\nMEDIA RELATIONS\nMedia relations takes several forms in most companies, ranging from publicity to crisis\nmanagement. It can include investor relations as well, particularly at smaller companies.\nWhile large companies have positions dedicated exclusively to media relations, this is not\nalways the case at smaller companies, where the responsibility is part of another\nexecutive's duties. Even if there is a media relations group, every executive and manager\nhas a degree of media relations responsibility at all times, and at certain times can be at\nthe center of a media relations campaign or crisis. For this reason, it is good for all\nexecutives and managers to know how to do good media relations.\nThe Typical Scenario\nIn most cases, a company's media relations activities are managed through a public\nrelations, external affairs or communications department. Within this group, there is\none person who handles all inquiries from the press, and manages all efforts to gain\nattention from the press for positive news stories or publicity on behalf of the company.\nThis person is most often called the director of media relations, and he/she is usually the\nspokesperson for the company as well.\nWhile this person handles routine queries (quarterly results, questions about press\nreleases, etc.), there are others who can and will speak to the press in specific\ncircumstances. These occurrences can be positive (record profits, successful product\nintroductions, a beneficial merger) or negative (layoffs, failed product, stockholder\nlawsuits). These people will be selected, coached and coordinated by the director of\nmedia relations and the head of the department. Good media relations means the\ncompany can maximize the positive effects of news coverage and minimize the damage\nfrom negative news coverage.\nAccomplishing this requires:\nA Close Relationship with the CEO--The person responsible for media relations must\nhave a good working relationship with the CEO, or report to someone who does. In most\ncompanies, the only way to know what is going to happen ahead of time is to find out\nfrom the CEO. Fortunately, the CEO typically has a VERY deep interest in how she/he,\nher/his management team, and the company look in the newspapers, so that kind of\nrelationship usually comes with the territory.\nGood Working Relationships with the Management Team--The person in charge of\nmedia relations will be coaching senior management in what they say, and\nrecommending stories to them that will require their participation. In addition, media\n\ntraining is important for those who will deal with the media on a regular basis, or who\nMUST deal with the media during a crisis. An atmosphere of trust between the director\nof media relations and senior managers is vital, particularly when third parties (media\ntraining, PR companies) become part of any campaign.\nGood Relationships with the Press--Whether it is local press, national press, industry\npress, or all three that matter to the company, the director of media relations must have\nthe knowledge of who writes what for whom, what they have written in the past, and how\nto contact them. Knowing who covers what at a paper is partly just a matter of courtesy,\nand partly a vital component of the company's credibility with reporters. Subscription\nservices provide the most up to date listings of reporters, with addresses and phone\nnumbers, and that's a good start. But it is up to the director of media relations to build\nthat information into a relationship. Frequent contact is the best insurance, particularly\nsince reporters change assignments and even jobs with some regularity.\nSo, being in touch directly or indirectly with the CEO, having positive interactions with\nthe management team, knowing where to go within the company to get the information\nreporters seek, and knowing the reporters who cover the company on a regular basis\nmeans media relations are in pretty good shape. If there is something positive and\nnewsworthy going on, the right person knows about it, knows whom to get the\ninformation from, knows who to consider for an interview, and knows whom to call\nabout the story.\nSo much for the \"good news\" part of media relations. What about when the news is bad?\nCrisis Management\nReporters have the same reaction to bad news that sharks have to blood in the water--\nthey begin a feeding frenzy. A pleasant walk to the office can change into a nightmare\nvery quickly when someone responsible for media relations turns a corner to see half a\ndozen satellite uplinks, a swarm of people with microphones, tape recorders and\nnotepads, and a lot of hungry looks whenever a bigwig from the company is spotted. 60\nMinutes is a very real thing, and it must dine on something every week, but local stations\nand newspapers can spoil a media relations person's whole day just as quickly.\nOK, that nightmare is the result of not knowing enough about what was going on. What\ncan media relations do when it DOES know what is going on?\nThe reason it is called \"crisis management\" is because there are ways of handling even\nthe worst events. There is no escape, but following the guidelines below can minimize\nthe intensity and the duration of the pain for the company, the managers, and the\nstockholders.\nTalk to EVERYONE involved--The first thing media relations people do is gather\ninformation necessary to assess the multiple levels at which damage could occur. Later,\nthis information will be used in framing the company's response, but it is used\n\nimmediately to determine how wide and deep the damage is or will be. What will this\nnews do to sales? Will it have an effect on ongoing negotiations? What will be the\nreactions of stockholders and analysts who cover the company? The aim is to construct a\nresponse that acknowledges the mistakes that have been made--ALL OF THEM--and\nwhich lays the foundation for the rebuilding process.\nGet the Truth Out--Getting the truth from the people within the company is difficult.\nAsking tough questions can bring out paranoia in colleagues. But getting the truth out\nthere, in the public arena, is an important step in recovery. And the acknowledgement\nmust be complete. There will be resistance to this from every quarter, but once the\nprocess begins, there can be no nasty surprises, because these are what sustain and widen\nthe media frenzy. The goal is to build credibility during a period when many angry\npeople do not want to believe a thing the company says, so there can be no further\nnegative revelations that undercut what has been said. This is NOT the time to say\nanything positive about the company--that comes later.\nFraming the Response--The writer of the response (which will take the form of a press\nrelease and/or a press conference) ties every admission to the image of the company that\nhe/she hopes will emerge. When the company spokesperson says, \"We did not tell the\ntruth,\" there is the implied message that the company did tell the truth in the past, and\nthat principle will again guide it in the future. Every lie, mistake, or whatever is aberrant\nwill be corrected. The admission does not try to make this point immediately, but rather\nit sets the stage for a new company structure. Bit by bit, good media relations moves the\ncompany as a whole and most of the employees AWAY from blame and away from\ninvolvement in the problem.\nTalking Points--Once the response is drafted, it must be approved by the CEO and by\nsenior management. When this approval is granted, the next step is to prepare talking\npoints. The talking points keep everyone who talks to the media consistent in their\nresponses (\"on message\"), and helps the company \"speak with one voice\" in much the\nway it does when there is a single spokesperson. Having senior managers contradicting\neach other in the paper or on TV is disastrous during a crisis\nInternal Announcement--This message for employees contains the same information\nas was in the press release/press conference. It addresses employees as a specific\naudience and can ask for their continued trust. Nonetheless, the internal release must be\nwritten as if it were public, because all it takes is one employee and a fax machine to\nMAKE it public. The internal announcement should coincide with the press release or\nthe press conference. Vendors and customers should receive explanatory letters from the\ncompany, too.\nWorking the Story--It is not too late to get media training for those who will have to\ninterview with the media. PR firms like Edelman Worldwide and Hill & Knowlton offer\nsuch training, and it is worth seeking. They also offer crisis management services, and\nthey should be considered if the crisis extends beyond the company's locality, or if the\ncompany needs help/expertise beyond it own capabilities. For example, if the company\n\ndoes not do government relations on an ongoing basis, but the crisis demands that it have\nthe support of elected officials, it should hire a good PR company.\nMedia relations should offer only trained/effective people for interviews. If the CEO is\ngood at this, they should use him/her: if not, they should NOT. They should be sure,\nhowever, that the CEO agrees with each interview proposed, and he/she is aware of when\nthey take place. That goes for senior management, too. They do not need any more\nsurprises either.\nMedia relations must be absolutely sure that everyone knows that the ONLY answer to a\nquestion they don't know the answer to is \"I don't know,\" followed by \"Let me find out\nand get back to you later.\" Credibility is the name of the game at this point.\nMedia relations staff should sit in on all interviews. This will help the interviewee and\nwill put the reporter in the minority. If necessary, media relations should redirect the\ninterview to the issue at hand. Some reporters will try to use interviews as \"scavenger\nhunts\" to find new issues to bring up, and it is in the company's interest to stop this\nprocess.\nThe Rebuilding Process--Media relations should be alert for the point at which the\ncrisis, which has kept building, now begins to subside. This is the signal to begin the\nrebuilding process. Signs to look for are stories that grudgingly give the company credit\nfor honesty, or which note that no more negatives have emerged since the original\nadmissions. This is when to start thinking about a \"morning after\" story about what the\ncompany is doing differently now than it did before, how the company is moving toward\na brighter future, etc. If anyone responsible for media relations can even THINK about\nthis, the crisis is over!\nIt is good for executives to put themselves in the role of the media relations executive\neven if that is never their primary responsibility, because it is always PART of their\nresponsibility. Media opportunities and media crises come without warning, and the only\nway to deal with them is to be prepared ahead of time. The more responsible the position\nis within a company, the greater the responsibility is to anticipate the needs of media\nrelations. In addition, small entrepreneurial companies don't have directors of media\nrelations anyway--they have publicity people at best--so an executive may get the job\nwhether he or she wants it or not!\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Persuasion: What Research Tells Us",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/9578c5441c2ee183fc20b583a50ed14d_MIT15_279F12_prsuasnRsrch.pdf",
      "content": "M I T S l o a n C o u r s e w a r e\n\nPersuasion: What the Research Tells Us\nJ o A n n e Y a t e s\n\nWe have seen that in all communication, whether persuasive or not, you should consider the audience, your credibility,\nyour purpose, and the context of the communication to form an effective communication strategy. The communication\nstrategy in turn has important implications for the structure of the message. These same factors are critically important in\npersuasion. While such factors have long been recognized as influential, in the last few decades much empirical research\nhas studied their effects. This research can give you some insights that may help you design effective arguments. The\nfollowing note summarizes some of that research.\n\nIn reading this note, you should keep several things in mind. First, the summary necessarily simplifies the findings.\nMoreover, most of this research has been conducted in artificial, experimental settings, rather than in real organizations.\nConsequently, you should use your common sense and your knowledge of your own firm's corporate culture to guide you\nin applying them. Finally, the various factors investigated and discussed separately interact in any given case. A few of the\ninteractions are mentioned below, but many more are not. Thus you must be careful to weigh all of the relevant factors as\nyou develop a persuasive strategy. Again, your common sense should guide you.\n\nThe findings and implications that follow are organized under audience involvement, audience bias, credibility, context,\nand other persuasive techniques.\n\nAudience Involvement\nAudience involvement refers to the audience's level of interest in and concern about the specific issue being considered. It\nis typically related to the extent to which the outcome directly affects the audience. In considering the examples below,\nremember that the audience's involvement relates only to a specific situation. The same audience that is highly involved in\none issue may be much less involved in another.\n\nImportance of Central Versus Peripheral Issues\nHighly involved audiences are more likely to be affected by the central arguments of a persuasive communication, rather\nthan by peripheral issues such as the credibility of the persuader. Less involved audiences, on the other hand, are more\naffected by credibility and context.\n\nImplication: Emphasize logic with a highly involved audience. When your audience is highly involved, concentrate\non building a good logical argument and don't depend too much on credibility or organizational politics to make your\n(c) JoAnne Yates, 1992, rev. 2001\n\nM I T S l o a n C o u r s e w a r e P e r s u a s i o n\nargument. While your credibility may affect your structure (see the third point under credibility, below), the ultimate\neffectiveness of your persuasion will rest primarily on your logical arguments. When your audience is less involved,\nhowever, you should give added prominence to peripheral issues related to credibility and organizational context.\n\nPermanence of Attitude Change\nLess involved audiences are more likely to change their beliefs or attitudes towards an issue as a result of persuasion, but\nthese changes tend to be short term, with the audience reverting to their previous attitudes after a short period. In\ncontrast, highly involved audiences are less likely to undergo short term changes in attitude, though when they do change\nattitudes toward an issue, the change is likely to last longer.\n\nImplication: Capitalize on short-term and work towards long-term change. You may need to work harder to change\nthe attitude of a highly involved audience, but the change will be more genuine and long term when it occurs. With\nless involved audiences, on the other hand, once you have achieved the attitude change you want, you should act on\nit as soon as possible, or try to consolidate the change by using the \"foot-in-the-door\" technique mentioned below.\n\nExtent of Attitude Change\nIf we view attitudes toward a position as a continuum from strongly opposed to strongly agreed, highly involved audiences\nare likely to move less far from their initial attitude in a given persuasive attempt than are less involved audiences. These\nhighly involved audiences tend to be more strongly anchored in their pre-existing attitudes.\n\nImplication: Use follow-up strategies when audience is highly involved. You should define your purpose and\nconsequent strategy with the audience's involvement in mind. When you want to change the attitude of people highly\ninvolved in an issue, design a follow-up strategy to continue the effort after the initial attempt at persuasion\n\nLevel of Involvement\nAn individual's level of involvement in an issue is increased when he or she commits to some position publicly by act or\nstatement. This effect operates even if the person doesn't believe in the desired opinion and only speaks or acts to get rid\nof the persuader. After the point of public commitment, the person often begins to change his or her own position to come\ninto accord with the actions. This effect is sometimes called the \"foot-in-the-door\" effect.\n\nImplication: Use the \"foot-in-the-door\" effect to increase involvement. You can increase a skeptical person's\ninvolvement in the desired direction by getting that person to make a public statement in favor of your desired\nposition or to take a small step towards acting on it. Whenever possible, try to get this \"foot-in-the-door\" effect to\nwork for you. If you are proposing a major program your audience is not likely to favor, for example, try to get the\naudience to accept a small pilot program first. The act of committing to the pilot program, however reluctantly, may\nmake the person's attitude more favorable to the program as a whole.\n\nAudience involvement focuses on how much the audience cares about an issue, but not on what position the audience\ntakes relative to the persuader. The next section turns to the latter topic.\n\nAudience Bias\nBias refers to the audience's initial position in regard to the persuader's position. The bias can be negative, positive, or\nneutral (i.e., having no initial opinion), and it can be held more or less strongly.\n\nNegative Bias\nA negatively biased audience responds more favorably to a two-sided argument--one that considers and refutes the\nopposition to a position as well as arguing in favor of the position--than to a one-sided argument. A one-sided argument\nmakes it easy for the audience to assume that the persuader simply does not understand the arguments for the other\nside. Of course, successful framing of the two-sided argument requires that the persuader understand the reason for the\nnegative audience's bias and address it. An individual is more likely to respond to arguments targeted at his or her own\nbasis for opposition.\n\nM I T S l o a n C o u r s e w a r e P e r s u a s i o n\n\nImplication: Use a two-sided argument if audience is negatively biased. If your audience is negatively biased, first\nfind out why the audience holds the opposing attitude so you can emphasize relevant arguments and eliminate or\nscale down less relevant arguments. Then use a balanced, two-sided argument that clearly but tactfully refutes the\nopposing position held by the audience as well as argues in favor of your position.\n\nNeutral or Positive Bias\nWith neutral and positively biased audiences, one-sided arguments are slightly more effective initially. If such audiences\nare later exposed to counter-arguments elsewhere, however, they are more likely to switch sides than are audiences\npreviously presented with two-sided arguments. The protective effect of the two-sided argument is referred to as\n\"inoculation\" because those presented with two-sided arguments have been infected with an opposing view, then cured by\nthe refutation, and are thus protected from future infection.\n\nImplication: Inoculate neutral/positive audiences if you anticipate opposition. With positively biased or neutral\naudiences, chose a one- or two-sided argument based on the likelihood that the audience will later be exposed to\narguments opposing yours. If you are arguing in favor of something not likely to raise any serious opposition, use a\nbrief one-sided argument (unless you are trying to establish credibility by fairness). If you are arguing in favor of\nsomething that you think may raise serious objections at some point, \"inoculate\" the audience by presenting a longer,\ntwo-sided argument.\n\nAs the previous section suggests, the bias of a highly involved audience tends to be stronger than that of a less involved\naudience. Reversing a strongly held negative bias in an involved audience is, of course, the most difficult persuasive\npurpose. Reinforcing a positive bias and creating a positive bias in a neutral audience are both much easier purposes to\nachieve.\nCredibility\nThe persuader's credibility with a given audience (credibility is always in the eye of the beholder) frequently affects the\nsuccess or failure of arguments. In her Guide to Managerial Communication, Munter shows five possible sources of\ncredibility: rank or status, goodwill, expertise, image or identification, and morality or fairness.1 You have a certain amount\nof credibility with a given audience before you communicate (though that amount may be zero or negative), and your\ncommunication itself can affect certain types of credibility. For example, if you are unknown to the audience, you can\nestablish credibility through expertise by citing credentials and demonstrating knowledge. You can establish or enhance\ncredibility through fairness by presenting a balanced argument. Conversely, you can damage your credibility in a\ncommunication that demonstrates lack of expertise or fairness, or that projects a bureaucratic and stuffy image.\n\nThe following findings concerning the impact of credibility on the effectiveness of a persuasive appeal must be applied\nwith caution in an organizational setting because they have certain limitations. First, these findings treat credibility as\nalready established, not considering any change in credibility as a result of the communication itself. Moreover, the\nstudies on which the conclusions are based use only credibility derived from pre-established characteristics such as rank,\nexpertise, and image. They do not consider the types of credibility based on personal relationships, such as those based\non goodwill and demonstrated fairness. Credibility based on personal relationships is particularly important in business.\nThus it may affect persuasion more strongly than credibility based on impersonal factors.\n\nThe first two of the three findings presented below are related to findings already presented under audience involvement.\n\nInteraction with Audience Involvement\nThe credibility of the persuader (source credibility) matters most when the audience is least involved in the issue. When\nthe audience is highly involved in the issue, credibility is not as significant.\n\nImplication: Don't depend on credibility with highly involved audiences. Don't depend as heavily on high credibility\nwhen the issue matters greatly to your audience (when your audience is highly involved) as when it is less important.\n\n1 Mary Munter, Guide to Managerial Communication: Effective Business Writing and Speaking, (Upper Saddle River, NJ: Prentice Hall, 1997).\n\nM I T S l o a n C o u r s e w a r e P e r s u a s i o n\n\nEffect on Permanence of Change\nOther things being equal, a more credible source is likely to engender more change in attitude in the short term, but the\ncredibility effect tends to fade away in the long term.\n\nImplication: Act immediately on credibility-based change to consolidate gain. When you are basing your persuasive\nappeal on high credibility, try to get action as-soon as possible, so the gain won't be lost.\n\nEffect on Structure\nA more credible source distracts the audience from the argument itself, and thus, at least initially, tends to suppress\ndominant reactions for or against the issue (i.e. positive reactions when the audience favors your position and negative\nreactions when the audience opposes your position). A neutral or less credible source may enhance or leave unchanged\nthe dominant effect.\n\nImplication: Choose direct structure if your credibility is high. If you have low credibility with your audience and they\nare negatively biased towards your position, you may want to use an indirect structure in which you build up to your\nposition. If you have high credibility, you should generally present your position first, even if the audience opposes it.\nYour credibility distracts the audience from reacting negatively to your position, and direct structure is generally\nclearer and easier to understand and remember.\n\nWhile the previous discussion has focused on the credibility of the persuader, the credibility of other parties mentioned in\nsupport of or in opposition to your argument may also play an important role. If another person (or group) is highly credible\nto the audience, mentioning that party may help your credibility by extension. Furthermore, that party's support becomes\nanother argument in favor of your position. Conversely, however, if the other person (or group) mentioned is not highly\ncredible to the audience, mentioning that party may harm your credibility and your argument. Thus you should be very\ncareful that you understand how your audience views other parties before citing them in your argument.\n\nContext\nThe organizational context also affects argumentative strategy in many ways depending on the precise circumstances\ninvolved. We can generalize about certain effects, however.\n\nReciprocity\nPeople typically feel obligated to reciprocate positive actions with other positive actions and to reciprocate concessions\nwith concessions. This principle is an integral part of organizational politics; though it may not be spelled out in a given\ncase, it may underlie much of what goes on.\n\nImplication: Leverage reciprocity in persuasion attempts. You can increase your chance of persuading someone to\ngrant you a favor by doing a favor for that person. Similarly, when you are trying unsuccessfully to persuade\nsomeone opposed to your request, offering a concession in your request may gain a reciprocal concession from that\nperson. In fact, some research shows that asking for more, being rejected, then asking for less can be a more\nsuccessful approach than simply asking for less, unless the original request was viewed as totally unrealistic. Be\ncareful in how you apply this finding in an organization where you have on-going credibility to maintain. People will\nnotice if you try this technique too often, and you may lose some credibility.\n\nThe \"Bandwagon\" Effect\nIn general people are strongly influenced by the beliefs and actions of those around them. While the fact that \"everyone is\ndoing it\" may not be a very good logical argument, it nevertheless influences people, especially when a certain critical\nmass of people have accepted a given belief or taken a certain action. The bandwagon effect should be distinguished\nfrom genuine network effects (e.g., if instant messaging requires everyone to use the same email system, a statement\nabout the number of others who have adopted the system constitutes a logical rather than an emotional argument).\n\nM I T S l o a n C o u r s e w a r e P e r s u a s i o n\nImplication: Harness the bandwagon effect when appropriate. You can use the bandwagon effect to enhance some\narguments. In arguing your department's need for a new training program, for example, you can mention all of the\nother departments that have used this program and found it useful. The bandwagon effect can also be dangerous,\nhowever. Uncritical acceptance of some opinion or action because everyone else has accepted it can lead to bad\ndecisions. Thus you should be careful both in invoking this effect and in responding to it yourself.\n\nThe politics so clearly present in all organizational contexts will suggest additional persuasive techniques to you.\n\nOther Persuasive Techniques\nTwo other persuasive techniques not easily grouped into the previous categories emerge from the persuasion research:\n\nCommon Ground\nPersuaders who initially express opinions held in common with their audience will be more likely to change their\naudience's opinions on other issues. This effect may work by increasing the persuader's credibility, or it may work by\ngetting the audience started with a positive dominant response that causes them to generate positive arguments.\n\nImplication: Establish common ground to improve persuasiveness. By starting from common ground, even on an\nunrelated subject, you can increase your chance of persuading your audience on your main subject. For example,\nrefer to goals you share with your audience before focusing on your disagreement over how to achieve them.\n\nReinforcement of Change\nChanges in attitude are, as stated earlier, generally transitory. The changes last longer when they are reinforced by\nrepetition or by audience action.\n\nImplication: Repeat and reinforce successful arguments. After you've worked hard to convince your audience on an\nimportant issue, don't rest on your laurels. Reinforce the audience's new attitude either by repeating the position\nand/or by getting the audience involved in acting on behalf of the position. Both of these courses of action will\nprolong and reinforce the changed attitude.\n\nThe persuasion research summarized here provides some interesting findings that can help you increase your\npersuasiveness.2 Ongoing research will undoubtedly add to or modify the findings summarized here. Meanwhile, use\nthese findings, but temper them with common sense.\n\n2 For further techniques, see Robert B. Cialdini's Influence: Science and Practice, 4th edition (Boston: Allyn and Bacon, 2001).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Style in Managerial Writing",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/a68fac3aef6942e51831cf6134704077_MIT15_279F12_stylMngrWrtng.pdf",
      "content": "Sloan Communication Program\nTeaching Note\nSTYLE IN MANAGERIAL WRITING\nWhat is style? We think about style in terms of the way we dress, how we furnish our\nhomes, or the cars we drive. Sometimes we think of style as something superficial, even\nsomething that has as its primary function the masking of reality. At its best, however,\nstyle conveys a sense both of who you are and what your message is. Style is the way\nsomething is said, and the style of any one document comes from the intersection of your\nown voice and a knowledge of what the audience and the context demand. Just as certain\nfashions are \"in style,\" so specific ways of communicating may be in favor at different\ntimes and places.\nStyle depends upon choice and arrangement. In writing, your choice of words and their\narrangement into sentences and paragraphs will determine the style of a document. In\nrecent years, the favored style in managerial communication within U.S. business has\nstressed clarity, brevity, and directness.\nWhat follows are some guidelines for how to chose and arrange words to create a\nparticular style that achieves the results you want.\nWords Have Character\nIn the organizational hierarchy, Joe Smith occupies the rung above you. Is Joe Smith\nyour boss or your superior? Now, let's assume Joe Smith is the company president. Does\nthat make him the Head Honcho? the guy who calls the shots? the big cheese?\nThe choice of any one of those words to the exclusion of the others will, of course, have\nan impact on the style of your document. Identifying Joe Smith as the \"president of Acme\nWidgets\" is very different from identifying him as \"Joe Smith, Acme Widget's head guy.\"\nThe words you chose will create a certain tone in your writing--forceful, passive,\nfriendly, threatening, etc.\nWords can differ in several ways. For example, they may be relatively more or relatively\nless formal, relatively more or relatively less abstract (more on this below). In addition,\nto being formal or informal, words can be colloquial, meaning they are used in everyday\nconversation; slang, colloquialisms that are usually outside of standard usage; or jargon,\nterms used by a specific group. Most U.S. business writing is written at an informal level:\nthat is, it is conversational without resorting to slang. (You might use slang if you were\non very familiar terms with the reader, and you know he/she wouldn't be offended.\nSimilarly, use jargon only if you know the audience will understand these insider's\nterms.) Writing in other cultures (e.g., Germany) may be more formal.\nRegardless of what level of words you chose, you need to be consistent. Don't begin a\nmemo with, \"Pursuant to our discussion on December 9, I would like to inform you . . . ,\"\n\nand end with \". . . so I think we're on the same page in this matter, and I can't wait to sew\nup the deal.\"\nWords also have both explicit or overt (denotative) and implicit or implied (connotative)\nmeanings. Though the denotative meanings or words are usually agreed upon, connota\ntive meanings can vary from reader to reader. As Maryann Piotrowski writes, \"Therefore,\nyou should be careful about your choice of words, especially in delicate or volatile\nsituations. . . . You should try to make sure that the connotation of the words you have\nchosen expresses the attitude you intend to convey, and the one your reader is most likely\nto understand.\"\nSentences Have Rhythm\nSentences can be short and choppy: The president fired his top managers. The managers\nwere distressed. The president was unmoved. Or they can be long and windy: Strategic\nplanning is a process for developing a product, which is the plans themselves, and a\nprocess, again, a monitoring process for ensuring those plans are implemented and meet\nwith the expectations, the goals, the objectives, or the results that we anticipated out of\nthe plans.\nRely too much on the first kind of sentence, and your writing will sound like a child's\nprimer. Use too many of the latter, and your readers may forget what they read at the\nbeginning of the sentence before they get to the end, and, in time, they may simply refuse\nto plow through the verbiage. A good test to determine whether or not a sentence is too\nlong is to read it aloud: If you are out of breath before you get to the end, there's a good\nchance the sentence needs to be trimmed.\nA good rule to follow is to use mostly simple, declarative sentences (sentences in subject-\nverb-object order), particularly for important ideas or ideas you want to stress, but soften\nthem with longer, slightly more complex sentences placed throughout the document.\nParagraphs Need Coherence\nYou may remember a stern elementary school teacher who drummed into you the\nprinciple that each paragraph should contain one and only one idea. It was good advice.\nThat means that every sentence in the paragraph should relate to and further that one\ncentral idea.\nMost readers will look for the topic of the paragraph--the concepts that the writer will\nthen develop--somewhere near the beginning of the paragraph, and that topic should be\nstated explicitly. \"If you write a passage that does not seem to hang together, seems\nuncentered or out of focus,\" Joseph Williams warns, \"you may have made a promise but\ndidn't deliver, or you may have delivered on a promise you didn't make.\"1\n1Williams, Joseph M., Style. Toward Clarity and Grace. Chicago: The University of Chicago Press, 1990,\np. 94.\n\nU.S. Business Looks for Simplicity and Clarity\nHow can you achieve the style that seems to be in favor in the U.S. business environment\n(and seems to be gaining acceptance in other regions as well)? Here are three guidelines\nto help you:\nIdentify actors and use verbs to name actions. A sentence should be\nabout someone doing something. Actors can be institutions, organizations,\ntheories, etc.; actions can be physical movements, mental processes, feelings,\netc. When readers can't identify who is doing what in the sentence, it's harder\nfor them to pull out meaning.\nFor example, listen to the difference between, \"Decisions in regard to the launch\nof the new product rest with senior management,\" and \"Senior management must\ndecide whether or not to launch a new product.\" We can understand what is\ngoing on in the first sentence, but how much simpler it is to get meaning when we\nknow exactly who (\"senior management\") is doing what (\"deciding on whether or\nnot to launch a new product\").\nFavor words that are simple, specific, and concrete. Words can be relatively\nabstract (\"We bought a huge tract of land for the new plant\") or relatively concrete\n(\"We bought a 5,000-acre tract of land for the new plant\"). The linguist S.I.\nHayakawa created what he called the \"ladder of abstraction\" to explain this\ncharacteristic of language. On the lowest rung are very specific terms: Pat's IBM\nPC. As we move up and up the ladder, terms become more abstract and thus\nencompass more meaning: \"computer\" \"office machine\" \"company property\"\n\"assets\" \"wealth.\"\nUsing words at a high-level of abstraction is not a problem per se; human\ncommunication could not take place without abstractions. But your writing will\nbe more precise and compelling--and your meaning will be clearer--if you use\nwords that are as specific as possible. Don't talk about the company's assets if you\nmean Pat's PC!\nMake every word \"tell.\" This is advice from William Strunk, the author (with\nE.B. White) of the classic The Elements of Style. Strunk is trying to remind us that\nevery word on the page must justify its existence; if a word doesn't further the\nreader's understanding of the message, then delete it--no matter how much you\nstruggled to get it on the page. Strunk compares writing to building machine: Just\nas extraneous parts on a machine increase the possibility that the it will break\ndown, so extra words in a sentence increase the possibility that the sentence will\nbreak down. And when sentences break down, readers lose valuable information.\nIn addition, if you want your writing to be as clear and concise as possible, use these four\ntypes of constructions sparingly:\n\nNominalizations. Nominalizations are verbs that have been turned into\nnouns as, for example, \"discover\" into \"discovery,\" \"move\" into \"movement,\"\nor \"fail\" into \"failure.\" The use of nominalizations often forces you to violate\nthe advice to write with strong subjects and verbs.\nNOT: A review was done of the records of the personnel department.\nBUT: We reviewed the personnel department records.\nStacked Nouns. Stacked nouns occur when two or more nouns are used\nin a row unnecessarily. The use of stacked nouns often results in language\nthat sounds stilted and confusing.\nNOT: Based on an extensive training needs assessment review. . .\nBUT: After we extensively reviewed our training needs . . .\nRedundancies. Redundancies come in all shapes and sizes. Often words\nare doubled in English (\"full and complete\" \"true and accurate\"). Sometimes\nmodifiers can be redundant (\"personal beliefs\" \"terrible tragedy\"). Or categories\ncan. (\"We decided to paint the office walls blue in color.\")\nNegative Constructions. The affirmative usually states things more\ndirectly and concisely.\nNOT: Don't write in the negative.\nBUT: Write in the affirmative.\nYour goal should be to make your writing as crisp and vigorous as possible in order to\nrespect your reader's time and make the process of deciphering your meaning as simple\nas possible.\nA Word on Grammar and Punctuation\nGrammar and punctuation, like other systems of rules and regulations, exist to bring\norder out of chaos and to bring us into focus for the rest of the world. (Think about how\nhard it would be to read anything without consistent rules of grammar and punctuation.)\nJust how serious the repercussions of violating these social codes will be depends upon\nthe attitudes of your superiors and the norms of your organization. Some managers can be\nhawk like in these matters, and a misplaced semi-colon can translate into a black mark\nagainst you. One thing is for certain, though: No one ever suffered from producing\ndocuments that were free from all errors in grammar and punctuation.\n* * *\nIn the end, listen to yourself, read you own work. Is your logic evident? Does the rhythm\nof your prose allow you and your audience to follow your thoughts? Shape your\nsentences to lead your audience forward, relying on length and arrangement of words,\n\nvariety, and level of diction to create the style that will result in achieving the purpose\nyou have defined for yourself.\nWith integrity and expression, you can reach the universal appeal of style, based on self-\nawareness, self-discipline, and practice. You can do this by mining your own unique\nviews and habits, plus mastering the conventions of language and social intercourse.\nStyle rarely comes easily, and when you've achieved it, people often don't grasp the work\nyou did to get it. But the ability to intertwine your own personality with the demands of\naudience and context is a skill that will serve you well.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Teaching Note: Teamwork Basics",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/c05e6e386240584a7d2417d0b90e2b90_MIT15_279F12_tmwrkBasics.pdf",
      "content": "Sloan Communication Program_____________________________Teaching Note\nTEAMWORK BASICS\nTwo things get accomplished in good teams: the task gets accomplished and the\nsatisfaction of team members is high. In order to achieve both of these ends:\n- Get to know other members of your group and their strengths\n- Set ground rules\n- Use a facilitator\n- Keep lines of communication open\n- Know how to avoid (or solve) common problems\nGround Rules\nSetting some basic ground rules helps to insure that everyone is in agreement about how\nthe team will operate. You will want to establish norms about how work will be done,\nthe role and responsibilities of a facilitator, how you will communicate with one another,\nand how your meetings will be run. Some of the ground rules can be decided on now;\nothers will develop as the semester progresses.\n1.\nWork Norms: How will work be distributed? Who will set deadlines? What\nhappens if someone doesn't follow through on his/her commitment (for example, misses a\ndeadline)? How will the work be reviewed? What happens if people have different\nopinions about the quality of the work? What happens if people have different work\nhabits (e.g., some people like to get assignments done right away; others work better with\nthe pressure of a deadline).\n2.\nFacilitator Norms: Will you use a facilitator? How will the facilitator be\nchosen? Will you rotate the position? What are the responsibilities of the facilitator?\n(see below)\n3.\nCommunication Norms: When should communication takes place and through\nwhat medium (e.g., do some people prefer to communicate through e-mail while others\nwould rather talk on the phone)?\n4.\nMeeting Norms: What is everyone's schedule? Should one person be\nresponsible for coordinating meetings? Do people have a preference for when meetings\nare held? Where is a good place to hold meetings? What happens if people are late to a\nmeeting? What happens if a group member misses a meeting? What if he/ she misses\nseveral meetings?\n\n5.\nConsideration Norms: Can people eat at meetings? smoke? What happens if\nsomeone is dominating the discussion? How can norms be changed if someone is not\ncomfortable with what is going on in the team?\nAbout Goals: Often there is the unstated assumption in student teams that everyone\nwants to get an \"A\" in the course, and that should be the team's primary goal. But\nsometimes, as the semester progresses and everyone gets pressed for time, people have to\nmake decisions about which courses take priority. If this course is a higher priority for\nsome team members than for others, that can create dissension in the group. Talking\nabout this will help to lessen that tension and help you find solutions to the problem.\nKeep communicating with one another!\nAlso, there may be other goals you want to consider as you work together during the\nsemester. These include: having a high level of camaraderie in the team, learning about\nhow to work together on a team-based project, or learning how to interact with others as a\nmember of a team.\nThe Responsibilities of the Facilitator\nThe facilitator is not necessarily the group's leader although he/she can be. It is better to\nthink of the facilitator as the person who keeps the group progressing in the right\ndirection (i.e., toward productivity). Therefore, the facilitator should:\n- Focus the team on the task (both short term and long term)\n- Get participation from all team members\n- Keep the team to its agreed-upon time frame (both short term and long term)\n- Suggest alternative procedures when the team is stalled\n- Help team members confront problems\n- Summarize and clarify the team's decisions\nI strongly recommend that you rotate the facilitator position throughout your work on this\nproject. It's good to experience being the facilitator, and it's good to experience a variety\nof facilitation styles.\n\nHints for Handling Difficult Behavior\nJust one difficult personality in a group can make the group unproductive and the teamwork experience\nunpleasant. Here are some suggestions for resolving problems:\nHow the Person\nActs\nDescription\nWhat to Do\nOverly Talkative\nThis person is usually one of\nfour types: (a) an \"eager beaver\";\n(b) a show-off; (c) very well-\ninformed and anxious to show\nit; (d) unable to read the responses\nof others and use the feedback to\nSometimes humor can be used to dis-\ncourage people from dominating the\ndiscussion; be sure when the person\nstops talking to direct the conversation\nto another person.\nmonitor his/her own behavior.\nIf the person's behavior can't be changed\n\nsubtly, one member of the group should\n\nspeak to the person privately and explain\n\nthat while his/her enthusiasm is appreciated,\n\nit's only fair to the whole group that every\n\nperson gets an equal amount of air time.\nToo quiet\nThe quiet person may be: shy,\n\nbored, tired, unsure of himself/\n\nherself, uninvolved in the group.\nMake a special effort to draw this person\nout: ask for his/her opinion on something;\nask him/her something about himself/her-\nself; tell the person you appreciate his/her\n\nparticipation.\n\nArgues\nIs the person critical of ideas,\nthe group process, or other\n\ngroup members?\nIf the person is critical of ideas, use that\nresponse to test the work the group is\n\ndoing--the person may be providing good\n\nfeedback. If he/she is critical of others,\n\ntell him/her how the effect that is having\n\non both the team or individual team\n\nmembers. Be explicit about the fact that\n\nhis/her behavior is detrimental to the goals\n\nof\n\nthe\n\nteam.\n\nComplains\nThe person may have a pet peeve,\nor may complain for the sake of\ncomplaining.\nListen to the person's complaint; if it is\nlegitimate, set aside group time to solve\nthe problem. Point out that part of your\n\nwork this semester is to learn how to\n\nsolve problems. Ask the person to join\n\nwith you to improve whatever is disturb-\n\ning\n\nhim/her.\n\nHints for Handling Group Problems\nBesides problems with individual team members, the team as a whole may run into some\ndifficulties. Here are some suggestions for dealing with teams that aren't functioning properly:\nFloundering\nGroups are often not as productive as they could be especially when people are just\ngetting to know one another and how each person works. Drawing up a list of tasks to be\naccomplished can help. So can saying something like: \"What do we need in order to\nmove forward?\" or \"Let's see if we can all come to an agreement about what we're trying\nto accomplish.\"\nGoing Off on Digressions and Tangents\nGroup members may get caught up in chatting about things not central to the work at hand.\nA little of this can be O.K. because it helps to put people in contact with one another. But\nif that kind of conversation continues to dominate the group, it can be detrimental to progress.\nThings to say include: \"Can we go back to where we were a few minutes ago and see\nwhat we were trying to do?\"\nMaking a Decision Too Quickly\nSometimes there is one person in the group who is less patient and more action-oriented\nthan other group members. This person may reach a decision more quickly than others\nand pressure people to move on before it is a good idea to do so. Someone could say:\n\"Are we all ready to make a decision on this?\"\n\"What needs to be done on this before we can move ahead?\"\n\"Let's check and see where everyone stands on this.\"\nNot Making a Decision\nThe best way to make a decision is by consensus with all team members agreeing on the\ndecision together. As you are discussing various ideas, try to be open to what each\nperson is saying. Remember you are trying to come to the best decision for the group as\na whole, not for any one person.\nIf the team is having trouble reaching consensus, here are some tools to use:\nMultivoting--List all the ideas the group has generated. Have each person\nvote on his/her top four choices. Choose the three or four ideas that have gotten\nthe most votes. Identify similarities and differences among the ideas, then\nthe positive and negative aspects of each. Have each person vote again, this\ntime for his/her top two choices. Tally the votes to see which idea has the most\nsupport.\nPlan A--List all the ideas the group has generated. Each person is given 100\npoints to allocate among the choices in any way he/she wants to. The alternate\n\nthat receives the highest number is the team's choice.\n(NOTE: Use Plan A to reach a quick solution when the decision is not very\nimportant. Use Multivoting for more important decisions.)\nFeuding Between Group Members\nA conflict--either related to a work project or to something outside of the group--can\nerupt and impede the group's progress. Usually nothing can be accomplished until the\nconflict is resolved. If that is the case, the parties need to discuss the problem, using the\nlistening techniques that have been discussed.\nIgnoring or Ridiculing Others\nSubgroups or factions can form in groups with one or more people excluded. Sometimes\nthe people who are outside of the \"in\" group will be the subject to criticism or ridicule.\nKnowing how to work with people we're not necessarily comfortable with is an ability\nthat will serve you well in the work world. Each group member must make every effort\nto work with every other group member.\nThe Group Member Who Does Not Do His/Her Share of the Work\nA group member may be unwilling to cooperate with others, may not complete assigned\ntasks, or may not come to meetings. You should be talk directly with the person to tell\nhim/her the effect his/her actions are having on the group.\n\nWhat Makes an Effective Group?\nAn Exercise\nListed below are 12 characteristics of work groups.\nPlease go through those characteristics and pick three that you feel are essential for good\ngroup performance. Rank them in this way:\n\n1--most important\n\n2--second most important\n\n3--third most important\nThen go through the remaining items on the list and mark the three that you feel most\ninterfere with group performance. Rank them:\n\n4--most disruptive\n\n5--second most disruptive\n\n6--third most disruptive\n_____ 1. Competitiveness among members\n_____ 2. Everyone sticks closely to the point\n_____ 3. The group avoids conflict\n_____ 4. Members rotate the leadership position\n_____ 5. Each member gives and receives feedback\n_____ 6. A detailed plan is suggested for each group meeting\n_____ 7. Each group member is assertive\n_____ 8. Informal subgroups form\n_____ 9. Members freely express negative feelings\n_____ 10. The overall goals of the group are explicitly set\n_____ 11. Information is freely shared among group members\n_____ 12. Each person's ideas are taken into consideration and assessed\nAfter each person has done this individually, you will come together with your team\nmembers to discuss your choices and to reach consensus\n\nSETTING GROUND RULES\nReferring back to the Teaching Note on \"Teamwork Basics,\" use the remainder of the\ntime in this class to set norms for your team in each of the five areas listed and discuss\nindividual and team goals.\nWork Norms\nFacilitator Norms\nCommunication Norms\nMeeting Norms\nConsideration Norms\nIndividual and Team Goals\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Case: Media Relations: The Wildebeest",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/69af0a5b891dae682cfaf1dd6b64bf0b_MIT15_279F12_wldbstCase.pdf",
      "content": "Media Relations Case: The Wildebeest\n\nThe Wildebeest is Consolidated Motor Company's most promising entry into the\nburgeoning market for very large sports utility vehicles. The Wildebeest can hold as\nmany as 8 adults in three rows of seats while providing extensive cargo capacity behind\nthe last row of seats as well--an industry first!\n\nUnfortunately, this increased capacity means the Wildebeest is big--and heavy.\nConsolidated Motor has noted some handling problems in test runs. Most notably, the\nWildebeest has a disconcerting tendency to roll over during high-speed turns.\n\nIn further tests, it was noted that reducing the pressure in the tires helped avoid rollover,\nand made the Wildebeest much more manageable. Tires running at lower pressure,\nhowever, did show tendencies toward premature wear and, in some tests at high speeds,\nsuffered a high rate of blowouts. A blowout at high speed makes the Wildebeest virtually\nunmanageable, and results in rollover in over 50% of occurrences.\n\nConsolidated Motor consulted with several major tire makers concerning this problem.\nThe company has had a longstanding business relationship with Tigerpaw Tire and\nRubber Company, and was very pleased that engineers at Tigerpaw said their new\ncombination of rubber compounds and stiff nylon belts could solve Consolidated Motor's\nproblem. At the time, Consolidated had specified a tire pressure of 32psi.\n\nWith the delivery of the first tires, Consolidated began their tests, and discovered that it\nrequired a pressure of 28psi to stabilize the Wildebeest. The CEO of Consolidated Motor\ntold the CEO of Tigerpaw that the tires seemed to perform very well at this pressure, and\ncomplimented him on their design as he indicated that Consolidated would order 1.2\nmillion tires. The CEO of Tigerpaw was very glad to hear of this big order, which would\nmake the company's third quarter look a lot better than it would without it, and said the\ncompany would be glad to supply the tires. This would be a very big sale, and would\nthrill the stockholders, who hadn't had a thrill out of Tigerpaw in quite a while.\n\nThree Months Later\n\nAfter making 100 Wildebeests available to car editors at major newspapers nationwide,\nreports came back about blowouts and even rollovers during test drives. With tire failure\nas the obvious cause, Tigerpaw is getting major media attention, and is now in crisis\nmode. They want to meet with Consolidated Motor to discuss how this crisis should be\nhandled. They have learned from their engineers that the tires were tested and approved\nat 30psi, but that Consolidated recommended 28psi. For its part, Consolidated Motor\nengineers think Tigerpaw approved the tires at 28psi.\n\nThe Activity\n\nForm groups of three, with a CEO, engineer and director of media relations for either\nTigerpaw or Consolidated Motor. Your aim is to agree upon a strategy for dealing with\n\nthis crisis. You will be talking with a media consultant about this, but the consultant\nexpects you to be able to describe your strategy, and show how it will allow you to deal\nwith this crisis effectively. The costs of NOT dealing with this effectively will be\ndramatic; one reporter has already called the crisis \"tiregate,\" and another has fixed on\nTigerpaw's \"X\" symbol for its new tread design, calling this a new \"X-on Valdez.\"\nOthers, with the GMC Hummer in mind, have noted that the Wildebeest should be\nrenamed the Bummer.\n\nHere are some questions to help guide your thinking:\n\nCEOs\n\nWhat was your role? Was something you did critical to the outcome?\n\nWhat are your motivations?\n\nWhat do you know that your colleagues don't know? What do you know that the other\ncompany doesn't know?\n\nEngineers\n\nWhat were the results of the tests you did?\n\nWhat do you know about tests the other company performed?\n\nIf you are such a good engineer, why did these tires/this vehicle fail?\n\nDirectors of MR\n\nWho is at fault here? How can tires and a vehicle that were specifically designed to work\ntogether fail to do so?\n\nAre there things you don't know? How will you find them out? Where will the nasty\nsurprise come from?\n\nWhat's the best way to present this to the public? Your employees? Your customers?\nYour stockholders? Your business partners?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Case: Sunk in Sacramento",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-279-management-communication-for-undergraduates-fall-2012/87a957de4880f4756d00d707cb6dd091_MIT15_279F12_sacrmntoCase.pdf",
      "content": "Sunk in Sacramento*\n\nYou are a 2001 graduate of BTU (Beaver Technical University), the top engineering\nschool in the country, with a degree in marketing from the Loans School of Management.\nIn the summer between your junior and senior year, you interned with Course\nManagement International (CMI). CMI, a five-year-old German company, developed\nand now sells educational software that helps faculty manage many of the administrative\ntasks associated with teaching a course. For example, CMI software can store a photo of\nevery student in a course, and when the instructor clicks on a particular photo, it can\nprovide him/her with demographic information on that student, a list of all his/her grades,\nand a sample of his/her assignments.\n\nAs the marketing intern, you worked directly for Mark Compton, the Director of North\nAmerican Marketing. Compton is 35 years old, married, and has an MBA from Loans.\nYou did fairly routine tasks in the office, but your communication skills, analytical\nabilities, and earnestness caught Compton's eye. He told you to keep in touch during the\nschool year, and you did. In March, he invited you to apply for the position of Marketing\nCoordinator. You were hired in April and began work right after graduation. You and\nMark continued your good relationship, and your responsibilities increased accordingly.\n\nIn October, four months after you arrived at CMI, Mark announced he was resigning.\nHis wife, a zoologist, had received a fantastic job offer to breed rare pygmy kangaroos at\nthe New South Wales Zoo, and they were moving to Australia in four weeks. However,\nCompton negotiated an arrangement with CMI to remain as a marketing consultant.\nWhen he left he said to you, \"Let me know how you are doing, and if I can ever be of\nhelp, get in touch.\"\n\nTo replace Compton, CMI promoted Berndt Hausman, Associate Marketing Director in\nCMI's headquarters in Breslau. You soon discover that Hausman is a much different\nkind of supervisor than Mark was. For example, he is much more formal with you,\nasking you to address him as \"Mr. Hausman.\" He is also a stickler for detail and wants\neverything to be done according to his precise directions.\n\nA month after Hausman arrives, there is a regional trade show for educational software in\nSacramento, California. You have already been to two of these kinds of shows with\nMark, and you tell Hausman this. He is happy to hear it because he would like you to go\nto this one alone since he is still trying to get the office \"in order.\" You are pleased to\naccept this responsibility because it will give you an opportunity to prove yourself to him.\nYou get everything ready for the show and leave for Sacramento.\n\nUpon arriving, you check your e-mail. There is a message from Hausman with the\nsubject line, \"Important. Read Immediately!\" You open the e-mail to read a very curtly\n\n*Based upon a true incident. Names and places have been changed. (c) 2002 Lori Breslow,\nSloan Communication Program.\n\nworded message that states you have not \"outfitted\" yourself sufficiently for the trade\nshow--specifically, you have not brought enough promotional packages, demo CDs, or\nlaptops. The e-mail says Hausman is sending more of each to you via overnight mail.\n\nYou are confused, if not stunned. You know you are well supplied because you brought\nexactly the same amount of material that you and Mark had used at other shows. You\ndon't see any reason to send anything more, and you compose a quick e-mail back to\nHausman telling you this. You receive the following e-mail in reply:\n\nObviously, you and Mr. Compton had not been reaching enough\n\npotential customers at these trade shows, which is why you had\n\nsufficient materials. As per my earlier e-mail, I am sending--via\n\novernight mail--an additional number of our promotional packages,\ndemo CDs, and laptops. This expenditure, I'm sure you realize, will\ncost the company hundreds of dollars, and I expect all of the promotional\nmaterial to be distributed.\n\nYou notice Hausman has copied the Director of the North American office on this e-mail.\nWhat do you do now?\n\nYour Task\n\nCreate a communication strategy to deal with this situation. Decide:\n\n- With whom will you communicate?\n- When?\n- For what purpose?\n- What medium should you use?\n- What should be the content of your message(s)?\n\nBe sure to factor in credibility and context.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.279 Management Communication for Undergraduates\nFall 2012\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}