{
  "course_name": "Managerial Psychology Laboratory",
  "course_description": "We function in our personal and professional lives based on knowledge and intuitions. Our intuition that we know a lot is very powerful. But sometimes intuitions are accurate and sometimes they are not; without research, it is hard to tell.\nThis course combines a few different goals: develop a critical eye for making inferences from data; be able to carry out simple data analysis; learn about managerial psychology; develop interesting new questions about managerial psychology and test these questions.",
  "topics": [
    "Business",
    "Management",
    "Organizational Behavior",
    "Social Science",
    "Psychology",
    "Business",
    "Management",
    "Organizational Behavior",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 1.5 hours / session\n\nRecitations: 1 session / week, 1.5 hours / session\n\nGoals\n\nThis class combines a few different goals: develop a critical eye for making inferences from data; be able to carry out simple data analysis; learn about managerial psychology; develop interesting new questions about managerial psychology and test these questions.\n\nGeneral Requirements\n\nBe prepared for every class\n\nSubmit your assignments on time (sorry, this is a large class and there will be no exceptions, so plan accordingly)\n\nDo well on the midterm and final exam\n\n(15.301 only) Conduct an independent research and submit related proposal and papers\n\n(15.310 only) Develop a business proposal based on managerial psychological concepts\n\nParticipate in 3 hours of experiments (out of class), or submit three short papers (5 pages each) analyzing a research stream of your choice in managerial psychology (get approval from your TA prior to writing the paper)\n\nNote\n: This is a large class. As a consequence, we ask you to ponder before you send us an email. If you have a question, please start by looking at the class's Web site on server. If you don't find an answer, ask your friends, next your TA, and only as a last resort, ask Professor Ariely.\n\nGrades\n\nFor 15.301: Undergraduate Section\n\nACTIVITIES\n\nPERCENTAGES\n\nMidterm\n\n20%\n\nFinal Exam\n\n20%\n\nGroup Problem Set\n\n10%\n\nIndividual Project (15% for the writing; 25% for the project)\n\n40%\n\nOral Presentation in Section\n\n10%\n\nComing to class, and reading the material will help you get a better grade in Midterm and Final Exam.\n\nFor 15.310: Graduate Section\n\nACTIVITIES\n\nPERCENTAGES\n\nMidterm\n\n20%\n\nFinal Exam\n\n20%\n\nIndividual Business Proposal\n\n40%\n\nOral Presentation in Section\n\n20%\n\nMidterm and Final Exam exclude material on T-tests and ANOVA; Coming to class, and reading the material will help you get a better grade.\n\n15.301 Individual Project\n\nFor this class, you are required to conduct an independent research project, involving the preparation of the research proposal, research design, data collection, data analysis and interpretation, and report writing. In addition, you will be asked to give a short 5-minute presentation of your research findings in your respective sections. Your research question can be based on any of the concepts covered in class, or any areas in managerial psychology you find interesting and important (discuss with your TA prior to writing the proposal).\nAll projects have to be approved by the Committee on the Use of Humans as Experimental Subjects (COUHES) at MIT before you can begin data collection\n. More details on COUHES applications will be provided later.\n\n15.310 Individual Business Proposal\n\nFor this class, you are required to prepare an individual business proposal of either a new product/service or improvements to an existing product/service. The subject of your proposal can be based on any of the concepts covered in class, or any areas in managerial psychology you find interesting and important (discuss with your TA prior to writing the proposal). In addition, you will be asked to give a 20-minute presentation of your business idea in your section.\n\nTextbooks (Note that you are responsible for\nall\nmaterial in the following three textbooks)\n\nCourse Reader\n\nMoore, David S.\nThe Basic Practice of Statistics\n. 3rd ed. New York: W. H. Freeman and Company, 1995. ISBN: 0716726289.\n\n(Online Statistics Reference: Hopkins, Will G.\nA New View of Statistics\n.)\n\nGilovich, Thomas.\nHow We Know What Isn't So\n. New York: Free Press, 1993. ISBN: 0029117062.\n\n(Read Chapters 1-7 before the Midterm, and the whole book before the Final Exam.)",
  "files": [
    {
      "category": "Resource",
      "title": "class_study.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/f8df76e809e893e5ec95a29c3ef48ca6_class_study.pdf",
      "content": "Fall 2004\n15.301/15.310 Managerial Psychology Laboratory\nClass Study Project\nDue: Nov 8, 2004 (Monday)\nFor this task, you have to download the following files from the server:\nx Class Study Survey.pdf: The standard survey form for the class study\nx Class Study Data.xls: An Excel template for you to enter your data\nFor this task, you are asked to do the following:\n1. Ask 25 people (non-students) to answer the survey.\n2. Enter all the data into the Excel template provided.\n1. On Nov 8, 2004 (Monday) email the Excel file to your TA. (Please rename the\nExcel file as follows: data_[your last name].xls, e.g. data_smith.xls)\nEnjoy!"
    },
    {
      "category": "Resource",
      "title": "class_survey.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/0245fe3982db04aec2c475cf07bf9d0e_class_survey.pdf",
      "content": "Dear Sir / Madam,\nWe are students from MIT collecting data for a class project on managerial psychology. Your participation is voluntary,\nand we will not ask you for any personally identifying information. This survey should take you 2-3 minutes.\nThank you for your participation\nHow would you describe your education (please circle one)?\nHigh school / Some college / Bachelors degree / Graduate degree / PhD / Post Doctoral\nMy profession is (please circle one)\nManagement / Business & financial operations / Computer & mathematical / Architecture & engineering /\nLife, physical, & social science / Legal / Education, training, & library / Arts, design, entertainment, sports, & media /\nHealthcare practitioner & technical / Healthcare support / Protective service / Food preparation & serving related /\nBuilding & grounds cleaning & maintenance /Personal care & service / Sales & related /\nOffice & administrative support / Farming, fishing, & forestry / Construction & extraction /\nInstallation, maintenance, & repair / Production / Transportation & material moving\nSex: Male / Female\nHow likely would you be to work 3 hours overtime in a week if you were offered a 5- hour salary for this effort:\n\nNot at all\nVery\nlikely\nlikely\nHow likely would you be to work all weekend (Saturday & Sunday) if you were offered a 3-day salary for this\neffort:\nNot at all\nlikely\n\nVery\nlikely\nHow likely would you be to work all weekend (Saturday & Sunday) if you were offered a 4-hour early release from\nwork every day in the following week:\nNot at all\nlikely\n\nVery\nlikely\nHow important is time off to you?:\nNot\nimportant\nat all\n\nVery\nimportant\nHow much are you looking forward to retirement?\n\nNot at all\nVery\nmuch\nMy yearly salary is about $ _____ ,000"
    },
    {
      "category": "Resource",
      "title": "couhes_guide.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/cbf7366662226a51548b8269d5555715_couhes_guide.pdf",
      "content": "Guidelines for getting your study approved by the Committee On the use of\nHumans as Experimental Subjects (COUHES)\nEach research project at MIT has to be approved by the Committee On the use of\nHumans as Experimental Subjects (COUHES). The importance of such a committee in\nall research institutes emerged as a reaction to experiments that placed human subjects at\nphysical and mental risks. Guarding the rights of experimental subjects is now an\nimportant part of the scientific process. MIT has a review procedure that is vastly\nsuperior to any other university that we are aware of, and we consider this to be an MIT\ntreasure. This is a public good that we all need to work to keep COUHES at their level of\nperformance - so please take your job seriously. Follow the guidelines below carefully,\nand provide sufficient detail to COUHES, so that your protocol could be approved with\nthe least possible hassle.\nIf you want to use this version of the 1\"5.301 COUHES quick form\" you can conduct one\nof the following types of studies (\"Paper and pencil\" based studies, \"Simple market\nexperiments,\" or \"games\"). If you want something different you might have to submit\na full proposal. Below is information about these three generic types of studies. Once\nyour COUHES application is ready (but not after the deadline), submit the cover letter\nand the forms of your questionnaires to your TA, who will get it to the COUHES office.\nNote that you cannot start collecting data until your protocol is approved by COUHES.\nNote: if you intent to post any recruitment flyers around campus to let people know\nabout your study, you will have to submit these as well together with your application.\n\"Paper and pencil\" based studies: General information.\nSuch studies are conducted by passing along questionnaires and asking people to return\nthem to a collection box. In your cover letter to COUHES describe the way you will\ndistribute and collect the questionnaires in sufficient detail, and how anonymity will be\nmaintained.\nWhen conducting a \"paper and pencil\" based studies never ask for the participants'\nnames or any other identifying information (email). You can ask for limited\ndemographic information if this is needed for your research (limit this information to the\nnecessary information).\nAt the top of the questionnaire please include the following statement:\n\"Thank you for participating in this study. Your participation is voluntary, you may\ndecline to answer any or all questions, and at any point you can decline further\nparticipation without adverse consequences. You will not be asked for your name or for\nother identifying information to assure the confidentiality and anonymity of this\ninformation.\n\"Paper and pencil\" based studies: Cover letter.\n\nName of the study: Effect of weather on happiness and hope.\nType of study: \"Paper and pencil\"\nPurpose of the study: To understand the effect of weather on happiness and hope.\nThe general procedure: In this study we will distribute questionnaires asking\nrespondents to indicate how happy and hopeful they are in general.\nDistribution and collection: The forms will be distributed at dorms and in the infinite\ncorridor. Once the respondents return the questionnaire, he or she will be asked to\ndeposit it into a box. The box will be clearly closed and taped to make it clear that the\ndata will not be examined for each person.\nOther confidentiality measures: In order to increase confidentiality, the data will be\nexamined, entered and analyzed only after all the data has been collected in the box -\nreducing the possibility of identifying and individual person. Once the data has been\nentered the original forms will be given to the TA of 15.301.\n\"Paper and pencil\" based studies: The questionnaire.\nHappiness\n\"Thank you for participating in this study. Your participation is voluntary, you may\ndecline to answer any or all questions, and at any point you can decline further\nparticipation without adverse consequences. You will not be asked for your name or for\nother identifying information to assure the confidentiality and anonymity of this\ninformation.\nOn the following scale, where 1 indicated \"not at all\" and 10 indicates \"very much,\" how\nhappy would you say you are right now? Please circle the corresponding number\n________________________________________________________________________\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\nNot at\nall\nVery\nmuch\nOn the following scale, where 1 indicated \"not at all\" and 10 indicates \"very much,\" how\nhopeful would you say you are right now? Please circle the corresponding number\n________________________________________________________________________\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\n\nNot at\nall\nVery\nmuch\nOn the following scale, where 1 indicated \"not at all\" and 10 indicates \"very much,\" how\nhappy would you say you are in general? Please circle the corresponding number\n________________________________________________________________________\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\nNot at\nall\nVery\nmuch\nOn the following scale, where 1 indicated \"not at all\" and 10 indicates \"very much,\" how\nhopeful would you say you are in general? Please circle the corresponding number\n________________________________________________________________________\n|\n|\n|\n|\n|\n|\n|\n|\n|\n|\nNot at\nall\nVery\nmuch\nPlease write down the date and time\nToday is (circle one): Monday, Tuesday, Wednesday, Thursday, Friday, Saturday.\nThe date is: ______________ Time of day is: ____________________\nThank you very much for your participation. Please fold this form and place it into the\nclosed box.\n\"Simple market experiments\": General information.\nThese studies are conducted much like market transactions where you offer participants\nto purchase something for a known price, or make choices among a few different options.\nIn these experiments you will change (manipulate) the prices between respondents and\nlook at the propensity to purchase. With such protocols you will not collect any personal\ninformation and you can only use the information that you observe (how long it took the\npeople to decide, were they in groups or by themselves etc.). Because you only\nobserving behavior there is no need for an explicit consent of the participants.\n\n\"Simple market experiments\" based studies: Cover letter.\nName of the study: Effect of price decrease to 0 on purchase.\nType of study: \"Simple market experiments\"\nPurpose of the study: To test the effects of 0-prices, in order to understand if the there is\na discontinuity around the price of 0.\nThe general procedure: In this study we offer students around campus a choice between\nbuying a more fancy chocolate for 18¢, a less fancy chocolate for 1¢ or nothing in one\ncondition, and a choice between buying a more fancy chocolate for 17¢, a less fancy\nchocolate for 0¢ or nothing in the second condition. Students who are interested in the\nchocolate will buy it and pay with their own money and ones who are not will not. We\nwill record the frequency of purchase as a function of the price conditions and the gender\nof the buyers.\nLocation of data collection: The student center and the infinite corridor\nConfidentiality measures: No individual information will be recorded.\n\"Games\" based studies: General information.\nSuch studies are conducted by creating a few different versions of a game and measuring\nhow performance in the game changes as a function of the different versions of the game.\nParticipants can play the game for points or for money. The game can be a computer\ngame, a card game, or you can even use an existing game. Computer games are in most\ncases the best approach since they can help ensure confidentiality.\nIn your cover letter to COUHES describe where you will ask participants to play the\ngames, and how anonymity will be maintained. When conducting \"game\" based studies\nnever ask for the participants' names or any other identifying information (email). You\ncan ask for limited demographic information if this is needed for your research (limit this\ninformation to the necessary information).\nAt the start of the game please include the following statement:\n\"Thank you for participating in this study. Your participation is voluntary, at any point\nyou can decline further participation without adverse consequences. You will not be\nasked for your name or for other identifying information to assure the confidentiality and\nanonymity of this information.\n\"Games\" based studies: Cover letter.\n\nName of the study: Keeping doors open.\nType of study: \"Games\"\nPurpose of the study: To test if individuals have a tendency to keep options open even\nwhen the expected value of such actions is negative.\nThe general procedure: In this study we will ask participants to log into the server and\nplay a game in one of two different versions.\nData collection: We will set a few laptops at the student center and in the infinite\ncorridor, and post a sign to ask students passing by to participate in the study. We might\nalso post signs around campus and ask students to log into the server and participate.\nSince this study involves payment for performance, we will ask all participants to print\nthe last screen of the game (which shows the amount of money they made) and come\nwith it to our booth at the student center to get paid.\n\"Games\" based studies: The game.\nThe game starts with a screen that reads as follows: \"Thank you for participating in this\nstudy. Your participation is voluntary, at any point you can decline further participation\nwithout adverse consequences. You will not be asked for your name or for other\nidentifying information to assure the confidentiality and anonymity of this information.\nNext participants will be given the instructions for the game, and the game will start.\nIn this game respondents will have three games, each with its own payment distribution.\nParticipants will have 100 clicks to spend and their goal is going to be to make as much\nmoney as possible. The two versions will differ on the availability of the doors. In one\nversion all three doors will be available during the entire game, while in the other version\na door that has not been clicked for the past 12 clicks will disappear and will be no longer\navailable.\nSample screen shots of the second version of the game are presented below:\n\nAt the end of the game, participants will be shown their total earnings, asked to print the\nscreen as an evidence of their performance and they will be given instructions of how to\ncontact the experimenters for payment."
    },
    {
      "category": "Resource",
      "title": "final_rep_draft.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/166d25d7c1d6f6ee6746332c690eb355_final_rep_draft.pdf",
      "content": "Managerial Psychology 15.301\nPage 1/2\nFall, 2004\nIndividual Research Project:\nDraft of Final Report\nDue Date: October 25th, 2004 (Monday)\nThe Task\nPrepare a draft of the final report on your individual research project without the results (unless you've\nalready collected data), saying how you would interpret your results if they turn out to be as you\nexpected, and what you would conclude if they don't match your hypothesis.\nGeneral Structure\nYou can structure your paper in what ever way seems most appropriate, but you should aim to include\nthe following:\nx The title of the project\nx Your name\nx Abstract\nx Introduction (i.e. your research question, motivation)\nx Literature Review (i.e. discuss findings from prior research related to your research question,\nhighlight how they are related to your study and what original contribution you might be able to\nmake)\nx Research Design\n- Participants\n- Method/Procedure\n- Independent/Dependent Measures\n- Expected results (or actual results if you've already collected data)\n- Discussion (i.e. interpretation of the expected results or failure to obtain these results)\nx Conclusion\n- Summary of results\n- Interpretation of the results in terms of your introduction\n- Limitations of your study\n- Suggestions for further research\nLength\nThere are no fixed requirements on the length of this draft, but try to target something around 15 pages\n(Times New Roman 12pt font, double-spaced) for the final project.\nReferences for your Literature Review\nLiterature reviews are important because they help you frame you research questions, and think of the\nimplications of your findings (plus, it will be part of your final grade).\nBesides the Internet and Dewey Library, MIT does have subscriptions to many online journals. The\nfollowing are example of some e-journals that you might find helpful:\n1.\nhttp://www.jstor.org/\nCollection of journals in different disciplines. Look under \"Business\" to find the management-\noriented journals. You can read and download entire papers at this website.\n\nManagerial Psychology 15.301\nPage 2/2\nFall, 2004\n2.\nhttp://www.psycinfo.com/\nThis is useful if you're looking for more psychologically-oriented papers/references. However, you\nonly have access to the abstracts but not the actual papers.\n3.\nhttp://www.blackwell-synergy.com/servlet/useragent?func=showIssues&code=psci\nPsychological Science has short but informative and academic papers."
    },
    {
      "category": "Resource",
      "title": "Final_rubric.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/a8041bc01d43538ec53be4c7a7009702_Final_rubric.pdf",
      "content": "15.301 Managerial Psychology\nWriting Grade Summary\n\nSTUDENT\nTOTAL SCORE\n\nOBJECTIVE\n\nCOMMENTS\nPOINTS\n1. Professional presentation\n\n/20\n- Did the student include a\nproposal, first, and final\ndraft?\n\n- Is the final draft stapled or\notherwise fastened?\n\n- Are the pages numbered?\n\n- Is the paper generally free\nfrom typos?\n\n- Is the hierarchy of sections\nand subsections clear?\n\n2. Completeness of information\n\n/20\n- Introduction\n\n- Literature review\n\n- Methods\n\n- Results\n\n- Conclusion\n\n3. Writing quality\n\n/20\n- Organization of paper\n\n- Paragraph development\n\n- Clarity of sentences\n\n- Definitions of terms\n\n4. Self-assessment\n\n/20\n- Did the student answer the\nquestions completely?\n\n- Was the tone of the answers\nconstructive and\nprofessional?\n\n5. Improvement over semester\n\n/20\n- Clarity of ideas\n\n- Focus of research\n\n- Warrant and evidence for\nargumentative claims"
    },
    {
      "category": "Resource",
      "title": "instruct_group_t.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/85bf0cd7239461cf340e827cae15e4a0_instruct_group_t.pdf",
      "content": "Fall 2004\n15.301 Managerial Psychology Laboratory\nTask for Wednesday, October 13\n\"Submit survey (in pairs), collect 20 respondents, and suggest improvements\"\nFor this task, you are asked to do the following:\n1. Choose a partner (from your same recitation section) to work on this assignment.\n2. Create a set of questions (2 to 4 questions) that will evaluate how satisfied MIT\nstudents are with an important aspect of their life.\n3. Ask 20 students to answer your questions.\n4. Calculate satisfaction as reflected from your questionnaire (use means to describe\nyour results, and if you want, you can use other statistical descriptors as well).\n5. On Wednesday, October 13 submit to your TA a short paper that includes the\nfollowing:\na. In one paragraph, describe the reason(s) why you selected the aspect of\nlife at MIT for your questionnaire - why is this aspect so important.\nb. Your questionnaire.\nc. The results of your questionnaire.\nd. One paragraph describing what you have learned from the data collection\nprocess and how the questionnaire could be improved (if your\nquestionnaire is perfect, there is no need to include parts d or e).\ne. A revised version of the questionnaire.\nEnjoy!"
    },
    {
      "category": "Resource",
      "title": "1page_proposal.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/c9c3acce1235025b4337a42be72b1eb3_1page_proposal.pdf",
      "content": "Fall 2004\n15.301 Managerial Psychology Laboratory\nTask for Monday, September 20\n\"Submit 1-page proposal for your project\"\nFor this task you are asked to do the following:\n1. Choose a research question for your individual project. (The subject of your\nproposal can be based on any of the concepts covered in class, or anything you\nfind interesting/important.)\n2. Design an experiment to test your research question. Consider the independent\nvariables and dependent variables in your research question, and the measures that\nyou need to operationalize your constructs.\n3. Discuss with your TA prior to writing the proposal.\n4. On Monday, September 20, submit to your TA a short one-page proposal that\nincludes the following (see attached sample):\na. Title of Project\nb. Research Question - A short description of what you want to test\nc. How - A short description of your experimental design; you should\nidentify the independent variables and dependent variables in your design,\nhow you plan to manipulate your independent variables, and what\ndependent measures you have to record\nd. Assumption(s) - Any assumptions you have to make in order for your\nexperiment to be an adequate design to address your research question\ne. Who Cares - Explain why you think your research question is interesting\nand important\nf. Expected Results - your predicted results of the experiment\n\n15.301 Managerial Psychology Laboratory\nIndividual Project Proposal\nName: Dan Ariely\nTitle of Project: The effect of 15.301 on long-term creativity\nResearch Question: 15.301 provide unique mind-expanding opportunities for students at\nMIT within a lecture style that is easy going and fun. Because the class is so much fun,\nwe speculate that students taking the class can wrongly judge the class as being too\n\"lightweight\" and dismiss the extent to which they are gaining valuable information from\nthe class. On the other hand, we suspect that a few years after graduation, 15.301 will be\nremembered more favorably, and so will the material presented.\nHow: In this study, we will compare attitudes for 15.301 with attitudes to other large\nclasses at MIT (8.01, 6.01 etc.), and we will compare these attitudes between two groups:\n1) students who took 5.301 last semester, 2) past students (3 - 8 years out of MIT). In\naddition to these subjective evaluations of the class's value, we will also conduct an\nobjective test of the class material (multiple choice) and will give this exam to all the\nparticipants.\nAssumption: Since 15.301 was taught by Professor Allen for as long as history has been\nrecorded, we assume that for the groups of participants, the level of instruction was equal\n(i.e. Professor Allen did not get better or worse in this timeframe).\nWho Cares: This results are clearly important to 15.301. In addition, the results are also\nimportant in general, because they test the question of whether students can rightly judge\nwhat classes are good for them at the time they are taking them, the relationships between\nshort and long-term evaluations and the relationships between objective and subjective\nevaluations.\nExpected Results:\n5.5\n6.5\n7.5\n8.5\n9.5\nExpected Results\nCurrent Students\nPast Students\nStudent Type\nScores\nSubjective Evaluation\nObjective Test"
    },
    {
      "category": "Resource",
      "title": "final_report1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/5042f17ef878ab5a613c0a15ed9159ee_final_report1.pdf",
      "content": "Managerial Psychology 15.301\nPage 1/2\nFall, 2004\nIndividual Research Project:\nFinal Report\nOriginal Due Date: November 22, 2004 (Monday), 5pm\nExtended Due Date: November 29, 2004 (Monday), 5pm\nStudents who hand in on or before the original deadline will get a bonus of five points. Late\nsubmissions will not be accepted. All submissions must be complete (see below for submission\nrequirements.)\nGeneral Structure\nYour final report should include the following components:\nx The title of the project\nx Your name\nx Abstract\nx Introduction (i.e. your research question, motivation)\nx Literature Review (i.e. discuss findings from prior research related to your research question,\nhighlight how they are related to your study and what original contribution you might be able to\nmake)\nx Research Design\n- Participants\n- Method/Procedure\n- Independent/Dependent Measures\n- Results\n- Discussion (i.e. interpretation of the results or failure to obtain these results)\nx Conclusion\n- Summary of results\n- Interpretation of the results in terms of your introduction\n- Limitations of your study\n- Suggestions for further research\nLength\nThere are no fixed requirements on the length of this draft, but try to target something around 15 pages\n(Times New Roman 12pt font, double-spaced) for the final project.\nReferences for your Literature Review\nLiterature reviews are important because they help you frame you research questions, and think of the\nimplications of your findings (plus, it will be part of your final grade).\nBesides the Internet and Dewey Library, MIT does have subscriptions to many online journals. The\nfollowing are examples of some e-journals that you might find helpful:\n\nManagerial Psychology 15.301\nPage 2/2\nFall, 2004\n1.\nhttp://www.jstor.org/\nCollection of journals in different disciplines. Look under \"Business\" to find the management-\noriented journals. You can read and download entire papers at this website.\n2.\nhttp://www.psycinfo.com/\nThis is useful if you are looking for more psychologically-oriented papers/references. However,\nyou only have access to the abstracts but not the actual papers.\n3.\nhttp://www.blackwell-synergy.com/servlet/useragent?func=showIssues&code=psci\nPsychological Science has short but informative and academic papers.\nSubmission Requirements\nA complete submission will include the following:\n1. Two hard copies of your final report\n2. Self-evaluation form\n3. Draft report with writing TA's comments\n4. Four-page proposal with writing TA's comments"
    },
    {
      "category": "Resource",
      "title": "mid_prac_ques.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/fede174e4b7a10be582250b897c909b1_mid_prac_ques.pdf",
      "content": "15.301/15.310 Managerial Psychology, Fall 2004\nPractice Questions for Midterm Exam\nPart I. Multiple-Choice Questions\n1. The idea that expectations influence perceptions is\na.\nApparent when we consider our ability to perceive objects very fast.\nb.\nDue to the interplay between short and long term memory.\nc.\nMeans that we see and hear what we expect to see and hear.\nd. Creates the phenomenon of false memories.\n2. Which one of the following is not a self-control problem?\na.\nDifficulty to commit to a diet\nb.\nDifficulty to commit to saving\nc.\nLack of investment in education\nd. Procrastination\n3. Which of these statements is not correct about long term memory?\na.\nThe information and its source are stored separately.\nb.\nWe are sometimes able to keep information for a very long time.\nc.\nLong term memory can be instrumental in helping us construct new memories.\nd. Long term memory links us with our past.\n4. The standard normal distribution\na.\nApproaches the binomial distribution as the sample size increases.\nb.\nHas mean 0 and standard deviation 1.\nc.\nHas a median that is different from its mean and mode.\nd. Is symmetric but with two modes.\n5. In general, people are more likely to seek out information that\na.\nForms an exception to their current theory.\nb.\nExpands their knowledge to make a fully informed decision\nc.\nConfirms their hypothesis\nd. Increases the external validity of their observation.\n6. According to Martin Gardner, which are the ways in which the pseudo-scientist's paranoid tendencies are likely\nto be exhibited? (Check all that apply.)\na.\nHe considers himself a genius.\nb.\nHe believes himself unjustly persecuted and discriminated against.\nc.\nHe regards his colleagues as ignorant blockheads.\nd. He is incompetent in any field of science.\ne.\nHe often has a tendency to write in complex jargon.\n7. Among many possible effects that could have caused the findings in Pennebaker et. al. (1979), which particular\nconfound did the authors specifically mention in their paper?\na.\nAlcohol consumption\nb.\nUnclear judgment of attractiveness\nc.\nMere exposure\nd. Change of people in the crowd\ne.\nThey didn't mention any particular problem.\n\n8. The equation P(B|A) =P(B) is true if the two events, A and B, are\na.\nEqual\nb.\nDisjoint\nc.\nIndependent\nd. Conditional\ne.\nVery unlikely\n9. Thomas Gilovich argues that optimism and high levels of self-confidence\na.\nCan result from unconscious implantations of false memories.\nb.\nAre dysfunctional adaptations to difficult environments.\nc.\nMay reflect biased and self-serving beliefs.\nd. Are useful mechanisms of adaptation to competitive situations.\ne.\nAre common among high performing individuals with high levels of self-esteem.\n10. Which of the following situation is not relevant or false for a binomial setting?\na.\nThe probability for success is the same for all observations.\nb.\nThere are a fixed number of observations.\nc.\nThe observations have to be dependent.\nd. We only have two different categories for the observations.\n11. Although there were relatively fewer students pursuing Computer Science and Engineering, Kahneman and\nTversky (1972) found that Tom W., described as a dull but highly competent graduate student, was more likely\nto be a student of Computer Science and Engineering than other more popular disciplines e.g. Social Sciences\nand Medicine. This finding is consistent with the use of which decisional heuristic in making judgments under\nuncertainty?\na.\nAvailability\nb.\nRepresentativeness\nc.\nIllusory Correlation\nd. Concreteness\ne.\nAnchoring\n12. Emotions are not\na.\nFast\nb.\nTriggered automatically\nc.\nTransitory\nd. The main cause of behavior\n13. The dialog between the dianetic therapist and the patient in Martin Gardner's chapter \"Dianetics\" has a lot in\ncommon with\na.\nThe dialogs between patients and their therapists who help them to recover memories of alien\nabduction.\nb.\nThe dialogs between mediums communicating with clients' dead loved ones and the clients.\nc.\nA and B\nd. None of the above.\nPart II. Short Questions\n1. If you toss 6 coins and you get 5 heads. What is the probability of this event? Would you say that the coin is\nmore likely to fall on head (Yes/No)?\n2. Based on the Alien abduction paper (Clancy et. al. 2002), what are the psychological mechanisms that can cause\npeople to believe in alien abduction?"
    },
    {
      "category": "Resource",
      "title": "writing_advice.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/829e239c59aa3aa484241c6f3fa3135c_writing_advice.pdf",
      "content": "Writing as Thinking\n\nFinding a Topic:\nNotes from The Craft of Research\nResearch = Problems to be solved\nFacts are helpful only in context\nProvide new perspective (the dreaded \"so what?\")\n\nNotes from Craft (cont'd)\nWhy Write?\nRemember\nUnderstand\nGain perspective\nTest your ideas against other perspectives\nAnticipate audience's questions\n\nAudience\nWho is your audience?\nPrimary\nCourse instructor\nWork supervisor\nResearch advisor\nSecondary\nFuture student\nCo-worker\nOthers doing similar work\n\nYou Cannot Avoid Uncertainty\nKeep writing about your topic\nNotes\nOutlines\nDiagrams\n\"Horrible Drafts\"\nBreak process into manageable steps\n\nGetting Ready to Write\n1.\nFind a specific/manageable topic\n2.\nGenerate questions, find some that intrigue you\n3.\nDetermine evidence readers will expect\n-\nHard data?\n-\nPrimary sources?\n4.\nLocate research sources\n\nYour Topic Will Evolve\nYour argument will take shape gradually\nSome research sources will prove more useful\nthan others\n\nHow to Get Started\nGive your project a working title\nFocus on the \"how\" and \"why\" questions\nUse unknown areas to construct a \"to do\" list\n\nTime Management\nOutline the small steps\nTopics and subtopics\nArticles you have found and would like to read\nComplete the tasks as you are able to (not\nnecessarily in list order)\n\nTime Management (cont'd)\nTry to write every day (or at regular times)\nDon't judge your writing -- be curious instead\nPace yourself and allow time for real life\n\nHow to Keep Going\nFind articles you like and analyze them\nWhat does the author do well?\nWhat would you like to emulate?\nAsk for help\nFrom friends/colleagues\nFrom the Writing Center\n\nTechnical/Grammatical Tasks\nIdentify the most important sentences in your\ndrafts\nAsk whether they communicate your point\neffectively\nImprove the verbs\nParaphrase quotations and integrate your own\nanalysis"
    },
    {
      "category": "Resource",
      "title": "c_01_intro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/14ceaff6b6b89c243b22beabb219fdc1_c_01_intro.pdf",
      "content": "15.301 / 15.310\n\nManagerial\nPsychology\n\nWelcome !\n\nWhat is this class?\nCritical thinking about data\nManagerial Psychology\nData analysis\nResearch design & execution\n\n15.301 & 15.310?\n\nTentative syllabus\nupdates versio\n\nn on server\n\nWhy research in\nPsychology?\nDon't we know it all?\n\nIntuitions about\n\nNo\nFA\n\nNo\nMiss\nCR\nTrue state of\nYes\nBeliefs\nabout\nYes\nHit\n\nA short exercise\n\nValidity of intuitions\nExamples:\nNaive beliefs\nPenn & Teller\n\nSummary\nWe function based on our knowledge and intuitions\nIn our personal life and in our professional life\nSometimes intuitions are accurate and sometime they\nare not!\nWithout research it is hard to tell!"
    },
    {
      "category": "Lecture Notes",
      "title": "lec1_why.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/eaf42e137dd8dfb74f49d396c97ffe22_lec1_why.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nLecture 1: Why Research in Psychology?\nIntroduction to the class (see slides):\nWhy research in psychology? Don't we know this stuff by just being people? We see\neach other all day and we interact and interpret each other just fine. People know a lot,\nwhy do we need to do research? Perhaps other places, other countries, would be\ndifferent, we don't know as much about other cultures, but ourselves?\nOur intuition that we know a lot is very powerful.\nBut our knowledge of psychological situations can be divided into 4 categories (see\nslide), including a correct rejection (CR) and correct assumption.\nWe may believe something but it turns out it is not true, we may not believe the truth (a\nfalse assumption), or we may not believe something that is true.\nFor example, what if we think that people have no trouble with savings, that they manage\ntheir money well in general? We do not even think to look, because we assume everyone\nis reasonable. It could turn out to be a missed opportunity if this is not true.\nOr what if we believe that people understand safe sex and the downsides of unprotected\nsex? Or what if we assume that they understand information given to them in a lecture\nformat, but it turns out they don't get the information from a lecture (they need some\nother way)? Then our efforts have no effect.\nWe need to research to find out the answers.\nExercise:\nEveryone is given a handout that has 20 boxes, each with several numbers in them. They\nare to find the ones in each box that add up to 10 exactly, and check a box underneath if\nthey are successful. They are given a limited time to complete as many as they can.\nThey are told they will receive 50 cents for each answer they find. People are told to do\none of three things: 1. Turn in the handout, with solved boxes checked. 2. Turn in, on a\nseparate sheet of paper, the number of boxes solved. 3. Before you begin, sign an honor\ncode saying that you will not cheat, then turn in a separate sheet of paper giving the\nnumber of boxes you solved.\nVideo:\n\"Talking to the Dead.\" Episode 1. Penn & Teller: Bullshit! Directed by Randall\nMoldave, Star Price, Tim Rogan, Scott Schafer. Showtime, 2004."
    },
    {
      "category": "Resource",
      "title": "c_02_logic.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/c95eeda84dfb9126c63168665ff3614d_c_02_logic.pdf",
      "content": "15.301\nClass #2\n\nAgenda for today\nGo over the homework problems that\nwere due today\nIntuitive inference of data &\ninformation\nWhat makes a good project\nExample -- study from last week\nSome final questions\n\nCritical thinking\n\nCritical thinking\n- Observing and recording data is the\ncentral aspect of social science\n- Sometimes, the data at hand is not ideal!\n- The question we will start addressing\ntoday is what can we learn from different\ntypes of data.\n\nQuestions\n- Please provide an answer to each of the\nfollowing questions.\n-\n- For each, indicate:\n- what you believe in\n- and why.\n\nQ1: Cholesterol & heart diseases\n- A large study in Framingham found that people\nwith high cholesterol levels are much more likely\nto have heart attacks\n- It was also found that diets and medication can\nreduce cholesterol\n- Physicians recommendations for diets and\nmedications reduced heart attacks only by a small\nnumber and did not reduce mortality!\n- What is going on?\n\nQ2: Uri Geller\n- In one TV show Uri Geller told the viewers\nthat he will activate broken clocks in their\nhomes.\n- After Geller concentrated, many people\ncalled in to report that their clocks started\nworking\n- Does this means that Uri Geller had such\npowers? How would you test it?\n\nQ3: Reward and punishment\n- It has been well documented that\nrewarding good behavior is more effective\nthan punishing bad behavior.\n- It was also observed that in flight school\ncomplementing excellent performance is\nusually followed by bad performance, while\ncriticizing bad performance is usually\nfollowed by better performance.\n- What is going on?\n\nQ4: The \"hot hand\"\n- Many people believe that athletes (such as\nbasketball players) can be in a \"hot\" state\n(for example have a \"hot hand\"), such that\nthey are more likely to score after they\nhave just scored\n- The hot hand can have many reasons\n- Such as ....\n- But, is it real?\n\nQ5: Discrimination?\n- UC Berkeley in the fall of 1973\n- 8,442 men and 4,321 women applied\n- 44% of the men and 35% of the women\nwere admitted\n- The quality of the applicants was the\nsame\n- Is this discrimination?\n\nQ6: Stock predictions\n- One stock broker provides monthly\npredictions that correctly predicted 7 of the\n9 downturns in the economy over the past\n3 years\n- Is he an expert?\n- Do you want to invest with this person?\n\nQ7: Medical diagnosis\n- Imagine that a blood test identified a\nperson with a rare disease (base rate of\n0.1% in the population).\n- This test identifies as a positive result\n98% of the people who have the disease\nbut also 4% of the healthy population.\n- Given this performance, how likely is it that\nthe person who was identify as have the\ndisease, indeed has it?\n\nQ8: \"The bible code\"\n- It turn out that if you start from the last\nletter of the first word in the bible and\ncount every 50th letter, you get the word\n\"TURA\" -- which means bible in Hebrew\n- There are many such examples of hidden\nmeanings in the bible and this has been\nsuggested as evidence that the bible was\nnot written by men.\n- What do you think?\n\nEvidence....\n- We encounter evidence like those\npresented here every day.\n- We make inferences based on such data\nand sometimes even make\nrecommendations.\n- We should try to think critically about data,\nwhether it is research, our research, or\njust the news.\n\nCorrelation & causation\nEvery day we see in the news claims such\nthe ones below. These could be reliable\nstatistical relationships, but are they causal?\n1. Better weather makes people happier\n2. Boys who mature later suffer from depression\n3. Runners outlive other athletes\n4. Kids who were breast feed have a higher IQ\n5. There is a negative correlation between # of\nhours watching TV and grades in school\n\nExamples:\nFor each statement provide the causal\nstory:\n1. Women who exercise regularly have\nless natural miscarriages.\n2. Famous conductors in the US live about\n7 years longer than the average\n3. Students who come to all the classes do\nbetter\n\n- Famous conductors (C) in the US live\nabout 7 years longer (L) than the\naverage.\nCorrelation & causation\nC\nL\nC\nL\nE\nC\nL\nE\nC\nL\n\nInterpreting correlations\n- Sometime we have very strong causal\nmodels (good weather causes happiness,\netc).\n- Sometime strong models can be wrong\n- Running prevents heart attacks (making\npeople run can cause heart attacks).\n- Watching TV decreases learning\n\nSo???\n- The only way to draw valid conclusions is\nto have a control group!\n- In the Uri Geller case we should have\ntested how many clocks were observed to\nstart working 1) on any other hour, 2) if\nsomeone else concentrated, etc.\n- In many cases, the only way to have a\ngood control group is to conduct an\nexperiment!\n\nSelf-selection!\n- Runners select themselves\n- Famous conductors\n- Berkeley\nMen\nWomen\nApply\nAccepted\nApply\nAccepted\nA\n1,000\n60%\n60%\nB\n1,000\n30%\n1,000\n30%\nBoth\n2,000\n1,100\n45%\n33%\n\n5 year cholesterol experiment\n- P(death|no treatment) = 21%\n- P(death|treatment) = 21%\n- What about regularity?\n- P(death|regularity) = 15%\n- P(death|non regularity) = 24.6%\n- But now we have self selection again\n- For regulars P(D|T)= P(D|no T) ~ 15%\n- For non regulars P(D|T)= P(D|no T) ~ 26%\n\nExperiments\n- Are important but not a perfect method\n- They are susceptible to:\n- Placebo\n- The Hawthorne effect\n- Self fulfilling prophecies\n- Desire to cooperate\n\nPlacebo I\n- In 1794 Gerbi discovered that by\nsqueezing a certain worm between the\nthumb and the finger of the right hand,\nand placing the fingers on a painful tooth,\nthe pain went away for a year.\n- Hundreds of patients were treated with\nthis medication, and 68% reported no\npain for a year!\n\nPlacebo II\n- In a study on the effects of birth control,\nthree groups were used\n- Pills with warning of side effects\n- Placebo without warning of side effects\n- Placebo with warning of side effects\n- Group #2 reported 6% side effects\n- Groups #1 & #3 reported 20% side effects\n\nPlacebo III\n- Old French medical book suggest to use\nnew medicines as fast, when its healing\npower is the strongest\n- Probably when the physician believes\nin it the most\n\nPlacebo V\n- The Hawthorne effect\n- In 1924 a study was done on\neffectiveness at work\n- The recommendation was to improve\nlighting condition\n- This helped for a while but not long\nterm\n- Other changes had the same effect ....\n\nPlacebo -- summary\n- Placebo are real and strong effects\n- Threatens the conclusions of many\nexperiments\n- Important to have good controls\n- Placebo is real:\n- Opioids\n- Sensitivity\n- Attention\n\nSelf fulfilling prophecies\n- Teachers who are told that some kids are\nvery smart, find that these kids get better\ngrades\n- Researchers who believed that they have\ngenetically inferior rats found them to have\na lower performances\n- Smart Hans ...\n\nDesire to cooperate\n- In many cases subjects want to help the\nexperimenter.\n- If you tell subjects what is your\nhypothesis they will help you find it..\n- This is why we prefer blind experiment\n- Even better are double blind experiments\n- Computer controlled experiments are\nanother approach.\n\nSome answers\n\nQ1: Cholesterol & heart diseases\n- A large study in Framingham found that people with high\ncholesterol levels are much more likely to have heart\nattacks\n- It was also found that diets and medication can reduce\ncholesterol\n- Physicians recommendations for diets and medications\nreduced heart attacks only by a small number and did not\nreduce mortality!\n- What is going on?\nNot clear. Maybe the link is not causal\n\nQ2: Uri Geller\n- In one TV show Uri Geller told the viewers\nthat he will activate broken clocks in their\nhomes.\n- After he concentrated, many people called\nin to report that their clocks started working\n- Does this means that Uri Geller had such\npowers?\nText\nNo, he was a fraud.\n\nQ3: Reward and punishment\n- It has been well documented that reward good\nbehavior is more effective than punishing bad\nbehavior.\n- It was also observed that in flight school\ncomplementing excellent performance is usually\nfollowed by bad performance, while criticizing\nbad performance is usually followed by better\nperformance.\n- What is going on?\nRegression to the mean\n\nQ4: The \"hot hand\"\n- Many people believe that athletes (such as\nbasketball players) can be in a state called\n\"hot hand.\"\n- They are more likely to score after they\nhave just scored\n- The hot hand can have many reasons\n- But, is it real?\nIt is not real\n\nQ5: Discrimination?\n- UC Berkeley in the fall of 1973\n- 8,442 men and 4,321 women applied\n- 44% of the men and 35% of the women\nwere admitted\n- The quality of the applicants was the\nsame\n- Is this discrimination?\nNot necessary -- \"the Samson paradox\"\n\nQ6: Stock predictions\n- One stock broker correctly predicted 7 of\nthe 9 downturns in the economy over\nthe past 3 years\n- Is he an expert?\n- Do you want to invest with this person?\nWhat about the other predictions?\nWhat if this person said \"down\"34 times?\n\nQ7: Medical diagnosis\n- Imagine that a blood test identified a person with\na rare disease (base rate of 0.1% in the\npopulation).\n- This test identifies as a positive result 98% of\nthe people who have the disease but also 4%\nof the healthy population.\n- Given this performance, how likely is it that the\nperson who was identify as have the disease\nindeed has it?\n0.0239%\n\nQ8: \"The bible code\"\n- It turn out that if you start from the last letter of\nthe first word in the bible and count every 50th\nletter, you get the word \"TURA\" -- which means\nbible in Hebrew\n- There are many such examples of hidden\nmeanings and this has been suggested as\nevidence that the bible was not written by men.\n- What do you think?\n\"War and peace by Dostoyevsky\nshows the same effects\n\nEvidence....\n- We encounter evidence like those\npresented here every day.\n- We make inferences based on such data\nand sometimes even make\nrecommendations.\n- We should try to think critically about data,\nwhether it is research, our research, or just\nthe news.\n\nSummary\n- People are bad measurement devices\n- We observe and infer \"rules\" where there are non!\nCorrelations / causation\nSelf-selection\nPlacebo / the Hawthorne effect\nSelf fulfilling prophecies\n- Statistics and research methods are here to\nprotect us against ourselves!\n\n- A Prayer Before Dying (story in Wired magazine)\n- In July 1995, back when AIDS was still a death sentence,\npsychiatrist Elisabeth Targ and her co-researchers enrolled 20\npatients with advanced AIDS in a randomized, double-blind pilot\nstudy at the UC San Francisco Medical Center. All patients\nreceived standard care, but psychic healers prayed for the 10 in\nthe treatment group. The healers lived an average of 1,500 miles\naway from the patients. None of the patients knew which group\nthey had been randomly assigned to, and thus whether they were\nbeing prayed for. During the six-month study, four of the patients\ndied - a typical mortality rate. When the data was unblinded, the\nresearchers learned that the four who had died were in the control\ngroup.\nAll 10 who were prayed for were still alive.\nReading some more:\n\nAgenda for today\nGo over the homework problems that\nwere due today\nIntuitive inference of data &\ninformation\nWhat makes a good project\nExample -- study from last week\nSome final questions\n\n3 Conditions\nno lying\n+\nlying &\nhonor code\n+\nlying\n\nExamples\n\nno lying\nlying\nlying & honor code\n4.2\n6.8\n3.3\n# of problem Solved\n23 SS\n22 SS\n65 SS participated in total, 6 surveys were discarded\n4 SS reported\nhaving solved\nall 20!\n14 SS\n\nWhat are good questions?\nApplied or theory?\nApplied meaning you are trying to\nestimate particular parameters\nExamples: Politeness, opening doors, etc.\nTheory meaning you are trying to\nunderstand a directional effect\nExamples: Politeness, opening doors, etc.\n\nWhat are good questions?\nApplied or theory?\nApplied is more specific, theory is more general\nEngineering vs. Science\n\"There is nothing more practical than a good\ntheory\" (Kurt Levin)\nAt what stage of product development is each more\nappropriate?\nWhen is represented sampling more important?\nWhen is exact implementation more important?\n\nWhat are good questions?\nRelevant is a good criteria\nBut relevant to who?\n\"Big\" is a good criteria\nMore general (theoretical) questions\nare likely to be \"larger\" & more\nrelevant\n\nEthnics in research\nThere have been a lot of cases of abuse\nMedical cases where they gave people different\ndiseases.\nShaking basic beliefs\nPhilip Zimbardo's jail experiment\nStanley Milgram's Electrical shocking experiment\nThe Human subject review board COUHES is the\nlocal branch that is in charge of ethical behavior\ntoward subjects\nURL: http://web.mit.edu/committees/couhes/\n\nBeing wrong\nIt is fine (good?) to be wrong\nThe important think is knowledge\nIf you are wrong, try to figure out\nwhy. Hypothesis or method?\nIt is good to be wrong\ntry to venture out, take risks\n\nExercise in generating ideas\nIn small groups propose questions you\nare interested in finding the answers for.\nPractice \"armchair\" psychology\nThink of your own weird behavior (and\non that of the people around you).\nObserve, introspect\nAlso name 3 \"bad\" (useless) thins to test\n\nAgenda for today\nGo over the homework problems that\nwere due today\nIntuitive inference of data &\ninformation\nWhat makes a good project\nExample -- study from last week\nSome final questions"
    },
    {
      "category": "Lecture Notes",
      "title": "lec2intuition.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/01a2a62725f2fb7c6763acef5835ff09_lec2intuition.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nLecture 2: The Validity of Intuitions\nIntroduction:\nWe are beginning recitation sections this week. Topic: generating ideas for your project.\nWe have five wonderful TA's, we will assign you randomly: first row with first TA, 2nd\nrow with 2nd TA, etc...\nPlease go to the server, we will post all of the class information there, including where we\nare meeting. Friday will be our 1st experimental session. You don't have to come this\nFriday, but you need to participate in 3 hours of experiments over the semester.\nToday: go over the homework, intuitions, data information, what makes a good project,\nand answer any final questions.\nPluralistic ignorance: when you sit in a big class and you don't understand, you assume\neveryone else understands when people are quiet. The problem increases with class size.\nRaise your hand! They are suffering from pluralistic ignorance. Experiments have been\ndone where smoke is piped into a room of people. The bigger the group, the longer it\ntakes for them to leave the room. There are lots of dumb questions, but participate!\nNew Yorker cartoon. Question: what kind of inferences can we make from data, what\nare common mistakes?\n8 questions: Correct? Incorrect? Why?\n(see lecture notes)\nQ1: conflicting information\nQ2: Uri Geller - how would you test it?\nQ4: \"hot\" if you shoot a basket: There is a sense that the next shot has higher\nprobability of going in. What is going on?\nStudent responses:\n-Player has focus\n-Increased confidence having made a shot\n-Practice - each try = higher probability\n-Placebo effect - if you think you'll do better, you will\n-Skill set matches situation\nIs it real?\nQ5: discrimination\n\nWould you press a class action suit in this case (see slide)? Is it discrimination?\nThe quality of applicants was the same.\nStudent responses:\n-Need more information - more male than F dorms? Physical constraints\n-Not statistically significant difference? (Ariely: yes, it is statistically significant)\n-Did women apply to tougher places in Berkeley to get in?\nDo you assume discrimination or ask for more information?\nQ6: Would you invest your money?\nQ8:\nThere was a NY Times bestseller recently that documented the \"bible code\"\nUsing math, methods (for example, taking every 40th letter starting from the back of the\nbook), significant things are spelled. Some people say this proves the Bible was written\nby God.\nHow would you check it out?\nStudent responses:\n-check if it is true, check other books\nIs the bible more likely to do it than other textbooks?\nIf you look hard enough you can find things and interpret them.\nIn one experiment, War and Peace was compared to the bible - War and Peace also\npredicts a lot of things.\nLook at evidence that is presented in scientific papers. (Medical journals are the worst.)\nThink about the data, about other people's research, and about our own research.\nWhat traps can you see? You can't make reasonable inferences from these.\nCorrelation and Causation\nCorrelation does not necessarily imply causation.\nWhy? Think about our own intuitions:\n(see lecture slides)\n2. We don't know, you can make up all kinds of stories.\nDo you think it is causal or not? It depends on the stories we can make up. Does it sound\nplausible?\n3. Running may not cause it, maybe it's the people who choose to be runners.\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 2 of 8\n\nStudent responses:\n-runners take less abuse?\n4. Student responses:\n-breastfeeding parents care more about their kids.\n-Milk contains more nutrients for development.\nKids have more contact with parent\n5. What is the causal story there?\nStudent responses:\n-if you watch more tv, then you are neglecting the work.\nKids that do terrible in school hate it so much, or can't read, so they find something else\nto do. Interpretation is often that television is taking up the time that could be used for\nother things. This is not necessarily true.\n(new lecture slide)\n1.Women who exercise have fewer miscarriages.\nIf you start exercising when you are pregnant, it might create damage, we don't know.\nWe can't infer a prescription.\n2. Famous conductors live longer lives. Why?\nStudent responses:\n-love their job more\n3. Students that come to class do better. Why?\nStudent responses:\n-pay more attention\n-inherently more responsible\nCould be many explanations.\nLets talk about the conductors\nStudent responses:\n-Social status = better food, housing, medical.\n-Types of people that become conductors are more passionate\n-Do it because they love it, happier life\n-More fulfillment\n-Aerobic job - more fit than average?\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 3 of 8\n\n-Requires fitness of mind\n-How many famous conductors are there? Statistically significant?\n(Ariely: there are enough, a very robust number)\n-Music! Relax, live whole life listening to music.\nSave one statistical answer, all of you gave causal stories, such as the intuitive idea that a\nconductor lives a happier life\nThe first thing you want to do is to get sucked in.\nIt takes a long time to become good conductor\nStudent responses:\n-Average age includes homeless, those that die early, etc\nUsually, you need to be at least 60 to be famous conductor, and for those who have\nalready lived to age 60, conductors fit the average life span.\nLooking back, how would we find out if we did not know?\nFamous conductor leads to being rich leads to longevity? - We can test this by comparing\nconductors to other wealthy people.\nMusic lovers live longer?\nLiving longer means we are more likely to be a conductor?\nWe don't know the true path of the causal aspect.\n(new lecture slide)\nTry to be careful not to fall into these traps\nUse a control group. Single cells only give us correlation, we don't know the causal\nrelationship.\nUri Geller situation: How could you test it?\nStudent responses:\n-it happened by random chance, people whose clocks started called to report it\n-You could tell them to call in the next hour if their clock started.\n-Is it actually broken, or maybe they just thought it might be?\n-Tell them to bring a nonfunctional clock\n-Bring someone w/o these powers to try to start nonfunctional clocks\nConductors - compare with people who are 60 who did not become conductors\nKids watching television and doing bad in school - raise groups with and without\ntelevision (use a control group). This would be a very long experiment.\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 4 of 8\n\nIn an experiment, we take away people's choice. If people get to choose themselves, we\ndon't know what to attribute the outcome to.\nBerkeley was sued for discrimination, but it ended up it was not.\nDepartment A: math, takes everyone, happy to have people\nDepartment B: philosophy, very selective\nLook at the individual departments. You see the school did not discriminate. It was self\nselection.\nYou could even come up with an example where all the departments discriminate for\nwomen, but overall it looks like they discriminate against women.\nWho is an EE/CS major? A business major?\nLet's say business students get better grades in this class.\nThe main effect might be that students decided what to major in. There are all kinds of\nstories when you let people choose into it.\nLet's take the 5 year cholesterol study.\nThat's a long investment in doing research properly\nP(death) in placebo and real pills, both 21%\nIf you split the subjects into those that take the pills regularly and those that do not, the\nresults look good for taking the medication. But you introduced choice!\nLook at people who took placebo only, the control group.\nTurns out, there were the same results for the placebo - there were good results for\nregular takers.\nOK, I've warned you about the dangers of correlations.\nDon't let people choose.\nExperiments have downsides\n(new slide)\nWhat is a placebo?\nStudent responses:\n-placebo, doesn't do anything but because of your state of mind, situation actually\nimproves\nDo you believe you can have something mental that has no chemical effect on your\nbody?\nPlacebo - we don't know how they are affecting you.\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 5 of 8\n\nClassic example - dentist chair, inject a person with saline instead of a drug. The person\nfeels better\nTurns out it's not really fake. If you give them nelaxon (opioid blocker), there is no pain\nrelief\nWhy do people get high when they smoke grass? (Same with heroin, opium, etc.)\nThe receptors are ready, we have similar substances internally (naturally). When injected\nwith saline, we create the effect ourselves.\nHere is one of my favorite examples:\nLong time ago, French person said a worm.... (see slide)\nDid it work? It really worked. Does the worm have anything to do with it? Nothing!\nBirth control experiment\n(SLIDE) placebo II\nSide effects reported if warnings included, placebo or not.\nPeople pay more attention.\n(SLIDE) placebo III\nUse fast.....\n(there is the biggest placebo effect when you really believe in it, before data is gathered)\nHawthorne effect - Placebo related\nChanges made in the work environment increased productivity at a company - brighter\nlights, etc.\nIt turns out employees were happier when someone asked their opinion. Caring about\nthem makes people feel better\nPlacebo effect is real, strong, important.\nIf I think I'm getting some pill, I'll expect it.\nYou know how every morning I say this will be a great class? Why do you think I do\nthat...? ☺\nSelf fulfilling prophesy:\nTeacher told that some students are good, some are bad. They pay more attention to the\ngood ones, and do other things to encourage them (even if they don't know they are\ndoing it).\nSmart Hans was a horse. His owner said he could count.\n2+3, and he would stamp five times\nNever missed a thing.\nPeople started suspecting the owner of the horse.\nThey watched him very carefully, but couldn't see anything.\nBut when he stood behind, the horse couldn't do anything.\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 6 of 8\n\nTurns out it was unintentional, but the owner did something when the horse got to the\nright answer, and he stopped tapping his foot.\nBlind experiments:\nSubject doesn't know hypothesis.\nDouble blind:\nResearcher doesn't know hypothesis either\nThink critically about evidence\nWe, as measurement tools, are quite bad. Not very accurate\nTherefore we need to do standard research\nSummary\nThere is a supplemental Prayer article posted, a story from Wired\nExample of a good project:\nLast week we passed out a survey and told you to find the cells that summed to 10\nYou would get paid 50 cents per correct question (and you will get paid).\nLying: people who took 14.01, know how to work system, economics?\nOnly a couple people said they got all 20 correct, even if we had no way of knowing!\nPeople who signed the honor code said they got fewer correct than those who actually\nturned in their sheets!\nHow would you interpret this?\nStudent responses:\n-We're all skilled mathematically, not a big population\n-Honor code people cautious? (more careful, checked answers)\n-Honor code - extra time to sign (Ariely: they were told to read before time started)\nPeople cheated, but very little\nWe don't want to cheat too much, or we'll think of ourselves as cheaters\nIf people noticed some were not solvable, couldn't guess 20 or grader would know.\nAlmost everyone cheats sometimes on a problem set, but don't consider themselves\ncheaters\nHow many of you have cheated on a problem set?\n(some hands raised)\nIf someone is polite to you, are you likely to be polite later? (smile, open a door for\nsomeone, sign a petition?)\nGeneral: what creates more or less politeness?\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 7 of 8\n\nGeneral question is more exciting than a specific question.\nAriely: \"If you can, be wrong\"\nWe want you to go through the process, it doesn't matter if you are right or wrong, do\ngood research.\nExercise in ideas - you'll have to do it yourself.\nQuiz!\n3 front rows stage right - you'll be the people on the left\n3 front rows stage left - you'll be the people on the right\n(multiple choice, alternating groups )\n15.301/310, Managerial Psychology\nLecture 2\nProf. Dan Ariely\nPage 8 of 8"
    },
    {
      "category": "Resource",
      "title": "c_03_perception.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/6a4ab9a49794e8cd2a914baca6597827_c_03_perception.pdf",
      "content": "Class #3\nPerception\n\nVisual Illusions ...\n\n\"Higher order\" perception\nPerception is relative\nAutomaticity\nAdaptation\nExpectation\nPerception & Brands\n\nPerception is relative 1\nWhich one has more ice-cream?\nWhat effects could the package have?\n\nPerception is relative 2\nImagine that you are holding a 1\ngram weight in one hand, how much\nwould we have to put in the other for\nyou to notice the difference?\nWhat if you were holding a 1 KG\nweight?\nJust noticeable differences (JND)\n\nJND\nOur perceptual system notices\nchanges and these changes are\nrelative to the magnitude of the\nexperience itself\nThis proportion is about constant for\nany sense (but different across\nsenses)\n\nJND - Weber's law\nI / I = K\nI is the intensity\nK = constant across levels of\nI\nIj / Ij = Kj\nj is the sensory domain\n\n\"Higher order\" perception\nPerception is relative\nAutomaticity\nAdaptation\nExpectation\nPerception & Brands\n\nThe Unbearable\nAutomaticity of Perception\nThe strongest knowledge -- that of\nthe total unfreedom of the human will\n-- is nonetheless the poorest in\nsuccesses, for it always has the\nstrongest opponent: human vanity\nNietzsche, Human, All Too Human\n\nAutomaticity\nAutomaticity\n\"... most of a person's everyday life is determined\nnot by their conscious intentions and deliberate\nchoices but by mental processes that are put into\nmotion by features of the environment and that\noperate outside of conscious awareness and\nguidance,\" Bargh & Chartrand (1999)\nAdaptive\n\"... consciousness deserts all processes where it can\nno longer be of use...We grow unconscious of\nevery feeling which is useless as a sign to lead us\nto our ends, and where one sign will suffice others\ndrop out,\" William James (1890)\n\nAutomaticity?\nWhy have thing automatic?\nWhy is automaticity\nimportant?\nThe answer is limited\nresources\n- The \"cognitive miser\"\n\n\"Higher order\" perception\nPerception is relative\nAutomaticity\nAdaptation\nExpectation\nPerception & Brands\n\nAdaptation I\nPeople are sensitive to changes\nWe get used to stationary states\nLight, shirts, glasses\nIncome, lifestyle, well-being?\nWith diminishing marginal\ndifferences\n\nAdaptation II\nPeople don't predict their level of\nadaptation\nThe \"hedonic treadmill\"\n\nAdaptation III\nExamples:\nTenure\nPeople who win the lottery are not\nas happy as they expect to be ...\nCalifornia ...\nOther examples?\nimplications....\n\n\"Higher order\" perception\nPerception is relative\nAutomaticity\nAdaptation\nExpectation\nPerception & Brands\n\nExpectations\nRabbit\nHow many rabbits are there in\nthe us?\nWhen was the last time you held\na rabbit?\n\nWhat is this?\n\nExpectations\nHow old are these women?\nWho do they remind you of?\n\nHow old is she?\n\nQueen\nListen and try and head the\nhidden message\n\"It is fun to smoke marihuana\"\n\nExpectations\nsummary\nExpectations have real effects of\nperception\nShort, and long term\nexpectations:\nPriming\nThe \"cocktail party\" effect\n\n\"Higher order\" perception\nPerception is relative\nAutomaticity\nAdaptation\nExpectation\nPerception & Brands\n\nBeer\nWhat would prefer a bud, or a\nbud with balsamic vinegar?\n\nThe experiment\n\nResults\nBlind\nBefore\nAfter\nBeer +\nBeer\n% picking beer\n\nPerception & brands\nThe case of coke vs pepsi\nCan a can influence perception?\n\nContainers ...\nCourtesy of Read Montague, Baylor College of Medicine, Houston, TX. Used with permission.\n\nCoke & Pepsi test\nPepsi had ads with a taste test\nshowing that Pepsi is preferred\nCoke had ads with a taste test\nshowing that Coke is preferred\nHow could that be?\n\nfMRI\n\nA neuro-imaging experiment\n6s\n6s\n4s\n4s\nC\nC\ntest\ntrain\n6s\n6s\nC\nC\n6s\n6s\n4s\n4s\nP\nP\ntest\ntrain\n6s\n6s\nP\nP\nCourtesy of Read Montague, Baylor College of Medicine, Houston, TX. Used with permission.\n\nEffect of Pepsi label on brain activity\nSide\nBottom\nFront\n\nEffect of Coke label on brain activity\nY = 30 mm\nX = -10 mm\nCognitive Control Reward prediction \"error\"\nCourtesy of Read Montague, Baylor College of Medicine, Houston, TX. Used with permission.\n\nA brain map\nCourtesy of Read Montague, Baylor College of Medicine, Houston, TX. Used with permission.\n\nPerception: summary 1\nPerception is rapid and efficient\nBut, wrong from time to time\nThis is a tradeoff! Partially due to\nresources limitations\nThe biases are due to structural,\nlearned, and attentional issues\n\nPerception: summary 2\nPerception is relative\nDifferences, JND\nAutomatic (Automaticity)\nAdaptation\nExpectation\n\nOther topics\nStatistical perception\nAttention (spotlight and search)\nSome things we are good at\n(average length) some we are very\nbad at (total wind)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec3perception.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/523d9437b1e1d8d7092e77482e27486c_lec3perception.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nLecture 3: Perception\n(a dash \"-\" indicates student responses)\nEveryone in the last 4 rows move up.\nNobody is in the 2nd row, somebody sit in the second row\nWhy do they make lecture halls with the first 2 rows? Nobody ever uses them...\n[as people come in late, the Professor individually tells them and gestures to them to sit\nup in the first few rows.]\nSyllabus\nThe topic is Managerial Psychology, if you haven't figured it out yet... ☺\nHow many people did the experiment on Friday?\nWho was in the last group?\nThe first group was happy, the middle group was in the middle, the last group was\nunhappy. We adjusted to have them paid the least in the last group. Don't expect to earn\n$70 in future experiments, that was a fluke. On average in future experiments, it will be\nmore like $10.\nIn a class of any size, some students will do better than others. There will be some in\nevery possible location in the range. Measurement grades are a statistical estimate of\nyour ability - be happy with what you get.\nOn Wednesdays, we will mostly have lectures in the big class. Sometimes you will meet\nwith your TA, like last week.\nThere are three books to read this term: Statistics, the class reader, and How We Know\nWhat Isn't So. You are in charge of the reading and it will all be covered in the exams.\nThe reading is not that hard, I will not reinterpret the material here. It is helpful to work\nin groups on the readings.\nYour projects will be presented in class. You will get more cheers from your fellow\nstudents based on the quality of your work.\nAt MIT, there is a tendency to start an assignment 2 days before it is due. If you start 2\ndays before the exam, there is no way you'll do well.\n(you are not allowed to sit in the last 3 rows - come forward)\nVisual Illusions\nHermann Grid\n\nIntersections slightly grey - how can that be? What's happening here?\n-Optical Illusion\nNot an optical illusion, a visual illusion.\n-Something about your eye.\nWhat about your eye?\n-neighboring receptor cells...\nClose, your visual system averages brightness. The area is small in the center, but your\neye is averaging over a larger area in your peripheral vision.\n-Why is there not even more grey on the sides?\nProximity...\nHow are you all with colors? Have you gone over colors?\nWhat is this color? [points to various colors on the slide, a cube made of smaller, colored\ncubes]\nThese two are actually the same color [one in shadow, one in light]. There are always\nsome people who don't trust me, so I brought a hard copy. [Passes it to skeptics] It looks\ndifferent in the picture, but it is exactly the same color. Why?\n-we automatically adjust for shadow\nYes, we want things to remain constant - we want to preserve things. In the image, our\nmind thinks how we could change it, to interpret the world, though it is not a real change\nin the object.\nLet's look at another learned change\n[has someone read several sets of words, timing her.\nFirst, black list of colors - 9s.\nNext, colored list of colors - 9s.\nThird, same list, but say the colors, not the words - 10s.\nLast, set of words that do not match the colors, saying the actual colors - did not finish, it\nwas very slow and she stopped]\nSuddenly the reading got very slow. It looked like you were agonizing.\n-It was confusing because of the colors.\nThe only time it was slow was when the color and the name were different. She is a good\nreader. What happened?\n-Red came into her mind automatically, we are used to reading.\n-She had to slow down to get what she wanted to produce - color\nIf you don't speak English, you would be much better at naming the colors.\nThere is a word-letter effect. Take the word work v. the letter k. You would recognize\nthe k much faster as part of a word. We have holistic perception.\nAnother example: we can mix up letters as long as the first and last letter remain the\nsame. It is still readable. You can still read this passage easily (slide).\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 2 of 7\n\nBall passing example: how many times does the white team pass the ball to each other?\nWe should all be able to get the same number. It is a minimal sign of intelligence!\n(video clip)\nHow many times? [answers range from 14 to 18.] That's the biggest variance I've had in\na class. I purposely tried to hype you up to want to concentrate on the number.\nResult - something can pass through the center of our vision and we are able to ignore it.\nIf we are attentive to the white things, we filter out the black.\nIf we are attentive to what Bush does well, we may not see anything else...\nThe \"mistakes\" in our vision are designed for a purpose. Sometimes we are supposed to\nmake mistakes. What does this basic perceptual feature tell us about how people think,\netc?\nThere is another test where someone stops to ask a person for directions. While the\nperson is in the middle of explaining, a couple of construction workers walks between\nthem with a big board and the person getting directions is replaced, but with similar\nclothing. Only 50 percent of the people giving the directions noticed it was a different\nperson.\nRelative Perception\nImagine this picture is ice cream (see slide). Which people would think they were getting\nmore ice cream?\n-Store B more generous, getting a better deal\n-Store A the people would be more likely to finish all the ice cream, and maybe ask for a\nrefill.\n-more profitable for store A?\nWho could charge more money?\n-Store B\nIn store B, people leave more on their plate, if they are the kind to do that.\nYour perception is relative to a concept. It is a placebo effect in some way, dependent on\nwhat you understand and perceive.\nWould it be better to use big plates or small plates if you owned a restaurant?\n-seems more upscale if you use big plates, a fancier restaurant.\n-there's a restaurant that serves wings in a container that looks big, but it's not as much\nfood as it seems it will be.\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 3 of 7\n\nHow much difference would there need to be between two weights for you to tell for sure\nwhich is heavier? Say, using one of these black paper clips?\n-three\nSo, 1g to 3g to detect a difference\nHow about if you had 1kg?\n-maybe a 1⁄4 kg difference\nThat's a lot bigger.\n-It is proportional, it is more about the percentages.\nOur perceptual system works on something like percentages.\nIf you have 1 candle in a room and you light one more, it is a big difference. If you were\noutside in the sunlight and lit 5 candles, you could not tell the difference.\nIt is called the just noticeable difference (JND)\nWe are sensitive to the absolute level of stimuli.\nDelta I/I = k (constant across levels of I)\nDelta Ij/Ij - kj\nJ is the sensory domain.\nImplications - price for consumers.\nOur perception is in percentage - that is why discounts are also in percentages.\nAbsolute level of stimuli effect what we observe. Think about buying a car. There is no\nhappiness with a discount of $100.\nAutomaticity\nNietzsche quote - \"We really do not have much freedom, many things are done for us.\"\nWe find it hard to accept\nBargh and Chartrand - the majority of things we do are things we don't even consider.\nDoing things automatically is important. When you started driving, you may not have\nbeen able to listen to the radio at the same time because you needed to concentrate on\ndriving. After a few months, it was automatic. Have you ever made it home and not\nremembered getting there? Sometimes I end up at home when I am going somewhere\nelse.\nWhen we are walking, we do not have to think, ok, up up up, now down\ndown...[demonstrates]\nLike the visual illusions, sometimes too many things can be automatic\nWhy are things automatic?\nWe have limited resources. Things you do automatically don't take resources.\nTake typing - you don't think where your fingers are going\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 4 of 7\n\n-7/10\n-is there a different in quality with automatic actions? If you are driving, are you less\nlikely to crash?\nAutomatic is at a very high level, much faster. Crashing happens because of a new thing.\nIt is not automatic because you are not used to it. You have to think about it. Think, if\nyou play tennis and you had to think of what your hand is doing all the time, you would\ndo much worse.\nAdaptation\nHow bright is this room? Too dark? Light? About right?\nHow does it compare to the sunlight outside?\n-about 100 times less bright?\nYes, maybe more. Yet we are able to function here and there quite well. This is\nadaptation. What we perceive is based on what we are used to.\nDuring the day, we are not conscious of the fact that we have clothes on. We get used to\nstationary states. Do you notice if you wear glasses? You are used to it. You also get\nused to income, lifestyle, well being.\nAre you happy at MIT?\nHow do you know? You are comparing it to the rest of your experience.\nIf we moved someone up from the University of Florida, they would not be happy. But\nafter a couple of weeks, a month, they would get used to it. If you moved someone from\nMIT to University of Florida, they would be happy, lots of parties, alcohol. But after\nawhile, they would get used to it.\nYou think once you graduate, you might become a stockbroker, earn hundreds of\nthousands of dollars, and it will make you happy. And maybe you will. But you don't\nforesee that you will get used to it.\nHedonic treadmill\nThe student thinks about life after school (great life!) 3, 4, 5 months after it happens, you\nare used to it. You have adapted. Then you look at your neighbor. And maybe they\nhave a horse too, or....etc Keeping up with the Jonses, more and more needed all the\ntime after you get used to what you have.\nYou compare yourself to others. The tricky thing with adaptation is that people don't\npredict it.\nSome people work very hard to get tenure, think it is very important, and imagine they\nwould almost commit suicide if they don't get it. But look at them after, and people who\ngot tenure are fine and people who did not are fine. Nobody is as elated or as\ndisappointed as they thought they would be.\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 5 of 7\n\nYou cannot predict the speed at which the change will go away (get used to it)\nExpectations\nHow many of you like rabbits? When was the last time you held a rabbit?\nWhat is this picture? (duck/rabbit slide)\nMost people think it is a duck when they first look at it. But if you get them thinking\nabout rabbits, then they are more likely to see the rabbit.\nPicture of young women, then picture of old/young woman. Most people saw the young\nwoman. The old woman had to be pointed out.\nMusic example - hidden message. Once you expect to hear something, it is easy to get.\nThink about the threshold for observing things in the world\nAt a cocktail party, maybe you suddenly hear your name. You may have a lower\ndetection threshold for some things. This is set by your expectations. The threshold for\nwhat you expect is lower, more likely to hear your name than other things.\nBrand Perception\nWe have been doing an experiment in the bar at MIT where we take beer, and to some of\nit we add balsamic vinegar. We give people 2 samples, 1 with and 1 without vinegar, and\nwe let them choose which they want in a big glass.\nSome people do a completely blind test. Some are told there is balsamic vinegar added to\none before they try the samples. Some are told after they try the samples but before they\nchoose which one they want. Those who do not know tend to prefer the beer with\nbalsamic vinegar. When they are told before they taste, they more often choose the beer\nwithout balsamic vinegar. And when they are told after they tasted it, they choose pretty\nevenly.\nIf you know something before you experience it, it colors your perception. If you are told\nafter your experience, the knowledge has a limited effect.\nThey have done tests with Coke v. Pepsi, does the can effect your perception? If they\nswitch the drinks between cans, people like the one in the can they prefer.\nLet's think about this. [shows picture of coke in a sink and coke in a bottle]. This is a\nperfectly new sink, never been used. If we give you a straw, which would you drink out\nof? Also look at the cups, one is half full, one is completely full. One of these looks\nmore appetizing\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 6 of 7\n\nAwhile ago Pepsi ran a commercial claiming that in a blind test, people choose Pepsi\nover Coke. Coke ran an ad at the same time saying that they had done tests and people\npreferred Coke. Both were correct. How can this be?\nCoke did not do a blind test, they used the cans.\nDo you remember when Coke tried to introduce New Coke? In the lab, under blind tests,\npeople preferred the new formula (it was sweeter). But in the can, they did not. People\nhad expectations when they opened a can of Coke, and these expectations were not met.\nSomeone did a study with an fMRI scan where people saw the word Coke and 6 seconds\nlater would get a small squirt of Coke. Sometimes they did not get anything. The\nexpectation of Coke coming as well as the experience of drinking Coke proved to be a\npleasurable experience.\nConclusion\n(see slides)\nOn Wednesday, there will be someone from the writing center. Writing is one of the\nmost important skills you learn at MIT. It is important for class as well as later in life.\nCome to class on Wednesday.\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 7 of 7"
    },
    {
      "category": "Resource",
      "title": "c_04_memory.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/7b219896919f5546109bbbefcc6180f0_c_04_memory.pdf",
      "content": "A general framework for memory\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\n\nShort term memory\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\nDuration: short, about 15-20 sec.\n-can be lengthened through rehearsal\nCapacity: 7 + or - 2\n-chunking\n\nlong term memory\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\nNot really long term. Some things are\nconstructed, some last forever.\nNo capacity constraints!\nVisual, verbal, conceptual, procedural etc.\n\nIndividuals represent stimuli in context-\ndependent perceptions; these perceptions are\nall the reality for the individual\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\n\nKnowledge in the individual's mind (including the\nperceptions) is organized into hierarchical\ncategories\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\n\nThe individual understand stimuli by forming\nor updating beliefs and expressing\npreferences\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\n\nIndividuals evaluate certain representations;\nthe evaluation is called a judgment (if it is\noperational) or an attitude (if it is not)\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\n\nA general framework for memory\nPerceptions\nCategories\nPreferences\nAttitudes\nLong Term Memory\nRepresentation\nCriteria\nRepresentation\nof stimuli\nOrganization of\nrepresentations\nComprehension\nof representation\nEvaluation of\nrepresentation\nBeliefs\nExposure\nAttention\nRecall\nOther mental\nprocesses\nStimuli\nWorking Memory\n\nSpecific memory\neffects\n\nConstructed memory\n\nThe memory myth\nWe usually think about our\nautobiographical memory as a\nveridical representation\nThis is not the case!\nMemory is constructed\n\nEvidence (Loftus & Pickrell )\nAdult participants were implanted\nwith a childhood memory that at\nage five they had been lost in a\nshopping mall and rescued by an\nelderly person.\nPeople falsely remember shaking\nMickey and Bugs Bunny's hand at\nDisneyland\n\nConstructed memory\nEvidence from cases of early child\nabuse\nThis is not to say that there is no child\nabuse\nSome people don't accept this\nevidence\nHow could you study this level of\nconstructed memory?\n\nAlien Abduction !\nSusan Clancy\n\nAlien abduction\nSusan Clancy showed that people who claim\nthat they were abducted have many more\nfalse positive memories & that they are\nhigher on the autism scale.\nShe also proposed a \"sleep-awake\"\nmechanism\nThis work has help not only to show that false\nmemory are real and that they have real\nimpact on people, but helped us understand\nthe mechanism underlying it.\n\nSource monitoring\nEven when we remember we\ndon't necessarily remember\nwhere the information is from\n\nImplication\nThe legal system usually treats\nperson eye witnesses and memory\nas the highest level of accurate\nevidence\nThe same goes in our personal and\nprofessional life\n\nTHE MERE EXPOSURE \"Costanza\" EFFECT:\nWe like things that are familiar\n\nEvidence for mere exposure\nZajonc (1968) showed Chinese characters to\npeople from one to 25 times, asking them to guess\nthe meaning. The more they saw a character the\nmore positive a meaning they gave.\nMiller (1976) showed people posters about\nstopping foreign aid up to 200 times. They were\npersuaded most by moderate exposure. After 200\nexposures they reacted negatively to the message!\n\nOrganizational memory\nPeople use memory as a asset and\nas a tool to ensure their position\nKnowledge management is an\nattempt to get out of this problem\n\nUrban legends\nThis is another version of collective\n(constructed) memory\nYou only use 10% of your brain.\nThe Great Wall of China is the only man-\nmade structure visible in space.\n\nHalloween\nNewsweek, 1975:\n\"In recent years, several children have died\nand hundreds have narrowly escaped\ninjury from razor blades, sewing needles,\nand shards of glass purposefully put into\ntheir goodies by adults.\"\nABC News poll, 1985\n60% of parents worried their kids might be\nvictims\n\nMad cow in France\nScientific papers, and newspapers\nQ1Q2Q3Q4Q1Q2Q3Q4Q1Q2Q3Q4Q1Q2Q3Q4Q1Q2Q3Q4Q1Q2Q3Q4Q1Q2Q3Q4Q1\n1995 - 2002\nCourtesy of Chip Heath. Used with permission.\n\nMad cow II\nMad cow had a real effect on beef\nconsumption in the US.\nHow many people died?\nHow many people die each year of salmonella?\nBeef\nconsumption\nCourtesy of Chip Heath. Used with permission.\n\nUrban legends summary\nUrban legends are a \"collective false\nmemory effect\"\nCommon and interesting\nReal effects on the market\nAn important question is what makes\na \"good\" urban legend?\nWhat predicts that a story will\nbecome and urban legend?\n\nApplications I\nEyewitness Testimony\nImproving memory\nMake meaningful (self)\nMake Salient (images)\nRehearsal\nMnemonics\n\nTechnological aids\nThe Remembrance Agent\nBrad Rhodes\nARIA: An Agent for Integrated\nAnnotation and Retrieval of Images\nMemory Prosthesis\nVisualizing health\n\nThe Remembrance Agent\nWatches over the shoulder of the\nwearer of a wearable computer and\ndisplays one-line summaries of notes-\nfiles, old email, papers, and other text\ninformation that might be relevant to\nthe user's current context.\nBrad Rhodes\nCourtesy of Brad Rhodes. Used with permission.\n\nARIA:\n[Annotation and Retrieval Integration Agent]\nAssists users by proactively looking for\nopportunities for image annotation and image\nretrieval in the context of the user's everyday\nwork\nContinuous, ranked searches are automatically\nperformed from an image library, and images\nrelevant to the current text can be inserted in a\nsingle click\nHenry Lieberman\n\nMemory Prosthesis\ncomputer attempts to determine the most\nimportant parts within audio recordings.\nSpeaking\nTone\nHumor\ntries to pick a good set of short audio\nclips that, in turn, will serve as good\nmemory triggers\nSunil Vermuri\nCourtesy of Sunil Vermuri. Used with permission.\n\nVisualizing health\nPhoto journals and data visualization\nto understand health practice\nJeana Frost\nCourtesy of Jeana Frost. Used with permission.\n\nOther examples\nCell phones\nAuto complete\nGoogle\n\nSummary\nMemory is complex and important\nMemory is about organization and \"sense-\nmaking\" -- and hence not always accurate.\nWe have volitional access to some aspects\nof memory but not others\nMemory is a central psychological process\nthat almost everything we do depends on."
    },
    {
      "category": "Lecture Notes",
      "title": "lec4memory.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/3b93d9de883e180164572ab8544ba59c_lec4memory.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nLecture 4: Memory\n(a dash \"-\" indicates student responses)\nWhat if you couldn't remember more than a week? What would it be like?\nWhat do you know about memory, having experienced it?\n-learning in 7.012\nYou've had 21 years of memory - what do you know about this system?\nWhen are your first memories?\n-memory fades with time\nMost, but not everything. Some things you remember all the time, circumstances bring it\nabout\n-triggered\nWe do not have perfect control\nThings to remind us\n-associations\n-things relate to others easier\n-touch, smell, visual memory\n-short and long term memories\nHow do you know this short/long term memory?\n-remember a phone number for awhile, then forget when someone asks you.\nMemory is partly a representation of what is happening, and partly we make it up.\nGreat, we know something about memory.\nOne way to think about memory:\nExposed to stimuli\nGoes through attention\nWorking memory and long term memory\nA lot of cognitive psychology looks at computation, how is the mind like computers?\nHard drive/ ram: Short term - 15, 20, 30 seconds\n\nMemory is even shorter - iconic memory. Look at me, then close your eyes. The image\nlasts about 200 ms.\nShort term - if there is too much information, some gets lost.\nExample: I will read some numbers, you won't know when I am going to stop. At some\npoint, I'm going to ask you to remember the last three.\n[reads numbers, has class try to remember]\nThis is quite hard even though it doesn't take a long time.\nIf I ask you now the last 4, you won't remember, they are already gone\nYou can remember 5 separate things. But if you put them together, it becomes one thing\neg.: Big grey elephant in the forest\nGrouping things together makes it easier.\nWe don't have people who don't have memory\nSome have isolated, short and long term memory.\nIt is sad to see people like this. You can hold a conversation with them, then turn around.\nWhen you turn back, they won't remember you.\nThese people can't transfer stuff to long term memory\nEvery day when they find out their parents died, they start crying again.\nLong term memory:\nSome things are constructed and some things last forever. It doesn't seem like there's a\ncapacity constraint. There is not too much information\nMy representation of how memory works:\nThere is the outside world, reality.\nBut memory is everything we have to work with\nIn fact, all of you are a figment of my imagination. You can imagine I am just a brain.\nThe only thing we have access to is the internal world.\nHow we organize it: memory is organized by categories, sometimes with criteria\nIf you go to psychology class and asked about physics, sometimes it is hard to answer,\neven if you know it.\nIs an ostrich or a robin more of a bird? An ostrich is an outlier.\nThings can belong to multiple categories.\nMazda protege is a car, it is Japanese, etc\nThe representation is based on all of these categories\nAt the beginning you create preferences and beliefs\nAnd finally, you use the representation to express\nFrame of memory -\nPerception is the basic unit\n15.301/310, Managerial Psychology\nLecture 4\nProf. Dan Ariely\nPage 2 of 6\n\nOrganization\nComprehension\nExpression of beliefs, attitudes\nSpecific Memory Effects\nConstructed memory\nYou might remember something from when you were 2, but if your mother keeps\nrepeating a story for 17 years then the next thing you know, you think you remember it.\nIt doesn't have to be real, we can easily create these memories.\nHow many of you have a feeling that you make up a lot of your memories?\nNot many, there is little way to know.\nEvidence about constructed memory\nLoftus did a lot of the work\nIn 1⁄2 hr, Loftus convinced people that, when they were 5, they lost their mother in a mall,\nthen a gentleman with a gray hat came and walked around with them until they found her.\nShe made it up, and it took 4 hours to subsequently convince the subjects that she made it\nup.\nIt is very easy to convince people\nMany people falsely remember shaking Mickey Mouse's hand at Disneyland\nThis is the part of class for life:\nSo we construct memory - what should we change about life?\n-Make happy memories\nWhen you are fighting, say to your partner - so memory is constructed, let's say that 5\nyears ago, I said this, you said this...\nTry it , tell me how it works.\nCommercials create memories: do you remember when you were 5, it was cold outside,\nand mother made Campbell's soup? Maybe you did not live in a cold place when you\nwere 5, but you remember the soup...\nEvidence of child abuse from early childhood\nThere was a famous case in LA\nA girl suddenly remembered being sexually abused\nHer father was arrested, went to jail, then was convinced that he did do it.\nThe psychologist thought it was funny, and the case was tried with new evidence\n15.301/310, Managerial Psychology\nLecture 4\nProf. Dan Ariely\nPage 3 of 6\n\nThe psychologist implanted memories that could not have happened\nThis father and daughter were particularly good at making up memories\nThere have been other similar cases, and it looks like none of them are holding water.\nIf you are Freudian, it is hard to say this is nonsense, it is a big part of the belief.\nHow are you today?\n-fine\nDo you have siblings?\n-older brothers\nDid your brother ever hit you?\n-no\nOkay, so how could it have happened?\nAnd your second brother, how could he have hit you?\nOnce we create a vision in our mind, we remember it and we can't tell the difference.\nPsychologists help people create repressed false memories.\nHow can you prove it? Psychologists can say that people believe this. But we can't go\nback in time to check\nWhat can we do?\n-Plant false memory\nHint - paper you read for today\nOne of the things people remember is being abducted by aliens.\nLook at these people - this is a central part of their life\nLook at the memories - isolated something here\nAlien abduction!\nBy Susan Clancy\nShe was persecuted by the alien abducted community afterward\nSometimes people wake up and are still slightly paralyzed. They are between awake and\nasleep\nThis is a starting point for making these memories\nAlien abductees have slightly different characteristics than we do - anyone know? Those\nthat read the paper? Okay, we'll ask you again in the exam\nSource monitoring\nHave you ever told a joke back to a friend that you didn't remember earlier?\nThere is a big problem with eyewitness memory\nA judge can say - ignore this comment, but the comment and the judge's statement are\nstored in separate places. Later you remember the comment well and that there was\nsomething special about this comment. But you don't remember what.\n15.301/310, Managerial Psychology\nLecture 4\nProf. Dan Ariely\nPage 4 of 6\n\nVideo:\n\"Alien Abduction.\" Penn & Teller: Bullshit! Directed by Randall Moldave, Star Price,\nTim Rogan, Scott Schafer. Showtime, 2004.\nPeople really believe this\nIt is really changing their life fundamentally.\nFriday there is a second experimental session\nIt is an auction with specific slots in time - sign up for one of those times\nIf you put yourself down, please make sure you come at that time.\nTwo more things\nFirst, the George \"Constanza\" effect\nThere is an annoying guy, but over time we like him\nWith exposure, we learn to like things more and more.\nEvidence for mere exposure\nPeople were shown Chinese characters, then asked which they liked. Once they'd seen it\nup to a certain level, it increased their liking, then after that, their liking decreased.\nThe first letter of your name - you are exposed more under positive experiences\nThe TA will tell you some things created in the media lab to help and improve memory\nTA:\nRelate to aliens\nBrad Rhodes - 5 years ago wearable technology\nEye display, constant readout of information based on what he says and what someone\nsays to him. Like email, shows up as lines of text\nDesktop application as well as display.\nAriely\nLocation specific, as well as people specific\nMemory works in terms of association.\nARIA - tag images\nAs you create email, it would try to bring up appropriate images. It would tag the email\narchive as well as be able to send images with email\nMemory prosthesis\nHuge logs of conversations, look up later\nMy research\nMemories coincide with your theories\n15.301/310, Managerial Psychology\nLecture 4\nProf. Dan Ariely\nPage 5 of 6\n\nWhat do you use as a memory prosthetic every day?\nThere may be some in our routine you don't think of\nDo you know numbers of friends more now, or 10 yrs ago?\n-none now, cell phone knows it\nKnow email addresses?\nAutocomplete\nSpelling - remember more when being tested?\nGoogle - huge memory prosthetic!\n-search inside a book is good for that too\nAriely: we're out of time\nWednesday - probability theory, bring calculators, statistics text.\n15.301/310, Managerial Psychology\nLecture 4\nProf. Dan Ariely\nPage 6 of 6"
    },
    {
      "category": "Resource",
      "title": "c_05_emotions.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/ece09a4031d7ffe40d83d5e55b8af02e_c_05_emotions.pdf",
      "content": "Emotions\n&\nEmotions vs cognition\nHot & cold states\nHyperbolic discounting\nSelf-control\n\nEmotions\nWe arrive at the truth, not by the reason\nonly, but also by the heart.\n-- Blaise Pascal\n\nThe Human Brain\n\nAnimal Emotions\nThe limbic system is often thought of as a primitive\npart of the brain as it is present in lower mammals\nand parts are even found in reptiles.\nAnimals need emotions to survive - they need fear\nas a trigger to escape predators and aggression to\ndefend their territory, young and food.\nDarwin thought emotions were merely left over\nfrom our animal past.\n\nLimbic System:Amygdala\n\nWhat do we know about\nemotions?\n- Emotions are fast\n- Triggered automatically\n- Triggered by the environment\n- Moderated at least partially by cognitive\nprocesses\n- Transitory\n\nEmotions, causes or outcomes?\n- I run because I am afraid? or Am I afraid because\nI run?\n- Does it make sense that we could \"read\" our\nemotions? How would we do it?\n- One view is that emotions are basic automatic\nprograms, that when executed just \"run\" without\nthe ability to interrupt\n- Examples: fear or heart-beating creates\nattraction\n\nEmotions, causes or outcomes?\nepi-phenomenon or everything?\n- Qualia (the subjective experience of\nemotions) can be considered as nothing\nelse than a side-effect of emotions\n- Is it a needed side effect?\n- What is the value of feeling emotions?\n\nA few specific effects\n\nThe durability bias\n- Relates to the inability to predict adaptation\n- People over-predict the duration of emotional\nresponses\n- How long will I feel sad after a break-up?\n- How long will I feel happy after getting an A\nin 15.301?\n- How long will I be angry at...\n\n\"muscular emotions\"\n- Nodding can have an effect on evaluations\n- Similar effects can take place for holding\npencils, pushing or pulling furniture etc.\n- Relates to the idea that we can't\ndirectly read emotions and instead we\nread our actions.\n\nIs it better to use\nemotions or to think?\n- The answer is not always clear\n- Sometimes thinking more helps consider other\npossible consequences and long-term effects\n- Sometimes thinking too much can make us\nchoose the wrong outcome\n\nWilson & Schooler\n- \"The disruptive effect of analyzing reasons\"\n- Students were asked to evaluate strawberry\njams / posters\n- Some just made a choice and others were asked\nto deliberate and think about it carefully before\nmaking their choice\n- Who do you think was happier with the product\n(and how would you measure it)? Why?\n\nEmotion summary\n- Emotions are a powerful force\n- Emotions are an important input to decisions --\nsmall and large -- but often we don't recognize\ntheir effects\n- Emotions provide a different type of input to\ndecisions than the cognitive system\n- Emotions are: fast, triggered automatically,\ntriggered by the environment, and transitory\n\nEmotions vs cognition\n- Hot & cold states\n- Hyperbolic discounting\n- Self-control\n\nCognition vs emotions\n- How much are we influenced by\nthese two systems?\n- Affect has the capacity to turn us\ninto virtually different people\n\nEffect of exercise-induced thirst on\njudgments (VanBoven & Loewenstein)\nbefore\nexercising\nafter\nexercising\nsig of\ndifference\nMentioned thirst before hunger\nin essay\n19%\n50%\np<.05\nThirst more unpleasant\n61%\n92%\np<.02\nWould regret more not packing\nwater\n61%\n88%\np<.05\nThirst more unpleasant for\nhikers\n57%\n88%\np<.02\nhikers would regret more no\npacking water\n52%\n92%\np<.01\nPhoto courtesy of James Gathany\n\n- Two main questions\n1) How do people change their\ndecisions under different\nemotional states?\n2) Can they (we) predict this\nchange?\nSimple systems: men\n\n- Hunger\n- Thirst\n- Anger\n- Curiosity\n- Arousal -- seems more fun to\nstudy\nDM under emotional states\n\n- Preferences for different activities\n- Willingness to take risks\n- Willingness to engage in\nundesirable behaviors\nWhat kind of DM?\n\n- Subjects got a laptop, took it home\nand used it to answer questions\n- Two conditions\n- Cold -- not aroused\n- Hot -- aroused\n- Only males\n- we are currently testing also\nfemales\nThe procedure\n\nPreferences ...\n\n- Are women's shoes erotic?\n- Can you imagine having sex with a man?\n- Could you enjoy sex with someone you hated?\n- If a woman proposed a threesome with a man,\nwould you do it?\n- Is a woman sexy when she's sweating?\n- Would it be fun to get tied up?\n- Can you imagine getting sexually excited by contact\nwith an animal?\n- Do you prefer to have sex with the light on?\n- Is \"just kissing\" fun?\nSample questions on preferences\n\n- In a cold state, our\nparticipants predicted they\nwill not* enjoy these activities\n- In a hot state our participants\npredicted they will enjoy\nthese activities\nResults: preferences\n\nRisk ...\nPhotos courtesy of Katje Zanetta Borba and Davide Farabegoli\n\n- If you pull out before you ejaculate, a woman\ncan still get pregnant?\n- Can a woman who is a good friend give you a\nsexually transmitted disease?\n- Would you trust a woman you've just met\nwho says she is using birth control?\n- Birth control is the woman's responsibility\n- A condom decreases sexual pleasure\n- Would you use a condom even if you were\nafraid that a woman might change her mind\nwhile you went to get it?\nSample questions on risk\n\n- In a cold state, our\nparticipants were not willing\nto take much risks\n- In a hot state our participants\nwere willing to take more\nrisks\n- Condom related decisions\nseem different\nResults: risk\nPhotos courtesy of Davide Farabegoli and Katje Zanetta Borba\n\n- To increase the chance a woman will have\nsex with you, would you:\n- take a date to a fancy restaurant?\n- tell a woman that you loved her?\n- encourage her to drink?\n- slip a woman a drug?\n- Would you keep trying to have sex after\nyour date says \"no.\"\nSample questions on\nundesirable behaviors\n\n- In a cold state, our\nparticipants were not willing\nto engage in these behaviors\n- In a hot state our participants\nwere willing to take engage in\nthese behaviors\nResults: undesirable behaviors\n\n- Individuals have different preferences /\nattitudes under different emotional states\n- Individuals cannot predict this effect or intuit\ntheir preferences under a different emotional\nstates\n- (even common emotional states)\n- This can lead to many types of undesirable\nbehaviors ......\nSummary\n\nTopics\n- Hot & cold states\n- Hyperbolic discounting\n- Self-control\n\nDecisions & the future\nTypes of discounting\nTime\nNow\nSoon\nLater\nMuch later\nSame\nMore\nLess\n\"Hyperbolic\"\n\nIntertemporal choice I\nWhich would you prefer:\n$100 Today or $150 in 4 weeks?\n$100 in 50 weeks or $150 in 54 weeks?\nDiscount rates decline sharply with\nlength of time to be waited\n\nIntertemporal choice II\nWhich would you prefer:\n1/2 a box of chocolate Today or a full box\nof chocolate in 4 weeks?\n1/2 a box of chocolate in 50 weeks or a\nfull box of chocolate in 54 weeks?\nDiscount rates decline sharply with length\nof time to be waited\n\nDecisions & the future\nTypes of discounting\nTime\nNow\nSoon\nLater\nMuch later\nSame\nMore\nLess\n\"Hyperbolic\"\n\nAnother \"view\"\nBecause of the hyperbolic shape, the outcome\nis \"time inconsistent preferences\"\nTime\nMore later\nLess sooner\nValue\n\nHyperbolic discount summary\n- Hyperbolic discounting means that we want\none thing at time t1, another at time t2 and\nregret it at time t3\n- The distance to the goal (time, but also physical\ndistance) changes preferences\n- This can create inconsistent time (distance)\npreferences\n- Hyperbolic discounting can arise from the \"hot-\ncold empathy gap\"\n\nTopics\n- Hot & cold states\n- Hyperbolic discounting\n- Self-control\n\nSelf-control\nThis is another aspect of the\nconflict between the two systems\nSelf control\nproblems\nBehavior aimed at\nself control\n\nHyperbolic discounting\n+\nhot & cold inconsistency\n=\nself control problems\n\nOver eating\nImpulsive shopping\nDrug usage\nUnsafe sex\nNot saving\nNail biting\nNot going to gyms\nCuriosity\nProcrastination\nTeen driving patterns\nSelf-Control problems examples\n\nOvercoming self control problems:\nCan, and how can, we fight it?\n- What tools?\n- What strategies?\n- What work?\n- What will not work?\n\n\"He nodded, drawing deeply on the\ncigarette. American. Low tar and\nnicotine. He'd had some trouble finding\nthat kind over here, and he had paid four\ntimes the stateside value. But the French\nbrands he had tried had made him cough.\nBesides, he hoped that hard-to-find\nexpensive cigarettes would help to keep\nhis habit in control\" (Morrell 1982, p.6).\n\n\"There are indeed some people not\nhabitual drunkards, who cannot keep\naway from any alcohol they may have in\nthe house: so they pay the retailer a very\nhigh wage for taking charge of their stock\nof it, and serving it out to them a little at a\ntime...\" (Alfred Marshall, 1919, p. 814).\n\nMechanisms for self-control\nRules of behavior (I don't do X)\nPre-commitment (Agreeing to deadlines)\nRationing (limiting consumption)\nPhysical distance (e.g., alarm clock across the\nroom)\nMental budgeting (e.g., \"entertainment\nbudget\")\n\nPaying in advance for the gym\nPaying premiums for large / small packaging\nVacation homes (time sharing)\nOthers?\nIf people take such steps it means that\nsometime they (we) understand self control\nproblems and try to overcome them.\nHow good are we in this?\nA few market mechanisms\n\n- Awareness\n- Do people have a self-control problem\nwith procrastination? Yes\n- Do they know it? Yes\n- Do they use self-imposed deadlines to\ncurb it? Yes\n- Performance\n- Do they use self-imposed deadlines\noptimally? No, but it does help\nCan we overcome the problem?\n\nOver eating (diets; fat farms)\nImpulsive shopping (lists)\nDrugs usage (pre-commitment)\nUnsafe sex (advertising, planning ahead)\nNot saving (Christmas clubs; Freezing credit cards; direct\ndeposit)\nNail biting (bitter nail polish)\nNot going to gyms (paying in advance)\nCuriosity (?)\nProcrastination (public deadlines)\nTeen driving patterns (immediate punishment)\nSelf-Control problems examples\n\nSelf control in animals\n\n\"If once a man indulges himself in\nmurder, very soon he comes to think\nlittle of robbing; and from robbing he\ncomes next to drinking and Sabbath-\nbreaking, and from that to incivility and\nprocrastination\"\nThomas De Quincey (1785-1859)\nSupplementary Papers\nProcrastination: Example\n\nSelf-control summary\nHow come we do things we don't want to?\nDifferent selves? Different timeframe?\n\"Hot cold empathy gap\"?\nCan we do anything about it?\nStrategic self-imposition of constraints on\nfuture behavior and choices can help but\nthey need external mechanisms\n\nEmotions summary\n- Two systems:\n- Cognitive: Cold, conscious, deliberate\n- Emotion: Hot, fast, instinctive\n- Sometimes the output from the two\nsystems is different:\n- Hot & cold states; Hyperbolic\ndiscounting; Self-control"
    },
    {
      "category": "Resource",
      "title": "r_01_idea_gen.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/f6a59f0a636c08459976f91af71580ab_r_01_idea_gen.pdf",
      "content": "Idea generation\n\nHow to get ideas?\nStart with something you are passionate\nabout\nIntrospect about behavior related to this\ndomain\nCome up with a list of questions\nDecide which one of these questions are\nrelated mostly to the specific domain and\nwhich ones could be more general -- pick\nthe more generals one\n\nIdeas!\nBefore you start working on\nsomething\nSleep on it for a while\nTalk to people about it\nMake sure you like it before you\nstart working on it.\n\nExamples\nWhat does your TA finds\ninteresting and why?\n\nToday\nThink about topics that are of\ninterest you."
    },
    {
      "category": "Resource",
      "title": "rec1expdesign.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/74a5df01094e76dd049797845267e386_rec1expdesign.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nRecitation 1\n(Given by Head TA)\nHandout: Instructions for 1-page proposal (including a sample)\nContact info given: email, phone, office\nSelf description (professional and personal background and research areas)\nThis is one of the few times we will meet as a section, so introductions\n(Each student said their name, major, and something else about themselves.\nMajority were computer science students.)\nAriely is a media lab professor also. He has 2 PhDs, in psychology and marketing.\nHe has changed the class to focus more on critical thinking, emotion, perception,\nmemory, etc. There will also be lots of statistics - a firm grasp of statistics is important.\nYou need to know when people try to lie or mess around with data.\nProject component will include the essay this year. The main grade will be your final\nproject - the evaluation will be based on two things: project execution and writing\nquality. It is not critical that results conform to original predictions. The main focus is\nexecuting a project start to finish, from forming a topic to presenting the project and\ncreating the report.\nYou need to start thinking of research questions - you only have 4 days! (deadline\nMonday)\nThe assignment only needs to be 1 page, graded: plus, check, or minus. This is a very\nimportant assignment, it will dictate the rest of your semester. Choose a topic you really\nwant to work on.\nAre there any questions about the class in general?\nExams will be multiple choice. This can be difficult, the professor is known for planting\nsuspicious choices, and there is limited time. There will be no trick questions, there will\nalways be an answer. The professor was a TA in this class to test it out and developed\nthe multiple choice tests. The midterm, final results will reflect how you are doing in this\nclass, they have a big effect and test your conceptual understanding. The professor is a\nharsh grader.\nThis is all my opinion!\nThis is one of few classes that builds skills that you will carry for the rest of your life.\nReview of Lecture 2\n\nCausality and Correlation: Their relationship is often misinterpreted.\nCausality -> Correlation Causality implies correlation, but not the other way around.\nCausality: X (independent variable) -> Y (dependent variable)\nCorrelation: X<->Y\nE->X->Y\nE is the moderator. X effects Y, but only under certain circumstances. Example: Does\nmusic have an effect on how people do on an exam? E might be the type of music\nplayed. One type might have an effect, and another might not.\nBasic Criticisms\nY->X\nReverse Causality. It is actually Y that is causing X.\nFor example: you might say making lots of money (X) causes a person to be happier (Y).\nBut maybe the reverse is the correct relationship, maybe if you are happy you end up\nmaking more money.\nX U Y Double causality (endogenity)\nIt is the same thing as correlation, but broken down into parts.\nX->E->Y\nE here is the mediator. Taking our Money -> Happy example, perhaps it is really money\n(X) -> possessions (E) -> Happiness (Y)\nX <- E -> Y\nSpurious relationship (no causation!) Maybe it is having a goal in life (E) that makes\npeople earn money (X) and also makes people happier (Y)\nQuestions: mediator v. moderator?\nMediator sits between the independent and dependent variables.\nMusic -> Concentration -> Better exam score\nModerator determines when a relationship holds\nType of music? M/F? (E) -> Music played (X) -> better scores (Y)?\nThink about the relationship, try to tear it apart. Your project proposal is due Monday.\n15.301/310, Managerial Psychology\nRecitation 1\nProf. Dan Ariely\nPage 2 of 5\n\nWe need to talk one on one about your project before you submit your proposal, you can\nset up an appointment with me or send me an email for comment since there are only 4\ndays until it is due.\nMethods to think of Research Questions\nI sat down with the professor for ice cream and he asked me: What is your passion in\nlife? What are you most excited about?\nFor example, one student was really interested in exercise and its effect on people. That\nlead to conversation about weight loss and that lead to how people respond when they are\nasked about their weight, weight changes over the past year. The hypothesis: it depends\non your gender.\nAnchoring\nIn a survey, people are asked first, the last 3 digits of their Social Security number. Then\nthey are asked if they think the number of African nations in the UN is bigger or smaller\nthan that number. Last, they are asked how many African nations they think are in the\nUN.\nIt was found that, for females, their last answer was highly correlated with the anchor (SS\n# digits)\n- What is the most bazaar behavior you have witnessed or heard about in the last\nweek?\n- Procrastination is assumed to be bad, but could it be good? Reverse an\nassumption, list reasons it could be that way, turn one into X\n- Take a basic relationship you know and push it to an extreme. Smoking is\nconsidered bad for your health. Think of external, moderating variables.\n- Look at cartoons - Why is it funny? Why is it not funny?\n- Think about your dreams - they may uncover you basic interests\n- Look at notes you have taken in other classes. In which sections did you take the\nmost notes? It may indicate an interest.\n- Talk to friends.\nSpend 5-10 minutes thinking of ideas with somebody sitting next to you.\nIn the group, choose and share with the class your favorite idea:\n- minority education in science and technology - why do fewer minorities choose\nto go into Science and Engineering? Does it depend on if they went to a private\nor a public school? Can we look at their success at MIT? Did they attend summer\nprograms?\nTA: Can you frame your research question into one sentence?\n15.301/310, Managerial Psychology\nRecitation 1\nProf. Dan Ariely\nPage 3 of 5\n\nWhat effects minority choice to go into science and technology education? (not chosen a\nfocus yet)\nTA: What drives the choice of major? Perceived beliefs of training received? Public\nschool students not feel they are as strong academically? Peers? How do peers affect the\nchoice?\nObjective measures v. Subjective measures (self response)\nPeers affect perceived knowledge\nThis topic may require a longitudinal experiment\nImportant to public policy.\nCompare belief systems between minorities, non-minorities?\n- Effects of free food on College Students. Possible experiment - email a dorm\nabout free food and see who comes\nTA: Controls - age? Living situation? Time available? Exam period v. beginning of\nsemester? Many variables involved. Think about the psychology involved. What is the\ndifference, cheap food v. free food?\nIt is important to design a clean experiment.\n- MIT-Africa program. Friends reacted in a variety of ways. What effects people's\nreactions and feelings toward the program? Does it depend on their gender? If\nthey have traveled? MIT- Africa v. India or Japan? Why is their reaction\ndifferent?\nTA: Make your question more specific. Think about some responses that you have had.\nWhat is driving them? Preconceived beliefs? Classes? Concerns? Long-term career\neffects?\n- Emotional social behavior when two people dance close at parties.\nTo what extent does dancing close effect sexual arousal? Is it the activity? Or mutual\nparticipation? Is there a time factor? Lighting? Standing close? Gender? Conversation?\nWhat happens if you assign partners v. picking your own?\nSocial desirability -> sometimes people will answer how they think they are supposed to\nanswer. Use their own response as an anchor - \"how many people do you think\nwould...\"\n- Free food v. free money\nMoney will make something a transaction\n15.301/310, Managerial Psychology\nRecitation 1\nProf. Dan Ariely\nPage 4 of 5\n\nFood is more like a favor\nThere have been studies on this, I can refer you to papers to read.\n- Do you admire someone more if they are good at something you know about or\nsomething you don't know about?\nTA: I am doing some similar research on envy. It involves a self concept and if the\nfactors involved are relevant to your self concept. Closeness is important, such as if the\nperson is a peer. Envy is a perceived relationship.\nThere is not enough time to discuss all these ideas now, but I will email examples to you\nfrom past semesters. Email me so that we can discuss your ideas.\n15.301/310, Managerial Psychology\nRecitation 1\nProf. Dan Ariely\nPage 5 of 5"
    },
    {
      "category": "Resource",
      "title": "rec2writing1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/98d227ce6828523dbfa064c4bbb479f2_rec2writing1.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nRecitation 2: Writing as Thinking\nOkay, good morning everyone. Didn't we say the last four rows are prohibited?\nWelcome to another... exciting day...\nMary will enlighten us about writing today.\nBefore we move onto that - everyone has submitted the 1 page proposal.\nIf you don't have feedback yet, you will get it today\nYour ideas will have to be consolidated\nAfter you submit 4 page proposal, there is no turning back.\nFinally: CUHS committee on the Use of Human Subjects proposal.\nOur CUHS is fantastic. Great at MIT\nWe will send guidelines tonight of how to write CUHS Proposal.\nSpeaker: Mary E. Caulfield, Technical Instructor, Writing Across the Curriculum\nDoes anyone feel confident in writing their proposal?\nRaise your hand if when you are writing in the sciences, you are writing for experts?\nHow many think if you write for non-experts, you are dumbing down your writing? (a\nfew hands)\nHow many think that when you are talking about a concept, you should generate lots of\nsynonyms so you can restate your concept many times?\nI do want you to keep your own answers/preconceptions in mind\nWriting the Empirical Journal Article by Daryl J. Bem\nDon't skip reading this article, it can save you a lot of time. When you turn in your 4\npage proposal, 3 of us will read your paper. If you read this article, you will avoid being\nshocked when you get your proposal back. We are going to have comments for people,\ndon't see that as a failure. We are trying to save you agony in the future. The purpose of\ngiving us this 4 page article to give you ways to think about your concepts, phrase your\nconcepts to write more clearly.\nWriting as thinking\nPutting your ideas on paper is a difficult transition. If the proposal is not everything you\nwant it to be, don't worry about\nWriting and thinking are interchangeable.\n\nWrite the article that makes sense to your results. There is a lot of planning now, but at\nthe end you will have to look closely at the results you get.\nThink as a process. You are going to be doing interim writing, not to show anyone, but\nto process your results\nIf you can educate your reader, that is a success. It is not a failure when things don't turn\nout how you expect them to be\nIntroduction - gives context\nBecomes more specific\nIntroduces the study\nDiscuss your results - relate to world at large, give context\nConclusions\nCraft of Research (book)\nStart one thing, introduce tension with new info, then a new thing evolves\nIntroduction - establish context\nNew information discovered\n\"Since the dawn of time, parallel processing has been an important concept\"\n-too general\nMethods - What it's like to be a participant in the study.\nBe explicit when discussing the facts - don't speak too much in abstract terms\nWe will want to see the 4 page proposal, the 1st draft, and the final draft all together at the\nend.\nFinding a Topic: Notes from The Craft of Research - Daryl Bem\nResearch = Problems to be solved (all initial observation, can be proved? Verifiable?)\nLots of raw data, but important to think about context of report. New perspective? Facts\nare helpful only in context\nProvide new perspective (the dreaded \"so what\")\nWhy do we write? To remember, Understand, Gain perspective\nTest your ideas against other perspectives\nAnticipate audience's questions.\nWriting instructors - detectors of unclarity\n\"as unclarity detectors, readers are never wrong\" -Daryl Bem\n15.301/310, Managerial Psychology\nRecitation 2\nProf. Dan Ariely\nPage 2 of 6\n\nTarget audience may ask questions that you think are dumb, but there are times you have\nto clarify what seems to be obvious. You may be making assumptions that the audience\nhas not yet made, or using different vocabulary, or the audience wants to know that you\nhave done due diligence. Writing in several drafts will help you do this. Can't do this\nmidnight-6am on the day it is due\nResearch may extend beyond the semester. Primary audience: TA, immediate supervisor,\nresearch supervisor. Be aware of possible secondary audience: students, co-workers,\nothers that do similar work.\nDefine terms, use clear wording, state your assumptions in your work\nRegardless of how much you prepared, there will be things you do not anticipate. Keep\nwriting about your topic.\nTake notes\nOutlines\nDiagrams\nWrite bad drafts\n\"horrible drafts\"\nBreak the process into manageable parts.\nGetting ready to write:\nFind a specific/manageable topic\nGenerate questions, find some that intrigue you - a good way to anticipate audience\nDetermine evidence readers expect\nResearch Sources? Available?\nYour topic will evolve\nYour argument will take shape gradually\nSome research sources will prove more useful than others.\nAcademic writing does not have to be abstract.\nLook at Daryl Bem article!\nThe more reading you do for models in this field, the more you see what we are looking\nfor.\nGive your project a working title\nFocus on the \"how\" and \"why\" questions\nUse unknown areas to construct a \"to do\" list\nThink about what you don't know yet\nList the things you don't know yet\n15.301/310, Managerial Psychology\nRecitation 2\nProf. Dan Ariely\nPage 3 of 6\n\nSet some tasks to give you information to do the things you need to do.\nTranslate writing into outline\nHave it somewhere where it can be changed, altered, modified\nOutline the small steps\nTopics and subtopics\nArticles you have found and would like to read\nComplete the tasks as you are able to (not necessarily in list order)\nTime Management\nTry to write every day (or regular times)\nDon't judge your writing - be curious instead\nPace yourself and allow time for real life\nMoving from hard science to social sciences - switching disciplines, languages\nConsulting to software to academics - all different\nDon't judge your writing\nDon't set unrealistic goals - all nighter won't work\nFew pages per day, let that mount up\nOther class - New Yorker cartoons\nBoy with sled, but just starting to snow. Mom: don't worry, it will accumulate\nDon't neglect reading time\nHow to Keep Going\nFind articles and read them - how to emulate, what is good about that\n-How do we find articles to look at?\nAnything that interests you is a good place to start, look at sources\nAriely: I'm a big fan of my own writing. I will post a couple of articles for an example\nTechnical/Grammatical Tasks\nLast, as it should be\nKeep underlining most important sentences\nAsk if they communicate your point effectively\nLook at a couple sentences\nDon't try to make every sentence, every draft perfect. Make sure you have 2-3 sentences\nthat really \"punch those things forward\"\n15.301/310, Managerial Psychology\nRecitation 2\nProf. Dan Ariely\nPage 4 of 6\n\nWrite a sentence that encapsulates your goal, post it on a sticky note\nMake sure quotes, etc, include full citation while you are doing research.\nThere will be a last minute adrenaline rush when you get down to it\nThat's when plagiarism happens. We're not bad, we just don't have it, no one will notice\nright? We will notice, we read enough that we can tell the difference between something\npublished and student writing\nLook at verbs in your writing\nAvoid repeating things \"each and every\"\n\"pink in color\" \"many in number\"\nMake things more simple\nGreat example, passage reduced by half.\np. 12 of article - 2 inches went down to 1 inch without losing information\nHow many people feel you have to dumb down your writing to write for people?\n-a couple of people\nGet rid of \"meta-language\" to make writing clearer\nWhen you get back your 4 page papers, you will probably see we crossed out a lot. Pay\nattention to what we crossed out. You can live a full and happy life without using extra\nverbs\nPassive voice - see what you can put into active voice\nShorter, more precise, more lively\nFix writing mistakes - make good research better, make your writing clearer\nConclusion - write early, write often\nKeep asking yourself how to make it better\nGet people to critique your work. Pay attention to what they point out. You don't have\nto follow suggestions, but look at what is unclear.\nMake sure your project has a title - specific and as close to your research as you can\nThere are plenty of unanswerable questions - ask something you can answer this term.\nAsk yourself \"who cares\"\nPlan as concretely as you can\n15.301/310, Managerial Psychology\nRecitation 2\nProf. Dan Ariely\nPage 5 of 6\n\nBe explicit about any assumptions you have\nResults\n4 page maximum. If you can do less, that's okay, but make sure you have enough\ninformation. Don't use smaller than 12pt font, should be double spaced.\nAriely\nWhy is it not a good experiment to see who came today and see if you do better on the\nproposal grade?\n-introducing choice\nHow could we do it instead?\n-tell everyone to come, separate into writing lecture/ Ariely lecture groups\n-tell some people not to come to lecture\nGood .\nIf you want my help tonight, send email before nine.\nWe are passing out a survey, answer 1 question at a time, don't look ahead.\n15.301/310, Managerial Psychology\nRecitation 2\nProf. Dan Ariely\nPage 6 of 6"
    },
    {
      "category": "Resource",
      "title": "r_03_probability.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/eab8a7b9e958c9a663a2b2fbcd253cf5_r_03_probability.pdf",
      "content": "Probability\nAn introduction\n\nProbability\nProbability theory presents a\nsystematic way to think about\noutcomes in a stochastic world\nWithout probability it would be\nhard to say if an event is likely to\noccur or not\n\nExamples I\nWhat is the probability of:\nA newborn will be male?\nGetting HH in a coin toss?\nGetting a particular face on a die?\nIn a bag with 1 red, 1 green and 3 blue\nballs. What is the probability to draw a 1)\nred ball, 2) a red or a blue ball?\n\nProbability & Frequency\nBinomial distributions\n\nBinomial distributions\nThese are distributions for cases where\nthe outcomes have only 2 possible states\nThis is the simplest form of probability\ndistribution\nExamples?\nNote, the state of each event are binary,\nbut we could talk about sets of events\n\nThink of 2 coins\nWhat are the possible outcomes if we flip\n2 coins?\nPlease calculate the probability for each\nof the possible outcomes\n\nFrequency of 2 coin toss\n0.5\n0.4\n0.3\n0.2\n0.1\n0.25\n0.50\n0.25\n0H/2T\n1H/1T\n2H/0T\n\nThink of 3 coins\nWhat are the possible outcomes if we flip\n3 coins?\nPlease calculate the probability for each\nof the possible outcomes\n\nFrequency of 3 coin toss\n0.5\n0.4\n0.3\n0.2\n0.1\n0.13\n0.38\n0.38\n0.13\n0H/3T\n1H/2T\n2H/1T\n3H/0T\n\nThink of 6 coins\nWhat are the possible outcomes if we flip\n6 coins?\nPlease calculate the probability for each\nof the possible outcomes\n\nFrequency of 6 coin toss\n0.5\n0.4\n0.3\n0.2\n0.1\n0.23\n0.31\n0.23\n0.02\n0.09\n0.09\n0.02\n0H/6T 1H/5T 2H/4T 3H/3T 4H/2T 5H/1T 6H/0T\n\nCoin frequency\n0.5\n0.5\n0.5\n0.4\n0.4\n0.4\n0.3\n0.3\n0.3\n0.2\n0.2\n0.2\n0.1\n0.1\n0.1\n0H/6T1H/5T2H/4T3H/3T4H/2T 5H/1T6H/0T\n0H/2T 1H/1T 2H/0T\n0H/3T1H/2T2H/1T3H/0T\nWhat can you learn from these comparisons?\n\nOther binomial distributions\n\nBinomial Distribution 60/40 I\n- A dramatic disease causes death in 60%\nof the cases, & only 40% people survive.\n- What is the likelihood that 10 out of 10\npeople survive?\n-\n- Only one possible way to get 10 / 10\n.4 * .4 * .4 * .4 * .4 * .4 * .4 * .4 * .4 * .4 =.0001\n\nBinomial Distribution 60/40 II\n- A dramatic disease causes death in 60%\nof the cases, & only 40% people survive.\n- What is the likelihood that 9 out of 10\npeople survive?\n\nNumber of combinations\nHow many different committees of 5 people\ncan you have from a group of 6 people?\nHow many different committees of 8 people\ncan you have from a group of 10 people?\nHow many different committees of 2 people\ncan you have from a group of 10 people?\nNumber of possible ways = n!/[r!(n-r)!]\n\nn!/[r!(n-r)!]\n5 of 6\n6x5x4x3x2x1 / [5x4x3x2x1x(1)] = 6\n8 out of 10 ?\n2 out of 10?\nn\nr\nn\nr\n()!\n()!\n\nBinomial Distribution 60/40 II\n- A dramatic disease causes death in 60%\nof the cases, & only 40% people survive.\n- What is the likelihood that 9 out of 10\npeople survive?\n\nCalculating bonomial probabilities\nP(r out of n) = number of possible ways one\ncould get r out of n X probability of each way\nNumber of possible ways = n!/[r!(n-r)!]\nP(9 out of 10) =\n0.4^(r) x 0.6^(n-r) = 0.4^9 x 0.6^1 = 0.000157\n10!/9!1!=10\nP(9 out of 10) = 0.00157\n\nBinomial Distribution 60/40 II\n- A dramatic disease causes death in 60%\nof the cases. Only 40% people survive.\n- What is the likelihood that at least 7 out\nof 10 people survive?\n-\nA bit more complex ...\n\nCalculating bonomial probabilities\nP(r out of n) = number of possible ways X\nProbability of each way\nNumber of possible ways = n!/[r!(n-r)!]\nP(7 out of 10) =\n0.4^(r) x 0.6^(n-r) = 0.4^7 x 0.6^3 =\n0.00035389\n10!/7!3!=120\nP(7 out of 10) = 0.0425\n\n7 or more out of 10?\n7 out of 10 + 8 out of 10 + 9 out of 10 +\n10 out of 10\nWhen we calculate the probability of an\noutcome (7), most times we calculate the\nprobaility of the outcome or a more\nextreme outcome\n\nBinomial summary\nBy using the binomial distribution we\ncan directly calculate the probability of\nan event (or a more extreme set of events)\nWe can compare this probability to 0.05\nand decide if it is significant or not\nThis can be very tedious if we want to c\ncalculate the probability of a range of\npossible events (x or more extreme)\n\nCalculating probabilities\n\nCalculating probabilities I\n6 coins tossed:\nn = 6; p = .5; q = .5\nTheoretical mean (μ) = np = 6 * .5 = 3\nThe mean is the expected (unbiased) central\ntendency of the distribution\n\nCalculating probabilities II\nWhen we calculate the distributions there are\nother measures we can easily get\nVariance (^2) = n *p*q\nStandard deviation =\nz = (r-μ) /\nThe z score is very important because it\nwill give us the probability of event r\n\nZ scores\nz = (r-μ) /\nZ for 6 heads is?\nz = (6-3) / 1.225 = 2.45\nLook for z = 2.45 in the Normal distribution\ntable. What is the p?\n\nPlease calculate I\nIf you observe that 44 of the 50 infants that\nwere born at MGH yesterday were females,\nwhat could you argue?\nWhat probability would you give to this\nevent?\nWould you argue that the probability of\nfemales being born at MGH is above 50%?\n\nAnswer I\nn = 50; p = 0.5; q = 0.5\nTheoretical mean (μ) = np = 50 * .5 = 25\nVariance (^2) = n *p*q = 12.5\nStandard deviation = = 3.53\nz = (r-μ) / = (44-25) / 3.53 = 5.38\n\nPlease calculate II\nIf you observe that 10 of the 12 times a\nroulette wheel landed on red, what could you\nargue?\nWhat probability would you give to this\nevent?\nWould you argue that the probability of the\nroulette wheel landing on red is above 50%?\n\nAnswer II\nn = 12; p = 0.5; q = 0.5\nTheoretical mean (μ) = np = 12 * .5 = 6\nVariance (^2) = n *p*q = 3\nStandard deviation = = 1.73\nz = (r-μ) / = (10-6) / 1.73 = 2.31\n\nCalculating binomial probabilities\nWe do this by considering the distributional\nprobabilities of the binomial distribution.\nWhich is close to the normal distribution\nThis lets us calculate the probability of a\nrange!\n\nCompound Probabilities\nDisjunctive probabilities linked by addition\nA or B\nConjunctive probabilities are linked by\njoint occurrence\nA and B\n\nLinda\nLinda is vegetarian, she wears sandals even in\nthe winter, she is active in the women literary\nsociety, and her hair usually needs a trim.\nPlease write down the probability of the\nfollowing:\n1) Linda is a bank-teller\n2) Linda is a feminist bank-teller\n\nLinda\nConjunction: X and\nFeminists\nBank-\ntellers\nY means lower probability\nFeminist bank-tellers\n\nDisjunctive and conjunctive\nProbabilities\nDisjunctive\nConjunctive\n\nDisjunctive\nIn a bag with 1 red, 1 green and 3 blue\nballs. What is the likelihood that you draw a\nred or a green ball?\nIn a bag with 1 red, 1 green and 3 blue\nballs. What is the likelihood that you draw a\nred or a blue ball?\nDisjunctive probabilities are simple -- they\nare the probability of the joint event\n\nMore disjunctive questions\n10% of the students are always late to 15.301\n25% of the students shower at least once a\nweek\nWhat is the likelihood that a student drawn at\nrandom will be tardy or clean student?\nWhat is the likelihood that a student drawn at\nrandom will be a late or unclean student?\n\nDisjunctive summary\nDisjunctive probabilities use the word or, but\nmean the probability or either (both).\nIt is important to note whether the events are\nindependent or not -- what is the overlap\nbetween the events.\n\nConjunctive probability\nHead\n(0.5)\n(0.5)\n(0.5)\nHead\n(0.5)\n(0.25)\n(0.25)\nH&T\n(0.5)\nThe Probability pathway\nWhat is the probability for one H and one T?\nTail\nTail\n\nConjunctive II\nIn a bag with 1 red, 1 green and 3 blue\nballs. What is the likelihood that in 2\ndrawings you get 2 red balls?\nIn a bag with 1 red, 1 green and 3 blue\nballs. What is the likelihood that 2\ndrawings you get 1 red and 1 blue ball?\n\nMore conjunctive questions\n10% of the students are always late to 15.301\n25% of the students shower at least once a\nweek\nWhat is the likelihood that a student drawn at\nrandom will be tardy and clean student?\nWhat is the likelihood that a student drawn at\nrandom will be a late and unclean student?\n\nConjunctive summary\nConjunctive probabilities use the word and,\nbut mean the joint probability.\nIt is important to note whether the events are\nindependent or not -- what is the overlap\nbetween the events.\n\nCentral limit theorem\nThis is about the behavior of real data!\nApproximations of true distribution improves\nwhen number of single samples increases\nAs we take more sets of samples, the\ndistribution of samples better approximate\nthe normal distribution\n\nFrequency of 6 coin toss (10)\n0H/6T 1H/5T 2H/4T 3H/3T 4H/2T 5H/1T 6H/0T\n\nFrequency of 6 coin toss (100)\n0H/6T 1H/5T 2H/4T 3H/3T 4H/2T 5H/1T 6H/0T\n\nFrequency of 6 coin toss (1,000)\n0H/6T 1H/5T 2H/4T 3H/3T 4H/2T 5H/1T 6H/0T\n\nSampling from another distribution\nUsing the RAND() function in excel\nThis is a uniform distribution\nRounding the numbers to 1-8\nThis also creates a truncation at the\ntwo extreme categories (1 & 8)\n\nRandom sample from 1-8 (10)\n\nRandom sample from 1-8 (100)\n\nRandom sample from 1-8 (1,000)\n\nWhat about sampling samples?\nThis time we will take samples of 5\nnumbers (and take their mean)\nAs we sample more of these samples, how\nwill the distribution of samples look like?\n\nSample of 5 sample from 1-8 (10)\n\nSample of 5 sample from 1-8 (100)\n\nSample of 5 sample from 1-8 (1,000)\n\nCentral limit theorem\nThis is about the behavior of real data!\nApproximations of true distribution improves\nwhen number of single samples increases\nAs we take more sets of samples, the\ndistribution of samples better approximate\nthe normal distribution\n\nSummary\nProbability\nThis is the base of stattistics...\nBinomial:\nA way to calculate probabilities of\nevents directly\nCentral limit theorem"
    },
    {
      "category": "Resource",
      "title": "rec3probability.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/70858e4bf79baf89a71d37b829c9a5c7_rec3probability.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nRecitation 3: Probability\n(a dash \"-\" indicates student responses)\nProbability: An introduction\nToday we talk about probability theory\nIt is the first step in understanding statistics.\nProbability theory - a systematic way to think about outcomes in a stochiastic world\nWhat do we know about probability?\n-probabilities are not certain\nWhy is the world not certain?\nIf you go to someone in the morning, you cannot be 100% sure what they will say back.\nWhy not? Why do people react in different ways to different things?\n-because they have the choice\nIf we have a pile of bricks and we kick them, they always do the same thing\nIf we have people and we kick them.... They react differently\n1. The world is really probabilistic\n2. We might not be able to take everything into account.\nIf could write an equation with everything included, the world might be deterministic\nBut as we see it, it's probabilistic.\nWe use intuition all the time\nWhen you study for exams, you succeed or not\nIt is not always clear what will happen\nWhat is the probability of a newborn being a male? ~50%\nHH in coin toss .25\nGet a 6 on a die? 1/6\nChoosing the one blue ball out of a bag of 5 balls 1/5, one of the others, 4/5\nProbability and Frequency - Binomial distributions\nSystems with 2 possible outcomes\nLike:\nDie or stay alive\nSick or healthy\nYes or no\n\n__ __ __ __ __ __ __\nYou don't always have to ask about one event.\nWhat is the probability that out of 100 kids, 17 will be girls, and the rest boys...\nOr first x girls, then y boys, then z girls, etc....\nPossible outcomes of tossing 2 coins: HH HT TT\nWhat are the probabilities of getting each?\n(.25 .5 .25)\nThink of 3 coins\nWhat are the possible outcomes?\n(HHH HTT HHT TTT)\nPlease write down the probabilities for each of these events.\n(1/8 3/8 3/8 1/8)\nFor 6 coins? (if we don't care about order?)\nHow many outcomes? (7)\nPlease write down the probability for each of these 7.\nHHHHHH THHHHH TTHHHH TTTHHH TTTTHH TTTTTH TTTTTT\nHow do you do it?\n-the easiest way is the binomial solution\nSuppose we want to enumerate it, how do we do it?\nThere are 2 components if we calculate by hand: how many possible outcomes? How\nmany times would they occur? Multiply the outcomes by how many times they occur.\nWe just have to figure out all the combinations.\nIt gets harder and harder for larger amounts. We have to come up with something better.\nLook at these 3 distributions (see slide). What can you learn from the differences of\nthese 3?\n-more trials you get, the more it looks like a bell shaped curve\n-symmetrical\n-more possibilities gives a lower probability overall (for individual events)\nIf I threw an infinite number of coins, what is the probability that I will have half and\nhalf, heads and tails?\n-Exactly 0. If there are infinite coins, you get a slimming bar corresponding to 50/50,\nslims to 0 as the coins go to infinity\nThe probability of any particular event goes to zero because you divide by infinity\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 2 of 10\n\nIf we throw 2 times or 6 times, which is the better chance of getting a 50/50 distribution?\n-2 times. There are more possibilities for outcomes if we toss 6 times. Fewer trials means\nmore width devoted to each option.\nWhen we toss 2 coins, the probability of getting 50/50 is .5. At 6 coins, it is .3-something\nIt is counterintuitive to get farther away as we toss more coins.\nWe would expect that the more coins we throw, the closer we would get to 50/50.\nHow do we solve this problem?\n-going discreet to continuous\nIt is important to focus on the range, not a specific value.\nProbability of .5 boys is less the bigger the hospital is.\nWe need to take the probability .5 or higher to get higher precision\nOr if we define the distribution from .5, define a range, a width, an interval.\nOther binomial distributions\nQuestions about Class\nWe had some questions from students\nThe basic question - what exactly is this class? And there were many related questions.\nLet me give general answer:\nThis class is technically known as a mish mash.\nOver the years it became communication intensive - the writing, presentations.\nAnd there is also the lab part - we cover statistics, etc.\nThen the rest is managerial psychology\nSo how do you cover managerial psychology in 8, 9, 10 lectures?\nI could have chosen a topic, lets say labor, and concentrated on that.\nBut your path is not clear to me, probably not to you either.\nSo we are doing an overview and I will give you an idea of how to apply what you are\nlearning to management\nLets talk about the lecture on perception - how does that relate to management?\nFor example, Adaptation - how does adaptation link to salaries? If you have a pay level,\nyou get used to it, and you are happy if there is a change and you get a raise.\nThink about the basic principles and apply them to different scenarios\nI don't want to tell you how to apply them to what is interesting to you.\nStart with perception and memory, go from there\nWe will get more and more applied as we go through the topics.\nRelativity of perception is one of the central themes.\nAddressing concerns about exams:\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 3 of 10\n\n-10\nWe will give you practice questions before the exam.\nBasically, you have to do the reading.\nEither think about measurement or managerial psychology\nTake the alien abduction article last week - what mechanisms in the paper caused people\nto think they were abducted? What is the main message? We are not going to ask when\nthe article was published, etc.\nAre there other questions about the structure of the class? No?\nFabulous.\nNow we will talk about binomial distribution\nLets look at a 60/40 distribution.\n(Slide)\nThere is a probability of .6 that people will die in a situation, what is the likelihood 10/10\nsurvive?\n-They are independent events, multiply them. It doesn't make sense to add, subtract,\ndivide. Multiplication is the only operation I could think of that made sense.\nMultiply probabilities of each because they are independent -> .410\nWhat is the likelihood 9/10 will survive?\n- .49 times .6\nTake the probability of 9 people surviving, and multiply by .6, is that right?\nWe could also read it as 9/10 or 10/10 survive - at least 9 people survive.\nWhat do we do between the two?\n-add them\nWhy?\n-It makes sense☺\nProbability - the first 9 live and last one dies, could be other combinations? How many?\nWe need to take that into account.\nIs it about a number or an interval?\nExample: If we form committees in this class, how many different committees of 5\npeople can you have from a group of 6?\n-6.\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 4 of 10\n\nYes, kick each person out once.\nYou can also think of how many committees can be formed with 1 person - it is the same\nthing\nHow many committees of 8 can come from a group of 10?\n-45\nThat is a bit more painful.\nAs the numbers get larger, we need more systematic way to calculate these things.\n(slide)\n(n r)!\nn!/[r!(n-r)!]\nPlease calculate the number of combinations of 8/10 people\n-45\nBasically we do what?\n10x9x.../8x7... x2\nEnumerate all the combinations.\nA slightly more complex problem:\nAt least 7/10 people survive. What do we do?\nTreat the problem as 4 separate events.\nMultiply .4 for each survivor x .6 for those that die.\n1. Find the possible combinations\n2. Multiply, then add across.\nTo summarize binomial distribution:\nCounting is all we need, we have a shortcut for counting, we can do lots of things with\nbinomial distributions\nHistorical excellence: Fischer decided that if the probability is < .5, it is significant\nLet us say the probability that you have 17 boys born one after other is .000001, we have\nto decide, is it by chance that this happened? Or is it not by chance?\nWe have a roulette wheel. The results are 600 black and 400 red. We can calculate the\nprobability of this happening. Then we have to ask the question - is the wheel faulty or\nnot? Do we force the casino to change wheel or not?\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 5 of 10\n\nFischer did agricultural experiments\nMore water, less light, etc.\nProbability that a condition yields more growth is .2\nIs this our current understanding of the truth or not? How do we act on it?\nFischer picked a number. If the probability of getting a result is less than .05, the event is\nnot chance.\n-Didn't you say the probability of one event was almost 0?\nWhat was I not precise about?\n-Distribution\nYes, the probability of getting 200 reds vs. the probability of getting the first 200 reds.\nNow we will calculate probability in a more sensible way rather than calculating all of\nthe possibilities.\nThis will give us a range very easily\n6 coins are tossed. Find P(H) and P(T)\nIf half the time we get heads, .5 times q.\nFor the first measurement we take, the mean is n*p\nNext, calculate other things: variance, standard deviation, z score\nVariance - how wide is the distribution?\nStandard deviation - square root of the variance\nZ score = (r-μ)/σ\nStandard deviation = σ\nVariance = σ2 = n*p*q\nZ score gives the probability of event r.\nWhat have you experienced that uses these measures?\n-Tests at MIT\nBefore MIT?\n-SAT\nNot exactly the z score, but it has a known mean, a known standard deviation.\nA score of 800 is 3 standard deviations above the mean.\nPlease calculate the z score of getting 6 heads.\nIf you have it, please raise your hand.\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 6 of 10\n\nI'll give you a few more minutes.\n-\n(slide)\nR is our observation.\nHow many heads would you expect? How many do you get? How different are those\nthings?\nN - # of times throwing a coin\nP and Q are outside of what you observe - your belief about what it is.\nFor a coin -> P = .5 for each side (Heads, Tails)\nWith this z score, is this a fair coin?\nIf this was SAT, what would be the score of this?\nHow likely is it that the coin is a good coin with a real probability of .5? How do we\ntransform z score to probability?\nHint - we have a paper that tells you. This table was the rave before computers. And it\nis still useful.\nThere is a table for negative and positive values. It is photocopied from your book.\nIf you find 2.4, to over to .05, it gives the probability at 2.45.\nIs the coin fare or not?\nYou have to decide right now. Would you gamble against it? Would you gamble on\ntails?\nOften people will say something to you. But if you get people to act, it reveals their true\nbeliefs.\nIf 44/50 infants born at MGH yesterday were female, what could you argue?\nWhat probability would you give this event?\nWould you argue that the probability of a female being born at MGH is above .5?\n-Do we assume P = .5 for females born normally? Isn't that circular? We are concluding\nthat the original assumption is wrong.\nIs something odd at MGH? Maybe the people, the water, the atmosphere is different for\nsome reason.\nImagine they were above average intelligence instead of female, should we investigate?\nThe event doesn't matter, take a particular event - is this an oddity, should we\ninvestigate, or did it happen by chance?\nHave you solved it, anyone?\nEverything above what number will be significant in Fischer's terms?\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 7 of 10\n-5.38\n\n-1.6\n1.6 what?\n1.65 for the example is very close to 5 percent (see table).\nEvery time you see something around that, you can take notice\n-We can't quantize how likely that is fluke vs. what is not\nBasically we say: is this from a distribution that is close to 50 percent?\nIt is a very tricky question. We will come back to it.\nExample:\n10/12 times, a roulette wheel landed on red. What could you argue, what probability\nwould you give to this event? Would you argue that the probability of the roulette wheel\nlanding on red is above 50 percent?\nSolve this at home.\nLast time on the test, without practice, people didn't get this. This time we will test with\npractice and see.\n-can you work backwards to find out which is better?\nThere is no way to take a z and say \"this is the right probability.\" You can say, given this\nobservation, what is the range in which I expect this z to fall? You can't find out the\nspecific interval\n-the range is based on .05, right?\nYes.\n-Can p and q be less than 1?\nTogether? No. The sum has to be 1.\n(slide)\nLinda is vegetarian, wears sandals even in winter, and is active in a women's literary\nsociety. Her hair usually needs a trim.\nWhat are the probabilities that:\nLinda bank teller\nLinda is a feminist bank teller\nWrite these probabilities.\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 8 of 10\n\nMany people write a higher probability for feminist bank teller.\nLinda has to be more likely a bank teller than a feminist bank teller.\nIt is a conjunctive fallacy.\nBoth have to occur for the second option to be true\nConjunctive - all overlapping sections happen at the same time\nDisjunctive - one of the overlapping sections happens at a time\n(Slides) disjunctive questions\nCan we answer this? No\nWhat if I say the clean students are always on time?\nSorry, if all those on time are also clean.\nBasically we need to think about the dependency.\nConjunctive: AND\nExample: Our famous bag (slide)\nLikelihood of 2 red balls\n-with replacement?\nYes.\nBasically multiply probabilities\nTake those same late and clean students -\nprobability(tardy and clean student)?\n0 in current picture\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 9 of 10\n\nIf 10% are late and 25% shower at least once a week,\nHow many are tardy or clean? In this situation, 35%\nSay all of the late people also showered at least once a week.\nP(late or unclean) = 75%\nDisjunctive: OR\nImportant to know overlap\nIf we don't know, multiply probabilities\nAND - joint probability, the overlap.\nIt is important to understand the dependency. It is easy to calculate if they are\nindependent, hard if they are not.\nCentral Limit Theorem\nIt is about the behavior of real data\nThe more samples we take, the closer it gets to the distribution.\nThis is surprising. No matter what distribution we start from, take average\nExample - uniform dist 1-8 (slides)\nEven though started from a uniform distribution, distribution of samples will resemble\nthe uniform distribution at the end of the day.\nProbability is the basis for stats\nBinomial is the easiest way to look at the probability of events\nCentral limit theorem\n15.301/310, Managerial Psychology\nRecitation 3\nProf. Dan Ariely\nPage 10 of 10"
    },
    {
      "category": "Resource",
      "title": "r_04_survey_d.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/fde985c1e908e1e200199822a3ec133f_r_04_survey_d.pdf",
      "content": "Survey design\n&\nTaking measurements\n\nLets try ...\n- Make up a question to ask anything\nyou want to know about MIT students\n(do not use a yes / no question\nformat)\n- Write down your question and its\nresponse scale\n- Examples ...\n- Turn to your neighbor and present\nyour questions to each other\n- Why this question, why this\nresponse scale etc.\n\nHow do people\nanswer questions?\n\n3 cognitive stages in\nanswering questions\n-\n\"File drawer\" view:\n- Attitudes are stable dispositions that are\nstored in long-term memory, and you just\nretrieve them\n-\n\"The constructive\" view:\n- Attitudes are constructed on the fly,\ncomputed when necessary from whatever\ninformation comes to mind\ninterpret\nquestion\nretrieve info\n&\nform judgment\nmap judgment\nonto response\nscale\n\nDo people interpret the question as\nintended?\n- What brand of soft drink do you typically\nbuy?\n-\nWhat is the time period involved? (How far back do I go ... I\nbought Gatorade in the summer; Hi C when I was a kid)\n-\nDo purchases at movies, in restaurants, & sporting events\ncount?\n-\nDoes \"you\" refer to me or to my household?\n-\nWhat is a \"soft drink\" exactly?\n-\ndo lemonade, iced tea, fruit punch, & mineral water count?\n-\nAre Coke and Cherry Coke the same brand?\ninterpret\nquestion\nretrieve info\n&\nform judgment\nmap judgment\nonto response\nscale\n\nCan people retrieve the relevant\ninformation?\n- How many ounces of alcohol\ndid you consume last year?\n- What would be a better question\nto ask?\ninterpret\nquestion\nretrieve info\n&\nform judgment\nmap judgment\nonto response\nscale\n\nHow do people select\nresponses?\n-\nHow successful are you?\n- on a scale from 1 to 10?\n-\n- Is 10 the valedictorian of your high\nschool? Ted Turner? Michael Jordan?\ninterpret\nquestion\nretrieve info\n&\nform judgment\nmap judgment\nonto response\nscale\n\n3 cognitive stages in\nanswering questions\nTo design a good question you MUST be certain\nthat people can\n1) Interpret your question as you want them to\n2) Access the relevant information\n3) Map their response on the scale in a\nmeaningful and consistent (across and between\npeople) way\ninterpret\nquestion\nretrieve info\n&\nform judgment\nmap judgment\nonto response\nscale\n\nEffects of scale\nformats\n\nEffects of scale format\nHow successful have you been\nin life ?\nNot\nat all\nVery\nmuch\nNot\nat all\nVery\nmuch\n-5 -4 -3 -2\n-1\n\nResponse scale provide cues for\nthe \"normal\" levels of a behavior\n_____ _____ _____ _____ _____ _____\nup to .5 .5 to 1 1 to 1.5 1.5 to 2 2 to 2.5 more than 2.5\nHow many hours a day do you spend watching TV ?\n_____ _____ _____ _____ _____ _____\nup to 2.5 2.5 to 3 3 to 3.5 3.5 to 4 4 to 4.5 more than 4.5\nHow many hours a day do you spend watching TV ?\n7% 18% 26% 15% 18% 16%\n62% 23% 8% 5% 2% 0%\n\nResponse scale provide cues for\nthe \"normal\" levels of a behavior\n0 1 2 3 4 5 6 7 8 9 10 >10\nHow many times do you floss in a typical day ?\n0 1 2 3 4 5 6 7 8 9 10 >10\nHow many times do you floss in a typical year ?\nHow likely are you to develop gum disease?\nHow much would you pay for a bottle of Scope\nmouth wash?\nOther examples ....\n\nEffects of scales:\n- In many cases the scales we give\npeople are not ones they are used to\nthink about (even hours of watching\nTV)\n- In such cases people use the scales to\ndetermine the acceptable range and\ntheir subjective fit within the range\nto determine their response\n\nThe importance of context\n1a. How bad is it to jaywalk?\n2.\n0 1 2 3 4 5 6 7 8 9 10\nnot at very\nall bad bad\n\n2. How bad is it to spray paint\nthe side of a building?\n5.\n0 1 2 3 4 5 6 7 8 9 10\nnot at very\nall bad bad\n-\n\n1b. How bad is it to murder your\nprofessor?\n2.\n0 1 2 3 4 5 6 7 8 9 10\nnot at very\nall bad bad\n\n2. How bad is it to spray paint\nthe side of a building?\n4.\n0 1 2 3 4 5 6 7 8 9 10\nnot at very\nall bad bad\n-\n\nEase of recall affects liking I\nCondition 1\nCondition 2\nList 10 reasons\nwhy you love X\nList 3 reasons\nwhy you love X\n1. __________\n2. __________\n3. __________\n4. __________\n5. __________\n6. __________\n7. __________\n8. __________\n9. __________\n10. _________\n1. __________\n2. __________\n3. __________\n\nEase of recall affects liking II\nCondition 1\nCondition 2\nList 10 reasons\nto buy a BMW\nList 3 reasons\nto buy a BMW\n1. __________\n2. __________\n3. __________\n4. __________\n5. __________\n6. __________\n7. __________\n8. __________\n9. __________\n10. _________\n1. __________\n2. __________\n3. __________\n\nEffects of scales:\n- The constructive view of preferences:\n- People do not know but if you ask them\nthey will give you an answer\n- And they will be sure about it\n- But .....\n- In some cases people\"learn\" about\nthemselves from their own answers\n\nQuestion Order I\n1) How satisfied are you with your life overall?\n2) How is the weather? How satisfied are you\nwith your life overall?\n-\n- In one of these conditions, was there a strong\ncorrelation between current weather (whether\nit was raining outside or sunny) and people's\nappraisal of their life as a whole.\n- In which of these two conditions was the\ncorrelation observed.\n\nQuestion Order II\n1a) How many dates did you have last\nmonth?\n1b) How satisfied are you with your life,\nin general?\n-\n2a) How satisfied are you with your life,\nin general?\n2b) How many dates did you have last\nmonth?\n\nResponse language\n- Asking questions is a part of a\ndiscussion\n- People make assumptions about\nthe intended meaning\n- Think about what the question\nsuggests / assumes / implies in\nthe context of a conversation\n\nSummary\n- The way we ask questions can\nhave a large effect on how\npeople understand the questions,\ninterpret them, and ultimately\nanswer them\n- Be careful!!!\n\nExtracting sensitive\ninformation\n\nExtracting sensitive information I\n1) Do you happen to have done X in\nthe last year?\n2a) As you know, many people have\nbeen doing X these days. Do you\nhappen to have done X?\n2b) Do you know anyone who has\ndone X? How about yourself?\n\nExtracting sensitive information II\nPull a coin from your pocket. If it lands Heads, answer\nQuestion 1. If it lands Tails answer Question 2:\n1.\nIs your birthday between Jan 1st and June 1st ?\n2.\nHave you ever done X?\nH (0.5)\nT (0.5)\n0.5\n0.5\nYes (25%)\nNo (25%)\nYes (40%)\nNo (10%)\nYes X (80%)\nNo X (20%)\nYes = 65%\n\nSensitive information\n- Much of the information we are\ninterested is sensitive\n- More so as people get more\nsuspicious!\n- There are workarounds\n- In many cases it is recommended\nto try and estimate the effect\nof hiding information\n\nLets go back ...\n- Look back at the question you\nwrote earlier. Is there anything\nthat you would change?\n- Even better...\n- Look back at the question your\nneighbor wrote earlier. Is there\nanything that you would change?\n\nMeasurement summary\n- The constructive view of answering\nquestions\n- The effects of scale formats (numbers,\nrange, working, expectation etc.)\n- Extracting sensitive information"
    },
    {
      "category": "Resource",
      "title": "rec4_survey_d.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/f2c1eb83c9fda28d1d9192c7357ddcad_rec4_survey_d.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nRecitation 4: Survey Design\n(a dash \"-\" indicates student responses)\nSurvey Design and taking measurements\nI hope you have prepared for class today.\nDo you wake up thinking about measurement in surveys? Does it not make you jump out\nbed?\nToday, we will write survey questions. Sit next to someone.\nCan how a question is phrased influence the response?\nHow could we influence the prediction - if bush or Kerry will be elected?\nDon't sit in the last 4 rows, as we agreed\nHere is what I want you to do:\nMake up a survey question to ask anything you want to know about MIT students. Do\nnot use a y/n format. Write down your question and the response scale.\nOnly limit: not y/n\n(waits a couple of minutes.)\nWhat is your question and the response scale?\n-Do you feel you are able to balance your academic and social life?\n-Strongly disagree Disagree Neutral Agree Strongly agree\nTurn to your neighbor and present your questions to each other. Tell them why you\nchose your question and your response scale\n(late person walks in)\nWe were just discussing things that embarrass us, it is your turn...\nLecture\n3 steps to answer survey Questions:\nInterpret the question\nRetrieve info and form judgment\nMap judgment onto response scale\nFile Drawer view:\nAttitudes are stable dispositions stored in long term memory, and you retrieve them\n\nConstructive view:\nhave to create info\nattitudes are constructed on the fly and computed when necessary from whatever\ninformation comes to mind\nInterpretation\nWhat brand of soft drink do you usually buy?\nA simple question to interpret, no?\nAll of your life? Summer and winter? Recently?\nYou?\nFriends you buy for?\nDiet Coke and Coke the same brand?\nCan be interpreted in many ways.\nDifferent people think differently about the question = variance\nQuestions about action are the most open to interpretation\nRetrieve\nHow many ounces of alcohol did you consume last year?\nhard to answer, not accurate\nWhat would be a better question to ask?\nMapping\nHow successful in life are you 1-10? What is 10? Is 10 the valedictorian?\n-Compare to bill gates\n-happy self is 10\n-it is where you set your expectations for yourself\n-top 10% of population would be a 10\nThis is a very tricky topic\nTo design a good question, you must be certain people can:\n1. Interpret the question in the way you want them to\n2. Access the relevant information\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 2 of 7\n\nHow much wind have you experienced in the past week? Not a reasonable question, you\nwon't remember.\n3. Map their response onto the scale in a meaningful and consistent way within a person\nand across people\nScale formats\nHow about this (slide)\nHow successful have you been in life?\n0 to 10\n-5 to 5\n-nobody wants to be negative\nNegative 5 implies failure\nHow about 0? Should we have a 1 to 11 scale?\nThe response scale provides cues for the \"normal\" levels of behavior.\nTV (slide)\nHow many hours a day do you spend watching TV?\nReal data, 2 response scales\nDifference - almost double in the >2.5 category\nIf you take a bathroom break in the middle, do you subtract that time?\nIf you eat while you are watching TV, does that count too?\nThe scheme is very simple, but not consistent\nWhy the difference?\n-search to classify activities as tv\nUse scale to establish a range\nIf I think I am slightly above average, I might choose the second category\nExample:\nPsychologists were given a description of a mental patient and asked the likelihood that\nthe mental patient would commit a crime again? They were given a scale of 1%-9% or\n9%-100%\nBoth groups answered in the middle of the range.\nThese were professional psychologists!\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 3 of 7\n\nFloss (slide)\nHow many times in a day, 1-10?\nHow many times in a year, 1-10?\nHow likely are you to develop gum disease?\nHow much would you pay for a bottle of scope mouthwash?\nIf you answer on the left end of the scale, do you feel you need to go to the dentist?\nDoes the top or bottom scale affect your answer?\n-top scale 10x a day not reasonable, ridiculous\nBut the general effect is true for the scales\nSchwartz example:\nSame scale, but question: how often do you masturbate?\nThen asked, how happy is your love life?\nTo change your own interpretation of your love life is profound. You should be familiar\nwith your own love life.\nThey replicated the experiment in Germany, where there are less strict guidelines\nThe surveyor offered her phone # if asked - those who answered that they were unhappy\nwith their love lives asked for the number.\nReading into it, construct #s\nImagine questions that, after answering them, you are more pro Bush or pro Kerry\nSurveys can create preferences, not just learn them\nActual Bush supporter Question:\nHow would you feel if you learned that McCain had a child by a black prostitute?\nIt was not true, but later a paper showed him with his adopted black child, and people\ntook it as evidence that it was true.\nEffects of scales (slide)\nIn many cases, it makes people reinterpret their own behavior\nImportance of context (slide)\n1. If jaywalk, rate how bad\n2. If kill Professor, rate how bad\nWhat do you think would happen to question 2?\n-compare to question 1 badness\nWhat is very bad is already determined by the first one.\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 4 of 7\n\nScale not only based on the question's scale, but also previous questions\nS.O.'s (slide)\nList 10 reasons you love X\nOr List 3 reasons you love X\nIs there a difference?\n-condition 1 higher, more reasons\n-condition 2 higher, can't think of enough to fill list\nFor most 10 is hard, people run out\nFollow up: how much do you love your S.O.?\nCondition 1 gave lower answers.\nThe process implies you should be able to come up with 10 reasons\nSay I wanted a higher evaluation at the end of semester. What could I ask to change the\nclass rating?\n-list 3 reasons you love this class\n-compare to a class you know they hate\n-list 10 reasons you don't like this class, and they will run out\nAs you can see, there are a lot of possibilities for application\nAnother - if want people to buy BMWs\nQuestion 1 or2?\nVote.\n2 is the answer\nConstructive view of preferences\nMany examples suggest people don't know their preferences\nOnly when you ask does it materialize.\nIf you ask, they give an opinion - if you stop to ask for directions, people will give\ndirections, sometimes even if they don't know them.\nSometimes people learn about themselves from their own answer\nQuestion Order\n(Slide)\nPeople think question 2 is correlated with the weather. Why?\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 5 of 7\n\n-think weather, then answer\n-life more positive if bad weather\nQ1 actually correlated.\nInterpretation of the question based on what they think you are asking\nPeople think you would not be asking the same question a second time, that you are\nasking for new information\nQuestion Order II (slide)\n1st correlated, 2nd uncorrelated\nResponse language\nPeople think in terms of discussion\nWhere are you from?\n-Virginia\nHow is it there, scale of 1-10?\nIf I say 1st, \"summer is coming,\" you assume I want to visit\nExtracting sensitive information\nThe more people feel they cannot trust a situation, the less likely they will give sensitive\ninformation.\nMoney experiment in hallway at MIT - free money: $1, or $5, or $10, or $50\nThe bigger the amount, the more suspicious it is, and fewer people go for it.\nHow can we overcome this?\nHave you done x? ... (slide)\nI don't mean ecstasy ☺\nExtracting sensitive Information I\n2 made it acceptable\n3 reporting other people is easier. If the answer is yes, it is easier for you to admit.\nLots of people are sensitive, embarrassed, don't want admit things\nExtracting information II\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 6 of 7\n\nWhy is this interesting?\n-could lie\n-obligated to answer truthfully?\nEmbarrassed to admit I did x\nBut you don't know what question I answered, who I was.\nYes to 1 or 2?\nAnonymous.\nCoin flip: Heads, answer y, tails answer truth.\nThis protects the individual response, but gets the general population answer by\nextracting the information statistically.\nThis way helps people hide, but the population level response is intact\nWe can backtrack the answer\nMost information we ask for is sensitive\nSo we use workarounds\n(Passes out survey),\nPlease look and answer as quickly as you can.\nFresh Samantha paradox\nRead the readings, know them well\nTypes of measurement will be on the exam.\nnext wednesday will be a recitation.\n15.301/310, Managerial Psychology\nLecture 3\nProf. Dan Ariely\nPage 7 of 7"
    },
    {
      "category": "Resource",
      "title": "r_05_des_stats.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/da550ebb74630c00a05d0a94c16430f6_r_05_des_stats.pdf",
      "content": "Measurement\nscales\n\nMeasurement scales\nNominal scale\nBus #; Gender?\nOrdinal scale\nHouse numbers; Rank in class\nInterval scale\nComplex, maybe Grades\nRatio scale\nHeart rate; any measure in %\n\nScales & Statistics\nCan you take an average of a nominal\nscale?\nGender\nApartment number\nIce-cream flavor\nThink about the meaning of the\nmeasurements!\n\nWhat scale is this?\nCourtesy of hotornot.com. Used with permission.\n\nWhat scale is this?\nCourtesy of hotornot.com. Used with permission.\n\nOutcomes\nCourtesy of hotornot.com. Used with permission.\n\nWhat scales do we have?\nIn most cases when asking people for\ntheir opinions researchers behave as\nif they have ratio scales, wishing they\nhad interval scales but in fact in most\ncases we only have ordinal scales\nLuckily many of the statistical tools we\nuse are not very sensitive to the\nviolation of this assumption\n\nGranularity of scales\nIt is important to use measurement\nscales that people find meaningful\nIf people can distinguish only 3 (7)\nlevels, there is not much use in a 100\npoint scale\n\nDescriptive statistics\n\nReport data in meaningful ways\nMake predictions about future events\nThe goal of statistics is to\n150 160 170 180 190 200\nCourse 15\nCourse 6\n# of people\nWeight\n\n- Descriptive statistics\n- Capturing a picture of the\ndata)\n- This was the origin of statistics\n- Started for gambling\nDescribing a state\n\nFirst some descriptive statistics\n12%\n13%\n34%\n41%\nBad\nGood\nVery good Excelent\nHow do you like 15.301?\nExcellent\n\nCentral tendencies\n- Representing central\ntendencies of distributions is a\nvery efficient way to\nunderstand something about it.\n- Mode\n- Median\n- Mean\n\nThe Mode\n- The most \"popular\" frequent occurring\ninstance in the sample.\n- This is the only central tendency that can be\nused with a nominal scale\n- The mode is sensitive to aggregation of\ncategories\n- Age 18 vs age 18-21\n- Sometimes there are multiple modes\n- Bimodal distributions\n\nThe Median\n- The median is a value which 1/2 of the values\nare above it and 1/2 below\n- After sorting the values by magnitude, the\nmedian is at the (n+1)/2 location\n- 123, 85, 34, 20, 18, 15, 14 ?\n- 123, 85, 34, 20, 18, 15 ?\n- When data is grouped, calculating the mode is\na bit more complex\n\nThe Mean\n- Mean = (Xi) /n\n- The most important statistic\n- Used for many other computations\n- Stable\n- Smallest mean square deviations from it\n- Sensitive to extreme values\n- Not \"well behaved' in non-standard\ndistributions\n\nPlots I\nQ 1\nQ 2\nQ 1\nQ 2\n\nPlots II\nQ 1\nQ 2\n50%\n28%\n14%\n9%\n\nLocation of central tendencies\nNormal\nMean\nMode\nMedian\n0.2\n0.4\n0.6\n0.8\n1.0\n\nLocation of central tendencies\nBimodal\nMean\nMode\nMedian\n0.2\n0.4\n0.6\n0.8\n1.0\n\nLocation of central tendencies\nSkew to right\nMean\nMode\nMedian\n0.1\n0.2\n0.3\n0.4\n0.5\n\nLocation of central tendencies\nSkew to left\nMean\nMode\nMedian\n0.1\n0.2\n0.3\n0.4\n0.5\n\nDistribution descriptors\n- The Range\n- The range is (Max - Min)\n-\n-\n- Interquartile range\n- Calculating is similar to median\n- Q3-Q1 (1/2 of the observations)\n\nVariation I\n- Variance (^2)\n- (Xi-μ)^2/(n)\n- (Xi-μ)^2/(n-1)\n- Standard deviation ()\n- Square root of variance\n- Standard deviation is in the same units\nas the distribution\n\nVariation II\n- Variance ( ^2) is:\n- insensitive to transformations\nconsisting of adding a constant.\n- sensitive to transformations consisting\nof multiplying by a constant.\n\nWhen to use\nWhen should you use the:\nMean\nMode\nMedian\n\nThe Correlation\n- The relationship between 2 variables\ndoes not have to be linear\n- But in many cases they are\n- Positive and negative correlations\n\nWhat is a correlation?\n- What line to pick?\n- Sum of all deviations from the line is 0\n- The sum of square deviations of the points from\nthe line is minimal.\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nEstimating correlations in scatter grams\nWhat is the correlation here?\n\nThe correlations were:\n- 1 0.1\n- 2 0.3\n- 3 0.5\n- 4 0.7\n- 5 0.9\n- 6 0.99\n- 7 01\n\nTypes of\nmeasurements\n\nTwo types of measures\nSubjective\nIntrospection\nIntuitions\nOpinions\nObjective\nBehavioral\nWhat people actually do\n\nTwo types of measures\nExamples:\nHow much do you enjoy this class?\nWho came to class today?\nSubjective vs. objective: which is\nbetter? Why?\n\nObjective measures\n\nObjective measures\nObserving behavior (parking, men's room)\nChoice\nPayments, bids, etc\nTime in task\nLimited to things we can observe\n\"Statistically expensive\" in many cases (choice)\nUsually harder to get\n\nPartial objective measures\nWe can ask people for the their\nopinions but ask them to use objective\nscales.\nHow much time have you used for\naction X\nHow much will you pay\nHow much energy will you expand\n\nStatistically expensive?\nYes\nNo\n\nSubjective measures\n\nSubjective measures\nIntentions\nWhat would you do\nWhat would others do\nAttitudes\nHow much do you like X?\nVerbal reports\nOn-line introspections\n\nQuantitative subjective measures\nQuantitative objective\nLikert scales (1-7; 1-10; 1-100)\nGuttman scale\nA yes no response to a continuum of\nquestions that are ordinal\nHypothetical choice\nRanking\n\nSubjective measures I\nVery popular\nCheap\nCan tell us things we cannot observe (why..)\nDepend on interpretation\nIntuitions & not behavior\nDepends on the extend to which people can\nintrospect\n\nSubjective measures II\nSocial desirability demands\nHow often do you cheat?\nWould you steal if you were sure no one will catch\nyou?\nWould you rather watch \"the piano\" or Rambo?\nDemand characteristics (effects)\nDo you agree that red is a nice color?\n\nTypes of measurement summary I\nObjective and subjective\nmeasurements\nEach has its advantages and\ndisadvantages\nBeware of subjective measures if your\ngoal is to predict behavior\n\nTypes of measurement summary II\nSubjective vs. objective (behavioral measures)\nThe main question is what are people able to\nreport\nSensitivity to scales, order, etc.\nResponse language\nThe constructive view\nDo people have preferences?\nInferences of attitudes from questions /\nanswers\n\nOne more issue ...\n\nFresh-Samantha Paradox\nFlavor\nMean ranking\n% Market\nCarrot\n2.7\n33%\nOrange carrot\n3.0\n0%\nOrange\n2.3\n33%\nSoy shake\n2.0\n33%\nPeople ranked each from 1 (worse) to 4\n(best).\nHow could you explain this paradox?\n\nFresh-Samantha Paradox\nGroup\n1st\n2nd\n3rd\n4th\nGroup A\nCarrot\nOrange\ncarrot\nOrange\nSoy\nshake\nGroup B\nOrange\nOrange\ncarrot\nCarrot\nSoy\nshake\nGroup C Soy shake\nOrange\ncarrot\nCarrot\nOrange\nRanking (or ratings) do not always\ntranslate to behavior?\nThe 2nd best problem\n\nThe 2nd best problem\nIt is hard to infer from ratings or\nranking choice\nAt the same time it is hard to infer\nrelative location from choice\nA1\nB1\nA2\nB2\n\nMeasurements\nObjective measures are usually\neasier to make inferences from\nBut, even with objective measures it\nis important to think what is\nmeasured and how it relates to the\nquestion of interest\n\nDescriptive stats\nA compact way to represent the main\nessence about the data\nWhat is this main essence depends on\nthe measurements and on the data\nEach method has +s and -s\nThere are no rules for what method to\npick -- do your best! it is your\nresponsibility"
    },
    {
      "category": "Resource",
      "title": "rec5field_exp.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/fe5e644bbe9593d3ec2f0dd7cd574613_rec5field_exp.pdf",
      "content": "15.301/310, Managerial Psychology\nProf. Dan Ariely\nRecitation 5: Field Experiments\n(a dash \"-\" indicates student responses)\nAdministrative:\nMidterm next Wednesday, 20% of the grade, all multiple choice or \"MCQ\". Covers\nDan's lectures and recitations and readings (Reader #1-11, Gilovich Ch. 1-7, Stats\nCh. 3, 9-12). Many questions about the test. You will need a calculator. Practice\nquestions will be posted.\nFirst formula: nCr. 10 choose 3 = 10x9x8.../1x2x3.\nStart collecting data soon. Take a week or two just to collect. Could be time\nconsuming. Draft of final report due right after midterm. Final report should be 15-\n20 pages. The Writing TA will give the requirements this afternoon. For the rough\ndraft, you obviously don't need to write the results (2 pages) yet. Should be based\non background of the survey, the theoretical background and prior work.\nToday:\nTwo papers on field experiments. But first, basic concepts:\n\"Internal validity vs. External Validity.\"\nWhat do they mean?\n-External means that you can apply your results to general situations, samples in the\nsame population. Internal however is a question of whether the causal relationship\nthat you're testing is in fact causal.\nA test within the study vs. without. Formally: Internal is the validity of inferences\nabout whether the relationship between two variables (A -> B) is causal. External is\nthe ability to generalize a causal relationship outside the settings under which it was\nstudied.\nCo-relation vs. Observational Study:\nCo-relational: A relation between two different variables. Direct, indirect, linear, etc.\nDoes not imply causality. A co-relational study studies the changes between two\nvariables and their relation under change.\nObservational study: You do not manipulate the variables. This is used in the\nparking lot study in the second paper.\nExperiment vs. Quasi-experiment:\nAn experiment (\"Randomized Experiment\") is one in which you have more than one\ncondition, and the participants are randomly assigned to these conditions. A drug\nstudy, for example. Control group vs. test group, must be randomly assigned.\nA Quasi-Experiment is not really an experiment. You have more than one condition,\nbut there is no random assignment.\nLooking at the two papers this week, which is a Quasi-Experiment?\n\n-The study in the bar, perception of attractiveness under alcohol consumption and\ntime change.\nRandom choices, but no strict assigning of the players. The population of the bar\noutside of the testers is not controlled.\nStudies vs. Experiments:\nStudies take on one condition. An experiment involves more than one condition.\nOne cell vs. multi-cell.\nThe Car Park paper: Timing cars getting out of a parking lot. Observational Quasi-\nExperiment. Observational because you manipulate nothing. But a Quasi-\nExperiment based on two conditions - waiting car and no waiting car.\nAnother example, not in the paper: Students arriving to class. This is an\nObservational Study, since the time of arrival to class is the only condition (and it's\nobservational and not controlled).\nField vs. Lab experiments:\nField is run in the conditions natural environment, unbeknownst to (most) of the\nparticipants. They aren't prepped or researched, although they may grow\nsuspicious.\nLab is in a setup location. People are recruited. In the field you get more accurate\nresponses, but measuring those responses is harder (and creates inaccuracies). In\nthe lab, there is a bit of fiction, but you can adjust the variables.\nA \"Confound\" - an alternative explanation to your results. In the field, these crop up\nmore often.\nFirst paper: 1979, Pennebaker, the Bar experiment.\nQuestion: What is the difference between a bar and a club study? How would you\nmake that distinction? Would your results be \"externally valid\" and apply from the\nbar to a club?\nSo, to respond: Does attractiveness have to do with place, or time, (or alcohol)?\nBut what if the more attractive people don't necessarily come out until later? Thus a\nQuasi-Experiment.\nQuestion: What are the objectives of this paper?\n-Does attractiveness increase with time, or do you become more prone to being\nattracted under the pressure of a bar closing?\nThis variable weakens the study. You can't really tell if it's one or the other that's\ninfluencing the attractiveness factor. The authors expect attraction to increase as\nclosing time approaches. But why? Alcohol. Lower standards. More attractive\npeople arrive (?). Fear of leaving alone. They reference the theories of Brehm and\nFestinger. (Cognitive Dissonance Theory.) Threats to your freedom of choice arrive\nas closing time approaches (\"Time is Running Out\"), so you react and choose\nsomeone, perhaps over-inflating their worth. Alcohol can be a \"confound\".\n15.301/310, Managerial Psychology\nRecitation 5\nProf. Dan Ariely\nPage 2 of 4\n\nDetermining which force is dominant is crucial to finding valid results, and this paper\navoids that. Run multiple studies to weed out confounds - do one that isolates\nalcohol, another on bar population, reasons for going to a bar not having exclusively\nto do with meeting people, etc.\n\"Cognitive Dissonance Theory\": As closing time approaches, you try to make your\nchoices more appealing even though they aren't. You undermine your own judgment\nthrough rationalization. You create a fight with yourself, between your real cognition\n(thought or opinion) and your new one that is circumstantial. Related to Atkins and\nhis Reactance Theory.\nThe experiment itself - 3 men and 3 women, 3 bars, 3 timeframes. People go in\npairs. Question others about attractiveness of the global population of the bar, not\nspecific people. Also asked about same-sex attraction as a control. (Again, flawed\ndue to sexual orientation which is not considered.)\nWhat are other flaws or peculiarities?\nIndependent vs. dependent measurements: Independent is the time of asking and\nwhether it's opposite or same sex measuring, and the dependent variable is the\nperceived attraction.\nSo one confound - they don't ask the same people in the bar in each time frame\nbecause they're asking about the global population. But this is questionable. How\ndo you put a value on that global attractiveness? How is \"average attractiveness\"\ndefined?\nDifficult to report, especially since you're not asking the same person in each time\nframe. For example, if you look at two groups of three people, where one is A B C\nand the other B B B, then the average should be the same, B. But the A or the C\n(outliers) always skew perception.\nOne way would be to have the people who go to the bar be the ones who are rated -\nthey would be a control. Have them go in a group and ask to be rated. But then -\npeople are always rated relative to others. So perhaps one would be always an A in\nevery circumstance. They wouldn't necessarily make the \"most attractive\" in the\ngroup be a B because they aren't supermodels. They would be an A relative to the\ncurrent conditions.\nOther confounds:\nAgain, no measure of alcohol or sobriety.\nNo study of current emotions of the respondent.\nSize of bar population - smaller population allows greater influence from outliers.\nDifferent locations - parties, church functions, etc.\nOr stay in one bar all night, observe consumption and interaction and then make\nmeasurements over time. The population change - as the night gets later, the\npeople who are there are more likely the ones who want to go home with someone.\nPeople who leave early aren't necessarily like that. A twenty-four hour bar would\nalleviate some but not all of this - it would be more about human habit relative to\ntime and not the specific bar. Human standards and judgment is an issue, but with a\nbig enough sample size it's normalized. Another confound - as you get more tired,\n15.301/310, Managerial Psychology\nRecitation 5\nProf. Dan Ariely\nPage 3 of 4\n\nyou lose accurate judgment. (TA suggests giving a basic cognitive test to everyone\nyou ask. But this could go either way - tired as being pickier or easier.)\nPsychology - Near Exposure Effect: The more familiar you are with a person or place\nthe more you like it. As you stay in a place longer at get more exposure to a person\nyou tend to find them more attractive. This would need to be ruled out in another\nstudy, or by asking people how long they've been in a bar.\nOverall, it's still a good paper given its age. Might need to be more rigorously done\ntoday.\nSecond paper: 1997, Intruders in Territory.\nMore recent, many more experiments in it. Studying the effect of intruders on a\ngiven territory. Observing a parking lot, moving slowly or quickly if someone is\nwaiting.\nThree steps: Observing, then using a confederate, then hypothetical questioning.\nThey used time as the dependent measure, which is much more quantifiable than\n\"attractiveness\". The independent variables were whether a car was waiting or not,\nor if there was a car if it was honking or not.\nOne confound: If there is a car waiting, people may take longer so as not to be a\nnuisance but to be careful when others are watching. The results - when a car was\nwaiting, people are slower.\nDue to distraction (like when a car drives past). Much longer time under high\nintrusion, which could also be a major distraction. Honking could cause many kinds\nof feelings. Also different due to quality of car (males only). Could also be more\nlevels of intrusion, but they all seem forced. The gender of the confederates is an\nissue - they are all men here. People would react differently with women perhaps.\nMuch more rigorous paper since they have a definite measure, and a random\nassignment. Can also be applied to phone booth, post office, taxi cabs, seating on a\nplane, waiting for a reserved court or place, other queues, other situations.\n15.301/310, Managerial Psychology\nRecitation 5\nProf. Dan Ariely\nPage 4 of 4"
    },
    {
      "category": "Resource",
      "title": "r_06_exp_design.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-301-managerial-psychology-laboratory-fall-2004/eac0c83fece69e85e07a2e320486a6be_r_06_exp_design.pdf",
      "content": "Experimental design\nExperiments are the most common and\nuseful way to determine causality.\nThe question is: how to design them?\n\nWhat is a good experiment?\nHard to say... Experimentation is partially an\nart form!\nBut, in general, a good experiment is one that\ncontrols for everything else -- testing only\nwhat you want it to test\nPlanned well in advance\nControlling for other plausible hypotheses\n\nThe first experiment\nAn Early Experimental Design:\"Dew it both ways\" Judges\n(Shoftim) Chapter 6\nAnd Gideon said to G-d:\n\"If You will save Israel by my hand, as You have said, look, I will put a fleece of wool\non the threshing-floor; if there be dew on the fleece only, and it be dry upon all\nthe ground, then shall I know that You will save Israel by my hand, as You have\nsaid.\"\nAnd it was so; for he rose up early on the next day, and pressed the fleece\ntogether, and wrung dew out of the fleece, a bowlful of water.\nAnd Gideon said to G-d:\"Do not be angry with me, and I will speak just this once:\nlet me try just once more, I ask You, with the fleece; let it now be dry only upon\nthe fleece, and upon all the ground let there be dew.\"\nAnd G-d did so that night; for it was dry upon the fleece only, and there was dew\non all the ground.\n\nAn experiment vs. experiments\nAny experiment is a step in a dialog\nExperiments build on each other\nNo experiment is the ultimate one\n\nThe art of setting experiments\nIndustry standards\nElegance\nSymmetry\nMany ways to measure the same idea\nWhat is convincing evidence?\n\nSingle cell designs\nNot an experiment -- a study\nParameter estimations\nTheory test\nExamples: economics, physics\nCreating a control group from the single cell\nExamples: ordering simulation in variety\nseeking\n\nRandom assignment\nRandom assignment is the central aspect of\nexperiments\nBy randomly assigning subjects to groups we\ncan assume no systematic differences between\ngroups\nAssume they are the same on everything but\nthe manipulation.\n\nThe importance of\nmanipulations\nBy using a manipulation you can determine the\ndirection of causality\nBased also on random assignment we can link\nthe outcome to our manipulation\n\nOne-factor designs\n\nOne-factor designs\nXX.XX\nXX.XX\nLevel 1\nLevel 2\nDV\n\nOne-factor designs\nLevel 1\nLevel 2\nLevel 1 Level 2 Level 3 Level 4\n\nMultiple-factor designs\n\nMultiple-factor designs\nFactor 1\nFactor 2\nXX.XX XX.XX\nXX.XX XX.XX\nLevel 1\nLevel 2\nLevel 1\nLevel 2\n\nThe importance of interactions\nNo interaction\nGender 1\nGender 2\nLow\nHigh\n\nThe importance of interactions\nOrdinal interaction\nAssumptions?\nGender 1\nGender 2\nLow\nHigh\n\nThe importance of interactions\nDis-ordinal interaction\nAssumptions?\nGender 1\nGender 2\nLow\nHigh\n\nThe importance of\ninteractions\nOrdinal\nDisordinal\nInteractions help us rule out alternative\nexplanations\nExamples.....\n\nWithin vs. between\nsubject designs\nWhich is better? Why\nWhat are the advantages of each?\nWhat are the disadvantages of each?\n\nExperimental design: summary\nExperimental design is about the design of the\nstructure of the experiment\nThe origins of this is in agriculture\nWithout a good design it is hard to know for\nsure what we have learned\n\nSummary\nExperiments\nRandom assignment\nControls\nTypes of experiments\nOnce cell, one factor, multiple factors\nThe role of interactions\nWithin and between subjects designs"
    }
  ]
}