{
  "course_name": "Many-Body Theory for Condensed Matter Systems",
  "course_description": "No description found.",
  "topics": [
    "Science",
    "Physics",
    "Condensed Matter Physics",
    "Science",
    "Physics",
    "Condensed Matter Physics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription\n\nThis course covers the concepts and physical pictures behind various phenomena that appear in interacting quantum many-body systems. Key ideas/techniques to be covered include broken symmetry, effective field theories, functional integral methods, and quantum phase transition theory.\n\nA rough syllabus is:\n\nSecond quantization; path integrals in quantum mechanics\n\nInteracting bosons - superfluidity\n\nBroken symmetry and its consequences\n\nLow dimensional quantum magnetism\n\nPrerequisites\n\nQuantum Physics II (\n8.05\n), Statistical Physics II (\n8.08\n), Relativity (\n8.033\n) or Classical Mechanics II (8.21), Physics of Solids I (\n8.231\n)\n\nHomework\n\nThere will typically be one homework every week which will be due on the same day of the following week. Late homework is strongly discouraged!!\n\nPresentation\n\nThere will be no final exam - instead there will be a short in-class presentation on a topic of general interest to the material in the course. Specific recommendations for presentation topics will be provided later.\n\nBooks\n\nNo single textbook will be used. What follows is a list of books that I find useful. When appropriate, lecture notes or references to review articles/research papers will be provided.\n\nNegele, John W., and Henri Orland.\nQuantum Many-Particle Systems\n. Boulder, CO: Westview Press, October 1998. ISBN: 9780738200521.\n\nStone, Michael.\nThe Physics of Quantum Fields.\nNew York, NY: Springer-Verlag, February 1999. ISBN: 9780387989099.\n\nAuerbach, Assa.\nInteracting Electrons and Quantum Magnetism.\nNew York, NY: Springer-Verlag, 1994. ISBN: 9780387942865.\n\nWen, Xiao-Gang.\nQuantum Field Theory Of Many-body Systems: From The Origin Of Sound To An Origin Of Light And Electrons.\nOxford, UK; New York, NY: Oxford University Press, 2004. ISBN: 9780198530947.\n\nSachdev, Subir.\nQuantum Phase Transitions.\nCambridge, UK; New York, NY: Cambridge University Press, 2000. ISBN: 9780521582544.\n\nAnderson, P. W.\nBasic Notions of Condensed Matter Physics\n. Boulder, CO: Westview Press, November 27, 1997. ISBN: 9780201328301.\n\nFradkin, Eduardo.\nField Theories of Condensed Matter Systems.\nBoulder, CO: Westview Press, August 26, 1998. ISBN: 9780201328592.\n\nPolyakov, A. M.\nGauge Fields and Strings\n. New York, NY: Harwood Academic Publishers, Taylor & Francis Scientific, Technical and Medical, October 1, 1987. ISBN: 9783718603930.",
  "files": [
    {
      "category": "Resource",
      "title": "8513p1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/3d5efd4ad54bb390771eb4c80c24d4db_8513p1.pdf",
      "content": "X\n\n8.513 Problem Set 1\n(Dated: September 15, 2004)\nDue Sept 21\nPractice with creation\noperators\n1. Consider a situation where an electron can hop between two different localized regions of space (eg: the vicinity\nof each nucleus in a diatomic molecule, or two different impurity sites in a solid, etc). A model for such a\nsituation is to consider a lattice with just two sites, and a Hamiltonian\niαaiα - t a+\nH =\nia+\n1αa2α + h.c\n(1)\ni=1,2\nHere α = ↑, ↓ is the spin index and t > 0. Assume that there are two electrons in the system. To begin with\nassume 1 = 2 = .\n(a) Calculate the ground state energy, and the ground state wavefunction.\n(b) What is the average number of electrons at each site in the ground state? What about at finite temperature?\n(c) What is the average value of the hopping operator a+\n1αa2α + h.c in the ground state?\n(d) Now consider the case where 1 = + Δ and 2 = - Δ with Δ > 0. What is the average number of\nelectrons at each site in the ground state? What happens in the limit of large Δ? At fixed Δ, what happens\nto the average number at large temperature?\n2. Consider the Hamiltonian\nΔ\nH = a+a +\na 2 + (a+)2\n(2)\nwhere a, a+ are bosonic operators. Assume Δ < . Diagonalize the Hamiltonian (i.e find the excitation energies).\n(Hint: Find linear combinations of a and a+ which preserve the commutation algebra but in terms of which the\nHamiltonian is diagonal).\n/ annihilation"
    },
    {
      "category": "Resource",
      "title": "8513p2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/9e175456aa4f776c1e7d1c592c6d93b9_8513p2.pdf",
      "content": "Z\n(~\n~\n8.513 Problem Set 2\n(Dated: September 21, 2004)\nDue Sept 28\n1. Consider the imaginary time propagator K(x, y; β) =< x|e-βH y > for a quantum system with Hamiltonian H.\n|\n(a) Show that for large β, K(x, y; β) ∼ ψ∗\n0(y)ψ0(x)e-βE0 where ψ0(x) is the ground state wavefunction and\nE0 is the ground state energy (assuming a unique ground state).\n(b) Use the expression for K(x0, x0; β) derived in class for the simple harmonic oscillator to calculate the\nground state energy and the ground state wavefunction.\n(c) From the result for the propagator, calculate the partition function for the simple harmonic oscillator and\nshow that it agrees with the result obtained by more usual means directly by summing over the various\nenergy eigenvalues.\n(d) Consider the calculation of < x2 > at any finite temperature T. Show that this may be expressed as\n< x >=\ndxx 2K(x, x; β)\n(1)\nZ\nHence calculate < x2 > for the simple harmonic oscillator.\n2. Carefully derive a pathintegral representation for the propagator of a particle moving in a vactor potential ~A\nin N spatial dimension. The Hamiltonian is\nH = p - eA)2\n+ V (~r)\n(2)\n2m\nHere e is the electric charge."
    },
    {
      "category": "Resource",
      "title": "8513p3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/8a431428be2c538a456d0b364d231141_8513p3.pdf",
      "content": "8.513 Problem Set 3\n(Dated: September 29, 2004)\nDue Oct 5\n1. Consider a particle of mass m moving in a potential V (x) = kx2 + ux4 with u > 0.\n(a) Rewrite the Hamiltonian in terms of creation and annihilation operators.\n(b) Write the quantum partition function as a coherent state path integral.\n(c) Show directly the equivalence with the imaginary time Feynman path integral over the paths of the co\nordinate x. (First change variables in the coherent state path integral to x and p, then do the Gaussian\nintegral over p).\n(d) Specialize to u = 0 so that the potential is that of a simple harmonic oscillator. Consider the average\nenergy at finite temperature. Calculate this directly from the coherent state path integral (you must be\nable to reproduce the wellknown result). It is best to work with the discrete time integral and carefully\ntake the continuum limit at the end of the calculation.\n2. Consider the Hamiltonian describing small harmonic fluctuations about the mean field ground state of the Bose\nliquid.\nX\nΔk\nH =\ntka+\nkak + 2 (aka-k + h.c)\n(1)\nk\nin the notation used in class. Diagonalize to obtain the eigenfrequencies of the excitations as a function of k.\nWhat happens to the excitation frequency as k\n0?\n→"
    },
    {
      "category": "Resource",
      "title": "8513p4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/fdfd5e68a272f5d67d99043d9807ab9a_8513p4.pdf",
      "content": "8.513 Problem Set 4\n(Dated: October 5, 2004)\nDue Oct 12\n1. Calculate the temperature dependence of the specific heat of a three dimensional superfluid at low temperature.\nAssume that the sound wave velocity is some number c.\n2. Melting curve of He4 at low temperature\nAt low temperatures, application of pressure (around 25 atm) can solidify He4. Close to the zero temperature\n\"melting\" point, it is found that heating the superfluid actually causes a transition to the solid! In other words,\nthe melting curve is such that the pressure required to solidify He4 is smallest at a nonzero temperature. In\nthis problem, you will explain this observation.\n(i) First remember that a very useful guide to the shape of the melting curve is the ClaussiusClapeyron relation:\ndP\n= sl - ss\n(1)\ndT\nmelting\nvl - vs\nwhere (vl, sl) and (vs, ss) are the specific volumes and specific entropies of the liquid and solid phases respectively.\nProve this relation.\n(ii) The low temperature entropy is determined by the nature of the low energy excitations. In the solid, these\nare the usual phonons one longitudinal and two transverse. As a simple model, assume that all three modes\nhave the same velocity c, and calculate the low temperature entropy. In the superfluid, there is only a single\nphonon. Assuming that this too has the same velocity, calculate the low temperature entropy. Assume further\nthat the density changes very little in going from the liquid to the solid phase so that vl ≈ vs. Which phase has\nthe higher entropy?\n(iii) As might be expected, the solid has a slightly higher density than the liquid. Show how the shape of the\nmelting curve can now be understood.\n3. In this problem you will examine the stability of the broken symmetry state of the superfluid to quantum\nand thermal fluctuations. A convenient approach is to proceed as follows. Recognizing that the dangerous\nfluctuations are ones with low energy, focus on the fluctuations of the phase of the order parameter.\n(i) Consider < ψ >≈ ψ0 < eiθ(x) >. In the harmonic approximation, the action governing the fluctuations of θ\nis quadratic. Show that in such a case\n= e-1\n2 <θ2(x) >\n(2)\niθ(x) >\n< e\n(Hint: First establish this result for simple Gaussian integrals over a single variable, then generalize appropri\nately).\n(ii) Now express < θ2(x) > in terms of the Fourier components of θ. Note that the action for θ describes an\ninfinite number of coupled harmonic oscillators. In the Fourier basis, oscillators for different ~k values decouple.\nHence calculation of the required average reduces to a straightforward calculation for each such simple harmonic\noscillator. Use this understanding to obtain an expression for < θ2(x) >.\n(iii) Now consider the stability issue.\nConsider the order parameter reduction in various spatial dimension\nd = 1, 2, 3.\nStability of the superfluid state is signalled by a finite reduction of the order parameter, i.e\n< θ2(x) > is some finite number. Conversely if < θ2(x) > diverges, the broken symmetry state is unstable. At\nzero temperature, in what dimension is the superfluid stable? How does the answer change at small nonzero\ntemperature?"
    },
    {
      "category": "Resource",
      "title": "8513p5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/3711d2f6ba9e31febc557801b9db0538_8513p5.pdf",
      "content": "!\nX\nX\nX\n~\n~\n~\n8.513 Problem Set 5\n(Dated: October 15, 2004)\nDue Oct 28\n1. Consider a system of bosons interacting with each other through some generic twobody interaction V (r). In\nthis problem you will study various aspects of the superfluid state in some generality.\n(a) Write the interaction in second quantized form. Use this to write down the action that enters the coherent\nstate path integral. (Remember that the interaction is twobody, i.e, a boson at position r interacts with\nanother at position r0 through V (r - r0)). For what follows it will be convenient to express the interaction\nin terms of the Fourier components of the boson density.\n(b) Now assume that at the classical minimum the boson field has a nonzero expectation value ψ0. As was\ndone in class for the specific case of a δfunction interaction, expand the action about the classical minimum\nto second order in the deviation of the density from its mean.\n(c) Now integrate out the density fluctuation to obtain an effective quadratic action for the phase variable.\n(Hint: this is best done in Fourier space).\n(d) Use the strategy of Prob 3 in Prob Set 4 to obtain a condition for when the superfluid state is stable at zero\ntemperature. Your answer will depend on the fourier transform V (q) of the interaction, and the spatial\ndimensionality.\nSpecifically, calculate the expectation value < eiθ > using the quadratic phase action\nderived. Some of you might find it convenient (though not necessary) to regard it as a sum of harmonic\noscillators one for each momentum and to use the known result for oscillators.\n(e) If the superfluid is stable, what is the dispersion of the phase mode in terms of V (q)? Show that your\nanswer reduces to the correct one in the two limiting cases of (a) δ function interaction and (b) Coulomb\ninteraction in d = 3.\n2. Lattice bosons\nConsider a system of bosons on a lattice with the Hamiltonian\nH =\nt\nb+bj + h.c) - μ\nni + U\nni(ni - 1)\n(1)\ni\n-\n<ij>\ni\ni\nHere i, j refer to the sites of a cubic lattice, bi is the boson annililation operator at site i and ni = b+bi is the\ni\nnumber of bosons at site i. Assume t > 0, U > 0. This is known as the boson Hubbard model.\n(a) Assume t >> U. Find the classical ground state of the system, i.e consider bi to be classical and find the\nminimum energy state.\n(b) Consider the theory of small harmonic fluctuations about this classical ground state.\nShow that the\nexcitations consist of a linear dispersing sound wave at long wavelengths, i.e the structure is unchanged\nfrom the translation invariant superfluid.\n(c) Now specialize to the case where the chemical potential is such that there are an integer number of bosons\nper site on average. In the limit U >> t is the ground state a superfluid?\n3. Flux quantization in superconductors\nA superconductor may roughly be thought of as a superfluid of charged bosons (known as Cooper pairs) which\nare formed by pairing together two electrons.\nThe phase of the Cooper pair creation operator ψ+ may be\ntreated classically in the superconducting state. Due to the charge carried by the Cooper pair, it interacts with\nelectromagnetic fields. As a consequence, in contrast to a neutral superfluid, the Hamiltonian describing the\nsystem must be invariant under the local \"gauge\" transformation\n2ieφ(~r)\nhc\nψ → ψe\n\n; A → A + rφ\n(2)\n\n~\n\n!\n~\n~ ~\n~\nZ\nwhere A is the electromagnetic vector potential. c is the speed of light, and e is the charge of the electron. The\ncost in energy of a static long wavelength disturbance in the Cooper pair phase θ together with the accompanying\nvector potential ~A is:\n!2\nZ\nd3 ρs\n\n~\n2eA\nE =\nx\n\n~\nA\n(3)\nhrθ +\nc\n+ 8π\nr × ~\nThe first term generalizes the analogous term in the superfluid to take into account the coupling to the magnetic\nfield. Note that this term is invariant under the gauge transformation mentioned above. The second term is\nsimply the the usual expression for the energy stored in the magnetic field.\n(i) By minimizing this expression, derive the equations satisfied by the functions θ, ~A. Show that these equations\nare consistent with the identification of the physical current as\n2eA\n~j = eρs\nhrθ +\n(4)\nc\nIn particular, your equations must simply be\nr.j = 0\n(5)\nr × (~\n4π~j\n~\n=\n(6)\nr × A)\nc\nThe first equation is the continuity equation expressing charge conservation (remember that we are considering\nonly static configurations so that the time derivative of the charge density is zero). The second equation is\nsimply Ampere's law. Note that this expression for the current again generalizes the analogous expression for\nthe superfluid, and is gauge invariant.\n(ii) In the ground state, we may set θ to be a constant. Show that the equation for ~A becomes\nA\nA =\n(7)\nr2 ~\nλ2\nand derive an expression for the length scale λ in terms of ρs. This equation implies that a weak magnetic field\nwill penetrate into a superconductor only upto the length scale λ.\nTo get some feeling for this, consider a semiinfinite slab of the superconductor which occpies all of space for\nx > 0. Assume that for x < 0, there is a magnetic field ~B = (0, 0, B0) pointing along the zaxis. Solve the\nequation above to get the profile of the magnetic field inside the superconductor for x > 0.\nThis is the explanation of the Meissner effect: if a superconductor is cooled in a small external magnetic field,\nit will expel the field from it's interior.\n(iii) Now we will consider the properties of vortex configurations in θ. For concreteness, consider a cylindrical\nsample with a hole running through the middle. Assume that the phase θ winds around by 2π on going clockwise\nonce around a loop that encircles the hole, i.e\nd~l.~rθ = -2π\n(8)\nC\nwhere the integral is taken around the loop C. Deep inside the bulk of the superconductor, the current will\nbe zero. Show that this implies that there is magnetic flux of hc/2e that is associated with the vortex. The\nmagnetic field will extend upto a distance of order λ from the inner edge of the cylinder. For a vortex with\nwinding number m, the associated flux will be mhc . Thus the flux through the hole of a thick superconducting\n2e\ncylinder is quantized to be an integer multiple of hc/2e.\nSuggested reading: P.W. Anderson, Basic notions of condensed matter physics, pages 229248."
    },
    {
      "category": "Resource",
      "title": "8513p6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/a6a50c8419280946666f8226916c8d3a_8513p6.pdf",
      "content": "X ~ ~\nP\n8.513 Problem Set 6\n(Dated: November 9, 2004)\nDue Nov 23\n1. Consider an isotropic Hesenberg ferromagnet on a ddimensional cubic lattice with the Hamiltonian\nH = -J\nSi.Sj\n(1)\n<ij>\nwhere J > 0. For simplicity just consider the case where ~Si are spin1/2 operators.\nStot =\ni Si commutes with the Hamiltonian.\n(a) Show explicitly that the total spin operator ~\n~\n(b) Show explicitly that the state with all spins up is an exact ground state of the system? What is the ground\nstate energy?\n(c) For a system with N sites how many other ground states are there?\n(d) Consider the ground state with all spins up. You will now construct excitations above this state. Consider\nthe state obtianed by flipping a spin at site i in the ground state wavefunction. Find the action of the\nHamiltonian on this state. Use the result to find eigenstates (and eigenvalues) that have exactly one spin\nflipped relatice to the ground state. Show that the excitation spectrum is gapless. How does the energy\nvary with wavevector at small wavevector? How many such gapless modes are there? Contrast this with\nthe Heisenberg antiferromagnet.\n(e) What is the temperature dependence of the specific heat for a d = 3 Heisenberg ferromagnet at low T?\n2. Use the spin wave calculation for the Heisenberg antiferromagnet to discuss the stability of the classical Neel\nstate to quantum/thermal fluctuations in d = 1, 2, 3 at both zero and nonzero temperatures.\n(Hint: Calculate the reduction in the Neel order parameter using the quadratic spin wave Hamiltonian. If the\nreduction is finite the Neel order is stable.)\n3. Consider a qantum antiferromagnet on a triangular lattice.\n(a) What is the classical ground state? What symmetries does it break? What is the order parameter manifold?\n(b) Upon including quantum fluctuations, will it support gapless spin wave modes? How many?\n(c) Optional: Determine the spin wave dispersion by direct calculation in a 1/S expansion.\n(d) Optional: Can you guess the structure of a nonlinear sigma model field theory that is appropriate at\nleast in ordered phases?\n4. Consider a particle moving on the surface of a unit sphere in three dimensions in the presence of a magnetic\nmonopole at the center. This may be described by the Hamiltonian\nH =\n~\n(2)\n2m|Λ|\nΛ = ~n × (-i~\nA). The coordinate of the particle is ~\nA is that apropriate for\nwhere ~\nr + ~\nn and the vector potential ~\nthe monopole. The strength of the monopole as determined by the total magnetic flux through the sphere is\nfixed by the Dirac condition so that\n4πB = 2S\n(3)\nwhere 2S is an integer and B is the magnetic field due to the monopole at the surface of the sphere.\n(a) Show that ~Λ satisfies the commutation relation\n[Λμ, Λν] = iμνλ(Λλ - Snλ)\n(4)\nThus Λ does not satisfy angular momentum commutation relations and is not the generator of rotations\non the sphere.\n\n~\n(b) Show that the correct angular momentum operators are instead\n~\n~\nn\nL = Λ + S~\n(5)\nShow explicitly that the ~\nn and ~\nL satisfy the expected commutation with ~\nΛ.\n(c) The commutation algebra of the different components of ~L requires that L2 has eigenvalues l(l +1) with 2l\nan integer. In addition Lz may be diagonalized simultaneously with L2 and (for any fixed l) has eigenvalues\nm in the range -l, -l + 1, ....., +l. Show that\nL2 = Λ2 + S2\n(6)\nThis implies the inequality l(l + 1) ≥ S2 so that the minimum possible value of l is S.\n(d) Armed with these results consider the spectrum of the Hamiltonian in Eqn.\n2.\nWhat is the ground\nstate energy? What is the angular momentum and degeneracy of the ground state? What is the angular\nmomentum of the first excited state? What is the energy gap from the ground state?\n(e) Derive a pathintegral that describes the motion of this particle (for instance the imaginary time path\nintegral for the partition function).\n(Hint: First construct the path integral assuming a general spherically symmetric potential in three di\nmensions, and at the end of the calculation specify that this potential constrains the motion to be on the\nsurface of a unit sphere).\n(f) Show that the m → 0 limit reduces to the spin path integral derived in class. Consider this limit in the\nHamiltonian framework. Show that both the ground state energy and the energy gap go to infinity in this\nlimit. The divergence of the ground state energy has no physical consequence as we may redefine the zero\nof energy by adding a constant term to the Hamiltonian. The divergence of the energy gap means that the\nonly states that survive in this limit are those in the ground state. This explains why the path integral\nreduces to the one for spin in the m\n0 limit.\n→"
    },
    {
      "category": "Resource",
      "title": "notes1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/2cafd67d9ed51262e632283b9a545249_notes1.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/77949c25b372491482aeeee7434f4ccc_notes2.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/c8e74b4f00a8eb24c28becddae93fefa_notes3.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/2703c3022ff005f0fddccb42d13225af_notes4.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/f558b75473b9657d4b80f0293c0e03ff_notes5.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/0150c40f009df19ea9ff8cd6c8383cc6_notes6.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/f79ea7fb7521571a1d440383d72a718e_notes7.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/95742b7269815442257212407ba9c6ea_notes8.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/ba05332e549cec866952ec0b8d100d80_notes9.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "notes10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/8-513-many-body-theory-for-condensed-matter-systems-fall-2004/03d7090eb0a3434a2ca941e1bc9036db_notes10.pdf",
      "content": ""
    }
  ]
}