{
  "course_name": "Marine Chemistry",
  "course_description": "This course is an introduction to chemical oceanography. It describes reservoir models and residence time, major ion composition of seawater, inputs to and outputs from the ocean via rivers, the atmosphere, and the sea floor. Biogeochemical cycling within the oceanic water column and sediments, emphasizing the roles played by the formation, transport, and alteration of oceanic particles and the effects that these processes have on seawater composition. Cycles of carbon, nitrogen, phosphorus, oxygen, and sulfur. Uptake of anthropogenic carbon dioxide by the ocean. Material presented through lectures and student-led presentation and discussion of recent papers.",
  "topics": [
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Geobiology",
    "Geochemistry",
    "Oceanography",
    "Engineering",
    "Ocean Engineering",
    "Hydrodynamics",
    "Science",
    "Earth Science",
    "Geobiology",
    "Geochemistry",
    "Oceanography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 2 hours / session\n\nRecitations: 1 session / week, 1 hour / session\n\nFormat\n\nThis course is offered through\nThe MIT/WHOI Joint Program\n. Lectures were held at WHOI and broadcast via private video link to students on the MIT campus. Recitations were on the MIT campus and broadcast via private video link to students at WHOI.\n\nHomework\n\nHomework is worth 30 percent of your grade. There will be 9 problem sets, so each problem set will be worth about 3 percent of your grade. The problem sets will be handed out on Tuesdays and due in class on the following Thursday (so you have a week and a half). We prefer you try to do these problems by yourself, but don't mind if you work in groups.\n\nMid-term Exam\n\nThere will be a mid-term exam after Ses #12. This exam will cover all of the material covered up to that point. It will be worth 30 percent of your grade.\n\nFinal Exam\n\nThe final exam will cover all material presented over the semester. It will be a 3-hour, closed book, take home exam and will be worth 30 percent of your grade.\n\nClass Participation\n\nThis will count for 10 percent of your grade and will be based on attendance and participation in the lectures and recitation.\n\nLecture Notes and Course Reading\n\nElectronic copies of the lecture notes will be made available in the\nlecture notes\nsection. For those lectures for which we don't yet have electronic versions of the figures, we will distribute photocopies prior to lecture. There will not be any formal reading assignments for the course, but you may find the following books to be good references:\n\nPilson, Michael E. Q.\nAn Introduction to the Chemistry of the Sea\n. Upper Saddle River, N.J.: Prentice Hall, 1998. ISBN: 9780132589710.\n\nLibes, Susan M.\nAn Introduction to Marine Biogeochemistry\n. New York, NY: Wiley, 1992. ISBN: 9780471509462.\n\nBerner, Elizabeth Kay, and Robert A. Berner.\nGlobal Environment: Water, Air, and Geochemical Cycles\n. Upper Saddle River, N.J.: Prentice Hall, 1996. ISBN: 9780133011692.\n\nCalendar\n\nLecturers\n\nSD=Scott Doney\n\nWM=Bill Martin\n\nKC=Karen Casciotti\n\nMKT=Meg Tivey\n\nDT=Dierdre Toole\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nLECTURERS\n\nIntroduction\n\nOverview of the determinants of seawater composition\n\nSD\n\nTools for studying marine geochemistry\n\nIntroduction to stable isotopes\n\nKC\n\nIntroduction to marine radiochemistry\n\nWM\n\nPhysical setting: Atm., ocean circulation, hydrol. cycle\n\nAtmospheric circulation and water cycle\n\nSD\n\nOcean circulation\n\nProblem set 1 due\n\nSD\n\nMajor constituents of seawater and controls\n\nMajor ions and salinity\n\nSD\n\nMarine carbonate chemistry\n\nProblem set 2 due\n\nWM\n\nInputs to and outputs from the ocean\n\nRivers and groundwater\n\nMKT\n\nHydrothermal processes\n\nProblem set 3 due\n\nMKT\n\nNon-conservative processes in estuaries/groundwater/hydrothermal\n\nMKT\n\nGas exchange across the air-sea interface\n\nSD\n\nAtmospheric-ocean interaction\n\nProblem set 4 due\n\nDT\n\nMid-term\n\nBiogeochemical cycling in the water column\n\nPrimary production (1)\n\nSD\n\nPrimary production (2)\n\nSD\n\nNew, export, and net community production\n\nProblem set 5 due\n\nSD\n\nSinking particles and remineralization (1)\n\nSD\n\nSinking particles and remineralization (2)\n\nProblem set 6 due\n\nSD\n\nQuantifying biogeochemical fluxes and rates\n\nSD\n\nBiogeochemical cycling in sediments\n\nEarly diagenesis I\n\nProblem set 7 due\n\nKC\n\nEarly diagenesis II and sediment distributions\n\nKC\n\nSpecial topics\n\nLong-term cycles of carbon, oxygen and sulfur\n\nDT\n\nP cycle\n\nProblem set 8 due\n\nDT\n\nN cycle\n\nKC\n\nAnthropogenic CO\n(1)\n\nProblem set 9 due\n\nSD\n\nAnthropogenic CO\n(2) and review\n\nSD\n\nFinal exam",
  "files": [
    {
      "category": "Resource",
      "title": "problem_set_1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/388d2376fb5cf3b7113ae277f12e4055_problem_set_1.pdf",
      "content": "Marine Chemistry 12.742\nProblem Set #1\nShow calculations for all work\nProblem 1:\nTwo elements, X1 (atomic mass=198.23) and X2 (atomic mass=172.33) have recently been discovered.\nAs an aspiring, free-thinking graduate student, your advisor has ordered you to study the nature of these\nelements in the ocean. After years of working out your analytical techniques and making hundreds of\nfield measurements, you are able to compile the following information:\nMean Conc.\nOceanic\nSources\nResidence\nTime\nElement\nSeawater\nRivers\nDry and Wet\nDeposition\nHydrother\nmal Vents\nX1\n15.0 fmol/kg\n11.5 pmol/kg\n13.7 Mg/y\n2.40 nmol/kg\nX2\n3.82 pmol/kg\n961 pptr\n45.7 Gg/y\n10 y\nUse a river freshwater discharge of 1.2x106 m3/s, an annual flux of fluid from hydrothermal vents of 70 x\n9 m\n3/y, an ocean volume of 1.35x10\n9 km\n3, and a mean seawater density of 1025 kg/m3. Assuming\nsteady-state (sources=sinks), fill in the two blank areas in the table.\nProblem 2:\nConsider the following chemical equation for the remineralization of generic marine organic matter.\n(CH2O)80(CH2)42(NH3)16H3PO4 + 175O2 ----> 122CO2 + 16HNO3 + 138H2O + H3PO4\n\" Redfield molecule\"\na.) What is the molecular weight of the Redfield molecule?\nb.) What is the molar ratio of carbon:nitrogen:phosphorus in the Redfield molecule (this is called\nthe Redfield Ratio) ?\nc.) If you have 30 mg of Redfield molecule, how many μmoles of O2 are needed to complete this\nreaction.\nd.) If you have 190 moles of Redfield molecule and 15 moles of O2, which is the limiting reagent?\n\nProblem 3:\nSi isotopes have been used as paleoproxies for surface nutrient utilization. Given the following table of\ndata:\na) Estimate the current mean δ30Si value of silicic acid in seawater.\nb) Plot the temporal evolution of mean ocean δ30Si value if the 30Si/28Si of input Si were to change to\n0.0335800 in a step function.\nSi input to ocean: 7x1012 mol/yr\nMean silicic acid concentration: 70 μM\n30Si/28Si of standard (NBS-28): 0.0335320\n30Si/28Si of input Si: 0.0335589\nfractionation factor for removal α=1.0015\nProblem 4:\nMeasuring the concentration and isotopic composition of nitrate in the upper water column gives:\nDepth (m) [NO3] (μM) δ15N (per\nmille)\n24.5\n6.8\n6.2\n5.5\n34.5\n4.9\n4.8\n4.7\n34.5\n4.75\na) Assuming that nitrate is supplied to the euphotic zone only by vertical upwelling from below 300m,\nestimate the fractionation factor (α) during nitrate uptake by phytoplankton. (Hint: assume Rayleigh\nfractionation for a closed system)\nb) What would the δ15N of surface nitrate be, if its concentration were reduced to 5μM by phytoplankton?"
    },
    {
      "category": "Resource",
      "title": "problem_set_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/6b8bb244dd81566cb0f71b18bc835590_problem_set_2.pdf",
      "content": "Marine Chemistry 12.742\nProblem Set #2\nProblem 1:\n(check the table of nuclides at http://ie.lbl.gov/toi/ to obtain the additional information that you\nneed for Problems 1 and 2)\nTwo techniques are available to measure radionuclides. Mass spectrometry measures atoms and\ncounting techniques measures decay rate (disintegrations)\nIf mass spectrometry requires 108 atoms for precise measurements and counting methods require\n0.5 dpm:\nA - Which technique would you use to measure (a) 210Pb and (b) 231Pa on the smallest possible\nsample?\nB - How much smaller would the sample size for your technique of choice be, compared to the\nother one?\nC - At what half-life does it become advantageous to use mass spectrometry?\nProblem 2:\nThe relative abundance of uranium isotopes in today's earth crustal material is:\n99.2745% 238U\n0.7196% 235U\n0.0055% 234U\nWhat were the relative abundances when the earth was formed 4.6x109 years ago?\nProblem 3:\nConsidered the radiative balance of the earth assuming that the surface and atmospheric\nproperties are uniform over the globe (i.e., do all calculations for a single planetary mean):\na) Compute the steady-state surface temperature of the planet for a no atmosphere case for (Note:\nfor radiation equations, use absolute temperature in K):\nFin= solar input = So/4=342 W m-2\nσ= Stefan boltzman constant = 5.7x10-8 Wm-2K-4\nα= albedo=0.33\nb) Assume the atmosphere can be treated as a single layer with a uniform temperature Ta and\nthat it is transparent to solar radiation and absorbs all the planetary radiation emitted by the earth.\nWhat is the atmospheric temperature? What is the surface temperature? The sketch below might\nhelp you think about the problem. Hint: Consider the net flux into the system and at the earth's\nsurface.\n\nA\nαFin\nFin\nAtmosphere\nA\nS\nSurface\nA= energy emitted by atmosphere\nS= energy emitted by surface\nc) Actually, the atmosphere does not absorb all the radiation emitted by the earth - it only\nabsorbs a fraction ε. If ε = 0.85 and the other constants are the same as in part a, what is the\natmospheric temperature? What is the surface temperature? The sketch below might help you.\nNote: Kirchhoff's law implies that the emissivity of the atmosphere equals its absorptivity. In\nother words: A= εσTa\nFin\n(1-ε)S\nαFin\nA\nAtmosphere\nA\nS\nSurface\nd) Compare the surface temperature calculated in c to the observed surface temperature of the\nearth. Explain possible reasons for the discrepancy.\nProblem 4:\nPrint out a daily map of atmospheric surface pressure for some large region of the globe (one\nwith enough detail where you can see actual pressure values and some wind vectors). Good\nexamples can be found on the National Center for Environmental Prediction web pages:\nNCEP Unified Surface Analysis: http://www.opc.ncep.noaa.gov/UA.shtml\n\nNCEP Ocean Prediction Center: http://www.opc.ncep.noaa.gov/index.shtml\nSee also http://www.opc.ncep.noaa.gov/product_description/keyterm.shtml for a discussion of\nweather symbols (e.g., wind vectors).\na) Discuss the main features of the surface map in terms of the geostrophic relationship between\nsurface pressure and surface wind speed and direction.\nb) Compare the forecast or analysis map in a) to the measured QuikSCAT satellite wind speeds\n(daily maps available from http://manati.orbit.nesdis.noaa.gov/quikscat) in terms of time/space\ndata sampling.\nc) How does an QuikSCAT instantaneous wind field compare with the climatological fields we\ndiscussed in class? Why do they differ? What implications might this have for ocean gas\nexchange, which depends on wind speed perhaps in a non-linear way?"
    },
    {
      "category": "Resource",
      "title": "problem_set_3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/2cdf8d0c29d4b57ea5e7954be4b2ffd6_problem_set_3.pdf",
      "content": "Marine Chemistry 12.742\nProblem Set #3\nShow calculations for all work\nProblem 1:\nYour officemate, a geology student, describes to you a recent paper showing evidence from an Ocean\nDrilling Program (ODP) leg that at several periods in the past the Mediterranean Sea became isolated\nfrom the Atlantic, dried up, and leaft behind thick evaporite deposits behind in the sedimentary record.\nAssume that the Mediterranean Sea has an average depth of ~2500m and a salinity of 36.0 on the PSS.\na) For a single evaporation event, what would be the sequence and approximate thicknesses of the\ndifferent layers salts deposited?\nb) What factors could complicate this estimate?\nc) How frequently would the Mediterranean have to evaporate to play a significant role in the ocean\nCl- and Na+ balance? Hint: How much salt is in the Mediterranean and how does it compare with\nthe annual river inputs assuming a 70x106 y residence time.\nProblem 2:\nApply the principle of constant proportions for the major ions in seawater to answer the following\nquestions.\na) What is the [Mg2+] in mmol kg-1 at a salinity of 29.356 on the PSS?\nb) What is the salinity of a water sample if [Br-] = 0.913 mmol kg-1\nc) Cite two examples where one of the major constituents of seawater behaves non-conservatively.\nExplain and draw hypothetical open ocean vertical profiles for one of these species.\nProblem 3:\nIn 1995, the U.S. Joint Global Ocean Flux Study (JGOFS) conducted an extensive, year-long process\nstudy in the Arabian Sea. One of the objective of the campaigns was to identify the biogeochemical\nresponses to the different physical forcing occurring during the summer southwest monsoon and winter\nnortheast monsoon. Based on the windstress maps for the two seasons and what you know about Ekman\npumping, describe your best-guess for the patterns of the following for each season:\na) wind-driven upwelling and downwelling\nb) coastal upwelling, SSTs and nutrients\n\nProblem 4:\nThe World Ocean Circulation Experiment (WOCE) conducted a global survey in the 1990s of ocean\nhydrographic and carbon system properties. Included below are contoured plots from section P15 in the\nPacific Ocean from the WOCE Pacific Atlas, http://www-pord.ucsd.edu/whp_atlas/pacific_index.htm.\nBased on the plots,\na) Show the location and direction of the major upper ocean geostrophic currents along P15 (Hint,\nremember that geostrophic flow involves a balance between pressure gradients and rotation;\npressure gradients will appear in hydrographic sections as density fronts).\nb) Based on the density, temperature and salinity plots identify the major water masses along the\nsection.\nc) Use the transient tracer data (14C and CFCs) to describe the ventilation time-scales along the\nsection. How does this match with your interpretation of the water masses from part b? For 14C,\nestimate the penetration depth for bomb-radiocarbon."
    },
    {
      "category": "Resource",
      "title": "problem_set_4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/f44ac0d091590fd466d31e88d01ad1c3_problem_set_4.pdf",
      "content": "Marine Chemistry 12.742\nProblem Set #4\nProblem 1:\na) Using the thermodynamic data from Dickson and Goyet (1994) (Chapter 5, page 14 of 22),\ncompute the dissociation coefficient for boric acid in a seawater solution at S=36, T=25 deg. C.\nFind the corresponding dissociation coefficient in the literature (e.g., CRC tables) for an idealized\ndilute freshwater system at the same temperature. How do these coefficients differ and why?\nb) Draw a diagram of the log10 concentration of the different species of boron as a function of pH in\nseawater and freshwater.\nc) Describe how boron contributes to seawater titration alkalinity. Given the information above and\nwhat you know about the average seawater concentration of boron and surface and deep water\npHs, estimate the magnitude and sign of the error of approximating titration alkalinity from\ncarbonate alkalinity (versus the more complete \"practical\" alkalinity defined by Zeebe and in the\nnotes).\nProblem 2:\nThe figure below from Lee et al. (J. Geophys. Res. Oceans, 1997) shows surface water properties\nalong a section in the Atlantic ocean. Use the S=35, T=25 deg. C values for the Henry's law constant\nfor CO2(g) - H2CO3*(aq) and the carbonate found in Dickson and Goyet (1994) Chapter 5. Using the\ndata from the figure then:\na) Estimate the concentrations of [H2CO3*], [HCO3\n-], and [CO3\n2-] at 20S and at the TCO2 minimum\njust north of the Equator using two different approaches. Why does inorganic speciation vary with\nlatitude? (Hint: There are several different ways to do this; remember from lecture that given\nmeasurements of two parameters for the inorganic carbon system, you can calculate everything\nelse).\nb) Estimate the saturation state of calcite and aragonite for the some locations (for simplicity use\nconstant effective saturation product of K*sp = [Ca2+][CO3\n2-] for calcite of 43x10-8 mol2 kg-2 and\nfor aragonite of 67x10-8 mol2 kg-2 at S=35, T=25). Discuss the results.\n\nProblem 3:\nK+ (mg l-1)\nK flux for rivers/vents\nAtlantic rivers\n1.4\nIndian rivers\n2.5\nArctic rivers\n1.2\nPacific rivers\n1.2\nRiver average\n1.5\n7.4 x 1013 g/yr\nSeawater\nEPR 21N vent fluid\nEPR 9N (1991) vent fluid\nEPR 9N (1994) vent fluid\nTAG vent fluid\n\"Average\" MOR vent fluid\n2.5 x 1013 g/yr\nEstimated ridge flank flux\n-1.5 x 1013 g/yr\nThe main sources and sinks for potassium in the ocean include river input and on-axis and\noff-axis hydrothermal activity. The table above shows concentrations of K+ in river waters,\nvent fluids, and seawater, as well as estimated fluxes of K+ into or out of the ocean.\na) Using data in the table, calculate the volumes of river water and on-axis mid-ocean ridge\nvent fluid that enter the ocean each year.\nb) The reaction\n2KAlSi3O8 + 2H+ + 9H2O - 2K+ + 4H4SiO4 + Al2Si2O5(OH)4\n(K-feldspar)\n(kaolinite)\nis one process that controls the riverine flux of K+ to the oceans.\ni.\nIs this weathering reaction an example of congruent or incongruent dissolution? (Provide a 1\nsentence explanation for your answer).\nii.\nList 2 factors that can affect the ion composition of rivers and that may explain the different\nK+ concentrations shown in the table above.\nc) Why are K+ concentrations in vent fluids so much higher than those in river waters?\nd) What information was used to estimate the ridge flank flux of K+, and why is hydrothermal activity\non ridge flanks a sink instead of a source for K as it is at the ridge axis? (Hint: very few ridge flank\nvents have been discovered and sampled).\n\nProblem 4:\na) Given the following information:\n- Salinity of coastal water (Scw): 33 permil\n- Salinity of open ocean water (Ssw): 35 permil\n- River flow into coastal water (Frw): 1 (arbitrary unit)\n- Concentration of tracer T in coastal water (Tcw): 1 (arbitrary unit)\n- Concentration of tracer T in open ocean water (Tsw): 0.5\n- Concentration of tracer T in river water (Trw): 0.0\n- Concentration of tracer T in groundwater (Tgw): 100\nWhat is the steady state flow of groundwater relative to river flow into the coastal zone?\nb) Would you reconsider your estimate if you were told that the river concentration estimate was only\nfor the dissolved fraction of tracer T and that the measurements were done upstream of the estuary?\nWhat additional information would you want to know in order to make a better estimate of the\nriverine and groundwater fluxes of dissolved T into the coastal ocean?\nProblem 5:\nConsider a gas exchange experiment where and inert dye, 3He, and SF6 have been injected into the\nsurface ocean. Assume that the mixed layer is uniformly 40m deep, temperature is 20 oC and wind\nspeed is 8.5 m/s. Some constants that might be useful are:\n- viscosity of seawater at 20oC = 1.0x10-2 cm2/s\n- diffusivity of 3He at 20oC = 6.5x10-5 cm2/s\n- diffusivity of SF6 at 20oC = 1.0x10-5 cm2/s\na) Using the Wanninkhof, 1992 parameterization of gas transfer velocity as a function of wind speed:\nk = 0.31 U2 (Sc/660)-0.5\ncompute the gas exchange time-scales for 3He and SF6.\nb) Write the differential equation and solution for the time rate of change of the SF6 as a function of\ntime due just to gas exchange. If you knew the exponent (n), in the generalized gas exchange\nparameterization, show how you could compute k from supersaturation of SF6 at two time points T0\nand T1.\nc) If you could estimate dilution from the dye, how would you modify the differential equation for\nSF6?\nc) With information from both He-3 and SF6 tracers at T0 and T1, show how you could also compute\nn. Assuming an initial supersaturation of 5% for both gases and a measurement error of 0.5%, how\nlong would you need to wait to remeasure the supersaturations following the initial injection (i.e., T1\nT0) to decide whether n should be 0.5 or 1.0?"
    },
    {
      "category": "Resource",
      "title": "problem_set_5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/900faf761b138f8046d1becd43bb741d_problem_set_5.pdf",
      "content": "Problem Set #5\nMarine Chemistry 12.742\nProblem 1:\nFigure 1 is a time-series of dissolved Fe concentration from the HOT station 100 km\nnorth of Honolulu. Data comes from Boyle et al. [in press]. Samples are collected at a\ndepth 35 m, which lies in the mixed layer\nA. What process(es) could be responsible for this temporal variation.\nB. The annual averaged dissolved concentration of Fe in the 75 m mixed layer at HOT is\n0.4 nmol/kg water. The annual average atmospheric aerosol flux of Fe to this region is\nestimated be 10 mg Fe per m2 per year. Using this flux value, what is the residence of Fe\nin the mixed layer?\nC. Many studies have concluded that only 1% of the aerosol Fe reaching the ocean is\ndissolved in seawater. If that is the case, what is the residence time of dissolved Fe in the\nmixed layer? Is this residence time estimate of Fe consistent with the time-series data in\nfigure 1? If not, how can you reconcile residence time values based on atmospheric\nfluxes with the variability of dissolved Fe in the mixed layer (fig. 1)?\n2.0\nTotal\nFe\n1.5\n(nmol/\nkg)\n1.0\n0.5\nJan.\nApril\nJuly\nOct.\nDec.\nFig. 1\n\nProblem 2:\na) Estimate the \"stagnant film\" thickness and \"surface renewal\" time-scale for an O2\npiston velocity of 2.5 m/d. Use a diffusivity of 1.45x10-9 m2 s-1 and a Sc number\nof 455. If the equivalent Sc for thermal diffusivity is ~8, what does that say about\nthe relative size of the thermal versus dissolved gas diffusive boundary layer?\nb) Calculate the approximate gas exchange time-scale for dissolved oxygen in the\nocean surface mixed layer for conditions above for a mixed layer of 75m depth.\nc) Estimate the gas exchange timescales for CO2 and 14CO2 under the same physical\nconditions given:\n- Schmidt number for O2 =455 and for CO2=1922;\n- H2CO3* =10 umol/kg, HCO3\n- = 1800 umol/kg, CO3\n2- = 200 umol/kg;\n- Revelle factor (fractional change in pCO2 for a fractional change in total\nR = \"pCO2\npCO2\nDIC\n\"DIC =10\ndissolved inorganic carbon:\nd) Consider the time-series of He and Ar gas saturations in the mixed layer given\nbelow for Bermuda. Given what you know about gas exchange, mixed layer depth\nand temperature, what do you think could explain the:\n- Supersatuation of He throughout the year\n- Large seasonal cycle in Ar supersaturation\ne)\n\nProblem 3:\nUse BATS mixed layer data from the figure below to answer the following questions\n(estimate values where appropriate):\na) Describe the factors that could govern the observed seasonality in chlorophyll and\nprimary production.\nb) Calculate a winter time euphotic depth, compensation depth and critical depth\ngiven:\n- kpar = 0.03 + 0.04*chl (1/m)\n- surface PAR irradiance 17.5 mol photon/m2/d\n- compensation irradiance 1.3 mol photon/m2/d\nAre these values consistent with you discussion on light effects in a)?"
    },
    {
      "category": "Resource",
      "title": "problem_set_6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/bd1973a2df134bb4bb094af3317c01aa_problem_set_6.pdf",
      "content": "For the calculations below, assume the following:\npCO2\n\"pCO2\n\"T\n= 4%/K\n-Revelle factor \"pCO2\npCO2\nDIC\n\"DIC =10\n-13C of DIC is zero and a biological kinetic isotopic fractionation of -23 per mille\nProblem Set 6\nMarine Chemistry 12.742\nProblem 1:\nA suite of biological and geochemical constraints can be used to estimate the major terms\nfor the upper ocean carbon budget. Shown below is a figure from Brix et al. (2004) based\non data from the Hawaii Ocean Time-series (HOT) in the subtropical North Pacific.\n(1) Describe the major physical and biological processes controlling the seasonal cycle of\nmixed layer salinity normalized DIC, pCO2, and 13DIC using mass balance equations\nand simple sketches.\n(2) Estimate quantitatively the partitioning between physical and biological impacts on\nthe seasonal cycle of pCO2.\n(3) Estimate the air-sea flux of CO2 (atmosphere pCO2 is dashed line in pCO2 panel\nbelow) given a 222Rn based piston velocity estimate of 3.4 m/day, Sc (222Rn)=2000,\nand Sc (CO2) = 660.\n(4) Estimate the Net Community Production assuming a purely local balance and\nneglecting physical transport.\n(5) Describe how could you use the 13C to improve your NCP estimate in the presence of\nhorizontal advection. Assume you knew the lateral gradients in salinity normalized\nDIC (-20 umol/kg/1000 km) and del13C (0) but not the advection speed.\n\nQuestion 2\nOn a cruise in the North Atlantic gyre off western Africa, you measured dissolved 234Th\n(λ234 = 0.029 d-1) in the upper 200m of the water column and the Corg/234Th ratio in\nsettling particles collected with a floating sediment trap deployed just below the mixed\nlayer. You also measured \"new\" production in a few samples within the mixed layer\nusing incubations with 15N-labeled nitrate.\na) Estimate the particle export time-scale given a mean 234Th activity in the upper\n100m = 1800 dpm/m3 and no deficit below that depth (100-200m) (the activity of\n238U in seawater is 2480 dpm/m3).\nb) Calculate a carbon export flux given that the material collected in the trap has a\nCorg/234Th ratio = 4 μmol C/dpm. [Hint: The vertically integrated mass budget for\n234Th gives the removal flux of 234Th on to particles, in atoms/m2/time, which\nshould balance the material caught in the trap].\nc) The results from the nitrate incubation indicate a mean nitrate uptake rate of 0.3\nmmolN/m2/d. Are these results consistent with the Th based export estimates?\nWhat other physical and biogeochemical processes could lead to a disconnect\nbetween the C based and N based estimates of net cycling through the\nQuestion 3\nImagine a hypothetical ocean with a homogeneous euphotic zone occupied by only one\nspecies of phytoplankton producing uniform spherical cells with a radius of 2μm. There\nare no seasonal variations, no predators and no bacteria so that the intact cells sink on\ntheir own from the euphotic zone. A sediment trap with an aperture of 0.5 m2 is deployed\nfor one year just below the euphotic zone and captures 91.25g of material. Assume\nparticles sink following Stoke's Law:\nw = sqrt(16 r g (ρs - ρw) / 3 ρw)\nwhere ρs is the density of the particle; ρw is the density of water; g is the gravitational\nconstant (9.81 m/s2), μ is the viscosity of water (10-2 g/(cm s)), r is the radius of the\nspherical particles, and w is the terminal velocity. Take the density of water as 1g/cm3\nand that of the particles (individual and colonies) as 2g/cm3.\na) Suppose that during that year, you filter 1 m3 of seawater from the euphotic zone.\nHow much material (in grams) do you expect to collect on the filter?\nb) How many cells do you expect to collect on the filter?\nThe following year, everything stays the same but 95% of the cells start to aggregate and\nproduce spherical colonies with a radius of 50μm, which also sink unaltered from the\neuphotic zone by gravitational settling.\nc) By how much would the suspended matter concentration in the euphotic zone\ndecrease compared to the previous year?\n\nd) How many individual cells and how many colonies would you find in 1 cubic\nmeter of water from the euphotic zone?"
    },
    {
      "category": "Resource",
      "title": "problem_set_7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/daa4b8fc19cc4c093bd0b70486b3cf2a_problem_set_7.pdf",
      "content": "Marine Chemistry 12.742\nProblem Set #7\nQuestion 1\nDeep-water thorium dynamics. Given the dissolved and particulate 230Th, 228 Ra and\n228Th data in the table and figure below. Recall that 234U decays to 230Th and 228Ra decays\nto 228Th:\na) Compute the expected 230Th flux reaching the seafloor at 6000m (from 234U) and\na mean particle sinking speed (given an approximation of the particulate 230Th\nprofile)\nb) Estimate values for the forward and backward scavenging coefficients k1 and k-1\nfor a simple, two-box dissolved-small particle reversible scavenging model (the\none from class) (Note: when you solve the equations for a single Th isotope you\nwill have two equations and 3 unknowns, w the sinking speed, k1 and k-1. Adding\nan additional isotope system adds additional constraints. Do NOT make this into a\nfull data analysis; eyeball some values--I just want you to get familiar with the\nequations and what the data might look like).\nc) Write out the equations of 230Th for 3-box (dissolved, small particle, large\nparticle) scavenging & particle aggregation/disaggregation model schematic\nshown below.\nd) Median radionuclide-based model estimates for beta2 and beta-2 are 3 y-1 and 150\ny-1, respectively. How would you interpret these values? What does it say about\norganic matter cycling.\nDissolved\n230Th\nPart.\n230Th\n\nQuestion 2\nA moored sediment trap has been deployed for exactly one year at 3000m in the central\ngyre of the Atlantic. The trap has an aperture of 0.5 m2 and collected 10.2g of settling\nmaterial.\nAnalysis of the material collected by the sediment trap for 238U, 230Th and 231Pa gives:\n238U = 0.20 dpm/g\n230Th = 3.00 dpm/g\n231Pa = 0.125 dpm/g\na) Assuming that all the 238U is present in the mineral lattice of clay minerals in which the\nU-decay series is in secular equilibrium, calculate the flux of scavenged 230Th and 231Pa\nintercepted by the sediment trap (for the latter, you will need to calculate the activity of\n235U, assuming natural isotopic abundance. Consult http://ie.lbl.gov/toi/ for needed\ninformation).\nKnowing that the 230Th and 231Pa produced in the water column (PTh; PPa) are removed in\ndifferent proportion by vertical scavenging (VTh; VPa) and horizontal transport to the\nmargins (HTh; HPa) and knowing that the ratio of the horizontal transport rate of the two\nnuclides RH = HTh/HPa = 2, calculate:\nb) The fraction of 230Th and 231Pa produced in the water column of the central gyre that is\nremoved by the vertical flux of particle in the central gyre region or by lateral transport to\nthe margins.\n\nc) The trapping efficiency of the sediment trap that was deployed and the vertical flux of\nmaterial corrected for inaccuracies in trap collection.\nProblem 3\nA water sample taken from the deep Atlantic within the NADW has the following\ncharacteristics:\nPot. Temp.: 2°C\nSalinity: 35 psu\n[NO3\n-] = 21.5 μmoles/kg\n[Phosphate] = 1.45 μmoles/kg\n[O2] = 250 μmoles/kg\n[ΣCO2] = 2180 μmoles/kg\nCA = 2300 μmoles/kg\nCalculate, using the revised Redfield Ratios of Anderson and Sarmiento (P/N/-O2/Corg =\n1/16/170/117):\na) The number of moles of organic carbon that has been oxidized and the number of\nmoles of calcium carbonate that has dissolved per kg of seawater during the\ntransit time of deep water from its site of formation in the N. Atlantic to the site\nwhere the sample was collected.\nb) Preformed nitrate, phosphate, and ΣCO2 concentration.\nc) How large is the increase in [Ca2+] relative to its average concentration in\nseawater?\nd) The number of additional moles of organic carbon that needs to be oxidized to\ndeplete all the remaining oxygen.\ne) The number of additional moles of organic carbon that would have to be oxidized\nunder anaerobic conditions to subsequently deplete all the available nitrate. First\nassume that the nitrate reducers only oxidize carbohydrates, then calculate how\nmuch more nitrate per moles of C oxidized is required when nitrate oxidizers\noxidize organic matter with the chemical formula (CH2.72O)\nSeawater O2 concentration in equilibrium with the atmospheres at 2°C and 35 permil\nsalinity = 331.8 μmoles/kg\nUse the relationship: Total Alkalinity = 547.05 + (50.56 x salinity) to estimate preformed\ncarbonate alkalinity."
    },
    {
      "category": "Resource",
      "title": "problem_set_8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/5b069eff022b60ce06a43dbe46adc159_problem_set_8.pdf",
      "content": "sediment-water interface (x) in cm:\n\" = 0.70 + 0.14e#0.63x\nMarine Chemistry 12.742\nProblem Set #8\nQuestion 1\nUse the accompanying data table, pore water [NO3\n-] (in μmol/l) vs depth (in cm), and the\nadditional information below to answer the following questions. Use the additional data:\n- Sediment porosity (φ) (cm3 of pore water / cm3 bulk sediment) vs depth below the\n-\n- The diffusion coefficient for NO3 in seawater at 2°C: 330 cm2/y\n-\nDsed = Dsw\" 2\nDsed for NO3\n- varies with sediment porosity as follows:\na) Identify the depth of the boundary between the layer in which O2 is used as the\nelectron acceptor for organic matter decomposition and that in which NO3\n- is used.\nb) Calculate the diffusive flux of NO3\n-across the sediment-water interface. Is it directed into or out of the sediments?\n-across the boundary between the oxic and denitrification layers. Is it directed toward\nor away from the sediment-water interface?\nc) Use your knowledge of organic matter decomposition stoichiometry to calculate:\n-the rate of N2 production\n-the rate of organic matter oxidation by O2\n-the rate of organic matter oxidation by NO3\n\ndepth (cm)\n0.1078\n0.1944\n0.4005\n0.8133\n1.0119\n1.2382\n1.4285\n1.6384\n1.8298\n2.0374\n2.2629\n2.6111\n2.943\n3.3092\n3.7131\n4.0814\n4.3173\n4.7371\n5.1927\n5.6871\n6.0038\n6.3364\n6.6858\n7.3076\n8.124\n8.8684\n9.3452\n10.0184\n10.5531\n11.1146\n12.114\n13.1986\n14.6229\n16.1942\n18.2333\n20.1771\n22.3214\n25.9597\n30.6832\nNO3 (micromol/l)\n23.3\n25.0276\n26.2846\n28.858\n32.5975\n33.881\n35.0346\n35.7949\n36.4507\n36.9085\n37.2781\n37.5522\n37.7597\n37.7559\n37.5617\n37.1495\n36.6141\n36.1982\n35.3268\n34.2039\n32.791\n31.7862\n30.6603\n29.5065\n27.5885\n25.3112\n23.4489\n22.3526\n20.9206\n19.8721\n18.8479\n17.2007\n15.6355\n13.8754\n12.2527\n10.5408\n9.23077\n8.06413\n6.5711\n5.24167\n\nQuestion 2:\nUse the sedimentary pore water depth profiles in the figures below. Remember these are\nreal data, and they have some deviations from smooth profiles due to sampling and\nanalytical uncertainty; keep that in mind as you discuss them. NOTE: 10x fold different\ndepth scales for O2 versus trace metals.\nTemperature: March = 4 °C, August = 15°C\nSedimentation rate: 0.3 mmbulk sed/y\nPorosity: 0.8 cm3\nwater / cm3\nbulk sed . (Note: (1-porosity) ~ cm3\nsolid/cm3\nbulk sed)\nDensity of sedimentary solids: 2.6 gsolid/cm3\nsolid.\nDiffusion coefficients. These values apply to diffusion in sediment pore waters:\nDsed (O2) (a) at 4°C: 270 cm2\nsed/y\n(b) at 15°C: 355 cm2\nsed/y\nDsed (U) (a) at 15 °C: 150 cm2\nsed/y\n(1) How do you account for the difference between bottom water O2 concentrations in\nMarch and August?\n(2) Use the shapes of the pore water O2, Mn2+, and Fe2+ profiles to define zones of net\nconsumption of O2 and net production of dissolved Mn2+ and Fe2+ in March and August.\nHow do you explain your observations?\n(3) It has been observed that, in many coastal sediments, the rate of sedimentary organic\ncarbon oxidation can be calculated from the sedimentary O2 consumption rate as if O2\nwere the only electron acceptor. With this in mind,\n(a) Use the included graphs to calculate the sedimentary O2 consumption rates in\nMarch and in August.\n(b) Estimate the rate of sedimentary organic carbon oxidation at each time.\n(4) The U that is added to the solid phase is called \"authigenic\" U. Answer the following\nquestions using the dissolved U profiles.\n(a) Over what depth interval in the sediments is there net removal of U from pore\nwaters to the solid phase?\n(b) Calculate the rate of removal of U from the pore waters in August.\n(c) Using your result from question (4), calculate the concentration of authigenic U\nthat you would expect to see in a measurement of the solid phase. State your\nassumptions.\n(d) Paleoceanographers use changes in the accumulation rate of uranium in\nsediments to infer changes in the oxygen penetration depth in sediments. Their\nreasoning is that uranium is soluble in oxic seawater and insoluble in anoxic\nsediments. U is supplied to the sediments by diffusion across the sediment-water\ninterface. Would you say that these profiles support that use of U accumulation\nrates in sediments?\n\nQuestion 3:\nThe dissolution of CaCO3 in the ocean water column and in surface sediments\ndepends upon bottom water and pore water carbonate ion concentrations, pressure and\ntemperature. Below are two figures from Sarmiento and Gruber showing the surface\nsediment CaCO3 (% weight) and a vertical section (depth/distance; North Atlantic to\nNorth Pacific) of the carbonate ion anomaly ΔCO3\n-2 relative to the solubility product for\ncalcite and aragonite\na) Briefly describe the processes effecting carbonate ion anomalies; why do the N.\nPacific and N. Atlantic differ?\nb) Consider perpendicular cross-sections to the mid-ocean ridges in the N. Atlantic\n(30 deg. N), S. Pacific (30 deg. S), and and N. Pacific (30 deg. N). Draw idealized\ndiagrams showing the aragonite and calcite saturation horizons, lysocline, calcite\ncompensation depth, and the vertical profile of CaCO3 rain rate and burial?\nc) How would the ocean carbonate cycle differ if all of the organisms formed\naragonite rather than calcite. Consider both the transient response and steady-state\nresponse."
    },
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/f29ad06348cb69625f4a7011dffa72f4_lec1.pdf",
      "content": "12.742 - Marine Chemistry\nFall 2004\nLecture 1 - Determinants of Seawater Composition\nProf. Scott Doney\nWe start offdiscussing sources and sinks for major ions.\nToday we focus on box models,\nresidence times, and distributions.\n- Main points\n- Box models/residence times\n- Groupings of chemical elements (major vs. minor)\n- Spatial gradients (vertical / horizontal)\n- Resources:\n· Y. Nozaki et. al. \"A fresh look at element distributions in the North Pacific\", EOS,\nMay 1997. http://www.ajn.org/eos_elec/97025e.html\n· MBARI periodic table of the elements. http://www.mbari.org/chemsensor/pteo.\nhtm\n- Box Model\nFigure 1.\nLiqui\nd filled box wit\nh arrow indicating internal cycling.\n- Assume for the moment, a well mixed box\nFigure 2.Liquid filled box with well mixed contents.\nConcentration = Ci\nVolume = V0\nInventory = CiV0\n\nd(CiV0) = input\ndt\n-loss\n- Assume loss rates are proportional to the inventory - negative feedback\nd(CiV0) = Ii\ndt\n-kiCiV0\nwhere ki has units of\nk\ntime:\ni = 1\nτi\nUnits:\nmol\nm\nm3 ·\n3 ·\nmol\n=\ns\n=\ns\nmol\ns ·\nm\nm3 ·\nCan solve for a \"steady state solution\":\nd(CiV0) = 0 = Ii\ndt\n-kiCi\n∗V0\nI\nCi\n∗=\ni\nτi =\nkiV0\nC∗\n=\ni V0\nki\nresidence time\nIi\nbigger input →bigger Ci\n∗\nbigger τi (smaller ki) →bigger Ci\n∗\n- Time evolving system:\nC0\ni is Ci at time zero.\nCi = (C0\ni -Ci\n∗)e-kit + Ci\n∗\nas t →inf, Ci →Ci\n∗\nGra\nph\no\nf Ci\nversus time.\nFigure 3.\nAt t = τ have approached 63% of the way from C0\ni to Ci\n∗, and at t = 3τ have approached\n95%.\n· τi and ki functions of constituent (not reservoir)\n\nCo m pa\nr\nis\no n o\nf\ntwo g\nraphs.\nFigure 4.\n· sets up lag in ocean response - characteristic time-scales\n· very different spatial distributions depending upon sources and sinks, time-scales/residence\ntimes\nSources and sinks\n-\nDiagra\nm of flow of\nmatter o\nn and abov\ne Earth's surface.\nFigure 5.\nFor most elements, rivers are the primary sources, while sedimentation/burial are the primary\nsinks.\nEstimating residence times:\namount in ocean\nτ =\namount in ocean\n=\ninput\nVriver × Criver\n\nComplications and issues:\n- River inventories highly variable\n- Cyclic salts\n- Anthropogenic activities (positive bias), these bias pre-industrial estimates\n- Other sources\namount in ocean\nτ =\n-\n! inputs\nEstimate using outputs instead\nτ ↔chemical reactivity\nτ is O(102) -O(108) years\n- Major ions (those with high quantities), with residence times of 0.5 -200 × 106 years\nNa, Mg, Ca, K, Sr, Cl, SO2\n-, Br, F\nτ ≫1000 years (overturning circulation time-\nscale of ocean)\n- Trace elements with long residence times\nRb, Li, Mo, Cs, U\n0.3 -3 × 106 years\nLow quantities because there are low quantities in source rocks\nSolubilized by stable oxyanions\n- Trace elements with short residence times\nτ < 1000 yrs, 50 -1000 yrs\nNo longer \"well-mixed\"\nFe, Ag, Hg, Th, Pa, Al, Pb, REE (Rare\nEarth Elements)\nInput\n/output box.\nFigure 6.\n\nElements can also be categorized based on source and internal cycling pathways\n- Aeolian (dust) deposited and water-column scavenged elements\nExpon\nen\ntial decre\nase in dust input as depth increases.\nFigure 7.\nAtlantic versus Pacific - large differences in dust deposition\n- Biologically recycled elements\nIntermediate residence times/rapid uptake and recycling in the water column\nC, N, P (along with many trace elements) taken up by organism\nDiagram o\nf cycle\nof biolo\ngical elemen\nts.\nFigure 8.\n- Two components of biologically produced material\n- \"Soft organic matter\" - cells, carcasses, mucus, etc.\nC, N, P (O2)\nSimple respiration and photosynthesis:\nO2 + CH2O ⇌CO2 + H2O\nElemental stoichiometry for marine plankton (Redfield ratios):\n106 CO2 + 16 NO3\n-+ HPO2\n-+ 122 H\n+\n2O + 18 H\n→C106H263O110N16P1 + 138 O2\nShallow remineralization\n\n- \"Hard organic matter\" - shells, tests\nCaCO3 - forams, coccoliths, pteropods, corals\nSi - diatoms, radiolarians\nSrSO4 - Acantharia\nDeep remineralization\n\"Nutrient-like\" elements associated with both \"soft\" and \"hard\" biological material\nPart\nicle\nflu\nx at\nvarying depth\nfor hard and soft material.\nFigure 9.\nConcentration profile of \"Nutrient-like\" elements\nConcent\nratio\nn prof\nile\nof nutr\nient-l\nike e\nlement\ns.\nFigure 10.\n\nfrivers ≈fburial\nnet upward mixing flux ≈particle flux\nfluxes into surface box = fluxes out of surface box\nVR[CR] + Vmix[Cdeep] = Vmix[Cshallow] + Fsink\nfluxes into deep box = fluxes out of deep box\nVmix[Cshallow] + γFsink = Vmix[Cdeep]\nVmix\nVR\n≈\nγ = fraction of sinking particle flux that remineralizes in deep box\n(1 -γ) = fraction that is buried\nDiagram\nof water flow in Atlantic and Pacific oceans.\nFigure 11.\nDeep waters form in North Atlantic and Southern Ocean. Oldest deep waters are in the North\nPacific\n\nDiagr am of oc ean circulation.\nAn example is NO3\n-, O2, silicate from Broecker and Peng (1982).\nStart building more complex box models."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture_2_notes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/80b06489c46d8a4c996df60d653a675c_lecture_2_notes.pdf",
      "content": "Lecture 1 overview\n- Sources and sinks of material to the\nocean\n- Box models and residence times\n- Major elements\n- Biological and trace elements\n- Ocean thermohaline circulation\nWhy cover stable isotopes?\n- Unique tracers of biogeochemical processes:\n! Trace source and sink processes important for the\ninventories of major nutrients and chemical\nconstituents.\n! Record past changes in physical and biological\nprocesses affecting the ocean.\nLecture 2:\nIntroduction to Stable Isotopes\n- Definitions\n- Measurement\n- Theories and Models\n- Applications in Marine Chemistry\n! Physical and chemical processes\n! Biological processes\n! Paleoceanography\n- Isotopes are atoms that contain the\nsame number of protons but differ in the\nnumber of neutrons.\nDefinitions\n1H\n2H (D)\n3H (T)\nProton\nNeutron\nElectron\n12C\n13C\n14C\n\n- Isotopes are atoms that contain the\nsame number of protons but differ in the\nnumber of neutrons.\nDefinitions\n1H\n2H\n3H\nProton\nNeutron\nElectron\n12C\n13C\n14C\nStable isotopes\ndo not decay\nradioactively\n- Isotopes are atoms that contain the\nsame number of protons but differ in the\nnumber of neutrons.\nDefinitions\n1H\n2H\n12C\n13C\n!m/m\n1.00\n0.08\nThe difference in\nmasses among\nstable isotopes is\nrelatively larger for\nsmaller mass atoms\nCommon Light Stable Isotopes\n0.02\n4.21\n0.75\n95.02\n0.200\n0.038\n99.762\nAverage\nAbundance\n36S\n34S\n33S\n32S\n18O\n17O\n16O\nStable\nIsotopes\nSulfur\nOxygen\nElement\n0.37\n15N\n99.63\n14N\nNitrogen\n1.10\n13C\n98.90\n12C\nCarbon\n0.015\n2H (D)\n99.985\n1H\nHydrogen\nAverage\nAbundance\nStable\nIsotopes\nElement\nIsotope Ratios\n- Isotope ratios can be measured more\nprecisely than absolute abundances of\nisotopes.\n- Generally, isotope ratios are reported as the\nratio of a heavy (rare) isotope to a light\n(primary) isotope:\n\" 13RCO2 = 13CO2/12CO2\n\" 15RN2 = 15N2/14N2\n\nDelta Notation\n- Isotopic ratios expressed relative to a standard using delta\nnotation:\n- Rsample is the isotopic ratio of a sample\n(e.g.,18Rsample = 18O/16Osample)\n- Rstd is the isotopic ratio of the standard, or reference material\n- Rsample < Rstd gives negative \" value and is said to be depleted\n- Rsample > Rstd gives positive \" value, said to be enriched\nExample: For a sample with 18O/16O=0.00198\nDelta values are often expressed in units of permil (%) by\nmultiplying by a factor of 1000.\nIn this example, \"18O is -0.010 (unitless) or -10%\n\" = [Rsample/Rstd -1]\n\"18O = [0.00198/0.00200 -1] = -0.010\nIsotope Ratio Standards\nCDT\nTriolite (FeS) from\nthe Canyon Diablo\nmeteorite\nS\nVSMOW\nVienna Standard\nMean Ocean Water\nO\nN2(atm.)\nAir Nitrogen\nN\nPDB\nPeeDee Belemnite\n(carbonate)\nC\nVSMOW\nVienna Standard\nMean Ocean Water\nH\nAbbrev.\nStandard\nElement\nInternational standards used for reporting isotopic values\n- Definitions\n- Measurement\n- Theories and Models\n- Applications in Marine Chemistry\n! Physical processes\n! Chemical processes\n! Biological processes\n! Paleoceanography\nLecture 2:\nIntroduction to Stable Isotopes\nMeasuring Isotopic Ratios\n- Convert element of interest into a stable gas.\n- Purify/separate gas analyte from contaminants (off-line\nor on-line)\n- Measure isotopic ratios on an isotope ratio mass\nspectrometer (IRMS)\n\nMeasuring Isotopic Ratios\n- Example 1: Carbon isotope ratio of calcite shells.\n! Shells (CaCO3) + acid # CO2\n! CO2 # IRMS, measure m/z:\n\" 44 (16O-12C-16O)\n\" 45 (16O-13C-16O or 17O-12C-16O or 16O-12C-17O )\n\" 46 (18O-12C-16O or 16O-12C-18O)\n- Example 2: Nitrogen and Oxygen isotopic ratios of\ndissolved nitrate.\n! Dissolved nitrate + denitrifying bacteria # N2O\n! N2O #Purify from CO2 # IRMS, measure m/z:\n\" 44 (14N-14N-16O)\n\" 45 (15N-14N-16O or 14N-15N-16O or 14N-14N-17O)\n\" 46 (14N-14N-18O)\nMeasuring Isotopic Ratios\nIon Source\nSample Inlet\nMagnetic Sector\nDetectors\nFlight Tube\nIon Beam\nm/z = 44, 45, 46 for CO2, N2O\nm/z = 28, 29 for N2\nm/z = 32, 33, 34 for O2\nMeasuring Isotopic Ratios\n46Rsample\n46Rstd\n46R\ntime\nDual inlet mode\nContinuous flow mode\n46R\ntime\n- Definitions\n- Measurement\n- Theories and Models\n- Applications in Marine Chemistry\n! Physical processes\n! Chemical processes\n! Biological processes\n! Paleoceanography\nLecture 2:\nIntroduction to Stable Isotopes\n\nIsotopic Fractionation\n- Two types of isotopic fractionation that cause\nchanges in isotopic ratios\n! Kinetic isotope fractionation:\n\" One isotope reacts, diffuses, or evaporates faster than the\nother.\n\" Can be due to chemical, physical, or biological processes.\n\" Usually, the lighter isotope reacts or diffuses faster.\n\" Magnitude of isotope effect is temperature, reaction rate,\nand species dependent\n! Equilibrium isotope fractionation:\n\" Exchange reactions in which a single atom is exchanged\nbetween 2 species (with isotopic preference).\n\" Bidirectional (reversible) chemical reactions\n\" Temperature dependent\nKinetic Isotope Fractionation\nInteratomic Distance\nPotential Energy\nA*I\nAI\nEl\nEh\n- In a diatomic molecule, substitution\nwith a heavy isotope lowers the ground\nstate vibrational energy and makes it\nmarginally more difficult to break the\nbond\n- Reactions of heavy isotopically\nsubstituted molecules are marginally\nslower than light isotopic molecules and\n\"discrimination\" against the heavy\nmolecule leads to kinetic isotope\nfractionation:\n\"Fractionation factor\": #k = kl/kh > 1\n\"Isotope effect\": $k = (#k-1) > 0\nAI\nA + I\nA*I\nA + *I\nkl\nkh\nKinetic Isotope Fractionation\n-\n*I/Iproduct<*I/Isubstrate\n-\nConsumption of substrate leaves behind substrate enriched in the\nheavy isotope, and becomes increasingly enriched as the amount of\nsubstrate that is consumed increases\n-\nIn turn, the product also becomes proportionately heavier.\n-\nThe greater the isotope effect, or isotopic discrimination, the more\ndramatic the enrichment for the same level of substrate\nconsumption.\nAI\nA + I\nA*I\nA + *I\nkl\nkh\nKinetic Isotope Fractionation Models\n- Closed system\n- Unidirectional\n- Constant isotope effect\n- No replenishment of reactant\n- No removal of product\n- Open system\n- Addition/replenishment of reactant and/or removal of\nproduct\n- Unidirectional or bidirectional\n- Constant isotope effect\n- Doesn't have to be at steady state\n\nKinetic Isotope Fractionation\n\"s ! \"s0 - $ * ln(f)\n\"inst.prod. ! \"s - $\n\"accum.prod * (1-f) + \"s *f ! \"s0\n\"accum.prod. ! \"s0 + $*f*ln(f)/(1-f)\nIn closed systems: substrate --> product\n$ is the isotope effect (> 0 when kl > kh)\nf is the fraction of substrate remaining ([S]/[S]0)\nThe accumulated product follows from mass balance:\nKinetic Isotope Fractionation\n\"\n$\n$\n\"substrate =\"s0 - $ * ln(f)\nFraction of substrate remaining\nf % [S]/[S]0\n\"inst.prod. = \"s - $\n\"accum.prod. = \"s0 + $*f*ln(f)/(1-f)\nIn closed systems: substrate--> product\nKinetic Isotope Fractionation\n\"substrate =\"s0 - $ * ln(f)\nCalculate $ from a closed system reaction by measuring\nthe change in either \"substrate or \"accum.prod as a function of f.\n\"\n-ln(f)\nslope = $\n\"accum.prod. = \"s0 + $*f*ln(f)/(1-f)\n\"\nf*ln(f)/(1-f)\nslope = $\nKinetic Isotope Fractionation\nIn cases where very little of the substrate has been\nconsumed (f ! 1): $ = \"substrate - \"prod\n\"\n$\nf % [S]/[S]0\n\nKinetic Isotope Fractionation\nCO2\nCorg\nphotosynthesis\n\"13CCO2 (-8 to -10%)\nSubstrate\nProduct\n\"13Corg (-18 to -23%)\nNO3\n-\nNorg\nnitrate assimilation\n\"15NNO3 (+5%)\n\"15Norg (-1 to +5 %)\nSO4\n-2\nS-2\nsulfate reduction\n\"34SSO4 (+20%)\n\"34SFeS2 (-45% to +20 %)\n$ ! 20%\n$ ! 5-10%\n$ ! 2-42%\nKinetic Isotope Fractionation\nCorg\nCO2\nCO2\nCO2\nCorg\nphotosynthesis\n\"13CCO2 (-8 to -10%)\n\"13Corg (-18 to -23%)\n$ ! 20%\nhigh $\nlow $\nNitrate Uptake by Phytoplankton\nThermocline\nPhytoplankton\nNO3\n-\n$\nf\n1-f\n\"15NO3,surf =\"15NO3,deep - $*ln(f)\n\"15NPN =\"15NO3,deep + $*f*ln(f)/(1-f)\nSea surface\ndepth\n\"15N-PN\n\"15N-NO3\n-\n[NO3\n-]\nProperty increasing\nNitrate Uptake by Phytoplankton\nThermocline\nPhytoplankton\nNO3\n-\n$\nSea surface\nf1\nPhytoplankton\nf2\nPhytoplankton\n1-f1\nf1-f2\nf3\nf2-f3\nIncreasing \"15NO3\n-\nIncreasing \"15NPN\n\n2 graphs showing correspondence\nbetween surface sedi\nme\nnt and NO3- levels.\n140o\n130o\n120o\n110o\n100o\n90o\n80o\n70o20o\n15o\n10o\n5o\n0o\n5o\n10o\n15o\n20o\n14%\n8%\n10%\n12%\n7%\n6%\n5%\n14%\n12%\nPanama Basin\nSurface sediment δ15N\n140o\n130o\n120o\n110o\n100o\n90o\n80o\n70o20o\n15o\n10o\n5o\n0o\n5o\n10o\n15o\n20o\nSurface ocean [NO3- ] (μM)\nibution of surface (Holocene) sediment δ15N values compared with surface ocean [NO3 ] (b; ref.13) in the ea\nvalues are from this study (available via e-mail from J.W.F. at jfarrell@brook.edu) and ref. 7. Bulk sediment\nr δ15N analysis by freeze-drying and homogenizing by grinding. Sediments were combusted in an online Fis\nthe evolved N2 was passed to a VG PRISM isotope-ratio mass spectrometer in a continuous flow of He. Res\nn, δ15N = [(15N/14N)sample/(15N/14N)standard -1] per mil, relative to atmospheric N2 and the measurement pre\nhave assumed that the isotopic composition of the total nitrogen primarily reflects that of marine organic ma\ntrogen (ammonium) within clay minerals and adsorbed atmospheric N2. Initial results from Panama basin sed\ntrogen constitutes a minor proportion of the total. As drawn, the δ15N isopleths violate 5% of samples by >0.\n-\nstern tropical pacific\nsamples were\nons NA 1500 element\nults are reported in\ncision is better than\ntter, rather than\niments indicate that\n3% .\nistr\n15N\nfo\nand\ntatio\nWe\nc ni\nc ni\nSpatial d\nOcean. δ\nprepared\nanalyser\nthe δ no\n+0.3% .\ninorgani\ninorgani\n_\nFigure by MIT OCW.\n\nOpen System: Steady State Model\nMass Balance: \" Min= \" Mout\nIsotope Balance: \" Min*\"in = \" Mout*\"out= \" Mout* (\"NO3 - $out)\nIn:\nNitrogen Fixation (125 Tg N/yr, \"15N = 0%)\nOut:\nSedimentary denitrification (? Tg N/yr, 15$ = 0%)\nWater column denitrification (80 Tg N/yr, 15$ = 25%)\nMN2fix*\"N2fix = Msd* (\"NO3 - $sd) + Mwd * (\"NO3 - $wd)\n(125 Tg N/yr)*(0%) = (? Tg N/yr)*(5% - 0%) + (80 Tg N/yr)*(5% - 25%)\n0 Tg N/yr % = (5% * Tg N/yr SD) -1600 Tg N/yr % =>\n320 Tg N/yr (Sed. Denit)!\nIsotopic Fractionation\n-\nTwo types of isotopic fractionation that cause changes in\nisotopic ratios\n! Kinetic isotope fractionation:\n\" One isotope reacts, diffuses, or evaporates faster than the other.\n\" Can be due to chemical, physical, or biological processes.\n\" Usually, the lighter isotope reacts or diffuses faster.\n\" Magnitude of isotope effect is temperature, reaction rate, and\nspecies dependent\n! Equilibrium isotope fractionation:\n\" Exchange reactions in which a single atom is exchanged\nbetween 2 species (with isotopic preference).\n\" Bidirectional (reversible) chemical reactions\n\" Temperature dependent\nEquilibrium Isotope Effects\nForaminiferal shell\nSurface seawater\nExample: CaCO3 equilibration with surface seawater\nCaC16O3 + H2\n18O\nCaC16O2\n18O + H2\n16O\nEquilibrium Isotope Effects\nForaminiferal shell\nSurface seawater\nExample: CaCO3 equilibration with surface seawater\n[CaC16O2\n18O]*[H2\n16O]\nK=\n[CaC16O3]*[H2\n18O]\n=\n[CaC16O2\n18O]/[CaC16O3]\n[H2\n18O]/[[H2\n16O]\n= RCaCO3/RH2O\n= #equilib (equilibrium fractionation factor) ~ 1.0286 at 25°C\nCaC16O3 + H2\n18O\nCaC16O2\n18O + H2\n16O\n\nTemperature Dependence\nThis system is used as a\nrough paleothermometer:\n- Calcite is preserved in\nmarine sediments.\n- #equilib varies as a\nfunction of temperature\n(higher value at lower T)\nT (°C) = 16.9 - 4.2*(\"18OCaCO3 - \"18OH2O) + 0.13 *(\"18OCaCO3 - \"18OH2O)2\nFrom the dependence of #eq on T:\nSedimentary Record of\n\"18OCaCO3\nChanging \"18OCaCO3 can reflect changing #(T) but also\nneed to account for changing \"18OH2O...\nIncreasing\n\"18O-CaCO3\nValues\nIncreasing\n\"18O-H2O and/or\nIncreasing #eq\nLGM\nIce Volume Effect on \"18OH2O\n- Water with low \"18O is stored\nin ice caps during the glacial\nperiods, leaving the residual\nocean water enriched in 18O\n- Approx. 2/3 of the change in\nplanktonic \"18OCaCO3 is due to\nthe increase in \"18OH2O during\nglacial periods, the rest is due to\nlowered sea surface temperature\n- Additional caveats due to\nchanges in salinity and \"vital\"\neffects, or non-equilibrium\nnature of foram shells\nSummary\n- Stable isotopic ratios vary widely in nature\n- These variations record the results of chemical, physical, and biological\nprocesses\n- At equilibrium, isotopes are unequally distributed among molecules or\nphases and the distribution is determined by thermodynamics\n- Kinetic isotope effects arise from slight differences in the rates of reaction\ninvolving isotopically substituted molecules\n- Because of discrimination against heavy molecules, substrates become\nenriched in heavy isotopes as a reaction proceeds, and with constant offset ($)\nthe products also become more enriched"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_3_slides.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/70c21e6cde1688826f3f3e6c46170146_lec_3_slides.pdf",
      "content": "Introduction to Marine Radiochemistry\n1. Isotopes and radioactive decay\n2. Mathematical description of radioactive decay\n3. Decay of a parent isotope to a stable daughter\nExample: radiocarbon dating\n4. Decay series\nMath\nU, Th series in oceanography\nExamples : Th isotopes\n\nAtoms and Chemical Elements\nAtom: a nucleus surrounded by electrons:\nAtomic radius ~ 10-8 cm\nNuclear radius ~ 10-12 cm\nNuclear density ~ 1014 g/cm3 !\nThe nucleus consists primarily of\npositively charged protons\nelectrically neutral neutrons\nA chemical element is characterized by a specific number of\nprotons in its nucleus; different isotopes of an element contain\ndifferent numbers of neutrons\n\nNotation\nZ = atomic number (= number of protons in nucleus)\nN = neutron number\nA = Z + N = mass number\nA\nZ\n238U\n(the \"92\" is redundant with \"U\" and\nis usually omitted)\nOr, an element with several isotopes:\n12C,13\n6 C,14\n6 C\n\nHolden, N. E., and F. W. Walker. Chart of the Nuclides. 11th ed. Schenectady, NY: General Electric Co., 1972.\nImage removed due to copyright restrictions.\n\nChart of the nuclides: expanded view\n\nHolden, N. E., and F. W. Walker. Chart of the Nuclides. 11th ed. Schenectady, NY: General Electric Co., 1972.\nImage removed due to copyright restrictions.\n\nThe unstable nuclides -- \"radionuclides\"\nIf so many nuclides are unstable, why are they around?\n1. Formed during initial nucleosynthesis, but decay very slowly: e.g.,\n238U, 235U, 232Th\n2. Formed by decay of slowly-decaying parent isotope\n3. Formed by a naturally occurring process, e.g., comsogenic isotopes: 14C\n4. Anthropogenic: e.g. nuclear bomb testing and nuclear energy production,\ne.g., Pu isotopes, 3H, 137Cs,...\n\nExample : E- Decay\nNeutron o proton electron\nFor example,\n40Ca E\nZdaughter Zparent1\n-We can measure\nAdaughter Aparent\n40K o20\nQ Energy\nNdaughter Nparent1\nE particles\n\nBeta particle emissions\nby sodium.\nNeutrino decay ene\nrgies.\nFigure by MIT OCW.\nFigure by MIT OCW.\n\nExample : D decay\nDecay by emission of a 4He nucleus...\n228Tho88\n224Ra D Energy\nEnergy\n1 MD vD\n§\n1 MD\n·\n(c)\n\nM p 1\nKinetic energy of\n\"recoil\" energy\nD particle\nNdaughter Nparent2\nZdaughter Zparent2\nAdaughter Aparent4\n\nAlpha dec\nay of r\nadium.\nFigure by MIT OCW.\n\n(3)\n'14 C\n1000 § (c)\ne date 1950 f m 1 · 1\n\nGraph of f\normation a\nnd deca\ny of 14C.\nFigure by MIT OCW.\n\nRadi\nocar\nbon c\nontent of atmosphere over\ntime.\nTree ring calibration curve\n(top)\n, de\ntail of tree-ring cal\nibration curve (bott\nom).\nFigure by MIT OCW.\nFigure by MIT OCW.\n\nAtmo\nspher\nic c\narbon\nl\nevels\nat d\niff\nering\nocean\nlaye\nrs ove\nr the\npast\n12,0\n00 ye\nar\ns.\nFigure by MIT OCW.\n\nFigure by MIT OCW.\nRadiocarbon depl\netio\nn in\natmo\nsphe\nre d\nue t\no nu\nclea\nr te\nstin\ng.\nFigure by MIT OCW.\nGraph showing suess effect.\n\nU d\neca\ny s\neri\nes.\nFigure by MIT OCW.\n\nParent, N1\nDaughter, N2\n\nDeca\ny fr\nom\npar\nent\nto\nda\nug\nht\ner\nm\nol\nec\nul\ne.\nFigure by MIT OCW.\n\nDecay series for various radioactive elements.\nFigure by MIT OCW.\n\nConcentration of lo nger live\nd 238\nU deca\ny srie\ns in\nseawater.\nFigure by MIT OCW.\n\nTy\npi\nca\nl\npro\nfil\ne of\nTh i\nn the uppe\nr open ocean.\n\nRelat\nive\nconc\nentr\natio\nns\nof\nTH a\nnd U\nin\nthe\nsurf\nac\ne\no\ncean.\n\n230 Th conc\nentrations i\nn deep\nocean.\n\nSedimentary thorium profiles.\n\nProfiles of excess Pb-21\n0 and C-14\nag\ne\nat\ndept\nh\ni\nn\nt\nh\ne B\nrans\nfi\nel\nd S\ntrait.\nFigure by MIT OCW."
    },
    {
      "category": "Lecture Notes",
      "title": "lec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/e597f26987cfe640ab81e91e47de253a_lec4.pdf",
      "content": "12.742 - Marine Chemistry\nFall 2004\nLecture 4 - Atmospheric Structure, Circulation and Radiation\nProf. Scott Doney\nWallace and Hobbs. Atmospheric Science. Academic Press, 1977.\n- Atmospheric pressure and density decrease approximately exponentially with height up to\n100 km\n∼\nLine a r relation ship between p o n lo\ng s cale a nd z.\nFigure 1.\nS\nch\nem\nat\nic\nof\nla\nyer\ns o\nf t\nhe\natmosp\nhere.\nFigure 2.\n- Troposphere (all the weather, clouds, pre-\ncipitation), scavenging, aerosols\n- Strong change in atmospheric composition\nacross tropopause (very low water vapor,\nhigh ozone, etc.), reduced vertical mixing\nin stratosphere and between stratosphere\nand troposphere and no rainout of material\n(trap nuclear fallout and volcanic aerosols\nout for years), region of ozone heating.\n- Mesosphere - region of mixing\n- Planetary motions - broadest, scale of continents and oceans\n- Synoptic scale - waves and eddies - O(103 -104) km\n- Mesoscale - smaller, 10's to a few 100's of km (e.g. squall lines)\n- Mostly horizontal winds (through with convection)\n\n- Geostrophic relation - winds blow parallel\nto isobars\n- Prevailing winds at mid to high latitudes\nfrom west\nPrev\nail\ning winds at mid to high latitudes from west.\nFigure 3.\n- Pressure, coriolis, friction\n- Atmospheric winds reflect balance of pressure gradients (due to differential warming/cooling),\nthe Coriolis force (effective force due to Earth's rotation), and surface friction. Coriolis\nforce turns winds in Northern Hemisphere to the right (opposite in Southern Hemisphere)\n- 500 mb height fields - ridges on west coast; troughs on east coast low in poles, high in\ntropics\n- Surface highs and lows set up following circulation-\n· high - clockwise in N hemisphere\n· lows - Icelandic/Aleutian lows - storm tracks\n- Monsoons - seasonal variation associated with land warming low pressure in summer\n- Tropical winds\n- Easterly flow/trades; easterly waves and tropical cyclones\n- ITCZ; intertropical convergence zone upward motion\n- Some simple dynamics\n- Hydrostatics\n-dp = gρdz\ndp =\ndz\n-gρ\n- Radiative transfer\n· Sun E (irradiance) ∼6.34 × 107 W/m2 at sun's surface, and 1.38 × 103 W/m2 at\nEarth's radius\n· Blackbody radiation - maximum absorbance and emission; isotropic\n· Planck's Law\nEλ\n∗≈c1λ-5e-c2/λT\n(where T is absolute)\nThis gives irradiance as a function of wavelength, with\nc1 = 3.74 × 10-16 W m2, c2 = 1.44 × 10-2 m K\n\nEnergy b\nal\na\nn\nce figure.\nE∗= σT 4 - Stefan - Boltzmann Law (constant) σ = 5.67 × 10-8 W m-2 K-4\nEnergy balance figure - solar; longwave, latent, sensible, scattering\nPhysics of Climate. J. P. Peixoto and A. H. Oort. American Institute of Physics, 1992, 520\npp.\n- Mean state of the atmosphere\n- Small vertical/horizontal ratio\n- Flow primarily horizontal and geostrophic (pressure balanced by Coriolis), flow parallel\nto isobars\n- Friction lends to ageostrophic flow (out of high pressure zone →low pressure zone)\nVertical velocity: upward velocities near ITCZ downwelling in subtropics\n- Stronger winter hemisphere Hadley (tropical) and Ferrel (mid-latitude) circulation cells.\n- Hadley cell is north-south circulation consisting of upwelling at ITCZ and downwelling\nin subtropics; return flow at surface turned by circulation setting up easterly trades.\n- Ferrel cells - compensating for large plantary waves - Ferrel cells artifact of averaging as\nrotation increases, go from single cell to multiple cells (e.g. Jupiter)\nMuch of the transport is eddy driven\nSalinity difference between ocean basins; Atlantic is saltier than Pacific; must be maintained\nby net transport of water vapor out of Atlantic catchment basin (ocean and surrounding land\nmass draining into Atlantic).\nA. Gill. 1982 Atmosphere-Ocean Dyanmics.\nRadius of Earth R ∼6371 km\nS = 1368 W m-2, 0.2 -4 μm solar radiation band\nπR2S - total energy received from the sun\nSurface area is 4πR2 ⇒average energy is 1S\n= 344 W m-2\nAlbedo α ∼0.3 is reflected back to space (clouds, surface brightness), 1\nα\n4(1 -\n)S = 240 W\nm-\n\nocean albedo lower (0.15 -0.3), snow much higher\nE = σT 4, σ = 5.7 × 10-8 W m-2 K-4"
    },
    {
      "category": "Lecture Notes",
      "title": "lec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/ee26cf87dac404b0afb7ddd1a332bedf_lec5.pdf",
      "content": "12.742 - Marine Chemistry\nFall 2004\nLecture 5 - Marine Chemistry\nProf. Scott Doney\n- Overview\n- Finish atmosphere (circulation, net fresh water)\n- Ocean equation of state\n- T, S, or ρ distributions\n- Wind-driven circulation\n- Deep-water thermocline\n- Atmosphere\n- Circulation on a rotating planet - Northern Hemisphere\n· Rotation turns flow in the Northern hemisphere to the right (Coriolis force); rotation\nturns flow in the southern hemisphere to the left.\n· Rotation effects are strongest at the poles and diminish towards the equator.\nA\nn\nti-cyclonic a\nn\nd cyclonic rotation.\nFigure 1.\nFigure 2.\n- Large imbalances in net heating/cooling drive\nFlow is\nparalle\nl to isobars.\n\nF\nerre\nl an\nd\n\nH\nadl\ney\nflo\nw diagrams\n.\nFigure 3.\nflow\n- In atmosphere, convention is to report direction as where the fluid is coming from (e.g.\n\"north wind\"); in ocean convention is to report direction as where the fluid is moving\n(e.g. \"eastward current\")\nNet P-E graph.\nFigure 4.\n- Ocean density equation of state\n- Ocean physics driven by wind stress, buoyancy (density) fluxes, rotation\n- ρ(T, S, P) - empirically based\n- Freshwater ∼1000 kg/m3\n- Seawater roughly 1022 -1028 kg/m3 at surface\n- Density anomaly:\nσ(T, S, P) = ρ(T, S, P) -1000\n- Potential temperature (θ)\nθ(T, S, P) ⇒θ(T, S, 0) for adiabatic path\n- Compressibility\nSalinity = 35\nT = 2*C\nρ = 1027.972\nPressure = 0 bar\nSalinity = 35\nT = 2*C\nρ = 1050.284\nPressure = 400 bar\n\nGraph of\n\nT\n\nvs. S.\nFigure 5.\nTemperat\nu\nre\na\nn\nd\nS\nal\nin\ni\nty distributions.\nFigure 6.\n- Temperature and Salinity distributions\n- SST map - upwelling regions\n- Temperature with depth\n· Main thermocline, seasonal thermocline, gyres, low versus high latitude\n\nTemperature and\nSa\nlini\nty distributio\nns.\nFigure 7.\n· T - S diagrams\n· 2 and 3 end-member mixing\nG\nr\naph\nof T\nvs. S.\nFigure 8.\nOcean well stratified.\nWeak diapycnal diffusion in ocean in-\nterior (away from surface and bottom\nboundary layers).\nDiffusivity order 10-5 m2/s.\nSome intensification over rough topog-\nraphy due to tidal generated internal\nwaves.\n\n- Wind-driven circulation\nMost ocean currents are geostrophic where pressure balances the Coriolis force and the flow\nis perpendicular to the pressure gradient (along constant pressure lines)\n- Ekman spiral\nEkman spiral.\nFigure 9.\n- Ekman pumping\nEkman pumpi\nng.\nFigure 10.\n- Subtropical and subpolar gyres\nSubtropical\n-\ndownwelling\nand\nanti-cyclonic\nwest(?)\nintensified\nS\nu\nbtropica\nl and subp\nolar gyres\n.\nFigure 11.\n- ACC - circumpolar\nMuch of ocean circulation is dominated by mesoscale eddies 10 -200 km - Don't believe\nsimple \"cartoons\" of circulation\n- Schmitz diagram\nUpwelling/downwelling combination of wind stress and rotation\n\n· Divergence of flow\n· Cool equatorial waters\nDiagram of\nequatori\nal upw\nelling.\nFigure 12.\nDiagr\nam o\nf coastal upwelling - land/ocean boundary.\nFigure 13.\n\n- Deep water formation\n- Occurs in North Atlantic and Southern Ocean but not North Pacific (because of low\nsurface salinities) (Surface salinity map)Diagram of deep water formation.\nFigure 14.\nNorth Atlantic Salinity/Temperature map\nSize of water transports\nMesoscale eddies\nSv is a Sverdrup, a unit of volume transport\n1 Sv = 1 × 106 m3/s\n50 -100 km's geostrophic balance\nAmazon ∼0.2 Sv\nGulf Stream ∼100 Sv\nIsopycnal mixing O(1000 m2/s)\nAcc ∼120 -140 Sv\n(but only if on scale bigger than mesoscale edd\nDyapycnal mixing O(10-5 -10-4 m2/s)\n- Gyre circulation\n· Western intensification of flow; amplification of flow w/lots of recirculation\nies)\n\nCh\nart of subtropical gyre.\nFigure 15.\n- Chemical measyres of ocean ventilation rates\n· Transient tracers\n· Natural radiocarbon 14C decays with ∼5000 year half-life.\n1000 years is good\nfor deep/bottom waters, which have ages of a few hundred to 1000 years; decay\ncounting; accelerator mass spectrometry (AMS)\n· CFCs - chlorofluorocarbons (freons) - can measure at very low levels CFC-12, CFC-\n11, CFC-112,CCl4 using gas chromatography (for fluorinated compounds use elec-\ntron capture detector)\ndecadal time-scale\nGrap\nh of\nCFC concentration increase since 1930.\nFigure 16.\n· tritium - 3He\nAtmospheric weapons testing produced 3H - most injected in stratosphere\nuse 3H as \"dye-tracer\"\nalso 3H -3 He age: 3H →3 He with ∼12 year half-life\nFor closed system -\n3H =3 H(t0)e-λt\nexcess 3He = 0 +3 H(t0)e-λt\n\nTrit\nium concentrations in the 1900's.\nFigure 17.\n3He reset to solubility at surface by gas exchange\nSum of 3H + excess 3He is a constant equal to 3H at time 0 (last exposure to\natmosphere)\n3H\n= e\n3H +3\n-λt\nHe\nlog\n!\n3H\n=\n3H +3 He\n\"\n-λt\n⇒ageτ = -\nlog\nλ\n!\nH\n3H +3 He\n\"\n- Bomb-radiocarbon\n· Also released during atmospheric weapons testing\n· Gas exchange of 14CO2 →ocean through subsequent circulation into thermocline\nand deep waters\nSome biological redistribution via particles and remineralization\n·Graph of radiocarbon.\nFigure 18.\n- Trace release experiments\n· SF6 - diapycanal diffusion experiments, eddy mixing and dispersion; gas exchange,\ndeliberate injection of \"dye\" like traces"
    },
    {
      "category": "Lecture Notes",
      "title": "lec6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/5adf86c1feb5b85ed6e2fb5581e383d1_lec6.pdf",
      "content": "12.742 - Marine Chemistry\nFall 2004\nLecture 6 - Determinants of Seawater Composition\nProf. Scott Doney\n- What is seawater?\n- Water\n- Dissolved inorganic salts (major ions)\n- Trace species, organics, colloids, particles, life, . . .\n- Water: H2O\n- A very odd molecule\nWate\nr\n\nm\no\nl\ne\ncule H O H bond angle is 105 degrees.\nFigure 1.\nSets up electric dipole because O is more elec-\ntronegative and bond angle is asymmetric\nW\na\nt\ner dipole cuts the H O H bond angle in half.\nFigure 2.\nHydrogen bond - 4.5 kcal/mol, while covalent bond is\n100 kcal/mol.\n∼\nH\ny\nd\nr\no\ng\nen bon\nd\ning oc\ncurs between two water molecules.\nFigure 3.\nHydrogen bonding has a large impact on physical properties of water, ion-pairing solvent\nsolubility; anomalous relative to similar H2S, surface tension\n\n- Flickering cluster modelFlickering cluster model.\nFigure 4.\nWater does not like to be broken up (unless\nadding ionic species)\nThis causes a high heat capacity, latent heat of\nevaporation, and latent heat of fusion\nGraph of hea\nt of fu\nsion t\no heat\n\nof v\na\nporization.\nFigure 5.\nm\n1.2\nkg\ny ·\ncal\nm3 ·\nJ\ng · .184\ng\ncal ·\n1 yr\nkg ·\nW\n3.15 · 107 s ∼\nm2\ncompared to solar heating of ∼170 W\nm2\n\n- Water as a solvent\n- Very good at dissolving ionic species and polar compounds\nNaCl ⇋Na+ + Cl-\nDia\ngra\nm of water molecules solvating\nsodium and choloride ions.\nFigure 6.\n- Water more dense than ice\n- Profound impacts for climate, life, etc.\n- Seawater versus freshwater\n- Comparison\nincrease with salinity\ndecrease with salinity\ndensity\nfreezing point\nelectrical conductivity\ntemperature of maximum density\nosmotic pressure\n- Salinity\n· Total mass of salt in water ∼35 g\nkg, that is, 35 parts per thousand (ppt), and there\nis a relatively constant composition for major ions\n- Methods of salinity measurement\n· Simply drying and weighing (±0.01 ppt )\n· Lose some species with heat (HCl)\n· Oxide formation\n· Reproducibility\n· Tedious\n\nG\nra\nph\n\ns\nh\no\nwing maximum d\nensity and freezing point.\nFigure 7.\n· Titration of Cl-(and Br-ions with AgNO3 (or electrochemical)\ng\nS = 1.806 · Cl parts per thousand\nChlorinity in\n,\nkg ±0.002\n· Conductivity (±0.001)\n· Compare against KCl standard at fixed pressure, 15*C\nsample\nK15 = KCl solution\ns = a1 -\n1/2\na2K15 +\na3K15 +\n/2\na4K15 -\n5/2\na\n5K15 + a6K15\n· in practice use \"secondary standards\" (Wormely water) Standard Sea Water\nUNESCO, 1978.\n· Practical salinity scale (PSS)\n· isotopes - empirically derived from lab work (s = f(K15), ρ, etc)\n- Major constituents in seawater, charge balance\nNa+\nCl-\nMg2+\nSO2\n-\nCa2+\nHCO3\n-\nK+\nothers\n· \"law of constant proportions\"\n· Except for comments below, major ions act essentially conservatively in ocean -\nchange due to net E-P input\n\nIon\nResidence time (in units of 106 y)\nNa+\nMg2+\nCa2+\n0.7\nCl-\nSO2\n-\nLiqui\nd fi\nlled box\ns howing inp ut an d loss.\nFigure 8.\nCompare with mixing time of the ocean ∼103 years\n- Where does this fall apart?\n· Estuaries\n· Average river composition differs\n· Much lower inventories - ∼0.2 parts per thousand\n· Increased ratios of Ca2+, Mg2+, K+, SO2\n-, HCO3\n-to Cl-, s = f(K15) and ρ\ndo not work as accurately\n· Evaporative basins\n· As salinity increases, start to deposit salts\n(Brine can also differ from seawater)\nCaCO3 (Mg)\nCaSO4 · 2H2O (gypsum)\nNaCl halite\nMgSO4, KCl, NaBr, MgCl2 bitterns (K, Mg salts)\n· Internal biological cycling of CaCO3\nCa2+ + CO2\n-⇋CaCO3 (s)\n\nGraph of ca\nlcium salinity.\nFigure 9.\nDepletion of SO2\n-in anoxic basins or sediments; microbes using SO2\n-as an\nelectron acceptor\n- Geochemical cycles - what controls the major ion composition ?\n- Two models - \"equilibrium\" (Sillen), \"kinetic\"\n- Equilibrium model says that solution chemistry of seawater in thermodynamic equilib-\nrium with atmosphere and minerals on ocean floor; has not held up well but deviations\nfrom thermodynamics equilibrium are quite interesting\nLiquid fill\ned box with river water flowing in.\ninput = CRFR\noutput =\nC0V0\nk = residence time\nk\nC0\nF\n=\nR\nCR\nV0 k\ninput > output\nC0 increases\n→\ninput < output →C0 decreases\nFigure 10.\nExamine ratio of seawater concentration/river water concentration versus residence time.\n- Major ion budgets\n- Rivers and terrestrial weathering are primary source for most major ions.\n- Loss mechanisms include:\n- Cl-\n· Cyclical salts - salt spray transported to land; makes river Cl-source look larger\nthan what is really coming from weathering.\n· Pore water trapping - burial in interstitial waters\n\nE\nvaporite production.\nFigure 11.\n· Evaporite production\n· Many of the land masses underlain by evaporite deposits\n· Not occurring to great extent right now\n· Lots of shallow seas - episodic in geological historyShallow seas trap flow of some materials.\nFigure 12.\n· On long time-scale evaporite formation must balance sources\n- Na+ - exchangeable cations on clays\nB-clay + A+ ⇋B+ + A-clay\nXA-clay\n[A+]\n= KAB\nXB-clay\n[B+]\nX: mole fraction at exchange site\nConcentration of Na+ to other cations is higher as one goes from fresh water to salty\nwater\nD\ni\na\ng\nr\na\nm of flow of freshwater to saltwater.\nFigure 13.\nFreshwater →saltwater, act\nas\nremoval\nmechanism\nfor\nNa+\n\nalso\n2B-clay + C2+ ⇋C-clay + 2B+\nXC-clay\n[C2+]\n= KBC\nXB-clay\n[B+]2\nwhich shows how the charge balance for divalent ions and concentration affect the equi-\nlibrium: 10× concentration →1\n1 →100\nAs total value of [B+] increases, it forces more B onto clay and release more C into\nsolution.\n- Was once thought that clays were heavily altered in interstitial waters/sediments form-\ning source/sinks for ions (reverse weathering).\nChart of\nsourc\ne an\nd sink of seawater.\nFigure 14.\nDoes not appear to be a major process for most elements\n- Mid-ocean ridges\n- hot 300-350*C reactions of rock with seawater - variability from vent to vent; some\ngeneralizations\n- sinks for MgSO4 (though sulfate may have source from low temperature hydrothermal\noffthe ridge axis)\n- Biogenic\nCa2+, CaCO3 sediments\nSO2\n-→H2S some lost as elemental sulfur/pyrite DMS (?), cont. (?) margin sediments\n- Complications in closing ocean budgets for major ions\n· River concentrations reflect natural levels plus pollution and human perturbations.\n· Long term imbalance because of episodic evaporites.\n- Ion-ion pairing or chemical speciation\nCaCO3(s) ⇋Ca2+ + CO2\n-\nKsp = [Ca2+][CO2\n-]\n· Conditional or apparent solubility product\n\n· Ionic strength; activities rather than concentrations\n· Affected by presence of other ions in seawater mix\nSimilar equations\nMg2+ + SO2\n-↔MgSO4 (aq)\n[MgSO\nβ =\n4]\n[Mg2+][SO2\n-]\nNa+, K+, Cl-\nmostly/all in free ion form\nMg2+, Ca2+\n90% free\nSO2\n-\n∼50% free\nCO2\n-, Ca2+\n∼10% free"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_7_crblc2006.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/e6cad12ff6a4a6bf23a646483bb6164a_lec_7_crblc2006.pdf",
      "content": "Inorganic carbon in the ocean: Basics\nIntroduction\nEquilibrium and Measurement\nBiogeochemical Processes and the CO2 system\n-- organic matter formation / destruction\n-- CaCO3 precipitation / dissolution\n\nWhy study carbonate in the ocean?\n(stating the obvious)\nLife on earth is carbon-based!\npH is a key master variable for many processes - and carbonate\nequilibria play an important role in determining ocean pH\nHCO3\n- is the 3rd most concentrated anion in the ocean\nThe marine carbon cycle is a key factor in determining the fate of\nanthropogenic CO2\n...\nAnd if the pursuit of knowledge isn't enough:\nMC&G students: I guarantee you'll have a carbonate question\non your general exam!\n\nCarbon cycling in the ocean\n(an overview)\nLand\nAtmosphere\nOcean\nCO2\nCO2 + H2O ⇔H2CO3\nH2CO3\n* ⇔H+ + HCO3\n-\nHCO3\n-⇔H+ + CO3\n2-\nCO2 ⇒Corg\nCa2+ + CO3\n2-⇒CaCO3(s)\nCorg ⇒CO2\nCaCO3(s) ⇒Ca2+ + CO3\n2-\nCorg ⇒CO2\nCaCO3(s) ⇒Ca2+ + CO3\n2-\nsediments\nHCO3\n-\n\nEarth surface carbon cycle - Time Scales\nIncreasing...\nSurface ocean\n~ atmosphere\nDeep ocean :\nlarge reservoir!\nLargest reservoir:\nlong time scales\nSundquist, 1993\nCarbon tur\nnover tim\nes for earth'\ns various res\ne\nre\nvoi\nrs.\nFigure by MIT OCW.\n\nDissolved Carbonate Equilibria\nΣCO2 = H2CO3\n*\n[\n]+ HCO3\n-\n[\n]+ CO3\n2-\n[\n]\nK1 =\nH +\n[ ]HCO3\n-\n[\n]\nH2CO3\n*\n[\n]\nK2 =\nH+\n[ ]CO3\n2-\n[\n]\nHCO3\n-\n[\n]\nK1, K2 known...\n-- 3 equations, 5 unknowns...\nSpecify (or measure) 2 things - ∑CO2, pH ... to get :\n\n2.0x10\n-3\n1.5\n1.0\n0.5\n0.0\nConcentration (moles/kg)\npH = - log(H\n+)\nHCO3\n-\nCO3\n2-\nH2CO3*\nSeawater\npH\n\n-8\n-7\n-6\n-5\n-4\n-3\n-2\nConcentration (moles/kg)\npH = - log(H\n+)\nHCO3\n-\nCO3\n2-\nH2CO3*\nSeawater\npH\nK1 =\nH +\n[ ]HCO3\n-\n[\n]\nH2CO3\n*\n[\n]\n---->\nlog K1\n{\n}= log H +\n{ }+ log\nHCO3\n-\n[\n]\nH2CO3\n*\n[\n]\n⎧\n⎨ ⎪\n⎩ ⎪\n⎫\n⎬ ⎪\n⎭ ⎪\nSpeciation as ƒ(pH) on log-log plot:\nA \"Bjerrum\" Plot\n\nAre ∑CO2 and pH an ideal pair to measure?\nSometimes, but note:\nWater mass A\npHA\n∑CO2A\nWater mass B\npHB\n∑CO2B\n50 : 50 mix of A and B\n∑CO2(mix)=0.5*∑CO2(A) + 0.5*∑CO2(B)\n** Not true for pH !! **\n\nHow about a quantity that is related to the major ion\ncomposition?\nThe charge balance in seawater:\nAn apparent excess of positive charge of ~ 2.2 mmol / kg\nWhat are the missing anions?\nThe cha\nrge\nb\nalan\nce i\nn se\nawat\ner f\nor N\na, M\ng, Ca\n, K,\nand\nSr.\nFigure by MIT OCW.\n\nThe Alkalinity\nThe missing anions: HCO3\n-, CO3\n2-, B(OH)4\n-\nThe conjugate bases of the weak acids,\nH2CO3 and B(OH)3\nHA ⇒H+ + A-\nacid\nconjugate\nbase\nAlkalinity (mol/kg) = the amount of strong acid that must be added to a\n1 kg (sea)water sample to make its pH equal to that of the second\nequivalence point of the dissolved CO2 system, pH = 4.3\n\nTotal Alkalinity:\nseawater, pH = 8\n\"Practical Alkalinity\":\n\nPA = HCO3\n-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + 2 CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + B OH\n( )4\n-\n⎡\n⎣\n⎢\n⎤\n⎦\n⎥ + OH-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ -H+\n⎡\n⎣ ⎢\n⎤\n⎦⎥\nCont\nribu\ntion\nof\ndif\nfer\ne\nnt ions to Practical Alkalinit\ny.\nFigure by MIT OCW.\n\nWhat does the definition mean?\n-14\n\n-12\n\n-10\n\n-8\n\n-6\n\n-4\n\nConcentration (mol/kg)\npH\nH2CO3\nHCO3\n-\nCO3\n2-\nB(OH)3\nB(OH)4\n-\nBjerrum Plot\nfor seawater\npH = 8\n\nThe titration of seawater with a strong acid (HCl)\npH\n1.0\n0.8\n0.6\n0.4\n0.2\n0.0\nVa (ml HCl added)\nA titration of seawater\nwith HCl\nStart\n\npH\n0.8\n0.6\n0.4\n0.2\n0.0\nVa (ml HCl added)\npH\ndpH / dVa\ntitration endpoint at\ninflection of pH vs Va\ncurve\n\n-14\n\n-12\n\n-10\n\n-8\n\n-6\n\n-4\n\nConcentration (mol/kg)\npH\nH2CO3\nHCO3\n-\nCO3\n2-\nB(OH)3\nB(OH)4\n-\nBjerrum Plot\nfor seawater\n-12\n\n-10\n\n-8\n\n-6\n\n-4\n\n-2\nConcentration (mol/l)\npH\n2*[CO3\n2-] + [HCO3\n-] + [B(OH)4\n-] + [OH\n-]\nH+\nThe H\n+ at which\nalkalinity --> 0\nAt the titration endpoint,\nH +\n[ ]= 2 CO3\n2-\n[\n]+ HCO3\n-\n[\n]+ B OH\n(\n)4\n-\n[\n]+ OH-\n[\n]\nThat is, the endpoint\nIs the point at which\nAlk = 0\nSo: the moles of acid\nadded to reach the\nendpoint = Alk\nConcentrations during the titration:\n\nTA = HCO3\n-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + 2 CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + B OH\n( )4\n-\n⎡\n⎣\n⎢\n⎤\n⎦\n⎥ + OH-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ -H+\n⎡\n⎣ ⎢\n⎤\n⎦⎥\n\nAlkalinity: A precise definition\nDickson, 1981 ; 19994\n\"The total alkalinity of a natural water is thus defined as the number of moles of hydrogen ion\nequivalent to the excess of proton acceptors (bases formed from weak acids with a\ndissociation constant K <= 10-4.5 at 25°C and zero ionic strength) over proton donors (acids\nwith K > 10-4.5) in one kilogram of sample.\"\nRemember:\n(1) predominant species\nat pH = 4.5 does not contribute\nto Alkalinity\n(2) How do you estimate pK for\nan acid from this diagram?\nPr\nedom\nin\nan\nce\no\nf\nva\nri\nou\ns\nspec\nies\nwith\nvar\nying\npH.\nFigure by MIT OCW.\n\nAlkalinity\nSo we have:\nCarbonate Alkalinity: CA = [HCO3\n-] + 2[CO3\n2-]\n\"Water Alkalinity\" = [OH-] - [H+]\n\"Borate Alkalinity\" = [B(OH)4\n-]\nFor most applications, can use:\nAlk = [HCO3\n-] + 2[CO3\n2-] + [OH-] - [H+] + [B(OH)4\n-]\nBut in some applications, you need to add minor contributors, such as\nNH3, PO4\n3-, HPO4\n2-, H3SiO4\n-, HS- , ...\n-Remember, when you titrate a seawater sample to the 2nd CO2 endpoint,\nThe result is \"Titration Alkalinity\", which includes all conjugate bases of weak\nAcids in the sample. The approximation in the Alk expression above is the\nNeglect of the contribution of minor constituents to the result.\n\nMeasurements: Summary\n∑CO2\n(i)\nTitration + curve fitting\n(ii) Acidify ; strip CO2 ;\nMeasure CO2 by gas chromatography,\nCoulometry, IR analyzer\nCalibration: reference seawater (Dickson)\n± 2 μmol/kg\nAlkalinity\n(i)\nTitration + curve fitting\n(ii) Gran titration\nCalibration: reference seawater (Dickson)\n± 2 μmol/kg\npH\n(i)\nElectrochemical measurement\n(ii) pH-sensitive dyes\nCalibration: buffers for seawater\n±0.002 pH units\n\nThe \"more-than-I-ever-wanted-to-know\" section :\npH scales\n(1)\nLaboratory chemistry: the NBS pH scale\npH = -logaH +\n** Defined relative to low-ionic strength buffers --\nabandoned for measurements in seawater\n(2) Seawater: An analysis of \"[H+]\" in seawater yields\n[H+]free + [HSO4\n-] + [HF]\n[HF] is small; in order to determine [H+]free, need to know\nK for HSO4\n- dissociation WELL.\n\"They\" have decided it is better to define a new pH scale:\nThe \"Total pH scale\" :\nHT\n+ = H +\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ free\n+ HSO4-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nOr the \"seawater pH scale\" :\nHT\n+ = H +\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ free\n+ HSO4-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + HF\n[\n]\n\npH scales, cont.\nSo that:\n(1) pH measurements are reported on the pHT scale\n(2) equilibrium constants are reported on the pHT scale\nCan convert between the scales with KHSO4 and KHF\n**The difference between pHsws and pHT is ~ 0.01 unit ~ 2% at pH 8\nThe difference between pHNBS and pHT is ~ 0.1 unit ~ 20% at pH 8\nThe precision of good pH measurements is ~ 0.002 pH units\n\nOn equilibrium constants\nfor calculations in seawater\nConsider the reaction:\nHCO3-⇔H + +CO3\n2-\nIn an \" ideal\" solution:\nK =\nH +\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nHCO3-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nIn an \"ideal\" solution, all\nconcentrations --> 0, so there are no\nion-ion or ion-solvent interactions.\nIn a real solution, these interactions are important, so...\n\nOn equilibrium constants\nfor calculations in seawater\nConsider the reaction:\nHCO3-⇔H + +CO3\n2-\nIn an \" ideal\" solution:\nK =\nH +\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nHCO3-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nIn an \"ideal\" solution, all\nconcentrations --> 0, so there are no\nion-ion or ion-solvent interactions.\nIn a real solution:\nK =\nγH +γCO3\n2-H +\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nγHCO3\n-HCO3\n-\n[\n]\nThe γ are \"activity coefficients\",\nand are generally <1 for\nions in solution because of\nelectrostatic interactions between\nions and between and ions and\nsolvent .\nIn addition, some ions (esp. CO3\n2-\n) form complexes with other ions\nin seawater.\n\nEquilibrium constants for calculations in seawater\nFor a solution with the ionic strength of seawater (I = ∑ci zi\n2 ~ 0.7), it is difficult to\ncalculate the γ values.\nTherefore:\n\"Constant ionic medium\" equilibrium constants are used. They are:\n-- measured in solutions with the same proportions of major ions as\nseawater\n-- measured as functions of T and S\n-- pressure dependence is calculated from thermodynamic data\nSo:\nK'=\nH +\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nCO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nHCO3-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ T\nThe \"T\" denote \"total\" concentrations, including\ncomplexes...\nAnd remember, for H+, the \"T\" denotes the \"total\"\npH scale.\nThese \"seawater\" constants are\navailable from the literature as ƒ(T,S,P)\n\nWorking with the carbonate system in seawater\n\nΣCO2 = H2CO3\n*\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + HCO3\n-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nAlk = HCO3\n-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + 2 CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ + B OH\n( )4\n-\n⎡\n⎣\n⎢\n⎤\n⎦\n⎥ + OH-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ -H+\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ ± minor components\nTB = B OH\n( )3\n[\n]+ B OH\n( )4\n-\n⎡\n⎣\n⎢\n⎤\n⎦\n⎥ = cons tant × Salinity\n\nK1 =\nH+\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ HCO3\n-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nH2CO3\n*\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n\nK2 =\nH+\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ CO3\n2-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nHCO3\n-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\n\nKB =\nH+\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ B OH\n( )4\n-\n⎡\n⎣\n⎢\n⎤\n⎦\n⎥\nB OH\n( )3\n[\n]\nKW = H+\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ OH-\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥\nMeasure ∑CO2, Alk, S ==>7 equations in 7 unknowns\n==> you can solve for speciation!\n\nUseful approximations for back-of-the-envelope\ncalculations\nAt seawater pH,\n∑CO2 ~ [HCO3\n-] + [CO3\n2-]\nAlk ~ [HCO3\n-] + 2 [CO3\n2-]\nAnd\n[CO3\n2-] ~ Alk - ∑CO2\n-14\n\n-12\n\n-10\n\n-8\n\n-6\n\n-4\n\nConcentration (mol/kg)\npH\nH2CO3\nHCO3\n-\nCO3\n2-\nB(OH)3\nB(OH)4\n-\nBjerrum Plot\nfor seawater\npH = 8\n\nThe effect of biogeochemical processes on ∑CO2 and Alk\n(1)\nThe incorporation of CO2 into organic matter (I.e., production of o.m.)\nCO2 --> \"Corg\" + O2\n∆∑CO2 = -1\n∆Alk = 0\n... and a small (usually negligible) increase in Alk due to NO3\n- assimilation, ∆Alk = (16/106))* mol Corg formed\n(2)\nThe precipitation of CaCO3\nCa2+ + CO3\n2- --> CaCO3\n∆∑CO2 = -1\n∆Alk = -2\nHow do these processes affect the ability of the ocean to take up CO2 from the atmosphere?\nTaking into account Henry's law relating [CO2] in the water to the PCO2 in equilibrium with\nthe water,\nCO2\n[\n]= KH PCO2\nSystem approaches equilibrium after\nPerturbation: lower ocean [CO2] -->\nocean absorbs CO2\n\nContours of [CO2] vs. Alk and ∑CO2\nTotal Alkalinity\nTCO2\nform Corg\nform CaCO3\no.m. formation:\ndecrease [CO2]\nCaCO3 pptn:\nincrease [CO2]\n\nBiogeochemical processes and the carbonate system\nHow do decomposition and dissolution processes affect the carbonate system?\n(3) Organic matter dissolution... reverses (1),\nCorg + O2 --> CO2 + ...\n∆∑CO2 = +1\n∆Alk = 0\n(and, as before, there's a small drop in Alk due to NH3 oxidation to NO3\n-)\n(4) CaCO3 dissolution... reverses (2),\nCaCO3 --> Ca2+ + CO3\n2-\n∆∑CO2 = +1\n∆Alk = + 2\nHow do these processes affect the [CO3\n2-] of seawater as it \"ages\" during its transit through the\ndeep sea?\n\nContours of [CO3\n2-]\nTotal Alkalinity\nTCO2\nContours of [CO3\n2-]\nDissolve CaCO3\noxidize Corg\nOxidize o.m.:\ndecrease [CO3\n2-]\nDissolve CaCO3:\nincrease [CO3\n2-]\nQuestion: what can you use this contour plot for if you have actual data?\n\nP\nr\no\nf\ni\nl\ne\ns\nof total\nAlkalinity, CO2, and CO3 at depth in th\ne N\nort\nh A\ntla\nnti\nc a\nnd North Pacific\n.\nFigure by MIT OCW.\n\nUsing data and theory to calculate relative rates\nof organic matter oxidation and carbonate dissolution\nsee Broecker and Peng, Tracers in the Sea\nTotal Alkalinity\nplotted against CO2\nin different\noceans' sur\nface and bot\ntom waters.\nFigure by MIT OCW.\n\nAnd...\nWe've shown how biogeochemical processes affect ∑CO2 and Alk in\nthe ocean...\nWe've started to show how distributions of ∑CO2 and Alk can be used\nTo learn about biogeochemical processes...\nWe've not discussed the biological and chemical processes that control\nformation and decomposition of organic matter\nformation and dissolution of CaCO3\nThose discussions will follow..."
    },
    {
      "category": "Lecture Notes",
      "title": "lec_9_redngs_hyd.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/b3ab2a7d63f281cb878a1171faa23864_lec_9_redngs_hyd.pdf",
      "content": "Seafloor Hydrothermal Systems\n\nI. Introduction\n\nThe mid-ocean ridge system is the largest continuous feature on the surface of the earth.\nIt extends the length of the Atlantic and Indian Oceans and continues through the southern and\nnortheastern Pacific (Figure 1). It has been the object of extensive study in recent years as the\nmajor surface connection with the Earth's mantle. It is the location where new oceanic crust,\nwhich is both the material for seafloor spreading and an important source of heat to the Earth's\nsurface, is formed.\n\nAt mid-ocean ridges, new crust forms and cracks as it cools and as it spreads away from\nthe ridge crest. Cold seawater penetrates the warm crust. The sub-seafloor heat source (either\nmagma or newly solidified hot rock) exchanges heat with the fluid, resulting in a plume of\nbuoyant fluid that rises rapidly, to be discharged at the sea floor through hydrothermal vents. This\nfluid is replaced by seawater \"recharge\", creating a circulation cell. The recharge seawater reacts\nwith crustal rocks as it travels towards the heat source. The reaction of seawater with basaltic\nrocks at elevated temperatures results in a fluid with a changed composition. Hydrothermal\ncirculation therefore leads to net fluxes of chemicals into and out of the ocean (Figure 2).\n\nOur study of the importance of seafloor hydrothermal processes to ocean chemistry will\nproceed with:\n- An examination of seafloor hydrothermal activity as a source of heat to Earth's surface.\nPatterns of the Earth's heat flow are used to estimate the location and temperature of fluid\nconvection and seawater-rock interactions. As will be explained, there are important\ndifferences between the reactions occurring at low and high temperatures.\n- Description of the reactions occurring at and near mid-ocean ridges between seawater and\nbasalt as the seawater is warmed, as well as those occurring in the hydrothermal fluid as it\ninteracts with seawater as it exits the sea floor.\n- Estimation of hydrothermal fluxes resulting from reactions near the axis of the mid-ocean\nridge system, using measured compositions of hydrothermal fluids; and estimation of\nfluxes resulting from low-temperature reactions occurring off the ridge axis.\n- Description of the composition of hydrothermal fluids present at vent sites, their\nsignificance to ocean chemistry, and their influence on chemical, physical, and biological\nprocesses occurring in the water column in the vicinity of vent sites.\n\nP\nl\na\nte marg\nin inte\nractions.\n(from Stein et al., 1995)\nFigure by MIT OCW.\nFigure by MIT OCW.\nMap of world showing l\nocation of mid ocean ri\ndges.\n\nFigure of hydrothermal vent processes.\nFigure 2 (from Tivey, 2004, Oceanus 42, no. 2, 60-65)\n\nCourtesy of Tivey Meg. Used with permission.\n\nII. The heat flux from the mantle\n\nII.1 Geophysical models and measurements\n\nFreshly formed oceanic crust and the underlying lithosphere are hot. Over time, the new\ncrust moves away from the mid-oceanic ridge as more new crust is formed; as the crust and\nlithosphere move away, they cool and contract. Theoretical models can be constructed to predict\nthis heat loss and contraction, assuming that all cooling occurs by upward heat transfer solely by\nconduction in the rock. These model predictions of heat loss solely by conduction can then be\ncompared to actual measurements of the conductive heat flux, with discrepancies the result of\nfluid circulation, or heat loss from convection.\n\nBefore discussing the results of these comparisons, we will take a quick look at the two\nways in which heat is transferred from crust to seawater. One transport mechanism is conduction.\nThink of a solid body in which two points, P1 and P2, are maintained at different temperatures.\n\nTemperat\nure\nDistance\nP1\nP2\nx1\nx2\nA solid body\n\nIn this situation, there will be a flow of heat from the warmer to the cooler point that is\nproportional to the temperature gradient between the two:\n\nHeat Flux ≅- K T P2 - T P1\nx 2 - x 1\n\nwith K being the \"thermal conductivity\" in W m-1 K-1, a property of the solid. The transport of\nheat is accomplished without large scale motion within the body. The second important means of\nheat loss from the crust is convection. Convective heat transport is accomplished by the relative\nmotion of portions of the heated body. In the case of the oceanic crust, convective heat loss\noccurs when water circulates through the crust, gaining heat from the surrounding rock as it\ncirculates.\n\nPredictions of heat loss from the crust based on theoretical cooling models give the total\nheat loss. Measurements of heat loss (from heat flow probe measurements) yield the amount of\nheat transported by conduction. Comparisons of model predictions and measurements show\ndifferences, called the \"heat flow anomaly\", that vary systematically with crustal age. The data in\nFigure 3 show that, on average, the predicted heat loss is significantly greater than measured heat\nloss in young crust; that there is considerable variability in the measured heat flux; and that, in\nold crust (with age exceeding about 65 million years - see figure 3A), the predicted and measured\nheat fluxes are about the same. It is concluded that, in young crust, convective transport by\nhydrothermal circulation accounts for the difference between predicted and measured values.\n\nFigure 3A. Estimation of hydrothermal heat flux from heat\nflow data. Left: The heat flow discrepancy, the difference\nbetween the heat flow predicted by a lithospheric cooling\nmodel and the lower values observed (shaded) is assumed to\nindicate the heat transported by water flux. The water flux is\nthought of as divided approximately into high temperature\nnear-ridge flow and low-temperature off-ridge flow. Beyond\na \"sealing age,\" defined as that where the observed and\npredicted heat flow approximately coincide, hydrothermal\nheat transfer is presumed to have largely ceased. Right:\nObserved heat flow versus age for the global data set and\npredictions of the GDH1 (Global Depth and Heat flow)\nthermal model. Data means and standard deviations are\nshown for 2-Myr bins. The sealing age estimated by a\nleast squares fit to the heat flow fractions for ages <50 Myr\n(closed circles) is 65 ± 10 Myr (from Stein et al., 1995).\n\nGraph of h\neat flow\ndiscrepancy d\nue to hy\ndro\nthe\nrma\nl f\nlux\n.\nFigure by MIT OCW.\nGr\nap\nh\ns\nh\now\ning\ncu\nmul\na\nt\niv\ne\nhe\nat loss f\nor oceani\nc atmo\nsp\nhe\nr\ne.\nFigure by MIT OCW.\n\nThe total oceanic heat flux predicted by geophysical models is about 32x1012 W, or 240x1018\ncal/yr. The hydrothermal heat flux, obtained by adding up the heat flow anomaly over the age of\nthe crust, is 11x1012 W (80x1018 cal/yr), or about 34% of the total. As will be seen later, it is\nimportant to note that a fraction of this convective heat flux occurs in very young crust, that is, at\nthe mid-ocean ridge axis (~3.2 x1012W (24x1018 cal/yr), or ~29% of the total), and ~70% \"off-\naxis\" in crust >1 Myr (Fig. 3).\n\nII.2 Crystallization and cooling of magma at ridge crests\n\nThe new crust formed in the mid-ocean ridge system is formed by the cooling of magma.\nThe cooling process involves both crystallization of crustal rocks and subsequent cooling. The\namount of heat that must be lost from the crust can be estimated by calculating the heat transfered\nduring these processes.\n\nThe rate of formation of new crust is approximated as the product of the crustal formation\nrate (3 km2 / yr), crustal thickness (5 km), and its density (2.8 g/cm3): 4.2x1016 g/yr. If we\nassume a latent heat of crystallization of magma of 161.5 cal/g, then the heat released is 6.8x1018\ncal/yr. The magma crystallizes at about 1200°C. Cooling from this temperature to the typical\nhydrothermal reaction temperature of 350°C releases about 270 cal/g, or a total of about 11x1018\ncal/yr. Subsequent cooling to seafloor temperature would release an additional 4.6x1018 cal/yr\n(110 cal/g). The maximum available heat would be the sum of heat released by these 3 steps,\n23x1018 cal/yr. It has been suggested that a reasonable range of values for heat transported by\nconvection at the ridge axis is that released by crystallization alone or by the sum of\ncrystallization and cooling to 350°C (Mottl and Wheat, 1994): 6.8 to 18x1018 cal/yr. This\nestimate is consistent with the estimate from geophysical considerations.\n\nII.3 The flux of helium from the mantle.\n\nThere are two isotopes of helium: 3He, formed at the birth of the solar system, is released\nsteadily from the earth's mantle; and 4He. The 4He nucleus is the α particle that is released during\nα decay, and it is formed in both the crust and mantle at rates determined by the concentrations of\nuranium and thorium. The isotopes of helium have been measured in the fluids released from\nhydrothermal vents, and the ratio of 3He to 4He confirms that the helium in the fluids has a\nmantle source (Figure 5a). It is known that 3He is supplied to the earth's surface from the mantle\nat a rate of about 6.5x1026 atoms/yr. From this fact and the ratio of heat to 3He in hydrothermal\nemanations, the hydrothermal heat flux can be estimated:\n\nHe-3 supply rate ×\nheat\nHe-3\n= axial hydrothermal heat flux\n\nThe heat : 3He ratio can be estimated from measurements of 3He and temperature in\nhydrothermal fluids (Figure 5b); the heat flux calculated from such measurements, carried out at\nvents near the Galapagos (Jenkins et al. 1978), was 49x1018 cal/yr, much larger than the two\nestimates shown above.\n\nFigure 5A from Jenkins et al., 1978. Figure 5B from Jenkins et al., 1978.\n\nSubsequent measurements at more hydrothermal vent sites showed that the heat : 3He\nratio varied by about a factor of 10 between sites, so that an estimate of the global heat flux from\nmeasurements at a single site is highly uncertain. Lupton et al. (1989) offered a different type of\ncalculation using helium isotopes. They assumed that all the 4He in the mantle originated from U\nand Th decay, and that heat and He are removed from the mantle together. They then used\nestimates of the U and Th contents of the mantle, along with the decay constant, to calculate that\n0.16x10-6 cm3(STP) of 4He are produced per calorie of heat. Using an estimated 3He / 4He ratio\nof 1.1x10-5 in the upper mantle, they calculated:\n\n3He\nheat\n⎡\n⎣ ⎢\n⎤\n⎦ ⎥ upper\nmantle\n= 2 ×10\n-12 cm3 STP\n(\n)3He\ncalorie\n= 5.3 ×10\n7 atoms3He\ncalorie\n7 Graph showing correllation between 3He in the ocean and temperature in the garden of eden site.\nGra\nph\nsho\nwin\ng c\no\nr\nre\nll\nat\nio\nn\nbe\ntw\neen 3He in the ocean and temperature i\nn the galapagos.\nGra\nph\nsho\nwin\ng c\no\nrrellation between 3He in\nt\nh\ne\n\noc\nea\nn\nan\nd temperature in the garden of eden si\nte.\nFigure by MIT OCW.\n\nIf this number is coupled with a 3He supply rate from the mantle of 6.5x1026 atoms/yr, then the\nestimated heat flux is 12x1018 cal/yr -- in agreement with geophysical estimates.\n\nA summary of the heat flow estimates is shown below:\n\nTotal crustal heat loss from cooling models = 240 x 1018 cal/y\nBy conduction = 160 x 1018 cal/y\nBy convection = 80 x 1018 cal/y\nOff-axis (lower T) = ~60 x 1018 cal/y\nAxial (high T) = ~20 x 1018 cal/y\nCrystallization of magma = ~7 x 1018 cal/y\nCrystalization of magma + cooling of rock to ~350C = ~18 x 1018 cal/y\nHe - initial estimate based on Galapagos data = 49 x 1018 cal/y\nHe - revised, based on mantle properties = 12 x 1018 cal/y\n\nIII. Seawater / Rock Reactions in the Oceanic Crust\nIII.1 Description of the System\n\nThe oceanic crust near a mid-ocean ridge is pictured in idealized, layered form in Figure\n6 (top 2 cartoons), reasonable for crust formed at medium to fast spreading rates. It consists of a\nthin layer of sediments overlying a layer of volcanic rocks that is several hundred meters thick.\nThese volcanic rocks cover sheeted dikes that, in turn, overlie gabbros and the axial heat source.\nThere are sharp gradients in porosity and permeability between the volcanics and the sheeted\ndikes. As a result, water circulation tends to be open in the volcanics, restricted below; and water-\nrock ratios decrease with increasing depth below the surface. Water-rock reactions can be divided\ninto those that occur while seawater is sinking through the crust and being heated (during\n\"recharge\"), those that occur at high temperature, near the axial heat source (in the \"reaction\nzone\"), and those that occur during the ascent of the altered seawater (now, the hydrothermal\nfluid) back to the sea floor (\"discharge\"). This division is that of Alt (1995). (At slow spreading\nridges, the crust is not as simply layered (Fig. 6, bottom cartoon)).\n\nM\no\nd\ne\nl\n\no\nf\na\nmagma ch\namber.\nFigure by MIT OCW.\n\nFigure 6 showing differences in layering of the crust at fast (fig. 9) and slow (fig. 10) spreading\nridges (from Sinton and Detrick, 1992).\nModel of a ma\ngma chamber\n.\nFigure by MIT OCW.\n\nIII.2 Water-Rock Reactions in the Sinking Seawater.\n\nLow temperature reaction, at temperatures up to about 40°C, of seawater with basalt\nresults in the alteration of basaltic glass, olivine, and plagioclase by oxidation to ferric micas and\nsmectite, Mg-rich smectite, and Fe oxyhydroxides. During these reactions, alkali metals (K, Rb,\nCs), B and H2O are removed from seawater to the altered minerals. Si, S and, in some cases, Mg,\nmay be lost from the minerals. When the low temperature reactions occur at depths where sulfide\nis present, the sulfur may be oxidized and lost from the minerals. The reactions are more\nextensive, the more open the seawater circulation through the crust. They occur not only in young\ncrust at mid-ocean ridges, but also in older crust. Since, as we will see later, these low\ntemperature reactions may have opposite effects on seawater composition from high temperature\nreactions, it is important to take into account their occurrence in off-axis crust.\n\nWhen seawater is heated to temperatures above 150°C, two reactions occur: the\nprecipitation of Mg hydroxides (fixation of seawater Mg in the crust) and anhydrite (CaSO4).\nPrecipitation of Mg into various clays can be represented by the following reaction,\nshowing chlorite formation:\n4(NaSi)0.5(CaAl) 0.5AlSi2O8 + 15Mg2+ +24 H2O ↔\nAlbite-Anorthite in Basalt\n\n3Mg5Al2Si3O10(OH) 8 + SiO2 + 2Na+ + 2Ca2+ + 24H+\nChlorite\nIn general, the products of Mg hydroxide formation are smectites when the temperature is below\n200°C and chlorites above 200°C. The reactions are important, in addition to their effect on the\nseawater Mg budget, because they can make the recharge seawater more acidic. However, H+ is\nalso consumed by silicate hydrolysis reactions that moderate the acidity of the altered seawater.\nFor example, results of experimental reaction of seawater with basalt demonstrates that uptake of\nMg is roughly balanced by release of Ca from the basalts (Mottl, 1983). The sum of all reactions\nresults in an altered fluid that is slightly more acid than heated seawater. At temperatures above\n150°C, Mg uptake is accompanied by leaching of alkali metals and B from rocks: reactions that\nare opposite in direction from the lower temperature reactions, important in off-axis crust, that\nremove these elements from seawater.\n\nAnhydrite formation, occurring at temperatures in excess of 150°C, removes essentially\nall of the Ca from seawater; in so doing, it also removes about one-third of seawater sulfate.\n(Anhydrite exhibits retrograde solubility; if seawater is heated, anhydrite becomes saturated at\n~150°C). Additional anhydrite precipitation can occur following release of Ca from basalt.\nSulfur isotope data from vent fluids indicate that some of the seawater sulfate is reduced. This\nlikely occurs at temperatures in excess of 250°C, with seawater sulfate reduced through reaction\nwith igneous pyrrhotite to secondary pyrite. A combination of this seawater-derived sulfide with\nbasaltic sulfide (0%), results in the observed slightly elevated δ34S values of hydrothermal sulfide\n\nin altered sheeted dykes and in fluids venting at the seafloor (>1%). (In terms of mass balance, it\nis important to recognize that much of the anhydrite formed in the down-welling limb of the\nhydrothermal system may be dissolved or replaced by other phases as the crust ages).\n\nOther elements are affected by ion exchange reactions. One that occurs at temperatures\nin excess of 250°C, and that affects the concentrations of Ca and Na in the resulting vent fluid, is\nalbitization, or the alteration of basaltic anorthite to albite:\nCaAl2Si2O8 + 2Na+ + 4SiO2(aq) ↔ 2NaAlSi3O8 + Ca2+\n\nAnorthite\n\nAlbite\n\nThe set of reactions occurring in the \"recharge\" zone (Figure 2) results in a fluid that is\nslightly acidic, anoxic, and alkali-rich and Mg-poor relative to the starting seawater.\n\nIII.3 Reactions Near the Axial Heat Source\n\nThe final steps in the formation of hydrothermal fluids take place in the \"reaction zone\"\nnear the axial heat source. The acidic, anoxic fluid reaching this region reacts, at low water-rock\nratios, with the gabbros present. Most importantly, the fluid attacks magmatic sulfide minerals,\nadding S and heavy metals (e.g., Cu, Fe, Mn, Zn) to solution. In some cases, the fluid may\nseparate into a low salinity vapor phase and a brine phase; intermittent contact between the\ncirculating fluid and the brine would then result in varying salinity (and Na and Cl content) of the\nhydrothermal fluid. In addition, magmatic volatiles are added to the circulating fluid: 3He, CO2\nwith a mantle stable carbon isotopic signature, CH4, H2.\n\nIII.4 Processes Occurring during Ascent to the Sea Floor\n\nHeating in the reaction zone results in a very buoyant fluid that rises at a rapid rate to the\nseafloor; the difference in density of seawater as a function of temperature and pressure is shown\nin Figure 7. It is unclear the extent to which this fluid reacts with the surrounding rock as it rises\nto the seafloor. Within ophiolites (slices of ocean crust that have been obducted and are exposed\non land), the deep part of the focused upflow zones (within the lower sheeted dikes) are\ncharacterized by epidosite zones (epidote + quartz ±chlorite). However, only one sample\nexhibiting these alteration phases has been recovered from the ocean crust. A well developed\n\"stockwork\" consisting of an alteration pipe with zones of quartz and sulfide veins, and with\nalteration haloes, has been revealed beneath the TAG active hydrothermal mound at 26°N on the\nMid-Atlantic Ridge, by recovering drillcore from depths of up to 125 meters below seafloor. The\nrock record, however, integrates the effects of water-rock interaction over long periods of time.\nThermodynamic calculations considering the measured compositions of fluids sampled at vents\nindicate that the fluids are supersaturated with respect to quartz, undersaturated with respect to\nmany other phases, and close to saturation with chalcopyrite at the temperatures and pressures of\n\nthe vents. In general it has been assumed that 1) quartz becomes saturated as the fluid rises (due\nto decreasing pressure), but is kinetically inhibited from precipitating (and is not observed within\nactively forming chimneys), 2) there may be minor amounts of precipitation and/or dissolution of\nsulfide phases as the fluid rises, thus 3) the fluids rise rapidly enough so that their fluid\ncomposition is not greatly affected during upflow.\n\nFluids exit the seafloor at vent sites rapidly, as high temperature focused flow, and also\nslowly through cracks and surfaces as lower temperature diffuse flow. Analysis of diffuse fluid\ncompositions indicate that the lower temperature fluids are mixtures of seawater and vent fluid,\nthough some fluids show evidence for there having been conductive cooling of vent fluid, or\nconductive heating of seawater, and/or reaction (precipitation/dissolution) as the vent fluid and\nseawater mixed. Comparison of the high temperature and low temperature vent fluid\ncompositions indicate that the mixing, cooling, heating, and/or reaction takes place in the shallow\nsubsurface.\n\nFigure 7\nIII.5. Sampling hydrothermal fluids\n\nHydrothermal fluids from within the crust cannot be sampled directly. Rather, fluid is\nsampled as it exits hydrothermal vents. Inevitably, the fluid is mixed with varying amounts of\nseawater. Thus, the concentration of the element of interest in hydrothermal fluid must be\nestimated from an extrapolation to the pure hydrothermal fluid endmember. The extrapolation is\naccomplished using the assumption that pure hydrothermal fluids contain no Mg. The\nconcentration of the element in the suite of samples, consisting of varying mixtures of seawater\nand hydrothermal fluid, is plotted vs. the Mg concentration in the samples; the resulting line is\nP\nl\no\nt of\ntem\npera\nture\naga\ninst\ndep\nth a\nnd p\nressu\nre.\nFigure by MIT OCW.\n\nHyd\nroth\ner\nm\na\nl\nfl\nu\nid\n\ne\nn\nd\n\nm\nem\nbe\nr\nca\nlc\nu\nla\nti\non\ns\nfo\nr\nS\niO2\n,\nFe\n, H\n2S\na\nnd\nCU,\npl\no\ntte\nd a\ng\nain\nst\nMg.\nextrapolated to zero Mg concentration to determine the hydrothermal end member. Obviously, the\ncalculation assumes conservative mixing, and fails if the element undergoes reactions during\nmixing with seawater. Some examples of hydrothermal end member calculation are shown in\nFigure 8. Note that non-conservative behavior of Cu prevents calculation of an accurate\nendmember (Mg concentration in seawater is ~52.7 mmol/kg).\n\nFigure by MIT OCW.\n\nFigure 8\n\nA summary of concentrations of the major elements of seawater in some mid-ocean ridge\nhydrothermal fluids is shown below. The ranges of concentrations for different vents illustrates\nthe variability in processes that may affect hydrothermal reactions.\nChemical composition of vent fluids (from Von Damm, 1995; Von Damm et al., 1997)\n\nTAG 1990\nEPR 9oN, 1991\nEPR 9oN, 1994\nSeawater\nT (oC)\n360-365\npH (25oC)\n3.35\n2.8\n2.6\n7.8\nSi(OH)4 (mmol/kg)\n20.75\n5.9\n0.2\nH2S (mmol/kg)\n2.3-3.5\n8.7\nCl (mmol/kg)\n46.5\nNa (mmol/kg)\n38.4\nK (mmol/kg)\n17.1\n1.2\n41.5\n10.1\nCa (mmol/kg)\n30.8\n9.9\nMn (μmol/kg)\n0.2\n3.3\nFe (μmol/kg)\n1.5\n12.1\nCu (μmol/kg)\n98-120\n-\n-\n\nZn (μmol/kg)\n47-53\n-\n-\n\nIV. Hydrothermal Fluxes\n\nIV.1. Heat flux and hydrothermal circulation\n\nAs chemical oceanographers, a major interest is to estimate the net inputs and outputs of\nvarious chemical elements to and from the oceans due to seafloor hydrothermal activity. The best\nestimates of these fluxes due to hydrothermal activity at the axis of the mid-ocean ridge come\nfrom measurements of concentrations of elements in hydrothermal fluids. In order to translate\nthese measurements into net inputs and outputs, the rate of circulation of seawater through\nhydrothermal systems must be estimated.\n\nHeat flow estimates, with the heat capacity of seawater over the 0-350°C temperature\nrange, have been used to estimate the circulation rate. It takes about 367 cal/g to heat seawater\nfrom 0° to 350°. If, for example, the axial heat loss is 15x1018 cal/yr, then the seawater\ncirculation rate is\n\n15 × 1018calyr\ncalyr\n367cal g\ncal g\n× 1 l seawater\n1026 g\n= 4 × 1013l yr\nl yr\n\nThis rate is about 0.1% of the rate of input of water to the oceans from rivers. Therefore, for an\nelemental flux due to axial hydrothermal activity to be as large as river input, the concentration\ndifference for the element between the hydrothermal fluid and seawater must be about 1000 times\nits concentration in river water.\n\nHeat is also lost from older crust, along the flanks of the mid-ocean ridge system. Mid-\nocean ridge flanks are much less well characterized than axial hydrothermal systems; seawater\nflow through the crust is diffuse and patchy, therefore difficult to quantify. If, however, the\neffective temperature of the circulating seawater is 20°C (Mottl and Wheat, 1994), and\n50x1018cal/yr are removed by seawater circulation along ridge flanks, then the implied seawater\ncirculation rate is 2.4x1015 l/yr, or about 7% of the river input rate. Low-temperature basalt-\nseawater reactions can be significant compared to river fluxes even if they produce fluids with\nmuch smaller concentration differences from seawater than are present in axial hydrothermal\nfluids.\n\nIV.2 Fluxes Due to Discharge from Hydrothermal Vents\n\nFluxes from hydrothermal vents can be calculated by\n\nFlux i =\nC hf\ni - C sw\ni\n× Vsw\nwhere\nis the average concentration of element i in hydrothermal fluids,\n\nC hf\ni\n\nC sw\ni is its\nconcentration in seawater, and\nis the volume of seawater discharged from hydrothermal\nvents per year. We have discussed the estimation of\n, and its uncertainty, above. In this\nsection, we will illustrate the estimation of concentrations in hydrothermal fluids, discuss their\nvariability, and show the results of flux calculations.\n\nVsw\n\nVsw\nAs shown in the table above, concentrations of various elements differ from vent to vent.\nSome generalizations about the major elements in hydrothermal fluids can be made. Na tends to\nfollow Cl (as it must to maintain electrical neutrality, since these elements are the most\nconcentrated in seawater) but can be somewhat depleted; the depletion is believed to be due to the\nexchange of Na for Ca in the Ca-rich plagioclase present in basalts and gabbros (albitization). Ca\nand K are enriched in hydrothermal fluids due to similar exchange reactions involving primarily\nNa+, Mg2+, and H+. Mg is quantitatively removed due to the precipitation of Mg hydroxides\nfrom seawater as it is heated. Sulfate is essentially quantitatively removed from seawater by\nanhydrite precipitation and sulfate reduction, with some seawater sulfate returned as H2S. Cl\nconcentration can differ slightly (±10%) from that of seawater if the rock is hydrated (and H2O is\nlost from the seawater, enriching it in Cl), or if minerals precipitate that incorporate Cl (e.g.,\namphiboles). However in general Cl is not involved to any significant extent in mineral alteration\nreactions; large variations in its concentration reflect effects from sub-critical boiling, super-\ncritical phase separation, and segregation of the resulting vapor and brine phases. The high\nsalinity fluids contain elevated Cl, Na, Ca, and K, while volatiles (e.g., H2S) are enriched in the\nvapor phase. Finally, in most cases, hydrothermal processes represent a sink for seawater\nalkalinity. The exceptions are the sediment-covered sites, where reactions of the fluids with\nsediments result in solutions with alkalinity and pH near those of seawater.\n\nSpecies that are very highly enriched in hydrothermal fluids relative to seawater include\nLi, an example of the alkali metals; SiO2, enriched due to the equilibration of hydrothermal fluids\nwith quartz at high temperature and pressure; Mn and Fe, leached from rocks by the high\ntemperature, high pressure, slightly acidic hydrothermal fluids.\n\nFluxes into and out of the oceans due to hydrothermal activity were summarized by the\nRIDGE/VENTS Workshop of September, 1994 (Kadko et al., 1994) (Figure 9). Concentration\nranges derived from a large data set were used. Two values of the heat flux were used: a low-end\nestimate equivalent to the latent heat of crystallization of the magma (6.8x1018 cal/yr); and a high\nend that adds to this value the heat of cooling to 350°C (11.5x1018 cal/yr). This range of heat\nfluxes gives a range of Vsw of 1.8-4.9x1016 g/yr. Two elements appear to be lost from the oceans\nat rates exceeding 20% of the riverine flux to the oceans: Mg and S. The elements added to the\n\noceans in significant quantity by axial hydrothermal activity are the alkali metals (except Na), for\nwhich the fluxes may exceed riverine fluxes. Mn and Fe are also added in significant amounts; as\nwe will see later, these elements (especially Fe) oxidize in seawater and fall out into the\nsediments near the ridge system. As they oxidize, they can affect other elements: for instance, P,\nAs, V, and rare earth elements are removed by sorption onto the newly precipitated oxide\nparticles.\n\nFigure 9\nIV.3 Fluxes on the Ridge Flanks\n\nMost of the heat carried from crust to ocean by hydrothermal activity is lost, not from the\nridge axis, but from the older crust on the ridge flanks. Circulation in these areas is relatively\nshallow, and the water is not heated to high temperatures. Because more heat is carried by the\ncirculation than at the ridge axis, and the water is not as hot, the volume of water involved is\nmuch greater than on the axis. Therefore, significant fluxes to and from the oceans would require\nonly small concentration changes in the circulating seawater; this fact, and the diffuse nature of\nthe discharge, make it impossible to evaluate fluxes by measuring concentration changes in the\ncirculating seawater. Instead, fluxes are estimated by comparing the concentrations of elements of\ninterest in altered basalts and basaltic glass to their concentrations in fresh rock. For example\n(Table below), Hart and Staudigel measured enrichment factors for several alkali metals in\nFigure by MIT OCW.\nT\nhe\nrat\nio\noif\nhyd\nroth\nerma\nl\nf l ux a lo ng t\nhe mid-ocea n r\ni dg e\nax\nis t o th e ri ve rine fl\nux for a variety of elements.\n\naltered, compared to unaltered, basalts. When they combined these data with an estimate of the\nrate of alteration of basalt by low-temperature hydrothermal activity, they found that low\ntemperature alteration was a significant sink from the ocean for these elements.\nUpper crust alkali fluxes (after Hart and Staudigel, 1982)\n\nK (μg/g)\nRb (μg/g)\nCs (μg/g)\n418A whole rocks\n4.995\n0.1125\n418A smectites/palagonites\n22.20\n0.387\nAverage, 75% WR, 25% sm/pg\n9.3\n0.18\nAverage unaltered basalt [24]\n1.02\n0.0131\nNet addition to upper crust\n8.30\n0.167\nFlux into upper 600 m (g/yr) SINK\n1.5x1013*\n4.2x1010\n8.6x108\nRiver flux (g/yr) SOURCE\n7.4x1013\n3.5x1010\n6.4x108\n*calculated assuming crustal production rate = 5.6x1016 g/yr\ncrustal thickness= 6.4 km, depth of alteration = 0.6 km\n2925x10-6 g/g x [(0.6/6.4)x5.6x1016 g/yr) = 1.5 x 1013 g/yr\n\n-1\n+1\n+0.5\n-0.5\nMg\nCa\nK\nS\nLi\nSi\n4.7 ?\n2.1 ?\nSink\nSource\nSource\n?\nHydrothermal input/River input\nAxis\nFlank\nFigure 10\n-1\n+1\n+0.5\n-0.5\nMg\nCa\nK\nS\nLi\nSi\n4.7 ?\n2.1 ?\nSink\nSource\nSource\n?\nHydrothermal input/River input\nAxis\nFlank\nFigure 10\n-1\n+1\n+0.5\n-0.5\nMg\nCa\nK\nS\nLi\nSi\n4.7 ?\n2.1 ?\nSink\nSource\nSource\n?\nHydrothermal input/River input\nAxis\nFlank\nFigure 10\n\nA few results showing the influence of low temperature processes on oceanic budgets are shown\nin Figure 10. The most striking result is that the large fluxes of the alkali metals occurring at the\nridge axis, which are due to high temperature reactions deep in the crust, are essentially\nneutralized by consumption of the elements during low temperature alteration on the ridge flanks\n(see Li and K in Figure 10). A similar situation appears for sulfur: S is lost largely as a result of\nprecipitation of anhydrite; this anhydrite redissolves as the crust is cooled. The amount of S\nreturned to the ocean in this way is uncertain, but it surely reduces significantly the loss of S from\n\nthe oceans due to hydrothermal activity. In the cases of Mg, Ca, and Si, the low temperature\nreactions add to the fluxes due to high-temperature reactions, thus fluxes on the ridge flanks add\nto axial fluxes.\n\nSuggested References:\n*Alt, J., 1995, Subseafloor processes in mid-ocean ridge hydrothermal systems. In: Seafloor Hydrothermal\nSystems: Physical, Chemical, Biological, and Geological Interactions (S. E. Humphris, R. A.\nZierenberg, L. S. Mullineaux, and R. E. Thomson, eds.). AGU Monograph Series, No. 91. American\nGeophysical Union, Washington, DC, pp. 85-114.\n\nKadko D., J. Baross, and J. Alt, 1995, The magnitude and global implications of hydrothermal flux. In:\nSeafloor Hydrothermal Systems: Physical, Chemical, Biological, and Geological Interactions (S. E.\nHumphris, R. A. Zierenberg, L. S. Mullineaux, and R. E. Thomson, eds.). AGU Monograph Series,\nNo. 91. American Geophysical Union, Washington, DC, pp. 446-466.\n\nLilley, M., R.A. Feely, and J.H. Trefry, 1995, Chemical and biochemical transformations in hydrothermal\nplumes. In: Seafloor Hydrothermal Systems: Physical, Chemical, Biological, and Geological\nInteractions (S. E. Humphris, R. A. Zierenberg, L. S. Mullineaux, and R. E. Thomson, eds.). AGU\nMonograph Series, No. 91. American Geophysical Union, Washington, DC, pp. 369-391.\n\nStein, C.A., S. Stein, and A. Pelayo, 1995, Heat flow and hydrothermal circulation. In: Seafloor\nHydrothermal Systems: Physical, Chemical, Biological, and Geological Interactions (S. E. Humphris,\nR. A. Zierenberg, L. S. Mullineaux, and R. E. Thomson, eds.). AGU Monograph Series, No. 91.\nAmerican Geophysical Union, Washington, DC, pp. 425-445.\n\n*Von Damm, K.L., 1995, Controls on the chemistry and temporal variability of seafloor hydrothermal\nfluids. In: Seafloor Hydrothermal Systems: Physical, Chemical, Biological, and Geological\nInteractions (S. E. Humphris, R. A. Zierenberg, L. S. Mullineaux, and R. E. Thomson, eds.). AGU\nMonograph Series, No. 91. American Geophysical Union, Washington, DC, pp. 222-247."
    },
    {
      "category": "Lecture Notes",
      "title": "lec_11_gas_exch.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/5cafb7ffbdc9962c602ef05d0e5016fe_lec_11_gas_exch.pdf",
      "content": "12.742 Marine Chemistry\nLecture 8\n12.742 Marine Chemistry: Dissolved Gases and Air-sea exchange\nLecture 8\nOverview\nThe fluxes of gases between the ocean and atmosphere play a pivotal role in the marine geochemistry and\nbiogeochemical cycles of many elements and/or species (e.g., CO2, O2, DMS or dimethylsulfide, etc.).\nUnlike on land, quantifying gas exchange rates at sea is a difficult task, and considerable effort has been\ndevoted to estimating gas fluxes (usually some indirect approach). At the simplest level, estimating the\nflux of a gas across the air-sea interface requires two basic types of information: 1) the disequilibrium\nbetween the concentrations of gas in the air and surface seawater (the thermodynamic driving force) and\n2) the rate at which the disequilibrium is removed (the kinetic rate). The formulation of air-sea gas\nexchange thus is very reminiscent of many other transport problems (e.g., thermal diffusion) and\nirreversible thermodynamics (out side the scope of this class).\nGas Solubilities\nTo start with, we want to know something about how much gas is dissolved in water and whether those\nconcentrations are in equilibrium with the air above. Air is composed of a mixture of gases, the more\nsignificant of which are listed below:\nGas\nContent by\nvolume\nN2\n78.08%\nO2\n20.95%\nAr\n0.934%\nCO2\n280+ ppm\nNe\n18.18 ppm\nHe\n5.24 ppm\nKr\n1.14 ppm\nXe\n0.087 ppm\nH2\n0.5 ppm\nCH4\n2 ppm\nN2O\n0.5 ppm\nThe above are presented \"exclusive of water vapour\". (Bear in mind that water exerts a vapour pressure\nthat is a function of temperature.) Dalton's Law of Partial Pressures states that the pressure exerted by\nthe individual gases is additive, and therefore their abundances may be expressed as partial pressures and\ntreated independently of one another.\nExclusive of any chemical or biological reactions within the ocean or atmosphere, gases tend to dissolve\ninto seawater in proportion to their partial pressure. This fact is usually referred to as Henry's Law.\n[\n]\nA\neq P\nRT\nK\naq\nA\n=\n)\n(\nHere A(aq) is the aqueous activity of the gas (the concentration), usually expressed in terms of molar units\nper unit volume of water (e.g., cc(STP)/l). Also, PA is the partial pressure of the gas, R and T are the\nusual, and Keq is the Henry's law coefficient. While this is fine for the laboratory, a more useful measure\nis the Bunsen Solubility Coefficient, which relates the concentration to the partial pressure more directly:\n\n12.742 Marine Chemistry\nLecture 8\n[\n]\nA\nAP\naq\nA\n!\n=\n)\n(\nBe prepared to work between units like μmol/kg, μmol/l, cc(STP)/g, etc. These are all molar quantities,\nwith one important exception: when the divisor is in volumetric terms, the ratio is not really molar, as the\nvolume of water (and seawater) is dependent on temperature (and salinity). Hence the internationally\nadopted (WOCE) standards of measurement are μmol/kg.\nFor example, oxygen used to be given in units of \"ml/l\", that is ml(STP) of oxygen per litre of\nwater. Since there are 22.4 x 103 ml in a mole, and since there are approximately (depending\non the temperature and salinity) 1.025 kg in a litre of seawater, you can derive that\n1 ml/l = 43.6 μmol kg--1\nso that an oxygen concentration of 6.6 ml/l would be equivalent to 287 μmol kg-1.\nThe solubility of a gas in water may be broken down into three aspects. In a quasi-thermodynamic\ntreatment, one may regard the heat of dissolution being the sum of three heats:\n1. The work required to create a cavity in the solvent (solvent dependency)\n2. The work required to contain the solute in the cavity (solute dependency)\n3. The energy gained by solute-solvent interaction (solute-solvent dependency)\nIn general, the third appears to be the most significant factor for most gases, with the larger, more polar\n(or polarizable) gases being the more soluble.\nFor a more thermodynamics that one would care to see, the reader is referred to the\nfollowing paper:\nMolecular thermodynamic model for the solubility of noble gases in water. A. Braibanti\net al., J. Phys. Chem. 98, 626-634 (1994)\nSolubilities are most strongly\ndependent on temperature. In general,\ngases are less soluble at higher\ntemperatures. This may be regarded as\na direct consequence of the latter two\nterms in the energy budget mentioned\nabove: as temperature increases, it\nbecomes more difficult to contain the\ngas (solute) and the solute-solvent\nattraction is increasingly disrupted by\nthermal agitation. Below is a plot of\nbunsen solubilities for a number of\natmospheric gases.\nNote that in addition to being more\nsoluble overall, the slope and curvature\nof the temperature dependence\nincreases for the \"heavier\", more\nsoluble gases.\n\n12.742 Marine Chemistry\nLecture 8\nIsotope Effects in Solution\nThe heavier isotopic species of gases are generally more soluble. This can be rationalized by considering\nthe different thermodynamic components discussed above. The second factor appears most likely to be\nthe dominant isotopic differentiator, although the third must also contribute. Some general aspects of\nisotope effects of gas solution in seawater are summarized below. Note that there is a correspondence\nwith fractional mass difference (the larger the fractional mass difference, the greater the isotope effect).\nHowever, the effect becomes far less distinct with increasing solubility, largely because of the smaller\nrelative contribution of the second thermodynamic factor.\nGas\nMolecular Wt\nIsotope Ratio\nMass Difference\nIsotope Effect\nHelium\n3He/4He\n28.6%\n-1.5%\nNeon\n20.2\n20Ne/22Ne\n9.5%\n-0.5%\nOxygen\n18O/16O\n6.1%\n+0.1%\nArgon\n40Ar/36Ar\n10.5%\n+0.05%\nNote also the sign changes due to whether the heavier isotope is in the denominator or numerator.\nSolubilities depend on salinity as well. This is known as \"salting out\", and results from the interference of\nionic strength with the solute-solvent attraction. It is often described by the Setschenow Relation which is\nS\nkS\nS\n=\n!!\n\"\n#\n$$\n%\n&\n'\n' 0\nln\nwhere the subscript 0 refers to zero salinity, and S is the salinity. kS is the constant of proportionality.\nHowever, more complex (higher order) terms are often used in solubility functions nowadays. Below is\nan example of the difference between fresh and salt water.\n\n12.742 Marine Chemistry\nLecture 8\nSolubilities are determined in the laboratory under carefully controlled conditions, and often reported as\nsemi-empirical \"thermodynamic\" functions. Weiss, for example, uses the following form:\n[\n]\nln\nln\nT\nB\nT\nB\nB\nS\nT\nA\nT\nA\nA\n+\n+\n+\n+\n!\n\"\n#\n$\n%\n&\n+\n=\n'\nwhich nothing more than a convenient function that fits the observed laboratory temperature and salinity\ndependence reasonably well.\nThe Stagnant Film Model\nThe exchange of most gases between the atmosphere and ocean may be regarded as limited by molecular\ndiffusion. The simplest model is to think of a stagnant film on the liquid side at the boundary between the\ntwo phases (air and water).\nTo escape (or invade) the gas must diffuse across this layer. Thus the flux would be given by\n(\n)\nz\nC\nC\nD\nz\nC\nD\ndz\ndC\nD\nF\n!\n\"\n\"\n=\n!\n!\n\"\n=\n\"\n=\nwhere D is the molecular diffusivity. Note that this predicts a linear dependence of gas exchange rate on\nthe molecular diffusivity of the gas (a function of temperature and salinity). Also, expect the film\nthickness to be a function of viscosity (hence T and S) and state of turbulence.\nThe above formulation is an example of the \"divide and conquer\" approach to geochemistry: you separate\nthe problem into gas or species dependent part, and a solvent or medium dependent part. The gas part is\nD(C-C0) and the medium part is the\n. The latter, the layer thickness, should be a function of the\nviscosity of the water and the degree of turbulence.\nz\n!\nStagn\nant f\nilm b\nox mo\ndel\nof air\nse\na gas e\nxchange.\nFigure by MIT OCW.\n\n12.742 Marine Chemistry\nLecture 8\nRadon has a half-life of about 4 days, and to all intents and purposes, has a zero concentration in the\natmosphere. It is produced in seawater by radioactive decay of 238U chain nuclides, in particular its\nimmediate parent 226Ra. If 222Rn were not a gas, it would be in secular equilibrium with its parent:\nA\nA\n=\nSecular equilibrium is a situation where the rate at which a radionuclide decays is exactly equal to the rate\nat which it is produced. This occurs within decay chains, and means that the parent and daughter activities\nbecome equal. The concentration and activity are related by\nN\nA\n!\n=\nwhere λ is the radioactive decay constant. But when we look in the water column near the ocean surface,\n222Rn is less abundant than you would expect from the activity of 226Ra. That is, you have A222 < A226 .\nGr\nap\nh\nof\nR\nad\non\na\nc\nt\ni\nv\nity at de\npth.\nFigure by MIT OCW.\n\n12.742 Marine Chemistry\nLecture 8\nIn the figure above, the dashed line is the activity of 226Ra, and the dotted line is the temperature. The\nshaded region highlights the deficit of 222Rn, which is strongly associated with the region of uniform\ntemperature known as the Mixed Layer (the surface layer of the ocean effectively stirred to uniformity by\nthe winds and thermal convection). If we think of the mixed layer as a column with unit area and depth H,\nthe vertically integrated production rate of 222Rn is the water column height times the 226Ra activity:\nProd = HA226\nNow according to our stagnant film model, the loss of Rn due to gas exchange is\nF = D222\n\"C\n\"z = D222\n#222\"z A222\nThe gas exchange rate (D/Δz) is expressible in units of length/time, e.g., traditionally in cm/hr or m/day.\nThis can be seen by substituting in the units for diffusivity and the stagnant film thickness and cancelling\nthem out (or alternatively for the form on the far right side of the equation above, the diffusivity, the\nactivity, the decay constant, and the stagnant film thickness). Thus it appears like a \"velocity\", and is\noften referred to as the piston velocity k times the concentration difference.\nF = k\"C\nFor example, using mks units, we have the units of piston velocity as:\nk = m2s\"1\nm\n= m2s\"1\ns\"1m s\"1 = m s\"1\nThat is, piston velocity indeed has units of velocity (cm/hr, m/s, furlongs/fortnight, etc). It can be thought\nof as the speed of an imaginary piston which is pushing gas out of (or into) the water column.\nWhen considering the mixed layer budget for Rn, the loss rate includes both gas exchange and the loss\ndue to radioactive decay:\nLoss = F + HA222 =\nD222\n\"222#z + H\n$\n% &\n'\n( ) A222\nand insisting that in the steady-state situation, Production = Loss, we have\nor by solving for Δz, we get\nA\nH\nz\nD\nHA\n!!\n\"\n#\n$$\n%\n&\n+\n'\n=\n(\n\"z =\nD222A222\n#222(HA226 $ HA222)\nSo that substituting the known quantities:\nl\ndpm\nA\nl\ndpm\nA\nm\nH\ns\nm\nD\ns\n/\n7.6\n/\n7.4\n4.1\n1.2\n=\n=\n=\n!\n=\n!\n=\n\"\n\"\n\"\n\"\n#\n\n12.742 Marine Chemistry\nLecture 8\ngives\nm\nz\n!\n\"\n#\n$\n, which should be the thickness of this hypothetical boundary layer.\nNow this is all well and good, and I'm sure you find that learning about the gas exchange rate of a heavy,\nradioactive noble gas is a laudable achievement, but what about more important gases, like oxygen or\nCO2? How do we obtain regional or global estimates of the fluxes? Thus there are two fundamental\nquestions that arise:\n1. How does the gas exchange rate depend on the type of gas?\n2. How does the gas exchange rate vary, for a given gas, with environmental\nfactors?\nThe second question depends on complicated details of the fluid: turbulence, viscosity, etc, and we'll be\ntalking about that later in the lecture. The first question, if the thin film model were correct, would be\neasy: the gas exchange rate varies linearly with the molecular diffusion coefficient. We would then use\nthe gas exchange rate measured \"directly\" with the Rn deficit technique described above along with\nlaboratory measurements of molecular diffusivity, such as the ones listed (in units of 10-9 m2s-1) below to\nestimate the gas exchange rate for a given species.\nGas\nMol Wt\nD @ 0°C\nD@25°C\nHe\n4.60\n7.31\nNe\n2.33\n4.03\nN2\n1.40\n2.88\nO2\n1.45\n2.53\nAr\n1.58\n2.47\nCO2\n1.0\n1.9\nN2O\n1.0\n2.0\nKr\n0.87\n1.85\nXe\n0.64\n1.49\nRn\n0.57\n1.33\nNote that the diffusivity is a function of temperature, often expressed in the following equation:\nRT\nEa\ne\nD\nD\n!\n=\nwhere Ea is the activation energy, T is the absolute temperature, and D0 is the diffusivity at infinite\ntemperature.\nA definitive publication on gas diffusivities in seawater and water is: Jahne, B., G. Heinze\nand W. Dietrich (1987) Measurement of the diffusion coefficients of sparingly soluble\ngases in water. J. Geophys. Res.92, 10767-10776.\nAs you may guess from the tone of this discussion, the stagnant film model turns out to be not very good,\nespecially as we would expect that this putative stagnant film is unlikely to remain in place under strongly\nturbulent conditions normally encountered in the open ocean. Wave action and bubble production will\nensure that the layer is destroyed rather quickly. This has significant impact on the transport of gases, as\nwe shall see. Thus we have to look at another model.\n\n12.742 Marine Chemistry\nLecture 8\nThe Replacement Film Model\nThe problem with the stagnant film model is that it doesn't work very well. Bear in mind that molecular\ndiffusivities vary by a factor of about 5-10 (depending on temperature) between gases like Rn and He. If\nwe don't have the dependence of gas exchange rate on diffusivity right, then we run a serious risk of\nbeing substantially off in our estimate of other gas exchange rates.\nIt is hard to imagine that a stagnant film could exist under higher sea states. The next evolutionary step in\nour modelling of gas exchange is to consider the replacement film model. The concept is that the laminar\nboundary layer is continuously torn apart and replaced with slabs of fluid below. In this model, \"renewal\nevents\" occur bringing fresh subsurface water to the air-water interface. These patches of water then gain\n(loss) gas across the air-water interface via diffusion thus reducing ΔC. At the next renewal event, which\noccurs on average with a time-scale τ, the surface water with modified concentrations is driven back into\nthe ocean interior driving a net flux between the bulk air and water. To estimate the flux of material\nassociated with this process, consider the diffusive penetration of material into an infinite slab. The\ndiffusive flux into a semi-infinite space goes as:\nF(t) = \"C\nD\n#t\nNote that the flux goes down with time as the surface patch becomes equilibrated with the air. To find the\naverage flux over the time-period that the patch is at the surface (0 to θ), one would need to integrate and\nthen divide by θ.\nF = 1\n\"\nF(t)dt\n\"#\n= 2$C\nD\n%\"\nThus in the surface renewal model the piston velocity is k = 2 D/\"#\nsurface renewal time-scale θ, but we know it is related to the viscosity (the more viscous the fluid, the\nslower the slab is replaced), so that we can relate the gas flux to a constant and the viscosity (ν) as\nk \"\nD\n# \" Sc$1/ 2\n\"\nD = Sc is a dimensionless number used in chemical\n. Now we don't actually know the\nNow the interesting thing is that the factor\nengineering literature to refer to the relative importance of molecular diffusion and viscosity dissipation in\nphysical systems. It is called the Schmidt Number (Sc) and is larger for the more slowly diffusing gases,\nand smaller for the more mobile ones. Piston velocity for the film replacement model scales as Sc-1/2 and\ncan be used to estimate the air-sea flux for any gas FC if we know the air-sea gas exchange coefficient (or\npiston velocity) for a reference gas and temperature (k0):\nF = k0\nSc\nSc0\n\"\n# $\n%\n& '\n(0.5\n)C\nand k = k0\nSc\nSc0\n\"\n# $\n%\n& '\n(0.5\nThis model appears to be the most successful in relating the gas exchange rates of differing gases. The\ntable below is a list of various Sc numbers for different gases at a variety of temperatures.\n\n12.742 Marine Chemistry\nLecture 8\nT(°C)\nHe\nNe\nAr\nO2\nKr\nXe\nRn\nH2\nCH4\nCO2\nAs you can see from the table above, more mobile gases like He have a lower Sc and the slower movers,\nlike Rn, have much higher Sc. Note that we have highlighted CO2 at Sc=600. You will often find gas\nexchange rate measurements referenced to this standard.\nIt turns out that there have been a number of tests of the appropriateness of the replacement film model\nfor oceanographic gas exchange experiments. They have tended to ask a more general question: what is\nthe value of n in the general gas exchange equation?\nF = k0\nSc\nSc0\n\"\n# $\n%\n& '\n(n\n)C\nExperiments point to n= 0.5 for most oceanic conditions. In the case of the stagnant film model, we had\nn=1, but as we said, the s.f.m. doesn't work. However, sophisticated theoretical derivations (and some\nexperiments seem to hint at it) indicate that n should increase to 2/3 (0.667) at low wind speeds (\"smooth\nwall\" conditions). This makes sense in that the ideal of a stagnant film might be more closely approached\nunder those conditions.\nGeneral Gas Exchange Models\nNow that we have discussed how the gas exchange rate depends on the gas in question, how does it\ndepend on other things? There are a number of factors:\nChemical Reaction\nSince the flux of gas into the water ultimately governed by fickian diffusion in the boundary layer,\nz\nC\nD\nF\n!\n!\n\"\n=\nthen chemical reactions within the thin boundary layer may serve to sharpen gradients of some gases,\nthereby increasing the fluxes of those gases. This kind of enhancement certainly occurs for extremely\nreactive compounds, particularly photo-reactive species. This might also be the case for CO2 since it\nconverts to bicarbonate and carbonate.\nCO\nH\nO\nH\nCO\n!\n+\nIt is possible to assess the significance of this by comparing the time constant of this buffering reaction,\nwhich is of the order of a minute, with the time it takes for a molecule to transit the boundary layer via\nmolecular diffusion, which is related to\nD\nL\nT\n!\n\n12.742 Marine Chemistry\nLecture 8\nand using typical values (\ns\nT\n!\nand\n!\n!\n\"\n#\ns\nm\nD\n) which substituted in the above\nyields\n. Thus a CO2 molecule spends far too little time in the boundary layer to be affected by\nm\nL\n!\n\"\n#\nchemical reaction whilst there. Laboratory measurements confirm this. However, the book is still not\nclosed on this case, as films present at the sea surface may concentrate catalysts, in particular carbonic\nanhydrase, which may speed up the chemical reaction. Although measurements of bulk seawater do not\nshow sufficient carbonic anhydrase concentrations to catalyse CO2 gas exchange, measurements have yet\nto be made on surface films.\nWind Speed\nWind stirring at the ocean surface produces turbulence in the water, which shear the boundary layer,\nthinning it, and speeding its replacement and removal of material from the sea surface. Further, the\ncreation of waves effectively increases surface area, thereby increasing gas fluxes. Because it is relatively\nquantifiable, wind speed has been used as a primary variable in studying gas exchange rates. There is no\nclear theory relating wind speed directly to gas exchange rates (GER), except in the general sense that the\nGER should increase, probably in a stronger fashion than linearly with wind speed. Thus wind-speed vs\ngas exchange rate relationships have been strictly empirical, that is the relationships are actually statistical\nregressions of some simple function against the (usually very noisy) data. The two primary relationships\nused are\n-\nA tri-linear regression suggested by Liss & Merlivat (1986) which breaks the wind-speed\nrange into three sub-ranges characterised by three different linear relations, with\nprogressively increasing slope for increasing wind speed\n-\nA quadratic regression used by Wanninkhof (1992)\nBelow is a figure which compares these formulations with a compilation of data presented by Liss and\nWatson (1998) originally provided by Merlivat (priv. comm.).\nFigure removed due to copyright restrictions.\nWatson, A. J. and Liss, P. S. \"Interactions Between the Marine Biota and Climate\nvia the Carbon and Sulphur Biogeochemical Cycles.\" Phil Trans Roy Soc B 353 (1998): 41-51.\n\n12.742 Marine Chemistry\nLecture 8\nThe data presented above show that both relationships have the same general form, but that the Liss-\nMerlivat formulation must be multiplied by a factor (1.4 to 1.6) to match the data accumulated since its\npublication. It should also be noted that there are large error bars and systematic differences between the\nvarious estimates and approaches, and that the Liss-Merlivat data were originally most dependent on gas-\nexchange rate determinations made in lakes and rivers, which in turn may underestimate open-ocean\nrates. We will discuss the differences between these basic techniques later.\nSea State\nSea state must place a role in gas exchange, but is more difficult to quantify on any large scale. Clearly\nwave-height and wave-type are critical, as well as fetch and wave spectra. By comparing \"continuous\"\nrecords from moored oxygen probes with meteorological data that included wave-height measurements,\nWallace and Wirrick (1992) noted a stronger short term correlation between gas exchange and wave\nheight than with wind speed. Recently techniques using scattering of laser-light have made meaningful\ndeterminations of RMS wave slope both in the laboratory (wind tunnels and flumes) and most recently at\nsea. This provides direct measurements on very local scales, and provides the opportunity to look at actual\nmechanisms. Also, radar backscatter and sea \"brightness\" measurements from satellites hold considerable\npromise of large-scale, regional averages of sea-surface state. This is very exciting because it may permit\nus to obtain truly large-scale or even global averages of gas exchange rates. Such methods, however, are\nstill under development, and will require \"sea-truthing\".\nBubbles\nBubbles are created in the ocean largely by breaking waves (\"white caps\"), and do two important things.\nFirstly, they can enhance gas exchange by\n-\nIncreasing the effective surface area available for gas exchange (the surface of the bubble\nitself adds to the contact area between air and water)\n-\nThe passage of bubbles upward and downward transports gas in large amounts vertically\n-\nThe bubbles tend to stir the surrounding liquid, making more turbulence\nSecondly, they provide a mechanism whereby gases can be supersaturated in water. Bubbles can be\nforced downward by roller-type circulation cells in the upper ocean (often called \"Langmuir Cells\"), and\ncan be carried downward several metres. Bubbles are often \"seen\" (using sonar back-scatter) as deep as 5\n10 m. Since hydrostatic pressure increases at a rate of 1 atmosphere per 10 m depth, these bubbles, if left\ndown there will completely dissolve. Complete dissolution of such bubbles will result in an enrichment of\nespecially the less soluble gases. For example, the trapping and dissolution of 1 ml of air bubbles in a kg\nof seawater would result in the following approximate supersaturations for water at 20°C:\nGas\nAbundance in\nAir\nConcentration in\nWater (cc/ml)\nWater/Air\nRatio\nΔ (%)\nHe\n5.24 x 10-6\n3.8 x 10-8\n0.0075\nO2\n0.21\n5 x 10-3\n0.024\n4.2\nAr\n9.3 x 10-3\n2.5 x 10-4\n0.026\n3.7\nXe\n8.7 x 10-8\n8.9 x 10-9\n0.099\n1.0\nIn the table above we show Δ, the saturation anomaly (the percentage deviation from solubility\nequilibrium). For He, we would have\n\n12.742 Marine Chemistry\nLecture 8\n%\n)\n(\n)\n(\n!\n\"\"\n#\n$\n%%\n&\n'\n(\n)\n*\nHe\nC\nHe\nC\nHe\nwhere C0 is the solubility equilibrium concentration. The effect is strongest for the least soluble gases\n(esp. He) and the contrast is greater at lower temperatures, because of the strong solubility-temperature\ndependence for the more soluble gases. Typically, surface water helium supersaturations are of the order\nof 3-4%, suggesting that of order 0.2 to 0.3 ml/kg of air is trapped, and that contributions of air trapping\nto gases like oxygen are between 1 to 2% at most.\nHowever, things are not as simple as this, since not all bubbles completely dissolve. Large bubbles not\nonly live longer (and hence are more likely to eventually resurface), but enjoy greater buoyancy. The\nhistory of a bubble undergoing compression and decompression will in general be very complicated, as\ngas transport from the bubble under compression will alter the gas composition significantly. Moreover,\nthe export of gas from the bubble will be diffusionally limited, with mass transport being a complex\nfunction of solubility and molecular diffusivity. In general, one has the mass transport being proportional\nto DS where S is 0.5 for a \"clean\" (uncontaminated, or pure) fluid, and S = 0.67 for \"dirty\" (more typical)\noceanic environs. The net mass flux for a given gas is thus a complicated function of bubble trajectory,\nsize and population. These are not well known, and general relationships have only recently been\ndiscussed in the literature. Below is a general bubble size vs. population plot\nCon\ncen\ntra\ntio\nn vs. radius size o\nf bubbles i\nn\nth\ne o\ncean.\nFigure by MIT OCW.\n\n12.742 Marine Chemistry\nLecture 8\nBear in mind that although the population drops off logarithmically with increasing size, the\n4 r\nV\n!\n=\nvolumetric\ncontribution of such bubbles varies as the cube of the radius:\n.\nSurface Films\nSurface films have been shown to be ubiquitous, not only in eutrophic/neritic coastal waters, but to a\nlesser extent in the oligotrophic open ocean. They can have a pronounced effect on fluid turbulence, and\nhence the structure of the microlayer and wave spectra. They arise from the surface concentration of\ndissolved organic matter, including degraded biopolymers and geopolymeric materials. Phytoplankton\nexudates such as polysaccarides are potent surfactants (surface active materials). Material is concentrated\nin the surface microlayer by their\nhydrophobic character, as well as by\nLangmuir circulations (long roll-like\ncells) that concentrate this material near\nconvergence zones. These films are\neffective in thickening the boundary\nlayer (increasing the viscosity),\ndampening turbulence, and suppressing\nthe amplitude of short-wavelength\n(capillary) waves. This can be seen in\nthe pronounced reduction of wave-slope\nby surfactants:\nThe net effect is that surface films suppress gas exchange. This was first noted and documented\nthoroughly in laboratory gas-exchange experiments. The critical point here is that the onset of motions\nimportant for gas exchange is \"pushed\nforward\" to higher wind speeds: it takes more\nenergy to create the boundary layer\nconditions necessary to enable rapid gas\nexchange. The other point is that natural\nsurfactants (note the coastal water points) are\nvery effective in suppressing gas exchange.\nThis strongly suggests that the scatter in the\nempirical data for gas exchange as a function\nof wind speed may be driven by variability in\nthe presence of organic films.\nLan\ngmuir\ncir\nculati\no\nn\ns\n.\nFigure by MIT OCW.\nWi\nnd\ns\npe\ne\nd\n\nv\ns\n.\nt\nriton concentrat\nion.\nFigure by MIT OCW.\n\n12.742 Marine Chemistry\nLecture 8\nGas Exchange Residence Times\nThis is an important concept in geochemistry, akin to the residence time of an element in the ocean.\nSimply put, it is the response time of the upper ocean to a change in the atmospheric composition of a\ngas. The rule of thumb is that\nThe response time for a gas in the ocean mixed layer is the depth of the\nmixed layer divided by the piston velocity for that gas.\nThat is:\nT = H\nk\nwhere H is the mixed layer depth. For helium (Sc ~ 150) in a 100 m mixed layer with a wind speed of\nabout 10 m s-1 the time constant will be\nd\nh\nh\ncm\nm\nT\n5.\n=\n=\n=\n!\nThat is, the He concentration of the mixed layer would respond on a time-scale of 10 days to a\nperturbation. Similarly, for Xe (Sc ~ 750), the time constant would be 24 days.\nThe Carbon Dioxide Exchange Time-Scale\nNow it turns out that this is not the whole story for\nCO2. Because the bulk of CO2 exists in the\ncarbonate-bicarbonate buffer system, then to affect\nthat inventory, you have to move a much larger\namount of CO2 than what you would infer from the\n[CO2]aq alone. For isotopic exchange, the time-scale\nlengthens considerably to:\nT = H\nk\n\"\n# $ %\n& ' (\n)CO2\n[\n]\nCO2(aq)\n[\n]\nSince the ratio of CO2 (aq) to total inorganic CO2\nis roughly 1:100 to 1:200, the timescale for carbon\nisotopic exchange is roughly 10 years!! The time-\nscale for CO2 itself is less because adding CO2\nchanges seawater pH and carbonate system\nspeciation:\nT = H\nk\n\"\n# $ %\n& ' ( 1\nR (\n)CO2\n[\n]\nCO2(aq)\n[\n]\nCO2\nco\nnce\nntr\nati\non\nand\nth\ne R\neve\nll\ne\nfa\nct\nor\n,\np\nlo\ntt\ned\na\nga\ni\nn\ns\nt\nlatitud\ne.\nFigure by MIT OCW.\n\n12.742 Marine Chemistry\nLecture 8\nR \" # CO2(aq)\n[\n]\nCO2(aq)\n[\n]\n$\n%CO2\n[\n]\n# %CO2\n[\n]\nwhere the factor R is the \"Revelle Factor\" and is related to the ratio of the fractional aqueous CO2\nconcentration change to total carbonate change. We will discuss this later in the course, but suffice it to\nsay that R ~ 10 in the surface ocean. In the 100 m, 20°C mixed layer discussed above, the time constant\nfor CO2 would be\nT =\n100 m\n20 cm h\"1\n#\n$ %\n&\n' ( ) 1\n10 )150 = 21d\n(\n) ) 15\n(\n)* 0.9y\nThat is, in addition to being a mediocre diffuser, CO2 has such a large chemical inertia that it's time\nconstant for exchange close to a year, i.e., about 10 times slower than other gases. This has a significant\neffect, for example, in the Gulf Stream, where water is carried northward in the current, and cooled much\nmore rapidly than the CO2 can exchange (i.e., be taken up due to increased solubility). As a result, the\nCO2 becomes greatly undersaturated as water goes northward.\nRadiocarbon Time-scales\nRadiocarbon has an even longer time scale of exchange than CO2. This is because you must move the\nisotope through the entire buffer system to make any change. Thus the gas exchange rate is:\n(\n)\n[\n]\n(\n)\n[\n]\n[\n]\n(\n)\nyears\nO\nC\nT\nCO\nCO\nCO\nT\nO\nC\nT\nGE\naq\naq\nGE\nGE\n4.\n!\n\"\n!\n!\n#\n=\nwhere we have been careful to distinguish the physical gas exchange rate for CO2 (the denominator in the\nabove equation) from the buffered gas exchange rate for CO2. Thus the gas exchange time-scale for\nradiocarbon is increased by a ratio of nearly 200, raising it to a decade! See Broecker and Peng for a more\nthorough discussion of these matters.\nMeasuring Gas Exchange Rates\nMeasuring gas exchange rates is a difficult task for a number of reasons. These reasons will emerge as we\ndiscuss the various approaches that have been used. Primarily they are\n-\nIt is difficult (or impossible) to measure gas fluxes \"directly\"\n-\nIt is impossible to replicate the natural environment\n-\nYou may perturb the processes you are measuring\n-\nGas fluxes are variable on a large variety of space and time scales\n-\nNot all relevant control variables are measured or measurable\nThese difficulties manifest themselves in a large amount of scatter in results. This doesn't mean the\nresults are bad, just that there are significant challenges in making such measurements. These challenges\nhave been met in a variety of ways, and we'll discuss some of the approaches.\n\n12.742 Marine Chemistry\nLecture 8\nThe measurement strategies break down into two basic groups: laboratory and field determinations. The\nlatter could be further subdivided on the basis of scale into open ocean and \"mesocosm\" experiments, and\non the basis of technique into \"direct\" and \"indirect\" determinations. These are summarised as follows:\nLaboratory Measurements:\nThese offer a high degree of control over physical, chemical and biological conditions and allow the\ninvestigator to systematically explore the basic processes involved in gas exchange. These are powerful\ntechniques for building intuition and understanding about basic processes, but provide no direct\nconstraints on the natural \"numbers\" because it is not possible to replicate the natural environment on the\nappropriate scales, or to \"scale up\" the effects due to complicated processes that occur within the\nexperiments.\nExperiments typically occur in \"wind tunnels\" which may be linear, but can also be toroidal. The latter\nare used to overcome \"finite fetch\" problems associated with the linear machines, but all are subject to\ngeometric limitations (e.g., orbital or resonance circulation modes excited in the chambers). It is possible\nto argue that laboratory measurements may systematically under- or over-estimate gas exchange rates,\ndepending on the facility. We will not dwell on this technique, except to mention that there have been\nsuperb studies on the effect of surfactants, etc on gas exchange, e.g., by the Woods Hole group headed by\nNelson Frew.\nField Measurements\nMesocosm\nAnother approach is to measure gas exchange rates in small bodies of water. Studies have been done in\nwave pools, ponds, lakes, rivers, and estuaries. This allows a degree of control, and the possibility of\nmeasuring more \"control variables\" than in the open ocean. Such an approach is a compromise between\nthe laboratory and field experiments, but suffers from the many of the problems of both.\nOpen Ocean\nThere are four basic approaches to open ocean measurements. These include:\n1. Direct flux measurements (eddy-correlation methods): These involve trying to measure\nthe turbulent gas flux directly. They are enormously challenging because they require\nextremely precise, rapid measurement schemes, and are often characterised by the \"noise\"\nbeing as large as (or larger than) the \"signal\".\n2. Tracer release experiments: These constitute a powerful emergent technique where\nmultiple tracers are released and monitored as they are affected by gas exchange. This\nexperimentally demanding, but very rewarding. The experiments, however, are limited to\nintermediate, rather than very large scales.\n3. Tracer balance techniques: This involves calculating the gas exchange from the mass\nbalance of some \"clock\" tracer, such as 222Rn. You are limited to the time-scale and spatial\ncharacteristics of the tracer, but they often provide good integral constraints on the processes.\n4. Remote (Proxy) measurements: Actually not a \"real\" measurement technique, but an\napproach to extrapolate \"local\" measurements via some algorithm to the global scale using\nsatellite measurements.\nDual Tracer Release Experiments\n\n12.742 Marine Chemistry\nLecture 8\nThe most obvious way to measure gas exchange rates is to release a tracer gas in the mixed layer of the\nocean, and track its decrease with time as it outgasses to the atmosphere. This sounds easy, but it's not.\nAs soon as you release a patch of material into the ocean, mixing and stirring tend to spread it out, and\nyou have to sample over increasingly larger areas to sum up what is in the water. This is subject to\nconsiderable errors. The next best thing is to release two tracers, one which is not volatile, and one which\nis. Then you can use the ratio of the two\ntracers to\ntell you the gas exchange rate. The\nproblem\nis that there is at present no ideal \"non\nvolatile\"\ntracer, so a \"less volatile\" tracer is used,\nand\ncorrections are made for its loss by gas\nexchange. The two most commonly used\ntracers\nare 3He (a stable, inert gas without much\noceanic\nbackground concentration) and SF6\nwhich is\nessentially inert, has no natural source,\nand\ndiffuses much more slowly than 3He.\nThe\ntechnique has been applied in small\nwater\nbodies (lakes, rivers, etc.) and has\nrecently\nbeen used at sea. Please read the Watson\net al.\nReference about this technique.\nGraphs removed due to copyright restrictions.\nSource Unknown.\nGraphs removed due to copyright restrictions.\nSource Unknown.\nGraphs removed due to copyright restrictions.\nSource Unknown.\nGraphs removed due to copyright restrictions.\nSource Unknown.\n\n12.742 Marine Chemistry\nLecture 8\nYou are already familiar with a tracer balance technique: the Radon Deficit Technique. This balances gas\nexchange rates against a known clock: the radioactive production (and decay) of 222Rn. The problem with\nthis technique is that it is a \"local\" and \"short term\" measurement: the short half-life of the tracer (4 days)\nmeans that it has a short memory. Even then, one finds variability that probably arises because the time-\nscale is comparable to the meteorological time-scale. As geochemists, we are really interested in\ntechniques that tell us about gas exchange on time-scales ranging from the seasonal to the annual/decadal.\nIt would have been much better if it were much longer or much shorter!\nGas Exchange Rates Using Natural Radiocarbon\nRadiocarbon, as we mentioned before, has a much longer gas-exchange time-scale, and hence provides us\nwith a much longer term average. Radiocarbon (14C) is radioactive with a half-life of 5730 a. Radiocarbon\natoms are born from nuclear reactions caused by cosmic rays in the atmosphere. In the atmosphere they\nimmediately combine with oxygen to become 14CO2. A lot of this 14CO2 ends up in the oceans, because\nthe oceans represent a huge carbonate reservoir. Since this 14CO2 must gas exchange into the oceans, we\ncan use the observed distribution of 14CO2 in the oceans to infer the rate of gas exchange on a global\nscale. This calculation simply rests on the assumption that\nThe rate at which 14CO2 enters the oceans must be balanced by the rate it\ndecays in the ocean.\nThe rate 14CO2 enters the ocean:\nTo estimate the rate radiocarbon enters the ocean, we apply our gas exchange equation:\nFin = k\"C\nNow how do we calculate ΔC? This is the difference between the (bulk) surface water concentration and\nsolubility equilibrium. The latter is easy to calculate:\n[\n]0\nCO\nC\nC\nC\natm\n!\n\"\"\n#\n$\n%%\n&\n'\n=\n(\nThat is, the equilibrium concentration of radiocarbon dioxide would be the isotopic ratio of carbon in the\natmosphere, times the solubility isotope factor, times the equilibrium concentration of CO2. The solubility\nisotope factor arises from the fact that 14CO2 is about 1.5% more soluble than normal CO2. We will make\n\n12.742 Marine Chemistry\nLecture 8\nthe simplifying assumption that the surface carbon dioxide concentration is very close to equilibrium with\nthe atmosphere, so that we have\n[\n]Surf\natm\nCO\nC\nC\nC\n.1\n!!\n\"\n#\n$$\n%\n&\n'\n=\nThe surface radiocarbon dioxide\nconcentration is not such a simple thing to\nfind. We have been talking about natural\nradiocarbon, whereas the atmosphere (and to\nsome extent, the surface ocean) has been\nflooded with radiocarbon produced by\natmospheric nuclear weapons testing in the\n1950s and 1960s. In addition, mankind has\nalso been burning fossil fuels at a great rate,\nand fossil fuels have no radiocarbon, so that\nwe have been diluting the atmospheric\ncarbon dioxide inventory with dead carbon,\nlowering the radiocarbon ratio in the\natmosphere. This his known as the Suess\nEffect. The problem is that we did not have\nmany good measurements of radiocarbon in\nsurface waters before the bomb testing, and none prior to the industrial revolution.\nAbove is a plot of atmospheric\nradiocarbon ratio anomaly (in permil)\nas a function of time. The ratio\nanomaly is referenced to the pre-\nanthropogenic atmospheric ratio. This\ncan be measured in tree-rings back\nmany hundreds of years, and shows\nthat the effects, particularly of bomb-\nradiocarbon are substantial. We must,\ntherefore, infer the pre-anthropogenic\nsurface water radiocarbon ratio from\nother means. These include using 13C\nratios (fossil fuels have very\ncharacteristic ratios compared to\nocean water), and using \"oceanic\nconsistency\" arguments.\nIn a very crude sense, the arguments\nused are to \"extrapolate\" the\nradiocarbon concentrations from\nolder waters where the anthropogenic\ninfluence is very small to surface\nwaters.\nC\n\na\nt\n\nd\ne\np\nt\nh\n\ni\nn 4\nocea\nns.\nFigure by MIT OCW.\nImage removed due to copyright restriction.\n\n12.742 Marine Chemistry\nLecture 8 Change is C14 as a function of depth and latitude\nAnother approach is to measure radiocarbon in banded corals. These corals put down annual layers of\ncalcium carbonate which can be counted backward just like tree-rings. It turns out that they obtain their\ncarbonate (with a small and documentable isotope\nshift) from the inorganic carbon in seawater. Thus they\nact as recorders of surface water radiocarbon.\nYou can clearly see the Suess Effect in the records! In\nany case, we come up with an average surface water\nradiocarbon ratio of about 0.95 times the atmospheric\nratio.\n.\n.\n.0\nAtm\nSurf\nC\nC\nC\nC\n!!\n\"\n#\n$$\n%\n&\n=\n!!\n\"\n#\n$$\n%\n&\nSo now we have:\n[\n]Surf\nAtm\nSurf\nCO\nC\nC\nC\n.0\n!!\n\"\n#\n$$\n%\n&\n'\n=\nAnd we can write the incoming flux as\nFin = k CSurf \" C0\n(\n)\nFin = k 0.95\n14C\n12C\n\"\n# $\n%\n& '\nAtm\nCO2\n[\n]Surf (1.015\n14C\n12C\n\"\n# $\n%\n& '\nAtm\nCO2\n[\n]Surf\n)\n*\n+\n,\n-\n.\nFin = \"0.065k\n14C\n12C\n#\n$ %\n&\n' (\nAtm\nCO2\n[\n]Surf\nwhere the minus sign indicates flux into the ocean.\nCalculating the Oceanic Loss Rate of Radiocarbon\nThe other side of the balance equation is the loss rate of\nthe radiocarbon in the oceans due to radioactive decay.\nThis is the radioactive decay equation.\nN\nFLoss\n!\n\"\n=\nwhere N is the number of radiocarbon atoms per unit\narea of the ocean. (Remember that the gas flux\ncalculated above is per unit area as well). If we have a\nwater column of the ocean (average depth 3800 m) with\n1 m2 area, we have a net volume of 3800 m3. The total\namount of radiocarbon in this volume is\n[\n]Ocean\nOcean\nCO\nC\nC\nN\n!\n\"\"\n#\n$\n%%\n&\n'\n(\n=\n20 Radiocarbon levels over the past 400 years, as evidenced by the coral and tree-ring records.\nC\nh\na\nn\ng\ne\ni\ns\nC1\na\ns\na functi\non of depth and latit\nude.\nFigure by MIT OCW.\nRa\ndi\noc\nar\nbo\nn\nle\nve\nls\no\nve\nr\nth\ne pa\nst 4\n00 y\nears\n, as\nev\nide\nnce\nd b\ny t\nhe\ncor\nal\nand\n\ntr\nee\n-r\nin\ng\nr\ne\nc\no\nr\nd\ns\n.\nFigure by MIT OCW.\n\n12.742 Marine Chemistry\nLecture 8\nExamination of the profiles shown on page 5 of these notes, plus oceanographic sections such this one\ngives a mean oceanic isotopic ratio of about 0.83 times the atmospheric ratio,\nthat is\nwhich gives us\nwhich leads to\nAtm\nOcean\nC\nC\nC\nC\n!!\n\"\n#\n$$\n%\n&\n=\n!!\n\"\n#\n$$\n%\n&\n.0\n[\n]Oceans\nAtm\nCO\nC\nC\nN\n!\n\"\"\n#\n$\n%%\n&\n'\n=\n[\n]Oceans\nAtm\nLoss\nCO\nC\nC\nF\n.0\n!\n\"\"\n#\n$\n%%\n&\n'\n(\n=\nwhere we have used the decay constant for radiocarbon (1/8200 y-1).\nPutting The Fluxes together:\nNow we say that the two fluxes are balanced\nLoss\nin\nF\nF\n=\n[\n]\n[\n]Oceans\nAtrm\nSurf\nAtm\nCO\nC\nC\nCO\nC\nC\nk\n.0\n.0\n!\n\"\"\n#\n$\n%%\n&\n'\n(\n=\n\"\"\n#\n$\n%%\n&\n'\n(\nwhich can gives\n[\n]\n[\n]\ny\nm\nCO\nCO\nk\nSurf\nOceans\n/\n!\n=\nUsing typical surface water CO2 concentrations of 12 μmol/kg and water column ΣCO2 concentrations of\n2200 μmol/kg, we obtain\n,\n!\n=\ny\nm\nk\nor\n!\n=\nh\ncm\nk\nNow to calculate the mean global gas exchange rate relative to Sc = 600, we get a value of about 20 cm/h.\nEstimating Gas Exchange Rates from the Uptake of Bomb-Radiocarbon\nLooking at coral records of radiocarbon allow us to track the surface ocean response to the bomb\nradiocarbon transient. This response can be seen in the records, such as those reported by Druffel and\nSuess.\n\n12.742 Marine Chemistry\nLecture 8\nWhich can be compared to atmospheric \"forcing\" as in the diagram below.\nThis allows us to make an additional\nestimate of the exchange rate. This\napproach is rather model-dependent, but\nyou can at least see in principle how this\nmight be done: you essentially monitor the\nannual change of radiocarbon inventory in\nthe surface layers in response to the\nchanging input by gas exchange. This input\nwill vary with time according to the\ndifference in radiocarbon ratio between the\natmosphere and the surface ocean.\nReferences:\nFor some general discussion on gas exchange, you could look in Broecker and Peng, but the treatment of\ngas exchange models is dated, and downright wrong in places. You could look in Libes' book for a better,\nif elementary treatment. Below are some reference papers in the field.\nLiss, P.S. and A.J. Watson (1998) Report Group 1 - physical processes in the microlayer and the air-sea exchange of\ntrace gases. In The Sea Surface and Global Change. Ed. P.S. Liss and R.A. Duce. Cambridge (ISBN 0521\n56273 2) pp1-33.\nWatson, A.J., Upstill-Goddard, R.C. and Liss, P.C. (1991) Air-sea gas exchange in rough and stormy seas measured\nby a dual tracer technique. Nature 349, 145-147.\nDruffel, E.M. and H.E. Suess (1983) On the radiocarbon record in banded corals: exchange parameters between the\natmosphere and surface ocean. J. Geophys. Res. 88, 1271-1280.\nImage removed due to copyright restriction.\nSource unknown.\nImage removed due to copyright restriction.\nSource unknown.\n\n12.742 Marine Chemistry\nLecture 8\nLiss, P.S. and A.J. Watson (1998) Report Group 1 - physical processes in the microlayer and the air-sea exchange\nof trace gases. In The Sea Surface and Global Change. Ed. P.S. Liss and R.A. Duce. Cambridge (ISBN\n0521 56273 2) pp1-33.\nWallace, D.R.W. and C.D. Wirrick (1992) Large air-sea gas fluxes associated with breaking waves. Nature 356,694\n696.\nWanninkhof, R. (1992) Relationship between wind speed and gas exchange over the ocean. J. Geophys. Res. 97,\n7373-7382.\nAn excellent assortment of articles can be found in a symposium publication entitled \"Air-Water Gas\nTransfer\" B. Jahne and E.C. Monahan (Ed.) AEON Verlag (1995). They tend to be rather specialised, but\nin composite provide you with recent overview of the cutting-edge issues in gas exchange science"
    },
    {
      "category": "Lecture Notes",
      "title": "lec_12_ocn_at_ed.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-742-marine-chemistry-fall-2006/e7c262eb21f6d4297686814435bae703_lec_12_ocn_at_ed.pdf",
      "content": "Introduction to Atmosphere - Ocean Interactions\n- Atmospheric composition\n- Aerosols & greenhouse gases\n- UV radiation and ozone\n- Some examples:\n- Sulfur cycling\n- Dust (iron)\n- Acid rain\n- Halogen chemistry & sea salt particles\n\nVertical levels of the atmosphere\nBoundary Layer: ~ 1 km\nTroposphere: region of strong\nvertical mixing\nStratosphere: region of weak\nvertical mixing\nConsiderable differences in\nsize, chemical nature, sources\nof the aerosols and gases\nTransport across tropopause\nvia large scale ascent in the\ntropics / descent in the poles,\ncloud convection, or\ntropopause folding\nVer\nti\nca\nl\nte\nmp\ner\nat\nur\ne\np\nrof\nile\nof\nth\ne E\nart\nh's\nat\nmosphere.\nFigure by MIT OCW.\n\nAtmosphere - Ocean Interactions in a Nutshell\nClimate relevant gases\nCO2, O2, DMS, ...\nWet and dry deposition\nIron, acid rain, NOx\nTemperature - greenhouse effects\nCloud microphysics\nOzone concentrations\nChemical reaction rates\nRadiation budget\nOxidizing capacity\nHydrological cycle\nAerosols & sea-salts\nDirect deposition\nMixing and stratification\nPhotochemical reactions\nBiological processes\nSunlight is a powerful structuring agent\nEcology\n\nComponents of atmosphere\nN2\nO2\nH20\n0 - 40000\nAr\nC02\nH2\n0.53\nCH4\n1.7\nN20\n0.3\nCO\n0.04 - 0.2\nSO2\n10-4\nH2S\n10-4\nO3\n.1\nppmv\n- ~ 78% nitrogen, 21% oxygen\n- Water vapor is the most variable\ncomponent\n- Trace components can have\nenormous impacts on the radiation\nbudget and inputs to the ocean\n- Lifetimes (residence times) vary from\n107 - 109 years for N2 to days for ozone\nat high altitudes\n- Sources and sinks vary spatially and\ntemporally\n\nAerosols\n- Aerosol = suspension of particles in a gas\n- Liquid = cloud or mist\n- Solid = dust or smoke\n- The direct effect relates to the changes in net radiative\nfluxes in the atmosphere caused by the modulation of\natmospheric scattering and absorption properties due to\nchanges in aerosol concentration and optical properties\n- The indirect effect relates to the changes in net radiative\ntransfer in the atmosphere caused by the modulation of\ncloud properties due to changes in the concentration of\ncloud condensation nuclei, CCN\n\n4 types of aerosol reactions\n1)\nHomogeneous, homomolecular = the condensation of a\nsingle gaseous component to form a new suspended\nparticle (H20 molecules forming droplets)\n2)\nHomogeneous, heteromolecular = reaction of 2 or more\ngases to form a new particle\nNH3(g) + HNO3(g) ⇒NH4NO3(s)\n3)\nHeterogeneous, heteromolecular = reaction of gases\non a pre-existing particle\nNaCl(s) + HNO3(g) ⇒HCl(g) + NaNO3(s)\n4)\nChemical reactions within the aerosols themselves to\nform particles of changed composition (oxidation of\nSO2 to sulfate ions in clouds)\n\nAbsorption and scattering\n- Different gases & aerosols absorb at different λs:\nDirect absorption of UV by ozone (< 290 nm)\n- Scattering is a function of particle size relative to the λ of\nradiation:\nRayleigh scattering: particles are generally small\ncompared to the λs of light (gases)\nMie scattering: particles are generally equal to or greater\nthan the λs of light (aerosols & droplets)\nCCNs are ~0.1 μm containing 108 H20 molecules per drop\n\nEarth's energy budgetDiagram of the Earth's energy cycling in the atmosphere and on the surface.\nFigure by MIT OCW.\n\nGreenhouse gas warming\n- Absorb incoming photons\nand dissipate energy as\nheat\n- Greenhouse gases have\noverlapping infrared\nbands\nPeixoto and Oort, 1992\nSpecies\nremoved\n% trapped radiation\nremaining\nNone\nO3\nCO2\nClouds\nH2O\nH2O, CO2, O3\nH2O,O3,clouds\nAll\nAbs orbt ion\nsp\nect\nr\na o\nf\n\nv\nar\nio\nus\ng\nre\nenh\nous e ga ses\n.\nFigure by MIT OCW.\n\nRadiation at the ocean surface\n- UV-C = λs < 280 nm\n- UV-B = λs 280 - 320 nm\n- UV-A = λs 320 - 400 nm\n- Visible = λs 400 - 700 nm\n- IR = λs 700 nm - 1 mm\nFrom Palmer Station, 2000\n\nThe importance of UV radiation in the ocean\n- Overall a very small % of total\nsolar flux but:\n- Affects biology - protein &\nnucleic acid damage,\ninhibits photosynthesis,\nbacterial production,\nphotoenzymatic repair, etc.\n- Causes photochemical\nreactions\n- Inorganic - Nitrate/nitrite\nphotolysis, Fe(III) reduction to\nFe(II)\n- Organic - DOM breakdown &\nalteration\nFlux regulated by\nOZONE concentrations\n\nStratosphere ozone chemistry\n- Stratosphere is dominated by oxygen atoms and ozone\nrelated reactions\nO2 + hν ( λ < 240 nm) ⇒O(1D) + O(1D)\nO(1D) + O2 + M ⇒O3 + M\nO3 + hν ( λ < 240 nm) ⇒O(1D) + O2\nO(1D) + O3 ⇒2O2\n- UV light converted into heat\n- Ozone can be destroyed by a number of free radical\ncatalysts: OH, NO, Cl, and Br\n- OH and NO are predominately natural while Cl and Br\nhave anthropogenic origins from CFCs\n\nAntarctic ozone hole\n- Very low temps ( < -\n80 C) lead to\nformation of polar\nstratospheric clouds\n- A vortex forms as airF\nigure showing the p\nattern\nof isolat\nion of A\nntarctic\natmosphere f\nrom th\ne rest of ea\nrth.\ncools and descends\nin winter\n- Strong westerly\ncirculation isolates\nthe region from\nlower latitudes\nFigure by MIT OCW.\n\nAntarctic ozone hole\n- PSCs provide\nsurfaces for\nchemical reactions\n- Highly deficient in\noxides of nitrogen\n- Very dry →\ncondensation of\nwater\n- Catalytic destruction\nof ozone\nCl2 + hν ⇒Cl + Cl\nCl + O3 ⇒ClO + O2\nClO + O ⇒Cl + O2\nPhotoche\nmistry a\nnd dynam\nics in t\nhe pol\nar strat\nosphere.\nFigure by MIT OCW.\n\nAntarctic stratospheric ozone hole 2005\nFigure courtesy NASA GSFC\n1 Dobson unit = column ozone compressed to 10 um thick at STP\n\nChemistry in the troposphere\n- Troposphere oxidation reactions are initiated by the\nhighly reactive hydroxyl radical (OH) during the day\nO3 + hν ⇒O2 + O(1D)\nan electronically excited state of the oxygen atom, O(1D)\ncan then react with methane or water\nO(1D) + H2O ⇒OH + OH\nO(1D) + CH4 ⇒OH + CH3\n- And nitrate radicals at night (nitrate is rapidly photolyzed)\nNO2 + O3 ⇒NO3 + O2\n- Govern fates of almost all trace gases in the troposphere\n\nRadiation Forcing\n- Our estimates\nare 'best' for the\ngreenhouse\ngases and\ndecrease in\ncertainty for\nozone\nprocesses and\nmineral and\nsulfate aerosols\nFigu re sho wing l ow\nleve\nls\nof s\ntra\ntosp\nher\nic o\nzon\ne ov\ner\nthe\nant\narct\nic.\nFigure by MIT OCW.\n\nNow some examples of compounds that are\nof great interest in the ocean....\n\nBiogenic sulfur cycle\nCLAW hypothesis after Charlson et al., 1987\n# concentration\nof cloud droplets\nDMSg\nDMSaq\nSea to air transport\nSulfate\nAerosols\nSO4\n2-\nOxidation\nCloud condensation\nnuclei (CCN)\nCloud nucleation\nCloud\nalbedo\nLoss of solar\nradiation\nSurface\ntemp. of\nEarth\nSolar\nirradiance\nat ocean sfc\nMarine ecology and phytoplankton\nabundance, speciation, and synthesis\nrates of precursor, DMSP\nChange in cloud\noptical thickness\nAtmospheric acidity\n& sulfur transport to\ncontinents\nA negative\nclimate\nfeedback loop\nto stabilize\ntemperature?\n\nSulfur flux\n- DMS contributes > 90% of the oceanic sulfur flux and >\n50% of the global biogenic flux\n- Estimated anthropogenic sources of sulfur are\napproximately three times larger than biogenic sources BUT\nthe lifetimes are much shorter\nSulfur\nDioxide\nDecay of vegetation\nSea-spray\nSO2\nVolcano\nPhytoplankton DMS\nOil refining\nCoal and Oil\nCombustion\nUpper Troposphere: Less than 20% of the\nsulfate is from anthropogenic sources\nDerived mostly from DMS\nSulfate\nAerosols\nSO4\n2-\nDeep\nconvective\nevents\n\nDMS impacts atmospheric chemistry\nDMS\nSO2\nH2SO4\nCS2\nCOS\nWet or dry\ndeposition\nWet or dry\ndeposition\nNO3\nnight\nOH\nday\nOH\nOH\nMSA\nor\nDMSO\nH2S\nOH\nOH\nOH, hν\nHydrogen sulfide\nOH or IO (DMSO)\nCarbonyl sulfide\nCarbon\ndisulfide\nSulfuric acid\nMethanesulfonate\nDimethylsulfoxide\nH2O2\n- Acid rain - in the North Sea\nregion DMS can account for up\nto 25% of the tropospheric\nH2SO4 over Europe\n- Is thought to be the source of\nthe stratospheric COS layer and\nbackground atm. levels of MSA,\nSO2, and nssSO4\n2-\n\nIron Cycling - Mineral aerosols\n- In the equatorial Pacific, the subarctic Pacific, and the\nSouthern Ocean nitrate and phosphate concentrations\nare high year round and standing stocks of\nphytoplankton are always low =\nHigh Nitrate Low Chlorophyll (HNLC) regions\n- Iron limitation?? (1988, Martin and Fitzwater)\n- Fe(III) versus Fe(II)\nInput of new iron to the surface\nwaters is dominated by the\natmospheric deposition of\nsoluble iron in mineral aerosols\n(wet & dry deposition)\nJickells et al., 2005\nSource\ns an\nd Fluxes of Iron in the Ocean.\nFigure by MIT OCW.\n\nIron in the ocean\n- Sub-nanomolar concentrations in surface waters\n- Fe is extremely insoluble in oxygenated seawater, so the\nbio availability of Fe is controlled by presence of organic\nligands that enhance Fe solubility\nImage removed due to copyright restrictions.\n\nDust variability\n- Dust (iron) input to the ocean is highly variable:\n- Spatially\n- Seasonally (rainfall & transport patterns) & glacial-interglacial\n- Episodic (wind speed)\n- Solubility\nImage removed due to copyright restrictions.\n\nDust transport examples\nSeaWiFS image from Feb 28, 2000\nImage Courtesy NASA GSFC\nRainfall sample from Sargasso Sea, July 2004\n\nNitrogen deposition\n- Nitrous oxide from the ocean contributes ~4 Tg yr-1 to\nthe atmosphere (upwelling and deep convective areas)\nO(1D) + N2O ⇒NO + NO\n- Anthropogenic sources of NOx (NOx = NO + NO2) are\nfossil fuels, biomass burning, and fertilizer\n- NOx chemistry in stratosphere:\nNO + O3 ⇒NO2 + O2\nOH + NO2 + M ⇒HNO3 + M\n(M = species which dissipates energy)\n- HNO3 nitric acid is highly soluble in droplets = wet\ndepositions\n- Photolysis of NO2 is the only known way of producing\nozone in the troposphere\n\nAcid Rain\n- Natural precipitation is slightly acidic (~ 5.6)\n- HNO3 & H2SO4 decrease pH & deliver N and S to the\nsurface oceanGlobal pattern of acidity of precipitation.\nFigure by MIT OCW.\nGlobal\npat\nter\nn o\nf a\ncid\nity\nof\npr\neci\npit\nati\non.\n\nHalogen chemistry\n- Organic biogenic oceanic sources: methyl halides\nCH3Cl, CH3Br, CH3I\n- CH3Cl, CH3Br have lifetimes > 1 year wrt OH so they can\nreach the stratosphere and function as catalytic species\nin O3 chemistry\n- Inorganic sources: sea salt which is 'activated'\nNaCls + ClONO2g ⇒Cl2g + NaNO3s\nCl2 is readily photolyzed in the troposphere\n- Sea-salt particles are an important removal pathway\n(reaction surface) of nitrogen oxides in the marine\ntroposphere:\nHNO3(g) + NaCl(s,aq) --> NaNO3(s,aq) + HCl(g)\nThis affects the NOx partitioning and the ozone chemistry\n\nSummary\n- Atmospheric gases and aerosols impact the\nglobal radiation and heat budget\n- Trace constituents dominate these effects\n- The reaction pathways and feedback\nmechanisms are often complex, interrelated,\nand cyclical making climate change estimates\ndifficult\n- Many biogeochemical cycles deliver key\nsubstances to the ocean (iron, nitrogen, sulfur)\nand vice versa"
    }
  ]
}