{
  "course_name": "Materials for Biomedical Applications",
  "course_description": "This class provides an introduction to the interactions between cells and the surfaces of biomaterials. The course covers: surface chemistry and physics of selected metals, polymers, and ceramics; surface characterization methodology; modification of biomaterials surfaces; quantitative assays of cell behavior in culture; biosensors and microarrays; bulk properties of implants; and acute and chronic response to implanted biomaterials. General topics include biosensors, drug delivery, and tissue engineering.",
  "topics": [
    "Engineering",
    "Biological Engineering",
    "Biomaterials",
    "Cell and Tissue Engineering",
    "Materials Science and Engineering",
    "Engineering",
    "Biological Engineering",
    "Biomaterials",
    "Cell and Tissue Engineering",
    "Materials Science and Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nSubject Description\n\nThis class provides an introduction to the interactions between cells and the surfaces of biomaterials. The course covers: surface chemistry and physics of selected metals, polymers, and ceramics; surface characterization methodology; modification of biomaterials surfaces; quantitative assays of cell behavior in culture; biosensors and microarrays; bulk properties of implants; and acute and chronic response to implanted biomaterials. General topics include biosensors, drug delivery, and tissue engineering.\n\nPrerequisites\n\n8.01; 8.02;\n3.091\n,\n5.111\n, or\n5.112\n;\n7.012\n,\n7.013\nor\n7.014\n;\n3.012\n,\n5.60\n, or 2.40.\n\nTexts\n\nRatner, Buddy D., et al.\nBiomaterials Science: An Introduction to Materials in Medicine\n. 2nd ed. Burlington, MA: Academic Press, 2004. ISBN: 9780125824637.\n\nSupplemental Handouts.\n\nHomework\n\nApproximately biweekly (7 problem sets).\n\nTests\n\nTwo quizzes and one final exam.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework*\n\n40%\n\nQuiz 1\n\n15%\n\nQuiz 2\n\n15%\n\nFinal Exam\n\n30%\n\n* weighting may vary\n\nNote:\nStudents may discuss homework problems, but should write up solutions independently. Quizzes and final are closed-book exams.\n\nCalendar\n\nSeveral lectures are given by the course TA Dr. Ikuo Taniguchi.\n\nSES #\n\nTOPICS\n\nASSIGNMENTS\n\nCourse Introduction\n\nBiomaterials Defined\n\nStructural Hierarchy in Materials and Biology\n\nProblem set 1 assigned\n\nBiomaterials Surfaces: Physics\n\nSurface (vs. Bulk) Structure and Properties\n\nSurface Energy\n\nAdsorption, Segregation, and Reconstruction at Surfaces\n\nBiomaterials Surfaces: Chemistry\n\nReactions at Surfaces: Chemisorption, Corrosion\n\nBiomaterials Surfaces: Chemistry (cont.)\n\nHydrolysis (Dr. Taniguchi)\n\nProblem set 1 due\n\nProblem set 2 assigned\n\nProtein-Surface Interactions\n\nProteins: Structure, Properties, Functions\n\nProtein Adsorption: Langmuir Model\n\nProtein-Surface Interactions (cont.)\n\nProtein Adsorption: Complex Phenomena, Measurement\n\nProblem set 2 due\n\nProblem set 3 assigned\n\nCell-Surface Interactions: Host Response to Biomaterials\n\nCell Adhesion Mechanisms\n\nCoagulation Cascade\n\nCell-Surface Interactions: Host Response to Biomaterials (cont.)\n\nImmune Response: Alternative Complement Activation\n\nSurface Modification Methods\n\nPurposes\n\nPlasma Treatments\n\nOrganic Coatings (Dr. Taniguchi)\n\nProblem set 3 due\n\nQuiz 1\n\nSurface Modification Methods (cont.)\n\nPolymer Coatings\n\nPatterned Surfaces\n\nProblem set 4 assigned\n\nSurface Characterization\n\nIn Vacuum: XPS/ESCA, AES, SIMS\n\nSurface Characterization In situ\n\nContact Angle, AFM\n\nProblem set 4 due\n\nQuantifying Cell Behavior\n\nCell Cultures\n\nCellular Assays: Adhesion, Migration, Proliferation\n\nProblem set 5 assigned\n\nQuantifying Cell Behavior (cont.)\n\nCellular Assays: Differentiation, Function\n\nStatistical Analysis\n\nError Sources, Distribution Functions, t- test\n\nStatistical Analysis (cont.)\n\nFisher Test, Regression Methods\n\nProblem set 5 due\n\nProblem set 6 assigned\n\nBiosensors and Diagnostic Devices\n\nBiological Elements\n\nTransduction Mechanisms\n\nProperties\n\nExamples: Fiber Optic Biosensors, Nanobarcodes\n\nProblem set 6 due\n\nQuiz 2\n\nDrug Delivery: Controlled Release (Dr. Taniguchi)\n\nChemically-controlled Devices\n\nDrug Delivery: Controlled Release (cont.)\n\nDiffusion-controlled, Membrane-based and Osmotic Devices\n\nProblem set 7 assigned\n\nDrug Delivery: Controlled Release (cont.)\n\nMethods: Transdermal, Colloidal Vehicles\n\nMechanical Pumps\n\nBiomaterials for Organ Replacement\n\nOrgan Replacement Therapies\n\nMechanical Properties\n\nBone Substitutes\n\nTissue Engineering\n\nCell Types; Approaches: In vitro, In vivo, Ex vivo/Cell Encapsulation\n\nScaffolds: Design and Fabrication\n\nProblem set 7 due\n\nTissue Engineering (cont.)\n\nCase Examples: Artificial Pancreas, Cartilage, Nerve Regeneration\n\nFDA Regulatory Issues and Course Evaluations\n\nFinal Exam",
  "files": [
    {
      "category": "Resource",
      "title": "ps1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/7fb9d1b982b7bdd070b664d1fcd2d5ce_ps1_sol.pdf",
      "content": "3.051J/20.340J Problem Set 1 Solutions\n1. (12 pts) Bone tissue engineering generally involves the implantation of a synthetic or\nbiologically derived material that upon implantation allows for bone in-growth and\neventual replacement. In a recent publication, De Groot and coworkers (Tissue Eng.\n2003, 9, 535) compared the structures of 3 commercially produced biphasic calcium\nphosphate (BCP) porous scaffolds for bone tissue engineering. BCP is a two phase\nmaterial of hydroxyapatite and tricalcium phosphate. SEM images below illustrate cross-\nsections of the scaffolds manufactured by Zimmer (left image), Dytech (middle image)\nand IsoTis (right image). Scale bar is 1 mm.\nImage removed for copyright reasons.\nSee Fig. 3, top images, in Li, Shihong, Joost de Wijn, Jiaping Li, Pierre Layrolle, and\nKlaas de Groot. \"Macroporous Biphasic Calcium Phosphate Scaffold with High\nPermeability/Porosity Ratio.\" Tissue Eng 9 (2003): 535-548.\na) (4 pts) What aspects of the primary chemical structure, higher order (meso) structure\nand/or microstructure make these scaffolds useful for bone tissue engineering?\nCalcium phosphate is chosen for this application because it can be resorbed in vivo\nthrough action by osteoclasts (bone remodeling cells) and is biocompatible\n(hydroxyapatite is the mineral component of bone.) The porous microstructure\nenables bone cells to penetrate the structure and allows transport of vital nutrients.\nb) (6 pts) Download the article by De Groot and coworkers through the MIT library.\nWhat processing approaches resulted in the dramatically different pore morphologies\nobserved in the SEM images for the 3 BCP scaffolds?\nThe BCP scaffold by Zimmer was prepared by compressing hydroxyapatite (HA)\nand tricalcium phosphate (TCP) powders with naphthalene particles, followed by\npyrolisis of the naphthalene and sintering to produce the porous structure shown.\nThe Dytech scaffold was produced by foaming a slurry of HA and TCP powders,\nwater and surfactant with nitrogen, followed by calcination and sintering. The\nIsoTis scaffold was prepared by molding a mixture containing a BCP slurry,\npolymethyl methacrylate (PMMA), MMA monomer, and naphthalene, followed by\npyrolysis of the organic components and sintering.\nc) (2pts) A table of the scaffold porosities and specific permeabilities measured by De\nGroot and coworkers is provided below. Explain why the IsoTis scaffold, with the lowest\nporosity, exhibits the highest permeability.\n\n3.051J/20.340J Problem Set 1 Solutions\nManufacturer\nSpecific permeability (m2)\nPorosity (%)\nZimmer\n0.02 × 10-9\nDytech\n0.12 × 10-9\nIsoTis\n0.34 × 10-9\nThe permeability of the IsoTis scaffold is highest because of the interconnectivity of\nits pores. The methods of manufacture for the Zimmer and Dytech scaffolds led to\nmore isolated pores that are not as useful for tissue engineering.\n2) (16 pts) Recently, Yokoyama and coworkers described the preparation of protein-\nresistant surfaces on polystyrene (PS) through the addition of 10% of a block copolymer\nadditive (PS-b-PME3MA) whose structure is shown below (A. Oyane et al., Adv. Mater.\n2005, 17, 2329; H. Yokoyama et al., Macromol. 2005, 38, 5180). Contact angle\nmeasurements performed on annealed blends with different block copolymer contents are\nalso shown.\na) (3 pts) Explain why the advancing contact angle first decreases then plateaus as the\nblock copolymer content in the blend is increased.\nAs block copolymer is added to the blend, it segregates to the blend surface with the\nPME3MA block located preferentially at the surface. As the block copolymer\ncontent reaches ~20%, the surface is saturated with block copolymer, so that\nfurther addition does not result in a further decrease in contact angle.\nb) (6 pts) What possible energetic driving forces might lead to the phenomenon in (a)?\nThe surface segregation of the block copolymer may be driven by entropic and\nenthalpic forces, including i) a positive enthalpy of mixing for PS and PME3MA,\nwhich favors exclusion of PME3MA from the bulk film; ii) lower surface energy of\nthe methyl groups on the side chains of PME3MA; and iii) chain end localization at\nthe surface to reduce entropic penalties associated with surface restrictions on\npolymer chain conformations.\nc) (3 pts) Based on the contact angle data, approximate the composition of the surface for\n10 wt% bulk concentration of PS-b-PME3MA.\nRearranging Cassie's equation, fPS = cos θ - cos θBC\ncos θPS - cos θBC\n\nFrom advancing angle data at fPS = 1, 0.9 and 0,\n\n3.051J/20.340J Problem Set 1 Solutions\ncos 90 - cos 72\nfPS =\n= 0.69\ncos 98 - cos 72\nThe surface fraction of block copolymer is therefore 0.31 for 0.1 bulk concentration.\nd) (2 pts) For blend systems with >20% block copolymer, what is the molecular origin of\nthe large hysteresis in the contact angle (i.e., the much lower receding contact angle value\ncompared with the advancing angle)?\nThe PME3MA blocks located at the surface initially arrange so that the low energy\n-CH3 groups are oriented upwards, giving rise to a relatively high advancing angle.\nOnce underneath the water droplet, the chains rearrange to place the hydrophilic\nethylene oxide groups in contact with water. This is the surface sampled when the\nliquid is withdrawn in a receding angle measurement.\ne) (2 pts) How might the contact angle results change if the terminal group of the\nmethacrylate side chain were changed to a hydroxyl (-OH)?\nExchanging the methyl groups with -OH groups would create a more hydrophilic\nsurface and lead to a lower advancing angle, assuming the methacrylate block\nlocalizes at the surface. From an energetic standpoint, -OH groups might reduce\nthe miscibility of the methacrylate block with PS, increasing the driving force for\nPME3MA surface segregation. However, replacing the nonpolar methyl groups\nwith the more polar hydroxyl groups lowers the driving force for chain end\nsegregation at the surface.\nImage removed for copyright reasons.\nPlease see: Scheme 1 and Fig. 9 in Yokoyama, H., T. Miyamae, S. Han, T. Ishizone,\nK. Tanaka, A. Takahara, and N. Torikai. \"Spontaneously Formed Hydrophilic Surfaces\nby Segregation of Block Copolymers with Water-Soluble Blocks.\" Macromolecules 38\n(2005): 180-5189.\n\n3.051J/20.340J Problem Set 1 Solutions\n3) (12 pts) Chen et al. investigated adhesion of endothelial cells on titanium oxide\ncoatings as a possible surface treatment to reduce thrombogenesis on arterial stents.\n(Surface & Coatings Tech. 2004, 186, 270). X-ray diffraction measurements revealed the\nas-prepared coatings to be amorphous, while coatings heat-treated for 0.5 hours at 700 °C\nwere crystalline. Contact angle measurements were made utilizing different liquids to\ndetermine values for the polar and disperse components of the surface energy, as listed in\nthe table below.\na) (3 pts) Can the work of cohesion for titanium oxide be estimated from the\nmeasurements of Chen et al.? Explain.\nThe titanium oxide surfaces are not pure oxide interfaces, since the measured\nsurface energies are an order of magnitude lower than one might expect for a metal\noxide. Thus the work of cohesion cannot be accurately calculated from these\nmeasured values.\nb) (3 pts) What chemical groups might you expect to observe on the titanium oxide\nsurface?\nIt is likely that water and carbon dioxide from the atmosphere have chemisorbed on\nthe surface. One could expect to find -OH groups from water adsorption, and CO3\n2-\ngroups. Hydrocarbons might also be physisorbed on the surface.\nc) (2 pts) Why is the measured surface energy of the titanium oxide coating lower after\nheat treatment?\nDuring crystallization, the atoms rearrange to allow lower energy planes to facet the\nsurface, reducing the oxide surface energy relative to the amorphous oxide surface.\nd) (4 pts) Based on the surface energies provided, calculate the work of adhesion between\nthe surface and water for the amorphous and crystalline coatings. How might this\ninfluence protein adsorption?\nmaterial\nγp (dyn/cm)\nγd (dyn/cm)\nγ (dyn/cm)\namorphous\ntitanium oxide\ncrystalline\ntitanium oxide\nwater\nThe work of adhesion between water and the crystalline oxide is given by:\n\n3.051J/20.340J Problem Set 1 Solutions\np\nd\nWCW = 2(γ γ p )1/ 2 + 2(γ γ\nd )1/ 2 = 101 dyn/cm\nC\nW\nC\nW\nThe work of adhesion between the amorphous oxide and water can be similarly\ncalculated as:\nWAW = 131 dyn/cm\nThe higher work of adhesion of water to the amorphous phase might suggest that\nwater molecules will be more difficult to displace by proteins on the amorphous\nsurface than the crystalline surface."
    },
    {
      "category": "Resource",
      "title": "ps1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/9016d410e91fbdccef6e033099bf6563_ps1.pdf",
      "content": "3.051J/20.340J Problem Set 1\ndue 2/16/06\n1. (12 pts) Bone tissue engineering generally involves the implantation of a synthetic or\nbiologically derived material that upon implantation allows for bone in-growth and\neventual replacement. In a recent publication, De Groot and coworkers (Tissue Eng.\n2003, 9, 535) compared the structures of 3 commercially produced biphasic calcium\nphosphate (BCP) porous scaffolds for bone tissue engineering. BCP is a two phase\nmaterial of hydroxyapatite and tricalcium phosphate. SEM images below illustrate cross-\nsections of the scaffolds manufactured by Zimmer (left image), Dytech (middle image)\nand IsoTis (right image). Scale bar is 1 mm.\nImage removed for copyright reasons.\nSee Fig. 3, top images, in Li, Shihong, Joost de Wijn, Jiaping Li, Pierre Layrolle, and\nKlaas de Groot. \"Macroporous Biphasic Calcium Phosphate Scaffold with High\nPermeability/Porosity Ratio.\" Tissue Eng 9 (2003): 535-548.\na) What aspects of the primary chemical structure, higher order (meso) structure and/or\nmicrostructure make these scaffolds useful for bone tissue engineering?\nb) Download the article by De Groot and coworkers through the MIT library. What\nprocessing approaches resulted in the dramatically different pore morphologies observed\nin the SEM images for the 3 BCP scaffolds?\nc) A table of the scaffold porosities and specific permeabilities measured by De Groot\nand coworkers is provided below. Explain why the IsoTis scaffold, with the lowest\nporosity, exhibits the highest permeability.\nManufacturer\nSpecific permeability (m2)\nPorosity (%)\nZimmer\n0.02 × 10-9\nDytech\n0.12 × 10-9\nIsoTis\n0.34 × 10-9\n\n3.051J/20.340J Problem Set 1\ndue 2/16/06\n2) (16 pts) Recently, Yokoyama and coworkers described the preparation of protein-\nresistant surfaces on polystyrene (PS) through the addition of 10% of a block copolymer\nadditive (PS-b-PME3MA) whose structure is shown below (A. Oyane et al., Adv. Mater.\n2005, 17, 2329; H. Yokoyama et al., Macromol. 2005, 38, 5180). Contact angle\nmeasurements performed on annealed blends with different block copolymer contents are\nalso shown.\na) Explain why the advancing contact angle first decreases then plateaus as the block\ncopolymer content in the blend is increased.\nb) What possible energetic driving forces might lead to the phenomenon in (a)?\nc) Based on the contact angle data, approximate the composition of the surface for 10\nwt% bulk concentration of PS-b-PME3MA.\nd) For blend systems with >20% block copolymer, what is the molecular origin of the\nlarge hysteresis in the contact angle (i.e., the much lower receding contact angle value\ncompared with the advancing angle)?\ne) How might the contact angle results change if the terminal group of the methacrylate\nside chain were changed to a hydroxyl (-OH)?\nImage removed for copyright reasons.\nPlease see Scheme 1 and Fig. 9 in Yokoyama, H., T. Miyamae, S. Han, T. Ishizone,\nK. Tanaka, A. Takahara, and N. Torikai. \" Spontaneously Formed Hydrophilic Surfaces\nby Segregation of Block Copolymers with Water-Soluble Blocks.\" Macromolecules 38\n(2005): 5180-5189.\n3) (12 pts) Chen et al. investigated adhesion of endothelial cells on titanium oxide\ncoatings as a possible surface treatment to reduce thrombogenesis on arterial stents.\n(Surface & Coatings Tech. 2004, 186, 270). X-ray diffraction measurements revealed the\nas-prepared coatings to be amorphous, while coatings heat-treated for 0.5 hours at 700 °C\nwere crystalline. Contact angle measurements were made utilizing different liquids to\n\n3.051J/20.340J Problem Set 1\ndue 2/16/06\ndetermine values for the polar and disperse components of the surface energy, as listed in\nthe table below.\na) Can the work of cohesion for titanium dioxide be estimated from the measurements of\nChen et al.? Explain.\nb) What chemical groups might you expect to observe on the TiO2 surface?\nc) Why is the measured surface energy of the titanium oxide coating lower after heat\ntreatment?\nd) Based on the surface energies provided, calculate the work of adhesion between the\nsurface and water for the amorphous and crystalline coatings? How might this influence\nprotein adsorption?\nmaterial\nγp (dyn/cm)\nγd (dyn/cm)\nγ (dyn/cm)\namorphous\ntitanium oxide\ncrystalline\ntitanium oxide\nwater"
    },
    {
      "category": "Resource",
      "title": "ps2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/0bcdd204fcba8dc4a2b1c1e8cf1d5cf7_ps2_sol.pdf",
      "content": "3.051J/20.340J Problem Set 2 Solutions\n1. (21 pts) CoCrMo alloys form a passivating oxide on their surface that renders them\nuseful for orthopaedic implants. Such implants remain susceptible, however, to fretting\ncorrosion, which occurs as a consequence of repetitive rubbing of the implant against a\nsecond hard surface (e.g., another implant component or bone). To study fretting\ncorrosion, Contu et al. (Corrosion Sci. 2005, 47, 1863) employed a tribo-electrochemical\ncell, illustrated below, employing a CoCrMo alloy (66:28:6 wt ratio Co:Cr:Mo) as the\nworking electrode, Pt wire as the counter electrode and a saturated calomel electrode\n(SCE) as the reference electrode (SCE is +0.231V on the standard hydrogen electrode\n(SHE) scale.) A ceramic tube in contact with the sample was rotated periodically to\ncreate a rubbing action on the surface. Dissolved oxygen was removed from electrolyte\nsolutions by bubbling with argon gas for 24 h prior to the experiments. The figure below\nshows data for the open circuit potential (OCP) measured before, during and after 3\nrotations of the ceramic tube in buffered solutions at pH 4 (solid) and pH 7 (dashed).\nImages removed for copyright reasons.\nSee Fig. 1 and Fig. 2(a) in Contu, F., B. Elsener, and H. Bohni. \"Corrosion Behaviour of\nCoCrMo Implant Alloy During Fretting in Bovine Serum.\" Corrosion Science 47 (2005):\n1863-1875.\n\n3.051J/20.340J Problem Set 2 Solutions\na) (4 pts) Why does the OCP first drop rapidly then rise rapidly and plateau following\neach abrasion of the alloy surface by the ceramic tube?\nStresses on the oxide layer at the alloy surface induced by rubbing cause breaks in\nthe oxide film that expose pure metal to the electrolyte solution, increasing the\nmagnitude of the measured OCP. Immediately upon exposure, the bare metal\nbegins to react with water to reform an oxide layer at the surface. With increasing\ntime, the oxide growth becomes limited by ion diffusion through the oxide and the\npotential plataeaus.\nb) (6 pts) Write the expected anodic half-reaction(s) for this alloy at pH 4. Based on this\nreaction and the Nernst equation, provide an expression for the measured electrical\npotential across the rubbed alloy surface.\nExpected anodic reactions include:\nCo → Co2+ + 2e\nCr → Cr2+ + 2e\nThe Nernst equation for metal oxidation is\nn+ ]\n[M\nE\nE0 + RT ln\n=\nnF\n[\n]\nM\nNoting that the SCE electrode is +0.231V from the standard hydrogen electrode\n(SHE) scale, the standard electrochemical potentials ∆E0 for Co and Cr can be\nobtained from Table 5 on pg. 432. The atomic fraction of Co and Cr are 65 and\n31%, calculated from the weight fractions provided.\nThe resulting expressions for the measured potentials from these reactions would\nbe:\n(\nE V ) = -0.511+ 0.0591log [Co2+ ] = -0.506 + 0.0295 log[ Co\n2+ ]\n[Co]\n2+ ]\n(\nE V ) = -0.961+ 0.0591log [Cr 2+ ] = -0.946 + 0.0295 log[ Cr\n[Cr]\nc) (4 pts) What is the expected cathodic half reaction at pH 4 and pH 7 for this\nexperiment?\nSince dissolved oxygen has been removed from the electrolyte solution, the cathodic\nhalf-reactions will involve other species:\n\n3.051J/20.340J Problem Set 2 Solutions\nFor pH 4: 2H+ + 2e → H2 (g)\nFor pH 7 and higher one might alternately observe the reaction:\n2H2O + 2e → H2 (g) + 2OH-\nd) (2 pts) Why is the OCP measured at pH 4 higher than the value measured at pH 7?\nThe anodic half-reaction can only take place when there is a corresponding cathodic\nreaction that consumes the electrons created. The associated potential for the\ncathodic reaction will depend upon pH. For example, the Nernst equation for the\nhydrogen evolution reaction is:\nE\n∆\n= ∆\n\nEH2 + 0.0591log aH +\nwhere ∆EH2 would be 0 V for the SHE. Since pH is defined as:\npH = -log a , the measured potential will drop as pH increases, because the\nH +\nconcentration (activity) of H+ ions is lower.\ne) (2 pts) Why does the open-circuit potential after rubbing plateau to a different value\nthan the original measured OCP for this alloy?\nThe difference in equilibrium potential reflects a change in the structure or\nchemistry of the oxide layer formed after rubbing.\nf) (3 pts) The figure below provides data from cathodic polarization (increase in the\ncathodic reaction relative to anodic reaction) experiments at pH 4 for the CoCrMo alloy\nin electrolyte solution (phosphate buffer) vs. serum. Shown is the measured current\ndensity as a function of the potential. Provide an explanation for the reduced current\nmeasured in serum compared to buffer. Would this be a favorable or unfavorable effect in\nvivo?\nImage removed for copyright reasons.\nSee Fig. 4(a) in Contu, F., B. Elsener, and H. Bohni. \"Corrosion Behaviour of CoCrMo\nImplant Alloy During Fretting in Bovine Serum.\" Corrosion Science 47 (2005): 1863-1875.\n\n3.051J/20.340J Problem Set 2 Solutions\nProtein molecules in serum would be expected to adsorb on the metal surface,\nimpeding the kinetics of the cathodic reaction. This would be a favorable effect in\nvivo as the reduced current means a reduced corrosion rate of the alloy.\n2. (19 pts) Catalase is an enzyme (mol. wt.: 247kDa, diameter: 10.5 nm) found in liver\ncells that catalyses the conversion of hydrogen peroxide to water and oxygen. Its\ncatalytic activity is of interest for biosensor applications. As an approach for\nfractionating catalase from biological solutions, Jia and coworkers (Int. J. of Biol.\nMacromol. 2005, 37, 42) prepared chitosan microspheres coated with a covalently\nattached dye, Cibacron Blue F3GA, which exhibits strong binding to catalase. The figure\nbelow shows an SEM image of the chitosan particles. The wet density of the spheres was\nfound to be 1.328 g/mL. Adsorption studies were performed to determine the amount of\ncatalase adsorbed to the particles as a function of solution concentration. An adsorption\nisotherm for pH 7 is shown below.\nImages removed for copyright reasons.\nSee Fig. 1 and 4 in Shentu, Jingling, Jianmin Wu, Weihua Song, and Zhishen Jia. \"Chitosan\nMicrospheres as Immobilized Dye Affinity Support for Catalase Adsorption.\" International\nJournal of Biological Macromolecules 37 (2005): 42-46.\na) (5pts) Assuming a Langmuir model, determine the affinity constant Ka and the\nmaximum surface coverage Γmax for CAT adsorption on the dye-linked chitosan beads.\n[CAT] (mg/mL)\n1/[CAT] (mL/mg)\nΓ (mg/g)\n1/Γ (g/mg)\n0.03\n33.\n2.5\n0.4\n0.13\n7.7\n0.14\n0.53\n1.9\n17.5\n0.057\n1.13\n0.89\n23.5\n0.043\n1.80\n0.56\n0.042\n2.50\n0.40\n24.5\n0.041\n\n3.051J/20.340J Problem Set 2 Solutions\nNoting that ν = Γ/Γmax , the Langmuir equation can be expressed as:\n=\n+\nΓ\n[ ]\nP K Γ\nΓ\na\nmax\nmax\nPerforming linear regression on the data gives a best-fit line of:\n1//Γ = 0.011/[CAT] + 0.039\nfrom which we obtain Γmax = 25.6 mg/g and Ka = 3.55 mL/mg\n1/Γ ( g/mg)\n0.5\n0.4\n0.3\n0.2\n0.1\n1/[CAT] (mL/mg)\nb) (6 pts) From the obtained value for Γmax, calculate the effective area per protein,\nstating any assumptions you make.\nThe effective area per protein can be computed from:\nM protein\n=\nAeff\nN Av Γmax\n\n3.051J/20.340J Problem Set 2 Solutions\nwhere Γmax is given in units of mass/area. Currently we have this value in mg/g,\nhowever. We must therefore make an estimate of the surface area per gram of\nchitosan beads and we know the wet density of the beads is 1.328 g/cm3. We will\nmake the assumption that the area available from protein adsorption is just the\nsurface area of the spherical beads.\nAbead\n4πr\n= 4\nVbead ρbead\nπr (1.328g / cm\n\n)\n= 7.5×1016 nm / g\n×\nΓ\n=\n25.6 mg / g\n= 3.41 10 -19 g / nm\nmax\n7.5 ×1016 nm2 / g\n/\nM protein\n2.47 ×105 g mol\n=\n=\n×\n-19\nAeff\nN Av Γ\n6.02 ×1023 molec\n\n/ mol\n\n(3.41 10\ng / nm\n\n2)\nmax\nAeff = 1.2 nm\n\n2 / molec\n\nc) (4 pts) How does your value compare to the expected molecular area for catalase,\ngiven the protein dimensions? Explain the possible origin of discrepancies.\nCatalase is relatively large with a diameter of ~10.5 nm, giving an expected surface\narea of πr2 = 87 nm2. This is much larger than the computed area per molecule\nfrom the extracted value for Γmax. The discrepancy between these values indicates\nthat there is much more surface area per particle than just the outer surface of the\nchitosan sphere. This could occur if the particles were porous, as the higher\nmagnification SEM image suggests.\nd) (2 pts) At pH 7, both CAT and the dye Cibacron Blue F3GA have a net negative\ncharge. Explain why CAT adsorption onto the chitosan particles still occurs.\nThough the net charge on CAT is negative, one would still expect positive charged\ngroups on the protein outer surface that exhibit attractive electrostatic interactions\nwith the dye. The structure of Cibacron Blue F3GA (below) also contains amine\ngroups that could be positively charged, interacting with negatively charged\nmoieties on the protein surface.\n\n3.051J/20.340J Problem Set 2 Solutions\ne) (2 pts) The data below shows the amount of adsorbed CAT as a function of ionic\nstrength of the solution (increasing NaCl content). Explain why a decrease in adsorption\nis observed with increasing salt content in solution.\nImages sremoved for copyright reasons.\nSee Fig. 3 in Shentu, Jingling, Jianmin Wu, Weihua Song, and Zhishen Jia. \"Chitosan\nMicrospheres as Immobilized Dye Affinity Support for Catalase Adsorption.\" International\nJournal of Biological Macromolecules 37 (2005): 42-46.\nThis data suggests that the adsorption of CAT to Cibacron Blue F3GA is\npredominantly electrostatic in nature. As the ionic strength increases, charge\nshielding leads to decreased adsorption.\n3) (10 pts) Aliphatic polycarbonates have been gaining much attention as degradable\npolymers, due to biocompatibility or bioresorbability, while aromatic polycarbonates are\nhardly hydrolysable. Feijin and coworkers have reported in vitro and in vivo degradation\nof poly(trimethylene carbonate) (PTMC), an aliphatic polycarbonate with a glass\ntransition temperature of Tg= -15C, and found interesting aspects of its degradation\n(Biomaterials, 2006, 27, 1741).\na) (3 pts) PTMC is synthesized by ring-opening polymerization of 1,3-dioxan-2-one\nrather than by polycondensation of carbonic acid mono-(3-hydroxy-propyl)ester as\nshown in the scheme below. Why?\n\n3.051J/20.340J Problem Set 2 Solutions\nO\nO\nO\nO\nO\nO\nH O\nO\nOH\nO\nX\nSynthetic scheme of PTMC\nWith polycondensation of the linear monomer, a by-product H2O has to be removed\nat high temperature and under vacuum conditions, and during the polymerization,\nthe entropy of the system decreases. By comparison, ring-opening of the cyclic\nmonomer does not produce by-products and the reaction proceeds under mild\nconditions. Due to ring-strain, ring-opening is enthalpically favorable and increases\navailable conformations (and therefore entropy). The ∆G value of most ring-\nopening polymerizations is negative.\nb) (2 pts) Various PTMCs were implanted in the femur and tibia of rabbits. Mass losses\nand molecular weight (MW) changes were monitored as a function of time. Here, x of\nPTMCx stands for MW (kDa) of TMC. As can be seen in Figs 1 and 2, in the initial\ndegradation stage, the mass of the polymeric materials decreased with time; however,\nMW values did not change significantly. Explain what happened.\nImage removed for copyright reasons.\nSee Fig. 1 and 2 in Zhang, Zheng, Roel Kuijer, Sjoerd K. Bulstra, Dirk W. Grijpma, and\nJan Feijen. \"The In vivo and In vitro Degradation Behavior of Poly(trimethylene carbonate).\"\nBiomaterials 27 (2006): 1741-1748.\nThe in vivo degradation of PTMC proceeded by enzymatic hydrolysis. In the initial\ndegradation stage, surface erosion took place, and the polymer was hydrolyzed from\nthe surface by enzyme(s), while the bulk polymer stayed intact. Thus, molecular\nweights did not change much during that period.\n\n3.051J/20.340J Problem Set 2 Solutions\nc) (2 pts) Table 2 shows water contact angles of PTMC surfaces. The results indicate\nthat low MW PTMC became more hydrophilic than high MW PMTC after conditioning\nin water for 1 week at 37°C, while both polymer surfaces presented similar wetting\nproperties before conditioning. What is a likely explanation for these results?\nImage removed for copyright reasons.\nSee Table 2 in Zhang, Zheng, Roel Kuijer, Sjoerd K. Bulstra, Dirk W. Grijpma, and\nJan Feijen. \"The In vivo and In vitro Degradation Behavior of Poly(trimethylene carbonate).\" 27\nBiomaterials 27 (2006): 1741-1748.\nDuring conditioning, rearrangement of polymer chains occurred readily, and more\nhydrophilic segments could face toward the water phase. Especially, hydrophilic\nchain ends preferred to come out from the bulk. As a result, polymer surfaces\nbecame more hydrophilic. In comparison to high MW polymer surface, low MW\nsurface had more polymer chain ends, resulting in a more water wettable surface.\nd) (3 pts) Mass loss of PTMCs in lipase solution is shown in Figure 3. Mass loss rate of\nhigh MW PMTC was larger than that of low MW PMTC. These in vitro results were\ncompared with the in vivo results (Fig. 1 above). In general, hydrolysis of high MW\npolymers is slower than for low MW polymers because high MW polymer surfaces are\nmore hydrophobic, making H+ and/or OH- ion less accessible to the surface. In this\nstudy, high MW PTMC presented a more hydrophobic surface after conditioning, as\nshown in Table 2. What is a plausible reason for the increased degradation of high MW\nPMTC in the presence of lipase?\nImage removed for copyright reasons.\nSee Fig. 3 in Zhang, Zheng, Roel Kuijer, Sjoerd K. Bulstra, Dirk W. Grijpma, and Jan\nFeijen. \"The In vivo and In vitro Degradation Behavior of Poly(trimethylene carbonate).\"\nBiomaterials 27 (2006): 1741-1748.\n\n3.051J/20.340J Problem Set 2 Solutions\nIn the in vitro and in vivo experiments, enzyme(s) played an essential role in PTMC\ndegradation. Lipases have hydrophobic domain(s) and will adsorb to a\nhydrophobic surface. In the case of low MW PTMC, the more hydrophilic surface\nsuppressed the enzyme attack, which resulted in a slower degradation."
    },
    {
      "category": "Resource",
      "title": "ps2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/a5ba7cb998764b09a25171b25e365b37_ps2.pdf",
      "content": "3.051J/20.340J Problem Set 2\ndue 2/28/06\n1. (21 pts) CoCrMo alloys form a passivating oxide on their surface that renders them\nuseful for orthopaedic implants. Such implants remain susceptible, however, to fretting\ncorrosion, which occurs as a consequence of repetitive rubbing of the implant against a\nsecond hard surface (e.g., another implant component or bone). To study fretting\ncorrosion, Contu et al. (Corrosion Sci. 2005, 47, 1863) employed a tribo-electrochemical\ncell, illustrated below, employing a CoCrMo alloy (66:28:6 wt ratio Co:Cr:Mo) as the\nworking electrode, Pt wire as the counter electrode and a saturated calomel electrode\n(SCE) as the reference electrode (SCE is +0.231V on the standard hydrogen electrode\n(SHE) scale.) A ceramic tube in contact with the sample was rotated periodically to\ncreate a rubbing action on the surface. Dissolved oxygen was removed from electrolyte\nsolutions by bubbling with argon gas for 24 h prior to the experiments. The figure below\nshows data for the open circuit potential (OCP) measured before, during and after 3\nrotations of the ceramic tube in buffered solutions at pH 4 (solid) and pH 7 (dashed).\nImages removed for copyright reasons.\nSee Fig. 1 and Fig. 2(a) in Contu, F., B. Elsener, and H. Bohni. \"Corrosion Behaviour of CoCrMo\nImplant Alloy During Fretting in Bovine Serum.\" Corrosion Science 47 (2005): 1863-1875.\n\n3.051J/20.340J Problem Set 2\ndue 2/28/06\na) Why does the OCP first drop rapidly then rise rapidly and plateau following each\nabrasion of the alloy surface by the ceramic tube?\nb) Write the expected anodic half-reaction(s) for this alloy at pH 4. Based on this\nreaction and the Nernst equation, provide an expression for the measured electrical\npotential across the rubbed alloy surface.\nc) What is the expected cathodic half reaction at pH 4 and pH 7 for this experiment?\nd) Why is the OCP measured at pH 4 higher than the value measured at pH 7?\ne) Why does the open-circuit potential after rubbing plateau to a different value than the\noriginal measured OCP for this alloy?\nf) The figure below provides data from cathodic polarization (increase in the cathodic\nreaction relative to anodic reaction) experiments at pH 4 for the CoCrMo alloy in\nelectrolyte solution (phosphate buffer) vs. serum. Shown is the measured current density\nas a function of the potential. Provide an explanation for the reduced current measured in\nserum compared to buffer. Would this be a favorable or unfavorable effect in vivo?\nImage removed for copyright reasons.\nSee Fig. 4(a) in Contu, F., B. Elsener, and H. Bohni. \"Corrosion Behaviour of CoCrMo\nImplant Alloy During Fretting in Bovine Serum.\" Corrosion Science 47 (2005): 1863-1875.\n2. (19 pts) Catalase is an enzyme (mol. wt.: 247kDa, diameter: 10.5 nm) found in liver\ncells that catalyses the conversion of hydrogen peroxide to water and oxygen. Its\ncatalytic activity is of interest for biosensor applications. As an approach for\nfractionating catalase from biological solutions, Jia and coworkers (Int. J. of Biol.\nMacromol. 2005, 37, 42) prepared chitosan microspheres coated with a covalently\nattached dye, Cibacron Blue F3GA, which exhibits strong binding to catalase. The figure\nbelow shows an SEM image of the chitosan particles. The wet density of the spheres was\nfound to be 1.328 g/mL. Adsorption studies were performed to determine the amount of\n\n3.051J/20.340J Problem Set 2\ndue 2/28/06\ncatalase adsorbed to the particles as a function of solution concentration. An adsorption\nisotherm for pH 7 is shown below.\nImages removed for copyright reasons.\nSee Fig. 1 and 4 in Shentu, Jingling, Jianmin Wu, Weihua Song, and Zhishen Jia. \"Chitosan\nMicrospheres as Immobilized Dye Affinity Support for Catalase Adsorption.\" International\nJournal of Biological Macromolecules 37 (2005): 42-46.\na) Assuming a Langmuir model, determine the affinity constant Ka and the maximum\nsurface coverage Γmax for CAT adsorption on the dye-linked chitosan beads.\nb) From the obtained value for Γmax, calculate the effective area per protein, stating any\nassumptions you make.\nc) How does your value compare to the expected molecular area for catalase, given the\nprotein dimensions? Explain the possible origin of discrepancies.\nd) At pH 7, both CAT and the dye Cibacron Blue F3GA have a net negative charge.\nExplain why CAT adsorption onto the chitosan particles still occurs.\ne) The data below shows the amount of adsorbed CAT as a function of ionic strength of\nthe solution (increasing NaCl content). Explain why a decrease in adsorption is observed\nwith increasing salt content in solution.\nImages removed for copyright reasons.\nSee Fig. 3 in Shentu, Jingling, Jianmin Wu, Weihua Song, and Zhishen Jia. \"Chitosan\nMicrospheres as Immobilized Dye Affinity Support for Catalase Adsorption.\" International\nJournal of Biological Macromolecules 37 (2005): 42-46.\n\n3.051J/20.340J Problem Set 2\ndue 2/28/06\n3) (10 pts) Aliphatic polycarbonates have been gaining much attention as degradable\npolymers, due to biocompatibility or bioresorbability, while aromatic polycarbonates are\nhardly hydrolysable. Feijin and coworkers have reported in vitro and in vivo degradation\nof poly(trimethylene carbonate) (PTMC), an aliphatic polycarbonate with a glass\ntransition temperature of Tg= -15C, and found interesting aspects of its degradation\n(Biomaterials, 2006, 27, 1741).\na) PTMC is synthesized by ring-opening polymerization of 1,3-dioxan-2-one rather than\nby polycondensation of carbonic acid mono-(3-hydroxy-propyl)ester, as shown in the\nscheme below. Why?\nO\nO\nO\nO\nO\nO\nH O\nO\nOH\nO\nX\nSynthetic scheme of PTMC\nb) Various PTMCs were implanted in the femur and tibia of rabbits. Mass losses and\nmolecular weight (MW) changes were monitored as a function of time. Here, x of\nPTMCx stands for MW (kDa) of TMC. As can be seen in Figs 1 and 2, in the initial\ndegradation stage, the mass of the polymeric materials decreased with time; however,\nMW values did not change significantly. Explain what happened.\nImage removed for copyright reasons.\nSee Fig. 1 and 2 in Zhang, Zheng, Roel Kuijer, Sjoerd K. Bulstra, Dirk W. Grijpma, and Jan Feijen.\n\"The In vivo and In vitro Degradation Behavior of Poly(trimethylene carbonate).\" Biomaterials 27\n(2006): 1741-1748.\nc) Table 2 shows water contact angles of PTMC surfaces. The results indicate that low\nMW PTMC became more hydrophilic than high MW PMTC after conditioning in water\n\n3.051J/20.340J Problem Set 2\ndue 2/28/06\nfor 1 week at 37°C, while both polymer surfaces presented similar wetting properties\nbefore conditioning. What is a likely explanation for these results?\nImage removed for copyright reasons.\nSee Table 2 in Zhang, Zheng, Roel Kuijer, Sjoerd K. Bulstra, Dirk W. Grijpma, and Jan Feijen.\n\"The In vivo and In vitro Degradation Behavior of Poly(trimethylene carbonate).\" Biomaterials 27\n(2006): 1741-1748.\nd) Mass losses of PTMCs in lipase solution is shown in Figure 3. Mass loss rate of high\nMW PMTC was larger than that of low MW PMTC. These in vitro results were\ncompared with the in vivo results (Fig. 1 above). In general, hydrolysis of high MW\npolymers is slower than for low MW polymers because high MW polymer surfaces are\nmore hydrophobic, making H+ and/or OH- ion less accessible to the surface. In this\nstudy, high MW PTMC presented a more hydrophobic surface after conditioning, as\nshown in Table 2. What is a plausible reason for the increased degradation of high MW\nPMTC in the presence of lipase?\nImage removed for copyright reasons.\nSee Fig. 3 in Zhang, Zheng, Roel Kuijer, Sjoerd K. Bulstra, Dirk W. Grijpma, and Jan Feijen.\n\"The In vivo and In vitro Degradation Behavior of Poly(trimethylene carbonate).\" Biomaterials 27\n(2006): 1741-1748."
    },
    {
      "category": "Resource",
      "title": "ps3_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/d25c7cd5ac3d4a763351aef4a35004b6_ps3_sol.pdf",
      "content": "3.051J/20.340J Problem Set 3 Solutions\n1. (25 pts) Insulin is an important hormone produced by the pancreas that allows cells to\nprocess glucose. Diabetes mellitus, affecting 16 million people in the U.S., is a condition\nin which insulin production or utilization is impaired. Current treatment for diabetes\noften involves subcutaneous injection of insulin.\na) Access the RCSB Protein Data Bank at http://www.pdb.org/pdb. Perform a search on\ninsulin and access the human insulin two disulfide model to answer the following:\ni) (2 pts) What is the primary chemical structure for insulin?\nA chain (21 residues): GIVEQSCTSISSLYQLENYCN\nB chain (30 residues): FVNQHLCGSDLVEALYLVCGERGFFYTKPT\nii) (3 pts) What is the secondary structure of insulin?\nThe A chain exhibits an alpha helix formed by residues 13-16. The B chain forms\nan alpha helix with residues 9-18. The fractional alpha helical content for insulin is\nthus 14/51 = 0.27.\nDisulfide bonds between cysteine residues A7-B7 and A20-B19 bond the A and B\nchains.\niii) (2 pts) From the Ramachandran plot analysis, what is the range of psi, phi values for\nmost of the amino acid residues in insulin?\nFrom the Ramanchandran plot, most of the residues are found in the range: φ = -45\nto -120°, ψ = 0 to -80°.\nb) (2 pts) Could insulin be readily radiolabeled with 125I for detecting its adsorption?\n125I will react with tyrosine residues in proteins. Insulin has 4 tyrosine residues and\nthus in principle can be radiolabeled with 125I. In practice, the tyrosine at A14\nappears to be the only one accessible for labeling (see P. Iozzo et al., Nucl. Med. Biol.\n29, 73 (2002), and refs. therein).\nNumerous research efforts underway are investigating controlled release approaches that\nwould eliminate the need for daily insulin injections. Such strategies typically involve\nexposure of insulin to synthetic material surfaces. To investigate the effects of adsorption\non the secondary structure of insulin, Mollmann et al. (Eur. J. Pharm. Sci. 2006, 27, 194)\nperformed circular dichroism (CD) measurements on insulin in phosphate buffered saline\n(PBS) solution and adsorbed to the surface of colloidal Teflon particles 215 nm in\ndiameter and stabilized in water with a small fraction of negatively charged sulfate\ngroups on their surface. The CD data are shown in the figure below.\n\n3.051J/20.340J Problem Set 3 Solutions\nc) (3 pts) What is the effect of adsorption on the secondary structure of insulin?\nImage removed for copyright reasons.\nSee Fig. 2 in Mollmann, Susanne H., Lene Jorgensen, Jens T. Bukrinsky, Ulla Elofsson,\nWillem Norde, and Sven Frokjaer. \"Interfacial Adsorption of Insulin: Conformational Changes\nand Reversibility of Adsorption.\" Eur J Pharm Sci 27 (2006): 194-204\nThe alpha helical content of insulin decreases upon adsorption while the random\ncoil content increases. This is observed through the decreased negative ellipticity at\n222 nm and decreased positive ellipticity at 192 nm (Note that a random coil exhibits\na large negative ellipticity at 197 nm.)\nd) (4 pts) From the CD data provided, calculate the fractional α helical content for insulin\nin solution and adsorbed to the Teflon particles.\n-θ[ ]222\n=\nThe helical content can be determined using the equation: fα -helix\n40, 000\nThe molar ellipticity at 222 nm is ~ -12,000 for insulin in solution, giving fα = 0.30, in\ngood agreement with 0.27 determined above from the structure database. Adsorbed\nto a surface, the [θ]222 ~ -9000, giving fα = 0.23.\ne) (2 pts) Why might changes in the secondary structure of insulin be important to\nconsider in developing controlled delivery strategies?\nIf insulin denatures upon contacting a synthetic surface before being administered,\nits activity in vivo may be reduced.\n\n3.051J/20.340J Problem Set 3 Solutions\nMollmann et al. further studied the adsorption of FITC-labeled insulin to determine if the\nfluorescent dye changed the adsorption kinetics. For this experiment, mixtures of FITC-\nlabeled and unlabeled insulin were prepared in different ratios to reach the same total\ninsulin concentration (a concentration that corresponded to near monolayer coverage).\nThey found that the fluorescence intensity increased linearly with the fraction of FITC-\nlabeled insulin in solution, and concluded from this result that FITC-labeled and\nunlabeled insulin have comparable affinities for the Teflon beads.\nf) (7 pts) Do you agree with their conclusion? Develop a model to describe the fractional\ncoverage (νF) for the FITC-labeled component of the mixed insulin solution, based on a\nmodified Langmuir model. Under what conditions does νF scale linearly with the\nfraction of FITC-labeled insulin [PF]?\nBuilding on the Langmuir model, in dynamic equilibrium we should expect both\nFITC-labeled and unlabeled insulin molecules to adsorb and desorb from the\nsurface at the same rate:\nka,F[PF][S] = kd,F[PFS]\nka,U[PU][S] = kd,U[PUS]\nwhere U= unlabeled and F = FITC-labeled. The corresponding affinity constants\nwill be:\nF\n[P S]\nKF = [P S]\nKU =\nU\n[\n][\nP\nS]\nP\nS]\n[\n][\nF\nU\nFrom here we can define the fraction of sites filled by FITC-labeled insulin as:\n[P S]\nKF [PF ]\nν\n=\nF\n=\nF\n([ ]+[P S\n\n]+[P S\n\n])\n(1+ K [\n]+ K [PF ])\nS\nU\nF\nU PU\nF\nNoting that for these experiments, the total polymer concentration is a constant:\n[P] = const = [PU] + [PF],\nwe can substitute for [PU]:\nK\nPF ]\nK\nPF ]\nF [\nF [\n=\n=\nν\n1+ K\nP\n\nF\nF\n[ ]+(K -KU )[\n]\nC +(K -KU )[\n]\nU\nPF\nF\nPF\nwhere C is a constant. From this result we find that if KF = KU, then νF should vary\nlinearly with [PF].\n\n3.051J/20.340J Problem Set 3 Solutions\nOne must be careful in performing the experiment, however. At high [P], if KU is\nlarge compared to KF so that C is large compared to (K -KU )[PF ] (small values of\nF\n[PF], then:\nK\nPF ]\nF [\nν F ≈\nC\nso that a linear increase in fluorescence intensity with [PF] might still be observed.\nThe authors provided insufficient details on their experiments to determine whether\ntheir conclusion is valid or not.\n2. (20 pts) Prosthetic vascular grafts are commonly employed in the treatment of\natherosclerosis, as a means to bypass occluded blood vessels. Read through the text on\npp. 479-483 (1st ed.: pp. 420-422) to assist in answering the questions below.\na) (2 pts) What materials are currently used in commercial vascular grafts?\nDacron (polyethylene terephthalate, PET) is commonly used for large diameter\nvessels while expanded polytetrafluoroethylene (ePTFE) is used for synthetic grafts\nof diameter below < 8 mm.\nb) (2 pts) What is the most common reason for failure of synthetic vascular grafts of\nsmall diameter?\nThrombosis is the chief source of failure in small diameter grafts, as even moderate\ndeposits on the inner surface of the graft can restrict blood flow.\nc) (4 pts) Describe the expected synthetic/biological material interface at the interior and\nexterior surfaces of a vascular graft many months post-implantation.\nThe interior of the graft will typically have an inner lining of aggregated platelets\nand fibrin, except near the sutured ends of the graft where endothelial cells migrate\ninto the device to create a neointima. The exterior of the graft will exhibit a\nhistology that is typical of the foreign body response, namely a fibrous capsule\nencompassing the device, incorporating foreign body giant cells adjacent to the\ndevice surrounded by connective tissue containing fibroblasts and capillaries.\nFibrinogen is known to play an important role in clot formation. Makogonenko et al.\n(Biochemistry 2002, 41, 7907) investigated the interaction of adsorbed fibrinogen with\nfibronectin, employing surface plasmon resonance (SPR). The figure below shows\nfibronectin adsorption data at 22 °C on a gold surface coated with fibrinogen (dashed\nline, 100 nM fibronectin), and the same surface after subsequently being treated with\nthrombin (solid lines, 0.25 - 3.0 nM fibronectin).\n\n3.051J/20.340J Problem Set 3 Solutions\nImage removed for copyright reasons.\nSee Fig. 2(a) in Makogonenko, E., G. Tsurupa, K. Ingham, and L. Medved. \"Interaction\nof Fibrin(ogen) with Fibronectin: Further Characterization and Localization of the\nFibronectin-Binding Site.\" Biochemistry 41 (2002): 7907-7913.\nd) (2 pts) What do the units of SPR response indicate?\nThe response is measured in arc seconds, the shift in the angle where maximum\nenergy transfer occurs to the Au film. This value increases with fibronectin\nadsorption because the index of refraction at the surface is increased.\ne) (2 pts) Explain why fibrinogen binds fibronectin only after exposure to thrombin.\nThrombin catalyses the cleavage of fibrinogen to form fibrin. The results suggest\nthat the fibronectin binding sites on fibrinogen are only accessible when fibrinogen\nis cleaved.\nf) (2 pts) From the inset of kobs data obtained from the fits to the SPR data for thrombin-\nexposed fibrinogen, estimate the value of the dissociation constant KD.\nNoting kobs = kd + k [ P], ka should be given by the slope and kd by the y-intercept\na\nof the straight line fit.\n/\nKD = k\nk\n≈ 0.3\n\nnM\n\nd\na\n\n3.051J/20.340J Problem Set 3 Solutions\ng) (3 pts) Based on the KD value you obtained for (f), would you expect fibronectin to\nbind to adsorbed fibrinogen in vivo? Explain your answer, stating any assumptions you\nmake.\nThe KD value provides a metric for the solution concentration required for\nsubstantial adsorption to occur to a given surface (at [P] = KD, half the surface sites\nare occupied). The concentration of fibronectin in plasma is ~0.3 mg/mL, or 1250\nnM (molecular weight of fibronectin is 240,000 g/mol), which is well above the\nobserved KD, so fibronectin adsorption might be expected. It should be noted,\nhowever, that this analysis does not account for other proteins in the blood stream,\nwhich might adsorb preferentially over fibronectin.\nh) (3 pts) What role does adsorbed fibronectin have in the body's response to an\nimplanted biomaterial?\nFibronectin is an adhesion protein that contains peptide sequences that bind to\nintegrins on the surface of platelets. When adsorbed on a surface, fibronectin allows\nplatelets to adhere to the surface to initiate clot formation. Adsorbed fibronectin\nalso binds integrins on fibroblasts, enabling their recruitment to the site of injury to\ninitiate the formation of new connective tissue."
    },
    {
      "category": "Resource",
      "title": "ps3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/7945987a69f76c34c2b9c63f104695c0_ps3.pdf",
      "content": "3.051J/20.340J Problem Set 3\ndue 3/09/06\n1. (25 pts) Insulin is an important hormone produced by the pancreas that allows cells to\nprocess glucose. Diabetes mellitus, affecting 16 million people in the U.S., is a condition\nin which insulin production or utilization is impaired. Current treatment for diabetes\noften involves subcutaneous injection of insulin.\na) Access the RCSB Protein Data Bank at http://www.pdb.org/pdb. Perform a search on\ninsulin and access the human insulin two disulfide model to answer the following:\ni) What is the primary chemical structure for insulin?\nii) What is the secondary structure of insulin?\niii) From the Ramachandran plot analysis, what is the range of psi, phi values for most of\nthe amino acid residues in insulin?\nb) Could insulin be readily radiolabeled with 125I for detecting its adsorption? Explain.\nNumerous research efforts underway are investigating controlled release approaches that\nwould eliminate the need for daily insulin injections. Such strategies typically involve\nexposure of insulin to synthetic material surfaces. To investigate the effects of adsorption\non the secondary structure of insulin, Mollmann et al. (Eur. J. Pharm. Sci. 2006, 27, 194)\nperformed circular dichroism(CD) measurements on insulin in phosphate buffered saline\n(PBS) solution and adsorbed to the surface of colloidal Teflon particles 215 nm in\ndiameter and stabilized in water with a small fraction of negatively charged sulfate\ngroups on their surface. The CD data are shown in the figure below.\nc) What is the effect of adsorption on the secondary structure of insulin?\nImage removed for copyright reasons.\nSee Fig. 2 in Mollmann, Susanne H., Lene Jorgensen, Jens T. Bukrinsky, Ulla Elofsson,\nWillem Norde, and Sven Frokjaer. \"Interfacial Adsorption of Insulin: Conformational Changes\nand Reversibility of Adsorption.\" Eur J Pharm Sci 27 (2006): 194-204\n\n3.051J/20.340J Problem Set 3\ndue 3/09/06\nd) From the CD data provided, calculate the fractional α helical content for insulin in\nsolution and adsorbed to the Teflon particles.\ne) Why might changes in the secondary structure of insulin be important to consider in\ndeveloping controlled delivery strategies?\nMollmann et al. further studied the adsorption of FITC-labeled insulin to determine if the\nfluorescent dye changed the adsorption kinetics. For this experiment, mixtures of FITC-\nlabeled and unlabeled insulin were prepared in different ratios to reach the same total\ninsulin concentration (a concentration that corresponded to near monolayer coverage).\nThey found that the fluorescence intensity increased linearly with the fraction of FITC-\nlabeled insulin in solution, and concluded from this result that FITC-labeled and\nunlabeled insulin have comparable affinities for the Teflon beads.\nf) Do you agree with their conclusion? Develop a model to describe the fractional\ncoverage (νF) for the FITC-labeled component of the mixed insulin solution, based on a\nmodified Langmuir model. Under what conditions does νF scale linearly with the\nfraction of FITC-labeled insulin [PF]?\n2. (20 pts) Prosthetic vascular grafts are commonly employed in the treatment of\natherosclerosis, as a means to bypass occluded blood vessels. Read through the text on\npp. 479-483 (1st ed.: pp. 420-422) to assist in answering the questions below.\na) What materials are currently used in commercial vascular grafts?\nb) What is the most common reason for failure of synthetic vascular grafts of small\ndiameter?\nc) Describe the expected synthetic/biological material interface at the interior and exterior\nsurfaces of a vascular graft many months post-implantation.\nFibrinogen is known to play an important role in clot formation. Makogonenko et al.\n(Biochemistry 2002, 41, 7907) investigated the interaction of adsorbed fibrinogen with\nfibronectin, employing surface plasmon resonance (SPR). The figure below shows\nfibronectin adsorption data at 22 °C on a gold surface coated with fibrinogen (dashed\nline, 100 nM fibronectin), and the same surface after subsequently being treated with\nthrombin (solid lines, 0.25 - 3.0 nM fibronectin).\n\n3.051J/20.340J Problem Set 3\ndue 3/09/06\nImage removed for copyright reasons.\nSee Fig. 2(a) in Makogonenko, E., G. Tsurupa, K. Ingham, and L. Medved. \"Interaction\nof Fibrin(ogen) with Fibronectin: Further Characterization and Localization of the\nFibronectin-Binding Site.\" Biochemistry 41 (2002): 7907-7913.\nd) What do the units of SPR response indicate?\ne) Explain why fibrinogen binds fibronectin only after exposure to thrombin.\nf) From the inset of kobs data obtained from the fits to the SPR data for thrombin-exposed\nfibrinogen, estimate the value of the dissociation constant KD.\ng) Based on the KD value you obtained for (f), would you expect fibronectin to bind to\nadsorbed fibrinogen in vivo? Explain your answer, stating any assumptions you make.\nh) What role does adsorbed fibronectin have in the body's response to an implanted\nbiomaterial?"
    },
    {
      "category": "Resource",
      "title": "ps4_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/8b77b55e708d5c0115a4e2c488bbe8ac_ps4_sol.pdf",
      "content": "3.051J/20.340J Problem Set 4\nSolutions\n1) (25 pts) There is wide interest in the development of microarrays of antibodies that\nwould enable high-throughput analysis of proteins for diagnostic applications\n(proteomics). Microcontact printing of proteins has been considered as a potential method\nfor inexpensive and rapid fabrication of such structures. In a recent article, Chen and\ncoworkers (J.L. Tan et al., Langmuir 2002, 18, 519) investigated how the surface\nchemistry of the substrate and stamp influences the ability to print proteins. Download\nand read the article, then address the following questions.\na) (2 pts) In this work, gold surfaces were first coated with mixed self-assembled\nmonolayers (SAMs) having different ratios of -CH3 terminated and -COOH, -OH, or\n(OCH2CH2)OH (-EG6) terminated alkane thiols adsorbed from ethanol solutions. Explain\nwhat drives the formation of a self-assembled monolayer on gold.\nA SAM is formed on gold by the favorable exothermic reaction of thiol groups with\ngold atoms on the surface, according to:\nR(CH2)nSH + Au → Au(I)-S(CH2)nR + 1/2H2\nvan der Waal's interactions favor close-packing of the alkyl chains on the surface,\nwith molecules adopting a tilt angle of 30° from the direction normal to the Au\nsurface.\nb) (5 pts) Advancing water contact angles were measured as a function of the fraction of\nhydrophilic thiol used in the ethanol solution, as shown in the figure below. Provide an\nexplanation for the deviations from linearity observed for each mixed monolayer system.\nImage removed for copyright reasons.\nSee Fig. 3(d) in Tan, J. L., J. Tien, and C. S. Chen. \"Microcontact Printing of Proteins on\nMixed Self-Assembled Monolayers.\" Langmuir 18 (2002): 519-523.\n\nFor the -OH and -COOH mixed SAMs, there is a negative deviation from linearity\nof cos θ values observed at low fractions of hydrophilic thiol. This might be\nexplained by a slight adsorption preference of -CH3 terminated alkane thiols over -\n\n3.051J/20.340J Problem Set 4\nSolutions\nOH or -COOH terminated thiols, which might occur due to higher solubility of the\nhydrophilic thiols in ethanol, thereby reducing their relative surface affinity. For\nthe EG6 terminated SAMs, a positive deviation from linearity is observed. For this\nsystem, the EG6-terminated thiols are substantially longer than the -CH3\nterminated thiols, and consequently will overcoat the -CH3 end groups even at low\nsurface fractions, resulting in increased wettability and the positive deviation from\nlinearity. At concentrations above 30% EG6 thiol, the -CH3 thiols are fully covered\nby the EG chains and the contact angle remains constant.\nc) (3 pts) To transfer proteins onto the mixed SAM surfaces in patterns, a PDMS stamp\nwas fabricated and fluorescently-labeled immunoglobulin G (IgG) was adsorbed onto the\nstamp surface. Upon subsequently contacting the stamp to the SAM surfaces, they found\nthat protein transfer only took place above a critical hydrophilic thiol content. Results for\nSAMs incorporating -COOH terminated thiols are shown in the figure below. Provide an\nexplanation for why protein transfer occurred only as the surfaces were made more\nhydrophilic.\nImage removed for copyright reasons.\nSee Fig. 2 in Tan, J. L., J. Tien, and C. S. Chen. \"Microcontact Printing of Proteins\non Mixed Self-Assembled Monolayers.\" Langmuir 18 (2002): 519-523.\n\nFor the protein to transfer, the work of adhesion of the protein to the PDMS stamp\nsurface must be overcome, i.e., the work of adhesion must be higher between the\nSAM surface and the protein. The -CH3 terminated SAMs would have a low work\nof adhesion with IgG because their secondary bonds form through weak dispersive\nforces. By incorporating polar groups -COOH, -OH, and ether oxygens (EG6),\nhydrogen-bonding between the protein and SAM can occur, resulting in a\nsufficiently high work of adhesion with the protein to overcome its adhesion to\nPDMS.\nd) (4 pts) For the three mixed SAM systems studied, the lowest fraction of hydrophilic\nthiol at which protein transfer began to take place was 50%, 55% and 2.5% for -COOH, -\nOH, and -EG6 thiols, respectively. Use the contact angle data to calculate the work of\nadhesion of water to the mixed SAM surface at these compositions, and compare these\nvalues to the work of adhesion for water on the PDMS stamp. Why might work of\nadhesion of water be correlated with protein transfer, as suggested by the authors?\n\n3.051J/20.340J Problem Set 4\nSolutions\nWork of adhesion of water to the substrate is calculated as:\nWadh = γ (1 + cos θ)\nw\nwhere γw is the surface tension of water (73 dyn/cm), and θ is the contact angle of\nwater on the substrate. Using the cos θ values provided in the article, Wadh= 70, 78\nand 67 mJ/m2 for the -COOH (50%), -OH (55%) and -EG6 (2.5%) SAM systems,\nrespectively. These values are similar, suggesting a critical level of hydrogen\nbonding By comparison, the work of adhesion of water on the PDMS stamp is 46\nmJ/m2, based on contact angle measurement. Since water bonds to polar surfaces\nthrough similar mechanisms as proteins, Wadh values for water can be a useful\nmetric for assessing the whether protein transfer will take place on a given surface.\ne) (5 pts) The authors next modified the surface of the PDMS stamp, to understand the\neffects of stamp chemistry on protein transfer. To do so, the PDMS stamp was first\noxidized using an air plasma. After plasma treatment, the stamps were treated with\n(tridecafluoro-1,1,2,2,-tetrahydrooctyl)-1-trichlorosilane vapor or aminopropyl\ntrimethoxysilane and 50 mmol HCl in ethanol (see Materials and Methods). Provide the\nexpected reactions that would result in -CF3 and -NH2 modified surfaces, respectively.\nAir is a gaseous mixture of N2, O2, and in lesser amounts CO2. H2, and inert gases.\nThe surface of PDMS can thus be expected to exhibit diverse chemical groups after\nplasma oxidation, including -Si-OH groups formed by reactions with the PDMS\nchains. Trichlorosilanes and trialkoxysilanes readily react with hydroxyl groups:\nSi-OH + R-SiCl3 → Si-O-Si(Cl2)R + HCl\nSi-OH + Si(OCH3)3CH2CH2CH2NH2 → Si-O-Si(OCH3)2CH2CH2CH2NH2 + CH3OH\nf) (3 pts) Using the modified stamps, the fraction of -COOH thiols required for protein\ntransfer changed to 0% for -CF3 modified stamps and 80% for -NH2 modified stamps\n(compared with 55% for unmodified stamps). Provide an explanation for these findings.\nFor fluorinated stamps, the work of adhesion of the protein to the stamp surface is\nlikely to be lower than for PDMS. The protein can thus form stronger secondary\nbonds with the -CH3 SAM surface, allowing transfer even in the absence of more\npolar groups. For the amine terminated surfaces, the opposite is true. Proteins can\nform stronger secondary bonds with the stamp, so that a larger number of polar\ngroups on the SAM surface is required to effectively overcome the higher work of\nadhesion to the stamp.\nThe fluorinated stamp has a work of adhesion with water of 36.5 J/cm3. For the\n100% -CH3 terminated SAM, the work of adhesion of water is calculated to be 45\nmJ/m2, suggesting that the -CH3 SAM interface would also have stronger bonding\nwith the protein. For the -NH2 modified stamp, Wadh,H2O = 137 mJ/m2, while the\n\n3.051J/20.340J Problem Set 4\nSolutions\n80% -COOH mixed SAM has a Wadh,H2O = 117 mJ/m2, which is lower but in the\nsame range.\ng) (3 pts) Would you expect the -CF3 and -NH2 modified stamp surfaces to be stable in\nair? Why or why not?\nFor the fluorinated stamp, the surface should be stable in air to reconstruction\nbecause the fluorocarbons exhibit a lower surface energy than PDMS and are thus\npreferred at the surface. For the -NH2 modified surfaces, the surface energy is\nhigher and one might expect the surface to reconstruct over time in air, burying the\nhigher energy amines.\n2. (15 pts) Polylactide (PLA) is used in biomedical applications due to its\nphysicochemical properties and degradability. For tissue engineering applications,\nhowever, cell adhesion and proliferation on PLA is generally poor. To enhance cartilage\ncell adhesion to PLA scaffolds, Yu et al. (J. Biomed. Res. Part B: Appl. Biomater, 76B,\n64, 2006) developed a block copolymer of PLA and poly(ethylene glycol) (PEG) to be\nused as an additive in PLA. To induce adhesion of chondrocytes, various amino acids or\nthe peptide RGD were coupled to the free PEG chain end of the PLA-PEG block\ncopolymer (referred to as PLE).\na) (3 pts) In the synthesis of the block copolymer (PLE), the -OH terminus of PLA (0.83\nmmol eq.) was first coupled with 4,4'-methylenediphenyl diisocyanate (MDI, 0.89 mmol)\nand subsequently reacted with 0.37 mmol of PEG (PEO) which had -OH terminal groups\nat each end. What undesirable product(s) might be obtained in the reaction with this\nstoichiometry?\nCH2\nNCO\nO\nPLA O C NH\nPLA OH + OCN\nCH2\nNCO\nO\nPEO\nPLA O\nCH2\nNH C O CH2CH2O H\nO\nC NH\nO\nCH3SO2Cl, NEt3\nPLA O C\nCH2\nNH C O CH2CH2O SO2CH3\nO\nNH\nR\nR\nO\nH2N\nCH\n\nCOOH\nPLA O\nCH2\nNH C O CH2CH2O NH CH COOH\nO\nC NH\nScheme 1. Synthetic pathways of peptide-bearing PLA-b-PEO\nSince the molar quantity of PEG was about half that of PLA, both -OH ends of PEG\ncould react with the isocyanate groups from MDI to form PLA-PEG-PLA triblock\ncopolymer, in addition to the PLA-PEG diblocks desired for surface modification.\n\nC\n3.051J/20.340J Problem Set 4\nSolutions\nO\nO\nPLA O\nNH C O CH2CH2O O\nNH\nCH2\nC NH\nCH2\nNH C O PLA\nO\nO\nChemical structure of PLA-PEO-PLA triblock copolymer\nb) (4 pts) To couple amino acid(s) onto the hydroxyl group of the PEO chain end, the -\nOH should first be activated, and methansulfonyl chloride was employed with\ntriethylamine (NEt3) in this research. Explain the role of NEt3 in this reaction. Is there\nan alternative reagent to enhance the OH activation?\nThe by-product of this reaction is HCl. To increase the forward reaction rate, the\nHCl concentration should be decreased. NEt3 can trap HCl with the formation of\nan organic salt. Tresyl chloride (CF3CH2SO2Cl) can be used as an alternative with\nhigher activity.\nR-OH + CH3SO2Cl + NEt3\nR-O-SO2CH3 + HN+Et3Cl-\nReaction scheme of activation of OH group with methanesulfonyl chloride\nThe figure below shows chondrocyte proliferation (percentage of cells originally seeded\nadhered to surface after 72 h) on films of neat PLA and PLA modified by adding a\nfraction of PLE62 (6000 g/mol PLA, 2000 g/mol PEG) or a PLE62 derivative to the film\ncasting solution. Films were made by casting polymer solutions into a round glass mold\nand allowing the solvent (methyl chloride) to evaporate in air over 24 h. PLE62\nderivatives employed as additives included PLE62 end-modified with the amino acid(s)\nL-aspartic acid (PLE62asp), L-arginine (PLE62arg), or L-lysine (PLE62lys), or the\npeptide sequence RGD (PLE62 RGD). As a control, chondrocytes were also seeded on\ntissue culture polystyrene (TCPS), known to promote cell attachment.\nc) (3 pts) From the data below, films of PLA incorporating PLE62 showed similar levels\nof cell attachment/proliferation as PLA. Provide an explanation for these results.\nImage removed for copyright reasons.\nSee Fig. 10(b) in Yu, Guanhua, Jian Ji, Huiguang Zhu, and Jiacong Shen.\n\"Poly(D,L-lactic acid)-block-(ligand-tethered poly(ethylene glycol)) Copolymers as Surface\nAdditives for Promoting Chondrocyte Attachment and Growth.\" J Biomed Mat Res Part B:\nAppl Biomater 76B (2006): 64-75.\n\n3.051J/20.340J Problem Set 4\nSolutions\nThe results suggest that the film surface is not coated with the PEG component of\nthe PLE block copolymer. If the surface were predominantly PEG (PEO), a\nsignificantly lower level of cell attachment would be expected, since PEO resists\nadsorption of proteins that facilitate cell attachment to surfaces. This could be the\ncase because PEO has a higher surface energy than PLA, and the films were dried\nin air.\nd) (3 pts) The data also show that films modified with PLE62arg and PLE62lys exhibited\nhigher cell adhesion/proliferation than films modified with PLE62asp. Explain why this\nmight be the case. Would these systems form bonds with cell surface integrins?\nArg and Lys both have positively charged side groups while Asp has a negatively\ncharged side group. Since the many adhesion proteins as well as cell surfaces are\nnegatively charged, the positively charged PLE62 additives would lead to an\nadditional electrostatic attraction of proteins or cells to the PLA film. These single\namino acid chain ends would not bond specifically with cell integrins, whose ligands\nare typically several amino acid units long.\ne) (2 pts) Only the PLA modified with PLE62 RGD demonstrated measurable cell\nproliferation (values >100%). Provide an explanation for this finding.\nProliferation requires cells to first adhere and spread on a surface. The peptide\nsequence RGD is a well known ligand for cell integrins, which mediate cell\nattachment. The increased cell adhesion to this surface further implies that\nattaching RGD to PEG facilitates localization of the PEG block at the surface."
    },
    {
      "category": "Resource",
      "title": "ps4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/b04db3d1667c0a2a9c2289b7d402a212_ps4.pdf",
      "content": "3.051J/20.340J Problem Set 4\ndue 3/23/06\n1) (25 pts) There is wide interest in the development of microarrays of antibodies that\nwould enable high-throughput analysis of proteins for diagnostic applications\n(proteomics). Microcontact printing of proteins has been considered as a potential method\nfor inexpensive and rapid fabrication of such structures. In a recent article, Chen and\ncoworkers (J.L. Tan et al., Langmuir 2002, 18, 519) investigated how the surface\nchemistry of the substrate and stamp influences the ability to print proteins. Download\nand read the article, then address the following questions.\na) In this work, gold surfaces were first coated with mixed self-assembled monolayers\n(SAMs) having different ratios of -CH3 terminated and -COOH, -OH, or\n(OCH2CH2)6OH (-EG6) terminated alkane thiols adsorbed from ethanol solutions.\nExplain what drives the formation of a self-assembled monolayer on gold.\nb) Advancing water contact angles were measured as a function of the fraction of\nhydrophilic thiol used in the ethanol solution, as shown in the figure below. Provide an\nexplanation for the deviations from linearity observed for each mixed monolayer system.\nImage removed for copyright reasons.\n\nSee Fig. 3(d) in Tan, J. L., J. Tien, and C. S. Chen. \"Microcontact Printing of Proteins\non Mixed Self-Assembled Monolayers.\" Langmuir 18 (2002): 519-523.\n\nc) To transfer proteins onto the mixed SAM surfaces in patterns, a PDMS stamp was\nfabricated and fluorescently-labeled immunoglobulin G (IgG) was adsorbed onto the\nstamp surface. Upon subsequently contacting the stamp to the SAM surfaces, they found\nthat protein transfer only took place above a critical hydrophilic thiol content. Results for\nSAMs incorporating -COOH terminated thiols are shown in the figure below. Provide an\nexplanation for why protein transfer occurred only as the surfaces were made more\nhydrophilic.\n\n3.051J/20.340J Problem Set 4\ndue 3/23/06\nImage removed for copyright reasons.\n\nSee Fig. 2 in Tan, J. L., J. Tien, and C. S. Chen. \"Microcontact Printing of Proteins\non Mixed Self-Assembled Monolayers.\" Langmuir 18 (2002): 519-523.\n\nd) For the three mixed SAM systems studied, the lowest fraction of hydrophilic thiol at\nwhich protein transfer began to take place was 50%, 55% and 2.5% for -COOH, -OH,\nand -EG6 thiols, respectively. Use the contact angle data to calculate the work of\nadhesion of water to the mixed SAM surface at these compositions, and compare these\nvalues to the work of adhesion for water on the PDMS stamp. Why might work of\nadhesion of water be correlated with protein transfer, as suggested by the authors?\ne) The authors next modified the surface of the PDMS stamp, to understand the effects of\nstamp chemistry on protein transfer. To do so, the PDMS stamp was first oxidized using\nan air plasma. After plasma treatment, the stamps were treated with (tridecafluoro-\n1,1,2,2,-tetrahydrooctyl)-1-trichlorosilane vapor or aminopropyl trimethoxysilane and 50\nmmol HCl in ethanol (see Materials and Methods). Provide the expected reactions that\nwould result in -CF3 and -NH2 modified surfaces, respectively.\nf) Using the modified stamps, the fraction of -COOH thiols required for protein transfer\nchanged to 0% for -CF3 modified stamps and 80% for -NH2 modified stamps (compared\nwith 55% for unmodified stamps). Provide an explanation for these findings.\ng) Would you expect the -CF3 and -NH2 modified stamp surfaces to be stable in air?\nWhy or why not?\n2. (15 pts) Polylactide (PLA) is used in biomedical applications due to its\nphysicochemical properties and degradability. For tissue engineering applications,\nhowever, cell adhesion and proliferation on PLA is generally poor. To enhance cartilage\ncell adhesion to PLA scaffolds, Yu et al. (J. Biomed. Res. Part B: Appl. Biomater, 76B,\n64, 2006) developed a block copolymer of PLA and poly(ethylene glycol) (PEG) to be\nused as an additive in PLA. To induce adhesion of chondrocytes, various amino acids or\nthe peptide RGD were coupled to the free PEG chain end of the PLA-PEG block\ncopolymer (referred to as PLE).\n\nPEO\n3.051J/20.340J Problem Set 4\ndue 3/23/06\na) In the synthesis of the block copolymer (PLE), the -OH terminus of PLA (0.83 mmol\neq.) was first coupled with 4,4'-methylenediphenyl diisocyanate (MDI, 0.89 mmol) and\nsubsequently reacted with 0.37 mmol of PEG which had -OH terminal groups at each\nend. What undesirable product(s) might be obtained in the reaction with this\nstoichiometry?\nCH2\nNCO\nO\nPLA O C NH\nPLA OH + OCN\nCH2\nNCO\nO\nPLA O\nPEG\nCH2\nNH C O CH2CH2O H\nC NH\nn\nO\nO\nCH3SO2Cl, NEt3\nPLA O C\nCH2\nNH C O CH2CH2O nSO2CH3\nO\nNH\nR\nR\nO\nH2N\nCH\n\nCOOH\nPLA O\nCH2\nNH C O CH2CH2O NH CH COOH\nC NH\nn\nO\nScheme 1. Synthetic pathways of peptide-bearing PLA-PEG diblock copolymer\nb) To couple amino acid(s) onto the hydroxyl group of the PEG chain end, the -OH\nshould first be activated, and methansulfonyl chloride was employed with triethylamine\n(NEt3) in this research. Explain the role of NEt3 in this reaction. Is there an alternative\nreagent to enhance the OH activation?\nThe figure below shows chondrocyte proliferation (percentage of cells originally seeded\nadhered to surface after 72 h) on films of neat PLA and PLA modified by adding a\nfraction of PLE62 (6000 g/mol PLA, 2000 g/mol PEG) or a PLE62 derivative to the film\ncasting solution. Films were made by casting polymer solutions into a round glass mold\nand allowing the solvent (methyl chloride) to evaporate in air over 24 h. PLE62\nderivatives employed as additives included PLE62 end-modified with the amino acid(s)\nL-aspartic acid (PLE62asp), L-arginine (PLE62arg), or L-lysine (PLE62lys), or the\npeptide sequence RGD (PLE62 RGD). As a control, chondrocytes were also seeded on\ntissue culture polystyrene (TCPS), known to promote cell attachment.\nc) From the data below, films of PLA incorporating PLE62 showed similar levels of cell\nattachment/proliferation as PLA. Provide an explanation for these results.\n\n3.051J/20.340J Problem Set 4\ndue 3/23/06\nImage removed for copyright reasons.\nd) The data also show that films modified with PLE62arg and PLE62lys exhibited higher\ncell adhesion/proliferation than films modified with PLE62asp. Explain why this might\nbe the case. Would these systems form bonds with cell surface integrins?\ne) Only PLA modified with PLE62 RGD demonstrated measurable cell proliferation\n(values >100%). Why might this system exhibit improved proliferation of chondrocytes?\nSee Fig. 10(b) in Yu, Guanhua, Jian Ji, Huiguang Zhu, and Jiacong Shen.\n\"Poly(D,L-lactic acid)-block-(ligand-tethered poly(ethylene glycol)) Copolymers as Surface\nAdditives for Promoting Chondrocyte Attachment and Growth.\" J Biomed Mat Res Part B:\nAppl Biomater 76B (2006): 64-75."
    },
    {
      "category": "Resource",
      "title": "ps5_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/28ba2938423acdbe33850a335ac607c8_ps5_sol.pdf",
      "content": "3.051J/BE.340 Problem Set 5\nSolutions\n1) (20 pts) Surfaces that guide the growth of neuronal axons are of interest for\nreconstructing severed nerve tissues, and for the fabrication of neuronal networks on\nmicroelectrode arrays to study biological response to toxins and pharmaceuticals. In a\nrecent effort, Beebe and coworkers (Z. Zhang et al., Biomaterials 2005, 26, 47) studied\nneurite outgrowth on glass surfaces treated with different surface modifications.\nIn one surface modification, the glass surface was first reacted with 3-mercaptopropyl\ntrimethoxysilane (MTS) and subsequently with N-γ-maleimidobutyryloxy succinimide\nester (GMBS), to allow coupling of peptides and proteins, as shown in the scheme below.\nXPS was performed on the surface after each step of the surface modification. High\nresolution C1s spectra were deconvoluted into contributions from different bond\nconfigurations. For the MTS-modified surface, 2 peaks were found with binding energies\nof 284.6 eV (58%) and 285.7 eV (42%). After modification with GMBS, four C1s peak\ncontributions were resolved, at energies 284.6 eV (28%), 285.7 eV (52%), 287.0 eV\n(13%) and 289.1 eV (7%).\na) (5 pts) What chemical groups contribute to each of the peaks observed in the XPS data\nfor these samples?\nFor the MTS-modified surface:\n284.6 eV: SiCH2CH2C\n285.7 eV: OCH3, CCH2S\nFor the GMBS-modified surface:\n284.6 eV: SiCH2CH2C, CCH(CO) (ring), NCH2CH2CH2COO, CCH2CH2C (ring)\n285.7 eV: OCH3, CCH2S, SCCH(CO) (ring), NCH2CH2\nImage removed for copyright reasons.\nSee Fig. 1(a) in Zhang, Zhanping, Raphael Yoo, Matthew Wells, Thomas P. Beebe, Jr., Roy Biran, and Patrick Tresco.\n\"Neurite outgrowth on well-characterized surfaces: preparation and characterization of chemically and spatially controlled\nfibronectin and RGD substrates with good bioactivity.\" Biomaterials 26 (2005): 47-61.\n\n3.051J/BE.340 Problem Set 5\nSolutions\n287.0 eV: CCON (rings)\n289.1 eV: CCOO\nb) (3 pts) Compare the observed peak ratio for the MTS-modified surface with the ratio\nyou would expect from the chemical scheme proposed. What might explain the\ndiscrepancies?\nFor the MTS-modified surface, the expected ratio 284.6 eV: 285.7 eV is 2:3 based on\nstoichiometry, while the observed is closer to 3:2. The deviation may indicate\nhydrocarbon surface contamination or loss of -OCH3 side groups of the silane, e.g.,\nthrough formation of an Si-O-Si linkage with a neighboring coupled MTS group.\nc) (2 pts) For the GMBS-modified surface, does the XPS spectrum support the proposed\nchemical scheme? Explain.\nFor the GMBS-modified surface the expected ratio 284.6 eV: 285.7 eV: 287.0 eV:\n289.1 eV is 7:5:4:1 based on the proposed chemistry, while the observed ratio is\n4:7.5:2:1. The large deviation in the expected and observed peak ratios suggest the\nsurface modification did not yield the proposed chemical structure. The 2:1 ratio of\nCON to COO groups suggests that the ester group may have hydrolyzed to form a\nterminal COOH.\nd) (6 pts) Static SIMS measurements were also performed on the GMBS-modified\nsurface. A portion of the positive ion spectrum is shown below. From the reported\nsurface chemistry, provide all possible chemical fragments that might contribute to the 6\nhighest peaks of the spectra (assume a +1 charge).\nImage removed for copyright reasons.\nSee Fig. 3(a), second image, in Zhang, Zhanping, Raphael Yoo, Matthew Wells, Thomas P. Beebe, Jr., Roy Biran, and\nPatrick Tresco. \"Neurite outgrowth on well-characterized surfaces: preparation and characterization of chemically\nand spatially controlled fibronectin and RGD substrates with good bioactivity.\" Biomaterials 26 (2005): 47-61.\n77 amu: C5NH3\n79 amu: C4NOH, C5NH5\n81 amu: C4O2H, C4NOH3, SiOC3H, SC4H\n83 amu: C4O2H3, C4NOH5, SiOC3H3, SC4H3\n91 amu: C6NH5, C5NOH\n95 amu: C4O2NH, C5NOH5, SC4NH\n\n3.051J/BE.340 Problem Set 5\nSolutions\ne) Following reaction with GMBS, the peptide GRGDSY or the protein fibronectin were\ncovalently coupled to the surface. Neurite outgrowth on these surfaces was compared to\nthat of the GMBS-modified surface alone. Data for neurite length after 72 h in serum\nfree media is shown in the figure below. Outgrowth on the RGD-coupled surface in the\npresence of soluble RGD was also measured.\ni) (2 pts) Neurite outgrowth was more prominent on the fibronectin-coupled surface\ncompared with the RGD-coupled surface. What might explain this result?\nFibronectin has other adhesion sites besides the RGD sequence that could promote\naxon outgrowth.\nii) (2 pts) When soluble RGD peptide was added to the medium of neurons seeded on the\nRGD-coupled surface, the neurite length was reduced to a value comparable to the\nGMBS-modified surface. Explain this finding.\nSoluble RGD competes with coupled RGD in complexing with neuron integrins,\ncausing bonds to the surface to be reduced, and thereby limiting axon outgrowth.\nImage removed for copyright reasons.\nSee Fig. 7 in Zhang, Zhanping, Raphael Yoo, Matthew Wells, Thomas P. Beebe, Jr., Roy Biran, and Patrick Tresco.\n\"Neurite outgrowth on well-characterized surfaces: preparation and characterization of chemically and spatially controlled\nfibronectin and RGD substrates with good bioactivity.\" Biomaterials 26 (2005): 47-61.\n2. (12 pts) Venous catheters are used in patients who require long-term IV therapy, such\nas chemotherapy or hemodialysis. Such catheters are highly susceptible to clot\nformation. In an attempt to reduce risk of clot formation, Byun and coworkers (O.D.\nKrishna et al., Biomaterials 2005, 26, 7115) covalently grafted a phospholipid layer onto\na silicone catheter and performed platelet adhesion studies on the unmodified and\nmodified catheters. Grafting was achieved by first performing plasma polymerization of\nallyl alcohol (H2C=CHCH2OH), followed by reaction of resulting -OH surface groups\nwith acryloyl chloride in 5% solution in tetrahydrofuran for 7 h to create vinyl groups on\nthe surface. Finally, monoacrylated phospholipids (1stearoyl-2-[12-(acryloyloxy)\ndodecanoyl]-sn-glycero-3-phosphocholine) were covalently bonded to the surface by\nassembling vesicles of the acrylated phospholipid on the surface and heating at 80°C for\n15 min. A schematic of the surface modification procedure is shown below.\n\n3.051J/BE.340 Problem Set 5\nSolutions\nImage removed for copyright reasons.\nSee Fig. 1 in Krishna, Ohm D., Kwangmeyung Kim, and Youngro Byun. \"Covalently grafted phospholipid\nmonolayer on silicone catheter surface for reduction in platelet adhesion.\" Biomaterials 26 (2005): 7115-7123.\nXPS was performed on the initial silicone surface, and the surface after each step of the\nmodification. The table below provides atomic concentrations determined from the low\nresolution spectra for samples measured at a take-off angle of 45° using Mg Kα radiation\n(E=1254 eV). (Si 2p, C 1s, O 1s and N1s electrons).\nImage removed for copyright reasons.\nSee Table 1 in Krishna, Ohm D., Kwangmeyung Kim, and Youngro Byun. \"Covalently grafted phospholipid\nmonolayer on silicone catheter surface for reduction in platelet adhesion.\" Biomaterials 26 (2005): 7115-7123.\na) (3 pts) The Si concentration is first observed to decrease after plasma polymerization\nof allyl alcohol (Sil-Al) and then to increase after reaction with acryloyl chloride (Sil-Al-\nAc). Provide a likely explanation for these results.\nThe reduction in Si signal is due to the polymerized allyl alcohol layer (Al) created\non the silicone surface. This layer decreases the probability that Si 2p electrons are\nable to escape from the surface to be detected. The increase in Si concentration\nafter reaction with acryloyl chloride suggests that the thickness of the Al layer has\ndecreased during the reaction. This is possible because plasma polymerization often\nleads to unbound polymer molecules intermixed with grafted molecules. The\nreaction with acryloyl chloride was performed in organic solvent (THF) over an\n\n3.051J/BE.340 Problem Set 5\nSolutions\nextended period, which allowed for the dissolution of polymers in the Al layer that\nwere not covalently grafted.\nb) (7 pts) Using the data provided, estimate the thickness of the grafted phospholipid\n(PC) layer.\nTo obtain a measure of the PC layer thickness, we can model the Sil-Al-Ac and Sil-\nAl-AcPC samples as 2 layers (Sil (2) and Al-Ac (1) or Sil (2) and Al-AcPC (1)) to\ndetermine the thickness of the Al-Ac and Al-AcPC layers. Taking the difference of\nthese thicknesses then provides an estimate for the PC layer thickness.\nWe can perform this calculation using the Si 2p signal, which arises solely from the\nbottom silicone layer:\n⎛\n-d\n⎞\nISi 2 p = ISi 2 p,inf exp\n⎝\n⎜λ sinθ ⎠\n⎟\ne,1\nISi 2 p\nRearranging this expression: d = -λ sinθ ln\n(2)\nI\ne,1\nSi 2 ,inf\np\n-1\n-2\n.5\nfor polymers: λe,1(nm) = ρ (49E\n+ 0.11Ekin )\nkin\nEB = hv -Ekin\nfor MgK x-rays: hv = 1254 eV\nα\n= 102 eV\n,\nEB Si2 p\n→Ekin = 1152 eV\n-1\nλe,1(nm) = 3.73ρ\nIf we assume a polymer density of 1.1 g/cm3 then λ\n= 3.4 nm\ne,1\nFor the Si-Al-Ac sample: d = -3.4 sin 45 ln\n=1.3 nm\n21.9\n10.5\nFor the Si-Al-AcPC sample: d = -3.4 sin 45 ln\n=1.8 nm\n21.9\nThe PC layer thickness is therefore estimated to be 0.5 nm thick.\nc) (2 pts) Based on your result from (b), does the PC layer grafted on the silicone catheter\nhave a comparable packing density to lipid layers within a cell membrane, as suggested\nin the schematic?\nThe phospholipids are much longer than 0.5 nm when the tails are extended, as\nwould be expected in a dense-packed configuration. The grafted layer appears to\n\n3.051J/BE.340 Problem Set 5\nSolutions\nhave significantly lower packing density than a cell membrane. A typical cell\nmembrane phospholipid bilayer is ~ 5-10 nm thick, so a monolayer would be ~ 2.5-5\nnm thick.\n3. (8 pts) As a novel strategy for nanoscale patterning of proteins on SAM surfaces, G.Y.\nLiu developed an approach utilizing the AFM (K. Wadu-Mesthridge et al., Biophysical J.\n2001, 80, 1891). In an aqueous medium containing 1 mM mercaptopropanoic acid\n(MPA) (HSCH2CH2COOH), a large constant force (10-30 nN) was applied as the tip\nrastered across a region of specified dimension of a decanethiol (HS(CH2)9CH3) SAM.\nThe high force disrupted the gold-thiol bonds, causing decanethiol molecules to be\nreleased from the region. The exposed gold regions were subsequently coated by\nmercaptopropionic acid molecules in the medium. Finally, the surface was exposed to 10\nμg/ml solution of lysozyme (LYZ), a positively charged protein at pH 7 with\napproximate dimensions 4.5×3×3 nm3, to obtain the surface shown in (C) below.\na) (2 pts) In this strategy, why are the released decanethiol molecules displaced by MPA,\nrather than readsorbing to the exposed Au surface?\nThe MPA molecules are in much higher concentration in solution than the\ndecanethiol molecules, and also able to diffuse faster, due to their smaller size.\nb) (2 pts) Why are the lysozyme molecules observed to adsorb only to the regions\npatterned with MPA molecules?\nThe MPA regions are terminated with -COOH groups. At pH 7, the MPA regions\nexhibit a partial negative charge. Positively charged LYZ shows a high affinity for\nthese regions due to electrostatic attraction. The hydrophobic decanethiol regions of\nthe surface would also be susceptible to protein adsorption, but apparently with\nlower affinity than to the MPA surface. The concentration of LYZ in solution (10\nμg/ml) was too low to observe any molecules adsorbed on the decanethiol SAM\nwithin the 400×400 nm2 image. At higher solution concentrations, adsorption on the\nhydrophobic regions would be expected.\nc) (2 pts) LYZ molecules adsorbed to the patterned line appear to adopt a different\norientation than those adsorbed in the rectangular region. What could account for this\ndifference?\nThe patterned line has a width of 10 nm, on the same scale as the LYZ dimensions.\nTherefore, LYZ molecules adsorbed in the line are likely to interact with the\nhydrophobic regions of the decanethiol molecules that make up the \"walls\" of the\npatterned groove. Interactions with hydrophobic regions may favor a vertical\norientation of the proteins.\nd) (2 pts) Do the LYZ molecules appear to be denatured on the MPA surface? Explain\nyour reasoning.\n\n3.051J/BE.340 Problem Set 5\nSolutions\nThe two feature heights observed in (D) (3.0 nm and 4.3 nm) are consistent with the\nreported globular dimensions of LYZ, which suggests the molecules are adsorbed\nsubstantially intact.\nImages removed for copyright reasons.\nSee Fig. 2 in Wadu-Mesthrige, Kapila, Nabil A. Amro,\nJayne C. Garno, Song Xu, and Gang-yu Liu. \"Fabrication\nof Nanometer-Sized Protein Patterns Using Atomic Force\nMicroscopy and Selective Immobilization.\" Biophysical\nJournal 80 (2001): 1891-1899.\nA) 400×400 nm2 image of initial\ndecanethiol SAM; B) a 10×150 nm2 line\nand 100×150 nm2 rectangle of MPA\nwritten into decanthiol SAM; C) region\nafter exposure to LYZ solution; D) cross-\nsection profiles taken from the white\nlines on images (B) and (C). The y-\norigin represents the Au surface."
    },
    {
      "category": "Resource",
      "title": "ps5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/3cfbe4852942dfd8d92db0ff1a9438a9_ps5.pdf",
      "content": "3.051J/BE.340 Problem Set 5\ndue 4/13/06\n1) (20 pts) Surfaces that guide the growth of neuronal axons are of interest for\nreconstructing severed nerve tissues, and for the fabrication of neuronal networks on\nmicroelectrode arrays to study biological response to toxins and pharmaceuticals. In a\nrecent effort, Beebe and coworkers (Z. Zhang et al., Biomaterials 2005, 26, 47) studied\nneurite outgrowth on glass surfaces treated with different surface modifications.\nIn one surface modification, the glass surface was first reacted with 3-mercaptopropyl\ntrimethoxysilane (MTS) and subsequently with N-γ-maleimidobutyryloxy succinimide\nester (GMBS), to allow coupling of peptides and proteins, as shown in the scheme below.\nImage removed for copyright reasons.\nSee Fig. 1(a) in Zhang, Zhanping, Raphael Yoo, Matthew Wells, Thomas P. Beebe, Jr., Roy Biran, and Patrick Tresco.\n\"Neurite outgrowth on well-characterized surfaces: preparation and characterization of chemically and spatially controlled\nfibronectin and RGD substrates with good bioactivity.\" Biomaterials 26 (2005): 47-61.\nXPS was performed on the surface after each step of the surface modification. High\nresolution C1s spectra were deconvoluted into contributions from different bond\nconfigurations. For the MTS-modified surface, 2 peaks were found with binding energies\nof 284.6 eV (58%) and 285.7 eV (42%). After modification with GMBS, four C1s peak\ncontributions were resolved, at energies 284.6 eV (28%), 285.7 eV (52%), 287.0 eV\n(13%) and 289.1 eV (7%).\na) What chemical groups contribute to each of the peaks observed in the XPS data for\nthese samples?\nb) Compare the observed peak ratio for the MTS-modified surface with the ratio you\nwould expect from the chemical scheme proposed. What might explain the\ndiscrepancies?\nc) For the GMBS-modified surface, does the XPS spectrum support the proposed\nchemical scheme? Explain.\nd) Static SIMS measurements were also performed on the GMBS-modified surface. A\nportion of the positive ion spectrum is shown below. From the reported surface\n\n3.051J/BE.340 Problem Set 5\ndue 4/13/06\nchemistry, provide all possible chemical fragments that might contribute to the 6 highest\npeaks of the spectra (assume a +1 charge).\nImage removed for copyright reasons.\nSee Fig. 3(a), second image, in Zhang, Zhanping, Raphael Yoo, Matthew Wells, Thomas P. Beebe, Jr., Roy Biran, and\nPatrick Tresco. \"Neurite outgrowth on well-characterized surfaces: preparation and characterization of chemically\nand spatially controlled fibronectin and RGD substrates with good bioactivity.\" Biomaterials 26 (2005): 47-61.\ne) Following reaction with GMBS, the peptide GRGDSY or the protein fibronectin were\ncovalently coupled to the surface. Neurite outgrowth on these surfaces was compared to\nthat of the GMBS-modified surface alone. Data for neurite length after 72 h in serum\nfree media is shown in the figure below. Outgrowth on the RGD-coupled surface in the\npresence of soluble RGD was also measured.\ni) Neurite outgrowth was more prominent on the fibronectin-coupled surface compared\nwith the RGD-coupled surface. What might explain this result?\nii) When soluble RGD peptide was added to the medium of neurons seeded on the RGD-\ncoupled surface, the neurite length was reduced to a value comparable to the GMBS-\nmodified surface. Explain this finding.\nImage removed for copyright reasons.\nSee Fig. 7 in Zhang, Zhanping, Raphael Yoo, Matthew Wells, Thomas P. Beebe, Jr., Roy Biran, and Patrick Tresco.\n\"Neurite outgrowth on well-characterized surfaces: preparation and characterization of chemically and spatially controlled\nfibronectin and RGD substrates with good bioactivity.\" Biomaterials 26 (2005): 47-61.\n\n3.051J/BE.340 Problem Set 5\ndue 4/13/06\n2. (12 pts) Venous catheters are used in patients who require long-term IV therapy, such\nas chemotherapy or hemodialysis. Such catheters are highly susceptible to clot\nformation. In an attempt to reduce risk of clot formation, Byun and coworkers (O.D.\nKrishna et al., Biomaterials 2005, 26, 7115) covalently grafted a phospholipid layer onto\na silicone catheter and performed platelet adhesion studies on the unmodified and\nmodified catheters. Grafting was achieved by first performing plasma polymerization of\nallyl alcohol (H2C=CHCH2OH), followed by reaction of resulting -OH surface groups\nwith acryloyl chloride in 5% solution in tetrahydrofuran for 7 h to create vinyl groups on\nthe surface. Finally, monoacrylated phospholipids (1stearoyl-2-[12-(acryloyloxy)\ndodecanoyl]-sn-glycero-3-phosphocholine) were covalently bonded to the surface by\nassembling vesicles of the acrylated phospholipid on the surface and heating at 80°C for\n15 min. A schematic of the surface modification procedure is shown below.\nImage removed for copyright reasons.\nSee Fig. 1 in Krishna, Ohm D., Kwangmeyung Kim, and Youngro Byun. \"Covalently grafted phospholipid\nmonolayer on silicone catheter surface for reduction in platelet adhesion.\" Biomaterials 26 (2005): 7115-7123.\nXPS was performed on the initial silicone surface, and the surface after each step of the\nmodification. The table below provides atomic concentrations determined from the low\nresolution spectra for samples measured at a take-off angle of 45° using Mg Kα radiation\n(E=1254 eV). (Si 2p, C 1s, O 1s and N1s electrons).\nImage removed for copyright reasons.\nSee Table 1 in Krishna, Ohm D., Kwangmeyung Kim, and Youngro Byun. \"Covalently grafted phospholipid\nmonolayer on silicone catheter surface for reduction in platelet adhesion.\" Biomaterials 26 (2005): 7115-7123.\na) The Si concentration is first observed to decrease after plasma polymerization of allyl\nalcohol (Sil-Al) and then to increase after reaction with acryloyl chloride (Sil-Al-Ac).\nProvide a likely explanation for these results.\n\n3.051J/BE.340 Problem Set 5\ndue 4/13/06\nb) Using the data provided, estimate the thickness of the grafted phospholipid (PC) layer.\nc) Based on your result from (b), does the PC layer grafted on the silicone catheter have a\ncomparable packing density to lipid layers within a cell membrane, as suggested in the\nschematic?\n3. (8 pts) As a novel strategy for nanoscale patterning of proteins on SAM surfaces, G.Y.\nLiu developed an approach utilizing the AFM (K. Wadu-Mesthridge et al., Biophysical J.\n2001, 80, 1891). In an aqueous medium containing 1 mM mercaptopropanoic acid\n(MPA) (HSCH2CH2COOH), a large constant force (10-30 nN) was applied as the tip\nrastered across a region of specified dimension of a decanethiol (HS(CH2)9CH3) SAM.\nThe high force disrupted the gold-thiol bonds, causing decanethiol molecules to be\nreleased from the region. The exposed gold regions were subsequently coated by\nmercaptopropionic acid molecules in the medium. Finally, the surface was exposed to 10\nμg/ml solution of lysozyme (LYZ), a positively charged protein at pH 7 with\napproximate dimensions 4.5×3×3 nm3, to obtain the surface shown in (C) below.\na) In this strategy, why are the released decanethiol molecules displaced by MPA, rather\nthan readsorbing to the exposed Au surface?\nb) Why are the lysozyme molecules observed to adsorb only to the regions patterned with\nMPA molecules?\nc) LYZ molecules adsorbed to the patterned line appear to adopt a different orientation\nthan those adsorbed in the rectangular region. What could account for this difference?\nd) Do the LYZ molecules appear to be denatured on the MPA surface? Explain your\nreasoning.\nImages removed for copyright reasons.\n\nSee Fig. 2 in Wadu-Mesthrige, Kapila, Nabil A. Amro,\n\nJayne C. Garno, Song Xu, and Gang-yu Liu. \"Fabrication\n\nof Nanometer-Sized Protein Patterns Using Atomic Force\nA) 400×400 nm2 image of initial\nMicroscopy and Selective Immobilization.\" Biophysical\ndecanethiol SAM; B) a 10×150 nm2 line\nJournal 80 (2001): 1891-1899.\n\nand 100×150 nm2 rectangle of MPA\nwritten into decanthiol SAM; C) region\nafter exposure to LYZ solution; D) cross-\nsection profiles taken from the white\nlines on images (B) and (C). The y-\norigin represents the Au surface."
    },
    {
      "category": "Resource",
      "title": "pracfinal.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/f46ac296bd28aec08e33f2a184332bf8_pracfinal.pdf",
      "content": "3.051J/20.340J\n\nMaterials for Biomedical Applications\n\nFinal Exam\n\nMay 17, 2004\n\n1. (38 pts) Amyotrophic lateral sclerosis, ALS, also known as Lou Gherig's disease, is a neuromuscular\ndisorder in which patients gradually lose peripheral motor activity. One approach under investigation\nfor treatment of ALS combines gene therapy with cell encapsulation therapy. In the ALS treatment\nunder consideration, rodent cell lines are modified genetically to release ciliary derived neurotrophic\nfactor, CNTF, an agent which has shown promise for slowing the deterioration of neurons in more\nconventional preclinical drug tests. In conventional cell culture studies, Hamster-BHK cells transfected\nwith the gene for CNTF, showed promisingly high secretion rates of 1 ng/106cells/day.\n\nYou are working for a company that is developing a cell encapsulation device to house the Hamster-\nBHK cells in vivo. Prototype membranes having the porosity characteristics given in the table below\nhave been developed.\n\n(a) What functions does the membrane serve in this device? (3 pts)\n\n(b) What processing route would be used to make the membrane for this device? What would be a\ntypical material for such a membrane? (4 pts)\n\n(c) Which prototype membrane will exhibit the highest CNTF delivery rates, assuming the same number\nof cells is contained in each device? Justify your response quantitatively, stating any assumptions you\nmake. (6 pts)\n\nMembrane\nPrototype\n\nPore size (A)\n\n16±7\n\n27±7\n\n46±20\nSurface\nPorosity (%)\n\n0.044±0.008\n\n0.045±0.006\n\n0.053±0.006\n\nThickness (μm)\n\n670±25\n\n810±14\n\n819±22\n\nSemipermeable\nmembrane\nGel & cells\n4 mm\nL\n2.5 mm\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\n(d) Approximately how long should this device be (L) to hold 106 cells? State any assumptions you\nmake in arriving at your value. (4 pts)\n(e) Based on pore size considerations, would any of the prototype membranes be expected to exclude the\nantibody IgG (molecular weight 160,000 g/mol)? Justify your response as quantitatively as possible,\nstating any assumptions you make. (5 pts)\n(f) In prototype devices prepared by your company, cells were seeded in a polyethylene oxide (PEO)\nhydrogel within the membrane, and cultured in nutrient-rich media to test for CNTF release. To your\nmanagement's dismay, the release rate was found to be much lower than anticipated from studies of the\nsame cells seeded on conventional culture plates. Moreover, CNTF secretion was seen to decrease\nmonotonically over several days in culture. Provide two likely explanations for these observations. (4\npts)\n(g) Suggest design changes to the device to rectify the problems noted in (f). (4 pts)\n(h) Would you expect this device to be more resistant to crushing in the longitudinal or transverse\ndirection? Justify your answer quantitatively. (5 pts)\n(i) Your company is also considering development of cell encapsulation therapies for type I diabetes\nbased on these membranes. Would you recommend pursuing this application? Explain your answer. (3\npts)\n2. (34 pts) Expanded polytetrafluoroethylene (ePTFE) is a commonly used material for synthetic\nvascular grafts. One mode of failure of such devices is via bacterial infection initiated during\nimplantation. Upon the introduction of a foreign material into the body, a competition for the surface\nensues between bacteria and leukocytes that serve to fight infection. One hypothesis for elevated\ninfection rates for PTFE graft implantations is that leukocyte migration is impeded on ePTFE surfaces,\nallowing bacteria to become established in the early stages following implantation.\n(a) Describe the process by which leukocytes are attracted and migrate to the site of a vascular graft\nimplantation. (4 pts)\nTo investigate which integrin subunits play a significant role in leukocyte migration on ePTFE, Chang\nand coworkers performed random migration studies on populations of fluorescently labeled\npolymorphonuclear leukoocytes (PMN's or neutrophils) exposed to antibodies for different integrin\nsubunits. Confocal microscopy images depicting PMN migration on ePTFE after 3 h of incubation with\nIgG (A) or anti-CD18 (C) are shown below.\n(b) Explain how one would obtain a motility coefficient for the PMN's from such data. (4 pts)\n(c) Provide a molecular level explanation for the observed differences in migration between PMN's\nexposed to anti-CD18 vs. those exposed to IgG. (3 pts)\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\nAs a potential surface modification method for ePTFE, Kidd and Williams investigated temporarily\nseeding epithelial cells onto ePTFE to deposit extracellular matrix proteins and thus potentially improve\nendothelial cell adhesion and vascularization of new tissues. In their study, 6 different cell types were\nseeded on ePTFE: human microvessel endothelial cells (HMVEC), rat microvessel endothelial cells\n(RMVEC), human squamous epithelial cell line (HaCaT), a tumorigenic variant of HaCaT (II-4), rat\nbladder squamous cell carcinoma cell line (804-G), and lung carcinomatous epithelial cell line (A549).\nCells were seeded at equivalent densities and left in culture for 8 days, after which they were removed\nusing ammonium hydroxide, which allowed deposited ECM proteins to remain on the surface.\nSubsequently, ECM was collected from the surface of the ePTFE with a rubber scraper and SDS\npolyacrylamide gel electrophoresis was performed to determine the proteins present. Western blot\nanalysis was performed employing rabbit or mouse antibodies for collagen I, collagen IV, fibronectin,\nlaminin-1 and laminin-5 in different lanes of the gel, followed by a secondary antibody, rat antimouse\nIgG or goat antirabbit IgG, conjugated to horseradish peroxidase. Results from the SDS-PAGE study\nare shown below.\n(d) Explain the function of the two antibodies used in the Western blot analysis. (4 pts)\n(e) Based on the SDS-PAGE results, which protein has a higher molecular weight, fibronectin or\nlaminin-5? Explain. (2 pts)\nImages removed for copyright reasons.\nSee Fig. 4(a) and (c) in Chang, Charlie C., Rene S. Rosenson-Schloss, Tanuja D. Bhoj, and Prabhas\nV. Moghe. \"Leukocyte Chemosensory Migration on Vascular Prosthetic Biomaterial is Mediated by an\nIntegrin ß2 Receptor Chain.\" Biomaterials 21 (2000): 2305-2313.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\nTo ascertain the effects of ECM-modification on vascularization near the ePTFE grafts, discs of ePTFE\nmodified as described above were implanted into the fatty tissue of rats. After 5 weeks, the devices\nwere explanted and tissues in the vicinity of the implant examined for new vessel growth. Data\nquantifying angiogenesis and neovascularization are given in the figure below, reported as means and\nstandard deviations of n=4 samples for RMVEC-, HMVEC, A549-, and II-4-modified samples and n=8\nsamples for 804-G, HaCaT and nonmodified samples.\n(f) Describe the expected tissue morphology in the vicinity of the ePTFE implant after (i) five days; (ii)\nfive weeks. (6 pts)\n(g) Which of the ECM-modified samples exhibit a statistically significant increase in angiogenesis\ncompared with the unmodified ePTFE control? (6 pts)\n(h) From the data provided, give a possible explanation for your findings in (g). (2 pts)\n(i) How might the results of this study be relevant to cancer therapies? (3 pts)\nImages removed for copyright reasons.\nSee Fig. 1 in Kidd, Kameha R., and Stuart K. Williams. \"Laminin-5-enriched Extracellular Matrix\nAccelerates Angiogenesis and Neovascularization in Association with ePTFE.\" J Biomed Mater\nRes 69A (2004): 294-304.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\n3. (39 pts) Over 15M people in the United States alone are afflicted with type I diabetes, a disease in\nwhich the pancreas fails to generate adequate insulin necessary for metabolizing glucose. The\nmanagement of blood glucose is currently achieved by active monitoring of blood glucose\nconcentration, typically ranging from 1-30 mM, along with daily insulin injections to replace or\nsupplement the patient's natural hormone production.\n(a) Describe the operation of commercial biosensor devices used for glucose monitoring. (4 pts)\nAs a potential new method for glucose monitoring, Hsieh et al. developed a surface plasmon resonance\ndevice. For this device, bacterially-derived glucose/galactose-binding protein (GGBP), a known\nreceptor for glucose, was covalently attached to the SPR surface by replacing specific amino acids in the\nstructure by cysteine (R group= CH2SH) through genetic mutation. Below is a ribbon diagram of GGBP\nshowing its binding pocket for glucose and locations of mutation sites.\n(b) Sketch the general reaction employed to bind the GGBP to the SPR surface. (2 pts)\n804-G\nHaCaT\nHMVEC\nRMVEC\nII-4\nA549\nMatrigel\nNon-Modified\nVessels per mm2\nAngiogenesis\nNeovascularization\nFigure by MIT OCW.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\n(c) Is this device a biosensor? What constitutes the detection element, analyte and transducer? (4 pts)\nThe figure below shows the SPR signal (RU= response units, 1RU ~1 pg/mm2) generated upon the\ninjection of 100 μM glucose in a running buffer solution flowing at 5 μl/min over a surface coated with\nGGBP mutated at the E149 site (solid line), and a second surface prepared with E149-mutated GGBP\nsubsequently denatured by overnight exposure to 1M guanidine HCl (dashed line).\nImage removed for copyright reasons.\nSee Fig. 1 in Hsieh, H. V., Z. A. Pfeiffer, T. J. Amiss, D. B. Sherman, J. B. Pitner. \"Direct Detection of\nGlucose by Surface Plasmon Resonance with Bacterial Glucose/galactose-binding Protein.\" Biosensors\nand Bioelectronics 19 (2004): 653-660.\nTime (sec)\nBegin injection\nBlank surface\nDenatured E149C GGBP surface\nEnd injection\nE149C GGBP surface\nRU\nFigure by MIT OCW.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\n(d) Explain the observed features in the SPR signal as a function of time for the E149C mutant GGBP\nsurface (solid line). (3 pts)\n(e) Why does the SPR signal differ when E149C GGBP is denatured prior to glucose exposure? (2 pts)\n(f) What techniques could you use to characterize changes in the: (i) secondary structure content, (ii)\nsurface chemistry, (iii) surface morphology and (iv) thickness of the GGBP layer after exposure to\nguanidine HCl? (8 pts)\nIn a series of experiments, the SPR signal change was recorded as a function of glucose concentration\nfor a E149C mutant GGBP surface and a GGBP with cysteine mutations at E149C, A213S and L238S,\nas shown below.\nRU\nRU\nGlucose (μM)\nGlucose (mM)\nE149C\nE149C, A213S,\nL238S\nFigure by MIT OCW.\n\n3.051J20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nMay 17, 2004\n(g) From the data provided, calculate the equilibrium dissociation constant for glucose-GGBP binding in\neach case. (6 pts)\n(h) Explain the observed differences in Kd for the two surfaces. (3 pts)\n(i) How would you expect the value of Kd to change if the cysteine mutation was performed at the K137\nsite? (2 pts)\n(j) Would either of the sensors above be useful for monitoring glucose levels typical in humans?\nExplain. (3 pts)\n(k) Provide one key drawback to the proposed SPR sensor for blood glucose monitoring. (2 pts)"
    },
    {
      "category": "Resource",
      "title": "pracfinalsol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/b6c23a059f163de09371eaabc30a0906_pracfinalsol.pdf",
      "content": "3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\n1. (38 pts) Amyotrophic lateral sclerosis, ALS, also known as Lou Gherig's disease, is a neuromuscular\ndisorder in which patients gradually lose peripheral motor activity. One approach under investigation\nfor treatment of ALS combines gene therapy with cell encapsulation therapy. In the ALS treatment\nunder consideration, rodent cell lines are modified genetically to release ciliary derived neurotrophic\nfactor, CNTF, an agent which has shown promise for slowing the deterioration of neurons in more\nconventional preclinical drug tests. In conventional cell culture studies, Hamster-BHK cells transfected\nwith the gene for CNTF, showed promisingly high secretion rates of 1 ng/106cells/day.\nYou are working for a company that is developing a cell encapsulation device to house the Hamster-\nBHK cells in vivo. Prototype membranes having the porosity characteristics given in the table below\nhave been developed.\n(a) What functions does the membrane serve in this device? (3 pts)\nThe membrane serves to contain the cells as well as isolate them from the immune system while\nstill allowing for permeability of nutrients, waste and CNTF.\n(b) What processing route would be used to make the membrane for this device? What would be a\ntypical material for such a membrane? (4 pts)\nA membrane could be formed using immersion precipitation of PAN-PVC, PP, polycarbonate,\ncellulose nitrate, or acrylic polymers. In this process, a polymer solution is coated onto a\ncylindrical substrate and the substrate is dipped into a coagulation bath that contains a poor\nsolvent for the polymer. The polymer precipitates onto the substrate and subsequent removal of\nthe substrate leaves a hollow fiber membrane.\n(c) Which prototype membrane will exhibit the highest CNTF delivery rates, assuming the same number\nof cells is contained in each device? Justify your response quantitatively, stating any assumptions you\nmake. (6 pts)\nMembrane\nPrototype\nPore size (A)\n16±7\n27±7\n46±20\nSurface\nPorosity (%)\n0.044±0.008 0.045±0.006 0.053±0.006\nThickness (μm)\n670±25\n810±14\n819±22\n\n3.051J/20.340J\n\nMaterials for Biomedical Applications\n\nFinal Exam\n\nSolutions\n\nBy substituting\ninto\n(\n)\nthe result is:\n(\n)\nAssuming that the internal and external concentrations within the different systems\ndo not change, that the tortu\npore\neff\nt\npore\nt\nD\nD\ndM\nDKA C\nC\ndt\nD\nKA\ndM\nC\nC\ndt\nε\nτ\nδ\nε\nδτ\n=\n=\n-\n=\n-\nosities of each membrane are equal, and that the devices\nare of the same size and have the same distribution coefficient K,\nonly depends\non\n\nt\ndM\ndt\nε\nδ\n\nMembrane Prototype\nSurface Porosity ε (%)\n0.044\n0.045\n0.053\nThickness δ (μm)\nε/δ\n6.56716E-05\n5.56E-05\n6.47E-05\nMembrane prototype 1 has the highest ratio of surface porosity to thickness and should exhibit the\nhighest CNTF delivery rate.\n\n(d) Approximately how long should this device be (L) to hold 106 cells? State any assumptions you\nmake in arriving at your value. (4 pts)\nSemipermeable\nmembrane\nGel & cells\n4 mm\nL\n2.5 mm\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\nAn approximate cell diameter is 10μm, and approximating the cell as a sphere to calculate the\ncellular volume yields 5.24E-7mm3/cell. This volume times 106 cells yields 0.524mm3. Solving for\nthe length of an inner chamber of this volume and a radius of 1.25mm results in a length of\n0.11mm. This does not account for extracellular space, and the device length would have to be\nincreased by the percent of unfilled volume within the device to accommodate a realistic cell\ndensity.\n-3\n4 π (5 10 mm) = 5.24E-7 mm\n\nx\ncell\n\n5.24E-7mm3\n(10 cells)=0.524mm3\ncell\n0.524mm = π (1.25) l\nl\n\n= 0.11mm\n(e) Based on pore size considerations, would any of the prototype membranes be expected to exclude the\nantibody IgG (molecular weight 160,000 g/mol)? Justify your response as quantitatively as possible,\nstating any assumptions you make. (5 pts)\nAn approximate protein density is 1.4g/cm3, and a protein of this MW would have a linear\ndimension of about 57x10-8 cm. The membrane with the largest pore size has a pore linear\ndimension of (46±20)x10-8 cm and therefore is not small enough to exclude IgG.\n-19\n\n160, 000 g\nmol\nx cm\n= 1.90 10 cm\n(1.90 10 cm\n\n) 3 = 57 10 cm\nx\n-19\n-8\nx\nx\nx\nmol\nx 6.02 10 -23 proteins\n1.4g\nprotein\nlinear dimension of largest pore = 4.6+2.0nm>5.7nm = linear dimesion of protein\n(f) In prototype devices prepared by your company, cells were seeded in a polyethylene oxide (PEO)\nhydrogel within the membrane, and cultured in nutrient-rich media to test for CNTF release. To your\nmanagement's dismay, the release rate was found to be much lower than anticipated from studies of the\nsame cells seeded on conventional culture plates. Moreover, CNTF secretion was seen to decrease\nmonotonically over several days in culture. Provide two likely explanations for these observations. (4\npts)\nThe device diameter is too large for nutrients to reach cells in the center of the device (the tube\nedges would be sealed). An approximate limit to the distance cells can be separated from a\nnutrient source is 0.5mm, so the inner diameter should be no larger than 1mm, but in this device it\nis 2.5mm. In addition, the PEO hydrogel does not contain any binding epitopes for the cells, and\ndoes not support protein adsorption needed for cell attachment and proper functioning.\n(g) Suggest design changes to the device to rectify the problems noted in (f). (4 pts)\nTo provide binding epitopes for cells, the membrane could encapsulate cells seeded into a network\nof collagen. To remedy transport problems, the device dimensions could be decreased or the\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\ngeometry of the device could be changed to a disc. If a tubular device with an inner diameter of\n1mm were fabricated, it would have to be 0.67mm long to encapsulate 106 cells.\n(h) Would you expect this device to be more resistant to crushing in the longitudinal or transverse\ndirection? Justify your answer quantitatively. (5 pts)\nThis device would be more resistant to crushing in the longitudinal direction where the\nmodulus of the device is related to the moduli of the two materials by the following equation:\nEcomposite = V\n\nE\n\n1 + V2 E2\nwheras the modulus of the device in the transverse direction would follow:\nV2\n= V1 +\nEcomposite\nE1\nE2\nThe resulting modulus of the device in the transverse direction is less than the modulus\nof the device in the longitudinal direction for all reasonable values of E and E\nFor example, the volume fraction of the membrane is about 0.6 and that of the PEO gel is about\n0.4, as estimated using the device dimensions. Assuming a compression modulus of 2GPa for the\nmembrane and 0.2GPa for the hydrogel, the modulus of the device in the transverse direction is\n0.434GPa and the modulus in the longitudinal direction is 1.28GPa.\n(i) Your company is also considering development of cell encapsulation therapies for type I diabetes\nbased on these membranes. Would you recommend pursuing this application? Explain your answer. (3\npts)\nThis device geometry would not be practical for diabetes treatment. Approximately 109 cells\nwould be needed to produce a therapeutic level of insulin, and using the same reasoning as above,\na device of this nature would need to be 11 cm long to encapsulate 109 cells.\n2. (34 pts) Expanded polytetrafluoroethylene (ePTFE) is a commonly used material for synthetic\nvascular grafts. One mode of failure of such devices is via bacterial infection initiated during\nimplantation. Upon the introduction of a foreign material into the body, a competition for the surface\nensues between bacteria and leukocytes that serve to fight infection. One hypothesis for elevated\ninfection rates for PTFE graft implantations is that leukocyte migration is impeded on ePTFE surfaces,\nallowing bacteria to become established in the early stages following implantation.\n(a) Describe the process by which leukocytes are attracted and migrate to the site of a vascular graft\nimplantation. (4 pts)\nComplement activation by the alternative pathway occurs when activation of endothelial cells at\nthe site of injury results in cleavage of C3 protein and the deposition of C3b on the graft surface.\nThe C3b fragment catalyzes the cleavage of C5 to C5a, which is a soluble ligand for specific\nreceptors expressed on the leukocyte cell surface. This recognition of C5a allows for chemotactic\nattraction and migration of leukocytes to the site of implantation.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\nTo investigate which integrin subunits play a significant role in leukocyte migration on ePTFE, Chang\nand coworkers performed random migration studies on populations of fluorescently labeled\npolymorphonuclear leukocytes (PMN's or neutrophils) exposed to antibodies for different integrin\nsubunits. Confocal microscopy images depicting PMN migration on ePTFE after 3 h of incubation with\nIgG (A) or anti-CD18 (C) are shown below.\n(b) Explain how one would obtain a motility coefficient for the PMN's from such data. (4 pts)\nFor random migration, the ratio of PMN concentration at a distance x from the cell well after a\ncertain time t (3 hours in this case) to the concentration of PMN in the well is described by the\nfollowing equation:\n( ,\nc x t )\n⎛ x ⎞\nc0\n= efrc ⎜⎝ 4μt ⎠⎟\nA fit to a plot of the PMN concentration ratio versus distance obtained from this data could be\nused to find μ, the motility coefficient.\n(c) Provide a molecular level explanation for the observed differences in migration between PMN's\nexposed to anti-CD18 vs. those exposed to IgG. (3 pts)\nWhen bound to anti-CD18, the CD-18 integrin subunit is unable to participate in binding with the\nsubstrate, thereby decreasing cellular adhesion to the substrate and subsequent migration.\nImages removed for copyright reasons.\nSee Fig. 4(a) and (c) in Chang, Charlie C., Rene S. Rosenson-Schloss, Tanuja D. Bhoj, and Prabhas\nV. Moghe. \"Leukocyte Chemosensory Migration on Vascular Prosthetic Biomaterial is Mediated by an\nIntegrin ß2 Receptor Chain.\" Biomaterials 21 (2000): 2305-2313.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\nAs a potential surface modification method for ePTFE, Kidd and Williams investigated temporarily\nseeding epithelial cells onto ePTFE to deposit extracellular matrix proteins and thus potentially improve\nendothelial cell adhesion and vascularization of new tissues. In their study, 6 different cell types were\nseeded on ePTFE: human microvessel endothelial cells (HMVEC), rat microvessel endothelial cells\n(RMVEC), human squamous epithelial cell line (HaCaT), a tumorigenic variant of HaCaT (II-4), rat\nbladder squamous cell carcinoma cell line (804-G), and lung carcinomatous epithelial cell line (A549).\nCells were seeded at equivalent densities and left in culture for 8 days, after which they were removed\nusing ammonium hydroxide, which allowed deposited ECM proteins to remain on the surface.\nSubsequently, ECM was collected from the surface of the ePTFE with a rubber scraper and SDS\npolyacrylamide gel electrophoresis was performed to determine the proteins present. Western blot\nanalysis was performed employing rabbit or mouse antibodies for collagen I, collagen IV, fibronectin,\nlaminin-1 and laminin-5 in different lanes of the gel, followed by a secondary antibody, rat antimouse\nIgG or goat antirabbit IgG, conjugated to horseradish peroxidase. Results from the SDS-PAGE study\nare shown below.\n(d) Explain the function of the two antibodies used in the Western blot analysis. (4 pts)\nThe first adhesion protein-specific rabbit or mouse antibodies bind to their respective adhesion\nprotein. The second antimouse and antirabbit antibodies then bind to the first, protein specific\nantibodies. These anti-antibodies are linked to an enzyme (horseradish peroxidase) that catalyzes\nformation of a colored by-product when in the presence of a chromatogenic agent, allowing for\ndetection of the (enzyme-antibody)-(antibody)-(adhesion protein) complex.\n(e) Based on the SDS-PAGE results, which protein has a higher molecular weight, fibronectin or\n(2 pts)\nlaminin-5? Explain.\nImages removed for copyright reasons.\nSee Fig. 1 in Kidd, Kameha R., and Stuart K. Williams. \"Laminin-5-enriched Extracellular Matrix\nAccelerates Angiogenesis and Neovascularization in Association with ePTFE.\" J Biomed Mater\nRes 69A (2004): 294-304.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\nSDS binds (~1 SDS per 2 amino acids) and denatures proteins, at which point the native charge\nbecomes negligible and the charge/mass of each protein is essentially constant. The bound proteins\nare then placed under an electric field and forced to move through a gel. This separates the\nprotein chains via molecular weight as the low molecular weight species move through the gel\nmedia faster than the bulkier, higher molecular weight species. The results show that fibronectin\nis of a higher molecular weight because it does not travel as far as the laminin 5.\nTo ascertain the effects of ECM-modification on vascularization near the ePTFE grafts, discs of ePTFE\nmodified as described above were implanted into the fatty tissue of rats. After 5 weeks, the devices\nwere explanted and tissues in the vicinity of the implant examined for new vessel growth. Data\nquantifying angiogenesis and neovascularization are given in the figure below, reported as means and\nstandard deviations of n=4 samples for RMVEC-, HMVEC, A549-, and II-4-modified samples and n=8\nsamples for 804-G, HaCaT and nonmodified samples.\n(f) Describe the expected tissue morphology in the vicinity of the ePTFE implant after (i) five days; (ii)\nfive weeks. (6 pts)\nWithin 5 days, monocytes recruited by C5a have evolved into macrophages, and may have fused\ntogether to form foreign body giant cells. Fibroblasts recruited by macrophage/FBGC products\nhave started to deposit collagen, leading to the formation of pink granulation tissue, accompanied\nby capillary sprouting or angiogenesis. Within five weeks, significant connective tissue\nremodeling should have occurred, leading to the formation of a thin, encapsulating fibrous layer\naround the implant.\n(g) Which of the ECM-modified samples exhibit a statistically significant increase in angiogenesis\ncompared with the unmodified ePTFE control? (6 pts)\nx - x' -(μ\nμ ')\nvS + v S\n-\n'\n'\n\nt =\nσ\n=\np\nv\nv '\n+\nσ\n+\np\nN\nN\n\n'\nAssume μ μ', if the t value falls between this interval:\n=\n< t\n\nt\n\n1+ P\n<\nt\n- 1+ P\nthen the difference between the two samples is not statistically significant\nfor ν =14, at 95%, t\n= 2.14 for comparison of 804-G and HaCaT (N=8) with control (N=8)\n.975\nfor ν =10, at 95%, t\n= 2.23 for comparison of II-4 (N=4) with control (N=8)\n.975\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\nSample\nx\nS\nN\nν\nσp\ntcalc\nt.975\nStat. Significant\nnon-modified\n804-G\n7 104.4031 6.513219\n2.14 Yes\nHaCaT\n70 3.714286\n2.14 Yes\nII-4\n3 64.65292 3.788676\n2.23 Yes\n(h) From the data provided, give a possible explanation for your findings in (g). (2 pts)\nOnly the samples that contain laminin 5 result in a statistically significant increase in angiogenesis,\nsuggesting that this protein plays an important role in the process.\n(i) How might the results of this study be relevant to cancer therapies? (3 pts)\nAngiogenesis is necessary for tumor growth to occur, and by interfering with laminin 5-cell\ninteractions at the tumor site, angiogenesis and therefore tumor growth may be reduced.\nParticularly, the observed increase in angiogenesis with laminin 5 deposition occurred in epithelial\ncancer cell lines.\n804-G\nHaCaT\nHMVEC\nRMVEC\nII-4\nA549\nMatrigel\nNon-Modified\nVessels per mm2\nAngiogenesis\nNeovascularization\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\n3. (39 pts) Over 15M people in the United States alone are afflicted with type I diabetes, a disease in\nwhich the pancreas fails to generate adequate insulin necessary for metabolizing glucose. The\nmanagement of blood glucose is currently achieved by active monitoring of blood glucose\nconcentration, typically ranging from 1-30 mM, along with daily insulin injections to replace or\nsupplement the patient's natural hormone production.\n(a) Describe the operation of commercial biosensor devices used for glucose monitoring. (4 pts)\nElectrochemical detection of glucose is achieved in commercial biosensors through the\nimmobilization of glucose oxidase near an electrode. The enzyme catalyzes the following reaction:\nThe H2O2 produced by this reaction is subsequently oxidized at the electrode, creating a\nmeasurable current:\nH2O2 Æ O2 + 2H+ + 2e-\nAs a potential new method for glucose monitoring, Hsieh et al. developed a surface plasmon resonance\ndevice. For this device, bacterially-derived glucose/galactose-binding protein (GGBP), a known\nreceptor for glucose, was covalently attached to the SPR surface by replacing specific amino acids in the\nstructure by cysteine (R group= CH2SH) through genetic mutation. Below is a ribbon diagram of GGBP\nshowing its binding pocket for glucose and locations of mutation sites.\n(b) Sketch the general reaction employed to bind the GGBP to the SPR surface. (2 pts)\n(c) Is this device a biosensor? What constitutes the detection element, analyte and transducer? (4 pts)\nThis device uses a biological agent for detection of the analyte and can therefore be classified as a\nbiosensor. The GGBP serves as the detection element, the analyte is glucose, and the measurable\nshift in SPR signal upon glucose-GGBP binding serves as the signal transducer.\nImage removed for copyright reasons.\nSee Fig. 1 in Hsieh, H. V., Z. A. Pfeiffer, T. J. Amiss, D. B. Sherman, J. B. Pitner. \"Direct Detection of\nGlucose by Surface Plasmon Resonance with Bacterial Glucose/galactose-binding Protein.\" Biosensors\nand Bioelectronics 19 (2004): 653-660.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\nThe figure below shows the SPR signal (RU= response units, 1RU ~1 pg/mm2) generated upon the\ninjection of 100 μM glucose in a running buffer solution flowing at 5 μl/min over a surface coated with\nGGBP mutated at the E149 site (solid line), and a second surface prepared with E149-mutated GGBP\nsubsequently denatured by overnight exposure to 1M guanidine HCl (dashed line).\n(d) Explain the observed features in the SPR signal as a function of time for the E149C mutant GGBP\nsurface (solid line). (3 pts)\nUpon the injection of glucose, binding occurs between glucose and the surface bound GGBP\nmutant, and this binding elicits a change in the SPR signal by causing a change in the refractive\nindex of the surface, nsurface.\nω0\nε metalnsurface\nK\n=\nsp\nc\nε metal + nsurface\nOnce the injection stops, the SPR signal begins to return to its original value as glucose detaches\nfrom GGBP and is carried away by the running buffered solution. A fraction of glucose appears\nto be bound irreversibly, since the signal never returns to zero.\n(e) Why does the SPR signal differ when E149C GGBP is denatured prior to glucose exposure? (2 pts)\nAn exact protein structure is essential to the formation of the glucose specific binding pocket, and\nupon denaturation, this exact structure is lost and the glucose specific binding region no longer\nexists in a functional form.\nTime (sec)\nBegin injection\nBlank surface\nDenatured E149C GGBP surface\nEnd injection\nE149C GGBP surface\nRU\nFigure by MIT OCW.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\n(f) What techniques could you use to characterize changes in the: (i) secondary structure content, (ii)\nsurface chemistry, (iii) surface morphology and (iv) thickness of the GGBP layer after exposure to\nguanidine HCl? (8 pts)\nEach technique must be capable of sample analysis in an aqueous environment:\nCircular Dichroism could be used to detect the secondary structure content by making colloidal\ngold spheres modified with GGBP.\nSurface chemistry could be analyzed with an advancing/receding contact angle.\nAFM could be used to evaluate surface morphology by looking at height information in tapping\nmode.\nThe thickness of the GGBP layer could be calculated with in-situ ellipsometry.\nIn a series of experiments, the SPR signal change was recorded as a function of glucose concentration\nfor a E149C mutant GGBP surface and a GGBP with cysteine mutations at E149C, A213S and L238S,\nas shown below.\nRU\nRU\nGlucose (μM)\nGlucose (mM)\nE149C\nE149C, A213S,\nL238S\nFigure by MIT OCW.\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\n(g) From the data provided, calculate the equilibrium dissociation constant for glucose-GGBP binding in\neach case. (6 pts)\nNoting that ν = RU/RUmax , the Langmuir equation can be expressed as:\n1 =\nKd\n+\nRU\n[Glu RU\nRU\n]\nmax\nmax\nPerforming linear regression on the data gives a best-fit line of:\n1/RU = 0.088/[Glu] + 0.0024 from which we obtain RUmax = 425 and Kd = 37 uM\nfor E149C:\nRU\n[Glu] uM\n1/RU\n1/[Glu]\n0.05\n0.5\n0.06\ny = 0.0875x + 0.0024\n0.027 0.333333\n0.013 0.166667\n0.01 0.083333\n0.01\n0.04\n1/RU\n0.04\n0.02\n0.2\n0.4\n0.6\n1/[Glu]\n1/RU = 0.011/[Glu] + 0.015 from which we obtain RUmax = 67 and Kd = 0.73 mM\nfor E149C, A213S, L238S:\nRU\n[Glu] mM 1/RU\n1/[Glu]\n0.2\n0.07\n0.08\n0.6\n0.0303 1.666667\n0.06\n0.025\n0.018\n0.1\n1/RU\n0.04\n0.02\ny = 0.0109x + 0.0147\n1/[Glu]\n\n3.051J/20.340J\nMaterials for Biomedical Applications\n\nFinal Exam\nSolutions\n(h) Explain the observed differences in Kd for the two surfaces. (3 pts)\nBy increasing the number of binding sites between the surface and GGBP, access of glucose to the\nbinding pocket is decreased, making it harder for glucose to bind, resulting in an increase of the\ndissociation constant.\n(i) How would you expect the value of Kd to change if the cysteine mutation was performed at the K137\nsite? (2 pts)\nBy attaching GGBP via the K137 site, the ability of glucose to access the binding pocket should\nincrease, making it easier for glucose to bind, resulting in a decrease of the dissociation constant.\n(j) Would either of the sensors above be useful for monitoring glucose levels typical in humans?\nExplain. (3 pts)\nBlood glucose levels in humans are typically close to mM concentrations, and therefore the sensor\nattached by multiple binding sites may be useful for monitoring glucose levels in humans.\n(k) Provide one key drawback to the proposed SPR sensor for blood glucose monitoring. (2 pts)\nNon-specific adsorption of other blood components could occur and result in a SPR signal change\nas well. A membrane that limited surface access to small molecules like glucose would be useful in\nthis case."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/860c4719a25cc2154e95f27165c8bbbe_lecture1.pdf",
      "content": "3.051J/20.340J\nLecture 1: Intro. to Biomaterials:\nStructural Hierarchy in Materials & Biology\nWhat are \"biomaterials\"?\nA good working definition from the text is: \"A nonviable material used in a\nmedical device, intended to interact with biological systems.\"*\nMEDICAL DEVICE EXAMPLES\nANNUAL # (U.S.)*\nSutures (temporary or bioresorbable)\n250 M**\nCatheters (fluid transport tubes)\n\n200 M\nBlood Bags\n\n40 M\nContact Lenses\n\n30 M\nIntraocular Lenses\n\n2.5 M\nCoronary Stents\n\n1.2 M***\nKnee and Hip Prostheses\n\n0.5 M\nBreast Prostheses (cancer or cosmetic)\n\n0.25 M\nDental Implants\n\n0.9 M\nRenal Dialyzers (patients)\n\n0.3 M\nOxygenators/CPB's (cardiopulmonary bypass system-- 0.3 M\nfacilitates open heart surgery)\nVascular Grafts\n\n0.3 M\nPacemakers (pulse generators)\n\n0.4\n\nM\n\nBiomaterials are defined by their application, NOT chemical make-up\nEx. Intraocular lenses\n\nComposition: poly(methyl methacrylate)\nPMMA, a.k.a. \"acrylic\"\nProperties:\n- High refractive index\nUsed as auto\n- Easily processed\ntaillight covers for\nthe same reasons!\n- Environmentally stable (relatively inert)\n- Good mechanical properties\n*from Biomaterials Science: An Introduction to Materials in Medicine, 2nd ed., B.D. Ratner et al., eds., Elsevier, NY 2004\n**from Biomaterials Science: An Introduction to Materials in Medicine, 1st ed., B.D. Ratner et al., eds., Elsevier, NY 1996\n***from Introduction to Biomedical Engineering, 2nd ed., J. Enderle et al,, eds., Elsevier, NY 2005\n\n3.051J/20.340J\nBiomaterials cover all classes of materials - metals, ceramics, polymers\nPLA = polylactide\nPGA= polyglycolide\nPDO=poly(p-dioxanone)\nPUR = polyurethane\nePTFE = expanded\npolytetrafluoroethylene\npolyethylene\nPET=polyethylene terephthalate\nEar: HA, Al2O3, Ti, silicone\nTi, Ti-Al-V, Al2O3, HA, Bioglass\nacrylic\n2O3, HA,\nTCP, HA/PLA, Bioglass, Ti, Ti-Al-V\nCranial: 316L SS, Ti, acrylic, HA, TCP\nBlood vessels: ePTFE, PET\nC, ePTFE, PET, PUR\nPLA, PGA, PCL, PTMC, PDO\nOcular lenses: acrylates, silicone\nBone Fixation: 316L SS, Co-Cr-Mo,\nTi, Ti-Al-V, PLA/HA., PLA, PGA\nLoad-bearing Orthopedic: Al2O3,\nZirconia, 316L SS, Ti, Ti-Al-V,\nPTMC=polytrimethylenecarbonate\nUHMWPE = ultrahigh mol. wt.\nDental: acrylic, gold, 316L SS, Co-Cr-Mo,\nProsthetic joints: 316L SS, Co-Cr-Mo,\nTi, Ti-Al-V, silicone, UHMWPE,\nMaxillofacial reconstruction: Al\nHeart: Co-Cr-Mo, Ti-Al-V, pyrolytic\nPacemaker: 316L SS, Pt, PUR,\nsilicone, PET\nDegradable Sutures: copolymers of\nTendon & Ligments: PLA/C\nfiber, ePTFE, PET, UHMWPE\nCo-Cr-Mo, UHMWPE\nSpinal: Co-Cr-Mo, Ti, HA, UHMWPE\nHA = hydroxyapatite\nSS = stainless steel\nFigure by MIT OCW\n\ninterface\n3.051J/20.340J\nWhat governs materials choice?\nHistorically ⇒ Today\n\nToday ⇒ Future\n1. Bulk properties: matched to those of\nnatural organs\n- Mechanical (ex., modulus)\n- Chemical (ex., degradation)\n- Optical (ex., whiteness, clarity)\n2. Ability to Process\n3. Federal Regulations:\nMedical Device Amendment of '76\n(all new biomaterials must undergo premarket\napproval for safety and efficacy)\nEngineering Paradigm\n?\nRational design of\nbetter understanding of\nmaterial/biological\nAdoption of the Materials\nbiomaterials based on\nnatural materials and the\norganism interface\nApplication (Performance)\nProperties\nStructure\nProcessing\nWhat is \"structure\"? the arrangement of matter\nBoth synthetic materials & biological systems have many length\nscales of structural importance.\n\n3.051J/20.340J\n\nStructural Hierarchies\n\nSynthetic Materials\n\nLiving Organisms\n\nChemical Primary Structure\n10-10m\nMolecules\n(H2O, peptides, salts...)\n\nHigher Order Structure\nOrganelles (lysosomes,\nnucleus, mitochondria)\n\nMicrostructure\n\nCells\n\nComposites\n\n10-3m\nTissues\n\nParts\n\nOrgans\n\nDevices\n\nIndividuals\n\nBiomaterials Engineering spans ~8 orders of magnitude in structure!\n\nThe realm of\nbiomaterials\nengineering\n\nC a + +\nC a + + C a + +\nC a + +\n\nC a + +\nC a + + C a + +\nC a + +\n\nC a + +\nC a + + C a +\nC a + +\nextracellular\nenvironment\nlipid membrane\ncytosol\nFibroblast cells aligned on micro-\npatterned surface\nEngineered length scale: 10-3 to 10-6 m\nCell adheres to RGD peptide clusters\nlinked to comb copolymer chain ends\nEngineered length scale: 10-7 to 10-8 m\nCell adhesion receptors embedded in\nmembrane interact with RGD sequence\nEngineered length scale: 10-9 to 10-10 m\n\n3.051J/20.340J\nLENGTH SCALES OF STRUCTURE\n1. Primary Chemical Structure\n(Atomic & Molecular: 0.1-1 nm)\nLength scale of bonding - strongly dictates biomaterial performance\nPrimary\n- Ionic: e- donor, e- acceptor ceramics, glasses (inorganic)\n- Covalent: e- sharing glasses, polymers\n- Metallic: e- \"gas\" around lattice of + nuclei\nSecondary/Intermolecular\n- Electrostatic\n- H-bonding\n- Van der Waals (dipole-dipole, dipole-induced dipole, London dispersion)\n- Hydrophobic Interactions (entropy-driven clustering of nonpolar gps in H2O)\n- Physical Entanglement (high MW polymers)\nEx. 1: alumina Al2O3\nused for hard tissue replacement -\n(corundum)\ne.g., dental implants\nProperties:\n- corrosion resistant\n- high strength\nderived from\n- wear resistant\nionic bonding\nElectrostatic interactions w/ charges on\n- \"biocompatible\"\nproteins ⇒ non-denatured adsorbed protein\nlayer ⇒ \"camouflage\"\nwww.biocon.com\nfrom Biocon, Inc. website:\nCourtesy of BICON, LLC. (http://www.bicon.com). Used with permission.\n\n3.051J/20.340J\nEx. 2: polyethylene oxide (PEO)\n(CH2CH2O)n\nused for protein resistant\ncoatings, hydrogels\nProperties:\n- flexible\n-\n- water soluble\n- bioinert\nsecondary bonding\nStrong H-bonding, unique 3 n.n. coordination w/\nH2O ⇒\n⇒\nhydrolysable\nDerived from primary &\nwater-like layer\n\"camouflage\"\nprotein\ngrafted PEO\ndenatured protein\nTake Home Message:\n\"Biocompatibility\" is strongly determined by primary chemical structure!\nBiocompatibility: \"ability of a material to perform with an appropriate host\nresponse\"\nProtein Adsorption\nCell Attachment\nCell Secretion\nChemical Structure\nHost Response\n\n3.051J/20.340J\n2. Higher Order Structure (1 - 100 nm)\nCrystals: 3D periodic arrays of atoms or molecules\nmetals, ceramics,\n\npolymers (semicrystalline)\ncrystallinity decreases solubility and bioerosion\n(biogradable polymers & bioresorbable ceramics)\nNetworks: exhibit short range order & characteristic lengths\ninorganic glasses, gels\nEx. 1: Bioactive Glasses\nused for hard connective tissue\nreplacement\nNetwork formers (~50wt%): SiO2, P2O5\nNetwork modifiers (high! ~50wt%): Na2O, CaO\nProperties:\n- partially soluble in vivo (facilitates bone bonding)\nderived from loose\n- easily processed (complex shapes)\nionic network\nSi\nO\nNa+\n2-\n4+\n\n3.051J/20.340J\nEx. 2: Hydrogels\nused for contact lenses, drug delivery\nmatrices, synthetic tissues\nx-linked, swollen polymer network\nξ\ncrosslink density ~ 1/ξ3\nProperties:\n- shape-retaining\nderived from\n- flexible\ncrosslinked network\n- slow release of entrapped molecules\nSelf-Assemblies: aggregates of amphiphilic molecules\nmicelles, lyotropic liquid crystals,\nblock copolymers\nEx.: Cationic Liposomes\n\nused for gene therapy\nlipid (+)\nDNA fragment (-)\nProperties:\n- water dispersible\nderived from\n- can contain/release DNA\nsupramolecular assembly\n- can penetrate cell membrane (-)\n\n3.051J/20.340J\n3. Microstructure (1μm + )\nCrystal \"grains\": crystallites of varying orientation\nEx: Stainless steels Fe-Ni-Cr\nused for fracture\nfixation plates,etc.,\n& angioplasty stents\nDepletes at grain\nboundaries causing\n10 μm\ncorrosion\nSpherulites: radially oriented crystallites interspersed w/ amorphous phase\nsemicrystalline polymers,\nglass-ceramics\n10 μm\nPrecipitates: secondary phases present as inclusions\nmetals, ceramics, polymers\nEx: Carbides in Co-Cr alloys\nProperties:\n- Hardness\nderived from precipitates\n- Corrosion resistance (form at grain boundaries)\n50 μm\n\n3.051J/20.340J\nPorosity: often desirable in biomaterials applications\nEx. 1: Porous Bioresorbable Scaffolds\npolylactide (PLA)\nused for tissue\nregeneration\nProperties:\n- Penetrable to body fluids, cells\n- Structurally stable\nPore dimensions:\n10-100 μm\nderived from pore\nmicrostructure\nEx. 2: Porous Metal Coatings\nused on hard\nTi or Co-Cr-Mo\ntissue replacemt\nimplants\nProperties:\n- Enhanced cell adhesion\n- Tissue ingrowth\nPore dimensions:\nderived from pore\nmicrostructure\n10-100 μm\nTake Home Message:\nHigher order structure & microstructure strongly dictate kinetic processes\n& mechanical response."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/1ad0712bccdf24ef981d518dae09c1d1_lecture2.pdf",
      "content": "ρbulk\n3.051J/20.340J\nLecture 2: Biomaterials Surfaces: Physics\nThe surface of a material strongly dictates its performance in vivo.\nSurface Properties Influencing Cell Adhesion\nWettability\nCrystallinity\nRoughness\nComposition\nElectrical Charge\nMobility\nWhat's so special about a surface?\nSurface vs. Bulk\n1015 atoms\n1. Inherently Small # of Atoms\n1 cm3 material\n~ 1023 atoms\nRequires special characterization tools\n2. Enhanced Mobility\nρbulk\nD = D0 exp(-Ea/kT)\n- fewer bonds\n- gradient in density\nDsurf >> Dbulk\n~1 nm\nFacilitates rate-limited processes\n(phase transformations, crystallization, corrosion...)\n\n3.051J/20.340J\nExample: Devitrification of calcium phosphate glass CaO-P2O5-SiO2 (44:40:15)\nCrystallization\ninitiates at surface\nEa,cry\npowder size\n(kcal/mol)\n(μ m)\n< 44\n297-590\nfrom J.-S. Lee et al., J. Thermal Anal.\nCal. 56 (1999) 137.\n3. Higher Energy State\n\nAtoms/molecules with unsatisfied (\"dangling\") or strained bonds\nHigh reactivity and susceptibility to adsorbates\nQuantifying Surface Energy\nloss of bonds at a surface\nattraction towards bulk\n= areal contraction force\nSurface tension, γ , is the work required to create unit surface area\nat constant T,P and composition.\nConsider a simple soap film experiment:\ndx\ndG = - SdT + VdP +γ dA\nL\nf (force)\nwire frame\nγ = ⎜\n⎛ ∂ G ⎞\nfdx\n\nf\n\n=\n=\n⎝∂ A ⎟⎠ T P n 2Ldx\n2L\n, ,\nwhere G = Gibbs free energy, A = area\n?\n\n3.051J/20.340J\nSurface Tensions of Example Materials\nMaterial\nT (°C)\nPE\n\nsoda-lime-silicate (l) 1350\n\nAl2O3\n\nTiC\n\nTeflon (PTFE)\n\nSilicone (PDMS)\n\nγ (dyn/cm)\n1 dyn/cm = 1 mJ/m2\n= 1 erg/cm2\nPMMA\n\nPEO\n\nWater\n\nFeO\n\nTi (l)\n\nδ-Fe (bcc)\n\nγ ↓ w/ ↑T\nγsv ∝ ∆Hsublim\nγlv ∝ ∆Hvapor\nTrends: high γ materials: (>200 dyn/cm) - metals, carbides, oxides\nlow γ materials: polymers, organics\nWhy? Consider the nature of bonds...\nSurface tension is a measure of degree of cohesion.\nWork of cohesion: WC = 2γ\n\n3.051J/20.340J\nSurface Phenomena\nA simple rule: Surface phenomena are driven primarily by an\nassociated reduction in surface free energy.\nImportant examples in biomaterials:\n- adsorption of a species from environment\n- surface segregation of a species from bulk\n- surface reconstructions\n- surface reactions\n1. Adsorption phenomena\nTenet 1: Higher energy surfaces are quickly coated/contaminated by\nlower energy species.\nExamples: * Water on glasses, metals or oxides\n* Hydrocarbons on inorganic surfaces\n* Surfactants at air/water interface\nMeasured γ of metals &\noxides ~ 37 dyn/cm\nClasses of adsorption:\n3⁄4 chemisorption - strong modifications to electronic\nstructure/electron density of adsorbate molecule (> 0.5\neV/surface site)\nExample: H2O on silica\nH O H\nOH\nOH\nEads = 1.7 eV\nO\nSi\nSi\nSi\nSi\nO\nO\n\n3.051J/20.340J\n3⁄4 physisorption - adsorbate weakly adherent via secondary\n(i.e., van der Waals') interactions (< 0.25 eV/surface site)\nkT293 ≈ 0.025 eV\n1 eV/molec = 96.5 kJ/mol\nCH3\n⎯ CH2 ⎯ C ⎯\nC = O\nEads = 0.1 eV/mer\nExample: PMMA on silica\nN' mers adsorbed × 0.1 eV/mer\n≈ total adsorption energy\nO\nCH3\nOH\nOH\nN' < N (segments/chain)\nSi\nSi\nO\n\n3.051J/20.340J\nTenet 2: The \"high energy surface\" of tenet 1 is relative to its\nsurrounding medium.\nIn H2O based environments, a hydrophilic material has a lower\ninterfacial energy than a hydrophobic one.\nExample: Adsorption/denaturing of proteins on hydrophobic surfaces in\nwater-based environments\nHDPE ⏐\nCH3\nH\nO\n⏐\n+\n+\n_\n+\nOH\n+\n_\n_\nCharged & H-bonding groups orient\ntowards H2O; hydrophobic groups\norient towards polyethylene\nSuch adsorption phenomena are examples of \"thermodynamic adhesion\"\nAdhesion - state in which 2 dissimilar bodies are held together in\nintimate contact such that a force can be transferred across the interface.\nThermodynamic adhesion is driven by interfacial forces associated with\nreversible processes.\n\n3.051J/20.340J\nα\nβ\nα\nβ\nWork of Adhesion (W12): the work required to separate a unit area of\ninterface between 2 phases.\nγ\nW12 = γ1 + γ2 - γ12 W12 > 0 ⇒ adhesion\n12 = α/β interfacial tension\n(for α = β, W12 = WC = 2γ1)\nW\nW\nWe can approximate W12 with a geometric mean:\n12 ≈ (WC,1 WC,2)1/2\n=\n\n2(γ1 γ2)1/2\nBy analogy, for α/β adhesion in aqueous:\n12,W = γ1W + γ2W - γ12,W\n≈ 2(γ1W γ2W)1/2\nSuggests 2 strategies for\nprotein resistance: W12= 0\np\nOr for γ1 = γ1\nd + γ1\nd 1/2 + 2(γ1\np 1/2\nW12 = 2(γ1\nd γ2 )\np γ2 )\n\n3.051J/20.340J\nStrategies for Inhibiting Protein Adhesion:\nFor W1W = 2(γ1γW)1/2\n1/2)2\n⇒ γ1W = (γ1\n1/2 - γW\na) Ultra-hydrophobic systems\nγ1= 0 ⇒ γ1W ≈ γW\nExample: PTFE (γ= 19 dyn/cm)\n⇒ Proteins adsorb but don't adhere well.\n(the \"non-stick pan\" principle)\nb) Ultra-hydrophilic systems γ1W = 0 ⇒ γ1 ≈ γW\nExample: PEO (γ1W ≈ 0)\n⇒ Surface favors water contacts--proteins\ndon't adsorb.\n°C.\nBSA adsorption on various polymers at 37\nFigure by MIT OCW.\n\nθ\n3.051J/20.340J\nThe hydrophilicity of a surface can be gauged by measuring the contact angle of a\ndroplet of water on the surface. The balance of interfacial forces is described by\nYoung's Equation:\nγLV\nθ\nγ\nγSV\nγSL\nLV\n\ncosθ\nγ\n-γ SL\n\n=\nSV\n\nθ\nWettability\nSince WSL = γLV + γSV - γSL\nComplete\nWSL = γLV (1+cos θ)\n<90 Partial\n>90 Non wetting\nFor multi-component surfaces:\nCassie's eqn: cos θ = f1 cos θ1 + f2 cos θ2\nwhere fi =area fraction of i\n2. Surface Segregation\nAn interfacial adsorption phenomenon involving a bulk component of a\nmulti-component material.\nExample 1: Surface segregation of a dilute solute (B) in a binary AB alloy\nSurface fraction of B (XB,S) can be described using the Langmuir-\nMcLean relation:\nX B S = X B\n⎡-∆GS ⎤\n,\n⎢\n⎥\n1 - X B S\n1 - X B\nexp\n⎣ RT\n\n⎦\n,\nwhere ∆GS = free energy of segregation per mole of solute.\n\n3.051J/20.340J\nSurface enrichment is given by:\nX\nln X = 2.3 log10X\nB S\nR = 8.314 J/mol-K\n, ≈ exp ⎡-∆GS ⎤\n⎢\nX B\n⎣ RT\n\n⎦⎥\nThe predicted behavior is more transparent by expanding the exponential...\nX B S\n∆GS\n, ≈-\n+\n...\nX B\nRT\n\nThe Langmuir-McLean relation indicates:\n3⁄4 Surface enrichment occurs when ∆GS is negative\n3⁄4 Surface coverage increases with bulk solute content\n3⁄4 Surface enrichment decreases with increasing T\n∆GS can be estimated from the Miedema eqn:\n∆GS > 0 no surface\n1/ 3\n2/3\n∆GS\nprefactor is fraction of\n0.24\natom contacting vacuum\n=\n\n-\n⎡∆Hmix\n\n+ (γ A\n\nSV\n\n-γ B\n\nSV\n\n)6N AvVm\n\nB\n\n⎤\nenrichment of B\n⎣\n,\n,\n, ⎦\n∆GS < 0 surface\nenrichment of B\n∆Hsub\n=\nMetal surface tensions can be estimated from: γ B SV\n6N\nVm\n\nB\n\nAv\n,\n,\n1/ 3\n2/3\nmolar volume\nThe Miedema model is ~90% accurate in\npredicting segregation in AB alloys.\nSource: Interfaces in Materials, J.M. Howe, John Wiley\n&Sons: NY (1997) pp. 156-168.\n\n3.051J/20.340J\nSurface segregation also occurs commonly in organic materials...\nExample 2: PVC blended w/ 0.25 wt% short fluorocarbon\n(C45O18F59H31).\nγPVC = 41 dyn/cm vs.\nγblend = 17.3 dyn/cm\n≈ pure -CF3\nγCF3 = 14.5 dyn/cm\nIn polymers, ENTROPY can play a significant role in surface\nsegregation.\nChain ends surface segregate\nto decrease entropic penalty\nPolymer \"random coil\"\nconformations are restricted by\nthe presence of a surface\n⇒ Less chain configurations!\nShort chains surface segregate\nwhen mixed with long chains\nSurface segregation importance to\nbiomaterials applications:\n- Toxicity\n- Corrosion resistance\nSurface modification with a\n- Modified protein/cell adhesivity\ncomb polymer additive\nBut...also a strategy for\nsurface modification!\n\n3.051J/20.340J\n3. Surface Reconstruction\nAtomic or molecular rearrangement at surface to reduce surface/\ninterfacial tension.\nExample 1: Faceting in MgO\nRocksalt structure\n\n= O2- (fcc lattice pts)\n= Mg2+ (octahedral interstices)\n(100) is preferred plane of cleavage (charge neutral!)\nMiscut surfaces will facet\n~0.1-1μm\n{100} surfaces\nOxides surfaces reconstruct to achieve:\n1) no net dipole moment\n2) minimial loss of nearest neighbor ligand coordination\nLow Energy Oxide Surfaces\nStructure\nlow γ plane\nExamples\nM2O3\ncorundum\nTi2O3, V2O3, Fe2O3,\nAl2O3, Cr2O3\nMO2\nrutile\nTiO2, SnO2\nMO\nrocksalt\nMgO, CaO, CoO\n\n3.051J/20.340J\nExample 2. Reorientation of polymer chains in water vs. air\nPDMS in air\nγPDMS = 20 dyn/cm\nH3C\nCH3\nH3C\nCH3\n(γCH3 = 23 dyn/cm)\nSi\nSi\nO\nO\nPDMS in H2O\nH3C\nCH3 H3C\nCH3\nSi\nSi\nO\nO\nChain reorientation can be observed with dynamic contact angle studies:\nAdvancing: Droplet volume increased (by syringe)\nθa\nθr\nadvancing\nreceding\nθ\nReceding: Droplet volume removed\ndroplet volume"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/8cc8b0541c29f6d37f4e6bbc69c5770c_lecture3.pdf",
      "content": "3.051J/20.340J\nLecture 3: Biomaterials Surfaces: Chemistry\nSurfaces are high-energy regions of materials and thereby facilitate\nchemical reactions that influence performance of biomaterials.\nThis lecture will focus on 2 classes of surface chemistry relevant to\nbiomaterials:\n- Chemisorption on metals and oxides\n- Aqueous corrosion of metals\n1. Chemisorption\nStrong modifications to electronic structure/ electron density of\nadsorbate molecule (> 0.5 eV/surface site)\nImportant Examples:\na) Metal Oxide Formation on Metals\n\"metals just wanna be oxides\" xM + 1⁄2yO2 → MxOy\n∆G0 of oxide formation is negative for all but a few metals (e.g., Au)\nReaction\n∆G0 (joules)\nT range (K)\n2Cr + 3/2 O2 = Cr2O3\n-1,120,300 + 260T\n298-2100\nFe + 1⁄2 O2 = FeO\n-259,600 + 62.55T\n298-1642\n2Fe + 3/2 O2 = Fe2O3\n-810,520 + 254.0T\n298-1460\nTi + O2 = TiO2\n-910,000 + 173T\n298-2080\nfrom D.R. Gaskell, Intro. To\nMetallurgical Thermodynamics,\nMcGraw-Hill, 1981\n\n3.051J/20.340J\nHow does metal oxidation happen?\nOne scenario is...\nstep 1: physisorption of O2; ~20-25 kJ/mol\n1 eV/molec = 96.5 kJ/mol\nkT293 ≈ 0.025 eV\nstep 2: molecular oxygen dissociates and\nreduces by chemisorption; ~600 kJ/mol\nstep 3: bond rearrangement; crystallization of oxide layer\nResultant reduction in surface energy\nγ\nCompare: at 1400°C: γδ-Fe = 1900 dyn/cm\nFeO = 580 dyn/cm\nConsider metal oxidation as 2 half reactions:\nO2 + ze-\nElectrons and ions must traverse\nthe oxide layer for rxn to proceed.\nAcross the oxide film, an oxidation potential,\nE0 ~ 1V generates an electric field:\nx~1 nm\nM\nMz+\nM → Mz+ + ze -\n→ 1⁄2z O2-\n∆G0 =\n\n-\n\nE\n\nzF\n\nE-Field ≈ 1 V/nm = 10 MV/cm\nIonic species are \"pulled\"\nF= 96,480 C/mol e-\nthrough oxide film!\n1 J = 1 V-C\nWHAT HAPPENS AS THE OXIDE CONTINUES TO GROW?\n\n3.051J/20.340J\nThe E-field decreases. Subsequent oxide growth occurs by thermal\ndiffusion of Mz+ to oxide surface or O2- to metal/oxide interface under\nthe concentration gradient ∆c:\nl = k\n\nt\n\np\nl\nRequirements for Passivation:\ni) small kp (rate const)\noxide\nthickness\ntime\nk = const D ∆c\np\nii) adherent oxide\nOxide layer must not scale or spall\n⇒ minimize ∆Vmolar & stress build-up\nxM + 1⁄2yO2 → MxOy\nex., Ti (TiO2), Cr (Cr2O3), Al (Al2O3)\n(Al metal not used in biomaterials applications due to toxicity)\nM O\n=\nx\ny\n\nPilling-Bedworth ratio: PB = Voxide ( formed )\nρM M\nVmetal (consumed )\nxM\n\nM ρM O\nx\ny\n\nWant PB ~ 1 (PB > 1) for adherance of oxide to underlying metal--in\npractice, this rule is marginally predictive, however.\n\n- -\n3.051J/20.340J\nOther Metal Oxidation Rxns by Chemisorption:\nReaction with water: xM + yH2O → MxOy + yH2\nReaction with CO2: xM + yCO2 → MxOy + yCO\nIS THE FORMED METAL OXIDE SURFACE STABLE?\nb) Acid/Base (Acceptor/Donor) Rxns on Oxides\ni) **H2Oadsorbed + O2-\nlattice→ OH-\nlattice + OH-\nsurface\nUbiquitous! e.g., oxides\nof Co, Ti, Cr, Fe, etc.\nH2O cleavage with H+ transfer\nto surface basic O2- site & OH-\ncoordination with M2+\nH\nH\nO-\nH+\nH\n-O -\nO2\nM2+ O2\nM2+\nO2\nM2+ O2\nM2+\nM2+ acts as Lewis acid\n(e- pair acceptor) for\noxygen lone pairs\n\n3.051J/20.340J\nii) CO2,adsorbed + O2-\nlattice→ CO3 (carbonate formation)\nExperimentally seen, e.g., on TiO2 (110)\niii) w/ Hydrocarbons:\nAlcohols (similar to HOH): ROHadsorbed + O2-\nlattice → RO- + OH\n-\nCarboxylic Acids: RCOOHadsorbed + O2 lattice → RCOO- + OH-\nc) Redox (Oxidation/Reduction) Reactions on Oxides\nExample\nAlcohol dehydrogenation to aldehyde:\nO\nRCH2OH + 2O2-→ RCH + 2OH- + 2e-\nalcohol is oxidized\nelectrons reduce\nMz+ at surface\nreference: V.E. Henrich and P.A. Cox, The\nSurface Science of Metal Oxides,\nCambridge Univ. Press: 1994\n\n3.051J/20.340J\n2. Aqueous Corrosion of Metals\nIn water or in vivo, even a \"passive\" oxide layer (terminated by bound\nwater) becomes susceptible to corrosion.\nWhy?\n- Mz+ diffusion will always occur\n- oxide may dissolve\n- damage to oxide layer\nCorrosion: the destructive result of chemical rxn between a metal or\nmetal alloy and its environment.\nAqueous corrosion: involves electronic charge transfer\ni.e., an electrochemical rxn\nTypically, metal surface acts as both anode (oxidation=loss of e-) &\ncathode (reduction=consumption of e-) in different regions\n-\nanodic rxn:\nM → Mz+ + ze\ncathodic rxns: O2 (dissolved) + 4H+ + 4e- → 2H2O\nin acidic\n2H+ + 2e- → H2 (g)\nO2 (dissolved) + 2H2O + 4e- → 4OH\nin neutral\nor basic\n\n2H2O + 2e- → H2 (g) + 2OH\nLocally, a biological environment can be neutral, acidic or basic.\n\n3.051J/20.340J\nMetals in aqueous solution\nMetal ions leave surface; surface\nH2\nH+\nMz+\n2e-\nH+\nMetal M\nbecomes negatively charged.\nMz+ are attracted back toward\nsurface, establishing a dynamic\nequilibrium.\nThe resulting charged double layer\nexhibits a characteristic E.\nValues of Ε measured relative to a reference electrode (e.g., std. H2\nelectrode = SHE), give metric of reactivity in aqueous soln.\non M electrode:\n-\nM → Mz+ + ze\naM=1\non reference electrode:\nH2 → 2H+ + 2e\nPH2\n1atm\nInert Pt reference\nelectrode\naM\nz+=1\naH\n+=1\nV\nSemi-permeable\nmembrane\n\n3.051J/20.340J\nemf series (Table 5, p. 432 of text)\nStandard electrode\npotentials E0 measured\nat unit activity (~1 N)\nanodic\nof Mz+ ions in soln.\nwith SHE ref.\nMetal\nPotential (V)\nAu\n1.43\nPt\n1.2\nAg\n0.79\nH\n0.0\nSn\n-0.14\nMo\n-0.20\nCo\n-0.28\nFe\n-0.44\nCr\n-0.73\nAl\n-1.33\nTi\n-1.63\nLi\n-3.05\nIf the activity of Mz+ is less than unity, the electrical potential across the\nmetal/solution interface is modified according to the Nernst equation:\nE\nE0\nRT ln aoxidized species\n=\n+ zF\nareduced species\nEquating activity to concentration:\nz+ ]\nM\naoxidized species = [M\nareduced species = [\n]\n\n= 1\nz+ ]\n(\nE V ) = E0 + 0.059 log[ M\nz\nAt this potential, the system is in dynamic equilibrium, i.e., equal metal\ndissolution and deposition rates (the exchange current density).\n\n3.051J/20.340J\nA Simple Corrosion Rule: anything that upsets the dynamic\nequilibrium of the charged double layer can accelerate corrosion.\nGalvanic Corrosion: if 2 metals in contact where -EA > -EB (i.e., A\nmore neg./anodic), B becomes an e- \"sink\" ⇒ accelerating corrosion of\nA\nB\n+\n+\n+\nA\ne -\nThe ↓ in e- from A surface\nallows ↑ release of Az+\nCan be macroscopic scale or microscopic scale effect!\nExamples:\n- Plate & screw of different alloys\n- Cr-depleted region at grain boundary (due to carbide formation)\n- Formation of surface oxides or sulfides that conduct e\n- Alloys exhibiting 2 phases\n- Metal grains of different orientation\nFretting Corrosion: accelerated corrosion from two surfaces rubbing\ntogether\n3⁄4 metal/metal, metal/bone, metal/oxide contacts\n3⁄4 wear of passive oxide film\nlocalized stress ⇒ ↑ Mz+ dissolution\ndefects (terraces, steps): less bonds ⇒ ↑ Mz+ dissolution\n3⁄4 repetitive movement ⇒ continual loss of corrosion products\n\n3.051J/20.340J\nM\nPitting and Crevice Corrosion: localized attacks resulting in rapid\nz+ release at discrete sites\n3⁄4 initiated at local failure of passive film\npitting: surface defect; crevice: region of restricted transport\n3⁄4 remaining surface acts as cathode\n→ rapid penetration at defect (oxidation = reduction)\n3⁄4 catalyzed by presence of Cl-\n3⁄4 autocatalyzed by ↑ acidity from rxn in confined volume\nPhoto removed for copyright reasons.\nCorrosion on neck region of a femoral stem of a\nCoCr hip prosthesis. from J.J. Jacobs et al,\n\"Corrosion of Metal Orthopaedic Implants\", J.\nBone and Joint Surgery 80-A, 268 (1998).\nEx. Stainless steels in Aqueous Soln:\nFor Cr contents below 12.5 at%: FeOOH resides at surface in hydrated\nform: FeOx(OH)y -nH2O (iron oxyhydroxide hydrate)\nIn absence of Cl-, slow dissolution:\nFeOOH + H2O → Fe3+ + 3OH\n\nWith Cl- present:\nFeOOH + Cl- → FeOCl + OH\nFeOCl + 2H2O → Fe3+ + Cl- + 2OH\nLow solubility Fe3+ precipitates as Fe(OH)3 (rust)\nrestricted transport\n3.051J/20.340J\nFe-9Cr\n(\n)2O3\nFe2O3\nS.S.\nFe,Cr\noxide\nBreakdown of passivation layer until reaching metal:\nFe → Fe2+ + 2e\naccelerated\nattracts Cl\ncorrosion!\nFe2+ + 2Cl- + 2H2O → Fe(OH)2 + 2HCl\nlocal acidity ↑ in\npit or crevice\nOutside pit or crevice:\n-\nFe2+ → Fe3+ + e\nFe3+ + 3(OH)- → Fe(OH)3\nO2 + 2H2O + 4e- → 4OH\nprecipitates, further\nrestricting transport\n\n-\n-\n3.051J/20.340J\nSteel composition effects:\nCr: For Cr > 12.5 at%: surface is hydrated CrOOH (chromium\noxyhydroxide), i.e., CrOx(OH)3-2x -nH2O\n3⁄4 renders S.S. surface passive\n3⁄4 increases susceptibility to pitting/crevice corrosion (CrCl3\nsolutions have low/negative pH!)\nMo: ↓ dissolution rate in pits/crevices (mechanism?)\nIn the corrosion of metallic implants, further considerations arise with\nthe complexity of biological fluids.\nIn vivo environment\n3⁄4 pH 7.4\n3⁄4 T = 37°C\n3⁄4 anions: Cl-, PO3 , HCO3 (bicarbonate)\n3⁄4 cations: Na+, K+, Ca2+, Mg2+\n3⁄4 proteins & other biomolecules\nInfluence of other ions found in vivo:\nCa2+ and Mg2+: decrease corrosion rate\n3⁄4 form precipitates on metal surfaces\n-\nCa2+ + HCO3 + OH- → CaCO3 + H2O\nprecipitates\nMg2+ + 2OH- → Mg(OH)2\n3⁄4 O2 influx restricted → inhibits cathodic reduction\n\n3.051J/20.340J\nBiological Factors Influencing Corrosivity:\n- O2 levels (↑ O2 ⇒ ↑ corrosion; anodic≡cathodic)\n- pH variations (inflammation/infection ⇒ ↓ pH)\n- Cellular activity (e.g., phagocytic cells ⇒ local ↑ in oxidant conc.)\n- Protein-Mz+ binding (Mz+ carried away ⇒ ↑ Mz+ dissolution)\ne.g., cytochrome oxidase, peroxidase, catalase bind Fe2+\n- Protein adsorption (↓ O2 access to surface)\n- Bacterial oxidation of Fe2+ to Fe3+ (↑ anodic rxn/Fe2+ dissolution)\nCorrosion's Influence on in vivo Performance:\n3⁄4 Immunological sensitization; e.g., Ni & Cr allergic response\n3⁄4 Wear debris - initiates biological cascade\n(foreign body response, bone loss)\n3⁄4 Loss of implant structural integrity (mechanical failure)\n3⁄4 Metal ion toxicity: Al, Ni, Cr, V, Co, Ti; ↑ levels in blood/organs\n3⁄4 Carcinogenicity (tumors at implant sites, leukemia/lymphoma\ncorrelation with CoCr implants)"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture4_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/212eeed0b1a87542bf5e3884ebc9bc23_lecture4_2.pdf",
      "content": "Lecture 4:\nBiomaterials Surfaces: Chemistry\nHydrolysis\nSupporting notes\n3.051J/20.340J Materials for Biomedical Applications,\nSpring 2006\n\nHydrolysis\n- Hydrolysis is a kind of \"Solvolysis\",\nsolvent + lysis: cleavage by the solvent.\nBr\nH2O\nOH\nOCH3\nOCOH\nl\nCH OH\nHCOOH\n2-Bromo-2-methy propane\n+ HBr\nHydoloysis\n+ HBr\nMethanolysis\n+ HBr\nFormic acidolysis\n\nPolymer Hydrolysis\n- Polymers prepared by polycondensation can\nbe susceptible to hydrolysis.\nn\n1,4-Butanediol\n+\nHO\nOH\nO\nO\nn\nO\nO\nH\nH\nSuccinic acid\nO\nO\n*\n*\nO\nO\nn\n2O\nl\nΔ\nH+\n-,\n+ nH\nAs, Zn cata ysts,\n, OH\nor enzyme\nPoly(butylene succinate), PBS\n\nHydrolysable is \"degradable\".\nSynthetic polymers\n· Polyesters\n· Polyamides\n· Polyanhydrides\n· Polyethers\n· Polyurethanes\n· Polycarbonates\n· Polyureas\nMaterial properties can\nbe tuned readily.\nCheaper!\nNaturally-occurring polymers\n· Proteins and polyamides\nCollagen\nFibrinogen and fibrin\nGelatin\nCasein\n· Polysaccharides\nCellulose\nStarch and amylose\nChitin and chitosan\nDextran\n· Polynucleotides\nDNA and RNA\n\nBiodegradation:\nAn event which takes place through the action of enzymes\nand/or chemical decomposition associated with living\norganisms (bacteria, fungi, etc.) or their secretion products.\nAlbertsson and Karlsson, in Chemistry and Technology of Biodegradable Polymers 1994\nO\nR\nC\nO\nN\nR\nC\nO\nH\nO\nR\nO\nC\nO\nPolyester\nPolyamide\nPolycarbonate\nC\nR\nO\nC\nO\nO\nN\nP\nR\nR'\nO\nO\nO\nO\nR\"\nR'\nR\nO\nPolyanhydride\nPolyphosphazene\nPoly(ortho ester)\nTypical examples of synthetic biodegradable polymers\n\nKey factors in hydrolysis\n1. Bond stability\nExample: Hydrolysis of polyester\nC\nO\nδ+\nδ-\nBase-catalyzed polyester hydrolysis\nδ-\nδ+\nO\nC\nR\nO\nR'\n-\nO\nC-\nR\nO\nR'\nO\nH\nO-\nC\nR\nO\nR'\nO\nH\nH+\nO\nC\nR\nOH\n+\nR'\nOH\nOH\n\nAcid-catalyzed polyester hydrolysis\nδ-\nH+\nδ +\nO\nC\nR\nO\nR'\nO+\nC\nR\nO\nR'\nH\nO\nC+\nR\nO\nR'\nH\nO\nC\nR\nO+\nR'\nH\nH\nO\nH\nO\nC\nR\nO\nR'\nH\nO+\nH\nH\n-H+\nH2O\n+\nR'OH\nO\nC\nR\nOH\nPolyamide hydrolysis\nH2O\nO\nC\nR\nN\nR'\nH\nO\nC\nR\nOH\n+\nH2N-R'\n\nKey factors in hydrolysis\n2. Hydrophobicity\n3. Molecular weight & architecture\n4. Morphology\nCrystallinity, porosity\n5. Tg\nMobility of polymer chain\nChance to contact with H2O\n\nQ a (degrees)\nAmorphous PLLA\nCrystalline PLLA\nAlkaline Treatment Time (h)\nAlkaline Treatment Time (h)\n\nOrthorhombic crystal structure of α-PLLA\nFigures removed for copyright reasons.\n6.1\n28.8\nd\ndcrystal: 1.290 g/cm3\namorphous: 1.248 g/cm3\n10.5 A\n\nHydrolysable polymers\nPolyanhydride\nO\nC\nR\nO\nC\nR'\nO\nO\nC\nR\nO\nR'\nO\nC\nR\nN\nR'\nH\nH2O\nO\nC\nR\nOH\nO\nC\nR\nOH\nO\nC\nR\nOH\n+\nPolyester\nH2O\n+\nPolyamide\nH2O\n+\nPolyether\nO\nR\nR'\nOH\nR\nH2O\n+\nPolyether urethane\nO\nC\nO\nN\nR'\nH\nR\nR\nN\nH\nC\nO\nN\nR'\nH\nR\nO\nC\nO\nO\nR'\nH2O\nOH\nR\n+\nO\nC\nHO\nR'\nHO\nR'\nH2N\nR'\nHO\nR'\nO\nC\nHO\nN\nR'\nH\nPolyurea\nH2O\nR\nN\nH\nC\nO\nOH\nR\nO\nC\nO\nOH\n+\nH2N\nR'\nPolycarbonate\nH2O\n+\nHO\nR' 11\n\nPoly(sebacic anhydride)\nProperties: rapid degradation, Tg: 50 °C, Tm : 80 °C\nUses: drug delivery matrices\nO\nO\nO\nTable. Half-lives of hydrolyzable polymers\nIncorporation of\nPolymer class\nHalf-life\nhydrophobic segment\nPolyanhydrides\n0.1 h\nPLLA\n3.3 years\n83,000 years\nPoly(bis-(p-carboxyphenoxy)propane-co-sebacic anhydride)\nC\nO\nO C3H6 O\nO\nO\nO\nC8H16\nO\nO\nPolyamides\nTabata et al., Pharm. Res., 10, 391, 1993\nGopferich, Biomater., 17, 103, 1996\n\nPoly(glycolide-co-lactide) (polyglactide)\nProperties: rapid degradation, amorphous*, Tg: 45-55 °C\nUses: bioresorbable sutures, controlled release matrices,\ntissue engineering scaffolds\n*Depending on composition\nO\nO\nO\nO\nGlycolate\nLactate\n(GA)\n(DL-LA)\nDexon(r): the first synthetic bioresorbable suture in 1960s.\n(PGA) Histological response can be predictable in comparison to non-\nsynthetic materials.\nHigh-crystalline nature limits processability.\n\nPoly(L-lactide), poly(L-lactic acid) (PLLA)\nProperties: rapid degradation, semicrystalline, Tg: 60 °C, Tm: 180 °C\nUses: fracture fixation, ligament augmentation\nO\nO\n*\nPLLA\nO\nH\nHO\nH\nHO\nH\nOH\nOH\nH\nH\nOH\nHO\nO\nO\nH\n*\nO\nO\n*\nFermentation\n-H2O\nmicroorganisms\ne.g. Lactobacilli\nL-lactic acid\nO\nO\nO\nO\n*\n*\nPLLA\nD-glucose\nfrom agricultural product;\n-H2O\ncorn, potato, rice\nL-lactide\n\nPhysical properties of various plastics\nPLLA\nPET\nPS\nPP\nDensity/g/cm3\n1.27\n1.34\n1.04\n0.90\nTensile strength/MPa\n66.7\n55.9\n43.1\n37.3\nYong's modulus/MPa\nElongation@break/%\nCost/$/lb\n1-5\n0.75\n0.55\n-\n*Polymeric materials were non-oriented (as prepared).\nTsuji, Polylactic acid, JPS press, Kyoto, 1997,\nIkada, Macromol. Rapid Commun., 21, 117, 2000\n\nO\nPolyethylene oxide (PEO)\nProperties: water soluble, semicrystalline, Tg: -60 °C, Tm: 60 °C\nUses: hydrogel, protein-resistant coatings\nTwo photos removed for copyright reasons.\nPEO\nFigure 6 in Irvine, D., et al. \"Nanoscale Clustering of RGD Peptides at\nSurfaces Using Comb Polymers. 1. Synthesis and Characterization of\nComb Thin Films.\" Biomacromolecules 2, no. 1 (2001): 85 -94.\nRate of hydrolysis:\nanhydride > ester >> amide >>>> ether etc.\nMatrices for drug delivery\n\nHydrolysis of polymeric materials\nAcid- or base-catalyzed hydrolysis\nTime\nMW\nEnzymatic hydrolysis -surface erosion-\nTime\nMW\n\nHydrolysis of Bionole(r) (PBS)\nO\nO\n*\n*\nO\nO\nPhotos removed for copyright reasons.\nAlkaline treated\nLipase PS treated\nTaniguchi I., unp ublished results\n\nApplication of biodegradable polymers\nand minimal requirements of biomaterials\nPAA:\nPBS:\nPCA:\nPCL:\nPEA:\nPGA:\nPGALA:\nPDLLA:\nPDLLA\nPGALA\nPGA\nPCA\nPOE\nPAA\nStarch\nPLLA\nPHA\n(PHB)\nPCL\nPEC\nPBS\nPES\nPEA\nChitin\nPPZ\nFibrin\nApplication of Biodegradable Polymers\nPoly(acid anhydride)\nPoly(butylene succinate)\nPoly(a-cyanoacrylate)\nPoly(e-caprolactone)\nPoly(ester amide)\nPoly(glycolide),\nPoly(glycolic acid)\nPoly(glycolide-co-lactide),\nPoly(glycolic acid-co-lactic acid)\nPoly(DL-lactide), Poly(DL-lactic acid)\nPHA:\nPHB:\nPLLA:\nPOE:\nPEC:\nPES:\nPoly(hydroxyalkanoate\nPoly(3-hydroxybutyrate)\nPoly(L-lactide),\nPoly(L-lactic acid)\nPoly(orthoester)\nPoly(ester carbonate)\nPoly(ethylene succinate)\nOxidized\ncellulose\nCellulose\nHyaluronate\nCollagen\nMedical Application\nEcological Application\nMinimal Requirements of Biomaterials\nB) Effective\nFunctionality, Performance, Durability, etc.\nC) Sterilizable\nEthylene oxide, Θ-Irradiation, Electron beams,\nAutoclave, Dry heating, etc.\nD) Biocompatible\nInterfacially, Mechanically, and Biologically\nA) Non-toxic (biosafe)\nNon-pyrogenic, Non-hemolytic, Chronically non-\ninflammative, Non-allergenic, Non-carcinogenic,\nNon-teratogenic, etc.\nFigure by MIT OCW.\nFigure by MIT OCW.\n\nControl\nWith S. waywayandensis JCM 9114\nWith A. orientalis subsp. Orientalis IFO 12362\nMicrobial degradation of PLLA (rare case)\nPhotos removed for copyright reasons.\nO\nO\n*\nHydrolysable polymer\nEsterases do not degrade\nexcept proteinase K.\nPLLA\nFigure. SEM images of PLLA film treated with microbe\nJarerat et al., Macromol. Biosci., 2, 420, 2002\n\nEnzymatic degradation -Lipase-\nBrzozowski, et al., Nature 1991, 351, 491\nLipase: an esterase (EC3.1.1.3)\nO\nC\nR\nO\nR'\nO\nC\nR\nOH\nHO\nR'\n+\nH2O\n+\nlipase\nIn toluene at 90 °C\nstable in organic solvents @ high temp.\nMW of the polyester is usually low (< 10 k).\nPoor mechanical properties.\nTwo figures removed for copyright reasons."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/18603258a500c0d62bd21380a9376e94_lecture4.pdf",
      "content": "3.051J/20.340J\nLecture 4\nBiomaterials Surfaces: Chemistry\nLike metallic implants, some polymers used in biomaterials applications\nare susceptible to chemical reactions that lead to degradation through\nhydrolysis. In many cases, a polymer is specifically chosen for its ability\nto degrade in vivo.\nPolymer Hydrolysis\nPolymer hydrolysis involves the scission of susceptible molecular\ngroups by reaction with H2O.\n3⁄4 May be acid, base or enzyme catalyzed\n3⁄4 Not surface-limited if water penetrates bulk\na) Molecular & Structural Factors Influencing Hydrolysis\n3⁄4 Bond Stability\n3⁄4 Hydrophobicity: ↑ hydrophobicity ⇒ ↓ hydrolysis\n3⁄4 MW & architecture: higher MW ⇒ ↓ hydrolysis\n3⁄4 Morphology\n- crystallinity ↓ hydrolysis\n- porosity ↑ hydrolysis\n3⁄4 Tg: less mobility ⇒ ↓ hydrolysis\nBond Stability\nSusceptible linkages at bonds where resonance stabilized intermediates\nare possible...\nO\nO\n- Esters: R-C-O-R' + H2O → R-C-OH + HO-R'\n\n-\n-\n- -\n- -\n3.051J/20.340J\nExample 1: poly(lactide-co-glycolide)\nProperties: rapid degradation, amorphous, Tg ~ 45-55°C\nUses: bioresorbable sutures, controlled release matrices,\ntissue engineering scaffolds\nO\nO\n(-O-CH(CH3)-C-)x-r-(-O-CH2-C-)y\nlactic acid glycolic acid\nExample 2: polyethylene terephthalate (Dacron)\nProperties: very slow hydrolysis, semicrystalline, Tg~ 69°C\nUses: vascular grafts, arterial patches, heart pumps\nO\nO\n[-O C\nC O- CH2 - CH2 -]N\nbase-catalyzed polyester hydrolysis:\nOH--\nO\nR\nC\n-\nOR'\n--O-\nO\nR\nR\n+ HOR' + OH--\nC\nC\nOH\nO\nR'\nH\nH\nO\nOH\n\n-\n-\n- -\n-\n-\n- -\n- -\nC\n3.051J/20.340J\nacid-catalyzed polyester hydrolysis:\n-\n-\nH+ X\n-\n-O\nR\n+\nOR'\nH X\nH\nH\n- -O\nO\nR\nC\nOR'\nH\nH\nO\nO-H\nX\nO\nC\nR\nO+\nC\nR O\nR'\nH\nH\n+ HOR'\nH3O+ X\nOH\nO\nO\n- Amides: R-C -NH-R' + H2O → R-C-OH + H2N-R'\namide or peptide linkage,\nalso found in proteins!\nO\nO\nExample: Nylon 6,6\n(-NH-(CH2)6-NH-C-(CH2)4-C-)N\npoly(hexamethylene adipamide)\nProperties: ~9% H2O uptake, semicrystalline, Tg~50°C\nUses: removable sutures, prosthetic joints\n\n3.051J/20.340J\nO\nO\nO\nO\n- Anhydrides: R-C -O-C-R' + H2O → R-C-OH + HO-C -R'\nO\nO\nExample: poly(sebacic acid anyhydride)\n(-(CH2)8-C -O-C-)N\nProperties: rapid degradation (surface-based)\nUses: drug delivery matrices\n- Ethers: R-O-R' + H2O → R-CH2-OH + HO-CH2-R'\nExample: polyethylene oxide (PEO)\n(-CH2-O-CH2-)N\nProperties: water soluble, semicrystalline, Tg ~ -60°C\nUses: hydrogels, protein-resistant coatings\nO\nO\n- Urethanes: R-NH-C -O-R' + H2O → R-NH-C-OH + HO-R'\nExample: polyether urethane\nO\nO\n[(-(CH2)4-O-)xC -NH\nCH2\nNHC -O-]N - [hard block] -\nProperties: \"soft\" block of SPU \"Biomer\", slow hydrolysis\nUses: pacemaker lead sheaths & connectors\n\n3.051J/20.340J\nO\nO\n- Ureas: R-NH-C -NH-R' + H2O → R-NH-C-OH + H2N-R'\nO\nO\n- Carbonates: R-O-C -O-R' + H2O → R-O-C-OH + HO-R'\nRates of Hydrolysis: anhydride > ester > amide > ether\nStable Polymer Chemistries:\n- Olefins\ne.g., UHMWPE: joint cup liners\n- Halogenated hydrocarbons\ne.g., PVC: catheters; PTFE: vascular grafts\n- Siloxanes\ne.g., PDMS: soft tissue prostheses\n- Sulfones\ne.g., PSf: renal dialysis membranes\n\n3.051J/20.340J\nb) Biological Factors Influencing Hydrolysis\n- pH variations\ninflammation/infection ⇒ ↓pH, catalyzes hydrolysis\n- Hydrolases--enzymes that catalyze hydrolytic reactions\n3⁄4 Proteolases: catalyze hydrolysis of peptide bonds\n3⁄4 Esterases: catalyze hydrolysis of ester bonds\n3⁄4 Produced by phagocytic cells\nc) Influence of Hydrolysis on In Vivo Performance\n3⁄4 Loss of structural integrity\ne.g., i) polyester urethanes: rapid degradation in orthopedic\nreconstructions (no longer used)\nii) PET fibers: deterioration after long periods in\ncardiovascular applications\n3⁄4 Toxicity/mutagenicity\ne.g., i) segmented polyurethanes (SPUs): suspected\ntumorigenicity of degradation products\nii) cyanoacrylates (soft tissue adhesive):\nhydrolysis generates formaldehyde"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/13a6789cf02d2f1cb6ea84d200a1664e_lecture5.pdf",
      "content": "3.051J/20.340J\n\nLecture 5:\nProtein-Surface Interactions\n\nImportance of Protein-Surface Interactions:\n\n- Modulate cell adhesion\n- Trigger the biological cascade resulting in foreign body response\n- Central to diagnostic assay/sensor device design & performance\n- Initiate other bioadhesion: e.g., marine fouling, bacterial adhesion\n\nFundamentals on Proteins:\n\n- Largest organic component of cells (~18 wt% /H2O =70%); extra-\ncellular matrix, and plasma (7wt% /H2O=90%).\n\n- Many thousands exist--each encoded from a gene in DNA.\n\n- Involved in all work of cells: ex, adhesion, migration, secretion,\ndifferentiation, proliferation and apoptosis (death).\n\n- May be soluble or insoluble in body fluids.\n\nInsoluble proteins--structural & motility functions; can also\nmediate cell function (ex., via adhesion peptides)\n\nSoluble proteins--strongly control cell function via binding,\nadsorption, etc.\n\n- Occur in wide range of molecular weights.\n\n3.051J/20.340J\n\n\"Peptides\" (several amino acids): hormones,\npharmacological reagents\n\ne.g., oxytocin: stimulates uterine contractions (9 a.a.)\naspartame: NutraSweet (2 a.a.)\n\n\"Polypeptides\" (~10-100 amino acids): hormones, growth\nfactors\n\ne.g., insulin: 2 polypeptide chains (30 & 21 a.a.)\n\nepidermal growth factor (45 a.a.)\n\n\"Proteins\" 100's-1000's of amino acids\n\ne.g., serum albumin (550 a.a.)\n\napolipoprotein B: cholesterol transport agent (4536 a.a.)\n\nProtein Functions:\n\n- Structural/scaffold: components of the extracellular matrix (ECM)\nthat physically supports cells\n\ne.g., collagen--fibrillar, imparts strength;\nelastin--elasticity to ligaments;\nadhesion proteins: fibronectin, laminin, vitronectin--glycoproteins\nthat mediate cell attachment (bonded to GAGs)\n\n- Enzymes: catalyze rxns by lowering Ea thru stabilized transition\nstate, via release of binding energy\n\ne.g., urease--catalyzes hydrolysis of urea\n\n3.051J/20.340J\n\n- Transport: bind and deliver specific molecules to organs or across\ncell membrane\n\ne.g., hemoglobin carries bound O2 to tissues;\nserum albumin transports fatty acids\n\n- Motile: provide mechanism for cell motion e.g., via\n(de)polymerization & contraction\n\ne.g., actin, myosin in muscle\n\n- Defense: proteins integral to the immune response and coagulation\nmechanism\n\ne.g., immunoglobulins (antibodies)--Y-shaped proteins that bind to\nantigens (foreign proteins) inducing aggregate formation\n\nfibrinogen & thrombin--induce clots by platelet receptor\nbinding\n\n- Regulatory: cytokines--regulate cell activities\n\ne.g., hormones: insulin (regulates sugar metabolism); growth factors\n\n3.051J/20.340J\n\nProtein Structure\n\nProteins have multiple structural levels...\n\n1. Primary Structure\n\n3⁄4 comprised of amino acid residues: - -CHR- -\n\nO\nH\nC\nN\n3⁄4 peptide (amide) bond CONH is effectively rigid & planar (partial\ndouble-bond character)\n\n3⁄4 directional character to bonding: amino acids are L stereoisomers\n\n[after A. L. Lehninger, D. L. Nelson and M. M.\nCox. Principles of Biochemistry, pg. 171.]\n[after A. L. Lehninger, D. L. Nelson and M. M.\nCox, Principles of Biochemistry, pg. 115.]\nFigure by MIT OCW.\nFigure by MIT OCW.\n\n3.051J/20.340J\n\n3⁄4 side groups R have variable character\n\n[after A. L. Lehninger, D. L. Nelson and M. M.\nCox. Principles of Biochemistry.]\nFigure by MIT OCW.\n\n3.051J/20.340J\n\n2. Secondary Structure\n\nSpatial configuration determined by the rotation angles φi & ψi about the\nsingle bonds of the α-carbons\n\n(φi ,ψi) are\nindependent of\n(φi+1,ψi+1)\n[after P. J. Flory. Statistical\nMechanics of Chain Molecules,\npg. 251.]\n\nRamachandran plots:\ndesignate permitted ranges\nof φ & ψ for a.a. residues\nImage removed due to copyright considerations\n[from A.L. Lehninger, D.L.\nNelson & M.M. Cox, pg. 171.]\nFigure by MIT OCW.\n\n3.051J/20.340J\n\nβ-sheets\n\n3⁄4 backbone has extended \"zigzag\" structure\n3⁄4 stabilized by intermolecular H-bonding between -NH and C=O\nof adjacent chains\n\nα-helices\n\n3⁄4 stabilized by intramolecular H-bonding between C=O of residue i\nand -NH of residue i+3 (requires all L or D stereoisomers)\n\n[after A. L. Lehninger, D. L. Nelson and M. M.\nCox. Principles of Biochemistry, pg. 169.]\n\n[after P. J. Flory. Statistical Mechanics\nof Chain Molecules, pg. 287]\nFigure by MIT OCW.\nFigure by MIT OCW.\n\n3.051J/20.340J\n\n3⁄4 natural abundance\n\nmost common secondary structure in proteins\nin fibrous proteins: α-keratins (hair, skin,...)\nin globular proteins: avg. ~25% α-helix content\n\n3. Tertiary & Quaternary Structure\n\n3⁄4 Tertiary: folded arrangements of secondary structure units\n\n3⁄4 Quaternary: arrangements of tertiary (polypeptide) units\n\nExample: hemoglobin\n\n[from A.L. Lehninger, D.L.\nNelson & M.M. Cox, pg. 187.]\n\nImage removed due to copyright considerations\n\n3.051J/20.340J\n\nSynthetic Polymers vs. Proteins\n\nProperty\n\nSynthetic Polymers\n\nPolypeptides\n\nMolecular Wt.\n\n1000-106 g/mol\n\n1000-106 g/mol\n( typ. <2000 a.a.)\nMolecular Wt.\nDistribution\nAlways > 1 (Mw/Mn)\nAlways ≡1\nSequence\n\ni. 1-3 types of repeat units\nii. many chemistries\n\ni. many side groups\nii. always amides\nSolution\nStructure\nRandom coils or self-\navoiding random coils\n\nRg~N0.5 (θ solvent)\nRg~N0.6 (good solvent)\nGlobular -\"condensed\"\nchains (ρ~1.36 g/cm3)\n\n(hydrophobic R groups\nsheltered from H2O)\n\nRg~Naa\n0.33\nAvailable\nConformations\nΩran ∼ zN (z = # n.n.)\nΩSA ∼ z'N Ν1/6 << Ωran\nΩ ~1 (can ↑ if bound\nor adsorbed!)\nSecondary\nInteractions\nvan der Waals, H-bonds,\nelectrostatic, \"hydrophobic\neffect\"\nSame as synthetic,\nwith\" lock-and-key\"\ntopology\n\nPolypeptides can transform to \"random coil\" conformations, through:\n\n3⁄4 changes in temperature\n3⁄4 changes in soln. pH or composition (e.g., added salts, urea)\n3⁄4 adsorption to surfaces\n\n⇒ changes physiological\nfunction!\n\n3.051J/20.340J\n\nProtein Adsorption on Biomaterial Surfaces\n\nBackground\na) Protein activity varies in adsorbed vs. solvated state\n\nWhy?\n\n1. higher local concentration-- function may be\nconc. dependent\n\ne.g., cell adhesion increases with adhesion\npeptide concentration\n\n2. change in reactivity--access to \"active\" a.a.\nsequence ↑ or ↓\n\n⇒ enhanced or reduced binding capability\n\ne.g., fibrinogen: platelets adhere when adsorbed,\nnot in soln.\n\n3. denaturation--conformation varies from soln.\nconformation\n⇒ different a.a. sequences exposed\n\n*enhance or deactivate normal function\n\n*elicit unintended function\n\ne.g., natural polymers used as biomaterials are\nmore immunogenic than synthetic polymers\n\n3.051J/20.340J\n\nb) Driving forces for protein adsorption\n\n1. secondary bond formation\n\nDepends on material's\nsurface chemistry\nelectrostatic > H-bonding > dispersive\n\nBOND ENERGY\n\n2. entropic forces\n\n3⁄4 ↑ configurations from \"structured\" H2O adjacent to\nnonpolar surfaces (the \"hydrophobic effect\")\n\n3⁄4 less translational entropy loss (∆Smix) for adsorbed\nproteins (macromolecules) vs. H2O\n\nln\nln\nmix\np\np\nH O\nH\nS\nn\nn\nk\nO\nφ\nφ\n∆\n=\n+\n\nFor a given φp, np decreases as\nprotein MW ↑ ⇒ ↓ ∆Smix\n3⁄4 ↑ configurations for denatured vs. solvated proteins\n\n3.051J/20.340J\n\nc) Adsorbed proteins initiate physiological responses to biomaterials\n\n3⁄4 coagulation mechanism\n\n3⁄4 alternative pathway of complement system (vs. antigen-\nantibody)\n\n3⁄4 in vitro protein adsorption experiments → 1st test of\n\"biocompatibility\"\n\nModels for Protein Adsorption\n\nThe simplest picture: Langmuir model for reversible adsorption\n\nMakes analogy to chemical reaction kinetics:\n\n[P] = protein concentration in solution (e.g., #/vol)\n[S] = density of unoccupied surface sites (e.g., #/area)\n[PS] = density of surface sites occupied by protein\n\nAssumes: 1 protein binds 1 surface \"site\"--\ncan involve multiple secondary bonds\nP + S ↔ PS\n\nAssuming the \"reaction\" follows 1st order kinetics:\n\nadsorption rate = ka[P][S]\n\ndesorption rate = kd [PS]\n\nAssumes: dilute [P] (in plasma: 90% H2O)\n\n3.051J/20.340J\n\nAt equilibrium: adsorption rate = desorption rate\n\nka[P][S] = kd[PS]\n\nAssumes: reversibility\n\nCan define an \"affinity\" const, K (or Ka):\nK = ka/kd =\n[\n]\n[ ][ ]\nPS\nP\nS\n\n(a.k.a. \"binding\" or \"association\" const; typical units = L/mol)\n\nK obtained experimentally by measure of fraction occupied sites:\n\nν = # filled sites/total # surface sites\n\n[\n]\n[ ] [\n]\n(\n)\n[ ]\n[ ]\n(\n)\nPS\nK P\nS\nPS\nK P\nν =\n=\n+\n+\n\nν\nBinding plateaus at ν=1,\nmonolayer coverage.\n\n[P]\n\nTo obtain K:\n\n1/ν\nslope = 1/K\n\n1/[P]\n\n3.051J/20.340J\n\nKa is an indicator of the favorableness of adsorption. Note that Ka is the\ninverse of the dissociation constant, Kd, which has units of\nconcentration, e.g., mol/L.\n\n3⁄4 For [P] < Kd, few occupied surface sites.\n\n3⁄4 For [P] = Kd, half of the surface sites will be occupied.\n\nA second approach used to extract K is known as a Scatchard plot.\nRearranging:\n[\n]\n[ ]\n[ ]\nPS\nK S\nP\n=\n\nDefining the total number of surface sites:\n[ ]\n[ ] [\n]\nS\nS\nPS\n=\n+\n,\n\nAnd substituting for [S]:\n[\n]\n([ ]\n[\n])\n[ ]\nPS\nK\nS\nPS\nP\n-\n=\n\nIf the protein solution concentration is not significantly depleted upon\nadsorption, then [P] ≈ [P]0 (the initial protein concentration):\n\n[\n]\n[\n]\n[ ]\n[ ]\nPS\nK PS\nK S\nP\n= -\n+\n\nScatchard Plot\nintercept = K [S]0\nslope = -K\n\n[\n]\n[ ]\nPS\nP\nProvides a\nmeasure of [S]0\n\n[PS]\n\n3.051J/20.340J\n\nIn adsorption experiments, the value usually measured is a surface\nconcentration, e.g., ng/cm2 or μg/cm2 - often denoted as Γ or θ\n\n[P] (mg/ml)\nΓmax\nΓ (μg/cm2)\n\nIf we assume a monolayer coverage at Γmax, we can calculate the\neffective area per protein molecule on the surface:\n\nmax\nprotein\neff\nAv\nM\nA\nN\n=\nΓ\n\nRelated to protein\nconformation on surface!\n\nNote that [S]0 (in #/area) is the inverse of the area per molecule:\n\n[ ]\neff\nA\nS\n="
    },
    {
      "category": "Lecture Notes",
      "title": "lecture6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/be5ea930c594584a0fac0477c963fc80_lecture6.pdf",
      "content": "3.051J/20.340J\nLecture 6:\nProtein-Surface Interactions ( Part II)\nThe Langmuir model is applicable to numerous reversible adsorption\nprocesses, but fails to capture many aspects of protein adsorption.\n1. Competitive Adsorption\n3⁄4 many different globular proteins in vivo\n3⁄4 surface distribution depends on [Pi]'s & time\nThe Vroman effect: Displacement (over time) of initially adsorbed\nprotein by a second protein.\nS.L. Cooper, J. Biomater. Sci. 3,\n1991: 27-47.)\nΓFGN\nΓFN\nΓVN\nΓ (\n2)\nFGN, FN, VN adsorption on a\npolyether urethane from plasma\n(from D.J. Fabrizius-Homan &\nng/cm\ntime (min)\nProtein\nPlasma conc. (mg/ml)\nMW (Daltons)\nHuman serum albumin\n68,500\nImmunoglobulins\n145,000 (IgG)\nFibrinogen\n3.0\n340,000\nFibronectin\n0.3\n240,000\nVitronectin\n0.2\n60,000\nPlasma - fluid component of blood with anticoagulant added\nSerum - fluid component of blood with coagulants removed\n\n3.051J/20.340J\nHypothesis:\nAt t~0: uniform [Pi]'s everywhere ⇒ protein with highest concentration\ndominates initial adsorption\nAt t>0: local depletion of adsorbed species near surface- exchange with\nfaster diffusing species ensues\nAt t>>0: gradual exchange with higher affinity species\n2. Irreversible Adsorption\n3⁄4 occurs in vivo & in vitro: proteins often do not desorb after\nprolonged exposure to protein solutions\n3⁄4 complicates the competitive adsorption picture\n% FGN\nremaining\nPDMS\nGlass\nSurfaces exposed to plasma after\nof FGN\nadsorption\n(from S.M. Slack and T.A.\nFGN adsorp. time (min)\nHorbett, J. Colloid & Intfc Sci.\n133, 1989: 148.)\n\n3.051J/20.340J\nPhysiological implications:\na) hydrophobic surfaces cause more denaturing\nb) denatured proteins may ultimately desorb (by\nreplacement) ⇒ non-native solution behavior\nModels that attempt to account for 1 & 2:\nS.M. Slack and T.A. Horbett, J. Colloid & Intfc Sci. 133, 1989 p. 148\nI. Lundstroem and H. Elwing, J. Colloid & Intfc Sci. 136, 1990 p. 68\nC.F. Lu, A. Nadarajah, and K.K. Chittur, J. Coll. & Intfc Sci. 168, 1994 p. 152\n3. Restructuring\n3⁄4 Protein layers reaching monolayer saturation can reorganize\n(e.g., crystallize) on surface, creating a stepped isotherm\nΓ\ntime\n\n3.051J/20.340J\n4. Multilayer Formation\n3⁄4 Proteins can adsorb atop protein monolayers or sublayers,\ncreating complicated adsorption profiles\nΓ\ntime\n\n3.051J/20.340J\nMeasurement of Adsorbed Proteins\n1. Techniques for Quantifying Adsorbed Amount\na) Labeling Methods: tag protein for quantification, use known standards\nfor calibration\ni)\nRadioisotopic labeling\n3⁄4 proteins labeled with radioactive isotopes that react with\nspecific a.a. residues\ne.g., tyrosine labeling with 125I; 131I; 32P\nOH\n- CH2\n125I\n- CH2\nOH\n125I\n3⁄4 Small % radioactive proteins added to unlabelled protein\n3⁄4 γ counts measured and calibrated to give cpm/μg\nAdvantage: high signal-to-noise ⇒ measure small amts (ng)\nDisads: dangerous γ emissions, waste disposal, requires protein\nisolation\nii)\nFluorescent labels\n3⁄4 measure fluorescence from optical excitation of tag\n\n3.051J/20.340J\ncovalently binds\nto amines\ne.g., fluorescein isothiocyanate (FITC)\nAdvantage: safe chemistry\nDisads: tag may interfere with adsorption, requires protein\nisolation, low signal\niii) Staining\n3⁄4 molecular label is adsorbed to proteins post facto\ne.g., organic dyes; antibodies (e.g, FITC-labeled)\nAdvantages: safe chemistry, no protein isolation/modification\nDisads: nonspecific adsorption of staining agents (high noise)\nb) Other Quantification Methods\ni) HPLC on supernatants (w/ UV detection)\nii) XPS signal intensity, e.g., N1s (relative to controls)\niii) Ellipsometry--adsorbed layer thickness (dry)\n\n3.051J/20.340J\n2. Techniques for Studying Adsorption Kinetics\na) In situ Ellipsometry\n/tutorial_1.html\ni\nr\nCourtesy of J. A. Woollam Co., Inc. Used with permission.\nFigure from:\nhttp://www.jawoollam.com\n- polarized light reflected from a surface\n- phase & amplitude changes to parallel (p) and\nperpendicular (s) E-field components\nEi , Er = incident/reflected E-field\nE\niδ\nErs\niδs\n= r\nr =\n= r ⋅e\np\ns\n⋅e\np and s\nreflection coefficients: rp =\nrp\nEip\nEis\nrp\nratio of amplitudes: tan Ψ =\nphase difference: ∆= δ p -δ s\nrs\n3⁄4 Experimental set-up\nHe-Ne\nlaser\nRotatable\npolarizer\nRotatable\nanalyzer\nPhotodetector\n1⁄4 wave plate\nSample\n\n3.051J/20.340J\nProteins adsorbed to a surface\nnf df\nnl\nns\nAdsorbed protein layer changes the refractive index adjacent to the\nsubstrate.\n3⁄4 Ellipsometric angles Ψ and ∆can be converted to adsorbed layer\nthickness (df ) & refractive index (nf) assuming 3-layer model &\nFresnel optics\nn f -nl\n3⁄4 adsorbed amount: Γ = d f\n/\ndn dc\nR.I. increment of protein solution\nvs. protein conc. (~0.2 ml/g)\nAdvantages: no protein isolation; fast; easy; in situ; sensitive\nDisads: quantitation requires a model, optically flat & reflective\nsubstrates required; can't distinguish different proteins\nReferences:\nP. Tengvall, I. Lundstrom, B. Liedburg, Biomaterials 19, 1998: 407-422.\nH.G. Tompkins, A User's Guide to Ellipsometry, Academic Press: San Diego,\n1993.\n\n3.051J/20.340J\nb) Surface Plasmon Resonance\n3⁄4 Experimental set-up: polarized light reflects at interface between\nglass with deposited metal film and liquid flow cell\nΚz\nθ\nAu or Ag film\npolarized light\nΚsp\ndetector\nΚEv\nliquid\nTotal internal reflection\nFor θ > θcritical, transmitted\nintensity decays exponentially\ninto liquid (evanescent wave).\nAnalogous to QM tunneling--\nwave at a boundary\n3⁄4 Theoretical basis:\n- light traveling through high n medium (glass) will reflect\nback into that medium at an interface with material of lower\nn (air/water)\n- total internal reflection for θ > θcritical\n⎛\n-\nθcritical = sin 1\n⎜⎜ nlow ⎟⎟\n⎞\n⎝ nhigh ⎠\n- surface plasmons--charge density waves (free oscillating\nelectrons) that propagate along interface between metal and\ndielectric (protein soln)\n- coupling of evanescent wave to plasmons in metal film\noccurs for θ= θspr (> θcritcal) corresponding to the condition:\nKsp = KEv\n\n3.051J/20.340J\nc/ω0 = incident light λ\nε\nKsp, KEv\nmetal = metal dielectric const.\n= wavevector of surface\nplasmon/evanescent field\nω\nKEv = nglass\n0 sin θ\nc\nω0\nεmetalnsurface\nK =\nsp\nc\nεmetal + nsurface\n- Energy transfer to metal film reduces reflected light intensity\n- change of nsurface due to adsorption of protein at interface will\nshift θspr where Ksp = KEv\nFigure by MIT OCW\nBiacore Commercial SPR Instrument\nBiacore website: www.biacore.com/lifesciences/index.html\nfrom\nCourtesy of Biacore. Used with permission.\n\n3.051J/20.340J\nθspr shift\n(arc sec)\nR0\ntime\nInject\nBuffer wash\nDetermining adsorption kinetics\nprotein soln\n(t=0)\nResonance shift fitted to:\nR t\n\n) = (R -R 0)[1-exp( -k\nt)]+ R0 → obtain kobs\n(\ninf\nobs\nlinear fit of :\nP\nkobs = kd + ka [ ] → obtain kd, ka\n- more complex fitting expressions for R(t) often required\n( ) = R exp(-k t )\n- kd alternatively obtained from dissociation data: R t\nd\nAdvantages: no protein labeling, controlled kinetic studies,\nsensitive\nDisads: requires \"model\" surface preparation--limited\napplicability\nReferences:\nR.J. Green, et al., Biomaterials 21, 2000: 1823-1835.\nP.R. Edwards et al., J. Molec. Recog. 10, 1997: 128-134.\n\n3.051J/20.340J\n3. Extent of Denaturing\nEllipsometry\n3⁄4 Variations in thickness (df ) & refractive index (nf) of adsorbed layer\nover time gives indication of denaturation (inconclusive)\nCircular Dichroism\n3⁄4 Experimental set-up: monochromatic, plane-polarized light is passed\nthrough a sample solution and detected\nlight\npolarizer\nrotating\nl\nsample cell\nphotodetector\nmonochrometer\nanalyzer\nsource\n3⁄4 Theoretical basis: unequal absorption of R- and L-components of\npolarized light by chiral molecules (e.g., proteins!)\nE\nR\nL\nψ = ellipticity\nPlane-polarized light\nresolved into circular\ncomponents R & L\nMore absorption of\nR causes E to follow\nelliptical path\n\n2.303\n3.051J/20.340J\nThe ellipticity ψ is related to the difference in L and R absorption by:\nψ =\n( AL -AR ) 180 (degrees)\nπ\nI\nwhere A = - log T = - log\n= εc l\n\n(Beer's Law)\np\nI0\nθ = ψ ⋅ M p\ncp = protein conc. (g/cm3)\nMolar ellipticity: [ ]\nc l\nε = molar extinction coeff. (cm2/g)\np\nl = path length (cm)\nMp = protein mol. weight (g/mol)\nT = transmittance\n- Ellipticity can be + or -; depends on electronic transition (π-π∗ vs.\nn-π∗)\n- Proteins exhibit different values of [θ] for α helix, β sheet, and\nrandom coil conformations in the far UV.\nConformation\nWavelength (nm)\nTransition\nα helix\n222 (-)\nn-π* peptide\nα helix\n208 (-)\nπ-π* peptide\nα helix\n192 (+)\nπ-π* peptide\nβ sheet\n216 (-)\nn-π* peptide\nβ sheet\n195 (+)\nπ-π* peptide\nβ sheet\n175 (-)\nπ-π* peptide\n\n3.051J/20.340J\nl (\n)\n[β] x\n2 /\na\nb\n-40\nnm\n-20\n10 -3 degree cm decimole\nhelix\nsheet\nRandom coil\nFigure by MIT OCW.\nAfter T.E. Creighton, ed., Proteins:\nStructures and Molecular Principles,\nW.H. Freeman & Co: NY; 1983, p. 181.\nChanges to CD spectra give a measure of denaturation,\ne.g., due to adsorption at a surface\nl (\n)\n[β] (\n.\n2 .\n)\na\nc\nd\ne\nb\nα*\na\nnm\ndeg cm dmol -1\n-20000\n-10000\nBand at 222 nm\nattributed to n-\ntransition in -helix\nCD spectra for the synthetic peptide:\nAc-DDDDDAAAARRRRR-Am\n(a) in pH 7 solution\n(b-e) adsorbed to colloidal silica: b) pH\n6.8; c) pH 7.9; d) pH 9.2; e) pH 11.3 After\nFigure by MIT OCW.\n[After S.L. Burkett and M.J. Read,\nLangmuir 17, 5059 (2001).]\n\n3.051J/20.340J\nFor quantitative comparisons, molar ellipticity per residue is computed,\nby dividing [θ] by the number of residues in the protein (nr).\nψ ⋅M p\nψ ⋅M r\nθ\n=\n[ ]mrd = 10n c l\n10c l\nunits: deg cm2 dmol-1\nr\np\n\np\n\n% of α helix, β sheet, and random coil conformations obtained by linear\ndeconvolution using \"standard curves\" from homopolypeptides such as\npoly(L-lysine) in 100% α helix, β sheet, and random coil conformations.\n\"Circular Dichroism Spectroscopy\" by Bernhard Rupp.\nhttp://web.archive.org/web/20050208092958/http://www-structure.llnl.gov/cd/cdtutorial.htm\n\n3.051J/20.340J\nFor a rough estimate of α-helix content, the following expressions have\nbeen employed:\nα - helix % = [θ]\n- 4000\n33, 000 -4000 from [θ]mrd data at 208 nm\nθ\nα - helix % = [ ]222\n40, 000\nfrom [θ]mrd data at 222 nm\nAdvantages: no labeling required; simple set-up\nDisads: need experimental geometry with high surface area, e.g.,\ncolloidal particles (high signal)\nReferences:\nN. Berova, K. Nakanishi and R.W. Woody, eds., Circular Dichroism: Principles\nand Applications, 2nd ed.,Wiley-VCH: NY; 2000.\nN. Greenfield and G.D. Fasman, Biochemistry 8 (1969) 4108-4116."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/487324e45202f661bb19e6fba3f90a92_lecture7.pdf",
      "content": "3.051J/20.340J\nLecture 7:\nCell-Surface Interactions: Host Responses to Biomaterials\nSynthetic surfaces exposed to biological fluids adsorb proteins-- how\ndoes this mediate the body's ultimate response to a biomaterial?\nProtein-Cell Interactions\nproteins (in solution or on a surface) bind with cell \"receptors\"\n⇒ physiological response\nprotein ligand\ncytoplasmic\ntransmembrane\nstalk\nbinding site\ndomain (tail)\ndomain\nextracellular\ndomain\nCell surface receptors: membrane-embedded proteins or glycoproteins\nthat control signal transduction and cell adhesion (~100 types/cell!)\nligand-receptor binding mediates:\n- Adhesion\n- Contraction\n- Motility\n- Secretion\n- Proliferation\n\n3.051J/20.340J\nCell adhesion mechanisms\nCells attach to other cells and to extracellular matrix (ECM) through\nadhesion receptors that bind specific peptide sequences of other proteins\nLeu-Asp-Val (LDV), & other\n120-180kDa\n90-210 kDa\nIntegrin\nStructure\nα subunit\nβ\nCadherins: receptors that adhere\ncells to other cells\n3⁄4 Ca2+-dependent binding\n3⁄4 attach via His-Ala-Val (HAV)\nIntegrins\nin ECM\n3⁄4 Ca2+/Mg2+\n3⁄4 attach to Arg-Gly-Asp (RGD),\nfocal contact\nactin filaments\nECM\nsubunit\n: bind cells to adhesion proteins\n-dependent binding\nof cytoskeleton\n3⁄4 2 associated subunits-- ~22 α/β combinations having different ligands\n3⁄4 adhere to fibronectin, vitronectin, tenascin, collagen, laminin in ECM, & cell\ncounter-receptors (ICAMs: intracellular cell-associated matrix proteins)\n3⁄4 adhere to plasma proteins fibrinogen, factor X (coagulation), C3bi\n3⁄4 typical receptor/ligand KD ~ 10-6-10-7 mol/L\n3⁄4 2D diffusion in cell membrane D ~ 10-10 cm2/s\n3⁄4 integrin clustering: i) recruits cytoskeletal proteins (talin, vinculin, actin)\n⇒ mediates traction (focal contacts)\nii) recruits cytoplasmic signaling molecules (e.g. tyrosine\nkinase) ⇒ mediates cell secretions, etc.\n\n3.051J/20.340J\nExtracellular matrix houses adhesion proteins that bind to cell receptors\nECM functions:\n3⁄4 anchor cells\n3⁄4 control cell orientation\n3⁄4 regulate cell growth\n3⁄4 maintain cell differentiation\n3⁄4 provide scaffolding for tissue renewal\nECM components:\n3⁄4 fibrous proteins: collagen (strength), elastin (elasticity)\n3⁄4 intrafibrillary matrix: proteoglycans (GAG-protein molecules)\n3⁄4 adhesive glycoproteins: fibronectin, laminin, etc.\n3⁄4 calcified in formation of bones, teeth\n3⁄4 can be \"remodeled\": broken down and regenerated\nAdhesion proteins exhibit domains for binding cell integrins, other ECM\nmolecules & plasma proteins\nFibrin\nCell\nRGD\nLDV/REDV\nIDAP\nFibronectin binding domains\nHeparin\nCollagen\nCell\nHeparin\nFibrin\nAdhesion proteins play a primary role in the body's response to injury\nand introduction of foreign materials.\n\n3.051J/20.340J\nBasic Tissue Cell Types and Functions\nCell type\nTissue Function\nExample\nepithelial\ncovers external (ex, skin) &\ninternal (ex, intestine, blood\nvessel) organ surfaces\nendothelial cells\nconnective\nsupports other body tissues;\nhouses nerves & blood vessels\nfibroblasts (ECM\ngeneration),\ncartilage, bone\nmuscle\nspecialized for contraction;\nsmooth, skeletal,\ncardiac\nnerve\ngenerate electrical signals &\nsecrete neurotransmitters\nbrain cells,\nperipheral nerve\nFigure by MIT OCW.\n\n3.051J/20.340J\nInjured tissue response: known as inflammatory response\ngoal: to destroy or inactivate foreign entity, initiate healing\nmechanism: signal \"cascades\" from plasma & cells\nImplantation of biomaterials activates two cooperative signaling\ncascades:\n1) Coagulation Cascade--involves ~12 proteins\n2) Complement Alternative Pathway--involves >20 proteins\nThe host reaction follows the sequence:\nINJURY\nTIME\nBlood-Materials Interactions\nSeconds/Minutes\nProvisional Matrix Formation\nHours\nAcute Inflammation\nChronic Inflammation\nDays\nGranulation Tissue\nForeign Body Reaction\nWeeks\nFibrosis/Fibrous Capsule Formation\n\n3.051J/20.340J\n\n1. Coagulation Cascade\n\nIn absence of injury or foreign materials, clotting is prevented by the\nendothelial cell lining of blood vessels which exhibit heparan sulfate\nproteoglycans on their surface\n\nHeparan sulfate: - polysaccharide w/ SO3\n- and COO- charges\n\n- provides electrosteric repulsion\n\n- binds anti-thrombin → deactivates thrombin\nElectrosteric repulsion from\ncharged glycocalyx\nInteraction\nEnergy\nSpecific attraction from\nadhesion receptors\nNonspecific attraction from\nmembrane surfaces\nDistance from\nmembrane surface\nAnti-thrombin\nthrombin\nthrombin/anti-\nthrobmin complex\n\n3.051J/20.340J\nINJURY ⇒ release of fluids, proteins & blood cells from vascularized\nconnective tissues at site\n- Vasodilation ⇒ redness & swelling\n- Adsorption of plasma proteins (esp. fibrinogen) on foreign\nsurfaces & injured tissues\nDamaged endothelial cell\nlining exposes collagen\n- platelets (250M/cc, 0.3 vol%) bind to adsorbed plasma proteins\n(FGN, VN, FN) via αΙΙb/β3 (gpIIb/IIIa) receptors (~40,000/cell)\nand exposed collagen via α1/β1(gpIb) receptors (~15,000/cell)\n- platelet binding triggers release of storage granule contents to\nextracellular environment (mediated by focal contacts)\nstorage granules\n- platelet-specific proteins\n- plasma proteins\n- coagulation factors\n- ADP, Ca2+, serotonin\n(neurotransmitter)\n- enzymes (acid hydrolases)\n\n3.051J/20.340J\n- granule release increases receptor expression on surface &\nrecruits other platelets to site\nchemotaxis: cell migration along a chemical gradient\n- platelet aggregation via fibrinogen bridges, forms a \"plug\" that\ninitially reduces blood flow\n- complex cascade of enzymatic activity on platelet surface\nculminates with factor X conversion of plasma protein\nprothrombin (~100 μg/ml) to thrombin\n- thrombin cleaves fibrinogen to form insoluble fibrin which\ncrosslinks around platelet plug to form the thrombus or clot\n\n3.051J/20.340J\nFigure removed for copyright reasons.\nSee \"The Coagulation Cascade\" at http://labtestsonline.org/images/coag_cascade.pdf\n\n3.051J/20.340J\nCopolymer film surface after incubation in\nwhole blood for 2h. Platelets and red blood\ncells are observed in fibin matrix.\nR. Barbucci et al., J. Biomed. Mater. Res.\nPhoto removed for copyright reasons.\n1999, 46, 186.\nPhoto removed for copyright reasons.\nPlatelets on modified PE surface from\nplatelet-rich plasma\nJ.H. Lee and H.B. Lee, J. Biomed. Mater.\nRes. 1998, 41, 304.\nPhoto removed for copyright reasons.\nFibrin matrix created by addition of\nthrombin to fibrinogen.\nA.V. Cooper et al., Blood 2003, 102,\nPhotos removed for copyright reasons.\n535.\nEndothelial lining of rat carotid artery before (top)\nand after (bottom) photochemical damage. Bottom\nimage shows formation of thrombosis.\nY. Kim et al., Acta Neurochirurgica 2004, 146, 45."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/7bbbb1b246bece7667266246f3791663_lecture8.pdf",
      "content": "3.051J/20.340J\nLecture 8:\nCell-Surface Interactions: Host Responses to Biomaterials (Part II)\nImplantation of a biomaterial initiates the inflammatory response:\n- response of vascularized tissue to local injury\n- severity indicates biocompatibility of material\nCooperative Signaling Cascades:\n1. Coagulation Cascade\ninitiated by adsorbed\n2. Complement Alternative Pathway\nproteins\nThe complement is a component of the immune system.\nImmune system function: to protect against pathogens\nInnate (Native) Immunity\nAdaptive (Aquired) Immunity\n- first line of defense\n- specificity to distinct foreign\nbiomolecules (antigens)\n- nonspecific response to\ninvading pathogens\n- memory of exposure\n- elicits adaptive response\nPhysical/chemical barriers:\nBlood proteins:\nepithelia, antimicrobial proteins\nantibodies (immunoglobulins),\ncytokines\nBlood proteins: complement;\ncytokines (regulatory)\nCells: lymphocytes (T cells, B cells)\nCells: phagocytes (macrophages,\nneutrophils), natural killer cells\n\n3.051J/20.340J\nComplement\n- system of >30 proteins that mediate immune response\n- discriminates \"foreign\" from \"self\" through adsorbed proteins/\nprotein fragments (C3b, C4b)\n- recruit and activate phagocytes (C3a, C5a)\n- lysis of pathogens via membrane pore formation (C5b, C6-C9)\n3 recognized pathways (to C5 convertase)\nClassical pathway:\nantigen-antibody immune complex (IC)\nbinds and activates C1 (autocatalytic proteolysis)\ninitiating an enzymatic cascade\nC1 → C1s\nC4 → C4b\nC2 → C2b\nC3 → C3b\nC5 → C5a/C5b\nsoluble fragment (16 kDa):\ninsoluble fragment (170 kDa):\nrecruits phagocytes by chemotaxis\ninitiates membrane attack complex\n(MAC) C5b-C6-C7-C8-C9\nMAC pore formation compromises\nbacterial cell membrane\n\n3.051J/20.340J\nLectin pathway (discovered in 1990's):\nmannan binding lectin (MBL)\nbacteria cell wall\nbinds carbohydrates on pathogen\n(gram negative)\nMBL-associated serine proteases (MASP-1, -2)\ncomplexes with MBL\nactivated MASP's cleave C4 → C4b\nremaining cascade follows classical pathway\nAlternative pathway:\nnonselective pathway of complement (any foreign surface)\nC3 → C3b occurs continuously in plasma at low frequency\nC3b adsorbs on foreign surfaces (biomaterial)\n\ncofactor B → C3b-Bb complex\n\namplifies C3 → C3b\n\nC3b-C3b-Bb complex\n\nC5\n\n→ C5a/C5b\nSoluble complement protein fragments C3a and C5a recruit phagocytes\nto site of injury\n\n3.051J/20.340J\nInflammatory Response to Implanted Biomaterials\nINJURY\nTIME\nSeconds/Minutes\nBlood-Materials Interactions\nHours\nProvisional Matrix Formation\nAcute Inflammation\nDays\nChronic Inflammation\nGranulation Tissue\nForeign Body Reaction\nWeeks\nFibrosis/Fibrous Capsule Formation\nCell\nfibroblasts\nmacrophages\nforeign body giant cells\nActivity\nneutrophils\nhrs\ndays\nweeks\ntime\n\n3.051J/20.340J\n- Endothelial cells\nenzymes\n(1.3 mg/ml) changes conformation\n⇒ cleaved\nC3\nlining capillaries near injured site release\nplasma protein C3\ninto fragments\nC3b fragment\nC3a fragment\nC3b attaches to biomtl or injurious agent\nC3a diffuses into medium ⇒ soluble\nsurface ⇒ insoluble ligand for leukocyte\nligand for leukocyte receptors\nreceptors\nIMMUNE CELL\nC3b catalyzes C5 cleavage to C5a ⇒\nRECRUITMENT\nsoluble ligand for leukocyte receptors\n\n3.051J/20.340J\nNeutrophils (PMN's, polymorphonuclear leukocytes)\nAssociated with acute inflammatory response (minutes→1-2 days)\n3⁄4 \"first responders\" 3-5M/ml (short-lived)\n3⁄4 bind C3a/C5a via complement receptors (CR's)\n3⁄4 become hyperadherent by ↑ CR3 (integrin CD11b/CD18) surface\nexpression - attach to vasculature via endothelial ICAMs\n3⁄4 chemotactic to C5a: migrate to inflammation site\nOn site, neutrophils bind to C3b, catalyzing release of cytotoxic species:\nH2O2, O2\n-- (superoxide radical), OH-, enzymes\n⇒ attack/engulf/degrade invading microbes\nReleased products from neutrophils, activated platelets and endothelial\ncells, along with fibrin, form the provisional matrix\n- scaffold for cell attachment\n- sustained release of signaling\nmolecules\n\n3.051J/20.340J\nMonocytes (0.2-0.6M/ml)\n3⁄4 bind C3a/C5a ⇒ follow the course of neutrophils\n3⁄4 Evolve to macrophages\n3⁄4 Associated with chronic inflammation\ndays→ weeks/months (or even a lifetime)\nOn site, macrophages bind C3b, secrete reactive species, enzymes, cytokines\n(immune cell regulators, ex. IL-1), fibronectin, growth factors (ex. fibroblast\ngrowth factor, epidermal growth factor), coagulation factors\nMacrophage response depends on foreign material properties...\n3⁄4 fluids or small particles (micron-sized)\n→ engulfed & degraded\n\"phagocytosis\"\nwith adsorbed ligands\nfusion of phagocytic\nforeign material\nvesicles and lysosomes\nDegraded biomolecule products:\nlysosome\namino acids, sugars, lipids\nNondegradable products accumulate\n\n3.051J/20.340J\n3⁄4 Numerous particulate debris or materials with high roughness\n→ fusion of macrophages into multinuclear\nforeign body giant cells (FBGCs)\n3⁄4 smooth, inert implants\nFBGCs absent (nothing to engulf)\n→ macrophage layer surrounds implant\nMacrophage/FBGC products (FN, FGF) recruit fibroblasts\nFibroblasts (connective tissue cells)\n3⁄4 deposit collagen\n→ pink \"granulation tissue\" (appears in 3-5 days)\n3⁄4 accompanied by capillary sprouting (angiogenesis)\nWound healing histology: foreign body reaction\npresence of FBGCs/macrophages, granulation tissue, capillaries at\ntissue/material interface\n3⁄4 Connective tissue remodeling ⇒ thin, encapsulating fibrous\nlayer (fibrosis) isolates implant and foreign body rxn (weeks)\n\n3.051J/20.340J\n\nFormation of scar tissue vs. parenchymal tissue (tissue of specialized\nfunction) depends on:\n\n3⁄4 extent of parenchymal tissue damage (esp. tissue framework)\n3⁄4 parenchymal cell proliferation capacity\n\nCell Regeneration Capability\n\nCategory\nNormal\nreplic. rate\nResponse to\ninjury\nExamples\nrenewing/\nlabile\nHigh;\nvia stem cell\ndifferentiation\nmodest ↑\n\nskin, intenstinal mucosa,\nbone marrow\nExpanding/\nstable\nLow\nlarge ↑\nendothelium, fibroblasts,\nhepatocytes, osteoblasts\nStatic/\npermanent\nNone\nNo\nreplication\nheart muscle cells, nerve\ncells\n\nFBGC formed at implant site. Arrows point\nto nuclei. (J.S. Belkas et al., Biomaterials 26\n(2005) 1741.)\nFibrous capsule formation around porous\nP(HEMA-co-MMA) nerve conduit (J.S.\nBelkas et al., Biomaterials 26 (2005) 1741.)\nPhotos removed for copyright reasons.\n\n3.051J/20.340J\nImplant biocompatibility is assessed largely by intensity & duration\nof the inflammatory response.\nMaterials\nInflammatory response\nClass\nMetals\nvery severe in absence of passive oxides\nOxides\nminimal\nProcessed natural\nsevere\npolymers\nsynthetic polymers\nmild, unless particulate morphology;\nadditives can give response\nBiomaterial Biocompatibility Concerns\n1. Chronic inflammation\n- prolonged local chemical or physical irritation--delayed healing\n- often due to moving parts, debris, roughness\n- proliferation of connective tissue, or tissue necrosis\n(2 extremes of macrophage response)\nex. PE cup liners in hip replacement implants\n\n3.051J/20.340J\n2. Bacterial Infection\n- Bacteria compete with cells to adhere to surface\n3⁄4 similar mechanisms; better adapted to nonviable surfaces\n3⁄4 resistant to antibiotics (different surface expression)\n- Most common bacterial infections:\n3⁄4 metallic biomaterials: S. aureus\n3⁄4 have receptors for fibronectin & collagen\n3⁄4\n)\npolymeric biomaterials: S. epidermidis (on skin\nex. artificial hearts, synthetic vessels, joint replacement implants, fixation\ndevices, IV catheters, urologic devices, contact lenses\n~60,000 U.S. deaths/yr from device-related infections\nurinary catheters, central venous catheters\n3. Blood Incompatibility\n- blood-materials interactions lead to clot or thrombus\n3⁄4 may compromise device by occlusion\nex. small (< 5 mm dia.) vascular grafts, stents, IV catheters\nDiagrams of stent\n3⁄4 may detach (embolize) & create vessel occlusion downstream\nand heart valve removed\nfor copyright reasons.\nex. emboli to brain from mechanical heart valves ⇒ stroke\n3⁄4 susceptible devices require use of anti-coagulation drugs\n(heparin) ⇒ bleeding risk\n\n3.051J/20.340J\n- complement activation by extracorpeal therapies\n3⁄4 C3b adsorption to material ⇒ C5a activation of neutrophils\n& monocytes (WBCs) to hyperadherent state\n3⁄4 WBCs stick in lungs ⇒ neutropenia, respiratory distress,\nhypoxemia (O2 deficiency--similar symptoms to altitude\nsickness), tachycardia, cardiac arrest\nex. hemodialysis membranes, cardiopulmonary bypass (CPB)\ndevices\n4. Toxicity\n- classical toxicity: from corrosion, degradation or wear products;\ncytotoxicity increases with amount present\n- immune system toxicity:\ni) immunogenic substances: proteins, carbohydrates,\nlipids (weakly)\nex. processed collagen, natural latex\nii) small molecules (metals, degradation products, drugs) bind on\nhost proteins/cells, making an innocuous substance antigenic\nex. hypersensitivity to metals, acrylics\n\n3.051J/20.340J\n5. Tumorigenesis\n- rarely observed\n- morphology dependent vs. chemistry dependent\n(ex. asbestos - needle-like particulates, aspect ratio>100:1)\n- requires fibrous encapsulation (not seen at chronic inflammation\nsites)\n- implant role unclear--foreign body reaction may stimulate\nmaturation & proliferation of precancerous cells\n- chemical carcinogens: little supportive data\n3⁄4 metal implant debris (Cr, Co, Ni) ⇒ carcinogenic in rodents\n3⁄4 polymer impurities/additives: monomers, solvents,\nplasticizers, antioxidants\nReferences:\nM.A. Horton, Ed., Molecular Biology of Cell Adhesion Molecules, John Wiley &\nSons: NY, 1996.\nD.A. Hammer and M. Tirrell, \"Biological Adhesion at Interfaces\", Annu. Rev.\nMater. Sci. 1996, 26: 651-691.\nK.M. Yamada, \"Cell Adhesion Molecules\", in Encyclopedia of Molecular Biology,\nT.E. Creighton, Ed., John Wiley & Sons: NY, 1999, pp. 361-366.\nJ.M. Anderson, \"Biological Responses to Materials\", Annu. Rev. Mater. Res. 2001,\n31: 81-110."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture9_2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-051j-materials-for-biomedical-applications-spring-2006/9dc719a035fcc0b1d8c43fc23b7162c0_lecture9_2.pdf",
      "content": "Lecture 9:\nSurface Modification of Biomaterials\nSupporting notes\n3.051J/20.340J Materials for Biomedical Applications,\nSpring 2006\n\nPurpose:\nAlter surface properties to enhance performance in\nbiological environment while retaining bulk properties\nof device\nThe modified zone at the surface of the device should be\nas thin as possible. Ideally < 1 nm\n\nSpecific objectives:\n1. Clean a surface\n2. Reduce/eliminate protein adsorption\n3. Reduce/eliminate cell adhesion\n4. Reduce bacterial adhesion\n5. Reduce thrombogenicity\n6. Promote cell attachment/adhesion\n7. Alter transport properties\n8. Increase lubricity\n9. Increase hardness\n10. Enhance corrosion/degradation resistance\n\nPreparation of non-fouling surfaces\nto prevent non-specific protein/cell or bacterial adhesion\nto reduce thrombogenicity\nSurfaces should be hydrophilic or very hydrophobic.\nFigure by MIT OCW.\n\nExample of \"gold standard\"\nSurface modification with PEO derivative.\nPEO-PPO-PEO, Pluronic\nChemical immobilization\nPhysical adsorption\nShort-time use\nLong-time use\nEx. Drug delivery\n\nPhysical adsorption\n-\n-\n-\n-\nOther strategies for hydrophilic surfaces 1\nAlbumin coating surface\nPhospholipid-mimicking surface\nN+\nN+\nN+\nN+\nAlbumin\nHydrophobic chain\nO\nO\nO\nO\nO\nP\nO O\nP\nO O\nP\nO\nO\nP\nO\nO\nO\nO\nO\nO\nO\nO\nO\nSerum albumin:\nO\nO\nO\nO\nHydrophilic phosphocholine head\nHigh water solubility and stability\nNo affinity to proteins and platelets\nHydrophobic acylchain\n\n-\n-\nOther strategies for hydrophilic surfaces 2\nHeparinized surface\nEndothelial cell attachment\n-\nOR\nO\n-\nCOO\nOSO3\nO\nOH\nO\nO\nOH\nOH\nO\nOH\nO\nOH\nOSO3\n-\nO\nCOO\nO\nO\nOH\nNHSO3-\nOSO3\nNHSO3\nO\n-\nHeparin:\nNHR\nNatural blood vessel lining:\nImmobilized covalently and ionically\nFibrinolytic activity (hydrolysis of fibrin)\nInhibitor for thrombin or platelet adhesion\nPlasma treatment\nWill be discussed soon\nWater soluble polymer\nOH\nCOOH\n\n500 μm\nNR6 WT fibroblast adhesion triggered by RGD recognition\nPhotos removed for copyright reasons.\nO\nN\nO\nOH Peptide coupling\nO\nN\nO\nO\nRGD\nPCL-g-PEO+RGD\nO\nO\nPCL-g-PEO\nHN\nH\nN\nO\nN\nHN\nO\nNH2\nOH\nNR6 WT:\nOH\nmice fibroblast bearing human integrin\nH2N\nO\nH\nO\nArginine Glycine Aspartate\nTaniguchi, Polym Int. submitted\nR\nG\nD\n\nBiomolecule immobilization method for specific surfaces\nvan der Waals\nElectrostatic\nPhysical adsorption\nAffinity\nAdsorbed and cross-linked\nBarrier system\nPhysical \"entrapment\"\nHydrogel\nDispersed system\nSoluble polymer conjugate\nCovalent attachment\nSolid surface\nHydrogel\nBiomolecules: proteins/peptides, saccharides, lipids, drugs,\nligands, nucleic acids/nucleotides, (cells,) etc.\n\nChemical modification of materials\nref. Ratner, Biomaterials Science, p. 229\nFor covalent binding to an inert solid polymer surface, the\nsurface must first be chemically modified to provide\nreactive groups for the subsequent immobilization step.\n-OH\n-SH\n-NH2\n-CH=CH2\n-COOH\netc.\n\nProtein/peptide immobilization strategies 1\nMajor reacting groups: -NH2\nActivation of -OH\nO\nO\nO\nCl C O\nNO2\nR\nNH2\nOH\nO\nC\nO\nNO2\nO\nC\nNH R\nO\nCl\nSO2CH2CF3\nR\nNH2\nO\nS\nCH2CF3\nNH R\nOH\nO\nCl\nN\nCl\nNH R\nCl\nN\nN\nN\nN\nR\nNH2\nO\nN\nOH\nR\nO\nN\nN\nN\nR\nR\nAll the procedures must be carried out under anhydrous condition\n\nProtein/peptide immobilization strategies 2\nMajor reacting groups: -NH2\nActivation of -NH2\nN\nO\nO\nN\nO\nO\nO\nO\nO\nO\nO\nO\nR\nNH2\nNH2\nN\nO\nN\nH\nN\nN\nR\nH\nH\nO\nActivation of -COOH\nO\nO\nHO N\nO\nO\nR\nNH2\nH\nCOOH\nO\nC\nO\nN\nC\nN\nR\nO\nO\nO\nR\nNH2\nSOCl2\nH\nCOOH\nC\nCl\nC\nN\nR\nBe careful!\n\nProtein/peptide immobilization strategies 3\nMajor reacting groups: -COOH\nActivation of -NH2\nH\nR1\nN\nC\nN\nR2\nO\nN+\nR1\nR\nCOOH\n\nR\nC\nO\nC\nPortein/peptide\ncarbodiimide\nHN\nR2\nH\nO\nN+ R1\nR\nC\nO\nC\nO\nHN\nR1\nHN\nR2\nH\nN\nC\nR\n+\nO\nC\nHN\nR2\nNH2\n\nProtein/peptide immobilization strategies 4\nChemoselective ligation\nBr\nR\nSH\nS\nR\nHS\nR\nO\nC\nO\nC\nS\nR\nO\nO\nO\nO\nS\nR\nHS\nR\nN\nN\nO\nO\nR\nR\nH2N\nO\nR\nC\nN\nO\nR\nC\nO\nReactions take place between selected pairs of functional groups\n\nOther chemical surface modifications\nPreparation of hydrophobic and inert surfaces\nFluorination\nCF2\nCF2\nO\nCF2\nO\nCF2\nO\nO\nCF3\nO\nO\nOH\nCF3\nCF3\nO\nOH\nCl\nCF2\nCF3\nO\nCF3\nOH\nOH\nO\nSilanization\nOH\nO\nO\nSi\nO\nSi\n\nO\nO\nO\nSi\nO\nSi\n\nOH\nO\nOH O\nOH O\nOH\nOH\nO\nSi\nOH\nOH O\nO\nSi\nOH\nOH\nOH\n\nSummary:\n· Clean a surface\n· Reduce/eliminate protein/cell/bacteria adsorption,\nreduce thrombogenicity\nNon-fouling and bioinert surfaces\n· Promote biological response\nImmobilization of biomolecules\nShort time - Physical adsorption\nLong time - Covalent bonding"
    }
  ]
}