{
  "course_name": "Mathematical Exposition",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Literature",
    "Academic Writing",
    "Mathematics",
    "Social Science",
    "Communication",
    "Humanities",
    "Literature",
    "Academic Writing",
    "Mathematics",
    "Social Science",
    "Communication"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nCourse Description\n\nIn this course, participants will gain experience in presenting and writing mathematics. In particular, the lectures will be given by the students! For each lecture, the student lecturing will provide written notes to be handed out to the class, and there will also be several writing assignments throughout the semester. Mathematically, the class is an introduction to chaotic dynamical systems theory, covering topics such as iterated function systems, the transition to chaos, symbolic dynamics, fractals and Sarkovskii's Theorem.\n\nTextbook\n\nDevaney, Robert L.\nA First Course in Chaotic Dynamical Systems\n. New York, NY: Addison-Wesley Publishing Company, The Advanced Book Program, 1995. ISBN: 0201554062.\n\nPre-Lecture Meetings\n\nBefore delivering each lecture, students will meet with the instructor and present part of their lecture, along with a \"time plan\" outlining where in their lecture they plan to be after each 10 minute interval, and what material they will exclude or include if time adjustments are necessary. Students will receive detailed feedback on their lecturing style and on their lecture notes.\n\nHomework\n\nHomework assignments will be handed out each Wednesday, and will be due the following Wednesday. No late homework will be accepted.\n\nSolutions to many homework exercises are available. Students are not permitted to consult these solutions before handing in homework. Working together on homework assignments is permitted, but should be acknowledged at the top of the homework, and each student must write up their homework assignments by themselves.\n\nExams\n\nThere are no exams in this class.\n\nComputer Labs and Writing\n\nChaotic dynamical systems will be explored through three computer experiments. Students are strongly encouraged to work together on these experiments. In each computer lab, students will be asked to write an essay describing their findings; feedback will be provided on these essays before they are rewritten into final form.\n\nThere will also be a more substantial essay project on Sarkovskii's Theorem, divided into several parts. Students will receive feedback on their writing and will be asked to rework the assignments on Sarkovskii's Theorem into sections of a single paper. Of course, this paper will require an introduction and in any paper the introduction is the section where good writing matters most, so we will also give students feedback on drafts of their introduction.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nLab Reports/Essays\n\n35%\n\nPaper on Sarkovskii's Theorem\n\n25%\n\nOral Presentations and Lecture Notes\n\n25%\n\nHomework\n\n15%",
  "files": [
    {
      "category": "Resource",
      "title": "reports.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/e6f3ee9e564fb37ec6d80198bdf74862_reports.pdf",
      "content": "Lab Reports\n\nLab reports should contain\n\n-\nProcedure and Results. Give a brief description of the experiment, and present a\nsummary of the data you have collected. This could take the form of tables of orbits, or of\ngraphs of the functions studied. Please keep these results reasonably brief and free of\nextraneous information; for example if you are asked about the fate of an orbit under\niteration then you need only describe its eventual behaviour, not the entire orbit.\n-\nAnalysis. Write an essay analysing your data, and addressing the questions raised in the\ndescription of each lab. Be careful to distinguish between conjectures that your data\nprompts you to make, and theorems that you are able to rigorously prove. In both cases\nyou should describe how the data motivated your statement, but anything that you state as\nfact is a theorem and requires careful proof.\nIn many cases, you will not be able to give conclusive answers to all questions raised, but you\nshould provide a description of what you think is happening, and why."
    },
    {
      "category": "Resource",
      "title": "lab1_hurwitz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/d419ad5259a6a9e31f754d539cc18d17_lab1_hurwitz.pdf",
      "content": "Lab 1\nJeremy Hurwitz\nFebruary 14, 2005\nIntroduction\nThe goal of this experiment was to discover the behavior of various functions under iteration\nunder different seeds using Mathematica. The first function studied was the \"doubling function,\"\nwhich was defined as F(x) = 2x (mod 2). The rest of the functions were the family of functions\nF(x) = x2 - c, where c is any positive constant.\nIn each case, I attempted to classify the orbits as fixed, periodic, tending towards a certain\nlimit or chaotic. To this end, I ran twenty iterations of each function suing Mathematica to see if\na pattern seemed to be appearing. If unsure, I ran more iterations.\nThe Doubling Function\nFor testing the doubling function, I divided possible seeds into three groups. The first group was\nrational numbers, written in the form p/q, p, qZ+. The second was rational numbers written as a\ndecimal expansion. The last group was irrational numbers, such as the square root of 2.\n2.1\nRational Numbers p/q\nIn the case of rational numbers written in fractional form, one of three results always showed up.\nZero returned the fixed point orbit F(x) = 0. If q = xn, for some n, the orbit became eventually\nfixed at 0. All other orbits were periodic or eventually periodic.\n2.2\nDecimal Expansions of Rational Numbers\nDecimal inputs returned incorrect results due to rounding errors. Because the computer stores\nthese numbers in the form\na1\na2\na3\nan\n+\n+\n+ . . . +\n(1)\n2n\nafter k iterations, the kth term becomes equivalent to 0 (mod 1). Therefore, the computer falsely\nstated that all decimal inputs became eventually fixed at 0. For example, x0 = 2/5 returned a\nperiodic orbit, whereas x0 = 0.2 became fixed.\n2.3\nIrrational Numbers\nIrrational numbers appeared to be chaotic, at least until the rounding errors compounded enough to\nsend the orbit to zero. When I calculated the orbit without rounding, the orbits remained chaotic.\n\nF(x) = x2 -c, c > 0\nI started by testing c = 2. Once I had a feel for how the orbit behaved for different seeds, I started\nvarying c, attempting to find a pattern that flowed between all values of c. As with the doubling\nfunction, I looked for orbits that tended towards periodicity or towards a specific orbit.\n3.1\nConditions For Divergence\nThe first obvious characteristic of the entire family of functions was that if the seed was outside\nsome specific interval, then it would tend towards infinity. For c=2, the interval of convergence was\n[2,2]. For c=1, the range was [1+\n√\n5 , 1-\n√\n5].\nTheorem 1. Let F(x) = x2 -c, c > 0. Let p = 1+√4c+1 and q = 1-√4c+1 . Then if\ni x0 > p, F(x0) diverges under iteration.\nii x0 < q -1, F(x0) diverges under iteration.\nProof (i). Since x0 > p, ∃ε > 0, ε = x0 -p.\nF(x0) = F(p + ε) = (p + ε)2 -c = p 2 + 2pε + ε -c\nHowever, since p2 -c = p, this simplifies to\nF(x0) = p + 2pε + ε > p + ε = x0\nTherefor, F(x0) is monotonically increasing under iteration. Furthermore, since F(x0) -x0 > ε\nand ε gets bigger with every iteration, F(x) is not bounded. Therefore, F(x0) diverges.\n(ii). Since x0 < q -1andq < 0, ∃ε > 1, ε = q -x0.\nF(x0) = F(q -ε) = (q -ε)2 -c = q -2qε + ε -c\nSince q = p -√4c + 1 and q -c = q,\nF(x0) = q -2qε + ε = p -\n√\n4c + 1 -2qε + ε = p + (ε -1)(\n√\n4c + 1 + ε)\nSince ε > 1, F(x0) > p, so by (i), F(x0) diverges.\nIf c > 2, then all orbits tended towards infinity, unless they were exactly periodic. Because of\nthis, all remaining discussion will be limited to c < 2 and values of x0 such that F(x) 6→inf\n3.2\nBehavior Under Various Values of c\nIn general, there always existed kcycles which could be found by solving F k(x) = x. For values\nnot lying on one of these cycles, there were three cases.\nWhen 0 < c < 1, the orbit tended to converge to the fixed point p = 1-√4c+1 , an attracting\nfixed point. Note that the other fixed point is repelling, so any point within the convergent interval\nhas to go towards this attracting point.\nWhen c = 1, all orbits tend towards the 2cycle (0,1,0,1,...). As long as x0| < 1.68, the computer\n|\ncould not tell the difference.\nThe last case was 1 < c < 2. Within this interval, all orbits appeared to become chaotic.\n\nTable 1: Orbits of F(x) = x - c, x0 not on a kcycle\nRange\nBehavior\n0 < c < 1\ntowards a fixed point\ntowards a cycle\n1 < c < 2\nChaotic\nc > 2\ntowards infinity\nSummary\nThe most important result of this experiment was the rounding issue that arose when a decimal\nwas used as the seed of the doubling function. Unless very careful analysis is used as to how the\ncomputer is treating the number and how errors are propagated through the iterations, computer\nresults must be taken with a large grain of salt.\n¿From a standpoint of generating and studying chaos, the main result was how easily very sim\nple, predictable systems became chaotic. The doubling function, which was completely predictable\nfor all rational numbers, showed no patterns for irrational numbers. For the family of functions\nF(x) = x2 - c, orbits were predictable (excluding individual kcycles) for all values of c outside the\nrange (1,2]. Within that range, unless the orbit was periodic, it was always chaotic.\n\nTable 2: Doubling Function F(x) = 2x (mod 2)\nInput\nCorrect Orbit\nComputer's Output\n0.2\nperiodic\ngoes to zero\n1/5\nperiodic\nperiodic\n1/9\nperiodic\nperiodic\n0.23\nperiodic\ngoes to zero\n5/17\nperiodic\nperiodic\nfixed point\nfixed point\n1/2\neventually fixed\neventually fixed\n1/10\neventually periodic\neventually periodic\n1/4\neventually fixed\neventually fixed\nx ∈ R - Q (10 trials)\nno pattern\nno pattern\nTable 3: x - 2\nInput\nEventual Behavior\nFixed\nEventually Fixed\nEventually Fixed\nFixed\nEventually Fixed\n1/2\nChaotic\n√\neventually fixed\n√\neventually fixed\n8 other tests\nchaotic\nData\n\nTable 4: x - 3\nInput\nEventual Behavior\n√\nPeriodic\n√\nto infinity\nto infinity\nperiodic\n1+\n√\nfixed\nperiodic\nTable 5: Summary of Data for Other Values of c\nc\nbehavior\n2 fixed points, all other tests to infinity\n1.5\nchaotic or towards infinity\ntowards 2cycle or towards infinity\n.5\ntowards .366025 or towards infinity"
    },
    {
      "category": "Resource",
      "title": "lab1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/dec227b936cb6553d714cb046be72b96_lab1.pdf",
      "content": "Lab #1\n-\nDo experiment 3.6 \" The Computer May Lie\" on page 25 of your textbook, preferably\nusing the Mathematica notebook with the same title. (Alternatively, you may Use the\nFunction Iterator available at the Dynamical Systems and Technology Project web site).\nChoose \"generic\" seeds, such as 0.836, not whole numbers. Write an essay describing\nyour findings, answering the questions posed in the Results section, and questions 1 and\n2 on page 26. Please do not list or print out the entire orbit for each of your chosen\nseeds. Rather, simply give the seed and a short description of the outcome (tends to a\nfixed point, goes to infinity, etc.) In each case, the computer is not telling the whole story.\nDo you see what else is happening? Comment on this in your essay after explaining what\nthe computer shows.\n\nPlease be sure to review the Lab Report Expectations.\n\n-\nThe Dynamical Systems and Technology Project web site is the work of Professor Bob\nDevaney at Boston University, and the Mathematica notebooks were written by\nSebastian Marotta."
    },
    {
      "category": "Resource",
      "title": "lab1r.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/a4b31d8b8273cf9d3c550065b1bf7810_lab1r.pdf",
      "content": "18.091 Lab 1\nWes McKinney 30 March 2005\nExperiment\nThe objective of this experiment is to observe the behavior of the iterates of a few different\nfunctions on the computer platform. We utilize Mathematica to generate and graph the orbits of\nthese functions with various seeds. A secondary goal along with these observations is to identify\nthe limitations of computer precision over the course of a large number of calculations.\nFor each function we calculate 100 iterates for each seed and determine whether there is a\npattern. The first function is f(x) = x2 - 2, the quadratic map with c = -2. With seeds chosen\nfrom (-2, 2), the important characteristic is that f(x) ∈ (-2, 2) if x ∈ (-2, 2). As can be seen\nbelow in the data table, generic values chosen within that interval exhibit chaotic behavior on\niteration. The fixed points of the function are those x such that x -2 = x or x = 2, -1, so these\ndo not exhibit chaotic behavior. One can also calculate analytically the ncycles of f, for example,\nthe two nonfixed 2cycles of f are those solutions to (x2 -2)2 -2 = x, namely x = 2(-1 ±\n√\n5).\nThis is not necessary for the present purposes.\nWhen c < -2 for the quadratic map, different behavior is observed, since the function values\nare no longer restricted to (-2, 2) like x2 -2. All of the chosen points tend to infinity. Graphically,\nwhen points exit the [-2, 2] × [-2, 2] window, the orbits spiral out to infinity. This increase can be\nobserved simply, since if x > c > 2, then x2 -c > x , and so forth.\n| |\n| |\n| |\nThe doubling function f(x) ≡ 2x\n(mod 1) has perhaps the most interesting behavior. Ra\ntional seeds behave as predicted via Mathematica's exact rational arithmetic, though, somewhat\ncuriously, decimal seeds die off (as in, drop suddenly to 0) after about 50 iterations. This actually\nhas a very simple explanation, having to do with the way in which decimal numbers are approxi\nmated in binary representation. First, we analyze the iterates of any number of the following form\nunder the doubling function:\nb1\nb2\nb3\nbk\n+\n+ 2k ,\n2 + 22\n23 + · · ·\nwhere each bi ∈ {0, 1}. This is equivalent to the binary number 0.b1b2b3 . . . bk. Each application\nof the doubling function shifts the digits by one place, then taking the resulting number modulo 1\ntruncates the leading bi. The result is that after k iterations of the doubling function, the last digit\nbk is truncated, leaving zero. The conclusion drawn from that is that the binary representation of\ndecimal numbers is finite, and after a particular number of applications of the doubling function\n(which by our calculations is about 50), the value \"suddenly\" drops to 0. Observe this in a graph\nbelow.\nThis experiment offers a first glimpse at the behavior of the quadratic map and also provides\na method to test the arithmetic precision of a computer algebra system. While in the c = -2 case\nfor the quadratic map, chaotic, though restricted behavior occurred, changing c by very little\nresulted in orbits tending to infinity. The doubling map iterated numbers in the particular way\nthat exposed the way in which decimal numbers are approximated in memory.\n\nData and Graphs\nf(x) = x - 2\nInitial Seed x0\nBehavior\n0.1\nchaotic\n0.35\nchaotic\n1.2\nchaotic\n0.5\nchaotic\n0.7\nchaotic\n0.99\nchaotic\n1.1\nchaotic\n1.5\nchaotic\n0.057\nchaotic\n0.6\nchaotic\n1.9\nchaotic\n2.1\noverflow\nf(x) = x2 - 4\nInitial Seed x0\nBehavior\n1.01\noverflow\n0.5\noverflow\noverflow\n1.5\noverflow\n0.3\noverflow\n1.7\noverflow\n1.4\noverflow\n1.9\noverflow\n0.015\noverflow\n0.2\noverflow\nf(x) ≡ 2x\n(mod 1)\nInitial Seed x0\nBehavior\n1/5\nregular and periodic\n0.2\ndrops to 0 after 45 iterations\n0.7\ndrops to 0\n1/9\nregular and periodic\n.111111\ndrops to 0\n1/21\nperiodic\n1/11\nperiodic\n0.07\ndrops to 0\n0.001\ndrops to 0 after 51 iterations\n1/17\nperiodic\n\nn\n0.2\n0.4\n0.6\n0.8\nxn\nSeries of the doubling function, x0= 0.111111"
    },
    {
      "category": "Resource",
      "title": "lab1rw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/b46496ea92ac23c8894721bc83afd68d_lab1rw.pdf",
      "content": "18.091 Lab 1\nThe Computer May Lie\nAlejandro Ochoa\nMay 19, 2005\nIntroduction\nIn this experiment we investigated the orbits of several seeds under iteration\nof three functions. We will discuss how our data compares to what we expect\nfrom theory, which will lead to the discussion of computation as performed by\na computer. The functions chosen are\n1. F[x] = x2 - 2 on the interval (-2, 2),\n2. F[x] = x2 - 2.1 on the interval (-2, 2),\n3. D[x] = Frac[2 ∗ x], the doubling function on the inverval [0, 1).\nMethods\nSome of the seeds were chosen by me, while others were randomly generated\nby Mathematica using a function. Note that Mathematica is software capable\nof doing rational arithmetics, which implies the format in which we type the\nnumber matters. For example, typing 0.1 for a seed will make Mathematica\ndo all the computations with 1/10 as a floating point number, with limited\nprecision, while typing 1/10 will force Mathematica to make exact calculations\nwith that rational number.\nData and Observations\nFor each function, on the table we listed in the first column the seeds used, and\nin the second column the observed behaviour of the orbits of the corresponding\nseed. Seeds with five or six significant digits were generated by Mathematica.\nDouble quotation marks indicate the behaviour is the same as described above.\nPlots of sample orbits are also included for the first and third functions to better\nillustrate the behavior of such orbits.\n\nFigure 1: The orbit of a seed under 100 iterations of F[x] = x - 2\n1. F[x] = x2 - 2,\nSeed\nBehavior\n-1\nFixed point.\n0.1\nApparently chaotic, bounded in [-2, 2].\n0.13\n\"\n-0.0468936\n\"\n-0.510909\n\"\n-0.66461\n\"\n0.706763\n\"\n0.12377\n\"\n-0.626387\n\"\n-0.374533\n\"\n0.499365\n\"\n2. F[x] = x2 - 2.1,\nSeed\nBehavior\n-1\nDiverges to inf\n\"\n\"\n0.25\n\"\n1.985\n\"\n-0.185049\n-0.283494\n-0.643112\n-0.987201\n0.252688\n\"\n\"\n\"\n\"\n\"\n\nFigure 2: The orbit of the seed x0 = 0.1 under 100 iterations of D\n3. D[x] = 2 ∗ x - Floor[2 ∗ x],\nSeed\nBehavior\n0.1\nEventually fixed, converges to 0\n0.0628138\n\"\n0.860487\n\"\n0.53821\n\"\n0.762382\n\"\n0.495847\n\"\n0.392426\n\"\n0.142857\n\"\n0.33\n\"\n1/7\nPeriodic\n33/100\nEventually periodic\nDiscussion\nFor the function F[x] = x2 - 2 the experiment with the computer suggests that\nall orbits are chaotic (see Figure 1), except we happened to select the point\nx0 = -1 which is fixed under iteration by F. However, we can algebraically\nverify that the equation F[x] = x has another solution, namely x = 2, so there\nare two fixed points for this function that the computer would not have found\nfor us, for example, if it only sampled random numbers. We did not identify\nany periodic points either, while we know there are infinitely many from theory.\nFor the second function F[x] = x2 - 2.1 the computer strongly suggests\nthat all seeds in (-2, 2) diverge to infinity, but this is not the case because the\n\nequation F[x] = x, or x -x -2.1 = 0, has two solutions, namely\nx0 = 1 ±\n√\n9.4 ,\nand one of them, x0 ' -1.0330 is in the interval we sampled. Hence, among\nall of the points that diverge to infinity, there is one that remains fixed and was\nnot detected with the computer.\nThe function D is by far the most interesting case. Consider x0 = 0.1, which\nwe know has an exact representation as a rational number, namely x0 = 1/10.\nThe point 1/10 is eventually periodic, entering the 4cycle\n1 2 4 3 1 ...\n5, 5, 5, 5, 5,\nafter the first iteration. However, the computer shows that x0 = 0.1 is eventually\nfixed, converging to zero. Looking at Figure 2, we can observe that 0.1s orbit\nstarts with a seemingly regular orbit as we expect it because it enters a 4\ncycle. However, something happens around the 50th iteration, the orbit becomes\nirregular and then drops to zero where it remains fixed.\nIt is plausible that the difference in the outcomes of the orbits of 0.1 and 1/10\nis due to the fact that the result of a computation on a floatingpoint number\n(the logical representation of decimals on a computer) is bound to lose precision\nbecause floatingpoint numbers only store a finite amount of digits, while the\nsoftware that deals with rational arithmetics only needs to store integers and\nhas an unlimited capacity to do so, always giving an exact answer. Although\nthe loss of precision is very small, after 50 iterations of the function on 0.1 we\ncan observe the loss of precision built up to give a wrong answer which is not\nreasonably close to the right answer.\nFor the first two examples, we were led to an incorrect hypothesis because\nwe only sampled a finite amount of points. There are a dense and uncountable\namount of points which share the behaviour of the points we sampled in those\nintervals. However, there are two and one points of interest respectively for each\nF on the given interval, which display the very appealing property of remaining\nfixed under iterations of F, and the probability that the computer would ran\ndomly choose these points is close to zero. The third example showed us that\nthe loss of precision generated by storing numbers as floatingpoint numbers can\nbecome significant when analyzing orbits of seeds of chaotic systems.\nWhenever we use computers to model dynamical systems, we must always\nkeep in mind the two caveats we discovered, namely, that we should not gener\nalize the behavior of an interval of seeds by analyzing just a few seeds, and that\nwe should be careful when considering results from a large amount of computa\ntions on floatingpoint numbers, given that these results are not guaranteed to\nbe neither correct nor approximately correct."
    },
    {
      "category": "Resource",
      "title": "lab2_hurwitz.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/e54d9c6c7a4aa117b946b14507c7cebc_lab2_hurwitz.pdf",
      "content": "Lab 2: Rates of Convergence\nJeremy Hurwitz\nFebruary 21, 2005\nIntroduction\nThe goal of this lab was to study how the magnitude of the derivative of a function at a fixed point,\n|F 0(p) , affected the rate at which the function converged to a fixed point under iteration.\n|\nTo study this characteristic, I tested twelve functions, all of which were known to converge, using\na computerized function interater (http://math.bu.edu/DYSYS/applets/Iteration.html). For each,\nI determined where the fixed point was, what the derivative was at the fixed point, and if necessary,\nthe second derivative at the fixed point. Lastly, I recorded how many iterations were necessary to\n\"reach\" the fixed point starting at x0 = 0.2. \"Reaching\" the fixed point was defined to be coming\nwithin .001 of the actual fixed point, since the function never actually reaches the fixed point.\nAnalysis\nSince all the functions that I tested were attracting, then by the proof of the Repelling Fixed Point\nTheorem, F 0(p) ≤ 1. I can therefore divide our test cases into two groups, those with derivative\n|\n|\nless than one, and those with derivative equal to one.\n2.1\nAttracting Fixed Points: F 0(p)| < 1\n|\nIn this group, I have seven functions. These functions, and the calculations for each are listed in\nTable 2.\nThe unifying feature of these functions is that the function always goes to the fixed point very\nquickly. In every case, the function was within the desired interval in under 10 iterations.\n2.2\nNeutral, Weakly Attracting Fixed Points: F 00(p)| = 1\n|\nThe remaining five functions that I tested all possessed weakly attractive fixed points. The numer\nical calculations are listed in Table 3.\nc\n|F 0(p)|\nIterations\n2.9\n.90\n2.99\n.99\n2.999\n.999\nTable 1: Effect of varying c for F (x) = cx(1 - x)\n\nWith these functions, the orbit converged very slowly. In general, these functions required\na number of iterations that was several orders of magnitude above the number needed for the\nattractive fixed points.\nFor the group of functions cx(1 - x), I carried out further analysis. To see how the behavior of\nF changes as F 0(p) → 1, I analyzed the family cx(1 - x) with c → 3. As c → 3, F 0(p)\n1 and\n|\n|\n|\n| →\nthe number of iterations necessary to get within .001 of the fixed point grows rapidly (Table 1).\nDue to the number of properties that are changed whenever you vary the parameter of these\nfunctions, I was not able to discern a pattern relating rate of convergence to higherorder derivatives.\n\nTable 2: Attracting Fixed Points: F 0(p)| < 1\n|\nF (x)\nFixed Point (p)\n|F 0(p)|\nIterations\nx2\n0.4x(1 - x)\n0.4\n1.6x(1 - x)\n0.375\n0.4\n2x(1 - x)\n.5\n2.4x(1 - x)\n.583\n.4\n.4 sin x\n.4\nTable 3: Weakly Attracting Fixed Points: |F 0(p) = 1\n|\nF (x)\nFixed Point (p)\n|F 0(p)|\n|F 00(p)|\nIterations\nx2 + .25\n.5\nx2 - .75\n.5\n>10000\nx(1 - x)\n3x(1 - x)\n2/3\n>10000\nsin x\n>10000\nData"
    },
    {
      "category": "Resource",
      "title": "lab2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/26cf596b013392996f5b4fcabce57270_lab2.pdf",
      "content": "LAB #2\n\n-\nDo experiment 5.6 \"Rates of Convergence\", Page 48, preferably using the Mathematica\nnotebook with the same title. (Alternatively, you may Use the Function Iterator available at\nthe Dynamical Systems and Technology Project web site). Use the default distance of .001,\nnot .00001 as stated in the book. If you need more than 10,000 iterations to get\n\"convergence\" then stop.\n-\nPerform only the \"Procedure\" and \"Results\" part of the experiment, not the portion called\n\"Notes and questions\". Please do not hand in lists of orbits; turn in only the answers\nrequested in the \"Procedure\" and the one page essay described in \"Results.\"\n-\nAlso answer the following question in your essay: What is the relationship between the\nspeed of convergence to neutral fixed points whose first derivative is equal to 1 (not -1)\nand the higher order derivatives (second and third) at the fixed point?\n\nPlease be sure to review the Lab Report Expectations.\n\n-\nThe Dynamical Systems and Technology Project web site is the work of Professor Bob\nDevaney at Boston University, and the Mathematica notebooks were written by Sebastian\nMarotta."
    },
    {
      "category": "Resource",
      "title": "lab2rw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/26b1a2824104d370bb739a01309456fa_lab2rw.pdf",
      "content": "18.091 Lab 2\nRates of Convergence\nAlejandro Ochoa\nMay 19, 2005\nIntroduction\nIn this experiment we investigated the correlation between the rate at which\nseeds upon iteration converge to a fixed point of a given iterating function\nand the absolute value of the derivative of this iterating function at the fixed\npoint. The fixed point of each function is either attracting or neutral and weakly\nattracting. The iterating functions we studied were\n1. F[x] = x2 + 0.25,\n2. F[x] = x ,\n3. F[x] = x2 - 0.24,\n4. F[x] = x2 - 0.75,\n5. F[x] = 0.4 x · (1 - x),\n·\n6. F[x] = x · (1 - x),\n7. F[x] = 1.6 x · (1 - x),\n·\n8. F[x] = 2 x · (1 - x),\n·\n9. F[x] = 2.4 x · (1 - x),\n·\n10. F[x] = 3 x · (1 - x),\n·\n11. F[x] = 0.4 Sin(x),\n·\n12. F[x] = Sin(x).\nMethods\nFor each function we measured the rate of convergence of a single seed x0 = 0.2\nby counting the number of iterations it took to get within ±0.001 from the fixed\npoint p.\n\nData and Observations\nOn the following table we list for each function F its corresponding number\nfrom the list in the introduction, the unique attracting or weakly attracting\nfixed point p, the absolute value of the derivative of F evaluated at p, the\nclassification of the fixed point p (attracting or neutral), and the number of\niterations it took for the seed to converge.\nF\nNo.\np\n|F 0(p)|\nClassification\nof p\n# Iterations for\nconvergence\n0.5\nNeutral\nAttracting\n-0.2\n-0.5\n0.4\n0.4\nAttracting\nNeutral\nAttracting\n499, 479\nNeutral\n0.375\n0.4\nAttracting\n1/2\nAttracting\n0.583333\n0.399998\nAttracting\n2/3\nNeutral\n55, 374\n0.4\nAttracting\nNeutral\n2, 999, 919\nFor the functions F for which F 0(p) = 1, we also calculated the second and\nthird derivatives at p and recorded those values on the following table:\nF\nF 0(p)\nF 00(p)\nF 000(p)\n# Iterations for\nNo.\nconvergence\n-1\n-2\n-1\n-1\n2, 999, 919\nDiscussion\nThere is a clear correlation between the classification of the fixed points p and\nthe number of iterations needed for convergence of the seed. Namely, for all\nof the attracting points p the seed required eight or less iterations to converge,\nwhile for all of the neutral points p which are weakly attracting the seed required\n990 iterations or more to approach the fixed point p.\nNote that other relations between the seed and the fixed point, including the\ndistance between the seed and the fixed point, the family of functions studied,\nand the absolute value of the derivative when it is different from 1, all seemed\nto be independent of the rate of convergence we studied.\n\nThere are only three functions (numbers 1, 6 and 10) which have their deriva\ntives evaluated at p equal to 1. For these we can note two interesting correla\ntions. First, as the absolute value of the second derivative of F at p gets smaller\nthe number of iterations required for the seed to converge to p increases. Sec\nond, as the absolute value of the third derivative of F at p gets smaller the\nnumber of iterations required for the seed to converge to p decreases.\nThe experiment led us to the conclusion that there is a welldefined relation\nbetween the classification of the fixed points and the rate of convergence of a\nseed towards the fixed points, namely, that attracting fixed points attract seeds\nmuch faster than neutral points which are weakly attracting. However, it seems\nthat other properties of the iterating function, the fixed point, or the seed, are\nnot related to the rate of convergence we studied."
    },
    {
      "category": "Resource",
      "title": "lab3_wes.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/e15ee6f9be3fa0090bb443d67d93f734_lab3_wes.pdf",
      "content": "18.091 Lab 3 Rewrite\nWes McKinney 11 May 2005\nExperiment\nThe objective of this experiment is to determine the periods of the various width period k\nwindows that appear in the orbit diagrams of the quadratic map, Qc(x) = x2 + c, and the logistic\nfamily, fλ(x) = λx(1 - x). Along these lines, we compare the orbit windows for these functions.\nThe online java applet plotting the orbit diagrams of these functions was used, which allowed\nmagnification of the desired orbit windows to determine the periods. The results have been put in\ntable format, organized by \"generation\", which roughly translates to the width of the orbit window,\nor the degree of visibility of an orbit window at a particular magnification. As it turns out, on\nexamination of these orbit windows, the distinction of width and visibility is very clear between\ngenerations.\nOn comparing the periods for the quadratic family and the logistic family, we find that\nthe periods are the same, though in reverse order, which agrees with the appearance of their orbit\ndiagrams (which open in opposite directions). Additionally, we observe that most of the numbers\nfor Generation 4 are twice those of the number appearing directly above them in the chart for\nGeneration 3. More investigation would be needed to determine is this is a continuing trend, but a\nreasonable conjecture to make would be that the period1 end of the list for Generation 5 will also\nbe double that of Generation 4. We list this prediction for Generation 5 as part of the tables for\nboth of the functions.\nGeneration\n5 (pred)\nFunction: x2 + c. These are the orbit windows for the quadratic map, ordered by increasing c.\nFor Generation 2, the two largest windows between the period1 and period3 windows are 5 and\n6. In Generations 3 and 4, we look between the windows of the previous generation to determine\nthe order of the smaller windows. In Generation 4, only those windows between the period6 and\nperiod1 windows are counted. The prediction for Generation 5 are those windows between the\nperiod12 window and the period1 window from Generation 4.\nGeneration\n5 (pred)\nFunction: λx(1 - x). Analogous table for the logistic family of functions. Notice that the values\nare the same as those in the previous table, though reflected."
    },
    {
      "category": "Resource",
      "title": "lab3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/dd5e3fd934000f77167850755d2bf25b_lab3.pdf",
      "content": "LAB #3\n\n-\nDo experiment 8.3 \"Windows in the Orbit Diagram\", page 92, preferably using the\nMathematica notebook with the same title. (Alternatively, you may Use the Function\nIterator available at the Dynamical Systems and Technology Project web site).\n-\nPerform the Procedure part of the Experiment, and then answer Questions 2-4 briefly.\nYou should turn in your charts for both families. Look at Note 1 if you are having difficulty\ndetermining which windows are the largest. Here is a sample of the chart that you should\nhand in for each family of functions.\n\nPlease be sure to review the Lab Report Expectations."
    },
    {
      "category": "Resource",
      "title": "bifurcations.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/7d263c49fdb0d8b8f9afb7dfbd649d2b_bifurcations.pdf",
      "content": "18.091 Introduction to Dynamical Systems\nSpring 2005\nLecture 3: Bifurcation and the Quadratic Map\nProf. Emma Carberry\nLecture notes by: Alan Dunn\nNote that all functions will be from R to R unless otherwise noted.\nTypes of cycles and their meaning\nBefore we proceed into discussing different types of bifurcations, we shall take the time to discuss\nthe concepts of attraction and repulsion, except this time, we will discuss how they relate to cycles\ninstead of points. These concepts will be important in the discussion of bifurcation, because certain\ntypes of bifurcation involve the generation of cycles that originate from a fixed point (though this\nwill be defined in more precise detail later).\nDefinition\nAn attracting ncycle for a function F(x) is an ncycle for which |(F n)0 < 1 on the\n|\nncycle, and a repelling ncycle is one for which |(F n)0 > 1 on the ncycle.\n|\nThe reader will surely have noticed that the point at which the derivative is to be taken is not\nspecified, however, it is easy to see that (F n)0 = F 0\nF n-1 F 0\nF n-2 · . . . · F 0, which means that\n*\n·\n*\n(F n)0 has the same value for any x that is part of the ncycle since F a will range over the ncycle\nfor 0 ≤ a ≤ n - 1.\nThere are two ways of interpreting the meaning of an attracting or repelling ncycle.\nOne of\nthese ways is as an attracting or repelling point for the function F n, but another, perhaps more\ngraphically intuitive way of thinking about these cycles is as cycles in which every nth point in the\norbit is considered as a sequence that is attracted or repelled from a specific point of the ncycle.\nAdmittedly, this is not a rigorous mathematical formulation, but should help to provide intuition\nfor the concept.\nBifurcations\nThe notion of a bifurcation is that of a splitting, or division, of significant points to a function by\nthe modification of a parameter that controls the function. More specifically, we will be considering\na family of functions Fλ(x) parameterized by λ and the behavior of their fixed points and cycles\nas we vary this parameter. We will find that there are certain critical values of λ for which the\nstructure of the fixed points and cycles of Fλ changes; for critical values with specific properties we\nwill declare that a bifurcation has occurred.\nThere are two main types of bifurcations we will be discussing:\nSaddlenode bifurcations\n-\n- Perioddoubling bifurcations\n\nIn each of these types of bifurcations, a fixed point \"splits\" into a fixed point and some other special\npoint or points. The meaning of this will be cleared up momentarily.\n2.1\nThe SaddleNo de bifurcation\nDefinition\nA family of functions Fλ is said to undergo a saddlenode bifurcation if there exists\nsome value λ0 and some open interval I that satisfies the following conditions:\n1. ∃ such that λ0 - < λ < λ0 → Fλ has no fixed points on I.\n2. Fλ0 has exactly one fixed point on I, and this fixed point is neutral.\n3. ∃ such that λ0 < λ < λ0 +\nFλ has exactly two fixed points on I, one of which is repelling\n→\nand one of which is attracting.\nNote that the way the definition is formulated it does not matter whether the point \"splits\" for\nincreasing or decreasing λ since it is always possible to formulate another family of functions F-λ\nwhich would have the appropriate behavior as λ\nλ0 if the original family did not.\n→\nThe definition is fairly clear in giving the intuition for the situation: a fixed point essentially appears\nin an interval at a specific value of λ and then for λ > λ0 this fixed point splits into two, one of\nwhich is attracting and one of which is repelling.\nThe reason for the name \"SaddleNode bifurcation\" is that one typical situation in which this type\nof bifurcation arises is in a function with a \"saddle\", that is, a part in the function that has a\nslope of exactly 1 at some point and a slope that continuously varies from something less than 1\nto something greater than 1, call this function f. If we let Fλ(x) = f(x) + λ, then as λ → -inf, we\ncan have a situation in which the graph of the saddle y = Fλ(x) becomes tangent to the line y = x\nat the point wherein the slope varies through 1. This effect can be seen in Figure 1.\nExample:\nTake Fc(x) = 1-x + c. Solving Fλ(x) = x we get:\np\np± = 2(1 + c ±\nc2 - 2c - 3)\nAt c = -1 these two are equal to 0, and then as c drops below -1 we get two distinct fixed points.\nFurthermore, we have Fc\n0(x) = (1-x)2 , which is equal to 1 at x = 0, and thus the fixed point for\nc = -1 is neutral. Then when c drops below -1, we can observe that one of the p's becomes slightly\nless and one becomes slightly more, which will cause Fc\n0 to be less than 1 at one and greater than 1\nat the other, that is, we will have an attracting and a repelling fixed point. Thus this is an example\nof a SaddleNode bifurcation.\n2.2\nThe PeriodDoubling bifurcation\nDefinition\nA family of functions Fλ is said to undergo a perioddoubling bifurcation if there exists\nsome value λ0 and some union of open intervals I that satisfies the following conditions:\n\ny = x\ny = f(x) + a\ny = x\ny = f(x) + b, b < a\nNeutral ixed point\ny = f(x) + c, c < b\ny = x\nRepelling fixed point\nAttracting fixed point\nFigure 1: A typical SaddleNode bifurcation.\n1. ∃ such that λ0 - < λ < λ0 → Fλ has exactly one attracting (respectively, repelling) ncycle\non I.\n2. Fλ0 has exactly one ncycle on I, and this ncycle is neutral.\n3. ∃ such that λ0 < λ < λ0 +\nFλ has exactly one 2ncycle, which is attracting (respectively\n→\nrepelling), and one ncycle, which is repelling (respectively attracting). Let the 2ncycle be\nof the points pa for a = 1, 2, . . . , 2n.\n4. lim\nλ+ pa = q(a) where each q(a) is a point in the original ncycle.\nλ\n→\nThe intuition for this type of bifurcation is that we start with some sort of ncycle, and from this\nncycle we spawn a 2ncycle, that is, one whose period is doubled, and change the type of ncycle\nthat we have from attracting to repelling or repelling to attracting.\nExample:\nTake Fc(x) = x + x2 + c. Then we have:\nFc(x) = x + x 2 + c\n=\nx ⇐⇒\nx\n=\n±\n√\n-c\nFc\n2(x)\n=\nx 4 + 2x 3 + (2 + 2c)x 2 + (1 + 2c)x + c(2 + c) = x\nx\n=\n±\n√\n-c, -1 ±\n√\n-1 - c\n⇐⇒\nSo for c infinitesimally greater than 1 we have a fixed point for Fc very close to 1, Fc\n0(x) = 2x + 1,\nand thus the fixed point is attracting. As c gets to 1, this fixed point becomes neutral, since the\nfixed point moves to x = -1, which has F-1(-1) = 2(-1)+1 = -1. When c becomes infinitesimally\nless than 1, √-1 - c becomes real, and then we have a 2cycle -1 ± √-1 - c, since these are each\nroots of Fc\n2(x) = x and not roots of Fc(x) = x. (Fc\n2)0(-1 + √-1 - c) = 5 + 4c, and thus as c\nbecomes infinitesimally less than 1, the two cycle becomes attracting. Furthermore, it is evident\nthat as c → -1, these two fixed points head toward x = -1. Thus, since we have a critical value\nfor which an attracting fixed point \"splits\" into a repelling fixed point and an attracting 2cycle,\nwe have an example of a PeriodDoubling bifurcation.\n\n-3\n-2.5\n-2\n-1.5\n-1\n-0.5\nc\n-2\n-1\nx\nFigure 2: A bifurcation diagram for the previously considered example Fc(x) = x + x2 + c. In\nthis diagram we can see both the two fixed points for Fc as well as the bifurcation that occurs at\nx = -1, c = -1\n2.3\nBifurcation Diagrams\nAn informative way of presenting some of the bifurcation data we've seen so far is through something\nknown as a \"bifurcation diagram\". In such a diagram, we plot the paths of fixed points and cycles\nas we vary the parameter that controls the family of functions. An example is presented in Figure\n2."
    },
    {
      "category": "Lecture Notes",
      "title": "preparinglecture.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/b38926cab9ad362a2c77e5f6a882aaa2_preparinglecture.pdf",
      "content": "Preparing Lectures\nExplore, don't merely comprehend An important step in understanding\nmathematics is to find your own way of thinking about it. Reading and\ncomprehending the text is a necessary first step but you will truly un-\nderstand the material when your approach to it does not slavishly follow\nsomeone else's. Try putting the book away, and asking yourself some basic\nquestion about what you've just read - it is by working with the mathe-\nmatics that you come to own it. Check out the exercises; they often have\ngood ideas to explore.\nWork out examples 'Playing' with examples is the most effective way of mak-\ning abstract notions concrete. Some textbooks don't emphasise examples\nin their text, or mention them but don't analyse them fully. Don't be\nfooled by this; examples are crucially important. The reason they may\nnot be fully explained is that the best approach is to work them out for\nyourself: you will learn much more that way than by reading someone\nelse's explanation.\nStructure your presentation So now you've read the text, and maybe a few\nother sources as well, and you've worked out as many examples as you\ncan think of.\nIt's time to take stock of the big picture.\nWhat is the\nmain point of what you've learnt? Try to state the big picture in one or\ntwo sentences. Then break your new knowledge down into several main\npoints, put in an order so that at each stage you have already developed\nwhatever tools are needed. Then break each of these points down further,\nto about the level of detail where you are listing the statements of your\nlemmata. Decide what examples you will use, and what role they will play:\nwill they illustrate theory you've just explained, or motivate a definition\nor theorem? Don't simply follow the book - after coming to understand\nthe material yourself you may conclude that your way of presenting it is\nexactly what Osserman has chosen, and that is fine (he has very good\ntaste, after all!) but that is a conclusion you should reach on your own,\nafter understanding things in your own way.\nChoose your medium You can use the blackboard, slides, a powerpoint-type\npresentation, or some combination (you might want, for instance, to give a\nblackboard talk but incorporate pictures you've downloaded from a web-\nsite). Blackboard presentations are more common in mathematics than\nin many other disciplines, and are by far the most common choice for\nundergraduate and graduate math lectures, although seminar talks in-\ncreasingly use other media. In a mathematics lecture it is very important\nthat the lecturer and the audience are both thinking through the mate-\nrial as it is presented; the lecturer needs to not be simply reading from\nlecture notes/slides, but recreating them, at the right pace for the audi-\nence. The blackboard forces this upon you more than the other media do,\nbecause you are writing the material rather than reading it. I feel that it\n\nis easier to give a 'bad' slide/powerpoint lecture than a 'bad' blackboard\none as one can succumb to the temptation of trying to present more than\nthe audience can absorb, or of simply reading one's slides. However, I\nfeel it's about as difficult to give a great talk in any of these media, and\nin a seminar situation where you probably want to present results with-\nout giving all the details about them, the slide/powerpoint presentations\ncome in to their own. Also, in either a lecture or a seminar talk, doing a\npowerpoint presentation allows you to seamlessly incorporate things like\nvideos or interactive java applets that can be wonderful additions to your\npresentation.\nBlackboard talk: Make detailed lecture notes Now it's time to ex-\npand your outline out into a lecture. What it's appropriate to write\non the board is different from what you would write if you were\nwriting a textbook. Be succinct. Avoid long sentences. You should\nwrite out lecture notes that consist of what you intend to write on\nthe board. Some people say that you should write out notes exactly\nas you plan to present the material; the same number of lines as\nyou'll put on each board etc (and work out how many lines should\ngo on each board before the class). You may feel that this is taking\nthings too far, but it is important to at least produce notes that ac-\ncurately represent what you will do in the lecture. It's also helpful\nto make a note of any additional comments that you plan to make,\nbut anything important (for instance anything that made it on to\nyour outline) should be written down on the board. You may want\nto expand on some side issue without writing down the details, or\nmention that something you've just introduced will be used again\nlater, but in general at least a summary of what you're saying should\nmake it on to the board.\nSlides/Powerpoint Presentation Make sure that your font sizes are\nlarge enough that the audience will easily be able to read your text\n(this is especially important if you're in a large lecture hall), and don't\ncrowd each page - use double spacing, and an attractive, uncramped\nlayout. Colours are great, too.\nDo a Timed Practice Do a 'dry run' on the medium you plan to use, and\ntime it. If there's someone else who's interested in listening, that's great\nbut it's not necessary. Time yourself, and take note not only of the total\ntime but of the time it takes you to get to a few different points in your\nlecture, so that on the day you'll know whether you are running a bit fast\nor a bit slow. Plan how you can adjust in each case; something extra you\ncan say or something you can say more succinctly or cut out altogether.\n\nGiving Lectures\n0.1\nBlackboard Talk\nSummarise It's often a good idea to give your audience a quick summary of\nwhat you are going to say, so that they know what to expect and they\nrecognise the main points immediately.\nGive it live You don't want your lecture to consist of you copying your notes\non to the board, and faithfully reading them to us. You should be able\nto remember large parts of your lecture; you will want your notes close\nby and you'll probably glance at them often to make sure you're giving\nthe lecture as planned, but make sure that you are actively understanding\nand explaining the material as you present it. When you come to a proof\nor example this is particularly important or you'll get lost.\nUse the boards in order Start by erasing anything that the previous class\nleft on the board. Begin writing on the left with one of the movable boards,\nthen push it up and write on the bottom left board, and work your way\nrightwards, always making sure that you first write on a board that can\nbe pushed up. For wide boards you may want to draw a line down the\nmiddle to divide it into smaller pieces.\nMake your writing legible Neat writing, at a size that is easy to read (but\nnot so big you can't fit much on the board) is one of those things one\ncomes to appreciate when it's missing. Don't try to cram something in to\na tiny piece of the board: begin a new one, if you need to. These last two\npoints are easy to do, and they make a big difference.\nRepeat, repeat, repeat You know what is is like to be in a lecture - no\nmatter how interesting the lecture is, you'll space out for a few seconds\noccasionally. As a lecturer, you need to make sure that a few moments of\ninattention don't make it impossible for someone to follow what you say\nnext. This is one of the reasons for writing down some account of pretty\nmuch everything you say. You should also talk about what you're writing,\nand since it's quicker to speak than to write you have time to emphasise\nthe main point of each paragraph by repeating it. This tells people that\nit is important and gives them another chance to understand your point,\nespecially if you can say it in a slightly different way.\nLook at the audience Try not to talk to the blackboard; you'll need to face\nit whilst writing but turn around as much as possible, and spend some\ntime not writing anything so that you can engage with the audience. Try\nto make eye contact with each person in the room at some point during\nyour lecture; don't just direct your remarks to the person who asked an\ninteresting question at the beginning of class.\nEncourage class participation A lively class in which people are asking ques-\ntions, and actively contributing, is a lot more fun and a better place to\n\nlearn. When it's not your turn to lecture, you can help create such a class-\nroom by asking and responding to questions. When you are lecturing, you\ncan try to draw people in to a discussion by asking them questions, and by\nsetting up some short, easy task that everyone can work through, comput-\ning out an example for instance. This means that people are immediately\napplying what you are teaching them and hence they understand it and\nare really ready for the next thing that you introduce. It also keeps ev-\neryone interested; it's hard to sit in a long lecture; taking a break to do\nsome mathematics makes the class more enjoyable."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/6717ca2df19f7b53b7fa0ab1bc4339f6_lecture01.pdf",
      "content": "18.091\nLecture 1\nJeremy Hurwitz\n2/9/05\n\n1. What is a dynamical system?\n1.1. Any system that changes over time\na) Continual: Orbits\nb) Discrete: Compound Interest\n\n2. Iteration: A process that is repeated over and over again.\na) The output is sent back into the function as the new input\nb) Notation: The n-th iteration is written as Fn(x)\n\n2.2. Example 1: For compounding interest at a rate of 10% per year:\nA0 = $100\nA1 = $110\nA2 = $121\nA3 = .....\na) Can be modeled by an iteration I(x) = 1.1x\nA0 = $100\nA1 = I(100) = 1.1*100 = $110\nA2 = I(121) = I(I(100)) = $121\nA3 = I3(A)\nb) Can be evaluated in general using An = (1.1)nA\n\n2.3. Example 2: Finding Square Roots:\na) Need an algorithm. To find √n:\n1) Make a guess x\n2) Average x and n/x\n3) Use the result as your new guess\n4) Repeat until guess is good enough\n\nb) Proof of Method:\nGiven x, n > 0, we have two cases:\nCase 1:\n\nCase 2:\n√n < x\n\n√n > x\nn < x√n\n\nn > x√n\nn/x < √n\n\nn/x > √n\n\nIn either case, √n is between n and n/G, so by averaging, we narrow the range\nin which √n can lie.\n\nc) For n=10 and an initial guess x=1\n\nIteration Guess\nGuess2 Average\n5.5\n5.5\n30.25\n3.65909\n3.65909 13.3889 3.30493\n3.30493 10.9226 3.16536\n3.16536 10.0195\n\n2.4. Changing from continuous to discrete:\na) Continually-compounded Interest:\nA(t) = A0ekt [t= time in years] ----> An = A0ekn [n= # of years]\n- Changed from continuous to discrete with an iteration I(x) = (ek)x\nb) Planetary Orbits\nDraw an imaginary plane in space and look at the points where the orbit\nintersects the plane\nc) Gains some simplicity at the expense of some information\n- Discrete, instead of continuous\n- No information about behavior in between iterations\n\n3. Orbits:\n3.1. Informally - The outputs of an iteration listed in the order that they are achieved\n3.2. Formally - Given x0 є R, the orbit of x0 under F is the sequence of points x0, x1, x2\nsuch that xn = Fn(x0)\n\n3.3. Useful things we can say about orbits:\na) Limit as n→inf\n- S(x)→√n\nb) Are there any patterns?\n\n4. Types of Orbits:\n4.1. Fixed Points: Definition: F(x0) = x0, for some x0\n- If a=√n, S(a)=a\n\n4.2. Periodic Orbits / Cycles: Definition: Fk(x0) = x0, for some k, x0\n- If F(x) = 5 - x\nF(5) = 0\nF(0) = 5\n- Called a 2-cycle\nb) Finding a k-cycle\n- Solve the equation Fk(x) = x\n- If F is a quadratic function, this has degree 2k. In general, that is impossible to\nsolve exactly.\nc) Note that if F has a k-cycle, then it has cycles of length nk, for all integers n\n\n- F3k(x0) = Fk(F2k(x0)) = F2k(x0) = . . . = x0\n- Prime Period: n=1\n\n4.3. Eventually Fixed: Definition: Fk(x0) = x*, for all k sufficiently large\na) F(x) = x2 - 1, x0=(√5 + 1)/2\n(√5 + 1)/2, 0, 0, 0, ....\n4.4. Eventually Periodic: Definition: Fm(x0) = Fn(x0), for some m,n greater than 1\na) F(x) = x2 - 1, x0=√(√2 + 1)\n√(√2+1), √2, 1, 0, -1, 0, -1, 0, .....\n\n5. Computers\n5.1. Uses:\na) Visualizing orbits\nb) Approximating values:\n- solving F(x)=x\n- finding square roots\n\n5.2. Shortfalls:\na) Rounding Errors!\n- Table on page 23\n- If x is close enough to zero, the computer will round to zero, and the orbit\nwill become fixed, instead of remaining chaotic like it should."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/bba8cd20e9ed72969c529f00a8c372e2_lecture02.pdf",
      "content": "GRAPHICAL ANALYSIS OF ORBITS\n&\nFIXED POINTS OF FUNCTIONS\nG. AUSTIN FORD\n1. Introduction\nThis set of notes is a paraphrasing of Chapter 4 and Sections 1 through 4 of Chapter 5 in R. L. Devaney's\nA First Course in Chaotic Dynamical Systems. Some added material is included on the topic of fixed points\nfrom Chapter 5, specifically some proofs and discussion on the Banach and Brouwer Fixed Point Theorems.\n2. Graphical Analysis of Orbits\nIn studying dynamical systems, one of the most important and enlightening things we can do is examine\nthe behavior of the orbits of that system. This gives us an idea of how the system itself works. It is especially\nhelpful to have a graphical representation of these orbits, for this allows us to get a more intuitive grasp on\nwhat is going on. There are two ways that we have of making such a graphical analysis: the orbit diagram\nand the phase portrait.\n2.1. Orbit Diagrams. The first method we have of graphically plotting the behavior of an orbit is an orbit\ndiagram. This is a two dimensional representation of an orbit, and it is incredibly useful when we are dealing\nwith functions of one variable. To make an orbit diagram, we follow this short algorithm:\n(1) Plot our given function f(x) and the line y = x in the plane.\n(2) Pick an initial seed point x0.\n(3) Plot the point (x0, x0).\n(4) Draw a vertical line from (x0, x0) to the point (x0, f(x0)).\n(5) Draw a horizontal line from (x0, f(x0)) to the line y = x; call the point where these lines intersect\n(x1, x1).\n(6) Return to step (3) with (x1, x1) as the new seed point.\nThis will product a staircaselike pattern that goes from the initial seed point through its orbit.\nUsing\nthis method, we can usually get an understanding of what's going on in a onevariable system. For a few\nexamples, consult Figures 4.1 through 4.6 in Devaney's text.\n2.2. The Phase Portrait. The second method we have of graphically studying the behavior of an orbit is\na phase portrait. This is a one dimensional representation of an orbit, and it is our only method of studying\nsystems of two variables or higher. To create a phase portrait, we follow an even shorter algorithm than that\nfor an orbit diagram:\n(1) Pick an initial seed point x0.\n(2) Plot x0 on the real line.\n(3) Compute the point x1 = f(x0).\n(4) Draw a look from x0 to x1.\n(5) Return to step (2) with x1 as our new point.\nThis will produce a horizontal line with a series of loops, each loop taking you from one point of the orbit\nto the next. This allows us to get at least a succinct representation of the orbit, which can often be quite\nillustrative. For a few examples, please take a look at Figures 4.7 and 4.8 of Devaney's text.\n\np\nG. AUSTIN FORD\n3. Fixed Points of Functions\nIn this section, we are concerned with a particular type of orbit of a function, namely fixed points. These\nare among the most important kinds of orbits a dynamical system can have, and it is important that we be\nable to determine where they are. We are also interested in examining the behavior of a function around\nthese fixed points.\nLet's begin with the definition of a fixed point.\nDefinition 1 (Fixed Point). Let E be a subset of a metric space X with metric d, and let f : E -→ X be\na function. We say that x ∈ E is a fixed point of f if f(x) = x.\nThus, fixed points are the points in the domain of a function that remain the same after the function has\nbeen applied. The following are some examples:\n- f(x) = 2x + 4 and the point x0 = - 4\n- g(x) = x2 - x + 1 and the point x0 = 1\n- h(x) =\nx/2 + 5 and the point x0 = 5/2.\nNow the following question arises: How do we determine whether or not a general function has a fixed\npoint? It turns out that this has a many different answers. In the case of functions like the three above,\nwe can determine the fixed points by simply setting the function equal to it's independent variable, i.e.\nsetting f(x) = x, and solving. This, however, will not always work for a general function. There are many\ncomplicated functions for which such a calculation will become impossible, especially if we wish to find a\nsolution explicitly. Ergo, we make use of some theoretical results which show the existence of fixed points\nfor certain functions.\n3.1. A Few Fixed Point Theorems. We will look at three different examples of fixed point theorems:\nthe Fixed Point Theorem, the Banach Fixed Point Theorem, and the Brouwer Fixed Point Theorem. These\ntheorems each give a different type of function that has at least one fixed point. The first theorem is a\nresult that follows from the basics of calculus, and the second only requires knowledge of Cauchy sequences\nand completeness. The Brouwer theorem, on the other hand, requires knowledge outside of 1dimensional\nanalysis, and it will only be stated.\n3.1.1. An Elementary Fixed Point Theorem. First of the theorems we will look at is the socalled Fixed Point\nTheorem. It relies on a wellknown result from basic calculus, namely the Intermediate Value Theorem. To\nshow that the Intermediate Value Theorem holds, we must first recall what it means for a space to be\nconnected.\nDefinition 2 (Connected Metric Space and Separation). A metric space (X, d) is connected if there does\nnot exist a separation of X. By a separation, we mean a pair of disjoint open sets A, B ⊂ X such that\n\nX ⊂ A ∪ B and A ∩ B = A ∩ B = ∅.\nTherefore, we see that a space is connected if it cannot be divided up into two pieces which are at least some\ndistance apart. Some examples of connected sets are the following:\nthe real line R\n-\n- the ndimensional Euclidean space Rn\n- the ndimensional complex space Cn .\nLet us now verify the Intermediate Value Theorem.\nTheorem 1 (Intermediate Value Theorem). Let E be a subset of a connected metric space (X, d), and let\nf : E -→ R be a continuous function. Given points x1, x2 ∈ E and a point y lying between f(x1) and f(x2),\nthere is an x ∈ E such that f(x) = y.\nProof. We shall proceed by contradiction. Suppose that f : E -→ R is a continuous function, and suppose\nthat for x1, x2 ∈ E there is some y ∈ R lying between f(x1) and f(x2) such that f(x) = y for any choice of\nx ∈ E. We then have that f -1((-inf , y)) and f -1((y, inf )) form a separation of E. However, we know that\nE is a connected set, which contradicts the existence of such a separation. Hence, we must have that there\nis some x ∈ E such that f(x) = y.\n\nGRAPHICAL ANALYSIS AND FIXED POINTS\nIn particular, notice that functions f : [a, b] -→ R satisfy the Intermediate Value Theorem; this is because\n[a, b] is a connected set. The proof of this is left as an exercise.\nWe now have all the tools we need to prove our first fixed point theorem.\nTheorem 2 (Fixed Point Theorem). Let f : [a, b] -→ [a, b] be a continuous function. Then f has a fixed\npoint.\nProof. Consider the function F(x) = f(x)- x. F is the sum of two continuous functions, so it is continuous.\nSince a 6 f(x) 6 b for all x ∈ [a, b], we have that\n0 6 f(a) - a = F(a) 6 b - a\n(1)\na - b 6 f(b) - b = F(b) 6 0.\nTherefore, 0 lies between F(a) and F(b). By the Intermediate Value Theorem, we then have that there is\nsome x0 ∈ [a, b] such that\n(2)\nF(x0) = f(x0) - x0 = 0.\nThus, f(x0) = x0, so x0 is a fixed point of the function f.\n\nThus, we have that functions that carry a closed interval [a, b] into itself always have some fixed point.\n3.1.2. The Banach Fixed Point Theorem. The next fixed point theorem we will look at is the Banach Fixed\nPoint Theorem. It requires a bit more sophistication than the previous theorem, namely knowledge of Cauchy\nsequences and complete metric spaces. Let us first remind ourselves what a sequence is and what it means\nfor a sequence to converge.\nDefinition 3 (Sequences and Convergence). Let (X, d) be a metric space. A sequence of points in X is a\ncollection { xn} inf\nn=1 of points of X. Such a sequence is said to converge to x ∈ X if given ε > 0, there is an\nN > 0 such that d(xn, x) < ε whenever n > N.\nThis tells us that a sequence converges to a point when, if you go far enough out into the sequence, all points\ncome arbitrarily close to that point. Sequences are very important in analysis, and they arise in a myriad of\nsituations. One particularly important example of a sequence is the Cauchy sequence.\nDefinition 4 (Cauchy Sequence). A sequence { xn} inf\nn=0 in a metric space (X, d) is called a Cauchy sequence\nif given ε > 0 there is an N > 0 such that for all m, n > N we have d(xm, xn) < ε.\nWe then see that a Cauchy sequence is a sequence that, under \"nice\" conditions, will always converge. This\nis because after enough time, the points in a Cauchy sequence will become arbitrarily close to one another;\nthus, if a Cauchy sequence does not converge in a space, it must be because the limiting point is simply not\nin the space. For instance, take the decimal expansion of\n√\n2. In the rational numbers, this is a Cauchy\nsequence; however, it does not converge inside of the rationals. However, if we consider this sequence in the\nreals, then it does indeed converge. This brings us to the notion of a complete metric space.\nDefinition 5 (Complete Metric Space). A metric space (X, d) is said to be complete if every Cauchy sequence\nin X converges in X.\nNow, we are ready to prove the Banach Fixed Point Theorem.\nTheorem 3 (Banach Fixed Point Theorem). Let E be a subset of a nonempty, complete metric space (X, d),\nand let f : E -→ X be a contraction, i.e. a map f : X -→ X with constant 0 6 λ < 1 such that\n(3)\nd(f(x), f(y)) 6 λ d(x, y)\nfor all x, y ∈ X. Then f has a unique fixed point x∗.\nProof. Let (X, d) be a nonempty complete metric space, and let f be a contraction mapping on (X, d) with\nconstant λ. Pick an arbitrary x0 ∈ X, and define the sequence { xn} inf\nn=0 by\n(4)\nxn = f n(x0),\nwhere f n denotes the nth iteration of f. Let a = d(f(x0), x0). We first show by induction that for any\nn > 0,\nn\n(5)\nd(f n(x0), x0) 6 1 - λ a.\n1 - λ\n\nG. AUSTIN FORD\nFor n = 0, this is clear. For any n > 1, suppose that d(f n-1(x0), x0) 6 1-λn-1 a. Then\n1-λ\nd(f n(x0), x0) 6 d(f n(x0), f n-1(x0)) + d(x0, f n-1(x0))\nn-1\n6 λn-1d(f(x0), x0) + 1 -λ\na\n1 -λ\nn\n(6)\nλn-1 -λ\n1 -λn-1\n=\na +\na\n1 -λ\n1 -λ\nn\n1 -λ\n=\na\n1 -λ\nby the triangle inequality and repeated application of the property d(f(x), f(y)) 6 λ d(x, y) of f.\nBy\ninduction, the inequality holds for all n > 0. Given any ε > 0, it is possible to choose a positive integer N\nλn\nsuch that\nλn a < ε for all n > N, because 1-λa → 0 as n → inf. Now, for any m, n > N (we may assume\n1-λ\nthat m > n),\nd(xm, xn) = d(f m(x0), f n(x0))\n6 λnd(f m-n(x0), x0)\nm-n\n(7)\n6 λn 1 -λ\na\n1 -λ\nλn\n<\na\n1 -λ\n< ε,\nso the sequence {xn} is a Cauchy sequence. Because (X, d) is complete, this implies that the sequence has\na limit in (X, d); define x∗ to be this limit. We now prove that x∗ is a fixed point of f. Suppose it is not;\nthen δ = d(f(x∗), x∗) > 0. However, because {xn} converges to x∗, there is a positive integer N such that\nd(xn, x∗) < δ/2 for all n > N. Then\nd(f(x∗), x∗) 6 d(f(x∗), xN+1) + d(x∗, xN+1)\n(8)\n6 λ d(x∗, xN) + d(x∗, xN+1)\n< δ/2 + δ/2 = δ,\nwhich is a contradiction. So x∗ is a fixed point of f. It is also unique. Suppose there is another fixed point\nx0 of T; because x0 =6\nx∗, d(x0, x∗) > 0. But then\n(9)\nd(x0, x∗) = d(f(x0), f(x∗)) 6 λ d(x0, x∗) < d(x0, x∗),\na contradiction. Therefore, x∗ is the unique fixed point of f.\n\nHence, we have that contractions in complete metric spaces have fixed points. This is an especially important\nresult of analysis, for it is used in the proof of Picard's Existence Theorem for solutions to initial value\nproblems for ordinary differential equations.\n3.1.3. The Brouwer Fixed Point Theorem. Lastly, we come to the Brouwer Fixed Point Theorem. This is\nthe most advanced of the fixed points theorems we will look at. It involves selfmaps of the unit ball Bn in\nndimensional Euclidean space. Let us first define what the unit nball is.\nDefinition 6 (The ndimensional Unit Ball). The ndimensional unit ball Bn is the subset of Rn given by\n(10)\nBn := {x = (x1, . . . , xn) ∈ Rn : kxk = [x1 +\n+ x 2 ]1/2 6 1}.\nn\n· · ·\nNow we state the theorem.\nTheorem 4 (Brouwer Fixed Point Theorem). If f : Bn -→ Bn is a continuous mapping, then f has a fixed\npoint.\nProof. This proof requires knowledge beyond 1dimensional rigorous calculus, so it is omitted. Please consult\neither Jim Munkres' Topology, Victor Guillemin's \"Supplementary Notes\" to 18.101, or a similar text for a\nproof.\n\nThis theorem is also an important one in analysis. For instance, it is used to prove various existence\nresults in the field of partial differential equations, and it has many other applications as well.\n\nGRAPHICAL ANALYSIS AND FIXED POINTS\n3.2. Attraction and Repulsion. We now wish to examine how functions behave around their fixed points.\nDo functions send the nearby points towards a given fixed point? What about away from it? Is it possible\nthat the function does none of the above?\nIn order to find answers to these questions, we return to the tools we obtained from calculus. To illustrate,\nlet us consider the function f(x) = x2. It has fixed points at x1 = 0 and x2 = 1. If we look at the behavior\nof the points in the interval (0, 1) as f is applied, we see that they grow smaller and smaller as the number\nof iterations increases. Thus, we see that if x ∈(0, 1), then f n(x) →0 as n →inf. Similarly, if we look at\npoints x in the interval (1, inf), then as f n(x\n. Lastly, the case for negative values of x is\n) →inf as n →inf\neasily reduced to the symmetric positive case. This suggests that f sends points around 0 towards 0 and\npoints around 1 away from 1. We would then call 0 an attracting fixed point, and we would call 1 a repelling\nfixed point. In general, these are defined as follows.\nDefinition 7 (Attracting, Repelling, and Neutral Fixed Points). Let E ⊂R, and f : E -\nR be a function\n→\nwith fixed point x0 ∈X. Suppose f is continuously differentiable at x0. We say that x0 is an attracting fixed\npoint if |f 0(x0) < 1, and we say that x0 is a repelling fixed point if f 0(x0) > 1. Lastly, if f 0(x0) = 1, we\n|\n|\n|\n|\n|\ncall x0 a neutral fixed point.\nIn terms of graphical analysis, these definitions make intuitive sense. This is because the value of f 0(x0) is\nthe slope of the tangent line to the function's graph at x0. If this has absolute value smaller than 1, then\nthe tangent line will be below the line y = x for x > x0, and the tangent line will be above y = x for x < x0.\nThis will cause the orbit diagram to move inward towards (x0, x0). Analogously, if this tangent line has\npositive slope at x0, then it will be above y = x for x > x0, and it will be below y = x for x < x0. This\nwill cause the orbit diagram to move outwards from (x0, x0). In the event that the derivative is ±1 at x0,\nthis method becomes inconclusive. We must then rely on graphical analysis to determine the behavior of\nthe function.\n3.2.1. Attracting Fixed Points. The first type of fixed point that we mentioned was the attracting fixed\npoint. Around this type of fixed point, orbits move inward. Some examples of functions and attracting fixed\npoints are the following:\n- f(x) = -2x2 + 2x and the point x0 = 1/2\n- g(x) = x/2 + 6 and the point x0 = 12\nh(x) = √x and the point x0 = 1.\n-\nOne might naturally wonder why this kind of behavior occurs, that is to say why attracting fixed points\ncause orbits to sink into them. The following theorem offers an answer.\nTheorem 5 (Attracting Fixed Point Theorem). Let E ⊂R, and let f : E -\nR be a function with attracting\n→\nfixed point x0. Then there is an ε > 0 such that if x ∈(x0 -ε, x0 + ε), then f n(x) ∈(x0 -ε, x0 + ε) for all\npositive n, and moreover f n(x) →x0 as n →inf.\nProof. Let everything be as in the statement of the theorem. We then have that since |f 0(x0) < 1, there is\n|\na number λ > 0 such that |f 0(x0) < λ < 1. By continuity of f 0, we may then choose an ε > 0 such that\n|f 0(x) < λ for all x ∈(x0 -ε, x0 +\n|\nε). Consider now an arbitrary x ∈(x0 -ε, x0 + ε). From the mean value\n|\ntheorem, we have that\n(11)\nf(x) -f(x0) = f 0(y)\nx -x0\nfor some y lying between x and x0; thus, we have that\n(12)\n|f(x) -f(x0)| = |f 0(y) < λ,\n|x -x0\n|\n|\nor equivalently,\n(13)\nf(x) -f(x0) < λ x -x0 .\n|\n|\n|\n|\nWe know that x0 is a fixed point, so this gives that\n(14)\nf(x) -x0 < λ x -x0 .\n|\n|\n|\n|\n\nG. AUSTIN FORD\nTherefore, the distance from f(x) to x0 is smaller than the distance from x to x0 since 0 < λ < 1. This\nimplies that f(x0) lies in the interval (x0 -ε, x0 + ε) since x was chosen in that interval. We can thus apply\nthe above process to f(x) and f(x0), giving\n(15)\n|f 2(x) -x0| = |f 2(x) -f 2(x0)| < λ f(x) -f(x0) < λ2 x -x0 .\n|\n|\n|\n|\nSince 0 < λ < 1, we have that 0 < λ2 < λ. This shows that as we continue to apply f to x and x0, we shrink\nthe distance between f n(x) and f n(x0) = x0. This yields that for n > 0 we have\n(16)\nf n(x) -x0 < λn x -x0 .\n|\n|\n|\n|\nNote that λn →0 as n →inf. Hence, we have that f n(x) →x0 as n →inf.\n\nWe then see that under application of f, attracting fixed points actually do bring the nearby points\ntowards them. In practice, this type of fixed point is much easier to find than the repelling fixed point. This\nis because when we compute the orbit of a given seed, we know that if it enters one of these critical intervals\n(x0 -ε, x0 + ε) around an attracting fixed point x0, it won't be able to escape.\n3.2.2. Repelling Fixed Points. The second type of fixed point that we mentioned was the repelling fixed\npoint; these are fixed points that cause orbits to move outward from them. Some examples of functions with\nsuch fixed points are:\n- f(x) = -2x2 + 2 and the point x0 = 0\n- g(x) = 2x + 3 and the point x0 = -3\n- h(x) = x4/4 -5x + 8 and the point x0 = 2.\nAs with the case of the attracting fixed point, it is natural to wonder why this behavior appears. The\nfollowing theorem, which is an analogue of the theorem for attracting fixed points, offers an answer.\nTheorem 6 (Repelling Fixed Point Theorem). Let E ⊂R, and let f : E -\nR be a function with repelling\n→\nfixed point x0. Then there is an ε > 0 such that if x ∈(x0 -ε, x0 + ε) and x = x0, then there is a positive\ninteger N such that f N(x) /∈(x0 -ε, x0 + ε).\nProof. Let everything be as in the statement of the theorem. Since |f 0(x0) > 1, we have that there is some\n|\nλ > 0 such that |f 0(x0) > λ > 1. Furthermore, by continuity of f 0 we may choose a ε > 0 such that if\n|\nx ∈(x0 -ε, x0 + ε), then f 0(x) > λ. Choose now an arbitrary x ∈(x0 -ε, x0 + ε). From the mean value\n|\n|\ntheorem, we have that\n(17)\nf(x) -f(x0) = f 0(y1)\nx -x0\nfor some y1 lying between x and x0; therefore, we have that\n(18)\n|f(x) -f(x0)| = |f 0(y1) > λ,\n|x -x0\n|\n|\nor equivalently,\n(19)\nf(x) -f(x0) > λ x -x0 .\n|\n|\n|\n|\nWe know by assumption that x0 is a fixed point of f; this gives that\n(20)\nf(x) -x0 > λ x -x0 .\n|\n|\n|\n|\nSince λ > 1, we have that f(x) is further from x0 than x originaly was. If f(x) /∈ (x0 -ε, x0 + ε), i.e. if\nf(x) -x > ε, then we are finished. If this is not the case, then we may repeat the above process using\n|\ninstead f(\n|\nx) as our point in (x0 -ε, x0 + ε). This gives that\n(21)\n|f 2(x) -x0| = |f 2(x) -f 2(x0)| > λ f(x) -f(x0) > λ2 x -x0 .\n|\n|\n|\n|\nNote that λ2 > λ since λ > 1. We then have that as we continue to apply f to x and x0, we increase the\ndistance between f n(x) and f n(x0) = x0. This yields that for n > 0, we have\n(22)\nf n(x) -x0 > λn x -x0\n|\n|\n|\n|\nas long as f n-1(x) ∈(x0 -ε, x0 + ε). Note that λn →infas n →inf. We then have that there is some N > 0\nsuch that λn > ε/ x -x0 for n > N. This tells us that\n|\n|\n(23)\n|f N(x) -x0| > λN|x -x0| > ε.\n\nGRAPHICAL ANALYSIS AND FIXED POINTS\nHence, f N(x) /∈ (x0 - ε, x0 + ε).\n\nFrom the proof of this theorem, we are able to see that repelling fixed points literally push the points\naround them away the more we apply f. This makes this type of fixed point rather difficult to find when one\ndoes analysis of a dynamical system, for the points within a critical interval (x0 - ε, x0 + ε) do not remain\nin that interval for long once we begin iterating f.\n3.2.3. Neutral Fixed Points. The last type of fixed point to discuss is the neutral fixed point. These are the\nfixed points around which it is impossible to discover the behavior of the dynamical system by using only\nanalytical methods. We must instead revert to our tools of numerical calculation and graphical analysis.\nThese will allow us to pinpoint which side of such a neutral fixed point serves to attract the nearby points\nto it, and which side of a neutral fixed point serves to repel the nearby points away from it. Some examples\nof functions with neutral fixed points are the following:\n- f(x) = x - x2 and the point x0 = 0\n- g(x) = 1/x and the point x0 = 1\n- h(x) = x and any point x0 ∈ R."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/78a4e9b2ae06f267b9037816b8504fec_lecture04.pdf",
      "content": "The Quadratic Family and the Cantor Set\nWes McKinney 18.091 2 March 2005\nQuadratic Family: Qc(x) = x2 + c\nWe have already begun to investigate the behavior of this family of functions, particularly in the\nfirst lab we did. For many values of c, the behavior of the function is not particularly interesting,\nbut we are able to analyze the conditions leading to any particular type of behavior. Our concern\nin this chapter and this lecture will be other values of c, particularly those for c ≤ -2. The fixed\npoints of the quadratic map for an arbitrary value of c are given by the solutions to Qc(x) = x,\nthat is x -x + c = 0 = ⇒p± = 2(1 ± √1 -4c). Using this and the first derivative Qc\n0 (x) = 2x, we\nknow the following things about the quadratic map:\n1. For c > 1/4, all orbits go to infinity. For c = 1/4, Qc has a single neutral fixed point at 1/2,\nfor this is where the discriminant is zero.\n2. When c < 1/4, the graph intersects the line y = x in two places, and we have two fixed points\ngiven as above, p+ and p-. p+ is always repelling since Qc\n0 (p+) = 1+√1 -4c > 1 for c < 1/4,\nbut since Qc\n0 (p-) = 1 -√1 -4c, we have to determine where Qc\n0 (p-) has magnitude greater\nthan 1 and less than 1. A simple analysis shows that |Q0\nc < 1 for -3/4 < c < 1/4, |Q0\nc = 1\n|\n|\nfor c = -3/4, and |Q0\nc > 1 for c < -3/4, so these ranges lead to an attracting, neutral, and\n|\nrepelling p- respectively. This is a basic bifurcation.\nWe are going to concern ourselves with what happens when c gets smaller, particularly when\nthe minimum of Qc reaches the line y = -2 and goes below it. We investigated in Experiment 3.6\nthe behavior for c = -2 and some c < -2, but now we are going to establish a more analytic basis\nfor what we're talking about.\n-2\n-1\n-2\n-1\nFigure 1: y = x2 -2 (horizontal lines added)\n1.1\nCase 1: c = -2\nFrom experimental observations Q-2 behaved chaotically for the essentially all of the seeds we\npicked for orbits. One of the very obvious things is that when we choose a seed that is not between\nthe fixed points, we have an orbit that tends to infinity very quickly, since the fixed points are\nrepelling as above. When x0 ∈ [-2, 2] the orbit is confined to the 4by4 box shown above, which\ncan be seen by graphical intuition, in addition to drawing orbit diagrams. It turns out that the\nfunction's behavior is not completely chaotic, and to analyze its characteristics we note some of the\nmapping properties of Q-2 and its iterates.\n\nFirstly, as we see from the graph of Q-2, the function maps both [-2, 0] and [0, 2] onto [-2, 2],\nso that for each x ∈ [-2, 2], there are two points y in the whole interval for which Q-2(y) = x.\nSimilarly, since the image of [0, 2] under Q-2 is [-2, 2], the second iterate produces two images\nof [-2, 2] from [0, 2], and similarly for [-2, 0] under the second iterate.\nThis follows also from\ncomposition of functions, since Q2\n-2 is really Q *Q. Continuing with this logic, we note that there\nwill be 2n disjoint intervals of [-2, 2] which get mapped to [-2, 2] by Qn\n=\n-2\nQ *Q *· · · *Q (n\ntimes). What is really crucial here is that the line y = x will cross the graph of Qn 2n times!\nThe important question now is, what do the fixed points of Qn\n-2 tell us? We know this: they are\nncycles.\nThe really fascinating part of this development is that we have shown that a seemingly chaotic\nfunction has quite a lot of periodic points, which we can find and graph. For example Q2\n= x\n-2(x)\nleads to two 1cycles we already know (1cycles are 2cycles of course), and two new 2cycles,\nx = 2(-1 ±\n√\n5). The following graph gives you a picture of the 8 periodic points we can gather\nfrom the 3rd iterate.\n-2\n-1\n-2\n-1\nFigure 2: y = Q3\n-2(x)\n1.2\nCase 2: c < -2\nAs we have noted, when an orbit leaves the interval defined by the fixed points of Qc(x), the\norbit tends to infinity. When c < -2, this seems to always be the case, as in our experimentations.\nBut we are going to examine more closely the conditions under which an orbit leaves the interval\n[-2, 2]. When c < -2, the minimum of Qc dips below the line y = 2, leaving the 2x2 \"box\" and\ntending to infinity. We want to identify which intervals in [0, 1] will have an orbit which finds it\nway outside of the 2x2 box. There will be an initial interval corresponding to the points in which\nQc intersects y = -2. Call this interval A1. For each x ∈A1 (and in the whole interval for that\nmatter), Q-1(x) consists of two points. Thus, if we define A2 to be the intervals which hit A1 after\nc\n1 iterate, we note that A2 contains two intervals. At each step, the next Ak will have twice the\nnumber of intervals as Ak-1, since each interval in Ak-1 has two preimages.\nThe result of all this is to take\n\ninf\nΛ = [-2, 2] -\nAk.\nThese are the points of [0, 1] that stay in the interval for every iterate. This reduced set contains\nsome points since the fixed points don't go anywhere. We note that at each step the length of\nintervals removed is going to be decreasing. The idea behind this construction is what leads to the\nidea of a Cantor set.\n\nX\nCantor Sets\nFor many undergraduates, the Cantor \"middlethirds\" set is the first, let us say, interesting set\nthey see constructed. With respect to chaos theory, it is a good example of a simple fractal. It also\nlends itself to some interesting counterexamples in measure theory, among other things.\nThe construction is pretty easy to visualize. First, we start off with the closed interval [0, 1] and\nremove the open interval (1\n3, 3). For each remaining interval in the set, remove the open middle\nthird of it. We continue to do this ad infinitum, step by step, ending up with a set C. Making a\ndrawing is really the best way to visualize it.\n2.1\nTernary Expansions\nIn order to discuss the Cantor set, we must briefly introduce ternary expansions. These are\nanalogous to binary and decimal expansions, but as one might guess, we work in base 3 versus base\n2 or 10. For a ternary number 0.a1a2 . . . , this is equivalent to:\ninfai\n3i .\ni=1\nWe will present here a very useful division algorithm for determining expansions in alternate\nbases. It is especially useful for working out expansions very quickly. Like any algorithm, this one\nhas theoretical justification which we will present as well. It is this:\n1. Write the numerator of the rational x you're finding the ternary expansion of on the first line,\nand a period to its right to designate the start of the ternary expansion.\n2. General step: Multiply the number on the previous row by 3, and subtract the largest a b\n·\nfrom it, where b is the denominator of x. This a is the ith ternary place.\n3. Continue in this way until a 0 is reached, or the number being multiplied repeats.\nThis is best elucidated by example.\nExample: x = 31/121\n31/121\n.\n279 - 2 121 = 37\n·\n333 - 2 121 = 91\n·\n273 - 2 121 = 31\n·\nrepitend\nSo the conclusion is that 31/121 = .02022. The justification for this is as follows. If we want to\nknow how many times 1/3 goes into a/b, then\na\nn\n3a\nnb\n3a - nb\n=\n.\nb - 3 = 3b - 3b\n3b\nWe choose the largest n (which could easily be 0) for which 3a- nb is still nonnegative. We proceed\nwith the new positive rational numbers created by this process. For the general step, determining\nhow many times 1/3k goes into a/3k-1b, then as before:\na\nn\n3a - nb\n3k-1b - 3k =\n.\n3kb\n\nP\nAgain the largest n is chosen so that the resulting rational number is nonnegative. This justifies\nthe algorithm.\nProposition 1. If x ∈ C, then x has a ternary expansion consisting of only 0's and 2's.\nProof. We prove this statement by induction.\nIt is clear for the first ternary place, since the\n3, 3) corresponds to those x ∈ [0, 1] of the form 1/3+\ni=2 ai/3i. Let us assume\nremoved segment ( 1\ninf\nit is true for all ternary places of x up the kth place, and we have not yet removed the kth set of\n\"middlethirds\" in constructing the Cantor set. Then x lies in some segment in C, and if x lies in\nthe middle third of that segment, then x is not in C, thus the kth ternary place of x must be a 0\nor a 2. The converse of this proposition is proven to be true in the same way.\nProposition 2. The Cantor set is uncountable.\nProof. Rather than present the (somewhat careless) proof in Devaney's text, we use a simple\ndiagonalization argument.\nFirst, suppose there existed a bijection f : N -→ C (that is, C is\ncountable). Then we can enumerate the elements of C = { c1, c2, . . . } . Let cik denote the kth\nnumber in the ternary expansion of ci. Define a new ternary number x by the rule xk ≡ 2 - ckk,\nwith x = 0.x1x2x3 . . . . Then the ternary expansion of each x differs from that of each c ∈ C\nin at least one place, but since x has a ternary expansion consisting of only 0's and 2's, x ∈ C,\ncontradicting the assumption that f was a bijection."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/5d5d5acb6315a7159a737825d75b9525_lecture05.pdf",
      "content": "Transition to Chaos\nGenya Zaytman\nMarch 9, 2005\nOrbit Diagrams\nWe can plot the orbit diagram of a parametrized function, for example, Qc(x) = x2 + c. In\nan orbit diagram we plot the parameter c on the horizontal axis and the asymptotic orbit of\na given point, such as 0, on the vertical axis. We don't plot the first few iterates, typically\n100 or so, to avoid transient behavior.\nThe reason 0 was chosen as the initial point is because it's the only critical point of Qc. The\nreason this is important will be explained in Chapter 12.\nDefinition. Given F : R\nR, a point x is a critical point of F if F 0(x) = 0. It is degenerate\n→\nif F 00(x) = 0. Otherwise it is nondegenerate.\nWe will look at the orbit for c in the range [-2, 1/4]. Since the orbit of 0 remains in the\ninterval [-2, 2] for these cvalues, the vertical axis will go from -2 to 2.\nNotice that for c between 1/4 and -3/4 there is one point on the line for that value of c. This\nis because for those values we have an attracting fixed point. As c decreases past -3/4 a\nperiod doubling bifurcation occurs. Notice that unlike in the bifurcation diagram, in the orbit\ndiagram we no longer see the repelling fixed point. As c further decreases we see a succession\nof period doubling bifurcations, creating attracting cycles of periods 4, 8, . . . , 2n , . . ..\nIf we look closely, we see that there is some thickness to the line, especially close to the\nbifurcations. This is because, as we observed in Lab 2, the orbit converges slowly to neutral\nfixed points, especially if the derivative is -1.\nObserve that far to the left there is a large white region crossed by three tiny black regions.\nThis is called the period3 window. Looking closely, we can also see a thin slit crossed by five\n\ntiny blank regions. Under magnification we can see other windows with different number of\nthin black regions. Note that in each of these periodn windows we again see a cascade of\nperiod doubling bifurcations. In fact, under magnification they look similar to the original\norbit diagram.\nHence, we see a selfsimilarity in the orbit diagram, magnifying certain\nportions of the orbit diagram produces pictures that look similar to the whole diagram.\nAlso notice that the curves connecting periodic points are continuous in c. These cycles never\njump, which might indicate the existence of other attracting cycles. Since we only compute\none seed, it is still possible there are other attracting cycles to which 0 isn't attracted.\nHowever, these results suggest that there is only one attracting cycle.\nAlso notice the large black region itself. Thus there appear to be many c values for which\nthe orbit of 0 doesn't settle onto any attracting cycle.\nThe orbit diagram for other functions exhibit similar properties.\nThe logistic function\nFλ(x) = λx(1 - x) with λ in the interval [1, 4] and x in the interval [0, 1] gives an orbit\ndiagram that looks like a mirror image of the orbit diagram for Qc.\nThe PeriodDoubling Route to Chaos\nWe can gain insight into the reason for period doubling by looking at the graphs of Qc\nand its iterates for various values of c. In particular we can look at the graphs of Qc with\ncvalues corresponding to the various dynamical behaviors we have studied. The interesting\ndynamics are on the interval [-p+, p+]. Let q be the point to the left of p- mapped to it by\nQc. Then we observe that we can find, different, cvalues such that the graphical analysis\ndiagrams of Q2 over the interval [q, p-] looks similar to the graphical analysis diagrams of\nc\nQc over [-p+, p+].\nSince the graphs of Q2 restricted to the interval [q, p-] resemble those of the quadratic\nc\nfunctions, we expect their second iterates to also look similar. Thus we expect there to be\na subinterval of [q, p-] over which the graph of Q4 looks like Qc and undergoes the same\nc\nsequence of bifurcations as c decreases.\nThis agrees with what we observe in the orbit\ndiagram. Repeating this renormalization process we see that at the nth stage we can find a\ntiny subinterval where Q2n resembles the original function and thus makes a transition from\nc\nsaddlenode (actually, a perioddoubling for the previous period viewed from one side), to\nperioddoubling, and to a chaotic regime. This accounts for the selfsimilarity of the orbit\ndiagram."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/d641aef95e07c1eedd292131bcd10eed_lecture06.pdf",
      "content": "X\n18.091 Lecture 6\nSymbolic Dynamics\nAlejandro Ochoa\nMarch 16, 2005\nIntroduction\nThis is a very interesting topic in the study of chaotic dynamical systems, which\nincludes \"bits and pieces\" from areas such as Analysis, Topology and Group\nTheory. The main purpose of today's lecture is to gain a deeper understanding\nof the chaotic behaviour of the family of functions Qc when c < -2. As we will\nsee, there is a simple space which is homeomorphic to the space of nondivergent\norbits of Qc, and it is much easier to understand the dynamics of this new space.\nItineraries and the sequence space Σ\nRecall that for the family of functions Qc, when c < -2, all the interesting\ndynamics occur on a single interval I = [-p+, p+], where\n1 + √1 - 4c\np+ =\n.\nMoreover, the interval I has a subinterval A1 in which all points leave I in a\nsingle iteration. The set Λ of points in I who's orbits never leave I therefore\nlies in the set I - A1. This set A1 partitions I into two closed sets, I0 and I1,\nand Λ ∈ I0 ∪ I1. Now we can define what an itinerary of a point in Λ is.\nω\nDefinition. Let x ∈ Λ. let Σ be the infinitelydimensional space {0, 1} ,\nthat is, the space of points with an infinite number of coordinates, each of which\nonly take on the values 0 or 1. The itinerary of x is a function from Λ to Σ\nS(x) = (s0, s1, s2, ...)\nsuch that ∀j ∈ N, sj = k if Qj\nc(x) ∈ Ik.\nWe will introduce a metric for Σ to better understand its topology.\nLet\ns = (s0, s1, s2, ...) and t = (t0, t1, t2, ...). The book defines a metric on Σ as\nd(s, t) =\ninf|si\n-\ni\nti| ,\ni=0\n\nv\nu\nu\nt X\nX\nX\nX\nbut we can easily come up with others. For example, a metric that looks more\nsimilar to the familiar Euclidean norm for finitedimensional spaces is\ninf\ni=0\nThe topology induced by both of these metrics on Σ is equivalent, but we will\nnot prove this. The proof that d is in fact a metric is farely trivial and we will\nomit it. Do note that for each i the possible values si - ti can take are only 0\n|\n|\nor 1, so that the infinite sum that defines d is bounded above by\n(si - ti)2\n2i\nd0(s, t) =\n.\ninf\ni=1\n=\n= 2,\n2i\n1 - 2\nso the metric d is well defined (i.e. does not diverge) ∀s, t ∈ Σ.\nThere is an important theorem, the Proximity Theorem, which states\nthat for s, t defined as before, d(t, s) < 1/2n iff si = ti for i ≤ n.\nProof. If si = ti for i ≤ n, then\ninf\ninf\ni=n+1\ni=n+1\nFor the converse, if sj = tj for some j ≤ n, then we must have\nd(s, t) ≥\n,\n2j ≥ 2n\nso it must be the case that si = ti for i ≤ n if we require d(t, s) < 1/2n .\nWe can identify certain special subsets of Σ, like M0 = {s ∈ Σ|s0 = 0},\nand M1 = {s ∈ Σ|s0 = 1}, which partition Σ. We can further partition M0\ninto M00 = {s ∈ Σ|s0 = 0, s1 = 0} and M01 =\ns0 = 0, s1 = 1}, and\n{s ∈ Σ|\nanalogously define M10 and M11, which partition M1. Note that the Proximity\nTheorem tells us that the minimum distance between any point in M0 and any\nother point in M1 has to be 1, and the minimum distance between any point in\nM00 and any point in M01 is 1/2, so that these subsets are totally disconnected.\nIn fact Σ is totally disconnected, which we can notice by inductively defining\nM000, M001, M100, M101, ... and showing that these subsets of Σ are always\nseparated by a nonzero minimum distance by the Proximity Theorem. Recall\nthat the Cantor Set is also totally disconnected, which hints the existence of a\nhomeomorphism between the Cantor Set Λ and our itinerary space Σ.\nThe Shift Map σ\nDefinition. The shift map σ, from Σ to Σ is defined by\nσ(s0, s1, s2, ...) = (s1, s2, s3, ...).\nsi - ti\n|\n2i\n|\nd(s, t) =\n2i = 2n .\n≤\n\nIt is easy to find iterates of σ,\nσn(s0, s1, s2, ...) = (sn, sn+1, sn+2, ...).\nIt is also easy to find the periodic points of σ. For example, the periodic\npoints of period n have the form\n(s0, s1, s2, ..., sn-1, s0, s1, ...).\nTheorem. The shift map σ is a continuous map.\nProof. Suppose we are given s = (s0, s1, s2, ...) and > 0. Choose a value of\nn such that 1/2n < , and let δ = 1/2n+1 . Let t ∈Σ be such that d(s, t) < δ.\nThen, by the Proximity Theorem we must have that si = ti for i < n + 1.\nThis implies that σ(s) and σ(t) agree in their first n coordinates, so a second\napplication of the Proximity Theorem yields that d(σ(s), σ(t)) < , as desired.\nTheorem. For every x ∈Λ it holds that S(Qc(x)) = σ(S(x)).\nProof.\nIt suffices to note that the itinerary of Qc(x) is the same as the\nitinerary of x except the first entry got deleted and the rest were shifted a\ncoordinate back, but this is the same effect σ has on the itinerary of x.\nThe Homeomorphism Theorem\nWe have arrived to the main theorem of this lecture, which states that the\ntopology of both Λ and Σ is essentially the same, so that analyzing the effects\nof σ on the points of Σ is the same as analyzing the effects of Qc on the points\nof Λ, considering the last theorem. It is clearly easier to understand the former,\nso the goal of the lecture is complete.\nTheorem. Λ and Σ are homeomorphic.\nProof. We need to show that the itinerary map S is onetoone onto Σ,\nand that both the maps S and S-1 are continuous. We will only prove this for\n5+2\n√\nc < -\n, although it holds for all c < -2.\nOnetoone. Suppose x, y ∈Λ, x = y, and S(x) = S(y). This means x and\ny are always located in the same interval I0 or I1 for each iteration of Qc. We\nknow Qc maps onetoone into I0 ∪I1, and for the given values of c we also know\nthat Qc\n0 (x) > μ > 1, ∀x ∈I0 ∪I1. For each n, Qn takes the interval [x, y] in a\nc\n|\n|\nn\nn\nonetoone fashion onto [Qc (x), Qc (y)]. Then the mean value theorem implies\nthat\nn\nn\nQc (y) -Qc (x) ≥μ n(y -x),\nbut μn →infas n →inf, implying that the distance between the nth iterates of\nx and y diverges to infinity, even though they are always in the same interval I0\nor I1. This contradiction establishes the proof that S maps into Σ onetoone.\nOnto.\nLet Q-n(J) denote the preimage of J under Qn, and let s =\nc\nc\n(s0, s1, ...) be given. Define\nn\nIs0,s1,...,sn = {x ∈I x ∈Is0, Qc(x) ∈Is1, ..., Qc (x) ∈Isn }.\n|\n\n\\\nThis is the set of all the points in I who's itinerary coincides with that of x in\nthe first n places. Rewriting Is0,s1,...,sn in terms of preimages of other sets, and\nusing identities of preimages, we can deduce that\nIs0,s1,...,sn = Is0 ∩Q-1(Is1)∩... ∩Q-n(Isn ) = Is0 ∩Q-1((Is1)∩... ∩Q-(n-1)(Isn )),\nc\nc\nc\nc\nIs0,s1,...,sn = Is0 ∩ Q-1(Is1,s2,...,sn ).\nc\nThis implies that for every n the set Is0,s1,...,sn is closed.\nWe show this by\ninduction. The set Is0 is clearly closed, namely because it is I0 or I1. Suppose\nIs1,s2,...,sn is closed. Then the preimage of Is1,s2,...,sn is a pair of closed intervals,\none in I0 and the other in I1. Hence,\nIs0,s1,...,sn = Is0 ∩ Q-1(Is1,s2,...,sn )\nc\nis closed. These sets are also nested, for\nIs0,s1,...,sn = Is0,s1,...,sn-1 ∩ Q-n(Isn ) ⊂ Is0,s1,...,sn-1\nc\nholds. This implies that\nIs0,s1,... =\nIs0,s1,...,sn\nn≥0\nis nonempty (recall from your Analysis class that the intersection of arbitrary\nclosed and nested sets is not empty). Hence, there is an x ∈ Is0,s1,... and it is\nsuch that S(x) = s = (s0, s1, ...). This implies every point in Σ is in the image\nof Λ under S, which proves the onto requirement.\nContinuity. Let x ∈ Λ, S(x) = (x0, x1, ...) and > 0 be given. Choose a\nvalue of n such that 1/2n < . Consider Ix0,x1,...,xn , which is a closed interval\nas discussed earlier. Given the finite length of Ix0,x1,...,xn , there clearly exists\na δ such that if x - y\n< δ and y ∈ Λ then y ∈ Ix0,x1,...,xn .\nThis implies\n|\nthat S(y) and S(\n|\nx) have xi = yi for i ≤ n. The proximity theorem implies\nthat d(S(x), S(y)) ≤ , which implies S is continuous. The proof that S-1 is\ncontinuous is very similar, so we omit it, and we are done proving the theorem."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/5dfeedda5f8964bd1a5afce1dc4b174f_lecture07.pdf",
      "content": "18.091 Lecture 7\nChapter 10: Chaos\nLaura Hajj\nApril 2005\nIntroduction\nChapter 10 finally introduces chaos and offers a definition of chaotic dynamical\nsystems. Despite the complexity of chaotic dynamical systems, many chaotic\nsystems can be fully understood through semiconjugacy, which we will also\ndiscuss. Today, we will explore the properties of chaos by examining the shift\nmap and the quadratic map with constant -2 as examples.\nProperties of Chaotic Systems and the Shift\nMap\nChaos has many possible definitions and the scientific community has reached\nno consensus as to which definition is most accurate. This definition was chosen\nfor its simplicity and the ease of its use for verifying systems as chaotic.\nDefinition: A dynamical system F is chaotic if:\n1. Periodic points for F are dense.\n2. F is transitive.\n3. F depends sensitively on initial conditions.\nIn fact, the first two definitional requirements imply the third; although, a proof\nof this claim is left to the reader.\n1. Density is a topological idea which states that if S is dense in X then\nfor each x ∈ X there is a point s ∈ S arbitrarily close to x. Rigorously,\n\nDefinition: Let X be a metric space. A subset S of X, is dense in X if every\npoint of X is a limit point of S, or a point of S.\nSo, for any point f in a chaotic system F one can find a periodic point fn ∈ F\nsuch that d[f, fn] < for all > 0.\n2. Transitivity expands the idea of arbitrary closeness to orbitals by re\nquiring that for any two points in a transitive system there exists an orbit that\ncomes arbitrarily close to both points. That is,\nDefinition: A dynamical system is transitive if for any two points x, y in the\nsystem's space and any > 0 there exists a third point z where d[z, x] ≤\nthat has an orbital which comes within of y.\nWe observe that any dynamical system with a dense orbit is also transitive\nbecause a dense orbit passes arbitrarily close to every point in the system. The\nconverse of this statement, the Baire Category Theorem, is also true and proof\nis left as an exersize to the interested student.\n3. Sensitive Dependence to Initial Conditions requires that for any\nx in the system there are points arbitrarily close to x with orbits that are\neventually far away from x. More formally,\nDefinition: A dynamical system F is sensitively dependent on initial conditions\nif there is a β > 0 such that for any x ∈ F and > 0 there is a y such\nthat d(x, y) ≤ and there is a k such that d[F k(x), F k (y)] ≥ β.\nSensitive dependence on initial conditions causes many problems for applied\nmathematician because the divergence of orbits may cause even the most ac\ncurately measured initial conditions to produce an orbit dramatically different\nfrom the actual initial condition.\nFinally, we fully understand the definition of chaotic dynamical systems.\nIn short, a chaotic map is unpredictable, indecomposable, and yet somewhat\nregular due respectively to sensitivity, transitivity, and density.\nExample: The iteration of the Shift Function on the Sequence Space is chaotic.\nWe will examine the three definitional requirements in detail by using them to\ndirectly verify that the iterated shift function σ on the sequence space Σ as an\nexample of a chaotic system. Recall that the sequence space Σ is defined by\nΣ = {(s0s1s2...) sj = 0 or 1}.\n|\nAlso, the definition of the shift function σ : Σ\nΣ is:\n→\nσ(s0s1s2s3...) = (s1s2s3...).\n\n|\n|\nFirst, will prove that the subset P ⊂ Σ containing all periodic points for σ is\ndense in Σ. To do this, we must simply show that for any s ∈ Σ there exists a\npoint p ∈ P such that d[p, s] ≤ for all . We will do this using the Proximity\nTheorem from last class.\nProximity Theorem: Let t,u ∈ Σ. Then ti = ui for i = 0, 1, ..., n if and only if\nd[t,u] ≤ 1/2n .\nSuppose > 0 is given. Choosing an arbitrary s ∈ Σ, we can construct a\npoint pn = (s0s1s2...sns0s1s2...sn), which shares its first n + 1 entries with s,\nthat has period n + 1 for σ. So, choosing a large enough n and applying the\nProximity Theorem, we find\nd[s, pn] ≤ 1/2n < .\nNow, we will prove that the shift map is transitive by using our observation\nthat a dense orbital implies transitivity. Given an s ∈ Σ and > 0, we again\nchoose a n such that 1/2n < . Then, using the Proximity Theorem, we can\nfind a point s ∈ Σ, whose first n + 1 entries are identical to s, that satisfies\nd[σk (s), s] ≤ 1/2n <\nfor some integer k. This equation is satisfied by the point ˆs, which consists of\nall possible 1digit permutations of 0's and 1's in a block, followed by all 2digit\npermutations in a block, and so on. That is, ˆs = (0 1 00 01 10 11...). Regardless\nof s, ˆs contains the first n + 1 entries, (s0...sn), of s as one of the permutations\nof the block of length n + 1. Suppose the sequence (s0...sn) begins at the j entry\nof ˆs then we can satisfy the above equation by choosing k = j. Thus, we find\nthat the orbit around ˆs of σ comes arbitrarily close to all points in Σ.\nFinally, we will show that the Shift Map is sensitively dependent on initial\nconditions. We will do this by showing that β = 1 satisfies this definitional\nrequirement. Given an s ∈ Σ and an > 0, we again choose an large enough\nn to satisfy 1/2n < . Application of the Proximity Theorem shows that for\nany t = s such that d[s, t] ≤ 1/2n < , d[sk , tk] = sk - tk = 1 for at least one\ninteger k > n. Therefore, d[σk (s), σk(t)] ≥ d[sk , tk] = 1 = β.\nSemiconjugacy and the Quadratic Map\nAlthough we easily directly verified that σ : Σ → Σ is a chaotic dynamical sys\ntem, many systems are much more difficult to analyze, like the quadratic map.\nWe may try to use conjugacies to compare complicated systems to other more\n\neasily understood and thereby indirectly establish chaos. However, the oneto\none requirement for conjugacies is often restrictive and unnecessary for proving\nthat a system is chaotic by comparison. Instead, we will use semiconjugacies to\nconvert the orbits of one system into the orbits of another system.\nDefinition: Suppose A : X\nX and B : Y\nY are two dynamical systems.\n→\n→\nA mapping h : X\nY is a semiconjugacy if h is continuous, onto, at most\n→\nntoone, and satisfies\nh\nA = B h.\n*\n*\nOur analysis of the quadratic map will elucidate this concept but before we\nmove on to our example we need to establish one more prerequisite proposition.\nProposition 1 (The Density Proposition) Suppose F : X\nY is a con\n→\ntinuous map that is onto and suppose also that D ⊂ X is a dense subset. Then\nF(D) is dense in Y .\nProof Given an arbitrary y0 ∈ Y and > 0, we must find a point z ∈ F(D) such\nthat d[y0, z] ≤ . Since F is onto there exists an x0 ∈ X such that F(x0) = y0.\nx ∈ D such that d[x, x0] ≤ δ\nThe density of D in X implies that we choose an ˆ\nˆ\nfor all δ > 0. The continuity of F means that we there exists a δ > 0 such that\nˆ\nx)] ≤ .\nd[F(x), F(xˆ 0)] ≤ . Setting z = x, we find that d[y0, z] = d[F(x0), F(ˆ\nExample: The Quadratic Function Q-2(x) = x2 - 2 is chaotic on [-2, 2].\nWe will explore this example by comparing Q-2 to the function V (x) = 2 x - 2.\n| |\nFirst, we will verify that V (x) is chaotic.\n1. The graph of V n is 2n straight lines, each with a slope of ±2n and a\ndomain interval of length 1/2n+2 . The iterated function V n(x) has fixed points\nin each subinterval I ⊂ [-2, 2] of length 1/2n+2 for all n. Since periodic points\nof V n(x) cycle among fixed points for V n(x) and n can be made arbitrarily\nlarge, the periodic points are dense in [-2, 2].\n2. Given x ∈ I, y ∈ [-2, 2], and > 0, we can choose an n such that the\nlength of I < . Since the V n(I) maps onto [-2, 2] there exists a z ∈ I which\nmaps to y, which implies that V has a dense orbit and is therefore transitive on\n[-2, 2].\n3. For every x ∈ I there is a y ∈ I such that V n(x) - V n(y) ≥ 2, because\n|\n|\neach I maps onto [-2, 2]. Choosing β = 2, we see that V (x) is sensitively\ndependent on initial conditions.\nTo prove that Q-2(x) = x2 - 2 is chaotic we want to show that Q-2(x) is\ndynamically equivalent to V n(x). Consider the function C = -2cos((πx)/2),\n\nwhich maps [-2, 2] onto itself, is at most 2to1 on [-2, 2], and is continuous\nby inspection. Although, C cannot be a homeomorphism between V and Q-2,\nit does carry orbits of V to orbits of Q-2. Since C is continuous and onto,\nthe Density Proposition yields that Q-2's periodic points are dense in Q-2 and\nthat there exists a dense orbit for Q-2. Because V n maps any interval of length\n1/(2n-2) ⊂ [-2, 2] onto [-2, 2] and C carries orbits of V to Q-2, Q-2 must do\nthe same, which shows that Q-2 is sensitively dependent on initial conditions."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/0056b9ed83fa75969bccc1ba7628ce8d_lecture08.pdf",
      "content": "Lecture Notes: Chapter 11\nSarkovskii's Theorem\nJeremy Hurwitz 18.091 April 6, 2005\nApril 13, 2005\nPeriod 3 Implies Chaos\nTheorem 1 (The Period 3 Theorem). Suppose F : < → < is continuous. Suppose also that F has\na periodic point of prime period 3. Then F also has periodic points of all other periods.\nUseful Observations The following statements will be helpful in proving Theorem 1. Pictorial\ndemonstrations of both are in the textbook on page 135, figures 11.1 and 11.2.\nObservation 1. Suppose I = [a, b] and J = [c, d] are closed intervals and I ⊂ J. If F(I) ⊃ J,\nthen F has a fixed point in I.\nThis follows immediately from the intermediate value theorem. Since I ⊂ J, the graph of F\nmust cross the diagonal. The fixed point, of course, does not need to be unique.\nObservation 2. Suppose I and J are two closed intervals and F(I) ⊃ J. Then there is a closed\nsubinterval I0 ⊂ I such that F(I0) = J.\nNote that we do not assume that I ⊂ J in this case.\nProof\nSuppose that the 3cycle of F is given by\na 7→ b 7→ c 7→ a 7→ . . .\n(1)\nAssume that a is the leftmost point on the orbit. There are two possibilities then for the relative\npositions of b and c. We will assume that a < b < c. The other case is proven similarly.\nLet I0 = [a, b] and I1 = [b, c]. Since F(a) = b, F(b) = c, and F is continuous, by the Intermediate\nValue Theorem\nF(I0) ⊃ I0.\n(2)\nSimilarly, since F(b) = c and F(c) = a,\nF(I1) ⊃ I0 ∪ I1.\n(3)\nWe will next construct cycles of length 1 and 2. Then we will construct all cycles of length\nn > 3.\nN=1 Since F(I1) ⊃ I1 (by (3)), there is a fixed point in I1 (Observation 1).\n\nN=2 Since F(I0) ⊃ I1 (by (2)) and F(I1) ⊃ I0 (by (3)), F 2(I0) ⊃ I0. So there is a fixed point of\nF 2 in I0 (Observation 1). So F has a 2cycle.\nCycles of Length Greater Than 3\nTo find a periodic point with period n, we will invoke Observation 2 a total of n times.\nSince F(I1) ⊃ I1, there is a closed subinterval A1 ⊂ I1 such that F(A1) = I1.\nAgain invoking Observation 2, since F(A1) ⊃ A1, we can find a closed subinterval A2 ⊂ A1\nsuch that F(A2) = A1. Note that by construction, A2 ⊂ A1 ⊂ I1.\nRepeat this process n - 2 times. We this end up with a collection of closed subintervals\nAn-2 ⊂ An-3 ⊂ . . . ⊂ A2 ⊂ A1 ⊂ I1\n(4)\nNote that F n-2(An-2) = I1 and An-2 ⊂ I1.\nSince F(I0) ⊃ I1 ⊃ An-2), there is a closed subinterval An-1 ⊂ I0 such that F(An-1) = An-2.\nLastly, since F(I1) ⊃ I0 ⊃ An-1, there is a closed subinterval An ⊂ I1 such that F(An) = An-1.\nWe have now constructed a series of closed intervals such that\nA\nn-2 . . . 7→ A2 7→ A1 7→ I1.\n(5)\nn 7→ An-1 7→ A\nSince F n(An) = I1 and An ⊂ I1, we may invoke Observation 1 to conclude that there is a point,\nx0 fixed by F n .\nWe must now show that the orbit of x0 has prime period n. Note that x0 6∈ I0 ∩ I1, since\nI0 ∩ I1 = {b} and F(b) = c 6∈ I0, whereas F(x0) ∈ F(An ⊂ I0.\nF(x0) ∈ I0, but all other iterations lie in I1. So x0 cannot have period less than n.\nThis completes the proof.\nSarkovskii's Theorem\n2.1\nThe Sarkovskii Ordering of the Natural Numbers\nThe following ordering, read from lefttoright, then toptobottom, is known as Sarkovskii's Or\ndering of the Natural Numbers.\n3, 5, 7, 9, . . .\n3, 2 · 5, 2 · 7, . . .\n2 ·\n22 3, 22 5, 22 7, . . .\n·\n·\n·\n23 3, 23 5, 23 7, . . .\n·\n·\n·\n. . .\n. . . , 2n , . . . , 23 , 22 , 2, 1\n\n2.2\nSarkovskii's Theorem\nTheorem 2 (Sarkovskii's Theorem). Suppose F : < →< is continuous. Suppose that F has a\nperiodic point of period n and that n precedes k in the Sarkovskii ordering. Then F also has a\nperiodic point of prime period k.\nThe proof is very similar to the proof for n = 3 which we did above. The converse (which is\nstated here without proof) turns out to be also true:\nTheorem 3. There is a continuous function F : < →< which has a cycle of period n, but no\ncycles of any period that precedes n in the Sarkovskii ordering.\n2.3\nComments about Sarkovskii's Theorem\n1. Since the number 2n form the tail of the ordering, any function that only has a finite number\nof cycles will have all cycles with period equal to a power of 2. This is part of why we see\nperiod doubling as a family of functions transitions to chaos.\n2. The theorem only applies to the real number line. For example, the function defined on a\ncircle that rotates all points by a fixed angle 2π/n has periodic points of period n but no\nothers.\n3. The infinity of other cycles doesn't appear on the orbit diagram of Qλ(x) because the others\nare repelling cycles"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/26d5f1d1bf3e70cfe2f036c5181eba17_lecture09.pdf",
      "content": "The Schwarzian Derivative & the Critical Orbit\nWes McKinney 18.091 20 April 2005\nSchwarzian Derivative\nWhat we introduce here is a very strange looking derivative, but it turns out to give some useful\ninformation about the behavior of many functions, particularly at their critical points.\nDefinition: The Schwarzian derivative (SD for short) of f is\nSf(x) = f000(x)\nf00(x)2\n.\nf0(x) - 2\nf0(x)\nDevaney's text has a few example of functions that we have been examining which have negative\nSD, and in those cases the SD at the critical points is -inf. As it will turn out, this property of\nhaving a negative SD is important.\nProposition: Let p(x) be a polynomial and suppose all of the roots of p0(x) are distinct and\nreal. Then Sp < 0.\nProof: Since all of the roots of p0 are distinct, we can factor p0 as p0(x) = α(x-β1)·· · ··(x-βn),\nwhere β1, . . . , βn are the n distinct roots of p0, with each βi ∈ R. Taking the logarithm of both\nsides of this equation allows us to split this product up into a summation. Differentiating kills off\nthe constant, and dividing through by p0 gives:\nX\np00(x) =\nn\np0(x)\nx - βi\n.\ni=1\nUsing the quotient rule to differentiate again, we see:\np000(x)p0(x) - (p00(x))2\np000(x)\np00(x)2\n=\n(p0(x))2\np0(x) -\np0(x)\nn\nX\n=\n.\n-\n(x - βi)2\ni=1\nThis gives\n\n!2\nn\nn\nX\nX\n< 0.\nSp(x) = -\n(x - βi)2 - 2\nx - βi\ni=1\ni=1\nChain Rule for Schwarzian Derivatives: Let f and g be two functions, then\nS(f * g)(x) + Sf(g(x)) · (g0(x))2 + Sg(x).\nProof: Omitted, see the text.\nCorollary: Suppose Sf < 0 and Sg < 0, then S(f * g) < 0. Along these liens, if Sf < 0, then\nSfn < 0.\nProof: This is a direct consequence of the chain rule for the SD, since Sf(g(x)) < 0 and Sg(x) < 0\n∀ x.\nHere is one of the more interesting applications of the SD:\n\nSchwarzian MaxMin Principle: Suppose Sf < 0, then f0 cannot have a positive local\nminimum or a negative local maximum.\nProof: Let x0 be a critical point of f0. This means that f00(x0) = 0. Suppose that f0(x0) =6\n0,\nthen\nSf(x0) = f000(x0) < 0.\nf0(x0)\nNow suppose f0 has a positive local minimum at x0, then by elementary calculus, f000(x0) ≥ 0,\nbut if x0 is a local minimum then f0(x0) > 0, which would cause Sf(x0) ≥ 0, contradiction.\nConsidering a negative local maximum at x0 gives a similar contradiction.\nFigure 12.1 in the text offers types of graphs which cannot occur due to this MaxMin Principle.\nCritical Point and Basins of Attraction\nNow we will use the SD to actually analyze the behavior of some functions. First, we need to define\nsome things.\nDefinition: If x0 is an attracting fixed point for a function f, the basin of attraction of x0\nis of the set of all points whose orbits tend to x0. The immediate basin of attraction is the\nlargest interval containing x0 that lies in the basin of attraction.\nIt it usually the case that the immediate basin is smaller than the full basin, but it is possible\nfor them to be the same. If f(x) = x2, for example, (-1, 1) is the basin of attraction of 0, and it\nis also the immediate basin. In terms of the SD, we can now say the following:\nTheorem: Suppose f has negative SD. If x0 is an attracting periodic point of f, then either\nthe immediate basin of attraction of x0 extends to +inf or -inf, or else there is a critical point of\nf whose orbit is attracted to the orbit of x0.\nProof: Omitted, though the text offers a proof of one of the simple cases of the theorem.\nAs an immediate application of this theorem to the quadratic map Qc, we note that if |x| is large\nenough, then the orbit tends to ±inf. Thus, the second part of the theorem applies and we conclude\nthat Qc has at most one attracting cycle since Qc has only one critical point, and SQc < 0.\nThis theorem helps explain why critical points are used to plot orbit diagrams, since the critical\npoint will \"find\" the attracting cycles of the function.\nExample: Consider Aλ(x) = λ arctan x. We have then that\nλ\nAλ\n0 (x) =\n2 .\n1 + x\nIf λ = 0, then Aλ\n0 (x) = 0, so Aλ has no critical points. If |λ| < 1, then 0 is an attracting fixed\npoint, with the immediate basin of attraction being the whole real line. If λ > 1, then Aλ has two\nattracting fixed points, and the basins extend to infinity. Along the same lines, when λ < -1, Aλ\nhas an attracting 2cycle , and the basins extent to infinity."
    },
    {
      "category": "Resource",
      "title": "sarintro.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/2ea3f006fed45bd81a071cc4c55a2a06_sarintro.pdf",
      "content": "Converse of Sarkovskii's Theorem\nWes McKinney\nMay 10, 2005\nThe Period Three Theorem and its remarkable generalization, Sarkovskii's the\norem, provide a great deal of information about the periodic behavior of the iterates of\ncontinuous functions. First, we recall the Sarkovskii ordering of the positive integers.\n3, 5, 7, 9, · · ·\n2 3, 2 5, 2 7,\n·\n·\n·\n· · ·\n. . .\n2m 3, 2m 5, 2m 7,\n·\n·\n·\n· · ·\n. . .\n, 22 , 2, 1.\n· · · , 23\nWe write xBy if x precedes y in this ordering. This ordering allows us to state Sarkovskii's\nTheorem.\nTheorem 1 (Sarkovskii's Theorem). Let f : R\nR be a continuous function, and\n→\nsuppose f has a periodic point of prime period k. If k B l in the Sarkovskii ordering, then f\nalso has a periodic point of period l.\nProof: The majority of this theorem is proved in Devaney's text, namely the cases k odd\nand k = 2m . He leaves the case of k = p 2m, for p odd, to the reader, so we will prove this\n·\nhere. Suppose k = p 2m, then consider f 2m (2mth iterate of f). Then by the odd case of\nSarkovskii's theorem,\n·\nf 2m has points with prime period n 2r (n odd), where either r ≥ 1,\n·\nor n is an odd integer greater than p (r could possibly be 0 if n > p). As a result, f has\npoints with prime period n 2m+r for these same n and r. Along these lines, f will also have\n·\na point of prime period 2m+1, and by the 2l case of Sarkovskii's theorem, f will have points\nof prime period 2k for all k < m + 1.\nOur goal is to show that the \"converse\" of this theorem is actually true, that is:\nTheorem 2 (Sarkovskii Converse). For each k ∈ Z+, there exists f : R\nR continuous\n→\nsuch that for all l B k in the Sarkovskii ordering, f has a periodic point of prime period k\nbut none of period l.\nWe will be able to prove this converse once we exhibit four explicit constructions encom\npassing the possible numbers in the Sarkovskii ordering. We will present these constructions\nin a series of four lemmas, after which the theorem will follow.\n\n(\nLemma 1. For each n ∈ Z+ , there exists f : I\nI continuous from a closed interval to\n→\nitself such that f has a point of prime period 2n + 1 but none of period 2n -1.\nProof: Define the following function:\nf =\n⎧\n⎪\n⎨\n⎪\n⎩\nnx + 1\nx ∈ [1, 2]\n-x + 2n + 3\nx ∈ [2, n + 1]\n-2x + 3n + 4\n[n + 1, n + 2]\nx ∈\n-x + 2n + 2\n[n + 2, 2n + 1]\nx ∈\nFirst, we note the orbit of 1 under f is n + 1, n + 2, n, n + 3, n - 1, n + 4, n - 2, n +\n5, . . . , 2, 2n + 1, 1, so that 1 is a periodic point of prime period 2n + 1. Now we show that\nf 2n-1([j, j + 1]) ∩(j, j + 1) = ∅ except for [n + 1, n + 2]. Under repeated mapping of f for\nexample:\n[1, 2] → [n + 1, 2n + 1] → [1, n + 2] → [n, 2n + 1]\n→ [1, n + 3] → [n -1, 2n + 1]\n] → [2, 2n + 1].\n→ · · · → [1, 2n\nSimilarly, [2, 3] → [2n, 2n + 1] → [1, 2] → · · · → [3, 2n + 1]. And in general [j, j + 1] → · · · →\n[j + 1, 2n + 1]. Hence none of these intervals have periodic points of period 2n -1. When\nwe map [n + 1, n + 2], we get [n, n + 2] → [n, n + 3] → [n -1, n + 3] → · · · → [1, 2n + 1],\nso that f 2n-1([n + 1, n + 2]) has a fixed point in the interval. But we have that f 2n-1 is\nmonotonically decreasing on that interval, since f is only increasing on [1, 2], hence the fixed\npoint of f 2n-1 is also the fixed point of f, which means that it is not a periodic point of\nprime period 2n -1. It follows that f does not have any such points of period 2n -1.\nLemma 2. For each k ∈ Z+ , there exists f : I → I continuous such that f has a point of\nprime period 2k(2n + 1) but none of period 2k(2n -1).\nProof: In order to exhibit such a function, we first devise a way to \"double\" the period\nof a point in a map. We do so by dividing tripling the size of the interval on which f is\ndefined, then squeezing the graph of f on I into the upperleft corner of 3I × 3I. We then\nextend f piecewise linearly on the rest of the interval 3I in the following way. Thus, we\ndefine Double(f) in the following way:\nF(x) =\nf(x) + 2h\nx ∈ [0, h]\nx -2h\nx ∈ [h, 3h]\nand F is linear between h and 3h, with f being originally defined on [0, h]. Now, if x ∈ [0, h],\nthen F(x) = f(x) + 2h ∈ [h, 3h], so that F 2(x) = f(x). We note that F([0, h]) ⊂ [h, 3h],\nand F([h, 3h]) = [0, h], so that points in either of those intervals are mapped back and forth\nbetween those intervals. By the first property of F that we proved, if x ∈ [0, h] is a periodic\npoint of prime period n of f, then since F 2(x) = f(x), it is evident that this x will have\nperiod 2n under F. Conversely, suppose F has a point q ∈ [0, h] of prime period 2n. We\nnote that F 2(q) = q0 implies f(q) = q0 by the above. Thus q has prime period n for f. For\nexample if f originally had a point of prime period 5 but not 3, this guarantees that F will\n\nhave a point of period 10 and not 6 (otherwise f would have a point of period 3, which it\ndoes not). Finally, since F is monotone decreasing on [h, 3h], there are no periodic points in\nthis interval.\nTo complete the proof, we double f from the previous lemma k times to get a function\nwith a periodic point of of period 2k(2n + 1), but not of 2k(2n - 1).\nLemma 3. For each n ∈ Z+, there exists f : I → I continuous such that f has a point of\nperiod 2n but not of 2n+1 .\nProof: We start by constructing a function that has a point of period 1 but not period\n2. Let f(x) = x, with x ∈ [0, 1]. Then x is monotone increasing and hence has no points of\nperiod greater than 1. Now by repeated application of the doubling construction from the\nprevious lemma, we obtain a function with period 2n but not 2n+1 .\nLemma 4. For each n ∈ Z+, there exists f : I → I continuous such that f has a point of\nperiod 3 2n but none of (2m - 1)2n-1, for all m ∈ Z+ .\n·\nProof: We define a function f : [1, 3] → [1, 3] with f(1) = 2, f(2) = 3, f(3) = 1, with\nlinearity between these points. Now f has a 3 cycle, so now if we double f, we obtain a point\nof period 6, and we must show that this F does not have any points of odd period. This\nfollows very easily since F([1, 3]) = [5, 7], F([5, 7]) = [1, 3], and F is monotone decreasing\non [3, 5], hence the orbit of a point returns to [1, 3] every other iterate, so that the period of\nany periodic point must be even.\nNow we use induction and the result of Lemma 2, supposing that we have already proved\nthis for n - 1. Suppose we have doubled f n times, so that this new Fn has a periodic point\nof period 2n · 3. Now suppose that Fn had a periodic point of period 2n-1(2m - 1) for some\npositive m ∈ Z. Then Fn-1 (the result of doubling f n- 1 times) must have a periodic point\nof period 2n-2(2m - 1), which contradicts our inductive hypothesis. Thus, F does not have\nany points of period 2n-1(2m - 1) for any m.\nNow having proved these lemmas we can prove the Sarkovskii Converse. We note that\nthe cases we have identified encompass the possible k's in the Sarkovskii ordering. These\nlemmas are sufficient since if any of the constructed functions had a periodic point two steps\nbefore k (where k is one of the numbers in the lemmas), then by Sarkovskii's Theorem, that\nfunction would have a periodic point of period l, where l immediately precedes k, which we\nknow not to be true by construction. Thus, the converse is proved.\nReferences\nDevaney, Robert. An Introduction to Chaotic Dynamical Systems. Benjamin/Cummings,\n1996."
    },
    {
      "category": "Resource",
      "title": "sarkcomplete.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/59805a43612f074dd40fb4ff985e50a6_sarkcomplete.pdf",
      "content": "Sarkovskii's Theorem Part 1\nAlan Dunn\nMay 11, 2005\nThe goal of this paper is to prove Sarkovskii's theorem and its con\nverse, important results in the study of onedimensional dynamical systems.\nSarkovskii's theorem is important because its hypothesis is very easy to sat\nisfy, and yet it provides an interesting conclusion about the periodic points\nof functions. Furthermore, in proving the converse, we see a number of in\nteresting examples of onedimensional dynamical systems that help to guide\nour intuition.\nWe first need a brief piece of preliminary notation and then we can state\nand prove Sarkovskii's theorem and converse.\nGiven the following sequence:\n3, 5, 7, . . . , 2 3, 2 5, . . . , 22 3, 22 5, . . . , 2n 3, 2n 5, . . . , 23 , 22 , 2, 1\n·\n·\n·\n·\n·\n·\nWe define an ordering on the natural numbers by a > b if a appears\nbefore b in the above sequence.\nSarkovskii's Theorem:\nSuppose f : R\nR is continuous. Suppose f\n→\nhas a periodic point of prime period k. If k > l in the previously defined\nordering, then f also has a periodic point of prime period l.\nWe have three main cases to prove: f has a periodic point q where in\none case q has odd prime period, in another q has a prime period of 2m for\nsome m ∈ Z+, and in the last q has a prime period of p · 2m for p odd and\n1 ≤ m. For a proof of the first two cases, see An Introduction to Chaotic\nDynamical Systems by Robert Devaney.\nIn this paper, we will prove the case where f has a periodic point with\nprime period p · 2m for p odd and 1 ≤ m given the case for prime period p\nwith p odd and the case for prime period 2a .\n\nProof:\nSuppose that f has a periodic point with prime period p · 2m for\np odd and 1 ≤ m. Then f2m has a periodic point with prime period p, and\nby the odd p case of Sarkovskii's theorem it has periodic points with prime\nperiod q · 2a for all odd natural numbers q and whole numbers a such that\nq > p or a ≥ 1. Thus f has periodic points of prime period q · 2a for all\nodd natural numbers q and whole numbers a such that q > p or a > m. f\nmust thus have a periodic point of prime period 2m+1 , and thus by the 2a\ncase of Sarkovskii's theorem it also has periodic points of prime period 2a\nfor 0 ≤ a ≤ m.\nConverse of Sarkovskii's Theorem:\nIf k > l in the previously defined\nordering, then there exists a continuous function f : R\nR with a periodic\n→\npoint of prime period l but none periodic points of prime period k.\nWe are free to instead find functions f : I\nI, with I = [0, 1] that have\n→\nthis property as they can easily be extended to the real numbers. I (\"the\ninterval\") will continue to be defined as it is here throughout the rest of the\npaper.\nThe converse case can be reduced to four lemmas by observing the fol\nlowing:\nIf a continuous function from the interval to itself has no periodic points\nof prime period b then it has no periodic points of prime period a ¿ b (in\nthe above ordering), since if it did, then Sarkovskii's theorem would imply\nthat it had a periodic point of prime period b. Thus we only need to prove\nthe following:\nLemma 1:\nA continuous function f : I\nI exists such that f has a\n→\nperiodic point of prime period 2n + 1 but not one of prime period 2n - 1 for\neach n ∈ Z+ .\nProof:\nDefine f : I\nI as follows:\n→\nf =\n⎧\n⎪\n⎪\n⎨\n⎪\n\n⎪\n⎩\n1 + nx\nx ∈ [0, 1 ],\n2n\n1 + 2\nn - x\nx ∈ [2n , 2],\n1 + 1 + 2\nn - 2x\nx ∈ [1\nn+1 ],\n2,\n2n\n1 - x\nx ∈ [n+1\n2n , 1].\nf is continuous by definition, and I claim 0 is part of a 2n + 1 cycle. I\nclaim fi(0) has values as follows:\n\n⎧\n⎪\n⎨\n⎪\n⎩\ni = 0,\ni\nfi(0) =\n2 - 2n [2](∈ [2n , 2])\ni odd\ni\n1 + 1 [2](∈ [n+1 , 1])\ni even, i = 0.\n2n\n2n\nfor 0 ≤ i ≤ 2n and f2n+1(0) = 0, where [x] is the greatest integer less\nthan or equal to x. This can be seen by induction: f(0) = 1\n2, thus the n\nodd case is true for i = 1. Also, f(1\n2) = 1 +\n1 , thus the n even case is\n2n\ntrue for i = 2. Now we show the inductive cases of the n even and n odd\ncases. Using the definition of f, i odd → fi+2(0) = 1 - (1 + 2\nn - fi(0)) =\n1 = 1\ni+2\nfi(0)-\n2 - 2n [ 2 ]. Similarly, i even → fi+2(0) = 1+ 2n - (1- fi(0)) =\n2n 1 = 1 + 1 [i+2\nfi(0) +\n2 ].\n2n\n2n\nNow we must show that f has no cycles of prime period 2n - 1. For\nthis discussion, assume a is an integer, 0 ≤ a < n. Since f is piecewise\nlinear, we can say that f2a+1([ a\na+1 ]) = [2, 1] and f2(n-a)([1 +\na\n2n , 2n\n2n , 2 +\na+1 ]) = [ 2, 1] using our previous knowledge of the orbit of 0. We can also\n2n\nsay that f2a([1\na\n2, 1]) = [0, 1 +\na ].\nThus\n2, 1]) = [2 - 2n , 1] and f2a-1([1\na+1 ]) =\n2n\nf2n-1([ a\na+1 ]) = [2 - n-a-1 , 1] = [a+1 , 1] and f2n-1([1\n2n , 2n\n2n\n2n\n2 + 2\na\nn , 2 +\n2n\n[0, 1 + a ]. Thus f2n-1 has no fixed points on [0, 1] ∪ [1 +\n1 , 1] (since we\n2n\n2n\ni\nknow f2n-1(2n ) =6\ni for all integers i, 0 ≤ i ≤ 2n).\n2n\n1 +\n1 ].\nWe must now consider possible fixed points for f2n-1 on [ 2, 2\n2n\n1 + 1\nf2n-1([1\n2,\n]) = I, and thus f2n-1 must have at least one fixed point on\n2n\n[2,\n1 + 1 ]. But, f is monotonically decreasing on [2n , 1], and thus by using\n2n\n1 + 1 ]\nknowledge of the orbit of 0 (which tells us the successive images of [2, 2\n2n\nunder f) we know that f2n-1 is monotonically decreasing on [2,\n1 + 1 ] and\n2n\nthus there is at maximum one fixed point for f2n-1 in this interval, which\nmust also be a fixed point for f (f must have at least one fixed point in\n[2,\n] since f([1\n1 + 1 ]) and thus is not a periodic point\n1 + 1\n2, 1 + 1 ]) ⊃ [2,\n2n\n2n\n2n\nof prime period 2n-1. Thus f has no periodic points of prime period 2n-1.\nLemma 2:\nA continuous function f : I\nI exists such that f has a\n→\nperiodic point of prime period 2k(2n+1) but not one of prime period 2k(2n-\n1) for each n, k ∈ Z+ .\nProof:\nWe will introduce a way of \"doubling\" a continuous function f :\nI\nI. Given such an f, define the doubling, D(f), of f as follows:\n→\n\nF is continuous and from I to I since f has these properties. An impor\n, 1].\n]\n, 1]\nf has a periodic point of prime period n if and only if D(f) has a periodic\npoint of prime period 2n:\nIf f has a periodic point of prime period n, D(f) has a periodic point\nof prime period 2n by the properties of F we have just shown. Suppose,\n],\n], we have two options: there can be at most one fixed point in [\nor else the orbit of p alternates between points in [0, ] and [ , 0]. Thus we\nhave a subsequence of the orbit of p, call this pi (starting with i = 0), such\nthat F 2(pi) = pi+1, pn = p0 (F 2n(p0) = p0, and also pn is the first pi to\nequal p0 since p0 has prime period 2n for F). Then the point 3p0 has an\norbit 3pi under f, and thus has a prime period of n.\nThus to create a continuous function F : I\nI with a point of prime\n→\nperiod 2k(2n+1) but not one of prime period 2k(2n- 1), we need only select\na function f : I\nI as above with a point of prime period 2n + 1 but not\n→\none of prime period 2n - 1 and take F = Dk(f).\nLemma 3:\nA continuous function f : I\nI exists such that f has a\n→\nperiodic point of prime period 2n but not one of prime period 2n+1 for\nn ∈ Z+ .\nProof:\nFirst we want to construct a function with a fixed point (prime\nperiod 1) but no periodic points of prime period 2. A function that evidently\nhas this property is f(x) = x, since every point is fixed. Then we can use\nthe doubling construction from the previous lemma to construct functions\nwith periodic points of prime period 2n but not periodic points of prime\nperiod 2n+1 .\nLemma 4:\nA continuous function f : I\nI exists such that f has a\n→\nperiodic point of prime period 3·2n but not one of prime period (2m-1)2n-1\nfor each n ∈ Z+ and any m ∈ Z+ .\n+\n=\nf(1) +\nThen F 2(x) =\n=\nf(3x)\n[ , 1] and F([ , 1]) = [0,\n+\nx -\nF(x) =\nF([0,\n,\non [\nf(3x) ∈ [\nI claim that\nconversely D(f) has a periodic point p of prime period 2n (n ∈ Z). Since\n]) ⊂\n], and F is monotonically decreasing\n,\n.\nb\nx ∈ [0, ]\n)\n, then\n(a\nb\nF\n,\n=\n] then F(x)\n)\nx ∈ [\n[\nx ∈\n(2 - 3x)(\n⎪\n⎩\ntant property to note is that if x ∈ [0,\nf(3x), and thus if f(a)\n⎧\n⎪\n⎨\n\n(\nProof:\nFirst we want to construct a function with a periodic point of prime\nperiod 6 =\n3 but no periodic points of odd period (greater than 1). Define\n2·\nf : I\nI as follows:\n→\nf(x) =\n+ x\nx ∈ [0, 1]\n-2(x\n2) + 1\nx ∈ [2, 1]\n-\nf has a periodic point of prime period 3 (the point is x = 0). Now con\nsider F = D(f). F has a periodic point of prime period 6. By previous logic,\nif F has a periodic point it must be either of even period or a fixed point.\nThus F has no periodic points of odd period. To produce functions with pe\nriodic points of prime period 3 2n but none of prime periods (2m- 1) 2n-1\n·\n·\nwe need only take Dn-1(F).\n(Note: it is not immediately evident why the last lemma must be as\nstated. The reason why this is the final case is that for each of the previous\nthree lemmas there is a well defined number \"immediately preceding\" the\nnumber in question in the defined ordering; that is, a number a immediately\nprecedes b if a < b and c < b\nc = a or c < a. There is no number\n→\nimmediately preceding 3 · 2n for n ∈ Z+ . Thus if a continuous function f\non the interval has a periodic point of prime period 3 · 2n, in order for it to\nhave no periodic points of prime period a < 3 2n, it is necessary that is it\n·\nhave no periodic points of prime period (2m - 1)\n2n-1 for any m ∈ Z+ ,\n·\nas opposed to the other three cases in which since there is an immediately\npreceding number, we only have to prove the function has no periodic points\nwith a prime period equal to this immediately preceding number.)"
    },
    {
      "category": "Resource",
      "title": "sarkovskii_final.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/3b6e11ed820e9661dfa19d6a9cca1107_sarkovskii_final.pdf",
      "content": "Sarkovskii's Theorem\nGenya Zaytman\nMay 11, 2005\nIntroduction\nSarkovskii's theorem is a remarkable result in dynamical systems, specifically in the weakness\nof its hypotheses. For continuous maps from the real line to itself, the theorem lets us deduce\nthe existence of cycles of certain periods from the existence of cycles of a different period.\nA special case of the theorem states that if the function has a cycle of period three it has\ncycles of all periods. To state the general theorem we must first define the Sarkovskii ordering\non the natural numbers:\n3 ⊲ 5 ⊲ 7 ⊲ · · · ⊲ 2 · 3 ⊲ 2 · 5 ⊲ 2 · 7 ⊲ · · · ⊲ 22 · 3 ⊲ 22 · 5 ⊲ 22 · 7 ⊲ · · ·\n⊲ 23 · 3 ⊲ 23 · 5 ⊲ 23 · 7 ⊲ · · ·· · · ⊲ 23 ⊲ 22 ⊲ 2 ⊲ 1.\nThat is, first all odd numbers greater than one in increasing order, followed by 2 times\nthose numbers, then by 22 times them, then 23, and so on. The lists all the natural numbers\nexcept powers of 2. Then one lists all the powers of 2 in decreasing order. Using this notation\nSarkovskii's theorem states:\nTheorem 1.1. If f : R → R is a continuous function that has a cycle of period n, than it\nhas cycles of all periods that follow n in the Sarkovskii order.\nThe converse of Sarkovskii's theorem is also true.\nTheorem 1.2. For each natural number n there exists a continuous function f : R → R\nthat has a cycle of period n but no cycles of periods that precede n in the Sarkovskii order.\n[Devaney] has a partial proof of Sarkovskii's theorem and its converse, here we finish the\nproof.\n\nSarkovskii's Theorem\nIn ([Devaney], section 1.10) Sarkovskii's theorem was shown for the cases when n is odd and\nwhen n is a power of 2. We now prove the case when n = p2m .\nProof. We may assume f has no cycles of period q2k with q > 1 and odd and k < m. Now\nsince f has a cycle of period n = p2m , f 2m has a cycle of period p. Therefore by the case\nwith n = p it has cycles of all odd periods greater than p and all even periods. A cycle of\nf 2m of period q2l with l> 0 corresponds to a cycle of period q2k+l for f, and a cycle of\nodd period q > 1 for f 2m corresponds to one for f of period q2k with k ≤m. By our initial\nassumption this period must be q2m . Finally to see that we have cycles for all powers of 2\nnotice that the above argument has shown that we have cycles for all 2k with k > m, hence\napplying the case with n = 2m+1 gives us all powers of 2.\nConverse\nLemma 3.1. For each natural number n > 1, there exists a continuous function, f, with a\ncycle of period 2n + 1 but not one of 2n -1.\nProof. Define the map f : [0, 2n] →[0, 2n] on the integers by\nf(0) = n\nf(k) = 2n + 1 -k\nfor 0 < k ≤n\nf(k) = 2n -k\nfor n < k ≤2n\nso that 1 has period 2n + 1, specifically (0, n, n + 1, n -1, n + 2, n -2, n + 3, · · · , 2n -1,\n1, 2n). Let f be linear between these integers.\nNote that p = n + 3 is a fixed point of f. Also observe that if x > p we must have f(x) < p,\nand 1 < x < p implies f(x) > p. Hence, any cycle with odd period greater than 1 must\ncontain a point in the interval [0, 1]. However, it is easy to check by induction that for\n0 ≤k < n, f 2k+1([0, 1]) = [n -k, 2n]. In particular, f 2n-1([0, 1]) = [1, 2n]. So f cannot have\nany cycles of period 2n -1.\nLemma 3.2. Let S be the set of cycle periods of a continuous function f. Than there exists\na function F the set of whose cycle periods is precisely {1} ∪{2k|k ∈S}.\nProof. This is shown in ([Devaney], pp. 67-68).\n\nWe are now ready to prove the converse of Sarkovskii's theorem.\nProof. First notice that if n has an immediate predecessor in the Sarkovskii ordering it\nsuffices to show there exists a function with a cycle of period n but not one whose period\nprecedes n in the Sarkovskii ordering.\nCase 1 (n is odd and greater than 1): this is just lemma 3.1.\nCase 2 (n = m2k where m > 3 is odd): we will show this by induction on k. For k = 0,\nthis reduces to case 1. Now suppose f has a cycle of period m2k-1 but not one of period\n(m - 2)2k-1 . Then by lemma 3.2 there exists a function with a period-m2k cycle but not a\nperiod-(m - 2)2k cycle.\nCase 3 (n = 3 · 2k): we will also show this case by induction on k. We need a function that\nhas a cycle of period 3 · 2k but no cycles of period m2k-1 for odd m > 1. This is obvious\nif k = 0 since there clearly exists a function with a cycle of period 3 and cycle must have\nintegral periods. If this is true for 3 · 2k-1, this must also be true for 3 · 2k by lemma 3.2.\nCase 4 (n = 2k): we again proceed by induction on k. For k = 0 we must exhibit a function\nthat has a fixed point and no other cycles, for example a constant. Now if we have a function\nwith a cycle of period 2k-1 but not one of period 2k, then by lemma 3.2 there exists a function\nwith a cycle of period 2k but not one of period 2k+1 .\nReferences\n[Devaney] R. L. Devaney, An Introduction to Chaotic Dynamical Systems\n, Addison-Wesley.\n(1989)."
    },
    {
      "category": "Resource",
      "title": "sarkovskiis_theo.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/5d354014585666873aca52d1694e94f9_sarkovskiis_theo.pdf",
      "content": "Proof of Sarkovskii's Theorem and Its Converse\nJeremy Hurwitz\nApril 17, 2005\nIntroduction\nWhen determining whether a function is chaotic under iteration, it is necessary to prove that the\nset of all periodic points is a dense subset of the space on which the function acts. If the function\nis simple enough, it may be possible to explicitly construct a periodic orbit that comes within an\narbitrary distance of any given point. However, often this is not possible, and so a more general\napproach is needed.\nSarkovskii's Theorem provides a means of proving the existence of infinitely many cycles, each\nwith different period, provided that we can find a cycle of length k = 2n, n ∈ Z+ . In this paper, we\nwill first prove Sarkovskii's Theorem and then go on to prove its converse.\nSarkovskii's Theorem\n2.1\nSarkovskii's Ordering\nBefore formally stating Sarkovskii's Theorem, it is necessary to define Sarkovskii's Ordering. This\nordering of the natural numbers begins with all odd numbers, written in increasing order. These\nare followed by 2 times the odds, 22 times the odds, 23 times the odds, and so on. The powers of\n2 come last, in decreasing order. This ordering can be written as follows:\n3, 5, 7, 9, . . .\n3, 2 · 5, 2 · 7, . . .\n2 ·\n22 3, 22 5, 22 7, . . .\n·\n·\n·\n23 3, 23 5, 23 7, . . .\n·\n·\n·\n. . .\n. . . , 2n , . . . , 23 , 22 , 2, 1\nDefinition 1. Given x, y ∈ Z+, if x precedes y in the Sarkovskii Ordering, we write x B y. If x\nfollows y in the ordering, we write x C y.\nWe could therefore write Sarkovskii's Ordering as\n3 B 5 B 7 B . . . B 2 · 3 B 2 · 5 B . . . B 22 3 B 22 5 B . . .\n·\n·\nB23 3 B 23 5 B . . . B 2n . . . B 23 B 22 B 2 B 1\n·\n·\n\n2.2\nSarkovskii's Theorem\nTheorem 1 (Sarkovskii's Theorem). Suppose f : < ←< is continuous and has a periodic point of\nprime period n. If n B k, then f also has a periodic point of prime period k.\nProof\nTo prove Sarkovskii's Theorem, we first need to establish a few basic lemmas To prove Sarkovskii's\nTheorem, we will divide the proof into 7 cases.\nCase 2.1. If f has a point with period n, where n is odd, then f has a point with period k > n, k\nodd.\nCase 2.2. If f has a point with period n, n odd, then f has a point with period k, k even.\nCase 2.3. If f has a point with period n, n even, then f has a point with period 2.\nFor the proofs of these three cases, see Robert Devaney's \"An Introduction to Chaotic Dynamical\nSystems,\" pp. 6365.\nCase 2.4. If f has a point with period n = 2m, then f has a point with period k = 2l , l < m.\nfk/2\nProof. Let k = 2l , l < m. Let g =\n. By assumption, g has a point with period 2m-l+1 .\nTherefore, g has a point with period 2, by Case 3. This point has period k = 2l under f.\nCase 2.5. If f has a point with period n = p 2m , p odd and m ≥0, then f has a point with period\n·\nk = q · 2m , q > p and q odd.\nProof. Let g = f2m . Since f has a point with period p · 2m, that point has period p under g. So\nby Case 1, there is a point with period q under g, for all q odd and q > p. This point has period\nq · 2m under f.\nCase 2.6. If f has a point with period n = p 2m , p odd and m ≥0, then f has a point with period\n·\nk = q · 2l , l > m.\nProof. Let g = fm . By assumption, g has a point with period p. So by Case 2, g has a point with\nperiod q · 2l-m , l > m. This point has period q · 2l under f.\nCase 2.7. If f has a point with period n = p 2m , p odd and m ≥0, then f has a point with period\n·\nk = 2l , l > m.\nProof. By Case 6, f has a point with period 2l-m 2m = 2l .\n·\nWe have thus proven Sarkovskii's Theorem.\nThe Converse of Sarkovskii's Theorem\nTheorem 2. Given n ∈ Z+, there exists a continuous function f : < → < such that given any\nk C n, f does not have a point with period k.\n\n(\n3.1\nProof\nGiven n ∈Z+, it suffices to show that there exists a function f that does not have period k, where\nk is the number immediately preceding n in Sarkovskii's Ordering.\nWe will again divide the proof into multiple cases, in each instance constructing a continuous\nfunction which does not have the period immediately preceding n in the ordering.\nCase 3.1. Given n ∈Z+ , ∃f : < →< such that f is continuous and has a point with period 2n + 1\nbut no point of period 2n -1.\nProof. We will first construct a continuous function f : [1, 2n + 1] →[1, 2n + 1] and then extend\nthe domain to include the entire set of reals.\nLet f : [1, 2n + 1] →[1, 2n + 1] be defined by\nf(1) = n + 1\nf(2) = 2n + 1\nf(3) = 2n\nf(4) = 2n -1\n. . .\nf(n) = n + 3\nf(n + 1) = n + 2\nf(n + 2) = n\nf(n + 3) = n -1\n. . .\nf(2n + 1) = 1\nAll of the integers in [1, 2n + 1] are then of period 2n + 1, by construction. Let f be defined\nlinearly within any interval [j, j + 1].\nTo show that there are no points with period 2n-1, we will first show that such a point cannot\nbe in [1, 2]. We must therefore iterate [1, 2] 2n -1 times.\nf\n[1, 2]\nf [n + 1, 2n + 1] →[1, n + 2]\n→\nf\nf\n→[n, 2n + 1] →[1, n + 3]\nf\nf\nf\n→[n -1, 2n + 1] →. . . →[1, 2n]\nf\n→[2, 2n + 1]\nSince f2n-1([1, 2]) ∩[1, 2] = 2, and 2 has period 2n+ 1, [1, 2] contains no points of period 2n-1.\nTo show that none of the other intervals contain a point of period 2n -1, we will show that\nall but one other interval is eventually mapped into [1, 2]. The last interval will be dealt with\nseperately.\nGiven any interval [j, j + 1] with j < n + 1, f([j, j + 1]) = [k, k + 1] for some k > n + 2.\nGiven any interval [j, j + 1] with j > n + 2, f2([j, j + 1]) = [j + 1, j + 2].\nSo there is an iterate f that maps [j, j + 1] into [1, 2], for all j =6\nn + 1, since eventually there\nis an iterate that maps the interval to [2n, 2n + 1] and the next iterate will be [1, 2].\nFor the interval [n + 1, n + 2], first note that f([n + 1, n + 2]) = [n, n + 2]. Hence, we have two\ncases. The first case is that fk (x) ∈[n, n+ 1] for some k ∈Z+ . Then, as shown above, some iterate\nof x lies in [1, 2], so x cannot have period 2n -1.\nThe second case is that the orbit of x is contained entirely in [n + 1, n + 2]. In this interval,\n|f0 = 2 > 1, so x must be a fixed point.\n|\nTo extend the domain of f to include the entire set of reals, define f0 as follows:\nf(x), 1 < x < 2n + 1\nf0(x) =\nx,\nx < 1 or x > 2n + 1\nAll points outside the domain of f are fixed points, so all cycles of period greater than 1 must\nbe in the interval [1, 2n + 1]. f0 is thus the desired extension of f.\n\nCase 3.2. Given n, k ∈Z+ , ∃f : < →< such that f is continuous and has a point with period\n2k (2n + 1) but no point of period 2k (2n -1).\nCase 3.3. Given k ∈Z+ , ∃f : < →< such that f has a point with period 2k , but no point with\nperiod 2k+1 .\nCase 3.4. Given k ∈Z+ , ∃f : < →< such that f has a point with period 2k 3, but no point with\n·\nperiod 2k-1 n, where n is any odd number.\n·\nFor the proofs of these three cases, see Saber Elaydi's \"On a Converse of Sharkovsky's Theorem.\"\nThis completes the proof of the converse to Sarkovskii's Theorem."
    },
    {
      "category": "Resource",
      "title": "sarkthm.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/8c0959b281e850ea9b0816839ae4c839_sarkthm.pdf",
      "content": "The Converse of Sarkovskii's Theorem\nLaura Hajj\nMay 2005\nIn this paper, we will complete Robert Devaney's discussion and proof of\nSarkovskii's Theorem and its converse.\nSarkovskii's theorem is particularly\npowerful and interesting because it give us information about the periodicity\nof the orbits of any continuous mapping of the real line. Before we complete the\nproof of Sarkovskii's Theorem, we must consider the Sarkovskii ordering of the\nnatural numbers, which lists all odd numbers except one, followed by these odds\ntimes 2, followed by 22 times the odds, and so on until we exhaust all positive\nintegers except the powers of 2, which we list in decreasing order. That is,\n3 ⊲5 ⊲7 ⊲...2 · 3 ⊲2 · 5 ⊲2 · 7 ⊲...2m · 3 ⊲2m · 5 ⊲2m · 7 ⊲...23 ⊲22 ⊲2 ⊲1.\nTheorem 1 (Sarkovskii's Theorem) Suppose f : R →R is a continuous\nfunction, which has a periodic point of prime period k. If k ⊲l in Sarkovskii's\nordering, then f also has a periodic point of period l.\nProof:As Devaney already proved the cases where k = 2m and k odd for us,\nwe need only prove the theorem for prime period k = p(2m) when p is odd.\nSuppose f has a point with prime period k = p(2m) where p is an odd\ninteger. Then f 2m has some point(s) with prime period p. By Devaney's proof\nfor odd k, f 2m also has a point of period n(2r), where n is odd and n > p or\nr ≥1 or n = 1. Therefore, f also has points of prime period n(2m+r), with the\nsame restrictions on r, m, n. Having completed Devaney's proof, we can now\nmove to our main topic, the \"converse\" of this theorem.\nTheorem 2 (Converse of Sarkovskii's Theorem) For each k ∈Z+, there\nexists a continuous f : R →R such that for each l ⊲k, f has a point of prime\nperiod k but no points of prime period l.\nProof will be offered in four separate lemmas corresponding to four subsets of\nthe natural numbers which encompass Sarkovskii's ordering.\nLemma 1 For all n ∈Z+, there is a continuous, f : I →I, from a closed\ninterval to itself such that f has a point with prime period 2n + 1 but no points\nof period 2n -1.\n\nProof: We want to find a function such that (1) f 2n+1(x) = x for all x ∈I and\n(2) f 2n-1(x) = x for some x ∈I. Define f on I = [1, 2n + 1] as follows:\nf(x) =\n\nnx + 1\nx ∈[1, 2]\n-x + 2n + 3\nx ∈[2, n + 1]\n-2x + 3n + 4\nx ∈[n + 1, n + 2]\n-x + 2n + 2\nx ∈[n + 2, 2n + 1].\nAfter calculating the orbit of the interval 1 under iteration by f(x), we find\nthat seed is periodic with prime period 2n+1, which satisfies the first condition\nfor this proof. To satisfy the second requirement, we first examine the orbit of\nf(x) on any closed interval [j, j + 1], for j ∈1, n + 1]. After enough iterations,\nthe orbit is at [j + 1, 2n + 1], which clearly is not periodic with period 2n -1.\nRepeated 2n -1 iterations of the interval [n + 1, n + 2] eventually produces\n[1, 2n + 1]. So f 2n-1 has a fixed point, since it spans the entire interval. These\nfixed points will either be fixed points or periodic points of f(x). When f a([n+\n1, n + 2]) ∈[n + 1, n + 2] these fixed points satisfy f(x) as fixed points and\nwhen f a([n + 1, n + 2]) /∈[n + 1, n + 2] then it is in [j, j + 1], which we already\ndiscussed.\nLemma 2 For all n ∈Z+, there is a continuous function f : I →I, which maps\na closed interval to itself, such that f has a point with prime period 2k(2n + 1)\nbut no points of period 2k(2n -1).\nProof: Here we want to create a function F(x) that doubles the period of f,\nthe function from Lemma 1, originally and then continues doubling the period\nwith each iteration. We can do this with the following function:\nD(x) =\n\nf(x) + 2z\nx ∈[0, z]\nx -2z\nx ∈[z, 3z],\nwhere [0, z] is the definitional domain of f above. First, D(x) has no periodic\npoints in [z, 3z]. Also, notice that each of the intervals [0, z] and [z, 3z] maps\nto the other subinterval. That is, D([0, z]) = [2z, 3z] and D([z, 3z]) = [0, z].\nMoreover, since [0, z] is the original domain of f(x), whenever x ∈[0, z], D2(x) =\nf(x). So, if a periodic x ∈[0, z] has prime period n under iteration of f then x\nhas prime period of 2n under iteration by D(x) and if y ∈[0, z] is periodic with\nperiod 2n in D(y) then y is also periodic with period n under iteration of f(y).\nSo, k iterations of D(x) satisfies this lemma.\nLemma 3 For all n ∈Z+, there is a continuous f : I →I such that f has a\npoint of period 2n but not of 2n+1\nProof: This function can be easily created by repeated iteration of the D(x)\nfrom lemma 2 on a new function: f(x) = x for x ∈[0, 1], which has periodic\npoints of only period 1.\nLemma 4 For all ∈Z+, there is a continuous f : I →I such that f has a\npoint 3(2n) but no points of period (2m -1)2n-1.\n\nProof: Define a continuous f : [1, 3] →[1, 3], which is linear between points\non a 3-cycle: f(1) = 2, f(2) = 3, f(3) = 1. Doubling f as in Lemma 2 yields\na point with prime period 6, satisfying the requirement that f have a periodic\npoint of prime period 3(2n).\nWe will prove that D(x) has no points of period (2m -1)2n-1 by induction.\nIf n = 1, then the prime period is odd; however, odd periods are unattainble\nin Dn-1 by Lemma 2. That is, D([1, 3]) = [5, 7] and D([5, 7]) = [1, 3], as seen\nabove. Now we can suppose that this lemma is true for n -1. Then Dn(x),\nthe nth doubling of f(x) has a periodic point of prime period 3(2n). If Dn(x)\nhas a point of prime period (2m -1)2n-1 then Dn-1 must have point of period\n(2m -1)2n-2. However, this period is unattainable to Dn-1 but our assump-\ntions for induction.\nWith these four proofs, we need notice only one other fact to complete our\nproof of the converse of Sarkovskii's theorem. If the constructed function for\nany of the lemmas has a point of period b and if b ⊲c ⊲d then the function also\nhas points of periods c and d, which implies that if no points of prime period\nc exist then no points of prime period b exist. Thus, the four lemmas cover\nall possible k in Sarkovskii's order and our discussion of Sarkovskii's Theorem\nends."
    },
    {
      "category": "Resource",
      "title": "s4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-091-mathematical-exposition-spring-2005/04d82e648a83f41c99e7cf7212b95e8c_s4.pdf",
      "content": "Sarkovskii's Theorem and its Converse\nAlejandro Ochoa\nMay 9, 2005\nIntroduction\nSarkovskii's Theorem is an important result about the kinds of periodic points that a continuous\nfunction on a closed interval can have.\nFirst we define the Sarkovskii ordering of the natural\nnumbers to be the following, where a B b means a appears before b in this ordering:\n3 B 5 B 7 B 9 B 11 B ...\n2 3 B 2 5 B 2 7 B ...\n·\n·\n·\n22 3 B 22 5 B 22 7 B ...\n·\n·\n·\n...24 B 23 B 22 B 2 B 1.\nThe first row consists of the ordered odd numbers, then each row consists of the the odd integers\nmultiplied by increasing multiples of powers of two, and lastly we list the powers of two in decreasing\norder finishing with 1. Sarkovskii's Theorem says that if f is a continuous function from the interval\nI onto itself, then if n B r and f has a point of period n, f has a point of period r.\nProfessor Devaney offers a partial proof of Sarkovskii's Theorem [1, 6068]. We present the last\ncase of the proof, the case n = 2mp, using Devaney's results, and we additionally present a proof\nof the Converse of Sarkovskii's Theorem, which states that for every n there is a function with a\ncycle of period n and no cycles with periods higher than n in Sarkovskii's ordering of the natural\nnumbers. Our proof of the Converse to Sarkovskii's theorem is largely based on Elaydi's proof [2].\nSarkovskii's Theorem\n2.1\nCase n = 2mp\nWe conclude the proof of Sarkovskii's Theorem starting from two previously proven cases, n = p\nfor p an odd number bigger than 1 and n = 2m. The Facts we have are that if a function f has a\npoint of period n, then it has points of the following periods:\nI. n = p implies all periods q odd such that q > p\nII. n = p implies all even periods\nIII. n = 2m implies all periods 2l for any l such that 0 ≤ l < m\nProposition. If a function f has a point of period n = 2mp where p is odd bigger than 1 and\nm is any positive integer, then f has points with the following periods:\n\n(1) 2mq for q odd such that q > p\n(2) 2lq for l such that l > m and any q odd, q =6\n(3) 2l for any l ≥ 0\nf2m\nProof: (1) Let f have a point of prime period n = 2mp, and consider the function g =\n.\nThen g has a point of period p, which by Fact I implies g has points of all periods q odd such that\nq > p, so that f has points of periods 2mq for all q odd such that q > p.\n(2) Consider f and g as in the last case.\nFact II implies g has points of all even periods,\nincluding periods of the form 2kq for any integer k > 0 and any q odd, q =6\n1. Then f has points of\nall periods 2lq where l = m + k, so l is any integer such that l > m and q is any odd number not\nequal to 1.\n(3) With f and g as before, Fact II implies g has points with all periods of the form 2k for any\ninteger k ≥ 0. Hence, f has points with periods 2l , where l = k + m, so l ≥ m. Fact III implies\nthat f also has all lower powers of 2, so f has points with periods 2l for any l ≥ 0. This completes\nthe proof of the theorem.\nThe Converse of Sarkovskii's Theorem\nWe will divide the proof in four cases, when n = 2k + 1, n = 2kp, n = 2k , and n = 3 2k where k is\n·\nan arbitrary positive integer and p an arbitrary odd number.\n3.1\nCase n = 2k + 1.\nWe construct a continuous function f that maps [1, n] to itself that has a cycle of period 2k + 1\nbut not of 2k - 1. Let\n⎧\n⎪\n⎨\n⎫\n⎪\n⎬\nkx + 1\nif\n1 ≤ x ≤ 2,\n2k + 3 - x\nif\n2 < x ≤ k + 1,\n3k + 4 - 2x\nk + l\nf(x) =\n.\nx ≤ k + 2,\n2k + 2 - x\nif\nk + 2 < x ≤ 2k + 1.\n⎪\n⎪\n⎩\nif\n<\n⎪\n⎪\n⎭\nOne can verify the endpoints of the corresponding lines above meet. Thus f is a continuous function.\nThe cycle of period 2k + 1 is\nk + 1\nk + 2\nk\nk + 3 → k - 1 → ...\n2k + 1\n→\n→\n→\n→\n→\n→\nwhere\nk + 1 + i → k + 1 - i → k + 1 + (i - 1)...\nholds for the integers i such that 1 ≤ i ≤ k.\nTo compute f2k-1[1, 2], we note that f maps the following closed intervals in the following way:\n[1, 2] → [k + 1, 2k + 1] → [1, k + 2] → [k, 2k + 1] → ... → [1, 2k] → [2, 2k + 1]\nwhere\n[1, k + i] → [k + 2 - i, 2k + 1] → [1, k + 1 + i]\nholds for 2 ≤ i ≤ k. It follows that\nf2k-1[1, 2] = [2, 2k + 1].\n\nThe point x = 2, the intersection of the last two intervals, is a part of the (2k + 1)cycle, so it is\nnot a fixed point of f2k-1, and this function has no other fixed points in [1, 2].\nWe can similarly verify that none of the other intervals of [1, 2k + 1] of the form [i, i + 1] has a\nfixed point of f2k-1 except for [k + 1, k + 2] because f performs the following maps:\n[k + 1, k + 2] → [k, k + 2] → [k, k + 3] → [k - 1, k + 3] → ... → [1, 2k + 1]\nwhere\n[k + 1 - i, k + 1 + i] → [k + 1 - i, k + 1 + (i + 1)] → [k + 1 - (i + 1), k + 1 + (i + 1)]\nholds for 1 ≤ i ≤ k - 1. It follows that f2k-1[k + 1, k + 2] = [1, 2k + 1] so f2k-1 must have a\nfixed point in that interval. We will show that point is unique and hence it is the fixed point of\nf, which does not belong to any cycle. Note that f is monotonically decreasing over each of the\nintervals in the sequence of mappings above. It follows, since the composition of an odd number\nof monotonically decreasing functions is monotonically decreasing, that the fixed point is indeed\nunique, since f2k-1 crosses the line y = x only once as it goes through the interval [k + 1, k + 2].\nHence f has no cycles of period 2k - 1.\n3.2\nCase n = 2kp.\nWe construct a continuous function g on a closed interval that has a cycle of period 2kp but not of\n2k(p-2). In this and the following constructions we use the \"trick\" double map defined by Devaney\nthat generates a function g from any continuous function f such that g has cycles of exactly double\nthe periods of all cycles of f and adds a fixed point without adding any other cycles [1, 67].\nLet f be a continuous function with a cycle of period p odd but no cycle of period p - 2, which\nexists by the last case. Let g be the function obtained by applying the double map k times to f.\nThen g has exactly a cycle of period n = 2kp but not of n = 2k(p - 2), because otherwise f would\nhave had a cycle of period p - 2. Hence, g is the desired function.\n3.3\nCase n = 2k .\nIn this case we want a continuous function on a closed interval that has points of period n = 2k\nbut none of period n = 2k+1. We can generate such functions using the double map.\nLet f(x) = 3- x map [1, 2] to itself. All of the points in that interval have prime period 2 except\nfor the fixed point 3/2. Applying the double map k - 1 times to f gives us the desired function g\nbecause it generates a function with a point of period n = 2k but none of n = 2k+1, for otherwise\nf would have had a point of prime period 4.\n3.4\nCase n = 3 · 2k .\nThis last case is the only one in which n has no immediate predecessor. We want to generate a\nfunction that has points with prime period n = 3\n2k but none of the form n = 2k-1p for any\n·\npositive odd number p. These functions can be inductively defined using the double map.\nLet f(x) be defined from [1, 3] to itself by f(1) = 2, f(2) = 3 and f(3) = 1 connected by lines\non [1, 2] and [2, 3]. It clearly has a point of prime period 3, so this function satisfies the case n = 3\n(k = 0). Applying the double map k times to f gives us the desired function g because it has a\npoint of period n = 3 2k but none of the form n = p · 2k-1, since there are no integers q such that\n·\n2kq = 2k-1p.\nThis completes the proof of the converse to Sarkovskii's Theorem.\n\nReferences\n[1] Devaney, Robert L. An Introduction to Chaotic Dynamical Systems, Second Edition. Addison\nWesley, Redwood City, California, 1989.\n[2] Elaydi, Saber. On a Converse of Sharkovsky's Theorem. American Math. Monthly 103 (May\n1996), 386392."
    }
  ]
}