{
  "course_name": "Mathematical Methods in Nanophotonics",
  "course_description": "Find out what solid-state physics has brought to Electromagnetism in the last 20 years. This course surveys the physics and mathematics of nanophotonics—electromagnetic waves in media structured on the scale of the wavelength.\nTopics include computational methods combined with high-level algebraic techniques borrowed from solid-state quantum mechanics: linear algebra and eigensystems, group theory, Bloch’s theorem and conservation laws, perturbation methods, and coupled-mode theories, to understand surprising optical phenomena from band gaps to slow light to nonlinear filters.\nNote: An earlier version of this course was published on OCW as 18.325 Topics in Applied Mathematics: Mathematical Methods in Nanophotonics, Fall 2005.",
  "topics": [
    "Engineering",
    "Nanotechnology",
    "Mathematics",
    "Applied Mathematics",
    "Linear Algebra",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Quantum Mechanics",
    "Engineering",
    "Nanotechnology",
    "Mathematics",
    "Applied Mathematics",
    "Linear Algebra",
    "Science",
    "Physics",
    "Atomic, Molecular, Optical Physics",
    "Quantum Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nCourse Description\n\nTired of doing electromagnetism like it's 1865?\n\nFind out what solid-state physics has brought to Electromagnetism II (8.02 or 8.022) in the last 20 years, in this new course surveying the physics and mathematics of nanophotonics - electromagnetic waves in media structured on the scale of the wavelength.\n\nIn this regime, which is the basis for everything from iridescent butterfly wings to distributed-feedback lasers and integrated optical devices to the next generation of optical fibers, the 140-year-old analytical techniques you learned in Electromagnetism II aren't very useful. Instead, we will cover computational methods combined with high-level algebraic techniques borrowed from solid-state quantum mechanics: linear algebra and eigensystems, group theory, Bloch's theorem and conservation laws, perturbation methods, and coupled-mode theories, to understand surprising optical phenomena from band gaps to slow light to nonlinear filters.\n\nPrerequisites\n\nAdvanced Analytic Methods in Science and Engineering (18.305) or permission of instructor. (Basically, some experience with partial differential equations and linear algebra.) This is a graduate-level course aimed at beginning graduate students and suitably advanced undergraduates.\n\nTexts\n\nJoannopoulos, John D., Steven G. Johnson, Robert D. Meade, and Joshua N. Winn.\nPhotonic Crystals: Molding the Flow of Light\n. Princeton, NJ: Princeton University Press, 2008. ISBN: 9780691124568.\n\nThis book is at an undergraduate level, and 18.369 is somewhat more advanced, but the book should provide a useful foundation. You can\nread the book online\n.\n\nUseful (but not required) books for this course:\n\nInui, Tetsuro, Yukito Tanabe, and Y. Onodera.\nGroup Theory and Its Applications in Physics (Springer Series in Solid-State Sciences)\n. 2nd corrected ed. New York, NY: Springer-Verlag, February 1996. ISBN: 9783540604457.\n\nTinkham, Michael.\nGroup Theory and Quantum Mechanics\n. Mineola, NY: Dover Publications, 2003. ISBN: 9780486432472.\n\nHomework\n\nProblem sets are assigned on a roughly weekly basis and are worth one third of the total grade. The collaboration policy on homework is as follows:\n\nFirst, talk to anyone you wish, and read anything you wish (with the exception of homework solutions from previous terms, which are strictly\nverboten\n). In fact, you are encouraged to discuss the course material and the homework problems with your classmates - often the best way to learn something is to force yourself to explain it to someone else. However,\nbefore\nyou discuss a homework problem with a classmate or look for related information in some reference, you are expected to first make a solid effort at it on your own.\n\nSecond,\nafter\nyou discuss a homework problem with a classmate or read related information in some other reference, you must write up the solution on your own, in your own words, starting from something close to a blank sheet of paper.\n\nExams\n\nThere is one midterm exam that covers the first half of the course. There is no final exam, but there is a final project due at the end of the course.\n\nProject\n\nStudents must choose a published paper on an interesting photonic-crystal phenomenon, replicate the results of that paper using the MIT numerical software, and then extend the results in some interesting way. Students must write one 5-10 page paper based on their project.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nProblem sets\n\n33%\n\nMid-term exam\n\n33%\n\nFinal project\n\n34%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nMaxwell's equations and linear algebra\n\nModes of a metal box and mirror symmetry\n\nProblem set 1 out\n\nSymmetry groups, representation theory, and eigenstates\n\nTranslational symmetry, waves, and conservation laws\n\nTotal internal reflection and the variational theorem\n\nProblem set 1 due\n\nDiscrete translations and Bloch's theorem\n\nMPB demo\n\nProblem set 2 out\n\nBloch's theorem, time reversal, and diffraction\n\nPhotonic band gaps in 1d, perturbation theory\n\n1d band gaps, evanescent modes, and defects\n\nProblem set 2 due\n\nProblem set 3 out\n\nWaveguides and surface states, omni-directional reflection\n\nGroup velocity and dispersion\n\nProblem set 3 due\n\nProblem set 4 out\n\n2d periodicity, Brillouin zones, and band diagrams\n\nBand diagrams of 2d lattices, symmetries, and gaps\n\nTriangular lattice, complete gaps, and point defects\n\nProblem set 4 due\n\nProblem set 5 out\n\nLine and surface defects in 2d, numerical methods introduction\n\nConjugate-gradient, finite-difference time-domain (FDTD) method\n\nProblem set 5 due\n\nProblem set 6 out\n\nMore FDTD: Yee lattices, accuracy, Von-Neumann stability\n\nPerfectly matched layers (PML), filter diagonalization\n\n3d photonic crystals and lattices\n\nProblem set 6 due\n\nHaus coupled-mode theory, resonance, and Q\n\nCoupled-mode theory with losses, splitter / bend / crossing / filter devices\n\nBistability in a nonlinear filter, periodic waveguides\n\nPhotonic-crystal slabs: gaps, guided modes, waveguides\n\nCavities in photonic-crystal slabs\n\nPhotonic-crystal fibers\n\nHollow-core and solid-core photonic-bandgap fibers\n\nProject due",
  "files": [
    {
      "category": "Assignment",
      "title": "Problem Set 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/3e5b72d621acc22ee35281fdaae8937d_pset1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n18.325 Problem Set 1\nProblem 1: Adjoints and operators\n(a) We defined the adjoint t of states and opera-\ntors by: (H11H2) = 1 ~ 1 ) ~\nIH2) and (Hll0lH2) =\n(0t I HI))^ I Hz).\nShow that for a finite-\ndimensional Hilbert space, where IH) is a col-\numn vector h, (n = I,... ,d), 0 is a square\nd x d matrix, and ( ~ ( ' 1I H ( ~ ) )\nis the ordinary\nconjugated dot product Enhi1)* hL2), the above\nadjoint definition corresponds to the conjugate-\ntranspose for both matrices and vectors.\n(b) Show that if 0 is simply a number o, then\n0+= o*. (This is not the same as the previ-\nous question, since 0 here can act on infinite-\ndimensional (continuous) spaces.)\n(c) If a linear operator 0 satisfies 0 t = 0-', then\nthe operator is called unitary. Show that a uni-\ntary operator preserves inner products (that is,\nif we apply 0 to every element of a Hilbert space,\nthen their inner products with one another are\nunchanged). Show that the eigenvalues u of a\nunitary operator have unit magnitude (lul = 1)\nand that its eigenvectors can be chosen to be\northogonal to one another.\n(d) For a non-singular operator 0 (i.e. 0-l exists),\nshow that (8-')t = (0t)-'. (Thus, if 0 is Her-\nmitian then 0 - I is also Hermitian.)\nProblem 2: Completeness\n(a) Prove that the eigenvectors In) of a finite-\ndimensional Hermitian operator 0 (a d x d\nmatrix) are complete: that is, that any d-\ndimensional vector can be expanded as a sum\nEnen In) in the eigenvectors with some coeffi-\ncients en. It is sufficient to show that there are\nd linearly independent eigenvectors In) :\n(i) Show that every\nmatrix\n0 has at least one nonzero eigenvector 11)\n(. . . use the fact that every polynomial with\nnonzero degree has at least one (possibly\ncomplex) root).\n(ii) Show that the space of Vl = {Iv) 1 (v 11) =\n0) orthogonal to 11) is preserved (trans-\nformed into itself or a subset of itself) by\n0. From this, show that we can form a\n(d - 1) x (d - 1) Hermitian matrix whose\neigenvectors (if any) give (via a similar-\nity transformation) the remaining (if any)\neigenvectors of 0.\n(iii) By induction, form an orthonormal basis of\nd eigenvectors for the d-dimensional space.\n(b) Suppose that we have an infinite-dimensional\nHermitian operator 0 that can be simulated on\na computer (with arbitrary, but finite, memory\nand time): its solutions can be approximated to\narbitrary accuracy by a finite-dimensional Her-\nmitian operator (e.g. 0 discretized on a finite\ngrid). Argue that the infinite-dimensional eigen-\nvectors form a complete basis for anything that\nwe care about; can you give an example of a sense\nin which they do not form a complete basis?'\n(c) Completeness is not automatic for eigenvectors\nin general. Give an example of a non-singular\nnon-Hemitian operator whose eigenvectors are\nnot complete. (A 2 x 2 matrix is fine. This case\nis also called \"defective.\")\nProblem 3: Maxwell eigenproblems\n(a) In class, we eliminated E from Maxwell's equa-\ntions to get an eigenproblem in H alone, of the\nform 8 1 H ) = $ I H). Show that if you in-\nstead eliminate H, you cannot get a Hermitian\neigenproblem in E except for the trivial case\nE = constant. Instead, show that you get a\ngeneralized Hermitian eigenproblem of the form\nA I E) = !$B I E), where both A and B are Her-\nmitian operators.\nl ~ o ra more precise discussion of the completeness of conti-\nnous Hermitian operators, see e.g. Courant & Hilbert, Methods\nof Mathematical Physics vol. 1.\n\n(b) For any generalized Hermitian eigenproblem\nwhere B is positive definite (i.e. (EIB~E)> 0\nfor all I E) # 02), show that the eigenvalues are\nreal and that different eigenvectors IEl)and I E2)\nsatisfy a modified kind of orthogonality. Show\nthat B for the E eigenproblem above was indeed\npositive definite.\n(c) Show that both the IE) and IH) formulations\nlead to generalized Hermitian eigenproblems\nwith real w if we allow magnetic materials\ny(x) # 1 (but require y real, positive, and in-\ndependent of H or w).\n(d) y and E are only ordinary numbers for isotropic\nmedia. More generally, they are 3 x 3 matri-\nces (technically, rank 2 tensors)-thus,\nin an\nanisotropic medium, by putting an applied field\nin one direction, you can get dipole moment in\ndifferent direction in the material. Show what\nconditions these matrices must satisfy for us to\nstill obtain a generalized Hermitian eigenprob-\nlem in E (or H) with real eigen-frequency w.\nProblem 4: Projection operators\nThe representation-theory handout gives a formula\nfor the projection operator from a state onto its com-\nponent that transforms as a particular representa-\ntion. Prove the correctness of this formula (using the\nGreat Orthogonality Theorem).\nProblem 5: Symmetries of a field in a\nmetal box\nIn class, we considered a two-dimensional (xy) prob-\nlem of light in an L x L square of air ( E = 1)\nsurrounded by perfectly conducting walls (in which\nE = 0). We solved the case of H = HZ(x,y)2 and\nsaw solutions corresponding to three different repre-\nsentations of the symmetry group (CdV).\n2 ~ e r e ,when we say ( E )# 0 we mean it in the sense of\ngeneralized functions; loosely, we ignore isolated points where\nE is nonzero, as long as such points have zero integral, since\nsuch isolated values are not physically observable. See e.g.\nGelfand and Shilov, Generalized Functions.\n(a) Solve for the eigenmodes of the other polariza-\ntion: E = Ez(x, y)z (you will need the E eigen-\nproblem from above), with the boundary condi-\ntion that Ez = 0 at the metal walls.\n(i) Sketch and classify the solutions according\nto the representations of C4V enumerated\nin class.\n(b) Consider the solutions in a triangular box with\nside L. Don't try to solve this analytically; in-\nstead, use symmetry to sketch out what the pos-\nsible solutions will look like for both Ez and Hz\npolarizations.\n(i) List the symmetry operations in the space\ngroup (choose the origin at the center of\nthe triangle so that the space group is sym-\nmorphic), and break them into conjugacy\nclasses. (This group is traditionally called\nC3V). Verify that the group is closed un-\nder composition (i.e. that the composition\nof two operations always gives another op-\neration in the group) by giving the \"mul-\ntiplication table\" of the group (whose rows\nand columns are group members and whose\nentries give their composition).\n(ii) Find the character table of C3V, using the\nrules from the represent at ion- t heory hand-\nout.\n(iii) Give unitary representation matrices D for\neach irreducible representation of\n(iv) Sketch possible w # 0 Ez and Hz solu-\ntions that would transform as these rep-\nresent at ions. What represent ation should\nthe lowest-w mode (excluding w = 0) of\neach polarization correspond to? If there\nare any (non-accident al) degenerate modes,\nshow how given one of the modes we can get\nthe other orthogonal eigenfunction(s) (e.g.\nin the square case we could get one from\nthe 90\" rotation of the other for a degener-\nate pair)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/ae545279c7de7103cae9645468508b48_pset2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n18.325 Problem Set 2\nProblem 1: Variational Theorem\nSuppose that we have a (possibly infinite dimen-\nsional) Hermitian operator 0 operating on some\nHilbert space {I$)},\nand consider the Rayleigh\nquotient ($101$)/($1$).\nShow that the mini-\nmum of this quotient (or, indeed, any extremum)\noccurs if and only if I$)\nis an eigenstate of 0 . Do\nthis by the using property that, at an extremum\nI$),\nthe quotient must be stationary: that is, if\nwe add any small 16$) to I$)\nat an extremum,\nthe change in the Rayleigh quotient is zero to\nfirst order in 16$). You should be able to show\nthat this stationary condition implies that I$)\nsatisfies the eigen-equation.\nProblem 2: 2d Waveguide Modes\nConsider the two-dimensional dielectric waveg-\nuide of thickness h that we first introduced in\nclass:\n&hi\n&lo\nlyl<h/2\nI Y I 2 h/2 '\nwhere &hi > &lo. Look for solutions with the\n\"TM\" polarization E = Ez(x, y)ie-iwt. The\nboundary conditions are that Ez is continuous\nand aE,/ay (N Hz) is continuous, and that we\nrequire the fields to be finite at x, y -,foo,\n(a) Prove that we can set &lo = 1 without loss\nof generality, by a change of variables in\nMaxwell's equations. In the subsequent sec-\ntions, therefore, set &lo = lfor simplicity.\n(b) Find the guided-mode solutions E,(x, y) =\nefiXE~(y), where the corresponding eigen-\nvalue w(k) < ck is below the light line.\n(i) Show for the 1 yl < h/2 region the so-\nlutions are of sine or cosine form, and\nthat for 1 yl > h/2 they are decaying\nexponentials.\n(ii) Match boundary conditions at y =\nf h / 2 to obtain an equation relating\nw and k. You should get a transcen-\ndental equation that you cannot solve\nexplicitly. However, you can \"solve\" it\ngraphically and learn a lot about the\nsolutions-in\nparticular, you might try\nplotting the left and right hand sides of\nyour equation (suitably arranged) as a\nfunction of kl =\nyou have two curves and the solutions\nare the intersections.\n(iii) From the graphical picture, derive an\nexact expression for the number of\nguided modes as a function of k. Show\nthat there is exactly one guided mode,\nwith even symmetry, as k -,0, as we\nargued in class.\n(iv) If you look at the Hz polarization, how\ndo your equations change? (Hint: the\nboundary conditions from Maxwell's\nequations are that H is continuous, the\ncomponents Ellparallel to a dielectric\ninterface is continuous, and the compe\nnents Dl = &EL perpendicular to a di-\nelectric interface are continuous.) How\nis the number of guided modes affected\nat each k? How about the strength of\nthe confinement (i.e. the exponential\ndecay rate)?\nProblem 3: Conservation Laws\n(a) Suppose that introduce a nonzero current\nJ ( X ) ~ - \" ~ into Maxwell's equations at a\ngiven frequency w, and we want to find\nthe resulting time-harmonic electric field\n~ ( x ) e - ' \" ~(i.e. we are only looking for fields\nthat arise from the current, with E -+ 0\nas 1x1 -, oo if J is localized). Show that\nthis results in a linear equation of the form\nA I E) = I b), where A is some linear opera-\ntor and Ib) is some known right-hand side in\nterms of the current density J .\n(i) Prove that, if J transforms as some ir-\nreducible representation of the space\ngroup then I E) (= E, which you can\nassume is a unique solution) does also.\n(This is the analogue of the conserva-\ntion in time that we showed in class,\nexcept that now we are proving it in\nthe frequency domain. You could prove\nit by Fourier-transforming the theorem\nfrom class, but do not do s-instead,\nprove it directly from the linear equa-\ntion here.)\n\n(ii) Formally, IE) = A-'\nI b), where A-'\nis\nrelated to the Green's function of the\nsystem. What happens if w is one of\nthe eigenfrequencies?\n(b) Let ~t be our time-evolution operator, and\nwe have some space group G of- symmetry\noperators 0, (g E G) such that [Ut,O,] = 0.\nNow, suppose that we have some state I11,(t))\nthat at one time transforms as purely one\nrepresentation and at a later time trans-\nforms as some other representation (or some\nsuperposit ion of represent at ion), violating\nthe conservation theorem we proved in class.\nShow that this implies that ~t is a nonlinear\noperator (i.e. it depends on the amplitude of\nthe state). (In class, we implicitly assumed\nthat our operators were linear.)'\nProblem 4: Cylindrical symmetry\nSuppose that we have a cylindrical metallic\nwaveguide-that\nis, a perfect metallic tube with\nradius R, which is uniform in the z direction.\nThe interior of the tube is simply air ( E = 1).\n(a) This structure has continuous rotational\nsymmetry around the x axis, called the C,\ngroup.2 Find the irreducible representations\nof this group (there are infinitely many be-\ncause it is an infinite group).\nb) For simplicity, consider the (Hermitian)\nscalar wave equation -V211, = $$J\nwith\n= 0.\nShow that, when we look\nfor solutions 11, that transform like one of\nthe representations of the C, group from\nabove, and have x dependence ei\"\n(from\nthe translational symmetry), then we ob-\ntain a Bessel equation (Google it if you've\nforgotten Mr.\nBessel). Write the solu-\ntions in terms of Bessel functions, assum-\ning that you are given their zeros x,,,,,, (i.e.\nJm(xm,,) = 0 for n = 1,2,..., where J, is\nthe Bessel function of the first kind ...if you\nGoogle for \"Bessel function zeros\" you can\nl A famous example of this in optics is third-harmonic\ngeneration. If we have a nonlinear E N IEI2,we can start\nwith a planewave at (w,k)and generate another wave at\n(3w,3k).\n2 ~ talso has an infinite set of mirror planes containing\nthe z axis, but let's ignore these for now. If they are\nincluded, the group is called C,V.\nfind them tabulated). Sketch the dispersion\nrelation w (k) for a few bands.\n(c) From the general orthogonality of Hermitian\neigenfunctions, derive an orthogonality inte-\ngral for the Bessel functions.\nProblem 5:\nNumerical computa-\ntions with MPB\nFor this problem, you will gain some initial expe-\nrience with the MPB numerical eigensolver de-\nscribed in class, and which is available on MIT Server\nin the mpb locker. Refer to the class hand-\nouts, and also to the online MPB documenta-\ntion at jdj .mit .edu/mpb/doc. For this problem,\nyou will study the simple 2d dielectric waveg-\nuide (with &hi = 12) that you analyzed analyti-\ncally above, along with some variations thereof-\nstart with the sample MPB input file (2dwaveg-\nuide.ct1) that was introduced in class and is avail-\nable on the course web page.\n(a) Plot the TM (E,) even modes as a function\nof k, from k = 0 to a large enough k that\nyou get at least four modes. Compare where\nthese modes start being guided (go below\nthe light line) to your analytical prediction\nfrom problem 1. Show what happens to this\n\"crossover point\" when you change the size\nof the computational cell.\n(b) Plot the fields of some guided modes on a\nlog scale, and verify that they are indeed ex-\nponentially decaying away from the waveg-\nuide. (What happens at the computational\ncell boundary?)\n(c) Modify the structure so that the waveguide\nhas e = 2.25 instead of air on the y < -h/2\nside. Show that there is a low-w cutoff for\nboth TM and TE guided bands, as we ar-\ngued in class, and find the cutoff frequency.\n(d) Create the waveguide with the following\nprofile:\nShould this waveguide have a guided mode\nas k -+ O? Show numerical evidence to sup-\nport your conclusion (careful: as the mode\n\nbecomes less localized you will need to in-\ncrease the computational cell size)."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/13018fc7dc218aa459032b11dbf17ab7_pset3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n18.325 Problem Set 3\nProblem 1: Perturbation theory\n(a) In class, we derived the 1st-order correction\nin the eigenvalue for an ordinary Hermitian\neigenproblem 0 lu) = u lu) for a small per-\nturbation AO. Now, do the same thing for\na generalized eigen~roblemA I u )\n=uB I u ) -\nThat is, assume we have the solution\nace) lU(o)) = , ( o ) ~ ( o ) lU(o))to ,\nperturbed system and find the first-\norder correction u(') when we change\nboth A and B by small amounts AA\nand AB. You may assume that u(O) is\nnon-degenerate, for simplicity.\n(ii) Now, apply this solution to the gen-\neralized eigenproblem V x V x E =\n$EE\nfor a small change A&, and show\nthat the first-order correction Aw is the\nsame as the one derived in class using\nthe H eigenproblem.\n(b) Recall the problem of the modes in an L x L\nmetal box that we solved in class for the Hz\n(TE) polarization, and which you solved in\nproblem set 1for the Ez (TM) polarization.\nOriginally, this box was filled with air ( E =\n1). Now, suppose that we increase E by some\nsmall constant A& in the lower-left $ x $\ncorner of the box. What is the first-order\nAw for the first four (lowest w) modes of\nthe TM polarization? What happens to the\ndegenerate modes?\n(c) In class, we calculated the band gap Aw\nthat appeared in a uniform (Id) material\nE(X) = ~1 when half of the unit cell a was\nchanged to ~1 - AE for some small AE, by\nusing perturbation theory. In particular, we\nderived the gap between the first two bands\nthat appears at k = nla, the edge of the\nBrillouin zone.\n(i) Now, you should compute the gap that\nappears between band 2 and band 3 at\nk = 0, the center of the Brillouin zone,\nto first order. However, do it more gen-\nerally: assume that the ~1 region has\nthickness dl and that the ~1 - AE re-\ngion has thickness a-dl, repeated with\nperiod a, and compute Aw as a func-\ntion of dl.\n(ii) At what dl values does this gap at k =\n0 disappear (Aw = O)? What is Aw for\nthe quarter-wave stack thicknesses?\n2: Band gaps in MPB\nConsider the id periodic structure consisting of\ntwo alternating layers: ~1 = 12 and ~2 = 1, with\nthicknesses dl and d2 = a - dl, respectively. To\nhelp you with this, I've created a sample input\nfile bandgapid.ct1 that is posted on the course\nweb page.\n(a) Using MPB, compute and plot the fractional\nTM gap size (of the first gap, i.e lowest w)\nvs. dl for dl ranging from 0 to a. What\ndl gives the largest gap? Compare to the\nquarter-wave thicknesses.\n(b) Given the optimal parameters above, what\nwould be the physical thicknesses in order\nfor the mid-gap vacuum wavelength to be\nX = 2 ~ c l w= 1.55pm? (This is the wave-\nlength used for most optical telecommuni-\ncations.)\n(c) Plot the Id TM band diagram for this struc-\nture, with dl given by the quarter wave\nthickness, showing the first five gaps. Also\ncompute it for dl = 0.12345 (which I just\nchose randomly), and superimpose the two\nplots (plot the quarter-wave bands as solid\nlines and the other bands as dashed). What\nspecial features does the quarter-wave band\ndiagram have?\nProblem 3: Space group of k\nConsider the structure of problem 2. What are\nthe symmetry operations of its space group?\nHow are these reduced (if at all) if we consider\nBk-that\nis, what is the space group as a func-\ntion of k? In class, when we derived the band\ngap, we took the modes at k = ~ / ato be of\neven/odd (cos/sin) form; why was this justified?\nGive an example of a Id periodic structure in\nwhich the modes at 5 = n/a are not even or\nodd. Is the band diagram of this structure still\nsymmetric (i.e. w (- k) = w(k))?\n\nProblem 4: Defect modes in MPB\nIn MPB, you will create a (TM polarized) defect\nmode by increasing the dielectric constant of a\nsingle layer by Ae, pulling a state down into the\ngap. The periodic structure will be the same as\nthe one from problem 2, with the quarter-wave\nthickness dl = 1/(1+ m).To help you with\nthis, I've created a sample input file defectld.ct1\nthat is posted on the course web page.\n(a) When there is no defect (A&) plot out the\nband diagram w(k) for the N = 5 supercell,\nand show that it corresponds to the band\ndiagram of problem 2 \"folded\" as expected.\n(b) Create a defect mode (a mode that lies in\nthe band gap of the periodic structure) by\nincreasing the e of a single el layer by Ae =\n1, and plot the Ez field pattern. Do the\nsame thing by increasing a single ~2 layer.\nWhich mode is even/odd around the mirror\nplane of the defect? Why?\n(c) Gradually increase the e of a single ~2 layer,\nand plot the defect was a function of AE\nas the frequency sweeps across the gap. At\nwhat A& do you get two defect modes in\nthe gap? Plot the Ez of the second defect\nmode. (Be careful to increase the size of the\nsupercell for modes near the edge of the gap,\nwhich are only weakly localized.)\n(d) Via first-order perturbation theory, derive\nan exact expression for the rate of change\n4 f ~ )of the defect-mode frequency w of a\nsingle defect layer ~2 + AE layer, as AE\nis changed. Your expression should be in\nterms of the eigenfield E of the localized de-\nfect state at the current Ae. Verify your for-\nmula numerically by showing, at a couple of\ndifferent values of Ae, that it correctly pre-\ndicts the slope of your w vs. Ae curve above.\n(Note that you can export E to Matlab and\ncompute the necessary integrals there or,\nfor the Scheme lovers among you, you can\ncompute the integral directly in MPB using\nthe compute-energy-in-object s or compute-\nfield-int egral function .)\n(e) Is there a minimum Ae (of an e2 layer) to\ncreate a defect mode, or is a defect mode lo-\ncalized even for infinitesimal Ae? Support\nyour conjecture1 with numerical evidence.\n(Don't forget that, like in problem set 2, as\nthe mode becomes less localized you must\nincrease the computational cell size. An-\nother thing to be careful about is how ac-\ncurately you know the location of the gap\nedge-compute\nthe gap edge using the same\nresolution as you are using to compute the\ndefect, and you may need to increase both\nresolutions.)\n(f) The mode must decay exponentially far\nfrom the defect (multiplied by an eiEx sign\noscillation and the periodic Bloch envelope,\nof course). From the Ez field computed\nby MPB, extract this asympotic exponential\ndecay rate (i.e. K if the field decays N e-\"\")\nand plot this rate as a function of w, for\nthe first defect mode, as you increase e2 as\nabove (vary ~2 SO that w goes from the top\nof the gap to the bottom).\n11,\nwe never merely guess^ we con-\njecture, or perhaps we postulate an ansatz."
    },
    {
      "category": "Assignment",
      "title": "Problem Set 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/dce98d9593bbc54a2306bc53b961bd5c_pset4.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n18.325 Problem Set 4\nProblem 1: Group velocity\nand material dispersion\nSuppose that we have a dispersive medium\nwith some frequency-dependent dielectric con-\nstant E(w). (We still assume ~ ( w )> 0 and\nreal, however. l) In this case, our eigen-equation\nbecomes a \"self-consistent\" equation 8i\n~\n)=\n$ IH), since the eigen-operator 6 depends on\nthe eigenvalue w .\n(a) Explain why w is still real, and why first-\norder perturbation theory (and thus the\nHellman-Feynman theorem) still holds for\nsuch a self-consistent Hermitian eigen-like\nproblem.\nGive a property of Hermitian\neigen problems that is not true any longer\nfor the self-consistent problem.\n(b) Apply the Hellman-Feynman theorem to the\nself-consistent problem ek1 Hk) = $ I Hk)\nin order to get an expression for the group\nvelocity V, = 2.Note that you will have to\nuse the chain rule, because varying k causes\nGk to change directly and it also causes E\nto change due to the change in w: 2 =\n+\nSQ . & .\nak\na& dw\ng.\n(c) Show that your v, is the ratio of mean flux\nto mean energy density, where the energy\ndensity is now the \"dispersive\" energy den-\n1 d(we) IEI'\nsity ii;; (r + IHI2), as derived e.g. in\nJackson (Classical Electrodynamics).\nProblem 2: Dispersion\nDerive the width of a narrow-bandwidth Gaus-\nsian pulse propagating in Id (x) in a dispersive\nmedium, as a function of time, in terms of the\ndispersion parameter D = a% - -&a\nvzX2 dw -\nA2 dw\nas defined in class. That is, assume that we have\n'Strictly speaking, any dispersive E must be complex\nto satisfy causality (see e.g. Jackson, Classical Electro-\ndynamics, or Google \"Kramers-Kronig relations\"), but for\nweak dispersion we can neglect the absorption loss (imag-\ninary part) to a first approximation.\na pulse whose fields can be written in terms of a\nFourier transform of a Gaussian distribution:\nfields -\ne-(k--lco)2/2a2ei(kx-wt)\nwith some width a and central wavevector ko >>\na. Expand w to second-order in k around ko\nand compute the inverse Fourier transform to\nget the spatial distribution of the fields, and\ndefine the \"width\" of the pulse in space as the\nstandard deviation of the ifields12.\nThat is,\nI\nwidth = \\/J(x -\nIfields12dx,\n~ ~ ) ~ I f i e l d s l ~ d x /\nwhere xo is the center of the pulse (i.e. xo =\nJ xlfields12dx/ J Ifields12dx).\nProblem 3:\nProjected band dia-\ngrams and omni-directional reflec-\ntion\nStarting with the bandgapld.ct1 MPB control\nfile from problem set 3, which computes the fre-\nquencies as a function of k,. Modify it to com-\npute the frequencies as a function of k, for some\nrange of k, (e.g. 0 to 2, in units of 2x/a ... recall\nthat the k, Brillouin zone is infinite!) for some\nfixed value of k,, and to use ~2 = 2.25 instead of\n1.2\n(a) Compute and plot the TM projected band\ndiagram for the quarter-wave stack with e of\n12 and 2.25. That is, plot w(k,) for several\nbands, first with k, = 0, then k, = 0.1,\nthen 0.2, then ... then 0.5, and interpolate\nintermediate k, to shade in the \"continuum\"\nregions of the projected bands. Verify that\nthe extrema of these continua lie at either\nkx = 0 or k, = 0.5 (in units of 2n/a), i.e. at\nthe B.Z. edges.\n(b) Compute and plot the TE projected band\ndiagram as well.\n(c) Find the size Aw/wmjd of the range of\nomni-directional reflection (from an inter-\nface with air). Vary the layer thicknesses\ndl or d2 slightly and see how the size of\nthe omni-directional gap changes.. .do the\nquarter-wave thicknesses lead to the max-\nimum omni-directional gap?\n~\no\n~\nmight want to add a \"kx\" parameter via \"(define-\nparam kx 0)\" so that you can change k, from the com-\nmand line with \"mpb kx=0.3 ...\".\n\nProblem 4:\nFabry-Perot Waveg-\nuides\nModify the MPB defectld.ct1 file from problem\nset 3 to compute the defect mode as a function\nof k, (for k, = 0).\n(a) Changing a single EZ layer by AE= 4, with\nan N = 20 supercell, plot the first 80 bands\nas a function of k, for some reasonable range\nof k,. Overlay your TM projected band di-\nagram from problem 3, above, to show that\nthe bands fall into two categories: modes\nthat fall within the projected \"continuum\"\nregions from problem 3, and discrete guided\nbands that lie within the empty spaces. (If\nthere are any bands just outside the edge of\nthe continuum region, increase the supercell\nsize to check whether those bands are an ar-\ntifact of the finite size.) Plot the fields for\nthe guided bands (a couple of nonzero k,\npoints will do) to show that they are indeed\nlocalized.\n(b) Modify the structure and plot the new band\ndiagram(s) (if necessary) to give examples\n(i) \"index-guided\" bands that do not lie\nwithin a band gap\n(ii) a band in the gap that intersects a con-\ntinuum region\n(iii) a band in the gap that asymptotically\napproaches, but does not intersect, the\ncontinuum regions"
    },
    {
      "category": "Resource",
      "title": "2005 Midterm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/fb5e78a049f1c863d2781f3bd64d35e3_midterm_05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n(metal)\ni\n(semi-in\nFigure 2: (a)Schematic of a multilayer mirror-\nwe suppose that our structure is an omnidi-\nFigure 1: (a)A pentagonal air cavity surrounded rectional reflector with respect to incident light\nby metal (2d, xy plane). (b)The same, with a from air (E = 1) , but not for E = 2.25 (for\npoint current J at the indicated location (with J which there is some reflection and some trans-\npointing in the indicated direction).\nmitted beam(s)). (b)We have E = 2.25, then\nN periods of the mirror, then E = 1, and want\n18.325 \"Midw-termExam\nto know whether (and, qualitatively, how much)\nlight is transmitted through to the E = 1.\nProblem 1\nSuppose that we have a 2d metallic electro-\nlabel them with \"1/2\", \"2\", etcetera accord-\nmagnetic cavity in the shape of a regular pen-\ning to whether their length is half, twice,\ntagon (five equal sides and angles) as shown in\netcetera of the original current amplitude.)\nFig. 1(a).\n(c) Show how you can place a single point cur-\n(a) Give the space group, conjugacy classes,\nrent J to excite fields transforming as a sin-\nand character table for this system.\ngle one-dimensional irreducible representa-\ntion. Show how you can place a diflerent\nHint:\none irreducible representation\nsingle point current J to excite fields with a\nfor this group ends up being the sim-\nsingle two-dimensional irreducible represen-\nple 2 x 2 coordinate rotation/reflection\ntation.\nmatrices; e.g.\na rotation by 0 corre-\nC O S ~ -sine\nsponds to (-\n. Also note Problem 2\nsine\ncos8\nthat\n=\nFZ\n(a) We have a certain multilayer film consisting\ncos(%)\n0.30902 and\nof two repeating layers of EI and EZ. Suppose\nthat this structure, repeated semi-infinitely,\n(b) Suppose that we have a point current J as\ndoes form an omnidirectional reflector (all\nshown in Fig. l(b) . (That is, J(x, y) is given\npolarizations and angles) at a frequency w\nby a Dirac delta function with the vector J\nfrom an ambient medium E = 1, but does\nlying in the xy plane.) Decompose this into\nnot form an omnidirectional reflector at w\npartner functions of your irreducible repre-\nfrom an ambient medium E = 2.25, as indi-\nsentations from above, using the projection\ncated schematically in Fig. 2(a). Now, sup-\noperators:\npose that we have semi-inkite E = 2.25 fol-\nlowed by N bilayers of our periodic structure\nfollowed by semi-infinite E = 1, as depicted\nin Fig. 2(b). If a frequency-w planewave is\nincident on the layers from the E = 2.25\n(The result should be a sketch, expressing\nmedium, how does the reflected light and\nthe original sketch as a sum of several pen-\ntransmitted (into the E = 1) light depend\ntagon sketches with arrows at appropriate\non N, angle, and polarization? (A quali-\nplaces in the pentagons. Don't try too hard\ntative description is sdlicient, but must be\nto get the length of the arrows to scale; just\nclearly justified.)\n\n8 r\nI\n>\n0.6\n0.4\na2\n0.6\n0 2\n0.8\nWave vector Ijpl2x\nFiwre 3: Projected band diagram for a multi- Figure 4: Reflection(?) from a multilayer film\nlayer film vs. surface-parallel k,. TE fLp7,)PO-\nlarization on the left,\nTM rsn)\nwhose surface is periodically corrugated with p e\nand\npolarization riod\nalong the y direction. Light is incident\non the right.This structure is an omnidirectional from above (air) with some angle and polariza-\nreflector from the frequencies L to U with re- tion.\nspect to air (E = I). Light line of air is shown in\nred.\nProblem 3\nSuppose that we have a 4 x 4 Hermitian matrix 0\n(b) More specifically, suppose that the periodic (that is, Hermitian under the usual inner product\nstructure has the projected band diagram\n(\"19) = C n x A y n for 4 x 1vectors 1\")\nand\nIY)),\nshown in Fig. 3. Now, suppose we period- with eigenvectors:\nically corrugate the surface layer as shown\nin Fig. 4, parallel to the interface, with a\nperiod A (uniform in the z direction, out of\nplane).\ni\nand corresponding\n(ij ( -I\neigenvalues:\nj>(i j\n1,2, -1, -1.\n(i) If we consider only planewaves inci-\n(a) Now, suppose that we change 0by the small\ndent (from air) in the x y plane as de-\nAO:\npicted in Fig. 4, for what A or A's\nis the omni-directional reflection prop-\nerty maintained? (If you need to refer\nto a particular numerical value w or k,\nin Fig. 3, you can simply label the cor-\nresponding point on Fig. 3 rather than\nwhere 6 << 1. Give the approximate change\ntrying to work out what the number\nin the eigenvalues (to first order in 4, and\nis.)\nthe approximate new eigenvectors (to zero-\nth order in 6).\n(ii) What about if we consider planewaves\nthat are not in the x y plane (i.e. they\n(b) Are your approximate new largest and\nhave some out-of-plane k component)?\nsmallest eigenvalues larger or smaller than\nIs there any (finite, nonzero) A for\nthe corresponding exact eigenvalues? Why?\nwhich omnidirectional reflection is pre-\n(Don't try to compute the exact eigenvalues,\nserved for all three-dimensional angles\nwhich would require you to find the roots of\nand polarizations? Why or why not?\na quartic equation.)\n(semi-infinite)\n\nTE rnodc\nFigure 5: TE (red) and TM (blue) band diagram\n(semi-infinite)\nof a square lattice of dielectric cylinders (inset) in\nair, around the edges of the irreducible Brillouin\nzone (inset).\nFigure 6: Two semi-infinite multilayer mirror\nseparated by some distance of air ( E = 1, less\nthan both of the mirror materials). Each film is\nProblem 4\nterminated with half a high-index layer, which\nconsider the square lattice of dielectric rods, for an isolated semi-idinite structure would sup-\na single TM surface state in the first gap.\nwhose band diagram and irreducible Brillouin\nPO^\nzone are shown in Fig. 5. Now, suppose that\nwe change the shape of the rods from cylindri-\nband diagram as a function of the surface-\ncal to pentagonal (with the pentagons oriented\nparallel k, (up to the first gap, i.e. the first\n\"oint-upwarda' as in Fig. 1,keeping the area of\ntwo continuum regions, is enough). (That\nthe rods the same (you can assume that this is\nis, the structure looks like the top half of\ntherefore a small perturbation).\nFig. .)\n(a) What is the new irreducible Brillouin zone?\n(b) Now, suppose that we have two such semi-\ninfinite structures as shown in Fig. 1, both\n(b) Will any degeneracies remain in the band\nterminated with half a high-index layer so\ndiagram? If so, which?\nthat they would, by themselves, have sur-\nface states. In between them is air (sepa-\n(c) Consider a solution in the perturbed (pen-\nrated by E = l < E ~ , E ~ ) .Sketch what the\ntagonal) structure with k on the line seg-\nr\nTM projected band diagram looks like when\nment between\nand X (exclusive, i.e. k #\nthey are some large but finite distance from\nI', X). In what direction is the solution's\none another, and sketch how this changes\nelectromagnetic energy propagating (or di-\nas they get closer to one another. Clearly\nrections, depending on the band)? What\nindicate what happens to the surface states.\nabout for k between\nand M?\nProblem 5\n(a) Suppose we have a semi-infinite Id periodic\nstructure of EI and EZ bounded by E = 1on\none side, we look at its TM modes only, and\nwe terminate it (with half of the high-index\nIayer) so that it has a single surface state\nin the first gap. Sketch the TM projected\n(semi-infinite)\nA\nL,L layer\n112 layer\nv"
    },
    {
      "category": "Resource",
      "title": "2007 Midterm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/1df0858c64956ddd712ea2e6f1067a18_midterm_07.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nperfect metal\n(i)\n(ii)\nf(x,y) = 0\n+1\nε = 1\nFigure 1:\n(a) Hexagonal cavity surrounded by\nperfect-metal walls. (b) Schematic of a function\nf(x, y) which = 1 in the highlighted region of the\ncavity and = 0 elsewhere.\n18.369 Mid-term Exam\nYou have two hours. Notice that all problems have\nequal weight, so don't spend too much time on one\nproblem at the expense of the others.\nProblem 1: Hexagons (30 points)\nSuppose that we have a hexagonal cavity filled with\nε = 1 and surrounded by perfectly conducting walls,\nas shown in fig. 1(i).\n(a) List the symmetry operations and conjugacy\nclasses, and give the character table of this sym\nmetry group (C6v).\n(b) Suppose that we have a function f(x, y) which\nis 1 in a small region as shown in fig. 1(ii),\nand zero elsewhere. Using the projection op\nerator, write f(x, y) as a sum of partner func\ntions of the irreducible representations of C6v,\nby sketching the partner functions [similar to\nthe sketch in fig. 1(ii)].\n(c) Now, suppose that we perturb the cavity by\npartially filling it with one of various (concen\ntric) dielectric shapes, as shown in fig. 2: (i)\na hexagon rotated by 30*; (ii) a hexagon ro\ntated by 15*; (iii) a square (parallel to two sides\nof the hexagon); and (iv) an equilateral trian\ngle (parallel to three sides of the hexagon). In\nwhich of these perturbed cavities would you ex\npect some eigenmodes to have non-accidental\ndegeneracies, and why?\nperfect metal\n(i)\n(ii)\n(iii)\n(iv)\nε > 1\nε = 1\nε = 1\nε = 1\nε = 1\nε > 1\nε > 1\nε > 1\nFigure 2: Hexagonal cavity partially filled with di\nelectric perturbations of various shapes.\nProblem 2: Band Diagrams (30 points)\nCalvin Q. Luss, a Harvard student, posts to the MPB\nmailing list that he has discovered a bug in MPB. He\nwrites:\nI'm getting ready to do a 2d-crystal\ncalculation, but first I wanted to do a 1d\ncrystal as a test case since I know the\nband diagram analytically for that (from\nYeh's book).\nI used the quarter-wave\nstack shown in fig. 3(i), with a 1d compu\ntational cell of a×no-size×no-size,\nand plotted the TM band structure ω(kx)\n(for k = (k x, 0, 0) with kx from 0 to 0.5\nin MPB units, i.e.\nfrom 0 to π/a)--\neverything works fine! Then I do the same\ncalculation but with a computational cell\nof a×a×no-size, as shown in fig. 3(ii),\nand the result is wrong! I get all sorts\nof extra bands at bogus frequencies; why\ndoesn't the result match the 1d computa\ntion, since the structure hasn't changed? I\nthink it must be a bug; you MIT people ob\nviously don't know what you're doing.\nSketch out the plots that Calvin got from his two cal\nculations, and explain why MPB is correctly answer\ning exactly the question that he posed. Sketch at least\n4 bands in the 1d calculation, and at least 6 bands in\n\nε = 1\nε = 1.1\nε = 1\nε = 1.1\nε = 1\nε = 1.1\nε = 1\nε = 1.1\nε = 1\nε = 1.1\na\na\na\na\nno-size\n(i)\n(ii)\nFigure 3: Two MPB unit cells for the band struc\nture of a 1d-periodic quarter-wave stack: (i) a 1d\na×no-size unit cell (ii) a 2d a × a unit cell.\nthe 2d calculation (not counting degeneracies), and\nlabel any bands that are doubly (or more?) degener\nate.\n(You can use the fact that the ε contrast in this case\nis only 10%--the structure is nearly homogeneous--\nto help you sketch out the bands more quantitatively.\nBut no need to be too quantitative, however: you\ndon't need to use perturbation theory or anything like\nthat; a reasonable guess is sufficient.)\nProblem 3: Operators (30 points)\nFirst, recall a few fact derived in class. We know that\nthe time-harmonic electromagnetic field H(x)e-iωt\nsatisfies a Hermitian eigenproblem (for real ε > 0)\nω2\n∇×\n∇× H = ΘˆH =\nH,\n(1)\nε(x)\nc2\nand this leads to the usual consequences of real ω, or\nthogonal H, etc. You also derived in homework that\nif ε(p, x) is also a function of some parameter p, then\ndω/dp is given exactly via first-order perturbation\ni\ntheory, in terms of the electric field E = ωε ∇× H,\nby:\n∂ε\ndω\nω\nR\n∂p |E|\ndp = - 2 R\nε |E|\n,\n(2)\nwhere the integrals are over all space (or the unit cell,\nfor a periodic structure).\nNow, suppose that ε(p, x, ω) is a function of fre\nquency (the material is dispersive) as well as of space\nand p, although for every ω we assume ε is real\nand positive. Equation (1) still holds, but it is no\nlonger an eigenproblem per se--the operator Θˆ now\ndepends upon the \"eigenvalue\" ω, and the equation\nmust be solved self-consistently for ω and H. In this\ncase, answer you these questions two, ere your trou\nbles here are through:\n(a) Which of the following properties of Hermitian\neigenproblems is still true of the self-consistent\nequation Θ(\nˆ ω)H = ω\nc\n2 H, and why? [No need\nto repeat every detail of proofs given in class;\njust explain clearly why they do or do not apply\nhere.]\n(i) ω is real\n(ii) the solutions H can be chosen to trans\nform as irreducible representations of the\nspace group\n(iii) for two solutions H and H ′ corresponding\nto frequencies ω and ω′ , respectively, then\nω\nω′ implies that\nR\nH∗ · H ′ =\n=\n0.\n(b) Derive an expression for dω/dp in terms of E,\nanalogous to eq. (2) [but it won't be identical!].\nHint: note that you get a Δε both from the di\nrect change in Δp and also indirectly from the\nchange Δω ≈ dω Δp.\ndp"
    },
    {
      "category": "Resource",
      "title": "2008 Midterm",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/084ad5b93883a526d716b0f590123e9b_midterm_08.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\np\n\n18.369 Midterm Exam (Spring 2008)\nApril 7, 2008\nYou have two hours. There are three problems, each\nworth 30 points.\nProblem 1: Waveguide Gaps\nIn figure 1(a) is shown a 2d hollow metallic waveguide of\nwidth L. If we solve for the 2d TM-polarized (Ez only, z-\ninvariant) eigensolutions in this geometry, they are of the\nform:\n\nπn\ni(kx-ωt)\nEz (x, y, t) = sin\ny\ne\n,\nL\nwith n a positive integer and eigenfrequencies (bands)\nωn(k) =\nk2 + (πn/L)2.\n[Useful formulae: given a set of degenerate eigen\nmodes {El} with an unperturbed eigenvalue ω, orthonor\nmalized so that ⟨El, εEm⟩ = δl,m, then you should\nrecall that the first-order perturbations Δω(1) due to a\nsmall Δε are the eigenvalues of the matrix Alm =\n-ω\n2 ⟨El, ΔεEm⟩. And the eigenvalues λ of a 2 × 2 ma\ntrix\na\nb\nare, of course, the roots of λ2 -(a +\nc\nd\nd)λ + (ad -bc) = 0. Some handy trig. identities:\n2 cos2(u) = 1 + cos(2u), 2 sin2(u) = 1 -cos(2u),\n2 sin(u) cos(v) = sin(u + v) + sin(u -v).]\n(a) Now, we will take this waveguide and fill it with a\nsmall periodic (period a) perturbation ±Δε as shown\nin figure 1(b): alternating thickness a/2 layers of\nε = 1 + Δε and ε = 1 -Δε. Sketch the band\ndiagram, assuming a = L/2, by starting with the\n\"folded\" bands for n = 1, 2, 3 (sketched reason\nably quantitatively) and then showing qualitatively\n(no calculations necessary) how they would change\nfor a small Δε ≈0.1. (What happens when an n = 1\nand n = 2 mode cross? What about n = 1 and\nn = 3?)\n(a)\n(metal)\ny=L\ny\nε = 1\nx\ny=0\n(metal)\n(metal)\na/2\na/2\n+Δε\n-Δε\n(b)\n(metal)\ny=L\ny=0\n(metal)\na/2\na/2\n+Δε\n-Δε\na/2\na/2\nd\n(c)\n(metal)\ny=L\ny=L/2\ny=0\nFigure 1: (a) Schematic of a 2d metal waveguide of width\nL, which supports modes propagating along the x direc\ntion. (b) A perturbation ±Δε is introduced via two pe\nriodic layers of thickness a/2 filling the waveguide. (c)\nThe perturbation is modified: for half of the thickness\n(y ∈[0, L/2]), the layers are shifted in the x direction\nby a distance d.\n\n(b) Next, let us further change the perturbation as shown\nin figure 1(c): for half of the waveguide (y ∈\n[0, L/2]), the perturbation is shifted in the x direc\ntion by some distance d. Using first-order perturba\ntion theory, estimate the size of the lowest-ω gap\n(to first-order in Δε, as a fraction of mid-gap) that\nopens at k = π/a in the n = 1 band for two cases:\nd = 0 and d = a/2. [Hint: you can use symmetry\nto eliminate or simplify many of the integrals if you\nchoose your x origin and unperturbed modes appro\npriately.]\n(c) What is the space group of the structure in fig\nure 1(c) (including all rotations, mirrors, transla\ntions, etc.) for the two cases d = 0 and d = a/2?\nφ1\nφ2\nφ3\nφ4\nR\nφN\nφN\nm\nm\nm\nκ\nκ\nProblem 2: Symmetry and Stuff\nFigure 2: N identical masses m arranged on a circle, con-\nAs shown in figure 2, we arrange N identical masses m > nected with spring constants κ, and allowed to slide freely\n0 onto a circle, uniformly spaced, and attach each to its on the circle, where φl denotes the angular displacement\nneighbors by a spring constant κ > 0. The masses are of the l-th mass from its initial position (equally spaced).\nconstrained to move along the circle, and the motion of\neach mass is described by an angle φl as shown, where\n(c) Using your answer from (b), solve for the eigenfre\nφl = 0 corresponds to the initial position for mass l.\nquencies ω and the corresponding eigenvectors.\nIf we assume a time-dependence e-iωt as usual, then\nthe frequencies ω satisfy the eigenproblem Θˆψ = ω2ψ,\n(d) Using your answer from (b), give the projection op\nwhere ψ = (φ1, φ2,\n, φN )T and Θˆ is the N × N real-\nerator onto the irreducible representations. Also,\n· · ·\nsymmetric positive-semi-definite matrix:\nwhat does this operator become in the limit N\n\n-1\n-1\ninf?\n→\n· · ·\n\n-1\n-1\n\n· · ·\n\n.\n\nm\n.\n.\n.\n.\n.\n\nΘˆ = κ\n-1\n-1\n..\n\n..\n..\n..\n..\n..\n\n-1\n-1\n· · ·\n-1\n-1\n· · ·\n(a) Obviously, the system in figure 2 is invariant under\nCN rotations, corresponding to a cyclic shift φ1 →\nφ2, φ2\nφ3, ..., φN-1\nφN , φN\nφ1. Show\n→\n→\n→\nexplicitly that this Θˆ commutes with cyclic shifts.\n(b) Let D(n) be the representation matrix for a rotation\nCn (i.e. a cyclic shift n times). What are the possi-\nN\nble irreducible representations for this group (the\ncyclic group of order N)? [Hint: D(n)D(n ′ ) =\nD(?).]\n\nfrequency ωa\nc\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\nTM modes\nΓ\nX\nM\nΓ\nX\nM\nΓ\na\na\na\na\nb\nc\nd\nd\ne\nf\nFigure 3: TM band diagram of a square lattice (lattice\nconstant a) of circular dielectric rods (right inset) plotted\naround the boundary of the irreducible Brillouin zone (left\ninset). Various points (black dots) are labelled with letters\n(a-f) for future reference.\nProblem 3: Projected Bands\nThe TM band diagram of a square lattice (lattice constant\na) of circular dielectric rods is shown in figure 3. In class,\nwe considered linear defects along the Γ-X direction (e.g.\nremoving a row of rods). Here, we will consider linear\ndefects along the Γ-M (diagonal) direction, with period\na\n√\n2 along that direction.\n(a) Sketch the projected band diagram along the Γ-\nM direction: plot the first two bands of the periodic\ncrystal as a function of the component kd of k along\nthis direction, for the irreducible Brillouin zone in\nkd. On your plot, label with letters a-f the points\ncorresponding to those labelled locations in figure 3.\n(b) Sketch (qualitatively) your best guess for the pro\njected band diagram including the modes of a de\nfect where N adjacent diagonal rows of rods are re\nmoved (e.g. as shown in figure 4 for N = 3). Sketch\nwhat happens as N increases, and in the limit as\nN →inf. You may assume that there are no surface\nstates for this crystal termination. [Hint: it might be\neasier to start with the N →inflimit and then sketch\nFigure 4: Linear defect in the diagonal (Γ-M) direction\nof a square lattice of rods formed by removing N = 3\nadjacent diagonal rows of rods (removed rods shown as\ndashed outlines).\nwhat happens as N decreases.]"
    },
    {
      "category": "Lecture Notes",
      "title": "Coordinate Transformation & Invariance in Electromagnetism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/2963f0bbd1bf3aee9a836efd7440d2c3_coord_transf.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nCoordinate Transformation & Invariance in Electromagnetism\nSteven G. Johnson, notes for the course 18.369 at MIT\nAugust 17, 2007\nIt is a remarkable fact [1] that Maxwell's equations\nunder any coordinate transformation can be written\nin an identical \"Cartesian\" form, if simple transfor\nmations are applied to the materials (ε and μ), the\nfields (E and H), and the sources (ρ and J). This\nresult has numerous useful and/or beautiful conse\nquences, from designs of \"invisibility cloaks\" [2],\nto a simple derivation of PML absorbing boundaries\n[3], to enabling analyses of bent and twisted waveg\nuides in terms analogous to a quantum Stark effect\n[4] , to providing a simple way of applying numer\nical methods designed for Cartesian coordinates to\nother coordinate systems [1].\nHere, we review the proof in a compact form, gen\neralized to arbitrary anisotropic media. (Most previ\nous derivations seem to have been for isotropic me\ndia in at least one coordinate frame [1], or for coordi\nnate transformations with purely diagonal Jacobians\nJ where Jii depends only on xi [3], or for constant\naffine coordinate transforms [5].)\nSummary of the Result\nMaxwell's equations in Cartesian coordinates x are\nwritten (in natural units ε0 = μ0 = 1):\n∂E\n∇× H = ε\n+ J\n(1)\n∂t\n∂H\n∇× E = -μ\n(2)\n∂t\n∇· (εE)\n= ρ\n(3)\n∇· (μH)\n=\n0,\n(4)\nwhere J and ρ are the usual free current and charge\ndensities, respectively, and ε(x) and μ(x) are the\n3 × 3 relative permittivity and permeability tensors,\nrespectively. Now, suppose that we make some (dif\n′\nferentiable) coordinate transformation x 7→ x (usu\nally chosen to be non-singular, with some exceptions\n[2]). Let J denote the 3 × 3 Jacobian matrix:\n∂x′\ni\nJij =\n.\n∂xj\nWe will show that Maxwell's equations take on the\nsame form (1-4) in the primed coordinate system,\nwith ∇ replaced by ∇ ′ , if we make the transforma\ntions:\nE ′ = (J T )-1E,\n(5)\nH ′ = (J T )-1H,\n(6)\nT\nJ εJ\nε ′ =\n,\n(7)\ndet J\nJ μJ T\nμ ′ =\n,\n(8)\ndet J\nJ J\nJ ′ =\n,\n(9)\ndet J\nρ\nρ ′ =\n,\n(10)\ndet J\nwhere J T is the transpose.\nNote that, even if we start out with isotropic mate\nrials (scalar ε and μ), after a coordinate transforma\ntion we in general obtain anisotropic materials (ten\n′\nsors ε and μ ′ ).\n′\nFor example, if x = sx for some scale factor\n′\n′\ns\n0, then ε = ε/s and μ = μ/s, which is pre\n=\ncisely the material scaling required to keep e.g. the\neigenfrequencies fixed under a rescaling of a struc\nture. Note also that if s = -1, i.e. a coordinate in\n′\nversion, then we set E ′ = -E, H ′ = -H, ε = -ε\nand μ ′ = -μ, and the system switches \"handed\nness\" (flipping the sign of the refractive index). [A\nmore common alternative choice in that case would\nbe to set H ′ = H, transforming H as a pseudovector\n[6], while keeping ε and μ unchanged. This corre\nsponds to sprinkling a few factors of sign(det J ) in\nthe above equations, which we are free to do as long\nas the sign is constant.]\n\nProof\nWe will proceed in index notation, employing the\nEinstein convention whereby repeated indices are\nsummed over. Eq. (1) is now expressed:\n∂Ed\n∂aHboabc = εcd\n+ Jc\n(11)\n∂t\nwhere oabc is the usual Levi-Civita permutation ten\nsor and ∂a = ∂/∂xa. Under a coordinate change\n∂x ′\na\nx 7→ x ′ , if we let Jab = ∂xb be the (non-singular)\nJacobian matrix associated with the coordinate trans\nform (which may be a function of x), we have\n∂a = Jba∂b\n′ .\n(12)\nFurthermore, as in eqs. (5-6), let\nEa\n= JbaEb\n′ ,\n(13)\nHa\n= JbaHb\n′ .\n(14)\nHence, eq. (11) becomes\n′\n∂E\nJia∂i\n′ JjbHj\n′ oabc = εcdJld\nl + Jc.\n(15)\n∂t\n′\nHere, the Jia∂i = ∂a derivative falls on both the Jjb\n′\nand Hj terms, but we can eliminate the former thanks\nto the oabc: ∂aJjboabc = 0 because ∂aJjb = ∂bJja.\nThen, again multiplying both sides by the Jacobian\nJkc, we obtain\n′\n∂E\nJkcJjbJia∂i\n′ Hj\n′ oabc = JkcεcdJld\nl + JkcJc\n∂t\n(16)\nNoting that JiaJjbJkcoabc = oijk det J by defini\ntion of the determinant, we finally have\n′\n∂i\n′ Hj\n′ oijk =\nJkcεcdJld\n∂El + JkcJc (17)\ndet J\n∂t\ndet J\nor, back in vector notation,\nJ εJ T ∂E ′\n∇ ′ × H ′ =\n+ J ′ ,\n(18)\ndet J ∂t\nwhere J ′ = J J/ det J according to (9). Thus, we\nsee that we can interpret Ampere's Law in arbitrary\ncoordinates as the usual equation in Euclidean coor\ndinates, as long as we replace the materials etc. by\neqs. (5-7). By an identical argument, we obtain\n∇ ′ × E ′ = - J μJ T ∂H ′\n,\n(19)\ndet J\n∂t\nwhich yields the transformation (8) for μ.\nThe transformation of the remaining divergence\nequations into equivalent forms in the new coordi\nnates is also straightforward. Gauss' Law, eq. (3),\nbecomes\n′\n′\nρ = ∂aεabEb = Jia∂iεabJjbEj\n′\n-1ε ′\n′\n= Jia∂i(det J )Jak\nkj Ej\n= (det J )∂ ′ ε ′ E ′ + (∂aJ -1\ni ij\nj\nak\n= (det J )∂i\n′ εij\n′ Ej\n′ ,\nwhich gives ∇ ′ · (ε ′ E ′ ) = ρ′ for ρ′\ndet J )ε ′ E ′\nkj\nj\n(20)\n= ρ/ det J , cor\nresponding to eq. (10). Similarly for eq. (4). Here,\nwe have used the fact that\n-1\n∂aJak det J = ∂aoanmokij JinJjm/2 = 0, (21)\nfrom the cofactor formula for the matrix inverse, and\nrecalling that ∂aJjboabc = 0 from above. In partic\nular, note that ρ = 0 ⇐⇒ ρ′ = 0 and J = 0 ⇐⇒\nJ ′ = 0, so a non-singular coordinate transformation\npreserves the absence (or presence) of sources.\nReferences\n[1] A. J. Ward and J. B. Pendry, \"Refraction and\ngeometry in Maxwell's equations,\" Journal of\nModern Optics, vol. 43, no. 4, pp. 773-793,\n1996.\n[2] J. B. Pendry, D. Schurig, and D. R. Smith,\n\"Controlling electromagnetic fields,\" Science,\nvol. 312, pp. 1780-1782, 2006.\n[3] F. L. Teixeira and W. C. Chew, \"General closed-\nform PML constitutive tensors to match arbitrary\nbianisotropic and dispersive linear media,\" IEEE\nMicrowave and Guided Wave Letters, vol. 8,\nno. 6, pp. 223-225, 1998.\n[4] S. G. Johnson, M. Ibanescu, M. Skorobogatiy,\nO. Weisberg, T. D. Engeness, M. Soljaciˇ c, S. A.\nJacobs, J. D. Joannopoulos, and Y. Fink, \"Low\nloss asymptotically single-mode propagation in\nlarge-core OmniGuide fibers,\" Optics Express,\nvol. 9, no. 13, pp. 748-779, 2001.\n[5] I. V. Lindell, Methods for Electromagnetic\nFields Analysis. Oxford, U.K.: Oxford Univ.\nPress, 1992.\n[6] J. D. Jackson, Classical Electrodynamics. New\nYork: Wiley, third ed., 1998."
    },
    {
      "category": "Resource",
      "title": "Notes on Perfectly Matched Layers (PMLs)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/70693bac6c1ff1560068017c0aeb41a7_pml.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nNotes on Perfectly Matched Layers (PMLs)\nSteven G. Johnson\nJuly 19, 2008\nAbstract\nThis note is intended as a brief introduction to the theory and practice of per\nfectly matched layer (PML) absorbing boundaries for wave equations, intended\nfor future use in the courses 18.369 and 18.336 at MIT. It focuses on the complex\nstretched-coordinate viewpoint, and also discusses the limitations of PML.\nContents\n1 Introduction\n2 Wave equations\n3 Complex coordinate stretching\n3.1 Analytic continuation . . . . . . . . . . . . . . . . . . . . . . . . . .\n3.2 Coordinate transformation back to real x . . . . . . . . . . . . . . . .\n3.3 Truncating the computational region . . . . . . . . . . . . . . . . . .\n3.4 PML boundaries in other directions . . . . . . . . . . . . . . . . . .\n3.5 Coordinate transformations and materials . . . . . . . . . . . . . . .\n4 PML examples in frequency and time domain\n4.1 An example: PML for 1d scalar waves . . . . . . . . . . . . . . . . .\n4.2 An example: PML for 2d scalar waves . . . . . . . . . . . . . . . . .\n5 PML in inhomogeneous media\n6 PML for evanescent waves\n7 Limitations of PML\n7.1 Discretization and numerical reflections . . . . . . . . . . . . . . . .\n7.2 Angle-dependent absorption . . . . . . . . . . . . . . . . . . . . . .\n7.3 Inhomogeneous media where PML fails . . . . . . . . . . . . . . . .\n\n1 Introduction\nWhenever one solves a PDE numerically by a volume discretization,1 one must truncate\nthe computational grid in some way, and the key question is how to perform this trun\ncation without introducing significant artifacts into the computation. Some problems\nare naturally truncated, e.g. for periodic structures where periodic boundary conditions\ncan be applied. Some problems involve solutions that are rapidly decaying in space,\nso that the truncation is irrelevant as long as the computational grid is large enough.\nOther problems, such as Poisson's equation, involve solutions that vary more and more\nslowly at greater distances--in this case, one can simply employ a coordinate trans\nformation, such as x = tanh x, to remap from x ∈(-inf, inf) to x ∈(-1, 1), and\nsolve the new finite system. However, some of the most difficult problems to truncate\ninvolve wave equations, where the solutions are oscillating and typically decay with\ndistance r only as 1/r(d-1)/2 in d dimensions.2 The slow decay means that simply\ntruncating the grid with hard-wall (Dirichlet or Neumann) or periodic boundary con\nditions will lead to unacceptable artifacts from boundary reflections. The oscillation\nmeans that any real coordinate remapping from an infinite to a finite domain will result\nin solutions that oscillate infinitely fast as the boundary is approached--such fast oscil\nlations cannot be represented by any finite-resolution grid, and will instead effectively\nform a reflecting hard wall. Therefore, wave equations require something different: an\nabsorbing boundary that will somehow absorb waves that strike it, without reflecting\nthem, and without requiring infeasible resolution.\nThe first attempts at such absorbing boundaries for wave equations involved ab\nsorbing boundary conditions (ABCs) [1]. Given a solution on a discrete grid, a bound\nary condition is a rule to set the value at the edge of the grid. For example, a simple\nDirichlet boundary condition sets the solution to zero at the edge of the grid (which\nwill reflect waves that hit the edge). An ABC tries to somehow extrapolate from the\ninterior grid points to the edge grid point(s), to fool the solution into \"thinking\" that it\nextends forever with no boundary. It turns out that this is possible to do perfectly in\none dimension, where waves can only propagate in two directions (±x). However, the\nmain interest for numerical simulation lies in two and three dimensions, and in these\ncases the infinite number of possible propagation directions makes the ABC problem\nmuch harder. It seems unlikely that there exists any efficient method to exactly absorb\nradiating waves that strike a boundary at any possible angle. Existing ABCs restrict\nthemselves to absorbing waves exactly only at a few angles, especially at normal inci\ndence: as the size of the computational grid grows, eventually normal-incident waves\nmust become the dominant portion of the radiation striking the boundaries. Another\ndifficulty is that, in many practical circumstances, the wave medium is not homoge\nneous at the grid boundaries. For example, to calculate the transmission around a\n1As opposed to a boundary discretization, e.g. in boundary-element methods, where the unknowns are\non the interfaces between homogeneous regions, and the homogeneous regions are handled analtyically. In\nthis case, no artificial truncation is required...except in the case of interfaces that extend to infinity, which\nlead to some interesting unsolved problems in boundary-element methods.\n2The square of the solutions are typically related to a rate of energy transport, e.g. the Poynting vector\nin electromagnetism, and energy conservation requires that this decay be proportional to the surface area\nd-1\n∼ r\n.\n\nboundary of truncated region\nregion of interest:\ninteresting phenomena,\nsources,\ninhomogeneous media,\nnonlinearities,\nradiating\nwaves\nperfect absorbing layer?\nreflection\ninfinite space\nregion of interest:\ninteresting phenomena,\nsources,\ninhomogeneous media,\nnonlinearities,\nradiating\nwaves\n(a)\n(b)\nperfect absorbing layer?\nperfect absorbing layer?\nFigure 1: (a) Schematic of a typical wave-equation problem, in which there is some\nfinite region of interest where sources, inhomogeneous media, nonlinearities, etcetera\nare being investigated, from which some radiative waves escape to infinity. (b) The\nsame problem, where space has been truncated to some computational region. An\nabsorbing layer is placed adjacent to the edges of the computational region--a perfect\nabsorbing layer would absorb outgoing waves without reflections from the edge of the\nabsorber.\ndielectric waveguide bend, the waveguide (an inhomogeneous region with a higher in\ndex of refraction) should in principle extend to infinity before and after the bend. Many\nstandard ABCs are formulated only for homogeneous materials at the boundaries, and\nmay even become numerically unstable if the grid boundaries are inhomogeneous.\nIn 1994, however, the problem of absorbing boundaries for wave equations was\ntransformed in a seminal paper by Berenger [2]. Berenger changed the question: in\nstead of finding an absorbing boundary condition, he found an absorbing boundary\nlayer, as depicted in Fig. 1. An absorbing boundary layer is a layer of artificial absorb\ning material that is placed adjacent to the edges of the grid, completely independent of\nthe boundary condition. When a wave enters the absorbing layer, it is attenuated by the\nabsorption and decays exponentially; even if it reflects off the boundary, the returning\nwave after one round trip through the absorbing layer is exponentially tiny. The prob\nlem with this approach is that, whenever you have a transition from one material to\nanother,3 waves generally reflect, and the transition from non-absorbing to absorbing\nmaterial is no exception--so, instead of having reflections from the grid boundary, you\nnow have reflections from the absorber boundary. However, Berenger showed that a\nspecial absorbing medium could be constructed so that waves do not reflect at the in\nterface: a perfectly matched layer, or PML. Although PML was originally derived for\nelectromagnetism (Maxwell's equations), the same ideas are immediately applicable to\nother wave equations.\nThere are several equivalent formulations of PML. Berenger's original formulation\n3Technically, reflections occur when translational symmetry is broken. In a periodic structure (discrete\ntranslational symmetry), there are waves that propagate without scattering, and a uniform medium is just a\nspecial case with period → 0.\n\nis called the split-field PML, because he artificially split the wave solutions into the\nsum of two new artificial field components. Nowadays, a more common formulation\nis the uniaxial PML or UPML, which expresses the PML region as the ordinary wave\nequation with a combination of artificial anisotropic absorbing materials [3]. Both\nof these formulations were originally derived by laboriously computing the solution\nfor a wave incident on the absorber interface at an arbitrary angle (and polarization, for\nvector waves), and then solving for the conditions in which the reflection is always zero.\nThis technique, however, is labor-intensive to extend to other wave equations and other\ncoordinate systems (e.g. cylindrical or spherical rather than Cartesian). It also misses\nan important fact: PML still works (can still be made theoretically reflectionless) for\ninhomogeneous media, such as waveguides, as long as the medium is homogeneous\nin the direction perpendicular to the boundary, even though the wave solutions for\nsuch media cannot generally be found analytically. It turns out, however, that both\nthe split-field and UPML formulations can be derived in a much more elegant and\ngeneral way, by viewing them as the result of a complex coordinate stretching [4, 5,\n6].4 It is this complex-coordinate approach, which is essentially based on analytic\ncontinuation of Maxwell's equations into complex spatial coordinates where the fields\nare exponentially decaying, that we review in this note.\nIn the following, we first briefly remind the reader what a wave equation is, focusing\non the simple case of the scalar wave equation but also giving a general definition. We\nthen derive PML as a combination of two steps: analytic continuation into complex\ncoordinates, then a coordinate transformation back to real coordinates. Finally, we\ndiscuss some limitations of PML, most notably the fact that it is no longer reflectionless\nonce the wave equation is discretized, and common workarounds for these limitations.\n2 Wave equations\nThere are many formulations of waves and wave equations in the physical sciences.\nThe prototypical example is the (source-free) scalar wave equation:\n1 ∂2u\nu\n∇· (a∇u) = b ∂t2 = b\n(1)\nwhere u(x, t) is the scalar wave amplitude and c =\n√\nab is the phase velocity of the\nwave for some parameters a(x) and b(x) of the (possibly inhomogeneous) medium.\nFor lossless, propagating waves, a and b should be real and positive.\nBoth for computational convenience (in order to use a staggered-grid leap-frog dis\ncretization) and for analytical purposes, it is more convenient to split this second-order\nequation into two coupled first-order equation, by introducing an auxiliary field v(x, t):\n∂u\n∂t\n= b∇· v,\n(2)\n∂v = a∇u,\n(3)\n∂t\n4It is sometimes implied that only the split-field PML can be derived via the stretched-coordinate ap\nproach [1], but the UPML media can be derived in this way as well [6].\n\nwhich are easily seen to be equivalent to eq. (1).\nEquations (2-3) can be written more abstractly as:\n∂w\n∂\nu\nu\nˆ\n=\n=\nb∇·\n= Dw\n(4)\n∂t\n∂t\nv\na∇\nv\nfor a 4\n4 linear operator Dˆ and a 4-component vector w = (u; v) (in three di\n×\nmensions). The key property that makes this a \"wave equation\" turns out to be that\nDˆ is an anti-Hermitian operator in a proper choice of inner product, which leads to\noscillating solutions, conservation of energy, and other \"wave-like\" phenomena. Ev\nery common wave equation, from scalar waves to Maxwell's equations (electromag\nnetism) to Schrodinger's equation (quantum mechanics) to the Lame-Navier equations\nfor elastic waves in solids, can be written in the abstract form ∂w/∂t = Dˆw for some\nwave function w(x, t) and some anti-Hermitian operator Dˆ.5 The same PML ideas\napply equally well in all of these cases, although PML is most commonly applied to\nMaxwell's equations for computational electromagnetism.\n3 Complex coordinate stretching\nLet us start with the solution w(x, t) of some wave equation in infinite space, in a\nsituation similar to that in Fig. 1(a): we have some region of interest near the origin\nx = 0, and we want to truncate space outside the region of interest in such a way as\nto absorb radiating waves. In particular, we will focus on truncating the problem in the\n+x direction (the other directions will follow by the same technique). This truncation\noccurs in three conceptual steps, summarized as follows:\n1. In infinite space, analytically continue the solutions and equations to a complex\nx contour, which changes oscillating waves into exponentially decaying waves\noutside the region of interest without reflections.\n2. Still in infinite space, perform a coordinate transformation to express the com\nplex x as a function of a real coordinate. In the new coordinates, we have real\ncoordinates and complex materials.\n3. Truncate the domain of this new real coordinate inside the complex-material\nregion: since the solution is decaying there, as long as we truncate it after a long\nenough distance (where the exponential tails are small), it won't matter what\nboundary condition we use (hard-wall truncations are fine).\nFor now, we will make two simplifications:\n- We will assume that the space far from the region of interest is homogeneous\n(deferring the inhomogeneous case until later).\n- We will assume that the space far from the region of interest is linear and time-\ninvariant.\n5See e.g. Ref. [7]\n\nX\nUnder these assumptions, the radiating solutions in infinite space must take the form of\na superposition of planewaves:\nw(x, t) =\nWk,ωe i(k·x-ωt),\n(5)\nk,ω\nfor some constant amplitudes Wk,ω, where ω is the (angular) frequency and k is the\nwavevector. (In an isotropic medium, ω and k are related by ω = c|k| where c(ω) is\nsome phase velocity, but we don't need to assume that here.) In particular, the key fact\nis that the radiating solutions may be decomposed into functions of the form\nW(y, z)e i(kx-ωt).\n(6)\nThe ratio ω/k is the phase velocity, which can be different from the group velocity\ndω/dk (the velocity of energy transport, in lossless media). For waves propagating\nin the +x direction, the group velocity is positive. Except in very unusual cases, the\nphase velocity has the same sign as the group velocity in a homogeneous medium,6 so\nwe will assume that k is positive.\n3.1 Analytic continuation\nThe key fact about eq. (6) is that it is an analytic function of x. That means that we\ncan freely analytically continue it, evaluating the solution at complex values of x. The\noriginal wave problem corresponds to x along the real axis, as shown in the top panels\nof Fig. 2, which gives an oscillating eikx solution. However, if instead of evaluating\nx along real axis, consider what happens if we evaluate it along the contour shown in\nthe bottom-left panel of Fig. 2, where for Re x > 5 we have added a linearly growing\nimaginary part. In this case, the solution is exponentially decaying for Re x > 5,\nbecause eik(Re x+i Im x) = eik Re xe-k Im x is exponentially decaying (for k > 0) as\nIm x increases. That is, the solution in this region acts like the solution in an absorbing\nmaterial.\nHowever, there is one crucial difference here from an ordinary absorbing material:\nthe solution is not changed for Re x < 5, where x is no different from before. So, it\nnot only acts like an absorbing material, it acts like a reflectionless absorbing material,\na PML.\nThe thing to remember about this is that the analytically continued solution satisfies\nthe same differential equation. We assumed the differential equation was x-invariant\n∂\nin this region, so x only appeared in derivatives like ∂x, and the derivative of an an\nalytic function is the same along any dx direction in the complex plane. So, we have\nsucceeded in transforming our original wave equation to one in which the radiating\nsolutions (large |x|) are exponentially decaying, while the part we care about (small x)\nis unchanged. The only problem is that solving differential equations along contours in\nthe complex plane is rather unfamiliar and inconvenient. This difficulty is easily fixed.\n6The formulation of PML absorbers when the phase velocity has sign opposite to the group velocity, for\nexample in the\"left-handed media\" of electromagnetism, is somewhat more tricky [8, 9].\n\nreal x contour\noriginal oscillating solution\n0.5\n0.5\nIm x\nIm x\nexp(ikx)\nexp(ikx)\n-0.5\n-0.5\n-1\n-1\nRe x\nRe x\ndeformed x contour\nsolution on deformed contour\nabsorbing region\n0.5\n0.5\nabsorbing region\n-0.5\n-0.5\n-1\n-1\nRe x\nRe x\nFigure 2: Top: real part of original oscillating solution eikx (right) corresponds to x\nalong the real axis in the complex-x plane (left). Bottom: We can instead evaluate\nthis analytic function along a deformed contour in the complex plane: here (left) we\ndeform it to increase along the imaginary axis for x > 5. The eikx solution (right) is\nunchanged for x < 5, but is exponentially decaying for x > 5 where the contour is\ndeformed, corresponding to an \"absorbing\" region.\n\n3.2 Coordinate transformation back to real x\nFor convenience, let's denote the complex x contour by x , and reserve the letter x for\nthe real part. Thus, we have x (x) = x + if(x), where f(x) is some function indicating\nhow we've deformed our contour along the imaginary axis. Since the complex coordi\nnate x is inconvenient, we will just change variables to write the equations in terms of\nx, the real part!\nChanging variables is easy. Whereever our original equation has ∂x (the differential\nalong the deformed contour x ), we now have ∂x = (1 + i df )∂x. That's it! Since our\ndx\noriginal wave equation was assumed x-invariant (at least in the large-x regions where\nf = 0), we have no other substitutions to make. As we shall soon see, it will be\ndf\nσx(x)\nconvenient to denote\n=\n, for some function σx(x). [For example, in the\ndx\nω\nbottom panel of Fig. 2, we chose σx(x) to be a step function: zero for x ≤5 and a\npositive constant for x > 5, which gave us exponential decay.] In terms of σx, the\nentire process of PML can be conceptually summed up by a single transformation of\nour original differential equation:\n∂\n∂ .\n(7)\n∂x →\n1 + i σx(x) ∂x\nω\nIn the PML regions where σx > 0, our oscillating solutions turn into exponentially\ndecaying ones. In the regions where σx = 0, our wave equation is unchanged and\nthe solution is unchanged: there are no reflections because this is only an analytic\ncontinuation of the original solution from x to x , and where x = x the solution cannot\nchange.\nWhy did we choose σx/ω, as opposed to just σx? The answer comes if we look at\nwhat happens to our wave eikx. In the new coordinates, we get:\nR\nikx - k\nx σx(x ′ )dx ′\ne\ne\nω\n.\n(8)\nNotice the factor k/ω, which is equal to 1/cx, the inverse of the phase velocity cx in\nthe x direction. In a dispersionless material (e.g. vacuum for light), cx is a constant\nindependent of velocity for a fixed angle, in which case the attenuation rate in the PML\nis independent of frequency ω: all wavelengths decay at the same rate! In contrast,\nif we had left out the 1/ω then shorter wavelengths would decay faster than longer\nwavelengths. On the other hand, the attenuation rate is not independent of the angle of\nthe light, a difficulty discussed in Sec. 7.2.\n3.3 Truncating the computational region\nOnce we have performed the PML transformation (7) of our wave equations, the solu\ntions are unchanged in our region of interest (small x) and exponentially decaying in\nthe outer regions (large x). That means that we can truncate the computational region\nat some sufficiently large x, perhaps by putting a hard wall (Dirichlet boundary con\ndition). Because only the tiny exponential tails \"see\" this hard wall and reflect off it,\nand even they attenuate on the way back towards the region of interest, the effect on the\nsolutions in our region of interest will be exponentially small.\n\nIn fact, in principle we can make the PML region as thin as we want, just by making\nσx very large (which makes the exponential decay rate rapid), thanks to the fact that\nthe decay rate is independent of ω (although the angle dependence can be a problem,\nas discussed in Sec. 7.2). However, in practice, we will see in Sec. 7.1 that using a very\nlarge σx can cause \"numerical reflections\" once we discretize the problem onto a grid.\nInstead, we turn on σx(x) quadratically or cubically from zero, over a region of length\na half-wavelength or so, and in practice the reflections will be tiny.\n3.4 PML boundaries in other directions\nSo far, we've seen how to truncate our computational region with a PML layer in the\n+x direction. What about other directions? The most important case to consider is\nthe -x direction. The key is, in the -x direction we do exactly the same thing: apply\nthe PML transformation (7) with σx > 0 at a sufficiently large negative x, and then\ntruncate the computational cell. This works because, for x < 0, the radiating waves\nare propagating in the -x direction with k < 0 (negative phase velocity), and this\nmakes our PML solutions (8) decay in the opposite direction (exponentially decaying\nas x →-inf) for the same positive σx.\nNow that we have dealt with ±x, the ±y and ±z directions are easy: just do the\nsame transformation, except to ∂/∂y and ∂/∂z, respectively, using functions σy(y) and\nσz(z) that are non-zero in the y and z PML regions. At the corners of the computational\ncell, we will have regions that are PML along two or three directions simultaneously\n(i.e. two or three σ's are nonzero), but that doesn't change anything.\n3.5 Coordinate transformations and materials\nWe will see below that, in the context of the scalar wave equation, the 1 + iσ/ω\nterm from the PML coordinate transformation appears as, effectively, an artificial\nanisotropic absorbing material in the wave equation (effectively changing a and b to\ncomplex numbers, and a tensor in the case of a). At least in the case of Maxwell's\nequations (electromagnetism), this is an instance of a more general theorem: Maxwell's\nequations under any coordinate transformation can be expressed as Maxwell's equa\ntions in Cartesian coordinates with transformed materials.7 That is, the coordinate\ntransform is \"absorbed\" into a change of the permittivity ε and the permeability μ\n(generally into anisotropic tensors). This is the reason why UPML, which constructs\nreflectionless anisotropic absorbers, is equivalent to a complex coordinate stretching:\nit is just absorbing the coordinate stretching into the material tensors.\n4 PML examples in frequency and time domain\nAs we have seen, in frequency domain, when we are solving for solutions with time-\ndependence e-iωt, PML is almost trivial: we just apply the PML transformation (7)\n7This theorem appears to have been first clearly stated and derived by Ward and Pendry [10], and is\nsummarized in a compact general form by my course notes [11].\n\nto every ∂ derivative in our wave equation. (And similarly for derivatives in other\n∂x\ndirections, to obtain PML boundaries in different directions.)\nIn the time domain, however, things are a bit more complicated, because we chose\nour transformation to be of the form 1+iσ/ω: our complex \"stretch\" factor is frequency-\ndependent in order that the attenuation rate be frequency-independent. But how do we\nexpress a 1/ω dependence in the time domain, where we don't have ω (i.e. the time-\ndomain wave function may superimpose multiple frequencies at once)? One solution is\nto punt, of course, and just use a stretch factor 1 + iσ/ω0 for some constant frequency\nω0 that is typical of our problem; as long as our bandwidth is narrow enough, our atten\nuation rate (and thus the truncation error) will be fairly constant. However, it turns out\nthat there is a way to implement the ideal 1/ω dependence directly in the time domain,\nvia the auxiliary differential equation (ADE) approach.\nThis approach is best illustrated by example, so we will consider PML boundaries\nin the x direction for the scalar wave equation in one and two dimensions. (It turns out\nthat an ADE is not required in 1d, however.)\n4.1 An example: PML for 1d scalar waves\nLet's consider the 1d version of the scalar wave equation (2-3):\n∂u\n∂v\n= b\n= -iωu\n∂t\n∂x\n∂v\n∂u\n= a\n= -iωv,\n∂t\n∂x\nwhere we have substituted an e-iωt time-dependence. Now, if we perform the PML\ntransformation (7), and multiply both sides by 1 + iσx/ω, we obtain:\n∂v\nb\n= -iωu + σxu\n∂x\na\n= -iωv + σxv.\n∂x\nThe 1/ω terms have cancelled, and so in this 1d case we can trivially turn the equations\nback into their time-domain forms:\n∂u\n∂v\n∂t = b∂x -σxu\n∂v\n∂u\n= a∂x -σxv.\n∂t\nNotice that, for σx > 0, the decay terms have exactly the right sign to make the solu\ntions decay in time if u and v were constants in space. Similarly, they have the right\nsign to make it decay in space whereever σx > 0. But this is a true PML: there are zero\nreflections from any boundary where we change σx, even if we change σx discontinu\nously (not including the discretization problems mentioned above).\nBy the way, the above equations reveal why we use the letter σ for the PML absorp\ntion coefficient. If the above equations are interpreted as the equations for electric (u)\n∂u\n\nand magnetic (v) fields in 1d electromagnetism, then σ plays the role of a conductivity,\nand conductivity is traditionally denoted by σ. Unlike the usual electrical conductiv\nity, however, in PML we have both an electric and a magnetic conductivity, since we\nhave terms corresponding to currents of electric and magnetic charges. There is no rea\nson we need to be limited to physical materials to construct our PML for a computer\nsimulation!\n4.2 An example: PML for 2d scalar waves\nUnfortunately, the 1d case above is a little too trivial to give you the full flavor of\n∂t = b∇\n∂x\n∂y = -iωu\nhow PML works. So, let's go to a 2d scalar wave equation (again for e-iωt time-\ndependence):\n∂u\n· v = b\n+ b\n∂vx\n∂vy\n∂vx\n∂u\n= a\n= -iωvx\n∂t\n∂x\n∂vy\n∂u\n∂t = a∂y = -iωvy.\nAgain performing the PML transformation (7) of ∂ in the first two equations, and\n∂x\nmultiplying both sides by 1 + iσx/ω, we obtain:\n∂vx\n∂vy\nσx\nb ∂x + b ∂y\n1 + i ω\n= -iωu + σxu\n∂u\na\n= -iωvx + σxvx.\n∂x\nThe the second equation is easy to transform back to time domain, just like for the 1d\nscalar-wave equation: -iω becomes a time derivative. The first equation, however,\nposes a problem: we have an extra ibσx ∂vy term with an explicit 1/ω factor. What do\nω\n∂y\nwe do with this?\nIn a Fourier transform, -iω corresponds to differentiation, so i/ω corresponds to\nintegration: our problematic 1/ω term is the integral of another quantity. In particular,\nlet's introduce a new auxiliary field variable ψ, satisfying\n-iωψ = bσx\n∂vy ,\n∂y\nin which case\nb∂vx + b∂vy + ψ = -iωu + σxu.\n∂x\n∂y\nNow, we can Fourier transform everything back to the time-domain, to get a set of four\ntime-domain equations with PML absorbing boundaries in the x direction that we can\nsolve by our favorite discretization scheme:\n∂u\n∂t = b∇· v -σxu + ψ\n\n∂vx\n∂u\n= a\n∂t\n∂x -σxvx\n∂vy\n∂u\n= a\n∂t\n∂y\n∂ψ\n∂vy\n= bσx\n,\n∂t\n∂y\nwhere the last equation for ψ is our auxiliary differential equation (with initial condi\ntion ψ = 0). Notice that we have σx absorption terms in the u and vx equation, but not\nfor vy: the PML corresponds to an anisotropic absorber, as if a were replaced by the\n2 × 2 complex tensor\n\n1 + i σx\n-1\na\nωa\n.\na\nThis is an example of the general theorem alluded to in Sec. 3.5 above.\n5 PML in inhomogeneous media\nThe derivation above didn't really depend at all on the assumption that the medium\nwas homogenous in (y, z) for the x PML layer. We only assumed that the medium\n(and hence the wave equation) was invariant in the x direction for sufficiently large\nx. For example, instead of empty space we could have a waveguide oriented in the x\ndirection (i.e. some x-invariant yz cross-section). Regardless of the yz dependence,\ntranslational invariance implies that radiating solutions can be decomposed into a sum\nof functions of the form of eq. (6), W(y, z)ei(kx-ωt). These solutions W are no longer\nplane waves. Instead, they are the normal modes of the x-invariant structure, and k is\nthe propagation constant. These normal modes are the subject of waveguide theory in\nelectromagnetism, a subject extensively treated elsewhere [12, 13]. The bottom line is:\nsince the solution/equation is still analytic in x, the PML is still reflectionless.8\n6 PML for evanescent waves\nIn the discussion above, we considered waves of the form eikx and showed that they\nbecame exponentially decaying if we replace x by x(1 + iσx/ω) for σ > 0. However,\nthis discussion assumed that k was real (and positive). This is not necessarily the case!\nIn two or more dimensions, the wave equation can have evanescent solutions where\nk is complex, most commonly where k is purely imaginary. For example consider a\nplanewave ei(k·x-ωt) in a homogeneous two-dimensional medium with phase velocity\n8There is a subtlety here because, in unusual cases, uniform waveguides can support \"backward-wave\"\nmodes where the phase and group velocities are opposite, i.e. k < 0 for a right-traveling wave [14, 15, 16,\n17]. It has problems even worse than those reported for left-handed media [8, 9], because the same frequency\nhas both \"right-handed\" and \"left-handed\" modes; a deeper analysis of this interesting case is the subject of\nan upcoming paper (P.-R. Lo and S. G. Johnson, 2008).\n\nq\nr\nc, i.e. ω = c|k| = c\nkx 2 + ky2. In this case,\nω2\nk = kx =\nc2 -ky2 .\nFor sufficiently large ky (i.e. high-frequency Fourier components in the y direction), k\nis purely imaginary. As we go to large x, the boundary condition at x →infimplies\nthat we must have Im k > 0 so that eikx is exponentially decaying.\nWhat happens to such a decaying, imaginary-k evanescent wave in the PML medium?\nLet k = iκ. Then, in the PML:\ne -κx\ne -κx-i σx x .\n(9)\nω\n→\nThat is, the PML added an oscillation to the evanescent wave, but did not increase its\ndecay rate. The PML is still reflectionless, but it didn't help.\nOf course, you might object that an evanescent wave is decaying anyway, so we\nhardly need a PML--we just need to make the computational region large enough and\nit will go away on its own. This is true, but it would be nice to accelerate the process:\nin some cases κ = Im k may be relatively small and we would need a large grid for\nit to decay sufficiently. This is no problem, however, because nothing in our analysis\nrequired σx to be real. We can just as easily make σx complex, where Im σx < 0 corre\nsponds to a real coordinate stretching. That is, the imaginary part of σx will accelerate\nthe decay of evanescent waves in eq. (9) above, without creating any reflections.\nAdding an imaginary part to σx does come at a price, however. What it does to\nthe propagating (real k) waves is to make them oscillate faster, which exacerbates the\nnumerical reflections described in Sec. 7.1. In short, everything in moderation.\n7 Limitations of PML\nPML, while it has revolutionized absorbing boundaries for wave equations, especially\n(but not limited to) electromagnetism, is not a panacea. Some of the limitations and\nfailure cases of PML are discussed in this section, along with workarounds.\n7.1 Discretization and numerical reflections\nFirst, and most famously, PML is only reflectionless if you are solving the exact wave\nequations. As soon as you discretize the problem (whether for finite difference or\nfinite elements), you are only solving an approximate wave equation and the analytical\nperfection of PML is no longer valid.\nWhat is left, once you discretize? PML is still an absorbing material: waves that\npropagate within it are still attenuated, even discrete waves. The boundary between the\nPML and the regular medium is no longer reflectionless, but the reflections are small\nbecause the discretization is (presumably) a good approximation for the exact wave\nequation. How can we make the reflections smaller, as small as we want?\n\nThe key fact is that, even without a PML, reflections can be made arbitrarily small\nas long as the medium is slowly varying. That is, in the limit as you \"turn on\" absorp\ntion more and more slowly, reflections go to zero due to an adiabatic theorem [18].\nWith a non-PML absorber, you might need to go very slowly (i.e. a very thick absorb\ning layer) to get acceptable reflections [19]. With PML, however, the constant factor\nis very good to start with, so experience shows that a simple quadratic or cubic turn-\non of the PML absorption usually produces negligible reflections for a PML layer of\nonly half a wavelength or thinner [1, 19]. (Increasing the resolution also increases the\neffectiveness of the PML, because it approaches the exact wave equation.)\n7.2 Angle-dependent absorption\nAnother problem is that the PML absorption depends on angle. In particular, consider\neq. (8) for the exponential attenuation of waves in the PML, and notice that the attenu\nation rate is proportional to the ratio k/ω. But k, here, is really just kx, the component\nof the wavevector k in the x direction (for a planewave in a homogeneous medium).\nThus, the attenuation rate is proportional to |k| cos θ, where θ is the angle the radiat\ning wave makes with the x axis. As the radiation approaches glancing incidence, the\nattenuation rate goes to zero! This means that, for any fixed PML thickness, waves\nsufficiently close to glancing incidence will have substantial \"round-trip\" reflections\nthrough the PML.\nIn practice, this is not as much of a problem as it may sound like at first. In most\ncases, all of the radiation originates in a localized region of interest near the origin, as\nin Fig. 1. In this situation, all of the radiation striking the PML will be at an angle\nθ < 55* ≈cos-1(1/\n√\n3) in the limit as the boundaries move farther and farther away\n(assuming a cubic computational region). So, if the boundaries are far enough away, we\ncan guarantee a maximum angle and hence make the PML thick enough to sufficiently\nabsorb all waves within this cone of angles.\n7.3 Inhomogeneous media where PML fails\nFinally, PML fails completely in the case where the medium is not x-invariant (for\nan x boundary) [19]. You might ask: why should we care about such cases, as if\nthe medium is varying in the x direction then we will surely get reflections (from the\nvariation) anyway, PML or no PML? Not necessarily.\nThere are several important cases of x-varying media that, in the infinite system,\nhave reflectionless propagating waves. Perhaps the simplest is a waveguide that hits the\nboundary of the computational cell at an angle (not normal to the boundary)--one can\nusually arrange for all waveguides to leave the computational region at right angles,\nbut not always (e.g. what if you want the transmission through a 30* bend?). Another,\nmore complicated and perhaps more challenging case is that of a photonic crystal:\nfor a periodic medium, there are wave solutions (Bloch waves) that propagate without\nscattering, and can have very interesting properties that are unattainable in a physical\nuniform medium [20].\nFor any such case, PML seems to be irrevocably spoiled. The central idea behind\nPML was that the wave equations, and solutions, were analytic functions in the direc\n\ntion perpendicular to the boundary, and so they could be analytically continued into the\ncomplex coordinate plane. If the medium is varying in the x direction, it is most likely\nvarying discontinously, and hence the whole idea of analytic continuation goes out the\nwindow.\nWhat can we do in such a case? Conventional ABCs don't work either (they are\ntypically designed for homogeneous media). The only fallback is the adiabatic theo\nrem alluded to above: even a non-PML absorber, if turned on gradually enough and\nsmoothly enough, will approach a reflectionless limit. The difficulty becomes how\ngradual is gradual enough, and in finding a way to make the non-PML absorber a\ntractable thickness [19].\nReferences\n[1] A. Taflove and S. C. Hagness, Computational Electrodynamics: The Finite-\nDifference Time-Domain Method. Norwood, MA: Artech, 2000.\n[2] J.-P. Berenger, \"A perfectly matched layer for the absorption of electromagnetic\nwaves,\" J. Comput. Phys., vol. 114, no. 1, pp. 185-200, 1994.\n[3] Z. S. Sacks, D. M. Kingsland, R. Lee, and J. F. Lee, \"A perfectly matched\nanisotropic absorber for use as an absorbing boundary condition,\" IEEE Trans.\nAntennas and Propagation, vol. 43, no. 12, pp. 1460-1463, 1995.\n[4] W. C. Chew and W. H. Weedon, \"A 3d perfectly matched medium from modified\nMaxwell's equations with stretched coordinates,\" Microwave and Optical Tech.\nLett., vol. 7, no. 13, pp. 599-604, 1994.\n[5] C. M. Rappaport, \"Perfectly matched absorbing boundary conditions based on\nanisotropic lossy mapping of space,\" IEEE Microwave and Guided Wave Lett.,\nvol. 5, no. 3, pp. 90-92, 1995.\n[6] F. L. Teixeira and W. C. Chew, \"General closed-form PML constitutive tensors to\nmatch arbitrary bianisotropic and dispersive linear media,\" IEEE Microwave and\nGuided Wave Lett., vol. 8, no. 6, pp. 223-225, 1998.\n[7] S. G. Johnson, \"Notes on the algebraic structure of wave equations.\" Online\nat http://math.mit.edu/~stevenj/18.369/wave-equations.\npdf, August 2007.\n[8] S. A. Cummer, \"Perfectly matched layer behavior in negative refractive index\nmaterials,\" IEEE Antennas and Wireless Propagation Lett., vol. 3, pp. 172-175,\n2004.\n[9] X. T. Dong, X. S. Rao, Y. B. Gan, B. Guo, and W. Y. Yin, \"Perfectly matched\nlayer-absorbing boundary condition for left-handed materials,\" IEEE Microwave\nand Wireless Components Lett., vol. 14, no. 6, pp. 301-303, 2004.\n[10] A. J. Ward and J. B. Pendry, \"Refraction and geometry in Maxwell's equations,\"\nJ. Mod. Opt., vol. 43, no. 4, pp. 773-793, 1996.\n\n[11] S. G. Johnson, \"Coordinate transformation and invariance in electromagnetism:\nnotes for the course 18.369 at MIT..\" Online at http://math.mit.edu/\n~stevenj/18.369/coordinate-transform.pdf, April 2007.\n[12] A. W. Snyder, \"Radiation losses due to variations of radius on dielectric or optical\nfibers,\" IEEE Trans. Microwave Theory Tech., vol. MTT-18, no. 9, pp. 608-615,\n1970.\n[13] D. Marcuse, Theory of Dielectric Optical Waveguides. San Diego: Academic\nPress, second ed., 1991.\n[14] P. J. B. Clarricoats and R. A. Waldron, \"Non-periodic slow-wave and backward-\nwave structures,\" J. Electron. Contr., vol. 8, pp. 455-458, 1960.\n[15] R. A. Waldron, \"Theory and potential applications of backward waves in nonpe\nriodic inhomogeneous waveguides,\" Proc. IEE, vol. 111, pp. 1659-1667, 1964.\n[16] A. S. Omar and K. F. Schunemann, \"Complex and backward-wave modes in in-\nhomogeneously and anisotropically filled waveguides,\" IEEE Trans. Microwave\nTheory Tech., vol. MTT-35, no. 3, pp. 268-275, 1987.\n[17] M. Ibanescu, S. G. Johnson, D. Roundy, C. Luo, Y. Fink, and J. D. Joannopou\nlos, \"Anomalous dispersion relations by symmetry breaking in axially uniform\nwaveguides,\" Phys. Rev. Lett., vol. 92, p. 063903, 2004.\n[18] S. G. Johnson, P. Bienstman, M. Skorobogatiy, M. Ibanescu, E. Lidorikis, and\nJ. D. Joannopoulos, \"Adiabatic theorem and continuous coupled-mode theory for\nefficient taper transitions in photonic crystals,\" Phys. Rev. E, vol. 66, p. 066608,\n2002.\n[19] A. F. Oskooi, L. Zhang, Y. Avniel, and S. G. Johnson, \"The failure of perfectly\nmatched layers, and towards their redemption by adiabatic absorbers,\" Optics\nExpress, vol. 16, pp. 11376-11392, July 2008.\n[20] J. D. Joannopoulos, R. D. Meade, and J. N. Winn, Photonic Crystals: Molding\nthe Flow of Light. Princeton Univ. Press, 1995."
    },
    {
      "category": "Resource",
      "title": "Notes on the Algebraic Structure of Wave Equations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/e9165ee281f6db686e9dbdc1a556e045_wave_equations.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nNotes on the algebraic structure\nof wave equations\nSteven G. Johnson\nAugust 17, 2007\nThere are many examples of wave equations in the physical sciences, characterized\nby oscillating solutions that propagate through space and time while, in lossless media,\nconserving energy. Examples include the scalar wave equation (e.g. pressure waves\nin a gas), Maxwell's equations (electromagnetism), Schrodinger's equation (quantum\nmechanics), elastic vibrations, and so on. From an algebraic perspective, all of these\nshare certain common features. They can all be written abstractly in a form\n∂w = Dˆw + s\n(1)\n∂t\nwhere w(x, t) is some vector-field wave function characterizing the solutions (e.g. a\n6-component electric+magnetic field in electromagnetism), Dˆ is some linear operator\n(using the \"hat\" notation from quantum mechanics to denote linear operators), neglect\ning nonlinear effects, and s(x, t) is some source term. The key property of Dˆ for a wave\nequation is that it is anti-Hermitian, as opposed to a parabolic equation (e.g. a diffusion\nequation) where Dˆ is Hermitian and negative semi-definite. From this anti-Hermitian\nproperty follow familiar features of wave equations, such as oscillating/propagating\nsolutions and conservation of energy. In many cases, we will set s = 0 and focus on\nthe source-free behavior.\nIn the following note, we first derive some general properties of eq. (1) from the\ncharacteristics of Dˆ, and then give examples of physical wave equations that can be\nwritten in this form and have these characteristics.\nContents\nGeneral properties of wave equations\n1.1\nHarmonic modes and Hermitian eigenproblems . . . . . . . . . . . .\n1.2\nPlanewave solutions . . . . . . . . . . . . . . . . . . . . . . . . . . .\n1.3\nTime evolution and conservation of energy . . . . . . . . . . . . . . .\n1.4\nOff-diagonal block form and reduced-rank eigenproblems . . . . . . .\n1.5\nHarmonic sources and reciprocity\n. . . . . . . . . . . . . . . . . . .\nThe scalar wave equation\n\nMaxwell's equations\nThe one-way scalar wave equation\nThe Schrodinger equation\nElastic vibrations in linear solids\n6.1\nScalar pressure waves in a fluid or gas . . . . . . . . . . . . . . . . .\n6.2\nEigenequations and constraints . . . . . . . . . . . . . . . . . . . . .\nThe scalar wave equation in space\nGeneral properties of wave equations\nIn lossless media, Dˆ turns out to be an anti-Hermitian operator under some inner\nproduct (w, w0) between any two fields w(x, t) and w0(x, t) at a given time t. This\nmeans that (w, Dˆw0) = -(Dˆw, w0) for any w, w0: Dˆ flips sign when it moves from\none side to the other of an inner product. This is proven below for several common\nwave equations. Formally, Dˆ + = -Dˆ, where + is the adjoint: for any operator Aˆ,\n(w, Aˆw0) = ( Aˆ+w, w0) by definition of Aˆ+.\nThe anti-Hermitian property of Dˆ immediately leads to many useful consequences,\nand in particular the features that make the equation \"wave-like:\"\n1.1\nHarmonic modes and Hermitian eigenproblems\nFirst, we can write down an eigen-equation for the harmonic-mode solutions w(x, t) =\nW(x)e-iωt, assuming Dˆ is linear and time-invariant. Substituting W(x)e-iωt into\neq. (1) for the source-free s = 0 case, we obtain:\nωW = iDˆW,\n(2)\nwhich is a Hermitian eigenproblem: if Dˆ is anti-Hermitian, then iDˆ is Hermitian. It\nthen follows that the eigenvalues ω are real and that solutions W can be chosen orthog\nonal. Notice that the real eigenvalues ω corresponds directly to our assumption that the\nmedium has no dissipation (or gain)--if ω were complex, waves would exponentially\ndecay (or grow), but instead they oscillate forever in time. For any reasonable physical\nproblem, it also follows that the eigenmodes are a complete basis for all w, so they\ncompletely characterize all solutions.1\n1.2\nPlanewave solutions\nSecond, the most familar feature of wave equations is the existence of not just oscilla\ntion in time (real ω), but oscillation in space as well. In particular, with a wave equation\n1Technically, we require Dˆ or its inverse to be compact, which is true as long as we have a reasonable\ndecaying Green's function [1]. This is almost always true for physical wave problems, but functional analysts\nlove to come up with pathological exceptions to this rule.\n\none immediately thinks of sinusoidal planewave solutions ∼ ei(k·x-ωt) for some real\nwave vector k. These solutions arise in any equation of the anti-Hermitian form (1)\nthat additionally has translational symmetry (the medium is homogeneous).\nIntuitively, translational symmetry means that Dˆ is the same at different points in\nspace. Formally, we can make this precise by defining a translation operator Tˆd that\ntakes a function w(x, t) and translates it in space by a displacement d:\nTˆdw(x, t) = w(x - d, t).\nWhen we say that Dˆ has translational symmetry, we mean that Dˆ is the same if we\nfirst translate by some d, then operate Dˆ, then translate back: Dˆ = Tˆd\n-1DˆTˆd, or\nequivalently Dˆ commutes with Tˆd:\nDˆTˆd = TˆdDˆ\nfor all displacements d. When one has commuting operators, however, one can choose\nsimultaneous eigenvectors of both operators [2] . That means that the eigenvectors\nWˆ (x) of iDˆ (and Dˆ) can be written in the form of eigenfunctions of Tˆd, which are\nexponential functions eik·x for some k:\nw(x, t) = W(x)e-iωt = W0e i(k·x-ωt)\n(3)\nfor some constant vector W0 (depending on k and ω) determined by Dˆ. The wave\nvector k must be real if we require our states to be bounded for all x (not exponentially\ngrowing in any direction).2 For each k, there will be a discrete set of eigenfrequencies\nωn(k), called the dispersion relation or the band structure of the medium.\nLet us also mention two generalizations, both of which follow from the broader\nviewpoint of group representation theory [3, 4]. First, the existence of planewave solu\ntions can be thought of as a consequence of group theory. The symmetry operators that\ncommute with Dˆ form the symmetry group (or space group) of the problem (where the\ngroup operation is simply composition), and it can be shown that the eigenfunctions of\nDˆ can be chosen to transform as irreducible representations of the symmetry group.\nFor the translation group {Tˆd | d ∈ R3}, the irreducible representations are the expo\nnential functions {e-ik·d}, but more complicated and interesting representations arise\nwhen one includes rotations and other symmetries. Second, in order to get wave solu\ntions, one need not require Dˆ to commute with Tˆd for all d. It is sufficient to require\ncommutation for d = R = n1R1 + n2R2 + n3R3 on a discrete periodic lattice R\nwith primitive lattice vectors R` (and any n` ∈ Z): Dˆ is periodic, with discrete trans\nlational symmetry. In this case, one obtains the Bloch-Floquet theorem (most famous\nin solid-state physics): the eigenfunctions W can be chosen in the form of a plane\n2Complex k solutions are called evanescent waves, and can appear if Dˆ is only translationally invariant\nover a finite region (e.g. if the medium is piecewise-constant). Even the real k solutions are a bit weird\nbecause they are not normalizable: keik·xk2 is not finite! By admitting such solutions, we are technically\nemploying a \"rigged\" Hilbert space, which requires a bit of care but is not a major problem. Alternatively,\nwe can put the whole system in a finite L × L × L box with periodic boundary conditions, in which case\nthe components of k are restricted to discrete multiples of 2π/L, and take the limit L →inf at the end of\nthe day.\n\nwave multiplied by a periodic Bloch envelope. More explicitly, one has Bloch wave\nsolutions:\nw(x, t) = Wk,n(x)e i[k·x-ωn(k)t],\n(4)\nwhere Wk,n(x) is a periodic function (invariant under translation by any R in the\nlattice) satisfying the Hermitian eigenproblem:\nωn\n= ie-ik· Deik·\n(k)Wk,n\nx ˆ\nxWk,n.\nThe planewave case (3) [continuous translational symmetry] is simply the special case\nof the Bloch wave (4) [discrete translational symmetry] in the limit where the lattice\nvectors become infinitesimal (|R`| → 0).\n1.3\nTime evolution and conservation of energy\nThird, we obtain conservation of energy in the absence of sources (s = 0), where we\ndefine the \"energy\" of a field w as its norm kwk2 = (w, w). The proof that kwk2\nis conserved for s = 0 (sources would add or remove energy) is elementary, given an\nanti-Hermitian Dˆ:\n∂\n∂kwk2\n=\n(w, w) = ( w , w)+(w, w ) = ( Dˆw, w)+(w, Dˆw) = ( Dˆw, w)-(Dˆw, w) = 0.\n∂t\n∂t\nThis works even if Dˆ is time-dependent, which may seem surprising: if you take a wave\nequation and \"shake it\" by varying Dˆ rapidly in time, you might think you could add\nenergy to the system. But no: a time-varying Dˆ can alter the frequency of the solution\n(which is not conserved in a time-varying problem), but not the energy. However, this\nis not the whole story, because Dˆ is not the only possible source of time-dependent\nbehavior: the definition of our inner product (w, w0) can depend on t as well. In fact,\nwe will see that this is often possible for physical systems such as Maxwell's equations\nor even the scalar wave equation. In particular, our inner product is often of the form\n(w, w0) = (w, Pˆw0)0, where (·, )0 denotes an inner product independent of time and\n·\nPˆ is some positive-definite Hermitian operator depending on the wave medium, which\nmay depend on time. In this case, when taking the time derivative of kwk2, we also get\na term (w, ∂\n∂t\nPˆ w)0, which is not in general zero. So, a time-varying medium can break\nconservation of energy if the time variation changes the norm.\nIf Dˆ is time-independent, we can easily write down the explicit solution of the\ninitial-value problem. In this case eq. (1) for s = 0 is solved formally by the operator\nexponential:\nDt\nw(x, t) = e\nˆ w(x, 0) = Uˆtw(x, 0)\nˆ\nfor an initial condition w(x, 0) and a time-evolution operator Uˆt = eDt. Because Dˆ\nis anti-Hermitian, it flips sign when it switches sides in an inner product, and hence Uˆt\nDt to ˆ\nDt\nUˆ -1\nˆ\nchanges from Uˆt = e ˆ\nU + = e- ˆ =\nt\n= U-t. This means that Uˆt is a unitary\nt\noperator, and hence\nUˆtw\n= ( Uˆtw, Uˆtw) = ( Uˆ -1Uˆtw, w) = kwk 2\nt\n.\nThus, kwk2 does not change as the field evolves in time: energy is conserved!\n\n1.4\nOff-diagonal block form and reduced-rank eigenproblems\nThere is another variant on the eigenequation (2) ωW = iDˆW: if we operate iDˆ again\non both sides, we get ω2W = -Dˆ 2W, where -Dˆ 2 is automatically Hermitian and\npositive semi-definite. Why would we want to do this? The main reason is that Dˆ often\n(not always) has a special block form:\nˆ\n\nDˆ2\n\nD =\nˆ\n,\n(5)\nD1\nfor some operators Dˆ1 and Dˆ2, in which case Dˆ 2 is block diagonal:\nDˆ 2 =\nDˆ2\nDˆ1\nDˆ1\nDˆ2\n.\nThis means that the ω2W = -Dˆ 2W problem breaks into two lower-dimensional\neigenproblems with operators -Dˆ1Dˆ2 and -Dˆ2Dˆ1. In particular, let us break our\nsolution w into two pieces:\n\nw1\nw =\nw2\nwhere Dˆk operates on wk, and suppose that our inner product also divides additively\nbetween these two pieces:\n(w, w0) = (w1, w1\n0 )1 + (w2, w2\n0 )2\nin terms of some lower-dimensional inner products (·, )1 and (·, )2. In this case, from\n·\n·\nthe fact that -Dˆ 2 is Hermitian positive semi-definite under (\n), it immediately fol\n·, ·\nlows that -Dˆ2Dˆ1 is Hermitian positive semi-definite under (·, )1 and -Dˆ 1Dˆ2 is Her\n·\nmitian positive semi-definite under (·, )2. (To prove this, just write down the Hermitian\n·\npositive-semidefinite property of -Dˆ 2 for wk = 0 with k = 1, 2.) We therefore have\nobtained two smaller Hermitian positive semi-definite eigenproblems\n-Dˆ2Dˆ1W1 = ω2W1,\n(6)\n-Dˆ1Dˆ2W2 = ω2W2,\n(7)\nagain with real ω solutions and orthogonality relations on the Wk.3\nMoreover, each of these has to give all of the eigenfrequencies ω. Every eigen\nfunction of Dˆ must obviously be an eigenfunction of Dˆ 2, and the converse is also true:\ngiven an eigenvector W1 of eq. (6) with eigenvalue ω2, to get an eigenvector W of Dˆ\nwith eigenvalue ω we just set\nW2 = i Dˆ1W1.\n(8)\nω\n3The fact that they are positive semi-definite (and often positive-definite, since it is typically possible to\nexclude the ω = 0 solutions) is especially advantageous for numerical methods. Some of the best iterative\neigensolver methods are restricted to positive-definite Hermitian problems, for example [5].\n\nThis formula looks a bit suspicious in the case where ω = 0: the static (non-oscillatory)\nsolutions. For these (usually less-interesting) static solutions, the W1 and W2 eigen\nproblems decouple from one another and we can just set W2 = 0 in W. Similarly, if\nwe solve for an eigenvector W2 of eq. (7), we can construct W via W1 = iDˆ2W2/ω\nfor ω = 0 or set W1 = 0 for ω = 0.\nWe lost the sign of ω by squaring it (which is precisely why we can solve an eigen\nproblem of \"half\" the size), but this doesn't matter: ω = ±\n√\nω2 both yield eigenso\nlutions W by (8). Therefore, in problems of the block form (5), the eigenvalues ω\nalways come in positive/negative pairs. In the common case where Dˆ1 and Dˆ2 are\npurely real, the eigenvectors W1 (or W2) can also be chosen real, we can therefore\nobtain real solutions w by adding the +ω and -ω eigenfunctions (which are complex\nconjugates).\n1.5\nHarmonic sources and reciprocity\nThe most important kind of source s is a harmonic source\ns(x, t) = S(x)e-iωt .\nIn this case, we are looking for the steady-state response w = W(x)e-iωt. Substitut\ning these into eq. (1) problem of solving for W(x) is now in the form of an ordinary\nlinear equation, rather than an eigenproblem:\niDˆ - ω W = OˆW = -iS.\nNotice that the operator Oˆ = iDˆ - ω on the left-hand side is Hermitian. Suppose\nthat we solve the equation twice, with sources S(1) and S(2) to get solutions W(1) and\nW(2). Then, the Hermitian property means that we obtain the following identity for\nthe inner product:\n(W(1), S(2)) = (W(1), i OˆW(2)) = (-iOˆW(1), W(2)) = -(S(1), W(2)).\nThis is almost the same as a very well known property of wave equations, known as\nreciprocity. The reason it is only almost the same is that reciprocity relations normally\nuse an unconjugated \"inner product,\" assuming Oˆ is not only Hermitian but real (or\ncomplex-symmetric). This gets rid of the minus sign on the right-hand side, for one\nthing. It also only requires iDˆ to be complex-symmetric (Hermitian under an uncon\njugated inner product) rather than Hermitian, which allows reciprocity to apply even\nto systems with dissipation. (It also simplifies some technical difficulties regarding the\nboundary conditions at infinity.) See e.g. Ref. [6].\nWhat if Oˆ is not real or complex-symmetric, e.g. in the common case where Dˆ is\nreal-antisymmetric? Can we still have reciprocity with an unconjugated inner product?\nIn this case, we can often instead express reciprocity using the block form (5), since in\nthat case the operator is real-symmetric if Dˆ is real, as described below.\nJust as for the eigenproblem, it is common when we have the block form (5) of Dˆ to\nbreak the problem into a smaller linear equation for W1 or W2, similarly subdividing\n\nZ\nZ\nS = (S1; S2). For example, the equation for W1 is\n(-Dˆ2Dˆ1 - ω2)W1 = -iωS1 + Dˆ2S2.\n(9)\nFor example, in the case of the scalar wave equation below, this equation becomes a\ninhomogeneous scalar Helmholtz equation. Again, notice that the operator -Dˆ2Dˆ1 -\nω2 on the left-hand side is Hermitian. In fact, it is often purely real-symmetric (or\ncomplex-symmetric in a system with dissipation), which allows us to derive recprocity\nusing an unconjugated inner product as described above.\nThe scalar wave equation\nThere are many formulations of waves and wave equations in the physical sciences, but\nthe prototypical example is the (source-free) scalar wave equation:\n1 ∂2u\nu\nr · (aru) = b ∂t2 = b\n(10)\nwhere u(x, t) is the scalar wave amplitude and c =\n√\nab is the phase velocity of the\nwave for some parameters a(x) and b(x) of the (possibly inhomogeneous) medium.4\nThis can be written in the form of eq. (1) by splitting into two first-order equations, in\nterms of u and a new vector variable v satisfying aru = v and br · v = u :\n\n∂w = ∂\nu\n=\nbr·\nu\n= Dˆw\n∂t\n∂t\nv\nar\nv\nfor a 4 × 4 linear operator Dˆ and a 4-component vector w = (u; v), in 3 spatial\ndimensions.\nNext, we need to show that Dˆ is anti-Hermitian, for the case of lossless media\nwhere a and b are real and positive. To do this, we must first define an inner product\n(w, w0) by the integral over all space:\n\n(w, w0) =\nu∗ b-1 u0 + v∗ a-1v0\nd3x,\nwhere ∗ denotes the complex conjugate (allowing complex w for generality).\nNow, in this inner product, it can easily be verified via integration by parts that:\n(u, Dˆu0) =\n[u∗r · v0 + v∗ · ru0] d3x, = · · · = -(Dˆu, u0),\nwhich by definition means that Dˆ is anti-Hermitian. All the other properties--conservation\nof energy, real eigenvalues, etcetera--then follow.\nAlso, note that the -Dˆ 2 eigenproblem in this case gives us more-convenient smaller\neigenproblems, as noted earlier: -br·(aru) = ω2u, and -ar(br·v) = ω2v. (These\nmay not look Hermitian, but remember our inner product.) And in the harmonic-source\ncase, we get an operator -Dˆ2Dˆ1-ω2 = -br·ar-ω2 when solving for u via (9)--for\nthe common case a = b = 1, this is the scalar Helmholtz operator -(r2 + ω2).\n4More generally, a may be a 3 × 3 tensor in an anisotropic medium.\n\nZ\nZ\nZ\nMaxwell's equations\nMaxwell's equations, in terms of the electric field E, magnetic field H, dielectric per\nmittivity ε and magnetic permeability μ, are:\n∂(μH)\nr × E = -\n∂t\n∂(εE)\nr × H =\n∂t\n+ J,\nwhere J is a current source; J = 0 in the source-free case. The other two Maxwell's\nequations r · εE = 0 and r · μH = 0 express constraints on the fields (in the absence\nof free charge) that are preserved by the above two dynamical equations, and can thus\nbe ignored for the purposes of this analysis (they are just constraints on the initial con\nditions). For simplicity, we restrict ourselves to the case where ε and μ do not depend\non time: the materials may vary with position x, but they are not moving or chang\ning.5 ε and μ may also be 3 × 3 tensors rather than scalars, in an anisotropic medium,\nbut we assume that they are Hermitian positive-definite in order to be a lossless and\ntransparent medium. In this case, the equations can be written in the form of (1) via:\n\n∂w = ∂\nE\n=\nε r×\nE\n+\n-J/ε\n= Dˆw + s,\n∂t\n∂t\nH\n- μ r×\nH\nwhere w here is a 6-component vector field.\nTo show that this Dˆ is anti-Hermitian, we must again define an inner product by an\nintegral over space at a fixed time:\n(w, w0) =\n[E∗ (εE0) + H∗ (μH0)] d3x,\n·\n·\nwhich is precisely the classical electromagnetic energy in the E and H fields (for non-\ndispersive materials) [7]!\nGiven this inner product, the rest is easy, given a single vector identity: for any\nvector fields F and G, r· (F × G) = G · (r×\nR F) - F (r× G). This vector identity\n·\nR\nallows us to integrate r× by parts easily:\nF · (r × G) =\nG · (r × F) plus a\nsurface term (from the divergence theorem) that goes to zero assuming kFk and kGk\nare < inf.\nNow we can just plug in (w, Dˆw0) and integrate by parts:\n(w, Dˆw0)\n=\n[E∗ · (r × H0) - H∗ · (r × E0)] d3x\n=\n[(r × E)∗ · H0 - (r × H)∗ · E0] d3x = (-Dˆw, w0).\nThus, Dˆ is Hermitian and conservation of energy, real ω, orthogonality, etcetera follow.\n5One can get very interesting physics by including the possibility of time-varying materials!\n\nR\n\nAgain, Dˆ is in the block form (5), so the Dˆ 2 eigenproblem simplifies into two\nseparate Hermitian positive semi-definite eigenproblems for E and H:\nε r × ( μ r × E) = ω2E,\n(11)\nμ r × ( ε r × H) = ω2H.\n(12)\nThese convenient formulations are a more common way to write the electromagnetic\neigenproblem [8] than (2). Again, they may not look very Hermitian because of the\n1/ε and 1/μ terms multiplying on the left, but don't forget the ε and μ factors in\nour inner product, which makes these operators Hermitian.6\nTherefore, for exam\nple, two different eigensolutions E1 and E2 are orthogonal under the inner product\n(E1, E2)E =\nE∗ (εE2) = 0. Bloch's theorem (4) for this Hermitian eigenproblem\n1 ·\nin the case of periodic materials leads to photonic crystals [8].\nRecall that something funny happens at ω = 0, where E and H decouple. In this\ncase, there are infinitely many ω = 0 static-charge solutions with r · εE = 0\nand/or\n= 0. For ω = 0, r · εE = 0 and r · μH = 0 follow automatically from the\nr · μH 6\nequations -iωεE = r × H and iωμH = r × E. (These divergence equations are\njust Gauss' laws for the free electric and magnetic charge densities, respectively.)\nIn the case with a current source J = 0\n, we can solve for E via eq. (9), which here\nbecomes:\n\nε r × μ r × -ω2 E = iωJ/ε,\nor (multiplying both sides by ε)\nr × μ r × -ω2ε E = iωJ.\nThe operator on the left side is Hermitian in lossless media, or complex-symmetric in\nmost dissipative materials where ε and μ are complex scalars. This gives rise to the\nwell-known Rayleigh-Carson and Lorentz reciprocity relations [9, 6].\nThe one-way scalar wave equation\nAs a break from the complexity of Maxwell's equations, let's look at the source-free\none-way scalar wave equation:\n∂u\n∂u\n-c\n=\n,\n∂x\n∂t\n6Alternatively, if we defined inner products without the ε and μ, we could write it as a generalized\nR\nHermitian eigenproblem. For example, if we used the inner product (E, E0) =\nE∗\nE0, we would\n·\nwrite the generalized Hermitian eigenproblem r × ( μ\n1 r × E) = ω2εE. This gives the same result: for\ngeneralized Hermitian eigenproblems ˆ\nBu, the orthogonality relation is (u1, Bu2) = 0 for distinct\nAu = λ ˆ\nˆ\neigenvectors u1 and u2. This formulation is often more convenient than having ε or μ factors \"hidden\"\ninside the inner product.\n\nZ\nR\nwhere c(x) > 0 is the phase velocity. This is a one-way wave equation because, for\nc = constant, the solutions are functions u(x, t) = f(x - ct) traveling in the +x\ndirection only with speed c.\n∂\nThis equation is already in our form (1), with Dˆ = -c ∂x , which is obviously\nanti-Hermitian under the inner product\ninf u∗u0\n(u, u0) =\ndx,\nc\n-inf\nvia elementary integration by parts. Hence energy is conserved, we have real eigenval\nues, orthogonality, and all of that good stuff. We don't have the block form (5), which\nis not surprising: we can hardly split this trivial equation into two simpler ones.\nThe Schrodinger equation\nPerhaps the most famous equation in form (1) is the Schrodinger equation of quantum\nmechanics:\n\n∂ψ\ni\n~2\n∂t = - ~ - 2m r2 + V\nψ,\nfor the wave function ψ(x, t) of a particle with mass m in a (real) potential V (x).\nFamous, not so much because Schrodinger is more well known than, say, Maxwell's\nequations, but rather because the Schrodinger equation (unlike Maxwell) is commonly\ntaught almost precisely in the abstract form (1) [2, 10], where the operator Dˆ is given\nby\n\nˆ\ni ˆ\ni\n~2\nD = - ~ H = - ~ - 2m r2 + V\nfor the Hamiltonian operator Hˆ . This is the equation where many students delve into\nabstract Hermitian operators and Hilbert spaces for the first time.\nR\nThe fact that Hˆ is Hermitian under the inner product (ψ, ψ0) =\nψ∗ψ0, and hence\nDˆ is anti-Hermitian, is well known (and easy to show via integration by parts). From\nthis follow the familar properties of the Schrodinger equation. The eigenvalues ω are\ninterpreted as the energies E = ~ω, which are real (like any quantum observable), and\nthe eigenstates ψ are orthogonal. Conservation of \"energy\" here means that\n|ψ|2 is a\nconstant over time, and this is interpreted in quantum mechanics as the conservation of\nprobability.\nAgain, we don't have a block form (5) for the Schrodinger problem, nor do we want\nit. In this case, the operator Dˆ is not real, and we do distinguish positive and negative\nω (which give very different energies E!). We want to stick with the full eigenproblem\nˆ\nHψ = Eψ, thank you very much. Bloch's theorem (4) for\nDψ = ωψ, or equivalently ˆ\nthis Hermitian eigenproblem in the case of a periodic potential V leads to the field of\nsolid-state physics for crystalline materials [11, 12].\n\nZ\nElastic vibrations in linear solids\nOne of the more complicated wave equations is that of elastic (acoustic) waves in\nsolid media, for which there are three kinds of vibrating waves: longitudinal (pres\nsure/compression) waves and two orthogonal transverse (shear) waves. All of these\nsolutions are characterized by the displacement vector u(x, t), which describes the\ndisplacement u of the point x in the solid at time t.\nIn the linear regime, an isotropic elastic medium is characterized by its density ρ\nand the Lame elastic constants μ and λ: μ is the shear modulus and λ = K - 2\n3 μ,\nwhere K is the bulk modulus. All three of these quantities are functions of x for an\ninhomogeneous medium. The displacement u then satisfies the Lame-Navier equation\n[13, 14]:\n∂2u\n\nρ\n= r(λr · u) + r · μ ru + (ru)T\n+ f,\n(13)\n∂t2\nwhere f(x, t) is a source term (an external force density). This notation requires a bit\nof explanation. By ru, we mean the rank-2 tensor (3 × 3 matrix) with (m, n)th entry\n∂um/∂xn (that is, its rows are the gradients of each component of u), and (ru)T is\nthe transpose of this tensor. By the divergence r· of such a tensor, we mean the vector\nformed by taking the divergence of each column of the tensor (exactly like the usual\nrule for taking the dot product of a vector with a 3 × 3 matrix).\nClearly, we must break eq. (13) into two first-order equations in order to cast it\ninto our abstract form (1), but what variables should we choose? Here, we can be\nguided by the fact that we eventually want to obtain conservation of energy, so we can\nlook at what determines the physical energy of a vibrating wave. The kinetic energy\nis obviously the integral of 2\n1 ρ|v|2, where v is the velocity u , so v should be one of\nour variables. To get the potential energy, is convenient to first define the (symmetric)\nstrain tensor ε [14]:\nε =\nru + (ru)T ,\n(14)\nwhich should look familiar because 2ε appears in eq. (13). In terms of ε, the poten\ntial energy density is then μ tr(ε+ε) + λ| tr ε|2/2, where + is the conjugate-transpose\n(adjoint) [14]. Note also that tr ε = r · u, by definition of ε.\nTherefore, we should define our wave field w as the 9-component w = (v; ε), with\nan inner product\n\n(w, w0) =\nρv∗ v0 + 2μ tr(ε+ε0) + λ(tr ε)∗(tr ε0) d3x,\n·\nso that kwk2 is the physical energy. Now, in terms of v and ε, our equations of motion\nmust be:\n∂w\n∂\nv\n\nˆ\n\nv\n\nf/ρ\n\n=\n=\nD2\n+\n= Dˆw + s,\n∂t\n∂t\nε\nDˆ1\nε\nwith\nε = Dˆ 1v = 1\nrv + (rv)T\n,\n(15)\n\nZ h\ni\nZ\nZ\np\nR\nv = Dˆ2ε = 1 [r(λ tr ε) + 2r · (με)] .\nρ\nNow, we can check that Dˆ is anti-Hermitian (assuming lossless materials, i.e. real λ\nand μ). For compactness, we will use the Einstein index notation that repeated indices\nare summed, e.g. a b = anbn with an implicit sum over n since it is repeated, and let\n·\n∂k denote ∂x\n∂\nk . Then, plugging in the definitions above and integrating by parts:\n(w, Dˆw0) = 1\nρv∗ (Dˆ2ε0) + 2μ tr(ε+Dˆ1v0) + λ(tr ε)∗(tr Dˆ1v0) d3x\n·\n=\n[v∗ (∂mλε0\n+ 2∂nμε0\n) + 2με∗ ∂mv0\n)∗(∂nv0 )] d3x\nm\nnn\nnm\nmn\nn + λ(εmm\nn\n= -1\n\n(λ∂mvm)∗ ε0\n+ (2μ∂nvm\n+ (2∂mμεmn)∗ v0 + (∂nλεmm)∗v0\nd3x\nnn\n)∗ εnm\nn\nn\n= ( Dˆw, w0).\nNote that we used the symmetry of ε to write 2 tr(ε+Dˆ1v0) = ε∗\nn +ε∗ ∂nv0 =\nmn∂mv0\nmn\nm\n2ε∗ ∂mvn\n0 .\nmn\nWe are done! After a bit of effort to define everything properly and prove the\nanti-Hermitian property of Dˆ, we can again immediately quote all of the useful general\nproperties of wave equations: oscillating solutions, planewaves in homogeneous media,\nconservation of energy, and so on!\n6.1\nScalar pressure waves in a fluid or gas\nFor a fluid or gas, the shear modulus μ is zero--there are no transverse waves--and\nλ is just the bulk modulus. In this case, we can reduce the problem to a scalar wave\nequation in terms of the pressure P = -λr · u = - tr ε. We obtain precisely the\nscalar wave equation (10) if we set a = 1/ρ, b = λ, u = P , and v = -u (the velocity,\nwith a sign flip by the conventions defined in our scalar-wave section). The wave speed\nis c =\nλ/ρ. Our \"energy\" in the scalar wave equation is again interpreted as (twice)\nthe physical energy: the integral of (twice) the potential energy P 2/λ and (twice) the\nkinetic energy ρ|v|2 .\n6.2\nEigenequations and constraints\nAgain, we have the block form (5) of Dˆ, so again we can write an eigenproblem for ω2\nby solving for harmonic v or ε individually. Given a harmonic u = U(x)e-iωt, the\nequation for U just comes from the eigen-equation for v = -iωUe-iωt, which is just\nthe same as plugging a harmonic u into our original equation (13):\n\nω2U = -\nr(λr · U) + r · μ rU + (rU)T\n,\nρ\nwhich again is a Hermitian positive semi-definite eigenproblem thanks to the factor of\nρ in our inner product (U, U0) =\nρU∗ U0. (Alternatively, one obtains a generalized\n·\nHermitian eigenproblem for an inner product without ρ.) Bloch's theorem (4) for this\n\nZ\nHermitian eigenproblem in the case of periodic materials leads to the study of phononic\ncrystals [15].\nWe could also write the eigenequation in terms of ε, of course. Sometimes, ε is\nmore convenient because of how boundary conditions are expressed in elastic problems\n[14]. However, in the case of ε we need to enforce the constraint\nr × (r × ε)T = 0,\n(16)\nwhich follows from the definition (14) of ε in terms of u. Note that the curl of a tensor,\nhere, is defined as the curl of each column of the tensor, so r × (r × ε)T means that\nwe take the curl of every row and column of ε. This is zero because ε is defined as the\nsum of a tensor whose rows are gradients and its transpose, and the curl of a gradient\nis zero. The same constraint also follows from eq. (15) for ω = 0\n, which is part of the\neigenequation, but ε is decoupled from eq. (15) for ω = 0 and in that case we need to\nimpose (16) explicitly [14].\nThe scalar wave equation in space\nNow, let's consider something a little different. We'll start with the scalar wave equa\ntion from above, aru = v and br · v = u , but instead of solving for u and v as a\nfunction of time t, we'll solve the equations as a function of space for harmonic modes\nu(x, t) = U(x)e-iωt and v(x, t) = V(x)e-iωt with ω = 0\n. In particular, we'll pick\none direction, z, and look at propagation along the z direction. Plugging these har\nmonic modes into the scalar wave equations, and putting all of the ∂/∂z derivatives on\nthe left-hand side, we obtain:\n\n∂w = ∂\nU\n=\n-iω\na\n-\na\niω\nU\n= Dˆw,\n∂z\n∂z\nVz\nb + rt · iω rt\nVz\n∂\n∂\nwhere rt = xˆ\n+ yˆ ∂y denotes the \"transverse\" (xy) del operator, and we have\n∂x\neliminated the transverse components Vt of V via -iωVt = artU . This is again of\nthe form of our abstract equation (1), with z replacing t! But is this Dˆ anti-Hermitian?\nLet's define our \"inner product\" via an integral over the xy plane:\n(w, w0) =\n[U ∗Vz\n0 + U 0Vz\n∗] d2x.\n(17)\nThis is actually not a true inner product by the strict definition, because it is not positive\ndefinite: it is possible for kwk2 = (w, w) to be non-positive for w = 0. We'll have\nˆ\nto live with the consequences of that later. But first, let's verify that (w, Dw0) =\n-(Dˆw, w0) for real a and b, via integration by parts:\nZ\n\n(w, Dˆw0) =\nU ∗\niω U 0\na\niω V 0\nV ∗ d2x\n- b\n+ U ∗rt · iω rtU 0 + - a\nz\nz\nZ\n\niω\n∗\na\niω\n∗\niω\n= -\n- b U\nU 0 + (rt · iω rtU ∗)U 0 + - b Vz\n+ Vz\n- a Vz\n∗\nd2x\n= -(Dˆw, w0).\n\nSo Dˆ is \"anti-Hermitian,\" but in a \"fake\" inner product. To figure out the consequences\nof this, we have to go back to our original abstract derivations and look carefully to see\nwhere (if at all) we relied on the positive-definite property of inner products.\nLooking back at our proof, we see that we didn't rely on positive-definiteness at all\nin our derivation of conservation of energy; we just took the derivative of (w, w). So,\n\"energy\" is conserved in space. What does that mean? Equation (17) can be interpreted\nas an integral of a time-average energy flux through the xy plane at z. Conservation of\nenergy means that, in the absence of sources, with a steady-state (harmonic) solution,\nenergy cannot be building up or decaying at any z.\nWhat about the Hermitian eigenproblem? What is the eigenproblem? We already\nhave time-harmonic solutions. We can set up an eigenproblem in z only when the\nproblem (i.e., a and b) is z-invariant (analogous to the time-invariance required for\ntime-harmonic modes).7 In a z-invariant problem, the z direction is separable and we\ncan look for solutions of the form w(x, y, z) = W(x, y)eiβz , where β is a propagation\nconstant. Such solutions satisfy\niDˆW = βW,\nwhich is a Hermitian eigenproblem but in our non-positive norm. Now, if one goes\nback to the derivation of real eigenvalues for Hermitian eigenproblems, something goes\nwrong: the eigenvalue β is only real if (W, W) = 0\n.\nThis, however is a useful and important result, once we recall that (W, W) is the\n\"energy flux\" in the z direction. Modes with real β are called propagating modes, and\nthey have non-zero flux: propagating modes transport energy since (W, W) = 0\nfor a\ntypical real-β mode.8 Modes with complex (most often, purely imaginary) β are called\nevanescent modes, and they do not transport energy since (W, W) = 0 for them.\nWhat about orthogonality? Again, going back to the derivation of orthogonality\nfor Hermitian eigenproblems, and not assuming the eigenvalues are real (since they\naren't for evanescent modes). The orthogonality condition follows from the equation\n[β∗ -β0] (W, W0) = 0 for eigensolutions W and W0 with eigenvalues β and β0. That\n·\nis, modes are orthogonal if their eigenvalues are not complex conjugates. Moreover,\nsince iDˆ is purely real, the eigenvalues must come in complex-conjugate pairs. This\nvery useful, because it means if we want a field \"parallel\" to some eigenfield W and\northogonal to all the other eigenfields, we just use the eigenfield with the conjugate\neigenvalue to W. And since Dˆ is real, that is just W∗! So, in short, we have:\n(W∗, W0) = 0\nfor distinct eigenvectors W and W0: the eigenvectors are orthogonal under the uncon\njugated \"inner product.\"\nWhy have we gone through all this analysis of what seems like a rather odd prob\nlem? Because this is a simpler version of something that turns out to be extremely\nuseful in more complicated wave equations. In particular, the z-propagation version of\nthe time-harmonic Maxwell equations plays a central role in understanding waveguides\nand \"coupled-wave theory\" in electromagnetism [16].\n7Actually, we only need it to be periodic in z, in which case we can look for Bloch modes.\n8It is possible to have standing-wave modes with real β and (W, W) = 0, but these mainly occur at\nβ = 0 (where symmetry causes the flux to be zero).\n\nReferences\n[1] I. Gohberg, S. Goldberg, and M. A. Kaashoek, Basic Classes of Linear Operators.\nBasel: Birkhauser, 2000.\n[2] C. Cohen-Tannoudji, B. Din, and F. Laloe, Quantum Mechanics. Paris: Hermann,\n1977.\n[3] M. Tinkham, Group Theory and Quantum Mechanics. New York: Dover, 2003.\n[4] T. Inui, Y. Tanabe, and Y. Onodera, Group Theory and Its Applications in Physics.\nHeidelberg: Springer, 1996.\n[5] Z. Bai, J. Demmel, J. Dongarra, A. Ruhe, and H. Van Der Vorst, eds., Templates\nfor the Solution of Algebraic Eigenvalue Problems: A Practical Guide. Philadel\nphia: SIAM, 2000.\n[6] R. J. Potton, \"Reciprocity in optics,\" Reports Prog. Phys., vol. 67, pp. 717-754,\n2004.\n[7] J. D. Jackson, Classical Electrodynamics. New York: Wiley, third ed., 1998.\n[8] J. D. Joannopoulos, R. D. Meade, and J. N. Winn, Photonic Crystals: Molding\nthe Flow of Light. Princeton Univ. Press, 1995.\n[9] L. Landau, E. M. Lifshitz, and L. P. Pitaevskii, Electrodynamics of Continuous\nMedia. Oxford: Butterworth-Heinemann, 2nd ed., 1984.\n[10] J. J. Sakurai, Modern Quantum Mechanics. Reading, MA: Addison-Wesley, re\nvised ed., 1994.\n[11] C. Kittel, Introduction to Solid State Physics. New York: Wiley, 1996.\n[12] N. W. Ashcroft and N. D. Mermin, Solid State Physics. Philadelphia: Holt Saun\nders, 1976.\n[13] L. D. Landau and E. M. Lifshitz, Theory of Elasticity. London: Pergamon, 1959.\n[14] W. S. Slaughter, The Linearized Theory of Elasticity. Boston: Birkhauser, 2002.\n[15] M. M. Sigalas and E. N. Economou, \"Elastic and acoustic wave band structure,\"\nJ. Sound and Vibration, vol. 158, no. 2, pp. 377-382, 1992.\n[16] S. G. Johnson, P. Bienstman, M. Skorobogatiy, M. Ibanescu, E. Lidorikis, and\nJ. D. Joannopoulos, \"Adiabatic theorem and continuous coupled-mode theory for\nefficient taper transitions in photonic crystals,\" Phys. Rev. E, vol. 66, p. 066608,\n2002."
    },
    {
      "category": "Resource",
      "title": "MPB Demo",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/18-369-mathematical-methods-in-nanophotonics-spring-2008/c48b4a8dbd314f30f769481ed1e57ff2_mpb_demo.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n\n18.369 Mathematical Methods in Nanophotonics\nSpring 2008\n\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n>> foo = dlmread('foo.dat', ',', 1, 1)\nMPB Demo\n-- numerical Maxwell eigensolver on MIT Server\n>> kx = foo(:,2)\n>> f = foo(:,6:end)\n>> plot(kx, f, 'ro-')\nFor more information on MPB, see also the MPB web page at http://ab-\n>> hold on\ninitio.mit.edu/mpb (which includes a link to documentation). All of these files and\n>> plot(kx, kx, 'k', 'LineWidth', 2)\nlinks can also be found on the course web page.\n>> patch([kx;flipud(kx)], [kx; ones(size(kx))*max(kx)], [0.9,0.9,0.9])\nThe following are a sequence of MIT Server and Matlab commands that I will (hopefully)\n% grep tmyoddfreqs: 2dwaveguide.out > foo.dat\nuse in class to perform a simple calculation and analyze the output. Here, we analyze\na simple 2d waveguide formed by an ε=12 region with thickness 1, surrounded by air.\n>> foo = dlmread('foo.dat', ',', 1, 1)\nThe MPB input file, 2dwaveguide.ctl, is on the following page. The last page is the\ninput file and commands for a more complicated problem--a 2d waveguide formed\nby a periodic sequence of dielectric cylinders.\nA note on units: Since Maxwell's equations are scale-invariant, there is no need for\nMPB to settle on any particular units. Instead, you simply pick whatever units of\ndistance you want -- typically you select some characteristic lengthscale a in the\nsystem and set that equal to 1. Then, you specify a wavevector k to MPB in units of\n2π/a, and the frequencies ω are returned in units of 2πc/a. See also the MPB manual\nfor more details (it gets more complicated for 2d-periodic systems, where the lattice\nor reciprocal lattice vectors are used as a basis for vectors or wavevectors).\n% foo = unix command\n>> foo = Matlab command\n% add mpb\n% mpb 2dwaveguide.ctl > 2dwaveguide.out\n% cat 2dwaveguide.out\n% grep tmyevenfreqs: 2dwaveguide.out > foo.dat\n>> fo = foo(:,6:end)\n>> plot(kx, fo, 'bo-')\n>> plot(kx, kx / sqrt(12), 'k')\n% h5ls epsilon.h5\n>> ep = hdf5read('epsilon.h5', 'data')\n>> figure\n>> plot(ep, 'k')\n% h5ls e.k01.b01.z.tm.h5\n>> ez1 = hdf5read('e.k01.b01.z.tm.h5', 'z.r') +\nhdf5read('e.k01.b01.z.tm.h5','z.i') * i;\n>> plot(real(ez1) * 100, 'r');\n>> ez2 = hdf5read('e.k01.b02.z.tm.h5', 'z.r') +\nhdf5read('e.k01.b02.z.tm.h5','z.i') * i;\n>> plot(real(ez2) * 100, 'b');\n>> ez3 = hdf5read('e.k01.b03.z.tm.h5', 'z.r') +\nhdf5read('e.k01.b03.z.tm.h5','z.i') * i;\n>> plot(real(ez3) * 100, 'm');\n>> (ep .* ez1) * ez3'\n\n; Example MPB input file for 18.325, illustrating a simple 2d dielectric\n; waveguide along the x direction. Run it with:\n;\nmpb 2dwaveguide.ctl > 2dwaveguide.out\n; to produce an output file 2dwaveguide.out (as well as some .h5 data files).\n; As described in the manual, you can extract the eigenfrequencies\n; by doing \"grep freqs: 2dwaveguide.out\" at the Unix shell.\n; (Note that anything after a \";\" on a line is ignored by MPB.)\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; First, we will define some parameters describing our structure. Defining\n; them symbolically here makes it easier to change them. (e.g. we\n; can change the dielectric constant from the command line via\n; \"mpb eps-hi=13 2dwaveguide.ctl\".) We then use these parameters below\n(define-param eps-hi 12) ; the waveguide dielectric constant\n(define-param eps-lo 1) ; the surrounding low-dielectric material\n(define-param h 1) ; the thickness of the waveguide (arbitrary units)\n(define-param Y 10) ; the size of the computational cell in the y direction\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; Define the structure and the computational cell\n; Here we define the size of the computational cell. Since it is 2d,\n; it has no-size in the z direction. Because it is a waveguide in the\n; x direction, then the eigenproblem at a given k has no-size in the\n; x direction as well.\n(set! geometry-lattice (make lattice (size no-size Y no-size)))\n; the default-material is what fills space where we haven't placed objects\n(set! default-material (make dielectric (epsilon eps-lo)))\n; a list of geometric objects to create structures in our computational cell:\n; (in this case, we only have one object, a block to make the waveguide)\n(set! geometry\n(list (make block ; a dielectric block (a rectangle)\n(center 0 0 0) ; centered at origin\n(size infinity h infinity) ; block is finite only in y direction\n(material (make dielectric (epsilon eps-hi))))))\n; MPB discretizes space with a given resolution. Here, we set\n; a resolution of 32 pixels per unit distance. Thus, with Y=10\n; our comptuational cell will be 320 pixels wide. In general,\n; you should make the resolution fine enough so that the pixels\n; are much smaller than the wavelength of the light.\n(set-param! resolution 32)\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; Tell MPB what eigenmodes we want to compute.\n; Generally, we want omega(k) for a range of k values. MPB\n; can automatically interpolate a set of k values between any\n; given bounds. Here, we will interpolate 10 k's between 0 and 2.\n(define-param kmin 0)\n(define-param kmax 2)\n(define-param k-interp 10)\n; k-points is the list of k values that MPB computes eigenmodes at.\n; (vector3 x y z) specifies a vector. (k is in units of 2 pi/distance)\n(set! k-points (interpolate k-interp\n(list (vector3 kmin 0 0) (vector3 kmax 0 0))))\n; we also need to specify how many eigenmodes we want to compute, given\n; by \"num-bands\":\n(set-param! num-bands 5)\n; to compute *all* the modes, we now simply type (run).\n; However, it is convenient to compute only one symmetry of mode\n; at a time. In particular, we will compute only TM (E in z direction)\n; modes, and separately compute even and odd modes with respect to the\n; y=0 mirror symmetry plane.\n(run-tm-yeven)\n(run-tm-yodd)\n; (If we don't have y=0 mirror symmetry we should just use run-tm).\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; That's it! We're done! However, suppose we now want to get the\n; *fields* at a given k. To do this, we'll call the run function\n; again, this time giving it an option to output the modes.\n(define-param k 1) ; the k value where we'll output the modes\n(set! k-points (list (vector3 k 0 0))) ; compute only a single k now\n; output-efield-z does just what it says. There are also options\n; to output any other field component we care to examine.\n(run-tm output-efield-z)\n\n; Example MPB input file for 18.325, for a periodic (period = 1) sequence\n; of dielectric cylinders in the x direction. (This file is otherwise\n; very similar to 2dwaveguide.ctl ... refer to that file for more details.)\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; Some parameters:\n(define-param eps-hi 12) ; the waveguide dielectric constant\n(define-param eps-lo 1) ; the surrounding low-dielectric material\n(define-param h 1) ; the thickness of the waveguide (arbitrary units)\n(define-param r 0.2) ; the radius of the cylinders\n(define-param Y 10) ; the size of the computational cell in the y direction\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; Define the structure and the computational cell\n; note that now the size in the x direction is 1 (one period)\n(set! geometry-lattice (make lattice (size 1 Y no-size)))\n(set! default-material (make dielectric (epsilon eps-lo)))\n(set! geometry\n(list (make cylinder ; cylinder oriented along z direction\n(center 0 0 0) ; centered at origin\n(radius r) (height infinity)\n(material (make dielectric (epsilon eps-hi))))))\n(set-param! resolution 16)\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; Tell MPB what eigenmodes we want to compute.\n(define-param kmin 0)\n(define-param kmax 2)\n(define-param k-interp 20)\n; k-points is the list of k values that MPB computes eigenmodes at.\n; (vector3 x y z) specifies a vector. (k is in units of 2 pi/distance)\n(set! k-points (interpolate k-interp\n(list (vector3 kmin 0 0) (vector3 kmax 0 0))))\n; we also need to specify how many eigenmodes we want to compute, given\n; by \"num-bands\":\n(set-param! num-bands 5)\n; let's just stick with the even modes for now.\n(run-tm-yeven)\n;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;\n; uncomment to output some fields at k=0.4:\n(define-param k 0.4) ; the k value where we'll output the modes\n(set! k-points (list (vector3 k 0 0))) ; compute only a single k now\n; (run-tm-yeven output-efield-z)\n% foo = Unix Command\n>> foo = Matlab command\n% add mpb\n% mpb 2dwaveguide-periodic.ctl > 2dwaveguide-periodic.out\n% grep tmyevenfreqs: 2dwaveguide.out > foo.dat\n>> foo = dlmread('foo.dat', ',', 1, 1)\n>> kx = foo(:,2)\n>> fe = foo(:,6:end)\n>> plot(kx, fe, 'ro-')\n>> hold on\n>> plot(kx, kx, 'k', 'LineWidth', 2)\n>> plot(kx + 1, kx, 'k', 'LineWidth', 2)\n>> plot(-kx + 1, kx, 'k', 'LineWidth', 2)\n>> plot(-kx + 2, kx, 'k', 'LineWidth', 2)\n>> axis([0 2 0 0.6])\nRun again, uncommenting line to output fields...\n>> ez1 = hdf5read('e.k01.b01.z.tmyeven.h5', 'z.r') +\nhdf5read('e.k01.b01.z.tmyeven.h5','z.i') * i;\n>> pcolor(real(ez1))\n>> axis image\n% mpb-data -x 5 e.k01.b01.z.tmyeven.h5 epsilon.h5\n% h5topng -S 4 -Zc bluered -C epsilon.h5:data-new -d z.r-new\ne.k01.b01.z.tmyeven.h5\n% add graphics\n% xv e.k01.b01.z.tmyeven.png &"
    }
  ]
}