{
  "course_name": "MBA Study Tour: Innovation Islands - How New Zealand Became A Global Player in the Race to Innovate",
  "course_description": "This International Study Tour went to New Zealand during the first half of the 2016 Spring semester and travel during the Sloan Innovation Period. International Study Tours provide students with a course credit opportunity to identify and address issues about which they feel particularly passionate. After classroom sessions featuring faculty, industry, and cultural experts, students embark on site visits to their destination of choice, meeting with industry and government leaders, as well as local alumni. Through these visits, students are able to build on the preparatory course work with an in-depth exploration of industries, companies, and countries they have visited.\nThis course fulfills the Sloan Innovation Period (SIP) elective requirement. SIP occurs at the midpoint of each semester providing students with an intensive week of experiential leadership learning, as well as exposure to groundbreaking faculty work. It allows students to engage in intellectual exploration outside the classroom. SIP degree requirements include core courses in ethics and leadership as well as electives.",
  "topics": [
    "Business",
    "Entrepreneurship",
    "Innovation",
    "Management",
    "Business",
    "Entrepreneurship",
    "Innovation",
    "Management"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 5 sessions / week, 3 hours / session\n\nPrerequisites\n\nNo prerequisites for this course.\n\nStudy Tour Purpose and Focus\n\nInnovation Islands: How New Zealand Became a Global Player in the Race to Innovate\n\nIn March 2015, two members of our study tour team embarked on an adventure across Latin America as part of an MIT Sloan Study Tour. One of the experiences in particular stood out and that was when the study tour visited a Peruvian company called \"Aje Group.\" Aje is one of the largest cola producers in the World, and it was absolutely fascinating to hear about how the company defied all expectations to build a global brand from a small isolated country.\n\nAfter hearing this story, our study tour leader realized that there are many companies like this in his home country of New Zealand. Despite being a geographically remote series of islands, New Zealand's unique culture inspires people to follow a path of entrepreneurship, and these entrepreneurs are able to spot global opportunities and innovate to successfully pursue them.\n\nNew Zealand as a Center of Innovation\n\nDespite a population of just 4.5M, New Zealand is consistently ranked by Forbes as one of the top three places to do business. How has this nation progressed from trading primarily in commodities to being a global leader in business? Our planning team has prepared an extended study of New Zealand's innovation ecosystem to find the answer to this very question during a 5-week seminar followed by a two-week journey of New Zealand's most significant cities (Auckland, Wellington and Queenstown). We will focus on the country's leading business innovators across various industry sectors, highlighting their subsequent impacts on politics and culture, with a strong focus on technology's disruptive forces.\n\nMIT's Strong New Zealand Ties Offer Opportunities to Interact with Real Leaders and Innovators Across the Country\n\nWe are leveraging many pre-existing relationships with New Zealand:\n\nMIT Regional Entrepreneurship Acceleration Program (REAP)\n: MIT is the acknowledged global leader in innovation, and the Institute has codified that knowledge through REAP--a program in which countries or regions enroll for advisement in improving their entrepreneurial ecosystem. New Zealand was a partner country, meaning there are both numerous faculty here at MIT with expertise in New Zealand's innovation ecosystem, as well as an extended network within New Zealand of former REAP participants.\n\nMIT Sloan Alumni\n: For nearly 5 years New Zealand's Ministry of Business, Innovation and Employment has sponsored 10 top entrepreneurs to participate in MIT Sloan's Executive Education Entrepreneurship Development program. Examples of this include Mario Wynands, the Managing Director of New Zealand's largest and most awarded gaming company PikPok, and Jos Ruffell, serial entrepreneur and founder one of the world's most innovative breweries, Garage Project. The alumni from this program are leading some of NZ's most innovative companies.\n\nMIT International Science and Technology Initiatives (MISTI)\n: MISTI matches MIT students with tailored internships with leading companies, research institutes and universities around the world, and facilitates international faculty collaborations and partnerships. In 2014 MISTI launched its MIT-Australia and New Zealand (ANZ) pilot program, and the planning team has coordinated with MISTI to offer our participating companies the opportunity to further strengthen their ties with MIT by having first access to the MISTI ANZ pilot program.\n\nThese existing networks have allowed us to craft a well-integrated in-class and in-country experience. As we travel throughout New Zealand our class will serve as Innovation Diplomats, deepening these relationships on behalf of MIT.\n\nUltimate Goals of the Planning Team\n\nThe planning team envisions a life-changing experience for all participants. As innovation accelerates and blurs geographic lines, it is increasingly imperative that every Sloanie is competent and ready to transact business on the global level through an enriched understanding of distinctly different business cultures.\n\nEach class is designed with a specific purpose in mind and the key learning objectives for each can be found in detail on the following sections.",
  "files": [
    {
      "category": "Resource",
      "title": "Class 1 Key Takeaways",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-228-mba-study-tour-innovation-islands-how-new-zealand-became-a-global-player-in-the-race-to-innovate-spring-2016/a9a9e3204aa0f82385a408948addd3cc_MIT15_228S16_Class_1.pdf",
      "content": "NZST Class 1 Overview\nOverview: We introduced frameworks for understanding the innovation ecosystem in New Zealand and\nestablished a baseline for how New Zealand fares compared to other countries. Additionally, we\ndiscussed the role governments can play to increase their country's innovativeness.\n\nThe MIT Regional Entrepreneurship Acceleration Program framework focuses on the innovation-\ndriven entrepreneurship (IDE) ecosystem, stakeholders, and strategy.\n-\nA region's IDE ecosystem potential depends on both the innovation capacity (I-Cap) and the\nentrepreneurial capacity (E-Cap) of the region.\n-\nIDE ecosystem strategy must be shaped and realized through engagement across stakeholder\ngroups: entrepreneur, university, government, risk capital, corporate.\n\nRegions leverage innovation as the engine of their economies by investing and prioritizing in their\ncompetitive advantages.\n-\nA cluster is a regional concentration of related industries connected through various types of\nlinkages, spillovers and supporting institutions (e.g., motion pictures in Los Angeles).\n-\nIndustries that are part of a strong cluster environment register 1) higher level growth and\nsustainability of start-up activity and 2) higher level and impact of innovation.\n-\nCluster mapping creates a dataset on the presence of clusters across geographies and can be\nused to understand cluster strengths in different regions.\n\nGovernments can incentivize innovation / R&D through either grants (spending side) or tax incentives\n(revenue side).\n-\nA New Zealand Treasury study cited the high marginal tax rate on high earners as a potential\ncause of \"brain drain\" - 25% of highly skilled New Zealanders live abroad.\n-\nA new government proposal would allow loss-making start-ups to \"cash out\" losses from R&D\nexpenditures.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.228 MBA Study Tour: Innovation Islands - How New Zealand Became A\nGlobal layer in the Race to Innovate\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Class 2 Key Takeaways",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-228-mba-study-tour-innovation-islands-how-new-zealand-became-a-global-player-in-the-race-to-innovate-spring-2016/7f910cb9f9c604eda1b9ee2a70096041_MIT15_228S16_Class_2.pdf",
      "content": "New Zealand Class 2 - Key Takeaways\n\nOverview: We assessed the role of stakeholders in creating change for a sustainable\ninnovation ecosystem as part of MIT Regional Entrepreneurship Acceleration Program's\n(REAP's) Innovation-Driven Entrepreneurial (IDE) ecosystems model.\n\nThis week's student news brief revealed that New Zealand could improve upon its\npolicy environment for innovation and spending on research & development (R&D):\n-\nNew Zealand ranked 28th of 56 countries in innovation policy environments.\n-\nOECD survey shows that spends less than 1% of GDP on R&D. The Prime Minister\nJohn Key issued a statement to Parliament to bring R&D spending back towards 1%.\nThe five key stakeholders in the IDE framework are 1) entrepreneurs 2) risk capital\n3) corporate 4) government 5) university:\n-\nFor each stakeholder group, a senior official should be involved, along with a deputy\nto drive action forward.\n-\nA budgetary authority is needed for government and university stakeholders.\n-\nOf all stakeholders, good entrepreneurs can be the most difficult to attract. New\nZealand can improve in its infrastructure to attract entrepreneurs and VC funding.\n\nThe three pre-conditions for acceleration are 1) an influential champion 2) adequate\nfinancial resources 3) an urgency for change:\n-\nAside from securing an entrepreneur, the next most important step is finding a great\nchampion on the ground, usually in a government or university role.\nCollective impact occurs when organizations and actors from different sectors agree\nto solve a specific social problem:\n-\nThe MIT Collective Impact Foundations for Entrepreneurial Acceleration refers to\nfour actionable elements of collective impact:\no 1) Setting a common strategic agenda with boundaries of success\no 2) Shared metrics & evaluation (consider ecosystem vs. programmatic level)\no 3) Stakeholder engagement & communication, tailored to the region\no 4) Backbone support organization that brings together multiple\nstakeholders and focuses on high-priority initiatives.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.228 MBA Study Tour: Innovation Islands - How New Zealand Became A\nGlobal layer in the Race to Innovate\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Class 3 Key Takeaways",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-228-mba-study-tour-innovation-islands-how-new-zealand-became-a-global-player-in-the-race-to-innovate-spring-2016/8f1fcad92df82ac39ff4223d881f65fd_MIT15_228S16_Class_3.pdf",
      "content": "NZST Class 3 Overview\nOverview: We visited the Cambridge Innovation Centre, where Naomi shared the company background,\nservice offerings, strengths, weaknesses and growth strategy, and were given a tour of two floors of the\nfacilities. With Scott Stern, we discussed the importance of establishing an Entrepreneurial Identity and\nthe impact of an Entrepreneurial Ecosystem, using Clover and Avatech as case studies.\n\nThe Cambridge Innovation Centre (CIC) is 7 floors of co-working space in Kendall Square, that is home\nto over 450 start-ups (the largest density in the world).\n-\nEstablished as a for-profit in 1999 by an MIT Sloan graduate and his wife, the CIC has hosted\nhundreds (possibly thousands) of companies, including Apple, Google and Facebook when they\nfirst opened their Boston locations.\n-\nCompanies are typically in the software or life sciences industries, staying there for an average\nof 2.5-3 years, with some anchor tenants occupying a space for 16 years.\n-\nCIC has made community building a major objective in its mission, facilitating over a dozen\nevents per week, and doing little things like making specific snacks only available on certain\nfloors.\n-\nCIC is currently in three other locations, St. Louis, Miami and Rotterdam, and uses a fairly simple\nmetric when choosing a new location:\no Money - are there nearby investors or financiers, or is it easy for them to get to that\nlocation (non-stop flights)?\no Ideas - is it near to a school or schools?\no Talent - is the pool potential tenants high quality with good ideas?\n\nChoosing an Entrepreneurial Identity and an Entrepreneurial Ecosystem are among the first and most\nimportant phases of creating a start-up, and there are a number of questions and considerations that\nmust be addressed in order to identify either.\n-\nIdentity - What are you trying to do? What are your capabilities? Who are you trying to hire or\nwho are your first employees? What kinds of talent do you need? What is your position? What\ncapital investments do you need to make?\n-\nEcosystem - Are your co-founders/first employees O.K. with moving to a new location (eg\nSilicon Valley)? What is the cost of hiring staff in each location? What is the legal infrastructure\nat each location (e.g. less supportive in Boston)? Where do you have stronger connections and a\nstronger network? What are the industry differences between locations? Where is the talent\nmore highly concentrated (e.g. Boston vs Denver)?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.228 MBA Study Tour: Innovation Islands - How New Zealand Became A\nGlobal layer in the Race to Innovate\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Class 4 Key Takeaways",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-228-mba-study-tour-innovation-islands-how-new-zealand-became-a-global-player-in-the-race-to-innovate-spring-2016/b44cc443190ebe65667e621b0b525f41_MIT15_228S16_Class_4.pdf",
      "content": "New Zealand Class 4 - Key Takeaways\n\nOverview: The class discussed the Trans-Pacific Partnership agreement and its pros and cons with\nDr. Phil Budden who then talked about the MIT-Kendall case to illustrate how a university was a key\nstakeholder in innovation-driven entrepreneurial ecosystems.\n\nThis week's student news brief broached the international trade topic as it relates to New\nZealand trade in the context of Trans-Pacific Partnership (TPP) agreement.\n-\nTPP was signed in February between 13 countries representing 40% of the global economy.\nBorders will become less sticky and tariffs will be coming down.\n-\n95% of NZ businesses are SMEs. A trade agreement with EU is also underway to help small-\nbusinesses.\n-\nTPP has resulted in IP concerns for NZ startups, NZ will need to change copyright terms from\n50 years to 70 years and will need to provide stronger technological protection. For\nexample, digital locks that prevent copyright infringement could hamper the ability of\ninnovators to tinker with technology.\n-\nLack of indigenous consultation or consent in signing the TPP has led to a lot of resistance.\nAnd resulted in protests and blockades. Potential for rising medical prices & increased US\ninfluence on NZ domestic affairs.\nThe class talked about university stakeholder's role:\n-\nIs university the answer? Universities provide a systematic scientific approach to\nunderstand innovation. Innovation can't just be built up by just investing money on\ninfrastructure. For example, Skolktech in Moscow was an exciting project to create a\ntechnology hub based on the ideology of \"if you build it, innovators will come\" but it turns\nout that buildings were built but not a lot of people turned up.\n-\nUniversities contribute to I-Capacity and E-Capacity through entrepreneurs, funding,\ninfrastructure, culture, community, professors, policy environment e.g. MIT Nano-center will\nbe open to anyone to do research, MIT's Martin Trust Center.\n\nMIT is an effective university stakeholder and an example for other universities to learn about\ndeveloping effective eco-systems:\n-\nRegional economic impact of MIT is significant just not through its students but also from\nMIT connecting to and convening with all the stakeholders in the ecosystem.\n-\nMIT spends $600M per year in research spending; on average MIT produces 1 Nobel\nPrize/year, 375 patents/year, 150 companies/year by students & faculty.\n-\nChallenges of funding drove MIT, and it collaborated with industry players that led to\ndevelopment of Kendall Square. Today Kendall Square has more VC per sq. ft. than anywhere\nelse on the planet, offers corporate offices for Saudi Aramco, Microsoft, Google etc. and\nGovernment Offices e.g. the British Consulate General.\n-\nFor NZ interesting questions to explore are to listen to the way universities tend to describe\nthemselves vs. how they describe other universities. Is there focus on patents vs. startups?\nLiberal arts vs. pure STEM focus? Ivory tower vs. collaborative environment?\n\nInnovation culture and rethinking everything about it\n-\nAithan Shapira taked about innovation in our culture and how it is silo'd.\n-\nTall poppy syndrome is the idea that you recognize more successful people in society and try\nto tear them down. The moment you are great you are brought down. In NZ, Australia and\nEngland this culture is very prevalent.\n-\nFocus on negative space instead of the actual object to understand the ecosystem\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.228 MBA Study Tour: Innovation Islands - How New Zealand Became A\nGlobal layer in the Race to Innovate\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Class 5 Key Takeaways",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/15-228-mba-study-tour-innovation-islands-how-new-zealand-became-a-global-player-in-the-race-to-innovate-spring-2016/f72ab0841d62a96983b0ea2e7bb43204_MIT15_228S16_Class_5.pdf",
      "content": "NZST Class 5 Overview (March 7, 2016)\n\nTopic: Investing in Your Comparative Advantage\nOverview: How firms increase resilience in increasingly volatile environments\nMercedes Delgado: Lecture on NZ economy, competitiveness and ICT sector\nJulius Tapper: Lecture on iDiplomats Experience\nNews Brief:\n-\nCallaghan Innovation Board appointments announced (3 new board members elected)\n-\nNZ = #3 of Freest Economies for Entrepreneurs -measured by regulation and rule of law\n-\nFormer trade minister says \"stop praising the TPP and look for bugs\"\n-\nSome NZ entrepreneurs find more success with funding in Silicon Value but maintain\noffices in NZ. However, NZ investors put a higher share of wealth into the startups than\ntheir american counterparts\n-\nCommission find that tertiary education is overspending and under-producing outcomes\n\nProfessor Delgado Lecture:\n-\nFirm's ability to compete influenced by where the firm is located, mainly due to the\nattributes of each specific location\n-\nCompetitiveness based on long-run productivity\n-\nDiamond Model (Porter): Assessing the Quality of the business Environment through\nfour factors: Context for Firm Strategy and Rivalry, Factor (Input) Conditions, Demand\nConditions and Related and Supporting Industries\n-\nNZ Competitiveness (rank 9th) → GDP per Potential Worker (rank 26th)\n-\nImprovement is based on improvement of skills (microeconomic). NZ has done a great\njob on advancing microeconomic factors but there is still space for improvement\n-\nFirms are facing increasing shocks, how do we increase resilience?\n-\nChristchurch specialized in ICT sector - collaboration between firms increased post EQ\n-\nSophistication of management practices matter in disaster recovery\n\nJulius Tapper on iDiplomats experience in Kenya:\n-\nKenya issues very very few patents - looked at what Kenya is doing to address the\ninnovation challenge. Celebrating successful startups and spread those stories.\n-\nLooking at a huge gap and how to structurally address those gaps? One approach is to\nbenchmark with an advanced innovation hub (e.g. Israel) to understand where to go and\nhow to promote innovation\n\nCata\n\nMercedez Delgado\nICT sector and Nz\nLocation, natural disaster and\nFirm competitiveness\nWhat countries needs to have to recover from shocks - e.g. Earthquake\n\nWhat determines competitiveness? Location and attributes (of the location) that are going to\ninfluences how countries compete.\n\nDiamond Framework\nContext for Firm Strategy and Rivalry, Factor (Input) Conditions, Demand Conditions and\nRelated and Supporting Industries\n\nWhat is competitiveness? firms are able to compete in their regions and globally that are able to\ncontribute in long-run productivity of their regions.\n\nThe determinants of National Competitiveness:\n● Microeconomic Competitiveness: Quality of the National Business Environment\n(Diamond Framework), State of Cluster Development and Sophistication of Company\nOperations and Strategy.\n● Macroeconomic Competitiveness: Sound Monetary and Fiscal Policies and Human\nDevelopment and Effective Public Institutions.\n\nHow NZ is doing?\nNz Competitiveness Profile 2015\n● Microeconomic: NZ has space for improvements\n● Macroeconomic: It is good\n\nNZ vs other countries:\nNumber 9 in the Index Rank (overall)\n\nMany types of shocks, which make firms to have volatility - and how they recover they measure\nhow the countries react.\n\nExample of Christchurch's earthquake\nLarge shock that has a large economic dislocation\n\nHow do I know that there is a cluster in Christchurch? ICT needs to be greater than 1.\n\nImportance of ICT to NZ\n\nResults Overview NZ\n1. The Risk Management Effect:\n2. Increased Inter-firm Collaborations: Increased among the cluster because of several\nfactors:\na. Share spaces for example, and they find out that it is better to collaborate\n3. Recovery Products: Products that helps the recovery of local customers\na. Reconstruction sites\nb. Data security\n\nConclusion and Next Steps\n\nSophistication of management practices matter in disaster recovery\nSome firms can benefit from a disaster: Recovery Products\nInstitution for collaborations in clusters play an important role in sharing the risk and facilitating\ncollaboration among their members (E.g. EPIC)\nLeadership is important in time of crisis (EPIC)\n\nJulius:\n● What makes a place really innovative?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n15.228 MBA Study Tour: Innovation Islands - How New Zealand Became A\nGlobal layer in the Race to Innovate\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}