{
  "course_name": "Mechanics of Fluids",
  "course_description": "This course is an advanced subject in fluid and continuum mechanics. The course content includes kinematics, macroscopic balances for linear and angular momentum, stress tensors, creeping flows and the lubrication approximation, the boundary layer approximation, linear stability theory, and some simple turbulent flows.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics",
    "Engineering",
    "Mechanical Engineering",
    "Fluid Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nOverview\n\nThis class is an advanced subject in fluid and continuum mechanics. The course content includes kinematics, macroscopic balances for linear and angular momentum, the stress tensor, creeping flows and the lubrication approximation, the boundary layer approximation, and linear stability theory.\n\nTexts\n\nThere is no required textbook for this course. However, students may find the following to be a useful reference:\n\nPanton, Ronald L.\nIncompressible Flow.\n3rd ed. Hoboken, NJ: John Wiley & Sons, Inc, 2005. ISBN: 9780471261223.\n\nA series of fluid mechanics films are given in\nstudy materials\nsection to supplement content presented in lectures.\n\nProjects\n\nThe class culminates in a final project consisting of a 1-hour, in-class presentation. The presentation is a critical review of a topic from current literature. Topics are selected by individual students and approved by faculty.\n\nGrading\n\nGrades are determined by performance on the six problem sets given during the term, the final presentation, and in-class participation. There are no exams given in this class.\n\nCourse Calendar\n\nSES #\n\nTOPICS\n\n1-4\n\nKinematics\n\n5-13\n\nMacroscopic balances for linear and angular momentum\n\n14-17\n\nThe stress tensor\n\n18-26\n\nCreeping flows and the lubrication approximation\n\n27-35\n\nThe boundary layer approximation\n\n36-39\n\nLinear stability theory\n\n40-45\n\nPresentations",
  "files": [
    {
      "category": "Resource",
      "title": "set1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-52-mechanics-of-fluids-spring-2006/43b20f9253741bfdb796dabb2cd95ec6_set1.pdf",
      "content": "10.52\nMechanics of Fluids\n\nSpring 2006\n\nProblem Set 1\n\nProblem 1\n\nIf\n\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n-\n-\n-\n-\n-\n=\nσ\n\na)\nWhat are the principal values of σ ?\n\nb)\nWhat are the directions in which the principal stresses act?\n\nc)\nIf a new coordinate frame (ξ, η,ζ) is erected such that the new axes are\naligned with the directions of the principal axes, what are the relations:\n\n)\nz\n,y\n,x\n(\n);\nz\n,y\n,x\n(\n);\nz\n,y\n,x\n(\nζ\n=\nζ\nη\n=\nη\nξ\n=\nξ\n\nProblem 2\n\nIf\n\n⎥\n⎥\n⎥\n⎦\n⎤\n⎢\n⎢\n⎢\n⎣\n⎡\n=\nσ\n\nRepeat Problem 1a-c\n\nProblem 3\n\nA thin-walled cylinder of inner radius Ri and thickness t (t/Ri<<l) is closed\nat both ends. It contains a fluid with a constant stress tensor σ = - pi δ and is\nsurrounded by a fluid with a constant stress tensor σ = - po δ . Body forces are\nnegligible. Consider the special case in which p = po. However, a torque Io k is applied\nto one end and -Io k to the other end.\n\na) Assume that the cylinder is very long and, for the region far removed from the\nends, evaluate the stress tensor in terms of Ri, t, pi, po etc. Employ cylindrical\ncoordinates.\n\nb) Determine the magnitude and direction of the principal stresses.\n\nc) What is the magnitude of the maximum shear stress?\n\nRepeat Parts (a), (b), and (c) of the preceding problem."
    },
    {
      "category": "Resource",
      "title": "set2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-52-mechanics-of-fluids-spring-2006/8eb22f04f99c096d5e5d11eb9fab19aa_set2.pdf",
      "content": "10.52\nMechanics of Fluids\nSpring 2006\nProblem Set 2\n\nProblem 1\n\nA lock gate separates the water in the Charles River basin from the sea water in Boston harbor.\nAs shown in the above figure, the water in the basin consists of an upper fresh water layer of\ndensity ρf = 1000 kg/m3 and a depth of 4 m and a lower salt water layer of density ρs = 1030\nkg/m3. The fresh/salt water interface is 2 m above the sill of the gate. On the harbor side, the salt\nwater depth h, measured above the level of the sill, rises and falls with the tide.\n\n(a) At some water level h on the harbor side, the total horizontal force of the sea water exerted\non the lock gate will be balanced by the total horizontal force of the basin water acting against\nthe other side of the gate. Calculate the value of h at this equilibrium.\n\n(b) Under this condition, if there is a leak in the lock gate seal at the sill, will water leak into or\nout of the basin?\n\n(Problem by James Fay, courtesy of MIT Press. Used with permission.)\n\nProblem 2\n\nA reservoir of water is closed at one end by a barrier. At the top of the barrier is an L-shaped\nchannel that further restrains the water when its level is higher than the barrier top by the amount\nh, as shown in figure below. The channel is hinged at the corner point O, so that it can rotate in a\ncounterclockwise direction, but not in a clockwise direction. If the water level h is high enough,\nthe pressure force on the vertical face of the L-shaped channel will maintain a clockwise moment\nthat will exceed the counterclockwise moment of the pressure force on the horizontal leg of the\nchannel, and the channel will remain upright and prevent water leaking beneath it. Calculate the\nminimum value of the ratio h/H that will just ensure against rotation of the channel.\n\nProblem 3\n\nOne end of a 25 lb. wooden pole 3 in. in diameter and 18 ft. long is anchored with 10 ft. of light\ncable to the bottom of a fresh-water lake where the depth is 15 ft. Which of the two\nconfigurations shown describes the equilibrium position? Find the length x of the pole protruding\nabove the water.\n\nH O = 62.4 lbs/ft , g = 32.2 ft/s\n⎡\n⎤\nρ\n⎢\n⎥\n⎣\n⎦\n\nx\nA\nB\n15'\n10'\n10'\nx\nx\nA\nB\n15'\n10'\n10'\nx\n\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 4\n\nA cylindrical weir has a diameter of 3 m and a length of 6 m. Find the magnitude and direction\nof the resultant force acting on the weir from the water.\n\nH2O\n3m\n1.5m\nH2O\n\nProblem 5\n\nA balloon filled with helium is attached to the floor of a stationary vehicle as shown in the\nfigure. The vehicle now accelerates at a steady rate of a = 0.25 g i. Find the angle which the\nballoon string makes with the vertical at steady state. Sketch the position of the balloon relative\nto point A in the accelerating vehicle.\n\nA\nj-\ng =\n-\n-g j-\ni-\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 6\n\nThe sketch shows a small airplane making a steady turn of 400 m radius while banking in a\nhorizontal plane at 300 km/hr.\n\nThe fuel tanks are in the wings. Estimate the angle θ between the free surface of the fuel and the\nhorizontal.\n\n500 m\nFuel\ng\nθ\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)"
    },
    {
      "category": "Resource",
      "title": "set3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-52-mechanics-of-fluids-spring-2006/add569baeebc8512b96e9589fdccac55_set3.pdf",
      "content": "10.52\nMechanics of Fluids\nSpring 2006\nProblem Set 3\n\nProblem 1\n\nMass transfer studies involving the transport of a solute from a gas to a liquid often involve the\nuse of a laminar jet of liquid. The situation is a sketched below:\n\nRo\nR*\n(2)\n(1)\n\nAt section 1, the flow is laminar and the velocity profile is Poiseuillean, i.e.\n\nu/uCL = 1 -(r/Ro)2\n\nwhere uCL is the center-line velocity. Upon leaving the pipe, the jet contracts and the velocity\nprofile flattens so that, at section 2, the velocity profile is perfectly flat and no further contraction\noccurs, i.e.,\n\nu = u* for r ≤ R*\n\nIn order to interpret the mass transfer results, a precise knowledge of R* is essential. For this\nreason, you are asked to determine the numerical value of R*/R0, subject to the following\nassumptions:\n\n1. Gravity may be neglected.\n\n2. Surface tension may be neglected.\n\n3. The pressure in the gas and in the liquid is everywhere the same.\n\n4. The gas is of such low viscosity that any shear stresses on the surface of the liquid jet\nmay be neglected.\n\nProblem 2\n\nA two-dimensional jet of incompressible fluid strikes a plane surface. Find V2, V3, b2, and b3 in\nterms of V1, b1, β, and ρ.\n\nAssuming the plate to be of unit length in the direction normal to the paper, find the force\nneeded to hold the plate stationary. Base your calculations on the following assumptions:\n\na) Gravity is not a factor.\n\nb) The fluid is perfect.\n\nc) The velocities V1, V2, V3 are uniform at their respective cross sections.\n\nV2\nb2\n\nb3\nV1\nb1\nβ\nV3\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 3\nL\n\nAn incompressible fluid passes through a sudden expansion in a pipe, from area A1 to A2, > A1.\nThe flow just downstream of the expansion looks like a jet of area A1, which emerges into an\nalmost stagnant, recirculating zone which surrounds it. Further downstream, the jet mixes in a\nturbulent, viscous manner with the fluid surrounding it, and eventually, at some station (2), the\nvelocity is approximately uniform over the larger cross-section.\n\nAssuming that the velocity is uniform just upstream of the expansion as well as at station (2), and\nthat, although viscous forces acting within the flow are important and in fact cause the velocity at\n(2) to be uniform, the net shear force exerted by the fluid on the wall between (1) and (2) is\nnegligible,\n\n(a) find the rise in static pressure between (1) and (2),\n\n(b) find the loss in stagnation pressure, or total head, between (1) and (2). Check your\nresults by showing that in the limit A1/A2 ⇒ 0, they reduce to the forms which apply\nto a jet issuing into an infinite reservoir.\n\n(c) Give a more concrete criterion for the shear stress to be \"negligible\", as assumed in\nthe problem introduction. You may express the criterion as an upper limit on the\nshear stress in terms of the given quantities and the distance L from (10 to (2).\n\nThe given quantities are the upstream flow speed v1, ρ, A1 and A2. Neglect gravitational effects.\n\nρ1, A1\nV1\nAz\n(1)\n(2)\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 4\n\nThe following is a description of a process which actually occurs in practice. Consider a\nhorizontal rectangular channel, open to the atmosphere, in which water is flowing at a\n(substantially) uniform velocity V1 and depth D1. Now a restriction is placed in the channel\n(perhaps by partially closing a gate downstream). As a result of the restriction, it is observed that\na \"surge wave\" moves upstream. The front of the surge wave moves with the constant velocity\n\"c\" relative to the stationary co-ordinate axes. A short distance downstream of the wave front,\nthe flow is again essentially uniform with velocity V2 and depth D2. The shear stresses applied\nby the channel walls are small and hence may be neglected.\n\na) Using a control volume which moves with the wave, derive the relation which gives the wave\nspeed in terms of V1, D1, and D2. (V2 must not appear).\n\nb) Why is a moving control volume more convenient than a stationary one?\n\ng\n\nD1\nV1\nc\nD2\nV2\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 5\n\nIn an experiment to determine drag, a circular cylinder of diameter d was immersed in a steady,\ntwo-dimensional incompressible flow. Measurements of velocity and pressure were made at the\nboundaries of the control surface shown. The pressure was found to be uniform over the entire\ncontrol surface. The x-component of velocity at the control surface boundary was approximately\nas indicated by the sketch.\n\nFrom the measured data, calculate the drag coefficient of the cylinder, based on the projected\narea and on the free stream dynamic head.\n\nd\nV\n\n(1/2)\nlength\nunit\nper\n\nforce\n\nDrag\nC\nD\nρ\n≡\n\nanswer: CD = 4/3\n\nV0\nV0\n4d\nd\nV0\nV0\nV0\nControl\nsurface\nV0\nV0\nV0\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 6\n\nA sluice gate is installed in a steady water stream of depth h1 and speed V1 (as measured far\nupstream of the gate). Downstream of the gate the stream has a depth h2 which is less than h1.\n\nThe flow is incompressible and inviscid.\n\n(a) Assuming uniform velocities at (1) and (2), derive an expression for the horizontal force F,\nper unit width, required to hold the gate in place given ρ, V1, h1 and h2. Check your result\nby showing that it is zero when h2 = h1 and equal to the hydrostatic result when h2 = 0.\n\n(b) Also obtain an expression for V2. Show that as h2 approaches zero, V2 approaches\ngh\n\nand F approaches\n. Explain.\n/\ngh 2\nρ\n\nh1\nwater\nρ\nF\ng\nP2\nP2\n\nAir\n\nh2\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 7\n\nConsider two thin planar sheets (of an ideal, incompressible liquid) which are propelled\nperpendicular to their respective surfaces with a constant velocity V0 as shown in Figure A. As\nthe two sheets proceed to interact with each other, jets will be produced along the axis of\nsymmetry, as shown in Figure B. What is the velocity to be expected in the two jets?\n\nHint: It is very helpful to use a reference frame which moves with the point of intersection.\nWhy is this so?\n\nV0\n(A)\n(B)\nV0\nV0\nV0\nα\n\nProblem 8\n\nWater flows through the impeller of a centrifugal pump as shown. Find the torque exerted on the\nimpeller and the power required to drive it. The absolute velocity of the water at the entrance\nhas no tangential component. The total flow rate is 60 liters/sec.\n\nΩ\n=\n100 radiams/sec\nR1\n=\n5 cm\nR2\n=\n15 cm\nb\n=\n1 cm\nβ2\n=\n120°\n\nShaft\nFlow\nFlow\nb\nR2\nR1\nβ2\nΩ\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nroblem 9\nP\n\nhas been proposed that a flow meter be built which utilizes a whirling arm as shown in Figure\n\nIt\n1. It is the claim of the inventors that, due to the rotation, the fluid will exert a force on the arm\nand in the direction shown in Figure 2. It is further claimed that this force will be directly\nproportional to the mass flow rate. If true, such a device could be used as a mass flow rate meter.\n\nDerive a relation for this force in terms of the mass flow rate, Ω, r2, r1, etc. Also, present a\n\nrelation for the torque which this force exerts about the axis of rotation. Or, alternatively show\nthat this force does not exist.\n\nflow\nΩ\nr1\nflow\nr2\n\nFigure 1\n\nEnd View\n(Along Axis of Rotation)\nFigure 2\n\nFlow\nΩ\nF\n\nProblem 10\n\nAmbient air is to be sampled into vacuum by a two step process. In particular, the plan is to use\na cylindrical tube with \"pin holes\" at each end, as shown in the sketch:\n\nP = 1.03 x 105 Pa\nP = 2000 Pa\nP = 1 Pa\nT = 20°C\n\nThe tube diameter is 2 cm and the desired flow rate is 2 std cm3/sec.\n\nWhat diameter would you recommend for each of the pin holes?"
    },
    {
      "category": "Resource",
      "title": "set4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-52-mechanics-of-fluids-spring-2006/58c44af975d72750b3894b06a370221c_set4.pdf",
      "content": "10.52\nMechanics of Fluids\nSpring 2006\nProblem Set 4\n\nProblem 1\n\nConsider a sinusoidal traveling wave of small amplitude (Ak<<1) such that the free\nsurface is given by:\n\nη = A cos (kx - ωt)\n\nThe corresponding velocities are given by:\n\nu = Aωeky cos (kx - ωt)\n\nand\n\nv = Aωeky sin (kx - ωt)\n\n(y is the vertical coordinate and is negative in the direction of g; x is the horizontal coordinate)\n\na) Sketch the streamlines at t = o that pass through: x = o, y = o; x = 0, y =\nk\n2π\n-\n\nb) Sketch the particle line at t = 2π\nω for the particle which was at x = o, y = o at\nt = o\n\nc) Sketch the particle line at t = ω\nπ\n2 for the particle which was at x = o, y = o at\nt = π/ω\n\nd) Sketch the streak line at t = 2π\nω formed by all particles emitted from x = o,\ny = -A since t = o\n\nNote: This problem is hard if you fail to take advantage of the fact that Ak<<1, but it is\nnot hard if you do take advantage of this fact.\n\nProblem 2 (Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nFor an ideal rectilinear vortex, the velocity profile is given by vr = vz = 0; vθ = K/r. A\nqualitatively similar result is associated with an ideal smoke ring.\n\na) Why does a smoke ring propel itself? Why does the velocity of translation diminish with\ntime?\n\nb) As shown in the figure on page 3, given two successive smoke rings, the trailing\nring will tend to overtake and pass through the leading ring. Why?\n\nProblem 2 - Figure\n\nImage removed due to copyright reasons.\n\nProblem 3\n\nIn two-dimensional planar flow, the potential function of a point source located at the origin is\ngiven (in polar co-ordinates) by:\nπ\nφ\nQ\n=\nln r\n\nQ is referred to as the strength of the source.\nSimilarly, a sink has potential:\n\nπ\nφ\nQ\n-\n=\nln r\n\nIf a source of strength Q is located at r = b/2, θ = 0, and a sink of strength Q at r = -b/2, θ = π;\nwhat is the potential function? What is the stream function? Sketch both. Also sketch for the\ncase in which b → 0, but Qb remains constant.\n\nProblem 4\n\nThe stream function of a certain planar flow is, in polar co-ordinates:\n\n2/3\nA r\nsin (2/3 )\nΨ =\nθ\n\nConsider only the region\nπ\n≤θ ≤\n\na) Sketch several streamlines.\n\nb) Find the x and y velocity components at (x, y) = (0, 0); (-1, 1); (inf, 0).\n\nc) Find the volumetric flow rate across any line joining (0, 0) and (-1, 1).\n\nd) If the pressure at (-1, 1) is p*, what is the pressure at (0, 0)?\n\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 5\n\nConsider a planar flow for which the stream function, as expressed in polar coordinates, is:\n\nA r\nsin\nπ\nθ\n⎛\n⎞\nπθ\nΨ =\n⎜\n⎟\nθ\n⎝\n⎠\n\nwhere A and θ0 are constants.\n\na) Sketch several streamlines for the region θ0 < θ < 2\nπ .\nb) Give an expression for νr along the line θ = θ0.\n\nc) For a fixed value of r, sketch (vs. a coordinate perpendicular to the line θ = θ0) the\nvelocity component in the direction parallel to the line θ = θ0.\n\nd) For the same fixed value of r, repeat Part (c) for the velocity component in the direction\nnormal to the line θ=θ0."
    },
    {
      "category": "Resource",
      "title": "set5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-52-mechanics-of-fluids-spring-2006/cb2f70be42e6490af9d107aaddd553d7_set5.pdf",
      "content": "10.52\nMechanics of Fluids\nSpring 2006\nProblem Set 5\n\nProblem 1\n\nConsider a perfect gas (P=ρRT) which flows from one reservoir at pressure P1 to another at\npressure P2 via a long thin uniform capillary tubing. The gas is Newtonian and the pressure\nratio, P1/P2, is substantially greater than unity. The entire apparatus exchanges heat readily with\nthe ambient and the system is, therefore, essentially isothermal.\n\na)\nAssume that inertia may be neglected and derive an equation for the mass flow\nrate in terms of the pressures, the tubing length and radius, the viscosity of the\ngas, etc.\nb)\nState the quantitative criteria which must be satisfied for the above assumption to\nbe valid.\nc)\nIf the gas is air at 20°C flowing in a tube with a diameter of 2mm and length of\n5m, and if P1 and P2 are 105Pa and 103Pa, respectively, what is the mass flow rate\nof air? Is the criterion developed in Part (b) satisfied?\n\n(Problem adapted from Ain Sonin and Ascher Shapiro. Used with permission.)\n\nProblem 2 (Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nA piece of glass tubing is drawn out into a long capillary of constant cross-sectional area as\nshown in the sketch. The tube is filled with liquid while held vertically, and a finger is placed\nover the top. When the finger is removed, the liquid begins to flow out the bottom of the tube (x\n= 0 z = 0; see sketch).\n\nIn all that follows, it is agreed to ignore the effects of surface tension.\n\nIt is found experimentally that the volume discharge at exit, Q0(t), varies with time as in the\nsketch above.\n\n(a) Explain qualitatively the physical phenomena which account for the shape of the curve\nQ0(t).\n\n(b) Estimate the order of magnitude of the time t*, and explain the basis of your estimate.\n\n(c ) Assume that, for times well in excess of t*, the flow is essentially inertia-free.\n\nHow long will it take to drain the tube?\n\n(d) Will your result be applicable if the fluid is glycerin (ρ = 1260 kg/m3, ν = 0.6 x 10-3 m2/s)\nand if h0 = 0.5 m and R = 1mm? Would the analysis apply if the fluid were water?\n\nx\nz\ng\nQ0\nt*\nh(t)\nQ0(t)\n\nProblem 3\n\nConsider a rigid sphere which is fully immersed in an incompressible Newtonian fluid. The\nsphere is very slowly pushed toward a rigid plane boundary with a constant velocity U. At time\nzero, the sphere is close to the boundary in the sense that the distance between the sphere and the\nboundary is very small compared to the radius of the sphere.\n\nDevelop an approximate expression for the force which must be applied to the sphere as a\nfunction of time.\n\nNote: Assume that inertia may be neglected and develop a criterion which must be\nsatisfied if this is to be true.\n\nProblem 4\n\nA planar sheet of material is to be coated by dipping it into a bath of Newtonian liquid. The\nsheet is then hung in a vertical orientation and the film is allowed to drain. This will not lead\nto a film of uniform thickness. The situation is instead believed to be more or less as shown\nin the sketch. Because the film is thin (δ/x << 1), it is believed that inertial forces may be\nneglected. Surface tension effects may also be neglected.\n\nA. What is the partial differential equation which describes the evolution of the film\nthickness as a function of x and t?\nB. Use order-of-magnitude techniques to obtain a solution that should be exact at\nvery long times.\nC. In the context of the solution obtained in part (B), what criterion must be satisfied\nif inertial forces are to be truly negligible? Express your answer in terms of\nvariables that can be specified a priori such as x, t, g, ρ and μ. Do not express\nyour answer in terms of dependent variables such as u and δ.\nD. What criterion must be satisfied if time is to be \"long\"? Assume that the layer is\ninitially of uniform thickness, δi.\nE. If, for the fluid in question, ρ = 1 gm/cm3 and υ = 10 cm2/s, will the solution be\nvalid at t = 10s and x = 10 cm? At t = 100s and x = 10 cm? In both cases, δi = 1\nmm.\n\ng\n\nx\nδ\n\nProblem 5\n\n1.\nA thin \"thread\" of fluid issues from a tube as shown in the sketch. The fluid is\nNewtonian and incompressible. The flow is believed to be viscous dominated. In\naddition, dR/dz << 1. The roles of surface tension, of gravity, of air drag, of inertia,\netc., may all be neglected. However, please note that the filament is \"pulled\" with a\nforce F. Except in Part E, vz may be assumed to be independent of r.\n\nA. It is believed that τrz must be zero for z > 0 and σrr must be continuous across the\ninterface. Show that:\n\nF = πσzzR2 = constant\n\n(1)\nand\n\nq = πvzR2 = constant\n\n(2)\n\nB. Note that\nz\nzz\nv\np\nz\n∂\nσ\n= -+ μ ∂\n\n(3)\n\nand\n\nr\nrr\nambient\nv\np\n= -p\nr\n∂\nσ\n= -+ μ\n=\n∂\n\n(4)\n\nFurthermore, continuity (see eq. 9) requires\nz\nr\nv\nr\nv\n\nz\n∂\n= -\n∂\n, or\n\nr\nr\nv\nv\nv\n= -\nr\nr\nz\n∂\n∂\n=\n∂\n∂\nz\n\n(5)\n\nThus\n\nz\nzz\nv\n\nz\n∂\nσ\n= + μ ∂\n\n(6)\n\nPlease obtain vz and R as functions of F, q, z, etc. Set R = R0 at z = z0.\n\nC. Please provide a criterion which must be satisfied if the assumption of viscous\ndominated flow is to be valid.\nD. How does the rate of momentum flow behave as z → inf? What are the physical\nconsequences of this observation?\nE. Equations (4) and (5) may be combined to give\n\nz\nv\np\nz\n∂\n--μ\n=\n∂\n\n(7)\n\nwhich is not consistent with an obvious simplification of eq. (11), i.e.\n\nz\nv\np\n- z\nz\n∂\n∂\n=\n+ μ\n∂\n∂\n\n(8)\n\nIs it possible that eq. (7) and eq. (11) can be reconciled if vz is a function of radial\nposition, r? Would this negate all of Parts A to D? If you believe that vz is actually a\nfunction of r, please give an estimate for the magnitude of the variation in terms of dR/dz,\netc.\nz\n2R\nF\n\nNotes:\nz\nr\nv\n(rv ) +\n= 0\nr r\nz\n∂\n∂\n∂\n∂\n\n(9)\n\nr\nr\nr\nz\nr\nv\nv\nv\n1 p\nr\nv\n= -\n(rv )\nr\nz\nr\nr\nr r\nz\nv\n⎡\n⎤\n∂\n∂\n∂\n∂\n∂\n∂\n⎛\n⎞\n+\n+ υ\n+\n⎢\n⎥\n⎜\n⎟\n∂\n∂\nρ ∂\n∂\n∂\n⎝\n⎠\n∂\n⎢\n⎥\n⎣\n⎦\n\n(10)\n\nz\nz\nz\nz\nr\nz\nv\nv\nv\nv\n1 p\nv\nv\n= -\n+\nr\n\nr\nz\nz\nr r\nr\nz\n⎡\n⎤\n∂\n∂\n∂\n∂\n∂\n∂⎛\n⎞\n+\nυ\n+\n⎢\n⎥\n⎜\n⎟\n∂\n∂\nρ ∂\n∂\n∂\n∂\n⎝\n⎠\n⎢\n⎥\n⎣\n⎦\n\n(11)\n\nProblem 6\n\nA flow in a square duct of width b passes through a very small angle of turn θ, such that sin\nθ = θ; the bend's radius of curvature is large compared with b. At the inlet to the turn, the flow\nvelocity is independent of x, but has a linear velocity gradient in the y-direction, such that there\nis a very small excess of velocity ∆V at the top of the duct, and a corresponding defect ∆V at the\nbottom, the mean velocity being V.\nThe flow is incompressible, steady, and non-viscous, and gravitational effects are\nnegligible.\n(a) Show that a streamwise component of vorticity develops in the bend, and that the ratio\nof the streamwise vorticity at exit (the \"secondary vorticity\") to the original vorticity is\napproximately equal to 2θ. To an observer looking downstream, is this secondary vorticity\nclockwise or counter-clockwise?\n(b) Show that the average transverse velocity at the bend exit is of the order of θ∆V.\n\nExit\nInlet\ny\nb\nb\nx\nV\nθ\nV-∆V\nV+∆V\n(Problem by Ain Sonin and Ascher Shapiro. Used with permission.)"
    },
    {
      "category": "Resource",
      "title": "set6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/10-52-mechanics-of-fluids-spring-2006/649fe5bb66db21dfea2f7ca4f440b5d1_set6.pdf",
      "content": "10.52\nMechanics of Fluids\nSpring 2006\nProblem Set 6\n\nProblem 1\n\nConsider the differential equation:\n\nx\ne\nf\ndx\nf\nd\n-\n-\n=\n-\nε\n\nsubject to\nf = o at x = o\nand\n\nf→o as x→inf\n\nYou may assume that ε2 << 1.\n\nPlease obtain a solution which is uniformly valid to order ε2.\n\nProblem 2\n\nConsider a shallow\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\n<<\nπ\n=\nkH\nH\n/\nD\nwater wave of small amplitude (h/H<<1), as\nshown in the figure. If the water is treated as an ideal (μ=o) fluid, the velocity in the x direction\nis independent of depth and is given by\n\nu = uo cos {k (x-ct)}\n\n(a) What is the corresponding equation for \"h\"?\n\n(b) Find an expression for c in terms of g, H, etc.\n\n(c) It is speculated that most of the viscous dissipation will occur in a boundary layer located\nnear y = o. In other words, it is expected that the following will be true:\n\nk\n\ndy\n\ndy\n\n<<\nδ\n=\nδ\n⎟\n⎠\n⎞\n⎜\n⎝\n⎛\nδ\n≅\nΦ\nΦ\n∫\n∫\nδ\nH\nk\nu\nH\nu\no\no\nL\n/\nB\nBULK\nH\no\n\nThus, there is an incentive to obtain the velocity profile in the boundary layer (because it\nis largely responsible for the viscous dissipation).\n\n(i)\nAssume that the flow near y = 0 is of the boundary layer type, and obtain an\norder-of magnitude expression for the boundary layer thickness.\n(ii)\nWhat criterion must be satisfied if the flow is to be of the boundary layer type?\n(iii)\nObtain an expression for u(y,t) within the boundary layer.\n\nHints:\n\n(i)\nFor (a) and (b), it may be helpful to use a differential control volume of the sort\nshown in the figure.\n(ii)\nRemember that products of small quantities may be neglected.\n\nPossible C.V.\ng\nh\nH\nFigure for Problem 2 (Not to scale)\ny\nx\n-\nδx\n\nProblem 3\n\nProblem 8-6(a) of Deen reads as follows:\n\n\"Consider a jet of fluid which enters a large, stagnant volume of the\n\nsame fluid via a small, circular hole in a wall. This problem is the\n\naxisymmetric analog of Example 8.5-2, and it too has an exact,\n\nanalytical solution. The boundary layer momentum equation in this\n\ncase is\n\nz\nz\nr\nz\nz\nr\nr\nr\nr\n∂ν\n∂ν\n∂ν\nν ∂⎛\n⎞\nν\n+ ν\n=\n⎜\n⎟\n∂\n∂\n∂\n∂\n⎝\n⎠\nz\nr\n\nand the kinematic momentum, which again is a known constant, is\ndefined as\n\nz\nK\nr dr\ninf\n= π ν∫\n\n(a) To obtain a similarity solution, assume that the stream function is\n\nof the form\n\n(\n)\np\nn\nr\nr,z\nz F( ), =\nz\nψ\n= ν\nη\nη\n\nwhere the factor ν has been introduced for later convenience.\n\nShow that p = n = 1.\"\n\nPlease use order-of-magnitude methods to obtain the same similarity transformation.\n\nProblem 4 (Problem by Ain Sonin and Ascher Shapiro. Used with permission.)\n\nThe kinetics of very fast chemical reactions are sometimes studied in shock tubes. The great\nadvantage of this device is the extreme rapidity with which the reactants are brought to\ntemperature.\n\nFor simplicity, consider the case in which no chemical reaction occurs and the fluid is simply air.\nThe shock tube consists of a reservoir connected to a pipe which is separated into two portions\nby a diaphragm (see sketch on page 5). Air is admitted under pressure to the reservoir. Then the\ndiaphragm is burst, and the high pressure gas rushes into the pipe, the useful fact being that the\ndisturbance propagates down the pipe as essentially a step function. Moreover, the velocity of\npropagation is independent of time (see sketch).\n\nIf, in terms of the sketches:\n\nP2 = 8 atm\n\nP1 = 1 atm\n\nT1 = 20°C\n\nV1 = 0\n\nL = 50 m\n\nD = 25 cm\n\ndetermine the time for the discontinuity to travel from the diaphragm to the end of the pipe if air\nis the only fluid. That is, estimate the duration of a kinetic experiment.\n\nData: R = 8.315 kJ/kmol·K = 8.205x10-2 m3·atm/kmol·K\n\nCp = 29.3 kJ/kmol·K\n\nL\nT2\nTemperature\nProfile\nVelocity\nProfile\nPressure\nProfile\nT1\nV2\nV1\nP2\nP1\nD\nDiaphragm\nILLUSTRATION\nReservoir\nSketch of Equipment\n\nProblem 5\n\nConsider fully developed flow in a parallel-plate channel in which there is a constant heat flux qw\nat both surfaces for x>0. The plate spacing is 2H. Show that the Nusselt number for large x is\ngiven by\n\n2hH\nNu\n4.118\nk\n=\n=\n=\n\nProblem 6\n\nProblem 5 addresses the issue of heat transfer in a two dimensional duct for the case x → inf.\nPlease now treat the case for x → o, for which the thermal boundary layer will be thin compared\nto the separation between the two plates. Continue to assume that the flow is hydrodynamically\nfully developed. Do not attempt to get an exact result for Nu, but do obtain an order-of-\nmagnitude result for Nu as a function of H, k, x, etc. Is this different than you would obtain for\nan isothermal wall? Also, obtain the ODE that you would solve in order to get an exact result.\n\nProblem 7\n\nThe potential function for the flow of an inviscid, incompressible fluid past a right circular\ncylinder is:\n\nθ\nφ\ncos\n⎟⎟\n⎟\n⎠\n⎞\n⎜⎜\n⎜\n⎝\n⎛+\n= inf\nr\na\nr\nu\nCYL\n\nDevelop a relationship for the heat transfer coefficient in the neighborhood of the stagnation\npoint. You may assume that the fluid is Newtonian, that the Reynolds Number is very high, and\nthat the Prandtl Number is very much greater than one. Your relationship should be functionally\ncorrect, but it may contain a multiplicative constant of order one. What equations would you\nsolve in order to determine the exact value of the multiplicative constant? Can a simple solution\nbe obtained for Pr << 1? If so, what are the equations that would be solved to obtain an exact\nresult? Do any additional criterian need to be satisfied?"
    }
  ]
}