{
  "course_name": "Mechanical Engineering Tools",
  "course_description": "This course introduces the fundamentals of machine tool and computer tool use. Students work with a variety of machine tools including the bandsaw, milling machine, and lathe. Instruction given on MATLAB®, MAPLE®, XESS™, and CAD. Emphasis is on problem solving, not programming or algorithmic development. Assignments are project-oriented relating to mechanical engineering topics. It is recommended that students take this subject in the first IAP after declaring the major in Mechanical Engineering.\nThis course was co-created by Prof. Douglas Hart and Dr. Kevin Otto.",
  "topics": [
    "Engineering",
    "Mechanical Engineering",
    "Engineering",
    "Mechanical Engineering"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 10 sessions for 2 weeks, 6 hours / session\n\nCourse Overview\n\n2.670 introduces the fundamentals of machine tool and computer tool use. Students will work with a variety of machine tools including the bandsaw, milling machine, and lathe. Instruction given on MATLAB(r), MAPLE(r), XESSTM, and CAD. Emphasis is on problem solving, not programming or algorithmic development. Assignments are project-oriented relating to mechanical engineering topics. It is recommended that students take this subject in the first IAP after declaring the major in Mechanical Engineering.\n\nThis year 2.670 is open to Course II students and freshmen ONLY!\n\nClasses run from 9:00 AM sharp until 4:00 PM every day except weekends, with an hour off for lunch at noon.\n\nAttendance is mandatory-this is serious stuff.\n\nGetting Help\n\nIf you need help, contact your instructors and/or UA's or ask other students in the class. Go on, help each other out!",
  "files": [
    {
      "category": "Resource",
      "title": "hw1a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/7e76328f7bd06224e4bda61e28efcfc2_hw1a.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "hw1b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/0827daad1c70d4f1f1a59836749594a9_hw1b.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "hw3a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/da00cef4b578fd7582d125c85ab3fe9b_hw3a.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "hw3b.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/de8f704bcfd99423750aafcb25098593_hw3b.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "bandsaw.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/6eb93981f67b5338b0430d1b74ac821c_bandsaw.pdf",
      "content": "Band Saw\n\nA Bandsaw in the Laboratory\n\nLabeled Photograph\nDescription\nSelecting and Installing a Blade\nOperating a Band Saw\nLubricating the Blade\nCutting Round Stock\nPhoto by John Dennett\n\nDescription\nThe bandsaw is useful for cutting stock to size and roughing out shapes. It contains a\nserrated blade that forms one continuous loop. The blade is stretched over two pulleys,\nthe upper one idle, the lower one driven by a variable speed electric motor.\n\nSelecting and Installing a Blade\nThere are many different types of blades that can be installed in a band saw. They vary in\ntooth size, tooth shape, blade material, etc. If you're unsure of what type of blade to use\nfor a particular task, the job selector dial may provide guidance, or refer to a handbook or\nmanufacturer's documentation. The material to be cut should be at least three tooth\nwidths in thickness. Therefore, it is often best to cut thin sheets with a shear rather than\nwith a bandsaw (see Working with Sheet Metal). When the proper blade is found, it can\nbe cut to length and welded into a continous band using an electrical resistance welder\nbuilt into the band saw. Upper and lower doors open to expose the pulleys. A tensioner\nallows the upper pulley to be raised and lowered. Lowereing the upper pulley makes it\neasier to install a new blade. The blade must lay properly in the upper and lower blade\nguides. Once the blade is in place, the tension should be set and locked.\n\nOperating a Band Saw\nBefore starting the bandsaw, you should adjust the blade guide/guard to the appropriate\nheight. The less blade that's exposed, the safer you will be. Always set the blade guide\njust high enough to clear the part you're cutting.\n\nThe appropriate cutting speed varies widely for different jobs. For instance, mild steel\nshould be cut at much lower speeds than Aluminum alloys. The Job Selector Dial may\nhelp you choose the right motor speed for your task. To adjust the blade speed the motor\nmust be on. Motor speed can be varied with the variable speed control while motor rpm is\nmonitored on the speed indicator dial.\nWhen cutting with a bandsaw, proper technique is important. Do not lean excessively\ninto the work and keep your hands braced against the table.\nOne of the best features of the bandsaw is its ability to cut curved shapes. Watch for\nproper position of the hands in this clip.\n\nLubricating the Blade\nIf you're making a long or deep cut, lubricate the blade with stick wax. Just push the tube\nbriefly into the running blade. Do not attempt to apply wax with your fingers.\n\nCutting Round Stock\nThe band saw has a tendency to spin round stock and the rough edges of the stock could\ncut your hands. To avoid this, secure the stock in a drill press vise before cutting."
    },
    {
      "category": "Resource",
      "title": "beltsand.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/bf5c8bc30a19c926f6e66be8b2b684e1_beltsand.pdf",
      "content": "Belt Sander\n\nA Belt Sander in the Laboratory\n\nLabeled Photograph\nDescription\nOperating a Belt Sander\nUsing a Small Belt Sander\n\nDescription\nA belt sander is useful for removing burrs and rough edges from parts. It is composed of\na belt coated with abrasive riding about two pulleys. The lower pulley is driven by a\nmotor. The upper pulley follows and allows tension in the belt to be adjusted.\nBeltsanders are effective on wood, most metals (aluminum, steel, brass, etc), and some\nplastics. The small particles generated by the belt sander can be toxic. It's good to use a\nsander with a vent attached to it and to wear a mask when using the belt sander. Don't use\nthe belt sander on printed circuit boards or fiberglass; they create toxic particles.\nPhoto by John Dennett\n\nOperating a Belt Sander\nWhen smoothing edges and rounding corners, the part should be supported on the table of\nthe machine. The part should be moved back and forth to achieve a better finish and to\navoid hot spots on the belt.\n\nTo round off the edges of a part, one must hold the part on an angle with respect to the\nbelt. Be sure that the belt is pointing down into the belt as demonstrated in the video. If\nthe part is pointing up, the belt could catch on the part and throw it down into your hand.\nNote the size of the gap between the belt and table is wider than the workpiece. This is a\ndangerous situation. The gap should be adjusted.\n\nUsing a Small Belt Sander\nSome jobs cannot be done on the large belt sander shown above. For instance it is\nimpossible to smooth out the faces of an inside corner. For this task, a smaller machine\nwith a thin belt is appropriate.\n\nAs the small belt sander was previously configured, it is difficult to smooth out convex\nfeatures without creating facets on the part. This problem can be alleviated by\nreconfiguring the machine. The table and platen can be removed to allow the belt to\nconform to the shape of your part."
    },
    {
      "category": "Resource",
      "title": "drill.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/a935e2bd259f813646107327352ea5a6_drill.pdf",
      "content": "Drill Press\n\nA Three-Drill Press in the Laboratory\n\nLabeled Photograph\nDescription\nUsing a Center Finder\nDrilling a Hole\nDeburring a Hole\nReaming a Hole\nThread Standards\nTapping a Hole\n\nPhoto by Curt Newton\n\nDescription\nA drill press is preferable to a hand drill when the location and orientation of the hole\nmust be controlled accurately. A drill press is composed of a base that supports a column,\nthe column in turn supports a table. Work can be supported on the table with a vise or\nhold down clamps, or the table can be swiveled out of the way to allow tall work to be\nsupported directly on the base. Height of the table can be adjusted with a table lift crank\nthan locked in place with a table lock. The column also supports a head containing a\nmotor. The motor turns the spindle at a speed controlled by a variable speed control dial.\nThe spindle holds a drill chuck to hold the cutting tools (drill bits, center drills, deburring\ntools, etc.).\nThe quill is moved up and down with a lever on the side as shown here.\n\nUsing a Center Finder\nA center finder is useful for setting the spindle of a drill press or mill accurately over a\nknown point. A center finder is made of two separate pieces spring loaded together.\n\nThe center finder is used by installing it in the chuck, placing the pointed end into a\ncenterpunch mark, and pressing down lightly on the quill. At first, the two parts will\nprobably not be concentric.\nThe bed of the drill or mill can then be adjusted to until the two halves are concentric.\nCheck for concentricity by running your fingers up and down the center finder. You\nshould detect no steps. You should be able to locate the desired position to within .001\ninches using this technique. Now the hole is ready to be drilled.\nDrilling a Hole\nFirst, a center drill should be used. A center drill has a thick shaft and very short flutes. It is\ntherefore very stiff and won't walk as the hole is getting started. It doesn't cut as easily as a\ndrill bit, so you should use cutting fluid.\n\nNow the hole can be drilled. If the hole is large, its a good idea to drill a smaller pilot hole\nbefore drilling the final one. Your hole will be more accurately positioned, rounder, and the\nbits will last longer. If the hole is deeper than it is wide. use coolant and back off occasionally\nto clear the chips. As you step up in drill size, you will need to reduce the spindle speed. If\ndrilling a through hole, ensure that the bit will not drill the table after moving through your\nwork. To set a desired depth of hole, there is a depth stop on the quill.\n\nDeburring a Hole\nUsually, the top edge of the hole will be fairly clean, but the bottom edge will have\nsubstantial burrs. To remove them, insert a deburring tool into the hole and run the tool\nabout the edge of the hole with moderate pressure.\n\nReaming a Hole\nA drilled hole will be accurate to about two thousandths of an inch in diameter. If greater\nprecision is required for slip fits or interference fits, a reamer must be used. The straight\nflutes of a reamer cannot drill a hole. You must drill a hole slightly undersize to start. Be\nsure to drive the reamer down with a constant, slow speed.\n\nThread Standards\nThe threads cut by taps and dies conform to a standard for the shape of the threads. Often\nit is the American National Standard in National Coarse (NC) or National Fine (NF). NC\nhas fewer threads per inch than NF. NC is most common while NF is favored in precision\nassemblies. Also in common use is the Unified Thread System with UNC (coarse) and\nUNF (fine). The only difference between National and Unified threads is the shape of the\nroot and crest. The threads in the two different standards will mate. Fasteners are\ndesignated by their diameter, number of threads per inch, and shape. For example, 1/4-\n20NC means 1/4 inch diameter, 20 threads per inch, and National Standard. Threads\nsmaller than 1/4 inch are designated by number from 0 (smallest) to 12 (largest). To\nconvert number to diameter multiply by 0.013 and add 0.060.\nTapping a Hole\nIf you want to cut threads in a hole, use a tap. The picture below shows what a tap looks\nlike. It has cutting edges to cut the threads and straight flutes to allow chips to be\nexpelled. Note that the end is tapered slightly to help the tap get started. Taps and dies are\nhard and brittle so you should be careful working with them (try not to drop them or force\nthem into a hole when stuck). Be sure that the hole you drilled is the correct size for the\ntap you're using or it may break inside your part. Refer to a chart or machinist's\nhandbook. The die in the picture is for cutting external threads on a shaft.\nIt's best to use the drill press to help maintain alignment as you tap the hole. First, use\nthe centerfinder to place the spindle directly above the hole. Then install a tapered guide\ninto the chuck. Put the tap in place and apply moderate pressure with the quill as you turn\nthe tap. It's good practice to back the tap up a bit for every quarter turn of thread you cut."
    },
    {
      "category": "Resource",
      "title": "grind.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/4042318e31e8180b0f7629719e4bac52_grind.pdf",
      "content": "Grinding and Buffing\n\nThe primary purpose of a grinding wheel is to sharpen tools (eg. drill bits). The hard\nabrasive of the wheel is made for removing very hard materials like high speed steel.\nNever grind on the side of the wheel. Also, never grind a soft material such as\nAluminum. The material will coat the wheel and prevent the abrasive from working\nproperly.\nIf Aluminum is pressed against the wheel for too long the wheel could heat excessively\nand explode. If the grinding wheel does become coated with metal, dress the wheel prior\nto use.\nA deburring wheel is made of a material similar to a pot scrubber -- a mesh of abrasive\nfibers held together with adhesive. It's good for intermediate polishing. Even very hard\nmaterials such as tool steel can be removed with a deburring wheel. A tool that has been\nsmoothed out in this manner can be used to burnish a part in the lathe to achieve a very\nfine finish.\nWorking with the deburring wheel, it is critical to maintain proper orientation of the part.\nIf a corner catches on the wheel, it can be thrown down forcefully. The part will probably\nbe marred and you could easily be hurt. This applies to buffing and grinding as well.\nA buffing wheel is made of cloth. By itself it is not abrasive. To make it work properly,\nabrasive must be applied. Abrasives come in a tube and are suspended in wax. The tube is\npressed onto the wheel as it spins, melting the wax, which helps the abrasive adhere to\nthe cloth.\nTo buff a part, hold it against the wheel with a firm pressure. Keep moving the part about\nand gradually lighten the pressure as the finish gets finer and finer."
    },
    {
      "category": "Resource",
      "title": "lathe.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/9fbd7102d7b4c0e533ef37679d719ac0_lathe.pdf",
      "content": "Lathe\n\nA Lathe\n\nLabeled Photograph\nDescription\nChoosing a Cutting Tool\nInstalling a Cutting Tool\nPositioning the Tool\nFeed, Speed, and Depth of Cut\nTurning\nFacing\nParting\nDrilling\nBoring\nSingle Point Thread Turning\nAdvanced Work Holding\nPhoto by Curt Newton\n\nDescription\nThe purpose of a lathe is to rotate a part against a tool whose position it controls. It is\nuseful for fabricating parts and/or features that have a circular cross section. The spindle\nis the part of the lathe that rotates. Various workholding attachments such as three jaw\nchucks, collets, and centers can be held in the spindle. The spindle is driven by an electric\nmotor through a system of belt drives and/or gear trains. Spindle speed is controlled by\nvarying the geometry of the drive train.\nThe tailstock can be used to support the end of the workpiece with a center, or to hold\ntools for drilling, reaming, threading, or cutting tapers. It can be adjusted in position\nalong the ways to accommodate different length workpieces. The ram can be fed along\nthe axis of rotation with the tailstock handwheel.\nThe carriage controls and supports the cutting tool. It consists of:\n-\nA saddle that mates with and slides along the ways.\n-\nAn apron that controls the feed mechanisms.\n-\nA cross slide that controls transverse motion of the tool (toward or away from the\noperator).\n-\nA tool compound that adjusts to permit angular tool movement.\n-\nA toolpost T-slot that holds the toolpost.\nChoosing a Cutting Tool\nCutting tool geometry varies with the type of work to be done.\n\n-\nFacing tools are ground to provide clearance with a center.\n-\nRoughing tools have a small side relief angle to leave more material to support the\ncutting edge during deep cuts.\n-\nFinishing tools have a more rounded nose to provide a finer finish. Round nose\ntools are for lighter turning. They have no back or side rake to permit cutting in\neither direction.\n-\nLeft hand cutting tools are designed to cut best when traveling from left to right.\n-\nAluminum is cut best by specially shaped cutting tools (not shown) that are used\nwith the cutting edge slightly above center to reduce chatter.\n\nInstalling a Cutting Tool\nLathe cutting tools are held by tool holders. To install a tool, first clean the holder, then\ntighten the bolts.\nThe tool post is secured to the compound with a T-bolt. The tool holder is secured to the\ntool post using a quick release lever.\n\nPositioning the Tool\nIn order to move the cutting tool, the lathe saddle and cross slide can be moved by hand.\nThere are also power feeds for these axes. Procedures vary from machine to machine.\nA third axis of motion is provided by the compound. The angle of the compound can be\nadjusted to allow tapers to be cut at any desired angle. First, loosen the bolts securing the\ncompound to the saddle. Then rotate the compound to the desired angle referencing the\ndial indicator at the base of the compound. Retighten the bolts. Now the tool can be hand\nfed along the desired angle. No power feed is available for the compound. If a fine finish\nis required, use both hands to achieve a smoother feed rate.\nThe cross slide and compound have a micrometer dial to allow accurate positioning, but\nthe saddle doesn't. To position the saddle accurately, you may use a dial indicator\nmounted to the saddle. The dial indicator presses against a stop (often a micrometer as\nshown in the clip below).\nFeed, Speed, and Depth of Cut\nCutting speed is defined as the speed at which the work moves with respect to the tool\n(usually measured in feet per minute). Feed rate is defined as the distance the tool travels\nduring one revolution of the part. Cutting speed and feed determines the surface finish,\npower requirements, and material removal rate. The primary factor in choosing feed and\nspeed is the material to be cut. However, one should also consider material of the tool,\nrigidity of the workpiece, size and condition of the lathe, and depth of cut. For most\nAluminum alloys, on a roughing cut (.010 to .020 inches depth of cut) run at 600 fpm. On\na finishing cut (.002 to .010 depth of cut) run at 1000 fpm. To calculate the proper spindle\nspeed, divide the desired cutting speed by the circumference of the work. Experiment\nwith feed rates to achieve the desired finish. In considering depth of cut, it's important to\nremember that for each thousandth depth of cut, the work diameter is reduced by two\nthousandths.\nTurning\nThe lathe can be used to reduce the diameter of a part to a desired dimension. First, clamp\nthe part securely in a lathe chuck. The part should not extend more that three times its\ndiameter. Then install a roughing or finishing tool (whichever is appropriate). If you're\nfeeding the saddle toward the headstock (as in the clip below) use a right-hand turning\ntool. Move the tool off the part by backing the carriage up with the carriage handwheel,\nthen use the cross feed to set the desired depth of cut. In the clip below, a finish cut is\nmade using the power feed for a smoother finish. Remember that for each thousandth\ndepth of cut, the work diameter is reduced by two thousandths.\n\nFacing\nA lathe can be used to create a smooth, flat, face very accurately perpendicular to the axis\nof a cylindrical part. First, clamp the part securely in a lathe chuck. Then, install a facing\ntool. Bring the tool approximately into position, but slightly off of the part. Always turn\nthe spindle by hand before turning it on. This ensures that no parts interfere with the\nrotation of the spindle. Move the tool outside the part and adjust the saddle to take the\ndesired depth of cut. Then, feed the tool across the face with the cross slide. The\nfollowing clip shows a roughing cut being made; about 50 thousandths are being\nremoved in one pass. If a finer finish is required, take just a few thousandths on the final\ncut and use the power feed. Be careful clearing the ribbon-like chips; They are very\nsharp. Do not clear the chips while the spindle is turning. After facing, there is a very\nsharp edge on the part. Break the edge with a file.\nParting\nA parting tool is deeper and narrower than a turning tool. It is designed for making\nnarrow grooves and for cutting off parts. When a parting tool is installed, ensure that it\nhangs over the tool holder enough that the holder will clear the workpiece (but no more\nthan that). Ensure that the parting tool is perpendicular to the axis of rotation and that the\ntip is the same height as the center of the part. A good way to do this is to hold the tool\nagainst the face of the part. Set the height of the tool, lay it flat against the face of the\npart, then lock the tool in place. When the cut is deep, the side of the part can rub against\nsides of the groove, so it's especially important to apply cutting fluid. In this clip, a part is\ncut off from a piece of stock.\nDrilling\nA lathe can also be used to drill holes accurately concentric with the centerline of a\ncylindrical part. First, install a drill chuck into the tail stock. Make certain that the tang on\nthe back of the drill chuck seats properly in the tail stock. Withdraw the jaws of the chuck\nand tap the chuck in place with a soft hammer.\nMove the saddle forward to make room for the tailstock. Move the tailstock into position,\nand lock the it in place (otherwise it will slide backward as you try to drill). Before\nstarting the machine, turn the spindle by hand. You've just moved the saddle forward, so\nit could interfere with the rotation of the lathe chuck. Always use a centerdrill to start the\nhole.. You should use cutting fluid with the centerdrill. It has shallow flutes (for added\nstiffness) and doesn't cut as easily as a drill bit. Always drill past the beginning of the\ntaper to create a funnel to guide the bit in. In this clip, a hole is drilled with a drill bit.\nTake at most one or two drill diameters of material before backing off, clearing the chips,\nand applying cutting fluid. If the drill bit squeaks, apply solvent more often. The drill\nchuck can be removed from the tail stock by drawing back the drill chuck as far as it will\neasily go, then about a quarter turn more. A pin will press the chuck out of the collet.\n\nBoring\nBoring is an operation in which a hole is enlarged with a single point cutting tool. A\nboring bar is used to support the cutting tool as it extends into the hole. Because of the\nextension of the boring bar, the tool is supported less rigidly and is more likely to chatter.\nThis can be corrected by using slower spindle speeds or by grinding a smaller radius on\nthe nose of the tool.\n\nSingle Point Thread Turning\nExternal threads can be cut with a die and internal threads can be cut with a tap. But for\nsome diameters, no die or tap is available. In these cases, threads can be cut on a lathe. A\nspecial cutting tool should be used, typically with a 60 degree nose angle. To form\nthreads with a specified number of threads per inch, the spindle is mechanically coupled\nto the carriage lead screw. Procedures vary for different machines.\nAdvanced Work Holding\nSome parts require special techniques to hold them properly for lathe work. For instance,\nif you wish to cut on the entire outside diameter of a part, then the part cannot be held in\na chuck or collet. If the part has a hole through it, you can press it on to a lathe arbor (a\nslightly tapered shaft), and clamp onto the arbor rather than the part itself. The hole must\nhave an adequate aspect ratio or the part will not be firmly supported.\nIf the part has a very large hole through it, a lathe arbor may not be a practicable solution.\nYou may instead use the outside of the jaws to hold the inside diameter of the part.\nIf the part has a very complex geometry, it may be necessary to install the part onto a\nface plate. The face plate is then attached to the spindle."
    },
    {
      "category": "Resource",
      "title": "layout.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/28d5c216798fbdbcbcbbbbb9e341b7b1_layout.pdf",
      "content": "Part Layout\n\nIntroduction\nScribing Lines\nUsing a Center Punch\nUsing a Compass\n\nIntroduction\nAlways have your drawings completed before coming to the machine shop. The shop can\nbe distracting and you're bound to make mistakes if you try to do drafting or design work\nthere.\nOne good way to lay a part out on a piece of stock is simply to plot out a 1:1 scale\ndrawing of the part and glue it to the part surface. If you do it this way, you can be sure\nno errors will be made in transferring the part from the computer to the surface of the\npart.\nIf a scale drawing is not available, the part can be laid out by hand. First, apply a thin coat\nof blue die. If you apply too much, it will have a tendency to flake off when you try to\nscribe a line through it. You can use a square and a scribe to make a line perpendicular to\nan edge on your part. The scribed line will be about 0.002 inches wide, so you can make\na reasonably accurate part by milling up to such a line by eye.\n\nScribing Lines\nYou can make a line that is parallel to an existing edge on your part by offsetting a\nspecified distance with a ruler or, more accurately, with parallel plates. Parallel plates\ncome in widths spaced 1/16 inch apart and can be stacked up to achieve desired\ndimensions. Note how an extra parallel is held vertical to provide alignment with the\nedge of the part.\n\nAnother way to scribe lines offset from an existing feature is with a caliper. First, set the\ndesired offset and lock it in. Then, run the caliper along the edge of the part scribing a\nline with the point of the caliper as you go. This is quick and easy, but somewhat less\naccurate than using parallel plates.\n\nUsing a Center Punch\nLocations of holes referenced to corners can be found by crossing two scribe lines. Hole\npositions should be marked with a center punch. If accuracy is important, use a\nmagnifying glass to set the punch on the mark. Then, give the punch a couple of light\ntaps with a hammer.\n\nThe centerpunch creates a dimple that tends to guide the drill bit to the proper location.\nWithout the dimple, the drill bit can \"walk\" away from the desired location.\n\nUsing a Compass\nCircles and fillets can be laid out using a compass. Just set one end at the center of the\narc, then scribe the arc."
    },
    {
      "category": "Resource",
      "title": "measure.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/8d23a77bb35a7bf17898905fcbb433a0_measure.pdf",
      "content": "Measurement\n\nIntroduction\nCalipers\nMicrometer\nIntroduction\nMeasurement is the comparison of an unknown dimension to a known standard. Good\nmeasuring instruments were a key to high volume production. Without them, parts could\nnot be built accurately enough to be interchangeable. Each assembly had to be hand fitted\ntogether. Today, measuring tools are essential for most machining operations from initial\npart layout to final inspection.\nCalipers\nA typical caliper might measure lengths from 0 to 7.5 inches to a\nprecision of one thousandth of an inch. One can measure the outside of a part with the\njaws, the inside of a hole or slot with the nibs, or the depth of a hole or shoulder with the\nextension bar.\nIt takes a little practice to read a vernier scale properly. Calipers often have a dial or digital\nreadouts instead.\n\nTo read a vernier caliper:\n-\nRead the large number division first.\n-\nRead the small number division.\n-\nRead the number of smaller subdivisions. Each represents 0.025 inches to be\nadded to the measurement.\n-\nRead which line on the vernier lines up with a line on the main beam. For each\nline a thousandth must be added to the measurement.\n\nMicrometer\nA micrometer generally provides greater precision than a caliper, but can measure a\nsmaller range of lengths.\nTo use a micrometer, place the part in the opening. Next, turn the thimble until the\nspindle contacts the work. To apply a consistent pressure to the part, use the ratchet stop.\nUse the clamp ring to hold the thimble in place while you read the micrometer. To read\nthe micrometer:\n-\nRead the exposed number on the barrel.\n-\nRead the number of divisions past the number. Each division represents 0.025\ninches.\n-\nRead the division on the spindle. These usually read to less than thousandths of an\ninch."
    },
    {
      "category": "Resource",
      "title": "mill.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/69ddc43986801c51a7fbfa97d6b5b63f_mill.pdf",
      "content": "Milling Machine\n\nA milling machine\n\nPhoto by John Dennett\n\nLabeled Photograph\nDescription\nTramming the Head\nSquaring the Vise\nTypes of Milling Cutters\nRemoving and Installing End Mills\nClimb vs. Conventional Millng\nCalculating Speeds and Feeds\nSetting Spindle Speed\nUsing an Edge Finder\nUsing the Micrometer Dials\nSquaring Stock\nFace Milling\nMilling Slots\nAdvanced Work Holding\n\nDescription\nMilling machines are very versatile. They are usually used to machine flat surfaces, but\ncan also produce irregular surfaces. They can also be used to drill, bore, cut gears, and\nproduce slots. The type of milling machine most commonly found in student shops is a\nvertical spindle machine with a swiveling head. Although there are several other types of\nmilling machines, this document will focus only on the vertical milling machine.\nA milling machine removes metal by rotating a multi-toothed cutter that is fed into the\nmoving workpiece. The spindle can be fed up and down with a quill feed lever on the\nhead.\nThe bed can also by fed in the x, y, and z axes manually. In this clip the z axis is adjusted\nfirst, then the y, than the x.\nOnce an axis is located at a desired position and will no longer be fed, it should be locked\ninto position with the gibb locks.\nMost milling machines are equipped with power feed for one or more axes. Power feed is\nsmoother than manual feed and, therefore, can produce a better surface finish. Power feed\nalso reduces operator fatigue on long cuts. On some machines, the power feed is\ncontrolled by a forward reverse lever and a speed control knob.\n\nTramming the Head\nThe head of a vertical milling machine can be tilted from side to side and from front to\nback. This allows for versatility of the machine, but these adjustments can drift.\nOccasionally, one should check and adjust the head so that the spindle will be normal to\nthe plane of the table. Install a dial indicator into the spindle so that the dial is offset at\nleast six inches from the axis of the spindle and the indicator probe is facing down.\nLower the spindle until the dial indicator contacts the table then registers about one half\nof a revolution. Set the dial indicator is toward you and set the bezel to zero. Rotate the\nspindle by hand 180 degrees. If the dial indicator still reads zero, the spindle is aligned\nfront to back. If not, adjust the head until the dial reads half of the original reading and\niterate the entire process until the error falls within acceptable limits. Repeat the process\nwith the dial displaced left and right to alight the head side to side.\n\nSquaring the Vise\nWork on a milling machine is most often held in a vise clamped onto the bed. To make\nfeatures aligned with the edges of the stock, it's necessary to align the vise with the feed\naxes of the mill. To do this, mount the vise on the bed and secure it with T-bolts, but only\nlightly so as to permit adjustment of the orientation of the vise. Mount a dial indicator in\nthe spindle of the machine with the probe facing away from you. Lower the spindle and\nrun the bed of the table back until the fixed jaw of the vise is in contact with the indicator\nand further until the indicator registers one half of a revolution. Set the bezel to zero. Use\nthe cross feed to run the indicator across the face of the vise. If the vise is squared, the\nindictor will remain at zero. If the dial indicator does not read zero, tap lightly with a soft\nhammer to realign the vise reduce the indicator reading to half of its previous value.\nIterate this procedure until the dial indicator reads zero through the full travel across the\nface of the vise. Tighten down the T-bolts be careful not to change the vise orientation.\nRecheck the alignment of the vise.\n\nTypes of Milling Cutters\nIn vertical mills, milling cutters with solid shafts are usually used. Milling cutters with\nkeyed holes are predominantly for use in horizontal mills. End mills are designed for\ncutting slots, keyways and pockets. Two fluted end mills can be used to plunge into work\nlike a drill. End mills with more than two flutes should not be plunged into the work. Ball\nend mills can produce a fillet. Formed milling cutters can be used to produce a variety of\nfeatures including round edges.\n\nRemoving and Installing Milling Cutters\nEnd mills can be held by the spindle in several ways; a few of the ways are shown in the\nfigure below. On most machines, a draw bar is used to pull a spring collet into a taper in\nthe spindle.\n\nSpring Collets\nTo remove a tool, move the quill to the highest position and lock it in place. Then, engage\nthe brake while loosening the draw bar with a wrench. Ensure that the draw bar's threads\nare still engaged in the collet. Tap on the end of the draw bar to release the collet from the\nspindle. If the threads of the draw bar are not engaged, the milling cutter will fall, and\ncould be damaged. Finally, unscrew the drawbar from the collet.\nPhoto by Curt Newton\n\nTo install a tool, place the desired milling cutter in a collet that fits the shank of the\ncutter. Insert the collet into the spindle. Ensure that the key way on the collet mates\nproperly with the key in the spindle. While holding the tool with one hand, start the\nthreads of the draw bar into the collet by hand. Use a wrench to tighten the drawbar down\nwith one hand while holding the brake.\nClimb vs. Conventional Milling\nWhen milling, one should be aware of the difference between conventional, and climb\nmilling. In conventional milling, the workpiece is fed into the rotation of the cutter. This\ntype of cut requires lower forces and is preferred for roughing cuts. In climb milling, the\nwork moves with the rotation of the cutter. This produces a better finish. It is not\nrecommended if the workpiece cannot be held securely or cannot support high forces.\n\nConventional Milling\n\nClimb Milling\n\nCalculating Speeds and Feeds\nCutting speed refers to the speed at which the tool point of the cutter moves with respect\nto the work measured in feet per minute. Feed is the rate at which the work moves into\nthe cutter measured in feed per tooth revolution. Feeds and speeds affect the time to\nfinish a cut, tool life, finish of the machined surface and power required of the machine.\nThe cutting speed is mostly determined by the material to be cut and the material of the\ntool. To find the right speed for any task, refer to the Machinery's Handbook or other\nreference. To calculate the proper spindle speed, divide the desired cutting speed by the\ncircumference of the tool expressed in feet. The feed rate depends on the width and depth\nof cut, finish desired and many other variables. To calculate the desired feed setting from\nthe feed rate, multiply feed per tooth per revolution by number of teeth and rpm of the\nspindle.\nSetting Spindle Speed\nSpindle speed is varied by changing the geometry of the drive train. On many modern\nmachines, it can be adjusted continuously with a hand crank. The spindle must be turning\nto make the adjustment. A dial indicator reads the speed in rpm.\nThe spindle speed dial indicator shown above has two scales, one for low range, and one\nfor high range. The machine is switched between ranges with a lever. Sometimes, the\nspindle must be rotated slightly to allow the gears to mate properly.\nUsing an Edge Finder\nBefore doing precise work on a milling machine, one must locate the edges of a part\naccurately. An edgefinder is designed to help you do this. An edgefinder is composed of\ntwo concentric cylinders, spring loaded together. To use it, offset the two halves slightly\nso that there is a wobble as it spins. Then, move the part into the tool slowly. The edge\nfinder will center up, then break out of concentricity suddenly. At that point, reset the dial\nindicator or digital readout for that axis of the machine to a value equal the radius of the\nedgefinder. Repeat the process at least once.\nUsing the Micrometer Dials\nMost milling machine manual feeds are equipped with dial indicators. If you know how\nfar you want to feed the bed, you can set the dial indicator to that number (in thousandths\nof an inch). Just turn the locking ring counterclockwise to free the dial indicator, set the\ndial, and lock in the setting. Be certain that the backlash in the mechanism driving the\ntable is taken up prior to setting the dial indicator.\n\nMany modern machines have digital readouts. These are preferred since they measure the\nbed position directly so you need not be concerned with backlash. They also readout bed\nposition in metric units if desired.\nSquaring Stock\nTo create a square corner on a part, first orient an already finished edge vertically in the vise\nand clamp lightly onto the part. Set a machinist's square against the finished edge and the\nbottom of the vise. Lightly tap the part with a plastic hammer to align it with the square. Clamp\nthe vise down securely. Now the top edge of the part is ready to be milled to horizontal.\nFace Milling\nIt is often necessary to create a flat face on a large part. This can be done best with a\nfacing cutter. Select a cutter about one inch wider than the workpiece so that the facing\ncan be accomplished in one pass.\nMilling Slots\nEnd mills are designed to cut square slots. They will produce a slot to within two\nonethousandths of an inch in one pass. If greater accuracy is required, use an end mill a\nlittle smaller than the desired slot. Measure the slot produced and open it to the desired\ndimension with a second pass. The following clip shows and end mill cutting a slot. Note\nthat the depth of cut is approximately equal to the diameter of the cutter.\n\nAdvanced Work Holding\nTo hold round stock more securely in a vise, use a v-block. The work can be held\nvertically or horizontally.\nRound stock often cannot be held securely in the vise without damaging the work. A\ncollet block is designed to hold round stock. Square collet blocks allow the part to be\nindexed to put in features at 90 degree increments. To mill features at 60 degree\nincrements, use a hexagonal block.\nA workpiece can be set up easily when the desired features are parallel with or\nperpendicular to the workpiece edges. When the features are at an angle to the edges,\nmore ingenuity is required. Here, an angle plate is used to set the position of a vise within\na vise. Thus a slot can be milled into a workpiece at any desired angle.\nSome parts don't fit well into a vise. These parts can be secured directly to the bed of the\nmachine with hold down clamps. It is good practice to create a gap between the bed and\nthe work with parallels. The clamps should be tilted down slightly into the work.\nTo create circular features on a mill, a rotary table can be installed onto the bed. The\ntable allows the workpiece to be rotated. A dial indicator allows precise control of the\nangle of rotation."
    },
    {
      "category": "Resource",
      "title": "physics.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/15f579e0daa03aff44cd6c557e369377_physics.pdf",
      "content": "Metal cutting Physics\n\nIdealized Chip Formation\nBuilt Up Edge\nCalculating Speeds and Feeds\nIdealized Chip Formation\nThe figure below depicts an idealized, two dimensional view of the metal cutting process.\nThe assumptions in this model are that the tool is perfectly sharp, that the cut depth t and\nthe cutting speed V are constant, and that the cut depth is small compared to the cut\nwidth. In this idealized model, the material layer at the top is formed into a chip by a\nshearing process in the primary shear zone at AB. The chip slides up the rake face\nundergoing some secondary plastic flow due to the forces of friction. This idealized\nmodel correctly predicts that cutting force increases with cut depth, material hardness,\nand friction coefficient. Cutting forces are inversely proportional to rake angle. Power\nrequired increases with the feed rate.\n\nBuilt Up Edge\nOne important effect that is not considered in the model above is built up edge. Under\nmost cutting conditions, some of the cut material will attach to the cutting point. This\ntends to cause the cut to be deeper than the tip of the cutting tool and degrades surface\nfinish. Also, periodically the built up edge will break off and remove some of the cutting\ntool. Thus, tool life is reduced. In general, built up edge can be reduced by:\n-\nIncreasing cutting speed\n-\nDecreasing feed rate\n-\nIncreasing ambient workpiece temperature\n-\nIncreasing rake angle\n-\nReducing friction (by applying cutting fluid)\n\nCalculating Speeds and Feeds\nCutting speed refers to the speed at which the tool point of the cutter moves with respect\nto the work measured in feet per minute. Feed is the rate at which the work moves into\nthe cutter measured in feed per tooth revolution. Feeds and speeds affect the time to\nfinish a cut, tool life, finish of the machined surface, and power required of the machine.\nThe cutting speed is mostly determined by the material to be cut and the material of the\ntool. To find the right speed for any task, refer to the Machinery's Handbook or other\nreference. To calculate the proper spindle speed, divide the desired cutting speed by the\ncircumference of the tool (or of the part if it is rotating) expressed in feet. The feed rate\ndepends on the width and depth of cut, finish desired and many other variables. To\ncalculate the desired feed setting from the feed rate, multiply feed per tooth per\nrevolution by number of teeth and rpm of the spindle."
    },
    {
      "category": "Resource",
      "title": "sheet.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-670-mechanical-engineering-tools-january-iap-2004/4ebb7b36cb672fc232fe99ef7ec1252a_sheet.pdf",
      "content": "Working with Sheet Metal\nShear\nNotcher\nPress Brake\n\nShear\n\nA Shear\nStraight edges can be cut onto sheet metal stock using a shear. Ensure that the shear is rated to\ncut the gauge of sheet metal you're working with, or you may damage the blade. The gauge\nrating of a shear is generally marked prominently on the machine. Sheet stock should be placed\non the table and slid below the plexiglass shield. When the stock is oriented properly, make a\ncut by stepping down on the treadle. When the material shears, the treadle may slam down\nforcefully. The treadle stops are designed to prevent the treadle from crushing your someone's\nfoot. Still, it is good practice to make sure your other foot isn't beneath the treadle.\n\nPhoto by John Dennett\n\nNotcher\n\nA Notcher\n\nThe machine shown above will create 90 degree notches in sheet metal. This makes it\npossible to create profiles that can then be bent into three dimensional shapes (like\nboxes). Lay the work on the table. The guides can be used to help orient the part as\ndesired. Pulling on the actuating lever will cut a notch in the work.\n\nPhoto by Curt Newton\nPress Brake\n\nA press brake can be used to bend sheet metal. The work must be slid under the shoes.\nRaise the shoes with the elevation levers, slide the work in place, and lower the shoes\nback down. The radius of the bend can be set with adjustment bolts on both sides of the\nmachine. Minimum bend radius is a function of the ductility and thickness of the material\nbeing worked. For aluminum sheet, the bend radius should be greater than the sheet\nthickness. Bend the work by applying force to the bending lever. It is necessary to bend\nthe work slightly beyond the desired angle as the metal will \"spring-back\"; elastic\ndeformation is recovered when the bending force is relaxed."
    }
  ]
}