{
  "course_name": "Mechanical Behavior of Materials",
  "course_description": "Here we will learn about the mechanical behavior of structures and materials, from the continuum description of properties to the atomistic and molecular mechanisms that confer those properties to all materials. We will cover elastic and plastic deformation, creep, and fracture of materials including crystalline and amorphous metals, ceramics, and (bio)polymers, and will focus on the design and processing of materials from the atomic to the macroscale to achieve desired mechanical behavior. Integrated laboratories provide the opportunity to explore these concepts through hands-on experiments including instrumentation of pressure vessels, visualization of atomistic deformation in bubble rafts, nanoindentation, and uniaxial mechanical testing, as well as writing assignments to communicate these findings to either general scientific or nontechnical audiences.",
  "topics": [
    "Engineering",
    "Materials Science and Engineering",
    "Mechanical Engineering",
    "Solid Mechanics",
    "Science",
    "Physics",
    "Classical Mechanics",
    "Engineering",
    "Materials Science and Engineering",
    "Mechanical Engineering",
    "Solid Mechanics",
    "Science",
    "Physics",
    "Classical Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 3 sessions / week, 1 hour / session\n\nRecitations: 1 session / week, 1 hour / session\n\nLabs: 1 session / week, 4 hours / session\n\nOverview\n\nHere we will learn about the mechanical behavior of structures and materials, from the continuum description of properties to the atomistic and molecular mechanisms that confer those properties to all materials. We will cover elastic and plastic deformation, creep, and fracture of materials including crystalline and amorphous metals, ceramics, and (bio)polymers, and will focus on the design and processing of materials from the atomic to the macroscale to achieve desired mechanical behavior. Integrated laboratories provide the opportunity to explore these concepts through hands-on experiments including instrumentation of pressure vessels, visualization of atomistic deformation in bubble rafts, nanoindentation, and uniaxial mechanical testing, as well as writing assignments to communicate these findings to either general scientific or nontechnical audiences.\n\nLaboratory Experiments\n\nLabs are conducted in groups and written up individually. The first recitation will outline the lab activities and schedule in detail. In short, you will attend lab 9am-1pm on\neither\nTuesday or Thursday of a given lab week, as indicated on the 3.032 calendar. You will attend recitation on the day (T or R) that you do not have lab that week.\n\nLab 1: Stress transformations and pressure vessels\n\nLab 2: Atomistic origin of elasticity\n\nLab 3: Micro and nanoscale plasticity\n\nLab 4: Uniaxial mechanical testing\n\nPlease arrive promptly; late arrivals receive a zero for that lab. Due to class size, participation in the other Group's lab day is not a permissible means to make up a missed lab. Missed labs in the case of an emergency that is excused by the deans at Student Support Services will be accommodated with an alternative assignment from Prof. Vander Sande. Lab material will be included in the quizzes. In other words, don't miss lab. You will meet your lab TA at the first 3.032 recitation, and this person will be your TA for your lab group throughout the semester. As will be discussed at the first recitation, each lab includes a short quiz at the start of the session, and an independent assignment.\n\nTextbooks\n\nRequired: 3.032 Course Reader,\nMechanical Behavior of Materials\n\nRecommended Supplementary*: Hosford, W. F.\nMechanical Behavior of Materials\n. New York, NY: Cambridge University Press, 2005. ISBN: 9780521846707.\n\n*Note: There are many texts that treat various aspects of mechanical behavior. However, these texts tend to treat\neither\nthe mechanics or the materials perspectives well, rather than integrating the two. Your lecture notes provide this integration, and the Course Reader provides sufficient background material and worked examples from the \"best\" textbook for a specific topic. The Hosford text is recommended and heavily cited in the Course Reader, but is missing key material covered in the first third of the class.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nThree quizzes (15% each)\n\n45%\n\nSeven problem sets\n\n25%\n\nFour labs\n\n30%\n\nAcademic Honesty\n\nWe encourage you to work together on problem sets and lab analysis/discussion. However, all work turned in must be your own product, as it stands on the submission due date. What is cheating?\n\nDuplication of others' problem set solutions, figures summarizing lab data, or quiz responses is cheating.\n\nFailure to cite sources of ideas and/or facts in your problem sets and laboratory written assignments is cheating.\n\nFalsifying excuses for late/missing assignments or lab participation is cheating.\n\nBackdating/Alteration of submitted documents and false claims that electronic files have been submitted by the due date are cheating.\n\nA student who cheats will receive a formal letter in his/her file at the Office of Student Discipline and may be reported to the Council on Discipline. You do not need to cheat to succeed in this class!\n\nOverall Understanding\n\nAn \"A\" in 3.032 means that you have shown you can understand and apply the following quote to make a positive difference with your knowledge of material mechanical behavior:\n\n\"Give me matter, and I will construct a world out of it.\"\n\n--Immanuel Kant\n\nas quoted by Bedford and Liechti,\nMechanics of Materials\n(2000).",
  "files": [
    {
      "category": "Resource",
      "title": "ps1_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/21b58e11d871d21c5b75943ac534a0e3_ps1_06.pdf",
      "content": "3.032 Problem Set 1\nFall 2006\nDue: Start of lecture, 9/15/06\n1. Thin-film silicon nitride cantilevers such as the one shown in Figure 1 are used in\nscanning probe microscopy, resonant frequency measurements, and electrostatic ac\ntuation. Let us approximate this cantilever as a clamped-free beam with a length of\n200 μm, a width of 30 μm, and a thickness of 0.8 μm. Take the Young's modulus\nof thin-film silicon nitride\n\nto be 210 GN/m2. The weight of the cantilever can be\nneglected.\nImage by OpenCourseWare. Adapted from work by KristianMolhave, Wikimedia Commons.\nFigure 1: Thin-film silicon nitride cantilever\n(a) If the free end of the beam contacts a surface (represented by a point load in\nFigure 1), and is deflected upwards by 1.0 μm, find the magnitude of the point\nload.\n(b) Draw a free-body diagram of the beam. Sketch the shear and bending moment\nin the beam along its length, labeling maximum and minimum values. Use the\nfollowing sign convention for positive shear and bending moment [Beer and\nJohnson, Mechanics of Materials (1992)]:\n(c) In your scanning probe experiments, you need to be able to\n\nFigure by MIT OpenCourseWare.\nmeasure point loads\nthat are only one-tenth of the value you calculated above. Assuming that a\ndeflection of 1 μm produces a suitable signal for detection, how much longer\ndoes the cantilever need to be?\n2. You are assembling a structure in a heavy wind, which acts as a distributed load q\n(force per length) on one of the wide boards you are erecting (Figure 2). Your friend\nS\nhe\na\nr and bending conventions.\n.\n\n(weight 150 lb) can just barely keep the board upright by hanging from a flexible\ncord connected to the board. The board is connected to the ground by a pin joint, and\nthe mass of the board is 30 kg/m. Ignore the effect of the wind on your friend.\nFigure 2: Upright board subject to a distributed load and a point load.\n(a) Draw a free-body diagram of the board and find the wind load q and the reaction\nforces at the pin joint.\n(b) Sketch the shear and bending moment in the board.\n3. The Harvard Bridge on Mass. Ave. (Figure 3(a,b)) was rebuilt in the late 1980s due\nto the fact that the pin-and-hanger assemblies of the expansion joints on the bridge\nwere the same as those of the Mianus River Bridge in Connecticut. The Mianus River\nBridge collapsed in 1983 when a single pin became overloaded and caused the death\nof three people and serious injury of three others. Your task is to find the normal and\nshear forces and moment associated with that failure, which occurred at the position\nmarked x, the midspan between pins C and D (Figure 3(c)).\n(a) Draw a free body diagram of the entire pin-and-hanger assembly. The weight\nof the assembly can be neglected.\n(b) Determine the reaction forces about joint B.\n(c) Determine the forces along and normal to the horizontal beam, and the moment\nat the point of failure in the steel beam.\n4. Nanowires of amorphous silica (SiO2) (Figure 4) are considered as possible optical\nwaveguides in miniaturized electronics. For handling and assembly purposes, it is\nnecessary to know and be able to measure the critical buckling load Pcr of such\nnanowires.\n\nImage courtesy flickr user afagen.\nFigure 3: (a,b) Harvard Bridge; (c) Pin-and-hanger assembly, adapted from Hibbeler\n(2005).\nFigure 4: Silica nanowire. (a) Amorphous silica fibers act as optical waveguides [Tong et\nal., Nature 426: 816 (2003)]. (b) Critical buckling load can be measured via compression\nwith instruments such as atomic force microscopes.\n(a) For the above nanowire of 400 nm diameter and 1 mm length, determine the\ncritical buckling load. Assume the value of the Young's modulus E for bulk\nsilica, which is 70 GN/m2.\n(b) Using the cantilever in Problem 1, what is the deflection of that cantilever that\nyou would need to achieve to impose this elastic instability?\nFig. 4b in Tong, Limin, et al. \"Subwavelength-Diameter Silica Wires for Low-Loss Optical Guiding.\"\nNature 426 (December 2003): 816-819."
    },
    {
      "category": "Resource",
      "title": "ps1_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/185a0d959c3392537deed96f63d6d470_ps1_07.pdf",
      "content": "3.032 Problem Set 1\nFall 2007\nDue: Start of Lecture, 09.14.07\n1.\nThe I35 bridge in Minneapolis collapsed in Summer 2007. The failure apparently occurred at a pin\nin the gusset plate of the truss supporting the bridge span, at a time when the loads on the bridge\nspan were unequal due to construction crews working on the westbound side. We'll treat a simplified\nsection of this truss (Fig. 1a) to consider whether this unbalanced load could have generated enough\nforce for the truss to fail. We will examine the truss section denoted by the dotted lines, and replace\nthe gusset plate with a pin joint.\nFigure 1a: Bridge truss with gusset plates at pins.\nOn the day of the bridge failure, construction crews occupied the westbound lanes (right side of Fig.\n1b). Let F be the forces acting on the truss members by the regular traffic and 2F be the forces\nacting on the truss by the heavier construction equipment. Taking into account the average mass of a\ncar to be 1362 kg, we can estimate F to be ~13.35 kN.\nF\nF\n2F\n2F\nA\n3.0m\n3.5m\n2.5m\n2.5m\nB\nC\nD\nE\nF\nFigure 1b: Schematic of truss section with pin-loaded joints and supports.\nImage removed due to copyright restrictions.\n\n(a) Determine the reaction forces at supports E and F. Show any free-body diagrams used in your\ncalculations.\n(b) Determine the forces in members AB and AE. Draw all the free-body diagrams you use in your\ncalculations and show whether the forces on the members you calculate are in tension or\ncompression.\n(c) The diagonal members BF and EC are called counters, thin cables that are designed to be loaded\nonly in tension. It is known that the support pins at E and F will fail if any of the counters is under a\ntensile force greater than 10 kN. From the loading on the truss described above, determine the\nforces on each of the members BF and EC and state which, if any, of the pins will fail. Show all the\nfree-body diagrams associated with your calculations.\n2.\nThe MIT varsity diving team is practicing their back flips on the Z-center's diving boards (Fig. 2).\nThe diving boards have a total length of 3 m, width of 0.5 m, and thickness of 0.1 m. The core of the\nboards is made of a Douglas fir wood with an estimated Young's modulus E of 0.6GN/m2. Let us\napproximate the diving board as a clamped-free beam, neglecting the springboard support at the\nmidspan of the diving board and the weight of the diving board.\nImage courtesy flickr user Bret Arnett.\nFigure 2: Z-center diving boards.\n(a) If the average weight of a student standing on the free-end of the board is about 155 lbs, how much\nwill the board deflect? Note that, in the US, \"weight\" is commonly stated in units of mass [pounds,\nor lbs] instead of force, and state your solution in SI MKS units.\n(b) Draw a free-body diagram of the diving board, again neglecting the spring board near the midspan\nfor simplicity, and determine all reaction forces and moments for the \"typical diver\" in (a).\n3. Bundles of protein filaments inside tissue cells are structural elements that can generate contractile\nforce against the materials to which they adhere. Figure 3 shows struts called \"stress fibers\" that extend\nfrom one end of the cell to the other. These fibers are made of crosslinked, filamentous actin, with an\naverage diameter of 2 μm and an effective \"stiffness\" E of 16 kN/m2.\n\nIf we assume the connections at either end of the stress fiber can be modeled as pins, how much force P\nwould the cell need to generate to buckle the longest of these stress fibers?\n50 μm\nP\nstress fiber pinned to substrate at\neither end\nFigure 3: Structural elements of cells under axial end-loads.\n4.\nA U.S. based company was in charge of designing MIT's new physics lab, near the new DMSE\nheadquarters in Bldg 6. They used 30-ft long, wide-flanged structural steel beams for the floor joists to\ncarry the distributed weight of the rooms above. The actual weight distribution is shown in Fig. 4, which\nis different from what they anticipated, so they want to know where to add an extra support to minimize\nthe shear force and bending moment on this beam. This week, you'll get started on that calculation.\nw0 = 3,500 lb/ft\nq = 2,500 lb/ft\nA\nB\n18ft\n4ft\n8ft\nFigure 4: Floor joist beam of new MIT physics building.\n(a) Being a US-based engineer, the first step to analyzing the beam is to convert all units from the US\narchitects to SI MKS units. Perform these conversions.\n(b) Draw a free-body diagram of the beam and calculate the reaction forces at A and B.\nImages removed due to copyright restrictions. Please see:\n:\n__________________________________________________________________\nhttp://www.biology.arizona.edu/Cell_bio/tutorials/cytoskeleton/graphics/microfilament.gif."
    },
    {
      "category": "Resource",
      "title": "sol1_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/ae3f9fd91c2389f8b017c5f43f2f0eda_sol1_06.pdf",
      "content": "3.032 Problem Set 1 solutions\nFall 2006\nDue: Start of lecture, 9/15/06\n1. Thin-film silicon nitride cantilevers such as the one shown in Figure 1 are used in\nscanning probe microscopy, resonant frequency measurements, and electrostatic ac\ntuation. Let us approximate this cantilever as a clamped-free beam with a length of\n200 μm, a width of 30 μm, and a thickness of 0.8 μm. Take the Young's modulus\nof thin-film silicon nitride to be 210 GN/m2. The weight of the cantilever can be\nneglected.\nFigure 1: Thin-film silicon nitride cantilever\n(a) If the free end of the beam contacts a surface (represented by a point load in\nFigure 1), and is deflected upwards by 1.0 μm, find the magnitude of the point\nload.\nSolution: The deflection of a clamped-free beam under a point load P at the\nend of the beam is\nPL3\nδ = 3EI\nI = 1 wh3 = 1.28 × 10-24 m4\n3EIδ\nP = L3\n= 0.101 μN\n(b) Draw a free-body diagram of the beam. Sketch the shear and bending moment\nin the beam along its length, labeling maximum and minimum values. Use the\nfollowing sign convention for positive shear and bending moment [Beer and\nJohnson, Mechanics of Materials (1992)]:\nImage by Open Course Wares. Adapted from work by KristianMolhave, Wikimedia Commons.\n\n.\n\nSolution:\n(c) In your scanning probe experiments, you need to be able to measure point loads\nthat are only one-tenth of the value you calculated above. Assuming that a\ndeflection of 1 μm produces a suitable signal for detection, how much longer\ndoes the cantilever need to be?\nSolution: The point load required to create a given deflection scales with L-3 ,\nso the new length needs to be larger by a factor of\n√\n10. The new length should\nbe at least 431 μm.\n2. You are assembling a structure in a heavy wind, which acts as a distributed load q\n(force per length) on one of the wide boards you are erecting (Figure 2). Your friend\n(weight 150 lb) can just barely keep the board upright by hanging from a flexible\ncord connected to the board. The board is connected to the ground by a pin joint, and\nthe mass of the board is 30 kg/m. Ignore the effect of the wind on your friend.\n(a) Draw a free-body diagram of the board and find the wind load q and the reaction\nforces at the pin joint.\nS\nhe\na\nr and bending conventions.\n\nFigure by MIT OpenCourseWare.\n\nFigure 2: Upright board subject to a distributed load and a point load.\n(b) Sketch the shear and bending moment in the board.\nSolution: The wind load q is found by summing the moments around the pin:\nT(3 m) cos 30*- q(4 m)2 = 0\nT = (150 lb)(4.45 N/lb) = 667 N\nq = 217 N m-1\nThe reaction forces are calculated as follows:\nRY = T sin 30* + W = 1511 N\nRX = T cos 30*- q(4 m) = -289 N\n\n3. The Harvard Bridge on Mass. Ave. (Figure 3(a,b)) was rebuilt in the late 1980s due\nto the fact that the pin-and-hanger assemblies of the expansion joints on the bridge\nwere the same as those of the Mianus River Bridge in Connecticut. The Mianus River\nBridge collapsed in 1983 when a single pin became overloaded and caused the death\nof three people and serious injury of three others. Your task is to find the normal and\nshear forces and moment associated with that failure, which occurred at the position\nmarked x, the midspan between pins C and D (Figure 3(c)).\nFigure 3: (a,b) Harvard Bridge; (c) Pin-and-hanger\n\nassembly, adapted from Hibbeler\n(2005).\n(a) Draw a free body diagram of the entire pin-and-hanger assembly. The weight\nof the assembly can be neglected.\nSolution: The FBD is shown below. Note that the reaction moments are zero at\npins A and E, as a pin cannot sustain a moment.\n(b) Determine the reaction forces about joint B.\nImage courtesy flickr user afagen.\n\n!\n!\n!\n!\n\n!\n\n!\nSolution: Members AB, BC, and BD are connected by pins and loaded at their\nends only, so they can sustain only axial loads (this can be confirmed by FBD).\nFrom this consideration it is found that Ay = 0. Setting the sum of forces in the\ny direction in the complete FBD equal to zero:\nΣFy = 0 → Ey - 1500 N - 300 N(6 m)(2) → Ey = 2400 N\nSetting the sum of moments around point E equal to zero:\nZ 6\n\nx\nΣM = 0 → (1500 N)(6 m) +\n(300 N) 6 m\ndx - Ax(3 m) = 0\nh\ni6\n15000 + 100x2\n0 - 3Ax = 0\nAx =\n= 6200 N\nAn FBD of pin B is also useful (note that the angle belongs to a 3-4-5 right\ntriangle):\nSetting the sum of the forces in the x direction at pin B to zero:\nΣFx = 0 →-FBC 5 + FBA = 0\nFBC =\nFBA =\nAx = 7750 N\nso member BC is under tension.\nSetting the sum of the forces in the y direction to zero:\nΣFy = 0 →-FBC 5 - FBD = 0\nFBD = -5 FBC = -4 FBA = -4650 N\nso member BD in under compression.\nThe complete loading on the bottom beam is shown here:\n\n(c) Determine the forces along and normal to the horizontal beam, and the moment\nat the point of failure in the steel beam.\nSolution: Midway between pins C and D, we can apply the method of sections\nto the segment CX.\nDemanding equilibrium,\nΣFx = 0 → Nx = -7.75 kN · (4/5) = -6.2 kN\nΣFy = 0 → Vx = 1.5 kN - 7.75 kN · (3/5) = 3.15 kN\nΣMx = 0 → Mx = (3/5)(7.75 kN)(2 m) - (1.5 kN)(2 m) = 6.3 kN-m\n4. Nanowires of amorphous silica (SiO2) (Figure 4) are considered as possible optical\nwaveguides in miniaturized electronics. For handling and assembly purposes, it is\nnecessary to know and be able to measure the critical buckling load Pcr of such\nnanowires.\n(a) For the above nanowire of 400 nm diameter and 1 mm length, determine the\ncritical buckling load. Assume the value of the Young's modulus E for bulk\nsilica, which is 70 GN/m2.\n\nFigure 4: Silica nanowire. (a) Amorphous silica fibers act as optical waveguides [Tong et\nal., Nature 426: 816 (2003)]. (b) Critical buckling load can be measured via compression\nwith instruments such as atomic force microscopes.\nSolution: Assume that the bottom end of the wire in Figure 4(b) is fixed and the\ntop end is free to move laterally. The critical load Pcr is then\nPcr = π2EI/(2L)2 = π2E(πr4/4) = 2.17 × 10-10 N = 217 pN\n(1)\n(2L)2\nOther solutions are also acceptable if the end constraints are clearly stated. If\nthe top end of the wire is assumed to be pinned, for example, the effective length\nwill be 0.7L rather than 2L and the calculated critical load will be larger by a\nfactor of approximately 8.2.\n(b) Using the cantilever in Problem 1, what is the deflection of that cantilever that\nyou would need to achieve to impose this elastic instability?\nSolution: From that problem, the effective spring constant that defines the re\nlationship between force P and deflection δ = 3EI/L3, using the E, I, and L of\nthe silicon nitride cantilever. This value k = 0.101 N/m, so the cantilever would\nneed to deflect an amount\nPcr\n2.17 × 10-10 N\nδ = k =\n0.101 N/m\n= 2.15 × 10-9 m = 2.15 nm\nFig. 4b in Tong, Limin, et al. \"Subwavelength-Diameter Silica Wires for Low-Loss Optical Guiding.\n\" Nature 426 (December 2003): 816-819."
    },
    {
      "category": "Resource",
      "title": "sol1_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/baf8d960d75aa83c855d2f3d66b21ce7_sol1_07.pdf",
      "content": "3.032 Problem Set 1\nFall 2007\nDue: Start of Lecture, 09.14.07\n1.\nThe I35 bridge in Minneapolis collapsed in Summer 2007. The failure apparently occurred at a pin\nin the gusset plate of the truss supporting the bridge span, at a time when the loads on the bridge\nspan were unequal due to construction crews working on the westbound side. We'll treat a simplified\nsection of this truss (Fig. 1a) to consider whether this unbalanced load could have generated enough\nforce for the truss to fail. We will examine the truss section denoted by the dotted lines, and replace\nthe gusset plate with a pin joint.\nFigure 1a: Bridge truss with gusset plates at pins.\nOn the day of the bridge failure, construction crews occupied the westbound lanes (right side of Fig.\n1b). Let F be the forces acting on the truss members by the regular traffic and 2F be the forces\nacting on the truss by the heavier construction equipment. Taking into account the average mass of a\ncar to be 1362 kg, we can estimate F to be ~13.35 kN.\nF\nF\n2F\n2F\nA\n3.0m\n3.5m\n2.5m\n2.5m\nB\nC\nD\nE\nF\nFigure 1b: Schematic of truss section with pin-loaded joints and supports.\nImage removed due to copyright restrictions.\n\n(a) Determine the reaction forces at supports E and F. Show any free-body diagrams used in your\ncalculations.\nSolution: Here is the free-body diagram of the entire truss\ny\nx\n13.35kN\n13.35kN\n26.70kN\n26.70kN\n3.0m\n3.5m\n2.5m\n2.5m\nA\nB\nC\nD\nE\nF\nFEx\nFEy\nFFy\nFirst, we can take the sum of the forces in the x- and y- directions\n∑ Fx = 0 : FEx = 0\n∑ Fy = 0 : FEy + FFy - 2(13.35) - 2(26.70) = 0\nFEy + FFy = 80.1kN\nTo eliminate one of the unknown variables in the above equation, we can take the sum of the\nmoments about joint E\n∑ M E = 0 :13.35(2.5) - 26.70(3.5) - 26.70(6.0) + FFy (3.5) = 0\nFFy = 63.0kN\nFEy = 80.1kN - 63.0kN = 17.1kN\nM+\n(b) Determine the forces in members AB and AE. Draw all the free-body diagrams you use in your\ncalculations and show whether the forces on the members you calculate are in tension or\ncompression.\n\nSolution: First, using the method of joints, we will construct a force triangle about Joint A\nto determine the unknown forces in members AB and AE. We arbitrarily assume that both\nunknown forces are acting away from the joint (i.e. the members are in tension).\n13.35kN\nA\nFAE\nθ\n3.0m\nFAB\n2.5m\nThe angle, ∠θ , can be determined from the truss dimensions as follows\n2.5\ntan( ) =\nθ\n3.0\nθ = 39.8°\nTaking the sum of the forces in the y-directions we get\nD\n∑Fy = 0 : -13.35 -FAE\n\ncos(39.8 ) = 0\nFAE = -17.38kN\n\n=17.38 kN\n\nC\n\n( )\nNote: Since we obtained a negative sign for FAE, we know that our original assumption\nabout the direction of force FAE was incorrect. Therefore, it must point towards joint A (i.e.,\nmember AE is in compression).\nThen, taking the sum of the forces in the x-directions we get\nD\n∑Fx = 0 : FAB\n\n-17.38sin(39.8 ) = 0\nFAB =11.13 kN\n\nT\n\n( )\n(c) The diagonal members BF and EC are called counters, thin cables that are designed to be loaded\nonly in tension. It is known that the support pins at E and F will fail if any of the counters is under a\ntensile force greater than 10 kN. From the loading on the truss described above, determine the\nforces on each of the members BF and EC and state which, if any, of the pins will fail. Show all the\nfree-body diagrams associated with your calculations.\n\nSolution: This problem takes a little bit of intuition in order to solve. If we use the method\nof sections and take a look at the portion ABE (cut is vertically through the middle of the\ntruss) we get the following\n13.35kN\n13.35kN\n2.5m\nA\nB\nE\n0kN\nFBC\nFBF\nFEC\nFEF\n∠φ\n∠φ\n17.1kN\nLet us examine the known vertical forces acting on this portion. The total downward force\nis equal to 26.70kN (13.35x2), which is greater than the one upward force, 17.1kN, being\nexerted by the pin at E. Therefore, in order for this portion of the truss to be in equilibrium,\nthere must be another upward force to balance out the forces in the y-direction. Looking at\nthe four unknown forces (FBC, FBF, FEC, and FEF) we can see that only the force FEC can\nprovide the upward force necessary for equilibrium and that it must be in tension. Thus,\nmember BF is slack (i.e., does not provide any forces necessary to obtain equilibrium), and\nso FBF = 0.\nUsing the above reasoning, we can now eliminate the force FBF from our analysis of portion\nABE. To obtain the force in the other counter member, EC, we simply take the sum of the\nforces in the y-direction using the free-body diagram shown above.\ntan( ) =\nφ\n3.5\nφ = 40.6D\nD\n∑ Fy = 0 :17.1 -13.35 -13.35 + FEC\n\nsin(40.6 ) = 0\nFEC = 14.75 kN T\n( )\nTherefore, the pin at E will fail because FEC = 14.75kN>10kN. The pin at F will not fail as\nthere are no forces acting on member BF.\n\n2.\nThe MIT varsity diving team is practicing their back flips on the Z-center's diving boards (Fig. 2).\nThe diving boards have a total length of 3 m, width of 0.5 m, and thickness of 0.1 m. The core of the\nboards is made of a Douglas fir wood with an estimated Young's modulus E of 0.6GN/m2. Let us\napproximate the diving board as a clamped-free beam, neglecting the springboard support at the\nmidspan of the diving board and the weight of the diving board.\nFigure 2: Z-center diving boards.\n(a) If the average weight of a student standing on the free-end of the board is about 155 lbs, how much\nwill the board deflect? Note that, in the US, \"weight\" is commonly stated in units of mass [pounds,\nor lbs] instead of force, and state your solution in SI MKS units.\nSolution: The deflection of a clamped-free beam under a point load at the end of the beam\nis\nPL3\nδ = 3EI\n-5\nI =\nwh = 4.17 ×10 m\nP\nmg\n\n= (155 lbs\n\n/ 2.2 lbs )*9.81 m / s2 = 691N\n=\nkg\nδ =\n∗ (3.0) 3\n-5 = 0.25 m\n3 (0.6\n×10 ) (4.17 10\n∗\n×\n)\n∗\n(b) Draw a free-body diagram of the diving board, again neglecting the spring board near the midspan\nfor simplicity, and determine all reaction forces and moments for the \"typical diver\" in (a).\nImage courtesy flickr user Bret Arnett.\n\nSolution:\ny\nx\nP\nRm\nA\nB\nRy\nTo solve for Ry we simply take the sum of the forces in the y-direction and set them equal to\nzero according to equilibrium conditions\n∑ Fy = 0 : Ry - 691 = 0\nRy = 691N\n\n(upward direction)\nTo solve for Rm, we now take the moment about point A. Note that we arbitrarily assumed\nRm to be positive (counter-clockwise in our convention) in our free-body diagram\n∑M A = 0: Rm - (691)(3) = 0\nM+\nRm = 2,073 N-m\n3. Bundles of protein filaments inside tissue cells are structural elements that can generate contractile\nforce against the materials to which they adhere. Figure 3 shows struts called \"stress fibers\" that extend\nfrom one end of the cell to the other. These fibers are made of crosslinked, filamentous actin, with an\naverage diameter of 2 μm and an effective \"stiffness\" E of 16 kN/m2.\nIf we assume the connections at either end of the stress fiber can be modeled as pins, how much force P\nwould the cell need to generate to buckle the longest of these stress fibers?\n\n50 μm\nP\nstress fiber pinned to substrate at\neither end\nFigure 3: Structural elements of cells under axial end-loads.\nSolution:\nHere, the force is generated BY the motor proteins on the fiber, rather than an external force, but we'll\ntreat this as an end-loaded beam. The stress fiber is much longer than it is wide, so we will assume the\nfirst mode of buckling (n=1) and Euler's solution of critical buckling load:\nP = π2EI/Le\nEffective length Le = L for these supports (50 μm), and I = πr4/4 = π(1 μm)4/4 = 7.8 x 10-25 m4.\nP = [π2*16 x 103 N/m4 * 7.8 x 10-25 m4] / (50 x 10-6 m)2 = 4.9 x 10-11 N = 50 pN.\nThis is a very small force, on the same order as that required to pull two bound molecules apart! Thus,\nbuckling is plausible if the cell's motor proteins that generate the contractile force can exert at least 50\npN.\n4.\nA U.S. based company was in charge of designing MIT's new physics lab, near the new DMSE\nheadquarters in Bldg 6. They used 30-ft long, wide-flanged structural steel beams for the floor joists to\ncarry the distributed weight of the rooms above. The actual weight distribution is shown in Fig. 4, which\nis different from what they anticipated, so they want to know where to add an extra support to minimize\nthe shear force and bending moment on this beam. This week, you'll get started on that calculation.\nImages removed due to copyright restrictions. Please see\nhttp://www.biology.arizona.edu/Cell_bio/tutorials/cytoskeleton/graphics/microfilament.gif\n______________________________________________________________________\n\nw0 = 3,500 lb/ft\nq = 2,500 lb/ft\nA\nB\n18ft\n4ft\n8ft\nFigure 4: Floor joist beam of new MIT physics building.\n(a) Being a US-based engineer, the first step to analyzing the beam is to convert all units from the US\narchitects to SI MKS units. Perform these conversions.\nSolution: Use the following conversion factors\n1lbf = 4.45N\n1 ft = .3048m\nLengths:\n18 ft = 5.49m\n4 ft = 1.22m\n8 ft = 2.44m\nDistributed Loads:\nlbf\nN\nft\nkN\nq = 2,500\n∗ 4.45\n∗\n= 36.5\nft\nlbf\n.3048 m\nm\nlbf\nN\nft\nkN\nω0 = 3,500\n∗ 4.45\n∗\n= 51.1\nft\nlbf\n\n.3048 m\nm\n(b) Draw a free-body diagram of the beam and calculate the reaction forces at A and B.\nSolution: In order to do this problem we need first determine the equivalent concentrated\nload for the triangular-shaped distributed load, ω.\nThe area under this loading (in kN) is given by the equation for the area of a triangle,\nA=1/2bh\nA = (51.1)(2.44) = 62.3kN\n\nThe coordinates for the center of gravity for a triangle is given by\nh\nx = 3\nTaking the location of support A as x=0\n2.44\nx = 9.15 - (\n) = 8.34 m\nTherefore, the equivalent concentrated load is W=62.3kN and it line of action is located at\na distance X = 8.34m to the right of A\nThe equivalent concentrated load for the rectangular (uniform) distributed load is simply\nthe area under the rectangle and its line of action is in the center of the rectangle\nA = (36.5)(5.49) = 200.4kN\n5.49\nX =\n= 2.75m\nTherefore, the equivalent concentrated load is Q=200.4kN and its line of action is located at\na distance X = 2.75m to the right of A\nUsing the determined resultant forces, the free-body diagram can now be drawn as follows\ny\nx\nQ = 200.4kN\nW = 62.3kN\nFAx\n2.75m\nFAy\nFBy\n8.34m\n9.15m\nThe reaction forces are calculated as follows:\n\nFirst, we sum up the forces acting on the beam in the x and y directions\n∑ Fx = 0 : FAx\n\n= 0\n∑ Fy = 0 : FAy\n\n- 200.4 - 62.3 + FBy\n\n= 0\nFAy + FBy = 262.7kN\n\nIn order to eliminate one of the unknown variables, we then take the sum of the moments\nabout support A\n∑M A = 0 : FA (0) - (200.4)(2.75) - 62.3(8.34) + FBy\n\n(9.15) = 0\nSolving for FBy we get\nFBy = 117.0kN\nFinally, we can solve for FAy\nFAy = 262.7 -117.0 = 145.7kN\nM+"
    },
    {
      "category": "Resource",
      "title": "ps2_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/ce3d8ed7de272f77187ff3cb9a1037e7_ps2_06.pdf",
      "content": "3.032 Problem Set 2\nFall 2006\nDue: Start of lecture, 9/22/06\n1. You make a questionable back-to-school purchase: a new pair of platform-sole sneak\ners that may make you look a bit taller. Much to your dismay, your \"friend\" tells you\nthat when you put them on she can see that the green soles are compressed to about\nhalf their original height (i.e., half of the thickness shown in Figure 1(a)). Looking\nfrom the top, you can see that your soles were flush with the shoe upper before you\nput them on. However, under your weight, the soles stick out about 1 cm on each\nside.\nFigure 1: (a) Sneaker before wearing, top view; (b) Your view of your sneakers while\nwearing.\n(a) What is the Poisson's ratio of the material from which your sneaker soles are\nmade?\n(b) Based on this back-of-the-envelope calculation, what can you tell your friend\nabout the likely composition and structure of that material?\n2. You are hanging from a rope that is of 4 cm diameter and originally of 6 m length.\nThe rope is stationary and clamped tightly at the other end. Treat the rope as a square\nspring (i.e., Cartesian coordinates are OK) of effective spring constant k = 100 N/m\nand with a Poisson's ratio of zero.\n(a) At the clamped end, at the point halfway down the rope length, and at the end\nfrom which you're hanging, define all the components of the displacement vec\ntor u = (ui, uj, uk).\n(b) Compute all the components of the small-strain, small-rotation strain tensor ij\nat the end from which you are hanging.\nShoes.\nFigure by MIT OpenCourseWare.\n\n________________________________\n(c) Compute the normal stress σii at the same three points of the rope considered\nin (a).\n(d) What do you notice about the variation in u and in σii as a function of distance\nfrom the clamped end?\n3. Concrete, sometimes called \"the ultimate material,\" has enabled impressive achieve\nments in construction for thousands of years.\nConcrete is also simple to make,\nconsisting-in its simplest form-of only lime (calcium oxide), sand, gravel, and wa\nter. An unfortunate limitation of concrete, however, is that it is far, far weaker in\ntension than in compression. In this problem, you will develop a way around this\nlimitation. The technique you will use, known as pretensioning, is commonly used\nto create long spans such as those pictured in Figure 3.\nImage removed due to copyright restrictions. Please see:\nhttp://www.cement.org/bridges/truckee.htm\nFigure 2: The Truckee River Bridge in Truckee, California--a 2002 Concrete Bridge\nAward Winner (Portland Cement Association, www.cement.org).\n(a) Let us model a concrete span as a pin-and-roller-anchored beam with a length\nL = 6 m, a thickness h = 0.8 m, and width w (Figure 3(a)). The span is loaded\nwith a distributed load q (force per area) of 50 kN/m2. Determine the values\nand locations of the maximum tensile and compressive stresses in the beam. (It\nmay be useful to construct shear and bending moment diagrams).\n(b) You have decided that it is best to allow no part of the concrete span to be in\na state of tensile stress. To accomplish this goal, you will position steel bars\nalong the length of the span before pouring the concrete. You will then stretch\nthe bars, pour the concrete and allow it to harden, and release the tension (Figure\n3(b)). The released steel bars will exert an axial compressive stress on the span\nthat is superposed with the bending stresses. Determine the force per meter\nof span width to cancel the maximum tensile stress you calculated previously.\nAssume that the load created by the steel bars is distributed evenly across the\ncross section of the span and that the addition of the bars does not significantly\nchange the cross section.\n\nFigure 3: (a) Concrete span under distributed load q; (b) The same span with integrated\nsteel rods to provide pretensioning.\n(c) You are told that the steel you are using has a failure strength σF = 400 MPa\nand the bars have a diameter of one inch. You wish to avoid failure in the bars\nwith a factor of safety of two. What is the maximum load you can allow in\neach bar? How many bars are needed per meter of span width to provide the\nnecessary compressive load that you calculated previously?\n4. A spiral fracture can occur when long bones such as the femur are exposed to an\nexcessive torsional load (Figure 4(a,b)). The diaphysis (middle portion) of the fe\nmur consists of an outer circle of dense cortical bone surrounding a center of much\nweaker trabecular (meshlike) bone. Biomedical engineers have modeled the stronger\ncortical bone portion as an annulus, as shown in Figure 4(c). Let us assume that this\nannulus has an outer diameter of 26 mm and an inner diameter of 20 mm, and that the\ndiaphysis has a length of 30 cm. The shear modulus of cortical bone is approximately\n17 GPa.\n(a) The maximum shear stress occurs at the surface of the bone. If a shear stress\nτF = 60 MPa will cause failure in cortical bone, find the maximum torsional\n\nFigure 4: (a) Fracture pattern of femur after excessive torsional loading\n\n[Vashishith et al.,\nJ Orthopaed Res 19:414 (2001)]; (b) X-ray of femoral spiral fracture [Ligier et al. J Bone\nJoint Surg 70B:74 (1988)]; (c) Loading configuration and annular model of cortical bone\nshowing outer and inner diameters.\nload that this femur can withstand. What is this load in Newtons, assuming a\nlever arm of 2 m?\n(b) If the dimensions of the cross section (outer and inner diameters) are reduced\nby 50%, by what percentage is the maximum torsional load reduced?\n(c) What is the angle of twist at failure for the original cross section?\nCourtesy of Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\nImage removed due to copyright restrictions. Please see:\nFig. 4 in Ligier, J. N., et al. \"Elastic Stable Intramedullary\nNailing of Femoral Shaft Fractures in Children.\" Journal\nof Bone and Joint Surgery 70B (1988): 74-77."
    },
    {
      "category": "Resource",
      "title": "ps2_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/cc5b4e1b4a4c7e0376f8f2ae9a22c559_ps2_07.pdf",
      "content": "3.032 Problem Set 2 Solutions\nFall 2007\nDue: Start of Lecture, 09.21.07\n\n1. In the beam considered in PS1, a steel beams carried the distributed weight of the rooms\nabove. To reduce stress on the beam, it is common to add extra support to these long beams at\nthe point of internal maximum bending moment. Where should this support be located, and what\nare the shear forces and bending moments at this location?\n\nTo answer this, construct the shear force V(x) and internal bending moment M(x) diagrams\nalong the entire beam length, and note the magnitude of each at every point in the beam where\nthe loading situation changes, as well as at the point of maximum M.\nq = 2,500lb/ft\nA\nB\n18ft\n4ft\n8ft\nω0 = 3,500lb/ft\nFigure 1. Floor joist beam of new MIT physics building.\n\n2. At a seminar at MIT last week, Prof. Ilya Zharov (Univ. of Utah, Department of Chemistry)\nshowed that his group could create self-assembled colloidal films, which are basically a few\nplanes of close-packed silica (SiO2) spheres with nanoscale pores between them (Fig. 2A). He\nproposed these as a potential new material for fuel cell proton-exchange membranes (PEMs),\nbecause he can coat the nanoscale pores between the silica spheres with sulfonated molecules\nthat selectively allow proton exchange through the nanopores.\nFigure 2. SEM images of the chemically-modified colloidal film prepared from 440\nnm diameter silica spheres (A) top view;the geometric projection of a pore observed\nfrom the (111) plane is outlined in the inset. (B) Side view. (C) A scheme of its\npermselective behavior. Langmuir (2007, in revision).\n\n(a) We will first test the force required to break these films, using two different loading\nconfigurations: three-point bending and uniaxial tension (Fig. 2b). In both tests, we use\nidentical samples which are 100 μm in length and have rectangular cross-sections of 20 μm\nwidth and 2 μm thickness. Draw the expected tensile stress along the beam length σ(x) in\neach case. Assume all stresses remain within the elastic regime. (It may be useful to\nconstruct shear and bending moment diagrams.)\nFigure 3. Experimental and schematic loading conditions for\n(A) Three-point bending; and (B) uniaxial tension.\n\nThis sounds exciting, but someone quickly pointed out this is basically\na very thin, porous sheet of glass: as a free-standing film, it might fail\nmechanically under its own weight or under the loads due to proton\nflux. Prof. Zharov said he had no idea how strong these colloidal films\nwere, but thought engineers would figure it out for him. He thought\nthat laying strips of the films onto a metal grid (like a window screen)\nwould keep the stresses low enough by supporting the film at several\npoints along its length.\n\nLet us see if he is correct in this guess, treating a strip of the film as a\nbeam and assuming it deforms elastically up to the point of fracture.\n\nImages removed due to copyright restrictions.\nPlease see: Fig. 1 in\nhttp://www.chem.utah.edu/directory/faculty/zharov.html\n_____________________________________________\n\nP\nB\nP\nP/2\nL/2\nL\nP\nL\nP/2\nA\n\n(b) We measure that these test samples catastrophically fail (i.e., transition from elastic\ndeformation to fracture, without any prior plastic deformation or yielding) at an average\nload of 75.0 μN for the 3-pt. bend tests and at a load of 3.4 mN for the tensile tests.\nDetermine the stress at which the colloidal films failed in both cases; this is called the\nflexural strength and tensile strength, respectively.\n\n(c) In this case, the colloidal film is brittle: when the film fails, it fails at the nanopore defects as\nthe spheres break free from one another. The mechanical strength of brittle materials\ndepends strongly on the existence and density of defects in highly stressed regions of the\nmaterial. Considering the stress distributions determined in (a), explain any differences in\nthe flexural and tensile strength properties of the colloidal films calculated in (b).\n\n(d) For this new proton-exchange membrane application, Zharov wants to \"simply support\"\nthese beams of colloidal film by laying them on a copper transmission electron microscopy\n(TEM) grid. the standard grid holes are 3 mm x 3 mm. He estimates the distributed load on\nthe colloidal film due to proton flux to be 10 mN/mm. Considering this new loading\ncondition and the flexural/tensile strengths we determined experimentally, will the colloidal\nfilm fail under this application? If so, how would you redesign the film and/or support to\nenable this fuel cell application?\n\n3. Solid polymer pressure-sensitive adhesives (PSA) are used for electronic component-to-heat\nsink attach to minimize interfacial thermal resistance, typically comprising polyacrylates filled\nwith conductive ceramic particles These thermally conductive adhesives are applied between the\ninterfaces of the electronic component and the heat sink (Fig. 4). The polymer becomes highly\nadhesive under elastic deformation, due to application of this uniform pressure between the\nelectronic component and heat sink.\n\nLet us treat this PSA tape as an\nelastic continuum of Poisson's\nratio ν = 0.45. A press applies\n1000 N to the electronic package to\ncompress the adhesive tape (Figure\n5). The initial gap distance\nbetween the package and the heat\nsink is 0.35 mm.\n\nFigure 4: Illustration of PSA\napplication to component-heat\nsink attachment.\nImages removed due to copyright restrictions. Please see:\nFig. 1 in Eveloy, Valerie, et al. \"Reliability of Pressure-Sensitive Adhesive Tapes for\nHeat Sink Attachment in Air-Cooled Electronic Assemblies.\" IEEE Transactions on\nDevice and Materials Reliability 4 (December 2004): 650-657.\n\n(a) If the electronic package is 100 mm wide x 20 mm deep (into page), what is the applied\n\nstress?\n\n(b) Derive the relationship between true strain and engineering strain: εt = ln (εe+1). Is there\na significant difference in these strain values for the normal strain resulting from\ncompression of the PSA from a thickness of 0.35 mm to 0.15 mm?\n\n(c) To fit this PSA-joined device into the larger circuit, a final joint thickness of 0.15 mm is\nrequired (Figure 5). To ensure a reliable joint, the polymeric adhesive must deform laterally\nunder the applied pressure to completely fill the joint (a change in length equal to 2x in Fig.\n5). Given these two requirements, what is the minimum initial length of PSA tape that we\nneed to ensure complete interfacial contact between the adhesive and electronic package\nafter pressing? Use engineering strain calculations and idealize the PSA tape as an elastic\ncontinuum.\n\n4. Strain gages are designed only to measure normal (tensile or compressive) strains, but the\nengineering state of strain of the material plane is defined by εxx, εyy and γxy. Strain gage rosettes\nas you used in Lab 1 are one solution to this problem, because γxy can be calculated from\nexperimentally measured εxx, εyy and ε(45o). Considering the axes transformation equations of\nstrain, determine this relation.\nHEAT SINK\nadhesive\nelectronic Package\n0.35mm\n0.15mm\nx\nx\nsolid support\nz\nx\n100mm\n1000 N\nFigure 5: Schematic of\ncomponent-to-heat sink\njoining procedure using\npressure-sensitive\nadhesive tape."
    },
    {
      "category": "Resource",
      "title": "sol2_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/0d7def5b28334ac0f27c8fa7e8568470_sol2_06.pdf",
      "content": "3.032 Problem Set 2\nFall 2006\nDue: Start of lecture, 9/22/06\n1. You make a questionable back-to-school purchase: a new pair of platform-sole sneak\ners that may make you look a bit taller. Much to your dismay, your \"friend\" tells you\nthat when you put them on she can see that the green soles are compressed to about\nhalf their original height (i.e., half of the thickness shown in Figure 1(a)). Looking\nfrom the top, you can see that your soles were flush with the shoe upper before you\nput them on. However, under your weight, the soles stick out about 1 cm on each\nside. Shoes.\nFigure 1: (a) Sneaker before wearing, top view; (b) Your view of your sneakers while\nwearing.\n(a) What is the Poisson's ratio of the material from which your sneaker soles are\nmade?\nSolution: To determine ν, we need the lateral strain lat and normal strain norm .\nThe normal strain is given as norm = -0.5 (your sole compressed by half or\n50% of its original height). The lateral strain must be calculated as:\nlat = Δw/wo\nwhere wo is the original width of your shoe. My shoe is 10 cm wide at the\ntoebox, so I'll assume this as wo. We are told your sole jutted out 1 cm on either\nside, so Δw = 2 cm and\n2 cm\nlat =\n= 0.2.\n10 cm\nThen\nlat\n0.2\nν = -norm\n= --0.5 = 0.4\nShoes.\nFigure by MIT OpenCourseWare.\n\n(b) Based on this back-of-the-envelope calculation, what can you tell your friend\nabout the likely composition and structure of that material?\nSolution: Since metals and ceramics have ν ≈ 0.3 and polymers have ν ≈ 0.4-\n0.49, this is likely a sole made from a (green) polymer. In reality, sneaker soles\nwere originally made of rubber, and in fact the term \"sneaker\" as synonym for\nathletic shoes is an American invention. It was supposedly coined by the US\nRubber Company who made the first pair of Keds--the rubber sole made the\nwearer hard to hear when approaching on foot∗. Although gum rubber sneakers\nstill exist (think Chuck Taylor All-Stars), synthetic elastomers and polyurethane\nfoams are now more common.\n(∗http://en.wikipedia.org /wiki/Sneaker (footwear))\n2. You are hanging from a rope that is of 4 cm diameter and originally of 6 m length.\nThe rope is stationary and clamped tightly at the other end. Treat the rope as a square\nspring (i.e., Cartesian coordinates are OK) of effective spring constant k = 100 N/m.\n(a) At the clamped end, at the point halfway down the rope length, and at the end\nfrom which you're hanging, define all the components of the displacement vec\ntor u = (ui, uj, uk).\nSolution: Let's assume you weigh 600 N, and that the clamped site is labeled\nA, the midpoint is labeled B, and the end on which you're hanging is labeled C.\nSince the rope has a stiffness k of 100 N/m, it will displace downward 0.01 m for\nevery Newton of axial force applied. This means that the rope length will in\ncrease by (600 N)(0.01 m/N) = 6 m, for a final length of 6 + 6 = 12 m. However,\nthe displacement is NOT uniform along the length of the rope, as shown in the\nfigure below:\n\n!\nThinking this through, |uA| = 0 m, |uB| = 3 m, and |uC| = 6 m. This means that\nux = u1 = (P/k)(x/L), where x is the distance from the clamped end and L is\nthe initial rope length of 6 m. More generally, u = (P/k)(x/L)ˆi + 0ˆj + 0kˆ.\n(b) Compute all the components of the small-strain, small-rotation strain tensor ij\nat the end from which you are hanging.\nSolution: By definition, ij is based on the partial derivatives of u:\n⎡⎢\n⎤⎥\n∂u1\n1( ∂u1 + ∂u2)\n1( ∂u1 + ∂u3)\n∂x1\n∂x2\n∂x1\n∂x3\n∂x1\n1 ∂ui\n∂u j\n1( ∂u2 + ∂u1)\n∂u2\n1( ∂u3 + ∂u1)\n∂x1\n∂xs\n∂x2\n∂x1\n∂x3\ni j =\n+\n=\n.\n2 ∂xj\n∂xi\n⎣\n⎦\n1( ∂u3 + ∂u1)\n1( ∂u3 + ∂u2)\n∂u3\n∂x1\n∂x3\n∂x2\n∂x3\n∂x3\nHere, only u1 is nonzero and depends only on x1, so only 11 is nonzero and ij\nbecomes:\n⎡⎢\n⎤⎥\n∂u1 = P/kL = 100%\n∂x1\ni j =\n.\n⎣\n⎦\n(c) Compute the normal stress σii at the same three points of the rope considered\nin (a).\nSolution: At all points along the rope length,\nσii = Fi =\n600 N\n= 4.8x105 N/m2 = 480 kPa.\nAi\nπ(2 × 10-2 m)2\n\nIn other words, stress in a tensile member under an axial load is uniform along\nthe member length.\n(d) What do you notice about the variation in u and in σii as a function of distance\nfrom the clamped end?\nSolution: Under this axial load, u varies along the length of the rope and is\nmaximum at the end furthest from the clamp, while σii remains constant. Here,\nthe important point to notice is that the functional form of the displacement field\nmay be quite different from that of the stress field in a material body.\n3. Concrete, sometimes called \"the ultimate material,\" has enabled impressive achieve\nments in construction for thousands of years.\nConcrete is also simple to make,\nconsisting-in its simplest form-of only lime (calcium oxide), sand, gravel, and wa\nter. An unfortunate limitation of concrete, however, is that it is far, far weaker in\ntension than in compression. In this problem, you will develop a way around this\nlimitation. The technique you will use, known as pretensioning, is commonly used\nto create long spans such as those pictured in Figure 3.\nFigure 2: The Truckee River Bridge in Truckee, California--a 2002 Concrete Bridge\nAward Winner (Portland Cement Association, www.cement.org).\n(a) Let us model a concrete span as a pin-and-roller-anchored beam with a length\nL = 6 m, a thickness h = 0.8 m, and width w (Figure 3(a)). The span is loaded\nwith a distributed load q (force per area) of 50 kN/m2. Determine the values\nand locations of the maximum tensile and compressive stresses in the beam. (It\nmay be useful to construct shear and bending moment diagrams).\nSolution: The stress in the beam is\nMy\n12My\nσ = - I\n= - wh3\nImage removed due to copyright restrictions. Please see\n___________________________________\nhttp://www.cement.org/bridges/truckee.htm\n\nFigure 3: (a) Concrete span under distributed load q; (b) The same span with integrated\nsteel rods to provide pretensioning.\nwhere y is the distance from the neutral axis (in this case, the center) of the span.\nFrom free-body diagrams, the reaction force at each support is qwL/2 and the\nmaximum bending moment is qwL2/8 at the center of the span. The maximum\nstress therefore has magnitude 3qL2/4h2 = 2.11 MPa: negative (compressive)\nat the top of the span and positive (tensile) at the bottom.\n(b) You have decided that it is best to allow no part of the concrete span to be in\na state of tensile stress. To accomplish this goal, you will position steel bars\nalong the length of the span before pouring the concrete. You will then stretch\nthe bars, pour the concrete and allow it to harden, and release the tension (Figure\n3(b)). The released steel bars will exert an axial compressive stress on the span\nthat is superposed with the bending stresses. Determine the force per meter\nof span width to cancel the maximum tensile stress you calculated previously.\nAssume that the load created by the steel bars is distributed evenly across the\ncross section of the span and that the addition of the bars does not significantly\nchange the cross section.\n\nh\ni\nSolution: We require an axial compressive stress of 3qL2/4h2 to cancel the ten\nsile stress and the bottom of the span. The required force per unit width is\n3qL2/4h = 1.69 MN/m.\n(c) You are told that the steel you are using has a failure strength σF = 400 MPa\nand the bars have a diameter of one inch. You wish to avoid failure in the bars\nwith a factor of safety of two. What is the maximum load you can allow in\neach bar? How many bars are needed per meter of span width to provide the\nnecessary compressive load that you calculated previously?\nSolution: The maximum load P is\nσFπd2\nP = σFA =\n= 101 kN\nThe numbers of bars needed per meter of span width is\n1.69 MN/m = 16.7 m-1\n101 kN\n4. A spiral fracture can occur when long bones such as the femur are exposed to an\nexcessive torsional load (Figure 4(a,b)). The diaphysis (middle portion) of the fe\nmur consists of an outer circle of dense cortical bone surrounding a center of much\nweaker trabecular (meshlike) bone. Biomedical engineers have modeled the stronger\ncortical bone portion as an annulus, as shown in Figure 4(c). Let us assume that this\nannulus has an outer diameter of 26 mm and an inner diameter of 20 mm, and that the\ndiaphysis has a length of 30 cm. The shear modulus of cortical bone is approximately\n17 GPa.\n(a) The maximum shear stress occurs at the surface of the bone. If a shear stress\nτF = 60 MPa will cause failure in cortical bone, find the maximum torsional\nload that this femur can withstand. What is this load in Newtons, assuming a\nlever arm of 2 m?\nSolution: The stress distribution under a torsional load T is\nTy\nτ = J\nwhere y is the distance from the center and J is the polar moment of inertia.\nThe maximum allowable torque is therefore\nτFJ\nτF(π/2) (OD/2)4 - (ID/2)4\nT = (OD/2) =\n(OD/2)\n= 135 N-m\nThe load in Newtons corresponding to a lever arm of 2 m is 67.3 N.\n\nFigure 4: (a) Fracture pattern of femur after excessive torsional loading [Vashishith et al.,\nJ Orthopaed Res 19:414 (2001)]; (b) X-ray of femoral spiral fracture [Ligier et al. J Bone\nJoint Surg 70B:74 (1988)]; (c) Loading configuration and annular model of cortical bone\nshowing outer and inner diameters.\n(b) If the dimensions of the cross section (outer and inner diameters) are reduced\nby 50%, by what percentage is the maximum torsional load reduced?\nSolution: If the cross-section dimensions are reduced by half, the new maximum\ntorque is calculated to be 16.8 N-m--an 88% decrease.\n(c) What is the angle of twist at failure for the original cross section?\nSolution: The angle of twist is calculated to be\nTL\nφ =\n= 0.081 rad = 4.7*\nJG\nF\n\no\n\nCourtesy Elsevier, Inc., http://www.sciencedirect.com. Used with permission.\nImage removed due to copyright restrictions. Please see\nig. 4 in Ligier, J. N., et al. \"Elastic Stable Intramedullary\nNailing of Femoral Shaft Fractures in Children.\" Journal\nf Bone and Joint Surgery 70B (1988): 74-77."
    },
    {
      "category": "Resource",
      "title": "sol2_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/4cf5a526e92a4c5482f5f52ffffee814_sol2_07.pdf",
      "content": "3.032 Problem Set 2 Solutions\nFall 2007\nDue: Start of Lecture, 09.21.07\n1. In the beam considered in PS1, steel beams carried the distributed weight of the rooms\nabove. To reduce stress on the beam, it is common to add extra support to these long beams\nat the point of internal maximum bending moment. Where should this support be located,\nand what are the shear forces and bending moments at this location?\nTo answer this, construct the shear force V(x) and internal bending moment M(x) diagrams\nalong the entire beam length, and note the magnitude of each at every point in the beam\nwhere the loading situation changes, as well as at the point of maximum M.\nq = 2,500lb/ft\nA\nB\n18ft\n4ft\n8ft\nω0 = 3,500lb/ft\nFig. 1: Floor joist beam of new MIT physics building.\nSolution: Let us first reconsider the loading on the beam as shown below\nA\nB\nC\nD\nq = 36.5kN/m\nω0 = 51.1kN/m\nQ = 200.4kN\nW = 62.3kN\n145.7kN\n117.0kN\n5.49m\n1.22m\n2.44m\n\nShear Diagram: The shear at any point is determined by dividing the beam into two parts\nand considering either part as a free body. For example, directly to the right of line 2, we\nobtain the shear between B and C\n200.4kN\nV\nM\n145.7kN\n∑Fy = 0 :145.7 -200.4 -V = 0\nV = -54.7kN\n\nUsing the same method we also find that the shear is 145.7kN directly to the right of A and\n117.0kN directly to the left of D\nTo find the slopes between these points we recall the following relationship\ndV = -ω\ndx\nSince the area under the load curve is zero between B and C, the shear will be constant.\nThus, dV/dx=0 and the shear diagram between these points will be a horizontal line.\nBetween A and B, the slope dV/dx = -ω under the uniformly distributed load is constant.\nThus, the shear diagram between these two points is a straight line\nBetween C and D, the loading increases linearly (in the downward direction), and the shear\ndiagram will be parabolic with a negative curvature.\n\nV (kN)\n145.7kN\nA\nB\nC\nD\n-54.7kN\n-117.0kN\nE\n(+291.4)\n(-40.8)\n(-66.7)\n(-133.5)\n(-50.7)\nx\nBending-Moment Diagram: The bending moment diagram can be determined by taking the\narea under the shear curve as\nM = ∫Vdx\nWe first note that at both A and D, the bending moment is zero so we know the two\nendpoints on our bending moment diagram.\nNext, we need to find the maximum bending moment where the shear force is equal to zero.\nLet's call this point E (as noted on the shear diagram). To find this point we write the\nfollowing\nVE -VA = -\n\nqx\n(where VE=0)\n0 -145.7 = -\n\n36.5x\nx = 4.0m\nTherefore, the bending-moment diagram obtains a maximum at a point E that is located\n4.0m to the right of A.\n\nNow, we take the area under each section of the shear curve (values are noted on shear\ndiagram in parenthesis)\nBetween A and E: This is the area of a triangle\nA = bh = (4)(145.7) = 291.4 kN -m\nBetween E and B: This is the area of a triangle\nA = bh = (5.49 -4)( 54.7) = -40.8kN -\n-\nm\nBetween B and C: This is the area of a rectangle\nA = bh = (1.22)( 54.7) = -66.7 kN -m\n-\nBetween C and D: This area consists of two shapes: a rectangle and a parabolic spandrel.\nThe area of the rectangle is given by\nA = bh = (2.44)( 54.7)\n-\n= -133.5kN -m\nThe area of a parabolic spandrel is given by\n(2.44)( 117.0 --\n( 54.7))\nah\n-\nA =\n=\n= -50.7 kN -m\nSo, the total area between C and D is equal to -184.2kN-m\nNow, we can calculate the bending moment at each point\nMA =0 (no bending moment at point A)\nME - MA = 291.4kN-m\nME =+291.4kN-m\nMB - ME = -40.8kN-m\nMB =+250.6kN-m\nMC -MB = -66.7kN-m\nMC =+183.9kN-m\nMD -MC = -184.2kN-m\nMD = -0.3kN-m ≈ 0kN-m given rounding errors)\nSince we know that MD should be zero, we see our calculations are correct.\nFinally, we note in the shear diagram that segments AE and ED are linear, and so those two\nsegments will have a parabolic shape in the bending moment diagram. Segment BC in the\nshear diagram is a horizontal line, and so it becomes a linear segment in the bending\n\nmoment diagram. Lastly, the parabolic segment CD in the shear diagram becomes a cubic\ncurve in the bending-moment diagram.\nM (kN-m)\nA\nB\nC\nD\nE\n291.4kN-m250.6kN-m\n183.9kN-m\nx\nLocation of Beam Supports: The extra beam support will be added at the point of\nmaximum bending moment, which we found to be 4.0m to the right of point A (labeled point\nE). This is where the shear force was equal to zero. The magnitude of the bending moment\nat this location is 291.4kN-m.\n2. At a seminar at MIT last week, Prof. Ilya Zharov (Univ. of Utah, Department of Chemistry)\nshowed that his group could create self-assembled colloidal films, which are basically a few\nplanes of close-packed silica (SiO2) spheres. He proposed these as a potential new of fuel\ncell membrane, because he can coat the nanoscale pores between the silica spheres with\nsulfonated molecules and selectively allow proton exchange through the nanopores.\nThis sounds exciting, but someone quickly pointed out this is basically a very thin, porous\nsheet of glass: as a free-standing film, it might fail mechanically under its own weight or\nunder the loads due to proton flux. Prof. Zharov said he had no idea how strong these\ncolloidal films were, but thought engineers would figure it out for him. He thought that\nlaying strips of the films onto a metal grid (like a window screen) would keep the stresses\nlow enough by supporting the film at several points along its length.\nLet us see if he is correct in this guess, treating a strip of the film as a beam and assuming it\ndeforms elastically up to the point of fracture.\n\nFigure 2. SEM images of the chemically-modified colloidal film prepared from 440\nnm diameter silica spheres (A) top view;the geometric projection of a pore observed\nfrom the (111) plane is outlined in the inset. (B) Side view. (C) A scheme of its\npermselective behavior. From http://www.chem.utah.edu/directory/faculty/\nzharov.html. Langmuir (2007, in revision).\n(a) We will first test the force required to break these films, using two different loading\nconfigurations: three-point bending (Fig. 3a) and uniaxial tension (Fig. 3b). In both tests, we\nuse identical samples which are 100 μm in length and have rectangular cross-sections of 20\nμm width and 2 μm thickness. Draw the expected tensile stress along the beam length σ(x)\nin each case. Assume all stresses remain within the elastic regime. (It may be useful to\nconstruct shear and bending moment diagrams.)\nFigure 3. Experimental and schematic loading conditions for (A) Three-point bending; and (B) uniaxial\ntension.\nImages removed due to copyright restrictions.\nPlease see Fig. 1 in\nhttp://www.chem.utah.edu/directory/faculty/zharov.html\n____________________________\nP\nB\nP\nP/2\nL/2\nL\nP\nL\nP/2\nA\n\nSolution: In the 3-point bend test, we can model the film as a beam in bending. Thus, we\ncan relate the normal stress, σx, to the bending moment and geometry of the beam section\nσ = -My\nx\nI\nwhere M is the bending moment in a section of the beam, I is the moment of inertia of the\ncross-section with respect to a centroidal axis perpendicular to the plane of the couple, and\ny is the distance from the neutral axis. From this equation, we see that the distribution of\nnormal stresses in a given section only depends on the bending moment of that section and\nthe geometry of the section. Consideration of the FBD and shear force diagram for this\nsituation (not shown here) would lead to a bending-moment diagram which looks like this\nx\nM (N-m)\nL/2\n\nP\nL\nPL\n\n×\n=\n\nNotice the bending moment is symmetric about the center point of the beam (or film in this\ncase) and reaches a maximum value of PL/4 N-m at the midpoint. Since the stress\ndistribution is directly proportional to the bending moment, we would expect a similar stress\ndistribution for the beam. The negative sign in the equation shows us that the tensile (or\npositive) stresses will be along the bottom of the film where y is negative making σ positive.\nσ (MPa)\nx\nL/2\n\nFor the tensile specimen, there are no bending moments because there are only tensile\nforces acting along the entire beam perpendicular to the cross-section. The stress is\nconstant and is calculated as\nF\nσ = A\nwhere F is the force or load (same as 'P') acting on the specimen and A is the cross-\nsectional area. Therefore, the stress distribution for the specimen would look like this\nL\nσ (MPa)\nx\n(b) We measure that these test samples catastrophically fail (i.e., transition from elastic\ndeformation to fracture, without any prior plastic deformation or yielding) at an average\nload of 75.0 μN for the 3-pt. bend tests and at a load of 3.4 mN for the tensile tests.\nDetermine the stress at which the colloidal films failed in both cases; this is called the\nflexural strength and tensile strength, respectively.\nSolution:\nSince there is no plastic deformation, we can use the elastic flexure formula to calculate the\nmaximum tensile stress in the beam, which is synonymous to calculating the flexural\nstrength\nMc\nσ =\nm\nI\n\nwhere all of the variables have the same meaning as defined in part (a), and c is the\nmaximum value of distance y. As seen from part (a) the maximum stress occurs at the\nmidpoint of the specimen. Also, we know that the geometry of the specimen is a rectangle.\nTherefore, we can calculate the stress as follows\nbh3\nI = 12\nh\nc = 2\nPL\nM = 4\n3PL\n3(75 ×10 -6)(100 ×10-6)\nσ m = σ F =\n2 =\n-6\n-6\n2 = 140.6MPa\n2bh\n2(20 ×10 )(2 ×10 )\nNote: For brittle materials such as BaTiO3, the flexural strength as calculated from a 3\npoint bend test is often called the modulus of rupture (MOR). However, the test only\nproves flex strength data, and does not provide any information on the stiffness (or Young's\nelastic modulus) of the material.\nThe tensile stress is simply calculated as follows\nσT = F =\n(3.4\n-\n×\n10-3)\n-6 = 85.0MPa\nA\n(20 ×10 )(2 ×10 )\n(c) In this case, the colloidal film is brittle: when the film fails, it fails at the nanopore defects as\nthe spheres break free from one another. The mechanical strength of brittle materials\ndepends strongly on the existence and density of defects in highly stressed regions of the\nmaterial. Considering the stress distributions determined in (a), explain any differences in\nthe flexural and tensile strength properties of the colloidal films calculated in (b).\nSolution:\nIn 3-point bend tests, the area of uniform stress is small and the maximum stress is\nconcentrated under the center loading point, as shown in part (a). However, in a tensile\ntest, the maximum stress is experienced across the entire cross section of the tensile bar.\nThus, there is a lower probability of finding a defect in the peak stress zone for the 3-point\nbend specimens than in the tensile specimens. As a result, the flexural strength (or MOR) of\nthe ceramic films are typically higher than the corresponding tensile strength values, as\nseen in part (b).\n\n(d) For this new proton-exchange membrane application, Zharov wants to \"simply support\"\nthese beams of colloidal film by laying on a copper transmission electron microscopy\n(TEM) grid. The standard grid holes are 3 mm x 3 mm. He estimates the distributed load on\nthe colloidal film due to proton flux to be 10 mN/mm. Considering this new loading\ncondition and the flexural/tensile strengths we determined experimentally, will the colloidal\nfilm fail under this application? If so, how would you redesign the film and/or support to\nenable this fuel cell application?\nSolution: Here we will model the film as a supported beam under a distributed load. Below\nis a free-body diagram of the above situation:\nq = 10mN/mm\nA\nB\nRA\n3mm\nRB\nAnalyzing this FBD, we can calculate that RA=RB=(qL/2)=15mN\nNow that we know the reaction forces at A and B we can figure out what the shear force and\nbending-moment diagrams will be. T\nShear Diagram: We can first observe that the shear stresses at points A and point B will be\n+15mN and -15mN, respectively. Between A and B, there is a uniformly distributed load\nwhich means that the shear force will decrease linearly from point A to point B. Taking any\npoint along the beam between A and B we can calculate the equation of this line\n∑Fy = 0 :15 -10 x -V = 0\nV = -10x +15\nwhere x represents the distance from point A (x=0).\n\nx (mm)\nV (mN)\n15mN\n-15mN\n1.5mm\nA\nC\nB\nWe see that the shear force reaches zero exactly at the midpoint t(labeled 'C') across the\nbeam. Thus, we expect that the maximum bending point will also be at the midpoint of the\nbeam. Since we know that there is no bending moment at point A (MA=0), we can simply\ntake the area under the shear curve between point A and point C to find out the value of the\nmaximum bending moment.\nM C - M A = M C - 0 = 1/ 2(1.5 ×10-3)(15 ×10-3) = 1.125 ×10-5 N - m\nM C = 1.125 ×10 -5 N - m\nKnowing the maximum bending moment, we can now calculate the maximum stress in the\nbeam\nMc\n(1.125 ×10-5)(1 10 -6)\nσ m =\n=\n-23\n×\n= 845.9 GPa\nI\n(1.33 ×10\n)\nThis stress is much larger than either the flexural strength or the tensile strength of the film\n(about 3 orders of magnitude larger!), so the film will fail under this application. To solve\nthis problem, either additional supports can be placed along the film (i.e. make the Cu grid\nholes smaller) so that the maximum bending moment (and thus maximum stress) is reduced\nto a value below the strength of the film. Or, the geometric design of the films can be\nchanged to increase the film's moment of inertia (or resistance to bending). This can be\n\nmost effectively done by making the films thicker (I ∝ h3), but it can also be done by making\nthem wider (I ∝ b).\n3. Solid polymer pressure-sensitive adhesives (PSA) are used for electronic component-to-heat\nsink attach to minimize interfacial thermal resistance, typically comprising polyacrylates\nfilled with conductive ceramic particles These thermally conductive adhesives are applied\nbetween the interfaces of the electronic component and the heat sink (Fig. 4). The polymer\nbecomes highly adhesive under elastic deformation, due to application of this uniform\npressure between the electronic component and heat sink.\nFigure 4: Illustration of PSA application to component-heat sink attachment (adapted\nfrom Eveloy et al. IEEE Transactions on Device and Materials Reliability, 4 (2004) 650\n657).\nLet us treat this PSA tape as an elastic continuum of Poisson's ratio ν = 0.45. A press\napplies1000 N to the electronic package to compress the adhesive tape (Figure 5). The\ninitial gap distance between the package and the heat sink is 0.35 mm.\nImages removed due to copyright restrictions. Please see\nFig. 1 in Eveloy, Valerie, et al. \"Reliability of Pressure-Sensitive Adhesive Tapes for Heat Sink\nAttachment in Air-Cooled Electronic Assemblies.\" IEEE Transactions on Device and Materials\nReliability 4 (December 2004): 650-657.\n\nHEAT SINK\nadhesive\nelectronic Package\n0.35mm\n0.15mm\nx\nx\nsolid support\nx\n1000 N\nz\n100mm\nFigure 5: Schematic of\ncomponent-to-heat sink\njoining procedure using\npressure-sensitive\nadhesive tape.\n(a) If the electronic package is 100 mm wide x 20 mm deep (into page), what is the applied\nstress?\nSolution: The applied stress is calculated as follows\nF\nσ applied =\n=\n= 0.5MPa\nA\n(100 ×10-3)(20 ×10-3)\n(b) Derive the relationship between true strain and engineering strain: εt = ln (εe+1). Is there\na significant difference in these strain values for the normal strain resulting from\ncompression of the PSA from a thickness of 0.35 mm to 0.15 mm?\n\nSolution:\nl f - l0\nl f\nε\n=\n=\n-1\neng\nl0\nl0\nl f = ε\n+1\nl0\neng\nεtrue = ln( l f )\nl0\nεtrue = ln( εeng +1)\nTo examine the differences between the engineering and true strain, we can calculate the\nengineering and true strains as follows:\nt f - t0\n0.15 - 0.35\nε\n=\n=\n\n= -\n\n0.57\neng\nt0\n0.35\nln( ε\n+1) =\n\n-\n\n+\n= -\n\n0.84\nεtrue =\neng\nln( 0.57 1)\nThus, there is a significant difference between the engineering and true strain values (εtrue is\nalmost 50% greater than εeng). This is typical for highly elastic materials, such as polymers,\nwhich can undergo large elastic deformations. .\n(c) To fit this PSA-joined device into the larger circuit, a final joint thickness of 0.15 mm is\nrequired (Figure 5). To ensure a reliable joint, the polymeric adhesive must deform laterally\nunder the applied pressure to completely fill the joint (a change in length equal to 2x in Fig.\n7). Given these two requirements, what is the minimum initial length of PSA tape that we\nneed to ensure complete interfacial contact between the adhesive and electronic package\nafter pressing? Use engineering strain calculations and idealize the PSA tape as an elastic\ncontinuum.\nSolution:\nWe are given the Poisson's ratio for the adhesive material (ν = 0.45) and we know the\ndisplacement of the adhesive material in the z-direction. With this information, we can\ncalculate what the resulting strain of the material in the x-direction will be. First, we\ncalculate the strain of the material in the z-direction:\n\nt f -t0\n0.15 -0.35\nε =\n=\n\n= -\n\n0.57\nz\nt0\n0.35\nwhere tf amd t0 represent the final and initial joint thickness, respectively. Using the\nPoisson's ratio for the adhesive material, we can now determine the resulting strain in the\nx-direction\nε x\nν = -ε z\nε x = -νε\n\nz = -(0.45)( 0.57)\n-\n= 0.26\nFinally, we know that the final length of the adhesive must be 100 mm in order to completely\ncover the surface of the package. Therefore, we can determine what the minimum initial\nlength of the PSA tape must be in order for the adhesive to attain a final length of 100 mm\nε = l f -l0 = 100 -l0 = 0.26\nx\nl0\nl0\nl0 = 79.4mm\n\n4. Strain gages are designed only to measure normal (tensile or compressive) strains, but the\nengineering state of strain of the material plane is defined by εxx, εyy and γxy. Strain gage\nrosettes as you used in Lab 1 are one solution to this problem, because γxy can be calculated\nfrom experimentally measured εxx, εyy and ε(45o). Considering the axes transformation\nequations of strain, determine this relation.\nSolution:\nWe have seen from stress transformation equations that the state of stress for a given\ncoordinate system can be written as\nσ +σ\nσ -σ\n=\nx\ny +\nx\ny cos(2 ) +τ sin(2 )\nσ\nθ\nθ\nxy\n\nSince both stress and strain are symmetric, second-order tensors we can convert the above\nrelationship for stress into strain by using the following conversions\nσx, σy, σz Æ εx, εy, εz and τxy, τyz, τzx Æ (γxy/2), (γyz/2), (γzx/2)\nUsing these conversions we get a the strain transformation relationship\nε +ε\nε -ε\nγ\nε =\nx\ny\nx\ny\nθ\nxy\n\n+\ncos(2 ) +\nsin(2 )\nθ\nθ\nSubstituting θ=45° gives\nε +ε\nγ\nε\n=\nx\ny +\nxy\n\n∴γ xy = 2ε45 -ε x -ε y"
    },
    {
      "category": "Resource",
      "title": "ps3_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/4122e7bf11e704b6d27da288d3ae3daf_ps3_06.pdf",
      "content": "3.032 Problem Set 3\nFall 2006\nDue: Start of lecture, 9/29/06\n1. In PS2-4, you considered a femur under a torsional load that induced a spiral fracture, ap\nproximating the load as pure torsion.\nFigure 1: Femur under pure torsional loading T .\n(a) Draw a representative in-plane element from the outermost surface of the femur diaph\nysis. The femur is idealized as an annular cylinder of uniform diameter subjected to a\npure torque T (Figure 1). Indicate all the normal and shear stresses σij acting on that\nmaterial volume element, expressed only as a function of T .\n(b) Construct Mohr's circle of stress to identify the average normal stress σavg in the bone.\n(c) Draw the orientation of the representative material element (indicate magnitude of θps)\nand give the magnitudes of the principal normal stresses σ1 and σ2, assuming a critical\ntorsional load F of 67 N for a moment arm of 2 m.\n(d) Compare/contrast this finding with what is observed for the principal stress state and\nmaximum shear state for the same bone subjected to uniaxial compression with a mag\nnitude σ11 = σ1 = 60 MPa.\n2. Thin films used in microelectronics can develop considerable internal strain when they are\ndeposited onto a substrate of a different material. The two materials may have different unit\ncell lattice parameters and/or may have different coefficients of thermal expansion, and the\nthin film is forced to take on the lateral dimensions of the substrate to which it is adhered.\nThis strain can lead to substrate-film curvature (Figure 2). The midplane of such thin films\nis often approximated as being in a state of in-plane normal strain in cylindrical coordinates:\nrθ = 0; rr = θθ = o - κz\nwhere o is an isotropic extension of the substrate (and the film), κ is the curvature of the\nfilm/substrate, and z is the distance from the film neutral axis (its midplane).\n\nFigure 2: Top: Substrate before deposition; Bottom: Substrate and thin film after deposition (the\nactual curvature may be in the opposite direction depending on the mismatch between lattice pa\nrameters and thermal expansion coefficients).\n(a) In a scientific programming language of your choice, write a program that can be used\nto determine the normal strain x0 x0 and engineering shear strain x0y0 on the (thin film\nmaterial) plane oriented at an angle θ with respect to your original coordinate system\n(x, y). Your program must report:\ni. x0 x0 and engineering shear strain x0y0 for a given θ\nii. principal strains 1 and 2 and the material volume element orientation θpe\niii. maximum in-plane shear strain x0y0,max and the corresponding material volume\nelement orientation θpe,max\niv. average normal strain avg\nNote: Mathematica, Matlab, Maple, C++, and Fortran90 are excellent choices to build\nthis program. Practice with Mathematica will benefit you in future lab experiment\nanalyses, so here's a good excuse to brush up (available on\nHowever, a brute-\nforce execution in Excel is acceptable as a last resort. In all cases, you must provide\nthe program and indicate the embedded equations with your problem set solution.\n(b) Assume all the strain at the midplane of a Ge film deposited on a Si substrate comes\nfrom a mismatch of the unit cell lattice parameters a of those two materials. Compute\nthat strain.\n(c) Is the film in a state of tensile or compressive strain, and will the film/substrate system\nshow positive (smile) or negative (frown) curvature?\n(d) Assume the film is 500 nm in thickness and that you have measured the radius of curva\nture ρ of the film/substrate system as 10 km, the resolution of laser-based instruments\nused to measure wafer curvature. What is the in-plane normal strain rr = θθ?\n(e) This strain state is the principal strain state. How do you know this?\nMIT Server).\n\n___________________________________________\n(f) Assume a Cartesian coordinate system is a fair approximation in the plane strain state\nof the film (i.e., rr = θθ = 1 = 2). Use your program to determine the orientation and\nmagnitude of maximum in-plane shear strain in the Ge film.\n(g) If the principal strain state of a thicker piece of Ge were not in an equibiaxial strain state\nas described above, but instead a random biaxial strain state (e.g., 21 = 2; 3 = 0), use\nMohr's circle to determine the magnitude of maximum shear strain and the plane of\nthe film on which that shear strain would be (1-2, 1-3, or 2-3). You can assume the\n3-direction to be through the film thickness.\n3. A beam of 2000 mm2 cross-sectional area is composed of two pieces of wood glued together\nalong a plane at an angle θ with the beam axis (Figure 3). It has been found from previ\nous experiments that the joint will fail at 20 MPa and 10 MPa normal and shear stresses,\nrespectively, and the wood at 56 MPa and 28 MPa normal and shear stresses, respectively.\nDetermine the maximum allowable axial load that the bar can carry with a safety factor of\ntwo and the corresponding value of the angle θ.\nFigure 3: Wood pieces connected by glued joint.\n4. In 1654, the German scientist Otto von Guericke performed an experiment for Emperor\nFerdinand III to demonstrate the nature of atmospheric pressure. Guernicke connected two\ncopper bowls with an outer diameter D of 14 in, pumped out the air between them, and tried\nto pull them apart with two teams of eight horses each (Figure 4). The horses were unable\nto separate the bowls.\nImage removed due to copyright restrictions. Please see:\nhttp://chem.ch.huji.ac.il/history/guericke_magdenburg_experiment.jpg\nFigure 4: Otto von Guericke's experiment with two connected copper bowls, a vacuum pump, and\ntwo teams of horses\n.\n\n(a) Assuming that Guernicke's pump was capable of removing 75% of the air from the as\nsembly and idealizing the connected bowls as a sphere with a wall thickness of 0.4 cm,\nwhat was the maximum normal stress in the copper bowls before the horses started\npulling?\n(b) Using a failure stress σF for copper in compression of 370 MPa, how thin in theory\ncould the copper bowls be made without failure? If this value seems impractical, ex\nplain why using the terminology and concepts of 3.032.\n(c) Assume that the bowls are not hemispheres but rather two identical shells of revolution\nof y = (7 in) sin [xπ/(14 in)] for x between 0 and 14 inches with axis of revolution x = 7\ninches. The bowls are sealed at the joint with epoxy (Figure 5). The wall thickness is\n0.4 cm and the interior is 75% evacuated as before. What is the actual shape of the\nstress distribution σ(x), and what is its average value?\nFigure 5: Epoxy joint between two shells of revolution."
    },
    {
      "category": "Resource",
      "title": "ps3_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/b064b4e50cae1a6fdacfc3ec382519df_ps3_07.pdf",
      "content": "3.032 Problem Set 3\nFall 2007\nDue: Start of Lecture, 10.01.07\n1. Here, we will analyze the stress states of a solid block of aluminum under various\nloading conditions using the Mohr's Circle construction. We will use the following\nconvention to describe the different components of stress:\nz\nσxx\nσyy\nσzz\nτzy\nτzx\nτyz\nτyx\nτxz\nτxy\ny\nx\nFor each of the following situations, describe the stress state in terms of a stress\nmatrix σij. Determine the principal normal and shear stresses and give the\norientation of the principal axes as well as the orientation of the max shear stress.\n(a) One very popular application of aluminum is for use as thin films for metallization\nlayers in integrated circuit (IC) fabrication. In the case of thin-films (or other thin\ngeometries), where one of the dimensions of the material is much smaller than the\nother two, the stress acting through the smaller dimension is negligible and can be\nneglected during analysis. This case, where the stresses acting on one of the\northogonal planes is zero, is known as plane stress. Let us assume that the thickness\ndimension of the Al thin-film is along the z-direction (parallel to the x-y plane), so\nthat the plane stress condition is σzz = τxz = τyz = 0.\nDuring a bend test of the Al thin film, a point on the surface of the film was found to\nhave high stresses. It was decided that this point of the thin film would be further\nanalyzed. The stresses on the film, with respect to the coordinate system shown\n\nabove, were found to be σxx = 95MPa, σyy = 25MPa, and τxy = 20MPa. Determine all\nof the information stated in the problem (in bold italics) and note the value of the\nmaximum normal stress.\n(b)\nAluminum is also used in electrical transmission\nlines for power distribution. In order to assess the\nmechanical integrity of the lines, the lines are\nloaded in uniaxial tension. It is observed that the\nlines permanently deform at an applied uniaxial\nstress of 20 MPa. In addition to the requirements\nin bold font (σij, magnitude and orientation of\nprincipal/max shear stress states), also draw the\norientation of the material representative volume\nelement (here, a plane) that is under maximum\nshear stress. Assume the following orientation\nand axis-set for the Al lines loaded in tension:\nFig. 1a: Aluminum power line\nloaded under uniaxial force F.\n(c) One common forming process for aluminum parts is known as extrusion. In the\nextrusion process, a billet of material is forced through a die in order to obtain a\nworkpiece with the desired cross-sectional geometry. One type of extrusion process\nis known as hydrostatic extrusion. Unlike many\nextrusion operations, where pressure to the billet is\nsupplied by a hydraulically-driven ram or pressing stem,\nthe pressure in hydrostatic extrusion is supplied through\nan incompressible fluid medium surrounding the billet\nImages removed due to copyright restrictions. Please see:\n(see Figure 1b below). Hydrostatic extrusion is a very\nhttp://www.fzs.tu-berlin.de/html/en/strpr_hydro.html\npopular operation for ductile materials such as aluminum\n__________________________________________\ndue to its ability to reduce defects in the extruded part\nthrough the compressive environment. Typical pressures\nexerted on the workpiece are around 1400 MPa.\nWrite the stress state of a representative volume element\nof the Al billet inside of the extruder under the\nFigure 1b: Hydrostatic\nhydrostatic pressure of 1400 MPa (noted by the grid\nextrusion process\nregion in Fig. 1b), and determine all other information\nrequested in bold font.\n2. You are responsible for performing uniaxial tensile tests on three very different\nmaterials: a 316 stainless steel alloy, alumina (Al2O3), and high density polyethylene\n(HDPE). However, before performing the actual tests, you are asked to predict what the\nelastic stress vs. strain responses of each of the materials based on the mechanical\n\nproperties of these materials documented in the literature (e.g., material property\ndatabases such as matweb.com, linked on the MIT Server).\n(a) Graph the stress [MPa] versus strain [%] response for all three materials on a single\ngraph and on 3 separate graphs, up to an applied strain value of .01 (or 1%) in strain\nincrements of 0.0005.\n(b) Remark on the differences in behaviors seen for each of the three materials as related\nto their relevant mechanical properties. Also, looking at the magnitude of the stresses at\nthe maximum applied strain, do you expect all of these materials to deform elastically up\nto these strains? If not, what was the fallacy in solely using Hooke's law to predict the\nstress-strain behaviors for each of the materials?\n(c) All three samples were given to you as cylinders with identical initial dimensions of\n10 cm length and 2 cm diameter. Show whether a uniaxial load frame of maximum load\ncapability = 100 kN (like the ones you used to crush the beverage cans in Lab 1) will be\nsufficient to deform all three materials to the requested engineering normal strain of 1%.\nHere, neglect the possibility that the materials might not remain intact to that strain.\n3. You and your labmate have been given a joint project by your UROP advisor. He has\nasked you both to measure all the elements of the stiffness tensor Cijkl of two new\nproteins he has crystallized and is considering for use in a flexible, organic integrated\ncircuit that must withstand mechanical bending.\nAnother student has already used x-ray diffraction to determine the crystal structure of\nthe proteins: protein A exhibits a tetragonal unit cell, whereas protein B exhibits an\northorhombic unit cell. Your labmate says, \"Let's each measure the elastic constants Cijkl\nof one protein. Which one do you want to analyze, protein A or B?'\"\nFig. 3: Unit cells for (a) tetragonal and (b)\northorhombic crystals.\nUnder the assumption that you'd like to spend as little time as possible on this project so\nyou can get back to your 3.032 studies, what is your answer? Explain concisely, but as\nfully and accurately as possible, using the elasticity concepts discussed in 3.032."
    },
    {
      "category": "Resource",
      "title": "q1_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/7ee4d8ee46c839dfffb6c14ccc6ccf96_q1_06.pdf",
      "content": "3.032 Quiz 1\nFall 2006\nDO NOT TURN THIS PAGE OVER AND START THE QUIZ UNTIL YOU\nARE ASKED TO DO SO.\nGuidelines:\n1. Show all your work on the sheets included in this stapled document.\n2. Use partial credit to your advantage. If you're running short on time, solve algebraically and then\nsolve numerically (plugging in numbers) later.\n3. If there is not much space given for you to provide an answer, we want you to be brief.\n4. You may not need to use all the information given (e.g., dimensions) to reach your conclusions.\n5. Enjoy your dark chocolate before getting started! It lowers blood pressure (JAMA, 2003), contains\nantioxidants (Nature, 2003), and supposedly helps neural synapses responsible for memory to fire\nfaster (Nature Health, 2003).\nNAME (PRINTED):\nI agree that this document represents my own independent work on this quiz, using only my own brain, my\nallowed crib sheet of equations and notes, and my pen / pencil / calculator / protractor / compass / ruler /\nsliderule.\nSIGNATURE:\nGOOD LUCK!\n\n1. Harvard University is currently using several large cranes to complete construction along the Charles\nRiver. Below is a schematic of one such crane, with dimensions and the position of a counterweight\nindicated.\nFigure 1: Schematic of crane used to complete construction along the Charles, indicated with the horizontal\nelement of the crane (a trussed beam) parallel to the ground. (a) Entire crane; (b) Hook-end of the horizontal\nelement.\n\n(a) Draw a free body diagram of the horizontal element of the crane (the horizontal span in Fig. 1a),\ntreating it as a beam and indicating all known and unknown applied / reaction forces. You will\nneed to make assumptions about how the crane is connected to the real world, and these should\nbe briefly justified.\n(b) If this counterweight exerts a force of 1 MN, what is the magnitude of the vertical force due to\nthe vertical support Pv such that the horizontal element remains stationary and parallel to the\nground (as pictured)?\n(c) Now assume that a steel I-beam that weighs 5 kN is lifted by the crane at the hook, and should be\nheld such that the horizontal element remains stationary and parallel to the ground (as pictured).\nThe critical counterweight and the force Pv will change. What is the required magnitude of the\nnew counterweight?\n\n(d) Consider the hook-end of the crane's horizontal element (Fig. 1b), now loaded by the weight of\nthe steel I-beam. Can member AC be made from a thin steel cable (essentially an elastic rope)?\nHere, you're considering the elements of the truss explicitly, so their weight as a whole beam\nstructure (i.e., q) can be neglected. Explain your answer fully.\n2. We know σij and ij can be expressed as quadrics. Explain concisely, but fully and accurately, what\nthis fact immediately implies about tensorial stress and strain.\n\n3. Tractor-trailers are used to transport liquid propane in cylindrical tankers made of stainless steel,\nprecisely because the trailer must act as a pressure vessel as the contents change temperature (and\nthus internal pressure levels) over the course of the trip, and so that accidental combustion could be\nrelatively safely contained.\n(a) Draw a two-dimensional (side view) free body diagram of the tanker (the part pulled by the cab\nwhere the driver sits), indicating supports and corresponding reaction forces as well as applied\nforces.\n(b) Idealizing the tanker as a thin-walled pressure vessel, how much internal pressure Pi can the\ntanker handle without catastrophic failure? Stainless steel fails at a normal stress (only) of 200\nMPa, and at a shear stress (only) of 100 MPa. You can neglect the pressure differential with the\natmosphere, such that Pi = ΔPi.\n\n(c) For this ultimate loading state (i.e., using the value of Pi obtained above), express the tanker\nwall stress state numerically in tensor/matrix notation: σij = [matrix of all zero and nonzero\nstresses]. Clearly indicate your assumed orthogonal axes with respect to the dimensions of the\ntanker.\n(d) You would like to measure this stress state using strain gages, but the tanker company will not let\nyou place the strain gages anywhere except on the letters of \"PROPANE\". As shown, these gages\nare the width of the painted letters, so you're forced to align them with the letter orientation.\nWhat is the stress tensor σij that you expect to measure at the position of strain gage 1 when the\ntanker is pressurized to its maximum value Pi? Give the full matrix, and solve this using any of\nthe three approaches discussed in class.\n\n(e) Briefly (but accurately) describe how you would use the other two methods you could have\nchosen to transform this stress tensor.\n(f) Let us assume that you could align the strain gage along the longitudinal axis of the tanker, and\nthat this strain gage is a single strip of Cu of initial length Lo = 1 cm with a gage factor of 1\n(Δresistance = ). The strain in that Cu strip will be equal to the longitudinal strain of the steel,\nwhich is = 0.4σlongitudinal/E.\nWhat is the expected change in length of the Cu strip that you expect to occur under this principal\nstress σlongitudinal = σ2 due to this pressure Pi? You can assume engineering strain, and that the\nelastic moduli E of Cu and steel are 110 GPa and 210 GPa, respectively.\nEND OF QUIZ 1\n\nUSE THIS PAGE FOR EXTRA PROBLEM SOLVING AS REQUIRED.\n\nUSE THIS PAGE FOR EXTRA PROBLEM SOLVING AS REQUIRED."
    },
    {
      "category": "Resource",
      "title": "practice2_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/f49e769c1d91bd032c7676301dd14f09_practice2_06.pdf",
      "content": "3.032 Practice Problem Set\nFall 2006\nSolutions posted: End of lecture, 11/06/06\n1. Your colleague is using the following viscoelastic model to predict a material's behavior:\ntwo Kelvin-Voigt models in series with each other and with a single spring. What is the\neffective stiffness of this arrangement at short time scales / high strain rates? At long time\nscales / low strain rates?\nSOLUTION: At high strain rates, dashpots act like rigid connections, and springs act like\nsprings. At early times and high strain rates, the effective stiffness is therefore that of the\nsole spring; the two K-V elements are effectively rigid and do not displace.\nConversely, at long times and low strain rates, dashpots act as though they are not even\nconnected, so the effective stiffness is that of three springs in series.\n2. Find the maximum difference (x%)in magnitude between the stress state that will produce\nplastic failure (yielding) of a metal according to the Tresca criterion or to the von Mises\ncriterion. This is the location on the yield surface where the two surfaces are furthest apart.\nSOLUTION: The maximum difference between these two cases occurs for pure shear. On\nthe yield surface diagram, this is the diagonal line that bisects quadrants 2 and 4. If we\ninsert this stress state into the two criteria, we obtain different magnitudes of the shear stress\nmagnitude σ13 that will be sufficient to cause failure by yielding.\nTresca says: σ13 = σy/2; von Mises says: σ13 = σy/\n√\n3.\nThus, the magnitudes differ by ≈13%, with Tresca being the more conservative criterion\n(i.e., lower stress required to meet the condition for failure by yielding).\n3. Consider a material that is about to experience uniaxial loading of a magnitude sufficient to\nmake the material yield. Could you prevent the material from yielding by applying loads on\nother axes? How? Why does this work?\nSOLUTION: See John Maloney's\n/Resources for a nice discussion of\nTresca related to this point. Recall that the yield criteria we covered relate the difference\nbetween maximum and minimum normal principal stresses (Tresca) or the difference among\nall three principal stresses (von Mises) to the magnitude of the yield stress. Intuition may\ntell you that adding more stress to a material will surely bring on failure, but if that stress\ndecreases the difference between two principal stresses, it can actually prevent failure.\n4. The stiffness matrix component C45 is shorthand for C2313 in the full stiffness tensor. How\never, the compliance matrix component S 45 equals not S 2313 but 4S 2313. Show why by writing\nout 4 (using i = S ijσ j) and its equivalent 223 (using ij = S i jklσkl).\nExplain why this doesn't happen with the stiffness matrix.\nSOLUTION: By expanding the indicial notation,\nε4 = S 41σ1 + S 42σ2 + S 43σ3 + S 44σ4 + S 45σ5 + S 46σ6\navailable on MIT Server\n\nIts equivalent, 2ε23, is expanded as\n2ε23 = 2(S 2311σ11+S 2312σ12+S 2313σ13+S 2321σ21+S 2322σ22+S 2323σ23+S 2331σ31+S 2332σ32+S 2333σ33)\nUsing the fact that σi j = σji, we note that the coefficients of the equivalent stress components\nσ5 and σ13 are S 45 and 4S 2313, respectively. These coefficients must also be equivalent.\nIn general, S ab = S i jkl for a and b both equal to 1, 2, or 3; S ab = 4S i jlk for a and b both equal\nto 4, 5, and 6; and S ab = 2S i jkl for all other cases (S 14, for example). In contrast, Cab always\nequals Ci jkl, which can be seen by expanding σa = Cabεb and σij = Cijklεkl.\nAs noted in Monday's review session, the 4 in the 4S 2313 comes from two factors of 2: The\nfirst is from the fact that ε4 = 2ε23, due to the factor of two relationship between engineering\nshear strain ε4 and tensorial shear strain ε23. The second factor of 2 is from the fact that\nS 2313 = S 2331, a fact you proved in PS5 using the four Kronecker deltas for Cijkl, and you\nalready know that σ13 = σ31 from equilibrium. So when we write out ε23 = S 23klσkl, we get\nS 2313σ13 + S 2331σ31 = 2S 2313σ13.\n5. Which of the following are easy slip plane / slip direction combinations for a copper crystal?\n(a) (111), [110]\n(b) (11-1), [00-1]\n(c) (101), [11-1]\n(d) (100), [0-11]\nSOLUTION: None of them. Remember that a slip system is a slip plane and a direction on\nthat plane. Typically, the primary slip system is the close-packed plane and a close-packed\ndirection on that plane. For Cu (fcc), this will be the {111} h110i system. However, specific\ndirections must be ON specific planes, which means that the dot product of the slip plane\nnormal (which is oriented 90o to the slip plane) and the slip direction must be zero (cos(90o)\n= 0).\nFor a cubic system, it turns out that the slip plane normal has the same indices as the slip\nplane itself (here, the slip plane normal is h111i). However, the dot product of some of the\nabove combinations is not zero. For example, the first one would be:\n[111]dot[110] = (1 + 1 + 0)/(\n√\n√\n2) = 2/\n√\n6 , 0\n(1)\nSame deal for the second combination. The last two are also not the easy slip systems\nbecause, although the dot product is zero, these are not the close-packed planes of fcc.\n6. What is the relationship (both direction and magnitude) between b and a for an fcc crystal?\nA bcc crystal?\nSOLUTION: For an fcc crystal, we covered this in lecture on 10.30.06. Looking at the (100)\nplane and assuming r is the atomic radius of a hard-sphere model of the fcc crystal, we see\nthat\n4r =\n√\n2a2\n(2)\n\nor a = 2\n√\n2r. We know that b is the vector that defines unit slip in the close-packed direction,\nso b = 2\na h110i = a .\n√\nFor a bcc crystal, we know the atoms touch along the h111i or body-diagonal direction, so\nhere a = 4r and b = 2\na h111i =\n√\n3a .\n√\n7. Your chemist friend is puzzled by a question of crystal symmetry: \"A cubic material has the\nsame stiffness in all three axes 1, 2, and 3, and an isotropic material has the same stiffness in\nall three axes 1, 2, and 3. So what's the difference?\" How would you answer?\nSOLUTION: One answer would be:\n\"You're right that the properties measured along three different axes may be numerically\nequal if the material is cubic or isotropic. However, that would be a special case in a cubic\nmaterial, such that if I rotated the material and took measurements along a different three (yet\nstill orthogonal) axes, the value in the second experiment need not equal the value obtained\nin the first.\nIn general, an isotropic material is an idealized case where the properties are independent\nof the direction in which they were measured, so it would not matter how I rotated a repre\nsentative volume element of that material - I would ALWAYS measure the same value of a\ngiven property. A cubic material has a structure and properties that are defined by the orien\ntation of the atoms.\nvectors defining that unit cell, all the properties measured will be independent of direction.\nIf the 1, 2, and 3 directions of my measurement are equal to the h100i\nHowever, those that I measured along a rotated set of orthogonal vectors (e.g., h110i) would\nnot necessarily be equal to the values I measured along the h100i.\nSo you see, my chemist friend, the properties of the cubic material are defined by the struc\nture of the material (the arrangement of the atoms in the unit cell). The properties of the\nisotropic material are assumed independent of the arrangement of the atoms.\""
    },
    {
      "category": "Resource",
      "title": "practice2_07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/f9b0f57e5063c3c781a8f626af41fff6_practice2_07.pdf",
      "content": "3.032 Class Questions Re: Quiz 2 Topics\nFall 2007\nNote: These are responses to class members' questions in order of emails received, not necessarily importance.\nMy responses are intended to supplement your class lecture notes and reading material.\n1. Please go through the shrimp at the base of the ocean problem again. I am not clear the difference\nbetween stress and shear when it comes to the death of the shrimp. That was a great example you brought\nup.\nA material or an animal within the ocean is subjected to pure compressive hydrostatic stress (normal stresses in x,\ny, and z are equal in magnitude). The maximum normal stress criterion for plastic deformation predicts that a\nmaterial will yield if the normal stress reaches the value obtained when the material fails under uniaxial\ntension/compression. In other words, the material will fail if ANY of the normal stresses reaches yield strength sy.\nThe uniaxial compressive stress required to yield or kill a shrimp (0.1 MPa), so this criterion predicts that a shrimp\nwould yield/die if it reached a depth in the ocean where the pressure reached 0.1 MPa. However, shrimp live\nhappily at depths where pressure is 10 MPa, so this criterion does not accurately capture the \"yield criterion\" that\npredicts plastic failure of shrimp. We discussed that the reason for this failure is that many materials including the\nbiopolymers that make up a shrimp fail not due to high normal stresses but to high shear stresses.\nFrom Mohr's circle, it is easy to see that hydrostatic stress fails to generate shear stress on any plane inside the\nmaterial: this is a principal stress state where all 3 normal stresses are located at the same point on the σ-axis, so\nyou cannot draw a circle to define planes on which the shear stress is nonzero.\n2. Principle [sic] stress, principle [sic] shear: What does this mean in an engineering system? If I have a\nceramic I know has a yield stress of x MPa, how does a 2 x 2 matrix of stress and shear indicate how and in\nwhat orientation I can implement it?\nEngineers need to be able to determine the principal state of stress or of strain in a material to identify the\nmaximum/minimum values that normal/shear stresses/strains will attain inside the material. As we learn from the\nyield criteria, if these maximum values reach the magnitudes required to yield the material, the material will deform\npermanently (plastically) rather than reversibly (elastically). This often leads to functional failure of the structure or\ndevice, and computation of the principal stresses corresponding to a triaxial stress state is the fastest way to\ndetermine whether yielding will occur according to these criteria.\nBy \"2 x 2 matrix of stress and shear\", I think you mean a matrix σij that includes both normal and shear stresses; if it\nis a 2x2 matrix then you are assuming plane stress: the only nonzero normal/shear stresses are contained in one\nplane (say, x-y plane), and there are no normal/shear stresses in the orthogonal plane of the material (say, the z-\nplane). This is a reasonable approximation for thin sheets of material, where z is the through-thickness direction.\nIf you had a ceramic of known yield stress x MPa and knew your application would place this ceramic under this\nplane stress state, you would want to immediately determine the principal stress state. Why? First, you could then\ndetermine whether these stresses are sufficient for yielding to occur, according to your choice of yield criteria.\nSecond, this would tell you the orientation and magnitude of the maximum normal stress. Although we've not yet\ncovered fracture in 3.032 yet, ceramics are typically brittle materials that fracture rather than plastically deform, and\nthe maximum normal stress criterion does a good job at predicting the fracture stress of such materials. If the\nmaximum normal stress in the ceramic reaches the fracture stress of your ceramic, you know right away that the\nceramic device will fail and you would choose another ceramic of larger fracture stress.\nIf the maximum normal stress is below the fracture stress of your ceramic, you'd still want to consider modifying the\nceramic via processing to either increase its fracture stress or adding fibers that would be aligned to block growth of\ncracks. Thinking back to the pressure vessels/hot dogs, you can intuit that the cracks would run perpendicular to\nthe maximum normal stress, and you would then align these fibers parallel to the maximum normal stress\norientation (the principal stress axis orientation) to be sure you'd block such cracks.\n\n3. Do components like fibers on a silicon substrate really undergo stress tensors like in that problem set?\nHow? Do engineers at intel and other device companies really look at stress states like that?\nYes, engineers at electronic device companies like Intel in fact consider such stress states on silicon. Typically,\nsuch engineers are concerned with triaxial thermal stresses when these devices reversibly heat and cool. If the\nsilicon substrate is both heated and loaded mechanically, which is common in such devices, both normal and shear\nstresses are generated within the Si wafer. Interconnect lines of metal and device insulators of oxides are so thin on\nsuch devices that, at the interface where those tiny lines of materials join to the silicon substrate, the strains\ngenerated in those small-volume \"fibers\" or films are exactly equal to the strains in the Si.\n4. Why do I want to rotate a stress state x degrees? What does this physically mean in an engineering\nsystem?\nWe've discussed this through several different examples in class and recitation, as well as in Lab 1. We are not\nrotating a stress state, but rather resolving the stresses or transforming the stresses onto a new set of coordinate\naxes. Coordinate axes are arbitrary choices to analyze a real engineering system; we often pick axes that align with\nthe shape of the object or the orientation of the applied stresses/strains, but that is purely arbitrary. If we were to\ndraw a different set of coordinate axes rotated by some angle theta, we'd come up with a different combination of\nstresses/strains.\nThis is the same exercise as resolving a force vector that is at some arbitrary angle into its \"vertical\" and \"horizontal\"\ncomponents. We have not rotated the force, just expressed that force in terms of a new set of axes. This makes it\neasier for engineers to analyze all the complex forces acting on a device, e.g., by balancing all the vertical and\nhorizontal components to make sure the device will not move.\nIn the case of stresses inside a material, we resolve stresses onto coordinate axes to easily identify planes inside\nthe material that are under high normal stress/strains or high shear stresses/strains. These are locations that we\nidentify with respect to our initial set of axes, so we say that these orientations of high normal or shear stress/strain\nare \"rotated some angle theta with respect to our initial axes.\" As a materials engineer, you know that materials will\ndeform and/or fail under sufficiently high stress states, so you need to know the orientation of regions under high\nstress (likely locations of failure). You also need to know how a stress state is distributed onto planes defined by the\nunit cell planes of a crystal; or onto planes that define the orientation of precipitates, particles, grain boundaries, or\nfibers within the material.\n5. Could you go over the dislocation stress fields and also the force vs. extension relationships for the\nthree types of yield conditions.\n(a) Yield conditions (covered first, as this is a continuum concept applicable to crystalline and noncrystalline\nmaterials):\n1. Maximum normal stress criterion for yielding: material yields when any of the three principal normal stresses\nreach the normal stress attained when the material yields under unaxial loading, which is exactly the yield stress.\n2. Maximum shear stress criterion/Tresca: material yields when the shear stress reaches the maximum shear stress\nattained when the material yields under unaxial loading. From Mohr's circle, you can see that the shear stress\nattained upon yielding under uniaxial loading is (σ1 - σ3)/2 = σy/2.\n3. Maximum distortional energy/von Mises: material yields when the effective stress reaches the effective stress\nwhen the material yields under uniaxial loading. The effective stress is defined by the 2nd invariant of the deviatoric\nstress tensor, and can be calculated from any stress tensor σij or the principal stresses σ1, σ2, and σ3 corresponding\nto that stress tensor.\n(b) Dislocation stress fields: The stress generated inside the crystal due to the presence of a single screw or edge\ndislocation can be calculated from the displacement the dislocation creates: u Æ ε Æ σ in our usual way, where the\narrows here indicate a partial derivative and a constitutive relation, respectively. We'll cover this more extensively in\nthe elective, 3.14. In this class, you should understand how these stress fields are derived (just as we derive stress\nin a material from any displacement applied to that material), and how these dislocation energies and stresses\ndepend on elastic properties (G and ν) and length scales (b) of the crystal.\n\n6. It would be nice to clarify the different types of elasticity we learned and the important differences\nbetween them, and what materials they are relevant for.\nWe'll do this in the quiz review sessions together. You should try to make a table of this for your crib sheet, using\nyour notes and course reader.\n7. Why do only gases readily obey Newton's viscosity law but not high molecular weight polymers?\nWhen the motion of particles is uncorrelated, Newton's law of viscosity holds well: the resistance to shear flow or\nthe shear strain rate varies linearly with the applied stress. For gases and low molecular weight polymers or fluids\nof low viscosity, the number of particles/chains per unit volume is so low that the motion of one particle/chain is\nreally independent of the motion of the nearby particles/chains. As the molecular weight of a polymer increases, the\nchains are increasingly entangled and thus the motion of one chain depends in part on the motion of the nearby\nchains.\n8. Overview of the graphs for the LVE solid. Specifically, why does the KV model fail to describe relaxation\nin polymers? why does the Maxwell model fail to accurately predict creep in solid polymers? (You gave an\nexcellent explanation in class during those lectures but I can't remember fully:)\n\"Why\" these models describe only creep or only relaxation well is attributed to what kind of material for which they\nwere originally designed to match the experimental data. The Maxwell model describes a spring and dashpot in\nseries, and was proposed to explain the time-dependent deformation of very viscous fluids like tar. If this model is\nsubjected to an immediate, constant tensile stress (tensile creep), the spring can extend instantaneously to a strain\nε = σ/E; a real polymer does not deform instantaneously, but in fact exhibits a lagged increase in strain. The K-V\nmodel describes a spring and dashpot in parallel. If this model is subjected to an immediate, constant strain e,\nrelaxation is the decrease in stress inside the material with time. The K-V model's constitutive law shows that for\nde/dt = 0, stress would be constant for all time (and equal to exactly Ee), and never relax; a real polymer does relax\nover time, so K-V poorly predicts polymer relaxation.\n9. Graph of stress-strain curve showing the energy loss and the concept of mechanical damping. Can you\nplease explain the aeroplane explanation concept again?\nIf you load a linear elastic material, the strain in the material would instantaneously be equal to the stress/E, no\nmatter how fast or slow your loading frequency. In contrast, if you stress a polymer at time = 1/frequency much\nfaster than its characteristic time (τ = η/E for the Maxwell or Kelvin-Voigt models) or much slower than its\ncharacteristic time, you'll observe the strain that you would predict from the constitutive models for short times (t =\n0) or long time (t = infinity), respectively. If you stress a polymer at 1/frequency that is intermediate to these two\nextremes, the \"viscous\" or \"dashpot\" nature of the polymer will cause the strain to lag behind your loading frequency.\nThe polymer is damping the input mechanical stress via this lag, often dissipated or as heat. You would see this in a\nstress-strain curve as a hysteresis, or gap between the loading part and the unloading part, where the area inside\nthat hysteresis loop is the dissipated energy. The example I gave in class was actually of a tire material (a\nreinforced rubber, not really a good example of a LVE polymer governed by internal energy U) where the goal is to\ndesign the material to damp dissipate as much mechanical energy as possible at the operating frequency, which\nmight be the angular frequency of an airplane or truck or car tire.\n10. Are we responsible for the fine details of the derivations of the force and entropic parameters that\ncharacterize the polymer chains? Gaussian distribution function?\nNo, you do not need to memorize the form of a Gaussian distribution function. Yes, you should understand and be\ncomfortable deriving the molecular origin of rubber elasticity and predicting the effects of changing Lp, Lc, T, etc on\nentropic spring constant. From previous Course 3 classes, you can relate the Hemholtz energy in terms of entropy\nas a function of accessible configurations that can be expressed by some probability distribution function.\n11. Can you please address the main differences between the tresca and Von Mises criteria? Also can you\nplease discuss the concept of conservatism?\nTresca: material yields when max shear stress = max shear stress attained when material yields under uniaxial\nloading; this neglects the intermediate principal stress.\n\nvon Mises: material yields when the shear strain energy reaches a critical value, which can be expressed in terms\nof the effective stress σeff = effective stress attained when material yields under uniaxial loading; this considers all 3\nprincipal (normal) stresses.\nConservative: you are conservative if you predict yielding at stresses that could be lower than the actual stresses\nrequired for yielding. This is a conservative estimate of when yielding will occur, because those stresses may\nactually be insufficient to cause yielding. If you want to ensure that yielding does not occur under some triaxial\nstress state, you typically want to err on the conservative side of your estimates so that you're quite sure yielding\nwill not occur.\n12. I remember writing in my lectures notes that yielding is defined as the stress needed to increase\ndislocations or cause the dislocations to multiply(during the guest lectures)-I may have written the point\nincorrectly. Can you please explain? In general, is it safe to assume that having dislocations in a material is\nadvantageous because it provides strengthening mechanisms in the material and increase the yield\nstrength of the material? That said, can you please emphasize the role of dislocations in plastic\ndeformation/yielding?\nYielding means \"plastically or permanently deforming without fracturing/breaking\". The motion of dislocations is the\nmicroscopic origin of plasticity; dislocations are the carriers of plasticity in a crystal, just as electrons are the carriers\nof current. At the microscopic level, this happens as soon as the first dislocation moves. From an engineering point\nof view, motion of just one dislocation is usually inconsequential, so we define \"yield stress\" as the stress we can\nmeasure beyond which the material is plastically deformed. To measure such a stress practically, the\ndisplacements must be much greater than a single Burgers vector due to one dislocation. In fact, we need lots of\ndislocations to move, so we say that yielding is measureable when lots of dislocations move, which means the\nstress is sufficient to move existing and generate new dislocations.\nWill having dislocations always increase the yield strength of a crystal? This is a tricky concept: as we discussed, a\nsingle crystal with zero dislocations will have a higher yield strength than a single crystal with some pre-existing\ndislocations; to yield the former case, we'd have to nucleate some dislocations at GPa-level stresses. On the other\nhand, a single or polycrystal with 1000 pre-existing dislocations would generally have a higher yield strength than\none with 100 pre-existing dislocations, for the reasons related to work hardening that we discussed.\n13. What is the relationship between the pinning points and plasticity? I am under the impression that the\npinning points prevent plasticity from taking place by impeding the motion of the dislocations.\nPinning points \"pin\" segments of a moving dislocation, such that it takes additional stress to continue to move that\nsegment of the dislocation (it must get longer to curve between those pinning points, and its energetic penalty\nincreases per unit length of the dislocation). You are correct: since plasticity requires motion of dislocations, pinning\nimpedes dislocation motion and thus increases the stress required for sustained plastic deformation. However, a\npoint beyond what we've covered in class in detail (and will cover in 3.14) is that these pinning points also can\nserve as sites of dislocation multiplication: looking at the precipitate/particle strengthening, we see that when\ndislocations are bent sufficiently around an obstacle, parts of the dislocation \"pinch off\" and form new \"child\"\ndislocations that can move independently of the \"parent\" dislocation.\n14. Do we need to qualitatively explain the strengthening mechanisms, i.e alloying elements, dislocations\nand grain boundaries or are supposed to quantitatively describe these concepts?\nBoth: You need to understand the physical explanation for why each of these approaches increases the yield\nstrength, and quantitatively know how a change in the microstructure will affect the yield strength of the material.\nThese equations are quite simple because they are based on empirical (experimental) observations, but are good\nengineering tools for material design.\n15. The general concept that I am the most confused about is the worm-like chain model and\nthe freely-jointed chain model, and the various parameters we can derive from these\nmodels.\n\nFJC model: Force required to extend this chain depends on contour length Lc, which depends on the number and\nlength of rigid segments that make up the chain, n and b, respectively.\nWLC model: Force required to extend this chain depends on Lc and Lp. Here, Lp is like b from the FJC model, but\nreflects the fact that polymer chains are not made up of rigid segments b connected by joints, but flexible segments\nthat fluctuate independently over some length Lp.\nBoth models are based on entropically dominated free energy, where entropy is defined by accessible\nconfigurations of the chain as derived in class. As in pset 5, one can apply these models to experimentally\nmeasured data to estimate Lc, Lp, and/or n and b of the chain, and the stiffness of that polymer chain."
    },
    {
      "category": "Resource",
      "title": "q2_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/56d96ac116365e8416b0f8af9e6914a1_q2_06.pdf",
      "content": "3.032 Quiz 2\nFall 2006\nDO NOT TURN THIS PAGE OVER AND START THE QUIZ UNTIL YOU\nARE ASKED TO DO SO.\nGuidelines:\n1. Show all your work on the sheets included in this stapled document.\n2. Use partial credit to your advantage. If you're running short on time, solve algebraically and then\nsolve numerically (plugging in numbers) later.\n3. If there is not much space given for you to provide an answer, we want you to be brief.\n4. You may not need to use all the information given (e.g., dimensions) to reach your conclusions.\n5. Enjoy your dark chocolate before getting started! It lowers blood pressure (JAMA, 2003), contains\nantioxidants (Nature, 2003), and supposedly helps neural synapses responsible for memory to fire\nfaster (Nature Health, 2003).\nNAME (PRINTED):\nI agree that this document represents my own independent work on this quiz, using only my own brain, my\nallowed crib sheet of equations and notes, and my pen / pencil / calculator / protractor / compass / ruler /\nsliderule.\nSIGNATURE:\nGOOD LUCK!\n\n1. You and your labmate have been given a joint project by your UROP advisor. He has asked you both\nto measure all the elements of the stiffness tensor Cijkl of two new proteins he has crystallized and is\nconsidering for use in a flexible, organic integrated circuit that must withstand mechanical bending.\nAnother student has already used x-ray diffraction to determine the crystal structure of the proteins:\nprotein A exhibits a tetragonal unit cell, whereas protein B exhibits an orthorhombic unit cell. Your\nlabmate says, \"Let's each measure the elastic constants Cijkl of one protein. Which one do you want\nto do, A or B?\"\nFigure 1: (a) Tetragonal; (b) Orthorhombic unit cells.\nUnder the assumption that you'd like to spend as little time as possible on this project, what is your\nanswer? Explain concisely, but as fully and accurately as possible, using the concepts discussed in\n3.032.\n2. Poly(dimethylsiloxane) or PDMS is a crosslinked elastomer that is commonly used to build opti\ncal/electronic/biomedical devices via soft lithography (borrowing from microelectronics processing\napproaches to make flexible, patterned surfaces). The glass transition temperature of pure PDMS is\n-120oC, and crosslinking can be induced by exposure to UV light.\nAt molecular weights on the order of 106 g/mol or degree of polymerization (DP) ≈ 60, PDMS is\nsaid to exhibit a viscoelastic response with Young's elastic modulus E reported to be about 2 MPa for\nshort times / high strain rates. At very low molecular weights (∼102 g/mol) or DP, PDMS acts as a\nNewtonian fluid.\n(a) Briefly discuss why it is confusing that PDMS is widely described as a rubber elastic polymer,\nbut is also widely reported to exhibit measurable elastic moduli E.\n\n(b) Propose an experiment you would try to assess whether PDMS is best described as a hyperelastic\nor a linear viscoelastic material.\n3. A jewelery maker has created a die that she is using to form a new cufflink made of stainless steel.\nFrom matweb.com, she knows that the yield strength of this particular stainless steel (AISI 304) σy is\nabout 200 MPa, the elastic modulus E is about 200 GPa, and the Poisson's ratio ν is about 0.33. She\nneeds to know how much stress to apply to the metal slab to reduce the thickness to 3 mm, the cufflink\nthickness.\nThe die is a simple channel that does not constrain the metal in the x-direction, and the channel is well\nlubricated so that all frictional forces and stresses along the channel walls can be ignored.\nFigure 2: Die in which stainless steel slab of initial thickness 6 mm will be subjected to a normal stress σzz.\n(a) State all the components of the stress tensor σij that exist in the stainless steel slab under that\napplied stress. Be sure to note components that are identically zero.\n(b) Which normal strain components εii are zero, and why?\n\n(c) Treating the stainless steel as an isotropic continuum, use your answers in (a) and (b) to express\nthe nonzero stresses in terms of elastic constants and σ. Assume the applied stress in the z-\ndirection σzz = σ, some constant value.\n(d) What is the magnitude (value in [Pa]) of the stress required to permanently deform the stainless\nsteel according to the Tresca criterion of yielding?\n(e) What is the magnitude (value in [Pa]) of the stress required to permanently deform the stainless\nsteel according to the von Mises criterion of yielding?\n(f) If you were her, which criterion would you use to make your decision about how much stress to\napply, and why?\n\n(g) She has tacitly assumed that the yield criterion that tells her the stress required to initiate plastic\ndeformation is the same stress she'll need to compress the stainless steel to the desired thickness\nof 3 mm.\nDraw a uniaxial stress-strain response that shows how she thinks stainless steel deforms both\nbefore and after yielding, as quantitatively and as accurately as possible.\n(h) Her available instruments are not capable of applying the required stress σ that you computed\nabove. Describe one way you would modify the material or the process in order to reduce\nthe stress σ required to initiate plastic deformation, and why that mechanism is likely to be\nsuccessful.\nEND OF QUIZ 2\n\nUSE THIS PAGE FOR EXTRA PROBLEM SOLVING AS REQUIRED."
    },
    {
      "category": "Resource",
      "title": "q3_06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/6f429d2ce5924f14d1c10effdfd2b4f1_q3_06.pdf",
      "content": "3.032 Quiz 3\nFall 2006\nDO NOT TURN THIS PAGE OVER AND START THE QUIZ UNTIL YOU\nARE ASKED TO DO SO.\nGuidelines:\n1. Show all your work on the sheets included in this stapled document.\n2. Use partial credit to your advantage. If you're running short on time, solve algebraically and then\nsolve numerically (plugging in numbers) later.\n3. If there is not much space given for you to provide an answer, we want you to be brief.\n4. You may not need to use all the information given (e.g., dimensions) to reach your conclusions.\n5. Enjoy your dark chocolate truffle before getting started! It lowers blood pressure (JAMA, 2003),\ncontains antioxidants (Nature, 2003), and supposedly helps neural synapses responsible for memory\nto fire faster (Nature Health, 2003).\nNAME (PRINTED):\nI agree that this document represents my own independent work on this quiz, using only my own brain, my\nallowed single crib sheet of equations and notes, and my pen / pencil / calculator / protractor / compass /\nruler / sliderule.\nSIGNATURE:\nGOOD LUCK!\n\n1. I am often reminded, and with good reason, that MIT students should not be treated like \"brains on\nsticks\". Fair enough, but let's consider for a moment the mechanical consequences of this mental\npicture.\nMy first impulse is to wonder what such a stick should be made of, so that it should not buckle under\nthe weight of a human brain (mass = 1.4 kg). Let's assume the stick is stuck firmly in the ground\n(clamped), is 180 cm in height (approximately 6'), and is cylindrical in cross-section with the radius\nof a rat femur (1.9 mm; Horcajada et al., J. Endocrin. 165: 2000. Strangely, much easier to find\ndocumented rat femur radii than human femur radii.)\n(a) What are the magnitudes of all the reaction forces and moments at the bottom of the brain-stick?\nBe sure to include even those reaction forces and moments that are equal to zero, and state as\nsuch.\n(b) What is the minimum Young's elastic modulus E that this brain-stick material must exhibit so\nthat it remains stable under the prodigious weight of the typical brain?\n(c) Given this requirement, what material do you suggest the brain-stick comprise? There are several\npossible answers, and yours should be well justified by your data and the intended application.\nMaterial cost for the brain-stick is not a constraint, as brains are invaluable.\n2 Brain.\nFigure by MIT OpenCourseWare. Adapted from http://upload.wikimedia.org/wikipedia\n/commons/6/6d/Brain_stem_normal_human.svg. Courtesy of Patrick J. Lynch, medical\nillustrator and C. Carl Jaffe, MD, cardiologist.\n\n(d) Motivated by the aesthetics of the human body, I decide to make these sticks of 7075 T6 alu\nminum alloy rod with a radius of 6 mm (about that of the human spinal cord). I then realize that,\nbecause I can only fit so many brain-sticks in a lecture hall, I'll probably be making cyclic use\nof these sturdy brain-sticks, taking off a tired brain and putting on a fresh brain once per week.\nLuckily, I know the steady-state crack growth behavior of this alloy under these conditions, as\nindicated in the graph below.\nFigure 1: Crack growth per fatigue cycle as a function of ΔK for 7075 T6 aluminum.\nWhat is the value of R for this cyclic loading?\n(e) What are the values of C and m that characterize the steady-state crack growth for this 7075 Al\nunder this R? Be sure to include units!\nA\nl\ncr\nac\nk g\nrowt\nh.\nFigure by MIT OpenCourseWare.\n\n(f) I decide I can visually inspect each brain-stick to detect cracks on the surface that are about 100\nμm in length. For the cyclic stress involving one brain per brain-stick, am I in the steady-state\ncrack growth regime?\n(g) Since I did not acquire these da/dN vs. ΔK data myself, I decide to figure out if I need a safety\nfactor by measuring the fatigue life of one such aluminum brain-stick for a stress range of 1000\nMPa. For how many lecture weeks can I use each brain-stick under this loading scheme before\nI should retire it for fear of fatigue failure?\n(h) As the brain-stick is made of 7075 Al and is under cyclic axial loading, how do you expect the\nfatigue failure surface to appear?\n(i) This material is already an alloy, but I want to further extend the fatigue lifetime of the brain-\nstick. Briefly but completely describe two options to improve the fatigue life of this specific\nalloy (i.e., further alloying is not an option).\n\n(j) Given that I'm less than 180 cm tall and will have a tough time securing brains to the tops of\nthese brain-sticks, let's take a different tack. It may be easier for the brains if they are stuck onto\na wooden beam suspended from the ceiling by wires on each end, a sort of bench that can be set\nup easily in all lecture halls. The brains will be equally spaced, three to a bench, as shown.\nFigure 2: Brain bench: A wooden beam (1.5 m x 1 m x 0.25 m) suspended at each end by wires, along\nwhich 3 brains can be spaced equally. Brain graphic source: science.howstuffworks.com/brainport.htm\nDetermine the reaction forces at the ends of the bench. If the suspension wires are made of hot-\nrolled AISI 1020 steel with a true (tensile) fracture strength of 800 MPa, what is the minimum\nwire diameter I can use for this purpose? The density of wood is approximately 900 kg/m3, and\nbeam dimensions are given in the figure caption.\n(k) Determine the shear force and bending moment diagram for this wooden beam, using your\nmethod of choice to find the magnitude of V and M at end points, transition points, and min\nima/maxima along the beam length. The weight of the wooden beam should not be neglected,\nbut partial credit will be given if you do neglect it.\nBrain\n.\nFigure by MIT OpenCourseWare. Adapted from http://upload.wikimedia.org/wikipedia\n/commons/6/6d/Brain_stem_normal_human.svg. Courtesy of Patrick J. Lynch, medical\nillustrator and C. Carl Jaffe, MD, cardiologist.\n\n2. In addition to predicting the mechanical responses of linear viscoelastic materials like amorphous\npolymers, springs and dashpots can be used to created models of creep and recovery in crystalline\nmaterials.\n(a) Although springs and dashpots are used to predict the behavior of amorphous polymers and\ncrystalline materials in response to mechanical loading, they are predicting two very different\nways of dissipating mechanical energy. Explain the difference, precisely but concisely, in terms\nof elasticity, plasticity, and atomic / molecular mechanisms.\n(b) Below is a model that accurately captures the creep and recovery response of several micro\ncrystalline materials. For a step-stress applied at t=0 and removed after a long time t=t1 >> 0,\ndraw how strain in the microcrystalline material evolves as a function of time, up to times much\ngreater than t1 (i.e., tending toward infinity).\nFigure 3: Rheological model that is predictive of\n\nFigure by MIT OpenCourseWare.\ncreep in microcrystalline materials.\nYour answer must be in terms of the model's spring and dashpot values Ei and ηi, and you must\nindicate the magnitude of strain at:\n- t = 0+ (i.e., just after the stress is applied);\n- t = t1- (i.e., right before the stress is removed),\n- t = t1+ (i.e., just after the stress is removed), and\n- t = inf.\nCr\nee\np\n\nmo\ndel.\n\n(c) Ice is a crystalline material that creeps appreciably, especially under the high stresses and po\ntentially high temperatures characteristic of polar ice caps and glaciers. Consider a portion of a\npolar ice cap under an in-plane compressive stress of 10 MPa at -50oC. What is the maximum\nshear stress imposed on the ice by this compressive stress state?\n(d) The shear elastic modulus G of ice is about 3 GPa. Referring to the deformation mechanism\nmap below, what is the (shear) strain rate dε/dt we would expect this ice block to exhibit?\nFigure 4: Deformation mechanism map of pure ice.\nIce deformation map.\nFigure by MIT OpenCourseWare.\n\n(e) Assuming that the ambient temperature and stress state remain fixed, how do your propose to\nslow the flow of this polar ice cap? Your answer should include consideration of the dominant\nand other deformation mechanisms you know to be operative for this ice.\nEND OF QUIZ 3 AND OF YOUR 3.032 EXPERIENCE. HAVE A RELAXING AND FUN IAP!\n\nUSE THIS PAGE FOR EXTRA PROBLEM SOLVING AS REQUIRED.\n\nUSE THIS PAGE FOR EXTRA PROBLEM SOLVING AS REQUIRED."
    },
    {
      "category": "Resource",
      "title": "lab1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/00f1469de2860265f50d50b65f41a980_lab1.pdf",
      "content": "3.032 FALL 2007\nMECHANICAL BEHAVIOR OF MATERIALS\nLABORATORY EXPERIMENT 1\nStress Transformations\nand Pressure Vessels\nPreLab Questions:\n1. What direction experiences the largest normal stress for a\npressurized cylindrical vessel and why?\n2. What raw data is experimentally measured using a strain gauge\nand how is it converted into strain?\n\nI. Introduction\nPressure vessels are typically cylinders with sealed ends designed to\nwithstand large changes in internal pressure without failing catastrophically. An\nexample of a well-designed pressure vessel is a metal (aluminum or stainless\nsteel) beverage can, which is pressurized to maintain carbonation of the\nbeverage. In this experiment, you will learn how to measure strains quantitatively\nduring internal and external deformation of such pressure vessels, and to\ncalculate from these strains the principal stresses of the cylindrical pressure\nvessel. Other examples of pressure vessels are given below :\nFigures of pressure vessels removed due to copyright restrictions.\nliquified natural gas tanker\nAlaska pipelines\nsubmarines\n3.032 FALL 2006\nLABORATORY 1\n\nII. Objectives\nThe objectives of this experiment are to:\n1. Instrument a pressure vessel with strain gages.\n2. Measure strain as a function of internal loading (pressurization) for\nboth aluminum and steel beverage cans, and estimate the critical\ninternal pressure for each can type.\n3. Use Mohr's circle to resolve stresses calculated for an angle relative to\nthe principal stress directions onto the principle stress axes.\n4. Compare the principal stress states from analytical formulations of\nstress as a function of pressure and geometry σ(P, r, t) and stress as a\nfunction of mechanical properties and strain σ(E, ε).\n5. Measure the force-displacement response and critical buckling load of\nunpressurized vessels under external loading (uniaxial compression).\n6. Compare the experimental and theoretical buckling loads for a\npressure vessel that is not infinitely long compared to its diameter.\n3.032 FALL 2006\nLABORATORY 1"
    },
    {
      "category": "Resource",
      "title": "lab2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/316bd7026fb717651120e800861874aa_lab2.pdf",
      "content": "3.032 MECHANICAL BEHAVIOR OF MATERIALS\nLABORATORY EXPERIMENT 2\nOrigins of Elasticity and Plasticity :\nThe Bubble Raft\nPreLab Questions:\n1. Explain the mathematical form of a typical interatomic potential\nand the molecular origins of each term.\n2. Explain what a bubble raft is and how it will be used to study\nelasticity and plasticity.\n3.032 MECHANICS OF MATERIALS FALL 2007\n\nI. Introduction\nThe elastic (reversible) and plastic (irreversible) behavior of materials can be described\nby mechanical properties such as elastic moduli (E) and yield stress (σy).\nThese\nmechanical properties quantify the average behavior of materials that are idealized as\nsemi-infinite blocks with no underlying microstructure, or a continuum. However, elastic\nand plastic properties clearly derive from the arrangement and interaction of atoms\nand/or molecules that comprise the material. If you deform a material there is a change\nin the internal energy between atoms, the interatomic potential U(r), where r is the\ndistance between atom centers. The interatomic potential is the summation of attractive\nand repulsive forces between atoms and characterized by the Lennard-Jones Equation:\nm\nn\n-A\nB\nU(r)\nr\nr\n=\n+\nThe force felt between atoms is related to the derivative of the interatomic potential and\nthe elastic modulus is related to the second derivative of the interatomic potential.\nIn this laboratory experiment, we will model and measure the atomistic and molecular\norigins of elasticity and plasticity. By understanding the fundamental mechanisms of\ndeformation, we will be able to predict continuum level mechanical properties, and to\nsuggest atomistic changes to alter these mechanical properties.\nIn 1947, years before the transmission electron microscope had been developed to\nobserve materials at atomic length scales, Prof. W. Bragg of the Cavendish Laboratory\nin Cambridge University, UK, conceived of modeling metal crystals via rafts of bubbles.\nLegend has it that this idea occurred to him while pouring oil into his lawn mower, when\nhe noticed that the bubbles formed in this viscous solution easily formed closely packed\nrafts that resembled the close-packed {111} plane in crystals. He and his graduate\nstudents created rafts in glycerine/soap solutions, simulating defect-free metal crystals,\nand measured the interbubble potential and elastic and plastic properties of this model\nmetal. It turns out that small bubbles floating on a soap solutions have the same forces\nbetween them as atoms in a metal and the interbubble potential is equivalent to the\ninteratomic potential. Having characterized the atomistic and continuum level behavior\nof this model metal, Bragg et al. later used the bubble raft to consider how defects\nimpact mechanical properties of crystals1.\n1 Bragg, L., & Nye J.F., (1947). A Dynamical Model of a Crystal Structure. Proc. R.\nSoc. Lond. Ser. A, 190 (1023), 474-481.\nII. Objectives\nThe objectives of this experiment are to:\n1. Create a perfect single crystal model via a soap bubble raft and an alternative\nbubble raft.\n2. Determine how solution density and internal bubble pressure affect the\nenergetics (interbubble potential) of the model crystal.\n3. Compare the atomistic and continuum interpretations of elastic and plastic\nbehavior in the model crystal.\n3.032 MECHANICS OF MATERIALS FALL 2007\nLABORATORY 2\n\n4. Measure and compare the continuum level elastic and plastic properties of the\nmodel bubble and the alternative bubble raft.\n3.032 MECHANICS OF MATERIALS FALL 2007\nLABORATORY 2\n\nEquation Sheet for 3.032 Lab 2:\nOrigins of Elasticity and Plasticity\nVariables:\nT\n= surface tension (0.023 N/m)\nρsolution\n= density of surrounding fluid\ng\n= gravitational constant\nR\n= bubble radius\nr\n= distance between bubble centers\nThe Bubbles:\nIn order to simplify the final expression we introduce Laplace's Constant, a\ng\nT\na\nsolution\n!\n=\nIn order for bubbles to behave like atoms in a crystal, internal bubble pressure (Pint)\nmust be greater than the hydrostatic pressure acting on the bubble (Phydro).\nPint>Phydro\n(1)\nWhere\nint\n2T\nP\nR\n=\n(2)\nand\nPhydro = !solutiongR\n(3)\nSubstituting equation (2) and (3) into equation (1) gives\ngR\nR\nT\nsolution\n!\n>\nor\n<\n= a\nR\n!\n(4)\n3.032 MECHANICS OF MATERIALS FALL 2007\nLABORATORY 2\n\nBubble Potentials:\nThe attractive potential between soap bubbles of the same size is\n[\n]\n( )\n-\nattr\nsolutiong\nU\nB Z\nR\nA\n!\n\"\n#\n\"\n$\"\n$\n%\n&\n= '\n(\n=\n)\n*\n+\n,\n-\n(5)\nThe repulsive potential between soap bubbles of the same size when in contact is\n)\n(\n)\n(\n!\n\"\n\"\n#\n\"\n$\n=\ng\nR\nU\nsolution\nrep\n(6)\nCombining equations (5) and (6) to get the full form of the bubble potential\n[ ]\n!\"\n!#\n$\n%\n&\n'\n+\n(\n)\n*\n+\n,\n-\n'\n=\n)\n(\n)\n(\n.\n.\n/\n.\n.\n/.\n/\n.\n.\ng\nR\nAK\ng\nR\nU\nsolution\nsolution\n(7)\nWhere\nB = buoyancy force\nZ = height of solution surface above that at\ninfinity around the second bubble\nα = R/a, ratio of bubble radius to Laplace\nconstant\nβ = b/R = dimensionless radius of ring contact\nρ = r/R = ratio of distance between bubbles to\nbubble radius\nA = constants based on boundary conditions\nK0[x] = zeroth order modified Bessel function\nof the second kind.\nHint: In Mathmatica use \"BesselK[0,x]\" or the Bessel function can be approximated as\nFigure 1: Effect of bubble on the\ncurvature of the soap solution\n)\n(\n>>\n!\n\"\nx\nfor\nx\ne\nx\nK\nx\n#\nFigure 2: Modified Bessel functions\nof the second kind\n3.032 MECHANICS OF MATERIALS FALL 2007\nLABORATORY 2\nC\nu\nrvature w/bubble.\nFigure by MIT OpenCourseWare.Modified 2nd bessel fns.\nK\nFigure by MIT OpenCourseWare.\n\nα\nβ\nA\n0.05\n0.056870 0.0016178\n0.10\n0.115020 0.0066280\n0.15\n0.172800 0.0150075\n0.20\n0.230270 0.0267946\n0.25\n0.287280 0.0420500\n0.30\n0.343550 0.0608386\n0.35\n0.398760 0.0832360\n0.40\n0.452560 0.1093190\n0.45\n0.504570 0.1391430\n0.50\n0.554440 0.1727460\n0.55\n0.601870 0.2101400\n0.60\n0.646600 0.2512930\n0.65\n0.688430 0.2961180\n0.70\n0.727240 0.3444930\n0.75\n0.762980 0.3962520\n0.80\n0.795650 0.4511810\n0.85\n0.825310 0.5093600\n0.90\n0.852040 0.5695130\n0.95\n0.875980 0.6323320\n1.00\n0.897270 0.6971610\n1.05\n0.916060 0.7636470\n1.10\n0.932500 0.8314080\n1.15\n0.946770 0.9001340\n1.20\n0.959000 0.9693830\n1.25\n0.969350 1.0388100\n1.30\n0.977970 1.1080700\n1.35\n0.984970 1.1767200\n1.40\n0.990500 1.2449000\n1.45\n0.994660 1.3109600\n1.50\n0.997560 1.3758200\nFigure 3: β and A for different values of α\n3.032 MECHANICS OF MATERIALS FALL 2007\nLABORATORY 2\n\nPendulum Device:\nForce (F) on pendulum from mass (m)\nm x\nF\nh\n=\ng\nwhere\nx = distance out on lever arm\nh = height of lever arm\nNote: This is used to calibrate\npendulum\nFigure 4: Pendulum\nStress (σ) on bubble raft\nσ = F/w\nwhere\nF = force exerted on pendulum by the bubbles\nw = width of bubble raft against flat\nNote: Because the raft is 2D, stress here will be in N/m instead of the usual N/m2\n3.032 MECHANICS OF MATERIALS FALL 2007\nLABORATORY 2"
    },
    {
      "category": "Resource",
      "title": "lab3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/2ee729c4f6b76290d431354c8a299267_lab3.pdf",
      "content": "3.032 MECHANICAL BEHAVIOR OF MATERIALS\nFALL 2007\nLABORATORY EXPERIMENT 3\nPlastic deformation\nfrom the micro- to nanoscale\nPreLab Questions:\n1. Name 2 ways in which instrumented indentation is different from\nuniaxial mechanical testing of materials.\n2. Explain the physical meaning of a material's \"hardness\" in words.\n\n_____________________________________________\nI. Introduction\nThere are several examples in materials engineering in which materials are available\nonly in small volumes - either because they result from new, expensive and difficult\nprocessing techniques, or because they are designed intentionally to be small in one\ndimension. An example of the latter is a thin film or structural coating. In such cases,\nmechanical properties cannot be quantified easily through uniaxial force-displacement\ntesting of structures (e.g., Laboratory Experiment 1) or stress-strain responses of\nmacroscale materials (e.g., Laboratory Experiment 2). One alternative is mechanical\ntesting based on three-dimensional contact between the sample surface and a rigid\nprobe of known geometry and mechanical properties. In this experiment, you will\nanalyze the contact response of several classes of materials via the simple but widely\nused approach of microscale hardness testing, as well as the more quantitative\ninstrumented indentation testing at the nanoscale. We analyze the data from such\nexperiments using concepts from contact mechanics.\nIn hardness testing, a probe such as a cone-shaped diamond is pushed into a flat,\nwell-polished sample surface to a specific maximum load, held for a specified duration,\nand then retracted from the surface.\nFigure 1. Hardness\nPlastic deformation results in a mark\nindentation for Vickers\n(square pyramid)\n(indentation) in the surface, and\nindenter geometry. Ares is\nmeasurement of the size of that mark\ndetermined by measuring\nindicates the material hardness, which is\nImage removed due to copyright\nthe indentation diagonals.\ndefined as:\nrestrictions. Please see:\nH = Pmax/Ares\n(1)\nhttp://www.imagemet.com/images/hardness2_Result.jpg\nwhere Pmax is the maximum load and\nAres is the projected (2-dimensional)\narea of the indentation that is observed after unloading (residual) via optical microscopy.\nAs shown in Eq. (1), hardness has units of [N/m2], but is not physically equivalent to\nstress because the measured projected area of the indentation is not the actual area\nnormal to the applied load of the 3-dimensional indenter.\nOne of the early applications of hardness was as an approximate measure of the\nyield strength σy of the material. For materials that undergo plastic deformation primarily\nvia slip (e.g., metals for which dislocation motion requires shear stress), it has been\ndemonstrated empirically and by \"slip line theory\" that:\nH ~ 3σy\n(2)\nIn instrumented indentation, the experimental approach is quite similar, but the load P\nand the depth of penetration h of the indenter are measured continuously during loading\nand unloading (Fig. 1). If Pmax < 100 nN or hmax < 100 nm, this is termed\nnanoindentation (but be aware that the term is often used in the literature even when\nthe deformation actually exceeds this range). The result is a load-displacement\nresponse that is similar to that obtained in uniaxial mechanical testing, but the loading is\nmultiaxial and thus more complex to analyze in terms of uniaxial mechanical properties\nsuch as E and σy. Most importantly, the geometry of the indenter dictates that there is a\npower-law relationship between P and h even during elastic deformation, unlike the\nlinear relationship expected for uniaxial testing of a material in the elastic regime.\n3.032 MECHANICS OF MATERIALS fall 2007\nLABORATORY 3\n\n_____________________________________________________________\n__________________________________________________\nHardness can also be calculated from these data according to Eq. (1), but the\nadvantage of this approach is that the actual projected contact area A can be computed\nfrom the P - h response rather than measured for each experiment. For the conical\nindenter used in this experiment:\nA ~ 24.5 (hc)2\n(3)\nwhere contact depth\nhc is given by a semi-\nImages removed due to copyright restriction. Please see:\nempirical equation\nhttp://www.nanoindentation.cornell.edu/pictures/schematic_nanoindenter.gif\nthat accounts for\nhttp://www.nanoindentation.cornell.edu/pictures/DoernerNix_schematic_2.gif\nmaterial sinking in\naround the perimeter\nof the indenter. The\nelastic modulus E is\ninferred from the\ninstantaneous\n(a)\n(b)\nresponse of the\nFigure 1. Instrumented indentation enables measurement of\nmaterial upon\nmechanical properties of small material volumes. (a) Schematic of\nunloading from Pmax:\none type of indenter; (b) Typical load-displacement response, where S =\nunloading stiffness dP/dh, and hc is contact depth. Images from\nhttp://www.nanoindentation.cornell.edu/.\nr\nS\nE\nA(\n)\n!\n=\nch\n(4)\nwhere S= dP/dh|Pmax is the tangent to the unloading portion of the P - h response and is\nalso called stiffness S. The area between the loading and unloading portions of the P -\nh response directly quantifies the amount of work required to plastically deform the\nmaterial Wp, and therefore the yield strength σy can be calculated as a function of Wp.\nNote that instrumented micro- and nanoindentation are used for a range of\npurposes other than mechanical property extraction, including fracture toughness and\nresidual stress determination in physically small samples (e.g., enamel-dentin junction\nof teeth) as well as dislocation nucleation (which requires high stresses and high\ndisplacement resolution).\nII. Objectives\nThe objectives of this experiment are to:\n1. Conduct hardness tests on: an amorphous ceramic (glass); 2 ductile metals, an alloy\n(brass) and a pure metal (copper); 2 polymers (low density polyethylene and\nultrahigh molecular weight polyethylene); and a heat-treated metal for which the\nmicrostructure and mechanical properties vary as a function of distance from the\nsurface (case-hardened steel).\n2. Conduct and analyze nanoindentation as a function of Pmax for two samples: bulk,\npure copper and a thin film of pure copper on silicon. Extract elastic modulus E and\nindentation hardness H from these data.\n3. Explore mechanical properties including elastic, plastic, and fracture behavior for this\nwide range of materials from the micro- to nanoscale. Understand how structure,\n3.032 MECHANICS OF MATERIALS fall 2007\nLABORATORY 3\n\ncomposition, molecular weight and substrate-constraint affect mechanical properties\nmeasured in this way.\n3.032 MECHANICS OF MATERIALS fall 2007\nLABORATORY 3"
    },
    {
      "category": "Resource",
      "title": "lab4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/523141c4a4ef26e0280caf99cd0cdd61_lab4.pdf",
      "content": "3.032 MECHANICAL BEHAVIOR OF MATERIALS\nFall 2007\nLABORATORY EXPERIMENT 4\nStructural Origins of the Mechanical\nProperties of Materials\nPreLab Questions:\n1. We are testing several materials under identical conditions (strain\nrate, maximum load, environment). Why must we note the\ndimensions of each sample to compute and compare mechanical\nproperties among these materials?\n2. How do true stress and true strain differ from engineering stress and\nengineering strain, in terms of both physical meaning and equations?\nNOTE:\n- Bring a calculator.\n3.032 Mechanical Properties of Materials\nLABORATORY 4\n\nI. Introduction\nThe uniaxial tensile and compression tests are one of the simplest and most widely\nused experiments to characterize the mechanical properties (e.g., strength, stiffness,\nductility, and toughness) of a material. The engineering stress vs. engineering strain\ndata obtained from such tests have direct design implications, and thus uniaxial tension\nand compression tests are used routinely to compare the mechanical properties of\ndifferent materials, to assist in the development of new materials, and for quality control.\nRelevant definitions and equations:\nIn uniaxial testing, typically the displacement is controlled at a desired rate, and the\ndisplacement and resulting load are recorded continuously. The load is measured via a \"load\ncell\" which is in fact a series of strain gages. For precise measurements of mechanical\nproperties, strain gages are fixed to the \"gage section\" of the specimen; for less precise\nmeasurements, the engineering strain is inferred directly from the normalized change in\ndisplacement:\nεe = ∆L/Lo\n\n(1)\n\nwhere ∆L is the measured displacement and Lo is the initial gage length of the sample.\nEngineering stress can be calculated directly from the measured load P as:\nσe = P/Ao\n\n(2)\n\nwhere Ao is the initial cross sectional area of the sample (area normal to the loading direction).\nHowever, the true stress and strain differ from these engineering expressions during plastic\ndeformation, due to the continuous change in cross-sectional area and conservation of material\nvolume. True stress and strain are related directly to engineering stress and strain as:\nεt = ln (1 + εe)\n(3)\nσt = σe (1 + εe)\n(4)\nBy determining specific mechanical properties from the stress-strain response, materials can be\ncompared directly without reference to geometry. For example, resilience, or the capacity of a\nmaterial to elastically absorb energy, is quantified by the modulus of resilience UR:\nUR = 1⁄2 σyεy = 1⁄2 σy*[σy/E] = σy\n2/2E\n(5)\nwhich is just the strain energy density (area under the elastic portion of the stress-strain curve).\nSimilarly, the toughness, or the capacity of a material to plastically absorb energy, is quantified\nby the modulus of toughness UT:\nUT ~ (σu + σy)/2 * εf\n\n(6)\n\nwhich is a crude estimate of the energy or total area under the plastic portion of the engineering\nstress-strain curve. Thus, toughness includes both strength and ductility. Finally, strain\nhardening is a measure of the incremental resistance to plastic deformation after yielding.\nAlthough the strict definition of the strain hardening exponent n in terms of true stress and true\nstrain is:\nσt = Kεt\nn\n\n(7)\n\n(where K is an empirical value called the strength coefficient) and n is determined as the slope\nof the log(σt) vs. log(εt), the degree of strain hardening is readily apparent from the engineering\nstress-strain curve as the difference between the yield stress and maximum stress.\nIn this lab, you will compare the bulk mechanical properties of several classes of\nmaterials, measured via uniaxial mechanical testing. These materials include pure\nmetals and alloys, ceramic, polymers, and natural composites.\n3.032 Mechanical Properties of Materials\nLABORATORY 4\n\nII. Objectives\nThe objectives of this experiment are to:\n1. Gain experience in uniaxial testing of a wide range of materials.\n2. Calculate the relevant elastic, plastic, and fracture properties of these materials from\nthe stress-strain responses.\n3. Compare elastoplastic properties measured under uniaxial loading to those\npredicted from local surface tests (hardness and indentation).\n4. Interpret these results in the context of the nano- to micro- to macroscopic\nmechanisms of deformation.\n3.032 Mechanical Properties of Materials\nLABORATORY 4"
    },
    {
      "category": "Lecture Notes",
      "title": "lec1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/ee4f4c370bbb3d2a16f0fbfd80ebe3d0_lec1.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nI. TEACHING TEAM\nInstructors\nProf. Krystyn J. Van Vliet\n\nProf. John B. Vander Sande\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nII. WHAT AM I LEARNING?\nA. Lectures\n\nWeek\nDay\nDate\nL#\nTopic\nReading in Course Reader (see TOC)\n\nW\n09.05.07\nIntroduction\n\nF\n09.07.07\nForce distributions\nHibbler 1; 10-15; B/L 1-21 & AppD\nM\n09.10.07\nDeformation under force\nB/L 10.1 439-447 & ApE\n\nW\n09.12.07\nStress distributions in materials\nB/J 4 271-301\n\nF\n09.14.07\nStrain and stress\nB/L 2.1 69-77; B/L 6.1 250-254\nM\n09.17.07\nPressure vessels\nB/L 221-227\n\n09.18.07\n\nLAB 1\n\nW\n09.19.07\nStress transformations\nB/L 5.1-5.4\n\n09.20.07\n\nLAB 1\n\nF\n09.21.07\nStress transformations: 2D - 3D\nB/L 5.1-5.4\n\nM\n09.24.07\n\nSTUDENT HOLIDAY\n\nW\n09.26.07\nStress transformations: 3D\n\nF\n09.29.07\nElasticity\nNye\n\nM\n10.01.07\nContinuum linear elasticity\nA/J 3 27-35; M/C 2.8\n\nW\n10.03.07\nLinear elasticity\nM/C 2.8\n\nF\n10.05.07\n\nQUIZ 1\n\nM\n10.08.07\n\nMIT HOLIDAY\n\nT\n10.09.07\n\nMIT HOLIDAY\n\n3.032 Mechanical Behavior of Materials\nFall 2007\n\nW\n10.10.07\nLinear elasticity\nA/J 3 36-44; 58-60\n\nF\n10.12.07\nSuperelasticity\nH 21 372-375\nM\n10.15.07\nNonlinear elasticity\nH 11 182-185\n\nT\n10.16.07\n\nLAB 2\n\nW\n10.17.07\nViscoelasticity\nH 15 247-251\n\nR\n10.18.07\n\nLAB 2\n\nF\n10.19.07\nRubber elasticity\nM/C 2.12 102-107\nM\n10.22.07\nContinuum plasticity\nH 6 80-93\n\nW\n10.24.07\nPlasticity in crystals\nCall 8.3 238-243, M/C 4.2 206-207\n\nF\n10.26.07\nPlasticity in crystals\nH9 139-147; 158-166\nM\n10.29.07\nPlasticity in amorphous materials\nM/C 8.4.2 420-425\n\nW\n10.31.07\nControlling plasticity onset\nH 12 188-202; Call 8.9 250-256\n\nF\n11.02.07\nControlling plasticity onset\nCall 11.10 455-460\nM\n11.05.07\nPlasticity at surfaces\nH 4 62-67\n\nT\n11.06.07\n\nLAB 3\nH3 39-49\n\nEGs of engineering elastoplastic\n\nW\n11.07.07\ndefmn mechs\n\nR\n11.08.07\n\nLAB 3\n\nF\n11.09.07\n\nQUIZ 2\n\nM\n11.12.07\nVETERANS' DAY\n\nW\n11.14.07\nTime-dependent plasticity\nM/C 13 541-546\n\nF\n11.16.07\nTime-dependent plasticity\n\n3.032 Mechanical Behavior of Materials\nFall 2007\n\nM\n11.19.07\nCreep deformation mechanisms\nM/C 13 553-570\n\nW\n11.21.07\nDesigning against creep\n\nR\n11.22.07\n\nTHANKSGIVING HOLIDAY\n\nF\n11.23.07\n\nTHANKSGIVING HOLIDAY\n\nM\n11.26.07\nContinuum fracture\nH 14 227-233; 240-241\n\nW\n11.28.07\nContinuum fracture\n\nF\n11.30.07\nFracture in crystals\nM/C 8 381-384; 400-412\n\nM\n12.03.07\nFracture in crystals\n\nT\n12.04.07\n\nLAB 4\n\nW\n12.05.07\nFracture in amorphous materials\n\nR\n12.06.07\n\nLAB 4\n\nF\n12.07.07\nFatigue\nM/C 14 592-596; 602-615\nM\n12.10.07\nFatigue\nM/C 14 592-596; 602-615\n\nW\n12.12.07\nFatigue\n\nR\n12.13.07\n\nReading Day\n\nF\n12.14.07\n\nReading Day\n\nM\n12.17.07\n\nEXAM WEEK (QUIZ 3 THIS WEEK)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nImages removed due to copyright restrictions. Please see:\nhttp://commons.wikimedia.org/wiki/Image:CocaCola_C2.jpg\nFig. 2 in Bragg, Lawrence, and Nye, J. F. \"A Dynamical Model of a\nCrystal Structure.\" Proceedings of the Royal Society of London,\nSeries A, 190 (September 1947): 474-481.\nFig. 1b in Tweedie, Catherine A., and Van Vliet, Krystyn J. \"On the\nindentation recovery and fleeting hardness of polymers.\" Journal of\nMaterials Research 21 (December 2006): 3029-3036.\nAny diagram of a tensile testing machine, such as\nhttp://www.biomed.metu.edu.tr/courses/term_papers/mechanical\ncharacterisation_sonat_files/image004.jpg\n\nLabs are conducted in groups and written up individually. The first recitation will outline the lab activities\nand schedule in detail. In short, you will attend lab 9am-1pm on EITHER Tuesday or Thursday of a\ngiven lab week, as indicated on the 3.032 calendar. You will attend recitation on the day (T or R) that\nyou do not have lab that week.\n\nLab 1: Stress transformations and pressure vessels\n\nWeek of 9/17\nLab 2: Atomistic origin of elasticity\n\nWeek of 10/15\nLab 3: Micro and nanoscale plasticity\n\nWeek of 11/5\nLab 4: Uniaxial mechanical testing\n\nWeek of 12/3\n\nEveryone goes to recitation this Thursday, 10am\nin 3-442.\nB. Laboratory Experiments\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nIII. WHERE CAN I GO TO READ AND LEARN MORE?\nTextbooks\nRequired:\n\n3.032 Course Reader, Mechanical Behavior of Materials\n\nAvailable at CopyTech 3-011 ($63)\n\nRecommended Supplementary*:\n\nHosford, Mechanical Behavior of Materials\n*Note: There are many texts that treat various aspects of mechanical behavior. However, these texts tend to treat\neither the mechanics or the materials perspectives well, rather than integrating the two. Your lecture notes provide\nthis integration, and the Course Reader provides sufficient background material and worked examples from the\n\"best\" textbook for a specific topic. The Hosford text is recommended and heavily cited in the Course Reader, but\nis missing key material covered in the first third of the class.\n\nMIT Server Website\nhere you will find\nthe assigned problem sets and laboratory materials, as well as resources such as material property\ndatabases, practice material for quizzes, and scientific and general-audience articles that include\ncontent related to our class topics.\n\nBookmark the class website,\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nIV. HOW IS MY UNDERSTANDING EVALUATED?\n\nGrading\n1. Breakdown:\nQuizzes (3)\n\n15% each (Fri 10/5; Fri 11/9; TBA on week of 12/17)\nProblem sets (7)\n25% total\nLabs (4)\n\n30% total\n2. Acade mic Honesty: We encourage you to work together on problem sets and lab analysis/discussion.\nHowever, all work turned in must be your own product, as it stands on the submission due date. What\nis cheating?\n-\nDuplication of others' problem set solutions, figures summarizing lab data, or quiz responses is\ncheating.\n-\nFailure to cite sources of ideas and/or facts in your problem sets and laboratory written\nassignments is cheating.\n-\nFalsifying excuses for late / missing assignments or lab participation is cheating.\n-\nBackdating / alteration of submitted documents and false claims that electronic files have been\nsubmitted by the due date are cheating.\nA student who cheats will receive a formal letter in his/her file at the Office of Student Discipline and\nmay be reported to the Council on Discipline. You do not need to cheat to succeed in this class!\n\n3. Who is grading?: Prof. Van Vliet will grade the three quizzes noted above. TA David Fischer will\ngrade problem sets, but students should see Prof. Van Vliet regarding requests for re-grading. Prof.\nVander Sande will grade all pre-lab quizzes and laboratory assignments, and will handle un/excused\nabsences related to the labs.\n\n3.032 Mechanical Behavior of Materials\nDownload from MIT Server\n\n1 km\n10 um\nForce distributions in structures Æ mechanical behavior of materials\nMN bridge span, prior to Summer 2007 collapse\nMicrofilaments of a biological\ncell, prior to cell division\nImages removed due to copyright restrictions. Please see:\nhttp://www.biology.arizona.edu/Cell_bio/tutorials/cytoskelet\non/graphics/microfilament.gif\nhttp://rruff.geo.arizona.edu/OLA/files/SXD/graphite_files/im\nage004.jpg\n0.1 nm\nInteratomic covalent bonding\nof graphite, prior to fracture"
    },
    {
      "category": "Lecture Notes",
      "title": "lec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/b08b5f3dbd3ac755f9035c3adae6bd43_lec2.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nImage removed due to copyright restrictions.\nPlease see http://www.bostonroads.com/crossings/tobin/img2.jpg\nLecture 2 (09.07.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nForce distributions in structures\nExpand stent structure under balloon expansion\nForce on metal strut due to this loading?\nImage removed due to copyright restrictions.\nPlease see\nhttp://www.nhlbi.nih.gov/health/dci/images/stent_lowres.gif\nhttp://www.abbottvascular.com/en_US/content/image/acculink1_lg.jpg\n316L stainless steel arterial stents\n(http://www.abbottvascular.com)\nLecture 2 (09.07.07)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/222911da292c25b77b09b47da533315c_lec3.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nBuckling: Long, thin beam under end-loaded compression\nLecture 3 (09.10.07)\nr\nδmax [m]\nP [N]\nθ = dδ/dx\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nBeam bending: End-loaded cantilever\nLecture 3 (09.10.07)\nImages removed due to copyright restrictions.\nPlease see: Silva, Emilio C. C. M., et al. \"Size Effects on the Stiffness of Silica Nanowires.\"\nSmall 2 (February 2006): 239-243."
    },
    {
      "category": "Lecture Notes",
      "title": "lec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/9a1ef2fb1852adeef982ab21370f6e73_lec5.pdf",
      "content": "Which cross-section do I choose for moment of inertia, I ?\nIn equilibrium, the beam resists any bending due to applied loads, so we choose\nthe cross-section that is perpendicular to the axis of that intended bending:\nP [N]\naxis of bending\n\nWhat is the moment of inertia\n...and why are there multiple Ix in Appendix D?\nStrictly speaking, we mean the area moment of\ninertia, which relates to the resistance of that\narea to bending. It is also called the second\nmoment of inertia or the second moment of\narea about the x-axis, taken over the tiny area\ndA, where y is the distance from the x-axis to\ndA:\nAppendix D from Bedford/Liechti in your 3.032\nCourse Reader (p. 1-28) doesn't annotate this\nwell, and for some cross-sections like a rectangle\ngives Ix and Ix'. Both are area moments of\ninertia, but differ depending on whether they\nassume the x-axis is located along the centroid\n(x') or located at the bottom of the shape (x).\nNeither is \"incorrect\", but if we assume that the\ncross-section is made of a homogeneous\nmaterial, we typically take this moment about the\ncentroid or center of mass. In other words, the Ix'\nin this appendix are the more standard\nexpressions.\nHere is simpler table of centroids and area\nmoments of inertia for solid cross-sections, and\nalso for a hollow cylinder:\n3.032 (2007)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/6e90475e58ce6975b034dab5f48cc2a2_lec7.pdf",
      "content": "r\n3.032 Mechanical Behavior of Materials\nFall 2007\nSTRESS AND STRAIN TRANSFORMATIONS:\nFinding stress on a material plane that differs from the one on which stress is known...\nor \"Why it's easier to remember Mohr's circle\"\nNote: Derived in class on Wednesday 09.19.07.\nForce balance for stress over a face inclined an angle θ with respect to the original (x, y) axes\ngive:\nσx0 x0 = σxx +\nσyy + σxx -\nσyycos2θ + τxy sin2θ\n(1)\nσy0y0 = σxx +\nσyy - σxx -\nσyycos2θ - τxy sin2θ\n(2)\nτx0y0 = - σx - σy sin2θ + τxycos2θ\n(3)\nTaking the derivative of Eq. (1) with respect to θ to obtain the orientation of maximum normal\nstress gives:\ntan2θnormalstress,max = σxx\nτ\n-\nxy\nσyy\n(4)\nand substituting the corresponding sin2θ and cos2θ expressions into Eqs. (1 - 2) to obtain the\nmaximum normal stresses in this 1-2 plane gives:\nσ1,2 = σxx +\nσyy ±\n( σxx -\nσyy )2 + τ2\nxy\n(5)\nwhere, by convention, σ1 ≥ σ2.\nTaking the derivative of Eq. (2) and going through the same process to obtain the orientation\nand magnitude of the maximum shear stresses gives:\ntan2θshearstress,max = -(σxx-σyy)\n(6)\nτxy\nand\nr\nτmax,in-plane =\n( σxx -\nσyy )2 + τ2\nxy\n(7)\nNote that the equations for coordinate transformations of strain (strain transformation equations)\nare completely analogous. For example,\nx0 x0 = xx + yy + xx - yycos2θ + xy sin2θ\n(8)\n\nbut the only thing to note is that this xy is equal to half the engineering shear strain, γxy/2. In other\nwords, if you are given a state of engineering strain for a material body, you have to multiply the\nengineering shear strain components by 2 before using these equations to find the full strain state\non some other plane inclined an angle θ.\nAs you will see in the next class, a very smart engineer named Otto Mohr figured out how to\nrepresent these equations in the shape of a circle, so that one can quickly and graphically locate\nthe orientations and magnitudes of maximum normal and shear stresses / strains!"
    },
    {
      "category": "Lecture Notes",
      "title": "lec13.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/280e4e7a60634a54a4a94650acce94f7_lec13.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nUsing U(r):\nMeasure parameters for U(r) in physical model to predict stresses that are high enough for\nelastic instabilities to occur (e.g., nucleation of defects in crystals).\nLecture 13 (10.10.07)\nHow does stress to\nmove atoms depend\non size of grains in\npolycrystalline\nmetals?\nσii or τij ~ dU/dr\nRaft of soap bubbles with\ninterbubble potential similar to\ninteratomic potential of fcc\nmetals, under distributed force\nof an indenter.\nImages removed due to copyright restrictions.\nPlease see: Fig. 1c in Gouldstone, Andrew, et al. \"Simulation of Defect Nucleation in a Crystal.\" Nature 411 (July 2001): 656\nand\nFig. 1 in Van Vliet, Krystyn J., et al. \"Model Experiments for Direct Visualization of Grain Boundary Deformation in Nanocrystalline Metals.\"\nApplied Physics Letters 83 (August 2003): 1441-1443.\nVan Vliet et al., Nature (2002); Phys Rev B (2003); Phil Mag A (2003)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nUsing U(r):\nMolecular dynamics simulations move atoms according to Newton's Law, F = ma\nwhere F = dU/dr and U = interatomic potential such as L-J potential.\nThin film of aluminum, moving atoms according to U(r) under distributed load of\nspherical indenter. Atom color = atomic coordination number.\nLi, Van Vliet et al., Nature (2003); Phys Rev B (2004)\nLecture 13 (10.10.07)\nCourtesy of Sidney Yip. Used with permission.\n\nElectrospun PEO could be used for filters,\ncomposites, fuel cells, drug delivery, cell\nscaffolds, etc. [Rutledge Group, MIT]\n3.032 Mechanical Behavior of Materials\nFall 2007\nUsing U(r):\nPolymer nanofibers: Do physical and mechanical properties differ from bulk polymers?\nInternal energy inside polymer\nnanofiber increases for fibers of R < 5\nnm.\nCurgul, Rutledge and Van Vliet, Macromolecules (2007, in press)\nImages removed due to copyright restrictions.\nPlease see Fig. 1 and 4 in Curgul, Sezen, et al. \"Molecular Dynamics\nSimulation of Size-Dependent Structural and Thermal Properties of\nPolymer Nanofibers.\" Macromolecules 40 (2007): 8483-8489.\nCourtesy Gregory Rutledge. Used with permission.\n\nCurgul, Rutledge and Van Vliet, Macromolecules (2007, in press)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nUsing U(r):\nPolymer nanofibers exhibit lower glass transition temperature and elastic deformation up to\n5% normal strain.\nLecture 13 (10.10.07\nImage removed due to copyright restrictions.\nPlease see Fig. 7 and 10, and Eqn. 1 in Curgul, Sezen, et al.\n\"Molecular Dynamics Simulation of Size-Dependent Structural\nand Thermal Properties of Polymer Nanofibers.\"\nMacromolecules 40 (2007): 8483-8489.\n0.05\n0.1\n0.15\n0.2\n0.25\n0.3\n0.35\nStrain along z\nσzz [MPa]\nεzz\nE ~ 750 MPa"
    },
    {
      "category": "Lecture Notes",
      "title": "lec14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/a862820c96d66771e432cac60d5c9a02_lec14.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\n14 Pa\nFe3Be\nvery low stress!!\nImage removed due to copyright restrictions.\nPlease see Fig. 11.22 in Hosford, William R.\nMechanical Behavior of Materials. Cambridge,\nEngland: Cambridge University Press, 2005.\nEaust = 525 Pa?\nEmart = 175 Pa?\nSource: Hosford, Mechanical Behavior of Materials. From R.H. Richman in Deformation Twinning, TMS-AIME, 1963.\nLecture 14 (10.12.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nExperiment to measure how long a\nsuperelastic NiTi file could survive\nImages removed due to copyright restrictions.\nrotating/bending fatigue.\nPlease see Fig. 1 and 8a, b in Young, Jeremy M., and Van\nVliet, Krystyn J. \"Predicting In Vivo Failure of\nPseudoelastic NiTi Devices under Low Cycle, High\nAmplitude Fatigue.\" Journal of Biomedical Materials\nResearch B 72B (2005): 17-26.\nSEM micrographs of failed NiTi\nfile show that failure starts from\nthe inside out.\nSource: JM Young and KJ Van Vliet. Predicting in vivo failure of pseudoelastic NiTi devices under low cycle, high\namplitude fatigue. Journal of Biomedical Materials Research Part B: Applied Biomaterials 72B: 17-26 (2005).\nLecture 14 (10.12.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nFluid shear viscosity as measured by parallel plate Couette experiment:\nImage removed due to copyright restrictions.\nPlease see http://content.answers.com/main/content/img/McGrawHill/Encyclopedia/images/CE733900FG0010.gif\nSource: Science and Engineering Encyclopedia (2006 online)\nLecture 14 (10.12.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nτ(t)\nApplied stress\nt\nγ(t)\nLinear elastic solid\nt\nγ(t)\nLinear viscous fluid\nt\nγ(t)\nViscoelastic solid\nt\nγ(t)\nViscoelastic fluid\nt\nAfter Young and Lovell, Introduction to Polymers (1991) & Science and Engineering Encyclopedia (2006 online).\nLecture 14 (10.12.07)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/fd5e701533cf6bf88a1839bc2656d5d7_lec17.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nWorm Like Chain (WLC) model: Often expressed as FLp/kBT = ...\nF\nkBT\nr\n= L\n2 +\n-\np\n⎛\nr ⎞\nLc\n4⎜1-\n⎟\n⎝\nLc ⎠\n⎛-3r 2 ⎞\nexp⎜\n⎟\n⎜\n⎟\n⎝2nb2 ⎠\n⎛2πnb ⎞\n-3/2\n⎜\n⎟\n⎜\n⎟\n⎝\n⎠\ne\n4πr 2\nGaussian distribution function for Freely Jointed Chain of known n and b:\nP(r,n,b)dr\n=\n=\nLecture 17 (10.19.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nSingl\ne-fi\nlame\nnt e\nxten\nsion\n.\nFigure by MIT OpenCourseWare.\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nLecture 17 (10.19.07)\nImages removed due to copyright restrictions.\nPlease see: Fig. 1 in Bustamante, C., et al. \"Entropic Elasticity of Lambda-phage DNA.\" Science 265 (September 1994): 1599-1600.\nand\nFig. 1a and b in Smith, Steven B., et al. \"Direct Mechanical Measurements of the Elasticity of Single DNA Molecules by Using Magnetic\nBeads.\" Science 258 (November 1992): 1122-1126.\n\nλ-DNA (used in 3.034 Lab 3):\n- How long is it (#AA)?\n- How stiff is it (dF/dz)?\n- How many AA in the rigid\nsegments (Lp)?\n- How much force does it take\nto uncoil coiled DNA?\n3.032 Mechanical Behavior of Materials\nFall 2007\nLecture 17 (10.19.07)\nImages removed due to copyright restrictions.\nPlease see: Fig. 2 in Bouchiat, C., et al. \"Estimating the Persistence\nLength of a Worm-Like Chain Molecule from Force-Extension Measurements.\"\nBiophysical Journal 76 (January 1999): 409-413."
    },
    {
      "category": "Lecture Notes",
      "title": "lec20.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/1bd633873707143d7607ffb3b6d08fb6_lec20.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nshear bands (red) forming in\npolycrystalline elemental metal\nwith many line and point defects\nImages removed due to copyright restrictions.\nPlease see:\nhttp://www-geol.unine.ch/03_france/granites/Granites-Thumbnails/3.jpg\nshear bands in granite\n(complex crystal) formed\nunder pressure and\ntemperature\nImage sources: N. Ghoneim (UCLA), osiris.seas.ucla.edu/bottom.html;\nhttp://www-geol.unine.ch/03_france/granites/Granites-Thumbnails/3.jpg\nLecture 20 (10.26.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nImages removed due to copyright restrictions.\nPlease see:\nhttp://www.ornl.gov/info/ornlreview/v38_1_05/images/a17_golf_full.jpg\nhttp://www.csem.caltech.edu/graphics/shear-bands.jpg\nFig. 3 and 4 in Mukai, Toshiji, et al. \"Dynamic response of a Pd40Ni40P20 bulk\nmetallic glass in tension.\" Scripta Materialia 46 (January 2002): 43-47.\nbulk amorphous metals\n(aka, bulk metallic glasses or\namorphous alloys)\n- Yielding via shear banding\n- Yield stress depends on\ncompression vs. tension\nshear bands\nNi-Nb-Sn amorphous metals:\nE\n~ 200 GPa\n(steel)\nσy(compression)\n~ 3 GPa\n(3x steel)\nσy (tension)\n~ 1 GPa\n(steel)\nStrain at failure\n~ 1%\n(glass)\nImage sources: Lu and Liu (Oak Ridge National Lab). www.ornl.gov/v38_1_05/article17.shtml\nE. Pekarskaya and W. Johnson (CalTech). www.csem.caltech.edu/Facilities/tem.html\nData sources: Applied Physics Letters, 82: 1030-1032, (2003); TG Nieh, Bulk Metallic Glasses, Ch. 6.\nLecture 20 (10.26.07)\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nfibrils of polymer\nhydrocarbon chains\naligned within fibril\nrupture of fibrils under\ntensile load\ncrazing in amorphous polymer\nImage sources: http://www.kern-gmbh.de/index_glossar.html?http://www.kern-gmbh.de/kunststoff/service/glossar/crazing.htm;\nLecture 20 (10.26.07)"
    },
    {
      "category": "Lecture Notes",
      "title": "lec21.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/3-032-mechanical-behavior-of-materials-fall-2007/4d447a73d86ca349823bd6eeace9c73b_lec21.pdf",
      "content": "3.032 Mechanical Behavior of Materials\nFall 2007\nsheared\nunsheared\nhalf-plane\ndislocation line\nLecture 21 (10.29.07)\nEdge dislocation\nImage source: Callister, W. D., Materials Science and Engineering: An Introduction\ndirection of motion\nD\niagr\nam of a bulk lat\ntice\nw\nith a screw dislocation on one face and an edge on the adjacent face.\nFigure by MIT OpenCourseWare.\n\nScrew dislocation\nLiterally looks like the threads of a screw\nor a spiral parking garage.\nImage source: Callister, W. D., Materials Science and Engineering: An Introduction\n3.032 Mechanical Behavior of Materials\nFall 2007\nLecture 21 (10.29.07)\nD\niagr\nam of a bulk lat\ntice\nw\nith a screw dislocation on one face and an edge on the adjacent face.\nFigure by MIT OpenCourseWare.\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nHow do we view dislocations?\nEtch pitting: Add corrosive chemicals that preferentially target the defect region\nOther approaches: Silver decoration (ionic crystals), transmission electron\nmicroscopy, X-ray diffraction\nLecture 21 (10.29.07)\nImages removed due to copyright restrictions. Please see: Fig. 2.1\nin Hull, Derek, and Bacon, D. J. Introduction to Dislocations. Boston, MA: Butterworth-Heinemann, 2001.\n\n3.032 Mechanical Behavior of Materials\nFall 2007\nHow do we view dislocations?\n2. Dislocation decoration:\nHeat treat to move impurity atoms to defect sites, then etch to reveal location of impurities (eg, Ag+).\nLecture 21 (10.29.07)\nImages removed due to copyright restrictions. Please see: Fig. 2.5\nin Hull, Derek, and Bacon, D. J. Introduction to Dislocations. Boston, MA: Butterworth-Heinemann, 2001.\n\n3.032 Mechanical Behavior of Materials\nFall 2007\n3. Transmission electron microscopy diffraction\n4. X-ray diffraction\n5. Field ion microscopy diffraction\nLecture 21 (10.29.07)\nImages removed due to copyright restrictions. Please see: Fig. 2.8, 2.13, and 2.14\nin Hull, Derek, and Bacon, D. J. Introduction to Dislocations. Boston, MA: Butterworth-Heinemann, 2001."
    }
  ]
}