{
  "course_name": "Mechanics and Materials II",
  "course_description": "This course provides Mechanical Engineering students with an awareness of various responses exhibited by solid engineering materials when subjected to mechanical and thermal loadings; an introduction to the physical mechanisms associated with design-limiting behavior of engineering materials, especially stiffness, strength, toughness, and durability; an understanding of basic mechanical properties of engineering materials, testing procedures used to quantify these properties, and ways in which these properties characterize material response; quantitative skills to deal with materials-limiting problems in engineering design; and a basis for materials selection in mechanical design.",
  "topics": [
    "Engineering",
    "Materials Science and Engineering",
    "Mechanical Engineering",
    "Solid Mechanics",
    "Engineering",
    "Materials Science and Engineering",
    "Mechanical Engineering",
    "Solid Mechanics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nlabs: 1 session / week, 2 hours / session\n\nTexts\n\nRequired\n\n1. Notes and handouts as provided.\n\n2. Lardner, T. J., R. R. Archer, S. H. Crandall, and N. C. Dahl.\nAn Introduction to the Mechanics of Solids\n. 2nd ed. New York: McGraw-Hill Primis Custom Publishing, 1999. ISBN: 9780072380415. (Or other required\n2.001\ntexts.)\n\nRecommended\n\n3. Dowling, N. E.\nMechanical Behavior of Materials.\n2nd ed. Upper Saddle River, NJ: Prentice-Hall, 1998. ISBN: 9780139057205.\n\n4. Ashby, M. F., and D. R. H. Jones.\nEngineering Materials 1: An Introduction to their Properties and Applications.\n2nd ed. Oxford, UK: Butterworth-Heinemann, 1996. ISBN: 9780750627665.\n\n5. Pratap, Rudra.\nGetting Started with MATLAB(r)\n. Oxford, UK: Oxford Press, 2001. ISBN: 9780195150148.\n\nOf Interest\n\n6. Bowman, Keith.\nMechanical Behavior of Materials\n. Hoboken, NJ: John Wiley & Sons, 2003. ISBN: 9780471241980.\n\nPrerequisites\n\n2.001\nMechanics and Materials I\n\nLaboratory\n\nThe laboratory part of the course puts course material in to practice in (a) experimentally quantifying mechanical performance of structures, (b) determining material properties, (c) selecting appropriate materials for particular applications, and (d) project-mode exploration of mechanical behavior.\n\nThe class will be divided into 3 sections of approximately 15 students each.\n\nThe laboratory experience consists of six laboratory modules in the mode of focused two hour \"recitations\" in mechanical behavior of materials\ncoupled\nwith small \"experimental projects,\" plus a multiple session \"term project\" in which small lab teams of 3-4 students each will conduct independent experimental investigations into the mechanical behavior of engineering materials and structures. Team-based oral presentations of the term project will take place in the last week of labs.\n\nHandouts for each lab module will be distributed at lecture and placed on the course home page before the first lab session of that module.\nStudents are expected to have read the handout prior to lab\n. Each student should bring a calculator to the lab.\n\nAfter completing a given laboratory module, students will write up a concise, but complete, summary of the lab. At the following lab session, the write-up will be turned in to the laboratory instructor for grading, comments and observations; the graded write-up will be returned to the student at his/her next scheduled laboratory session. Policies regarding written laboratory reports will be explained in the first laboratory session.\n\nTopics suitable for the term project vary broadly in nature, and can originate from a variety of sources. A handout with background information on a list of possible topics will be distributed later in the term; in addition, topic areas suggested by students and approved by the respective lab instructors are encouraged.\n\nHomework Assignments\n\nHomework Assignments will usually be handed out on Wednesdays. They will usually be due one week after they are handed out. To receive credit, you must hand in your solutions on the due date, at the beginning of class.\nNo late homework will be accepted\n.\n\nSolutions to the assignments will normally be available in the Lab Instructor's office after 5 p.m. on the due date, and will be placed on the course's webpage. There will be exceptions to this pattern because of tests, Institute holidays, and so on. Graded homework will be available in the Lab Instructor's office approximately one week after the problem set is handed in. While we will make \"solutions\" to the homework available, the benefits which students obtain from their own prior efforts on an assignment will far exceed those obtainable from mere passive review of the efforts of others.\n\nNote:\nWe\nencourage\nstudents to work with each other on the homework assignments, but\nwe do not condone copying\n. Make your own honest collaborative efforts to contribute to the solution (by asking questions, offering suggestions, etc.) and, based on your own understanding, write up the answers in your own words and style. If you worked closely with other students on a given homework assignment and feel that your understanding was substantially influenced by the mutual learning process, you should formally cite the names of those students with whom you worked.\n\nQuizzes, Mini-Quizzes, and Final Examination\n\nThere will be two quizzes during the term, and a final examination at the end of the semester. These will be\nclosed book\n. Students will prepare up to\ntwo (2)\nletter-size pages (2 sheets; 4 sides) of self prepared,\nhandwritten\nnotes (no photo-reductions) for use during each quiz; in addition, these notes will be submitted with the quiz for partial grade-content of that quiz. Up to\nsix\n(6) such pages (6 sheets; 12 sides) may be prepared for the Final Examination.\n\nExcused absences from taking quizzes at the scheduled times\nmust be requested in advance of the quiz\nfrom Prof. Parks. Such requests will be granted only for verifiable and significant reasons.\n\nBrief, 5-10 minute \"mini-quizzes\" will be given during lectures on a roughly weekly basis throughout the term.\n\nTutorials\n\nTutorial sessions will be conducted in the evening, one to two days before each quiz. Precise times and locations will be announced approximately one week in advance. Depending on demand, additional tutorial sessions may also be scheduled during the semester.\n\nEvaluation\n\nThe final course grade will be weighted as follows:\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n15%\n\nQuizzes (2)\n\n30%\n\nMini-quizzes\n\n5%\n\nLaboratory\n\n25%\n\nFinal Examination\n\n25%\n\nTotal\n\n100%",
  "files": [
    {
      "category": "Resource",
      "title": "hw1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/4432b26565dc8e422abaa65123d9b3ea_hw1_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSOLUTION for HOMEWORK NO. 1\nDistributed:\nWednesday, September 10, 2003\nDue:\nWednesday, September 17, 2003\nProblem 1\n30 mm\n5 mm\ny\nx\nSteel: E=208 [GPa]\nP=?\n200 mm\nx1=?\n1 m\nFigure 1: schematic drawing of Problem 1\nThis beam is under bending and shear. Strain gauges are located at the top surface of\nthe beam. On the top surface, there is zero transverse shear. Thus the beam is only in\na stress state due to bending at the location of the strain gauges. We must know how to\ncompute the stress due to a bending moment and relate that stress to the strain in order to\nsolve this problem.\nFirst, the axial stress due to bending is\nπ(x, y) = -M (x)y\n(1)\nI\nwhere I and y on the top of surface of the beam are the following\nbh3\nI = 12\n(2)\nh\ny = 2\n(3)\n\nM can be found via taking a section cut in the beam and balancing the moments. Be\nsure to use proper sign convention\nM(x) = -P(L - x)\n(4)\nRe-write (1) using (2), (3), (4)\nπ(x) = -(-P(L - x))h = 6P(L - x)\n(5)\n2 bh3\nbh2\nThis is in the Linear-Elastic regime so,\nπ(x) = Eσ(x)\n(6)\nRe-write (5) with (6) to get\nσ(x) = 6P (L - x)\n(7)\nEbh2\nWe have two values of strains σ1 and σ2 at positions x1 and x2 so we now have two\nequations (7), (8), with three unknowns x1 , x2 , and P\nσ1 = 6P (L - x1)\n(8)\nEbh2\nσ2 = 6P (L - x2)\n(9)\nEbh2\nThe third equation needed comes from the geometry condition given in the problem\nstatement\nx2 - x1 = 200 × 10-3 = d\n(10)\nNow we just have 3 unknowns and 3 equations so it can be solved anyway you like. One\nwas is shown below\nTo solve for P , combine equations (8), (9), (10)\n6P\n6Pd\nσ1 - σ2 = Ebh2 (x2 - x1) =\n(11)\nEbh2\nNow solve (11) for P , and plug in values. We know\n\nr\nr\nσ1\nσ2\n=\n=\n1200 × 10-6\n900 × 10-6\nthen,\nP = (σ1 - σ2)Ebh2\n6d\nP = 300 × 10-6 · 30 × 10-3[m] · (5 × 10-3)2[m2] · 208 × 109[N/m2]\n6 · 200 × 10-3[m]\n= 39[N ] (12)\nKnowing P we can get the positions of the strain gauges. Solve (8) for x1 .\nEbh2σ1\nx1 = L -\n6P\n= 1[m]\n208 × 109[N/m2] · 30 × 10-3[m] · (5 × 10-3)2[m ] 1200 × 10-6\n·\n-\n6 · 39[N ]\n=\n1 - 0.8 = 0.2[m]\n(13)\nNow get x2\nx2 = x1 + d\n(14)\nx2 =\n0.2 m + 0.2 m = 0.4 m\n(15)\nProblem 2\nThe natural frequency of a simple harmonic oscillator depends on both the stiffness of the\nrestoring (elastic) member in the system and the mass which is being accelerated/decelerated.\nFor a rigid mass m connected to a massless spring of linear stiffness k (dimensions: force/length),\nhaving one end grounded while the other is attached to the moving mass, the natural fre\nquency is simply\nk\nδ =\n(16)\nm\nFor the first-mode natural frequency of continuous uniform beam, δ0 , we have\nk\nδ =\n(17)\nρm\n\nr\ns\nr\nr\nwhere ρ = 0.24. To see where it comes from, please refer to section 8 of Lab No.1\nhandout.\n1). Estimate the first-mode natural frequency, δ0\nWe are assuming that the antibody coating itself does not appreciably affect the natural\nfrequency of the cantilever. So, based on the geometry of the beam, we have the beam\nstiffness,\nP\n3EI\n3 100 × 109[N/m2] 4.10 × 10-26[m ][m ] = 1.23 × 10-2[N/m]\nk =\n=\n=\n·\n·\n\nL3\n(100 × 10-6)3\n(18)\nwhere I is the area moment of inertia of the cross-section, which, for rectangular cross-\nsections of this orientation, is equal to:\nI = bh3\n= 15 × 10-6[m] · (320 × 10-9)3[m ] = 4.10 × 10-26[m 4]\n(19)\nwith b the width and h the thickness of the beam.\nThe mass of this cantilever is equal to its volume times its density, which is,\nm = V = L b h = 3.1×103[kg/m3] 100×10-6[m] 15×10-6[m] 320×10-9[m] = 1.49×10-12[kg]\n· · ·\n·\n·\n·\n(20)\nSubstitute eqn 18 and eqn 19 into eqn 17, we have the first mode natural frequency of\nthis microfabricated cantilever,\nk\n1.23 × 10-2[kgm/s2 √ N/m] = 1.85 × 105[rad/s]\nδ =\nρm =\n0.24 1.49 × 10-12[kg]\n(21)\n·\n2). Frequency change from the added mass, δ\nAccording to eqn 18 and eqn 21, the natural frequency of a cantilever is\n3EI\nEIL\np\nEIL 1\nδ =\n(22)\nρL3m / L2\nm /\nL2\npm\nThe sought-for bacteria will preferentially attach themselves to the antibody coating on\nthe surface of the cantilever, in the process increasing the vibrating mass of the cantilever\nby an amount m = nbmb, where nb is the number of bacterium cells that attach, and mb\nis the mass of the bacterium cell.\n\nWe are assuming the added mass m is uniformly distributed along the length of the\nbeam, and further, assume that the presence of the adhered bacteria does not affect the\nstiffness of the beam. From Eqn 22, the change in frequency resulting from the add mass\ncan be expressed by\n.\np\nEIL\n.\np\nEIL\nδ0\nδ0 + δ =\n=\nq\n= q\n(23)\nL2\np\nm + m\nL2pm\n1 + m\n1 + m\nm\nm\nFor the function of (1 + m )- 2 , if the change of in total mass (m) is very small in\nm\ncomparison to the initial beam mass (m), then it can be expanded by taking a Taylor series\nexpansion. The general Taylor series expansion has the form of\nf (n)(x)\nX\nf(x + x) =\nn!\nx n\nn=0\n= f(x) + f 0(x)\n1! x + f 00(x)\n2! (x)2 + f 000(x)\n3! (x)3 + ....\n= f(x) + f 0(x)\n1! x + O(x 2)\n. = f(x) + f 0(x)\n1! x\n(24)\nIn our case,\n(1 + m\nm )- 1\n2 .= 1 - 1\nm\nm\nif m\nm ≤ 1\n(25)\nThen, the change in frequency resulting from the adding mass can be expressed as the\nfollowing\n.\n1 m\nδ0 + δ = δ0(1 -\n)\n(26)\n2 m\n3). Evaluate the change in natural frequency for the bacterium-coated cantilever\nFor each bacterium cell, we assume it is spherical, with the diameter, Db = 1μm. Its\ndensity, b, is equal to that of water, i.e. 1.0 × 103kg/m3 . An estimate of each cell's mass is\nD\n.\nmb = bV = b (\n)3 = 1.0 × 103[kg/m3]\n(1 × 10-6\n)3[m ] = 5.24 × 10-16[kg]\n(27)\n· 3\nThe total mass of all the bacterium cells, which is the \"added mass\", is\n\nProblem 3 (30 points)\nIn this problem, the CNT(Carbon nanotube) can be assumed to be a cantilever beam.\nFor elastic response, the lateral displacement of the cantilever v(x) is related to the\nbending moment by\nd2v(x)\ndx2\n= M(x)\nEI\n= P(a -x)\nEI\n(30)\nwhere a is the distance from x = 0 to the loading point. In the following derivation, x will\nbe only in the range of 0 x a.\nFigure 2: Scanning electron microscope images of E. coli bacteria attached to various micro-\nfabricated resonating cantilever beams. (from: Ilic, et al., Applied Physics Letters, 77, #3,\n2000, 450-452.\nm = nbmb = 100 · 5.24 × 10-16[kg] = 5.24 × 10-14[kg]\n(28)\nUsing eqn 26, and assuming the cell \"added mass\" is uniformly distributed over the\nsurface of the beam, the change in natural frequency is\n.\n1 m\n1 5.24 × 10-14[kg]\nδ = δ0(-\n) = 1.85 × 105[rad/s] · (- 2 1.49 × 10-12[kg]) = -3.25 × 103[rad/s] (29)\n2 m\nPlease be noticed that the frequency, f , in units of [cycles/sec] (or [Hz]) is related to\nthe angular frequency (or radian frequency), δ, by f [Hz] = δ[rad/s]/(2[rad/cycle]).\nImage removed due to copyright considerations.\n\n×\n×\n×\nProblem 3\nl\nP\nt\nw\nRemember that k , the stiffness, is a function of structure parameters such as geometry.\nThat is, for the same material, two beams with different widths for example will have\ndifferent stiffnesses.\nYoung's modulus, on the other hand, depends ONLY on the material and thus is a\nmaterial property. Finding a way to correlate these two is a reasonable approach to\nsolving this problem.\nFrom the definition of stiffness,\nP\nk =\nU P = k × d\n(1)\nd\nFurthermore, as we learned in class and in the lab, the following is true:\nl\nP\n3 ×\nI\nE\n× d\nd =\nU P =\n(2)\nl 3\n3× E × I\n×\n×\n-6\n×\n-23\nt\nw\n(m )×(\n0.2\n-6 ) (m ) =\n.3\n(m )\nwhere I =\n=\n×\nSetting (1) equal to (2) we get:\n9 æc N o÷ ×\n(m )×(\n-6 ) (m )\n×\n×\n×\n-6\n×\n3 ×\nI\nE\n× d\nŁ m 2 ł\nk × d =\nU k =\n= 11\n.0\nN m\n(3)\n×\nl 3\n12 ×(\n-6 ) (m )\n\n×\n×\n×\n×\nFrom Equation 3, it can be concluded that k is proportional to the width and\n(thickness ) of the beam and inversely proportional to the (length ) . Therefore, to get the\nminimum stiffness, we need to use the minimum width and thickness and the maximum\nlength for our calculations using Equation 3 and vice versa for the maximum stiffness.\nMore specifically:\n9 N\n×\n×\nk\nm ×\n-6 ×(\n5.1\nmin =\n×\n-6 )\nm\n12 ×(\n-6 ) = 04\n.0\nN\nand\n9 N\n×\n×\nm ×\n-6 ×(\n5.2\n=\nm\nk max\n12 ×(\n-6 )\n-6 ) = 24\n.0\nN\n×\nProblem 4\nLet's derive the necessary results instead of using Table 8.1 in CDL.\nFor beam (a), using the sign convention found in CDL, we have:\n(\n(\n(\nForce balance: dV\ndx\n(x ) +\nx\nq ) = 0 U dV\ndx\n(x )\n-\n=\nx\nq )\n-\n-\n=\nw ) = w U V ( x ) = w × x + C 1\n(1)\n(\nBoundary Condition:\nL\nV ) = 0 U C\n-\n= w × L\n(\nThus,\nx\nV ) = w × x - w × L\n(2)\nMoment balance:\n(\nw × x 2\ndM (x ) +\nx\nV ) = 0 U dM (x ) = w ×( L - x ) U M ( x )\n-\n=\n+ w × L × x + C 2\n(3)\ndx\ndx\nBoundary Condition: M ( L ) = 0 U C\n-\n=\nw × L 2\nw × L 2\nThus, M ( x )\n-\n= w × x 2\n+ w × L × x -\n(4)\nConverting it to an equation with dimensionless parameters for graphing purposes:\n\n×\n=\n× c c -\n-\n÷\n×\n×\næ x o\nx\nM ( x )\n-\n=\nc ÷\n+\n-\n(5)\nw × L 2\nŁ L ł\nL\nFrom Equation 3, we can conclude that M(x ) is a strictly increasing function\nsince 0 £ x £ L . Thus, M min = M ( 0) -\n=\nw × L 2\n(6)\nFrom the moment-curvature relation and Equation 4:\n2 (x\nv\nd\n) = M U dv (x )\næ w × x 3\nw × L × x 2\nw × L 2 × x\n÷\no + C 3\n(7)\ndx 2\nI\nE\ndx =\nI\nE\n×\nŁ\ncc-\n+\n-\n÷\n×\n×\nł\ndv (x )\nBoundary Condition:\n= 0 U C 3 = 0\ndx\nx = 0\nThus,\ndv (x )\næ w × x + w × L × x\nw × L × x o\n÷ U\ndx\nI\nE\nŁ\nł\n(8)\nU\nx\nv ) = 1\næ w × x 4\nw × L × x 3\nw × L 2 × x\n(\n×cc-\n+\n-\nł\n÷÷\no + C 4\nI\nE\nŁ\nBoundary Condition: v (0) = 0 U C = 0\nw\n(\nThus, d ( x ) -\n=\nx\nv ) =\n×( x + 6 × L 2 × x - 4 × L × x ) and d\n= w × L 4\n(9)\n24 × E × I\nmax\n8× E × I\nAgain, normalizing this equation for graphing purposes yields\nI\nE\n× d (x ) = 1 ×cæ x ÷o\n- 1 ×cæ x ÷o\n+ 1 ×cæ x ÷o\n(10)\nw × L 4\n24 Ł L ł\n6 Ł L ł\n4 Ł L ł\nThe following figure summarizes the deflection and moment profile along the beam\n\nLet's use the principle of superposition for part (b)\nThis problem can be broken into two parts: a beam with a uniformly distributed load and\nan identical beam with an unknown tip load RL . We know the deflection d1 and bending\nmoment M for the first part from part (a) (Equations 4 & 8) and for the second part ( d 2\nand\nM accordingly) from the lab handout:\n( )\n(\n)\nx\nL\nR\nx\nM\nL\n-\n×\n=\n(9)\n( )\n(\n)\nE I\nx\nL\nx\nR\nx\nL\n×\n×\n-\n×\n×\n×\n-\n=\nd\n(10)\nMake sure you use consistent sign convention. The assumption here is that this is an\nupwards-directed tip load.\nBy superposition:\n(\n)\n(\n)\nE I\nx\nL\nx\nR\nx\nL\nL\nx\nE I\nx\nw\nL\ntotal\n×\n×\n-\n×\n×\n×\n-\n×\n×\n-\n×\n+\n×\n×\n×\n×\n=\n+\n=\nd\nd\nd\n\n¢\n×\n×\nwhere RL is unknown. Using d total\n= 0 in the equation above we get\nx= L\n3 × w × L\nRL =\nand total displacement becomes:\nd total = w× x2\n( 2 × x -5 × L × x + 3 × L )\n(11)\n¢\n48× E × I\nand d total =\nw\n× x ×( 8 × x -15 × L × x + 6 × L ) = 0\n(12)\n48 × E × I\nL ×(15\nwhich has two roots in 0 £ x £ L : x = 0 and x =\n33), which is also the point\nw × L\nwhere deflection is maximum d total max\n_\n» 005\n.0\n×\nE × I\nSimilarly for the bending moment:\nM total = M 1 + M 2\n-\n=\nw × x 2\n+ w × L × x - w × L2\n+ 3 × w × L ×( L - x)\n(13)\n3 × w × L\n5 × L\nand M total\n-\n= w× x +\nL\nw\n-\n= 0 U x =\n9 ×\nL\nw\n=\nThus, M total _ max"
    },
    {
      "category": "Resource",
      "title": "hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/6ed7e969d15b114ca1c4738adb529321_hw1.pdf",
      "content": "P\nx\ngage 1\ngage 2\nx1\nx2\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nHOMEWORK NO. 1\nDistributed:\nWednesday, February 11, 2004\nDue:\nWednesday, February 18, 2004\nProblem 1 (35 points)\nA cantilever beam has been constructed from a steel having Young's modulus E = 208 GP a,\nPoisson ratio ν = 0.29, and tensile yield strength σy = 410 M P a. The length of the beam,\nfrom its base to its tip, is L = 1 m, and the uniform crosssection is rectangular, h = 5 mm\nthick and b = 30 mm wide.\nTwo axiallymounted strain gages have been mounted on the top surface (y = h/2). The\nprecise absolute axial position \"x\" is not known for either gage; however, it is known that\nthe two gages are spaced an axial distance of ` = 200 mm apart along the length of the\nbeam.\nA tip load of magnitude 'P ' is applied to the cantilever, acting in a direction parallel to the\nyaxis, causing the two gages (#1, which is nearer the base of the cantilever, and #2, which\nis nearer its tip) to register the following strain values:\nFigure 1: Schematic of tiploaded cantilever showing positions of strain gages numbers 1 and\n2.\n\nGage no.\naxial coordinate\nstrain\nx1 =?\n1200 × 10-6\nx2 = x1 + 200 mm\n900 × 10-6\n- (20 points) Evaluate the load P .\n- (15 points) Using the (nowknown) value of P , find the axial locations (x1 and x2)\nof both gages.\n\nProblem 2. (25 points)\nThere is current interest in the use of microfabricated cantilever beams in detecting the\npresence of bacteria in a liquid solution. Following fabrication of the cantilever, its surface\nis coated with an antibody that is specific to the presence of the bacterium of interest, and\nthe free vibration characteristics of the cantilever (its firstmo de natural frequency, ω0) is\nrecorded experimentally.\nThen the coated cantilever is exposed to a liquid medium. If the soughtfor bacteria are\npresent in solution, they will preferentially attach themselves to the antibody coating on the\nsurface of the cantilever, in the process increasing the vibrating mass of the cantilever by an\namount Δm = nb mb, where nb is the number of bacterium cells that attach, and mb is the\nmass of the bacterium cell.\nFigure 2: Scanning electron microscope images of E. coli bacteria attached to various micro\nfabricated resonating cantilever beams. (from: Ilic, et al., Applied Physics Letters, 77, #3,\n2000, 450452.\nSubsequent testing of the addedmass cantilever should reveal a progressively decreasing\nnatural frequency as more bacterium cells are added.\nThe cantilever of interest has been fabricated of silicon nitride, having a mass density of\nρ = 3.1 × 103 kg/m3 and Young's modulus of E = 100 GP a. It has a uniform rectangular\ncross section, of thickness h = 320 nm, width b = 15 μm, and total length L = 100 μm.\n- Assuming that the antibody coating itself does not appreciably affect the natural fre\nquency of the cantilever, estimate the firstmode natural frequency, ω0, of the cantilever\n\nImage removed due to copyright considerations.\n\nin the absence of adhered bacteria. (Note: please refer to the Lab 1 Handout Notes on\nvibration of cantilever beams for relevant analysis.)\n- Assume that the added mass Δm = nbmb is uniformly distributed along the length\nof the beam, and further, assume that the presence of the adhered bacteria does not\naffect the stiffness of the beam. Let the total mass of the coated beam be m = ρbhL;\nassuming that Δm ¿ m, show that the change in frequency resulting from the added\nmass, Δω, can be expressed by\n.\nμ\n1 Δm ¶\nω0 + Δω = ω0\n1 -\n.\n2 m\n- Hint # 1: You might wish to show that the natural frequency of a uniform beam of\ntotal mass 'm' can be written as ω ∝ (1/L)2 p\nEIL/m (neglecting dimensionless\nfactors).\n- Hint # 2: If the change in total mass (Δm) is very small in comparison to the\ninitial beam mass (m), then the resulting frequency of the perturbedmass system\ncan be evaluated by taking a Taylor series expansion of the frequency expression\nabout the reference mass.\n- Assume that the cantilever has been covered by nb = 100 bacterium cells. From the\nfigures, it appears that the diameter, Db, of each bacterium cell is near Db = 1μm;\nassuming each cell to be spherical and to have a mass density, ρb, equal to that of water,\n.\njustify an estimate of each cell's mass as mb = 5.24 × 10-16 kg. Using this estimate,\nand assuming that the cell \"added mass\" is uniformly distributed over the surface of\nthe beam, evaluate the change in natural frequency that you can expect to see for the\nbacteriumcoated cantilever.\n\nProblem 3. (20 points)\nAtomic force microscopy resolves the structure of surfaces to near atomiclevel resolu\ntion. A key structural element of an atomic force microscope (AFM) is a small cantilevered\nbeam fabricated from a material such as silicon using lithographic technology (e.g., precision\netching). The beam has a sharptipped diamond stylus at its tip, the stylus is tracked across\nthe specimen surface, and very local surface interactions between the tip and the specimen\nsurface cause the tip of the cantilever to deflect. The magnitude of the tip deflection is mea\nsured by reflecting a laser beam off its back side and imaging the location of the reflected\nlight. The tip/surface forces are computed from the deflections using beam theory, and they\nare used to map the structure of the surface.\nFigure 3 shows a small rectangular crosssection cantilever from an atomic force microscope\n(AFM) that has been machined from a single block of silicon using lithographic technology\n(e.g., precision etching). The nominal dimensions of this cantilever are length ` = 460 μm,\nwidth w = 50 μm, and thickness t = 2.0 μm. Elastic constants of silicon are Young's modulus\nE = 107 GP a, and Poisson ratio ν = 0.2.\nThe stiffness k = P/δ of the AFM cantilever is an important design parameter.\n- (10 points) Compute the stiffness of this AFM cantilever.\n- (10 points) Unfortunately, dimensional tolerances in the etching technique inevitably\nlead to a range of dimensions over a population of the AFM cantilever products. The\nmanufacturer quotes the following tolerances for this cantilever: ` = 460 μm ± 5μm;\nw = 50 μm ± 3μm; and tmin = 1.5 μm ≤ t ≤ tmax = 2.5 μm. Accordingly, the stiffness\nof any given cantilever can vary from its nominal value, depending on its actual di\nmensions. Provide estimates of the minimum and maximum stiffnesses, kmin\nand kmax , that can be expected is this cantilever, corresponding to extreme ranges of\nthe dimensions.\n\nImage removed due to copyright considerations.\n\nProblem 4 (20 points)\nCDL Problem 8.15\nHint/suggestion: Problem 8.15a is the continuation of the \"selfweight\" cantilever problem\nwe looked at in the lecture.\nYou should be well on the way to solving for its moment\ndistribution, and then you should be able to follow the procedures adopted for the tip\nloaded cantilever to calculate the corresponding lateral displacement distribution, v(x), and\nanything else needed.\nProblem 8.15(b) is statically indeterminant, meaning that there is no direct way to evaluate\nits bending moment distribution, M(x), without simultaneously considering the displace\nment distribution, v(x). There are two straightforward ways to approach such statically\nindeterminant beam problems.\n- Combine CDL equations 3.11 and 3.12 to obtain\nM 00(x) - q(x) = 0\nM 00(x) + w = 0,\n⇒\nand then use M(x) = EIv00(x) to obtain\nw\nv0000(x) +\n= 0.\nEI\nFrom here on, there are 4 integrations, 4 constants of integration, and 4 boundary\nconditions (on v(0), φ(0), M(L), and v(L)) to determine the constants. It will work,\nbut the algebra is deadly dull.\n- On the other hand, you can use the principle of superposition. In this case, observe\nthat the stated problem is equivalent to a cantilever, subject to (a) the distributed\nloading q(x) = -w, AND to a concentrated upwardsdirected tip load, of [unknown]\nmagnitude RL. The total vertical tip displacement of the cantilever is vtotal (L) = 0\nand by superposition,\n0 = vtotal (L) = vRL (L) + vq (L),\nwhere it is understood that there is a downward tip displacement, vq (L) < 0 (from\nproblem 8.15a), as well as an oppositedirection tip displacement, vRL > 0, from the\nunknown positiveupward tip reaction force, RL. This leads to a simple linear equation\nto solve for RL; once RL is obtained, all parts of the solution to 8.15b are known by\nsuperposition... Try whichever method suits you."
    },
    {
      "category": "Resource",
      "title": "hw2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/7c9862b70e249b0995ad3804a33425da_hw2_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSOLUTIONS FOR HOMEWORK NO. 2\nProblem 1 (15 points)\nThe axial stiffness of the structure is:\nFx\nσxxA\nA\nkaxial =\n=\n= E\n(1)\nδx\nεxx L\nL\nwhere A is the area of the cross section and L is the length of the beam. The bending\nstiffness is defined as:\nFy\nδ\nkbending =\n,\n(2)\ny\nwhere Fy is the concentrated tip load, and δy is the related tip deflection. According to the\nbeam theory, we know that δy = FyL3 . Thus, the bending stiffness is:\n3EI\nFy = Fy\n3EI\nkbending = δy\nFyL3 = L3 .\n(3)\n3EI\nCombining Eq.1 and Eq.3, the ratio of a slender cantilever's bending stiffness to its axial\nstiffness is:\n3EI\nkbending = L3\n3I/A = 3( l2 )2\n=\n(4)\nE A\nL2\nL\nkaxial\nL\nwhere l2 ≡\nI/A. Since L ≫ l2, we find the above ratio is extremely small.\nFor a solid circular cross-section beam with diameter d, we have:\nπd4\nI =\n(5)\nand\nπd2\nA =\n(6)\nSubstitution of the A and I into Eq. 4, we have\nkbending\n3I/A\n3 d )2\n=\n=\n(\n(7)\nkaxial\nL2\n16 L\nProblem 2 (45 points)\nPart A:\nNo forces and moments are applied to the beam. And at any x, 0 < x < l, we have:\nN = Fx =\nσxxdA = 0,\n(8)\n\nand\n\nM =\nσxx(-y)dA = 0\n(9)\nThe stress is a function of y, σxx = σxx(y), and does not change along the x-direction. The\ndeformation is composed of two parts: the thermal part and the mechanical part, thus the\ntotal stain at each point can be expressed as:\nε(total) = ε(mechanical) + ε(thermal)\n(10)\nε\nwhere\n(mechanical) = σ(y)/E\n(11)\nand\n∗\n∆T y\nε(thermal) = α∆T = α(∆T0 -\n)\n(12)\nh/2\nMeanwhile, since the beam deflects laterally with a constant curvature, κ(thermal) , the total\nstrain of the beam can also be expressed as:\nεtotal = ε0 - κ(thermal) y\n(13)\nwhere ε0 is the total strain for the mid-surface axial.\nε\n∂u0(x)\n0 =\n= ε0(thermal) → εtotal = ε0(thermal) - κ(thermal) y\n(14)\n∂x\nFrom Eq.s 10, 11, 12 and Eq. 14, we have:\n∗\nε\n∆T y\n0(thermal) - κ(thermal)y = ε(mechanical) + ε(thermal) = σ(y)/E + α(∆T0 - h/2 )\n(15)\nThus, the stress can be expressed as:\n∗\n∆T y\nσxx(y) = E[ε0(thermal) - κ(thermal) y - α(∆T0 -\n)]\n(16)\nh/2\nSubstituting Eq. 16 into Eq. 8, we have:\nh/2\n∗\n∆T y\nEb\n[ε0(thermal) - κ(thermal) y - α(∆T0 - h/2 )]dy = 0\n(17)\n-h/2\n∗\nThe integration of the linear terms in the above equation, -κ(thermal) y and ∆T y, will be\nh/2\nzero, since the integral range is symmetric (from -h/2 to h/2). Thus we have:\nEb(ε\nh/2\n0(thermal) - α∆T0)\ndy = 0 → ε0(thermal) = α∆T0\n(18)\n-h/2\nε\nAnother easier way to get this relation is that:\n0(thermal) = α∆T (y = 0) → ε0(thermal) = α∆T0\n(19)\n\nSubstituting Eq. 16 into Eq. 9 we have:\nh/2\n∗\nEb\n[ε\n∆T y\n0(thermal) - κ(thermal) y - α(∆T0 - h/2 )](-y)dy = 0\n(20)\n-h/2\nConsidering that ε0(thermal) = α∆T0, and y2dA ≡ I = 0, we get:\n∗\nκ\n2∆T α\n(thermal) =\n(21)\nh\nPart B:\nSubstitution of Eq. 18 and Eq. 21 into the expression of the stress, Eq. 16, we get:\n∗\n∗\n2∆T α\n∆T y\nσxx(y) = E[α∆T0 -\ny - α(∆T0 -\n)] = 0\n(22)\nh\nh/2\nThe axial stress in the thermally-loaded cantilever is zero everywhere.\nPart C:\nThe tip deflection caused by the thermal load is:\n∗\n∆T α\nv∆T (x = L) = κ(thermal)L2 =\nL2\n(23)\nh\nThe tip deflection caused by the reaction force Rtip is:\nRtipL3\n(24)\nvRtip(x = L) = 3EI\nThe actual tip deflection is zero. By applying superposition, we get:\n∗\n∗\n∆T α\n3EIα∆T\n0 = v∆T (x = L) + vRtip(x = L) →\nh\nL2 = - RtipL3\n→ Rtip = -\n(25)\n3EI\nhL\nPart D:\nAs shown in Part B, the thermal load does not generate stress, thus the stress field of this\ntip- restrained thermally-loaded cantilever beam is the same as the beam is only subjected\nto a tip load of Rtip. Since the sign of the tip-load is negative, Rtip is downwards and the\nupper part of the beam is in tension and the lower pare is in compression. The bending\nmoment is expressed as:\nM(x) = Rtip(L - x)\n(26)\nThe maximum tensile stress is at (x = 0, y = h/2), and value is expressed as:\nM h\nRtipLh\n∗\nσmax = -\n2 = -\n= Eα∆T\n(27)\nI\nI\nPart E:\nThe problem requests that σmax < σy = 350MP a, substitution of Eq. 25 into the above\nrelation, we have:\n∗\n∗\n2σy\nσmax = Eα∆T < σy → ∆T\n<\n(28)\n3Eα\nWith E = 210GPa and α = 12 × 10-6/*K, we find the largest bottom/top difference in\n∗\ntemperature change, ∆T\n= 92.6*K. So the largest bottom/top difference in temperature\nchange is 2 ∗ ∆T ∗ = 185.2*K\n\n*\n0.14\n0.12\n0.1\n0.08\n0.06\n0.04\n0.02\n0.16 0\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\n1 x/L\nFig 01: The total deflection\n\nProblem 3 (20 points)\nThe lattice-based prediction of the density of iron is:\n2 × 55.847 × 10-23g\nρF e =\n6.02\n= 7.88Mg/m 3\n(29)\n0.28663 × 10-27m\nFor Sodium chloride, there is one half atom (4 × 1/8) of both sodium (Na) and chlorine\n(Cl) in each cell. The atomic mass for sodium is 22.99g/mol and 35.453g/mol for chlorine.\n0.5 × (22.99+35.453)\nρ\n× 10-23g\nNaCl =\n6.02\n= 2.17Mg/m 3\n(30)\nr0 m3\nSolving the above equation, we got the estimated lattice spacing r0 = 0.2818nm.\nProblem 4 (20 points)\nMetal\nNi\nAl\nPt\nPd\nCu\nAu\nAg\n.\nS0 = Er0\nE (GPa)\nA)\n3.1517\n4.0496\n3.9231\n3.8902\n3.6151\n4.0786\n4.0862\na0 (\n(31)\nS0 (N/m)\n67.446\n28.347\n67.477\n48.238\n44.827\n33.445\n31.055\nWe can see that Au and Ag have the similar value in S0 and Ni and Pt have the similar\nvalue in S0. Conclusion: elements in the same column of the periodic table of elements tend\nto have similar atomic bond stiffness (S0)\n\nlog(E)\nNi\nS o\nAu\nPt\nCu\nPd\nAg\nAl\n0.5\n0.6\nlog(a)\nFig 02: E vs. ao"
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/581776107f756980c212f5284766070c_hw2.pdf",
      "content": "δ\n\nδ\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nHOMEWORK NO. 2\nDistributed:\nWednesday, February 18, 2004\nDue:\nWednesday, February 26, 2004\nProblem 1 (15 points)\nThe stiffness of a linear elastic structure subjected to a force of magnitude \"F \", which results\nin a displacement of the load point in the direction of the force of magnitude \"δ\", is given\nby\nF .\nk ≡ δ\nFigure 1: Cantilever beam: a) axial loading; b) lateral loading.\nConsider the case when the structure is, say, a tiploaded cantilever beam, as shown in the\nfigure. Depending on the orientation of the applied load with respect to the beam axis,\ntwo different stiffness values result. When loading is parallel to the beam axis, the axial\nstiffness of the structure can be defined as\nFx\nkaxial\n,\n≡ δx\nwhere it is understo od that δx is the axial displacement of the tip under load Fx. When\nthe applied load is perpendicular to the axis of the cantilever, a bending stiffness can be\ndefined as\nFy\nkbending ≡\n,\nδy\n\nwhere δy is the lateral displacement of the tip under transverse load Fy .\nThe beam is of length L, and has crosssectional area A and area moment of inertia I .\nUnder the usual assumptions of slender beambending theory, L is much greater than linear\ndimensions of the beam crosssection, including both `1 ≡\n√\nA and `2 ≡\np\nI /A; that is,\nL A `1 and L A `2.\nShow that the ratio of a slender cantilever's bending stiffness to its axial stiffness is extremely\nsmall, and give a precise expression for this ratio in the case of a solid circular crosssection\nof diameter d ¿ L.\n\nProblem 2. (45 points)\nWhen a cantilever beam is subjected to a temperature change that varies linearly through\nits thickness (but does not vary along the length of the beam), the beam deflects laterally\nwith a constant curvature, κ(thermal) , with resulting lateral displacement field\nv(x) =\nκ(thermal) x 2 .\nSimilarly, the midsurface axial displacement field is given by\nu0(x) = 20(thermal) x,\nwhere 20(thermal) is a dimensionless constant.\nHere it is understood that the base of the\ncantilever is at x = 0, while its tip is at x = L.\nLet the beam crosssection be rectangular, of width b (in zdirection) and thickness h (in\nydirection), and let the temperature change vary linearly with the ycoordinate according\nto\nΔT ? y\nΔT (y) = ΔT0 -\n,\nh/2\nso that the temperature change at midthickness (y = 0) is ΔT0, at the bottom of the beam\n(y = -h/2) it is ΔT0 + ΔT ?, and at the top of the beam (y = +h/2) it is ΔT0 - ΔT ? .\n(Aside: according to Fourier's law of heat conduction, linearlyvarying temperature fields\nsuch as this are associated with a steady flow of heat from the highertemperature region to\nthe lower one.)\n- Show that the curvature of the thermallyloaded cantilever is given by\n2αΔT ?\nκ(thermal) =\n,\nh\nindependent of the value of ΔT0, and that the axial midsurface strain is given by\n20(thermal) = αΔT0,\nindependent of the value of ΔT ? .\n- Show that there is zero axial stress everywhere in the thermallyloaded cantilever\njust describ ed.\nIf, instead, the thermallyloaded structure is also subjected to a boundary condition at its\ntip that requires zero lateral displacement (v(x = L) = 0), then nonzero reaction forces and\naxial stress will be generated.\n- Using [thermo]elastic superposition, evaluate the magnitude of the tip reaction force,\nRtip, required to bring the total tip deflection in the thermallyloaded and tiprestrained\ncantilever back to zero; i.e.,\n0 = vtotal (x = L) = vΔT (x = L) +\nL),\nvRtip (x =\n\nx\ny\nL\nv(x=L)=0\nh\ntemperature change: linear in y\nFigure 2: Tiprestrained cantilever beam subjected to a temperature change varying linearly\nwith throughthickness coordinate, y: ΔT (y) = ΔT0 - (ΔT ? y)/(h/2).\nwhere vΔT (x = L) is the tip displacement of the free thermallyloaded cantilever\n(above), and\n= L) is the tip displacement of the cantilever in response to\nvRtip (x\nlateral load Rtip applied at x = L.\n- Identify the location of maximum tensile stress in the thermallyloaded cantilever hav\ning restrained tip displacement vtotal (x = L) = 0, and symbolically evaluate the tensile\naxial stress at that location.\n- Suppose that the beam with tip restraint is made of steel, with E = 210 GP a, α =\n12 × 10-6/*K, and has dimensions L = 100 mm, b = 15 mm, and h = 3 mm. What is\nthe largest bottom/top difference in temperature change, parametrized by ΔT ?\nmax , so\nthat the steel does not reach a yield strength of σy = 350 M P a?\n\nProblem 3. (20 points)\nThe mass density of a crystal can be calculated from a knowledge of the unit cell of the\ncrystal, the atoms within the cell, and their atomic weights. As an example, consider iron\n(FE), which has a bodycentered cubic (BCC) crystal structure. A unit cell contains nine\n(9) iron atoms, with 8 of them located on the corners of a cube of edge length r0 = .2866 nm,\nplus one additional iron atom at the center of the cube. By translations of this unit cell in the\nthree principal cube directions, an arbitrarily large crystal can be generated. Evidently, each\ncorner atom of the cell \"participates\" in eight (8 = 23) different unit cells of this sort; thus\nonly 1/8 of the mass of the corner atoms should be assigned to \"this\" unit cell. Reflection\nwill show that the net number of iron atoms in the cell is 2 = 1 + 8 × (1/8), where \"1\"\ndenotes the central atom.\nMass density is defined as\nmass ;\nρ ≡ volume\nwhen applied to a unit atomic cell, we can generalize this result as\nP\ni (atom/cell) × (mass/atom)\nρ =\n.\nvolume/cell\nThe atomic mass of iron (check out a periodic table) is 55.847 g/mol, and the Avogadro\nnumber is NA = 6.02 × 1023 atoms/mol, so the atomic mass of iron is (55.847/6.02) ×\n10-23 g/atom. Show that the calculation outlined predicts a latticebased estimate of the\ndensity of iron as\nρlattice = 7.88Mg/m3 ,\nwhich is slightly larger than the measured density of iron, 7.87 Mg/m3 .\nThe slight dis\ncrepancy is due to the presence of defects in the actual crystal; defects were ignored in the\nmodel.\nSodium chloride (salt!) is an ionic crystal for which a simple unit cell can be constructed,\nconsisting of alternating sodium (Na) and chlorine (Cl) atoms spaced a distance r0 apart\nalong lines of a cubic grid. An 8atom section of such a cell is shown. Assuming the density\nof salt is ρNaCl = 2.17 Mg/m3, estimate the lattice spacing, r0.\n\nFigure 3: Unit atomic cell (BCC) for Fe. Dashed orange lines connect central atom to corner\n(Not all shown, for clarity.)\natoms.\nFigure 4: Unit atomic cell for NaCl.\n\nProblem 4. (20 points)\nIn our simple model of atomic spacing (r0) and atomic bond stiffness (S0), we argued that\nthe elastic modulus, E, should scale as\n. S0\nE =\n,\nr0\nand concluded that the orders of magnitude differences observed in E among solids, along\nwith only a factor of two or so variation in r0, pointed clearly to the dominant role of bond\nstiffness, S0, in scaling elastic modulus. We further grouped dominant classes of [primary]\nbonds as covalent, metallic, ionic, and weak polarized bonding (van der Waals; hydrogen\nbonding).\nAlthough the extreme simplicity of the underlying model precludes much more precise eval\nuation, we can push things a bit further. Several metalic elements (nickel (Ni), gold (Au),\ncopper (Cu), silver (Ag), aluminum (Al), palladium (Pd), platinum (Pt), and others) form a\nfacecentered cubic (FCC) lattice, and are, of course metallic. Within a single crystal class\n(here, FCC), our model might lead us to expect that the inferred strength of the [metallic]\nbonding, S0, should not vary too much over the class. The table lists measured ambient\ntemperature elastic moduli (E) and FCC lattice spacings (here denoted \"a0 \" rather than\n\"r0\") for some of the FCC metals:\nMetal\nE (GPa)\na0 ( A)\nNi\n3.1517\nAl\n4.0496\nPt\n3.9231\nPd\n3.8902\nCu\n3.6151\nAu\n4.0786\nAg\n4.0862\n- Evaluate an inferred value for the bond stiffness parameter, S0, for each FCC material.\n- Do you observe any patterns in your results? For example, do particular pairs (or\nso) of metals give very similar results for S0?\nAlthough the precise nature of the\nconnections resides in deeper within quantum mechanics, suffice it to say that location\nin the periodic table might have something to do with the answer..."
    },
    {
      "category": "Resource",
      "title": "hw3_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/689305686d2b54be95a87097b7ff052c_hw3_sol.pdf",
      "content": "Z\nZ\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSOLUTIONS FOR HOMEWORK NO.\nProblem 1 (20 points)\n(a) The equilibrium equations are\n∂σ11\n∂x1\n+ ∂σ12\n∂x2\n+ ∂σ13\n∂x3\n+ ρb1 = 0\n(1)\n∂σ21\n∂x1\n+ ∂σ22\n∂x2\n+ ∂σ23\n∂x3\n+ ρb2 = 0\n(2)\n∂σ31\n∂x1\n+ ∂σ32\n∂x2\n+ ∂σ33\n∂x3\n+ ρb3 = 0\n(3)\nAll shear stresses are zero. Furthermore, the gravitational body force loading b has\none non-zero component only, in the direction of e3. Therefore, from the third equilibrium\nequation we get:\n∂σ33\n∂σ33\n∂x3\n+ ρb3 = 0 ⇔ ∂x3\n= -ρb3\n(4)\nWe also know that σ33(x) = -p(x) and b3 = -g. We can substitute these into Equation 4\nand integrate both sides with respect to x3\nx3\nZ p(x)\nx3 dp(x) dx3\n-ρb3dx3 ⇔-\ndp(x) = ρgx3 ⇔-p(x3) + p0 = ρgx3\n(5)\n-\n=\ndx3\np0\np(x3) = p0 -ρgx3\n(6)\nNote that p is only a function of x3.\n(b) 1. The traction vector on a surface can be found by multiplying the stress with the\nunit outward normal vector on that surface. In this case, the normal vector is\nnl =\n⎧\n⎨\n⎩\n-cos θ\n-sin θ\n⎫\n⎬\n⎭\n(7)\nThe traction vector is then\n\nA\n!\nA\n!\nA\n!\nA\n!\n=\n-p(x)\n- cos θ\n=\np(x) cos θ\ntl\n⎡\n⎣\n-p(x)\n-p(x)\n⎤\n⎦\n⎧\n⎨\n⎩ - sin θ\n⎫\n⎬\n⎭ ⇔ tl\n⎧\n⎨\n⎩\n⎫\n⎬\n(8)\n⎭\np(x) sin θ\n2. Action and reaction, forces need to balance at the interface.\n⎧\n⎨\n⎩\n⎫\n⎬\n⎭\n-p(x) cos θ\n-p(x) sin θ\n(9)\ntl =\n3.\n⎤\n⎦\n⎧\n⎨\n⎩\n⎫\n⎬\n⎭\n⎡\n⎣\nσ11 σ12 σ13\nσ21 σ22 σ23\ncos θ\nsin θ\n(10)\ntd =\nσ31 σ32 σ33\nwhich gives 3 linear equations involving σij\n-p cos θ = σ11 cos θ + σ13 sin θ\n(11)\n0 = σ21 cos θ + σ23 sin θ\n(12)\n-p sin θ = σ31 cos θ + σ33 sin θ\n(13)\nProblem 2 (20 points)\n1 + ν\nν\n2ij =\nσij -\nδij\nE\n1 + ν\nσkk\n+ αΔTδij\n(14)\nX\nk=1\nThe procedure is similar to what was discussed in class for elastic constitutive relations\nwithout thermal effects. The idea is to eliminate P3\nfrom the given equation and\nk=1 σkk\nsolve for σij . To do this, take the sum of both sides of the given equation as follows\nX\nX\nσkk\nX\nδii\n+ αΔT\nX\nX\n2ii = 1 + ν\nν\nσjj -\nδjj\n(15)\nE\n1 + ν\ni=1\nj=1\nk=1\ni=1\nj=1\nThe indexes can be anything in this case (i, j, or k) and don't affect the result. P\nj\n=1 δjj is\nsimply the sum of the diagonal elements of the (3x3) identity matrix. Thus, P\nj\n=1 δjj = 3.\nTherefore, the equation becomes\nσkk\n+ 3αΔT\n(16)\nX\n2ii =\nX\nX\n1 + ν\nν\nσjj - 3\nE\n1 + ν\ni=1\nj=1\nk=1\nSolving for P3\nyields\nk=1 σkk\nX\nX\nE\nσkk =\n2ii - 3αΔT\n(17)\n1 - 2ν\ni=1\nk=1\n\nA\n!\nWe can now substitute this expression into Equation 14 and solve for σij to get\nE\nν\nX\n1 + ν\n2ii - 1 - 2ν αΔTδij\n(18)\nσij =\n2ij +\nδij\n1 + ν\n1 - 2ν\ni=1\nTo evaluate the stress components for the given data, use any commercially available\nsoftware to carry out the matrix operations, such as MATLAB. The stress tensor is\nσ =\n⎡\n⎣\n-0.6704\n0.0808\n-0.0323\n0.0808\n-0.2665\n⎤\n⎦ GPa\n(19)\n-0.\n-4281\n\n(thermal)\n(mechanical)\n(mechanical)\n2ij = 2ij\n+ 2ij\n= α ΔT δij + 2ij\n(1)\n2ij = α ΔT δij + 1\n\"\n(1 + ν)σij - νδij\nAX\nσkk\n!#\n(2)\nE\nk=1\nThis equation can be inverted to give\nE\n\"\nν\nA\nσij =\n2ij +\nX\n2kk\n!\nδij - (1 + ν) α ΔT δij\n#\n(3)\n(1 + ν)\n(1 - 2ν)\n(1 - 2ν)\nk=1\n1. The strain components are determined by the derivatives of displacement components.\nSince the displacement should be continuous in the interface separating surface layer\nfrom substrate, the in-plane strain components in the thin surface layer should corre\nspond to those in the substrate, too. Therefore, 211 = 222 = 212 = 0.\n2. The problem stipulates that the thick substrate undergoes negligible total strain and\n.\n.\ntemperature change. It means ΔT = 0 and 2ij(substrate) = 0ij .\nThe constitutive equation (3) gives the relation between stress components and strain\ncomponents. In the equation, σij(substrate) can be calculated by substituting 2ij(substrate)\nand ΔT(which are all zeros).\nσij( substrate) = 0ij\nProblem 3 (30 points)\n\n3. We know that the surface layer has a boundary condition at surface x3 = 0 which\nremains traction-free (tn = 0).\nn = n1e1 + n2e2 + n3e3 = e3\nn1 = n2 = 0,\nn3 = 1\nt1 = σ11n1 + σ12n2 + σ13n3 = 0\nσ13 = 0\n(4)\n⇒\nt2 = σ21n1 + σ22n2 + σ23n3 = 0\nσ23 = 0\n(5)\n⇒\nt3 = σ31n1 + σ32n2 + σ33n3 = 0\nσ33 = 0\n(6)\n⇒\nThe in-plane components 211, 222, and 212 are zero.\nBy the equation (3),\nE\nσ12 = σ21 =\n[0 + 0 + 0] = 0\n(7)\n1 + ν\nInvoking the symmetry of the stress tensor, σij = σji\n[σij ] =\n⎡\n⎣\nσ11\nσ22 0\n⎤\n⎦\n(8)\nIn order to justify the sign of the non-zero stress components, σ11 and σ22, we can\nimagine that, when the temperature increases, the surface layers tends to extend while\nthe substrate tends to prevent it from deforming by shrinking it. Therefore the non-zero\nstress components would be compression stresses. And similarly, when the temperature\ndecreases, the two in-plane components are tensile stresses. The non-zero components\nσ11 and σ22 always have opposite sign from that of the change of temperature(ΔT).\n4. By the equation (2) and the in-plane strain continuity( 2 11 = 222 = 212 = 0 ),\n211 = α ΔT δ11 + E [(1 + ν)σ11 - νδ11 (σ11 + σ22 + σ33)]\n= α ΔT + E [(1 + ν)σ11 - ν (σ11 + σ22 + 0)] = 0\n211 = α ΔT + E [σ11 - νσ22] = 0\n(9)\n222 = α ΔT δ22 + E [(1 + ν)σ22 - νδ22 (σ11 + σ22 + σ33)]\n= α ΔT + E [(1 + ν)σ22 - ν (σ11 + σ22 + 0)] = 0\n\n222 = α ΔT +\n[σ22 - νσ11] = 0\n(10)\nE\nOn solving equation (9) and (10),\nαΔTE\nσ11 = σ22 = - 1 - ν\nαΔTE\n211 = 212 = 222 = 0,\nσ11 = σ22 = - 1 - ν\nSince all the components of the stress tensor in equation (8) are known, the strain\ntensor can be calculated by the equation (2).\n213 = α ΔT δ13 + E [(1 + ν)σ13 - νδ13 (σ11 + σ22 + σ33)] = 0 + E [0 - 0] = 0\n223 = α ΔT δ23 + E [(1 + ν)σ23 - νδ23 (σ11 + σ22 + σ33)] = 0 + E [0 - 0] = 0\n233 = α ΔT δ33 + E\n·\n[(1 + ν)σ33 - νδ33 (σ11 + σ22 + σ33)]\nμ 2αΔTE ¶\n1 + ν\nα ΔT +\n0 + ν\n= αΔT\n=\nE\n1 - ν\n1 - ν\n⎡\n⎣\n⎤\n⎦\n1 + ν\n[2ij ] = αΔT\n(11)\n1 - ν\n5. The Mises equivalent stress σ is given by\nr\nσ =\n[(σ11 - σ22)2 + (σ22 - σ33)2 + (σ33 - σ11)2] + 3 [σ2\n23 + σ2\n12 + σ2\n13]\n(12)\nE\nσ =\nα ΔT\n(13)\n1 - ν |\n|\nTo prevent yielding, it is required that σ < σy .\n|ΔT < (1 - ν)σy\n|\nEα\n\nProblem 4 (30 points)\nIn uniaxial loading, only one stress component is non-zero. Let's assume uniaxial loading in\nthe 1-direction. The stress tensor is then\nσ =\n⎡\n⎣\n⎤\n⎦\nσ11 0\n(20)\nThe stress deviator tensor is then\nσ(dev) =\n⎡\n⎣\n⎤\n⎦ =\n⎡\n⎣\n⎤\n⎦\nσ11\nΣ\nσ11\nΣ\n(21)\n-\n-\nσ11\nΣ\n-\n-\nThe double summation in the Mises stress equation is calculated by squaring each component\nof the deviatoric stress tensor and adding them all up. More specifically,\nX\nX\nσ(dev σ(dev\nij\n= ( σ11)2 + ( σ11)2 + ( σ11)2 =\nΣ2\n(22)\nij\ni=1 j=1\nTherefore, the Mises stress becomes\nr\n2 3\nσ =\n3 2Σ2 = |Σ|\n(23)\nHydrostatic pressure only has normal components, ie it doesn't have shear components.\nAs a result, the stress components that are affected by the addition/subtraction of a uniform\nhydrostatic pressure p are σ11, σ22 and σ33, which become in the case of addition, σ11 + p,\nσ22 + p and σ33 + p accordingly. The deviatoric stress components are then\nσ(dev)\n= σ11 + p - 1\n3 (σ11 + σ22 + σ33 + 3p) = σ11 - 1\n3 (σ11 + σ22 + σ33)\nσ(dev)\n= σ12\nσ(dev)\n= σ13\nσ(dev)\n= σ21\nσ(dev)\n= σ2 + p - 1\n3 (σ11 + σ22 + σ33 + 3p) = σ22 - 1\n3 (σ11 + σ22 + σ33)\nσ(dev)\n= σ23\nσ(dev)\n= σ31\nσ(dev)\n= σ32\nσ(dev)\n= σ3 + p - 1\n3 (σ11 + σ22 + σ33 + 3p) = σ3 - 1\n3 (σ11 + σ22 + σ33)(24)\n\nwhich is equal to the original stress deviator tensor.\nIn plane stress\nσ =\n⎡\n⎣\n⎤\n⎦\nσ11 σ12 0\nσ12 σ22 0\n(25)\nThus, the stress deviator tensor is\nσ(dev) =\n⎡\n⎣\n⎤\n⎦\n2 σ11 - 1 σ22\nσ12\nσ12\nσ22 -\nσ11\n(26)\n- 1\n3 (σ11 + σ22)\nThen, the Mises stress becomes\nr\n3 1\n3 1\n3 1\nσ =\n3σ2\n11 + σ2\n22 + σ2\n2 9\n\n12 +\n(4σ2\n22 - 4σ11σ22) +\n(4σ2\n11 - 4σ11σ22) +\n(σ2\n+ 2σ11σ22)(27)\n11 + σ2\n2 9\n2 9\nAfter some manipulation, we get\nσ2 = 3σ2\n11 + σ2\n(28)\n\n12 + σ2\n22 - σ11σ22\nFinally, in the case of pure shear, the stress tensor is\nσ =\n⎡\n⎣\n⎤\n⎦\n(29)\n0 τ 0\nτ 0\nThe stress deviator tensor is identical to the stress tensor since pure shear does not cause\nvolumetric changes (only shape changes). Thus, σ = σdev . The Mises stress is\nr\nσ\nσ =\n2τ 2\n(30)\n⇔|τ | = √\nAs mentioned in the problem statement, yielding occurs when σ = σy . Therefore, τ = σy .\n√\n|\nFurthermore, the only non-zero variable in the Tresca condition is σ12 = τ . Thus, the first\ninequality yields |τ | ≤ σ\ny and the second one τ ≤ σy . Thus, the Tresca condition predicts\nyielding when |τ | = σ\ny .\n| |"
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/29a1c6da9fb58166f5b5a6b2875146f6_hw3.pdf",
      "content": "e3\ne1\nwater/air surface;\nx3=0\nθ\nnd\nnl\nx3 < 0\ndam face\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nHOMEWORK NO. 4\nDistributed:\nWednesday, March 3, 2004\nDue:\nWednesday, March 10, 2004\nProblem 1 20 Points\n(a) The state of stress at position x in a fluid at rest (say, a liquid) can be characterized by\nσij (x) = -p(x) δij ,\nwhere p is the [fluid] pressure at x. Assume that the liquid has a constant mass density, ρ,\nand assume further that the fluid is subject to a gravitationallyinduced body force loading\n(per unit mass) of magnitude\nb = -g e3,\nwhere the cartesian basis vector e3 points \"up.\" Let atmospheric [air] pressure at the surface\nof the liquid be p0 (elevation of air/liquid surface: x3 = 0) . Using the appropriate equilibrium\nequations, show that the pressure at generic elevation x3 < 0 is given by\np(x1, x2, x3) = p0 - ρ g x3.\n\n\"\nA\n!#\n(b) A long, straight dam holds the water in place. The dam extends along the e2 direction,\nand the planar surface of the dam makes an angle of θ with respect to the vertical, as shown.\nAt a point on the liquid/dam interface that is at elevation x3 < 0:\n1. evaluate the traction vector exerted by the dam on the fluid surface. The outward\nnormal vector on the liquid is nl, as shown.\n2. explain why the traction vector acting on the surface of the dam (that is, the traction\nexerted by the fluid on the surface element of the dam) is equal and opposite to the\npreviouslydetermined traction vector in part (1). The outward normal to the surface\nof the dam is nd, as shown.\n3. use the traction vector from part (2) to express 3 linear equations involving the carte\nsian stress components σij in the dam at elevation x3.\nProblem 2 (20 Points)\nThe isotropic linear thermal/elastic constitutive relations can be expressed in the compact\nnotation\n1 + ν\nν\nX\nσkk\n+ αΔT δij .\n2ij =\nσij -\nδij\nE\n1 + ν\nk=1\nHere the total strain components (2ij ) are expressed in terms of the stress components (σij )\nand the temperature change (ΔT).\nDerive a consistent expression for the stress components, σij , in terms of the strain compo\nnents and the temperature change. Evaluate those stress components when the strain tensor\nis\n⎡\n⎣\n⎤\n⎦ =\n⎡\n⎣\n-0.001\n0.0005\n-0.0002\n0.0005\n0.\n⎤\n⎦ ,\n0.0015\n0.0\n0.0005\n-0.\nand the temperature change is ΔT = 100 C. Material properties include E = 210 GPa,\nν = 0.3, and α = 12 × 10-6/ C\n\nx 1\nx\nx\nsubstrate\nthin surface layer\nrapid thermal loading\n(temperature change)\nProblem 3 (30 Points))\nThe surface x3 = 0 of a large, flat body made of a material having elastic Young's modulus\nE, Poisson ratio ν, and coefficient of thermal expansion α is subjected to a rapid thermal\nshock. 1 The results in either case can be summed up by the following observations:\n- In a thin layer on and immediately below the surface x3 = 0:\n- the temperature rapidly changes by an amount \"ΔT \", where ΔT ≡ Tafter - Tbefore ;\n- the surface x3 = 0 remains tractionfree.\n- In the thick substrate beneath the surface layer:\n.\n- the temperature changes negligibly: ΔT = 0;\n.\n- the total strain remains very small: 2ij = 0ij .\n1This can be accomplished, e.g., by rapidly bringing the surface into contact with a flame or laser\nirradiation (heating); alternatively, a very cold liquid may rapidly flow over the surface (cooling).\n\nAssuming that the response of the material during the shock is isotropic linear thermal/elastic:\n1. Argue why the inplane strain components 211, 222, and 212 in the thin surface layer\nshould match the corresponding values in the substrate; namely, 211 = 222 = 212 = 0.\n(Hint: what would happen to the displacement field components ui if any of these\nstrain components were discontinuous across the interface separating surface layer\nfrom substrate?)\n2. Evaluate all components of the stress tensor σij in the substrate.\n3. Evaluate all components of the stress tensor σij in the thin surface layer. Give \"physi\ncal\" reasons to justify the sign of any nonzero stress components, relative to the sign\nof ΔT.\n4. Evaluate all components of the strain tensor 2ij in the surface layer. Give \"physical\"\nreasons to justify the sign of any nonzero strain components, relative to the sign of\nΔT.\n5. Suppose that yielding of the material begins whenever the Mises stress measure σ\nreaches the value σy , which is the tensile yield strength of the material. Calculate the\nmaximum value of ΔT which can be applied to the surface layer without having the\n|\n|\nMises stress exceed the value \"σy \".\nRecall that in an isotropic linear thermal/elastic material, the relation between temperature\nchange, ΔT, stress components, σij , and strain components, 2ij , is\n2(thermal) +\n2(mechanical)\n2ij =\nij\nij\n=\nα ΔT δij + 1\n\"\n(1 + ν)σij - νδij\nAX\nσkk\n!#\nE\nk=1\nYou may consult your [correct] answer to Problem 2, above, in order to find an appropriate\n\"inverted\" form giving the stress components σij in terms of the strain components 2ij and\nthe temperature change, ΔT.\nNote: In this and in many other problems, you have information about some (but not all!) of\nthe stress components, and about some (but not all!) of the strain components. In this case,\nyou must engage in \"handtohand combat\" with the set of linear equations comprising the\nstress/strain/temp erature relations, obtaining new expressions for those components that\nyou do not know, a priori, in terms of those components that you do know .....\n\nProblem 4 (30 Points)\nThe Mises equivalent tensile stress is a nonnegative scalar measure of a multiaxial stress\nstate, σij , that is used to asses the proximity to yielding in ductile metals and polymers at\nsufficiently low temperatures. Let the uniaxial tensile yield strength of a material be given\nby σy ; then, if that material is under a general multiaxial stress state σij whose Mises tensile\nequivalent stress, σ, satisfies\n\nσ < σy ,\n\nno plastic deformation is forthcoming: the material will respond elastically. Should σ = σy ,\nplastic deformation under the multiaxial stress state is imminent.\nThus, it is important to be able to calculate the Mises tensile equivalent stress. The most\nfundamental definition of σ first involves calculation of the stress deviator tensor corre\nsponding to σij . Components of the stress deviator are defined by\nσ(dev) ≡ σij - 1\nAX\nσkk\n!\n.\nij\nδij\nk=1\nThe Mises equivalent tensile stress is given by\n�\n\nσ ≡\n3 X X\nσ(dev) σ(dev)\n\nij\nij\n.\ni=1\nj=1\nClearly, it is a \"root mean square\" measure of the stress deviator tensor components (square\nroot of the sum of the squares of the components).\n- Show that, for uniaxial tensile/compressive stress of magnitude \"Σ\" along any coordi\n\nnate axis, σ = Σ .\n| |\n- Show that addition or subtraction of a uniform hydrostatic pressure to a given stress\nstate, σij , does not affect the value of σ.\n- Show that, in plane stress, where the only nonzero components of the stress tensor\nare σ11, σ22, and σ12 = σ21, the Mises tensile equivalent stress satisfies\nσ2\n= 3σ12 + σ11 + σ22 - σ11σ22.\n- In 2.001, you may have considered an alternative criterion for the onset of plastic\nflow under multiaxial stress states, termed the maximum shear stres, or Tresca yield\ncriterion. In the special case of plane stress given above, the Tresca yield condition\ncomprises the following sets of constraints:\nsμ σ11 - σ22\n¶2\n+ σ12 ≤ σy .\n\n� σ11 + σ22\nsμ σ11 - σ22\n¶2\n≤ σ\n±\n+ σ2\ny .\nShow that, in the case of pure shear, σij = 0 except σ12 = σ21 = τ = 0, the Mises yield\ncriterion predicts that yield will occur when |τ | = σy /\n√\n3, while the Tresca yield crite\nrion predicts yielding when τ = σy /2. Thie difference is only ∼ 15%, and is the largest\n| |\npossible difference in the predictions of yielding between the Tresca and Mise criteria.\nIn general states of stress, computation of the Mises equivalent tensile stress measure is\nstraightforward, but the generalization of the Tresca yield criterion to general states of\nstrees requires more calculations. Also, careful experimentation under multiaxial stress\n(e.g., using thinwalled tubes under combinations of tension/compression, torsion, and\ninternal pressure) gives results generally closer to the Mises criterion."
    },
    {
      "category": "Resource",
      "title": "hw4_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/3e5869305d1d1576bf6f2cf6f0b909c5_hw4_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSOLUTIONS FOR HOMEWORK NO. 4\nProblem 1 (20 points)\nPart A:\nBecause the beam is still in elastic region, the stress field can be expressed as:\nσ(y) = -yMy\nI\n(1)\nSince the most highly stressed region is at the verge of yielding, we have\n|σ(y)max| = | - yMy\nI |y=±h/\n√\n2 = σy ⇒My = σy I\nh/\n√\n(2)\nFor the diamond-orientation beam, I is calculated as:\nh\n√\nh4\nh\n2dA = 2\n( √\n-y) × 2dy =\nI\n(3)\n=\ny\nThe area moment of inertia for this diamond-orientation is the same as the cross-section\nappears as a square. Substitution of I into Eq. 2, we get that:\n√\nM\n2σy h3\ny(diamond) =\n(4)\nPart B:\n√\nh\n√\nh3\nh\n2σ\ny\nML(diamond) =\nσy (-y)dA = 2\nσy y × ( √\n-y) × 2dy =\n(5)\nPart C:\n√\nML(diamond)\n2σyh3\n= √\n= 2\n(6)\n2σyh3\nMy(diamond)\nσ\nWhen the cross-section appears as a square, My is calculated as:\ny I\nσy h4/12\nσy h3\nM\n=\n=\n=\ny(square)\nymax\nh/2\n(7)\n\nand ML is:\nh\nM\nh3\nL(square) =\nσ(-y)dA = 2\nσy y × hdy =\n(8)\nσy\nSo the ratio of ML/My for square-orientation is:\nML(square)\nσyh3\nM\n=\n=\n(9)\ny(square)\nσyh3\nPart D:\nThe ratio of the first-yield bending moments for the two orientations is:\n√\nMy(diamond)\n2σyh3\n√\nM\n=\n= 1/ 2\n(10)\ny(square)\nσyh3\nThe first-yield bending moment is calculated by:\nσy I\ny\nMy =\n(11)\nmax\nSince σy is a constant, and I is the same for these two orientations, the above ratio is only\ndetermined by the ratio of ymax. The ratio of limit moment for the two orientations is:\n√\nML(diamond)\n2σyh3\n2 √\nM\n=\n=\n2 < 1.0\n(12)\nL(square)\nσyh3\nThe limit moment for a symmetrical cross-section is calculated by:\nML = 2σy\nydA\n(13)\nA/2\nwhere A/2 is the 1/2 area of the cross section in which y ≥ 0. For the diamond-orientation,\n√\nthough the maximum value of y is\n2 times larger than the square-orientation, the major\npart of its cross-section is located at the region with small y coordinate. Thus the ratio of\nlimit moment calculated above is smaller than one.\nSince My(diamond) < My(square) and ML(diamond) < ML(square), we should use the beam in\nthe square-orientation.\nPart E:\nThe unloaded stress field is expressed as:\nσunloaded = σloaded + ∆σ(y)\n(14)\nWith the assumption of elastic unloading from the limit condition ML, ∆σ(y) can be ex\npressed as following:\n-y∆M\nyML(diamond)\n∆σ(y) =\n=\n(15)\nI\nI\n\nSubstitution of ∆σ(y) , I and ML(diamond)into Eq. 14, we find that:\n√\nσunloaded = { -σy + 2 2σy (y/h)\nif\ny ≥ 0;\n√\n(16)\nσy + 2 2σy (y/h)\nif\n\ny < 0.\nSimilarly, the unloaded stress field for the square-orientation is expressed as:\nyML(square)\n-σy + 3σy (y/h)\nif\ny ≥ 0;\nσunloaded = σloaded +\nI\n= { σy + 3σy (y/h)\nif\n\ny < 0.\n(17)\nThe stress field is shown in Figure 1.\nFor the diamond-orientation, since the residual stress at y = ymax is σy , no negative\nmoment (which will cause positive stress increment to the upper part and negative increment\nof stress for the lower part) can be applied without further plasticity.\n\n(a) diamond-orientation\n(b) square-orientation\nFigure 1 Unloaded stress\n\nProblem 2 (30 points)\nThere are 4 basic ways to strengthen metallic crystalline materials. All 5 mechanisms\nimpede dislocation motion by creating an impedance to dislocation motion which raises the\nshear stress required for dislocation motion. Three of the mechanisms involve objects that\nget in the way of dislocation motion. In those mechanisms, the shear strength has the general\nrelation τ = Gb where L is some characteristic length between objects.\nL\n1. One mechanism is obstacle/precipitate strengthening. The shear stress required for\na dislocation to loop around an obstacle or second phase precipitate in the matrix\nis a function of the precipitate spacing or diameter L0 is precipitate spacing, D0 is\nprecipitate diameter, c0 is alloy concentration:\nGb\nL\nD\nL\nτ =\n(\n) ∼ c0\n1/3\nGbc 0\nD\nτ =\nSo, smaller diameters increase the shear stress required for dislocation motion, thus\n\"smaller diameters are stronger.\" This is valid down to the diameter where the dis\nlocation begins to cut through the particle, at which point the shear stress begins to\ndecrease with diameter.\n2. A second strengthening mechanism is solid solution strengthening (SSS). In SSS, al\nloying atoms fill either substitutional positions or interstitial positions in the lattice.\nIn a solid solution of concentration c0, the spacing of dissolved atoms on the slip plane\n-1/2\nGb\nL varies as c0\n. Since, τ = L , we have τ ∝ c 1/2 . So, the greater the concentration\nthe 'rougher' the slip plane, which reveals \"Smaller defect spacing is stronger.\"\n3. A third strengthening mechanism is strain hardening. When dislocations meet each\nother during plastic deformation they impede each other and also multiply. More\nplastic strain means more dislocations are created. Because a large shear stress is\nrequired to have one dislocation pass through another, a higher dislocation density\nmeans the shear stress required for dislocation motion should be higher. Thus if dis\nlocation density is higher, the space between dislocations is smaller. Therefore having\n\"smaller spaces between dislocations is stronger.\" Mathematically, this is seen by the\ndislocation density, ρ.\nLd\nρ = V\nwhere Ld\nV\n√\nis the dislocation line length in a given volume and\nis the volume. The\nspacing between dislocations can be thought of as Lds = 1/\nρ . Thus the distance\n√\nbetween other dislocations is Lds and τ = Gb = Gb ρ\nLds\n\n4. A final strengthening mechanism fitting into the \"smaller is stronger\" category is grain\nsize strengthening. Single crystalline grains are randomly aligned and misoriented\nwith each other. Thus, at a boundary, the dislocation has a problem entering the next\ngrain. The smaller the grain size, the more boundaries exist, therefore creating high\nimpedance to dislocation motion. Again,\"smaller grain size is stronger.\" The relation\nbetween grain size and strength is known as the Hall-Petch relation, σy = σ0 + Kd1/2\n\nProblem 3 (30 points)\nPART A: The elastic strain is not important because we are talking about a very large\ndeformation (H/H0 = 0.5 ≫ σy /E) Almost all of this deformation takes place in the plastic\nregime. This can be seen numerically. Because deformations are so large, true stress true\nstrain must be used.\nH\nH\nεtotal = ln(1 + εeng ) = ln(1 +\n- 1) = -0.69\n(18)\n-σy\nεelastic =\n= -0.0025\n(19)\nE\n|εelastic|\n|εtotal | ≪ 1.0 ⇒ εtotal ∼ εplastic\n(20)\nYou can see the percentage of total strain in the elastic region is only 0.3%.\nPart B: Considering now only analysis in the plastic regime, note the following relationship\nbetween the material strength, s and the absolute value of plastic strain, εp, is given to be\nlinear:\nds\nd εp = h\n(21)\nIntegrating that from εp = 0 gives:\ns\nεp) = s0 + hε p\n(22)\n0 is the stress at the beginning of plastic deformation. Because the loading is monotonic,\nonce yielding begins the following relationship is true (σ is negative in compression)\nσ\ns(\ns = = |σ| = -σ\n(23)\nAlso realize that in compression, axial strain is negative:\nεp = -εp\n(24)\nFrom part a) it was determined that ε ≈ εp Therefore we have\n-σ = s0 - hε\nσ = -s0 + hε\nDenote the condition where H/H0 = 0.5, ε = -0.69 with a subscript c.\nσc = -s0 + hεc ⇒ σc = -500 + 2000 × (-0.69) = -1886MP a\n(25)\nThus σ must equal σc when the desired deformation is achieved. The question asks for\nlargest diameter that can be safely used in the machine for this specific test. We have the\n\nconstraint that σ = σc. The machine has a load capacity of -100[kN], which means that\n|P | ≤100kN. For uniaxial compression,\nP\nσ =\n(26)\nA\nWhere P is the axial load and A is the cross sectional area.\n|P | = |σcA| ≤100[kN] ⇒σcA ≥-100[kN]\n(27)\nRealizing that area changes under plastic deformations and then realizing that the governing\nprinciple for area change under plastic deformation is volume conservation, we have:\nH\nH\nA = A0\n= 2A0\n(28)\nSo now we have:\n100[kN]\n2σcA0 ≥-100[kN] ⇒A0 ≤\n(29)\n-2σc\nRewrite in terms of the diameter\nπd2\nA0 = 4 ,\n(30)\nwe have:\n\nd ≤\n4 × 100[kN]\n-2πσc\n=\n4 × 100[kN]\n-2π(-1.886E6[kP a]) = 5.8[mm]\n(31)\nThus, the maximum diameter we can choose that will still be safe and give the dis- placement\nneeded is d = 5.8[mm].\n\nProblem 4 (20 points)\nPart A:\nPmax\n1.1[MN ]\n=\n= 440[MP a] > 350[MP a]\n(32)\nA\n25[mm] × 100[mm]\nThe as-received bar can not support the Pmax . The maximum load it can support without\nplastic deformation is:\nN\nPelastic = σy × A = 350[\n] × 25[mm] × 100[mm] = 0.875MN\n(33)\nmm\nPart B:\nUnder plastic deformation, there is no volume change:\nk=3\ndεp = 0\n(34)\nkk\nk=1\n33 = 0, thus we have:\nWe know that dεp\ndε(p) + dε(p) = 0 ⇒ dε(p) = -dε(p) = - dt\n(35)\nt\nSubstitution of dε(p) and dε(p) into the equation for the equivalent plastic strain increment,\nwe have:\n\n22 )2) = √ 2 |dt|\nd =\ndε(p)dε(p) =\n2((dε(p)\nεp\n\nij\nij\n11 )2 + (dε(p)\n(36)\n3 t\ni=1 j=1\nBecause dt < 0, the above equation can be rewritten as:\n2 dt\ndε p = -√\n(37)\n3 t\nIntegration of the above equation from ε p = 0, we get the expression of the equivalent\nplastic strain:\nt 2 dt\nε p = -\n√\n= √ lnt0\n(38)\n3 t\nt\nt0\nPart C:\n√ln t0\n√ln t0\nPmax\ntw\nt ]N\n= s(t) = σy [1 +\nt ]N ⇒ Pmax = twσy [1 +\n(39)\nc\nc\nSolving the above equation with matlab (Figure 2) for t, we get the maximum rolling=reduced\nbar thickness: tmax = 23.57[mm]"
    },
    {
      "category": "Resource",
      "title": "hw4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/24e5f169e36ba65fedd349a5c1e26cf9_hw4.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nHOMEWORK NO. 4\nDistributed:\nFriday, April 2, 2004\nDue:\nFriday, April 9, 2004\nProblem 1 (20 points)\nNote: for reference material, consult the laboratory writeup on elasticplastic\nbeam bending\nConsider the square crosssection beam shown, of dimensions h by h, subject to \"diamond\norientation\" bending in the plane shown (neutral axis: plane y = 0). The beam can be\nconsidered to be composed of an elastic/perfectlyplastic material having Young's modulus\nE , and tensile yield strength σy .\n1. Using the standard assumptions of engineering beam theory, evaluate the magnitude\nof applied moment, My , just sufficient to bring the most highlystressed region to\nthe verge of yielding. Express your answer in terms of h and material properties, as\nappropriate. (Aside: are you \"surprised\" by the value you got for I =\nR\ny2 dA in this\norientation?)\n2. If the applied curvature is increased to very large values, the elastic/plastic bound\naries (tension and compression sides) in this geometry, like those in the bending of\nrectangular crosssections studied earlier, will move inward, toward the neutral axis.\nAt \"infinite\" curvature, the boundaries will reach opposite sides of the y = 0 surface,\nresulting in tensile yielding stress values of magnitude σy in one \"triangle\" half of the\ncrosssection, and compressive yielding stress values of magnitude -σy in the other\ntriangular half of the crosssection. At this point, the bending moment carried by the\ncrosssection reaches a limiting value, ML. Evaluate ML for this section.\n3. Using your answers to the two previous questions, evaluate the ratio ML/My for bend\ning of this section. How does this value compare with the ratio for bending of this\nsame crosssection, but on rotated axes, so that the crosssection appears as a square?\n(Our usual orientation for bending.)\n4. Compare My for the \"diamond\" crosssection with the corresponding My for the square\norientation. What is the ratio of these firstyield bending moments? Explain why they\ndiffer in the way that they do. Evaluate the same ratio for the corresponding limit\nmoments, and ML, and comment on reasons why they differ. Which axes should be\nused for applying bending moments to a square section, and why?\n\nx\ny\nh\nh\nh\nh\n5. Discuss the residual stress state when the diamondorientation is unloaded to M = 0\nimmediately after being deformed to large curvature at M = ML.\nHow does this\nresidual stress state compare or contrast with the state for unloading of the square\norientation from its limit value of M? Can any negative moment be applied to the dia\nmond crosssection after unloading from limit load, without causing further plasticity?\nDiscuss\nFigure 1: Square crosssection of beam, oriented for bending along \"diamond\" orientation.\nProblem 2 (30 points)\nA great deal of the mechanisms and phenomenology of the strengthening of metallic crystals\ncan be summarized in the following phrase:\n\"Smaller is stronger . . .\"\nDiscuss three specific examples of strengthening mechanisms, and explain how\nand why the aphorism \"smaller is stronger\" applies to each strengthening mech\nanism.\n\nProblem 3 (30 points)\nStandard cylindrical compression specimens have an initial height to diameter ratio of\nH0/D0 = 2. It is desired to conduct a compression test in a demonstration lab, and to\ncompress the specimen to a final height of H = H0/2.\nFrom prior testing, it is known that the material has Young's modulus E = 200 GP a,\nPoisson ratio ν = 0.3, and its plasticity can be well characterized by an initial value of\ntensile/compressive yield strength as s0 = 500 MP a, along with a constant hardening mod\nulus, h = 2 GP a, governing the evolution of uniaxial flow strength, s, with equivalent plastic\nstrain, 2 p, according to\nds = h = constant.\nd 2p\nIn turn, this expression can be integrated to express the current value of strength, for any\ngiven value of 2p ≥ 0, as\ns( 2p) = s0 + h 2 p.\nThe load cell on the testing machine to be used for the compression test has a maximum\nload capacity of 100 kN.\nYou are asked to provide an answer to the following question:\n\"What is the largest allowed value of initial diameter in a compression spec\nimen of this material (D0(max) ) that can be safely compressed to half its initial\nheight in the testing machine?\"\nIn particular:\n- (10 points) Explain why the elastic strain is not an important feature in\nanswering this problem.\nThat is, explain why, for this application, you\nmay assume that the material is rigid/plastic, so that the total strains and\nstrain rates are essentially equal to the plastic strains and strain rates,\nrespectively.\n- (20 Points) What is the largest diameter that can safely be used for the\ncompression specimen, under the imposed conditions?\nHINTS:\n- Remember, for active yielding in uniaxial compression, the axial [true]stress, σ, is\n\nnegative, so the yield criterion becomes s = σ = -σ.\n- For monotonic loading in compression, the plastic portion of the [true] axial strain, 2 =\n=\n.\n2(p), is negative, and is thus related to the equivalent plastic strain by -2(p) . -2 = 2 p.\n\nμ\nv\nu\nu\nt\n¶\nProblem # 4 (20 points)\nLong bars of an alloy steel are available in stock of rectangular crosssection, with [initial]\nthickness t0 = 25 mm and width w0 = 100 mm. It is desired to use these bars as tensile\nloaded truss members, and to be able to apply tensile loads up to Pmax = 1.1M N without\ncausing plastic yielding in the bars. The initial tensile yield strength of the steel is σy =\n350 M P a.\n- Can the asreceived bars support a load of magnitude Pmax = 1.1M N without\nyielding? How much tensile load can it support without yielding?\n- It is known that the tensile flow strength, s, of this steel increases with equivalent\ntensile plastic strain, 2 p, according to\n2p ¶N\n\ns( 2p) = σ\n1 +\n,\ny\nc\nwhere the strain hardening exponent is N = 0.14, and the constant c = 0.01. Someone\nsuggests that it may be possible to coldroll the bar stock to a new crosssectional\nshape, of reduced thickness t, but essentially the same width, w = w0, and in the\nprocess generate enough equivalent plastic strain and associated strainhardening so\nthat the rolled bar stock can be used as truss members that can support tensile loads\nup to Pmax = 1.1M N without [further] plastic yielding, even though the rolling reduces\nthe thickness and crosssectional area of the bar. We will explore this possibility.\nFirst note that the equivalent plastic strain increment, d2 p, can be expressed in terms\nof the cartesian components of the plastic strain increment tensor, d2(p)\nij , by\nX\nX\nd2(p)d2(p) .\nij\nij\ni=1 j=1\nLet the rolling direction (along the length of the bar) be cartesian direction number\n1, let the throughthickness direction be 2, and let the breadth direction be 3. In the\nprocess of rolling, there is an incremental reduction in thickness, dt < 0, so that\nd2(p) = dt < 0.\nt\n.\nAs noted above, there is negligible transverse plastic straining in rolling, so d2(p) = 0.\nAssume further that rolling introduces no change in plastic shear strains (i.e., d2(p) =\nd2(p) = d2(p) = 0).\nObtain an expression for d 2p in terms of t and dt , and show how this ex\n| |\npression can be integrated to give\n2p\nd =\nμ t0\n2(p)\n\n= √\n3 ln\n.\nt\nHINT: something needs to be done about evaluating d2(p)\n11 ...\n\n- What is the maximum rollingreduced bar thickness, t = tmax , which gives a\nstrainhardened strength s and rollingreduced thickness t = tmax combina\ntion such that the coldrolled bar stock does, indeed, support tensile load\nPmx = 1.1MN without further yielding?\nNote: this part of the problem may best be solved by performing a set of numerical\nevaluations, for different values of thickness, and finding out which tvalue answers the\nquestion."
    },
    {
      "category": "Resource",
      "title": "hw5_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/465cb87df9544456d005036b8af19800_hw5_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nHOMEWORK SOLUTION NO. 5\nDistributed:\nWednesday, April 10, 2003\nDue:\nWednesday, April 16 , 2003\nProblem 1 (30 points)\nThe critical stress intensity factor, KIC , is given by the inequality\nKIC ≥ Qσinf√πa\n(1)\nSolving for the critical crack length, acrit we get\n¶2\n1 μ KIC\na ≤ acrit ≡\n(2)\nπ\nQσinf\nFor an edge crack (whose length is less than or equal to 0.65 times the plate's width, w), the\nconfiguration correction factor, Q, is\n1.12\nQ = 3\n1 - 0.7\n¡ a ¢1.5 3.25\n(3)\nw\na\nWe are told that the the plate is large, which implies that w ¿ 1. It is also explicitly stated\nthat\nQ = 1.12\n(4)\nWe are also told to use a design stress equal to 0.6 times the minimum yield strength.\nσinf = 0.6 σymin\n(5)\nSubstituting equations 4 and 5 into equation 2 we get\n1 μ\nKIC\n¶2\nacrit =\n(6)\nπ\n0.672σymin\n\nWe are asked to compare the critical crack sizes for four different grades of steel. The values\nof σymin and KIC for these steels are given in the second and third columns of table 1. The\nfourth column of the table contains the critical crack length as computed by equation 6.\nSteel\n(ASTM Grade)\nσymin\n[ksi]\nKIC at -60oF,\n[ksi\n√\nin]\nacrit\n[in]\nA36\n1.958\nA441\n0.792\nA572\n2.82\nA514\n0.254\nTable 1: Material properties and Critical crack length for available steels\nBased on table 1, the steel that would most likely be selected is A572. A572 would be chosen\nfor two reasons\n1. it has the largest critical crack size, of nearly 3 inches. Critical cracks could be easily\nspotted by the human eye during routine maitenance.\n2. its σymin is larger than all of the other steels, except A514. This means a smaller\namount of steel would be needed to construct the bridge, likely making it cheaper.\nIf A36 cost less than half as much as A572, it might be selected instead on the basis of cost.\n(Note that the real world price of A36 is NOT less than half that of A572). This is an option\nbecause A36 also has a large critical cracksize; it is nearly 2 inches. A441 and especially\nA514 would be eliminated on the basis of small critical crack size.\nWhile not enough information was given in this problem to make a decision based on fatigue,\nit should be noted that fatigue will be a key factor simply because the structured being\ndesigned is a bridge. This is due to the fact that bridges are frequently loaded and unloaded\nby the passage of cars over them.\n\nMASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSOLUTIONS FOR HOMEWORK NO. 5\nProblem 2\nThere are no detectable cracks, so I assume the 'worst case' scenario, which is the presence\nof the largest possible, undetected cracks, which is 5mm. Since it is stated that the plate is\na\nlarge, w ' 0 and it is safe to assume that the configuration correction factor, Q, is Q = 1.12.\nAssuming the plate will fail by brittle fracture, the stress at which this occurs can be found\nby\nKIc = Qσinf\n√πa\n(1)\nwhere KIc is the given fracture toughness, σinf is the far-field, or applied stress at fracture\nand a is the crack length. Solving for the fracture stress yields\nσinf = KI c\nQ√πa =\n27MPa√m\n1.12√3.14 × 0.005m = 192MPa\n(2)\nThus, fast fracture occurs at 192MPa. Note that this is the far field stress. In order\nto determine when large-scale yielding occurs, we need to calculate the net stress at the\nuncracked ligament on the crack plane, σnom, which is higher than the far field stress, σinf,\nsince the net section area on the crack plane, Anet is smaller than the nominal area away\nfrom the crack plane, Ainf. However, given that the plate is large, it can be assumed that\nthe nominal and net section areas are roughly the same. Therefore, when the far field stress,\nσ\nis 192MPa, the nominal stress σnom is roughly equal to that, which is much lower than\ninf\nthe yield strength of the material. Thus, the plate will fail by brittle fracture before large\nscale yielding occurs.\n\nProblem 3\nFrom Figure 8.36 (p326 Dowling), the fracture toughness for the lowest operating tempera\nture for this problem is ∼ 35MPa√m. In general\nKI\nKIc\n= σ(frac)\n(3)\nσb = Q√πa ≤ Q√πa\nb\nwhere σb is the applied stress in the flange. Thus, failure will occur at\nσb = σ(f rac)\nKIc\n35MPa√m\n=\n=\n(4)\nb\nQ√πa\n1.12√3.14 × 0.015m = 144MPa\nQ can be safely assumed to be Q = 1.12 since the cracked flange can be treated as an edge-\ncracked tension member and a/w ≤ 0.3. To account for the safety factor, we simply need\nto divide the stress result by the factor. Thus, σ∗= 1\nσ\n.\nb\n5 = 96MPa. This is the maximum\nb\nstress in the cracked flange that can be permitted while retaining a safety factor of at least\n1.5 with respect to fracture. The area moment of inertia, Ix for this shape is given as\nIx = 1.29 × 10-4m4 or it can be manually calculated from page 782 (Dowling). Thus, the\nmaximum permissible bending moment is\nM ∗ = σb\n∗Ix = 96MPa1.2910-4m4\n= 81.5kNm\n(5)\ny\n.152m\nThe maximum moment permitted by the standard design code against yielding is significantly\nhigher than the one calculated against brittle fracture which suggests that the structural\nmember will fail by brittle fracture. This is due to the relatively large crack which would\nnormally be detected by standard inspection techniques.\n\nProblem 4\nThe problem is about an edge crack in a long strip with given width and thickness, subjected\nto a cyclic bending moment. The bar will fail at the peak tensile stress, which is related to\nthe maximum bending moment by\nσb = M(max)y\nI\n= 6M(max)\ntw2\n= 555M P a\n(6)\nThe critical fracture toughness, Kc can now be calculated from\nc = Qσb√πaf = 1.12 × 555M P a\n√\nπ × .014m = 130M P a√m\n(7)\nIn order for small-scale yielding conditions to apply, the following quantity needs to be\nevaluated\n1 Kc\n(\n)2 = 1.7mm\n(8)\n2π σy\nand the following to hold\na, (w - a), h ≥\n( KIc )2 = 26mm\n(9)\n2π\nσy\nh and (w - a) are adequately large to satisfy the above condition. However, the ratio\na/ 2\nπ ( Kc )2 = 8 and thus the plastic zone at fracture is only ∼ 1/8 of the crack size and\nσy\nLEFM and SSY are close.\na is less than 26mm and therefore final failure doesn't take place under small-scale yielding\nconditions.\nSimilarly, in order for plane strain conditions to apply, the requirement is that\nt ≥\n( KIc )2 = 26mm\n(10)\n2π\nσy\nThe ratio t/ 2\nπ ( Kc )2 = 7. Although it doesn't satisfy the plain strain condition, the ratio is\nσy\nlarge enough to suggest that the results should be close to LEFM."
    },
    {
      "category": "Resource",
      "title": "hw5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/e4e218c69cb5b13c3244287a2b80841c_hw5.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nHOMEWORK # 5\nDistributed:\nWednesday, April 7, 2004\nDue:\nWednesday, April 14, 2004\nProblem 1\nThe typical properties of several steels that are being considered for use in bridges in Alaska,\nand therefore will have service temperatures as low as -60oF , are as follows:\nSteel\n(ASTM Grade)\nMinimum Yield\nStrength (ksi)\nYield Strength\nat 60oF ,(ksi)\nKIc at -60oF ,\n(ksi\n√\nin)\nA36\nA441\nA572\nA514\nFor a design stress of 0.6 of the minimum yield strength [to be encountered in service],\ncompare the critical crack sizes for fast fracture at the design stress for each steel. Use an\nedge crack in a large plate for your analysis (note: for this geometry, the numerical value\nof the configuration correction factor is Q = 1.12). With which material would you choose\nto design? Discuss the tradeoffs you are aware of, including how your inspection technology\nmight influence your decision.\n\na\nw\nt\nM\nM\nProblem 2\nA large thick plate of 7075T651 aluminum alloy is examined by nondestructive techniques\nand is found to contain no detectable cracks. In current engineering practice, flaws less\nthan 5 mm in length are not usually reliably detected in large engineering components.\nAssume that the plate contains an edge crack of length at this limit (5 mm) of detection,\nand determine if the plate will undergo general yielding or fail by fast fracture before general\nyielding occurs when subject to tensile loading normal to the presumed crack.\nWhat is the stress at which failure would occur?\nσy = 503 MPa,\nKIc = 27 MPa√m.\nProblem 3\nDowling text, problem 8.15, page 352 (Second Edition).\nProblem 4\nA bar of 4340 steel, of thickness t = 12 mm and width w = 60 mm, is subjected to a cyclic\nbending moment that ranges from maximum value M(max) = 4 kNm to minimum value\nM(min) = 0.8 kNm.\nFigure 1: Schematic of edgecracked specimen under bending.\nThe steel has Young's modulus E = 208 GPa, Poisson ratio ν = 0.3, tensile yield strength\nσy = 1255 MPa, and ultimate tensile strength UTS = 1295 MPa.\nAfter 60, 000 cycles of the loading describ ed, the bar fractures, with failure due to a through\nthickness edge crack of [failure] length af = 14 mm, emanating from the \"tensile side\" of the\nbending stress field.\n\nThe stress intensity factor for a rectangular beam containing an edge crack of length \"a\"\nand subjected to bending moment \"M \" can be expressed as\nKI = Q σb\n√πa,\nwhere σb is the peak tensile bending stress in the uncracked beam, subjected to bending\nmoment M , and the configuration correction factor can be taken as constant, Q = 1.12,\nproviding the relative crack depth a/w <∼ 0.3.\n- Estimate the fracture toughness of the 4340 steel.\n- Based on your estimate, do you think that final failure took place under smallscale\nyielding conditions? Under crackfront plane strain conditions? Discuss."
    },
    {
      "category": "Resource",
      "title": "practice_q1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/120aaadd7480d3514582ccd7cecb3c97_practice_q1_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSOLUTION for QUIZ NO. 1\nOctober 15, 2003\nProblem 2 (20 points)\n- For an imposed strain history consisting of a rapidly applied step-function jump in\nstrain of magnitude 20, and applied at time t = 0, the stress relaxation function Er (t)\nis defined by\nσ(t)\nEr (t) = 20\nThe stress relaxation function acknowledges that in a linear viscoelastic material stress/strain\nis a function of time. In linear viscoelastic behavior, the time dependance will die out\nand the stress will eventually reach a \"relaxed value\".\n- For an imposed stress history consisting of a rapidly applied step-function jump in\nstress of magnitude σ0, and applied at time t = 0, the creep function Jc(t) is defined\nby\n2(t)\nJc(t) = σ0\nThe creep function is used when a constant stress is applied and the strain then changes\nwith time (or \"creeps\".) In linear viscoelastic behavior, it will creep until the time\ndependance dies out and reaches a constant strain.)\n- The Correspondence Principle states that linear elastic models can be applied to lin\near viscoelastic problems with equal geometries by replacing E with Er (t) or 1/Jc(t)\ndepending on whether the displacement or load is held fixed in time.\nExample: For a simply supported beam with a constant point load in the center, the\ndisplacement at the center is modelled by\n-PL3\nδ = 48EI\nIf the beam has a is made of a linear-viscoelastic material and the load P is applied\nsuddenly at time t = 0, the deflection will vary over time and E can be replaced by\nJc(t)\nδ(t) = -P L3Jc(t)\n48I\n\n- The molecular structure of an amorphous polymer consists of long polymeric chains\nthat are randomly oriented and intertwined. It is termed amorphous because there is\nno order to its structure. The solid is held together in two ways: through weak van\nder Waals and hydrogen bonding and also through the mechanical intertwining of the\nchains.\nThe major feature of amorphous polymers is the glass transition temperature (Tg .)\nWhen the temperature of the polymer is greater than Tg , there is enough thermal en\nergy in the chains of atoms to break free from most of the van der Waals bonds. Thus\nwhen an amorphous polymer is loaded, the chains move more freely than if the van der\nWaals bonds were present. Thus it takes less load to displace the material a certain\namount when the material is above Tg compared to below and a very large drop in\nE is noticed when T > Tg . Also, E of amorphous polymers are less than the elastic\nmodulus of crystalline and semi-crystalline polymers.\nThe time dependent mechanics arises through the intertwining of the chains and the\nweak bonds. Linear viscoelastic behavior is noticed even at low temperatures much\nbelow Tg, even though the behavior is mostly linear elastic and only slightly viscous.\nThe opposite occurs at temperatures above Tg. For T > Tg the material is mostly a\nvery viscous fluid, and shows only slight linear elasticity. Regardless, the two behaviors\nare seen for most temperatures and the material is linear viscoelastic.\nThe polymer chains will begin to line up under plastic deformation when T < Tg,\nor under most loadings when T > Tg.\nProblem 3 (40 points)\n- In the central portion of the composite plate, the top and bottom surfaces of the plate\nare free boundaries, which have zero traction on it. For example, for the top surface,\nthe traction is\nt(n) = σn =\n⎡\n⎣\n⎡\n⎣\n⎤\n⎦\n⎤\n⎦ =\n⎡\n⎣\n⎤\n⎦ = 0\n(1)\nσ11 σ12 σ\nσ\nσ21 σ22 σ\nσ\nσ31 σ32 σ\nσ\nWe know if the vector t(n) = 0, its components must be equal to zero. So, σ13 = 0,\nσ23 = 0, and σ33 = 0 on the top surface. Similarly, we know at the bottom surface\nσ13 = 0, σ23 = 0, and σ33 = 0.\nAdditionally, since the stress tensor is symmetric, we have σ31 = σ13 = 0, σ32 = σ23 = 0.\nThe only components left are in the 1-2 plane, σ11, σ22, and σ12 = σ21; this is plane\n\nstress. By assuming plane stress in the middle layer as well, traction will be zero on\nboth side of the interface, and therefore equal.\n- At the bonding interface, since the two materials are bonded perfectly, the displacement\nmust be continuous across the interface. At the bonding plane, for each material, we\n(P C)\n(P C)\nhave u1\n(Al) = u1\nand u2\n(Al) = u2\n. From the strain-displacement relations,\n∂u1\n∂u2\n1 μ ∂u1\n∂u2\n¶\n211 =\n; 222 =\n; 212 =\n+\n(2)\n∂x1\n∂x2\n∂x2\n∂x1\n= 2(P C) , 2(Al) = 2(P C)\n= 2(P C)\nwe can get 2(Al)\n, and 2(Al)\n.\n- As the temperature change ΔT is constant in all layers, and the total strain is also\nconstant in all layers, from the constitutive equations,\nE\n\"\nν\nA\n1 + ν\n#\nσij =\n2ij +\nX\n2kk\n!\nδij -\nαΔT δij\n(3)\n1 + ν\n1 - 2ν\n1 - 2ν\nk=1\nthe stress components will be constant within respective layers, i.e. σij = σ(Al) in the\nij\nouter layer, and σij = σ(P C) in the central layer, for to-be-determined sets of constants\nij\nσ(Al) and σ(P C)\nij\nij\n.\n- As shown in the above, we know the stress will be constant throughout respective\nlayers. Let us make a rectangular region cutting from the center till the edge that\nperpendicular to x1 axis throughout the thickness. At the edge side, there is no force\nacting on it since it is zero traction boundary. So, at the interior boundary, the net\nreaction force should also be zero. We already knew that the plate is in plane stress\nstate.\nIn the figure 1 , the plane cut perpendicular to x2 will also have the zero net force.\nBecause of the material and geometric symmetry of the plate along the x1 - x2 plane\ncross the origin, the stress at the top Al layer and bottom Al layer will have same\nvalue.\nZ t/2\n=\nσ11(x3)dx3\n-t/2\n=\n2σ(Al)A(Al) + σ(P C)A(P C)\n=\n2σ(Al)L2t(Al) + σ(P C)\nL2t(P C)\n(4)\n=\n2σ(Al)t(Al) + σ(P C)\nt(P C)\n(5)\nFollowing a similar argument along the axis x2, we can get the similar relation held for\nthe x2 component of force balance.\n\nx1\nx3\nx2\nActually, because of the material and geometric symmetry of the plate along the axis\nx1 and x2, we can derive that σ11 = σ22 in respective layers.\nFigure 1: free body diagram of a section cut from the central portion\n- The plate is in plane stress state. The only non-zero stress components are σ11,σ22 and\nσ12. According to the constitutive equation,\n2ij = αΔTδij + 1\nE\n\"\n(1 + ν)σij - νδij\nA 3\nX\nk=1\nσkk\n!#\n(6)\nwe have\n2(Al)\n11 = αAlΔT + 1\nEAl\n(σ(Al)\n11 - νAlσ(Al)\n22 ) = 20\n(7)\nAs shown in the previous part, σ11 = σ22, we have\n2(Al)\n11 = αAlΔT + 1\nEAl\nσ(Al)\n11 (1 - νAl) = 20\n(8)\nSimilarly, we have the constitutive relation in PC layer\n\n2(PC)\n1 σ(PC)(1 - νPC) = 20\n(9)\n= αPCΔT + EPC\nGrouping equations 8, 9 and 5, we have three equations and three unknowns. 20, σ(Al)\nand σ(PC) can be solved.\n2(Al)\n(10)\n11 = αAlΔ\n1 σ(Al)(1 - νAl)\n= 202(PC)\nT + EAl\n= αPCΔ\n(11)\nT +\n1 σ(PC)(1 - νPC)\n= 202σ(Al)t(Al) + σ(PC)t(PC) = 0\n(12)\nEPC\nThe values of 2(Al) and 2(PC) can be found from the constitutive equation\n2(Al)\n33 = αAlΔT + 1\nEAl\n(-νAlσ(Al)\n11 - νAlσ(Al)\n22 )\n(13)\n2(PC)\n= αPCΔT + 1\nEPC\n(-νPCσ(PC)\n- νPCσ(PC)\n)\n(14)\nWe know,\nE(Al) = 72GPa\nν(Al) =\n0.3\nα(Al) = 23 × 10-6/*K\nE(PC) =\n2.5GPa\nν(Al) =\n0.4\nα(Al) = 65 × 10-6/*K\nΔT = 50*C\nFrom Substitute all these values to the equations above, we can get\nσ(Al) = 104MPa\nσ(Al) = 104MPa\nσ(PC) = -12.9MPa\nσ(PC) = -12.9MPa\n20 =\n6.35 × 10-3\n2(Al) =\n2.83 × 10-4\n2(PC) =\n7.38 × 10-3\n(15)\n\n- The total thickness change includes the thickness change from two Al layers and the\nPC layer.\nΔt = 2Δt(Al) + Δt(P C)\n= 2t(Al)2(Al)\n33 + t(P C)2(P C)\n=\n=\n2 × 0.25 × 2.83 × 10-4 + 4 × 7.38 × 10-3\n0.0297mm\nProblem 4 (30 points)\n- A loading diagram (fig 2 ) shows that this is a simple case of a beam in bending and\nbeing torqued. There is torque on the shaft, but the load from the pulley also puts it\ninto bending. The goal is to reduce stresses in the shaft due to a bending moment and\na torque.\nThere should be two obvious places where stresses could be high. The first place\nis at the maximum moment due to bending(point A). The second place is where a\nstress concentration would most likely occur: the abrupt change in diameter (point B).\nThus the goal is now more narrowly defined: reduce bending moment at point A, and\nreduce the stress concentration at point B.\nTo reduce the bending moment at A, first realize that you are GIVEN the diameters\nd and D, the power going into the shaft (T orque ∗ angularvelocity), and the pulley\nitself as design constraints. Look at the diagram to see the only design parameter left\nas a variable is the DISTANCE FROM THE PULLEY TO THE BEARING (L). The\nbearing constrains the shaft to have zero displacement at that point and zero slope,\nhence it is a cantilevered boundary condition. Realizing this is a cantilevered beam,\nthe moment at point A is:\nM = L(T1 + T2)\n(16)\nWhere T1 + T2 is simply the force from the belt on the pulley. Regardless the only\nvariable in this case is L, and to reduce the bending stress you should MINIMIZE L.\nTo reduce stress concentrations, shape transitions should be smooth. Because a tor\nsional loading and bending loading exists, a large radius at point B will help to reduce\nthe stress concentration at the shoulder (see fig 3 for a plot of shear stress distribution\nwith a stress concentration). The stress concentration for a shaft in tension with a\nshoulder is:\ns\nd\nKt ≈ 1 + α\nρ\n\n, where ρ is the radius of the shoulder and d is the smaller radius of the shaft. α\nis a constant. Please see Dowling, p790 for a plot of the stress concentration for a\nbending moment. The larger the radius, the better. Of course the effect of large radius\nand short L are competing against each other (larger R means longer L), and there is\nprobably an optimum radius for a minimum stress, depending on what kind of failure\nyou are worried about.\nThe point of this problem is the two \"driving forces\" of this problem are the stress\nconcentration for torsion and bending and the bending moment on the shaft. All other\neffects, such as friction in the bearing (affecting the torque), position of the second\nbearing, are secondary. Choosing a shaft with a larger G will affect the angular deflec\ntion in the shaft: the strains. In this case we are worried about stresses. The stresses\nare determined from equilibrium, not G.\n- From the compatibility equation\n∂2212\n∂2211\n∂2222\n=\n+\n(17)\n∂x1∂x2\n∂x2\n∂x2\nwe can verify whether or not the polynomial expression is exact.\nIn the problem,\n∂2211\nx1\n=\n∂x2\nl4\n∂2222\nx2\n=\n∂x2\nl4\n∂2212\nx1 + x2\n=\n(18)\n∂x1∂x2\nl4\nthey indeed satisfy the compatibility relation of eqn 17\n- Limitations of Linear Elastic Analysis.\n- Material is in plastic regime (cannot be predicted by linear elasticity)\n- Material fractures (cannot be predicted by linear elasticity)\n- Large deformations in material (LINEAR elasticity is valid only for small strains and\nrotations where the second-order (non linear) terms can be neglected)\n- Instability phenomena, e.g. Buckling. Stability of equilibrium requires additional\nconsiderations of the nonlinearly deformed configurations.\n- Time dependant behavior: viscoelasticity, creep, etc.\nThe first pillar of Solid Mechanics is Displacements (strains). This is associated with\nthe 3rd limitation above.\nThe second pillar of Solid Mechanics is the constitutive relations between displace\nments and forces (strains and stresses). The relations between stress and strain is not\n\nthe same for materials undergoing plasticity when compared to elasticity, as well as\nmaterials that creep. The relations between material separation (fracture) and loading\nis also not covered in linear elasticity.\nThe third pillar of solid mechanics is forces and equilibrium. Buckling is a phenomenon\nthat results when forces are in equilibrium, but the system is not stable. Linear elas\nticity acknowledges equilibrium but not stability, at least without consideration of the\nnon-linear geometric terms associated with the bucking mode.\n\nBearing\nBearing\nShaft\nA\nB\nForce on pulley\nL\nd\nD\nBearing\nBearing\nShaft\nA\nForce on pulley\nL\nd\nD\nR\nBad Design: Has larger moment at points A and B due\nto a large length L. There is also large stress concentration at\npt B due to the lack of a radius at the shoulder\nGood Design: By minimizing the distance L, the\nmoments have been reduced and by maximizing the\nradius at the shoulder (pt b), we have reduced stress\nconcentrations due to an abrupt change in diameter.\nBy reducing the maximum stresses, the likelihood of\nfailure is reduced and thus the design is better.\nProb. 4a\nFigure 2: Problem 4a Design layouts\n\nT2\nT1\n2R\nd\nτ\nτ\nM = L ( T1 + T2 )\nM\nσ\nTorque = R ( T1 - T2 )\nFigure 3: Stress distribution in the shaft"
    },
    {
      "category": "Exam",
      "title": "practice_quiz1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/198e2b56255edc72a37146e5505141ec_practice_quiz1.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nPRACTICE QUIZ I\nDistributed:\nWednesday, March 10, 2004\nThis quiz consists of four (4) questions. A brief summary of each question's content and\nassociated points is given below:\n1. (10 points) This is the credit for your (up to) two (2) pages of selfprepared notes.\nPlease be sure to put your name on each sheet, and hand it in with the test\nbooklet. You are already done with this one!\n2. (20 points) A multipart, labbased question.\n3. (40 points) A question about thermal loading of a laminated plate.\n4. (30 points) Three shortanswer questions.\nNote: you are encouraged to write out your understanding of the problem, and of \"what\nto do\" in order to solve the problem, even if you find yourself having \"algebraic/numerical\ndifficulties\" in actually doing so: let me see what you are thinking, instead of just what you\nhappen to write down....\nThe last page of the quiz contains \"useful\" information. Please refer to this page for equa\ntions, etc., as needed.\nIf you have any questions about the quiz, please ask for clarification.\nGood luck!\n\nProblem 1 (10 points)\nAttach your selfprepared 2sheet (4page) notes/outline to the quiz booklet.\nBe sure your name is on each sheet.\nProblem 2 (20 points)\n(LabBased Problem)\nIn your own words, describ e the following terms used in the description of linear vis\ncoelastic behavior, and briefly illustrate (with schematic figures, simple equations, etc.) how\nthese features are used, measured, or are otherwise identified:\n- (4 points) stress relaxation function\n- (4 points) creep function\n- (4 points) correspondence principle\n- (4 points) mechanical damping\n(4 points) Broadly describ e the essential molecular structure and major features of the\nmechanical behavior of an amorphous polymer (1 page, maximum).\n\nx1\nx2\n(PC)\n(AL)\nL2\nL1\nt(AL)\nt(AL)\nt(PC)\nx3\nProblem 3 (40 points)\nA large 3layer laminated plate is constructed by bonding identical layers of aluminum (AL)\non the top and bottom of a plate of polycarbonate (PC), as shown in Figure 1. The outer\nlayers of AL have thickness t(AL) = 0.25 mm, while the central layer has thickness t(P C) =\n4 mm, for a total plate thickness t = t(P C) + 2t(AL) = 4.5 mm.\nMaterial properties for each material are as follows: for AL, E(AL) = 72 GP a; ν(AL) = 0.3,\nand α(AL) = 23 × 10-6/*K.\nFor the PC, E(P C) = 2.5 GP a; ν(P C) = 0.4, and α(P C) =\n65 × 10-6/*K.\nThe cartesian coordinate directions 1 and 2 lie in the plane of the plate, with the origin of\nthe x3 coordinate axis located at the midthickness of the plate. The inplane dimensions of\nthe plate are large compared to thickness t. After bonding, at room temperature, all stress\nand strain components are initially zero throughout the plate.\nThen, the temperature in the laminated plate is uniformly increased by an amount ΔT =\n50*C, without application of external loading.\nFigure 1: Schematic of a rectangular block cut from the central portion of the 3layer lami\nnate.\n- (5 points) Briefly explain why you should expect each material layer in the central\nportion of the laminated plate to be in a state of plane stress, with due regard for\nthe traction boundary conditions on the top and bottom surfaces of the plate (at\nx3 = ±t/2).\n- (5 points) Assume that the total strain within each layer is piecewise constant; that\nis, 2ij = 2(AL) in both of the outer layers, but 2ij = 2(P C) in the central layer, where\nij\nij\n\n2(AL) and 2(P C) are respective sets of constants (to be determined). Explain why it is\nij\nij\n2(P C) , 2(AL) = 2(P C)\n2(P C)\nnecessary for 2(AL) =\n, and 2(AL) =\n.\n- (5 points) With constant temperature change ΔT in all layers, and constant total\nstrain within each layer, explain why the stress components must be constant within\nσ(P C)\nrespective layers; i.e., σij = σ(AL) in the outer layers, and σij =\nin the central\nij\nij\nlayer, again for tobedetermined sets of constants σ(AL) and σ(P C) .\nij\nij\n- (5 points) Construct a free body diagram of small rectangular region [mathematically!]\ncut from the central portion of the large plate, of full thickness t, and exposing a\nrectangular interior surface of length L2 perpendicular to the x1 axis, and a similar\nsurface of length L1 perpendicular to the x2 axis, as shown in Figure 1. Assuming that\n2(AL) = 2(P C) = 0, show that force equilibrium in the x1 direction requires that\nZ t/2\n0 =\nσ11(x3) dx3 = 2t(AL) σ(AL) + t(P C) σ(P C) ,\n-t/2\nwith a similar relation holding for the x2 component of force balance.\n- (15 points) Assuming that the total strain components 211 = 222 ≡ 20 throughout the\n, 2(P C)\nplate, derive symbolic equations that let you solve for values of 20, 2(AL)\n, and\nσ(AL) and σ(AL), as well as σ(P C) and σ(P C) . Provide numerical values (including units)\nfor all quantities.\n- (5 points) By how much does the total thickness of the plate change (in mm), in\nresponse to the temperature change?\n\nProblem 4 (30 points)\n- (10 points) A large shaft of diameter D passes through two bearings, within which the\nshaft rotates. At one end of the shaft, beyond the nearest bearing, power is transmitted\nto the shaft through a large, beltdriven pulley. In this region, the shaft diameter is to\nbe reduced to a value \"d\" (d < D) in order to fit the end of the shaft onto the central\nhole in the pulley (hole diameter: ∼ d). Briefly discuss design features and details that\nwill help keep stress suitably small in the shaft.\n- (10 points) In a certain twodimensional region, the following polynomial expression\nhas been proposed to describ e the spatial variation of the inplane components of the\nstrain field:\n211(x1, x2) = 20\nx1x ;\n11 +\n`4\n222(x1, x2) = 20\nx1x ;\n22 +\n`4\nx1x2\n212(x1, x2) = 20\nx1x2 +\n,\n12 +\n3`4\nwhere 20 are dimensionless constants, and ` is a lengthdimensioned constant. Is it\nij\npossible for this polynomial expression to be exact? Explain why or why not.\n- (10 points) The mechanical behavior of by far the majority of engineering structures\nis analyzed using linear elasticity. List three possible types of phenomena that might\nlimit the applicability of a linear elastic analysis. (Hint: consider the \"three pillars\" of\nsolid mechanics, and how each is used within linear elasticity.)\n\n\"\nA\n!\n#\n\"\nA\n!\n#\n¶\nIsotropic Linear ThermalElasticity\n(Cartesian Coordinates)\nStress/Strain/TemperatureChange Relations:\nX\n2ij = αΔT δij +\n(1 + ν) σij - ν\nσkk\nδij .\nE\nk=1\nE\nX\nν\n(1 + ν)\n(1 - 2ν)\nσij =\n2ij +\n2mm\nδij -\nαΔT δij .\n(1 + ν)\n(1 - 2ν)\nm=1\nStraindisplacement Relations:\n1 μ ∂ui\n∂uj\n2ij =\n+\n.\n∂xj\n∂xi\nEquilibrium equations (with body force and acceleration):\nX\n∂2ui\n∂σij + ρbi = ρ\n∂xj\n∂t2\nj=1\nMises Stress Measure:\nr\n1 [(σ11 - σ22)2 + (σ22 - σ33)2 + (σ33 - σ11)2] + 3 [σ2\n23 + σ2\n12 + σ2\nσ ≡\n].\nTraction on elemental area with unit normal \"n\":\nX\nti(n) =\nσij nj .\nj=1"
    },
    {
      "category": "Exam",
      "title": "quiz1_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/18ab35a40d0eba555bef33dc8cffa42b_quiz1_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nQUIZ I\nSOLUTIONS\nDistributed:\nWednesday, March 17, 2004\nThis quiz consists of four (4) questions. A brief summary of each question's content and\nassociated points is given below:\n1. (10 points) This is the credit for your (up to) two (2) pages of selfprepared notes.\nPlease be sure to put your name on each sheet, and hand it in with the test\nbooklet. You are already done with this one!\n2. (20 points) A labbased question.\n3. (40 points) A multipart question about a linear elastic boundary value problem.\n4. (30 points) A 'design for yield' question.\nNote: you are encouraged to write out\n- your understanding of the problem, and\n- your understanding of \"what to do in order to solve the problem\", even if you find\nyourself having \"algebraic/numerical difficulties\" in actually doing so: in short,\n- let me see what you are thinking, instead of just what you happen to write down....\nThe last page of the quiz contains \"useful\" information. Please refer to this page for equa\ntions, etc., as needed.\nIf you have any questions about the quiz, please ask for clarification.\nGood luck!\n\nProblem 1 (10 points)\nAttach your selfprepared 2sheet (4page) notes/outline to the quiz booklet.\nBe sure your name is on each sheet.\nProblem 2 (20 points)\n(LabBased Problem)\nIn your own words, describ e the following terms used in the description of linear elastic\nstress concentration, and briefly illustrate (with schematic figures, simple equations, etc.)\nhow these features are used, measured, or are otherwise identified:\n- (5 points) stress concentration factor\nA stress concentration factor, Kt, can be defined as the ratio of the [peak] value of a\nstress component,σlocal, at a highlystressed location (e.g., a notch root) to a nominal,\nor farfield value of a stress component, σnom , that is [typically] readily associated with\noverall loading:\nσlocal\nKt ≡ σnom\n≥ 1.\n- (5 points) St. Venant's principle St. Venant's principle states that the perturbation\nin a nominally homogeneous stress state introduced by a [geometric/material] hetero\ngeneity (e.g., a hole, notch, cutout, or reinforcement) of characteristic linear dimension\n\"`\" decays rapidly with distance from the heterogeneity. In practice, the effects of the\nperturbation in the stress field are negligible for distances greater than ∼ 3`.\n(10 points) Describ e \"best practice\" in the location of a resistance strain gauge to\nmeasure stress concentration at the root of a throughthickness notch in a planar body\nsubjected to inplane loading. (1 page, maximum).\nThe key ideas here are to note that (a) a strain gauge records an average value of strain\nparallel to its direction, with the region sampled being that beneath the gauge, and (b), in\nthe presence of strong stress concentration, there are steep gradients in the values of inplane\nstrain (and stress) in the immediate vicinity of the notch root. Thus, any attempt to use a\nlaterallymounted strain gauge in order to estimate the strain concentration \"at\" the root\nof the notch will be hindered by the inherent averagingin of lower [than peak] strain in the\nregion under the gauge.\nConversely, viewing the body as having a small but finite thickness, t, at its notch root, the\nvariation in strain along the notch is generally much less rapid than its variation \"radially\"\naway from the notch surface. Thus, a strain gauge mounted on the tthick surface of the\nnotch root provides a much more reliable estimate of the peak strain at the notch than can\nbe obtained from a similar gauge mounted laterally on the faces of the body.\n\nProblem 3 (40 points)\nA large isotropic linear elastic body contains a long, embedded fiber, of radius a, extending\nparallel to the x3 axis (see Fig. 1, below). The fiber is made of a different material than\nthe surrounding matrix; elastic moduli of the fiber greatly exceed those of the surrounding\nmatrix. Thus, as an approximation, we can treat the fiber as a rigid, nondeforming body.\nUnder a certain loading of the fibercontaining matrix, the spatial variation of the compo\nnents ui of the displacement vector u in the matrix region is described by\nu1(x1, x2, x3)\n=\nu2(x1, x2, x3)\n=\nμ\na\n¶\nu3(x1, x2, x3)\n=\nγ x2\n1 -\nx1 + x2\n,\nfor a dimensionless constant \"γ\" satisfying γ ¿ 1. (N.B.: These expression apply only in\n| |\nthe matrix region exterior to the rigid fiber; that is, at locations satisfying x1 +x2 ≡ r2\n.\n≥ a\n- (5 points) Evaluate the spatial dependence of all components of the strain\ntensor, 2ij\n≡ ∂u1\n∂x1\n= 0\n≡ ∂u2\n∂x2\n= 0\n212 = 221\n≡\n≡\n∂u3\n∂x3\n= 0\nμ ∂u1\n∂x2\n+ ∂u2\n∂x1\n¶\n= 0\n213 = 231\n223 = 232\n≡\n≡\nμ ∂u1\n∂x3\n+ ∂u3\n∂x1\n¶\n=\nx1x2γa2\n(x2\n1 + x2\n2)2\nμ ∂u2\n∂x3\n+ ∂u3\n∂x2\n¶\n= γ\n·\n1 -\na2\nx2\n1 + x2\n+\n2a2x2\n(x2\n1 + x2\n2)2\n\n- (5 points)Based on the strain components calculated above, evaluate the spatial\ndependence of all components of the stress tensor, σij .\nE\n\"\nν\n#\n2ij +\nσij = (1 + ν)\n(1 - 2ν)\nAX\n2mm\n!\nδij .\nm=1\nσ11 = σ22 = σ33 = σ12 = σ21 = 0;\n\nE\n2x1x2Gγa2\nσ13 = σ31 =\n213 = 2G213 =\n1 + ν\n(x1 + x2)2\nE\n·\na\n2a2x2\n\nσ23 = σ32 =\n223 = 2G223 = Gγ 1 -\n+\n1 + ν\nx1 + x2\n(x1 + x2)2\n(5 points) Describ e the state of stress \"far\" from the fiber. Distance from the\nfiber can be measured by radius r ≡\np\nx1 + x2; when r/a A 1 (or, equivalently, when\na/r ¿ 1, the point is far from the outer boundary of the fiber. By introducing the\ndistance variable r into the spatial dependence of the two nonzero stress components,\nwe see that\n·\na\n2a2 x2\n\nσ23 = σ32 = Gγ 1 -\n2 +\nGγ\nr\nr2 r2\n→\n2x1x2 a2\nσ13 = σ31 = 2G213 = Gγ\nr2\nr2 →\nThe 'far' limits apply because a/r ¿ 1 (and even more so for (a/r)2), while x1x2/r2 =\nsin θ cos θ remains bounded for large r/a.\n- (10 points) Show that the stress tensor components calculated above satisfy\nthe equilibrium equations. A bit of reflection concerning the equilibrium equations\n∂σij\nX\n= 0i\n∂xj\nj=1\nwill show that the only relevant equation is for equilibrium in the x3 direction (i = 3):\n∂σ31\n∂σ32\n+\n= 0.\n∂x1\n∂x2\nThe nonzero stress component σ13 (which appears, differentiated with respect to x3\nin the x1direction equilibrium equation), does not depend on x3; likewise, the stress\ncomponent σ23 appears in the x2direction equilibrium equation, but only when it is\ndifferentiated with respect to x3, on which it does not depend. Thus, only the x3\ncomponent remains. Using the previous expressions,\n∂σ31\n∂ [2x1x2a2r-4]\n=\nGγ\n∂x1\n∂x1\n=\nGγ\n£\n2a x2r-4 + (2a x1x2)(-4r-5 x1/r)\n¤\n=\nGγ 2a 2 x2r-4 £\n1 - 4x1/r2¤\n;\n\n£\n¤\n·\n\n·\n\n2 2\n∂σ32\n∂[1 - a2/r2 + 2a x2/r4]\n=\nGγ\n∂x2\n=\n∂x2\n2 ¡\n2x2r-4 - 4x2r-6¢¤\nGγ\n2 x2r-4 + 2a\n2a\n=\nGγ 2a 2 x2r-4 £\n3 - 4x2/r2\nIn writing these two evaluations, use was made of the chain rule and the relation\n∂r2/∂x1 = 2r∂r/∂x1 = 2x1 ⇒ ∂r/∂x1 = x1/r, along with the related identity\n∂r/∂x2 = x2/r.\nWe can now add the two expressions in the x3component of the equilibrium equation:\n∂σ31\n∂σ32\n0 =\n+\n∂x1\n∂x2\nx1\nx2\n2 )\nGγ 2a 2 x2r-4 (1 - 4 2 ) + (3 - 4\nr\nr\n(x1 + x2)\n=\nGγ 2a 2 x2r-4 (1 + 3) - 4\n)\n=\nr\n=\n0.\nThe x3 component of static equilibrium is indeed satisfied.\n- (5 points) A particular point \"P \" on the interface between the fiber and the matrix\nis located at inplane position xP = x1e1 + x2e2 = a cos θe1 + a sin θe2\n- evaluate the components, {ni}, of the unit normal vector, n, pointing\nfrom the surface of the matrix at P toward the interior of the fiber.\nThis unit vector is just n = - (cos θ e1 + sin θ e2) ;\n⎧\n⎨\n⎩\nn1\nn2\nn3\n⎫\n⎬\n⎭ =\n⎧\n⎨\n⎩\n- cos θ\n- sin θ\n⎫\n⎬\n⎭ .\n- evaluate the components, {ti}, of the traction vector acting on the sur\nface of the matrix at P.\n⎧\n⎨\n⎩\nt1\nt2\nt3\n⎫\n⎬\n⎭ =\n⎡\n⎣\nσ13\nσ23\nσ31\nσ32\n⎤\n⎦\n⎧\n⎨\n⎩\n- cos θ\n- sin θ\n⎫\n⎬\n⎭ = -\n⎧\n⎨\n⎩\nσ31 cos θ + σ32 sin θ\n⎫\n⎬\n⎭ .\n\n- (10 points) Use your physical understanding of this problem to define and\nevaluate an appropriate stress concentration factor. Examination of the peak\nvalues of the stress components shows that the peak stress occurs for component σ32\nat locations just on the top/bottom of the fiber, at x1 = 0 and x2 = ±a. At those\nσlocal\n2σremote\npoints,\n= 2Gγ =\n. Thus, the stress concentration factor can be defined as\nσ32(x1 = 0; x2 =\na)\nKt =\n±\n= 2.\nσ32(r →inf)\nUseful information: 2G(1 + ν) = E, where G is the isotropic linear elastic shear modulus, E\nis the Young's modulus, and ν is Poisson's ratio.\nFigure 1: Crosssection of large linear elastic body (\"the matrix\") containing a long fiber\nof diameter 2a parallel to the x3axis. The elastic moduli of the fiber are much larger than\nthose of the matrix, so the fiber is idealized as being rigid, or elastically nondeformable, in\ncomparison.\n\nProblem 4 (30 points)\nA closedended thinwalled circular cylindrical pressure vessel has wall thickness t = 5 mm\n\nand mean radius R = 50 mm.\nMaterial properties for the tube include E = 208 GPa,\nν = 0.30, and σy = 500 MPa.\n- (10 points) At zero internal pressure, the long closed tube is subjected to an unknown\naxial tensile force, N, which causes an axiallyoriented strain gauge mounted on the\nouter diameter of the tube to register a strain of magnitude 0.0010. Evaluate N.\nSolution: The stress state in the tube wall, due to axial force N alone, over the\n.\n\ntube crosssectional area A = 2πRt, is uniaxial, of magnitude σzz = N/A; all other\ncylindrical stress components are zero: σrr = σθθ = σrθ = σrz = σθz = 0. Under\nuniaxial stress, the axial stress and strain components are related by\nσzz = E2zz =\n¡\n208 × 103 MPa\n¢\n× 10-3 = 208 MPa ≡ σ(N).\nzz\nThe axial load/stress relation is\n\nN/mm2\nN =\n¡\n2πRt\n¢\nσ(N) = 2π (50 mm)(5mm) × (208 MPa) ×\n= 326.7 kN\nzz\nMPa\n- (15 points) With the load N held constant, gas is introduced into the cylinder, causing\nthe internal pressure, p, to increase. Evaluate the maximum pressure that can\nbe applied without initiating plastic deformation in the wall of the tube.\nSolution: The internal pressure of magnitude p creates both an axial and a hoop stress\nstress component in a closedended, thinwalled cylinder:\n\npR\npR\n.\nσθθ =\n;\nσzz =\n;\nσrr = 0.\nt\n2t\nThese stresses must be superposed with those due to the axial force, N; The resulting\nnonzero stress components are\n\npR\nσθθ =\n≡ Σ;\nt\n\npR + σ(N)\nσzz = 2t\nzz = Σ/2 + σ(N),\nzz\nwhere σ(N) = 208 MPa is that due to the axial load, as noted above. The initial yield\ncondition can be expressed in terms of the Mises equivalent tensile stress, σ, as\nzz\n\nσ = σy,\nor\n\nσ2\n=\n=\n[(σzz - σθθ)2 + σ2 + σ2\ny\nσ2\nzz\nθθ]\n=\nσ2 + σ2\nzz\nθθ - σzzσθθ\n=\nμ Σ + σ(N)\n¶2\n+ (Σ)2 - Σ\nμ Σ + σ(N)\n¶\nzz\nzz\nμ\n=\nΣ2\n1 +\n1¶\n+ Σσ(N) +\n¡\nσ(N)¢2 - Σσ(N)\nzz\nzz\nzz\n4 - 2\nσ2\nΣ2 +\n¡\nσ(N)¢2\n=\ny\nzz\nThis can be solved as a quadratic expression for Σ:\nΣ2 =\n£\nσy\n2 - (σ(N))2¤\n;\nzz\nΣ =\nq\nσy\n2 - (σ(N))2 = √\np\n(500 MPa)2 - (208 MPa)2 = 525 MPa\n√\n\nzz\nRecalling the definition of Σ = pR/t, the corresponding pressure is p = Σt/R =\n525 MPa × (5 mm/50 mm) = 52.5 MPa.\n- (5 points) With the load N applied, along with the pressure level determined above,\nwhat values will the strain gauge read?\nUsing the linear elastic stressstrain equations, the axial strain is related to the stress by\n2zz =\n[σzz - ν (σrr + σθθ)] .\nE\n\nIn our case, σrr = 0, σθθ = pR/t = Σ = 525 MPa, and σzz = σ(N) + pR/2t = 208 MPa +\n262.5 MPa = 470.5 MPa. Thus\nzz\n2zz = 208 × 103 MPa [470.5 MPa - 0.3(525 MPa)] = 0.00150.\nList all assumptions. We have used the thinwalled relation to compute crosssectional\narea.\nWe have assumed that the radial stress can be neglected in calculation of yielding, and that\nthe state of stress is approximately uniform through the wall thickness of the tube.\nNote that a slightly more conservative value for the \"at yield\" pressure value could be\nobtained by recognizing that, on the inside radius of the tube, the value of the radial stress\n\nis σrr = -p = -(t/R)Σ = -Σ/10. Thus, when the Mises stress expression is evaluated with\nthis (small, but nonzero) value for σrr, the resulting quadratic equation for Σ is changed;\na numerical solution for this case gives Σ = 516 MPa and p = 51.6 MPa, just a couple of\npercent below our (simpler) estimate, above, that gave Σ = 525 MPa and p = 52.5 MPa.\n\nFigure 2: Schematic of thinwalled tube subjected to axial load N and internal pressure, p.\n\n\"\nA\n!\n#\n\"\nA\n!\n#\n¶\nIsotropic Linear ThermalElasticity\n(Cartesian Coordinates)\nStress/Strain/TemperatureChange Relations:\nX\n2ij = αΔT δij +\n(1 + ν) σij - ν\nσkk\nδij .\nE\nk=1\nE\nX\nν\n(1 + ν)\n(1 - 2ν)\nσij =\n2ij +\n2mm\nδij -\nαΔT δij .\n(1 + ν)\n(1 - 2ν)\nm=1\nStraindisplacement Relations:\n1 μ ∂ui\n∂uj\n2ij =\n+\n.\n∂xj\n∂xi\nEquilibrium equations (with body force and acceleration):\nX\n∂2ui\n∂σij + ρbi = ρ\n∂xj\n∂t2\nj=1\nMises Stress Measure:\nr\n1 [(σ11 - σ22)2 + (σ22 - σ33)2 + (σ33 - σ11)2] + 3 [σ2\n23 + σ2\n12 + σ2\nσ ≡\n].\nTraction on elemental area with unit normal \"n\":\nX\nti(n) =\nσij nj .\nj=1"
    },
    {
      "category": "Exam",
      "title": "practice_quiz2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/9208e626d933ab6024ce319a3479869a_practice_quiz2.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MASSACHUSETTS 02139\n2.002 MECHANICS AND MATERIALS II\nSPRING, 2003\nPRACTICE QUIZ II\nDistributed:\nWednesday, April 28, 2004\nThis quiz consists of four (4) questions. A brief summary of each question's content and\nassociated points is given below:\n1. (15 points) This is the credit for your (up to) two (2) pages of selfprepared notes.\nPlease be sure to put your name on each sheet, and hand it in with the test booklet.\nYou are already done with this one!\n2. (15 points) A labbased question.\n3. (20 points) A set of 4 short, straightforward questions about plasticity.\n4. (50 points) A longer problem on fatigue crack growth and fracture.\nThe last 2 pages of the quiz contain \"useful\" information. Please refer to these pages for\nequations, etc., as needed.\nIf you have any questions about the quiz, please ask for clarification.\nGood luck!\n\nProblem 1 (15 points)\nAttach your selfprepared 2sheet (4page) notes/outline to the quiz booklet. Be sure\nyour name is on each sheet.\nProblem 2 (15 points)\n(Lab Problem)\nA strip of 2024T4 aluminum alloy is 3 mm thick and 30 mm wide. Material properties for\nthe alloy include E = 70 × 103 M P a, ν = 0.3, and σy = 300 M P a.\nThe strip is to be bent over a solid circular cylindrical die of radius \"R\". Answer the following\nquestions:\n- (5 points) What is the smallest value the radius \"R\" can have so that the strip of\n2024T4 aluminum fully springs back to its original shape after having been\nwrapped around the die?\n- (5 points) The aluminum strip is bent around a die having outer radius R = 30 mm.\nWhat value would an axiallymounted strain gage on the outer surface of the strip\nrecord when the strip is wrapped around the die?\n- (5 points) Estimate the value that the strain gage above would register after unloading\nfrom being wrapped about the die of radius R = 30 mm.\nShow all work and state all assumptions.\n\nProblem 3 (20 points) An elasticplastic material has Young's modulus E and shear\nmodulus G. Under uniaxial tension, plastic deformation begins when the axial stress reaches\nthe value \"σy \", and the \"shape\" of the tensile stress versus tensile strain curve is well\napproximated as bilinear, with constant postyield slope dσ/d2 = Et, as indicated in the\nfigure. Assume that plasticity in this material is describ ed by Mises yield condition along\nwith isotropic strain hardening.\nFigure 1: Idealized stressstrain curves. (a) (Tension) tensile yield strength: \"σy \"; post\nyield slope: dσ/d2 = Et.(b) (Shear) shear yield strength: τy =?; postyield slope: dτ /dγ =?.\n1. (10 points) Describe this material's constitutive relation between deformation resis\ntance (or \"strength\"), s, and equivalent tensile plastic strain, 2 p. In particular,\n(a) What is the initial value of s, evaluated at 2p = 0?\n2p)? (Note: h ≡ ds(\n(b) What is the slope, h, of the function s(\n2p)/d2 p.)\n2. (10 points) A coupon of this material is subjected to a state of stress in pure shear,\nwith stress components given, for some value of the shear stress, \"τ ,\" by\n[σij ] =\n⎡\n⎣\nτ 0\nτ 0\n⎤\n⎦ .\n(a) At what value of τ = σ12 will the material start to yield plastically? (The value\nof shear stress at yield can be denoted \"τy \".)\n(b) Derive an expression for the initial postyield slope of the shear stress versus shear\nstrain curve. That is, give an expression for the quantity\n1 dσ12\ndσ12\ndσ12\ndτ\n=\n=\n.\n2 d212\n2 d212\ndγ12\n≡ dγ\nHere we have used the usual relation between engineering and tensorial shear\nstrains, 2212 = γ12 ≡ γ, etc. State all assumptions.\n\nProblem 4 (50 points)\nThe martensitic stainless steel 431 is heattreated to a roomtemperature yield strength of\nσy = 700 M P a and plane strain fracture toughness KIc = 110 M P a √m. Fatigue crack\npropagation in 431 stainless steel has a powerlaw exponent of m = 2, and the growth rate\nper cycle is da/dN = Δao = 10-4 mm/cycle when the applied cyclic range of the stress\nintensity factor is ΔKI = ΔKIo = 20M P a √m.\nA component of this 431 stainless steel is to be cycled at room temperature between zero\nstress and a maximum tensile stress of σmax (tobe determined). Loading will be applied\nfor 25, 000 cycles. It is required that any preexisting edge cracks of size ai ≤ 3 mm\nmust not grow beyond a size which would give a maximum KIvalue greater than\n0.75 × KIc, resulting in a minimum safety factor against fracture of 4/3.\n- (40 points) Please choose the largest possible value for σmax consistent with this\nconstraint and any other constraint(s) you might deem appropriate. You may assume\nthat the structure is sufficiently wide (w/a A 1) so that the configuration correction\nfactor Q can be taken as constant, Q = 1.12.\n- (10 points) Suppose that you really did have an initial crack of size ai = 3 mm and,\nfurther, that you really did apply 25, 000 cycles of the zero/max stressing at the value\nof σmax determined above. How many more cycles of 0/σmax loading would extend\nthe crack to critical size? Does the proposed \"safety factor\" of 4/3 on fracture seem\nappropriate? Discuss.\n\n\"\nA\n!\n#\n\"\nA\n!\n#\n¶\nv\nu\nu\nt\nA\n!\nIsotropic Linear ThermalElasticity\n(Cartesian Coordinates)\nStress/Strain/TemperatureChange Relations:\nX\n2ij = αΔT δij +\n(1 + ν) σij - ν\nσkk\nδij .\nE\nk=1\nE\nX\nν\n(1 + ν)\n(1 - 2ν)\nσij =\n2ij +\n2mm\nδij -\nαΔT δij .\n(1 + ν)\n(1 - 2ν)\nm=1\nStraindisplacement Relations:\n1 μ ∂ui\n∂uj\n2ij =\n+\n.\n∂xj\n∂xi\nEquilibrium equations (with body force and acceleration):\nX\nj=1\n∂2ui\n∂σij + ρbi = ρ\n∂xj\n∂t2\nIsotropic ElastoPlasticity\n(Cartesian Coordinates)\nMises Equivalent Tensile Stress Measure:\nr\n\n≡\n12 + σ2\nσ\n[(σ11 - σ22)2 + (σ22 - σ33)2 + (σ33 - σ11)2] + 3 [σ2\n23 + σ2 ]\nX\nX\nij σ0\nσ0\nij .\n=\ni=1 j=1\nYield Condition:\nσ ≤ s.\nStress Deviator Tensor:\nX\nσ0\nij = σij -\nδij\nσkk\n.\nk=1\nElasticPlastic StrainIncrement Decomposition:\nd2ij = d2(e) + d2(p) .\nij\nij\n\nPlastic flow rule:\nσ0\nij\nd2(p) = 3 d 2p\n.\nij\nσ\nTensile equivalent plastic strain increment:\n�\n\nd2 p =\nX X\nd2(p)d2(p) ≥ 0.\nij\nij\ni=1 j=1\nStrain Hardening:\nds = h d 2p.\nPowerlaw Fatigue Crack Growth under\nConstantΔσ and ConstantQ:\n(a) powerlaw exponent m > 2:\nCycles to propagate between fixed crack lengths:\n¶ (m-2)\nai\nμ\nΔKIo\n¶m\n\"\nμ ai\n#\n=\n; (m > 2).\nNai→af\nΔao\nQΔσ√πai\n(m - 2)\n1 -\naf\nFatigue crack length vs. cycles:\nai\na(N) =\nN\n,\n(m-2)\n1 - N0\nwhere\n¶m\nai\nμ\nΔKIo\n.\nN0 ≡ Δao\nQΔσ√πai\n(m - 2)\n(b) powerlaw exponent m = 2:\nCycles to propagate between fixed crack lengths:\nai\nμ\nΔKIo\n¶2 ·\nμ af\n¶\n=\nln\nNai→af\nΔao\nQΔσ√πai\nai\nFatigue crack length vs. cycles:\ni2¶\na(N) = ai exp\nμ\nN\nh\nQ Δσ\np\nπΔao/ΔKIo\n."
    },
    {
      "category": "Exam",
      "title": "quiz2_sol.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/90224e7839c06d6d393164339d96bc5f_quiz2_sol.pdf",
      "content": ""
    },
    {
      "category": "Resource",
      "title": "creep_viscoelast.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/0278c01018c4f2281214a661d9c95c32_creep_viscoelast.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Mechanical Engineering\nCambridge, MA 02139\n2.002 Mechanics and Materials II\nSpring 2004\nLaboratory Module No. 2\nRate and TimeDependent Polymer Deformation\nObjectives\nIn the mechanical testing performed to date, little explicit attention has focused on\nrealtime histories of loading: tension and bending deformation have been imposed\non a \"laboratory timescale\", and we have implicitly assumed that, for monotonic\nloading, the stress/strain response of the material under investigation does not depend\nstrongly on the \"time\" parameter. For example, we have not considered the possibility\nthat strain might continue to increase with time during extended periods of constant\napplied stress (\"creep\"), or that a structure subjected to a rapidlyapplied imposed\ndisplacement which is then held constant in time might generate high initial loads\n(shorttime), but show steady decay of load level with time (\"relaxation\") over longer\ntimes. In this lab module, we will explore both of these types of material behavior\nfor small deformations in various engineering polymers; the collective term describing\nsuch mechanical behavior is linear viscoelasticity.\nLab Tasks\nIn this laboratory module you will\n1. Briefly be introduced to the phenomena of creep and relaxation in viscoelastic\npolymers.\n2. Record data on roomtemperature load relaxation in beam specimens of an\nengineering polymer subjected to an imposed midspan bending displacement,\nand also to a beam specimen subjected to a history of imposed midspan loading\nand unloading.\nThe data will begin the quantification of linear viscoelastic\nbehavior in the polymer, in particular, for low density polyethylene (LDPE).\n\n3. Observe the frequency dependence of cyclic deformation in a viscoelastic poly\nmer.\nLaboratory Assignment: Specific Questions to\nAnswer\n1. Plot the midspan deflection vs. time curve for the rapidlyapplied midspan\nloading applied to the LDPE beams, and use the correspondence principle to\nextract the creep function Jc(t).\nIs the response immediately following the\nremoval of load consistent with the superposition principle? Discuss.\n2. Plot the load vs.\ntime curve for the LDPE beam subjected to a suddenly\napplied midspan displacement, and use the correspondence principle to extract\nan estimate of the relaxation function Er (t).\n3. How closely do the creep and relaxations functions come to satisfying the re\nciprocal relation Er (t) × Jc(t) = 1? Is this satisfied better for short times?\nDiscuss.\n4. Discuss how the relaxation data might be used to fit a linear viscoelastic three\nelement model (standard linear solid) to the timedependent relaxation modu\nlus, Er (t).\n5. Plot the steady hysteresis curves (elliptical loops of cyclic stress vs. strain)\nat different frequencies, ω. Does the phase lag δ(ω) exhibit expected trends?\nDiscuss.\n\nA Brief Background on Engineering Polymers\n4.1\nSprings and Dashpots\nWhen a suddenlyapplied tensile stress of magnitude σ is applied (say, at time t = 0),\nand then held constant with time, the resulting history of strain in a linear elastic\nsolid (often idealized by a \"spring\" element) is simple: the strain 2(t) = 0 (if t < 0\ncorresponds to a time before application of stress), while 2(t) = σ/E for times t > 0 .\nHere E is the constant elastic tensile modulus of the material; evidently, the longterm\nstrain is simply constant.\nConversely, when stress is suddenly applied to a linearly viscous fluid (as often ide\nalized by a \"dashpot\" element), the fluid undergoes timedependent straining. The\nconstitutive model of a linear viscous material can be idealized by the relation\nd2(t)\n2 (t) ≡\n=\nσ(t),\ndt\nη\nwhere the viscosity η (dimensions: (t × (F /L2)); typical units: (sec M P a)) is a\n·\nconstant for each fluid (and temperature!). Under the rapid stressjump history pre\nviously discussed, the resulting strain history in a viscous fluid is\n1⁄2 0\nif t < 0\n2(t) =\n(t/η) σ if t ≥ 0\nThus, while stress is maintained, linear viscous fluids continue to deform.\nIt has been found, especially for polymeric materials, both engineered and natural,\nthat the mechanical response under modest levels of stress contains elements of both\nthe \"linear elastic\" and \"linear viscous\" idealizations noted above. Accordingly, the\nresulting behavior has been termed \"linear viscoelastic\".\n4.2\nPolymer Structures and Characterization\nEngineering polymers represent a broad class of engineering materials. They can be\nbroadly categorized by features of the structures into which their long polymeric chain\nmolecules are processed in the solid state. When the chains are randomly intertwined,\nthe local structure is termed amorphous. If segments of polymer chains can locally\ncome together in regular aligned arrays, those domains possess a sufficient degree of\ncrystalline order to scatter light, xrays, etc., and are hence termed crystalline regions.\nIn general, the topological constraints on long polymer chains (think of a bowl of\nspaghetti!) prevent the chains from organizing completely into crystalline domains,\nso even when crystal organization is possible, polymers contain a substantial volume\n\nfraction of amorphous, or disordered, material; thus, these polymers are termed semi\ncrystalline.\nA second major organizing idea for categorizing amorphous polymers concerns the\npredominant type of bonding between chain segments.\nRelatively weak hydrogen\nbonds and van der Waals bonds permit easy relative motion of the disordered collec\ntion of chains, especially at higher temperatures. At sufficiently high temperatures,\nsuch polymers are viscous liquids, and they can be processed in the fluid state. Such\namorphous polymers also have a characteristic glass transition temperature, Tg ,\nnear which their stiffness changes dramatically. Within a 10 to 20*C interval about\nTg , the elastic stiffness can change by a factor of ∼ 1000, with lowtemperature,\nshortterm elastic modulus of order ∼ 1 GPa well below Tg , and dropping to only\n∼ 1 MPa a few degrees above Tg . Since these polymers can be fluidprocessed into\nmolds at high temperatures, then cooled to stiff solid engineering materials, they are\ntermed thermoplastic polymers. Both amorphous and semicrystalline polymers\ncan be thermoplastic, with the understanding that for the semicrystalline polymers,\nthe fluid processing must take place at a temperature above Tm, the melting temper\nature of the crystallites; otherwise, the presence of the crystallites in a surrounding\namorphous matrix would dramatically increase the viscosity to values too high for\neconomic fluidphase processing.\nAmorphous polymers do not scatter visible light; they are typically transparent, and\nexamples of amorphous thermoplastic polymers include polycarbonate (PC), poly\nmethyl methacrylate (PMMA), and polystyrene (PS). Such polymers are typically\nused at temperatures well below their respective Tg values (Tg is near 100*C for PS and\nPMMA; for PC it is higher, near 150*). Collectively, these are also sometimes termed\nglassy polymers, with the understanding that they are used at temperatures well\nbelow Tg , where their relatively high elastic moduli (of order GPa) is characteristic\nof the glasslike behavior.\nThe crystallites of semicrystalline polymers typically do scatter visible light; thus,\nthey are generally opaque. Examples of important engineering semicrystalline ther\nmoplastic polymers are lowdensity polyethylene (LDPE), highdensity polyethylene\n(HDPE), polypropylene (PP), polyamide (PA) (duPont trade name: \"nylon\"), poly\ntetrafluoro ethylene (PTFE) (duPont trade name: \"teflon\"), and polyvinyl chloride\n(PVC). Each of these materials has some crystalline volume fraction, fc = Vc/(Vtot,\n.\nand a remaining amorphous volume fraction, fa = 1 - fc. In HDPE, fc = 0.90, while\nin PVC, fc is only ∼ 0.10; PA, LDPE, and PP typically have 0.65 ≤ fc ≤ 0.75.\nRecall, however, that the remaining amorphous volume fractions of each semicrys\ntalline polymer must have its own glass transition temperature, Tg , and the operating\ntemperature, T , of the amorphous/crystalline \"composite\" will greatly influence the\nstiffness of the amorphous domains, and thus, albeit to a lesser extent, of the overall\npolymeric material. For the amorphous portions of LDPE and HDPE, the respective\nTg values are near -90*C and -100*C, while their crystalline melting temperatures\n.\nTm are near 115*C and 135*C, respectively. In contrast, for PA66, Tg = 57* and\n\nTm = 265*C. Thus, the semicrystalline polyethylenes operate at room temperature\n(∼ 23*C) with their amorphous regions far into the viscous region, even though their\nlarger volume fractions of crystalline order are well below their melting temperatures.\nFor completeness, we note that another type of interchain bonding occurs in amor\nphous polymers: strong primary \"crosslinking\" bonds can be introduced via in situ\nchemical reactions: such amorphous polymers are called thermosets. Important\nexamples include epoxies. Once the chemical crosslinking has been performed, ther\nmosets can no longer become viscous flowing fluids, even at very high temperatures:\nthe primary bonds keep the chains from flowing past each other. Instead, the ther\nmosets char at sufficiently elevated temperatures.\nWith this very brief background into the molecular structures of engineering polymers,\nwe turn again to their mechanical behavior. From the discussion, we can expect that\npredominantly linear elastic response should be obtained from the crystallline regions\nand from the amorphous regions, providing the latter are well below Tg . However,\nnear and, especially, above Tg , the amorphous domains will exhibit viscous flow\ntype behavior that should be evident in the macroscopic timedependent stressstrain\nrelations of the polymer: one part of that behavior, generally valid for total strains\nless than, say, 0.01, is termed linear viscoelasticity.\nA Brief Introduction to Linear Viscoelasticity\n(See also: Dowling, Sections 5.2.25.2.4; 15.6.1; 15.10\nCrandall, Dahl, and Lardner, section 5.18)\n5.1\nStress Relaxation and Creep Compliance\nThe fundamental linear viscoelastic response of a material can be experimentally\nobtained from 2 related, but distinct, types of tests. In a stress relaxation test, a\n(small) strain of magnitude 20 is suddenly applied at time t = 0; thus the history of\nimposed strain, 2(t), is\n1⁄2 0\nif\nt < 0\n2(t) =\nif\nt ≥ 0.\nThe measured response to this imposed strain history is the stress history, σ(t). In\ngeneral, σ(t) = 0 if t < 0, but will be nonzero and changing for times t > 0. Basic\nfeatures of such a history are that the largest values of stress are recorded just after\napplying the strain (at t\n0+), with a smooth, steady decay to lower values for\n→\nlonger times. We can extract the material stress relaxation function, Er (t), from\n\nthe data by defining\nσ(t)\nEr (t) ≡\n.\nThe shortterm value of the function is termed its 'glassy' response, Erg ≡Er (t\n0+),\nwhile its longterm value is termed the 'equilibrium' value: Ere ≡Er (t →inf).\n→\nThe second fundamental testing mode, called a creep test, consists of suddenly im\nposing a (small) constant stress, of magnitude σ0, at time t = 0. The resulting strain\nhistory, 2(t), is recorded for times t ≥0. We define the creep function by\n2(t)\nJc(t) ≡\n.\nσ0\nMajor features of this function are a small, 'glassy' value just after loading: Jcg ≡\nJc(t\n0+), and a steadily increasing value toward a longtime 'equilibrium' value,\nJce ≡\n→\nJc(t →inf).\nViscoelastic behavior is said to be linear when the value of Er (t) is independent of\nthe value chosen for 20 (similarly, when Jc(t) is independent of the magnitude of σ0).\nThus, for example, if the response to a suddenlyimp osed strain of magnitude 20 is\nσ(t) = Er (t)(20), then, for linear viscoelasticity, the response to a suddenlyapplied\nstrain of magnitude α ×20 would be α ×σ(t) = Er (t)(α ×20). Although it is generally\nfound that\nJcg = 1/Erg\nand\nJce = 1/Ere,\nin general, for intermediate times t,\nJc(t) = 1/Er (t),\nalthough in practice, the numerical difference between the two is seldom more than a\nfew percent, so the two responses are sometimes used as if they were truly reciprocal\nin the time domain.\n5.2\nSuperposition Principle\nAn important consequence of linearity of viscoelastic response is superposition.\nSuppose that an unstressed solid is subjected to a suddenlyapplied stress jump, of\nmagnitude Δσ1, at time t1 = 0, and stress is held constant at that value until the time\nt = t2 > t1. At time t2, another suddenlyapplied stress change, of magnitude Δσ2\noccurs, and for times t > t2, stress is again held constant, but at the value Δσ1 +Δσ2.\nIn this case, the resulting strain history will be\n2(t) = Δσ1Jc(t -t1) + Δσ2Jc(t -t2).\nRecall that the creep function is zerovalued when its argument is negative: thus, for\ntimes t less than t1, the argument t -t1 < 0, and no strain occurs. Similarly, the only\n\nthing that matters for any given stress jump is the (positive) time interval since the\njump was applied. Thus, the relevant time argument for response to the first stress\njump is t - t1, and so on. The mathematical structure of linear viscoelasticity is made\nparticularly evident when the special choice of Δσ2 = -Δσ1 is made, corresponding\nphysically to sudden application of stress at time t1, followed by a subsequent rapid\nremoval of that stress at time t2. (See Dowling Figure 55 for a graphical schematic\nof the resulting response.)\n5.3\nAnalogue Models of Linear Viscoelastic Response\nWe can get a physical feel for linear elastic behavior by constructing simple analogue\nmodels constructed from assemblies of linear elastic spring elements and constant\nviscosity mechanical dashpots.\nWhile the parameters of such models (individual\nspring stiffnesses and dashpot viscosities) can be adjusted to best match experimental\ndata, we emphasize that the agreement will be only qualitative at best, since the\ntimedependent behavior of the material itself is generally considerably more complex\nthan can be represented by a simple analogue model. Nonetheless, we introduce a\nparticular such model, termed the standard linear solid, in this section.\nThis model consists of two springs and a dashpot, connected as shown in figure 1. One\nbranch of the model consists of a single linear elastic spring. A second branch, loaded\nin parallel with the first branch, consists of a second linear elastic spring element\nin series with a linear viscous dashpot (such a series branch is termed a Maxwell\nmodel). Thus, the timedependent total stress σ(t) carried by the two parallelloaded\nbranches is\nσ(t) = σ1(t) + σ2(t),\nwhere σ1(t) is the stress in the elastic branch, and σ2(t) is the stress carried by both\nmembers of the second (Maxwell) branch.\nThe notion is that the total \"strain\" in the system, 2(t), is applied to both branch\nnumber one (whose strain equals 21(t)), and to the second \"branch\", whose strain is\n22(t):\n2(t) = 21(t) = 22(t).\nMoreover, within the series spring/dashp ot branch number two, the strain is the sum\nof the elastic strain in the spring (σ2/E2) and the viscous strain in the dashpot:\n22(t)\n=\n2spring2 (t) + 2viscous (t)\nσ2(t)\n=\n+ 2viscous (t).\nE2\nSince the stress on the dashpot is also that within spring 2 (σ2(t)), we can as well\n\nE1\nE2\nviscous\nFigure 1: Threeelement spring/dashp ot model of linear viscoelastic behavior: the\nstandard linear solid. NOTE: the figure, as drawn, is slightly inconsistent\nwith the narrative in that the figure indicates that \"22 \" is the (elastic)\nstrain in spring number 2, while the narrative uses the term \"22(t)\" to\ndenote the sum of the timedependent viscous strain and the elastic strain\nin spring 2. Please follow the narrative in relation to equations developed.\nsum their strain rates by differentiating the previous equation with respect to time:\nd22\n≡ 2 2(t) =\nσ 2(t) +\nσ2(t).\ndt\nE2\nη\nHere we have made use of the viscous dashpot constitutive model 2viscous (t) = ησ2(t).\nThe stress in spring 1 (σ1(t)) drives linear elastic response in spring 1, resulting in\n21(t) = σ1(t)/E1, an expression which can also be phrased in terms of strain rates\nand stress rates as 2 1(t) = σ 1(t)/E1.\nCompatibility of the two branches of the assembly requires, in rate form,\n2 (t) = 2 1(t) = 2 2(t),\nor\n2 (t) =\nσ 1(t) =\nσ 2(t) +\nσ2(t).\nE1\nE2\nη\nFinally, note that the total stress, σ(t), is the sum of the stresses carried by the two\nmembers in parallel:\nσ(t) = σ1(t) + σ2(t),\n\nand in rate form\nσ (t) = σ 1(t) + σ2(t).\nThese equations can be rearranged substituted in to eliminate the \"internal\" stress\nvalues in favor of model constants and total stress and strain:\nσ2(t) = σ(t) -E1 2(t);\nσ 2(t) = σ (t) -E1 2 (t).\nNow consider the response of the 3element model to the stepchange in total strain,\nof magnitude 20, applied at time t = 0. Again, prior to application of the stress\n(t < 0), there is no stress or strain in any element, and σ(t) = 0. At times t > 0,\nthe strain in spring 1 is simply 21(t) = 20, so the stress in spring 1 is constant, of\nmagnitude σ1(t) = E1 20. The total series strain of spring 2 and the dashpot is also\nconstant, of magnitude 20, so that 2 series (t) = 0. Referring to the series strainrate\nequation above, we are thus lead to a differential equation describing σ2(t) for times\nt > 0:\nσ2(t) + E2\nη σ2(t) = 0 ⇒\nσ2(t) = - E2\nη σ2(t).\nThis simple firstorder ordinary differential equation leads to the decaying exponential\nsolution form\nσ2(t) = σ2(t = 0+) exp-(E2/η)t ,\nwhere σ2(t = 0+) is the stress in the series member at time t = 0+, just after sudden\napplication of the total strain jump. A little reflection will lead to the insight that,\nsince stress remains finite during the vanishingly small time interval of loading, the\nviscous dashpot contributes zero strain in the limit as t\n0+; thus, at this shorttime\n→\nlimit, the total strain in the series element is completely accommo dated by spring 2:\n2spring2 (t = 0+) = 20 and 2viscous (t = 0+) = 0. Thus, using the elastic constitutive\nrelation for spring 2 at time t = 0+ ,\nσ2(t = 0+) = E22spring2 (t = 0+) = E2 20.\nOn substituting this result into the decaying exponential form for σ2(t), there results\nσ2(t) = E2 exp-(E2/η)t 20.\nFinally, we can add the two stress contributions, σ1(t) and σ2(t), to give the total\nstress for this loading of the 3element model as\nσ(t) = E1 20 + E2 exp-(E2/η)t 20 ≡Er (t)20,\nwhere the relaxation modulus function Er (t) = E1 + E2 exp-(E2/η)t has short term\nvalue Er (t = 0+) ≡E0 = E1+E2, and longterm value E\n= E1. Thus,\nr (t →inf) ≡Einf\n\nE2 = E0 - Einf. Moreover, the system relaxes with a characteristic time constant \"τ \",\nwhere τ ≡ η/E2. Using these new variables, we can express the relaxation modulus\nof the model standard linear solid (SLS) system as\nEr(SLS) (t) = Einf + (E0 - Einf) exp-t/τ .\nIn this form, the 3 independent material properties of the model are long and short\nterm elastic moduli, and characteristic relaxation time.\nEvidently, E0 = Erg and E\n= Ere.\ninf\nA similar analytical treatment can be applied to extract the creep response of the\nstandard linear solid when subjected to a suddenlyapplied total stress, although the\nalgebra is a bit tedious.\n5.4\nCorrespondence Principle\nWithin linear viscoelasticity, we can make use of the corresp ondence principle\nto apply (known!) solutions for linear elastic structures in construction of the time\ndependent solutions for geometrically identical bodies made of linear viscoelastic ma\nterials. In particular, suppose that a simplysupp orted beam of length L is subject to\na sudden application of midspan displacement of magnitude δ; had the beam been\nmade of linear elastic material, we are familiar with the relation between midspan\nload, P , and midspan deflection, δ, as\nP L3\nδ =\n,\n48EI\nwhere I is the area moment of inertia of the beam crosssection, and E is the (con\nstant) elastic modulus. We can rearrange this equation to express the (constant)\nload in terms of the displacement as\n48EI\nP =\nδ.\nL3\nBut now consider the same application of sudden midspan displacement of magnitude\nδ to a linear viscoelastic beam. We can simply replace \"E\" of the linear elastic solution\nwith Er (t) in order to calculate the timedependent midspan load, P (t):\n48Er (t)I\nP (t) =\nδ.\nL3\nAmong the other features of the correspondence principle, one may note that all of\nthe strain components in the linear viscoelastic body have the same (constant) values\n\nthat they did in the corresponding linear elastic solution; e.g., for 0 ≤ x/L ≤ 1/2,\nx\nvviscoelastic (x, t) = velastic (x) = δ (\n) (3 - 4(x/L)2),\nL\nwhile local timedependent bending moment distribution in the beam, again for 0 ≤\nx/L ≤ 1/2, is\nxP (t)\n24xEr (t)I\nM (x, t) =\n=\nδ,\nL3\nand the time and spacedependent axial stress component in this end of the beam is\ny M (x, t)\n-24Er (t)\n3xy μ δ ¶\nσxx(x, y; t) =\n=\n.\n-\nI\nL2\nL\nIt would be tempting to extend the correspondence principle just illustrated to situ\nations involving sudden application of stress (or load), (say, midspan load suddenly\nincreased to P0 and then held constant), and calculate the (now timedependent!)\nmidspan deflection as\n(?)\nL3\nδ(t) =\nP0.\n48IEr (t)\nRegarding this enticing possibility, there is both \"good news\" and \"bad news\". First\nthe bad news: in general, the mathematics of linear viscoelasticity tells us that this\nformulation, where Er (t) describ es stress relaxation in response to a suddenlyapplied\nstrain, is not strictly applicable to the present case of a suddenlyapplied stress. Now\nthe good news: in practice, the \"error\" associated with doing this anyway (even\nthough it is not rigorous) is typically small, so you can get good longterm and short\nterm answers, with the largest of the (rather small) errors occurring at intermediate\ntimes when the system is changing most rapidly.\nWith some reflection, you may surmise that the rigorous answer to the deflection of\nthe beam with a suddenlyapplied load comes from the creep function Jc(t); indeed,\nthe timedependent midspan deflection is\nJc(t)L3\nδ(t) =\nP0,\n48I\nand the stress and bending moment distributions are timeindep endent:\nP0 x\nM (x, t) =\n;\nyM (x, t)\nxyP0\nσxx(x, y, t) =\n=\n,\n-\nI\n- 2\nagain in 0 ≤ x/L ≤ 1/2.\n\nSinusoidal Loading of Viscoelastic Materials and\nVibration Damping\nBecause of the complex interplay of viscous and elastic deformation in linear vis\ncoelastic materials, they exhibit an important phenomenon, termed damping, that\nrelates to viscous mechanical losses during cyclic loading. Damping characteristics\nare particularly important in limiting the amplitude of steady mechanical vibrations\nin structures subjected to periodic forcing, and in rapidly diminishing the amplitude\nof transient free vibrations.\nSuppose that a linear viscoelastic material is subjected to a sinusoidal history of\nstressing,\nσ(t) = σa sin ωt,\nfor a small stress amplitude, σa, and a given frequency of loading, ω (radians/second).\nThe steadystate strain response of the material, after many loading cycles, will settle\nto a periodic response of amplitude 2a, frequency ω, but with a phase shift of\nmagnitude \"δ\"(radians), of the form\n2(t) = 2a sin(ωt - δ).\n(See Dowling, section 15.10).\nThe magnitude of the phase shift, δ(ω), depends on ω, the frequency of loading; in\ngeneral, δ is very small for both very fast cycling (large ω), in which mostly glassy\nelastic response occurs, and also for very slow cycling (very small ω), for which mostly\nequilibrium elastic response occurs. For intermediate cycling frequencies, however, δ\nincreases in magnitude; for a given temperature, typically a maximum value of phase\nshift (δmax ) occurs at a particular frequency, which can be termed ωd. (See Dowling\nFig. 15.35).\nThe magnitude of damping of vibrations is related to a measure Q-1 ≡ tan δ. Here\nQ is termed the quality factor, and is also related to the log decrement, Δt, by\nπ\nΔt = π tan δ =\n.\nQ\nThe physical significance of the log decrement to free vibration is that the ratio of\nsuccessivecycle vibration amplitudes, with, say, vibration amplitude (e.g., tip dis\nplacement in a vibrating cantilever)\"dn \" for cycle \"n\" and \"dn+1 \" for cycle \"n + 1\",\ndecays according to\nμ dn\n¶\nΔt = ln\n.\ndn+1\nThus materials and structures with high values of tan δ (and thus small Qvalues and\nlarge Δtvalues) strongly damp out vibrations. Conversely, when δ is small, only light\ndamping occurs."
    },
    {
      "category": "Resource",
      "title": "labpolicies.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/0a88bade3c3c62d26cd24e31d9bad7b0_labpolicies.pdf",
      "content": "Massachusetts Institute of Technology\nDepartment of Mechanical Engineering\nCambridge, MA 02139\n2.002 Mechanics and Materials II\nSpring 2004\nGeneral Lab Policies\nLaboratory Safety\nThe laboratory involves the operation of testing machines and equipment that can cause\ninjury if used improperly. Thus, it is of paramount importance that appropriate safety\nprecautions be adopted at all times. The laboratory instructors, technical instructor, and\nteaching assistants will all help to assure that safe laboratory practices are observed, but\neach student is expected to be mindful of, and responsible for, the safety of him/herself\nand others.\nLaboratory Participation\nLab attendance is mandatory. A signup sheet will be passed around during the first\nfive minutes of lab. You will not receive credit for a lab that you have not attended. If\nyou miss your lab session for a relevant reason, you must make arrangements to attend\nanother session of the same lab, and inform your lab instructor.\nYou are expected to be have read the lab handout for each week's lab before coming to\nlab; your lab instructor may choose to verify your familiarity with the lab by adminis\ntering a brief quiz at the beginning of the lab session.\nLaboratory Reports\nUnless otherwise specified, you will submit a lab report for each laboratory module. In\ndividual grading will be based on report grades and lab participation.\nYour report will consist of a typed memorandum to your instructor, following the format\noutlined on pages 3 and 4 of this document. It is essential that your memorandum be\nno more than three typed pages, plus any neatly plotted graphs and figures . Present all\nyour results in SI units. No credit will be given for answers in which units are missing.\n\nAlso, please attach additional pages which support your calculations. These additional\npages are intended to show the reasoning and calculations which led you to the answers\nsummarized in the typed memorandum; they need to be legibly handwritten.\nYour\nLaboratory Reports are due exactly one week after your laboratory session. They will\nbe graded and handed back at the beginning of the next laboratory session.\nYou have two options for preparation and submission (and grading) of lab reports. Op\ntion 1 requires you to write up your own, individual report; your grade will be yours\nalone. Under Option 2, you are permitted to team up with up to two other students in\nyour lab section. One [or more] of you will write up and submit a lab report in your joint\nnames; the assigned grade will be credited to all students in the team. It is expected\nthat such lab teams will apply throughout the term, and that, over the term, each team\nmember will contribute substantially similar amounts of effort in preparation of the re\nports.\nData necessary to complete your assignments will be posted on the 2.002 Web site.\nPro ject Lab:\nTowards the end of the term, you will work, in small teams, on a multisession project\nlab, and in the final week of the term, your team will present a summary of the project\nlab to your lab section. More details on the project lab are discussed in the syllabus.\n\nMemorandum\nDate:\nTo : Instructor\nFrom: Student(s)\nRE: Laboratory Module X, Session Y\nLearning Summary\nWrite a oneparagraph summary (∼ 200 words, maximum) of what you feel that you\nlearned from participating in, and writing up, this lab. (This is not a \"trick question\"!)\nLaboratory Procedures\nGive a short description (∼ 1/2 to 1 page) of the tasks carried out during the lab session.\nUse your own words; don't repeat material from the handouts.\nAnswers to Specific Questions\nAnswer the specific questions listed in the lab handout. Be sure that each answer includes\nappropriate units, in addition to numerical values!\nInclude any graphs prepared to answer the questions. These graphs should be clear and\nconcise, and generated from an electronic format (e.g., MATLAB, EXCEL, etc.) Axes\nshould be labeled, and units indicated. If any equations are plotted on graphs, in addi\ntion to raw data, the details of the equation must be given (perhaps in the text), along\nwith constants and units used.\nPlease note that your answers to any \"conceptual\" questions are as important as your\nanswers to quantitative questions.\n\nAppendix\nEnclose all filledout data forms and (handwritten) calculations, and the listings of\nany MATLAB scripts used to complete your assignment. The handwritten calculations\nshould be neat and clear; this may require recopying notes into such a format."
    },
    {
      "category": "Resource",
      "title": "sampledata.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/72ec0b83c9aa06de58cd94c68a2aac2c_sampledata.pdf",
      "content": "Material\nHRA\n1045 AR\n1045 Quenched\n1045 Q & T 250C\n1045 Normalized\n4010 Oil quenched\n75.5\n1045 Oil quenched\nCharpy\nFoot pound\n1045 Quenched\n1045 temp 20-min 250 C\n1045 AR"
    },
    {
      "category": "Resource",
      "title": "datasheet1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/8c604d17931eec9404fcfa25794dceaa_datasheet1.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lec2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/bc25a56b5a91ad29ca5c7419616686f7_lec2.pdf",
      "content": "Euler-Bernoulli Beams:\nBending, Buckling, and Vibration\nDavid M. Parks\n2.002 Mechanics and Materials II\nDepartment of Mechanical Engineering\nMIT\nFebruary 9, 2004\n\nLinear Elastic Beam Theory\n- Basics of beams\n-Geometry of deformation\n-Equilibrium of \"slices\"\n-Constitutive equations\n-Applications:\n-Cantilever beam deflection\n-Buckling of beams under axial compression\n-Vibration of beams\n\nBeam Theory:\nSlice Equilibrium Relations\nAxial force balance:\n-q(x): distributed load/length\n-N(x): axial force\n-V(x): shear force\n-M(x): bending moment\nTransverse force balance:\nMoment balance about 'x+dx':\n\nEuler-Bernoulli Beam Theory:\nDisplacement, strain, and stress distributions\nBeam theory assumptions on spatial\nvariation of displacement components:\nAxial strain distribution in beam:\n1-D stress/strain relation:\nStress distribution in terms of\nDisplacement field:\ny\nAxial strain varies linearly\nThrough-thickness at section 'x'\nε0\nε0- κ h/2\nεxx(y)\nε0 + κ h/2\n\nSlice Equilibrium:\nSection Axial Force N(x) and Bending Moment M(x) in\nterms of Displacement fields\nN(x): x-component of force equilibrium\non slice at location 'x':\nσxx\nM(x): z-component of moment equilibrium\non slice at location 'x':\n\nCentroidal Coordinates\nchoice:\n\nTip-Loaded Cantilever Beam: Equilibrium\nP\nFree body diagrams:\n-statically determinant:\nsupport reactions R, M0\nfrom equilibrium alone\n-reactions \"present\"\nbecause of x=0 geometrical\nboundary conditions v(0)=0;\nv'(0)=φ(0)=0\n-general equilibrium\nequations (CDL 3.11-12)\nsatisfied\nHow to determine lateral displacement\nv(x); especially at tip (x=L)?\n\nExercise: Cantilever Beam Under Self-Weight\nFree body diagrams:\n-Weight per unit lenth: q0\n-q0 = ρAg=ρbhg\nFind:\n-Reactions: R and M0\n-Shear force: V(x)\n-Bending moment: M(x)\n\nTip-Loaded Cantilever: Lateral Deflections\ncurvature / moment relations:\ngeometric boundary conditions\ntip deflection and rotation:\nstiffness and modulus:\n\nTip-Loaded Cantilever: Axial Strain Distribution\nstrain field (no axial force):\nεxx\nTOP\nεxx\nTOP\nεxx\nTOP\nεxx\nBOTTOM\nεxx\nBOTTOM\ntop/bottom axial strain distribution:\nstrain-gauged estimate of E:\n\nEuler Column Buckling:\nNon-uniqueness of deformed\nconfiguration\nmoment/curvature:\node for buckled shape:\nfree body diagram\n(note: evaluated in deformed\nconfiguration):\nNote: linear 2nd order ode;\nConstant coefficients (but\nparametric: k2 = P/EI\n\nEuler Column Buckling, Cont.\node for buckled shape:\ngeneral solution to ode:\nboundary conditions:\nparametric consequences:\nnon-trivial buckled shape only when\nbuckling-based estimate of E:\n\nEuler Column Buckling: General\nObservations\n-buckling load, Pcrit, is proportional to EI/L2\n-proportionality constant depends\nstrongly on boundary conditions at\nboth ends:\n-the more kinematically\nrestrained the ends are, the larger\nthe constant and the higher the\ncritical buckling load (see Lab 1 handout)\n-safe design of long slender columns\nrequires adequate margins with respect\nto buckling\n-buckling load may occur a a compressive\nstress value (σ=P/A) that is less than yield\nstress, σy\n\nEuler-Bernoulli Beam Vibration\nassume time-dependent lateral motion:\nlateral velocity of slice at 'x':\nlateral acceleration of slice at 'x':\nmass of dx-thickness slice:\nmoment balance:\nnet lateral force (q(x,t)=0):\nlinear momentum balance (Newton):\n\nEuler-Bernoulli Beam Vibration, Cont.(1)\nlinear momentum balance:\nmoment/curvature:\node for mode shape, v(x), and vibration\nfrequency, ω:\ngeneral solution to ode:\n\nEuler-Bernoulli Beam Vibration, Cont(2)\ngeneral solution to ode:\npinned/pinned boundary conditions:\npinned/pinned restricted solution:\nτ1: period of\nfirst mode:\nSolution (n=1, first mode):\nA1: 'arbitrary' (but small)\nvibration amplitude"
    },
    {
      "category": "Lecture Notes",
      "title": "lec2a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/86c0e94d7d1c867df409a741d46cadf7_lec2a.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lec4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/3c32a9b4f43f39f26ec9bd41bd0828b7_lec4.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lec5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/446de064719dfa51fb8e349108ee4ee5_lec5.pdf",
      "content": "Elements of Polymer Structure\nand Viscoelasticity\nDavid M. Parks\nMechanics and Materials II 2.002\nFebruary 18, 2004\n\nOutline\n-Elements of polymer structure\n-Linear vs. branched;\n-Vinyl polymers and substitutions\n-Packing of polymer chains\n-Random/amorphous\n-Glass transition temperature, TG\n-Semi-crystalline\n-Crystalline volume fraction; melting temperature\n-Amorphous TG\n-Elements of linear viscoelasticity\n-Creep and relaxation\n-Analogue models\n\nIdealized Linear Elastic Response\nLinear elasticity:\n[NO] Creep\n[NO] Relaxation\nINPUT:\nINPUT:\nOUTPUT:\nOUTPUT:\nNote: units of E are stress.\n\nIdealized Linear Viscous Response\nLinear viscosity:\nCreep:\nRelaxation:\nINPUT:\nNote: units of η are stress × time\nbecomes arbitrarily large during\ne.g., sec × MPa\nan infinitesimal time interval, and then,\nlike the strain-rate, goes to zero\nINPUT:\nOUTPUT:\nOUTPUT:\nThe strain rate (and therefore stress)\n\nMaxwell Model: an Idealized Linear\nViscoelastic Response\nCreep:\nINPUT:\nOUTPUT:\n-For times near the finite\nstress jump, all strain occurs\nin the elastic element;\n-During the hold period, all\nstrain occurs in the viscous\nelement\n\nMaxwell Model: an Idealized Linear\nViscoelastic Response\nRelaxation:\nINPUT:\n-For times > 0, d ε(t)/dt=0\n-During the hold period, elastic\nstrain is traded for viscous\nstrain, and stress drops:\nOUTPUT:\nCharacteristic relaxation time:\nτ = η / E\n\n\"Real\" Polymer Relaxation\n(an Idealization)\nINPUT:\nOUTPUT:\nTesting of real polymers under relaxation\ncan be used to extract a time-dependent\nrelaxation modulus, Er(t);\nShort-term response: Erg;\nLong-term response: Ere\nNOTE: provided |ε0| is sufficiently small\n(typically, less than 0.01), the relaxation modulus,\nEr(t), is approximately independent of ε0.\n\n\"Real\" Polymer Creep:\n(an Idealization)\nTesting of real polymers under suddenly-\napplied constant stress can be used to\nextract a time-dependent creep function, Jc(t);\nINPUT:\nShort-term response: Jcg;\nLong-term response: Jce\nOUTPUT:\nNote: units of Jc(t) : 1/ stress\nNOTE: provided |ε(t)| remains sufficiently\nsmall (typically, less than 0.01), the creep\nfunction, Jc(t), is approximately\nindependent of σ0.\n\nRelaxation Modulus, Er(t) and Creep\nFunction, Jc(t): Inverse Functions of Time?\nQUESTION: Are these inverse functions? Is Jc(t) × Er(t) ≡ 1 for all times?\n-ANSWERS: In general, they are not precise inverses. However,\n-Equilibrium and glassy\nvalues are nearly inverse:\n-For intermediate times, t.\nthe error in assuming that\nthey are inverse is typically only\na few per cent at most...\n\nLinearity of Response\n(an Idealization)\nNOTE: similar linear scaling of stress relaxation response applies.\n\nSuperposition of Loading\nSuppose that the stress history input consists of a sequence of stress jumps,\n∆σ, applied at successive times t, with t0=0:\ni\ni\nTHEN, the resulting strain history is given by\n\nSpecial Case: Load/Unload\nINPUT:\n\nCorrespondence Principle\n-Suppose that a given load, P, produces displacement vector u(x)\nin a linear elastic body having Young's modulus E.\n-The displacement vector depends on the position vector\nx = x ex + y ey + z e .\nz\n-The magnitudes of the displacement and strain components are\nproportional to P and inversely proportional to E.\nEXAMPLE: Three-point\nMid-span bending:\n\nCorrespondence Principle\n-Now suppose that a given load jump, P(t),\nis applied to a geometrically identical linear viscoelastic body\nhaving creep function Jc(t).\n-All stress components in the body are time-independent, and spatially\nvary precisely as they do in an identical linear elastic body subject\nto the same load.\n-The loading produces time-dependent displacement vector u(x,t)\nand corresponding strain components.\n-The magnitudes of the displacement and strain components are\nproportional to both P and Jc(t).\nEXAMPLE: Three-point\nMid-span bending:\nFor suddenly-applied load,\nreplace \"1/E\" with \"Jc(t)\" in\nan elastic solution.\n\nCorrespondence Principle\n-Suppose that a given displacement jump, ∆(t),\nis applied to a geometrically identical linear viscoelastic body\nhaving stress relaxation modulus Er(t).\n-All displacement and strain components everywhere in the body are\ntime-independent, and precisely equal those in an identical\nlinear elastic body subject to the same applied displacement.\n-These boundary conditions produce time-dependent loads, P(t), and stresses\n-The magnitudes of the time-dependent load and of the\nstress components are proportional to both ∆ and to Er(t).\nEXAMPLE: Three-point\nMid-span bending:\nFor suddenly-applied displacement,\nreplace \"E\" with \"Er(t)\" in an elastic\nsolution."
    },
    {
      "category": "Lecture Notes",
      "title": "lec7.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/f7b561fbe8762ff73da9236e6c0fff73_lec7.pdf",
      "content": "Elements of Continuum\nElasticity\nDavid M. Parks\nMechanics and Materials II 2.002\nFebruary 25, 2004\n\nSolid Mechanics in 3 Dimensions:\nstress/equilibrium, strain/displacement, and intro\nto linear elastic constitutive relations\n- Geometry of Deformation\n-Position, 3 components of displacement, and [small] strain tensor\n-Cartesian subscript notation; vectors and tensors\n-Dilatation (volume change) and strain deviator\n-Special cases: homogeneous strain; plane strain\n-Equilibrium of forces and moments:\n-Stress and 'traction'\n-Stress and equilibrium equations\n-Principal stress; transformation of [stress] tensor components between\nrotated coordinate frames\n-Special cases: homogeneous stress; plane stress\n-Constitutive connections: isotropic linear elasticity\n-Isotropic linear elastic material properties: E, ν, G, and K\n-Stress/strain and strain/stress relations\n-Putting it all together: Navier equations of equilibrium in terms of displacements\n-Boundary conditions and boundary value problems\n\nGeometry of Deformation\n-Origin : 0; Cartesian basis vectors, e1,e2, & e3\n-Reference location of material point : x;\n1, x2, x3\n-Displacement vector of material point: u(x);\nspecified by displacement components, u1, u2, u3\n-Each function, ui (I=1,2,3), in general depends on\nposition x functionally through its components:\ne.g., u1 = u1(x1,x2,x3); etc.\n-Deformed location of material point: y(x)=x+u(x)\nspecified by its cartesian components, x\n\nDisplacement of Nearby Points\n∆\n∆\n∆\n∆\n∆\n-Neighboring points: x and x + ∆x\nu(x) and u(x + ∆x)\n-Deformed: y(x) and y(x + ∆x)\n-Displacements: u(x) and u(x + ∆x)\n-Vector geometry: ∆y = ∆x + ∆u,\nwhere ∆u = u(x + ∆x) - u(x)\n∆\n- Displacements:\n\nDisplacement Gradient Tensor\nTaylor series expansions of functions u:\ni\nThus, on returning to the expression\non previous the slide, ∆u is given, for\ni\neach component (i=1,..3), by\nComponents of the displacement\ngradient tensor can be put in matrix\nform:\n\nDisplacement Gradient and\nExtensional Strain in Coordinate Directions\nSuppose that ∆x = ∆x1 e1;\nThen, with ∆y = ∆x + ∆u,\n∆\n∆\n∆\n∆\nThe fractional change in length\n(extensional strain) of a material line\nelement initially parallel to x1 axis is\n∂ u1 / ∂ x1 ; similar conclusions apply for\ncoordinate directions 2 and 3\n\nDisplacement Gradient and Shear Strain\n-Let QR = ∆x1 e1 & QP =∆x2e2\n-Line segments initially perpendicular\n-Deformed lines: Q'R' & Q'P'\n-|Q'R'| = | ∆x1|(1 + ∂ u1/∂ x1)\n-|Q'P'| = | ∆x2|(1 + ∂ u2/∂ x2)\nThe total reduction in angle\nof 2 line segments initially perpendicular\nto coordinate axes 1 and 2 is\nSimilar results apply for all axis pairs\n\nStrain Tensor (I)\nThe cartesian components of the [small] strain tensor are given,\nfor i=1..3 and j=1..3, by\nWritten out in matrix notation, this index equation is\n-Each of the 9 components in the 3 × 3 matrices on each side of the\nmatrix equation are equal, so this is equivalent to 9 separate equations.\n-The strain tensor is symmetric, in that, for each i and j, εij = εj;i\n\nStrain Tensor (II)\nThe cartesian components of the [small] strain tensor are given,\nfor i=1..3 and j=1..3, by\nWritten out in matrix notation, this index equation is\n-Diagonal components of the strain tensor are the extensional strains along\nthe respective coordinate axes;\n-Off-diagonal components of the strain tensor are 1⁄2 times the total reduction\nin angle (from π/2) of a pair of deformed line elements that were initially\nparallel to the two axes indicated by the off-diagonal row and column number\n\nFractional Volumetric Change\nFor any values of the strain tensor components, εij,\nthe fractional volume change at a material point, sometimes called\nthe dilatation at the point, is given by\nThis relation holds whether or not the values of ε11, ε22,\nand ε33 equal each other,\nand whether or not any or all of the shear strain components\n(e.g., ε12=ε21) are zero-valued or non-zero-valued.\nThe sum of diagonal elements of a matrix of the cartesian components of\na tensor is called the trace of the tensor; thus,\nthe fractional volume change is the trace of the strain tensor.\n\nStrain Deviator Tensor\nComponents of the strain deviator tensor,\nare given in terms of the components of\nthe strain tensor by\nHere δij are components of the Kronecker identity matrix,\nsatisfying δij =1 if i=j, and δij =0 if i is not equal to j\n-Off-diagonal components of the strain deviator tensor equal corresponding\noff-diagonal components of the strain tensor;\n-Each diagonal component of the strain deviator tensor differs from the\ncorresponding diagonal component of the strain tensor by 1/3 of the trace\nof the strain tensor\nExercise: evaluate the trace of the strain deviator tensor.\n\nStrain Decomposition\nAlternatively, the strain tensor can be viewed as the sum of\n-a shape-changing (but volume-preserving) part (the strain deviator)\nPlus\n-a volume-changing (but shape-preserving) part (one-third trace\nof strain tensor times identity matrix):\nLater, when we look more closely at isotropic linear elasticity, we will find that\nthe two \"fundamental\" elastic constants are\n-the bulk modulus, K, measuring elastic resistance to volume-change, and\n- the shear modulus, G, measuring elastic resistance to shape-change\n\nGeometric Aspects of Strain\nUndeformed segment:\n∆x: undeformed vector from P to Q\n∆s : length of vector = |PQ|\ne(P->Q) : unit vector pointing\nin direction from P to Q\nDeformed segment:\n∆y: deformed vector from P' to Q'\n∆S : length of vector = |P'Q'|\ne(P'->Q') : unit vector pointing\nin direction from P' to Q'\n∆\n∆\n∆\n∆\n∆\nP\nQ\nP'\nQ'\n∆\n\nFractional Length Change:\nArbitrary Initial Direction\nUndeformed:\nDeformed length (squared):\nBut,\nFinally:\nThe fractional change\nin length for a line element\ninitially parallel to ANY unit\nvector ± m is given in terms of\ndirection cosines, mi, and the\ndisplacement gradient components by\nSame idea,\nBut sum on i\n\nLocal Axial Strain in Any Direction\nStrain along unit direction m:\nVector components of m:\n[Extended] matrix multiplication provides strain in direction parallel to m:\n\nExample\nSuppose that the components of the strain tensor are\nFind the fractional change in length of a line element initially pointing\nAlong the direction m = (e1 + e2 + e3) / 31/2\nSolution: equal components m = 1 / (3)1/2\ni\n\nChange of Basis Vectors;\nChange of Components: but\nNo Change in Vector\nGiven:\n- a vector v;\n- 2 sets of cartesian basis vectors:\n{ e1, e2, e3} and {e1', e2', e3'}\n- components of v wrt {e}: {v} ;\ni\ni\n- components of v wrt {e'}: {v'} ;\ni\ni\nQuestion: what relationships exist connecting\nThe components of v in the two bases?\n\nVector Dot Product and\nVector Components\nConsider the following dot product operations:\nEvidently, for any basis vector (primed or unprimed)\nThus, any vector v can be expressed as\n\nChanging Coordinate Systems (I)\nDefine a matrix Qij by\nExpress primed components in terms of unprimed:\nAlternatively, matrix multiplication to convert vector components:\nNote: the matrix\n[Qij]is said to be orthogonal:\n-Determinant of [Qij] = 1\n-Matrix transpose is matrix inverse:\n[Qij]-1 = [Qij]T = [Qji]\n\nChanging Coordinate Systems (II)\nDefine a matrix Qij by\nExpress unprimed components in terms of primed:\nMatrix multiplication to convert vector components:\nNote: the matrix\n[Qij]is said to be orthogonal:\n-Determinant of [Qij] = 1\n-Matrix transpose is matrix inverse:\n[Qij]-1 = [Qij]T = [Qji]\n\nTransformation of\nDisplacement Gradient (Tensor) Components\nVector/vector operation\n(unprimed components):\nPre-multiply by [Q]:\nSubstitute on both sides:\nVector/vector operation\nin primed components:\nThis must always hold so that\nThis procedure transforms\nthe cartesian components\nof any second-order\ntensor, including εij\n\nChange of Tensor Components with Respect to\nChange of Basis Vectors\nfor any second-order tensor A"
    },
    {
      "category": "Lecture Notes",
      "title": "lec8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/117060f76abaef1d4d4a387873ec38eb_lec8.pdf",
      "content": ""
    },
    {
      "category": "Lecture Notes",
      "title": "lec10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/ea1511da0df34e5242360dd60d66eb7c_lec10.pdf",
      "content": "Motion of an Edge Dislocation Produces Plastic Strain\nImage removed due to copyright considerations. See Figure 9.4, 9.6, and 9.7 in [Ashby].\n\nMotion of a Screw Dislocation Also Produces Plastic Strain\nImage removed due to copyright considerations. See Figure 9.8, 9.9, and 9.10 in [Ashby].\n\nImage removed due to copyright considerations.\n\nImage removed due to copyright considerations. See [Ashby] Fig. 10.1.\n\nImage removed due to copyright considerations. See [Ashby] Fig. 10.2.\nImage removed due to copyright considerations. See [Ashby] Fig. 10.2.\n\nImage removed due to copyright considerations. See [Ashby] Fig. 10.3.\n\nImage removed due to copyright considerations. See [Ashby] Fig. 10.5."
    },
    {
      "category": "Lecture Notes",
      "title": "lec11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/c651b01cd3c37ab94e04003c17c30e93_lec11.pdf",
      "content": "Yielding Under Multi-axial\nStress\n2.002 Mechanics and Materials II\nMarch 10,2004\n\nUniaxial tension/compression:\ninitial linear elastic response,\nas axial stress, σ, is increased\nup to the uniaxial \"yield condition\":\nSuppose that, at some location\nin a body made of the same material,\nthe state of stress is multi-axial, with\ncartesian components σij;\nQUESTION: Will plastic deformation\noccur under\nthis state of stress?\n\nApproach: we need to define a non-negative scalar,\nstress-valued function of [all] the stress components,\nsuch that it can consistently generalize the uniaxial\nyield criterion, |σ | < σy\nObservation # 1: pressure insensitivity of uniaxial yielding\nSuppose that a uniaxial test is performed under fixed\nsuperposed hydrostatic pressure, p, so the cartesian stress\ncomponents are\nPlastic deformation is observed to commence when | σ | = σy,\nessentially independent of the value of p\nThis suggests that yielding is ~ independent of the mean normal stress\ngiven by Σ = (σ11 + σ22 + σ33)/3\n\nRecall the stress deviator tensor, whose components are given by\nClearly, the stress deviator tensor is independent of the mean normal stress\nThe Mises equivalent tensile stress is defined, for any state of stress, σij,\nin terms of the components of the corresponding stress deviator tensor by\nThe yield condition for general multiaxial states of stress can be expressed as\n\nIs our general criterion for multiaxial yielding consistent with our previously-\nestablished uniaxial yield criterion |σ | = σy?\nMises stress measure:\nUniaxial stress:\nStress deviator:\nMises yield specializes\nto the uniaxial yield\nCondition under uniaxial stress\n\nEquivalent Expressions for Mises Equivalent Tensile Stress\ndeviator components:\nIn terms of stress\nIn terms of stress\ncomponents:\nIn terms of\nprincipal stress\nvalues:\n\nEXAMPLE: Combined tension and torsion of a thin-walled tube:\nStress components\nand relation to loads\nand tube geometry:\nStress deviator\ncomponents:\nEvaluate Mises stress\nand compare to\nUniaxial yield strength\nThe Mises yield condition for this stress state can be represented as\nan ellipse in a 2D space whose axes are ``σ'' and ``τ''\n\nEXAMPLE (continued)\nA tube of wall thickness t = 3 mm and mean radius R = 30 mm\nis made of a material having tensile yield strength σy = 500 MPa\nand is preloaded to an axial force F = 200 kN\nWhat is the maximum torque that can be applied without\ncausing yield in the tube?\nrearrange Mises yield:\nload/stress/geometry:\nalgebra...\nnumerical values & units\nANSWER:"
    },
    {
      "category": "Lecture Notes",
      "title": "lec14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/6369979e1b6746c3095b7de56a469fa6_lec14.pdf",
      "content": "Yielding Under Multi-axial Stress and\nElastic-Plastic Stress-Strain Relations\n2.002 Mechanics and Materials II\nMarch 29, 2004\n\nUniaxial tension/compression:\ninitial linear elastic response,\nas axial stress, σ, is increased\nup to the uniaxial \"yield condition\":\nSuppose that, at some location\nin a body made of the same material,\nthe state of stress is multi-axial, with\ncartesian components σij;\nQUESTION: Will plastic deformation\noccur under\nthis state of stress?\n\nApproach: we need to define a non-negative scalar,\nstress-valued function of [all] the stress components,\nsuch that it can consistently generalize the uniaxial\nyield criterion, |σ | < σy\nObservation # 1: pressure insensitivity of uniaxial yielding\nSuppose that a uniaxial test is performed under fixed\nsuperposed hydrostatic pressure, p, so the cartesian stress\ncomponents are\nPlastic deformation is observed to commence when | σ | = σy,\nessentially independent of the value of p\nThis suggests that yielding is ~ independent of the mean normal stress\ngiven by Σ = (σ11 + σ22 + σ33)/3\n\nRecall the stress deviator tensor, whose components are given by\nClearly, the stress deviator tensor is independent of the mean normal stress\nThe Mises equivalent tensile stress is defined, for any state of stress, σij,\nin terms of the components of the corresponding stress deviator tensor by\nThe yield condition for general multiaxial states of stress can be expressed as\n\nIs our general criterion for multiaxial yielding consistent with our previously-\nestablished uniaxial yield criterion |σ | = σy?\nMises stress measure:\nUniaxial stress:\nStress deviator:\nMises yield specializes\nto the uniaxial yield\nCondition under uniaxial stress\n\nEquivalent Expressions for Mises Equivalent Tensile Stress\ndeviator components:\nIn terms of stress\nIn terms of stress\ncomponents:\nIn terms of\nprincipal stress\nvalues:\n\nEXAMPLE: Combined tension and torsion of a thin-walled tube:\nStress components\nand relation to loads\nand tube geometry:\nStress deviator\ncomponents:\nEvaluate Mises stress\nand compare to\nUniaxial yield strength\nThe Mises yield condition for this stress state can be represented as\nan ellipse in a 2D space whose axes are ``σ'' and ``τ''\n\nEXAMPLE (continued)\nA tube of wall thickness t = 3 mm and mean radius R = 30 mm\nis made of a material having tensile yield strength σy = 500 MPa\nand is preloaded to an axial force F = 200 kN\nWhat is the maximum torque that can be applied without\ncausing yield in the tube?\nrearrange Mises yield:\nload/stress/geometry:\nalgebra...\nnumerical values & units\nANSWER:\n\nEXAMPLE\nA tube of axial length L= 200 mm, wall thickness t = 3 mm\nand mean radius R = 30 mm\nis made of a material having tensile yield strength σy = 500 MPa\nand is preloaded to an axial force F = 200 kN The torque is increased\nto its initial yield value (previously-determined value: Mt =3.46 kNm) with F\nheld constant. Then, with dF=0, the torque is further incremented by\nan amount dMt = 0.1 kNm.\nThe Young's modulus is E=208 GPa, ν=0.3, and the initial value of the\nplastic hardenig moduus is h = 3 GPa\nQUESTION:\n-Evaluate the stress increment, d σij\n-Evaluate the strain increment, d εij\n-Evaluate the increment in length of the tube, d L\n-Evaluate the increment in the end-to-end rotation of the\n-Two ends of the tube, d φ\n\nStress increment:\nMatrix form:\n\nStrain increment:\nEquivalent plastic strain increment:\nIncrement in Mises equivalent stress:\nFormal definition:\nalternate derivation:\n\nStrain increment:\nAxial strain increment:\nShear strain increment:\nRadial and hoop strain increments:\nNote: dε (e) = 0; σ (dev)= - σ\n(dev)/2; etc.\nrr\nrr\nzz\n\nStrain/displacement relations:\nAxial tube elongation increment:\nTube end-to-end rotation increment:"
    },
    {
      "category": "Lecture Notes",
      "title": "lec14a.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/576ad58d357fffcb35fd1071a01e9ce1_lec14a.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDEPARTMENT OF MECHANICAL ENGINEERING\nCAMBRIDGE, MA 02139\n2.002 MECHANICS AND MATERIALS II\nSpring, 2004\nCreep and Creep Fracture: Part I\ncL. Anand\n\nRATE-DEPENDENCE AND\nRATE-INDEPENDENCE OF PLASTIC\nRESPONSE\n\n- Plastic deformation in metals is thermally-activated\nand inherently rate-dependent.\n\n- However, the plastic stress-strain response of most\nsingle and polycrystalline materials at absolute tem-\nperatures T < 0.35 Tm, where Tm is the melting tem-\nperature of the material in degrees absolute, is only\nslightly rate-sensitive, and in this temperature regime\nit is often be modeled as rate-independent. We shall\nfirst consider a rate-independent theory.\nMaterial\nMelting Temp, C\nTm, K\n0.35 Tm, K\n≡ C\nTi\nFe\nCu\nAl\nPb\n-42\n\nConsequences of Viscoplastic Deformation at High\nHomologous Temperature\nFor isothermal deformation (T=const)\n\nCreep Test\n- A typical creep test consists of instantaneously load-\ning a cylindrical test specimen of a material to a con-\nstant stress, which is maintained at a constant tem-\nperature. The resulting strain is measured as a func-\ntion of time.\n\nIdealization of Creep Curve\n- For deformation analysis at constant temperature, the\nstrain-time response may be idealized as\nc\n\n=\ne +\nt\nss\nc\n\n=\ne + ss\nσ\ne\n=\nE\n\nStress Dependence of ss\nc\nat Constant Temperature\nc ss\n=\nσn\ns\n\nTemperature-Dependence of c\nat Constant σ -\nss\nPreliminaries\n- Avogadro's number: NA = 6.022×1023 atoms/molecules\nper mole\n- Boltzmann's constant k = 1.381 × 10-23 J/K\n- Universal gas constant R = NAk = 8.314 J(mol)-1K-1\n- Mole: 1 mole of any substance is that mass of the\nsubstance containing NA atoms/molecules; e.g., the\nmass of 1 mole of C12 atoms is 12 grams.\n\nTemperature Dependence of c\nat Constant Stress\nss\n- The slope of the curve is m/1 = -Q/R, where Q\nis called the activation energy for creep, with units\nJ(mol)-1. Then for a constant C(σ), the above curve\ncan be mathematically represented as\nQ\nln c = lnC -\nQ\n⇐⇒ c = Cexp\n-\nss\nR\nT\nss\nRT\n\n(\n\n!)\nAn Important Observation\nc\n- Let us evaluate the increase in\nfor a material with\nss\nQ = 270 kJ/mol when the temperature is increased\nfrom T1 = 8000 C = 1073 K to T2 = 8200 C = 1093 K.\nc\nQ\nss1 = exp\n-\n= 0.5746\nc\nR\nT2\nT1\nss2\n- Therefore, with a temperature increase of only 200C,\nthe creep rate almost doubled!!\n- Caution: the temperature T must be expressed\nin kelvins\n\nCombined Stress and Temperature Dependence of\nc ss\n\nn\nQ\nσ\nc =\nAexp\n- RT\ns\nA\npre-exponential factor (s-1)\nQ\ncreep activation energy (J/mol)\nn\ncreep exponent\ns\nreference stress which produces a strain rate 0\n0 = Aexp\n\n- Q\nRT\n\nSummary of One-Dimensional Creep Equation\n\n=\ne + c\n(1)\nσ\ne\n=\n; E = E(T)\n(2)\nE\n\nn\nQ\nσ\nc\n=\nAexp\n-\n(3)\nRT\ns\n- Note that equation (3) states that the rate of creep\n(or 'viscoplastic') strain increases exponentially with\ntemperature, so that the time required for a given\namount of creep strain decreases exponentially with\ntemperature.\n\nExample Problem: Stress Relaxation\n- Consider a bolt with pre-tension σ = σi at time t = 0.\nGiven that the bolt is maintained at constant tem-\nperature, determine the pre-tension at some time t.\nThe isothermal constitutive equation for steady state\ncreep is given by c = Bσn with n 6= 1\n\nExample Problem: Stress Relaxation (cont.)\nc\n\n=\ne +\nc\n⇒ 0\n=\ne +\nsince = const in the bolt\nσ\n1 dσ\n⇒ 0\n=\n+ Bσn ⇒\n= -Bσn\nE\nE dt\nZ t\nZ σ(t)\n⇒ σ-ndσ\n=\n-EB dt ⇒\nσ-ndσ = -EB\ndt\nσi=σ(0)\n⇒ σ(t)-(n-1) - σ-(n-1)\n=\n(n - 1)EBt\ni\nσi\n⇒ σ(t)\n=\n[1 + (n - 1) t Bσi\nn (E/σi)]1/(n-1)\n- Defining the characteristic relaxation time tr such that\nσ(tr) = σi/2, we get\n\n2(n-1) - 1\n2(n-1) - 1\ntr =\n=\n(n - 1)EBσi\n(n-1)\n(n - 1) i\nc/(σi/E)"
    },
    {
      "category": "Resource",
      "title": "ra1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/2a6f26929c0e1dc734e0c931b567bc20_ra1.pdf",
      "content": "Reading Assignment 1\n02/04\n- CDL:\no Elastic bending (7.1-7.5, 8.1-8.5)\no Buckling (9.1-9.4)\n- Lab 1 Handout"
    },
    {
      "category": "Resource",
      "title": "ra3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/65472d283d2a4838e059b362fe2e9a91_ra3.pdf",
      "content": "Reading Assignment\n02/11\n- AJ:\no Chapters 4, 6"
    },
    {
      "category": "Resource",
      "title": "ra6.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/290e6a608f65ca33bfb52bdb61df9a68_ra6.pdf",
      "content": "Reading Assignment\n02/23\n- CDL:\no 4.8-4.11 (strain)\no 4.1-4.5 (stress)\no 5.4-5.6 (linear elasticity)"
    },
    {
      "category": "Resource",
      "title": "ra12.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/8f7a81c5d0c7a9fe7f615a75a9e523ee_ra12.pdf",
      "content": "Reading Assignment\n03/15\n- Dowling:\no 4.5"
    },
    {
      "category": "Resource",
      "title": "ra15.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/a0fb51afbf1146b8dbecb87e0e344674_ra15.pdf",
      "content": "Reading Assignment\n03/31\n- Dowling:\no 8.1-8.2, 8.4-8.7"
    },
    {
      "category": "Resource",
      "title": "ra17.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/6444392ce0af864bac9e85415e49dd77_ra17.pdf",
      "content": "Reading Assignment\n04/07\n- Dowling:\no 11.1-11.3, 11.5-11.6, 11.10"
    },
    {
      "category": "Resource",
      "title": "ra19.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/2-002-mechanics-and-materials-ii-spring-2004/5a1859f0fc87faab980b940b095a0ff5_ra19.pdf",
      "content": "Reading Assignment\n04/14\n- Dowling:\no 9.1-9.2, 9.5-9.6, 10.1-10.4"
    }
  ]
}