{
  "course_name": "Medical Computing",
  "course_description": "No description found.",
  "topics": [
    "Business",
    "Information Technology",
    "Engineering",
    "Biological Engineering",
    "Computational Biology",
    "Computer Science",
    "Data Mining",
    "Health and Medicine",
    "Biomedical Instrumentation",
    "Biomedicine",
    "Business",
    "Information Technology",
    "Engineering",
    "Biological Engineering",
    "Computational Biology",
    "Computer Science",
    "Data Mining",
    "Health and Medicine",
    "Biomedical Instrumentation",
    "Biomedicine"
  ],
  "syllabus_content": "Topics and Format\n\nThe following topics are covered in the course:\n\nthe nature of clinical data\n\narchitecture and design of healthcare information systems\n\nprivacy and security issues\n\nmedical expert systems\n\nintroduction to genomic medicine and its techniques.\n\nCase studies of contemporary systems are used in lecture sessions. Term project is required. The project involves using a large pseudonymized clinical dataset to integrate classroom topics.\n\nHomework\n\nWe plan to give a handful of modest homework assignments to complement and reinforce material taught in the class. You must do the homework problems on your own. Of course you may ask for help and advice from classmates, but the final work that you turn in and all the words used to describe it must be your own.\n\nRequired Text\n\nShortliffe, E. H., L. E. Perreault, G. Wiederhold, and L. M. Fagan.\nMedical Informatics: Computer Applications in Health Care and Biomedicine\n. 2nd ed. New York, NY: Springer, 2003. ISBN: 9780387984728 .\n\nProjects\n\nThe last four class sessions will be an opportunity for students to present the results of significant research projects done for the class. We encourage you to team up (in teams of two or three students) to work on projects, and teams that span students with different interests, skills and approaches are encouraged.",
  "files": [
    {
      "category": "Assignment",
      "title": "assignment1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/2c53f7d4941f1e6a83888b053fb50f80_assignment1.pdf",
      "content": "Homework 1\n6.872/HST.950 Problem Set 1\n-\nAll answers need to be printed and not handwritten.\n-\nThere will be an SQL exercise on a small subset of the Children's Hospital\ndatabase, from about five years ago. These data have been \"scrubbed\", so\nthat specifically identifying information has been altered or removed.\nNevertheless, please treat the data with sensitivity, because you will know from\nour discussion of medical data confidentiality that even innocuous-seeming\ndata can help re-identify.\n-\nProblems marked as bonus question are not required and you don't have to\nanswer them, but I do suggest you take a look and think about them.\n1. You downloaded a program from the Internet that claims to predict whether a woman\nhas breast cancer based on information such as age, weight, etc. To verify whether this\nprogram can benefit actual people, you collected a data set including 40 women under\nthe age of 45 (none of which actually has breast cancer) and 10 women above the age\nof 45 (one of which actually has breast cancer). Only after you input all the data into the\nprogram did you realize that what the program actually does is to \"predict\" every woman\nabove the age of 45 to have breast cancer but every woman under the age of 45 not to\nhave breast cancer.\na) What's the estimation of the sensitivity and specificity of the program based on\nthe test on the data you collected?\nb) Suppose the prevalence of breast cancer is about 10% for women over 45, and\n0.1% for women under 45, while about 60% women in the population are under 45.\nWhat will be the sensitivity and specificity of this program when used in the whole\npopulation for a long time?\nc) (Bonus question, no credit) Please comment on the difference between the\nresults from a) and b), and make a suggestion on evaluating how accurate the\nestimation of sensitivity and specificity is.\n2. SQL practice on CWS database: please use as few as possible queries.\na) Please list the query to retrieve all disease names (no duplicated ones) in the\ndatabase. You may either use the table PROBLEMS and/or any other tables you\nthink appropriate.\nb) Please list the query or queries to retrieve the names of the doctors who have\ntreated the disease DIABETES-INSIPIDUS. You may use the tables PPR,\nPERSNL_PUBLIC and/or any other tables you think appropriate. (If a doctor has\ntreated a patient with DIABETES-INSIPIDUS, the doctor is considered as having\ntreated this disease.)\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\nIsaac Kohane, MD, PhD\nLucila Ohno-Machado, MD, PhD\n\nc) Give three different queries, each of which will estimate the total number of\npatients being tracked in the database. If they result in different numbers, discuss\nwhy. (Ignore the possibility that the same patient is entered several times but with\ndifferent identifiers.)\n3. We learned in class three different paper-based medical record systems: doctor's\njournal, patient's journal (e.g. Mayo), and problem oriented medical records (e.g.\nSOAP).\na) Please list the pros and cons of each system while comparing with the others.\nb) Design a simple relational database table scheme of electronic medical record\n(EMR) system, from which the above three styles of medical records can be easily\nretrieved.\nc) Please list the queries to create the table, and the queries to retrieve the three\ntypes of medical records.\nd) Mr. Murphy was sent to the hospital with a broken leg because of a car\naccident, completely healthy otherwise. He was treated and discharged by Dr.\nJenkins and Dr. Gehrke. Please list the query or queries to insert this new data into\nyour database.\n4. Describe an ideal Computer-based Patient Record (CPR) system based on the\nfunctional components and fundamental issues discussed in Shortliffe by listing at least\ntwo properties of each functional component and the three most important aspects of\neach fundamental issue. What kind of impediment would you expect to face to develop\nand use such a CPR?\n5. (Shortliffe page 396, p4) Describe the key philosophies underlying the design of\ncentral, modular, and distributed HCISs. What are at least two advantages and two\ndisadvantages of each architecture?\n6. (Bonus question, no credit) Please list at least two possible explanations of the\nfollowing fact: medicine spends 1-2% on IT, vs. 6-7% for business overall, vs.10-12% for\nbanking. Do you think information technology should play a more important role in\nmedicine? Why?"
    },
    {
      "category": "Resource",
      "title": "hw2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/8a635fafe124005ee38d362be1399fbf_hw2.pdf",
      "content": "Homework Assignment 2,\nHST.950\nHanded out:\nLecture 6\nDue in:\nLecture 10\nBuilding a Web-based EMR\nFor this problem, we ask you to explore techniques for how to\nbuild a Web-based electronic medical record system. The\npurpose of the assignment is to convince you, through personal\nexperience, that it is not immensely difficult to do at least a\nsimple job of building such a system, and that the power of the\nWeb and the availability of Web resources makes you very\npowerful. To keep the assignment within bounds, we make the\nfollowing assumptions:\nThe EMR will be read-only. I.e., there is no way to enter\nnew data or revise existing data.\nWe will use the CWS database, with which you should\nalready be somewhat familiar from the first assignment.\nWe provide you with a specific implementation\nenvironment that already includes some of the basics,\nfrom which you can build extensions by re-using patterns\nand tools already there. The specific environment we\nprovide is one that you are unlikely to have encountered\nbefore, though students who have taken 6.171 are likely\nto have a big leg up. We use the Resin web server, a\nsmall and simple Java-based server. The Web site is\nimplemented in JSP (Java Server Pages), which allows\nyou to intersperse HTML fixed content with Java code to\ncompute the dynamic parts of a page. In addition, we\nhave built a few utility classes for Java that you may find\nhelpful (we have) in building this project. And, finally,\nwe have begun a small implementation of the EMR's\ninterface, which you will extend.\nThere are two (and a half) ways to do this part of the problem\nset:\nUse a system we have set up especially for the class.\n<<This option is not available for OCW users.>>\nConfigure your own system to use the same technologies\nwe have set up:\n1. Obtain your own copy of the Resin server (which\nyou may use freely for non-commercial\ndevelopment). The current distribution appears to\nbe 2.1.7. Even a \"simple\" server has an immense\nnumber of features and capabilities that lie far\noutside our intended use. You can find\ndocumentation on how to install and run Resin at\nthe Caucho web site or on the \"top-level\" site on\nyour machine after you have installed it.\n2. Install a copy of the CWS database on your\nmachine. You may already have done this for the\nfirst homework assignment. I developed this code\nusing the Access version, but currently I am using\nMySQL and using the jdbc drivers for MySQL that\ncame with Resin. Presumably other methods would\nwork as well if they are supported on your system.\nPlease recall that this database has been\n\"scrubbed\", so none of the names, addresses, dates,\netc. in the database should correspond to reality,\nthough the original data were all real. Just in (the\nunlikely) case that we have mistakenly allowed\nsome identifying data past the scrubbing process,\nplease do not make these data public outside our\nclass.\n3. If you use Access, for which I don't know of direct\njdbc drivers, you will need to define a \"System\nDSN\" ODBC data source that references the CWS\ndatabase. Call the data source \"cws\". This can be\ndone with \"Control Panels\\Administrative\nTools\\Data Sources (ODBC)\" on your Windows\nXP, or something similar on other versions of\nWindows.\n4. Copy the contents of the top-level FTP directory\ndescribed in the other alternative approach to your\nmachine. You may put it anywhere, but will have\nto adjust the Resin configuration file to match. I\nhave it at c:\\cws.\n5. Add definitions to the resin.conf file to define the\ndata source and the cws \"web application\". The\nfollowing works on my server:\n<resource-ref>\n<res-ref-name>jdbc/cws</res-ref-name>\n<res-type>javax.sql.DataSource</res-type>\n<init-param driver-name=\"com.caucho.jdbc.mysql.Driver\"/>\n<init-param url=\"jdbc:mysql_caucho://localhost:3306/cwsscrubbed\"/>\n<init-param user=\"\"/>\n<init-param password=\"\"/>\n<init-param max-connections=\"20\"/>\n<init-param max-idle-time=\"30\"/>\n</resource-ref>\nand you also need to define the place where the\nweb directory is in your file system:\n<web-app id='/cws'>\n<app-dir>C:\\cws</app-dir>\n</web-app>\nwhere C:\\cws is the location chosen in step 4.\nIf you use Access instead of MySQL, I believe you\ncan just replace the corresponding lines above by\n<init-param driver-name=\"sun.jdbc.odbc.JdbcOdbcDriver\"/>\nHarvard-MIT Division of Health Sciences and Technology\n\nHST.950J: Medical Computing\n\nPeter Szolovits, PhD\nIsaac Kohane, MD, PhD\nLucila Ohno-Machado, MD, PhD\n\n<init-param url=\"jdbc:odbc:cws\"/>\nThe half-method: If you are very comfortable building\ndatabase-backed web sites (e.g., you have done well in\n6.171), feel free to build this any way you like.\nExplore\nFirst, connect to the skeletal server and note the functionality\nthat we initially provide. The main server page simply lists all\nthe patients in the CWS database alphabetically, along with\ntheir \"PAT_NUM\" identifiers. Each name links to a (dynamic)\npage that will display information specific to that patient. In the\nskeleton, this includes only demographics and the problem list,\nthough obviously much other data also exists in the CWS\ndatabase about these patients.\nTake a look at the index.jsp source code for the top page of the\nsite:\n<h1>CWS Database</h1>\n<table border=\"0\" cellspacing=\"5\">\n<tr><th>#</th><th>Patient</th></tr>\n<%\nSqlAccess s = null;\ntry {\ns = new SqlAccess(\"jdbc/cws\");\nList people = s.retrieveAll(\"select pat_num,last_name,first_name,title as mid_initl from pat_demograph order by last_name,first_name,mid_initl\");\nIterator it=people.iterator();\nwhile (it.hasNext()) {\nEntity b = (Entity)it.next();\nEnglishName n = new EnglishName(b.getS(\"last_name\"),\nb.getS(\"first_name\"),\nb.getS(\"mid_initl\"));\nout.write(\"<tr><td align=\\\"right\\\">\" + b.getS(\"pat_num\")\n+ \"</td><td><a href=\\\"pt.jsp?id=\"\n+ b.getS(\"pat_num\") + \"\\\">\"\n+ n.toString()\n+ \"</a></td></tr>\\n\");\n}\n}\nfinally {\nif (s!=null) s.close();\n}\n%>\n</table>\nThis code uses three utility classes defined in the edu.mit.lcs\npackage:\n1. SqlAccess: encapsulates connection and access to the\ndatabase. Provides methods retrieve and retrieveAll that\nreturn the results of a SQL query. Retrieve yields an\nEntity, and retrieveAll yields a List of Entities.\n2. Entity: An association-list that is used to represent rows\nfrom a relational data base, field names/contents from an\nHTML form, etc. get retrieves the value associated with\nits argument, which is a String. getS is like get, but\nyields an empty string instead of a null. getH is like\ngetS, but \"HTML-encodes\" its contents (e.g., \"<\" turns\ninto \"&lt;\"). getMdyDate and getSqlDate turn various\nformats of date strings into 12/31/1999-style and\n1999-12-31-style dates.\n3. EnglishName: Understands structured forms of\nEnglish-style names, which can be constructed from their\nparts or by parsing a string containing the whole name.\ntoString and toFNF return the \"Smith, Joseph\" and\n\"Joseph Smith\" versions. getXXX and setXXX methods\nexist for each part of the name: first, last, middles, vons,\nand suffix. This is modeled on BibTeX's analysis of\nnames.\nThe code above creates a SqlAccess object s that holds the\ndatabase connection. The call to retrieveAll selects name parts\nand patient number from the patient demographics table. We\nthen iterate over all the elements of this list. For each one, we\ncreate an EnglishName object, and output to the HTML page\nbeing constructed one row of a table, which holds the patient\nnumber, the last-name-first version of the name, and a\nhyperlink to pt.jsp with this patient number as the id\nargument. (Note that \"title as mid_initl\" solves an apparent\ndatabase bug, whereby patients' middle initials are stored under\n\"title\".)\nYou can download the files referenced above (see assignments\nsection of OCW site):\nindex.jsp\npt.jsp\nSqlAccess.java\nEntity.java\nEnglishName.java\nImprove PubMed access\nYou will see in pt.jsp that for any patient who has problems\nassociated with his/her case, our skeleton code has hyperlinked\neach problem name to a complex URL at the National Library\nof Medicine's PubMed that shows the user \"systematic review\narticles\" about the name of the problem. If you look at the\nNLM's site that this code uses,\nhttp://www.ncbi.nlm.nih.gov/entrez/query/static/clinical.html,\nyou will see that in fact there are also four other \"research\nmethodology filters\" that allow one to search for therapy,\ndiagnosis, prognosis and etiology-related articles about the\ntopic. Interestingly, the filters are actually relatively simple, but\nhave been shown in the Haynes reference to do a good job.\nHint: Where did I get the large URL embedded in pt.jsp, and\nthe other one in the comment near the end of that file?\nImplement an extension to the display generated by pt.jsp that\nallows the user to determine which of the five kinds of retrieval\n\nPubMed is to perform on the text of the problem name. Think\nabout how your user would perceive various ways you might\ndesign and implement this, and argue why you have chosen\nyour approach.\nAdd Laboratory lookup\nThe table pat_test_histv contains all the in-house Lab values\nmeasured. Design and implement an interface that provides\nhigh-level navigation tools to allow a user to look up labs for a\nspecific patient either chronologically (e.g., all lab values\nmeasured today) or organized as time series by the quantity\nmeasured (e.g., the sequence of serum creatinine values ever\nmeasured). Because this table has indications of which values\nare \"normal\" or not, be sure you indicate this visually. Note:\nThis is certainly an open-ended problem, but I urge you to\nspend only a limited amount of time on it, and focus on what\nyou consider interesting design issues. For example, you may\nbe tempted to graph various values; unless you are either a\nwizard Java Applet programmer or have a handy toolkit\navailable, resist the temptation.\nFood for Thought\nLooking at the rest of the data in CWS, briefly outline what\nadditional capabilities it could support toward having a\ncomplete browser for an EMR. This should be just design, not\nimplementation. Estimate how much effort it would take you to\nactually build it."
    },
    {
      "category": "Resource",
      "title": "hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/4fb2dbf27f1a7cda043fea0859adce05_hw3.pdf",
      "content": "6.872/HST950\nHomework 3\nProblem Set 3\nDue: LEC #15\n1.\nication Problem\nIn an earlier lecture, we had outlined a \"theory of record linkage\" (the full paper is linked from\nour class schedule page) that tells us, in principle, how to do probabilistic matching of various\nfeatures of two objects in order to decide whether they are likely to be the same object. Briefly,\nthe theory is as follows. I have interspersed questions for you to answer with the description.\n1. Given two purported objects (e.g., patients), o1 and o2, it is either the case that o1=o2 or\nthat they are distinct individuals.\nor example, our records contain a patient file for Raul\nA. Jones of 123 Main Street, Boston, MA 02131; a new patient arrives claiming to be\nRaul Jones of 123 Main Street, Boston, MA 02113.\n2. Among all the observations we might make of o1 and o2, we select a certain set of\nfeatures fi(o) that we agree will be of interest. or example, we might choose last name,\nfirst and middle names, street address, city, and ZIP code.\n3. For each pair of features fi(o1), fi(o2), we can compare the probability that one would\nobserve fi(o1), fi(o2) in either of the two cases of step 1.\nFor example, assuming that half the hospital's patient population have home addresses in\nBoston, then P(fcity(Raul), fcity(Jones)|~same) is 1⁄2 * 1⁄2. = 1⁄4.\ny contrast, if these two\nrecords belong to the same person, then we would just expect that the probability that that\nperson lives in Boston is 1⁄2.\n)\n|~\n,\n(\n)\n|\n,\n(\n=\n=\nsame\nBoston\nBoston\np\nsame\nBoston\nBoston\np\n. Further, if 1% of people in the city live on Main\nSt, then\n.0\n.0\n)\n|~\n,\n(\n)\n|\n,\n(\n2 =\n=\nsame\nMain\nMain\np\nsame\nMain\nMain\np\n.\ne may get an additional likelihood\nratio of 1000 (say) for the address, 123, and another factor of, say, 75, for both states\nbeing MA.\nese are both estimates, and answer the question what fraction of all\naddresses is 123, or what fraction of individuals like in MA. If our initial database\ncontains records on 1M individuals, then we might argue that the a priori odds are\nessentially\n/\n)\n(~\n)\n(\n-\n=\n=\nM\nsame\np\nsame\np\n. If we assume conditional independence of each of\nthe feature pairs from each other e.g., if we believe that you are no more likely to get\nmatching street numbers on Main Street than on Sunset Boulevard, then the posterior\nestimate is\n.\n.0\n10 6\n=\n⋅\n⋅\n⋅\n-\nI have added tables lastnames, malenames and femalenames to the cwsscrubbed\ndatabase on Singapore in case you are interested in playing with name frequency tables\ndownloaded from the census bureau last year.\nch table has four columns:\n- Name, in all-caps\n- Freq, the percent of the (relevant) population that has this name\n- Cum, the cumulative percent of the relevant population that has this or a more\nfrequent name\nIdentif\nF\nF\nB\nThus, the likelihood ratio\nW\nTh\nEa\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\nIsaac Kohane, MD, PhD\nLucila Ohno-Machado, MD, PhD\n\n- N, the ordinal index of this name in its table.\nE.g., SMITH is the most common last name, accounting for 1.006% of the population.\nJOHNSON is next, being 0.810%. The two most common names thus account for\n1.816% of the population. AALDERINK is the 88799th most common last name (and the\nlast one in this table), and accounts, at this resolution, for 0% of the population. A little\nover 9.5% of the population have last names (like mine) that are even less common, and\nnot listed. JAMES, JOHN, ROBERT, MICHAEL and WILLIAM are the five most\ncommon male names, being almost 15% of males, and MARY is the most common\nfemale name (2.629%), followed by PATRICIA, LINDA, BARBARA and ELIZABETH.\nThe top five account for less than 7%, suggesting more diversity in female names.\nIndeed it takes 1219 male names to cover 90% of the males, but 4275 female names to\ncover 90% of the females.\n4. Treating the mismatches on first name and ZIP code correctly are challenging problems.\nFor example, the fact that Raul A.'s middle initial is the same as the starting letter of A. Jones\nmight suggest that his official name is Raul Jones, but he sometimes goes by A.Jones. One\nneeds a theory of how to estimate the likelihood of this, compared to the obvious\npossibility that these are simply different people.\nQ1: Explain how you would come up with an estimate of this likelihood ratio.\nSimilarly, though the ZIP codes are different, one might turn into the other by a simple\ntransposition, which is probably a common transcription error.\nQ2: Give an estimate of the likelihood ratio for this pair of ZIP codes, and explain how\nyou would estimate that ratio from data you might have available to you or data you\nmight be able to acquire in a small study.\nIn any case, we would expect that both likelihood ratios are smaller than 1.0; i.e., the\nmismatches are more likely if these are different individuals than if they are the same.\nTherefore, if we aggregate these with the previous calculation, the result is less than 1.5%\nlikelihood (really odds) that these are the same individual.\nThe assumption of conditional independence among pairs of (mis)matching features is not really\nappropriate under some circumstances, no matter how convenient it may be. For example,\ndifferent ethnic groups tend to have different last names (e.g., you might be more tempted to\nlook for my ancestry among Central Europeans than Chinese, Hawaiians, Welsh or Hispanics).\nBut the distribution of first names often follows similar ethnic patterns. Therefore, if you\ncompare two records each with the name \"Raul Gonzales\", the likelihood ratio should almost\ncertainly not be as high as the product of the likelihood ratios for \"Raul\" and for \"Gonzales\".\nIntuitively, once I learn that two records have a Hispanic last name, then a further match on a\nHispanic first name should be less impressive than that same further match would be in\nconjunction with a Slavic last name (because that combination is much more rare). The census\nbureau (www.census.gov) does not, to my knowledge, publish statistics on name distributions in\ndifferent ethnic groups or on the correlations between first and last names.\n\nQ3: What kind of mathematical model would you make to allow you a first-order adjustment for\nthe non-independence of matches among first and last names based on ethnicity?\nQ4: List three other potential sources of non-independence that might be appropriate to take into\naccount in implementing a patient identification system based on probabilistic matching.\nQ5. How to be a CIO\nYou have heard two different CIO's, both at large Boston area integrated delivery networks, talk\nabout their conception of their jobs (either implicitly or explicitly). Please compare and contrast\nthe views of Drs. John Glaser and John Halamka as they presented their ideas in class. Note:\nYour answer should be brief (no more than a page), but interesting and insightful."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/cfe33fec153d91586af3527e983b4f75_lecture1.pdf",
      "content": "Intro to Medical Informatics\nMedical Informatics\n- Intersection of medicine and computing\n- Plus theory and experience specific to this\ncombination\n- =Medical Computing, ~Health Informatics\n- Science\n- Applied science\n- Engineering\nOutline\n-\ni\ncare\n-\nl\n-\nMI def ned by goals and methods of health\nMedical data: essentia\nExpertise (methods)\n- Procedural\n- Inferential\n- Causal\n- Probabilistic\nThe Medical Cycle\nobserve\nplan\ndecide\npatient\ndata\ninformation\ndiagnosis\ntherapy\ninitial presentation\nCare Processes\nMeta-level processes\n- Acquisition and application of knowledge\n- Data: instrumentation, monitoring, telemetry\n- Education\n- Information: interpretation, filtering, sampling,\n- Quality control and process improvement\nsmoothing, clustering\n- Cost containment\n- Diagnosis: inference, model-based\nreasoning, classification\n- Reference (library)\n- Prognosis: prediction, natural course,\nexperience\n- Therapy: planning, predicting effects,\nanticipating\nHarvard-MIT Division of Health Sciences and Technology\n\nHST.950J: Medical Computing\n\nPeter Szolovits, PhD\n\nIntro to Medical Informatics\nTime scale in medicine\n- Cure--usually acute illness\n- Manage--long-term, chronic illness\n- Prevent\n- Predict (especially based on genetics)\nWHO Constitution defines\n\"health\"\n\"a state of complete physical, mental and\nsocial well-being and not merely the\nabsence of disease or infirmity\"\n- Physical\n- Mental\n- Social\n--very hard to measure\nDistribution of Ages\n- Li\n(\nfe table\ndeaths by year\nJapan, 1989)\nLife table death rates by age\nLife table cohort survival\nMeasures of Health\n- Longevity at birth (CIA World Fact Book, 2001)\nUS SSA 1997\n\nIntro to Medical Informatics\nQuality of life\n- Value of a total life depends on\n-Length (assume now is N)\n-Quality (q) over time\n-Discounts ( g) for future or past\n(depends very much on what the\nvalue is to be used for)\nVN=Integral[t=0,T] q(t) g(t-N) dt\nTop 10 Chronic Conditions\nPersons aged 65\nU.S. Nat'l Ctr Health Stat, Vital and Health Statistics, 1985 (1982 data)\nCauses of death\n(industrialized countries, 1989)\nCirculatory\n48%\nsystem\nMalignant\n19%\nneoplasms\nAccidents\n7%\nOthers\n26%\nModeling life quality\nSocietal quality of life\n- Aggregation of individual qualities\n+ Equity (distributions)\n- Is more better? (Population control.)\n- Is less better?\n- How much to spend?\n\nIntro to Medical Informatics\nAggregation\n- Trend: social aggregation leads to\ndecisions at a larger scale\n- Multi-specialty providers\n- Government guarantees and mandates\n- Risk sharing\n- Oregon-wide spending \"optimization\";\n- British NHS\nChanging Context of Health\nCare\n- Fee-for-service\n- HCFA (Health Care Financing Agency)\npays for Medicare\n- Capitation\n- HMO's (Health Maintenance Organizations)\ntake overall responsibility to care for patient\nfor fixed fee\n- Pushing risk down to the physician or group\nDetermining Factors:\n$£€¥R\nExponentially growing expense\nof health care\n- More healthcare than steel in GM cars\n- Increased demand\n- Much more possible\n- Better tests, therapies\n- High human motivation\n- No pushback\n- Waste\n- Unnecessary procedures\n- 1⁄2 of health expenses in last year of life\n- Marginally useful procedures\n- Defensive medicine\n- Bad Medicine\nManaged Care\nControlling Costs and Changing Patient Care IOM, 1989"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture2.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/49095d628dec2104d658c0752b939c0b_lecture2.pdf",
      "content": "Intro to Medical Informatics\nNature of Medical Data\n6.872/HST950\nLecture# 2\nImplications of Health Care\nOrganization for Informatics\n- Money determines much\n- Medicine spends 1-2% on IT, vs. 6-7% for business\noverall, vs. 10-12% for banking\n- \"Bottom line\" rules, therefore emphasis on\n- Billing\n- Cost control\n- Quality control, especially if demonstrable cost savings\n- Retention and satisfaction (maybe)\n- Management by accountants\nWho Keeps Records?\n- Doctor\n- Nurse\n- radiologist\n- Office staff,\n- pharmacist\nadmissions\n- patient\n- Administrator\n- physical therapist\n- lab personnel\nOutline\n- Recall context of current medical practice\n- History of medical record keeping\n- Organization of medical records\n- Computerized medical records\n- Why\n- Key issues\n- Failures and successes\n- Current approaches\nWhy Keep Records?\n- Basis for historical record\n- Communication among providers\n- Anticipate future health problems\n- Record standard preventive measures\n- Identify deviations from the expected\n- Legal record\n- Basis for clinical research\nForms of Clinical Data\n- Numerical Measurements\n- Coded (?) discrete data\n- Lab data\n- Family history\n- Bedside measurements\n- Patient's medical history\n- Home instrumentation\n- Current complaint\n- Recorded signals (e.g.,\n- Symptoms (patient)\nECG, EEG, EMG)\n- Signs (doc)\n- Physical examination\n- Images (X-ray, MRI, CAT,\n- Medications\nUltrasound, Pathology,\n- Narrative text\n...)\n- Genes (SNPs,\n- Doctor's, nurse's notes\nexpression arrays,\n- Discharge summaries\npedigrees, ...)\n- Referring letters\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\n\nIntro to Medical Informatics\nPOMR\nData Base\nProblem List\nPlans\n(by problem)\nProgress Notes\n(by problem)\ndiagnostic, therapeutic,\npatient education\nThe Data Base\nThe Problem List\n- \"those features in the patient's psychobiological\n- Identifying information (name, age, sex, race, religion, insurance info,\nmakeup that require continuing attention\"\netc.)\n- Patient profile (occupation, education, marital status, children,\n- Social history\nhobbies, worries, moods, sleep patterns, habits, etc.)\n- Risk factors\n- Medical history\n- Chief complaints\n- Symptoms\n- History of present illness\n- Physical findings\n- Past medical history\n- Review of systems\n- Lab tests\n- Family history\n- Causally organized; e.g., GI bleeding caused by\n- Medications\n- Physical examination\nduodenal ulcer appears under the ulcer\n- Laboratory data and physiologic tests (complete blood count,\nelectrocardiogram, chest x-ray, creatinine, urinalysis, vital capacity,\ntonometry, etc.)\nOrganization of Data\n- Doctor's journal (traditional)\n- Time order of collection, per patient\n(Mayo)\n- Source of data\n- Problem-Oriented Medical Record\n(POMR) (L. Weed, 1969)\n- Notes organized by problems\n- SOAP: subjective, objective, assessment,\nplans\nExample Problem List\nNov\nUnemployment\nJune\nSLE\nJune\n#9\nApr 1973\nProteinuria\nJune\n#9\nMar 1973\nPleurisy\nJune\n#9\nMar 1973\nArthralgias\nMar\nCholecystectom\ny\nOct 1972\nGallstones\nS/P pyelonephritis\nPenicillin allergy\nRecurrent bronchitis\nHypertension\nDate\nInactive\nDate\nActive\nNo\nProblem-Related Plans\n- Diagnostic: lab tests, radiology studies,\nconsultations, continued observations, ...\n- Therapeutic: medications, diet,\npsychotherapy, surgery, ...\n- Patient education: instruction in self-care,\nabout goals of therapy, prognosis, ...\n\nIntro to Medical Informatics\nPlans per problem\n1. Diarrhea\nDx:\n-\nstool for occult blood, culture, ova, and parasites,\nmicroscopic fat; and muscle fibers\n-\nSigmoidoscopy\n-\nBarium enema if persistent\nRx: Avoid foods that exacerbate\nEd: Informed that more info is needed to make a\ndiagnosis, will aim for symptomatic therapy for now.\nProgress Notes\n- Subjective: interval history, adherence to\nprogram\n- Objective: physical findings, reports of lab,\nx-ray, other tests\n- Assessment: Appraisal of progress,\ninterpretation of new findings, etc.\n- Plan: Dx, Rx, Ed.\nPOMR characteristics\n- Augment with data flow sheets\n- Importance of clinical judgment\n- Benefits:\n- Communication among team members,\nexplicitness\n- Education and audit\n- Clinical research\nPlans per problem (cont.)\n2. Pyuria\nDx:\n-\nBUN\n-\nRepeat urinalysis\n-\nUrine culture\n3. Obesity\nRx:\n1500 kcal diet, Weight Watchers\nEd:\nDangers of obesity cited. Goal: 170 lbs.\nExample SOAP Note\n#3 RHD with mitral stenosis\nS:\n2 flight dyspnea, mild fatigue. No orthopnea, hemoptysis, ankle\nedema. Child has strep throat.\nO: BP 120/70. P 78 regular\nNeck veins normal, lungs clear.\nGrade iii diastolic rumble, wide opening snap, P2 slightly ↑\nA:\nStable. Catheterization still not indicated. Risk of strep throat\npresent.\nP:\nDx: Cardiac fluoroscopy\nRx: Continue chlorothiazide and penicillin V 250mg b.i.d.--2\nweeks\nEd: Reinstructed about antibiotic coverage for tooth\nextractions,\nsched. for next month. (Will contact oral surgeon.)\nPOMR evidence\n- Difficult adoption\n- Some duplication\n- Some doctors liked it\n- Paper-based POMR slow, computer-\nbased maybe faster\n- Demand-oriented MR: by time, by source,\nby problem, etc. Dynamic arrangement.\n\nIntro to Medical Informatics\nMayo experience\n- Paper records, mostly\n- Pneumatic tube delivery, therefore limited\nsize\n- Formal procedures for reaping and\norganizing records at discharge\n- Comprehensive index\nPaper record: Strengths\n- Familiar; low training time\n- Portable to point of care\n- No downtime\n- Flexibility; easy to record subjective data\n- Browsing and scanning\n- Find information by unanticipated\ncharacteristics (e.g., Dr. Jones' handwriting)\nThe Computer-based\nPatient Record\n- IOM Study: Dick, R. S. and Steen, E. B., Eds.\n(1991). The Computer-Based Patient Record: An\nEssential Technology for Health Care. Washington,\nD.C., National Academy Press.\n- Made strong case for CPR\n- Recommended CPRI (Institute), but it never caught\non\n- Today's standards grow more out of communication\nstandards: HL7 (labs) and DICOM (digital images)\nPaper record: Weaknesses\n- Content: missing, illegible, inaccurate\n- E.g., one hospital study: 11% of tests were\nrepeats to replace lost information\n- Too thick (1.5 lbs avg.)\n- Fail to capture rationale\n- Incomprehensible to patients and families\nSample paper record defects\n- 75% of face sheets had no discharge\ndisposition, 48% no principal Dx\n- Agreement between encounter\n(witnessed) and record: 29% med hx, 66%\nRx, 71% info re current illness, 72% tests,\n73% impression/Dx, 92% chief complaint\n- 20.8% of Medicare discharges coded\nincorrectly (DRG inflation)\nMore paper record defects\n- Unavailable at up to 30% of patient visits\n- Two clinic visits in a day\n- Docs keep records in their office\n- Failure to deliver\n- Misfiled in file room\n- Discontinuity across institutions\n- In/outpatient records separate\n\nIntro to Medical Informatics\nEthnographic Design\n- Xerox PARC analysis of office work\n- Sociologists, Anthropologists, Engineers\n- Much of work is\n- communication,\n- assignment of responsibilities,\n- problem solving\nIndividual Users\nof Patient Records\n-\nProviders\n-\nManagement\n- Chaplains\n- Administrators\n- Dental hygienists\n- Financial managers and accountants\n- Dentists\n- Quality assurance managers\n- Dietitians\n- Records professionals\n- Lab technicians\n- Risk managers\n- Nurses\n- Unit clerks\n- Occupational therapists\n- Utilization review managers\n- Optometrists\n-\nReimbursement\n-\nPharmacists\n- Benefit managers\n- Physical therapists\n- Insurers (Fed, State, private)\n- Physicians\n-\nOther\n- Physician assistants\n- Accreditors\n- Podiatrists\n- Gov't policymakers, legislators\n-\nPsychologists\n- Lawyers\n- Radiology technologists\n- Health care researchers, clinical\n- Respiratory therapists\ninvestigators\n- Social workers\n- Health Sciences journalists and editors\n- Patients, families\nPrimary Uses\nof Patient Record\n-\nPatient care management\n-\nDocument case mix\n-\nPatient care delivery (Patient)\n-\nAnalyze severity of illness\n- Document services received\n-\nFormulate practice guidelines\n- Constitute proof of identity\n-\nManage risk\n- Self-manage care\n-\nCharacterize use of services\n-\nBasis for utilization review\n- Verify billing\n-\nPerform quality assurance\n-\nPatient care delivery (Provider)\n-\nPatient care support\n- Foster continuity of care\n-\nAllocate resources\n- Describe diseases and causes\n-\nAnalyze trends and develop forecasts\n- Support decision making about Dx and\n-\nAssess workload\nRx\n-\nCommunicate between departments\n- Assess and manage risk\n-\nBilling and reimbursement\n- Facilitate care via Clin. Practice\n-\nDocument services for payment\nGuidelines\n-\nBill for services\n-\nSubmit insurance claims\n- Document patient risk factors\n-\nAdjudicate insurance claims\n- Assess and document patient\n-\nDetermine disabilities (workmen's comp)\nexpectations and satisfaction\n-\nManage & report costs\n- Generate care plans\n-\nPerform actuarial analysis\n- Determine preventive advice\n- Remind clinicians\n- Support nursing care\n- Document services provided\nMedicine is an Information\nIndustry\n- 35-39% of hospital operating costs due to\nprofessional and patient communications\n- Physicians spend 38%, nurses 50% of\ntheir time charting\n- Exponential growth of medical knowledge\nand literature\nInstitutional Users\nof Patient Record\n-\nHealthcare Delivery\n-\nReimbursement\n- Alliances, associations, networks,\n- Business Health coalitions\nsystems of providers\n-\nEmployers\n- Ambulatory surgery centers\n- Insurers\n- Donor banks (blood, tissue, organs)\n-\nResearch\n-\nHMO's\n- Disease registries\n- Home care agencies\n- Health data organizations\n- Hospices\n- Health care technology developers and\n- Hospitals\nmanufacturers\n- Nursing homes\n- Research Centers\n- PPO's\n-\nEducation\n- Physician offices, group practices\n- Allied health professional schools,\n- Psychiatric facilities\nmedical, nursing, public health schools\n- Public Health Departments\n-\nAccreditation\n- Substance abuse programs\n- Accreditation organizations\n-\nManagement and Review\n- Inst. licensure agencies\n- Medicare peer review organizations\n- Prof. Licensure agencies\n- Quality assurance companies\n-\nPolicymaking\n- Risk management companies\n- Fed, State, Local gov't agencies\n- Utilization review/management comp.\nSecondary Uses\nof Patient Record\n-\nResearch\n-\nEducation\n- Develop new products\n- Document health care professional\n- Conduct clinical research\nexperience\n- Assess technology\n- Prepare conferences and presentations\n- Study patient outcomes\n- Teach students\n- Study effectiveness and cost\n-\nRegulation\neffectiveness of care\n- Evidence in litigation\n- Identify populations at risk\n- Foster postmarketing surveillance\n- Develop registries and databases\n- Assess compliance with standards\n- Assess cost-effectiveness of\n- Accredit professionals and hospitals\nrecord systems\n- Compare health care organizations\n-\nIndustry\n-\nPolicy\n- Conduct R&D\n- Allocate resources\n- Plan marketing strategy\n- Conduct strategic planning\n- Monitor public health\n\nIntro to Medical Informatics\nUser Requirements\n- Record Content\n- Record Format\n- Uniform core data\n- \"Front-page\" problem list\n- Ability to \"flip through\" the\nelements\nrecord\n- Standardized coding\n- Integrated among\ndisciplines and sites of care\nsystems and formats\n- System Performance\n- Common data\n- Rapid retrieval\ndictionary\n- 24/7\n- Information on\n- Available @ convenient\noutcomes of care and\nplaces\nfunctional status\n- Easy data input\nUser Requirements (cont.)\n-\nLinkages\n-\nIntelligence\n- To other info systems (e.g.,\n- Decision support\nradiology, lab)\n- Clinician reminders\n- Transferability of information\n- \"Alarm\" systems, customized\namong specialties and sites\n-\nReporting\n- With relevant literature\n- \"Derived documents\", e.g.,\n- Other registries and institutional\ninsurance forms\ndatabases\n- Easily customized output, UI\n- To records of other family\n- Standard clinical reports, e.g.,\nmembers\ndischarge summary\n- E-billing\n- Custom and ad hoc reports\n- Trend reports and graphics\n-\nTraining and Implementation\n-\nControl and Access\n- Minimal training required\n- Easy patient access\n- Graduated implementations\n- Safeguards of confidentiality\nWhy is this hard?\n- Characterize edema:\n- Where?\n- Thousand diseases,\n- When?\nsyndromes, clinical states\n- How often?\n- Few thousand symptoms,\n- Temporal variation?\nsigns, observables\n- Few thousand specific lab\n- Severity\ntests\n- Symmetry\n- Thousands of meds,\n- What other\nvariations, combinations,\ncharacteristics?\nroutes, dosage schedules,\n- Uncertainties in all of\n...\nthe above\n- ??? Treatments"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture4.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/21443a6d64f3499e0518ab5fb15b9050_lecture4.pdf",
      "content": "Health Enterprise Computing\nand Patient Identification\n6.872/HST.950\nLecture #4\n(with first half content\nfrom David Margulies)\n\nKnowledge\nKnowledge\nAssets\nAssets\nPlan\nPlan\nTertiary\nTertiary\nClinics\nClinics\nPlans\nPlans\nPHO\nPHO\nPPO\nPPO\nMSO\nMSO\nAffiliations\nAffiliations\nContracts\nContracts\nIDS\nIDS\nPPO\nPPO\nCarve\nCarve--Outs\nOuts\nPurveyors\nPurveyors\nPSO\nPSO\nTHE GOVERNMENT\nTHE ENROLLEE\nTHE HOME\nTHE EMPLOYER\nComplexity now\nComplexity now\nwithin...\nwithin...\nContext: Evolution of Clinical Computing...\n- Focus evolved from automating AR process\nin hospitals, to LAN-based SI of\ndepartmental systems, to enterprise clinical\ncomputing, toward region- and system-level\nprocess automation\n- Changing healthcare organizational models\nand economic models ---> changing clinical\ncomputing priorities and designs\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\n\nPhase 2: LAN-based SI -- Automate Data\nDistribution to MDs...\nCase\nCase\nMix\nMix\nMaterial Mgmt\nMaterial Mgmt\nPayroll\nPayroll\nGeneral Ledger\nGeneral Ledger\nAccounts Payable\nAccounts Payable\nLaboratory\nLaboratory\nNursing\nNursing\nPharmacy\nPharmacy\nRadiology\nRadiology\nSurgery\nSurgery\nInternal Medicine\nInternal Medicine\nOrder Comm\nATDs\nPatient Acct\nPatient Acct\nEntry\nEntry\nPhysician\nPhysician\nPhase 3: Data-based SI to Create an EMR...\nCase\nMix\nMa\ni l Mgmt\nMaterial Mgmt\nPayroll\nPayroll\nGe\nl Ledg\nGeneral Ledger\nAccounts Payable\nAccounts Payable\nLaboratory\nLaboratory\nNursing\nNursing\nPharmacy\nPharmacy\nRadiology\nRadiology\nSurgery\nSurgery\nInt\nInt Med\nMed\nOrder Comm\nOrder Comm\nATDs\nATDs\nPatient Acct\nPatient Acct\nData\nData\nRepository\nRepository\n\"Electronic\n\"Electronic\nMedical\nMedical\nRecord\"\nRecord\"\nParadigm 1\nParadigm 1\nParadigm 2\nParadigm 2\nPat\nPat\nAcct\nAcct\nLaboratory\nLaboratory\nNursing\nNursing\nPharmacy\nPharmacy\nRadiology\nRadiology\nSurgery\nSurgery\nInt\nInt Med\nMed\nOrder\nOrder\nComm\nComm\nATDs\nATDs\nViewer\nViewer\nDocument\nDocument\nExpert\nExpert\nSystems\nSystems\nClinician's System\nClinician's System\nInterface Engine\nInterface Engine\nOrder\nOrder\nMgmt\nMgmt\nDATA REPOSITORY\nGroup\nGroup--Patient\nPatient\nRelationships\nRelationships\nPatient\nPatient--Provider\nProvider\nEncounters\nEncounters\nPatient\nPatient--Provider\nProvider\nRelations\nRelations\nClinical Events:\nClinical Events:\nProcedures, Results\nProcedures, Results\n& Documents\n& Documents\nClinical\nClinical\nOrders\nOrders\nClinical\nClinical\nProblems\nProblems\nClinical\nClinical\nCareplans\nCareplans\nStyles of\nStyles of\nPractice\nPractice\nProviders\nProviders\n& Other\n& Other\nPersonnel\nPersonnel\nGroups\nGroups\nFacilities\nFacilities\n&\n&\nLocations\nLocations\nPatients\nPatients\nFacility\nFacility--Group\nGroup\nAffiliations\nAffiliations\nVisits\nVisits\nGroup\nGroup--Provider\nProvider\nRoles\nRoles\nInstitutional\nInstitutional\nCare\nCare\nStandards\nStandards\n& Protocols\n& Protocols\nMembership\nMembership\nCare\nCare\nTeam\nTeam\nInt.\nInt.\nMed\nMed\nRad\nRad\nLab\nLab\nPharm\nPharm\nSurgery\nSurgery\nAccount\nAccount\nPlan\nPlan\nDesign\nDesign\nDischarge\nDischarge\nDismiss\nDismiss\nEpisode\nEpisode\nActivation\nActivation\nAuthorization\nAuthorization\nHealth\nHealth\nStatus\nStatus\nMgt.\nMgt.\nCommunity\nCommunity\nCare\nCare\nSelf\nSelf\nCare\nCare\nEvaluate\nEvaluate\nAssess\nAssess\nPlan\nPlan\nAct\nAct\nSchedule\nSchedule\nRefer\nRefer\nVisit\nVisit\nActivation\nActivation\nMgt.\nMgt.\nTeam\nTeam\nHealth\nHealth\nMgt.\nMgt.\nHealth\nHealth\nRecord\nRecord\nMeasure\nMeasure\nPhase 4: Enterprise-level Clinical Process\nAutomation...\n\nMost Installations...\nDismiss\nDischrg\nFollow-\nUp\nAccount\nPlan\nAct\nEvaluate\nAssess\nRegister\nAdmit\nCheck\nHistory\nSchedule\nPharm\nSurgery\nInt\nMed\nLab\nRad\nRefer\nCare\nCare\nTeam\nTeam\nMedical\nMedical\nRecord\nRecord\nClinical Data\nClinical Data\nRepository\nRepository\nBased...\nBased...\nClinicians'\nClinicians'\nWorksystem\nWorksystem\nMayo\nGenesys\nSOM\nEMMC\nHMW\n......\nSamaritan\nDifferent Imperatives,\nDifferent IT Strategies\nWorld\nWorld--Wide\nWide\nCommunity\nCommunity--Wide\nWide\nMultiple Facilities\nMultiple Facilities\nCritiqueing\nCritiqueing\nScheduling\nScheduling\nCommon Clinical Ordering\nCommon Clinical Ordering\nElectronic Chart Viewer\nElectronic Chart Viewer\nClinical Data Repository\nClinical Data Repository\nMPI/ADT Synchronization\nMPI/ADT Synchronization\nIndependent Departmental Systems\nIndependent Departmental Systems\nComputer\nComputer--Based Patient Record\nBased Patient Record\nCare Team Support\nCare Team Support\nEvolutionary Stages\nDepartmental\nDepartmental\nSystem\nSystem\nStages\nStages\nVirtual\nVirtual\nDatabase\nDatabase\nIntegrated\nIntegrated\nDatabase\nDatabase\nComputer\nComputer--Based\nBased\nPatient Record\nPatient Record\nCare Process\nCare Process\nIntrarelation\nIntrarelation\nPro\nPro--Active\nActive\nManagement\nManagement\nConcurrent\nConcurrent\nEvent\nEvent\nCritiquing\nCritiquing\nCharacteristics\nCharacteristics\nExamples\nExamples\nAccess Directly Via Program\nAccess Directly Via Program\n- highly structured\n- powerful\nWorkstation Access Via Network\nWorkstation Access Via Network\ndistribution data\ndistribution data\ndisparate databases and user interface\ndisparate databases and user interface\nPathNet\nPathNet Laboratory\nLaboratory\nInformation System\nInformation System\nHL7 Query Tools\nHL7 Query Tools\nCopy Data into Central Depository\nCopy Data into Central Depository\nrelationships possible\nrelationships possible\ncommon user interface\ncommon user interface\nmultimedia\nmultimedia\nORACLE\nORACLE\nControl Access and Encode\nControl Access and Encode\nnomenclature support\nnomenclature support\nsecu rity and au dit control\nsecurity and audit control\ndata succession\ndata succession\ndate authenticity\ndate authenticity\nOpen Clinical\nOpen Clinical\nFounda tion D ata\nFoundation Data\nRepository\nRepository\nDiagnoses, Care Plans and Orders\nDiagnoses, Care Plans and Orders\ncontext for results\ncontext for results\nexpectations possible\nexpectations possible\nrequirements for records\nrequirements for records\nOperations Data\nOperations Data\ncare management\ncare management\nfiscal management\nfiscal management\nEIS\nEIS\nNormative Data and Rules\nNormative Data and Rules\nextrapolations\nextrapolations\nmanagement by protocol\nmanagement by protocol\nProNet\nProNet Orders\nOrders\nCareNet\nCareNet Plans\nPlans\nMRNet\nMRNet Operations\nOperations\nOpen Management\nOpen Management\nFounda tion D ata\nFoundation Data\nRepository\nRepository\nDiscern Rules\nDiscern Rules\nAPACHE\nAPACHE\nMEDIQUAL\nMEDIQUAL\nBeyond the Enterprise: CHINs\nValid needs, No Buyer...\nCommunity\nCommunity\nHealth\nHealth\nInformation\nInformation\nServices\nServices\nPhysicians\nClinics, HMOs\nHospitals\nUtility\nProviders\nRepository\nCore Services\n- E-Mail\nDatabase Systems\n- Membership Server\n- Health Plan Server\n- Health Record Index\n- Outcomes Management\nTransaction Systems\n- Scheduling Services\n- Report Management\n- Claims Consolidation\n- Utilization Review\nBusiness Systems\n- Client Billing\n- Financial Accounting\nCore Services\nCore Services\n-- EE--Mail\nMail\nDatabase Systems\nDatabase Systems\n-- Membership Server\nMembership Server\n-- Health Plan Server\nHealth Plan Server\n-- Health Record Index\nHealth Record Index\n-- Outcomes Management\nOutcomes Management\nTransaction Systems\nTransaction Systems\n-- Scheduling Services\nScheduling Services\n-- Report Management\nReport Management\n-- Claims Consolidation\nClaims Consolidation\n-- Utilization Review\nUtilization Review\nBusiness Systems\nBusiness Systems\n-- Client Billing\nClient Billing\n-- Financial Accounting\nFinancial Accounting\nNetwork Applications\n- E-Mail\nDatabase Application\n- Membership\n- Eligibility\n- Health Record Access\n- Outcomes Measurement\nTransaction Applications\n- Scheduling/Referrals\n- Electronic Signature\n- Claims Processing\nClinical Systems\n- Case Management\n- AHP Business Systems\nNetwork Applications\nNetwork Applications\n-- EE--Mail\nMail\nDatabase Application\nDatabase Application\n-- Membership\nMembership\n-- Eligibility\nEligibility\n-- Health Record Access\nHealth Record Access\n-- Outcomes Measurement\nOutcomes Measurement\nTransaction Applications\nTransaction Applications\n-- Scheduling/Referrals\nScheduling/Referrals\n-- Electronic Signature\nElectronic Signature\n-- Claims Processing\nClaims Processing\nClinical Systems\nClinical Systems\n-- Case Management\nCase Management\n-- AHP Business Systems\nAHP Business Systems\nExternal\nOrganizations\n\nCommunity Health\nInformation Needs\nPerson Identification Server\nMembership Server\nPlan/Eligibility Server\nHealth Record Server\nResource Scheduling Server\nCare Protocol Server\nCommerce Server\nCare Maps\n- Defined and tested\nclinical methods\n- Specific paths through\nmap individualized\n- Multiple opportunities\nfor triage and adaptation\n- by planned choice\n- by risk\n- by availability\n- by length of trajectory\n- by cost\n- by new information\nPlan and manage\nTHE EYE OF THE\nCLINICIAN\nExternal\nExternal\nKnowledge\nKnowledge\nPersonal\nPersonal\nProductivity\nProductivity\nLab\nLab\nMeds\nMeds Surgery\nSurgery Rad\nRad\nDietary\nDietary Nursing\nNursing\nNLM\nNLM\nLiterature\nLiterature\nDatabases\nDatabases\nCase\nCase\nManagement\nManagement\nCarePlans\nCarePlans\nProblems\nProblems\nMD\nMD\nRN\nRN\nChart\nChart\nReview\nReview\nEdit\nEdit\nNotes\nNotes\nOrders\nOrders\nDecision\nDecision\nSupport\nSupport\nElectronic Medical Record\nElectronic Medical Record\nCERNER\nCERNER\nCERNER\nCORPORATION\nCORPORATION\nCORPORATION\nCPM\nCPM\nInfosystem\nInfosystem\nFunctional\nFunctional\nSpecifications\nSpecifications\n\"EMERGING FROM THE COMMON\n\"EMERGING FROM THE COMMON\nPROCESS MODEL\"\nPROCESS MODEL\"\nCerner Process Map\n\nSummary...\nDiverse organizational models\nHealthcare IT emphasis moving from enterprise to health\nsystem focus\nIncreased emphasis on patient's role and MD risk\nAn open, net-based commerce model fits in all\norganizational models\nDefinition...\n- Definition:\n- \"Net-based clinical commerce\" is the ability for\npatients, physicians, and other buyers of\nhealthcare products and services to arrange, track,\nand pay for services, purchase healthcare\ncommodity products from an electronic exchange,\nand manage health records on the Internet.\nContext: Evolution of Commerce on\nthe Internet...\n- Commerce-enabled Web\n- banking\n- retail\n- Extensive use in healthcare\n- research\n- communication\n- Toward Clinical Commerce!!\nHealthcare Commerce Entry Barriers\n- Consumers purchase health processes\n- Processes are ongoing with multiple points\nof contact with the provider\n- Payment is by assignment of entitlement\n- Payer exerts significant control over choice\n- Payer exerts significant control over care\n- Some goods and services require license\n\nPatient Identification\nPartners EMPI Goals\n- (Context) Partners Healthcare is affiliation of\nBrigham and Women's, Mass. General, North-\nShore Medical Center, Dana-Farber Cancer\nInstitute, Spaulding Rehab, McLean, Partners\nCommunity Healthcare, ..., formed in 1994.\n- Eliminate need to renumber existing systems by\ncreating Partners-wide unique ID\n- Foundation for Clinical Data Repository\n- Minimally invasive to current operations\n- Rapid installation\nPatient Identification\n- Example: Partners Health Care EMPI\n(Enterprise Master Patient Index)\n- Lisa Adragna, J AHIMA 1998 Oct;69(9):46-8,\n50, 52\n- Probabilistic Models for Matching\nPartners EMPI Scope\n- Medical record \"crosswalk\" across Partners\n- Local medical record numbers linked to\nPartners-wide ID\n- Back-end, real-time, one-way interface\n- No modifications to existing systems\n- Automated tools for identifying and\nresolving duplicates\n- No human intervention at \"run time\"\n\nPartners EMPI Matching\n- Three methods of lookup:\n- Last and First names\n- First name, Date of Birth and Gender\n- Social Security Number\n- If no matches, create new EMPI number\n- If exact match on all known features (above), then\nlink to existing EMPI entry\n- If multiple possible matches, create new entry and\nflag as potential duplicate; manual intervention\nPartners EMPI Experience (1997)\n- 1M records entered from BWH & MGH\n- 170,000 pair of records identified as\npotential duplicates\n- 80% of new registrations match a unique\nEMPI entry; ~1800/day\n- Sites made 3308 \"within-entity\" merges\n- EMPI Admin staff (3 FTE) resolved over\n200,000 potential duplicates.\nModels of Patient Matching\n- Ad hoc methods are weak, and difficult to\nimprove\n- Motivational observation:\n- Two records that share the last name\nKowalczyk are more likely to refer to the same\nindividual than two that share the name Smith.\nComputing posterior odds\nof a match\n- O(match|obs)=O(match)L(obs|match)\n- O(match)=1/N\n- L(obs|match)=P(obs|match)/P(obs|~match)\n- P(Smith,Smith|match) = P(Smith)\n- P(Smith,Smith|~match) = P(Smith)^2\n- L(Smith,Smith)=.01006/.01006^2=99.4\n- L(Kowalczyk,K...)=1/.00001=100,000\n\nMultiple evidence accumulates\n- Smith has same Soundex code as Smyth\n- L partially matches Liz\n- Same street address number, street name\n- Ave. vs. Blvd.\n- Different phone numbers\n- ...\n- Assume conditional independence\nSoundex\n- Developed in 1800's to represent phonetic\nsimilarity of names\n- E.g., Smith S-530; Smyth S-530\n- Rules:\n- 1 B, F, P, V\n- 2 C, G, J, K, Q, S, X, Z\n- 3 D, T\n- 4 L\n- 5 M, N\n- 6 R\n- Disregard the letters A, E, I, O, U, H, W, and Y.\n- Special rules for doubled consonants, prefixes, ...\nSoundex examples\nK-422\nKowalczyk\nS-530\nSmyth\nB-315\nBeethoven\nS-413\nSzolovits\nTyping/Transcription Error\nModel\n- Consider probabilities of\n- Insertion\n- Deletion\n- Transposition\n- (Mutation) - varies with key layout\n- Compute \"distance\" between mismatched\nfeatures\n- Same idea in BLAST\n\nA Theory for Record Linkage\n- Fellegi IP, Sunter AB. J. Am. Stat. Assn.\n64(328):1183-1210. 1969\n- Estimate L(obs|match) for all possible\nobservations\n- Normally must make independence assumption to\nfactor contributions of different aspects of obs\n- Define decision policy\n- P(A+|obs), P(A?|obs), P(A-|obs), sum=1\n- Based on thresholds on L's\n- Yields errors\n- P(A+|~match) or P(A-|match), minimize P(A?)\nBlocking Sets\n- Pair-by-pair comparison is expensive\n- E.g., 1M records at Partners 10^12 comparisons\n- Therefore, compare only smaller subgroups\n- E.g., assume first letter of name is never misspelled, as\nSoundex does\n- E.g., assume Soundex pronunciation code is correct,\neven if spelling is not\n- Increased chance of missing matches, much faster"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture5.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/60b1dd8b0e6889eb352d7f458d8a8905_lecture5.pdf",
      "content": "Infrastructure and Methods to\nSupport Real Time Biosurveillance\nKenneth D. Mandl, MD, MPH\nChildren's Hospital Boston\nHarvard Medical School\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nKenneth D. Mandl, MD, MPH\n\nCategory A agents\nz Anthrax (Bacillus anthracis)-\nz Botulism (Clostridium botulinum toxin) »\nz Plague (Yersinia pestis) »\nz Smallpox (Variola major) »\nz Tularemia (Francisella tularensis) »\nz Viral hemorrhagic fevers\n(filoviruses [e.g., Ebola, Marburg] and\narenaviruses [e.g., Lassa])\n\nNatural history--Anthrax\nz Incubation is 1-6 days\nz Flu like symptoms followed in 2 days by acute phase,\nincluding breathing difficulty, shock.\nz Death within 24 hours of acute phase\nz Treatment must be initiated within 24 hours of\nsymptoms\n\nAttack scenario--Anthrax\nz State sponsored terrorist attack\nz Release of Anthrax, NYC subway\nz No notification by perpetrators\nz 1% of the passengers exposed during rush\nhour will contract the disease\n\nNeed for early detection\nGain of 2\ndays\nDetection\nPhase II\nAcute Illness\nPhase I\n0.1\n0.2\n0.3\n0.4\n0.5\n0.6\n0.7\n0.8\n0.9\nDisease Detection\nEarly Detection\nTraditional Disease\nInitial Symptoms\nEffective Treatment\nIncubation Period (Hours)\nPeriod\n\nBut . . .\nz Until now, there has been no real time surveillance\nfor any diseases\nz The threat of bioterrorism has focused interest on\nand brought funding to this problem\n\nWhere can real time information\nhave a beneficial effect?\nz Diagnosis\n9 Decision Support\nz Response\n9 Coordination\n9 Communication\nz Surveillance\n9 Detection\n9 Monitoring\n\nSurveillance of what?\nz Environment\n9 Biological sensors\nz Citizenry\n9 Health related behaviors\n9 Biological markers\nz Patient populations\n9 Patterns of health services use\n9 Biological markers\n\nSyndromic surveillance\nz Use patterns of behavior or health care use, for early\nwarning\nz Example, influenza-like illness\nz Really should be called \"prodromic surveillance\"\n\nEarly implementations\nz Drop in surveillance\n9 Paper based\n9 Computer based\nz Automated surveillance\n9 Health care data\n9 \"Non-traditional\" data sources\n\nSyndromes tracked at WTC 2001\nSyndromic Surveillance for Bioterrorism Following the Attacks on the World Trade Center --- New York City, 2001.\nMMWR. 2002;51((Special Issue)):13-15.\n\nHealth care data sources\nz Patient demographic information\nz Emergency department chief complaints\nz International Classification of Disease (ICD)\nz Text-based notes\nz Laboratory data\nz Radiological reports\nz Physician reports (not automated)\nz ?new processes for data collection?\n\n\"Non traditional data sources\"\nz Pharmacy data\nz 911 operators\nz Call triage centers\nz School absenteeism\nz Animal surveillance\nz Agricultural data\n\nData Integration\nz Technical challenges\nz Security issues\nz Political barriers\nz Privacy concerns\n\nData Issues\nz Data often collected for other purposes\nz Data formats are nonstandard\nz Data may not be available in a timely fashion\nz Syndrome definitions may be problematic\n\nData quality\nz Data often collected for other purposes\n9 What do the data represent?\n9 Who is entering them?\n9 When are they entered?\n9 How are they entered? Electronic vs. paper\n\nMeasured quality/value of data\nCC: all resp ICD: upper resp ICD: lower resp CC or ICD: all resp\nsens [95% CI] .49 [.40-.58] .67 [.57-.76]\n.96 [.80-.99]\n.76 [.68-.83]\nspec [95% CI] .98 [.95-.99] .99 [.97-.99]\n.99 [.98-.99]\n.98 [.95-.99]\n\nSyndrome definition\nz May be imprecise\nz Sensitivity/Specificity tradeoff\nz Expert guided vs. machine-guided?\n\nModeling the Data\nz Establishing baseline\nz Developing forecasting methods\nz Detecting temporal signal\nz Detecting spatial signal\n\nBaseline\nz Are data available to establish baseline?\n9 Periodic variations\n)Day\n)Month\n)Season\n)Year\n)Special days\n9 Variations in patient locations\n)Secular trends in population\n)Shifting referral patterns\n)Seasonal effects\n\nBoston data\nz Syndromic surveillance\nz Influenza like illness\nz Time and space\n\nForecasting\n\nComponents of ED volume\nRESP\nSICK\nGI\nPAIN\nINJURY\nSKIN\nOTHER\n\nForecasting\n\nPrincipal Fourier component analysis\n1 week\n.5 week\n1 year\n1/3 year\n\nARIMA modeling\n\nForecasting performance\n- Overall ED Volume\n- Average Visits: 137\n- ARMA(1,2) Model\n- Average Error: 7.8%\n\nForecasting\n\nForecasting performance\n-Respiratory ED Volume\n- Average Visits: 17\n- ARMA(1,1) Model\n- Average Error: 20.5%\n\nGIS\n\nSeasonal distributions\n\nA curve fit to the cumulative distribution\n\nA simulated outbreak\n\nThe cluster\nP\ne\nr\nc\ne\nn\nt\ndistance\nCurve:\nBeta (Theta=-.02 Scale=95.5 a=1.44 b=5.57)\n\nMajor issues\nz Will this work at all???\nz Can we get better data?\nz How do we tune for a particular attack?\nz What to do without training data?\nz What do we do with all the information?\nz How do we set alarm thresholds?\nz How do we protect patient privacy?\n\nWill this work at all?\nz A syndromic surveillance system operating in the\nmetro DC area failed to pick up the 2001 anthrax\nmailings\nz Is syndromic surveillance therefore a worthless\ntechnology?\nz Need to consider the parameters of what will be\ndetectable\nz Do not ignore the monitoring role\n\nGetting better data\nz Approaches to standardizing data collection\n9 DEEDS\n9 Frontlines of Medicine project\n9 National Disease Epidemiologic Surveillance System,\nNEDSS\n\nTuning for a particular attack\nz Attacks may have different \"shapes\" in the data\nz Different methods may be more well suited to detect\neach particular shape\nz If we use multiple methods at once, how do we deal\nwith multiple testing?\n\nWill this work at all?\nz A syndromic surveillance system operating in the\nmetro DC area failed to pick up the 2001 anthrax\nmailings\nz Is syndromic surveillance therefore a worthless\ntechnology?\nz Need to consider the parameters of what will be\ndetectable\nz Do not ignore the monitoring role\n\nGetting better data\nz Approaches to standardizing data collection\n9 DEEDS\n9 Frontlines of Medicine project\n9 National Disease Epidemiologic Surveillance System,\nNEDSS\n\nNo training data\nz Need to rely on simulation\nz Imprint an attack onto our data set, taking in to\naccount regional peculiarities\n9 Artificial signal on probabilistic noise\n9 Artificial signal on real noise\n9 Real signal (from different data) on real noise\n\nWhat do we do with all of this information?\nz Signals from same data using multiple methods?\nz Signals from overlapping geographical regions?\nz Signals from remote geographical regions?\n9 Note: This highlights the important issue of\ninteroperability and standards\n\nProtecting patient privacy\nz HIPAA and public health\nz Mandatory reporting vs. syndromic surveillance\nz The science of anonymization\nz Minimum necessary data exchange\nz Special issues with geocoded data\n\nPerformance\nFilter Type\nSensitivity\nSpecificity\nOne Day\n0.30 [0.28,0.32]\n0.97 [0.96,0.98]\nMoving Avg\n0.65 [0.64,0.68]\n0.97 [0.96,0.97]\nLinear\n0.71 [0.69,0.73]\n0.97 [0.96, 0.97]\nExponential\n0.61 [0.60,0.64]\n0.97 [0.96, 0.98]\nTable 1. Detection performance of filters given simulated outbreaks 7-\ndays long and 20 visits per day, with 95% confidence intervals shown.\n\nArea Under ROC Curve\nSensitivity\n0.9\n0.8\n0.7\n0.6\n0.5\n0.4\n0.3\n0.2\n0.1\nOne-Day\nMoving Avg.\nLinear\nExponential\n0.9\n0.8\n0.7\n0.6\n0.5\nOutbreak Size\nOne-Day\nMoving Avg.\nLinear\nExponential\nO\nb\nk\n\nSi"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture8.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/982efb8ca57f8526fe18a2b8fcdf1b31_lecture8.pdf",
      "content": "Medical Data,\nStandard Vocabularies,\nCommunication Standards\n6.872/HST950\nLecture #8\n(with some material from Chris Cimino)\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PHD\n\nRecall Children's Clinicians Workstation Database\n\nDemographics\n\nProblems\n\nAllergies\n\nMedications\nImmunizations\n\nLab Data\n\nClinical Measurements\nGrowth Charts\n\nVisit History\n\nReports and Letters\n\nVocabularies and Terminology\n\nWhy?\nSurrogate for messy reality\nUses\n\nHow?\nFlat list\nTaxonomy\nHeterarchy\nCombinatorial Language\nDerivation rules\nInference\nknowledge representation\n\nDefinitions\n\nWord a set of characters including punctuation\ndelimited by white space.\n\nTerm one or more words used as a unit.\n\nConcept an idea, action, or thing.\n\nSynonym two terms for the same concept.\n\nVocabulary Uses\n\nIndexing Finding what you want\n\nCataloging Putting away what you have\nE.g., WHO, DRGs\n\nKnowledge Representation\nRepresenting the facts\nBlurring the facts\nCreating new shades of meaning\n\nDescribe a term for aLaboratory Test.\n\nWhere was it done?\n\nHow was it done?\n\nUnder what conditions was it done?\n\nHow many minutes after eating carbohydrate\nwas it measured?\n\nDescribe a Vocabulary for a Gene\n\nWhose gene?\n\nGene fragment?\n\nOpen Reading Frame?\n\nPromoter + all exons and introns\n\nPromoter + all exons + all introns + other binding\nsites affecting function?\n\nFinal/draft/species/SNP/Alternative splicing?\n\nKnowledge vs. Language\n\nGet two or more people to enumerate terms to\ndescribe the same set.\nDo any terms match exactly?\nDo terms differ by word order?\nDo terms differ by word suffix or prefix?\nAre there terms that some people think are synonyms that\nother people think are not?\n\nHistory of 3 Vocabularies\n\nMeSH Index\n\nICD Precoodinated\n\nSNOMED Post-coordinated\n\nHistory\n\nThe modern history of medical controlled vocabularies\nbegins with the U.S. Army General Surgeon who petitioned\nCongress to fund a medical library.\n\nThe position eventually became The US Surgeon\nGeneral and the library the National Library of Medicine\nhttp://www.nlm.nih.gov/\n\nHistory\n\nLibrary collection was indexed with Index Medicus\n(created by NLM) which is published in book form.\n\nIndex Medicus was extended to index medical\nliterature articles.\n\nIndex Medicus was extended further to provide on-\nline indexing (1960). This became the Medical Subject\nHeadings (MeSH).\n\nMeSH\n\nPurpose is to index the medical literature.\n\nContent of MeSH is driven by publications.\n\nWho ¡°owns¡± MeSH?\n\nWhat impact do vocabulary changes have?\n\nMeSH Structure\nhttp://www.nlm.nih.gov/mesh/\n\nMeSH is organized into a series of\ntrees (e.g. physical findings, diseases, chemicals)\n\nA MeSH main heading is a concept. (e.g.\nNeurologic Disease, Epilepsy)\n\nMain Heading (MH) is often called a term.\nTry to avoid this.\n\nMeSH Structure\n\nEach MH has a unique identifier.\n\nEach MH may have multiple synonyms.\n\nEach MH may have multiple locations in multiple\ntrees. Each of these contexts has a unique tree address.\nThe concept of context is synonymous with multiple\ninheritance.\n\nMeSH Structure\n\nThere is a small set of subheadings (50) that modify\nMH based on tree address. (e.g. diagnosis applies to MH in\nthe Disease tree but not to the Chemical tree).\n\nThere is a small set of tag terms (15) which exist\nunrelated to the rest of MeSH. (e.g., Review Article, Human,\nAnimal)\n\nMeSH Structure\n\nEvery article is indexed with tag terms.\n\nEvery article is indexed with MH terms for focus (main\nindex term) and mention (minor index term).\n\nEvery index term is checked for subheadings.\n\nThis is all done by trained reviewers.\n\nThe MeSH Vocabulary is revised annually.\n\nInternational Classification of\nDisease (ICD)\n\nAny agency that dispenses funds for health care needs a way\nto assess needs and effectiveness.\n\nThe United Nations World Health Organization (WHO) funds\nhealth care prevention projects world wide and gathers statistics for\nmember nations.\n\nWho owns ICD?\n\nWhat impact will changes have?\n\nICD Structure\n\nICD is divided into categories based on a 5-digit\nnumeric code. (e.g., 133.21)\n\nUsually round numbers are more general\nconcepts (e.g., 100 subsumes 130 which subsumes 133)\n\nThe fourth and fifth digit is called a modifier but it\nisn't really.\n\nICD Structure\n\nThe code is both the concept and the unique identifier.\nMultiple terms are linked to the same code.\n\nEvery patient is coded with as many terms as possible.\n\nTerms should be the most specific one to describe a\nparticular problem.\n\nICD Structure\n\nCoding scheme limits the size of the vocabulary.\n\nObsolete codes must be reused.\n\nBase ten results in limited flexibility and the need for\nother, NOS, and NOC terms.\n\nICD Structure\n\nLack of multiple contexts or multiple inheritance\nresults in duplicate terms.\n\nLack of overall organization results inambiguous\nterms.\n\nICD Structure\n\nICD has been adopted by most insurance companies as a\nmethod for controlling billing and payment.\n\nEconomic forces drive how the vocabulary is used which\ndrives how ICD is modified which drives changes in reimbursement\nwhich drives how the vocabulary is used\n\nWho owns ICD?\n\nThe Vocabulary is revised sporadically.\n\nSNOMED Structure\n\nDeveloped by the American College of Pathologists to\novercome the faults of ICD.\n\nReally describes 6 [now 12] different vocabularies,\none for each axis of a concept (e.g., anatomy, environment,\nhistory).\n\nEvery concept is built up from a term from each axis\n(e.g., surgery of blue nevus of left forearm).\n\nSNOMED Structure\n\nThere is some overlap of the axes so it is possible to form\ntwo different versions for the same concept (e.g., blue nevus nevus\ncolored blue).\n\nThere are few rules for how to combine axesterms so it is\npossible to form valid nonsense terms (e.g., nevus of left\nesophagus).\n\nWho owns SNOMED?\n\nSNOMED Axes\n\nD Diseases\n\nC\n\nDrugs\n\nF Function\n\nL Living Organisms\n\nX Manufacturers\n\nG Modifiers\n\nM Morphology\n\nJ Occupations\n\nA Physical Agents\n\nP Procedures\n\nS Social Context\n\nT -- Topography\n\nPostcoordination\n\nD5-46210 Acute Appendicitis\n\nG-A231 Acute, D5-46100 Appendicitis NOS\n\nG-A231 Acute, M-40000 Inflammation, T-59200\nAppendix\n\nM-41000 Acute Inflammation, T-59200Appendix\n\nT-59200 Appendix, M-41000 Acute Inflammation\n\nHistory\n\nFor everyone who wants to own a medical vocabulary, there\nis a set of terms which are likely to overlap but be inconsistent with\nevery other vocabulary.\n\nRead, CPT, COSTART, ChemAbstracts,\n\nIn theory they are all describing agreed upon concepts. A\nsingle standard vocabulary would improve the automated flow of\nmedical information.\n\nIdeal Vocabulary\n?\n\nIdeal Vocabulary\n\nBoundary\n\nOrganization\n\nCompleteness\n\nAbsence of ambiguity\n\nGrowth\n\nAging\n\nIdeal Vocabulary Definitions\n\nString a unique sequence of characters. The same set of\ncharacters may represent different concepts.\n\nLexical variants synonyms with minor differences. Word\norder, capitalization, and punctuation are usually included. Suffixes\n(plural) and prefixes may be included.\n\nOne man's lexical variant is another's synonym.\n\nIdeal Vocabulary Definitions\n\nRelated terms distinct terms whose concepts\noverlap in some way. The most used relations are broader\nand narrower (e.g., Neurologic Disease includes but is\nbroader than Epilepsy.)\n\nOne man' s related term is another's synonym.\n\nIdeal Vocabulary Definitions\n\nControlled versus free text\nFreedom of expression\nAutomatic indexing accuracy\n\nAtomic versus enumerated (Pre vs Post)\nHandle the unexpected\nPredict what to expect\n\nDefinitions\nFree text versus semantic\n\nUnified Medical Language\n\nThe Unified Medical Language System (UMLS)\nstarted as an NLM collaborative program with 7 centers\naround the country.\n\nProceeded in 3 3 year phases.\nExplore ideas (1986)\nOne winner selected and developed (1988)\nUsage Testing (1991)\n\nUMLS Structure\n\nThree components\nMetathesaurus (META)\nSemantic Network\nInformation Sources Map (ISM)\n\nRecently dropped\nSpecialist Lexicon\n\nRecently added\n\nMETA Structure\n\nNOT a controlled vocabulary.\n\nDatabase of information about other controlled vocabularies.\n\nContains sufficient info to recreate most of the component\nvocabularies. (Who owns META? Who owns the components?)\n\nBasic unit is the concept. A concept is linked to multiple\nstrings from multiple vocabularies.\n\nMETA - Structure\n\nEach concept-string pair is either a preferred term,\nsynonym, or lexical variant.\n\nThe same string may be linked to multiple concepts\nbut a term, synonym, or lexical variant will only link to one\nconcept each.\n\nOther links exist based solely on the existence of\nthose links in a source vocabulary."
    },
    {
      "category": "Lecture Notes",
      "title": "lecture9.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/00dc1598e1ea6253da55d3d397b53a1a_lecture9.pdf",
      "content": "Patient Data Privacy in\nElectronic Records\n6.872/HST950\nLecture #9\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PHD\n\nProtecting\nPrivacy\n3⁄4 Right to be let alone; e.g.:\n3⁄4 snooping on Dan Quayle by J. Rothfeder\n3⁄4 outing of Arthur Ashe (HIV), Henry Hyde (adultery)\n3⁄4 celebrity medical problems (Tammy Wynette, Nicole Simpson)\n3⁄4 applies mostly to known individuals\n\nPrivacy in obscurity\n3⁄4 Right to remain unknown\n3⁄4 Correlation among pervasive databases:\n3⁄4\ncensus\n3⁄4\nmarketing\n3⁄4\nhealth\nConfidentiality\n3⁄4 Use and sharing of information by multiple users at many institutions\n3⁄4 Should be controlled by coherent policy\n3⁄4 Enforced by appropriate technology\n3⁄4 E.g., who may use results of your life insurance physical exam, for what purposes?\n\nNational Academy of Sciences\nStudy, 1997\nCharge to the committee:\n3⁄4 Observe and assess technical and non-technical mechanisms for protecting privacy and maintaining security\nin health care information systems.\n3⁄4 Identify other methods worthy of testing in health care settings.\n3⁄4 Outline promising areas for further research.\nCommittee Members\n\nSite Visits\nInstitutions Visited\n3⁄4 Large, urban hospital\n3⁄4 Integrated delivery system\n3⁄4 Affiliated health care system\n3⁄4 Community Health Info Network (CHIN)\n3⁄4 State health system\n3⁄4 Insurer\nIssues Discussed\n3⁄4 Problems encountered\n3⁄4 Security and confidentiality policies\n3⁄4 Security mechanisms\n3⁄4 Effectiveness of mechanisms\n3⁄4 Education and training\n3⁄4 Disciplinary sanctions\n3⁄4 Needs to promote better security\nTrade-offs among IT characteristics\n3⁄4 Critical to improve the quality and reduce the costs of health care.\n3⁄4 Privacy and security must be resolved if patients are to share sensitive health information with care\nproviders.\n3⁄4 Protect patient privacy while ensuring that providers have legitimate access to information for\npurposes of care.\n\nPrivacy and Security Concerns Addressed in the\nReport\n3⁄4 Inappropriate releases of information from individual organizations\n3⁄4 authorized users leaking information\n3⁄4 unauthorized users breaking into systems to retrieve or alter information, or to\nrender systems dysfunctional\n3⁄4 Systemic flows of information among organizations in health care and related industries\n3⁄4 Technical practice: A variety of practices provide effective protection in an operational\nenvironment and can be implemented with reasonable effort.\n3⁄4 Policy and implementation: Technical mechanisms must be accompanied by\norganizational mechanisms for developing access and release policies, training workers, and\npenalizing violations of policy.\n3⁄4 Incentives: Health care organizations need proper set of incentives to address privacy\nand security concerns.\n\nTwo Approaches to Protect Privacy\n3⁄4 Pre-emptive controls\n3⁄4 Lock & key\n3⁄4 Need to know often need pre-specified understanding of who needs what under\nwhich circumstances -- military model\n3⁄4 Retroactive controls\n3⁄4 Community of trust\n3⁄4 Checking up, not prevention\n3⁄4 Sanctions\nThreat Model\nMust understand what you are protecting against:\n3⁄4 Nature: confidentiality, security\n3⁄4 Source: insider, outsider\n3⁄4 Means: tourist, cracker, NSA\n3⁄4 Information at risk\n3⁄4 Scale\nCredible threats:\n3⁄4 accidental disclosures by insiders\n3⁄4 abuse of record access privileges by insiders\n3⁄4 insider access for profit or spite\n3⁄4 unauthorized physical intruder\n3⁄4 vengeful outsider who seeks to access, damage, disrupt\n\nRecommended Technical Practices for Immediate\nImplementation\n3⁄4 Individual Authentication such as login IDs and passwords to ensure accountability\n3⁄4 Access Controls restrict access to need-to-know\n3⁄4 Audit Trails track all accesses to clinical information\n3⁄4 Protection of remote access points\n3⁄4 Software discipline limit ability to download, install, or copy software\n3⁄4 System assessment evaluate vulnerabilities\n3⁄4 Physical Security & Disaster Recovery\nAuthentication and Access\nEliminate undesirable (horrendous) current practices, e.g.,\n3⁄4 all doctors log in as MD\n3⁄4 nurses, receptionists use doctor's account\n3⁄4 four-digit (or six-digit) id+password\n3⁄4 all data available to everyone\n3⁄4 no record of who creates, alters or destroys data\n3⁄4 poorly-controlled access from networks, remote sites\n\nSystem and Software Discipline\n3⁄4 Standard workstations\n3⁄4 hardware\n3⁄4 approved software\n3⁄4 Control over networking\n3⁄4 Control over software installation/dissemination\n3⁄4 viruses\n3⁄4 network downloads\n3⁄4 floppy drives\n3⁄4 Testing of security features\nPhysical Security\n3⁄4 Lock the computer room (wherever it may be!)\n3⁄4 Backups, recovery procedures\n3⁄4 protect the backup data\n3⁄4 test the recovery procedure\n3⁄4 Erase the disk when de-commissioning the computer\n\nRecommended Organizational Practices for Immediate\nImplementation\n3⁄4 Security and confidentiality policies\n3⁄4 Security and confidentiality committees\n3⁄4 Information security officers\n3⁄4 Education and training programs\n3⁄4 Sanctions\n3⁄4 Improved authorization forms\n3⁄4 Patient access to audit logs\nPolicies and Governance\n3⁄4 Clearly stated policy:\n3⁄4 Responsibility\n3⁄4 Education\n3⁄4 Data access\n3⁄4 Guardianship\n3⁄4 Associating people with their actions (identification,\ncapabilities, temporary access, termination)\n3⁄4 Enforcement\n3⁄4 Testing\n3⁄4Transparency\n3⁄4 Governance:\n3⁄4 Policy-making body\n3⁄4 Security officer\n3⁄4 Buy-in\n3⁄4 CIO\n3⁄4 Human Resources\n3⁄4 Entire community\n3⁄4 Education\n\nEnforcement\n3⁄4 Auditing\n3⁄4 Periodic sampling of access logs\n3⁄4 Users ability to check\n3⁄4 Human Resources (Personnel)\n3⁄4 Emphasize importance\n3⁄4 Explicit criterion of evaluation\n3⁄4 Education and training\n3⁄4 Reprimand, termination for all levels of employees\nTesting\nsine qua non\n3⁄4 Monitoring and awareness\n3⁄4 Review of performance\n3⁄4 Auditing\n3⁄4 Tiger teams\n3⁄4 Published results\n\nRecommended Security Practices for Future Implementation\n3⁄4 Strong authentication:\n3⁄4 single-session passwords,\n3⁄4 encrypted authentication sessions,\n3⁄4 token-based authentication\n3⁄4 Enterprise-wide authentication (single logon)\n3⁄4 Access validation to ensure that retrieved information matches user's access privileges\n3⁄4 Expanded audit trails\n3⁄4 alll internal accesses to information\n3⁄4 global audit trails to trace secondary distribution of data\n3⁄4 Electronic authentication of records\nStronger Incentives Needed\n3⁄4 Strong incentives to use IT, but fewer incentives to address privacy and security issues.\n3⁄4 Existing legislation is inconsistent across states; no strong federal legislation mandating protections [in 1997]\n3⁄4 Sporadic violations of privacy and security have not rallied broad public interest.\n3⁄4 Little guidance for improving privacy and security\n3⁄4 no effective standards to guide attempts to better protect health information.\n3⁄4 few means of sharing information about privacy and security violations, effective ways of protecting health\ninformation\n\nRecommended Elements of Industry Infrastructure for Privacy\n& Security\n3⁄4 Standing committee for developing and updating privacyand security standards.\n3⁄4 examine security mechanisms and help establish rules governing data flows.\n3⁄4 reports directly to Secretary of HHS\n3⁄4 Organization for gathering and sharing information about security threats, incidents, and solutions in\nhealth care.\n3⁄4 similar to the computer emergency response team (CERT) for the Internet\n3⁄4 seed funding from Congress\nSystemic Concerns Regarding Privacy and Security\n3⁄4 Many concerns regarding patient privacy stem from sharing of information among organizations in\nhealth care industry.\n3⁄4 Existing data flows are largely unregulated and often occur without patient consent or knowledge.\n3⁄4 Possible development of a universal patient identifier could exacerbate such concerns.\n\nProposed Means of Addressing Systemic Concerns\nEncourage national debate to determine appropriate balance between patient privacy and organizational\nneeds for information\n3⁄4 Fair information practices (e.g., federal Privacy Act of 1974)\n3⁄4 DHHS should establish program to promote consumer awareness of issues and uses of health information.\n3⁄4 Professional societies should educate members about privacy and security issues\n3⁄4 DHHS should conduct studies to determine extent to which various users need patient identifiable health information\n3⁄4 DHHS should work with the U.S. Office of Consumer Affairs to determine way to give consumers a visible, centralized point of contact\nFair Information Practices (Federal Privacy Act, 1974)\n3⁄4 No secret databases that include personally identified information\n3⁄4 Agencies must publish policies on all databases\n3⁄4 Right to see my information, with ability to correct\n3⁄4 Prevent data collected for one purpose from being used for another\n3⁄4 Agency responsible for reliability and security of data\n3⁄4 Right to sue re: privacy issues (such as an ombudsman).\n\nRecommendation on Patient Identifiers\nAny method used to identify patients or link patient records should:\n1. be accompanied by a policy framework that identifies the kinds of linkages that violate\npatient privacy and that specifies legal sanctions.\n2. facilitate identification of parties that link records.\n3. allow unidirectional linking of information: it should facilitate linking of records based on\ninformation given by patient (such as an identifier), but prevent a patient's identity from\nbeing easily deduced from records or the identifying scheme itself.\nRecommendation for Meeting Future Technological Needs\n3⁄4 establish formal liaisons with industry and government security working groups.\n3⁄4 support research in areas of particular importance to health care, but that might not be otherwise\npursued.\n3⁄4 fund experimental testbeds to explore different means of controlling access in an operational\nenvironment.\n\nRecommendation for Meeting Future Technological Needs\n3⁄4 establish formal liaisons with industry and government security working groups.\n3⁄4 support research in areas of particular importance to health care, but that might not be otherwise\npursued.\n3⁄4 fund experimental testbeds to explore different means of controlling access in an operational\nenvironment.\nFuture Security Technologies of Particular Interest to Health\nCare\n3⁄4 Methods of identifying and linking patient records that protect patient privacy.\n3⁄4 Technologies for enabling patients to receive health care anonymously:¡¡ pseudonyms,\ncryptographically generated aliases, narrative templates, smart cards.\n3⁄4 Audit tools that allow more frequent examination of audit logs to detect inappropriate accesses to\ninformation.\n3⁄4 Tools for rights enforcement and management to control secondary distribution of data\n\nHIPAA Regulations on Individually Identifiable Health\nInformation\nBased on 45 CFR parts 160 & 164 Federal Register Vol. 65, No. 250, pp.\n82462-82829, Dec. 28, 2000\nWhy?\n3⁄4 Part of Administrative Simplification section of HIPAA (Health Insurance Portability and Accountability Act of\n1996 --Kennedy/Kassebaum Bill)\n3⁄4 1/5 of Americans believe personal health information (PHI) has been used inappropriately\n3⁄4 PHI use necessary for improved quality, reduced cost\n3⁄4 existing protections fragmented\n\nHistory of Privacy Provisions\n3⁄4 Congress gave itself until Aug 21, 1999 to enact legislation -- it did not do so\n3⁄4 Backup was that Secretary of HHS was to promulgate rules by Feb 21, 2000 -- this was extended because of 70,000 comments\n3⁄4 Rule promulgated Dec. 2000\n3⁄4 Bush administration has put it on hold, mainly because of cost complaints\n3⁄4 Sec. Thompson agreed to issue the rule, Apr. 2001\n3⁄4 Congress may legislate later, based on experience\n3⁄4 work in progress\nOther simplification issues\n3⁄4 Standards for electronic health care transactions, including detailed data elements\n3⁄4 unique health identifiers\n3⁄4 providers\n3⁄4 patients\n3⁄4 code sets\n3⁄4 security standards\n3⁄4 electronic signatures\n3⁄4 transfer of information among health plans\n3⁄4 Target date: Feb 21, 1998\n\nSanctions\n3⁄4 Civil penalties for violations of standards: $100/person/violation, max $25,000/violation/year\n3⁄4 Knowing violations of health identifier or deliberate disclosure:\n3⁄4 $50,000 + 1 year jail\n3⁄4 $100,000 + 5 years jail if under false pretenses\n3⁄4 $250,000 + 10 years jail if with intent to sell, transfer or use, for commercial advantage, personal gain, or malicious harm\nPrinciples\n3⁄4 Allow smooth flow of PHI for treatment, payment, related operations, public interest\n3⁄4 Prohibit flow of PHI for other purposes, without consent of subject\n3⁄4 Fair information practices\n3⁄4 Allow subject to access PHI (later, excludes psych notes)\n3⁄4 Allow subject to have records amended for errors or incompleteness\n3⁄4 Allow subject to know who else uses PHI\n3⁄4 Require persons who hold PHI to safeguard it\n3⁄4 accountable for own use and disclosure\n3⁄4 legal recourse\n3⁄4 Minimal Necessary Use and Disclosure\n3⁄4 Few limits on use for treatment, more for other functions\n\nLimitations of HIPAA\n3⁄4 Responsibilities cannot follow data; therefore\n3⁄4 Recommendation applies to\n3⁄4 Health Plans\n3⁄4 Health Care Clearinghouses\n3⁄4 Provides who transmit PHI electronically\n3⁄4 Does not apply to others who hold/process data\n3⁄4 contractors, third-party administrators, researchers, public health officials, life\ninsurance issuers, employers, marketing firms, ...\n3⁄4 ...but: Covered Entities required to contract with business associates to pass on\nresponsibilities, along with identifies health data used \"in behalf of\" a covered entity\n3⁄4 Does not apply to paper records\n3⁄4 ...but: If the information was ever in electronic form, reponsibility is \"sticky\"\n3⁄4 No private right of action\nConsent (before HIPAA)\n3⁄4 Most patients believe their private medical data may not be divulged without\nspecific consent\n3⁄4 But, consent may effectively be forced\n3⁄4 But, many exemptions exist:\n3⁄4 For treatment and related purposes (e.g, utilization review)\n3⁄4 For obtaining payment\n3⁄4 Emergency care, health depts., law enforcement, coroners, business operations, oversight, research\n\nWhen is a nod a nod?\n3⁄4 Agreement: informal, perhaps implied, e.g., to let a consultant see clinical notes, let\nhospital include patient in a directory\n3⁄4 Consent: written, but often generic, e.g., on admission to hospital. This covers most\nhealth care operations\n3⁄4 Authorization: written, specific to the case. For psychiatric notes and all data uses other\nthan health care operations. E.g., research.\n3⁄4 Patient may negotiate Restrictions on disclosure, e.g., to particular staff, family\nmembers, etc.\nUses of data by Covered Entities\n3⁄4 For treatment, payment, health care operations without patient authorization\n3⁄4 For public health, research, health oversight, law enforcement, use by coroners, mandatory\nState reporting, search warrants without patient authorization\n3⁄4 Must allow access to the subject of the records\n3⁄4 Must get individual consent for any other uses\nSubstitute regulatory protections for pro forma authorizations often used today.\n\nHealth Care Operations\n3⁄4 Treatment\n3⁄4 Payment\n3⁄4 Quality assessment and improvement activities\n3⁄4 Review competence of professionals, organizations; conduct training; accreditation\n3⁄4 Insurance rating concerning existing coverage\n3⁄4 Auditing\n3⁄4 Legal proceedings\n3⁄4Added: Business planning and development, management, general administration, fundraising, internal\nmarketing\nNOT Health Care Operations\n3⁄4 Marketing\n3⁄4 Sale, rent or barter of information\n3⁄4 Use in parts of organization not health-related\n3⁄4 Rate setting prior to subject's enrollment\n3⁄4 Employment determinations\n3⁄4 Fund raising\n3⁄4 Research to obtain generalizable knowledge\n\nIdentifiable\nSweeney's Cambridge\n3⁄4 1997 Cambridge, MA voting list on 54,805 voters\n3⁄4 Name, address, ZIP, birth date, gender, ¡u\n3⁄4 Combinations that uniquely identify:\n3⁄4 Birth date (mm/dd/yy)¡¡ 12%\n3⁄4 BD + gender¡¡¡¡ 29%\n3⁄4 BD + 5-digit ZIP¡¡¡¡ 69%\n3⁄4 BD + 9-digit ZIP¡¡¡¡ 97%\n3⁄4 Unique individuals\n3⁄4 Kid in a retirement community\n3⁄4 Black woman resident in Provincetown\n\nProblem of other information\n3⁄4 Governor Weld's data found in Mass de-identified dataset\n3⁄4 Dates you visited a health care provider (over a lifetime) are probably unique\n3⁄4 Can be used to re-identify you if someone has both de-identified data and other data\nthat link to identifiers\nDanger of Re-identification\nProtection via generalization\n\nComputational Disclosure Control\n3⁄4 Make sure data cannot be traced back to a set of size <n\n3⁄4 Generalization\n3⁄4 Suppression of unique combinations\n3⁄4 Account for leakage from what has been suppressed; e.g., back-calculating from aggregate\nstatistics\n3⁄4 How to estimate external information?\n3⁄4 Every release becomes more external info.\nMethods of Generalization/Suppression\n3⁄4 Underlying problem (find minimal generalization/suppression to achieve a level\nof anonymity) is NP-hard (Vinterbo)\n3⁄4 Mainly heuristic search over space of possible generalizations/suppressions\n3⁄4 Scrub\n3⁄4 Datafly\n3⁄4 μ-Argus (Netherlands)\n3⁄4 k-Similar\n\nSources"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture10.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/e226294b826f363262809d0b261a425a_lecture10.pdf",
      "content": "Decreasing\nVariability in\nHealth Care\nHST950\nDecision Systems Group, Brigham\n& Women's Hospital\nHarvard Medical School\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\nIsaac Kohane, MD, PhD\nLucila Ohno-Machado, MD, PhD\n\nVariability in Health Care\nDecision support systems\nIntegration of guidelines into practice\nDecrease variability, homogenize\nKnowledge discovery in biomedical data\nIncrease variability, customize\nSupport for clinical trials\n\nGuidelines and clinical\nprotocols\nWhat are they?\nWhy computerize?\nKnowledge representation\nApplication in breast cancer protocol\neligibility with uncertain information\n\nDecreasing practice variation\nStudies demonstrate huge variability in\npractices\n\nWhat are clinical guidelines?\nInstitute of Medicine definition\nsystematically developed statements to assist\npractitioner and patient decisions about\nappropriate healthcare for specific clinical\ncircumstances\nA recommended strategy for management\nof a medical problem in order to\nReduce inappropriate use of resources $$$$$$\nReduce practice variation\nImprove outcomes\n\nConventional publication\nGuidelines can be developed and\npublished by\nA medical institution, to be used locally\nNational and international organizations,\nused by many medical institutions\nConventional publication\nIn journals and textbooks\nBooklets or guideline summaries\nCompilations of guidelines for reference\n\nTypes of guidelines\nRisk assessment\nChronic disease management\nDiabetes, asthma, hypertension\nScreening\nDiagnosis and workup\nProtocol-based care (clinical trials)\n\nClinical Trial Protocols\nGoal is to intervene in a random part of the eligible\npatient and leave the other part with current standard of\ncare\nCarefully selected population, with few comorbidities\n(other diseases)\nHomogeneous care in each arm to investigate\nstatistical significance of differences\nSelect patients\nRandomize into\n- intervention arm\n- control arm\nCompare outcomes\n\nWhere do the recommendations\ncome from?\nPanel of experts (most common)\nHard to get experts to agree on anything\nDecision analysis models (least common)\nDifficult to obtain probabilities and utilities\nObservational studies\nSmall numbers may lead to wrong recommendations\nClinical trials\nControlled populations, strict eligibility criteria\nA major problem is to match the patient in front of you\nwith carefully selected patient population used in the\ntrials\n\nWays of helping implement\nguidelines/clinical trials\nHelp authors to create guidelines that\nmake sense (verify the \"logic\")\nEligibility determination for a variety\nof competing guidelines/protocols\nAssistance in implementing the\nprescribed actions\n\nEligibility determination\nThere are hundreds of guidelines and\nclinical trials out there\nAutomated eligibility could warn\nproviders of guidelines/protocols\nthat\nmatch the patient\nMAJOR problem: uncertainty in patient\nstatus (tests to be done, info not\navailable)\n\nIncrease versus decrease\nvariability\nRecommendations are based on\n\"average\" or \"mode\" patient\n\"Mode\" patient may not exist\nIf more info is available, why not\nuse it?\n\nExample\nConsent forms for interventional\ncardiology procedures:\nAcknowledgement that risk of death in\nhospital is about 2%\nWho is at 2% risk?\n\nWhy people want to computerize\nguidelines\nProvide automatic decision support\nApplied to individual patients\nDuring the clinical encounter\nAmbiguities in guidelines may be reduced\nSoftware tools and guideline models can promote\nspecifying logic precisely\nCan integrate guidelines into workflow\nPatient-specific guideline knowledge available at\npoint of care\n$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n\nComputer-interpretable\nguidelines\nInteractive guidelines\nEnter patient parameters to traverse\nguideline\nGuidelines embedded in EPR Systems\nAutomated reminders/alerts\nDecision support and task management\n\n... Why people want to\ncomputerize guidelines\nCan be used for quality assurance\nGuideline defines gold-standard of care\nPerform retrospective analysis to test if\npatients were treated appropriately\nAllows for interactive visualization of\nguideline logic\ne.g., allows one to focus on relevant\nsections of flowchart\n$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n\nWhy share guidelines?\nProvide consistency in guideline\ninterpretation\nReduce cost of guideline development\nMinimize misinterpretations and errors\nthrough the process of public review\n\nChallenges in sharing guidelines\nLocal adaptation of guidelines\nMust allow care sites flexibility in\nmodifying guidelines for\nAvailability of resources and expertise\nLocal workflow issues\nPractice preferences\nDifferences in patient population\n\nPatient and Provider Preferences\nWho cares?\nWho elicits preferences for a particular\npatient?\nHow does this get taken into account?\n\nPatient and Clinician Vocabulary: How\nDifferent Are They?\n\n...Challenges in sharing\nguidelines\nIntegration with information systems\nMatch patient data in EPR to terms in\nguideline\nMatch recommendations in guideline to\nactions in order entry system\n\nGuideline models\nGuideline models make explicit\nKnowledge concepts contained in a\nguideline\nStructure of the concepts and\nrelationships among them\nScope of the model\nTypes of guidelines, e.g. alerts vs. multi-\nencounter guidelines\nLevel of detail, e.g. structured or text\nspecification\n\nModels for guidelines and rules\nIndividual decision rules (single\nstep)\nArden Syntax\nMulti-step guidelines, modeled as\nsets of guideline tasks that are\nconnected in a graph\nnested\n\nArden Medical Logic Modules\nFormat for representation and sharing\nof single medical decision\nEach medical decision (rule) is called\na medical logic module (MLM)\nSuitable for alerts and reminders\nA guideline may be represented by a\nchained set of MLMs\n\n...Arden MLM\nSimplified example\ndata:\npotassium_storage := event {'1730'};\npotassium:= read last { '32471'};\nevoke: potassium_storage (to EPR)\nlogic: potassium > 5 mmol/L\naction: write \"Potassium is significantly\nelevated\";\n\n...Arden Syntax\nStandard published by ANSI\nPart of HL7 activity\nSupported by many commercially-\navailable hospital information\nsystems\n\n...Models for multi-step\nguidelines\nMulti-step guidelines, modeled as\nhierarchical sets of nested guideline\ntasks\nEON\nPRODIGY\nPROforma\nAsbru\nGLIF\nThis is an incomplete list!\n\nEON\nDeveloped by Tu and Musen (Stanford)\nExtensible collection of models where\nguideline developers select modeling\nsolutions from a\ntoolkit\nConcept model, patient information model,\nguideline model\ne.g., multiple abstraction methods\nTemporal query based on formal temporal\nmodel\nTemporal abstraction use specifications of\nabstractions in knowledge base\n\nPRODIGY\nDeveloped by Ian Purves, Peter Johnson,\nand colleagues, at the U of Newcastle, UK\nSimple and understandable model\nFew modeling primitives\nComplexity management techniques\nEases the encoding process\nSufficiently expressive to represent chronic\ndisease management GLs\n\nProforma\nDeveloped by John Fox et al., (ICRF,\nUK)\nEmphasis on soundness, safety, and\nverifiability\nPROforma is a formal specification\nlanguage, based on a logic language\nGuidelines are constraint satisfaction\ngraphs\nNodes represent guideline tasks\n\nAsbru\nDeveloped by Shahar, Miksch and\ncolleagues\nEmphasis on guideline intentions, not only\naction prescriptions\ne.g., maintain a certain blood pressure\nExpressive language for representing time-\noriented actions, conditions, and intentions in\na uniform fashion\nGuidelines are modeled as plans that can\nbe hierarchically decomposed into\n(sub)plans or actions\n\nGuideLine Interchange Format:\nVersion 3\nEmphasis on sharing guidelines across\ndifferent institutions and software\napplications\nA consensus-based multi-institutional\nprocess (InterMed: a collaboration of\nStanford, Harvard, Columbia)\nAn open process - the product is not\nproprietary\nSupports the use of vocabularies and\nmedical knowledge bases\n\n... GLIF3\nObject-oriented representation model for\nguidelines\nGuideline\nname\nauthor\nGuideline Step\nHas parts\nHas specializations\nAction Step\nDecision Step\nBranch Step\nSynchronization Step\nPatient State Step\n...\n\n... GLIF3\nAction steps: recommendations for\nclinical actions to be performed\ne.g., Prescribe aspirin\nDecision steps: decision criteria for\nconditional flowchart traversal\ne.g., if patient has pain then ...\nAction and decision steps can be\nnested\nBranch and synchronization steps allow\nconcurrency\n\n... GLIF3\nPatient-state step\ncharacterize patient's clinical state\nserve as entry points into the guideline\nSteps refer to patient data items\n(age, cough)\nExpression language: derived from\nArden Syntax logic grammar\nMedical domain ontology\n\n...GLIF3\nMedical ontology\nConcept model\nconcepts defined by id from controlled\nvocabulary\nconcept relationships (e.g.,\ncontradindication, is-a)\nPatient information model\nDefault model is based on HL7 RIM\nUser-defined concepts and data model\nclasses\n\nWorkshop: Towards a Sharable\nGuideline Representation\nHosted by InterMed in March 2000 in\nBoston\n80 attendees from 8 countries\nRepresentation from\nGovernment\nProfessional specialty organizations\nInsurers\nHealth care provider organizations\nAcademic medical informatics\nIndustry\n\nPurpose of the meeting\nTo recognize the need for a standard\nTo identify the the functional\nrequirements for sharing guidelines\nTo establish a process for the\ndevelopment of a robust\nrepresentation model\nTo establish a process to foster\nsharing\n\nLife cycle of a computer-\ninterpretable guideline\nUSE\nUse and\nmaintenance\nPerformance\nanalysis\nLife cycle of a\ncomputer-\ninterpretable\nguideline\nIMPLEMENTATION\nDEVELOPMENT\nAuthoring\nEncoding\nValidation\nDissemination\nLocal adaptation and\nimplementation\nTesting\n\nTake home message\nIt is not all about the technical\ndifficulty...\nIt is about whether people believe in\nguidelines\nIt is about whether how a guideline\nfits a particular case\nIt is about whether it makes a\ndifference for this particular case"
    },
    {
      "category": "Lecture Notes",
      "title": "Lecture11.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/d6f1dca12e947e45fdac96c2f85071bb_Lecture11.pdf",
      "content": "Decreasing\nVariability in\nHealth Care\nHST950\nDecision Systems Group, Brigham\n& Women's Hospital\nHarvard Medical School\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\nIsaac Kohane, MD, PhD\nLucila Ohno-Machado, MD, PhD\n\nVariability in Health Care\nDecision support systems\nIntegration of guidelines into practice\nDecrease variability, homogenize\nKnowledge discovery in biomedical data\nIncrease variability, customize\nSupport for clinical trials\n\nGuidelines and clinical\nprotocols\nWhat are they?\nWhy computerize?\nKnowledge representation\nApplication in breast cancer protocol\neligibility with uncertain information\n\nDecreasing practice variation\nStudies demonstrate huge variability in\npractices\n\nWhat are clinical guidelines?\nInstitute of Medicine definition\nsystematically developed statements to assist\npractitioner and patient decisions about\nappropriate healthcare for specific clinical\ncircumstances\nA recommended strategy for management\nof a medical problem in order to\nReduce inappropriate use of resources $$$$$$\nReduce practice variation\nImprove outcomes\n\nConventional publication\nGuidelines can be developed and\npublished by\nA medical institution, to be used locally\nNational and international organizations,\nused by many medical institutions\nConventional publication\nIn journals and textbooks\nBooklets or guideline summaries\nCompilations of guidelines for reference\n\nTypes of guidelines\nRisk assessment\nChronic disease management\nDiabetes, asthma, hypertension\nScreening\nDiagnosis and workup\nProtocol-based care (clinical trials)\n\nClinical Trial Protocols\nGoal is to intervene in a random part of the eligible\npatient and leave the other part with current standard of\ncare\nCarefully selected population, with few comorbidities\n(other diseases)\nHomogeneous care in each arm to investigate\nstatistical significance of differences\nSelect patients\nRandomize into\n- intervention arm\n- control arm\nCompare outcomes\n\nWhere do the recommendations\ncome from?\nPanel of experts (most common)\nHard to get experts to agree on anything\nDecision analysis models (least common)\nDifficult to obtain probabilities and utilities\nObservational studies\nSmall numbers may lead to wrong recommendations\nClinical trials\nControlled populations, strict eligibility criteria\nA major problem is to match the patient in front of you\nwith carefully selected patient population used in the\ntrials\n\nWays of helping implement\nguidelines/clinical trials\nHelp authors to create guidelines that\nmake sense (verify the \"logic\")\nEligibility determination for a variety\nof competing guidelines/protocols\nAssistance in implementing the\nprescribed actions\n\nEligibility determination\nThere are hundreds of guidelines and\nclinical trials out there\nAutomated eligibility could warn\nproviders of guidelines/protocols\nthat\nmatch the patient\nMAJOR problem: uncertainty in patient\nstatus (tests to be done, info not\navailable)\n\nIncrease versus decrease\nvariability\nRecommendations are based on\n\"average\" or \"mode\" patient\n\"Mode\" patient may not exist\nIf more info is available, why not\nuse it?\n\nExample\nConsent forms for interventional\ncardiology procedures:\nAcknowledgement that risk of death in\nhospital is about 2%\nWho is at 2% risk?\n\nWhy people want to computerize\nguidelines\nProvide automatic decision support\nApplied to individual patients\nDuring the clinical encounter\nAmbiguities in guidelines may be reduced\nSoftware tools and guideline models can promote\nspecifying logic precisely\nCan integrate guidelines into workflow\nPatient-specific guideline knowledge available at\npoint of care\n$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n\nComputer-interpretable\nguidelines\nInteractive guidelines\nEnter patient parameters to traverse\nguideline\nGuidelines embedded in EPR Systems\nAutomated reminders/alerts\nDecision support and task management\n\n... Why people want to\ncomputerize guidelines\nCan be used for quality assurance\nGuideline defines gold-standard of care\nPerform retrospective analysis to test if\npatients were treated appropriately\nAllows for interactive visualization of\nguideline logic\ne.g., allows one to focus on relevant\nsections of flowchart\n$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$\n\nWhy share guidelines?\nProvide consistency in guideline\ninterpretation\nReduce cost of guideline development\nMinimize misinterpretations and errors\nthrough the process of public review\n\nChallenges in sharing guidelines\nLocal adaptation of guidelines\nMust allow care sites flexibility in\nmodifying guidelines for\nAvailability of resources and expertise\nLocal workflow issues\nPractice preferences\nDifferences in patient population\n\nPatient and Provider Preferences\nWho cares?\nWho elicits preferences for a particular\npatient?\nHow does this get taken into account?\n\nPatient and Clinician Vocabulary: How\nDifferent Are They?\n\n...Challenges in sharing\nguidelines\nIntegration with information systems\nMatch patient data in EPR to terms in\nguideline\nMatch recommendations in guideline to\nactions in order entry system\n\nGuideline models\nGuideline models make explicit\nKnowledge concepts contained in a\nguideline\nStructure of the concepts and\nrelationships among them\nScope of the model\nTypes of guidelines, e.g. alerts vs. multi-\nencounter guidelines\nLevel of detail, e.g. structured or text\nspecification\n\nModels for guidelines and rules\nIndividual decision rules (single\nstep)\nArden Syntax\nMulti-step guidelines, modeled as\nsets of guideline tasks that are\nconnected in a graph\nnested\n\nArden Medical Logic Modules\nFormat for representation and sharing\nof single medical decision\nEach medical decision (rule) is called\na medical logic module (MLM)\nSuitable for alerts and reminders\nA guideline may be represented by a\nchained set of MLMs\n\n...Arden MLM\nSimplified example\ndata:\npotassium_storage := event {'1730'};\npotassium:= read last { '32471'};\nevoke: potassium_storage (to EPR)\nlogic: potassium > 5 mmol/L\naction: write \"Potassium is significantly\nelevated\";\n\n...Arden Syntax\nStandard published by ANSI\nPart of HL7 activity\nSupported by many commercially-\navailable hospital information\nsystems\n\n...Models for multi-step\nguidelines\nMulti-step guidelines, modeled as\nhierarchical sets of nested guideline\ntasks\nEON\nPRODIGY\nPROforma\nAsbru\nGLIF\nThis is an incomplete list!\n\nEON\nDeveloped by Tu and Musen (Stanford)\nExtensible collection of models where\nguideline developers select modeling\nsolutions from a\ntoolkit\nConcept model, patient information model,\nguideline model\ne.g., multiple abstraction methods\nTemporal query based on formal temporal\nmodel\nTemporal abstraction use specifications of\nabstractions in knowledge base\n\nPRODIGY\nDeveloped by Ian Purves, Peter Johnson,\nand colleagues, at the U of Newcastle, UK\nSimple and understandable model\nFew modeling primitives\nComplexity management techniques\nEases the encoding process\nSufficiently expressive to represent chronic\ndisease management GLs\n\nProforma\nDeveloped by John Fox et al., (ICRF,\nUK)\nEmphasis on soundness, safety, and\nverifiability\nPROforma is a formal specification\nlanguage, based on a logic language\nGuidelines are constraint satisfaction\ngraphs\nNodes represent guideline tasks\n\nAsbru\nDeveloped by Shahar, Miksch and\ncolleagues\nEmphasis on guideline intentions, not only\naction prescriptions\ne.g., maintain a certain blood pressure\nExpressive language for representing time-\noriented actions, conditions, and intentions in\na uniform fashion\nGuidelines are modeled as plans that can\nbe hierarchically decomposed into\n(sub)plans or actions\n\nGuideLine Interchange Format:\nVersion 3\nEmphasis on sharing guidelines across\ndifferent institutions and software\napplications\nA consensus-based multi-institutional\nprocess (InterMed: a collaboration of\nStanford, Harvard, Columbia)\nAn open process - the product is not\nproprietary\nSupports the use of vocabularies and\nmedical knowledge bases\n\n... GLIF3\nObject-oriented representation model for\nguidelines\nGuideline\nname\nauthor\nGuideline Step\nHas parts\nHas specializations\nAction Step\nDecision Step\nBranch Step\nSynchronization Step\nPatient State Step\n...\n\n... GLIF3\nAction steps: recommendations for\nclinical actions to be performed\ne.g., Prescribe aspirin\nDecision steps: decision criteria for\nconditional flowchart traversal\ne.g., if patient has pain then ...\nAction and decision steps can be\nnested\nBranch and synchronization steps allow\nconcurrency\n\n... GLIF3\nPatient-state step\ncharacterize patient's clinical state\nserve as entry points into the guideline\nSteps refer to patient data items\n(age, cough)\nExpression language: derived from\nArden Syntax logic grammar\nMedical domain ontology\n\n...GLIF3\nMedical ontology\nConcept model\nconcepts defined by id from controlled\nvocabulary\nconcept relationships (e.g.,\ncontradindication, is-a)\nPatient information model\nDefault model is based on HL7 RIM\nUser-defined concepts and data model\nclasses\n\nWorkshop: Towards a Sharable\nGuideline Representation\nHosted by InterMed in March 2000 in\nBoston\n80 attendees from 8 countries\nRepresentation from\nGovernment\nProfessional specialty organizations\nInsurers\nHealth care provider organizations\nAcademic medical informatics\nIndustry\n\nPurpose of the meeting\nTo recognize the need for a standard\nTo identify the the functional\nrequirements for sharing guidelines\nTo establish a process for the\ndevelopment of a robust\nrepresentation model\nTo establish a process to foster\nsharing\n\nLife cycle of a computer-\ninterpretable guideline\nUSE\nUse and\nmaintenance\nPerformance\nanalysis\nLife cycle of a\ncomputer-\ninterpretable\nguideline\nIMPLEMENTATION\nDEVELOPMENT\nAuthoring\nEncoding\nValidation\nDissemination\nLocal adaptation and\nimplementation\nTesting\n\nTake home message\nIt is not all about the technical\ndifficulty...\nIt is about whether people believe in\nguidelines\nIt is about whether how a guideline\nfits a particular case\nIt is about whether it makes a\ndifference for this particular case"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture14.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/915a358844ba21cf61e735cf6fffaa66_lecture14.pdf",
      "content": "Population Genetics in the Post-Genomic Era\nMarco F. Ramoni\nChildren's Hospital Informatics Program\nHarvard Medical School\nHST 950 (2003)\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PhD\nIsaac Kohane, MD, PhD\nLucila Ohno-Machado, MD, PhD\n\nIntroduction\n-On February 12, 2001 the Human Genome Project announces the completion\nof a first draft of the human genome.\n-Among the items on the agenda of the announcement, a statement figures\nprominently:\nA SNP map promises to revolutionize both mapping diseases and tracing\nhuman history.\n-SNP are Single Nucleotide Polymorphisms, subtle variations of the human\ngenome across individuals.\n-You can take this sentence as the announcement of a new era for population\ngenetics.\n\nOutline\nBackground\n80s revolution and HGP\nGenetic Polymorphisms\nTheir nature\nTypes of polymorphisms\nFoundations\nTerminology\nHardy Weinberg Law\nTypes of inheritance\nComplex Traits\nDefinition\nFactors of Complexity\nStudy and Experiment Design\nCase Control Studies\nPedigree Studies\nAnalysis Methods\nAssociation Studies\nLinkage Studies\nAllele-sharing Studies\nQTL Mapping\nThe New Ways\nHaplotypes\nHapMap\nhtSNPs\n\nBackground\nIntuition: We can find the genetic bases of observable characters (like diseases)\nwithout knowing how the actual coding works.\nOrigins: Sturtevant (1913) finds traits-causing genes.\nEarly History: Genetic maps of plants and insects.\nOutcast: Ernst Mayr called it ¡°Beans bag genetics¡±.\nReasons: No markers to identify coding regions.\nMarkers: Botstein (1977) showed that naturally occurring DNA already contains\nmarkers identifying regions of the genome: polymorphisms.\n\nCentral Dogma of Molecular Biology\nDNA\nRNA\nMRNA\nProteins\nTraits\nDiseases\nPhysiology\nMetabolism\nDrug Resistance\n\nThe 80s Revolution and the HGP\n-The intuition that polymorphisms could be used as markers sparkled the revolution.\n-Mendelian (single gene) diseases:\nAutosomal dominant (Huntington).\nAutosomal recessive (C Fibrosis).\nX-linked dominant (Rett).\nX-linked recessive (Lesch-Nyhan).\n-Today, over 400 single-gene diseases have been identified.\n-This is the promise of the HGP.\n\nTerminology\nAllele: A sequence of DNA bases.\nLocus: Physical location of an allele on a chromosome.\nLinkage: Proximity of two alleles on a chromosome.\nMarker: An allele of known position on a chromosome.\nDistance: Number of base-pairs between two alleles.\ncentiMorgan: Probabilistic distance of two alleles.\nPhenotype: An outward, observable character (trait).\nGenotype: The internally coded, inheritable information.\nPenetrance: No. with phenotype / No. with allele.\n\nDistances\n-Physical distances between alleles are base-pairs.\nBut the recombination frequency is not constant.\n-Segregation (Mendel's first law): Allele pairs separate during gamete formation and randomly reform pairs.\n-A useful measure of distance is based on the probability of recombination: the Morgan.\n-A distance of 1 centiMorgan (cM) between two loci means that they have 1% chances of being separated by\nrecombination.\n-A genetic distance of 1 cM is roughly equal to a physical distance of 1 million base pairs (1Mb).\n\nMore Terminology\nPhysical maps: Maps in base-pairs.\nHuman autosomal physical map: 3000Mb (bases).\nLinkage maps: Maps in centiMorgan.\nHuman Male Map Length: 2851cM.\nHuman Female Map Length: 4296cM.\nCorrespondence between maps:\nMale cM ~ 1.05 Mb; Female cM ~ 0.88Mb.\nCosegregation: Alleles (or traits) transmitted together.\n\nHemophilia, a Sex Linked Recessive\n-Hemophilia is a X-linked recessive disease, that is fatal for women.\n-X-linked means that the allele (DNA code which carries the disease) is on the X-chromosome.\n-A woman (XX) can be carrier or non-carrier: if x=allele with disease, then xX=carrier; xx=dies; XX=non carrier.\n-A male (YX) can be affected or not affected: (xY= affected; XY=not affected).\n\nHemophilia: A Royal Disease\n\nGenetic Markers\nOne of the most celebrated findings of the human genome project is that humans share most DNA.\nStill, there are subtle variations:\nSimple Sequence Repeats (SSR): Stretches of 1 to\n6 nucleotide repeated in tandem.\nMicrosatellite: Short tandem repeat (e.g. GATA) varying in number between individuals.\nSingle nucleotide polymorphism (SNP): Single base variation with at least 1% incidence in population.\n\nSingle Nucleotide Polymorphisms\nVariations of a single base between individuals:\n... ATGCGATCGATACTCGATAACTCCCGA ...\n... ATGCGATCGATACGCGATAACTCCCGA ...\nA SNP must occur in at least 1% of the population.\nSNPs are the most common type of variations.\nDifferently to microsatellites or RTLPs, SNPs may occur in coding regions:\ncSNP: SNP occurring in a coding region.\nrSNP: SNP occurring in a regulatory region.\nsSNP: Coding SNP with no change on amino acid.\n\nEvolutionary Pressure\n-Kreitman (1983) sequenced the first 11 alleles from nature: alcohol dehydrogenase locus in Drosophila.\n-11 coding regions / 14 sites have alternative bases.\n-13 variations are silent: ie do not change amino acid.\n-With a random base change, we have 75% chances of changing the amino acid (i.e. creating a cSNP).\n-Why this disparity?\n-Drosophilae and larvae are found in fermenting fruits.\n-Alcohol dehydrogenase is important in detoxification.\n-A radical change in protein is a killer.\n\nHardy-Weinberg Law\nHardy-Weinberg Law (1908): Dictates the proportion of major (p), minor alleles (q) in equilibrium.\np2 + 2pq + q2 = 1.\nEquilibrium: Hermaphroditic population gets equilibrium in one generation, a sexual population in two.\nExample: How many Caucasian carriers of C. fibrosis?\nAffected Caucasians (q2) = 1/2,500.\nAffected Alleles (q)= 1/50 = 0.02.\nNon Affected Alleles (p) = (1 - 0.02) = 0.98.\nHeterozygous (2pq) = 2(0.98 ¡A 0.02) = 0.04= 1/25.\n\nAssumptions\nRandom mating: Mating independent of allele.\nInbreeding: Mating within pedigree;\nAssociative mating: Selective of alleles (humans).\nInfinite population: Sensible with 6 billions people.\nDrift: Allele distributions depend on individuals offspring.\nLocality: Individuals mate locally;\nSmall populations: Variations vanish or reach 100%.\nMutations contrast drift by introducing variations.\nHeresy: This picture of evolution as equilibrium between drift and mutation does not include selection!\n\nNatural Selection\nExample: p=0.6 and q=0.4.\nFitness (w): AA=Aa=1, aa=0.8. Selection: s = 1-w = 0.2:\nδp =\nSpq2\n(0.2)(0.6)(0.4)2\n0.019\n=\n=\n= 0.02\n1-sq2\n1-(0.2)(0.4)2\n0.968\nSelection: Effect on the 1st generation is A=0.62 a=0.38.\nRate: The rate decreases. Variations do not go away.\n\nDoes it work?\nRace and Sanger (1975) 1279 subjects¡ blood group.\np = p(M) = (2 x 363) + 634 / (2 x 1279) = 0.53167.\nCaveat: Beta-hemoglobin sickle-cell in West Africa:\nAA\nAS\nSS\nObserved\n25,374\n5,482\nExpected\n25,561.98\n5,106.03\n254.98\nReason: Heterozygous selective advantage: Malaria.\n\nLinkage Equilibrium/Disequilibrium\nLinkage equilibrium: Loci Aa and Bb are in equilibrium if transmission probabilities πA\nand πΒ are independent.\nπAB= πAπB.\nHaplotype: A combination of allele loci: πAB,πAb,πaB,πab.\nLinkage disequilibrium: Loci linked in transmission as.\ny2 =\n(ΠAB- ΠA ΠB)2\nΠA ΠB Πa Πb\na measure of dependency between the two loci.\nMarkers: Linkage disequilibrium is the key of markers.\n\nPhenotype and Genotype\nTask: Find basis (genotype) of diseases (phenotype).\nMarker: Flag genomic regions in linkage disequilibrium.\nProblem: Real genotype is not observable.\nStrategy: Use marker as genotype proxy.\nCondition: Linkage disequilibrium.\nDependency: Observable measure of dependency between marker and phenotype.\n\nComplex Traits\nProblem: Traits don¡ t always follow single-gene models.\nComplex Trait: Phenotype/genotype interaction.\nMultiple cause: Multiple genes create phenotype.\nMultiple effect: Gene causes more than a phenotype.\nCaveat: Some Mendelian traits are complex indeed.\nSickle cell anemia: A classic Mendelian recessive.\nPattern: Identical alleles at beta-globulin locus.\nComplexity: Patients show different clinical courses, from early mortality to\nunrecognizable conditions.\nSource: X-linked locus and early hemoglobin gene.\n\nReasons for Complex Traits\nIncomplete Penetrance: Some individuals with genotype do not manifest trait. Breast\ncancer / BRCA1 locus.\nGenetic Heterogeneity: Mutation of more than one gene can cause the trait. Difficult in\nnon experiment setting.\nRetinitis pigmentosa: from any of 14 mutations.\nPolygenic cause: Require more than one gene.\nHirshsprung disease: needs mutation 13c and 21c.\n\nStudy Design\n-Classification by sample strategy:\nPedigrees: Traditional studies focused on heredity.\nLarge pedigree: One family across generations.\nTriads: Sets of nuclear families (parents/child).\nSib-pairs: Sets of pair of siblings.\nCase/control: Unrelated subjects with/out phenotype.\n-Classification by experimental strategy:\nDouble sided: Case/control studies.\nSingle sided: e.g triads of affected children.\n\nAnalysis Methods\n-Study designs and analysis methods interact.\n-We review five main analysis types:\nLinkage analysis: Traditional analysis of pedigrees.\nAllele-sharing: Find patterns better than random.\nAssociation studies: Case/control association.\nTDT: transmission disequilibrium test.\nExperimental crosses: Crosses in controlled setting.\n-Typically, these collections are hypothesis driven.\n-The challenge is to collect data so that the resulting analysis will have\nenough power.\n\nLinkage Analysis\nMethod: Parametric model building.\nStrategy: Compare a model with dependency between phenotype and allele against independence model.\nTest: Likelihood ratio - or lod score log(LR).\nLR =\np(Data | M1)\np(Data | M0)\nSample: Large pedigree or multiple pedigrees.\nCaveats: Multiple comparison, hard for complex traits.\n\nAllele Sharing\nMethod: Non parametric method to assess linkage.\nTest: An allele is transmitted in affected individuals more than it would be expected by chance.\nSample: It uses affected relatives in a pedigree, counts how many times a region is identical-by-descent\n(IBD)from a common ancestor, and compares this withexpected value at random.\nCaveats: Weak test,large samples required.\n\nAssociation Studies\nMethod: Parametric method of association.\nStrategy: Traditional case vs control approach.\nTest: Various tests of association.\nSample: Split group of affected/unaffected individuals.\nCaveats: Risk of stratifications (admixtures) - case/control split by populations.\nAdvantages: Easily extended to complex traits and ideal for exploratory studies.\n\nTransmission Disequilibrium Test\nMethod: Track alleles from parents to affected children.\nStrategy: Transmitted=case / non transmitted=controls.\nTest: Transmission disequilibrium test (TDT).\nSample: Triads of affected child and parents.\nCaveats: Test is not efficient and is prone to false negatives.\nAdvantages: Powerful test and stratification not an issue.\n\nQuantitative Trait Locus Maps\nMethod: Complex trait variable in intensity (alcoholism).\nComplex Trait: Different since all about phenotype.\nStrategy: Controlled mating to induce recombination.\nSample: Animal populations.\nTest: Pedigree-based transmission tests.\nCaveats: In humans, it is hard to have the controlled conditions of an animal setting.\nAdvantages: Highly controlled setting and, as in the case of hypertension in rats, animal models can stimulate\nand direct research in humans.\n\nGenotyping Cohort Studies\n-Traditionally, data collection is phenotype driven.\n-During the past 3 years, an increasing number of large cohort studies started subjects genotyping.\n-Nurses Health Study.\n-Framingham Hearth Study.\n-This process will provide genotypes for a vast array of phenotypes recorded in these cohort studies.\n-This situation calls for a brand new generation of analytical tools able to provide high throughput\nphenotyping of whole-genome genotypes.\n\nFeasibility: Time and Cost\nBase: Number of SNPs per individual: 3,000,000\nCosts: How much for a genome-wide SNP scan?\nCost of 1 SNP: 0.30-0.45$ (soon 0.10-0.20$)\nCost of a 10kb SNP map/individual: 90,000 (30,000)\nCost of a 1000 individuals study: 90,000k (30,000k)\nCost of 1000 complete maps: 900,000k (300,000k)\nTime: How long does it take?\n1 high throughput sequencer: 50,000 SNPs/day\nEffort 1000 10kb SNP maps: ~700 days/man\nEffort 1000 complete SNP maps: ~7000 days/man\n\nHaplotypes\n-LD (r2) distances can be used to identify haplotypes.\n-Haplotypes are groups of SNPs transmitted in ¡°blocks¡±.\n-These blocks can be characterized by a subset of their SNPs (tags).\n-Since they are the result of an underlying evolutionary process, they can be used to reconstruct ancestral DNA.\n\nThe Importance of Haplotypes\n-Haplotypes make a SNP map of the human genome redundant: as some SNPs will be transmitted together,\nwe only need a subset of SNPs to tag the entire region.\n-NHGRI launched in October the HapMap project: a description of the set of haplotype blocks and the SNPs\nthat tag them. The HapMap will be valuable because it will reduce the number of SNPs required to examine\nthe entire genome for association with a phenotype from all 10 million common SNPs to perhaps 200,000 to\n300,000 htSNPs.¡±\n\nIdentifying Haplotypes\n-Dely et at. report an high-resolution analysis of the haplotype structure of a stretch of chromosome 5q31\n-500Kbs long.\n-There are 103 SNPs in the stretch.\n-The SNPs were selected if the minor allele frequency was higher than 5%.\n-Sample were 129 trios (nuclear families) of European descent with children affected by Crohn disease.\n-Therefore, they had 258 transmitted and 258 non- transmitted chromosomes.\n\nHaplotype Blocks\nThe resulting picture portraits the stretch separated in 11 blocks separated by recombination points.\nHaplotype patterns travel together (blocks in LD) and therefore the authors infer 4 ancestral haplotypes.\n\nhtSNPs Identification\n-Johnson et al. propose a transmission-based method to identify Haplotype Tag SNPs (htSNPs), the\nnecessary SNPs to identify an haplotype.\n-The method is claimed to capture the majority (80%) of the haplotype diversity observed within a region.\n-They genotyped polymorphisms in INS H19 SDF1 TCF8 and GAS2 in 418 UK families with at least 2\nsiblings with diagnosed type 1 diabetes.\n-They constructed haplotypes at CASP8 CASP10 and CFLAR of 598 Finnish families with type 1 diabetes.\n\nCharacterizing Phenotypes\nSimple phenotypes: Mendelian diseases usually have also the advantage of simple (binary) phenotypes.\nComplex diseases: Twenty years of AI in medicine show that often diseases do not obey these patterns.\nDissecting phenotypes: It is critical as dissecting gene expression patterns.\nAnimal models: QTL strategy may be an answer.\nOpportunity: Better clinical definition of disease states.\nClinical data: With dropping costs of sequencing, good clinical data about patients are the real wealth.\n\nTake Home Messages\nThe Past:\nHypothesis-driven phenotype-focused data;\nInteresting discoveries with simple models.\nThe Present:\nHGP changes the perspectives of genetic studies;\nSNPs are a critical tool to break the code;\nHGP technology makes sequencing a commodity.\nThe Future:\nExploratory genotyping will streamline discoveries;\nPhenotypes will be the real goodies of the future;\nThe challenge is to handle complex traits.\n\nA Must Read List\nHuman genome mapping:\nGenomics Issue, Nature, February 2001\nGenomics Issue, Science, February 2001\nVisions of polymorphisms:\nES Lander and NJ Schork, Science, 265, 1994\nDG Wang et al., Science, 280, 1998\nES Lander, Nat Gen, 21, 1999\nMJ Daly et al., Nat Gen, 29, 2001\nVisions of population genetics:\nLL Cavalli-Sforza, Genes, People, Languages, 2001\nSupported by NSF (ECS-0120309) and NIH/NHLBI (HL-99-024)"
    },
    {
      "category": "Lecture Notes",
      "title": "lecture18.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-950j-medical-computing-spring-2003/0210830c5d03c1f4e0c99dd6979e342b_lecture18.pdf",
      "content": "Decision Support via Expert Systems\n6.872/HST950\nHarvard-MIT Division of Health Sciences and Technology\nHST.950J: Medical Computing\nPeter Szolovits, PHD\n\nComponents of an Expert System\n-Knowledge\n-In various forms: associations, models, etc.\n-Strategy\n-Baconian, exhaustive enumeration, on-line, etc.\n-Implementation\n-Programs, pattern matching, rules, etc.\n\nLast Time\n-Naive Bayesian Inference\n-Exhaustive and Mutually\nExclusive disease\nhypotheses (1 and only 1)\n-Conditionally independent\nobservables\n(manifestations)\n-P(Di), P(Mij|Di)\nM1\nM2\nM3\nM4\nM5\nM6\nD\n\nTaking the Present Illness--Diagnosis\nby Pattern Directed Matching\n\nPIP's Theory of Diagnosis\n-From initial complaints, guess suitable hypothesis.\n-Use current active hypotheses to guide questioning\n-Failure to satisfy expectations is the strongest clue to a\nbetter hypothesis; differential diagnosis\n-Hypotheses are activated, de-activated, confirmed or\nrejected based on\n-(1) logical criteria\n-(2) probabilities based on:\n-findings local to hypothesis\n-causal relations to other hypotheses\n\nMemory Structure in PIP\nTriggers\nManifestations\nCausally and\nAssociationally\nRelated Hyp's\nLogical Criteria\nProbabilistic\nScoring\nFunction\nDifferential\nDiagnosis\nHeuristics\nHypothesis\n\nPIP's Model of Nephrotic Syndrome\n-NEPHROTIC SYNDROME, a clinical state\n-FINDINGS:\n-1* Low serum albumin concentration\n-2. Heavy proteinuria\n-3* >5 gm/day proteinuria\n-4* Massive symmetrical edema\n-5* Facial or peri-orbital symmetric edema\n-6. High serum cholesterol\n-7. Urine lipids present\n-IS-SUFFICIENT: Massive pedal edema & >5 gm/day proteinuria\n-MUST-NOT-HAVE: Proteinuria absent\n-SCORING . . .\n-MAY-BE-CAUSED-BY: AGN, CGN, nephrotoxic drugs, insect bite,\nidiopathic nephrotic syndrome, lupus, diabetes mellitus\n-MAY-BE-COMPLICATED-BY: hypovolemia, cellulitis\n-MAY-BE-CAUSE-OF: sodium retention\n-DIFFERENTIAL DIAGNOSIS:\n-neck veins elevated\n\nQMR Partitioning\nM1\nM2\nM3\nM4\nM5\nM6\nH1\nH2\n\nCompetitors\nH1\nH2\nM1\nM2\nM3\nM4\nM5\nM6\n\nStill Competitors\nH1\nH2\nM1\nM2\nM3\nM4\nM5\nM6\n\nStill Competitors\nH1\nH2\nM1\nM2\nM3\nM4\nM5\nM6\n\nMulti-Hypothesis Diagnosis\n-Set aside complementary hypotheses\n-... and manifestations predicted by them\n-Solve diagnostic problem among competitors\n-Eliminate confirmed hypotheses and\nmanifestations explained by them\n-Repeat as long as there are coherent problems\namong the remaining data\n\nInternist/QMR\n-Knowledge Base:\n-956 hypotheses\n-4090 manifestations (about 75/hypothesis)\n-Evocation like P(H|M)\n-Frequency like P(M|H)\n-Importance of each M\n-Causal relations between H's\n-Diagnostic Strategy:\n-Scoring function\n-Partitioning\n-Several questioning strategies\n\nQMR Scoring\n-Positive Factors\n-Evoking strength of observed Manifestations\n-Scaled Frequency of causal links from\n- confirmed Hypotheses\n-Negative Factors\n-Frequency of predicted but absent\n- Manifestations\n-Importance of unexplained Manifestations\n-Various scaling parameters (roughly\nexponential)\n\nSymptom Clustering for\nMulti-Disorder Diagnosis\n-- Tom Wu, Ph.D. 1991\n\nClustering Alternatives\nSymptom\nFever\nCough\nPossible Causes\nTB, Hepatitis, Malaria\nTB, Asthma, Bronchitis,\nEmphysema\nTB\nHep\nMal\nAsth\nBron\nEmph\nH1\nH2\nFever,\nCough\nTB\nFever Cough\nHep\nMal\nAsth\nBron\nEmph\nTB\nHep\nMal\nAsth\nBron\nEmph\n\nSymptom Clustering is Efficient\nLike in any \"planning island\" approach, reducing an exponential problem to several\nsmaller exponential problems vastly improves efficiency, if it captures some insight\ninto the problem.\nWu's algorithm (SYNOPSIS) will keep a compact encoding even if it overgenerates\nslightly.\nE.g., suppose that of the set of diseases represented by (d5, d6) x (d3, d7, d8,\nd9) x (d1, d2, d4), d6 x d8 x d1 is not a candidate. To represent this precisely\nwould require enumerating the 23 valid candidates. Instead, the factored\nrepresentation is kept.\nIn a diagnostic problem drawn from a small subset of the Internist database, it is a\npower of 3 faster and a power of 5 more compact than standard symptom clustering.\nGuide search via probabilities, if we have a reasonable model(!)"
    }
  ]
}