{
  "course_name": "Media Technology and City Design and Development",
  "course_description": "This workshop explores the potential of media technology and the Internet to enhance communication and transform city design and community development in inner-city neighborhoods. The class introduces a variety of methods for describing or representing a place and its residents, for simulating actions and changes, for presenting visions of the future, and for engaging multiple actors in the process of envisioning change and guiding action. Students will engage two neighborhoods: the Mill Creek neighborhood of West Philadelphia, PA, and the Brightwood/Northend neighborhood of Springfield, MA. Students will meet real people working on real projects, put theory into practice, and reflect on insights gained in the process. Our hope is that student work will contribute to new initiatives in both communities.\nThe class Web site can be found here: Media Technology and City Design and Development. It is sponsored by the West Philadelphia Landscape Project and the Center for Reflective Community Practice.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Social Science",
    "Communication",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Urban Planning",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Social Science",
    "Communication",
    "Sociology",
    "Community Development",
    "Urban Studies",
    "Urban Planning"
  ],
  "syllabus_content": "Course Description\n\nThis workshop explores the potential of media technology and the Internet to enhance communication and transform city design and community development in inner-city neighborhoods. The class introduces a variety of methods for describing or representing a place and its residents, for simulating actions and changes, for presenting visions of the future, and for engaging multiple actors in the process of envisioning change and guiding action. Students will engage two neighborhoods, meet real people working on real projects, put theory into practice, and reflect on insights gained in the process. Our hope is that student work will contribute to new initiatives in both communities.\n\nWithin this context of media technology, a major theme will be the transfer of knowledge from a fifteen-year old university-community partnership in Philadelphia, the West Philadelphia Landscape Project (\nWPLP\n). This will entail both a re-presentation of knowledge to those currently living in or working in West Philadelphia and a presentation of lessons from WPLP relevant to other university-community partnerships, such as the recent partnership between MIT and Springfield. The integration of comprehensive, top-down approaches and grassroots, bottom-up approaches to urban design and planning is another major theme. A third theme is how different types of languages (e.g. professional and vernacular, verbal and visual, English and Spanish) facilitate and impede thinking and communicating about alternatives for city planning and design.\n\nPlaces\n\nThere are two sites for the course of the semester: the Mill Creek neighborhood of West Philadelphia, PA and the Brightwood/Northend neighborhood of Springfield, MA. Mill Creek is a neighborhood whose population is African-American; Brightwood/Northend is predominantly Puerto-Rican. The population of each neighborhood is both low-income and middle-class. There will be a weekend field trip to each, one to Philadelphia in February and one to Springfield in March.\n\nBackground\n\nThe City of Philadelphia recently received a Hope VI grant to redevelop Mill Creek Public Housing, originally designed by architect Louis Kahn, in a collaboration between the Philadelphia Housing Authority, Philadelphia Water Department, and the community. Many of the ideas underlying the City's proposal were developed by WPLP in collaboration with neighborhood residents and teachers and students in a local middle-school. How can the knowledge and visions produced by these earlier efforts serve as a resource for these new ventures and be effectively communicated to new actors, such as city officials and professional consultants they hire?\n\nThe Brightwood/Northend neighborhood of Springfield is embarking on an ambitious program of community planning and development, for which they have good support from city agencies. What can Springfield learn from the 15-year experience of WPLP, its successes and failures, and how can this knowledge be transferred?",
  "files": [
    {
      "category": "Resource",
      "title": "West Philadelphia Landscape Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-310j-media-technology-and-city-design-and-development-spring-2002/20274ccf2165fd0c4d2de3918618c8ae_duritz.pdf",
      "content": "HOME\nABOUT\nWPLP\nWHAT'S\nNEW\nGET\nINVOLVED!\nMAKE A\nDONATION\nP h i l a d e l p h i a\nL a n d s c a p e\nP r o j e c t\n\"If there is no struggle there is no progress. Those who profess to favor freedom, and yet depreciate\nagitation, are men who want crops without plowing up the ground.\"\nFrederick Douglass, August 3, 1857"
    },
    {
      "category": "Resource",
      "title": "West Philadelphia Landscape Project",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/11-310j-media-technology-and-city-design-and-development-spring-2002/ed84413772877d5c69a064844467b52b_kim.pdf",
      "content": "The West\nPhiladelphia\nLandscape Project is\nan action research\nprogram integrating\nresearch, teaching,\nand community\nservice. It is based in\nthe Department of\nLandscape\nArchitecture and\nRegional Planning at\nthe University of\nPennsylvania. Since\nthe program began in\n1987, faculty and\nstudents have worked\non a wide variety of\nprojects with\ncommunity\norganizations,\nneighborhood groups,\nteachers and students\nin West Philadelphia\npublic schools.\nWest Philadelphia\nLandscape Project\nDepartment of Landscape\nArchitecture\nand Regional Planning\nGraduate School of Fine\nArts\nUniversity of\nPennsylvania\n119 Meyerson Hall\nPhiladelphia, PA 19104-\nHome | Awards | Publications & Reviews | Links | Credits\n\nWelcome to the West\nPhiladelphia Landscape\nProject Website\nProposal for website\nLast updated: March 17, 2002\ntemporarily...\n\nAbout this Site | Mill Creek Neighborhood Website | Links | Search\n\nOverview\nLinks\nSearch\nNew Proposal\nlast updated: March 17, 2002\n\nWebsite Proposal\nAudience:\nThe audience for this proposed website is the interested members of the Mill Creek community, which includes\nnot only residents, but also those people connected to the area relationally, professionally, and commercially. Yet\nthe site should be accessible and understandable for other people outside the community who want to know\nabout Mill Creek and the West Philadelphia Landscape Project. The active site of the Mill Creek neighborhood\nwill be of interest to the secondary audience (other organized community groups like NEON, professionals and\nacademics like ourselves). The West Philadelphia Landscape Project component of the website, however, will be\ndirected more specifically for this secondary audience.\nOwnership/\nMaintenance:\nThe subject of ownership, maintenance, and possibly hosting of this website ought to be discussed with the Mill\nCreek community members. Based on conversations and feelings gathered from the visit to West Philadelphia in\nFebruary, I would suggest a partnership between the Mill Creek Coalition and students at Sulzberger Middle\nSchool in owning and maintaining the Mill Creek site, as well as the WPLP component. As current members of\nthe Mill Creek community, these groups would best serve as the administrators to an active website about the\nMill Creek neighborhood, and they seem to be the ones most enthusiastic about having ownership of such a\nwebsite. Specific content should be decided by the Mill Creek Coalition and the students at Sulzberger. The hope\nis that the content would reflect not only these institutions but also those of other community interests.\nInvestigating these other interests may rest upon the coalition and students who take up the administration of the\nwebsite.\nPurpose:\nThe website will be a space where the Mill Creek community members can represent their neighborhood to\nthemselves and to other communities. A part of the website will serve as an updated \"newsletter\" of sorts to the\ndifferent organizations featured in the West Philadelphia Landscape Project based in Mill Creek (i.e. Mill Creek\nCoalition, Sulzberger Middle School, community gardens in West Philly, etc.). These will serve as homepages\nfor the various groups, which they can update frequently as different news and activities arise for their group.\nThese will all be linked from the main Mill Creek homepage. (See structure section). In the long run, I think it\nwould be neat to have an emailable newsletter drawing interested members of the community to the website for\nmore information. (Similar to the emailed headlines feature of the New York Times for example). These can be\nsent out every month or every two weeks on a regular basis to bring people interested in the Mill Creek\nneighborhood and its activities to the website for updated news.\nThe stories section can host a variety of stories from individual Mill Creek community members. A link will be\ndirected to the stories of the WPLP which will be placed in the WPLP section. The general stories section of the\nMill Creek site, however, will be a place for any story relevant to the neighborhood. The stories of the Mill Creek\nsite can be anything from the community, not necessarily related to the watershed or the public activism. I think\nthis would be a neat place for other voices in the neighborhood to emerge. Other issues pertinent to the\ncommunity may be raised in this manner, and perhaps will lead to dialog.\nThe WPLP part of the website will serve more as an archival section, which can be updated as needed. Based on\nJeff Scaveron's suggestion, an important part of this section will be stories from people and/or about places in\nMill Creek and \"events\" of the WPLP. Whether the subject is about a person/role, an object, place, or event, the\nstory should be a personal account. First-person points of view are so much more compelling. Also, other parts\nof the WPLP section will have descriptive documents and histories so the \"third-person\" story of the WPLP is\nbeing presented in a way. This other material should be well-structured and organized for easy browsing,\nsearching, and clarity. Perhaps multiple \"browse by\" or \"search by\" options would be helpful, i.e. browse/search\nby chronology, medium, specific project, issue, agency, etc.\n\nContent:\nG overview of the website, brief description of its origins, the WPLP and Mill Creek\nG homepages for the Mill Creek Coalition, Sulzberger Middle School, Aspen Farms (or a collection of all\nthe community gardens?)\nG stories from the community, about anything, with a link to WPLP specific stories\nG archives from the WPLP\nH history of the Mill Creek neighborhood, description of watershed issues and background\ninformation on the WPLP\nH stories specific to WPLP\nH description of partners and affiliates (U Penn, Water Dept., EPA, etc.)\nH documents\nH database\nG links to other sites relevant to West Philly\nG search function for the whole website\nStructure:\n\nImplementation:\nG input/involvement of Mill Creek in design of their site, organization for maintenance\nG gathering of stories\nH from the original WPLP site\nH new ones: digital storytelling?, photo essays, text, audio, ?, where and how?\nH getting input from Mill Creek on who would like to tell a story and which stories they feel are\nimportant to present.\nG review by Springfield NEON of the WPLP's new site while in production by us\nMill Creek homepage\nWPLP homepage\nby Linda Kim\nMarch 17, 2002\nlakim@mit.edu"
    }
  ]
}