{
  "course_name": "Media in Cultural Context",
  "course_description": "This seminar is about the pleasures and power of reading. From the Sumerian clay tablets of more than four millenia ago through the spectacular emergence of the electronic text, the written word—in all its forms—has captivated the human mind, embodied our insights into the world around us, and made enduring our most profound artistic creations and scientific discoveries.",
  "topics": [
    "Humanities",
    "Literature",
    "American Literature",
    "Classics",
    "Comparative Literature",
    "Criticism",
    "Fiction",
    "Periodic Literature",
    "Humanities",
    "Literature",
    "American Literature",
    "Classics",
    "Comparative Literature",
    "Criticism",
    "Fiction",
    "Periodic Literature"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 2 hours / session\n\nLab sessions: 1 session / week, 1 hour / session\n\nPrerequisites\n\nTwo subjects in\nLiterature\nor\nComparative Media Studies\nor permission of the instructor.\n\nCourse Overview\n\nThis seminar is about the pleasures and powers of reading. From the Sumerian clay tablets of more than four millennia ago through the spectacular emergence of the electronic text, the written word--in all its forms--has captivated the human mind, embodied our insights into the world around us, and made enduring our most profound artistic creations and scientific discoveries. This semester we journey into the history of the book by means of some of its most resonant artifacts, past and present. Weekly \"lab\" sessions in\nMIT Library's Special Collections\nwill allow students to dig deep into historical books and other media through a series of special projects and case studies. Students will have the opportunity to present on their readings and research in a variety of forms.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass Participation\n\n25%\n\nPosition Papers (2)\n\n30%\n\nRevision (Either of 2 Position Papers)\n\n15%\n\nSpecial Collections Project\n\n15%\n\nFinal Exam\n\n15%",
  "files": []
}