{
  "course_name": "Media Education and the Marketplace",
  "course_description": "This instance of “Media, Education, and the Marketplace” focuses on the rise of information and communications technologies (ICTs) during the age of globalization, specifically examining its effect and potential in developing nations across the world. In particular, the class will focus on the following three components:\n\n“Media” – ICTs, specifically the dramatic rise in use of the Internet over the past twenty years, have “globalized” the world and created opportunities where very few have been available in the past. We are entering a phase where an individual can significantly improve his or her own economical, political, and social circumstances with just a computer and Internet connection. This course investigate these profound developments through current research and case studies.\n“Education” – With projects such as MIT’s OpenCourseWare, the major players in the world are beginning to understand the true power of ICTs in development. Throughout this class, we examine projects that harness the benefits of ICTs to create positive social change around the world.\n“Marketplace” – The focus is on the developing regions of the world. Specifically, the term “digital divide” is tossed around in everyday language, but what does it really mean? Is there an international digital divide, a national digital divide, or both? Should we try to bridge this divide, and how have past attempts succeeded and (for the most part) failed? Why? These are all questions that are asked throughout this course.\n\nThis course has a very unique pedagogy, which is discussed in more detail in the syllabus section.",
  "topics": [
    "Business",
    "Information Technology",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Humanities",
    "Language",
    "English as a Second Language",
    "Social Science",
    "Communication",
    "Society",
    "The Developing World",
    "Teaching and Education",
    "Educational Technology",
    "Business",
    "Information Technology",
    "Fine Arts",
    "Media Studies",
    "Digital Media",
    "Humanities",
    "Language",
    "English as a Second Language",
    "Social Science",
    "Communication",
    "Society",
    "The Developing World",
    "Teaching and Education",
    "Educational Technology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Description\n\nThis year, \"Media, Education, and the Marketplace\" focuses on the rise of information and communications technologies (ICTs) during the age of globalization, specifically examining its effect and potential in developing nations across the world. In particular, the class will focus on the following three components:\n\n\"Media\" - This year, we have chosen to focus on information and communication technologies as a form of media. ICTs, specifically the dramatic rise in use of the Internet over the past twenty years, have \"globalized\" the world and created opportunities where very few have been available in the past. As Thomas Friedman claims in his new book, \"\nThe World is Flat\n,\" we are entering a phase where an individual can significantly improve his or her own economical, political, and social circumstances with just a computer and Internet connection. This course investigates these profound developments through current research and case studies.\n\n\"Education\" - With projects such as MIT's OpenCourseWare, the major players in the world are beginning to understand the true power of ICTs in development. Throughout this class, we examine ICT projects that harness the benefits of technology to create positive social change around the world.\n\n\"Marketplace\" - This semester, our focus is on the developing regions of the world. Specifically, the term \"digital divide\" is tossed around in everyday language, but what does it really mean? Is there an international digital divide, a national digital divide, or both? Is it a significant problem, or should we be worrying about more immediate needs such as food, shelter, and sanitation? Should we try to bridge this divide, and how have past attempts succeeded and (for the most part) failed? Why?\n\nThese are all questions that are asked throughout this course.\n\nCourse Objectives\n\nThe main objective of this course is to expose the student to a vast body of knowledge on the different uses of information and communication technologies throughout the globe, focusing especially on developing regions of the world. Much of the class focuses on discussion based on readings assigned out of class.\n\nAnother objective of this course is to give students hands-on experience with international development through technology. Throughout the course of the semester, we work on globally-based projects that leverage the benefits of information and communication technologies to positively affect an underdeveloped community. These projects are organized remotely by the class organizers and project leads.\n\nCourse Format and Topic Oral Presentations\n\nThis course resembles a graduate-level seminar in terms of format and style. There is an extensive list of readings for each lecture, and each student is expected to read all of the assigned material\nbefore\nattending class!\n\nFor each lecture that does not feature a guest lecture, we begin with a presentation from a few students on the assigned readings. The presentations should focus on the content of the readings, but should not be a summary of the readings! We are not looking for a book report; rather, we are expecting to hear the student's thoughts and insight on the matters present in each set of readings. Outside research is expected for these presentations, and they will be a substantial portion of the grade. Each presentation should be approximately 20-25 minutes in length. Also, each presentation should end with a list of outstanding questions/issues that the class can then take up for discussion.\n\nFieldwork Projects\n\nEach student in the course works on a project that affects either a local or global community. The class organizers feel that having on-site experience with issues relating to information technology and development is\ncrucial\nto understanding the underlying difficulties in implementing effective ICT policy, both at home and abroad. These project ideas are showcased in the\nlecture notes\nsection.\n\nThere are three options for this field work:\n\nIAP-focused local/global fieldwork: If this option is chosen, the student is responsible for\nactively\nseeking funding throughout the term for a local or global ICT-related project to be completed during January 2006.\n\nFall-focused local fieldwork: If this option is chosen, the student is responsible for actively participating in and contributing to an ICT-related project throughout the fall semester (i.e. on the order of a few weekends).\n\nOther: Another option concocted by the student and approved by the course instructors.\n\nOptions for both local and global projects exist, and the class organizers review them at the beginning of the class.\nThere is no guaranteed funding for any projects, however.\n\nFinal Projects\n\nIn addition to the ongoing development project, each student will choose a topic to expound upon over the course of the semester. This topic will either stem from the readings, a list provided by the instructor, or the student's mind!\n\nIdeally, the students should focuses on a case study relating to ICT and development. This is not required, however. At the end of the semester, all of these final projects are put together and we publish a comprehensive analysis. This document is forwarded to many interested parties after its completion, and the students are a part of a new and exciting piece of literature in this field!\n\nAttendance Policy\n\nThis course has been designed in a seminar-style format, so lecture attendance is\nessential\n! A portion of the final grade will be based on classroom participation. If you cannot attend a class, please inform the instructor\nahead\nof time with the justifiable reason for the absence.\n\nFor an excused absence, you are given the option to complete a make-up assignment to regain your participation points for that day. The assignment would then be distributed by the professor upon request by the student, and would be due at the beginning of the following lecture. You are only able to exercise this option twice during the course. There will be no opportunity to make up participation points for an unexcused absence.\n\nMore than two (2) unexcused absences will result in a failing grade for the course.\n\nGrading\n\nThe grading scheme for this course is as follows:\n\nActivities\n\nPercentages\n\nClass Participation and Attendance\n\n20%\n\nWriting\n\nWSIS Assignment\n\n10%\n\nFieldwork Project Summary\n\n5%\n\nFieldwork Proposal I\n\n10%\n\nFieldwork Proposal II\n\n10%\n\nCase Study Final Paper\n\n20%\n\nOral\n\nTopic Oral Presentation\n\n15%\n\nCase Study Oral Presentation\n\n10%\n\nRequired Textbooks\n\nNorris, Pippa.\nDigital Divide: Civic Engagement, Information Poverty, and the Internet Worldwide\n. Cambridge, UK: Cambridge University Press, 2001. ISBN: 9780521002233.\n\nWresch, William.\nDisconnected: Haves and Have-nots in the Information Age\n. New Brunswick, NJ: Rutgers University Press, 1996. ISBN: 9780813523705.\n\nWriting and Speaking Assignments for a Communication Intensive Course\n\nCommunication intensive subjects in the humanities, arts, and social sciences require at least 20 pages of writing divided among a number of assignments, at least one of which is revised and resubmitted. This class requires three (3) papers that total at least 21 pages in length (double-spaced). The first essay will be graded and returned to you for your revision and resubmission. This resubmission will receive a grade separate from the grade on the first draft. The resubmission grade will be based\non the extent and quality of the revision\n(e.g., a B paper that is poorly revised may receive a C for the resubmission).\n\nHASS-CI subjects also offer students substantial opportunity for oral expression, through class discussion and student presentations. This class requires all students to participate in a weekly discussion of the assigned reading and films. In addition, each student will make two (2) formal presentations, both of which will receive written feedback and be graded. The first presentation will be on your second essay, and the second presentation on your final essay. To guarantee sufficient attention to student writing and substantial opportunity for oral expression, the number of students in this class is limited to 18. (In other CI-H classes, enrollment may increase to 25 if a writing tutor is assigned.)\n\nGrading of Written Work\n\nEssays are designed to encourage students to engage with the main themes of the course, while also taking a comprehensive and analytical look at the materials. Written work will be graded according to three criteria:\n\nArgument\n: Is there a coherent thesis? How clearly is the argument stated in the introduction and developed throughout the paper? Do the steps of the argument make sense and lead logically to the conclusion?\n\nEvidence\n: How well does the essay use the evidence available from the class materials (readings, lectures, films)? Are there contradictory examples that should be discussed to eliminate doubts?\n\nStyle\n: How well is the paper written? Has it been carefully proofread? Does the paper length match the assignment?\n\nOral Presentations\n\nOral presentations will be based on the second and third writing assignments. They will be graded according to following criteria:\n\nHow well organized is the presentation? Does the presenter make the key questions clear? Is there a provocative idea that deals with topic?\n\nHow effectively does the student communicate his/hers ideas, questions, and insights? Are there handouts or other materials that aid in understanding?",
  "files": [
    {
      "category": "Resource",
      "title": "Bridging the Digital Divide – Is it worth?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/61cbdcc6525e376f6dba4170fd9a2447_MIT21G_034F05_bridginworth.pdf",
      "content": "Bridging the Digital Divide: Is it\nworth it?\n\nWhat is the Digital Divide\n-\nThe digital divide is a social/political issue referring to the\nsocio-economic gap between communities that have access\nto Information and Communication Technologies (ICT) and\nthose that do not.\n-\nThe term also refers to gaps that exist between groups\nregarding their ability to use ICTs effectively, due to their\ngeographic location, their living standard, differing levels of\nliteracy and technical skills, as well as the gap between\nthose groups that have access to quality, useful digital\ncontent and those that do not.[1][2]\n[1] http://en.wikipedia.org/wiki/Digital_divide\n[2]http://www.alcatel.com/doctypes/articlepaperlibrary/pdf/ATR2004Q3/S0408-Bridging_opportunity-\nEN.pdf by Souhiel Marine and Jean Marie Blanchard Alcatel Telecommunications Review - 3rd\nQuarter 2004\n\nBridging the Digital Divide\nHow?\n- National Policies - telephone: US national\npolicy on Universal telephone access\n- International Policies - UN Millennium\nDeclaration, WSIS (the goals)\n- Organizational Policies - MIT's OCW\n- Individuals - MIT AITI, Camp Amelia,\n\nIs it worth it?\n- We interpreted this question as:\nDo the benefits outweigh the economic\ninvestment, and the human effort, that go\ninto bridging the digital divide?\n\nReasons for Bridging the Digital\nDivide\nIn General Bridging the Digital divide will be\nadvantageous to Individuals, Nations and\nthe Global Community as a whole\n- Academic Advancement and Self-\nImprovement\n- Economic Growth\n- Democracy\n- Social and Economic Equality\n\nHow & why Bridging the Digital\nDivide has worked\n- How wireless internet Technology has\nhelped fishermen and farmers in Senegal\n\nConcerns of Bridging\nThe Digital Divide\n1. Economic Concerns\n2. Evaluating the Sustainability\n3. Setting Priorities\n\nThe Actual Bridging of\nThe Digital Divide\n1. Economic Concerns\n- Somebody has to pay more than their\nshare.\n2. Evaluating the Sustainability\n3. Setting Priorities\n\nThe Actual Bridging of\nThe Digital Divide\n1. Economic Concerns\n2. Evaluating the Sustainability\n-\n-\"Jumping in too fast can lock in a technology that soon would\nbe superseded by a better one.\"\n-Benjamin M. Compaine\n-Telegraph or DC electric current\n3. Setting Priorities\n\nThe Actual Bridging of\nThe Digital Divide\n1. Economic Concerns\n2. Evaluating the Sustainability\n3. Setting Priorities\n- \"The issue is not one of information or\nknowledge gaps, any more than it is one of a\nprotein gap or a transportation gap.\"\n-Benjamin M. Compaine\n\nThe Actual Bridging of\nThe Digital Divide\n- \"Go Slow\" position\n-> Not rushing.\n-> Research more before actually start bridging.\n-> Can resolve,\n1. Economic Concerns\n2. Evaluating the Sustainability\n3. Setting Priorities\n\nCase Studies\n- French government: Videotext\n->Should have chosen \"Go Slow\" position.\n- Telephone Industry\n->\"Go Slow\" position worked.\n- International Donor Project to an Egyptian\nUniversity.\n->Unpredicted result.\n\nHistory of Telephone Industry\n1. Private development from Alexander Graham Bell.\n(Monopoly)\n2. A period of competition with some other companies\n3. Then government approved and regulated monopoly\n4. Now, a period of regulated competition.\n- The role of government to bridge the digital divide of\ntelephone was pursued decades after telephone service\nbegan.\n- Without so much effort of the government, the digital\ndivide of telephone is bridged.\n\nWhat does it boil down to?\n- Deciding on whether Bridging the Digital\ndivide is worth it is difficult. The\nproponents of it being worth it are thinking\nabout the Long Term benefits to the\npeople, nation or the world. Whereas\nthose who are against it are concerned\nmore about the short term/immediate\nsolutions to the problems that people in\nunderprivileged communities face.\n\nSuggestions & Conclusion\n- The Question that we were tackling in this\npresentation is, are efforts to bridge the digital\ndivide worth it?\n- The Illustrations and Case Studies provided\nshow that for each particular case there is a\ncertain set of circumstances that make it\npossible or impossible to bridge the digital divide.\nThus implementation of any policies must go\nwith a high level of thought, research and study\nof the peculiar community and the sustainability\nof the particular technological tool\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Case studies",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/c55544f116d2b6d836e5a3adb8258650_MIT21G_034F05_itcspastpro.pdf",
      "content": "Grameen Telecom and Voxiva\nTwo cases that bridge the digital divide\nthrough telecommunication\nBy Tabitha Bonilla\nand Theresa Eugenio\n\nOutline\n- Grameen Phones\n- Telephone connectivity in Bangladesh\n- Introducing phone systems to rural villages\n- Voxiva\n- Healthcare concerns in Peru\n- Producing a system that promotes more\nurgent care\n\nCase 1:\nGrameen Village Phone\nProgram\n- Problem\n- 97% of Bangladesh homes have no\ntelephone\n- 0.34 telephone lines per 100 people\n- 2 day trip to make a call\n\nGrameen Solution\n-\nTwofold\n1. Non-profit Grameen Telecom (GT)\n2. For-profit Grameen Phone (GP)\n-\nBoth branches of Grameen bank\n\nGrameen Telecom\n- Village Phone Program\n- Started in 1997\n- Pay-per-call system\n- Gives villages easily accessible mobile phone\nstations\n- Grameen Bank provides loans and training\n\nGT Benefits\n- Financial\n- City calls cost 1.94 to 8.44 times as much\n- 2.64% to 9.8% of monthly income\n- 86% of calls used for financial purposes\n- 8% used explicitly to improve prices\n- Social\n- Empowers village women\n\nGrameen Phone\n- National mobile phone service\n- Won license in 1996\n- Began operations on March 26, 1997\n- Primarily urban areas\n- Individually-owned systems\n\nGP-GT Interaction\n- Demonstrates how complementary profit\nand non-profit organizations feed into one\nanother\n- GP profits offset GT costs\n» -allows GT calls to be 50% off\n- Economic growth could lead to an eventual\nrise in GP customers\n\nMeasures of Success-GT\n- 165,000 subscribers as of August 2005\n- Low cancellation rate- 2.18%\n\nMeasures of Success-GP\n- About 63% of mobile phone market in 2000\n\nReasons for Success\n- Gives people a sense of ownership rather than\ncharity\n- Grameen provides a strong support system\nafter the initial startup\n- Gives a sustaining power that many other projects\nlack\n- Already connected with the necessary\nbusiness infrastructure\n- GB handles finances, GP subsidizes\n- Versatility\n\nObstacles\n- Government bureaucracy\n- BTTB unwilling to increase accessibility to\nnetwork\n- Exorbitant fees to add lines\n- Local management\n- Unwilling to work with poor credit ratings\n- Unwilling to risk good credit ratings\n\nOther Applications\n- Would this system work in other areas?\n- If so, where? If not, how would it have to be\nmodified?\n- Is the for-profit/non-profit coupling\nfeasible in the long run?\n- What other industries could implement\nthis system?\n\nCase 2: Voxiva\n- Voxiva focuses efforts on extending technology\nbeyond the digital divide primarily through\ntelecommunication\n- A for profit organization set up in 2001 to look\ninto voice and data solutions\n- Because of the lack of internet resources,\ndecided to target telephones, a market that\nmakes under $2 per day\n\nALERTA\n- Local users give their\ninformation via phone\nor internet\n- Government receives\ninformation and\ndistributes healthcare\nas needed\nImage removed due to\ncopyright reasons.\n\nALERTA Services Card\nImage removed due to\ncopyright reasons.\n\nHealth Concerns\n- 68% of childhood deaths and 48% of premature\ndeaths are caused by infectious diseases\n- 300 million people have acute cases of malaria\n- More than 500,000 women die from pregnancy\nand childbirth complications a year\n\nHealth Concerns\n- Infectious diseases such as HIV/AIDS, malaria,\nand cholera account for half of all deaths in\ndeveloping countries\n- The rural poor are disproportionately affected\ndue in large part to poor communication\nbetween the affected areas and domestic and\ninternational health agencies, without which\nofficials cannot control the spread of infectious\ndisease\n\nEconomic concerns\nImage removed due to\ncopyright reasons.\n\nFighting human disease\n- Infectious diseases are a threat in both human and\neconomic terms\n- Early detection is critical and requires active surveillance\n- Relevant action reduces the probability the disease will\nspread\n- Requires the ability to communicate quickly and easily\nbetween effected groups and authorities\n\nCommunication Limitations\n- Internet access is extremely limited\n- 70% of the world's poor have limited\naccess to telecommunication\n\nVoxiva\n-\nBefore Voxiva, Paul Meyer founded\nIPKO, the first and largest internet\nprovider in Kosova\n-\nLearned:\n1. Most projects are not scalable\n2. Donors suffered from \"dot-com\" fever\n3. Narrow focus on the internet as a solution is\nsignificant\n\nCase Study: Peru\nImage removed due to\ncopyright reasons.\n\nHealth Concerns: Peru\n- In Ucayali region:\n- Infant mortality rate is 52 per 1000 compared\nto 34 per 1000 nationally\n- Maternal death rate was 185 per 100,000\ncompared to the national rate of 146 per\n100,000\n\nTransportation complications\n- Medical facilities are difficult to reach via land\ndue to the dense Amazon forest\n- Travel by river can take from 2 to 7 days to\nreach the desired destination\n- Inability to reach medical facilities reduces the\nchance of early detection and the ability to treat\nquickly\n\nHealthcare in Peru\n- 6,000 health centers across Peru\n- Each required to report cases of disease\n- Ministry of Health investigates and takes action\n- System currently maintained is paper based with\ncomputers at the top end of the health service\n- Results in a 3-week delay\n\nHealthcare in Peru\n- More than 90% of healthcare providers reported\nreceiving health alerts \"never,\" \"rarely\" or \"less\nthan once a month\"\n- Peruvian Ministry of Health also wanted to\nupdate its present surveillance system\n- The Regional Health Directorate wanted to\nreduce the occurrence of infectious disease in\nrural Peru by about 50%\n\nObjectives in Peru\n1. Expand the network of health posts\n2. Form a more efficient feedback loop\n3. Improve data quality\n4. Reduce amount of time spent on paper work\n\nSolution\n- Voxiva connected 204,000 individuals in two\nrural districts\n- System incorporated 76 health clinics, health\ncenters and district centers\n- Voxiva's reports are always available in real-\ntime through text messaging or email\n\nInformation Flow\nin Epidemiologic Surveillance\nImage removed due to\ncopyright reasons.\n\nResults: Efficiency\n- Trained 149 users and counterparts in 76 health\nfacilities\n- Demonstrate that it is feasible to do real time\nelectronic disease and disaster reporting\n- Health authorities have been able to receive\ninformation and respond in hours or days\ninstead of weeks\n\nBenefits of ALERTA\n1. Allows for two-way communication\n2. Simplifies coordination among the different\nmanagement and operation levels concerned\nwith disease management and operation levels\n3. Provides a unique database, for real-time and\nhistorical analysis\n4. Reduces errors and increases efficiency\n5. Permits exporting the data to PDF, Excel and\nother formatting\n\nALERTA Pilot Score Card\nGoals\nGrade\nTechnically Appropriate and Feasible\nB+\nCost-Effective\nA+\nCan be maintained with local skills and resources\nA-\nAcceptable by Clients and Providers\nA-\nResults in Favorable Effects on Health\nTBD\n\nChallenges\n- Lack of telephones can be a major constraint\n- Radios have been recognized as sustainable way to\nsupport the rural telephony network\n- High turnover of government personnel requires\nthe project to seek new supporters, and orient\nnew participants in a very short period\n\nOther effects\n- Using existing phones reduces the cost of a\ncommunication system by an average of 40%, requires\nminimal training, and allows for a faster and more\nappropriate response\n- 87% of rural healthcare workers with access to a phone\ncalled in regularly\n- 90% reported faster responses from supervisors\n- 70% believed the system had improved communication\n- Examples:\n- Measles case\n- Transportation case\n\nPrimary Market Needs\n1. Environment and deployable resources\ndetermine the market used\n2. Provide a real-time assessment of field\nsituations will help prevent or decrease the\nduration of outbreaks\n3. System increases quality and quantity of data\nthat affects decision making\n\nPrimary Market Needs\n4. System must be cost effective\n5. Technology must facilitate adoption and use\n6. Collaboration drives problem solving\n7. Significantly increased communication through\nstaff meetings\n8. Industries standards must be adhered to\n\nExtensions in developing\ncountries\n- Has been used crime reporting by civilians\n- Enables some bank customers to access their\nbalances and check bill payments across the\nphone\n- Voxiva also looking to partner with development\ninstitutions to expand program to Brazil,\nRwanda, South Africa and India\n\nExtensions in the United States\n- Currently being used by the US military to help\ncombat disease in Iraq\n- The FDA is now testing the same system used\nin Peru to monitor the US blood supply\n- The Defense department is using the system to\nmonitor their small pox vaccination program\n- It is also being introduced in San Diego County\nand Washington, DC to link school nurses with\nlocal health departments\n\nSource Citations\n-\nhttp://www.voxiva.net/nacer.asp\n-\nhttp://www.sustainableicts.org/infodev/Voxiva.pdf\n-\nhttp://www.markle.org/markle_programs/project_archives/2001/gdop_v\noxiva.php\n-\nhttp://www.omidyar.net/corp/p_vox.shtml\n-\nhttp://www.acumenfund.org/Work/HealthTechnology/voxiva.asp\n-\nhttp://www.grameenphone.com\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Grading Rubric for Oral Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/44b1031aaf3c28961ba546df73174098_MIT21G_034F05_rubricforwri.pdf",
      "content": "Grading Rubric for Writing: Media, Ed & Marktplc 9.05\n\nWritten assignments give students practice in analyzing course content and formulating\nwell reasoned arguments that become engaging and accessible to readers. Helping\nstudents to master such skills is the reason for CI classes. Your papers will be graded\naccording to the following criteria:\n\n- ARGUMENT: Is there a coherent thesis in the paper? Are the key questions and\nevolving argument(s) of the paper clear and understandable? Are evidence and\nexamples to support argument/ideas selected and explained well? Is a comfortable\namount of time spent on each idea? Is there any confusion, or is content engaging and\ncompelling? Is there a strong opening paragraph and a solid thoughtful conclusion?\n(45%)\n\n- EVIDENCE: How well does the essay use evidence available from class materials\n(readings, lectures, films) and other research to support the central arguments of the\npaper? Have solid evidence and examples been marshaled to support claims in the\nessay? Are there contradictory examples which could be used to eliminate doubts\nabout the writer's claims? Use of detail, story and evidence remain the best way to\ncreate engaging essays and arguments. (25%)\n\n- STYLE: How effectively does the student communicate his/her ideas, questions, and\ninsights? Are there syntax problems--awkward phrasing, lack of clarity, errors of\nnoun/verb agreement, poor word choice, illogical thinking? Has the paper been\ncarefully proofread (showing concern for detail)? Has the writer fulfilled the\nrequirements for length as well as content? (30%)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Grading Rubric for Oral Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/fd5d30eb8b11729387147a298be549cd_MIT21G_034F05_rubricorlpr.pdf",
      "content": "Grading Rubric for Oral Presentations: Media, Ed & Marktplc 9.05\n\nOral presentations should present carefully considered content, be emotionally engaging\nand accessible to an audience, present points clearly, and be rehearsed in advance. Time\nlimits will be imposed, and you may be penalized for going overtime, since organization\nof ideas and effective practice are critical to effectively presenting ideas and projects in\nany venue, from class to boardroom to trainees. Helping you master those skills is the\nreason for CI classes. Presentations will be graded according to the following criteria:\n\n- SUBSTANCE: How well organized is the presentation? Is there a single provocative\nidea or two that drive the discussion? At the outset, does the presenter say what the\nargument is and forecast what (s)he will present? Are the key questions and evolving\nargument(s) clear and understandable? Are evidence and examples to support\nargument/ideas selected and explained well? Is a comfortable amount of time spent\non each idea (not too much or too little)? Is there any confusion, or is content\nengaging and compelling to the audience? Was timing rehearsed and organized, so\nthat the conclusion was not rushed? (45%)\n\n- AV AIDS: Are there handouts or other materials that assist understanding? You will\nperform much better and your audience will connect with you and absorb your points\nmore readily if you present a decent handout, use the blackboard, or present PPT\nslides to break content into digestible segments for your audience. This is an effective\nway of helping you organize your priority points.\n(25%)\n\n- STYLE: How effectively does the student communicate his/her ideas, questions, and\ninsights? Performance is key. Is the presenter engaged? Is presenter standing tall and\nwell balanced on both feet, dressed appropriately (taken her/himself seriously as\npresenter/professional) and used her/his hands well for emphasis (not shoved them\ninto pockets)? Has she modulated and projected her voice and made certain everyone\ncan hear well? (Practice this at home!) Has she presented her material with genuine\nconfidence, made interesting comparisons, used humor when appropriate, and made\nan effort to relax her audience and interact with them? Did she earn audience respect?\n(30%)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ICTs and Democracy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/b211e6324b53c4d8d9a02b6c0cc330d7_MIT21G_034F05_ictanddemocr.pdf",
      "content": "ICTs and Democracy\nFawah Akwo\nYonatan Tekleab\n21G.034\nNovember 29, 2005\n\nDigital Democracy\n\nRepresentative Democracy\nImage removed due to\ncopyright reasons.\n\nProblem\n- Public becoming disinterested in political\naffairs\n- Detachment from political parties\n- Public becoming more complacent\n- Criticism: More opportunities for criticism,\ndeliberation, and decision making\n\nPossible Solution\n- Digital Democracy\n- Limitless information via world wide web\n- Potential for public to become knowledgeable about\npublic affairs\n- More articulate in expressing views via email, online\ndiscussion lists, chat rooms\n- More active in mobilizing around community affairs\n- 2-way communication: citizens AÆ intermediary\norganizations (media, gov't, public organizations)\n\nDemocratization through ICTs\n- Information available\n- Online bulletin boards, chat groups, list serve email,\nmulti-user domains\n- Exchange ideas, debate issues, mobilize\nopinions\n- Facilitate opportunities\n- Electronic voting\n- Promote government accountability\n- Revival of community networks and urban\nneighborhoods\n\nHoward Dean Campaign\n- $ 11 Million raised via internet between April and\nSeptember 2003\n- Develop and update Web pages with engaging\ncontent to encourage repeat visits\n- Register more than 450,000 subscribers\n- 6.5 million emails to supporters\n- Registered thousands of volunteers with easy-\nto-use internet tools for running their own\ncampaigns, recruit others, and solicit\ncontributions\n- Process online credit card donations\nhttp://www.convio.com/\n\nPotential Problems\n- Widen gap between engaged & apathetic\n- Lose traditional face-to-face social networks\n- Dominated by \"big dog\" corporations and media\n- No room for individual input, discussion, debate\n- Technological resources not readily available to\nall\n- Amplify voices of affluent & educated\n- Marginalizing underprivileged & apathetic\n\nVirtual Politics in\nDeveloping Nations\n- Semi-democracies (new governments, not\nestablished)\n- Poor, non-industrialized\n- Weak governments, corruption, weak judiciary\n- Abuse of political rights & civil liberties (e.g.\ncensorship of media)\n- Violence against minority groups, few checks on\ngovernment, economic failure, poverty\n- Often revert back to authoritarian rule\n- Ideally, internet can help by providing a platform\nfor opposing parties, protest groups, & minorities\nseeking to challenge authoritarian regimes\n\nQuestion\n- What do you suspect would be a potential\nproblem when trying to implement digital\npolitics in underdeveloped nations?\n\nVirtual Politics in\nDeveloping Nations\n- Internet regulation by government\n- Example: Censorship of internet in Cuba,\nChina\n- Governments of underdeveloped nations\nusing censorship of internet to their\nadvantage\n- Internet becomes propaganda tool to\nstrengthen govt's rule\n- Denying other parties any chance to present\nopposing views\n\n3 Dimensions of Democracy\n- Pluralistic Competition\n- Among parties and individuals\n- Participation\n- Among equal citizens for election of\nrepresentatives through free, fair, periodic\nelections\n- Civil and Political Liberties\n- Speech, Publish, Assemble, Organize\n\nMapping Digital Politics\nImage removed due to\ncopyright reasons.\n\ne-Governance\n- Internet serves multiple functions\n- Disseminating information about its\noperations and public services\n- Facilitating public feedback mechanisms\n(emails to gov't agencies)\n- Providing direct support for democratic\nprocess (electoral registration, online voting)\n\ne-Governance\nImage removed due to\ncopyright reasons.\n\nThe Virtual Political Party\n\nThe political party\n- Political parties are the core structure mediating\nbetween citizens and the state\n- Differ from other political organizations in that\nthey are capable of:\n- aggregating diverse interests\n- mobilizing activists\n- competing for elected office\n- organizing government\n\nThe problem:\n-\nWeakening partisan identification in the\nelectorate\n- Waning membership rolls\nAre these indicators of the decline and fall of\npolitical parties as mass organizations?\n\nHow can digital technologies help?\n- Multiple websites by dissident parties may\nprovide an invaluable channel of communication\nfor mobilizing critical voices and challenging\nstate propaganda\n- The internet can maximize party competition,\nfacilitating opportunities for insurgents and\nchallengers to communicate their message,\ninform members, and gain visibility than through\ntraditional mass media\n\nParties currently Online\n- Interest groups vs. actual parties\n- Electoral parties: judged by the distribution of\nseats in the lower house of national legislature\n- Major electoral: >20% seats\n- Minor electoral: between 3 and 20 seats\n- Fringe electoral: lack at least 3 seats\n\nDistribution of party websites\n- As of June 2000, 1250 party websites existed in\n179 nations worldwide\n- average of 7 party websites per country\n- Disparities however exist\n- North America: 41 parties online per country\n- W. Europe: 24 parties online per country\n- 45 countries with NO party websites e.g.\nVanuatu, Mali, Benin . These are countries with\npoorer democracies and authoritarian gov'ts\n\nMore disparities\n- Scandinavia alone has more virtual parties than all of\nSub-Saharan Africa\n- Six times as many parties online in established\ndemocracies as compared to non-democracies\n- Eighteen times as many parties online in rich societies\nas opposed to poor societies\n- Data may seem to reflect global inequalities in general\naccess to the internet but there are exceptions; poorer\ndemocracies with minimal public internet access where\nparty websites still proliferate e.g.\n- Argentina with 29 parties online\n- India with 20 and S. Africa with 18\n\nThe types of parties online\n- Percentages within parties:\n- fringe parties: 37%\n- minor parties: 47%\n- major parties: 52%\n- The internet provides a more level playing field\nfor party competition than traditional mass media\n- Neither size nor ideological orientation\ndetermine the proportion of parties online\n- Rough political balance on the Internet\n\nFringe Parties\n(%)\nMinor parties\n(%)\nMajor parties\n(%)\nAll (%)\nExtreme left\nSocial\nDemocrat\nGreens\nCenter\nLiberals\nChristian\nDemocrats\nConservative\nNationalist (far\nright)\nOthers\nAll\n\n- The above table showing the distribution of websites\nby family provides evidence that there is no clear\nbias toward either the \"left\" of \"right\"\nÆ Rough political balance exists on internet\nÆ The Internet can provide a flourishing\nenvironment for groups that are currently\nmarginalized in the traditional mass media\nÆ Even though mainstream parties are more\ncommonly online, many minor and fringe\nparties on from the extreme left and right have\ndeveloped and online site for political\nexpression, mobilization, and organization.\n\nFunctions of Party Websites\n- Websites are classified according to their:\n- Information transparency\n- Communication Interactivity\n- Some party websites are very sophisticated while others\nare barely developed\n- Despite such discrepancies, there is no clear bias online\ntoward either the \"left\" or \"right\"\n- Again: a rough political balance exists on the Internet\n\nWhat affects the distribution and function of\nparty websites?\n- The type of political system in respective countries:\nOlder democracies vs. Transitional democratic\nsocieties\n-\nTechnological diffusion - proportion of population\nonline followed by socio-economic development\nNOTE:\nThe level of democratization has nothing to do with\nall this.\n- Overall, the process of democratization more than\ndemocracy has affected the presence of parties on\nthe net\n\nDiscussion Questions\n- If a direct democracy system could be\nimplemented, would it necessarily be\nbetter?\n- What will be the overall impact of the\ninformation society on governments and\ncivic society?\n- Can ICTs help restore public confidence in\npolitical the party system?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Is there a digital divide?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/c0e649d3de6ae1975895364b1e07435a_MIT21G_034F05_bridginanyth.pdf",
      "content": "Is there a digital divide?\nBilha Ndirangu and Marta Luczynska\n21G.034: Media, Education, and the\nMarketplace\nProfessor Shigeru Miyagawa\nSeptember 27, 2005\n\nOutline\n- What is the digital divide?\n- Domestic divide\n- International divide\n- Conclusion\n\nWhat is the digital divide?\nThe Oxford English Dictionary defines the \"digital\ndivide\" as:\n\"The gulf between those who have ready access\nto current digital technology and those who do\nnot; the perceived social or educational\ninequality resulting from this.\"\n\nOverview of Technology in the US\n- Telephones\n- Computers\n- Internet Access (1998)\n59.1% of population is online\nThere are 166 million internet users in the US - this\nrepresents 27% of the world's internet users\n\nNotes on Technology in the US\n- It is clear that the US has made great\nadvances in technology\n- The US has some of the highest internet\npenetration rates in the world\n- How is the distribution of internet access\nwithin the US?\n\n- Factors determining computer ownership\nand internet access:\nIncome\nRace/Origin\nEducation\nHousehold Type\n\nIncome\n- Households with an income > $75,000 are\nmore 7 times more likely to have internet\naccess than households earning < $10000\n- Low income rural households have a 2.9%\ninternet access rate compared to high\nincome urban households 62%\n\nIncome (cont'd)\n- Disparity exists even when race and family\nstructure are the same :\nA two-parent hispanic family earning\nmore than $35,00 is 6 times more\nlikely\nto have internet access than a similar\nfamily earning <35,000\n\nRace/Origin\n- Computer ownership & Internet Access\nAsian/Pacific islander - 55% , 36.6%\nWhite Households -46.6%, 29.8%\nBlack Households - 23.2%, 11.2 %\nHispanic households - 25.5%, 12.6 %\n\nEducation\n- Households with a college degree or\nhigher are 16 times more likely to have\ninternet access than those with elementary\neducation\n- Disparity greater in rural areas\nCollege degree holders are 26 times more\nlikely to have internet access than those with\nelementary school education\n\nHousehold Type\n- Single parent households lag in computer\nownership\n61.8% ownership in two parent households\n31.7% computer ownership in female headed\nhouseholds\n\nImportant Notes\n- The digital divide is expanding\nThe rate of internet access growth among\nleading groups is faster than those with lower\naccess\n- Education and Income are the main\nelements driving the digital divide\n\nInternational Digital Divide\n- Technology Disparities (1998)\n- Internet Users and Personal Computers\n(2000)\n- Africa vs. United States (2004)\n- Factors Affecting the International Digital\nDivide\n\nTechnology Disparities\n- Telephones\n- In 1998, there were 146 telephones (per 1000 people)\nin the world\n- 19 (per 1000) in South Asia\n- 3 (per 1000) in Uganda\n- Mobile Phones (1998)\n- 55 (per 1000 people) had mobile phones worldwide\n- 1 (per 1000) in either South Asia or Uganda\n\nTechnology Disparities\n- Computers (1998)\n- 70.6 PCs (per 1000 people) worldwide\n- 311.2 (per 1000) in developed countries\n- 2.9 (per 1000) in South Asia\n- 0.75 (per 1000) in Sub-Saharan Africa\n- 0.7 (per 1000) in Mali\n\nWorld Network Map (1999)\nImage removed due to\ncopyright reasons.\nSource: http://www.cybergeography.org\n\nTechnology Disparities (2000)\n- Bandwidth\n- U.S. linked with Europe by 56 Gbps and with Asia-\nPacific region by 18 Gbps\n- Africa linked with Europe with 0.2 Gbps and with U.S.\nby 0.5 Gbps\n- Speed\n- 256Kbps internet connection in South Africa is\nspeedy\n- DSL or T-1 (1.5Mbps) is a minimum small business\nconnection in the U.S.\n\nPercentage of Population\nOnline by Major Region (2000)\nPercentage of the Population Online by Major Region, 2000\n20.4\n7.6\n7.4\n3.3\n3.1\n0.5\n51.5\n42.8\nScandinavia\nNorth\nAmerica\nWestern\nEurope\nMiddle East\nCentral and\nEastern\nEurope\nAsia\nSouth\nAmerica\nAfrica\n% Population\nSource: Pippa Norris, Digital Divide\n\nInternet Users and PCs (2000)\nComputers\n(per 100 people)\nInternet Users\n(per 100 people)\nSub-Saharan Africa\n9.6\n8.5\nUnited States\n572.1\n440.6\nSource: http://devdata.worldbank.org\n\nInternet Users Worldwide\n(2000)\nInternet Users Worldwide - 2000\n(in millions)\nAmerican\nAsia-Pacific Region\nWestern Europe\nSub-Saharan Africa\nOther\n\nPercentage of Population Using\nNew and Old Media (2000)\nPercentage of Population Using New and Old Media\nPopulation\nOnline\nWeighted\nHosts\nPCs\nRadios TV sets\nDaily\nNewspaper\nMainline\nPhones\nMobile\nPhones\nRegion\nScandinavia\nNorth America\nWest Europe\nCentral and\nEastern Europe\n0.3\nAsia-Pacific\nMiddle East\n0.2\nSouth America\n0.1\nAfrica 0.3\n0.1\n0.5\nNew Media\nOld Media\nSource: Pippa Norris, Digital Divide\n\nComparison Between Africa and\nthe United States (2004)\nImage removed due to\ncopyright reasons.\n(per 100 people)\nSource: http://www.itu.int\n\nFactors Affecting International\nDigital Divide\n- Prices\n- Access costs are almost four times as expensive in\nthe Czech Republic and Hungary as in the U.S.\n- Access Speed and Cost\n- Phone calls are charged by the minute (i.e. slower\ninternet connections Æ higher cost)\n- Technical Training and Human Capital\n- Relevance of Content\n- 78% of all sites and 96% of e-commerce sites are\ncurrently in English\n\nReferences\n-\nNorris, Pippa. Digital Divide - Civic Engagement, Information Poverty, and\nthe Internet Worldwide. Cambridge University Press. Cambridge, United\nKingdom: 2001.\n-\n\"Spanning the International Digital Divide.\"\nhttp://www.bridges.org/spanning/chpt2.html. (September 25, 2005)\n-\n\"How many online?\"\nhttp://www.nua.ie/surveys/how_many_online/index.html (September 25,\n2005)\n-\n\"ICT - Free Statistics.\" http://www.itu.int/ITU-D/ict/statistics/ International\nTelecommunication Union (September 25, 2005)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Peer Editing Questionnaire",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/2e6cdb47d0f1a3d61fb9883006b77617_MIT21G_034F05_peereditnque.pdf",
      "content": "Peer Editing Questionnaire\nMedia, Ed and Marketplace 21G.034 / CMS.930\nSeptember 15, 2005 Diane Hendrix, Writing Tutor\n\nBEFORE YOU BEGIN writer:______________________________\nFor the writer: Briefly explain your goals with your paper and why you have chosen to\nset it up as you did. What aspects of your writing do you need help with? What should a\nreader look for? (make notes here, and turn in to your TA with a finished paper)\n\nFOR the READER reader: ______________________________\n\nWhat is the thesis or argument of the essay, as you can understand it from reading? State\nit in one sentence below.\n\nDiscuss the argument with the writer. Has the writer made a point that is arguable? Is the\nargument focused enough to be supported in a short essay? Could it be sharpened in any\nway? Make notes about your conversation with the writer about how to improve the\nessay's arguments.\n\nBased on the points outlined in the rest of the paper, are the examples and evidence\nadequate to build a convincing argument for the thesis? What other examples might\nhelp? How well constructed is the first paragraph? Does it satisfy the demands for a\nthorough opening to an essay, telling us what the writer's position is and how it will be\naddressed in the essay? Make notes below.\n\nNow to play devil's advocate. Reader should imagine the shape of an argument that\ndisagrees with this one. What evidence or examples could challenge the argument the\nwriter has made here?\n\nThe writer should think about those alternative arguments - does she/he agree or\ndisagree? Make notes for future reference and revision of the paper.\n\nFOR THE WRITER: Which of the two positions or arguments makes the stronger case,\nand which calls for more elaboration?\nFOR THE READER: Does this seem to be a wise choice?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Revising the Draft",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/8d3ac7b5d8c3d378af2086f0d5ec7b37_MIT21G_034F05_revisingdraf.pdf",
      "content": "Revising the Draft\n\nHaving drafted your essay, you have gained the perspective of hindsight. Was the subject\nmatter more complex than you anticipated? Did your preconceived ideas prove less\ninteresting than discoveries you made while writing? Would you like to revise, but feel\nuncertain about how to do so?\n\nHow to revise:\n-\nPut your draft aside. Time away from your essay will allow for more objective\nself-evaluation.\n-\nGet feedback. Since you already know what you're trying to say, you aren't\nalways the best judge of where the draft is clear or unclear. Let another reader tell\nyou. Then discuss aloud what you were trying to achieve. In articulating for\nsomeone else what you meant to argue, you will clarify ideas for yourself.\n-\nConstruct a backward-outline of your essay. Identify the main idea(s) in each\nparagraph. Rank their importance in advancing your thesis. Consider connections\nbetween and among ideas.\n-\nRethink your thesis. Based on what you did in the previous step, restructure your\nargument: reorder your points, cut irrelevancies or redundancies, add\ncomplications and implications. You may want to return to the text for additional\nevidence.\n-\nNow that you know what you're really arguing, work on the introduction and\nconclusion. Make sure to begin your paragraphs with topic sentences, linking\nidea(s) in each paragraph to those proposed in the thesis.\n-\nProofread. Aim for precision and economy in language. Read aloud so you can\nhear stylistic infelicities. (Your ear will pick up what your eye has missed.)\n\nAn example of revision:\nIn 1969, E. B. White wrote a one-paragraph comment on the first moon walk. Eventually,\nWhite took the comment through six drafts. On the next page of this hand-out, you can\nsee his third and sixth drafts. White's main points are underlined. In Draft 6, White gets\nright to the point. He states the problem he's addressing--\"the moon is a poor place for\nflags\"--in his third sentence. In Draft 3, he does not suggest this until the sentence that\nbegins \"Yet,\" and never directly; it is the sum of the large amount of underlined material.\nRevision enabled White to be clearer by articulating concisely and directly an idea that\nwas earlier implied; correspondingly, revision let him move an idea that was clear by the\nmiddle or end of an early draft to the beginning. He also cut his introductory device, the\nbeach trip. The amount of space he devotes to it in draft 3 suggests that White was\nattached to this example. But it prevents him from getting to the point. So he substitutes\nthe bouncy dance, which preserves the playfulness of the trip to the beach but is more\neconomical.\n\nDraft 3:\nPlanning a trip to the moon differs in no\nessential respect from planning a trip to\nthe beach. You have to decide what to\ntake along, what to leave behind. Should\nthe thermos jug go? The child's rubber\nhorse? The dill pickles? These are the\nsometimes fateful decisions on which the\nsuccess or failure of the whole outing\nturns. Something goes along that spoils\neverything because it is always in the\nway; something gets left behind that is\ndesperately needed for comfort or for\nsafety. The men who drew up the moon\nlist for the astronauts planned long and\nhard and well. (Should the vacuum\ncleaner go, to suck up moondust?)\nAmong the items they sent along, of\ncourse, was the little jointed flagpoles and\nthe flag that could be stiffened to the\nbreeze that did not blow. (It is traditional\namong explorers to plant the flag.) Yet\nthe two men who stepped out on the\nsurface of the moon were in a class by\nthemselves and should have been\nequipped accordingly: they were of the\nnew breed of men, those who had seen\nthe earth whole. When, following\ninstructions, they colored the moon red,\nwhite, and blue, they were fumbling with\nthe past--or so it seemed to us, who\nwatched, trembling with awe and\nadmiration and pride. This moon plant\nwas the last scene in the long book of\nnationalism, one that could have well\nbeen omitted. The moon still holds the\nkey to madness, which is universal, still\ncontrols the tides that lap on shores\neverywhere, still guards lovers that kiss\nin every land under no banner but the\nsky. What a pity we couldn't have\nforsworn our little Iwo Jima scene and\nDraft 6:\nThe moon, it turns out, is a great place\nfor men. One-sixth gravity must be a lot\nof fun, and when Armstrong and Aldrin\nwent into their bouncy little dance, like\ntwo happy children, it was a moment not\nonly of triumph but of gaiety. The moon,\non the other hand, is a poor place for\nflags. Ours looked stiff and awkward,\ntrying to float on the breeze that does not\nblow. (There must be a lesson here\nsomewhere.) It is traditional, of course,\nfor explorers to plant the flag, but it\nstruck us, as we watched with awe and\nadmiration and pride, that our two\nfellows were universal men, not national\nmen, and should have been equipped\naccordingly. Like every great river and\nevery great sea, the moon belongs to none\nand belongs to all. It still holds the key to\nmadness, still controls the tides that lap\non shores everywhere, still guards the\nlovers that kiss in every land under no\nbanner but the sky. What a pity that in\nour moment of triumph we did not\nforswear the familiar Iwo Jima scene and\nplant instead a device acceptable to all: a\nlimp white handkerchief, perhaps,\nsymbol of the common cold, which, like\nthe moon, affect us all, unites us all!\n\nplanted instead a banner acceptable to\nall--a simple white handkerchief,\nperhaps, symbol of the common cold,\nwhich, like the moon, affects us all!\nAs you revise your own work, keep the following principles in mind:\n-\nRevision entails rethinking your thesis. Because clarity of vision is the result of\nexperience, it is unreasonable to expect to come up with the best thesis possible--\none that clearly accounts for the complexities of the issue at hand--before\nbeginning a draft, or even during a first draft. The best theses evolve; they are the\nproducts of the kind of precise thinking that is only possible to achieve by writing.\nSuccessful revision involves bringing your thesis into focus--or, changing it\naltogether.\n-\nRevision entails making structural changes. Drafting is usually a process of\ndiscovering an idea or argument. Your argument will not become clearer if you\nonly tinker with individual sentences. Successful revision involves bringing the\nstrongest ideas to the front of the essay, reordering the main points, cutting\nirrelevant sections, adding implications. It also involves making the argument's\nstructure visible by strengthening topic sentences and transitions.\n-\nRevision takes time. Avoid shortcuts: the reward for sustained effort is a clearer,\nmore persuasive, more sophisticated essay than a first draft can be.\nCopyright Laura Saltz, 1998, and the President and Fellows of Harvard College, for\nthe Writing Center at Harvard University.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Tips for Oral Presentations Monday",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/bd866f3e64a120f17a34064be851ef61_MIT21G_034F05_tipsfororalp.pdf",
      "content": "Tips for Oral Presentations: Media, Ed and Mkt\n(Practice deep breathing five minutes prior to presentation to reduce nervousness.)\n\n- Tell us your central idea at the outset.\n- Organize your content into 2-4 engaging points, which you preview for us.\n- Try using a \"hook\" of some kind at the outset: a question you will answer, a\npassionate quote you remember and will explicate; whatever you can imagine that\nworks to pique interest. Test it on a friend: does it hook her?\n- Use your hands expressively (not nervously). Find a comfortable posture and\nagain, practice before a mirror.\n- Use eye contact with the audience, as if you're telling each of us, one by one, the\n\"story\" you are presenting. Confidently you're leading us to a place we've never\nbeen, and we will love it!\n- Assume a friendly reception (softens anxiety), and be personable in presenting.\n- Humor helps and relaxes you as well as your audience.\n- You are playing a role here, as an actor does, so you become a kind of official\nvoice or storyteller. Mimic your ideal speaker, or the vitality and confidence of a\ngood speaker you've heard. Pretend for the moment to be him/her, not yourself.\n- Other speaking goals should include: animation in your delivery; varying tone,\nvolume and emphasis for certain points or turns in your story/argument.\n- Pause (take a breath) for important ideas you want your audience to pay special\nattention to, hear clearly or think about. Silence can be effective punctuation.\n- Don't be afraid of repetition or of unfilled silence. Pausing for emphasis can\nincrease your power as a speaker. A nice pause after making a point or asking a\nrhetorical question intensifies drama and impact.\n- Make a comic aside if appropriate. Add a personal note to drive home a point.\n- Use a prop or visual to help to clarify ideas - and they definitely will, if you use\nthem well. Words alone are not enough these days. A strong visual to clarify an\nimportant idea could be the one thing an audience takes away from your talk.\nPractice using your visuals (images, graphs, maps, powerpoints) comfortably. If\nyou are nervous with them, it will be distracting and can siphon off your power.\nConsider using the blackboard if nothing else.\n- Don't rush; let us think about what you are saying. Comfortable pacing is critical\nfor letting an audience have silent dialog with you. Another reason to rehearse\naloud with a real audience in advance!\n- Practice aloud with a couple of friends to sharpen and organize your content. Ask\nfor their feedback, and don't be afraid of their criticism. The more honest they\nare, the better you will become at this. Practice is critical -- few are \"naturals.\"\n- Be concise and organized. Your main goal is stimulating interest in your evolving\nargument, through a few main ideas and clear descriptive detail. Do not try to\ncover too much territory. Usually students run out of time, which shows how\nlittle they practiced!\n- Plan your conclusion and sum up your ideas with a smile.\n- Wait for questions and maintain a calm, graceful stage presence. You'll improve\nthese skills with practice--like doing scales, gaming, driving, whatever.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "SOME TIPS FOR EFFECTIVE WRITING: Visualizing Cultures 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/00838946b6263defb5890b4f43eb36a2_MIT21G_034F05_tipsforwriti.pdf",
      "content": "GUIDELINES FOR EFFECTIVE WRITING\nDiane Hendrix 9/05\n1. Dismiss any writing myths you've adopted, such as --\nA- You're born a good writer, or B- Anyone can write well. Or C- Writing clearly and persuasively is\neasy. Clear, effective writing takes practice and feedback. Remember, \"Engineers who cannot write\nand speak well wind up working for those who can.\" Tutorials are mandatory (2-3 per term), and I'm\nhere to demystify the writing process and help you improve your writing, no matter how well you write\nwhen the term begins.\n2. When you schedule a 20-minute session with me -- in E38, room 223, Center for International\nStudies -- please prepared with an outline, some paragraphs or a draft to discuss. Bring a question\nabout what needs strengthening, such as organizing your ideas logically, identifying a thesis for an\nessay (answer a question you find intriguing) or unpacking overly complex, confusing or vague\nsentences. Each of our meetings can be for either brainstorming or for editing.\n3. Our goal in writing is to help you develop a sense of mastery over your writing and expression.\nWriting is simply a skill, like driving, and there are rules of the road, which become second nature\nas you practice, giving you confidence. Talking about your writing and ideas increases the\ncomplexity AND clarity of your expression. It is not enough to do it via email. TALKING about\nwriting helps you to figure out your strengths and weaknesses.\n4. On beginning to write: After reading and some thought...\n-\nDecide on one question that intrigues you, and that you have some feeling about. What is the\nanswer to that question?\n-\nThat is the nub of your essay, or your thesis - that is, your answer to a research question on a\ngiven topic. [Topic >> research question >> thesis or answer to Q.]\n-\nWrite notes about 3-4 of your most important points. What evidence supports your\nobservations? What might your peers want to know about this question?\n-\nNow organize your thoughts and evidence, outlining the points you'll make in some logical\nway -- this will change drastically, if you write a good paper and edit it well.\n-\nWrite a draft, revise it and revise it a couple more times (not just minor edits).\n5. While you are writing your first draft, do NOT start editing, or interrupting yourself. Let the ideas,\nquestions, whatever flow FREELY at first. Be kind to yourself. You want to A -- brainstorm first,\nto get your ideas down, then B - edit and reorganize sections, then C -- READ ALOUD, polish,\ncorrect and read it all again & again. Avoid the standard five paragraph formula for essays, or\nmake it meaningful if you do use it.\nDiane Hendrix, Writing Tutor\n\n6. Effective writing is about making a sound and persuasive argument. An argument means\na) expressing a point of view and understanding of an issue you have studied, b) supporting your\npoint of view with evidence c) which you interpret for your reader clearly and persuasively.\nHave pity on your reader! Anticipate points she/he may not understand, taking care to explain\nclearly. Then include answers to arguments your reader may have with points you make.\n7. Generally, in your opening, you want to tell us what you will tell us and how; then tell us, (the\nbody of your paper), using evidence, examples and arguments; and finally, tell us what you told\nus, why it's important and what that may lead to (conclusion). Write/revise you OPENING\nparagraph LAST, since only then will you really know what you've done in your essay.\n8. Once you have your major points, evidence and conclusion nailed down, construct your opening\nparagraph with a compelling first sentence. Now you are clear what the paper is about and your\nopening paragraph tells us what your question is, the answer you have decided on, and the reasons\nyou use to support your argument. Support your single idea (only one per paragraph, normally)\nwith examples, visuals, brief quotes or references to events or persons mentioned in the content\nyou've studied. Include only details that bear directly on your claim or argument. The engine\n(power) for this paragraph is your informed conviction and the relevant detail you use to support\nit. The paragraph should be focused , with no irrelevant details. Two or three vivid or convincing\ndetails are better than ten, which can overwhelm. (Less is often more, when explained carefully\nand clearly.)\n9. Once you have written at least one strong paragraph, keep going! Then use the best graphs as a\nmodel for the others. You're making a winning team of arguments, as it were. Be sure to open new\nparagraphs for each new idea; page long graphs suggest you haven't separated ideas. Develop\nyour paragraphs by comparing and contrasting, applying logical analysis, detailing a process,\nusing chronology, or other methods. Don't forget to use transitions between ideas.\n10. For the first assignment, write two pages of paragraphs like the above, double-spaced. [If the oral\nmedium is easier for you for getting your ideas organized, record yourself on tape, then transcribe\nand rework your ideas.] Reading your topic sentences for each graph should lead a reader through\nthe argument of your paper, regardless of length.\n11. Once you have your ideas and arguments formulated, write a complete draft, then another draft,\nthen read it aloud and ask yourself:\n-\nDo I care about the claims that I'm making?\n-\nHave I stated them clearly, concisely and with vivid detail?\n-\nAre my supporting details on point and as strong as they could be?\n-\nIs my central idea interesting (do I have one?), as well as my supporting arguments, taken\ntogether? Do they make sense?\nDiane Hendrix, Writing Tutor\n\n-\nHave I acknowledged alternative interpretations? (This strengthens your argument and\nrespects opposing points of view.)\n-\nBe sure to use active verbs, not passive. Clarify and streamline sentences. No jargon.\n-\nAre there any words that can be deleted? (fewer words increase power and clarity)\n-\nDid I run a spelling and grammar check? Are all awkward or unclear phrases gone?\n12. Make your style consistent and make it in your own voice. Employ words you comfortably use\n(not those you read - don't try to impress, just state clear ideas, simply). Avoid abstract nouns\nwhen possible. Use concrete nouns and few adjectives, with ACTIVE verbs. [avoid sentences\nlike: \"Abstract verbalization is symptomatic of the culture's denial of its personal agency and\nresponsibility.\" - snore.]\n13. Once edited, your ideas should be clearly worded, with illustrative detail to support your\nobservations. They must be tightly constructed with no extra verbiage, awkward phrasing, errors\nof syntax, spelling, or punctuation.\n14. Before you do a final draft, be sure to let someone vet your paper. Use the PEER EDITING sheet\nor some of the ideas there. Find someone with whom you might trade favors. If you are doing an\noral presentation, do a practice run (after you've rehearsed at the mirror) with a friend. Do not fail\nto apply this step. Why do we not let someone read our papers or hear our presentations before\nturning them in? Answers: Time constraints (plan ahead), fear of criticism (that's how we\nimprove), whom to ask and how (simply, with exchange), not enough sleep (do it earlier)...\n15. Finally, REVISE your paper, seriously. Keep the handout on \"Revising the Draft\" for reference\nand find it on Stellar. Examine carefully the improvements E. B. White, a professional writer,\nmade between his third and sixth drafts of a single paragraph. Note his zippy opening line, which\ncaptures the reader. Make us want to read your paper and then hear your arguments. Finally, sum\nup your ideas with an engaging conclusion (and perhaps a nod to what might happen next).\n\nDiane Hendrix, Writing Tutor\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Abstract",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/15c346b1aadc0c1a2f975bbc36edf560_MIT21G_034F05_flite.pdf",
      "content": "Future Leaders in Technology and Engineering\n(FLiTE)\n\nBy Jesus Alvarez\nTabitha Bonilla\nYamicia Connor\nYonatan Tekleab\nEtienne Toussaint\n\nAbstract\n\nFuture Leaders in Technology and Engineering (FLiTE) is a project-based\neducational enrichment program that addresses the disparities in education faced by low\nincome and minority students. We plan to work with 12 students from Cambridge Rindge\nand Latin for three weeks in January 2005. Our program includes traditional math and\nscience lectures and explores these concepts through a group project. However, what\ndistinguishes FLiTE from other educational enrichment programs is that FLiTE focuses\non leadership development in science, technology, engineering and math (STEM) and\nhelps the students to understand the relationship between the STEM fields and public\npolicy. Throughout the three weeks, the students will be introduced to several guest\nspeakers who are leaders in their fields and using their skills to influence public policy\nand encourage change within their own community. We are striving to dispel the notion\nthat these fields are reserved for an elite few and instead to reveal to the students the\nability they have to be original, creative, and innovative. By introducing them to highly\ntechnical disciplines, we hope to encourage the students to take ownership of these fields,\nso that they feel enabled to use these skills to promote change within their own\ncommunity.\n\nFLiTE is scheduled to begin on January 16 and to end on February 6. Recruitment\nand admission for the program will be conducted in early December 2005. The program\nwill cost approximately $4,600. The students will meet with project coordinators after\nschool for ninety minutes, Monday through Thursday at Cambridge Rindge and Latin\nHigh School. On Saturdays, the students will attend four-hour workshops at MIT, where\nthey will construct their project.\n\nOur team is composed of five undergraduates from the Massachusetts Institute of\nTechnology. With diverse technical backgrounds, we are eager to use our knowledge to\neducate our surrounding community.\n\nIntroduction\nIn 2000, over 75 percent of African American and Hispanic tenth grade students\nin Massachusetts failed both the math portions of the MCAS exam; whereas less than 40\npercent of their White and Asian counterparts failed the same exams. There exists an\nalarming racial disparity within the educational system in Massachusetts. Minority\nstudents are not being engaged in the fields of math and science. The schools are failing\nto demonstrate to theses students how they can use their education to impact their\neveryday lives, leaving the students feeling disengaged and uninterested in school. The\ncommunity is failing these students, restricting not only their educational opportunities,\nbut also their future career options. These students do not have equal access to resources\nthat are critical for their educational development, and their math and science skills are\nfar behind their peers, excluding them from careers in math, science, and technology.\n\nProject Plan\nWe will recruit minority students from Cambridge Rindge and Latin through a\ncomprehensive application process in December 2005. (See Appendix A.) Accepted\nstudents will be notified through mail and by telephone on 2 January 2006. We will meet\nwith the students after school, Mondays through Thursdays for ninety minutes. On\nSaturdays, we will hold four-hour workshops at MIT.\nThe theme for this year's program will be innovative and environmentally\nfriendly transportation methods. The students will discuss the role of math and science in\nthe development of environmental public policy. In accordance with this theme, the\nstudents will be given a design project that is an environmentally friendly alternative\n\nform of transportation. The students will then assess the strengths and weaknesses of their\nproject while also considering the strengths and limitations of other forms of\ntransportation. Throughout the program, the relationship between the STEM fields and\npolicy will be reinforced through the engineering design process. The students' project\ndesigns will not only be required to fit basic engineering criteria, but will also have to be\nan environmentally viable solution.\nThe program will commence with an opening ceremony to be held on January 16,\nwhere we will explain the project goals and the curriculum to the students and their\nparents. Week one of the program introduces the project and the design process to the\nstudents. During these sessions, they will use the engineering peer review evaluation\nprocess to assess the advantages and limitations of their designs. The students will also be\nintroduced to public policy, and will be given the chance to discuss the purpose and\nsignificance of the selected project. During this first week, we would like to illustrate the\nrelationship between the STEM fields and public policy. The second week extends the\ndesign process into implementation, and emphasizes the roles of math and science in\ntechnology. The final week examines the various uses of technology and emphasizes its\nrole in society. This week culminates on February 5, with final presentations. The final\npresentation will be in a policy based format, where the students will present their\nprojects as though they are lobbying policy makers to adopt policy that is friendly to their\ntechnology.\nThe program alternates traditional math and science lectures with modules\nfeaturing SolidWorks1 and Matlab2. The computer programs will be used to connect the\n\n1 A program used in design, generally to create models.\n2 An application used to create programs used for data analysis and visualization.\n\nclassroom lessons to the project. Computers also play an important role in introducing to\nstudents various aspects of information technology. Studies have shown that lower\nincome students lack sufficient exposure to technology, limiting their ability to pursue\nmany careers options. One of the goals of our program is to begin to bridge the digital\ndivide in Cambridge by making information technology a vital component of FLiTE.\nAppendix B outlines a more complete list of our weekly goals.\nThe students will be divided into groups of three or four and each group will\ndesign and construct an LTA (lighter-than-air vehicle). Design of the vehicle will take\nplace in the after school sessions, while the LTAs will primarily be constructed at MIT\nduring the Saturday sessions. An LTA, such as a blimp, uses buoyancy to produce lift.\nThe students will use their current knowledge of math and science and other various\nengineering tools in order to conceive, design, implement and operate (CDIO) an LTA.\nThe CDIO strategy, developed by the MIT department of aeronautics and astronautics,\nhas shown to be very successful in teaching engineering students the basics of project\ndesign. The LTA is judged based on its speed, reliability, stability, control, strength and\naesthetic value.\nThrough the design and construction of the LTA, the students will be given a\nperspective into the design process of engineers, while also gaining an appreciation of the\nvalue of team work and leadership. Each week a different student will be assigned the\nrole of team leader. As team leader, he or she will be responsible for insuring that the\nteam accomplishes assigned goals for that week. Leaders will also be responsible for the\ndelegation of tasks and time management. At the end of each week, each team leader will\nmeet with a project coordinator to give an update of their progress and to voice any\n\nconcerns. A more detailed explanation of the project description is included in Appendix\nC.\nLastly, the program helps the students envision future career goals. After\nidentifying several different careers, we show the students ways they can apply the\nmaterial through the perspectives of several guest speakers. The guest speakers offers the\nstudents tangible examples of individuals who are leaders in the STEM fields and who\nhave used their skills to impact change within their local community and, in some cases,\nthe international community. This helps them to envision possible career paths as well as\nto inspire them to take action in the future.\n\nTo improve the accessibility of the program, we will meet at Cambridge Rindge\nand Latin on week days. Saturday sessions will be held at MIT due to spatial needs. A\nsummarized version of the curriculum is included in Appendix D.\n\nTo gauge the effectiveness of our program, we will remain in close contact with\nthe students after the end of our three week session, requesting academic updates from\nthem and offering them academic support throughout the semester. The information we\nwill gather includes term grades, SAT scores and any academic concerns. We are\ncurrently investigating a second component of the program to be completed over the\nsummer or in January 2007, as well as working with Nicole Stark in the Office of\nEngineering Programs to incorporate this program into an activity regularly offered to\narea high school students.\n\nImpact of FLiTE\nIn promoting future leadership in the STEM fields, we hope to encourage students\nto take ownership of these fields so that they feel that they are able to use math and\nscience skills to instigate policy changes within their own community. The program\nstresses the connection between the STEM fields and public policy. We hope that the\nstudents will begin to recognize the ways that math and science are incorporated in the\npolicy decision that affect their daily lives. We want them to understand that these fields\ndo not stand in isolation, but instead form the basis of many policy decisions. Our\nprogram aims to change the dominant perception that the STEM fields are reserved for an\nelite group. Instead, we hope to demonstrate to the students that they have the ability and\npotential to be original, creative, and innovative.\n\nWe will be targeting students from low income and minority families who show\ninterest in the STEM fields, but lack resources and sources of motivation. Inciting the\nstudent's passion through the interactive project-based learning style, we will help them\nform their interests into achievable goals. In addition, by giving the students an exciting,\nnew exposure to the STEM fields, we hope to raise their performance and interest in\nschool. Many times students lose interest in education because they do not see any\nsignificance in the material. Giving the students a vision of how the knowledge they gain\nin school is relevant to society will help recapture their interest in learning. By\ncombining this aspect with the interactive, team-building component of the project, the\nstudents will form a new appreciation for these fields, and will hopefully pursue a path\nthat will allow them to become leaders in their prospective careers.\nBy instilling in the students the idea that these leadership positions are within\n\ntheir reach, we can help them develop their own talents and abilities in order to become\nleaders within their disciplines and communities. The students will take with them the\nskills they have gained in our program, which will provide insight into how they can use\nthese skills to create an impact within their local, and perhaps greater communities.\nThe program curriculum has been designed to encourage students to pursue a\ncareer in the STEM fields, but more importantly, it directs students to take the necessary\nsteps toward becoming successful in any field, whether it be in math, science, public\npolicy or any other discipline. After completing the program, the students will be able to\nrecognize the connection between the basic math and science concepts and real world\napplications. Specifically, the final presentation provides the students with direct\nexperience on how math, science, and technology can be used to mold public policy,\nimpacting change within their own lives and the greater community. In addition, it gives\nthe students an opportunity to share their work with their parents and emphasizes the\nimportance of effective communication in the STEM fields.\nWe would like to demonstrate the value of learning by teaching them how to\ngenerate ideas to solve problems. We hope to build a community of academic support for\nthese students, so that they remain engaged in STEM fields and their application after the\ncompletion of the program.. More importantly, we hope to offer them resources with\nwhich they can further their education. By encouraging the students to take ownership of\ntheir education, we hope they will use knowledge as a tool to enrich and empower\nthemselves. We want them to understand that they have the potential to change the world\naround them.\n\nGoals of FLiTE\nFLiTE has a dual objective. We hope to not only strengthen the student's skills in\nthe STEM fields, but also to help students understand the relationship between public\npolicy and technology. We will demonstrate to the students through lectures and guest\nspeakers the direct impact that the STEM fields have on public policy, affecting their\neveryday lives. This program will expose high-school students with limited access to\nMIT's resources. Many of the students have lived in the area for years, but have never\nstepped foot inside the Institute. Simply having a connection to MIT can stimulate the\nstudents' interest in higher education. Through this program, we can help MIT in its\ncontinual effort to reach out to the community.\n\nChallenges\nEffectiveness of our program is primarily limited by the students' interest in the\nmaterial. If we fail to engage the students' interest, then it will be difficult to teach them\nbasic concepts and almost impossible to inspire them in their career path. To combat this,\nour selection process will need to be conducted rigorously, seeking students that are eager\nto improve their academic standing, but more importantly those that are interested in\nlearning and creating.\n\nA secondary limitation is the potential gaps in the students' math and science\neducation. While the curriculum is built on simple concepts, we must assume some basic\nknowledge in math and science. Due to the rigorous schedule, we will not have a large\namount of time to individually tutor the students if they have high deficiencies in these\nsubject areas.\n\nFinally, our ability to secure access to resources both within Cambridge Rindge\nand Latin and MIT, may limit our success. We are heavily dependent on teacher support\nwithin the high school as well as support from MIT administration and faculty. However,\nthrough our contacts both within the community and at MIT, we are receiving positive\nfeedback and support for our project.\n\nFunding\nFunding for this program will be necessary to supply educational materials for the\nclassroom as well as lab materials for their projects. In addition, the students will each be\ngiven a laptop for the duration of the program. The laptops are necessary for the students\nlearn how to use the engineering software and have been donated by MIT.\nBecause we will be keeping the students after school, we will need to provide\nlunches and snacks. The weekday sessions will be held at the schools, and the Saturday\nsessions will be held at MIT, so the staff will also need transportation to and from the\nschools, along with our teaching equipment. We will also need funding to reserve rooms\nat MIT for the introduction and presentations.\nIn total, the program will cost $5,500. For an itemized budget please see\nAppendix E.\n\nFLiTE Project Team\nOur group is composed of five upper-class students at MIT, majoring in a wide\nspectrum of fields. Most of our group has experience working in programs that teach\nand/or mentor youth. Having previous experience teaching and mentoring students of\n\nthis age is extremely important for understanding what interests and motivates the\nstudents.\n\nJesus Alvarez\n\nJesus is a third-year, Electrical Engineer student from Puerto Rico. Experiences\nwith the Boy Scouts throughout his primary and secondary education gave him an\nunderstanding of project-based learning. In addition, he was involved with teaching\nmentally handicapped children at the Instituto Psicopedagogico de Puerto Rico. Jesus'\nenthusiastic personality will contribute to a success in relaying the information to the\nhigh school students..\n\nTabitha Bonilla\n\nA junior, Tabitha is double majoring in Biology and Political Science. Since high\nschool, she has worked as a tutor through several different programs. Most recently, she\nserved as a residential counselor and teaching assistant for the Minority Introduction to\nTechnology, Engineering, Entrepreneurship and Science (MITE2S) program at MIT. In\naddition to teaching a bi-weekly class, she acted as a pre-college counselor to several of\nthe high-school juniors enrolled in the program. Her experience in MITE2S has inspired\nher to work with other programs, including FLiTE, to inspire change within the local\ncommunity.\n\nYamicia Connor\n\nYamicia is studying chemical engineering and biology and minoring in\n\nBiomedical Technology. Other interests focus on public policy and education. Her future\ncareer goals include medicine and academia. Currently, Yamicia is an instructor in MIT's\nSaturday Engineering Enrichment and Discover (SEED) Academy, teaching high school\njuniors chemical engineering basics\n\nYonatan Tekleab\n\nYonatan will graduate from MIT in February with a degree in Aeronautical and\nAstronautical Engineering. His interests include research in aerospace propulsion systems\nand also teaching/mentoring young students. Yonatan has worked as a tutor with many\nprograms such as MIT's Interphase summer program, SEED Academy, and two MIT\nclasses. He has worked as a tutor at local community centers and at the MIT Tutorial\nServices Room (TSR).\n\nEtienne Toussaint\nEtienne is in his third year as a Mechanical Engineering major. In addition,,\nEtienne is concentrating in Urban Studies and Planning and minoring in Economics. He\nis confident that exploring these fields will allow him to not only learn about the physical\nstructures in society, but also the social, economic, political, and technological forces that\ngive meaning to the everyday lives of men and women in residential, work, and\nrecreational settings. Etienne has engaged in tutoring and mentoring programs since high\nschool and is eager to combine the skills that he learned as a mentor with his technical\neducation.\n\nSupervisor\nOur supervisor for this project is Tobie Weiner, an undergraduate administrator in\nthe department of Political Science. Tobie has been working with us since the conception\nof this project in January 2005. She will be available as an ideas consultant and will help\nus manage the details of the program through the semester and over IAP.\n\nAppendix A: FLiTE Application\n\nFuture Leaders in Technology and Engineering (FLiTE) is a project-based educational\nenrichment program that addresses the disparities in education faced by low income and\nminority students. We plan to work with 12 students in their second year at Cambridge\nRindge and Latin for three weeks in January 2005. FLiTE includes traditional math and\nscience lectures and explores these concepts through a group project. However, what\ndistinguishes FLiTE from other educational enrichment programs is that FLiTE focuses\non leadership development in science, technology, engineering and math (STEM).\nThroughout the three weeks, the students will be introduced to several guest speakers\nwho are leaders in their fields. We are striving to dispel the notion that these fields are\nreserved for an elite few and instead to reveal to the students the ability they have to be\noriginal, creative, and innovative. By introducing them to highly technical disciplines,\nwe hope to encourage the students to take ownership of these fields, so that they feel\nenabled to use these skills to promote change within their own community.\n\nFLiTE is scheduled to begin on January 16 and to end on February 6. Recruitment\nand admission for the program will be conducted in early December 2005. The program\nwill cost approximately $4,600. The students will meet with project coordinators after\nschool for ninety minutes, Monday through Thursday at Cambridge Rindge and Latin\nHigh School. On Saturdays, the students will attend four-hour workshops at MIT, where\nthey will construct their project. FLiTE will be coordinated by MIT undergraduates with\ndiverse technical backgrounds.\n\nPlease read through all of the instructions carefully. Neatly print your answers in black or\nblue ink or type your responses. Submit your application form to the main office of your\nschool by 2 p.m. Tuesday, December 20. If you have any questions, please email\nflite@mit.edu or call 406.788.9549. We will only accept complete applications, so make\nsure that you include the following items:\n\n□ Completed Student Application Form\n□ Parent/Guardian Support Form\n□ Copy of 8th grade report card\n□ Copy of 9th grade report card\n□ Math Teacher Evaluation Form\n(sealed in a business envelope)\n□ Science Teacher Evaluation Form\n(sealed in a business envelop)\n\n□ 8th Grade MCAS scores\n(if you did not take the MCAS,\nplease explain on a separate sheet)\n□ Free Response and Essay\n\nPart I: Applicant Form\n\nGeneral Information\n\nName:\n\nContact Information:\n\nWho do you live with?\n□ My father\n□ My mother\n□ Both of my parents\n□ Guardian\n\nAddress:\n\nHome phone:\n\nStudent cell phone:\n\nStudent email:\n\nPersonal Information:\n\nGender:\n□ Female\n\n□ Male\n\nBirth date:\n\nBirth place:\n\nCitizenship:\n□ American Citizen □ Permanent Resident\n\nEthnicity:\n□ African American □ Asian □ Caucasian □ Latino □ Native American\n\nLanguages spoken:\n\nLanguage most frequently spoken at home:\n\nPart II: Family Contact Information\n\n□ Father\n□ Mother\n□ Guardian\n\nName:\n\nAddress (If different):\n\nBirthplace:\n\nCitizenship:\n\nHighest level of education achieved:\n□ High School Diploma\n□ Associates Degree\n□ Bachelor's Degree\n□ Graduate Degree\nCollege Attended:\n\n□ Father\n□ Mother\n□ Guardian\n\nName:\n\nAddress (If different):\n\nBirthplace:\n\nCitizenship:\n\nHighest level of education achieved:\n□ High School Diploma\n□ Associates Degree\n□ Bachelor's Degree\n□ Graduate Degree\n\nCollege Attended:\n\nPart III: Activities and Interests:\n\nPlease list any academic enrichment programs in which you have participated:\n(Include the year and activities/courses taken)\n\nSummer Programs:\n\nAcademic Year Programs:\n\nPlease list any academic activities in which you are involved:\n(hobbies, sports, clubs, etc.)\n\nWhat classes are you taking this semester?\n\nPart IV: Free Response\n\nWhat is your favorite class/subject area in school? Why?\n\nDescribe your career goals. What do you want to do in and after college?\n\nDescribe an invention you would design to make people's lives easier, healthier or safer. Be\ncreative and explain how you came up with your idea.\n\nWhat describes you? (You can list a few adjectives or write something more about your\ninterests. It's up to you!)\n\nPart V: Using a separate sheet of paper, write a 2 page essay answering the following\nquestion. Typed or hand written is ok.\n\nWhy do you want to participate in FLiTE? What skills, qualities and interests would you add to\nthe program?\n\nPart VI: Agreement\n\nI understand that FLiTE is a three week long program for Cambridge Ringe and Latin students.\nIf accepted, I intend to participate in all of the after-school and Saturday sessions. Because of a\nlimited enrollment, I am aware that my attendance is crucial to the success of the entire program.\n\nStudent Signature\n\nDate\n\nAppendix B: Curriculum Goals\n\nGoals of 1st Week:\nUnderstand the peer review design and evaluation process\n2/3 completion of framework of LTA\nUnderstand shop rules and basic techniques used in constructing the LTA\nUnderstand the basic theories of flight discussed in the first lecture\nLearn to work effectively as a group\nUnderstand the role of a group leader\nUnderstand the basic applications of engineering tools - SolidWorks(r)\nUnderstand the ways that engineering and science are used to solve social problems\n\nGoals of 2nd Week:\nUnderstand basic surface area and volume calculations of 3-dimensional object\nCompletion of the LTA\nBegin to recognize their potential role as leaders in their community\nUnderstand the force balances\nMake a connection between math and science fundamentals and technology\n\nGoals of 3rd Week:\nUnderstand the basic applications of engineering tools - MatLab(r)\nLearn the components of a good presentation\nMake a convincing policy argument\nCreate a PowerPoint(r) presentation to present their LTA during the competition\nUnderstand the trail and error process in the designing process\nLearn how to prepare themselves to apply to college\nDevelop self efficacy skills that will lead to success in college\n\nAppendix C: Project Description\n\nThe students will design a lighter-than-air vehicle (LTA). An LTA uses bouncy force to\nproduce lift. This bouncy force is produced by a gas, contained within the body of the vehicle,\nwhich is less dense than air. For our project, we will be using helium, a non-volatile gas.\nThe following design parameters must be considered when designing the LTA:\n\nStructure\n\nThe students will first design the framework of the LTA. This is the most critical part of\ntheir design because a strong, durable support structure is necessary to contain the gas, to support\nthe batteries, and to carry the control equipment and the payload3. The students will do simple\ntruss analyses to verify the strength of their structures.\n\nMaterials\n- Balsa wood\n- Small motors\n- Propellers\n- Radio control appliance\n- Servos\n- String\n- Epoxy, glue, tape, and other adhesives\n- Weather balloons\n- Helium gas\n\nBalloons\n\nThe students will be using 1m diameter weather balloons as their helium containers.\nBased on their engineering analyses, the students will also choose the number of balloons to\n\n3 Payload is defined as any additional weight carried by the vehicle that is not necessary for its basic function.\n\ninclude in their design. This decision is dependent upon the overall weight of their structure and\nthe weight of the payload. The teams will conduct simple force balance calculations to determine\nthe amount of helium gas required to keep their LTA balanced. Using this value, the students\nwill determine the number of balloons necessary for flight.\n\nPropulsion System\nThe propulsion system will be designed based on two figures of merit: thrust required and\nstability. The thrust required will be due to the drag calculations computed based on the LTA\noverall design and geometry. The calculated thrust requirement will give each team an idea of\nhow many motors they will use. The position and orientation of the motors has an impact on the\nstability of the aircraft. Stability calculations are beyond the scope of the project, so the students\nwill be allowed to study the propulsion systems of other flying bodies to determine if they would\nlike the motors to \"pull\" from the front, or \"push\" from the rear.\n\nControl System\nRemote control equipment will be used to control the LTA. The students will pilot the\nLTA using a remote control transmitter that will control the servos and the motor throttle. The\nstudents will have the decision of maneuvering their vehicles using control surfaces, differential\nthrust, or thrust vectoring. Maneuvering a vehicle using control surfaces means that the vehicle\nwill deflect a surface at some distance from the center of mass, which will induce a moment on\nthe vehicle, causing it to turn. Differential thrust uses multiple motors and varies the thrust of\neach motor so that there is an imbalance of forces acting on the body. This will cause a net\nmoment and turn the LTA. Thrust vectoring uses the concept of reorienting the direction of\n\nthrust. By changing the direction of the thrust relative to the LTA, this will induce a moment on\nthe LTA, causing it to turn.\n\nJudging Criteria\nThe judging criteria will be based on the following scoring algorithm:\n\nPayload Mass (grams)\nSCORE = ------------------------------------------\n\nFlight time (seconds)\nTeams will optimize their designs by maximizing the amount of payload their vehicle carries and\nminimizing the time to complete the course.\n\nRules\nThe rules of the competition are as follows:\n- No other materials are allowed beyond those listed on the materials list\n- The LTA must complete the flight path as determined by the competition organizers\n- The students may not be in physical contact with any portion of the LTA while it is in\ncompetition flight\n- The students may not tamper with the LTA of any other team\n\nAppendix D: Curriculum Outline\nKickoff: Monday, 16 January\n\n6:00 Students and parents arrive\n\n6:05 Buffet style dinner\n\n6:40 Icebreaker\n\n6:55 Presentation begins\na. Introduce coordinators (5 minutes)\nb. Describe Project, Curriculum and Goals (15-20 minutes)\nc. Introduce staff and acknowledgments(10-15 minutes)\nd. Conclusion and Questions (5-10 minutes)\n7:50 Event ends\n\nWeek 1: LTA Design and Assembly\n\nTuesday, 17 January\n\n3:00 Informal Introduction and Discussion\n\n3:20 Introduce Engineering and Environment Policy/Group Discussions\na. Explain engineering\nb. Discuss relevant environmental and energy issues in the local community\nDiscuss the impact of social policy and the purpose of NGOs\n\n4:00 Introduce Project - Design of LTA\n\n4:15 Divide students into teams\n\n4:30 Class ends\n\nWednesday, 18 January\n\n3:00 Issue laptops\n\n3:15 Introduction to SolidWorks(r)\n\n4:30 Class ends\n\nThursday, 19 January\n\n3:00 Physics of Flight\na. Unit Conversions\nb. Taking Measurements\n\n3:20 Design Process\na. Students define project goals\nb. Figures of Merit (FOM)\n\n3:45 Group work on their design\n\n4:30 Class ends\n\nFriday, 20 January\n\n3:00 SolidWorks(r) - CAD Modeling\n\n4:00 Peer Review Evaluation Process (PREP)\n\n4:20 Students prepare a task list before beginning shop work\n\n4:30 Class Ends\n\nSaturday, 21 January\n\n9:30 Breakfast/ Review shop rules\n\n10:00 Shop training\n\n10:30 Work on project\n\n1:15 Lunch and project updates\n\n2:00 Students leave\n\nWeek 2: LTA Assembly and Analysis\n\nMonday, 23 January\n\n3:00 Guest Speaker - engineering perspective\na. Focusing on connections between engineering and social enterprise (ie how\nengineering can be used to make a positive change in the community)\nb. Demo or video incorporated\n\n4:00 Class Discussion - How does the demo/ presentation connect to policy\n\n4:30 Class ends\nTuesday, 24 January\n\n3:00 Math lecture - surface area and volume of simple 3D objects\n\n3:20 Math assignment\n\n4:00 Project feedback\n\n4:30 Class ends\n\nWednesday, 25 January\n\n3:00 College informational session\n\n3:45 Leadership workshop\n\n4:30 Class ends\n\nThursday, 26 January\n\n3:00 Physics lecture - force balance on LTA\n\n3:30 Physics assignment\n\n4:10 LTA strategy session\n\n4:30 Class Ends\n\nFriday, 27 January\n\n3:00 Project - Phase II: How can you utilize your design to solve a problem in your\ncommunity? Policy focus\n\na. discuss one example as a class of something that can be done\n\n3:30 Break into teams to begin brainstorming ideas and working on presentation\n\n4:30 Class ends\n\nSaturday, 28 January\n\n10:00 Breakfast/Review session goals\n\n10:30 Work\n\n1:30 Lunch/Group meetings\n\n2:30 Work session ends\n\nWeek 3: Project presentations\n\nMonday, 30 January\n\n3:00 Matlab(r) lecture\n\n3:20 Matlab(r) assignment - assessment of LTA\n\n4:30 Class ends\n\nTuesday, 31 January:\n\n3:00 Self efficacy\n\n3:50 College skills\n\n4:30 Class ends\n\nWednesday, 1 February\n\n3:00 Final presentation PowerPoint and display board\n\n4:30 Class ends\n\nThursday, 2 February\n\n3:00 Conclude work on final presentations\n\n3:30 Guest speaker - Someone speaking from the policy perspective\na. how do you make that connection between science and policy?\nb. Why is it important?\n\n4:30 Class ends\n\nSaturday, 4 February\n\n10:00 Breakfast\n\n10:30 Test flight of LTA\n11:30 Performance assessment\n11:45 Snack\n12:00 Redesign and modification of LTA\n\n2:00 Session ends\n\nSunday, 5 February\n\n4:00 Parents and students arrive\n\n4:05 Light dinner\n\n4:25 Presentation begins\na. Welcome parents\nb. Students introduce projects (7-8 minutes per team)\n\n5:00 Competition begins\n\n6:00 Concluding remarks\n\n6:15 Presentation ends\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Abstract",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/b64ff1a2621dfac37a92e58690ebf9e5_MIT21G_034F05_zambiancs.pdf",
      "content": "Radio Farm Forum and Afronet:\nLearning from Successful ICT Projects in Zambia\n\nBy: Raja Bobbili and Marta Luczynska\n21G.034 - Media, Education, and the Marketplace\nCase Study Final Project\nProfessor Shigeru Miyagawa and Manish Gaudi\n\nTable of Contents\n\nAbstract............................................................................................................................... 3\nCase Study One: Radio Farm Forum (RFF) ...................................................................... 4\nOverview......................................................................................................................... 4\nBackground..................................................................................................................... 4\nImpact Review ................................................................................................................ 6\nImpact Analysis .............................................................................................................. 6\nPartnerships................................................................................................................. 6\nEducational and Research Institutions.................................................................... 6\nMinistry of Community Development and Social Services ................................... 6\nGovernment of the Republic of Zambia ................................................................. 6\nTarget Group............................................................................................................... 7\nCapacity Building ....................................................................................................... 7\nTechnology ................................................................................................................. 7\nFinances ...................................................................................................................... 8\nLessons Learned Analysis............................................................................................... 8\nImplementation Challenges ........................................................................................ 8\nTechnical................................................................................................................. 8\nMoral/Ethical .......................................................................................................... 8\nEducational/Training............................................................................................... 8\nMiscellaneous ......................................................................................................... 8\nFactors Promoting Program Development.................................................................. 9\nRadio....................................................................................................................... 9\nRadio Listening Groups.......................................................................................... 9\nFeedback ................................................................................................................. 9\nPartnerships............................................................................................................. 9\nFuture Outlook.......................................................................................................... 10\nBeneficiary Feedback.................................................................................................... 10\nConclusions and Recommendations ............................................................................. 11\nCase Study Two: Inter-Africa Network for Human Rights and Development (Afronet). 12\nIntroduction................................................................................................................... 12\nInter-African Network for Human Rights and Development (Afronet)....................... 12\nThe Communication Challenge .................................................................................... 12\nInformation and Communication Technology: Overcoming the Challenge................. 13\nA. Web-based Information Dissemination ............................................................... 14\nBenefits of the website.......................................................................................... 14\nHindrances in web-based Information Dissemination.......................................... 15\nB. E-mail and Newsletter Alerts............................................................................... 17\nC. Internal Use of PC's, LAN and Wide Area Networking...................................... 17\nLessons Learned............................................................................................................ 17\nTechnical Factors...................................................................................................... 17\nInstitutional Factors .................................................................................................. 18\nAdministrative Factors.............................................................................................. 18\nImpact of ICT and Sustainability.................................................................................. 18\nConcluding Remarks......................................................................................................... 20\n\nAbstract\n\nIn many prior case studies, such as e-Choupal (India), PDA-based healthcare (Uganda),\nGrameen telephone (Bangladesh), the effects of ICT have been surprisingly strong on\nsociety. These cases have shown that the introduction of Information and Communication\nTechnology can often have an unprecedented effect on organizational efficiency. In this\npaper, we explore the implementation of ICT to two distinctly different case studies in\nZambia, and point out the major breakthroughs, hindrances and lessons learn from these\ncases.\n\nIn Zambia, a sub-Saharan African country, the use of ICT in the corporate world is very\nrare. Often, the companies that implement any form of ICT are those that are owned and\nadministered by foreigners. Therefore, while ICT has some prevalence in large\ncorporations within Zambia, it never affects the local people because it is used in entirety\nby ex-patriots. However, two cases of exception are the Radio Farm Forum and Afronet.\n\nRadio Farm Forum is a government-initiated ICT project to enable rural farmers to\ncommunicate effectively with the Ministry of Agriculture. This form of ICT\nimplementation has proven to be extremely successful in addressing the common needs\nand problems of resource-deficient rural farmers. Afronet, an international human rights\nnetwork, uses ICT to effectively disseminate information across the world. This case\nproved particularly useful in reducing Afronet's costs, and improving its efficiency.\n\nIn summary, while ICT implementation is rare in Zambia, when it is used appropriately,\nit can have a huge impact on society. This paper explores into these two case studies, and\nanalyzes their success stories. By doing so, it establishes guidelines for ICT\nimplementation in Zambia that could be used by companies or NGOs wishing to initiate\nan ICT-led project.\n\nCase Study One: Radio Farm Forum (RFF)\n\nOverview\n\nThis case study focuses on the Radio Farm Forum (RFF), a program that was produced\nby the National Agricultural Information Services (NAIS) in Zambia in the 1960's as a\nmeans of improving communication between the Ministry of Agriculture and the\nagricultural service staff. The motivation for strengthening this communication link and\nattempting effectively disseminate agricultural information to a large and dispersed\npopulation of rural farmers was to increase agriculture productivity and thereby create a\nform of sustainable economic development for Zambia.\n\nAt the time, information dissemination was primarily done through agricultural extension\nofficers, who would personally visit farming communities and advise them on various\nagricultural topics. Because of transportation difficulties, inadequate funding, and the\nshortage of agricultural extension staff, the current practice was not yielding successful\nresults and proved to be largely ineffective and non-scalable. The solution to this problem\nwas the RFF, which included two main components: a 30-minute radio discussion\nprogram on agricultural problems and techniques, and radio listening groups who would\ndiscuss the problems mentioned in the program and their solutions, implement the\nvarious techniques within their local communities, and communicate all the information\nback to the Ministry of Agriculture.\n\nThe government of the Republic of Zambia, who also provided a large amount of\ntechnical assistance for the program, was the primary source of funding for the RFF,\nalthough the Ministry of Agriculture also provided financial assistance. There were many\nchallenges in implementing the RFF program, including the lack of adequate funding,\nwhich reduces the effectiveness of the program and may ultimately result in the\nprograms' untimely conclusion. However, there were also many successful components\nto the program, including the use of radios as the tool for communicating information.\nOverall, there are many lessons one can learn from this program.\n\nThis case study aims to provide an in-depth analysis of the RFF program to extract those\nlessons and in general highlight the key factors that are necessary for ICT-related\ninternational development work in Zambia. The case study starts with the program's\nhistory, continues on with an analysis of the impact and lessons learned, and concludes\nwith a beneficiary feedback and future recommendations.\n\nBackground\n\nIn the 1960's, officials in Zambia realized that they could not depend on copper exports\nas Zambia's economic mainstay forever and aimed at increasing productivity in\nagriculture to create a form of sustainable economic development [5]. The main problem\nin achieving this goal was how to disseminate agricultural knowledge across Zambia,\nspecifically to the widely dispersed peasant farmer populations. At the time, Zambia had\n\nagricultural service staff who would visit these farming communities and advise the\nfarmers on different agricultural matters. Unfortunately, because of transportation\ndifficulties, inadequate funding, and the shortage of agricultural extension staff,\ndisseminating agricultural knowledge on a personal contact basis was ineffective and not\nscalable to other regions of Zambia. The fact that by 1994 there were about 643,000\nfarming households versus 3,000 extension workers only highlights how infeasible the\ncurrent system was at addressing the growing needs of the farming population [5].\n\nIn response to this situation, in June 1966, a UNESCO Mission on Agriculture\nBroadcasting conducted a survey in Zambia to assess the existing broadcasting facilities\nand determine the adult educational needs with rural communities. The Mission\nrecommended the Radio Farm Forum (RFF) as a means of improving communication\nbetween the Ministry of Agriculture and the agricultural service staff. The RFF would\nincluded two main components: a 30-minute radio discussion program on agricultural\nproblems and techniques, and radio listening groups of 15 farmers, in all agricultural\nareas where farmers are close together, who would discuss the problems mentioned in the\nprogram and their solutions as well as implement the various techniques within their local\ncommunities. The radio program was produced by the National Agricultural Information\nServices (NAIS) and broadcast by the Zambia National Broadcasting Corporation\n(ZNBC) in English and in seven Zambian languages, including Tonga, Lozi, and Lunda.\nThis arrangement gave the farmers the chance to discuss a particular problem that was\nintroduced on the radio among themselves, decide on how and what to do about the\nproblem, determine any clarifications that were needed, and then communicate the\ninformation back to the program producers through the local extension officers [1]. In\nthis sense, a two-way communication system was established between the Ministry of\nAgriculture and farmers in the local communities.\n\nThe original motivation behind the program was to provide a means for the experts at the\nMinistry of Agriculture to communicate agricultural news and technical information,\nincluding the following: new farming methods, new varieties of seed, types and spacing\nof seeds, types and applications of pesticides, types and treatment of crop diseases, and\nanswers to specific questions raised by farmers Additionally, the objectives of the\nprogram [5] included the ability of the listeners to do the following:\n\n1. Correctly apply the technical information received\n2. Correctly identify and describe some of the common crop and animal diseases and\npests\n3. Effectively advise other farmers on good farming practices\n\nThese objectives have remained the same since the inception of the RFFs but only\nbecause there was no in-depth study performed to determine whether these objectives\nshould be modified or extended in any way.\n\nImpact Review\n\nCurrently, there are about 1,440 RFFs in Zambia. These RFFs have had a significant\npositive impact on the lives of farmers in rural communities in Zambia. They have taught\nfarmers how to change and improve their agriculture practices, including how to survive\nthrough droughts, prevent their soil from eroding, and construct more durable storage\nbarns. The success of the RFF program is largely attributed the partnerships with various\neducational and research institutions, the government of the Republic of Zambia, and the\nMinistry of Community Development and Social Services. Without the help of the\ngovernment, especially, the program would not have had sufficient funding for its\ncontinuation. One of the programs greatest assets is its use of radios, which has overcome\nobstacles of distance, literacy, and other factors affecting large scale information\ndissemination. The following impact analysis focuses on how various aspects of the\nprogram contributed to its overall success while the Beneficiary Feedback section\ndescribes in greater detail exactly how the program impacted its rural farmer target group.\n\nImpact Analysis\n\nPartnerships\n\nEducational and Research Institutions\n\nThe success of the RFF is largely attributed to the partnerships it has formed with other\norganizations. RFF is able to provide accurate and relevant technical information because\nof its close relationship with educational and research institutions such as the Zambia\nCollege of Agriculture and the national Council for Scientific Research. Guest speakers\non the RFF include teaching staff and research scientists from these among many other\ninstitutions who can share their expertise in the large field of agriculture.\n\nMinistry of Community Development and Social Services\n\nThe RFF has also had a close relationship with adult literacy programs run by the\nMinistry of Community Development and Social Services. As a results, many of the\nilliterate peasant farmer were taught functional literacy skills such as counting and\nreading so that they could carry out practices described in pamphlets provided as part of\nthe RFF and in radio broadcasts.\n\nGovernment of the Republic of Zambia\n\nFinally, and perhaps most important, the government of the Republic of Zambia was a\nkey participant in the RFF program, providing both technical and financial assistance.\nThis assistance included providing radio sets, batteries on a monthly basis, subsidized\nfertilizer and seed, and pre-paid mail service, so that farmers did not have to purchase\nstamps and envelopes to send in their feedback and reports. Overall, the government\nestablished 1000 RFF groups throughout Zambia and because of its assistance, from 1968\nto 2001, a total of 31 radio programs were broadcast weekly in all the seven local\nlanguages and English [2]. Without the extensive support from the Zambian government,\n\nit is likely that the RFF program would not have gotten off the ground, much less expand\nto all across Zambia and remain in existence for so many years.\n\nTarget Group\n\nThe main target group for the RFFs was the rural non-white farming communities widely\ndispersed across Zambia. The educational levels of these farmers range from a 4th grade\nlevel of education to beyond a 12th grade level of education, with the highest\nconcentration at a 7th grade level of education [5]. Many farmers are unable to go to\nschool because they come from poor families, while some families actually do not permit\ntheir children to attend schools because they do not value education. As a result, many\nfarmers are illiterate. Although the Ministry of Agriculture develops the materials for the\nRFF programs, it is the responsibility of the radio listening groups to gather in the\nafternoons to listen to the programs. They are in charge of determining how meetings are\nrun, how discussions are conducted, and how the discussions are recorded. They are also\nresponsible for communicating their discussions, concerns, and questions back to the\nMinistry of Agriculture and actually putting what they have learned into practice. Their\ninvolvement is integral in the effectiveness of the program.\n\nCapacity Building\n\nAlthough feedback from the farmers to the Ministry of Agriculture is often delayed and\nsometimes lost, when it does go through it provides a means for the farmers to address\nthe concerns of their own communities and in general, communicate with the officials at\nthe Ministry. Also, the general framework of the programs allows for large-scale\ndissemination of ideas and best practices to farmers in all regions of Zambia. Each radio\nlistening group can further disseminate the knowledge they have gained to other members\nof their communities thereby increasing the potential impact of the program. Finally,\nbecause of the involvement of the Ministry of Community Development and Social\nServices, farmers in illiterate communities are being taught functional literacy skills\nwhich provides them with valuable tools they can use to improve the quality of their own\nlives.\n\nTechnology\n\nOne of the best decisions made by the program was to use the radio as a means of\ncommunicating information to farmers in rural areas of Zambia. The radio is an amazing\nform of technology because it does not require literacy, can traverse great distances and\naffect large numbers of people, and is affordable to most citizens in developing countries.\nThe radio does however require batteries and oftentimes repairs. Both of these factors\nposed significant problems throughout the course of the program and are discussed in\ngreater detail in the Lessons Learned section of the report.\n\nFinances\n\nBesides the large amount of financial support from the government of the Republic of\nZambia, the RFF program received additional funding from the Ministry of Agriculture.\nThe Ministry of Agriculture primarily paid for radio air time, although they additionally\nfacilitated many production tasks including recording, producing, and transmitting radio\nprograms.\n\nLessons Learned Analysis\n\nImplementation Challenges\n\nThere were many challenges faced during the implementation of the RFF. Mutava [4] and\nNgangula [5] have identified the following:\n\nTechnical\n\nThe primary technical challenges of the program include the unavailability of radio\nbatteries and the difficulty of getting malfunctioning radios repaired. The recording\nfacilities are often inadequate and ill equipped for various aspects of the program\nproduction process. Also, the radio reception is so poor in some parts of Zambia that\nfarmers in those areas need to tune their radios to frequencies of neighboring countries.\nAs a result, they miss agricultural information that is geared towards their specific area.\n\nMoral/Ethical\n\nMembers of particular religious groups object to certain RFF topics, finding them\ninappropriate or offensive. The Seventh Day Adventists (SDA), for example, object to\nRFF discussions involving tobacco or pigs.\n\nEducational/Training\n\nOne of the key problems from the production end is inadequate training of RFF\nbroadcasters and technicians, and other members of the production staff. On listener end,\non the other hand, the main problem is illiteracy. The printed materials that are provided\nas part of the RFF are often useless in remote parts of the country in which peasant\nfarmers depend solely on listening to the radio since they cannot read.\n\nMiscellaneous\n\nThere are numerous organizations that RFF has to compete with for air time in Zambia\nbecause there is only one national broadcasting station. There is also a wide diversity in\nterms of language and agricultural practices in regions that participate in the RFF making\nit difficult to cater the program to the needs and interest of each region. Additionally, due\nto the inadequate staff size (i.e. number of Agricultural Extension Officers) and\ntransportation difficulties, particularly in the rainy season, supervision of the RFFs is\n\ndifficult to establish in many regions. As a result, it is hard to assess the effectiveness of\nthe RFFs and successful implementation of the radio messages in these regions.\n\nThere were, however, several other challenges that became evident throughout the course\nof the program. During the 1990's, for example, when the multi-party democracy was re-\nintroduced in Zambia, state-oriented pricing and subsidies were abolished [5]. As a result,\nthe Zambian National Broadcasting Corporation increased the cost of transmitting the\nRFF radio programs, which in turn decreased the number of RFF radio programs that\nwere aired. The feedback forms designed as part of the RFF program were often delayed\nand sometimes lost in transit, which resulted in \"stale\" information reaching the\nproducers at the Ministry of Agriculture. Finally, there was no provision of replaying\nradio programs to select groups because all radio programs are controlled at a national\nlevel.\n\nFactors Promoting Program Development\n\nRadio\n\nThe use of the radio as the main mode of communicating information to the farming\ncommunities has proven very successful. The radio is affordable, can reach the large\nfarming population that the extension officers simply do not have the manpower and\nsometimes means of transportation to reach, and it does not require the listeners to be\nliterate.\n\nRadio Listening Groups\n\nThe formation of the radio listening groups has given the farmers a sense of ownership of\nthe project and a s a result, has ensured that the farmers listen to the program and ask\nquestions which are later answered by the staff at the Ministry of Agriculture. The radio\nlistening groups were also really successful because they extended the traditional practice\nof nsaka, or coming together, which was already prevalent in many parts of the country.\nThe radio listening programs, as a result, only enhanced the traditional nsaka and brought\nlarger numbers of people together for the benefit of the whole farming community.\n\nFeedback\n\nAlthough the feedback to the Ministry of Agriculture was often delayed and sometimes\nlost, when it got through, it enabled farmers to get more information on topics covered\nduring the program as well as get their own questions answered. This once again made\nthe farmers feel like they were a part of something and also provided them with the\nmeans of improving their own lives and addressing many of the problems that were\nspecific to their communities.\n\nPartnerships\n\nAs mentioned in the Impact Analysis section, the partnerships that were formed\nthroughout the program have been integral in sustaining the program to this day. Without\n\nthe support of the research and education institutions, the Ministry of Community\nDevelopment and Social Services, and the government of the Republic of Zambia, the\nRFF program would probably not have been able to sustain itself for a year, assuming\nthat it even got off the ground in the first place.\n\nFuture Outlook\n\nThe future of RFF unfortunately does not look promising. The government of the\nRepublic of Zambia does not provide adequate funding for the program and as a result,\nthe program will be hard to sustain. Additionally, many agricultural officers are being\nlaid off because of the on-going restructuring of the civil service and their lack of the\nrequired qualifications without being replaced [5]. This means that ultimately, there will\nnot be an experienced staff to produce the RFF programs.\n\nBeneficiary Feedback\n\nThe RFF program has had an extensive amount of positive feedback from its\nbeneficiaries and has positively changed the lives and behaviors of the farmers involved\nin the program. According to surveys and interviews conducted by Sibalwa [5], many\nsmall-scale farmers first got the idea of mixed farming from RFF programs. Mixed\nfarming is especially important to the peasant farmers who depend on their crops for\nsurvival. One group of farmers who was interviewed said that before they learned about\nmixed farming they had only grown maize. Now, these same farmers grow groundnuts,\ncotton, and watermelons.\n\nWhen asked about the quality of the content of the RFF programs, farmers said that they\nfound the material presented both useful and relevant because it described and helped\nthem cope with real-life situations. The following is a subset of some of the skills that the\nRFF farmers acquired and the knowledge that they gained from the program: soil\nconservation, agro-forestry, using the donkey as a draught animal, and constructing more\ndurable storage barns.\n\nIn terms of the impact the RFF has had on the farmers' agricultural practices, farmers no\nlonger feel the need to continue their slash and burn tactics, which was the main source of\nsoil erosion. The farmers also said that it was through the RFF program that they learned\nhow to prevent their soils from further degrading and eroding. Through the RFF program\nfarmers were introduced to the concept of growing drought-resistant crops in areas that\nare prone to droughts. If it weren't for the RFF program, many of these farmers would\nhave probably died during the next drought season because all of their regular crops\nwould not have been able to survive the extreme heat and lack of water. These examples\nare just a few of the ways in which the RFF program has positively affected its intended\ntargets.\n\nConclusions and Recommendations\n\nThe establishment of the Radio Farm Forum (RFF) has provided a means of\ndisseminating agricultural information to farmers in remote areas of Zambia and has\nprovided the farmers with a mechanism through which to communicate their knowledge,\nconcerns, and questions to the officials at the Ministry of Agriculture. The program has\nbeen largely successful thus far with about 1,440 RFFs in existence in the country.\n\nOne of the main factors that contributed to the program's success is strong program\npartnerships, especially with the government of the Republic for Zambia, who provided\nboth technical and financial support. Another key component to success was the\ninvolvement of the rural farmers through the radio listening groups. The radio listening\ngroups provided the farmers with a sense of ownership of the program and a sense of\nempowerment since the farmers could have their specific questions answered and\nconcerns addressed through the communication link to Ministry of Agriculture officials.\n\nAlthough the RFF program has been largely successful thus far and has positively\nimpacted the lives of many rural farming communities in Zambia, the project lacks\nsustainability because of inadequate funding from the government. There are many\nlessons to learn from this case study but one of the most important ones is that to\nimplement a large scale successful ICT program in Zambia, one has to have a long term\nplan of sustainability, including the sources of the financial support necessary for the\nprogram's continuation and expansion. Once that task is complete, program participants\ncan focus on how to overcome the many challenges covered in detail in the Lessons\nLearned Analysis to improve the effectiveness, efficiency, and impact of the program.\n\nCase Study Two: Inter-Africa Network for Human Rights and Development\n(Afronet)\n\nIntroduction\n\nAs in many of the cases concerning the use of ICT in developing societies, Non-\nGovernmental Organizations often take the initiative to incorporate ICT-led initiatives\ninto society. Most organizations, however, believe that the implementation of such an\ninitiative requires much funding, time and a highly skilled labor force. This case study\nattempts to dismiss this notion by studying a resource-deprived NGO - Afronet Zambia -\nthat takes a very small-scale ICT initiative and sees an enormous return from that\ninvestment.\n\nThe case study focuses on the use of ICT by the Inter-Africa Network for Human Rights\nand Development (Afronet), a vast umbrella organization for human rights in Zambia.\nAfronet leverages the potential of ICT by using it in numerous ways, enabling it to\nincrease its internal efficiency while reaching a much larger client base.\n\nInter-African Network for Human Rights and Development (Afronet)\n\nAfronet was founded in London as a result of the 1993 World Summit on Sustainable\nDevelopment. Growing concerns that African human rights concerns were always\nexpressed by non-Africans provided an opportunity for Afronet to be grounded in Africa.\nThus, Afronet was established in Nigeria and Zambia.\n\nThe goals of the organization are as follows:\n\n- To create a common network for human rights activities and organizations all\nover Africa.\n- To gather and disseminate information on the enhancement of human rights in\nAfrica.\n- To challenge corruption by initiating programs of empowerment and instituting\naccountability at all levels of the African society.\n- To enable African NGO's to be heard in front of international bodies, institutions\nand gatherings devoted to human rights.\n\nIn achieving these goals, Afronet is placed in a difficult position where its day-to-day\nactivities involve facilitating both networking amongst NGOs within Africa and\ncommunicating effectively with international bodies outside of Africa.\n\nThe Communication Challenge\n\nIn overcoming this communication challenge, Afronet published an enormous amount of\nliterature to be sent to its clients across the world. The major ways in which it\ncommunicated with the various stakeholders in the project are:\n\n- Regular position papers that updated its clients on Afronet's current activities and\nfuture plans.\n- Human rights reports that were published to provide a detailed view of different\nhuman rights issues.\n- Quarterly magazines - The Human Rights Observer and The Southern African\nHuman Rights Review, both of which are distributed across the world.\n- Human Rights alerts and press releases were issued for more urgent news. These\nwere published at an average rate of once a month.\n- Until recently, Afronet also owned a Zambian newspaper, called the Monitor,\nwhich disseminated human rights information across Zambia.\n\nAll these publications required printing, processing and mailing. An enormous budgetary\nconstraint was placed due to the fact that most of these materials were to be distributed\nacross Africa, and sometimes, across the world. The annual budget of Afronet was valued\nat 1 million dollars, 50% of which was dedicated towards disseminating human rights\ninformation across Africa through the means listed above.\n\nThe graph below represents the costs incurred by Afronet in communication with its\nextensive clientele base across the world.\n\n20,000\n40,000\n60,000\n80,000\n100,000\n120,000\nCost (US Dollars)\nInternational Mailings\nNewsletters\nLocal Mailings\nNewspaper - the\nMonitor\nNews Alerts\nType of Communication\nAfro-Net Communication Costs\n\nInformation and Communication Technology: Overcoming the Challenge\n\nIn meeting its ever-growing communication requirements, Afronet published more\nmaterials. This involved offering contracts to more printing presses, and doubling its\nalready-mass mailings across Africa. Mailing difficulties between Asia and Africa caused\neven more difficulties, as the rapidly growing number of information requests from Asia\ncould never be met effectively. Seeing the fast approaching budgetary deficit, Afronet\napproached a local Technology consulting firm - Command Technologies - to devise a\n\nsolution. After discussions with the consulting firm, the following ICT initiatives were\ntaken to alienate the communication challenge:\n\n- Web-based Information dissemination - in order to disseminate vast amounts of\ninformation on human rights across the world, a web-site would be constructed\nand updated regularly.\n- E-mail Alerts and Newsletters - For the more urgent news, e-mail notifications\nwould be sent, instead of having physically-mailed Human Rights alerts. Instead\nof annual magazines, recipients would subscribe to e-mail newsletters.\n- Internal use of PC's, LAN and Internet - located across Africa, Afronet needs to\ncoordinate well with its various locations. This would be done by using PCs, LAN\nand wide-area networking.\n\nThese initiatives helped overcome some of the growing challenges faced by Afronet.\nEven with the implementation of ICT, paper-based communication still plays a vital role\nin disseminating human rights information across Africa, since many of its rural clients\ndo not have access to the internet.\n\nA. Web-based Information Dissemination\n\nThe first major step taken in constructing this website was identifying a capable\nwebmaster. Mbinji-Tange Mufalo, the present webmaster and the person responsible for\noverall ICT within Afronet, is at the same time environmentalist and lecturer at the\nUniversity of Zambia Computer Science Department. Once the website was constructed,\nit was hosted by ZAMNET communication systems, the first and the pioneer Internet\nService Provider in Zambia.\n\nWeb-site design by ZAMNET &UNZA\n\nAfronet began to realize the importance of the website very soon. The website was an\neffective and an inexpensive tool for communicating human rights alerts to people from\nacross the world. This provided motivation for expanding the website and increasing its\nfunctionality.\n\nBenefits of the website\n\nWhile overcoming the difficulties in constructing a reasonably functional website was\nfairly challenging, the benefits due to the website were many. Significant cost reductions\nwere seen when the website was made public. The costliest mailings were the ones going\nto Asia, Europe and North America. Now, all the information could be viewed at the\nclick of a button. The costs associated with the website are described in the graph.\n\nCosts Associated with the Website\n2,000\n4,000\n6,000\n8,000\n10,000\n12,000\n14,000\n16,000\n18,000\nConstruction\nWebmaster cost / year\nMaintenance Cost / year\nType of Cost\nCost (US Dollars)\n\nAdditionally, the website provided opportunities for numerous volunteers to volunteer in\nZambia. At this point, Afronet has about four or five volunteers at any given time of the\nyear; all these are made aware of volunteering opportunities through their website.\n\nDonors and national governments are finding it much easier to find Afronet and place\ntrust in it. Having a public domain for disseminating information increased its credibility\nin the eyes of donors.\n\nHindrances in web-based Information Dissemination\n\nSince many of the challenges surrounding the setting-up and maintenance of the website\nwere dealt with effectively, it may be easy to conclude that web-based information portal\nwas a completely successful story for Afronet. However, being based in a developing\ncountry, numerous other factors played a role in hindering the progress made with the\nwebsite.\n\nSince the site was hosted by Zamnet, a local organization, the government used its power\nto tamper the material on the website, especially the content that it viewed as critical.\nThis forced Afronet to change ISP to OneWorld, which offered its space for free. This,\nhowever, added difficulty since connecting with an external server required much more\ntime. In order to solve this problem, Afronet commissioned SANGONeT to mirror the\nwebsite. While this reduced transaction time, it did not prevent the occasional substantial\ndelays in processing a maintenance request.\n\nAnother fundamental problem is keeping the website is that it only addresses a fraction of\nits intended audience. Local Zambian cannot be the target of the site, since they do not\nhave internet access and may not understand English. Therefore, the site was primarily\nviewed by Zambians living abroad, academic institutions, human rights NGOs, students\nfrom tertiary institutions, inter-governmental organizations and civil society. This\n\nnevertheless does not solve the problem of disseminating information through mass\nmailings for the local constituency. While this helped reduce the costs of its newsletters\nand international mailings, it nevertheless did not offer a solution to the astronomical\ncosts involved in local and rural mailings.\n\nHits per Month based on Location\n50,000\n100,000\n150,000\n200,000\n250,000\n300,000\n350,000\n400,000\n450,000\nAfrica\nEurope\nAmerica\nAsia\nContinent\nHits per Month\n\nRegardless of the practical benefits of website, some executive officers at Afronet still\nargue about the viability of the website. Ingrained in the culture is a strong sense of\nsatisfaction from reading physical material that it is oftentimes impossible to view a\nwebsite as being a substitute for that. Yuyo Nachali-Kambikambi, the information officer\nof Afronet doesn't see the website as an alternative for physical information \"most people\nlike hard copy instead of a website\". There is no need for cost reduction, since the\npublication and dissemination of our quarterly magazines are funded anyway and there\nis no subscription fee\". However, others in the executive body disagree with her opinion\ncompletely. As the webmaster says \"Afronet is the most famous human rights\norganization in Southern Africa now, and I suppose that is because of the website as\nwell\".\n\nInstitutional rigidities also reduce the effectiveness of the website. Whenever a change\nneeds to be made to the website, there has to be a majority vote in the executive body.\nThis tremendously reduced the pace at which the website was updated. For the first two\nyears, the website was updated once every six months since institutional rigidities simply\nwould not allow for more frequent changes. This hindered the organization and its goals,\nsince viewers were discouraged from the infrequent changes to the website. This forced\nAfronet to impose a once-in-a-quarter-change, whereby its website would be updated\nonce every three months.\n\nB. E-mail and Newsletter Alerts\n\nThe use of the website was expanded to including e-mails and e-newsletters. Instead of\nweekly mailings to its constituents, Afronet sent its subscribers e-mail newsletters, which\nbecame very popular. Immediately following the dissemination of a newsletter, the\nInformation officer receives around 800 e-mails from people requesting more information\nabout topics covered in the newsletter. On days that the newsletter was not sent, the\naverage e-mail influx would be 300 per day.\n\nC. Internal Use of PC's, LAN and Wide Area Networking\n\nApart from communicating with its constituents using e-mail and web-based information\ndissemination, Afronet also implemented an internal ICT initiative to increase its own\nefficiency. With a USAID donation of $165,000, Afronet invested in 12 workstations, 4\nlaptops and 2 servers. Afronet uses an IBM proxy server for instituting its Local Area\nNetwork. Moreover, all Afronet staff have access to a PC with standard Microsoft\nsoftware, with the exception of accountants, who have special accounting software and\ngraphic designers, who may have special programs to aid them in their work. Where\nneeded, open source software is used to reduce costs. All service stations are connected\nthrough internet service provided by a Zambian ISP called UUNet. The monthly fee for\nthis connection was $4,000, with a set-up fee of $8,000.\n\nAccess to the Local and Wide Area Networks has largely expanded the horizons of the\nAfronet staff. Now, Afronet is able to communicate as effectively with staff from across\nthe continent, as it is with workers in the near-by villages. It has also largely increased\nefficiency, since the staff from across the continent are able to coordinate their efforts.\n\nLessons Learned\n\nIn this highly experimental venture to introduce ICT for human rights activism in\ndeveloping countries, a number of valuable lessons have been learnt. These lessons will\nbenefit not only the larger Afronet in redesigning its ICT-structure, but also the larger\nNGO-community that is considering the use of ICT.\n\nTechnical Factors\n\nTechnical challenges were often hard to overcome. In implementing its infrastructure,\nAfronet realized that constructing a website and disseminating information online is not\neasy. This factors involved here are the maintenance of the server, connection with\ninternet gateway and of course, a reliable internet service provided. These are imperative\nto implementing a web-base information portal.\n\nInstitutional Factors\n\nEven after witnessing the benefits of website and newsletters, some executives in Afronet\nbelieved that the best way to communicate was still the paper-based information. This\nshocking reflection is an example of a rigid institutional sclerosis. Institution-wide\nacceptance of ICT is needed in order to successfully implement an ICT project.\n\nAdministrative Factors\n\nThe website that was constructed was changed only 4 times in the next two years. This is\na factor associated with administrative rigidities. Since the board needed to approve any\nchanges to the website, the website could only be modified when the entire executive\nboard was present. This happened only twice or thrice a year.\n\nImpact of ICT and Sustainability\n\nThere is no doubt that Information and Communication technology has been highly\nimpactful in Afronet's case. The associated cost reduction is portrayed in the graph\nbelow:\n\nCost-reduction after Implementaiton of ICT\n20,000\n40,000\n60,000\n80,000\n100,000\n120,000\nInternational Mailings\nNewsletters\nLocal Mailings\nNewspaper - the\nMonitor\nNews Alerts\nType of Communication\nCost\nPre-ICT cost\nPost-ICT cost\n\nThe graph shows that Afronet's international mailing costs have decreased substantially,\nwhile the costs associated with its local mailings and newspaper publications haven't\nchanged much. The cost of news alerts, which mainly benefited the rural community, was\nalso substantially decreased.\n\nThis case also shows that very little initial investment in ICT can lead to very large\nreturns and high efficiency gains.\n\nCost/Year\n39,000\nReturns/Year\n163,000\n\nThe direct beneficiaries of Afronet's ICT initiative are civil society organization,\nacademics, students and donors with internet access. Other beneficiaries are Afronet staff.\nWith ICT and Wide Area network, they are able to coordinate efforts and disseminate\ninformation to a much larger recipient base. They are also able to discuss issues of\nHuman Rights with people from across the world. The website also seems to attract\ndonors and volunteers from across the world, without much effort from Afronet.\n\nUntil the use of ICT, sustainability was an issue. The ever-growing need for paper-based\ncommunication required more funding. Donor support was guaranteed till a certain point;\nafter that point, donors withdrew their funding, affecting the sustainability of the\norganization. The use of ICT limited this, since donors now saw a reason to invest more\nheavily into an organization that not only reached a wider audience, but reached it more\ncost-effectively.\n\nConcluding Remarks\n\nAs these two case studies have shown, ICTs can have significant positive effects if they\nare implemented within the right context and under the appropriate conditions. The ICT\nuse in Afronet led to a reduction in the company's costs while the ICT use in the RFF\nprogram provided a means of disseminating agricultural information to rural farming\ncommunities dispersed throughout Zambia.\n\nAlthough these two programs had different overall goals - the Afronet program mainly\nfocused on cost reduction while the RFF program aimed at enabling program expansion -\nthere are many lessons one can learn on what factors are integral for a successful\nimplementation of a general ICT program in Zambia. In both cases, the correct choice of\ntechnology had played a significant role in the respective program's success. In Afronet,\nthe realization that the customers already had access to email led to the effective use of\nthe internet as a cost-reducing information dissemination tool. As for the RFF program,\nthe use of the radio, which was low cost, had a large possible area of impact, and did not\nrequire literacy, led to its success as a information dissemination tool to the target poor\nand lowly educated rural farming communities.\n\nAnother important factor contributing to both programs' successes was the effective\npartnerships formed by the program implementers. In RFF, the right partnerships\nincluded the government of Zambia, who provided the financial and technical support\nnecessary for the large scale expansion of the program. For Afronet, on the other hand,\nthe government would not have been the correct partner because of the type of\ninformation that the program wanted to disseminate. The appropriate partnership with the\nUniversity of Zambia was integral to the program's success.\n\nFor the RFF specifically, creating a sense of involvement and empowering the target\ngroups largely contributed to the success of the program. Along the same lines, in both\ncases, the problem came from within a group in Zambia. In ICT and international\ndevelopment projects in general, many potential project ideas come from outside the\ncountry of interest and from people who can only remain part of the project for a limited\namount of time. As a result, the projects have a much higher chance of failure because the\npeople who are directly affected by the project are not involved in its implementation and\nhence to do not have a vested interest in ensuring its sustainability.\n\nFinally, and perhaps most importantly, the key factor for ensuring the success of a ICT\nproject in Zambia and perhaps in developing countries in general, is a plan for\nsustainability, which includes how the program will be funded in the future. The Afronet\nproject, fortunately, aimed at reducing program costs, and since it achieved its goal, it\nactually made a profit through the use of ICTs. Most other ICT projects are not so lucky\nand require a significant source of financial assistance to ensure their continuation and\nexpansion. In RFF, the lack of adequate funding from the government is what prevents it\nfrom being as effective and as efficient as it can be.\n\nReferences\n\n[1] Mumbi, Riedner. \"Insights and Tools for Adaptation: Learning from Climate\nVariability.\" RANET Zambia Project, Zambia Meteorological Department.\nNovember, 2003.\n\n[2] Mutava, D.M. \"A Zambian Experience with Radio Farm Forums.\" Media in\nEducation and Development. December 1987, pp. 150-153.\n\n[3] Ngangula, P.E.C. \"The Use of Radio for Agriculture Development in Zambia.\" Paper\npresented at the seminar on the Role of Distance Education in National\nDevelopment, Natural Resources Development College in Lusaka, 1990.\n\n[4] Nwaerondu, Ndubuisi Goodluck, and Gordon Thompson. 1987. \"The Use of\nEducational Radio in Developing Countries: Lessons from the Past.\" Journal of\nDistance Education 2(2): pp. 43-54.\n\n[5] Sibalwa, David. \"Case Studies of Non-Formal Education by Distance and Open\nLearning.\" Ed. Richard Siaciwena. The Commonwealth of Learning and the\nDepartment of International Development. UK; 2000. Ch. 6, pp. 114-132.\n\n[6] Ministry of Communication, Republic of Zambia. National Information and\nCommunication Policy. Zambia; 2005.\n\n[7] Miller, J. and James T. (August 2000). Assessing the Need for and Potential Nature of\na Regional Policy Secretariat for Information and Communications Technology\n(ICTs) in Southern Africa. Unpublished report prepared for the International\nDevelopment Research Centre (IDRC).\n\n[8] TRASA (February 2001). Workshop on Universal Service / Universal Access, Social\nand Economic Development and Promoting a Regional Framework for Licensing\nPractices (USAID / RCSA Rapid Task Order2.1), 19 - 21 February, Swaziland.\nUnpublished papers.\n\n[9] S.T. Habeenzu And J.S. Munsaka: Discussion Paper: Towards A National\nInformation And Communication Infrastructure Policy For Zambia. Lusaka March\n2001.\n\n[10] SADC (1999). 1999 Theme Document - The Challenges and Opportunities of IT for\nSADC in the new Millennium. Lusaka, Zambia.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Bryant Harrison",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/a704f6fb2fe82cab651f1c47b6c9f48e_MIT21G_034F05_wsisbryantha.pdf",
      "content": "Bryant Harrison\n21G.034\nWSIS Position Paper\n\nSupport for Opencoursewares and Open Source Technologies\n\nTechnology is rapidly growing and developing and as a result improving the lives of\nmillions of people across the world. However, growing equally fast is the disparity between\nthose who are able to use these technologies and those who are not. The digital divide is a\nserious problem with social, economic, and political ramifications for those who are not part of\nthe technological revolution that many are benefiting from today. The United Nations World\nSummit on the Information Society (WSIS) should support efforts that seek to provide\ndeveloping nations that do not have the resources or access to technologies with media to\nparticipate in the global movement toward a more digital and connected society.\nOpencoursewares are effective ways to include the technologically disenfranchised populations\nof the world.\n\nOpencoursewares are a low cost, practical, and effective way to provide much needed\neducational materials for people across the world. They are free materials that can be obtained\ndigitally through the Internet. Many people do not have the money or opportunity to attend a\nuniversity, so providing access to materials will help others learn and stay on the cutting edge of\ntoday's technologies, theories, and at a low cost to the person. Those who are fortunate enough\nto attend universities in the developing world may still not have access to current materials or\nsuch a wide range of materials. Providing access to these materials to students training abroad in\nthe developing world will level the educational playing field and allow the students to compete\nfor jobs and take a more significant role in academia and the global economy.\n\nOpencourseware is directly related to the UN's principles and values. The concepts\nbehind opencoursewares are deeply integrated in the UN Millennium Declaration and the\nUniversal Declaration of Human Rights. One of the fundamental values that the UN considered\n\"essential to international relations\" was equality; in addition, development is an unalienable\nright for nations and individuals (UN Millennium Declaration I.6). Opencoursewares are one\nway of ensuring that anyone can have access to educational materials and have the opportunity to\nlearn. The UN also seeks to extract the positive benefits of globalization, such as including\ndeveloping nations in the global economy, and not just exploiting them for cheap labor.\nCertainly, opencoursewares are a medium for globalization as they involve the exchange of\ninformation across the world. The benefits of OCW are directly in-line with what the UN is\nlooking for in its globalization efforts- the ability to give all nations a common and equitable\nstake in the future (UN Millennium Declaration I.5). The UN took the responsibility for\nmanaging the economic and social development of nations by declaring that it \"must play a\ncentral role\"(UN Millennium Declaration I.6). So it is only fitting that WSIS should support the\nopencourseware idea, since a formal adoption of opencoursewares would put the UN in the\ncentral role of facilitating and encourage the economic and social development of nations\nthrough the opencourseware technology. Perhaps the most blatant reason WSIS should support\nopencoursewares lies in III.20 of the UN Millennium Declaration: \"We resolve further to ensure\nthat the benefits of new technologies, especially information and communication\ntechnologies...are available to all.\" Giving free access to educational materials is certainly a way\nto ensure that the benefits of new technologies can be felt by people across the world. Language\nsupporting opencoursewares can also be seen in the UN Declaration of Human Rights. Article 26\ndeclares that \"everyone has the right to education. Education shall be free, at least in the\n\nelementary and fundamental stages.\" It continues to state \"technical and professional education\nshall be made generally available and higher education shall be equally accessible to all on the\nbasis of merit.\" Opencoursewares actually exceeds the expectations of this declaration by\nmaking education accessible to all people, not just to those who have achieved some level of\nmerit.\nThe member nations have a lot to gain from supporting opencoursewares. Besides\nupholding the obligations that member nations have according to the UN Millennium\nDeclaration and the Universal Declaration of Human Rights, there are other benefits that could\nresult. Billions of people do not have sufficient access to educational materials and are not\nconnected to the rest of the world, as people of the developed world are. There are countless\npeople in the technologically disenfranchised population that lives in every nation that has the\npotential of being the next Einstein, but they will never have the opportunity to reach their full\npotential due to a lack of education and collaboration with others. Supporting opencoursewares\ncould allow each person to blossom and be a major contributor to society. Also, supporting\ntechnologies in developing countries could facilitate collaboration between a member nation and\na developing nation that may not have occurred otherwise. Again, this could lead to increased\nbrainpower on both sides which could benefit both nations. In addition to the economic benefit\nof the developing nation being more integrated into the global economy, a contributing nation\nwould be able to trade and work more closely with the developing nations which typically\noperate at lower costs. This would lead to significant positive economic benefits for both parties,\nas the contributing nation cuts costs, while creating well-paying jobs in the developing nation.\nFinally, no country is free of the digital divide problem, so all countries have populations that\ncould greatly benefit from access to free educational materials.\n\nOpencoursewares address many problems that effect people across the world. Many do\nnot have access to information, especially at a low cost, and opencourseware would be a crucial\nalternative for them. The World Summit on the Information Society should seriously consider\nadopting the idea of opencoursewares as it is directly tied to the mission and background of the\nUN and WSIS.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "CAP - Theresa Eugenio",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/6a7c90fd2297da7b7e8fbd4adc77bd00_MIT21G_034F05_captheresaeu.pdf",
      "content": "Theresa Eugenio\n21G.034\nProject Proposal\n10-17-2005\n\nDigital divides exist on the local scale as well as the global scale. Even within\na community where many of the residents have access to information and\ncommunication technologies (ICT's), there will still be those who are at a\ndisadvantage. K-12 students suffer most in this situation; schools may think they're\nsolving the problem if the infrastructure exists on campus, but, as there is limited time\nduring the already-rushed school day for students to access these resources, they still\ncannot fully integrate the technology into their schoolwork and lifestyle. To increase\naccess, I propose that the computer labs of the Maria Baldwin School in Cambridge\nbe open and staffed during evenings and weekends. However, just because something\nis open does not necessarily mean it's accessible; to that effect, my project would also\ninclude starting a volunteer-staffed shuttle service. Should the project expand, these\nvolunteers could also provide supervision at community centers and libraries in\nareas where the schools themselves lack the infrastructure.\n\nEven within technologically developed countries such as the United States,\nand even within generally developed communities within those countries, a digital\ndivide can and does exist. In any school district in which the students do not\nuniversally have home access to information and communication technologies (ICT's)\nsuch as computers and the internet, it is impossible for teachers to fully integrate\ntechnology into their curriculum. It would be unfair to require a student who lacks\nready access to ICT's to use them in her daily assignments, but, given the state of\ntechnology in society, it is also unreasonable to not train students to incorporate\ntechnology into their lives. A school can have a top-of-the-line infrastructure, but as\nlong as those resources are only available at odd times during the school day, the\ndigital divide cannot truly be bridged. There is a key difference between having\nresources and having accessible resources, and I propose that keeping schools'\ntechnological facilities open outside of school hours, in conjunction with running a\nvolunteer-manned shuttle service among these facilities, community centers, libraries,\nand students' neighborhoods, would take the status of ICT's from the former to the\nlatter.\n\nI would like to implement a trial run of this project at the Maria Baldwin\nSchool, which is a K-8 school in the Cambridge School District, in the spring.\nBetween now and then I would have a lot of preparation work to do. I would spend\nthe fall making the necessary contacts; the most important step would be to meet with\ndistrict and school officials to receive approval to use facilities outside of school\nhours. Once that hurdle was passed, I would recruit staff supervisors as well as parent\nand student volunteers; if necessary, these volunteers would have to be trained to use\nthe technology themselves. During January, I would organize such training and take\ncare of other logistical issues, such as scheduling these staff members and volunteers,\ndrawing up shuttle routes, and coordinating with any community centers or libraries\nwhich might be involved. However, even if all these logistics were taken care of, this\nproject would not be truly successful without detailed input from the students. It must\nbe determined what hours and what locations would be most beneficial to and most\nused by students, and that would take a lot of research. A survey would need to be\ndrawn up and distributed to determine these things so that limited resources could be\ndistributed in a way that maximizes student benefit. This would take place before\nJanuary so that the necessary information would be available when logistics were\nbeing arranged.\n\nI think that increasing the accessibility to ICT's will allow students and\nteachers to view technology as a tool rather than a self-contained entity. As it stands\nright now, many members of the educational community see computers as something\nwhich live in a lab and are visited for an hour a week. My ultimate goal would be for\nthe distinction between \"class\" and \"computer class\" to disappear. I want students and\nteachers to view ICT's the way they would view pencils or books: as tools and\nresources that are applicable in every aspect of the curriculum. The first step this\n\nprogram would have to take towards achieving that goal would be to raise the\nstudents' general computer skills; this could be accomplished during the first few\nweeks of the program through basic tutorials on skills such as e-mail and using search\nengines.\n\nWhen students have access to ICT's as well as the skills necessary to use them,\nteachers would have the freedom to fully integrate ICT's into their classrooms. These\nintegrations would improve every aspect of the student experience; changes could be\nas small as e-mailing out assignments or grades and as large as utilizing the internet\nand presentation software to give the students an almost unlimited source of\ninformation and hands-on experience at skills they will certainly require later in their\ncareers. Interactive multimedia educational software and online resources (such as\nthe math and physics java applets found at http://www.ies.co.jp/math/java/ and\nhttp://www.ngsir.netfirms.com/englishVersion.htm) could be used to better reach out\nto students whose individual learning styles are not always suited to traditional lecture\nand textbook formats.\n\nMotivated students could also use the resources to pursue their own interests.\nRather than being limited to subjects studied in class or covered by the school library,\na student would have an unlimited source of information at her fingertips. Volunteers\ncould organize students into groups based on interests; aided by their group mentors\n(who would ideally be high school or college volunteers) and the resources at hand,\nthe groups could learn more about their topics and develop a way to display their\nfindings to other groups, building real-world skills such as teamwork and presentation\nskills as well as technological skills.\n\nI chose this project because I have witnessed first-hand what occurs when\nthere is widespread- but not universal- access to ICT's among the students of a school.\n\nWhen access is common, many teachers take it for granted and bear no qualms about\nrequiring students to do research on the internet or type their papers. This makes\nassignments very difficult for those who lack home access, and the actual learning\nvalue of the work gets lost in the scramble to find a computer to do it on. However, if\nthe alternative is to completely segregate technology from the rest of the curriculum,\nthe students will not be prepared for a \"real world\" which is becoming more and more\ninundated with technology every day.\n\nI feel my strengths are more general education-based than technology based; I\ndo not know how to program myself, let alone teach someone else how to, and I don't\nknow the first step in creating an infrastructure from scratch. However, one of my\ngoals is to be a secondary educator, and I have invested a lot of time and effort in\nobserving how students learn and figuring out how educators can best suit their needs.\nAs part of MIT's Teacher Education Program, I worked with two seventh-grade\nscience classes at the Baldwin School. One of the primary goals of Baldwin School\neducators is to note that students all exhibit different learning styles. Upon observing\nwhat these styles are, an educator should strive to vary her assignments and teaching\napproaches to cater to them. However, out of practicality, traditional textbook\nassignments and in-classroom groupwork often prevail. A visual learner or a child\nwho learns more effectively on her own are just two instances where technology-\naided learning might be better suited for a student's needs. There are countless\nsoftware and online resources which could be used to this effect, but they cannot be\nused to their full potential unless student access is increased.\n\nThe primary expenditures for this project would be overtime pay for staff\nmembers and any fee a school charges for after-hours use of its facilities. While I\nenvision that the drivers and off-campus supervisors would be parent or older student\n\nvolunteers, I would like to be able to reimburse them for the cost of gas.\n\nAll told, I see this as being a very financially sustainable project. If the\nfacilities were to be kept open an extra twenty-five hours per week (three extra hours\nper weekday, five hours each on Saturday and Sunday), I would expect costs to run\nabout 2000 dollars per month, including overtime pay, facility costs and\nreimbursement for gas. While most grants I have looked into cannot provide money\nto reimburse organizations for staff members' salaries, the fact that this project is\nassociated with a specific school and district allows for the possibility of direct\nfunding from the district. Future levies could also be put on local ballots if the test\nrun proves effective.\n\nI am currently in contact with Mark Kelsey, who is the Technology Integration\nSpecialist at the Maria Baldwin School. Mary Woodilla, the seventh and eighth grade\nscience teacher I worked with at the Baldwin School last year, gave me his contact\ninformation after I discussed my project idea with her.\n\nWhile an ideal world would completely do away with any sort of inequality in\nresources and education, we as a society have yet to come up with a way to\naccomplish that goal. Until then, we must find ways to maximize the accessibility\nand efficiency of the resources which can be acquired. The first step would be to take\nwhat has already been acquired and make it as freely accessible as possible, and I feel\nmy plan to keep facilities open longer and provide transport to and from these\nfacilities helps to accomplish that goal.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Class One- Beginner Intermediate Level",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/2937b5455ba8690503d6212c40c8b602_MIT21G_034F05_ClassOne.pdf",
      "content": "Class One- Beginner Intermediate Level\nAgreeing- \"The messy apartment\"\n\nA:\nThis apartment is so messy.\nB:\nI couldn't agree with you more.\nA:\nWe need to do something about this!\nB:\nDefinitely. What do you suggest?\nA:\nI'll put the trash in the can.\nB:\nThen I will clean up the floor.\n\n*Emphatic words: so\n\nSimilar words to so: very, extremely\n*English Expression: Agreeing\nI couldn't agree with you more\nI think you're right.\nI think what you're saying is true.\nI agree with you.\n* Grammar Point: Need\n\nSimilar verbs- require\n\nContraction of \"I + will\" = I'll\n\nClass One- Intermediate Level\nDisagreeing- \"Birthday Blues\"\n\nA:\nYou have to work at the club tomorrow.\nB:\nThat's out of the question. I already have plans.\nA:\nI'm sorry, but Sammy quit and we need you.\nB:\nBut it's my birthday.\nA:\nMaybe just for a few hours?\nB:\nWell, alright.\n\n*Grammar point:\nAuxiliary verbs: have to\n\nShould, ought to, need to, have to, must\n*English Expression: (disagreeing)\n\nThat's out of the question.\nSimilar expressions: No way. I can't do that. I won't do that.\n*But- transition\n\nSimilar words: yet, however, in contrast\n\nClass One- Advanced Intermediate Class\nGreetings: \"Mid-terms\"\n\nA:\nHey, how (are) you doing?\n\nB:\nNot bad. What's up with you?\nA:\nAh, been crazy busy. This week's been really tough.\nB:\nI hear ya. Same here. Going nuts over my mid-terms.\nA:\nLooks like I'll have to pull an all-nighter tonight.\nB:\nMind if I join you? I'll bring some coffee for us.\nA:\nSounds like a plan.\n\n*Greeting:\nHow (are) you doing?\n\nSimilar expressions: What's up with you?\nWhat's new?\n\nWhat's happening?\nWhat's going on?\n\nHow's it going?\n*Emphatic words:\n\nCrazy- very, extremely, incredibly, immensely\n*English Expression:\nGoing nuts- feeling overwhelmed\nMid terms- mid semester examinations\nTo Pull an all-nighter- stay up all night studying, cramming\nSounds like a plan- sounds good, okay.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "DH-Fieldwork_Proposal marta_graded",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/f101d36e9a0ea6104397b512b3387551_MIT21G_034F05_openzambiama.pdf",
      "content": "Marta Luczynska\n\nProf. Miyagawa\n21G.034\n\nFieldwork Proposal\nOpenZambia: Improving the Quality of\nEducation at the University of Zambia\nAbstract\nMy project uses Internet and Communication Technologies (ICTs) to improve the quality\nof education received by students at the University of Zambia. The first part of the project\ninvolves installing and configuring a mirror site of the MIT OpenCourseWare (OCW)\nwebsite and holding seminars on the history, use, and other details of OCW. This part\nfocuses on providing students and educators with free, open, and easy access to the OCW\nmaterials, materials that would otherwise be unavailable because of low bandwidth, high\ncost internet connection costs, and poor internet connectivity. Educators can integrate the\nMIT course materials available on the OCW website into their curricula and raise the\nquality of education that they provide to their students. The second part of the project\ninvolves the configuration of an iLabs online laboratory and the completion of an iLabs\nseminar, which will allow students from the University of Zambia to remotely carry out\nexperiments that would otherwise be unavailable due to inadequate laboratory facilities\nand prohibitive costs of the required lab equipment. Similar to the motivation behind the\nOCW mirror site configuration, the iLabs online laboratory will allow educators to\nextend and improve their current curricula. The OCW and iLabs seminars will couple by\nfocusing on a single circuits and electronics course. This way, the educators and students\ncan understand how OCW can be used as a resource for course content and how iLabs\ncan be used to run real-time experiments covered in the OCW materials. Both parts of the\nproject aim to introduce students and educators to free educational technology systems in\norder to advance their knowledge and quality of their own lives. I will be leading the\nentire project, which will primarily take place over two weeks of IAP and cost a bit over\n$2000. I installed and configured a mirror site of the OCW website and gave OCW\nseminars to the administrators and students this past summer in Kenya so I am highly\nqualified for the project, having previously done half of the proposed project.\nIntroduction\nAccording to the International Bureau of Education (IBE) and United Nations\nEducational, Scientific, and Culture Organization (UNESCO) there are two main\nuniversities in Zambia: the University of Zambia (UNZA), with nine faculties, and the\nCopperbelt University (CBU) with 6 faculties1. The quality of a university education has\ndeclined significantly over the past few decades. The qualified staff from the universities\nhave moved into other sectors and other countries, where they earn higher salaries and\nexperience better working conditions. IBE and UNESCO further emphasize the\nmagnitude of the rapidly declining quality of education in the following lines: \"Between\n1984 and 1994, the universities lost about 210 lecturers, of whom 60% were Ph.D.\n1 http://www.ibe.unesco.org\n\nholders. Replacement of qualified staff is difficult and costly. Because of the loss of\nacademic staff, the few that are available are over-extended, thus jeopardizing the quality\nof teaching and research.\" In other words, the number of qualified teachers in Zambia has\nbeen declining, decreasing the quality of education that students at the University of\nZambia receive.\nAdditionally, students at the University of Zambia have little access to educational\nmaterials outside their teaching staff, due to prohibitive costs of such materials and low\ninternet bandwidth and connectivity. The cost of laboratories and laboratory equipment is\nsimilarly prohibitive, especially if we take into considerations the fact that these\ninstitutions do not have sufficient funding to provide competitive wages to their staff.\nIn order to address these issues of declining educational quality in Zambia, the project\naims to provide easy and open access to MIT OCW materials through an MIT OCW\nmirror site and set up an iLabs online laboratory at the University of Zambia, the top\nuniversity in the country. MIT OCW is a free and open education resource for faculty,\nstudents, and self-learners around the world. It supports MIT's mission to advance\nknowledge and education by offering a free online publication of MIT course materials,\nincluding lecture notes, videos, and other forms of multimedia. iLabs is dedicated to\ncreating online laboratories and enriching the science and engineering education of\nstudents worldwide by expanding the range of experiments that students are exposed to in\nthe course of their education. With the implementation of an iLabs laboratory at the\nUniversity of Zambia, students can use expensive lab equipment and educational\nmaterials, thereby further improving their educational experiences and the overall quality\nof their education.\nPlan of Action\nThe project will be primarily based in Zambia, although the majority of the preliminary\ndetails, such as logistics, will be planned at MIT. The project will last over the course of\ntwo weeks in Zambia, by which point both the OCW mirror site and iLabs online\nlaboratory as well as their respective seminars will have been completed.\nMIT Timetable\nThe time spent at MIT will include six weeks of gathering materials, making all the\nlogistical preparations, and planning the seminars for Zambia. I will first finalize all of\nthe details on housing, food, and transportation arrangements, the exact dates and times\nfor the mirror site configuration and online laboratory setup and their respective\nworkshops and seminar, and purchase the roundtrip airline tickets. This task involves\ncontacting the administrators at the University of Zambia to determine all the travel and\nevent dates.\nNext, also while at MIT, I will meet with Steve Carson, the MIT OCW Senior Strategist,\nand Jesus del Alamo, professor of Electrical Engineering and Computer science who\nhelped found iLabs. I will work with Steve Carson on getting the external hard drive and\n\nworkshop materials and with Professor del Alamo on the details for setting up the iLabs\nonline laboratory and for running the iLabs seminar.\nZambia\nThe portion over the project in Zambia will include two weeks of setting up the iLabs\nonline laboratory, configuring the mirror site of the MIT OCW website and holding\nseminars for the students and the educators on both iLabs and MIT OCW. Once I arrive\nin Zambia, I will spend the first week installing and configuring the OCW mirror site and\nsetting up the iLabs online laboratory. I will fully test the mirror site and online\nlaboratory to ensure that they are functioning correctly and will then do dry runs of both\nthe OCW workshop and the iLabs seminar.\nDuring the second week, I will hold both the OCW workshop and iLabs seminar. I will\nalso conduct follow-up site visits as necessary and provide ongoing technical assistance\nto the university educators and staff.\nThe timeline of events for the proposed project is as follows:\nNovember 2005\nContact the administrators at the University of Zambia to\n- finalize all details on housing, food, and transportation\n- determine exact dates and times for the mirror site configuration, online\nlaboratory setup, and the workshop and seminar\n- purchase roundtrip airline tickets\nDecember 2005\nMeet with Steve Carson to get the external hard drive and workshop materials\nMeet with Professor del Alamo on the details for setting up the iLabs online\nlaboratory and for running the iLabs seminar\nFinalize all trip details (trip dates, housing, etc.)\nJanuary 2006\nWeek 1: Install and configure the OCW mirror site\nSet up iLabs online laboratory\nFull testing of the mirror site and online laboratory\nDry runs of the OCW workshops and iLabs seminar\nWeek 2: Hold OCW workshop\nHold iLabs seminar\nConduct follow-up site visits as necessary\nProvide ongoing technical assistance\n\nImpact of Project\nWith the successful completion of the MIT OCW mirror site configuration and the\nworkshops, students and teachers will have open and easy access to OCW materials,\naccess that would otherwise be unavailable, due to low bandwidth and limited internet\nconnectivity. The project will also raise awareness about MIT OCW and help students\nand educators realize the full potential of OCW materials.\nWith the successful configuration of an iLabs online laboratory and completion of the\niLabs seminars, students from the University of Zambia will be able to remotely carry out\nexperiments and characterize transistors and other microelectronic devices using the\ninternet (experiments that would otherwise be unavailable due to inadequate laboratory\nfacilities and be prohibitive because of cost). The project will also allow professors to use\nthe iLabs online laboratory to extend and improve their current curriculums.\nThe MIT OCW mirror site and iLabs online laboratory can achieve a significant positive\nimpact on teaching and learning in Zambia by providing students and educators with\namazing educational tools and resources. One of the most amazing aspects parts of this\nproject is that once both the MIT OCW mirror site and iLabs online laboratory are set up\nat the University of Zambia educators and students can continue using them beyond the\ncompletion of the project.\nProject Goals\nMy primary goal for this project is to improve the quality of education of students at the\nUniversity of Zambia. With the help of these free open-source systems, the students from\nthe University of Zambia can advance their knowledge and equip themselves with the\ntools and resources necessary for obtaining employment in the world internet technology\nmarket and for improving their own lives.\nI am focusing on this specific project due to my fascination with Information and\nCommunication Technologies (ICTs) and their applications problems in underdeveloped\ncommunities, specifically issues related to education. This project aims to improve the\nquality of education in sustainable ways. Once educators have these the OCW and iLabs\nresources available, they can continually integrate them into teaching materials, thereby\nteaching at a level comparable to that of world-renowned institutions. Students will also\nhave a wealth of resources available to them with which to improve their own educational\nexperiences. Finally, the project has much potential for growth and expansion. The\nUniversity of Zambia can provide access to its learning materials for other educational\ninstitutions in Zambia, leading to a higher quality of education in Zambia. This model can\nalso be extended to other African colleges and universities, further improving the quality\nof education in Africa and other developing nations. With access to these resources,\nstudents and educators will not only be able to improve the quality of their own\neducations but also their economic, political, and social situations.\n\nTeam Qualifications\nIn the summer of 2005, I traveled to Kenya as part of the Africa Internet Technology\nInitiative (MIT-AITI). MIT-AITI is a student-run initiative which aims to bridge the\ndigital divide between developed and developing nations by sending teams of MIT\nstudents to teach intensive, MIT-style 6-week courses in Java and Entrepreneurship at\nAfrican High School and Universities. An additional component of the summer program\nthis year was working on a pilot program with the African Virtual University (AVU) and\nMIT OCW. As part of the pilot, MIT OCW provided our team with external hard drives\npre-loaded with the complete MIT OCW materials, including all videos and other\nmultimedia and enhanced content. One of my team members and I used an external hard\ndrive to install and configure a mirror site of the MIT OCW web site at the University of\nNairobi, Kikuyu campus in Kenya. Following the mirror site configuration, I held two\nworkshops - one for faculty and one for students - explaining the history, purpose, and\ndetails of MIT OCW and providing a guide on using the MIT OCW materials. Thus I\nhave already performed most aspects of the program I propose in Zambia.\nThe pilot program was very successful. The configuration of the mirror site provides the\nstudents and administrators at Kikuyu campus with open and easy access to all of the\nmultimedia and other materials available on the OCW site. In a few seconds time, a user\ncan stream an entire video lecture from the local mirror site. The workshops were also\nwell-attended, considering the size of the lab facility available, with 15-20 administrators\npresent at the first workshop and 25-30 students present at the second workshop. The\npresentations at the workshops raised awareness about the various aspects of MIT OCW,\nincluding what it is and is not, its purpose, and potential uses.\nThroughout the course of this term, I will work closely with Professor Jesus del Alamo to\ndetermine all the logistics of setting up an iLabs online laboratory at the University of\nZambia. We will also work together on putting together seminars, which outline the\nhistory, purpose, impact, and scope of iLabs and include a live demonstration of using the\nonline laboratory materials.\nAttached is a copy of my resume along with the funding proposal.\nBudget\nThe preliminary budget for the project is as follows:\nExpense\nDescription\nDetails\nCost\nRoundtrip Airfare\nBoston to Lusaka\nRoundtrip flight based\non Orbitz rates\n$1,623\nHousing\nKu-Omboka Backpackers\nHostel & Guest House*\n$7 a night for 14 days\n$98\nFood\nBreakfast, Lunch, and Dinner\n$15 a day for 14 days\n$210\n\nInland Transporation\nTo and From University of\nZambia\n$5 a day for 14 days\n$70\nVisas\nZambia Visa\nOne time fee\n$25\nVaccinations/Medicine Yellow Fever Vaccine (required)\nand Malaria Medicine\nEstimate\n$150\nOne Time Fees\nAirport Tax\nDeparture airport tax\n$20\nIncidental Expenses\nFor 14 days\n$50\nTotal: $2,246\n* Full Housing Address:\nKu-Omboka Backpackers Hostel & Guest House\nPlot 9926, Mankanta Close, P.O.Box 33284\nLusaka, Zambia\nMIT OCW will provide the external hard drive with the Open Course Ware content free\nof charge and I will borrow a projector from MIT for the OCW workshop and the iLabs\nseminar.\nSupervision\nMy supervisor for the project will be Professor Shigeru Miyagawa, my professor in\n21F.034 - Media, Education, and the Marketplace. I will also work closely with Stephen\nCarson, Senior Strategist for MIT OCW, and Jesus del Alamo, professor in Electrical\nEngineering and Computer Science who helped develop iLabs.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "ICTs and Poverty Eradication - Mohamed Haji",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/486d62be0285875b11cc55695d4b6c60_MIT21G_034F05_ictspovertye.pdf",
      "content": "The Developing World and the Role of Information and\nCommunication Technologies\n\nMedia, Education and the Marketplace\n\nPresented by Mohamed Haji\n12/14/05\n\nThe Developing World and the Role of Information\nCommunication Technologies\n\nThere are 4 billion poor people in the world today.1 This is two thirds of the world's total\npopulation. Most of these poor people reside in developing nations where there are\nlimited access to resources. As a result, the developing world today faces challenges in\nmany sectors of the economy. Two key sectors that have been crippled are healthcare and\neducation.\n\nHealthcare is a leading issue in the developing world. Epidemics like AIDS, malaria, and\ntuberculosis have claimed many lives and continue to do so. Fighting these epidemics\nrequires a lot of resources. In such countries where resources are scarce, healthcare\nspending takes away lots of spending that could be allocated elsewhere. Malaria is one of\nthe most lethal tropical diseases. It is estimated that African Nations have spent over US\n$100 billion in the fight against malaria over the last 30 years. Such huge expenditure on\nhealth leaves no much room for anything else.\n\nSimilarly, Education in developing nations is characterized by poor and limited\nresources. Lack of funds, lack of qualified teachers and lack of learning materials are\nonly but a few of the challenges. Illiteracy rates are high in these regions, especially\namong the female population. With education staggering, such nations cannot create the\ncapacity needed to fuel economic growth in a country.\n\nThe questions I will address in this paper are:\n\n1 C.K. Prahalad and Stuart L. Hart, The Fortune at the Bottom of the Pyramid, page 3.\n\n1. How can information and communication technologies (ICT) aid development in Third\nWorld countries?\n2. What are some of the challenges facing ICT implementation in the developing world?\n3. Are there any ICT based cases that have proven successful in enabling development?\n4. How can we overcome barriers to eradicating poverty using ICT?\n\n1. Information and communication technologies can be\nleveraged to enable development\n\nExtensive studies have shown that ICTs are central to any economy today. Information\nand communication technologies are pushing boundaries in all disciplines. In agriculture,\nthere have been drought-resistant crops developed. In biotechnology, animals have been\ncloned. Hybrid cars that are environmentally friendly have been produced. These are just\na few of the transformations enabled by new technologies. Unfortunately, the developing\nworld has had limited contribution in these new fronts. If we harness these existing\ntechnologies we can create ICTs that match local needs and local conditions of\ndeveloping countries. Here are highlights of a few key areas where ICTs can be used to\nsolve existing problems:\n\nAgricultural Productivity\n\nMost Third World economies have been and still are agricultural based. With fast\ngrowing populations, it has been difficult to match production and consumption in these\neconomies. Unpredictable or unfavorable weathers have also led to water scarcity and at\ntimes drought. Moreover, urbanization has created labor shortages in rural areas where\n\nagriculture is centered. With growing populations and shrinking labor sources,\nproductivity has suffered.\n\nTo address low productivity, governments need to encourage innovations that can spur\ngrowth in agricultural output to sustain the needs of the population. Developing nations\nneed to look at alternatives to traditional agricultural practices. Governments need to look\nat better ways of doing irrigation where rains are scarce. In soil management,\nnanotechnologies like zeolites can provide better and more efficient fertilizers.2 As you\nintroduce new and existing technologies, you need to address issues of sustainability. To\nsustain technologies and new farming methods, you require the expertise. Such expertise\ncan include technicians who can repair broken equipment, scientists who can design new\nand better pesticides etc. Without such support services, long term desires in increasing\nproductivity will not be achieved. More important, the government needs to increase\nefficient market access for farmers. This market access will create profit incentives for\nfarmers thus creating capacity to sustain production.\n\nInformation Dissemination\n\nInformation flow is essential as it creates increased knowledge sharing. Knowledge\nsharing can enhance development of best practices in many sectors. In education,\ninformation dissemination can play significant roles. If well established to meet local\nneeds, ICTs can be used to disseminate educational content across borders and across\ncontinents. This sharing may overcome some of the space, time and financial constraints\nin developing nations. I must make clear though that there is need to adopt innovative\n\n2 Calestous Juma and Lee Yee-Cheong, Task Force on Science, Technology and Innovation, UN\nMillennium Project, Innovation: Applying Knowledge in Development, 71\n\ntechnologies that overcome existing bottlenecks. In developing nations, connectivity and\nbandwidth become a limitation to sharing knowledge. It is therefore important to identify\ninnovative ways of bypassing these constraints. Once such bottlenecks are conquered,\nICTs can deliver educational content that is flexible and responsive to the individual in\nthese nations.\n\nTechnology Transfer\n\nCollaboration between the Third World and the developed world can create sustainable\ntechnology transfers. Technology transfers can enable cheap ways of producing goods\nand services in the Third World. Since the purchasing power difference between the\ndeveloped and developing nations is enormous, products generated in the First World are\nhardly affordable to those in the Third World. But we can facilitate transfer of technology\nto the developing nations so as they can use local raw materials and local labor to\nproduce affordable and appropriate goods. In return, the technology owners can charge\nlicense fees to those who borrow the technology. Such efforts can create collaboration\nthat fosters economic growth of developing nations while creating returns for the First\nWorld.\n\nWhile ICTs can create the capacity to strengthen economies, there are factors that limit\ntheir effective use. These limitations are more prominent in developing nations who have\nthe highest need. As the world becomes global, there will be more reliance on technology\nto drive transactions and economic relationships. As a result, those without state of the art\ntechnology will be left behind. It therefore becomes critical to address these barriers to\nICTs urgently before the developed world enters a new era of information technology.\n\nSome challenges in using ICTs\nFirst and foremost, lack of infrastructure is the biggest challenge in employing ICTs to\nsolve development problems. Most developing nations have no adequate infrastructure.\nThere are traditional infrastructures like electricity, water, telephone and roads that are\nessential for any society. Without such resources, there is no business that can thrive and\ncompete well. In many of the developing nations, there are limited basic infrastructures in\nthe big cities and almost none in remote regions. This isolates the rural areas that are key\nproducers of agricultural goods. Therefore a large part of the country goes unutilized\nleading to increased poverty. In addition, lack of newer infrastructure has increased the\ntechnological gap between the developed and developing world. Lack of fiber optics\nnetwork has created low bandwidth crisis in Third World countries. Many developing\nnations rely on limited and expensive satellite communications to connect to the rest of\nthe world. But, most of the technologies today require fast internet connections that\nsatellites cannot provide. Therefore the developing world does not have fundamental\ninfrastructure necessary to further economic growth.\n\nSecondly, governments have been a hurdle for ICT enabled developments. Many of the\ndeveloping nations' governments do not support programs that integrate technologies in\nall sectors of the economy. This is because they have no understanding of how integral\ntechnology is to economic growth. As such, these governments institute policies that\ndiscourage foreign investments. Moreover, governments do not create incentives for\ninnovation and entrepreneurship, two factors that are essential for a sustainable economy.\nICTs need to be flexible and reflective of local needs and local environments to be\n\neffective. Through innovation, scientists and entrepreneurs can find incentives to create\nflexible and appropriate ICTs. If these incentives are not created by the government, then\nICTs cannot meet the needs of developing nations.\n\nScience and engineering education are integral to innovation and entrepreneurship.\nWithout considerable investment in science and engineering, the basic skills necessary to\nsustain ICTs will not exist. In many developing nations, this is the case. Universities lack\nqualified faculty and the facilities needed to create innovations. Furthermore, developing\ncountries do not have well established patent and intellectual property systems that\nguarantee the rights of the inventor. This in turn allows others to infringe on scientists'\ndiscoveries discouraging them to invent.\n\nEmbedded in the above limitations are financial constraints. Limited resources and low\nproductivity have crippled the sustainability of these nations' economies. Further\nfinancial constraints have also been experienced due to greater spending on the AIDS\nepidemics.\n\nTo overcome all these challenges requires innovative technologies that are low cost and\nappropriate to the needs of the locals. Innovative technologies have been used to address\nsome of the needs of these developing nations. I have highlighted two cases that address\nhealthcare and education, two fundamental sectors that are at the core of poverty\neradication.\n\nICT Enabled Developments\n\n1. HealthNet Uganda: The Personal Digital Assistant (PDA) Project\n\nHealthNet Uganda tested the use and usefulness of 40 PDAs by medical practitioners to\nconduct an epidemiological survey on malaria, and to access and use medical reference\ntools and texts. Through a partnership with SatelLife, a non-profit organization based in\nMassachusetts, they used the PDA to collect data and to disseminate information between\nhealth professionals. As it turned out, the PDA made data collection and analysis quick,\neasy and at a fraction of the cost of traditional pen-and-paper survey. The PDA served as\na portable patient log book. It enabled doctors to do diagnosis and check side effects of\ndrugs on the spot.\n\nThe project was successful for various reasons:\n\n9 It addressed an existing need: the lack of information on treatments and disease\nmanagement hinders effective patient care and prevention. Realizing the need for\nmore information to make better informed medical decisions, HealthNet used the\nPDA as a tool.\n9 Identified an affordable and appropriate technology: With the limitations of\ninfrastructure and lack of funds, HealthNet had to identify an appropriate\ntechnology. The PDA used the mobile phone networks bypassing the need for the\nless dense landline network. The PDA is very easy to use and does not require\nextensive training, making it more appropriate for people with limited computer\nskills.\n\n9 Careful selection and adaptation of content: localizing the health content to the\nneeds and environments of Uganda were requirements for success\n9 Created local ownership: by collaborating with local schools and hospitals, the\nproject created a sense of ownership for the locals. This in turn created an\nefficient execution as the locals were interested in seeing the success of the\nproject.\n\nAs we have seen in the HealthNet Uganda project, it is essential to address an existing\nneed when implementing ICT initiatives to address health issues. Choosing an\nappropriate and affordable technology, localizing content and creating local ownership of\nthe project are all key ingredients for success.\n\n2. MIT Africa Internet Technology Initiative\n\nThe MIT-Africa Internet Technology Initiative (MIT-AITI) is an innovative program\ncreated and managed by MIT students. MIT-AITI integrates computers and internet\ntechnology into the education of students in African schools. MIT-AITI achieves this\ngoal by sending MIT undergraduate and graduate students to three African nations for six\nweeks in order to conduct intensive classroom and laboratory sessions. The MIT-AITI\nprogram equips students with programming tools like Java, Linux and PHP. In addition,\nMIT-AITI runs an entrepreneurship course to encourage students to be innovators.\nThrough this course, students get to develop their business ideas. MIT-AITI holds an\nentrepreneurship competition at the end of the course and sponsors the winning ideas'\ninitial phase.\n\nMIT-AITI is a great example where technology transfer between developed and\ndeveloping world can create opportunities for students. Through MIT-AITI, many\nstudents develop ownership of their business ideas and try to implement it. It is important\nto note that MIT-AITI taps into the local minds of the countries they visit and empower\nthese minds to create innovative solutions for their community.\n\nMIT-AITI is similar to HealthNet Uganda since they both address an existing need of the\nlocals. MIT-AITI provides knowledge that students would not otherwise get due to\nlimited resources of their institutions. Moreover, MIT-AITI encourages entrepreneurship\nand innovation, two things that form the basis for economic empowerment to fight\npoverty.\n\nOvercoming Bottlenecks in ICTs\nAs I have shown with MIT-AITI and HealthNet Uganda, successful ICT projects have to\nhave capacity building capabilities. In order to do so, ICT projects have to address\nexisting needs by adopting innovative technologies that are affordable, appropriate and\nflexible to the needs of the locals. To do this, we need to do the following:\n\n9 Educate governments: governments need to realize the power of ICTs in\ncombating development issues. Governments have to actively promote use of\ninformation communication technologies across all sectors of the economy. And\nmore fundamentally, governments have to commit to building infrastructure\nnecessary to carry out ICT projects. Infrastructure is not only physical but also\nacademic. Third World governments have to commit necessary capital to produce\n\nand train scientists, technologists and engineers in order to create a capacity to\ninnovate and invent.\n\n9 Promote Innovation: innovation is at the center of poverty reduction policies. As\nthe United Nations Millennium Report asserts, technological innovation will not\nonly create technological transformations, but its significance will increase over\ntime.3 ICTs can drive innovation if the local needs are matched with existing\ntechnologies. To achieve technological innovation, you have to invest in\nuniversities. Universities are centers for innovation and by investing in them, you\ntap into great sources of ideas that can transform economies. Therefore, there has\nto be dedicated investment from the government and private sector in university\neducation.\n\n9 Create Transferable Technology Platforms: technology in developing nations\ncan be expensive to access and create. It is therefore important to create platforms\nthat can have far-reaching implications on the economy. ICTs are integral to\nmany sectors of the economy and cut across many fields and should therefore be a\nfocus for developing nations.\n\n9 Leverage Existing Technologies: existing technologies like the mobile phone\ncan be leveraged to solve problems. In the case of HealthNet Uganda, PDA was\nthe right technology to address the information gap, because it made use of the\nmobile technology that was more widespread than landline. It is therefore\n\n3 Calestous Juma and Lee Yee-Cheong, Task Force on Science, Technology and Innovation, UN\nMillennium Project, Innovation: Applying Knowledge in Development, 16\n\nimportant to consider existing technologies when drafting solutions to\ndevelopment issues.\n\n9 Include Developing Nations in ICT Initiatives: multinational corporations need\nto consider developing nations when creating new technologies or products. This\nis because the needs in developing countries are very different often times. More\nimportantly, affordability is a big issue since the purchasing power of developing\neconomies is limited. It is therefore important to think of alternatives for the\ndeveloping world.\n\n9 Promote Collaboration: collaboration through technology transfers or\nknowledge sharing can spur huge economic growth in developing countries. The\nMassachusetts Institute of Technology (MIT) has spearheaded knowledge sharing\nbetween academic institutions. MIT, through its OpenCourseWare initiative, has\nput more than half its subjects' content online. This content can be accessed by\nanyone for free as long as they have an internet connection. Such initiatives can\ngo a long way in providing opportunities to those who cannot afford it.\n\nWho are the stakeholders\n\nThe use of ICT to increase economic growth and empower people in developing regions\nhas to be a global movement. As the world becomes increasingly connected, countries\nwill interact economically and socially even more. Therefore, one country's lack of\ncapacity to play on a global scale will be another country's problem. It is therefore\nimperative that we elevate the developing countries to a position where they can\nparticipate and compete in the world economy as countries converge. And as such, the\nfollowing entities have to work together to establish ICT in developing countries:\n\n9 United Nations\n9 Developed and developing governments\n9 Private sector and multinational corporations\n\nConclusion\n\nCreating opportunities for the poor is the key to eradicating poverty and initiating\neconomic growth in Third World countries. While we are very far from eradicating\npoverty, ICTs can provide sustainable and scalable solutions that can advance the cause.\nAs ICTs become more important in an ever increasingly global world, it becomes\nimperative for all stakeholders to address the rising digital divide in the world. It is of\nutmost urgency that we come up with affordable, appropriate and flexible technologies\nthat can stimulate unprecedented economic growths in Third World countries.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Information and Communication Technology Policy in Rwanda",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/bd9084fd06dfc2c1eabbd6889cec51e1_MIT21G_034F05_ictpolicyrwa.pdf",
      "content": "Information and Communication\nTechnology Policy in Rwanda\nA country ripe for ICT development\nBryant Harrison\n21G.034 Presentation\nDecember 13, 2005\n\nOutline\n- Country background\n- Climate for ICT development\n- Government policies\n- Problems encountered\n- Outlook\n\nRwanda\n- Small, landlocked country\n- Gained independence in 1962\n- 90% of people engaged in\nagriculture\n- 64% people in poverty\n- Characterized by civil war and\ngenocide\n- Devastating effects on the\neconomy\nImages removed\ndue to copyright\nreasons.\n\nClimate for Change\n- Highest population density in Africa (320 people\nper km2)\n- Small land area\n- 4th highest growth rate in the world\n- Arable land all in use, productivity\n- No modernization\n- No natural resources\nHighly inefficient and unsustainable!\n\nThe New Rwanda\n- Only resource is the people\n- Switch to ICT driven knowledge-based economy\n- Take leadership in Africa as ICT leader\n- Use this as foundation for development\n- Vision 2020\nPlan for social and economic development\nSeeks to attack underlying problems\nGoal of middle-income country by 2020\n- Poverty 30%\n- GNI per cap from $220 Æ $900\n\nGovernment Policy\n- Attract foreign aid and investment in ICTs\nwith tax breaks\n- NICI Plans\n1st Plan (2001-2005): development of economy\n2nd Plan (2006-2010): strengthening of economy\n3rd Plan (2011-2015): sustain and compete\n4th Plan (2016-2020): consolidate and achieve\n\n1st NICI Plan\n- Policy: context and reasoning\n- Plan: \"8 Pillars\" and their implementations\n- Structure: NITC (thinkers), RITA (implementers)\nImage removed due to\ncopyright reasons.\n\nEducation\n- Kigali Institute of Science and Technology\nHeavily supported by government\nOpened in 1998 with 259 students\nNow almost 4,000 students enrolled\nOffers degrees in Elect., Mech., Civil, Comp.,\nBusiness Admin. and more\nFocus on developing ICT skills, development\nand entrepreneurship\nJob creators NOT job seekers\n\nPrivate Sector\n- Rwanda Terracom\nFounded 2004 to wire Rwanda with PON fiber\nnetwork\nConnected schools, hospitals, and government\nfacilities in Kigali\nAims to connect 5 largest cities by end of 2005\nIn October purchased Rwandatel\nPhone call to U.S. 92 cents/min Æ28 cents/min\nDialup $50-$300 Æ Fiber or wireless (2MB/s)\n$125 with television, Internet and phone\n\nBarriers to Success\n- No existing ICT infrastructure\n- Low literacy rate (48%)\n- Shortage of qualified human resources\n- 90% of people in rural areas\nImage removed due to\ncopyright reasons.\n\nOutlook\n- EASSy submarine cable\ncompleted by 2007\n- Committed government\n- Enthusiastic people\n- Gaining int'l recognition\n- True benefits are long term\nImages removed due\nto copyright reasons.\nQUESTIONS?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Information and Communication Technology Policy in Rwanda",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-034-media-education-and-the-marketplace-fall-2005/0d481f406db084b0f7ae745300e2769d_MIT21G_034F05_ictrwanda.pdf",
      "content": "Information and Communication\nTechnology Policy in Rwanda\n\nBryant Harrison\n21G.034 Case Study\n12/13/05\n\nTABLE OF CONTENTS\n\nIntroduction.......................................................................... 2\n\nOverview..............................................................................2\n\nCountry Background...................................................................... 2\nEconomic Climate Ripe for Development........................................... 3\n\nICT Policy in Rwanda...............................................................4\n\nVision 2020...................................................................................4\n\nThe ICT Plan for Rwanda................................................................6\n\nProgress Made....................................................................... 7\n\nRwanda Terracom.........................................................................8\n\nKigali Institute of Science, Technology, and Management........................9\n\nProblems Faced.................................................................. ..10\n\nOutlook on the Future.............................................................11\n\nConclusion ........................................................................ .12\n\nINTRODUCTION\n\nMost of Africa is underdeveloped and lacks many of the resources that other parts of the\nworld have access to. One of the main resources Africa lacks access to is the Internet,\nwhich is driving a large portion of today's economy. However, the government of\nRwanda understands the direction of the global economy and believes the current\nsituation in Rwanda presents an opportunity to become the leaders of the knowledge-\nbased Internet economy in Africa. The government sees the use of Information and\nCommunication Technologies (ICTs) as the key tool in transforming the economy. Not\nonly does the government believe this is one of the best ways to develop the nation, they\nalso believe it is crucial for the survival of the nation.\n\nOVERVIEW\nCountry Background\nRwanda is a small, landlocked nation in East Africa. Rwanda gained independence from\nBelgium in 1962 amidst ethnic strife between the two main ethnic groups, the majority\nHutus and the minority Tutsis. In 1959 the Hutus overthrew the Tutsi king and began\nkilling Tutsis en masse. Over 150,000 Tutsis fled into exile and many of the displaced\nformed a rebel army, the Rwandan Patriotic Front (RPF). Thirty years of tension sparked\na civil war in 1990 between the RPF and the Hutu-dominated government. The war took\na turn for the worse in April of 1994 when President Habyarimana's airplane was shot\ndown over Kigali. The assassins were unknown, but Hutu extremists used it as an excuse\nto declare genocide against Tutsis and Hutu moderates. Before the RPF could mobilize\nand stop the killing, over 800,000 people were killed. The genocide claimed the lives of\n\nabout 75% of the Tutsi population that was living in Rwanda at the time (about 11% of\nthe total population was lost). The aftermath of the genocide had an additional\ndevastating effect on the population--about two million Hutus fled the country into exile.\nApproximately 750,000 exiles from before 1994 returned, but the genocide resulted in the\nloss of millions of people. Losing this many people obviously had a crippling effect on\nthe nation's economy, which was suffering to begin with. The genocide resulted in the\nreal GDP declining by 60%.\n\nEconomic Climate Ripe for ICT Development\n\nRwanda's economy is primarily agrarian with about 90% of the people engaged in\nagriculture. Most people are involved in subsistence agriculture, primarily growing food\nfor their own use. The country is landlocked and has no major natural resources or\nexports, so its economy is very small. In addition, Rwanda is densely populated, with 340\npeople per square kilometer (highest in Africa and 21st in the world) and all arable land\noutside of national parks is being used for crops. This leads to soil erosion and exhaustion\nand the land is becoming less and less productive. Countries like Holland are denser than\nRwanda but use highly mechanized agriculture, so few in the economy can feed the\nnation. The population growth rate is 3.1% (4th highest in the world) so the problem will\nonly get worse if the current trend continues. With the population increasing and refugees\nreturning, there is constant competition for arable land for use in agriculture. Their needs\nto be a shift in the economy, and many are considering a \"knowledge-based\" economy\nbased on information and communication technologies to be a way to provide economic\ndiversity and make use of Rwanda's large population and overcome their lack of natural\nresources.\n\nSingapore is a perfect example of a country in a similar situation that used a\nknowledge-based economy and ICTs to help drive enormous economic growth. After\nSingapore was ejected from the Malayan Union in 1965, the economy was left with no\nattractive global markets or natural resources to trade, much like Rwanda. All the country\nhad was its people, and the government worked to develop a manufacturing-based\neconomy. After the growth eventually tapered off, the Singaporean government\ncommitted to taking the country to the next level of economic power by focusing on an\nICT based economy. Education in science and mathematics was encouraged and\nconnectivity through telephone and the Internet was made a top priority. Now, according\nto the World Economic Forum, Singapore is ranked as the most advanced economy\ntaking full advantage of ICTs, overtaking the United States, which held the position for\nthe previous three years. While Rwanda does not have the impressive track record of\neconomic growth for the past several decades like Singapore did, the Rwandan\ngovernment is trying to skip the manufacturing based economy and launch the nation into\nan ICT based economy.\n\nICT POLICY IN RWANDA\n\nThe government of Rwanda, under the leadership of President Paul Kagame, has made\nseveral strides to develop Rwanda into the ICT leader of Africa. The government is\nlooking to follow very ambitious plans to accelerate Rwanda into this role, but with the\ndedication of the President and other government leaders this is a realistic goal.\n\nVision 2020\n\nThe Rwandan government released a plan for Rwanda's social and economic\ndevelopment, with the ultimate goal of being a prosperous nation by 2020. The Vision\n2020 plan is centered on \"a prosperous knowledge-based economy.\" The plan contains\nsix \"pillars\" and four \"cross-cutting domains,\" one of which is \"science and technologies,\nincluding ICTs.\" ICTs are mentioned as crucial components of the development of the\neducation system in Rwanda. One bullet point lays out specifically how serious the\ngovernment is about ICTs:\n143. To achieve these objectives, the country will endeavor to\n(1) put in place the legal, institutional and structural framework, favourable to the\nunfolding and the integration of ICT in the economy and within society,\n(2) encourage the private initiatives in the communication sector\n(3) improve Rwandan skills in using and managing ICT,\n(4) adapt technological co-operation to the transfer of ICT to Rwanda,\n(5) improve communication facilities.\n\nFurthermore, the government recognized its main role in this development:\n\n144. The main players in the development and dissemination of ICT are the State\nas promoter of infrastructure and development initiatives and the private sector as\nan investor and a good manager.\n\nThe plan continues to declare that by 2020, Rwanda will have scientists and\ntechnicians to meet the needs of the economy, and that they develop this through\nsecondary and tertiary education, including an increase in the number of professional and\npolytechnic universities. The government realizes that they need to hit the pipeline early\nand establish universal primary education and improve the low literacy rate (48%). Once\nstudents enter high school they will be taught skills in computer science, electronics,\nelectromechanical engineering and will be encouraged to pursue these fields at the\n\nvarious universities in the country. The government also wants to train more\nprofessionals to teach in these areas and encourage other technical professionals to start\ntheir own by using micro-credit programs to fund their ventures.\n\nThe goals of using ICTs seem pretty ambitious, but the government put itself in\nthe main role as promoter of the ICT development of the country. Since the release of the\nVision 2020 plan, the government of Rwanda has taken steps to further define this role\nand develop a concrete plan.\n\nThe ICT Plan for Rwanda\n\nIn 2001 the Rwandan government released the 1st National Information and\nCommunications Infrastructure (NICI) plan, \"An Integrated ICT-led Socio-Economic\nDevelopment Policy and Plan for Rwanda\" to address a plan for the ICT development of\nthe nation between 2001 and 2005. There are subsequent 2nd, 3rd, and 4th phase plans\nguiding ICT policy through 2020. The 1st NICI plan (2001-2005) aims to develop a\nknowledge-based economy around ICTs. The 2nd phase of the plan (2006-2010) is\ncentered on strengthening this new economic base. The 3rd plan (2011-215) looks to\nsustain the development and compete in the global market for information-based services\nand products. The 4th plan (2016-2020) will finally look to see how the new processes\nand development can bring Rwanda to middle-income status.\nCurrently, the government is wrapping up the 1st NICI plan. The NICI plan\nconsists of three major sections: the policy, the plan, and the structures. The policy\nsection provides the basic framework and context for the government policies and the\n\nchallenges that they will encounter. It is motivated heavily by the high-level goals of the\nVision 2020 document.\nThe plan section is the heart of the documents. It is based around 8 Pillars and the\nsub-plans that are used to achieve their goal. The 8 Pillars are:\n1. Human Resource Development\n2. ICTs in Education\n3. Developing and Facilitating the Private Sector\n4. ICT Infrastructure Development\n5. Foreign Direct Investment Drive in ICTs\n6. Legal, Regulatory, Institutional Provisions and Standards\n7. Deployment and Spread of ICTs in the Community\n8. Facilitating Government Administration and Service Delivery\n\nEach Pillar has an extensive sub-plan developed around it. The sub-plans consist of\ntimelines, specific actions, and measurable targets for each initiative within a Pillar. For\nexample, in the Developing and Facilitating the Private Sector sub-plan, the Ministry of\nFinance and Economic Planning is responsible for including in all budgets from FY2002\nto 2005 special tax incentives aimed at broadening and speeding up growth in the ICT\nsector. Each sub-plan also delves into who takes ownership of initiatives and what agency\nor group is responsible for implementation. The sub-plans also explain how much money\nwill be spent on each initiative and where the money should come from.\n\nThe third component of the 1st NICI plan set up the structures to facilitate and\nmonitor the ICT development within the country. The two main institutions within the\ngovernment are the National Information Technology Commission (NITC) and the\nRwanda Information Technology Authority (RITA). NITC is the main advisory group\nand think-tank for the Rwandan government. It is chaired by the President and is\ncomposed of several other important government officials. The commission is charged\nwith helping Rwanda develop ICT policies and plans and also facilitating them. It must\n\nalso monitor and evaluate the policies and programs as well. The NITC also is\nresponsible for increasing awareness about ICTs and the policies that the government is\nenacting in order to transform the society in a knowledge-based economy. RITA is a\nbody that works with the Office of the President and Ministry of Public Works,\nTransport, and Communications and reports to NITC It is the main body that is in charge\nof actually implementing the ICT policies and all of the associated projects and programs.\nRITA is responsible for human development in the area of ICTs and other related skill\nareas to help increase the number of people qualified to work in this area. Through its\nNational Computer Center division it also acts as a consulting group, providing services\nto the government and public and private sector organizations. RITA is essentially the\nlink between the government policy-makers and the people on the ground.\n\nPROGRESS MADE\nAs the end of the 1st NICI plan comes to a close, it is important to assess the\nsuccess and problems Rwanda has faced so far. No formal comprehensive assessment has\nbeen done by the government yet on this plan. Looking at some of the events over the\npast five years it appears that ICT development in Rwanda is making significant strides.\nThe government and President Kagame are gaining notoriety and recognition as being the\nleaders in ITC in sub-Saharan development and no other country is competing besides\nSouth Africa, which has significantly more resources. The education and private sectors\nare areas that have shown significant improvements.\nRwanda Terracom\n\nRwanda Terracom was founded in 2004 as a private company charged with\ndeveloping a state-of-the-art fiber optic network in Rwanda. Terracom's first goal is to\nconnect schools, hospitals and government buildings in the capital, Kigali. The network\nwill then be extended to the next four largest cities: Butare, Gisenyi, Gitarama, and\nRuhengeri. As of December 2004, 30 schools and over 150 facilities were connected in\nKigali. Since the summer of 2005 there has been over 1,000 km of fiber optic cable laid.\nIn October the Rwandan government recently sold Rwandatel, the national telecom\nservice provider, to Terracom. The privatization of public utilities is something that is\nusually recommended by development agencies as private companies are typically more\nefficient and provide better services. In Rwanda, a phone call to the United States has\ndropped from 92 cents per minute to 23 cents per minute and will continue to drop.\nKigali Institute of Science, Technology, and Management\nIn 1997, Rwanda's first technology institute of higher learning, the Kigali\nInstitute of Science, Technology, and Management (KIST), was established. KIST was\nfounded to increase the capacity of the country to produce qualified scientists, engineers,\nand administrators. It offers degree programs in Computer Engineering, Electrical\nEngineering, Business Administration and many more. Universities can have a profound\neffect on the development of a nation and KIST is taking the lead. It not only looks to\nequip students with the necessary engineering, management, and science skills, but it also\nwants students to understand how they can use these skills for development. KIST also\nhas a realistic outlook on the world and understands that the economy is not fully\ndeveloped and there are few job opportunities for the graduates. As a result, KIST trains\n\nstudents in entrepreneurship and encourages them to create their own jobs instead of\nlooking for them in the tiny market.\nKIST has seen some early success. A few classes have graduated from KIST and\nthe initial response from employers has been very positive. The institute has achieved\ntremendous growth in such a short time--it opened with 209 students and now has over\n4,000. It has made strides in research in areas that are relevant to development in Rwanda\nlike appropriate technologies and renewable energy. KIST operates with the\ngovernment's NICI and Vision 2020 plans in mind. The government of Rwanda\ncommitted KIST to be the Regional ICT Training and Research Center.\nWhile KIST has been largely successful so far, it has encountered some\ndifficulties. The Institute has enormous support from the government, but not from\nelsewhere. There is low investment in their research activities and they struggle with the\nlack of resources available. ICT facilities are still lacking and there are few qualified\nprofessionals to train the next generation of scientists and engineers.\n\nPROBLEMS FACED\nMost of the problems that have been encountered in Rwanda's attempt to\ntransform the economy are a direct result of the situation that the country was in at the\nstart of the plan. Many of the problems still plague the country and are slowing the\ndevelopment process. The fact that the country had almost no ICT infrastructure before\nthe plan means it has a long way to go to have a fully developed system. At the time of\nthe creation of Vision 2020, Rwanda had a teledensity rate of 1.1% and Internet density\nof just 0.06%. So even as availability of these technologies increases, people's awareness\n\nand understanding of them will surely be lagging behind. While KIST and other\neducational institutions are expanding at a rapid rate, they can only take as many students\nas they can teach. The schools are struggling to find enough qualified instructors and\nprofessors to teach in the nation's institutions of higher learning. The agrarian culture is\nalso limiting the effectiveness of the plan. A remarkable 90% of the country lives in rural\nareas, so it is harder to reach them and make them aware and convince them of the new\ndirection the economy is heading. As a result of the high rural population, although\nRwanda Terracom is wiring the five largest cities, the vast majority of the country will\nstill not have access to the Internet. The Rwandan government wants to generate more\nhuman resources and make better use of the network infrastructure by having the urban\npopulation increase to 30% by 2020.\n\nOUTLOOK ON THE FUTURE\n\nDespite the huge mountain Rwanda has to climb to achieve middle-income status\nby 2020, many people consider this goal to still be realistic. The government led by\nPresident Paul Kagame has been the most avid supporter of integrating ICTs into\nRwandan society. As long as this support does not wane, the future will be bright for\nRwanda. Much of the ICT growth, especially in the realm of education, has been\noccurring despite a lack of resources. As long as Rwanda does not suffer from a massive\nbrain drain and the universities continue to encourage their students to start their own\nbusinesses, the growth should skyrocket once this first generation of graduates matures\nand the students that are being targeted early in the education pipeline matriculate into\nRwandan universities. Besides the government and human development side, there is a\n\npositive outlook for the ICT infrastructure of Rwanda. Terracom is near completion of its\nwiring of the cities of Rwanda and will soon have more people, business, and schools\nconnected. Their recent acquisition of government-owned Rwandatel should also\ndecrease the prices of services and increase the speed of which they can be acquired.\nAnother major milestone should be reached by 2007. The Eastern Africa Submarine\nSystem (EASSy) should be completed, connecting Rwanda to the global fiber optic\nnetwork. The undersea cable is in the process of being installed along the coast of East\nAfrica, which was completely ignored when past undersea cables were laid. This should\nfurther reduce the cost and increase the speed and reliability of the Internet in Rwanda, as\nwell as help their neighbors develop systems as well. With neighbors better equipped to\nwork in a technology-driven world, they should be able to collaborate and leverage one\nanother to give Africa a stronger share in the global ICT market.\n\nCONCLUSION\nThe end of the Rwandan genocide in 1994 saw a decimation of the nation's\npeople, economy, resources, and political system. However, miraculously the country\nrebounded with a sense of forgiveness and optimism and looked turned the tragedy into\nan opportunity for a new beginning. The government has been ardent about developing\nthe country economically and is willing to drastically change the way of life to do\nachieve this goal. The use of information and communication technologies (ICTs) is\nbecoming a crucial component of the global economy and Rwanda wants to be the\nleaders in Africa in this area. They have already outlined several concrete plans for\naccomplishing this by 2020. The government developed the plans keeping in mind the\n\nhistory and economical state of the country and was realistic about the challenges they\nwould face. Because of this insightful and cautious approach they have been relatively\nsuccessful early on in their endeavor. The government, private, non-profit, and education\nsectors have been collaborating and are helping each other achieve the common Vision\n2020 goals. The outlook for Rwanda is now more positive than it has ever been in its\nmodern history. Barring any drastic negative change in the political climate, Rwanda\nshould enter the next quarter of the century as a prosperous country and a key player in\nthe knowledge-based economy.\n\nREFERENCES\n\"An Integrated ICT-led Socio-Economic Development Policy and Plan for Rwanda 2001\n- 2005.\" http://www.uneca.org/aisi/nici/country_profiles/rwanda/rwanpap2.htm\nCIA World Factbook on Intelligence.\nhttp://www.cia.gov/cia/publications/factbook/geos/rw.html\nDiamond, Jared. \"Collapse: How Societies Choose to Fail or Succeed.\" Viking Adult:\nNew York. 2004.\n\"Hub Rwanda.\" BBC World. July 7th, 2005.\nhttp://www.bbcworld.com/content/clickonline_archive_27_2005.asp?pageid=666&co_pa\ngeid=2\n\"Meeting a Nation's Technology Needs.\" The Daily Monitor.\nhttp://www.monitor.co.ug/specialincludes/mplsups/rwandaecon/econ091910.php\nRwanda Information Technology Authority. http://www.rita.gov.rw/index.html\nRwanda Terracom. http://www.terracom.rw/\nStrategic Plan 2003-2004. Kigali Institute of Science, Technology, and Managaement.\nhttp://www.kist.ac.rw/about/kist%20documents/strat_plan_2003_2004.pdf\n\n\"There's little passive about Rwanda's optical initiative.\" Lightwave Magazine.\nDecember 2004.\nhttp://lw.pennnet.com/Articles/Article_Display.cfm?Section=ARCHI&Subsection=Displ\nay&ARTICLE_ID=217939&KEYWORD=terracom&p=13\nWorld Economic Forum\nhttp://www.weforum.org/site/homepublic.nsf/Content/Singapore+overtakes+the+United+\nStates+in+the+World+Economic+Forum%27s+Global+Information+Technology+Report\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.034 / CMS.930 Media Education and the Marketplace\nFall 2005\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}