{
  "course_name": "Memory, Culture, Forgetting",
  "course_description": "This course introduces scholarly debates about the sociocultural practices through which individuals and societies create, sustain, recall, and erase memories. Emphasis is given to the history of knowledge, construction of memory, the role of authorities in shaping memory, and how societies decide on whose versions of memory are more “truthful” and “real.” Other topics include how memory works in the human brain, memory and trauma, amnesia, memory practices in the sciences, false memory, sites of memory, and the commodification of memory. Students taking the graduate version complete additional assignments.",
  "topics": [
    "Social Science",
    "Anthropology",
    "Biological Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Social Anthropology",
    "Social Science",
    "Anthropology",
    "Biological Anthropology",
    "Cultural Anthropology",
    "Ethnography",
    "Social Anthropology"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nHow do different societies remember their past? How do you, as an individual, happen to know something about the past that you have never experienced? This course explores diverse ways in which different cultures construct, maintain, use, forget and erase their memories. We will explore culturally distinct sites and practices of memory through narratives, texts, memorials, symbols, rituals, and recently, internet and social media. The course will draw on a range of materials including ethnography, history, cultural studies, social media studies, and documentary and full feature films. The course is about social memory and employs the approaches of socio-cultural anthropology. You will learn the background knowledge and necessary tools for understanding memory studies in anthropology. The course does not address issues of memory in other disciplines such as biology, neuroscience, and medicine.\n\nClasses will combine interactive lectures, discussion, group projects, field trips, and film screenings. While lectures introduce major debates surrounding the readings, students are expected to engage in discussions of the subject based on close readings of the texts. Everyone must come to class prepared, as discussion will often take the form of a formal debate of the issues read for that class session. Generally readings will be limited to 100 pages per week, depending on the density of the material. All readings should be done prior to the class.\n\nYou must bring to class the required readings for each session--a book, or printed hard copies or electronic versions of the articles! You will need these to participate in class discussion, complete in-class exercises, and perform group activities.\n\nI expect students to adhere to MIT's guidelines on academic integrity. Plagiarism, unauthorized collaboration, cheating, or facilitating academic dishonesty may cause us to contact the\nOffice of Student Citizenship\nor\nCommittee on Discipline\n. If you have questions about what qualifies as plagiarism and how to avoid it--and for tips on how to succeed--check out\nAcademic Integrity at MIT: A Handbook for Students\n.\n\nMIT's\nWriting and Communication Center\noffers free consultation as well as on-line help (!) to MIT students at any stage of the writing process. Get help overcoming writer's block and formulating an argument, and with questions on grammar and style. (Writing Center consultants do not proofread, but they do offer help with grammar and beyond).\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nDiscussion / Participation\n\nEach student is expected to contribute to class discussions. Attendance at class is crucial given that this class meets only once a week\n.\n\n20%\n\nReader Responses (4)\n\n20%\n\nMidterm\n\nThe midterm will be cumulative and based on lectures, readings, and films. It is a closed book and articles, but open-notes exam\n.\n\n30%\n\nFinal Paper\n\n30%\n\nFor detailed information on the reader responses and the final paper, please see the\nAssignments\nsection.\n\nRequired Book\n\nRinehart, Richard, and Jon Ippolito.\nRe-Collection: Art, New Media and Social Memory\n. MIT Press, 2014. ISBN: 9780262027007. [Preview with\nGoogle Books\n]\n\nFor detailed information on the readings, see the table in the\nReadings\nsection.",
  "files": [
    {
      "category": "Assignment",
      "title": "21A.104S16 Memory, Culture, and Forgetting: Assignments - Research Paper Ideas",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-104-memory-culture-forgetting-spring-2016/5b55129e120840d9343c0ebf52137b4e_MIT21A_104S16_ReserchIdeas.pdf",
      "content": "Hi All,\n\nThe following list is just to give you some idea for your research paper. I hope this\nhelps. I sorted the literature into loose \"themes\" for your convenience, but\nsometimes the same text speaks to different themes and issues.\n\n1. Place memory\n\nSecondary research based paper on how landscape, cities, architecture, and lands in\ngeneral are places of memory\n\nExample of literature:\nKeith H. Basso, Wisdom Sits in Place. 1996\n\nMary Steedly, Hanging Without a Rope, 1993 (chapter on Mount Sibayak)\n\nNorman Klein, The History of Forgetting: Los Angeles & the erasure of memory\n(Verso, 1997)\n\n2. Archives\n\nRebecca Comay (ed), Lost in the Archives (Alphabet City Media, 2002) [vast and\nthrilling]\n\nGeoffrey Bowker, Memory Practices in Sciences, 2005\n\nAnn Laura Stoler, Along the Archival Grain, 2009\n\nJacques Derrida, Archive Fever (Chicago UP, 1996)\n\nYou can also go and explore the MIT archives and write a paper, but look at these\nbooks for analytical concepts.\n\n3. Narrative as memory (this is a title that is based on methodology and form, not\nthe content; narrative can be about anything)\n\nA paper based on first hand (interviews) research on local memories of\nbattles or communal events that a student's home town/village\ncommemorates on an yearly basis and the shift in which the elders\nremembered the commemorative events from the contemporary.\n\nElizabeth Tonkin, Narrating our Pasts: the social construction of oral history\n(Cambridge, 1991). Based on fieldwork in Africa: concluding chapters on memory, &\ntruth & identity.\n\nJennifer Bohanek et al, 'Family Narrative Interaction and Children's Sense of Self',\nFamily Process 45 (1), 2006, 39-54\n\nWilliam Hirst and David Manier, 'Remembering as Communication: a family\nrecounts its past', in D. Rubin ed, Remembering our Past (Cambridge UP, 1996), 271-\n\nWilliam Hirst, David Manier, and Ioana Apetroaia, 'The Social Construction of the\nRemembered Self: family recounting', in J Snodgrass and R Thompson (eds), The Self\nAcross Psychology (NYAS, 1997)\n\n4. Bodies as sites of memory\n\nArthur Kleinman, Joan Kleinman, 'How bodies remember: social memory and bodily\nexperience of criticism, resistance, & delegitimation following China's Cultural\nRevolution', New Literary History 25 (3), 1994, 707-723\n\nPaul Stoler, Embodying Colonial Memories - a nice book about spirit possession and\nhow it serves as a form of memory\n\nDidier Fassin, When Bodies Remember: Experience and Politics of AIDS in South\nAfrica.\n\n5. Remembering Wars (and Holocaust)\n\nYou can research memories of 9/11 from various on-line and media sources. See\nhow it is remembered differently from other wars.\n\nLuisa Passerini, Fascism in Popular Memory (Cambridge UP, 1987)\n\nBrian Conway, 'Active remembering, selective forgetting, and collective identity: the\ncase of Bloody Sunday', Identity 3 (4), 2003\n\nPeter Novick, The Holocaust and Collective Memory: the American experience\n(Bloomsbury, 1999)\n\nMichael Perlman, Imaginal Memory and the Place of Hiroshima (SUNY Press, 1988)\n\nTzvetan Todorov, 'The Abuses of Memory', Common Knowledge 5 (spring 1996), 6-\n\nHarald Welzer, Grandpa Wasn't a Nazi: the Holocaust in German family\nrememberance (American Jewish Committee, 2005)\n\nJames Young, The Texture of Memory: Holocaust, memorials, & meaning (Yale UP,\n1993)\n\n6. Memories of Heroes and Individuals\n\nBarry Schwartz, 'Memory as a Cultural System: Abraham Lincoln in World War II',\nAmerican Sociological Review 61 (1996), 908-927\n\nCatherine Keenan, 'On the relationship between personal photographs and\nindividual memory',\nHistory of Photography 22 (1998), 60-64\n\nAnnette Kuhn, Family Secrets: Acts of Memory and Imagination. 2nd edition, London:\nVerso, 2002\n\n7. Memorials\n\nJohn Stephens, 'Memory, Commemoration, and the Meaning of a Suburban War\nMemorial', Journal of Material Culture 12 (3), 2007, 241-261\n\nMarita Sturken, Tangled Memories: the Vietnam War, the AIDS epidemic, and the\npolitics of remembering (California UP, 1997)\n\nMarita Sturken, 'The Image as Memorial: personal photographs in cultural memory',\nin M. Hirsch (ed.),\n\n8. Modernity and Memory\n\nRichard Terdiman, Present Past: modernity and the memory crisis (Cornell U.P.,\n1993)\n\nJennifer Cole, 'Memory and Modernity', in C Casey & RB Edgerton (eds), A\nCompanion to Psychological Anthropology\n\nRichard Terdiman, Present Past: modernity and the memory crisis (Cornell U.P.,\n1993)\n\nTechnology and Memory\n\nAnnette Kuhn, An Everyday Magic: Cinema and Cultural Memory. London: I.B. Tauris,\n2002.\n\nAlison Landsberg, 'Prosthetic Memory: Total Recall and Blade Runner', in M\nFeatherstone & R\n\nBurrows (eds), Cyberspace/ Cyberbodies/ Cyberpunk (Sage, 1995), 175-189\n\nMartin Lefebvre, 'On Memory & Imagination in Cinema', New Literary History 30\n(1999) 479-498\n\nChris Locke, 'Digital Memory and the Problem of Forgetting', in Susannah Radstone\n(ed), Memory and Methodology (Oxford: Berg, 2000), 25-36\n\nJames Nyce & Paul Kahn, From Memex to Hypertext: Vannevar Bush and the mind's\nmachine. Academic Press, 1991. Includes Bush's 'As We May Think' and heaps more.\n\nKatherine Rowe, 'Remember Me: technologies of memory in Michael Almereyda's\nHamlet' (2002)\n\nBernard Stiegler, 'The Global Mnemotechnical System', Culture Machine 4\n(2004) The Familial Gaze (Dartmouth College, 1999), 178-195\n\nDarren Tofts & M. McKeich, Memory Trade: the prehistory of cyberculture (Interface,\n1997)\n\n9. Museums, collecting, and other objects\n\nSusan Crane (ed), Museums and Memory (Stanford UP, 2000)\n\nJacques Derrida, Archive Fever (Chicago UP, 1996)\n\nSteven Dubin, Displays of Power: memory and amnesia in the American museum\n(NYUP, 1999)\n\nKenneth Foote, 'To Remember and Forget: Archives, Memory, & Culture', American\nArchivist 53 (1990), 378-392\n\nChris Healy, 'Histories and Collecting: museums, objects, & memory', in K. Darian-\nSmith and P. Hamilton, Memory & History in Twentieth-Century Australia (Oxford UP,\n1994)\n\nGaynor Kavanagh, Dream Spaces: memory and the museum (Leicester UP, 2000)\n\nDavid Lowenthal, The Past is a Foreign Country (Cambridge UP, 1985). Astonishingly\ndetailed compendium of material on heritage, archives, history, relics, and artifacts.\nSee especially chapter 5 'How we know the past'.\n\nLaura Millar, 'Evidence, Memory, and Knowledge: the process of archival reasoning\nand the extension of social thought' (2004)\n\nIrving Velody, 'The Archive and the Human Sciences', History of the Human Sciences\n11 (1998), 1-16 (introduction to two special issues on archives and memory which\ninclude a number of useful papers on history, museums, archives, and institutions in\nrelation to memory)\n\nMartha Langford, Suspended Conversations: The Afterlife of Memory in Photographic\nAlbums\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21A.104 / 21A.119 Memory, Culture, Forgetting\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21A.104S16 Memory, Culture, and Forgetting: Assignments - Research Paper: Radical Empathy",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-104-memory-culture-forgetting-spring-2016/2f45026d1eda2c507f4b3aef56fcf265_MIT21A_104S16_RadiclEmpthy.pdf",
      "content": "M.I.T. Student\nRadical Empathy and the Transferential Power of Mass Media\n5/11/16\n\nThe creation and transfer of memory is an essential part of maintaining traditions\nand culture, but has been historically limited to contact with society and sacred sites. In\ncontrast, mass media (represented by films and museums) is widely interacted with but\ndoes not offer significant affective content. Alison Landsberg's radical description of\nempathy generation via mass media seems to contradict the established definitions of\nmemory transfer as represented by the works of Pierre Nora and Maurice Halbwachs.\nHowever, the opposing definitions can be reconciled if one considers mass media as a\nsocial entity and a lieux de memoire. With these assumptions, Landsberg's theory is\nconsistent with and complementary to the established understanding of memory and\npresents a new tool to create and secure memory practices.\n\nAlison Landsberg describes popular films to demonstrate the affective power of\nmass media on the body. In her paper Prosthetic Memory: Total Recall and Blade Runner she\ndetails how film can be used to create prosthetic memory. Landsberg begins with a\ndefinition of prosthetic memories: they are affective implants \"which do not come from a\nperson's lived experience in any strict sense.\"i She reports that these memories--which are\ntransferred--still exert control over our present and future actions although they may not\na part of our past. Landsberg's claim in this paper is that such prosthetic memories can be\ntransmitted on a large scale via popular film, and remain in the viewer as permanent\nprotheses that modify identity. Landsberg references studies conducted regarding the\naffects of film on the viewer to conclude that \"the memories that the cinema affords--\ndespite the fact that the spectator did not live through them--might be as significant in\nconstructing, or deconstructing, the spectator's identity as any experience that s/he\nactually lived through.\"ii But how can she claim such a strong statement about the impact of\n\nThe creation and transfer of memory is an essential part of maintaining traditions\nand culture, but has been historically limited to contact with society and sacred sites. In\ncontrast, mass media (represented by films and museums) is widely interacted with but\ndoes not offer significant affective content. Alison Landsberg's radical description of\nempathy generation via mass media seems to contradict the established definitions of\nmemory transfer as represented by the works of Pierre Nora and Maurice Halbwachs.\nHowever, the opposing definitions can be reconciled if one considers mass media as a\nsocial entity and a lieux de memoire. With these assumptions, Landsberg's theory is\nconsistent with and complementary to the established understanding of memory and\npresents a new tool to create and secure memory practices.\n\nAlison Landsberg describes popular films to demonstrate the affective power of\nmass media on the body. In her paper Prosthetic Memory: Total Recall and Blade Runner she\ndetails how film can be used to create prosthetic memory. Landsberg begins with a\ndefinition of prosthetic memories: they are affective implants \"which do not come from a\nperson's lived experience in any strict sense.\"i She reports that these memories--which are\ntransferred--still exert control over our present and future actions although they may not\na part of our past. Landsberg's claim in this paper is that such prosthetic memories can be\ntransmitted on a large scale via popular film, and remain in the viewer as permanent\nprotheses that modify identity. Landsberg references studies conducted regarding the\naffects of film on the viewer to conclude that \"the memories that the cinema affords--\ndespite the fact that the spectator did not live through them--might be as significant in\nconstructing, or deconstructing, the spectator's identity as any experience that s/he\nactually lived through.\"ii But how can she claim such a strong statement about the impact of\n\na film on a person's identity? Landsberg is convinced by the extremely visual and fully\nsensory pysiological experience of the cinema. She argues \"why then, does the sensual in\nthe cinema--the experiential nature of the spectator's engagement with the image--differ\nfrom other aesthetic experiences which might also be the scene of the production of\nsensual memory?\"iii She goes on to describe emotional possession of the viewer by the\ncontent of the film, how immersive identification with the film carries over into the identity\nof the viewer. She concludes by suggesting that the affective power of film comes from\nempathy between the viewer and the subject of the film. She details how the viewer of\nTotal Recall still identifies with the original form of Quade, even once it is revealed that\nQuade is an implanted identity living in the body of another. She claims that the viewer's\nidentification with Quade, even though he is a false identity created from prosthetic\nmemory, is evidence that humans can identify with real and constructed memories equally\nwell.iv From this arguement, she derives her theory that radical empathy with external\nidentities (whether real or imagined in film) can create substantial prosthetic memory\nwhich can impact the original identity of the viewer.v\n\nWhile Landsberg claims that these transferential film experiences create permanent\nprosthetic memory, Halbwachs claims that true social experience is required for memory\ntransfer and storage. In his seminal work On Collective Memory, Maurice Halbwachs\nestablishes memory as a social interaction between an individual and a group. He argues\nthat \"it is in society that people normally acquire their memories. It is also in society that\nthey recall, recognize and localize their memories.\"vi He argues his case by presenting how\ndefects in social interaction, represented by the dreamer and the aphasic, directly impact\n\nthe ability to form, retain and focus memories. To Halbwachs, the dream is the only action\nthat takes place purely in absence of society. He notes that:\n\"Our dreams are composed of fragments of memory too mutilated and mixed\nup with others to allow us to recognize them... this is because, in order to\nremember, one must be capable of reasoning and comparing and of feeling in\ncontact with a human society that can guarantee the integrity of our\nmemory.\"vii\nSo then how can memory be transferred while watching a film? Halbwachs would argue\nthat since the viewer is not interacting directly with a real society that no true memories\nare generated. Films, like dreams, are not bound to the rules and structure of society and in\nHalbwachs' opinion would be represented as \"detached shreds of the scenes we have really\nexperienced.\"viii But Landsberg claims that empathy can bridge the social distance and\ncreate prosthetic memory based off of events that we haven't experienced. Thus Halbwachs\nand Landsberg fundamentally disagree on the social content and experiential nature of\nfilm. But perhaps the viewer of a film is more closely related to Halbwach's description of\nthe aphasic in society. Halbwach discriminates between the dreamer and aphasic by how\nthey relate memory to society. The dreamer in any one scene can comprehend the scene\nand identify with the society represented, but each scene is separate and unrelated, lending\nno larger structure of memory.ix The aphasic on the other hand has context and temporal\nstructure of memory, but is placed in a new society where they cannot interact and identify\nwith others.x Where Halbwachs would argue that the new environment presented by the\nfilm renders the viewer aphasic, Landsberg would counter that the viewer still makes\nstrong identifications with cinematic characters despite the societal distance. Clearly\nneither the aphasic nor dreamer are appropriate models of the role of the viewer in\nrelation to the film, and Landsberg and Halbwachs seem at odds with eachother.\n\nLandsberg proposes that empathic memory transfer can be used to restore or\nreinvigorate ailing memory practices. In her paper America, the Holocaust, and the Mass\nCulture of Memory: Toward a Radical Politics of Empathy, Landsberg argues that mass\nmedia transferential spaces can be used to create memory practices that maintain stories\nof the Holocaust. She studies the affect of the American Holocaust Museum on its viewers\nas a site of empathy and prosthetic memory transfer. After describing the chilling contents\nof the Holocaust museum, she writes:\n\"In the museum, we have on the one hand a proliferation of objects and an\neerie lack of bodies, and on the other, a pronounced sense of our own bodies.\nBy engaging an individual's mimetic faculty, the museum makes empathy\npossible... In other words, these spaces might actually install in us\n'symptoms' or prosthetic memories through which we didn't actually live,\nbut to which we now, after a museum experience or a filmic experience, have\na kind of experiential relationship.\"xi\n\nShe argues that this kind of experience helps keep memory of the Holocaust alive in new\ngenerations as survivors and their stories disappear over time. Landsberg claims that the\ntransference induced by the museum is related to the distance between the viewer and the\nobject at hand. Very few people can have sympathy with the objects on display because\nthere are very few Holocaust survivors living today. However a large and diverse audience\nvisiting the museum can share empathy with victims separated in time and space. The\nabsence of bodies in the museum forces the viewer to imagine and then identify with\nvictims they have only seen traces of. Landsberg pays particular attention to the piles of\nshoes in the museum, commenting that: \"Standing amid this room of shoes at the Holocaust\nmuseum one is struck... by their worn, lived individuality: a sandal, a cracked leather work\nshoe, a boot. Each shoe bears the trace of the absent body that lived and marked it.\"xii She\nargues that the purpose of such an experiential interaction with memory is to meaningfully\n\nimplant these memories into generations to come and safeguard the history of the\nHolocaust by grounding it in lived memory. xiii Ultimately she has a political goal to protect\nHolocaust memory from the advancing tides of revisionism and apathy, and she sees\nempathic memory transfer as a means to fight back.\n\nLandsberg's argument for museums stands in sharp contrast with Pierre Nora's\nunderstanding of how memory is stored. Pierre Nora announces the \"End of Memory-\nHistory\" in his piece Between Memory and History. Nora fundamentally believes that we\ncurrently live in a post-memory society and are struggling to hold onto the last vestiges of\ntrue memory before they slip over the edge, obliterated by history.xiv He claims that,\n\"Societies based on memory are no more: the institutions that once transmitted values\nfrom generation to generation--churches, schools, families, governments--have ceased to\nfunction as they once did.\"xv He states that history has killed memory by replacing the lived\nexperience with a dead and academic analysis. Specifically, the construction of history\nbased on objects has damaged the memory of the individuals involved. In contrast to\nLandsberg, Nora argues that:\n\"With the appearance of 'the trace,' of distance and mediation, however, we\nleave the realm of true memory and enter that of history. Think of the Jews\nfaithfully observing their traditional ritual: as the 'people of memory,' history\nwas no concern of theirs until exposure to the modern world obliged them to\ndiscover a need for historians.\"xvi\nWhile Landsberg claims that objects, shoes, and the absence of the individual can create an\nempathic transferential space, Nora challenges that collecting of objects destroys the\noriginal memory of the Holocaust outright. Nora argues that museums and other sources of\nhistory attempt to supplant memory, not create it. Nora believes that \"If we still dwelled\namong our memories, there would be no need to consecrate sites embodying them.\"xvii Put\n\nsimply, Nora thinks the mere existence of the Holocaust museum is confirmation that\nsociety has already lost the memory of the Holocaust and it is too late to recall it. Landsberg\nreadily admits that there is a dearth of memory practices surrounding the Holocaust, but\nsees the museum as a way of recovering practices that were lost or never existed. xviii Nora\nsees this sort of recording and archiving as the antithesis to proper memory practices. He\nchallenges that such archives and collections of objects are \"no longer a more or less\nintentional record of actual memory but a deliberate and calculated compilation of a\nvanished memory. It adds a secondary or prosthetic memory to actual experience.\"xix Nora\nis concerned that the recent trend to collection and preservation has done more harm to\nmemory than good, and would disagree with Landsberg's assessment of the Holocaust\nMuseum as a way to restore memory. In fact Landsberg spends a long time in her paper\ndescribing the exact ways the museum was constructed to transfer as much emotion as\npossible, something Nora would dismiss as \"deliberate and calculated\". Nora also dismisses\nprosthetic memory as an addition to true memory and experience, and would characterize\nit as historicized memory. At the highest level Nora views the experiential museum as\nanother thrust by history to kill memory through collection and analysis.\n\nHalbwachs disagrees with Landsberg's theory of memory transfer, but if we\nconsider the media as a social entity then the authors agree that prosthetic memory can be\nimparted by film. The root of Halbwach's theory is the notion of the social framework for\nmemory. The social framework is what the dreamer lacks, an interaction with a social\ngroup that provokes creation, recollection and storage of memory. If a viewer reacting to a\nfilm or museum imagines or identifies a society within that media, than it can transfer\n\nmemory as a social framework. Halbwachs writes that \"One may say that the individual\nremembers by placing himself in the perspective of the group, but one may also affirm that\nthe memory of the group realizes and manifests itself in individual memories.\"xx If we\nconsider the film as a group which the viewer identifies with, through the means of\nempathy, than Halbwachs would agree that the viewer could be affected by the interaction.\nThis is in agreement with Landsberg's reference to Blumer that \"while witnessing a picture\none not infrequently projects oneself into the role of hero or heroine\".xxi While a viewer\nprojects themselves onto a main character, they immerse themselves in the society\nrepresented in the film and are thus governed by Halbwach's original definition of memory\ntransfer through a social framework. With the hypothesis that empathic identification to an\nimagined character occurs, Halbwachs and Landsberg both agree on the transferential\npower of film. Likewise, the experiential quality of an immersive museum could also cause\nthe viewer to imagine and identify with a society separated temporally, spatially, and\nculturally, and engage with the society not as an aphasic, but as a functioning member.\n\nNora's concerns about the \"historicized\" content of experiential museums can also\nbe allayed if we consider such media to be a lieux de memoire and thus a collection of true\nrather than prosthetic memory. Nora describes the role of lieux de memoire as a reservoir\nof memory, a sacred place that safeguards memory against historicization. Specifically he\nwrites that:\n\"Places, lieux de memoire, become important even as the vast fund of\nmemories among which we used to live on terms of intimacy has been\ndepleted, only to be replaced by a reconstructed history... When certain\nminorities create protected enclaves as preserves of memory to be jealously\nsafeguarded, they reveal what is true of all lieux de memoire: that without the\ncommemorative vigilance, history would soon sweep them away.\"xxii\n\nLandsberg would argue that the significance of the Holocaust Museum gives it status as a\nlieux de memoire and is thus capable and worthy of storing true memory. If we consider\nthese forms of mass media as lieux de memoire than both Nora and Landsberg can attest to\ntheir ability to defend and preserve memory from history. Nora's detestation of\nhistoricized memory would not apply to the Holocaust Museum if it was considered a lieux\nde memoire. Nora describes lieux de memoire as having \"washed up from a sea of memory\nin which we no longer dwell: they are partly official and institutional, partly affective and\nsentimental.\"xxiii Experiential museums fit this definition quite well, they are the result of an\ninstitutional effort at preservation, and operate on an emotional and affective mode. In fact,\nLandsberg describes at length how the Holocuast Museum presents itself as an affective\nrather than academic installation. She writes:\n\"Perhaps the hostility, mostly on the part of academics and middle-brow\njournalists, toward the experiential mode reflects an anxiety about the threat\nposed by an experiential mode of knowledge to the hegemony of the\ncognitive. The experiential mode complements the cognitive with affect,\nsensuousness, and tactility. In the case of the Holocaust museum--in the case\nof Holocaust in general--the cognitive model is woefully inadequate.\"xxiv\nIn light of Landsberg's argument for the affective nature of the museum, it is difficult to\nconsider such a collection as anything but a lieux de memoire. Landsberg--like Nora--seeks\nto defend memory against history and the present (represented by \"academics and middle-\nbrow journalists\") and considers the museum as an experiential rather than cognitive\ninstitution. Landsberg demonstrates her devotion to preserving memory when she\nexplains that the \"cognitive model is woefully inadequate\" to understand the true horror of\nthe Holocaust. She rejects the historical and academic connotation of museums and\nreaffirms that the Holocaust museum represents a thriving lieux de memoire.\n\nUpon reflection, the traditional definitions of memory and memory transfer seem to\naccept Landsberg's radical theory of empathy when we make a few key assumptions. For\nHalbwachs to be consistent with Landsberg, the mass media in question has to present\nitself as a social framework of memory. For this to occur, the viewer must identify with the\nsociety represented in the media and \"place oneself in the perspective of the group.\"xxv If\nLandsberg's description of empathic identification is correct, than the requisite perspective\ncan be created. Nora's main objections to the experiential museum are based off of his\nlarger argument that history sets out to analyze, archive, and thereby destroy memory.\nLandsberg makes it very clear that the Holocaust museum serves the opposite purpose. She\ndescribes the affective and emotional nature of the museum which lends it credibility as a\nreservoir of true memory a lieux de memoire. With the contradictions satisfied, it is clear\nthat the mass media does have the capability to become an empathic transferential space\nthat cultivates, stores and imparts prosthetic memories that are just as powerful as true\nmemories. Landsberg describes this development as a \"radical politics of empathy\" and\nposits that this new form of memory transfer can be used to make real memories of other\ntraumas and enable discussion and consideration of problems usually restricted by\ntemporal and spatial distance. xxvi But does that mean that Nora is wrong? With such a\npowerful tool, is memory still under attack? Landsberg presents this new tool as a means to\nfight revisionism, apathy, and decaying memories of the Holocaust, implying that it is\nneeded to keep memory safe from history. Landsberg also leaves us with a word of caution\nand optimism. Prosthetic memory may be able to unify separate identities for a political\npurposexxvii, but can also be used to promote historical revisionism through massive and\nmindless consumption.xxviii\n\ni Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". Body and Society\n\n1 (1995): 175-189. Web... pg. 175\nii Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". pg 180\niii Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". pg 179\niv Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". pg 182\nv Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". pg 186\nvi Halbwachs, Maurice. \"On Collective Memory\". (1992): pg. 3\nvii Halbwachs, Maurice. \"On Collective Memory\". pg. 41\nviii Halbwachs, Maurice. \"On Collective Memory\". pg. 41\nix Halbwachs, Maurice. \"On Collective Memory\". pg. 44\nx Halbwachs, Maurice. \"On Collective Memory\". pg. 43\nxi Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory: Toward a\n\nRadical Politics of Empathy\". New German Critique 71 (1997): 63-86. Web... pg. 82\nxii Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory\". pg. 80\nxiii Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory\". pg. 86\nxiv Nora, Pierre. \"Between Memory and History\" (1989): Web... pg. 2\nxv Nora, Pierre. \"Between Memory and History\" pg. 2\nxvi Nora, Pierre. \"Between Memory and History\" pg. 2\nxviiNora, Pierre. \"Between Memory and History\",pg. 2\nxviii Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory\". pg. 64\nxix Nora, Pierre. \"Between Memory and History\" pg. 9\nxx Halbwachs, Maurice. \"On Collective Memory\". pg. 40\nxxi Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". pg 179\nxxii Nora, Pierre. \"Between Memory and History\" pg. 6-7\nxxiii Nora, Pierre. \"Between Memory and History\" pg. 7\nxxiv Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory\". pg. 76\nxxv Halbwachs, Maurice. \"On Collective Memory\". pg. 40\nxxvi Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory\". pg. 86\nxxvii Landsberg, Alison. \"Prosthetic Memory: Total Recall and Blade Runner\". pg 178\nxxviii Landsberg, Alison. \"America, the Holocaust, and the Mass Culture of Memory\". pg. 67\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21A.104 / 21A.119 Memory, Culture, Forgetting\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21A.104S16 Memory, Culture, and Forgetting: Assignments - Student Example Reader Response 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-104-memory-culture-forgetting-spring-2016/f96accf495c9ed8698c744965d37299c_MIT21A_104S16_Response1.pdf",
      "content": "Reader Response 1\n\nMemory is the new soul, a powerful tool in politics that is lent credibility by the\nscience of memory and therefore accepted in our modern secular society. Ian Hacking,\nMaurice Halbwachs and Daniel Schacter all write about the power, origin, and social\ncontext of memory but focus on separate aspects of its understanding and use. Specifically,\nthese writers concern themselves with the political structure that supports and uses\nmemory, the social framework that generates and recalls memories, and the bitter debates\nover false and repressed memories that tear families and professionals apart. The three\nauthors contributions on the subject convey a high level frustration with memory; unhappy\nthat something so important to our personal and social existence, is malleable, faulty and\nprone to manipulation.\n\nMemory is a powerful tool that attracts attention from the public and political\ngroups. In his book Searching for Memory, Daniel L. Schacter cautiously outlines a case\nagainst repressed memory, a topic that attracted \"bitter debate... among professionals in\nthe fields of mental health, medicine, and law.\" Schacter focuses on memories, true or false,\nthat stem from childhood trauma like sexual abuse or Satanic Ritual Abuse. In the 1990's,\ncases where therapists and patients had discovered repressed memories of abuse and\ntrauma from childhood started to gain national attention. In some cases, patients\nremembered repressed memories of abuse and challenged their perpetrators, often family\nmembers, in court. The frequency of such accusations split public opinion into supporters\nof victims of repressed memories and skeptics who consider them false memories\nuncorroborated by fact. Schacter makes his skepticism of repressed memories clear when\nhe talks about \"suggestive\", \"toxic\", and \"risky\" therapy sessions--involving hypnosis and\n\nsocial pressure--which he criticizes for potentially implanting false memories. Schacter\ndescribes multiple scientific studies that concern repressed, retracted, and false memories\nto conclude that most repressed memories are likely fabricated by interaction with a\ntherapist or caused by pyschological illness rather than hidden away for decades by some\nunknown repression mechanism.\n\nMaurice Halbwachs argues that memories are formed, recalled, and adjusted\nthrough social interactions and cannot exist without other humans. Halbwachs describes\nthe affect of \"social frameworks for memory\" by considering dreams, the only time when\nhumans are free from social pressure and reinforcement. Halbwachs states that \"our\ndreams are composed of fragments of memory too mutilated and mixed up with others to\nallows us to recognize them.\" He claims that dreams do not form coherent memories\nbecause they are formed in the absence of society, a normalizing force. He goes on to\ncompare dreaming with aphasia. In the former, the dreamer can experience any aspect of\nsociety properly but cannot piece together the larger whole, and in the latter the aphasic\nretains knowledge of his past and understands that there is society around him, but doesn't\nhave the tools to interact with it properly. Halbwachs goes on to discuss how social\ninteractions shape the memory of the past. He argues that the elderly reminisce about the\npast because those fond memories where formed when they were of peak value to that\nsociety, and therefore recall it as frequently as possible, fullfilling the tribal goal of passing\ndown collective knowledge. Halbwachs concludes by describing the societal pressure on\nmemory as a constraint, but one that forces us to aritificially improve our memories of the\npast and \"give them a prestige that reality did not possess.\"\n\nIan Hacking argues in his book Memoro-Politics that memory is the secular soul, a\nnew tool that was enabled by the science of memory and continues in the tradition of\npsychological phenomenon being exploited by politics. Hacking introduces and defines\npersonal and communal politics of memory before focusing on the personal, a \"struggle\nbuilt around knowledge, or claims to knowledge.\" Hacking describes personal politics of\nmemory as facts and opinions being thrown around while borrowing legitimacy from\npyschological and biological science. He details how hysteria, shell-shock and sexual abuse\nhave been co-opted by political forces across the last century, agreeing with Halbwachs on\nthe social framework of memory and Schacter that social pressure can implant memory.\nAfter religion lost political power in Europe and the science of memory became statistical\nin nature, memory became the new way to control large groups of people and rally\ncountries tipping on the brink of what would have been called moral bankruptcy. Moral\nquestions of subjective good and bad, were redirected towards scientific questions about\nforgetting and remembering.\n\nQuestions:\n1. How does Schacter subtly introduce his position against repressed memories while\ntrying to stay grounded in the science? Is there enough science to confirm his\nopinion?\n2. Halbwach claims that memories of the past are not useful because they were formed\nduring a different society, one that no longer exists. Do you agree that we in the\npresent don't value the past?\n\n3. Ian Hacking claims that the introduction of the science of memory has legitimized\nthe subject and made it more factual when being debated. Does this seem consistent\nwith Schacter's description of \"bitter debate\"?\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21A.104 / 21A.119 Memory, Culture, Forgetting\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21A.104S16 Memory, Culture, and Forgetting: Assignments - Student Example Reader Response 2A",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-104-memory-culture-forgetting-spring-2016/1d62d9f0b2c303e882a6c32cfd378367_MIT21A_104S16_Response2A.pdf",
      "content": "Reader Response 2: A History of Relativism\n\nHistory is not a collection of facts, it is an interpreted understanding of the past, one\nthat fluctuates over generations while still claiming legitimacy from objects and the written\nword. Paul Connerton, Eric Gable, and sources related to the Museum of African-American\nHistory (MAAH) in Boston describe the affect of social memory on history. By investigating\nplaces like Colonial Williamsburg and historical events they make a commentary on the\ninfluence of the present on the past. Fact-based history claims to be authoritative and\nabove the influence of social trends but the interpretive nature of choosing and presenting\nevidence is itself a subjective process.i These sources each describe various social and\npolitical influences on history and historians to demonstrate that social memory and\nhistory are not as distant as expected; instead they argue that relativism and subjectivity\npermeate every level of historical science--cutting the head off of fact-based history.\n\nThe presentation and creation of history at Colonial Williamsburg provides a case\nstudy on how social and political influences have changed history. In their piece On the Uses\nof Relativism Eric Gable et. al discuss the recent focus on slave history at Colonial\nWilliamsburg. Gable writes that in the 1970's public criticism forced the museum to re-\nevaluate its utter lack of African American historyii--in a city that was formerly 50/50\nblack and white.iii Gable uses Colonial Williamsburg to talk about historical relativism and\nits affect on minority history. Since the inclusion of slave history was prompted by social\npressure \"the museum thus asserts that black history is 'conjectural,' but it continues to\npresent mainstream history as factual\".iv Gable et. al go on to detail cases where fact-based\nhistory, which Colonial Williamsburg claims to provide, was distorted or outright ignored\n\nbecause of social or political pressure. One particularly egregious example of manipulation\nregards the consumption of watermelon by slaves:\n\"...Crop records indicate watermelon was a major staple in the summer diet\nof Virginia slaves and by far the most widely grown melon... curators placed\nwatermelon pieces and rinds in the [slave] houses... however interpreters\nresisted what they felt was black stereotyping... the watermelon was\nremoved from the cabins, and the next year other kinds of melons were\ngrown and displayed.\"v\n\nThis is one example of blatantly manipulated historical facts deemed acceptable by the\nhistorical curators and the public-facing interpreters because of prevailing social pressure.\nGable et. al also write about conflicts of interest at Colonial Williamsburg in a piece titled\nPublic History, Private Memory. They discuss how Colonial Williamsburg tries to distance\nitself from attractions like Disney Land by claiming to present \"the 'real thing'\".vi In the BBC\ndocumentary Digging for Slaves, one of the black interpreters at Colonial Williamsburg\ndescribes how his presentation of history is limited by a desire to not alienate the majority-\nwhite visiting population. The mere presence of compromise and inconsistency in a history\nmuseum proves that social changes have influenced our present view of history. Can a\nmuseum change history? Only if history is not actually \"a narrative account of some past\nsequence of events constructed by a historian 'located' at some considerable 'distance'\nfrom the events.\"vii It seems like the historians at Colonial Williamsburg are all too close the\nsubject at hand and prevailing social and political opinions prevent them from working\nindependently and factually.\n\nIdeas presented by Paul Connerton and the MAAH describe reasons why certain\ngroups create memories and histories. The museum was founded in the 1970's by civil\nrights activist Sue Bailey Thurman as a way to remember, and use the memory of, the\nabolitionist movement of the 1800's. Mrs. Thurman saw power in the history and memory\n\nof the work done by the black community in the African Meeting House during the 19th\ncentury. The museum has a political and social purpose yet also participates in factual\nobject-based history. Paul Connerton talks about political motivation for interpreting\nhistory in his book How Societies Remember. Connerton describes how at the time of the\nCrusades:\n\n\"Medieval Muslim historians did not share with medieval European Christians the\nsense of witnessing a great struggle between Islam and Christendom... But in the\nperiod since 1945 an expanding body of Arabic historical writing has taken the\nCrusades as its theme. The Crusade have become a code word for the malign\nintentions of the Western powers.\"viii\nCertain histories reinterpreted centuries later by historians now include new opinions that\nclosely follow the social memory of people oppressed by occupation after World War Two.\nClearly history can be created, from facts, but it is colored by the social and political\nenvironment of the time.\n\nAll the evidence presented by these sources shows that history is malleable under\nthe force of social pressure and political purpose. These lapses in objectivity dismantle the\nauthority of historians and accuse them of being creators of social memory. Even though\nthese papers and their subjects are temporally distant from the reader, the implied\nargument is that these manipulations are everywhere and many Colonial-Williamsburg-\nstyle moments are waiting to be discovered. The expectation is that we will uncover,\nanalyze and rectify the subjective wrongs of the previous generations to make them fit our\ncurrent social and political influences. This presents an irony, a slow churn that marches\nover generations, each society tweaking and re-imagining the past, and accusing previous\nhistorians as driven by subjective analysis. Connerton was right, even in historical\nrelativism, a revolution is never truly new.(mark)ix\n\ni Paul Connerton, How Societies Remember, 13\nii Eric Gable et. al, On the Uses of Relativism, 793\niii Eric Gable et. al, On the Uses of Relativism, 794\niv Eric Gable et. al, On the Uses of Relativism, 791\nv Eric Gable et. al, On the Uses of Relativism, 802\nvi Eric Gable, Public History, Private Memory, 243\nvii Eric Gable, Public History, Private Memory, 238\nviii Paul Connerton, How Societies Remember, 15\nix Paul Connerton, How Societies Remember, 6\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21A.104 / 21A.119 Memory, Culture, Forgetting\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21A.104S16 Memory, Culture, and Forgetting: Assignments - Student Example Reader Response 2B",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-104-memory-culture-forgetting-spring-2016/a29544c43c0c814a35839c70cce38fce_MIT21A_104S16_Response2B.pdf",
      "content": "Reader Response 2\n\nMemory can be considered to be one of the most integral parts of an individual.\nMemories seem to belong wholly to oneself, and represent everything we believe to be true.\nHowever, as introduced through various media this week, memory consists not only of\nrecollections which reside within each individual, but is also that which is retained and\ninfluenced by society as a whole. In \"How Societies Remember\", Paul Connerton explores the\npolitical manipulation of memory, as well as important classifications of specific types. Through\n\"On the Uses of Relativism\" and \"Public History, Private Memory\", Eric Gable and other writers\nuse Colonial Williamsburg to present dichotomies in how the past is remembered. The film\n\"Digging for Slaves\" and the Museum of African American History then provided visual and\natmospheric evidence of social memory.\n\nThe first text utilizes the French Revolution as an example of how societies seek to create\nor destroy shared memory. As is similar across many revolutions, the new regime of this period\nutilized commemorative ceremonies and changes to bodily practices in an effort to overwrite the\npast (Connerton, 7). However, in doing so the old regime was still recognized, as executions bore\nsimilarities to coronations, and new liberal fashion required past context to be relevant\n(Connerton, 9-12). This text also presented three types of memory: personal memory (that which\nis individual and contains past states), cognitive memory (conceptual ingrained knowledge, such\nas language), and habit memory (something known beneath awareness) (Connerton 22-24). This\nlack of awareness distinguishes habit memory from rules, as rules may be understood and\njudged, while habits are engrained (Connerton, 30-31).\n\nThe next two papers utilize Colonial Williamsburg to more specifically analyze the\ndistinction between personal and historic memory. In Colonial Williamsburg, there is a\ndichotomy in the recreation and representation of white and black history (Gabe, et al., 792).\n\nWhite history was recreated from accounts, often made by elite and privileged individuals, while\nblack history relied on physical evidence, which was less individuating (Gabe, et al., 794 - 796).\nFrom the Wythe House to the Governor's Palace, Colonial Williamsburg was constructed as a\nblend of the personal memories of whites, and memories historically preserved and related to\nslaves (Gabe, et al., 798 - 800). This site continues not only to reconstruct personal and historic\nmemories, but also to create and instill them within its guests. Colonial Williamsburg expresses a\nresponsibility to provide history to its guests, yet they must also create a pleasing experience for\nvisitors to remember and desire to return to (Gabe, Handler, 238). The atmosphere has been\ncontinuously changed, from editing the landscape to its buildings, in order to better align with\nexpectations (Gabe, Handler 240). As the environment is molded and time passes, visitor's\nmemories are put up against history, and it appears that personal memories--created by this\ndynamic recreation of the past--are retained and not the historical past itself (Gabe, Handler\n244-247).\n\nThese texts contain themes worthy of analysis, which the film \"Digging for Slaves\" and\nour museum trip help facilitate. Firstly, there is sufficient evidence that societies collectively\ninvent memories, such as the traditions instilled by new regimes, historical reconstructions and\npersonal experiences at Colonial Williamsburg, and presentations of restored locations in the\nMuseum of African American History. These memories may be considered social constructs as\nthey were created with intent. How the past is made to be presented impacts which memories are\ninstilled within an individual, and to a greater extent, the population. For example, Colonial\nWilliamsburg chooses how to portray its grounds, and the memories visitors walk away with are\na direct result of those choices. If the site decided to not portray \"the other half\" (as it was\ntermed), the stories told by the African American tour guide in \"Digging for Slaves\" would not\nhave entered into the memories of others. Both he and our own guide at the museum exert further\n\npower in creating memories within us, as what we take to be historical is a direct result of how\neach of them chose what to include and omit in their stories of the past.\n\nAnother key theme across these media is the value of teaching history versus\nentertainment when it comes to portraying the past. Colonial Williamsburg, \"Digging for\nSlaves\", and the Museum of African American History seek to portray history in a way which is\nengaging enough to attract the general population. In the Museum of African American History,\nmany exhibits are comprised of notable texts on black heritage accompanied by notecards which\nsummarize and provide context for the work. These summaries are interesting and engaging, but\ndo little to deliver the whole historical memory enclosed within the book. In \"Digging for\nSlaves\", there is entertainment value in learning about the slaves owned by Jefferson, but\nshowing their above-average quarters disregards the historical reality of worse conditions the\naverage slave would have experienced. Perhaps this tradeoff for entertainment is necessary, as\nwithout it there may not have been enough care to learn anything at all. However, with or\nwithout entertainment it seems that there is still some history which goes forgotten, deemed of\ntoo little value to remember.\n\nThrough texts, film, and museum presentations, it is clear that societies work to\ncollectively create and share memory. However, due to the inherent politics within any group,\nthese memories do not always resemble their historical truth. As said by George Santayana,\n\"Those who do not learn history are doomed to repeat it.\" Perhaps this comes not just from\nignoring lessons or forgetting the past though, but from remembering something entirely\ndifferent than what once was.\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21A.104 / 21A.119 Memory, Culture, Forgetting\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "21A.104S16 Memory, Culture, and Forgetting: Assignments - Student Example Reader Response 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21a-104-memory-culture-forgetting-spring-2016/db3fcb93bcc5ad8ce034dc921b050f4b_MIT21A_104S16_Response3.pdf",
      "content": "Reader Response 3: Memory Set in Stone - Monuments and Memorials\n\nSocieties commemorate themselves with monuments and memorials to honor past\nbravery, usually regarding the death of those deemed worthy of commemoration. The\npresence and implementation of these monuments can be very politically motivated and\noften takes on new meaning beyond the recognition of a single person or war. The sources\npresented below detail multiple aspects of memorialization, or construction of memory.\nThe papers concerning the Vietnam War Memorial and Lincoln memorial discuss the\npolitical turmoil surrounding these structures at length, suggesting the importance of\npolitics in memory. The creation and destruction of memory is also brought into focus by\nthe famous fortress of Masada in Israel and its modern use as a rallying call for zionism, as\nwell as Pierre Nora's work Between Memory and History. Each interpretation and case\nstudy demonstrates that the politics of memory can be used to gain or demonstrate\npolitical power and ensure it for the foreseeable future. Memories are victim to political\nmanipulation because once a memorial is completed, its message stands for all time and the\npolitical processes that shaped it are metaphorically and physically set in stone.\n\nThe ancient story of Masada has been manipulated and magnified to serve political\npurposes since World War Two by building a historical reference for the plight and bravery\nof the Jewish community. Recorded by a captured Jewish historian Josephus, the tale of\nMasada depicts captured Isreali rebels defending a heavily fortified hilltop from Roman\nlegions.i Rather than surrendering after multiple years of siege, the entire garrison of the\nfort commits mass suicide as the ultimate rejection of the Roman's advance.ii While known\nat the time, the event was minor compared to other aspects of the Isreali rebellion like the\ncapturing of Jerusalem.iii However, a poem featuring the story of Masada gained popularity\n\nduring the inter-war years and sparked a resurgence of interest in the battle, causing\n\"Masada will never fall again\" to become a rallying cry of Zionism.iv The resurgence of\nMasada was a politically valuable occurrence that reimagined a practically forgotten event\nas a present day tool. Beyond resurrecting the memory of Masada, the popular narrative of\nthe event resurrects the dead by omitting the mention of mass suicide that was the focus of\nJosephus's ancient record, in favor of depictions of bravery and patriotism.v The narrative\nof Masada has become institutionalized in film and practice, and serves as part of official\narmy training in Israel. The conversion of memory to history is also of import to Pierre\nNora, an outspoken voice against post-memory society. Although living memory of Masada\ndied out long ago, Nora would consider Masada's rebirth as another example of how the\n\"people of memory\", the Jews, had history thrust upon them.vi\n\nThe extended tentacles of politics also embrace our physical commemorations of the\npast, through bitter and entrenched debate regarding the details--architectural,\ninterpretive, and logistical--of a monument or memorial. The final implementation of the\nVietnam War Memorial (VWM) was heavily debated and scrutinized by multiple parties for\nits decidedly non-traditional appearance. Designed by Maya Lin, a young chinese-american\nwoman at the time, the VWM is a large V composed of two modernist black marble ramps\ndescending into the earth covered in the names of fallen soldiers. viiIt can be easily and\nviciously contrasted with the white marble obelisk of the Washington Memorial and the\nother white, greco-roman inspired pillars and monuments that surround the Washington\nMall. Frequently opposed for its supposedly feminine and defeat-filled design, the VWM\nwas a source of contention between modern artists, Vietnam Veterans, and members of\nboth political parties.viii By not erecting a white marble slab, the memorial implies defeat\n\nand worse, disapproval for the war as a whole. The Lincoln Memorial was not created until\ndecades after his assassination for similarly political reasons.ix Lincoln represented the civil\nwar and the country took a generation to reach the point where the political environment\nwas favorable enough to build a large white marble memorial that honors the president as\na liberator and hero. xDespised by many during the civil war, Lincoln's national image\nsteadily improved and today he is universally celebrated as a hero. However, opinion of the\nVietnam War has remained negative and with hints of regret and disappointment. Once the\nmark is made, the political symbol is set in stone and dominates all further discussion.\n\nThe conversion of memory (debatable) into history (fixed) is a political game to be\nplayed and won. Surprisingly, after all of the vigorous debate and manipulation, memorials\nand histories tend to fade away in a few generations. Robert Musil touches upon this\nsubject quite comically by claiming that \"Since we can do them no more harm in life, we\nthrust them with a memorial stone hung around their neck into the sea of oblivion.\"xi His\npaper outlines how memorials are frequently ignored and blend into the background\nunlike the constant pestering of advertisements. The power of a memorial is directly a\nresult of its unassuming nature. If the purpose or presence of a memorial were open to\nquestion, than they wouldn't represent such a firm account of our history. The memorial is\nsupposed to be sub-concious, undebatable, and aloof from political discussion because it is\nuniversally recognized as fact. The politics of memory are made permanent by the history\nof memorials, lending the memorializers considerable power.\n\ni Yael Zerubavel, Death of Memory and the Memory of Death: Masada and the Holocaust as\nHistorical Metaphors, 74\nii Zerubavel, Death of Memory and the Memory of Death, 74\niii Barry Schwartz et al. The Recovery of Masada: A Study in Collective Memory, 149\niv Barry Schwartz et al. The Recovery of Masada: A Study in Collective Memory, 148\n\nv masada film\nvi Pierre Nora, General Introduction: Between Memory and History, 2\nvii Marita Sturken, Tangled Memories, 46\nviii Marita Sturken, Tangled Memories, 49\nix Kenneth E. Foote, Shadowed Ground, 49\nx Kenneth E. Foote, Shadowed Ground, 51\nxi Robert Musil, Posthumus Papers of a Living Author, 68\n\nMIT OpenCourseWare\nhttps://ocw.mit.edu\n21A.104 / 21A.119 Memory, Culture, Forgetting\nSpring 2016\nFor information about citing these materials or our Terms of Use, visit: https://ocw.mit.edu/terms."
    }
  ]
}