{
  "course_name": "Meta-ethics",
  "course_description": "No description found.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Humanities",
    "Philosophy",
    "Ethics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 session / week, 1.5 hours / session\n\nPrerequisites\n\nMIT students were required to have taken one philosophy subject or to obtain permission of instructor.\n\nCourse Overview\n\n\"Killing is wrong!\" \"You ought not lie.\" \"It's better not to make a promise than to make one and break it.\"\n\nThese are all examples of\nmoral statements\n. They are the kinds of claims you try to sort out in an ethics class. In this class, we will be asking questions about the nature of morality and ethical inquiry. For instance, are any moral statements objectively true? How is moral inquiry similar to and different from scientific inquiry? Are moral facts and properties on a par with non-moral (natural) facts and properties (like being negatively charged, having brown hair, etc.)? What does it mean to say \"Killing is wrong\"? Is it similar to saying \"The act of killing has the property of wrongness\"? Is it similar to saying \"Don't kill\"? Why should we be moral at all? Is it always the case that it would be better to be morally better?\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation\n\n10%\n\nPop quizzes\n\n10%\n\nReading responses\n\n20%\n\nFirst paper\n\n25%\n\nSecond paper\n\n35%\n\nClass participation is based on actively engaging in class discussion and / or asking questions in office hours.\n\nPop quizzes will assess your understanding and retention of philosophical ideas, but will not assess your ability to engage philosophically.\n\nReading responses will assess your ability to understand and engage with written philosophy on your own (prior to class discussion) and will be assigned throughout the course (about one every other week, except for weeks when a paper is due).\n\nEach assignment should be turned in at the beginning of class the day it is due. Late papers without a valid excuse will result in a reduction of one letter grade for each day they are late.\n\nYou are encouraged to discuss the assignments with others in the class, but any work you turn in must be your own.",
  "files": []
}