{
  "course_name": "Metropolis: History of New York City",
  "course_description": "Hitherto it had gone by the original Indian name Manna-hatta, or as some still have it, ‘The Manhattoes’; but this was now decried as savage and heathenish… At length, when the council was almost in despair, a burgher, remarkable for the size and squareness of his head, proposed that they should call it New-Amsterdam. The proposition took every body by surprise; it was so striking, so apposite, so ingenious. The name was adopted by acclamation, and New-Amsterdam the metropolis was thenceforth called.\n—Washington Irving, 1808\n\nIn less tongue-in-cheek style, this course examines the evolution of New York City from 1607 to the present. The readings focus on the city’s social and physical histories, and the class discussions compare New York’s development to patterns in other cities.",
  "topics": [
    "Humanities",
    "History",
    "American History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Urban Studies",
    "Humanities",
    "History",
    "American History",
    "Social Science",
    "Anthropology",
    "Cultural Anthropology",
    "Urban Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\n1 session / week, 3 hours / session\n\nCourse Description\n\nHitherto it had gone by the original Indian name Manna-hatta, or as some still have it, 'The Manhattoes'; but this was now decried as savage and heathenish... At length, when the council was almost in despair, a burgher, remarkable for the size and squareness of his head, proposed that they should call it New-Amsterdam. The proposition took every body by surprise; it was so striking, so apposite, so ingenious. The name was adopted by acclamation, and New-Amsterdam the metropolis was thenceforth called.\n\n--Washington Irving, 1808\n\nIn less tongue-in-cheek style, this course examines the evolution of New York City from 1607 to the present. The readings focus on the city's social and physical histories, and the class discussions compare New York's development to patterns in other cities.\n\nRequirements\n\nYour grade is composed of two essays, two possible quizzes, a final exam, and class participation. Further details about the essays are given under\nAssignments\n. The specific guidelines will be discussed in class.\n\nBooks\n\nA detailed schedule of readings by class session is given on the\nReadings\npage.\n\nShorto, Russell.\nThe Island at the Center of the World: The Epic Story of Dutch Manhattan and the Forgotten Colony that Shaped America\n. New York, NY: Vintage, 2005. ISBN: 9781400078677.\n\nRichter, Daniel K.\nThe Ordeal of the Longhouse: The Peoples of the Iroquois League in the Era of European Colonization\n. Chapel Hill, NC: University of North Carolina Press, 2006. ISBN: 9780807843949.\n\nKuo Wei Tchen, John.\nNew York Before Chinatown: Orientalism and the Shaping of American Culture, 1776-1882\n. Baltimore, MD: Johns Hopkins University Press, 2001. ISBN: 9780801867941.\n\nWilentz, Sean.\nChants Democratic: New York City and the Rise of the American Working Class, 1788-1850\n. New York, NY: Oxford University Press, 2004. ISBN: 9780195174496.\n\nGilfoyle, Timothy.\nCity of Eros: New York City, Prostitution, and the Commercialization of Sex, 1790-1920\n. New York, NY: W. W. Norton, 1994. ISBN: 9780393311082.\n\nJackson, Kenneth T.\nCrabgrass Frontier: The Suburbanization of the United States\n. New York, NY: Oxford University Press, 1987. ISBN: 9780195049831.\n\nChauncey, George.\nGay New York: Gender, Urban Culture, and the Making of the Gay Male World, 1890-1940\n. New York, NY: Basic Books, 1995. ISBN: 9780465026210.\n\nFreeman, Joshua.\nWorking Class New York: Life and Labor Since World War II\n. New York, NY: The New Press, 2001. ISBN: 9781565847125.\n\nBeckert, Sven.\nThe Monied Metropolis: New York City and the Consolidation of the American Bourgeoisie, 1850-1896\n. New York, NY: Cambridge University Press, 2003. ISBN: 9780521524100.",
  "files": []
}