{
  "course_name": "Microelectronic Devices and Circuits",
  "course_description": "6.012 is the header course for the department’s “Devices, Circuits and Systems” concentration. The topics covered include modeling of microelectronic devices, basic microelectronic circuit analysis and design, physical electronics of semiconductor junction and MOS devices, relation of electrical behavior to internal physical processes, development of circuit models, and understanding the uses and limitations of various models. The course uses incremental and large-signal techniques to analyze and design bipolar and field effect transistor circuits, with examples chosen from digital circuits, single-ended and differential linear amplifiers, and other integrated circuits.",
  "topics": [
    "Engineering",
    "Computer Science",
    "Computer Design and Engineering",
    "Electrical Engineering",
    "Electronics",
    "Engineering",
    "Computer Science",
    "Computer Design and Engineering",
    "Electrical Engineering",
    "Electronics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1 hour / session\n\nRecitations: 2 sessions / week, 1 hour / session\n\nHandouts\n\nList of topics covered (\nPDF\n)\n\nDiagnostic exercises (\nPDF\n)\n\nSolutions to diagnostic exercises (\nPDF\n)\n\nReadings\n\nRequired Textbook\n\nFonstad, Clifton.\nMicroelectronic Devices and Circuits\n. 2006 Electronic Edition. Available online at\nDSpace@MIT\n.\n\nYou may also wish to refer to the following:\n\nHowe, Roger, and Charles Sodini.\nMicroelectronics: An Integrated Approach\n. Upper Saddle River, NJ: Prentice Hall, 1996. ISBN: 9780135885185.\n\nModular Series on Solid State Devices\n\nPierret, Robert.\nVolume I: Semiconductor Fundamentals\n. 2nd ed. Upper Saddle River, NJ: Prentice Hall, 1988. ISBN: 9780201122954.\n\nNeudeck, George.\nVolume II: The PN Junction Diode\n. 2nd ed. Upper Saddle River, NJ: Prentice Hall, 1998. ISBN: 9780201122961.\n\n------.\nVolume III: The Bipolar Junction Transistor\n. 2nd ed. Upper Saddle River, NJ: Prentice Hall, 1989. ISBN: 9780201122978.\n\nPierret, Robert.\nVolume IV: Field Effect Devices\n. 2nd ed. Upper Saddle River, NJ: Prentice Hall, 1990. ISBN: 9780201122985.\n\nProblem Sets\n\nMost problem sets will be handed out in recitation on Wednesdays, and will be due the following Wednesday. Solutions submitted late will be noted as having been submitted, but there is no guarantee that they will be graded. This will depend on the availability and agreeably of the graders.\n\nWe welcome collaboration, but we also want to know who you have worked with on the problem set, and we expect you to prepare the final solution individually and to hand in your own work. What you put down on paper must honestly reflect your effort and ability. If you have worked closely with other students to figure out solutions to a problem set, please so state at the end of the solution you submit; this will help us confirm that problem sets were not copied and protect you from being wrongly accused.\n\nTutorials\n\nThe Teaching Assistants will conduct one-hour tutorial sessions each week for small groups of students. Written problem set solutions will be distributed at the tutorial session immediately following the due date.\n\nExams\n\nThere will be two evening exams. These exams will be closed book, and you will be able to bring a 2-page, hand written crib sheet (to be handed in with your exam). You should also bring a calculator. There are no formal recitations on exam days, but your recitation instructors will be available in their offices to answer questions during your normal recitation hours. There will be a three-hour closed book final exam.\n\nDesign Problem\n\nA special take-home exam problem on circuit design will be distributed after Ses #19; this assignment will be due a bit more than two weeks later. Late design problems will not receive full credit. Students must submit a satisfactory design problem solution to receive a grade in 6.012.\n\nGrading\n\nThe following algorithm will be used to establish a score for you in 6.012: (1) two hour exams, 20% each; (2) final exam, 33%; (3) design problem, 15%; (4) problem sets, 12% total.\n\nThis score will serve as a starting point for an assessment by the staff of your overall mastery of the subject matter. Your letter grade will also reflect your performance in recitations and tutorials, and will be the outcome of the total evaluation process.",
  "files": [
    {
      "category": "Resource",
      "title": "Special Problem on Circuit Design",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/7fe6e5167ac1d9903b188027b7caab19_MIT6_012F09_design.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 Microelectronic Devices and Circuits - Fall 2009\nSPECIAL PROBLEM ON CIRCUIT DESIGN - 12/1/09 edition\nIssued:\nWednesday, November 18, 2009; updated Dec. 1.\nDue:\nFriday, December 4, 2009 and on (be sure that your name is checked off\nthe master list as you hand in your solution). Late\nsolutions will receive zero points; see I.5 below.\nUpdates: Issues will be dealt with as needed; watch your e-mail.\nI. General Comments\nDo not panic when you see the circuit. It looks overwhelming at first but it is\nmade up of simple building-block pieces and it is understandable. In addition,\nyou will be given help along the way, first by this write-up, and later in\nrecitations, lectures, and additional handouts. At the same time, the design\nprocess you need to go through is a complex one and it is not one you will\nsuccessfully negotiate in one sitting. Thus it is important that you get started,\nfirst developing an understanding of the circuit and the nature of the design\nchallenge, and then at doing your design. You can do it, but not in one night.\nII. The Ground Rules\n1. Consider this design problem more like an open book exam, than a problem\nset. You are encouraged to consult references and to seek guidance from the\n6.012 staff, and to discuss design issues with others, but you should not work on\nyour specific design and write-up with any other students or any other\nindividuals. Nor should you compare design values or performance results with\nother students. The design you submit must be your own; any collaborations\n(and they should be minor) should be noted.\n2. Do not let the design slide until the last week. Make a first attempt at a\nsolution early so you can obtain any clarification and guidance you may need\nfrom the 6.012 staff before the Thanksgiving holiday (Nov. 26-29).\n3. You are required to submit a completed Excel file cover sheet, and a detailed\ndiscussion of your design and your approach to arriving at it. The Excel file\ncover sheet will be available on Stellar. Your write-up should include circuit\ndiagrams for your large signal and incremental analyses, and the equations you\nused and calculations you made. It should also include a discussion of the trade\noffs you considered in your design. View the minimum performance objectives\nas a challenge and try to do even better.\n4. Make reasonable approximations. Do not carry your calculations out to any\nmore than three (3) significant figures.\nYour predicted performance values\nshould also be stated to no more than three (3) significant figures. The following\nare examples of numbers with three significant figures: 1.23, 0.123, 123, 3450,\n0.0345, 6.78 x 109.\n\n5. Anyone who does not submit a design problem solution which demonstrates\na reasonable level of effort will automatically receive zero points and a grade of\n\"I\" for 6.012 (as long as their performance is otherwise passing). An \"I\" received\nfor this reason can only be completed by submitting an acceptable solution to\nthis term's design problem by January 15, 2010. Late solutions will be checked to\ndetermine that they are acceptable, but will receive zero points for purposes of\ndetermining an overall course grade.\nIII.\nDesign Objective\nYour design objective is to specify transistor dimensions for the integrated\nlinear amplifier shown in Figure 1 on Page 3 so that it meets or, hopefully,\nexceeds the performance objectives itemized below. You are able to increase\nMOSFET gate widths and/or lengths and BJT areas by integer multiples.\nThe circuit, which is described in full detail in Section V, is a BiCMOS\ndifferential amplifier designed to have a large differential-mode gain, large\ncommon-mode rejection ratio, large common mode input voltage range, and\nlarge output voltage swing.\nYou are to specify the dimensions of the devices in the circuit in Figure 1, and\nto calculate the corresponding bias levels and performance characteristics. You\nare also expected to discuss the main aspects of your design in your solution\nwrite-up, and to also discuss there the factors you took into consideration in\narriving at your design.\nPerformance Objectives:\n1) Small signal gains defined by writing vout = Avc(vin1+vin2)/2 + Avd(vin1 -vin2)\na)\nSmall-signal differential-mode voltage gain, Avd, into a 50 Ω load: as\nlarge as possible, and not less than 125,000\nb)\nSmall-signal common-mode voltage gain, Avc, into a 50 Ω load: as small\nas possible, and not more than 0.002\n2) Common-mode rejection ratio, Avd/Avc : ≥ 5 x 107\n3) Small-signal output resistance, rout: ≤ 10 Ω.\n4) Maximum output voltage swing into a 50 Ω load, |vOUT|max: ≥ 0.75 V.\n5) Minimum common-mode input voltage range, |vIC|min: ≥ 0.75 V.\n6) Total quiescent power dissipation not to exceed 8.5 mW.\n7) Output Voltage, i.e. the quiescent\nvoltage at the output, i.e. vOUT,\nwhen vIN = 0, in a feedback\ncircuit like that illustrated to the\nright assuming perfect element\nmatching: |VOUT| ≤ 20 μV.\n+\n-\n50 !\nR\n+\n-\nR\nvOUT\nvIN\n+\n-\nAvd\nInput 1\nInput 2\n\nIV.\nComponent Specifications\nA.\nTransistors\nAll of the MOSFETs in this amplifier should be operated in strong inversion\n(as opposed to sub-threshold). Some of the transistors in the circuit can be\nchosen to be the smallest devices that can be made with the fabrication process\nused, but others will have to be designed to be larger; this might be done to\nadjust the value of a current source, for example, or to maximize the gain of a\nstage. In the listing below the properties of the minimum size devices are listed\nfirst and then the scaling rules for designing larger devices are given.\n1. npn Bipolar Transistors -- The npn transistors are vertical structures that have\nthe following large-signal and small-signal (hybrid-π) parameters\na)\nMinimum size devices\ni)\nβF = 200\nii)\nIC = 100 μA when VBE = 0.6 V (i.e. IES = 10-14 A)\nVCE,sat = 0.3 V\niii)\ngm = qIC/kT,\ngπ = gm/βF\ngo = IC/|VA| with |VA| = 50V\niv)\nOperating range: 1.0 μA ≤ IC ≤ 3 mA\nb)\nScaled devices -- You may increase the base-emitter junction area by\nup to a factor of 25 times. Increasing the base-emitter junction area, AE, by\na factor of γ, increases the current limits on the operating range by the\nsame factor. The emitter-base diode saturation current in the Ebers-Moll\nmodel, IES, increases by the same factor, γ; so too does ICS. No other static\nmodel parameters change.\n2. pnp Bipolar Transistors -- The pnp transistors are lateral structures that have\nthe following large-signal and small-signal (hybrid-π) parameters\na)\nMinimum size devices\ni)\nβF = 100\nii)\nIC = -100 μA when VBE = -0.6 V (i.e. IES = 10-14 A)\nVCE,sat = -0.3 V\niii)\ngm = q|IC|/kT, gπ = gm/βF\ngo = |IC|/|VA| with |VA| = 50V\niv)\nOperating range: 0.5 μA ≤ IC ≤ 1.5 mA\nb)\nScaled devices -- You may increase the base-emitter junction area by\nup to a factor of 25 times. Increasing the base-emitter junction area, AE, by\na factor of γ, increases the current limits on the operating range by the\nsame factor. The emitter-base diode saturation current in the Ebers-Moll\nmodel, IES, increases by the same factor, γ; so too does ICS. No other static\nmodel parameters change.\n\n3. n-channel MOSFET's -- The n-channel MOSFET's are enhancement-mode\ndevices with the following large and small-signal parameters.\na)\nMinimum size devices (W = Wmin, L = Lmin)\ni)\nK = 5.0 mA/V2\nα = 1\nii)\nVT = + 0.4 V\niii)\ngm = K(VGS -VT) = (2KID)1/2 = 2ID/(VGS -VT)\ngo = λID = ID/|VA| with |VA| = 10 V\niv)\nOperating range: (VGS - VT) ≥ 0.1 V\nb)\nScaled devices -- The width of the gate (and channel), W, can be as\nlarge as 150 Wmin, and the length can be long as 4 Lmin. The magnitude of\nthe Early voltage increases linearly with L.\n4. p-channel MOSFET's -- The p-channel MOSFET's are enhancement-mode\ndevices with the following large and small-signal parameters.\na)\nMinimum size devices (W = Wmin, L = Lmin)\ni)\nK = 2.5 mA/V2\nα = 1\nii)\nVT = - 0.4 V\niii)\ngm = K(VSG -|VT|) = (2K|ID|)1/2 = 2|ID|/(VSG -|VT|)\ngo = λ|ID| = |ID|/|VA| with |VA| = 10 V\niv)\nOperating range: (VSG - |VT|) ≥ 0.1 V\nb)\nScaled devices -- The width of the gate (and channel), W, can be as\nlarge as 150 Wmin, and the length can be long as 4 Lmin. The magnitude of\nthe Early voltage increases linearly with L.\nB. Power Supplies\nThe power supplies are ideal voltage sources with fixed values of 1.5 V and\n-1.5 V relative to ground.\nV.\nDiscussion of the Circuit\nYou should first look at the circuit carefully and identify its various pieces.\nInitially the circuit looks very complicated but if you break it into its component\nparts and understand what each does and how they interact, you will find that\nthe amplifier is actually much less formidable.\nBegin by identifying the biasing circuitry and the current sources, in this case\nthree n-channel MOSFETs (Q10, Q19, and Q22), two p-channel MOSFETs (Q1 and\nQ16), and two you can choose to make either n- or p-channel (Q2 and Q3; you\nmust also specify where the gates and substrates of these two transistors are\nconnected).\nThe chain formed by Q1, Q2, Q3, and Q22 determines the voltages at points A\nand B, which are used to establish the gate-to-source voltages of transistors\nfunctioning as current sources, Q10, Q16, and Q19. Specifically, Q10 functions as a\ncurrent source that directly biases the first stage (transistors Q4, Q5, Q6, Q7, Q8,\n\nand Q9), and indirectly also biases the second stage (transistors Q11, Q12, Q13, Q13',\nQ14, and Q15). Transistors Q16 and Q19 function as current sources that are the\nstage loads (non-linear) of the pnp and npn BJT emitter follower stages\ncontaining transistors Q17 and Q18, respectively; they also bias Q17 and Q18.\nOnce you see which transistors are involved in current source biasing you can\nmentally replace them with current sources, as we will do in Figure 2, and ignore\nthose devices initially, and until you have decided what levels of bias current\nyou need.\nMove on next to look at the amplifier stages, starting with the input stage, Q8\nand Q9. This stage is an n-channel MOSFET common-source differential stage,\ni.e., a source coupled pair, loaded with an active load called the Lee Load, after\nProfessor Tom Lee of Stanford (a former 6.012 student) who invented it (not in\n6.012).\nThe Lee Load looks incrementally like a very large resistor for\ndifferential-mode inputs, and like a very much smaller resistor for common-\nmode inputs.\nThe difference-mode voltage gain is thus very large and the\ncommon-mode voltage gain is less than one (i.e., it is not a gain, but an\nattenuation). Consequently using the Lee Load results in a gain stage with a\nlarge common-mode rejection ratio.\nThe second stage is a common source differential stage loaded with an active\nload called a current mirror. By using a p-MOS second gain stage it is possible to\nbias this stage directly from the first stage, rather than the more conventional\nway in differential circuits of using a current source to bias it. This increases the\npositive output voltage swing significantly, which is important in a circuit like\nthis designed to run off only +/-1.5 V voltage supplies.\nIBIAS1\nQ18\nQ20\nQ21\nvOUT\n+\n-\nvIN2\n+ 1.5 V\n- 1.5 V\nvIN1\n+\n-\n+\n-\nQ8\nQ9\nQ17\nQ11\nQ12\nIBIAS3\nIBIAS2\nLee Load\nQ4, Q5, Q6, Q7\n(active load)\nCurrent Mirror\nQ14, Q15\n(active load)\nwith level shift\nQ13\nFigure 2 - A simplified schematic of the design problem circuit drawing\nattention to some of the functional units of the circuit. There are four\nstages in this amplifier: From left to right, we find that Stage 1 is an n-\nMOS common-source gain stage with a p-MOS Lee Load; Stage 2 is a p-\nMOS common-source gain stage with an n-MOS current mirror load;\nStage 3 is a pair of emitter-follower buffer stages; and Stage 4 is a bipolar\npush-pull output stage (this is essentially another emitter-follower stage).\n\nThe load of the second stage is an n-MOS current mirror load, and as such it\ndoes several things: First, it provides an active load which effectively applies the\noutput of the Q11 to the gate of Q15, so that the output due to the difference-mode\nsignal input to Q11 is added to the output due to the difference-mode signal input\nto Q12. Doing this converts the output from a double-ended (or differential)\noutput to a single-ended output, and does so in such a manner that we obtain an\nadditional factor of two in gain. (This is explained in Section 12.4, pages 392-395\nin the Course Text.) Second, the current mirror load, like that of the Lee Load,\nlooks different for difference-mode signals and common-mode signals. As a\nconsequence the difference-mode gain of this stage is large. At the same time,\nthe common mode gain of this stage is small.\nThe output of the second stage is taken from the node joining the drains of\nQ12 and Q15. This node is what is called a \"high impedance\" node. Ideally the\nvoltage on this node would match that on the node joining the drains of Q11 and\nQ14, and the voltage on this latter node is known because it is connected to the\ngates of Q14 and Q15. In this circuit you will find that the voltage on this node is\nmuch lower than it should be to achieve the specification that the quiescent\noutput voltage, VOUT, be 0 V. Consequently, the diode-connected BJTs, Q13 and\nQ13', have been inserted to increase the quiescent voltage drain of Q12 and the\nbases of Q17 and Q18.\nThe goal is to increase the quiescent voltage drain of Q12 as much as possible\nwithout limiting the output voltage swing, but it is not possible, nor is it\nnecessary, to make it high enough to itself yield VOUT = 0 V. In practice, the\nquiescent value of the voltage on the drain of Q12 is very sensitive to differences\nin the transistors and process variations, and as a practical matter it cannot be\npredicted with certainty.\nThis is a very common situation in high gain\ndifferential amplifiers and the issue is dealt with by using the amplifier with\nfeedback that stabilizes the quiescent output voltage very near to zero Volts. The\npractical consequence for your analysis is that you can assume that the quiescent\noutput voltage is zero volts.\nYou should then calculate how much of a\ndifferential bias voltage is needed at the input of your design to make VOUT ≈ 0 V\nassuming perfect matching (this will be discussed in class).\nThe third \"stage is a pair of emitter-follower stages, one that uses a pnp\nBJT and the other that uses an npn BJT. These followers are coupled to the fourth\nand final stage, which is a complementary output stage called a push-pull stage.\nThis is basically an emitter-follower stage in which an npn bipolar transistor (Q20\nin this circuit) drives the load (i.e., supplies current to the load resistor) when the\noutput voltage goes above zero, and a pnp bipolar transistor (Q21) drives the load\nwhen the voltage goes negative. With zero output voltage, all four transistors\nare equally on. However, as the output signal goes positive the pnp transistors\nare turned off and the npn transistors turn on more strongly supplying current to\nthe load through Q20. When the output goes negative, the opposite happens and\nthe pnp transistor, Q21, turns on strongly drawing current through the load.\nTaken together the last two stages give the amplifier a low output\nresistance and provide a buffer between the 50 Ohm load and the high gain\nsecond stage. (See Section 11.3.4, and especially the discussion on Page 345, in\nthe Course Text. This is a different push-pull design than that in the text, but the\nbasic idea is the same.) The interactions with the output stages and the second\n\ngain stage are particularly important to consider: First, Q17 and Q18 should be\nsized and biased so that there is no bias current drawn from the second stage.\nYou will find, in fact, that the relative sizes of all of the bipolar transistors ( Q17,\nQ18, Q20, and Q21) are important when designing the biasing. Second, the input\nresistance of the emitter follower stages loads the cascode gain stage and plays\nan important role in limiting the gain of that stage. Third, the output resistance\nof the amplifier is limited in part by the output resistance of the second gain\nstage. The bias currents set by Q20 and Q21 also play an important role in setting\nthe output resistance and you will find that there is a clear trade-off between\noutput resistance and quiescent power dissipation. All told, the output stages\nare perhaps the most interesting part of the circuit, as will become more clear as\nthe design problem circuit is discussed in lecture, recitation, and tutorials.\nVI.\nStarting your Analysis\nAs pointed out earlier, one of the first things to do is to identify the various\nsub-circuits in the full circuit, i.e., the various gain stages, the biasing circuitry,\netc. Then look at each piece individually and understand what it can do and\nwhat constraints are placed upon it. Look at each gain stage, for example, and\nwrite an expression for its gain. Try to get a relationship that depends on the\nbias level and device parameters, and then on any bounds on the dimensions of\nthe devices, and on any limitations on the operating currents and/or voltages of\nthe devices. We know in general, for example, that MOSFET gain stages loaded\nwith non-linear loads formed from transistors biased in their constant current\nregions (i.e., saturation in the case MOSFETs operated in strong inversion) tend\nto have higher gain when biased at low levels of drain current, that is, with small\nvalues of (|VGS|- |VT|). Since there is a minimum value this quantity can have,\nit will be useful to try to express the gain of the current mirror gain stage in terms\nof (|VGS|- |VT|)min, and find what the maximum gain for the stage can be. Then\nyou can begin to understand how you must size and bias the stage to achieve\nthat gain (or as near to it as possible).\nYou should also spend some time understanding the output stages; in\nparticular what the output resistance depends upon and whether that impacts\nany earlier stage(s), and what constraint the output voltage swing specification\nimplies. To analyze the final stage you can assume that both of the transistors\nare active for your incremental modeling, whereas for your large signal analysis\nof the maximum output voltage swing, only one of these transistors will be on at\na time.\nTo help you get started understanding the incremental behavior of the\namplifier, partial small signal linear equivalent circuits for the amplifier with\ndifference- and common-mode inputs respectively are shown in Figure 3a and\n3b. You do not need to work out the effective resistances of the Lee and Current\nMirror loads, but rather can use the gain expressions you will be given in class,\nbut do make sure that you have all the factors of two correctly accounted for, etc.\n(i.e., don't apply the equations your are given blindly).\nThe biasing circuitry can be viewed as a separate issue in terms of\nunderstanding how it operates. Once you do this you can understand how to\nsize the various transistors to achieve the bias levels you need based on your\nunderstanding and analysis of the amplifier proper. Of course, there may be\nlimitations placed on the bias levels you can achieve that force you to adjust your\n\nvod\n+\n-\nvid\n+\n-\nQ8\nQ20\nQ17\nQ12\nroQ16\nroLLdm\nroCMdm\nRLOAD\n(a) Difference-mode input\nvoc\n+\n-\nvic\n+\n-\nQ8\nQ20\nQ17\nQ12\nroQ16\nroCMcm\n2roQ10\nroLLcm\nRLOAD\n(b) Common-mode input\nFigure 3 - Partial linear equivalent circuits for the design problem circuit for\ndifference-mode and common-mode inputs. Notice that the p-MOS second\nstage and pnp third stage have been drawn with their transistors' source\nand emitter, respectively, down, whereas on the full schematic they are up.\nWe can do this in the small signal linear equivalent circuit world because up\nand down are both ground (i.e., both the upper and lower rails are\ngrounds). Notice also that the transistors and loads need to be replaced by\ntheir linear equivalent circuits to get the complete linear equivalent circuit\nof the amplifier, and the factor of 2 enhancement from the current mirror\nhas to be included, but these abstractions help one gain insight.\ndesigns for the amplifier stages, but by that point your understanding of the\ncircuits should be such that making any such adjustments is not a major\ncalamity; a major pain maybe, but no cause for panic.\nA second set of things you should do early in your design process is to look\nthrough the design specifications and understand upon what each depends. As\n\nyou develop an understanding of the circuit, you can write expressions for the\nvarious quantities specified (i.e., voltage gains, input and output resistances,\netc.).\nOnce you begin to understand the pieces and the specifications, make some\ninitial design choices and see what you get. You may find that some parts work\njust fine, while others require major reworking. It may take several iterations to\nmeet all of the specifications, but the more you understand the pieces and their\ninteractions, and understand the implications for the circuit of the constraints\nplaced on the sizes and operating ranges of the devices, the more quickly you can\nget to the answer and the less of a random walk your effort will seem.\nVII.\nEnhancements to the Circuit\nYou are, of course, encouraged to design your circuit to surpass the design\nperformance specifications, particularly the gain specs, by as much as possible.\nIn addition, you are encouraged to think about (and discuss in your write up)\nways that the circuit could be improved beyond the present design, as well as\nwhy certain choices were not made in the design. You might want to consider,\nfor example, using MOSFETs in the output stages, and discussing whether they\noffer performance advantages. You could consider using a cascode in the\nsecond gain stage, which would significantly increase the open circuit gain of\nthat stage, but also considerably increase its output resistance.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/a68e25156eabfde7b8e2dbe7374541f6_MIT6_012F09_assn01.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 1\nIssued: September 11, 2009\nDue: September 16, 2009\nReading Assignments:\nLecture 1\n(9/10/09) - Chap. 1 (all), Chap. 2 (all), Chap.3 (3.1)\nLecture 2\n(9/15/09) - Chap. 3 (all), Chap. 4 (4.1)\nLecture 3\n(9/17/09) - Chap. 4 (4.2, 4.3), Chap. 6 (all)\nProblem 1 - This problem concerns the following three samples of silicon, each of which\nhas a different doping level:\nSample a:\n1017 cm-3 arsenic\nSample b:\n1016 cm-3 boron, 5 x 1015 cm-3 phosphorous\nSample c:\nintrinsic (no dopants)\nComplete a table like that shown below for these three samples. Assume that at room\ntemperature the electron mobility, μe, is 1600 cm2/V-s, the hole mobility, μh, is 600\ncm2/V-s, and the intrinsic carrier concentration, ni, is 1010 cm -3.\nSample Type (n or p)\nno [cm-3]\npo [cm-3]\nResistivity, ρo [Ω-cm]\na\nb\nc\nProblem 2 [A one-dimensional electrostatics problem] - Consider a situation in which there\nis a net charge density profile, ρ(x,y,z), that varies in the x-direction only, i.e. ρ(x,y,z) =\nρ(x). There is a negative sheet charge density, -Q coul/cm2, at x = -50 nm, and a\nuniform positive charge density of 1.6 x 10-2 coul/cm3 between 0 and 300 nm. The\ndielectric constant is 3.5 x 10-9 coul/V-cm for x ≤ 0, and it is 10-10 coul/V-cm for x > 0.\na) Sketch and label ρ(x). The sheet charge density should be represented as an impulse\nat x = -10 nm with an intensity -Q. Assuming the electric field is zero for x < -50 nm,\nand x > 300 nm, what is the strength, Q, of the negative sheet charge at x = -50 nm?\nb) Sketch and label the electric field, E(x), for -100 nm ≤ x ≤ 500 nm. Where does the\nelectric field have its maximum intensity, |E(x)|max, and what is |E(x)|max?\nc) Sketch and label the electrostatic potential, φ(x), for -100 nm ≤ x ≤ 500 nm, and give\nan algebraic expression for φ(x) valid in the region 0 ≤ x ≤ 500 nm. Assume φ = 0.5 V\n\nat x = 500 nm. What is the change in potential, Δφ, between x = -100 nm and x = 500\nnm?\nd) Finally consider how ρ(x), E(x), and φ(x) change if the extent of the uniform charge\ndensity is reduced and it now only extends from x = 0 to x = 200 nm.\ni) Is Q larger or smaller, and by how much?\nii) Is |E(x)|max larger or smaller, and by how much?\niii) Is Δφ larger or smaller?\nProblem 3 -\nA p-type sample of silicon has a resistivity of 5 Ω-cm. In this sample, the hole\nmobility, μh, is 600 cm2/V-s and the electron mobility, μe, is 1600 cm2/V-s. Ohmic\ncontacts are formed on the ends of the sample and a uniform electric field is imposed\nwhich results in a drift current density in the sample is 2 x 103 A/cm2.\na) What are the hole and electron concentrations in this sample?\nb) What are the hole and electron drift velocities under these conditions?\nc) What is the magnitude of the electric field?\nProblem 4 - This problem concerns a sample of Semiconductor X. At room temperature in\nSemiconductor X, the intrinsic carrier concentration, ni, is 107 cm -3, the hole mobility, μh,\nis 300 cm2/V-s, and the electron mobility, μe, is 4000 cm2/V-s. The minority carrier\nlifetime, τmin, is 10-9 s.\nThis sample is known to have 2 x 1016 cm -3 donors and an unknown number of\nacceptors. A measurement is made on the sample and it is found to be p-type with an\nequilibrium hole concentration, po, of 5 x 1017 cm -3.\na) What is the net acceptor concentration, NA (= Na - Nd), in this sample, and what is the\ntotal acceptor concentration, Na?\nb) What is the equilibrium electron concentration, no, in this sample at room\ntemperature?\nc) What is the electrical conductivity, σo, of this sample in thermal equilibrium at room\ntemperature?\nd) This sample is illuminated by a steady state light which generates hole-electron pairs\nuniformly throughout its bulk, and the conductivity of the sample is found to\nincrease by 1% (that is, to 1.01 σo).\nWhat are the excess hole and electron\nconcentrations, p' and n', in the illuminated sample, assuming that the illumination\nhas been on for a long time?\nf) What is the optical generation rate, GL, in Part d?\ng) If the illumination in Part d is extinguished at t = 0, write an expression for the\nsample conductivity as a function of time for t > 0. Express your answer in terms of\nσo, rather than the numerical value.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/8e709672718b39d71c604bf0fa27c7b0_MIT6_012F09_assn02.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 2\nIssued: September 16, 2009\nDue: September 23, 2009\nReading Assignments:\nLecture 3\n(9/17/09) - Chap. 4 (4.2, 4.3), Chap. 6 (begin)\nLecture 4\n(9/22/09) - Chap. 6 (all), Chap. 7 (7.1, 7.2)\nLecture 5\n(9/24/09) - Chap. 5 (5.1)\nProblem 1 - We say that we can approximate the minority carrier lifetime in Si as being\ninfinite even though it is really several hundred milliseconds, because this is a long\ntime compared to the time it takes a hole or an electron to drift or diffuse across a\ndevice to a contact or junction. To verify this statement consider the following two\nquestions:\na) With drift, the time it takes a carrier to go (transit) a distance d is: τtr,Drift = d/μE.\ni) How long does it take an electron (μe = 1600 cm2/V-s) to drift 10 μm in a field of\n10 V/cm?\nii) Repeat a) i) for a hole (μh = 600 cm2/V-s).\niii) Compare your answers in a) i) and a) ii) to a lifetime of 100 ms. Is\napproximating this lifetime as \"infinite\" in this situation reasonable?\nb) With diffusion, the time it takes a carrier to transit a distance d is: τtr,Diff = d2/2D.\ni) How long does it take an electron (De = 40 cm2/s) to diffuse 10 μm in a\nconcentration gradient of 1015 cm -3 per micron?\nii) Repeat b) i) for a hole (Dh = 15 cm2/s).\niii) Compare your answers in a) i) and a) ii) to a lifetime of 100 ms. Is approximating\nthis lifetime as \"infinite\" in this situation reasonable?\n.\nProblem 2 - Do Problem 3.9, Parts a thru d, in the course textbook.\nProblem 3 - Two short problems:\ni)\nDo Problem 4.3 in the course textbook.\nii)\nDo Problem 4.2 in the course textbook.\nProblem 4 - The n-type silicon sample illustrated on the top of the next page is 10 microns\n(μm) long and has metal ohmic contacts, A and B, on either end. The net donor\nconcentration is 1 x 1015 cm -3; the electron mobility, μe, is 1600 cm2/V-s; and the hole\nmobility, μh, is 600 cm2/V-s. The electrostatic potential of the metal relative to intrinsic\nsilicon is 0.2V, and the intrinsic carrier concentration at room temperature is 1010 cm -3.\nUse the 60 mV rule to calculate the electrostatic potential, i.e. use (kT/q) ln 10 = 0.06 V.\n\nn-type (1 x 10 cm )\nA\nB\nOhmic\nOhmic\n5.0\nx [μm]\n-3\n-5.0\na) What are the thermal equilibrium (i.e., no light, vAB = 0 V) hole and electron\nconcentrations and electrostatic potential, φn, in this silicon?\nb) Sketch the electrostatic potential, φ(x), with vAB = 0 V, going from the metal on the\nleft, through the silicon, and into the metal on the right. Dimension your sketch;\nlabel any significant features.\nc) Assume now that vAB = 0.5 V. Sketch the electrostatic potential, φ(x), with vAB = 0.5\nV, going from the metal on the left, through the silicon, and into the metal on the\nright (where you should assume the value of ø is unchanged, i.e. 0.2 V). Dimension\nyour sketch and label any significant features, including φ(0).\ne) When vAB = 0.5 V, what are the electron and hole drift current densities, Je\ndr and Jh\ndr ,\nrespectively, at x = 0 μm\nNext consider a sample similar to our original sample, except that it is doped p-type\nwith a net acceptor concentration of 1 x 1015 cm -3 in the region from x = 0 μm to x = +5\nμm as shown below. Note: This is a diode with the p-side to the right.\nA\nB\nOhmic\nOhmic\n+5.0\nx [μm]\np-type\n\n(1 x 10 cm )\n-3\n-5.0\nn-type\n\n(1 x 10 cm )\n-3\nf) Sketch the electrostatic potential, φ(x), going from the metal on the left, through the\nsilicon, and into the metal on the right, with vAB = 0 V. Dimension your sketch and\nlabel any significant features, including the value of φ(0).\ng) The diode is now reverse biased by vAB = 0.5 V. Sketch the electrostatic potential,\nφ(x), now, going from the metal on the left, through the silicon, and into the metal on\nthe right. Keep φ in the metal to the right of x = 5 μm at the value it had in Part f.\nDimension your sketch and label any significant features, including the value of\nφ(0).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/1ee0953658a1fe7b8484a7c379f26629_MIT6_012F09_assn03.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 3\nIssued: September 23, 2009\nDue: September 30, 2009\nReading Assignments:\nLecture 5\n(9/24/09) - Chap. 5 (5.1)\nLecture 6\n(9/29/09) - Chap. 7 (7.3)\nLecture 7\n(10/1/09) - Chap. 8 (8.1)\nNote: The first hour exam is scheduled for Wednesday night, October 7, from 7:30 to\n9:30 pm Please let me know as soon as possible (by e-mail) if you\nhave a conflict so we can resolve it as painlessly as possible. The exam is closed\nbook and will cover the material through 10/2/09 and Problem Set #4 (p-n junction\ndiodes and BJT basics).\nProblem 1 - Do Problem 7.3 in the course text.\nProblem 2 -\nThis problem concerns a bar of p-type silicon, NA = 1017 cm -3, irradiated on its\nleft end with a uniform electron beam having an electron flux of 1019 cm -2s-1 as\nillustrated below.*\nAs shown, the sample is 10 μm long and has an ohmic contact on its right end; this\ncontact is connected to the electron source to complete the circuit as indicated. In this\nsample the hole mobility, μh, is 600 cm2/V-s; the electron mobility, μe, is 1600 cm2/V-s;\nthe electron diffusion length, Le, is 100 μm; and the intrinsic carrier concentration at\nroom temperature, ni, is 1010 cm -3.\nx (μm)\np-Si, NA = 1017 cm-3\nI\ne-\ne-\ne-\ne-\ne-\ne-\n(a) What is the electron current density just inside the bar at the left end, i.e. what is\nJe(0+)? Show your work and/or explain your answer.\n(b) Write a formula for n'(x) in terms of n'(0) and then determine the value of n'(0).\n* In case you are concerned: The electron beam hitting the left end of the bar behaves like an injecting\ncontact. The injected electrons do not have sufficient energy to generate more hole-electron pairs.\nAlso, no holes can leave the left end of the bar.\n\n(c) Write an expression for the electron current density, Je(x), valid for 0 < x < 10 μm.\n(d) Write an expressioin for the hole current density, Jh(x), valid for 0 < x < 10 μm.\n(e) Write an expression for the electric field, Ex(x), valid for 0 < x < 10 μm.\n(f) What is the voltage drop from end to end in this sample? Note: this is the same\nas the change in electrostatic potential between x = 0 and 10 μm.\nProblem 3 - Do Problem 7.5 in the course text.\nProblem 4 - This problem concerns the two abrupt p-n diodes pictured below. These two\ndiodes have identical dimensions and differ only in the doping levels on the p-sides. In\nboth diodes the n-side is doped with 1017 cm-3 donors. In Diode A the p-side is doped\nwith 1018 cm-3 acceptors and in Diode B it is doped with 1016 cm-3 acceptors. You may\nassume for purposes of this problem that:\n(1) the widths of the depletion regions on either side of the junctions in these\ndiodes are all negligible relative to 5 μm when they are forward biased,\n(2) the hole mobility is 600 cm2/V-s and the electron mobility is 1600 cm2/V-s in\nall regions, and\n(3) the minority carrier diffusion lengths are much larger than 10 μm.\nA\nB\nOhmic\nx [μm]\n+5.0\n-5.0\np-type\n\n(10 cm )\n-3\nOhmic\nn-type\n\n(10 cm )\n-3\nA\nB\nOhmic\nx [μm]\n+5.0\n-5.0\np-type\n\n(10 cm )\n-3\nOhmic\nn-type\n\n(10 cm )\n-3\nA\nB\na)\nWhich diode has the wider zero-bias depletion region? Explain your answer.\nb)\nWith zero applied bias, in which diode is the magnitude of the peak electric field\nin the depletion region largest? Explain your answer.\nc)\nFor which diode will the magnitude of the reverse breakdown voltage be largest?\nExplain your answer.\nd)\nA reverse bias is applied to both diodes so that the depletion region on the n-side\nin each diode is 0.2 μm wide.\ni)\nWhat is the width of the depletion region on the p-side in each diode?\nii)\nOn which diode is the magnitude of the reverse bias larger? Explain.\ne)\nA forward bias is applied to each diode so that the excess hole population on the n-\nside at xn, p'(xn), is 1012 cm-3 in both diodes.\ni)\nWhat are the excess electron populations at the edge of the depletion region on\nthe p-side, i.e., n'(-xp), in each diode?\nii)\nWhat is the ratio of the total hole current to the total electron current through\neach diode at x = 0?\niii)\nWhat is the total excess minority carrier charge per unit area in each diode at this\nbias level? Note: Consider the entire device, i.e., from - 5μm to + 5 μm.\niv)\nWhat is the applied bias on each diode?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/36d966f10ebe72fe06eba0ec0897b0de_MIT6_012F09_assn04.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 4\nIssued: September 30, 2009\nDue: Monday, October 5, 2009 by 5 pm\nReading Assignments:\nLecture 7\n(10/1/09) - Chap. 8 (8.1)\nLecture 8\n(10/6/09 - Chap. 7 (7.5, 7.6)\nLecture 9\n(10/8/09) - Chap. 9 (9.1, 9.2)\nExam 1: The first hour exam is scheduled for Wednesday night, October 7, from 7:30\nto 9:30 pmPleaselet me know as soon as possible (by e-mail) if you\nhave a conflict so we can resolve it as painlessly as possible. The exam is closed\nbook and will cover the material through 10/2/09 and Problem Set #4 (i.e. through\np-n junction diodes and BJT basics). A formula sheet will be provided (see below);\nyou can also bring one two-sided 8.5 x 11 crib sheet (and a magnifying glass if\nnecessary). Old exams and solutions will be posted on Stellar soon.\nFormula Sheet:\nA draft copy of the formula sheet has been posted on Stellar.\nSuggestions for additions, corrections, and/or deletions are welcome.\nProblem 1 - The p- and n-sides of the silicon p-n diode shown above are each 2 μm wide;\nthe depletion regions on either side of the junction are both much narrower than this\nand their widths can be neglected relative to 2 μm; also, Lmin >> 2 μm. . The n-side has a\nnet donor concentration, NDn, of 1016 cm -3. The hole and electron mobilities, μh and μe,\nare 600 cm2/V-s and 1600 cm2/V-s, respectively, throughout the device. (Ignore any\ndependence of the mobilities on doping level.) The cross-sectional area is 10-4 cm2.\nn-side\nNDn = 1016 cm -3\np-side\nID\nA\nB\n-\n+\nVAB\nx\n-wp\n-x p 0 x n\nwn\na) When the bias voltage, VAB, is 0.48 V, what are the following quantities?\ni) The total hole population at the contact on the right end of the device, wn\nii) The total hole population at the edge of the depletion region on the n-side, xn.\n\niii) The excess hole charge stored in the quasi neutral region, QNR, on the n-side of\nthe diode, qQNR,n-side.\niv) The net hole current density crossing the junction, Jh(0).\nb) You are not told explicitly the doping level of the p-side of this diode, NAp, but you\nare told that the total minority carrier (electron) population at the edge of the depletion\nregion on the p-side, n(-xp) is one tenth that of the total minority carrier (hole)\npopulation at xn, p(xn), when the applied voltage, VAB, is 0.48 V, that is p(xn)/n(-xp) = 10.\ni) What must the net acceptor concentration on the p-side, NAp, be?\nii) What is the magnitude of the ratio of the excess electron charge, qQNR,p-side, stored\non the p-side of this diode to the excess hole charge, qQNR, n-side, stored on the n-\nside at this bias?\niii) What is the ratio of the net electron current density crossing the junction, Je(0), to\nthe net hole current density, Jh(0), at this bias point?\niv) What is the total potential step going from the quasi-neutral region on the p-side\nto the quasi-neutral region on the n-side of the biased junction?\nProblem 2 - This question concerns the silicon sample illustrated below which has three\nuniformly doped regions: Regions 1 and 3 are p-type, and Region 2 is n-type. There\nare ohmic contacts on either end of the sample, and there is a contact to Region 2 off\nto the side (much as it is in a bipolar junction transistor). Throughout the sample\nthe electron diffusion coefficient, De, is 40 cm2/s, the hole diffusion coefficient, Dh, is\n15 cm2/s, and τmin ≈ inf. The cross-sectional area is 10-4 cm2.\nRegion 1\np-type Si\nNA1 = 1016 cm-3\nRegion 2\nn-type Si\nND2 =\n1017 cm-3\nRegion 3\np-type Si\nNA3 = ?\nV12\nV32\nI1\nI2\nI3\n+\n+\n!\n!\nx [!m]\nJunction A\nJunction B\nOhmic\nContact\nOhmic\nContact\nWhen Terminal 2 is grounded and bias voltages, V12 and V32, are applied to this\ndevice, the excess minority carrier profiles shown at the top of the next page result\nin Regions 2 and 3. (You have to figure out what happens in Region 1 yourself.)\nYou can ignore the widths of the depletion regions for purposes of working this\nproblem.\n\nx [!m]\np',n' [cm-3]\n1x1014\n(a)\nLooking at Junction B:\n(i) What is JElectron-B, the electron current density crossing Junction B? Recall\nthat this is the minority carrier diffusion current density in Region 3.\n(ii) What is JHole-B, the hole current density crossing Junction B?\n(iii) What is the terminal current I3?\n(iv) What is NA3, the doping level in Region 3?\n(b) Looking at Junction A:\n(i) What is n'(2-), the excess electron concentration at the edge of the quasi-\nneutral region on the p-side of this junction, i.e. just to the left of the edge\nof the depletion region at x = 2-?\n(ii) What is V12, the voltage bias on Junction A?\n(c)\nLooking now at the entire sample, removing the biases V12 and V32, and\nthinking of the structure as a bipolar junction transistor:\n(i) What is the best terminal to use as the emitter, and why?\n(ii) For your choice of emitter above, what is the forward current gain, βF, of\nthis transistor?\nProblem 3 - You are given a silicon npn bipolar transistor with the following parameters:\nWE = 0.25 μm,\nWB = 0.5 μm\nWC = 1.0 μm\nActive device cross-sectional areas: AE = AC = 10-4 cm2\nDh = 10 cm2/s,\nDe = 20 cm2/s\nMinority carrier lifetime, τmin = inf\n(recombination only at contacts)\nCollector doping, NDC = 5 x 1016 cm -3\nVA = 100 V\nA plot of log iC and log iB vs vBE for this device is shown at the top of the next\npage. Such a plot is called a Gummel Plot, after the researcher who first realized\nthat it was a useful tool for measuring βF for BJTs and seeing if and how it varies\nwith vBE:\n\nGummel plot:\n0.7 V\niC\nlog iC, log iB\nValues @ vBE = 0.7 V:\niC = 9.25 mA\niB\niB = 92.5 μA\nvBE\na) What is the forward current gain, βF, in this transistor?\nb) What is the base defect, δB, in this transistor? (Hint: No calculation necessary.)\nc) Calculate the ratio, r, defined as r = (wE,eff·NDE)/(wB,eff·NAB).\nd) Calculate the net acceptor concentration in the base, NAB. (Hint: Do not use your\nanswer in Part c.)\ne) Calculate the net donor concentration in the emitter, NDE.\nf) Plot the excess minority carrier profiles between x = -wE and x = wB+wC for the\nbias condition VBE = 0.7 V, VBC = - 1V. Label the numerical values of the excess\nminority carrier concentrations at the edges of the depletion regions at x = 0 and\nx = wB, and at the contacts. (Note: Neglect the depletion region widths relative\nto the emitter, base, and collector widths.)\ng) Consider the total number of excess minority carriers in the base of this\ntransistor, QB,diff, under each of the following two bias conditions,\nBias A:\nVBE = 0.7 V\nVBC = -1 V\nBias B:\nVBE = 0.7 V\nVBC = 0.7 V\nWhat is the ratio of the QB,diff 's under the two bias conditions? (Suggestion: Try\nsketching n'(x) for 0 < x < wB for each of these biases.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/3f08ed119231f5dc53c2605319916710_MIT6_012F09_assn05.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 5\nIssued: October 7, 2009\nDue: October 14, 2009\nReading Assignments:\nLecture 9\n(10/8/09) - Chap. 9 (9.1, 9.2, 9.3, 9.4)\nLecture 10 (10/15/09) - Chap. 9 (9.3, 9.4)\nLecture 11 (10/20/09) - Chap. 10 (10.1.1a)\nProblem 1 -\nTwo short MOS capacitor problems from the textbook:\na) Do Problem 9.1 in the course text, Parts a, b, c, and d, only. In Part d) ii) use the\nvalue 1000 cm2/V-s for the electron mobility.\nb) Do Problem 9.8 in the course text. A MOSFET connected as it is in this question is\nsimply a MOS capacitor.\nProblem 2 - We have only plotted the net sheet charge densities and the electrostatic\npotential through the MOS capacitors we have discussed, but we have not said\nanything about the electric field. To address this issue, sketch and label the electric field\nthrough an MOS capacitor for biases corresponding to the five conditions illustrated in\nFigure 9.3 (parts a thru f) on pages 244 and 245 in the course text. That is, make the\nelectric field sketches that correspond to this set of charge density and electrostatic\npotential plots.\nProblem 3 - Consider the two silicon device structures shown in cross-section below:\nDevice A:\nDevice B:\nn+\np-Si\n15 μm\n5 μm\nG\nB\nn+\np-Si\nG\n20 μm\nB\nBoth of these devices are made on p-type silicon with a net doping level of 1017\ncm-3, and are 20 μm wide normal to the page. The n+ regions are doped to 1018 cm-3,\nand the n+-p junction is 1 μm from the top surface. The thin oxide is a high quality\n\nthermal oxide 16 nm thick, and covers an area 20 μm wide by 15 μm long. In Device A\nthe n+ region is 20 μm wide by 5 μm long and extends just up to the edge of the thin\noxide, while in Device B it is 20 μm wide by 20 μm long and extends all the way under\nthe thin oxide, as shown in the figure.\nYou may assume that throughout the silicon the electron mobility, μe, is 1600\ncm2/V-s and the hole mobility, μh, is 600 cm2/V-s (except in an inversion layer in\nwhich case μe = 600 cm2/V-s and μh = 400 cm2/V-s); that the intrinsic carrier\nconcentration, ni, is 1010 cm-3 at room temperature; and that the dielectric constant, εSi,\nis 10-12 F/cm. The dielectric constant of the oxide, εox, is 3 x 10-13 F/cm, and the\nelectrostatic potential of the gate metal relative to intrinsic Si is 0.3 V. (Note: There is\nmore information here than you need.)\na)\ni)\nWhat is the electrostatic potential of the p-type silicon, relative to intrinisic\nsilicon, in thermal equilibrium at room temperature?\nii)\nWhat is the built-in potential of the unbiased n+-p junction at room\ntemperature?\nb)\nWhat are the flat band voltages, VFB, of the MOS capacitor structures in Devices A\nand B, respectively?\nc )\nThe magnitude of the threshold voltage, |VT|, for the MOS structure is 1 V in one\nof these devices, and 4 V in the other. Use this information and your knowledge of\nMOS capacitors to deduce the magnitude and sign of VT for each of these MOS\ncapacitors, i.e., the one made on p-Si and the made on n+-Si.\nd)\nWhat is the condition (accumulated, depleted, or inverted) of the semiconductor\nsurface under the thin oxide in each of these devices with a gate voltage, VGB, of 2\nVolts? Also give the identity and sheet density of any mobile holes or electrons\ninduced at the oxide-silicon interface.\nProblem 4 - This problem concerns the novel semiconductor-oxide-semiconductor (SOS)\nstructure illustrated at the top of the next page. The two semiconductor regions are\nboth p-type silicon with a net acceptor concentration of 1016 cm-3; the oxide is a 50 nm\n(5 x 10-6 cm) thick layer of silicon dioxide. The dielectric constant of silicon, εSi, is 10-12\nF/cm and of silicon dioxide, εox, is 3.5 x 10-13 F/cm.\nUse the depletion approximation model when solving this problem. Assume that the\ndepletion region widths are less than w/2. The drawing may not be to scale.\np-Si\n1016 cm -3\nB\nA\n-w\nSiO2\np-Si\n1016 cm -3\nw\n-tox/2 0 tox/2\nx\na) Sketch and label the electrostatic potential, φ(x), in this structure between -w/2 and\n+w/2 when vAB = 0 and the structure is in thermal equilibrium.\n\nb) A bias is applied to this device sufficient to make the electrostatic potential at x =\ntox/2 equal to -φp, where φp is the thermal equilibrium electrostatic potential in the\np-type regions, i.e., φ(tox/2) = -φp. We call this the onset of inversion on the right\nside, and name this bias the right-side threshold, VTR.\n(i) What is the sign of VTR? Explain your answer.\n(ii) What is the width of the depletion region to the right of x = tox/2 with this\napplied bias?\n(iii) What is the condition of the left-hand semiconductor-oxide interface, the one at\nx = -tox/2 with this applied bias?\n(iv) What is the value of VTR?\nc) Sketch and label the net charge density, ρ(x), for -w/2 < x < w/2 when the bias\nvoltage, VAB, is VTR + 2 Volts; recall VTR was defined in Part (b). Be sure to label the\nvertical axis and to indicate the magnitude of any impulses (i.e., sheet charge\ndensities).\nd) Define the left-hand threshold, VTL, of the structure as the bias voltage, VAB, at\nwhich the potential at x = - tox/2 is -φp. What is VTL? (You can give your answer in\nterms of VTR, if you wish. Making use of the mirror symmetry of the structure\nshould simplify your calculation.)\ne) Consider now a different SOS structure in which the left-hand semiconductor region\nis doped n-type, rather than p-type, with a net donor concentration of 1016 cm-3.\n(i) Sketch the electrostatic potential, φ(x) for -w/2 < x < w/2 in thermal\nequilibrium, i.e., vAB = 0. Label the vertical axes but you do not calculate the\nwidths of any depletion regions.\n(ii) Sketch and label the electrostatic potential when vAB is VTR for this new\nstructure, where VTR has the same definition as before [see Part (b) above],\nbut will not necessarily have the same value.\n(iii) What is the value of VTL for this new structure in terms of VTR for this new\nstructure, where VTR and VTL have the same definitions as earlier? (Making\nuse of the inversion symmetry of the problem will simplify your solution.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/a35a84203ab6ab12edb2d9cee983a765_MIT6_012F09_assn06.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 6\nIssued: October 14, 2009\nDue: October 21, 2009\nReading Assignments:\nLecture 10 (10/15/09) - Chap. 9 (9.3, 9.4)\nLecture 11 (10/20/09) - Chap. 10 (10.1.1a)\nLecture 12 (10/22/09) - Notes\nProblem 1 - Do Problem 10.2 in the course text using a substrate doping level, NA, of 1 x\n1016 cm -3 in Parts (a) thru (c) rather than 1 x 1017 cm -3, and assuming that the value of the\nparameter α in the model developed in Lecture 11 is one (1). Also add the following\nparts to this problem:\nd) Consider building the same device with tox = 100 A . What must the doping level of\nthe substrate, NA, be to have the same threshold voltage you found in Part (a)? For\nsimplicity assume the flat-band voltage, VFB, is still -0.2 V, but after calculating the\nnew NA, find the actual flat-band voltage with this new doping level.\ne) Repeat Part (b) and compare the answer for this new device with that of the original.\nProblem 2 -\nThis is a former exam problem (with all the work space and blanks removed),\nso it won't take you long to do.\nAn ideal n-channel MOSFET has the iD vs vDS characteristic shown below when\nvGS = 4 V and vBS = 0 V. Note that the drain current saturates at 2 mA for vDS ≥ VDS,sat.\nvDS,sat\niD\niD,sat = 2 mA\nvDS,\nvGS, = 4 V, vBS, = 0 V\nThe threshold voltage, VT(vBS) of this device is 1 V when vBS = 0 V, i.e. VT(0) = 1 V. It\nhas the structural parameters listed below. Work this problem approximating α as 1.\nNA = 1017 cm -3, W = 25 μm, L = 10 μm, tox = 10-6 cm, and εox = 3.5 x 10-13 F/cm\n\na) What is the drain-to-source saturation voltage, vDS,sat, when vGS = 4 V?\nb) Use the information provided to calculate the electron mobility, μe, in the channel.\nc) Find the inversion layer sheet charge density in the channel, qN*(y), at the source\nend, i.e. qN*(0), and at the drain end, qN*(L), for the bias condition VGS = 4 V, VDS = 1\nV, and VBS = 0 V.\nd) Find the average net velocity, sy(y), of the electrons in the channel at the source end,\ni.e. sy(0), and at the drain end, sy(L), for the bias condition in Part (c) above, for\nwhich the corresponding drain current, ID, is 0.55 mA.\ne) The drain-to-source voltage, vDS, is increased to 5 V, so that the bias condition is now\nVGS = 4 V, VDS = 5 V, and VBS = 0 V. Find the inversion layer sheet charge density in\nthe channel, qN*(y), at the source end, i.e. qN*(0), and at the drain end, qN*(L) under\nthis new bias condition.\nf) Next consider this MOSFET with a negative substrate-to-source bias, VBS. What is\nthe drain current of this device when it is biased in saturation, i.e., with VDS ≥ (VGS\nVT), with VGS = 4 V and VBS = - 5 V? Suggestion: Calculate VT when VBS = -5V using\nthe expression below, and calculate iD in saturation with this new VT.\nThreshold voltage expressions:\nThe definition of the threshold voltage of a MOSFET is:\nVT (vBS) \" VFB # 2$p#Si + 1\nCox\n*\n2%SiqNA 2$p#Si # vBS\n[\n]\nIt is very common to write this in terms of VT(0), the threshold when vBS = 0, and\nto introduce the parameter γ as shown below:\nVT (vBS) = VT (0) + \"\n2#p$Si $ vBS $\n2#p$Si\n{\n}\nwith \" %\n2&SiqNA\nCox\n*\nand VT (0) % VFB $ 2#p$Si + \"\n2#p$Si\nProblem 3 -\nThis problem deals with the α factor in the gradual channel model for the\nMOSFET (see for example the Lecture 11 Foils).\na) Calculate the α factor for the two device structures in Problem 1 above. Use your\nresults to recalculate the drain current, iD, in Parts (c) and (e) of that problem.\nb) Calculate the MOSFET α factor for a device in which NAp is 5 x 1017 cm-3, and the\noxide thickness is 3 nm (3 x 10-7 cm). Take εox to be 3.5 x 10-13 F/cm and εSi to be 10\n12 F/cm. Do this for back-to-source biases, vBS, of 0, -1, and -2 V.\nProblem 4 - Diode-like connections of MOSFETs are quite useful and important to\nunderstand. Look at Figures 11.12 (a), (b), and (c) on page 351 in the course text.\nCalculate and plot iD for vAB between 0 and 6 Volts using the device parameters given\nin the figure caption. (These are curves a, b, and c in part e of this figure.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/5e550830b1ea00589a3e88fb4fb021d6_MIT6_012F09_assn07.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 7\nIssued: October 21, 2009\nDue: October 28, 2009\nReading Assignments:\nLecture 12 (10/22/09) - Notes\nLecture 13 (10/27/09) - Chap. 7 (7.4.2); Chap. 8 (8.2.2a, 8.2.3); Chap. 10 (10.1.2a and c)\nLecture 14 (10/29/09) - Chap. 15 (15.1)\nProblem 1 -\nConsider an n-channel silicon MOSFET and a p-channel silicon MOSFET\nwhich are identical in all dimensions and doping level magnitudes except that the gate\nlength, L, of one of the devices is twice that of the other. The K-factors in the large\nsignal characteristics are also identical. [The K-factor is defined as (W/L)μ(εox/tox).]\n(i) Which transistor, if either, would you expect to be the one with the longer gate\nlength, and why?\n(ii) What is the ratio of the electron to hole mobility in these transistors (i.e., what is\nthe ratio of the mobility of the electrons in the channel of the n-channel\nMOSFET to that of the holes in the channel of the p-channel MOSFET)?\nExplain.\n(iii) Which transistor, if either, has the larger small-signal gate-to-source capacitance\nin saturation, Cgs? Explain your answer.\n(iv) Which transistor, if either, has the larger small-signal gate-to-drain capacitance in\nsaturation, Cgd? Explain your answer.\n(v) Both transistors are biased in saturation so they have the same magnitude of\nquiescent drain current, ID. Which transistor, if either, has the largest small-\nsignal transconductance, gm? Explain your answer and estimate the ratio of the\ntwo gm's.\n(vi) Which transistor, if either, has a larger Early voltage, VA? Explain your answer.\nProblem 2 - This problems examines and compares (or contrasts) the sub-threshold and\nstrong inversion operation of an n-channel MOSFET like the one we used as the\nexample in Lecture 12. As you will recall, that device had tox = 3 nm and NA = 1018 cm -3.\nThis resulted in having n = α = 1.25. Assume that it also the electrostatic potential of the\ngate metal (degenerately n-doped poly-crystalline silicon) is 0.55 Volts, the channel\nlength is 100 nm, and the electron mobility in the channel is 800 cm2/V-s.\n(a)\nWhat are the flat-band and threshold voltages of this device when vBS = 0?\n(b) (i)\nWhat is the factor γ (which was defined just before Problem 3 on Problem Set\n6) for this device? This factor is called the \"body factor\" and is a gauge of how much\nthe threshold voltage changes with substrate (body) bias, vBS.\n(ii) What is the threshold voltage if vBS = -1Volt?\n\n(c)\nHow wide must the gate be to have K = 1 mA/V2? (Remember to include α.)\n(d) What is the drain current in saturation when this device is biased 1 Volt above\nthreshold?\n(e)\n(i)\nWhat is the drain current in saturation when this device is biased 0.12 Volts\nbelow threshold?\n(ii) What is the drain current in saturation when vGS = vBS = 0?\n(iii) How much power is dissipated in an integrated circuit containing 106\ntransistors like this, each in series with a load connecting a 1.5 V power supply buss\nto ground [as, for example, in Figure 15.2(c) in the course text] when all of the\ntransistors are off with vGS = 0?\nProblem 3 -\nSeveral three-terminal devices (e.g., vacuum tube triodes, static induction\ntransistors, field-emitter display pixels) have characteristics like those illustrated below:\nP\nG\nK\nv PK (Volts)\ni P (mA)\nv GK = -15 V\n-10 V\n-5 V\n0 V\niG = IG(eqVGK/kT -1)\nand\niP = G(M vPK + vGK)3/2\nwith G = 2 mA/V3/2, M = 0.06, and IG = 10-6 A\n(a)\nAn incremental model for a device with these characteristics is illustrated below.\ngfv gk\ngrv pk\ngi\ngo\nv gk\n+\n-\nv pk\n+\n-\nFind mathematical expressions for each of the parameters in the incremental\nmodel (gi, gr, gf, and go) and evaluate these expressions at the bias point VGK =\n- 4 V, and VPK = 160 V.\n\n(b) This device is biased using the resistor bias circuit illustrated below:\nG\nP\nK\nR P\nR G1\n+ 200 V\n- 20 V\n1 k !\n10 k !\nSelect RG1 and RP to achieve the bias point specified in Part (a), i.e., VGK = - 4 V,\nand VPK = 160 V.\nProblem 4 (\"iLab\" problem) - This problem requires that you use a remote-control device\nmeasurement and characterization system called \"iLab\". Go to http://ilab.mit.edu, sign\nup for a user account if you don't have one already (this can take a day or two, so sign\nup well before this problem set is due), and read the user manual provided there. After\nreading the manual, go to \"Launch Lab\" and make your measurements using the Java\napplet that appears.\nYou select the device that will be under test from the \"Device\" menu. For this\nproblem use one of the two devices named \"3u nMOSFET\" (#4 and #6).\nLook at the output characteristics of this device as directed below. Prepare and\nsubmit the plots requested, and give the requested parameter values.\nCaution: Do not let vGS exceed 3 V or vDS exceed 4 V.\na) On linear scales, plot iD vs vDS for 0 ≤ vDS < 4 V, with vGS as a parameter (0 ≤ vGS ≤ 3 V)\nand with vBS = 0. Estimate the threshold voltage, VT, and the Early voltage, VA, for\nthis device.\nb) Repeat Part (b) with vBS = - 0.5 V.\nc) Plot iD vs vGS, with vDS = 4 V and vBS = 0 V on a linear scale. Also plot (iD)1/2 vs vGS,\nand use this plot to find the threshold voltage, VT, and the K-factor of this device\nwith vBS = 0.\nd) Display the plot of iD vs vGS, with vDS = 4 V and vBS = 0 V in Part (c) on a log-linear\nscale and use it to estimate the sub-threshold slope and the value of \"n\". Also\ndetermine the factor IS,s-t in the expression for sub-threshold current (see, for\nexample, Slide 21 in Lecture 12).\n\ne) Use the techniques in Parts (c) and (d) to estimate the threshold voltage, sub\nthreshold slope, the factor IS,s-t, and \"n\" when vBS = - 0.5 V.\nComment on whether the changes you find from the vBS = 0 case have the right sign,\nand whether they seem reasonable.\nf) Return to your plot of iD vs vDS for 0 ≤ vDS < 4 V, with vGS as a parameter (0 ≤ vGS ≤ 3\nV) and with vBS = 0 in Part (a), but only plot it for (0 ≤ vGS ≤ VT), and make it a log-\nlinear plot, i.e., log iD vs vDS. You might even try to make the steps in vGS be nkT/q,\nand compare your plot to that on Slide 26 of Lecture 12.\ng) Optional extra fun (I am curious to see what you find): Your estimates of K, n, and\nISs-t in Part (d) should all be consistent, and in fact should be related (see Slide 21 of\nLecture 12). You should find: IS,s-t = Ko (kT/q)2 (n-1). What do you actually find?\nNote: The estimates you found in Part (e) should, of course, also be related. You\nmay want to check that too.\nAdditional final comments on iLab:\nThe \"auto scale\" function might be useful for displaying plots.\nFor research purposes, the system keeps a record of all logins and all scripts that\neach user executes.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Assignment",
      "title": "Problem Set No. 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/24b3d79eca22477531642d246cf5e2f8_MIT6_012F09_assn08.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nProblem Set No. 8\nIssued: October 28, 2009\nDue EARLIER than normal: 5 pm, Tues, Nov. 3, 2009\nReading Assignments:\nLecture 14 (10/28/09) - Chap. 15 (15.1)\nLecture 15\n(11/3/09) - Chap. 15 (15.2.4)\nLecture 16\n(11/5/09) - Notes\nExam 2: Thursday, Nov. 5, 7:30 - 9:30, covering thru Lecture 15 and PS #8,\nincluding BJT operation and large signal modeling; the MOS capacitor; MOSFET\noperation (in strong inversion and sub-threshold) and large signal modeling; MOSFET\ninverters and CMOS; and incremental models for diodes, BJTs, and MOSFETs.\nNote on this Problem Set: Most of the problems on this set originated in modified\nform as questions on prior exams, and have relatively short, quick answers. It may\nseem long at first, but it is not that bad, and as you work through it you will hopefully\nfind yourself reviewing material that will be on the exam, i.e., studying for the exam.\nProblem 1 - This problem has two parts. Think of it as a warm-up for Hour Exam 2.\n(a)\nConsider two npn silicon bipolar junction transistors, A and B.\nAll of the\ndimensions of these two devices, and the magnitudes of all of the doping levels in\nthese two devices are identical, except that the base width, wB, of Transistor A is\ntwice that of Transistor B.\n(i) Which transistor, if either, has the larger dc current gain, βF? Explain your\nanswer and estimate the ratio of the two βF's.\n(ii) Which transistor, if either, has the larger emitter-base junction saturation current,\nIES? Explain your answer and estimate the ratio of the two IES's.\n(iii) With the base-collector junctions of both transistors reverse biased with the same\nvalues of base-collector junction voltage, VBC, which transistor, if either, has the\nlargest small-signal base-collector junction capacitance, Cμ?\nExplain your\nanswer and estimate the ratio of the two Cμ's.\n(iv) With both transistors biased at the same quiescent collector current level, IC,\nwhich transistor, if either, has the largest small-signal transconductance, gm?\nExplain your answer and estimate the ratio of the two gm's.\n(v) With both transistors biased at the same quiescent collector current level, IC,\nwhich transistor, if either, has the largest small-signal input resistance, rπ?\nExplain your answer and estimate the ratio of the two rπ 's.\n(vi) Which transistor, if either, has a larger Early voltage, VA? Explain your answer.\n\ndraw the full LEC for this circuit. Evaluate all of the parameter values in your LEC.\nG\nS\nB\nD\nA\nC\n3V\n+\n!\n(b) This part involves MOSFETs.\n(i) Consider two MOSFETs, one an n-channel MOSFET and the other a p-channel\nMOSFET. They have identical dimensions, and both are biased in the saturation\nregion at the same drain current, |ID|. Which of the devices, if either, would\nhave the larger transconductance, gm, and why?\n(ii) Consider two MOSFETs, one an n-channel MOSFET and the other a p-channel\nMOSFET. They have identical dimensions, and both are biased in the sub\nthreshold region at the same drain current, |ID|. Which of the devices, if either,\nwould have the larger transconductance, gm, and why?\n(iii) An n-channel MOSFET operating in a circuit was mistakenly biased in the linear\nregion. Derive expressions in terms of VGS, VDS, and K for its transconductance,\ngm, and output conductance, go, in this situation. Assume vBS = 0 and α = 1, and\nignore the Early effect, i.e., assume λ = 0.\nProblem 2 - Consider the n-channel MOSFET circuit pictured to the right. The circuit is\nbiased with VAC = VDS = 2 Volts. The MOSFET has following\nparameters:\nK = 2 mA/V2\nVT = 1 V\nα = 1\nλ = 0.01 V-1\nη = 0.2\nA small signal voltage, vac(t), is added to the 2 V bias so now\nvAC(t) = 2 V + vac(t).\n(a)\nWhat are the bias and small signal values of vGS, vDS, and\nvBS?\n(b) Use the linear equivalent circuit (LEC) for a MOSFET to\n(c)\nReduce your LEC in Part ii) to a single element and give an expression for this\nelement in terms of gm and go.\nProblem 3 - On Slide 8 in Lecture 14 the voltage gain of an NMOS inverter stage is\ncalculated for the bias point VIN = VOUT, which is in the steep portion of the transfer\ncharacteristic. The substrate and source of the depletion mode pull-up MOSFET were\nshorted together, but this is not possible in many fabrication processes. Instead, the\nsubstrate of the pull-up MOSFET must be tied to ground. Redo the voltage gain\ncalculation in this case by doing the following steps:\n(a)\nWhat is the small signal base-to-source voltage, vbs,pu, on the pull-up MOSFET?\n(b) Draw the small signal linear equivalent circuit of the pull-up MOSFET. Notice that\nincrementally the drain is also connected to ground so that the substrate and drain\nare connected incrementally. Thus the pull-up MOSFET looks like a two terminal\ndevice in this connection and its LEC is simply a resistor (i.e., rpu or gpu). Give an\nexpression for gpu in terms of go,pu and gm,pu. (Remember gmb and gm are related.)\n(c)\nDraw the LEC for the entire inverter; be sure to indicate vin and vout.\n\n(d) Derive an expression for the voltage gain, Av = vout/vin, (i) in terms of gm, gmb, and\ngo of the two transistors, and (ii) in terms of the bias point current and K, λ, and η of\nthe two transistors.\n(e)\nIs the gain larger or smaller than when the pull-up substrate was tied to its source,\nor is it no different? Explain your answer.\nProblem 4 - The gates on a CMOS logic chip were laid out by a designer who had not\ntaken 6.012 and they have Wp = Wmin and Wn = 2 Wmin, instead of Wn = Wmin and Wp = 2\nWmin. What was the impact of this error on the following inverter performance metrics\nrelative to the usual case of an inverter with Wn = Wmin and Wp = 2 Wmin? State whether\neach` has increased, decreased, or not changed appreciably, and explain your answers.\n(a)\nInverter input capacitance, CL.\n(b) The output node charging current after the input has switched from HI to LO.\n(c)\nThe output node discharge current after the input has switched from LO to HI.\n(d) Static power dissipation.\n(e)\nThe logic HI voltage.\n(f)) The noise margins.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Answers to Exam 1 - Fall 2009",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/12df3e5dc374f56d353f8d4f1f121b8d_MIT6_012F09_exam1_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nAnswers to Exam 1 - Fall 2009\nProblem 1: Graded by Prof. Fonstad\na) i)\nThe resistivity is given, and is the inverse of the conductivity: σ = 1/ρ = qμeno.\nThus, no = 1/ρqμe = 1/(102x1.6x10-19x1.6x103) = 3.9x1013 cm -3 ≈ 4 x 1013 cm -3.\nii)\npo = ni\n2/no = 1020/(3.9x1013) = 2.56 x 106 cm -3.\nb) i)\nih = A jh = - A q Dh dp'/dx . Dh = μh(kT/q) = 640 x 0.025 = 640/40 = 16 cm2/s.\nThus, ih = -10-4x1.6x10-19x1.6x101x(-5x1014/2x10-4) = 6.4 x 10-4 A.\nii)\nThe total number is the area under the profile times the cross-sectional area:\nExcess holes = (5x1014x2x10-4/2)x10-4 = 5 x 106\niii)\nThe total recombination is the total excess divided by the minority carrier\nlifetime: 5x106/τh = 5x106/10-4 = 5 x 1010 holes/s\nThe hole recombination current, i.e. the current supplying the holes is the total\nhole recombination rate times q: 5 x 1010 x 1.6 x 10-19 = 8 x 10-9 A. This is much\nsmaller than the hole diffusion current found in 1-b-i, i.e. negligible.\nc) i)\nDiode B, because the saturation current varies inversely with the effective\nwidth of the diode. Both diodes have the same physical length, but since Lh <\nwN in Diode B, it has the smaller effective width, and thus the larger IS.\nii)\nDiode A, because the excess hole population in it falls off linearly to zero at x =\nwN, whereas in Diode B the excess population falls off more quickly, i.e.\nexponentially. As a result there is more area under the excess carrier profile in\nDiode A, and thus more excess carriers in the n-side quasi-neutral region.\niii)\nThey are similar, because the space charge layer width does not depend on τmin.\nd) i)\nThe thermal equilibrium minority carrier populations in the emitter, base, and\ncollector are: poE = 2 x 102 cm -3, noB = 103 cm -3, poC = 2 x 103 cm -3. When a 0.6 V\nbias is applied to the junctions, the excess minority carrier concentrations at the\nedges of the space charge layer increase by 0.6/0.06 = 10 orders of magnitude,\ni.e. a factor of 1010, to: p'(0-) = 2 x 1012 cm -3, n'(0+) = 1013 cm -3, n'(1-) = 1013 cm -3,\nand p'(1+) = 2 x 1013 cm -3. The plot of the corresponding carrier profiles is\nshown in the figure at the top of the next page\nNote 1: Some students did not use the 60 mV rule, but calculated exp(qVAB/kT)\nwith kT/q = 25 mV. In this case the increase is by a factor of e0.6/0.025 = e24 ≈ 2.65\nx 1010, instead of 1010; either answer was accepted.\nNote 2: 10 ≈ e2.3 so so using kT/q = 26 mV (i.e., the 60 mV rule) says the\nincrease is by a factor of e23, whereas using kT/q = 25 mV yields e24 . The\nminority carrier population, and the diode current as well, are clearly very\nsensitive functions of temperature. A good design doesn't rely on either being\nhaving a fixed, precisely known value.\n\n-1\nx [!m]\nn', p' [cm-3]\n2x1013\n2x1012\nii)\nβ ≈ 1/δE = (NDE/NAB)(Dh/De)(WB/WE) = (5x1017/1017)(40/15)(1/1) = 13.3\niii)\nThe choice is between emitter and base, and from the expression above we see\nthe correct choice to increase the doping of the emitter, which increases β. We\nwant to make β 100/13.3 = 7.5 times bigger, so we should increase NDE by a\nfactor of 7.5 to 3.75 x 1018 cm -3.\nProblem 2: Graded by Prof. Palacios\na)\nφ(-1.5 μm) = -(kT/q) ln(1017/1010) ≈ -7 x 0.06 = - 0.42 V\nφ(1.5 μm) = (kT/q) ln(1017/1010) ≈ 7 x 0.06 = 0.42 V\nΔφ = φ(1.5 μm) -φ(-1.5 μm) = 0.42 - (-0.42) = 0.84 V\nb)\nρ(x) = 160 x for -5x10-5 cm < x < 5x10-5 cm (i.e.- 0.5 μm < x < 0.5 μm), and ≈ 0\nelsewhere.\n!(x) [coul/cm3]\nx [!m]\n-2\n-1\n\n8 x 10-3\n-8 x 10-3\nc)\nE(x) = ∫ρ(x) dx/εSi= 8x1013 (x2 - 2.5x10-9) for - 5x10-5 cm < x < 5x10-5 cm, and ≈ 0\nelsewhere. The peak value is -2x105 V/cm at x = 0.\nE(x) [V/cm]\n-2 x 105\nd)\nWe can obtain the potential step between - 0.5 μm and 0.5 μm by integrating the\nelectric field over this range. Doing this yields: φ(x) = -8x1013[ (x3/3) - 2.5x10-9 x].\nUsing this: φ(-0.5μm) = -6.67 V, and φ(0.5μm) = 6.67 V, so ΔφDepl. Reg. = 13.34 V.\n\ne)\nBetween x = 0.5 μm and x = 1.0 μm, the doping changes by a factor of 2. Thus,\nusing the 60 mV rule, the electrostatic potential must change by 0.06 x log 2 Volts,\nor 0.06 x 0.3 = 0.018 V. Δφ = 0.018 V between x = - 1.0 μm and x = - 0.5 μm, also.\ng)\nIn thermal equilibrium, Δφ crossing the junction, φb, from Part a, is 0.84 V. Now\nthe total change, (φb-VAB), is 0.02 + 13.34 + 0.02 = 13.38 V. Subtracting, we find the\napplied voltage, VAB: VAB = -12.54 V\nProblem 3: Graded by Prof. Weinstein\na)\nB.C. @ x = 0: n'(0) = 0.\nB.C. @ x = L: n'(L) = 0.\nb)\nWe require Le >> L, and since Le = (Deτe)1/2, we must have τe >> L2/De\nc)\nCrossing the plane of injection at XA, n' must be continuous, and the sum of the\ncarrier fluxes away from XA must be M. So, the constraint on n' is n'(XA-) = n'(XA+),\nand the constraint on dn'/dx is De(dn'/dx|XA- - dn'/dx|XA+) = MA.\ne)\nFor 0 < x < XA: Je,diff(x) = qDen'(XA)/XA; for XA < x < L, Je,diff(x) = - qDen'(XA)/(L-XA).\nThe current step at x = XA must be qMA. Using this gives n'(XA) = M XA(L-XA)/DeL;\nthus: Je,diff(x) = qMA(L-XA)/L for 0 < x < XA, and Je,diff(x) = qMAXA/L for XA < x < L.\nf)\n!(x) [V]\n-2\n-1\nx [!m]\n-10\n-6.69\n-6.67\n6.67\n6.69\n13.38V\nd)\nFor 0 < x < XA: n'(x) = n'(XA) x/XA, and for XA < x < L, n'(x) = n'(XA) (L-x)/(L-XA).\nNote: The value of n'(XA) is most easily found after first solving Part e, see below.\nXA\nL\nx\nn'(x)\nn'(XA)\nn'(XA) =MXA(L-XA)/DeL\nn'(x) =n'(XA)·x/ XA\nn'(x) =\nn'(XA)·(L-x)/ (L-XA)\nXA\nL\nx\nJe,diff(x)\nqMA(L-XA)/L\n-qMAXA/L\nqMA\n\n__________________________\nf)\nMinority carriers flow primarily by diffusion because any minority carrier drift\ncurrent must be negligible compared to the majority carrier drift current because in\nlow level injection the majority carriers far outnumber the minority carriers.\ng) Superposition is valid, so the excess minority carrier populations and the minority\ncarrier drift currents due to each excitation, MAδ(XA) and MBδ(XB), individually can\nbe superimposed, i.e. added:\nn'(x, gL = MAδ(XA) + MBδ(XB)) = n'(x, gL = MAδ(XA)) + n'(x, gL = MBδ(XB))\nJe,diff(x, gL = MAδ(XA) + MBδ(XB)) = Je,diff(x, gL = MAδ(XA)) + Je,diff(x, gL = MBδ(XB))\nExam Statistics\nAverage/Standard deviation:\nProblem 1\nProblem 2\n26.4\n23.0\n4.9\n6.2\nProblem 3\n18.8\n6.4\nTotal\n68.3\n14.3\nClass median: 68.5\nDistribution to nearest 5:\nFind your face in this picture\nTotal Score\n-σ\nAve & Mean\n+σ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Answers to Exam 1 - Spring 2006",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/0eb078baa49e2ae523de83a4329cecd4_MIT6_012F09_exam1_s06_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nAnswers to Exam 1 - Spring 2006\nProblem 1: Graded by Prof. Hoyt\na) i)\nNa = B concentration = 2 x 1016 cm-3 .\nii)\nNA = Na - Nd = B concentration - As concentration = 2 x 1016 - 1 x 1016 = 1016 cm-3 .\niii)\npo ≈ NA = 1016 cm-3 .\niv)\nno = ni\n2/po = (1020 cm-6)/(1016 cm-6)= 104 cm-3 .\nv)\nσo = qnoμe + qpoμh ≈ qpoμh = (1.6 x 1019 coul)(1016 cm-3)(600 cm2/V-s)= 0.96 S/cm.\nvi)\nφp = -(kT/q) ln (po/ni) ≈ - 60 mV x 6 = - 360 mV = - 0.36 V.\nb) i)\nR = ρ L/w t = L/σ w t = (10-1 cm)/(0.96 S/cm)(10-3 cm)(10-4 cm) = 1.04 x 106 Ω.\nii)\nE = VAB/L = 2 V/(10-1 cm) = 20 V/cm.\niii)\nJdr = σ E = 0.96 S/cm x 20 V/cm = 19.2 A/cm2\nc) i)\nLmin = (Dminτmin)1/2 = [(40 cm/s)(10-7 s)]1/2 = 2 x 10-3 cm.\nii)\nFar from the ohmic contacts n' ≈ p' ≈ GLτmin = (1023 cm-2 s-1)(10-7 s) = 1016 cm-3 .\n(Note this is no longer strictly low level injection, but we did not take off points\nfor this because we had intended it to be LLI; it did initially but then someone\nwhose initials are CF changed the lifetime at the last minute.)\nσ ≈ qμhpo + qμen' + qμhp' = σo+ q(μe+ qμh)n'\n= 0.96 S/cm + (1.6 x 10-19 coul)(600 cm2/V-s + 1600 cm2/V-s)(1016 cm-3)\n= 0.96 + 3.52 = 4.48 S/cm\nProblem 2: Graded by Prof. Fonstad\na) i)\ndn'/dx|x = 0 = 0\nii)\nn'(L) = 0\nb)\nLmin\n2 = Dminτmin so τmin = Lmin\n2/Dmin. Dmin = De = μe/40 = 40 cm2/s, and Lmin = 100 μm\n= 10-2 cm. Thus τmin = (10-2)2/40 = 2.5 x 10-6 s = 2.5 μs.\n\nc) i)\nD, because the minority carrier diffusion flux must be zero at x = 0, and the flux\nbuilds up (increases) linearly because there is uniform optical creation of hole-\nelectron pairs and no appreciable recombination. Alternatively one could say\nthat the integral of the generation function (a constant in this case) yields the\ngradient in the excess population, and the flux proportional to this. The\nintegral of a constant is a line of constant slope.\nii)\nA, because it is consistent with the answer in (i), because it is the only profile\nthat fits the boundary conditions, and/or it is what one gets by integrating a\nconstant twice.\nd)\nWith no recombination the total flux density into the ohmic contact must be the the\ntotal generation within the sample, which is the integral of gL(x) from x = 0 to x\n= L. In this case gL(x) is a constant, call it GL, so the integral is GLL. The current\ndensity is the charge per carrier, -q, times the flux: Jmin(x) = -q GLL = -1.6 x 10-19\nx 1019 x 10-3 = -1.6 x 10-3 A/cm2 = -1.6 mA/cm2.\ne) i)\nThe recombination at any point is n'(x)/τmin, so the total recombination per unit\narea is ∫0→L[ n'(x)/τmin]dx. If one finds n'(x) and does this integral you get\nGLL3/3τminDmin = GLL3/3Lmin\n2. The numerical answer is 3.2 x 1013 cm-2s-1 .\nii)\nMuch greater than, because even though there is non-zero recombination in the\nbulk, it is still much less than occurs at the ends. If one compares the answers\nin Parts (d) and (e-i), one sees that the fraction recombining in the bulk is\nL2/3Lmin\n2. In this case this is 1/300, so 300 times as much recombination occurs\nat the contact as within the bulk.\nThe important concept upon which Part (e) of this problem is based is that one can\nfind the excess carrier and flux profiles in a short base situation (i.e., long\ndiffusion length) assuming that the lifetime in infinite, and then turn around\nand find out how much recombination occurs (and this how good the initial\nassumption was) by using the true minority carrier lifetime and the profile\ncalculated assuming infinite lifetime to estimate the amount of recombination.\nComparing this to the total minority carrier generation and/or injection, or to\nthe recombination fluxes at the contacts.\nProblem 3: Graded by Prof. Antoniadis\na) i)\n0.84 V using the 60 mV rule; 0.81 V if use kT = 0.025 V and evaluate the\nexponential.\nii)\n1 μm\niii)\nJe/Jh = (De/Dh)(ND/NA1)[wn/(wp-xp)] = 3 x (1/3) x\nb) i)\nSame as (a-i).\n\nii)\nxp ≈ [2εSi(φb-V1)/qNA1)]1/2 so V1 = -(qNA1xp\n2/2εSi) + φb = -2.4 V\niii)\nThe small signal linear equivalent capacitance is the same as a parallel plate\ncapacitor with the same width as the depletion region and the dielectric\nconstant of silicon:\nCab(V1) = eSi/w(V1) ≈ εSi/xp(V1) = 10-12/2 x 10-4 = 5 x 10-9 F/cm2.\niv)\nFigure b because xp will increase only marginally for vAB > V1 due to NA2 >>\nNA1. Consequently, the depletion region width, w, which is essentially the\nsame as xp, will not increase either. The capacitance per unit area, Cab, is εSi/w,\nso it will not decrease appreciably for vAB > V1.\nAverage/Standard deviation:\nProblem 1\n29.4\n4.5\nProblem 2\n24.4\n5.3\nProblem 3\n23.9\n5.3\nTotal\n77.8\n11.9\nDistribution to nearest 5:\nFind your face in this picture\nTotal Score\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Answers to Exam 1 - Spring 2008",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/3ddd26017ee70a492eb3a46f6fad856f_MIT6_012F09_exam1_s08_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nAnswers to Exam 1 - Spring 2008\nProblem 1: Graded by Prof. Palacios\na) i)\nIn the steady state the low level injection, zero current continuity equation\nreduces to n'/τmin = gL. Thus τmin = n'/gL. = 1014/1020 = 10-6 s = 1 μs.\nii)\np = po + p' and n = no + n'; and po = 1017 cm -3 and no = ni\n2/po = 103 cm -3. With n'\n= p' = 1014 cm -3, we have p ≈ po = 1017 cm -3 and n ≈ n' = 1014 cm -3.\niii)\nAfter the excitation is extinguished the excess minority carrier population\n(actually both excesses, of course) decays as n'(t) = n'(0)exp(-t/τmin), which is\nthe homogeneous solution of the low level continuity equation. In the present\ncase this means n'(t) = 1014exp(-t/τmin) cm-3.\niv)\nFaster, because the contact introduces an interface at which any excess minority\ncarrier encountering it recombines immediately, so the overall recombination\nin the solid increases and thus the rate of decay must also increase. Because the\nsample is small, and the bulk lifetime is relatively large, it can be assumed that\nthe increase will not be negligibly small.\nb) i)\nVFB = φp - φm = - 0.36 - 0.30 = - 0.66 V\n-tox\nx\n!(x) [Coul/cm3]\nW\n-tox\nx\n\"(x) [Volts]\nW\n\"p\n\"m\nVFB\nii)\nVFB = φp - φm - Qox/Cox *= - 0.66 - 2x10-8 (3x10-6/3.5x10-13) = - 0.66 - 0.17 = - 0.83 V\n-tox\nx\n!(x) [Volts]\nW\n!p\n-tox\nx\n\"(x) [Coul/cm3]\nW\nQox #(x)\nVFB\nQox #(x+tox)\n!m\nQoxCox\n\nc)\nThe built-in potential is determined by the doping levels on either side of the\njunction so we first determine NDn from φb and NAp. From NAp we find that φp =\n0.42 V, which in turn tells us that φn must equal 0.36 V to make φb 0.78 V. This\nimmediately tells us NDn = 1016 cm -3.\nNext, wn must be adjusted to get the desired current. One way to do this is to first\ncalculate the electron current density at the specified bias (0.4 V ≈ 7 x 60 mV): Je =\n(qni\n2De/NApwp)107 = (1.6x10-19 1020 4x101 107)/(1017 10-4) = 0.64 mA/cm2. Thus Jh =\n0.36 mA/cm2, which in turn says wn = (qni\n2Dh/NDnJh)107 = (1.6x10-19 1020 1.5x101\n107)/(1016 3.6x10-4) = 0.67x10-3 cm = 6.7 μm. (Note: Depending on the approxi\nmations made, slightly different values can be obtained; all were accepted.)\nProblem 2: Graded by Prof. Fonstad\na) i)\nJElectron-B = q De dn'/dx = 1.6x10-19 4x101 [(0 - 1013)/(5x10-4 - 3x10-4)]\n= - 3.2 x 10-1 A/cm2\nii)\nJHole-B = - q Dh dp'/dx = 1.6x10-19 1.5x101 [(1014 - 5x1014)/(3x10-4 - 2x10-4)]\n= 9.6 A/cm2\niii)\nI3 = - A (JElectron-B + JHole-B) = - 10-4 [9.6 - (- 0.32)] = 9.28x10-4 A ≈ 0.93 mA\niv)\nThe excess minority population at the edge of a depletion region at a junction\nvaries as ni\n2/NNet, so if the excess population is 10 times lower in Region 3 than\nin Region 2, the doping level there must be 10 times larger than it is in Region\n2. Thus, n'(3+) = 0.1 p'(3-) implies NA3 = 10 ND2 = 1018 cm -3\nb) i)\nThe excess minority population at the edge of a depletion region at a junction\nvaries as ni\n2/NNet, so if the doping is 10 times lower in Region 1 than in Region\n2, the excess population there (at x = 2-) will be 10 times larger than it is at x =\n2+. Thus, ND2 = 10 NA1 implies n'(2-) = 10 p'(2+) = 5 x 1015 cm -3.\n[Note: This turns out to be high level injection, which is an oversight on our\npart because we did not intend to have you worry about high level injection.\nFortunately no one even noticed, much less got hung up on it!]\nii)\nThe thermal equilibrium hole concentration in Region 2 is 1020/1017 = 103 cm -3.\nThe population at x = 2+ has therefore increased to 5 x 1014 cm -3, a factor of 5 x\n1011, which is eqV12/kT. With this, and using the 60 mV rule, we estimate that V12\nis 60 log10 (5x1011) = 60 (11 + log10 5) ≈ 60 x 11.7 ≈ 0.7 V.\n[Sorry about the log10 5 in this problem, but any good engineer should know\nlog10 5 , or log10 2, anyway. The first is 0.7, and the second is 0.3. Notice that\nthey add to 1 because 5 x 2 = 10, so you really only need to know one of them.]\nc) i)\nTerminal 3 because Region 3 is the most heavily doped, and would function\nwell as the emitter in a pnp BJT because NA3 > ND2.\nii)\nThe profiles indicate there is little recombination in the base ( ≈ 0) so we can use\nβF = (1 - δB)/(δE + δB) ≈ 1/δE.\nδE = DhNA2w2/DeNA3w3 ≈ 0.133. If we use βF ≈\n1/δE, we find βF ≈ 7.5.\n\nProblem 3: Graded by Prof. Antoniadis\na)\nφn+ = 0.55 V and φp = -0.42 V, so Δφ13 = 0.97 V.\nb)\nc)\nd)\n!(x) [Coul/cm3]\n-L\nx\nqNA3xD \"(x +L)\n-qNA3\nxD\nE(x) [V/cm]\n-L\nx\nxD\nqNA3xD/!Si\nqNA3(xD-x)/!Si\n!(x) [Volts]\n-L\nx\n!n+ = 0.55 V\nxD\n!p = -0.42 V\n\"!2 = qNA3xD L/#Si\n\"!3 = qNA3xD2/2#Si\nLinear\nParabolic\ne)\nWe use the condition that the two voltage drops must add up to the built-in\npotential. The equation is: Δφ13 = qNA3xDL/εSi + qNA3xD\n2/2εSi\nf)\nSince the dielectric constant is the same in all parts of this structure, the\ncapacitance is simply that of a capacitor (L+xD) wide: Cdp * = εSi/(L+xD).\n\nExam Statistics\nAverage/Standard deviation:\nProblem 1\nProblem 2\n26.6\n23.6\n6.2\n7.9\nProblem 3\n19.7\n8.6\nTotal\n69.9\n19.0\nClass median: 74\nDistribution to nearest 5:\nFind your face in this picture\nTotal Score\n-σ\nAve Mean\n+σ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Exam No. 1 - Fall 2009",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/1fb9235dfc00691ba90a59aea5196000_MIT6_012F09_exam1.pdf",
      "content": "Page 1 of 10\nYOUR NAME\nDepartment of Electrical Engineering and Computer Science\nMassachusetts Institute of Technology\n6.012 Electronic Devices and Circuits\nExam No. 1\nWednesday, October 7, 2009\n7:30 to 9:30 pm\nNotes:\n1. An effort has been made to make the various parts of these problems independent of\neach other so if you have difficulty with one item go on, and come back later.\n2. Some questions ask for an explanation of your answer. No credit will be given for\nanswers lacking this explanation.\n3. Unless otherwise indicated, you should assume room temperature and that kT/q is\n0.025 V. You should also approximate [(kT/q) ln 10] as 0.06 V.\n4. Closed book; one sheet (2 pages) of notes permitted. Formula sheet provided.\n5. All of your answers and any relevant work must appear on these pages. Any\nadditional paper you hand in will not be graded.\n6. Make reasonable approximations and assumptions.\nState and justify any such\nassumptions and approximations you do make.\n7. Be careful to include the correct units with your answers when appropriate.\n8. Be certain that you have all ten (10) pages of this exam booklet and the three (3) page\nformula sheet, and make certain that you write your name at the top of this page in\nthe space provided.\n6.012 Staff Use Only\nPROBLEM 1\n(out of a possible 34)\nPROBLEM 2\n(out of a possible 32)\nPROBLEM 3\n(out of a possible 34)\nTOTAL\n\nExcess holes =\nProblem 1 continues on the next page\nPage 2 of 10\nProblem 1 - (34 points)\nThis problem contains 4 independent short problems that can be worked in any order.\na) [6 pts] You find a sample of silicon, but the accompanying data sheet has been\npartially destroyed so you only know that it is n-type, its resistivity is 100 Ohm-cm,\nand its electron mobility is 1600 cm2/V-s. You also remember that ni(Si) = 1010 cm -3.\ni) What is the approximate equilibrium electron concentration, no, in this sample?\nno =\ncm -3\nii) What is the approximate equilibrium hole concentration, po, in this sample?\npo =\ncm -3\nb) [10 pts] The excess hole pop\nulation illustrated on the right\nis established in an n-type\nsilicon sample, ND = 1017 cm -3.\nThe minority carrier lifetime in\nthis sample is 10-4 s, the hole\nmobility is 640 cm2/V-s, and\nthe cross-section of the sample\nis 10-4 cm2.\ni) What is the hole current,\nih = A Jh, in this sample?\nNote: 1 μm = 10-4 cm\np'(x) [cm-3]\nx [!m]\n5 x 10\nih =\nAmps\nii) What is the total number of excess holes in this sample?\n\nPage 3 of 10\nProblem 1 continued\niii) What is the total rate at which excess holes are recombining with excess electrons\nin this sample, and what is the corresponding hole current, ih,recomb?\nTotal recombination occurring in sample =\nholes/s\nHole recombination current, ih,recomb =\nAmps\nc) [9 pts] Consider two p+-n diodes which are identical except for the fact that in Diode A\nthe minority carrier lifetime is infinite making Lh >> wN, while in Diode B the\nminority carrier lifetime is finite and small enough that Lh < wN. Note: wN is the\nwidth of the n-type side, and Lh is the minority carrier diffusion length.\ni) Which of these two diodes has the larger saturation current, IS?\nExplain your\nanswer.\nDiode A\nDiode B\nThey are similar\nExplanation:\nii) Which of these two diodes has the larger total number of excess holes in the n-\nside quasi-neutral region when a forward biased VAB is applied?\nDiode A\nDiode B\nThey are similar\nExplanation:\niii) Which of these two diodes has the wider space charge layer (depletion region) in\nthermal equilibrium?\nDiode A\nDiode B\nThey are similar\nExplanation:\nProblem 1 continues on the next page\n\nRegion:\nN =\nPage 4 of 10\nProblem 1 continued\nd) [9 pts] This question concerns the npn bipolar transistor shown below. There is\nnegligible minority carrier recombination throughout except at the ohmic contacts.\nOhmic\nContact\nOhmic\nContact\nEmitter\nn-Si, NDE =\n5 x1017 cm-3\nE\nC\nB\nBase\np-Si, NAB =\n1 x1017 cm-3\nCollector\nn-Si\nNDC = 5 x1016 cm-3\ni) On the axes provided, sketch and label the excess minority carrier profiles when\nboth junctions are forward biased with vBE = vBC = 0.6 V. Notice that this is not a\nbias in the forward active region.\n-1\nx [!m]\nn', p' [cm-3]\nii) Calculate the forward current gain, βf (≈ 1/δE), for this device when it is biased in\nthe forward active region, i.e. vBE > 0 and vCE ≤ 0. De = 40 cm2/s, Dh = 15 cm2/s.\nβf =\niii) Redesign this transistor to increase the forward current gain, βf, to 100 by\nincreasing the doping level of one of the three regions in this device. Indicate\nwhich region should be changed and to what the new doping level should be.\nEnd of Problem 1\n\nPage 5 of 10\nProblem 2 - (32 points)\nConsider the silicon diode pictured below. It is 4 μm long, with ohmic contacts at\neach end, and it is uniform p-type with NA = 1 x 1017 cm -3 for 1 μm on its far left end and\nuniform n-type with ND = 1 x 1017 cm -3 on its far right end. In between these two\nuniformly doped regions, the net concentration, Nd(x) - Na(x), slowly grades linearly\nover a distance of 2 μm from -1 x 1017 cm -3 on the left to 1 x 1017 cm -3 on the right, as\nshown in the lower figure.\nOhmic\nContact\n-2\n-1\nOhmic\nContact\np-Si, NA =\n1x1017 cm-3\np-Si\nlinearly\ngraded\nA\nB\nx [!m]\nn-Si\nlinearly\ngraded\nn-Si, ND =\n1x1017 cm-3\nNd(x)-Na(x) [cm-3]\n-2\n-1\n1 x 1017\n-1 x 1017\nx [!m]\nNote: 1 μm = 10-4 cm\na) [6 pts] In thermal equilibrium, what is the electrostatic potential, φ(x), in the left-\nhand quasi-neutral region at x = -1.5 μm, and what is the electrostatic potential, φ(x),\nin the right-hand quasi-neutral region at x = +1.5 μm, and what is the built-in\npotential step, Δφb, seen transiting from x = -1.5 μm to x = +1.5 μm? Use the 60 mV\nrule, and log 2 = 0.3.\nφ(-1.5 μm) =\nV\nφ(1.5 μm) =\nV\nΔφb =\nV\nProblem 2 continues on the next page\n\nPage 6 of 10\nProblem 2 continued\nb) [4 pts] For the rest of this problem, a bias voltage, VAB, is applied to this diode\nresulting in a total depletion region width of 1 μm, and xN =|xP| = 0.5 μm.\nOn the\naxes provided below, plot and label the net charge density, ρ(x), for x in the range - 2\nμm < x < 2 μm with this bias voltage applied. Use the depletion approximation and\nassume that the regions outside the depletion region are quasi-neutral, i.e. ρ(x) ≈ 0.\n!(x) [coul/cm3]\nx [!m]\n-2\n-1\nc) [4 pts] On the axes provided below, plot and label the electric field, E(x), for x in the\nrange - 2 μm < x < 2 μm with the bias voltage VAB applied.\nE(x) [V/cm]\nd) [4 pts] What is the change in potential, Δφ, transiting the depletion region when the\nbias is the same as in Part b, i.e. what is φ(0.5 μm) - φ(-0.5 μm)?\nΔφDepl.Reg. = φ(0.5 μm) - φ(-0.5 μm) =\nVolts\nProblem 2 continues on the next page\n\nPage 7 of 10\nProblem 2 continued\ne) [4 pts] What is the change in potential, Δφ, in transiting the quasi-neutral n-type\ngraded region between x = 0.5 μm and x = 1.0 μm, i.e. what is φ(1.0 μm) - φ(0.5 μm)?\nΔφnQNR. = φ(1.0 μm) - φ(0.5 μm) =\nVolts\nf) [4 pts] On the axes provided below, plot and label the electrostatic potential, φ(x),\nfor x in the range -2 μm < x < 2 μm with the same bias voltage applied as in Part c.\nUse the depletion approximation, and assume that the regions outside the depletion\nregion are quasi-neutral. In your plot make φ(0) = 0 Volts.\n!(x) [Volts]\nx [!m]\n-2\n-1\ng) [2 pts] What is the applied bias voltage, VAB?\nVAB =\nVolts\nEnd of Problem 2\n\nPage 8 of 10\nProblem 3 (34 points)\nA p-type semiconductor sample with acceptor concentration NA and length L,\nillustrated below, has ohmic contacts at both its ends. A light source generates MA\nelectron-hole pairs/cm2-s in the plane at x = XA, i.e. gL(x) = MAδ(XA). Assume low-level\ninjection and quasi-neutrality everywhere in the bar.\nThe general equation governing the excess minority carriers in a uniformly doped\nmaterial is\nOhmic\nContact\nXA\nL\nOhmic\nContact\np-type\nNA\nx\ngL(x) = MA !(XA)\nd2n'(x)\ndx 2\n\" n'(x)\nLe\n= \" 1\nDe\ngL(x)\na) [4 pts] What boundary condition is imposed on the excess minority carriers n' at x =\n0 and x = L ?\nBoundary condition at x = 0:\nBoundary condition at x = L:\nb) [4 pts] We now make the assumption that the minority carrier lifetime is very long,\nwhich simplifies the general equation to:\nd2n'(x)\ndx 2\n\" # 1\nDe\ngL(x)\nWhat quantitative restriction is placed on the minority carrier lifetime, τe, for this\nassumption to be valid?\nτe >> ≈ <<\n(circle one)\n(fill in the blank)\nProblem 3 continues on the next page\n\nPage 9 of 10\nProblem 3 continued\nc) [6 pts] Using the long-lifetime approximation in part (b), determine two constraints\n(i.e. boundary conditions) on the excess minority carriers at x = XA, i.e. relating\nn'(XA\n-) to n'(XA\n+).\nConstraint on n' at x = XA:\n(Hint: Finite currents imply finite dn'/dx.)\nConstraint on dn'/dx in the vicinity of x = XA:\n(Hint: What goes in must come out.)\nd) [6 pts] On the axes provided sketch the excess minority carrier concentration, n'(x),\neverywhere inside the semiconductor.\nLabel your sketch with the relevant\nequations for n'(x).\nXA\nL\nx\nn'(x)\ne) [6 pts] On the axes provided sketch the minority carrier diffusion current, Je,diff(x),\neverywhere inside the semiconductor.\nLabel your sketch with the relevant\nequations for Je,diff(x).\nXA\nL\nx\nJe,diff(x)\nProblem 3 continues on the next page\n\nn'(x) =\nJe,diff(x) =\nPage 10 of 10\nProblem 3 continued\nf) [4 pts] In the space below, briefly explain (approx. 25 words or less) why the\nminority carrier diffusion is the dominant minority carrier current.\ng) [4 pts] A second light source is added illuminating a single spot along the\nsemiconductor at x = XB, where xB > XA, and generating electron-hole pairs at a rate\nMB, so that gL(x) is now\ngL(x) = MA \"(XA) + MB \"(XB) .\nFind n'(x) and Je,diff(x) everywhere inside the semiconductor under this new\nillumination condition. If you could not do Parts d and e, indicate how you would\nuse the results of those parts to answer this question.\nEnd of Problem 3\nEnd of Exam One\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Exam No. 1 - Spring 2006",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/922bec63853b983c72f650385086b1e0_MIT6_012F09_exam1_s06.pdf",
      "content": "Page 1 of 10\nYOUR NAME________________________________\nDepartment of Electrical Engineering and Computer Science\nMassachusetts Institute of Technology\n6.012 Electronic Devices and Circuits\nExam No. 1\nWednesday, March 15, 2006\n7:30 to 9:30 pm\nNotes:\n1. Unless otherwise indicated, you should assume room temperature and that kT/q is\n0.025 V. You should also approximate [(kT/q) ln 10] as 0.06 V.\n2. Closed book; one sheet (2 pages) of notes permitted.\n3. All of your answers and any relevant work must appear on these pages. Any\nadditional paper you hand in will not be graded.\n4. Make reasonable approximations and assumptions. State and justify any such\nassumptions and approximations you do make.\n5. Be careful to include the correct units with your answers when appropriate.\n6. Be certain that you have all ten (10) pages of this exam booklet and the two (2) page\nformula sheet, and make certain that you write your name at the top of this page in\nthe space provided.\n7. An effort has been made to make the various parts of these problems independent of\neach other so if you have difficulty with one item go on, and come back later.\n6.012 Staff Use Only\nPROBLEM 1\n(out of a possible 34)\nPROBLEM 2\n(out of a possible 33)\nPROBLEM 3\n(out of a possible 33)\nTOTAL\n\nYour name\nPage 2 of 10\nProblem 1 - (34 points)\nA silicon resistor is shown schematically below. The silicon is doped uniformly\nwith a boron (B) concentration of 2 x 1016 cm-3, and an arsenic (As) concentration of 1 x\n1016 cm-3 . (Recall that boron is in Column III of the periodic table and As is in Column\nV.) There are ohmic contacts at each end of the silicon resistor. Assume the mobilities\nare μ = 1,600 cm2/V-s and μh = 600 cm2/V-s, and the minority carrier lifetimes are τ =\ne\ne\nτh = 10-7 s.\nA\n1 μm\n1000 μm\nvAB\nB\n+\n-\niA\n10 μm\na) [18 pts] Assuming thermal equilibrium (vAB = 0) at room temperature, find the\nfollowing.\ni) The total acceptor concentration, N :\na\nN =\ncm-3\na\nii) The net acceptor concentration, NA = (N -Nd):\na\nNA =\ncm-3\niii) The hole concentration, p :\no\n-3\np =\ncm\no\nProblem 1 continues on the next page\n\nPage 3 of 10\nProblem 1 continued\niv) The electron concentration, n :\no\n-3\nn =\ncm\no\nv) The electrical conductivity, σ :\no\nσ =\nS/cm\no\nvi) The electrostatic potential relative to intrinsic silicon, φp:\nφ =\nV\no\nb) [9 pts] Let the applied voltage, vAB, be 2 Volts. Find the following:\ni) The end-to-end resistance of the resistor.\nR =\nΩ\nii) The electric field, E, in the silicon.\nE =\nV/cm\nProblem 1 continues on the next page\n\nPage 4 of 10\nProblem 1 continued\niii) The total drift current density, Jdr:\nJdr =\nA/cm2\nc) [7 pts] Assume the silicon is illuminated by a steady state light which generates\nelectron-hole pairs uniformly throughout the bulk, with a rate gL = 1023 cm-3s-1 . Find\nthe following under illumination assuming steady state.\ni) The minority carrier diffusion length, Lmin:\nLmin =\ncm\nii) The excess minority carrier population and the conductivity, σ, in the middle\nportion of the resistor many minority diffusion lengths from the ohmic contacts:\nn' =\ncm-3\nσ =\nS/cm\nEnd of Problem 1\n\nYour name\nPage 5 of 10\nx\nProblem 2 (33 points)\nThe p-type silicon sample illustrated below is made from silicon having a net\nacceptor concentration of 5 x 1017 cm-3; minority carrier diffusion length, Lmin, of 100 μm;\nelectron mobility, μ , of 1600 cm2/V-s; and hole mobility, μh, of 600 cm2/V-s. The\ne\nsample is 10 μm long (10 μm = 10-3 cm). All of the surfaces are reflecting boundaries\nexcept for the ohmic contact on the right end. The sample is illuminated with a constant\nlight that generates 1019 hole-electron pairs/cm3-s uniformly throughout the bulk.\np-type, NA = 5 x 1017 cm-3\nOhmic\nL\na) [8 pts] What is the boundary condition on the excess minority carrier concentration\nor its derivative at each end of the sample?\ni) Boundary condition at x = 0:\nii) Boundary condition at x = L (= 10 μm):\nb) [5pts] What is the minority carrier lifetime, τmin, in this sample?\nτmin =\ns\nc) [8 pts] The figures you need to answer this question are on the next page.\ni) From the six sketches on the next page, select the one which best illustrates the\nmagnitude of the minority carrier current in this sample when it is uniformly\nilluminated as described above. Explain your answer.\nSketch _______ because\nProblem 2 continues on the next page\n\nPage 6 of 10\nProblem 2 continued\nA\nB\nC\nD\nE\nF\nx\nx\nx\nx\nx\nx\nii) From the six sketches above, select the one which best illustrates the profile of the\nexcess minority carrier concentration in this sample when it is illuminated as\ndescribed above. Explain your answer.\nSketch _______ because\nd) [6 pts] Assuming infinite minority carrier lifetime (and thus no recombination in the\nbulk), what is the minority carrier current density, Jemin, flowing into, or out of, the\nohmic contact, when the sample is illuminated as described?\nJmin(x = L -)=\nA/cm2\nProblem 2 continues on the next page\n\nPage 7 of 10\nProblem 2 continued\ne) [6 pts] We know that the minority carrier lifetime is not infinite, and there is some\nrecombination in the bulk.\ni) What is the rate per unit area at which hole-electron pairs are recombining in the\nentire bulk of the sample away from the ohmic contact? First give a formula ,\nand then a numerical value.\nAlgebraic expression =\nRecombination =\npairs/cm2-s\nii) Compare your answer above to your answer in Part d. How would you expect\nthe excess carrier fluxes into the ohmic contact to compare with the rate of hole-\nelectron recombination occurring in the bulk? Explain your answer.\nMuch greater than _______\nMuch less than _______\nSimilar to _______\nbecause:\nEnd of Problem 2\n\nYour name\nPage 8 of 10\nProblem 3 - (33 points)\nYou are given the following asymmetrical silicon (Si) n+-p junction diode structure\nwith wn = 1 μm, wp = 4 μm, and τe = τh = inf. The n-region of this diode is heavily doped,\nND = 1019 cm-3 . The p-region is composed of two sub-regions with doping NA1 and NA2\nas shown. The width of the first sub-region, w1, is 2 μm. Assume the mobilities are μ =\ne\n1,600 cm2/V-s and μh = 600 cm2/V-s.\nND\nNA1\nNA2\nA\nB\n- vAB +\nx\n-wn\nw1\nwp\na) [15 pts] First consider a diode in which the two p-type sub-regions have the same\ndoping level with NA1 = NA2 = 1015 cm-3 . In Parts i) and ii) assume there is zero\napplied bias, vAB = 0 V; in Part iii) assume forward bias, vAB > 0. Calculate the\nfollowing quantities:\ni) The built-in potential of the junction, φb.\nφb = ________________V\nii) The width of the depletion region on the p-side of the junction, xp.\nxp = ________________ μm\niii) The ratio of the electron to hole current density crossing the junction.\nJ /Jh = ________________\ne\nProblem 3 continues on the next page\n\nPage 9 of 10\nProblem 3 continued\nb) [18 pts] Next consider a device in which the second region is doped much more\nheavily p-type with NA2 = 1018 cm-3 . The doping level in the first region is the same\nas before, i.e., NA1 = 1015 cm-3 . The width of this first region is 2 μm.\ni) Consider the situation with zero applied bias, i.e., vAB = 0 V. What is the built-in\npotential, φb, of the junction?\nφb = ________________ V\nii) A bias, vAB = V1, is applied so that the width depletion region on the p-side of this\ndiode, xp, is 2 μm, i.e. the first p-region is fully depleted. What is V1?\nV1 = vAB(such that xp = w1) = ________________V\niii) With a bias applied as in Part b) ii) so that xp = w1 = 2 μm, what is the small signal\nlinear equivalent junction capacitance per unit area, Cab(V1) ≡ ∂qAB/∂vAB|vAB = V1?\nHint: Think \"depletion region width\" rather than \"complicated formula.\"\nJunction capacitance per unit area, Cab(V1 ) = _________________ F/cm2\nProblem 3 continues on the next page\n\nPage 10 of 10\nProblem 3 continued\niv) The small signal linear equivalent capacitance of this junction in the reverse bias\nregion, i.e. VAB < 0 V, looks like one of the sketches below as the bias is changed.\nChose the correct one and explain why. (Note that correct choice with no\nexplanation receives no points.) Hint: See hint for Part (iii).\nCj\nCj\nCj\nCj\nvAB\nvAB\nV1\nV1\nV1\nV1\nvAB\nvAB\n(a)\n(b)\n(c)\n(d)\nFigure ______ because\nEnd of Problem 3; End of Exam\n\nExtra pieces :\nProblem 1: Add to problem if use on future Problem Set\niii) On the axes provided below sketch and dimension the excess minority carrier\npopulation within 3 minority carrier diffusion lengths of the ohmic contact on\nthe right end of the bar.\nn'(x) [cm-3]\nx [μm]\nLmin\n2Lmi\n3Lmi\nn'(x >> Lmin)\nProblem 3: ditto\nc) [8 pts] Finally consider a diode in which the first p-type sub-region is very thin,\nw1=10 nm (= 10-2 μm), and is more heavily doped than the second p-type sub-region:\nNA1=1016 cm-3, NA2=1015 cm-3 . There is zero volts applied bias, vAB = 0. You may\nassume that w1 << xp and treat the depletion charge in Sub-region 1 as a delta\nfunction at x=0+.\ni) Calculate electrostatic potential step, φb, crossing the junction.\nφb = ________________ V\nii) Calculate width of the depletion region on the p-side, xp.\nxp = ________________ μm\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Exam No. 1 - Spring 2008",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/e53c99178faf01a66ea1878adee9532d_MIT6_012F09_exam1_s08.pdf",
      "content": "YOUR NAME\nPage 1 of 10\nDepartment of Electrical Engineering and Computer Science\nMassachusetts Institute of Technology\n6.012 Electronic Devices and Circuits\nExam No. 1\nWednesday, March 12, 2008\n7:30 to 9:30 pm\nNotes:\n1. An effort has been made to make the various parts of these problems independent of\neach other so if you have difficulty with one item go on, and come back later.\n2. Some questions ask for an explanation of your answer. No credit will be given for\nanswers lacking this explanation.\n3. Unless otherwise indicated, you should assume room temperature and that kT/q is\n0.025 V. You should also approximate [(kT/q) ln 10] as 0.06 V.\n4. Closed book; one sheet (2 pages) of notes permitted. Formula sheet provided.\n5. All of your answers and any relevant work must appear on these pages. Any\nadditional paper you hand in will not be graded.\n6. Make reasonable approximations and assumptions.\nState and justify any such\nassumptions and approximations you do make.\n7. Be careful to include the correct units with your answers when appropriate.\n8. Be certain that you have all ten (10) pages of this exam booklet and the three (3) page\nformula sheet, and make certain that you write your name at the top of this page in\nthe space provided.\n6.012 Staff Use Only\nPROBLEM 1\n(out of a possible 34)\nPROBLEM 2\n(out of a possible 32)\nPROBLEM 3\n(out of a possible 34)\nTOTAL\n\nPage 2 of 10\nProblem 1 - (34 points)\nParts a, b, and c of this question are each an independent mini-question.\n(a) A short bar of p-type silicon, NA = 1017 cm -3, is illuminated with light that uniformly\ngenerates 1020 hole-electron pairs/cm3-s throughout it.\n(i) [2 pts] The steady-state excess hole and electron populations, n' and p', in the\nilluminated bar are both 1014 cm -3. What is the minority carrier lifetime in this\nsample?\nτmin =\ns\n(ii) [4 pts] What are the approximate total hole and electron populations in the\nilluminated bar in the steady state?\nn ≈\ncm -3\np ≈\ncm -3\n(iii) [2 pts] After being on for a long time, the illumination is turned off at t = 0.\nWrite an expression for n'(t) for t > 0. If you could not do Part (i) leave your\nanswer in terms of τmin.\nn'(t) =\ncm -3\n(iv) [2 pts] An ohmic contact is added to one end of the sample. How will the rate\nat which excess minority carrier populations decay when the light is turned off\nin the sample with a contact compare to the rate in your answer in (iii) above?\nFaster ____ Slower ____ Negligibly different ____ because\nProblem 1 continues on the next page\n\naaa\nPage 3 of 10\nProblem 1 continued\nb) This question deals with the MOS capacitor shown below. In this device tox = 30 nm,\nεox = 3.5 x 10-13 Coul/V-cm, φm = 0.3 V, and φp = - 0.36 V (NAp = 1016 cm -3).\np-type Si, NAp\nvGB\nG\nB\n-tox\nx\nW\nOhmic\nContact\n(i) [7 pts] Recall that the \"flat-band\" condition is defined by φ(0) = φp (i.e., no\nchange in potential between x = 0 and x = w) and occurs when vGB = VFB,. On\nthe axes below, sketch ρ(x) and φ(0) at flat-band; also calculate the value of VFB.\n-tox\nx\n!(x) [Coul/cm3]\nW\n-tox\nx\n\"(x) [Volts]\n\"m\nW\n\"p\nVFB =\nVolts\n(ii) [7 pts] Now suppose that a sheet of charge, Qox = 2 x 10-8 Coul/cm2, is added in\nthe oxide side of the oxide-semiconductor interface at x = 0-. On the axes on\nthe next page complete the charge density plot and plot the electrostatic\npotential at flat-band in this new situation. Also, calculate the new value of the\nProblem 1 continues on the next page\n\nPage 4 of 10\nProblem 1 continued\nflat-band voltage, VFB. NOTE: Flat-band is still defined as when φ(0) = φp.\n-tox\nx\n!(x) [Coul/cm3]\nW\n-tox\nx\n\"(x) [Volts]\n\"m\nW\n\"p\nQox #(x)\nVFB =\nVolts\nc) [10 pts] The p-type region of a silicon p-n diode has a net acceptor doping concen\ntration, NAp, of 1017 cm -3, and is 1 μm (10-4 cm) wide. Design the n-type region of\nthis diode (i.e. specify its doping level and width) so that (1) the built-in potential\nat the junction is 0.78 V, and (2) the total diode current density is 1 mA/cm2 when\na forward bias of 0.4 V is applied. You may assume that the width of the depletion\nregion is negligible in forward bias compared to the total width of the p and n\nregions. The minority carrier diffusion coefficients for electrons and holes are 40\ncm2/s and 15 cm2/s, respectively; assume the minority carrier lifetime is infinite.\nDoping level on n-side, NDn =\ncm -3\nWidth of n-side, wn =\ncm\nEnd of Problem 1\n\nPage 5 of 10\nProblem 2 - (32 points)\nThis question concerns the silicon sample illustrated below which has three\nuniformly doped regions: Regions 1 and 3 are p-type, and Region 2 is n-type. There are\nohmic contacts on either end of the sample, and there is a contact to Region 2 off to the\nside (much as it is in a bipolar junction transistor). Throughout the sample the electron\ndiffusion coefficient, De, is 40 cm2/s, the hole diffusion coefficient, Dh, is 15 cm2/s, and\nτmin ≈ inf. The cross-sectional area is 10-4 cm2.\nRegion 1\np-type Si\nNA1 = 1016 cm-3\nRegion 2\nn-type Si\nND2 =\n1017 cm-3\nRegion 3\np-type Si\nNA3 = ?\nV12\nV32\nI1\nI2\nI3\n+\n+\n!\n!\nx [!m]\nJunction A\nJunction B\nOhmic\nContact\nOhmic\nContact\nWhen Terminal 2 is grounded and bias voltages, V12 and V32, are applied to this\ndevice, the excess minority carrier profiles shown below result in Regions 2 and 3. (You\nhave to figure out what happens in Region 1 yourself.)\nYou can ignore the widths of the depletion regions for purposes of answering the\nquestions below.\nx [!m]\np',n' [cm-3]\n5x1014\n(a)\nLooking at Junction B:\n(i) [4 pts] What is JElectron-B, the electron current density crossing Junction B?\nRecall that this is the minority carrier diffusion current density in Region 3.\nJElectron-B =\nA/cm2\nProblem 2 continues on the next page\n\nPage 6 of 10\nProblem 2 continued\n(ii) [4 pts] What is JHole-B, the hole current density crossing Junction B?\nJHole-B =\nA/cm2\n(iii) [4 pts] What is the terminal current I3?\nI3 =\nA\n(iv) [4 pts] What is NA3, the doping level in Region 3?\nNA3 =\ncm -3\n(b) Looking at Junction A:\n(i) [4 pts] What is n'(2-), the excess electron concentration at the edge of the\nquasi-neutral region on the p-side of this junction, i.e. just to the left of the\nedge of the depletion region at x = 2-?\nn'(2-) =\ncm -3\n(ii) [4 pts] What is V12, the voltage bias on Junction A?\nV12 =\nVolts\nProblem 2 continues on the next page\n\nβF =\nPage 7 of 10\nProblem 2 continued\n(c)\nLooking now at the entire sample, removing the biases V12 and V32, and thinking of\nthe structure as a bipolar junction transistor:\n(i) [4 pts] What is the best terminal to use as the emitter, and why?\nTerminal 1\nTerminal 2\nTerminal 3\n, because\n(ii) [4 pts] For your choice of emitter above, what is the forward current gain, βF,\nof this transistor?\nEnd of Problem 2\n\nPage 8 of 10\nProblem 3 (34 points)\nConsider the n+-p diode shown below in thermal equilibrium. The n+ doping in\nRegion 1 is high enough that it is degenerate, with φn+ = 0.55 V. Assume that the\ndepletion region on the n+ side of the junction is negligibly small so that you may also\nassume negligible change in potential across it. Note too that Region 2, the p- Si region,\nis very lightly doped (i.e. NA2 < 1013 cm -3). Finally, L = 0.2 μm (= 2 x 10-5 cm).\nRegion 1\nn+-Si\nND1 =\n1020cm-3\nRegion 2\np!-Si\nNA2 <\n1013cm-3\nRegion 3\np-Si\nNA3=1017cm-3\n-L\nx\nOhmic\nContact\nOhmic\nContact\n(a) [5 pts] Calculate Δφ13, the built-in potential difference between the QNR (quasi\nneutral region) in Region 1 (i.e. where x << -L) and the QNR in Region 3 (where x\n>> 0).\nΔφ13 =\nVolts\n(b) [6 pts] Using the Depletion Approximation, sketch and label ρ(x), the net charge\ndensity in this structure. You should label the depletion region width in Region 3\nxD (you are not expect to find a value for xD). You may assume that the width of\nthe depletion region in Region 1 is negligibly small (so that there is essentially an\nimpulse of charge at x = -L).\n!(x) [Coul/cm3]\n-L\nx\nProblem 3 continues on the next page\n\nPage 9 of 10\nProblem 3 continued\n(b) [6 pts] Sketch E(x), the electric field, in the structure assuming you can ignore the\ncharge in Region 2. You do not need to calculate numerical values, but you should\nlabel your sketch in the various regions with expressions for E(x) .\nE(x) [V/cm]\n-L\nx\n(c) [6 pts] Sketch φ(x), the electrostatic potential, through the structure. Label your\nsketch with the values of φn+ and φp. Also indicate and give expressions for Δφ2, the\nchange in the electrostatic potential across Region 2, and for Δφ3, the change in the\nelectrostatic potential across Region 3.\n!(x) [Volts]\n-L\nx\nProblem 3 continues on the next page\n\nEquation with xD being the only unknown:\nExpression for C*\ndp :\nPage 10 of 10\nProblem 3 continued\n(d) [6 pts] Set up an equation with xD, the width of the depletion layer in Region 3,\nbeing the only unknown, that you could use to find xD. DO NOT solve your\nequation to find xD.\n(e) [5 pts] Give an expression for C*\ndp, the depletion capacitance per unit area of this\ndevice at zero bias, V = 0 Volts. xD can appear as a parameter in your expression.\nEnd of Problem 3\nEnd of Exam One\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Answers to Exam 2 - Fall 2009",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/6b0e910b2b0625b7fc457baf435c9bf7_MIT6_012F09_exam2_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nAnswers to Exam 2 - Fall 2009\nProblem 1: Graded by Prof. Fonstad\na) i)\nApplying vGS > VT to an n-channel MOSFET accumulates additional holes at the\ninterface. The additional amount of interface charge is -WLCox *(vGS - VT) = -5 x\n10-4 x 2 x 10-5 x 10-8 x 1 = 10-16 Coul.\nii)\nThe additional holes come from the p-type bulk region.\niii)\nApplying vGS < VFB to an n-channel MOSFET increases the number of inversion\nlayer electrons at the interface. The additional charge is -WLCox *(vGS - VFB) = 5 x\n10-4 x 2 x 10-5 x 10-8 x 1 = 10-16 Coul.\niv)\nThe additional electrons come from the n-type source and drain regions.\nb) i)\nOne of the n+ regions (source or drain) is the emitter, the other n+ region is the\ncollector, and the base is the p-region, or substrate. To bias an npn BJT in its\nforward active region requires VCE ≥ 0.2 V and VBE ≈ 0.6 to 0.7 V. Saying both\nhad to be greater than zero was accepted and earned most of the points.\nii)\nThe forward current gain, βF, is low because a large fraction of the electrons\ninjected across the emitter-base diode into the p-region are directed vertically\nand not laterally toward the collector.\nThe early voltage is low, and thus there is a significant amount of base width\nmodulation, because the collector is more heavily doped than the base,\nmeaning that the depletion region at the collector-base junction extends\nprimarily into the base side of the junction.\niii)\nAdding a heavily doped p-type region under the n+ regions reduces the\nvertical injection of electrons across the emitter-base junction and the junction\ncurrent is now predominantly electrons flowing laterally across the junction\nand toward the relatively close collector. This makes βF much larger.\nc) i)\nDoing a Taylor's Series expansion about Q, and isolating the small signal terms:\nid = (diD/dvGS)|Q vgs + (diD/dvDS)|Q vds\n= (W/L) μe [Cox* VDS vgs + (Cox* VGS+ α) vds]\nii)\nThe small signal linear equivalent circuit is:\nvds\ng\ns\nd\ns\nvgs\ngo\ngmvgs\nwith gm = (W/L) μe Cox* VDS and go = (W/L) μe (Cox* VGS+ α)\niii)\nTo find RL we first find ID = 10-7 (10 VGS + 1) VDS with VGS = 1 V and VDS = 1.5 V,\nor ID = 1.65 x 10-6 Amps. The voltage drop across RL must be 1.5 V, so\nRL = 1.5/(1.65 x 10-6) ≈ 900,000 Ohms\n\nWe can now use this result and our linear equivalent circuit to draw the linear\nequivalent circuit for the full circuit, and from that we find the voltage gain:\nWe find gm = 1.5 x 10-6 mho and go = 1.1 x 10-6 mho, and using the RL above we\nhave 1/RL = GL = 1.1 x 10-6 mho. Thus, Av = vout/vin = -gm/(go+GL) ≈ - 0.7.\nProblem 2: Graded by Prof. Weinstein\na) In flatband there is no depletion region, φ(0) = φn, and there is no voltage drop\nacross the dielectric.\nRL\nvds\n= v out\ng\ns\nvin = v gs\ngo\ngmvgs\ns\nd\n!0.5 \"n\n\"(x)\n-thi\nL\nx\n\"(0) = \"n\nVFB = 1.5 \"n\nAs indicated in the figure, VFB = 1.5 φn.\nb) At flatband the hole and electron populations are the same as they are in the bulk of the\nsemiconductor. Thus, n(x = 0+) = ND, and p(x = 0+) = ni\n2/ND.\nc) At the onset of threshold φ(0) = -φn, the depletion region accommodates a change in\npotential of 2 φn and thus XD = [2εSi (2 φn)/qND]1/2. The potential drop across the\ndielectric qNDXDthi/εhi, and VT - VFB = - 2 φn - (thi/εhi)[2εSi (2 φn) qND]1/2.\nWith these results, we find VT = VFB - 2 φn - (thi/εhi)[2εSi (2 φn) qND]1/2\n= - 0.5 φn - (thi/εhi)[2εSi (2 φn) qND]1/2\nThe electrostatic potential profile at the onset of inversion:\n!(0) = -!n\n\"0.5 !n\n!(x)\n-thi\nL\nx\n!n\nVFB = 1.5 !n\nVT\n2 !n\nXD\n(thi/#hi)(2#Si qND 2!n)1/2\n\nThe net charge distribution at the onset of inversion:\n!(x)\n-thi\nL\nx\nqND\nqNDXD\nXD\n-qNDXD\nd)\nAt the onset of inversion, the hole density at the interface is ND, i.e. p(x = 0+) = ND,\nand n(x = 0+) = ni\n2/ND.\ne)\nIf there is a net sheet charge density, σi, at the interface, then at flatband there is a\nnet sheet charge density, -σi, on the gate, and no other charge in semiconductor up\nto the interface. The voltage drop across the gate dielectric is σi(thi/εhi), and the\nflatband voltage must be more negative by this amount, ΔVFB = - σi(thi/εhi). The\nthreshold voltage will be more negative by this same amount: ΔVT = - σi(thi/εhi).\nf)\nWith an additional dielectric layer under the gate, there is additional voltage drop\nacross the insulator for the same charge on the gate: ΔV (w.o. SiO2) = QG(thi/εhi)\nand ΔV (w. SiO2) = QG(thi/εhi) + QG(tox/εox). CG = QG/ΔV = 1/(thi/εhi + tox/εox) =\nεhi/2thi. Thus CG(w. SiO2)/ CG(w.o. SiO2) = 1⁄2.\nProblem 3: Graded by Prof. Palacios\na)\nID,sat = (Wmin/2Lmin)μe(εox/tox)(VGS - VT)2[1+λn(VDS -VDS,sat)]\n= [135/(2 x 35)] x 500 x (3.5 x 10-13/10-7) (0.6)2 (1+0.001(1-0.4))≈ 1.2 mA\nb)\nro = 1/go = 1/λnID = 1/(10-3 x 1.2 x 10-3) = 10-6/1.2 ≈ 800,000 Ohms\nc)\nVIN1\n0 V\n0 V\n1 V\n1 V\nVIN2\n0 V\n1 V\n0 V\n1 V\nVOUT\n1 V\n1 V\n1 V\n0 V\nd)\nWn, Inverter = 1 Wmin\nand\nWp, Inverter = (μe/μh) Wn, Inverter = (500/200) Wmin = 2.5 Wmin\ne)\nWe want the n-MOSFETs to each be minimum length since the effective length will\nbe the sum of the lengths of two n-MOSFETs: Ln,NAND = 1 Lmin. and Ln,Eff = 2 Lmin.\nTo minimize the delay, we will require the same current capability as in a standard\ninverter. To achieve this with an effective gate length Ln,Eff = 2 Lmin, the width needs\nto be Wn,NAND = 2 Wmin.\nAs the current capability of the n-MOS branch is the same as in an inverter, the p-\nMOS branch can be sized as in the inverter in question d). Thus CIN,NAND =\n2.5WminLmin + 2WminLmin = 4.5 WminLmin. CIN,Inverter = WminLmin+ 2.5 WminLmin = 3.5\nWminLmin, so CIN,NAND = 1.29 CIN,Inverter.\nf)\nThe question speaks of inverter equivalents. The inverters have 15nA leakage if\ntheir output is high (n-MOS off), and 37.5 nA leakage if their output is low (p-\nMOS, which is 2.5 x as wide, off) so the static power dissipation is 15 nA/gate x 1\nV x 109 gates + 37.5 nA/gate x 1 V x 109 gates = 47.5 Watts!\n\n__________________________\nIf you did the problem assuming 109 NAND gates, then the output is low, we have\nsubthreshold current coming from each one of the two p-MOSFETs, which are\nconnected in parallel. Therefore, the power dissipation is: 2 transistors/gate x 15\nnA/transistor x 1 V x (1 x 109) gates = 30 Watts. When the output is high, the\nleakage current is due to the subthreshold current through the n-MOSFETs, which\nare connected in series and the current is dominated by one of them (i.e. they share\nthe same current). Thus, the power dissipation in this state is: 1 transistor/gate x\n15 nA/transistor x 1 V x (1 x 109) gates = 15 Watts. By adding the two\ncontributions, the total dissipated power is: 30 W + 15W = 45 W\ng) i) Eave = 1 V/(35 x 10-7 cm) ≈ 3 x 105 V/cm\nii) The average sheet charge density is qn* = Cox*(vGS - VT) = 0.6 (εox/tox) = 0.6 x 3.5 x\n10-6 = 2.1 x 10-6 coul/cm2. The current, iD = W qn* sch,ave. Assuming iD = 250 μA,\nwe have: sch,ave = iD/(W qn*) = 2.5 x 10-4/(1.35 x 10-5 x 2.1 x 10-6) ≈ 0.88 x 107 cm/s.\nAssuming iD = 1.2 mA as found in part (a), we find: sch,ave ≈ 4.2 x 107 cm/s.\niii) The current is almost 5 times smaller than the low field constant mobility model\npredicts because the velocity saturates at just under 107 V/cm.\nExam Statistics\nAverage/Standard deviation:\nProblem 1\n21.5\n5.3\nProblem 2\n19.2\n7.6\nProblem 3\n25.1\n5.5\nTotal\n65.8\n14.9\nClass median: 65\nDistribution to nearest 5:\nFind your face in this picture\nTotal Score\n-σ\nAve & Mean\n+σ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Answers to Exam 2 - Spring 2006",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/16d3e1b848dec36cfdede18c9257289f_MIT6_012F09_exam2_s06_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nAnswers to Exam 2 - Spring 2006\nProblem 1: Graded by Prof. Fonstad\na) i)\nA less than B, because K varies inversely with L.\nii)\nA similar to B, because the threshold voltage does not depend on L.\niii)\nA greater than B, because A has a smaller K and thus must be biased stronger.\niv)\nA less than B, because VA is bigger for the longer device, and thus go is smaller.\nv)\nA greater than B, because the area of the gate (WxL) is larger.\nvi)\nA similar to B, because Cgd is proportional to the device width and that is the\nsame in both devices.\nb) i)\nA less than B, because IES is dominated by NAB and proportional to 1/NAB.\nii)\nA similar to B, because ICS is dominated by NDC and that is the same in both\ndevices. A less than B was also accepted.\niii)\nA less than B, because the emitter defect increases with NAB, and β ≈ 1/δE.\niv)\nA similar to B, because gm = qIC/kT and is the same for both devices.\nv)\nA less than B, because VA increases as the doping increases, and go = IC/VA\nvi)\nA similar to B, because Cμ is nominated by the collector doping, which is the\nsame in both devices. A greater than B was also accepted.\nc) i)\nEssentially unchanged, because the sum of the n- and p-channel MOSFET gate\nareas is still 3WminLmin.\nii)\nDecreased, because the p-FET is now narrower and delivers less current.\niii)\nIncreased, because the n-FET is now wider and can draw more current.\niv)\nEssentially unchanged, because the static power is zero. (Trick question?)\nv)\nEssentially unchanged, because the logic HI voltage is still VDD.\niv)\nOne increased, one decreased, because the nearly vertical portion of the\ntransfer characteristic is no longer centered about VDD/2.\nProblem 2: Graded by Prof. Hoyt\na) βF = iC/iB = 9.25 mA/92.5 μA = 100\nb) δB = 0, because the lifetime is infinite, meaning the minority carrier diffusion length\nis also infinite.\nc)\nThe factor in question appears in the emitter defect expression, and we can find the\nemitter defect because we know βF and βF ≈ 1/δE, when δB is negligible, as it is here:\n\ng)\nn'(x)\nn'(x)\nQdiff(B) =\n2 Qdiff(A)\nQdiff(A)\nx\nx\nβF and βF ≈ 1/δE =(DeWE,effNDE)/(DhWB,effNAB) = (De/Dh) r, so r = βF(De/Dh) = 50\nd) Use the Gummel plot to find a value for IES, and then use IES to find NAB:\nIC ≈ IES exp (qVBE/kT), and IES ≈ Aqni\n2(De/WB,effNAB),\nso NAB = Aqni\n2(De/WB,effIC) exp (qVBE/kT) = 1 x 1017 cm-3\ne)\nWith the results of Parts (c) and (d), we find NDE = r WB,effNAB/WE,eff = 1 x 1019 cm-3\nf)\nn, p\n1.45 x 1015 cm-3\n1.45 x 1013 cm-3\nn\np\n2 x 103 cm-3\n10 cm-3\n≈ 0\np\nx [μm]\n-0.25\n0.5\n1.5\n(-wE)\n(wB)\n(wB+wC)\nwB\nwB\nProblem 3: Graded by John Hennessey for Prof. Antoniadis\na) VFB = -(φn+ - φp) = -[0.54 - (-0.3)] = - 0.84 V\nb)\nx\n-xM -xox\nxA\nxB\nφ(x)\n0.54 V\n0.2 V\n-0.3 V\n-0.54 V\nSlight curvature\n(concave up)\n\nc) xp = xA = (2 εSi Δφ/q NA)1/2 = 10 nm. We find Δφ = 0.08 V\nThe assumption is justified because the total potential change, which is|VFB|, is\nmuch greater than this value.\nd)\ni)\nElectric field:\nii)\nCharge density:\nx\n-xM -xox\nxA\nxB\nΕ(x)\nQn'/εox\nQn'/εSi\nE(0-)/E(0+) = eSi/eox = 3\nVery small negative slope\nx\n-xM -xox\nxA\nxB\nρ(x)\nQn '\nQp '\n-qNA\ne) Neglecting qNAxA relative to Qn' and Qp', then Qp' ≈ Qn'. The situation looks like a\nparallel plate capacitor with two different dielectrics. The total potential drop from\nx = -xox to x = xA is VFB, or 0.84 V. The drop across the oxide is Qp'xox/εox and that\nacross the silicon is Qp'xSi/εSi. Adding these together and setting them equal to VFB,\nQp'xox/εox + Qp'xSi/εSi = VFB, we find\nQp' = VFB/(xox/εox + xSi/εSi) = 3.5 x 10-7 C/cm2\nf) The charge in the depleted lightly doped p-region is:\n-qNA xA = 1.6 x 10-19 1015 10-6 = - 1.6 x 10-10 coul/cm2\nThis is much less than Qp', so it neglecting it was a good approximation.\n\nAverage/Standard deviation:\nProblem 1\nProblem 2\n28.7\n18.5\n4.6\n6.1\nProblem 3\n14.7\n5.5\nTotal\n62.0\n12.7\nDistribution to nearest 5:\nFind your face in this picture\nTotal Score\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Answers to Exam 2 - Spring 2008",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/aaf1a3d0c8170abca86a7dbcc723b90a_MIT6_012F09_exam2_s08_sol.pdf",
      "content": "MASSACHUSETTS INSTITUTE OF TECHNOLOGY\nDepartment of Electrical Engineering and Computer Science\n6.012 MICROELECTRONIC DEVICES AND CIRCUITS\nAnswers to Exam 2 - Spring 2008\nProblem 1: Graded by Prof. Fonstad\na) i)\nn-channel MOSFET: Enhancement mode because VT ≥ 0, which for an n-\nchannel MOSFET means that with vGS = 0 there is no channel.\np-channel MOSFET: Depletion mode because VT ≥ 0, which for a p-channel\nMOSFET means that with vGS = 0 there is already a channel.\nii)\nNegative because there is a hole inversion layer in the p-channel device, i.e.\nelectrons depleted from the area near the interface and holes attracted to the\ninterface, even with vGS = 0. Concurrently, it takes more gate voltage to invert\nthe channel of the n-channel device, meaning more positive charge must be put\non the gate electrode which is balances by negative ions at the interface.\niii)\nLarger, because the charging current is the current in saturation through the p-\nchannel device, and since the current in saturation for both of the devices is\nproportional to (VDD - |VT|)2, this current is larger for the p-channel device\nsince for it |VT| is smaller.\niv)\nLarger, because for both devices |VT| = |VFB| + |2φSi| + (tox/εox)(....)1/2.\nmaking tox thicker, makes |VT| larger.\nThus\nb)\ni)\nVGS:\n2V\nVBS:\n-1V\nVDS:\n2V\nvgs:\nvAC\nvds:\nvAC\nvbs:\nvAC\nThe LEC is a single resistor: rac = 1/gac = 1/[gm+gmb+go]= 1/[gm(1+η)+go]\nLEC:\n+\n-\nvac\ngmvac\ngo\n+\n-\nvac\ngac\n+\n-\nvac\ngmbvac\n+\n-\nvac\nii)\nn-channel, because for a transistor in strong inversion and biased in saturation,\ngm = (2KID)1/2 and we can assume that Kn > Kp because in general μe > μh.\niii)\nSimilar, because for a transistor operating sub-threshold gm = qID/nkT, and the\nID's are equal and the n's will be similar.\niv)\nIn the linear region iD = K(vGS -VT -vDS/2)vDS\nTransconductance: gm = ∂iD/∂vGS|Q = KVDS\nOutput conductance: go = ∂iD/∂vDS|Q = [K(vGS -VT -vDS/2)-KvDS/2]|Q=K(VGS -VT -VDS)\n\nProblem 2: Graded by Prof. Palacios\na) The iD-vDS plot shows us that for the gate voltage applied the MOSFET saturates at a\nvDS of 5 V. We can find out what the gate voltage is using: VDS,sat = VGS - VT:\nVGS = VDS,sat + VT = 5 V + 1 V = 6 V\nb) Near the origin, iD = K(vGS -VT-vDS/2)vDS and the slope is K(vGS -VT-vDS). Evaluating\nthis at the origin, we find that\n∂iD/∂vDS (@ VDS = 0) = K(VGS - VT) = KVDS,sat\nwhere (VGS - VT) = 5 V. To find K and evaluate this we can use the saturation\ncurrent, 10 mA, and saturation voltage, 5 V, in iD,sat = K(vGS - VT)2/2 =K(VDS,sat)2/2 to\nfind:\nK = 2iD,sat/(VDS,sat)2 = 2 (0.01/25) = 0.0008 A/V2\nWith this the slope, KVDS,sat, is: 8 x 10-4 x 5 = 4 x 10-3 S\nc) At any point in the channel, qN*(y) = -(εox/tox)(VGC -VT) = -(εox/tox)(VGS -VCS -VT)\ni) At the source end of the channel, VCS = 0, and we find:\nqN*(0) = -(εox/tox)(VGS -VT) = -(3.5 x 10-13/10-6)5 = -1.75 x 10-6 C/cm2\nii) At the drain end of the channel, VCS = VDS = 2.5 V, and we find:\nqN*(L) = -(εox/tox)(VGS -VDS -VT) = -(3.5 x 10-13/10-6) 2.5 = -8.75 x 10-7 C/cm2\nd) The drift velocity can be found by remembering that iD is the channel current and\nthat the current at any point y along the channel is the sheet charge density in the\nchannel, qN*(y), times the drift velocity of the carriers composing this charge, times\nthe width of the channel: iD = - W qN*(y) se-Drift(y). Thus: se-Drift(y) = - iD/W qN*(y)\ni) At the source end of the channel we find:\nse-Drift(0) = iD/W qN*(y) = 7.5 x 10-3/5 x 10-3 x 1.75 x 10-6 = 8.57 x 105 cm/s\nii) At the drain end of the channel we find:\nse-Drift(L) = iD/W qN*(y) = 7.5 x 10-3/5 x 10-3 x 8.75 x 10-7 = 1.71 x 106 cm/s\ne) Now the relationship between the drain current and the charge density at y = L\nmust be iD = - W qN*(L) ssat(y). We want the charge density, so we solve for that:\nqN*(L) = - iD/W ssat(y) = -10-2/5 x 10-3 x 107 = -2 x 10-7 C/cm2\nf) This is a difficult question and almost nobody got it correct. This was anticipated\nbefore the exam, but we decided to leave the question in with a precautionary note\nadded, just to see if anyone could do it. That said, the idea is to go back to the\nexpression for iD along the channel, and to integrate it from y = 0 to y = L/2, the\npoint along the channel at which we want to know vCS. Since we know iD already,\nwe can find vCS(L/2). The sequence leading to the expression sought is:\niD,sat = -W qN*(y) μe dvCS/dy = W (εox/tox)[VGS -vCS(y)-VT] μe dvCS/dy\niD,satdy = W (εox/tox)[VGS -vCS(y)-VT] μe dvCS\n∫0\ny iD,satdy = iD,sat y = ∫0\nVcs(y) W (εox/tox)[VGS -vCS -VT] μe dvCS\n\nProblem 3: Graded by Prof. Palacios\na) i)\nii)\nb)\nvIN [V]\nvOUT [V]\nvOUT = vIN - V Tn\nvIN = VT\nLinear\nSaturation\nCut-\noff\nvIN [V]\nvOUT [V]\nLinear\nSaturation\nvOUT = VGG - V Tp\nvIN [V]\nvOUT [V]\nn: Cut-off\np: Linear\nn: Saturated\np: Linear\nn: Saturated\np: Saturated\nn: LInear\np: Saturated\nc)\nThe threshold point occurs where both transistors are in saturation. The equation\nfor the curve there is:\nID-sat n = (Kn/2)(VGSn -VTn)2 = ID-sat p = (Kp/2)(VSGp -|VTp|)2\nWe know Kn = Kp, VTn = |VTp|, VSGp = VDD - VGG, and VGSn = VIN = VDD/2, so we find\nVDD/2 - VTn = VDD - VGG -|VTp| ⇒ VGG = VDD/2 = 2.5 V\nd) When both devices are in saturation at this bias point, the LEC is:\n+\n-\nvin\ngm,nvin\ngo,n\n+\n-\nvout\ngo,p\nWe find Av = -gmn/(gon+gop). There are several ways to write gm in terms of the bias\ncurrent and voltages, but the most useful here is gmn = 2IDn/(VGSn -VTn). This along\nwith gon = λnIDn and gop = λpIDp, and using IDn = IDp = ID, λn = λp = 0.1 V-1, VTn = 1 V,\nand VGSn = 2.5 V, lead us to:\nAv = -gmn/(gon+gop) = 2/[(VGSn -VTn)(λn+λp)] = 2/(1.5 x 0.2) = - 6.6\ne)\nWhen VIN = 5 V the n-channel device is on, and the p-channel device is saturated\nwith ID = Kp(VDD -VGG -|VTp|)2/2. The corresponding static power dissipation is\nIDVDD. Working through this we find\nPStatic (VIN = 5V) = IDVDD = [(WP/LP)μhC* (VDD -VGG -|VTp|)2/2] x VDD\nox\n= (25 x 200 x 6 x 10-7 x 1.52) x 5/2 = 16.8 x 10-3 W = 16.8 mW\nYou did not have to include channel length modulation in this sub-section, but if\nyou did you had an additional term [1 + λ(VDS -VDS,sat)] = 1 + 0.1(5 - 1.5) = 1.35\nmultiplying the current, and found:\nPStatic (VIN = 5V) = 16.8 x 1.35 = 22.7 mW\nf)\nWhen VIN = 5 V the n-channel device is off, and the only static power dissipation is\ndue to the sub-threshold current, ID,s-t, and is ID,s-tVDD. This is probably negligible,\nbut just to be sure, we start by calculating the sub-threshold current when vGS = 0:\n\niD,s-t = [(WN/LN)μeC* ] (kT/q)2 (n - 1) exp(-qVT/nkT)\nox\n= (10 x 5 x 102 x 6 x 10-7) (2.5 x 10-2)2 (1.5 - 1) exp[-1/(1.5 x 0.025)]\n≈ 9.3 x 10-7 e-27 A ≈ 9.3 x 10-7 x 1.6 x 10-12 ≈ 1.5 x 10-18\nFrom this we have PStatic (VIN = 0V) = 1.5 x 10-18 x 5 ≈ 10-17 W ≈ 0.\ng)\nThe low to high transition time is due to charging through the p-channel device\nwith its saturation current, ID = Kp(VDD -VGG -|VTp|)2/2 [= 3.36 mA from Part (e)], so\nwe have:\nτLo-Hi = CL VDD/[Kp(VDD -VGG -|VTp|)2/2] = 10-13 x 5/(3.36 x 10-3) = 1.48 x 10-10 s\nExam Statistics\nAverage/Standard deviation:\nProblem 1\nProblem 2\n26.6\n21.7\n6.9\n6.6\nProblem 3\n22.0\n6.9\nTotal\n70.3\n16.6\nClass median: 73\nDistribution to nearest 5:\nFind your face in this picture\nTotal Score\n-σ\nAve Median\n+σ\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Exam",
      "title": "Exam No. 2 - Fall 2009",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/abf9880ee3596164f2cca16a9b14a6c6_MIT6_012F09_exam2.pdf",
      "content": "YOUR NAME\nPage 1 of 10\nDepartment of Electrical Engineering and Computer Science\nMassachusetts Institute of Technology\n6.012 Electronic Devices and Circuits\nExam No. 2\nThursday, November 5, 2009\n7:30 to 9:30 pm\nNotes:\n1. An effort has been made to make the various parts of these problems independent of\neach other so if you have difficulty with one item go on, and come back later.\n2. Some questions ask for an explanation of your answer. No credit will be given for\nanswers lacking this explanation.\n3. Unless otherwise indicated, you should assume room temperature and that kT/q is\n0.025 V. You should also approximate [(kT/q) ln 10] as 0.06 V.\n4. Closed book; one sheet (2 pages) of notes permitted. Formula sheet provided.\n5. The best way to receive partial credit is to show your work. All of your answers and\nany relevant work must appear on these pages. Any additional paper you hand in\nwill not be graded.\n6. Make reasonable approximations and assumptions. State and justify any such as\nsumptions and approximations you do make.\n7. Be careful to include the correct units with your answers when appropriate.\n8. Be certain that you have all ten (10) pages of this exam booklet and the six (6) page\nformula sheet, and make certain that you write your name at the top of this page in\nthe space provided.\n6.012 Staff Use Only\nPROBLEM 1\n(out of a possible 32)\nPROBLEM 2\n(out of a possible 34)\nPROBLEM 3\n(out of a possible 34)\nTOTAL\n\nVCE:\nVBE:\nPage 2 of 10\nProblem 1 - (32 points)\nThis problem contains 3 independent short problems that can be worked in any order.\na) [8 pts] Consider an n-channel MOSFET with a channel length, L = 0.2 μm; width, W\n= of 5.0 μm; electron mobility, μe = 600 cm2/V-s; and gate oxide capacitance, C*\n=\nox\n10-8 F/cm2. The flatband voltage, VFB = - 0.2 V, and the threshold voltage, VT = +0.5\nV. The bias voltages are VBS = VDS = 0 V.\ni) The MOSFET is initially biased at flatband, and then at t = 0, vGS is changed from\nVFB to VFB - 1 V. After any transient, what is the total amount of any additional\nmobile charge at the oxide-semiconductor interface, and is it holes or electrons?\nElectrons _____ Holes _____ Total amount of charge:\nCoul\nii) Where do the additional carriers in Part (a-i) come from?\niii) The MOSFET is initially biased at threshold, and then at t = 0, vGS is changed\nfrom VT to VT + 1 V. After any transient, what is the total amount of any additional\nmobile charge at the oxide-semiconductor interface, and is it holes or electrons?\nElectrons _____ Holes _____ Total amount of charge:\nCoul\niv) Where do the additional carriers in Part (a-iii) come from?\nb) [10 pts] Consider operating the enhance\nment-mode n-channel MOSFET shown to\nthe right as a lateral npn bipolar transistor.\nLeave the gate disconnected and focus on\nterminals B, S, and D.\ni) Label the terminals B, S, and D in the\nfigure with their corresponding BJT roles\n(E, emitter; B, base; and C, collector), and\nspecify the approximate voltage levels\nand polarities needed to bias the BJT in\nthe forward active region.\nProblem 1 continues on the next page\n\nids =\nPage 3 of 10\nProblem 1 continued\nii) If you measured the forward current gain, βf, of this BJT, you would find that it is\nsmall, perhaps even less than 1, and if you measured the Early voltage, VA, you\nwould find it is relatively low. Explain each of these observations:\nThe forward current gain, βf, is small because\nThe Early voltage, VA, is low because\niii) Fabricating a lateral BJT with an underly\ning p+ layer as shown to the right improves\none of the two parameters identified in Part\n(b-ii), but has little impact on the other.\nWhich is parameter is improved and why?\nbecause\nc) [14 pts] Graphene, a single atomic layer of carbon atoms, can be n- or p-type and its\nhole and electron mobilities are both 100,000 cm2/V-s. Such excellent mobilities\nhave led people to study using graphene-based FETs in high performance digital\nand/or analog electronics. The characteristics of one such FET are given by the ex\npressions:\ni) Calculate an expression for the small-signal drain-to-source current, ids, in a gra\nphene transistor, as a linear function of the small-signal gate-to-source voltage and\ndrain-to-source voltages, vgs and vds, respectively, valid about the bias point, VGS,\nVDS.\niG(vGS,vDS) = 0,\niD(vGS,vDS) = W\nL μ Cox\n* vGS + \"\n[\n]vDS for vGS # 0, vDS # 0\nwhere W and L are the gate width and length, respectively, μ is the carrier mobility,\nC*\nox is the oxide capacitance per unit area, and α accounts for the current at vGS = 0 V.\nProblem 1 continues on the next page\n\nPage 4 of 10\nProblem 1 continued\nii) In the space provided below, draw a small signal linear equivalent circuit for the\ngraphene transistor for a bias point (VGS, VDS), and give expressions for each of the\nelements in the circuit in terms of device and bias parameters.\niii) The output characteristics of graphene transistors recently fabricated at MIT can\nbe fit by the expression:\niD = 1 x 10-7 (10 vGS + 1) vDS\nWhere the voltages are in measured in Volts, and the current is Amps. Consider\nusing this device in the amplifier illustrated below with VDD = 3 V and with the\ngate biased at 1 V. Select RL to give a DC output voltage of 1.5 V, and calculate the\nsmall signal voltage gain, vout/vin. at this bias point.\nVDD (= 3 V)\nvOUT\nvIN = 1V + v in\nRL\nG\nS\nD\nRL =\nOhms\n=\nAv = vout/vin\nEnd of Problem 1\n\nVFB =\nPage 5 of 10\nProblem 2 - (34 points)\nAlice is a process engineer experimenting with a new high-permittivity dielectric\nmaterial with a dielectric constant, εhi, that is 5 times as large as the dielectric constant of\nSiO2.: εhi = 5 εox She chooses to test the material by fabricating p-MOS capacitors on n-\ntype silicon, and to use a metal for the gate and contact for which φm = - 0.5 φn. Her\nstructure is illustrated below; it also includes an adjacent p+ region shorted to the sub\nstrate (not shown in the figure) to supply holes when an inversion layer is formed.\nOhmic\nContact\nn-type Si\nND\n-thi\nL\nx\nB\nG\n!hi\nHigh Permittivity Dielectric\nGate Metal\nWarning: This is a p-MOS problem (i.e. p-channel); n-MOS answers will not be accepted.\na) [6 pts] On the axes provided, plot the electrostatic potential, φ(x), through the device\nfrom G to B (i.e. starting in the gate metal and going into the ohmic contact metal) in\nflatband when vGB = VFB. Label all relevant features on your plot, including values\nfor φ(0), depletion region width, and potential drop across the oxide. Finally, derive\nan expression for the flatband voltage, VFB.\n!(x)\n-thi\nL\nx\nProblem 2 continues on the next page\n\nn(x = 0+) =\np(x = 0+) =\nVT =\nPage 6 of 10\nProblem 2 continued\nb) [4 pts] At flatband, i.e. with vGB = VFB, what are the electron and hole concentrations,\nn(x = 0+) and p(x = 0+), at the silicon-dielectric interface?\nc) [8 pts] On the axes provided, plot the electrostatic potential, φ(x), and the charge dis\ntribution, ρ(x), through the device from G to B at the onset of inversion, i.e. when vGB\n= VT. Label all relevant features on your plots, including values for φ(0), depletion\nregion width, and potential drop across the oxide. Finally, derive an expression for\nthe threshold voltage, VT.\n!(x)\n-thi\nL\nx\n!(x)\n-thi\nL\nx\nProblem 2 continues on the next page\n\nn(x = 0+) =\np(x = 0+) =\nFlatband voltage, ΔVFB:\nThreshold voltage, ΔVT:\nCG(w. SiO2)/CG(w.o. SiO2) =\nPage 7 of 10\nProblem 2 continued\nd) [4 pts] At the onset of inversion, i.e., when vGB = VT,what are the electron and hole\nconcentrations, n(x = 0+) and p(x = 0+), at the silicon-dielectric interface?\ne) [8 pts] A practical problem with depositing a dielectric other than SiO2 directly on\nsilicon is that new energy states and/or fixed sheet charge are introduced at the in\nterface. Imagine that the latter occurs, and that there is a fixed positive sheet charge\ndensity, σi, at the interface. Assuming that this charge can be modeled as an impulse\nof charge of intensity σi at x = 0, i.e. ρ(x) = σi δ(x), calculate the changes in the flat-\nband voltage, VFB, and in the threshold voltage, VT, resulting from the presence of\nthis charge.\nf) [4 pts] To eliminate the interface charge, a very\nthin layer of silicon dioxide, SiO2, can be grown\non the silicon before the high permittivity di\nelectric is deposited, as illustrated to the right.\nHow much is the gate dielectric capacitance,\nCG, changed relative to its original value in Part\n(a) by the addition this SiO2 layer if tox = 0.2 tHi?\nEnd of Problem 2\n\nPage 8 of 10\nProblem 3 - (34 points)\nThis problem studies the performance of state-of-the-art MOSFET transistors in digi\ntal electronics. In modern CMOS technology, the physical parameters of transistors with\nminimum dimensions are as follow:\nGate oxide thickness, tox: 1.0 nm (10-7 cm)\nOxide dielectric constant, εox: 3.5 x 10-13 F/cm\nGate length, Lmin: 35 nm\nGate width, Wmin: 135 nm\nSupply voltage, VDD: 1.0 V\nThreshold voltage: VT,n = -VT,p = 0.4 V\nElectron mobility, μe: 500 cm2/Vs\nHole mobility, μh: 200 cm2/Vs\nSub-threshold current when |VGS| = 0: 15 nA (n-channel and p-channel)\nEarly effect: λn = λp = 10-3 V-1\nAlpha factor, α: ≈ 1\na) [5 pts] Calculate the drain current in saturation, ID,sat, of a minimum size n-MOS\ntransistor in this technology when VGS = VDS = VDD = 1.0 V. Use the general expres\nsion we derived using the gradual channel approximation model in strong inversion\nand assume α = 1 and that the low-field mobility model is valid.\nID,sat(VGS = VDS = 1.0 V) =\nA\nb) [5 pts] Calculate the value of the output resistance, ro, in the small signal linear\nequivalent circuit of the n-MOS transistor in saturation with VGS = 1.0 V. [If you\ncould not do Part a use a drain current of 1 mA (this is not the right answer for Part\na).]\nro =\nOhms\nProblem 3 continues on the next page\n\nProblem 3 continued\nThe CMOS NAND gate shown to the right is\nfabricated using the new technology.\nc) [4 pts] Fill in the truth table below for this\ngate. Ignore the sub-threshold drain current\nwhen the FETs are off.\nVIN1\n0 V\n0 V\n1 V\n1 V\nVIN2\n0 V\n1 V\n0 V\n1 V\nVOUT\nV\nV\nV\nV\nPage 9 of 10\nVDD (= 1 V)\nvOUT\nvIN1\nvIN2\nd) [4 pts] In a simple CMOS inverter both transistors are minimum gate length de\nvices, Ln = Lp = Lmin, and the widths are scaled so that Kn = Kp, with the narrowest\ngate being made Wmin. What should Wn and Wp be in a simple inverter made with\nthis process (i.e., as described at the start of this problem statement)?\nmultiples do not have to be integer.\nNote: The\nWn,Inverter =\nWmin\nWp,Inverter =\nWmin\ne) [4 pts] To size the FETs in a NAND gate for minimum switching time, one must\nrecognize that two n-FETs in series with the same voltage on their gates, as in a\nNAND gate when both inputs are high, function like one FET with L = 2L n (and W =\nWn). What is the optimum size of the n-channel MOSFETs in a NAND gate fabri\ncated with the process described earlier, and what is the load seen at the input of\nsuch a NAND gate, compared to an inverter? Note: The multiples can be non-\ninteger. (The p-channel FET should be kept the same size as in a simple inverter be\ncause turning either p-FET \"on\" pulls the output high.)\nLn,NAND =\nLmin\nWn,NAND =\nWmin\nCIN,NAND =\nCIN,Inverter\nProblem 3 continues on the next page\n\nPage 10 of 10\nProblem 3 continued\nf) [4 pts] What is the static power dissipation in a microprocessor containing 2 x 109\nequivalent inverter gates? Assume that for half of the gates the output is low and\nfor half of the gates it is high.\nPStatic =\nWatts\ng) [8 pts] When the n-channel transistor in Part a) was fabricated, the actual saturation\ncurrent with VGS = VDS = 1 Volt was measured to be only 250 μA. To try to figure out\nwhat is wrong, do the following three calculations, and then give an opinion:\ni) Calculate the average electric field in the channel with VGS = VDS = 1 Volt.\nEave =\nV/cm\nii) Calculate what the average electron velocity in the channel with VGS = VDS = 1\nVolt and a drain current of 250 μA is. Assume a uniform inversion charge distri\nbution along the channel.\nsch ave (ID = 250 μA) =\ncm/s\nCalculate what the average electron velocity in the channel would be with VGS =\nVDS = 1 Volt and the drain current you calculated in Part a. Approximate the in\nversion charge distribution along the channel as being uniform. If you could not\ndo Part a use a drain current of 1 mA (this is not the right answer for Part a).\nsch,ave (ID = answer in Part a) =\ncm/s\niii) Why (in 25 words or less) do you think the measured drain current is so much\nlower than you predicted in Part a?\nEnd of Problem 3 and of Exam Two\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "CCD Nobel Prize slides",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/df03c0cc8618b09b87121b6ee9f0eddb_MIT6_012F09_lec10_ccd.pdf",
      "content": "Charge Coupled Devices (CCDs)\nNobel Prize in Physics 2009\n\"Two Revolutionary Optical Technologies\"\nCharles K. Kao - for initiating the search for\nand the development of the low-loss\noptical fiber\nWillard S. Boyle and George E. Smith - for\ninventing the charge coupled device\n\"CCDs are widely used in digital cameras and in advanced\nmedical and scientific instrumentation.\"\nNobel Committee*\n\"And they are something you can understand in 6.012.\" me\n* Lifted from\nNobel website:\nClif Fonstad, 10/15/09\nhttp://nobelprize.org/nobel_prizes/physics/laureates/2009/press.html\nCCD Subset - Slide 1\n\nW\n\nWhat if we don't have an adjacent n\nn-region?\n+\nG\nSiO2\nvGB\nT\nThe two-\n-terminal\nn-MOS c\ncapacitor\np-Si\nRight: Basic device\nB\n-\nFor v\nvGB �\n� VT\nT T nothing is different, but when v\nvGB >\n> VT,\n, where\ndo the electrons for the inversion layer come from?\n+\nG\nT\nThey diffuse to the edge of the\nvGB > VT\nd\ndepletion region from the bulk.\nThis is like reverse bias diode\ns\nsaturation current and it takes\na long time to build up the\ni\ninversion layer charge.\nno = ni2/NA\n-\nClif Fonstad, 10/15/09\nB\nCCD Subset - Slide 2\n\nh\nh\n\nh\n\nh\n\nThe M\nMOS light detector\nW\n\nWhat if we shine light on our biased MOS capacitor?\n+\nG\nvGB > VT\nh\nh\nh\n-\nB\nE\nElectrons optically generated in and near the depletion region\nwill be populate the inversion layer. T\nThe number collected in a\nframe time (clock period) is proportional to the light intensity.\nClif Fonstad, 10/15/09\nCCD Subset - Slide 3\n\nT\nTwo adjacent MOS capacitors:\n+\nG1\n+\nG2\n> VG\nG1S > VT\nT\nT\nVG\nG2S\n-\nB\n+\nG1\n+\nG2\n> VT\nT\nT\nVG\nG1S > VG\nG2S\n-\nB\nThe charge can be p\npassed back and forth between them.\nClif Fonstad, 10/15/09\nCCD Subset - Slide 4\n\nC\nCharge-coupled devices, CCDs:\n: basically shift registers\n1 > �\n�3 >\n> 2\n2 > VT\nT T\nB\nA\nAn array of closely spaced 2-terminal MOS capacitors can\nbe used to shift data along in a serial bit stream in the\nf\nform of packets of electrons.\nClif Fonstad, 10/15/09\nCCD Subset - Slide 5\n\nCharge-coupled devices: CCD shift registers\n1 > �3 > 2 > VT T\n2 > �1 > 3 > VT T\n3 > �2 > 1 > VT\nClif Fonstad, 10/15/09\nCCD Subset - Slide 6\nB\nB\nB\n\nCCD\nre\nad-o\nut\ncir\ncuit diagram.\nCCD read-out circuitry\nThe charge is shifted along and read serially using a reverse\nbiased diode and MOS source followers.\nFigure by MIT OpenCourseWare.\nLifted from\na Kodak website: :\nhttp://www.kodak.com/global/en/business/ISS/index.jhtml?pq-path=11937\nClif Fonstad, 10/15/09\nCCD Subset - Slide 7\nCourtesy of Eastman Kodak Company. Used with permission.\n\nCCD imagers - 1-d and 2-d arrays\nA linear CCD imaging array is\nmade by placing MOS sensor\npixels next to a CCD shift\nregister, which collects their\noutputs and sends them out\nin a serial stream.\nMOS\nMOS\nMOS\nsensor\nsensor\nsensor\npixel\npixel\npixel\n←Transfer gates\nCCD shift register\nTo make a 2-d CCD imager, 1-d\nCCD imaging arrays are integra-\nted as adjacent columns that\nare coupled into a horizontal\nCCD shift register to combine\ntheir outputs into a row-by-row\nserial bit stream of the image.\n2-d array figure lifted from Nobel website:\nClif Fonstad, 10/15/09\nhttp://nobelprize.org/nobel_prizes/physics/laureates/2009/press.html\nCCD Subset - Slide 8\nSource: The Royal Swedish Academy of Sciences.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "CMOS Gate Delays",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/c5d77f1bbdd91687cf4173d3de2c6574_MIT6_012F09_lec15_cmos.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits, Fall 2009 - 10/28/09 Posting\nCMOS Gate Delays\nAssume we have a symmetrical CMOS inverter with\nVTn = |VTp| ≡ VT\nand Kn = Kp.\nAlso assume that both the n- and p-channel devices\nare minimum gate length devices, so\nLn = Lp = Lmin,\nAlso assume\nCo* xn = Co* xp ≡ Co* x.\nFinally, assume μe = 2 μh, so if we make the p-channel\ndevice twice as wide as the n-channel device, we get the\ndesired K equality; i.e.,\nWp = 2 Wn,\nyields\nKp = Wp μh Co* xp = 2 Wn μe Co* xn = Kn.\nLp\nLn\nThe gate delay of an inverter is the sum of the times it\ntakes the gate to switch from a LO to a HI output, and\nfrom a HI to a LO output. To estimate these times for a\nCMOS gate we first note that during the LO to HI cycle,\nthe load capacitance, CL, is charged from 0 V to VDD,\nwhich requires a total charge of CL VDD, through the p-\nchannel device. During much of this cycle the p-channel\nMOSFET will be in saturation with VGS = -VDD, and so the\ncurrent through it into the load will be\nIL = K\np (-VDD + VT) 2 = K\np (VDD - VT) 2\n\nAs the load charges up, and the p-channel device comes\nout of saturation, this current will decrease, but for sake of\nestimation, assume that it stays constant over the entire\ncharging cycle. The charging time will then be the total\ncharge divided by this current:\nΔQ\n2 CL VDD\nτLO-HI = I\n≈ Kp(VDD - VT)2\nDuring the HI to LO swing, this charge is discharged\nto ground though the n-channel MOSFET.\nAgain the\nMOSFET will be in saturation initially with VGS = VDD,\nand\nID = K\nn (VDD - VT) 2\nThe current will decrease once vOUT drops below (VDD\nVT) and the transistor is no longer in saturation, but we\ncan again estimate τHI-LO by assuming it stays constant.\nWe find\n2 CL VDD\nτHI-LO ≈ Kn(VDD - VT)2\nwhich is exactly the same since Kn = Kp. This symmetry is\nimportant because it gives us the shortest overall cycle\ntime, and is another reason to make the K's equal. The\ntotal gate delay is the sum of these two times\nτGD ≈\n4 CL VDD\n= 12 n Lm\nin\nVDD\nKn(VDD - VT)2\nμe\n(VDD - VT)2\nTo obtain the right-hand expression we have replaced Kn\nwith (Wn/Ln) μe Co* x, and CL with n(Wp Lp + Wn Ln) Co* x,\nwhich is in turn 3n Wn Ln Co* x. Written this way we can\nreadily see the advantage of making Lmin smaller.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "CMOS Gate Delays, Power, and Scaling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/9181057dd1fc814055e9f56f32d91cfa_MIT6_012F09_lec16_scaling.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits, Fall 2009 - 10/5/09 posting\nCMOS Gate Delays, Power, and Scaling\nGATE DELAYS\nIn the last lecture (Lec. 15) we calculated the gate de\nlay for a symmetrical CMOS inverter with\nVTn = |VTp| ≡ VT, Co* xn = Co* xp ≡ Co* x, and Kn = Kp,\nin which both the n- and p-channel devices were mini\nmum gate length devices, i.e., Ln = Lp = Lmin. The p-\nchannel device was made twice as wide as the n-channel\ndevice to get the desired K equality, because we assumed\nμe = 2 μh.\nWe found that the gate delay was given by:\n4 CL VDD\nτGD ≈ Kn(VDD - VT)2\nReplacing CL and Kn, to write this in terms of the device\ndimensions, we found after a bit of simple algebra:\n12 n\nVDD\nτGD ≈ μe Lm in (VDD - VT)2\nPOWER\nThere is zero static power in CMOS so the only con\ntribution is the dynamic power\nPave = CL VD\nD f\nwhere f is the operating frequency and CL is the loading\ncapacitance.\nThis load will be the average fan-out, n,\ntimes the input capacitance of a similar CMOS gate, plus\nany parasitic interconnect capacitance:\nCL = n Co* x (Lmin Wn + Lmin Wp) + Cparasitic\n\n= 3 n Co* x Lmin Wn + Cparasitic\nNeglecting Cparasitic, we can write\nPave = 3 n Co* x Lmin Wn VD\nD f\nMAXIMUM POWER\nThe maximum power dissipation will occur when the\ngate is operated at its maximum frequency (bit rate),\nwhich is in turn proportional to 1/τGD. Thus we can say\nPave max ∝ 3 n Co* x Lmin Wn VD D τGD\n1 Wn\n= 4 Lmin μe Co* x VDD (VDD - VT)2\n= 4 Kn VDD (VDD - VT)2\nThe importance of keeping VDD small is quite evident\nfrom this expression, but the situation is not black and\nwhite because making VDD small makes τGD large; the\nsame is true of making Kn small. The whole problem of\nwhat to reduce how while maintaining high performance\nand not frying the IC chips is a complex one and has led to\nthe development of rules for scaling dimensions and volt\nages; we will discuss scaling rules after first looking at one\nmore important parameter, the maximum average power\ndissipation per unit area.\nPOWER DISSIPATION PER UNIT AREA\nIn many situations the power dissipation per unit\narea is more important than the total power dissipation.\nTo estimate how this factor varies with the device dimen\nsions we make the assumption that the density of devices\n\nin an integrated circuit increases inversely with the gate\narea, WnLmin. We have:\nPave max\nμe Co*x\nPdensity max ∝ WnLmin ∝ 4 Lm2 in VDD (VDD - VT)2\nSCALING RULES\nWe in general want to simultaneously reduce gate de\nlays, decrease power dissipation, and increase packing\ndensity, while not exceeding a certain power density. The\nplace we start is with a reduction of the gate length, but\nwe quickly find we must do more than that or we get into\ntrouble.\nFor example, as the gate length is reduced, the oxide\nthicknesses and the junction depths (of the sources and\ndrains) must be reduced proportionally to obtain good\ntransistor characteristics. One is essentially maintaining a\nlong, thin geometry consistent with the gradual channel\napproximation, and this turns out to be just what is\nneeded to get good saturation (flat curves; small go) of the\ndevice output (iD vs vDS) characteristics. Thus, if we re\nduce the minimum gate length, Lmin, by a factor of s, we\nwill also want to reduce the gate oxide, tox, by the same\nfactor. To increase the packing density futher, we also re\nduce the gate width, W, by the same factor:\nLmin → Lmin/s\nW → W/s\ntox → tox/s\nWith these changes we find that our gate delay, average\npower, device density, and power density change as fol\nlows:\nτGD →τGD/s2\n\nPave → s Pave\nDevice Density → s2 Device Density\nPdensity max → s3 Pdensity max\nClearly this is a formula for disaster because the power\ndensity will increase dramatically if we only scale dimen\nsions. We either have to develop much better ways to get\nthe heat out of an IC chip and package, so we can tolerate\na higher power density, or we have to change more than\nthe dimensions. Packaging and heat sinking have been\nimproved, to be sure, but the big gain comes from scaling\nthe voltages as well as the dimensions. If we scale the\nsupply and threshold voltages as follows:\nVDD → VDD/s\nVT → VT/s\nthen we find:\nτGD →τGD/s\nPave → Pave/s2\nDevice Density → s2 Device Density\nPdensity max → Pdensity max\nThis is clearly a much better situation. At the same time it\nmust be noted that it is not as easy to scale the voltages as\nit might at first seem and it has taken longer to do so than\nit has to reduce dimensions because of a number of fac\ntors. The control over the threshold voltage must be im\nproved which places more demands on the process line,\nand the noise margins decrease by a factor 1/s so noise\nsources on the chip must be reduced. Also, supply volt\nages are not totally arbitrary since they must be tied to\nstandard battery cells, which come in increments of\nroughly 1 Volt (they range from 1.1 to 0.9 V over their use\n\nful lifetime). Early bipolar and MOSFET logic used VDD's\nof 5 V, but this has recently been reduced to 3, 2, and,\neven, 1 V.\nScaling examples:\nParameter\nScaling factor, s\nLmin (μm)\nwn (μm)\ntox (nm)\nVDD (V)\nVT (V)\nFan out\nK (μA/V2)\nt (ps)\nfmax (MHz)\nPave/gate (μW)\nDensity\n(kgates/cm2 @\n20 W/cm2 max)\nIntel Families\nPentium\n1.5\n0.75\n0.5\n3.3\n2.2\n-\n2,000\nSources: Professsor Jesus del Alamo and Intel\n\nIntel Pentium Families\nParameter\nPentium generations\nLmin (μm)\n1.0\n0.8\n0.5\n0.35\nScaling factor, s\n-\n1.6\n2.3\nSRAM Cell\n-\nArea (μm2)\nDie size (mm2)\nfmax (MHz)\ntox (nm)\nMetal layers\nPlanarization\nSOG\nCMP\nCMP\nCMP\nPoly type\nn\nn, p\nn, p\nn, p\nTransistors\nCMOS\nBiCMOS BiCMOS BiCMOS\nSource: Dr. Leon D. Yau, Intel, MIT VLSI Seminar, Cambridge, MA,\nOct. 8, 1996. (This table is meant to illustrate the trend; see\nthe companion posting for data from 2000.)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Comments on Photoconductive Detectors",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/5c58a51e629ef0505139e7a4cf72f2fd_MIT6_012F09_lec03_photo.pdf",
      "content": "6.012 Electronic Devices and Circuits\nComments on Photoconductive Detectors - 9/17/09 Version\nPhotoconductivity was first reported in 1873 by W. Smith [J. Soc.\nTelegraph Eng., Vol. 2 (1873) p. 31], making it one of the first properties of\nsemiconductors to be studied and exploited. At the same time, some of the\nnewest, fastest, most sophisticated, and most complex photodetectors are based\non the phenomenon of photoconductivity. The world's fasted electrical pulses\nare made using photoconductive switches fabricated in gallium arsenide with a\nvery short minority carrier lifetime. Many night vision and thermal imaging\nsystems use extrinsically-doped silicon photoconductor arrays to take infrared\npictures, and still others use quantum well infrared photodetector (QWIP)\narrays.\nThe images in the video shown in lecture were made with a camera that\ncan be viewed as being very similar functionally to the silicon vidicon that goes\ninto a home video camera, the difference being that the QWIP \"vidicons\" are\nsensitive in the infrared region of the spectrum rather than in the visible region.\nThe images shown in the video were made using a camera containing a 256 by\n256 pixel array of QWIP cells that were sensitive to \"light\" at 8 - 10 μm; it had to\nbe cooled and was operated at under 150 K (-123 C). Today's devices have pixel\narrays as large as 1024 by 1024, or more.\nOther infrared detector arrays for these applications can be made from\nsilicon doped with \"deep\" donors for which the energy required to ionize the\ndonor corresponds to that of the infrared light of interest. Unlike the column V\ndonors we discussed in class, these donors are not normally ionized at room\ntemperature; it is the incident light that ionizes them, leading to an increased\nconductivity, i.e., photoconductivity. These detectors are called extrinsically-\ndoped silicon photoconductors.\nAn interesting question to consider is how one can make a\nphotoconductor detector which gives a large signal, and yet is linear, meaning it\nstill operates under low level conditions. Low level injection means the optically\ngenerated carriers are far less numerous than the majority carriers, so it seems\nthat the change in conductivity can never be a very big fraction of the total\nconductivity. The way engineers have gotten around this problem is by looking\nfor materials in which the majority carrier mobility is much, much smaller than\nthe minority carrier mobility. Usually the two mobilities are comparable, so\nfinding such a material is not easy, unless one uses a trick. The trick is to photo-\nexcite the carriers not from lattice bonds, but instead from deep donors, as is\ndone in the extrinsic silicon photoconductors mentioned above. The ionized\ndonors correspond mathematically to the majority carriers, but they can not\nmove and thus have effectively zero mobility.\n\nReturning to the QWIP devices, they are made using layers of different\nsemiconductors whose thicknesses and compositions are chosen to create\nelectrons localized in space much like those associated with a deep donor ion\n(except that they are localized in planes, not about points in space like donor\nions).\nThey are structurally much more complex than a traditional\nphotoconductor, but in exchange for the increased complexity one gains much\nmore flexibility in designing the performance and spectral response\ncharacteristics of the devices.\nNote to students: You are not responsible for this material on problem sets and quizzes.\nIt is solely intended to be for your intellectual stimulation and enlightenment.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Inverter Analysis and Design",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/0eddab43e246fc2d62368fe37516020c_MIT6_012F09_lec14_inverter.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits - Fall 2009\nInverter Analysis and Design\nThe inverter stage is a basic building block for digital logic circuits and memory\ncells. A generic inverter stage is illustrated below on the left. It consists of two devices,\na pull-up device, which is typically either a bipolar junction transistor or an\nenhancement mode field effect transistor, and a pull-down device, which might be\nanother transistor, or a resistor, current source, diode, etc. The stage load which is\nshown in the figure represents the input resistance of the following stage, which is\ntypically a stage (or n stages) just like the original stage.\niSL(vOUT) [ = n iIN(vOUT)]\niIN(vIN)\n+\n-\nvIN\n+\n-\nvOUT\nPull\nUp\nPull\nDown\nStage\nLoad\n+ VDD\niPU(vIN, vOUT)\niPD(vIN, vOUT)\n+\n-\nvIN\n+\n-\nvOUT\nPull\nUp\nPull\nDown\nStage\nLoad\n+ VDD\n(a) A generic inverter stage\n(b) The static currents to calculate vOUT(vIN)\nAn important piece of information about an inverter stage is its static transfer\ncharacteristic, vOUT(vIN). To calculate this characteristic we sum the currents into the\noutput node of the inverter, as is illustrated above on the right. With all of these\ncurrents written as functions of vIN and vOUT, this sum yields the desired relationship:\niPU(vIN, vOUT) = iPD(vIN, vOUT) + iSL(vOUT)\nAs an example, consider the MOSFET inverter circuit shown at the top of the\nnext page with an n-channel MOSFET pull-down and a resistor pull-up. The MOSFET\nis characterized by its K-value and by its threshold voltage, VT (we will assume for\nsimplicity that α is 1). To analyze this circuit we not first that with a MOSFET pull-\ndown, the static input current is zero and if the stage output is connected to the input of\na similar stage, the static stage load current will also be zero, and the equation above is\nsimply iPU = iPD. With a resistor pull-up, the pull-up current, iPU, is (VDD - vOUT)/R\nand the pull-down current, iPD, is the MOSFET drain current. This current depends on\nthe gate-to-source voltage, vGS, which is the same as vIN, and the drain-to-source\nvoltage, vDS, which is the same as vOUT. With vIN less than VT, the pull-down current\nis zero and vOUT is VDD. As vIN increases past VT, vOUT will initially be larger than\n\n(vIN - VT), and the device will be in saturation so that iPD will be K(vIN - VT)2/2. vOUT\nis found by setting iPD equal to iPU:\niPU = iPD\n+\n-\nvIN\n+\n-\nvOUT\n+ VDD\nR\nVT, K\niIN = 0\niSL = 0\niPU = (V - vOUT)/R\niPD = 0 if (vIN - VT) < 0 < vOUT\n= K(vIN - VT)^2/2 if 0 < (vIN - VT) < vOUT\n= K(vIN - VT - vOUT/2)vOUT if 0 < vOUT < (vIN - VT)\nA MOSFET inverter with an n-channel MOSFET pull-down and resistor pull-up.\nSubstituting yields\n(VDD - vOUT)/R = K(vIN - VT)2/2\nwhich we solve for vOUT\nvOUT = VDD - RK(vIN - VT)2/2\nClearly vOUT decreases as vIN increases. When vOUT reaches vIN - VT, the pull-down\ngoes from saturation to the linear region and iPD changes to K(vIN - VT - vOUT/2)vOUT,\nand the desired relationship is found by solving the quadratic\n(VDD - vOUT)/R = K(vIN - VT - vOUT/2)vOUT\nThe resulting transfer characteristic is plotted in the course text in Figure 15.8. Curves\nfor other pull-up devices are also shown in this section of the text.\nWe can identify six features of a given inverter design which we can use to\nevaluate it and compare it to other designs. They are:\n1. The logic levels, VHI, and VLO\n2. The noise margins\n3. The switching times, τHI→LO, and τLO→HI\n4. The power dissipation\n5. The fan-out and fan-in sensitivities\n6. The manufacturability\n\nThe logic levels are found by insisting that VHI and VLO are such that VHI\napplied to the input of an inverter results in an output of VLO, and that VLO applied to\nthe input of an inverter results in an output of VHI. Mathematically, if the transfer\ncharacteristic is vOUT = f(vIN), we must find the solutions to the equation vOUT =\nf(f(vOUT)). For useful inverter stages there will be three solutions to this equation, but\nonly the largest and smallest values are valid; the middle solution is unstable and will\nnot be realized in practice. VHI and VLO are often most easily found with the aid of the\ngraphical technique shown in Figure 15.5 of the course text.\nTo determine the switching times we must first recognize that the reason an\ninverter output does not instantaneously change in response to an change of its input is\nbecause there is charge stored on the output node (on the gate of the load stage, for\nexample, if we are discussing inverters with MOSFET pull-downs as in our earlier\nexample). This is illustrated below:\n+\n-\nvIN\n+\n-\nPull\nUp\nPull\nDown\nStage\nLoad\n+ V\nqN(vOUT)\nvOUT\nThe generic inverter stage with the non-linear charge store shown explicitly.\nWhen the input is switched from VHI to VLO, the pull down device typically\nturns off (so iPD = 0), and the output switches from VLO to VHI. When this happens the\noutput node must be charged up, and this charge is supplied by the pull-up device.\nThis was illustrated on the left in the next figure. The charging current, iCH, which is\ndqN/dt, is the difference between iPU and iSL (assuming as is usually the case that iPD =\n0):\niCH ≈ iPU - iSL = dqN/dt\nThe larger this current, the faster the charge store changes, and the faster the output\nswitches. (Note that the corresponding statements can be made about the discharging\ncycle shown on the right in the figure.)\nIn general the charge stored on the output node, qN, will be a non-linear function\nof vOUT, and it will not be possible to calculate vOUT(t) and determine the switching\ntime analytically. There are two cases in which we can calculate the switching time,\n\nhowever, and to the extent that we can approximate a given situation as one or the\nother of these to cases, we can estimate the switching time analytically.\nThe first special case is when the charging (or discharging) current is constant.\nWe can calculate the change in the amount of stored charge when vOUT changes from\nVLO to VHI, and knowing this the charging time is simply this charge divided by the\niSL(vOUT) [ = n iIN(vOUT)]\n+\n-\n+\n-\nvOUT\nPull\nUp\nStage\nLoad\n+ VDD\niPU(vIN, vOUT)\niPD = 0\niIN(vIN)\nqN(vOUT)\niCH\nPull down\noff\nVLO !\nVHI\nvIN = VLO\niSL(vOUT) [ = n iIN(vOUT)]\n+\n-\n+\n-\nvOUT\nPull\nUp\nPull\nDown\nStage\nLoad\n+ VDD\niPU(vIN, vOUT)\niPD(vIN, vOUT)\niIN(vIN)\nqN(vOUT)\niDCH\nVHI !\nVLO\nvIN = VHI\n(a) Finding τLO→HI (charging cylce)\n(b) Finding τHI→LO (discharge cycle)\nvIN: VHI→VLO; vOUT: VLO →VHI\nvIN: VLO →VHI; vOUT: VHI→VLO;\niCH = iPU - iPD - iSL\niDCH = iPD - iPU + iSL\ncharging current, which we have approximated as being constant, ICH (we can say the\nsame about the discharge cycle):\nτLO→HI ≈ ΔqN/ICH, and τHI→LO ≈ - ΔqN/IDCH\n[Note: frequently designers do not require that the node be completely charged, but say\nthe node has switched when 90% of the store has been built up (in which case, of\ncourse, ΔqN is replaced by 0.9 ΔqN].\nThe second special case is if the charge store can be modeled as a linear capacitor,\nCL (i.e., qN ≈ CLvOUT). Then we can write\ndvOUT/dt = iCH(vOUT)/CL\nto get a differential equation for vOUT(t). We should be able to solve this equation\nnumerically, if we can not do so analytically.\nIf the charge store can be modeled as a linear capacitor and the charging and\ndischargind currents can be modeled as constant, then\nτLO→HI ≈ CL(VHI - VLO)/ICH, and τHI→LO ≈ CL(VHI - VLO)/IDCH\n\nWe have already included the transient when the input is switched from VLO to\nVHI in our discussion, but just to make sure this is clear, in this part of the cycle, the pull\ndown device turns on and the output switches from VHI to VLO. The most important\ndifference is that the charge store now discharges and does so through the pull-down\ndevice. The pull-down device must conduct this discharge current and the current\nflowing through the pull-up device (less that into the stage load). In this case, a large\npull-up device current is not desirable because it makes this switching time long,\nwhereas a large pull-up current makes the other switching time short.\nIn practice one usually wants to minimize the sum of these two switching times\nwhich means that we in general want to design the circuit to have equal magnitude\ncharging and discharging currents, if possible.\nAn example to the switching transient situation in the MOSFET inverter with a\nresistive pull-up that we illustrated earlier is shown in the figures below. The gate\ncapacitance of the loading stage(s) has been modeled as a linear capacitor. The charging\nof the store clearly occurs with an RC time constant exponential; the discharging\ntransient is more complex (and typically is much the shorter of the two).\n+\n-\n+\n-\nvOUT\n+ V\nR\nVT, K\niDCH = iPD - iPU\niPU = (V - vOUT)/R\nvIN = VHI\niPD\nCL\nVHI !VLO\n+\n-\nvIN = VLO\n+\n-\nvOUT\n+ V\nR\niCH = iPU\niPU = (V - vOUT)/R\nOFF\nCL\nVLO !VHI\n(a) Finding τLO→HI (charging cylce)\n(b) Finding τHI→LO (discharge cycle)\nvIN: VHI→VLO; vOUT: VLO →VHI\nvIN: VLO →VHI; vOUT: VHI→VLO;\niCH = iPU\niDCH = iPD - iPU\nThe power dissipation consists of two components. One is the static power; the\nother is the dynamic, or switching, power. Then the ouput is high, the static power\ndissipated is VDDIPU(output high); when the output is low, the static power dissipated\nis VDDIPU(output low). To get one number to work with we commonly say an average\ninverter will have its output high half the time, on average, and low the other half.\nThus the average static power dissipation is (VDDIPU(output high) + VDDIPU(output\nlow))/2.\n\nThe dynamic power dissipation is due the fact that each low-high-low cycle the\noutput node is charged to roughly VDD, and then discharged to roughly zero volts. If\nwe can approximate the node charge store with a linear capacitor, CL, the energy\ndissipated in charging it to VDD is CLVDD2/2, and the amount of energy stored on the\nnode is also CLVDD2/2. This later amount of energy is dissipated when the node is\ndischarged so in one cycle the total energy dissipated is CLVDD2.\nIf the gate is\noperating at a frequency of f, the average dynamic power dissipation is f times this or f\nCLVDD2.\nYou can refer to the course text for discussions of noise margins, fan in and fan\nout, and manufacturability.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Inverter Switching Transient Analysis",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/9316abd63cab09e54a7ace6606466725_MIT6_012F09_lec14_delays.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits - Fall 2009\n**********\nInverter Switching Transient Analysis\n+\n-\nvIN\n+\n-\nPull\nUp\nPull\nDown\nStage\nLoad\n+ V\nqN(vOUT)\nvOUT\n(a)\niSL(vOUT) [ = n iIN(vOUT)]\n+\n-\n+\n-\nvOUT\nPull\nUp\nStage\nLoad\n+ VDD\niPU(vIN, vOUT)\niPD = 0\niIN(vIN)\nqN(vOUT)\niCH\nPull down\noff\nVLO !\nVHI\nvIN = VLO\niSL(vOUT) [ = n iIN(vOUT)]\n+\n-\n+\n-\nvOUT\nPull\nUp\nPull\nDown\nStage\nLoad\n+ VDD\niPU(vIN, vOUT)\niPD(vIN, vOUT)\niIN(vIN)\nqN(vOUT)\niDCH\nVHI !\nVLO\nvIN = VHI\n(b)\n(c)\nThe generic inverter stage (a) with the non-linear charge store shown explicitly.\nThe charging cycle (b), and the discharging cycle (c).\nThe charge store will in general be a non-linear function of the output voltage; so\ntoo are the currents. Thus the differential equations we must solve are\nCharging:\ndqN(vOUT)/dt = iCH(vOUT),\nand\nDischarging:\ndqN(vOUT)/dt = iDCH(vOUT).\n\nThese are in general very complicated and difficult to solve by any means. If, however,\nthe charge store can be modeled as a linear capacitor, CL (i.e., qN ≈ CLvOUT), as\nillustrated below, then we can write,\nCharging:\ndvOUT/dt = iCH(vOUT)/CL\nand\nDischarging:\ndvOUT/dt = iDCH(vOUT)/CL\nThese are now differential equations for vOUT(t) that we should at least be able to solve\nnumerically, if we can not do so analytically. They also show us the value of knowing\nthe size and shape of iCH and iDCH. (See Figure 6.14 in the course text, and the\ndiscussion accompanying it, for more on this topic).\n+\n-\n+\n-\nvOUT\n+ V\nVT, K\niDCH = iPD - iPU\nvIN = VHI\niPD\nCL\nVHI !VLO\n+\n-\nvIN = VLO\n+\n-\nvOUT\n+ V\niCH = iPU\nOFF\nCL\nVLO !VHI\nPull\nUp\niPU(vIN, vOUT)\nPull\nUp\niPU(vIN, vOUT)\n(a)\n(b)\nCharging (a) and discharging (b) cycles with a linear load capacitor and zero\nstatic load current. Note that for MOS inverters the static current into the\nstage load, iSL(vOUT), is zero.\nFinally, if the charge store can be modeled as a linear capacitor and the charging\nand discharging currents can also be approximated as being constant, then\nτLO→HI ≈ CL(VHI - VLO)/ICH,\nand\nτHI→LO ≈ CL(VHI - VLO)/IDCH\nWe will find that we can use such an approximation to advantage when we are\nanalyzing CMOS inverters.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MOSFET Drain Current Modeling",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/d73e9baf5e8da993b7956eab4adcf04a_MIT6_012F09_lec11_drain.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits\nFall 2009\nMOSFET Drain Current Modeling\nIn the Gradual Channel Model for the MOSFET we write the drain\ncurrent, iD, as the product of qN* (y) , the inversion layer sheet charge density at\nposition y along the channel; sy(y), the net drift velocity of the inversion layer\ncarriers there (electrons in the n-channel device we are modeling), and W, the\nchannel width:\niD = - qN* (y) sy(y) W\nwith\nεox\ndvCS(y)\nqN* (y) = -\n[vGB - VT(y)]\nand\nsy(y) = - μe Ey = μe\ndy\ntox\nSubstituting these expressions yields:\ndvCS(y)\niD = W μ Cox\n* [vGB - VT(y)]\ndy\nwhere we have identified the gate capacitance per unit area, Cox\n* , as εox/tox and\nwhere the threshold voltage is given by\nVT(y) = VFB + |2φp| +vCB(y) + 1\n2εSi qNA [|2φp| + vCB(y)\nCox\n*\nDefining the body factor, γ, as 2εSi qNA /Cox\n* , and writing vCB(y) as vCS(y)\nvBS, we can rewrite this as\nVT(y) = VFB + |2φp| +vCS(y) - vBS + γ |2φp| + vCS(y) - vBS\nand thus we can write iD as\ndvCS(y)\niD = W μe C * [vGS -VFB - |2φp|- vCS(y) - γ |2φp| + vCS(y) - vBS ]\ndy\nox\nTo proceed we integrate both sides for y = 0 to y = L, recognizing that the\nright-hand integral is equivalent to integrating with respect to vCS(y) from 0 to\nvDS:\n\nL\nvDS\niD⌡⌠ dy = W μe C * ⌠⌡[vGS - VFB - |2φp|- vCS - γ |2φp| + vCS - vBS ] dvCS\nox\nThe left-hand integral is iDL, so we can write iD as\nvDS\niD = K ⌡⌠ [vGS -VFB - |2φp|- vCS - γ |2φp| + vCS - vBS ] dvCS\nwhere K is defined as (W/L) μe Cox\n* .\nIt is not hard to do the integral on the right-hand side of this equation, and\nyou may want to do it as an exercise (it is done in the text and the result is given\nin Equation 10.9). The resulting expression is awkward and, most importantly,\nthe threshold voltage, VT, is hard to identify in the expression and the role it\nplays in the current-voltage relationship is hard to understand; the result is not\nvery intuitive. It will not be obvious to you until you get much more experience\nwith MOSFETs, but it is very desirable from a modeling standpoint to do\nsomething to simplify the result and to get an expression that gives us more\nuseful insight.\nMany texts simply ignore the vCS factor under the radical and write\nvDS\niD ≈ K ⌡⌠ [vGS -VFB - |2φp|- vCS - γ |2φp|- vBS ] dvCS\nwhich we can simplify as\nvDS\niD = K ⌠⌡[vGS - VT' - vCS ] dvCS\nwith VT' defined to be VFB + |2φp| + γ |2φp| - vBS . Doing the integral we\nget\nvDS2\niD = K [(vGS - VT')vDS -\n]\nA more satisfying approach is to not ignor the vCS factor, but rather to try\nto linearize the dependance on it. The troublesome term is\n|2φp| + vCS(y) - vBS\nwhich can be written as\n\nvCS\n|2φp| + vCS - vBS\n=\n1 + |2φp| - vBS\n|2φp| - vBS\n≈\n|2φp| - vBS [1 +\nvCS\n2(|2φp| - vBS) ]\nvCS\n|2φp| - vBS\n+ 2 |2φp| - vBS\n≈\nWith this approximation, we next define 1/2 |2φp| - vBS\nto be δ and (1 + γδ) to\nbe α, and write iD as\nvDS\niD ≈ K ⌠⌡[vGS -VFB - |2φp|- α vCS - γ |2φp|- vBS ] dvCS\nUsing our earlier definition for VT', this becomes\nvDS\niD ≈ K ⌠⌡[vGS - VT' - α vCS ] dvCS\nand doing the integral yields\nvDS2\niD = K [(vGS - VT')vDS - α 2\n]\nIn saturation, which now occurs for vDS > (vGS - VT')/α, we have\niD = 2\nK\nα (vGS - VT') 2\nThese results are the same as those we obtained after ignoring vCS under\nthe radical, except that we now have a factor of α appearing. To the extent that α\nis very near one, our earlier approximation is correct, inspite of it being rather\nadhoc. Collecting all the factors in α, we find it is\nα = 1 + 2 Cox\n*\n2εSi qNA\n|2φp| - vBS\n\nTypically this is near 1, and it can be approximated as such. On the other hand,\nit is easy to leave α in the expression for iD since is such a minor complication.\nTo summarize, our expressions for the drain current, when we retain α are\niD = 0\nfor (vGS - VT')/α < 0 < vDS\n(Cutoff)\niD = 2\nK\nα (vGS - VT') 2\nfor 0 < (vGS - VT')/α < vDS\n(Saturation)\nvDS2\niD = K [(vGS - VT')vDS - α 2\n] for 0 < vDS < (vGS - VT')/α\n(Linear region)\nwith K, VT', γ, and α defined as\nK ≡ (W/L) μe Cox\n*\nVT' ≡ VFB + |2φp| + γ |2φp| - vBS\n2εSi qNA\nγ ≡\nCox\n*\nα ≡ 1 + 2 Cox\n*\n2εSi qNA\n|2φp| - vBS\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "MOSFETs in the Sub-threshold Region (i.e. a bit below VT)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/d1575750e6746e5bccb23f27b5908322_MIT6_012F09_lec12_sub.pdf",
      "content": "MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nClifton Fonstad, 10/28/09\nIn the depletion approximation for n-channel MOS structures we have neglected the electrons\nbeneath the gate electrode when the gate voltage is less than the threshold voltage, VT. We said\nthat it is only when the gate voltage is above threshold that they are significant, and that they are\nthen the dominant negative charge under the gate. Furthermore, we say that above threshold all\nof the gate voltage in excess of VT induces electrons in the channel; thus our model is that the\nsheet charge density under the gate, qN\n*, is\nqN\n\" =\nfor vGC # VT\n$ox\ntox\nvGC %VT\n(\n)\nfor VT # vGC\n&\n' (\n) (\n(1)\nAs MOS integrated circuit technology has evolved to exploit smaller and smaller device\nstructures, it has become increasingly important in recent years to look more closely at the\nminority carriers present under the gate when the gate voltage is less than threshold, i.e. in what\nis called the \"sub-threshold\" region. These carriers cannot be totally neglected, and play an\nimportant role in device and circuit performance. At first they were viewed primarily as a\nproblem, causing undesirable \"leakage\" currents and limiting circuit performance. Now it is\nrecognized that they also enable a very useful mode of MOSFET operation, and that the sub\nthreshold region of operation is as important as the traditional cut-off, linear, and saturations\nregions of operation.\nTo begin our study of the sub-threshold region, we will first quickly review the electrostatics\nof the MOS capacitor, and the electrostatic potential profile predicted by the depletion\napproximation model. Then we will use this result to derive a more accurate expression than that\nin Equation 1 for qN\n* below threshold, and use the resulting expression to, among other things,\nassess the assumption that the contribution of the mobile electrons underneath the gate to the net\ncharge density in the depletion region is negligible compared to the contribution from the ionized\nacceptors. Finally we will look at the current-voltage characteristic of a MOSFET operating in\nthe sub-threshold region, and merge it with our earlier model so that we then have a model in\nwhich the mobile electron charge is taken into account and the drain current is no longer\nidentically zero when vGS is less than VT.\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nThe Electrostatics of the MOS Capacitor with vBC = 0\nConsider the MOS capacitor with vBC = 0 illustrated in Figure 1, the same structure we used\nwhen we first looked at the MOS capacitor using the depletion approximation. In the depletion\np-Si\nn+\nB\nC\nG\nSiO2\n+\n-\nvGC\n(= vGB)\nFIGURE 1\nA MOS capacitor connected as a two-terminal capacitor with vGC = vGB = 0.\napproximation, we assume that Equation 1 holds and that the net charge density profile, ρ(x),\nunder the gate for VFB < vGC < VT can be approximated as:\n\"(x) = qNA\nfor 0 # x # xD\nfor xD # x\n$\n%\n&\n(2)\nWith this assumption, we found that the electrostatic potential profile is:\n\"(x) = \"p + qNA x # xD\n(\n)\n2$Si\nfor 0 % x % xD\n\"p\nfor xD % x\n&\n' (\n) (\n(3)\nThis expression is plotted in Figure 2, which also continues the plot through the oxide to the\ngate, from which we can also get the expression relating the depletion region width, xD, to vGB\nand VFB:\nvGB \" VFB = qNAxDtox\n#ox\n+ qNAxD\n2#Si\n(4)\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nFIGURE 2\nA sketch of φ(x) from the metal on the left, through the oxide, and into the p-type\nsemiconductor in an n-channel MOS capacitor for an applied gate bias, vGB, in the weak-\ninversion, sub-threshold region.\nEquation 4 is useful because it can be solved explicitly for xD, and the result can be used to\nobtain an expression for φ(x) as a function of vGB. However, it will turn out that what is most\nimportant to us is φ(0), the value of the potential at the interface, and φ(0) is much easier to relate\nto vGB than is φ(x) at an arbitrary x. To do so we first find xD in terms of\nφ(0): xD =\n2\"Si #(0) $ #p\n[\n]\nqNA\n(5)\nUsing this in Equation 4 gives us an equation relating φ(0) and vGB that will be useful to us\nshortly:\nvGB \" VFB = tox\n#ox\n2#SiqNA $(0) - $p\n[\n] + $(0) - $p\n[\n] (6)\nSub-threshold Electron Sheet Charge Density, vGC = 0\nReturning to our original goal, which was to find the electron population density, n(x), under\nthe gate, and then the electron sheet charge density, qN\n*, we note that the Boltzman relationship\nbetween the electrostatic potential and carrier population holds under the gate of the MOS\ncapacitor in Figure 1 because the current in the x-direction is zero. Thus we have:\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nn(x,vGB) = nie\n\" x,vGB\n(\n) \"t (7a)\n= ni\nNA\ne\n\" x,vGB\n(\n)#\" p\n[\n] \"t (7b)\np(x,vGB) = nie\n#\" x,vGB\n(\n) \"t (8a)\n= NAe\n# \" x,vGB\n(\n)#\" p\n[\n] \"t (8b)\nIn these equations we use φt for the thermal voltage, kT/q, and we have indicated the dependency\non vGB to emphasize that these populations depend on the gate voltage as well as on position, x.\nTo obtain the Equations 7b and 8b, we have used po = NA = ni exp(-φp/φt) to get expressions\nexplicitly including the quantity [φ(x,vGB) - φp], which also appears in Eqs. 5 and 6. Note: In\nmany texts, [φ(0,vGB) - φp] is identified as VB(vGB), the voltage drop between the silicon bulk and\nthe oxide-silicon interface, i.e. VB(vGB) ≡ [φ(0,vGB) - φp].\nWe can calculate the electron sheet charge density, qN\n*, by multiplying n(x) by -q and\nintegrating with respect to x from the interface, x = 0, into the silicon until x = xi, where xi is\ndefined as the depth at which φ(x) = 0, and thus where we have n(xi) = p(xi) = ni:\nqN\n\" vGB\n(\n) =\n#qn(x,vGB)dx\nxi vGB\n(\n)\n$\n(9a)\n= #qni\ne\n% x,vGB\n(\n) %t dx\nxi vGB\n(\n)\n$\n(9b)\n= #qni\nNA\ne\n% x,vGB\n(\n)#% p\n[\n] %t dx\nxi vGB\n(\n)\n$\n(9c)\nThe end-point x = xi is used for the integration because for x > xi, p(x) > n(x) and the material is\nstill p-type, while for x < xi, n(x) > p(x) and the material net n-type and is said to be \"weakly\ninverted.\"\nThis is actually a minor point, however, and not worth fretting about, because n(x)\nfalls off very rapidly with increasing x, and the main contributions to the integral come from the\nregion near the interface (i.e. small x) where φ(x) is near φ(0). The integral itself will be\nsignificant only when φ(0) approaches -φp, which further reduces the importance of the tail, and\nhow far from the interface one integrates.\nThe next step in calculating qN\n* would seem to be to replace φ(x) in Eq. 9c with an explicit\nfunction of x so we can do the integral. We can do this using Eq. 3, and we find\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nqN\n\" vGB\n(\n) = # qni\nNA\ne\nqNA x-x D vGB\n(\n)\n[\n]\n2 2$ Si %t dx\nxi vGB\n(\n)\n&\n(10)\nThis integral is clearly difficult to evaluate, however, without resorting to numerical techniques,\na less than optimum situation. An alternative approach is to make use of our earlier observation\nthat the main contribution to the integral occurs near x = 0, and to further note that near x = 0 the\npotential variation with x is nearly linear. A bit of algebra gives us\n\" x,vGB\n(\n) = \" 0,vGB\n(\n) # qNA\n2$Si\n2xD vGB\n(\n) # x\n[\n]% x (11a)\n& \" 0,vGB\n(\n) # qNAxD vGB\n(\n)\n$Si\n% x (11b)\n& \" 0,vGB\n(\n) #\n2qNA \" 0,vGB\n(\n) # \"p\n[\n]\n$Si\n% x (11c)\nUsing this approximation in the Eq. 9c yields an analytical expression which does not obscure\nthe dependences on material properties\nqN\n\" #( ) $ % q ni\n2#t\nNA\n&Si\n2qNA # 0,vGB\n(\n) % #p\n[\n]\ne\n# 0,vGB\n(\n)%# p\n[\n] #t for # 0,vGB\n(\n) ' %#p i.e vGB ' VT (12)\nNote that in the range validity, φ(0,vGB) ≤ -φp, corresponds to gate voltages such that vGB ≤ VT.\nTo see if the sub-threshold charge is large or small relative to the channel charge which\ndevelops above threshold [i.e., qN\n*(vGB) = Cox\n*(vGB-VT)], one can evaluate Eq. 12 for values of\nφ(0,vGB) near threshold, say for example (-φp - 10φt) to -φp. The corresponding values of vGB can\nbe found using Eq. 6, and then one can plot qN\n* verses vGB in the vicinity of vGB = VT; the result\nis shown in Figure 3 for a MOS capacitor with NA = 1018 cm -3 and tox = 3 nm. Note that the\nweak-inversion charge does not increase further above threshold, but instead is pinned at the\nvalue it reaches when vGB = VT. (This value is 7.2 x 10-9 Coul/cm2 for the specific values of NA\nand tox used in Figure 3).\nThe first thing to note in Figure 3 is that the range of gate voltages where the sub-threshold\ncharge is significant in this example is from about 50 mV below threshold to threshold. Note\nalso that neglecting the sub-threshold charge only leads to a 6 mV error in the threshold, VT, that\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nFIGURE 3\nThe electron sheet charge density under the gate with a gate voltage in the vicinity of\nthreshold. The blue curve corresponds to the sub-threshold weak-inversion charge [Eq.\n12], and the red curve is the strong inversion charge from traditional depletion\napproximation modeling [Eq. 1]. The sum is plotted in the yellow curve.\nwould be extrapolated from a C-V measurement; thus, taking the sub-threshold electron charge\ninto account makes only a very minor correction to the predicted value of 1.43 Volts.\nAnother way to get a feel for the relative significance, or insignificance, of the sub-threshold\nelectron charge is to compare it to the sheet charge in the depletion region at threshold, i.e.\nqNAXD = (2εSi|2φp|qNA)1/2. A quick calculation shows that this charge is 5.2 x 10-7 coul/cm2,\nwhich is about 70 times larger than qN\n*(VT).\nReturning to our expression for the charge under the gate below threshold, Eq. 12, we next\ntake the derivation one step further to express qN\n* explicitly in terms of vGB. One way to do this\nis to return to Eq. 6 and solve it for φ(0,vGB), which yields\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\n\"(0,vGB) = \"p + 2#SiqNA\n#ox tox\n(\n)\n1+\nvGB $VFB\n2#SiqNA\n#ox tox\n(\n)\n2 $1\n%\n&\n'\n'\n(\n)\n*\n*\n(13)\nPutting this into Eq. 12 clearly won't lead to an equation that gives one much insight, so it seems\nworthwhile to look into making simplifying approximations before proceeding, particularly since\nwe know from Figure 3 that the most important region is the small range of voltages below vGB =\nVT, i.e. φ(0) = -φp. Perhaps φ(0) can be modeled satisfactorily as varying linearly with VT.\nTo see if a linear approximation is realistic, it is instructive to use Eq. 12 to plot φ(0,vGB) vs\nvGB, which has been done in Figure 4. Referring to this figure, it seems clear that a linear\napproximation will be pretty good when the surface potential is much larger that the bulk\npotential, and that it is reasonable to approximate φ(0,vGB) near vGB = VT as\n\"(0,vGB) # #\"p\n(\n) $ vGB #VT\n(\n)d\"(0,vGB)\ndvGB\n\"(0,vGB )=#\" p\n(14)\nTo evaluate the derivative in this expression we first use Eq. 12 to calculate dvGB/dφ ,\nFIGURE 4\nComparing the variation of the surface potential, φ(0), with gate voltage, vGB, in flat band\non the left to the vicinity of threshold on the right. The relationship is clearly very linear in\nthe weak inversion sub-threshold region.\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\ndvGB\nd\"(0) = 1+ tox\n#ox\n#SiqNA\n2 \"(0) - \"p\n[\n]\n(15)\nThen we evaluate it at φ(0,vGB) = -φp, labeling the result \"n\":\ndvGB\nd\"(0) \"(0)=#\" p\nvGB =VT\n= 1+ 1\nCox\n$\n%SiqNA\n2 -2\"p\n[\n]\n& n (16)\nNotice that in writing this expression we have replaced εox/tox with its equivalent, Cox\n*. Inverting\nEq. 16 and using it in Eq. 14 yields the approximate linear expression we seek\n\"(0,vGB) # $\"p\n(\n) $ 1\nn VT $ vGB\n(\n) (17)\nFinally, we insert Eq. 17 into Eq. 12 getting a much more manageable and instructive\nexpression for qN\n*(vGB) than we would have gotten using Eq. 13 in Eq. 12 directly. Using Eq. 17\nwe find\nqN\n\" vGB\n(\n) # $ q ni\n2%t\nNA\n&Si\n2qNA $2%p $ VT $ vGB\n(\n) n\n[\n]\ne\n$2% p $ VT $vGB\n(\n) n\n[\n] %t for vGB ' VT (18)\nwhere VT = VFB + |2φp| + (2εSiqNA|2φp|)1/2/Cox\n* .\nEquation 18 can be simplified further by recognizing that e-2φp = (NA/ni)2 . Making this\nsubstitution yields\nqN\n\" vGB\n(\n) # $%t\nqNA&Si\n2 $2%p $ VT $ vGB\n(\n) n\n[\n]\ne\n$ VT $vGB\n(\n) n%t for vGB ' VT (19)\nStill further simplification can be achieved by (VT-vGB)/n is typically much smaller than |2φp|, so\nwe can say [-2φp - (VT-vGB)/n] ≈ -2φp. Making this approximation, we see that the square root\nterm in Eq. 19 is the same as the one in Eq. 16 defining n and that it is approximately (n-1) Cox\n*.\nConsequently, we can write qN\n*(vGB) as.\nqN\n\" vGB\n(\n) # $ n $1\n(\n)Cox\n\" %t e\n$ VT $vGB\n(\n) n%t for vGB & VT (20)\nThis result concludes our derivation of qN\n*(vGB) for two-terminal MOS capacitors.\nSummarizing our results thus far, we find that accounting for the electrons under the gate below\nthreshold has an arguably negligible impact on the electrostatics of the MOS capacitor. Its\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nprimary impact is to require a minor correction in the threshold voltage calculation. The\nsituation will be quite different in the case of the sub-threshold drain current of a MOSFET,\nwhich we will study shortly. First, however, we must extend our results to include three-terminal\nMOS capacitors, i.e., to the case where vBC = 0.\nSub-threshold Electron Sheet Charge Density in a 3-terminal MOS Capacitor, vBC = 0\nTo model the sub-threshold drain current of a MOSFET, we have to extend our model of the\nelectron population density, n(x), under the gate to include a bias between the adjacent n+ region\nand the channel, i.e. to allow for a non-zero vBC, as shown in Figure 5. To understand how this\nbias, vBC, effects the electron population under the gate, it is instructive to first think about the\nrole the n+ region played in establishing the electron population in the two-terminal MOS\ncapacitor situation we just looked at. We in fact did not even mention the n+ region during our\nderivation, but the n+ region does play a very important role because it supplies the electrons that\nare under the gate below threshold, i.e., qN\n*(vGB<VT). The n+ region is a reservoir of electrons,\nand those electrons spill out of it into the region under the gate when the electrostatic potential\nenergy barrier confining the electrons to the reservoir, -qΔφ, is lowered by a positive gate\nvoltage. The barrier is lowered most near the oxide-silicon interface, and most of the carriers\nspill across near that interface, however, at any depth that the barrier is reduced, carriers can spill\nacross. What we calculated when we found qN\n*(vGB) is the total number of electrons that can\nFIGURE 5\nA MOS capacitor connected as a bias applied between the substrate and n+ region, i.e.\nvBC = 0.\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nspill across and into the region under the gate when the voltage on the gate is vGB.\nIf the n+ region is biased positive relative to the substrate, i.e. when vBC < 0, then the\npotential energy of the carriers in the reservoir is lower than when vBC = 0 V. As a result fewer\ncarriers can spill out of the source and into the region under the gate; quantitatively, the number\nthat can spill into this region decreases exponentially with |vBC|, i.e. evBC/φt. Thus Eq. 12 becomes:\nqN\n\" vGB\n(\n) # $ q%t\n&Si\n2qNA % 0,vGB\n(\n) $ %p\n[\n]\ne\n% 0,vGB\n(\n)+vBC\n[\n] %t for % 0,vGB\n(\n) ' $%p $ vBC (21)\nand the equivalent of Eq. 20 is:\nqN\n\" vGB\n(\n) # $ n(vBC) $1\n[\n]Cox\n\" %t e\n$ VT vBC\n(\n)$vGC\n[\n] n%t for vGB & VT (vBC), vBC & 0 (22)\nThe substrate bias, vBC, does not appear explicitly in Eq. 22, but it does play an important\nrole because now both VT and n are now functions of vBC:\nn(vBC) = 1+ 1\nCox\n\"\n#SiqNA\n2 -2$p % vBC\n[\n]\n(23)\nand\nVT vBC\n(\n) = VFB + 2\"p + vBC + 1\nCox\n#\n2$SiqNA 2\"p + vBC\n(\n) (24)\nWhen vBC < 0, the depletion region is wider near threshold, so n is smaller (near to 1) and the\nthreshold voltage, VT, is larger than when vBC = 0.\nWith the derivation of Eq. 22 we are ready to find the drain current of a MOSFET biased\nbelow threshold and in weak inversion, i.e. in the sub-threshold region.\nThe MOSFET Drain Current in the Sub-threshold Region\nIn the gradual channel approximation modeling of MOSFET terminal characteristics we have\ndone thus far we have said that the drain current is identically zero when the gate voltage is less\nthan the threshold voltage, i.e. when vGS ≤ VT. As we will soon see, the population of mobile\nelectrons we have just calculated under the gate provides a mechanism for charge flow between\nthe drain and source even when vGS ≤ VT, and thus there is in fact a small, non-zero drain current\nthrough a MOSFET biased below threshold. This is significant because on an integrated circuit\nchip with millions of transistors which are supposed to be off and therefore not dissipating any\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\npower, a little current flowing through each transistor can easily add up to be a significant power\ndrain, and be a source of serious heating.\nFurthermore we will find that a MOSFET's\ncharacteristics are well defined in the sub-threshold region, and are in no way anomalous or\nparasitic. In fact, they have such interesting properties that it is highly advantageous in a large\nset of applications to design circuits that operate specifically in the sub-threshold region.\nConsider the MOSFET illustrated in Figure 6, and suppose that it is biased with a positive\ndrain voltage, i.e. vDS ≥ 0, and a negative substrate voltage, i.e. vBS ≤ 0. Suppose also that the\np-Si\nB\nG\n+\nvGS\nn+\nD\nn+\nS\n-\nvDS\nvBS\n+\niG\niB\niD\nFIGURE 6\nA cross-sectional view of an n-channel MOSFET. The sub-threshold region corresponds\nto having the device biased with vBS ≤ 0, vDS ≥ 0, and vGS near, but below threshold, VT.\ngate is biased positively and a bit less than threshold. At the source end of the gate, electrons\nwill spill into the region under the gate as we have just calculated. The same will be true at the\ndrain end of the gate, and if vDS = 0 the electron population under the gate will be uniform\nbecause the situation will be equivalent to that in a 3-terminal MOS capacitor, and the steady\nstate current will be identically zero. If vDS > 0, however, the density of electrons that can spill\nunder the gate at the drain end will be smaller than at the source end by a factor of e-vDS/φt. Rather\nthan electrons flowing under the gate from the drain, the electrons spilling into the region under\nthe gate from the source will flow all the way under the gate and into the drain n+ region when\nthey reach it. As a result there will be a net positive drain current. To calculate the size of this\ndrain current, we need to model how the electrons flow under the gate.\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nFirst, consider drift. There is a voltage difference between the source and the drain, but the\nelectric field laterally between them is small because the voltage between the back contact and\nthe source, vBS, falls across the depletion region between the n+ source and the p-type substrate,\nand the voltage between the back contact and the drain, vBD, falls across the drain-substrate\ndepletion region. There is thus negligible lateral field in the channel region below threshold to\ndrift any electrons there from source to drain.\nRecognizing that drift is negligible below threshold, we see that the mechanism behind the\nsub-threshold drain current must be diffusion driven by the electron concentration gradient going\nfrom the source to drain:\niD = \"W # De\ndqN\n*\ndy\n(25)\nSince iD is effectively uni-directional, i.e. wholly y-directed, and does not depend on L, the\nconcentration gradient must be constant and equal to the difference between the end-point\nconcentrations divided by L, giving us\niD = \"W De\nqN\n* 0( ) \" qN\n* L\n( )\nL\n(26)\nUsing Eq. 21, we see that because the barrier the electrons see at the drain is vDS larger than the\nbarrier at the source, qN\n*(y = L) and qN\n*(y = 0) must be related by:\nqN\n\" (L) = qN\n\" (0)e#vDS $t (27)\nUsing this in Equation 26 we obtain\niD = W\nL De n(vBS) \"1\n[\n] Cox\n# $t e\n\" VT vBS\n(\n)\"vGS\n[\n] n$t 1\" e\"vDS $t\n[\n] (28)\nReplacing De with μeφt, Eq. 27 becomes\niD(vGS,vDS,vBS) = W\nL μe Cox\n\"\nn(vBS) #1\n[\n]$t\n2e\n# VT vBS\n(\n)#vGS\n[\n] n(vBS )$t\n1 # e#vDS $t\n[\n] (29)\nTo simplify things further, and get a final working expression for iD, we recognize the leading\nterms are Ko, leave out the explicit dependence of n and VT on vBS, and reorder vGS and VT:\niD = Ko n \"1\n(\n) #t\n2 e\nvGS \"VT\n(\n) n#t 1 \" e\"vDS #t\n(\n) (30)\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nFinally we can identify the pre-factor Ko(n-1)φt\n2 as the sub-threshold saturation current, IS,s-t, and\nwrite this expression as:\niD = IS,s\"te\nvGS \"VT\n(\n) n#t 1 \" e\"vDS #t\n(\n) with IS,s\"t $ Ko n \"1\n(\n) #t\n2 (31)\nThis expression is plotted in Figure 7 on a log-linear graph, i.e. log iD vs vDS, which results in\nequally spaced drain current traces for equal increments in vGS-VT. Exactly the same plot would\nbe obtained for a BJT if log IC was plotted vs. vCE, for equal increments in vBE., except that rather\nthan increasing by a factor of 10 for each 60 mV increment in vBE, which is the case for iC, iD\nincreases by a factor of 10 for each n × 60 mV increment in vGS.\nFIGURE 7\nThe output characteristics of an n-channel MOSFET operating in the sub-threshold region\nin a log-linear plot. The drain current is normalized to the sub-threshold drain saturation\ncurrent, IS,s-t.\nConnecting the Sub-threshold Diffusion and GCA Strong Inversion Drift Models\nThe sub-threshold drain current expression, Eq. 31, was derived assuming vGS ≤ VT, and it\nreaches its maximum value, IS,s-t, at vGS = VT. For larger vGS, according to the depletion\napproximation model, the width of the depletion region, xD, and the variation of the electrostatic\nenergy profile with x, stay fixed. This implies that the diffusion current between the drain and\nsource saturates at its peak value, IS,s-t, and the additional drain current, iD, for vGS > VT is due to\ncarrier drift in the inversion region (i.e., in the channel). Strictly speaking, then, we should write\nthe drain current of an n-channel MOSFET as follows:\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\niD(vGS,vDS,vBS) =\nIS,s\"te(vGS \"VT )/ n#t\nfor\n$ vGS \"VT\n[\n] < 0 < vDS\nIS,s\"t+ Ko\n2$ vGS \"VT\n[\n]\nfor\n0 < 1\n$ vGS \"VT\n[\n] < vDS\nIS,s\"t+ Ko vGS \"VT \"$ vDS\n% & '\n( ) * vDS\nfor\n0 < vDS < 1\n$ vGS \"VT\n[\n]\n%\n&\n+\n+ +\n'\n+\n+\n+\n(32)\nNotice that when writing Eq. 32 we assumed that vDS > 3φt, so (1-evDS/φt) ≈ 1.\nIn practice, however, we seldom include IS,s-t in the expressions for the drain current in the\nlinear and saturation regions. To understand why this is reasonable it is useful to compare the\nmagnitudes of the terms IS,s-t and Ko(vGS-VT)2/2α. To do this in a general way we can first notice\nthat both of these terms depend on Ko, so it makes sense normalize them relative to Ko, and thus\nto compare iD(sub-threshold)/Ko and iD(strong inversion)/Ko. We will look in the vicinity of VT, and vary\n(vGS-VT). That way we don't have to specify either Ko or VT, and our results will be more\ngeneral.\nIn the sub-threshold region we have\niD,sub\"threshold\nKo\n=\nn \"1\n(\n) #t\n2 e\nvGS \"VT\n(\n) n#t (33)\nand above threshold, in strong inversion and saturation, we have\niD,sub\"threshold\nKo\n= 1\n# vGS \"VT\n(\n)\n(34)\nFor the sake of discussion, let us say that we have an n-channel MOSFET with the same\nMOS capacitor we used earlier, with NA = 1018 cm -3 and tox = 3 nm, and that vBS = 0 and vDS >>\nφt. The α (and n) of this device is 1.25, and the maximum normalized diffusion current, iD,s-t/Ko,\nis 1.56 x 10-4 V2. For comparison, the normalized drift current when vGS is just 60 mV above\nthreshold, i.e. (vGS - VT) = 0.06 V, is almost an order of magnitude larger, 1.5 x 10-3 V2, and it is\nmore than two orders of magnitude larger, 1.6 x 10-2 V2, when (vGS - VT) = 0.2 V.\nIf we plot the sum of the normalized diffusion and drift currents in the range VT ± 0.5 V, as\nshown in Figure 8, we can barely see the diffusion current on a linear plot. We have to look\nmuch more closely to VT, well within VT ± 0.1 V, to see it, as Figure 8b illustrates. The same\ncurrents are presented in a log-linear plot in Figure 9. In this plot, the exponential nature of the\nsub-threshold diffusion current is clear, and so too is the n × 60 mV/decade sub-threshold slope.\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\n(a)\n(b)\nFIGURE 8\nThe drain current, iD, for gate biases from just below to just above threshold illustrating\nthe relative sizes of the diffusion (sub-threshold) and drift (strong inversion) components\nof iD. Figure 8 a shows the situation with a course voltage scale, while Figure 8b has\nsmaller increments and thus focuses in more on the curves near VT.\n\n6.012 Supplementary Notes: MOSFETs in the Sub-threshold Region (i.e. a bit below VT)\nFIGURE 9\nThe drain current, iD, for gate biases from just below to just above threshold as in Figure 8b,\nbut now plotted on a log-linear graph so the nature of the small, sub-threshold current and\nits variation with input voltage, vGS, is more clear.\nThe simple depletion approximation model we are using, our neglect of drift currents below\nthreshold, and our use of a saturated diffusion current above threshold, are all reasonable\napproximations, and are better the further we are above or below threshold. We should expect\nthem to have limitations very near threshold, however, and in particular we should not demand\ntoo much from them as we pass from vGS < VT to vGS > VT. The curves look rather smooth in\nFigure 8 b, but we see a slight kink on the log scale of Figure 9. Interestingly, this kink can be\nsmoothed nicely by using the adjusted threshold in the saturation current expression, as shown in\nFig. 9, but is largely coincidence as the 6 mV shift came from looking at the total gate charge in\nthe sub-threshold region, not the inversion layer in strong inversion. Just the same, our simple\nmodels accurately reflect the physics, and do an outstanding job no matter how one looks at it.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The Gradual Channel Approximation for the MOSFET",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/eeb94eab00ebb62a3fde0eec1484bc08_MIT6_012F09_lec11_gradual.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits\nFall 2009\nThe Gradual Channel Approximation for the MOSFET:\nWe are modeling the terminal characteristics of a\nMOSFET and thus want iD(vDS, vGS, vBS), iB(vDS, vGS, vBS),\nand iG(vDS, vGS, vBS). We restrict our model to vDS ≥ 0 and\nvBS ≤ 0, so the diodes at the source and drain are always\nreverse biased; in this case iB ≈ 0. Because of the insulating\nnature of the oxide beneath the gate, we also have iG = 0,\nand our problem reduces to finding iD(vDS, vGS, vBS).\nThe model we use is what is called the \"gradual\nchannel approximation\", and it is so named because we\nassume that the voltages vary gradually along the channel\nfrom the drain to the source. At the same time, they vary\nquickly perpendicularly to the channel moving from the\ngate to the bulk semiconductor. In the model we assume\nwe can separate the problem into two pieces which can be\nworked as simple one-dimensional problems. The first\npiece is the x-direction problem relating the gate voltage\nto the channel charge and the depletion region; this is the\nproblem we solved when we studied the MOS capacitor.\nThe second piece is the y-direction problem involving the\ncurrent in, and voltage drop along, the channel; this is the\nproblem we will consider now. To begin we assume that\nthe voltage on the gate is sufficient to invert the channel\nand proceed.\nNotice that iD(vDS, vGS, vBS) is the current in the\nchannel; this is a drift current. There is a resistive voltage\ndrop, vCS(y), along the channel from vCS = vDS at the drain\nend of the channel, y = L, to vCS = 0 at the source end of\n\nthe channel, y = 0. At any point, y, along the channel we\nwill have:\niD = -qN* (y) sy(y) W\nThe current is not a function of y, -qN* (y) is the channel\nsheet charge density at y,\n* (y)\n*\n-qN\n= - Cox [vGB - VT(y)]\n*\nwith Cox\n≡εo/to, and sy(y) is the net velocity of the\ncharge carriers in the y-direction at y, which for modest\nelectric fields is linearly proportional to the field:\n- dvCS(y)\nsy(y) = - μe Ey(y) = - μe\ndy\nThe current is then\ndvCS(y)\n*\niD = W μe Cox [vGB - VT(y)]\ndy\nTo proceed, we must examine the factor [vGB - VT(y)].\nWe are referencing our voltages to the source so we first\nwrite vGB = vGS - vBS. Next we look at VT(y); why is it a\nfunction of y? To answer this question we must note that\nthe picture is a bit different in the MOSFET than it was\nbefore with the isolated MOS structure because now the\nchannel (inversion layer) can have a voltage relative to the\nsubstrate. It is reverse biased by an amount -vCB(y) and so\nnow the potential drop across the depletion region is - 2φp\n+ vCB(y). Thus in our expression for VT, - 2φp is replaced\nby - 2φp + vCB(y). We have:\nVT(y) = VFB - 2φp + vCB(y) +\n2 εSi qNA[-2φp + vCB(y)]\n*\nCox\n\nIt is common practice to name the factor Cox 2 εSi qNA\n*\nthe body factor, and call it γ, so we can then write VT(y) as\nVT(y) = VFB - 2φp + vCB(y) + γ [-2φp + vCB(y)]\nUsing this in the factor [vGB - VT(y)] in the iD expression,\nwe have\n[vGB - VT(y)] = vGB - VFB + 2φp - vCB(y)\nγ [-2φp + vCB(y)]\nwhich, after using vGB = vGS - vBS and vCB = vCS - vBS, and\nrearranging terms somewhat, is\n[vGB - VT(y)] = vGS - vCS(y) - VFB + 2φp\n- γ [-2φp + vCS(y) - vBS]\nThe vCS(y) factor under the square root turns out to\ncomplicate the subsequent mathematics annoyingly and it\nhas been found that it is better (and possible) to linearize\nthis term before proceeding. We write the term as\n[-2φp + vCS(y) - vBS] =\n1 +\nvCS(y)\n[-2φp - vBS]\n[-2φp - vBS]\nand approximate the factor involving vCS by expanding it\nand retaining only the first (linear term):\n≈\n[-2φp - vBS] (1 + 2 [-\nv\n2φ\nCS\np\n(\n-\ny\nv\n)\nBS])\nwhich upon multipying becomes\nvCS(y)\n=\n[-2φp - vBS] + 2 [-2φp - vBS]\n\nFinally, giving the factor 1/2 [-2φp - vBS] the symbol δ,\nwe write our linear approximation to the troublesome\nterm as:\n[-2φp + vCS(y) - vBS] ≈\n[-2φp - vBS] + δ vCS(y)\nMaking this replacement, we have\n[vGB - VT(y)] ≈ vGS - (1 + γδ) vCS(y) - VFB + 2φp - γ [-2φp - vBS]\nDefining VT(vBS) as,\nVT(vBS) ≡ VFB - 2φp + γ [-2φp - vBS]\nand giving the factor (1 + γδ) the symbol α, we can write\n[vGB - VT(y)] ≈ [vGS - VT(vBS) - α vCS(y)]\nPutting this back into our expression for iD, we find:\niD = εo\nμe W [ vGS - VT(vBS) - α vCS(y)] dvCS(y)\nto\ndy\nMultiplying both sides by \"dy\" yields\n*\niDdy = W μe Cox [ vGS - VT(vBS) - α vCS] dvCS\nWe can now integrate both sides from y = 0 and vCS = 0 to\ny = L and vCS = vDS. We have\nL\nL\n⌠\n⌠\n⌡iD dy = iD ⌡dy = iDL\nand\nvDS\nα vDS\n⌠⌡[ vGS - VT - α vCS] dvCS\n= [(vGS - VT)vDS -\n]\nSetting these two integals equal, and dividing both sides\nby L yields the expression for iD we are looking for:\n\nW\n*\nα vDS\niD(vDS, vGS, vBS) = L μe Cox [{vGS - VT(vBS)} vDS -\n]\nIt is worth reminding ourselves that arriving at this result\nwe assumed that vGS > VT; otherwise iD is zero because\ntheir is no channel. We also specified vDS ≥ 0 and vBS ≤ 0.\nIf we plot this expression for iD verses vDS for fixed\nvalues of vGS and vBS, we find that iD varies linearly with\nvDS when vDS is small, but increases sub-linearly as vDS\nincreases further, i.e., the curve bends over to the right.\nPhysically, the amount of inversion decreases toward the\ndrain end of the channel and the resistance of the channel\nincreases. Still, iD continues to increase until vDS = (vGS\nVT)/α, at which point the equation says iD starts to\ndecrease. What happens physically is that the channel\ndisappears near the drain when vDS = (vGS - VT)/α, i.e.,\nthe region under the gate is no longer inverted near the\ndrain. For larger values of vDS the current does not\ndecrease, but stays saturated at the peak value. We find\n1 W\n*\niD(vDS, vGS, vBS) = 2α L μe Cox [vGS - VT(vBS)]2\nfor vDS ≥ (vGS - VT)/α and vGS > VT.\nThis completes the gradual channel approximation\nmodel for the MOSFET. Summarizing the results, we\nhave a model valid for vDS ≥ 0 and vBS ≤ 0, and it says that\nthe gate and substrate currents are zero for this entire\nrange, i.e.,\niG(vDS, vGS, vBS) = 0\nand\niB(vDS, vGS, vBS) = 0\n\nThe drain current has three regions:\nCutoff:\niD(vDS, vGS, vBS) = 0\nfor (vGS - VT)/α ≤ 0 ≤ vDS\nSaturation:\nK\niD(vDS, vGS, vBS) = 2α [vGS - VT(vBS)]2\nfor 0 ≤ (vGS - VT)/α ≤ vDS\nLinear (or triode):\niD(vDS, vGS, vBS) = K [{vGS - VT(vBS)} vDS --\nα v\nDS ]\nfor 0 ≤ vDS ≤ (vGS - VT)/α\nwhere K, α, and VT(vBS) are defined as\nW\nto 2 εSi qNA\nK ≡ L μe Cox\n* , α ≡ 1 + 2 εo [-2φp - vBS] ,\nand\nVT(vBS) ≡ VFB - 2φp + ε\nto\no 2 εSi qNA[-2φp - vBS]\nOne last point: It is often convenient to write VT(vBS) in\nterms of VT(0), and a function of vBS. We have\nVT(vBS) ≡ VFB - 2φp + γ (-2φp - vBS)\nand\nVT(0) ≡ VFB - 2φp + γ -2φp\nso the expression we want is\nVT(vBS) ≡ VT(0) + γ [ (-2φp - vBS)\n-2φp ]\nThis will be useful when we look at linear small signal\nmodels for the MOSFET.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "The marvelous CASCODE",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/6-012-microelectronic-devices-and-circuits-fall-2009/9fce7430fe6c477c2f619ddac1e7eb1a_MIT6_012F09_lec21_cascode.pdf",
      "content": "6.012 - Microelectronic Devices and Circuits\nFall 2009 - 11/19/09 handout\nThe marvelous CASCODE:\nV-\nV+\nQ2\nQ1\nvout\n-\nRL\n+\nRS\nvS\n+\n-\ncascode ≡ a two-transistor configuration formed of\na common-emitter/-source stage\nfollowed by a common-base/-gate stage\nThe cascode is a very useful two-transistor stage that\nprovides the performance of a common-emitter/-source\nstage with a much smaller Miller effect and much larger\noutput resistance. The stage was first introduced to get\nbetter high-frequency performance, and the higher output\nresistance was viewed as a bonus; now designers take\nadvantage of both features in a variety of situations.\nMiller Effect:\nUsing a common-base/-gate stage, with its low input\nresistance, to load a common-emitter/source stage means\nthat the voltage gain of the latter stage will be small, and\nso it will have a greatly reduced Miller effect. It will still\nhave the same high input resistance and large current gain\nas before, however.\n\nThe common-base/-gate member of this pair does not\nprovide any additional current gain (i.e., its current gain is\none), but it does provide voltage gain (as much as, or more\nthan, a similarly biased common-emitter/-source stage\ndriving the same load). It also has a very large output\nresistance.\nTogether the cascode combination has the same\noverall current and voltage gains of a common-emitter/\n-source stage, the same input resistance, and a larger\noutput resistance (see below).1\nOutput resistance:\nConsider the circuit sketched on the preceding page\nwith zero signal input; apply a test voltage, vt, to the\noutput terminals and calculate the resulting current, it, to\nfind the output resistance, Rout ≡ vt/it. The small signal\nlinear equivalent circuit is shown below (RL has not been\nincluded; it is in parallel with this Rout):\ngo2\ngm2v!2\nvs = 0\nvt\n+\n-\ngo1\ngm1v!1\nv!1\ng!1\n+\n-\nit\ng!2\nv!2 = 0\n+\n-\nRS\n+\n-\nWe see immediately that it = - (go2 + gπ1) vπ, and at the one\nnode in the circuit we can write\nvπ (go2 + gπ1) + gm1 vπ + go1 (vt + vπ) = 0\n1The voltage gain is actually larger also because of the increased output resistance.\n\nWe solve this for vπ, substitute the result into the\nexpression for it, and find Rout to be:\ngo1 + go2 + gπ1 +gm1\nRout =\ngo1 (go2 + gπ1)\nTo see what this means, notice that if go1 and go2 are much\nsmaller than gπ1, the numerator is approximately (β + 1)\ngπ1, and the denominator is approximately go1 gπ1, so we\nhave\n(β + 1)\nRout (bipolar cascode) ≈\ngo1\n= (β + 1) ro1\nThis result is valid for a bipolar cascode. For a MOSFET\ncascode the small signal model is the same as long as vbs is\nzero on both devices,2 however gπ1 is zero for a MOSFET\nso the approximation for Rout is different. The numerator\nis now approximately gm1, and the denominator is go1 go2,\nleading to\nK2\nRout (MOSFET cascode) ≈\ngm1\n=\nK1 Av,oc2 ro1\ngo1 go2\nwhere Av,oc2 is the open-circuit voltage gain of Q2. The\npoint is that Rout is again much larger than ro1.\nApplications:\nCascode connections are often used as the gain\nelements in amplifier stages when the Miller effect is an\nissue. They are also used in current sources and as non\nlinear loads where the output resistance of a single\n2 For a more general solution see the course text (\"Microelectronic Devices and Circuits\"\nby C. G. Fonstad, Jr.), Section 12.5.2.\n\ntransistor is not sufficient.3 As devices are made smaller\nand smaller, to make them faster and faster, the output\nresistance often suffers (i.e., the Early voltage is smaller),\nand the cascode connection offers a way of recovering\nsome of the lost performance.\nThe down side:\nThe \"costs\" of using a cascode are that you must use\ntwo transistors instead of one (not a big cost in an\nintegrated circuit) and, more importantly, that there is a\nlarger voltage drop across the pair of transistors in the\ncascode than there is in a single-transistor stage. This may\nreduce the ranges of voltages over which an amplifier\nusing cascodes will operate. This is particularly important\nin modern circuits designed to use relatively low supply\nvoltages and they consume minimal amounts of power\n(for cellular telephone applications, etc.).\n3 Examples of cascode current mirrors can be seen in Figures 12.19 and 13.20 of the\ncourse text (\"Microelectronic Devices and Circuits\" by C. G. Fonstad, Jr.).\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n6.012 Microelectronic Devices and Circuits\nFall 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}