{
  "course_name": "Modal Logic",
  "course_description": "Modal logic is the logic of necessity and possibility, and by extension of analogously paired notions like validity and consistency, obligation and permission, the known and the not-ruled-out. This a first course in the area. A solid background in first-order logic is essential. Topics to be covered include (some or all of) the main systems of propositional modal logic, Kripkean “possible world” semantics, strict implication, contingent identity, intensional objects, counterpart theory, the logic of actuality, and deontic and / or epistemic logic. The emphasis will be more on technical methods and results than philosophical applications.",
  "topics": [
    "Humanities",
    "Linguistics",
    "Semantics",
    "Philosophy",
    "Logic",
    "Humanities",
    "Linguistics",
    "Semantics",
    "Philosophy",
    "Logic"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Overview\n\nModal logic is the logic of necessity and possibility, and by extension of analogously paired notions like validity and consistency, obligation and permission, the known and the not-ruled-out. This a first course in the area. A solid background in first-order logic is essential. Topics to be covered include (some or all of) the main systems of propositional modal logic, Kripkean \"possible world\" semantics, strict implication, contingent identity, intensional objects, counterpart theory, the logic of actuality, and deontic and / or epistemic logic. The emphasis will be more on technical methods and results than philosophical applications.\n\nPrerequisites\n\n24.241 Logic I\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n40%\n\nModal Logic Paper\n\n20%\n\nFinal Exam\n\n30%\n\nParticipation, etc.\n\n10%\n\nCalendar\n\nSES #\n\nTOPICS\n\nKEY DATES\n\nBasic Propositional Notions\n\n2-3\n\nBasic Modal Notions\n\n4-5\n\nSystem K\n\nHomework 1 due Session 4\n\n6-7\n\nExtensions of K\n\nHomework 2 due Session 6\n\n8-9\n\nTesting for Validity\n\nHomework 3 due Session 8\n\n10-11\n\nModal Metalogic\n\nHomework 4 due Session 10\n\n12-13\n\nGlimpses Beyond\n\n14-15\n\nModal Predicate Logic\n\n16-17\n\nModal Predicate Metalogic\n\nHomework 5 due Session 16\n\n18-19\n\nShifting Domains\n\nHomework 6 due Session 19\n\n20-21\n\nExistence and Identity\n\nHomework 7 due Session 21\n\n22-23\n\nDescriptions and Rigidity\n\nModal Logic Paper & Homework 8 due Session 23\n\n24-25\n\nIntensional Objects\n\n26-27\n\nSpecial Topics\n\nTake Home Final due two days after Session 27",
  "files": [
    {
      "category": "Resource",
      "title": "24.244s15 Homework 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/8ce3d440ee3d2d9cdf1e24d3b45636e4_MIT24_244S15_Homework1.pdf",
      "content": "Philosophy 244: Homework 1 on Basic Modal Notions\nQuestions (1) - (4) are 1.1 - 1.4 on pages 21-22 of the book.\n(5) What sort of seeing arrangement is needed for the following to come out valid? You needn't\nshow that your answer is correct.\n(a) □p\n(b) (♦p & ♦q) ⊃♦(p & q)\n(c) ♦♦p ⊃♦p\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/dfb1c39084a0cf1c8c021af674a2659f_MIT24_244S15_Homework2.pdf",
      "content": "Philosophy 244: Homework 2 on K and T\nNote partial solutions on pp 369-371!!!\nQuestions (1) - (6) are 2.1 - 2.6 on pages 48-9 of the book.\n(7) State derived rule EQ and show that it preserves validity in K.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/bf8aaf60e337642567f259a30a3bdb9e_MIT24_244S15_Homework3.pdf",
      "content": "Philosophy 244: Homework 3 on Stronger Systems\n(1) Ex.2.9 [See hint on 371]\n(2) Ex.3.2 [See hint on 372]\n(3) Ex.3.5 [See hint on 373]\n(4) Ex.3.8 (a)(b) [Show T,E ⊢K D,E ⊢K 4,B ⊢K T,E]\n(5) Ex.3.14 [See hint on 374]\n(6) Ex 3.16\nNote: Where X and Y are sets of wffs and S is a modal system, \"X ⊢S Y\" means that each wffin\nY is a theorem of system S+X.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 4",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/45ac63c2165bb6f37b02ab741a041e89_MIT24_244S15_Homework4.pdf",
      "content": "Philosophy 244: Homework 4 on Diagrams and Completeness\n(1) Ex 4.3\n(2) Ex 6.1\n(3) Ex 6.3\n(4) Ex 6.4\n(5) Ex 6.5\n(6) Ex 6.8\n(7) Ex 6.11\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 5",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/756a5ddc42c9cd7e7d9763524f1c5524_MIT24_244S15_Homework5.pdf",
      "content": "Philosophy 244: Homework 5 on Basic Modal Metalogic\n(1) Ex. 13.1\n(2) Ex. 13.2 (i)(ii)\n(3) Ex. 13.4\n(4) Ex. 13.5\n(5) Ex. 13.7, just the first part.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 6",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/ba3482c781b103d1af8adc6b2fe5ad1b_MIT24_244S15_Homework6.pdf",
      "content": "Philosophy 244: Homework 6 on Modal Predicate Metalogic\n(1) Ex. 14.1, except that there's a typo. You're supposed to show that {α | □□α ε Λ } can be\nextended to a consistent set with the ∀-property. Hint: Since S contains S4, □□α ε Λ iff□α ε Λ.\n(2) Ex. 14.2. S4.3 is S4 plus □(□p⊃q)∨□(□q⊃p). A frame is connected iffwhenever two worlds\ncan be seen by one world, at least one of the two can see the other. Hint: By 14.9 it suffices to\nshow that the frame of the canonical model for S4.3+BF is reflexive, transitive, and connected.\nYou can take reflexiveness and transitivity for granted; is it connected? (See pp.128-9)\n(3) Ex. 14.3.\n(4) Explain Prop. 14.9 and its proof in your own words. Explain how it follows from 14.9 and its\ncorollary 14.10 that S5+BF is complete.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 7",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/617f1807857c4e7492ba458b71fe8b56_MIT24_244S15_Homework7.pdf",
      "content": "Philosophy 244: Homework 7 on Expanding Domains\n(1) Exercise 15.1, except for the part about MV (see p.283 for S4.9 and p.139 for KW)\n(1) Exercise 15.2 (see p. 271 for S4.2)\n(2) Exercise 15.5(a)\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Homework 8",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/3b02953123e119cc3722320111638a43_MIT24_244S15_Homework8.pdf",
      "content": "Philosophy 244: Homework 8 on Existence, Identity, and Descriptions\n(1) Exercise 16.2\n(2) Exercise 16.3\n(3) Exercise 17.1\n(4) Exercise 17.4\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Modal Logic Paper Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/fecf22645bb3729e515545e8edd12f9d_MIT24_244S15_ModalLogic.pdf",
      "content": "Philosophy 244: First and Only Paper Assignment\nWrite a 5 to 7 page paper exploring a topic relating to modal logic. Some examples.\n(1) Anselm tried to prove God's existence from two premises: God by definition must\npossess every perfection, and existence is a perfection--it is more perfect to exist than\nnot to. This is called the ontological argument. Charles Hartshorne in the 20th century\nattempted a modernized modal version of the argument. (G says that God exists.)\n1. G ≡□G (by definition of God)\n2. ^G (the hypothesis of God's existence is not incoherent)\n3. ^□G (1, 2 x Eq)\n4. ^□G ≡□G (S5(3))\n5. □G (3,4 x MP)\n6. G (5, T)\nHartshorne's version of the argument is a bit different. How? What if anything is wrong\nwith the argument in either version?\n(2) What is essentialism? What are some examples of essentialist hypotheses? What are\nsome of Quine's objections to essentialism? Are they convincing?\n(3) Hesperus and Phosphorus only happen to be identical, it seems. They could have\nturned out to be distinct. Yet if they are identical at all, they must (by Leibniz's Law) have\nall their properties in common. Hesperus has the property of being necessarily identical\nto Hesperus, so Phosphorus has that property too. But then they are not contingently\nidentical after all! What should we say about this argument? Is the identity contingent, or\nnot?\n(4) Compare and contrast Ruth Barcan Marcus's proof of the necessity of identity with\nKripke's proof.\n(5) Anything you like, with permission of the instructor.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Take Home Final Guidelines",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/f88558c293d5e496eecf1d157dc84918_MIT24_244S15_TakeHome.pdf",
      "content": "Philosophy 244: Modal Logic--Take Home Final\nSpring 2015\n(1) Is `2↵) `3↵a derived rule of K? Is it a derived rule of T? What about `32↵\n) `23↵? What about ` 2i↵) `2j↵, where i and j are any two nonnegative integers?\nExplain your answers.\n(2) Using the method of semantic diagrams (Chapter 4), determine in which of the follow-\ning systems - K, D, T, S4, S5 - the w↵3(33p⊃3p) is valid. Show your work.\n(3) A relation R is connected i↵yRz holds whenever xRy and xRz do. Question: is the\ncharacteristic S5-formula 3↵⊃23↵valid on all frames with a connected accessibility relation?\nWhy or why not?\n(4) Explain the proof of Theorem 6.11 to the e↵ect that S5 is complete, basing your an-\nswer on the suggestion given just below the theorem on p.121.\n(5) Consider a definition of propositional \"validity\" that dispenses with the set W of worlds.\nAn interpretation I of the modal propositional language L2 is an ordered pair <A,R>, where\n(i) A is a set of classical truth-value assignments V for propositional logic, and\n(ii) R is a binary relation on A.\nEach V in A is extended to the full language by saying that V(2β)=1 i↵V'( β)=1 for each V'\nto which V bears R, otherwise V(2β)=0. ↵is called Valid for an interpretation I i↵V( ↵)=1\nfor each V in A, and Valid full stop if it is Valid on all interpretations. Question: Is Validity\nthe same as (absolute) validity (= truth in all worlds of all models based on all frames)? If so,\nsay why. If not, say why not.\n(6) Show that the modal predicate logic S4+BF is complete with respect to constant do-\nmain models based on reflexive, transitive frames. Feel free to appeal to any theorems, corol-\nlaries, etc. that you like.\n(7) S4.3 is S4 with the additional axiom 2(2p⊃q)_2(2q⊃p).Show that LPC+S4.3 is\ncomplete with respect to expanding domain models based on reflexive, transitive, and con-\nnected frames. (This is problem 15.3 in the book.)\n(8) Give three non-equivalent formalizations ↵1, ↵2, and ↵3 of \"necessarily it is possible\nfor the ' to \" in which the definite description \"the '\" is assigned three distinct scopes:\nnarrow, intermediate, and wide. Produce an S5 model in which the three statements are true\nin di↵erent worlds, that is, the worlds where ↵1 is true = the worlds where ↵2 is true, the\nworlds where ↵1 is true = the worlds where ↵3 is true, and so on for all other pairs of ↵i's.\n(9) Show that intensional object models in which predicates are treated as extensional need\nnot validate I2, 2I, or 2NI, while intensional object models in which predicates (including =)\nare treated as intensional must validate all three.\n(10) What is one cool thing you can do with counterpart theory?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Adequacy and Extensions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/79f526313b640f008cab4e8010d32b0c_MIT24_244S15_Adequacy.pdf",
      "content": "Philosophy 244: #4--Adequacy and Extensions\nMetalogic\nTo be a theorem of K is to be derivable from the K-axioms by the K-inference rules.\nThis is a purely syntactical notion, which pays no attention at all what the symbols\nmight mean. To be K-valid, or as we put it, absolutely valid is to be successful in all\nsettings bar none. This is a semantical notion which has a great deal to do with what\nthe symbols mean; soon we will make it more semantical still by restating the definition\nof validity in the vocabulary of models.\nThe point for now is that the notion of K-theoremhood and the notion and the\nnotion of absolute validity are prima facie as different as they could be. If we want to\nclaim a connection between the two notions the connection will have to be proved.\nTwo things will have to be proved.\nSoundness: Every K-theorem is K-valid.\nCompleteness: Every K-valid formula is a K-theorem.\nSoundness is easier; that's what we'll do today. Completeness is left for later. The\nstrategy for proving these things is worth sketching now, though, because they're dis-\ntinctive and interesting and convey some of the flavor of metalogical reasoning.\nTo establish soundness, we use mathematical induction. The basis step has us prov-\nMathematical induction works like this.\ning that K's axioms are all K-valid. To carry out the inductive step, we must show that\nSuppose you want to show that all Xs\nare P. Suppose that every X can be\nthe property of K-validity is preserved under application of K's inference rules.\nreached from a small number of \"seeds\"\nTo establish completeness, we look at the contrapositive: every non-theorem β\nor \"generators\" by repeated application\nof a few operations. First show--\nof K is K-invalid, that is, β has a countermodel. A non-theorem is something whose\nthis is the basis step--that all of the\nnegation (or negatum) α is K-consistent, that is, you can't derive a contradiction from\ngenerators are P. Then show--this is\nα. It's equivalent then to prove that every K-consistent α has a model: K-consistency\nthe inductive step--that if some things\nare P, then applying the operations to\nimplies K-satisfiability, in the jargon.\nthem can never produce a non-P. From\nTo prove this we start with α, and then pile on other wffs, taking care to preserve\nthese two steps the conclusion follows.\nWhy? Examples?\nconsistency, until your pile of wffs can't be expanded any further without becoming\ninconsistent. You then have a maximal consistent set with α in it. A maximal consis-\nThis is why we try to make do with\ntent set has so much information in it that it tells us how to construct a model of K in\na very few axioms and rules. Which\nwhich all the set's members, α included, are true. That α holds in this model means\naxioms and rules often itself reflects the\nneeds of these proofs. That is, axioms\nthat α is K-satisfiable, which is what we were trying to prove.\nand rules are chosen, sometimes, less\nwith a view to ordinary reasoning than\nmetalogical reasoning.\nValidity\nSoundness and completeness both rely on the notion of K-validity. The account in\nterms of games was intuitive, which is good; but the features that made it so were\ninessential to our purposes and in some cases positively misleading, which is bad. Let's\ntry to strip some of these features away.\nThe set of players gives way to an arbitrary nonempty set W, which for motivational\nreasons is referred to as the set of worlds.\nNon-emptiness is important if 2α is\nInstead of the seeing-relation, we have an arbitrary binary relation R on W, that is,\nto imply 3α. Just as non-emptiness\nis crucial in quantificational logic if\nan arbitrary set of ordered pairs whose elements are drawn from the set of worlds. R is\n∀xα(x) is to imply ∃xα(x). Empty\nan accessibility relation on W.\ndomains are allowed in \"free logic.\"\nCorresponding to the notion of a seeing arrangement we'll now have frames <W,R>.\nCorresponding to the inscribed sheets of paper, one per player, we'll now have a\nvalue-assignment V which maps each world and propositional variable taken together\nto a truth-value: V (p, w) = 0 or 1.\n\nCorresponding to the notion of a setting (on a seeing arrangement) we'll now have a\nmodel <W, R, V >, a \"model based on the frame <W, R>.\" V is said to be based on\nthe frame too.\nSo: a model M is an ordered triple <W,R,V > where W is an arbitrary nonempty\nset, R is a binary relation on W (a subset of W xW ), and V is a value-assignment.\nNext is to explain what is is for a formula to be true (false) at an M-world; this is done\nby expanding the domain of V from propositional variables to all wffs of the language.\nIt's given that for all propositional variables and wεW, V (p,w) = 0 or 1. That is the\nbasis clause of a recursive definition. Now we add the recursion clause.\nHow do recursive definitions relate to\ninductive proois?\n(V¬) V (¬α, w) = 1 - V (α, w), that is,......\n(V∨) V (α∨β) = max(V (α, w),V (α, w))\n(V2) V (2α,w) = 1 iffV (α,u) = 1 for all u such that wRu, otherwise 0\nWhich sets up the definition of validity.\nα is valid on frame <W,R> iffV (α,w) = 1 for all V based on <W,R> and w ε W,\nα is K-valid, aka absolutely valid, iffα valid on every frame.\nThis may seem unnecessarily complicated! Why not just say: α is absolutely valid iff\nit's valid in every model? Why not indeed? Stay tuned for logics where collapsing the\nlevels leads to the wrong results.\nProp. 2.1 Every theorem of K is K-valid.\nTo get this we prove a more general result. Let K + Λ be the system obtained from\nK by adding as extra axioms all the wffs in Λ, and keeping the transformation rules\nunchanged.\nProp 2.2 If each αεΛ is valid on <W,R>, all theorems of K+Λ is <W,R>-valid too.\nProp. 2.1 is just the special case of 2.2\nThe proof of 2.2 uses two lemmas.\nwhere Λ is the empty set. (Why?)\nLemma 2.3 All valid PC wffs and axiom K are valid on all frames.\nLemma 2.4 For any frame F, the set of wffs valid on F is closed under K's rules.\nThis is enough for 2.2. Why? Now the proofs.\nProof of 2.3: Let <W,R> be given. A valid PC-wffis true on every (regular, non-\nmodal) valuation V of its variables; so V (α,w) is true for every modal V, hence ev-\nery V based on <W,R>; so it is valid on <W,R>. Suppose for contradiction that\nK is not valid on <W,R>. Then there is a V on <W,R> and a wεW such that (i)\nV (2(p⊃q),w) = 1, (ii) V (2p,w) = 1, but (iii) V (2q,w) = 0. By (iii), w bears R to\na u such that V (q,u) = 0. By (ii), V (p,u) = 1. But then w bears R to a u such that\nV (p⊃q,u) = 0, contrary to (i). 2\nProof of 2.4: Let <W,R> be given. [US] Suppose that α[β1/p1...] is not valid on\n<W,R>. Then there's a model based on <W,R> such that for some uεW, V (α,u)\n= 0. Define V * so that for all wεW V *(pi,w) = V (βi,w). Then V *(α,w) = 0 --\nproof by induction -- so α was not valid on <W,R> in the first place. [MP] If α and\nα⊃β are valid on <W,R>, then both are true in every world of every model based on\n<W,R>; hence by (derived evaluation rule) (V ⊃), the same applies to β. [N] If α is\nvalid on <W,R>, then for all models based on <W,R> and all uεW, V (α,u) = 1;\nhence for all wεW, α is true in all worlds w bears R to; hence for all wεW, V (2α,w)\n= 1; hence 2α is valid on <W,R>. 2\n\nExtensions of K\nNow, clearly the most noteworthy thing about system K is that the notion of necessity\nit captures is not \"strengthening\": it's not a notion according to which whatever is\nnecessary has got to be true. How do we know this? Proved earlier that 2p⊃p isn't\nK-valid, and by soundness, if it isn't K-valid it isn't a theorem of K. We look now at an\nextension of K that adds \"strengthening\" as an additional axiom. System T is just like\nSo named by the Belgian logician Feys\nsystem K except its axioms are PC, K, and\nin 1937, working offof a system devised\nby Godel. Feys wrote a book in 1958\nwith William Craig. Craig went on to\nT 2p⊃p\nteach at Berkeley for many years and is\nnow a Professor Emeritus there.\nThis is called the axiom of necessity, not to be confused with the rule of necessi-\ntation. This is probably the weakest system that anyone seriously regards as having a\nchance of capturing the notion of metaphysical necessity. Here are a couple of impor-\nLater we might look at a paper of\ntant theorems of T that are not theorems of K.\nNathan Salmon's arguing that nothing\nstronger than T is philosophically\nT1\np⊃3p\ndefensible.\n1.\n2¬p ⊃¬p\nT\n2.\np⊃¬2¬p\n(1)xPC\n3.\np⊃3p\n(2)xDefN\nT2\n3(p⊃2p)\n2p ⊃32p\nT1[ / ]\n3(p⊃2p)≡(2p⊃32p)\nK7[ / ]\n3(p⊃2p)\n(1),(2)xEq\nSuppose we wanted to show that these weren't theorems of K. How would we do it?\nCan you think of countermodels? The main reason for mentioning T2 is to show that\nthe following, which might seem like just a dual-ish counterpart of the necessitation\nrule, is not a rule of system T:\nShouldn't we be able to get this from\nnecessitation by contraposition?\n⊢3α →⊢α\n⊢α→⊢2α..........Necessitation\nIf this were a rule, then from T2 you'd get\n¬⊢2α\nα.....Contraposition\n⊢3\n→¬⊢\n¬α→⊢¬α.....Not-must=maybe-not\n⊢(p⊃2p).\n⊢3β →⊢β......β subbed in for ¬α\nHmmm...\nFrom which it follows by necessitation that\n⊢2(p⊃2p),\nin other words, necessarily, any truth is necessarily true. Hopefully this is not a theorem\nof T! Why intuitively would ⊢3α →⊢α fail, though? How can it be a theorem that α\nis possible when it's not a theorem that α is true?\nValidity for T\nThink back to the argument a few days back that 2p⊃p isn't absolutely valid. To get\na countermodel we had to use a non-reflexive frame. If that \"had to\" holds up, then\n2p⊃p is valid on every frame that's reflexive, that is, every world in W bears R to\nitself.\nCall a formula T-valid iffits valid on every reflexive frame. Propn. 2.2 shows, if\nyou think about it, that system T is sound relative to this definition of validity. (Now\nwe see the role of Λ is playing in that proposition.) Later we'll see that the reflexive\nsemantics is complete as well.\nFor now let's go back to the declaration above that 2(p⊃2p) had better not be\na theorem of T. How do we show it isn't? Let's think of it semantically. What do we\nneed to find? A reflexive frame on which 2(p⊃2p) is not valid. To get that we need\na model on such a frame where it isn't true. The simplest idea would be a one-world\n\nmodel.....you take it from there.\nSystem D\nT is clearly an extension of K. Now we consider a weaker extension that lies midway\nbetween K and T. If 2 expresses obligatoriness, we don't want 2p⊃p to be a theo-\nrem. Leibniz thought he could prove that our world is the best possible; if to be the\nbest possible it can't have any unmet obligations, then Leibniz maybe would want p\nought to be the case, so it is the case to be a theorem. Leibniz was wrong about this,\nthough, as shown by Voltaire. Nobody today wants p ought to be the case, so it is the\ncase to come out a theorem.\nBut a weaker claim may still seem right: whatever ought to be the case is permit-\nted, that is, nothing is both obligatory and forbidden. This leads us to system D (for\ndeontic), defined as K with the additional axiom\nD 2p ⊃3p.\nSomeone might I suppose want to\nOur first theorem is to the effect that not absolutely everything is forbidden.\ndisagree with even this, on the ground\nthat it rules out moral dilemmas: you\nD1\n3(p⊃p)\nought to save Alice, and you ought to\np ⊃p\nPC\nsave Bert, but you can't do both. Are\nyou permitted to save Bert? Maybe\n2(p ⊃p)\n(1)xNE\nnot, since then you won't be able to\n2(p ⊃p) ⊃3(p ⊃p)\nD[p⊃p/p]\nfulfill your obligation to Alice.\n3(p ⊃p)\n(2),(3)xMP\nA derived rule is ⊢α →⊢3α. Does that mean every truth is permitted?! Let's\nhope not!\nTo place D with respect to our other systems, we ask: is D contained in T? Equiv-\nalently is 2p⊃3p provable in T? It is if p⊃3p is provable in T. Hint: it's more or less\nthe contrapositive of 2p⊃p. The next question is whether D is stronger than K. Clearly\nso. The book shows that D is the weakest extension of K which has any theorems of\nthe form 3α.\nHow do we get this? Let K+ be an extension of K with 3α as a theorem. We have\nto show that K+ contains D, which comes down to having 2α ⊃3α as a theorem\nD\n2p⊃3p\n3α\nK+\nq⊃(p⊃p)\nPC\nα⊃(p⊃p)\nUS[ / ]\n3α⊃3(p⊃p)\n(3)xDR3\n3(p⊃p)\n(1),(4)xMP\n3(p⊃p) ≡(2p ⊃3p)\nK7[ / ]\n2p ⊃3p\n(5),(6)xMP\nChisholm's Paradox of Contrary-to-Duty\nValidity for D\nImperatives\n1. Smith ought to go help his neigh-\nbors: 2g\nBy a dead end let's mean a world that can't see anything. A frame isserial if it con-\n2. He ought to tell them he is coming,\ntains no dead ends; every world can see at least one world -- maybe itself, maybe a\nif he does: 2(g⊃t)\ndifferent world. D-validity is validity on every serial frame. To establish soundness it\n3. If he doesn't go, he ought not to\nsuffices by Prop. 2.2 to show that axiom D is valid on every serial frame. Suppose\ntell them he is coming: ¬g⊃¬2t\nnot; then some model based on a serial frame has a world w in which 2p holds and 3p\n4. He is not going to help them: ¬g\nfails. But the only way for that to happen is for w to be a dead end; if it could see any\nThese claims ought to be consistent!\nworld u, u would have to both be and not be a p-world which is contradictory. Com-\nBut, (2) implies 2g⊃2t (by K), which\nwith (1) implies 2t, while (3) and (4)\npleteness is left for later. Next time: S4, B, and S5; what they're good for and their\nimply ¬2t by Modus Ponens.\nrelations to K, D, and T. The ordering is going to be: K < D < T < B, S4 < S5.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Basic Modal Systems",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/acd259e68050c8f57aa018842a51926d_MIT24_244S15_BasicModal.pdf",
      "content": "Philosophy 244: 244 #3--Basic Modal Systems\nTime to start looking at some specific logical systems, starting with our \"base\"\nsystem K - the system such that theoremhood in it corresponds to \"absolute\" validity,\nie. validity in all seating arrangements whatsoever. Logical systems can be presented in\na number of ways, but we'll do it axiomatically. This involves specifying\n(a) the language in which wffs are formulated\n(b) a selected set of wffs known as the axioms\n(c) a set of transformation (inference) rules.\nThe system's theorems will be the closure of the axioms under the inference rules,\nie., everything you can get from the former by repeated application of the latter.\nCrucially all of the notions (a), (b), and (c) have got to be effective in the sense\nthat there's a mechanical procedure for determining what counts as a wffof the lan-\nguage, what counts as an axiom, and what counts as an (instance of) an inference\nrule.\nWhat about a system's theorems?\nThese procedures have also got to be non-semantic in nature. One needn't know\nShould they too have to form an\neffectively decidable set? Answer: NO.\nwhat anything stands for or what is true to figure out what the wffs, axioms, and per-\nThis is not to say theorem-hood is not\nmissible inferences, are. For this reason the axiomatic approach to logical systems is\neffectively decidable, just that it doesn't\nhave to be. Decidability vs semi-\nsometimes called the (or a) syntactic approach; the intended contrast being with the\ndecidability (= recursive enumerability).\nsemantical approach via models and validity.\nSystem K\nEarlier we talked about absolute validity - validity in all seating arrangements, or\nall frames - and said that this was the notion of validity captured by system K. What\nis meant by this? That the theorems of K are precisely and without exception the\nabsolutely valid wffs. Another word for absolute validity is thus K-validity.\nTo present K I've got to tell you (a) what the wffs are, (b) what the axioms are, and\n(c) what the inference rules are.\n(a) The wffs, and indeed the wffs of all systems to be considered for quite a while, are\njust the wffs of modal propositional calculus.\n(b) The axioms are of two kinds; PC as written is a \"schema\" that lays out a whole\nbunch of axioms at once.\nPC If α is a PC-valid wff, then α is an axiom.\nK\n2(p⊃q) ⊃(2p⊃2q) is an axiom.\nNote that PC stands in for an infinite number of axioms. How does that fit with the\nidea that the axioms have to be specified effectively or algorithmically? K is just one\nparticular sentence, built on the atomic sentences p and q. Anything of K's form\nwill be a theorem, only the others are arrived at using an inference rule.\n(c) K has three rules:\nUS gets us 2(p&r\nUS Substitution: Replacing p\n⊃p≡r)⊃(2(p&r)\n1..pn in a theorem by α1..αn yields a theorem.\n⊃2(p≡r)). What else?\nMP or Modus Ponens or Detachment: If α and α⊃β are theorems, so is β.\nN or Necessitation: If α is a theorem, so is 2α.\nWhat can we get with N's help\nfrom 2(p&r ⊃p≡r) ⊃(2(p&r) ⊃\nTo represent the result of systematically substituting the β s for the p s in β, we\n2(p≡r))?\ni\ni\nwrite α[β1/p1,...,βn/pn]. Where α is a wffand S is an axiomatic system, we write\n⊢Sα to express that α is theorem of S. When ⊢α is derivable from ⊢α in the going\nmodal system we write ⊢α →⊢β. With this we can state the rules more simply as\n\nUS ⊢α →α[β1/p1,...,βn/pn].\nMP ⊢α, ⊢α⊃β →⊢β\nN\n⊢α →⊢2α\nNotice that only the third of these is a specifically modal rule. N may strike you as\nfunny; why should α suddenly be entitled to sprout a 2 at the front? Remember that\nα is only a theorem if it is valid; if α is valid, meaning something like true in virtue of\nthe meaning of its logical symbols alone, then it could hardly fail (it seems) to be true\nin all possible worlds in virtue of those same meanings, which means its necessitation is\nvalid. Later when we get to actuality we'll see a possible hold in this reasoning. (The\nPresident = the actual President is true in virtue of the meaning of its logical symbols,\nbut it doesn't hold in all worlds.)\nProofs and Provability\nA proof in S is a finite sequence of wffs, each of which is either (i) an axiom of S or\n(ii) derived from earlier wffs by (iia) applying one of the transformation rules or (iib)\nmaking a definitional substitution. Each line of a proof contains three items:\na wff,\na reference number for that wff, written immediately before it\na justification for the wff, written on the far right (not the far left as in the book)\nJustifications are basically explanations of how it is that the wffsatisfies condition\n(i) or condition (ii). As for (i), axioms falling under PC are justified by writing \"PC,\"\nperhaps with a number to indicate which of the sample PC theorems the wffhappens\nto be. Axioms falling under K (there's only one of these!) are justified by writing \"K.\"\nAs for (ii), you should list both the inference rule (or definition) involved and the\nlines that served as premises. Applications of US are justified by writing the earlier\nline number and then indicating with the square bracket notation the substitution that\nwas made. Applications of MP and N are marked by \"?MP\" and \"?N\" respectively.\nSo, let's do it. Like the book we'll first prove two theorems in full detail, and then\ngive some methods for abbreviating proofs. K1 and K2 are proved on p. 27; we'll do\ntheorem K1.\nK1\n2(p&q) ⊃2p&2q\n1.\np&q ⊃p\nPC1\n2.\n2(p&q ⊃p)\n(1)xN\n3.\n2(p ⊃q) ⊃(2p ⊃2q)\nK\n4.\n2(p&q ⊃p) ⊃(2p&q ⊃2p)\n(3),[p&q/p, p/q]\n5.\n2p&q ⊃2p\n(2),(4)xMP\n6.\np&q ⊃q\nPC2\n7.\n2(p&q ⊃q)\n(5)xN\n8.\n2(p&q ⊃q) ⊃(2p&q ⊃2q)\n(3),[p&q/p]\n9.\n2p&q ⊃2q\n(7),(8)xMP\n10.\n(p ⊃q) ⊃((p ⊃r) ⊃(p ⊃(q&r))\nPC3\n11.\n(2(p&q) ⊃2p) ⊃((2(p&q) ⊃2q) ⊃(2(p&q) ⊃(2p&2q)))\n(10), [2(p&q)/p, 2p/q, 2q/r]\n12.\n(2(p&q) ⊃2q) ⊃(2(p&q) ⊃(2p&2q))\n(5), (11)xMP\n13.\n2(p&q) ⊃(2p&2q)\n(5), (11)xMP\nYou should go through the proof of K2 yourself. Here's the proof of K3, which\nshows how earlier theorems can be appealed to in new proofs.\n\nK3\n2(p&q) ≡2p&2q\n1.\n2(p&q) ⊃(2p&2q)\nK1\n2.\n2(p&q ⊃p)\n(1)xN\n3.\n2(p ⊃q) ⊃(2p ⊃2q)\nK\n4.\n2(p&q ⊃p) ⊃(2p&q ⊃2p)\n(3),[p&q/p, p/q]\n5.\n2p&q ⊃2p\n(2),(4)xMP\n6.\np&q ⊃q\nPC2\n7.\n2(p&q ⊃q)\n(5)xN\n8.\n2(p&q ⊃q) ⊃(2p&q ⊃2q)\n(3),[p&q/p]\n9.\n2p&q ⊃2q\n(7),(8)xMP\n10.\n(p ⊃q) ⊃((p ⊃r) ⊃(p ⊃(q&r))\nPC3\n11.\n(2(p&q) ⊃2p) ⊃((2(p&q) ⊃2q) ⊃(2(p&q) ⊃(2p&2q)))\n(10), [2(p&q)/p, 2p/q, 2q/r]\n12.\n(2(p&q) ⊃2q) ⊃(2(p&q) ⊃(2p&2q))\n(5), (11)xMP\n13.\n2(p&q) ⊃(2p&2q)\n(5), (11)xMP\nDerived Rules\nThese are not strictly part of the system, but informal compression devices which we\nconvince ourselves by any means necessary don't allow the proof of anything not prov-\nable already, before they were introduced. They're verboten unless each of their appli-\ncations can be justified by regular rules albeit at much greater length.\nDR2\n⊢p≡q →⊢2p≡q\n1.\nα ≡β\nGiven\n2.\nα ⊃β\n(1)xPC\n3.\n2α ⊃2β\n(2)xDR1\n4.\nβ ⊃α\n(1)xPC\n5.\n2β ⊃2α\n(4)xDR1\n6.\n2α ⊃2β\n(3), (5)xPC\nNow a derived rule which is difficult even to state much less prove. It's called Sub-\nstitution of Equivalents, Eq for short. What it does is extend DR2 to all sentential\nenvironments whatsoever.\nYou might find it a bit reminiscent\nof one of the intensionality schemas\nEq ⊢α≡β and ⊢φ(α) →⊢φ(β/α).\nwe considered above. How are they\nrelated?\nIf two wffs are provably equivalent, then you can put one for the other in any the-\norem you like and the result will still be a theorem. Eq is proved by mathematical\ninduction. You show first that the result holds for simple φ's and then that if it holds\nfor φ and ψ, it must hold too for ¬φ and φ∨ψ and 2φ. Part of why DR2 was proved\nfirst is that it helps with that final step, closure under necessitation.\nBack when (not way back when) we said that 2 and 3 are \"dual\" in the sense\nthat (i) 2p is equivalent to ¬3¬p and (ii) 3p is equivalent to ¬2¬p. Is this duality\nrespected by System K? Certainly (ii) holds, for that is how we defined 3. But what\nabout (i)? That'll be our next theorem.\nK5\n2p ≡¬3¬p\n1.\np ≡¬¬p\nPC12 (DN)\n2.\n2p ≡¬¬2p\n(1) [2p/p]\n3.\n2p ≡¬¬2¬¬p\n(2)x(1)xEq\n4.\n2p ≡¬3¬p\nDef3\nNow we can replace 2 by ¬3¬ anywhere we like in a theorem, and vice versa; and\nlikewise with 3 and ¬2¬ (that we had already by the definition of 3). A generaliza-\ntion of this is as follows; it's called 2-3 Interchange, or LMI:\n\nIf α is a theorem, and β is the result of (i) replacing any sequence of modal opera-\ntors by the \"negative\" of that sequence (boxes go in for diamonds and vice versa),\nand (ii) inserting or deleting a single ¬ both before and after the sequence, then ? is\na theorem too.\nProof Sketch: Let A1...An be a sequence of boxes and diamonds, that is., each Ak is\neither 2 or 3 . Let Ak′ be 2 if Ak is 3 and vice versa. We start by showing that\n⊢A1...Anp ≡¬A1′...An′¬p\nBy PC we have\n⊢A1...Anp ≡A1...Anp\nOn the right hand side, replace each 2 by ¬3¬ and each 3 by ¬2¬. This can be\ndone by K5 and the definition of 3, using derived rule Eq. This yields\n⊢A1...Anp ≡¬A1′¬¬ ...¬¬An′¬p\nNow use DN and Eq to eliminate all the double negations and the result is (*).\nThat is still not quite LMI but it's on the way. To show that the two sides are intersub-\nstitutable everywhere, and no matter what wffreplaces p, use US and Eq. Next time: a\nfew more theorems and then we move on to validity in and soundness of K.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Contingent Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/c6f9e3d4d11feee2f154c14d26e741ad_MIT24_244S15_Contingent.pdf",
      "content": "Philosophy 244: #16-- Contingent Identity\nDispensability\nNames have often been seen as linguistic outliers and philosophically problematic.\nThe more verbs and predicates you know, the larger your vocabulary, but it doesn't\nseem to increase your vocabulary to know a lot of names. They seem on the one\nhand descriptive--how otherwise would you find the referent? how otherwise could\nan identity statement involving names be informative?-and on the other hand not--\nGodel could have turned out not to be the author of \"Godel's Theorem,\" but he could\nnot have turned out not to be Godel.\nThese problems would be avoided, or eased, if names were theoretically dispens-\nable, and would not occur in a logically perfect language. Quine argued that this in-\ndeed the case. For each would-be name a, he would have us introduce a one-place\npredicate φa such that <o,w>εV(φ) iff o=V(a). The role of a would then be played by\n(ιx: φax). Instead of ψ(a) we'd say (ιx:φax)ψ(x). Russell's Theory of Descriptions can\nnow be used to eliminate even the iota-phrase.\nHere's a problem that may have occurred to you. Names lack scope. □ψ(a) is\nunambiguous. Definite descriptions having scope, how can a description hope to\ntake the place of a name? Suppose we want to necessitate (ιx:φax)ψ(x). Is the\nresult to be □(ιx:φax)ψ(x) or (ιx:φax)□ψ(x)? As you might expect and hope, it turns\nout to make no difference; the truth value is the same in either case.\nThis should remind us of Russell's result about negation. Scope differences vis\na vis negation collapse if the definite description is uniquely satisfied. Scope differ-\nences vis a vis necessitation collapse if the definite description is uniquely satisfied\nin every world, and by the same object. (This is rigidity.) Given that \"nominal\" definite\ndescriptions are not subject to scope ambiguities, there is no danger of confusion if\nwe write (ιxφax) wherever we would have written a.\nWhat about function symbols? An example of a binary function symbol is + in\narithmetic. It takes two terms t and t' and forms with them an additional term, viz.\nt+t'. Generally speaking if θ is an n-place function symbol and t1... are terms, then\nθ(t1...tn) is a term. V maps θ to a function V(θ) from n-tuples of domain elements to\nWhat's an example of a ternary function\ndomain elements. The evaluation rule is\nsymbol? Can it be decomposed into\nbinaries?\n[Vθ]\nVμ(θ(t1....tn))=Vμ(θ)(Vμ(t1)...Vμ(tn)).\nFunctional terms are dispensable too, it turns out! The work of θ could be done by\nan n+1 place predicate φθ, where φθ(x1....xny)) means that y = the result of applying\nθ to x1...xn. The role of θ(t1....tn) would be played by (ιy: φθ(t1....tny)).\nNote the absence of any world-variable in [Vθ]. Functional terms, like names,\npick out the same thing in every possible world; they are rigid. Similarly it is always\nthe same value of y that makes Vμ(φθ(x1....xny),w)=1. Hence again the truth-value\nof □(ιy:φθ(t1....tny)) ψ(y) always agrees with that of (ιy:φθ(t1....tny)) □ψ(y). Func-\ntional definite descriptions having no scope-indicator role to play, we can write\n(ιy: φθ(t1....tny) wherever we would have written θ(t1...tn).\n\nNon-Rigidity\nDon't rejoice yet, however. All of this is because functional terms have been in-\nterpreted as rigid. A lot of English expressions with a functional look to them not\nare functional no longer. Take oldest-child(Pat) or combined-weight(Jupiter, Mars).\nThese yield a different value in different worlds for a fixed input.\nIf we want to accommodate English functional terms, we need to be looking at\nnon-rigid, world-relative function symbols. While we're at it we may as well look into\nthe possibility of non-rigid names. Otherwise we will have to regard it as a necessary\ntruth that Hesperus = Phosphorus. A necessary truth holds no matter what. How can\na truth holding no matter what require empirical investigation to establish?\nIf we allowed names (or indeed variables) not to be rigid, there can be the same\n\"contingent identity\" phenomenon with them as we saw with definite descriptions:\nthe F = the G, but it could have been that the F , the G.\na = b, but it could have been that a,b.\nx = y, but it could have been that x,y (for some x and y)\nAll of these look at first sight like counterexamples to the classical view of iden-\ntity, which validates as we saw □I: ∀x∀y (x=y ⊃□x=y). The classical view can\nbe defended against \"counterexamples\" of the first sort, by means of scope am-\nbiguity. But there are also prima facie counterexamples involving names (Hespe-\nrus=Phosphorus, Superman=Clark Kent and variables (If x = Hesperus and y =\nPhosphorus , then x=y but ^(x,y), and these, it seems, don't have scope. How then\ncan we hope to arrange for contingent identities involving names or variables?\nImplementation\nSince □I is a consequence of the fact that V(=) includes only ordered triples <o,o',w>\nsuch that o=o', our first thought might be to broaden the interpretation of = so that\n<o,o',w> with o,o' are allowed into V(=). This response however would completely\ninvalidate the Leibniz axiom: x=y⊃(α[x]⊃α[y]). And it would invalidate it even for non-\nmodal instances of α; you could have identicals one of which is, say, an even number\nand the other of which is odd. Not good.\nMessing with the interpretation of = is not the solution. What is? Look again at\nThe first PMG = the IB. If this is to be an example of a contingent identity, what we\nwant is that there's a person Ben in the actual world who's both the first PMG and\nthe IB, and two people Benjamin and Benjie in another world, one of whom is the\nfirst PMG and the other of whom invented bifocals. Let's try to contsruct a counterex-\nample to □I (x=y⊃□x=y) on that model. In the actual world, x and y are assigned\nthe same object, say Ben. In some other worlds, x is assigned Benjamin and y is\nassigned Benjie. Ah hah, but then variable assignments are going to have to become\nworld-relative; instead of μ(x) we'll have μ(x,w), and the rule for evaluating atomic\nwffs will be\n[Vφ'] Vμ(φ(x1....xn),w)=1 iff <μ(x1,w)....,μ(xn,w),w>εV(φ)\n\nAll the other rules remain as before except that in [V∀], we need to generalize\nthe notion of an x-alternative: ρ is an x-alternative of μ iff for every variable y except\n(maybe) x, and every wεW, ρ(y,w)=μ(y,w).\nThis semantics does not verify □I, because μ(x,w) = μ(y,w) ⇒μ(x,u) = μ(y,u).\nAs a result it doesn't verify all instances of I2, Leibniz's axiom. On the other hand it\ndoes validate all instances of I2 in which α and β contain no modal operators. Which\nis maybe all we can expect if we're allowing contingent identity; if x just happens to\nbe y, then things may be possible for x that are not possible for y, e.g. being distinct\nfrom y.\nConverse Carban\nThis is certainly something to try, but a funny result should be noticed right away.\nTalking about interactions between quantifiers and modal operators, we noticed\nthat three of the following four had at least some plausibility, while the fourth was\nriiculous:\nBarcan Formula\n∀x□α⊃□∀xα\nConverse Barcan\n□∀xα⊃∀x□α\nCarban Formula\n∃x□α⊃□∃xα\nConverse Carban\n□∃xα⊃∃x□α\nThe present semantics however validates this fourth formula. Why? Let <WRDV>\nbe any model, w any world, and μ any (world-relative) variable assignment. If Vμ(□∃xα,w)=1,\nthen every world u that w can see has Vμ(∃xα,u)=1; which means that for every such\nu, there is an x-alternative ρu to μ such that Vρu(α,u)=1\nNow the interesting part. Suppose we gather together the objects ou that ρu as-\nsigns to x as u varies. If ρ(u)=ou for each of these worlds, then clearly Vρ(α,u)=1 for\neach u that w can see. But then Vρ(□α,w)=1, whence Vμ(∃x□α,w)=1. So Converse\nCarban, which seemed a moment ago ridiculous, comes out valid.\nCarnap in Meaning and Necessity, one\nWhy absurd? In competitive games there has to be a winner, but there is no one\nof the first book-length treatments of\nquantified modal logic, accepted this\nof whom it is necessary that she will win. It has to be that some card is on top, but\nreasoning, and its supposedly ridiculous\nthere is no particular card which has to be the one on top. Always Zsa Zsa's hus-\nupshot.\nband is young, but none osf these husbands is always young.\nThe only way to make this plausible is to think of the winner as a peculiar sort of\nrole-object, an object which is me in worlds where I win and you in worlds where you\ndo. One can say in these terms that The winner tends to think it was skill, and even\ninvoke that individual anaphorically--and gets sniffy if you tell him it was just luck.\nThe temporal analogue would be to link past and present winners together into a\nsingle quasi-person. This is unnatural in many cases but in others less so, e.g., in\na discussion of democratic ideals we may say that The president has become less\npowerful than the Chair of the Federal Reserve\nIntensional Objects\nEntities obtained by stringing together \"ordinary\" entities, one per world and/or time,\nare called intensional objects. They give us a new and more charitable take on Con-\n\nverse Carban. If there has to be someone in charge of the others, there's an inten-\nsional entity The Boss (or Mr Big) who is necessarily in charge of the others. If the\nfirst bird on a given morning is the only one who can be sure to get a worm, then\nthere's an elusive further character the early bird who always gets the worm.\nHere's the problem: on the intensional object interpretation, which is what we're\ntrying now, Converse Carban comes out valid. But it shouldn't if we're interested in\ncontingent identity systems, for these are supposed to weaker than earlier systems,\nand Converse Carban wasn't a theorem of those earlier systems.\nThis kind of trouble arises because we're allowing intensional objects to be in-\ntroduced at will. Suppose we try to limit the construction somehow. An intensional\nobject is a function I from worlds into the domain. A model as a quintuple <WRDIV>\nwhere I is a set of intensional objects. Variable assignments μ will now take variables\nnot to domain elements but members of this set. Instead of μ(x,w) we now have\nμ(x) = I, a function from worlds to regular objects. An x-alternative to μ is a ρ taking\nevery y distinct from x to the same intensional object as μ; ρ(y)=μ(y).\n[Vφ\"] Vμ(φ(x1....xn),w)=1 iff <μ(x1)(w)....μ(xn)(w),w>εV(φ)\n[V∀] Vμ(∀xα,w)=1 iff Vρ(α,w)=1 for every x-alternative ρ of μ\nNotice something funny here. When we're interpreting predicates, variables con-\ntribute regular \"extensional\" objects, members of the domain: μ(x)(w) = I(w) = o.\nWhen we're working with quantifiers, they range over intensional objects, or functions\nfrom worlds to domain-elements.\nA good portion of Carnap's Meaning &\nNecessity is devoted to defending this\ndouble-dealing, which he called \"The\nLogical Systems\nMethod of Extension and Intension,\" and\nQuine called \"Carnap's curious double\nHow is contingent identity to be dealt with axiomatically? The Leibniz axiom has got\ninterpretation of the variables.\"\nto be limited so that α is non-modal; in fact it suffices to apply it just to predicates:\nI2\" x=y⊃(φ(x)⊃φ(y) .\nS+BF with the addition of I1 and I2\" will be S+CI. Soundness is easy. For complete-\nness we again need a canonical model. Everything is as before except we have to\nsay what will play the role of I, the set of intensional objects. For each w, let Ix(x)(w)\n= the first y such that x=yεw. I is the set of Ix for each variable x, and the canonical\nassignment μ takes each x to Ix. As usual, <x1....xn,w>εV(φ) iff φ(x1...xn)εw.\nProp. 18.1 Vμ(α,w)=1 iff αεw.\nCompleteness follows as before. If α is valid then it holds in all worlds of all mod-\nels built on suitable frames. If the canonical model is built on the right sort of frame,\nthen α holds in all worlds of the canonical model, that is, in all maximal consistent\nsets. A statement belonging to all maximal consistent sets is a theorem. Hence ev-\nery valid α is a theorem, as promised.\nThere's some real flexibility in the amount of contingent identity (distinctness)\nwe choose to allow. Say we want a semantics validating □I (x=y⊃□x=y) but not\nnecessarily □NI (x , y⊃□x , y). Then we stipulate that when wRu, if I1 and I2\nagree on w, they agree on u. While not stipulating that when wRu, if I1 and I2 agree\non u, they agree on w. NEXT WEEK: quantifying over all intensional objects, and\nwhy the results are not axiomatizable.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Counterfactuals, Neighborhood Semantics, Probability, Predicative Necessity, etc",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/543869bb7ec9e3484443fd245fbc3625_MIT24_244S15_Counterfact.pdf",
      "content": "Philosophy 244: #8-- Counterfactuals, Neighborhood Semantics,\nProbability, Predicative Necessity, etc.\nModal operators are non-truth-functional; the truth-value of 2α at a world is not deter-\nmined by α's s truth-value at that world. Are modal operators X-functional for any other X?\nYes. If you let the truth-set |α| of α in a given model be the set of worlds (in that model) at\nwhich α true, then the truth-value, and indeed truth-set of 2α is determined by that of α .\nLet R(w) be the set of worlds w bears R to; then\n2α is true at w iffR(w) ⊆|α| .\n3α is true at w iffR(w) overlaps |A|-- R(w) ∩|α| = ∅\n.Neighborhood semantics\nOnce you see that the clauses can be written this way it opens your mind a bit. Why not an\noperator ∆such that\n∆α is true at w iffR(α) = |α|\n∆α is true at w ff|α| ⊆R(w)\n∆α is true at w iffR(w) ∩|α| contains exactly one world\nTo do this in full generality, we replace R, a relation between worlds, with R, a relation\nworlds bear to sets of worlds. Rules for truth take the form\n∆α is true at w iffwR|α|\nThis style of modal semantics is called neighborhood semantics. <W,R> is a neighborhood\nframe. Regular old relational frames can be treated as the special case of neighborhood frames\nwhere w bearing R to a set corresponds to its bearing R to every member of the set. Neigh-\nborhood semantics extends to binary modal operators as follows:\nα * β is true at w iffR(w, |α|,|β|)\nOne such binary operator is the strict conditional ⇒. The intended meaning of α ⇒β\nis that α implies β, or Necessarily if α then β. Given that Necessarily, if p&q, then p, we'd\nexpect it to be true at each world that (p&q)⇒p. The truth-rule that gets us this result is\nα ⇒β is true at w iff|α| ⊆|β|\nOr maybe |α|∩X ⊆|β|∩X for some\nsuitable X. Let's ignore this complica-\ntion.\nCounterfactual Conditionals\nAnother is the counterfactual conditional 2→. Read α2→β as if it were to be that α, then\nit would be that β. If you'd won the lottery, you'd be rich, If I were to flip this coin a million\ntimes, it would come up heads at least once. If kangaroos lost their tails, they'd topple over.\nThe corresponding strict conditonals are not true, because it's possible that in some faraway\nworld you woudn't be rich because you were already 300 million dollars in debt. But in nearby\nworlds, it seems, β holds if α does. First stab at the truth rule:\nα > β is true at w iff|α| ⊆|β| limiting ourselves to nearby worlds, that is, |α|∩N ⊆|β|∩N\nProblem: \"nearby\" cannot be the same for every α, α may fail in all nearby worlds, making\nthe conditional trivial. If cats barked, they'd be scary. Second try.\nα > β is true at w iffnearby α-worlds are β-worlds.\n\nSuppose a coin is flipped and I am offered a chance to bet on the outcome. I decline, but if I\nhad bet, it would have been on heads. I want to say that If I had bet, I would have won, The\ncoin could very easily have come up tails, though; including in nearby worlds where I bet. So\nthere are nearby worlds where I bet but lost.\nα > β is true at w iffthe nearest α-world is a β-world. (Stalnaker)\nWhat if there is no nearest |α|-world? If I you were over 5' tall, you could ride the roiler\ncoaster. There's no closest way of being over 5' tall, but still the conditional seems true.\nWhy? Well, you can ride in all close-enough such worlds. Some You're 5' tall and can ride the\nroller coaster-worlds are closer than any You're 5' tall and can't ride it-worlds\nα > β is true at w iffsome u in |α|∩|β| is more like w than any v in |α|∩|β| (Lewis)\nAssess for validity, using Stalnaker's truth-conditions: the nearest α-world is a β-world.\nIf Hoover spoke Russian, he'd be\nbilingual....If she were in France, she\nModus Ponens: p⊃((p\n→q)⊃q)\nwouldn't be in Paris....If Spain had\nfought with the Allies or the Axis....\nTransitivity: (p 2→q) ⊃((q 2→r) ⊃(p 2 →r))\nContraposition: (p 2→q) ⊃(¬q 2 →¬p)\nSimplification: ((p∨q) 2→r) ⊃(p 2 →r)\nProbabilistic Semantics\nThe standard semantics for classical logic is two-valued: every sentence is evaluated either as\ntrue or false. What if we generalized that and allowed sentences to take arbitrary real values\nbetween 0 and 1?\nOf course, you need a philosophical motivation for this. You might be interested in vague-\nness and an evaluation of 1/2 means that the sentence is midway between being true and\nfalse. If you are interested in partial truth, the 1/2 might mean that the sentence can be di-\nvided into two parts of which only one is true. Snow is white and expensive is a half-truth in\nthat sense. Or, if you're interested in probability, the 1/2 signifies that there is half a chance\nin the speaker's mind of the sentence being true. The rules can in some cases be given exactly\nthe same form: (we'll write P for V):\nP(¬α) = 1 - P(α)\nBut not always\n??P(α&β) = min(P(α), P(β))??\nImagine β = ¬α.\n??P(α&β) = P(α) × P(β))??\nImagine β = α?\nP(α&β) = P(α) × P(β)) provided they're independent;\nYes but suppose they aren't.\n|\n×\nA Popper function is any binary func-\nP(α&β) = P(α\nβ)\nV(β))--YES\ntion P taking pairs of sentences to real\nnumbers between 0 and 1 (inclusive),\nThe issue of how to probabilistic semantics for classical logic has been studied by Hartry\nsubject to six conditions\nField in a paper called \"Logic, Meaning, and Conceptual Role.\" Here we try to extend the idea\n1. P (A|A)=1\nto modal logic. Two strategies have been suggested, both employing conditional probabiliity\n2. P(B|A) is not always 1\nbut in quite different ways. The first understands worlds as hypotheses to be conditioned on,\n3. if P(B|A)=1 and P(A|B)=1 then for\nand truth in a world as high probability conditional on a hypothesis:\nall C, P(C|A)=P(C|B)\n4. P(C&B|A) = P(C|B&A)\nP(2α) = 1 ifffor all ω P(α|ω) = 1\n× P(B|A)\n5. P(C&B A)<P(B|A)\nThe second treats the probability functions themselves as worlds. P' is accessible from P\n|\n6. P( B A)=1-P(B A), unless for all C,\niffP' is obtainable from P by conditioning on some hypothesis A, that is, for all B and C,\n¬ |\n|\nP(C|A)=1\nP'(C|B) = P(C|B&A). P(2α) is higher or lower depending on the probabilities assigned to α\nMonadic probability is P(B) = P(B|T)\nby probability functions P can see.\nwhere T is some fixed tautology.\n\nP(2α) = greatest lower bound of P'(α) as P' ranges over functions accessible from P.\nP(3β) = the least upper bound of P'(β) as P' ranges over functions accessible from P.\nThe philosophical interpretation is not so clear to me. Imagine a thinker who's in a par-\nticular epistemic state but can imagine being in various other such states. If P represents the\nthinker's actual epistemic state, \"the functions accessible to P represent those ... epistemic\nstates that the agent... would recognize as distinct and intelligible alternatives\" that she could\nreach by conditionalizing.\nThe meaning of 3α is that one can imagine coming to think that α. Of course, the agent\ncould just conditionalize P' on α to obtain a P\" that made α certainly true. The problem\nis that this is not a possibility that our agent recognizes while in epistemic state P. She is\nsupposedly unable to fill in the details of his thought experiment with sufficient specificity.\nHer confidence in 3α corresponds the agent's ability to \"fill in, with a sufficient degree of\nspecificity, the details of a thought experiment\" wherein it makes sense to believe that α.\nP(3α) will take an intermediate value if the agent can see her way through to epistemic\nstates in which α is not certainly false but none in which α is certainly true.\nMulti-Modal Logic\nThe language contains several 2-operators 21, 22, etc. They are all defined over the same set\nof worlds but the accessibility relations are different. A model is <W,R,C> except that R is\nnot a single accessibility relation but a list of them R1, R2, etc. Tense logic is one application;\n21 means it always will be the case, 22 means it always has been the case; 31 means it\nwill sometime be the case and 32 that it once was the case. R1 is the relation of temporal\nprecedence and R2 the relation of coming after in time. Given that the relations are converses\nwe can really get by with one of them in our truth rules; let it be the later-than relation.\nV(21α,w) = 1 iffV(α, u) =1 for all u later than w (wRu)\nV(22α,w) = 1 iffV(α, u) =1 for all u earlier than w. (uRw)\nBoth boxes appear to satisfy K:\nIf it will always be that α ⊃β, then if it will always be that α, it will always be that β\nIf it always was that α ⊃β, then if it always was that α, it always was that β\nWhat about T?. What about S4 and S5? What about these two hybrid axioms linking the\nwas and will-be operators? (Example adapted from Humphrey Bogart in Casablanca: \"We'll\nalways have Paris.\")\nIs TL2 correct? Some say not on the\ntheory that the past is fixed, the future\nTL1 If we have Paris now, then we will always have (had) Paris in the future. p⊃2132p.\nopen. Should there turn out to be a\nTL2 If we have Paris now, then we were always in the past going to have Paris. p⊃2231p.\nsea-battle tomorrow, does that make it\ntrue now that there will be a sea battle\nSo-called two-dimensionalism in the philosophy of language falls under this heading too. 21\ntomorrow?\nis regular old metaphysical necessity. 22 is something like conceptual or epistemic necessity\nor a priority. Julius invented the zip is metaphysically contingent but conceptually necessary.\nSome popular glosses:\n21p is true iff\n22p is true iff\nwhat p actually says had to be true\np had to expresses some truth or other\nno matter which world had been actual, p\nno matter which world is actual, p\np could not have failed to be true\np cannot fail to be actually true\nYou snooze ⊃You lose\nThe combination of these 21 with @ greatly increases the language's expressive power,\nYou snooze\nou\nsno\n⊃Y\nsnooze\nYou\noze\n@(You lose)\nwe'll see later. It comes out clearly in quantificational logic. There could have been more stars\n@(You snooze)\n⊃\n⊃You lose\nthan there are. Adding\n@(You snooze) ⊃@(You lose)\n22 in increases it further.\n\nNecessity as a Predicate\nCan we construct a theory T of predicative necessity? Let's agree that the theory has to\ninclude arithmetic and that the necessity predicate has to satisfy conditions A1-A4, the Mon-\ntague conditions. [A] is the Godel number of sentence A.\n1. T ⊢N([P])⊃P\n2. T ⊢N([N([P])⊃P])\n3. T ⊢N([P⊃Q])⊃(N([P]⊃N([Q]))\n4. T ⊢N([P]) if P is a truth of logic or arithmetic\nAny such theory is bound to be inconsistent, Montague shows. He begins by letting λ be\na \"fixed point\" of the formula ¬N(x, meaning it's a theorem of arithmetic that λ ≡¬N([λ]).\nAll the numbered formulas are meant to be theorems of T.\n1. λ ⊃¬N([λ])\n(theorem of arithmetic)\n2. ¬N([λ]) ⊃λ\n(theorem of arithmetic)\n3. N([λ]) ⊃λ\n(A1)\n4. (N([λ]) ⊃λ) ⊃((λ ⊃¬N([λ])) ⊃¬N([λ])\n(propositional logic)\n5. (λ ⊃¬N([λ])) ⊃¬N([λ])\n(modus ponens 3.4)\n6. ¬N([λ])\n(modus ponens 1, 5)\n7. λ\n(modus ponens 2, 6)\n8. N([λ ⊃¬N([λ])])\n(1, A4)\n9. N([¬N([λ]) ⊃λ])\n(2, A4)\n10. N([N([λ]) ⊃λ])\n(A2)\n11. N([(N([λ]) ⊃λ) ⊃((λ ⊃¬N([λ])) ⊃¬N([λ])])\n(4, A4)\n12. N([λ ⊃¬N([λ]) ⊃¬N([λ])\n(A3 on 10,11)\n13. N([¬ N([λ])])\n(A3 on 8,12)\n14. N([λ])\n(A3 on 9, 13)\n15. ¬N([λ])\n(modus ponens on 1, 7)\n16. N([λ]) & ¬N([λ])\n(conjunction of14, 15)\n17. !!!!!!!!!!!!!!!!\nIntuitively what's meant to be going is this. Assume for contradiction that λ is not true.\nThen what λ expresses is not the case, so λ is necessary. But then λ is true-since everything\nnecessary is true--contradicting our assumption. This concludes the proof that λ is true. The\nproof is of a purely logical nature; so its conclusion is necessarily true, that is, N([λ]). N([λ])\nis the negation of λ though, which was just proven. Contradiction.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Existence and Identity",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/5bc89ee6e82c6dd37d2bcf90c37b45bd_MIT24_244S15_Existence.pdf",
      "content": "Philosophy 244: #14-- Existence and Identity\nExistence Predicates\nThe problem we've been having is that (a) we want to allow models that invalidate\nthe CBF (□∀xα⊃∀x□α), (b) these will have to be models in which w can see w'\nalthough Dw has members not in Dw′, (c) models like that invalidate one of our theo-\nrems, namely □(∀xφ(x)⊃φ(y)) (= □∀1).\nSo, for instance, it does hold necessarily\nRemember how the problem arises. Validity of a wff\nis defined as V ( ,w)=1 for\nthat if everyone is happy, Kripke is\nα\nμ α\nhappy, because the antecedent holds in\nall w and all μ assigning members of Dw to α's free variables. The reason μ is limited\nworlds where Kripke does not exist.\nto members of Dw is that otherwise you could make ∀xφ(x)⊃φ(y) (without the box)\nfalse, just by assigning y a member of D-Dw.\nOK, but there's a simple solution to this. You can stipulate in ∀1 itself that y has to\nbe one of the existing things: (∀xφ(x)&Ey)⊃φ(y). This requires an existence predi-\ncate, which is governed by the obvious rule:\n[VE] <x,w>εV(E) iff xεDw.\nThe availability of an existence predicate E takes some of the pressure off of μ as\nthe guarantor of appropriate instantiation, thus allowing us to redefine validity so that\nVμ(α,w) has to be 1 for all w and all μ as well. ∀1 will not be valid on this approach\nbut we can replace it with\n∀1E\n(∀xα&Ey)⊃α[y/x].\nAn axiom of this sort is the standard replacement for ∀1 in so-called free logic:\nlogic free of existential assumptions.\nExistence Systems\nLPCE+S is defined as follows.\nAxioms\nS'\n⊢α for each α an LPC substitution instance of an S-theorem,\n∀1E\n⊢(∀xα&Ey)⊃α[y/x]\n∀⊃\n⊢∀x(α⊃β)⊃(∀xα⊃∀xβ)\nVQ\n⊢α≡∀xα where x is not free in α\nUE\n⊢∀xEx\nRules\nNE\n⊢α ⇒⊢□α\nMP\n⊢α, ⊢(α⊃β)⇒⊢β\nUG\n⊢α⇒⊢∀xα\nUG□∀n ⊢α1⊃□(α2⊃...□(αn⊃□β)...)⇒⊢α1⊃□(α2⊃...□(αn⊃□∀xβ)...) -- x not free in αi\nA number of standard results follow, including\n∀1'\n⊢∀y(∀xα⊃α[y/x])\n\nRBV\n⊢∀xα≡∀yβ -- α and β differ only in that α has free x where β has free y\nQR\n⊢∃y(α[y/x]⊃∀xα)\nEtc.\nThis axiomatization is sound w.r.t. the new definition of validity. Take ∀1E. Assume\nfor contradiction that Vμ(∀xα(x),w)=1 and Vμ(Ey,w)= 1 but V(α[y/x],w)=0. Choose ρ\nPR basically says that V doesn't care\nso that ρ(x)=μ(y). By the Principle of Replacement (241), Vρ(α(x),w)=0. Vμ(Ey,w)=1,\nwhether an object is picked out as ρ(x)\nor μ(y).\nso ρ(x)εDw. But then Vμ(∀xα(x),w)=0 after all, since ρ is an x-variant of μ.\nBy (V∀'), which says that Vμ(∀xα,w)=1\nCompleteness\niff Vρ(α,w)=1 for each x-variant ρ of μ\nsuch that ρ(x) ε Dw.\nAgain the procedure is to construct a canonical model. Assume Λ is a consistent set\nof L-wffs in LPCE+S, and that L is an infinitely proper sublanguage of L+. A set ∆\nof L+-wffs has the □∀-property iff\n(i) for every α of L+ and variable x, there is a variable y s.t. Ey&(α[y/x]⊃∀xα)ε∆\n(ii) for β1...βn and α in L+, and every x not free in βi, there's a variable z such that\n□(β1 ⊃...□(βn⊃□(Ez⊃α[z/x])...)⊃□(β1⊃...□(βn⊃□∀xα)...)\nProp. 16.1 Any consistent set Λ of L-wffs can be extended to a consistent set Γ of\nL+-wffs with the □∀-property.\nProp. 16.2 If Γ is a maxiset with the □∀-property, and □α<Γ, then there's a consis-\ntent set ∆with the □∀-property such that □-(Γ)∪{¬α}⊆∆.\nThe canonical model is defined as before except that Dw is the set of variables x\nsuch that Exεw.\nProp. 16.3 Vσ(α,w)=1 in the canonical model iff αεw.\nFrom this it follows that the canonical model of LPCE+S validates exactly the the-\norems of LPCE+S. Completeness follows as before for any S such that the frame of\nthe canonical model of LPCE+S is an S-frame. That includes all of the main systems\nwe have been working with.\nPossibilist Quantification\nThe way we've been interpreting the Barcan Formula makes it look as though it\npresupposes that the same things exist in every world, or at least that you never get\nnew things as you move from w to a world u that w can see. If you do get new things\nthen the fact that everything in w is necessarily φ leaves it wide open that something\nin u isn't φ even accidentally. And that appears to go directly against BF. Likewise\nBFC assumes, apparently, that things never disappear. If they do then existence\nbecomes a counterexample to □∀xφ⊃∀x□φx.\nDoes CBF really assume this, though? It does if you interpret ∀x, uttered in con-\nnection with a world w, as ranging over just the things that exist in w. Another option\nwould be to interpret it as ranging, whenever it is used, over all possible things. An\nexample of this from English might be \"there are things which could have existed but\n\ndon't actually exist, e.g., the 1998 Moose Jaw Winter Olympics.\" The first interpre-\ntation is called \"actualist,\" the second \"possibilist.\" Now that we have an existence\npredicate, the \"actualist\" interpretation isn't forced on us; an actualist quantifier if is\nwantedn can be defined in terms of a possibilist one and the existence predicate.\nUsing \"∀\" for the possibilist quantifier and \"Π\" for the actualist one, we can simply say\nthat\nDefΠ\nΠxα =df ∀x(Ex⊃α).\nThe rule for Π is what above we called [V∀']:\n(VΠ) Vμ(Πxα)=1 iff Vρ(α) = 1 for every x-alternative ρ of μ such that ρ(x)εDw.\nThe rule for ∀can now go back to something very like a constant domain rule:\n(V∀) Vμ(∀xα)=1 iff Vρ(α) = 1 for every x-alternative ρ of μ such that ρ(x)εD=∪wDw\nNow it seems we can have our cake and eat it too. We can stick to our original\nconstant domain rule for the quantifiers without losing access to the expressive pos-\nsibilities opened up by allowing domains to vary. BF and CBF come out valid--but\nonly formulated in terms of the possibilist quantifier ∀. Formulated in terms of Π they\nare not valid because domains are in fact changing from world to world; this affects\nthe interpretation of predicate E and hence that of Π.\nSuppose we want to get, say LPC+T without BF or CBF, but using, not quite a\nconstant domain semantics, but a constant domain rule for the universal quantifier,\nwhich is what made the constant domain semantics so convenient in the first place.\nFirst, let your language be LPCE, which has the possibilist quantifier ∀and E.\nSecond, let your models be variable domain models with reflexive frames.\nThird, use the \"constant domain\" rule (V∀) for your evaluations.\nFourth, replace each occurrence of ∀x(Ex⊃α) in the resulting validities with Πxα.\nFifth, erase all formulas still containing ∀.\nSixth, the formulas remaining are the desired LPCE+T, bearing in mind that your\nuniversal quantifier is now written Π.\nIdentity\nOrdinary, non-modal predicate calculus often makes special provision for a binary\npredicate intended to express identity. Strictly speaking the predicate should be a\ncapital letter P and it should appear before its two arguments, as in Pxy. But the\npractice has long been to write it \"=\" and allow it to appear between its arguments,\nwhich yields the more familiar \"x=y\".\nThe semantics of identity what you'd expect. If <DV> is a model for LPC then V(=)\nis {<o,o>|oεD}. It follows that Vμ(x=y)=1 iff μ(x)=μ(y).\nA complete axiomatic basis for LPC with identity is given by adding two axioms,\nthe Laurie Anderson axiom.\nAfter a song on Big Science called \"Let\nx = x.\"\nI1 x=x\nand the Leibniz axiom\n\nI2 x=y⊃(α⊃β) - β has y free in some or all of the places where α has x free\nNow let's look at adding identity to modal LPC. For simplicity we limit ourselves\nto systems which satisfy BF. S+BF+I1+I2 will be written S+I; BF will be taken for\ngranted. A surprising fact that makes the whole enterprise interesting:\n□I x=y⊃□x=y\nProof:\n(1) x=y ⊃(□x=x ⊃□x=y)\nI2\n(2) □x=x ⊃(x=y ⊃□x=y)\n(1)×PC\n(3) □x=x\nI1×N\n(4) x=y ⊃□x=y\n(2)(3)×□P\nIt may seem easy to think of counterexamples, e.g.,\nthe person who lives next door is the mayor\nthe number of planets is 8\nMichelle's husband is the president\nmy favorite color is red\nThe thing to notice for now is that these statements link not variables but definite de-\nscriptions. So the theorem as stated doesn't apply. It doesn't imply that if my favorite\ncolor is red, then necessarily it is red. Why the nature of the referring term should\nCompare a temporal example. Sparky's\nmake so much of a difference is something we'll have to come back to, after looking\nage = 8. Dogs are always their-age\nyears old. So, Sparky is always eight\nat definite descriptions.\nyears old.\nDiversity\nNecessity of identity is one thing, necessity of diversity is something else. You'd think\nthey went together but it depends. Some versions of S+I. but not all (all where S\nextends B) have in addition\n□NI x,y ⊃□x,y\n(1) ¬□x=y ⊃x,y\n□I×PC\n(2) ^x,y ⊃x,y\n(1)×□^I (□^ Interchangeability)\n(3) x,y ⊃□x,y\n(2)×DR4\nDR4 = ⊢(^α⊃β) ⇒⊢(α⊃□β). DR4\ndepends on the Brouwer axiom.\nHow can you have contingent distinctness without contingent identity? The an-\nswer is that maybe a world where x and y are distinct can see a world where they're\nidentical, but not the other way around. If accessibility is symmetrical, as in system B\nor above, this can't happen; it should come as no surprise then that it's B you need\nto deduce □NI from □I. We'll use S+□NI for the result of adding □NI to S+I.\nNext time, identity and descriptions.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Identity and Descriptions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/ba7df6b4381a2029b712d2e4081e8872_MIT24_244S15_Identity.pdf",
      "content": "Philosophy 244: #15-- Identity and Descriptions\nThe last class ended with a paradox. It's a theorem of quantified modal logic with\nidentity that x=y⊃□x=y. But this conditional seems false when applied to\nThe first PM General = the inventor of bifocals.\nThat is, it seems false that\nThe first PM General = the inventor of bifocals ⊃□(The FPMG = the IB)\nThere is perhaps a way of reading the consequent so that it comes out true:\nConcerning the x and y who were FMPG and IB, necessarily x = y.\nBut it remains that there's another, and more natural reading, where it comes out\nfalse. What gives?\nA key feature of The first PMG = the inventor of bifocals is that it's formulated with\ndefinite descriptions and not variables. Bertrand Russell way back when had already\nnoticed problems with these. Take\nThe present king of France is bald.\nbearing in mind that France is (and was) a republic. In the absence of a present\nking of France this statement is apt to seem false. But for the same reason\nThe present king of France is not bald.\nseems also false. Isn't this a violation of the laws of logic (excluded middle,\nP∨¬P)? The answer is that it is if there's a (nonexistent) individual you're talking\nabout here, but if not, well then maybe not. But this doesn't really get us very far,\nbecause the question remains, how does it manage not to violate excluded middle?\nHow can The KoF is bald or The KoF is not bald be true if there's nothing for the\nsingular term to refer to? Consider for that matter\nThe king of France (largest prime number, perfect cocktail,...) does not exist.\nRussell thought it was nonsense to hear such a sentence as predicating of a\nnonexistent object \"its\" property of not existing. But how can a sentence t is P, where\nt is a term and Q a predicate, fail to predicate Q-ness of t?\nThis is where Russell had a new idea. If the term t is a variable or name, it can't.\nBut if it's a definite description, something of the form the φ, it can. The φ is ψ\nmeans, and is true if and only if,\n(a) there's a least one φ\n(b) there's at most one φ\n(c) all φs are ψs.\nTake The first PMG invented bifocals. It is true iff there's at least one first PMG,\nthere's at most one first PMG, and all first PMGs invented bifocals. This makes clear\nintuitive sense and can even be formalized in LPC with identity.\n\nThe φ is ψ = ∃xφ(x)&∀x∀y(φ(y) & φ(z)⊃y=z) & ∀x(φ(x)⊃ψ(x))\nThe way The king of France is bald and The king of France isn't bald manage to\nboth be false is that the second isn't really the negation of the first. One says that\nthere's a unique KoF and he's bald, the other that there's a unique KoF and he's not\nbald. The first conjunct fails in both cases. To negate The KoF is bald we'd have to\nsay that one conjunct fails or the other: either there are no French kings, or there\nare at least two, or not all of them are bald. This is a possible reading of The KoF is\nnot bald, just not the most natural one. The sentence can be translate into logic-ese\neither as the negation of The KoF is bald (in which case it's true) or as attributing\nthe negation of baldness to the KoF (in which case it's false). The confusion arises\nbecause there are two ways of reading not in connection with a definite description:\nExternal negation ¬(∃xφ(x) & ∀y∀y(φ(x)&φ(y)⊃y=x) & ∀x(φ(x)⊃ψ(x)))\nInternal negation\n∃xφ(x) & ∀y∀y(φ(x)&φ(y) ⊃y=x) & ∀x(φ(x)⊃¬ψ(x))\nThis can be simplified we write the conjunction of (a) and (b) as ∃!xφ(x) (E-shriek).\nThen the two readings are\nExternal negation ¬(∃!xφ(x) & ∀x(φ(x)⊃ψ(x))) and\nInternal negation ∃!xφ(x) & ∀x(φ(x)⊃¬ψ(x))).\nAn alternative and more popular terminology focuses on the scope of the quan-\ntifier(s) rather than the operator. A quantifier takes wide scope if the operator lies\nwithin its scope; it takes narrow scope if it lies within the scope of the operator. Exter-\nnal negation corresponds to the narrow scope reading and internal to the wide scope\nreading.\nRussell was able to show that if ∃!xφ(x)\nThe contrast between wide and narrow scope readings takes on an even greater\nthen the two readings agree in truth-\nvalue; in that case the contrast is only\nsignificance when it comes to identity statements. On Russell's account The φ = the\nsyntactic, not truth-conditional.\nψ becomes\n∃!xφ(x) & ∃!xψ(x) & ∀x∀y(φ(x)&ψ(y)⊃x=y).\nScope ambiguities arise when we try to negate the identity.\nNarrow Scope = External Negation ¬(∃!xφ(x) & ∃!xψ(x) & ∀x∀y(φ(x)&ψ(y)⊃x=y)).\nWide Scope = Internal Negation ∃!xφ(x) & ∃!xψ(x) & ∀x∀y(φ(x)&ψ(y)⊃¬x=y).\nAs before, as long as the descriptions are uniquely satisfied these come out with the\nsame truth value; so the contrast is somewhat trivial. It quickly stops being trivial,\nthough, when we switch operators. Just as with ¬, there are two places for the □to\ngo relative to the quantifiers.\nNarrow Scope = External Necessitation □(∃!xφ(x) & ∃!xψ(x) & ∀x∀y(φ(x)&ψ(y)⊃x=y)).\nWide Scope = External Necessitation ∃!xφ(x) & ∃!xψ(x) & ∀x∀y(φ(x)&ψ(y)⊃□x=y).\nThis is a distinction we've already bumped against. Why does The FPMG = the\nIB usually seem contingent but sometimes necessary? There are two ways to think\nof the matter. It's necessary is that its internal necessitation is true; it's contingent in\nthat its external necessitation is false.\n\nInternal/external is important in lots of quantified modal statements, whether they\ninvolve identity or not. Quine tries to convince us that there is no coherent property\nof being necessarily odd by pointing out that Nine is necessarily odd seems true\nwhile The # of planets is necessarily odd seems false. The latter though is ambigu-\nous between an internal, wide scope reading and an external, narrow scope reading.\nAnd the wide scope reading is true. The falsity of the narrow scope disambiguation\nis irrelevant since it doesn't even purport to attribute a de re modal property to nine;\nrather it attributes de dicto necessity to The # of planets is odd\nAccording to Russell, it follows from his analysis that definite descriptions aren't\ngenuine singular terms. The appearance of a unitary term dissolves under analysis.\nAnother way of saying the same thing is that a phrase like the inventor of bifocals\nreceives not an explicit definition but a contextual one. An explicit definition would\ntell us what it stands for. The proposed contextual definition assigns no referent but\nexplains the phrase's impact on the larger statements in which it is liable to occur.\nmade by the entire sentences in which it occurs.\nAll that having been said, Russell did want a unified notation for embedded de-\nscriptions, and he chose the following: ψ([ιx]φ(x)). This should be read as charac-\nterizing [ιx]φ(x) (the first PMG) as ψ (an inventor, say). Logically and linguistically\npeople have come to take the iota notation to express a constituent after all: a kind of\nbinary quantification. This is also a popular construal of all, some, many, and so on,\nwhich makes for a nice pattern:\n(every x:φ(x))ψ(x)\n(many x:φ(x))ψ(x)\n(the x:φ(x))ψ(x)\nThe internal/external distinction for definite descriptions in modal contexts now\nbecomes an analogue of the de re/de dicto ambiguities encountered earlier, as in,\nAll that glistens is not gold (external negation, despite appearances) and If you know\nsomething, it's got to be true (external necessitation, sometimes fallaciously made\ninternal).\nNot to say an internal reading is out of\nthe question: if I know something, I can't\n□∀x (Fx⊃Gx)\nbe wrong.\n∀x (Fx⊃□Gx)\n□(ιx:Fx) Gx\n(ιx: Fx) □Gx\nAgain, if the operator is ¬, scope ambiguities are truth-conditionally irrelevant if\nthere's a unique φ. Nothing lik that holds for □, so we have to be super-careful about\nthe scope of definite descriptions in modal contexts.\nNames and Function Symbols\nJust saw how to add definite descriptions to the modal language; we treat them as\nnewfangled quantifiers. The result though is that definite descriptions aren't referring\nphrases. And so we are still without any way of doing formally what we apparently do\nall the time in English, namely, refer to things by use of terms.\n\nHere's how to do it, starting with individual constants or names. Names a, b, ...can\noccur in exactly same nonquantificational positions as variables. The difference is\nthat each one is interpreted as standing for a \"fixed\" object o = V(a), as opposed to a\n\"variable\" object given by the variable assignment μ. Using \"term\" to cover both indi-\nvidual variables and individual constants, we can say that if φ is an n-place predicate\nand t1...tn are terms, then φ(t1...tn) is a wff.\n[Vt] Vμ(φ(t1...tn),w)=1 iff <Vμ(t1)....Vμ(tn),w>εV(φ).\nNotice that V assigns a name a the same object in every world, or more exactly, a\nname stands for an object period; it's o = V(a), not o = V(a,w).\nAn idea advocated by Quine is that names are theoretically dispensable. For each\nwould-be name a we could have a one-place predicate φa such that <o,w>εV(φ)\niff o=V(a). The role of a would then be played by (ιx: φax). Instead of ψ(a) we'd\nsay (ιx:φax)ψ(x). If we like Russell's Theory of Descriptions, it can now be used to\neliminate even the iota-phrase.\nHere's a problem that may have occurred to you. Names lack scope. □ψ(a) is\nunambiguous. Definite descriptions having scope, how can a description hope to\nThis should remind u of Russell's result\ntake the place of a name? Suppose we want to necessitate (ιx:φax)ψ(x). Is the\nabout negation. Scope differences vis\nresult to be □(ιx:φax)ψ(x) or (ιx:φax)□ψ(x)? As you might expect and hope, it turns\na vis negation collapse if the definite\ndescription is uniquely satisfied. Scope\nout to make no difference; the truth value is the same in either case.\ndifferences vis a vis necessitation\nWhat about function symbols? An example of a binary function symbol is + in\ncollapse if the definite description is\narithmetic. It takes two terms t and t' and forms with them an additional term, viz.\nuniquely satisfied in every world, and by\nthe same object. (This is rigidity.) Since\nt+t'. Generally speaking if θ is an n-place function symbol and t1... are terms, then\nthere is no need for \"nominal\" definite\n(θt1...tn) is a term. V maps θ to a function V(θ) from n-tuples of domain elements to\ndescriptions to play a scope indicator\nrole there is no danger of confusion if we\ndomain elements. The evaluation rule is\nwrite (ιxφax) wherever we would have\nwritten a.\n[Vθ]\nVμ(θ(t1....tn))=Vμ(θ)(Vμ(t1)...Vμ(tn)).\nFunctional terms are dispensable too, it turns out! The work of θ could be done by\nWhat's an example of a ternary function\nan n+1 place predicate φθ, where φθ(x1....xny)) means that y = the result of applying\nsymbol? Can it be decomposed into\nθ to x\nbinaries?\n1...xn. The role of θ(t1....tn) would be played by (ιy: φθ(t1....tny)). Note the ab-\nsence of any world-variable in [Vθ]. Functional terms, like names, stand for the same\nobject in every possible world; they are rigid. Similarly it is always the same value of\ny that makes Vμ(φθ(x1....xny),w)=1. Hence again the truth-value of □(ιy:φθ(t1....tny))\nψ(y) always agrees with that of (ιy:φθ(t1....tny)) □ψ(y).\nFunctional definite descriptions playing\nDon't rejoice yet, however. All of this is because functional terms have been inter-\nno scope-indicator role, we may write\n(ιy:φθ(t ....t y)) wherever we would\npreted here are rigid. A lot of English expressions with a functional look to them not\nn\nhave written θ(t1...tn).\nare functional no longer. Take oldest-child(Pat) or combined -weight(Jupiter, Mars).\nThese yield a different value in different worlds for a fixed input.\nIf we want to accommodate English functional terms, we need to be looking at\nnon-rigid, world-relative function symbols. While we're at it we may as well look into\nthe possibility of non-rigid names. Otherwise we will have to regard it as a necessary\ntruth that water = H2O. Can a necessary truth really call for empirical investigation?\nNext time: contingent identity and intensional objects.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Intensional Objects",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/1f775a2366948bccf1ac9fabb0083560_MIT24_244S15_Intensional.pdf",
      "content": "Philosophy 244: #17--Intensional Objects\nIntensional Objects\nEntities obtained by stringing together \"ordinary\" objects, one per world and/or time,\nare called intensional objects. They give us a new and more charitable take on Con-\nverse Carban. If there has to be someone in charge of the Armed Forces at all times,\nthere's an intensional entity The Commander in Chief who is always in charge of the\nArmed Forces. If the first bird on a given morning is the only one who can be sure to\nget a worm, then there's an elusive further character the early bird who always gets\nthe worm. And so on.\nMore examples please!\nHere's the problem: on the intensional object interpretation, which is what we're\ntrying now, Converse Carban comes out valid. But it shouldn't if we are interested\nin contingent identity systems, for these were supposed to weaker than earlier sys-\ntems. The idea was to step back from □I and whatever brings □I in its wake; nothing\nnew was to be added. Something new has been added, though, for Converse Car-\nban was not a theorem of those earlier systems.\nThis kind of trouble arises, it might be argued, because we're allowing intensional\nobjects to be introduced at will; all imaginablle such objects, however gerrymandered\nor unintuitive, have allowed into the domain. Suppose we try to limit the construction\nsomehow. An intensional object is a function i from worlds into the domain. A model\nis a quintuple <WRDIV> where I is a set of intensional objects. Variable assignments\nμ will now take variables not to domain elements but members of this set I, that is,\nto particular intensional objects i. Instead of μ(x,w) we will now have μ(x) = i = a\nfunction from worlds to regular objects. An x-alternative to μ will be a ρ taking every\ny distinct from x to the same intensional object as μ; ρ(y)=μ(y).\n[Vφ\"] Vμ(φ(x1....xn),w)=1 iff <μ(x1)(w)....μ(xn)(w),w>εV(φ)\n[V∀] Vμ(∀xα,w)=1 iff Vρ(α,w)=1 for every x-alternative ρ of μ\nA good portion of Carnap's Meaning &\nNecessity is devoted to defending this\nA lot of logicians have thought there is something funny in these two clauses.\ndouble-dealing, which he called \"The\nWhen we're interpreting predicates, variables contribute regular \"extensional\" ob-\nMethod of Extension and Intension.\"\njects, members of the domain:\nQuine called it \"Carnap's curious double\nμ(x)(w) = i(w) = o. When we're working with quan-\ninterpretation of the variables.\"\ntifiers, they range over intensional objects i, or functions from worlds to domain-\nelements. Shouldn't the predicates, including the identity predicate, apply to inten-\nsional objects too? Then however we'd be back where we started, with identities\nholding necessarily. How well our hopes for contingent identity are realized by this\nmethod thus seems open to question.\nAnd not just to their values in the world\nin question?\nLogical Systems\nHow is contingent identity to be dealt with axiomatically? The Leibniz axiom has got\nto be limited so that α is non-modal; in fact it suffices to apply it just to predicates:\nI2\" x=y⊃(φ(x)⊃φ(y)) .\nS+BF with the addition of I1 (x=x) and I2\" will be S+CI. Soundness is easy. For\ncompleteness we again need a canonical model. What will play the role of I, the set\nof intensional objects? For each world w and variable x, let\nix(x)(w) = the first y such that x=yεw.\n\nI is the set of ix for each variable x, and the canonical assignment μ takes each x to\nx. As usual, <x1....xn,w>εV(φ) iff φ(x1...xn)εw.\nProp. 18.1 Vμ(α,w)=1 iff αεw.\nThere's some flexibility in the amount of\ncontingent identity/distinctness allowed.\nCompleteness follows as before. If α is S+CI-valid, then it holds in all worlds of all\nSay we want a semantics validating □I\nodels built on S-frames. If the canonical model is built on an S-frame, then α holds\n(x=y⊃□x=y) but not necessarily □NI\nn all worlds of the canonical model, that is, in all maximal S+CI-consistent sets. A\n(x,y⊃□x,y). Then we stipulate that\nwhen wRu, if i and i2 agree on w, they\ntatement belonging to all maximal consistent S+CI-sets is a theorem. Hence every\nagree on u--while not stipulating that\nalid α is a theorem, as promised.\nwhen wRu, if i1 and i2 agree on u, they\nagree on w.\nlenitude\nf the intensional domain I consists of all intensional objects (all functions from W\nnto D) then the converse Carban formula □∃xφx⊃∃x□φx becomes valid. It is not\nny sort of contingent identity system we're dealing with, in that case, because CI\nystems are weaker than, say, S+BF+□I+□NI, and S+BF+□I+□NI doesn't have\n∃xφx⊃∃x□φx as a theorem.\nFine, so they're not contingent identity systems. The question stlll arises: is their\nogic, the logic of ALL intensional objects, axiomatizable? The answer in a word is\nO, except under special conditions. Of the systems S we have considered, the logic\nf IOs based on S is unaxiomatizable with the single exception of S=S5.\nA definition. Given a class C of frames, α is \"C-valid for intensional objects\" iff\nμ(α,w)=1 for every wεW in every intensional object model <WRDV> (I is omitted\nince it's predictable from the rest) based on a frame <WR>εC. The claim is that\nUntil further notice, C-valid means\n-validity thus defined is not for the most part axiomatizable.\nC-valid for intensional objects.\nThe method of proof is interesting. Remember second-order logic, the logic that\nets us quantify into predicate position? There's a way to translate wffs of second-\nrder logic into wffs of modal predicate logic so that validity is preserved. This is\nmportant because second-order logic is unaxiomatizable. If intensional modal logic\nWe'll be working with just a fragment\nere axiomatizable, with no restriction on the intensions, this would enable an ax-\nof second-order logic, but it too is\nunaxiomatizable.\nomatization of second-order logic via the translation. Ba-boom! Contradiction! So\nhe modal logic of all intensional objects is not axiomatizable.\nThe fragment L2 of 2nd order logic we need involves just (a) a bunch of one place\nredicate variables φ, ψ, etc. and (b) a two-place predicate constant R. Just as the\nerm position in φx can be existentially generalized in 1st order logic to obtain ∃xφx,\nhe predicate position can be generalized in 2nd order logic to obtain ∃2φ φx. A\nodel for L2 is just like a model for first-order logic except that, now that we're under-\ntanding φ, ψ, etc. as variables, their values are given by μ instead of V. For each\nne-place φ, μ(φ)⊂D. R is the only predicate constant; its value V(R) in a model\nDV> is a subset of D×D. The only new semantical rule we will need is\n[V∀2] Vμ(∀2φ α)=1 iff Vρ(α) = 1 for every φ-alternative ρ of μ.\nThe next step is to reconceive the semantics of L2 so that it bears on modality.\nhe domain D of L2 is conceived as a set W of worlds. The interpretation function\ninterprets R as the accessibility relation on D. To help us keep this in mind, we\nefer to D as W, and to domain-elements as w. Since all that V does is identify the\nccessibility relation R, a model for language L2 is not essentially different from a\nrame for modal propositional logic. <D,V> \"=\" <W,R>.\ni\nm\ni\ns\nv\nP\nI\ni\na\ns\n□\nl\nN\no\nV\ns\nC\nl\no\ni\nw\ni\nt\np\nt\nt\nm\ns\no\n<\nT\nV\nr\na\nf\n\nTranslation\nNow we're getting somewhere. Just as we imagine the domain of L2 as a set of\nworlds, we can imagine the domain of our intensional object model as a set {0,1}\nof truth-values. A subset A of W (from our second-order non-modal model) may be\ncoded by the intensional object iA taking w to 1 iff wεA and 0 if w<A.\niA in the usual parlance is A's character-\nThat's the simple version anyway; it has to be complicated in two slightly mind-\nistic function.\nbending ways. First, the truth-values associated with 1 and 0 will be allowed to flip\nfrom world to world; 1 is sometimes truth and sometimes falsehood. Second, there\nmay be more objects in D than just {0,1}; it can be any set of objects as long as\nthey're suitably subdivided into the \"true\" and the \"false.\" .\nEvery wff α of L2 is going to be translated into a wff τ(α) of a language L* of\nmodal predicate logic. L* has just a single one-place predicate T. T applies in a\nworld w to the domain elements that will count as \"true.\" What it takes for a world w\nto go into the set coded by iA is that iA(w)εV(T,w), that is, iA takes w to the subset of\nits domain that plays the \"true\" role.\nNow the translation; the individual variables of L* are assumed to include all those\nof L2 plus an individual variable xφ for every predicate variable φ of L2.\nτ(φx) = ^(Tx&Txφ)\nτ(xRy) = ^(Tx&^Ty)\nτ(¬α) = ¬τ(α)\nτ(α∨β) = τ(α)∨τ(β)\nτ(∀xα) = ∀xτ(α)\nτ(∀2φ α) = ∀xφ τ(α)\nThe atomic cases are the strangest. Think of the first like this. If x in L2 is as-\nsigned a world w, then x in L* is assigned an intensional object i that is \"true\" (that\nsatisfies T) only in w. Likewise if φ in L2 is assigned a subset A of W, then xφ is as-\nsigned in L* an intensional object that is true (that satisfies T) in a world w iff wεA.\nBearing all this in mind, when will ^(Tx&Txφ) be true? It will be true iff a world is\nvisible at which both Tx and Txφ are true, iff a world is visible at which\n(Tx) the world that μ assigned to x in L2 and\n(Txφ) a member of the set of worlds that μ assigned to φ in L2.\n....iff Vμ(φx,x) = 1. Likewise, ^(Tx&^Ty) is true iff Tx and ^Ty are true at some\nSo the truth of ^(Tx&Txφ) in the modal\nvisible world, iff\nTy is true at the world\nlanguage goes with the truth of\n^\nφx in the\nμ assigns to x in L2, iff the world μ assigns\nsecond-order language, and the truth of\nto x bears R to the world assigned to y, iff Vμ(xRy) = 1.\n^(Tx&^Ty) goes with the truth of xRy.\nTesting\nSuppose you are given a frame <WR> and an intensional objects model <WRDV*>\nfor L* based on <WR> in which, for every wεW, there are <u,w>εV*(T) and <v,w><V*(T),\nthat is, some domain elements are true and some false. μ for L2 and μ* for L* corre-\nspond iff for every wεW and every variable x or φ of L2\n(i) <μ*(x)(w),w>εV*(T) iff w=μ(x)\n(ii) <μ*(xφ)(w),w>εV*(T) iff wεμ(φ).\nWhere V is the valuation of L2 that maps the predicate R to the relation R of our\nintensional objects model, and Vμ assigns to α the usual truth-value determined\naccording to the rules of 2nd-order logic,we have:\n\nProp. 18.2: Suppose α is a wff of L2, wεW, wRμ(x) for every variable x, and μ and\nμ* correspond. Then Vμ(α) = Vμ *(\n∗τ(α),w).\nProof: See 338-340\nNext we have to link up validity on a frame with validity in the corresponding inten-\nsional objects model. Define\nWx =df ^Tx&∀y(□(Tx⊃Ty)∨□(Tx⊃¬Ty))\nLemma 18.3 Vμ *(Wx,w*)=1 iff w* sees a w s.t. <μ*(x)(w'),w'>εV*(T) iff w'=w.\n∗\nFor all w'.\nThis considered as a condition on μ* is just what it takes for μ* to correspond with\nsome μ, since we can just let μ(x) be the unique w such that <μ*(x)(w),w>εV*(T).\nProp. 18.4 If α(x1-xn) is an L2 wff, and α* = □(∃xTx&∃x¬Tx)&Wx1&...Wxn)⊃τ(α),\nthen α is valid on <WR> iff α* is valid on every IO model based on <WR>.\nUnaxiomatizability\nNow we are almost there. For a system to be axiomatizable is for there to be an\neffective means of enumerating its theorems. If IO systems were axiomatizable then\nwe could enumerate the valid wffs of L2 by enumerating the wffs valid on every IO\nmodel, and putting α on the list of L2 theorems whenever the enumeration hits α*.\nDrilling down a bit: Suppose that S is a propositional modal system some of\nwhose frames <WR> have a number-like structure. W is countable, and R is linear\n(of any two worlds, exactly one bears R to the other), transitive, and discrete (each\nw Rs a w' s.t. there is no w\" between them). Then we will be able to define succes-\nsor in terms of R: y is the successor of x iff xRy and there is no z such that xRzRy.\nAnd there will be statements of L2 that via this definition express 2nd-order Peano's\naxioms, and that will truly characterize the S-frames with a number-like structure.\nLet the conjunction of these Peano statements be PA2. The statements following\nfrom PA2 in 2nd-order logic are precisely the arithmetical truths. The arithmetical\ntruths are very far from being effectively enumerable. But they would have to be if\nS+IO was effectively enumerable, that is, {α* | α* is an L* sentence valid on all IO-\nmodels built on S-frames} were effectively enumerable. For then by 18.4, {α | α is\n2nd-order valid on any <DV> that's an S-frame} would be effectively enumerable. But\nthen the following would be effectively enumerable, each because of the one before.\n{β | AX⊃\nThere's an infinite hierarchy of increas-\nβ is 2nd-order valid on any <DV> that's an S-frame}\ningly complex sets, with the effectively\n{β | AX⊃β is 2nd-order valid}\ndecidable sets and then the effectively\n{β |\nis an arithmetical truth}\nenumerable one. Y is the next level up\nβ\nfrom X iff it can be decided by a Turing\nmachine with an oracle for X. The arith-\nBut again it's a known fact, the \"deep fact\" behind Godel's theorem, that the set of\nmetical truths are more complex than\narithmetical truths is the furthest thing from effectively enumerable.\nanything on this hierarchy.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Modal Logic—Preliminaries",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/50363ecd8c1ebfd167f762554adb3434_MIT24_244S15_Preliminaries.pdf",
      "content": "Philosophy 244: Modal Logic--Preliminaries\nWhat is modal logic?\nMetaphysical answer: It's the logic of \"modes.\" \"Modes\" are ways in which a con-\ndition can hold or obtain or be implemented. Descartes thought all properties were\nmodes either of extension or thought. Triangularity is a way of being extended; reason-\ning is a mode of thought. The modes in (alethic) modal logic are ways of being true.\nThe modes in deontic modal logic are ways of being do-able; and so on.\nVerbal answer: if propositional logic is the logic of \"and\", \"or\", \"not\", \"if-then,\"\nmodal logic is the logic of \"necessarily\" and \"possibly,\" \"must\" and \"may.\"\nHistorical answer: It's a logic devised in the late 19th and early 20th centuryt in an\nBy CI Lewis in his 1910 Harvard dis-\nattempt to deal with the \"paradoxes of material implication.\" E.g., ¬q⊃(q⊃r) is valid\nsertation \"The Place of Intuition in\nKnowledge\" (advised by Josiah Royce).\nbut ¬q does not seem to imply that q implies r.\nLewis credits earlier work of Hugh\nLogical answer: Modal logic is the logic of expressions L and M analogous to \"nec-\nMacColl's.\nessarily\" and \"possibly\" in (some or all of) the following respects:\n\"A necessarily belongs to all B; B\n1.\nthey're sentential adverbs; if s is a sentence, so are Ls and Ms.\nbelongs to all C; therefore A necessarily\nbelongs to all C\" (Aristotle)\n2.\none is the \"dual\" of the other, as ∀is the dual of ∃; Ms iff¬L¬s and vice versa\n3.\nLs entails s entails Ms\nExamples of expressions related in the relevant way.\n\"Let this doctrine [of necessary belong-\nL\nM\n¬L¬\ning] rest in peace, without giving the\nleast disturbance to its ashes.\" (Reid)\nnecessarily\npossibly\n= not-necessarily-not\nprovable\nconsistent\n= not-provable-not\nrequired\npermitted\n= not-required-not\nknown....\nfor all we know,...\n= not-known-not\ndesirable\nacceptable\n= not-desirable-not\ninevitably\npotential;y,...\n= not-inevitably-not\nprobably...\ncould be that....\n= not-probably-not\nalways\nsometimes\n= not-always-not\ndefinitely\nmaybe\n= not-definitely-not\nNot all of these meet all the conditions; the third in particular is often violated.\n(Obligatory, provable.) But most have got to be met. Operators paired in the ways just\nvaguely gestured at are called modal operators and symbolized using 2 and 3. The\nbook uses L and M and that notation will be used as well, e.g., when we're posting\ninformation on the web or communicating via email.\nSo much for the philosophy. The course will be divided into two parts. First comes\npropositional modal logic: the result of attaching modal operators to ordinary truth-\nfunctional logic. Then we'll do quantified modal logic: same thing but starting from\nquantificational logic. Both parts will begin with a quick review of basic facts about\nthe underlying \"premodal\" languages. So let's remind ourselves how propositional logic\nworks. If you don't already know though this review isn't going to teach you; the point\nis really just to refresh our memories and get us talking the same logical language.\nTopics for today (possibly continuing into next time) are propositional syntax - the\nheart of this being an explanation of what counts as a propositional-calculus sentence\n- propositional semantics - an explanation of how PC sentences are interpreted--and\npropositional validity.\nLanguage of PC (Propositional Calculus)\nThe language's primitive or undefined symbols are the lower-case letters p, q, r,....\nwith or without numerical subscripts; the connectives ¬ and ∨; and, for disambiguation\n\npurposes, the parentheses ( and ). Finite sequences of these primitive symbols are\nexpressions. The well-formed formulas or wffs - intuitively, the sentences - are a subset\nof these defined by the following formulation rules:\nFR1 Every letter is an (atomic) wff.\nFR2 If α is a wff, so is ¬α .\nFR3 If α and β are wffs, so is (α∨β).\nImplied closure clause: nothing is a wffthat cannot be reached by finitely many\napplications of these rules. Examples of wffs? &, ⊃, and ≡are defined in the usual\nα&β =df ¬(¬α ∨¬β).\nway. For convenience we allow ourselves to omit outermost brackets.\nα⊃β =df ¬α ∨β.\nα\nInterp\n≡β =df (α⊃β) & (β⊃α)\nretation\nWffs can be thought of as standing (in) for propositions. Every proposition has\na truth-value, either true or false. The propositions are closed under a number of\nproposition-forming operations of which two are negation and disjunction. A propo-\nsition's negation is true iffit is false, and vice versa, and the disjunction of two proposi-\ntions is true iffeither of the two is true, otherwise false.\nWhich propositions does a given wffstand in for? The letters or atomic wffs stand\nin for any proposition you like. But given a particular assignment of propositions to\nthe atomic wffs, the interpretation of nonatomic wffs is severely constrained, in fact\ncompletely determined: ¬α stands in for the negation of what α stands for, and α∨β\nstands for the disjunction of what α stands for and what β stands for. That is,\nIR1 Each atomic wffα stands for an (unspecified) proposition |α|.\nIR2 If α is a wff, then |¬α| = the negation of |α|\nIR3 If α and β are wffs, then |α∨β| = the disjunction of |α| and |β|.\nA key fact about negation and disjunction, considered as operations on propositions,\nis that the truth-value of a negation is completely determined by that of the proposition\nnegated; likewise for the truth-value of a disjunction vis a vis its disjuncts. This is\none way of understanding how and why sentential negation and disjunction are truth-\nfunctional.\nNot every operator is like this. Examples? Counterfactual constructions, attitudinal\noperators, and of course necessitation. You can't predict the truth-value of the proposi-\ntion that necessarily BLAH from the truth-value of the proposition that BLAH.\nWhat logical difference does it make whether an operator is or is not truth-functional?\nLogic is concerned with validity. It wants to identify the sentences α that are true re-\ngardless of how its atomic parts are interpreted: regardless of what propositions they\nare taken to express. This project is way simplified if all of α's connectives are truth-\nfunctional. Because then to determine whether α is true on all interpretations, we don't\nneed to randomize over all the (infinitely many!) propositions its atomic parts might\nexpress; it's enough to randomize over all the truth-values its atomic parts might have.\nIn practice then we can abstract away from the propositions and focus just on truth-\nvalue. Atomic wffs can be thought of as standing not for propositions but truth-values,\neven if philosophically speaking these are the truth-values of implicitly understood\npropositions; and negation and conjunction can be understood as operations on truth-\nvalues, even if philosophically speaking the negation of a truth-value is the truth-value\nof a negated proposition. This allows us to replace IR1-3 with ER1-3\nER1 Every atomic α has a truth-value; α =df 0 or 1.\nER2 J¬α =\nJ K\nK\ndf 1-Jα\nER3\nK\nJα∨βK =df max(JαK, JβK)\n\nα\nβ\n¬α\n¬β\nα∨β\nα&β\nα⊃β\nα≡β\nThe information in ER2 and ER3 is often expressed in truth-table form; let's tack on\nthe defined connectives too:\nSo, negation and disjunction are (as we see it) first and foremost operators on\npropositions; secondarily operations on truth-values; and thirdly (tertiarily?) syntac-\ntical operations. The reason that ¬ is called the negation sign is that the result of\nputting it in front of a wffis a sentence whose truth-value is the semantic negation of\nthat wff's truth-value. The wedge ∨is called the disjunction sign for the same sort of\nreason. All of that having been said, in practice we'll use the words \"negation\" and\n\"disjunction\" ambiguously to stand sometimes for the symbol and associated syntactic\noperation, sometimes for the semantic operation on truth-values, and sometimes for\nthe semantic operation on propositions, with no attempt to enforce any priority among\nthese operations.\nPropositional Validity\nRemembering that the letters or propositional variables of PC stand for arbitrary\npropositions, a wffis (intuitively, informally) valid iffevery way of putting propositions\nin for its component letters results in a truth. The reason that (p&q)⊃(p⊃q) is valid is\nthat if you consider all of propositions arrived at by putting propositions in for p and q,\nE.g.,\nyou find that every single one of them is true. Again, that's the intuitive, informal\nif goats eat cans and bottles, they eat\nidea. Given that all the connectives (operators) in a PC wffare truth-functional, we\nbottles if they eat cans,\nif bees buzz and sting, they sting if\nmay as well define validity not as truth under all assignments of propositions to p, q,\nthey buzz\netc., but rather truth under all assignments of truth-values to p, q, etc. There is also\n.....\nthe opposite property of being false under all assignments of truth-values to variables.\nA wffwith the first property is called PC-valid or a tautology, one with the second\nproperty is PC-antivalid or unsatisfiable. Most wffs of course fall somewhere between.\nThis definition of validity, although perfectly accurate, does not adapt as naturally as\nwe might like to the modal case. So let's give in addition a second definition in terms\nof a certain sort of game, the PC-game. The PC-game is like solitaire; it has only one\nplayer. (Have no fear, lots of players will be needed when the game is elaborated to\naccommodate modality.) Here's how it goes:\nThe player has a sheet of paper on which a number of letters (e.g., p, r, s,...) are writ-\nten. Player and paper together are called a PC-setting. PC-settings differ only in which\nletters are written on the paper. We now proceed to call out to the player a series of\nPC wffs, subject to the following requirement: we never call out a wffuntil all its truth-\nfunctional components have been called, e.g., before we call a disjunction we must call\neach of its disjuncts, and if one of the disjuncts is a negation, before we call it we must\ncall its negatum. The player's instructions are these:\n1. If a letter is called, raise your hand iffthat letter is on the sheet.\n2. If ¬α is called, raise your hand iffyou did not raise your hand when α was called.\n3. If α∨β is called, raise your hand iffyou raised your hand for either α or β.\nUsing the definitions of &, ⊃, and\nSay that a wffis successful in a setting if the player raises her hand when it is called.\n≡, we can easily figure out the rules\nfor conjunctions, conditionals, and\n(Examples.) Your average wffwill be successful in some settings and unsuccessful in\nequivalences. (Exercise!)\nothers. Our interest though is in the wffs that are successful in every setting: the PC-\nsuccessful wffs. The alternative definition is now this: a wffis PC-valid iffit is successful\nin every PC-setting, that is, it is PC-successful.\nTesting 1: Exhaustive\n\nOK but how do we test whether a given wffα is valid? One idea would be to play\nthe PC-game from every setting and see whether the hand always goes up when α is\ncalled. But that would take forever; there are infinitely many atomic letters and so\ninfinitely many (in fact uncountably many) settings.\nA first step towards containing the problem is to notice that since α is finitely long,\nit can have only so many letters in it: say n. Letters that aren't among these n are\nneither here nor there as far as α's success in a given setting is concerned. Whether\nthey are on the sheet or offit has no effect whatever on α's fate.\nIt follows that nothing is lost if we limit ourselves to these n letters and consider just\nthe settings you get by putting selections of these n letters on the sheet. How many is\nthat? 2n. So, shall we now go ahead and play the game 2n times to see how α comes\nout? My mom would say, let's not and say we did. Better to mimic the process of\nplaying 2n times by writing down representations of the various settings and calculating\nfor ourselves when the hand would have gone up had the game been played.\nThe example in the book on page 10 is this. Let α be ((p⊃q)&r)⊃((¬r∨p)⊃q).\nThis has 3 variables so there are going to be 23 or 8 settings. We can represent these\nvarious settings as strings of 1s and 0s, 1 for the case where a given letter is on the\nsheet, 0 for the case where it isn't. The various columns on the right correspond to\nthe various rounds of play; the column marked (1) indicates what happens in the first\nround, with the various entries in a given column telling you whether the hand went up\nor stayed down in that round on the associated setting. Eventually we reach a determi-\nnation of what happened in the last round of each game, when the target sentence α\nwas called. Since the central column consists entirely of 1s, the sentence is PC-valid.\np\nq\nr\n((p\n⊃\nq)\n&\nr)\n⊃\n((¬\nr\n∨\np)\n⊃\nq)\nThis is of course the truth-table method\n(1)\n(2)\n(1)\n(3)\n(1)\n(5)\n(2)\n(1)\n(3)\n(1)\n(4)\n(1)\nfor checking validity. An advantage is\nthat it settles not only α's validity but\nall its logical properties, e.g., whether\nit is satisfiable or not. If we're willing\nTesting 2: Targeted\nto settle for information about just\nvalidity there's a quicker and slightly\nThe reductio method. Here we search for a falsifying assignment of truth-values (a\nmore interesting method available.\ngame w.r.t. which α is unsuccessful); if it can't be found, α is valid. Explanations can\nbe found on p. 11; I'll just work an example.\n((p\n⊃\nq)\n&\nr)\n⊃\n((¬\nr\n∨\np)\n⊃\nq)\n(9)\n(4)\n(8)\n(2)\n(5 )\n(1)\n(11)\n(12)\n(6)\n(10)\n(3)\n(7)\nEach of the two methods gives us a decision procedure for PC: a finite and mechani-\ncal method for judging validity. To test this assertion, look at the list the book gives of\n(what it dogmatically asserts are) valid wffs. What do the two methods say?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Modal Metalogic Completeness",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/a4ab6b46bc0763e9638ae325f1e6cc3b_MIT24_244S15_Completeness.pdf",
      "content": "Philosophy 244: #7--Modal Metalogic: Completeness\nSoundness for a system S says that its theorems are S-valid, valid in all S-frames. Com-\npleteness says that every S-valid wffis provable in S. The two together show system S is\nadequate. You might think this is no great accomplishment; why would it be called S-validity\nif it wasn't going to line up with provability in S? For provability in S to agree with S-validity\nis about as informative as being told that Lou Gehrig died of Lou Gehrig's disease. What we\nWell, but that is somewhat informative;\nlearn is that there's a distinctive form of validity corresponding to system T. Given how va-\nwe learn that he had a disease and it\nwas that disease that killed him; he\nlidity was defined we learn that there's a distinctive sort of frame. The surprise isn't that the\ndidn't die of boredom or whatever.\nrelevant frames are called T-frames; it's that there's that kind of frame in the first place.\nAdequacy results are informative in a\nsimilar way.\nSystems can be defined either in terms of an axiomatic basis, or in terms of theorems; the\nNot all modal systems have associated\nfirst approach is more fine-grained since there can be two bases for the same set of theorems.\nframes. KH = K + 2(2p≡p)⊃p\nFor the most part we'll be using the second notion. A system is a set of wffs. Not any old set,\ndoesn't (160-1)\ne.g., not the wffs of length 51! The set has to be closed under some kind of implication. Our\nfocus will be on extensions of K, that is, the theorems provable by K-rules from K and A = a\nset of axioms. These are called normal systems.\nFrames and Validity\nIf C is a class of frames, however heterogeneous, there's an associated notion of validity: α\nis C-valid iffit's valid on every frame in the class, that is, true in every world of every model\nbased on a frame. in C. Sometimes we'll speak too of validity in a model, understood as truth\nin every world of the model.\nMain Idea: For every consistent normal system S, there is a particular model MS,\n\"the canonical model of S,\" such that α is a theorem of S iffα is valid in MS.\nThe reason this matters for completeness is this. We want to show that all C-valid formulae\nare theorems of system S. Suppose we can show that C contains the frame of this canonical\nmodel MS. Then the C-validity of α entails that α is valid in the canonical model, and so by\nour lemma that α is a theorem of S.\nSo, how to construct the canonical model? Worlds can be anything we like; the domain of\nworlds is completely unconstrained as we're doing it. No harm then if we make them sets of\nwffs, the very wffs that are going to come out true in that world on the canonical model. Not\nany old set of wffs is fit to play the role of truths in some world. The set better be consistent,\ncertainly. Second it better be \"self-satisfying,\"--if it contains a disjunction it contains one of\nthe disjuncts, and vice versa. Third it better be \"opinionated,\" in the sense of not remaining\nagnostic about α's truth-value for any wffα.\nThis all boils down to the set being \"maximal consistent.\" A set Λ of wffs is S-inconsistent\niffit contains αi such that ⊢S ¬(α1&...&αn). Λ is consistent in S iffthis never happens, ie.,\n¬(α1&...&αn) is never a theorem of S for any αis in Λ you care to pick.\nA set Λ of wffs is maximal ifffor every wffα, it contains either α or its negation. either\nit or its negation belongs to the set. A set of wffs is maximal consistent (w.r.t. S) iffit has\nboth of these features.\nLemma 6.1 Spose that Λ is maximal consistent w.r.t. S. Then\n6.1a exactly one of α, ¬α is in Λ\n6.1b α∨β is in Λ iffat least one of α,β is in Λ\n6.1c α∧β is in Λ iffboth of α,β are in Λ\n6.1d if α, α⊃β are in Λ then so is β\nProof : (a) One is in by maximality. If both were in then Λ would be inconsistent. Etc.\n\nLemma 6.2 Spose Λ is maximal consistent w.r.t. S. Then\n6.2a if ⊢S α then αεΛ\n6.2b if ⊢S α⊃β then (αεΛ only if βεΛ).\nProof : (a) If ⊢S α, then ¬α is S-inconsistent, so αεΛ by 6.1a (b) α⊃β ε Λ by 6.2a. By\n6.1d, if αεΛ so is β. (b).....?\nProp. 6.3 If Γ is S-consistent, then it has a maximal consistent extension, that is, there's a\nmaximal consistent Λ s.t. Γ ⊆Λ.\nProof : List the wffs (all infinitely many of them) of modal propositional logic as α1, α2,...Define\na sequence Γ0, Γ1, etc. of sets of wffs as follows:\n(1) Γ0 = Γ\n(2) Γn+1 = Γn ∪{αn+1} if that's S-consistent, otherwise Γn+1 = Γn ∪{¬αn+1}.\nClearly if Γn is S-consistent, so is Γn+1. Otherwise Γn would be inconsistent both with α and\n¬α; so it would entail their negations, which makes it itself inconsistent. Λ = the union of\nthe Γns is consistent; if not it would have an inconsistent finite subset, whence one of the Γns\nwould be inconsistent. Γ is maximal since for any wffαn, either it or its negation was added\nat the nth stage.\nAccessibility\nNow we set up the accessibility relation. For any set Γ of wffs, let 2-(Λ) = {β | 2βε Γ}.\nWe'll say that Γ bears R to ∆iff2-(Γ)⊆∆. (If 2β holds at Γ, then we want Γ to \"see\" ∆\niffβ holds at ∆.) The next Lemma is for the case where Γ contains instead ¬2β; we need\nsome accessible ∆to contain ¬β. The result will be that if Γ calls β necessary, all the worlds\nit can see are β-worlds, whereas if it calls β unnecessary, it can see a ¬β-world.\nLemma 6.4 Given a normal system S of propositional modal logic, let Γ be an S-consistent\nset of wffs containing ¬2α. Then 2-(Γ) ∪{¬α} is S-consistent.\nProof. If not, there are βi in 2-(Γ) such that ⊢S ¬(β1∧....βn∧¬α), which means that\n⊢S(β1∧....βn)⊃α. By DR1, ⊢S 2(β1∧....βn)⊃2α. 2-distribution gives ⊢S(2β1∧...2βn)⊃2α.\nBut then 2β1,..,2βn, ¬2α is not S-consistent. It is a subset of Γ though (why?), so Γ is not\nS-consistent either, which was to be shown.\nCanonical models\nThe canonical model for S is <W,R,V>, where\nW = {Γ | Γ is maximal consistent w.r.t. S}\nwRu iffβ ε u whenever 2β ε w, that is, 2-(w) ⊆u.\nV(p,w)=1 iffpεw\nProp. 6.5 If <WRV> = the canonical model for normal system S, then V(α,w)=1 iffα ε w.\nProof By induction on the complexity of α.\nCor.6.6 α is valid in the canonical model for S iffα is a theorem of S.\nProof : (i) If ⊢S α then α is in every maximal S-consistent set, by 6.2a, Hence α is in each\nworld in the canonical model's W. 6.5 then tells is that V(α,w)=1 for each wεW, ie., α is\nvalid in the canonical model. (ii) Spose that α is not a theorem of S. Then ¬α is S-consistent\nso by 6.3 there's a maximal S-consistent set w that contains it. V(α,w)=0 by 6.5. So α is\nnot valid in the canonical model.\n\nWhere does this leave us? To establish completeness it's enough now to focus on the\ncanonical model. This makes the job much easier.\nTo establish that\nIt's enough to show that\nK is complete\nthe canonical model for K is built on some frame or other\nD is complete\nthe canonical model for D is built on a serial frame\nT is complete\nthe canonical model for T is built on a reflexive frame\nB is complete\nthe canonical model for B is built on a reflexive, symmetric frame\nS4 is complete\nthe canonical model for S4 is built on a reflexive, transitive frame\nS5 is complete\nthe canonical model for S5 is built on a reflexive, transitive, symmetric frame\nThe argument goes like this, illustrating with T.\n1. Suppose α is valid over the class C of reflexive frames (it's T-valid)\n2. The canonical model for T is built on a reflexive frame, we're going to show!\n3. So α is valid in the canonical model for system T. (1,2)\n4. Corollary 6.6 says validity in the canonical model for T suffices for provability in T.\n5. So α is provable in T. (3,4)\nThe one piece that has to be filled in is that the canonical model for T is built on a reflex-\nive frame, that is, the accessibility relation R in that model is reflexive. How did we define\nit? We said that Γ bears R to ∆iff2-(Γ)⊆∆, Γ and ∆being maximal consistent in T.\n2-(Γ)⊆∆iffwhenever 2α ε Γ, α lies within ∆. Right now we're interested in the case where\n∆= Γ.\nThe question then becomes this: when 2α ε Γ, must α lie within Γ too? All we have to go\non is that Γ is a maximal T-consistent set. But that's enough. Γ contains 2α ⊃α because a\ntheorem of T is going to belong to every maximal T-consistent set, by 6.2a. Γ thus contains\n2α and 2α ⊃α. Ah, but it is closed under modus ponens by 6.2b. So it contains α too, as\npromised.\nAll the systems go this way more or less. How do we know that the canonical model for S4\nis built on a reeflexive, transitive frame? We have to show that if Γ, ∆, and Ξ, are maximal\nS4-consistent sets, then, first, α is in Γ if 2α is (that's been done), and second, for transitiv-\nity,\nIf ∆contains α whenever Γ contains 2α, and\nΞ contains α whenever ∆contains 2α, then\nΞ contains α whenever Γ contains 2α.\nHow would we show this?\nStep One: What else must Γ contain if it contains 2α?\nStep Two: ....\nStep Three: ....\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "24.244s15 Modal Predicate Logic",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-244-modal-logic-spring-2015/22278a5a7054b7d668915d9effe03706_MIT24_244S15_Predicate.pdf",
      "content": "Philosophy 244: #9-- Modal Predicate Logic\nNow we turn to modal predicate logic, the result of adding modal operators to first-\norder quantification theory. First-order quantification theory is itself the result of making\ntwo additions to propositional logic. First, we dig into the structure of atomic sentences,\nreplacing the simple indivisible p with things of the form\nφx1x2....xk\nthat is, a k-ary predicate followed by k variables. Second, we introduce a new way of\nforming complex sentences from simpler ones, a way that wouldn't have been available\nwithout the aforementioned digging. Whenever you've got a formula α(x) with a variable in\nit, you can stick a quantifier in front.\nActually you can stick a quantifier in\nfront regardless, but it doesn't do any-\n∀x (x)\nthing unless you've got a corresponding\nα\nvariable.\n∃xα(x)\nIf flexibility is the property that φ(x) attributes to x, then the first of these says that\neverything is flexible, and the second that something is flexible. The process can be re-\niterated with different variables, to get things like ∀x∃y ψ(x, y), which if admiration is the\nrelation expressed by ψ, says that everyone admires somebody. And so on indefinitely.\nThe book's name for first-order quan-\ntification theory is \"lower predicate\ncalculus\" or LPC. The reason for the\nSyntax\n\"lower\" is that we're quantifying into\nname-position only, not predicate-\npositions as in second-order logic (∃X\nNow let's give the syntax and semantics formally; that we'll be taking the universal quan-\nXmc = Marcus and Kripke have some-\ntifier ∀as basic, the existential ∃will be defined as ¬∀¬. A language L for LPC has as its\nthing in common). \"Lower\" means the\nsame as \"first-order.\"\nlexicon\nfor each n ≥1, a denumerably infinite set of n-place predicates φ. ψ,...(P, Q,,.....)\na denumerably infinite set of individual variables x, y, z,...\nthe three logical symbols ¬,∨, ∀\nleft and right parentheses\nThe formation rules for wffs are\nFR1 An n-place predicate followed by n individual variables is an atomic wff\nFR2 If α is a wff so is ¬α\nFR3 If α, β are wffs, so is (α ∨β)\nFR4 If α is a wff and x a variable then ∀x α is a wff.\nThe definitions of &, ⊃, and ≡are as before. The existential quantifier is defined by\nD∃∃x α =df ¬∀x¬α\nThe scope of a quantifier in α is the smallest sub-wff of α that contains it. (Examples.)\nA variable x is called bound or free according to whether it is or isn't in the scope of an\nx-quantifier. Note that it is really occurrences of variables that are bound or free, and that\nAn exception is made though for the\nbound/free is always relative to an enclosing formula; x is bound in ∃x∀yRxy but free in\nvariable immediately after the ∀or\n∃; this is neither bound nor free, it's\nthe bit after the initial quantifier: ∀y Rxy.\nconsidered just part of the quantifier.\n\nSemantics\nThe first thing we need for an interpretation of L is a domain D to signal what we are\nSee p.237 for the informalities.\ntalking about. When we say ∃xα or ∀xα, this means that there is something in the domain\nwhich satisfies α, or that everything in the domain satisfies α. The domain can in principle\nbe considered our interpretation of the quantifiers--D = V(∀)--in something like the way\nthat multiplication is our interpretation of conjunction; in that case the model would be\ndetermined by V alone. If P is an n-place predicate, V(P) is a set of n-tuples drawn from\nAre the cases really analogous? What\nthe domain D. In the language of cross products, it's a subset of D×...×D (n times). A\ndoes this mean for ∀'s status as a logical\nconstant?\nmodel M of L is an ordered pair <D,V> of a domaIn and an interpretation function.\nDon't variables have to stand for objects? Yes and no. Names when we get to them\nwill be assigned objects by V. But not variables; they stand for \"arbitrary\" or \"unspecified\"\nobjects. The reason is that there are two kinds of wffs. Those with free variables -- open\nKit Fine has a book taking arbitrary\nwffs - we don't assign truth-values to, so there's no need to specify an object to help de-\nobjects seriously as a distinctive sort of\nobject An arbitrary D has the properties\ntermine that truth-value. Those whose variables are all bound-- closed wffs or sentences\nall Ds have in common, with a few\nof L -- we do assign truth-values to, but in a way that relies only on the pattern of vari-\nexceptions, e.g., non-arbitrariness.\nables in the sentence, and so does not require an assignment of particular objects to any\nof them.\nConsider ∀xPx. This will be true if V(P) = D, otherwise false. No need for x to stand\nfor any particular entity. As for Px, whether it should be counted true or false depends on\nwhat we think of x as standing for. We could let V assign values to variables too, but then\nwe lose this freedom of construing it as standing for whatever we like. Also it is mainly\nsentences we want to come out true or false in the model, so assigning a fixed value to x\nwould not accomplish much.\nOpen wffs will be evaluable only if their\nBut again, though we don't don't want x to refer to anything in particular in our model\nuniversal closures are valid or anti-valid.\n<D,V>, we do want to generalize over all the things it might be taken as referring to. This\nin order to say, e.g., that ∀xPx is true iff Px is true \"whatever we take x to be.\" To accom-\nplish this, let a value-assignment μ be a function mapping variables to arbitrary members\nof the domain; for all variables x, μ(x)εD. We write Vμ(α)=1 to mean that α is true in the\nmodel <D,V> when the variables are given the values assigned by μ. This approach en-\nTarski called μ a \"sequence,\" and spoke\nabled in 1930 the first recursive definition of truth for quantified languages.\nof satisfaction by a sequence of objects\nrather than truth of those objects.\n(Vφ) Vμ(φ(x1....xn))=1 iff <μ(x1)...μ(xn)>εV(φ), otherwise 0.\n(V¬) Vμ(¬α) = 1 iff Vμ(α)=0, otherwise 0\n(V∨) Vμ(α∨β) = 1 iff Vμ(α)=1 or Vμ(β)=1\nThe interesting part of the definition,\n(V∀) Vμ(∀xα)=1 iff Vρ(α) = 1 for every x-alternative\nand the part we most need the value-\nρ to μ, otherwise 0\nassignment μ for, comes with the\nquantifiers. Say that ρ is an x-alternative\nFrom this last and the rule for negation it follows that\nto μ if ρ agrees with μ on every variable\nbut (possibly) x.\n(V∃) Vμ(∃xα)=1 iff Vρ(α)=1 for some x-alternative ρ to μ, otherwise 0.\nFinally the all important notion of\nValidity α is valid in M = <D, V> iff Vμ(α)=1 for every variable-assignment μ,\nand valid (period) iff it's valid in every model M.\nAxiomatization\nThis time we'll state the axiom(s) schematically instead of leaning hard on a a uniform\nsubstitution rule.\nThe precise definition of α[y/x] is com-\nplicated, because we don't want x's free\nPC Any LPC substitution-instance of a valid PC wff is an axiom of LPC.\nin α to turn into y's that are bound in\nα[y/x]. See The Principle of Replace-\n∀1 ∀xα ⊃α[y/x]\nment on pp.240-241.\n\nThe rules are\nMP ⊢α, ⊢α⊃β ⇒⊢β\n∀2 ⊢(α⊃β) ⇒⊢(α⊃∀xβ) provided x is not free in α.\nHow would we show that every LPC\nSome derived rules:\ntheorem is valid?\nUG ⊢α ⇒⊢∀xα\nUG is the model for the rule of necessi-\nUG⊃⊢(α⊃β) ⇒⊢(∀xα⊃∀xβ)\ntation: ⊢α ⇒⊢□α.\nUG≡⊢(α≡β) ⇒⊢(∀xα≡∀xβ)\nEq ⊢α≡β ⇒⊢γ[α]≡γ[β]\nwhere γ[α] differs from γ[β] only in having α at 0 or more places where γ[β] has β\nRBV ⊢∀xα≡∀yβ\nwhere α differs from β only in having free x where and only where β has free y\n∀xα and ∀yβ are \"bound alphabetic\nvariants.\"\nSome theorems:\nLPC1 ∀x(α⊃β)⊃(∀xα⊃∀xβ)\nLPC2 ∀x(α⊃β)⊃(α ⊃∀xβ) provided x is not free in α\nLPC3 ∃y(α[y/x]⊃∀xα) if y is not free in ∀xα\nE.g., ∃y(Fy ⊃∀xFx). Why is this valid?\nQI ¬∃x¬α≡∀xα -- quantifier interchange, generalizes a la LMI\nEither V(F) = D or not. If V(F) = D\nthen the sentence is true because\nthe conditional's consequent is true.\nOtherwise the domain contains a\nModal LPC\nthing not in V(F). ∃y(Fy ⊃....) is true\nbecause Fy ⊃... is true (due to a false\nantecedent) when y is assigned that\nThe language of modal LPC differs from the language of LPC in having the modal opera-\nthing as its value.\ntor □as a lexical item, and in having a slightly amended second formation rule:\nFR2' If α is a wff then so are ¬α and □α\nA model M for modal LPC is a quadruple <W,R,D,V> in which <W,R> is a frame,\nD is a domain, and V is a function from n-place predicates to, not n-tuples of domain ele-\nments, but n+1-tuples of domain elements and worlds -- the idea being that <a,b,w>εV(φ)\niff a and b stand in the relation expressed by φ in world w.\n(Vφ) Vμ(φ(x1....xn),w)=1 iff < μ(x1)...μ(xn), w >εV(φ), otherwise 0.\n(V¬) Vμ(¬α,w) = 1 iff Vμ(α,w)=0, otherwise 0\n(V∨) Vμ(α ∨β,w) = 1 iff Vμ(α,w)=1 or Vμ(β,w)=1\nρ is an x-variant of μ if ρ agrees with μ\n(V□) V (□α,w) = 1 iff V (□α,u) = 1 for every u that w bears R to\non every variable but (possibly) x.\nμ\nμ\n(V∀) Vμ(∀xα,w)=1 iff Vρ(α,w)=1 for all x-variants ρ of μ\nFinally the all important notion of\nValidity α is valid in M = <WRDV> iff Vμ(α,w)=1 for all w and μ, and valid on <WR> iff\nit's valid in every model M based on <WR>.\nSystems of Modal Predicate Logic\nSuppose S is a normal system of modal propositional logic. Then LPC+S is defined as\n\"Normal\" = extension of K.\nfollows. Axioms:\nS' ⊢α whenever α is an LPC substitution instance of an S-theorem,\n∀1 ⊢∀xα⊃α[y/x] if α[y/x] is α with a free y replacing every free x\n\nRules:\nNE ⊢α ⇒⊢□α\nMP ⊢(α⊃β), ⊢α ⇒⊢β\n∀2 ⊢(α ⊃β) ⇒⊢(α ⊃∀xβ) provided x is not free in α\nAnother important potential axiom is the following, which concerns interactions be-\ntween the quantifiers and □:\nBF ⊢∀x□α⊃□∀xα\nThis is the famous Barcan formula, named after Ruth Barcan Marcus. The notation\nS+BF is used for LPC+S with BF added. Let's see what the BF can do for us. The con-\nverse is important too.\nWilliamson argues in Modal Logic\nas Metaphysics that both should be\nBFC ⊢□∀x\nconsidered valid, because all worlds\nα⊃∀x□α\nhave the same domain.\nHow do these strike you intuitively? Everything is necessarily material, according to\nthe materialist. Is it necessary that everything be material? Necessarily everything exists.\nDoes it follow we are all like God in necessarily existing?\nRecall LPC1 ∀x(α⊃β)⊃(∀xα⊃∀xβ). Can we generalize it to ∀x(αJβ)⊃(∀xαJ∀xβ)? Well,\nRecall that α J β -- α fishhook β -- is\nin box terms it's ∀x□(\nequivalent to □(\nα ⊃\n)\nβ) ⊃(□∀xα⊃□∀x β). To prove this, it's enough to show that\nα ⊃β\n∀x□(α⊃β) ⊃□∀x(α⊃β) (since □and ∀distribute over material implication). But that's an\ninstance of BF.\nWhich is more plausible, BF or CBF? The converse of the Barcan formula is, interest-\ningly enough, a theorem even of LPC+K:\nBFC\n□∀xα⊃∀x□α\n∀xα ⊃α\n∀1\n□∀xα ⊃□α\n(1)xDR1\n□∀xα ⊃∀x□α\n(2)x∀2\nHow do modalities mix with the \"opposite\" sort of quantification? ∃x□α ⊃□∃xα is\nvalid, as is ^∀xα ⊃∀x^α. Converses of these are not valid. Neither would we want them\nto be. The converse of the first, □∃xα ⊃∃x□α, involves exactly the kind of mix-up that\nQuine complained about in quantified modal logic. An instance would be, Necessarily\nthere is a number of planets only if something necessarily numbers the planets.\nThere are lots of modal systems S such that LPC+S does not have BF as a theorem. It\nis a theorem, though, if S contains the Brouwer axiom B. Here is why:\nBF\n⊢∀x□α⊃□∀xα\n∀x□α ⊃□α\n∀1\n^∀x□α ⊃^□α\n(1)xDR3\n^□α ⊃α\nB\n^∀x□α ⊃α\n(2),(3)xPC\n^∀x□α ⊃∀xα\n(4)x∀2\n∀x□α ⊃□∀xα\n(5)xDR2\nNext time: different systems of modal predicate logic, types of validity, soundness, essen-\ntialism, de re and de dicto necessity.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n24.244 Modal Logic\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}