{
  "course_name": "Modern Fiction",
  "course_description": "Tradition and innovation in representative fiction of the early modern period. Recurring themes include the role of the artist in the modern period; the representation of psychological and sexual experience; and the virtues (and defects) of the aggressively experimental character. Works by Conrad, Kipling, Babel, Kafka, James, Lawrence, Mann, Ford Madox Ford, Joyce, Woolf, Faulkner, and Nabokov.",
  "topics": [
    "Humanities",
    "Literature",
    "Fiction",
    "Humanities",
    "Literature",
    "Fiction"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nRequired Texts\n\nYou should use the editions specified here.\n\nBooks on order (in order in which they will be used):\n\nHardy, Thomas.\nJude the Obscure (Oxford World's Classics)\n. Oxford University Press, 2009. ISBN: 9780199537020.\n\nConrad, Joseph.\nLord Jim (Penguin Classics)\n. Penguin Books, 2007. ISBN: 9780141441610.\n\nKipling, Rudyard.\nKim (Oxford World's Classics)\n. Oxford University Press, 2008. ISBN: 9780199536467. [Preview with\nGoogle Books\n]\n\nFord, Ford Madox.\nThe Good Soldier (Penguin Classics)\n. Penguin Classics, 2007. ISBN: 9780141441849.\n\nJoyce, James.\nA Portrait of the Artist as a Young Man: Text, Criticism, and Notes (The Viking Critical Library)\n. Penguin Books, 1977. ISBN: 9780140155037.\n\nForster, E. M.\nA Passage to India\n. Mariner Books, 1965. ISBN: 9780156711425.\n\nWoolf, Virginia.\nTo the Lighthouse (Everyman's Library)\n. Everyman's Library, 1992. ISBN: 9780679405375.\n\nClass Rules\n\nYour attendance in this class is mandatory. You are allowed a maximum of two unexcused absences. Beyond that, you will fail the class. If you are sick or have to be away for another legitimate reason, email me to say so in a timely fashion, if at all possible before you miss class.\n\nClass begins at five minutes past the posted starting time. You are expected to come to class on time having done the appropriate reading for each day and with the appropriate text(s). I may charge you an unexcused absence if you frequently arrive late or without your book. I will give unannounced quizzes on the readings at my discretion.\n\nStudent Work\n\nTwo analytical essays\n\n3 short quizzes on Woolf's\nTo the Lighthouse\n\nTwo oral reports\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nYour written work (including any quizzes)\n\n75%\n\nYour oral reports, your participation in class discussion, your preparedness, and your overall good citizenship.\n\n25%\n\nLiterature Faculty Policy on Plagiarism\n\nThe Literature Section has formulated this statement and policy for all plagiarism cases:\n\nPlagiarism--the use of another's intellectual work without acknowledgement--is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted and in all oral presentations, including images or texts in other media and for materials collected online. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution, consult the style guides available in the\nWriting and Communication Center\n, review their\nLink\n, and review\nMIT's online Academic Integrity Handbook\n.",
  "files": []
}