{
  "course_name": "Modern China",
  "course_description": "This course discusses China’s emergence as a global power, which has arisen out of two centuries of significant change. It explores those transformations from 1800 to the present by examining the advent of foreign imperialism in the nineteenth century, the collapse of the last imperial dynasty in 1911, China’s debilitating war against Japan, the communist revolution, and the tumultuous history of the People’s Republic of China from 1949. Also, this course addresses the historical transformations that have shaped contemporary Chinese politics, ethnicity, gender, environment, economics, and international relations.",
  "topics": [
    "Humanities",
    "History",
    "Asian History",
    "Modern History",
    "World History",
    "Humanities",
    "History",
    "Asian History",
    "Modern History",
    "World History"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nCourse Description\n\nWith China playing a central role in global affairs today, an understanding of the country's history over the last two hundred years has never been more important. In this class, we will trace the collapse of the last imperial dynasty, the political movements of the early twentieth century, the world wars that defined the modern global order, and the country's monumental rise on the global stage in the early twenty-first century. In addition to examining key documents and archives, we will discuss films, songs, novels, and television programs which convey the triumphs, anxieties, and sorrows of individuals who have confronted a world of constant change for the last century. We will consider issues of power and gender, class, as well as ethnicity from the waning years of the last dynasty through the present. Through this class, students will gain a comprehensive understanding of history, politics, economy, culture, and technology in modern China while engaging in critical interpretations of a wide range of texts and sources that shape contemporary global society.\n\nRequired Textbooks\n\nSpence, Jonathan D.\nThe Search for Modern China.\n3rd ed. W. W. Norton & Company, 2012. ISBN: 9780393934519.\n\nChen, Janet, Pei-kai Cheng, et al.\nThe Search for Modern China: A Documentary Collection.\n3rd ed. W. W. Norton & Company, 2013. ISBN: 9780393920857.\n\nFurther required readings can be found in the\nReadings\nsection. Towards the second half of the class, we will depart from the textbook more often to consider films, novels, and new scholarly works in modern Chinese history.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nClass participation and 8 weekly responses\n\nBrief (one paragraph) responses to the readings\n\n15%\n\nGeography quiz\n\nQuiz on geography of major sites associated with modern China's history\n\n5%\n\nMidterm\n\n75-minute in-class exam\n\n20%\n\nFilm, novel, or book report\n\n3-4 page essay on a Chinese (or China-related) film, novel, or work of non-fiction of your choice\n\n20%\n\n2 annotation assignments\n\nShort exercises involving annotating a week's readings\n\n20%\n\nHistorical timeline final project\n\nCreate a timeline of moments or forces leading up to a key event of your choice in modern China\n\n20%\n\nFor further detail on the above activities, see the\nAssignments\nsection.",
  "files": []
}