{
  "course_name": "Modern Mexico: Representations of Mexico City's Urban Life",
  "course_description": "The goal of this course is to offer a general introduction to 20th and 21st century literature and cultural production about Modern Mexico. Emphasis will be placed on the way intellectuals and artists have presented the changes in Mexico City’s urban life, and how these representations question themes and trends in national identity, state control, globalization, and immigration.",
  "topics": [
    "Fine Arts",
    "Visual Arts",
    "Humanities",
    "History",
    "Latin American History",
    "Language",
    "Spanish",
    "Literature",
    "International Literature",
    "Society",
    "Latin and Caribbean Studies",
    "Fine Arts",
    "Visual Arts",
    "Humanities",
    "History",
    "Latin American History",
    "Language",
    "Spanish",
    "Literature",
    "International Literature",
    "Society",
    "Latin and Caribbean Studies"
  ],
  "syllabus_content": "Course Meeting Times\n\nSeminars: 2 sessions / week, 1.5 hours / session\n\nPrerequisites\n\nOne intermediate course in Spanish. Class discussions, readings, and audiovisual materials are mainly in Spanish.\n\nCourse Description\n\nThe goal of this course is to offer a general introduction to 20\nth\nand 21\nst\ncentury literature and cultural production about modern Mexico. Emphasis will be placed on the way intellectuals and artists have presented the changes in Mexico City's urban life, and how these representations question themes and trends in national identity, state control, globalization, and immigration.\n\nThroughout the course, we will introduce a variety of mainly contemporary Mexican writers and visual artists whose works (novels, poems, cronicas, short stories, films, paintings) deal primarily with Mexico City's changing social landscape. In addition, the most recent border crossing artistic expressions will also provoke a comparison between other urban experiences, such as New York, Washington or Tijuana. Through critical discussion and frequent writing assignments, this class will improve student's ability to write clear, coherent and meaningful expository prose.\n\nRequired Books\n\nPacheco, Jose Emilio.\nLas batallas en el desierto\n. Tusquets, 2010. ISBN: 9788483832356.\n\nTenorio-Trillo, Mauricio.\nI Speak of the City: Mexico City at the Turn of the Twentieth Century\n. University of Chicago Press, 2015. ISBN: 9780226273587.\n\nEnrigue, Alvaro.\nHipotermia\n. Anagrama, 2011.\n\nGoldman, Francisco.\nInterior Circuit: A Mexico City Chronicle\n. Grove Press, 2015. ISBN: 9780802123770.\n\nFilms\n\nLos Olvidados (The Young and Damned)\n. Directed by Luis Bunuel. Black and White, 85 min. Ultramar Films, 1950.\n\nTlatelolco, Verano del 68 (Tlatelolco, Summer of 68)\n. Directed by Carlos Bolado. Color, 68 min. Maiz Producciones, 2013.\n\nAmores Perros (Love's a Bitch)\n. Directed by Alejandro Gonzalez Inarritu. Color, 154 min. Altavista Films, 2000.\n\nRevolucion. 10 cortos (Revolution)\n. Directed by Mariana Chenillo. Color, 105 min. Canana Films, 2010.\n\nEvaluation / Grades\n\nGrading is on the basis of frequent relatively small evaluations rather than on one or two major hurdles. See\nAssignments\nsection.\n\nACTIVITIES\n\nPERCENTAGES\n\nClass attendance and participation in class discussion sections\n\n30%\n\nThree short response essays\n\n15%\n\nFinal essay first draft\n\n15%\n\nFinal essay final draft\n\n30%\n\nFinal debate participation\n\n5%\n\nOral presentation of final projects\n\n5%",
  "files": [
    {
      "category": "Resource",
      "title": "Instrucciones para el debate",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-s01-modern-mexico-representations-of-mexico-citys-urban-life-spring-2015/c597503f7d7b6397427ac3957c6d362b_MIT21G_S01S15_debate_prep.pdf",
      "content": "Instrucciones para el debate 5%\n\n1. Tendran 8 minutos para presentar su respuesta a una de las preguntas planteadas. Su\nargumentacion debera fundamentarse principalmente en las lecturas que hemos hecho\ndurante el semestre. Puedes incluir citas exactas de textos o parafrasearlos (explicar lo\nque dice el texto con tus propias palabras indicando de quien tomas la idea). Si lo deseas\npuedes usar una presentacion Power Point para mostrar imagenes.\n\n2. Despues de que cada presentacion iniciaremos una sesion de preguntas de 5 minutos.\nPara ello cada uno de ustedes tendra que escribir 1 pregunta sobre la respuesta que\npresento y argumento su companero. Yo leere las preguntas y la persona que este\npresentando debera responder.\n\n3. El debate sera el 30 de marzo. Lunes regresando de vacaciones.\n\n4. Prepara una de las siguiente preguntas:\n\n●\n¿Que significa la idea del \"Brown Atlantis\" de Tenorio o el termino \"raza cosmica\" de\nVasconcelos? ¿Como se ve reflejada esta idea en las expresiones artisticas que\nhemos revisado?\n\n●\nPresenta los puntos mas sobresalientes del texto de Monsivais \"No sin nosotros\" y\nexplica el valor simbolico de la catastrofe de 1985.\n\n●\nDefine las caracteristicas del Mexico de los 50's de Miguel Aleman y cuales fueron los\ndesafios que planteo para los ciudadanos de la ciudad de Mexico\n\n●\nDesde tu punto de vista que elementos caracterizan la historia de la ciudad de\nMexico.\n\n●\nElige un barrio de la ciudad de Mexico y presentalo. Describe su ubicacion, su historia\ny por que te parece interesante hablar de el.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.S01 Modern Mexico: Representations of Mexico City's Urban Life\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Resource",
      "title": "Preguntas Guía (1)",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-s01-modern-mexico-representations-of-mexico-citys-urban-life-spring-2015/4d79fe66c20e4650d26216bed151be22_MIT21G_S01S15_tarea1.pdf",
      "content": "PREGUNTAS GUIA (1)\n\nEstas preguntas estan orientadas a hacer tu lectura de los textos mas selectiva y\neficiente. Revisalas antes de leer los textos y trata de responderlas al final de tu lectura. Este\nejercicio te ayudara a participar en las discusiones con mayor facilidad y responder a las\npreguntas en clase. No tienes que entregar tus respuestas a estas preguntas. Esta actividad\nno tiene asignada ninguna calificacion, es solo una guia.\n\nLa razon por la que he seleccionado estos textos es porque nos dan una idea de lo\nque implica el estudio de las ciudades desde distintas perspectiva teoricas. Mas que al\nestudio de las ciudades, estos textos estudian las representaciones que tanto los\nintelectuales, los artistas y los transeuntes construyen de ellas. El texto de Amanda Holmes\nhabla desde el punto de vista de los estudios literarios. Por otro lado, el texto de Garcia\nCanclini es un estudio escrito desde la antropologia social. De ahi que en su texto se\ndescribe un estudio concreto de la ciudad de Mexico. El estudia no la literatura, sino las\ntrayectorias de los transeuntes, las cuales, para el, son representaciones tan importantes\ncomo las literarias, las televisivas o las publicitarias. Por su parte Tenorio explica el principal\ndilema que enfrentan los intelectuales de la periferia al intentar caracterizar la identidad de\nuna region. Finalmente, en el texto de Paz leemos un ejemplo de como un intelectual en los\nanos cincuentas busco explicar los rasgos esenciales de la identidad mexicana.\n\nPREGUNTAS\n\nAmanda Holmes\n¿Cuales son las secciones que componen el texto?\n¿Por que la ciudad se ha convertido en este siglo en importante fuente de inspiracion para\nlas artes y la cultura?\n¿Que caracteriza a las ciudades coloniales?\n¿Cuales son las ideas de Richard M. Morse sobre las ciudades latinoamericanas\npostmodernas?\n¿Que ha cambiado entre la concepcion de las ciudades coloniales a la de las ciudades\npostmodernas del siglo XX?\n¿Cuales son las tres formas, segun Holmes, en que se puede interpretar la ciudad?\n¿Segun Holmes, que diferencia la percepcion de la ciudad por parte de la literatura del boom,\nde la literatura del postboom?\n\nNestor Garcia Canclini\n¿Para Garcia Canclini, que son las ciudades?\n¿En que consiste el estudio de Garcia Canclini sobre la ciudad de Mexico?\n¿Por que es importante estudiar las trayectorias de los transeuntes?\n¿Describe lo que comenta Garcia Canclini sobre los imaginarios urbanos en la seccion\n\"Imagineries as a Urban Heritage\"?\n¿A que conclusiones llega Garcia Canclini con su estudio?\n\nMauricio Tenorio\n¿En que consiste el doble dilema que enfrentamos al intentar explicar la Ciudad de Mexico?\n¿Que piensa Tenorio del estereotipo creado por Octavio Paz?\n\nOctavio Paz\n¿Segun Octavio Paz cuales son los rasgos del mexicano de nuestros dias?\n¿Como define al Pachuco?\n¿Como explica la relacion del mexicano con la soledad?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.S01 Modern Mexico: Representations of Mexico City's Urban Life\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Guía de lectura 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-s01-modern-mexico-representations-of-mexico-citys-urban-life-spring-2015/79d4b1b15f238ec8b4f6d1b8afbcdbde_MIT21G_S01S15_tarea2.pdf",
      "content": "Guia de lectura 2\n\n●\nJose Guadalupe Posada\n¿Quien es Jose Guadalupe Posada?\n¿Cual fue su oficio?\nSegun Thomas Gretton, ¿a que publico estaba dirigida la obra de posada?\nEn el articulo de Gretton ¿como se define el temino \"Popular\"?\nEn el articulo de Gretton ¿que significa \"Popular\" durante el Porfiriato?\nDespues de leer el articulo de Gretton, indica algunos rasgos de como era la vida\nen Mexico durante el Porfiriato.\nSegun Thomas Gretton, ¿cual es el sentido de la iconografia social de Posada\n(pagina 41)?\nExplica, segun Thomas Gretton, que es importante tomar en cuenta para poder\nentender la cultura mexicana durante el Porfiriato y que relacion tiene el trabajo de\nPosada con ello (pagina 4345)\n\n●\nManuel Gutierrez Najera. \"La novela del tranvia\"\n1. ¿Donde sucede la historia?\n2. ¿Con que compra el narrador a la Ciudad de Mexico?\n3. ¿Con que compara al vagon?\n4. ¿Como es la ciudad que existe mas alla de la peluqueria de Micolo?\n5. ¿Que personajes describe en el viaje?\n6. ¿Como es el senor que describe y que pensamientos le provoca?\n7. ¿Como es la senora que describe y que pensamientos le provoca?\n8. ¿Que relacion encuentras entre lo que sucede dentro del vagon y la ciudad que\nse describe fuera?\n\n●\nAngel del Campo.\n\"El inocente\"\n1. ¿Como es el espacio donde vive Roberto?\n2. ¿Como es el espacio donde vive Soledad?\n3. ¿Cual es la relacion de Roberto y Soledad?\n4. ¿Por que viven en mundos diferentes?\n5. ¿Crees que la estructura de este texto es la de un cuento?\n\n\"El fusilado.\"\n1. ¿Que evento narra esta cronica?\n2. ¿Que diferencias encuentras entre el espacio del suburbio y el arrabal?\n3. ¿Como puedes definir a la multitud que describe el narrador?\n\n4. ¿Que relacion encuentras entre la descripcion del escenario y el hecho violento\nque se narra?\n5. ¿Que importancia puede tener para la narracion la descripcion de la locomotora\ny el periodista que llegan al sitio?\n\n\"Los ruidos de la ciudad\"\n1. ¿Cuales son los sonidos de antes, aquellos que extrana el narrador?\n2. ¿Cuales son algunos de los sonidos de ahora que llaman la atencion del\nnarrador?\n3. ¿Que crees tu que el narrador intenta criticar con esta cronica?\n\n●\nFrancisco Zarco. \"Los transeuntes\", \"El crepusculo de la ciudad\" y \"Mexico de\nNoche\"\n\"Los transeuntes\"\n¿Cuando se esta cansado de uno mismo y de los demas que propone el narrador\nhacer?\n¿Que caracteristicas describe de la multitud en la pagina 163?\n¿Hay diferencias entre la clase alta y la clase media?\n¿Hay gente que no puede pasear?, ¿quienes son?,¿como caminan?\n¿Que categorias de paseantes describe?\n¿Que dice al narrador sobre la calle y la multitud, entre el espacio de la calle y el de\nla casa en la pagina 167?\n¿Que concluye el narrador en la pagina 168?\n\n\"El crepusculo de la ciudad\"\n¿Cual es el asunto de la narracion?\n¿Que sucede en la ciudad a la hora del crepusculo?\n¿Que sucede despues de las ocho (pagina 172)?\n¿Al final de la pagina 172 el narrador indica que \" La hora del crepusculo es la hora\nde nuestra epoca\", por que crees que dice eso?\n\n\"Noche de Mexico\"\n¿En la pagina 173 el narrador indica que la ciudad tiene vida como la de un\nindividuo, por que crees que dice eso?\n¿En lista algunas de las cosas que el narrador senala que suceden en la ciudad por\nla noche?\n¿Segun el narrador que sucede a las 10 de la noche?\n¿Que sucede cuando la ciudad duerme?\n¿Que concluye el narrador?\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.S01 Modern Mexico: Representations of Mexico City's Urban Life\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    },
    {
      "category": "Lecture Notes",
      "title": "Guía de lectura 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21g-s01-modern-mexico-representations-of-mexico-citys-urban-life-spring-2015/79ab3a32dfb50a7bd60148c13a912fe0_MIT21G_S01S15_tarea3.pdf",
      "content": "Guia de lectura 3\n\nOctavio Paz \"De la independencia a la revolucion\"\nEl laberinto de la soledad\n.\n\n1. ¿Segun Octavio Paz, cuando nace Mexico y explica por que el dice que Mexico nace\nen ese momento de la historia?\n2. Describe como Octavio Paz caracteriza al regimen de Porfirio Diaz en la paginas\n141-142.\n3. ¿Que significa el termino \"imitacion extralogica\" en la pagina 143?\n4. ¿Cual es, segun Paz, la imagen que ofrece Mexico a finales del siglo XIX?\n5. ¿De acuerdo con Octavio Paz, cuales son los antecedentes de la revolucion\nmexicana?\n6. ¿Cual era la situacion de los obreros y de los campesinos durante el regimen de\nPorfirio Diaz?\n7. En las paginas 155 y 156 hay varias definiciones de lo que son las revoluciones,\nexplica las diferencias entre la definicion de Ortega y Gasset y la de Paz sobre el caso\nde la revolucion mexicana.\n8. ¿Segun Octavio Paz, en que consiste el radicalismo de la revolucion mexicana?\n\nBeatriz Almanza Huesca. \" Entrada de los ejercitos revolucionarios a la ciudad de Mexico\"\n\n1. Este ensayo considera 4 momentos historicos importantes en la vida de la ciudad de\nMexico, ¿cuales son estos?\n2. ¿Que tipo de recuento historico hace Beatriz Almanza?\n3. Entre 1900 y 1910 la ciudad de Mexico crecio, ¿cuales fueron algunas de las colonias\ndirigidas a la clase pudiente? y ¿cuales fueron algunas de las primeras colonias para\ntrabajadores?\n4. ¿Cuales fueron los dos fenomenos que cambiaron la dinamica demografica del pais y\nde la ciudad de Mexico en particular entre 1900 y 1910?\n5. ¿Que sucedio en el hecho conocido como \"La decena tragica\"?\n6. ¿En que consistio la imposicion de la leva durante 1911?\n7. ¿Como era la vida en Mexico durante \"La decena tragica\"?\n8. ¿Como era la vida de la clase pudiente de la ciudad de Mexico despues del golpe de\nEstado de Huerta?\n\nLa llegada de los Constitucionalistas\n\n9. ¿Menciona dos elementos que llevaron a Huerta de renunciar a la presidencia en\n1915?\n10. ¿Con la entrada del ejercito constitucionalista que cambios o calamidades empezo a\nexperimentar la ciudad?\n11. ¿En que consistio la convencion de Aguascalientes?\n\nLa entrada de los ejercitos revolucionarios\n12. ¿Que hicieron las fuerzas constitucionalistas antes de su salida?\n13. ¿Cuando entran a Mexico las fuerzas convencionistas y quienes las integran?\n14. ¿Cual fue una de las primeras acciones de los convencionalistas en la ciudad?\n15. ¿Como fue la vida de la ciudad de Mexico durante la estadia del ejercitos\nrevolucionarios?\n16. ¿Cuando salieron de la ciudad las fuerzas revolucionarias?\n17. ¿Cuando llegaron las fuerzas constitucionalistas de nuevo a la Ciudad de Mexico?\n18. Menciona algunos aspectos de la segunda llegada constitucionalista.\n\nMariano Azuela. \"Anuncio en linea despegada\"\n\n1. ¿Como es el Doctor Olivares de los Montes? , ¿a que clase o grupo social pertence?\n2. ¿De que se disfrazo?\n3. ¿En que consistia el negocio puso en Peralvillo?\n4. ¿Cuando decidio dejar el negocio en Peralvillo?\n5. ¿Por que son importantes para la narracion los dos anuncios que publica el doctor en\nel periodico?\n6. Tomado en cuenta el contexto historico senalado por Beatriz Almanza, intenta ubicar\nhistoricamente los acontecimientos del cuento \"anuncio en linea despegada\"\n7. Usando ejemplos de la narracion, indica en donde se localiza la satira del texto de\nAzuela.\n\nMIT OpenCourseWare\nhttp://ocw.mit.edu\n21G.S01 Modern Mexico: Representations of Mexico City's Urban Life\nSpring 2015\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
    }
  ]
}