{
  "course_name": "Modeling Issues in Speech and Hearing",
  "course_description": "This course explores the theory and practice of scientific modeling in the context of auditory and speech biophysics. Based on seminar-style discussions of the research literature, the class draws on examples from hearing and speech, and explores general, meta-theoretical issues that transcend the particular subject matter. Examples include: What is a model? What is the process of model building? What are the different approaches to modeling? What is the relationship between theory and experiment? How are models tested? What constitutes a good model?",
  "topics": [
    "Engineering",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Health and Medicine",
    "Sensory-Neural Systems",
    "Science",
    "Biology",
    "Biophysics",
    "Engineering",
    "Systems Engineering",
    "Computational Modeling and Simulation",
    "Health and Medicine",
    "Sensory-Neural Systems",
    "Science",
    "Biology",
    "Biophysics"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nCourse Description\n\nThis course explores the theory and practice of scientific modeling in the context of auditory and speech biophysics. Based on seminar-style discussions of the research literature, the class draws on examples from hearing and speech and explores general, meta-theoretical issues that transcend the particular subject matter.\n\nNotes on the Seminars\n\nTwo consecutive seminar sessions are typically devoted to the discussion and analysis of each group of papers. The first week's scientific seminar focused on mastering the \"what?\" and the \"how?\" of each paper; the second week's modeling-issues seminar on the \"why?\". The first week aims at understanding, the second at integration and critique, focused especially on modeling issues.\n\nEach week, students assume responsibility as paper/problem presenters. Presenters lead discussion of individual papers (during the scientific seminars) or of particular problems/modeling questions (during the modeling-issues seminars). The responsibilities of the presenter assigned to a particular paper/problem include identifying and raising major issues; provoking discussion by asking pertinent questions; keeping the seminar on-schedule, moving, and focused; and helping ensure that everyone participates and understands. Rather than resorting to lectures or monologues, presenters should invite others to give opinions and input. The role of the presenter is not to provide information, nor is it to provide the \"right\" answer or opinion. Rather, it is to guide the discussion, to keep it moving, to raise objections, and to help everyone come to understand.\n\nDuring the scientific seminars, approximately 40-60 minutes will be allotted to each paper presentation, depending on the number of papers to be covered. Paper presentations are informal, journal-club style discussions of the scientific content of the paper. The goal of every presentation should be to make sure that everyone understands what was done and how. Although use of audio-visual aids is often helpful (e.g., when summarizing a complicated argument or presenting additional information), their use should be the exception rather than the rule. (Preparation of quality overheads and/or computer presentations can suck up huge quantities of time that would be better spent reading the papers.)\n\nNotes on the Weekly Assignments\n\nPreparation Sheets\n\nTo ensure stimulating and worthwhile discussion, everyone must prepare a preparation sheet for each paper prior to class. Although they can be retained for reference until the end of class, preparation sheets are due at the beginning of the class on which a paper is first discussed. A preparation sheet consists of a page or so of comments, criticisms, observations, and questions provoked by the paper. They can be word-processed or handwritten (legibly), pristine or coffee-stained (legibly), beautifully bound on bond or scrawled in blood on the backs of envelopes (legibly). Preparation sheets are meant to stimulate thought, not to preclude it with useless \"busywork\".\n\nProblem/Discussion Sets\n\nTo help you prepare for the second week's modeling seminars, the instructors will hand out problem/discussion sets containing specific questions and/or problems to be discussed in class. Individual students will be assigned to lead discussion of particular problems/issues. While rereading the papers for the second week's seminar, you should think about, work on, and write out answers to these questions-and come up with other questions of your own. Come prepared to discuss your answers and questions in class.\n\nGrading Policy\n\nACTIVITIES\n\nPERCENTAGES\n\nParticipation in Class Discussion\n\n50%\n\nLeading Discussion of Papers/Problems\n\n20%\n\nProblem Sets\n\n20%\n\nComplete Preparation Sheets\n\n10%\n\nCalendar\n\nWEEK #\n\nTOPICS\n\nKEY DATES\n\nIntroduction\n\nThe Process of Model Building\n\nProblem set 1 due\n\nAnalytic vs. Computational\n\nProblem set 2 due\n\nDetailed vs. Heuristic I\n\nProblem set 3 due\n\nSpecial Topic I: Dimensional Analysis and Scaling\n\nProblem set 4 due\n\nField Trip\n\nDetailed vs. Heuristic II\n\nProblem set 5 due\n\nSpecial Topic II: Curve Fitting, Resampling, and Monte Carlo\n\nProblem set 6 due\n\nForward vs. Inverse\n\nProblem set 7 due\n\nSpecial Topic III: Chaos and the Limits to Prediction\n\nProblem set 8 due\n\nSpecial Topic IV: Molecular Mathematical Biology\n\nProblem set 9 due\n\nStudent Selections I\n\nStudent Selections II\n\nThe Relation between Theory and Experiment\n\nProblem set 10 due\n\nRecapitulation\n\nProblem set 11 due",
  "files": [
    {
      "category": "Syllabus",
      "title": "page_syllabus.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/1b1e95a1d9a92dc7bda5570a6cd71ed2_page_syllabus.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nNOTES ON THE WEEKLY ASSIGNMENTS\nProblem/discussion sets:\nTo help you prepare for the second week's modeling seminars, the instructors\nwill hand out problem/discussion sets containing specific questions and/or problems to be discussed in\nclass. Individual students will be assigned to lead discussion of particular problems/issues. While rereading\nthe papers for the second week's seminar, you should think about, work on, and write out answers to these\nquestions--and come up with other questions of your own. Come prepared to discuss your answers and\nquestions in class.\nThings to think about:\nTo get you started formulating your own questions, we offer the following as an\noverwhelming number of suggestions for the kinds of things you might consider while rereading the papers\nfor the second week's modeling-issues seminar.\nWhat is the purpose of the model/paper? Why did the authors choose to model this?\nIdentify the model's degrees of freedom? Are there \"hidden\" degrees of freedom (e.g., network topol-\nogy)?\nSummarize the logic of the model. What are the premises or \"inputs\" (e.g., pieces of data, assump-\ntions, etc)? What are the intermediate steps? What are the conclusions or \"outputs\" (e.g., parameter\nvalues, predictions, etc)? Is the logic convincing? Is it circular?\nConstruct an outline of the paper. Construct an outline of the argument. Is the structure of the argu-\nment reflected in the organization of the paper?\nCarefully read the abstract and construct an outline of the paper/argument based solely on the abstract.\nCarefully examine the figures and their captions and construct an outline of the paper/argument based\nsolely on the figures.\nCompare and contrast the points of view expressed in the papers' introductions. What do the papers'\ninitial paragraphs reveal about the authors' modeling approach?\nConsider the paper as a narrative (i.e., a story) and summarize its dramatic structure. For example,\nidentify the principal protagonists (e.g., conflicting hypotheses), the plot, the climax, the resolution,\netc. Is the story interesting?\nWhat rhetorical devices (e.g., foreshadowing, repetition) do the authors employ to tell their story?\nCan you retell the \"story\" in a more interesting or coherent way?\nCompare and contrast the modeling techniques used in the papers. Why did the authors chose the\nones they did? Might others have been more appropriate?\nExamine the paper's notation. How could it be improved?\nCritique the figures for clarity and visual style. How well do they convey the information they're\nintended to?\nWhat are the model's simplifying assumptions? Is their validity established or discussed? Are there\n\"hidden\" assumptions? How would the model/conclusions change if the assumptions were relaxed?\nMake a list of arguments, statements, conclusions, equations, etc that you do not understand.\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nWhat are the model's predictions?\nIs the model/paper accessible to non-modelers? How well does it communicate to a wider audience?\nHow could it be improved?\nHow does the paper compare with other papers in the group? Is the model/paper interesting or elegant?\nIf so, what makes it so? If not, why not?\nHow do you assess the value of the model? How do the authors?\nOutline the major sections and subsections of the paper. Is the paper organized in the traditional\n\"Introduction-Methods-Results-Discussion\" mode? Consider alternative organizations. What are\nthe relative merits of the various possibilities?\nLocate the model/paper along the axes of simplicity/realism, analytic/computational,theory/phenomenology,\netc. Are these categories useful?\nHow do the number of degrees of freedom compare with the number of empirical measurements fit?\nAre theory and experiment compared on the same graph? On the same scales? Are there reasons why\nor why not?\nHow do the authors assess the reliability of the data upon which the model is based? How do you?\nHow are model parameter values determined? How well are they determined (e.g., what are their\nuncertainties)?\nHow well does the model fit the data? How well do the authors claim the model fits the data?\nWhat's your assessment of the \"correctness\" of the model? What about the model is \"right\"? What\n\"wrong\"? Explain your answers.\nIs the model robust?\nDoes the model have interpretive and/or explanatory power?\nDoes the paper convey a helpful picture of the origin of the phenomena?\nDo you get the sense that the authors understand their model? How well is that understanding con-\nveyed?\nWhat are the strengths and weaknesses of the model relative to others in the group? Relative to your\nconception of the \"ideal\"?\nHow would you improve the model? The paper?"
    },
    {
      "category": "Resource",
      "title": "weekly_assign.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/dfe25e3f12a5289355960b7743d2f024_weekly_assign.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nNOTES ON THE WEEKLY ASSIGNMENTS\nPreparation sheets:\nTo ensure stimulating and worthwhile discussion, everyone must prepare a preparation\nsheet for each paper prior to class. Although they can be retained for reference until the end of class,\npreparation sheets are due at the beginning of the class on which a paper is first discussed. A preparation\nsheet consists of a page or so of comments, criticisms, observations, and questions provoked by the paper.\nThey can be wordprocessed or handwritten (legibly), pristine or coffeestained (legibly), beautifully bound\non bond or scrawled in blood on the backs of envelopes (legibly). Preparation sheets are meant to stimulate\nthought, not to preclude it with useless \"busywork.\" Consequently, they may assume any number of forms.\nBut at a minimum, a preparation sheet will typically include the following:\n1. A summary of the major themes and/or results in the paper, including brief written statements of the\nauthors' approach and conclusions.\n2. A listing of all the questions and comments that you have on the material. Comments include iden\ntifying the strengths and weaknesses of the paper and whether you agree or disagree with the main\nconclusions. Try to include a minimum of 3-4 questions/comments for each paper. Write out the\nquestions/comments in full so that it will be easy for you to state them in class.\n3. An attempt to integrate the material with other knowledge, indicating the meaning or usefulness the\npaper has for understanding other concepts. For example, you might indicate what other ideas the\nmaterial substantiates, contradicts, or amplifies. Or come up with several examples that integrate\nand/or apply the material to other assigned papers, to previous topics, to other areas of speech and\nhearing, or to other areas of science.\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nThings to think about:\nTo get you started formulating your own questions, we offer the following as an\noverwhelming number of suggestions for the kinds of things you might consider while rereading the papers\nfor the second week's modelingissues seminar.\nWhat is the purpose of the model/paper? Why did the authors choose to model this?\nIdentify the model's degrees of freedom? Are there \"hidden\" degrees of freedom (e.g., network topol\nogy)?\nSummarize the logic of the model. What are the premises or \"inputs\" (e.g., pieces of data, assump\ntions, etc)? What are the intermediate steps? What are the conclusions or \"outputs\" (e.g., parameter\nvalues, predictions, etc)? Is the logic convincing? Is it circular?\nConstruct an outline of the paper. Construct an outline of the argument. Is the structure of the argu\nment reflected in the organization of the paper?\nCarefully read the abstract and construct an outline of the paper/argument based solely on the abstract.\nCarefully examine the figures and their captions and construct an outline of the paper/argument based\nsolely on the figures.\nCompare and contrast the points of view expressed in the papers' introductions. What do the papers'\ninitial paragraphs reveal about the authors' modeling approach?\nConsider the paper as a narrative (i.e., a story) and summarize its dramatic structure. For example,\nidentify the principal protagonists (e.g., conflicting hypotheses), the plot, the climax, the resolution,\netc. Is the story interesting?\nWhat rhetorical devices (e.g., foreshadowing, repetition) do the authors employ to tell their story?\nCan you retell the \"story\" in a more interesting or coherent way?\nCompare and contrast the modeling techniques used in the papers. Why did the authors chose the\nones they did? Might others have been more appropriate?\nExamine the paper's notation. How could it be improved?\nCritique the figures for clarity and visual style. How well do they convey the information they're\nintended to?\nWhat are the model's simplifying assumptions? Is their validity established or discussed? Are there\n\"hidden\" assumptions? How would the model/conclusions change if the assumptions were relaxed?\nMake a list of arguments, statements, conclusions, equations, etc that you do not understand.\nMake a list of arguments, statements, conclusions, equations, etc that you believe are incorrect or\nunjustified. Explain your reasoning.\nSummarize the model's \"region of validity.\" Does the paper identify these limits?\nHow do the authors suggest that the model be tested? Are there definitive experiments? Can you\nprovide alternative or better suggestions?\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nWhat are the model's predictions?\nIs the model/paper accessible to nonmodelers? How well does it communicate to a wider audience?\nHow could it be improved?\nHow does the paper compare with other papers in the group? Is the model/paper interesting or elegant?\nIf so, what makes it so? If not, why not?\nHow do you assess the value of the model? How do the authors?\nOutline the major sections and subsections of the paper. Is the paper organized in the traditional\n\"Introduction-Methods-Results-Discussion\" mode? Consider alternative organizations. What are\nthe relative merits of the various possibilities?\nLocate the model/paper along the axes of simplicity/realism, analytic/computational, theory/phenomenology,\netc. Are these categories useful?\nHow do the number of degrees of freedom compare with the number of empirical measurements fit?\nAre theory and experiment compared on the same graph? On the same scales? Are there reasons why\nor why not?\nHow do the authors assess the reliability of the data upon which the model is based? How do you?\nHow are model parameter values determined? How well are they determined (e.g., what are their\nuncertainties)?\nHow well does the model fit the data? How well do the authors claim the model fits the data?\n\nWhat's your assessment of the \"correctness\" of the model? What about the model is \"right\"? What\n\"wrong\"? Explain your answers.\nIs the model robust?\n\nDoes the model have interpretive and/or explanatory power?\nDoes the paper convey a helpful picture of the origin of the phenomena?\nDo you get the sense that the authors understand their model? How well is that understanding con\nveyed?\nWhat are the strengths and weaknesses of the model relative to others in the group? Relative to your\nconception of the \"ideal\"?\nHow would you improve the model? The paper?"
    },
    {
      "category": "Assignment",
      "title": "wekly_assignment.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/2a7bbcec2e94ee3c29e0c7e70520a23c_wekly_assignment.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nNOTES ON THE WEEKLY ASSIGNMENTS\nPreparation sheets:\nTo ensure stimulating and worthwhile discussion, everyone must prepare a preparation\nsheet for each paper prior to class. Although they can be retained for reference until the end of class,\npreparation sheets are due at the beginning of the class on which a paper is first discussed. A preparation\nsheet consists of a page or so of comments, criticisms, observations, and questions provoked by the paper.\nThey can be wordprocessed or handwritten (legibly), pristine or coffeestained (legibly), beautifully bound\non bond or scrawled in blood on the backs of envelopes (legibly). Preparation sheets are meant to stimulate\nthought, not to preclude it with useless \"busywork.\" Consequently, they may assume any number of forms.\nBut at a minimum, a preparation sheet will typically include the following:\n1. A summary of the major themes and/or results in the paper, including brief written statements of the\nauthors' approach and conclusions.\n2. A listing of all the questions and comments that you have on the material. Comments include iden\ntifying the strengths and weaknesses of the paper and whether you agree or disagree with the main\nconclusions. Try to include a minimum of 3-4 questions/comments for each paper. Write out the\nquestions/comments in full so that it will be easy for you to state them in class.\n3. An attempt to integrate the material with other knowledge, indicating the meaning or usefulness the\npaper has for understanding other concepts. For example, you might indicate what other ideas the\nmaterial substantiates, contradicts, or amplifies. Or come up with several examples that integrate\nand/or apply the material to other assigned papers, to previous topics, to other areas of speech and\nhearing, or to other areas of science.\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nThings to think about:\nTo get you started formulating your own questions, we offer the following as an\noverwhelming number of suggestions for the kinds of things you might consider while rereading the papers\nfor the second week's modelingissues seminar.\nWhat is the purpose of the model/paper? Why did the authors choose to model this?\nIdentify the model's degrees of freedom? Are there \"hidden\" degrees of freedom (e.g., network topol\nogy)?\nSummarize the logic of the model. What are the premises or \"inputs\" (e.g., pieces of data, assump\ntions, etc)? What are the intermediate steps? What are the conclusions or \"outputs\" (e.g., parameter\nvalues, predictions, etc)? Is the logic convincing? Is it circular?\nConstruct an outline of the paper. Construct an outline of the argument. Is the structure of the argu\nment reflected in the organization of the paper?\nCarefully read the abstract and construct an outline of the paper/argument based solely on the abstract.\nCarefully examine the figures and their captions and construct an outline of the paper/argument based\nsolely on the figures.\nCompare and contrast the points of view expressed in the papers' introductions. What do the papers'\ninitial paragraphs reveal about the authors' modeling approach?\nConsider the paper as a narrative (i.e., a story) and summarize its dramatic structure. For example,\nidentify the principal protagonists (e.g., conflicting hypotheses), the plot, the climax, the resolution,\netc. Is the story interesting?\nWhat rhetorical devices (e.g., foreshadowing, repetition) do the authors employ to tell their story?\nCan you retell the \"story\" in a more interesting or coherent way?\nCompare and contrast the modeling techniques used in the papers. Why did the authors chose the\nones they did? Might others have been more appropriate?\nExamine the paper's notation. How could it be improved?\nCritique the figures for clarity and visual style. How well do they convey the information they're\nintended to?\nWhat are the model's simplifying assumptions? Is their validity established or discussed? Are there\n\"hidden\" assumptions? How would the model/conclusions change if the assumptions were relaxed?\nMake a list of arguments, statements, conclusions, equations, etc that you do not understand.\nMake a list of arguments, statements, conclusions, equations, etc that you believe are incorrect or\nunjustified. Explain your reasoning.\nSummarize the model's \"region of validity.\" Does the paper identify these limits?\nHow do the authors suggest that the model be tested? Are there definitive experiments? Can you\nprovide alternative or better suggestions?\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nWhat are the model's predictions?\nIs the model/paper accessible to nonmodelers? How well does it communicate to a wider audience?\nHow could it be improved?\nHow does the paper compare with other papers in the group? Is the model/paper interesting or elegant?\nIf so, what makes it so? If not, why not?\nHow do you assess the value of the model? How do the authors?\nOutline the major sections and subsections of the paper. Is the paper organized in the traditional\n\"Introduction-Methods-Results-Discussion\" mode? Consider alternative organizations. What are\nthe relative merits of the various possibilities?\nLocate the model/paper along the axes of simplicity/realism, analytic/computational, theory/phenomenology,\netc. Are these categories useful?\nHow do the number of degrees of freedom compare with the number of empirical measurements fit?\nAre theory and experiment compared on the same graph? On the same scales? Are there reasons why\nor why not?\nHow do the authors assess the reliability of the data upon which the model is based? How do you?\nHow are model parameter values determined? How well are they determined (e.g., what are their\nuncertainties)?\nHow well does the model fit the data? How well do the authors claim the model fits the data?\n\nWhat's your assessment of the \"correctness\" of the model? What about the model is \"right\"? What\n\"wrong\"? Explain your answers.\nIs the model robust?\n\nDoes the model have interpretive and/or explanatory power?\nDoes the paper convey a helpful picture of the origin of the phenomena?\nDo you get the sense that the authors understand their model? How well is that understanding con\nveyed?\nWhat are the strengths and weaknesses of the model relative to others in the group? Relative to your\nconception of the \"ideal\"?\nHow would you improve the model? The paper?"
    },
    {
      "category": "Assignment",
      "title": "pset01_wk02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/89d380277e2b90092be863caa560886b_pset01_wk02.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nProblem/Discussion Set for \"The Process of Model Building\"\n1. Modeling Strategies. How do the authors of each paper justify making a model of the middle ear?\nDescribe the overall approaches. How are their modeling strategies similar and/or different? Summa\nrize the modeling \"philosophies\" that the authors convey in each paper.\n2. Model Testing. Zwislocki, Kringlebotn, and Pascal et al. all relate their middle ear models to experi\nmental findings. In each paper, what data were used to constrain model parameters? What data were\nused to test the model? Do the authors distinguish between \"constraining parameters\" and \"testing\nthe model\"? Is it important to make this distinction?\n3. Model Success. Each paper makes claims about the validity of their representation of the middle\near. What are these claims, and how well do the authors support them? How do the various authors\ndetermine and justify the validity of their parameter values?\n4. Averaging. As Zwislocki and Kringlebotn illustrate, it is common practice to compare middleear\nmodels to data representing an \"average\" middle ear. What are the pros and cons of this practice?\nIf averaging is performed, how should it be done? For example, is it better to take arithmetic or\ngeometric means?\n5. Model Topology. Each of the three middleear models has the same overall network topology (i.e.,\nthe sequence and interconnection of major functional units or blocks). What determines this topology\nand how do the authors justify it?\n6. Nonlinearity. Describe the nonlinearities introduced by Pascal et al. What assumptions are made?\nAre they physiologically reasonable? Why or why not?\n7. Modeling the Eardrum. How do the various models for the eardrum differ? Imagine that you\ndecided to test the various models of eardrum transduction and/or propose a new one. How would you\ngo about it?\n8. Cochlear Compressibility. All of the middleear models implicitly assume that the cochlear fluids\nare incompressible. Is this assumption manifest in their models? How might you modify the models\nto allow for a nonzero cochlear compressibility? Are there any circumstances when allowing for a\nnonzero compressibility might be important?\n9. Reciprocity and Reverse Transmission. The middle ear is believed to be a reciprocal system. What\ndoes this mean? Evoked otoacoustic emissions, which involve both forward and reverse transmission\nby the middle ear, provide a possible application of reciprocity. One perhaps relevant measure of\nforward transmission is the pressure transfer function Tforward\nPow =Pec, where Pow is the pressure\n\ninside the oval window and Pec is the earcanal pressure. Measurements of jTforward in human cadavers\nj\nindicate that it is about 15-20 dB re 1 near 1 kHz. Can you use this information to find the pressure\ntransfer function in the reverse direction, Treverse?\n10. Better Models. How might you go about making a better middleear model? Outline possible strate\ngies, based on several different definitions of \"better.\" What measurements would be needed to deter\nmine the input and output characteristics of the middle ear?\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher"
    },
    {
      "category": "Assignment",
      "title": "pset02_wk03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/a7999ca450faa8a3f5a946a6f3a591f7_pset02_wk03.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nProblem/Discussion Set for \"Analytic vs Computational\"\n1. Newton in a Tapered Tube. After P&A and S&Z went to press, disagreement was discovered in the\nliterature about how to describe fluid motion in a tapered tube. Consider the motion of a slab of fluid\nof width x in a tapered tube of variable crosssection S.x/ as illustrated in Fig. 1.\nΔx\np(x,t) = pressure\nS(x) =\nv(x,t) =\ncrosssectional area\nfluid particle velocity\nFigure 1: Charming little schematic of a fluidfilled tapered tube.\nApplying Newton's 2nd Law yields the relation\nS.x/p.x; t/ S.xCx/p.xCx; t/ D xS.xC 1=2x/ v.xC 1=2x; t/ ;\n(1)\n„\nƒ‚\n...\n„\nƒ‚\nP\nNet force on slab\nmass of slab\n...„\nacceleration\nƒ‚\n...\nwhere p.x; t/ is the pressure (assumed uniform in any cross section), is the fluid density, v.x; t/\nis the fluid particle velocity, and the dot indicates a time derivative. Take the limit x ! 0, define\nthe fluid volume velocity u\nSv, and assume an harmonic time dependence at angular frequency !\n\n[e.g., let p.x; t/ D P.x; !/ei!t and u.x; t/ D U.x; !/ei!t]. Then\nd.SP /\ndx\nD i!U\n.e.g., Fletcher; de Boer; Koshigoe et al./:1\n(2)\nBut S&Z and P&A both seem to use\ndP\ndx D i!\nS U :\n(3)\n(a) Verify that S&Z and P&A use Eq. (3) or its equivalent.\n(b) Verify that the two equations are equivalent only if S D constant. Which, if either, of the two\nequations is correct for the tapered tube?\n(c) What effect does the error--if that's what it is--have on S&Z's and P&A's conclusions about\ntapering?\n1References:\nFletcher, H. (1953). Speech and Hearing in Communication. ASA Edition (1995), J. B. Allen, ed. Woodbury, NY: Acoustical Society of\nAmerica. (Page 243, Eq. 14-18).\nde Boer, E. (1980). \"Auditory physics. Physical principles in hearing theory. I,\" Phys. Rep. 62:88174. (Page 140, Eq. 6-d).\nKoshigoe, S., W.K. Kwok, and A. Tubis (1983). \"Effects of perilymph viscosity on lowfrequency intracochlear pressures and the cochlear\ninput impedance of the cat,\" J. Acoust. Soc. Am., 74:486-492. (Page 487: Eqs. 3 & 4).\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\n2. Erroneous(?) Formula for the Cochlear Input Impedance. As LN&P discuss (Sec. 3a, p. 125, 2nd\ncolumn), it is sometimes argued that the cochlear input impedance has the approximate value\nZc c=A ;\n(4)\ncorresponding to the wave impedance of an acoustic plane wave propagating without reflection in\nan infinite tube (where D density of perilymph, c D speed of sound in perilymph, and A D area\nof stapes footplate). They argue, however, that there are compelling theoretical and experimental\nreasons for rejecting this view. Briefly summarize these reasons. Can you nonetheless find a way of\nreinterpreting the formula that makes it correct?\n3. Circularity? S&Z begin ~IF on page 1278 by assuming that the wavelength changes slowly. From\nthis, they derive Eq. (13) for the cochlear input impedance. Combining Eq. (13) with the LN&P data,\nS&Z obtain Eq. (21), which they then interpret as indicating that the wavelength changes slowly! As\nif to justify this apparently circular argument, S&Z write at the end of ~IH that Eq. (21) provides \"ex\npost facto justification for the WKB expansion used to obtain Eq. (13).\" Is their reasoning legit, or is\nthe entire argument circular? Why or why not? If the argument is circular, can it be straightened? If\nso, how?\n4. Apical Reflections. In Fig. 7, P&A investigate the effect of tapering and note that \"the amplitude of\nthe apical reflection : : : increases for stimulus frequencies below f cl\nCF.xL/.\" They explain that this is\ndue to \"an increase in impedance mismatch between the helicotrema and the scalae\" resulting in \"a\nlarger reflection coefficient at the apical end of the cochlea\". P&A reiterate this point in their final\nparagraph: \"In the realistic scalae area case, the magnitude of the [apical] reflections [is] much greater\ndue to an increase in impedance mismatch between the scalae and the helicotrema.\"\n(a) How convincing do you find their argument for the increase in amplitude of the standing waves?\nFor example, what impedances do P&A use for the scalae and for the helicotrema in Fig. 7? How\ndoes the predicted impedance mismatch (reflection coefficient) depend on tapering (i.e., on s1)?\n(b) If you aren't yet convinced, what might P&A have done to make their case more compelling? Or\nmaybe you can provide an alternative explanation for their findings?\n5. Sanity Checks. LN&P use mechanical analogues; P&A use numerical techniques; S&Z use approx\nimate analytic methods. What \"sanity checks\" do each of them use to determine whether their results\nare reasonable (i.e., not simply the result of some technical error)? Are there additional things you\nthink they might/should have done?\n6. Modeling Strategies. LN&P, P&A, and S&Z take three very different approaches to modeling essen\ntially the same data.\n(a) Characterize these different approaches. Your answer should go beyond simply labeling them as\n\"computational\" or \"analytic\"; these distinctions are only part of the story.\n(b) To what extent do the papers reach similar conclusions? Where do they disagree? How do you\nresolve any discrepancies?\n(c) What are the strengths and weaknesses of the various approaches?\n(d) Discuss the relative pros and cons of \"computational\" vs \"analytic\" models. Illustrate your re\nmarks with examples from the three papers.\n7. Justification for Approach. LN&P use lumped mechanical analogues and both P&A and S&Z use\na linear, onedimensional transmissionline model. How do the authors justify their use of these\nmodels? Discuss other simplifying assumptions made by the authors. Are the assumptions justified?\nWhat limits do these assumptions place on the \"region of validity\" of each model?\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\n8. Selling It. How do the different papers \"sell\" their work to the reader? For example, how do the\ndifferent authors motivate their work? Do they convince you that a model of the cochlear input\nimpedance is important or interesting? How are the different models and interpretations of the data\ninfluenced by these goals? Can you think of ways that the \"packaging\" might have been improved to\nenhance the accessibility and/or impact2 of the work?\n2According to the Science Citation Index, as of Feb. 2003 P&A and S&Z have been cited a total of 10 and 7 times, respectively, not counting\ninnumerable citations by the authors themselves."
    },
    {
      "category": "Assignment",
      "title": "pset03_wk04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/7df9241da373edca05b7910e3b80abae_pset03_wk04.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nProblem/Discussion Set for \"Detail vs Heuristic I\"\n1. Model Complexity. In their second paper, K&D increase the complexity of their model by adding\na dynamic spikeblocking mechanism. In Z et al., the \"spatially extended\" model for MSO cells is\nmore complex than the point neuron models considered previously. In each case, are you convinced\nthat the added model complexity is helpful in understanding the mechanisms underlying the neuronal\nresponses?\n2. Simplicity vs Realism. What reasons do Z et al. and K&DI,II give for adopting a more realistic or\nmore simplistic representation of the neuron membrane properties? What insights would have been\nmissed [or gained] if Z et al. had adopted a \"leaky integrator\" model instead of a \"channelbased\"\nmodel? What additional insights might K&D have lost [or gained] had they adopted a channelbased\nmodel? Would your answers change if more information were available concerning the membrane\nproperties of cochlear nucleus and MSO neurons?\n3. Parameter Values and Assumptions. Explain and evaluate how K&D and Zhou et al. constrain their\nmodel parameters (e.g., are they constrained in a convincing way?). Outline the main assumptions of\nthe models and evaluate their validity.\n4. Modeling Role. Compare the role that models play in G&K, K&D, and Z et al. If the roles are\ndifferent, are the differences appropriate? Which of the models, if any, would you characterize as\n\"heuristic\"?\n5. Modeling Insights. Which of the three papers (G&K, K&D, Z et al.) provides the greatest insights\nand which the least? How much does your answer depend on (1) the issue addressed by each paper,\n(2) the modeling approach, (3) the way the paper is written, (4) other factors?\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher"
    },
    {
      "category": "Assignment",
      "title": "pset04_wk05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/1a8aa08969bf7c00925d2dc61ac31905_pset04_wk05.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nProblem/Discussion Set for \"Dimensional Analysis\"\nProblem 1. Systems of Units The units we choose to measure length, mass, and time are arbitrary human\nconventions and we are free to choose them for our convenience.\n1. Some people use special units of mass, length, and time chosen so that the speed of light (c D\n2:998\n108 m/s in MKS units), Planck's constant over 2 („ D 1:05457\n1034 J s in MKS units),\n\nand Newton's gravitational constant (G D 6:67\n1011 m3/(kg s2) in MKS units) are all numerically\n\nequal to 1. What are the equivalent MKS values for these special units of length, mass, and time?\nWhen might you expect the use of these units to be convenient?\n2. Some advanced SHBT students and faculty use special units of mass, length, and time chosen so that\nthe speed of sound at room temperature (c D 343 m/s in MKS units), the Cambridge critical band at 1\nkHz (CB D 132:64 Hz in MKS units, Glasberg and Moore, 1990), and the binaural minimum audible\nfield at 1 kHz (MAF D 0 dB SPL in MKS units, ISO389-7, 1996) are all numerically equal to 1.\nWhat are the equivalent MKS values for these special units of length, mass, and time? When might\nyou expect the use of these units to be convenient?\nProblem 2. A Simple Cochlear Model The simple transmissionline model of the cochlea discussed by\nShera and Zweig (Sec. II-A of \"A symmetry suppresses: : :\") is defined by the variables/parameters\nx; !; M .x/; M.x/; R.x/; C.x/; and l :\nN\nWhat are the dimensions of each? How many independent dimensionless combinations (groups) can be\nformed? Identify and interpret the dimensionless groups used by Shera and Zweig.\nProblem 3. Short Problems in Dimensional Analysis\n1. Radius of a black hole. Use dimensional analysis to show that a black hole of mass M should have a\nradius of order GM=c2, where G is Newton's gravitational constant and c is the speed of light. What\nis the approximate radius for a black hole with the mass of the sun (M D 2 1030 kg)?\n2. Deepwater waves. Waves on the surface of a deep ocean travel with a speed v that depends on their\nwavelength , but not on their amplitude. Using dimensional analysis find how the wave speed should\ndepend upon the wavelength and the density of the water.\n3. Vibration of a water drop. When disturbed from their resting spherical shape, small liquid drops (e.g.,\nraindrops or drops from a leaky faucet) can oscillate under the action of their own surface tension.1\nUsing dimensional analysis, find how the period of oscillation depends upon the radius R and density\nof the drop. Use your formula to estimate the period of vibration of a raindrop.\n4. Vibration of a star. When disturbed from their resting spherical shape, large liquid drops (e.g., Lord\nRayleigh's liquiddrop model of the sun) can oscillate under the action of their own gravity. Using\ndimensional analysis, find how the period of oscillation depends upon the radius R and density of\nthe drop. Use your formula to estimate the period of vibration of the sun.\n5. Roasting a turkey. Cookbooks tell you to remove a turkey from the oven when its interior reaches\na certain temperature (roughly 180ıF in the thigh). Using dimensional analysis find how the total\ncooking time should depend on the size of the turkey. Assume that the turkey has characteristic\ndimension D, thermal conductivity k, mass density , and specific heat at constant pressure Cp.2 How\ndo your results compare with the recommendations of the National Turkey Federation (see Table 1)?\n1Surface tension is defined as the force exerted by a surface per unit length over which it acts.\n2The thermal conductivity of the turkey is defined as the rate of flow of heat through a unit area when a temperature gradient of one degree per\nunit distance is established perpendicular to that area. The specific heat of the turkey is defined as the quantity of heat required to raise a unit mass\nby one degree of temperature.\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nApproximate Roasting Times (hours)\nWeight (lbs)\nUnstuffed\nStuffed\n8-12\n12-14\n14-18\n18-20\n20-24\n23=4-3\n3-33=4\n33=-41=4\n41=4-41=\n41=2-5\n3-31=2\n31=2-4\n4-41=4\n41=4-43=\n43=-51=4\nTable 1: Approximate roasting times at 325ıF for a fresh or thawed turkey (National Turkey Federation, as quoted in\nthe Boston Globe, 11/24/97).\n6. Mass in a tube. A tube of mass M and length l is free to swing on a pivot. A mass m is positioned\ninside the (frictionless) tube at the end near the pivot. Initially horizontal, the tube is released and\nallowed to swing down under the influence of gravity. Let be the fraction of the total length of the\nm\nM\nl\ntube that the mass has traversed by the time the tube passes through the vertical. How does the fraction\ndepend on l?\n7. Ideal gas. A box of volume V contains N particles of mass m, moving in various random directions\nwith speed v. Using dimensional analysis find how the pressure of such a gas depends on N , V , m,\nand v.\n8. Planetary motion. Show that Kepler's third law, R3 = T 2 D constant, follows from the application of\nNewton's law of gravitation, F D GM m=R2, to circular orbits. Use dimensional considerations.\nProblem 4. First Digits of the Fundamental Physical Constants\nThe attached table from the National Institute of Standards and Technology (NIST) gives a \"complete\nlisting\" of fundamental physical constants such as the speed of light, Planck's constant, the elementary\ncharge, etc. For each value in the table for which a symbol is given, determine the first significant (i.e.,\nnonzero) digit in its value. (For example, the first significant digit of c, the speed of light, is 2 in MKS\nunits.) For simplicity, include values even when their symbols represent combinations of other constants on\nthe list (e.g., e= h under \"elementary charge\").\n1. Construct a histogram showing the number of times each of the nine digits 1-9 occurs in the first\nposition.\n2. You should find that roughly 1/3 of the numbers on the list begin with the digit 1. Can you think of a\nreason why the digit 1 is so prevalent?\n3. The values in the table are generally given in MKS (SI) units. Would you have obtained a similar\nresult if the values had been given in some other system of units (e.g., units based on the British inch\nand pound or the units used by advanced SHBT students)?\nProblem 5. Physical Model of the Ear To help determine the vibratory pattern of the basilar membrane,\nB ek esy built a physical model of the human cochlea in which the cochlear partition was represented by a\nthin rubber membrane. During construction he faced the following problem:\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nThe width of the basilar membrane close to the stapes is about 0.1 mm and increases to about\n0.5 mm at the apex of the cochlea. The fluidfilled canal above and below the basilar membrane\nis about 2 mm in diameter from one end of the cochlea to the other. It is difficult to carry out\nexperiments with dimensions as small as these, and therefore it is desirable first of all to enlarge\nthem in the model without altering any of the motional phenomena. If all the dimensions of the\nmodel are expressed in relative numbers based on one length l, which can be the length of the\nbasilar membrane, then two such models with the same relative dimensions will themselves be\nalike. Also their motions will be similar, provided care is taken that, despite the change in length\nby some factor, the equation of motion remains the same.\nAssume, as B ek esy did, that \"the movement of the membrane, as well as the surrounding fluid, is determined\nby a series of constants: the density and viscosity of the fluid, the frequency of movement of the\nstapes f , and the elasticity of the membrane .\"3 Therefore, B ek esy concluded, the equation describing\nthe displacement, d, of the membrane at position x and time t resulting from a stapes velocity v0 has the\ngeneral form '.d; x; t; v0; l; ; ; f; / D 0.\n1. Use dimensional analysis to determine the necessary conditions for enlarging the cochlea while keep\ning its responses \"geometrically similar\" (i.e., identical up to a scale factor). Explain your reasoning.\n2. B ek esy chose to make his physical model roughly 5 times the size of the real cochlea. If the model is\nenlarged by this factor, by what factor must the volume elasticity of the rubber partition be changed\nto preserve similarity? Assume that B ek sy filled his model cochlea with water (whose density and\nviscosity are not significantly different from those of the cochlear fluids).\n3. If the model size and membrane elasticity are changed as calculated above, determine the approximate\nupper and lower frequency limits of the model basilar membrane (i.e., determine the maximum and\nminimum \"characteristic frequencies\" of the rubber partition). Assume that the normal human cochlea\nrepresents frequencies from 20 Hz-20 kHz.\nProblem 6. Feeding Gulliver In Jonathan Swift's Gulliver's Travels, Gulliver describes how the Lil\nliputians determine his requirements for food and drink:\n\"Having taken the height of my body by the help of a quadrant, and finding it to exceed theirs\nin the proportion of twelve to one, they concluded from the similarity of their bodies, that mine\nmust contain at least 1728 of theirs, and consequently would require as much food as was nec\nessary to support that number of Lilliputians.\"\n1. Show that Swift's calculation is based on simple linear scaling in which limb diameters are propor\ntional to length (d / l).\n2. Deduce Galileo's scaling law from his famous diagram of bone scaling (Fig. 27). If a Lilliputian\nGalileo had applied this scaling formula, how many Lilliputian meals would he have found Gulliver\nto require?\n3. If the Lilliputian Galileo had also known about Kleiber's metabolic scaling, how many Lilliputian\nmeals would he have found Gulliver to require?\n4. If a Lilliputian McMahon had done the calculation, how many Lilliputian meals would he have found\nGulliver to require?\n3The volume elasticity, , is defined as the volume displacement per unit length of the membrane when a unit pressure difference is applied\nacross it. For simplicity, B ek esy ignored any difference in density between his rubber partition and that of the cochlear fluids."
    },
    {
      "category": "Assignment",
      "title": "pset05_wk07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/21cff3b537488274e7b630cadcafb10d_pset05_wk07.pdf",
      "content": "HST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\nDiscussion/ Problem Set for Detailed vs. Heuristic II\nMelcher et al. (1996a, b) examined the effects of focal brainstem lesions on the brainstem\nauditory evoked potential (BAEP) of cats. Melcher & Kiang (1996) then used the lesion results\n(combined with other anatomical and physiological data) to deduce which of the many cell\npopulations in the auditory brainstem generate the BAEP. Their conclusions are summarized in\nFigure 1 below. This problem examines whether some of the conclusions illustrated in Figure 1\ncould have been reached without performing lesion experiments.\nFigure by MIT OCW.\nAfter Melcher and Kiang, 1996.\nAVCNa\nAVCNp\nPVCNa\nPVCNp\nDCN\nCochlear\nNucleus\nIpsilateral SOC\nContralateral SOC\nSpiral ganglion\ncell\nGlobular\nSpherical\nMNTB\nMSO\nLSO\nNLL\nIC\n?\nP1\nP1\nP2\nP2\nP3\nP3\nP4\nP4\nP5\nP5\nN1\n1 msec\nVertex -\nIpsilateral Earbar\nVertex -\nContralateral Earbar\na\nb\nFigure 1: Cellular generators of the click-evoked BAEP in cats. Colors code for the relationships between cell populations and each part of the\nBAEP waveforms (at top). Code applies only to the labeled positivities (P1, P1a - P5) and negativity (N1). Except for the spiral ganglion cell\ncontribution (blue shading), the BAEP is largely generated by pathways originating with the spherical cells in the AVCNa (three shades of\ngreen) and with the globular cells in the AVCNp and PVCNa (two shades of purple).\nAuditory nerve\nTrapezoid body\nLateral lemniscus\nVNLL\nMidline\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher\n\nHST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\nThis problem is presented within a framework for BAEP generation that amounts to a\nsimple adaptation of Goldstein & Kiang's model (1958). In this framework (Figure 2, see\nfollowing page):\n(1) The BAEP equals the sum of potentials produced by each cell population in the\nbrainstem (e.g., spherical cells of the cochlear nucleus, MNTB principal cells.).\n(2) The potential produced by each cell population, V(t), is further decomposed into the\nsum of potentials produced by each cell in the population.\n(3) The potential produced by the ith cell, vi(t), is written as the convolution of two\nquantities:\n(i) the unitary potential produced at the BAEP recording electrodes when the cell\ndischarges once (ui(t)) and,\n(ii) the instantaneous rate at which the cell discharges following the BAEP stimulus (ri(t),\nessentially the cell's PST histogram).\nPart (4) in Figure 2 shows the dependence of V(t) on N (number of cells in the\npopulation), ui(t) and ri(t).\nThe first part of this problem arrives at a possible relationship between the fiber diameter\nof brainstem cells and the amplitude of the unitary potential these cells produce at the BAEP\nrecording electrodes. The second part asks you to use this relationship, along with published\nanatomical and physiological data for brainstem cells, to deduce \"on the back of an envelope\",\nwhich cell populations contribute most to the BAEP.\nPart 1\nFigure 3 shows: (top) a diagrammatic cell with many of the morphological features of an\nauditory brainstem cell, (middle) a cross-sectional view through the cell's myelinated axon, and\n(bottom) an electrical model for the two consecutive short segments along the axon.\nAssume that the following standard scaling relationships apply when extending the\nelectrical model for the axon from one cell to another (Rushton, 1951; Goldman and Albus,\n1968):\n- The ratio of axon diameter, d, to fiber diameter, D, is constant (~0.6; Rushton, 1951).\n- Ra, the resistance per unit length to axial current flow within the axon, decreases with\nincreasing axon cross-sectional area (i.e., Ra ~ 1/d2).\n- The myelin conductance and capacitance per unit length (Gm, Cm) are independent of\nfiber diameter. Specifically, Gm and Cm ~ ln(D/d) (the dependence on geometry for the\nconductance and capacitance between two concentric cylinders).\n- Node length is independent of fiber diameter (McDonald and Ohlrich, 1971).\n- Channel conductances per unit area and membrane capacitance per unit area of nodal\nmembrane is fixed.\n- Inter-nodal length is proportional to fiber diameter (Hursh, 1939).\n\nHST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\nBAEP(t) = V (t) + V (t) + ... + V (t) + ...\npotential produced by the kth\ncell population\nk\nV(t) =\nv (t)\ni=1\nN\ni\n!\nnumber of cells in the population\npotential produced by\na particular population\npotential produced by one\ncell in that population\nv (t) = u (t) * r (t)\ni\ni\nu (t) = unitary potential (potential produced\neach time cell i discharges)\nr (t) = instantaneous discharge rate (instantaneous\nrate at which cell i discharges following\nthe BAEP stimulus)\ni\ni\ni\ncell i\nV(t) =\nu (t) * r (t) = u(t) *\nr (t) = N u(t) * r(t)\ni=1\ni=1\nN\nN!\n!\ni\ni\ni\nFactors affecting the amplitude of V(t):\n- number of cells in the population\n- degree to which cells in the population discharge in synchrony with each other\n- amplitude of u(t), r(t)\nsound\nif u(t) and r(t)\nare the same\nfor all cells\nFigure 2: A general model for BAEP generation. (see Goldstein and Kiang, 1958; Wang, 1979; Melcher and\nKiang, 1996)\n\nHST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\nFigure 3: Diagrammatic cell and electrical model for its fiber. In the model (bottom), the fiber has been divided\ninto segments of length Δ. Vmi and Imi are the transmembrane potential and current, respectively, on the ith\nsegment. Membrane of nodes is modeled using a voltage-dependent sodium conductance (gNa), leak conductance\n(gL), and capacitance (cnode). The remaining parameters are defined in the text. (from Melcher, 1995)\nWhen the relationships above hold, the following are true for two discharging fibers with\ndifferent diameters:\n- The transmembrane potential waveform and amplitude are identical for corresponding\nnodes on the two fibers (e.g., the ith (counting from the cell body) on both fibers).\n- The nodal current waveform is the same at corresponding nodes.\nThe time delay in the voltage or current waveform is the same from one node to the next.\nAs a result, the well-known proportionality between conduction velocity and fiber diameter\noccurs because inter-nodal length (end hence the distance traveled by an action potential in a\ngiven unit of time) increases with increasing fiber diameter. [Note that the preceding statements\nstrictly apply to a \"free-running\" action potential (i.e. one that is unaffected by the ends of the\ncell or any branches.]\n(a) Assume the density of current through nodal membrane (amp/m2) is the same regardless of\nfiber diameter (Can you argue why this would be true?). How does the total nodal current\ndepend on fiber diameter?\n\nHST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\n(b) Now consider the extracellular potential (i.e., unitary potential) produced by a cell like the\none in Figure 3. Assume that the unitary potential can be written as a weighted sum of the\ntransmembrane currents on consecutive short segments (length Δ) of the cell. Further assume\nthat the cell lies in an electrical conductor of infinite extent (conductivity σ, units of\nlength/resistance) and that transmembrane current on each segment can be modeled as a point\nsource of current. Eq. (1) describes the potential, V, produced by one segment with current I. r\nis the distance from the current source. Use dimensional analysis to verify that eq. (1) is correct.\nI\nr\n!\nV(r) = I / (4πσ r)\n(1)\n(c) Next, consider the extracellular potential produced by a complete cell (not just one segment).\nFor simplicity, consider a cell with a straight, unbranched fiber. Assume all of the\ntransmembrane current flows through nodes of Ranvier (i.e., the myelin of the internodes is\nperfectly insulating. The current sources produced by this cell at one instant in time are shown in\nFigure 4 (bottom). The In correspond to the transmembrane current on N consecutive nodes on\nthe fiber (each dot on the z-axis indicates the location of a node). L is the inter-nodal distance.\nUse eq. (1) to write the potential at point 1 produced by all N current sources.\nWhat is the potential when z1 >> NL?\nHint 1: (1 + δ)-1 ≈ 1 - δ when δ << 1.\nHint 2: Remember that the total transmembrane current must be zero, so\nN\nΣ In = 0.\nn=1\nGiven your answer in (a), what is the relationship between the potential at point 1 and fiber\ndiameter when z1 >> NL?\nI1\nI2\nI3\nIN\nIN-1\nL\nL\nL\nfiber\ncell\nbody\nterminal\npt 1\nz1\nz\nFigure 4\n\nHST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\n(d) How does your answer compare with the results from Melcher (1995) shown in Figure 5?\n(e) Melcher (1995) argues that there is a strong relationship between the fiber diameter of\nbrainstem cells and the amplitude of the unitary potential they produce. Based on your findings\nin (c), are you inclined to agree or disagree? Could your thoughts on this point be influenced by\nmore detailed unitary potential calculations like those in Figure 5?\nFigure 5: Dependence of unitary potential amplitude on fiber diameter. For reference, note that globular,\nspherical and multipolar cells of the anteroventral cochlear nucleus have fiber diameters of approximately 10, 4, and\n2 μm. Left: Unitary potentials calculated using a compartmental model like the one shown at the bottom of Figure\n3. The cell model was realistic in that it had a cell body (modeled as in Rothman et al., 1993) and terminals\n(modeled using a passive conductance and capactance). Unitary potentials were calculated as a weighted sum of the\ntransmembrane currents on consecutive short segments of the cell. The weighting was inversely proportional to the\ndistance between the segment and the BAEP recording electrodes (vx, vertex; ie, ipsilateral ear). Realistic distances\nbetween the cell and BAEP recording electrodes were used. However, the model was unrealistic in that the medium\noutside the cell was a homogenous conductor of infinite extent (not a realistic model for the head). Right: Unitary\npotential amplitude (peak-to-peak) vs. fiber diameter. Amplitude was proportional to Dα, where α ranged from 1.8\nto 2.3 depending on \"recording\" electrode location, axon terminal location, and axon terminal properties\n(represented by different symbols and line types).\n\nHST 750 - MODELING ISSUES IN HEARING AND SPEECH\nSPRING 2006\nPart 2\n(a) Use the data in Table 1 to estimate the magnitude of each listed cell population's\ncontribution to the BAEP. Express the magnitude as a fraction of the magnitude for the globular\ncell population.\n(b) Use the latency data in Table 1 to estimate the BAEP peak (1 - 5) to which each cell\npopulation will contribute. [Note: In Figure 1, the BAEP waveforms begin at the time of the\nclick presentation.]\n(c) How do your estimates compare with the conclusions for P1 - 3 in Figure 1? If they\nagree, were the lesion experiments of Melcher et al. (1996a, b) necessary? If they disagree, what\nmight be the source(s) of the discrepancies?\nCell\nFiber\nPopulation\nDiameter (μm)\nApprox. Latency (ms)\nNumber\nfor Clicks at\nof Cells\n30-50 dB re Threshold\nAuditory Nerve\n50,000\n0.6 - 1\nSpherical Cells\n28,000\n2 - 2.5\nGlobular Cells\n6,000\n1.7 - 2.3\nAVCN Multipolar\nCells\n35,000\n2.5 - 3\nOctopus cells\n< 10\n1,500\n~2\nTable 1: Fiber diameter data are from Brownell, 1975, Liberman and Oliver, 1984. Cell numbers are from Osen,\n1970, Melcher, 1993. Latency data are from Kiang et al., 1965, Bourk, 1976. The latencies are for cells with a\ncharacteristic frequency > 2 kHz. Latencies for lower CF cells are greater.\nReferences\nBrownell (1975) Brain Res. 94, 413-433.\nBourk (1976) MIT PhD Thesis.\nGoldstein and Kiang (1958) J Acoust. Soc. Am. 30, 107-114.\nGoldman and Albus (1968) Biophys. J. 8, 596-607.\nHursh (1939) Am. J. Physiol. 127, 131-139.\nLiberman and Oliver (1984) J. Comp. Neurol. 223, 163-176.\nKiang et al. (1965) MIT Press, Cambridge, MA.\nOsen (1970) In: Excitatory Synaptic Mechanisms, P. Andersen and J. Jansen, Eds. Scandinavian University Books.\nMcDonald and Ohlrich (1971) J. Anat. 110, 191-202.\nMelcher (1993) MIT PhD Thesis.\nMelcher (1995) ARO presentation.\nMelcher et al. (1996a) Hearing Res. 93, 1-27.\nMelcher et al. (1996b) Hearing Res. 93, 28-51.\nMelcher and Kiang (1996) Hearing Res. 93, 52-71.\nRothman et al. (1993) J. Neurophysiol. 70, 2562 - 2583.\nRushton (1951) J. Physiol. 115, 101-122.\nWang, BW (1979) MIT PhD Thesis."
    },
    {
      "category": "Assignment",
      "title": "pset06_wk08.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/e0b3202b8eb98756ad7916be3dbde991_pset06_wk08.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nProblem/Discussion Set for \"Curve Fitting/Resampling\"\nProblem 1. Suppose you want to fit the line y D mx C b to the data points .xi; yi/, i D 1; 2; : : :; N and\nthereby determine the \"bestfit\" values of the slope, m, and intercept, b. In this problem you will derive\nformulae for the \"leastsquares\" estimates of the slope and intercept by minimizing the sum of the squares\nof the deviations (or residuals). [The deviation of the value y1 is y1 y D y1 .mx1 C b/.] Proceed\nby squaring this deviation and summing the squared deviations for all values of yi. Denote the resulting\nsum by S. Note that in forming this sum we've regarded all deviations as equally significant (i.e., we've\nassumed, in effect, that the measurements of the yi all have an equal uncertainty). Next, consider the sum\nas a function of m and b and determine the values of the parameters, m and b, for which S is a minimum.\nO\nO\nHint: At the minimum, the partial derivatives @S=@m and @S=@b will both be zero. Impose this condition\nand solve the resulting equations. How do your formulae differ if the line is constrained to pass through the\norigin?\nProblem 2. Fit each of the following four data sets (A, B, C, and D) to a straight line using linear regres\nsion.1\nxi\n4.0\n8.0\n7.0\n6.0\n9.0\n13.0\n5.0\n14.0\n12.0\n11.0\n10.0\nA\nyi\n4.26\n6.95\n4.82\n7.24\n8.81\n7.58\n5.68\n9.96\n10.840\n8.33\n8.04\nxi\n7.0\n9.0\n5.0\n11.0\n4.0\n13.0\n10.0\n12.0\n6.0\n8.0\n14.0\nB\nData Sets\nyi\n7.26\n8.77\n4.74\n9.26\n3.1\n8.74\n9.14\n9.13\n6.13\n8.14\n8.1\nxi\n8.0\n12.0\n13.0\n11.0\n4.0\n9.0\n6.0\n5.0\n14.0\n7.0\n10.0\nC\nyi\n6.77\n8.15\n12.740\n7.81\n5.39\n7.11\n6.08\n5.73\n8.84\n6.42\n7.46\nxi\n8.0\n8.0\n8.0\n8.0\n8.0\n8.0\n8.0\n19.0\n8.0\n8.0\n8.0\nD\nyi\n6.58\n5.76\n7.71\n8.84\n8.47\n7.04\n5.25\n12.5\n5.56\n7.91\n6.89\nFor each data set, determine the value of the bestfitting slope (b), intercept (a), their respective uncertainties\n(b and a), their coefficient of correlation (rab), the value of chisquare (2), and the probability, Q, that\na value of chisquare as poor as this would occur by chance. (Formulae for each can be found in the hand\nout.2) Each data set has the form .xi; yi/; assume that the uncertainties, i, associated with the yi are\nconstant and equal to 1. Comment on your results.\nProblem 3. Imagine that you've made the following measurements (of y as a function of x) to test some\ncurrent theory of yours. Your theory predicts that the data ought to be well described by a hyperbola of the\nform xy D c, where c is a constant. (For example, your name might be Boyle and the data might represent\nmeasurements of the pressure and volume of one mole of gas at room temperature in Ireland.)\nYour Measurements\nx\ny\n1The data are from F. J. Anscombe (1973), American Statistician 27:17.\n2The function gammq(a,x) used in the handout (from Press et al. (1992), Numerical Recipes in C, Cambridge University Press) can be computed\nusing the Matlab function gammainc(x,a) as follows:\ngammq.a;x/ D 1 gammainc.x;a/ :\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nGiven measurements yi.xi/ you know how to determine the slope of the bestfit line through the origin\n(Problem 1). To apply your formula you need to \"linearize\" the problem by transforming the data into a\nspace where the relation between the two variables is linear. Two methods of doing this suggest themselves:\ni) You can write a linear relation between y and 1=x, namely,\ny D c .1=x/ I\nii) You can write a linear relation between 1=y and x, namely,\n.1=y/ D .1=c/ x :\n1) Transform the data using method (i) and determine the bestfit line through the origin (i.e., the constant\nc). Plot the transformed data (i.e., y vs. 1=x) and the resulting bestfit line. Plot the original, untrans\nformed data (i.e., y vs x) and the corresponding bestfit hyperbola. Make a plot of the residuals. What\ndo you conclude about your theory?\n2) Transform the data using method (ii) and determine the bestfit line through the origin (i.e., the con\nstant c). Plot the transformed data (i.e., 1=y vs. x) and the resulting bestfit line. Plot the original,\nuntransformed data (i.e., y vs x) and the corresponding bestfit hyperbola. Make a plot of the residu\nals. What do you conclude about your theory?\n3) How do you account for any differences between the results of parts (1) and (2).\nProblem 4. In the attached excerpt from a recent paper,3 Voss, Rosowksi, Merchant, and Peake discuss\nevidence for interear correlations between stapes velocity and impedance at the tympanic membrane. The\ndata shown in their scatterplot are reproduced in the table below. Would their conclusions have changed\nif they had analyzed a plot of jVS=PTM vs YTM , where YTM D 1=ZTM? Which procedure would you\nj\nj\nj\nchoose? Justify your choice.\njZTMj=106\njVS=PTMj 103\nBone\nŒNs=m5\nŒ\n\n48.4\n14.66\n53.7\n61.47\n94.2\n38.96\n?\n95.6\n37.90\n?\n101.6\n11.40\n?\n106.2\n13.64\n?\n110.3\n8.658\n?\n118.4\n26.95\n?\n136.56\n25.39\n?\n136.58\n15.69\n?\n136.85\n14.78\n?\n140.6\n8.569\n?\n207.0\n10.84\n?\nVoss et al. Data\nmm/s/Pa\nProblem 5. The French \"abortion pill\" RU486 was tested as a morningafter contraceptive. According to\nScience News (10/10/92), 398 women were given a standard treatment (high doses of hormone), and 402\n3S.E. Voss, J.J Rosowski, S.M. Merchant, and W.T.Peake (2000). \"Acoustic responses of the human middle ear,\" Hearing Res. 150:43-69.\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nwomen were given RU486. Four of the women given the \"standard treatment\" got pregnant, while none of\nthose given RU486 did. Estimate the probability that such a difference arose by chance. Determine your\nprobability computationally using the Monte Carlo method, i.e., by using a randomnumber generator to\nsimulate the clinical trial assuming the \"null hypothesis\" that RU486 has no effect (i.e., is no more effective\nat preventing pregnancy than the standard treatment). Provide a computational estimate of the uncertainty\nof your computed probability.\nProblem 6. Do the liquor prices in staterun and private sector systems differ systematically? In the 1960s\nJulian Simon studied the price of liquor in the sixteen \"monopoly\" states (where the state government owns\nthe retail liquor stores) compared to the twentysix states in which retail liquor stores are privately owned.\n(Some states were omitted for technical reasons.) The representative 1961 prices of a fifth of Seagram 7\nCrown whiskey in the two groups of states are given in the table below.\nLiquor Prices [1961 dollars]\nStateowned\n4.65\n4.55\n4.11\n4.15\n4.20\n4.55\n3.80\n4.00\n4.19\n4.75\n4.74\n4.50\n4.10\n4.00\n5.05\n4.20\nMean D $4:35\nPrivatelyowned\n4.82\n5.29\n4.89\n4.95\n4.55\n4.90\n5.25\n5.30\n4.29\n4.85\n4.54\n4.75\n4.85\n4.85\n4.50\n4.75\n4.79\n4.85\n4.79\n4.95\n4.95\n4.75\n5.20\n5.10\n4.80\n4.29\nMean D $4:84\nNote that the mean prices differ by 49 cents (or roughly 10%). Use MonteCarlo methods to estimate the\nprobability that the observed price difference might simply have arisen by chance.\nProblem 7. In October 1981, when the World Series was tied at two games apiece, the New York Times\nwrote\nNobody needed reminders of the urgency of today's game, but reminders were hard to escape.\nThis was the 30th time in the 78 years of the series that the teams had been tied after four games.\nAnd 22 times the team that won the fifth game had gone on to win the series.\nIn this problem you'll use MonteCarlo methods to examine the hypothesis that winning or losing a game\nin the World Series has the same odds as tossing a fair coin.\n1. Use a randomnumber generator (or a coin, if you prefer) to simulate the playing of many series.\nAssume that the probability of winning a game is 1=2. Use your results to calculate the expected values\nof the statistics given in the quotation. In other words, how many times in 78 series should one expect\nthe teams to be tied after four games? An in how many of those series should one expect the winner\nof the fifth game to win the series?\n2. Additional statistics appear in the following table, which reports the distribution of lengths of the\nWorld Series for the 72 series played during the years 1923-1995 (due to the baseball strike, no series\nwas played in 1994).\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nNumber of Games in the\nWorld Series (1923-1995)\nLength of\nseries\n4 games\n5 games\n6 games\n7 games\nNumber of\noccurrences\nUse a randomnumber generator to calculate the expected values for the statistics in the table assum\ning that the probability of winning a game is 1=2. Compute the probability that deviations from the\npredicted distribution as large as those shown in the table could have arisen by chance. Hint: Use your\nsimulations to compute the distribution of some measure of the overall \"quality of fit\" between the\nactual data and your predicted distribution (e.g., the sum of the squared deviations). How consistent\nis the World Series data with the tossing of a coin?\nProblem 8. Wetts and Herrup4 present the following table of Purkinje cell counts from the cerebella of\nseven assorted chimeric and wildtype mice.\nPurkinje Cell Data\nMouse\nId\n\nC3H1\nC3H2\n\nAKC3\nNumber of\nPurkinje cells\n10,200\n30,200\n60,300\n82,400\n83,900\n102,000\n114,000\nCellcount\n11)\nratio (re\n(1)\n2.96\n5.90\n8.07\n8.22\n9.97\n11.2\nThe authors estimate their cell counting error to be 3%. Column 3 gives the ratio of the cell counts for each\nmouse to that for 11. They write\nWhen the number of PCs [Purkinje cells] in each of these six animals is divided by the number\nof PCs in 11, the quotients are not significantly different (within the 3% counting error) from\nintegral values. : : : [The] quotients for most of the animals are well within 3% of an integral\nmultiple, and only one [namely, C3H2] comes close to, but does not exceed, the 3% limit. The\nprobability that these quotients fell within 3% of an integer by chance alone is very small.\nThey conclude that the number of Purkinje cells in the mouse cerebellum is quantized (apparently in multi\nples of roughly 10,200). They argue that this quantization arises because cerebellar Purkinje cells are clonal\ndescendants of a small pool of progenitor cells. (The cellcount ratio then estimates the number of these\nprogenitor cells.)\nComment on their use of 3% to characterize the expected uncertainty in the cellcount ratio. Hint:\nUse the rules for the propagation of random errors.\nEvaluate the probable significance of their findings by estimating the value of \"very small\" computa\ntionally. Hint: Use a random number generator to estimate the probability that seven numbers chosen\n4Wetts, R. and Herrup, K. (1982). \"Cerebellar Purkinje cells are descended from a small number of progenitors committed during early\ndevelopment: Quantitative analysis of lurcher chimeric mice,\" J. Neurosci., 2:1494-1498\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nat random (from a \"reasonable range\" of cellcount values, e.g., 4,000-150,000) all fall within 3%\nof integer multiples of n, where n is the putative quantal unit (i.e., the smallest of the seven random\nnumbers). How sensitively do the results depend on the choice of \"reasonable range\"? For example,\nhow does the probability change if you allow cell counts in the range 3,000--200,000? How do the\nresults depend on the number of animals examined? And how do the results differ if you used the\nactual expected uncertainty in the quotients rather than the authors' criterion value of 3%?"
    },
    {
      "category": "Assignment",
      "title": "pset07_wk09.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/hst-750-modeling-issues-in-speech-and-hearing-spring-2006/812e1c92d7bea1e62ab346423e1e62dc_pset07_wk09.pdf",
      "content": "HST-750\nMODELING ISSUES IN SPEECH AND HEARING\nProblem/Discussion Set for \"Forward vs Inverse\"\n1. Dimensional Analysis. The simple passive model whose transfer function is show in Zweig's Fig. 2\nis defined by the variables/parameters\nx; ! ; M .x/; M.x/; R.x/; K.x/; and l :\nN\n(a) What are the dimensions of each? How many independent dimensionless combinations (groups)\ncan be formed?\n(b) Identify and interpret the dimensionless groups used by Zweig. For each group, identify its role\nin determining/shaping the model transfer function shown in Fig. 2 (e.g., what feature(s) of the\ntransfer function or its variation with position does the dimensionless variable/parameter affect)?\n(c) What additional dimensionless variables/parameters does Zweig introduce to model the empirical\nwavelength? What are their physical interpretations?\nq\n(d) The function N.x/ .l=4/\nM .x/=M.x/ can be interpreted as the approximate number of\nN\nwavelengths of the traveling wave in the cochlea in response to sinusoidal stimulation at a fre\nquency f D fc.x/. In the Zweig model, N.x/ is constant. What empirical evidence supports\nthis? What is the general condition for constant N ? Figure 2 shows the predictions of a model\nwith N D 5. Draw the approximate phase response of the model with N D 4 and with N D 6\n(e) Wobbles or oscillations in the \"tails\" of Neely's IHC tuning curves are apparent in Fig. 8. Similar\nwobbles are also seen in Figs. 6, 7, and 9. Speculate on the physical origin of these wobbles. Do\nthe wobbles in these four figures suggest anything suspicious about Neely's model calculations?\n2. Wavelengths. Plot (e.g., using Matlab) the real and imaginary parts of .4N /2 using Zweig's Eq. (135).\nCompare with the \"empirical\" wavelength shown in Fig. 11. Overlay a plot of the wavelength for the\npassive model shown in Fig. 2 (using the same value of N and ı D 0:02). Explain how the forms of\nthe passive/active wavelengths create the features of the passive/active transfer functions\n3. Sensitivity Analysis. In this problem you'll perform a simple sensitivity analysis on Zweig's model.\nIn particular, you will estimate the sensitivity of the model's stability to changes in the parameter\n\n=2\n1:75 controlling the time delay of the slower feedback force. The locations of the\n\nzeros, sn, of the impedance of the organ of Corti (see Fig. 14) depend on model parameter values (via\nEqs. 149 and 150). For the parameter values given in Eq. 136, Re fsng 0 for all n so that all the\nzeroes in Fig. 14 are to the left of the solid line representing the Im sg axis; the model is therefore\nf\nstable (i.e., impulse responses approach 0 as t ! 1). For example, the two zeroes of 2 closest to\nthe imaginary s axis in Fig. 14 occur at\n0:0185454 C 0:958904 i\n0:0327025 C 1:03244 i :\ns1 s2 (a) Using Eq. 150, which says that\n+\n\n.sn S/.sn S /\n\nD 2 Im sng ;\nf\ncompute the value of the parameter at which Re s1g D 0 (the zero then lies on the imaginary s\nf\naxis, and the model hovers on the edge of instability). Keep all other parameter values fixed and\nassume that Im s1g is approximately equal to the value given above. (Extra credit: Justify this\nf\nassumption.) Hint: Remember that the inverse tangent is multivalued, so that that tan1 .x/ D\nC m with m D 0; 1; 2; : : :; choose m so that comes closest to 1.75.\n(b) Now compute the value of at which Re s2g D 0. Again, keep all other parameters and Im s2g\nf\nf\nfixed.\n?\n?\nHarvard-MIT Division of Health Sciences and Technology\nHST.750: Modeling Issues in Speech and Hearing, Spring 2006\nCourse Directors: Dr. Christopher Shera and Dr. Jennifer Melcher\n\nHST-750\nMODELING ISSUES IN SPEECH AND HEARING\nWhat do your results tell you about the sensitivity of the model to changes in the parameter ?\n4. Modeling Strategies.\nThis week's papers take three very different approaches to modeling the\ncochlea.\n(a) In his Introduction, Zweig writes \"In conventional theoretical treatments of cochlear mechanics,\nmodels are proposed and their consequences explored. This paper adopts another approach.\"\nCharacterize Zweig's approach. How does it differ from the approaches taken by the other two\npapers? What are the strengths and weaknesses of each? Illustrate your remarks with examples\nfrom the three papers\n(b) In the first sentence of their abstract, Kolston and Ashmore write \"A new cochlear modeling\ntechnique has been developed in which the number of assumptions required in model formulation\nis significantly less than in previous modeling studies.\" Discuss whether you agree or disagree\nwith this summary of their approach.\n(c) In his Discussion, Neely writes that \"There is always a tradeoff in models between complexity\nand completeness.\" Is Neely right? If so, what are the elements of the tradeoff? How do the\nvarious authors frame the issue and justify their individual approaches? What are the relative\nstrengths and weaknesses of socalled lumped vs finiteelement models?\n(d) To what extent do the papers reach similar conclusions? Where do they disagree? How do you\nresolve any discrepancies?\n5. Motivation and Justification. How do the different papers motivate and justify their work to the\nreader? How are the different models and interpretations of the data influenced by these goals?\n6. Assumptions. List what you consider to be the most important assumptions for each model. How\ndo the assumptions differ from paper to paper? Do the authors adequately justify their assumptions?\nWhich assumptions are critical to the conclusions reached? How might the assumptions be tested?\n7. Predictions. One measure of the power of a model is its ability to suggest experiments that test the\nmodel. Describe predictions made by each model that you find particularly interesting or telling. Can\nyou suggest new (and/or identify existing) experiments that might test these predictions?\n8. Sanity Checks. What \"sanity checks\" do the authors use to determine whether their results are at all\nreasonable (e.g., whether their numerical solutions are accurate, their parameter values reasonable,\ntheir models stable, etc)\n?\n?"
    }
  ]
}