{
  "course_name": "Modern Navigation",
  "course_description": "This course introduces the concepts and applications of navigation techniques using celestial bodies and satellite positioning systems such as the Global Positioning System (GPS). Topics include astronomical observations, radio navigation systems, the relationship between conventional navigation results and those obtained from GPS, and the effects of the security systems, Selective Availability, and anti-spoofing on GPS results. Laboratory sessions cover the use of sextants, astronomical telescopes, and field use of GPS. Application areas covered include ship, automobile, and aircraft navigation and positioning, including very precise positioning applications.",
  "topics": [
    "Engineering",
    "Civil Engineering",
    "Surveying",
    "Social Science",
    "Geography",
    "Engineering",
    "Civil Engineering",
    "Surveying",
    "Social Science",
    "Geography"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nTopics\n\nCoordinate systems on a deformable, non-spherical Earth. Concepts of latitude and longitude as determined by the direction of gravity (astronomical latitude and longitude) and as determined by the normal to an ellipsoidal shape (geodetic latitude and longitude). Relationships between coordinates; concepts of changes in the rotation of the Earth; rotations and translations between coordinate systems. Effects that need to be considered for different accuracy results and the accuracies that are achievable with GPS.\n\nPrinciples of Navigation. Dead-reckoning, true and magnetic bearings; use of celestial bodies, use of secants for position fixes. Introduction to common map projections; uses of different map projections. Vector approach to spherical trigonometry.\n\nPrinciples of GPS. Pseudorange and phase measurements. Spread spectrum signal structure; basic concepts of signal analysis. Contributions of pseudorange and phase (geometric positions, clock errors, propagation medium, cycles ambiguity for phase). Simple atmospheric and ionospheric delay models; use of dispersive properties of plasmas (ionosphere). Use of differencing techniques in the analysis of GPS data. Security systems on GPS satellites (selective availability and anti-spoofing) and their effects on navigation and precise positioning.\n\nEstimation procedures; Stochastic and mathematical models; statistical descriptions of dynamic systems; propagation of covariance matrices least-squares estimation.\n\nExamples of aircraft navigation using GPS (comparison with laser profiling); examination of real data to assess the limits of accuracy obtainable with GPS; applications in a variety of areas including precision farming; and intelligent vehicle navigation systems.\n\nTexts\n\nWellenhof, B. Hofmann-, H. Lichtenegger, and J. Collins.\nGlobal Positioning System: Theory and Practice\n. New York, NY: Springer-Verlag, 1994. ISBN: 9783211825914.\n\nStrang, G., and K. Borre.\nLinear Algebra, Geodesy, and GPS\n. Wellesley, MA: Wellesley-Cambridge Press, 1997. ISBN: 9780961408862.\n\nHomework\n\nIt will be acceptable in this course to work together on homework with the aim of better understanding the material and to refer to other books and published material provided that these additional materials are cited appropriately in the homework. Each student should complete the homework separately. It is not acceptable to simply copy the homework of another student.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nHomework\n\n60%\n\nFinal Exam\n\n30%\n\nClass Participation\n\n10%\n\nCalendar\n\nLEC #\n\nTOPICS\n\nKEY DATES\n\nIntroduction and Coordinate Systems\n\nLatitude and Longitude Definition\n\nHeight Definition\n\nSpherical Trigonometry\n\nPosition Determination by Astronomical Methods\n\nHomework 1 due\n\nAlmanacs in Paper and Electronic Form\n\nDead Reckoning and Sextants\n\nReview of Linear Algebra\n\nSextant Measurements\n\nMap Projections\n\nStatistics and Propagation of Variance-covariance Matrices\n\nLeast Squares Estimation\n\nHomework 2 Solution\n\nHomework 2 due\n\nCorrelations\n\nElectromagnetic Distance Measurement (EDM)\n\nBasics of GPS Pseudo Range\n\nGeometry of GPS Measurements and Accuracy\n\nGPS Carrier Phase Measurements\n\nAtmosphere Delay Effects\n\nHomework 3 due\n\nIonosphere and Dispersive GPS Delay Correction\n\nSatellite Orbit Representation and Sources of Information about Orbits\n\nBasics of Hand Held GPS Receivers\n\nClass Outside Using GPS\n\nApplications of GPS",
  "files": [
    {
      "category": "Resource",
      "title": "12_215_hw01_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/c244afc716b21bcbddfa43153b8e57f1_12_215_hw01_soln.pdf",
      "content": "12.215 Homework #1 Solutions\nOct 4, 2006\nQuestion: (1) For latitudes of 30 degrees N and 60 degrees N, determine the difference\nbetween the great circle path and small circle path for sites at the same latitude. Plot\nresults as a function of longitude difference between 0 and 180 degrees. (20 points).\nAnswer:\nThe small circle distance, d, is given by\nd = R cos φ Δλ\nwhere Δλ is in radians.\nThe great circle distance, D, is given by\nD = R. β\ncos β = sin2φ + cos2φ cos Δλ\nwhere β is in radians, and that φ is the same at both ends of the line.\nWe take R = 6371 km (radius of sphere with same volume as the Earth) and the results\nare shown in the figure. From the calculations that went into the figure, we have the\nfollowing values\nFor φ = 30o at Δλ = 180 o; d = 17,334 km; D = 13, 343 km\nFor φ = 30o at Δλ = 11.25 o; d = 1,083.3 km; D = 1,082.9 km\nFor φ = 60o at Δλ = 180 o; d = 10,008 km; D = 6672 km\nFor φ = 60o at Δλ = 11.25 o; d = 625.5 km; D = 624.7 km\n12.215\nHW 1\n10/11/06\n\nGreat Cirlce distance\nSmall Circle distance\nDistance (km)\n! (degrees)\nLatitude (30o)\n(a)\nGreat Cirlce distance\nSmall Circle distance\nDistance (km)\nLatitude 60o\n! (degrees)\n(b)\n12.215\nHW 1\n10/11/06\n\nQuestion: (2) For sites at 30 degrees latitude and separated by 90 degrees of longitude,\ncompute the azimuths to be used along the greater circle path between the two sites.\nShow results graphically. What is the azimuth at the mid-point between the two\nlocations? (20 points)\nAnswer: Using the figure below\nZ\nP'\nP1\nP2\n!\n\"=60o\n\"=60o\n#'\n#1\n#2\n\"'\n!'\ncos β = cos2 θ + sin2 θ cos Δλ\nBecause Δλ = 90o, cos Δλ = 0. Therefore cos β = cos2 60 and β = 75.5o (For R=6,371 km,\nD=8397.7 km).\nTo compute the trajectory along the great circle, we need to repeatedly solve the\n(spherical) triangle ZP2P' as P' is moved along the path between P1 and P2.\nStart:\nsin α1 = sin δλ sin θ /(sin β) ⇒α1 = α2 = 63.434o\nThen divide b into segments, as P' is moved from P1 to P2, the arc along the great circle is\ndenoted with β-β'. Given β', we have\ncos θ' = cos θ cos β' + sin θ sin β' cos α2\nand\nsin α' = sin α2 sin θ /sin θ'\nTo resolve the quandrant for a' we need an independent value of cos a'. This expression\ncan be obtained from the cosine rule using a'\ncos α' = (cos θ - cosθ' cosβ')/(sin θ' sin β')\nWe can also at this point convert the b' angles back to changes in longitude again using\nthe cosine rule:\n12.215\nHW 1\n10/11/06\n\ncos Δλ = (cos β'-cos θ cos θ')/(sin θ sin θ')\nThe results shown in this form at plotted below as well.\nA plot as a function of β-β' = angle from P1 is show below.\n(b) At the midpoint, α' =90 (θ' = 50.768 o) i.e., mid-way along the path, you travel due\nEast.\nCo-latitude of P' (deg)\nTrue Azimuth (deg)\nAngle (deg)\nAngle from P1 (deg)\nResults as a function of longitude difference:\n12.215\nHW 1\n10/11/06\n\nCo-latitude of P' (deg)\nTrue Azimuth (deg)\nAngle (deg)\n!Longtiude (deg)\n12.215\nHW 1\n10/11/06\n\nQuestion: (3) The Garmin factory is located at 38.95005 N, 94.74612 W, and it is\nsupposed to be 2029 km at a bearing from True North of 267 degrees, from N 42.26615,\n71.08850 W. Compute what you think the distance and bearing should be. How well do\nyour results agree with Garmin. (20 points)\nAnswer: (a) \"Quick and dirty solution\"\nTreat the geodetic latitudes as geocentric latitudes and solve the spherical triangle below.\n!\n\"1\n\"2\nHM\nGAR\n#$\n%\nZ\nSolving spherical triangle HM-Z-GAR we have\ncos β = sin φ1 sin φ2 + cos φ1 cos φ2 cos Δλ\nsin α = sin Δλ cos φ2/sin β\nTo resolve the quadrant for a we also need an unique definition for cos a. (Using cos α =\n√1-sin2α is not enough because the sign of the square root is unknown).\nThis yields β = 18.202o (= 0.317682 radians).\nUsing the mean radius of the Earth as 6,371 km, we obtain\nD = 2024 km (cp. 2029 km)\nα = 267.45 o (cp. 267 o)\n(b) \"Better solution\"\nConvert the geodetic latitudes to geocentric latitudes and then solve the above spherical\ntriangle using the geocentric values. The results are\nφMH = 42.074664 and φGAR = 38.762034\nRHM = 6368.5 km and RGAR = 6369.7 km\nyielding β = 18.252 ( = 0.318560 radians). Using mean R = 6,369 km we obtain:\nD = 2028.9 km (cp. 2029 km)\nα = 267.4o (cp. 267 o)\n12.215\nHW 1\n10/11/06"
    },
    {
      "category": "Resource",
      "title": "12_215_hw02_soln.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/e2d5a67dccf5d810b62083575344737a_12_215_hw02_soln.pdf",
      "content": "12.215 Homework #2 Solution\nDue Monday, November 6, 2006\nLatitude and Longitude determination.\n(a) Find the time and the value of the maximum angle between the sun and its\nreflection using the data given below\n(b) Find the mean index error of the sextant (data below) (5 points)\n(c) Using the mean index error for distance objects, compute the elevation angle to\nthe Sun at its maximum (5 points)\n(d) Compute the approximate atmospheric bending contribution to this measured\nelevation to the sun (15 points)\n(e) Given the declination of the Sun and the in vacuum estimate of the elevation angle\nto the Sun, compute the latitude of the Green building. (25 points)\n(f) Given Greenwich hour angle at the Greenwich meridian crossing, compute the\nlongitude of the Green building (25 points)\nIndex errors (minutes of arc)\nTH\n-6.2\nDawn\n-7.5\nRoxane\n-7.8\nData is contained in file Sextant_061025.txt. The columns are\nhrs min sec Angle (deg) Angle (min) where Angle is observed twice elevation angle of\nsun.\nThis solution in also discussed in lecture notes\nSolution\n(a) The matlab code HW02_Sextant_06.m implements this solution using polyfit. The\nresults are\nMax Time 12.470 hrs EDT Val 70.87 deg, RMS 3.3 min\n(b) Mean index error\nMean Index Error -7.2 mins RMS 0.9 mins\n(c) Elevation angle of sun at maximum: (70.87+7.2/60)/2 = 35.495\nMax elev: 35.50 deg index error corrected\n(d) Atmospheric bending\nRefraction 1.3 min\nMax elev: 35.47 deg index error and atm corrected\n(e and f) Results: Declination of Sun: -12.21, Use time of max to computer Greenwich\nHour Angle of Sun (from tables or in code by fitting polynomial to table data.\nRESULTS\nMax Time 12.470 Val 70.87 deg, RMS 3.3 min\nIndex Error -7.2 min, Refraction 1.3 min\nSextant Longitude 71.036 deg Latitude 42.316 deg\n\nGPS\nLongitude 71.089 deg Latitude 42.360 deg\nDiff Longitude -3.2 min Latitude -2.6 min, Distance 4.6 km\nFigures:\nFigure 1: Raw data plot with theoretical model and polynomial maximum.\n\nFigure 2: Residual to fit and scaled version of data."
    },
    {
      "category": "Resource",
      "title": "12_215_hw02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/a6075dc2f680a73879c6f329810fa91f_12_215_hw02.pdf",
      "content": "12.215 Homework #2\nDue Monday, November 6, 2006\nLatitude and Longitude determination.\nThe data needed for this homework are given below.\n(a) Find the time and the value of the maximum angle between the sun and its\nreflection using the data given below.\n(b) Find the mean index error of the sextant (data below) (5 points)\n(c) Using the mean index error for distance objects, compute the elevation angle to\nthe Sun at its maximum (5 points)\n(d) Compute the approximate atmospheric bending contribution to this measured\nelevation to the sun (15 points)\n(e) Given the declination of the Sun and the in vacuum estimate of the elevation\nangle to the Sun, compute the latitude of the Green building. (25 points)\n(f) Given Greenwich hour angle at the Greenwich meridian crossing, compute the\nlongitude of the Green building (25 points)\nData for Homework:\nIndex errors (minutes of arc)\nTH\n-6.2\nDawn\n-7.5\nRoxane\n-7.8\nMeasured sextant data (date Oct 25, 2006)\nHrs\nMin\nSec\nSun\nSun\n(EDT)\nDeg\nMin\n46.8\n23.2\n41.4\n48.0\n18.6\n31.6\n43.1\n56.4\n28.6\n41.9\n40.4\n42.8\n44.1\n\n50.0\n48.0\n46.7\n58.4\n46.8\n45.7\n48.6\n49.5\n54.1\n48.4\n40.4\n36.2\n25.2\n18.8\n01.0\n43.5\nAlmanac from:\nhttp://www.tecepe.com.br/scripts/AlmanacPagesISAPI.isa/pages?date=10%2F25%2F2006\n2006 OCT. 25\n------+-------------------+\n|\nSUN\n|\n------+-------------------+\nG.M.T |\nGHA\nDec\n|\nd h |\n° '\n° ' |\n25 0 | 183 57.7 S11 58.4 |\n1 | 198 57.7 S11 59.3 |\n2 | 213 57.8 S12 00.2 |\n3 | 228 57.9 S12 01.0 |\n4 | 243 58.0 S12 01.9 |\nW 5 | 258 58.0 S12 02.8 |\nE\n|\n|\nD 6 | 273 58.1 S12 03.6 |\nN 7 | 288 58.2 S12 04.5 |\nE 8 | 303 58.2 S12 05.4 |\nS 9 | 318 58.3 S12 06.2 |\nD 10 | 333 58.4 S12 07.1 |\nA 11 | 348 58.5 S12 07.9 |\nY\n|\n|\n12 |\n3 58.5 S12 08.8 |\n13 | 18 58.6 S12 09.7 |\n14 | 33 58.7 S12 10.5 |\n15 | 48 58.7 S12 11.4 |\n16 | 63 58.8 S12 12.2 |\n\n17 | 78 58.9 S12 13.1 |\n|\n|\n18 | 93 59.0 S12 14.0 |\n19 | 108 59.0 S12 14.8 |\n20 | 123 59.1 S12 15.7 |\n21 | 138 59.2 S12 16.5 |\n22 | 153 59.2 S12 17.4 |\n23 | 168 59.3 S12 18.2 |\n------+-------------------+"
    },
    {
      "category": "Resource",
      "title": "12_215_hw1.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/d7b213cc0abe689f27aa4ed0533bc34b_12_215_hw1.pdf",
      "content": "12.215 Homework #1.\nDue Wednesday, Oct 4, 2006.\n(1) For latitudes of 30 degrees N and 60 degrees N, determine the difference between the\ngreat circle path and small circle path for sites at the same latitude. Plot results as a\nfunction of longitude difference between 0 and 180 degrees. (20 points)\n(2) For sites at 30 degrees latitude and separated by 90 degrees of longitude, compute the\nazimuths to be used along the greater circle path between the two sites. Show results\ngraphically. What is the azimuth at the mid-point between the two locations? (20 points)\n(3) The Garmin factory is located at 38.95005 N, 94.74612 W, and it is supposed to be\n2029 km at a bearing from True North of 267 degrees, from N 42.26615, 71.08850 W.\nCompute what you think the distance and bearing should be. How well do your results\nagree with Garmin. (20 points)"
    },
    {
      "category": "Resource",
      "title": "12_215_hw3.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/439f4edd74c14aeba414fe50b59e93b4_12_215_hw3.pdf",
      "content": "12.215 Homework #3\nDue Wednesday November 29, 2000\nStatistics and Estimation\nQuestion 1: Using the data from problem set 2, estimate using your own estimator (not\npolyfit) the coefficients of the quadratic polynomial that best fit the data in a least squares\nsense.\n(a) Write the equation for the polynomial. What are the observations and unknown\nparameters in the polynomial (5-points).\n(b) Write the above set of equations in matrix form (5-points).\n(c) Form the least squares estimator and solve for the coefficients. You may use the\nMatlab matrix inversion routine inv and/or a calculator matrix inversion to solve the\nsystem of equations (10 points).\nQuestion 2: Estimate the standards deviation of the errors in the measurements using the\ndifferences between the observed values and the polynomial fit. (20-points)\nQuestion 3: What is the probability that the 17th measurement (time 12hr 21m 26s\nMeasurement 70o 58.4') differs from the polynomial fit due to random error assuming\nthat the noise in the measurements is Gaussian distributed and the data standard deviation\ncomputed in question 2 (20-points).\nQuestion 4: Estimate the standard deviation of the peak in the polynomial (i.e., its\nmaximum value and the time at which the maximum occurs) based on the least squares\nestimate in Question 1 (20-points).\nQuestion 5: Using the non-linear model for the observed double elevation angle as a\nfunction of the site latitude and longitude (and the Sun's declination and Greenwich hour\nangle which you can assume are known), rigorously estimate the latitude and longitude of\ncampus. Approach the problem with the following steps:\n(a) Write the equation for the double-elevation as a function of latitude and longitude\n(5-pts)\n(b) Find the partial derivative of the double angle with respect to latitude and\nlongitude (10-pts)\n(c) Find the differences between the measured double elevation angles and the values\npredicted from an a priori estimate of the latitude and longitude of 42.0 and 71.0\n(5-pts)\n(d) Using the partial derivatives from (b) and the prefit residuals from (c), form the\nleast squares solution for the estimates of the adjustments to the latitude and\nlongitude. Since this is a non-linear problem, iterate your solution until the\nadjustments are small compared to the standard deviations of the estimates i.e.,\ncompute new residuals from the non-linear model with the new estimates of the\nlatitude and longitude. Use the estimates if the standard deviations of sextant\nmeasurements from Q2 above. (10-pts)\n(e) Give the final estimates of the latitude and longitude and their standard deviations\nand correlation between the estimates. (10-pts)"
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec01.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/3e4a7694ef1008a2d37581e2c0d801fe_12_215_lec01.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n09/08/2004\n12.215 Modern Naviation\nCourse Overview\n- The development of the Global Positioning System (GPS) started\nin the 1960s, and the system became operational in 1992.\n- The system has seen many diverse applications develop in the\nlast few years with the accuracy of positioning ranging from 100\nmeters (the civilian restricted accuracy requirement) to 1\nmillimeter (without the need for a security clearance!)\n- In this course we will apply many of basic principles of science\nand mathematics learnt at MIT to explore the applications and\nprinciples of GPS and contrast it to conventional navigation.\n- We also use GPS and other equipment in the class (and outside\non Campus) to demonstrate the uses of this system\n\n09/08/2004\n12.215 Modern Naviation\nClass Expectations\n- We will have some lab sessions during the course and there will\nbe homework once every few weeks.\n- There will be an open book final exam.\n- Grading will be from the homework (60%), final exam (30%) and\nclass participation (10%).\n- It will be acceptable in this course to work together on homework\nwith the aim of better understanding the material and to refer to\nother books and published material provided that these additional\nmaterials are cited appropriately in the homework.\n- Each student should complete the homework separately.\n- It is not acceptable to simply copy the homework of another\nstudent.\n\n09/08/2004\n12.215 Modern Naviation\nCourse Topics: Coordinate Systems\n- General Areas:\n- Coordinate systems on a deformable, non-spherical Earth.\n- Concepts of latitude and longitude as determined by the\ndirection of gravity (astronomical latitude and longitude) and\ndetermined by the normal to an ellipsoidal shape (geodetic\nlatitude and longitude).\n- Relationships between coordinates; concepts of polar motion\nand changes in the rotation rate of the Earth; rotations and\ntranslations between coordinate systems. Effects that need to\nbe considered for different accuracy results and the\naccuracies that are achievable with GPS.\n\n09/08/2004\n12.215 Modern Naviation\nCourse Topics: Navigation and Maps\n- Principles of Navigation.\n- Dead-reckoning, true and magnetic bearings\n- Use of celestial bodies for navigation\n- Common map projections\n- Metrics for relating curvi-linear coordinates\n- Spherical trigonometry\n\n09/08/2004\n12.215 Modern Naviation\nCourse topics: GPS\n- Principles of GPS.\n- Pseudorange and phase measurements.\n- Spread spectrum signal structure; basic concepts of signal\nanalysis. Contributions of pseudorange and phase (geometric\npositions, clock errors, propagation medium, cycles ambiguity\nfor phase).\n- Simple atmospheric and ionospheric delay models; use of\ndispersive properties of plasmas (ionosphere).\n- Use of differencing techniques in the analysis of GPS data.\n- Security systems on GPS satellites (selective availability and\nanti-spoofing) and their effects on navigation and precise\npositioning.\n\n09/08/2004\n12.215 Modern Naviation\nCourse Topics: Statistics and\nEstimation\n- Estimation procedures\n- Stochastic and mathematical models\n- Correlations and their interpretation\n- Statistical descriptions of dynamic systems\n- Propagation of covariance matrices\n- Statistics in least-squares estimation.\n\n09/08/2004\n12.215 Modern Naviation\nCourse Topics: Applications\n- Examples of applications:\n- aircraft navigation using GPS (comparison with\nlaser profiling)\n- examination of real data to assess the limits of\naccuracy obtainable with GPS\n- applications in a variety of areas including precision\nfarming; and intelligent vehicle navigation systems.\n\n09/08/2004\n12.215 Modern Naviation\nCourse Topics\n- Selection of topics is based on applying principles and\nmathematics to actual problems\n- Each of the mathematical topics covered will be used\nin understanding how GPS works and how the system\ncan be used.\n- Homework exercises and data collection sessions in\nclass will be examples of how these concepts are\nused\n\n09/08/2004\n12.215 Modern Naviation\nSpecific Schedule (see web page)\n#\nDate\nTopic\n09/08\nIntroduction; coordinate systems (this lecture)\n09/13\nLatitude and Longitude definition\n09/15\nHeight Definition\n09/20\nSpherical trigonometry\n09/22\nMotion of Sun/Earth and astronomical position\ndetermination\n09/27\nAlmanacs paper and on-line\n09/29\nDead reckoning and conventional navigation\n\n09/08/2004\n12.215 Modern Naviation\nSpecific Schedule (see web page\n#\nDate\nTopic\n10/04\nUse of sextant and measurements in class\n(determine latitude and longitude of class room)\n10/06\nLinear algebra (as applied to transformations)\n10/13\nSextant results. Analysis of results previously\ncollected\n10/18\nMap projections\n10/20\nBasic statistics need for estimation\n10/25\nPropagation of variances\n10/27\nCorrelations\n\n09/08/2004\n12.215 Modern Naviation\nSpecific Schedule (see web page\n#\nDate\nTopic\n11/01\nElectronic distance measurement\n11/03\nBasics of GPS pseudo range\n11/08\nGeometry of GPS measurements and\naccuracy\n11/10\nGPS carrier phase measurements\n11/15\nNeutral atmosphere propagation\n11/17\nDispersive propagation delays\n11/22\nSatellite motions\n\n09/08/2004\n12.215 Modern Naviation\nSpecific Schedule (see web page\n#\nDate\nTopic\n11/24\nClass before Thanks Giving\n11/29\nBasics of hand held GPS\n12/01\nGPS outside the classroom\n12/06\nApplications of GPS in different fields\n12/08\nReview\n\n09/08/2004\n12.215 Modern Naviation\nNotes on Schedule\n- Specific dates of some activities will depend on the\nweather conditions and the schedule may change\n- Last year's lecture will be left on-line.\n- Reference material for the class\n- During the lectures, web-based materials and\nbooks will be referred to.\n- The topics covered in this course are sufficiently\ndiverse that no single text book is recommended.\n- All materials for the course will be made available\nelectronically\n\n09/08/2004\n12.215 Modern Naviation\nElectronic Materials\n- The class notes are made available in three formats:\n- Microsoft Power Point documents (original format)\n- PDF in black and white for printing\n- HTML web format (The exact look of these\ndocuments will depend on your Browser and OS.\nEven MS internet Explorer does not render MS html\ndocuments uniformly.\n- Links in documents are only active in the power point\nand html versions.\n\n09/08/2004\n12.215 Modern Naviation\nCoordinate Systems\n- Navigation: knowing where you are, where you want\nto go, and how to get there\n- Also useful: knowing how long it will take\n- To achieve these goals in a general way; a\ncoordinate system is needed that allow quantitative\ncalculations (Claudius Ptolemy, ~130AD)\n- Reference Frames (describes coordinate system\nbasis)\n- Definition\n- Realization (implementation of definition)\n\n09/08/2004\n12.215 Modern Naviation\nCoordinate system definition\n- Definition of a 3D set of axes requires:\n- An origin (3 quantities)\n- An orientation (3 quantities)\n- A scale (1 quantity)\n(A \"Helmert\" transformation estimates these 7\nquantities to relate two reference frames).\n- For the Earth; terrestrial frames come in two forms:\n- Geometric (mathematical description)\n- Potential field based (gravity and magnetic)\n\n09/08/2004\n12.215 Modern Naviation\nSimplest Global Reference Frame\n- Geometric: Origin at the\ncenter of mass of the Earth;\nOrientation defined by a Z-\naxis near the rotation axis;\none \"Meridian\" (plane\ncontaining the Z-axis) defined\nby a convenient location such\nas Greenwich, England.\n- Coordinate system would be\nCartesian XYZ.\nZ\nX\nY\nCenter of Mass\nGreenwich\nMeridian\n\n09/08/2004\n12.215 Modern Naviation\nSimple System\n- The use of this type of simple system is actually a\nrecent development and is the most common system\nused in GPS.\n- Until the advent of modern \"space-based geodetic\nsystems\" (mid-1950s), coordinate systems were much\nmore complicated and based on the gravity field of the\nEarth.\n- Why?\n\n09/08/2004\n12.215 Modern Naviation\nPotential based coordinate systems\n- The basic reason is \"realization\": Until distance\nmeasurements to earth-orbiting satellites and galactic-\nbased distance measurements, it was not possible to\nactually implement the simple type measurement\nsystem.\n- Conventional (and still today) systems rely on the\ndirection of the gravity vector\n- We think in two different systems: A horizontal one\n(how far away is something) and a vertical one (height\ndifferences between points).\n\n09/08/2004\n12.215 Modern Naviation\nConventional Systems\n- Conventional coordinate systems are a mix of\ngeometric systems (geodetic latitude and longitude)\nand potential based systems (Orthometric heights).\n- The origin of conventional systems are also poorly\ndefined because determining the position of the center\nof mass of the Earth was difficult before the first Earth-\norbiting artificial satellite. (The moon was possible\nbefore but it is far enough away that sensitivity center\nof mass of the Earth was too small).\n\n09/08/2004\n12.215 Modern Naviation\nNext Lecture\n- Definitions of Latitude and Longitude\n- Simple spherical system\n- Geometric ellipsoidal system\n- Astronomical system\n- Relationships between these\n- Impact of differences on precise navigation."
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec02.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/10ed0c71305cd32af8b44720195d31b5_12_215_lec02.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n09/18/2006\n12.215 Modern Naviation L02\nToday's Class\nLatitude and Longitude\n- Simple spherical definitions\n- Geodetic definition: For an ellipsoid\n- Astronomical definition: Based on direction of gravity\n- Relationships between the types\n- Coordinate systems to which systems are referred\n- Temporal variations in systems\n\n09/18/2006\n12.215 Modern Naviation L02\nSimple Geocentric Latitude and\nLongitude\n- The easiest form of latitude and longitude to\nunderstand is the spherical system:\n- Latitude: Angle between the equatorial plane and the\npoint. Symbol φc (in this class)\n- Latitude is also the angle between the normal to the\nsphere and the equatorial plane\n- Related term: co-latitude = 90o-latitude. Symbol θc (in\nthis class). Angle from the Z-axis\n- Longitude: Angle between the Greenwich meridian\nand meridian of the location. Symbol λc\n\n09/18/2006\n12.215 Modern Naviation L02\nGeocentric quantities\n- Geocentric\nLatitude and\nLongitude\n- Note: Vector\nto P is also\nnormal to the\nsphere.\nZ\nX\nY\nGreenwich\nMeridian\nP\nλ\nφ\nMeridian of\npoint P\nEquator\nH\nθ\nR\n\n09/18/2006\n12.215 Modern Naviation L02\nGeocentric relationship to XYZ\n- One of the advantages of geocentric angles is that the\nrelationship to XYZ is easy. R is taken to be radius of\nthe sphere and H the height above this radius\nφc = tan-1(Z /\nX 2 + Y 2)\nλc = tan-1(Y /X)\nR + Hc =\nX 2 + Y 2 + Z 2\nX = (R + Hc)cosφc cosλc\nY = (R + Hc)cosφc sinλc\nZ = (R + Hc)sinφc\n\n09/18/2006\n12.215 Modern Naviation L02\nProblem with Geocentric\n- Geocentric measures are easy to work with but they\nhave several serious problems\n- The shape of the Earth is close to an bi-axial ellipsoid\n(i.e., an ellipse rotated around the Z-axis)\n- The flattening of the ellipsoid is ~1/300\n(1/298.257222101 is the defined value for the GPS\nellipsoid WGS-84).\n- Flattening is (a-b)/a where a is the semi-major axis\nand b is the semi-minor axis.\n- Since a=6378.137 km (WGS-84), a-b=21.384 km\n\n09/18/2006\n12.215 Modern Naviation L02\nGeocentric quantities\n- If the radius of the Earth is taken as b (the smallest\nradius), then Hc for a site at sea-level on the equator\nwould be 21km (compare with Mt. Everest\n28,000feet~8.5km).\n- Geocentric quantities are never used in any large\nscale maps and geocentric heights are never used.\n- We discuss heights in more in next class and when\nwe do spherical trigonometry we will use geocentric\nquantities.\n\n09/18/2006\n12.215 Modern Naviation L02\nEllipsoidal quantities\n- The most common latitude type seen is geodetic\nlatitude which is defined as the angle between the\nnormal to the ellipsoid and the equatorial plane. We\ndenote with subscript g.\n- Because the Earth is very close to a biaxial ellipsoid,\ngeodetic longitude is the same as geocentric longitude\n(the deviation from circular in the equator is only a few\nhundred meters: Computed from the gravity field of\nthe Earth).\n\n09/18/2006\n12.215 Modern Naviation L02\nGeodetic Latitude\nNorth\nEquator\nGeoid\ngravity direction\nNormal to ellipsoid\nφg\nφa\nLocal equipotenital surface\nEarth's surface\nP\nAstronomical\nLatitude also shown\n\n09/18/2006\n12.215 Modern Naviation L02\nRelationship between φg and XYZ\n- This conversion is more complex than for the\nspherical case.\nX = (N + hg)cos(φg)cos(λg)\nY = (N + hg)cos(φg)sin(λg)\nZ = [(1-e2)N + hg]sin(φg)\nwhere e2 = 2 f -f 2 and N (North -South radius of curvature) is\nN 2 = a2 /[1-e2 sin2(φg)]\n\n09/18/2006\n12.215 Modern Naviation L02\nInverse relationship\n- The inverse relationship between XYZ and geodetic\nlatitude is more complex (mainly because to compute\nthe radius of curvature, you need to know the latitude).\n- A common scheme is iterative:\n\na N'= a/ 1-e2 sinφ'\nr'=\nX 2 + Y 2[1-e2N'/(N'+h')]\nφ'= tan-1(Z /r')\nh'=\nX 2 + Y 2 /cosφ'-N' or h'= Z/sinφ'-(1-e2)N'\niterate to a until h' change is small\n\n09/18/2006\n12.215 Modern Naviation L02\nFrom http://www.colorado.edu/geography/gcraft/notes/datum/gif/xyzllh.gif\nClosed form\nexpression for\nsmall heights\n\n09/18/2006\n12.215 Modern Naviation L02\nOther items\n- A discussion of geodetic datum and coordinate systems\ncan be found at:\nhttp://www.colorado.edu/geography/gcraft/notes/datum/datum.html\n- Geodetic longitude can be computed in that same way\nas for geocentric longitude\n- Any book on geodesy will discuss these quantities in\nmore detail (also web searching on geodetic latitude will\nreturn many hits).\n- The difference between astronomical and geodetic\nlatitude and longitude is called \"deflection of the vertical\"\n\n09/18/2006\n12.215 Modern Naviation L02\nAstronomical latitude and longitude\n- These have similar definitions to geodetic latitude and\nlongitude except that the vector used is the direction\nof gravity and not the normal to the ellipsoid (see\nearlier figure).\n- There is not direct relationship between XYZ and\nastronomical latitude and longitude because of the\ncomplex shape of the Earth's equipotential surface.\n- In theory, multiple places could have the same\nastronomical latitude and longitude.\n- As with the other measures, the values of depend on\nthe directions of the XYZ coordinate axes.\n\n09/18/2006\n12.215 Modern Naviation L02\nCoordinate axes directions\n- The origin of the XYZ system these days is near the\ncenter of mass of the Earth deduced from the gravity\nfield determined from the orbits of geodetic satellites\n(especially the LAGEOS I and II satellites).\n- The direction of Z-axis by convention is near the mean\nlocation of the rotation axis between 1900-1905. At the\ntime, it was approximately aligned with the maximum\nmoments of inertia of the Earth. (review:\nhttp://dept.physics.upenn.edu/courses/gladney/mathphys/java/sect4/subsubsection4_1_4_2.html\n\n09/18/2006\n12.215 Modern Naviation L02\nMotion of rotation axis\n- The rotation axis has moved about 10 m on average\nsince 1900 (thought to be due to post-glacial\nrebound).\n- It also moves in circle with a 10 m diameter with two\nstrong periods: Annual due to atmospheric mass\nmovements and 433-days which is a natural\nresonance frequency of an elastic rotating ellipsoid\nwith a fluid core like the Earth.\n\n09/18/2006\n12.215 Modern Naviation L02\nMotion of rotation axis 1993-2001\n-10.0\n-5.0\n0.0\n5.0\n10.0\n0.0\n5.0\n10.0\n15.0\n20.0\nPole Position\nX Pole (m)\nY Pole (m)\nNote that the origin\nof this plot (0,0) is at\nthe middle right\nhand edge\n\n09/18/2006\n12.215 Modern Naviation L02\nRotation rate of the Earth\n- To determine longitude we need to know the time\ndifference between an event (such as a star crossing\nthe meridian of a location) and the time that event\noccurs in Greenwich.\n- One of the things that observatories such as\nGreenwich do, is measurements of celestial events\nand note the times they occur.\n- With models of the changes in the rotation of the Earth\nin space, these measurements can be used to\nprediction when events will occur in the future.\n\n09/18/2006\n12.215 Modern Naviation L02\nRotation rate of the Earth\n- We examine these tabulations (called almanacs or\nephemeredes) later in the course.\n- One process that make these events non-predictable\nis changes in the rotation rate of the Earth.\n- Measurements of the these changes are compiled and\npublished by the International Earth Rotation Service\n(IERS: http://www.iers.org)\n- We will examine these variations when we look at\nastronomical positioning.\n\n09/18/2006\n12.215 Modern Naviation L02\nConventional definitions of\ncoordinate systems\n- Today we can use center of mass systems but in the past (prior\nto 1950) this was very difficult and so the origin and orientation of\nthe axes was somewhat arbitrarily chosen.\n- Different countries and at different times, the ellipsoidal\nparameters (a and b dimensions) were different\n- The origin and orientation were set by adopting one location\nwhere the geodetic and astronomical latitude and longitude we\nset to be the same.\n- For the US, this was Meades Ranch in mid-continent.\n- The result of these arbitrary choices was that across country\nborders, geodetic coordinates could differ by several hundred\nmeters. (Problematic when borders were defined by coordinates)\n\n09/18/2006\n12.215 Modern Naviation L02\nSummary\n- The important things from this lecture are:\n- Definitions of different types of latitude and\nlongitude\n- Mathematical relationships between these can XYZ\ncoordinates\n- Definitions of Z axis of the Earth coordinates\n- Possible major differences in coordinates between\ncountries and at different times (e.g., NAD-27 and\nNAD-83)\n- Next lecture we will look at height systems."
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec03.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/9c7212a8eb59e31fa12e8491667da766_12_215_lec03.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n09/20/2006\n12.215 Modern Naviation L03\nReview of Monday Class\nLatitude and Longitude\n- Simple spherical definitions\n- Geodetic definition: For an ellipsoid\n- Astronomical definition: Based on direction of gravity\n- Relationships between the types\n- Coordinate systems to which systems are referred\n- Temporal variations in systems\n\n09/20/2006\n12.215 Modern Naviation L03\nToday's class: Heights\n- Definition of heights\n- Ellipsoidal height (geometric)\n- Orthometric height (potential field based)\n- Shape of equipotential surface: Geoid for Earth\n- Methods for determining heights\n\n09/20/2006\n12.215 Modern Naviation L03\nEllipsoidal heights\n- Calculation of ellipsoid heights from Cartesian XYZ\nwas covered in Lecture 2.\n- The ellipsoid height is the distance along the normal\nto the reference ellipsoid from the surface of the\nellipsoid to the point who height is being calculated.\n- While the geometric quantities, geodetic latitude and\nlongitude are used for map mapping and terrestrial\ncoordinates in general; ellipsoidal height is almost\nnever used (although this is changing with the advent\nof GPS)\n- Why is ellipsoidal height not used?\n\n09/20/2006\n12.215 Modern Naviation L03\nOrthometric heights\n- The problem with ellipsoidal heights are:\n- They are new: Ellipsoidal heights could only be\neasily determined when GPS developed (1980's)\n- Geometric latitude and longitude have been around\nsince Snell (optical refraction) developed\ntriangulation in the 1500's.\n- Primary reason is that fluids flow based on the\nshape of the equipotential surfaces. If you want\nwater to flow down hill, you need to use potential\nbased heights.\n\n09/20/2006\n12.215 Modern Naviation L03\nOrthometric heights\n- Orthometric heights are heights above an\nequipotential surface\n- The equipotential surface is called the geoid and\ncorresponds approximately to mean sea level (MSL).\n- The correspondence is approximately because MSL is\nnot an equipotential surface because of forces from\ndynamic ocean currents (e.g., there is about 1m drop\nover the Gulf stream which is permanently there but\nchange magnitude depending on the strength of the\ncurrent)\n\n09/20/2006\n12.215 Modern Naviation L03\nMean Sea Level (MSL)\n- Ocean tides also need to be considered but this can be averaged\nover time (signal is periodic with semi-diurnal, diurnal and long\nperiod tides. Longest period tide is 18.6 years)\n- Another major advantage of MSL is that is has been monitored at\nharbors for many centuries in support of ocean going vessels\n- Also poses a problem because dredging of harbors can change\nthe tides.\n- Land-locked countries had to rely on other countries to tell them\nthe heights at the border.\n- MSL is reasonably consistent around the world and so height\ndatums differ by only a few meters (compared to hundreds of\nmeters for geodetic latitude and longitude.\n\n09/20/2006\n12.215 Modern Naviation L03\nHeight determination\n- Height measurements historically are very labor\nintensive\n- The figure on the next page shows how the technique\ncalled leveling is used to determine heights.\n- In a country there is a primary leveling network, and\nother heights are determined relative to this network.\n- The primary needs to have a monument spacing of\nabout 50 km.\n\n09/20/2006\n12.215 Modern Naviation L03\nLeveling\n- The process of leveling is to measure height\ndifferences and to sum these to get the heights of\nother points.\nN\nMSL\nequipotential\nsurface\nGEIOD\nStaff (vertical)\nLevel\nΔh1\nΔh2\nΔh3\nZero height\nOrthometric\nheight of hill is\nΔh1+Δh2+Δh3\nN is Geoid\nHeight. Line at\nbottom is\nellipsoid\n\n09/20/2006\n12.215 Modern Naviation L03\nLeveling\n- Using the instrument called a level, the heights on the\nstaffs are read and the difference in the values is the\nheight differences.\n- The height differences are summed to get the height\nof the final point.\n- For the primary control network: the separation of the\nstaffs is between 25-50 meters.\n- This type of chain of measurements must be stepped\nacross the whole country (i.e., move across the\ncountry in 50 meter steps: Takes decades and was\ndone).\n\n09/20/2006\n12.215 Modern Naviation L03\nLeveling problems\n- Because heights are determined by summing differences, system\nvery prone to systematic errors; small biases in the height\ndifferences due to atmospheric bending, shadows on the\ngraduations and many other types of problem\n- Instrument accuracy is very good for first-order leveling: Height\ndifferences can be measured to tens of microns.\n- Accuracy is thought to about 1 mm-per-square-root-km for first\norder leveling.\n- Changes in the shapes of the equipotential surface with height\nabove MSL also cause problems.\n- The difference between ellipsoidal height and Orthometric height\nis the Geoid height\n\n09/20/2006\n12.215 Modern Naviation L03\nTrigonometric Leveling\n- When trying to go the tops of mountains, standard\nleveling does not work well. (Image trying to do this to\nthe summit of Mt. Everest).\n- For high peaks: A triangulation method is used call\ntrigonometric leveling.\n- Schematic is shown on the next slide\n- This is not as accurate as spirit leveling because of\natmospheric bending.\n\n09/20/2006\n12.215 Modern Naviation L03\nTrigonometric Leveling schematic\n- Method for trigonometric leveling. Method requires\nthat distance D in known and the elevation angles are\nmeasured. Trigonometry is used to compute Δh\nN\nMSL\nequipotential\nsurface\nGEIOD\nΔh\nknown height\nD\nε1\nε2\n\n09/20/2006\n12.215 Modern Naviation L03\nTrigonometric Leveling\n- In ideal cases, elevation angles at both ends are measured at the\nsame time. This helps cancel atmospheric refraction errors.\n- The distance D can be many tens of kilometers.\nIn the case of Mt. Everest, D was over 100 km (the survey team\nwas not even in the same country; they were in India and\nmountain is in Nepal).\n- D is determined either by triangulation or after 1950 by electronic\ndistance measurement (EDM) discussed later\n- The heights of the instruments, called theodolites, above the\nground point must be measured. Note: this instrument height\nmeasurement was not needed for leveling.\n\n09/20/2006\n12.215 Modern Naviation L03\nGeoid height\n- Although the difference between ellipsoidal and\northometric height allows the geoid height to be\ndetermined, this method has only be been used since\nGPS became available.\n- Determining the geoid has been historical done using\nsurface gravity measurements and satellite orbits.\n- Satellite orbit perturbations reveal the forces acting on\nthe satellite which if gravity is the only effect is the first\nderivative of the potential (atmospheric drag and other\nforces can greatly effect this assumption)\n\n09/20/2006\n12.215 Modern Naviation L03\nGeoid height\n- The long wavelength part of geoid (greater than 1000km) is now\ndetermined from satellite orbit perturbations.\n- The <1000km wavelength use surface gravity and solve a\nboundary value problem where the derivative of the function\nwhich satisfies Laplace's equation is given on the boundary, and\nthe value of the function is needed.\n- Most of the great mathematicians worked on field theory trying to\nsolve the Earth boundary value problem (Laplace, Legendre,\nGreen, Stokes)\n- The standard method of converting gravity measurements to\ngeoid height estimates is called Stokes method.\n- This field is called physical geodesy\n\n09/20/2006\n12.215 Modern Naviation L03\nUS Geoid\n- National geodetic survey maintains a web site that\nallows geiod heights to be computed (based on US\ngrid)\nhttp://www.ngs.noaa.gov/cgi-bin/GEOID_STUFF/geoid99_prompt1.prl\n- Near Boston geiod height is -27.688 m\n- The lowest geoid height in the US is -51m and the\nhighest is 3.2m\n- Lowest value in the world is south of India and is\nabout -100 m\n\n09/20/2006\n12.215 Modern Naviation L03\nUS Geoid\n\n09/20/2006\n12.215 Modern Naviation L03\nSummary\n- In Today's class we have discussed:\n- Definition of heights\n- Ellipsoidal height (geometric)\n- Orthometric height (potential field based)\n- Shape of equipotential surface: Geoid for Earth\n- Methods for determining heights\n- Check the links given in this lecture for more\ninformation\n- Also try web searching on physical+geodesy, geoid,\nradar+altimetry."
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec04.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/b49ef234eee68c7a9bd5423d0b9ef990_12_215_lec04.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n09/27/2006\n12.215 Modern Naviation L04\nReview of Wednesday Class\n- Definition of heights\n- Ellipsoidal height (geometric)\n- Orthometric height (potential field based)\n- Shape of equipotential surface: Geoid for Earth\n- Methods for determining heights\n\n09/27/2006\n12.215 Modern Naviation L04\nToday's Class\n- Spherical Trigonometry\n- Review plane trigonometry\n- Concepts in Spherical Trigonometry\n- Distance measures\n- Azimuths and bearings\n- Basic formulas:\n- Cosine rule\n- Sine rule\n- http://mathworld.wolfram.com/SphericalTrigonometry.html\nis a good explanatory site\n\n09/27/2006\n12.215 Modern Naviation L04\nSpherical Trigonometry\n- As the name implies, this is the style of trigonometry\nused to calculate angles and distances on a sphere\n- The form of the equations is similar to plane\ntrigonometry but there are some complications.\nSpecifically, in spherical triangles, the angles do not\nadd to 180o\n- \"Distances\" are also angles but can be converted to\ndistance units by multiplying the angles (in radians) by\nthe radius of the sphere.\n- For small sized triangles, the spherical trigonometry\nformulas reduce to the plane form.\n\n09/27/2006\n12.215 Modern Naviation L04\nReview of plane trigonometry\n- Although there are many plane trigonometry formulas,\nalmost all quantities can be computed from two\nformulas: The cosine rule and sine rules.\nA\nB\nC\na\nb\nc\nAngles A, B and C; Sides a, b and c\nSum of angles A+B+C=180\nCosine Rule:\nSine Rule:\nc\n2 = a\n2 +b\n2 -2abcosC\na\nsin A =\nb\nsinB =\nc\nsinC\n\n09/27/2006\n12.215 Modern Naviation L04\nBasic Rules\n(discussed in following slides)\nA\nB\nC\na\nc\nb\nA B C are angles\na b c are sides\n(all quanties are angles)\nSine Rule\n\nsin a\nsin A = sin b\nsin B = sin c\nsinC\nCosine Rule sides\nCosine Rule angles\n\ncosa = cosbcosc+sinbsinccos A\ncosb = cosccosa +sincsinacos B\ncosc = cosbcosa +sinasinbcosC\ncosA = -cos BcosC +sin BsinC cosa\ncosB = -cos AcosC +sin AsinC cosb\ncosC = -cosAcos B +sin Asin Bcosc\nO\n\n09/27/2006\n12.215 Modern Naviation L04\nSpherical Trigonometry Interpretation\n- Interpretation of sides:\n- The spherical triangle is formed on a sphere of unit radius.\n- The vertices of the triangles are formed by 3 unit vectors (OA,\nOB, OC).\n- Each pair of vectors forms a plane. The intersection of a\nplane with a sphere is a circle.\n- If the plane contain the center of the sphere (O), it is called a\ngreat circle\n- If center not contained called a small circle (e.g., a line of latitude\nexcept the equator which is a great circle)\n- The side of the spherical triangle are great circles between the\nvertices. The spherical trigonometry formulas are only valid\nfor triangles formed with great circles.\n\n09/27/2006\n12.215 Modern Naviation L04\nInterpretation\n- Interpretation of sides (continued):\n- Arc distances along the great circle sides are the\nside angle (in radians) by the radius of the sphere.\nThe side angles are the angles between the\nvectors.\n- Interpretation of angles\n- The angles of the spherical triangles are the\ndihedral angles between the planes formed by the\nvectors to the vertices.\n- One example of angles is the longitude difference\nbetween points B and C if A is the North Pole.\n\n09/27/2006\n12.215 Modern Naviation L04\nInterpretation\n- In navigation applications the angles and sides of\nspherical triangles have specific meanings.\n- Sides: When multiplied by the radius of the Earth, are\nthe great circle distances between the points. On a\nsphere, this is the short distance between two points\nand is called a geodesic. When one point is the North\npole, the two sides originating from that point are the\nco-latitudes of the other two points\n- Angles: When one of the points is the North pole, the\nangles at the other two points are the azimuth or\nbearing to the other point.\n\n09/27/2006\n12.215 Modern Naviation L04\nDerivation of Cosine rule\n- The spherical trigonometry cosine rule can be derived\nform the dot product rule of vectors fairly easily. The\nsine rule can be also derived this way but it is more\ndifficult.\n- On the next page we show the derivation by carefully\nselecting the coordinate axes for expressing the\nvector.\n- (Although we show A in the figures as at the North\npole this does not need to be case. However, in many\nnavigation application one point of a spherical triangle\nis the North pole.)\n\n09/27/2006\n12.215 Modern Naviation L04\nDerivation of cosine rule\nA\nB\nC\na\nc\nb\nO\nVector OB has components:\n[sin c, 0, cos c]\nVector OC has components:\n[sin b cos A, sin b sin A, cos b]\nX\nZ\nY\nFrom dot product rule:\ncosa = O B -O C\n= sinc,0,cosc\n[\n]- sin b cos A, sin b sin A, cos b\n[\n]\n= sincsinbcosA +cosccosb\nTaking OA as the Z-axis, and\nOB projected into the plane\nperpendicular to OA as the X axis\n\n09/27/2006\n12.215 Modern Naviation L04\nArea of spherical triangles\n- The area of a spherical triangle is related to the sum of the\nangles in the triangles (always >180o)\n- The amount the angles in a spherical triangle exceed 180o or π\nradians is called the spherical excess and for a unit radius sphere\nis the area of the spherical triangle\n- e.g. A spherical triangle can have all angles equal 90o and so\nthe spherical excess is π/2. Such a triangle covers 1/8 the\narea of sphere. Since the area of a unit sphere is 4π ster-\nradians, the excess equals the area (consider the triangle\nformed by two points on the equator, separated by 90o of\nlongitude).\n\n09/27/2006\n12.215 Modern Naviation L04\nTypical uses of Spherical\nTrigonometry\n- Spherical trigonometry is used for most calculations in navigation\nand astronomy. For the most accurate navigation and map\nprojection calculation, ellipsoidal forms of the equations are used\nbut this equations are much more complex and often not closed\nformed.\n- In navigation, one of the vertices is usually the pole and the sides\nb and c are colatitudes.\n- The distance between points B and C can be computed knowing\nthe latitude and longitude of each point (Angle A is difference in\nlongitude) using the cosine rule. Quadrant ambiguity in the cos-1\nis not a problem because the shortest distance between the\npoints is less than 180o\n- The bearing between the points is computed from the sine rule\nonce the distance is known.\n\n09/27/2006\n12.215 Modern Naviation L04\nAzimuth or Bearing calculation\n- In the azimuth or bearing calculation, quadrant ambiguity is a\nproblem since the sin-1 will return two possible angles (that yield\nthe same value for sine).\n- To resolve the quadrant ambiguity: rewrite the cosine rule for\nsides (since all sides are now known) in the form:\ncos B = (cos b - cos c cos a)/(sin c sin a)\n- Then use the two-argument tan-1 to compute the angle and\ncorrect quadrant.\n- Note: That the aziumuth to travel back to point is not simply\n180o+forward azimuth. To stay on a great circle path, the\nazimuth or bearing of travel has to change along the parth.\n\n09/27/2006\n12.215 Modern Naviation L04\nHomework\n- Homework 1 is available on the 12.215 web page\n12.215_HW01\n- Due Wednesday October 4, 2006\n- Solutions to the homework can be submitted on paper\nor by email as a PDF or Word document.\n\n09/27/2006\n12.215 Modern Naviation L04\nSummary\n- In this class, we\n- Reviewed plane trigonometry\n- Introduced concepts in Spherical Trigonometry\n- Distance measures\n- Azimuths and bearings\n- Developed the basic formulas:\n- Cosine rule\n- Sine rule\n- Discuss some ways these formulas are used"
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec05.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/d0abc060b2e30625ec40b4fa497746be_12_215_lec05.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n10/04/2006\n12.215 Modern Naviation L05\nReview of Monday's Class\n- Spherical Trigonometry\n- Review plane trigonometry\n- Concepts in Spherical Trigonometry\n- Distance measures\n- Azimuths and bearings\n- Basic formulas:\n- Cosine rule\n- Sine rule\n- Basic applications\n\n10/04/2006\n12.215 Modern Naviation L05\nToday's Class\n- Motion of the Earth and Sun\n- Geometry of Earth/Sun system\n- Astronomical coordinates\n- Motion of the Earth around the sun\n- Equation of Time\n- Astronomical positioning\n- Latitude and Longitude determination using\nastronomical bodies\n- Error contributions to latitude and longitude\nmeasurements.\n\n10/04/2006\n12.215 Modern Naviation L05\nGeometry of Earth Sun System\n- Figure below shows the basic geometry\nSUN\nω\nequator\nω\nequator\nω\nequator\nω\nequator\nNorthern Hemisphere\nWinter\nNorthern Hemisphere\nSpring\nNorthern Hemisphere\nSummer\nNorthern Hemisphere\nFall\nEarth's Orbit\nEcliptic\n\n10/04/2006\n12.215 Modern Naviation L05\nGeometry of Earth Sun\n- The Earth's equator plane is inclined at ~23.5o to the orbit plane\n(called the ecliptic)\n- It takes ~365.25 solar days for one orbit (hence a leap-year every\n4 years, and the odd rule about leap years at century boundaries\nbecause the value is not exactly 365.25 solar days.\n- A solar-day is the length of time (on average) for the sun to move\nfrom noon to noon. Because the earth moves in its orbit by a little\nduring the day, the length of time for stars to come to the same\nplace in the sky is a little bit shorter.\n- A sidereal-day is the length of time for stars to come back to the\nsame point in the sky\n- There are ~366.25 sidereal days in a year (the extra day is\nbasically one rotation due to the orbit in one year).\n\n10/04/2006\n12.215 Modern Naviation L05\nTime systems\n- There are a number of time systems encountered in astronomy\nand navigation.\n- Time keep by our watches is related to Universal Time\nCoordinated (UTC). Used to be called Greenwich Mean Time\n(GMT)\n- UTC is based on atomic time standards (Cesium clocks) and\nis an average over Cesium clocks operated all around the\nworld. The US clocks are operated at the US Naval\nObservatory in Washington DC\n- The International Earth Rotation Service (IERS) (and formally\nthe Bureau International de Le Heure (BIH)) coordinates these\nactivities and publishes corrections to the time systems\noperated in each country\n\n10/04/2006\n12.215 Modern Naviation L05\nTime systems\n- The time defined by atomic clocks runs at a constant rate.\nUnfortunately, we tend to perceive time by the rotation of the\nEarth which is not uniform. There is a slowing of the rate of\nrotation of Earth (about 1 second every 18 months) and there are\nfluctuations due mainly to changes in atmospheric winds and\nprocesses in the fluid core.\n- Time defined by the rotation of the Earth is called UT1 and is\nsolar day system.\n- UTC has discontinuities, call leap-seconds, that are added to\nkeep it aligned with UT1. (When the atomic second was adopted\nin the mid-1950s the rates were the same and so leap-seconds\nwere not needed. They were introduced in the mid-1960s after\nthe Earth rotation rate had slowed enough that the difference\nbetween UT1 and UTC had reached several seconds.\n\n10/04/2006\n12.215 Modern Naviation L05\nTime systems\n- The difference between UT1 and UTC has be\nmeasured and the IERS coordinates these\nmeasurements and published differences between\nUT1 and UTC. (They also decide when leap seconds\nneed to be added).\n- Sidereal time is derived from UT1 and measures times\nin sidereal seconds. If we ran our watches on sidereal\ntime, the stars would also be in the same place in the\nsky at the same time. (With solar time, the stars rise 4\nminutes earlier each night).\n\n10/04/2006\n12.215 Modern Naviation L05\nSolar time\n- Solar time is based on the mean solar day, but the time that Sun\nreaches its highest point each day (around noon) varies through\nout the year. The difference between noon at Greenwich and\nwhen the sun is at its highest point (or highest elevation angle) is\ncall the Equation of Time.\n- There are two components to the equation:\n- The Earth's orbit is eccentric (e=0.0167) and so moves at\ndifferent speeds through the orbit, causes an annual variation.\n- The equator is included to the orbit plane (obliquity of the\necliptic) by ~23.5o and this causes a semi-annual variation.\n- Combination of the two effects cause changes in the time of\nnoon at Greenwich by -14 to +16 minutes (see URL:\nhttp://www.nmm.ac.uk/\n\n10/04/2006\n12.215 Modern Naviation L05\nEquation of\nTime\nGraphics from\nURL given on\nprevious page\nFor Longitude\ndetermination\nusing the sun, this\neffect must be\naccounted for (15\nminutes of\ntime~225 nautical\nmiles)\n\n10/04/2006\n12.215 Modern Naviation L05\nAstronomical position determination\n- To determine position using astronomical measurements (or a\nsextant) requires relating positions of celestial objects to Earth\ncoordinates.\n- Celestial coordinates:\n- Declination: Measured from equator and it astronomical\ncoordinate equivalent to latitude\n- Right Ascension: Angle measured along the equator (similar\nto longitude) but origin is the intersection of the equator and\necliptic planes (called the first point of Aries).\n- Celestial coordinates are specified in a non-rotating or slowly\nrotating frame. The diurnal rotation of the Earth is not in the\ncoordinates.\n\n10/04/2006\n12.215 Modern Naviation L05\nCelestial coordinates\n- Since the celestial coordinates are given in a system\nattached to the equator of the Earth, they would\nchange slowly with time due to precession (26,000\nyear motion of the rotation axis, about an axis\nperpendicular to the orbit plane), and nutation\n(nodding of the rotation axis in space due to\ngravitational torque on the equatorial bulge.\n- Because of these motions of the rotation axis (and\nhence in the equator) in space, celestial coordinates\nare generated in a number of systems.\n\n10/04/2006\n12.215 Modern Naviation L05\nCelestial coordinates\n- Fundamental coordinates of stars are given in a system which\ncorresponds to the equator and ecliptic orientations at a specific\ntime, call coordinates of epoch. Current system is call J2000 and\nis the position at Jan 1.5, 2000.\n- The other common system is the coordinates of date\ncorresponding to the equator and ecliptic orientations at the day\nof interest.\n- There is a mathematical relationship through the application of a\nseries of rotation matrices, that allow the systems to be related.\n- For navigation, positions of date are used and these can be\nfound in almanacs (or can be computed). We discuss almanacs\nin the next lecture.\n\n10/04/2006\n12.215 Modern Naviation L05\nCelestial positioning\n- The easiest method for determining latitude and\nlongitude is to make measurements of the elevation\nangle to the Sun at its highest point and to note the\ntime at which this event occurs. This method requires\naccess to accurate time which was the major advance\nmade in determining longitude by the Harrison clocks.\nThe book Longitude details these developments\n- To determine latitude, the declination of the sun needs\nto be known on the day (obtained from almanacs) and\nthe elevation measured (usually over a period of time\nso that highest point reached can be determined).\n\n10/04/2006\n12.215 Modern Naviation L05\nLatitude determination\nWhen the sun\nis at the\nhighest\nelevation, it is\nin the plane of\nthe meridian\nand\nφa=90-e+δ\nδ\nφa\nzd\nTo Celestial body\ne.g. Sun\nRotation Axis\nφa = Zd+δ\ndeclination\nZenith distance=\n90-elevation\nGeiod\nε=elevation\nangle\n\n10/04/2006\n12.215 Modern Naviation L05\nLongitude determination\n- The Greenwich observatory publishes tables of the\ntime that the sun will cross the meridian in Greenwich\n(equation of time) and the difference between the time\nof the meridian crossing of the Sun at your location\nand the time in Greenwich, is the longitude of your\nlocation in time units. (Multiple by 15 to get degrees).\n- Your time has to be converted to UTC which means\nthat the time zone needs to be known (Boston for\nexample is 5 hours from Greenwich except when\ndaylight savings time is in effect and then it is 4\nhours).\n\n10/04/2006\n12.215 Modern Naviation L05\nErrors in positioning\n- Several types of errors can effect latitude and longitude\ndetermination\n- For latitude:\n- Atmospheric bending of the light from the Sun can cause\nerrors of several minutes of arc (several nautical miles).\nThere are approximate equations that allow this to be\ncorrected.\n- There are other errors associated with sextant measurements\nwhich we will discuss when we use the instrument\n- For longitude:\n- Judging when the sun is at its highest point is difficult because\nthe elevation angle changes slowly at the time\n- Error in knowledge of local time is a large error especially id\nno external calibration is possible (e.g., when clocks were first\nused).\n\n10/04/2006\n12.215 Modern Naviation L05\nSummary of Today's class\n- Motion of the Earth and Sun\n- Geometry of Earth/Sun system\n- Astronomical coordinates\n- Motion of the Earth around the sun\n- Equation of Time\n- Astronomical positioning\n- Latitude and Longitude determination using\nastronomical bodies\n- Error contributions to latitude and longitude\nmeasurements. Later we will see how when we can\nmake these measurements with a sextant."
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec06.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/044ab491bafac0b0fee4ce772cbff4ad_12_215_lec06.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n10/11/2006\n12.215 Modern Naviation L06\nReview of last Class\n- Motion of the Earth and Sun\n- Geometry of Earth/Sun system\n- Astronomical coordinates\n- Motion of the Earth around the sun\n- Equation of Time\n- Astronomical positioning\n- Latitude and Longitude determination using\nastronomical bodies\n- Error contributions to latitude and longitude\nmeasurements.\n\n10/11/2006\n12.215 Modern Naviation L06\nToday's Class\n- Almanacs: Paper and electronics\n- Paper Almanacs: Nautical Almanac\n- Electronic: Available on many web sites\n\n10/11/2006\n12.215 Modern Naviation L06\nNautical Almanac\n- Probably most common for ship navigation in US.\nPublished by the US Naval Observatory and Her\nMajesty's Nautical Almanac Office.\n- Contains all the necessary information for celestial\nnavigation\n- New volume published each year and contains\ninformation from Jan 1 to Dec 31 of that year\n- Largest part of book gives the RA and Declinations of\nSun, Moon, Aries, Venus, Mars, Jupiter and Saturn\nevery hour of every day\n\n10/11/2006\n12.215 Modern Naviation L06\nCover of Nautical Almanac\nCall Numbers\n\n10/11/2006\n12.215 Modern Naviation L06\nSun and Moon Tables\nEntries in Table\nGHA - Greenwich Hour\nAngle\nDec - Declination\nv - Rate of change of\nGHA ('/hr)\nd - Rate of change of\ndeclination ('/hr)\nHP - Horizontal parallax\n\n10/11/2006\n12.215 Modern Naviation L06\nExplanation\n- Greenwich Hour Angle is the angle between a body\nand the Greenwich meridian measured positive west\n(note sign convention difference).\n- The Greenwich Hour Angle of the Sun is always near\n0 at 12:00UT (difference is equation of time).\n- The GHA of the first point of Aries is the negative of\nGreenwich sidereal time.\n- v and d are computed simply by differencing values\nand make hand calculations easier\n\n10/11/2006\n12.215 Modern Naviation L06\nHorizontal Parallax of Moon\n- Tables are given to the center of a body from the\ncenter of the Earth. The moon is close enough that\nthe finite sizes of the Earth and Moon affect\nmeasurements.\n- HP of moon is difference in angles between edge of\nEarth and edge of moon. See\nhttp://aa.usno.navy.mil/faq/docs/RST_defs.html\nhttp://www.fourmilab.ch/earthview/moon_ap_per.html\n\n10/11/2006\n12.215 Modern Naviation L06\nEquation of Time\n- Also given in the Almanac is the equation of time for\neach day of the year. From this entry you can\ncalculate when the meridian crossing will be a\nGreenwich.\n- The difference between the Greenwich meridian of the\nSun and the local crossing is the longitude.\n\n10/11/2006\n12.215 Modern Naviation L06\nComments on Nautical Almanacs\n- The nautical Almanac contains many other tables and\nexplanations. Many of these tables were used before\nthe advent of calculators and computer programs.\n- Paper almanacs are meant to be used by ships at sea\nwith little computational power.\n- Altitude (elevation angles) corrections are given for\nthe size of the Sun (~16') and atmospheric refraction.\nFor atmospheric refraction an approximate formula is\n(accurate to 5\" at 20o)\nΔε = 60\"/(tanε + 0.028)\n\n10/11/2006\n12.215 Modern Naviation L06\nAtmospheric refraction\n0.1\n1.0\n10.0\n100.0\n-20.0\n0.0\n20.0\n40.0\n60.0\n80.0\n100.0\nRefraction (')\nModel (')\nModel\nRefraction (')\nElevation (deg)\nModel 1'/(tan(elev)+0.028)\n\n10/11/2006\n12.215 Modern Naviation L06\nError in simple refraction model\n-2.0\n-1.0\n0.0\n1.0\n2.0\n3.0\n-20.0\n0.0\n20.0\n40.0\n60.0\n80.0\nModel Error (')\nRefraction (')\nElevation (deg)\nCorresponds to 1 nautical Mile = 1.86km\n\n10/11/2006\n12.215 Modern Naviation L06\nNautical Almanac Correction\n- Based on Pressure and temperature zone A-N\n\n10/11/2006\n12.215 Modern Naviation L06\nCorrections\n- From Zone and altitude additional correction applied\n\n10/11/2006\n12.215 Modern Naviation L06\nOn-line almanacs\n- If access to the internet is possible then the on-line versions of\nalmanacs are much easier to use\n- Computer programs are also available which can be run locally.\nAll of the values in the Almanac are now computed (observations\nare no longer needed).\n- http://aa.usno.navy.mil/data/ has many resources including an\non-line version of MICA (Multi-Year Interactive Computer\nAlmanac)\nhttp://aa.usno.navy.mil/data/docs/WebMICA_2.html\n- Other on-line sources:\nhttp://www.tecepe.com.br/nav/almanac.html-ssi\nhttp://www.tecepe.com.br/scripts/AlmanacPagesISAPI.isa\nFor the remainder of the class we will examine these on-line\nsources and compare the results to the paper Nautical Alamanac"
    },
    {
      "category": "Lecture Notes",
      "title": "12_215_lec07.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/12-215-modern-navigation-fall-2006/2fab2223488206e2c12d9b84f4e4b91c_12_215_lec07.pdf",
      "content": "12.215 Modern Navigation\nThomas Herring\n\n10/17/2006\n12.215 Modern Naviation L07\nReview of Last Class\n- Almanacs: Paper and electronics\n- Paper Almanacs: Nautical Almanac\n- Electronic: Available on many web sites\n- Homework #1 solutions\n\n10/17/2006\n12.215 Modern Naviation L07\nToday's Lecture\n- Dead reckoning and conventional navigation\n- Magnetic North pole\n- Distance measurements\n- Use of Sextant\n- Principles of instrument\n- Vernier Scale reading (ex. Pierre Vernier (1580?-\n1637), French mathematician.)\n- Corrections needed for sextant measurements\n- (Next class we make sextant measurements)\n\n10/17/2006\n12.215 Modern Naviation L07\nDirection determination\n- Before GPS it was difficult to determine direction of\nmotion relative to true north.\n- From latitude and longitude determinations at two\npoints, the direction between them could be\ndetermined.\n- Geodetic maps show the directions between\nmonuments in the ground but these monuments\nneed to be found.\n- Some geodetic monuments (triangulation stations\nhave vanes on top that can be seen from a long\ndistance).\n\n10/17/2006\n12.215 Modern Naviation L07\nMagnetic North Pole\n- For navigation, most common method of finding\ndirection is relative to the magnetic North Pole\n- The Earth magnetic field is largely a dipole field but it\nhas higher order variations as well.\nNotice that the direction of\nthe dipole axis does not align\nwith the rotation axis\nA compass needle tries to\nalign with the field lines\n\n10/17/2006\n12.215 Modern Naviation L07\nCompasses\n- Since a compass wants to align with the field lines it\nwill point either up or down (relative to gravity) when it\nis away from the magnetic equator.\nTrue North\nMagnetic North\nField Lines\nDirection compass\nneedle points\nTo compensate for\nthe tendency to point\nup or down, good\ncompasses have\nweights to make the\nneedle lay flat\n\n10/17/2006\n12.215 Modern Naviation L07\nDip or Inclination\n- The angle that the needle wants to tilt to is called the\ndip or inclination of the needle.\n- Normally, a compass designed for use in the Northern\nMagnetic hemisphere can not be used in the Southern\nhemisphere unless the weighting mass can be moved\nto opposite side of the needle.\n- Magnetic dipole field equations:\nHr = -2mcosθ /r3\nHθ = -msinθ /r3 θ is colatitude\nTotal Intensity F = (m /r3) 1+ 3cos2θ r is radius\nInclination I = tan-1(2cotθ) m is field strength(Guass)\n\n10/17/2006\n12.215 Modern Naviation L07\nDeclination or Variation\n- The angle between true north and magnetic north is\ncall the declination or variation (with variation being\nthe marine term).\n- This angle can be computed approximately from the\nlocation of the North magnetic pole.\n- In 1994 North Magnetic Pole was located on the Noice\nPeninsula, southwest Ellef Ringnes Island, at 78.3° N,\n104.0° W.\n- The yearly motion of the pole is about 15 km per year.\nhttp://www.geolab.nrcan.gc.ca/geomag/northpole_e.shtml\n\n10/17/2006\n12.215 Modern Naviation L07\nMotion of North Pole\nFrom http://geo.phys.uit.no/articl/roadto.html\n\n10/17/2006\n12.215 Modern Naviation L07\nRecent Magnetic pole locations\nYear\nLatitude ( 。N)\nLongitude ( 。\nW)\n81.3\n110.8\n81.6\n111.6\n82.0\n112.4\n82.3\n113.4\n82.7\n114.4\n\n10/17/2006\n12.215 Modern Naviation L07\nDead Reckoning\n- Full book on subject available at:\nhttp://www.irbs.com/bowditch/\n- Basic problem with dead reckoning is that measurements are\nmade relative to the water and the water can be (usually is)\nmoving with respect to the land beneath\n- Knowledge of ocean currents is necessary for accurate dead\nreckoning:\n- Cross currents will have motion of vessel not in direction that it\nis pointed\n- Along-track currents will make speed relative to water (\"knots\")\ndifferent from speed relative to ocean bottom.\n- General character of ocean currents remains fixed, but frequent\ncelestial fixes are needed to compensate for variations.\n\n10/17/2006\n12.215 Modern Naviation L07\nBasic ocean currents\nFrom http://physicalgeography.net/fundamentals/8q_1.html\n\n10/17/2006\n12.215 Modern Naviation L07\nMagnetic variations\n- For dead reckoning variations in the magnetic field\nand compass also need to be accounted for\n- Major changes:\n- For compass: Deviation is a local correction to\ncompass because of nearby objects (important on a\nship)\n- Magnetic field:\n- Diurnal variations (tendency to point towards Sun) -- 2-5'\n- Annual variations -- 1'\n- Secular variation (due to changes in dipole field) -- 5-10'/yr\n- Local attractors (potential problem on land)\n\n10/17/2006\n12.215 Modern Naviation L07\nSextant\n- Basic instrument for measuring altitude or elevation\nangle to celestial bodies.\n- Schematic of sextant:\nhttp://www.tecepe.com.br/nav/inav_c12.htm\nSmall mirror is\nhalf a mirror so\nthat direct ray and\nreflected rays are\nboth visible.\n\n10/17/2006\n12.215 Modern Naviation L07\nStudent Sextant\nThis is the sextant\nwe will be using for\nmaking\nmeasurements.\nScales are read\nthrough a\ncombination of a\nmicrometer wheel\nand a vernier.\n\n10/17/2006\n12.215 Modern Naviation L07\nScale reading\nReading on sextant is\n45 deg 13.6 minutes\n45 degs (main scale)\n13' (micrometer)\n0.6' (venier)\n\n10/17/2006\n12.215 Modern Naviation L07\nScales\n- Micrometer scale is a method a turning rotation in to\nsmall displacements (basically a screw drive). One\nfull turns moves scale a set amount. The amount of\nthe turn (angle between 0-360deg) can then be used\nto interpolate between graduations\n- Vernier scales provide another method of interpolating\nbetween graduations.\n- Example JAVA program:\nhttp://www.phy.ntnu.edu.tw/java/ruler/vernier.html\n\n10/17/2006\n12.215 Modern Naviation L07\nVernier scales\n- The idea of a vernier scale is to make a scale that has\nN markings in the same distance as N-1 markings on\nthe original scale. The fractional difference between\nthe scales sets the scale that the vernier reads:\nFrom http://www.tpub.com/math1/7e.htm\nSo if N=10, then 10\ngraduations on the\nvernier take up 9\nmarkings on the\noriginal (see note)\nImage removed for\ncopyright concerns.\n\n10/17/2006\n12.215 Modern Naviation L07\nCorrections needed for sextant\nmeasurements\n- Basic sextant measurement is to measure the elevation angle of\nthe sun at its highest elevation and to note the time this occurs.\n- Generally, this is done as series of measurements across the\ntransit of the sun and the highest point is interpolated.\n- Corrections that need to be applied:\n- Atmospheric refraction (already covered)\n- Index error in sextant (does not read zero when direct and\nreflected signal are parallel\n- Sun's diameter if measurement made to lower limb on horizon\n(diameter is about 16')\n- Height of eye correction if horizon used and standing above\nlevel of sea: Correction is ~0.3' per foot of height\n\n10/17/2006\n12.215 Modern Naviation L07\nSummary and Next class\n- Today we covered:\n- Dead reckoning and use of magnetic field direction\n- Currents and magnetic variations need to be\naccounted for\n- Sextants\n- Basic principles of the sextant and its scales\n- Corrections that need to be applied\n- Next class: weather permitting we will make sextant\nmeasurements."
    }
  ]
}