{
  "course_name": "Modern Drama",
  "course_description": "This course analyzes major modern plays featuring works by Shaw, Pirandello, Beckett, Brecht, Williams, Soyinka, Hwang, Churchill, Wilson, Frayn, Stoppard, Deveare Smith, and Kushner. The class particularly considers performance, sociopolitical and aesthetic contexts, and the role of theater in the world of modern multimedia.",
  "topics": [
    "Fine Arts",
    "Media Studies",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Drama",
    "Fine Arts",
    "Media Studies",
    "Performance Arts",
    "Theater",
    "Humanities",
    "Literature",
    "Drama"
  ],
  "syllabus_content": "Moving from drawing-room comedy to absurdism, from political protest to the theater of science, we will sample a wide range of the fascinating drama that has been composed during the past century. Many of these plays are now acknowledged \"classics\" of modern drama; the rest are prize-winning contemporary plays that have broken new ground. We will study them both as distinguished writing and as scripts for performance. During the first century of film, television, and computers, it seems that writers for the theater have been especially attuned to the relationships between past and present and to the changing role of their medium. Paying particular attention to the importance of nationalism, group categorization, and science in shaping modern life, much of their drama suggests that current events are inseparable from a larger cultural history. Several of these plays have been reconceived for the big or small screen. Within this multimedia and socio-historical context, we will consider what drama in particular has to offer now and in the future: this subject is therefore cross-listed by Literature and Comparative Media Studies, and can help satisfy the theater history requirement for the Theater Arts major.\n\nThis is also a HASS Communication-Intensive Course, in which we will work on improving your skills, awareness, and confidence as a writer and speaker. Knowing without sharing is insufficient. A variety of writing opportunities (including revision of the first essay), class reports, and performance work will aid us in realizing these goals.\n\nCourse Meeting Times\n\nLectures: 2 sessions / week\n\n1.5 hours / session\n\nSchedule\n\nSES #\n\nTOPICS\n\nIntroduction and Overview\n\nShaw's\nPygmalion\nand the Drama of Language\n\nPygmalion\nfrom Page to Screen\n\nPygmalion\n,\nMy Fair Lady\n, and the Musical Drama\n\nPirandello's\nHenry IV\nand Psychological Relativity\n\nBrecht,\nMother Courage and Her Children\n\nBrechtian Politics and Dramaturgy, continued\n\nBeckett,\nHappy Days\n\nBeckett, Pinter, and Domestic Absurdism\n\nWilliams,\nA Streetcar Named Desire\n\nStreetcar\n, Poetic Realism, and the Method\n\nHwang,\nM. Butterfly\n\nWilson,\nThe Piano Lesson\n\nWilliams, Hwang, Wilson: American Dreams\n\nSoyinka,\nKongi's Harvest\n\nSmith,\nTwilight: Los Angeles, 1992\n\nTwilight\nReflections, and Kushner,\nAngels in America, Part 1\n\nKushner,\nAngels in America, Parts 1 and 2\n\nAngels\nReflections\n\nFrayn,\nCopenhagen, Streetcar\n\nStoppard,\nHapgood\n\nStoppard\n\nChurchill,\nA Number\n\nConclusions\n\nThe Film Office usually can provide copies of the films we screen, and you will want to avail yourself of this resource should you decide to write on a particular screen version. If you will not be able to attend a scheduled evening screening, however, please let me know well in advance, so that we can use the office staff's time appropriately.\n\nRequirements\n\nYou should come to class ready and eager to discuss the assigned play. That means having read it (at least once), thought about it, and taken sufficient care of yourself to be alert in mind and body.\n\nEach person will take a leadership role in teaching one play. This will involve generating a list of questions and possibly other helpful handouts or presentation materials; initiating the discussion; and being prepared to provide some context and answer informational questions from your colleagues. You may think of creative, exciting ways to convey key insights and aspects of the play: you may want to consult with me in advance. I will guarantee you 20-30 minutes of the class time, after which I may lead the class in directions not yet addressed (if that seems helpful). Each person will also read an \"outside play\" from the appended list, and give a short oral presentation to the class based on that reading and accompanying research (15 minutes maximum): in addition to allowing each one of you to become the class expert on one play, this will familiarize the group with more modern drama than we could (reasonably) manage to read collectively. I ask that you turn in to me your written materials (report outline, discussion questions, supporting materials, bibliography) after your oral presentations. Everyone will write two short (5-7 pp.) essays, the first focusing on close scene analysis, the second on the topic most compelling to you. Revision of one of the two assignments above is required; revision of both, optional.\nTurn in your original drafts along with revisions\n. [Original grade and revision grade will be averaged to replace the original grade.]\n\nIn addition, you will choose between two options: (A) write two more short (5-7 pp.) essays, most likely drawing upon the material in each of your two oral presentations, or (B) write one longer (10-12 pp.) essay, which might well draw on that research as well, in a focused, comparative format. If you intend to count this class as a seminar for purposes of the Literature concentration, minor, or major, I will ask that you choose option (B). If you would like to write an essay eligible for the Kelly Writing Prize, I suggest you aim for 15 pages instead of 10-12. I am receptive to multimedia essays, or other topic ideas you may have for your later writing assignments.\n\nApproximate Valuation for Grading Purposes\n\nACTIVITIES\n\nPERCENTAGES\n\nEssay 1\n\n10%\n\nEssay 2\n\n15%\n\nEssay 3 or 3/4\n\n25%\n\nOutside Play Presentation\n\n10%\n\nClass Leadership\n\n10%\n\nClass Participation throughout the Semester (including attendance, viewings, quality of personal contributions and thoughtful exchange of ideas with others)\n\n30%\n\nI reserve the right to alter this weighting somewhat in exceptional circumstances; often this works to your advantage.\n\nThis is a twelve-unit subject, which assumes that you will allot nine hours/week outside the classroom for reading, writing, rehearsing, and thinking deep thoughts about twentieth-century drama.\n\nPlease Note: Written work must be submitted by the due date. Except in cases of personal emergency, late work will not receive written response and will receive a lower grade. Unless you receive an individual extension for special reasons or petition to receive a grade of Incomplete in the course, no work can be accepted after the end of the semester.\n\nI hope that the following statement is unnecessary:\nconscious plagiarism of any sort is completely unacceptable\n. Discussion of ideas and communal learning is a primary goal of this subject; stealing others' ideas or words, (as distinct from citing or adapting them openly and honestly) undermines this goal. Please consult my stylesheet (\nPDF\n) and talk with me if you have any doubts whatsoever about proper citation of sources or about standards of intellectual honesty.\nAny act of plagiarism will be grounds for failure of this subject\n. The following is the Literature Section's official policy statement:\n\nPlagiarism-use of another's intellectual work without acknowledgement-is a serious offense. It is the policy of the Literature Faculty that students who plagiarize will receive an F in the subject, and that the instructor will forward the case to the Committee on Discipline. Full acknowledgement for all information obtained from sources outside the classroom must be clearly stated in all written work submitted. All ideas, arguments, and direct phrasings taken from someone else's work must be identified and properly footnoted. Quotations from other sources must be clearly marked as distinct from the student's own work. For further guidance on the proper forms of attribution consult the style guides available in the Writing and Communication Center in Stata and the\nMIT Web Site on Plagiarism\n.\n\nIn addition to welcoming your participation in class, I encourage you to discuss your ideas and your writing with me during office hours, or at other times convenient for us both. I hope to meet with each of you individually during the first half of the semester.",
  "files": [
    {
      "category": "Resource",
      "title": "anonymous_paper.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-486-modern-drama-spring-2006/2baf6a68ab80122bf36f57851b039672_anonymous_paper.pdf",
      "content": "Violent and Isolating Potentials of Familial Relationships\nin Beckett's Happy Days and Churchill's A Number\n\nIn Happy Days and A Number, both Samuel Beckett and Caryl Churchill centrally\nincorporate images of shocking human violence, with disturbing implications of a\npotentially dangerous human nature. However, this violence is notably absent from\ndirect view on stage, being continually mediated by memory or verbal retelling and\nrepeatedly obstructed by blocked views or uncompleted actions. The events that\naudiences do directly experience are stark and limited in nature: Beckett and Churchill\nhave stripped the action of these plays down to the bare essentials, with few characters,\nrestricted movement on stage, and generally simple, unadorned conversation. The\nhaunting presence of violence becomes a shadow that persistently darkens the putatively\ntraditional family relationships that tie together the characters of both plays, continually\ninjuring and isolating them. Parent-child and husband-wife affections intertwine with\nimages of murder, suicide, and abandonment, creating frightening representations of the\nfailures of human love that play into the generally restricted sense of identity, existence,\nand meaning that pervade both plays.\n\nThe use of violence in Happy Days and A Number is sometimes conspicuous, and\nsometimes understated. In Happy Days, the visible presence of a revolver on stage\npresents a constant reminder of possibilities of suicide and even spousal murder.\nHowever, the revolver is never used, and the violence remains a potential rather than a\nfact. The gun's noticeability might rely more on any particular staging than on the text.\n\nIn A Number, Churchill weaves in horrific stories of murder, suicide, and parental\nneglect. Yet on stage, we see only a series of simple conversations, and the bloody\nevents become back-stories rather than performed actions. Beckett does occasionally use\nforms of violence as at least partially visible spectacle in Happy Days, such as when\nWinnie breaks a glass bottle over Willie's head, when she \"strikes down at him\" with the\nbeak of her parasol, or when that parasol catches suddenly and magnificently on fire (12).\nHowever, when Winnie \"strikes\" at Willie, he is hidden from view, so that the audience\ncannot see whether she makes contact. The crash of the bottle is similarly unseen, though\nwe do witness the subsequent blood that trickles down Willie's bald head. The burning\nparasol, though spectacularly visible and potentially dangerous, never does either\ncharacter any harm. Similarly, the horrifying intensity of B1's murder of B2 might be\nconsidered a sort of spectacle in A Number, but in addition to mediating the story of the\nkilling via B1's retelling, Churchill also deprives her audience of all the grisly details, as\nB1 refuses to explain how or where the death occurred. Gruesome possibilities are\ncentral to the plot of both Happy Days and A Number, but they are also continually\nobscured.\n\nIndeed, characters in both plays disregard such violence with a noted\nnonchalance. Willie and Winnie never react to her breaking a bottle over his head, as\nthough it were a commonplace occurrence. Winnie's revolver is thrown right in with her\nbag of toiletries, as though the comfort it provides her is equivalent to the reassurance she\nderives from being able to regularly brush her teeth and fix her hair. Salter is unable to\nrecall much of his neglect of B1, and he even compares those two years to \"one long\nnight out,\" as though such child abuse were equivalent in value to any forgotten evening\n\nat a bar (52). Similarly, Salter hardly reacts to the murder of B2, saying that \"it wasn't so\nbad as you'd think because it seemed fair. I was back with the first one\" (61). This kind\nof reaction in both plays is surreal, and although both the harmful events and the\nsubsequent indifference are more exaggerated in A Number, both Beckett and Churchill\nexhibit a kind of casual expectation of destructive human actions that carries disturbing\nimplications about their potential normality to human nature.\n\nIndeed, hurtful human responses pervade Happy Days and A Number on a variety\nof less readily apparent levels as well. The more prominent forms of violence in both\nplays might be emotional rather than physical. Beckett and Churchill continually\nhighlight an extensive fear of human abandonment in their characters that might typify\nthe mode of emotional violence that the characters dread most. Both B1 and Salter\nrepeatedly remind the audience of the horrifying image of B1 abandoned and cowering\nunder a bed, screaming for his father alone. Feelings of guilt, helplessness, and disgust\nattached to such scenes prompt Salter to eventually give up B1 altogether, while the\nremaining traumatic memory of such moments partly motivates B1's jealous murder of\nB2, and likely his suicide as well. As an adult, B1 still grills his father to determine\nwhether he was present for those moments under the bed, saying,\nI want to know if you could hear me or not because I never knew\nwere you hearing me and not coming or could you not hear me and\nif I shouted loud enough you'd come... or maybe there was no one\nthere at all and you'd gone out so no matter how hard I shouted\nthere would be no one there.\" (32)\n\nSimilarly terrified of being left alone, Winnie expresses a strikingly parallel desire to be\nheard and responded to:\nIf only I could bear to be alone, I mean prattle away with not a soul\nto hear. (Pause.) Not that I flatter myself you hear much, no\n\nWillie, God forbid. (Pause.) Days perhaps when you hear\nnothing. (Pause.) But days too when you answer. (Pause.) So\nthat I may say at all times, even when you do not answer and\nperhaps hear nothing, Something of this is being heard, I am not\nmerely talking to myself, that is in the wilderness, a thing I could\nnever bear to do - for any length of time. (Pause.) That is what\nenables me to go on, go on talking that is. (Pause.) Whereas if\nyou were to die... or go away and leave me, then what would I do,\nwhat could I do? (21)\n\nLike B1, Winnie is not only terrified of being alone, but is particularly afraid of speaking\nunheard, without the possibility of any response. The fear is central, and both characters\ncontinually draw the audience's attention to these possibilities of unobserved\nabandonment. In act two, B1 asks Salter eight different times whether he might have\nheard the shouting, or whether he would have heard, had the yells been louder. Similarly,\nWinnie repeatedly tests whether Willie can hear her at various volumes, constantly\ndesiring his reassurance that he can in fact listen to her:\nWinnie: I beseech you, Willie, just yes or no, can you hear me, just yes or\nnothing.\n\nPause.\nWillie: Yes.\nWinnie: (turning front, same voice). And now?\nWillie: (irritated). Yes.\nWinnie: (less loud). And now?\nWillie: (more irritated). Yes. (26)\n\nThe way that Winnie thus demands Willie's response despite his obvious irritation is\nemblematic of the intensity of her need for his presence, observation, and\nacknowledgment. Both Winnie and B1 fear unnoticed abandonment above all else.\n\nIn A Number, the conspicuous absence of Salter's wife and the Bernards' mother\nfurther extends the consequences of this kind of abandonment. As though to underscore\nthe violence of her demise, this mother's death is repeatedly rehashed, first as a death in\nchildbirth, then in a car accident, and finally, most violently, as a suicide flattened under\n\na train. B1 associates her absence with the same kind of neglectful abandonment as\nSalter's abusive parenting when he says that \"I remember her sitting there, she was\nthere... she'd be there but she wouldn't help stop anything\" (32). Both dead and alive,\nthis mother apparently ignores B1's shouts. Moreover, considering that she took her own\nlife, her death does not absolve her from responsibility for B1's subsequent abuse and\nabandonment. A Number thus paints an eminently disturbing picture of family life,\nimbued with repeated suicide and neglect as well as fratricide and indifference.\n\nThe negative implications regarding family life in Happy Days are more subtle,\nbut in many ways they are similarly negative. Like Salter's wife, Winnie too considers\nkilling herself, and her primary discontent might be her husband Willie's irritated\ndisconnection from her. Indeed, just as Willie generally ignores Winnie, so did Salter\napparently take little notice of his wife's troubles: when she killed herself, as he says, \"I\nwas still with her more or less but not with her then no I was having a drink I think\" (41).\nHe cannot even remember precisely where he was. Winnie's partial entombment and\nWillie's apparent inability to move otherwise than on all fours could be viewed as\nsymbolic of the limitations that people impose on each other, in marriage and otherwise,\nas though such marital relationships serve to isolate people rather than to provide\ncompanionship. In any case, the entrapment created by both situations only adds to the\nway that Willie and Winnie are cut off from each other, creating a sort of violent absence\nthat both experience for the other. Though Willie can move, he apparently cannot move\nso well as to be able to climb Winnie's mound and make any physical contact with her.\nRegardless of whether he attempts to climb the hill to shoot her and end her irritating\ntwaddle, or whether he seeks to embrace and kiss her, Willie is apparently irrevocably cut\n\noff from his wife, just as Salter eventually becomes permanently separated from his wife\nas well as both Bernards.\n\nThe violence of this kind of separation might be exemplified by Winnie's\nfrightening description of Mildred's ordeal where she encounters a mouse alone, cut off\nfrom human defenses. Mildred's identity is not clear: she might be a relation, an\nacquaintance, or even a fictional character, and the nature of Mildred's experience might\nseem silly or unimportant, viewed as a mere accidental meeting with a mouse. However,\nWinnie's telling makes the story terrifying:\nSuddenly a mouse ran up her little thigh and Mildred, dropping\nDolly in her fright, began to scream - (WINNIE gives a sudden\npiercing scream) - and screamed and screamed - (WINNIE\nscreams twice) - screamed and screamed and screamed and\nscreamed till all came running, in their night attire, papa, mamma,\nBibby and... old Annie, to see what was the matter... (pause)...\nwhat on earth could possibly be the matter. (Pause.) Too late.\n(Pause.) Too late. (59)\n\nThe real horror here might be not the encounter with the mouse so much as that Mildred's\nparents don't arrive in time. What happens precisely is unclear, but Winnie makes it\nclear that the screams are real by emulating them herself, and the image of Mildred\ncrying alone recalls A Number's numerous descriptions of B1's unnoticed shouting. As\nWinnie notes earlier, the event even takes place under a table, much like B1 hides under a\nbed (55). When Michael Black describes his imagined people living in excavated\ncaverns underground, he fully unites these views of destruction and isolation. In this\nvision, human separation literally kills, as Michael describes that \"sometimes they walled\npeople up alive in there, it's possible because of how the remains were contorted\" (57).\nWhen these buried individuals scream for their lives, they are utterly and irrevocably\nalone, more so than Winnie, Mildred, or B1 ever are. Moreover, the attached sense of\n\nentrapment ties not only to Winnie's partial burial, but also to the feelings of\npowerlessness experienced by Winnie as well as B1, B2, and Mildred.\n\nThese persistent trends of obscured violence and familial neglect and isolation are\nconnected in the sense that both radically rupture the traditional family structures and\nassociated personal identities that might otherwise comprise the characters of Happy\nDays and A Number. The husband-wife relationships of both plays are divided by the\nabsence of one or both figures. Winnie is generally unable to see or communicate with\nWillie, and their interactions are often aggressively forceful, involving guns and broken\nbottles. Salter neglects his wife, who is then separated from him irrevocably by death.\nWinnie's fear in the second act that Willie might be dead underscores a sense on her part\nof the total disconnection and isolation that this would involve. Parent-child relationships\nbecome similarly ruptured in both plays, as the audience repeatedly receives descriptions\nof B1 and Mildred screaming for their parents without response or aid. Moreover,\nconventional notions of family roles are further disturbed by Willie and Winnie's\napparent physically disconnected childlessness as well as by Salter's abusive single-\nfatherhood.\n\nFurthermore, both Happy Days and A Number involve a broad sense of human\nlimitation and disorganization that is related to this violence, isolation, and traditional\nfamily rupture. The simplicity of staging, plot, and cast of both plays serves to\nemphasize human characterization, among other elements. Such an aim for simplicity\nmight explain both plays' avoidance of overt violent spectacle. However, the sense of\nconsciousness that results in both plays is highly disorganized, with characters repeatedly\nunable to communicate with each other, remember past events, or speak without losing\n\ntheir trails of thought. Here the plays do differ in their implications. In Happy Days,\nWinnie's mental disorganization likely results partly from her lonely spousal\ndisconnection from Willie as well as other human contact, and partly from her physical\nentrapment and isolation, but it also relates to her simple advancing age. In A Number,\nSalter, B1, and B2's confusion and occasional desperation relate to the extensive personal\nviolence and familial trauma they have experienced, but they also relate to broader\nquestions of personal and physical identity that the play addresses on levels beyond\nfamily and personal relationships, involving larger societies and genetic makeups as well.\nThe violence and disorganization of family, memory, and personality in Happy Days\nmight address the status of human meaning, while A Number focuses more on the status\nof identity. Watching A Number, the audience might be led down paths involving\ncloning and human individuality. Seeing Happy Days, one might be more inclined to\nrespond like Mr. Shower (or Cooker): \"What does it mean? he says - What's it meant to\nmean?\" (43). However, both questions, involving individuality and commonality,\nmeaning and rupture, relate to the violent implications and undertones of both plays. The\nisolation examined by Beckett and Churchill has weighty ramifications for all of human\nexistence, whether viewed through lenses of identity or value, whether it comprises B1's\nviolence or another of Winnie's happy days.\n\nBeckett, Samuel. Happy Days. New York: Grove Press, 1989.\nChurchill, Caryl. A Number. New York: Theatre Communications Group, 2002."
    },
    {
      "category": "Resource",
      "title": "david_roe.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-486-modern-drama-spring-2006/6ff34a765f70e3abacf29953a9329420_david_roe.pdf",
      "content": "Roe 1\nDavid Roe\nDiana Henderson\n21L.486\n3/7/06\nThe Search for Meaning\n\n\"The funeral procession is just starting out\" (Brecht 73), notes the Chaplain. In the\nbackground of scene six of Mother Courage, the commander Tilly is laid to rest. Traditionally,\nfunerals have been used not only to honor and commemorate the dead, but also to console the\nliving; they employ religion to offer the mollifying message that life, and death, really does have\nmeaning. A sequence of objects and events follow the funeral procession; some seem to have\nmeaning of some sort while others do not. These items and actions serve to create a partial link\nfrom the material world to a realm of ideas and emotion. In the midst of these objects the specter\nof the war looms, made physical by the language of the characters. The war provides a link in\nthe opposite direction, showing how the immaterial can affect the physical. Against this\nframework, Mother Courage struggles to come to terms with the tragedies in her own life. The\nnature of the duality between the physical world and the space of ideas suggests an answer: there\nis no underlying meaning behind Swiss Cheese's death, Eilif's abandonment, and Kattrin's\nmuteness.\n\nSome of the objects in this scene have powerful emotional meaning for the characters.\nThe cook's pipe and the red boots figure most prominently among these. To the Chaplain, the\nsight of Mother Courage smoking the cook's pipe signals that he will not win her over into\nhaving a relationship. The pipe seems to spark violence. When the Chaplain decides that\nMother Courage was aware of the pipe's history, \"he brings the axe down on the block with a\ncrash\" (Brecht 78). The pipe itself shows evidence of violence: as the Chaplain argues with\nMother Courage about the cook's character he notes that \"it's bitten halfway through! He's a\n\nRoe 2\nman of great violence! It is the pipe of a man of great violence, you can see that if you've any\njudgment left! (He deals the block a tremendous blow)\" (78-79). The pipe is not just a thing; it is\ninstead the object of their argument and comes to represent violence, the Chaplain's jealousy and\na source of information about character: \"it tells all\" (78). In addition to this implicit meaning,\nthe hypocrisy of the simultaneity of the Chaplain's diatribe against the cook's violence with his\nvigorous wood chopping serves to associate a sense of contradiction to the pipe. This\ncontradiction carries through to the meaning associated to the pipe. Yvette's red boots also have\na meaning beyond their mere existence. In scene three, when Kattrin donned them and imitated\nYvette's walk (47-50), the boots represented sensuality and adulthood. But in scene six, after\nKattrin is wounded, the boots' meaning shifts. Mother Courage offers the boots in remorse for\nKattirn's wound: \"now, I've got something for you, rest easy. I've been keeping them secret.\n(She digs YVETTE's red boots out of a bag.) Well, what do you see? You always wanted them.\nNow you have them. (She helps her to put the boots on.) Put them on quick, before I change my\nmind\" (80). One might argue that Mother Courage gives Kattrin the boots merely to comfort her:\nthe boots have no other significance. Yet the fact that Mother Courage has second thoughts\nabout giving Kattrin the boots demonstrates that they have more significance than just an item of\ncomfort. The previous connotations of the boots also support the claim that Mother Courage's\ngift of them endows them with significance: Kattrin's wound has purportedly taken away all\nchance of future sexuality. The boots represent Mother Courage's effort to make good Kattrin's\nloss. Like the pipe, the boots also work in multiple directions: Mother Courage urges Yvette to\n\"put them on quick, before I change my mind\" (80). Just as the pipe does, the boots suggest a\nstruggle. Both the pipe and the boots set up a link between the material world and the realm of\n\nRoe 3\nemotions and ideas. They carry meaning in themselves in addition to existing physically on the\nstage.\n\nIn contrast, many of the other objects that appear in the scene do not possess the same\nsignificance as the pipe and boots. One class of such objects is the items Mother Courage lists in\nthe inventory she performs at the beginning of the scene. As she converses with the Chaplain\nand Clerk, every so often she interjects with an item from the inventory: beginning with \"pity\nabout the Chief--twenty-two pairs of socks--getting killed that way\" (Brecht 73) and \"the\nChief... ran smack into a bullet in the thick of battle--only four lanterns left\" (73), continuing\nwith \"the poor Commander won't be hearing any bells when they lower him into his grave.\nInstead, they'll fire off three shots so the occasion won't be too sober--sixteen leather belts\" (74)\nand \"the conquest of the world now, that's a goal for a Commander, he wouldn't know any\nbetter.... Lord, worms have got into the biscuits\" (74), and finishing with \"... Seventeen leather\nbelts.... Then you don't think the war might end?\" (75). None of these goods are unique: all are\neither mentioned in a specific amount or in the plural. This lack of uniqueness doesn't preclude\nthe presence of a meaning for the object, but it does make it less likely. A unique object, such as\na pipe, is more likely to have characteristics that give it meaning than a nondescript object of\nwhich there are a dozen copies. The casualness with which Mother Courage refers to these items\nalso contributes to this impression: she breaks into her own sentences, mentions the items, and\nreturns to her previous thought. They seem to make no impression on her. Yes, she cares about\nhaving the inventory done so that she can run her business better, but the items themselves hold\nno importance, certainly not in comparison to the pipe and the boots. Also note that the text\nsurrounding these interjections focuses exclusively on war and death, even more explicitly than\n\nRoe 4\nnormal for the rest of the play.1 Perhaps this coincidence results from Brecht's efforts to turn the\naudience away from sympathy at these points. Yet it also has the effect of associating death with\nthe physical objects most lacking in meaning. This linkage will become important later in this\nessay.\n\nIn the other direction, the scene takes a few abstract concepts, notably war, and endows\nthem with physical existence. The Chaplain says:\nYou can't be sure the war will ever end. Of course it may have to pause\noccasionally--for breath, as it were--it can even meet with an accident--\nnothing on this earth is perfect--a war of which we could say it left\nnothing to be desired will probably never exist. A war can come to a\nsudden halt--from unforeseen causes--you can't think of everything--a\nlittle oversight, and the war's in the hole, and someone's got to pull it out\nagain! The someone is the Emperor or the King or the Pope. They're\nsuch friends in need, the war has really nothing to worry about, it can look\nforward to a prosperous future. (Brecht 75)\n\nThroughout this description the Chaplain refers to the war as if it were a person. The war\nbreathes and must occasionally rest. A careless mistake could halt the war. The Chaplain even\nironically describes the war suffering the same type of accident that often occurs to participants\nin a war. But neither of these events can actually end a war, because the war has powerful\nfriends who will help restart it if it falters. Unlike so many of the people that it affects, the war\n\"can look forward to a prosperous future\" (75). The Chaplain even claims that \"the war has your\noffspring and can carry on\" (76). The Chaplain's description gives the war a body. And the war\ncertainly has effects on the physical world: the commander's death and indeed the rest of the\nevents of the scene are direct consequences of thirteen years of war.\n\nOther aspects of the immaterial world reach out to the physical as well. Religion and its\nconflicts manifest themselves in a number of ways. Mother Courage heard that \"they wanted to\nring the bells for his funeral, which is natural, but it came out that the churches had been shot up\n\n1 This observation is due to Jocelyn Rodal.\n\nRoe 5\nby his orders, so the poor Commander won't be hearing any bells when they lower him in his\ngrave\" (Brecht 73-74). Of course, he wouldn't hear the bells anyway, but Mother Courage and\nthe Chaplain and Clerk would have. Mother Courage proceeds to note that \"there was unrest in\nthe Second Regiment because he didn't pay 'em. He said it was a war of religion and they must\nfight it free of charge\" (74). Religion and its conflicts affect the world just as the war itself does.\n\nThis scene thus sets up a framework of linkages from the material world to the\nimmaterial, and back. The war wreaks havoc upon the world, causing death and chaos. The\nbeginning of the scene associates these effects with objects that have no significance or meaning\ndeeper than mere existence.\n\nAt the end of the scene, Mother Courage laments all the tragedies the war has caused her:\nIt's a historic moment to me when they hit my daughter over the eye.\nShe's all but finished now, she'll never get a husband, and she's so mad\nabout children! Even her dumbness comes from the war. A soldier stuck\nsomething in her mouth when she was little. I'll never see Swiss Cheese\nagain, and where my Eilif is the Good Lord knows. Curse the war!\n(Brecht 81)\n\nThough her external impulse is to rage at the cause of Swiss Cheese's death, Eilif's absence and\nKattrin's mutilation, she must also wonder why. What meaning can this horror have? What\nsignificance? Certainly, the play pushes the audience to ask these questions of themselves.\nWhat is the import of casualties in war, of collateral damage? The linkage of the material and\nimmaterial worlds set up in this scene provides a possible answer. Just as the items associated to\ndeath and the effects of war have no deeper meaning, Mother Courage's tragedies have no\ndeeper explanation than that they happened. There was no reason for Swiss Cheese to die, or for\nKattrin to have been made mute by rape. These events just happened.\n\nSenseless death and violence is not a pleasant experience, either for Mother Courage or\nfor the audience. Yet it is a reality in Mother Courage's devastated Holy Roman Empire, in\n\nRoe 6\nBrecht's ravaged Europe, and today as well. Off stage though, we do not have a convenient\nscript that gives meaning to certain objects in our play. We have to create meaning ourselves\nbefore death snatches away the chance."
    },
    {
      "category": "Resource",
      "title": "jessica_lam.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-486-modern-drama-spring-2006/74bda4fa8f3c2bd04f6538ce4e032f08_jessica_lam.pdf",
      "content": "Lam 1\nJessica Lam\n21L.486 Modern Drama\nDr. Henderson\nConsequences of Anglicizing Gaelic Names\nIn Translations, the act of Anglicizing the regions in Ireland, by supplanting their\nGaelic names with English labels, has both damaging and beneficial consequences on the\nIrish locals. More formally known as the British Army Ordinance Survey Operation, this\nact forms a social hierarchy that places the British Army at the top the Irish Catholic\nlocals at the bottom. The Ordinance also supplants Irish culture that is rooted in both the\nlocals and the original Gaelic names of the regions, despite efforts by the locals to\npreserve this culture. Furthermore, Yolland and Owen, the characters who directly create\nthe English labels, struggle with their own identities as they perform this operation.\nHowever, this operation also symbolizes opportunity to the locals. Yet this benefit is\nsmall compared to the overall negative effects of this operation. Thus, the results and\nthemes from supplanting the Gaelic names of locations in Ireland with English labels are\nmainly detrimental to Irish culture and identity.\nIn the beginning of the play, we already see British Army, agents of this\nordinance, imposing political dominance and discrimination against the locals. Lancy\nreads from the British charter, \"'Ireland is privileged. No such survey is being\nundertaken in England. So this survey cannot be but received as proof of the disposition\nfor this government to advance the interests of Ireland.' My sentiments, too\" (1.1.31).\nAccording to Lancy and the British charter, the ordinance is beneficial to Ireland by\nhelping it undergo modern progress. The charter suggests that Ireland is better off than\nEngland because England does not have this survey. However, England does not need\nthis operation because its entire nation is already Anglican and modernized!\nFurthermore, charter has an arrogant tone implying that the British sees themselves as\nsuperior, and thus, in order \"to advance the interests of Ireland,\" it must replace the Irish\nlanguage and culture with its own.\nThis image of the British as superior than the Irish creates a social hierarchy,\nsupported by the power of the organized British military over the unarmed, dispersed\nlocals. The hierarchy consists of the British Army, such as Lancy, Yolland, and Owen, at\nthe top and the rest of the locals at the bottom. Recognizing this social structure, Owen is\npartial to speaking English and affiliating with the British Army in the beginning of the\nplay. He repeatedly requests that Manus to speak English throughout the play. For\nexample, when Yolland speaks to Manus in English and Manus replies back in Irish,\nOwen asks Manus, \"Can't you speak English before your man?\" (2.1.36) Owen tells\nManus to \"speak English\" so that Yolland can understand him. However, Owen also\naddresses Yolland as Manus's \"man,\" suggesting that Yolland is higher up on the social\nstructure than Manus, and thus Manus should respect him.\nThe social hierarchy also allows the British to discriminate against the locals.\nLancy tells the locals that the British plans to make a map of Ireland, saying, \"A map is a\nrepresentation on paper--a picture--you understand picture?--a paper picture--\nshowing, representing this country--yes?--showing your country in miniature--a scaled\ndrawing on paper\" (1.1.30). Because the locals do not understand English, they do not\nknow what Lancy is saying. Lancy speaks to them slowly and loudly, suggesting that the\nlocals appear to him inferior and dim-witted. Lancy's tactic clearly shows that he is\n\nLam 2\nmocking the local's inability to speak English, ignoring the fact that he is in a Gaelic\nspeaking country but cannot speak Gaelic himself.\nIn addition to creating a social hierarchy and discrimination, the ordinance also\nuproots the Irish culture and traditions. For example, Owen and Yolland supplant\n\"Druim Dubh,\" meaning the \"south end\" containing a \"ridge of rocks,\" to Drimduff\n(2.1.36). Similarly, \"Bun na hAbhann,\" meaning \"soggy, rocky, sandy ground where that\nlittle stream enters the sea...\" becomes Burnfoot (2.1.35). These examples show that the\nGaelic names contain historical significance, whereas the new names (Drimduff and\nBurnfoot) are trivial. Moreover, the English labels sound comical, which devalues and\nmocks the historical significance behind the Gaelic names of these regions.\nDespite this cultural loss, most of the locals attempt to preserve their Gaelic\nheritage all throughout the play. From the first to the last scene, Jimmy continually =\nrecites phrases from the classics in Greek and Latin. Similarly, Bridget and Doalty are\nhorrified at the new National Education System, which makes all students learn and\nspeak English in the public school classrooms. When Marie encourages Doalty to apply\nto the new national school, Bridget explains to Doalty:\n...[E]verything's free in [these national schools]...from the very first day you go,\nyou'll not hear one word of Irish spoken. You'll be taught to speak English and\nevery subject will be taught through English and everyone'll end up as cute as the\nBuncrana people. (1.1.22)\nBecause the education is free in these schools, with the exception of textbooks, this\nincentive may seem enticing to a student like Bridget, who currently has to pay to be\neducated in Hugh's hedge school. Yet she is pessimistic about the idea of replacing her\nGaelic dialect with the English language. Bridget mocks the \"Buncrana people,\" another\ncommunity of Irish peasants in Donegal, Ireland who had adapted to the English\nlanguage. Thus, Bridget values preserving her Gaelic heritage over a free education and\ndiscourages those, such as Doalty, who may be attracted to the national school.\nSimilarly, Manus understands English but refuses to speak in it. As seen in the\nexample above when Owen tells him to speak English, Manus upholds his disapproval of\nconverting to the English language, responding to Yolland, one of the agents of\nAnglicizing the Gaelic names, in Irish even though he knows that Yolland cannot\nunderstand him.\nManus also expresses his distaste for the English language by refusing to teach at\nthe new local national school. Because this is one of only chances of securing a\nsufficient salary for Marie to marry him, taking on this job may at first seen attractive.\nHowever, Manus argues that his \"father has already applied for it\" and doesn't want to\ntake away Hugh's job offer (1.1.21). Yet, his tone of voice seems more apathetic than\ndisappointed, and we can speculate that another motive may be because he does not want\nto encourage others to forget how to speak Irish, eventually losing a large part of their\nGaelic heritage, by learning only English. Furthermore, Manus later accepts a job at a\nhedge school for a smaller salary than that given by the national school. His tone now\nappears enthusiastic, exclaiming to Owen, \"I've got good news!\" and even speaks in\nEnglish so that Yolland can understand him (2.1.46). Thus, like Bridget, Manus chooses\nto maintain his Irish heritage over helping to Anglicize it and marry Marie.\nLike Bridget and Manus, most of the locals do not act submissive to the British,\ndespite the British political dominance and discrimination. In the examples above,\n\nLam 3\nMarcus generally refuses to speak to Yolland in English and does not view or treat him as\na superior. Another example is when Bridget and Doalty start snickering at Lancy when\nhe tells them about the map, saying, \"A map is a representation on paper--a picture--you\nunderstand picture?--a paper picture...\" (1.1.30). Although they do not understand what\nhe is saying, they laugh at Lancy's awkward speech and do no show any respect for him.\nFinally, when Yolland and Owen discuss possible English labels for ordinance, Yolland\ntells Owen, \"I was passing a little girl yesterday and she spat at me\" (2.1.37). The fact\nthat even a small child attempts to resist the British supports the argument that the locals\nare disgusted at with the British Army's presence and dominance over their language and\nculture. This hatred and resistance persists through the end of the play, when Doalty tells\nOwen, \"I've damned little to defend [ourselves against the British Army] but [Lancy'll]\nnot put me out without a fight. And there'll be others who think the same as me\" (3.1.63-\n4). According to Doalty, if needed, the locals will resort to violence to resist against\nBritish conquest and preserve their Gaelic heritage.\nNonetheless, despite the efforts of the locals to preserve their Irish culture, the\nBritish army continues to dominate. For example, in the same scene as mentioned above,\nDoalty suggests, \"If we'd all stick together. If we knew how to defend ourselves.\"\nHowever, Owen reminds him, \"Against a trained army\" (3.1.64). According to Owen,\neven if Doalty teams up with all the locals and fight against the British, they will not\nsucceed against the British military strength. Yet by the end of the play, the hatred for\nthe British and the desire to protect themselves still persists in the locals. The most\nevident reason is when Lancy highlight the cruelty and mercilessness of the British forces\nby threatening the locals with eviction and murdering of livestock if they don't find\nYolland.\nIn this scene, Lancy's true attitude on how he vews the locals surface. Unlike his\npolite manner earlier when he addresses the locals with \"Good evening\" and \"sir\"\n(1.1.30, 32), he now rudely asks Owen \"Who's that lout?\" about Doalty. After Doalty\ninforms him that his whole camp is on fire, Lancy threatens him, saying, \"I'll remember\nyou Mr. Doalty...\" (3.1.61). Furthermore, his tells the locals:\nCommencing twenty four hours from now we will shoot all livestock in\nBallybeg...If that doesn't bear results, commencing forty-eight hours from now\nwe will embark on a series of evictions and leveling of every abode in the\nfollowing selected areas...If by then the lieutenant hasn't been found, we will\nproceed until a complete clearance is made of this entire section... (3.1.61, 62)\nLancy's threat to kill all the livestock and evict the locals, thus destroying their economy,\nfood, and shelter, the basic needs for survival, clearly outweighs one missing person.\nThis disproportioned penalty appear as another tactic for the British Army to suppress\nresistance form the locals and maintain its control. Furthermore, the fact that Lancy\npunishes the entire Irish community rather than trying to find the individual culprit\n(Manus in this case), suggests that Lancy views Irishmen not as individuals, but rather\ngeneralizes them into a group of inferior people. Thus, to Lancy, if one local rebels, this\nmust imply that all the locals would rebel as well. These events highlight the success of\nthe British Army to oppress any potential local uprising, thus foreshadowing a successful\nAnglicization operation for Ireland.\nIn addition to creating British dominance and uprooting Gaelic culture, the\nordinance also affects the individual agents who create the new English labels to replace\n\nLam 4\nthe original Gaelic names. For example, Yolland, a British Lieutenant, falls in love with\nthe land and longs to stay. He tells Owen that \"when heard Jimmy Jack and your father\nrecite and your father swopping stories about Apollo and Chuchulians, and Paris and\nFerdia--as if they lived down the road--I thought I knew perhaps I could live here...\"\n(2.1.40). Thus, Yolland is attracted to the old Gaelic culture and coexisting with the\nlocals. By caring about the land, Yolland begins to try and preserve some of the Gaelic\nnames, such as Tobair Vree.\nLikewise, Owen's attitude on his own identity also changes, though more\ngradually. Throughout most of the play, the British calls Owen \"Roland.\" When Manus\nexclaims that \"Roland\" isn't even his name, he replies to Marcus, \"Owen--Roland--\nwhat the hell. It's only a name. It's the same me, isn't it?\" (1.1.31) Owen initially\nshows apathy towards his new name and argues that he is still the same person, and thus\ndo not lose his identity even as his name changes. Thus, applying this concept to the\nsurrounding geography, Owen originally does not feel any cultural or identity loss by\nsupplanting the Gaelic names of the regions with English labels. Yet throughout his job\ntranslating for the British Army and Anglicizing the Gaelic names of regions in Ireland,\nhe struggles with which side he is on--the locals or the British. For example, when he\nfirst translates Lancy's announcement about the new British Ordinance Survey\nOperation, Owen alters the meanings of the conversation between the locals and\nYolland/Lancy. Manus observes this, saying, \"You weren't saying what Lancy was\nsaying!\" Owen replies, \"Uncertainty in meaning is incipient poetry'--who said that?\"\nManus answers back, \"There was nothing uncertain about what Lancy said: it's a bloody\nmilitary operation, Owen!\" (1.1.32) Owen avoids Manus's accusation on translating\nLancy's speech. This action suggests that Owen may want to Anglicize the different\nregions in Ireland, but he knows that this would uproot the Irish Gaelic language and\nculture, potentially causing some of the locals to be angry. Furthermore, he appears to\nsense Lancy's arrogance and superiority, such as when Lancy speaks slowly and loudly\nto the locals. AS a result, Owen may feel uncomfortable reporting Lancy's true meaning\nin his speech.\nAnother example is when Yolland and Owen are discussing possible names with\nwhich to replace the Gaelic names of the regions in Ireland and Yolland asks Owen to\nkeep the name \"Tobair Vree,\" Owen claims that Tobair Vree stems from a dead man...\nOWEN: ...whose trivial little story nobody in the parish remembers...\nYOLLAND: Except you.\nOWEN: I've left [this parish].\nYOLLAND: You remember it... [Keeping the name Tobair Vree] is what you\nwant, too, Roland.\n(Pause)\nOWEN (Explodes) George! For God's sake! My name is not Roland! (2.1.44)\nIn this scene, Owen claims that the Gaelic names do not have any important or\nsentimental historical value to the locals. Owen claims that \"nobody in the parish\nremembers\" the significance behind the name \"Tobair Vree\" after just elaborating on the\nstory about how this name was founded! Yolland recognizes this contradiction, arguing\nthat Owen remembers the significance of the Gaelic tradition behind this name, but he\ntries to hide it. This irony suggest that Owen tries to appear and believe himself to be\npartial to the British Army because it advances his social status. For example, as a\n\nLam 5\ntranslator, the British views him as superior to the locals, and Owen tells Yolland that he\nhas left the parish and is now part of the British Army. Yet we see Owen struggle with\nhis identity, exploding at Yolland, \"My name is not Roland!\" Despite his claim that he\nhas left the locals (saying \"I've left [this parish]\"), a part of him still remembers the\nhistory behind Tobair Vree, wants to preserve his Gaelic culture, and longs to be called\nOwen. Thus, as the play progresses, Owen's earlier claim to Marcus, saying, \"It's only a\nname. It's the same me, isn't it?\" becomes contradictory. In fact, by the end of the play,\nOwen changes his support from the British Army to the locals.\nThe final scene that sparks Owen's transition to supporting the locals result from\nLancy's mercilessness and cruelty at the end of the play. In the same scene when Lancy\nthreatens to evacuate the locals and kill their livestock, Owen translates the speeches\nbetween Lancy and the locals. When Owen hears Lancy's threats, he is shocked,\nprotesting, \"You're not [evicting all the locals]--!\" However, Lancy quickly retorts back,\n\"Do your job. Translate\" (3.1.61). According to Lancy, Owen's job as a translator does\nnot place him equal with the rest of the British Army. Despite his fluency in English,\nOwen still remains a local and at a lower level on the social hierarchy. Furthermore,\nLancy snaps at Owen in the same tone as when he threatens the locals. The fact that\nLancy treats Owen the same way as he treats the locals further separates Owen's identity\nfrom the British Army and connects it more with the locals. Lancy's devaluing of\nOwen's job as a translator contradicts Owen's own respect and pride founded on his role\nas a translator. Thus, although Owen initially works to Anglicize the Gaelic names and\ntranslate for the British Army, he eventually shifts his identity away from the British\nArmy and towards the locals.\nSo far, we have seen damaging consequences and identity shifts resulting from\nthe British Ordinance Survey Operation. However, the transition to the English language\nand culture is also beneficial to the locals. For example, Marie supports learning English.\nShe tells Hugh,\nI'm talking about [Daniel O'Connell], Master, as you well know. And what he\nsaid was this: \"The old language is a barrier to modern progress.' He said that last\nmonth. And he's right. I don't want Greek. I don't want Latin. I want English.\nI want to be able to speak English because I'm going to America as soon as the\nharvest's all saved. (1.1.26)\nMarie views the English language as a source of opportunity and mobility. By learning\nto speak English and saving enough money, she can immigrate to America for a better\nlife. Her rationale stems from that of Daniel O-Connell, activist for Irishmen's civil and\nsocial rights, and founder of the Catholic Association and the same National Education\nsystem that horrifies Bridget and Doalty. At the same time when Marie considers\nlearning English in the early 19th century, O-Connell passes the Catholic Emancipation,\nremoving political oppression on the Catholics. By then, English has become the\nfoundation for the political government, commerce, and emigration away from poverty.\nIn contrast, the Gaelic language, along with the classics such as Greek and Latin, was\nviewed as backwards and \"a barrier to modern progress.\" With this historical context in\nmind, it is clear why Marie may be drawn to learning English and Anglicizing the Gaelic\nculture.\nSimilarly, the British Army and locals represent modern progress (or the English\nlanguage) and backwardness (or the Gaelic language) respectively. For example, Marie\n\nLam 6\ntells Manus, \"You talk to me about getting married--with neither a roof over your head\nnor a sod of ground under your foot. I suggest you go for the new school; but no--'My\nfather's in for that.' Well now he's got it and now this is finished and now you've\nnothing\" (1.1.29). Marie refuses to marry Manus because he does not have economic\nsecurity and is poor. Earlier, we learned that Manus is against teaching English at the\nnew school to preserve the Gaelic culture and that his father had already applied for the\njob. Thus, Manus remains without a salary, and Marie, who values social and economic\nopportunity over her Gaelic language and culture, chooses Yolland instead. This context\nanalogizes Manus, a poor anti-English local, to the backward Gaelic language, and\nYolland, a socially high ranked British Lieutenant, to the progressive English language.\nLike Owen, Marie attempts to cross the social and political tensions away from\nthe Irish to the British Army. Yet this action increases tensions between both sides,\nleading to Yolland's death and Lancy's threat to evict the locals and kill their livestock.\nJimmy asks Hugh, \"Do you know the Greek word endogamien? It means to marry within\nthe tribe. And the word exogamein means to marry outside the tribe. And you don't\ncross those borders casually--both sides get very angry\" (3.1.68). Although Jimmy is\nliterally speaking about himself crossing boundaries between the mortals and gods to\nmarry the Greek goddess Athena, his speech accurately describes Marie's attempt to\ncross the boundary between Irish and British culture to marry Yolland. The fact that the\nBritish Army uproots the Gaelic language and culture by Anglicizing the names of the\nlocations in Ireland and imposing political and social power over the locals create tension\nbetween the locals and the British Army. Thus, Marie's attempt to cross this boundary,\nby supporting the English language and attempting \"to marry outside the tribe\" to a\nBritish Lieutenant, cause \"both sides [to] get very angry.\"\nAnglicizing the Gaelic names in Ireland by the British Army has both damaging\nand beneficial consequences. However, its disadvantages clearly prevail throughout the\nplay, creating political dominance and discrimination, a social hierarchy, and an\nuprooting of the Gaelic language and culture. However, as this ordinance survey\nprogresses, we see characters, such as Owen and Marie, struggle with their desires to\nprogress against social barriers, choose between their Gaelic heritage and modern\nprogress with the English language, and find their identities. In Act 2, Scene 2 of Romeo\nand Juliet, Shakespeare asks, \"What's in a Name?\" Initially, the audience may wonder\nabout this same question. Like Owen in the beginning of the play, some of us may feel\napathetic towards merely changing the names of the different regions in Ireland. Yet, by\nthe end of the play, like Owen, our attitudes will have, for the most part changed, after\nseeing the intense damage and conflicts that result from this ordinance.\n\nLam 7\nBIBLIOGRAPHY\n\nBullock, Kurt. \"Nationalist Ontology and Imperialist Epistemology in Brian Friel's\nTranslations.\" Possessing Wor(l)ds. 24 Apr 2006.\n<http://www.bsu.edu/classes/bullock2/academics/POSSWORL.htm>\n\n\"Buncrana.com.\" Floorworld. 16 May 2006. 16 May 2006. <http://www.buncrana.com>\n\nFadden, Aidan. \"History, Language and the Post-colonial question in Brian Friel's\nTranslations.\" The Imperial Archive. 12 May 1998. 24 Apr 2006.\n<http://www.qub.ac.uk/en/imperial/ireland/friel1.htm>\n\nMorrison, Andy. \"The Historical and Colonial Context of Brian Friel's Translations.\"\nThe Imperial Archive. 12 May 1998. 24 Apr 2006.\n<http://www.qub.ac.uk/en/imperial/ireland/trans.htm>\n\n\"Translations.\" The Tubingen Anglo-Irish Theatre Group. University of Tubingen. 24\nApr 2006. <http://www.uni-tuebingen.de/uni/nes/taitg/translate.htm>"
    },
    {
      "category": "Resource",
      "title": "woman.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-486-modern-drama-spring-2006/59974bee074f80f717b422269c865431_woman.pdf",
      "content": "MIT Student\nMay 21, 2006\nModern Drama Final Essay\nThe Woman in Copenhagen and Happy Days\nCopenhagen1, Michael Frayn's realist drama about Heisenberg's mysterious visit to Neils Bohr\nin 1941, is unarguably very different from Samuel Beckett's Happy Days2, an absurdist play about a\nwoman who is covered up to her waist in dirt. The main character in Happy Days, Winnie, refuses to\nlose her positive outlook on both the future and the past, despite her unusual condition. Her only\ncompanion is Willie, a man of few words, who makes Winnie's day just by being around (or on very\nhappy days, by speaking or letting her see him). Although Copenhagen focuses on the historical event\nof Heisenberg's visit to Niels Bohr in 1941, it also showcases some of Niels' relationship with his wife,\nMargrethe. Margrethe is not a scientist; she is the dutiful wife of a scientific genius. She sacrifices\nmuch of her own freedom for the sake of Bohr's career and companionship. If Margrethe is a normal\nwoman, how absurd is Winnie?\nAlthough Margrethe and Winnie are clearly very different women, by closely examining and\ncomparing their characters and roles in their respective plays, it is possible to uncover a number of\nstriking similarities. Both are domestic figures, and extremely forgiving of their neglectful male\ncompanions. Frayn and Beckett both use the female characters to explore themes of domesticity, seeing\nand being seen, memory, uncertainty, and silence.\nMargrethe plays a dual role as the non-scientific and domestic figure in Copenhagen. Bohr and\nHeisenberg keep their language simple for her, and in return she waits on them and nurses the victims\nof their relentless scientific interrogation. She has the role as a domestic caretaker - looking after the\nchildren, quarreling scientists, and helping her husband with his research by typing up all of his papers.\nWinnie doesn't live in a house or have a family, but she still feels responsible for looking after Willie.\n1 Frayn, Michael. Copenhagen (United States: Anchor Books, 1998).\n2 Beckett, Samuel. Happy Days (New York: Grove Press, 1961).\n\nShe reminds him \"Slip on your drawers, dear, before you get singed\" (Becket, p. 14) and not to crawl in\nhis hole headfirst so he doesn't get stuck (Beckett, p. 25).\nMargrethe's domesticity is comical at times, because it feels out of place amidst some of the\nmore scientific and political dialogue between Heisenberg and Bohr. In the heat of one of Heisenberg\nand Bohr's discussions, Margrethe interrupts but is ignored:\n\"Heisenberg ... I shatter the objective universe around you - and all you\ncan say is that there's an error in in the formulation!\nBohr\nThere is!\nMargrethe\nTea, anyone? Cake?\nHeisenberg\nListen, in my paper what we're trying to locate is not a free\nelectron off on its travels through a cloud chamber, but an electron when\nit's at home, moving around inside an atom...\" (Frayn p. 68).\nWhile this provides some comic relief to the intense argument the two men are having, it borders on\nabsurd. As she tries to fulfill the role of dutiful wife, she is ignored (not unlike Winnie). Soon after,\nMargrethe is compared to the nucleus of an atom and Bohr is the free electron floating around.\nMargrethe is stationary as her husband wanders about - she is constrained, just as Winnie is constrained\nin her mound of earth.\nWinnie performs a number of tasks that are also humorous, though many of her tasks center\naround personal vanity. She pulls out a mirror and puts on her lipstick (Beckett p. 14) and she obsesses\nabout brushing her hair as though it is her duty (Beckett p. 22). She makes the effort to dress up and\nfulfill a feminine role, though she has no where to go, and no one to notice her efforts. Margrethe tries\nto fulfill her feminine role by being the hostess, offering tea and cake to the laboring scientists, but her\nefforts also go unnoticed. With Margrethe in mind, is it so unreasonable that Winnie obsesses about\nbrushing her hair and putting on her make-up despite Willie's disinterest? She does what she thinks she\n\nhas to do, whether Willie appreciates it or not.\nOne of the major differences between Margrethe and Winnie's relationships with their husbands\nis obviously communication. Winnie and Willie almost never talk to each other; Winnie talks and he\nlistens because he \"never [has] any opinion about anything\" (Beckett, p. 52). In Copenhagen,\nHeisenberg tells Bohr and Margrethe that he's \"always envied\" the way they \"manage to talk about\neverything\" because his wife is too busy \"with the children and so on\" to talk to him about his\nproblems (Frayn, p. 29). The Bohrs' ability to communicate with each other well doesn't save them\nfrom some of the same problems that Willie and Winnie have.\nBoth Margrethe and Winnie are extremely forgiving when their male counterparts are\nneglectful. Bohr leaves Margrethe at home with a one-week-old new born to go hiking with one of his\nnew assistants - twice, once when their son Ernest is born and again when their son Christian is born\n(Frayn, p. 57). Bohr isn't even sure which sons Margrethe is talking about, because he is consumed\nwith his own work and it seems to be her duty to take care of the children. Margrethe doesn't show any\nbitterness towards her husband for leaving her at home - even when he gives her the opportunity to\nspeak out against his temporary abandonment, she says she didn't mind \"at all\" (Frayn p. 57). It is part\nof the distant past, and she forgives him.\nMargrethe voluntarily types up all of Bohr's scientific papers as part of her duty as a scientist's\nwife. Her role as his typist is so well established that it is the subject of a few jokes. Although she types\nthe papers willingly, she does concede that Bohr once reduced her to tears by making her type and\nretype a paper as he was drafting a paper on complementarity (Frayn, p. 70). Bohr has no recollection\nof his wife's emotional state while working on the paper - Heisenberg is the one that brings it up, and\nMargrethe affirms that she remembers. Still, she shows very little frustration with her husband. She\nremembers his cruelty, but she also forgives him.\nWinnie is similar, though her situation is unrealistic. Winnie often tries to strike up a\n\nconversation with Willie, but he rarely ever responds. She comforts herself by saying that it is enough\njust for her to know that he is around, even if he doesn't hear her. She tells him that she doesn't even\nneed him to listen to her, \"just to know that in theory you can hear me even though in fact you don't is\nall I need, just to feel you there within earshot\" (Beckett, p. 27). Even though Winnie's request seems\nridiculous because most people expect more out of a companion, Willie does stay with her, which is all\nshe needs. Winnie's request that Willie just stay around seems like a reasonable one when we consider\nthat Bohr, a historical figure, was away hiking with a student while his wife was at home with a one\nweek old child.\nEven more notable than the woman's capacity to forgive is her ability to justify and defend her\nhusband's shortcomings. Margrethe tells her husband, \"Two sons arriving on top of each other would\nbe rather a lot for any man to put up with\" (Frayn, p. 57). She clears him of any responsibility for\ntaking care of their newborn son because he is too busy taking care of his new assistant (the so-called\nsecond \"son\"). She is even \"pleased that [he] had an excuse to get away\" (Frayn, p. 57).\nLikewise, Winnie thinks that she is asking too much of Willie to expect him to reply to her. She\nrepeatedly asks him for some kind of sign that he can see or hear her--even just as simple as raising a\nfinger, \"just the little finger\" (Beckett, p. 37). When he doesn't reply, she is sometimes flustered but\nusually critical of her own expectations for a reply, as in this passage:\n\"One does not appear to be asking a great deal, indeed at times it would\nseem hardly possible - (voice breaks, falls to a murmur) - to ask less - of\na fellow-creature - to put it mildly - whereas actually - when you think\nabout it - look into your heart - see the other - what he needs - peace - to\nbe left in peace - then perhaps the moon - all this time - asking for the\nmoon\" (Beckett, p. 29).\nWinnie's right - it doesn't seem that she could ask for much less, yet she is not angry at Willie for\n\nignoring her request. Although Winnie's situation is very different from Margrethe's, both women don't\nreproach their men for ignoring their emotional needs, and even defend the men's actions.\nWinnie is absurdly happy for her condition - despite being immobile and up to her waist (or\nneck) in dirt, she is thankful for what she has. She doesn't expect Willie to do anything for her, so even\nthe smallest, simplest gestures make her happy. For example, when she is trying to figure out if the\nhairs on her head should be referred to as \"it\" or \"them\":\n\"Winnie\n... The hair on your head, Willie, what would you say of the\nhair on your head, them or it?\nLong pause.\nWillie\nIt.\nWinnie\n(turning back front, joyful). Oh you are going to talk to me\ntoday, this is going to be a happy day!\" (Beckett, p 23).\nAt first glance it seems absurd that a single word should make Winnie so happy. She is thrilled to have\nWillie's attention even for just a moment, because he usually seems to ignore her and just do his own\nthings, like read the newspaper.\nBohr does not appear to be a bad or abusive husband to Margrethe, but his family life is clearly\nless important than his physics. Much of the time they spend together is devoted to Bohr writing his\npapers. Like Willie, Bohr is absorbed in his own affairs - his attention to Margrethe is limited. He\ndoesn't remember making her cry or which children were born when. Winnie's elation over Willie's\nreply about the hair is less absurd when we consider how much attention Bohr seems to give to\nMargrethe.\nIn addition to showing the gender-relationship issues, Frayn and Beckett also use the female\ncharacters in Copenhagen and Happy Days to explore themes of seeing and being seen, memory,\nuncertainty, and silence. The female characters are central to the exploration of time and memory in\n\neach play, and their roles in both plays function in similar ways in relation to the these themes.\nBoth plays explore how it is difficult for people to see what is right in front of them, or how\ndifficult it is for them to see themselves. In Happy Days, Winnie explains that a Mr. and Mrs. Shower\nonce saw her stuck in the earth, and wondered \"What does it mean?\" (Beckett, p. 43). Mrs. Shower\nretorts by asking Mr. Shower what he means standing on two feet. Does the fact that Winnie is up to\nher waist in dirt mean anything? Winnie struggles to see herself at the beginning of Act Two. She is\ntrying to see the person that Willie \"so admired\" but she can barely see more than the end of her nose,\nbecause she is covered up to her neck in earth (Beckett, p. 52). Winnie can't see herself as Willie sees\nher, because it is impossible for her to know what he sees in her.\nIn Copenhagen, the quest for meaning is at the core of the play. The characters are looking at\neach other, and looking at events in their lives trying to figure out what they mean. But they struggle -\nthey can't find meaning, just as Mr. Shower can't find meaning by looking at Winnie. Heisenberg looks\nat Margrethe and Bohr, but he doesn't understand what they mean. Margrethe and the other characters\nare also unable to see themselves. At the end of the play, when the three characters re-visit Heisenberg's\narrival at the Bohr residence in 1941, Margrethe says, \"I watch the two smiles in the room, one\nawkward and ingratiating, the other rapidly fading from incautious warmth to bare politeness. There's\nalso a third smile in the room, I know, unchangingly courteous, I hope, and unchangingly guarded\"\n(Frayn, p. 87). Margrethe can't see herself even though she is not physically constrained like Winnie;\nshe can't tell how the others perceive her. The entire play is almost over, the characters are dead, yet\nthey are still stuck on the same event that they started discussing in the beginning - much like Winnie\nis stuck in her mound of dirt.\nThe uncertainty of memory is a crucial theme in Copenhagen, because the characters are trying\nto remember what happened during Heisenberg's 1941 visit to Bohr. None of the characters can\nremember the events clearly. Margrethe often contests Bohr and Heisenberg's memories of their lives\n\ntogether. The two men have a nostalgia for the days when they worked on the theories of quantum\nmechanics together, but Margrethe dispels their nostalgia by reminding them, \"Every single one of\nthem you did when you were apart\" (Frayn, p. 61). Margrethe's comment helps the men remember how\nbitterly they fought over Schroedinger's theories and how Heisenberg published his uncertainty paper\nwhile Bohr was away (Frayn, p. 63-7). Clearly, the two men do not have the perfect relationship they\nthought they did before it was ruined by World War II. Margrethe's part is small, but important. She\ncasts doubt on the men's memories by reminding them of the emotional turmoil that went with their\nwork together.\nWinnie also struggles with the uncertainty of memory on a smaller scale. She can't remember if\nshe's brushed her hair (Beckett, p. 22) or if the names of the only people that come to visit her are\nShower or Cooker (Beckett, p. 41). The details of one of the unusual events in her life (the visit from\nthe Showers) are unclear, just as the details of Heisenberg's visit to Copenhagen are unclear to himself\nand the Bohrs. Winnie is also unsure of the details of intimate moments of her life - she recalls her first\nkiss, but can't remember if it was with a \"Mr. Johnson, or Johnston\" (Beckett, p. 39). She remembers\nthat the kiss was in a toolshed, although she \"cannot conceive\" whose toolshed it was (Beckett p. 39).\nWhat she remembers about the kiss is emotional - the factual details have faded over time.\nAlthough Margrethe remembers details about her husband's relationship with Heisenberg, much\nof what she remembers is emotional and the facts remain unclear. It is like Winnie says: \"Yes,\nsomething seems to have occurred, something has seemed to occur, and nothing has occurred, nothing\nat all\" (Beckett, p. 39). Both of the women can remember their emotional reactions to events in their\nlives, but not many details about those events.\nAlthough Margrethe seems certain that she remembers things, some of her later lines in the play\nshow that her emotions are getting in the way of her memory. She claims that Heisenberg and her\nhusband are trying to \"make everything seem heroically abstract and logical. And when [they] tell the\n\nstory, yes, it all falls in to place, it all has a beginning and a middle and an end\" (Frayn, p. 73).\nHowever, Margrethe's memories of the events are \"confusion and rage and jealousy and tears and no\none knowing what things mean or which way they're going to go\" (Frayn, p. 73). Margrethe provides\nthe emotional depth to uncertainty - she shows how our own feelings get in the way of how we\nremember things.\nMargrethe's commentary in the play is emotional. Though she provides some of the content -\nby providing details about the Bohrs' family life and Bohr's relationship with Heisenberg - many of her\nlines are emotional or personal in nature. Her presence makes the conflict between Bohr and\nHeisenberg personal, as she finally explodes that \"everything is personal!\" (Frayn, p. 73). She thinks\nthat Heisenberg returned to Copenhagen in 1941 to \"show [himself] off\" to the Bohrs (Frayn, p. 74).\nShe says that when Heisenberg first came to Copenhagen \"he was a humble assistant lecturer from a\nhumiliated nation, grateful to have a job\" but when he returns years later, he is \"the leading scientist in\na nation that's conquered most of Europe\" (Frayn, p. 74). Though Margrethe brings up some excellent\npoints, she is only recalling how she felt about Heisenberg's visit. Why Heisenberg thinks he came to\nvisit is still unclear. Margrethe is too emotionally involved to remember the details of the event\nobjectively.\nFrayn and Beckett both use their female characters to confront the issue of silence and to show\nthe uncertainty associated with silence. The silence in Happy Days creates tension and uncertainty in\nWinnie and Willie's personal relationship, while silence in Copenhagen is used to show uncertainty and\nawkwardness in human relationships. In both plays, the woman is the character who confronts the\nsilence.\nIn Happy Days, Winnie does most of the talking and Willie rarely responds. Willie's silence\ncreates the drama in their relationship - when he does speak, Winnie declares that it is a happy day. As\nI described earlier in this paper, Winnie just needs to know Willie is there. His silence, through cruel\n\nand unusual, also creates happiness - because when he actually breaks his silence, it makes Winnie's\nday. When he does not speak for a long period of time, Winnie despairs. For example, in Act Two,\nwhen she has not heard from him in a while she says:\n\"I sometimes find your attitude a little strange, Willie, all this time, it is\nnot like you to be wantonly cruel ... I do hope nothing is amiss. ... Is all\nwell, dear? ... God grant he did not go in head foremost! ... You're not\nstuck, Willie? ... You're not jammed, Willie? ... Perhaps he is crying out for\nhelp all this time and I do not hear him!\" (Beckett, p. 55-6).\nWillie's silence makes Winnie worry that he has died or gone away. His silence creates an uncertainty\nfor Winnie, because she cannot even look to see if he is still there or not.\nIn Copenhagen, Margrethe speaks when the scientists are lost for words. She creates drama by\nvocalizing the word \"silence.\" In Act One, Heisenberg trails off mid-sentence when talking about how\nmany different \"sums\" you can get by adding people (Frayn, p. 29). When he stops talking, Margrethe\ncomments, \"Silence. What's he thinking about now? His life? Or ours?\" (Frayn, p. 29). Instead of just\nletting the characters feel the awkwardness of the silence, she makes it explicit and forces them to\nconfront the uncertainty of Heisenberg's thoughts.\nAt the end of Act Two, Margrethe uses silence in a different way. Heisenberg is describing\nwalking through the destroyed German countryside, his \"ruined and dishonored homeland\" (Frayn, p.\n93). Bohr tries to comfort Heisenberg, but then there as silence, which Margrethe describes as \"the\nsilence we always in the end return to\" (Frayn, p. 93). Heisenberg claims he knows what the Bohrs are\nthinking about, dispelling the uncertainty. The silence shows the difficulty that people have when\ncommunicating emotionally. Margrethe and Bohr do not know how to comfort Heisenberg, because\nthey feel sympathy for him yet resent him for working on the Nazi nuclear program. Margrethe\ndramatizes the silence by speaking, like Winnie dramatizes Willie's silence by asking him to talk. Frayn\n\nand Beckett use their female characters to illustrate the theme of silence in similar ways, as they do\nwith a number of other themes.\nOn the surface, there are few similarities between Frayn's Copenhagen and Beckett's Happy\nDays aside from minimalism in cast and setting. However, the plays do have some similar themes - the\nrelationship of husband and wife, uncertainty, silence, time, seeing and being seen. The female\ncharacters are also different - one is a historical figure and the wife of a famous scientist, and the other\nis a fictional, absurd character stuck up to her waist in dirt. Though both characters seem to have little\nin common, the playwrights use them in similar ways to illustrate common themes. The characters are\nespecially similar in their interactions with their husbands. Margrethe tolerates Bohr's absence from\ntheir home life while Winnie tolerates Willie's silence. By looking at Margrethe, we can better\nunderstand the motivations for Winnie's actions. Although her character is abstract, Winnie's reactions\nto her surroundings may not be as absurd as they seem."
    },
    {
      "category": "Resource",
      "title": "charlesfamily.pdf",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/21l-486-modern-drama-spring-2006/43255e3bf7138f1aa8d0f6ee55fb85bc_charlesfamily.pdf",
      "content": "(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\n(\n)\nThe Piano Lesson: A Charles Family Tree\nPapa Boy Charles\nBorn 1795\nMama Ester\nBorn 1802\nPapa Boy Willie\nBorn 1819\nCarved the piano\nMama Berniece\nBorn 1826\nSold for the piano\nPapa Boy Walter\nBorn 1847\nSold for the piano\nMama Nellie\nBorn 1855\nMama Ola\nBorn 1876\nBoy Charles\nBorn 1879\nWining Boy\nBorn 1880\nDoaker Boy\nBorn 1881\nBoy Willie\nBorn 1906\nBerniece\nBorn 1902\nCrawley\nBorn 1896\nMaretha\nBorn 1925\nFigure by MIT OCW."
    }
  ]
}