{
  "course_name": "Modularity, Domain-specificity, and the Organization of Knowledge",
  "course_description": "This course will consider the degree and nature of the modular organization of the mind and brain. We will focus in detail on the domains of objects, number, places, and people, drawing on evidence from behavioral studies in human infants, children, normal adults, neurological patients, and animals, as well as from studies using neural measures such as functional brain imaging and ERPs. With these domains as examples, we will address broader questions about the role of domain-general and domain-specific processing systems in mature human performance, the innateness vs. plasticity of encapsulated cognitive systems, the nature of the evidence for such systems, and the processes by which people link information flexibly across domains.",
  "topics": [
    "Science",
    "Cognitive Science",
    "Science",
    "Cognitive Science"
  ],
  "syllabus_content": "Course Meeting Times\n\nLectures: 1 session / week, 3 hours / session\n\nCourse Overview\n\nThis is a seminar and discussion class for graduate students (and advanced undergraduates, by permission of the instructors).\n\nThe focus of this class will be the study of the modular organization of the mind and brain. Functional brain imaging and ERPs data will be used to focus on the domains of objects, number, places, and people, drawing on evidence from behavioral studies in human infants, children, normal adults, neurological patients, and animals. The broader questions about the role of domain-general and domain-specific processing systems in mature human performance, the innateness vs. plasticity of encapsulated cognitive systems, the nature of the evidence for such systems, and the processes by which people link information flexibly across domains will be explored with the aid of the readings and recent work.\n\nRequirements\n\nClass participation\n\nPresentations of readings\n\nFinal paper\n\nCourse Topics\n\nModularity\n\n1. A Computational Prospective\n\n2. An Evolutionary Perspective\n\n3. Challenges from Psycholinguistics\n\n4. Challenges from the Associationists\n\n5. Additive Factors Approaches to Functional Dissociations\n\nInnateness and Plasticity in Vision\n\n1. Arealization and its Development\n\n2. Development of Ocular Dominance\n\n3. Rewiring Sensory Cortex\n\n4. Rewiring in Humans\n\nObjects\n\n1. Attentive Tracking in Adults\n\n2. Object Perception in Infants: an Encapsulated Mechanism?\n\n3. Object Tracking in Infants and Adults: A Domain-specific Mechanism?\n\n4. Infants' Use or Non-use of Kind Information to Parse Objects\n\n5. Adults' Use or Non-use of Kind Information to Parse Objects\n\nPeople I: Faces\n\n1. On the Nature of Face Representations\n\n2. Evidence for Special Neural Hardware for Faces\n\n3. The Role of Experience\n\n4. Category-General Object Representations\n\n5. Developmental Origins of Face Recognition Abilities\n\nPeople II: Body Parts, Biological Motion, and Action\n\n1. Body Parts\n\n2. Biological Motion\n\n3. Gaze Following\n\n4. Mirror Neurons and Imitation\n\n5. Perceiving Action as Goal-directed\n\nPeople III: Mind\n\n1. Theory of Mind and Language\n\n2. Theory of Mind and Autism: A Specific Deficit?\n\n3. Is Theory of Mind Specific to Humans?\n\n4. Neuroimaging of Theory of Mind\n\nNumber I: Number Sense\n\n1. Is there a Dedicated Cortical Region for Processing Approximate Numerosity?\n\n2. Number Sense in Animals\n\n3. Number Sense in Infants\n\n4. Number Sense in Adults: Estimating and Operating on Approximate Numerosities\n\n5. Using Number Sense in Mental Arithmetic\n\n6. Impairments of Number Sense\n\nNumber II: Small Numbers, Large Numbers, and Verbal Counting\n\n1. Small Number Representations in Animals and Infants\n\n2. Small Number Representations in Adults and Infants (subitizing)\n\n3. Small Number Representations in Infants: Is it Really Number?\n\n4. Patient Studies of Small Number Representations?\n\n5. Number and Language\n\n6. Are Large, Exact Number Representations Unique to Humans with Language?\n\nPlaces I: Path Integration and Cognitive Maps\n\n1. Patient Studies\n\n2. Path Integration in Animals\n\n3. Path Integration in Human Adults\n\n4. Updating vs. Using Allocentric Cognitive Maps\n\n5. fMRI Studies of Navigation in Virtual Environments\n\nPlaces II: Reorientation\n\n1. Is there a Purely Geometric Module in Animals?\n\n2. Is there a Purely Geometric Module in Human Infants?\n\n3. Space and Language\n\n4. Geometry and the Brain\n\nOther Possible Domains\n\n1. Animals?\n\n2. Fruits & Vegetables?\n\n3. Tools?\n\n4. Predators?\n\n5. Cheaters?\n\n6. Probability?\n\n7. Moral Sense?\n\n8. Chairs?\n\n9. A \"visual word form area\"?",
  "files": []
}