{
  "course_name": "Moral Problems and the Good Life",
  "course_description": "This course will focus on issues that arise in contemporary public debate concerning matters of social justice. Topics will likely include: euthanasia, gay marriage, racism and racial profiling, free speech, hunger and global inequality. Students will be exposed to multiple points of view on the topics and will be given guidance in analyzing the moral frameworks informing opposing positions. The goal will be to provide the basis for respectful and informed discussion of matters of common moral concern.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Sociology",
    "Social Justice",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Sociology",
    "Social Justice"
  ],
  "syllabus_content": "Description\n\nThis course provides an introduction to important philosophical debates about moral issues and what constitutes a good life: What is right, what is wrong, and why? How important are personal happiness, longevity, and success if one is to live a good life? When is it good for you to get what you want? To what extent are we morally obliged to respect the rights and needs of others? What do we owe the poor, the oppressed, our loved ones, animals and fetuses?\n\nRequirements\n\nReading, discussing, and writing about the assigned readings are the central activities of this class. (No outside research will be necessary.) There is a reading assignment for each lecture. Some are quite difficult and demand careful study. You should complete the assigned readings\nbefore\neach lecture as the lecture will often presuppose familiarity with the material in the texts.\n\nAttendance at\nall\nlecture and\nall\nrecitation sections is\nrequired\n. Lectures will introduce important material not in the readings. As mentioned above, one goal of the course is to help students develop their critical and argumentative skills. Because of this -- and to meet the requirements for a Communication-Intensive course -- participation in section is an especially important component of the course.\n\nCriteria for Communication Intensive (CI) Subjects in the Humanities, Arts, & Social Sciences (HASS)\n\nCommunication intensive subjects in the humanities, arts, and social sciences should\nrequire at least 20 pages of writing\ndivided among 3-5 assignments. Of these 3-5 assignments,\nat least one should be revised and resubmitted\n. HASS CI subjects should further offer students substantial opportunity for oral expression, through presentations, student-led discussion, or class participation. In order to guarantee sufficient attention to student writing and substantial opportunity for oral expression, the maximum number of students per section in a HASS CI subject is 18, except in the case of a subject taught without sections (where the faculty member in charge is the only instructor). In that case, enrollments can rise to 25, if a writing fellow is attached to the subject.\n\nGrading\n\nAll written exercises (except those completed in class) must be typed or word-processed. Please keep a copy of all work you turn in. Late work will be accepted only under exceptional circumstances, and will be penalized unless an extension is granted\nin advance\n. The instructor reserves the right to fail any student in the course who fails to perform at a passing level in any of the grading areas listed above; so, for example, attendance at recitation is required and consistent failure to attend will result in an F for the course.\n\nACTIVITIES\n\nPERCENTAGES\n\nRecitation\n\n20%\n\nThree (5 page) papers\n\n60%\n\nFinal exam\n\n20%\n\nRecitation Grade\n\nRecitation evaluation will be based on attendance, preparation, contributions to discussion, and any written or oral assignments, including 2 argument analysis exercises (2-3 pages). (The two exercises together must total at least\nfive\npages.)\n\nThree (5 page) Papers\n\nPaper topics will be distributed in advance and will ask students to analyze and discuss material covered in class. Guidelines for papers will be handed out in class. (The three papers together must total at least\nfifteen\npages.)\nEither the first or second paper must be rewritten and resubmitted\n(this is\nrequired\nof all students to fulfill the CI requirement). You will be expected to revise your first paper, unless you have received permission from your TA to revise your second. Your grade for the revised paper will be the average of the grades for the two versions. (Note that revised papers are held to a higher standard.)\n\nNote: Papers must be submitted electronically to your teaching assistant. It is your responsibility to be sure that it has been received. Your TA may also require you to submit a hard copy of the paper.\n\nFinal Exam\n\nYou will be required to take a 3-hour final exam on material covered throughout the term. The final exam will be at least 2/3 essay format, and essay questions will be distributed in the final lecture of the term. The exam will be closed-notes and closed-books. (There is no midterm exam.) The time and date will be set by the Schedules Office Final Examination Schedule. But sure to check this schedule early and notify the Schedules Office of any conflicts.\n\nNote: Students will be required to take the exam at the scheduled time unless permission has been granted by the Schedules Office to take the exam at an alternate time. Permission to take the exam early\nwill not\nbe given to students who simply want to leave town early for the holidays,\neven if\nthis is your only exam.\nDo not\nbook flights home before you know the exam schedule.\n\nPlagiarism\n\nPlagiarism and other forms of academic dishonesty will not be tolerated in this course. If in doubt about what counts as plagiarism, or about how to properly reference a source, consult the instructor or your TA. Other forms of academic dishonesty include: cheating on exams, double submission of papers, aiding dishonesty, and falsification of records. If academic dishonesty is proven,\nat the very least\nyou will fail the course and a letter will be sent to the Committee on Discipline documenting your dishonesty. If you are tempted to plagiarize because you are in crisis, it is\nalways\nbetter to speak to your TA, the professor, your advisor, the academic deans, the counseling center, or another trusted authority on campus who can help you handle the crisis. The following (slightly modified) was distributed to HASS-D instructors by the HASS Committee for use in their classes.\n\nStatement Regarding Academic Misconduct\n\nTo put it bluntly, plagiarism is theft and fraud -- it is the theft of someone else's ideas, words, approach, and phrasing; it's fraud because the writer is trying to profit (a grade) by claiming as his/her own someone else's work.\n\nBecause plagiarism can have severe disciplinary consequences, it is crucial to understand the concept. Just as scientists demand complete and accurate information about experiments so that they duplicate and check those experiments, so scholars and readers demand complete information so they can check your use of sources and accuracy in reporting what others said. In all academic writing, then, you must give complete citations (e.g., author, title, source, page) each time you use someone else's ideas, words, phrasing, or unusual information. An insidious form of plagiarism is the \"patchwork paper\" -- some words and ideas taken from source A are stitched together with words and ideas from source B and source C and....\n\nYour essays should be your own work, although you are encouraged to seek writing advice from the\nWriting and Communication Center\n. If there is any question about whether the student's paper is his or her own work, TA's have been directed to bring the paper directly to the professor. Every effort will be made to determine whether the paper is plagiarized. This is an attempt to be fair to the teachers and the other students in the course.\n\nThere are 4 guidelines for using sources in your essays:\n\nThere is never a good reason to paraphrase a source -- either summarize it in your own words or quote it exactly (citing the source in either case).\n\nWhen you quote, quote exactly, use quotation marks, and cite the source.\n\nWhen you use information that might not be considered common knowledge, cite the source.\n\nWhen in doubt about whether or not to give a citation, always give a citation.\n\nAdditional information:\nCiting and Using Sources\n\nHow to Cite a Source\n\nIf your paper discusses a single essay assigned for the course, and if you make clear what essay that is in the body of the text, then you may cite the essay by putting the page number of the quotation or paraphrase in parentheses next to the stretch of text. (I will assume you are using the version of the text provided for the course. If not, please provide the full reference.) E.g.,\n\nIn his essay, \"The Will to Believe\" William James offers a critique of Clifford's evidentialism. He argues that \"In truths dependent on our personal action, then, faith based on desire is certainly a lawful and possibly an indispensable thing.\" (107)\n\nIf you use a source not assigned for the course, include the full reference for the source in a bibliography, and at the point in the text where you need to cite the source, put the author's last name, date of publication, and page number, e.g., (Armstrong 1978, 75).\n\nTo cite internet sources, see\nOnline Citation Styles\n.\n\nIf you have questions, be sure to contact the instructor or your TA.",
  "files": [
    {
      "category": "Exam",
      "title": "Final Exam Study Questions",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/c9e92cdbee4d33a343da267c208dfc42_exam_guide.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nFinal Exam Study Questions\nThe final exam for the course will be closed notes and closed books. The exam will have three\nparts (with their weighted percentage of the grade indicated in parentheses). It will cover material\nfrom the whole term. In order to pass the course students must earn a passing grade on the final\nexam.\nI. Identifications\nThe first part (35%) will consist of identifications: you will be given five quotations and you must\nprovide (i) the author's name, (ii) an explanation of the quote's meaning in your own words, and\n(iii) a brief description of the debate to which it contributes, including a statement of (at least) one\nof the opposing views.\nEXAMPLE:\n\"If it is in our power to prevent something bad from happening, without thereby sacrificing\nanything of comparable moral importance, we ought, morally, to do it.\"\ni)\nSinger.\nii)\nThis is a statement of Singer's \"Prevent Suffering Principle\" which\nhe uses to argue that we ought to contribute large sums of money to\nfamine relief. According to this principle if we can prevent someone\nhaving to undergo a bad thing such as dying or suffering greatly, by\ndoing something that does not involve anyone else dying or suffering\ngreatly, we are morally required to do it.\niii) Singer is taking a stand on the question of what we ought to do in\nresponse to the great pain and suffering in the world. Although his view\nis close to utilitarianism, it differs in some ways. A utilitarian would\nmake the general claim that we ought always to do what brings about the\ngreatest happiness or welfare overall. So a utilitarian would hold that\nif the greatest amount of happiness would be created by allowing some to\nstarve, it would be morally permissible to allow them to starve. On\nSinger's view, however, we should make every effort to prevent something\nbad from happening, even if it decreases happiness overall, as long as no\none would have to suffer to the same extent. Singer's view has the\nconsequence that some sufferings are so bad that we should give up some\ndegree of welfare or happiness to prevent them.\nII. Short Answers\nThe second part (15%) will consist of short answer questions, e.g.,\n1. What is the difference between a desire satisfaction account of the good and an objective list theory?\nDescribe a case in which the two accounts give different results regarding whether something is good.\nAnswer: According to the desire satisfaction account of the good,\nsomething is good for me just in case it satisfies my desires. Most\ndesire satisfaction theories qualify this simple version because it is\ntypical for people to have desires for harmful things that wouldn't make\ntheir life good. A plausible version of the desire satisfaction theory\nis one that considers what an ideal version of me would want, so what I\nwould want if I had more knowledge and were able to vividly understand\n\nthe consequences of getting what I want. An objective list theory holds\nthat there is a list of things that are objectively good and it is good\nfor me to get the things on this list. On this view it doesn't matter\nwhether I want the things on the list, what matters is that they\ncontribute to my well-being, objectively understood. For example,\naccording to the objective list theory it might be good for me to be\nhealthy, wealthy and wise, even if I don't want to be healthy, wealthy\nand wise.\nIII. Essays\nThe third part (50%) will consist of essay questions drawn from the list below. You will be given three of\nthe following five questions, and will asked to write on two of them.\nREMEMBER: Be sure to answer the question(s) asked. Although it may be useful to summarize some\nbackground material you will be penalized if you fail to address the specific questions posed. Essays will be\nevaluated both on the degree to which they demonstrate competence with the material covered in class, and a\nthoughtful engagement with the issues. In preparing for the exam, at the very least make an outline for your\nanswers with a clear thesis and supporting arguments.\n1. Peter Singer argues that speciesism, the idea that certain beings deserve to be treated with greater\nconsideration than others, merely in virtue of belonging to a certain species, is just as morally reprehensible\nas sexism and racism. How solid is this analogy? First: what does Singer think is morally wrong with\nsexism and racism? Given the material we considered in class, do you agree? What do you think is morally\nwrong with sexism and racism? Second, does Singer's account of the moral wrong of sexism and racism\nplausibly extend to other species? There are significantly greater differences between humans and cows than\nthere are between men and women, or Hispanics and Asians. How does Singer defend his view in light of\nthese differences? Why does he think that these differences are not morally significant and how does his\nutilitarianism drive these considerations? If you disagree with Singer's account of sexism and racism, could\nyour analysis be plausibly extended to argue that something is wrong with speciesism? Why or why not?\n2. A rich uncle you never knew suddenly dies and in his will he leaves you $100,000 on the condition that\nyou give half of it either to CARE to support famine relief (http://www.care.org/campaigns/world-hunger) or\nto The Wilderness Society for environmental protection (note that Aldo Leopold was one of the founders of\nthe Wilderness Society: http://wilderness.org/about-us/history). The $50,000 cannot be split but must be\ngiven to one organization or the other based on what you take to be the more morally worthy cause. Which\norganization do you choose and why do you think it is the more worthy?\n3. In 2007-8 there were a series of incidents on university campuses that were considered cases of racist and\nhomophobic speech: http://www.yaledailynews.com/articles/view/22333. They included the painting of\nracist and homophobic slurs and symbols (such as a swastika) on walls and hanging a noose on a Black\nprofessor's office door. Taking into account the material covered in the course, what, if anything, is morally\nwrong with such actions? If you could write a code of conduct for a private university that was not under the\njurisdiction of the federal government (so not subject to the first amendment) would it include anything to\nprohibit or discourage such incidents? Why or why not?\n4. Suppose you think using pornography is immoral. What is the best argument to the conclusion that it\nshould nonetheless not be regulated by the state? Suppose, on the other hand, you think using pornography is\nperfectly permissible. What is the best argument to the conclusion that it should nonetheless be state\nregulated (indicate the sort of regulation you would recommend)? Are the resulting positions stable, i.e., is\nthere a tension in either (or both) of the resulting positions that would ultimately make it untenable? What\ndoes this suggest about the relationship between moral and legal norms?\n\n5. Consider this argument by Andrew Sullivan:\n\"Homosexuality is distinguishable from all of the activities you mention [e.g., incest, polygamy,\nbestiality] because, exactly like heterosexuality, it exists prior to them. Homosexuality, like\nheterosexuality, is an unchosen emotional and sexual orientation. Incest, polygamy, and bestiality are\nsubsequent activities, choices, and moral behaviors that are available to heterosexual and\nhomosexual alike. It is perfectly possible therefore--logically, morally, politically, theologically,\nsocially--to include homosexuals within the existing institution and retain a complete and inviolable\nbar against all these other activities. Indeed, there is no logical connection between any of them and\nhomosexuality at all.\" (Andrew Sullivan)\nExplain the argument against same-sex marriage that Sullivan is responding to, and evaluate his response in\nlight of the material we've covered on same-sex marriage. If one disagrees with Sullivan that homosexuality\nis not \"unchosen\" then does his argument fall apart? Is there a better way to draw the line between\nhomosexuality and the other sexual activities mentioned so that legalizing same-sex marriage does not\nlogically require one to tolerate the others?\nNOTE: THESE ARE THE FIVE STUDY QUESTIONS FOR 2008. OTHER ESSAY QUESTIONS\nPOSTED ON THE WEBSITE AS EXAMPLES WILL NOT APPEAR ON THE EXAM."
    },
    {
      "category": "Resource",
      "title": "First Argument Analysis Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/3c47e7d7af226039214ce8152b14c975_assn_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n24.02 Moral Problems and the Good Life\nFall 2008\n\nFirst Argument Analysis Exercise\n\nWrite 2-3 pages providing an analysis of the following argument in Richard Kraut's essay \"Desire and the\nHuman Good.\" In doing so,\n-\nNumber the premises and the conclusion. Articulate each premise and the conclusion in no more\nthan one sentence. Feel free to use a different wording in your statement of the premises and conclusion\nthan is provided by the text. You may not need to use every sentence in the passage in reconstructing the\nargument, and you may need to supply premises that are not explicitly stated in the text given. (Note that\nin this passage, Kraut is presupposing conclusions he has argued for elsewhere in the essay. You need\nnot analyze his arguments for these claims, e.g., that \"satisfying our whims and urges is good.\" Rather,\nyour task is to show how he uses these claims to reach a conclusion about pain.)\n-\nIndicate for each premise whether it is an assumption, or whether it is supposed to follow from\nearlier premises. (This should appear in parentheses after the premise.)\n-\nAfter stating the argument, briefly explain it in your own words, and then comment on its\ncogency: Are its premises plausible? Are the inferences sound? (If not, why not?)\n\nPerhaps I can create some doubt about whether pain is intrinsically bad by calling attention to a\nnumber of other sensations that are disliked even though they are not physically painful: for\nexample, foul odors and grating noises. Should we say that these are in themselves bad to\nexperience, apart from the harm they typically bring about by distracting or annoying us?\nSuppose I am the only person who is repelled by a certain sound, and everyone else is indifferent\nto it: if we say that it is intrinsically bad for me but not for others to hear the sound, then we are\npresupposing that it is a person's likes and dislikes that create what is good and bad for him. And\nwe will then have to say that satisfying our whims and urges is good, and in particular, that it is\ngood for the boy in our earlier example to hit the duck. On the other hand, if we say that a grating\nsound is bad for me to hear only if everyone else has the same response, then we have to explain\nwhy the reaction of others should be so important to my good. The most plausible way of\ndisposing of this whole problem is to say that we should not infer from our aversion to something\nthat it is contrary to our good, just as we should not infer from the presence of an urge that it does\nsome good to satisfy it. If we accept this proposal, then we should become doubtful about the\nintrinsic badness of pain. (Kraut, 46)\n\nDUE DATE:\nSES # 4. Late papers will be penalized.\n\nYou may find it helpful to check out this website on critical thinking to help identify arguments:\nhttp://philosophy.hku.hk/think/arg/arg.php\nThis site (part of the same project) characterizes a number of valid argument forms:\nhttp://philosophy.hku.hk/think/arg/valid2.php\nIn particular, note:\nA03.5: Disjunctive syllogism\nA03.7: Reductio ad absurdum"
    },
    {
      "category": "Resource",
      "title": "Second Argument Analysis Exercise",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/033cd26edf0a107dfc9ee97227cfac5c_assn_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n24.02 Moral Problems and the Good Life\nFall 2008\n\nSecond Argument Analysis Exercise\n\nWrite 2-3 pages providing an analysis of the following argument (written by your TAs based on some of\nour recent readings).\n-\nNumber the premises and the conclusion. Articulate each premise and the conclusion in no more\nthan one sentence. Feel free to use a different wording in your statement of the premises and conclusion\nthan is provided by the text. You may not need to use every sentence in the passage in reconstructing the\nargument, and you may need to supply premises that are not explicitly stated in the text given.\n-\nIndicate for each premise whether it is an assumption, or whether it is supposed to follow from\nearlier premises. (This should appear in parentheses after the premise.)\n-\nAfter stating the argument, briefly explain it in your own words, and then comment on its\ncogency: Are its premises plausible? Are the inferences sound? (If not, why not?)\n\nIt's clearly wrong to torture puppies for no reason, even if it's fun. Why? Because it's\nwrong to cause a conscious being great suffering and pain for no reason--even if it\nbrings me pleasure. It's just cruel to do that. Well, you know what else is cruel?\nCastrating a pig without giving it anesthesia. Or cutting off its tail for no good reason.\nYet these are routine practices of factory farms. These farms cause animals a great deal\nsuffering and pain, and not just because animals are killed there (in an often painful and\nnot always quick manner). If that is right, then it would be wrong for me to own a factory\nfarm that does these sorts of things to animals. But if it's wrong for me to do something,\nit's surely wrong for me to pay someone to do it. And when I purchase meat from a\ncompany engaged in factory farming, I am paying that company to produce that meat for\nme. But it's wrong to produce meat in this way. So it's wrong for me to purchase meat\nfrom factory farms.\n\nDUE DATE:\nSES # 12. Late papers will be penalized."
    },
    {
      "category": "Resource",
      "title": "Paper 1",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/0aab1b47c7a104743a7ceb9af5c8247d_paper_1.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n24.02 Moral Problems and the Good Life\nFall 2008\n\n24.02: Moral Problems and the Good Life\nProf. Sally Haslanger\nFIRST PAPER TOPICS\n\nWrite a short (5-7 page) paper on ONE of the following topics. Your paper will be evaluated based on (i)\nthe clarity and soundness of the argument for your thesis, (ii) your demonstrated understanding of the\nreadings and the material covered in class, and (iii) the insight and creativity shown in engaging the issues.\n\n1. It is 2025 and a brilliant neuroscientist at MIT has created Nozick's experience machine. You have a\nyoung child, age 4, and are given the opportunity to place your child in the machine. You want the best for\nyour child. You can define the sort of life experiences you most hope your child to have and to have them\nprogrammed into the machine (you can also have it programmed to erase the child's memory that they were\nput into such a machine). Once your child enters, however, it will be traumatic to leave the machine\nbecause experiencing the contrast between reality and the illusion will be psychologically damaging.\nWould you have your child enter the machine? Why or why not? What goods, if any, would be left out of\nsuch a life? What does this thought experiment tell you about what constitutes a good life?\n\n2. Imagine the following conversation between two parents, concerning their child Rosa, who has just\nstarted college:\nMom: Rosa seems very excited about going to MIT. I know she is hoping to become an engineer, but it\ndoesn't really matter to me what she does, as long as she is happy doing it.\nDad: But that's crazy. Suppose what makes her happy is gambling, or doing drugs, or even something\nridiculous like building sandcastles all day on an ocean beach where they will be washed away by the\nnext tide. Surely she must accomplish something in her life. I want her to become passionate about\nengineering and to use her skills in ways that will really help people. Then she'll have a good life.\nMom: Those examples aren't fair. Gambling and doing drugs don't really make people happy. But if what\nmakes her happy is building sandcastles, that's fine with me. She'll make the best sandcastles in the\nworld, I'm sure. Her grandmother has plenty of money and I'm sure Rosa will be able to support\nherself on her inheritance.\nYou are Rosa's sibling. How would you contribute to this discussion? Taking into account the readings\nand positions we've covered, write a paper arguing for what you think would enable Rosa to have a good\nlife, responding to Mom's and Dad's points.\n\n3. Suppose you found a lamp and upon rubbing it, a genie appeared and gave you one wish that he would\nthen fulfill. However, it was a condition on the wish that your objective in making it is your own well-\nbeing. You wish that all your desires, throughout your life, be satisfied. How exactly should this wish be\narticulated to make it plausible that its fulfillment will give you a good life, e.g., do you want all your\npresent desires to be fulfilled? Is this what you should wish for in order to have the best life? Discuss the\npros and cons of this wish. If it isn't the wish that would enable you to achieve the best life, what would\nyou wish for instead?\n\n4. Like Eleana Makropolis, you have the opportunity to drink a magic elixir and live forever. Would you\ndrink it? Why or why not? If it is possible to live a good life, isn't more of such a life better? Is it possible\nfor immortality - in this world, with ordinary human powers - to be the best choice for a life? (Under what\nconditions?)\n\n24.02: Moral Problems and the Good Life\nProf. Sally Haslanger\n\nGUIDELINES FOR PAPERS\n\n1. All papers should be neatly typed, double-spaced, in an easily readable font. Be sure to include your\nname and your TA's name on your paper. For safety, keep copies of your papers. Please number your\npages. Papers should be turned in at the time and date indicated on the syllabus and on the paper topics.\n\n2. All papers should be within the length guidelines specified. If you have more to say than you can fit\nwithin the page limits, pare down your discussion: make sure you have stayed on topic, focus your\ndiscussion on the most important points for your argument. However, note that because this is a HASS-D\ncourse, you must submit a total of 20 pages during the term.\n\n3. Essay topics must be taken from the list distributed in class, and your paper should be on one topic only.\nStick closely to the topic; be sure you address the question asked. All papers should be clearly organized\naround a thesis, and should provide arguments for it. You may write on a topic of your own design if you\nsubmit a proposal in writing to your TA at least 72 hours in advance of the deadline, and it is approved.\n\n4. If you wish to attribute a position to a philosopher we have discussed, be sure to check that the text\nsupports your attribution. On controversial points you should cite textual evidence, e.g., by quotation, or\nby giving the line numbers of relevant texts in parentheses. It is imperative that you indicate when you are\nquoting or paraphrasing an author, and when you do you must cite references to the original text. Failure to\ndo so counts as plagiarism and will be handled accordingly. However, points made in lecture or in class\nhandouts are \"common property\" for students in this class and may be relied upon in your papers without\ncitation. (For more on plagiarism, see syllabus.)\n\n5. Although quotes are helpful, please keep quotation to a minimum. The paper should be, by in large, in\nyour own words.\n\n6. You do not need to consult additional secondary sources. If you do, this must be acknowledged in the\npaper. If you quote or paraphrase a secondary source, this must be attributed to the author; if you relied on\ntexts in your preparation which were not assigned in class, include reference to them in a bibliography at\nthe end of the paper (even if you don't quote from them). (For more on plagiarism, see syllabus.)\n\n7. Papers are due at the date and time specified. After that time papers will be considered late and will be\npenalized one third of a grade per day, i.e., from a B+ to a B. If you foresee special difficulties with the\ndeadline, speak to your TA well in advance."
    },
    {
      "category": "Resource",
      "title": "Paper 2",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/109849f6d8c71ff6d9a129436f7389be_paper_2.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n24.02 Moral Problems and the Good Life\nFall 2008\n\n24.02: Moral Problems and the Good Life\nProf. Sally Haslanger\nSECOND PAPER TOPICS\n\nWrite a short (5-7 page) paper on ONE of the following topics. Remember, your papers should have a\nthesis and provide an argument to support it. They will be evaluated on the extent to which they address\nthe topic, the degree to which they show an understanding of the material covered in lecture and readings,\nand the strength and originality of the argument. Remember you are required to submit an electronic\ncopy of your paper to your TA.\nPapers are due SES #16.\n\n1. Let's define our moral community as all and only those individuals whose moral worth is equal to that\nof normal adult human beings. What is \"equal moral worth\"? Who and/or what is included in our moral\ncommunity? Only normal adult human beings? All sentient beings? All living beings? All naturally\noccurring things (including mountains and rivers)? What about androids? Extra-terrestrials? Critically\nevaluate a criterion for drawing the boundary of our moral community that was proposed in one of the\nreadings. Would you endorse this criterion as it is? If so, why? If not, why not? Would you suggest a\nfix?\n\n2. Critically evaluate Peter Singer's argument for the claim that we should all be giving large amounts of\ntime and money to famine relief. What is Singer's argument? What are its strengths and weaknesses? Do\nyou agree that you are morally obligated to make a contribution of time or money to address such global\nneeds? In justifying your answer, explain what account of right action you think should govern what you\ndo in response to desperate suffering. If you disagree with Singer, explain what's wrong with the\nargument (e.g., what's wrong with the \"Prevent Suffering Principle\"?); if you agree with Singer, defend\nhis view against what you take to be the strongest objection to it. In answering these questions, consider\nthe Mercy Corps case we discussed in lecture. Recall that they offer a wide range of actions that can be\ntaken to make a difference that can take from one minute to a lifetime, from sending an email, to\nvolunteering your time or money:\nhttp://www.actioncenter.org/take_action\nIf you set aside $.35/day, you can afford to sign up for one of their $10/month programs that provides\nfood and water to those desperately in need, e.g.,\nhttp://www.mercycorps.org/mg/partnersinmercy\nI assume that none of you will suffer greatly if you contribute $.35/day to a charity such as Mercy Corps;\nin Singer's terms, that you will not have to sacrifice anything of moral significance. If this is true, then it\nfollows from Singer's argument that you have a moral obligation to join such a program and make the\ncontributions. (If you are more financially strapped than I think and a contribution of $.35/day would\nrequire you to sacrifice something of moral importance, substitute a minute a day of your time for the\n$.35.) Do you think you should be giving at least this much to famine relief?\n\n3. Critically evaluate the following claim, based on the readings:\nThe first and most fundamental step toward solution of our environmental problems is a clear\nrecognition that our objective is not pure air or water but rather some optimal state of pollution.\nThat step immediately suggests the question: How do we define and attain the level of pollution\nthat will yield the maximum possible amount of human satisfaction? (Baxter, 516)\nWhat view of the value of the environment does this quote suggest? Compare and contrast it to the other\nviews we considered, evaluating the arguments for each. What position do you think is the most\ndefensible and why?\n4. In her essay on world hunger, Onora O'Neill considers what is wrong with coercion from a moral\npoint of view. What is coercion? Give what you take to be a clear example (e.g., being forced at\ngunpoint to give over your money?), and also a case you think is not completely clear. Consider your\n\nexamples in light of O'Neill's characterization of coercion and its wrongs. Does her Kantian analysis\nwork for the cases you provide? Are there other cases you think don't fit her model? Do you agree with\nO'Neill? Why or why not?\n\nYou may also write on a topic of your own design if your TA approves it in advance.\n\nGUIDELINES FOR PAPERS\n\n1. All papers should be neatly typed, double-spaced, in an easily readable font. Be sure to include your\nname and your TA's name on your paper. For safety, keep copies of your papers. Please number your\npages and include a word count. Papers should be turned in at the time and date indicated on the syllabus\nand on the paper topics.\n\n2. All papers should be within the length guidelines specified. If you have more to say than you can fit\nwithin the page limits, pare down your discussion: make sure you have stayed on topic, focus your\ndiscussion on the most important points for your argument. However, note that because this is a HASS-D\ncourse, you must submit a total of 20 pages during the term.\n\n3. Essay topics must be taken from the list distributed in class, and your paper should be on one topic\nonly. Stick closely to the topic; be sure you address the question asked. All papers should be clearly\norganized around a thesis, and should provide arguments for it. On some occasions your TA may\napprove an alternative paper topic. If you are interested in writing on a topic of your own design, speak\nto your TA well in advance of the paper deadline.\n\n4. If you wish to attribute a position to a philosopher we have discussed, be sure to check that the text\nsupports your attribution. On controversial points you should cite textual evidence, e.g., by quotation, or\nby giving the line numbers of relevant texts in parentheses. It is imperative that you indicate when you\nare quoting or paraphrasing an author, and when you do you must cite references to the original text.\nFailure to do so counts as plagiarism and will be handled accordingly. However, points made in lecture\nor in class handouts are \"common property\" for students in this class and may be relied upon in your\npapers without citation. (More on plagiarism, see syllabus.)\n\n5. Although quotes are helpful, please keep quotation to a minimum. The paper should be, by in large, in\nyour own words.\n\n6. You do not need to consult additional secondary sources. If you do, this must be acknowledged in the\npaper. If you quote or paraphrase a secondary source, this must be attributed to the author; if you relied\non texts in your preparation, which were not assigned in class, include reference to them in a bibliography\nat the end of the paper (even if you don't quote from them). (More on plagiarism, see syllabus.)\n\n7. Papers are due at the date and time specified. After that time papers will be considered late and will be\npenalized one third of a grade per day, i.e., from a B+ to a B. If you foresee special difficulties with the\ndeadline, speak to your TA well in advance."
    },
    {
      "category": "Resource",
      "title": "Paper 3",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/ef5273b070e3da18b81089663b0f2a39_paper_3.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBe sure to follow the\n\"Guidelines for Papers\" that appears as page 2 of this assignment and is available on the Stellar\nsite.\nTHIRD PAPER TOPICS\nWrite a short (1500-2100 word) paper on ONE of the following topics.\nAlso recall that you are required to submit 20 pages of written work @ 300 words/page\nduring the term in order to receive HASS-D CI-H credit. Make sure that this requirement is met!\nSubmit an electronic copy of your paper to your TA.\n1. Consider two versions of the following situation:\nA company is hiring a supervisor who will supervise a group of male workers who have\nalways worked for male supervisors. [Clearly] the sex of a candidate for the job is\nrelevant to the candidate's prospects of moving smoothly and successfully into an\neffective working relationship with the supervisees. (Frye, 18-19)\nIn one case, the company doing the hiring is one of the main Boston cab companies; they are\nlooking for a supervisor for their drivers. In the other case, the company doing the hiring is MIT;\nthey are looking for a supervisor for their robotics lab. Would it be permissible for the relevant\ncompany in each case to hire a man instead of an otherwise equally qualified woman? Frye\nintroduced this example to argue that an act can be sexist without it being motivated by sexist\nattitudes. Does your analysis of the case support this conclusion? Why or why not?\n2. There is empirical evidence that cognitive processing relies heavily on unconscious schemas\nthat influence our perception of and evaluation of situations. Schemas concerning race are\nprevalent and negatively affect the evaluation of persons of color in the United States. (For more\ninformation see https://implicit.harvard.edu/implicit/demo/). For the purposes of this paper,\nsuppose that this is true--in other words, suppose that there is such an evaluation bias and that it\nis prevalent. Now, consider the following argument in favor of affirmative action:\nPersons of color are systematically and unfairly disadvantaged in all evaluations in which\nthe evaluator knows the race of the individual. Throughout school and college, students\nare known to their teachers, and most evaluations are of student work whose author is\nknown to the evaluator. Small disadvantages of this sort accumulate: if a student is\nviewed as a B-student rather than an A-student, they will get different sorts of attention,\nopportunities, etc. Affirmative action is necessary in higher education in order to offset\nthese mis-evaluations and to create a level playing field.\nAgain, for the purposes of this essay, you are not being asked to evaluate the empirical research\non schemas and evaluation bias. Your job is to consider whether affirmative action is\npermissible, or even required, as a response to accumulated evaluation bias. If so, what sort or\ndegree of affirmative action would you recommend; if not, what other policy, if any, would you\npropose to offset the disadvantage caused by evaluation bias.\n3. In his essay, \"Liberty and Pornography,\" Ronald Dworkin considers whether it is permissible\nto qualify the right to freedom of speech, e.g., to institute any sort of content-based regulation\n\nwithin the criminal or civil code, in order to prevent or remedy what he acknowledges are\nsignificant harms to women caused by pornography. He says,\n...we must as individuals and nations, choose among possible combinations of ideals, a\ncoherent, even though inevitably and regrettably limited, set of these to define our own\nindividual or national way of life. Freedom of speech conceived and protected as a\nfundamental negative liberty, is the core of the choice modern democracies have made, a\nchoice we must now honor in finding our own ways to combat the shaming inequalities\nwomen still suffer. (112)\nIt appears that on his view, neither inequality nor harm are sufficient justification to limit\nfreedom of speech. Present and explain Dworkin's argument. Then, consider how either a\nconsequentialist (such as Mill) or a deontologist (such as Kant) would object to Dworkin's\nargument. Is the objection you have considered compelling? If yes, why? If no, why not--and\ndo you think there is any other good objection to Dworkin's argument?\n4. California's Proposition 8 was passed in the most recent election (See:\nhttp://www.voterguide.sos.ca.gov/title-sum/prop8-title-sum.htm). Proposition 8 adds the\nfollowing 14 words to the state constitution:\nOnly marriage between a man and a woman is valid or recognized in California.\nExplain what, to your mind, are the strongest arguments in support of this restriction of marriage\nto one man and one woman. Are they sound? What are their strengths and weaknesses?"
    },
    {
      "category": "Resource",
      "title": "A Kantian Approach to Famine Relief",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/fbcd6571d85e9d9042e97815081c7735_lec_14.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n(RR, p. 689)\n(RR, p. 693)\nA Kantian Approach to Famine Relief\nI. Recap\nIn considering systematic approaches to ethics, we considered Utilitarianism/Consequentialism,\nDeontology (Kant) and Virtue Ethics (Aristotle). In considering the problem of global justice and,\nmore specifically, famine, Singer relies on a broadly consequentialist approach. Many find his\nconclusions overly demanding; some have suggested that utilitarianism (and views like it) go too\nfar in valuing impartiality. Do the other approaches to ethics give us further insight into our\nobligations to the distant needy?\nII. The Categorical Imperative\nLet's recall the principles of Kantian Ethics. Remember, the fundamental moral principle for Kant\nis the categorical imperative. He articulates it in several ways. We considered the Principle of\nUniversal Law:\nAct only in accordance with that maxim through which you can at the same time will\nthat it become universal law.\nWhich we restated as:\nYou are No Exception Principle: \"...in whatever you do, you should act for reasons that\ncould serve as acceptable reasons for everyone.\" (Sayre-McCord, 5)\nAnd the Principle of Humanity:\nSo act that you use humanity, whether in your own person or in the person of any other,\nalways at the same time as an end, never merely as a means.\nOr:\nRespect for Persons Principle: In all action one should respect others as sources of value\nand never merely as an instrument for one's own purposes. (Sayre-McCord, 7)\nIII. Respect for Persons\nOnora O'Neill interprets the Principle of Humanity this way (see DMI, p. 468):\nCI 2:\nRight actions are those that are guided by intentions to treat persons as far as possible as\nends in themselves, and never as a mere means, i.e., one must not undertake to involve\nothers in a scheme of action to which they could not in principle (rationally?) consent.\nThis allows that we can use others as a means to accomplish our own ends; after all, we rely\ncrucially on others all the time. However, according to CI2, cheating on your final would be\nwrong because you would be using me (or your TA) as a mere means to a good grade: you would\nbe involving us in a scheme whereby you would get a good grade, but it would be a scheme that\nwe would not--or better: could not reasonably--consent to. On this view the Kantian picture has\na strong negative component comprising the duty of justice:\nDon't treat others as a mere means.\nAnd a positive component comprising the duty of beneficence:\nAs far as possible treat others as ends in themselves, i.e., as a rational person with his or\nher own aims, objectives, goals, conceptions of the good, etc. (DMI p. 469)\nSo, we must never exploit, deceive, or coerce others; but it is a more difficult and complicated\nmatter to figure out how to help others achieve their own ends. People are complicated: we each\nwant and aim for many things and sometimes our goals are even incompatible. So beneficence\n\nmust be selective (DMI 469). Moreover, in treating people as ends, we must be sensitive to human\nlimitation, both cognitive limitations and limitations on our autonomy. O'Neill suggests:\nTo treat one another as ends in themselves such beings have to base their action on\nprinciples that do not undermine but rather sustain and extend one another's capacities for\nautonomous action...Since finite rational beings cannot generally achieve their aims\nwithout some help and support from others, a general refusal of help and support amounts\nto failure to treat others as rational and autonomous beings, that is as ends in themselves.\n(DMI 469)\nIn traditional terms, duties of justice are perfect duties, i.e., they are absolute requirements, the\nviolation of which is immoral. Duties of beneficence are imperfect duties, i.e., they are duties to act\nin ways that further certain ends or goals, but there are legitimate choices about how to do this.\nAnother way to think of it is that corresponding to duties of justice are rights: I have a right to\nbodily integrity and you have a perfect duty to respect my bodily integrity. People have many\nneeds, however, and although you may have a duty to help those in need, it may be morally\npermissible to meet someone else's needs rather than mine. But it would be morally wrong of you\nto ignore everyone's needs but your own.\nWhat is our duty to those who suffer? How should we respond to famine, etc? One way to spell\nout the details would be as follows (see the O'Neill essay):\nFor those who are present during/at the famine:\n-\nNo cheating in a rationing scheme;\n-\nOne must fulfill one's duties towards particular others (e.g., dependents).\nFor those afar:\n- No exploiting, deceiving, or coercing those in dire circumstances;\n-\nAvoid participation in institutions that exploit, deceive, or coerce others. (This may be difficult\nto confirm.)\n-\nDuties of beneficence are strong in times of famine and extreme suffering because there are\nsignificant opportunities to make the pursuit of any ends possible for those who are severely\ndisadvantaged. But one must be selective, and may choose to benefit others closer to home.\nQuestions\n1. Is CI2's construal of what it is to treat someone as a \"mere means\" adequate? Aren't there cases\nin which someone could or would consent, but it still involves exploitation? Can people consent to\nbeing exploited? Can people consent to being treated as a mere means? If so, in these cases, is it\nwrong to use them as a mere means? What might Kant say?\n2. Consider again the Kantian principle: Act so that you treat humanity, whether in your own\nperson or in that of another, always as an end and never as a means only. Is it correct to assume\nthat the duty of beneficence must inevitably be selective, and that we cannot treat everyone as an\nend. If we opted for Singer's program of giving, would that better achieve treating humanity\n\"always as an end\"? What premise in Singer's argument does a Kantian reject?\n3. Are there considerations that stem from the first formulation of the CI that have consequences\nfor famine relief? Consider again: Act only according to that maxim by which you can at the\nsame time will that it should become a universal law. Is there some inconsistency in willing:\nWhen I can enjoy myself through excessive and luxurious consumption, I shall excessively\nconsume (even when many are dying of starvation). Some have suggested that an \"inconsistency\"\nmay result, on Kant's view, when it is a matter of fact that one's maxim cannot be generalized.\nBecause of scarcity and inequitable distribution of resources, as a matter of fact, not everyone could\nexcessively consume. Does this suggest the maxim is not morally acceptable? If not, is there a\nrelated maxim that whose generalization is inconsistent (can you formulate one)? Could a Kantian\nsupport the idea that a more equitable distribution of resources is a duty of justice?"
    },
    {
      "category": "Resource",
      "title": "Animal Rights and Animal Welfare",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/2c465addcdf62b0fd509e2089862fc32_lec_10.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nAnimal Rights and Animal Welfare\nI. Singer's argument\n1. The capacity to suffer (experience pleasure and pain) is the basis for equal consideration in a moral\ncommunity. (481)\n2. Someone is granted equal consideration just in case their welfare counts equally to others regardless of\n\"what they are like or what abilities they have\", though what form our consideration should take\nmay \"vary according to the characteristics of those affected\". (480)\n3. Non-human animals have the capacity to suffer. (483)\n4. Therefore, the welfare of non-human animals should count equally to the welfare of humans.\n5. Therefore, we should make as much effort to avoid causing pain and suffering to non-human animals\nas we do to avoid causing pain and suffering to humans, taking into account the different ways that\nsentient beings can suffer.\n6. Therefore, we should \"make radical changes in our treatment of animals that would involve our diet,\nthe farming methods we use, experimental procedures in many fields of science, our approach to\nwildlife and to hunting, trapping and the wearing of furs, and areas of entertainment like circuses,\nrodeos, and zoos.\" (from original)\nSinger's challenge:\nCan you find some feature that all humans have and no non-humans have that warrants placing humans\nwithin our moral community and non-human animals outside of it, or that allows us to consider human\nsuffering as morally more important than non-human suffering.\nII. Cohen's Defense of \"Speciesism\"\nCohen's first argument against Singer takes issue with his understanding of a moral community (1\nabove), and attempts to meet Singer's challenge:\n1. Rights are claims within a community of moral agents. (486)\n2. The moral community consists of those who can \"comprehend rules of duty, governing all including\nthemselves. In applying such rules the holders of rights must recognize possible conflicts between\nwhat is in their own interest and what is just.\" (486)\n3. Humans have such capacities, non-human animals do not. (486)\n4. Therefore, non-human animals are not part of the moral community. (from 1-3)\n5. Therefore, non-human animals do not have rights. (from 1, 4)\n6. Therefore, there is no moral wrong in treating animals however we want. (? From 5)\nFirst, note that this argument does not defend speciesism if we take speciesism to be the claim that we\nhave moral obligations to members of our species because they are members of our species. In other\nwords, being conspecifics plays no role in the argument. So it seems to be an argument that sets the\nboundaries of our moral community to exclude non-human animals, without being speciesist.\nHowever, second, Cohen's argument, as stated, doesn't meet Singer's challenge. Human infants and\nother mentally compromised humans are in our moral community and are entitled to a full range of rights,\nbut they don't meet the condition set out in (2). So should we conclude, using Cohen's argument, that we\nhave no moral obligations toward them?\nCohen might object that the condition (2) is not adequately represented here. His exact words are, \"[non\nhuman animals] are not beings of a kind capable of exercising or responding to moral claims.\" (486, my\nemphasis) Perhaps he means something broader than (2):\n\n2*. The moral community consists of those who are members of a species whose adult members, under\nnormal conditions, are capable of comprehending rules of duty (etc).\nThis condition would include human infants and the mentally compromised within our moral community.\nBut the argument for (2*) is unclear. Presumably the argument for (2) is that \"Rights arise, and can be\nintelligibly defended, only among beings who actually do, or can, make moral claims against one\nanother.\" (486). The idea is that being part of a moral community involves a kind of moral reciprocity.\nThis supports (2), but not (2*). There are humans who cannot make moral claims against others, for they\nlack the cognitive capacities to do so. The revised version of Cohen's argument is speciesist, in the sense\nthat it relies on a premise that takes species membership to be morally relevant. But to that extent it is\nweak: he provides no basis for the claim that species boundaries, rather than the capacity for reciprocity,\nare apt for carving out the moral community.\nIII. Cohen on suffering\nCohen acknowledges that one might think that it is wrong to cause suffering to non-human animals, even\nif they don't have rights. He says, \"Animals certainly can suffer and surely ought not to be made to\nsuffer needlessly.\" (487) However, he makes two points against Singer's utilitarianism:\n7. Human suffering counts for more than non-human suffering.\n8. Refusing to use animals in biomedical research and for food would cause more suffering overall than\nthe current suffering of animals.\nIn considering (7) we should note that Singer would acknowledge that humans and non-human animals\nare capable of different kinds of suffering. Humans are capable of a kind of emotional suffering, for\nexample, that animals seem incapable of. This is not at issue. What is at issue in (7) is whether an\nexperience of pain or suffering in a human counts for more than that very same pain or suffering in a non\nhuman. It is plausible that putting detergent in a dog's eyes and putting detergent in a child's eyes will\ncause very similar sensations. Does the pain caused to the dog count for less than the pain caused to the\nchild? Why? Singer's idea is that if pain is bad, it is bad because of what it feels like. And by hypothesis\nit feels the same to both. So there is no basis for saying that it is worse for this to happen to the child than\nthe dog.\nBut wait. Is all morality really universal? Don't parents have obligations to their children that they don't\nhave to their neighbor's children? And don't citizens of a nation have obligations to each other that they\ndon't have to citizens of other countries? We will consider this idea further in the next few weeks, but let\nus consider briefly how we might use this to justify special obligations to conspecifics. If we have\ndifferent obligations to different members of our moral community, we should be able to justify the\ndifference based on some morally significant facts about our relationship to them, or else the difference\nwould be arbitrary. For example, one might argue that parents have obligations to their children because\nparents are uniquely situated to meet the child's needs, or that citizens have obligations to each other due\nto jointly participating in a political-legal system. Are there morally relevant facts about our relationship\nwith other humans that justifies speciesism?\nFinally, considering (8), within a utilitarian framework, it is an empirical question whether vegetarianism\nis the morally right choice. Cohen argues that using animals in biomedical research may result in such a\nreduction of pain and suffering overall that it would be justified from a utilitarian point of view. This is\ntrue, though given such empirical calculations it might be even better to use humans in some biomedical\nresearch. Cohen gives no argument to suggest that non-human animals in particular should be used, or\nthat the line between humans and non-humans is morally significant.\nWhat about eating animals? Does the gastronomic value of meat-eating outweigh the suffering and death\nof animals used for food? The Wenz essay argues that we should consider not only the suffering of\nanimals in considering vegetarianism, but also the cost to the environment. Although Wenz's argument\nfocuses on the intrinsic value of ecosystems, a parallel argument could be made in more narrowly\nutilitarian terms: it is bad to have the environment degraded because it causes greater pain and suffering\n\n(hunger, illness due to pesticide use and water contamination, etc). Consider: what would be the\nenvironmental and humanitarian effects of the world moving to a vegetarian diet?\nQuestions to consider:\n1. Is Singer's argument a utilitarian argument? If so, then rights are not part of his moral vocabulary.\nHow does Cohen's rights-based argument engage Singer?\n2. Is the conflict between vegetarians and non-vegetarians really boil down to a difference between\nutilitarians and deontologists? How might a deontologist construct an argument supporting\nvegetarianism (you might want to look at the essay by Tom Regan in the textbook for an example)?\n3. What resources are available in virtue ethics to argue for or against vegetarianism?"
    },
    {
      "category": "Resource",
      "title": "Duty and Famine",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/faa0c20b32756305672bf4bf83ff6735_lec_13.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nDuty and Famine\nI. Duty to Prevent Suffering\nLast week we considered Mill's version of utilitarianism, called Eudaimonistic Utilitarianism,\ncharacterized by what he calls \"the greatest-happiness principle\":\nYou ought always to act so as to maximize happiness, i.e., the right act is the act that results\nin the greatest amount of happiness overall.\nThere are problems with utilitarianism, but it does seem to capture some basic elements of moral thinking,\ne.g., that moral thinking ought to be impartial in how it regards each person's well-being. Drawing on\nthese insights Peter Singer argues that our obligations to those who suffer are much greater than what we\nmight have thought.\nNote that Singer is not aiming to defend utilitarianism itself; the main principle he relies on requires less\nthan full-blooded utilitarianism. His point is to show that there are compelling considerations that raise\ndeep challenges to our ordinary moral beliefs; in particular, he's concerned to show that the line we draw\nbetween DUTY and CHARITY is misplaced. Here's the argument:\n1. Suffering and death from lack of food, shelter and medical care are bad.\n2. PREVENT SUFFERING PRINCIPLE (PSP): If it is in our power to prevent something bad\nfrom happening, without thereby sacrificing anything of comparable moral importance, we ought,\nmorally, to do it.\n- This principle doesn't require that we promote happiness; it simply requires that we prevent bad. It also\nallows that we only have to act if nothing comparably important is at stake.\n- For the principle to avoid collapsing into utilitarianism, we have to introduce the notion of a baseline\n(otherwise, if things are bad simply by being less than optimal, then we'd be required to do everything the\nUtilitarian requires).\n3. The things we'd have to give up in order to make large contributions of money, time, and/or\nenergy to famine relief, are less important (morally speaking) than life, food, shelter, or medical\ncare.\n4. So we ought to make large contributions of money, time, and/or energy to famine relief.\nFurther notes:\n- What we ought to do is not affected by the proximity or distance of those we're aiming to affect. It may\nbe psychologically difficult to identify with others far away, and so difficult to care about them, but that's\ncompatible with its being a moral requirement that I act with their welfare in mind.\n- What we ought to do doesn't depend on whether I alone or millions of us could equally well help out.\nOne might feel less guilty if others are also shirking--but why should this matter morally? Am I less\nobligated to save the drowning child if others are also watching?\nBut is the Prevent Suffering Principle plausible? It would seem to require that we make contributions that\nwould reduce ourselves (and dependents?) to the level of marginal utility--i.e., that level at which, by\ngiving more, I'd be worse off than those I'm aiming to help. This clearly contradicts our ordinary\njudgments, so would require very strong backing--which Singer doesn't try to offer. Instead he suggests a\nweaker principle that seems extremely plausible. Here are the revised premises:\n2*. MODIFIED PREVENT SUFFERING PRINCPLE (MPSP: weaker/moderate version): If it is\nour power to prevent something very bad from happening, without thereby sacrificing anything\nmorally significant, then we ought, morally, to do it.\n\n- example: saving a drowning child only at the cost of getting one's clothes muddy.\n3*. The things we'd have to give up in order to make large contributions of money, time, and/or\nenergy to famine relief, are not morally significant.\n4 (same as before). So we ought to make large contributions of money, time, and/or energy to\nfamine relief.\nII. Duty and Charity\nThe move from the strong to the weak version helps, but it puts added pressure on premise (3*)--are the\nsacrifices we'd have to make morally insignificant? We tend to distinguish DUTY from CHARITY-\nwhat we give to relief organizations here or abroad is morally optional--we're good to do it, but we don't\nreally have to. What (3*) suggests is that many of the things we do with our money, time, and energy, are\nmorally insignificant. If we recognized that aid and assistance to relieve suffering is not morally optional,\nthen our lives would look very different. Singer acknowledges that these demands are out of line with our\nordinary judgments, but thinks it doesn't matter--what matters is what's right not what we ordinarily think.\nBut why should we think that our \"luxuries\" aren't morally significant? If happiness is morally\nsignificant, and they bring us happiness, why aren't they morally significant? What marks the line\nbetween the morally significant and the morally insignificant? Singer seems to think that the only thing\nthat matters morally is suffering and relief from it--as long as you've reached the baseline for a reasonable\nlife, anything more is morally irrelevant. But this is implausible--(and note--strongly anti-utilitarian); a\nlife for everyone at the baseline might be a pretty gloomy existence. Is that what we should be aiming\nfor? Singer could respond--look at the alternative: some people suffer and die when they could be helped,\nwhile others luxuriate in their riches? Is this a morally acceptable situation?\nIII. Lifeboat Ethics\nGarrett Hardin argues for the claim that not only do we have no moral obligation to give relief aid to poor\ncountries, but we are morally obliged not to provide aid. He relies on an analogy with a lifeboat. Do\nthose on a lifeboat have an obligation to bring aboard all others who are drowning? Hardin says \"No.\"\nThe right action is to bring aboard only that number compatible with the safety of those on board, for any\nother action would be to bring about, or at least risk, disaster. He then argues that we shouldn't help feed\nthe starving in poor countries because given the patterns of population growth and limitations on\nresources, like overloading the lifeboat, this will only result in worse consequences down the road.\nObjections:\n1) Are we currently in a lifeboat situation? Are rich countries at their \"carrying capacity\"?\n2) Does it matter if the lifeboat (wealth) was obtained unjustly or immorally?\n3) Is population growth in poor countries the primary cause of famine? Who is responsible for the\nfamine? If we are responsible for inequity in the distribution of resources, should they suffer for it?\n4) Is it plausible that aid to poor countries causes population growth? How does adequate food, education\nand health care affect population growth?\n5) Is it really better to avoid the risk of a slightly worse disaster by allowing a certain disaster?\n6) Suppose we grant that in the future more will die of starvation if we give to famine relief now than will\ndie if we withhold aid. But what are we to make of all the additional years lived and people born between\nnow and then? Many lives will be lost, but many will also be gained.\nHow would Hardin respond?"
    },
    {
      "category": "Resource",
      "title": "Environmentalism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/5ca8306d46daa9391530d3ec2f98f26c_lec_11.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nEnvironmentalism\nI. The question\nAsphalt:\n\"A wealthy eccentric bought a house...surrounded by a beautiful display of grass, plants and\nflowers, and it was shaded by a huge old avocado tree. But the grass required cutting, the\nflowers needed tending, and the man wanted more sun. So he cut the whole lot down and\ncovered the yard with asphalt.\"1\nRedwoods: A recent California governor \"defended the leveling of ancient redwood groves, reportedly\nsaying, \"If you have seen one redwood, you have seen them all.\"\"\nBomber pilot: You are a bomber pilot and need to discharge your payload in order to make it back to\nbase. You can drop your bombs in the open ocean, or on a small uninhabited island that has a\nunique ecosystem. If you drop the bombs in the ocean, you will kill some living things, but\nnot destroy any ecosystem; if you drop them on the island, the island's ecosystem will be\ndestroyed.\nLast human: Same as bomber pilot, but you are the last human.2\nFor many people, both asphalt and redwoods arouse moral discomfort. Why? Is this moral discomfort\ngrounded in a defensible moral framework? In each case, has a moral wrong been committed?\nIn the introduction to the section on the environment in Disputed Moral Issues, Timmons defines 'direct\nmoral standing' as having moral standing based on intrinsic, and not merely instrumental, worth. He then\nasks:\n-\nDo biological entities other than humans and higher nonhuman animals have at least some degree\nof direct moral standing?\n-\nWhat about nonliving things such as mountains and streams?\n-\nIf so, what does this imply about how human beings ought to treat them?\n-\nHow should we weigh the value of humans and the value of other nonhuman beings?\nE.g., what should we do if we can save a species from extinction but at the cost of a\nhuman life? Does it matter what sort of species we're talking about? Why?\n-\nIf protecting the environment causes human suffering, is it morally permissible? How far\nmust humans make sacrifices for the benefit of nature? How far are we allowed to ravage\nnature for our own pleasure?\nFollowing Timmons, we can consider five possible responses to these questions:\nAnthropocentrism: only human beings have direct moral standing. (Baxter)\nSentientism: all and only sentient beings have direct moral standing. (Singer)\nBiocentrism: all living beings because they are living possess direct moral standing.\nEcocentrism: ecosystems, because of their functional integrity, are the primary bearers of direct moral\nstanding. Individuals within ecosystems may have secondary moral standing. (Leopold?)\nEcoholism: ecosystems and some individuals that compose them have direct moral standing.\nAn 'environmental ethic' is a moral position holding that some non-sentient things have direct moral\nstanding.\n1 Asphalt and Redwoods are from Thomas Hill, \"Ideals of Human Excellence and Preserving Natural\nEnvironments,\" in Hugh LaFollette, ed., Ethics in Practice, Blackwell Pub. 2002, p. 654.\n2 Bomber pilot and Last human are adapted from an essay by Peter S. Wenz.\n\nII. Against an environmental ethic\nThe \"anti-environmentalist\" has several arguments that appear to challenge the suggestion of moral\nwrongdoing in the Asphalt and Redwoods examples above. For example:\n1) The wealthy eccentric owns the property and this brings with it the right to do with it as he pleases. A\nsystem of private property is defensible on both utilitarian and Kantian grounds, so he has done nothing\nwrong.\n2) Morality only concerns the effects of actions on people (or sentient beings). If it can be shown that the\nbenefits to humans (or sentient beings) of leveling the redwoods outweigh the costs, then there is no\nreason not to do it. Plants don't have rights; they aren't part of our moral community whose interests\nmust be considered.\nWilliam Baxter offers the following considerations against environmentalism (p. 515):\na) People do not, as a matter of fact, value the environment/ecosystems for their own sake.\nb) It is not clear what the preferences of animals/ecosystems are, or whether they even have preferences.\nc) Animals and ecosystems cannot represent themselves in moral dialogue, and we cannot trust other\n(self-appointed) humans to represent them.\nd) There is no good or bad, right or wrong, in nature. All value is conferred.\ne) There are reasons to protect much of the environment, even if nonhumans lack direct moral standing.\nHumans benefit from a healthy environment, and it is open to each individual to engage in private\naltruism towards animals, plants and the like. So even if nonhumans lack direct moral standing, the\nenvironment won't be completely destroyed.\nArgument from conferred value\n1. Conferred value principle: if the value of X is conferred, then x should not be valued for its own\nsake, but only instrumentally.\n2. The value of things other than humans is conferred.\n3. Therefore, nonhuman things lack intrinsic value and should only be valued instrumentally.\nIs the conferred value principle plausible? Can you think of counter-examples?\nConsider love. When we love something, we confer value on the beloved. What sort of value do we\nconfer? Do we confer only instrumental value? My loved ones are valuable to me by virtue of my love\nfor them. But the value they have for me is not merely instrumental, i.e., it is not simply that their value\nis as means to my ends. I value them for themselves; is the value I confer non-instrumental? This may be\nconfusing because we take humans to have intrinsic value independent of their being loved. Consider a\ndog: I love my dog. In loving my dog, I confer value on him. My valuing him the way I do is not\ncompatible with treating him simply as a means to my enjoyment.\nAre there other principles that justify the claim that only humans (or only sentient beings) have intrinsic\nvalue?\nIII. Environmentalist strategies\na) Invoke religious perspectives, e.g., God created the environment and asked us to be good stewards of it.\nb) Argue that the value of nature is not conferred; or argue that things with conferred value should\nnevertheless be treated with respect (non-instrumentally).\nc) Affirm the intrinsic value of the environment, and endorse a moral view that requires us to maximize\n(consequentialists) or respect (deontologists) intrinsic value.\n\nd) Connect the disposition to respect the environment with other human excellences or virtues.\ne) Develop the world view of \"deep ecology\" (Leopold, Naess).\nIV. Deep Ecology\nThe deep ecology movement attempts to develop a comprehensive worldview in contrast to the\ncontemporary Western anthropocentric view.\nEcological consciousness and deep ecology are in sharp contrast with the dominant worldview of\ntechnocratic-industrial societies which regards humans as isolated and fundamentally separate\nfrom the rest of Nature, as superior to, and in charge of, the rest of creation. But the view of\nhumans as separate and superior to the rest of Nature is only part of larger cultural patterns. For\nthousands of years, Western culture has become increasingly obsessed with the idea of\ndominance: with dominance of humans over nonhuman Nature, masculine over the feminine,\nwealthy and powerful over the poor, with the dominance of the West over non-Western cultures.\nDeep ecological consciousness allows us to see through these erroneous and dangerous illusions.\n(Devall and Sessions, 514)\nThe deep ecology movement emphasizes two principles3:\n1) Self-realization: spiritual growth requires us to overcome the idea of self as a separate ego. We must\nidentify with others and see ourselves as just a small part of a larger whole. Ultimately, we must not only\nidentify with others in our species, but the cosmos as a whole.\n2) Biocentric equality: all things are capable of and have an equal right to self-realization. We should\nlive simply in ways that have minimal impact on nature. Consumer culture encourages desires and\nsupposed \"needs\" that are harmful, and we should instead seek harmony with Nature.\nQuestions:\n-\nWhat are the moral principles underlying the deep ecology view?\n-\nWhat empirical claims are being made and what evidence is relevant to evaluating the view?\n-\nDeep ecologists are suggesting a change in world-view. How should we evaluate world-views?\nAre there rational grounds for adopting one world view or another?\n3 See Bill Devall and George Sessions, \"Deep Ecology,\" Social Ethics 6th edition, ed. Thomas A. Mappes and Jane\nS. Zembaty, McGraw-Hill, 2002, pp. 513-521."
    },
    {
      "category": "Resource",
      "title": "Free Speech and Pornography",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/e1b1554795e68696098f6590ef4d3ce6_lec_20.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n(\nUnder recommended readings on Stellar and on Google Books.)\nFree Speech and Pornography\n1. Arguments for free speech\nThere are several different ways to support relatively unrestricted freedom of speech:\n1) Freedom of speech promotes the greater good/maximizes utility (John Stuart Mill).\n2) Freedom of speech is a basic liberty/right (Dworkin).\n3) Freedom of speech is a prerequisite for genuine democracy.\n2. Mill's arguments for freedom of speech\nSee, J. S. Mill, \"On Liberty.\"\nThe Harm Principle (HP): Coercive intervention (either by legal measures or social\nnorms) in an individual's conduct is permissible only to prevent harm to others.\nMill's defense of the HP rests entirely on the utility of the principle. He does not argue that\nliberty is a fundamental right that trumps all others. So if someone could show that promoting\nother values, e.g., equality, over liberty had greater utility or promoted the general welfare, he\nwould have no basis for complaint. Also, those who reject the idea that the rightness or\nwrongness of a policy is determined entirely by its good or bad consequences would also have\nreason to question his defense of the HP.\nMill provides two arguments to support freedom of speech:\nUtility of Truth:\ni)\nTruth is useful, and we are better off, generally, believing truths.\nii)\nThe opinion of the minority (even a minority of one) may be true.\niii)\nIf we limit the expression of someone's opinion, we are assuming infallibility.\niv)\nNo one is infallible.\nv)\nWe ought to allow the expression of all opinions.\nEven if we are confident that the opinion of the minority is not exactly right, it might be partly\ntrue and provide for us further information that we need in order to gain the truth.\nValue of Reasoned Belief:\ni)\nIt is important that we hold beliefs not on the basis of mere prejudice, but for good\nreasons. (Being \"intellectually alive\" is a human good.)\nii)\nThe expression of conflicting points of view helps us articulate the content and basis for\nour beliefs.\niii)\nWe ought to allow the free expression of all opinions.\nNeither argument supports absolute freedom of speech, e.g., yelling \"Fire!\" in a crowded\ntheatre when there is no fire may be restricted, as can false advertising of various sorts. What\nother speech is harmful? What other speech is it permissible to limit or control?\nII. What is pornography?\nLongino: \"Pornography...is verbal or pictorial material which represents or describes sexual\nbehavior that is degrading or abusive to one or more of the participants in such a way as to\nendorse the degradation.\"1\n-\nNote contrast with erotica.\n-\nWhy include \"endorsing degradation\"?\n-\nIn what sense does ordinary pornography \"endorse degradation\"?\n1 Helen Longino, \"Pornography, Oppression and Freedom: A Closer Look\".\n\n-\nIs this an adequate definition? Would Garry agree? Why or why not?\nIII. Feminist Anti-porn Considerations\n1. Pornography, especially violent pornography, is implicated in the committing of crimes of\nviolence against women.\n2. Pornography is the vehicle for the dissemination of a deep and vicious lie about women, e.g.,\nthat they are inferior to men, that they are sex objects and proper subject of sexual domination.\nIt is defamatory and libelous.\n3. The diffusion of such a distorted view of women's nature in our society as it exists today\nsupports sexist (i.e., male-centered) attitudes, and thus reinforces the oppression and\nexploitation of women.\n4. Pornography itself subordinates women\n5. Pornography itself silences women.\nNote contrast with analysis of pornography as \"obscene\" or \"indecent\".\nIV. Censorship: Prior-restraint v. civil rights approach\nObscenity law is a criminal law. It is initiated by a police officer and the state prosecutes due to\nthe moral offense to the community. It is tried in the criminal courts and the punishment can be\nimprisonment, monetary fines, censorship.\nAnti-pornography ordinances are civil laws. (Such ordinances have been passed and vetoed in\nMinneapolis (1983-4) and passed in Indianapolis 1984. In Hudnut v. American Booksellers\nAssn (1985), the Ordinance was struck down by the US Court of Appeals. The Supreme Court\nrefused to hear the case). In case of a violation of a civil law, the complaint or lawsuit is brought\nby the plaintiff with a cause of action; the claim is based on injury to the victim. It is\nadjudicated by a human rights commission or tried in a civil court. Remedies are money\ndamages and/or injunctions.\nV. Against the Civil Rights Approach: upholding negative liberty (Dworkin)\n-\nFreedom of speech is a negative right and includes the freedom to offend. (110)\n-\nIt would be legally permissible to argue directly for women's inferiority, or for\ndepriving them of civil liberties. How could it then be an argument against\npornography that it has the same content? (111)\n-\nIt is implausible that pornography has the harmful effects attributed to it. (111)\no\nBut what about the Attorney General's Commission report?\n-\nEven if pornography violates some positive liberties, democracies are entitled to make a\nchoice between protecting negative liberties even if they violate some positive liberties,\nor not. Our democracy has made the choice to protect speech, even at the cost of\nequality. (112)\n-\nEven if pornography results in some members of society not feeling free to speak, this is\nnot a violation of their liberty to speak. (112-3)"
    },
    {
      "category": "Resource",
      "title": "Gay Marriage",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/349a56020b4615871dd8c042235f97aa_lec_25.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nGay Marriage\nWe should consider two issues:\n- Are there good arguments in support of legalizing same-sex marriage that do not simply rest on\ndemands of formal equality?\n--We need such arguments because formal equality doesn't establish that the institution\nof marriage is good.\n- Are the arguments in support of same-sex marriage ones that express values that should be\nbroadly endorsed?\nArguments supporting gay and lesbian marriage:\nI. The value of marriage as normative ideal for all\nII. The potential of gay marriage for undermining traditional gender norms\nIII. Reversing the unjust displacement of gays and lesbians\nI. Marriage as normative ideal (MANI)\n1. The state has an obligation to promote \"valued ways of living\" (110)1 .\n2. \"[Marriage] is the normative ideal for how sexuality, companionship, affection, personal\neconomics and child rearing should be organized.\" (110)\n3. Marriage promotes \"personal and social flourishing\" in ways that are indifferent to the\ngenders or sexualities of the couple.\n4. So, the state has an obligation to promote both homosexual and heterosexual marriage.\nConservative objections to MANII:\nReject (3). Gay and lesbian sex is not good for the individuals who participate in it, and gay and\nlesbian families are not good for society.\nBut, isn't it better to encourage rather than discourage gays and lesbians to enter into\ncommitted, monogamous relationships?\nAnti-marriage objections to MANI:\n- Reject (2): Marriage is a questionable institution that has a long problematic history.\nCalhoun: but marriage--as a social and legal institution--has evolved, and many of the\nproblematic features of marriage are gone, e.g., a woman no longer loses her property\nwhen she is married and becomes the property of her husband. It is open to us to endorse\nmarriage and also rethink what rights and expectations marriage brings with it; this has\nbeen the approach of many heterosexuals for some time (113). Moreover, heterosexuals\nare able to have egalitarian marriages, why shouldn't we expect gays and lesbians to do\nso as well?\n- If the state undertakes to promote long-term stable relationships, it will also have to make\ndivorce more difficult to obtain, etc. Stability of relationships will take priority over other more\nimportant goods and women will become more vulnerable to domestic violence.\nCalhoun's objections to MANI:\nReject or modify (1): the State should not be in the business of promoting one and only one way\nof organizing one's intimate life (112-4) The state should leave open the possibility of forming\nmany different kinds of families, economic units, childrearing collectives, sexually intimate\nrelationships. What rights come with marriage should be a matter of ongoing debate.\n1 Page numbers from Cheshire Calhoun, \"Defending Marriage,\" in Feminism, the Family and the Politics of the Closet,\nOxford Univ. Press, 2000, Ch. 5.\n\nII. Undermining traditional gender norms (2 arguments)\nVersion 1 (combating male domination) - UGN1\n1. Our society suffers from the injustice of male domination.\n2. Male domination is supported by the strict separation of gender roles and the gendered\ndivision of labor.\n3. Gay/lesbian marriage challenges traditional gender roles.\n4. Gay/lesbian marriage challenges male domination.\n5. Permitting gay/lesbian marriage is an effective way to combat injustice.\n6. So gay/lesbian marriage should be legal.\nAdvantages over previous argument: doesn't presuppose one form of marriage or one way of\nstructuring our intimate relationships (116).\nConservative objections to UGN1:\nReject (1) or (2). (1) suggests that we currently live under conditions of male domination, but\nthis is hyperbolic. Moreover, having distinct gender roles does not support male domination. It\nis possible to have a society in which the genders are separate but equal.\nAnti-marriage objections to UGN1:\nReject (5): This argument gives reasons for heterosexuals to endorse gay/lesbian marriage, since\nit will provide those who comply with traditional gender norms greater opportunities to break\nfree. It provides little or no motivation for gays and lesbians to endorse gay/lesbian marriage,\nsince by hypothesis, gays and lesbians already resist traditional gender norms. So it won't\nadequately address the injustices done to gays and lesbians.\nBut: the goal is to undermine male domination, and there are aspects of male domination\nthat affect those who live outside traditional gender roles.\nCalhoun's objections to UGN1:\nReject (3): The dominant understanding of homosexuality has been, at least since the 19th century,\nthat gays and lesbians are essentially different from heterosexuals. \"...lesbians and gay men\nhave, for the past hundred years, been constructed as a kind of naturally fixed third sex for whom\ngender deviance is a uniquely constitutive and unavoidable part of their nature\" (119). So the fact\nthat gays and lesbians resist traditional gender roles is not a threat to those roles. It is likely that\nheterosexual marriage will remain pretty much as it is, even if gay marriage becomes legal.\nVersion 2 (combating male domination and heterosexism) - UGN2\n1. Our society suffers from the injustice of male domination, an injustice that is manifested also\nin heterosexism.\n2. Male domination is supported by the idea that \"real men\" and \"real women\" are heterosexual,\nand homosexuals are \"unfit\" for participation in society.\n3. Gay/lesbian marriage challenges the idea that gays and lesbians are \"unfit, and so too the idea\nthat \"real\" men and women are heterosexual.\n4. Gay/lesbian marriage challenges both male domination and heterosexism.\n5. Permitting gay/lesbian marriage is an effective way to combat injustice.\n6. So gay/lesbian marriage should be legal.\nCalhoun's objections to UGN2:\nThis argument doesn't adequately address the fact that gays and lesbians are stereotyped by the\nidea that \"gay and lesbian sexuality is dangerously uncontrolled, predatory, insatiable,\nnarcissistic, and self-indulgent\" (121). As a result, gays and lesbians are considered \"unfit for\nassuming gendered familial roles and producing properly gendered children, they are incapable of\n\nsustaining long-term stable relationships, pose a sexual threat to their own and others' children,\nand risk reproducing their own defects in a second generation\" (122).\nIII. The Unjust Displacement of Gays and Lesbians\nA central argument for DOMA (Defense of Marriage Act) was this:\n1. Marriage--understood as between one man and one woman--is a pre-political foundation for\nsociety.\n- The state does not create marriage. It exists logically prior to the state, since it is the\nbasis for any society.\n- The state depends crucially on marriage for its existence, so it must recognize it.\n2. Those who are \"fit\" for establishing the foundation of society should have a special status.\n- Those who are \"unfit\" are \"inessential citizens\" (124).\n- \"Whatever social contribution they might make to civil society depends on the\nantecedent marital and familial labor of others\" (124).\n3. Gays and lesbians lack the special status of \"essential citizens\", and same-sex relationships\nare not merely a \"lifestyle choice\".\n4. Taking a permissive attitude towards same-sex relationships weakens the society. (125)\n5. Legalizing same-sex marriage is neither just nor beneficial.\nCalhoun's argument supporting same-sex marriage is structured as a response to this DOMA\nargument.\n1. Gays and lesbians are unjustly viewed and treated as \"inessential citizens\".\n2. Allowing gays and lesbians to legally marry will be a way of viewing and treating them as\nessential citizens.\n3. So same-sex marriage should be legal.\nWe have two conceptual options:\nA. Continue to treat marriage as a pre-political institution, but include gays and lesbians in\nsociety's foundations.\nB. Treat marriage as a \"lifestyle\" choice and grant gays and lesbians rights similar to rights to\nother voluntary associations.\nConservative objections:\nThe DOMA argument is sound and premise (1) of Calhoun's argument should be rejected."
    },
    {
      "category": "Resource",
      "title": "Goodness and Rational Desire",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/70f45bd26bcbbaf5455daebc9b4c9636_lec_03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nGoodness and Rational Desire\nI. Recap\nBentham's Hedonism\nThe best life is the life that scores highest according to the hedonic calculus, i.e., the one that will\noffer the most intense, durable, fecund, pure, and probable pleasures, taking into account the\ndistribution of pleasures and pains over time. In other words, \"It's all about pleasure.\"\nNon-Hedonic Accounts\nThere's more to a good life than just pleasure. Nozick's discussion even suggests that there's more\nto a good life than what we get in experience.\nII. Satisfaction of Desire\nBut what else is there? It seems that even such things as happiness, health, and knowledge are\ngood for you only if you want them. This has led some to endorse internalism about well-being:\nInternalist Principle: How things go for X is determined--to some substantial degree--by what X desires.\nInternalism recommends the following account of the good life:\nDesire Satisfaction Account: What is good for me is the satisfaction of my desires.\nIII. Rational Desire?\nCan we criticize desire? It seems clear that we can criticize instrumental desires, i.e., desires for\nthings that are instrumentally good (why?); but can we criticize desires that aren't for things\nviewed as means to a further good? David Hume would say that there is no basis for criticizing\nsuch desire. He says:\nWhere a passion is neither founded on false suppositions, nor chooses means insufficient\nfor the end, the understanding can neither justify nor condemn it. It is not contrary to\nreason to prefer the destruction of the whole world to the scratching of my finger. (See\nBrandt, p. 623).\nBut consider:\nDesires for Bad/Immoral Things\nChildish Desires\nWhimsical Desires\nFar-Future Desires\nSelf-Destructive Desires\nMisguided Desires\nImpossible Desires\nIV. Brandt's theory\nRational Desire Satisfaction Account: What is good for me is the satisfaction of my rational desires,\nwhere a desire is rational if it would survive exposure to all relevant, available information in \"an\nideally vivid way\". (623-4)\n- \"all relevant available information\" - all information theoretically available to me via the\nscientific theories and methods of my time.\n24.02\n\n- \"ideally vivid way\" - the person gets the information when alert, with plenty of vivid detail,\nand \"with no hesitation or doubt about its truth\". The information may need to be repeated.\nProblem 1: Why restrict the basis for critique to \"all relevant available information,\" i.e. to what\nscience has currently established? Why not allow all true facts to be a basis for critique, even if\nscience hasn't yet established them?\nProblem 2: Does exposure to truths really bring about correction of belief and desire?\nV. Further developments of the view\nI myself am pretty limited. Instead of considering how I would in fact respond to additional\ninformation, perhaps we should consider how Super Sally would respond if given all the facts.\nThis is view is elaborated by Peter Railton in his \"Moral Realism\".\nSouped-Up Agent's Rational Desire Account: What is good for me is what my souped-up self would\nwant for me, given knowledge of the relevant facts.\nVI. Challenge for any desire satisfaction account.\nWe saw above that part of what is appealing about the desire satisfaction accounts is that they\nlocate what is good for me in my desires, i.e., in something important about me. This was\narticulated as:\nInternalist Principle: How things go for X is determined--to some substantial degree--by what X desires.\nBrandt illuminates, however, that desires should be weighted differently if we are considering a\nperson's good. How the world is - the facts - matter to what's good for me. This suggests another\nprinciple:\nEpistemic Principle: How things go for X is determined--to some substantial degree--by how clued in X\nis about the facts, i.e., by how much information X has, how well X can integrate information about how the\nworld works, etc.\nVII. Loeb's challenge:\nDon Loeb argues that full-information accounts of the sort we're considering can accommodate\neither the internalist principle, or the epistemic principle, but not both.\nOn one hand, a view such as Brandt's does well in accommodating the internalist principle--\nwhat's good for me is a matter of how I would respond if given more information. But it doesn't\nadequately accommodate the epistemic principle: why shouldn't we consider more information\nthan I could, in fact, incorporate into my reasoning? If we're trying to capture what's good for me,\nsuch information is relevant.\nOn the other hand, a view such as Railton's does well in accommodating the epistemic principle,\nbut what comes to matter is not my desires, but Super Me's desires. Part of the appeal of internalist\naccounts is that they explain why we are motivated to pursue our own good: we're motivated\nbecause what's good for us is grounded in our desires. But if we're not talking about our desires,\nbut the desires of souped up versions of ourselves, then this advantage is lost.\nQuestion: Is there a way to balance the demands of the internalist and the epistemic principles that\nwill yield an acceptable account of a person's good?\n24.02"
    },
    {
      "category": "Resource",
      "title": "Hate Speech and Free Speech",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/48e3bf03d27a795738cebabd703f68cb_lec_19.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nHate Speech and Free Speech\nSome have argued that it is permissible to regulate hate speech because it is harmful when it\ntargets subordinate groups. One question is how to define hate speech. Another is whether\nregulation of hate speech is consistent with the First Amendment, or more generally, whether it\nis in keeping with the moral principles that underwrite the Constitution. The basic idea,\nhowever, is that sometimes speech--especially the use of slurs and epithets--is used to degrade\nor demean members of subordinated groups, and so is not acceptable in a society that affirms\nthe equal moral standing of all its members. How should the values of liberty (freedom of\nspeech) and equality be balanced?\nI. What is hate speech?\nA. Examples (all from actual incidents...I did not make these up):\n-\nA message scrawled on a mirror of an African-American's dorm room: \"African\nmonkeys, why don't you go back to the jungle?\" (Gale)\n-\nIn an email: \"Why don't you take your fat slant eyed head and go back to China?\"\n-\nA letter to a Jewish student reading: \"You Jews better get out of Maine before we blow\nyou up.\"\n-\nAnother, found nailed to the front door of a home belonging to an African-American\nman, showed a hooded member of the Ku Klux Klan with the words \"We're back\"\nunderneath.\n-\nTo Margaret Cho in an email: \"...how about coming down to my pig farm. You look like\nsome good stock to breed with my pigs. In fact, if I have one that looks exactly like you I\ncan sell more pigs to the Chinatowns across the U.S.\"\n-\nIn an email to an activist mailing list ('*'s added by me): \"Hello there. I just want to tell\nyou that I disagree with what you have to say. I am the one and only Adolph Hitler\nand guess what: I'm BACK!!!!! I'm going to come and incinerate every last one of you\nk*k* bastards. I hate all f***ing jews and n***ers. I made a mistake by not killing every\none of you bastards last time. I have a question for you: Do you think it's a coincidence\nthat there are all of these hate groups all over the world? I guess the jews are right and\neveryone else is a f***ing stupid bigot. WRONG!!!! The jews are the problem and I am\nthe answer. The fires of Auschwitz will burn again and your f***ing k*k* ass will be the\nfirst to burn...\nLove,\nAdolf \"The Jew Killer\" Hitler\nPS - I'm having a barbeque on Sunday - would you like to be the main course?\"\nB. Speech act theory\nLocutionary force: the literal meaning of the utterance.\nPerlocutionary force: the impact or effect of the utterance. E.g. her comment intrigued (bored,\nexcited, angered) me.\nIllocutionary force: the act conventionally performed in making the utterance. E.g., ordering,\nwarning, christening.\nSubordinating speech acts: \"Whites Only\" sign.\n\nC. Stanford University's definition of \"harassment by vilification\":\nSpeech or other expression constitutes harassment by vilification if it:\na) is intended to insult or stigmatize an individual or small number of individuals on the\nbasis of their sex, race, color, handicap, religion, sexual orientation, or national and ethnic\norigin; and\nb) is addressed directly to the individual or individuals whom it insults or stigmatizes; and\nc) makes use of \"fighting words\" or nonverbal symbols. (Lawrence 122)\nQuestions:\n-\nWhat counts as a \"slur\" or \"epithet\"? Are there cases in which something should count\nas hate speech although it does not include a \"slur\" or \"epithet\"?\n-\nDoes this definition respect the legal distinction between content-based restrictions and\n\"time, place and manner\" restrictions? How?\nII. Regulation of speech\nA. The First Amendment only applies to government action, not to private parties. I can ask\nyou to leave my party if you use a racial epithet without violating the First Amendment.\nInstitutions receiving federal money (such as universities) fall within the scope of government\naction.\nB. Arguments for and against regulation fall within familiar consequentialist and deontological\nframeworks.\nC. Arguments against regulation:\ni) Slippery slope/chilling effect on unobjectionable speech: If censorship is allowed, then over time,\nthis will have a chilling effect on the legitimate expression of ideas and may eventually erode a\ncommitment to freedom of speech.\n-\nIs this also true of other laws? Once we prohibit harmful behavior, such prohibitions\nwill expand to prohibit other sorts of behavior? Is there an especially slippery slope in\nthe case of speech?\nii) Speech is not action; speech is not directly harmful: Laws against wrongful behavior (rape,\nassault, etc) protect individuals from direct harm. Speech only harms individuals indirectly: the\nharmful \"effect of hate speech, if it exists, is only indirect; hate speech is harmful only because\nof its impact on others who are then led in turn to commit acts of violence or discrimination.\"\n(Arthur 130).\n-\nHate speech is more like a \"slap in the face\" than a conversation. \"The injury is\ninstantaneous.\" (Lawrence 122)\n-\nSpeech act approach suggests that words can directly subordinate. If we take a\ndeontological approach, we can identify wrongs in hate speech other than causing harm.\niii) The best response to problematic/harmful speech is more speech.\n-\nBut doesn't hate speech silence the target group?\nQuestions:\n-\nDo universities have special reasons to manage speech? What are those special reasons\nand how do they affect the legitimacy of speech codes?\n-\nWould unregulated speech promote freedom of speech?\nFurther information:\nIn Corry v. Stanford University the court held that the Stanford speech code was too restrictive.\nSee: http://www.ithaca.edu/faculty/cduncan/265/corryvstanford.htm"
    },
    {
      "category": "Resource",
      "title": "Intrinsic Value and the Environment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/8ead81814727020c5511b130dcfe2a75_lec_12.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nIntrinsic Value and the Environment\nI. Environmentalist strategies\n-\nAffirm the intrinsic value of the environment, and endorse a moral view that requires us to\nmaximize (consequentialists) or respect (deontologists) intrinsic value. (See Paul W. Taylor's\npiece in DMI)\n-\nConnect the disposition to respect the environment with other human excellences or virtues:\n\"Rather than argue directly with destroyers of the environment who say, \"Show me why what I\nam doing is immoral,\" [instead] ask \"What sort of person would want to do what they propose?\"\n(Hill, 544)1\nII. Enviromentalism and Intrinsic Value (Taylor)\n\"The ethics of respect for nature is made up of three basic elements: a belief system [the\n'biocentric outlook'], an ultimate moral attitude, and a set of rules of duty and standards of\ncharacter.\" (527)\n1. If something has intrinsic worth, then we are morally obligated to protect it and further its good for its\nown sake. (523)\n2. The environment and living things within it have intrinsic worth.\n Without reference to any other entity, a living thing can be benefited or harmed. Living things\nhave interests, and morality concerns a respect for things' interests. (523)\n The biocentric outlook is consistent and reasonable. This outlook consists of the following\nclaims:\no\nHumans and other living things are equally members of the Earth's community of life.\n(527)\no\nThe sound biological functioning of each part of the ecological web depends on the sound\nfunctioning of all other parts. (527)\no\n\"Each individual organism is conceived of as a teleological center of life, pursuing its\ngood in its own way.\" (527)\no\nThe claim that humans are superior to other living things is groundless. (528)\n*\nTo judge the value of something, one must not evaluate its merits, but its worth.\n*\nTo evaluate the worth of something, one must consider it in its own terms.\n*\nTo evaluate living things in human terms does not establish their worth.\n*\nIt is arbitrary to view other living things as less worthy than humans, for each\npart of the ecosystem has its own good and its own worth.\n\"We begin to look at other species as we look at ourselves, seeing them as beings\nwhich have a good they are striving to realize just as we have a good we are\nstriving to realize. We accordingly develop the disposition to view the world\nfrom the standpoint of their good as well as from the standpoint of our own\ngood.\" (531)\n3. Therefore, we ought to protect and further the good of all living things for their own sake.\n1 Thomas E. Hill, Jr. \"Ideals of Human Excellence and Preserving Natural Environments.\" In DMI, p. 542.\nRecommended, not required reading.\n\nIII. Environmentalism and Extrinsic Value (Thomson)\nAn acceptable ethics must be consistent, non-vacuous (not everything can be intrinsically valuable), and\nprovide us with a way of deciding what we ought to do.\nEnvironmental ethics fails on two of these criteria.\n1) It fails to draw a clear line between what is intrinsically valuable and what is not, so anything and\neverything could be intrinsically valuable. (535-537)\n2) It fails to give us clear guidance about how we should treat things that are intrinsically valuable,\nespecially if we cannot further the good of all intrinsically valuable things. (538-540)\nInstead, we can build our ethics around the value of individuals who have a point of view and interests,\nneeds and preferences of those individuals. We can extend this ethic to care for the environment because\n\"We might be able to argue that something is valuable and therefore ought to be preserved because our\nlives and our conception of ourselves will be enhanced - in a spiritual sense - if we learn to appreciate it\nfor what it is and learn how to live with it in harmony...this approach permits us to define a new\nconception of what we are as individuals and what a good life is.\" (541)\nIV. Virtue and the Environment (Hill)\nWe may think it a virtue to appreciate nature. The question is why? Is this defensible?\nHill suggests:\n...though indifference to non-sentient nature does not necessarily reflect the absence of virtues, it\noften signals the absence of certain traits which we want to encourage because they are, in most\ncases, a natural basis for the development of certain virtues. (544)\nWhat virtues?\n1) Proper humility\n2) Self-acceptance\n3) Aesthetic sensibility\n4) Gratitude\nHill is clear to note, however, that:\n-\nThe appreciation of the environment that provides evidence of these virtues is not merely a matter\nof scientific knowledge of the natural world.\n-\nThe connections between respect for the environment and these virtues are not logically\nnecessary, but may be psychologically almost universal."
    },
    {
      "category": "Resource",
      "title": "Is Death a Misfortune?",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-02-moral-problems-and-the-good-life-fall-2008/d880650eba4a16c4284567ea3fb2e349_lec_05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.02 Moral Problems and the Good Life\nFall 2008\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nIs Death a Misfortune?\nI. Two questions\ni) Consider what makes a life good (pleasure, happiness, achievement...?). Is it such that more of it\nwould make the life better?\nii) Is life itself valuable? Is it always good to have more life?\nII. Immortality\nSuppose death is a complete extinction and we in no sense survive our deaths. Consider someone who is\nliving a good life and is healthy. Death comes suddenly and painlessly. The question arises, is death a\nmisfortune for the one who dies? The Epicureans--Lucretius (b. ~99 BCE) being one--thought that\ndeath is not a misfortune. Here are some themes that can be found in their writings:\n1. Being dead is no worse than not having been (or not yet being) born. (Lucretius, On the Nature of\nthe Universe (ONU), lines 865 and 970)\n2. No prolongation of life can reduce the amount of time spent dead. (ONU, line 1085)\n3. An infinite life-span would be no more pleasant/desirable than a finite one (maybe worse?).\n(ONU, lines 978-1038)\n4. We will not be around to \"experience\" being dead; one who does not exist cannot be unhappy,\ncannot be harmed. (You will not be there to mourn your own passing or to yearn for life.)\n(ONU, approx line 860, E, p. 29)\nThe Epicureans believe that nothing be bad for someone without being positively unpleasant for him/her.\nThey are hedonists. But, how might we evaluate the misfortune of death if we reject hedonism and accept\none of the other accounts of the good life, e.g., desire satisfaction or objective list? What would we say:\nWilliams contrasts:\nConditional desires: desires I have for something, if some condition or other holds.\nCategorical desires: desires for things that I want unconditionally.\nI have some categorical desires for my life: I want to travel to Africa. It is not the case that I want to\ntravel to Africa, if I'm alive. Rather, I want to be alive so I can travel to Africa. Williams argues that part\nof what is wrong with death is that it prevents my categorical desires of this sort from being fulfilled.\nAnd life itself is not worth living unless I have some categorical desires beyond the mere desire to live.\ni) Death is bad because it frustrates my desires (my desires can't be satisfied if I'm dead).\na. Death is bad because it frustrates my conditional desires.\nb. Death is bad because it frustrates my categorical desires. Williams\nii) Death is bad because it frustrates my desire to live. is this desire categorical?\nHowever,\na) Notice with Lucretius that we are deprived of possible experiences, opportunities, etc. that\nmight have occurred had we lived earlier, in addition to ones that might occur if we could live longer than\nin fact we will (see (1)). Is there any reasonable basis for caring more about the possibilities we will miss\nafter death rather than the ones we have already missed before birth? If Williams' view is right, should\nwe reject (1) (or (3))?\nb) Is every deprivation of opportunities a misfortune? Does it matter how remote the possibilities\nare? Suppose someone has many wild and unrealistic desires. Is death worse for him or her than for\nsomeone whose desires are more modest? Think about the desire satisfaction account of the human good.\n\nIs Williams presupposing it? How might we use the discussion of the desire satisfaction account to\nstrengthen his view?\nc) If death is a misfortune for the one who dies, then who suffers it (see (4))? And when? If the\nsubject goes out of existence upon death, then there is no one around who can be the proper subject of the\nsupposed misfortune.\nIII. What's so good about immortality?\nConsider Elina Makropulos (a character in a play by Karel Capek). Williams suggests that EM's case\nshows that \"it can be a good thing not to live too long\" (83), even if one is not suffering.\nIn considering the good of immortality, Williams points out two conditions that must be satisfied (91):\ni)\nIt should clearly be me who lives forever.\nii) The state in which I survive should be one which, to me looking forward, will be adequately\nrelated, in the life it presents, to just those aims which I now have in wanting to survive at all.\nIn his discussion, Williams considers several models for understanding what an immortal life might be\nlike:\na) I continue indefinitely with the same character.\nb) I continue with changing character--a series of characters.\n-\nHow is this different from reincarnation?\n-\nAre the sequential persons all me?\nc) I continue with changing character but continuous memory (Teiresias model, p. 94)\nd) I continue with the same character in a better--perhaps ideal--world.\nRe (a): Williams argues that the result would be, as in EM's case, boredom, alienation, detachment.\n-\nDoesn't it depend on one's character? Would some characters do better than others?\n-\nHow are we to take into account the failings of memory? Suppose I can never remember, except\nin the most vague way, what happened more than 75 years ago. Would I get bored?\nRe (b): What degree of continuity of character is required for the future parts of the life to be mine...for\nthe person to be me?\n-\nIf it doesn't matter how my future states/experiences look to me now--because I will have\nundergone so much change--then condition (ii) above isn't satisfied.\n-\nBut don't many of us disregard the impact of our current actions on our future selves? Do we\nreally care about what our future selves will feel?\nRe (c): \"Teiresias cannot have a character, either continuously through these proceedings, or cumulatively\nat the end (if there were to be an end) of them: he is not, eventually, a person but a phenomenon.\"\n(94)\n-\nWhat does he mean by this, and why does he think it is a problem? Aren't we capable of\nchanging important features of our character in the course of a normal human life? Why can't\nthis happen gradually over an infinite life?\nRe (d): Nothing is so engaging that it couldn't become boring. \"...it seems quite unreasonable to suppose\nthat [the imagined ideal activities] would have the fulfilling or liberating character that they do have\nfor [the immortal person], if they were in fact all he could do or conceive of doing.\" (96)\n-\nIs this just a failure of imagination? Why does Williams say that boredom must be \"unthinkable\"\n(96)? Why would someone have to grant that the ideal activities are \"all he could do or conceive\nof doing\"?\nWilliams' conclusion (quoted from the essay):\nSuppose then, that categorical desire does sustain the desire to live. So long as it remains so, I\nshall not want to die. Yet I also know, if what has gone before is right, than an eternal life would\nbe unlivable. In part, as EM's case originally suggested, that is because categorical desire will go\n\naway from it: in those versions, such as hers, in which I am recognizably myself, I would\neventually have had altogether too much of myself. There are good reasons, surely, for dying\nbefore that happens. But equally, at times earlier than that there are reasons for not dying. (100)\nIf you were given the option of drinking EM's elixir, would you do it?"
    }
  ]
}