{
  "course_name": "Moral Psychology",
  "course_description": "This course is an examination of philosophical theories of action and motivation in the light of empirical findings from social psychology, sociology, and neuroscience. Topics include belief, desire, and moral motivation; sympathy and empathy; intentions and other committing states; strength of will and weakness of will; free will; addiction and compulsion; guilt, shame and regret; evil; self-knowledge and self-deception; and, virtues and character traits.\nThis course is a CI-M course.",
  "topics": [
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Psychology",
    "Humanities",
    "Philosophy",
    "Ethics",
    "Social Science",
    "Psychology"
  ],
  "syllabus_content": "Course Introduction by Prof. Richard Holton\n\nView video page\n\nDownload video\n\nCourse Meeting Times\n\nLectures: 2 sessions / week, 1.5 hours / session\n\nDescription:\n\nThis course is an examination of philosophical theories of action and motivation in the light of empirical findings from social psychology, sociology and neuroscience. Topics include belief, desire, and moral motivation; sympathy and empathy; intentions and other committing states; strength of will and weakness of will; free will; addiction and compulsion; guilt, shame and regret; evil; self-knowledge and self-deception; and, virtues and character traits.\n\nThis course is a\nCI-M\ncourse.\n\nPrerequisites\n\nThere are no prerequisites for this course.\n\nTextbooks\n\nThere are no required textbooks for the course. The\nreadings\nwill consist of excerpts and papers.\n\nRequirements\n\nAssessment will be by means of three short papers (5-7 pages) and a class presentation. At least one paper (normally the first) will be revised and resubmitted. To fulfill the communication (CI) requirements, part of the second session each week will consist of student presentations on pre-assigned texts.\n\nGrading\n\nACTIVITIES\n\nPERCENTAGES\n\nPaper 1\n\n25%\n\nPaper 2\n\n25%\n\nPaper 3\n\n25%\n\nClass presentation\n\n25%",
  "files": [
    {
      "category": "Assignment",
      "title": "First Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/208da57c2c8b49da9bb973b2b26ea1a2_MIT24_120s09_assn01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nFirst Assignment\nDue: Friday 20th February\nAnswer all three questions. Answers should be around 6 pages. You can distribute the pages as you\nlike, but a good answer to any of the questions is likely to take at least a page. You need to read\nJoel Feinberg's 'Psychological Egoism'; a pdf of the article is available on the class webpage.\n1. Feinberg argues (pp. 496-7) that in certain cases the result of pleasure from an action 'provides\nrather conclusive proof that the action was unselfish'. Spell out the details of his argument here as\nclearly as you can, and provide as assessment of it.\n2. On pp. 503-5 Feinberg accuses certain psychological egoists of committing 'the Fallacy of the\nSuppressed Correlative'. What is this fallacy supposed to be? Is it a genuine fallacy? If not, why\nnot? If it is, is the psychological egoist guilty of committing it?\n3. How much light can be shed on the truth of psychological egoism by recent empirical work?\nDoes the work demonstratively show that it is false? Could any empirical work show that? Does it\nprovide grounds for something weaker?"
    },
    {
      "category": "Assignment",
      "title": "Second Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/2d7d432114ebb003c7ab36edbf8b3d86_MIT24_120s09_assn02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.210 MORAL PSYCHOLOGY\nRICHARD HOLTON\nSecond Assignment\nDue: Sunday March 22nd\nLength: 6 pages (i.e. around 2000 words)\nGary Watson argues that the addict is 'more like a collaborationist than an unsuccessful\nfreedom fighter' ('Disordered Appetites', p. 65), and later that we are 'not so much overpowered\nby brute force as seduced' (ibid p. 71).\n(i) What implications does this have for the view that addicted actions are still chosen?\n(You might like to distinguish rational choice accounts from accounts that involve\nirrational choice.)\n(ii) Does this, as Watson claims, help to make sense of the idea of why addicts frequently\nfeel a sense of guilt. (NB. Not being forcibly defeated might be a necessary condition for\nfeeling guilt, but is being a collaborator sufficient? What kind of collaborator would one\nneed to be?)\n(iii) How well does this sit with the emphasis put by others on the centrality of craving to\naddiction (see here George Loewenstein's paper 'A Visceral Account of Addiction' on the\nwebsite). What is it in addiction that is compulsive?\n(iv) How plausible do you think that Watson's approach here is? If you are sympathetic to\nWatson's account, explain what you like about it, but also stress any shortcomings or gaps\nthat you think it contains. If you think that some other account does better, say what it is\nand why it does."
    },
    {
      "category": "Resource",
      "title": "Text Presentations",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/25ff668f12db7dc20d206d07eb0e1166_MIT24_120s09_assn04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.210 MORAL PSYCHOLOGY\nRICHARD HOLTON\nText Presentations\nIn order to fulfill the requirements of the course, at least once during the semester students must\ndo a close analysis of a selected passage in one of the assigned readings. The exercise will have\nthree parts: a small group discussion with other students in the class, a 15 minute class\npresentation, and a 15 minute discussion. Assigned passages will be distributed around a week in\nadvance.\nSmall Group Discussion\nEveryone will be paired with one or more other members of the class. Each week, one group will\nmeet outside of class to discuss the assigned reading. Their task will be to come up with an\ninterpretation of the passage and to discuss their critical responses. They should expect to tackle\nsuch questions as the following:\n1. What is the author trying to do in this passage, i.e., what are they saying and why?\n2. What questions of interpretation arise about the author's meaning? Are there confusing\npassages, or ones that could have multiple meanings? What possible interpretations seem\nmost reasonable and why? What difference does it make if the author is interpreted in one\nway or another? What evidence can you provide that your interpretation is the best one?\n3. Is there an argument being advanced in the passage? If so, what are the premises and what\nis the conclusion? If there is an argument, you must be very explicit in stating what you\ntake to be the premises and the conclusion.\n4. On what background assumptions does the author rely?\n5. How does this passage fit into the author's larger aims in the text as a whole?\n6. What questions or criticisms occur to you about the author's line of thought?\n7. How might the author (or one sympathetic with his or her view) respond to your questions\nand criticisms?\nClass Presentation\nThe small group discussion will be the basis for 30 minutes of discussion. The designated group\nwill begin by presenting what they take to be the strongest interpretation of the reading, followed\nby a commentary indicating what they think are the most interesting issues raised, what they\nfound most puzzling, etc. Following this, their object will be to draw the rest of the class into a\nbroader (and deeper?) discussion of the passage.\nThe rest of the class will be required to read the text carefully also, but the assigned group\nwill be responsible for initiating and structuring discussion during the second half of the\npresentation period. Other students should come prepared to ask questions and contribute their\nideas."
    },
    {
      "category": "Assignment",
      "title": "Third Assignment",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/314ca4a7a9bd6a56239c7e7bd339b132_MIT24_120s09_assn03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nThird Assignment\nDue: 8th May\nLength: 5-7 pages (i.e. around 2000 words)\nAnswer one question\n1. Is the existence of free-will compatible with what we know about the world?\n2. Does Wegner give us good reasons for thinking that conscious will is an illusion?\n3. What does Frankfurt mean when he talks of identification with a desire? Can we shed light on the\nquestion by considering Deci and Ryan's empirical work?\n4. Should self-deception be modeled on the deception of others? How does the inter-personal\naccount need to be modified to be applicable to the intra-personal case? Could we have empirical\ngrounds for thinking that deflationary accounts like Mele's can't do what is needed?\n5. Can findings from empirical psychology tell us anything about the nature of morality?\n6. What, if anything, can syndromes like autism and sociopathy tell us about well functioning\nmoral agents?"
    },
    {
      "category": "Resource",
      "title": "I Egoism",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/9aa662631002af24183e8cd6bb054963_MIT24_120s09_lec01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nI Egoism\nPsychological Egoism is the thesis that we always act from selfish motives. It holds that all\ndesires are egoistic desires, or else derived egoistic desires. It is a descriptive thesis (i.e. a thesis\nabout how things are, not about how they ought to be). It must be distinguished from the\nnormative claim that we ought only to have egoistic desires (Ethical Egoism).\nMr Lincoln once remarked to a fellow-passenger on an old time mud-coach that all men were prompted by\nselfishness in doing good. His fellow passenger was antagonizing this position when they were passing over a\ncorduroy bridge that spanned a slough. As they crossed this bridge they espied an old razor-backed sow on\nthe bank making a terrible noise because her pigs had got into the slough and were in danger of drowning. As\nthe old coach began to climb the hill, Mr. Lincoln called out, \"Driver can't you stop just a moment?\" Then\nMr. Lincoln jumped out, ran back and lifted the little pigs out of the mud and water and placed them on the\nbank. When he returned his companion remarked: \"Now Abe, where does selfishness come in on this little\nepisode?\" \"Why, bless your soul Ed, that was the very essence of selfishness. I should have had no peace of\nmind all day had I gone on and left that suffering old sow worrying over those pigs. I did it to get peace of\nmind, don't you see?\"\nFeinberg, 'Psychological Egoism'\nDistinguish further the thesis that psychological egoism is a priori (or necessarily, or analytically)\ntrue, from the thesis that it is true a posteriori (or contingently, or synthetically).\nSome Terminology\n(i)\na sentence is a priori true if and only if (iff) it can be known independently of experience\n(contrast: a posteriori: can only be known by experience).\n(ii)\na sentence is necessarily true iff it couldn't be false, i.e. it is true in every possible world\n(contrast: contingent: false is some possible worlds, true in others)\n(iii) a sentence is analytically true iff it is true in virtue of its meaning (contrast: synthetic: neither\ntrue nor false in virtue of its meaning)\nNote: these aren't obviously the same. So, for instance, 'Bachelors are unmarried' is analytic, a\npriori and necessary. Statements of arithmetic like '2 + 2 = 4' are a priori and necessary; but it's\nnot obvious that they are analytic. (It's not obvious that it's part of the meaning of '2 + 2' that\nit is equal to 4.) Finally consider a sentence like 'Goldbach's conjecture is true'. Goldbach's\nconjecture is the conjecture that every even number is the sum of two primes. No one has ever\nfound a counter-example; but no one has ever given a proof. Perhaps the conjecture is true but\nthere is no proof. Then 'Goldbach's conjecture is true' will be necessary; but not a priori (since we\ncannot know that it is true, since we can give no proof of it) and not analytic (otherwise we\ncould give a proof just by paying careful attention to the meanings of the words). Sometimes it\nis said that if egoism is a priori true, it would be trivial and uninteresting; but that is too quick.\nAt most that would follow if it were analytic (though even that is controversial).\nA first, and very simple, a priori (analytic?) argument\nPremise:\nEverything I do is motivated by my desire to do that thing\n\nConclusion: Therefore everything I do has a selfish motivation.\nThere is a sense of 'desire' on which the premise here is false (we sometimes do things not\nbecause we want to, but because we feel we ought to). But there is also a wider sense of 'desire' in\nwhich it is more plausible: whenever we do something there is some concern that leads us to do\nit. We'll investigate just how plausible this is later. So for now we'll only concern ourselves with\nwhether the argument is valid. (Terminology: an argument is valid iff the conclusion follows from\nthe premises; it is sound iff it is valid and has true premises.) It requires a further premise along\nthe lines of:\nTo be motivated by one's own desires is to be selfishly motivated.\nButler's response:\nIf, because every particular affection is a man's own, and the pleasure arising from its gratification his own\npleasure, or pleasure to himself, such particular affection must be called self-love; [then] according to this\nway of speaking, no creature whatever can possibly act but merely from self-love; and every action and every\naffection whatever is to be resolved up into this one principle. But then this is not the language of mankind:\nor if it were, we should want words to express the difference between the principle of an action, proceeding\nfrom cool consideration that it will be to my own advantage; and an action, suppose of revenge or of\nfriendship, by which a man runs upon certain ruin, to do evil or good to another. It is manifest the principles\nof these actions are totally different, and so want different words to be distinguished by.\nBishop Joseph Butler, Fifteen Sermons, (1726) Sermon XI\nIn short, distinguish:\nBeing motivated by one's own desires.\nBeing motivated by a desire for one's own satisfaction.\nThe contrast is between the origin or location of the desires, and their contents. If egoism were\nsimply a thesis about the location of desire, it would be uninteresting. Moreover, by 'egoistic\ndesire' we don't simply mean a desire that is owned by its owner; and to redefine the term so that\nit does mean that is just to make the thesis that all desires are egoistic into a trivial analytic\ntruth. The interesting thesis is about the content of our desires. (Three further points to note here:\n(i) Butler's observation that actions like revenge are typically not egoistic; (ii) it is not even\nobvious that one will be motivated by all of one's own desires; (iii) there is a difference between\nsatisfying a desire, and getting pleasure from the satisfaction of a desire (the ordinary term\n'satisfied' is slippery here).)\nWhat is the relevant content? 1st attempt: an egoistic desire is a desire for one's own\npleasure\nSo psychological egoism becomes the thesis that every desire is a desire for one's own pleasure,\nor is derived from such a desire. This is the doctrine of psychological hedonism. It has had some\nsupport from people such as Hobbes, Bentham, Mill. But it's pretty implausible, certainly as an a\npriori claim. What should we take pleasure to be? If we just take it to be the satisfaction of our\ndesires, then we seem to be in an ungrounded loop when we say that our only basic desire is the\nsatisfaction of our desires. (Compare: 'The only thing I know is that I know something'; 'The\nonly true sentence is this one'; or consider a group of altruists all of whose only desire is that\nthe others get what they want.) Alternatively we might take pleasure to be a certain sensation\n-- 2 --\n\n(this is what Hobbes and Bentham meant by it). Then we could make sense of the idea that that\nwas all we wanted. But why should we think it is true, either a priori or a posteriori? Don't we often\nwant things (food, fame ...) directly, and not just as ways of getting ourselves pleasurable\nsensation? Mightn't we even want things knowing that they won't give us pleasure. For instance,\ncan't I want to go to sleep, or be drugged unconscious? Yet successfully attaining these ends\nexactly precludes me from having a pleasurable sensation. And in general: (i) trying to get\npleasure very often doesn't get it (the paradox of hedonism); (ii) pleasure is not always a\nseparate state from the activity that one finds pleasurable: playing chess for pleasure playing\nchess and simultaneously having pleasurable sensations (indeed, these might get in the way).\nNote that there is a weaker point here, which we shouldn't confuse. The weaker point\nrests on the idea that if I do what I want, I will get pleasure from it. Perhaps that is typically\ntrue. (Though surely not always: consider the cases mentioned above, or even the two year old\nwho expresses a desire for a bowl of hot chilli pickle.) But it is beside the point. The\npsychological hedonist is saying that all desires are desires for pleasure, not that the satisfaction\nof desires brings pleasure. With every desire that is satisfied I get a little older, but that doesn't\nmake it a desire to get older.\n2nd attempt: an egoistic desire is an I-desire\nFirst step: reformulate all desires as attitudes to propositions. e.g. 'I want an apple' becomes 'I\nwant that I have an apple'; 'I want to see the Matterhorn' becomes 'I want that I see the\nMatterhorn'. Then the suggestion is that egoistic desires are those that begin 'I want that I ...'\nCall these I-desires (the term is from Bernard Williams). Suppose that I want to send money to\nthe starving. Is this an egotistic desire? It depends whether the fundamental state is: 'I desire that\nI send money to the starting' (in which case it is); or whether it is simply: 'I desire that the\nstarving are sent some money' (in which case it isn't). This still isn't quite right (some I-desires\nare not obviously egoistic: 'I want that I do the right thing'; 'I want that my children do well')\nbut it is good enough to be going on with.\nLet's return to Lincoln. What is the content of his desire? Feinberg thinks he must really\ndesire the well-being of the pigs; it is incoherent to think otherwise. But that doesn't seem right.\nFeinberg says that he is not indifferent to them, and of course that is right, since he is moved by\ntheir plight. But it could be that he desires to help them simply because their suffering causes\nhim to feel uncomfortable (there is a brute causal connection) and the only way he has to relieve\nthis discomfort is to help them. Then he would, at bottom be moved by an I-desire ('I desire\nthat I no longer feel uncomfortable'), and the desire would be egoistic. Here is a test to see\nwhether the desire is basically an I-desire. Suppose that he could simply have taken a pill that\nquietened the worry, and so stopped him being uncomfortable; and taking the pill would have\nbeen easier than helping the pigs. Would he have taken the pill and left the pigs to their fate? If\nso, the desire is indeed an I-desire. There is nothing incoherent about this. The point is not that\nit is impossible that there is a non-I-desire here. It is rather that we cannot know a priori that\nthere is an I-desire at work; and, knowing what Lincoln was like, it is implausible that he would\nhave taken the pill and left the pigs to their fate. We can apply similar tests generally. Whenever\nit is suggested that an apparently altruistic motivation is really egoistic, since it under-pinned by\nan I-desire, imagine a way in which the I-desire could be satisfied without the apparently\naltruistic desire being satisfied. Would the agent be happy with this? If they would, then it is\nindeed an egoistic desire. if not, it isn't. (The same goes for malevolent desires.)\n-- 3 --\n\nWhich desires are egoistic?\nThe problems with William's I-desire criterion:\n(i) some desires might be agent-relative without being egoistic (I want my child to do well).\n(ii) some deontological moral motivations might be agent-relative (I want that I don't tell\nlies).\nPerhaps the best way is to characterize egoistic desires negatively: they are those that involve\ninsufficient attention to the needs of others. (By this criterion Robinson Crusoe couldn't have\nbeen an egoist.) Perhaps there is no good analysis; a common problem in philosophy.\n-- 4 --"
    },
    {
      "category": "Resource",
      "title": "II Egoism: Empirical and Quasi-Empirical Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/655574ab3c71b2e817ad54c81420b640_MIT24_120s09_lec02.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nII Egoism: Empirical and Quasi-Empirical Issues\nThe upshot of the last session is that we can make some sense of the idea of psychological egoism. But\nwe haven't yet seen a good a priori argument that it's true. Are there a posteriori arguments? Two oft-\nmentioned possibilities:\n(1) arguments from unconscious motives; Freud etc.\n(2) an arguments from evolutionary biology.\nUnconscious motives\nEven for Freud it is unclear that the unconscious motives are really egoistic. Contemporary psychology\nrecognizes plenty of unconscious motives. But they are not obviously egoistic. In fact most are too\ndomain specific for notions of egoism and altruism to have much application. Moreover, the more we\ninsist on the importance of unconscious motives, the more skeptical we should be that we can tell by\nintrospection that they are not altruistic.\nEvolutionary Arguments\nThere is an argument for thinking that altruists must do worse compared to egoists, and so must in time\nbe eliminated from the population. Assume that egoism and altruism are inherited. (Disregard\nmutation). We can accept that groups containing more altruists will do better than groups containing\nfewer, and so will benefit at the cost of those groups. Nonetheless there is an argument that the egoists\nwill do better than the altruists within those groups, and so in time will squeeze them out:\nSuppose that altruism benefits the whole population, at a cost to those who practice it. Accept for\nthe sake of argument that the benefit benefits the whole population: indeed even for the altruists\nthemselves it outweighs the cost to them. Still, the net benefit to the egoists will be greater, (since\nthey are paying no costs), and that gives them comparative advantage. Comparative, not absolute,\nadvantage is what matters in a competitive situation. So the egoists will win out in the long-run.\nA possible response: Simpson's Paradox. An example based on a real case in the University of\nCalifornia:\nImagine that 90 women and 10 men apply to a department with a 30% acceptance rate. This department does not\ndiscriminate and therefore accepts 27 women and 3 men. Another department, with a 60% acceptance rate,\nreceives applications from 10 women and 90 men. This department doesn't discriminate either and therefore\naccepts 6 women and 54 men. Considering both departments together, 100 men and 100 women applied, but only\n33 women were accepted, compared with 57 men.\nSober and Wilson Unto Others\nIn each subgroup there is no discrimination against women; but in the total group women do less well.\n(Discussion question: does this constitute de facto discrimination against women?) Could something\nanalogous happen in the competition between egoists and altruists: could it be that in each subgroup\negoists do better, but in the total group the proportion of altruists remains stable? For example:\nImagine that a population of 200, equally divided among altruists and egoists, is split into two\nequal sized groups, the tough group and the soft group. The tough group contains 90 egoists and\n\n10 altruists. As a result of the tough conditions, at the end of the breeding cycle the group has\ndeclined so that it only has 90 members, 85 egoists and 5 altruists (the egoists have done\ncomparatively better). The soft group starts with 10 egoists and 90 altruists. As a result of the soft\nconditions, at the end of the cycle it has grown to contain 110 members, 15 egoists and 95 altruists\n(the egoists have again done comparatively better). The population still contains 100 altruists and\n100 egoists.\nConditions for getting Simpson's paradox effects along these lines:\n(i) there must be isolated groups for breeding;\n(ii) the groups must vary in their proportion of altruists;\n(iii) those with more altruists must have more offspring;\n(iv) the breeding groups must come together again to form a pool from which new breeding\ngroups form; the initial proportions in the breeding groups must be roughly the same in each\ncycle.\nHow realistic are these conditions? The most obviously problematic is the last. But perhaps this is not\nso strange. Imagine people choosing who they want to associate with: everyone wants to associate with\naltruists, and avoid egoists, and they are fairly good at recognizing each other but not perfect. There is\nsome experimental work that suggests that in some non-human populations Simpson's effects emerge\n(e.g. Wade's work on tribolium beetles); but it doesn't seem very common.\nEmpirical Work\nThe prisoners' dilemma. What happens when you iterate? Axelrod's experiment, and the strength of tit-\nfor-tat. Two kinds of reputation effect: that you will cooperate if the other does; that you will not\ncooperate if the other doesn't. So this can be explained as a form of reciprocal altruism: short-term\nsacrifice for long-term benefit. The limits to this: doesn't work with large numbers. The typical decline\nof trust in iterated public goods games. Something more is needed. Strong reciprocity: a readiness to\nreward altruism and punish egoism in others; and to do this moreover even when there is no long-term\nbenefit to be gained. Prisoners' dilemmas, and their multi-person equivalents, give no real possibility of\nreward or punishment; one can only withdraw cooperation in general. But other games have different\nstructures, and so are more like real world interactions. Punishment: the ultimatum game. Reward: the\ntrust game. Third party punishment (recall Butler). These tendencies are stronger when there is a\nreputation effect. But there is good evidence that people will reward and punish even when this is\nabsent: for instance in single-shot anonymous games. Neurological evidence that we get pleasure from\ncooperating (Rilling); and that the desire to punish may be driven by emotional factors.\nShould an evolutionary explanation be given of this? If so, perhaps it could be explained by Simpson\nstyle effects. But it is not obvious that an evolutionary explanation is needed since it seems to be learned\nbehavior. And there is evidence that this is so: it differs across different societies; it is more prevalent in\nolder individuals, or those who have played more games. Of course people need to be of the type that\nenables them to learn evolutionary behaviour. But maybe that is not something that needs to be\nexplained directly by the benefits conferred on the whole population by altruism. What is really needed\nis some tendency to conformity. And there might be many reasons why that is selected for.\n-- 2 --"
    },
    {
      "category": "Resource",
      "title": "III Belief/Desire Psychology & The Humean Theory of Motivation",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/caff92fb14372ab640b74d799ba130c3_MIT24_120s09_lec03.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nIII Belief/Desire Psychology & The Humean Theory of\nMotivation\nBelief/Desire Psychology\nBelief/Desire psychology was for a long time the dominant approach in psychology and\nphilosophy, and is still very important; it remains dominant in economics. The origins go back at\nleast to Hume, and to the idea that a belief on its own will not move an agent. (In contrast Kant\nthought that one could be motivated to act morally just by the judgment that the action was\nmorally right; indeed, on his account, if one has a desire to act morally, that corrupts the moral\nmotivation.) But the claim has developed from the thought that beliefs are insufficient to move an\nagent, to the claim that desires are necessary to move an agent. In psychology this was given\nimpetus by the (broadly behavioristic) drive to operationalize mental notions: desires earn their\nscientific keep if they are manifested in action. In economics this becomes the idea behind revealed\npreference theory: an agent's preferences are revealed by their actions; a similar idea is present in\nmost decision theory. There is something attractively hard-headed about the idea: actions speak\nlouder than words. (Though don't words have some role? Beowulf talks of 'words and deeds' ('worda\nond worca' Ch IV l. 289) as having a role.)\nSmith's account: two sorts of reasons, and a third\nNormative reason: you have reason to get off the person's foot;\nMotivating reason: your desire to hurt the person (and your belief that this hurts) is the reason you\nkeep standing on their foot;\nPsychological but non-intentional reason: your drunkenness is the reason that you think that standing\non their foot is the best way to hurt them.\nThe Humean theory of motivation is a theory about the second of these: that all motivating\nreasons consist of a belief/desire pair. There is a substantial philosophical thesis that all normative\nreasons must be grounded in desires (sometimes called internalism about reason, though that term\nhas another use); but that is somewhat independent of our primary focus here. You could think\nthat all normative reasons must be grounded in desire, and still think that somebody had a\nnormative reason to do something without having a motivating reason; perhaps they hadn't realized\nthat this act would satisfy their desire.\nCausal explanations\nThere is a long-standing debate about whether motivating reasons are causes. Many philosophers\nused to deny that they were. Donald Davidson pointed out that even if we have a desire for\nsomething, and a belief that a certain action will bring that thing about, we don't get an\nexplanation of the corresponding action unless we think that the belief and desire caused that\naction (and caused it, moreover, in the right way).\n\nPhenomenology of Desire\nSmith argues that it is not a necessary feature of desires that they have a certain phenomenology\n(i.e. a certain feel) attached. Perhaps certain desires must (hunger for instance); but this is not\ngenerally so. And even with hunger, one can be distracted (in which case, does the phenomenology\nof hunger go away, or do we simply not notice it; compare wounds on the battlefield). Smith only\nconsiders certain sorts of phenomenology though. There is a worry for Smith's approach from the\nfact that when the phenomenology is completely lacking (or perhaps where there is an inappropriate\nphenomenology) we are reluctant to ascribe desires. Consider compulsion. Philip Quinn gives the\nexample of a compulsive radio-switcher-on-er: he switches on every radio he can find, entirely\nwithout any pleasure or satisfaction. Would we say that he wanted to switch the radios on?\n(Similarly, Anscombe has the example of someone who says, inexplicably, 'I want a pin'; and then,\nwhen you give it to them, says simply 'Thank you, my wish is gratified', and puts the pin down.)\nCould it be that desires have to involve pleasure in the satisfaction; or, more plausibly, pleasure in\nthe anticipation of satisfaction? There is now a considerable psychological literature showing that\nwanting and liking can come apart. See for instance Kent Berridge's work, which we shall look at in\ndetail when we come to study addiction.\nDesires as Functional Roles and Dispositions\nFor Smith here, a functional role just is a bunch of dispositions: dispositions to act in certain ways\ngiven certain beliefs. Dispositions are clearly related to counterfactuals (statements about what I\nwould do if ...) but probably shouldn't be identified with them. The dispositions all have a\ndistinctive, mind-world direction of fit.\nPro-Attitudes\nSmith is explicit (p.55) that distinguishing other states with a mind-world direction of fit from\ndesires is not a deep objection (he considers hopes and wishes). His response is just to introduce\nthe term 'pro-attitude' (from Davidson) and rephrase the Humean theory in terms of that. But he\nneeds to be careful here. For if the claim is just that anything that gets one to act counts as a\ndesire, then of course whenever we act there will be a desire. In fact Smith is surely not saying that.\n(Witness his response to the claim that there might be states with both directions of fit: he doesn't\njust conclude that such states would be desires. So he must think that desires have features that\ndistinguish them from such states.) So we are left with the thought that desires have certain\nfeatures (that makes the Humean theory non-trivial); and then we can ask whether every action is\nmotivated by states that have those features. Smith assumes that they are, but that is far from\nobvious. One putative class of counter-examples that we have already mentioned is addictive and\ncompulsive behavior. Perhaps Smith will say that this is not intentional behavior (that is\ncontroversial). Another class of putative counterexamples that we shall go on to consider at length\nis the class of intentions. Intentions have features that plausibly distinguish them from desires (for\ninstance they are under our control in a way that desires are not, they have a different\nphenomenology); and yet they are plausibly motivating.\n-- 2 --\n\nAttitudes with Both Directions of Fit\nSome philosophers want to acknowledge the possibility of states that are both belief like and desire\nlike; 'besires' as they are sometimes called. It is sometimes thought that moral judgments are like\nthis: moral judgments are truly judgments, and hence are a kind of belief; but at the same time they\ninvolve a disposition to change the world in a certain way (moral internalism). Smith's argument is\nthat these states are incoherent, since no state can simultaneously have both directions of fit. But\nthat seems to muddle up the content of the states which are supposed to have the different\ndirections of fit. A belief that, say, racism is wrong, doesn't bring with it a desire to change the\nworld so that it was no longer the case that racism is wrong. Rather it brings a desire to change the\nworld so that there is less racism in it. So the argument that is left for Smith is that admitting such\nstates brings us no explanatory advantage, and so we shouldn't admit them; an application of\nOckham's razor.\nSmith's later work\nIn a subsequent book (The Moral Problem) Smith tried to reconcile the Humean theory of motivation\nwith moral internalism (i.e. the thesis that moral beliefs are essentially motivating). Very briefly,\nhis line is that to make a moral judgment that an action is good is to judge that one would desire\nto perform that action if one were fully rational; and then to argue that rational agents will desire\nwhat they judge they will desire if rational. So beliefs and desires are still quite distinct, though\nrational agents will come to desire what they judge good.\n-- 3 --"
    },
    {
      "category": "Resource",
      "title": "IV Bratman on Intention",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/217f71a367144bb51e3fe0ac8bbce415_MIT24_120s09_lec04.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nIV Bratman on Intention\nFunctional Benefits of Intention\n(I) Deliberation curtailment\nTwo aspects: don't spend too much time; control when you deliberate. Do you need to form\nan intention to obtain these benefits? Why not just a judgment?\n(II) Interpersonal and intrapersonal coordination\nDo one's intentions need to be known to achieve these benefits? Does one need to know that\nthey will be successful?\n(III) Self-knowledge (Velleman)\n(IV) Resolving indifference and incommensurability\nHow do these differ? John Broome's Abraham example.\n(V) Resisting temptation\nFeatures needed to achieve (at least the first two of) these results\nControl\nStability\nConsistency\nMeans-Ends Coherence\nWhy aren't they desires?\nConsistency requirement; volitional control\nWhy aren't they beliefs?\nMotivating; volitional control; determinacy in cases of indifference and incommensurability.\nDo they, however, entail beliefs?\nIntentional Action and Acting with an Intention\nThe video game example (from 'Two Faces of Intention'): I play a game in which the goal is to\nhit either of two targets with either of two guns. I am ambidextrous, and so can simultaneously\nshoot with each hand. If both targets are about to be hit simultaneously, the game shuts down.\nBut I consider that it is worth risking this slight risk in order to increase my chance of hitting\none of the targets. Do I intend to hit both targets? Bratman argues that I don't. Do I intend\nto hit one rather than the other? But which? So I have no intention, though I do endeavour to hit\nthem both. But, Bratman argues, if I did hit one of the targets, I would intentionally hit it.\nOther examples: the doctrine of double effect. Are endeavourings really distinct from intentions?\n\nIntention and Belief\nIf they are not identical to beliefs, do intentions at least bring beliefs with them? The fallen tree\nexample; the library example. Believing not v. Not believing. All-out belief. What happens if we\nwork with credences? What becomes of the video game example?\nWhat has become of the Humean Theory of Motivation?\nModest revision: all intentions must result from desires. More radical revision: they need not.\nCouldn't we just start out with intentions? What is the status of the claim that we must start\nwith desires?\n-- 2 --"
    },
    {
      "category": "Resource",
      "title": "IX Strength of Will: Normative Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/b52335c3d12fb0fa970ec6133422878b_MIT24_120s09_lec09.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.210 MORAL PSYCHOLOGY\nRICHARD HOLTON\nIX Strength of Will: Normative Issues\nMORE ON AINSLIE'S CONDITIONALS\nIf I hold out now, I will hold out in the future.\nIf I don't hold out now, I won't hold out in the future.\nCould these give us information about what I am like? Problem: is it accurate information?\nAn extreme case: Newcomb's problem. A bizarre billionaire offers you a choice:\n(1) Box A\n(2) Box A and Box B\nBox B contains $1000, placed there the night before. Box A either contains $1m, placed there\nthe night before, or else nothing. The billionaire is a brilliant predictor of people's choices\n(with a 99.9% success rate). When he decided last night what to place in Box A, he\ncontemplated whether you would choose one box, or both. If he thought that you'd greedily\nchoose both, he placed nothing in Box A. If he thought that you would choose only one, he\nplaced $1m in Box A. But that, of course, was yesterday, and nothing you can do now will\naffect what is in the boxes. Should you choose one box or two?\nLess extreme: self-signaling behavior. Hardworking Calvinists. People keeping their hands in\ncold water for longer if that indicates a strong heart (Quattrone and Tversky, 1984). The\ndifficulty is that if they see themselves as self-signaling, they interfere with the very signals that\nthey think are giving them information. But in the temptation resisting case does that matter?\nThere isn't any further state that the behavior is supposed to be evidence of. If someone behaves\napparently altruistically because they want to think of themselves as an altruist, then maybe they\nare not truly an altruist. But if someone refrains from smoking because they want to think of\nthemselves as someone who can refrain from smoking, then they really are refraining from\nsmoking. Compare simple self-presentation behavior.\nKAVKA'S TOXIN PUZZLE\nThe bizarre billionaire offers you $1m iff you will form the intention to drink a very nasty (but\nnon-fatal) toxin. You decide to do so. Then he says that you don't actually have to drink it,\nonly to sincerely intend on the night before. Two questions:\n(i) can you so intend?\n(ii) even if you can, is it rational to intend to do so?\nAnd another question:\n(iii) is it rational to drink the toxin?\nThe example brings out the distinction between reasons for performing an action, and reasons\nfor intending to form the action. (Perhaps we can get them going in the other way too: you get\nthe $1m iff you drink the toxin without intending to.)\n\nTWO OTHER PUZZLE CASES\nThe reciprocal suitcase deal (compare Broome's wolf case).\nThe self-torturer (note that this case, like that of Ann, seems to involve the idea not simply that\ndesires change as time changes, but that it changes in response to other behavior).\nBRATMAN'S TROUBLEMAKING PRINCIPLES\nThe Linking Principle: I shouldn't form an intention that I now believe I should, at the time of\naction, rationally revise.\nOr, more precisely:\nIf, on the basis of deliberation, an agent rationally settles at t1 on an intention to A at t2 if\n(given that) C, and if she expects that under C at t2 she will have rational control of whether or\nnot she A's, then she will not suppose at t1 that if C at t2 she should, rationally, abandon her\nintention in favor of an intention to perform an alternative to A. (Bratman, 1998, 64)\nThe standard view: My ranking now should depend on the ranking that I will make at the time.\nTWO PUTATIVE SOLUTIONS\n(i)\nSophistication: accept linking principle, and standard view. Problem: you'll give into\ntemptation\n(ii)\nStrong resolution: accept linking principle, but reject standard view, in favor of the idea\nthat one's ranking now should not depend upon the ranking that one would give at\nthe time of action, but instead at the time of forming the resolution. Problem: seems\nto make too little of our agency at the time of action. (More like a machine that is\nlocked into the plan.)\nBRATMAN'S SOLUTION\nAdd another condition onto what is needed for rationality: you must meet the no regret condition:\n(i)\nwere you to stick with the resolution, then at plan's end you would be glad about it;\nand\n(ii)\nwere you to fail to stick with it, then at plan's end you would regret it.\nDoes this help with the toxin case, and the other cases?\nTHE CASE OF YURI.\nYuri has managed to fall in love with both Tonia and Lara. When he is with Tonia he is\nconvinced that she is the one, and vows his undying commitment; unfortunately things are just\nthe same when he is with Lara. Worse still, his life is so structured that he keeps spending time\n-- 2 --\n\nwith each of them. As one commitment is superseded by another, and that by another, trust is\nlost all round. Clearly it would be rational for Yuri to persist in his commitment to one of the\nwomen, and to restructure his life accordingly; all of them recognize that. However, the no-\nregret condition isn't met. We can imagine him as a naturally contented type, who will not feel\nregret whomever he ends up with; in which case the second clause of the condition would not be\nmet. Or we can imagine him as a naturally discontented type, who will feel regretful either way;\nin which case the first clause will not be met. Or we can imagine him as ambivalent, fluctuating\nbetween regret and happiness however he ends up; in which case neither clause will be stably met.\n-- 3 --"
    },
    {
      "category": "Resource",
      "title": "V Velleman on Intention",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/fc60c3b09c0cded4c43b0626f55f5128_MIT24_120s09_lec05.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nV Velleman on Intention\nIntention as Belief\nBratman, as we saw, held that belief in one's success is not a requirement on intention. He cited\nvarious examples (the fallen tree; the bookstore visit) in support of this. But one problem with\nhis view is that it is not obvious that it can explain how intentions can serve to enable\ncoordination if we do not in general believe that we intend what we do intend; nor is it clear\nthat it can explain why there is a consistency requirement on our intentions.\nOne response to these worries is to hold that intention does entail belief. Velleman's account\ngoes even further: not only does intention entail belief, it actually is belief, though belief of a\nspecial kind: 'self-fulfilling expectations that are motivated by a desire for their fulfillment, and\nthat represent themselves as such'.\nWhy the motivation by desire?\nConsider the insomniac who believes he will not go to sleep, and whose belief is what keeps him\nawake, and who realizes that this is so. We wouldn't say that he intends to stay awake. But if\nhis belief is motivated by a desire to stay awake, that is much more plausible.\nLangton's worries\nDescriptive: is it possible to form a self-fulfilling belief as a result of one's confidence that it is\nself-fulfilling? James' rock leaping example. Or imagine that there is a box in the corner and I\ntell you that inside is a square of card that has whichever color you believe it to have. Can you\nform a belief about what color it has?\nNormative: even if you can do this, are you right to do so? Doesn't this give belief the wrong\ndirection of fit?\nKeeping a belief requirement without equating intention with belief\nWe can get an agglomeration requirement just by insisting that intention entails, or\npresupposes, belief. (Or at least this will give us some agglomeration; it is controversial whether\nbelief agglomerates completely: the lottery paradox.) And that will also give us the coordination\nbenefits. What do we say about Bratman's examples though? They involve partial belief. So\nperhaps there is some corresponding notion of partial (uncertain) intention. All out belief\nagglomerates; partial belief doesn't. Similarly maybe all out intention agglomerates, and partial\nintention does not."
    },
    {
      "category": "Resource",
      "title": "VI Akrasia",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/ff24c06b8f1356d904c9d353b79dfd4d_MIT24_120s09_lec06.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nVI Akrasia\nSocrates' Position\nNow surely no one freely goes for bad things or thing he believes to be bad; it's\nnot, it seems to me, in human nature to be prepared to go for what you think to\nbe bad in preference to what it good\n(Protagoras 358c6-d2; see also Meno 77b)\n(Contrast Plato's later position, in which the human psyche is understood as partitioned: see,\nfor instance the metaphor of the chariot at Phaedrus 246a6)\nThe argument as presented in the Meno: bad things make one miserable; no one would do that\nwhich they believe will make them miserable.\nDavidson's Presentation of the Problem\nP1 If an agent wants to do x more than he wants to do y and he believes himself free to do\neither x or y, then he will intentionally do x if he does either x or y intentionally.\nP2 If an agent judges that it would be better to do x than to do y, then he want to do x more\nthan he wants to do y.\nP3 There are incontinent actions (i.e. cases in which an agent intentionally performs an action\nx that he judges to be worse than an alternative action y, whilst believing himself free to do\neither).\nDistinguish that which is judged morally best from that which is judged best in other ways: the\ntoothbrush example.\nDavidson's Solution\nDavidson distinguishes two different sorts of practical judgement, conditional (prima facie)\njudgements:\nRelative to considerations C, doing A is best;\nand unconditional, all-out, judgements (judgements sans phrase):\nDoing A is best\n(in Davidson's account, these unconditional judgments are equivalent to intentions).\nUnconditional judgments always follow from conditional judgments. If the agent is rational\nthe unconditional judgements should follow from her all-things considered conditional judgments:\n\nRelative to considerations C (the total set of considerations available to me), doing A\nis best\nBut often they will follow from a conditional judgment that concerns only some of the relevant\nconsiderations:\nRelative to considerations C* ( which fall short of the total set of considerations\navailable to me), doing B is best\nAn agent never acts against her unconditional, all-out judgments (since this is her intention).\nBut she may well act against her conditional, all things considered judgments. This is what\nhappens in cases of akrasia. In effect, the agent judges that, relative to all of the considerations\navailable, doing A is best; but that relative to some subset of the considerations available, doing\nB is best. She then forms the unconditional all-out judgment that doing B is best on the basis of\nthe second judgement, and acts on that. (She acts on the consideration of the delicious nature\nof the cake, and not on this consideration, together with the more significant consideration of\nthe effect it will have on her health.) This is to violate the principle of continence: act on the basis\nof all of the available considerations (compare the principle of total evidence for inductive reasoning:\nbelieve the hypothesis supported by all of the evidence).\nSo the three principles are made consistent as follows:\nP1\nIf (S wants to do A more than to do B, and S believes that she can do either A\nor B, and S does either A or B intentionally), then S does A intentionally.\nP2\nIf S forms an unconditional, all-out judgement that doing A is better than doing B,\nthen S wants to do A more than to do B\nP3\nThere are incontinent actions, i.e. agents sometimes act against their conditional, all\nthings considered, judgements (or against the conditional judgements that they\nwould have made if they had considered all of the evidence available to them).\nHow satisfactory is this?\n-- 2 --"
    },
    {
      "category": "Resource",
      "title": "VII Akrasia & Desire",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/06cc6221e7183bb43865840c64291b75_MIT24_120s09_lec07.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nVII Akrasia & Desire\nWatson's criticisms of Davidson\nTwo aspects of desire: being motivated v. judging best\nAre these both aspects of desire? What makes the second look desire like?\nHumberstone's distinctions\nIn a television documentary about a beauty contest, the winner, newly crowned, wipes away the tears and says:\nI never realized how much I wanted to win. Presumably she was reflecting not on how much effort she had\nput in--she already knew that--but on how good it made her feel to have won.\n'Wanting, Getting, Having'\nDesire is a cluster concept (cf. the notion of a game). A desire can be strong along three\nindependent dimensions of assessment:\n1.\nHow strongly does it motivate you to act?\n2.\nHow happy would you be if it were satisfied?\n3.\nHow disappointed would you be if it were not satisfied?\nSo, according to Humberstone, there can, for instance, be two desires, of which the first is\nstronger on dimension 1, but the second is stronger on dimension 2. Likewise for dimensions 1\n& 3, and for 2 & 3:\nGet job (p = .5) -- very pleased\nSuccessfully cook complicated meal (p = .5) -- reasonably pleased\nUnsuccessfully cook complicated meal (p = .5) -- very disappointed\nFail to get job (p = .5) -- indifferent\nThe dimensions are held together by normative principles (which can be violated) like:\nGO FOR IT: Make your efforts at satisfying desires proportionate to the extent to which\nyou'd be happy to have them satisfied.\nSome more examples\nA colleague is offered an attractive job elsewhere. He decides, after much agonizing, to decline the offer. He\nexplains that, as soon as he had made the decision, he realized that it was what he really wanted.\nMarcel wants Albertine; or at least, he expends much effort trying to get her to move in with him. But as soon\nas he knows that she will, he finds himself indifferent to the prospect. He concludes that in some sense he\nnever really wanted her at all.\nProblems with the second dimension\n(i)\nIs happiness too restricted a notion? Pleased that? Satisfied that? Glad that? Or a list: pleased, or joyful or\nrelieved ...\n\n(ii)\nCan't we be pleased by things we didn't want, and made miserable by things we did want? The beauty queen a\nyear on. The pleasure machine. The hot chilli pickle. Don't we think of desire as more prospective than this makes\nit?\nRevisions of the second dimension\n(A) X wants a more than b iff X believes that he would be more pleased if a happened (rather\nthan b), than if b happened (rather than a).\nProblems: the pleasure machine; doesn't help with the beauty queen example.\n(B)\nX wants a more than b iff X would be more pleased to learn that a was going to happen\n(rather than b), than that b was going to happen (rather than a).\nProblems with (B)\nImagine an old rationalist whose daughter wants to be a nun. He loves his daughter, and wants her to be what\nshe wants to be. But he cannot bear the idea of her being a nun. Despairing of reconciling his basic wants, he\njust wants that she be a nun but he not know that she is.\nBernard Williams, 'Egoism and Altruism'\nHenry wants his wife to organize a birthday party for him but only if it's a surprise, i.e. only if he doesn't know\nthat she's going to. If he were to know that she was going to do it, he'd rather that she didn't do it at all.\nAnother revision\n(C)\nX wants a more than b iff X is more pleased at the prospect of a happening (rather than\nb), than of b happening (rather than a).\nTo be pleased at the prospect of something is (roughly) to imaginatively entertain it, and be\npleased at that. One can imagine it from an impartial viewpoint. One can thus imagine a\nsituation in which p obtains but one doesn't believe that p (whereas one can't believe that that\nthere obtains a situation in which p obtains but one doesn't believe that p).\nDoes this help with the beauty queen example? Perhaps sometimes one can only get full\nimaginative acquaintance if one actually believes that it is going to happen. And in the beauty\nqueen case the belief only comes at the moment that the desire is actually realized. That is still\ngetting clear on the prospect (unlike the question of how she feels a year later).\nAn alternative response\nWatson's response distinguishes two aspects to desire. But there is an alternative response which\ntrades on the distinction of intention from desire and belief. If intentions can be formed\nindependently of one's desires and beliefs, then what is to stop someone forming an intention to\nact against their desires and beliefs? (NB this requires a strong separation thesis: intentions\nneed not originate in beliefs and desires.\nAkrasia and Weakness of Will\nTraditionally the two are identified. But isn't weakness of will more to do with failing to follow\nthrough on one's intentions?\n-- 2 --"
    },
    {
      "category": "Resource",
      "title": "VIII Strength of Will: Descriptive Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/db9d06da8589eec84c3b94e677f20e13_MIT24_120s09_lec08.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nVIII Strength of Will: Descriptive Issues\nAINSLIE'S EIGHT MARKS OF THE WILL\n1.\nA new force in addition to desires etc.\n2.\nThrows its strength on the weaker side. (or perhaps it can)\n3.\nUnites actions under a common rule. (?)\n4.\nStrengthened by repetition\n5.\nVery vulnerable to nonrepetition\n6.\nRequires no diversion of attention\nDoesn't normally depend on each single choice, except where stakes are very high.\n8.\nTendency of failure in one sphere to spill into others is variable.\nWHY DO WE EXHIBIT WEAKNESS OF WILL?\nExponential and Hyperbolic discounting. $100 now or $120 in a year's time; $100 in ten year's\ntime or $120 in eleven year's time. From pigeons to people (though non-humans are not good at\ndelaying reward). Hyperbolic discounting is, in some sense, irrational.\nHyperbolic discounting is probably also involved in what we might call one more won't hurt\nreasoning:\nOne more won't hurt\nYou are a smoker, currently smoking forty cigarettes a day. You believe that this is very\nbad for you, and that you should give up. But you reason as follows: one more cigarette\nwon't hurt me, and it will give me considerable pleasure now. So I might as well have this\none more. And then you use this argument forty times a day.\nWithout hyperbolic discounting it looks as though the subject would simply be making a\nmistaken calculation (is that so in all cases?); but with it they need not be. Is hyperbolic\ndiscounting an explanation or merely a description?\nAINSLIE'S EXPLANATION OF HOW STRENGTH OF WILL IS POSSIBLE\nCompetition between egoistic time slices, akin to an interated prisoners' dilemma.\n('Picoeconomics') The reward game. See how this gives us the eight marks of the will.\nPROBLEMS WITH AINSLIE'S EXPLANATION\n(i) General problem of time slices: how short should they be? Can we make sense of actions\ndone by time slices?\n(ii) Each time slice is dead by the time of fulfillment, so in what sense is there a long run\nbenefit for which they can trade?\n(iii) What has become of the irrationality?\n\nREVISING AINSLIE'S EXPLANATION\nAn alternative, solving the second problem: give up on the egoism. Assume that the time slices\nhave desires (i) for others' well being, which (ii) they will never know to have been fulfilled. But:\n(a) we've now lost the sense of competition; this is quite unlike a prisoner's dilemma.\n(b) even these altruistic desires aren't enough, since they don't explain a further phenomenon,\nthat having kept to a resolution provides a reason for continuing to do so (compare the\nsunk cost phenomenon).\n(c) it still doesn't help with the third problem. Why should we think that it is irrational for\ndifferent actors to have different desires?\nA MORE RADICAL REVISION\nBetter just to put back the enduring self. What is left from the prisoners' dilemma model is just\nthe idea that in deciding what to do, we are acutely sensitive to what else will be done, but by us\nat a later time, rather than by others. This still keeps all of the advantages. In particular, we\nkeep (indeed can make even better sense of) this reasoning:\n(i) If I resist temptation now, then I'll resist it in the future.\n(ii) If I don't resist temptation now, then I won't resist it in the future.\nOTHER FEATURES OF THE PROPOSAL\nThe status of rationalizations and exceptions.\nBright lines. Alcoholics Anonymous on the need never to drink.\nWORRIES\nDoes this help explain all cases of strength of will in the face of desire? What about a case in\nwhich there is no likelihood of repetition? The highly unusual one night stand.\nDoes this explain how there can be effort involved in resisting temptation?\nEGO-DEPLETION\nBaumeister et al.: it seems that the will does resemble a muscle. Complications: Choice also causes\nego depletion. Prior resolutions seem to prevent ego-depletion.\nMISCHEL'S FINDINGS\nSEPARATE NEURAL SYSTEMS: MCCLURE ET AL.\n-- 2 --"
    },
    {
      "category": "Resource",
      "title": "X Strength of Will: More Normative Issues",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/56245b95d45a27f8891cae3d225011f3_MIT24_120s09_lec10.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\n24.120 MORAL PSYCHOLOGY\nRICHARD HOLTON\nX Strength of Will: More Normative Issues\nTWO VERSIONS OF THE LINKING PRINCIPLE AND A PRINCIPLE LINKING THEM\nWeak Link: I shouldn't form an intention that I now believe I should, at the time of action, rationally reconsider and revise\nStrong Link: I shouldn't form an intention that I now believe that if I were, at the time of action, to reconsider, I should\nrationally revise\nRational Reconsideration Principle: If I now believe that if I were to reconsider at the time of action I would reasonably\nrevise, then I should reconsider at that time.\nA COUNTEREXAMPLE TO STRONG LINK\nYou are defending your ship. Your instruments tell you that you are being attacked from\nsomewhere in a 30 arc to the North East. If you waited and calculated you could find out the\nexact position of the attacker. But you are anticipating further attacks that will need your\nattention. Rather than waiting, finding the exact position of the attacker, and responding with\na single missile, you form the intention of launching, when the optimum time comes, a barrage of\nmissiles to cover the whole arc. In effect you trade missiles for time to attend elsewhere.\nTHE RATIONALITY OF STRONG RESOLUTION\nThere is a difference between (i) reconsidering a resolution, deciding that it would be rational to\nrevise and then not revising; and (ii) not reconsidering even if, were you to reconsider, you would\nthink it rational to revise. The former is irrational; the latter is not. Does this make rationality\ntoo fragile? Not if reconsideration is an involved business. Perhaps you only come to a judgment\nabout what is best subsequent to the formation of an intention\nEXPLAINING WHAT IS RIGHT ABOUT THE NO-REGRET CONSITION\nRegret as indicating substantial mistake concerting one's choice (not constituting formal mistake).\nBACK TO KAVKA AND THE OTHER PARADOXES\nMaybe we are in fact not so constituted that we could form the intention; but that doesn't\nshow that it would be irrational. Consider how we would bring up in children in a world in\nwhich there were many toxin cases.\nNow think about how we morally bring up children. We teach them not to reopen the question\nof what to do once they have promised. And more generally we teach them not to reopen the\nquestion of what to do once they have knowingly induced someone to rely on them. Perahps\nthis is a central moral skill.\nWhat about Newcomb cases? There things are somewhat different, in that there is no prior\ncommitment. But suppose we got people to commit to a Newcomb policy; and suppose they\ncommitted to one-boxing. Would they then be irrational if they failed to reconsider that\npolicy when the time came to act?"
    },
    {
      "category": "Resource",
      "title": "Sermon XI in Fifteen Sermons",
      "type": "PDF",
      "source_url": "https://ocw.mit.edu/courses/24-120-moral-psychology-spring-2009/ca9a78c34e6c4304618aa37aca5a5f0c_MIT24_120s09_read01.pdf",
      "content": "MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.120 Moral Psychology\nSpring 2009\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms.\n\nBishop Joseph Butler\nFifteen Sermons (1726)\nSERMON XI UPON THE LOVE OF OUR NEIGHBOUR\n(I)\nIT is commonly observed, that there is a disposition in men to complain of the\nviciousness and corruption of the age in which they live, as greater than that of former\nones; which is usually followed with this further observation, that mankind has been in\nthat respect much the same in all times. Now, not to determine whether this last be not\ncontradicted by the accounts of history; thus much can scarce be doubted, that vice and\nfolly takes different turns, and some particular kinds of it are more open and avowed in\nsome ages than in others: and, I suppose, it may be spoken of as very much the distinction\nof the present to profess a contracted spirit, and greater regards to self-interest, than\nappears to have been done formerly. Upon this account it seems worth while to inquire\nwhether private interest is likely to be promoted in proportion to the degree in which self-\nlove engrosses us, and prevails over all other principles; or whether the contracted affection may not\npossibly be so prevalent as to disappoint itself, and even contradict its own end, private good.\n(2)\nAnd since further, there is generally thought to be some peculiar kind of\ncontrariety between self-love and the love of our neighbour, between the pursuit of public\nand of private good; insomuch that when you are recommending one of these, you are\nsupposed to be speaking against the other; and from hence arises a secret prejudice against,\nand frequently open scorn of, all talk of public spirit, and real good-will to our fellow-\ncreatures; it will be necessary to inquire what respect benevolence hath to self-love, and the pursuit of\nprivate interest to the pursuit of public: or whether there be anything of that peculiar inconsistence\nand contrariety between them, over and above what there is between self-love and other\npassions and particular affections, and their respective pursuits.\n(3)\nThese inquiries, it is hoped, may be favourably attended to: for there shall be all\npossible concessions made to the favourite passion, which hath so much allowed to it, and\nwhose cause is so universally pleaded: it shall be treated with the utmost tenderness and\nconcern for its interests.\n(4)\nIn order to this, as well as to determine the forementioned questions, it will be\nnecessary to consider the nature, the object and end of that self-love, as distinguished from other principles or\naffections in the mind, and their respective objects.\n(5)\nEvery man hath a general desire of his own happiness; and likewise a variety of\nparticular affections, passions and appetites to particular external objects. The former\n\nproceeds from, or is self-love; and seems inseparable from all sensible creatures, who can\nreflect upon themselves and their own interest or happiness, so as to have that interest an\nobject to their minds: what is to be said of the latter is, that they proceed from, or together\nmake up that particular nature, according to which man is made. The object the former\npursues is somewhat internal, our own happiness, enjoyment, satisfaction; whether we have,\nor have not, a distinct particular perception what it is, or wherein it consists: the objects of\nthe latter are this or that particular external thing, which the affections tend towards, and\nof which it hath always a particular idea or perception. The principle we call self-love\nnever seeks anything external for the sake of the thing, but only as a means of happiness or\ngood: particular affections rest in the external things themselves. One belongs to man as a\nreasonable creature reflecting upon his own interest or happiness. The other, though quite\ndistinct from reason, are as much a part of human nature.\n(6)\nThat all particular appetites and passions are towards external things themselves,\ndistinct from the pleasure arising from them, is manifested from hence; that there could not be\nthis pleasure, were it not for that prior suitableness between the object and the passion:\nthere could be no enjoyment or delight from one thing more than another, from eating\nfood more than from swallowing a stone, if there were not an affection or appetite to one\nthing more than another.\n(7)\nEvery particular affection, even the love of our neighbour, is as really our own\naffection, as self-love; and the pleasure arising from its gratification is as much my own\npleasure, as the pleasure self-love would have, from knowing I myself should be happy\nsome time hence, would be my own pleasure. And if, because every particular affection is a man's\nown, and the pleasure arising from its gratification his own pleasure, or pleasure to himself, such particular\naffection must be called self-love; according to this way of speaking, no creature whatever can possibly act but\nmerely from self-love; and every action and every affection whatever is to be resolved up into this one principle.\nBut, then, this is not the language of mankind: or if it were, we should want words to express the difference\nbetween the principle of an action, proceeding from cool consideration that it will be to my own advantage; and\nan action, suppose of revenge, or of friendship, by which a man runs upon certain ruin, to do evil or good to\nanother. It is manifest the principles of these actions are totally different, and so want different words to be\ndistinguished by: all that they agree in is, that they both proceed from, and are done to gratify, an inclination in\na man's self. But the principle or inclination in one case is self-love: in the other, hatred or love of another.\nThere is then a distinction between the cool principle of self-love, or general desire of our own happiness, as one\npart of our nature, and one principle of action; and the particular affections towards particular external objects,\nas another part of our nature, and another principle of action. How much soever therefore is to be allowed to\nself-love, yet it cannot be allowed to be the whole of our inward constitution; because, you see, there are other\nparts or principles which come into it.\n(8)\nFurther, private happiness or good is all which self-love can make us desire, or be\nconcerned about: in having this consists its gratification; it is an affection to ourselves; a\nregard to our own interest, happiness and private good: and in the proportion a man hath\n-- 2 --\n\nthis, he is interested, or a lover of himself. Let this be kept in mind; because there is\ncommonly, as I shall presently have occasion to observe, another sense put upon these\nwords. On the other hand, particular affections tend towards particular external things:\nthese are their objects: having these is their end: in this consists their gratification: no\nmatter whether it be, or be not, upon the whole, our interest or happiness. An action done\nfrom the former of these principles is called an interested action. An action proceeding\nfrom any of the latter has its denomination of passionate, ambitious, friendly, revengeful,\nor any other, from the particular appetite or affection from which it proceeds. Thus self-\nlove as one part of human nature, and the several particular principles as the other part,\nare, themselves, their objects and ends, stated and shewn.\n(9) From hence it will be easy to see, how far, and in what ways, each of these can\ncontribute and be subservient to the private good of the individual. Happiness does not\nconsist in self-love. The desire of happiness is no more the thing itself, than the desire of\nriches is the possession or enjoyment of them. People may love themselves with the most\nentire and unbounded affection, and yet be extremely miserable. Neither can self-love any\nway help them out, but by setting them on work to get rid of the causes of their misery, to\ngain or make use of those objects which are by nature adapted to afford satisfaction.\nHappiness or satisfaction consists only in the enjoyment of those objects, which are by\nnature suited to our several particular appetites, passions and affections. So that if self-love\nwholly engrosses us, and leaves no room for any other principle, there can be absolutely no\nsuch thing at all as happiness, or enjoyment of any kind whatever; since happiness consists\nin the gratification of particular passions, which supposes the having of them. Self-love,\nthen, does not constitute this or that to be our interest or good; but, our interest or good\nbeing constituted by nature and supposed, self-love only puts us upon obtaining and\nsecuring it. Therefore, if it be possible, that self-love may prevail and exert itself in a\ndegree or manner which is not subservient to this end; then it will not follow, that our\ninterest will be promoted in proportion to the degree in which that principle engrosses us,\nand prevails over others. Nay further, the private and contracted affection, when it is not\nsubservient to this end, private good, may, for anything that appears, have a direct contrary\ntendency and effect. And if we will consider the matter, we shall see that it often really has.\nDisengagement is absolutely necessary to enjoyment: and a person may have so steady and\nfixed an eye upon his own interest, whatever he places it in, as may hinder him from\nattending to many gratifications within his reach, which others have their minds free and open\nto. Over-fondness for a child is not generally thought to be for its advantage: and, if there\nbe any guess to be made from appearances, surely that character we call selfish is not the\nmost promising for happiness. Such a temper may plainly be and exert itself in a degree\nand manner which may give unnecessary and useless solicitude and anxiety, in a degree and\nmanner which may prevent obtaining the means and materials of enjoyment, as well as the\nmaking use of them. Immoderate self-love does very ill consult its own interest: and, how\nmuch soever a paradox it may appear, it is certainly true, that even from self-love we\nshould endeavour to get over all inordinate regard to, and consideration of ourselves. Every\n-- 3 --\n\none of our passions and affections hath its natural stint and bound, which may easily be\nexceeded; whereas our enjoyments can possibly be but in a determinate measure and\ndegree. Therefore such excess of the affection, since it cannot procure any enjoyment, must\nin all cases be useless; but is generally attended with inconveniences, and often is\ndownright pain and misery. This holds as much with regard to self-love as to all other\naffections. The natural degree of it, so far as it sets us on work to gain and make use of the\nmaterials of satisfaction, may be to our real advantage; but beyond or besides this, it is in\nseveral respects an inconvenience and disadvantage. Thus it appears, that private interest is\nso far from being likely to be promoted in proportion to the degree in which self-love\nengrosses us, and prevails over all other principles; that the contracted affection may be so prevalent\nas to disappoint itself and even contradict its own end, private good.\n(10)\n\"But who, except the most sordidly covetous, ever thought there was any rivalship\nbetween the love of greatness, honour, power, or between sensual appetites, and self-love?\nNo, there is a perfect harmony between them. It is by means of these particular appetites\nand affections that self-love is gratified in enjoyment, happiness and satisfaction. The\ncompetition and rivalship is between self-love and the love of our neighbour: that affection\nwhich leads us out of ourselves, makes us regardless of our own interest, and substitute\nthat of another in its stead.\" Whether then there be any peculiar competition and\ncontrariety in this case, shall now be considered.\n(11)\nSelf-love and interestedness was stated to consist in or be an affection to ourselves,\na regard to our own private good: it is therefore distinct from benevolence, which is an\naffection to the good of our fellow-creatures. But that benevolence is distinct from, that is,\nnot the same thing with self-love, is no reason for its being looked upon with any peculiar\nsuspicion; because every principle whatever, by means of which self-love is gratified, is\ndistinct from it: and all things which are distinct from each other are equally so. A man has\nan affection or aversion to another: that one of these tends to and is gratified by doing\ngood, that the other tends to and is gratified by doing harm, does not in the least alter the\nrespect which either one or the other of these inward feelings has to self-love. We use the\nword property so as to exclude any other persons having an interest in that of which we say a\nparticular man has the property. And we often use the word selfish so as to exclude in the\nsame manner all regards to the good of others. But the cases are not parallel: for though\nthat exclusion is really part of the idea of property; yet such positive exclusion, or bringing\nthis peculiar disregard to the good of others into the idea of self-love, is in reality adding\nto the idea, or changing it from what it was before stated to consist in, namely, in an\naffection to ourselves. This being the whole idea of self-love, it can no otherwise exclude\ngood-will or love of others, than merely by not including it, no otherwise, than it excludes\nlove of arts or of reputation, or of anything else. Neither on the other hand does\nbenevolence, any more than love of arts or reputation, exclude self-love. Love of our\nneighbour then has just the same respect to, is no more distant from self-love, than hatred\nof our neighbour, or than love or hatred of anything else. Thus the principles, from which\n-- 4 --\n\nmen rush upon certain ruin for the destruction of an enemy, and for the preservation of a\nfriend, have the same respect to the private affection, and are equally interested, or equally\ndisinterested: and it is of no avail, whether they are said to be one or the other. Therefore\nto those who are shocked to hear virtue spoken of as disinterested, it may be allowed that\nit is indeed absurd to speak thus of it; unless hatred, several particular instances of vice,\nand all the common affections and aversions in mankind, are acknowledged to be\ndisinterested too. Is there any less inconsistence between the love of inanimate things, or of\ncreatures merely sensitive, and self-love; than between self-love and the love of our\nneighbour? Is desire of and delight in the happiness of another any more a diminution of\nself-love, than desire of and delight in the esteem of another? They are both equally desire\nof and delight in somewhat external to ourselves : either both or neither are so. The object\nof self-love is expressed in the term self; and every appetite of sense, and every particular\naffection of the heart, are equally interested or disinterested, because the objects of them all\nare equally self or some-what else. Whatever ridicule therefore the mention of a\ndisinterested principle or action may be supposed to lie open to, must, upon the matter\nbeing thus stated, relate to ambition, and every appetite and particular affection, as much\nas to benevolence. And indeed all the ridicule, and all the grave perplexity, of which this\nsubject hath had its full share, is merely from words. The most intelligible way of speaking\nof it seems to be this: that self-love, and the actions done in consequence of it (for these\nwill presently appear to be the same as to this question) are interested; that particular\naffections towards external objects, and the actions done in consequence of those\naffections, are not so. But every one is at liberty to use words as he pleases. All that is here\ninsisted upon is, that ambition, revenge, benevolence, all particular passions whatever, and\nthe actions they produce, are equally interested or disinterested.\n(12)\nThus it appears that there is no peculiar contrariety between self-love and\nbenevolence; no greater competition between these, than between any other particular\naffections and self-love. This relates to the affections themselves. Let us now see whether\nthere be any peculiar contrariety between the respective courses of life which these\naffections lead to; whether there be any greater competition between the pursuit of private\nand of public good, than between any other particular pursuits and that of private good.\n(13)\nThere seems no other reason to suspect that there is any such peculiar contrariety,\nbut only that the course of action which benevolence leads to, has a more direct tendency\nto promote the good of others, than that course of action which love of reputation,\nsuppose, or any other particular affection leads to. But that any affection tends to the\nhappiness of another, does not hinder its tending to one's own happiness too. That others\nenjoy the benefit of the air and the light of the sun, does not hinder but that these are as\nmuch one's own private advantage now, as they would be if we had the property of them\nexclusive of all others. So a pursuit which tends to promote the good of another, yet may\nhave as great tendency to promote private interest, as a pursuit which does not tend to the\ngood of another at all, or which is mischievous to him. An particular affections whatever,\n-- 5 --\n\nresentment, benevolence, love of arts, equally lead to a course of action for their own\ngratification, i.e. the gratification of ourselves; and the gratification of each gives delight: so\nfar then it is manifest they have all the same respect to private interest. Now take into\nconsideration further, concerning these three pursuits, that the end of the first is the harm,\nof the second, the good of another, of the last, somewhat indifferent; and is there any\nnecessity, that these additional considerations should alter the respect, which we before saw\nthese three pursuits had to private interest; or render any one of them less conducive to it,\nthan any other? Thus one man's affection is to honour as his end; in order to obtain which\nhe thinks no pains too great. Suppose another with such a singularity of mind, as to have\nthe same affection to public good as his end, which he endeavours with the same labour to\nobtain. In case of success, surely the man of benevolence hath as great enjoyment as the\nman of ambition; they both equally having the end of their affections, in the same degree,\ntended to: but in case of disappointment, the benevolent man has clearly the advantage;\nsince endeavouring to do good considered as a virtuous pursuit, is gratified by its own\nconsciousness, i.e. is in a degree its own reward.\n(14)\nAnd as to these two, or benevolence and any other particular passions whatever,\nconsidered in a further view, as forming a general temper, which more or less disposes us\nfor enjoyment of all the common blessings of life, distinct from their own gratification: is\nbenevolence less the temper of tranquility and freedom than ambition or covetousness?\nDoes the benevolent man appear less easy with himself, from his love to his neighbour?\nDoes he less relish his being? Is there any peculiar gloom seated on his face? Is his mind\nless open to entertainment, to any particular gratification? Nothing is more manifest, than\nthat being in good humour, which is benevolence whilst it lasts, is itself the temper of\nsatisfaction and enjoyment.\n(15) Suppose then a man sitting down to consider how he might become most easy to\nhimself, and attain the greatest pleasure he could; all that which is his real natural\nhappiness. This can only consist in the enjoyment of those objects, which are by nature\nadapted to our several faculties. These particular enjoyments make up the sum total of our\nhappiness; and they are supposed to arise from riches, honours, and the gratification of\nsensual appetites. Be it so: yet none profess themselves so completely happy in these\nenjoyments, but that there is room left in the mind for others, if they were presented to\nthem: nay these, as much as they engage us, are not thought so high, but that human nature\nis capable even of greater. Now there have been persons in all ages, who have professed\nthat they found satisfaction in the exercise of charity, in the love of their neighbour, in\nendeavouring to promote the happiness of all they had to do with, and in the pursuit of\nwhat is just and right and good, as the general bent of their mind, and end of their life; and\nthat doing an action of baseness or cruelty would be as great violence to their self, as much\nbreaking in upon their nature, as any external force. Persons of this character would add, if\nthey might be heard, that they consider themselves as acting in the view of an infinite\nBeing, who is in a much higher sense the object of reverence and of love, than all the world\n-- 6 --\n\nbesides; and therefore they could have no more enjoyment from a wicked action done\nunder his eye, than the persons to whom they are making their apology could, if all\nmankind were the spectators of it; and that the satisfaction of approving themselves to his\nunerring judgment, to whom they thus refer all their actions, is a more continued settled\nsatisfaction than any this world can afford; as also that they have, no less than others, a\nmind free and open to all the common innocent gratifications of it, such as they are. And\nif we go no further, does there appear any absurdity in this? Will any one take upon him\nto say, that a man cannot find his account in this general course of life, as much as in the\nmost unbounded ambition, and the excesses of pleasure? Or that such a person has not\nconsulted so well for himself, for the satisfaction and peace of his own mind, as the\nambitious or dissolute man? And though the consideration, that God himself will in the\nend justify their taste, and support their cause, is not formally to be insisted upon here; yet\nthus much comes in, that all enjoyments whatever are much more clear and unmixed from\nthe assurance that they will end well. Is it certain then that there is nothing in these\npretensions to happiness? especially when there are not wanting persons, who have\nsupported themselves with satisfactions of this kind in sickness, poverty, disgrace, and in\nthe very pangs of death; whereas it is manifest all other enjoyments fall in these\ncircumstances. This surely looks suspicious of having somewhat in it. Self-love methinks\nshould be alarmed. May she not possibly pass over greater pleasures than those she is so\nwholly taken up with ?\n(16)\nThe short of the matter is no more than this. Happiness consists in the\ngratification of certain affections, appetites, passions, with objects which are by nature\nadapted to them. Self-love may indeed set us on work to gratify these; but happiness or\nenjoyment has no immediate connection with self-love, but arises from such gratification\nalone. Love of our neighbour is one of those affections. This, considered as a virtuous\nprinciple, is gratified by a consciousness of endeavouring to promote the good of others; but\nconsidered as a natural affection, its gratification consists in the actual accomplishment of\nthis endeavour. Now indulgence or gratification of this affection, whether in that\nconsciousness, or this accomplishment, has the same respect to interest, as indulgence of\nany other affection; they equally proceed from or do not proceed from self-love, they\nequally include or equally exclude this principle. Thus it appears, that benevolence and the\npursuit of public good hath at least as great respect to self-love and the pursuit of private good, as any other\nparticular passions, and their respective pursuits.\n(17)\nNeither is covetousness, whether as a temper or pursuit, any exception to this. For\nif by covetousness is meant the desire and pursuit of riches for their own sake, without any\nregard to, or consideration of the uses of them; this hath as little to do with self-love, as\nbenevolence hath. But by this word is usually meant, not such madness and total\ndistraction of mind, but immoderate affection to and pursuit of riches as possessions in\norder to some further end; namely, satisfaction, interest, or good. This therefore is not a\nparticular affection, or particular pursuit, but it is the general principle of self-love, and the\n-- 7 --\n\ngeneral pursuit of our own interest; for which reason, the word selfish is by every one\nappropriated to this temper and pursuit. Now as it is ridiculous to assert, that self-love and\nthe love of our neighbour are the same; so neither is it asserted, that following these\ndifferent affections hath the same tendency and respect to our own interest. The\ncomparison is not between self-love and the love of our neighbour; between pursuit of our\nown interest, and the interest of others: but between the several particular affections in\nhuman nature towards external objects, as one part of the comparison; and the one\nparticular affection to the good of our neighbour, as the other part of it: and it has been\nshewn that all these have the same respect to self-love and private interest.\n(18)\nThere is indeed frequently an inconsistence or interfering between self-love or\nprivate interest, and the several particular appetites, passions, affections, or the pursuits\nthey lead to. But this competition or interfering is merely accidental; and happens much\noftener between pride, revenge, sensual gratifications and private interest, than between\nprivate interest and benevolence. For nothing is more common, than to see men give\nthemselves up to a passion or an affection to their known prejudice and ruin, and in direct\ncontradiction to manifest and real interest, and the loudest calls of self-love: whereas the\nseeming competitions and interfering, between benevolence and private interest, relate\nmuch more to the materials or means of enjoyment, than to enjoyment itself. There is\noften an interfering in the former, when there is none in the latter. Thus as to riches: so\nmuch money as a man gives away, so much less will in his possession. Here is a real\ninterfering. But though a man cannot possibly give without lessening his fortune, yet there\nare multitudes might give without lessening their own enjoyment; because they may have\nmore than they can turn to any real use or advantage to themselves. Thus the more\nthought and time any one employs about the interests and good of others, he must\nnecessarily have less to attend his own; but he may have so ready and large a supply of his\nown wants, that such thought might be really useless to himself, though of great service\nand assistance to others.\n(19)\nThe general mistake, that there is some greater inconsistence between\nendeavouring to promote the good of another and self-interest, than between self-interest\nand pursuing anything else, seems, as hath already been hinted, to arise from our notions\nof property; and to be carried on by this property's being supposed to be itself our\nhappiness or good. People are so very much taken up with this one subject, that they seem\nfrom it to have formed a general way of thinking, which they apply to other things that\nthey have nothing to do with. Hence, in a confused and slight way, it might well be taken\nfor granted, that another's having no interest in an affection (i.e. his good not being the\nobject of it) renders, as one may speak, the proprietor's interest in it greater; and that if\nanother had an interest in it, this would render his less, or occasion that such affection\ncould not be so friendly to self-love, or conducive to private good, as an affection or\npursuit which has not a regard to the good of another. This, I say, might be taken for\ngranted, whilst it was not attended to, that the object of every particular affection is\n-- 8 --\n\nequally somewhat external to ourselves; and whether it be the good of another person, or\nwhether it be any other external thing, makes no alteration with regard to its being one's\nown affection, and the gratification of it one's own private enjoyment. And so far as it is\ntaken for granted, that barely having the means and materials of enjoyment is what\nconstitutes interest and happiness; that our interest or good consists in possessions\nthemselves, in having the property of riches, houses, lands, gardens, not in the enjoyment\nof them; so far it will even more strongly be taken for granted, in the way already\nexplained, that an affection's conducing to the good of another must even necessarily\noccasion it to conduce less to private good, if not to be positively detrimental to it. For, if\nproperty and happiness are one and the same thing, as by increasing the property of\nanother, you lessen your own property, so by promoting the happiness of another you\nmust lessen your own happiness. But whatever occasioned the mistake, I hope it has been\nfully proved to be one; as it has been proved, that there is no peculiar rivalship or\ncompetition between self-love and benevolence; that as there may be a competition\nbetween these two, so there may also between any particular affection whatever and self-\nlove; that every particular affection, benevolence among the rest, is subservient to self-love\nby being the instrument of private enjoyment; and that in one respect benevolence\ncontributes more to private interest, i.e. enjoyment or satisfaction, than any other of the\nparticular common affections, as it is in a degree its own gratification.\n(20)\nAnd to all these things may be added, that religion, from whence arises our\nstrongest obligation to benevolence, is so far from disowning the principle of self-love,\nthat it often addresses itself to that very principle, and always to the mind in that state\nwhen reason presides; and there can no access be had to the understanding, but by\nconvincing men, that the course of life we would persuade them to is not contrary to their\ninterest. It may be allowed, without any prejudice to the cause of virtue and religion, that\nour ideas of happiness and misery are of all our ideas the nearest and most important to us;\nthat they will, nay, if you please, that they ought to prevail over those of order, and beauty,\nand harmony, and proportion, if there should ever be, as it is impossible there ever should\nbe, any inconsistence between them: though these last too, as expressing the fitness of\nactions, are real as truth itself. Let it be allowed, though virtue or moral rectitude does\nindeed consist in affection to and pursuit of what is right and good, as such; yet, that when\nwe sit down in a cool hour, we can neither justify to ourselves this or any other pursuit, till\nwe are convinced that it will be for our happiness, or at least not contrary to it.\n(21)\nCommon reason and humanity will have some influence upon mankind, whatever\nbecomes of speculations: but, so far as the interests of virtue depend upon the theory of it\nbeing secured from open scorn, so far its very being in the world depends upon its\nappearing to have no contrariety to private interest and self-love. The foregoing\nobservations therefore, it is hoped, may have gained a little ground in favour of the precept\nbefore us; the particular explanation of which shall be the subject of the next Discourse.\n-- 9 --\n\n(22)\nI will conclude at present, with observing the peculiar obligation which we are\nunder to virtue and religion, as enforced in the verses following the text, in the epistle for\nthe day, from our Saviour's coming into the world. The night is far spent, the day is at hand; let us\ntherefore cast off the works of darkness, and let us put on the armour of light, etc. The meaning and force\nof which exhortation is, that Christianity lays us under new obligations to a good life, as\nby it the will of God is more clearly revealed, and as it affords additional motives to the\npractice of it, over and above those which arise out of the nature of virtue and vice; I might\nadd, as our Saviour has set us a perfect example of goodness in our own nature. Now love\nand charity is plainly the thing in which he hath placed his religion; in which therefore, as\nwe have any pretence to the name of Christians, we must place ours. He hath at once\nenjoined it upon us by way of command with peculiar force; and by his example, as having\nundertaken the work of our salvation out of pure love and good-will to mankind. The\nendeavour to set home this example upon our minds is a very proper employment of this\nseason, which is bringing on the festival of his birth: which as it may teach us many\nexcellent lessons of humility, resignation and obedience to the will of God; so there is none\nit recommends with greater authority, force and advantage, than this of love and charity;\nsince it was for us men, and for our salvation, that he came down from heaven, and was incarnate, and\nwas made man; that he might teach us our duty, and more especially that he might enforce\nthe practice of it, reform mankind, and finally bring us to that eternal salvation, of which he is\nthe Author to all those that obey him.\n-- 10 --"
    }
  ]
}